[
    {
        "source_sentence": "佛說齋經",
        "translation": "Foshuo jie jing",
        "source": "T01n0087_001:0910c26_0"
    },
    {
        "source_sentence": "吳月氏國居士支謙譯",
        "translation": "Wu Yue's translation by Zhi Qian, the national treasurer of Wu Yue",
        "source": "T01n0087_001:0910c28_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛城東丞相家殿。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Sāvatthī, in the palace of the house of the chancellor to the east of the city.",
        "source": "T01n0087_001:0910c29_0"
    },
    {
        "source_sentence": "丞相母名維耶，早起沐浴著綵衣，與諸子婦俱出，稽首佛足，一面坐。",
        "translation": "The chancellor's mother, named Vaiśravaṇa, got up early in the morning to bathe and put on a silk-colored robe. She came out with her children and wives, bowed their heads at the Buddha's feet, and sat to one side.",
        "source": "T01n0087_001:0910c29_1"
    },
    {
        "source_sentence": "佛問維耶：「沐浴何早？」",
        "translation": "The Buddha asked Vaiśravaṇa, What's the time for bathing?",
        "source": "T01n0087_001:0911a02_2"
    },
    {
        "source_sentence": "對曰：「欲與諸婦俱受齋戒。」",
        "translation": "He said, I want to accept the precepts with my wives.",
        "source": "T01n0087_001:0911a02_3"
    },
    {
        "source_sentence": "佛言：「齋有三輩，樂何等齋？」",
        "translation": "The Buddha said, There are three kinds of purification, so what's the pleasant purification?",
        "source": "T01n0087_001:0911a03_4"
    },
    {
        "source_sentence": "維耶長跪言：「願聞何謂三齋。」",
        "translation": "Vaiśravaṇa knelt down and said, May I hear what the three precepts are?",
        "source": "T01n0087_001:0911a04_5"
    },
    {
        "source_sentence": "佛言：「一為牧牛齋，二為尼犍齋，三為佛法齋。",
        "translation": "The Buddha said, One is a ritual for raising cattle, two are a ritual for Nirgrantha, and three are a ritual for the Buddha's teaching.",
        "source": "T01n0087_001:0911a04_6"
    },
    {
        "source_sentence": "牧牛齋者，如牧牛人求善水草飲飼其牛，暮歸思念何野有豐饒，須天明當復往。",
        "translation": "A cowherd's purification is like a cowherd who seeks good water and grass to feed his cow and drinks it. When he returns in the evening, he thinks, 'Where there's plenty of wilderness that requires heavenly light to go back?'",
        "source": "T01n0087_001:0911a05_7"
    },
    {
        "source_sentence": "若族姓男女已受齋戒，意在家居利欲產業，及念美飲食育養身者，是為如彼牧牛人意，",
        "translation": "If clansmen and women who have undertaken the precepts wish to live at home, benefit from their desires and property, and nourish themselves with delicious food and drink. This is what the herdsman thinks.",
        "source": "T01n0087_001:0911a07_8"
    },
    {
        "source_sentence": "不得大福、非大明。",
        "translation": "They won't attain great merit or great insight.",
        "source": "T01n0087_001:0911a09_9"
    },
    {
        "source_sentence": "「尼犍齋者，當月十五日齋之時，伏地受齋戒，為十由延內諸神拜言：『我今日齋，",
        "translation": "On the fifteenth day of the nirgrantha month, on the occasion of a purification ceremony, he prostrates his body and receives the ordination precepts. He pays homage to the deities within the ten yojanas who say, “Today I am fasting.",
        "source": "T01n0087_001:0911a10_0"
    },
    {
        "source_sentence": "不敢為惡；",
        "translation": "They did not dare do evil.",
        "source": "T01n0087_001:0911a11_1"
    },
    {
        "source_sentence": "不名有家，彼我無親，妻子奴婢非是我有，我非其主。』",
        "translation": "It's not called having a home, for which I have no relatives, wives, children, or servants aren't possessed by me, and I'm not their owner.'",
        "source": "T01n0087_001:0911a12_2"
    },
    {
        "source_sentence": "然其學，貴文賤質無有正心，至到明日相，名有如故。",
        "translation": "However, their training is noble and inferior in quality but lacks the right mind. When it comes to tomorrow's appearance, it's called thus-and-so.",
        "source": "T01n0087_001:0911a13_3"
    },
    {
        "source_sentence": "事齋如彼者，不得大福、非大明。",
        "translation": "Those who serve purification like that won't attain great merit or great insight.",
        "source": "T01n0087_001:0911a14_4"
    },
    {
        "source_sentence": "「佛法齋者，道弟子月六齋之日受八戒。",
        "translation": "The Buddha's Dharma purification is when a disciple of the Way receives the eight precepts on the sixth day of the month's purification.",
        "source": "T01n0087_001:0911a15_5"
    },
    {
        "source_sentence": "何謂八？",
        "translation": "What are the eight?",
        "source": "T01n0087_001:0911a16_0"
    },
    {
        "source_sentence": "「第一戒者，盡一日一夜持，心如真人，無有殺意、慈念眾生，不得賊害蠕動之類，",
        "translation": "“The first precept is to observe it for one day and night with a mind like a true buddha, without the intention of killing or compassion for sentient beings, so as not to harm thieves and wriggling animals.",
        "source": "T01n0087_001:0911a17_0"
    },
    {
        "source_sentence": "不加刀杖，念欲安利莫復為殺，如清淨戒以一心習。",
        "translation": "They don't put up a sword or stick, and their thoughts of wanting to be comfortable and not killing are like the pure precepts that are cultivated with one mind.",
        "source": "T01n0087_001:0911a18_1"
    },
    {
        "source_sentence": "「第二戒者，盡一日一夜持，心如真人，無貪取意、思念布施，當歡喜與、自手與、潔淨與、恭敬與、不望與，",
        "translation": "“The second precept is that when a bhikṣu observes the precepts for one day and night, his mind behaves as if he were a true buddha. He has no craving or thoughts of grasping [the precepts] and practices generosity. He should give with joy, give with his own hands, give with cleanliness, give with reverence, and give",
        "source": "T01n0087_001:0911a21_0"
    },
    {
        "source_sentence": "却慳貪意，如清淨戒以一心習。",
        "translation": "He stops stinginess and greed, like the pure precepts that are cultivated with one mind.",
        "source": "T01n0087_001:0911a23_1"
    },
    {
        "source_sentence": "「第三戒者，一日一夜持，心如真人，無婬意、不念房室，修治梵行，",
        "translation": "“The third precept is to observe it for one day and night with a mind like a true buddha, without ill-will or thoughts of living quarters, cultivating the holy life.",
        "source": "T01n0087_001:0911a24_0"
    },
    {
        "source_sentence": "不為邪欲、心不貪色，如清淨戒以一心習。",
        "translation": "They aren't subject to wrong desires and don't cling to form in their minds, like the pure precepts that are cultivated with one mind.",
        "source": "T01n0087_001:0911a25_1"
    },
    {
        "source_sentence": "「第四戒者，一日一夜持，心如真人，無妄語意，思念至誠、安定徐言，",
        "translation": "“The fourth precept is to observe the precepts for one day and night with a mind like a true buddha, without false speech or thought.",
        "source": "T01n0087_001:0911a27_0"
    },
    {
        "source_sentence": "不為偽詐、心口相應，如清淨戒以一心習。",
        "translation": "They aren't hypocritical or associated with mind and speech, like the pure precepts that are cultivated with one mind.",
        "source": "T01n0087_001:0911a28_1"
    },
    {
        "source_sentence": "「第五戒者，一日一夜持，心如真人，不飲酒、不醉、不迷亂、不失志，",
        "translation": "“The fifth precept is not to drink alcohol, not to get drunk, not to be confused, and not to lose control of one’s mind for a day and night.",
        "source": "T01n0087_001:0911b01_0"
    },
    {
        "source_sentence": "去放逸意，如清淨戒以一心習。",
        "translation": "He's free of the thought of carelessness, just like the pure precepts that are cultivated with one mind.",
        "source": "T01n0087_001:0911b02_1"
    },
    {
        "source_sentence": "「第六戒者，一日一夜持，心如真人，無求安意，不著華香、不傅脂粉、不為歌舞倡樂，",
        "translation": "“The sixth precept is to observe it for one day and night with a mind like a true buddha, without seeking peace of mind. Not clinging to flowers or fragrances, not eating fat or flour, not singing, dancing, or playing music.",
        "source": "T01n0087_001:0911b04_0"
    },
    {
        "source_sentence": "如清淨戒以一心習。",
        "translation": "It's like the pure precepts that are cultivated with one mind.",
        "source": "T01n0087_001:0911b05_1"
    },
    {
        "source_sentence": "「第七戒者，一日一夜持，心如真人，無求安意，不臥好床，卑床草席，",
        "translation": "“The seventh precept is to observe it for one day and night with a mind like a true buddha, without seeking peace of mind or lying on a good bed or a lowly grass seat.",
        "source": "T01n0087_001:0911b07_0"
    },
    {
        "source_sentence": "捐除睡臥，思念經道，如清淨戒以一心習。",
        "translation": "He abandons drowsiness and lying down and reflects on the sūtras and paths, just as he cultivates pure precepts with a single mind.",
        "source": "T01n0087_001:0911b08_1"
    },
    {
        "source_sentence": "「第八戒者，一日一夜持，心如真人，奉法時食，食少節身，過日中後不復食，",
        "translation": "“The eighth precept is to observe it for one day and night, with minds like a true buddha. Eat according to the time of the Dharma at the right time; eat sparing only a small amount of food [to maintain the precepts], and do not eat again after midday.",
        "source": "T01n0087_001:0911b10_0"
    },
    {
        "source_sentence": "如清淨戒以一心習。」",
        "translation": "It's like the pure precepts that are cultivated with one mind.",
        "source": "T01n0087_001:0911b11_1"
    },
    {
        "source_sentence": "佛告維耶：「受齋之日當習五念。",
        "translation": "The Buddha told Vaiśravaṇa, On the day he receives purification, he should cultivate five kinds of mindfulness.",
        "source": "T01n0087_001:0911b13_0"
    },
    {
        "source_sentence": "何謂五？",
        "translation": "What are the five?",
        "source": "T01n0087_001:0911b13_1"
    },
    {
        "source_sentence": "「一當念佛。",
        "translation": "One, he should be mindful of the Buddha.",
        "source": "T01n0087_001:0911b14_0"
    },
    {
        "source_sentence": "佛為如來，為至真，為等正覺，為明行足，為善逝、世間父、無上士、經法御、天人師，",
        "translation": "The Buddha is the Tathāgata, the Supreme Truth, the Completely Enlightened One, the Perfectly Enlightened One, the fulfiller of knowledge and conduct, the Well-gone One, the father of all beings in the world, the unsurpassed one, the teacher of scriptures, the Dharma king, and the teacher of gods and humans.",
        "source": "T01n0087_001:0911b14_1"
    },
    {
        "source_sentence": "號曰佛。",
        "translation": "His name was Buddha.",
        "source": "T01n0087_001:0911b16_0"
    },
    {
        "source_sentence": "是念佛者，愚癡惡意怒習悉除，善心自生思樂佛業。",
        "translation": "This is mindfulness of the Buddha, which removes the habituated tendencies of folly and bad thoughts and anger and produces a good mind that delights in contemplating buddha-actions.",
        "source": "T01n0087_001:0911b16_1"
    },
    {
        "source_sentence": "譬如以麻油澡豆沐頭，垢濁得除。",
        "translation": "It's like washing your hair with sesame oil and bathing it in beans, which remove dirt and dirt.",
        "source": "T01n0087_001:0911b17_2"
    },
    {
        "source_sentence": "齋念佛者，其淨如是，眾人見之莫不好信。",
        "translation": "The purity of those who fast to the Buddha's name is like this, and when people see it, they don't believe it.",
        "source": "T01n0087_001:0911b18_3"
    },
    {
        "source_sentence": "「二當念法。",
        "translation": "Second, he should be mindful of the teaching.",
        "source": "T01n0087_001:0911b20_0"
    },
    {
        "source_sentence": "佛所說法三十七品，具足不毀思念勿忘，當知此法為世間明。",
        "translation": "The thirty-seven chapters of the Buddha's teaching are complete, and don't disparage them or forget them; you should know that this teaching is worldly insight.",
        "source": "T01n0087_001:0911b20_1"
    },
    {
        "source_sentence": "是念法者，愚癡惡意怒習悉除，善心自生用樂法業。",
        "translation": "This is the method of mindfulness, which removes the habituated tendencies of foolishness and bad thoughts and anger and produces good thoughts that benefit Dharma actions on their own.",
        "source": "T01n0087_001:0911b21_2"
    },
    {
        "source_sentence": "譬如以麻油澡豆浴身，垢濁得除。",
        "translation": "It's like bathing your body with sesame oil and beans, which remove dirt and dirt.",
        "source": "T01n0087_001:0911b22_3"
    },
    {
        "source_sentence": "齋念法者，其淨如是，眾人見之莫不好信。",
        "translation": "The purity of those who fast and remember the Dharma is like this, so many people don't believe it when they see it.",
        "source": "T01n0087_001:0911b23_4"
    },
    {
        "source_sentence": "「三當念眾。",
        "translation": "Three, you should be mindful of the multitude.",
        "source": "T01n0087_001:0911b25_0"
    },
    {
        "source_sentence": "恭敬親附依受慧教，佛弟子眾，有得溝港受、溝港證者，有得頻來受、頻來證者，",
        "translation": "Those among the Buddha’s disciples who respectfully and intimately assented to the teaching of wisdom relying on it. Some were able to receive it at ditches and realize it at ditches; some came frequently to receive it and realized it at frequent intervals.",
        "source": "T01n0087_001:0911b25_1"
    },
    {
        "source_sentence": "有得不還受、不還證者，有得應真受、應真證者，是為四雙之八輩丈夫，",
        "translation": "Those who have attained acceptance without returning and realization without returning, those who have attained true acceptance and true realization—these are the four pairs of eight groups of husbands.",
        "source": "T01n0087_001:0911b27_0"
    },
    {
        "source_sentence": "皆為戒成、定成、慧成、解成、度知見成，為聖德、為行具，當為叉手天上天下尊者福田。",
        "translation": "They are all for the accomplishment of precepts, concentration, wisdom, understanding, liberation, the accomplishment of knowledge and vision, noble virtue, and the fulfillment of practice, and they'll become the field of merit of the venerable monk in the upper heaven with palms joined.",
        "source": "T01n0087_001:0911b28_1"
    },
    {
        "source_sentence": "是念眾，愚癡惡意怒習悉除，喜心自生樂眾之業。",
        "translation": "This mindfulness of sentient beings is free of the habituated habit of foolishness, bad intentions, and anger, and the joyful mind produces its own pleasant actions for sentient beings.",
        "source": "T01n0087_001:0911c01_2"
    },
    {
        "source_sentence": "譬如以淳灰浣衣，垢污得除。",
        "translation": "It's like washing your clothes with pure ashes and getting rid of dirt.",
        "source": "T01n0087_001:0911c02_3"
    },
    {
        "source_sentence": "齋念眾者，其德如是，眾人見之莫不好信。",
        "translation": "Such is the virtue of those who are mindful of the congregation on fast days, and when they see them, no one doesn't believe them.",
        "source": "T01n0087_001:0911c03_4"
    },
    {
        "source_sentence": "「四者念戒。",
        "translation": "The fourth is mindfulness of precepts.",
        "source": "T01n0087_001:0911c05_0"
    },
    {
        "source_sentence": "身受佛戒一心奉持，不虧不犯、不動不忘、善立慎護、為慧者舉、後無所悔、不以有望、能等教人。",
        "translation": "He receives the Buddha's precepts with one mind and observes them without fail, doesn't violate them, doesn't move or forget them, is well-established and cautious, raises them for the sake of wise people, has no regrets later, doesn't look forward to them, and can teach them equally.",
        "source": "T01n0087_001:0911c05_1"
    },
    {
        "source_sentence": "是念戒者，愚癡惡意怒習悉除，喜心自生樂戒統業。",
        "translation": "This is mindfulness of precepts that removes the habituated tendencies of foolishness, bad intentions, and anger, and which naturally produces a joyful mind that's blissful in morality and unified action.",
        "source": "T01n0087_001:0911c07_2"
    },
    {
        "source_sentence": "如鏡之磨，垢除盛明。",
        "translation": "It's like the polish of a mirror that removes dirt and shines brightly.",
        "source": "T01n0087_001:0911c08_3"
    },
    {
        "source_sentence": "齋念戒者，其淨如是，眾人見之莫不好信。",
        "translation": "The purity of those who observe the precepts is like this, and people don't believe it when they see it.",
        "source": "T01n0087_001:0911c09_0"
    },
    {
        "source_sentence": "「五當念天。",
        "translation": "Five should be mindful of the gods.",
        "source": "T01n0087_001:0911c09_1"
    },
    {
        "source_sentence": "第一四天王，第二忉利天，鹽天，兜術天，不憍樂天，化應聲天，當自念：『我以有信、有戒、有聞、有施、有智，",
        "translation": "The first four heavenly kings, the second, Trāyastriṃśa gods, the salt gods, the Tuṣita gods, the Nirmāṇarati gods, and the Nirmāṇarati gods should think to themselves, ‘With faith, morality, learning, generosity, and wisdom, I am able to attain enlightenment.",
        "source": "T01n0087_001:0911c10_2"
    },
    {
        "source_sentence": "至身死時精神上天，願不失信戒聞施智。』",
        "translation": "When he reaches the body and dies, his spirit goes up to heaven, wishing that he won't lose faith in the precepts and hears about generosity.'",
        "source": "T01n0087_001:0911c12_3"
    },
    {
        "source_sentence": "是念天者，愚癡惡意怒習悉除，喜心自生樂天統業。",
        "translation": "This is the god of mindfulness, which removes the habituated tendencies of foolishness and bad thoughts and anger and creates a joyful mind that produces its own happiness in the heavenly unity of karma.",
        "source": "T01n0087_001:0911c13_4"
    },
    {
        "source_sentence": "譬如寶珠，常治清明。",
        "translation": "It's like a precious pearl that always cures clarity.",
        "source": "T01n0087_001:0911c14_5"
    },
    {
        "source_sentence": "齋念天者，其淨如是。",
        "translation": "The purity of those who fast in the heavens is like this.",
        "source": "T01n0087_001:0911c15_6"
    },
    {
        "source_sentence": "「奉持八戒，習五思念，為佛法齋，與天參德，滅惡興善，後生天上，",
        "translation": "Having observed the eight precepts and cultivated five kinds of mindfulness, he practiced purification for the sake of the buddha-dharma. He was accompanied by heavenly virtue, extinguished evil and promoted wholesomeness, and was reborn in heaven.",
        "source": "T01n0087_001:0911c15_7"
    },
    {
        "source_sentence": "終得泥洹。",
        "translation": "They'll eventually attain nirvāṇa.",
        "source": "T01n0087_001:0911c16_8"
    },
    {
        "source_sentence": "是以智者自力行，出心作福。",
        "translation": "That's why a wise person acts with self-power and produces merit from his mind.",
        "source": "T01n0087_001:0911c17_9"
    },
    {
        "source_sentence": "「如是，維耶！",
        "translation": "“So it is, Vaiśravaṇa!",
        "source": "T01n0087_001:0911c18_0"
    },
    {
        "source_sentence": "齋之福祐明譽廣遠，譬是天下十六大國，是十六國滿中眾寶不可稱數，",
        "translation": "The blessings and merits of the fast are so vast as to be likened to the sixteen great kingdoms under heaven, which are filled with innumerable treasures among the sixteen kingdoms.",
        "source": "T01n0087_001:0911c18_1"
    },
    {
        "source_sentence": "不如一日受佛法齋。",
        "translation": "It's not as good as accepting the Buddha's Dharma purification for a day.",
        "source": "T01n0087_001:0911c19_2"
    },
    {
        "source_sentence": "如比其福者，則十六國為一豆耳。",
        "translation": "If we compare it to their merits, then the sixteen countries are one bean.",
        "source": "T01n0087_001:0911c20_3"
    },
    {
        "source_sentence": "天上廣遠不可稱說，當今人間五十歲，為第一天上一日一夜，第一四天上壽五百歲，",
        "translation": "The duration of life in the first heaven is one day and night. The duration of life in the fourth heaven is five hundred years:",
        "source": "T01n0087_001:0911c21_4"
    },
    {
        "source_sentence": "彼當人間九百萬歲。",
        "translation": "It will be 9 million years old among humans.",
        "source": "T01n0087_001:0911c23_5"
    },
    {
        "source_sentence": "佛法齋者，得生此天上。",
        "translation": "A person who observes the purification of the Buddha's teaching will be born in this heaven.",
        "source": "T01n0087_001:0911c23_6"
    },
    {
        "source_sentence": "人間百歲為忉利天上一日一夜，忉利天壽千歲，當人間三千六百萬歲。",
        "translation": "A hundred years in the human world is one day and night in Trāyastriṃśa Heaven. The duration of life in Trāyastriṃśa Heaven is one thousand years, corresponding to three thousand six million years in the human world.",
        "source": "T01n0087_001:0911c24_7"
    },
    {
        "source_sentence": "人間二百歲為鹽天上一日一夜，鹽天壽二千歲，當人間一億五千二百萬歲。",
        "translation": "Two hundred years in the human world is one day and night in the salt gods. The duration of life in the salt gods is two thousand years, corresponding to one hundred million five thousand two hundred million years in the human world.",
        "source": "T01n0087_001:0911c25_8"
    },
    {
        "source_sentence": "人間四百歲為兜術天上一日一夜，兜術天壽四千歲，當人間六億八百萬歲。",
        "translation": "The duration of life in the Tuṣita heaven is four thousand years, corresponding to six hundred million and eight million years in the world.",
        "source": "T01n0087_001:0911c27_9"
    },
    {
        "source_sentence": "人間八百歲為不驕樂天上一日一夜，不驕樂天壽八千歲，當人間二十三億四千萬歲。",
        "translation": "Eight hundred years in the human world is one day and night in the heaven of no pride”®*°. The duration of life of the gods who do not rejoice is eight thousand years: this corresponds to twenty-three hundred million, four thousand years in the human world.",
        "source": "T01n0087_001:0911c29_10"
    },
    {
        "source_sentence": "人間千六百歲為化應聲天上一日一夜，化應聲天壽萬六千歲，當人間九十二億一千六百萬歲。",
        "translation": "The duration of life of the gods in Nirmāṇarati’s heaven is one thousand years:",
        "source": "T01n0087_001:0912a02_11"
    },
    {
        "source_sentence": "若人有信、有戒、有聞、有施、有智奉佛法齋，當命盡時，其人精神，",
        "translation": "If someone has faith, observes the precepts, is learned in Buddhism, practices generosity, and possesses wisdom, then when their life comes to an end they will attain enlightenment.",
        "source": "T01n0087_001:0912a04_12"
    },
    {
        "source_sentence": "皆生此六天上，安隱快樂。",
        "translation": "They'll all be born in these six heavens, where they'll be peaceful and happy.",
        "source": "T01n0087_001:0912a05_13"
    },
    {
        "source_sentence": "猗善眾多我少說耳，凡人行善，魂神上天受福無量。」",
        "translation": "I'll explain only a little about the many good qualities of Vaiśravaṇa, which are that ordinary people who perform good deeds receive measureless merit in their souls, spirits, and heavenly beings.",
        "source": "T01n0087_001:0912a06_14"
    },
    {
        "source_sentence": "維耶聞佛語，歡喜言：「善哉善哉！",
        "translation": "When Vaiśravaṇa heard the Buddha's words, he rejoiced and said, Good, good!",
        "source": "T01n0087_001:0912a07_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0087_001:0912a08_16"
    },
    {
        "source_sentence": "齋之福德甚快無量，願受佛戒。",
        "translation": "The merit of the fast is immeasurable, and I wish to receive the Buddha's precepts.",
        "source": "T01n0087_001:0912a08_17"
    },
    {
        "source_sentence": "從今已後月月六齋，竭力作福至死。」",
        "translation": "From now on, he'll perform meritorious deeds up to his death every sixth month.",
        "source": "T01n0087_001:0912a09_18"
    },
    {
        "source_sentence": "佛說經已，皆歡喜受教。",
        "translation": "After the Buddha taught the sutra, they all rejoiced and accepted the teaching.",
        "source": "T01n0087_001:0912a10_19"
    },
    {
        "source_sentence": "佛說齋經",
        "translation": "Foshuo jie jing",
        "source": "T01n0087_001:0912a11_0"
    }
]