[
    {
        "source_sentence": "佛說須達經",
        "translation": "Buddha teaches the Sudarśana Sutra",
        "source": "T01n0073_001:0879a08_0"
    },
    {
        "source_sentence": "蕭齊中印度三藏求那毗地譯",
        "translation": "Xiao Qi translated the translation of the Tripiṭaka of Central India, translated by Guangxi",
        "source": "T01n0073_001:0879a10_0"
    },
    {
        "source_sentence": "聞如是：一時，婆伽婆在舍衛城祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T01n0073_001:0879a11_0"
    },
    {
        "source_sentence": "彼時，須達居士至世尊所，到已禮世尊足，却坐一面。",
        "translation": "At that time, the householder Sudarśana came to the place where the World-honored One was. Having arrived there, he bowed at the World-honored One’s feet and withdrew to sit off to one side.",
        "source": "T01n0073_001:0879a12_1"
    },
    {
        "source_sentence": "須達居士却坐一面已，世尊告曰：「頗有，居士！",
        "translation": "After he sat to one side, the Bhagavān addressed him, Very good, householder!",
        "source": "T01n0073_001:0879a13_2"
    },
    {
        "source_sentence": "在家施與不？」",
        "translation": "Do you give it to someone at home?",
        "source": "T01n0073_001:0879a14_3"
    },
    {
        "source_sentence": "「唯世尊！",
        "translation": "“O Bhagavat!",
        "source": "T01n0073_001:0879a14_4"
    },
    {
        "source_sentence": "在家有施與者，所有施不能妙食，有雜穬麻子為羹，薑一枚以為施。」",
        "translation": "If there's a donor at home, he won't be able to subtly eat whatever he gives, and he'll give it with mixed flax sesame as soup or a single piece of grapes as a gift.",
        "source": "T01n0073_001:0879a14_5"
    },
    {
        "source_sentence": "「此，居士！",
        "translation": "Here, householder!",
        "source": "T01n0073_001:0879a16_6"
    },
    {
        "source_sentence": "非妙施。",
        "translation": "It's not a marvelous gift.",
        "source": "T01n0073_001:0879a16_7"
    },
    {
        "source_sentence": "有妙施者，二俱有報。",
        "translation": "“There is a subtle giving”: The two are both with retribution.",
        "source": "T01n0073_001:0879a16_8"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879a17_9"
    },
    {
        "source_sentence": "為非妙施者，彼不信施，亦不時施，不自手施，亦不就往而施，不知、不有信，",
        "translation": "What’s not a wonderful gift is that they don’t believe in giving, don’t give at the right time, don’t give with their own hands, don’t give by going, don’t know, and don’t have faith.",
        "source": "T01n0073_001:0879a17_10"
    },
    {
        "source_sentence": "亦不知有報而行施。",
        "translation": "They also don't know there's a reward and practice generosity.",
        "source": "T01n0073_001:0879a18_11"
    },
    {
        "source_sentence": "當知有如是報，意亦不在妙有屋舍，意亦不在諸妙物，意亦不在衣被，",
        "translation": "You should know that this kind of retribution is not found in the mind at all. It is not found in beautiful houses, good objects, or clothing and bedding.",
        "source": "T01n0073_001:0879a19_12"
    },
    {
        "source_sentence": "亦不在妙食，意亦不在妙五樂婬。",
        "translation": "They aren't in the marvelous food, and their mind isn't in the marvelous five blissful abscesses.",
        "source": "T01n0073_001:0879a21_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0073_001:0879a21_1"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879a21_2"
    },
    {
        "source_sentence": "行非施報故。",
        "translation": "It's because the practice isn't the result of giving.",
        "source": "T01n0073_001:0879a22_3"
    },
    {
        "source_sentence": "居士！",
        "translation": "householder!",
        "source": "T01n0073_001:0879a22_4"
    },
    {
        "source_sentence": "行非施者，當有信，隨時施、自手施、往而施，有知、有信，知有報因緣已而施與。",
        "translation": "Those who practice what's not a gift should have faith, give at the right time, give it with their own hands, give it to someone who knows and has faith, and give it after knowing the causes and conditions for retribution.",
        "source": "T01n0073_001:0879a22_5"
    },
    {
        "source_sentence": "當知彼有此報，意便在妙家業，報極妙諸具、極妙衣、有極妙食、意作妙五樂婬。",
        "translation": "You should know that they have this reward, and their intention is to work at a wonderful house, which results in the most marvelous implements, most marvelous clothing, most marvelous food, and the five subtle pleasures created by their mind.",
        "source": "T01n0073_001:0879a24_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0073_001:0879a26_0"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879a26_1"
    },
    {
        "source_sentence": "當知彼有施。",
        "translation": "You should know that they have generosity.",
        "source": "T01n0073_001:0879a26_2"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879a26_3"
    },
    {
        "source_sentence": "行妙施，不信施與，不隨時與，不自以手施與，不往而施，亦不知亦不信，",
        "translation": "They practice subtle giving, not believing in giving, not giving at any time, not giving with their own hands, giving without going, not knowing, and not believing.",
        "source": "T01n0073_001:0879a26_4"
    },
    {
        "source_sentence": "亦不知有因緣行果報，而行施與。",
        "translation": "They don't know the results of their actions with causes and conditions, yet they practice generosity.",
        "source": "T01n0073_001:0879a28_5"
    },
    {
        "source_sentence": "當知彼受如是報，意亦不在妙家業，意亦不在好衣，意亦不在好食，意亦不在妙五樂婬。",
        "translation": "You should know that they experience such a reward, and their mind isn't engaged in marvelous home-works, their mind isn't dressed in good clothing, their mind isn't eating good food, and their mind isn't indulging in the",
        "source": "T01n0073_001:0879b01_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0073_001:0879b03_7"
    },
    {
        "source_sentence": "居士！",
        "translation": "householder!",
        "source": "T01n0073_001:0879b03_8"
    },
    {
        "source_sentence": "此非施故。",
        "translation": "This is because it's not generosity.",
        "source": "T01n0073_001:0879b03_9"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879b03_10"
    },
    {
        "source_sentence": "妙好施者，信樂施，隨時施，自手施，往而施與，有知有信，知有行果報而行施與。",
        "translation": "A wonderful gift is a faithful gift that's given at any time, given with one's own hand, given to someone who knows and gives with faith, given with knowledge of the results of actions, and given with action.",
        "source": "T01n0073_001:0879b03_11"
    },
    {
        "source_sentence": "當知彼如是得報，意在妙家業，至妙五樂婬、意在食。",
        "translation": "You should know that they thus attain their reward, which is intended to be the result of marvelous family karma, up to the marvelous five delightful foods and the intention to eat.",
        "source": "T01n0073_001:0879b05_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0073_001:0879b06_13"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879b07_14"
    },
    {
        "source_sentence": "當如是隨時施報。",
        "translation": "They should thus receive the reward of giving at any time.",
        "source": "T01n0073_001:0879b07_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0073_001:0879b07_16"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879b07_17"
    },
    {
        "source_sentence": "昔有過去世，有鞞藍大婆羅門，大富極富，多錢財多諸雜物，彼如是作大施，",
        "translation": "Formerly there was a great brāhmaṇa named Vārāṇasī in a past world. He was very wealthy and extremely wealthy, with plenty of money and possessions as well as various miscellaneous things.",
        "source": "T01n0073_001:0879b08_18"
    },
    {
        "source_sentence": "以八十四千金鉢碎銀滿中；",
        "translation": "With eighty-four thousand golden bowls he crushed the silver and filled it with gold.",
        "source": "T01n0073_001:0879b09_19"
    },
    {
        "source_sentence": "彼如是行大施，以八十四千銀鉢滿中碎金；",
        "translation": "In this way he practiced the great giving, crushing gold into eighty-four thousand silver bowls filled with gold.",
        "source": "T01n0073_001:0879b10_20"
    },
    {
        "source_sentence": "彼如是行大施，彼以八十四千象，諸具嚴飾象白如雪；",
        "translation": "In this way they practice great giving. They decorate the elephants with eighty-four thousand elephants, all white as snow.",
        "source": "T01n0073_001:0879b11_21"
    },
    {
        "source_sentence": "彼如是行大施，以八十四千馬，諸具嚴飾金為珓珞；",
        "translation": "In this way they practiced great charity, with eighty-four thousand horses adorned with gold ornaments.",
        "source": "T01n0073_001:0879b12_22"
    },
    {
        "source_sentence": "如是行大施，以八十四千牛以衣繫之，[(殼-一)\\/牛]之常滿器；",
        "translation": "In this way he practiced the great giving, taking eighty-four thousand cows and fastening them to his robes. The container was always full [of milk].",
        "source": "T01n0073_001:0879b13_23"
    },
    {
        "source_sentence": "彼如是行大施，以八十四千玉女端正姝妙，一切諸珓珞極嚴飾之；",
        "translation": "In this way they practiced great giving, adorned themselves with eighty-four thousand beautiful and beautiful jadelike maidens, embellished with all kinds of jewelry.",
        "source": "T01n0073_001:0879b15_24"
    },
    {
        "source_sentence": "如是行大施，餘不可數餘食諸味。",
        "translation": "He thus practices great generosity, and the rest can't count the tastes of the other foods.",
        "source": "T01n0073_001:0879b16_25"
    },
    {
        "source_sentence": "謂彼居士鞞藍大富婆羅門作如是大施，施與閻浮提凡夫人，寧施與彼一仙人，",
        "translation": "It means that the householder Kālāma, a great wealthy brāhmaṇa, made such a great gift to ordinary people in Jambudvīpa and preferred to give it to one of those sages.",
        "source": "T01n0073_001:0879b17_26"
    },
    {
        "source_sentence": "得福多。",
        "translation": "They'll attain much merit.",
        "source": "T01n0073_001:0879b19_27"
    },
    {
        "source_sentence": "雖居士鞞藍大富婆羅門作如是大施，施與閻浮提仙人者，不如施與一須陀洹，",
        "translation": "Even though the householder Kālāma and the great wealthy brāhmaṇa made such a great gift to the ṛṣi of Jambudvīpa, it wouldn't be as good as giving it to a stream entrant.",
        "source": "T01n0073_001:0879b19_28"
    },
    {
        "source_sentence": "此得福多。",
        "translation": "This obtains a lot of merit.",
        "source": "T01n0073_001:0879b21_29"
    },
    {
        "source_sentence": "雖彼居士鞞藍大富婆羅門，施與閻浮提凡夫人及仙人、百須陀洹，不如施與一斯陀含，",
        "translation": "Even though that householder, the great wealthy brāhmaṇa Kālāma, gave it to ordinary people in Jambudvīpa, sages, and hundreds of stream-winners, it wouldn't be as good as giving it to a once-",
        "source": "T01n0073_001:0879b21_30"
    },
    {
        "source_sentence": "此得福多。",
        "translation": "This obtains a lot of merit.",
        "source": "T01n0073_001:0879b23_31"
    },
    {
        "source_sentence": "雖居士鞞藍大富婆羅門，作如是施與閻浮提凡夫人、仙人、百須陀洹、百斯陀含，",
        "translation": "Even though the householder Kālāma, a great wealthy brāhmaṇa, had given this kind of gift to ordinary people in Jambudvīpa, sages, hundreds of stream-winners, and hundreds of sakṛdāgāmins,",
        "source": "T01n0073_001:0879b23_32"
    },
    {
        "source_sentence": "不如施與一阿那含，此得福多。",
        "translation": "It's not as good as giving a single non-returner, for which he'll attain much merit.",
        "source": "T01n0073_001:0879b25_33"
    },
    {
        "source_sentence": "雖居士鞞藍大富婆羅門，作如是施與閻浮提凡夫人至百阿那含，不如施與一阿羅漢，",
        "translation": "Even though the householder Kālāma, a great wealthy brāhmaṇa, made such an offering to ordinary people in Jambudvīpa up to a hundred non-returners wouldn't be as good as giving it to one arhat.",
        "source": "T01n0073_001:0879b26_34"
    },
    {
        "source_sentence": "得福多。",
        "translation": "They'll attain much merit.",
        "source": "T01n0073_001:0879b28_35"
    },
    {
        "source_sentence": "謂居士！",
        "translation": "It means, householder!",
        "source": "T01n0073_001:0879b28_36"
    },
    {
        "source_sentence": "雖鞞藍大富婆羅門，作如是施與閻浮提凡夫人至百阿羅漢，不如施一辟支佛，",
        "translation": "Even so, it wouldn't be as good as giving a single pratyekabuddha to a hundred arhats of ordinary people in Jambudvīpa who make such an offering to the great wealthy brāhmaṇa Kālāma.",
        "source": "T01n0073_001:0879b28_37"
    },
    {
        "source_sentence": "得福多。",
        "translation": "They'll attain much merit.",
        "source": "T01n0073_001:0879c02_38"
    },
    {
        "source_sentence": "謂居士！",
        "translation": "It means, householder!",
        "source": "T01n0073_001:0879c02_39"
    },
    {
        "source_sentence": "雖鞞藍大富婆羅門作如是施，施與閻浮提凡夫人至百辟支佛，不如施與如來、無所著、等正覺，",
        "translation": "Even though giving to ordinary people in Jambudvfpa up to a hundred pratyekabuddhas is not as good as giving to the Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T01n0073_001:0879c03_0"
    },
    {
        "source_sentence": "此得福多。",
        "translation": "This obtains a lot of merit.",
        "source": "T01n0073_001:0879c05_1"
    },
    {
        "source_sentence": "謂居士鞞藍大富婆羅門作如是施，施與閻浮提凡夫人至百辟支佛，作房舍以施與招提僧者，",
        "translation": "It means that the householder Kālāma, a great wealthy brāhmaṇa, makes such a gift to ordinary people in Jambudvīpa up to a hundred pratyekabuddhas and builds a dwelling to give it to the saṃ",
        "source": "T01n0073_001:0879c05_2"
    },
    {
        "source_sentence": "得福多。",
        "translation": "They'll attain much merit.",
        "source": "T01n0073_001:0879c07_3"
    },
    {
        "source_sentence": "謂居士鞞藍大富婆羅門作如是施，施與閻浮提凡夫人，至作房舍已施與招提僧，",
        "translation": "It means that the householder Kālāma, a great wealthy brāhmaṇa, makes such a gift to ordinary people in Jambudvīpa and then gives it to the saṃgha of Kārttika after building a dwelling.",
        "source": "T01n0073_001:0879c07_4"
    },
    {
        "source_sentence": "不如以清淨意作三自歸佛法及比丘僧、受其戒，此得福多。",
        "translation": "If someone doesn't make the three self-refuges with a pure intention to take refuge in the Buddha's teachings, the monks and nuns, or accept their precepts, they'll attain much merit.",
        "source": "T01n0073_001:0879c09_5"
    },
    {
        "source_sentence": "謂居士鞞藍大富婆羅門作如是大施，施與閻浮提凡夫人至以清淨行三自歸佛法及比丘僧、受其戒，",
        "translation": "It means that the householder Kālāma, a great wealthy brāhmaṇa, makes such a great gift to ordinary people in Jambudvīpa up to the point where they purify their practice of the three self-reliance precepts for buddhas",
        "source": "T01n0073_001:0879c11_0"
    },
    {
        "source_sentence": "不如於一切眾生行於慈至[(殼-一)\\/牛]牛頃，此得福多。",
        "translation": "It's not as good as performing acts of kindness for all sentient beings when they reach [( casket-i)\\/cow] cattle, which will attain much merit.",
        "source": "T01n0073_001:0879c13_1"
    },
    {
        "source_sentence": "謂居士鞞藍大富婆羅門作如是施與閻浮提凡夫人，至謂於一切眾生分別行慈，",
        "translation": "It means that the householder Kālāma, a great wealthy brāhmaṇa, makes this kind of gift to ordinary people in Jambudvīpa, up to the point where he discriminates and acts with kindness toward all sentient beings.",
        "source": "T01n0073_001:0879c14_2"
    },
    {
        "source_sentence": "下至[(殼-一)\\/牛]牛頃；",
        "translation": "It goes down to an ox-yard [(housing - one)\\/niu].",
        "source": "T01n0073_001:0879c16_3"
    },
    {
        "source_sentence": "謂一切行無常、苦、空、無我，思惟念者，下至彈指頃，此得福多。",
        "translation": "It means that all conditioned things are impermanent, painful, empty, and selfless, and those who contemplate them down to the point where they snap their fingers will attain much merit.",
        "source": "T01n0073_001:0879c16_4"
    },
    {
        "source_sentence": "汝居士！",
        "translation": "You householder!",
        "source": "T01n0073_001:0879c17_5"
    },
    {
        "source_sentence": "作如是念：『彼居士鞞藍大富婆羅門異耶？』",
        "translation": "He thinks, 'Is that householder Kālāma the great wealthy brāhmaṇa different?'",
        "source": "T01n0073_001:0879c18_6"
    },
    {
        "source_sentence": "莫作是念，我即是彼名鞞藍大富婆羅門！",
        "translation": "Don't think like this, for I am that great wealthy brāhmaṇa named Kālāma!",
        "source": "T01n0073_001:0879c19_7"
    },
    {
        "source_sentence": "如是，居士！",
        "translation": "So it is, householder!",
        "source": "T01n0073_001:0879c20_0"
    },
    {
        "source_sentence": "自住於饒益及饒益他、饒益多人，愍於世間，以義以樂安隱天及人，如是為說法，",
        "translation": "He teaches the Dharma in this way to those who are self-abiding, benefiting others and benefiting many people. Having pity for the world, he uses meaning to bring peace and comfort to gods and humans.",
        "source": "T01n0073_001:0879c20_1"
    },
    {
        "source_sentence": "未至竟盡，未至竟無垢，未至竟梵行，未至竟行梵行，彼故未脫生老病死憂慼不樂，",
        "translation": "Those who have not yet exhausted their practice of austerity, are not yet liberated from birth, old age, sickness, death, sorrow, lamentation, and unhappyness.",
        "source": "T01n0073_001:0879c22_2"
    },
    {
        "source_sentence": "我說未脫苦。",
        "translation": "I say they haven't yet liberated themselves from suffering.",
        "source": "T01n0073_001:0879c24_0"
    },
    {
        "source_sentence": "此居士！",
        "translation": "This householder!",
        "source": "T01n0073_001:0879c24_1"
    },
    {
        "source_sentence": "今如來出世間，無所著、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師、佛、世尊，",
        "translation": "Now that the Tathāgata has emerged from the world, free of attachment, fully awakened, accomplished in knowledge and conduct, a Well-gone One, understander of the world, unsurpassed one, ruler of the Way, teacher of god",
        "source": "T01n0073_001:0879c24_2"
    },
    {
        "source_sentence": "今自為故、為他故、為多人故、愍世間故，以義以樂安隱天及人。",
        "translation": "Now, for the sake of self, for the sake of others, for the sake of many people, and for the sake of pitying the world, I want to bring peace and comfort to gods and humans because of their meaning.",
        "source": "T01n0073_001:0879c26_3"
    },
    {
        "source_sentence": "我今為說法，至竟盡、至竟無垢、至竟梵行、至竟行梵行，今以得脫生老病死憂慼不樂苦，",
        "translation": "Now I teach the Dharma for you, so that you may be liberated from the suffering of birth, old age, sickness, death, sorrow, lamentation, and neither pleasure nor pain.",
        "source": "T01n0073_001:0879c27_4"
    },
    {
        "source_sentence": "我說已離苦。」",
        "translation": "I've explained that I'm free of suffering.",
        "source": "T01n0073_001:0880a01_5"
    },
    {
        "source_sentence": "佛如是說。",
        "translation": "The Buddha thus explains it.",
        "source": "T01n0073_001:0880a02_6"
    },
    {
        "source_sentence": "居士須達聞世尊所說，歡喜而樂。",
        "translation": "When the householder Sudarśana heard what the World-honored One said, he was delighted and happy.",
        "source": "T01n0073_001:0880a02_7"
    },
    {
        "source_sentence": "佛說須達經",
        "translation": "Buddha teaches the Sudarśana Sutra",
        "source": "T01n0073_001:0880a04_0"
    }
]