[
    {
        "source_sentence": "佛說長阿含經卷第十四",
        "translation": "Foshuo chang ahan jing jing, vol. 14",
        "source": "T01n0001_014:0088b10_0"
    },
    {
        "source_sentence": "後秦弘始年佛陀耶舍共竺佛念譯",
        "translation": "Translated by Zhu Fonian at Buddhayaśas in the Hongshi year of the Later Qin dynasty",
        "source": "T01n0001_014:0088b11_0"
    },
    {
        "source_sentence": "（二一）第三分梵動經第二",
        "translation": "(21) The Second Part of the Third Part of the Sutra on Brahmā's Movement",
        "source": "T01n0001_014:0088b12_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛遊摩竭國，與大比丘眾千二百五十人俱，遊行人間，",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Magadha, accompanied by one thousand two hundred and fifty bhikṣus, he traveled among the citizens of that country.",
        "source": "T01n0001_014:0088b13_0"
    },
    {
        "source_sentence": "詣竹林，止宿在王堂上。",
        "translation": "He went to the bamboo grove and spent the night in the king’s hall.",
        "source": "T01n0001_014:0088b14_1"
    },
    {
        "source_sentence": "時，有梵志名曰善念，善念弟子名梵摩達，師徒常共隨佛後行，而善念梵志以無數方便毀謗佛、法及比丘僧，",
        "translation": "At that time, there was a brāhmaṇa called Sunetra. Sunetra’s disciple named Brahmadatta always followed the Buddha along with his disciples; but Sunetra denigrated the Buddha, the Dharma, and the Sangha by innumerable different means.",
        "source": "T01n0001_014:0088b15_2"
    },
    {
        "source_sentence": "其弟子梵摩達以無數方便稱讚佛、法及比丘僧，師徒二人各懷異心，共相違背。",
        "translation": "That disciple Brahmadatta praised the Buddha, the Dharma, and the monks and nuns of the saṃgha with countless skillful means, and each teacher and disciple harbored a different mind, which was at odds with the other.",
        "source": "T01n0001_014:0088b17_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_014:0088b19_4"
    },
    {
        "source_sentence": "斯由異習、異見、異親近故。",
        "translation": "This is due to dissimilar habits, dissimilar views, and dissimilar intimacy.",
        "source": "T01n0001_014:0088b19_5"
    },
    {
        "source_sentence": "爾時，眾多比丘於乞食後集會講堂，作如是論：「甚奇！",
        "translation": "At the time, many monks assembled in the assembly hall after they had begged food and made this kind of argument, saying, Marvelous!",
        "source": "T01n0001_014:0088b20_6"
    },
    {
        "source_sentence": "甚特！",
        "translation": "That's extraordinary!",
        "source": "T01n0001_014:0088b21_7"
    },
    {
        "source_sentence": "世尊有大神力，威德具足，盡知眾生志意所趣。",
        "translation": "Bhagavān has great supernormal powers, replete with authoritative virtue, and fully knows the destinies of sentient beings’ aspirations.",
        "source": "T01n0001_014:0088b21_8"
    },
    {
        "source_sentence": "而此善念梵志及其弟子梵摩達隨逐如來及比丘僧；",
        "translation": "This mindful brahmin and his disciples Brahmadatta followed the Tathāgata and the assembly of bhikṣus.",
        "source": "T01n0001_014:0088b23_0"
    },
    {
        "source_sentence": "而善念梵志以無數方便毀謗佛、法及與眾僧，弟子梵摩達以無數方便稱讚如來及法、眾僧；",
        "translation": "The disciple Brahmadatta praised the Buddha, Dharma, and Sangha by means of countless skillful means.",
        "source": "T01n0001_014:0088b24_1"
    },
    {
        "source_sentence": "師徒二人各懷異心，異見、異習、異親近故。」",
        "translation": "Each of the two teachers and disciples had different minds, different views, different habits, and different kinds of intimacy.",
        "source": "T01n0001_014:0088b26_2"
    },
    {
        "source_sentence": "爾時，世尊於靜室中以天淨耳過於人耳，聞諸比丘有如是論，世尊於淨室起詣講堂所，",
        "translation": "At that time, the World-honored One was staying in meditation in a secluded room with his divine ears purified more than those of human beings. Having heard the bhikṣus holding these discussions, the World-honored One rose from his seat and entered the assembly hall.",
        "source": "T01n0001_014:0088b27_3"
    },
    {
        "source_sentence": "大眾前坐，知而故問：「諸比丘！",
        "translation": "Knowing this, the assembled crowd sat up in front of him and asked, Monks!",
        "source": "T01n0001_014:0088b29_4"
    },
    {
        "source_sentence": "汝等以何因緣集此講堂？",
        "translation": "For what reason have you gathered here in this assembly hall?",
        "source": "T01n0001_014:0088c01_5"
    },
    {
        "source_sentence": "何所論說？」",
        "translation": "What's being discussed and explained?",
        "source": "T01n0001_014:0088c01_6"
    },
    {
        "source_sentence": "時，諸比丘白佛言：「我等於乞食後集此講堂，眾共議言：『甚奇！",
        "translation": "The monks then said to the Buddha, After we had begged for food, we assembled in this assembly hall, and everyone discussed it together, saying, 'How wonderful!'",
        "source": "T01n0001_014:0088c02_0"
    },
    {
        "source_sentence": "甚特！",
        "translation": "That's extraordinary!",
        "source": "T01n0001_014:0088c03_1"
    },
    {
        "source_sentence": "如來有大神力，威德具足，盡知眾生心志所趣。",
        "translation": "The Tathāgata has great supernormal powers and is endowed with authoritative virtue, fully knowing the minds and destinies of sentient beings.",
        "source": "T01n0001_014:0088c03_2"
    },
    {
        "source_sentence": "而今善念梵志及弟子梵摩達常隨如來及與眾僧，以無數方便毀謗如來及法、眾僧，",
        "translation": "Now the brahmin Sunetra and his disciple Brahmadatta continually follow the Tathāgata and all the other members of the sangha, using innumerable skillful means to slander the Tathāgata, the Dharma, and the Sangha.",
        "source": "T01n0001_014:0088c04_3"
    },
    {
        "source_sentence": "弟子梵摩達以無數方便稱讚如來及法、眾僧。",
        "translation": "The disciple Brahmadatta praised the Tathāgata, the Dharma, and the saṃgha with countless skillful means.",
        "source": "T01n0001_014:0088c06_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_014:0088c07_5"
    },
    {
        "source_sentence": "以其異見、異習、異親近故。』",
        "translation": "It's because they have different views, different habits, and different kinds of proximity.'",
        "source": "T01n0001_014:0088c08_0"
    },
    {
        "source_sentence": "向集講堂議如是事。」",
        "translation": "They've gathered in the lecture hall to discuss such things.",
        "source": "T01n0001_014:0088c08_1"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「若有方便毀謗如來及法、眾僧者，汝等不得懷忿結心，",
        "translation": "At the time, the Bhagavān addressed the monks, If you skillfully denigrate the Tathāgata, the Dharma, and the saṃgha, you mustn't harbor angry thoughts.",
        "source": "T01n0001_014:0088c09_2"
    },
    {
        "source_sentence": "害意於彼，所以者何？",
        "translation": "harmful thoughts are directed toward them.",
        "source": "T01n0001_014:0088c10_3"
    },
    {
        "source_sentence": "若誹謗我、法及比丘僧，汝等懷忿結心，起害意者，則自陷溺，是故汝等不得懷忿結心，",
        "translation": "If you denigrate the self, the Dharma, and the bhikṣus and saṃgha, your minds will be filled with anger. And if you give rise to thoughts of harming others, you will surely sink into a sea of delusion. For this reason you should not have angry thoughts.",
        "source": "T01n0001_014:0088c11_4"
    },
    {
        "source_sentence": "害意於彼。",
        "translation": "He harms them with his thoughts.",
        "source": "T01n0001_014:0088c13_5"
    },
    {
        "source_sentence": "比丘若稱譽佛及法、眾僧者，汝等於中亦不足以為歡喜慶幸，所以者何？",
        "translation": "If a monk praises the Buddha, the Dharma, and the saṃgha, it's not enough for you to rejoice and congratulate him. Why?",
        "source": "T01n0001_014:0088c13_6"
    },
    {
        "source_sentence": "若汝等生歡喜心，即為陷溺，是故汝等不應生喜。",
        "translation": "If you give rise to a feeling of joy, it's because you're trapped. That's why you shouldn't give rise to joy.",
        "source": "T01n0001_014:0088c15_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_014:0088c16_8"
    },
    {
        "source_sentence": "此是小緣威儀戒行，凡夫寡聞，不達深義，直以所見如實讚嘆。",
        "translation": "Ordinary people who have little learning but do not understand the profound meaning of these teachings simply praise what they see with true praise.",
        "source": "T01n0001_014:0088c16_9"
    },
    {
        "source_sentence": "「云何小緣威儀戒行，凡夫寡聞，直以所見如實稱讚？",
        "translation": "What are the minor conditions for the observance of the precepts in terms of deportment that ordinary people who have little learning to hear simply praise by seeing them as they really are?",
        "source": "T01n0001_014:0088c18_10"
    },
    {
        "source_sentence": "彼讚嘆言：『沙門瞿曇滅殺、除殺，捨於刀杖，懷慙愧心，慈愍一切。』",
        "translation": "They praised him, saying, 'The ascetic Gautama extinguishes killing and removes killing, abandons swords and sticks, harbors shame and a sense of shame, and has compassion for all.'",
        "source": "T01n0001_014:0088c19_11"
    },
    {
        "source_sentence": "此是小緣威儀戒行，彼寡聞凡夫以此歎佛。",
        "translation": "This is a minor condition for the observance of the precepts in terms of deportment, and that little-versed mortal praises the Buddha because of this.",
        "source": "T01n0001_014:0088c21_0"
    },
    {
        "source_sentence": "又嘆：『沙門瞿曇捨不與取，滅不與取，無有盜心。』",
        "translation": "Again, he laments, 'The ascetic Gautama abandons taking without giving and ceases taking without giving, and there's no stealing in his mind.'",
        "source": "T01n0001_014:0088c22_0"
    },
    {
        "source_sentence": "又嘆：『沙門瞿曇捨於婬欲，淨修梵行，一向護戒，不習婬逸，所行清潔。』",
        "translation": "Again, he exclaimed, 'The ascetic Gautama abandons sexual desire and purely cultivates the religious practice, always observes precepts, doesn't engage in sexual misconduct, and purifies what he does.'",
        "source": "T01n0001_014:0088c23_1"
    },
    {
        "source_sentence": "又嘆：『沙門瞿曇捨滅妄語，所言至誠，所說真實，不誑世人。",
        "translation": "Again, he exclaimed: The renunciant Gotama has abandoned false speech. What he says is spoken with utmost sincerity and what he teaches is true; he does not hold sway over the world.",
        "source": "T01n0001_014:0088c24_2"
    },
    {
        "source_sentence": "沙門瞿曇捨滅兩舌，不以此言壞亂於彼，不以彼言壞亂於此；",
        "translation": "“The renunciant Gotama has abandoned divisive speech. He does not disturb others with these words, and he does not disturb this [realm] with those words.",
        "source": "T01n0001_014:0088c26_3"
    },
    {
        "source_sentence": "有諍訟者能令和合，已和合者增其歡喜，有所言說不離和合，誠實入心，",
        "translation": "Those who have arguments can be reconciled, and those who are already reconciled will increase in joy. Whatever they say does not leave the conjunction; they enter their minds with sincerity.",
        "source": "T01n0001_014:0088c27_4"
    },
    {
        "source_sentence": "所言知時。",
        "translation": "When it's said to know, it's called knowing.",
        "source": "T01n0001_014:0088c29_5"
    },
    {
        "source_sentence": "沙門瞿曇捨滅惡口，若有麤言傷損於人，增彼結恨長怨憎者，如此麤言盡皆不為；",
        "translation": "Again, the śramaṇa Gautama abstains from harsh speech. If he utters harsh words that hurt others and increases their feelings of hatred or resentment, he will not do so until all such harsh words have been uttered.",
        "source": "T01n0001_014:0088c29_6"
    },
    {
        "source_sentence": "常以善言悅可人心，眾所愛樂，聽無厭足，但說此言。",
        "translation": "He always spoke words pleasing to the minds of living beings. The people loved him and listened to his exhortation, never getting tired of it. They simply uttered these words.",
        "source": "T01n0001_014:0089a02_7"
    },
    {
        "source_sentence": "沙門瞿曇捨滅綺語，知時之語、實語、利語、法語、律語、止非之語，",
        "translation": "“The renunciant Gotama has abandoned fancy speech. He knows the words spoken at the [proper] time, speaks what is true, speaks what is beneficial, speaks what is based on truth, speaks what is according to the Dharma, speaks what is in accordance with the Vinaya, and speaks what is neither good nor evil.",
        "source": "T01n0001_014:0089a03_8"
    },
    {
        "source_sentence": "但說是言。",
        "translation": "It's simply said to be words.",
        "source": "T01n0001_014:0089a05_9"
    },
    {
        "source_sentence": "「『沙門瞿曇捨離飲酒，不著香華，不觀歌舞，不坐高床，非時不食，",
        "translation": "“The renunciant Gotama abstains from drinking alcohol, from wearing incense or flowers, from dancing or singing, from sitting on a raised seat, and from eating at forbidden times.",
        "source": "T01n0001_014:0089a05_10"
    },
    {
        "source_sentence": "不執金銀，不畜妻息、僮僕、婢使，不畜象馬、猪羊、鷄犬及諸鳥獸，",
        "translation": "They don't cling to gold or silver, don't store wives, servants, maidservants, elephants, horses, pigs, sheep, chickens, dogs, and birds.",
        "source": "T01n0001_014:0089a07_11"
    },
    {
        "source_sentence": "不畜象兵、馬兵、車兵、步兵，不畜田宅種殖五穀，不以手拳與人相加，",
        "translation": "They don't harvest elephant troops, horse troops, chariot troops, or infantry, don't harvest rice from fields and homes, and don't touch people with their palms.",
        "source": "T01n0001_014:0089a08_12"
    },
    {
        "source_sentence": "不以斗秤欺誑於人，亦不販賣券要斷當，亦不取受觝債橫生無端，亦不陰謀面背有異，",
        "translation": "They don’t deceive others with a dipper or scale, don’t sell bonds or securities, don’t cut them off when needed, don’t take and accept debts that are without limit, and don’t plot differently from each other.",
        "source": "T01n0001_014:0089a10_13"
    },
    {
        "source_sentence": "非時不行；",
        "translation": "They don’t practice at the wrong time.",
        "source": "T01n0001_014:0089a12_14"
    },
    {
        "source_sentence": "為身養壽，量腹而食，其所至處，衣鉢隨身，譬如飛鳥，羽翮身俱。』",
        "translation": "In order to nourish body and life, he measures his belly and eats, and wherever he goes, his robes and bowl are carried around him, like a flying bird with its wings and feathers.'",
        "source": "T01n0001_014:0089a12_15"
    },
    {
        "source_sentence": "此是持戒小小因緣，彼寡聞凡夫以此歎佛。",
        "translation": "This is a minor reason for observing the precepts, and those worldlings with little learning praise the Buddha because of this.",
        "source": "T01n0001_014:0089a14_16"
    },
    {
        "source_sentence": "「如餘沙門、婆羅門受他信施，更求儲積，衣服飲食無有厭足，沙門瞿曇無有如此事。",
        "translation": "“Other śramaṇas and brāhmaṇas, having received charity from their devotees, seek to accumulate more in store without wearying of food or clothing. The śramaṇa Gautama has never done anything like this.",
        "source": "T01n0001_014:0089a15_17"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，自營生業，種殖樹木，鬼神所依，沙門瞿曇無如此事。",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in different kinds of livelihood for themselves. They sow seeds and plant trees that are the reliance of ghosts and spirits. The śramaṇa Gautama has never done anything like this.",
        "source": "T01n0001_014:0089a17_18"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，更作方便，求諸利養，象牙、雜寶、高廣大床、種種文繡、氍氀[毯-炎+荅][毯-炎+登]、綩綖被褥，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, seek various benefits through expedient means such as ivory, miscellaneous jewels, high and wide beds, multicolored embroidered cloth, woolen blankets, woolen carpets, quilt bedding, or cushions",
        "source": "T01n0001_014:0089a19_19"
    },
    {
        "source_sentence": "沙門瞿曇無如此事。",
        "translation": "The śramaṇa Gautama has never done anything like this.",
        "source": "T01n0001_014:0089a21_20"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，更作方便，求自莊嚴，酥油摩身，香水洗浴，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, seek to adorn themselves with skillful means, rubbing their bodies with oil and bathing them in scented water.",
        "source": "T01n0001_014:0089a22_21"
    },
    {
        "source_sentence": "香末自塗，香澤梳頭，著好華鬘，染目紺色，拭面莊飾，鐶紐澡潔，以鏡自照，",
        "translation": "They rub it on themselves with scented powder, cover their hair with fragrant ointments and hair combs, wear beautiful flower garlands, dye their eyes with a dark blue color, wipe their faces to embellish them, bathe themselves cleanly with cotton thread, and illuminate themselves with mirrors.",
        "source": "T01n0001_014:0089a23_22"
    },
    {
        "source_sentence": "著寶革屣，上服純白，戴蓋執拂，幢麾莊飾，沙門瞿曇無如此事。",
        "translation": "The śramaṇa Gautama never did such a thing. He wore precious leather sandals and was dressed in pure white clothes, wearing canopies and flying whiskeys, adorned with banners and commands.",
        "source": "T01n0001_014:0089a25_23"
    },
    {
        "source_sentence": "「如餘沙門、婆羅門專為嬉戱，碁局博奕，八道、十道，至百千道，種種戱法以自娛樂，",
        "translation": "“Other śramaṇas and brāhmaṇas, having gambled exclusively for their pastimes, played chess and board games such as the eight-squared, ten-squared, or even hundreds of thousands of chess pieces to amuse themselves.",
        "source": "T01n0001_014:0089a27_24"
    },
    {
        "source_sentence": "沙門瞿曇無如是事。",
        "translation": "The ascetic Gautama doesn't do such a thing.",
        "source": "T01n0001_014:0089a29_25"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，但說遮道無益之言，王者、戰鬪、軍馬之事，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, merely preach false doctrines that obstruct [the authentic path of religion] and useless talk about kings, battles, armies, and horses.",
        "source": "T01n0001_014:0089a29_26"
    },
    {
        "source_sentence": "群僚、大臣、騎乘出入、遊戱園觀，及論臥起、行步、女人之事，衣服、飲食、親里之事，",
        "translation": "All the officials, ministers, horsemen, cavalrymen, and enlightening beings came together to discuss women’s affairs, their clothing, food, drink, and household affairs.",
        "source": "T01n0001_014:0089b02_27"
    },
    {
        "source_sentence": "又說入海採寶之事，沙門瞿曇無如此事。",
        "translation": "Again, the śramaṇa Gautama has never done anything like this.",
        "source": "T01n0001_014:0089b03_28"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，無數方便，但作邪命，諂諛美辭，現相毀呰，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, engage in wrong livelihood through innumerable different means:",
        "source": "T01n0001_014:0089b04_29"
    },
    {
        "source_sentence": "以利求利，沙門瞿曇無如此事。",
        "translation": "Because he seeks profit for profit, the ascetic Gautama doesn't do anything like this.",
        "source": "T01n0001_014:0089b06_30"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，但共諍訟，或於園觀，或在浴池，或於堂上，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in disputes with each other. They may argue among themselves in gardens, pools, pavilions, or halls.",
        "source": "T01n0001_014:0089b07_31"
    },
    {
        "source_sentence": "互相是非，言：『我知經律，汝無所知；",
        "translation": "They said, “I know the scriptures and vinaya but you do not know anything.",
        "source": "T01n0001_014:0089b09_0"
    },
    {
        "source_sentence": "我趣正道，汝趣邪徑；",
        "translation": "I am on the right path, but you are on the wrong path.",
        "source": "T01n0001_014:0089b09_1"
    },
    {
        "source_sentence": "以前著後，以後著前；",
        "translation": "The former attaches to the latter, while the former attaches to the former.",
        "source": "T01n0001_014:0089b10_2"
    },
    {
        "source_sentence": "我能忍，汝不能忍；",
        "translation": "I can tolerate it, but you cannot tolerate it.",
        "source": "T01n0001_014:0089b10_3"
    },
    {
        "source_sentence": "汝所言說，皆不真正；",
        "translation": "What you say is not true.",
        "source": "T01n0001_014:0089b11_4"
    },
    {
        "source_sentence": "若有所疑，當來問我，我盡能答。』",
        "translation": "If you have any doubts, ask me questions in the future, and I'll be able to answer them all.'",
        "source": "T01n0001_014:0089b11_5"
    },
    {
        "source_sentence": "沙門瞿曇無如是事。",
        "translation": "The ascetic Gautama doesn't do such a thing.",
        "source": "T01n0001_014:0089b12_6"
    },
    {
        "source_sentence": "「如餘沙門、婆羅門食他信施，更作方便，求為使命，若為王、王大臣、婆羅門、居士通信使，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, seek to do so by means of expedient means.",
        "source": "T01n0001_014:0089b13_7"
    },
    {
        "source_sentence": "從此詣彼，從彼至此，持此信授彼，持彼信授此，或自為，或教他為，",
        "translation": "Going from one place to another, and going from one place to another, he maintains this faith and entrusts it to someone else.",
        "source": "T01n0001_014:0089b15_8"
    },
    {
        "source_sentence": "沙門瞿曇無如是事。",
        "translation": "The ascetic Gautama doesn't do such a thing.",
        "source": "T01n0001_014:0089b16_9"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，但習戰陣鬪諍之事，或習刀杖、弓矢之事，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, engage only in battlefield duels or they may engage in the use of swords, sticks, bows, and arrows.",
        "source": "T01n0001_014:0089b17_10"
    },
    {
        "source_sentence": "或鬪鷄犬、猪羊、象馬、牛駝諸獸，或鬪男女，或作眾聲，吹聲、鼓聲、歌聲、舞聲，",
        "translation": "They may fight with chickens, dogs, pigs, sheep, elephants, horses, cattle, and other animals; or they may fight with men and women; or they may make a variety of noises: blowing sounds, drum sounds, singing sounds, and dancing sounds.",
        "source": "T01n0001_014:0089b18_11"
    },
    {
        "source_sentence": "緣幢倒絕，種種伎戱，無不翫習，沙門瞿曇無如是事。",
        "translation": "Conditioned by the banners, they are in disarray and there are various kinds of tricks that cannot be avoided. The śramaṇa Gautama has never done anything like this.",
        "source": "T01n0001_014:0089b20_12"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，行遮道法，邪命自活，瞻相男女，吉凶好醜，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning false paths that obstruct [the authentic path of religion] and taking up wrong livelihoods. They may see men and women as male or female, predicting good or bad omens about the auspicious signs (or",
        "source": "T01n0001_014:0089b21_13"
    },
    {
        "source_sentence": "及相畜生，以求利養，沙門瞿曇無如是事。",
        "translation": "The śramaṇa Gautama has never done anything like this.",
        "source": "T01n0001_014:0089b23_14"
    },
    {
        "source_sentence": "「如餘沙門、婆羅門食他信施，行遮道法，邪命自活，召喚鬼神，或復驅遣，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning false paths that obstruct [the authentic path of religion] and taking up wrong livelihoods such as chanting ghostly spirits or expelling them.",
        "source": "T01n0001_014:0089b24_15"
    },
    {
        "source_sentence": "種種[袖-由+厭]禱，無數方道，恐熱於人，能聚能散，能苦能樂，",
        "translation": "They pray in various ways, countless directions, for fear of heating people and being able to assemble and disperse it, so that they may experience pain and pleasure.",
        "source": "T01n0001_014:0089b26_16"
    },
    {
        "source_sentence": "又能為人安胎出衣，亦能呪人使作驢馬，亦能使人聾盲瘖瘂，現諸技術，",
        "translation": "They can also place their clothes in the womb and give them out to others. They can also curse people so that they become donkeys and horses, or cause them to be deaf, blind, dumb, and dumb.",
        "source": "T01n0001_014:0089b27_17"
    },
    {
        "source_sentence": "叉手向日月，作諸苦行以求利養，沙門瞿曇無如是事。",
        "translation": "It is not the case that the renunciant Gotama, placing his palms together [in respect] toward the sun and the moon, engages in ascetic practices in order to seek profit or reward.",
        "source": "T01n0001_014:0089b29_18"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，行遮道法，邪命自活，或為人呪病，或誦惡呪，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning false paths that obstruct [the authentic path of religion] and taking up wrong livelihoods for their own sake. They may curse illness or recite evil spells for the sake of others.",
        "source": "T01n0001_014:0089c01_19"
    },
    {
        "source_sentence": "或誦善呪，或為醫方、鍼炙、藥石，療治眾病，沙門瞿曇無如此事。",
        "translation": "Again, the śramaṇa Gautama has never engaged in such behavior. He may recite good mantras or he may prescribe medicines for the treatment of illnesses as well as acupuncture and healing stones to treat their ailments.",
        "source": "T01n0001_014:0089c03_20"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，行遮道法，邪命自活，或呪水火，或為鬼呪，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning false paths that obstruct [the authentic path of religion] and taking up wrong livelihoods such as chanting mantras for water or fire or spells for ghosts.",
        "source": "T01n0001_014:0089c05_21"
    },
    {
        "source_sentence": "或誦剎利呪，或誦象呪，或支節呪，或安宅符呪，或火燒、鼠囓能為解呪，",
        "translation": "They may recite the kṣatriya dhāraṇī, or the elephant dhāraṇī, or the limbs dhāraṇī, or the house talisman, or the fire-burning and rat-pudgala dhāraṇī to enable them to understand.",
        "source": "T01n0001_014:0089c06_22"
    },
    {
        "source_sentence": "或誦知死生書，或誦夢書，或相手面，或誦天文書，或誦一切音書，沙門瞿曇無如此事。",
        "translation": "Again, the śramaṇa Gautama has never engaged in such behavior. He may have recited a book that tells of death and rebirth, or he may have recited a book written in a dream, or he may have recited it to someone else’s face, or he may have recited divine texts, or he may have recited all kinds of phonetic scripts.",
        "source": "T01n0001_014:0089c08_23"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，行遮道法，邪命自活，瞻相天時，言雨不雨，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning wrong paths that obstruct [the authentic path of religion] and thus taking up wrong livelihoods. When they look at the sky for signs of rain or no rain, they say:",
        "source": "T01n0001_014:0089c10_24"
    },
    {
        "source_sentence": "穀貴穀賤，多病少病，恐怖安隱，或說地動、彗星、月蝕、日蝕，或言星蝕，",
        "translation": "The price of grain is high and the price of grain is low. Most people suffer from illness but there are few who suffer from illness. Fearful and at ease they may talk of earthquakes, meteors, moons, lunar eclipses, or sun-eclipses, or they may speak of star-eclipses.",
        "source": "T01n0001_014:0089c12_25"
    },
    {
        "source_sentence": "或言不蝕，方面所在，皆能記之，沙門瞿曇無如此事。",
        "translation": "Some say it doesn't eclipse, and wherever it is, it can record it. That's not the case with the ascetic Gautama.",
        "source": "T01n0001_014:0089c13_26"
    },
    {
        "source_sentence": "如餘沙門、婆羅門食他信施，行遮道法，邪命自活，或言此國當勝，彼國不如，",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life, learning wrong paths that obstruct [the authentic path of religion] and taking up wrong livelihoods, such as saying that this country will be victorious or that another country will not.",
        "source": "T01n0001_014:0089c15_27"
    },
    {
        "source_sentence": "或言彼國當勝，此國不如，瞻相吉凶，說其盛衰，沙門瞿曇無如是事。",
        "translation": "Some people said, “That country will surely be victorious but this country is not as good as the others. Observing signs of good or bad omens and predicting their prosperity or failure, the śramaṇa Gautama has never done anything like this.” This was not the case.",
        "source": "T01n0001_014:0089c16_28"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0001_014:0089c18_29"
    },
    {
        "source_sentence": "此是持戒小小因緣，彼寡聞凡夫以此嘆佛。」",
        "translation": "This is a minor cause for observing the precepts, and those well-versed mortals praise the Buddha for this.",
        "source": "T01n0001_014:0089c18_30"
    },
    {
        "source_sentence": "佛告諸比丘：「更有餘法，甚深微妙大法光明，唯有賢聖弟子能以此言讚嘆如來。",
        "translation": "The Buddha told the monks, There are other things that are so profound and subtle as to be like the light of the great teaching. Only wise and saintly disciples can praise the Tathāgata with these words.",
        "source": "T01n0001_014:0089c19_31"
    },
    {
        "source_sentence": "何等是甚深微妙大光明法，賢聖弟子能以此法讚嘆如來？",
        "translation": "What's the profound, subtle, and greatly illuminating teaching that good and noble disciples can praise the Tathāgata with this teaching?",
        "source": "T01n0001_014:0089c21_32"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於本劫本見、末劫末見，種種無數，隨意所說，盡入六十二見中；",
        "translation": "Some śramaṇas and brāhmaṇas hold various theories as to the initial eon of the past or the final eon of the future, innumerable differently. Any theories they may assert can all be classified into sixty-two variations without exceeding that number.",
        "source": "T01n0001_014:0089c23_0"
    },
    {
        "source_sentence": "本劫本見、末劫末見，種種無數，隨意所說，盡不能出過六十二見中。",
        "translation": "The various theories as to the initial eon of the past and the final eon of the present are innumerable. Whatever one wishes to teach, they can never be more than sixty-two variations.",
        "source": "T01n0001_014:0089c24_1"
    },
    {
        "source_sentence": "彼沙門、婆羅門以何等緣，於本劫本見、末劫末見，種種無數，各隨意說，",
        "translation": "“World-honored One, for what reasons do those śramaṇas and brāhmaṇas speculate freely about the initial eon of the past and final eon of the future?",
        "source": "T01n0001_014:0089c26_2"
    },
    {
        "source_sentence": "盡入此六十二見中，齊是不過？",
        "translation": "Are they all included in these sixty-two views, or are they the same as nothing more?",
        "source": "T01n0001_014:0089c28_0"
    },
    {
        "source_sentence": "諸沙門、婆羅門於本劫本見，種種無數，各隨意說，盡入十八見中；",
        "translation": "The śramaṇas and brāhmaṇas held various theories as to the initial eon of the past, innumerable differently. Each theories can be classified into eighteen variations without exceeding that number.",
        "source": "T01n0001_014:0089c28_1"
    },
    {
        "source_sentence": "本劫本見，種種無數，各隨意說，盡不能過十八見中。",
        "translation": "These theories as to the initial eon of the past are various and incalculable. They may be taught according to one opinion or another, but they cannot exceed eighteen variations.",
        "source": "T01n0001_014:0090a01_2"
    },
    {
        "source_sentence": "彼沙門、婆羅門以何等緣，於本劫本見，種種無數，各隨意說，盡入十八見中，",
        "translation": "“World-honored One, these śramaṇas and brāhmaṇas speculated about the initial eon of the past; they presented various theories as numerous as atoms in untold numbers. Each theory can be classified into eighteen variations without exceeding that number.",
        "source": "T01n0001_014:0090a02_3"
    },
    {
        "source_sentence": "齊此不過？",
        "translation": "Is this only the same as that?",
        "source": "T01n0001_014:0090a04_4"
    },
    {
        "source_sentence": "諸沙門婆羅門於本劫本見，起常論，言：『我及世間常存。』",
        "translation": "The śramaṇas and brāhmaṇas who held views of the original eon in the past argue about permanence, saying, 'The self and the world are always present.'",
        "source": "T01n0001_014:0090a04_5"
    },
    {
        "source_sentence": "此盡入四見中；",
        "translation": "These theories can be classified exhaustively into four variations:",
        "source": "T01n0001_014:0090a05_6"
    },
    {
        "source_sentence": "於本劫本見言：『我及世間常存。』",
        "translation": "In the past eon, he said, 'The self and the world are always present.'",
        "source": "T01n0001_014:0090a06_7"
    },
    {
        "source_sentence": "盡入四見，齊是不過。",
        "translation": "All four theories can be classified exhaustively without exceeding that number.",
        "source": "T01n0001_014:0090a07_8"
    },
    {
        "source_sentence": "「彼沙門、婆羅門以何等緣，於本劫本見，起常論，言：『我及世間常存。』",
        "translation": "“Those śramaṇas and brāhmaṇas, for what reason do they hold to the view of permanence in regard to the initial eon of the past and say, ‘The self and the world are always present.’",
        "source": "T01n0001_014:0090a07_9"
    },
    {
        "source_sentence": "此盡入四見中，齊是不過？",
        "translation": "These theories can be classified exhaustively into four variations without exceeding that number.",
        "source": "T01n0001_014:0090a09_10"
    },
    {
        "source_sentence": "或有沙門、婆羅門種種方便，入定意三昧，以三昧心憶二十成劫敗劫，",
        "translation": "“Some śramaṇas and brāhmaṇas enter mental concentration through various means, concentrating their thoughts on the twenty evolving and devolving cycles of past, present, and future aeons.",
        "source": "T01n0001_014:0090a09_11"
    },
    {
        "source_sentence": "彼作是說：『我及世間是常，此實餘虛，所以者何？",
        "translation": "This alone is true while the rest is false.",
        "source": "T01n0001_014:0090a11_12"
    },
    {
        "source_sentence": "我以種種方便入定意三昧，以三昧心憶二十成劫敗劫，其中眾生不增不減，",
        "translation": "With various skillful means I entered mental concentration and with a concentrated mind remembered twenty evolving and devolving eons, in which sentient beings neither increased nor decreased.",
        "source": "T01n0001_014:0090a12_13"
    },
    {
        "source_sentence": "常聚不散，我以此知：我及世間是常，此實餘虛。』",
        "translation": "Because the permanent lump isn't dispersed, I know that the self and the world are permanent, which is true while the rest are false.'",
        "source": "T01n0001_014:0090a14_14"
    },
    {
        "source_sentence": "此是初見。",
        "translation": "This is the first view.",
        "source": "T01n0001_014:0090a15_15"
    },
    {
        "source_sentence": "沙門、婆羅門因此於本劫本見，計我及世間是常，於四見中，齊是不過。",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculate about the initial eon of the past. They believe that the self and the world are permanent; but these theories can be classified into four variations without exceeding that number.",
        "source": "T01n0001_014:0090a15_16"
    },
    {
        "source_sentence": "「或有沙門、婆羅門種種方便，入定意三昧，以三昧心憶四十成劫敗劫，",
        "translation": "“Some śramaṇas and brāhmaṇas enter mental concentration through various means, concentrating their thoughts on forty evolving and devolving cycles of eons.",
        "source": "T01n0001_014:0090a17_17"
    },
    {
        "source_sentence": "彼作是說：『我及世間是常，此實餘虛，所以者何？",
        "translation": "This alone is true while the rest is false.",
        "source": "T01n0001_014:0090a19_18"
    },
    {
        "source_sentence": "我以種種方便，入定意三昧，以三昧心憶四十成劫敗劫，其中眾生不增不減，",
        "translation": "With various skillful means, I entered mental concentration and with a concentrated mind remembered forty evolving and devolving eons, in which sentient beings neither increased nor decreased.",
        "source": "T01n0001_014:0090a20_19"
    },
    {
        "source_sentence": "常聚不散，我以此知，我及世間是常，此實餘虛。』",
        "translation": "Because the lump of permanence doesn't disperse, I know that self and the world are permanent; this is true while the rest is false.'",
        "source": "T01n0001_014:0090a22_0"
    },
    {
        "source_sentence": "此是二見，諸沙門、婆羅門因此於本劫本見，計我及世間是常，於四見中，",
        "translation": "These are the two theories. The śramaṇas and brāhmaṇas speculate about the initial eon of the past, asserting that the self and the world are permanent.",
        "source": "T01n0001_014:0090a23_1"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0090a24_2"
    },
    {
        "source_sentence": "「或有沙門、婆羅門以種種方便，入定意三昧，以三昧心憶八十成劫敗劫，",
        "translation": "Again, some śramaṇas and brāhmaṇas entered mental concentration through various means to remember the eighty past, present, and future aeons with a concentrated mind.",
        "source": "T01n0001_014:0090a25_3"
    },
    {
        "source_sentence": "彼作是言：『我及世間是常，此實餘虛，所以者何？",
        "translation": "This alone is true while the rest is false.",
        "source": "T01n0001_014:0090a26_4"
    },
    {
        "source_sentence": "我以種種方便入定意三昧，以三昧心憶八十成劫敗劫，其中眾生不增不減，",
        "translation": "With various skillful means I entered mental concentration and with a concentrated mind remembered the eighty evolving and devolving eons, in which sentient beings neither increased nor decreased.",
        "source": "T01n0001_014:0090a27_5"
    },
    {
        "source_sentence": "常聚不散，我以此知，我及世間是常，此實餘虛。』",
        "translation": "Because the lump of permanence doesn't disperse, I know that self and the world are permanent; this is true while the rest is false.'",
        "source": "T01n0001_014:0090a29_6"
    },
    {
        "source_sentence": "此是三見。",
        "translation": "These are the three views.",
        "source": "T01n0001_014:0090b01_7"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此於本劫本見，計我及世間是常，於四見中，齊是不過。",
        "translation": "Some śramaṇas and brāhmaṇas, speculating about the initial eon of the past, believe that the self and the world are permanent. But these theories can be classified into four variations without exceeding that number.",
        "source": "T01n0001_014:0090b02_0"
    },
    {
        "source_sentence": "「或有沙門、婆羅門有捷疾相智，善能觀察，以捷疾相智方便觀察，謂為審諦，",
        "translation": "“Some śramaṇas and brāhmaṇas, endowed with knowledge of the characteristics of their arousal of zeal, are well able to examine [these theories] by means of knowledge of the characteristics of their arousal of zeal. This is called due diligence.",
        "source": "T01n0001_014:0090b03_1"
    },
    {
        "source_sentence": "以己所見，以己辯才作是說，言：『我及世間是常。』",
        "translation": "Because of their own views and their own eloquence, they say, 'The self and the world are permanent.'",
        "source": "T01n0001_014:0090b05_2"
    },
    {
        "source_sentence": "此是四見。",
        "translation": "These are the four views.",
        "source": "T01n0001_014:0090b06_3"
    },
    {
        "source_sentence": "沙門、婆羅門因此於本劫本見，計我及世間是常，於四見中，齊是不過。",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculate about the initial eon of the past. They believe that the self and the world are permanent; but these theories can be classified into four variations without exceeding that number.",
        "source": "T01n0001_014:0090b06_4"
    },
    {
        "source_sentence": "此沙門、婆羅門於本劫本見，計我及世間是常，如此一切盡入四見中，",
        "translation": "These śramaṇas and brāhmaṇas, speculating about the initial eon of the past, asserted that the self and the world are permanent. All of these theories can be classified exhaustively into four variations:",
        "source": "T01n0001_014:0090b08_5"
    },
    {
        "source_sentence": "我及世間是常，於此四見中，齊是不過。",
        "translation": "The view that the self and the world are permanent is identical with these four views but does not go beyond them.",
        "source": "T01n0001_014:0090b10_6"
    },
    {
        "source_sentence": "唯有如來知此見處，如是持、如是執，亦知報應。",
        "translation": "Only the Tathāgata knows this viewpoint, thus maintaining and thus apprehending it, and he also knows its retribution.",
        "source": "T01n0001_014:0090b11_7"
    },
    {
        "source_sentence": "如來所知又復過是，雖知不著，已不著則得寂滅，知受集、滅、味、過、出要，",
        "translation": "What the Tathagata knows is also like this: although he knows, he doesn’t cling to it. When he has no attachment, he attains nirvana. He knows that sensation arises, ceases, tastes, deficiencies, and essentials of liberation.",
        "source": "T01n0001_014:0090b12_8"
    },
    {
        "source_sentence": "以平等觀無餘解脫，故名如來。",
        "translation": "Because he observes equality and liberation without remainder, he's called the Tathāgata.",
        "source": "T01n0001_014:0090b14_9"
    },
    {
        "source_sentence": "是為餘甚深微妙大法光明，使賢聖弟子真實平等讚嘆如來。",
        "translation": "This is the other profound and subtle great ray of light of the Dharma that causes the noble disciples to truly and equally praise the Tathāgata.",
        "source": "T01n0001_014:0090b14_10"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，使賢聖弟子真實平等讚嘆如來，何等是？",
        "translation": "Again, there is another ray of light of the profound and subtle great doctrine that causes the disciples of the wise and holy to truly and equally praise the Tathāgata. What is this?",
        "source": "T01n0001_014:0090b16_11"
    },
    {
        "source_sentence": "諸沙門、婆羅門於本劫本見起論，言：『我及世間，半常半無常。』",
        "translation": "The śramaṇas and brāhmaṇas argue about the initial eon of the past, saying, 'The self and the world are half permanent and half impermanent.'",
        "source": "T01n0001_014:0090b17_12"
    },
    {
        "source_sentence": "彼沙門、婆羅門因此於本劫本見，計我及世間半常半無常，於此四見中，",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculated about the initial eon of the past. They posited that the self and the world are neither permanent nor impermanent.",
        "source": "T01n0001_014:0090b19_13"
    },
    {
        "source_sentence": "齊是不過或過。",
        "translation": "Qi is nothing but a mistake or a mistake.",
        "source": "T01n0001_014:0090b21_0"
    },
    {
        "source_sentence": "或有是時，此劫始成，有餘眾生福盡、命盡、行盡，從光音天命終，生空梵天中，",
        "translation": "At the beginning of this kalpa some sentient beings who have exhausted their blessings, whose life span has come to an end and whose karmic forces have ceased are born in Ābhāsvara Heaven at the end of that eon.",
        "source": "T01n0001_014:0090b21_1"
    },
    {
        "source_sentence": "便於彼處生愛著心，復願餘眾生共生此處。",
        "translation": "They'll then become attached to that place and wish for other sentient beings to be born here together.",
        "source": "T01n0001_014:0090b23_2"
    },
    {
        "source_sentence": "此眾生既生愛著願已，復有餘眾生命、行、福盡，於光音天命終，來生空梵天中，",
        "translation": "“After these sentient beings had given rise to thirst and desire, some other sentient beings died in Ābhāsvara Heaven and were reborn in the Brahma heaven of emptiness when their lives, deeds, and blessings ended.",
        "source": "T01n0001_014:0090b24_3"
    },
    {
        "source_sentence": "其先生眾生便作是念：『我於此處是梵、大梵，我自然有，無能造我者；",
        "translation": "The sentient beings there thought, “I am Brahmā or Mahābrahmā here. I exist naturally and none can create me.",
        "source": "T01n0001_014:0090b26_4"
    },
    {
        "source_sentence": "我盡知諸義典，千世界於中自在，最為尊貴，能為變化，微妙第一。",
        "translation": "I know all the scriptures of doctrine in a thousand worlds, being free and sovereign among them. Among them, I am the foremost preeminent and most honorable. Being able to produce magical emanations, I am the foremost subtle and most marvelous.",
        "source": "T01n0001_014:0090b27_5"
    },
    {
        "source_sentence": "為眾生父，我獨先有，餘眾生後來，後來眾生，我所化成。』",
        "translation": "It's the father of sentient beings, and I alone existed before them; the other sentient beings came after me, and those who come after me will be transformed by me.'",
        "source": "T01n0001_014:0090b29_6"
    },
    {
        "source_sentence": "其後眾生復作是念：『彼是大梵，彼能自造，無造彼者，盡知諸義典，",
        "translation": "“Then the sentient beings who came after them thought, ‘That is the great brahma. He can create it himself; there is no one else who can create it.",
        "source": "T01n0001_014:0090c01_7"
    },
    {
        "source_sentence": "千世界於中自在，最為尊貴，能為變化，微妙第一，為眾生父，彼獨先有，",
        "translation": "Among the thousand worlds, the self-existing one is the most honorable and capable of creating fictive beings. It is the first subtle and foremost in that it is the father of all sentient beings; it exists only previously.",
        "source": "T01n0001_014:0090c03_8"
    },
    {
        "source_sentence": "後有我等，我等眾生，彼所化成。』",
        "translation": "Subsequently, there's self and so forth, and we sentient beings are transformed by them.'",
        "source": "T01n0001_014:0090c04_9"
    },
    {
        "source_sentence": "彼梵眾生命、行盡已，來生世間，年漸長大，剃除鬚髮，服三法衣，出家修道，",
        "translation": "When their lives and deeds ended, those brāhmaṇas were born in the world. As they grew up, shaved their hair and beards, donned the three robes of a mendicant, renounced domestic life, and practiced Buddhism.",
        "source": "T01n0001_014:0090c05_10"
    },
    {
        "source_sentence": "入定意三昧，隨三昧心自識本生，便作是言：『彼大梵者能自造作，無造彼者，",
        "translation": "When he enters mental concentration, he follows the mind in samādhi and knows for himself the original arising of his own mind. He then says: That great brahmin is able to do it himself; there is no one else who can do it.",
        "source": "T01n0001_014:0090c07_11"
    },
    {
        "source_sentence": "盡知諸義典，千世界於中自在，最為尊貴，能為變化，微妙第一。",
        "translation": "He fully knows all the scriptures of doctrine and is the sovereign among a thousand worlds in which he is the most honorable, capable of creating fictive beings, subtle and supremely subtle.",
        "source": "T01n0001_014:0090c09_12"
    },
    {
        "source_sentence": "為眾生父，常住不變，而彼梵化造我等，我等無常變易，不得久住，是故當知：我及世間半常半無常，",
        "translation": "Because it is the father of all sentient beings, abiding permanently and unchangingly, while that brahma created us. We are impermanent and changeable; we cannot abide for long. Therefore, you should know that the self and the world are one-and-a-half times permanent and one-half- Impermanent.",
        "source": "T01n0001_014:0090c10_13"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0090c12_14"
    },
    {
        "source_sentence": "是謂初見。",
        "translation": "This is called the first view.",
        "source": "T01n0001_014:0090c13_15"
    },
    {
        "source_sentence": "沙門、婆羅門因此於本劫本見起論，半常半無常，於四見中，齊是不過。",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculate about the initial eon of the past. They hold that one part is permanent and the other part is impermanent. These theories are limited to four variations but do not exceed that number.",
        "source": "T01n0001_014:0090c13_16"
    },
    {
        "source_sentence": "「或有眾生喜戲笑懈怠，數數戲笑以自娛樂，彼戲笑娛樂時，身體疲極便失意，",
        "translation": "“Some sentient beings are fond of laughter and lazy, repeatedly playing and frolicking to amuse themselves. While they are playing and frolicking, their bodies become extremely tired and lose control of thought.",
        "source": "T01n0001_014:0090c15_17"
    },
    {
        "source_sentence": "以失意便命終，來生世間，年漸長大，剃除鬚髮，服三法衣，出家修道，",
        "translation": "Because of this he died and was reborn in the world. As he grew up, shaved his hair and beard, donned the three robes of a mendicant, renounced domestic life, and entered religious practice.",
        "source": "T01n0001_014:0090c16_18"
    },
    {
        "source_sentence": "彼入定意三昧，以三昧心自識本生，便作是言：『彼餘眾生不數生，不數戲笑娛樂，",
        "translation": "Having entered mental concentration, the bhikṣu realizes by means of a concentrated state of absorption his past existence. He then says: Those other living beings are not born again and again; they do not repeatedly play, laugh, and amuse themselves.",
        "source": "T01n0001_014:0090c18_19"
    },
    {
        "source_sentence": "常在彼處，永住不變，由我數戲笑故，致此無常，為變易法，是故我知：我及世間半常半無常，",
        "translation": "Because they are constantly present there, always abiding permanently and unchangingly. As a result of my repeated playfulness and derision, they become impermanent; because of the law of change, therefore I know that the self and the world are in part permanent and in part impermanent.",
        "source": "T01n0001_014:0090c20_20"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0090c22_21"
    },
    {
        "source_sentence": "是為第二見。",
        "translation": "This is the second view.",
        "source": "T01n0001_014:0090c22_22"
    },
    {
        "source_sentence": "沙門、婆羅門因此於本劫本見起論，我及世間半常半無常，於四見中，",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculate about the initial eon of the past. They hold that the self and the world are only partially permanent and partially impermanent. These theories comprise four variations:",
        "source": "T01n0001_014:0090c23_23"
    },
    {
        "source_sentence": "齊此不過。",
        "translation": "This is not the same as that.",
        "source": "T01n0001_014:0090c24_24"
    },
    {
        "source_sentence": "「或有眾生展轉相看已，便失意，由此命終，來生世間，漸漸長大，剃除鬚髮，",
        "translation": "“Some sentient beings, seeing each other one after the other, will lose their minds. As a result, when their lives come to an end and they are reborn in the world, gradually grow old and shave their hair and beards.",
        "source": "T01n0001_014:0090c25_25"
    },
    {
        "source_sentence": "服三法衣，出家修道，入定意三昧，以三昧心識本所生，便作是言：『如彼眾生以不展轉相看，",
        "translation": "He wore the three robes of the Dharma, renounced domestic life, and practiced meditation. Entering mental absorption in concentration, he recognized with a concentrated mind what had originally arisen, and thought thus:",
        "source": "T01n0001_014:0090c26_26"
    },
    {
        "source_sentence": "不失意故，常住不變；",
        "translation": "Because they do not lose thought, they always abide and remain unchanging.",
        "source": "T01n0001_014:0090c29_27"
    },
    {
        "source_sentence": "我等於彼數相看，數相看已便失意，致此無常，為變易法，我以此知：我及世間半常半無常，",
        "translation": "Because of this, I know that the self and the world are in part permanent and in part impermanent.",
        "source": "T01n0001_014:0090c29_28"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0091a02_29"
    },
    {
        "source_sentence": "是第三見。",
        "translation": "This is the third view.",
        "source": "T01n0001_014:0091a03_0"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此於本劫本見起論：我及世間半常半無常。",
        "translation": "For this reason, other śramaṇas and brāhmaṇas speculated about the initial eon of the past: The self and the world are in part permanent and in part impermanent.",
        "source": "T01n0001_014:0091a03_1"
    },
    {
        "source_sentence": "於四見中，齊此不過。",
        "translation": "These theories can be classified into four variations without exceeding that number.",
        "source": "T01n0001_014:0091a04_2"
    },
    {
        "source_sentence": "「或有沙門、婆羅門有捷疾相智，善能觀察，彼以捷疾觀察相智，以己智辯言：『我及世間半常半無常，",
        "translation": "Again, some śramaṇas and brāhmaṇas may be endowed with knowledge of the characteristics of their arousal of zeal (i.e., sharpness of intellect), but they are also well trained in observing them. Some of them, through knowledge of the characteristics of their arousal of zeal (i.e., sharpness of",
        "source": "T01n0001_014:0091a05_3"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0091a07_4"
    },
    {
        "source_sentence": "是為第四見。",
        "translation": "This is the fourth view.",
        "source": "T01n0001_014:0091a07_5"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此於本劫本見起論：我及世間半常半無常，於四見中，",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculated about the initial eon of the past: “The self and the world are in part permanent and in part impermanent.",
        "source": "T01n0001_014:0091a08_6"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0091a09_7"
    },
    {
        "source_sentence": "諸沙門、婆羅門於本劫本見起論，我及世間半常半無常，盡入四見中，",
        "translation": "Some śramaṇas and brāhmaṇas speculated about the initial eon of the past, asserting that the self and the world are neither permanent nor impermanent. All of these theories can be classified into four variations:",
        "source": "T01n0001_014:0091a10_8"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0091a11_9"
    },
    {
        "source_sentence": "唯佛能知此見處，如是持、如是執，亦知報應，如來所知又復過是，雖知不著，",
        "translation": "Only buddhas can know the sphere of this view. They hold it in such a way and grasp it in such a way that they also know its consequences. Again, what the Tathagata knows is even more wrong: although they know it but do not cling to it.",
        "source": "T01n0001_014:0091a12_0"
    },
    {
        "source_sentence": "以不著則得寂滅，知受集、滅、味、過、出要，以平等觀無餘解脫，故名如來，",
        "translation": "Because they are not attached, they attain nirvana. They know the essentials of arising, ceasing, enjoyment, distancing themselves from it, and going forth. Because they observe equanimity with equanimity, they are liberated without remainder. That is why they are called buddhas.",
        "source": "T01n0001_014:0091a13_1"
    },
    {
        "source_sentence": "是為餘甚深微妙大法光明，使賢聖弟子真實平等讚歎如來。",
        "translation": "This is the other profound and subtle great ray of light of the Dharma that causes the noble disciples to truly and equally praise the Tathāgata.",
        "source": "T01n0001_014:0091a15_2"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，使賢聖弟子真實平等讚歎如來。",
        "translation": "Again, there's another profound and subtle great ray of light of the great teaching that causes the noble disciples to truly and equally praise the Tathāgata.",
        "source": "T01n0001_014:0091a16_3"
    },
    {
        "source_sentence": "何等法是？",
        "translation": "What is this doctrine?",
        "source": "T01n0001_014:0091a18_4"
    },
    {
        "source_sentence": "諸沙門、婆羅門於本劫本見起論：『我及世間有邊無邊。』",
        "translation": "The śramaṇas and brāhmaṇas argue about the initial eon of the past, saying, 'The self and the world are finite and limitless.'",
        "source": "T01n0001_014:0091a18_5"
    },
    {
        "source_sentence": "彼沙門、婆羅門因此於本劫本見起論：『我及世間有邊無邊。』",
        "translation": "That's why those ascetics and priests argue about the initial eon of the past, saying, 'The self and the world are finite and limitless.'",
        "source": "T01n0001_014:0091a19_6"
    },
    {
        "source_sentence": "於此四見中，齊是不過。",
        "translation": "Within these four theories, there is neither identical nor different:",
        "source": "T01n0001_014:0091a21_7"
    },
    {
        "source_sentence": "或有沙門、婆羅門種種方便，入定意三昧，以三昧心觀世間，起邊想，",
        "translation": "“Some śramaṇas and brāhmaṇas, having entered mental concentration through various means, observed the world with a concentrated mind and formulated thoughts of extremes.",
        "source": "T01n0001_014:0091a21_8"
    },
    {
        "source_sentence": "彼作是說：『此世間有邊，是實餘虛，所以者何？",
        "translation": "They say: This world has a finite limit. This alone is true while the rest is false.",
        "source": "T01n0001_014:0091a23_9"
    },
    {
        "source_sentence": "我以種種方便入定意三昧，以三昧心觀世間有邊，是故知世間有邊，此實餘虛。』",
        "translation": "I entered mental concentration with various skillful means and observed that the world has limits with a concentrated mind, so I know that the world has limits; this is true while the rest are false.'",
        "source": "T01n0001_014:0091a24_10"
    },
    {
        "source_sentence": "是謂初見。",
        "translation": "This is called the first view.",
        "source": "T01n0001_014:0091a26_11"
    },
    {
        "source_sentence": "沙門、婆羅門因此於本劫本見起論：我及世間有邊，於四見中，齊是不過。",
        "translation": "For this reason, śramaṇas and brāhmaṇas speculate about the initial eon of the past. They hold that the self and the world are finite; but these theories can be classified into four variations without exceeding that number.",
        "source": "T01n0001_014:0091a26_12"
    },
    {
        "source_sentence": "「或有沙門、婆羅門以種種方便，入定意三昧，以三昧心觀世間，起無邊想，",
        "translation": "“Some śramaṇas and brāhmaṇas enter mental concentration through various means, contemplating the world with a concentrated mind and formulating boundless thoughts:",
        "source": "T01n0001_014:0091a28_13"
    },
    {
        "source_sentence": "彼作是言：『世間無邊，此實餘虛，所以者何？",
        "translation": "They say: The world has no limit. This alone is true while the rest is false.",
        "source": "T01n0001_014:0091b01_14"
    },
    {
        "source_sentence": "我以種種方便，入定意三昧，以三昧心觀世間無邊，是故知世間無邊，",
        "translation": "“I entered mental concentration through various means. With a concentrated mind I observed that the world has no bounds. Because of this, I know that the world has no bounds.",
        "source": "T01n0001_014:0091b02_15"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0091b03_16"
    },
    {
        "source_sentence": "是第二見。",
        "translation": "This is the second view.",
        "source": "T01n0001_014:0091b04_17"
    },
    {
        "source_sentence": "沙門、婆羅門因此於本劫本見起論：我及世間無邊，於四見中，齊此不過。",
        "translation": "For this reason, śramaṇas and brāhmaṇas speculate about the initial eon of the past. They hold that the self and the world are boundless; but these theories can be classified into four:",
        "source": "T01n0001_014:0091b04_18"
    },
    {
        "source_sentence": "「或有沙門、婆羅門以種種方便，入定意三昧，以三昧心觀世間，謂上方有邊，",
        "translation": "Again, some śramaṇas and brāhmaṇas enter mental concentration through various means to contemplate the world with a concentrated mind:",
        "source": "T01n0001_014:0091b06_19"
    },
    {
        "source_sentence": "四方無邊彼作是言：『世間有邊無邊，此實餘虛，所以者何？",
        "translation": "The world has limits and no limits. This alone is true while the rest is false.",
        "source": "T01n0001_014:0091b07_20"
    },
    {
        "source_sentence": "我以種種方便，入定意三昧，以三昧心觀上方有邊，四方無邊，是故我知世間有邊無邊，",
        "translation": "“World-honored One, I entered mental concentration through various means and observed with a concentrated mind that the world above is finite in all directions and infinite in all directions. For this reason I know that the world has finite limits and infinite limits.",
        "source": "T01n0001_014:0091b09_21"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0091b11_22"
    },
    {
        "source_sentence": "是為第三見。",
        "translation": "This is the third view.",
        "source": "T01n0001_014:0091b11_23"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此於本劫本見起論：我及世間有邊無邊，於此四見中，",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculated about the initial eon of the past: “The self and the world are finite and infinite.",
        "source": "T01n0001_014:0091b11_24"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0091b13_25"
    },
    {
        "source_sentence": "「或有沙門、婆羅門有捷疾相智，善於觀察，彼以捷疾觀察智，以己智辯言：『我及世間非有邊非無邊，",
        "translation": "Again, some śramaṇas and brāhmaṇas are endowed with swift knowledge of the characteristics of their faculties (i.e., intelligence) and are well trained in contemplation. With swift knowledge of the characteristics of their faculties, they assert that the self and the world are neither finite nor infinite.",
        "source": "T01n0001_014:0091b13_26"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0091b16_27"
    },
    {
        "source_sentence": "是為第四見。",
        "translation": "This is the fourth view.",
        "source": "T01n0001_014:0091b16_28"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此於本劫本見起論：我及世間有邊無邊，此實餘虛，",
        "translation": "On this basis, other śramaṇas and brāhmaṇas speculated about the initial eon of the past: The self and the world are finite and infinite. This alone is true while the rest is false.",
        "source": "T01n0001_014:0091b16_29"
    },
    {
        "source_sentence": "於四見中，齊是不過。",
        "translation": "Among the four views, they are all the same but different.",
        "source": "T01n0001_014:0091b18_30"
    },
    {
        "source_sentence": "此是諸沙門、婆羅門於本劫本見起論：我及世間有邊無邊，盡入四見中，",
        "translation": "These śramaṇas and brāhmaṇas, speculating about the initial eon of the past, asserted that the self and the world are finite and infinite. All of these theories can be classified into four variations:",
        "source": "T01n0001_014:0091b18_31"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0091b20_32"
    },
    {
        "source_sentence": "唯佛能知此見處，如是持、如是執，亦知報應。",
        "translation": "Only the Buddha can know this viewpoint, thus maintaining and thus apprehending it, and he also knows its retribution.",
        "source": "T01n0001_014:0091b20_33"
    },
    {
        "source_sentence": "如來所知又復過是，雖知不著，已不著則得寂滅，知受集、滅、味、過、出要，",
        "translation": "What the Tathagata knows is also like this: although he knows, he doesn’t cling to it. When he has no attachment, he attains nirvana. He knows that sensation arises, ceases, tastes, deficiencies, and essentials of liberation.",
        "source": "T01n0001_014:0091b21_34"
    },
    {
        "source_sentence": "以平等觀無餘解脫，故名如來。",
        "translation": "Because he observes equality and liberation without remainder, he's called the Tathāgata.",
        "source": "T01n0001_014:0091b23_35"
    },
    {
        "source_sentence": "是為餘甚深微妙大法光明，使賢聖弟子真實平等讚歎如來。",
        "translation": "This is the other profound and subtle great ray of light of the Dharma that causes the noble disciples to truly and equally praise the Tathāgata.",
        "source": "T01n0001_014:0091b24_36"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，使賢聖弟子真實平等讚歎如來，何者是？",
        "translation": "Again, there is another profound and subtle ray of light of the great teaching that causes the disciples of the wise and holy to truly and equally praise the Tathāgata. What is this?",
        "source": "T01n0001_014:0091b25_37"
    },
    {
        "source_sentence": "諸沙門、婆羅門於本劫本見，異問異答，彼彼問時，異問異答，於四見中，",
        "translation": "Some śramaṇas and brāhmaṇas, speculating about the initial eon of the past, ask different questions and give different answers. When asked, they differ in questioning and giving different answers.",
        "source": "T01n0001_014:0091b27_38"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0091b29_39"
    },
    {
        "source_sentence": "沙門、婆羅門因此於本劫本見，異問異答，於四見中，齊是不過。",
        "translation": "For this reason, the śramaṇas and brāhmaṇas hold different theories about the initial eon of the past. They ask different questions and give different answers. But these theories can be classified into four variations without exceeding that number.",
        "source": "T01n0001_014:0091b29_40"
    },
    {
        "source_sentence": "或有沙門、婆羅門作如是論，作如是見：『我不見不知善惡有報、無報耶？",
        "translation": "Again, some śramaṇas and brāhmaṇas speculate in the following manner: “I neither see nor know whether wholesome or unwholesome [dharmas] are rewarded or not.",
        "source": "T01n0001_014:0091c01_41"
    },
    {
        "source_sentence": "我以不見不知故，作如是說：善惡有報耶？",
        "translation": "Because I don't see and don't know, I say this, Is there a reward for good and bad?",
        "source": "T01n0001_014:0091c03_42"
    },
    {
        "source_sentence": "無報耶？』",
        "translation": "Is there no reward?'",
        "source": "T01n0001_014:0091c04_43"
    },
    {
        "source_sentence": "世間有沙門、婆羅門廣博多聞，聰明智慧，常樂閑靜，機辯精微，世所尊重，",
        "translation": "In the world there are śramaṇas and brāhmaṇas who are extensively learned, intelligent and wise, always delight in seclusion. They are capable of eloquence and subtlety but esteemed by the world.",
        "source": "T01n0001_014:0091c04_44"
    },
    {
        "source_sentence": "能以智慧善別諸見。",
        "translation": "He's able to skillfully distinguish views with wisdom.",
        "source": "T01n0001_014:0091c06_45"
    },
    {
        "source_sentence": "設當問我諸深義者，我不能答，有愧於彼，於彼有畏，當以此答以為歸依、為洲、為舍，",
        "translation": "If someone were to ask me about my profound meanings, I wouldn’t be able to answer. Being ashamed of them and ashamed of their fear, I would answer with these words as refuge, continent, or shelter.",
        "source": "T01n0001_014:0091c07_46"
    },
    {
        "source_sentence": "為究竟道。",
        "translation": "It's the ultimate path.",
        "source": "T01n0001_014:0091c09_47"
    },
    {
        "source_sentence": "彼設問者，當如是答：『此事如是，此事實，此事異，此事不異，此事非異非不異。』",
        "translation": "Suppose someone asks a question, and they answer in this way: 'This matter is thus, this fact is true, this matter is different, this matter isn't different, this matter isn't different, and this matter isn't different or not different.'",
        "source": "T01n0001_014:0091c09_48"
    },
    {
        "source_sentence": "是為初見。",
        "translation": "This is the first view.",
        "source": "T01n0001_014:0091c11_49"
    },
    {
        "source_sentence": "沙門、婆羅門因此問異答異，於四見中，齊是不過。",
        "translation": "For this reason, the śramaṇas and brāhmaṇas ask different questions and give different answers. These theories are limited to four variations but do not exceed that number.",
        "source": "T01n0001_014:0091c11_50"
    },
    {
        "source_sentence": "「或有沙門、婆羅門作如是論，作如是見：『我不見不知為有他世耶？",
        "translation": "Again, some śramaṇas and brāhmaṇas speculate in the following manner:",
        "source": "T01n0001_014:0091c12_51"
    },
    {
        "source_sentence": "無他世耶？』",
        "translation": "Is there no other world?'",
        "source": "T01n0001_014:0091c14_52"
    },
    {
        "source_sentence": "諸世間沙門、婆羅門以天眼知、他心智，能見遠事，已雖近他，他人不見。",
        "translation": "Worldly śramaṇas and brāhmaṇas can see things from a distance by means of their supernormal vision or knowledge of the minds of others. Even if they were to approach someone else, that person would not see them.",
        "source": "T01n0001_014:0091c14_53"
    },
    {
        "source_sentence": "如此人等能知有他世、無他世；",
        "translation": "Such people can know that there is an afterlife and no afterlife.",
        "source": "T01n0001_014:0091c16_54"
    },
    {
        "source_sentence": "我不知不見有他世、無他世。",
        "translation": "I don't know and don't see that there are other worlds and no other worlds.",
        "source": "T01n0001_014:0091c17_55"
    },
    {
        "source_sentence": "若我說者，則為妄語，我惡畏妄語，故以為歸依、為洲、為舍，為究竟道。",
        "translation": "If I say this, it's a false statement, and because I badly fear false speech, I take refuge, island, shelter, and the ultimate path as my refuge.",
        "source": "T01n0001_014:0091c17_56"
    },
    {
        "source_sentence": "彼設問者，當如是答：『此事如是，此事實，此事異，此事不異，此事非異非不異。』",
        "translation": "Suppose someone asks a question, and they answer in this way: 'This matter is thus, this fact is true, this matter is different, this matter isn't different, this matter isn't different, and this matter isn't different or not different.'",
        "source": "T01n0001_014:0091c19_57"
    },
    {
        "source_sentence": "是為第二見。",
        "translation": "This is the second view.",
        "source": "T01n0001_014:0091c21_58"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此問異答異，於四見中，齊是不過。",
        "translation": "For this reason, the śramaṇas and brāhmaṇas ask different questions and give different answers. These theories are limited to four variations but do not exceed that number.",
        "source": "T01n0001_014:0091c21_59"
    },
    {
        "source_sentence": "「或有沙門、婆羅門作如是見，作如是論：『我不知不見何者為善？",
        "translation": "Again, some śramaṇas and brāhmaṇas hold the following view:",
        "source": "T01n0001_014:0091c22_60"
    },
    {
        "source_sentence": "何者不善？",
        "translation": "What's unwholesome?",
        "source": "T01n0001_014:0091c24_61"
    },
    {
        "source_sentence": "我不知不見如是說是善、是不善？』",
        "translation": "I don't know and don't see such a teaching as good or bad?'",
        "source": "T01n0001_014:0091c24_62"
    },
    {
        "source_sentence": "我則於此生愛，從愛生恚，有愛有恚，則有受生；",
        "translation": "Desire for self arises in relation to this, and strife arises depending on thirst. When there is desire and strife, there is sensation.",
        "source": "T01n0001_014:0091c25_63"
    },
    {
        "source_sentence": "我欲滅受，故出家修行；",
        "translation": "Because I want to extinguish feelings, I leave household life and practice.",
        "source": "T01n0001_014:0091c26_64"
    },
    {
        "source_sentence": "彼惡畏受，故以此為歸依、為洲、為舍，為究竟道。",
        "translation": "Because they fearfully accept it, they take it as a refuge, a continent, a shelter, and the ultimate path.",
        "source": "T01n0001_014:0091c27_65"
    },
    {
        "source_sentence": "彼設問者，當如是答：『此事如是，此事實，此事異，此事不異，此事非異非不異。』",
        "translation": "Suppose someone asks a question, and they answer in this way: 'This matter is thus, this fact is true, this matter is different, this matter isn't different, this matter isn't different, and this matter isn't different or not different.'",
        "source": "T01n0001_014:0091c28_66"
    },
    {
        "source_sentence": "是為第三見。",
        "translation": "This is the third view.",
        "source": "T01n0001_014:0092a01_0"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此問異答異，於四見中，齊是不過。",
        "translation": "For this reason, the śramaṇas and brāhmaṇas ask different questions and give different answers. These theories are limited to four variations but do not exceed that number.",
        "source": "T01n0001_014:0092a01_1"
    },
    {
        "source_sentence": "「或有沙門、婆羅門愚冥闇鈍，他有問者，彼隨他言答：『此事如是，",
        "translation": "“Some śramaṇas and brāhmaṇas, being ignorant and dull-witted, may ask questions in the darkness of ignorance.",
        "source": "T01n0001_014:0092a02_2"
    },
    {
        "source_sentence": "此事實，此事異，此事不異，此事非異非不異。』",
        "translation": "This is a fact, this thing is different, this thing isn't different, and this thing isn't different or not different.'",
        "source": "T01n0001_014:0092a04_3"
    },
    {
        "source_sentence": "是為四見。",
        "translation": "These are the four views.",
        "source": "T01n0001_014:0092a05_4"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此異問異答，於四見中，齊是不過。",
        "translation": "For this reason, the śramaṇas and brāhmaṇas ask different questions and give different answers. These four theories are all the same but do not go beyond them.",
        "source": "T01n0001_014:0092a05_5"
    },
    {
        "source_sentence": "或有沙門、婆羅門於本劫本見，異問異答，盡入四見中，齊是不過。",
        "translation": "Some śramaṇas and brāhmaṇas assert different theories about the initial eon of the past, questioning and answering with different questions. All of these theories can be classified into four variations without exceeding that number.",
        "source": "T01n0001_014:0092a06_6"
    },
    {
        "source_sentence": "唯佛能知此見處，如是持、如是執，亦知報應；",
        "translation": "Only buddhas can know the sphere of this view. They hold it in such a way and cling to it in such a way that they also know its retribution.",
        "source": "T01n0001_014:0092a08_7"
    },
    {
        "source_sentence": "如來所知又復過是，雖知不著，已不著則得寂滅，知受集、滅、味、過、出要，",
        "translation": "What the Tathagata knows is also like this: although he knows, he doesn’t cling to it. When he has no attachment, he attains nirvana. He knows that sensation arises, ceases, tastes, deficiencies, and essentials of liberation.",
        "source": "T01n0001_014:0092a09_8"
    },
    {
        "source_sentence": "以平等觀無餘解脫，故名如來。",
        "translation": "Because he observes equality and liberation without remainder, he's called the Tathāgata.",
        "source": "T01n0001_014:0092a11_9"
    },
    {
        "source_sentence": "是為甚深微妙大法光明，使賢聖弟子真實平等讚歎如來。",
        "translation": "This is the profound, subtle, and great ray of light of the Dharma that causes the noble disciples to truly and equally praise the Tathāgata.",
        "source": "T01n0001_014:0092a11_10"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，使賢聖弟子真實平等讚歎如來，何等是？",
        "translation": "Again, there is another ray of light of the profound and subtle great doctrine that causes the disciples of the wise and holy to truly and equally praise the Tathāgata. What is this?",
        "source": "T01n0001_014:0092a13_11"
    },
    {
        "source_sentence": "或有沙門、婆羅門於本劫本見，謂無因而出有此世間，彼盡入二見中，",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the initial eon of the past, asserting that this world exists without cause. They all fall into two kinds of theories:",
        "source": "T01n0001_014:0092a14_12"
    },
    {
        "source_sentence": "於本劫本見無因而出有此世間，於此二見中，齊是不過。",
        "translation": "These two theories hold that the existence of this world is possible without cause in regard to the initial eon (kalpa). But these theories do not exceed that limit.",
        "source": "T01n0001_014:0092a16_13"
    },
    {
        "source_sentence": "彼沙門、婆羅門因何事於本劫本見，謂無因而有，於此二見中，齊是不過？",
        "translation": "For what reason do the śramaṇas and brāhmaṇas speculate about the initial eon of the past, asserting that there is an existence without cause? Among these two theories, they are all the same as each other.",
        "source": "T01n0001_014:0092a17_14"
    },
    {
        "source_sentence": "或有眾生無想無知，若彼眾生起想，則便命終，來生世間，漸漸長大，",
        "translation": "“Some sentient beings may be without ideation or knowledge. But if those sentient beings give rise to ideation, their lives will come to an end and they will be reborn in this world, where they will gradually grow into adulthood.",
        "source": "T01n0001_014:0092a19_15"
    },
    {
        "source_sentence": "剃除鬚髮，服三法衣，出家修道，入定意三昧，以三昧心識本所生，彼作是語：『我本無有，",
        "translation": "They shaved their hair and beards, donned the three robes of a mendicant, renounced domestic life, and practiced Buddhism. Entering mental absorption, they recognized with a concentrated mind what had arisen in the past. They said:",
        "source": "T01n0001_014:0092a21_16"
    },
    {
        "source_sentence": "今忽然有，此世間本無、今有，此實餘虛。』",
        "translation": "Now that it suddenly exists, this world was originally nonexistent and now exists, which is true while the rest is false.'",
        "source": "T01n0001_014:0092a23_17"
    },
    {
        "source_sentence": "是為初見。",
        "translation": "This is the first view.",
        "source": "T01n0001_014:0092a24_18"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此於本劫本見，謂無因有，於二見中，齊是不過。",
        "translation": "On this basis, the śramaṇas and brāhmaṇas speculate about the initial eon of the past, asserting that there is nonexistence without cause. But these theories are not limited to one theory or two.",
        "source": "T01n0001_014:0092a24_19"
    },
    {
        "source_sentence": "「或有沙門、婆羅門有捷疾相智，善能觀察，彼已捷疾觀察智觀，以己智辯能如是說：『此世間無因而有，",
        "translation": "Again, some śramaṇas and brāhmaṇas are endowed with knowledge of the characteristics of worldly existence as quickly as possible. They are well trained in observing [these principles]. Having done so, they use their knowledge and eloquence to explain in this way:",
        "source": "T01n0001_014:0092a26_20"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0092a28_21"
    },
    {
        "source_sentence": "此第二見。",
        "translation": "This is the second view.",
        "source": "T01n0001_014:0092a28_22"
    },
    {
        "source_sentence": "諸有沙門、婆羅門因此於本劫本見，無因而有，有此世間，於二見中，",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the initial eon of the past, asserting that it exists without cause. The existence of this world consists of two theories:",
        "source": "T01n0001_014:0092a29_0"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0092b01_1"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於本劫本見，無因而有，盡入二見中，齊是不過，唯佛能知，",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the initial eon of the past, asserting that there is neither cause nor effect in regard to the initial eon. All of these theories can be classified exhaustively into two variations without exceeding that number. Only the Buddha knows this.",
        "source": "T01n0001_014:0092b01_2"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T01n0001_014:0092b03_3"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於本劫本見，無數種種，隨意所說，彼盡入是十八見中，",
        "translation": "Some śramaṇas and brāhmaṇas assert innumerable theories about the initial eon of the past, speculating freely according to their ideas. All of these theories can be classified into eighteen variations.",
        "source": "T01n0001_014:0092b03_4"
    },
    {
        "source_sentence": "本劫本見，無數種種，隨意所說；",
        "translation": "Innumerable different theories as to the initial eon of the past are taught at will.",
        "source": "T01n0001_014:0092b05_5"
    },
    {
        "source_sentence": "於十八見，齊是不過，唯佛能知，亦復如是。",
        "translation": "These eighteen theories do not exceed that number. Only the Buddha knows them, and so on likewise.",
        "source": "T01n0001_014:0092b06_6"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，何等是？",
        "translation": "“Furthermore, what’s the other profound and subtle illumination of the great teaching?",
        "source": "T01n0001_014:0092b07_7"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於末劫末見，無數種種，隨意所說；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future innumerable theories as various as they wish.",
        "source": "T01n0001_014:0092b08_8"
    },
    {
        "source_sentence": "彼盡入四十四見中，於末劫末見，種種無數，隨意所說，於四十四見，",
        "translation": "These theories can be classified exhaustively into forty-four variations, all speculating about the final eon of the future.",
        "source": "T01n0001_014:0092b09_9"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0092b10_10"
    },
    {
        "source_sentence": "彼有沙門、婆羅門因何事於末劫末見，無數種種，隨意所說，於四十四見，",
        "translation": "“Those śramaṇas and brāhmaṇas hold innumerable different theories about the final eon of the future. They speculate freely as they see fit, holding forty-four variations:",
        "source": "T01n0001_014:0092b11_11"
    },
    {
        "source_sentence": "齊此不過？",
        "translation": "Is this only the same as that?",
        "source": "T01n0001_014:0092b12_12"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於末劫末見，生有想論，說世間有想；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting that there will be consciousness in the world after death.",
        "source": "T01n0001_014:0092b13_13"
    },
    {
        "source_sentence": "彼盡入十六見中，於末劫末見生想論，說世間有想，於十六見中，齊是不過。",
        "translation": "All of these theories can be classified exhaustively into sixteen variations without exceeding that number. They hold the view that there is consciousness in the world at the end of the last kalpa and speculate about the arising of this consciousness.",
        "source": "T01n0001_014:0092b14_14"
    },
    {
        "source_sentence": "彼沙門、婆羅門因何事於末劫末見生想論，說世間有想，彼盡入十六見中，",
        "translation": "For what reason do those śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting that there will be consciousness in the world after death? These theories can be classified exhaustively into sixteen variations:",
        "source": "T01n0001_014:0092b16_15"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0092b18_16"
    },
    {
        "source_sentence": "「諸有沙門、婆羅門作如是論、如是見，言：『我此終後，生有色有想，",
        "translation": "Again, some śramaṇas and brāhmaṇas speculated in such a theory or held such a view:",
        "source": "T01n0001_014:0092b18_17"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0092b19_18"
    },
    {
        "source_sentence": "是為初見。",
        "translation": "This is the first view.",
        "source": "T01n0001_014:0092b20_19"
    },
    {
        "source_sentence": "諸沙門、婆羅門因此於末劫末見生想論，說世間有想；",
        "translation": "Many śramaṇas and brāhmaṇas speculate about the final eon of the future, saying that there will be consciousness in the world after death.",
        "source": "T01n0001_014:0092b20_20"
    },
    {
        "source_sentence": "於十六見中，齊是不過。",
        "translation": "These theories can be classified into sixteen variations without exceeding that number.",
        "source": "T01n0001_014:0092b21_21"
    },
    {
        "source_sentence": "有言：『我此終後，生無色有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll give rise to formless consciousnesses, which are real and the rest are false.'",
        "source": "T01n0001_014:0092b22_22"
    },
    {
        "source_sentence": "有言：『我此終後，生有色無色有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born with form and formless consciousnesses, but this is true while the rest is false.'",
        "source": "T01n0001_014:0092b23_23"
    },
    {
        "source_sentence": "有言：『我此終後，生非有色非無色有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born with consciousnesses that are neither colored nor formless, but this is true while the rest is false.'",
        "source": "T01n0001_014:0092b24_24"
    },
    {
        "source_sentence": "有言：『我此終後，生有邊有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there will be a perception of self with limits and consciousnesses, which is true while the rest are false.'",
        "source": "T01n0001_014:0092b25_25"
    },
    {
        "source_sentence": "有言：『我此終後，生無邊有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll give rise to limitless consciousnesses, which are real and the rest are false.'",
        "source": "T01n0001_014:0092b26_26"
    },
    {
        "source_sentence": "有言：『我此終後，生有邊無邊有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there will be consciousnesses with limits and no limits that give rise to self, which are true while the rest are false.'",
        "source": "T01n0001_014:0092b27_27"
    },
    {
        "source_sentence": "有言：『我此終後，生非有邊非無邊有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there won't be a consciousness with neither limits nor no limits that arises, but this is true while the rest is false.'",
        "source": "T01n0001_014:0092b28_28"
    },
    {
        "source_sentence": "有言：『我此終後，生而一向有樂有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll always have pleasure and consciousness when I'm born, but this is true while the rest is false.'",
        "source": "T01n0001_014:0092b29_29"
    },
    {
        "source_sentence": "有言：『我此終後，生而一向有苦有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll always have painful feelings and consciousnesses when I'm born, but this is true while the rest is false.'",
        "source": "T01n0001_014:0092c01_30"
    },
    {
        "source_sentence": "有言：『我此終後，生有樂有苦有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there will be happiness, pain, and perception of self, which is true while the rest is false.'",
        "source": "T01n0001_014:0092c02_31"
    },
    {
        "source_sentence": "有言：『我此終後，生不苦不樂有想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll give rise to feelings that are neither painful nor pleasant, which are true while the rest are false.'",
        "source": "T01n0001_014:0092c03_32"
    },
    {
        "source_sentence": "有言：『我此終後，生有一想，此實餘虛。』",
        "translation": "Some people say, 'After I die here, there's a single ideation of self that arises, which is real and the rest is false.'",
        "source": "T01n0001_014:0092c04_33"
    },
    {
        "source_sentence": "有言：『我此終後，生有若干想，此實餘虛。』",
        "translation": "Some people say, 'After I die here, there will be certain conceptions of self that arise, which are real and the rest are false.'",
        "source": "T01n0001_014:0092c05_34"
    },
    {
        "source_sentence": "有言：『我此終後，生少想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll give rise to a few thoughts, which are real and the rest are false.'",
        "source": "T01n0001_014:0092c06_35"
    },
    {
        "source_sentence": "有言：『我此終後，生有無量想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there will be an infinite conception of self that's real and the rest false.'",
        "source": "T01n0001_014:0092c06_36"
    },
    {
        "source_sentence": "是為十六見。",
        "translation": "These are the sixteen views.",
        "source": "T01n0001_014:0092c07_37"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於末劫末見，生想論，說世間有想；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting that there will be consciousness in the world after death.",
        "source": "T01n0001_014:0092c08_38"
    },
    {
        "source_sentence": "於此十六見中，齊是不過，唯佛能知，亦復如是。",
        "translation": "Within these sixteen theories, there is neither identical nor different. Only the Buddha knows them and so on, just as has been said:",
        "source": "T01n0001_014:0092c09_39"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，何等法是？",
        "translation": "“Furthermore, there are other profound and subtle rays of light of the great teaching. What is this light?",
        "source": "T01n0001_014:0092c10_40"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於末劫末見，生無想論，說世間無想；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting that there will be no consciousness in the world after death.",
        "source": "T01n0001_014:0092c11_41"
    },
    {
        "source_sentence": "彼盡入八見中，於末劫末見，生無想論，於此八見中，齊此不過。",
        "translation": "They all fall into the eight theories that speculate about the final eon of the future and give rise to nonconceptual theories. But these theories do not exceed those eight.",
        "source": "T01n0001_014:0092c12_42"
    },
    {
        "source_sentence": "彼沙門、婆羅門因何事於末劫末見，生無想論，說世間無想，於八見中，",
        "translation": "“World-honored One, why do the śramaṇas and brāhmaṇas speculate about the final eon of the future? They hold that there will be no consciousness in the world after death.",
        "source": "T01n0001_014:0092c14_43"
    },
    {
        "source_sentence": "齊此不過？",
        "translation": "Is this only the same as that?",
        "source": "T01n0001_014:0092c15_44"
    },
    {
        "source_sentence": "諸有沙門、婆羅門作如是見，作如是論：『我此終後，生有色無想，此實餘虛。』",
        "translation": "Some śramaṇas and brāhmaṇas have such views and make such arguments, saying, 'After this end, I'll be born with form and no consciousness, which is true while the rest are false.'",
        "source": "T01n0001_014:0092c16_45"
    },
    {
        "source_sentence": "有言：『我此終後，生無色無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born without form or consciousness, which is true while the rest are false.'",
        "source": "T01n0001_014:0092c17_46"
    },
    {
        "source_sentence": "有言：『我此終後，生有色無色無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born with form and formlessness and no consciousness; this is true while the rest is false.'",
        "source": "T01n0001_014:0092c18_47"
    },
    {
        "source_sentence": "有言：『我此終後，生非有色非無色無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born neither with form nor without form or consciousness, which is true and the rest false.'",
        "source": "T01n0001_014:0092c19_48"
    },
    {
        "source_sentence": "有言：『我此終後，生有邊無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born with limitless consciousness and no consciousness; this is true while the rest is false.'",
        "source": "T01n0001_014:0092c20_49"
    },
    {
        "source_sentence": "有言：『我此終後，生無邊無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born without limit or consciousness, which is true while the rest are false.'",
        "source": "T01n0001_014:0092c21_50"
    },
    {
        "source_sentence": "有言：『我此終後，生有邊無邊無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there will be birth with limits and limitless consciousnesses, which is true while the rest are false.'",
        "source": "T01n0001_014:0092c22_51"
    },
    {
        "source_sentence": "有言：『我此終後，生非有邊非無邊無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, birth is neither finite nor infinite, and there's no consciousness; this is true while the rest is false.'",
        "source": "T01n0001_014:0092c23_52"
    },
    {
        "source_sentence": "是為八見。",
        "translation": "These are the eight views.",
        "source": "T01n0001_014:0092c24_53"
    },
    {
        "source_sentence": "若沙門、婆羅門因此於末劫末見，生無想論，說世間無想；",
        "translation": "“Other śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting that there will be no consciousness in the world after death.",
        "source": "T01n0001_014:0092c24_54"
    },
    {
        "source_sentence": "彼盡入八見中，齊是不過，唯佛能知，亦復如是。",
        "translation": "These theories can be classified exhaustively into eight variations without exceeding that number. Only the Buddha knows these theories, and so on, just as above.",
        "source": "T01n0001_014:0092c26_55"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，何等法是？",
        "translation": "“Furthermore, there are other profound and subtle rays of light of the great teaching. What is this light?",
        "source": "T01n0001_014:0092c27_56"
    },
    {
        "source_sentence": "或有沙門、婆羅門於末劫末見，生非想非非想論，說此世間非想非非想；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting theories of neither perception nor non-perception. They assert that this world is neither perception nor non-perception.",
        "source": "T01n0001_014:0092c28_57"
    },
    {
        "source_sentence": "彼盡入八見中，於末劫末見，作非想非非想論，說世間非想非非想，於八見中，",
        "translation": "They all belong to the eight theories, asserting theories of neither perception nor non-perception concerning the final eon of the future.",
        "source": "T01n0001_014:0092c29_58"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0093a02_59"
    },
    {
        "source_sentence": "彼沙門、婆羅門因何事於末劫末見，生非想非非想論，說世間非想非非想，",
        "translation": "“World-honored One, why do those śramaṇas and brāhmaṇas give rise to theories of neither perception nor non-perception in regard to the final eon of the future? What is the reason they hold a view of neither perception nor non-perception with regard to the final eon of the future?",
        "source": "T01n0001_014:0093a03_60"
    },
    {
        "source_sentence": "於八見中，齊是不過？",
        "translation": "Among the eight views, are they all the same or different?",
        "source": "T01n0001_014:0093a04_61"
    },
    {
        "source_sentence": "諸沙門、婆羅門作如是論，作如是見：『我此終後，生有色非有想非無想，",
        "translation": "The śramaṇas and brāhmaṇas hold this view: “After my death, there will be a consciousness that has form (i.e., a self with form but not ideation or non-thought) at the end of my life.” Some other śramaṇas and brāhmaṇas hold this view:",
        "source": "T01n0001_014:0093a05_62"
    },
    {
        "source_sentence": "此實餘虛。』",
        "translation": "This is real and the rest are false.'",
        "source": "T01n0001_014:0093a07_63"
    },
    {
        "source_sentence": "有言：『我此終後，生無色非有想非無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born in formlessness that's neither with nor without consciousness, which is true and the rest false.'",
        "source": "T01n0001_014:0093a07_64"
    },
    {
        "source_sentence": "有言：『我此終後，生有色無色非有想非無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born with form and formlessness that's neither conscious nor without consciousness, but this is true while the rest is false.'",
        "source": "T01n0001_014:0093a08_65"
    },
    {
        "source_sentence": "有言：『我此終後，生非有色非無色非有想非無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born that's neither colored nor formless, neither with or without perception, and neither with or without perception; this is true while the rest is false.'",
        "source": "T01n0001_014:0093a09_66"
    },
    {
        "source_sentence": "有言：『我此終後，生有邊非有想非無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there will be a self with limits that are neither conscious nor without consciousness, which is true and the rest false.'",
        "source": "T01n0001_014:0093a11_67"
    },
    {
        "source_sentence": "有言：『我此終後，生無邊非有想非無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, there will be an infinite self that has neither perception nor non-perception, which is true and the rest false.'",
        "source": "T01n0001_014:0093a12_68"
    },
    {
        "source_sentence": "有言：『我此終後，生有邊無邊非有想非無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, I'll be born with limits and no limits, not with or without consciousness, but this is true while the rest are false.'",
        "source": "T01n0001_014:0093a13_69"
    },
    {
        "source_sentence": "有言：『我此終後，生非有邊非無邊非有想非無想，此實餘虛。』",
        "translation": "Some people say, 'After my death here, birth is neither finite nor infinite, neither existent nor nonexistent, and neither has perception nor no perception; this is true while the rest is false.'",
        "source": "T01n0001_014:0093a14_70"
    },
    {
        "source_sentence": "是為八見。",
        "translation": "These are the eight views.",
        "source": "T01n0001_014:0093a15_71"
    },
    {
        "source_sentence": "若沙門、婆羅門因此於末劫末見，生非有想非無想論，說世間非有想非無想，",
        "translation": "“Other śramaṇas and brāhmaṇas assert speculative theories concerning the final eon of the future, asserting that there is neither consciousness nor nonconsciousness in the world.",
        "source": "T01n0001_014:0093a16_72"
    },
    {
        "source_sentence": "盡入八見中，齊是不過，唯佛能知，亦復如是。",
        "translation": "They can be classified exhaustively into eight theories without exceeding that number. Only the Buddha knows them, and so on, just as has been said:",
        "source": "T01n0001_014:0093a18_0"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，何等法是？",
        "translation": "“Furthermore, there are other profound and subtle rays of light of the great teaching. What is this light?",
        "source": "T01n0001_014:0093a19_1"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於末劫末見，起斷滅論，說眾生斷滅無餘；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting theories of annihilation. They hold that all sentient beings are to be eliminated without remainder.",
        "source": "T01n0001_014:0093a20_0"
    },
    {
        "source_sentence": "彼盡入七見中，於末劫末見起斷滅論，說眾生斷滅無餘，於七見中，齊是不過。",
        "translation": "These theories can be classified exhaustively into seven variations without exceeding that number. They speculate about the final eon of the future and propose theories of annihilation, asserting that all living beings are to be annihilated without remainder.",
        "source": "T01n0001_014:0093a21_1"
    },
    {
        "source_sentence": "彼沙門、婆羅門因何事於末劫末見，起斷滅論，說眾生斷滅無餘，於七見中，",
        "translation": "“World-honored One, why do the śramaṇas and brāhmaṇas speculate about the final eon of the future? Why do they hold a view of annihilation in regard to the final eon of the future? They assert that all living beings will be destroyed without remainder.",
        "source": "T01n0001_014:0093a23_2"
    },
    {
        "source_sentence": "齊是不過？",
        "translation": "Is this the same but not more?",
        "source": "T01n0001_014:0093a25_3"
    },
    {
        "source_sentence": "諸有沙門、婆羅門作如是論，作如是見：『我身四大、六入，從父母生，",
        "translation": "Some śramaṇas and brāhmaṇas hold this view: “My body consists of the four material elements and six sense bases, which are derived from my parents.",
        "source": "T01n0001_014:0093a25_4"
    },
    {
        "source_sentence": "乳餔養育，衣食成長，摩捫擁護，然是無常，必歸磨滅，齊是名為斷滅。』",
        "translation": "Dairy milk nourishes, food and clothing grow, and moisture embraces it, but it's impermanent and will surely return to grinding and ceasing, which is called cessation.'",
        "source": "T01n0001_014:0093a26_5"
    },
    {
        "source_sentence": "第一見也。",
        "translation": "It's the first view.",
        "source": "T01n0001_014:0093a28_6"
    },
    {
        "source_sentence": "或有沙門、婆羅門作是說，言：『此我不得名斷滅，我欲界天斷滅無餘，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert, “This self cannot be called nirvana (i.e., annihilation), but rather the gods in the heavens of the realm of desire can be called nirvana without exception.” Some other śramaṇas and brāhmaṇas assert:",
        "source": "T01n0001_014:0093a28_7"
    },
    {
        "source_sentence": "齊是為斷滅。』",
        "translation": "This is the same as cessation.'",
        "source": "T01n0001_014:0093b01_8"
    },
    {
        "source_sentence": "是為二見。",
        "translation": "These are the two views.",
        "source": "T01n0001_014:0093b01_9"
    },
    {
        "source_sentence": "或有沙門、婆羅門作是說，言：『此非斷滅，我色界化身，諸根具足，",
        "translation": "Some śramaṇas and brāhmaṇas assert, “This is not nirvana. The apparitional body of the self in Rūpadhātu is endowed with all its faculties:",
        "source": "T01n0001_014:0093b01_10"
    },
    {
        "source_sentence": "斷滅無餘，是為斷滅。』",
        "translation": "To eliminate it without remainder is to eliminate it.'",
        "source": "T01n0001_014:0093b03_11"
    },
    {
        "source_sentence": "有言：『此非斷滅，我無色空處斷滅。』",
        "translation": "Some people say, 'This is not cessation; I cease in the formless realm of emptiness.'",
        "source": "T01n0001_014:0093b03_12"
    },
    {
        "source_sentence": "有言：『此非斷滅，我無色識處斷滅。』",
        "translation": "Some people say, 'This is not cessation; I cease in the formless consciousness realm.'",
        "source": "T01n0001_014:0093b04_13"
    },
    {
        "source_sentence": "有言：『此非斷滅，我無色不用處斷滅。』",
        "translation": "Some people say, 'This is not cessation; I'm formless and don't use the abode of cessation.'",
        "source": "T01n0001_014:0093b05_14"
    },
    {
        "source_sentence": "有言：『此非斷滅，我無色有想無想處斷滅，是第七斷滅。』",
        "translation": "Some people say, 'This is not cessation; the cessation of self in the formless realm where there's perception and non-perception is the seventh cessation.'",
        "source": "T01n0001_014:0093b06_15"
    },
    {
        "source_sentence": "是為七見。",
        "translation": "These are the seven views.",
        "source": "T01n0001_014:0093b07_16"
    },
    {
        "source_sentence": "諸有沙門、婆羅門因此於末劫末見，言此眾生類斷滅無餘；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future, saying that all sentient beings will be annihilated without remainder.",
        "source": "T01n0001_014:0093b07_17"
    },
    {
        "source_sentence": "於七見中，齊此不過，唯佛能知，亦復如是。",
        "translation": "Among the seven theories, they are all the same as these and can only be known by a buddha.",
        "source": "T01n0001_014:0093b09_18"
    },
    {
        "source_sentence": "「復有餘甚深微妙大法光明，何等法是？",
        "translation": "“Furthermore, there are other profound and subtle rays of light of the great teaching. What is this light?",
        "source": "T01n0001_014:0093b10_19"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於末劫末見，現在生泥洹論，說眾生現在有泥洹；",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting that there will be nirvana in the present.",
        "source": "T01n0001_014:0093b11_20"
    },
    {
        "source_sentence": "彼盡入五見中，於末劫末見說現在有泥洹，於五見中，齊是不過。",
        "translation": "They all fall into the five theories and hold that there is nirvana in the present at the end of the last kalpa. But these theories are limited to five:",
        "source": "T01n0001_014:0093b12_21"
    },
    {
        "source_sentence": "彼沙門、婆羅門因何事於末劫末見，說眾生現有泥洹，於五見中，齊是不過？",
        "translation": "For what reason do the śramaṇas and brāhmaṇas speculate about the final eon of the future, asserting that there will be nirvana in sentient beings? Among the five theories mentioned above, only one is exclusively correct.",
        "source": "T01n0001_014:0093b14_22"
    },
    {
        "source_sentence": "諸有沙門、婆羅門作是見，作是論，說：『我於現在五欲自恣，此是我得現在泥洹。』",
        "translation": "Some śramaṇas and brāhmaṇas hold this view and make this argument, saying, 'In the present, I'll perform the five desires for self-restraint; this is the self that attains nirvāṇa in the present.'",
        "source": "T01n0001_014:0093b16_23"
    },
    {
        "source_sentence": "是第一見。",
        "translation": "This is the first view.",
        "source": "T01n0001_014:0093b18_24"
    },
    {
        "source_sentence": "復有沙門、婆羅門作是說：『此是現在泥洹，非不是，復有現在泥洹微妙第一，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert, “This is nirvana in the present life. It is neither right nor wrong.",
        "source": "T01n0001_014:0093b18_25"
    },
    {
        "source_sentence": "汝所不知，獨我知耳；",
        "translation": "I alone know what you do not know.",
        "source": "T01n0001_014:0093b20_26"
    },
    {
        "source_sentence": "如我去欲、惡不善法，有覺、有觀離生喜、樂，入初禪，此名現在泥洹。』",
        "translation": "Suppose I go away from desire, bad and unskillful qualities, have feelings and contemplations, become free of joy and happiness, enter the first dhyāna, and this is called present nirvāṇa.'",
        "source": "T01n0001_014:0093b20_27"
    },
    {
        "source_sentence": "是第二見。",
        "translation": "This is the second view.",
        "source": "T01n0001_014:0093b22_28"
    },
    {
        "source_sentence": "「復有沙門、婆羅門作如是說：『此是現在泥洹，非不是，復有現在泥洹微妙第一，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert, “This is nirvana in the present life. It is neither right nor wrong.",
        "source": "T01n0001_014:0093b22_29"
    },
    {
        "source_sentence": "汝所不知，獨我知耳；",
        "translation": "I alone know what you do not know.",
        "source": "T01n0001_014:0093b24_30"
    },
    {
        "source_sentence": "如我滅有覺、觀，內喜、一心，無覺、無觀，定生喜、樂，入第二禪。』",
        "translation": "Suppose I cease having feelings and contemplations, internal joy and one mind, no feelings and no contemplations, and enter the second dhyāna with joy and happiness that arise from concentration.'",
        "source": "T01n0001_014:0093b24_31"
    },
    {
        "source_sentence": "齊是名現在泥洹，是為第三見。",
        "translation": "Qi is called nirvāṇa in the present, which is the third view.",
        "source": "T01n0001_014:0093b26_32"
    },
    {
        "source_sentence": "復有沙門、婆羅門作是說，言：『此是現在泥洹，非不是，復有現在泥洹微妙第一，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert: This is nirvana in the present life. It is neither right nor wrong. There is also nirvana in the present life that is most subtle and marvelous.",
        "source": "T01n0001_014:0093b27_33"
    },
    {
        "source_sentence": "汝所不知，獨我知耳；",
        "translation": "I alone know what you do not know.",
        "source": "T01n0001_014:0093b29_0"
    },
    {
        "source_sentence": "如我除念、捨、喜、住樂，護念一心，自知身樂，賢聖所說，入第三禪。』",
        "translation": "Suppose I remove mindfulness, equanimity, equanimity, joy, and abiding in bliss, guard my mindfulness with one mind, know for myself the bliss of body, enter the third dhyāna as taught by the good and noble ones.'",
        "source": "T01n0001_014:0093b29_1"
    },
    {
        "source_sentence": "齊是名現在泥洹，是為第四見。",
        "translation": "Qi is called nirvāṇa in the present, which is the fourth view.",
        "source": "T01n0001_014:0093c02_0"
    },
    {
        "source_sentence": "復有沙門、婆羅門作是說，言：『此是現在泥洹，非不是，現在泥洹復有微妙第一，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert: This is the nirvana to be experienced in the present life. It is neither right nor wrong. The nirvana to be experienced in the present life is also subtle and most subtle.",
        "source": "T01n0001_014:0093c02_1"
    },
    {
        "source_sentence": "汝所不知，獨我知耳；",
        "translation": "I alone know what you do not know.",
        "source": "T01n0001_014:0093c04_2"
    },
    {
        "source_sentence": "如我樂滅、苦滅，先除憂、喜，不苦不樂，護念清淨，入第四禪。』",
        "translation": "Suppose I cease delight in self and cease suffering, first remove grief and joy, don't experience pain or pleasure, guard my mindfulness and purify it, and enter the fourth meditation.'",
        "source": "T01n0001_014:0093c05_3"
    },
    {
        "source_sentence": "此名第一泥洹，是為第五見。",
        "translation": "This is called the first nirvāṇa, which is the fifth view.",
        "source": "T01n0001_014:0093c06_4"
    },
    {
        "source_sentence": "若沙門、婆羅門於末劫末見，生現在泥洹論，於五見中，齊是不過，唯佛能知，",
        "translation": "If śramaṇas and brāhmaṇas hold speculative theories concerning the final eon of the future (Mahayana) and give rise to a theory of nirvana in the present. But these theories can be classified into five variations without exceeding that number. Only the Buddha knows this.",
        "source": "T01n0001_014:0093c07_5"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T01n0001_014:0093c08_6"
    },
    {
        "source_sentence": "「諸有沙門、婆羅門於末劫末見，無數種種，隨意所說；",
        "translation": "“Some śramaṇas and brāhmaṇas speculate freely about the final eon of the future, holding innumerable theories as to its end.",
        "source": "T01n0001_014:0093c09_7"
    },
    {
        "source_sentence": "於四十四見中，齊是不過，唯佛能知此諸見處，亦復如是。",
        "translation": "The Buddha alone knows the very basis of these theories, and so on, just as has been said:",
        "source": "T01n0001_014:0093c10_8"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於本劫本見、末劫末見，無數種種，隨意所說，盡入此六十二見中；",
        "translation": "Some śramaṇas and brāhmaṇas hold innumerable speculative theories about the initial eon of the past as well as the final eon of the future. Any theory they wish can be classified exhaustively into these sixty-two variations.",
        "source": "T01n0001_014:0093c11_9"
    },
    {
        "source_sentence": "於本劫本見、末劫末見，無數種種，隨意所說；",
        "translation": "Innumerable various theories as to the initial eon of the past and the final eon of the future aeons are taught at will.",
        "source": "T01n0001_014:0093c13_10"
    },
    {
        "source_sentence": "於六十二見中，齊此不過，唯如來知此見處，亦復如是。",
        "translation": "Only the Tathāgata knows this viewpoint, and so on, just as above.",
        "source": "T01n0001_014:0093c14_11"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於本劫本見，生常論，說：『我、世間是常。』",
        "translation": "Some śramaṇas and brāhmaṇas hold a view of permanence in regard to the initial eon, saying, 'The self and the world are permanent.'",
        "source": "T01n0001_014:0093c16_0"
    },
    {
        "source_sentence": "彼沙門、婆羅門於此生智，謂異信、異欲、異聞、異緣、異覺、異見、異定、異忍，",
        "translation": "“These śramaṇas and brāhmaṇas have different faiths, different desires, different learnings, different conditions, different enlightened ones, different views, different concentrations, and different tolerances.",
        "source": "T01n0001_014:0093c17_1"
    },
    {
        "source_sentence": "因此生智，彼以希現則名為受，——乃至現在泥洹，亦復如是。",
        "translation": "As a result, knowledge arises, which is called sensation because it's desired to be manifested, and so forth, up to the present nirvāṇa, which is likewise.",
        "source": "T01n0001_014:0093c18_2"
    },
    {
        "source_sentence": "諸有沙門、婆羅門生常論，言：『世間是常。』",
        "translation": "Some śramaṇas and brāhmaṇas argue about permanence, saying, 'The world is permanent.'",
        "source": "T01n0001_014:0093c20_3"
    },
    {
        "source_sentence": "彼因受緣，起愛生愛而不自覺知，染著於愛，為愛所伏，——乃至現在泥洹，",
        "translation": "They give rise to craving because of sensation as a condition, don’t know it for themselves, become attached to craving, and are subdued by craving - up to the present nirvāṇa.",
        "source": "T01n0001_014:0093c21_4"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T01n0001_014:0093c22_5"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於本劫本見，生常論，言：『世間是常。』",
        "translation": "Some śramaṇas and brāhmaṇas hold the view that the original eon is eternal, saying, 'The world is permanent.'",
        "source": "T01n0001_014:0093c23_6"
    },
    {
        "source_sentence": "彼因觸緣故，若離觸緣而立論者，無有是處，——乃至現在泥洹，亦復如是。",
        "translation": "If they establish a theory that's based on contact as the cause and conditions, there's no place for it, and so does nirvāṇa in the present, which is likewise.",
        "source": "T01n0001_014:0093c24_7"
    },
    {
        "source_sentence": "諸有沙門、婆羅門於本劫本見、末劫末見，各隨所見說，彼盡入六十二見中，",
        "translation": "Some śramaṇas and brāhmaṇas speculate about the initial eon of the past, or speculate about the final eon of the future according to their own theories. All of these theories can be classified into sixty-two variations:",
        "source": "T01n0001_014:0093c26_8"
    },
    {
        "source_sentence": "各隨所見說，盡依中在中，齊是不過。",
        "translation": "Each is explained in accordance with what it sees. All depends on the middle and abides in the middle, but this does not go beyond the middle.",
        "source": "T01n0001_014:0093c27_9"
    },
    {
        "source_sentence": "猶如巧捕魚師，以細目網覆小池上，當知池中水性之類，皆入網內，無逃避處，",
        "translation": "It's like a skillful fisherman who covers a small lake with a fine-eyed net. You should know that all the watery species in the lake enter into the net, and there's no place to run away.",
        "source": "T01n0001_014:0093c28_10"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0094a01_11"
    },
    {
        "source_sentence": "諸沙門、婆羅門亦復如是，於本劫本見、末劫末見，種種所說，盡入六十二見中，",
        "translation": "Similarly, the various theories held by śramaṇas and brāhmaṇas as to the initial eon of the past and final eon of the future are classified exhaustively into sixty-two variations.",
        "source": "T01n0001_014:0094a01_12"
    },
    {
        "source_sentence": "齊是不過。",
        "translation": "Qi is nothing but that.",
        "source": "T01n0001_014:0094a03_13"
    },
    {
        "source_sentence": "「若比丘於六觸集、滅、味、過、出要，如實而知，則為最勝，出彼諸見。",
        "translation": "“If a monk knows the six sense faculties of touch, arising, ceasing, taste, permeation, and exiting essentials as they really are, then he’s the most superior, and he’s expelled those views.",
        "source": "T01n0001_014:0094a03_14"
    },
    {
        "source_sentence": "如來自知生死已盡，所以有身，為欲福度諸天、人故，若其無身，則諸天、世人無所恃怙，",
        "translation": "The Tathāgata knows that birth and death have ended, so he has a body because he wants to save gods and humans with merit. If they don’t have a body, the gods and humans will have no support.",
        "source": "T01n0001_014:0094a05_15"
    },
    {
        "source_sentence": "猶如多羅樹斷其頭者，則不復生。",
        "translation": "It's like a palm tree that cuts off its head, and then it doesn't grow again.",
        "source": "T01n0001_014:0094a07_16"
    },
    {
        "source_sentence": "佛亦如是，已斷生死，永不復生。」",
        "translation": "So it is with the Buddha, who has cut off birth and death and never arises again.",
        "source": "T01n0001_014:0094a08_17"
    },
    {
        "source_sentence": "當佛說此法時，大千世界三返六種震動。",
        "translation": "When the Buddha taught this teaching, the great chiliocosm trembled in three ways and six ways.",
        "source": "T01n0001_014:0094a09_0"
    },
    {
        "source_sentence": "爾時，阿難在佛後執扇扇佛，偏露右臂，長跪叉手，白佛言：「此法甚深，",
        "translation": "At that time, Ānanda was standing behind the Buddha, fanning him with his right shoulder bared and folded his right shoulder. Kneeling cross-legged, he said to the Buddha:",
        "source": "T01n0001_014:0094a10_0"
    },
    {
        "source_sentence": "當以何名？",
        "translation": "What name should it be given?",
        "source": "T01n0001_014:0094a11_1"
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you consecrate it?",
        "source": "T01n0001_014:0094a11_2"
    },
    {
        "source_sentence": "佛告阿難：「當名此經為義動、法動、見動、魔動、梵動。」",
        "translation": "The Buddha told Ānanda, You should call this sūtra the movement of meaning, the movement of dharmas, the movement of views, the movement of Māra, and the movement of Brahmā.",
        "source": "T01n0001_014:0094a12_3"
    },
    {
        "source_sentence": "爾時，阿難聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, Ānanda was delighted and remembered it well.",
        "source": "T01n0001_014:0094a13_4"
    },
    {
        "source_sentence": "佛說長阿含經卷第十四",
        "translation": "Foshuo chang ahan jing jing, vol. 14",
        "source": "T01n0001_014:0094a14_0"
    }
]