[
    {
        "source_sentence": "起世經卷第四",
        "translation": "Qishi jing, vol. 4",
        "source": "T01n0024_004:0327a27_0"
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多等譯",
        "translation": "Translated by the Tripiṭaka Master Jñānagupta of India and others",
        "source": "T01n0024_004:0327a29_0"
    },
    {
        "source_sentence": "地獄品第四之三",
        "translation": "The Fourth and Third Part of the Chapter on Hell",
        "source": "T01n0024_004:0327b01_0"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0327b02_0"
    },
    {
        "source_sentence": "彼阿毘至大地獄中，亦有十六諸小地獄而為眷屬，以自圍繞，其獄各廣五百由旬，",
        "translation": "In the great hell Abhirati there are also sixteen minor hells surrounding each of them, each five hundred yojanas in width.",
        "source": "T01n0024_004:0327b02_1"
    },
    {
        "source_sentence": "初黑雲沙乃至最後寒氷地獄。",
        "translation": "The first is the hell of black clouds and sand, and the last is the cold ice hell.",
        "source": "T01n0024_004:0327b04_2"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0327b04_3"
    },
    {
        "source_sentence": "如是地獄有何因緣，名阿毘至耶？",
        "translation": "What is the reason this hell is called abhijit?",
        "source": "T01n0024_004:0327b05_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0327b05_5"
    },
    {
        "source_sentence": "此阿毘至大地獄中所有眾生，生者有者出者住者，是諸眾生惡業果故，",
        "translation": "In this abhidharma, all sentient beings in the great hell are born and exist; those who emerge and live are the results of bad actions of sentient beings.",
        "source": "T01n0024_004:0327b06_6"
    },
    {
        "source_sentence": "自然出生諸守獄卒，各以兩手執彼地獄諸眾生身，撲置熾燃熱鐵地上，",
        "translation": "The guards in this hell naturally appear, holding the bodies of those beings in their hands and throwing them on a ground of blazing hot iron.",
        "source": "T01n0024_004:0327b07_7"
    },
    {
        "source_sentence": "火焰直上一向猛盛，覆面於地，便持利刀，從脚踝上，破出其筋，手捉挽之，",
        "translation": "The flame was so intense that it covered his face and flew straight up to the ground. He then held a sharp sword in his hand, broke through the tendons at his ankles, pulled the sinews out of his forehead, and snatched [the knife] in his hand.",
        "source": "T01n0024_004:0327b09_8"
    },
    {
        "source_sentence": "乃至項筋，皆相連引，貫徹心髓，痛苦難論。",
        "translation": "Up to the neck and tendons are all pulled one after the other, carrying the marrow of their hearts and minds, which is painful and difficult to describe.",
        "source": "T01n0024_004:0327b11_9"
    },
    {
        "source_sentence": "如是挽已，令駕鐵車，馳奔而走，其車甚熱，光焰熾燃，一向猛盛，將其經歷無量由旬。",
        "translation": "After pulling it in this way, they were driven to an iron chariot that was very hot with a blazing light and flame burning brightly and intensely hot. It traveled for measureless yojanas.",
        "source": "T01n0024_004:0327b12_10"
    },
    {
        "source_sentence": "所行之處，純是洞然熱鐵險道，去已復去，隨獄卒意無暫停時，欲向何方，",
        "translation": "The place where they traveled was simply a cave, on a dangerous path of hot iron. They left and departed without stopping to follow the prisoners’ wishes; however, there was no time for them to change their directions.",
        "source": "T01n0024_004:0327b14_11"
    },
    {
        "source_sentence": "稱意即去。",
        "translation": "He called it his intention and departed.",
        "source": "T01n0024_004:0327b16_0"
    },
    {
        "source_sentence": "隨所去處，隨所到處，獄卒挽之，未曾捨離。",
        "translation": "Wherever he goes and wherever he arrives, the jailer pulls him away but never lets him go.",
        "source": "T01n0024_004:0327b16_1"
    },
    {
        "source_sentence": "如是去時，隨所經歷，銷鑠罪人身諸肉血無復遺餘。",
        "translation": "When he leaves in this way, according to what he experiences, he removes the flesh and blood of the sinners' bodies with no residue left behind.",
        "source": "T01n0024_004:0327b17_2"
    },
    {
        "source_sentence": "以是因緣，受嚴切苦、極重劇苦、意不憙苦，命亦未終。",
        "translation": "Because of these causes and conditions, he suffers from intense pain, extreme pain, and mental distress, and his life doesn't end.",
        "source": "T01n0024_004:0327b18_3"
    },
    {
        "source_sentence": "乃至未盡惡不善業，未滅未散、未變未移，若於往昔人非人身，所作來者，",
        "translation": "Even if someone hadn’t ended bad and unskillful actions, extinguished them, dispersed them, or changed them, or moved them, then they wouldn’t be born in the past as human beings or non-human beings.",
        "source": "T01n0024_004:0327b19_4"
    },
    {
        "source_sentence": "一切悉受。",
        "translation": "All of them are fully received.",
        "source": "T01n0024_004:0327b21_5"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0327b22_0"
    },
    {
        "source_sentence": "此阿毘至大地獄中所有眾生，生者有者化者住者，以其不善業果報故，",
        "translation": "In this abhidharma, all sentient beings who are born in the great hell have birth and those who are reborn by transfiguration live because of the results of their unwholesome actions.",
        "source": "T01n0024_004:0327b22_1"
    },
    {
        "source_sentence": "從於東方，有大火聚忽爾出生，熾燃赤色，極大猛焰，一向炎赫；",
        "translation": "In the eastern direction a great conflagration suddenly appeared, glowing red in color. The flame was extremely large and intense, always burning brightly.",
        "source": "T01n0024_004:0327b23_2"
    },
    {
        "source_sentence": "如是次第，南西北方、四維上下，各各皆有極大火聚，熾燃出生，光焰炎赫。",
        "translation": "Thus, in order, each of the south, west, north, north, square, and four-cornered boundaries has an extremely large cluster of fire. A blazing flame arises from it, shining brightly and blazing hotly.",
        "source": "T01n0024_004:0327b25_3"
    },
    {
        "source_sentence": "罪人爾時，以此四方諸大火聚之所圍繞，漸漸逼近，觸其身故，受諸痛苦，",
        "translation": "At that moment the malefactors are surrounded by these masses of blazing fire in all four directions, gradually drawing nearer and closer.",
        "source": "T01n0024_004:0327b27_4"
    },
    {
        "source_sentence": "乃至受於大嚴切苦，命亦未終。",
        "translation": "Even if they experience great pain and suffering, their lives won't end.",
        "source": "T01n0024_004:0327b28_5"
    },
    {
        "source_sentence": "略說如上，於彼獄中，一切具受。",
        "translation": "I'll briefly explain it as above, and all of them will be received in that prison.",
        "source": "T01n0024_004:0327b29_6"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0327c02_0"
    },
    {
        "source_sentence": "此阿毘至大地獄中諸眾生等，生者有者乃至住者，惡業果故，從於東壁出大光焰，",
        "translation": "This abhidharma goes so far as to say that the sentient beings in the great hell are born, exist, and live. Because of the results of bad karma, a great flame of light emerges from the eastern wall:",
        "source": "T01n0024_004:0327c02_1"
    },
    {
        "source_sentence": "直射西壁，到已而住；",
        "translation": "He went straight up to the western wall and stayed there when he arrived.",
        "source": "T01n0024_004:0327c04_2"
    },
    {
        "source_sentence": "從於西壁出大光焰，直射東壁，到已而住；",
        "translation": "From the western wall a great flame of light emerges and immediately shoots toward the eastern wall.",
        "source": "T01n0024_004:0327c04_3"
    },
    {
        "source_sentence": "從於南壁出大光焰，直射北壁；",
        "translation": "From the south wall a great flame of light emerges and immediately shoots toward the north wall.",
        "source": "T01n0024_004:0327c05_4"
    },
    {
        "source_sentence": "從於北壁出大光焰，直射南壁；",
        "translation": "From the northern wall a great flame of light emerges and immediately shoots toward the southern wall.",
        "source": "T01n0024_004:0327c06_5"
    },
    {
        "source_sentence": "從下射上，自上射下；",
        "translation": "Shooting from below, they shoot upward; shooting from above, they shoot downward.",
        "source": "T01n0024_004:0327c07_6"
    },
    {
        "source_sentence": "縱橫相接，上下交射，熱光赫奕，騰焰相衝。",
        "translation": "Each side is connected to the other, and the top and bottom are interlocked. A ray of hot light blazes high and rising flames bump against each other.",
        "source": "T01n0024_004:0327c07_7"
    },
    {
        "source_sentence": "爾時，獄卒以諸罪人，擲置六種大火聚內。",
        "translation": "At the time, the jailer tossed the sinners into six kinds of large fire clusters.",
        "source": "T01n0024_004:0327c08_8"
    },
    {
        "source_sentence": "是諸罪人，乃至受於極嚴切苦，命亦未終。",
        "translation": "These sinners will experience extreme pain and suffering until their lives don't end.",
        "source": "T01n0024_004:0327c09_9"
    },
    {
        "source_sentence": "略說乃至彼不善業，未畢未盡，於其中間，具足而受。",
        "translation": "In brief, it's said up to those unwholesome actions that haven't ended and haven't ended yet, and they're fully received among them.",
        "source": "T01n0024_004:0327c10_10"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0327c12_0"
    },
    {
        "source_sentence": "此阿毘至大地獄中諸眾生等，生者有者乃至住者，惡業果故，經無量時受長遠苦。",
        "translation": "In this abhidharma, the sentient beings in the great hell and so on. Those who are born have some form of existence up to those who abide: because they are the fruit of bad action. For an immeasurable period of time, they experience long-lasting suffering.",
        "source": "T01n0024_004:0327c12_1"
    },
    {
        "source_sentence": "爾時，即見地獄東門忽然自開，是諸眾生既聞開聲，復見門開，便走趣之，",
        "translation": "At that moment, they see the east gate of hell suddenly open by itself. The sentient beings who hear the sound of this announcement also see the door open and run toward it.",
        "source": "T01n0024_004:0327c14_2"
    },
    {
        "source_sentence": "走已復走，大速疾走，各言：『我等至彼處已，決應得脫。",
        "translation": "They each said, ‘Once we reach that place, we will surely be liberated.",
        "source": "T01n0024_004:0327c16_3"
    },
    {
        "source_sentence": "我等今者若到彼處，應大吉祥。』",
        "translation": "Now, if we go there, we should be greatly auspicious.'",
        "source": "T01n0024_004:0327c17_4"
    },
    {
        "source_sentence": "彼諸眾生如是走時、走復走時、速疾走時，其身轉更熾燃光焰。",
        "translation": "When those sentient beings thus walk, walk again and again, and quickly walk, their bodies become even more blazing with a flame of light.",
        "source": "T01n0024_004:0327c18_5"
    },
    {
        "source_sentence": "譬如世間有力壯夫，將大火炬逆風而走，而彼火炬，更復轉燃，焰熾猛盛。",
        "translation": "It's like a powerful man in the world who takes a great torch of fire and walks against the wind, but that torch of fire goes on to burn again and again, and its flames are blazing and powerful.",
        "source": "T01n0024_004:0327c19_6"
    },
    {
        "source_sentence": "如是如是，彼諸眾生，如是走時，速疾走時，身諸支節，轉復熾燃，舉足之時肉血離散，",
        "translation": "Thus and so it is, when those sentient beings thus walk, their bodies and limbs become increasingly burned. As they lift their legs, flesh and blood scatter as they walk.",
        "source": "T01n0024_004:0327c21_7"
    },
    {
        "source_sentence": "下足之時肉血還生。",
        "translation": "When he lowered his legs, flesh and blood would grow back.",
        "source": "T01n0024_004:0327c23_8"
    },
    {
        "source_sentence": "又彼眾生，如是奔走，欲近門時，罪業力故，門還自閉。",
        "translation": "Again, when those sentient beings thus run and want to approach the door, the door closes by itself because of the power of their sins.",
        "source": "T01n0024_004:0327c23_9"
    },
    {
        "source_sentence": "罪人爾時，於彼獄中，熾燃光焰熱鐵地上，悶絕倒臥，覆面而踣。",
        "translation": "At the time, the offender was in that hell, blazing with light and flame, on a hot iron ground, screaming and lying down cross-legged, covering his face.",
        "source": "T01n0024_004:0327c25_0"
    },
    {
        "source_sentence": "既覆倒已，即燒其皮；",
        "translation": "After covering the inverted image, he immediately burns its skin.",
        "source": "T01n0024_004:0327c26_1"
    },
    {
        "source_sentence": "既燒皮已，次燒其肉；",
        "translation": "After the skin is burned, the flesh is next burned.",
        "source": "T01n0024_004:0327c27_0"
    },
    {
        "source_sentence": "既燒肉已，次燒其筋；",
        "translation": "Having burned the flesh, he next burns its tendons.",
        "source": "T01n0024_004:0327c27_1"
    },
    {
        "source_sentence": "既燒筋已，次燒其骨；",
        "translation": "Having burned the tendons, he next burns the bones.",
        "source": "T01n0024_004:0327c28_0"
    },
    {
        "source_sentence": "既燒骨已，徹至其髓。",
        "translation": "After it burns the bone, it penetrates into its marrow.",
        "source": "T01n0024_004:0327c28_1"
    },
    {
        "source_sentence": "徹至髓時，唯見烟出；",
        "translation": "When he penetrates the marrow, he sees only smoke coming out.",
        "source": "T01n0024_004:0327c29_0"
    },
    {
        "source_sentence": "出已復出，烟燧火出。",
        "translation": "After emerging, he emerges again, and smoke and flames emerge.",
        "source": "T01n0024_004:0327c29_1"
    },
    {
        "source_sentence": "罪人於中，乃至次第受極嚴苦，命亦未終。",
        "translation": "In this hell the sinners experience extreme pain one after another, but their lives do not end until death.",
        "source": "T01n0024_004:0328a01_0"
    },
    {
        "source_sentence": "略說如前，未盡彼人惡不善業，乃至往昔人非人身所作來者，於中具受。",
        "translation": "It's briefly explained as before, that person's bad and unskillful actions haven't ended, up to those who came in the past without a human body made them do so, and they'll be fully experienced there.",
        "source": "T01n0024_004:0328a02_0"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0328a04_0"
    },
    {
        "source_sentence": "此阿毘至大地獄中諸眾生等，生者有者乃至住者，以諸不善業果報故，",
        "translation": "This abhidharma goes so far as to say that the sentient beings in the great hell, etc., are born and exist up to their continuance because of the results of unwholesome actions.",
        "source": "T01n0024_004:0328a04_1"
    },
    {
        "source_sentence": "經無量時，長遠道中受諸苦已，地獄四門還復更開。",
        "translation": "After an immeasurable amount of time passed, the four gates of hell were opened again and again.",
        "source": "T01n0024_004:0328a05_2"
    },
    {
        "source_sentence": "於門開時，彼地獄中諸眾生等，聞聲見開，向門而走。",
        "translation": "When the door opens, the sentient beings in that hell hear the sound and see it open, heading for the door and walking away.",
        "source": "T01n0024_004:0328a07_3"
    },
    {
        "source_sentence": "走已復走，乃至大走，作如是念：『我等今者當於此處必應得脫，我等於今定當訖了。』",
        "translation": "After they walk, they run again and again, even up to the great step, and think, 'Now, we will surely be liberated here; we will surely finish it now.'",
        "source": "T01n0024_004:0328a08_4"
    },
    {
        "source_sentence": "彼人如是大馳走時，其身轉復熾燃猛烈。",
        "translation": "When that person thus chases away, his body becomes again blazing and fiercely hot.",
        "source": "T01n0024_004:0328a10_5"
    },
    {
        "source_sentence": "譬如壯夫執乾草炬逆風而走，彼炬既燃轉復熾盛。",
        "translation": "It's like a strong man holding a dry-grass torch that goes against the wind and walks, and once it's burned, it becomes even more blazing.",
        "source": "T01n0024_004:0328a11_6"
    },
    {
        "source_sentence": "如是如是，彼諸眾生走已復走，乃至大走，如是走時，彼人身分，轉更熾燃。",
        "translation": "Thus and so forth, after they walk, those sentient beings walk again and again, up to a great distance away. As they walk in this way, their bodies become even more blazingly hot.",
        "source": "T01n0024_004:0328a12_7"
    },
    {
        "source_sentence": "欲舉足時肉血俱散，欲下足時肉血還生。",
        "translation": "When he wants to lift his legs, flesh and blood will all scatter, and when he wants to lower his legs, flesh and blood will grow back.",
        "source": "T01n0024_004:0328a14_8"
    },
    {
        "source_sentence": "及到獄門，其門還閉。",
        "translation": "When he arrives at the gate of hell, the gate closes again.",
        "source": "T01n0024_004:0328a15_9"
    },
    {
        "source_sentence": "彼諸眾生於此熾燃熱鐵地上，一向馳走，既不得出，其心悶亂，覆面倒地。",
        "translation": "Those sentient beings are always running around on this blazing hot iron ground, and when they can't get out, their minds are in distress, covering the ground with confusion.",
        "source": "T01n0024_004:0328a15_10"
    },
    {
        "source_sentence": "既倒地已，遍燒身皮；",
        "translation": "Having fallen to the ground, he burns his body and skin all over.",
        "source": "T01n0024_004:0328a17_11"
    },
    {
        "source_sentence": "既燒皮已，次燒其肉；",
        "translation": "After the skin is burned, the flesh is next burned.",
        "source": "T01n0024_004:0328a17_12"
    },
    {
        "source_sentence": "既燒肉已，復燒其骨，乃至徹髓，烟焰洞燃，其烟熢[火*孛]，其焰炎赫，",
        "translation": "Having burned the flesh, he then burns the bones up to and including the marrow. The smoke and flames are engulfed in flames that glow as if they were fire.",
        "source": "T01n0024_004:0328a18_13"
    },
    {
        "source_sentence": "烟焰相雜，熱惱復倍，彼人於中受極嚴苦。",
        "translation": "The smoke and flames are mixed together, and the heat and torment are even greater. That person experiences extreme pain and suffering there.",
        "source": "T01n0024_004:0328a19_14"
    },
    {
        "source_sentence": "略說如前，乃至壽命未得終盡，惡不善業，未滅未離、未變未散，乃至往昔人非人身，",
        "translation": "It's briefly explained as before, up to the point where their life span has yet to end, bad and unskillful actions haven't ceased, haven't parted, haven't changed, haven't dispersed, and even when they were human or non-human bodies in the past.",
        "source": "T01n0024_004:0328a20_15"
    },
    {
        "source_sentence": "所造作者，一切悉受。",
        "translation": "The author who creates it receives all of them.",
        "source": "T01n0024_004:0328a22_16"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0328a24_0"
    },
    {
        "source_sentence": "此阿毘至大地獄中所有眾生，乃至住者，以不善業果報力故，為地獄火熾燃燒之。",
        "translation": "All the sentient beings in this abhidharma's great hell, even those who live there, are burned by the fire of hell because of the power of the results of unwholesome actions.",
        "source": "T01n0024_004:0328a24_1"
    },
    {
        "source_sentence": "爾時，眼所見色，皆是意所不憙，有意憙者皆不現前，非意所好、不可愛色、不善之色，",
        "translation": "At that time, all the visible matter seen by the eye is not perceived by the manas. The grossness of the manas does not appear to them; it is not a thing liked by the manas, an unpleasant color, or an unwholesome color.",
        "source": "T01n0024_004:0328a26_2"
    },
    {
        "source_sentence": "而恒逼惱，耳所聞聲、鼻所聞香、舌所知味、身所覺觸、意所念法，皆是心意所不喜者。",
        "translation": "They are constantly oppressed, and the sounds heard by the ears, smells heard by the nose, tastes known by the tongue, sensations perceived by the body, and mental states that are thought by the mind are all unpleasant to the mind and what it doesn't like.",
        "source": "T01n0024_004:0328a28_3"
    },
    {
        "source_sentence": "非意所喜、非可愛法，恒來現前，凡有境界，皆是不善。",
        "translation": "What's not liked by the mind and what's not desirable is always present, and whatever has an object, it's unwholesome.",
        "source": "T01n0024_004:0328b01_4"
    },
    {
        "source_sentence": "彼人於中以是因緣，恒受極重麤澁苦惱，其色惡故，其觸亦然，乃至壽命，",
        "translation": "Because of these causes and conditions, that person is constantly subject to extreme pain and suffering. Because his complexion is bad, his touch is likewise, up to his life span.",
        "source": "T01n0024_004:0328b02_5"
    },
    {
        "source_sentence": "未得終盡。",
        "translation": "They haven't yet exhausted it.",
        "source": "T01n0024_004:0328b04_6"
    },
    {
        "source_sentence": "惡不善業，未沒未滅，若於往昔人非人身，有所造作，一切惡業，悉皆具受。",
        "translation": "Bad and unwholesome actions that have yet to disappear or not yet ceased, whether they were done in the past by humans or non-humans, all bad actions are fully experienced.",
        "source": "T01n0024_004:0328b04_7"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0328b07_0"
    },
    {
        "source_sentence": "有何因緣，阿毘至獄名阿毘至耶？",
        "translation": "Why is the avīci hell called avijñapti?",
        "source": "T01n0024_004:0328b07_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0328b08_2"
    },
    {
        "source_sentence": "此阿毘至大地獄中，於一切時，無有須臾暫受安樂，乃至得如一彈指頃，",
        "translation": "At all times in the great hell of this abhidharma, there is neither moment of comfort nor bliss, even for as long as it takes to snap one finger.",
        "source": "T01n0024_004:0328b08_3"
    },
    {
        "source_sentence": "是故名此大地獄者為阿毘至。",
        "translation": "That's why it's called this great hell because it's called abhidharma.",
        "source": "T01n0024_004:0328b10_0"
    },
    {
        "source_sentence": "如是次第，具足受苦。",
        "translation": "In this order, they are endowed with suffering.",
        "source": "T01n0024_004:0328b10_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0328b11_2"
    },
    {
        "source_sentence": "此大地獄諸眾生等，經無量時受長遠苦，乃至得從此阿毘至大地獄出，",
        "translation": "These sentient beings in this great hell experience long-lasting suffering for an immeasurable number of moments, until they are able to escape from this avīci hell.",
        "source": "T01n0024_004:0328b11_3"
    },
    {
        "source_sentence": "出已馳走，走已復走，乃至大走，欲求屋宅、求覆求洲、求歸依處、求救護處。",
        "translation": "After emerging, he runs away; after running away, he walks again; and on his great journey, wanting to find a house, covering the continent, refuge, or shelter.",
        "source": "T01n0024_004:0328b13_4"
    },
    {
        "source_sentence": "爾時，復入黑雲沙等五百由旬諸小地獄，入已乃至略說最後到第十六寒氷地獄，",
        "translation": "At that moment, they enter the small hells as numerous as five hundred yojanas in all directions. Having entered these hells, up to a distance of one thousand yojanas in all directions, they reach the sixteenth and final hell:",
        "source": "T01n0024_004:0328b14_5"
    },
    {
        "source_sentence": "具受眾苦，然後乃於彼處命終。」",
        "translation": "They'll experience all kinds of suffering and then die there.",
        "source": "T01n0024_004:0328b16_6"
    },
    {
        "source_sentence": "「若人身口意造業，　　作已入於惡道中，",
        "translation": "“Suppose a person creates actions with body, speech, or thought and enters a bad path after doing them.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　如是當生活地獄，　　最為可畏毛竪處。",
        "translation": "Thus, they'll live in hell, which is the most fearful place where hair stands on end.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　經歷無數千億歲，　　死已須臾還復活，",
        "translation": "For countless hundreds of millions of years, After dying, he'll quickly return to existence.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　怨讎各各相報對，　　由此眾生更相殺。",
        "translation": "Each has its own retribution for enmity, and as a result sentient beings kill each other.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　若於父母起惡心，　　或佛菩薩聲聞眾，",
        "translation": "If they give rise to bad thoughts about their parents, Or the buddhas, bodhisattvas, and śrāvakas,",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　此等皆墮黑繩獄，　　其處受苦極嚴熾。",
        "translation": "They all fall into the black-rope hell, where they experience extreme pain and suffering.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　教他正行令邪曲，　　見人友善必破壞，",
        "translation": "Teaching others to correct practice so that errors will be distorted, Seeing people’s friendliness will surely destroy them.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　此等亦墮黑繩獄。　　兩舌惡口多妄語，",
        "translation": "These beings will also fall into the hell of the black rope, where they speak harshly and falsely.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　樂作三種惡重業，　　不修三種善根芽，",
        "translation": "They delight in performing the three kinds of bad and heavy actions, Not cultivating the three kinds of roots of virtue.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　此等癡人必當入，　　合大地獄久受苦。",
        "translation": "These deluded people will surely enter the great hell, where they'll suffer for a long time.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　或殺羊馬及諸牛，　　種種雜獸雞猪等，",
        "translation": "Or they may kill sheep, horses, cattle, various animals, chickens, pigs, and so forth.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　并殺諸餘蟲蟻類，　　彼人當墮合地獄。",
        "translation": "If they kill other insects and ants, they'll fall into the combined hell.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　世間怖畏相多種，　　以此逼迫惱眾生，",
        "translation": "The world is full of various signs of fear, oppressing sentient beings because of this.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　當墮磑山地獄中，　　受於塠壓舂擣苦。",
        "translation": "They'll fall into the hell of Mount Sumeru, suffering the pain of torment and oppression.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　貪欲恚癡結使故，　　迴轉正理令別異，",
        "translation": "Because they are the messengers of the fetters of craving, ill-will, and delusion, They turn right principles around and cause distinctions to be made.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　判是作非乖法律，　　彼為刀劍輪所傷。",
        "translation": "They judge it to be done without violating the law, and they're injured by a sword or wheel of swords.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　倚恃強勢劫奪他，　　有力無力皆悉取，",
        "translation": "Relying on strong power, they plunder others, Taking what is powerful and unpowerful.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　若作如是諸逼惱，　　當為鐵象所蹴蹋。",
        "translation": "If they do such things, they'll be trampled by an iron elephant.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　若樂殺害諸眾生，　　身手血塗心嚴惡，",
        "translation": "If they delight in killing sentient beings, their bodies, hands, blood, and coated minds will be painful.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　常行如是不淨業，　　彼等當生叫喚處。",
        "translation": "Always doing such impure actions, they'll be born in a place of screaming and wailing.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　種種觸惱眾生故，　　於叫喚獄被燒煮，",
        "translation": "Because of various kinds of touching and disturbing sentient beings, they're burned and cooked in the hell of wailing.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　其中復有大叫喚，　　此由諂曲姧猾心。",
        "translation": "Among them, there's another great wailing, which is due to flattering and deceitful thoughts.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　諸見稠林所覆蔽，　　愛網彌密所沈淪，",
        "translation": "All views are hindered by thick forests, Overwhelmed by webs of desire and deeply entangled in the net of darkness.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　常行如是最下業，　　彼則墮於大叫喚。",
        "translation": "Such is always the lowest action, and they'll fall into a great wailing.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　若至如是大叫喚，　　熾燃鐵城毛竪處，",
        "translation": "If someone arrives like this with a great wailing, they'll burn the iron castle's hair standing on end in flames.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　其中鐵堂及鐵屋，　　諸來入者悉燒燃。",
        "translation": "The iron halls and the brick chambers therein Are all ablaze, burned by those who enter.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　若作世間諸事業，　　恒當惱亂諸眾生，",
        "translation": "If they do worldly deeds, They will always disturb sentient beings.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　彼等當生熱惱獄，　　於無量時受熱惱。",
        "translation": "They'll be born in the hell of fever, and they'll experience fever for an infinite number of moments.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　世間沙門婆羅門，　　父母尊長諸耆舊，",
        "translation": "The worldly śramaṇas and brāhmaṇas, their parents, the venerable elders,",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　若恒觸惱令不喜，　　彼等皆墮熱惱獄。",
        "translation": "If someone is constantly touched and disturbed so they don't rejoice, they'll all fall into the hell of fever.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　生天淨業不樂修，　　所愛至親常遠離，",
        "translation": "They are born in heaven with pure deeds and do not enjoy cultivating them. Their beloved companions are always far from them.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　憙作如是諸事者，　　彼人當入熱惱獄。",
        "translation": "Anyone who commits such acts will be sent to hell of burning torment.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　惡向沙門婆羅門，　　并諸善人父母等，",
        "translation": "Reverend Śramaṇas and brāhmaṇas who practice evil, As well as the parents of good people.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　或復害於餘尊者，　　彼墮熱惱常熾燃。",
        "translation": "Or they may again harm other honored ones, who fall into feverish anguish and always burn in flames.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　恒多造作諸惡業，　　不曾發起一善心，",
        "translation": "They always do many evil deeds And never give rise to a single thought of goodness.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　是人直趣阿毘獄，　　當受無量眾苦惱。",
        "translation": "That person will go straight to the avīci hell, where they'll experience measureless pain and suffering.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　若說正法為非法，　　說諸非法為正法，",
        "translation": "If someone says the right teaching is unlawful, and speaks of what’s not lawful as right teaching,",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　既無增益於善事，　　彼人當入阿毘獄。",
        "translation": "Since there's no increase in good deeds, that person will enter the avīci hell.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　活及黑繩此兩獄，　　合會叫喚等為五，",
        "translation": "The two hells, life and the black rope, are combined to make a total of five:",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　熱惱大熱共成七，　　阿毘至獄為第八。",
        "translation": "The hells of burning and torment are seven in number:",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　此八名為大地獄，　　嚴熾苦切難忍受，",
        "translation": "These eight hells are called great hells. They are intensely painful and difficult to bear.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "　惡業之人所作故，　　其中小獄有十六。」",
        "translation": "Because it's created by people with bad actions, there are 16 minor hells in them.",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "此中世尊說如是偈：爾時，世尊說此偈已，告諸比丘，作如是言：「汝諸比丘！",
        "translation": "Here, the Bhagavān spoke this verse: After speaking this verse, the Bhagavān addressed the monks and said, You monks!",
        "source": "T01n0024_004:0328b17_7"
    },
    {
        "source_sentence": "應當知彼世界中間，別更復有十地獄處。",
        "translation": "You should know that there are ten other hells in the middle of those worlds.",
        "source": "T01n0024_004:0329a03_8"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T01n0024_004:0329a04_9"
    },
    {
        "source_sentence": "所謂頞浮陀地獄、泥羅浮陀地獄、阿呼地獄、呼呼婆地獄、阿吒吒地獄、搔揵提迦地獄、優鉢羅地獄、波頭摩地獄、奔茶梨地獄、拘牟陀地獄。",
        "translation": "They're called the hell of Jambudvīpa, the hell of Nirarbuda, the hell of Ahui, the hell of Huhuabha, the hell of Aṭṭaṭa, the hell of Saugandhika, the hell of Upāli, the hell of Padma, the hell of Puṇḍarī, the hell of Kusuma, and the hell of Kauśinagara",
        "source": "T01n0024_004:0329a04_10"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a07_11"
    },
    {
        "source_sentence": "於彼中間有如是等十種地獄。",
        "translation": "In between, there are these ten kinds of hells.",
        "source": "T01n0024_004:0329a07_12"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a08_13"
    },
    {
        "source_sentence": "何因何緣，頞浮陀地獄名頞浮陀耶？",
        "translation": "What is the reason why the hell of Jambudvīpa is called Jambudvīpa?",
        "source": "T01n0024_004:0329a08_14"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a09_15"
    },
    {
        "source_sentence": "頞浮陀獄諸眾生等，所有身形，猶如泡沫，是故名為頞浮陀也。",
        "translation": "The bodies and forms of sentient beings in Jambudvīpa are like bubbles, so they're called Jambudvīpa.",
        "source": "T01n0024_004:0329a09_16"
    },
    {
        "source_sentence": "「復次，於中有何因緣，泥羅浮陀地獄名泥羅浮陀耶？",
        "translation": "“Furthermore, what are the causes and conditions that make the hell of Nirarbuda called Nirarbuda?",
        "source": "T01n0024_004:0329a12_0"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a13_1"
    },
    {
        "source_sentence": "彼泥羅浮陀地獄中諸眾生等，所有身形，譬如肉段，是故名為泥羅浮陀。",
        "translation": "The bodies and forms of sentient beings in that hell, such as those in Nirarbuda, are like pieces of flesh; therefore, it's called Nirarbuda.",
        "source": "T01n0024_004:0329a13_2"
    },
    {
        "source_sentence": "「復次，於中何因何緣，阿呼地獄名為阿呼？",
        "translation": "“Furthermore, for what cause and condition is the avīci hell called avīci?",
        "source": "T01n0024_004:0329a15_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a16_4"
    },
    {
        "source_sentence": "阿呼地獄諸眾生等，受嚴切苦逼迫之時，叫喚而言：『阿呼阿呼，甚大苦也。』",
        "translation": "When sentient beings in the avīci hell suffer intense pain and oppression, they scream and say, 'Ahoy, avīci, that's very painful.'",
        "source": "T01n0024_004:0329a16_5"
    },
    {
        "source_sentence": "是故名為阿呼地獄。",
        "translation": "For this reason it is called Avīci Hell.",
        "source": "T01n0024_004:0329a18_6"
    },
    {
        "source_sentence": "「復次，於中何因何緣，呼呼婆獄名呼呼婆耶？",
        "translation": "“Furthermore, what is the cause and condition for the name呼呼婆 prison?",
        "source": "T01n0024_004:0329a19_0"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a20_1"
    },
    {
        "source_sentence": "彼呼呼婆地獄中諸眾生等，為彼地獄極苦逼時，叫喚而言：『呼呼婆，",
        "translation": "When sentient beings in Ābhāsvara hell are tormented by the extreme pain of that hell, they scream and wail, saying, 'Ahāsvara,",
        "source": "T01n0024_004:0329a20_2"
    },
    {
        "source_sentence": "呼呼婆。』",
        "translation": "'Huh-huh-va.'",
        "source": "T01n0024_004:0329a21_3"
    },
    {
        "source_sentence": "是故名為呼呼婆也。",
        "translation": "That's why it's called呼呼婆.",
        "source": "T01n0024_004:0329a22_0"
    },
    {
        "source_sentence": "「復次，於中何因何緣，阿吒吒獄名阿吒吒耶？",
        "translation": "“Furthermore, for what cause and condition is the aṭaṭa hell called aṭaṭa?",
        "source": "T01n0024_004:0329a22_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a23_2"
    },
    {
        "source_sentence": "彼阿吒吒地獄中諸眾生等，以極苦惱逼切其身，但得唱言：『阿吒吒，",
        "translation": "Those sentient beings in Aṭaṭa hell are tormented by extreme pain and suffering, but they can only call out, 'Aṭaṭa,",
        "source": "T01n0024_004:0329a23_3"
    },
    {
        "source_sentence": "阿吒吒。』",
        "translation": "āṭaṭa.'",
        "source": "T01n0024_004:0329a25_4"
    },
    {
        "source_sentence": "然其舌聲不能出口，是故名為阿吒吒也。",
        "translation": "However, the sound of his tongue can't be heard out; therefore, it's called aṭṭaṭa.",
        "source": "T01n0024_004:0329a25_5"
    },
    {
        "source_sentence": "「復次，於中何因何緣，搔揵提迦名搔揵提迦耶？",
        "translation": "“Furthermore, what are the causes and conditions that make scratching cauldrons known as scratching cauldrons?",
        "source": "T01n0024_004:0329a26_6"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329a27_7"
    },
    {
        "source_sentence": "搔揵提迦地獄之中，猛火焰色如搔揵提迦花，是故名為搔揵提迦。",
        "translation": "In Saugandhika hell, the color of the fierce flame is like the color of the Saugandhika flower; therefore, it's called Saugandhika.",
        "source": "T01n0024_004:0329a27_8"
    },
    {
        "source_sentence": "「復次，於中何因何緣，優鉢羅獄名優鉢羅耶？",
        "translation": "“Furthermore, for what cause and condition is the prison of utpala called utpalaya?",
        "source": "T01n0024_004:0329a29_9"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329b01_10"
    },
    {
        "source_sentence": "彼優鉢羅地獄之中，猛火焰色如優鉢羅華，是故名為優鉢羅也。",
        "translation": "In that hell of utpala, the color of a fierce flame is like an utpala flower; therefore, it's called utpala.",
        "source": "T01n0024_004:0329b01_11"
    },
    {
        "source_sentence": "「復次，於中何因何緣，拘牟陀獄名拘牟陀耶？",
        "translation": "“Furthermore, what are the causes and conditions that make the prison of Kusumalā called Kusumalā?",
        "source": "T01n0024_004:0329b03_12"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329b04_13"
    },
    {
        "source_sentence": "彼拘牟陀地獄之中，猛火焰色如拘牟陀花，是故名為拘牟陀也。",
        "translation": "In that hell of Kauṣṭhila, there's a fierce flame with the color of the fire like the flower of Kauṣṭhila; therefore, it's called Kauṣṭhila.",
        "source": "T01n0024_004:0329b04_14"
    },
    {
        "source_sentence": "「復次，於中何因何緣，奔茶梨迦獄名奔茶梨迦耶？",
        "translation": "“Furthermore, for what cause and condition is the hell of Puṇḍarīka called Puṇḍarīka?",
        "source": "T01n0024_004:0329b05_15"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329b07_16"
    },
    {
        "source_sentence": "奔茶梨迦地獄之中，猛火焰色如奔茶梨迦花，是故名為奔茶梨迦。",
        "translation": "In the hell of Puṇḍarīka, there's a fierce fire and flame with the color of puṇḍarīka flowers; therefore, it's called Puṇḍarīka.",
        "source": "T01n0024_004:0329b07_17"
    },
    {
        "source_sentence": "「復次，於中何因何緣，波頭摩獄名波頭摩耶？",
        "translation": "“Furthermore, what is the cause and condition for the name Padma?",
        "source": "T01n0024_004:0329b09_0"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329b10_1"
    },
    {
        "source_sentence": "彼波頭摩地獄之中，猛火焰色如波頭摩花，是故名為波頭摩也。",
        "translation": "In Padma, there's a fierce fire with the color of flame like the Padma flower; therefore, it's called Padma.",
        "source": "T01n0024_004:0329b10_2"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0024_004:0329b11_3"
    },
    {
        "source_sentence": "如憍薩羅國斛量如是胡麻滿二十斛，高盛不槩，而於其間，有一丈夫，",
        "translation": "It was as large as the size of a grain of sesame sesame seed in the country of Kośala, twenty hu measures in circumference. The sesame seeds were neither too big nor too small to be eaten but there was a man among them.",
        "source": "T01n0024_004:0329b12_0"
    },
    {
        "source_sentence": "滿百年已取一胡麻。",
        "translation": "After a hundred years had passed, he took one sesame seed.",
        "source": "T01n0024_004:0329b13_1"
    },
    {
        "source_sentence": "如是次第，滿百年已復取一粒，擲置餘處。",
        "translation": "In this order, after a hundred years have passed, he takes another grain and tosses it elsewhere.",
        "source": "T01n0024_004:0329b14_2"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329b15_3"
    },
    {
        "source_sentence": "如是擲彼憍薩羅國滿二十斛胡麻盡已，爾所時節，頞浮陀獄，我說其壽猶未畢盡。",
        "translation": "Thus, after he had thrown away 20 hu units of sesame in the country of Kauśala and exhausted it, he was still in Jambudvīpa at that time, and I said his life span hadn't yet ended.",
        "source": "T01n0024_004:0329b15_4"
    },
    {
        "source_sentence": "且以此數，略而計之，如是二十頞浮陀壽，為一泥羅浮陀壽；",
        "translation": "Taking these numbers together and calculating them briefly, twenty lifetimes is the length of a human life span in hell.",
        "source": "T01n0024_004:0329b17_5"
    },
    {
        "source_sentence": "二十泥羅浮陀壽，為一阿呼壽；",
        "translation": "Twenty years is the duration of life in Nirarbuda, which is one aeon.",
        "source": "T01n0024_004:0329b18_6"
    },
    {
        "source_sentence": "二十阿呼壽，為一呼呼婆壽；",
        "translation": "Twenty muhūrtas is the same as one muhūrta.",
        "source": "T01n0024_004:0329b19_7"
    },
    {
        "source_sentence": "二十呼呼婆壽，為一阿吒吒壽；",
        "translation": "Twenty muhūrtas is the duration of life, which is one aṭṭaṭa.",
        "source": "T01n0024_004:0329b20_8"
    },
    {
        "source_sentence": "二十阿吒吒壽，為一搔揵提迦壽；",
        "translation": "Twenty years is the duration of life of a āṭaṭaṭika, the life span of a cchantika.",
        "source": "T01n0024_004:0329b20_9"
    },
    {
        "source_sentence": "二十搔揵提迦壽，為一優鉢羅壽；",
        "translation": "The duration of life of twenty kṣatriyas is one upālia.",
        "source": "T01n0024_004:0329b21_10"
    },
    {
        "source_sentence": "二十優鉢羅壽，為一拘牟陀壽；",
        "translation": "The duration of life is twenty muhūrtas; the duration of life in Upāli is one kalpa.",
        "source": "T01n0024_004:0329b22_11"
    },
    {
        "source_sentence": "二十拘牟陀壽，為一奔茶梨迦壽；",
        "translation": "The duration of life is twenty muhūrtas; the duration of life is one puṇḍarīka.",
        "source": "T01n0024_004:0329b23_12"
    },
    {
        "source_sentence": "二十奔茶梨迦壽，為一波頭摩壽；",
        "translation": "The duration of life is twenty muhūrtas; the duration of life of a khadirika is the duration of life of a paṭikā.",
        "source": "T01n0024_004:0329b24_0"
    },
    {
        "source_sentence": "二十波頭摩壽，為一中劫。",
        "translation": "The duration of life in Padma twenty kalpas is one antarakalpa.",
        "source": "T01n0024_004:0329b24_1"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0024_004:0329b26_0"
    },
    {
        "source_sentence": "波頭摩地獄所住之處，若諸眾生離其處所一百由旬，便為彼獄火焰所及；",
        "translation": "At the place where Padma hell is situated, if any sentient beings leave that place by a distance of one hundred yojanas, they are drawn by the blazing flames of those hells.",
        "source": "T01n0024_004:0329b26_1"
    },
    {
        "source_sentence": "若離五十由旬所住眾生，為彼火熏皆盲無眼；",
        "translation": "If one were to leave the sentient beings who lived fifty yojanas away, all would be blinded by that fire and not have eyes.",
        "source": "T01n0024_004:0329b28_0"
    },
    {
        "source_sentence": "若離二十五由旬所住眾生，身之肉血燋燃破散。",
        "translation": "If they part with the sentient beings living at twenty-five yojanas, their bodies are burned and broken apart by flesh and blood.",
        "source": "T01n0024_004:0329b29_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329c01_2"
    },
    {
        "source_sentence": "瞿迦梨比丘，為於舍利弗、目揵連所起誹謗心，濁心惡心故，死後即生波頭摩獄。",
        "translation": "The monk Kokālika, because of the slanderous thoughts he gave rise to against Śāriputra and Maudgalyāyana, was born in Padma prison after death because of his turbid and bad thoughts.",
        "source": "T01n0024_004:0329c01_3"
    },
    {
        "source_sentence": "生彼處已，從其口中出大熱焰，長餘十肘，於其舌上自然而有五百鐵犁，",
        "translation": "After being born there, a great hot flame emerges from their mouths, more than ten feet in length. On the surface of their tongues five hundred iron plows are naturally present.",
        "source": "T01n0024_004:0329c03_4"
    },
    {
        "source_sentence": "恒常耕之。",
        "translation": "He always cultivates it.",
        "source": "T01n0024_004:0329c05_5"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329c05_6"
    },
    {
        "source_sentence": "我於餘處，未曾見有如是色類自損害也，所謂於梵行人邊生垢濁心故、損惱心故、毒惡心故、不利益心故、無慈心故、無淨心故。",
        "translation": "I've never seen such forms of self-harming in other places, which are said to be because they give rise to defiled thoughts at the side of religious practitioners, harmful thoughts, poisonous thoughts, unbeneficial thoughts, lack of kindness, and lack of pure thoughts.",
        "source": "T01n0024_004:0329c05_7"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329c08_8"
    },
    {
        "source_sentence": "是故汝等應於一切梵行人所，起慈身口意業。",
        "translation": "For this reason you should perform acts of kindness toward all religious practitioners, bodily, verbal, and mental actions.",
        "source": "T01n0024_004:0329c08_9"
    },
    {
        "source_sentence": "如我所見，晝夜起慈身口意者，常受安樂。",
        "translation": "As I see it, those who give rise to compassion day and night with body, speech, and thought will always experience peace and comfort.",
        "source": "T01n0024_004:0329c09_10"
    },
    {
        "source_sentence": "是故汝等，一切比丘，皆當如我所見所說，應於晝夜常起慈心，汝等常當如是習學。」",
        "translation": "Therefore, all of you monks, follow what I've seen and taught, always be compassionate day and night, and you should always thus cultivate it.",
        "source": "T01n0024_004:0329c10_11"
    },
    {
        "source_sentence": "「世間諸人在世時，　　舌上自然生斤鈇，",
        "translation": "When the people of the world are in the world, a pound naturally grows on their tongues.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　所謂口說諸毒惡，　　還自衰損害其身。",
        "translation": "It's called verbally speaking poisonous and harmful, which returns to self-decay and harms their bodies.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　應讚歎者不稱譽，　　不應讚者反談美，",
        "translation": "Those who should praise don’t praise, those who shouldn’t praise discuss what’s good in return.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　如是名為口中諍，　　以此諍故無樂受。",
        "translation": "Thus, it's called a dispute in the mouth because there's no pleasant feeling because of this dispute.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　若人博戲得資財，　　是為世間微諍事，",
        "translation": "If someone plays and obtains wealth, this is a minor commotion in the world.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　於淨行人起濁心，　　是名口中大鬪諍。",
        "translation": "To give rise to a turbid mind among the pure practitioners is called a great verbal fight.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　如是三十六百千，　　泥羅浮陀地獄數，",
        "translation": "Three hundred and sixty-six million such hells are numbered as the hells of Nirarbuda.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　五頞浮陀諸地獄，　　及墮波頭摩獄中；",
        "translation": "The fifth is the hell of Jambudvipa, As well as the hell of Padma.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "　以毀聖人致如是，　　由口意業作惡故。",
        "translation": "This is because they disparage the holy ones and do evil by means of verbal or mental action.",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "爾時，世尊說此伽他曰：「諸比丘！",
        "translation": "It was then that the Bhagavān spoke this verse, saying, Monks!",
        "source": "T01n0024_004:0329c12_12"
    },
    {
        "source_sentence": "世界中間，復有諸風，名曰熱惱。",
        "translation": "In the middle of the world, there are other winds called heat and anguish.",
        "source": "T01n0024_004:0329c23_13"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0329c23_14"
    },
    {
        "source_sentence": "彼等諸風，若來至此四洲界者，此四洲界所有眾生，生者住者，一切身分，",
        "translation": "If those winds come to these four continents, all the sentient beings in these four continents are born and live, and all their identities are likewise.",
        "source": "T01n0024_004:0329c24_15"
    },
    {
        "source_sentence": "悉皆散壞消滅無餘。",
        "translation": "They all disintegrate and cease without remainder.",
        "source": "T01n0024_004:0329c25_16"
    },
    {
        "source_sentence": "譬如葦荻若被刈已，不得水灌，皆當乾壞，無有遺餘。",
        "translation": "It's like a reed ditch that doesn't allow water to be drained after it's mown, and all of them will dry up without remainder.",
        "source": "T01n0024_004:0329c26_17"
    },
    {
        "source_sentence": "如是如是，諸比丘！",
        "translation": "So it is, so it is, monks!",
        "source": "T01n0024_004:0329c27_18"
    },
    {
        "source_sentence": "世界中間，所有諸風，名熱惱者，若來至此四洲界時，此四洲界所有眾生，",
        "translation": "In the middle of the world, all the winds are called hot and disturbing winds. When they come to these four continents, all the sentient beings in those four continents will be like this:",
        "source": "T01n0024_004:0329c28_19"
    },
    {
        "source_sentence": "一時皆悉乾壞無餘，亦復如是。",
        "translation": "So it is with the simultaneous drying and disintegration of all at once, without remainder.",
        "source": "T01n0024_004:0329c29_20"
    },
    {
        "source_sentence": "但以內鐵圍山、大鐵圍山二山所障，是故彼風不來到此。",
        "translation": "Because it is hindered by the two mountains Cakravāḍaparvata and Mahācakravāḍaparvata inside, that wind does not come here.",
        "source": "T01n0024_004:0330a01_21"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0024_004:0330a03_0"
    },
    {
        "source_sentence": "彼鐵圍山、大鐵圍山，能作如是最大利益，為此四洲四世界中諸眾生等作依止業。",
        "translation": "Mount Cakravāḍa and the great mountain Cakravāḍa can thus perform the greatest benefit, which is to act as a support for sentient beings in these four continents and four worlds.",
        "source": "T01n0024_004:0330a03_1"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0330a06_0"
    },
    {
        "source_sentence": "世界中間，所有諸風，吹彼地獄燒煮眾生，身肉脂髓，種種不淨，臭穢之氣，",
        "translation": "In the middle of the world, all kinds of wind blow in those hells to burn and cook sentient beings. Their bodies, flesh, fat, marrow, various impure substances, foul odors, and foul smells are like this:",
        "source": "T01n0024_004:0330a06_1"
    },
    {
        "source_sentence": "甚可畏惡。",
        "translation": "It's very frightening and evil.",
        "source": "T01n0024_004:0330a08_2"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0330a08_3"
    },
    {
        "source_sentence": "其風若來至此四洲世界中者，四洲世界所有眾生，乃至住者，一切盲冥無復眼目，",
        "translation": "If that wind comes and reaches these worlds in the four continents, all the sentient beings in the worlds of the four continents—and so on up to those who live therein—will be blind and without eyes.",
        "source": "T01n0024_004:0330a08_4"
    },
    {
        "source_sentence": "以其臭氣極猛盛故。",
        "translation": "It's because its odor is so strong.",
        "source": "T01n0024_004:0330a10_5"
    },
    {
        "source_sentence": "然由鐵圍及大鐵圍二山為障，遮礙彼故不來至此。",
        "translation": "They are hindered by the Iron Mountains and the two great iron mountains, which prevent them from coming here.",
        "source": "T01n0024_004:0330a11_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0024_004:0330a13_0"
    },
    {
        "source_sentence": "彼內鐵圍及大鐵圍二種大山，乃能為此四洲世界諸眾生等，作如是比最大利益，",
        "translation": "The inner ring of iron and the two kinds of great mountains, the great ring of iron, are able to do so for the sake of sentient beings in these four continents and worlds.",
        "source": "T01n0024_004:0330a13_1"
    },
    {
        "source_sentence": "成諸眾生依止業故。",
        "translation": "It's because it creates the karma that sentient beings rely on.",
        "source": "T01n0024_004:0330a15_2"
    },
    {
        "source_sentence": "復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0330a15_3"
    },
    {
        "source_sentence": "世界中間，更有大風，名僧伽多。",
        "translation": "In the middle of the world, there's another great wind named saṃgata.",
        "source": "T01n0024_004:0330a15_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0330a16_5"
    },
    {
        "source_sentence": "彼風若來至此世界，則此世界四種大洲及八萬四千諸餘小洲，并餘大山、須彌山王，",
        "translation": "If that wind comes to this world, the four major continents of this world and the other eighty-four thousand small continents as well as the other big mountains and the king of the polar mountains.",
        "source": "T01n0024_004:0330a16_6"
    },
    {
        "source_sentence": "悉能吹舉去地或高一俱盧奢，舉已能令分散破壞；",
        "translation": "They can all blow and lift up the earth to a depth of one krośa or so. Having lifted it up, they can cause it to be dispersed and destroyed.",
        "source": "T01n0024_004:0330a18_7"
    },
    {
        "source_sentence": "乃至二三四五六七俱盧奢，既擎舉已，悉能令其星散破壞；",
        "translation": "When they lift up two, three, four, five, six, or seven krośas, they can cause the stars to scatter and disintegrate.",
        "source": "T01n0024_004:0330a19_8"
    },
    {
        "source_sentence": "乃至擎舉高一由旬，星散破壞，亦如前說。",
        "translation": "Up to one yojana in height when lifted up, the stars will scatter and destroy it. The same applies as before.",
        "source": "T01n0024_004:0330a21_9"
    },
    {
        "source_sentence": "如是二三四五六七由旬，擎舉破壞，悉令分散；",
        "translation": "Two, three, four, five, six, or seven yojanas in this way will be broken up and scattered.",
        "source": "T01n0024_004:0330a22_10"
    },
    {
        "source_sentence": "乃至一百由旬，既擎舉已，分散破壞；",
        "translation": "Up to one hundred yojanas in circumference, they scatter and disintegrate as soon as they lift it up.",
        "source": "T01n0024_004:0330a23_11"
    },
    {
        "source_sentence": "二三四五六七百由旬，既擎舉已，分散破壞，亦復如前。",
        "translation": "Two, three, four, five, six, or seven hundred yojanas in circumference. Having lifted them up, they scatter and disintegrate as before.",
        "source": "T01n0024_004:0330a24_12"
    },
    {
        "source_sentence": "乃至一千由旬，二三四五六七千由旬，擎舉之已，分散破壞。",
        "translation": "It reaches a distance of one thousand yojanas, two, three, four, five, six, or seven thousand yojanas. When lifted up they scatter and disintegrate.",
        "source": "T01n0024_004:0330a25_13"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0330a26_14"
    },
    {
        "source_sentence": "譬如壯夫手把麥[麥*弋]，把已高舉，末令粉碎，於虛空中，分散棄擲，",
        "translation": "It is as if a strong man were to take wheat by the hand and, holding it high up in the air, crushed it into powder and threw it into space.",
        "source": "T01n0024_004:0330a27_15"
    },
    {
        "source_sentence": "令無遺餘。",
        "translation": "It's so that there's nothing left.",
        "source": "T01n0024_004:0330a28_16"
    },
    {
        "source_sentence": "如是如是，諸比丘！",
        "translation": "So it is, so it is, monks!",
        "source": "T01n0024_004:0330a28_17"
    },
    {
        "source_sentence": "彼世界中間最大猛風，名僧伽多，其風若來至此四洲，爾時此界四種大洲，",
        "translation": "The strongest wind in the middle of that world is called Siṃhala. When this wind reaches these four continents, it blows over one of the four continents:",
        "source": "T01n0024_004:0330a29_18"
    },
    {
        "source_sentence": "及八萬四千諸餘小洲，一切諸山、并須彌山王，悉能高舉，至一俱盧奢，",
        "translation": "All the mountains and Mount Sumeru as well as all the other small continents of eighty-four thousand yojanas can be raised high up to one krośa.",
        "source": "T01n0024_004:0330b02_19"
    },
    {
        "source_sentence": "分散破壞，略說如前；",
        "translation": "Dispersal and destruction are mentioned briefly as before.",
        "source": "T01n0024_004:0330b03_20"
    },
    {
        "source_sentence": "乃至舉高七千由旬，分散破壞，亦復如是。",
        "translation": "It rises up to a height of seven thousand yojanas and is scattered and destroyed likewise.",
        "source": "T01n0024_004:0330b04_21"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0330b05_22"
    },
    {
        "source_sentence": "但由內鐵圍山、大鐵圍山二山障故，不來至此。",
        "translation": "It is only because of the internal obstacles of Mount Cakravāḍa and Mount Mahācakravāḍa that they do not come here.",
        "source": "T01n0024_004:0330b05_23"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0330b06_24"
    },
    {
        "source_sentence": "彼內鐵圍山、大鐵圍山二山威德，有大利益，乃能如是，為此四洲四世界中諸眾生等作依止業。",
        "translation": "Because of their great benefits, they're able to do so for the sake of sentient beings in these four continents and four worlds who serve as their support.",
        "source": "T01n0024_004:0330b06_25"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0330b09_0"
    },
    {
        "source_sentence": "當閻浮洲南二鐵圍山外，有閻魔王宮殿住處，縱廣正等六千由旬，七重牆壁、七重欄楯、七重鈴網，",
        "translation": "Beyond the two Iron Mountains to the south of Jambudvīpa is the palace of King Yama, which is exactly six thousand yojanas long and wide, with seven walls, seven rails, seven railings, and seven networks of bells.",
        "source": "T01n0024_004:0330b09_1"
    },
    {
        "source_sentence": "其外七重多羅行樹，周匝圍遶。",
        "translation": "The monastery was surrounded by seven lines of palm trees.",
        "source": "T01n0024_004:0330b11_2"
    },
    {
        "source_sentence": "雜色可觀，七寶所成，所謂金銀琉璃、頗梨赤珠、車璩瑪瑙等之所成就。",
        "translation": "The variegated colors that can be observed are made of seven treasures, which are called the accomplishment of gold, silver, beryl, pāri, red pearl, chariot, agate, and so forth.",
        "source": "T01n0024_004:0330b12_3"
    },
    {
        "source_sentence": "於其四方各有諸門，一一諸門，皆有却敵樓櫓臺殿、園苑花池。",
        "translation": "In each of the four directions, there are gates, and each gate has an enemy tower, a terrace, a hall, a garden, and a flower pond.",
        "source": "T01n0024_004:0330b14_4"
    },
    {
        "source_sentence": "是諸花池及園苑內，有種種樹，其樹各有種種眾葉、種種妙花、種種美果，",
        "translation": "In each of those trees were various kinds of leaves, various kinds of beautiful flowers, and various kinds of delicious fruits.",
        "source": "T01n0024_004:0330b15_5"
    },
    {
        "source_sentence": "彌滿遍布。",
        "translation": "It's full and pervasive.",
        "source": "T01n0024_004:0330b17_6"
    },
    {
        "source_sentence": "種種諸香，隨風遠熏。",
        "translation": "Various kinds of fragrances are perfumed from a distance as the wind blows.",
        "source": "T01n0024_004:0330b17_7"
    },
    {
        "source_sentence": "種種眾鳥，各各和鳴。",
        "translation": "Various kinds of birds each sing harmoniously.",
        "source": "T01n0024_004:0330b18_8"
    },
    {
        "source_sentence": "復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0024_004:0330b18_9"
    },
    {
        "source_sentence": "彼閻魔王，以其惡業不善果故，於夜三時及晝三時，自然而有赤融銅汁，",
        "translation": "Because of the unwholesome consequences of his evil deeds, King Yama naturally had red-hot copper juice at three times during the night and three times during the day.",
        "source": "T01n0024_004:0330b18_10"
    },
    {
        "source_sentence": "在前出生。",
        "translation": "It's produced in the past.",
        "source": "T01n0024_004:0330b20_11"
    },
    {
        "source_sentence": "當於是時，其王宮殿，即變為鐵，於先所有五欲功德在目前者，皆沒不現。",
        "translation": "At that point, the king's palace immediately turned into iron, and whatever merits of the five desires he had previously possessed in front of him all disappeared and didn't appear.",
        "source": "T01n0024_004:0330b20_12"
    },
    {
        "source_sentence": "若在宮內，即於宮內如是出生。",
        "translation": "If he's inside the palace, he'll be born inside the palace like this.",
        "source": "T01n0024_004:0330b22_13"
    },
    {
        "source_sentence": "時，閻魔王見此事已，怖畏不安，諸毛皆竪，即便出外。",
        "translation": "Seeing this sight, the king of Yama became frightened and fearful. All his hair stood on end and he flew outward.",
        "source": "T01n0024_004:0330b23_14"
    },
    {
        "source_sentence": "若在宮外，即復於外如是出生。",
        "translation": "If he's outside the palace, he'll be born outside again like this.",
        "source": "T01n0024_004:0330b24_15"
    },
    {
        "source_sentence": "時，閻魔王心生怖畏，顫動不安，身有諸毛，一時皆竪，即走入內。",
        "translation": "The king of Yama then became frightened, trembled and unsettled, and had hair on his body that stood on end all at once.",
        "source": "T01n0024_004:0330b25_16"
    },
    {
        "source_sentence": "時，守獄者取閻摩王，高舉撲之，置熱鐵地上，其地熾燃，極大猛盛，",
        "translation": "The guards in this hell seize the king of Jambudvīpa, raise him high and throw him to a heated iron floor that is extremely hot and ablaze.",
        "source": "T01n0024_004:0330b26_17"
    },
    {
        "source_sentence": "光焰炎赫，撲令臥已，即以鐵鉗，開張其口，以融銅汁，瀉置口中。",
        "translation": "The blazing flame was so bright that it made him lie down, and then he opened his mouth with an iron forceps, poured molten copper juice into it, and placed it in his mouth.",
        "source": "T01n0024_004:0330b28_18"
    },
    {
        "source_sentence": "時，閻摩王被燒脣口；",
        "translation": "At that time King Yama’s lips and mouth were burned.",
        "source": "T01n0024_004:0330b29_19"
    },
    {
        "source_sentence": "燒脣口已，次燒其舌；",
        "translation": "Having burned their lips and mouths, they burn their tongues.",
        "source": "T01n0024_004:0330c01_20"
    },
    {
        "source_sentence": "既燒舌已，復燒咽喉；",
        "translation": "Having burned his tongue, he burns his throat.",
        "source": "T01n0024_004:0330c01_21"
    },
    {
        "source_sentence": "燒咽喉已，復燒大腸及小腸等，次第燋燃，從下而出。",
        "translation": "After it burns your throat and throat, it also burns your large intestines and small intestines, and so forth, which are sequentially scorched and burned, coming out from below.",
        "source": "T01n0024_004:0330c02_22"
    },
    {
        "source_sentence": "當於爾時，彼閻摩王，作如是念：『一切眾生，以於往昔身作惡行、口作惡行、意作惡行，",
        "translation": "At that time, the king of Yama thought: All sentient beings committed evil deeds in body, speech, and mind in the past.",
        "source": "T01n0024_004:0330c03_23"
    },
    {
        "source_sentence": "是故彼等皆受如是種種異色無量苦惱心不憙事。",
        "translation": "That's why they all experience such various formless, immeasurable painful and distressing mental and non-violent things.",
        "source": "T01n0024_004:0330c05_24"
    },
    {
        "source_sentence": "如地獄中諸眾生等，今我此身并餘眾生，與閻摩王同作業者，亦復如是。",
        "translation": "Just as the sentient beings in hell and so forth, now this body of mine and the other sentient beings who work together with King Yama are likewise.",
        "source": "T01n0024_004:0330c06_25"
    },
    {
        "source_sentence": "嗚呼！",
        "translation": "Aah!",
        "source": "T01n0024_004:0330c08_26"
    },
    {
        "source_sentence": "願我從今捨此身已，更得身時，俱於人間相逢受生，令我爾時於如來法中當得信解，",
        "translation": "“May I abandon this body now and be reborn in the human world at the same time as you! May I attain, at that moment, faith in the teachings of the enlightened.",
        "source": "T01n0024_004:0330c08_27"
    },
    {
        "source_sentence": "得信解已，我於彼處復當更得信解具足，剃除鬚髮，著袈裟衣，得正信解，",
        "translation": "Having attained faith and understanding, I will again attain faith and understanding in those places. Shave my hair and beard, don the yellow robe of a monk, and obtain right faith and understanding.",
        "source": "T01n0024_004:0330c10_28"
    },
    {
        "source_sentence": "從家出家。",
        "translation": "He left home and renounced the world.",
        "source": "T01n0024_004:0330c12_29"
    },
    {
        "source_sentence": "我於爾時，既出家已，和合不久，便於善男子為何事故，得正信解，從家出家，",
        "translation": "Having renounced the householder’s life at that time, I will not be able to reconcile [my family members] for a long time. Soon after they have reconciled, what has happened to you, son of a virtuous family? Why have you gained right faith in me and renounced householder’s life?",
        "source": "T01n0024_004:0330c12_30"
    },
    {
        "source_sentence": "無上梵行所盡之處、現見法中，自得通證。",
        "translation": "Where the practice of unsurpassed celibacy is ended, they'll now see the teaching and attain its realization on their own.",
        "source": "T01n0024_004:0330c14_31"
    },
    {
        "source_sentence": "具足證已，願我當言：「我今生死已盡，梵行已立，所應作者，皆已作訖，",
        "translation": "Having fully realized it, may I now say: My births and deaths have ended. The practice of austerity has been established. All that should be done is already done.",
        "source": "T01n0024_004:0330c15_32"
    },
    {
        "source_sentence": "更不復於後世受生。」』",
        "translation": "They won't be born again in a later life.'",
        "source": "T01n0024_004:0330c16_33"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0024_004:0330c18_0"
    },
    {
        "source_sentence": "彼閻摩王，復於是時，發如是等熏習善念。",
        "translation": "At the time, that king of Yama also had this kind of permeated good thought.",
        "source": "T01n0024_004:0330c18_1"
    },
    {
        "source_sentence": "即於爾時，彼閻摩王所住宮殿，還成七寶，種種出生，猶如諸天五欲功德現前具足。",
        "translation": "At that point, the palace where King Yama was staying, the seven treasures were restored and variously produced, just like the gods' five desires and merits are fully manifested in front of them.",
        "source": "T01n0024_004:0330c19_2"
    },
    {
        "source_sentence": "爾時，閻摩王復作是念：『一切眾生，以身善行口意善行，便得快樂，",
        "translation": "At that time, the king of Yama again thought: All sentient beings who do good deeds with body, speech, and mind attain happiness.",
        "source": "T01n0024_004:0330c21_3"
    },
    {
        "source_sentence": "唯願彼等各各皆受如是安樂。",
        "translation": "May each of them all experience such peace and happiness.",
        "source": "T01n0024_004:0330c22_4"
    },
    {
        "source_sentence": "譬如空居諸夜叉輩，所謂我身及餘閻摩王，諸有眾生，同集業者。』",
        "translation": "It's like the empty-abiding yakṣas, which are called self and the other kings of Jambudvīpa, and there are sentient beings who gather together to perform actions.'",
        "source": "T01n0024_004:0330c23_5"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0024_004:0330c25_0"
    },
    {
        "source_sentence": "有三天使在於世間。",
        "translation": "There are three heavenly messengers in the world.",
        "source": "T01n0024_004:0330c25_1"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T01n0024_004:0330c25_2"
    },
    {
        "source_sentence": "所謂老、病、死也。",
        "translation": "It's called old age, illness, and death.",
        "source": "T01n0024_004:0330c25_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0024_004:0330c26_4"
    },
    {
        "source_sentence": "有一種人，以自放逸，身行惡行、口行惡行、意行惡行，如是等人，身口及意皆行於惡。",
        "translation": "There's a certain person who, because of self-indulgence, commits bad actions in body, bad actions in speech, and bad actions in mind, and such people all commit bad actions in body, speech, and mind.",
        "source": "T01n0024_004:0330c26_5"
    },
    {
        "source_sentence": "以此因緣，身壞命終，趣於惡道，生地獄中。",
        "translation": "Because of these causes and conditions, when their bodies break up and their lives end, they'll go to a bad destiny and be born in hell.",
        "source": "T01n0024_004:0330c28_6"
    },
    {
        "source_sentence": "諸守獄者，應時即來，驅彼眾生，至閻摩王前白言：『天王，此等眾生昔在人間，",
        "translation": "The guards in this hell came at the right time and expelled the sentient beings. They went to King Yama and said:",
        "source": "T01n0024_004:0330c29_7"
    },
    {
        "source_sentence": "縱逸自在，不善和合，恣身口意行於惡行。",
        "translation": "They indulge in self-dependence, don't harmonize well, and engage in bad behavior with their body, speech, and mind.",
        "source": "T01n0024_004:0331a02_8"
    },
    {
        "source_sentence": "以其身口及意行惡行故，今來生此。",
        "translation": "Because they committed evil deeds of body, speech, and mind, they were reborn in this land.",
        "source": "T01n0024_004:0331a03_9"
    },
    {
        "source_sentence": "唯願天王，善教示之，善呵責之。』",
        "translation": "Please, king of gods, show them well and rebuke them well.'",
        "source": "T01n0024_004:0331a04_10"
    },
    {
        "source_sentence": "「時閻摩王問罪人言：『汝善丈夫！",
        "translation": "King Yama then asked the sinners, 'You good men!",
        "source": "T01n0024_004:0331a05_0"
    },
    {
        "source_sentence": "昔在人間，第一天使，善教示汝、善呵責汝，豈得不見彼初天使出現生耶？』",
        "translation": "In the past, when you were in the world, the first arhat taught you well and rebuked you well, so how could you not see the first arhat appearing to be born?'",
        "source": "T01n0024_004:0331a05_1"
    },
    {
        "source_sentence": "答言：『大天！",
        "translation": "He replied, 'Great god!",
        "source": "T01n0024_004:0331a07_2"
    },
    {
        "source_sentence": "我實不見。』",
        "translation": "I really don't see it.'",
        "source": "T01n0024_004:0331a07_3"
    },
    {
        "source_sentence": "時，閻摩王重復告言：『丈夫！",
        "translation": "King Yama then again repeatedly told him, 'Husband!",
        "source": "T01n0024_004:0331a08_0"
    },
    {
        "source_sentence": "汝豈不見，昔在世間為人身時，或作婦女、或作丈夫，衰老相現，摩訶羅時，",
        "translation": "“Haven’t you seen that in the past, when he was a human being in the world, some of them became women and some men? The signs of old age and decay appeared.",
        "source": "T01n0024_004:0331a08_1"
    },
    {
        "source_sentence": "齒落髮白，皮膚緩皺，黑黶遍體，狀若胡麻，膊傴背曲，行步跛蹇，足不依身，",
        "translation": "Their teeth are white; their skin is loose and wrinkled, with black hair spreading all over their bodies.",
        "source": "T01n0024_004:0331a10_2"
    },
    {
        "source_sentence": "左右傾側，頸細皮寬，兩邊垂緩，猶若牛[古*頁]，脣口乾枯，喉舌燥澁，",
        "translation": "Their necks are narrow and slender, their skin broad and wide, the two sides hanging down like an ox’s [old*page]. Their lips and mouths are dry and withered, and their throats and tongues are dry and dull.",
        "source": "T01n0024_004:0331a12_3"
    },
    {
        "source_sentence": "身體屈弱，氣力綿微，喘息出聲，猶如挽鋸，向前欲倒，恃杖而行，盛年衰損，",
        "translation": "Their bodies are flexed and weak, and their vitality diminishes. They pant and exhale in an uncontrolled voice, just as if they were pulling a saw; going forward to break it, they walk on the basis of a cane but grow old and lose weight.",
        "source": "T01n0024_004:0331a13_4"
    },
    {
        "source_sentence": "血肉消竭，羸瘦尫弱，趣來世路，舉動沈滯，無復壯形，乃至身心，恒常顫掉，",
        "translation": "Their flesh and blood are depleted, they grow weak and feeble. They go on their way to the next existence in various ways, moving and hovering, losing strength and form, constantly trembling and quaking, body and mind.",
        "source": "T01n0024_004:0331a15_5"
    },
    {
        "source_sentence": "一切支節，疲懈難攝。",
        "translation": "All the limbs are weary and difficult to contain.",
        "source": "T01n0024_004:0331a17_6"
    },
    {
        "source_sentence": "汝見之不？』",
        "translation": "Do you see it?'",
        "source": "T01n0024_004:0331a17_7"
    },
    {
        "source_sentence": "彼人答言：『大天！",
        "translation": "That person replied, 'Great god!",
        "source": "T01n0024_004:0331a17_8"
    },
    {
        "source_sentence": "我實見之。』",
        "translation": "I really see it.'",
        "source": "T01n0024_004:0331a18_9"
    },
    {
        "source_sentence": "時，閻摩王復告之言：『汝愚癡人，無有智慧。",
        "translation": "King Yama then again told him, 'You foolish man, you have no wisdom.",
        "source": "T01n0024_004:0331a18_10"
    },
    {
        "source_sentence": "昔日既見如是相貌，云何不作如是思惟：「我今此身，亦有是法，亦有是事，",
        "translation": "Having seen such a vision in the past, why did you not think: “This body of mine now has this teaching and this thing as well.",
        "source": "T01n0024_004:0331a19_11"
    },
    {
        "source_sentence": "我亦未離如是等法。",
        "translation": "I haven't yet parted with such things.",
        "source": "T01n0024_004:0331a21_12"
    },
    {
        "source_sentence": "我今具有如是老法，未得遠離。",
        "translation": "Now that I have such an old dharma, I haven't been able to part with it.",
        "source": "T01n0024_004:0331a21_13"
    },
    {
        "source_sentence": "我當於身口意，亦可造作微妙善業，使我當有長夜利益安樂之報？」』",
        "translation": "Will I also create subtle good actions in body, speech, and thought that will cause me to have long-lasting rewards of benefit and happiness for a long time?'",
        "source": "T01n0024_004:0331a22_14"
    },
    {
        "source_sentence": "「爾時，彼人復答言：『大天！",
        "translation": "At the time, that person again replied, 'Great god!",
        "source": "T01n0024_004:0331a25_0"
    },
    {
        "source_sentence": "我實不作如是思惟。",
        "translation": "I really don't think like this.",
        "source": "T01n0024_004:0331a25_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0024_004:0331a26_2"
    },
    {
        "source_sentence": "以心縱蕩行放逸故。』",
        "translation": "It's because the mind indulges in laziness and acts carelessly.'",
        "source": "T01n0024_004:0331a26_3"
    },
    {
        "source_sentence": "時，閻摩王又更告言：『汝愚癡人，若如是者，汝自懈怠行放逸故，不修身口及意善業。",
        "translation": "King Yama then again said, 'You foolish man, if you do so, it's because you're lazy and careless in your own way that you don't cultivate good physical, verbal, or mental actions.",
        "source": "T01n0024_004:0331a26_4"
    },
    {
        "source_sentence": "以是因緣汝當長夜得大苦惱，無有安樂，是故汝當具足受此放逸之罪，",
        "translation": "Because of these causes and conditions, you will experience great suffering and distress for a long time. You will have no peace and comfort. For this reason you will be subject to the punishment of this kind of carelessness.",
        "source": "T01n0024_004:0331a28_5"
    },
    {
        "source_sentence": "得如是等惡業果報，亦如諸餘放逸眾生受此罪報。",
        "translation": "Attaining the results of such bad actions, they're like other careless sentient beings who experience the results of these sins.",
        "source": "T01n0024_004:0331b01_6"
    },
    {
        "source_sentence": "又汝諸人，此之苦報惡業果者，非汝母作、非汝父作、非汝兄弟作、非姉妹作、非國王作、非諸天作，",
        "translation": "“Furthermore, you people, these are the results of bad karma bearing painful retribution. They were not done by your mothers, fathers, brothers, sisters, kings, gods, or deities.",
        "source": "T01n0024_004:0331b02_7"
    },
    {
        "source_sentence": "亦非往昔先人所作，是汝自身作此惡業，今還聚集受此報也。』",
        "translation": "It wasn't done by someone in the past; it was your own bad action that you did this bad action, and now you're gathering together to receive this retribution.'",
        "source": "T01n0024_004:0331b04_8"
    },
    {
        "source_sentence": "「爾時，閻摩王，具以如是第一天使，善加教示，呵責彼已，復以第二天使，",
        "translation": "“At that time, King Yama had instructed the first messenger in all these ways. Having disciplined and reprimanded him, he sent a second messenger:",
        "source": "T01n0024_004:0331b06_9"
    },
    {
        "source_sentence": "善教示之，善呵責之。",
        "translation": "He teaches them well and shows them well, and he disciplines them well.",
        "source": "T01n0024_004:0331b08_0"
    },
    {
        "source_sentence": "告言：『諸人，汝豈不見第二天使世間出耶？』",
        "translation": "He told them, 'Do you people, haven't you seen the second messenger emerge from the world?'",
        "source": "T01n0024_004:0331b08_1"
    },
    {
        "source_sentence": "答言：『大天，我實不見。』",
        "translation": "He replied, 'Great god, I really don't see it.'",
        "source": "T01n0024_004:0331b09_2"
    },
    {
        "source_sentence": "王復告言：『汝豈不見，昔在世間作人身時，若婦女身、若丈夫身，四大和合，",
        "translation": "“The king said further: Haven’t you seen that in the past, when a human body was created in the world, all the four elements combined to form a woman’s body or a man’s body?",
        "source": "T01n0024_004:0331b10_3"
    },
    {
        "source_sentence": "忽爾乖違，病苦所侵，纏綿困篤，或臥小床、或臥大床，以自糞屎汙穢於身，",
        "translation": "Suddenly, in disobedience, he fell ill and was afflicted by the pain of sickness. He became so tormented and exhausted that he either lay on a small or a large bed, rubbing his body with dung and excrement.",
        "source": "T01n0024_004:0331b11_4"
    },
    {
        "source_sentence": "宛轉其中，不得自在。",
        "translation": "He simply turns around and doesn't attain mastery.",
        "source": "T01n0024_004:0331b13_5"
    },
    {
        "source_sentence": "眠臥起坐，仰人扶侍，洗拭抱持，與飲與食，一切須人，汝見之不？』",
        "translation": "Sleeping, lying, rising, and sitting, they look up to someone to assist them, wash, dry, embrace, give water and food, and all need people; do you see them?'",
        "source": "T01n0024_004:0331b14_6"
    },
    {
        "source_sentence": "「彼人答言：『大天！",
        "translation": "That person replied, 'Great god!",
        "source": "T01n0024_004:0331b16_0"
    },
    {
        "source_sentence": "我實見之。』",
        "translation": "I really see it.'",
        "source": "T01n0024_004:0331b16_1"
    },
    {
        "source_sentence": "王復告言：『癡人！",
        "translation": "The king again told him, 'Foolish man!",
        "source": "T01n0024_004:0331b16_2"
    },
    {
        "source_sentence": "汝見如是；",
        "translation": "You see it thus.",
        "source": "T01n0024_004:0331b17_0"
    },
    {
        "source_sentence": "若巧智者，云何不作如是思惟：「我今亦有如是之法，我今亦有如是之事，",
        "translation": "If someone of skillful knowledge doesn’t think in this way, “Now I too have such a teaching,” why don’t I now have such a thing?",
        "source": "T01n0024_004:0331b17_1"
    },
    {
        "source_sentence": "我亦未離如是之患法，我亦自有如是患事。",
        "translation": "Nor am I free from such a distressed state, and I myself have such distressed states.",
        "source": "T01n0024_004:0331b18_2"
    },
    {
        "source_sentence": "既未免脫，應自覺知，我今亦可作諸善業，若身若口若意善業，令我當來長夜得於大利益事大安樂事？」』",
        "translation": "Since they haven't escaped, you should know for yourself that I can now perform good actions, whether physically, verbally, or mentally good actions, so that I will in the future attain great benefits and great peace and happiness for a long time?'",
        "source": "T01n0024_004:0331b20_0"
    },
    {
        "source_sentence": "彼人答言：『不也，大天！",
        "translation": "The man replied, 'No, great god!",
        "source": "T01n0024_004:0331b22_1"
    },
    {
        "source_sentence": "我實不作如是思惟。",
        "translation": "I really don't think like this.",
        "source": "T01n0024_004:0331b22_2"
    },
    {
        "source_sentence": "以懈怠心行放逸故。』",
        "translation": "It's because of lazy mental actions and carelessness.'",
        "source": "T01n0024_004:0331b23_3"
    },
    {
        "source_sentence": "「王復告言：『癡人！",
        "translation": "Again, the king told them, 'Foolish man!",
        "source": "T01n0024_004:0331b24_0"
    },
    {
        "source_sentence": "汝今既是行放逸者，懶惰懈怠不作善業，若身、若口、若意善業，汝何能得長夜利益及安樂報？",
        "translation": "Now that you're engaged in carelessness, lazy and lazy, and don't perform good actions, how can you attain the benefit and peaceful rewards of long-night benefits and well-being if you do good actions in body, speech, or thought?",
        "source": "T01n0024_004:0331b24_1"
    },
    {
        "source_sentence": "是故汝當修行善事。",
        "translation": "Therefore, you must cultivate good actions.",
        "source": "T01n0024_004:0331b26_2"
    },
    {
        "source_sentence": "若行放逸，隨放逸故，汝此惡業，非父母作、非兄弟作、非姉妹作、非王非天，",
        "translation": "If you practice carelessness and follow carelessness, this bad action of yours is not done by your parents, not done by brothers, not done by sisters, not done by kings or gods.",
        "source": "T01n0024_004:0331b26_3"
    },
    {
        "source_sentence": "亦非往昔先人所作、非諸沙門及婆羅門等之所造作。",
        "translation": "Nor was it created by anyone in the past, nor by ascetics or priests.",
        "source": "T01n0024_004:0331b28_4"
    },
    {
        "source_sentence": "此之惡業汝既自作，汝還自受此果報也。』",
        "translation": "Since you've done this bad action yourself, you'll also experience the result of it for yourself.'",
        "source": "T01n0024_004:0331b29_5"
    },
    {
        "source_sentence": "「時，閻摩王次以如是第二天使，善加教示，呵責彼已，更以第三天使，",
        "translation": "“Then the king of Yama, in turn, skillfully instructed by this second messenger, reprimanded him and disciplined him. Having reprimanded him, he then went on to summon the third messenger,",
        "source": "T01n0024_004:0331c02_0"
    },
    {
        "source_sentence": "善教示之，善呵責之。",
        "translation": "He teaches them well and shows them well, and he disciplines them well.",
        "source": "T01n0024_004:0331c03_1"
    },
    {
        "source_sentence": "語言：『汝愚癡人！",
        "translation": "They said, 'You foolish man!",
        "source": "T01n0024_004:0331c04_2"
    },
    {
        "source_sentence": "汝昔人間作人身時，豈可不見第三天使世間出耶？』",
        "translation": "When you were a human being in the past, how could you not have seen the third heavenly messenger emerge from the world?'",
        "source": "T01n0024_004:0331c04_3"
    },
    {
        "source_sentence": "答言：『大天！",
        "translation": "He replied, 'Great god!",
        "source": "T01n0024_004:0331c05_4"
    },
    {
        "source_sentence": "我實不見。』",
        "translation": "I really don't see it.'",
        "source": "T01n0024_004:0331c06_0"
    },
    {
        "source_sentence": "時，閻摩王復告之言：『汝愚癡人！",
        "translation": "King Yama then again addressed him, saying, 'You foolish man!",
        "source": "T01n0024_004:0331c06_1"
    },
    {
        "source_sentence": "在世間時，豈復不見，若婦女身、若丈夫身，隨時命終，置於床上，以雜色衣，",
        "translation": "When he was in the world, how could he not see a woman’s body or a man’s body at the end of his life? He would place it on a couch and cover it with cloth of various colors.",
        "source": "T01n0024_004:0331c07_0"
    },
    {
        "source_sentence": "而蒙覆之，將出聚落，又作種種斗帳軒蓋，周匝莊嚴。",
        "translation": "They were covered, and they were about to leave the villages, which were also decorated with various kinds of doubly high curtains and canopies, all around them.",
        "source": "T01n0024_004:0331c08_1"
    },
    {
        "source_sentence": "眷屬圍遶，絕棄瓔珞，舉手散髮，灰土坌頭，極大悲惱，號咷哭泣，或言：「嗚呼。」",
        "translation": "Surrounded by their retinues, they abandoned their jewelry, raised their hands and scattered ashes and dirt on their heads, cried out in great grief, or said, Whoops!",
        "source": "T01n0024_004:0331c09_2"
    },
    {
        "source_sentence": "或言：「多多。」",
        "translation": "Some people may say, Many.",
        "source": "T01n0024_004:0331c11_3"
    },
    {
        "source_sentence": "或言：「養育。」",
        "translation": "Some say, nurturing.",
        "source": "T01n0024_004:0331c11_4"
    },
    {
        "source_sentence": "舉聲大叫，搥胷哀慟，種種語言，酸哽楚切。",
        "translation": "They raised their voices and cried out in great wailing, stamping with grief. All the various sounds they uttered were painful and unspeakable.",
        "source": "T01n0024_004:0331c12_5"
    },
    {
        "source_sentence": "汝悉見不？』",
        "translation": "Do you see them all?'",
        "source": "T01n0024_004:0331c13_6"
    },
    {
        "source_sentence": "答言：『大天！",
        "translation": "He replied, 'Great god!",
        "source": "T01n0024_004:0331c13_7"
    },
    {
        "source_sentence": "我實見之。』",
        "translation": "I really see it.'",
        "source": "T01n0024_004:0331c13_8"
    },
    {
        "source_sentence": "時，閻摩王復告之言：『癡人！",
        "translation": "King Yama then again addressed him, saying, 'Foolish man!",
        "source": "T01n0024_004:0331c13_9"
    },
    {
        "source_sentence": "汝昔既見如此等事，何不自作如是思惟：「我今亦有如是之法，我身亦有如是之事。",
        "translation": "Since you've seen such things in the past, why didn't you think this for yourself, Now that I have such a thing, and my body has such a thing?",
        "source": "T01n0024_004:0331c14_10"
    },
    {
        "source_sentence": "我既未脫如是事者，我亦有死，亦有死法，未得免離。",
        "translation": "Since I haven't yet escaped such a thing, I too have death and the law of death, and I haven't escaped it.",
        "source": "T01n0024_004:0331c16_11"
    },
    {
        "source_sentence": "我今宜可作諸善業，若身若口若意善業，為我長夜得大利益得安樂故。」』",
        "translation": "Now, it's advisable for me to perform good actions, whether physical, verbal, or mental, for the sake of my long-lasting benefit and well-being.'",
        "source": "T01n0024_004:0331c17_12"
    },
    {
        "source_sentence": "爾時，彼人答言：『大天！",
        "translation": "At the time, that person answered, 'Great god!",
        "source": "T01n0024_004:0331c19_13"
    },
    {
        "source_sentence": "我實不作如是思惟。",
        "translation": "I really don't think like this.",
        "source": "T01n0024_004:0331c19_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0024_004:0331c20_15"
    },
    {
        "source_sentence": "以放逸故。』",
        "translation": "It's because of carelessness.'",
        "source": "T01n0024_004:0331c20_16"
    },
    {
        "source_sentence": "「時，閻摩王復告之言：『癡人！",
        "translation": "The king of Yama then again addressed him, saying, 'Foolish man!",
        "source": "T01n0024_004:0331c21_0"
    },
    {
        "source_sentence": "汝今既是放逸行者，以放逸故，不作善業，亦不為汝長夜利益！",
        "translation": "Now that you're a careless practitioner, it's because of your carelessness that you don't perform good actions and won't benefit you for a long time!",
        "source": "T01n0024_004:0331c21_1"
    },
    {
        "source_sentence": "長夜安樂故，聚集其餘身口意善。",
        "translation": "Because it's peaceful for a long time, the rest of them gather together with goodness in body, speech, and thought.",
        "source": "T01n0024_004:0331c23_0"
    },
    {
        "source_sentence": "是故汝今有如是事，謂放逸行，以放逸故，汝自造此惡不善業。",
        "translation": "That's why you now have this kind of thing, which is the practice of carelessness, and because of that carelessness, you yourself created this bad and unskillful action.",
        "source": "T01n0024_004:0331c23_1"
    },
    {
        "source_sentence": "汝此惡業，非父母作、非兄弟作、非姉妹作、非王非天，亦非往昔先人所作，",
        "translation": "“Your evil deeds were not done by your parents, brothers, sisters, kings, gods, or anyone else in the past.",
        "source": "T01n0024_004:0331c25_2"
    },
    {
        "source_sentence": "又非沙門婆羅門作。",
        "translation": "It's not made by ascetics or priests.",
        "source": "T01n0024_004:0331c26_3"
    },
    {
        "source_sentence": "汝此惡業是汝自作，自聚集故，得此果報，汝還自受。』",
        "translation": "This bad action of yours is your own doing; it's because you gathered yourself together that you get this result, and you will again experience it for yourself.'",
        "source": "T01n0024_004:0331c27_4"
    },
    {
        "source_sentence": "時，閻摩王，具足以此第三天使，教示呵責彼諸罪人，呵責訖已，勑令將去。",
        "translation": "At the time, King Yama was fully equipped with this third divine messenger and instructed them to reprimand those sinners. Having reprimanded them, he ordered them to be driven away.",
        "source": "T01n0024_004:0331c28_5"
    },
    {
        "source_sentence": "時，守獄者，即執罪人兩足兩臂，以頭向下，以足向上，遙擲置於諸地獄中。」",
        "translation": "The guards in the hell then took the sinners' feet and two arms, faced them down with their heads and feet upward, and threw them into the hells from a distance.",
        "source": "T01n0024_004:0332a01_6"
    },
    {
        "source_sentence": "「眾生造作惡業已，　　死後墮於惡趣中，",
        "translation": "Sentient beings, having done evil deeds, Will fall into the states of woe after death.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　時閻摩王見彼來，　　以悲愍心而呵責：",
        "translation": "When King Yama saw them coming, he rebuked them with compassion and pity,",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "『汝昔在於人間時，　　可不見於老病死？",
        "translation": "'In the past, when you were in the world, couldn't you see old age, illness, and death?",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　此是天使來告示，　　云何放逸不覺知？",
        "translation": "This is the messenger who comes to tell and show, so why isn't he aware of heedlessness?",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　縱身口意染諸塵，　　不行施戒自調伏，",
        "translation": "Even if one’s body, speech, and mind are tainted with dust, If one doesn’t practice generosity or morality, One will be self-controlled.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　如此云何名有識，　　而不造作利益因？』",
        "translation": "How is this called having consciousness that doesn't create a beneficial cause?'",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　爾時如法閻摩王，　　作是呵責罪人已，",
        "translation": "It was then that King Yama, in accordance with the Dharma, Having reprimanded the sinners like this,",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　彼人喘息心驚怖，　　舉身顫掉白王言：",
        "translation": "That man panted in fear, raised his body and trembled, and said to the king,",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "『我昔由隨惡朋友，　　聞諸善法心不喜，",
        "translation": "'In the past, because of following bad friends, I didn't rejoice when I heard good qualities, and my mind wasn't attached to them.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　貪欲瞋恚所纏覆，　　不作自利故損身。』",
        "translation": "Being tethered by craving and anger, he harms his body because he doesn't work for self-benefit.'",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　王言：『汝不修善因，　　唯造種種諸惡業，",
        "translation": "The king said, 'You don't cultivate good causes; you only create various bad actions.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　癡人今日當得果，　　受彼業故來地獄。",
        "translation": "A deluded person today will attain its fruit, and because of their actions they'll come to hell.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　如此一切諸惡業，　　非父非母之所作，",
        "translation": "All these bad deeds are not done by a father or mother.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　亦非沙門婆羅門，　　又非國王諸天造。",
        "translation": "Nor are they the ascetics, priests, or kings created by gods.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　此但是汝自所作，　　諸惡業種不淨故，",
        "translation": "This is only your own doing, because the seeds of bad actions are impure.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　自既作此諸惡業，　　今當分受此惡果。』",
        "translation": "Since I've done these bad actions myself, I will now share this bad result.'",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　彼王以是三天使，　　次第教示呵責已，",
        "translation": "Because of these three heavenly messengers, the king instructs and reprimanded them one by one.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　於是獄主閻摩王，　　棄捨罪人令將去。",
        "translation": "The king of Yama, the lord of the hell, then abandoned the sinners and ordered them to leave.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　閻摩世中居住者，　　即前執取諸罪人，",
        "translation": "Those who live in Jambudvīpa are those who previously held sinners.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　牽將趣於地獄所，　　極大可畏毛竪處。",
        "translation": "They'll be led to a place of hell, where their hair stands on end and their hair stands on end.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　四邊相向有四門，　　四方四維皆齊整，",
        "translation": "There are four approaches facing each other in the four directions. The four directions and the four intermediate directions are all evenly arranged.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　周迴院牆悉是鐵，　　四面復以鐵為欄。",
        "translation": "The walls surrounding the monastery are all made of iron, and the railings on four sides are also made of iron.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　熾燃熱鐵以為地，　　光焰猛盛烟火合，",
        "translation": "Blazing hot iron is the earth; Flames of light and blazing fire are combined.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　遙見可畏心破裂，　　嚴熾炎赫不可向。",
        "translation": "From a distance, they see the fearsome and their minds broken apart, Awe-inspiring and blazingly hot, unable to turn.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　猶如一百由旬內，　　大火熾燃悉彌滿，",
        "translation": "It's like when within a hundred yojanas, a great fire blazes and fills them all up.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　其中所燒眾生類，　　皆由往昔作惡因。",
        "translation": "The kinds of sentient beings burned there are all the result of bad causes created in the past.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　被三天使之所訶，　　而心放逸無覺察，",
        "translation": "Being reprimanded by the three heavenly messengers, their minds are heedless and lacking perceptions.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　彼等於今長夜悔，　　皆由往昔下劣心。",
        "translation": "For a long time now, they've regretted it all because of their inferior minds from the past.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　諸有智慧眾生等，　　若見天使來開導，",
        "translation": "All wise sentient beings and so forth, If they see the messengers coming to enlighten them,",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　應當精勤莫放逸，　　此聖法王善巧說。",
        "translation": "You should exert yourself energetically and not be lax. This noble king of the Dharma explains skillfully.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　既見聞已當驚恐，　　諸有生死窮盡處，",
        "translation": "Having seen and heard it, they'll be frightened, and all births and deaths will end up in an endless place.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　一切無過於涅槃，　　種種患盡無有餘。",
        "translation": "All of them are no different from nirvāṇa, Extinguishing all kinds of afflictions without remainder.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　至彼安隱則快樂，　　如是見法得寂滅，",
        "translation": "When they reach that peace, they’ll be happy; Thus seeing things as they are, they attain tranquility.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "　所謂已度諸恐怖，　　自然清淨得涅槃。",
        "translation": "Having overcome all fears, they naturally and purely attain nirvāṇa.",
        "source": "T01n0024_004:0332a03_0"
    },
    {
        "source_sentence": "爾時，世尊說此偈言：起世經卷第四",
        "translation": "At that time, the World-honored One uttered these verses:",
        "source": "T01n0024_004:0332a03_0"
    }
]