[
    {
        "source_sentence": "佛說長阿含經卷第十",
        "translation": "Foshuo Chang ahan jing jing, vol. 10",
        "source": "T01n0001_010:0059b11_0"
    },
    {
        "source_sentence": "後秦弘始年佛陀耶舍共竺佛念譯",
        "translation": "Translated by Zhu Fonian at Buddhayaśas in the Hongshi year of the Later Qin dynasty",
        "source": "T01n0001_010:0059b13_0"
    },
    {
        "source_sentence": "（一二）第二分三聚經第八",
        "translation": "(12) The Eighth Part of the Second Part of the Three Assemblies Sutra",
        "source": "T01n0001_010:0059b14_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十人俱。",
        "translation": "Thus I have heard. At one time the Buddha was staying at Jeta’s Grove Monastery in Sāvatthī, accompanied by one thousand two hundred and fifty bhikṣus.",
        "source": "T01n0001_010:0059b15_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「我與汝等說微妙法，義味清淨，梵行具足，謂三聚法。",
        "translation": "At the time, the Bhagavān addressed the monks, I'll explain to you the subtle Dharma that its meaning and flavor are pure, which is endowed with the religious practice, namely, the three groups of dharmas.",
        "source": "T01n0001_010:0059b16_1"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T01n0001_010:0059b18_2"
    },
    {
        "source_sentence": "思惟念之！",
        "translation": "Think and think about it!",
        "source": "T01n0001_010:0059b18_3"
    },
    {
        "source_sentence": "當為汝說。」",
        "translation": "I will explain it for you.",
        "source": "T01n0001_010:0059b18_4"
    },
    {
        "source_sentence": "時，諸比丘受教而聽。",
        "translation": "The monks then accepted the teaching and listened.",
        "source": "T01n0001_010:0059b19_5"
    },
    {
        "source_sentence": "佛告比丘：「三法聚者，一法趣惡趣。",
        "translation": "The Buddha told the monks, Of the three clusters of teachings, one is a teaching that leads to a bad destiny.",
        "source": "T01n0001_010:0059b19_6"
    },
    {
        "source_sentence": "一法趣善趣。",
        "translation": "One is the good destinies of the Dharma destinies.",
        "source": "T01n0001_010:0059b20_7"
    },
    {
        "source_sentence": "一法趣涅槃。",
        "translation": "One is the Dharma destiny of nirvāṇa.",
        "source": "T01n0001_010:0059b20_8"
    },
    {
        "source_sentence": "云何一法趣于惡趣？",
        "translation": "What is a singular item that leads to an evil life course?",
        "source": "T01n0001_010:0059b21_9"
    },
    {
        "source_sentence": "謂無仁慈，懷毒害心，是謂一法將向惡趣。",
        "translation": "The absence of kindness and compassion, harboring poisonous thoughts—this is the first principle that leads to a bad destiny.",
        "source": "T01n0001_010:0059b21_10"
    },
    {
        "source_sentence": "云何一法趣于善趣？",
        "translation": "What is a singular item that leads to a good rebirth?",
        "source": "T01n0001_010:0059b22_11"
    },
    {
        "source_sentence": "謂不以惡心加於眾生，是為一法將向善趣。",
        "translation": "It means that someone who doesn't add sentient beings with bad thoughts is one thing that will lead to a good destiny.",
        "source": "T01n0001_010:0059b23_12"
    },
    {
        "source_sentence": "云何一法趣于涅槃？",
        "translation": "What is a singular item that leads to nirvana?",
        "source": "T01n0001_010:0059b24_13"
    },
    {
        "source_sentence": "謂能精勤，修身念處，是為一法將向涅槃。",
        "translation": "To be able to exert effort and cultivate the mindfulness of body is one thing that will lead to nirvāṇa.",
        "source": "T01n0001_010:0059b24_14"
    },
    {
        "source_sentence": "「復有二法趣向惡趣，復有二法趣向善趣，復有二法趣向涅槃。",
        "translation": "Again, there is another double doctrine that leads to an evil life course, another double doctrine that leads to a good life course, and another double doctrine that leads to nirvana.",
        "source": "T01n0001_010:0059b25_15"
    },
    {
        "source_sentence": "云何二法趣向惡趣？",
        "translation": "What are the two doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0059b27_16"
    },
    {
        "source_sentence": "一謂毀戒，二謂破見。",
        "translation": "One is to disparage precepts, and the other is to refute views.",
        "source": "T01n0001_010:0059b27_17"
    },
    {
        "source_sentence": "云何二法趣向善趣？",
        "translation": "What are the two doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0059b28_18"
    },
    {
        "source_sentence": "一謂戒具，二謂見具。",
        "translation": "One is the fulfillment of moral precepts; two are the fulfillment of views.",
        "source": "T01n0001_010:0059b28_19"
    },
    {
        "source_sentence": "云何二法趣向涅槃？",
        "translation": "What are the two doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0059b29_20"
    },
    {
        "source_sentence": "一謂為止，二謂為觀。",
        "translation": "The first is called stopping, and the second is contemplation.",
        "source": "T01n0001_010:0059b29_21"
    },
    {
        "source_sentence": "「復有三法趣向惡趣，三法向善趣，三法向涅槃。",
        "translation": "Again there is another triple doctrine that leads to an evil life course, a second triple doctrine that leads to a good life course, and a third triple doctrine that leads to nirvana.",
        "source": "T01n0001_010:0059c01_22"
    },
    {
        "source_sentence": "云何三法向惡趣？",
        "translation": "What are the three doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0059c02_23"
    },
    {
        "source_sentence": "謂三不善根：貪不善根、恚不善根、癡不善根。",
        "translation": "It means three kinds of unwholesome roots: greed, hatred, and delusion.",
        "source": "T01n0001_010:0059c02_24"
    },
    {
        "source_sentence": "云何三法向善趣？",
        "translation": "What are the three doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0059c03_25"
    },
    {
        "source_sentence": "謂三善根：無貪善根、無恚善根、無癡善根。",
        "translation": "It means three kinds of roots of wholesomeness: the root of no craving, the root of no hatred, and the root of no delusion.",
        "source": "T01n0001_010:0059c04_26"
    },
    {
        "source_sentence": "云何三法趣向涅槃？",
        "translation": "What are the three doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0059c05_27"
    },
    {
        "source_sentence": "謂三三昧：空三昧、無相三昧、無作三昧。",
        "translation": "They are three kinds of samadhi: the samadhi of emptiness, the samadhi of signlessness and the samadhi of noncontrivance.",
        "source": "T01n0001_010:0059c05_28"
    },
    {
        "source_sentence": "「又有四法趣向惡趣，四法向善趣，四法向涅槃。",
        "translation": "Again, a fourfold doctrine leads to an evil life course, a second fourfold doctrine leads to a good life course and a third fourfold doctrine leads to nirvana.",
        "source": "T01n0001_010:0059c06_29"
    },
    {
        "source_sentence": "云何四法向惡趣？",
        "translation": "What are the four doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0059c07_30"
    },
    {
        "source_sentence": "謂愛語、恚語、怖語、癡語。",
        "translation": "They are loving words, angry words, fearful words, and deluded words.",
        "source": "T01n0001_010:0059c08_0"
    },
    {
        "source_sentence": "云何四法向善趣？",
        "translation": "What are the four doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0059c08_1"
    },
    {
        "source_sentence": "謂不愛語、不恚語、不怖語、不癡語。",
        "translation": "They are words that are not loved, words that are not hateful, words that are not fearful, and words that are not deluded.",
        "source": "T01n0001_010:0059c08_2"
    },
    {
        "source_sentence": "云何四法向涅槃？",
        "translation": "What are the four doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0059c09_3"
    },
    {
        "source_sentence": "謂四念處：身念處、受念處、意念處、法念處。",
        "translation": "It means four kinds of mindfulness: body-mindfulness, sensation-mindfulness, thought-mindfulness of the mind, and thought-and-dharma-mindfulness.",
        "source": "T01n0001_010:0059c10_4"
    },
    {
        "source_sentence": "「復有五法向惡趣，五法向善趣，五法向涅槃。",
        "translation": "Again there is another fivefold doctrine that leads to an evil life course, a second fivefold doctrine that leads to a good life course, and a third fivefold doctrine that leads to nirvana.",
        "source": "T01n0001_010:0059c11_5"
    },
    {
        "source_sentence": "云何五法向惡趣？",
        "translation": "What are the five doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0059c12_6"
    },
    {
        "source_sentence": "謂破五戒：殺、盜、婬逸、妄語、飲酒。",
        "translation": "It means breaking five kinds of precepts: killing, stealing, sexual misconduct, speaking falsehoods, and drinking alcohol.",
        "source": "T01n0001_010:0059c12_7"
    },
    {
        "source_sentence": "云何五法向善趣？",
        "translation": "What are the five doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0059c13_8"
    },
    {
        "source_sentence": "謂持五戒：不殺、不盜、不婬、不欺、不飲酒。",
        "translation": "It means observing five kinds of precepts: abstinence from taking life, abstinence from taking what is not given, abstinence from sexual misconduct, abstinence from speaking falsehoods, and abstinence from ingesting alcohol.",
        "source": "T01n0001_010:0059c13_9"
    },
    {
        "source_sentence": "云何五法趣向涅槃？",
        "translation": "What are the five doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0059c14_10"
    },
    {
        "source_sentence": "謂五根：信根、精進根、念根、定根、慧根。",
        "translation": "They are five faculties: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration and the faculty of wisdom.",
        "source": "T01n0001_010:0059c15_11"
    },
    {
        "source_sentence": "「又有六法向惡趣，六法向善趣，六法向涅槃。",
        "translation": "Again, a sixfold doctrine leads to an evil life course, a second sixfold doctrine leads to a good life course, and a third sixfold doctrine leads to nirvana.",
        "source": "T01n0001_010:0059c15_12"
    },
    {
        "source_sentence": "云何六法向惡趣？",
        "translation": "What are the six doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0059c17_0"
    },
    {
        "source_sentence": "謂六不敬：不敬佛、不敬法、不敬僧、不敬戒、不敬定、不敬父母。",
        "translation": "They are the six kinds of disrespect: disrespect for buddhas; disrespect for doctrine; disrespect for the Sangha; disrespect for precepts; disrespect for meditation; and disrespect for parents.",
        "source": "T01n0001_010:0059c17_1"
    },
    {
        "source_sentence": "云何六法向善趣？",
        "translation": "What are the six doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0059c18_2"
    },
    {
        "source_sentence": "謂六敬法：敬佛、敬法、敬僧、敬戒、敬定、敬父母。",
        "translation": "It means the six kinds of reverence: reverence for Buddha, Dharma, and Sangha; reverence for morality, discipline, absorption, and filial piety toward one’s parents.",
        "source": "T01n0001_010:0059c19_3"
    },
    {
        "source_sentence": "云何六法向涅槃？",
        "translation": "What are the six doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0059c20_4"
    },
    {
        "source_sentence": "謂六思念：念佛、念法、念僧、念戒、念施、念天。",
        "translation": "It means the six kinds of mindfulness: being mindful of Buddha, Dharma, Sangha, precepts, charity, and heaven.",
        "source": "T01n0001_010:0059c20_5"
    },
    {
        "source_sentence": "「又有七法向惡趣，七法向善趣，七法向涅槃。",
        "translation": "Again, another seven things lead to an evil life course, another seven things lead to a good life course, and another seven things lead to nirvana.",
        "source": "T01n0001_010:0059c21_6"
    },
    {
        "source_sentence": "云何七法向惡趣？",
        "translation": "What are the seven doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0059c22_7"
    },
    {
        "source_sentence": "謂殺生、不與取、婬逸、妄語、兩舌、惡口、綺語。",
        "translation": "They are taking life, taking what is not given and taking what is not given, sexual misconduct, false speech, duplicitous speech, harsh speech, and fancy speech.",
        "source": "T01n0001_010:0059c23_8"
    },
    {
        "source_sentence": "云何七法向善趣？",
        "translation": "What are the seven doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0059c24_9"
    },
    {
        "source_sentence": "謂不殺生、不盜、不婬、不欺、不兩舌、不惡口、不綺語。",
        "translation": "They are not taking life, not stealing, not engaging in sexual misconduct, not telling lies, not uttering slanderous words, not speaking harshly, and not engaging in fancy speech.",
        "source": "T01n0001_010:0059c24_10"
    },
    {
        "source_sentence": "云何七法向涅槃？",
        "translation": "What are the seven doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0059c25_11"
    },
    {
        "source_sentence": "謂七覺意：念覺意、擇法覺意、精進覺意、猗覺意、定覺意、喜覺意、捨覺意。",
        "translation": "It means seven kinds of enlightenment: the awakening factor of mindfulness, the awakening factor of discriminating qualities, the awakening factor of effort, the awakening factor of peace, the awakening factor of concentration, the awakening factor of joy, and the awakening factor of equanimity.",
        "source": "T01n0001_010:0059c26_12"
    },
    {
        "source_sentence": "「又有八法向惡趣，八法向善趣，八法向涅槃。",
        "translation": "Again, an eightfold doctrine leads to an evil life course, a second eightfold doctrine leads to a good life course, and a third eightfold doctrine leads to nirvana.",
        "source": "T01n0001_010:0059c27_13"
    },
    {
        "source_sentence": "云何八法向惡趣？",
        "translation": "What are the eight doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0059c28_14"
    },
    {
        "source_sentence": "謂八邪行：邪見、邪志、邪語、邪業、邪命、邪方便、邪念、邪定。",
        "translation": "It means the eight kinds of wrong conduct: wrong view, wrong thought, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong concentration.",
        "source": "T01n0001_010:0059c29_15"
    },
    {
        "source_sentence": "云何八法向善趣？",
        "translation": "What are the eight doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0060a01_16"
    },
    {
        "source_sentence": "謂世正見：正志、正語、正業、正命、正方便、正念、正定。",
        "translation": "It means worldly right view: right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.",
        "source": "T01n0001_010:0060a01_17"
    },
    {
        "source_sentence": "云何八法向涅槃？",
        "translation": "What are the eight doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0060a03_18"
    },
    {
        "source_sentence": "謂八賢聖道：正見、正志、正語、正業、正命、正方便、正念、正定。",
        "translation": "It means the eightfold noble path of goodness: right view, right effort, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.",
        "source": "T01n0001_010:0060a03_19"
    },
    {
        "source_sentence": "「又有九法向惡趣，九法向善趣，九法向涅槃。",
        "translation": "Again, there is another ninefold doctrine that leads to an evil life course, a second ninefold doctrine that leads to a good life course, and a third nirvana.",
        "source": "T01n0001_010:0060a04_20"
    },
    {
        "source_sentence": "云何九法向惡趣？",
        "translation": "What are the nine doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0060a05_21"
    },
    {
        "source_sentence": "謂九惱：有人已侵惱我，今侵惱我，當侵惱我；",
        "translation": "It means the nine kinds of harmfulness:",
        "source": "T01n0001_010:0060a06_22"
    },
    {
        "source_sentence": "我所愛者，已侵惱，今侵惱，當侵惱；",
        "translation": "Those beloved by me have been harmed, and those who are harmed now will be harmed.",
        "source": "T01n0001_010:0060a07_23"
    },
    {
        "source_sentence": "我所憎者，已愛敬，今愛敬，當愛敬。",
        "translation": "Those whom I dislike have been loved and respected, and those who are now loved and respected will be loved and respected.",
        "source": "T01n0001_010:0060a08_24"
    },
    {
        "source_sentence": "云何九法向善趣？",
        "translation": "What are the nine doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0060a08_25"
    },
    {
        "source_sentence": "謂九無惱：彼已侵我，我惱何益？",
        "translation": "It means the nine kinds of nonattachment:",
        "source": "T01n0001_010:0060a09_26"
    },
    {
        "source_sentence": "已不生惱，今不生惱，當不生惱；",
        "translation": "Disturbance has not yet arisen, but if it does not arise now, it will not arise.",
        "source": "T01n0001_010:0060a10_27"
    },
    {
        "source_sentence": "我所愛者，彼已侵惱，我惱何益？",
        "translation": "What's beloved by self, that person has already harmed it, so what good is harming self?",
        "source": "T01n0001_010:0060a10_28"
    },
    {
        "source_sentence": "已不生惱，今不生惱，當不生惱；",
        "translation": "Disturbance has not yet arisen, but if it does not arise now, it will not arise.",
        "source": "T01n0001_010:0060a11_29"
    },
    {
        "source_sentence": "我所憎者，彼已愛敬，我惱何益？",
        "translation": "What's disliked by me is liked and respected by them, but what good is it to harm me?",
        "source": "T01n0001_010:0060a12_30"
    },
    {
        "source_sentence": "已不生惱，當不生惱，今不生惱。",
        "translation": "Once no anger has arisen, it won't arise; now no anger will arise.",
        "source": "T01n0001_010:0060a13_31"
    },
    {
        "source_sentence": "云何九法向涅槃？",
        "translation": "What are the nine doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0060a13_32"
    },
    {
        "source_sentence": "謂九善法，一喜，二愛，三悅，四樂，五定，六實知，七除捨，八無欲，",
        "translation": "They are the nine wholesome states: (1) delight, (2) craving, (3) pleasure, (4) happiness, (5) concentration, (6) genuine knowledge, (7) equanimity, (8) dispassion, and (9) nonattachment.",
        "source": "T01n0001_010:0060a14_33"
    },
    {
        "source_sentence": "九解脫。",
        "translation": "Nine are liberation.",
        "source": "T01n0001_010:0060a15_34"
    },
    {
        "source_sentence": "「又有十法向惡趣，十法向善趣，十法向涅槃。",
        "translation": "Again, there are ten doctrinal items that lead to an evil life course, ten doctrinal items that lead to a good life course, and ten doctrinal items that lead to nirvana.",
        "source": "T01n0001_010:0060a15_35"
    },
    {
        "source_sentence": "云何十法向惡趣？",
        "translation": "What are the ten doctrinal items that lead to an evil life course?",
        "source": "T01n0001_010:0060a16_36"
    },
    {
        "source_sentence": "謂十不善：身殺、盜、婬，口兩舌、惡罵、妄言、綺語，意貪取、嫉妬、邪見。",
        "translation": "It means the ten kinds of unwholesome conduct: taking life, taking what is not given, taking what is not given, sexual misconduct, speaking falsehoods, divisive speech, harsh words, flattery, covetousness, jealousy, and wrong views.",
        "source": "T01n0001_010:0060a17_37"
    },
    {
        "source_sentence": "云何十法向善趣？",
        "translation": "What are the ten doctrinal items that lead to a good life course?",
        "source": "T01n0001_010:0060a18_38"
    },
    {
        "source_sentence": "謂十善行：身不殺、盜、婬，口不兩舌、惡罵、妄言、綺語，意不貪取、嫉妬、邪見。",
        "translation": "It means the ten kinds of good conduct: abstinence from taking life; abstinence from taking what is not given; abstinence from taking what is not given; abstinence from taking what is not given; abstinence from taking what is not given; abstinence from taking what is not given; abstinence from sexual misconduct; abstinence from speaking falsehoods; abstin",
        "source": "T01n0001_010:0060a19_39"
    },
    {
        "source_sentence": "云何十法向涅槃？",
        "translation": "What are the ten doctrinal items that lead to nirvana?",
        "source": "T01n0001_010:0060a20_40"
    },
    {
        "source_sentence": "謂十直道：正見、正志、正語、正業、正命、正方便、正念、正定、正解脫、正智。",
        "translation": "They are the ten direct paths: right view, right thought, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right liberation, and right knowledge.",
        "source": "T01n0001_010:0060a21_41"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0001_010:0060a22_42"
    },
    {
        "source_sentence": "如是十法，得至涅槃，是名三聚微妙正法，我為如來、為眾弟子所應作者，",
        "translation": "\\",
        "source": "T01n0001_010:0060a22_43"
    },
    {
        "source_sentence": "無不周備，憂念汝等，故演經道；",
        "translation": "Because of your sorrowful thoughts, I teach you the path of scripture.",
        "source": "T01n0001_010:0060a24_44"
    },
    {
        "source_sentence": "汝等亦宜自憂其身，當處閑居、樹下思惟，勿為懈怠，今不勉力，後悔無益。」",
        "translation": "You should also worry about your own bodies, so you should stay in a secluded place or under a tree and reflect on it. Don't be lazy; if you don't work hard now, regretting it won't help.",
        "source": "T01n0001_010:0060a25_45"
    },
    {
        "source_sentence": "諸比丘聞佛所說，歡喜奉行。",
        "translation": "Having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well. ****** 13. The Scripture on the Explication of Underlying Meaning:",
        "source": "T01n0001_010:0060a27_46"
    },
    {
        "source_sentence": "（一三）佛說長阿含第二分大緣方便經第九",
        "translation": "(23) The Buddha teaches the second part of the Longer Āgama, the ninth part of the Mahāprajñāpāramitā-sūtra",
        "source": "T01n0001_010:0060a28_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛在拘流沙國劫摩沙住處，與大比丘眾千二百五十人俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Kamosa in the country of Kauśinagara, accompanied by one thousand two hundred and fifty bhikṣus.",
        "source": "T01n0001_010:0060a29_0"
    },
    {
        "source_sentence": "爾時，阿難在閑靜處，作是念言：「甚奇！",
        "translation": "At the time, Ānanda was in a quiet place and had this thought, saying, Marvelous!",
        "source": "T01n0001_010:0060b01_1"
    },
    {
        "source_sentence": "甚特！",
        "translation": "That's extraordinary!",
        "source": "T01n0001_010:0060b02_2"
    },
    {
        "source_sentence": "世尊所說十二因緣法之光明，甚深難解，如我意觀，猶如目前，以何為深？」",
        "translation": "The Bhagavān's explanation of the twelve causes and conditions for the light of the Dharma explained by the Bhagavān is profound and difficult to understand, so why would it be so profound if I were to contemplate it as before?",
        "source": "T01n0001_010:0060b02_3"
    },
    {
        "source_sentence": "於是，阿難即從靜室起，至世尊所，頭面禮足，在一面坐，白世尊言：「我向於靜室，",
        "translation": "Ānanda then rose from his seat in meditation and went to the place where the World-honored One was. Having honored him by bowing his forehead at his feet, he took his seat at one side and said to the World-honored One:",
        "source": "T01n0001_010:0060b04_4"
    },
    {
        "source_sentence": "默自思念：『甚奇！",
        "translation": "He thought quietly to himself, 'How marvelous!",
        "source": "T01n0001_010:0060b06_5"
    },
    {
        "source_sentence": "甚特！",
        "translation": "That's extraordinary!",
        "source": "T01n0001_010:0060b06_6"
    },
    {
        "source_sentence": "世尊所說十二因緣法之光明，甚深難解，如我意觀，如在目前，以何為深？』」",
        "translation": "The Bhagavān's explanation of the twelve causes and conditions for the light of the Dharma explained by the Bhagavān is profound and difficult to understand, so why would it be so profound?'",
        "source": "T01n0001_010:0060b06_7"
    },
    {
        "source_sentence": "爾時，世尊告阿難曰：「止！",
        "translation": "It was then that the Bhagavān addressed Ānanda, Stop!",
        "source": "T01n0001_010:0060b08_8"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T01n0001_010:0060b09_9"
    },
    {
        "source_sentence": "勿作此言：『十二因緣法之光明，甚深難解！』",
        "translation": "Don't say this, 'The twelve causes and conditions of the light of the Dharma are so profound and difficult to understand!'",
        "source": "T01n0001_010:0060b09_10"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060b10_11"
    },
    {
        "source_sentence": "此十二因緣難見難知，諸天、魔、梵、沙門、婆羅門、未見緣者，若欲思量觀察分別其義者，",
        "translation": "These twelve reasons are difficult to see and difficult to know. Gods, Māra, Brahmā, śramaṇas, brāhmaṇas, and those who have not seen the reasons—if they want to deliberate on these twelve reasons and analyze their meanings—",
        "source": "T01n0001_010:0060b10_12"
    },
    {
        "source_sentence": "則皆荒迷，無能見者。",
        "translation": "They're all wild and confused, and there's no one who can see them.",
        "source": "T01n0001_010:0060b12_13"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060b12_14"
    },
    {
        "source_sentence": "我今語汝老死有緣，若有問言：『何等是老死緣？』",
        "translation": "Now, I'll tell you that old age and death have conditions, so if you ask, 'What are the conditions for old age and death?'",
        "source": "T01n0001_010:0060b13_15"
    },
    {
        "source_sentence": "應答彼言：『生是老死緣！』",
        "translation": "You should answer them, saying, 'Birth is the condition for old age and death!'",
        "source": "T01n0001_010:0060b14_16"
    },
    {
        "source_sentence": "若復問言：『誰是生緣？』",
        "translation": "If he further asks, 'Who are the conditions for birth?'",
        "source": "T01n0001_010:0060b14_17"
    },
    {
        "source_sentence": "應答彼言：『有是生緣。』",
        "translation": "You should answer them by saying, 'There are these conditions for birth.'",
        "source": "T01n0001_010:0060b15_18"
    },
    {
        "source_sentence": "若復問言：『誰是有緣？』",
        "translation": "If he further asks, 'Who has the conditions?'",
        "source": "T01n0001_010:0060b15_19"
    },
    {
        "source_sentence": "應答彼言：『取是有緣。』",
        "translation": "You should answer them by saying, 'The grasping is conditioned by conditions.'",
        "source": "T01n0001_010:0060b16_20"
    },
    {
        "source_sentence": "若復問言：『誰是取緣？』",
        "translation": "If he further asks, 'Who is the condition for grasping?'",
        "source": "T01n0001_010:0060b16_21"
    },
    {
        "source_sentence": "應答彼言：『愛是取緣。』",
        "translation": "You should answer them by saying, 'craving is the condition for grasping.'",
        "source": "T01n0001_010:0060b17_22"
    },
    {
        "source_sentence": "若復問言：『誰是愛緣？』",
        "translation": "If he further asks, 'Who are the causes of craving?'",
        "source": "T01n0001_010:0060b17_23"
    },
    {
        "source_sentence": "應答彼言：『受是愛緣。』",
        "translation": "You should answer them by saying, 'Feeling is the condition of craving.'",
        "source": "T01n0001_010:0060b18_24"
    },
    {
        "source_sentence": "若復問言：『誰是受緣？』",
        "translation": "If he further asks, 'Who are the conditions for sensation?'",
        "source": "T01n0001_010:0060b18_25"
    },
    {
        "source_sentence": "應答彼言：『觸是受緣。』",
        "translation": "You should answer them by saying,'touches are the conditions for sensation.'",
        "source": "T01n0001_010:0060b19_26"
    },
    {
        "source_sentence": "若復問言：『誰為觸緣？』",
        "translation": "If he further asks, 'Who is the condition for touch?'",
        "source": "T01n0001_010:0060b19_27"
    },
    {
        "source_sentence": "應答彼言：『六入是觸緣。』",
        "translation": "You should answer them by saying, 'The six sense-fields are the conditions for touch.'",
        "source": "T01n0001_010:0060b20_28"
    },
    {
        "source_sentence": "若復問言：『誰為六入緣？』",
        "translation": "If he further asks, 'Who are the conditions for the six sense-fields?'",
        "source": "T01n0001_010:0060b21_0"
    },
    {
        "source_sentence": "應答彼言：『名色是六入緣。』",
        "translation": "You should answer them by saying,'Name and form are the conditions for the six sense-fields.'",
        "source": "T01n0001_010:0060b21_1"
    },
    {
        "source_sentence": "若復問言：『誰為名色緣？』",
        "translation": "If he further asks, 'Who is the condition for name-and-form?'",
        "source": "T01n0001_010:0060b22_2"
    },
    {
        "source_sentence": "應答彼言：『識是名色緣。』",
        "translation": "You should answer them by saying, 'Consciousness is the condition of name-and-form.'",
        "source": "T01n0001_010:0060b22_3"
    },
    {
        "source_sentence": "若復問言：『誰為識緣？』",
        "translation": "If he further asks, 'Who is the condition of consciousness?'",
        "source": "T01n0001_010:0060b23_4"
    },
    {
        "source_sentence": "應答彼言：『行是識緣。』",
        "translation": "You should answer them by saying, 'Conduct is the condition of consciousness.'",
        "source": "T01n0001_010:0060b23_5"
    },
    {
        "source_sentence": "若復問言：『誰為行緣？』",
        "translation": "If he further asks, 'Who are the conditions for practice?'",
        "source": "T01n0001_010:0060b24_6"
    },
    {
        "source_sentence": "應答彼言：『癡是行緣。』",
        "translation": "You should answer them, saying, 'Madness is the condition of volition.'",
        "source": "T01n0001_010:0060b24_7"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060b25_8"
    },
    {
        "source_sentence": "如是緣癡有行，緣行有識，緣識有名色，緣名色有六入，緣六入有觸，",
        "translation": "In the same way, conditioned by delusion there is volition; conditioned by volition there is consciousness; conditioned by consciousness there is mental and physical process; conditioned by mental and physical process there are the six sense operations; conditioned by these six sense operations there is contact.",
        "source": "T01n0001_010:0060b25_9"
    },
    {
        "source_sentence": "緣觸有受，緣受有愛，緣愛有取，緣取有有，緣有有生，緣生有老、死、憂、悲、苦惱，",
        "translation": "Conditioned by contact, there is sensation; conditioned by sensation, there is thirst; conditioned by thirst, there is grasping; conditioned by grasping, there is existence; conditioned by grasping, there is birth; conditioned by birth, there is old age, death, sorrow, lamentation, pity, pain, and suffering.",
        "source": "T01n0001_010:0060b27_10"
    },
    {
        "source_sentence": "大患所集，是為此大苦陰緣。」",
        "translation": "This is the condition for this great aggregate of suffering that's accumulated by great afflictions.",
        "source": "T01n0001_010:0060b29_11"
    },
    {
        "source_sentence": "佛告阿難：「緣生有老死，此為何義？",
        "translation": "The Buddha told Ānanda, What does it mean to say that old age and death are conditioned by birth?",
        "source": "T01n0001_010:0060b29_12"
    },
    {
        "source_sentence": "若使一切眾生無有生者，寧有老死不？」",
        "translation": "If all sentient beings lack birth, how could there be old age and death?",
        "source": "T01n0001_010:0060c01_13"
    },
    {
        "source_sentence": "阿難答曰：「無也。」",
        "translation": "Ānanda answered, No.",
        "source": "T01n0001_010:0060c02_14"
    },
    {
        "source_sentence": "「是故，阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T01n0001_010:0060c03_0"
    },
    {
        "source_sentence": "以此緣，知老死由生，緣生有老死，我所說者，義在於此。」",
        "translation": "Because of this condition, we know that old age and death arise from birth and that there's old age and death depending on birth, and the meaning of what I teach is here.",
        "source": "T01n0001_010:0060c03_1"
    },
    {
        "source_sentence": "又告阿難：「緣有有生，此為何義？",
        "translation": "Again, he told Ānanda, What does this mean by conditioned existence and birth?",
        "source": "T01n0001_010:0060c04_2"
    },
    {
        "source_sentence": "若使一切眾生無有欲有、色無色有者，寧有生不？」",
        "translation": "If all sentient beings lack the existence of desire and form and formlessness, how could there be birth?",
        "source": "T01n0001_010:0060c05_3"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0060c06_4"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c06_5"
    },
    {
        "source_sentence": "我以此緣，知生由有，緣有有生，我所說者，義在於此。」",
        "translation": "Because of this condition, I know that birth comes from existence and that conditions come from existence; the meaning of what I teach is here.",
        "source": "T01n0001_010:0060c06_6"
    },
    {
        "source_sentence": "又告阿難：「緣取有有，此為何義？",
        "translation": "Again, he told Ānanda, What does it mean to say that conditioned by grasping there's existence?",
        "source": "T01n0001_010:0060c08_7"
    },
    {
        "source_sentence": "若使一切眾生無有欲取、見取、戒取、我取者，寧有有不？」",
        "translation": "If all sentient beings lack the grasping of desire, the grasping of views, the grasping of precepts, and the grasping of self, how could there be?",
        "source": "T01n0001_010:0060c09_0"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0060c10_1"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c10_2"
    },
    {
        "source_sentence": "我以此緣，知有由取，緣取有有，我所說者，義在於此。」",
        "translation": "Because of this condition, I know that there's a cause for grasping, and because of grasping, there's existence; the meaning of what I teach is here.",
        "source": "T01n0001_010:0060c10_3"
    },
    {
        "source_sentence": "又告阿難：「緣愛有取，此為何義？",
        "translation": "Again, he asked Ānanda, What does it mean to say that conditioned by craving there's grasping?",
        "source": "T01n0001_010:0060c11_4"
    },
    {
        "source_sentence": "若使一切眾生無有欲愛、有愛、無有愛者，寧有取不？」",
        "translation": "If all sentient beings lack desire, craving, and non-craving, how could there be grasping?",
        "source": "T01n0001_010:0060c12_5"
    },
    {
        "source_sentence": "答曰：「無有。」",
        "translation": "He replied, There's nothing.",
        "source": "T01n0001_010:0060c13_6"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c14_7"
    },
    {
        "source_sentence": "我以此緣，知取由愛，緣愛有取，我所說者，義在於此。」",
        "translation": "Because of this condition, I know that grasping comes from craving, and because of craving there's grasping, and the meaning of what I teach is here.",
        "source": "T01n0001_010:0060c14_8"
    },
    {
        "source_sentence": "又告阿難：「緣受有愛，此為何義？",
        "translation": "Again, he asked Ānanda, What does it mean to say that conditioned by sensation there's craving?",
        "source": "T01n0001_010:0060c15_9"
    },
    {
        "source_sentence": "若使一切眾生無有樂受、苦受、不苦不樂受者，寧有愛不？」",
        "translation": "If all sentient beings lack pleasant feelings, painful feelings, and feelings that are neither pleasant nor painful, how could there be craving?",
        "source": "T01n0001_010:0060c16_10"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0060c17_11"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c17_12"
    },
    {
        "source_sentence": "我以此緣，知愛由受，緣受有愛，我所說者，義在於此。",
        "translation": "Because of this causality, the self knows that craving arises from feeling. Conditioned by feeling there is craving. The meaning of causal dependence that I intend to explain can be found here.",
        "source": "T01n0001_010:0060c18_13"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c19_14"
    },
    {
        "source_sentence": "當知因愛有求，因求有利，因利有用，因用有欲，因欲有著，因著有嫉，",
        "translation": "You should know that depending on thirst, there is attachment; depending on thirst, there is pursuit; depending on pursuit, there is profit; depending on profit, there is enjoyment; depending on enjoyment, there is desire; depending on attachment, there is attachment; and depending on attachment, there is jealousy.",
        "source": "T01n0001_010:0060c19_15"
    },
    {
        "source_sentence": "因嫉有守，因守有護。",
        "translation": "Because of jealousy, there is restraint; because of restraint, there is protection.",
        "source": "T01n0001_010:0060c21_16"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c21_17"
    },
    {
        "source_sentence": "由有護故，有刀杖、諍訟、作無數惡，我所說者，義在於此。",
        "translation": "The meaning of causal dependence that I intend to explain can be found here.",
        "source": "T01n0001_010:0060c21_18"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c23_19"
    },
    {
        "source_sentence": "此為何義，若使一切眾生無有護者，當有刀杖、諍訟，起無數惡不？」",
        "translation": "What does this mean? If all sentient beings lack protection, will there be swords, sticks, disputes, and arguments that give rise to countless bad things?",
        "source": "T01n0001_010:0060c23_20"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0060c24_21"
    },
    {
        "source_sentence": "「是故，阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T01n0001_010:0060c25_22"
    },
    {
        "source_sentence": "以此因緣，知刀杖、諍訟由護而起，緣護有刀杖、諍訟。",
        "translation": "Because of these causes and conditions, it's known that swords, sticks, and disputes arise from guarding, and because of guarding, there are swords, sticks, and disputes.",
        "source": "T01n0001_010:0060c25_23"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c26_24"
    },
    {
        "source_sentence": "我所說者，義在於此。」",
        "translation": "The meaning of what I teach is here.",
        "source": "T01n0001_010:0060c26_25"
    },
    {
        "source_sentence": "又告阿難：「因守有護，此為何義？",
        "translation": "Again, he told Ānanda, What does it mean to say that there's protection because of guarding?",
        "source": "T01n0001_010:0060c27_26"
    },
    {
        "source_sentence": "若使一切眾生無有守者，寧有護不？」",
        "translation": "If all sentient beings lack a protector, how could they have protection?",
        "source": "T01n0001_010:0060c28_27"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0060c29_0"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0060c29_1"
    },
    {
        "source_sentence": "我以此緣，知護由守，因守有護，我所說者，義在於此。",
        "translation": "Because of this causality, I know that discipline arises depending on discipline. The meaning of causal dependence that I intend to explain can be found here.",
        "source": "T01n0001_010:0060c29_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a01_3"
    },
    {
        "source_sentence": "因嫉有守，此為何義？",
        "translation": "What does it mean to say that because of jealousy there is guarding?",
        "source": "T01n0001_010:0061a01_4"
    },
    {
        "source_sentence": "若使一切眾生無有嫉者，寧有守不？」",
        "translation": "If all sentient beings don't have jealousy, how could there be guarding?",
        "source": "T01n0001_010:0061a02_5"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a03_6"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a03_7"
    },
    {
        "source_sentence": "我以此緣，知守由嫉，因嫉有守，我所說者，義在於此。",
        "translation": "Because of this causality, I know that discipline arises from jealousy; because of jealousy there is discipline. The meaning of causal dependence that I intend to explain can be found here.",
        "source": "T01n0001_010:0061a03_8"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a04_9"
    },
    {
        "source_sentence": "因著有嫉，此為何義？",
        "translation": "What does it mean to say that there is jealousy because of attachment?",
        "source": "T01n0001_010:0061a04_10"
    },
    {
        "source_sentence": "若使一切眾生無有著者，寧有嫉不？」",
        "translation": "If all sentient beings were to have no attachment, how could there be jealousy?",
        "source": "T01n0001_010:0061a05_11"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a06_12"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a06_13"
    },
    {
        "source_sentence": "我以此緣，知嫉由著，因著有嫉，我所說者，義在於此。",
        "translation": "Because of this causality, I know that jealousy is due to attachment and that because of attachment there is jealousy. The meaning of causal linkage that I intend to explain can be found here.",
        "source": "T01n0001_010:0061a06_14"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a07_15"
    },
    {
        "source_sentence": "因欲有著，此為何義？",
        "translation": "What does it mean to say that attachment arises from desire?",
        "source": "T01n0001_010:0061a08_16"
    },
    {
        "source_sentence": "若使一切眾生無有欲者，寧有著不？」",
        "translation": "If all sentient beings lack desire, how could they have it?",
        "source": "T01n0001_010:0061a08_17"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a09_18"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a09_19"
    },
    {
        "source_sentence": "我以此緣，知著由欲，因欲有著，我所說者，義在於此。",
        "translation": "Because of this causality, the self knows that attachment arises from desire and is conditioned by desire. The meaning of causal dependence as explained by me is found here.",
        "source": "T01n0001_010:0061a09_20"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a11_21"
    },
    {
        "source_sentence": "因用有欲，此為何義？",
        "translation": "What does it mean to say that desire exists by reason of its activity?",
        "source": "T01n0001_010:0061a11_22"
    },
    {
        "source_sentence": "若使一切眾生無有用者，寧有欲不？」",
        "translation": "If all sentient beings are made useless, how could there be desire?",
        "source": "T01n0001_010:0061a11_23"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a12_24"
    },
    {
        "source_sentence": "「阿難，我以此義，知欲由用，因用有欲，我所說者，義在於此。",
        "translation": "“Ānanda, it is because of this meaning that I know that desire arises from application and has craving as its cause. The meaning of causal dependence that I intend to explain can be found here.",
        "source": "T01n0001_010:0061a12_25"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a14_26"
    },
    {
        "source_sentence": "因利有用，此為何義，若使一切眾生無有利者，寧有用不？」",
        "translation": "What's the meaning of this that causes and benefits are useful, and if all sentient beings aren't beneficial, how could they be useful?",
        "source": "T01n0001_010:0061a14_27"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a15_28"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a16_29"
    },
    {
        "source_sentence": "我以此義，知用由利，因利有用，我所說者，義在於此。",
        "translation": "Because of this doctrine, I know that the function is caused by profit. The meaning of causal profit has function. That which I teach is here.",
        "source": "T01n0001_010:0061a16_30"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a17_31"
    },
    {
        "source_sentence": "因求有利，此為何義？",
        "translation": "What's the meaning of this because they seek profit?",
        "source": "T01n0001_010:0061a17_32"
    },
    {
        "source_sentence": "若使一切眾生無有求者，寧有利不？」",
        "translation": "If all sentient beings don't have anything to ask for, how could it be advantageous?",
        "source": "T01n0001_010:0061a18_33"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a19_0"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a19_1"
    },
    {
        "source_sentence": "我以此緣，知利由求，因求有利，我所說者，義在於此。",
        "translation": "The meaning of causal dependence that I intend to explain can be found here.",
        "source": "T01n0001_010:0061a19_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a20_3"
    },
    {
        "source_sentence": "因愛有求，此為何義？",
        "translation": "What does it mean to say that desire exists by reason of thirst?",
        "source": "T01n0001_010:0061a20_4"
    },
    {
        "source_sentence": "若使一切眾生無有愛者，寧有求不？」",
        "translation": "If all sentient beings lack craving, how could there be desire?",
        "source": "T01n0001_010:0061a21_5"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a22_6"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a22_7"
    },
    {
        "source_sentence": "我以此緣，知求由愛，因愛有求，我所說者，義在於此。」",
        "translation": "Because of this condition, I know that seeking arises from craving, and because of craving there's seeking; the meaning of what I teach is here.",
        "source": "T01n0001_010:0061a22_8"
    },
    {
        "source_sentence": "又告阿難：「因愛有求，至於守護，受亦如是，因受有求，至於守護。」",
        "translation": "Again, he told Ānanda, So it is with sensation because there's craving and seeking as far as guarding, and so it is with sensation because there's feeling and seeking as far as guarding.",
        "source": "T01n0001_010:0061a23_9"
    },
    {
        "source_sentence": "佛告阿難：「緣觸有受，此為何義？",
        "translation": "The Buddha told Ānanda, What does it mean to say that conditioned by touch there's sensation?",
        "source": "T01n0001_010:0061a25_10"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a26_11"
    },
    {
        "source_sentence": "若使無眼、無色、無眼識者，寧有觸不？」",
        "translation": "If there's no eye, formlessness, or eye consciousness, how could there be touch?",
        "source": "T01n0001_010:0061a26_12"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a27_13"
    },
    {
        "source_sentence": "「若無耳、聲、耳識，鼻、香、鼻識，舌、味、舌識，身、觸、身識，",
        "translation": "“If there’s no ear, sound, or ear consciousness, nose, odor, or nose consciousness, tongue, taste, and tongue consciousness, body, touch, or body consciousness,",
        "source": "T01n0001_010:0061a27_14"
    },
    {
        "source_sentence": "意、法、意識者，寧有觸不？」",
        "translation": "How could there be touch when it comes to mind, dharmas, and consciousness?",
        "source": "T01n0001_010:0061a28_15"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061a29_16"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061a29_17"
    },
    {
        "source_sentence": "若使一切眾生無有觸者，寧有受不？」",
        "translation": "If all sentient beings lack touch, how could there be sensation?",
        "source": "T01n0001_010:0061a29_18"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b01_19"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b01_20"
    },
    {
        "source_sentence": "我以是義，知受由觸，緣觸有受，我所說者，義在於此。",
        "translation": "Because of this meaning, I know that sensation is due to contact. Conditioned by contact, there is sensation. The meaning of causal dependence as explained by me can be found here.",
        "source": "T01n0001_010:0061b01_21"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b03_22"
    },
    {
        "source_sentence": "緣名色有觸，此為何義？",
        "translation": "What does it mean to say that there is contact conditioned by name and form?",
        "source": "T01n0001_010:0061b03_23"
    },
    {
        "source_sentence": "若使一切眾生無有名色者，寧有心觸不？」",
        "translation": "If all sentient beings lack name and form, how could there be mental contact?",
        "source": "T01n0001_010:0061b03_24"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b04_25"
    },
    {
        "source_sentence": "「若使一切眾生無形色相貌者，寧有身觸不？」",
        "translation": "If all sentient beings lack form and shape, how could there be bodily contact?",
        "source": "T01n0001_010:0061b05_0"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b06_1"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b06_2"
    },
    {
        "source_sentence": "若無名色，寧有觸不？」",
        "translation": "If there were no name and form, how could there be touch?",
        "source": "T01n0001_010:0061b06_3"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b06_4"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b07_5"
    },
    {
        "source_sentence": "我以是緣，知觸由名色，緣名色有觸，我所說者，義在於此。",
        "translation": "The meaning of causal dependence that I intend to explain can be found here. Because of this causal dependence, I know that contact is due to name and form. Conditioned by name and form, there is contact.",
        "source": "T01n0001_010:0061b07_6"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b08_7"
    },
    {
        "source_sentence": "緣識有名色，此為何義？",
        "translation": "What does this mean by conditioned consciousness having name and form as object?",
        "source": "T01n0001_010:0061b08_8"
    },
    {
        "source_sentence": "若識不入母胎者，有名色不？」",
        "translation": "If consciousness doesn't enter the mother's womb, does it have form?",
        "source": "T01n0001_010:0061b09_9"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b10_10"
    },
    {
        "source_sentence": "「若識入胎不出者，有名色不？」",
        "translation": "If consciousness enters the womb and doesn't leave it, is there form?",
        "source": "T01n0001_010:0061b10_11"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b11_0"
    },
    {
        "source_sentence": "「若識出胎，嬰孩壞敗，名色得增長不？」",
        "translation": "If consciousness emerges from the womb and the infant breaks down, will name-and-form grow?",
        "source": "T01n0001_010:0061b11_1"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b12_2"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b12_3"
    },
    {
        "source_sentence": "若無識者，有名色不？」",
        "translation": "If there's no consciousness, will there be form?",
        "source": "T01n0001_010:0061b12_4"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b13_0"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b13_1"
    },
    {
        "source_sentence": "我以是緣，知名色由識，緣識有名色，我所說者，義在於此。",
        "translation": "The meaning of causal dependence that I intend to explain can be found here.",
        "source": "T01n0001_010:0061b13_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b14_3"
    },
    {
        "source_sentence": "緣名色有識，此為何義？",
        "translation": "What does it mean to say that there is consciousness conditioned by name and form?",
        "source": "T01n0001_010:0061b14_4"
    },
    {
        "source_sentence": "若識不住名色，則識無住處；",
        "translation": "If consciousness does not abide in name and form, then consciousness has no dwelling place.",
        "source": "T01n0001_010:0061b15_5"
    },
    {
        "source_sentence": "若無住處，寧有生、老、病、死、憂、悲、苦惱不？」",
        "translation": "If there's no abode, how could birth, old age, illness, death, grief, sorrow, pity, pain, and vexation exist?",
        "source": "T01n0001_010:0061b16_6"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b17_7"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b17_8"
    },
    {
        "source_sentence": "若無名色，寧有識不？」",
        "translation": "If there were no name-and-form, how could there be consciousness?",
        "source": "T01n0001_010:0061b17_9"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T01n0001_010:0061b18_0"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b18_1"
    },
    {
        "source_sentence": "我以此緣，知識由名色，緣名色有識，我所說者，義在於此。",
        "translation": "The meaning of causal dependence that I intend to explain can be found here. Consciousness has name and form for its object, and names and forms have consciousness for their object.",
        "source": "T01n0001_010:0061b18_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b19_3"
    },
    {
        "source_sentence": "是故名色緣識，識緣名色，名色緣六入，六入緣觸，觸緣受，受緣愛，",
        "translation": "That is why name-and-form takes consciousness as supporting object. Consciousness takes name-and-form as supporting object. Name-and-form takes the six sense-fields as supporting object. The six sense-fields take contact as supporting object.",
        "source": "T01n0001_010:0061b19_4"
    },
    {
        "source_sentence": "愛緣取，取緣有，有緣生，生緣老、死、憂、悲、苦、惱，大苦陰集。",
        "translation": "Conditioned by thirst, there is grasping; conditioned by grasping, there is existence; conditioned by birth, old age, death, sorrow, lamentation, pity, pain and vexation arise. The great mass of the aggregate of suffering arises.",
        "source": "T01n0001_010:0061b21_5"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b22_6"
    },
    {
        "source_sentence": "齊是為語，齊是為應，齊是為限，齊此為演說，齊是為智觀，齊是為眾生。",
        "translation": "What's limited is what's explained, what's contemplated with wisdom, and what's sentient beings.",
        "source": "T01n0001_010:0061b23_0"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b24_1"
    },
    {
        "source_sentence": "諸比丘於此法中，如實正觀，無漏心解脫。",
        "translation": "Monks, regarding this doctrine, they truly and correctly contemplate the uncontaminated mind as liberation.",
        "source": "T01n0001_010:0061b24_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b25_3"
    },
    {
        "source_sentence": "此比丘當名為慧解脫，如是解脫比丘如來終亦知，如來不終亦知，如來終不終亦知，",
        "translation": "This monk should be called liberation through wisdom. Monks who are liberated in this way, the Tathāgata also knows at the end of their lives; the Tathāgata knows without end and the Tathāgata also knows at the end of his life.",
        "source": "T01n0001_010:0061b25_4"
    },
    {
        "source_sentence": "如來非終非不終亦知，何以故？",
        "translation": "The Tathāgata neither has an end nor no end, and he also knows it, so why is that?",
        "source": "T01n0001_010:0061b27_5"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061b28_6"
    },
    {
        "source_sentence": "齊是為語，齊是為應，齊是為限，齊是為演說，齊是為智觀，齊是為眾生；",
        "translation": "Exactly the same is speech; Exactly the same is response; Exactly the same is limitation; Exactly the same is explanation; Exactly the same is wisdom and contemplation; Exactly the same is sentient being.",
        "source": "T01n0001_010:0061b28_7"
    },
    {
        "source_sentence": "如是盡知已，無漏心解脫比丘不知不見如是知見。",
        "translation": "Having thus fully known it, the monk with an uncontaminated mind liberated doesn't know or see such knowing and seeing.",
        "source": "T01n0001_010:0061c01_8"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c02_9"
    },
    {
        "source_sentence": "夫計我者，齊幾名我見，名色與受，俱計以為我。",
        "translation": "The perception of self refers to the perception of how many names are given to a view of self, and name-and-form and sensation are both perceived as self.",
        "source": "T01n0001_010:0061c02_10"
    },
    {
        "source_sentence": "有人言：『受非我，我是受。』",
        "translation": "Some people say, 'Sensation is not self; it's sensation.'",
        "source": "T01n0001_010:0061c04_0"
    },
    {
        "source_sentence": "或有言：『受非我，我非受，受法是我。』",
        "translation": "Some people say, 'Feeling is not self, self is not feeling, and feeling dharmas are self.'",
        "source": "T01n0001_010:0061c04_1"
    },
    {
        "source_sentence": "或有言：『受非我，我非受，受法非我，但愛是我。』",
        "translation": "Some people say, 'Sensation is not self, self is not sensation, sensation and dharmas are not self, but craving is self.'",
        "source": "T01n0001_010:0061c05_2"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c06_3"
    },
    {
        "source_sentence": "彼見我者，言受是我，當語彼言：『如來說三受，樂受、苦受、不苦不樂受。",
        "translation": "If someone sees me and says that sensation is the self, they should say to them, 'The Tathāgata teaches three sensations: pleasant sensation, painful sensation, and neither-unpleasant-nor-unpleasant sensation.",
        "source": "T01n0001_010:0061c06_4"
    },
    {
        "source_sentence": "當有樂受時，無有苦受、不苦不樂受；",
        "translation": "When there is pleasant feeling, there is neither painful feeling nor neither-unpleasant-nor-unpleasant feeling.",
        "source": "T01n0001_010:0061c08_5"
    },
    {
        "source_sentence": "有苦受時，無有樂受、不苦不樂受；",
        "translation": "When there is painful feeling, there is neither pleasant feeling nor neither-unpleasant-nor-unpleasant feeling.",
        "source": "T01n0001_010:0061c09_6"
    },
    {
        "source_sentence": "有不苦不樂受時，無有苦受、樂受。』",
        "translation": "When there's neither painful nor pleasant feeling, there's no painful feeling or pleasant feeling.'",
        "source": "T01n0001_010:0061c09_7"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T01n0001_010:0061c10_8"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c11_0"
    },
    {
        "source_sentence": "樂觸緣生樂受，若樂觸滅受亦滅。",
        "translation": "Feelings of pleasure and feelings of satisfaction arise by reason of contact. The feeling of the cessation of pleasant contact also ceases when it is accompanied by sensation.",
        "source": "T01n0001_010:0061c11_1"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c11_2"
    },
    {
        "source_sentence": "苦觸緣生苦受，若苦觸滅受亦滅；",
        "translation": "Conditioned by contact with unsatisfactoriness, feeling of unsatisfactoriness arises. When the contact with unsatisfactoriness is extinguished, also feeling of cessation ceases.",
        "source": "T01n0001_010:0061c12_3"
    },
    {
        "source_sentence": "不苦不樂觸緣生不苦不樂受，若不苦不樂觸滅受亦滅。",
        "translation": "When neither-unpleasant-nor-unpleasant contact is conditioned by contact, feelings that are neither-unpleasant-nor-unpleasant arise; when neither-unpleasant-nor-unpleasant contact ceases, feelings also cease.",
        "source": "T01n0001_010:0061c12_4"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c14_5"
    },
    {
        "source_sentence": "如兩木相攢則有火生，各置異處則無有火。",
        "translation": "It's like when two trees are clustered together, fire arises, and when each is placed in a different place, there's no fire.",
        "source": "T01n0001_010:0061c14_6"
    },
    {
        "source_sentence": "此亦如是，因樂觸緣故生樂受，若樂觸滅受亦俱滅；",
        "translation": "The same applies in this way: it is because of the contact with satisfaction that feelings of satisfaction arise. If, by means of contact with satisfaction, feelings cease, and so on, both these feelings also cease.",
        "source": "T01n0001_010:0061c15_7"
    },
    {
        "source_sentence": "因苦觸緣故生苦受，若苦觸滅受亦俱滅；",
        "translation": "Feelings of frustration arise because of the supporting objects of contact with frustration. The feeling that is extinguished by contact with frustration also perishes at the same time.",
        "source": "T01n0001_010:0061c16_8"
    },
    {
        "source_sentence": "因不苦不樂觸緣生不苦不樂受，若不苦不樂觸滅受亦俱滅。",
        "translation": "The feeling of neither-unpleasant-nor-unpleasant contact arises because of the contact with a condition that is neither-unpleasant-nor-unpleasant. If neither-unpleasant-nor-unpleasant contact ceases, both sensation and cessation also cease.",
        "source": "T01n0001_010:0061c17_9"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c19_10"
    },
    {
        "source_sentence": "此三受有為無常，從因緣生，盡法、滅法，為朽壞法。",
        "translation": "These three feelings are conditioned impermanent and arise from causes and conditions. The dharma that perishes and the dharma that ceases are decaying dharmas.",
        "source": "T01n0001_010:0061c19_11"
    },
    {
        "source_sentence": "彼非我有，我非彼有，當以正智如實觀之。",
        "translation": "They aren't possessed by me, and I'm not possessed by them; they should be observed as they really are with right knowledge.",
        "source": "T01n0001_010:0061c20_12"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c21_13"
    },
    {
        "source_sentence": "彼見我者，以受為我，彼則為非。",
        "translation": "Someone who sees self because sensation is the self, but they think it's not.",
        "source": "T01n0001_010:0061c21_14"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c22_15"
    },
    {
        "source_sentence": "彼見我者，言受非我，我是受者，當語彼言：『如來說三受，苦受、樂受、不苦不樂受。",
        "translation": "If someone sees a self and says that sensation is not self, but the self is sensation, they should say to them, 'The Tathāgata explains three sensations: painful sensation, pleasant sensation, and neither painful nor pleasant sensation.",
        "source": "T01n0001_010:0061c22_16"
    },
    {
        "source_sentence": "若樂受是我者，樂受滅時，則有二我，此則為過。",
        "translation": "If satisfaction is the self, then at the moment of the cessation of satisfaction, there would be two selves. This is a mistake.",
        "source": "T01n0001_010:0061c24_17"
    },
    {
        "source_sentence": "若苦受是我者，苦受滅時，則有二我，此則為過。",
        "translation": "If painful feeling is the self, then at the moment of the extinction of painful feeling there would be two selves. This is a mistake.",
        "source": "T01n0001_010:0061c25_18"
    },
    {
        "source_sentence": "若不苦不樂受是我者，不苦不樂受滅時，則有二我，此則為過。』",
        "translation": "If the sensation of neither pain nor pleasure is self, then when the sensation of neither pain nor pleasure ceases, there are two kinds of self, and this is a mistake.'",
        "source": "T01n0001_010:0061c26_19"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c28_20"
    },
    {
        "source_sentence": "彼見我者，言：『受非我，我是受。』",
        "translation": "Those who see self and say, 'Feeling is not self; it's feeling.'",
        "source": "T01n0001_010:0061c28_21"
    },
    {
        "source_sentence": "彼則為非。",
        "translation": "What's wrong with that?",
        "source": "T01n0001_010:0061c28_22"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0061c29_23"
    },
    {
        "source_sentence": "彼計我者，作此說：『受非我，我非受，受法是我。』",
        "translation": "Those who conceptualize self say, 'Feeling is not self, self is not feeling, and feeling dharmas are self.'",
        "source": "T01n0001_010:0061c29_24"
    },
    {
        "source_sentence": "當語彼言：『一切無受。",
        "translation": "You should say to them, 'Nothing is received.'",
        "source": "T01n0001_010:0062a01_25"
    },
    {
        "source_sentence": "汝云何言有受法？",
        "translation": "How do you say there are received dharmas?",
        "source": "T01n0001_010:0062a01_26"
    },
    {
        "source_sentence": "汝是受法耶？』",
        "translation": "Are you a recipient of the teaching?'",
        "source": "T01n0001_010:0062a02_27"
    },
    {
        "source_sentence": "對曰：『非是。』",
        "translation": "He replied, 'It's not right.'",
        "source": "T01n0001_010:0062a02_28"
    },
    {
        "source_sentence": "是故，阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T01n0001_010:0062a02_29"
    },
    {
        "source_sentence": "彼計我者，言：『受非我，我非受，受法是我。』",
        "translation": "Those who conceptualize self say, 'Feeling is not self, self is not feeling, and feeling dharmas are self.'",
        "source": "T01n0001_010:0062a03_30"
    },
    {
        "source_sentence": "彼則為非。",
        "translation": "What's wrong with that?",
        "source": "T01n0001_010:0062a04_0"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062a04_1"
    },
    {
        "source_sentence": "彼計我者，作是言：『受非我，我非受，受法非我，但愛是我。』",
        "translation": "Those who conceptualize self say, 'Sensation is not self, self is not sensation, sensation and dharmas are not self, but craving is self.'",
        "source": "T01n0001_010:0062a04_2"
    },
    {
        "source_sentence": "者，當語彼言：『一切無受，云何有愛？",
        "translation": "They should say, 'All things lack sensation, so how could there be craving?'",
        "source": "T01n0001_010:0062a05_3"
    },
    {
        "source_sentence": "汝是愛耶？』",
        "translation": "Are you craving?'",
        "source": "T01n0001_010:0062a06_4"
    },
    {
        "source_sentence": "對曰：『非也。』",
        "translation": "He replied, 'It's not.'",
        "source": "T01n0001_010:0062a06_5"
    },
    {
        "source_sentence": "是故，阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T01n0001_010:0062a07_6"
    },
    {
        "source_sentence": "彼計我者，言：『受非我，我非受，受法非我，愛是我。』",
        "translation": "Those who conceptualize self say, 'Feeling is not self, self is not feeling, feeling qualities are not self, and craving is self.'",
        "source": "T01n0001_010:0062a07_7"
    },
    {
        "source_sentence": "者，彼則為非。",
        "translation": "This is what's wrong with that.",
        "source": "T01n0001_010:0062a08_8"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062a08_9"
    },
    {
        "source_sentence": "齊是為語，齊是為應，齊是為限，齊是為演說，齊是為智觀，齊是為眾生。",
        "translation": "Whatever is the same is speech, whatever is the same is response, whatever is the same is limitation, whatever is the same is explanation, whatever is the same is contemplation of wisdom, whatever is sentient being.",
        "source": "T01n0001_010:0062a08_10"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062a10_11"
    },
    {
        "source_sentence": "諸比丘於此法中如實正觀，於無漏心解脫。",
        "translation": "Monks, in this teaching, they truly and correctly observe that the uncontaminated mind is liberated.",
        "source": "T01n0001_010:0062a10_12"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062a11_13"
    },
    {
        "source_sentence": "此比丘當名為慧解脫，如是解脫心比丘，有我亦知，無我亦知，有我無我亦知，",
        "translation": "This monk should be called liberated by wisdom. Monks whose minds are liberated like this, who know both self and non-self as well as self and know both self and non-self as well as self and non-self [as well].",
        "source": "T01n0001_010:0062a11_14"
    },
    {
        "source_sentence": "非有我非無我亦知。",
        "translation": "What's not self and what's not self also knows it.",
        "source": "T01n0001_010:0062a13_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0001_010:0062a14_16"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062a14_17"
    },
    {
        "source_sentence": "齊是為語，齊是為應，齊是為限，齊是為演說，齊是為智觀，齊是為眾生；",
        "translation": "Exactly the same is speech; Exactly the same is response; Exactly the same is limitation; Exactly the same is explanation; Exactly the same is wisdom and contemplation; Exactly the same is sentient being.",
        "source": "T01n0001_010:0062a14_18"
    },
    {
        "source_sentence": "如是盡知已，無漏心解脫比丘不知不見如是知見。」",
        "translation": "After knowing it completely in this way, the monk with an uncontaminated mind liberated doesn't know or don't see such knowing and seeing.",
        "source": "T01n0001_010:0062a16_19"
    },
    {
        "source_sentence": "佛語阿難：「彼計我者，齊已為定，彼計我者，或言少色是我，或言多色是我，",
        "translation": "The Buddha said to Ānanda: Some of those who speculate about the existence of a self (i.e., “I am this self with few forms” or “I am many forms” etc.) think that all things are [already] in samdhi.",
        "source": "T01n0001_010:0062a17_20"
    },
    {
        "source_sentence": "或言少無色是我，或言多無色是我。",
        "translation": "Some say a little formlessness is the self, and some say a lot of formlessness is the self.",
        "source": "T01n0001_010:0062a19_21"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062a20_0"
    },
    {
        "source_sentence": "彼言少色是我者，定少色是我，我所見是，餘者為非。",
        "translation": "When someone says that a small amount of matter is the self, they must mean that a small amount of form is the self. This view of self is right; the rest is wrong.",
        "source": "T01n0001_010:0062a20_1"
    },
    {
        "source_sentence": "多色是我者，定多色是我，我所見是，餘者為非。",
        "translation": "“Many material forms are the self”: In samdhi, manifold matter is the self. This view of self is what belongs to me. Any other view is false.",
        "source": "T01n0001_010:0062a21_2"
    },
    {
        "source_sentence": "少無色是我者，定言少無色是我，我所見是，餘者為非。",
        "translation": "Someone who says that a small immaterial self is the self means to say with certainty that a small immaterial self is the self. This view of self is right, but the rest is wrong.",
        "source": "T01n0001_010:0062a22_3"
    },
    {
        "source_sentence": "多無色是我者，定多無色是我，我所見是，餘者為非。」",
        "translation": "A lot of formlessness is the self, a lot of formlessness is the self, and what I see is the self; the rest are not.",
        "source": "T01n0001_010:0062a23_4"
    },
    {
        "source_sentence": "佛告阿難：「七識住，二入處，諸有沙門、婆羅門言：『此處安隱，為救、為護、為舍、為燈、為明、為歸，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert, “This is the place where the seven consciousnesses abide. It is the place where the two sense-fields are located.” The Buddha said to Ānanda:",
        "source": "T01n0001_010:0062a25_0"
    },
    {
        "source_sentence": "為不虛妄，為不煩惱。』",
        "translation": "It's because they aren't false and don't afflict themselves.'",
        "source": "T01n0001_010:0062a27_1"
    },
    {
        "source_sentence": "云何為七？",
        "translation": "What are the seven?",
        "source": "T01n0001_010:0062a27_2"
    },
    {
        "source_sentence": "或有眾生，若干種身若干種想，天及人，此是初識住處。",
        "translation": "Or some sentient beings have certain kinds of bodies and certain kinds of perceptions, gods and humans. This is the first abode of consciousness.",
        "source": "T01n0001_010:0062a27_3"
    },
    {
        "source_sentence": "諸沙門、婆羅門言：『此處安隱，為救、為護、為舍、為燈、為明、為歸，",
        "translation": "The śramaṇas and brāhmaṇas asserted, “This place should be used for peaceful rescue, protection, shelter, light, illumination, and refuge.",
        "source": "T01n0001_010:0062a29_4"
    },
    {
        "source_sentence": "為不虛妄，為不煩惱。』",
        "translation": "It's because they aren't false and don't afflict themselves.'",
        "source": "T01n0001_010:0062b01_5"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062b02_6"
    },
    {
        "source_sentence": "若比丘知初識住，知集、知滅、知味、知過、知出要，如實知者。",
        "translation": "Suppose a monk knows the first abode of consciousness, knows its arising, knows its cessation, knows its taste, knows its faults, and knows the essentials for its escape as they really are.",
        "source": "T01n0001_010:0062b02_7"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062b03_8"
    },
    {
        "source_sentence": "彼比丘言：『彼非我，我非彼，如實知見。』",
        "translation": "That monk said, 'That's not self, and I'm not that; truly know and see.'",
        "source": "T01n0001_010:0062b03_9"
    },
    {
        "source_sentence": "或有眾生，若干種身而一想，梵光音天是；",
        "translation": "When some sentient beings have different bodies but one and the same ideation, this is Brahmaguptadeva.",
        "source": "T01n0001_010:0062b04_10"
    },
    {
        "source_sentence": "或有眾生，一身若干種想，光音天是；",
        "translation": "“Some sentient beings possess one and the same body but different ideations: this is Ābhāsvara Heaven.",
        "source": "T01n0001_010:0062b05_11"
    },
    {
        "source_sentence": "或有眾生一身一想，遍淨天是；",
        "translation": "When some sentient beings possess one body and one ideation, this is the pervasively pure heaven.",
        "source": "T01n0001_010:0062b06_12"
    },
    {
        "source_sentence": "或有眾生，住空處；",
        "translation": "Some sentient beings live in the sphere of infinite space.",
        "source": "T01n0001_010:0062b07_13"
    },
    {
        "source_sentence": "或有眾生，住識處；",
        "translation": "Some sentient beings reside in the sphere of infinite consciousness.",
        "source": "T01n0001_010:0062b07_14"
    },
    {
        "source_sentence": "或有眾生，住不用處，是為七識住處。",
        "translation": "These are the seven abodes of consciousness when some sentient beings live in a place where they don't use it.",
        "source": "T01n0001_010:0062b08_15"
    },
    {
        "source_sentence": "或有沙門、婆羅門言：『此處安隱，為救、為護、為舍、為燈、為明、為歸，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert, “This is a peaceful place for rescue, protection, shelter, lamp, light, or refuge.",
        "source": "T01n0001_010:0062b08_16"
    },
    {
        "source_sentence": "為不虛妄，為不煩惱。』",
        "translation": "It's because they aren't false and don't afflict themselves.'",
        "source": "T01n0001_010:0062b10_17"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062b10_18"
    },
    {
        "source_sentence": "若比丘知七識住，知集、知滅、知味、知過、知出要，如實知見，彼比丘言：『彼非我，",
        "translation": "If a monk knows the seven abodes of consciousness, knows their origin, knows their cessation, knows their taste, knows their faults, and knows the essential way to escape, and truly knows and sees them, that monk says, 'They are not self.",
        "source": "T01n0001_010:0062b11_19"
    },
    {
        "source_sentence": "我非彼，如實知見。』",
        "translation": "I'm not that; I truly know and see them.'",
        "source": "T01n0001_010:0062b12_20"
    },
    {
        "source_sentence": "是為七識住。",
        "translation": "These are the seven abodes of consciousness.",
        "source": "T01n0001_010:0062b13_21"
    },
    {
        "source_sentence": "「云何二入處？",
        "translation": "(9) What is the double item to be understood as sense base?",
        "source": "T01n0001_010:0062b13_22"
    },
    {
        "source_sentence": "無想入、非想非無想入。",
        "translation": "The sense-entry without perception and the sense-entry that's neither perception nor non-perception.",
        "source": "T01n0001_010:0062b14_23"
    },
    {
        "source_sentence": "是為，阿難！",
        "translation": "This, Ānanda!",
        "source": "T01n0001_010:0062b14_24"
    },
    {
        "source_sentence": "此二入處，或有沙門、婆羅門言：『此處安隱，為救、為護、為舍、為燈、為明、為歸，",
        "translation": "Again, some śramaṇas and brāhmaṇas assert that these two kinds of sense-fields are the rescue, protection, shelter, lamp, light, and refuge [for sentient beings].",
        "source": "T01n0001_010:0062b14_25"
    },
    {
        "source_sentence": "為不虛妄，為不煩惱。』",
        "translation": "It's because they aren't false and don't afflict themselves.'",
        "source": "T01n0001_010:0062b16_26"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062b17_27"
    },
    {
        "source_sentence": "若比丘知二入處，知集、知滅、知味、知過、知出要，如實知見，彼比丘言：『彼非我，",
        "translation": "If a monk knows the two sense-fields, knows accumulation, knows cessation, knows taste, knows faults, and knows the essentials for escape, and truly knows and sees them, that monk says, 'That is not self.",
        "source": "T01n0001_010:0062b17_28"
    },
    {
        "source_sentence": "我非彼，如實知見。』",
        "translation": "I'm not that; I truly know and see them.'",
        "source": "T01n0001_010:0062b19_29"
    },
    {
        "source_sentence": "是為二入。",
        "translation": "These are the two sense-fields.",
        "source": "T01n0001_010:0062b19_30"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062b19_31"
    },
    {
        "source_sentence": "復有八解脫。",
        "translation": "Again, there are the eight liberations.",
        "source": "T01n0001_010:0062b19_32"
    },
    {
        "source_sentence": "云何八？",
        "translation": "What are the eight?",
        "source": "T01n0001_010:0062b20_33"
    },
    {
        "source_sentence": "色觀色，初解脫。",
        "translation": "Form observes form, which is the first liberation.",
        "source": "T01n0001_010:0062b20_34"
    },
    {
        "source_sentence": "內無色想，觀外色，二解脫。",
        "translation": "The two internal formless conceptions and the contemplation of external form are the two liberations.",
        "source": "T01n0001_010:0062b20_35"
    },
    {
        "source_sentence": "淨解脫，三解脫。",
        "translation": "Pure liberation: three forms of liberation.",
        "source": "T01n0001_010:0062b21_36"
    },
    {
        "source_sentence": "度色想，滅有對想，不念雜想，住空處，四解脫。",
        "translation": "He liberates himself from ideation of form and cessation of ideation that has opposite thoughts, doesn't think of mixed thoughts, and abides in the place of emptiness, which are the four liberations.",
        "source": "T01n0001_010:0062b21_37"
    },
    {
        "source_sentence": "度空處，住識處，五解脫。",
        "translation": "He's liberated from the abode of emptiness and abides in the abode of consciousness, which are the five liberations.",
        "source": "T01n0001_010:0062b22_38"
    },
    {
        "source_sentence": "度識處，住不用處，六解脫。",
        "translation": "Delivered from the sphere of unlimited consciousness, abiding in the sphere of nothingness or nonutility: six forms of liberation.",
        "source": "T01n0001_010:0062b23_39"
    },
    {
        "source_sentence": "度不用處，住有想無想處，七解脫。",
        "translation": "He liberates himself from the sphere of nothingness and abides in the sphere of neither thought nor nonthought, which is the seventh liberation.",
        "source": "T01n0001_010:0062b24_40"
    },
    {
        "source_sentence": "滅盡定，八解脫。",
        "translation": "The absorption of cessation is with eight forms of liberation:",
        "source": "T01n0001_010:0062b24_41"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0001_010:0062b25_42"
    },
    {
        "source_sentence": "諸比丘於此八解脫，逆順遊行，入出自在，如是比丘得俱解脫。」",
        "translation": "Here, the monks are liberated by these eight liberations, going along with each other and entering and leaving freely, and such a monk attains both liberation.",
        "source": "T01n0001_010:0062b25_43"
    },
    {
        "source_sentence": "爾時，阿難聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, Ānanda was delighted and remembered it well.",
        "source": "T01n0001_010:0062b26_44"
    },
    {
        "source_sentence": "（一四）佛說長阿含第二分釋提桓因問經第十",
        "translation": "14. The Tenth Part of the Sutra on the Questions of Śakra Devānām-Indra",
        "source": "T01n0001_010:0062b28_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛在摩竭國菴婆羅村北，毘陀山因陀娑羅窟中。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Indrasara Cave on Mount Videha, north of the village of Kambara in the country of Magadha.",
        "source": "T01n0001_010:0062b29_0"
    },
    {
        "source_sentence": "爾時，釋提桓因發微妙善心，欲來見佛：「今我當往至世尊所。」",
        "translation": "It was then that Śakra Devānām-Indra aroused subtle good intentions and wanted to come to see the Buddha, Now, I'll go to the Bhagavān.",
        "source": "T01n0001_010:0062c01_1"
    },
    {
        "source_sentence": "時，諸忉利天聞釋提桓因發妙善心，欲詣佛所，即尋詣帝釋，白言：「善哉！",
        "translation": "When the Trāyastriṃśa gods heard that Śakra Devānām-Indra had aroused a wonderful mind of goodness, they wanted to go to the Buddha, so they went to Indra and said, Good!",
        "source": "T01n0001_010:0062c03_2"
    },
    {
        "source_sentence": "帝釋！",
        "translation": "Indra!",
        "source": "T01n0001_010:0062c04_3"
    },
    {
        "source_sentence": "發妙善心，欲詣如來，我等亦樂侍從詣世尊所。」",
        "translation": "Aroused with subtle good intentions, we want to visit the Tathāgata, and we're also happy to accompany him to the Bhagavān.",
        "source": "T01n0001_010:0062c05_4"
    },
    {
        "source_sentence": "時，釋提桓因即告執樂神般遮翼曰：「我今欲詣世尊所，汝可俱行，此忉利諸天亦當與我俱詣佛所。」",
        "translation": "Śakra Devānām-Indra then addressed the god Mahāprajāpaṇḍika, Now, I want to go to the Bhagavān, so you can go with me; these Trāyastriṃśa gods will also go with me to the Buddha.",
        "source": "T01n0001_010:0062c06_5"
    },
    {
        "source_sentence": "對曰：「唯然！」",
        "translation": "He replied, Yes!",
        "source": "T01n0001_010:0062c08_6"
    },
    {
        "source_sentence": "時，般遮翼持琉璃琴，於帝釋前忉利天眾中鼓琴供養。",
        "translation": "At the time, Paranirmita-vaśavartin held a lapis lazuli lute and offered it to Indra in front of the Trāyastriṃśa gods.",
        "source": "T01n0001_010:0062c08_7"
    },
    {
        "source_sentence": "時，釋提桓因、忉利諸天及般遮翼，於法堂上忽然不現，譬如力士屈伸臂頃，",
        "translation": "Then Śakra Devānām-Indra, the Trāyastriṃśa gods and Paranirmita-vaśavartin suddenly disappeared from the great hall of the Dharma.",
        "source": "T01n0001_010:0062c10_8"
    },
    {
        "source_sentence": "至摩竭國北毘陀山中。",
        "translation": "He arrived in the mountains of Videha to the north of Magadha.",
        "source": "T01n0001_010:0062c11_9"
    },
    {
        "source_sentence": "爾時，世尊入火焰三昧，彼毘陀山同一火色，時國人見，自相謂言：「此毘陀山同一火色，",
        "translation": "At that time, the World-honored One entered the fire blazing concentration. That mountain of Videha was the color of the same kind of fire.",
        "source": "T01n0001_010:0062c12_10"
    },
    {
        "source_sentence": "將是如來諸天之力。」",
        "translation": "It will be the power of the Tathāgata's gods.",
        "source": "T01n0001_010:0062c14_11"
    },
    {
        "source_sentence": "時，釋提桓因告般遮翼曰：「如來、至真甚難得覩，而能垂降此閑靜處，",
        "translation": "Śakra, lord of the gods, then said to Pañcaśikāputra, “The Tathāgata and the Supreme Truth are so difficult to fathom that they can descend into this secluded place.",
        "source": "T01n0001_010:0062c14_12"
    },
    {
        "source_sentence": "寂默無聲，禽獸為侶，此處常有諸大神天侍衛世尊，汝可於前鼓琉璃琴娛樂世尊，",
        "translation": "World-honored One, there are no animals or beasts to accompany you. The great deities and goddesses who live here always guard the World-honored One. You should play the lute that is preceded by a lapis lazuli lute to entertain him.",
        "source": "T01n0001_010:0062c16_13"
    },
    {
        "source_sentence": "吾與諸天尋於後往。」",
        "translation": "I'll go back with the gods.",
        "source": "T01n0001_010:0062c18_14"
    },
    {
        "source_sentence": "對曰：「唯然！」",
        "translation": "He replied, Yes!",
        "source": "T01n0001_010:0062c18_15"
    },
    {
        "source_sentence": "即受教已，持琉璃琴於先詣佛。",
        "translation": "After he had received the teaching, he took a lapis lazuli lute and went to the Buddha beforehand.",
        "source": "T01n0001_010:0062c19_16"
    },
    {
        "source_sentence": "「跋陀禮汝父，　　汝父甚端嚴；",
        "translation": "Bhadra pays homage to your father, Whose manner is impeccably dignified.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　生汝時吉祥，　　我心甚愛樂。",
        "translation": "When you're born, it's auspicious, and I'm very fond of it in my heart.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　本以小因緣，　　欲心於中生；",
        "translation": "In the first case, it is due to minor causes and conditions That the mind of desire arises there.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　展轉遂增廣，　　如供養羅漢。",
        "translation": "They gradually grow in size, just like offerings to the arhat.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　釋子專四禪，　　常樂於閑居；",
        "translation": "The Buddha’s disciples concentrated on the fourth meditation, Always taking delight in seclusion.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　正意求甘露，　　我專念亦爾。",
        "translation": "Their right intention is to seek the ambrosia of immortality, and so is my concentrated mindfulness.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　能仁發道心，　　必欲成正覺；",
        "translation": "If you can kindly give rise to the aspiration for enlightenment, You will surely attain perfect enlightenment.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　我今求彼女，　　必欲會亦爾。",
        "translation": "Now that I'm seeking a woman, I'll surely want to meet her as well.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　我心生染著，　　愛好不捨離；",
        "translation": "The mind of self becomes defiled and attached, not abandoning its cravings.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　欲捨不能去，　　如象為鈎制。",
        "translation": "They want to abandon and can't go, just like an elephant being restrained by a hook.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　如熱遇涼風，　　如渴得冷泉；",
        "translation": "Like a hot wind encountering a cool breeze, like a thirst getting a cool fountain.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　如取涅槃者，　　如水滅於火。",
        "translation": "He who apprehends nirvāṇa is like water extinguishing a fire.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　如病得良醫，　　飢者得美食；",
        "translation": "It is as if a sick person has found a good doctor, And the hungry man finds delicious food.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　充足生快樂，　　如羅漢遊法。",
        "translation": "Being satisfied and happy, he's like a arhat wandering about the Dharma.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　如象被深鈎，　　而猶不肯伏；",
        "translation": "It’s like an elephant caught in a deep hook, Yet unwilling to be subdued.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　[馬*奔]突難禁制，　　放逸不自止。",
        "translation": "[Ma*puṇṇa]突難禁制, 放逸不自止。",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　猶如清涼池，　　眾花覆水上；",
        "translation": "It’s like a cool pond, Covered with flowers.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　疲熱象沐浴，　　舉身得清涼。",
        "translation": "The worn-out hot elephant bathed, and his body became clear and cool as he lifted it.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　我前後所施，　　供養諸羅漢；",
        "translation": "The offerings I made before and after me served the arhats.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　世有福報者，　　盡當與彼供。",
        "translation": "If there's a reward for goodness in the world, he'll give it to them as an offering.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　汝死當共死，　　汝無我活為？",
        "translation": "When you die, you'll die together, and you won't have self or live.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　寧使我身死，　　不能無汝存。",
        "translation": "I'd rather die myself than you, and you won't survive without me.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　忉利天之主，　　釋今與我願；",
        "translation": "The lord of the Trāyastriṃśa gods Is now granting me my wish.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "　稱汝禮節具，　　汝善思察之。」",
        "translation": "I praise your rituals, and you should well consider them.",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "去佛不遠，鼓琉璃琴，以偈歌曰：爾時，世尊從三昧起，告般遮翼言：「善哉！",
        "translation": "Not far from the Buddha, he played the lapis lazuli lute and sang these verses: At that time the World-honored One rose from his concentration and said to Pañcaśikha, “Splendid!",
        "source": "T01n0001_010:0062c20_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T01n0001_010:0063a16_1"
    },
    {
        "source_sentence": "般遮翼！",
        "translation": "Paranirmita-vaśavartin!",
        "source": "T01n0001_010:0063a17_2"
    },
    {
        "source_sentence": "汝能以清淨音和琉璃琴稱讚如來，琴聲、汝音，不長不短，悲和哀婉，",
        "translation": "You can praise the Tathāgata with a pure voice mixed with a lapis lazuli lute and sing his praises. The sound of your lute and that of your voice are neither long nor short, but they are compassionately harmonious and graceful.",
        "source": "T01n0001_010:0063a17_3"
    },
    {
        "source_sentence": "感動人心。",
        "translation": "It moves people's minds.",
        "source": "T01n0001_010:0063a18_4"
    },
    {
        "source_sentence": "汝琴所奏，眾義備有，亦說欲縛，亦說梵行，亦說沙門，亦說涅槃。」",
        "translation": "What you played on your lute has many meanings, which are explained in terms of desire binding, religious practice, asceticism, and nirvāṇa.",
        "source": "T01n0001_010:0063a19_5"
    },
    {
        "source_sentence": "爾時，般遮翼白佛言：「我念世尊昔鬱鞞羅尼連禪水邊，阿遊波陀尼俱律樹下初成佛道時，",
        "translation": "At that time, Pañcaśikha said to the Buddha: Lord, I remember one day, in the past, when the World-honored One was practicing the path of enlightenment on the shore of the Nairañjāna river at Anāthapiṇḍika’s feet under a tree called Upagupta.",
        "source": "T01n0001_010:0063a20_6"
    },
    {
        "source_sentence": "有尸漢陀天大將子及執樂天王女，共於一處，但設欲樂，我於爾時見其心爾，",
        "translation": "At that time the generals of the Śikhin gods and the heavenly maidens, as well as the celestial kings and palace ladies clinging to pleasure, were together in one place. They merely wished for pleasure. I saw their minds at that time.",
        "source": "T01n0001_010:0063a22_7"
    },
    {
        "source_sentence": "即為作頌，頌說欲縛，亦說梵行，亦說沙門，亦說涅槃。",
        "translation": "He then composed a verse that spoke of the fetters of desire, which also spoke of the religious practice, the ascetics, and the nirvāṇas.",
        "source": "T01n0001_010:0063a24_8"
    },
    {
        "source_sentence": "時，彼天女聞我偈已，舉目而笑語我言：『般遮翼！",
        "translation": "After hearing my verse, that goddess raised her eyes and laughed at me, saying, 'Pāṭikāputra!",
        "source": "T01n0001_010:0063a26_0"
    },
    {
        "source_sentence": "我未見如來，我曾於忉利天法講堂上，聞彼諸天稱讚如來，有如是德，",
        "translation": "World-Honored One, I have never before seen a buddha like this. When I was in the assembly hall of the Trāyastriṃśa gods and heard those gods praise the Tathāgata with such virtues,",
        "source": "T01n0001_010:0063a27_1"
    },
    {
        "source_sentence": "有如是力。",
        "translation": "They have such powers.",
        "source": "T01n0001_010:0063a28_2"
    },
    {
        "source_sentence": "汝常懷信，親近如來，我今意欲與汝共為知識。』",
        "translation": "You always harbor faith and become intimate with the Tathāgata, and now I want to share it with you as a friend.'",
        "source": "T01n0001_010:0063a29_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0063b01_4"
    },
    {
        "source_sentence": "我時與一言之後，不復與語。」",
        "translation": "After I gave it a word, I won't give it again.",
        "source": "T01n0001_010:0063b01_5"
    },
    {
        "source_sentence": "時，釋提桓因作是念：「此般遮翼已娛樂如來訖，我今寧可念於彼人。」",
        "translation": "Śakra Devānām-Indra then had this thought, This is the Tathāgata who's finished entertaining Paranirmita-vaśavartin, so now I should think of that person.",
        "source": "T01n0001_010:0063b02_6"
    },
    {
        "source_sentence": "時，天帝釋即念彼人。",
        "translation": "Śakra, lord of the gods, then thought of that man.",
        "source": "T01n0001_010:0063b03_7"
    },
    {
        "source_sentence": "時，般遮翼復生念言：「今天帝釋乃能念我。」",
        "translation": "At the time, Pañcaśi again had this thought, Today, Indra can think of me.",
        "source": "T01n0001_010:0063b04_8"
    },
    {
        "source_sentence": "即持琉璃琴詣帝釋所。",
        "translation": "He then took a lapis lazuli lute and went to Indra.",
        "source": "T01n0001_010:0063b05_9"
    },
    {
        "source_sentence": "帝釋告曰：「汝以我名并稱忉利天意，問訊世尊：『起居輕利，遊步強耶？』」",
        "translation": "Śakra told him, Give me my name and call it the intention of the Trāyastriṃśa gods to greet the Bhagavān, 'Are you going to live in lightness or are you traveling strongly?'",
        "source": "T01n0001_010:0063b05_10"
    },
    {
        "source_sentence": "時，般遮翼承帝釋教，即詣世尊所，頭面禮足，於一面住，白世尊言：「釋提桓因及忉利諸天故，",
        "translation": "Following the instruction of Śakra, lord of the gods, Pañcaśikha approached the World-honored One. After honoring him by bowing his forehead at his feet, he stood to one side and said to the World-honored One:",
        "source": "T01n0001_010:0063b07_11"
    },
    {
        "source_sentence": "遣我來問訊世尊：『起居輕利，遊步強耶？』」",
        "translation": "Did you send me to the Bhagavān to inquire, 'Is it easy to get up and stay, or is it hard to walk?'",
        "source": "T01n0001_010:0063b09_12"
    },
    {
        "source_sentence": "世尊報曰：「使汝帝釋及忉利天壽命延長，快樂無患。",
        "translation": "The World-honored One said in reply, “May your emperors and the Trāyastriṃśa gods extend their life spans. They will be happy and free from trouble.",
        "source": "T01n0001_010:0063b10_13"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T01n0001_010:0063b11_14"
    },
    {
        "source_sentence": "諸天、世人及阿須輪諸眾生等，皆貪壽命、安樂、無患。」",
        "translation": "The gods, worldlings, humans, asuras, sentient beings, and so forth all crave life, well-being, and freedom from suffering.",
        "source": "T01n0001_010:0063b11_15"
    },
    {
        "source_sentence": "爾時，帝釋復自念言：「我等宜往禮覲世尊。」",
        "translation": "At that point, Tīrṣa again thought to himself, Let's go and pay homage to the Bhagavān.",
        "source": "T01n0001_010:0063b12_16"
    },
    {
        "source_sentence": "即與忉利諸天往詣佛所，頭面禮足，却住一面。",
        "translation": "They went to the Buddha together with the Trāyastriṃśa gods, bowed their foreheads at his feet, and withdrew to one side.",
        "source": "T01n0001_010:0063b13_17"
    },
    {
        "source_sentence": "時，帝釋白佛言：「不審我今去世尊遠近可坐？」",
        "translation": "Śakra then said to the Buddha, Don't you know that I'm now deceased, Venerable One, and can I sit nearby?",
        "source": "T01n0001_010:0063b15_18"
    },
    {
        "source_sentence": "佛告帝釋曰：「汝天眾多，但近我坐。」",
        "translation": "The Buddha told Śakra, All of you gods, please come near me to sit down.",
        "source": "T01n0001_010:0063b16_19"
    },
    {
        "source_sentence": "時，世尊所止因陀羅窟，自然廣博，無所障碍。",
        "translation": "The Cave of Indra, where the World-honored One sojourned, was naturally wide and unobstructed.",
        "source": "T01n0001_010:0063b16_20"
    },
    {
        "source_sentence": "爾時，帝釋與忉利諸天及般遮翼皆禮佛足，於一面坐，帝釋白佛言：「一時，",
        "translation": "At that time, Indra, together with the gods of Trāyastriṃśa Heaven and Paranirmita-vaśavartin, bowed at the Buddha’s feet and sat to one side. Indra said to him:",
        "source": "T01n0001_010:0063b18_0"
    },
    {
        "source_sentence": "佛在舍衛國婆羅門舍，爾時世尊入火焰三昧，我時以少因緣，乘千輻寶車，",
        "translation": "When the Buddha was staying at the brahman’s house in Sāvatthī, the World-honored One entered the fire blazing concentration.",
        "source": "T01n0001_010:0063b19_1"
    },
    {
        "source_sentence": "詣毘樓勒天王所，於空中過，見一天女叉手在世尊前立，我尋語彼女言：『若世尊三昧起者，",
        "translation": "When I arrived at the place where Virūḍhaka was staying, he saw a celestial maiden in the sky above me standing before the World-honored One with palms joined together.",
        "source": "T01n0001_010:0063b21_2"
    },
    {
        "source_sentence": "汝當稱我名字，問訊世尊：起居輕利，遊步強耶？』",
        "translation": "Will you call me by my name and greet the Bhagavān, saying, 'Is it easy to get up and stay, or is it hard to walk?'",
        "source": "T01n0001_010:0063b23_3"
    },
    {
        "source_sentence": "不審彼女後竟為我達此心不？",
        "translation": "I wonder if the woman will finally understand this mind for me later?",
        "source": "T01n0001_010:0063b24_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0063b25_5"
    },
    {
        "source_sentence": "寧能憶此事不？」",
        "translation": "How could you remember this?",
        "source": "T01n0001_010:0063b25_6"
    },
    {
        "source_sentence": "佛言：「憶耳！",
        "translation": "The Buddha said, Remember!",
        "source": "T01n0001_010:0063b26_7"
    },
    {
        "source_sentence": "彼女尋以汝聲致問於我，吾從定起，猶聞汝車聲。」",
        "translation": "When the woman asked me about your voice, I rose from my meditation and heard the sound of your chariot.",
        "source": "T01n0001_010:0063b26_8"
    },
    {
        "source_sentence": "帝釋白佛言：「昔者，我以少緣，與忉利諸天集在法堂，彼諸舊天皆作是言：『若如來出世，",
        "translation": "Śakra, lord of the gods, said to the Buddha: Once long ago, for some reason, I assembled with the Trāyastriṃśa gods in the great assembly hall together with the Trāyastriṃśa gods.",
        "source": "T01n0001_010:0063b27_9"
    },
    {
        "source_sentence": "增益諸天眾，減損阿須輪眾。』",
        "translation": "It increases the number of gods and decreases the number of asuras.'",
        "source": "T01n0001_010:0063b29_10"
    },
    {
        "source_sentence": "今我躬見世尊，躬見自知，躬自作證，如來、至真出現於世，增益諸天眾，",
        "translation": "I now see the World-honored One for myself, know him for myself, and realize for myself that the Tathāgata and Arhat have appeared in the world to increase the number of gods.",
        "source": "T01n0001_010:0063c01_11"
    },
    {
        "source_sentence": "減損阿須輪眾。",
        "translation": "It's a disadvantage to the asuras.",
        "source": "T01n0001_010:0063c02_12"
    },
    {
        "source_sentence": "此有瞿夷釋女，於世尊所淨修梵行，身壞命終，生忉利天宮，即為我子。",
        "translation": "This goddess Gopīyā, who was engaged in the practice of pure and genuine austerity undertaken by the World-honored One, when her body dissolved after death she was reborn as my child in the palace of Trāyastriṃśa Heaven.",
        "source": "T01n0001_010:0063c03_13"
    },
    {
        "source_sentence": "忉利諸天皆稱言：『瞿夷大天子有大功德，有大威力。』",
        "translation": "The Trāyastriṃśa gods all praised him, saying, 'The great celestial prince Gopī has great merit and great authority.'",
        "source": "T01n0001_010:0063c05_0"
    },
    {
        "source_sentence": "復有餘三比丘，於世尊所淨修梵行，身壞命終，生於卑下執樂神中，常日日來為我給使，",
        "translation": "Again, there were three other monks who had practiced pure and genuine austerity under the World-honored One. When their bodies dissolved and their lives ended, they were reborn among the gods of the lowest social classes in the realm of attachment to pleasure. They came day after day to attend me as messengers.",
        "source": "T01n0001_010:0063c06_1"
    },
    {
        "source_sentence": "「『汝為佛弟子，　　我本在家時，",
        "translation": "'You're a disciple of the Buddha. When I was at home,",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　以衣食供養，　　禮拜致恭恪。",
        "translation": "They offer food and clothing as offerings, venerate them, and pay homage to their respects.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　汝等名何人？　　躬受佛教誡；",
        "translation": "What kind of people are you?",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　淨眼之所說，　　汝不觀察之。",
        "translation": "What's explained by the pure eye, you don't observe it.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　我本禮敬汝，　　從佛聞上法；",
        "translation": "Formerly I honored you and listened to the supreme teaching from the Buddha.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　生三十三天，　　為帝釋作子。",
        "translation": "He'll be born in the Trāyastriṃśa gods and become Indra's son.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　汝等何不觀？　　我所有功德；",
        "translation": "Why don’t you contemplate the virtues of self?",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　本為女人身，　　今為帝釋子。",
        "translation": "Originally he was a woman, but now he's the prince of Indra.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　汝等本俱共，　　同修於梵行；",
        "translation": "You are all originally the same, Cultivating religious practice together.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　今獨處卑賤，　　為吾等給使。",
        "translation": "Now, I'm the only one who lives in a humble place and gives us an envoy.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　本為弊惡行，　　今故受此報；",
        "translation": "Formerly they did evil deeds, but now they receive this retribution.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　獨處於卑賤，　　為吾等給使。",
        "translation": "Being alone in the lowest place, I'll give them to you as our messenger.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　生此處不淨，　　為他所觸嬈；",
        "translation": "To be born in this place is impure, Being disturbed by others.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　聞已當患厭，　　此處可厭患。",
        "translation": "Having heard it, they'll become disillusioned with this place where they can be disillusioned.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　從今當精勤，　　勿復為人使；",
        "translation": "From now on, you should exert yourself energetically And never again become a messenger for others.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　二人勤精進，　　思惟如來法。",
        "translation": "They both diligently applied themselves To contemplate the teaching of the enlightened.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　捨彼所戀著，　　觀欲不淨行；",
        "translation": "Rejecting their attachment, they contemplate desire and impure actions.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　欲縛不真實，　　誑惑於世間。",
        "translation": "The bond of desire is unreal, and the world is tormented by anger.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　如象離羈靽，　　超越忉利天；",
        "translation": "Like an elephant that leaves a herd, It transcends the Trāyastriṃśa gods.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　釋及忉利天，　　集法講堂上。",
        "translation": "The Śākyamuni and the Trāyastriṃśa gods assembled in the Dharma assembly hall.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　彼已勇猛力，　　超越忉利天；",
        "translation": "Having surpassed the gods of Trāyastriṃśa gods by their courage and strength, they entered the realm of Brahmā.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　釋歎未曾有，　　諸天亦見過。",
        "translation": "Śākyamuni praised this unprecedented thing, and the gods also saw it.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　此是釋迦子，　　超越忉利天；",
        "translation": "This is the heir of the Buddha Who has transcended the Trāyastriṃśa gods.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　患厭於欲縛，　　瞿夷說此言。",
        "translation": "Being sick and disillusioned with the bond of desire, Gopī said these words.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　摩竭國有佛，　　名曰釋迦文；",
        "translation": "In the kingdom of Magadha there is a buddha named Śākyamuni.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　彼子大失意，　　其後還得念。",
        "translation": "That boy's greatly distressed, and after that he regained mindfulness.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　三人中一人，　　故為執樂神；",
        "translation": "Of the three, only one is a deity of enjoyment Because it clings to pleasure.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　二人見道諦，　　超越忉利天。",
        "translation": "They both saw the truth of the path and transcended the Trāyastriṃśa gods.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　世尊所說法，　　弟子不懷疑；",
        "translation": "The disciples did not doubt the teaching taught by the World-honored One.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　俱共同聞法，　　二人勝彼一。",
        "translation": "They all heard the Dharma together, and two people prevailed over one.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　自見殊勝已，　　皆生光音天；",
        "translation": "Having seen for themselves the excellence, They are all born in Ābhāsvara Heaven.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "　　我觀見彼已，　　故來至佛所。』」",
        "translation": "After observing them, I'll therefore come to the Buddha.'",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "瞿夷見已，以偈觸嬈曰：帝釋白佛言：「願開閑暇，一決我疑。」",
        "translation": "Seeing this, Gopīi interrupted him with a verse, saying, Indra said to the Buddha, Please give me some leisure to resolve my doubts.",
        "source": "T01n0001_010:0063c08_2"
    },
    {
        "source_sentence": "佛言：「隨汝所問，吾當為汝一一演說。」",
        "translation": "The Buddha said, Following your questions, I will explain them one by one for you.",
        "source": "T01n0001_010:0064a13_3"
    },
    {
        "source_sentence": "爾時，帝釋即白佛言：「諸天、世人、乾沓和、阿須羅及餘眾生等，盡與何結相應，",
        "translation": "At that point, Indra said to the Buddha, What are all the fetters associated with gods, humans, gandharvas, asuras, and other sentient beings?",
        "source": "T01n0001_010:0064a14_4"
    },
    {
        "source_sentence": "乃至怨讐、刀杖相向？」",
        "translation": "Up to the point where enemies and swords and sticks are facing each other?",
        "source": "T01n0001_010:0064a16_5"
    },
    {
        "source_sentence": "佛告釋言：「怨結之生，皆由貪嫉，故使諸天、世人、阿須羅、餘眾生等，",
        "translation": "The Buddha told the Śākyamuni, All the causes of the arising of the bond of enmity are due to craving and jealousy, so that gods, humans, asuras, other sentient beings, and so forth.",
        "source": "T01n0001_010:0064a16_6"
    },
    {
        "source_sentence": "刀杖相加。」",
        "translation": "The swords and sticks are joined together.",
        "source": "T01n0001_010:0064a18_7"
    },
    {
        "source_sentence": "爾時，帝釋即白佛言：「實爾！",
        "translation": "It was then that Śakra said to the Buddha, Indeed!",
        "source": "T01n0001_010:0064a18_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0064a19_9"
    },
    {
        "source_sentence": "怨結之生，由貪嫉故，使諸天、世人、阿須羅、餘眾生等，刀杖相加。",
        "translation": "The arising of the fetter of resentment is due to craving and jealousy, which causes gods, humans, asuras, and other sentient beings to add swords and sticks to each other.",
        "source": "T01n0001_010:0064a19_10"
    },
    {
        "source_sentence": "我今聞佛所說，疑網悉除，無復疑也，但不解此貪嫉之生，何由而起？",
        "translation": "Now that I have heard the Buddha’s exhortation, my web of doubt has been completely eliminated. There is no more doubt in me. How can I give rise to this feeling of greed and jealousy if I do not understand?",
        "source": "T01n0001_010:0064a20_11"
    },
    {
        "source_sentence": "何因何緣？",
        "translation": "What is the cause and what is the condition?",
        "source": "T01n0001_010:0064a22_12"
    },
    {
        "source_sentence": "誰為原首？",
        "translation": "Who was the original leader?",
        "source": "T01n0001_010:0064a22_13"
    },
    {
        "source_sentence": "從誰而有？",
        "translation": "Where did it come from?",
        "source": "T01n0001_010:0064a22_14"
    },
    {
        "source_sentence": "從誰而無？」",
        "translation": "Where did it come from and not?",
        "source": "T01n0001_010:0064a23_15"
    },
    {
        "source_sentence": "佛告帝釋：「貪嫉之生，皆由愛憎，愛憎為因，愛憎為緣，愛憎為首，",
        "translation": "The Buddha told Śakra, lord of the gods, “The arising of greed and jealousy is due to affection and hatred. affection and hatred are the cause; affection and hatred are the condition; affection and hatred are the first.",
        "source": "T01n0001_010:0064a23_16"
    },
    {
        "source_sentence": "從此而有，無此則無。」",
        "translation": "It comes from this, and if there's nothing here, there's nothing.",
        "source": "T01n0001_010:0064a24_17"
    },
    {
        "source_sentence": "爾時，帝釋即白佛言：「實爾。",
        "translation": "At that point, Indra said to the Buddha, Yes, it's true.",
        "source": "T01n0001_010:0064a25_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0064a26_19"
    },
    {
        "source_sentence": "貪嫉之生，皆由愛憎，愛憎為因，愛憎為緣，愛憎為首，從此而有，無此則無。",
        "translation": "The arising of greed and jealousy is all due to craving and hatred. Desire and hatred are the causes; craving and hatred are the conditions; craving and hatred are the first. They arise from this, and when there is no desire for them, there is no desire for them.",
        "source": "T01n0001_010:0064a26_20"
    },
    {
        "source_sentence": "我今聞佛所說，迷惑悉除，無復疑也。",
        "translation": "Now that I've heard what the Buddha teaches, my confusion has been completely removed, and there's no more doubt.",
        "source": "T01n0001_010:0064a27_21"
    },
    {
        "source_sentence": "但不解愛憎復何由而生？",
        "translation": "But how could it arise again without understanding what is loved and what is disliked?",
        "source": "T01n0001_010:0064a28_22"
    },
    {
        "source_sentence": "何因何緣？",
        "translation": "What is the cause and what is the condition?",
        "source": "T01n0001_010:0064a29_23"
    },
    {
        "source_sentence": "誰為原首？",
        "translation": "Who was the original leader?",
        "source": "T01n0001_010:0064a29_24"
    },
    {
        "source_sentence": "從誰而有？",
        "translation": "Where did it come from?",
        "source": "T01n0001_010:0064a29_25"
    },
    {
        "source_sentence": "從誰而無？」",
        "translation": "Where did it come from and not?",
        "source": "T01n0001_010:0064b01_26"
    },
    {
        "source_sentence": "佛告帝釋：「愛憎之生，皆由於欲，因欲緣欲，欲為原首，從此而有，",
        "translation": "The Buddha said to Śakra, lord of the gods: Sentient beings give rise to affection and hatred because they are driven by desire. Desire is the first root cause of all things, and it is the seed that gives rise to them.",
        "source": "T01n0001_010:0064b01_27"
    },
    {
        "source_sentence": "無此則無。」",
        "translation": "If there's nothing, then there's nothing.",
        "source": "T01n0001_010:0064b02_28"
    },
    {
        "source_sentence": "爾時，帝釋白佛言：「實爾！",
        "translation": "It was then that Śakra said to the Buddha, Indeed!",
        "source": "T01n0001_010:0064b03_29"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0064b03_30"
    },
    {
        "source_sentence": "愛憎之生，皆由於欲，因欲緣欲，欲為原首，從此而有，無此則無。",
        "translation": "The arising of craving and hatred are all the result of desire. Desire is the root cause, while desire is the condition as cause for craving. When desire exists, it comes from this; when there is no desire, there is no desire.",
        "source": "T01n0001_010:0064b03_31"
    },
    {
        "source_sentence": "我今聞佛所說，迷惑悉除，無復疑也。",
        "translation": "Now that I've heard what the Buddha teaches, my confusion has been completely removed, and there's no more doubt.",
        "source": "T01n0001_010:0064b05_32"
    },
    {
        "source_sentence": "但不知此欲復何由生？",
        "translation": "But we do not know how this desire can arise again.",
        "source": "T01n0001_010:0064b06_33"
    },
    {
        "source_sentence": "何因何緣？",
        "translation": "What is the cause and what is the condition?",
        "source": "T01n0001_010:0064b06_34"
    },
    {
        "source_sentence": "誰為原首？",
        "translation": "Who was the original leader?",
        "source": "T01n0001_010:0064b07_35"
    },
    {
        "source_sentence": "從誰而有？",
        "translation": "Where did it come from?",
        "source": "T01n0001_010:0064b07_36"
    },
    {
        "source_sentence": "從誰而無？」",
        "translation": "Where did it come from and not?",
        "source": "T01n0001_010:0064b07_37"
    },
    {
        "source_sentence": "佛告帝釋：「愛由想生，因想緣想，想為原首，從此而有，無此而無。」",
        "translation": "The Buddha told Śākyamuni, Desire arises from conceptions, which are the cause and condition for conceptions, and conceptions are the root; they exist from here and don't exist without them.",
        "source": "T01n0001_010:0064b07_38"
    },
    {
        "source_sentence": "爾時，帝釋白佛言：「實爾！",
        "translation": "It was then that Śakra said to the Buddha, Indeed!",
        "source": "T01n0001_010:0064b09_39"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0064b09_40"
    },
    {
        "source_sentence": "愛由想生，因想緣想，想為原首，從此而有，無此則無。",
        "translation": "Desire arises from ideation. It is the root of craving, and when it is absent, it does not arise.",
        "source": "T01n0001_010:0064b10_0"
    },
    {
        "source_sentence": "我今聞佛所說，無復疑也。",
        "translation": "Now that I've heard what the Buddha teaches, there's no doubt in my mind.",
        "source": "T01n0001_010:0064b11_1"
    },
    {
        "source_sentence": "但不解想復何由而生？",
        "translation": "But what is the reason they don't understand conceptions?",
        "source": "T01n0001_010:0064b11_2"
    },
    {
        "source_sentence": "何因何緣？",
        "translation": "What is the cause and what is the condition?",
        "source": "T01n0001_010:0064b12_3"
    },
    {
        "source_sentence": "誰為原首？",
        "translation": "Who was the original leader?",
        "source": "T01n0001_010:0064b12_4"
    },
    {
        "source_sentence": "從誰而有？",
        "translation": "Where did it come from?",
        "source": "T01n0001_010:0064b12_5"
    },
    {
        "source_sentence": "從誰而無？」",
        "translation": "Where did it come from and not?",
        "source": "T01n0001_010:0064b13_6"
    },
    {
        "source_sentence": "佛告帝釋：「想之所生，由於調戲，因調緣調，調為原首，從此而有，",
        "translation": "The Buddha said to Śakra, lord of the gods: Thoughts arise by reason of regulation and play. They are regulated by regulation and conditioned by regulation; regulation is the original principle that comes into being from this.",
        "source": "T01n0001_010:0064b13_7"
    },
    {
        "source_sentence": "無此則無。",
        "translation": "If there's nothing, then there's nothing.",
        "source": "T01n0001_010:0064b14_8"
    },
    {
        "source_sentence": "帝釋！",
        "translation": "Indra!",
        "source": "T01n0001_010:0064b15_9"
    },
    {
        "source_sentence": "若無調戲則無想，無想則無欲，無欲則無愛憎，無愛憎則無貪嫉，若無貪嫉，",
        "translation": "If there is no playfulness, there is no ideation; if there is no ideation, there is no desire; if there is no desire, there is no love or hatred; if there is no love or hatred, there is no craving or jealousy; and if there is no craving or jealousy,",
        "source": "T01n0001_010:0064b15_10"
    },
    {
        "source_sentence": "則一切眾生不相傷害。",
        "translation": "Then all sentient beings won't harm each other.",
        "source": "T01n0001_010:0064b17_11"
    },
    {
        "source_sentence": "帝釋！",
        "translation": "Indra!",
        "source": "T01n0001_010:0064b17_12"
    },
    {
        "source_sentence": "但緣調為本，因調緣調，調為原首，從此有想，從想有欲，從欲有愛憎，",
        "translation": "Conditioned states are the root, while conditioned states are the cause. Conditioned states are the root and conditioned states are the root. Conditioned states have feelings as their foundation; from these there is perception; from feeling there is desire; and from desire there is craving and hatred.",
        "source": "T01n0001_010:0064b17_13"
    },
    {
        "source_sentence": "從愛憎有貪嫉；",
        "translation": "From craving and hatred there is greed and jealousy.",
        "source": "T01n0001_010:0064b19_14"
    },
    {
        "source_sentence": "以貪嫉故，使群生等共相傷害。」",
        "translation": "Because of their craving and jealousy, they cause sentient beings to harm each other.",
        "source": "T01n0001_010:0064b20_0"
    },
    {
        "source_sentence": "帝釋白佛言：「實爾！",
        "translation": "Indra said to the Buddha, Indeed!",
        "source": "T01n0001_010:0064b20_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0064b21_2"
    },
    {
        "source_sentence": "由調有想，因調緣調，調為原首，從此有想由調而有，無調則無。",
        "translation": "Consciousness arises from regulation and is conditioned by regulation. Regulation is the root of consciousness. Conciousness arises from regulation and ceases when there is no regulation.",
        "source": "T01n0001_010:0064b21_3"
    },
    {
        "source_sentence": "若本無調者則無想，無想則無欲，無欲則無愛憎，無愛憎則無貪嫉，無貪嫉則一切群生不相傷害。",
        "translation": "If there's originally no regulation, then there's no perception; if there's no perception, then there's no desire; if there's no desire, then there's no love and hate; if there's no love and hate, then there's no craving and jealousy; and if there's no craving and jealousy,",
        "source": "T01n0001_010:0064b22_4"
    },
    {
        "source_sentence": "但想由調生，因調緣調，調為原首，從調有想，從想有欲，從欲有愛憎，",
        "translation": "Consciousness, however, arises from regulation. Conditioned by regulation and conditioned by regulation, it is governed by regulation; regulation is the foremost of all [factors]. From regulation there proceeds perception; from perception there proceeds desire; and from desire there proceeds craving and hatred.",
        "source": "T01n0001_010:0064b25_5"
    },
    {
        "source_sentence": "從愛憎有貪嫉，從貪嫉使一切眾生共相傷害。",
        "translation": "From craving and hatred, there's greed and jealousy, and from greed and jealousy all sentient beings are harmed by each other.",
        "source": "T01n0001_010:0064b26_6"
    },
    {
        "source_sentence": "我今聞佛所說，迷惑悉除，無復疑也。」",
        "translation": "Now that I've heard what the Buddha teaches, my confusion is completely removed, and there's no further doubt.",
        "source": "T01n0001_010:0064b28_7"
    },
    {
        "source_sentence": "爾時，帝釋復白佛言：「一切沙門、婆羅門盡除調戲在滅迹耶？",
        "translation": "At that point, Tīrṣa again said to the Buddha, Are all the ascetics and brāhmaṇas in the cessation of playfulness completely removed?",
        "source": "T01n0001_010:0064b28_8"
    },
    {
        "source_sentence": "為不除調戲在滅迹耶？」",
        "translation": "Why isn't it in the traces of cessation except for regulation?",
        "source": "T01n0001_010:0064c01_9"
    },
    {
        "source_sentence": "佛告帝釋：「一切沙門、婆羅門不盡除調戲在滅迹也。",
        "translation": "The Buddha told Śakra, All the śramaṇas and brāhmaṇas who aren't completely free from regulation are in the path of cessation.",
        "source": "T01n0001_010:0064c01_10"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T01n0001_010:0064c03_11"
    },
    {
        "source_sentence": "帝釋，世間有種種界，眾生各依己界，堅固守持，不能捨離，謂己為實，",
        "translation": "“O Śakra, lord of the gods! There are various realms in the world. Sentient beings each rely on their own realm; they firmly abide therein and cannot let go of it.",
        "source": "T01n0001_010:0064c03_12"
    },
    {
        "source_sentence": "餘者為虛。",
        "translation": "The rest are false.",
        "source": "T01n0001_010:0064c05_13"
    },
    {
        "source_sentence": "是故，帝釋！",
        "translation": "Therefore, Indra!",
        "source": "T01n0001_010:0064c05_14"
    },
    {
        "source_sentence": "一切沙門、婆羅門不盡除調戲而在滅迹。」",
        "translation": "All the śramaṇas and brāhmaṇas don't completely remove playfulness and cease it in their traces.",
        "source": "T01n0001_010:0064c05_15"
    },
    {
        "source_sentence": "爾時，帝釋白佛言：「實爾！",
        "translation": "It was then that Śakra said to the Buddha, Indeed!",
        "source": "T01n0001_010:0064c06_16"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0064c07_17"
    },
    {
        "source_sentence": "世間有種種眾生，各依己界，堅固守持，不能捨離，謂己為是，餘為虛妄。",
        "translation": "There are various kinds of sentient beings in the world, each relying on their own realm, firmly maintaining it and unable to abandon it, saying that they themselves are this and the rest are false.",
        "source": "T01n0001_010:0064c07_18"
    },
    {
        "source_sentence": "是故一切沙門、婆羅門不盡除調戲而在滅迹。",
        "translation": "That's why all the ascetics and priests don't completely remove their playfulness and cease its traces.",
        "source": "T01n0001_010:0064c08_19"
    },
    {
        "source_sentence": "我聞佛言，疑惑悉除，無復疑也。」",
        "translation": "When I heard the Buddha say this, my doubts and confusions were completely removed, and there were no more doubts.",
        "source": "T01n0001_010:0064c10_20"
    },
    {
        "source_sentence": "帝釋復白佛言：「齊幾調在滅迹耶？」",
        "translation": "Śakra again said to the Buddha, How many of them are in the traces of cessation?",
        "source": "T01n0001_010:0064c10_21"
    },
    {
        "source_sentence": "佛告帝釋：「調戲有三：一者口，二者想，三者求。",
        "translation": "The Buddha told Śakra Devānām-Indra, There are three kinds of playfulness: first, verbal play, second, conceptual play, and third, seeking.",
        "source": "T01n0001_010:0064c11_22"
    },
    {
        "source_sentence": "彼口所言，自害、害他，亦二俱害。",
        "translation": "What they say verbally harms themselves and harms others, and it's also both harmful to both.",
        "source": "T01n0001_010:0064c12_23"
    },
    {
        "source_sentence": "捨此言已，如所言，不自害、不害他、不二俱害。",
        "translation": "Having abandoned these words, he doesn't harm himself, harm others, or harm both.",
        "source": "T01n0001_010:0064c13_24"
    },
    {
        "source_sentence": "知時比丘如口所言，專念不亂，想亦自害、害他，亦二俱害；",
        "translation": "Knowing the time, the bhikṣu acts in accordance with his words and concentrates his thoughts without disturbance. Thoughts also harm themselves and others, and they both harm one another.",
        "source": "T01n0001_010:0064c14_25"
    },
    {
        "source_sentence": "捨此想已，如所想，不自害、不害他，二俱不害，知時比丘如所想，專念不亂。",
        "translation": "Having abandoned these thoughts, he acts in accordance with those thoughts. He does not harm himself or others, and neither of them harms him. Knowing [how to] do so, the bhikṣu remains mindful of what he thinks without disturbance.",
        "source": "T01n0001_010:0064c15_26"
    },
    {
        "source_sentence": "帝釋！",
        "translation": "Indra!",
        "source": "T01n0001_010:0064c17_27"
    },
    {
        "source_sentence": "求亦自害、害他，亦二俱害；",
        "translation": "Seeking also harms oneself and harms others, and it also harms both.",
        "source": "T01n0001_010:0064c17_28"
    },
    {
        "source_sentence": "捨此求已，如所求，不自害、不害他，不二俱害，知時比丘如所求，專念不亂。」",
        "translation": "After abandoning this request, he follows what he asks, doesn't harm himself or others, and doesn't harm both, knowing that the monk then does as he asks, concentrating his thoughts without confusion.",
        "source": "T01n0001_010:0064c18_29"
    },
    {
        "source_sentence": "爾時，釋提桓因言：「我聞佛所說，無復狐疑。」",
        "translation": "It was then that Śakra Devānām-Indra said, I've heard what the Buddha taught, and there's no doubt about it.",
        "source": "T01n0001_010:0064c20_30"
    },
    {
        "source_sentence": "又白佛言：「齊幾名賢聖捨心？」",
        "translation": "Again, he said to the Buddha, How many names are called the minds of goodness and noble equanimity?",
        "source": "T01n0001_010:0064c21_31"
    },
    {
        "source_sentence": "佛告帝釋：「捨心有三：一者喜身，二者憂身，三者捨身。",
        "translation": "The Buddha told Śakra, There are three kinds of equanimity: first, the body of joy, second, the body of grief, and third, the body of equanimity.",
        "source": "T01n0001_010:0064c22_32"
    },
    {
        "source_sentence": "帝釋！",
        "translation": "Indra!",
        "source": "T01n0001_010:0064c23_33"
    },
    {
        "source_sentence": "彼喜身者，自害、害他，亦二俱害；",
        "translation": "The body of satisfaction is that which harms oneself and harms others, and it also harms both.",
        "source": "T01n0001_010:0064c23_34"
    },
    {
        "source_sentence": "捨此喜已，如所喜，不自害、害他，二俱不害，知時比丘專念不忘，即名受具足戒。",
        "translation": "After abandoning this joy, he follows what he likes and doesn't harm himself or others, and neither one nor the other harms him. Knowing the time, the monk concentrates his thoughts and doesn't forget them, which is called receiving the full set of precepts.",
        "source": "T01n0001_010:0064c24_35"
    },
    {
        "source_sentence": "帝釋！",
        "translation": "Indra!",
        "source": "T01n0001_010:0064c26_36"
    },
    {
        "source_sentence": "彼憂身者，自害、害彼，亦二俱害；",
        "translation": "The body of sorrow is that which harms itself and harms others, and it also harms both.",
        "source": "T01n0001_010:0064c26_37"
    },
    {
        "source_sentence": "捨此憂已，如所憂，不自害、害他，二俱不害，知時比丘專念不忘，即名受具足戒。",
        "translation": "After abandoning this grief, he follows the grief and doesn't harm himself or others, and neither one nor the other harms him. Knowing the time, the monk concentrates his thoughts and doesn't forget them, which is called receiving the full set of precepts.",
        "source": "T01n0001_010:0064c27_0"
    },
    {
        "source_sentence": "復次，帝釋！",
        "translation": "Furthermore, Indra!",
        "source": "T01n0001_010:0064c28_1"
    },
    {
        "source_sentence": "彼捨身者，自害、害他，亦二俱害；",
        "translation": "The one who lets go of the body harms himself and harms others, and also harms both.",
        "source": "T01n0001_010:0064c29_2"
    },
    {
        "source_sentence": "捨此身已，如所捨，不自害、不害他，二俱不害，知時比丘專念不忘，",
        "translation": "Having relinquished this body, he does not harm himself or others, and neither one nor the other harms him. The bhikṣu knows that at the [proper] time he should concentrate his thoughts and not forget them.",
        "source": "T01n0001_010:0064c29_3"
    },
    {
        "source_sentence": "是即名為受具足戒。」",
        "translation": "This is called receiving the full set of precepts.",
        "source": "T01n0001_010:0065a02_4"
    },
    {
        "source_sentence": "帝釋白佛言：「我聞佛所說，無復狐疑。」",
        "translation": "Indra said to the Buddha, I've heard what the Buddha teaches, and there's no doubt in my mind.",
        "source": "T01n0001_010:0065a03_5"
    },
    {
        "source_sentence": "又白佛言：「齊幾名賢聖律諸根具足？」",
        "translation": "Again, he said to the Buddha, How many names are the faculties of the wise and noble precepts complete?",
        "source": "T01n0001_010:0065a03_6"
    },
    {
        "source_sentence": "佛告帝釋：「眼知色，我說有二：可親、不可親。",
        "translation": "The Buddha told Śakra, Eyes know form, and I say there are two: what's to be known and what's not to be known.",
        "source": "T01n0001_010:0065a04_7"
    },
    {
        "source_sentence": "耳聲、鼻香、舌味、身觸、意法，我說有二：可親、不可親。」",
        "translation": "ear sounds, nose odors, tongues, tastes, bodily sensations, and mental dharmas are said to be two: desirable and undesirable.",
        "source": "T01n0001_010:0065a05_8"
    },
    {
        "source_sentence": "爾時，帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra said to the Buddha, Bhagavān!",
        "source": "T01n0001_010:0065a07_0"
    },
    {
        "source_sentence": "如來略說，未廣分別，我以具解。",
        "translation": "The Tathāgata has explained it briefly, but I have not explained it in detail.",
        "source": "T01n0001_010:0065a07_1"
    },
    {
        "source_sentence": "眼知色，我說有二：可親、不可親。",
        "translation": "The eye knows form, and I say there are two: what can be intimate and what can't be intimate.",
        "source": "T01n0001_010:0065a08_2"
    },
    {
        "source_sentence": "耳聲、鼻香、舌味、身觸、意法有二：可親、不可親。",
        "translation": "There are two kinds of ear sounds, nose odors, tongues, tastes, bodily sensations, and mental factors: those that can be known and those that cannot be known.",
        "source": "T01n0001_010:0065a09_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0065a10_4"
    },
    {
        "source_sentence": "如眼觀色，善法損減，不善法增，如此眼知色，我說不可親；",
        "translation": "Good dharmas decrease and bad dharmas increase. In the same way, when the eye perceives visible matter, good dharmas decrease and bad dharmas increase; in the same way, when the eye knows visible matter, I say that it cannot be perceived by oneself.",
        "source": "T01n0001_010:0065a10_5"
    },
    {
        "source_sentence": "耳聲、鼻香、舌味、身觸、意知法，善法損減，不善法增，我說不可親。",
        "translation": "The sound of the ear, odor of the nose, taste of the tongue, touch of the body and mind know factors. Good factors decrease and bad factors increase. I say that they cannot be associated with it.",
        "source": "T01n0001_010:0065a11_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0065a13_7"
    },
    {
        "source_sentence": "如眼見色，善法增長，不善法減，如是眼知色，我說可親；",
        "translation": "Good factors increase and bad factors decrease, while the eye perceives matter. In this way, the eye knows matter: I say that one can be close to it.",
        "source": "T01n0001_010:0065a13_8"
    },
    {
        "source_sentence": "耳聲、鼻香、舌味、身觸、意知法，善法增長，不善法減，我說可親。」",
        "translation": "The sounds of the ear, nose, odor, taste of the tongue, body contact, and mind know the teachings, good qualities increase, unskillful qualities decrease, and I say they can be intimate.",
        "source": "T01n0001_010:0065a14_9"
    },
    {
        "source_sentence": "佛告帝釋：「善哉！",
        "translation": "The Buddha told Śakra, Good!",
        "source": "T01n0001_010:0065a16_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T01n0001_010:0065a16_1"
    },
    {
        "source_sentence": "是名賢聖律諸根具足。」",
        "translation": "This is called the fulfillment of the faculties of the good and noble precepts.",
        "source": "T01n0001_010:0065a16_2"
    },
    {
        "source_sentence": "帝釋白佛言：「我聞佛所說，無復狐疑。」",
        "translation": "Indra said to the Buddha, I've heard what the Buddha teaches, and there's no doubt in my mind.",
        "source": "T01n0001_010:0065a17_3"
    },
    {
        "source_sentence": "復白佛言：「齊幾比丘名為究竟、究竟梵行、究竟安隱、究竟無餘？」",
        "translation": "Again, he said to the Buddha, How many monks are called ultimate, ultimate religious practice, ultimate peace, and ultimately without remainder?",
        "source": "T01n0001_010:0065a17_4"
    },
    {
        "source_sentence": "佛告帝釋：「為愛所苦，身得滅者，是為究竟、究竟梵行、究竟安隱、究竟無餘。」",
        "translation": "The Buddha told Śakra, This is the ultimate, ultimate religious practice, ultimate peace, and ultimate cessation of body that's pained by craving.",
        "source": "T01n0001_010:0065a19_5"
    },
    {
        "source_sentence": "帝釋白佛言：「我本長夜，所懷疑網，今者如來開發所疑。」",
        "translation": "Śakra Devānām-Indra said to the Buddha, I've had doubts for a long time, but now the Tathāgata has developed doubts.",
        "source": "T01n0001_010:0065a21_6"
    },
    {
        "source_sentence": "佛告帝釋：「汝昔頗曾詣沙門、婆羅門所問此義不？」",
        "translation": "The Buddha told Śakra, Have you ever visited a śramaṇa or brāhmaṇa in the past to ask about this meaning?",
        "source": "T01n0001_010:0065a22_7"
    },
    {
        "source_sentence": "帝釋白佛言：「我自憶念：昔者，曾詣沙門、婆羅門所諮問此義。",
        "translation": "Śakra, lord of the gods, said to the Buddha: I recall that in the past I once visited śramaṇas and brāhmaṇas to enquire about this matter.",
        "source": "T01n0001_010:0065a23_8"
    },
    {
        "source_sentence": "昔我一時曾集講堂，與諸天眾共論：『如來為當出世，為未出世？』",
        "translation": "Once, I assembled in the assembly hall and discussed with the gods, 'Is the Tathāgata going to appear in the world or not?'",
        "source": "T01n0001_010:0065a25_9"
    },
    {
        "source_sentence": "時共推求，不見如來出現于世，各自還宮，五欲娛樂。",
        "translation": "When they searched together, they didn't see the Tathāgata appear in the world, returned to their palaces, and amuse themselves with the five desires.",
        "source": "T01n0001_010:0065a26_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0065a27_11"
    },
    {
        "source_sentence": "我復於後時見諸大神天，自恣五欲已，漸各命終。",
        "translation": "At some point later, I'll also see the great gods and goddesses who have abandoned their five desires for themselves and gradually die.",
        "source": "T01n0001_010:0065a27_12"
    },
    {
        "source_sentence": "時我，世尊！",
        "translation": "At the time, I, Bhagavān!",
        "source": "T01n0001_010:0065a29_13"
    },
    {
        "source_sentence": "懷大恐怖，衣毛為竪。",
        "translation": "He harbored great fear, and his hair stood on end in shame.",
        "source": "T01n0001_010:0065a29_14"
    },
    {
        "source_sentence": "時，見沙門、婆羅門處在閑靜，去家離欲，我尋至彼所問言：『云何名究竟？』",
        "translation": "When I saw the ascetics and priests in a secluded place, leaving home and free of desire, I went to them and asked, 'What's called the ultimate?'",
        "source": "T01n0001_010:0065a29_15"
    },
    {
        "source_sentence": "我問此義，彼不能報。",
        "translation": "I'll ask about this meaning, but they won't answer it.",
        "source": "T01n0001_010:0065b02_16"
    },
    {
        "source_sentence": "彼既不知，逆問我言：『汝為是誰？』",
        "translation": "Since they didn't know, they asked me directly, 'Who are you?'",
        "source": "T01n0001_010:0065b03_17"
    },
    {
        "source_sentence": "我尋報言：『我是釋提桓因。』",
        "translation": "I looked around and reported back, saying, 'This is Śakra Devānām-Indra.'",
        "source": "T01n0001_010:0065b03_18"
    },
    {
        "source_sentence": "彼復問言：『汝是何釋？』",
        "translation": "Again, he asked, 'What's your explanation?'",
        "source": "T01n0001_010:0065b04_19"
    },
    {
        "source_sentence": "我時答言：『我是天帝釋，心有所疑，故來相問耳。』",
        "translation": "I then answered, 'I'm Indra, the lord of gods, and I have doubts in my mind; therefore, I've come to ask questions.'",
        "source": "T01n0001_010:0065b04_20"
    },
    {
        "source_sentence": "時，我與彼如所知見，說於釋義。",
        "translation": "At the time, I explained the meaning of the explanation to them in terms of knowing and seeing.",
        "source": "T01n0001_010:0065b06_21"
    },
    {
        "source_sentence": "彼問我言：『更為我弟子，我今是佛弟子，得須陀洹道，不墮餘趣，極七往返，",
        "translation": "He asked me, “Again, you should be my disciple. I am now the disciple of the Buddha. Having attained the path of stream-entry, I will not fall into any other rebirth.",
        "source": "T01n0001_010:0065b06_22"
    },
    {
        "source_sentence": "必成道果，唯願世尊記我為斯陀含。』",
        "translation": "I'll surely attain the fruit of the path, so may the Bhagavān remember me as a once-returner.'",
        "source": "T01n0001_010:0065b08_23"
    },
    {
        "source_sentence": "「『由彼染穢想，　　故生我狐疑；",
        "translation": "'It's because of those thoughts of defilement that doubt about self arises.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　長夜與諸天，　　推求於如來。",
        "translation": "For a long time, the gods and goddesses searched for the Tathāgata.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　見諸出家人，　　常在閑靜處；",
        "translation": "I see the renunciants Always in a secluded place.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　謂是佛世尊，　　故往[旃-方+示]首言：",
        "translation": "It means that this is the Buddha, the Bhagavān, Who therefore went to [twenty - fang + show] and said,",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　我今故來問，　　云何為究竟？",
        "translation": "For this reason I have come to ask, What is the ultimate?",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　問已不能報，　　道迹之所趣。",
        "translation": "After asking the question, he couldn't repay it, which is the destination of the path.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　今日無等尊，　　是我久所求；",
        "translation": "Today the World-Honored One is what I have been seeking for a long time.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　已觀察己行，　　心已正思惟。",
        "translation": "Having observed his own conduct, His mind has correctly reflected.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　唯聖先已知，　　我心之所行；",
        "translation": "Only the noble one has already known The action of self and thought.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　長夜所修業，　　願淨眼記之。",
        "translation": "I pray that the pure eye will remember the deeds practiced for a long time.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　歸命人中上，　　三界無極尊；",
        "translation": "The supreme among humans is the highest of the Three Dhātus, the infinitely great Honorable One.",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "　　能斷恩愛刺，　　今禮日光尊。』」",
        "translation": "He's able to cut off the thorn of kindness and craving, and now he pays homage to the venerable Sunlight.'",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "說此語已，復作頌曰：佛告帝釋：「汝憶本得喜樂、念樂時不？」",
        "translation": "After speaking these words, he composed another verse, saying, The Buddha told Śakra, Do you remember the time when you originally attained joy and mindfulness of joy?",
        "source": "T01n0001_010:0065b09_24"
    },
    {
        "source_sentence": "帝釋答曰：「如是，世尊！",
        "translation": "Śakra replied, So it is, Bhagavān!",
        "source": "T01n0001_010:0065b23_25"
    },
    {
        "source_sentence": "憶昔所得喜樂、念樂。",
        "translation": "I recall the joy and happiness gained in the past and the bliss of mindfulness.",
        "source": "T01n0001_010:0065b24_26"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_010:0065b24_27"
    },
    {
        "source_sentence": "我昔曾與阿須輪共戰，我時得勝，阿須輪退，我時則還，得歡喜、念樂，",
        "translation": "World-Honored One, in the past I fought with the asuras. At that time I won the battle and the asuras withdrew.",
        "source": "T01n0001_010:0065b25_0"
    },
    {
        "source_sentence": "計此歡喜、念樂，離有穢惡刀杖喜樂、鬪訟喜樂。",
        "translation": "They think of this joy and mindfulness as bliss, the bliss of freedom from defilement with a bad sword or cane and the bliss of fighting and quarreling.",
        "source": "T01n0001_010:0065b26_1"
    },
    {
        "source_sentence": "今我於佛所得喜、念樂，無有刀杖、諍訟之樂。」",
        "translation": "Now, I'm delighted and mindful of the joy and happiness gained by the Buddha, but there's no pleasure of swords or sticks or arguments.",
        "source": "T01n0001_010:0065b27_2"
    },
    {
        "source_sentence": "佛告帝釋：「汝今得喜樂、念樂，於中欲求何功德果？」",
        "translation": "The Buddha told Śakra, Now that you've attained bliss and mindfulness of bliss, what merit do you want to seek in it?",
        "source": "T01n0001_010:0065b28_3"
    },
    {
        "source_sentence": "爾時，帝釋白佛言：「我於喜樂、念樂中，欲求五功德果，何等五？」",
        "translation": "It was then that Śakra said to the Buddha, Among joy and mindfulness of joy, what are the five meritorious fruits that I want to pursue?",
        "source": "T01n0001_010:0065c01_4"
    },
    {
        "source_sentence": "「我後若命終，　　捨於天上壽；",
        "translation": "“After me, when my life ends, I’ll give up the heavenly life span.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　處胎不懷患，　　使我心歡喜。",
        "translation": "Being in the womb and not harboring afflictions makes me rejoice.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　佛度未度者，　　能說正真道；",
        "translation": "Those who are liberated by buddhas but not yet liberated can teach the true path.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　於三佛法中，　　我要修梵行。",
        "translation": "Among the teachings of the three buddhas, I want to cultivate religious practice.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　以智慧身居，　　心自見正諦；",
        "translation": "He dwells in the body of wisdom, And with his mind he sees the truth.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　得達本所起，　　於是長解脫。",
        "translation": "Attaining understanding of what's originally produced, they'll then be liberated for a long time.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　但當勤修行，　　習佛真實智；",
        "translation": "You should practice diligently And cultivate the buddha’s true knowledge.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　設不獲道證，　　功德猶勝天。",
        "translation": "If they don't attain the realization of the path, their merit will be like that of a superior god.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　諸有神妙天，　　阿迦尼吒等；",
        "translation": "The gods with supernatural powers, such as Akaniṣṭha and so forth.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　下至末後身，　　必當生彼處。",
        "translation": "They will surely be reborn there in the final body, from the small to the great.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　我今於此處，　　受天清淨身；",
        "translation": "Here now I am endowed with the pure body of a heavenly being.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "　復得增壽命，　　淨眼我自知。」",
        "translation": "They'll also increase their life span, and I will know it for myself with the pure eye.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "即說偈言：說此偈已，白佛言：「我於喜樂、念樂中，欲得如是五功德果。」",
        "translation": "He then spoke a verse, saying, After speaking this verse, he said to the Buddha, I want to attain these five fruits of merit in joy and mindfulness.",
        "source": "T01n0001_010:0065c02_5"
    },
    {
        "source_sentence": "爾時，帝釋語忉利諸天曰：「汝於忉利天上梵童子前恭敬禮事，今於佛前復設此敬者，",
        "translation": "At that moment, Indra said to the Trāyastriṃśa gods: You should venerate and serve me in front of the Brahmā among the Trāyastriṃśa gods.",
        "source": "T01n0001_010:0065c16_6"
    },
    {
        "source_sentence": "不亦善哉！」",
        "translation": "That's not good either!",
        "source": "T01n0001_010:0065c18_7"
    },
    {
        "source_sentence": "「天王清淨行，　　多利益眾生；",
        "translation": "The king of gods’ pure practice mostly benefits sentient beings.",
        "source": "T01n0001_010:0065c18_8"
    },
    {
        "source_sentence": "　摩竭帝釋主，　　能問如來義。」",
        "translation": "The lord of Magadhi, the Śākyamuni, can ask the Tathāgata about his meaning.",
        "source": "T01n0001_010:0065c18_8"
    },
    {
        "source_sentence": "其語未久，時，梵童子忽然於虛空中天眾上立，向天帝釋而說偈曰：時，",
        "translation": "Not long after these words, the Brahmā youth suddenly stood up in the sky above the hosts of gods and said to Indra, “At that moment,",
        "source": "T01n0001_010:0065c18_8"
    },
    {
        "source_sentence": "梵童子說此偈已，忽然不現。",
        "translation": "After he spoke these verses, the Brahmā boy suddenly disappeared.",
        "source": "T01n0001_010:0065c23_9"
    },
    {
        "source_sentence": "是時，帝釋即從座起，禮世尊足，遶佛三匝，却行而退，忉利諸天及般遮翼亦禮佛足，",
        "translation": "Śakra, lord of the gods, rose from his seat and, venerating the World-honored One by bowing at his feet, circumambulated him three times, withdrew, and withdrew. The Trāyastriṃśa gods and Paranirmita-vaśavartin also bowed to the Buddha’s feet.",
        "source": "T01n0001_010:0065c23_10"
    },
    {
        "source_sentence": "却行而退。",
        "translation": "He walks away and retreats.",
        "source": "T01n0001_010:0065c25_11"
    },
    {
        "source_sentence": "時，天帝釋少復前行，顧語般遮翼曰：「善哉！",
        "translation": "At the time, Śakra Devānām-Indra returned for a short distance and said to Pañcaśikha, Good!",
        "source": "T01n0001_010:0065c25_12"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T01n0001_010:0065c26_13"
    },
    {
        "source_sentence": "汝能先於佛前鼓琴娛樂，然後我及諸天於後方到，我今知汝補汝父位，",
        "translation": "Good man, you were able to play the lute in front of the Buddha first. Then we and the gods will come after him. Now I know that you are repaying your father’s position.",
        "source": "T01n0001_010:0065c27_14"
    },
    {
        "source_sentence": "於乾沓和中最為上首，當以彼拔陀乾沓和王女與汝為妻。」",
        "translation": "He's the highest among the gandharvas, and he will give you that woman of King Bhadragjana as his wife.",
        "source": "T01n0001_010:0065c28_15"
    },
    {
        "source_sentence": "世尊說此法時，八萬四千諸天遠塵離垢，諸法法眼生。",
        "translation": "When the World-honored One taught this doctrine, eighty-four thousand heavenly beings were far removed from their defilements and gave rise to the Dharma eye of all doctrines.",
        "source": "T01n0001_010:0066a01_16"
    },
    {
        "source_sentence": "時，釋提桓因、忉利諸天及般遮翼聞佛所說，歡喜奉行。",
        "translation": "Śakra Devānām-Indra, the gods of Trāyastriṃśa Heaven and Paranirmita-vaśavartin heard what the Buddha taught and were delighted to recite it.",
        "source": "T01n0001_010:0066a02_17"
    },
    {
        "source_sentence": "佛說長阿含經卷第十",
        "translation": "Foshuo Chang ahan jing jing, vol. 10",
        "source": "T01n0001_010:0066a04_0"
    }
]