[
    {
        "source_sentence": "長阿含經序",
        "translation": "Preface to the Chang ahan jing",
        "source": "T01n0001_001:0001a02_0"
    },
    {
        "source_sentence": "長安釋僧肇述",
        "translation": "Commentary by Chang'an Shi Sengzhao",
        "source": "T01n0001_001:0001a04_0"
    },
    {
        "source_sentence": "夫宗極絕於稱謂，賢聖以之沖默；",
        "translation": "The doctrine of Buddhism is utterly cut off from name and expression, and the saints and sages keep silent about it.",
        "source": "T01n0001_001:0001a05_0"
    },
    {
        "source_sentence": "玄旨非言不傳，釋迦所以致教。",
        "translation": "The profound meaning is not transmitted by words, and that's why Śākyamuni taught it.",
        "source": "T01n0001_001:0001a05_1"
    },
    {
        "source_sentence": "是以如來出世，大教有三：約身口，則防之以禁律；",
        "translation": "That is why the Tathāgata appears in the world. The Great Teaching has three parts:",
        "source": "T01n0001_001:0001a06_2"
    },
    {
        "source_sentence": "明善惡，則導之以契經；",
        "translation": "To clarify good and evil, they are led by the scriptures.",
        "source": "T01n0001_001:0001a07_3"
    },
    {
        "source_sentence": "演幽微，則辨之以法相。",
        "translation": "To expound the subtle, he discerns it with the characteristics of the Dharma.",
        "source": "T01n0001_001:0001a08_4"
    },
    {
        "source_sentence": "然則三藏之作也，本於殊應，會之有宗，則異途同趣矣。",
        "translation": "However, it's the work of the Tripiṭaka, which is originally based on different responses, and if there were a doctrine to unite them, they would have different paths and same destinies.",
        "source": "T01n0001_001:0001a08_5"
    },
    {
        "source_sentence": "禁律，律藏也，四分十誦。",
        "translation": "The Vinaya is a collection of the vinaya, consisting of four parts and ten recitations.",
        "source": "T01n0001_001:0001a10_0"
    },
    {
        "source_sentence": "法相，阿毗曇藏也，四分五誦。",
        "translation": "The characteristics of dharmas are the store of the abhidharma, recited in four parts or five times.",
        "source": "T01n0001_001:0001a10_1"
    },
    {
        "source_sentence": "契經，四阿含藏也：《增一阿含》四分八誦，《中阿含》四分五誦，《雜阿含》四分十誦，",
        "translation": "The scriptures are fourfold: the Incremental Āgamas are recited in four parts and eight phrases, the Middle Āgamas are recited in four parts and five phrases, and the Miscellaneous Āgamas are recited in four parts and ten phrases.",
        "source": "T01n0001_001:0001a11_2"
    },
    {
        "source_sentence": "此《長阿含》四分四誦，合三十經以為一部。",
        "translation": "This is the four-part, four- Recitation version of the Longer Āgamas, which combines thirty sūtras into one collection.",
        "source": "T01n0001_001:0001a12_3"
    },
    {
        "source_sentence": "阿含，秦言法歸。",
        "translation": "Āgamas, the Qin word for dharma refuge.",
        "source": "T01n0001_001:0001a13_4"
    },
    {
        "source_sentence": "法歸者，蓋是萬善之淵府，總持之林苑。",
        "translation": "The Dharma refuge is the vast ocean of myriad good deeds, which are maintained in forests and parks.",
        "source": "T01n0001_001:0001a14_5"
    },
    {
        "source_sentence": "其為典也，淵博弘富，韞而彌廣；",
        "translation": "It is a scripture of great depth and vast riches, spreading even more extensively.",
        "source": "T01n0001_001:0001a15_6"
    },
    {
        "source_sentence": "明宣禍福賢愚之迹，剖判真偽異齊之原，歷記古今成敗之數，墟域二儀品物之倫。",
        "translation": "They clearly proclaimed the traces of misfortune, merit, goodness, wisdom, and folly, analyzed the origins of what was true and what was false in different countries, recorded the number of formations and defeats from ancient times to the present, and described the ethnic customs of the two modes of living beings in the territory.",
        "source": "T01n0001_001:0001a15_7"
    },
    {
        "source_sentence": "道無不由，法無不在，譬彼巨海，百川所歸，故以法歸為名。",
        "translation": "The Way has no non-backward path, and the Dharma is not absent. Consider the analogy of the great ocean to which all the rivers in the hundreds of thousands of Ganges Rivers return; for this reason it receives the name Dharma refuge.",
        "source": "T01n0001_001:0001a17_8"
    },
    {
        "source_sentence": "開析修途，所記長遠，故以長為目。",
        "translation": "Because the paths of enlightenment and cultivation are so long-lasting as to be recorded, they therefore have length as their title.",
        "source": "T01n0001_001:0001a19_9"
    },
    {
        "source_sentence": "翫茲典者，長迷頓曉。",
        "translation": "I'm afraid this is a scripture that's long misleading and sudden at dawn.",
        "source": "T01n0001_001:0001a19_10"
    },
    {
        "source_sentence": "邪正難辨，顯如晝夜；",
        "translation": "What is wrong and right are difficult to distinguish, being manifested like day and night.",
        "source": "T01n0001_001:0001a20_11"
    },
    {
        "source_sentence": "報應冥昧，照若影響；",
        "translation": "The darkness of retribution, whether illuminating or influenced by light.",
        "source": "T01n0001_001:0001a20_12"
    },
    {
        "source_sentence": "劫數雖遼，近猶朝夕；",
        "translation": "Although the number of world ages is distant, it is as if they were morning and evening.",
        "source": "T01n0001_001:0001a21_13"
    },
    {
        "source_sentence": "六合雖曠，現若目前。",
        "translation": "Although the six combinations are open, they're present or absent.",
        "source": "T01n0001_001:0001a21_14"
    },
    {
        "source_sentence": "斯可謂朗大明於幽室，惠五目於眾瞽，不闚戶牖，而智無不周矣。",
        "translation": "You can say that [Daosun’s] great insight lies in the secluded room, while Huihui’s five eyes are wide open to all living beings. He does not shut doors and windows but his knowledge extends everywhere.",
        "source": "T01n0001_001:0001a22_15"
    },
    {
        "source_sentence": "大秦天王，滌除玄覽，高韻獨邁，恬智交養，道世俱濟，每懼微言翳於殊俗。",
        "translation": "The great Qin emperor, the heavenly king of the Great Qin dynasty, washed away his profound knowledge and expounds it in a sublime way. He practiced quietude and wisdom with self-conceit and avoided both worldly and heretical doctrines. He feared that he might speak subtly to those who differed from him.",
        "source": "T01n0001_001:0001a23_16"
    },
    {
        "source_sentence": "以右將軍使者司隸校尉晉公姚爽，質直清柔，玄心超詣，尊尚大法，妙悟自然，",
        "translation": "On the right side of the army envoy, Yao Shuang, the Licchavi  lieutenant-in-chief of the Imperial Court, was a straightforward and gentle man with an unadulterated mind. He revered the Great Dharma and had marvelously awakened spontaneously.",
        "source": "T01n0001_001:0001a25_17"
    },
    {
        "source_sentence": "上特留懷，每任以法事。",
        "translation": "The emperor specially kept it in his mind and always let it be used for religious affairs.",
        "source": "T01n0001_001:0001a27_18"
    },
    {
        "source_sentence": "以弘始十二年歲次上章閹茂，請罽賓三藏沙門佛陀耶舍出律藏一分四十五卷，",
        "translation": "On the first day of the twelfth month in the twelveth year after the founding of the empire, he invited the Tripitaka Master Buddhayaśas of Kāśmīra to translate one part of the Vinaya in forty-five fascicles into Chinese.",
        "source": "T01n0001_001:0001a27_19"
    },
    {
        "source_sentence": "十四年訖。",
        "translation": "It was completed in fourteen years.",
        "source": "T01n0001_001:0001a29_20"
    },
    {
        "source_sentence": "十五年歲次昭陽赤奮若，出此《長阿含》訖。",
        "translation": "In the fifteenth year of Zhao Yang's reign, he produced this Longer Āgama scripture to complete it.",
        "source": "T01n0001_001:0001b01_0"
    },
    {
        "source_sentence": "涼州沙門佛念為譯，秦國道士道含筆受。",
        "translation": "It was translated by the ascetic Buddha Mindful, a monk of Liangzhou; it was accepted by Daohan, a Buddhist monk of the state of Qin.",
        "source": "T01n0001_001:0001b02_0"
    },
    {
        "source_sentence": "時，集京夏名勝沙門，於第校定，恭承法言，敬受無差，蠲華崇朴，務存聖旨。",
        "translation": "At that time the most renowned śramaṇas of the capital were assembled in the assembly. They studied and mastered the Buddhist teachings with reverence, respectfully following the words of the Dharma; they accepted all the teachings without exception. They adorned themselves with flowers and cherished simplicity to preserve the holy teachings.",
        "source": "T01n0001_001:0001b02_1"
    },
    {
        "source_sentence": "余以嘉遇猥參聽次，雖無翼善之功，而預親承之末，故略記時事，以示來賢焉。",
        "translation": "Although there is no merit of virtuous deeds, I foresee the end of my ancestor’s life. For this reason I will record briefly the events of the past and present in order to show the future wise ones who have come here.",
        "source": "T01n0001_001:0001b04_2"
    },
    {
        "source_sentence": "佛說長阿含經卷第一",
        "translation": "Foshuo Chang ahan jing jing, vol. 1",
        "source": "T01n0001_001:0001b08_0"
    },
    {
        "source_sentence": "後秦弘始年佛陀耶舍共竺佛念譯",
        "translation": "Translated by Zhu Fonian at Buddhayaśas in the Hongshi year of the Later Qin dynasty",
        "source": "T01n0001_001:0001b10_0"
    },
    {
        "source_sentence": "（一）第一分初大本經第一",
        "translation": "(1) The First Part of the First Part of the Great Scripture",
        "source": "T01n0001_001:0001b11_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛在舍衛國祇樹花林窟，與大比丘眾千二百五十人俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Jeta’s Grove Cave in Sāvatthī, accompanied by one thousand two hundred and fifty bhikṣus.",
        "source": "T01n0001_001:0001b12_0"
    },
    {
        "source_sentence": "時，諸比丘於乞食後集花林堂，各共議言：「諸賢比丘！",
        "translation": "The monks then gathered in the flower-forest hall after they had begged for food and each discussed it together, saying, Good monks!",
        "source": "T01n0001_001:0001b13_1"
    },
    {
        "source_sentence": "唯無上尊為最奇特，神通遠達，威力弘大，乃知過去無數諸佛，入於涅槃，",
        "translation": "Only the supreme honored one is most marvelous. His transcendent powers are far-reaching and his authority great. He knows that innumerable buddhas of the past entered nirvana.",
        "source": "T01n0001_001:0001b15_0"
    },
    {
        "source_sentence": "斷諸結使，消滅戱論。",
        "translation": "They cut off the bonds and tendencies, extinguishing disputes and arguments.",
        "source": "T01n0001_001:0001b16_1"
    },
    {
        "source_sentence": "又知彼佛劫數多少，名號、姓字，所生種族，其所飲食，壽命脩短，所更苦樂。",
        "translation": "They also know the duration of those buddhas’ kalpas, their names and surnames, the tribes they were born in, the food and drink they consumed, the short life spans [of those buddhas], and the various forms of suffering and happiness they experienced.",
        "source": "T01n0001_001:0001b17_2"
    },
    {
        "source_sentence": "又知彼佛有如是戒，有如是法，有如是慧，有如是解，有如是住。",
        "translation": "They also know that the Buddha has such-and-such morality, such-and-such doctrine, such-and-such wisdom, such-and-such understanding, and such-and-such abiding.",
        "source": "T01n0001_001:0001b19_0"
    },
    {
        "source_sentence": "云何，諸賢！",
        "translation": "What do you think, venerables?",
        "source": "T01n0001_001:0001b20_1"
    },
    {
        "source_sentence": "如來為善別法性，知如是事，為諸天來語，乃知此事？」",
        "translation": "The Tathāgata knows such things for the sake of good discriminating the Dharma nature and knows them for the sake of gods who come to speak, so he knows them.",
        "source": "T01n0001_001:0001b20_2"
    },
    {
        "source_sentence": "爾時，世尊在閑靜處，天耳清淨，聞諸比丘作如是議，即從座起，詣花林堂，",
        "translation": "At that time, the World-honored One was staying in a secluded place with his divine ears pure and genuine. Hearing the bhikṣus’ discussion like this, he rose from his seat and proceeded to the flower-forest hall.",
        "source": "T01n0001_001:0001b22_0"
    },
    {
        "source_sentence": "就座而坐。",
        "translation": "He took his seat and sat down.",
        "source": "T01n0001_001:0001b23_1"
    },
    {
        "source_sentence": "爾時，世尊知而故問，謂：「諸比丘！",
        "translation": "Knowing this, the Bhagavān then asked deliberately, saying, Monks!",
        "source": "T01n0001_001:0001b24_2"
    },
    {
        "source_sentence": "汝等集此，何所語議？」",
        "translation": "What have you gathered here to discuss?",
        "source": "T01n0001_001:0001b24_3"
    },
    {
        "source_sentence": "時，諸比丘具以事答。",
        "translation": "The monks then answered with a detailed explanation of the matter.",
        "source": "T01n0001_001:0001b25_4"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「善哉！",
        "translation": "It was then that the Bhagavān addressed the monks, Good!",
        "source": "T01n0001_001:0001b25_5"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T01n0001_001:0001b26_6"
    },
    {
        "source_sentence": "汝等以平等信，出家修道，諸所應行，凡有二業：一曰賢聖講法，二曰賢聖默然。",
        "translation": "Because of your equal faith, you renounced the householder’s life and practiced Buddhism. There are two kinds of deeds that should be done by everyone: first, preaching the Dharma to the wise and saintly disciples; and second, remaining silent while the wise and saintly disciples were engaged in meditation.",
        "source": "T01n0001_001:0001b26_7"
    },
    {
        "source_sentence": "汝等所論，正應如是。",
        "translation": "This is precisely how you should discuss it.",
        "source": "T01n0001_001:0001b28_8"
    },
    {
        "source_sentence": "如來神通，威力弘大，盡知過去無數劫事，以能善解法性故知，亦以諸天來語故知。」",
        "translation": "The Tathāgata's supernormal powers are so vast and powerful that he knows all the events of countless eons in the past because he can well understand the essence of the Dharma, and he knows them because he hears the words of the gods.",
        "source": "T01n0001_001:0001b28_9"
    },
    {
        "source_sentence": "「比丘集法堂，　　講說賢聖論；",
        "translation": "The bhikṣus assembled in the assembly hall of the Dharma And preached the theories of the wise and holy.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　如來處靜室，　　天耳盡聞知。",
        "translation": "The Tathāgata lives in a secluded room, And his divine ears hear and know all.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　佛日光普照，　　分別法界義；",
        "translation": "The Buddha’s sunlight illumines everywhere, Discriminating the meaning of the realm of reality.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　亦知過去事，　　三佛般泥洹。",
        "translation": "They also know the events of the past, The parinirvāṇa of the Three Buddhas.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　名號、姓、種族，　　受生分亦知；",
        "translation": "Names, castes, clans, and tribesmen They also know the factors of birth.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　隨彼之處所，　　淨眼皆記之。",
        "translation": "Wherever they are, The pure eye remembers them all.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　諸天大威力，　　容貌甚端嚴；",
        "translation": "The celestial beings are great and mighty, With very dignified appearance.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　亦來啟告我，　　三佛般泥洹。",
        "translation": "They also came to tell me that the three buddhas had entered parinirvāṇa.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　記生、名號、姓，　　哀鸞音盡知；",
        "translation": "He remembered his birth, name, and surname, And knew the sound of how sorrowful the voice of the Teaching was.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "　無上天人尊，　　記於過去佛。」",
        "translation": "The unsurpassed honored one of gods and humans remembers the past buddhas.",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "佛時頌曰：又告諸比丘：「汝等欲聞如來識宿命智，知於過去諸佛因緣不？",
        "translation": "The Buddha then spoke in verse, Again, he told the monks, Do you want to hear that the Tathāgata knows the knowledge of past lives and knows the causes and conditions of past buddhas?",
        "source": "T01n0001_001:0001c01_10"
    },
    {
        "source_sentence": "我當說之。」",
        "translation": "I will explain it.",
        "source": "T01n0001_001:0001c14_11"
    },
    {
        "source_sentence": "時，諸比丘白言：「世尊！",
        "translation": "The monks then said, Bhagavān!",
        "source": "T01n0001_001:0001c14_12"
    },
    {
        "source_sentence": "今正是時，願樂欲聞。",
        "translation": "Now is precisely the right time, and I wish to hear it.",
        "source": "T01n0001_001:0001c15_13"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T01n0001_001:0001c15_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_001:0001c15_15"
    },
    {
        "source_sentence": "以時講說，當奉行之。」",
        "translation": "I'll explain it at the right time, and I'll follow it.",
        "source": "T01n0001_001:0001c16_0"
    },
    {
        "source_sentence": "佛告諸比丘：「諦聽！",
        "translation": "The Buddha told the monks, Listen closely!",
        "source": "T01n0001_001:0001c16_1"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T01n0001_001:0001c16_2"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。」",
        "translation": "Consider it well, and I will explain it for you in a discriminating way.",
        "source": "T01n0001_001:0001c17_3"
    },
    {
        "source_sentence": "時，諸比丘受教而聽。",
        "translation": "The monks then accepted the teaching and listened.",
        "source": "T01n0001_001:0001c17_4"
    },
    {
        "source_sentence": "佛告諸比丘：「過去九十一劫，時，世有佛名毘婆尸如來、至真，出現于世。",
        "translation": "The Buddha told the monks, Ninety-one eons ago, there was a buddha in the world named Vipaśyin Tathāgata and Arhat who appeared in the world.",
        "source": "T01n0001_001:0001c19_0"
    },
    {
        "source_sentence": "復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0001_001:0001c20_1"
    },
    {
        "source_sentence": "過去三十一劫，有佛名尸棄如來、至真，出現於世。",
        "translation": "In the past, thirty-one eons ago, there was a buddha named Śikhin Tathāgata and Arhat who appeared in the world.",
        "source": "T01n0001_001:0001c20_2"
    },
    {
        "source_sentence": "復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0001_001:0001c22_3"
    },
    {
        "source_sentence": "即彼三十一劫中，有佛名毘舍婆如來、至真，出現於世。",
        "translation": "In that thirty-one world ages, there was a buddha named Vaiśravaṇa Tathāgata, the supreme truth, who appeared in the world.",
        "source": "T01n0001_001:0001c22_4"
    },
    {
        "source_sentence": "復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0001_001:0001c23_5"
    },
    {
        "source_sentence": "此賢劫中有佛名拘樓孫，又名拘那含，又名迦葉。",
        "translation": "In this good eon, there's a Buddha named Krakucchanda, another named Kanakamuni, and another named Kāśyapa.",
        "source": "T01n0001_001:0001c23_6"
    },
    {
        "source_sentence": "我今亦於賢劫中成最正覺。」",
        "translation": "Now, I'll also become the most perfectly enlightened in the good eon.",
        "source": "T01n0001_001:0001c25_7"
    },
    {
        "source_sentence": "「過九十一劫，　　有毘婆尸佛；",
        "translation": "For ninety-one kalpas there will be the buddha Vipaśyin.",
        "source": "T01n0001_001:0001c25_8"
    },
    {
        "source_sentence": "　次三十一劫，　　有佛名尸棄；",
        "translation": "In the next thirty-one eons, there will be a buddha named Śikhin.",
        "source": "T01n0001_001:0001c25_8"
    },
    {
        "source_sentence": "　即於彼劫中，　　毘舍如來出。",
        "translation": "In that same kalpa, the Tathāgata Vaiśravaṇa emerged.",
        "source": "T01n0001_001:0001c25_8"
    },
    {
        "source_sentence": "　今此賢劫中，　　無數那維歲；",
        "translation": "In this present world age of the wise, There will be innumerable myriadstical years.",
        "source": "T01n0001_001:0001c25_8"
    },
    {
        "source_sentence": "　有四大仙人，　　愍眾生故出：",
        "translation": "There are four great sages Who, out of pity for sentient beings, Go forth like this:",
        "source": "T01n0001_001:0001c25_8"
    },
    {
        "source_sentence": "　拘樓孫、那含、　　迦葉、釋迦文。",
        "translation": "Krakucchanda, Nāgârjuna, Kāśyapa, and Śākyamuni.",
        "source": "T01n0001_001:0001c25_8"
    },
    {
        "source_sentence": "佛時頌曰：「汝等當知，毘婆尸佛時，人壽八萬歲。",
        "translation": "The Buddha then composed a verse, You should know that at the time of Vipaśyin Buddha the human life span was eighty thousand years.",
        "source": "T01n0001_001:0001c25_8"
    },
    {
        "source_sentence": "尸棄佛時，人壽七萬歲。",
        "translation": "At the time of Śikhin Buddha the human life span was seventy thousand years in length.",
        "source": "T01n0001_001:0002a04_9"
    },
    {
        "source_sentence": "毘舍婆佛時，人壽六萬歲。",
        "translation": "At the time of Vaiśravaṇa Buddha the human life span was sixty thousand years in length.",
        "source": "T01n0001_001:0002a05_10"
    },
    {
        "source_sentence": "拘樓孫佛時，人壽四萬歲。",
        "translation": "At the time of Krakucchanda Buddha, the human life span was forty thousand years.",
        "source": "T01n0001_001:0002a05_11"
    },
    {
        "source_sentence": "拘那含佛時，人壽三萬歲。",
        "translation": "At the time of Kanakamuni Buddha, the human life span was thirty thousand years.",
        "source": "T01n0001_001:0002a06_12"
    },
    {
        "source_sentence": "迦葉佛時，人壽二萬歲。",
        "translation": "At the time of Kāśyapa Buddha the human life span was twenty thousand years in length.",
        "source": "T01n0001_001:0002a07_13"
    },
    {
        "source_sentence": "我今出世，人壽百歲，少出多減。」",
        "translation": "Now that I've emerged in the world, the human life span will be a hundred years, with fewer and fewer people emerging.",
        "source": "T01n0001_001:0002a07_14"
    },
    {
        "source_sentence": "「毘婆尸時人，　　壽八萬四千；",
        "translation": "The people of Vipaśyin had a life span of eighty-four thousand years.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "　尸棄佛時人，　　壽命七萬歲；",
        "translation": "The Buddha Śikhin people had a life span of seventy thousand years.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "　毘舍婆時人，　　壽命六萬歲；",
        "translation": "The people of Vaiśravaṇa had a life span of sixty thousand years.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "　拘樓孫時人，　　壽命四萬歲；",
        "translation": "The people of Krakucchanda had a life span of forty thousand years.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "　拘那含時人，　　壽命三萬歲；",
        "translation": "The people of Kanakamuni had a life span of thirty thousand years.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "　迦葉佛時人，　　壽命二萬歲；",
        "translation": "The people of the time of Kāśyapa Buddha had a life span of twenty thousand years.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "　如我今時人，　　壽命不過百。",
        "translation": "Like the people of my present age, our life span is less than a hundred years.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "佛時頌曰：「毘婆尸佛，出剎利種，姓拘利若；",
        "translation": "The Buddha then continued in verse: Vipaśyin Buddha came from the kṣatriya class, bearing the family name of Kauṇḍinya.",
        "source": "T01n0001_001:0002a08_15"
    },
    {
        "source_sentence": "尸棄佛、毘舍婆佛，種、姓亦爾。",
        "translation": "Śikhin Buddha and Vaiśravaṇa Buddha are the same in kind and caste.",
        "source": "T01n0001_001:0002a16_16"
    },
    {
        "source_sentence": "拘樓孫佛，出婆羅門種，姓迦葉；",
        "translation": "Krakucchanda Buddha came from the brahman class, bearing the family name Kāśyapa.",
        "source": "T01n0001_001:0002a17_17"
    },
    {
        "source_sentence": "拘那含佛、迦葉佛，種、姓亦爾。",
        "translation": "Kanakamuni Buddha and Kāśyapa Buddha are the same in kind and caste.",
        "source": "T01n0001_001:0002a18_18"
    },
    {
        "source_sentence": "我今如來、至真，出剎利種，姓名曰瞿曇。」",
        "translation": "Now, as a Tathāgata and Arhat, I'm of the kṣatriya caste named Gautama.",
        "source": "T01n0001_001:0002a18_19"
    },
    {
        "source_sentence": "「毘婆尸如來，　　尸棄、毘舍婆，",
        "translation": "Vipaśyin Tathāgata, Śikhin and Vaiśravaṇa",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "　此三等正覺，　　出拘利若姓。",
        "translation": "These three Awakened Ones come from the family of Kauṇḍinya.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "　自餘三如來，　　出于迦葉姓。",
        "translation": "The other three tathāgatas came from the Kāśyapa family.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "　我今無上尊，　　導御諸眾生；",
        "translation": "Now I am the supreme honored one, guiding sentient beings.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "　天人中第一，　　勇猛姓瞿曇。",
        "translation": "Among the gods and humans, he's the best among them, with the courageous family name Gautama.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "　前三等正覺，　　出於剎利種；",
        "translation": "The first three perfect enlightened ones Came from the kṣatriya class.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "　其後三如來，　　出婆羅門種；",
        "translation": "The last three tathāgatas came from the brāhmaṇa class.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "　我今無上尊，　　勇猛出剎利。",
        "translation": "Now, I'm the unsurpassed honored one who courageously emerges from the kṣatriya.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "佛時頌曰：「毘婆尸佛坐波波羅樹下成最正覺，尸棄佛坐分陀利樹下成最正覺，",
        "translation": "The Buddha then composed the following verse: Vipaśyin Buddha sat at the foot of a palm tree and attained perfect enlightenment. Śikhin Buddha sat at the foot of a puṇḍarīka tree and attained perfect enlightenment.",
        "source": "T01n0001_001:0002a19_20"
    },
    {
        "source_sentence": "毘舍婆佛坐娑羅樹下成最正覺，拘樓孫佛坐尸利沙樹下成最正覺，拘那含佛坐烏暫婆羅門樹下成最正覺，",
        "translation": "Viśvabhū Buddha sat under a sal tree and became the most perfectly enlightened; Krakucchanda Buddha sat under a śirīsā tree and became the most perfectly enlightened; Kanakamuni Buddha sat under an udumbara tree and became the most perfectly enlightened.",
        "source": "T01n0001_001:0002a29_21"
    },
    {
        "source_sentence": "迦葉佛坐尼拘律樹下成最正覺。",
        "translation": "Kāśyapa Buddha sat under a nyagrodha tree and became the most perfectly enlightened.",
        "source": "T01n0001_001:0002b03_22"
    },
    {
        "source_sentence": "我今如來、至真，坐鉢多樹下成最正覺。」",
        "translation": "Now, as the Tathāgata and Arhat, I've sat under a palm tree to become the most perfectly enlightened.",
        "source": "T01n0001_001:0002b04_23"
    },
    {
        "source_sentence": "「毘婆尸如來，　　往詣波羅樹；",
        "translation": "Vipaśyin Tathāgata approached the prātimokṣatriya tree.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　即於彼處所，　　得成最正覺。",
        "translation": "That's where he attains the most perfect awakening.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　尸棄分陀樹，　　成道滅有原。",
        "translation": "Śikhin discards the puṇḍarīka tree, and there's a plain for the cessation of enlightenment.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　毘舍婆如來，　　坐娑羅樹下；",
        "translation": "Viśvabhū Tathāgata sat under a śāla tree.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　獲解脫知見，　　神足無所礙。",
        "translation": "Attaining the knowledge and vision of liberation, their spiritual abilities are unobstructed.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　拘樓孫如來，　　坐尸利沙樹；",
        "translation": "Krakucchanda Tathāgata sat under a śirīsā tree.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　一切智清淨，　　無染無所著。",
        "translation": "All knowledge is pure, Undefiled and unattached.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　拘那含牟尼，　　坐烏暫樹下；",
        "translation": "Kanakamuni sat under an udumbara tree.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　即於彼處所，　　滅諸貪憂惱。",
        "translation": "Wherever they are, He extinguishes their cravings and sorrow.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　迦葉如來坐，　　尼拘樓樹下；",
        "translation": "The Tathāgata Kassapa was seated Under a nyagrodha tree.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　即於彼處所，　　除滅諸有本。",
        "translation": "That is, in that place, he removes the root of existence and extinguishes it.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　我今釋迦文，　　坐於鉢多樹。",
        "translation": "Now, I, Śākyamuni, am sitting under a palm tree.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　如來十力尊，　　斷滅諸結使；",
        "translation": "The ten powers of the enlightened are honored as having cut all bonds and tendencies.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　摧伏眾魔怨，　　在眾演大明。",
        "translation": "To subdue the enemies of all demons, he teaches great insight in the congregation.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　七佛精進力，　　放光滅闇冥；",
        "translation": "By the power of seven buddhas’ effort They illumine and extinguish darkness.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "　各各坐諸樹，　　於中成正覺。",
        "translation": "Each of them sat in a tree And realized enlightenment there.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "佛時頌曰：「毘婆尸如來三會說法，初會弟子有十六萬八千人，二會弟子有十萬人，",
        "translation": "The Buddha then composed the following verse: Vipaśyin Tathāgata preached the Dharma in three assemblies. At the first assembly there were sixty-eight thousand disciples, while at the second assembly there were one hundred and ten thousand disciples.",
        "source": "T01n0001_001:0002b05_24"
    },
    {
        "source_sentence": "三會弟子有八萬人。",
        "translation": "There were 80,000 disciples in the three assemblies.",
        "source": "T01n0001_001:0002b23_25"
    },
    {
        "source_sentence": "尸棄如來亦三會說法，初會弟子有十萬人，二會弟子有八萬人，三會弟子有七萬人。",
        "translation": "Śikhin Tathāgata also taught the Dharma in three assemblies. The first assembly had 100,000 disciples; the second assembly had 80,000 disciples; and the third assembly had 70,000 disciples.",
        "source": "T01n0001_001:0002b24_26"
    },
    {
        "source_sentence": "毘舍婆如來二會說法，初會弟子有七萬人，次會弟子有六萬人。",
        "translation": "Viśvabhū Tathāgata taught the Dharma in two assemblies, with 70,000 disciples at the first assembly and 60,000 disciples at the second assembly.",
        "source": "T01n0001_001:0002b26_27"
    },
    {
        "source_sentence": "拘樓孫如來一會說法，弟子四萬人。",
        "translation": "Krakucchanda Tathāgata taught the Dharma in one assembly with 40,000 disciples.",
        "source": "T01n0001_001:0002b27_28"
    },
    {
        "source_sentence": "拘那含如來一會說法，弟子三萬人。",
        "translation": "Kanakamuni Tathāgata taught the Dharma in one assembly with 30,000 disciples.",
        "source": "T01n0001_001:0002b28_29"
    },
    {
        "source_sentence": "迦葉如來一會說法，弟子二萬人。",
        "translation": "Kāśyapa Tathāgata taught the Dharma in one assembly with twenty thousand disciples.",
        "source": "T01n0001_001:0002b29_30"
    },
    {
        "source_sentence": "我今一會說法，弟子千二百五十人。」",
        "translation": "Now, I'll teach the Dharma in one assembly with 1,200 disciples.",
        "source": "T01n0001_001:0002c01_31"
    },
    {
        "source_sentence": "「毘婆尸名觀，　　智慧不可量；",
        "translation": "Vipaśyin’s name is contemplation, And his insight is immeasurable.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　遍見無所畏，　　三會弟子眾。",
        "translation": "They see everywhere without fear, and the three assemblies of disciples are assembled.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　尸棄光無動，　　能滅諸結使；",
        "translation": "The light of cessation is unshakable, Able to extinguish all bonds and tendencies.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　無量大威德，　　無能測量者；",
        "translation": "Innumerable great and mighty virtues, No one can measure them.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　彼佛亦三會，　　弟子普共集。",
        "translation": "That Buddha also had three assemblies, And his disciples assembled together.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　毘舍婆斷結，　　大仙人要集；",
        "translation": "Vaiśravaṇa cut off the fetters, and the great sages assembled.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　名聞於諸方，　　妙法大名稱；",
        "translation": "They are renowned in all directions, Greatly renowned for the sublime Teaching.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　二會弟子眾，　　普演深奧義。",
        "translation": "The disciples of the second assembly Expound the profound and mysterious meaning everywhere.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　拘樓孫一會，　　哀愍療諸苦；",
        "translation": "Krakucchanda’s grandchildren attended one assembly, Healing the suffering with compassion.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　導師化眾生，　　一會弟子眾。",
        "translation": "He guides and transforms sentient beings, gathering the disciples in one assembly.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　拘那含如來，　　無上亦如是；",
        "translation": "Kanakamuni Tathāgata Is likewise the Unexcelled One.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　紫磨金色身，　　容貌悉具足；",
        "translation": "Their bodies are purplish-gold in color, Endowed with embellishments of great beauty.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　一會弟子眾，　　普演微妙法。",
        "translation": "In one assembly of disciples They teach the subtle Dharma everywhere.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　迦葉一一毛，　　一心無亂想；",
        "translation": "Each hair of Kāśyapa’s hair Has no ideation of confusion in his mind.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　一語不煩重，　　一會弟子眾。",
        "translation": "A single word doesn't cause trouble, and one assembly of disciples.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　能仁意寂滅，　　釋種沙門上；",
        "translation": "Able to pacify the mind with kindness, he is a śramaṇa of the Śākya clan.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　天中天最尊，　　我一會弟子。",
        "translation": "Among the gods, the most honored among gods, I am the only disciple in my assembly.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　彼會我現義，　　演布清淨教；",
        "translation": "In that assembly I manifested my teaching, Explaining pure doctrine.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　心常懷歡喜，　　漏盡盡後有。",
        "translation": "Their minds always rejoice, and their contaminants will be ended in the future.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　毘婆、尸棄三，　　毘舍婆佛二，",
        "translation": "Vipaśyin and Śikhin are threefold; Vaiśravaṇa Buddha is twofold.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "　四佛各各一，　　仙人會演說。",
        "translation": "Each of the four buddhas is one: The ṛṣi assembly explains.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "佛時頌曰：「時，毘婆尸佛有二弟子：一名騫茶，二名提舍，諸弟子中最為第一。",
        "translation": "The Buddha then composed a verse, saying, At the time, Vipaśyin Buddha had two disciples, one named Kauṣṭhila and two named Tiṣya, who were the best among his disciples.",
        "source": "T01n0001_001:0002c01_32"
    },
    {
        "source_sentence": "尸棄佛有二弟子：一名阿毘浮，二名三婆婆，諸弟子中最為第一。",
        "translation": "Śikhin Buddha had two disciples: the first disciple Abhibhū (Abhidharma) and the second, Samantabhadra (Samapa), were the foremost among all the disciples.",
        "source": "T01n0001_001:0002c25_33"
    },
    {
        "source_sentence": "毘舍婆佛有二弟子，一名扶遊，二名鬱多摩，諸弟子中最為第一。",
        "translation": "Vaiśravaṇa Buddha had two disciples, one named Fuyao and the other uttama, who were the foremost among his disciples.",
        "source": "T01n0001_001:0002c27_34"
    },
    {
        "source_sentence": "拘樓孫佛有二弟子，一名薩尼，二名毘樓，諸弟子中最為第一。",
        "translation": "Krakucchanda Buddha had two disciples, one named Sāriputta and the other Virūḍhaka, who were the foremost among all the disciples.",
        "source": "T01n0001_001:0002c28_35"
    },
    {
        "source_sentence": "拘那含佛有二弟子：一名舒槃那，二名鬱多樓，諸弟子中最為第一。",
        "translation": "Kanakamuni Buddha had two disciples, one named Shupanna and the other Uttarakuru, who were the best among his disciples.",
        "source": "T01n0001_001:0003a01_36"
    },
    {
        "source_sentence": "迦葉佛有二弟子，一名提舍，二名婆羅婆，諸弟子中最為第一。",
        "translation": "Kāśyapa Buddha had two disciples, one named Tiṣya and the other Bhārava, who were the foremost among his disciples.",
        "source": "T01n0001_001:0003a03_37"
    },
    {
        "source_sentence": "今我二弟子，一名舍利弗，二名目揵連，諸弟子中最為第一。」",
        "translation": "Now, my two disciples, one named Śāriputra and the other named Maudgalyāyana, are the best among the disciples.",
        "source": "T01n0001_001:0003a04_38"
    },
    {
        "source_sentence": "「騫茶、提舍等，　　毗婆尸弟子；",
        "translation": "Kaṇṭhaka and Tiṣya, the disciples of Vipaśyin.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "　阿毗浮、三婆，　　尸棄佛弟子。",
        "translation": "Abhidharma and Samantabhadra were disciples of Śikhin Buddha.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "　扶遊、鬱多摩，　　弟子中第一，",
        "translation": "Fuyao and uttama were the first among the disciples.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "　二俱降魔怨，　　毗舍婆弟子。",
        "translation": "Two, they both subdue Māra's enemies, the disciples of Viśvabhū.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "　薩尼、毗樓等，　　拘樓孫弟子；",
        "translation": "Sāriputta and Virūḍhaka were the disciples of Krakucchanda’s grandchildren.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "　舒槃、鬱多樓，　　拘那含弟子；",
        "translation": "Śubhavyūha and Uttarakuru, disciples of Kanakamuni.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "　提舍、婆羅婆，　　迦葉佛弟子；",
        "translation": "Tiṣya and Vārāṇasī were disciples of Kāśyapa Buddha.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "　舍利弗、目連，　　是我第一子。",
        "translation": "Śāriputra and Maudgalyāyana are my first child.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "佛時頌曰：「毗婆尸佛有執事弟子，名曰無憂。",
        "translation": "The Buddha then composed a verse, saying, Vipaśyin Buddha has an attendant disciple named Sadnessless.",
        "source": "T01n0001_001:0003a06_39"
    },
    {
        "source_sentence": "尸棄佛執事弟子，名曰忍行。",
        "translation": "Śikhin Buddha's disciple who serves him, named the practice of forbearance.",
        "source": "T01n0001_001:0003a15_40"
    },
    {
        "source_sentence": "毗舍婆佛有執事弟子，名曰寂滅。",
        "translation": "Viśvabhū Buddha had a disciple in charge, named Nirgrantha.",
        "source": "T01n0001_001:0003a16_41"
    },
    {
        "source_sentence": "拘樓孫佛有執事弟子，名曰善覺。",
        "translation": "Krakucchanda Buddha had an attendant disciple named Sunetra.",
        "source": "T01n0001_001:0003a17_42"
    },
    {
        "source_sentence": "拘那含佛有執事弟子，名曰安和。",
        "translation": "Kanakamuni Buddha had an attendant disciple named Anhe.",
        "source": "T01n0001_001:0003a18_43"
    },
    {
        "source_sentence": "迦葉佛有執事弟子，名曰善友。",
        "translation": "Kāśyapa Buddha had an attendant disciple named Sunetra.",
        "source": "T01n0001_001:0003a19_0"
    },
    {
        "source_sentence": "我執事弟子，名曰阿難。」",
        "translation": "My disciple who serves me is called Ānanda.",
        "source": "T01n0001_001:0003a19_1"
    },
    {
        "source_sentence": "「無憂與忍行，　　寂滅及善覺，",
        "translation": "The absence of sorrow and the practice of forbearance, tranquility and good awakening,",
        "source": "T01n0001_001:0003a20_2"
    },
    {
        "source_sentence": "　安和、善友等，　　阿難為第七。",
        "translation": "Ānanda is the seventh: peace and harmony, good companions, etc.",
        "source": "T01n0001_001:0003a20_2"
    },
    {
        "source_sentence": "　此為佛侍者，　　具足諸義趣；",
        "translation": "This is the Buddha’s attendant, Endowed with all meanings.",
        "source": "T01n0001_001:0003a20_2"
    },
    {
        "source_sentence": "　晝夜無放逸，　　自利亦利他。",
        "translation": "Day and night, they don’t indulge in carelessness, Benefiting themselves and others.",
        "source": "T01n0001_001:0003a20_2"
    },
    {
        "source_sentence": "　此七賢弟子，　　侍七佛左右；",
        "translation": "These seven disciples of virtue served the seven buddhas To their right and left.",
        "source": "T01n0001_001:0003a20_2"
    },
    {
        "source_sentence": "　歡喜而供養，　　寂然歸滅度。",
        "translation": "Rejoicing and making offerings, they quietly return to nirvāṇa.",
        "source": "T01n0001_001:0003a20_2"
    },
    {
        "source_sentence": "佛時頌曰：「毗婆尸佛有子，名曰方膺。",
        "translation": "The Buddha then composed a verse, saying, Vipaśyin Buddha had a son named Fangying.",
        "source": "T01n0001_001:0003a20_2"
    },
    {
        "source_sentence": "尸棄佛有子，名曰無量。",
        "translation": "Śikhin Buddha had a son named Immeasurable.",
        "source": "T01n0001_001:0003a27_3"
    },
    {
        "source_sentence": "毗舍婆佛有子，名曰妙覺。",
        "translation": "Viśvabhū Buddha had a son named Marvelous Enlightenment.",
        "source": "T01n0001_001:0003a28_4"
    },
    {
        "source_sentence": "拘樓孫佛有子，名曰上勝。",
        "translation": "Krakucchanda Buddha had a son named Jōshō.",
        "source": "T01n0001_001:0003a28_5"
    },
    {
        "source_sentence": "拘那含佛有子，名曰導師。",
        "translation": "Kanakamuni Buddha had a son named Daoshi.",
        "source": "T01n0001_001:0003a29_6"
    },
    {
        "source_sentence": "迦葉佛有子，名曰集軍。",
        "translation": "Kāśyapa Buddha had a son named Jijun.",
        "source": "T01n0001_001:0003b01_7"
    },
    {
        "source_sentence": "今我有子，名曰羅睺羅。」",
        "translation": "Now, I have a son named Rāhula.",
        "source": "T01n0001_001:0003b01_8"
    },
    {
        "source_sentence": "「方膺、無量子，　　妙覺及上勝，",
        "translation": "“Fangying, immeasurable sons, Marvelous enlightenment and supreme excellence.",
        "source": "T01n0001_001:0003b02_9"
    },
    {
        "source_sentence": "　導師、集軍等，　　羅睺羅第七，",
        "translation": "The Guide, the Armed Forces, etc., are the seventh rank of Rāhula.",
        "source": "T01n0001_001:0003b02_9"
    },
    {
        "source_sentence": "　此諸豪貴子，　　紹繼諸佛種；",
        "translation": "These noble sons Inherited the lineage of the buddhas.",
        "source": "T01n0001_001:0003b02_9"
    },
    {
        "source_sentence": "　愛法好施惠，　　於聖法無畏。",
        "translation": "They love the Dharma, like generosity, and have no fear of the noble Dharma.",
        "source": "T01n0001_001:0003b02_9"
    },
    {
        "source_sentence": "佛時頌曰：「毗婆尸佛父名槃頭，剎利王種，母名槃頭婆提，王所治城名曰槃頭婆提。」",
        "translation": "The Buddha then composed a verse, saying, Vipaśyin Buddha's father's name was Pāṇḍuo, the king of the kṣatriyas; his mother's name was Pāṇḍuvādi; and the city ruled by the king was called Pāṇḍuvādi.",
        "source": "T01n0001_001:0003b02_9"
    },
    {
        "source_sentence": "「遍眼父槃頭，　　母槃頭婆提；",
        "translation": "The pervasive-eyed one’s father is Pantou (i.e., Buddha), And his mother is Pantoubati (i.e., Buddhabhadra).",
        "source": "T01n0001_001:0003b08_10"
    },
    {
        "source_sentence": "　槃頭婆提城，　　佛於中說法。",
        "translation": "In the city of Padmavṛṣṭi The Buddha preached the Dharma there.",
        "source": "T01n0001_001:0003b08_10"
    },
    {
        "source_sentence": "佛時頌曰：「尸棄佛父名曰明相，剎利王種，母名光曜，王所治城名曰光相。」",
        "translation": "The Buddha then composed a verse, saying, Śikhin Buddha's father's name was Mingxiang, the king of the kṣatriyas, his mother's name was Guangyao, and the city ruled by the king was called Guangxiang.",
        "source": "T01n0001_001:0003b08_10"
    },
    {
        "source_sentence": "「尸棄父明相，　　母名曰光曜，",
        "translation": "Śikhin renounced his father’s good name and His mother’s name was Ābhāsvara.",
        "source": "T01n0001_001:0003b12_11"
    },
    {
        "source_sentence": "　於明相城中，　　威德降外敵。",
        "translation": "In the city of Mingxiang, his authoritative power subdues external enemies.",
        "source": "T01n0001_001:0003b12_11"
    },
    {
        "source_sentence": "佛時頌曰：「毗舍婆佛父名善燈，剎利王種，母名稱戒，王所治城名曰無喻。」",
        "translation": "The Buddha then composed a verse, saying, Viśvabhū's father's name was Sunetra, the king of the kṣatriyas, his mother's name was Vaiśravaṇa, and the city ruled by the king was called Wumai.",
        "source": "T01n0001_001:0003b12_11"
    },
    {
        "source_sentence": "「毗舍婆佛父，　　善燈剎利種；",
        "translation": "Viśvabhū Buddha’s father, Sunetra Bodhisattva (Śakra), was born in the kṣatriya class.",
        "source": "T01n0001_001:0003b16_12"
    },
    {
        "source_sentence": "　母名曰稱戒，　　城名曰無喻。",
        "translation": "The mother’s name was Siṃhala and the city’s name Vimalakīrti.",
        "source": "T01n0001_001:0003b16_12"
    },
    {
        "source_sentence": "佛時頌曰：「拘樓孫佛父名祀得，婆羅門種，母名善枝，王名安和，隨王名故城名安和。」",
        "translation": "The Buddha then composed a verse, saying, Krakucchanda Buddha's father was named Śākyamuni, he was a brāhmaṇa by the name of Kālôdayin, his mother Sunetra, the king's name Anhe, and the old city's name Anhe after the king's name.",
        "source": "T01n0001_001:0003b16_12"
    },
    {
        "source_sentence": "「祀得婆羅門，　　母名曰善枝；",
        "translation": "“The goddess obtained a brāhmaṇa, Whose mother’s name was Sunetra.",
        "source": "T01n0001_001:0003b20_13"
    },
    {
        "source_sentence": "　王名曰安和，　　居在安和城。",
        "translation": "The king’s name was Anhe and He lived in the city of Anhe.",
        "source": "T01n0001_001:0003b20_13"
    },
    {
        "source_sentence": "佛時頌曰：「拘那含佛父名大德，婆羅門種，母名善勝，是時王名清淨，",
        "translation": "The Buddha then composed the following verse: Kanakamuni Buddha’s father’s name was Mahadatta. He was a brāhmaṇa by caste and his mother’s name was Shansheng (“Superior”).",
        "source": "T01n0001_001:0003b20_13"
    },
    {
        "source_sentence": "隨王名故城名清淨。」",
        "translation": "According to the king's name, the old city is called pure.",
        "source": "T01n0001_001:0003b25_14"
    },
    {
        "source_sentence": "「大德婆羅門，　　母名曰善勝；",
        "translation": "The great virtuous brāhmaṇa, whose mother’s name was Sunetra (i.e., Samantanetra).",
        "source": "T01n0001_001:0003b26_0"
    },
    {
        "source_sentence": "　王名曰清淨，　　居在清淨城。",
        "translation": "The king's name is Pure, and he lives in the pure city.",
        "source": "T01n0001_001:0003b26_0"
    },
    {
        "source_sentence": "佛時頌曰：「迦葉佛父名曰梵德，婆羅門種，母名曰財主，時王名汲毗，",
        "translation": "The Buddha then continued in verse: Kāśyapa Buddha’s father’s name was Brahmadatta. He was a brāhmaṇa by caste and his mother’s name was Vaiśravaṇa. At that time the king’s name was Kapilavastu.",
        "source": "T01n0001_001:0003b26_0"
    },
    {
        "source_sentence": "王所治城名波羅[木*奈]。」",
        "translation": "The city ruled by the king is called Vārāṇasī [munai].",
        "source": "T01n0001_001:0003c01_1"
    },
    {
        "source_sentence": "「梵德婆羅門，　　母名曰財主；",
        "translation": "The brahmin Brahmadeva (i.e., Samantanetra), a brāhmaṇa, His mother’s name was Prabhūtaratna.",
        "source": "T01n0001_001:0003c01_2"
    },
    {
        "source_sentence": "　時王名汲毗，　　在波羅[木*奈]城。",
        "translation": "The king of that time, named Kapilavastu, resided in the city of Benares.",
        "source": "T01n0001_001:0003c01_2"
    },
    {
        "source_sentence": "佛時頌曰：「我父名淨飯，剎利王種，母名大清淨妙，王所治城名迦毗羅衛。」",
        "translation": "The Buddha then spoke in verse, My father's name was Jīvaka, born of the royal family of the kṣatriyas, and my mother's name was Mahāprajāpatīṃdhara; the city ruled by the king was called Kapilavastu.",
        "source": "T01n0001_001:0003c01_2"
    },
    {
        "source_sentence": "「父剎利淨飯，　　母名大清淨，",
        "translation": "His father was the kṣatriya Śāriputra and his mother’s name was Maheśvara.",
        "source": "T01n0001_001:0003c06_3"
    },
    {
        "source_sentence": "　土廣民豐饒，　　我從彼而生。",
        "translation": "The land is vast and the people are prosperous, and I'm born from them.",
        "source": "T01n0001_001:0003c06_3"
    },
    {
        "source_sentence": "佛時頌曰：「此是諸佛因緣、名號、種族、所出生處，何有智者聞此因緣而不歡喜，",
        "translation": "The Buddha then continued in verse: These are the causes and conditions that give rise to buddhas, their names, clans, nations, and places where they are born. How could any wise person not rejoice when he hears these causes and conditions?",
        "source": "T01n0001_001:0003c06_3"
    },
    {
        "source_sentence": "起愛樂心？」",
        "translation": "give rise to the mind of desire?",
        "source": "T01n0001_001:0003c10_4"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「吾今欲以宿命智說過去佛事，汝欲聞不？」",
        "translation": "It was then that the Bhagavān addressed the monks, Now, I want to explain the past buddha-works of the Buddha with the knowledge of past lives, do you want to hear them?",
        "source": "T01n0001_001:0003c10_5"
    },
    {
        "source_sentence": "諸比丘對曰：「今正是時，願樂欲聞！」",
        "translation": "The monks replied, Now is the right time, wishing to hear it!",
        "source": "T01n0001_001:0003c12_6"
    },
    {
        "source_sentence": "佛告諸比丘：「諦聽！",
        "translation": "The Buddha told the monks, Listen closely!",
        "source": "T01n0001_001:0003c13_7"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T01n0001_001:0003c13_8"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T01n0001_001:0003c13_9"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T01n0001_001:0003c14_10"
    },
    {
        "source_sentence": "當知諸佛常法：毗婆尸菩薩從兜率天降神母胎，從右脇入，正念不亂。",
        "translation": "You should know the eternal teaching of the buddhas: The bodhisattva Vipaśyin descended from Tuṣita Heaven into his mother’s womb and entered it from her right side.",
        "source": "T01n0001_001:0003c14_11"
    },
    {
        "source_sentence": "當於爾時，地為震動，放大光明，普照世界，日月所不及處皆蒙大明，",
        "translation": "At that moment the earth trembled and emitted a great ray of light illuminating all the worlds, reaching as far as the sun and moon cannot reach.",
        "source": "T01n0001_001:0003c16_12"
    },
    {
        "source_sentence": "幽冥眾生，各相覩見，知其所趣。",
        "translation": "Sentient beings in the darkness saw each other and knew where they were headed.",
        "source": "T01n0001_001:0003c18_13"
    },
    {
        "source_sentence": "時，此光明復照魔宮，諸天、釋、梵、沙門、婆羅門及餘眾生普蒙大明，",
        "translation": "At that moment this ray of light illuminated the palace of the devil, and all the gods, Sakyans, Brahmās, śramaṇas, brāhmaṇas, as well as other sentient beings were also illumined.",
        "source": "T01n0001_001:0003c18_14"
    },
    {
        "source_sentence": "諸天光明自然不現。」",
        "translation": "The light of the gods naturally doesn't appear.",
        "source": "T01n0001_001:0003c20_15"
    },
    {
        "source_sentence": "「密雲聚虛空，　　電光照天下，",
        "translation": "dense clouds gathered in the sky, Lightning illumining the whole world.",
        "source": "T01n0001_001:0003c20_16"
    },
    {
        "source_sentence": "　毗婆尸降胎，　　光明照亦然；",
        "translation": "As Vipaśyin descended into the womb, So did his light illumine it.",
        "source": "T01n0001_001:0003c20_16"
    },
    {
        "source_sentence": "　日月所不及，　　莫不蒙大明，",
        "translation": "The sun and moon cannot match one another, And none fail to receive great illumination.",
        "source": "T01n0001_001:0003c20_16"
    },
    {
        "source_sentence": "　處胎淨無穢，　　諸佛法皆然。",
        "translation": "Abiding in the womb is pure and undefiled, as are all the Buddha’s teachings.",
        "source": "T01n0001_001:0003c20_16"
    },
    {
        "source_sentence": "佛時頌曰：「諸比丘！",
        "translation": "The Buddha then spoke in verse, Monks!",
        "source": "T01n0001_001:0003c20_16"
    },
    {
        "source_sentence": "當知諸佛常法：毗婆尸菩薩在母胎時，專念不亂，有四天子，執戈矛侍護其人，",
        "translation": "You should know the regularity of buddhas. When the bodhisattva Vipaśyin was in his mother’s womb, he concentrated his thoughts and remained undisturbed. There were four celestial beings holding spears to protect him.",
        "source": "T01n0001_001:0003c25_17"
    },
    {
        "source_sentence": "人與非人不得侵嬈，此是常法。」",
        "translation": "People and non-people can't be harmed, which is the eternal dharma.",
        "source": "T01n0001_001:0004a02_18"
    },
    {
        "source_sentence": "「四方四天子，　　有名稱威德，",
        "translation": "“The four celestial beings of the four directions, renowned for their majestic virtue,",
        "source": "T01n0001_001:0004a03_0"
    },
    {
        "source_sentence": "　天帝釋所遣，　　善守護菩薩。",
        "translation": "dispatched by Indra, the ruler of gods, The bodhisattva who protects well.",
        "source": "T01n0001_001:0004a03_0"
    },
    {
        "source_sentence": "　手常執戈矛，　　衛護不去離，",
        "translation": "Always holding a spear in his hand, he guards it and doesn’t leave it.",
        "source": "T01n0001_001:0004a03_0"
    },
    {
        "source_sentence": "　人非人不嬈，　　此諸佛常法。",
        "translation": "People and non-people aren't disturbed by this, which is the constant teaching of the buddhas.",
        "source": "T01n0001_001:0004a03_0"
    },
    {
        "source_sentence": "　天神所擁護，　　如天女衛天，",
        "translation": "They're protected by gods and goddesses, like the goddesses guarding the gods.",
        "source": "T01n0001_001:0004a03_0"
    },
    {
        "source_sentence": "　眷屬懷歡喜，　　此諸佛常法。」",
        "translation": "The members of the family rejoice, These are the eternal dharmas of the buddhas.",
        "source": "T01n0001_001:0004a03_0"
    },
    {
        "source_sentence": "佛時頌曰：又告比丘：「諸佛常法：毗婆尸菩薩從兜率天降神母胎，專念不亂，",
        "translation": "The Buddha then continued in verse: Again, the Buddha said to the bhikṣus: It is a regular practice of the buddhas:",
        "source": "T01n0001_001:0004a03_0"
    },
    {
        "source_sentence": "母身安隱，無眾惱患，智慧增益。",
        "translation": "The mother’s body was peaceful and free from all afflictions, and her wisdom increased.",
        "source": "T01n0001_001:0004a11_1"
    },
    {
        "source_sentence": "母自觀胎，見菩薩身諸根具足，如紫磨金，無有瑕穢。",
        "translation": "The mother observed for herself in the womb and saw that the Bodhisattva’s body was endowed with all the spiritual faculties like polished gold, without blemish or stain.",
        "source": "T01n0001_001:0004a12_2"
    },
    {
        "source_sentence": "猶如有目之士觀淨琉璃，內外清徹，無眾障翳。",
        "translation": "It's like a man with eyesight who observes the pure lapis lazuli, which is clear and penetrating inside and out without any hindrances.",
        "source": "T01n0001_001:0004a13_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0001_001:0004a14_4"
    },
    {
        "source_sentence": "此是諸佛常法。」",
        "translation": "These are the constant dharmas of the buddhas.",
        "source": "T01n0001_001:0004a15_0"
    },
    {
        "source_sentence": "「如淨琉璃珠，　　其明如日月；",
        "translation": "Like a pure lapis lazuli pearl The light of which is like the sun and moon.",
        "source": "T01n0001_001:0004a15_1"
    },
    {
        "source_sentence": "　仁尊處母胎，　　其母無惱患。",
        "translation": "The benevolent and honored one is in his mother's womb, and his mother has no trouble.",
        "source": "T01n0001_001:0004a15_1"
    },
    {
        "source_sentence": "　智慧為增益，　　觀胎如金像；",
        "translation": "For the sake of enhancing knowledge and wisdom, They contemplate the womb like a golden image.",
        "source": "T01n0001_001:0004a15_1"
    },
    {
        "source_sentence": "　母懷妊安樂，　　此諸佛常法。」",
        "translation": "The mother's pregnant and well-being, these are the constant teachings of the buddhas.",
        "source": "T01n0001_001:0004a15_1"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：佛告比丘：「毗婆尸菩薩從兜率天降神母胎，專念不亂，",
        "translation": "At that time the World-honored One spoke these verses: The Buddha said to the bhikṣus: “The bodhisattva Vipaśyin descended from Tuṣita Heaven into his mother’s womb.",
        "source": "T01n0001_001:0004a15_1"
    },
    {
        "source_sentence": "母心清淨，無眾欲想，不為婬火之所燒然，此是諸佛常法。」",
        "translation": "The mother's mind is pure, free of all thoughts of desire, and she won't be burned by a scorching fire; this is the eternal teaching of the buddhas.",
        "source": "T01n0001_001:0004a21_2"
    },
    {
        "source_sentence": "「菩薩住母胎，　　天終天福成；",
        "translation": "When the enlightening being abides in his mother’s womb, At the end of his heavenly life a heavenly blessing is formed.",
        "source": "T01n0001_001:0004a22_3"
    },
    {
        "source_sentence": "　其母心清淨，　　無有眾欲想。",
        "translation": "The mother’s mind was pure And she had no thoughts of desire.",
        "source": "T01n0001_001:0004a22_3"
    },
    {
        "source_sentence": "　捨離諸婬欲，　　不染不親近；",
        "translation": "Being free of sexual desire, They are neither defiled nor attached.",
        "source": "T01n0001_001:0004a22_3"
    },
    {
        "source_sentence": "　不為欲火燃，　　諸佛母常淨。」",
        "translation": "Not being burned by the fire of desire, the mothers of the buddhas are always pure.",
        "source": "T01n0001_001:0004a22_3"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：佛告比丘：「諸佛常法：毗婆尸菩薩從兜率天降神母胎，",
        "translation": "At that time the World-honored One spoke these verses: The Buddha said to the bhikṣus:",
        "source": "T01n0001_001:0004a22_3"
    },
    {
        "source_sentence": "專念不亂，其母奉持五戒，梵行清淨，篤信仁愛，諸善成就，安樂無畏，",
        "translation": "Their mother observed the five precepts, practiced celibacy purely, was devoted to faith and benevolence, perfected all good deeds, and lived in peace and fearlessness.",
        "source": "T01n0001_001:0004a29_4"
    },
    {
        "source_sentence": "身壞命終，生忉利天，此是常法。」",
        "translation": "When my body breaks up and my life ends, I'll be born in Trāyastriṃśa gods, which is the eternal dharma.",
        "source": "T01n0001_001:0004b01_5"
    },
    {
        "source_sentence": "「持人中尊身，　　精進、戒具足，",
        "translation": "“ keeping the body of a human being honored, he’s replete with effort and morality.",
        "source": "T01n0001_001:0004b02_6"
    },
    {
        "source_sentence": "　後必受天身，　　此緣名佛母。」",
        "translation": "Later, he'll surely receive the body of a god, which is called the mother of buddhas for this reason.",
        "source": "T01n0001_001:0004b02_6"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：佛告比丘：「諸佛常法：毗婆尸菩薩當其生時，",
        "translation": "At that time the World-honored One spoke these verses: The Buddha said to the bhikṣus:",
        "source": "T01n0001_001:0004b02_6"
    },
    {
        "source_sentence": "從右脇出，地為震動，光明普照。",
        "translation": "When he emerged from his right side, the earth trembled and a ray of light shone everywhere.",
        "source": "T01n0001_001:0004b07_7"
    },
    {
        "source_sentence": "始入胎時，闇冥之處，無不蒙明，此是常法。」",
        "translation": "When he first enters the womb, there's no place where it's dark and obscure that isn't illuminated; this is the eternal dharma.",
        "source": "T01n0001_001:0004b07_8"
    },
    {
        "source_sentence": "「太子生地動，　　大光靡不照，",
        "translation": "When the prince was born, the earth trembled and a great ray of light illuminated everywhere.",
        "source": "T01n0001_001:0004b08_9"
    },
    {
        "source_sentence": "　此界及餘界，　　上下與諸方，",
        "translation": "This realm and the other realms: upward, downward and all directions.",
        "source": "T01n0001_001:0004b08_9"
    },
    {
        "source_sentence": "　放光施淨目，　　具足於天身，",
        "translation": "It emits light and bestows pure eyes, Replete with the bodies of gods.",
        "source": "T01n0001_001:0004b08_9"
    },
    {
        "source_sentence": "　以歡喜淨音，　　轉稱菩薩名。」",
        "translation": "With the pure sound of joy, he transforms his name into the bodhisattva's name.",
        "source": "T01n0001_001:0004b08_9"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：佛告比丘：「諸佛常法：毗婆尸菩薩當其生時，",
        "translation": "At that time the World-honored One spoke these verses: The Buddha said to the bhikṣus:",
        "source": "T01n0001_001:0004b08_9"
    },
    {
        "source_sentence": "從右脇出，專念不亂。",
        "translation": "He emerged from his right side, concentrating his thoughts without confusion.",
        "source": "T01n0001_001:0004b15_10"
    },
    {
        "source_sentence": "時，菩薩母手攀樹枝，不坐不臥。",
        "translation": "The bodhisattva's mother then climbed a tree branch with her hand and didn't sit or lie down.",
        "source": "T01n0001_001:0004b15_11"
    },
    {
        "source_sentence": "時，四天子手奉香水，於母前立言：『唯然，天母！",
        "translation": "The four celestial beings then presented the perfume with their hands and stood before their mother, saying, 'Yes, goddess!'",
        "source": "T01n0001_001:0004b16_12"
    },
    {
        "source_sentence": "今生聖子，勿懷憂慼。』",
        "translation": "Now that a noble child has been born, don't harbor grief.'",
        "source": "T01n0001_001:0004b17_13"
    },
    {
        "source_sentence": "此是常法。」",
        "translation": "This is the eternal dharma.",
        "source": "T01n0001_001:0004b18_0"
    },
    {
        "source_sentence": "「佛母不坐臥，　　住戒修梵行，",
        "translation": "“The Buddha’s mother is not lying or sitting, Abiding by the precepts and practicing austerity.",
        "source": "T01n0001_001:0004b18_1"
    },
    {
        "source_sentence": "　生尊不懈怠，　　天人所奉侍。」",
        "translation": "The Bhagavān isn't negligent, and gods and humans serve him.",
        "source": "T01n0001_001:0004b18_1"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：佛告比丘：「諸佛常法：毗婆尸菩薩當其生時，",
        "translation": "At that time the World-honored One spoke these verses: The Buddha said to the bhikṣus:",
        "source": "T01n0001_001:0004b18_1"
    },
    {
        "source_sentence": "從右脇出，專念不亂，其身清淨，不為穢惡之所汙染。",
        "translation": "He emerges from his right hypochondrium, concentrates his thoughts without disturbance, and his body is pure and doesn't get polluted by filthy things.",
        "source": "T01n0001_001:0004b22_2"
    },
    {
        "source_sentence": "猶如有目之士，以淨明珠投白繒上，兩不相汙，二俱淨故。",
        "translation": "It's like when a man with eyesight throws a pure bright pearl into a white bowl, and the two aren't defiled by each other, because both are pure.",
        "source": "T01n0001_001:0004b23_3"
    },
    {
        "source_sentence": "菩薩出胎亦復如是，此是常法。」",
        "translation": "So it is with the bodhisattva emerging from the womb, which is an eternal dharma.",
        "source": "T01n0001_001:0004b24_4"
    },
    {
        "source_sentence": "「猶如淨明珠，　　投繒不染汙；",
        "translation": "“It’s like a pure and bright pearl That doesn’t stain or defile when thrown into the air.",
        "source": "T01n0001_001:0004b25_5"
    },
    {
        "source_sentence": "　菩薩出胎時，　　清淨無染汙。」",
        "translation": "When the bodhisattva emerges from the womb, he's pure and undefiled.",
        "source": "T01n0001_001:0004b25_5"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：佛告比丘：「諸佛常法：毗婆尸菩薩當其生時，",
        "translation": "At that time the World-honored One spoke these verses: The Buddha said to the bhikṣus:",
        "source": "T01n0001_001:0004b25_5"
    },
    {
        "source_sentence": "從右脇出，專念不亂。",
        "translation": "He emerged from his right side, concentrating his thoughts without confusion.",
        "source": "T01n0001_001:0004b29_6"
    },
    {
        "source_sentence": "從右脇出，墮地行七步，無人扶侍，遍觀四方，舉手而言：『天上天下唯我為尊，",
        "translation": "He came out of his right hypochondrium, fell to the ground, and walked seven paces without an attendant. Looking in all directions, he raised his hand and said: I am the only honored one in heavenly realms.",
        "source": "T01n0001_001:0004b29_7"
    },
    {
        "source_sentence": "要度眾生生老病死。』",
        "translation": "It's to save sentient beings from birth, old age, illness, and death.'",
        "source": "T01n0001_001:0004c02_8"
    },
    {
        "source_sentence": "此是常法。」",
        "translation": "This is the eternal dharma.",
        "source": "T01n0001_001:0004c02_9"
    },
    {
        "source_sentence": "「猶如師子步，　　遍觀於四方；",
        "translation": "“Just as a lion’s steps Pervade the four directions.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "　墮地行七步，　　人師子亦然。",
        "translation": "The human lion is likewise when he walks seven paces on the ground.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "　又如大龍行，　　遍觀於四方；",
        "translation": "It is also like the movement of a great dragon, Observing all directions everywhere.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "　墮地行七步，　　人龍亦復然。",
        "translation": "They fall to the ground and walk seven paces, And so do humans and nāgas.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "　兩足尊生時，　　安行於七步；",
        "translation": "When the two-legged honored one was born, He walked seven paces at ease.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "　觀四方舉聲，　　當盡生死苦。",
        "translation": "Observing the sounds raised in the four directions, he'll end the suffering of birth-and-death.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "　當其初生時，　　無等等與等，",
        "translation": "At the time of their first birth, There is no equal and no equal.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "　自觀生死本，　　此身最後邊。」",
        "translation": "He observes for himself the root of birth-and-death, which is the final limit of this body.",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：佛告比丘：「諸佛常法：毗婆尸菩薩當其生時，",
        "translation": "At that time the World-honored One spoke these verses: The Buddha said to the bhikṣus:",
        "source": "T01n0001_001:0004c03_10"
    },
    {
        "source_sentence": "從右脇出，專念不亂，二泉湧出一溫一冷，以供澡浴，此是常法。」",
        "translation": "He emerges from his right side, concentrates his thoughts without disturbance, and the two springs that give rise to warmth and coldness are offered for bathing, which is the eternal teaching.",
        "source": "T01n0001_001:0004c13_11"
    },
    {
        "source_sentence": "「兩足尊生時，　　二泉自涌出；",
        "translation": "“When the two-legged honored one was born, Two fountains sprang forth by themselves.",
        "source": "T01n0001_001:0004c14_12"
    },
    {
        "source_sentence": "　以供菩薩用，　　遍眼浴清淨。",
        "translation": "To make offerings for the bodhisattva's use, he bathes his eyes everywhere and makes them pure.",
        "source": "T01n0001_001:0004c14_12"
    },
    {
        "source_sentence": "　二泉自涌出，　　其水甚清淨；",
        "translation": "Two springs gush forth spontaneously, The water very clear and pure.",
        "source": "T01n0001_001:0004c14_12"
    },
    {
        "source_sentence": "　一溫二清冷，　　以浴一切智。",
        "translation": "The first is warm and the second cool, bathing all kinds of wisdom.",
        "source": "T01n0001_001:0004c14_12"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「太子初生，父王槃頭召集相師及諸道術，令觀太子，",
        "translation": "At that time the World-honored One spoke these verses: When the prince was first born, his father, the king of the gods, called together the soothsayers and other practitioners of enlightenment to see the prince.",
        "source": "T01n0001_001:0004c14_12"
    },
    {
        "source_sentence": "知其吉凶。",
        "translation": "They know their good fortune and bad fortune.",
        "source": "T01n0001_001:0004c21_13"
    },
    {
        "source_sentence": "時，諸相師受命而觀，即前披衣，見有具相，占曰：『有此相者，當趣二處，",
        "translation": "The soothsayers said, “If you have these signs, you will go to one place or the other.",
        "source": "T01n0001_001:0004c21_14"
    },
    {
        "source_sentence": "必然無疑。",
        "translation": "There must be no doubt.",
        "source": "T01n0001_001:0004c23_15"
    },
    {
        "source_sentence": "若在家者，當為轉輪聖王，王四天下，四兵具足，以正法治，無有偏枉，",
        "translation": "Those who remain householders will become universal sovereigns, ruling over the four quarters of the earth. Endowed with the four kinds of army, they will be ruled by the correct Dharma without partiality or injustice.",
        "source": "T01n0001_001:0004c23_16"
    },
    {
        "source_sentence": "恩及天下，七寶自至，千子勇健，能伏外敵，兵杖不用，天下太平；",
        "translation": "Their benevolence extended to the whole empire, which was governed by the seven kinds of treasure and possessed a thousand heroic sons who were capable of defeating any enemy outside the empire. They did not use weapons or warfare to pacify the entire empire.",
        "source": "T01n0001_001:0004c25_0"
    },
    {
        "source_sentence": "若出家學道，當成正覺，十號具足。』",
        "translation": "If you leave home and train in the path, you'll become a perfectly enlightened man with ten epithets.'",
        "source": "T01n0001_001:0004c26_1"
    },
    {
        "source_sentence": "時，諸相師即白王言：『王所生子，有三十二相，當趣二處，必然無疑。",
        "translation": "The soothsayers then said to the king, “The thirty-two eminent marks of the prince’s birth make sure there is no doubt about his destiny.",
        "source": "T01n0001_001:0004c27_2"
    },
    {
        "source_sentence": "在家當為轉輪聖王；",
        "translation": "At home he will become a universal ruler.",
        "source": "T01n0001_001:0004c28_3"
    },
    {
        "source_sentence": "若其出家，當成正覺，十號具足。』」",
        "translation": "If he leaves home, he'll become perfectly enlightened and have the ten epithets complete.'",
        "source": "T01n0001_001:0004c29_4"
    },
    {
        "source_sentence": "「百福太子生，　　相師之所記，",
        "translation": "Prince Baifu was born, As predicted by the soothsayer.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　如典記所載，　　趣二處無疑。",
        "translation": "As recorded in the scriptural texts, There is no doubt about the two places of rebirth.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　若其樂家者，　　當為轉輪王，",
        "translation": "If someone enjoys a home, they'll be the wheel-turning king.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　七寶難可獲，　　為王寶自至。",
        "translation": "The seven treasures are difficult to obtain, but the king's treasure is self-acquired.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　真金千輻具，　　周匝金輞持，",
        "translation": "A thousand-spoked jewel of pure gold, circumscribed by a golden bell.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　轉能飛遍行，　　故名為天輪。",
        "translation": "It is called the heavenly wheel because it turns and flies, traveling everywhere.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　善調七牙住，　　高廣白如雪，",
        "translation": "He well regulates the seven tusks and stands tall, as high and wide as snow.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　能善飛虛空，　　名第二象寶。",
        "translation": "The second treasure, the elephant that can skillfully fly through space, Is called the second treasure, the elephant treasure.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　馬行周天下，　　朝去暮還食，",
        "translation": "The horses traveled all over the world, leaving in the morning and returning at dusk to feed.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　朱髦孔雀咽，　　名為第三寶。",
        "translation": "The third treasure is the throat of the red-hued peacock, which is called the third treasure.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　清淨琉璃珠，　　光照一由旬，",
        "translation": "The pure lapis lazuli pearl shone brightly for one yojana.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　照夜明如晝，　　名為第四寶。",
        "translation": "To illuminate the night and make it as bright as day is called the fourth treasure.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　色聲香味觸，　　無有與等者，",
        "translation": "Visible matter, sounds, odor, taste and tangibles are not the same as these.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　諸女中第一，　　名為第五寶。",
        "translation": "The first of the women is called the fifth treasure.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　獻王琉璃寶，　　珠玉及眾珍，",
        "translation": "They offered the king’s lapis lazuli treasure, Beads, jade, and other rare treasures.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　歡喜而貢奉，　　名為第六寶。",
        "translation": "Rejoicing and paying homage, it's called the sixth treasure.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　如轉輪王念，　　軍眾速來去，",
        "translation": "Like the thought of a wheel-turning king, his armies quickly come and go.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　健疾如王意，　　名為第七寶。",
        "translation": "It's as the king wishes, and it's called the seventh treasure.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　此名為七寶，　　輪、象、馬純白，",
        "translation": "These are called the seven treasures. Wheels, elephants, and horses are pure white.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　居士、珠、女寶，　　典兵寶為七。",
        "translation": "The treasures of householders, pearls, and women are seven in number, while the treasures of wardens are seven.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　觀此無有厭，　　五欲自娛樂，",
        "translation": "Observing this without weariness, they amuse themselves with the five desires.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　如象斷羈靽，　　出家成正覺。",
        "translation": "It's like an elephant cutting off its restraints and leaving home to become perfectly enlightened.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　王有如是子，　　二足人中尊，",
        "translation": "The king had such a son, the most honored among two-legged people.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "　處世轉法輪，　　道成無懈怠。",
        "translation": "In the world, turning the wheel of the Dharma, They attain enlightenment without laziness.",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "佛時頌曰：「是時，父王慇懃再三，重問相師：『汝等更觀太子三十二相，",
        "translation": "The Buddha then continued in verse: At that time, the prince’s father was ill and asked the soothsayers again and again, “Do you see the thirty-two eminent marks of the prince?",
        "source": "T01n0001_001:0005a01_5"
    },
    {
        "source_sentence": "斯名何等？』",
        "translation": "What's the name of this?'",
        "source": "T01n0001_001:0005a27_6"
    },
    {
        "source_sentence": "時諸相師即披太子衣，說三十二相：『一者足安平，足下平滿，蹈地安隱。",
        "translation": "The soothsayers then clothed the prince’s clothes and said these thirty-two signs:",
        "source": "T01n0001_001:0005a27_7"
    },
    {
        "source_sentence": "二者足下相輪，千輻成就，光光相照。",
        "translation": "The second is the characteristic wheel at the base of the feet with a thousand spokes, which are accomplished by shining and illuminating each other.",
        "source": "T01n0001_001:0005a29_8"
    },
    {
        "source_sentence": "三者手足網縵，猶如鵝王。",
        "translation": "Third, his hands and feet are webbed like a king goose.",
        "source": "T01n0001_001:0005b01_0"
    },
    {
        "source_sentence": "四者手足柔軟，猶如天衣。",
        "translation": "The fourth is that their hands and feet are as soft and supple as heavenly garments.",
        "source": "T01n0001_001:0005b01_1"
    },
    {
        "source_sentence": "五者手足指纖，長無能及者。",
        "translation": "The fifth is the slenderness of their hands, feet, and toes; there is no one who can match them in length.",
        "source": "T01n0001_001:0005b02_2"
    },
    {
        "source_sentence": "六者足跟充滿，觀視無厭。",
        "translation": "Sixth, his feet are full of heels, and he doesn't tire of observing them.",
        "source": "T01n0001_001:0005b02_3"
    },
    {
        "source_sentence": "七者鹿膞腸，上下傭直。",
        "translation": "The seventh is the deer’s hoarse intestines, which are straight up and down as servants.",
        "source": "T01n0001_001:0005b03_4"
    },
    {
        "source_sentence": "八者鈎鎻骨，骨節相鈎，猶如鎻連。",
        "translation": "The eighth is that they hook the bones, just as if they were chained to each other in the shape of a arrow.",
        "source": "T01n0001_001:0005b04_5"
    },
    {
        "source_sentence": "九者陰馬藏。",
        "translation": "The ninth is the aggregate horse store.",
        "source": "T01n0001_001:0005b04_6"
    },
    {
        "source_sentence": "十者平立垂手過膝。",
        "translation": "Ten, he stands upright with his hands hanging down over his knees.",
        "source": "T01n0001_001:0005b05_7"
    },
    {
        "source_sentence": "十一、一一孔一毛生，其毛右旋，紺琉璃色。",
        "translation": "Eleventh, a hair arises from each pore, which curls to the right and has the color of purple lapis lazuli.",
        "source": "T01n0001_001:0005b05_8"
    },
    {
        "source_sentence": "十二、毛生右旋，紺色仰靡。",
        "translation": "12. The hair grows to the right and turns blue in color.",
        "source": "T01n0001_001:0005b06_9"
    },
    {
        "source_sentence": "十三、身黃金色。",
        "translation": "13. His body is golden in color.",
        "source": "T01n0001_001:0005b07_10"
    },
    {
        "source_sentence": "十四、皮膚細軟，不受塵穢。",
        "translation": "14. The skin is fine and soft, not subject to dirt or dirt.",
        "source": "T01n0001_001:0005b07_11"
    },
    {
        "source_sentence": "十五、兩肩齊亭，充滿圓好。",
        "translation": "15. The two shoulders are facing each other, and they're full and beautiful.",
        "source": "T01n0001_001:0005b08_12"
    },
    {
        "source_sentence": "十六、胸有萬字。",
        "translation": "16. There are myriad words in the chest.",
        "source": "T01n0001_001:0005b08_13"
    },
    {
        "source_sentence": "十七、身長倍人。",
        "translation": "17. His body is twice as long as a human being.",
        "source": "T01n0001_001:0005b09_14"
    },
    {
        "source_sentence": "十八、七處平滿。",
        "translation": "18. The seven places are evenly filled.",
        "source": "T01n0001_001:0005b09_15"
    },
    {
        "source_sentence": "十九、身長廣等，如尼拘盧樹。",
        "translation": "19. The body's length and breadth are like a nyagrodha tree.",
        "source": "T01n0001_001:0005b10_0"
    },
    {
        "source_sentence": "二十、頰車如師子。",
        "translation": "20. His cheeks and chariot are like a lion.",
        "source": "T01n0001_001:0005b10_1"
    },
    {
        "source_sentence": "二十一、胸膺方整如師子。",
        "translation": "21. His chest is straight and square like a lion.",
        "source": "T01n0001_001:0005b11_2"
    },
    {
        "source_sentence": "二十二、口四十齒。",
        "translation": "22. The forty teeth of the mouth.",
        "source": "T01n0001_001:0005b11_3"
    },
    {
        "source_sentence": "二十三、方整齊平。",
        "translation": "23. The directions are even and the alignment is level.",
        "source": "T01n0001_001:0005b12_4"
    },
    {
        "source_sentence": "二十四、齒密無間。",
        "translation": "24. The teeth are dense and unremitting.",
        "source": "T01n0001_001:0005b12_5"
    },
    {
        "source_sentence": "二十五、齒白鮮明。",
        "translation": "25. The teeth are white and pure.",
        "source": "T01n0001_001:0005b12_6"
    },
    {
        "source_sentence": "二十六、咽喉清淨，所食眾味，無不稱適。",
        "translation": "26. The throat and throat are pure, and there's nothing that isn't suitable for the various flavors they eat.",
        "source": "T01n0001_001:0005b13_7"
    },
    {
        "source_sentence": "二十七、廣長舌，左右舐耳。",
        "translation": "26. His tongue is broad and long, licking his left and right ears.",
        "source": "T01n0001_001:0005b14_8"
    },
    {
        "source_sentence": "二十八、梵音清徹。",
        "translation": "Twenty-eight. The Sanskrit sound is clear and penetrating.",
        "source": "T01n0001_001:0005b14_9"
    },
    {
        "source_sentence": "二十九、眼紺青色。",
        "translation": "29. The eyes are dark blue and blue in color.",
        "source": "T01n0001_001:0005b15_10"
    },
    {
        "source_sentence": "三十、眼如牛王，眼上下俱眴。",
        "translation": "30. The eye is like an ox king, with the eye facing up and down together.",
        "source": "T01n0001_001:0005b15_11"
    },
    {
        "source_sentence": "三十一、眉間白毫柔軟細澤，引長一尋，放則右旋螺如真珠。",
        "translation": "33. The white hair between the eyebrows is soft and subtle, one fathom long, and when released, it curls to the right like a real pearl.",
        "source": "T01n0001_001:0005b16_12"
    },
    {
        "source_sentence": "三十二、頂有肉髻，是為三十二相。』」",
        "translation": "Twenty-two, the top of the head has a fleshy topknot, which are the thirty-two marks.'",
        "source": "T01n0001_001:0005b17_13"
    },
    {
        "source_sentence": "「善住柔軟足，　　不蹈地跡現，",
        "translation": "“Good-abiding, pliant feet that don’t show their traces on the ground",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　千輻相莊嚴，　　光色靡不具。",
        "translation": "A thousand-spoked image is adorned, Endowed with all the colors of light.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　如尼俱類樹，　　縱廣正平等。",
        "translation": "It's like a tree of all kinds of nuns, Even though its width is exactly the same.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　如來未曾有，　　祕密馬陰藏。",
        "translation": "The Tathāgata has never existed: This is the secret treasure house of the horse’s aggregate.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　金寶莊嚴身，　　眾相互相暎，",
        "translation": "A body adorned with gold and jewels, The multitudes clapped at each other.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　雖順俗流行，　　塵土亦不汙。",
        "translation": "Even though it follows the popular custom, The dust and dirt are not defiled.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　天色極柔軟，　　天蓋自然覆，",
        "translation": "The heavenly form is extremely soft, naturally covered by the heavenly canopy.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　梵音、身紫金，　　如華始出池。",
        "translation": "The sound of Brahma and his body are purplish-gold, just like flowers that first emerge from a pond.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　王以問相師，　　相師敬報王。",
        "translation": "The king asked the fortune teller, and the fortune teller respectfully reported it to the king.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　稱讚菩薩相，　　舉身光明具。",
        "translation": "He praises the characteristics of the bodhisattva and raises his body as a shining vessel.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　手足諸支節，　　中外靡不現。",
        "translation": "The limbs of hands, feet, and joints They don’t appear even in the middle or beyond.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　食味盡具足，　　身正不傾斜。",
        "translation": "Their food and flavors are all plentiful, and their bodies aren't tilted or stooped.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　足下輪相現，　　其音如哀鸞。",
        "translation": "The sound of his voice is like that of a sorrowful luan.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　傭髀形相具，　　宿業之所成。",
        "translation": "A servant's thigh is endowed with form and characteristics, which are the result of past actions.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　臂肘圓滿好，　　眉目甚端嚴。",
        "translation": "Their arms and elbows are well rounded, and their eyebrows and eyes are very graceful.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　人中師子尊，　　威力最第一。",
        "translation": "Among humans, the venerable lion is the most powerful and mighty.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　其頰車方整，　　臥脇如師子。",
        "translation": "Their cheeks and chariots are square and straight, lying on their sides like lions.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　齒方整四十，　　齊密中無間。",
        "translation": "The square teeth are forty in number, arranged evenly and closely spaced without gaps.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　梵音未曾有，　　遠近隨緣到。",
        "translation": "The Sanskrit sound is unprecedented; Approached from far and near, it reaches according to conditions.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　平立不傾身，　　二手摩捫膝。",
        "translation": "He stands upright without stooping, his hands touching his knees.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　毛齊整柔軟，　　人尊美相具。",
        "translation": "The hairs are straight and soft, And the people are endowed with distinguished features.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　一孔一毛生，　　手足網縵相。",
        "translation": "Each pore and hair grows a web of hands and feet, with the characteristic of webbing.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　肉髻、目紺青，　　眼上下俱眴。",
        "translation": "Their flesh-tuft and eyes are deep blue, and their eyes are both vertical and horizontal.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　兩肩圓充滿，　　三十二相具。",
        "translation": "The two shoulders were round and full, endowed with the thirty-two marks.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　足跟無高下，　　鹿膞腸纖傭。",
        "translation": "Their legs and heels are neither high nor low, And their calves are like those of a deer.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　天中天來此，　　如象絕羈靽；",
        "translation": "The gods of the heavens come here like an elephant that cannot be restrained.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　解脫眾生苦，　　處生老病死。",
        "translation": "Being liberated from the suffering of sentient beings, they're born in birth, old age, illness, and death.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　以慈悲心故，　　為說四真諦；",
        "translation": "Because of kindness and compassion They teach the four truths.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "　開演法句義，　　令眾奉至尊。」",
        "translation": "He explains the meaning of the words of the teaching and causes the crowd to venerate him.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "即說頌曰：佛告比丘：「毗婆尸菩薩生時，諸天在上，於虛空中手執白蓋寶扇，",
        "translation": "The Buddha said in verse: When the bodhisattva Vipaśyin was born, the heavenly gods were above him, holding white canopies and jeweled fans in their hands in the sky.",
        "source": "T01n0001_001:0005b18_14"
    },
    {
        "source_sentence": "以障寒暑、風雨、塵土。」",
        "translation": "It's to prevent cold, heat, wind, rain, dust, and dirt.",
        "source": "T01n0001_001:0005c20_15"
    },
    {
        "source_sentence": "「人中未曾有，　　生於二足尊；",
        "translation": "Unprecedented among humans is the birth of a two-legged honored one.",
        "source": "T01n0001_001:0005c21_16"
    },
    {
        "source_sentence": "　諸天懷敬養，　　奉寶蓋寶扇。",
        "translation": "The gods honored him and offered him a jeweled canopy and a jeweled fan.",
        "source": "T01n0001_001:0005c21_16"
    },
    {
        "source_sentence": "佛時頌曰：「爾時，父王給四乳母：一者乳哺，二者澡浴，三者塗香，",
        "translation": "The Buddha then continued in verse: At that time, the king’s father gave him to his four nursing mothers. First, they fed him milk; second, they bathed him; and third, they anointed him with scented oil.",
        "source": "T01n0001_001:0005c21_16"
    },
    {
        "source_sentence": "四者娛樂。",
        "translation": "The fourth is amusement.",
        "source": "T01n0001_001:0005c25_17"
    },
    {
        "source_sentence": "歡喜養育，無有懈倦。」",
        "translation": "They rejoice and nourish themselves without laziness.",
        "source": "T01n0001_001:0005c25_18"
    },
    {
        "source_sentence": "「乳母有慈愛，　　子生即付養；",
        "translation": "“ breast-feeding mothers have compassion and love, And when their children are born they give birth to them.",
        "source": "T01n0001_001:0005c26_0"
    },
    {
        "source_sentence": "　一乳哺一浴，　　二塗香娛樂。",
        "translation": "The first is to feed on milk and bathe, and the second is to rub it over one’s chest.",
        "source": "T01n0001_001:0005c26_0"
    },
    {
        "source_sentence": "　世間最妙香，　　以塗人中尊。",
        "translation": "The world's most wonderful fragrance is the honored among people who rub it on them.",
        "source": "T01n0001_001:0005c26_0"
    },
    {
        "source_sentence": "於是頌曰：「為童子時，舉國士女視無厭足。」",
        "translation": "He then composed a verse, When he's a boy, he raises his countrymen and women to look at him without tire.",
        "source": "T01n0001_001:0005c26_0"
    },
    {
        "source_sentence": "「多人所敬愛，　　如金像始成，",
        "translation": "The image of the Buddha, beloved by many, Is like a golden statue that has just been produced.",
        "source": "T01n0001_001:0006a01_1"
    },
    {
        "source_sentence": "　男女共諦觀，　　視之無厭足。",
        "translation": "Men and women observed it together, never tiring of looking at it.",
        "source": "T01n0001_001:0006a01_1"
    },
    {
        "source_sentence": "於是頌曰：「為童子時，舉國士女眾共傳抱，如觀寶華。」",
        "translation": "He then composed a verse, When he was a boy, all the king's men and women held him in their arms, just as they looked at the jeweled flower.",
        "source": "T01n0001_001:0006a01_1"
    },
    {
        "source_sentence": "「二足尊生時，　　多人所敬愛；",
        "translation": "“When the two-legged honored one was born, Many people revered him.",
        "source": "T01n0001_001:0006a05_2"
    },
    {
        "source_sentence": "　展轉共傳抱，　　如觀寶花香。",
        "translation": "They are embraced one after the other, like contemplating the fragrance of jeweled flowers.",
        "source": "T01n0001_001:0006a05_2"
    },
    {
        "source_sentence": "於是頌曰：「菩薩生時，其目不眴，如忉利天。",
        "translation": "He then composed a verse, saying, When the bodhisattva was born, his eyes weren't blind like the gods of Trāyastriṃśa Heaven.",
        "source": "T01n0001_001:0006a05_2"
    },
    {
        "source_sentence": "以不眴故，名毗婆尸。」",
        "translation": "Because they aren't angry, they're called vipaśyins.",
        "source": "T01n0001_001:0006a08_3"
    },
    {
        "source_sentence": "「天中天不眴，　　猶如忉利天；",
        "translation": "The gods among the gods don’t eat, just like the Trāyastriṃśa gods.",
        "source": "T01n0001_001:0006a09_4"
    },
    {
        "source_sentence": "　見色而正觀，　　故號毗婆尸。",
        "translation": "He sees form and correctly observes it, so he's called Vipaśyin.",
        "source": "T01n0001_001:0006a09_4"
    },
    {
        "source_sentence": "於是頌曰：「菩薩生時，其聲清徹，柔軟和雅，如迦羅頻伽鳥聲。」",
        "translation": "He then composed a verse, When the bodhisattva was born, his voice was clear and penetrating, as soft and gentle as the sound of a kalaviṅka bird.",
        "source": "T01n0001_001:0006a09_4"
    },
    {
        "source_sentence": "「猶如雪山鳥，　　飲華汁而鳴；",
        "translation": "“It’s like a snow-capped mountain bird Drinking the juice of flowers and singing.",
        "source": "T01n0001_001:0006a13_5"
    },
    {
        "source_sentence": "　其彼二足尊，　　聲清徹亦然。",
        "translation": "That two-legged honored one’s voice Is likewise clear and penetrating.",
        "source": "T01n0001_001:0006a13_5"
    },
    {
        "source_sentence": "於是頌曰：「菩薩生時，眼能徹視見一由旬。」",
        "translation": "He then spoke this verse, When the bodhisattva was born, his eyes were able to penetrate and see a yojana.",
        "source": "T01n0001_001:0006a13_5"
    },
    {
        "source_sentence": "「清淨業行報，　　受天妙光明；",
        "translation": "As a result of pure deeds and actions, They receive the subtle light of heaven.",
        "source": "T01n0001_001:0006a16_6"
    },
    {
        "source_sentence": "　菩薩目所見，　　周遍一由旬。",
        "translation": "The distance seen by the eye of enlightening beings Is one yojana in circuit.",
        "source": "T01n0001_001:0006a16_6"
    },
    {
        "source_sentence": "於是頌曰：「菩薩生時，年漸長大，在天正堂，以道開化，恩及庶民，",
        "translation": "The Buddha then continued in verse: When the Bodhisattva was born, he grew up to be a man of great stature. In the main hall of the heavenly realm he enlightened himself by means of the Way and extended his benevolence to all living beings.",
        "source": "T01n0001_001:0006a16_6"
    },
    {
        "source_sentence": "名德遠聞。」",
        "translation": "His name is virtuous and far-reachingly heard.",
        "source": "T01n0001_001:0006a20_7"
    },
    {
        "source_sentence": "「童幼處正堂，　　以道化天下；",
        "translation": "Young people, in the main hall, Teach the world by the Way.",
        "source": "T01n0001_001:0006a20_8"
    },
    {
        "source_sentence": "　決斷眾事務，　　故號毗婆尸。",
        "translation": "He decided to cut off all affairs, so he was called Vipaśyin.",
        "source": "T01n0001_001:0006a20_8"
    },
    {
        "source_sentence": "　清淨智廣博，　　甚深猶大海；",
        "translation": "Pure knowledge is vast and extensive, As deep as the great ocean.",
        "source": "T01n0001_001:0006a20_8"
    },
    {
        "source_sentence": "　悅可於群生，　　使智慧增廣。",
        "translation": "It pleases sentient beings and causes their wisdom to increase.",
        "source": "T01n0001_001:0006a20_8"
    },
    {
        "source_sentence": "於是頌曰：「於時，菩薩欲出遊觀，告勅御者嚴駕寶車，詣彼園林，巡行遊觀。",
        "translation": "He then composed the following verse: At that time the Bodhisattva wished to go out on a pleasure excursion and instructed his royal attendants to prepare a richly decorated carriage so that he could visit the grove and walk around in it.",
        "source": "T01n0001_001:0006a20_8"
    },
    {
        "source_sentence": "御者即便嚴駕訖已，還白：『今正是時。』",
        "translation": "The king then prepared his carriage and returned, saying, 'Now is the right time.'",
        "source": "T01n0001_001:0006a26_9"
    },
    {
        "source_sentence": "太子即乘寶車詣彼園觀。",
        "translation": "The prince then rode the jeweled chariot to that park and observed it.",
        "source": "T01n0001_001:0006a27_10"
    },
    {
        "source_sentence": "於其中路見一老人，頭白齒落，面皺身僂，拄杖羸步，喘息而行。",
        "translation": "On the roadway he saw an old man with white hair and lost teeth on his head. His face was wrinkled and his body stooped, but he could walk only weakly on his cane. He panted in relief as he walked.",
        "source": "T01n0001_001:0006a28_0"
    },
    {
        "source_sentence": "太子顧問侍者：『此為何人？』",
        "translation": "The prince's advisor and attendant asked, 'Who is this person?'",
        "source": "T01n0001_001:0006a29_1"
    },
    {
        "source_sentence": "答曰：『此是老人。』",
        "translation": "He replied, 'This is an old man.'",
        "source": "T01n0001_001:0006b01_2"
    },
    {
        "source_sentence": "又問：『何如為老？』",
        "translation": "Again, he asked, 'What's old?'",
        "source": "T01n0001_001:0006b01_3"
    },
    {
        "source_sentence": "答曰：『夫老者生壽向盡，餘命無幾，故謂之老。』",
        "translation": "He answered, 'When an old man grows old, his life expectancy is about to end and his remaining life isn't long; therefore, he's called old.'",
        "source": "T01n0001_001:0006b01_4"
    },
    {
        "source_sentence": "太子又問：『吾亦當爾，不免此患耶？』",
        "translation": "The prince also asked, 'Shouldn't I be spared this trouble?'",
        "source": "T01n0001_001:0006b03_0"
    },
    {
        "source_sentence": "答曰：『然，生必有老，無有豪賤。』",
        "translation": "He answered, 'Sure, there must be old age when you're born, and there's no arrogance or inferiority.'",
        "source": "T01n0001_001:0006b03_1"
    },
    {
        "source_sentence": "於是，太子悵然不悅，即告侍者迴駕還宮，靜默思惟：『念此老苦，吾亦當有。』」",
        "translation": "The prince then became disheartened and didn't delight, so he told his attendants to return to the palace and quietly thought, 'I will experience this pain of old age.'",
        "source": "T01n0001_001:0006b04_2"
    },
    {
        "source_sentence": "「見老命將盡，　　拄杖而羸步；",
        "translation": "Seeing the old man’s life was about to end, They climbed with their staffs and weakened.",
        "source": "T01n0001_001:0006b06_3"
    },
    {
        "source_sentence": "　菩薩自思惟，　　吾未免此難。",
        "translation": "The bodhisattva thought to himself, I won't be spared this difficulty.",
        "source": "T01n0001_001:0006b06_3"
    },
    {
        "source_sentence": "佛於是頌曰：「爾時，父王問彼侍者：『太子出遊，歡樂不耶？』",
        "translation": "The Buddha then composed a verse, saying, At the time, the father asked that attendant, 'Did the prince enjoy his excursion?'",
        "source": "T01n0001_001:0006b06_3"
    },
    {
        "source_sentence": "答曰：『不樂。』",
        "translation": "He answered, 'It's not pleasant.'",
        "source": "T01n0001_001:0006b09_4"
    },
    {
        "source_sentence": "又問其故，答曰：『道逢老人，是以不樂。』",
        "translation": "Again, he asked him why, and he answered, 'I met an old man on the road; therefore, I'm unhappy.'",
        "source": "T01n0001_001:0006b10_5"
    },
    {
        "source_sentence": "爾時，父王默自思念：『昔日相師占相太子，言當出家，今者不悅，得無爾乎？",
        "translation": "At that time, the father-king remained silent and thought to himself: Formerly a soothsayer formerly told the prince about leaving home but now he is not pleased. Is this true or not?",
        "source": "T01n0001_001:0006b11_6"
    },
    {
        "source_sentence": "當設方便，使處深宮，五欲娛樂，以悅其心，令不出家。』",
        "translation": "You must devise a method that causes them to stay deep in the palace, indulge in the five desires, and please their minds so they won't leave home.'",
        "source": "T01n0001_001:0006b12_7"
    },
    {
        "source_sentence": "即便嚴飾宮舘，簡擇婇女以娛樂之。」",
        "translation": "They even adorned the palace halls and simply selected women to entertain them.",
        "source": "T01n0001_001:0006b14_8"
    },
    {
        "source_sentence": "「父王聞此言，　　方便嚴宮舘；",
        "translation": "When the king’s father heard these words, Hearing what he said, Skillfully adorned his palace building.",
        "source": "T01n0001_001:0006b15_9"
    },
    {
        "source_sentence": "　增益以五欲，　　欲使不出家。",
        "translation": "It's because of the five desires that they increase, wanting to cause them not to leave home.",
        "source": "T01n0001_001:0006b15_9"
    },
    {
        "source_sentence": "佛於是頌曰：「又於後時，太子復命御者嚴駕出遊。",
        "translation": "The Buddha then composed this verse, Again, some time later, the prince again ordered the royal attendant to prepare a chariot and went on an excursion.",
        "source": "T01n0001_001:0006b15_9"
    },
    {
        "source_sentence": "於其中路逢一病人，身羸腹大，面目黧黑，獨臥糞除，無人瞻視，病甚苦毒，",
        "translation": "On the way they met a sick man with an emaciated body and a large belly. His face and eyes were dark, lying on their own in excrement without anyone to look after them. The illness was so serious that it was painful and venomous.",
        "source": "T01n0001_001:0006b18_10"
    },
    {
        "source_sentence": "口不能言。",
        "translation": "His mouth can't say anything.",
        "source": "T01n0001_001:0006b20_11"
    },
    {
        "source_sentence": "顧問御者：『此為何人？』",
        "translation": "The advisor and king asked, 'What's this person?'",
        "source": "T01n0001_001:0006b20_12"
    },
    {
        "source_sentence": "答曰：『此是病人。』",
        "translation": "He replied, 'This is a sick person.'",
        "source": "T01n0001_001:0006b21_13"
    },
    {
        "source_sentence": "問曰：『何如為病？』",
        "translation": "He asked, 'What's the illness?'",
        "source": "T01n0001_001:0006b21_14"
    },
    {
        "source_sentence": "答曰：『病者，眾痛迫切，存亡無期，故曰病也。』",
        "translation": "He answered, 'A sick person's pain is so intense that there's no time to live and die; therefore, it's called a sickness.'",
        "source": "T01n0001_001:0006b22_15"
    },
    {
        "source_sentence": "又曰：『吾亦當爾，未免此患耶？』",
        "translation": "Again, he said, 'Shouldn't I be spared this trouble?'",
        "source": "T01n0001_001:0006b23_16"
    },
    {
        "source_sentence": "答曰：『然。",
        "translation": "He replied, 'Yes.",
        "source": "T01n0001_001:0006b23_17"
    },
    {
        "source_sentence": "生則有病，無有貴賤。』",
        "translation": "When it arises, there's illness, and there's no distinction between noble and humble.'",
        "source": "T01n0001_001:0006b24_18"
    },
    {
        "source_sentence": "於是，太子悵然不悅，即告御者迴車還宮。",
        "translation": "The prince, disheartened and displeased, immediately told the attendant to turn his chariot and return to the palace.",
        "source": "T01n0001_001:0006b24_19"
    },
    {
        "source_sentence": "靜默思惟：『念此病苦，吾亦當爾。』」",
        "translation": "He quietly and quietly thought, 'Mindful of the suffering of this illness, I will do the same.'",
        "source": "T01n0001_001:0006b25_20"
    },
    {
        "source_sentence": "「見彼久病人，　　顏色為衰損；",
        "translation": "“When I saw that man who had been ill for a long time, His complexion looked emaciated.",
        "source": "T01n0001_001:0006b26_21"
    },
    {
        "source_sentence": "　靜默自思惟，　　吾未免此患。",
        "translation": "Silently and quietly, I thought to myself, ‘I cannot escape this fate.",
        "source": "T01n0001_001:0006b26_21"
    },
    {
        "source_sentence": "佛於是頌曰：「爾時，父王復問御者：『太子出遊，歡樂不耶？』",
        "translation": "The Buddha then composed a verse, saying, At that point, the father-king asked the king again, 'Did the prince enjoy his excursion?'",
        "source": "T01n0001_001:0006b26_21"
    },
    {
        "source_sentence": "答曰：『不樂。』",
        "translation": "He answered, 'It's not pleasant.'",
        "source": "T01n0001_001:0006b29_22"
    },
    {
        "source_sentence": "又問其故，答曰：『道逢病人，是以不樂。』",
        "translation": "Again, he asked about the reason and answered, 'I met a sick man on the road; that's why I didn't enjoy it.'",
        "source": "T01n0001_001:0006c01_23"
    },
    {
        "source_sentence": "於是父王默然思惟：『昔日相師占相太子，言當出家，今日不悅，得無爾乎？",
        "translation": "The father, the king, remained silent and thought to himself: Formerly a soothsayer of old told the prince that he was about to renounce household life. But today he is unhappy. Isn’t this how he has done?",
        "source": "T01n0001_001:0006c02_24"
    },
    {
        "source_sentence": "吾當更設方便，增諸伎樂，以悅其心，使不出家。』",
        "translation": "I will set up another method to increase the number of tricks and music to please their minds so that they won't leave home.'",
        "source": "T01n0001_001:0006c03_25"
    },
    {
        "source_sentence": "即復嚴飾宮舘，簡擇婇女以娛樂之。」",
        "translation": "He then adorned the palace hall and simply selected a promiscuous woman to entertain him.",
        "source": "T01n0001_001:0006c05_26"
    },
    {
        "source_sentence": "「色聲香味觸，　　微妙可悅樂，",
        "translation": "“Form, sound, odor, taste, touch, subtlety, and delightful.",
        "source": "T01n0001_001:0006c06_0"
    },
    {
        "source_sentence": "　菩薩福所致，　　故娛樂其中。",
        "translation": "Because the bodhisattvas are endowed with merit, they therefore amuse themselves there.",
        "source": "T01n0001_001:0006c06_0"
    },
    {
        "source_sentence": "佛於是頌曰：「又於異時，太子復勅御者嚴駕出遊。",
        "translation": "The Buddha then composed this verse, Again, at another time, the prince again ordered his royal attendant to prepare a chariot and go on an excursion.",
        "source": "T01n0001_001:0006c06_0"
    },
    {
        "source_sentence": "於其中路逢一死人，雜色繒幡前後導引，宗族親里悲號哭泣，送之出城。",
        "translation": "On the way they met a deceased man, who was led out of the city in front and behind them with variegated silhouetted banners. His clansmen and relatives cried in distress and were driven away.",
        "source": "T01n0001_001:0006c09_1"
    },
    {
        "source_sentence": "太子復問：『此為何人？』",
        "translation": "The prince then asked, 'What's this person?'",
        "source": "T01n0001_001:0006c11_2"
    },
    {
        "source_sentence": "答曰：『此是死人。』",
        "translation": "He replied, 'This is a dead man.'",
        "source": "T01n0001_001:0006c12_3"
    },
    {
        "source_sentence": "問曰：『何如為死？』",
        "translation": "He asked, 'What's the point of death?'",
        "source": "T01n0001_001:0006c12_4"
    },
    {
        "source_sentence": "答曰：『死者，盡也。",
        "translation": "He replied, 'Death is exhaustion.'",
        "source": "T01n0001_001:0006c12_5"
    },
    {
        "source_sentence": "風先火次，諸根壞敗，存亡異趣，室家離別，故謂之死。』",
        "translation": "When the wind precedes the fire, the faculties break down and they're born in a different destiny, and their houses are separated, so they're called dead.'",
        "source": "T01n0001_001:0006c13_6"
    },
    {
        "source_sentence": "太子又問御者：『吾亦當爾，不免此患耶？』",
        "translation": "The prince also asked the king, 'Shouldn't I be spared this trouble?'",
        "source": "T01n0001_001:0006c14_7"
    },
    {
        "source_sentence": "答曰：『然，生必有死，無有貴賤。』",
        "translation": "He answered, 'Sure, there must be death in birth, and there's no superiority or inferiority.'",
        "source": "T01n0001_001:0006c15_8"
    },
    {
        "source_sentence": "於是，太子悵然不悅，即告御者迴車還宮，靜默思惟：『念此死苦，吾亦當然。』」",
        "translation": "The prince then became disheartened and didn't like it, so he told the king to turn his chariot back to the palace and quietly thought, 'I'll be mindful of this suffering of death as well.'",
        "source": "T01n0001_001:0006c16_9"
    },
    {
        "source_sentence": "「始見有人死，　　知其復更生；",
        "translation": "When they first saw a man die, They knew he would be reborn.",
        "source": "T01n0001_001:0006c18_0"
    },
    {
        "source_sentence": "　靜默自思惟，　　吾未免此患。",
        "translation": "Silently and quietly, I thought to myself, ‘I cannot escape this fate.",
        "source": "T01n0001_001:0006c18_0"
    },
    {
        "source_sentence": "佛時頌曰：「爾時，父王復問御者：『太子出遊，歡樂不耶？』",
        "translation": "The Buddha then spoke a verse, saying, At that point, the father-king asked the king again, 'Is the prince enjoying his excursion?'",
        "source": "T01n0001_001:0006c18_0"
    },
    {
        "source_sentence": "答曰：『不樂。』",
        "translation": "He answered, 'It's not pleasant.'",
        "source": "T01n0001_001:0006c21_1"
    },
    {
        "source_sentence": "又問其故，答曰：『道逢死人，是故不樂。』",
        "translation": "Again, he asked about the reason for this, and he answered, 'I met a dead man on the road; therefore, I'm unhappy.'",
        "source": "T01n0001_001:0006c22_2"
    },
    {
        "source_sentence": "於是父王默自思念：『昔日相師占相太子，言當出家，今日不悅，得無爾乎？",
        "translation": "The father-king then remained silent and thought to himself, 'In the past, the soothsayer Prince Xiang said that he was about to leave home, but today he won't be happy. Isn't it true?",
        "source": "T01n0001_001:0006c23_3"
    },
    {
        "source_sentence": "吾當更設方便，增諸伎樂以悅其心，使不出家。』",
        "translation": "I will create another method to increase the number of tricks and music to please their minds so that they won't leave home.'",
        "source": "T01n0001_001:0006c24_4"
    },
    {
        "source_sentence": "即復嚴飾宮舘，簡擇婇女以娛樂之。」",
        "translation": "He then adorned the palace hall and simply selected a promiscuous woman to entertain him.",
        "source": "T01n0001_001:0006c26_5"
    },
    {
        "source_sentence": "「童子有名稱，　　婇女眾圍遶；",
        "translation": "The boy had a renowned name, Surrounded by many court ladies.",
        "source": "T01n0001_001:0006c27_0"
    },
    {
        "source_sentence": "　五欲以自娛，　　如彼天帝釋。",
        "translation": "The five desires are self-enjoyed, like the god Indra.",
        "source": "T01n0001_001:0006c27_0"
    },
    {
        "source_sentence": "佛於是頌曰：「又於異時，復勑御者嚴駕出遊，於其中路逢一沙門，法服持鉢，",
        "translation": "The Buddha then composed the following verse: Again, on another different day, when the king’s attendant was coming out in an ornate carriage, he happened to meet a śramaṇa wearing the Dharma robe and holding a bowl.",
        "source": "T01n0001_001:0006c27_0"
    },
    {
        "source_sentence": "視地而行。",
        "translation": "He looked at the ground and walked.",
        "source": "T01n0001_001:0007a02_1"
    },
    {
        "source_sentence": "即問御者：『此為何人？』",
        "translation": "He asked the charioteer, 'What's this person?'",
        "source": "T01n0001_001:0007a02_2"
    },
    {
        "source_sentence": "御者答曰：『此是沙門。』",
        "translation": "The king answered, 'This is an ascetic.'",
        "source": "T01n0001_001:0007a03_3"
    },
    {
        "source_sentence": "又問：『何謂沙門？』",
        "translation": "Again, he asked, 'What's meant by ascetic?'",
        "source": "T01n0001_001:0007a03_4"
    },
    {
        "source_sentence": "答曰：『沙門者，捨離恩愛，出家修道，攝御諸根，不染外欲，慈心一切，",
        "translation": "Answer: An ascetic abandons affection and love, renounces domestic life, renounces family life, and practices the path of religion. He controls his sense faculties, is not affected by external desires, and acts with kindness toward all living beings.",
        "source": "T01n0001_001:0007a04_5"
    },
    {
        "source_sentence": "無所傷害，逢苦不慼，遇樂不欣，能忍如地，故號沙門。』",
        "translation": "There's nothing to harm, no anger when he meets suffering, no pleasure when he meets happiness, and being able to tolerate it like the ground is therefore called an ascetic.'",
        "source": "T01n0001_001:0007a05_6"
    },
    {
        "source_sentence": "太子曰：『善哉！",
        "translation": "The prince said, 'Good!",
        "source": "T01n0001_001:0007a07_7"
    },
    {
        "source_sentence": "此道真正永絕塵累，微妙清虛，惟是為快。』",
        "translation": "This path is truly genuine, permanently free of the burden of dust, subtle and pure, but it's only pleasant.'",
        "source": "T01n0001_001:0007a07_8"
    },
    {
        "source_sentence": "即勑御者迴車就之。",
        "translation": "That's when the charioteer returns to his chariot and puts it there.",
        "source": "T01n0001_001:0007a08_9"
    },
    {
        "source_sentence": "「爾時，太子問沙門曰：『剃除鬚髮，法服持鉢，何所志求？』",
        "translation": "It was then that the prince asked the ascetic, 'Have you shaved your hair and beard, don't you, and what do you want to seek in religious robes and bowls?'",
        "source": "T01n0001_001:0007a08_10"
    },
    {
        "source_sentence": "沙門答曰：『夫出家者，欲調伏心意，永離塵垢，慈育群生，無所侵嬈，",
        "translation": "The śramaṇa answered, “Those who remain householders want to control their minds and wills so as to be free of the defilements. They have compassion for sentient beings and do not harm them.",
        "source": "T01n0001_001:0007a10_11"
    },
    {
        "source_sentence": "虛心靜寞，唯道是務。』",
        "translation": "The empty mind is still and lonely, but the only thing it does is to follow the path.'",
        "source": "T01n0001_001:0007a11_12"
    },
    {
        "source_sentence": "太子曰：『善哉！",
        "translation": "The prince said, 'Good!",
        "source": "T01n0001_001:0007a12_13"
    },
    {
        "source_sentence": "此道最真。』",
        "translation": "This path is the most true.'",
        "source": "T01n0001_001:0007a12_14"
    },
    {
        "source_sentence": "尋勑御者：『賷吾寶衣并及乘轝，還白大王，我即於此剃除鬚髮，服三法衣，",
        "translation": "Then the king said to the prince, “I shaved my hair and beard at this place and donned the three robes.",
        "source": "T01n0001_001:0007a12_15"
    },
    {
        "source_sentence": "出家修道。",
        "translation": "He left home and cultivated the path.",
        "source": "T01n0001_001:0007a14_16"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T01n0001_001:0007a14_17"
    },
    {
        "source_sentence": "欲調伏心意，捨離塵垢，清淨自居，以求道術。』",
        "translation": "They want to tame their minds and intentions, abandon the defilements, live purely by themselves, and seek the techniques of the path.'",
        "source": "T01n0001_001:0007a15_18"
    },
    {
        "source_sentence": "於是，御者即以太子所乘寶車及與衣服還歸父王。",
        "translation": "The king then returned the jeweled chariot mounted by the prince and his clothes to their father, the king.",
        "source": "T01n0001_001:0007a16_19"
    },
    {
        "source_sentence": "太子於後即剃除鬚髮，服三法衣，出家修道。」",
        "translation": "The prince then shaved his hair and beard, donned the three robes of the Dharma, left home, and cultivated.",
        "source": "T01n0001_001:0007a17_20"
    },
    {
        "source_sentence": "佛告比丘：「太子見老、病人，知世苦惱，又見死人，戀世情滅；",
        "translation": "The Buddha said to the bhikṣus: When the prince saw old age and sickness, he knew that the world was afflicted by suffering. And when he saw a dead man dying, his attachment to the world ceased.",
        "source": "T01n0001_001:0007a18_21"
    },
    {
        "source_sentence": "及見沙門，廓然大悟。",
        "translation": "When he saw the ascetic, he suddenly became greatly enlightened.",
        "source": "T01n0001_001:0007a19_22"
    },
    {
        "source_sentence": "下寶車時，步步中間轉遠縛著，是真出家，是真遠離。",
        "translation": "When he lowers the jeweled chariot, he walks in between and turns far away from it, which is true renunciation and true detachment.",
        "source": "T01n0001_001:0007a20_23"
    },
    {
        "source_sentence": "時，彼國人聞太子剃除鬚髮，法服持鉢，出家修道，咸相謂言：『此道必真，",
        "translation": "When the people of that country heard that the prince had shaved his hair and beard, donned the religious robes, took up bowls, renounced domestic life, and practiced Buddhism, they all said to each other, “This path is bound to be true.",
        "source": "T01n0001_001:0007a21_24"
    },
    {
        "source_sentence": "乃令太子捨國榮位，捐棄所重。』",
        "translation": "He then ordered the prince to relinquish his kingdom's position of honor and abandon what was important.'",
        "source": "T01n0001_001:0007a23_25"
    },
    {
        "source_sentence": "于時，國中八萬四千人往就太子，求為弟子，出家修道。」",
        "translation": "Eighty-four thousand people in the kingdom then went to the prince, seeking to become his disciples and leaving home to cultivate their practice.",
        "source": "T01n0001_001:0007a24_26"
    },
    {
        "source_sentence": "「撰擇深妙法，　　彼聞隨出家；",
        "translation": "Compilation of profound and subtle teachings, Those who hear them leave the householder’s life accordingly.",
        "source": "T01n0001_001:0007a25_27"
    },
    {
        "source_sentence": "　離於恩愛獄，　　無有眾結縛。",
        "translation": "Being free of the hell of kindness and craving, there are no many bonds.",
        "source": "T01n0001_001:0007a25_27"
    },
    {
        "source_sentence": "佛時頌曰：「于時，太子即便納受，與之遊行，在在教化。",
        "translation": "The Buddha then composed a verse in verse: At that time the prince accepted it. He traveled with him, teaching and edifying [the bhikṣu] everywhere.",
        "source": "T01n0001_001:0007a25_27"
    },
    {
        "source_sentence": "從村至村，從國至國，所至之處，無不恭敬四事供養。",
        "translation": "From village to village, from country to country, and wherever he went, there were no people who didn't fail to respect the four kinds of offerings.",
        "source": "T01n0001_001:0007a29_0"
    },
    {
        "source_sentence": "菩薩念言：『吾與大眾，遊行諸國，人間憒閙，此非我宜。",
        "translation": "The bodhisattva thought, 'I'm traveling with the masses to various countries and the people are clamorous; this is not appropriate for me.",
        "source": "T01n0001_001:0007b01_1"
    },
    {
        "source_sentence": "何時當得離此群眾，閑靜之處以求道真，尋獲志願，於閑靜處專精修道？』",
        "translation": "When will you be able to leave this crowd and seek the true path in a quiet place, find your aspiration, and concentrate on cultivating it in a quiet place?'",
        "source": "T01n0001_001:0007b02_2"
    },
    {
        "source_sentence": "復作是念：『眾生可愍，常處闇冥，受身危脆，有生、有老、有病、有死，",
        "translation": "Again, they think: Sentient beings are pitiable and always in darkness. They experience physical fragility; some are born, some grow old, some become ill, some die.",
        "source": "T01n0001_001:0007b04_3"
    },
    {
        "source_sentence": "眾苦所集，死此生彼，從彼生此，緣此苦陰，流轉無窮，我當何時曉了苦陰，",
        "translation": "When will I perceive the aggregate of suffering, which is born from death here and birth there, or when will it be born here?",
        "source": "T01n0001_001:0007b05_4"
    },
    {
        "source_sentence": "滅生、老、死？』",
        "translation": "To cease birth, old age, and death?'",
        "source": "T01n0001_001:0007b07_5"
    },
    {
        "source_sentence": "「復作是念：『生死何從？",
        "translation": "Again, he thought, 'Where will birth and death come from?'",
        "source": "T01n0001_001:0007b07_6"
    },
    {
        "source_sentence": "何緣而有？』",
        "translation": "What's the reason it exists?'",
        "source": "T01n0001_001:0007b08_7"
    },
    {
        "source_sentence": "即以智慧觀察所由，從生有老死，生是老死緣；",
        "translation": "That is to say, by means of knowledge and wisdom one observes the reasons why birth has old age and death as its condition. Birth is the condition for old age and death.",
        "source": "T01n0001_001:0007b08_8"
    },
    {
        "source_sentence": "生從有起，有是生緣；",
        "translation": "Birth is produced from existence, and existence is the condition for birth.",
        "source": "T01n0001_001:0007b09_9"
    },
    {
        "source_sentence": "有從取起，取是有緣；",
        "translation": "Some arise from grasping, and grasping is the condition as supporting object.",
        "source": "T01n0001_001:0007b10_10"
    },
    {
        "source_sentence": "取從愛起，愛是取緣；",
        "translation": "Grasping is produced from thirst. Thirst is the supporting object of grasping.",
        "source": "T01n0001_001:0007b10_11"
    },
    {
        "source_sentence": "愛從受起，受是愛緣；",
        "translation": "Desire is produced from feeling, and feeling is the condition for craving.",
        "source": "T01n0001_001:0007b11_12"
    },
    {
        "source_sentence": "受從觸起，觸是受緣；",
        "translation": "Feeling is produced from contact, and contact is the supporting object of feeling.",
        "source": "T01n0001_001:0007b11_13"
    },
    {
        "source_sentence": "觸從六入起，六入是觸緣；",
        "translation": "contact arises from six sense operations: the six sense operations are the supporting object of contact.",
        "source": "T01n0001_001:0007b12_14"
    },
    {
        "source_sentence": "六入從名色起，名色是六入緣；",
        "translation": "The six sense operations arise from name and form. Name and form are the supporting object of the six sense operations.",
        "source": "T01n0001_001:0007b12_15"
    },
    {
        "source_sentence": "名色從識起，識是名色緣；",
        "translation": "Name and form arise from consciousness. Consciousness is the supporting object of name and form.",
        "source": "T01n0001_001:0007b13_16"
    },
    {
        "source_sentence": "識從行起，行是識緣；",
        "translation": "Consciousness is produced from conditioned forces, and conditioned forces are the supporting cause of consciousness.",
        "source": "T01n0001_001:0007b14_17"
    },
    {
        "source_sentence": "行從癡起，癡是行緣。",
        "translation": "Conditioned forces arise from delusion: delusion is the supporting condition for conditioned forces.",
        "source": "T01n0001_001:0007b14_18"
    },
    {
        "source_sentence": "是為緣癡有行，緣行有識，緣識有名色，緣名色有六入，緣六入有觸，",
        "translation": "These are the reasons why delusion has formations for its conditions, why formations have consciousness for its conditions, why there is mental and physical processing for its conditions, why there are the six sense operations for its conditions, and why there is contact for its conditions.",
        "source": "T01n0001_001:0007b15_19"
    },
    {
        "source_sentence": "緣觸有受，緣受有愛，緣愛有取，緣取有有，緣有有生，緣生有老、病、死、憂、悲、苦惱，",
        "translation": "Conditioned by contact, there is sensation; conditioned by sensation, there is thirst; conditioned by thirst, there is grasping; conditioned by grasping, there is existence; conditioned by grasping, there is birth; conditioned by birth, there is old age, sickness, death, sorrow, lamentation, pity, and suffering.",
        "source": "T01n0001_001:0007b17_0"
    },
    {
        "source_sentence": "此苦盛陰，緣生而有，是為苦集。",
        "translation": "This mass aggregate of suffering, which exists by reason of its arising, is the origin of suffering.",
        "source": "T01n0001_001:0007b18_1"
    },
    {
        "source_sentence": "菩薩思惟：苦集陰時，生智、生眼、生覺、生明、生通、生慧、生證。",
        "translation": "The bodhisattva reflects: When the aggregate of suffering's accumulation is produced, knowledge, eye, feeling, insight, insight, penetration, wisdom, and realization are produced.",
        "source": "T01n0001_001:0007b19_2"
    },
    {
        "source_sentence": "「於時，菩薩復自思惟：『何等無故老死無？",
        "translation": "At the time, the bodhisattva again thought to himself, 'What's the reason old age and death are absent?'",
        "source": "T01n0001_001:0007b21_3"
    },
    {
        "source_sentence": "何等滅故老死滅？』",
        "translation": "What is the cessation of old age and death because of their cessation?'",
        "source": "T01n0001_001:0007b22_0"
    },
    {
        "source_sentence": "即以智慧觀察所由，生無故老死無，生滅故老死滅；",
        "translation": "That is to say, by means of knowledge and wisdom they observe the reasons why old age and death are absent because birth is absent.",
        "source": "T01n0001_001:0007b22_1"
    },
    {
        "source_sentence": "有無故生無，有滅故生滅；",
        "translation": "Because of existence and nonexistence, there is arising and nonexistence; because of existence and cessation, there is arising and ceasing.",
        "source": "T01n0001_001:0007b23_2"
    },
    {
        "source_sentence": "取無故有無，取滅故有滅；",
        "translation": "Because grasping is nonexistent, there is existence and nonexistence; because the grasping ceases, there is cessation.",
        "source": "T01n0001_001:0007b24_3"
    },
    {
        "source_sentence": "愛無故取無，愛滅故取滅；",
        "translation": "Because thirst is absent, grasping is absent; because of the cessation of thirst, grasping ceases to be.",
        "source": "T01n0001_001:0007b24_4"
    },
    {
        "source_sentence": "受無故愛無，受滅故愛滅；",
        "translation": "Because feeling is absent, thirst is absent; because feeling ceases, thirst ceases to be.",
        "source": "T01n0001_001:0007b25_5"
    },
    {
        "source_sentence": "觸無故受無，觸滅故受滅；",
        "translation": "Feeling is nonexistent because of the absence of tangibles; feeling ceases because of the destruction of tangibles.",
        "source": "T01n0001_001:0007b26_6"
    },
    {
        "source_sentence": "六入無故觸無，六入滅故觸滅；",
        "translation": "When the sixfold sense operation is absent, there is no more contact; when the sixfold sense operation ceases, there is no more contact.",
        "source": "T01n0001_001:0007b26_7"
    },
    {
        "source_sentence": "名色無故六入無，名色滅故六入滅；",
        "translation": "Because name and form are absent, the six sense operations are absent; because name and form cease, the six sense operations cease.",
        "source": "T01n0001_001:0007b27_8"
    },
    {
        "source_sentence": "識無故名色無，識滅故名色滅；",
        "translation": "Names and forms are absent because consciousness is absent. Names and forms disappear because consciousness ceases.",
        "source": "T01n0001_001:0007b28_9"
    },
    {
        "source_sentence": "行無故識無，行滅故識滅；",
        "translation": "Consciousness ceases because formations are absent, and it is the cessation of formations that causes consciousness to cease.",
        "source": "T01n0001_001:0007b29_10"
    },
    {
        "source_sentence": "癡無故行無，癡滅故行滅。",
        "translation": "Because delusion is absent, volition is absent; because of the cessation of delusion, volition is extinguished.",
        "source": "T01n0001_001:0007b29_11"
    },
    {
        "source_sentence": "是為癡滅故行滅，行滅故識滅，識滅故名色滅，名色滅故六入滅，六入滅故觸滅，",
        "translation": "This is the cessation of volition because of the cessation of delusion; the cessation of consciousness because of the cessation of volition; the cessation of name-and-form because of the cessation of consciousness; the cessation of the six sense operations because of the cessation of name-and-form; and the cessation of",
        "source": "T01n0001_001:0007c01_12"
    },
    {
        "source_sentence": "觸滅故受滅，受滅故愛滅，愛滅故取滅，取滅故有滅，有滅故生滅，生滅故老、死、憂、悲、苦惱滅。",
        "translation": "Because of the cessation of contact, feeling ceases; because of the cessation of feeling, thirst ceases; because of the cessation of thirst, grasping ceases; because of the cessation of grasping, existence ceases; because of the cessation of existence, birth ceases; because of the cessation of birth, old age, death, sorrow",
        "source": "T01n0001_001:0007c03_13"
    },
    {
        "source_sentence": "菩薩思惟：『苦陰滅時，生智、生眼、生覺、生明、生通、生慧、生證。』",
        "translation": "When the bodhisattva contemplates, 'When the aggregate of suffering ceases, knowledge arises, vision arises, perception arises, insight arises, penetration arises, wisdom arises, and realization arises.'",
        "source": "T01n0001_001:0007c05_14"
    },
    {
        "source_sentence": "爾時，菩薩逆順觀十二因緣，如實知，如實見已，即於座上成阿耨多羅三藐三菩提。」",
        "translation": "At that point, the bodhisattva observes the twelve causes and conditions as they really are, knows them as they really are, and after seeing them as they really are, he then accomplishes unsurpassed, correct, and complete enlightenment on his seat.",
        "source": "T01n0001_001:0007c06_15"
    },
    {
        "source_sentence": "「此言眾中說，　　汝等當善聽，",
        "translation": "You should listen attentively to these words uttered in the assembly.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　過去菩薩觀，　　本所未聞法。",
        "translation": "In the past, bodhisattvas observed things that they hadn't heard before.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　老死從何緣？　　因何等而有？",
        "translation": "“World-honored One, what is the cause of old age and death?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是正觀已，　　知其本由生。",
        "translation": "Having correctly observed them in this way, They know the origin of their arising.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　生本由何緣？　　因何事而有？",
        "translation": "By what cause and by what condition are they produced?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是思惟已，　　知生從有起。",
        "translation": "Having thought in this way, they know that birth arises from existence.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　取彼取彼已，　　展轉更增有；",
        "translation": "Grasping to this and grasping to that, there is successively more and more existence.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　是故如來說，　　取是有因緣。",
        "translation": "Therefore, the Tathāgata teaches that grasping is a cause and condition.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如眾穢惡聚，　　風吹惡流演；",
        "translation": "Like the mass of defiled and unwholesome clusters, The wind blows and the evil currents flow.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是取相因，　　因愛而廣普。",
        "translation": "Thus, the cause of grasping characteristics is wide and universal because of craving.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　愛由於受生，　　起苦羅網本；",
        "translation": "Sentient beings are the root cause of craving, And it is by relying on sensation that they give rise To the root of the web of suffering.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　以染著因緣，　　苦樂共相應。",
        "translation": "Because of the causes and conditions of defiled attachment, it's associated with pain and pleasure in common.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　受本由何緣？　　因何而有受？",
        "translation": "What is the origin of feeling and by what cause are there feelings?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　以是思惟已，　　知受由觸生。",
        "translation": "Having reflected on this, he knows that sensation arises from contact.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　觸本由何緣？　　因何而有觸？",
        "translation": "What is the origin of sense perception and what is its cause?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是思惟已，　　觸由六入生。",
        "translation": "Having thought in this way, they are born of the six āyatanas.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　六入本何緣？　　因何有六入？",
        "translation": "What is the origin of the sixfold sense operation?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是思惟已，　　六入名色生。",
        "translation": "Having thought in this way, The six āyatanṉas arise:",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　名色本何緣？　　因何有名色？",
        "translation": "What is the root of name and form, and what is its cause?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是思惟已，　　名色從識生。",
        "translation": "Having reflected in this way, Name and form arise from consciousness.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　識本由何緣？　　因何而有識？",
        "translation": "What is the origin of consciousness?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是思惟已，　　知識從行生。",
        "translation": "Having thought in this way, Knowledge arises from practice.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　行本由何緣？　　因何而有行？",
        "translation": "What is the foundational cause of conditioned forces, and what is their cause?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是思惟已，　　知行從癡生。",
        "translation": "Having thought in this way, They know the formations arise from delusion.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如是因緣者，　　名為實義因，",
        "translation": "Such causes and conditions are called the true meaningful causes.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　智慧方便觀，　　能見因緣根。",
        "translation": "Wisdom, skillful means and contemplation can see the faculty of causes and conditions.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　苦非賢聖造，　　亦非無緣有，",
        "translation": "Suffering is not created by the wise and holy, Nor does it exist without conditions.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　是故變易苦，　　智者所斷除。",
        "translation": "For this reason the suffering of transmutation Is to be abandoned by the wise.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若無明滅盡，　　是時則無行；",
        "translation": "When nescience ceases, There is no action at that time.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若無有行者，　　則亦無有識；",
        "translation": "If there were no conditioned things, Neither would there be consciousness.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若識永滅者，　　亦無有名色；",
        "translation": "When consciousness ceases, Neither is there mental and physical process.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　名色既已滅，　　即無有諸入；",
        "translation": "Once name and form have ceased, There are no sense-fields.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若諸入永滅，　　則亦無有觸；",
        "translation": "If all sense-fields are permanently extinguished, Neither is there contact.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若觸永滅者，　　則亦無有受；",
        "translation": "When sense contact ceases, Neither is there sensation.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若受永滅者，　　則亦無有愛；",
        "translation": "If sensation ceases, Neither is there thirst nor craving.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若愛永滅者，　　則亦無有取；",
        "translation": "When craving ceases, Neither is grasping apprehension.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若取永滅者，　　則亦無有有；",
        "translation": "If grasping were to cease forever, Neither would there be existence nor nonexistence.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若有永滅者，　　則亦無有生；",
        "translation": "If there is an eternal cessation, Then there also is no birth.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若生永滅者，　　無老病苦陰；",
        "translation": "If it arises and perishes, There is no aggregate of old age, sickness, or suffering.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　一切都永盡，　　智者之所說。",
        "translation": "All of them will be permanently extinguished, as the wise one explains.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　十二緣甚深，　　難見難識知；",
        "translation": "The twelve conditions are profound, hard to see and hard to know.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　唯佛能善覺，　　因是有是無。",
        "translation": "Only Buddha can well awaken: The cause is existence and the condition is nonexistence.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若能自觀察，　　則無有諸入；",
        "translation": "If one can observe for himself, Then there are no sense(-fields) to enter.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　深見因緣者，　　更不外求師。",
        "translation": "Those who deeply see causes and conditions don't look outside for a teacher.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　能於陰界入，　　離欲無染者；",
        "translation": "Those who are able to enter the aggregates, realms, and sense-fields, Being free from desire and without defilement.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　堪受一切施，　　淨報施者恩。",
        "translation": "They're capable of accepting all kinds of gifts, and the pure reward for giving is kindness.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　若得四辯才，　　獲得決定證；",
        "translation": "If one attains the four powers of elucidation, They will attain certain realization.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　能解眾結縛，　　斷除無放逸。",
        "translation": "He's able to untie the bonds of all bonds and remove them without laziness.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　色受想行識，　　猶如朽故車；",
        "translation": "Form, feeling, perception, ideation, volition, and consciousness are like rotten old carts.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　能諦觀此法，　　則成等正覺。",
        "translation": "Able to contemplate these things with certainty, One becomes perfectly enlightened.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　如鳥遊虛空，　　東西隨風逝；",
        "translation": "Like a bird traveling through the sky, Traveling east and west in the wind.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　菩薩斷眾結，　　如風靡輕衣。",
        "translation": "Enlightening beings cut all bonds, Like the wind blowing on a light garment.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　毗婆尸閑靜，　　觀察於諸法；",
        "translation": "Vipaśyin, in a secluded place, surveyed the teachings.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　老死何緣有？　　從何而得滅？",
        "translation": "What is the reason why old age and death exist, and from what point of view?",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　彼作是觀已，　　生清淨智慧；",
        "translation": "Having contemplated thus, They produce pure wisdom.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "　知老死由生，　　生滅老死滅。",
        "translation": "He knows that old age and death are produced by birth, and that birth ceases and old age and death cease.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "佛時頌曰：「毗婆尸佛初成道時，多修二觀，一曰安隱觀，二曰出離觀。」",
        "translation": "The Buddha then spoke in verse, When Vipaśyin Buddha first became a buddha, he often cultivated two kinds of contemplation, the first being the contemplation of peace and the second being the contemplation of liberation.",
        "source": "T01n0001_001:0007c08_16"
    },
    {
        "source_sentence": "「如來無等等，　　多修於二觀；",
        "translation": "The Tathāgata is peerless, Mostly practicing the two contemplations.",
        "source": "T01n0001_001:0008b08_17"
    },
    {
        "source_sentence": "　安隱及出離，　　仙人度彼岸。",
        "translation": "Peaceful and liberated, the sage crosses over to the other shore.",
        "source": "T01n0001_001:0008b08_17"
    },
    {
        "source_sentence": "　其心得自在，　　斷除眾結使；",
        "translation": "Their minds attain freedom of thought, Extinguishing all bonds and tendencies.",
        "source": "T01n0001_001:0008b08_17"
    },
    {
        "source_sentence": "　登山觀四方，　　故號毘婆尸。",
        "translation": "He climbed up the mountain and looked in all directions; For this reason he was called Vipaśyin.",
        "source": "T01n0001_001:0008b08_17"
    },
    {
        "source_sentence": "　大智光除冥，　　如以鏡自照；",
        "translation": "The light of great knowledge removes darkness, Just as a mirror illuminates itself.",
        "source": "T01n0001_001:0008b08_17"
    },
    {
        "source_sentence": "　為世除憂惱，　　盡生老死苦。",
        "translation": "In order to remove sorrow and vexation for the world, he ends the suffering of birth, old age, and death.",
        "source": "T01n0001_001:0008b08_17"
    },
    {
        "source_sentence": "佛於是頌曰：「毗婆尸佛於閑靜處復作是念：『我今已得此無上法，甚深微妙，",
        "translation": "Then the Buddha continued in verse: The Buddha Vipaśyin, in his secluded place, thought: I have now attained this supreme state of absorption that is profound and subtle.",
        "source": "T01n0001_001:0008b08_17"
    },
    {
        "source_sentence": "難解難見，息滅、清淨，智者所知，非是凡愚所能及也。",
        "translation": "What's difficult to understand and difficult to see, ceases and becomes pure, known by wise people, but it's beyond the ability of ordinary foolish people.",
        "source": "T01n0001_001:0008b16_18"
    },
    {
        "source_sentence": "斯由眾生異忍、異見、異受、異學，依彼異見，各樂所求，各務所習。",
        "translation": "Because sentient beings have different forms of patience, different views, different feelings, and different ways of learning. Depending on those different views, each delights in what is sought and strives for what is practiced.",
        "source": "T01n0001_001:0008b17_19"
    },
    {
        "source_sentence": "是故於此甚深因緣，不能解了，然愛盡涅槃，倍復難知，我若為說，彼必不解，",
        "translation": "Because of these profound reasons, they cannot understand them. However, it is even more difficult to know the extinction of their craving for nirvana. If I were to explain it to them, they would surely not understand:",
        "source": "T01n0001_001:0008b19_20"
    },
    {
        "source_sentence": "更生觸擾。』",
        "translation": "They'll again give rise to contact and disturbance.'",
        "source": "T01n0001_001:0008b21_21"
    },
    {
        "source_sentence": "作是念已，即便默然不復說法。",
        "translation": "After he had this thought, he remained silent and didn't explain the teaching again.",
        "source": "T01n0001_001:0008b21_22"
    },
    {
        "source_sentence": "「時，梵天王知毗婆尸如來所念，即自思惟：『念此世間便為敗壞，甚可哀愍。",
        "translation": "Knowing what the Tathāgata Vipaśyin thought, King Brahmadeva thought to himself, “Thinking about this world, I am afraid it will perish.",
        "source": "T01n0001_001:0008b22_23"
    },
    {
        "source_sentence": "毗婆尸佛乃得知此深妙之法，而不欲說。』",
        "translation": "Vipaśyin Buddha then knew this profound and marvelous teaching but didn't want to explain it.'",
        "source": "T01n0001_001:0008b23_24"
    },
    {
        "source_sentence": "譬如力士屈伸臂頃，從梵天宮忽然來下，立於佛前，頭面禮足，却住一面。",
        "translation": "It's like when a strong man suddenly comes down from the palace of Brahma and stands in front of the Buddha, venerates him by bowing his forehead and feet, and withdrew to one side.",
        "source": "T01n0001_001:0008b24_25"
    },
    {
        "source_sentence": "時，梵天王右膝著地，叉手合掌白佛言：『唯願世尊以時說法！",
        "translation": "The king of the Brahmadeva gods then knelt with his right knee on the ground, saluted the Buddha with palms joined and said to him, 'All we ask, Bhagavān, is that you explain the teaching at the proper time!'",
        "source": "T01n0001_001:0008b26_26"
    },
    {
        "source_sentence": "今此眾生塵垢微薄，諸根猛利，有恭敬心，易可開化，畏怖後世無救之罪，",
        "translation": "These sentient beings now have little defilement. Their faculties are vigorous and their faculties strong. With respect they can easily be disciplined, fearing that there will not be any blameworthy crimes in the afterlife.",
        "source": "T01n0001_001:0008b28_27"
    },
    {
        "source_sentence": "能滅惡法，出生善道。』",
        "translation": "It's able to cease bad dharmas and give rise to good paths.'",
        "source": "T01n0001_001:0008b29_28"
    },
    {
        "source_sentence": "「佛告梵王：『如是！",
        "translation": "The Buddha told the Brahmā king, 'So it is!",
        "source": "T01n0001_001:0008c01_29"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T01n0001_001:0008c01_30"
    },
    {
        "source_sentence": "如汝所言，但我於閑靜處默自思念：所得正法甚深微妙，若為彼說，彼必不解，",
        "translation": "As you say, I remained silent in my secluded place and thought to myself: The true-dharma that I have attained is profound and subtle. If I teach it to others, they will surely not understand it.",
        "source": "T01n0001_001:0008c01_31"
    },
    {
        "source_sentence": "更生觸擾，故我默然不欲說法。",
        "translation": "That's why I remained silent and didn't want to teach the Dharma.",
        "source": "T01n0001_001:0008c03_32"
    },
    {
        "source_sentence": "我從無數阿僧祇劫，勤苦不懈，修無上行，今始獲此難得之法，若為婬、怒、癡眾生說者，",
        "translation": "“For innumerable kalpas I have practiced this unsurpassed path with no slackening or laxity. For the first time now I am able to attain this rare and difficult state of enlightenment.",
        "source": "T01n0001_001:0008c04_33"
    },
    {
        "source_sentence": "必不承用，徒自勞疲。",
        "translation": "They won't accept it, and they'll simply tire themselves.",
        "source": "T01n0001_001:0008c06_34"
    },
    {
        "source_sentence": "此法微妙，與世相反，眾生染欲，愚冥所覆，不能信解。",
        "translation": "This doctrine is subtle and contrary to the world. Sentient beings, stained by desire and shrouded in ignorance, are unable to believe it.",
        "source": "T01n0001_001:0008c07_0"
    },
    {
        "source_sentence": "梵王！",
        "translation": "Brahmā king!",
        "source": "T01n0001_001:0008c08_1"
    },
    {
        "source_sentence": "我觀如此，是以默然不欲說法。』",
        "translation": "I observe this, so I'm silent and don't want to teach the Dharma.'",
        "source": "T01n0001_001:0008c08_2"
    },
    {
        "source_sentence": "「時，梵天王復重勸請，慇懃懇惻，至于再三：『世尊！",
        "translation": "The king of the Brahmadeva gods then again repeated his invitation, became angry and earnest, until he said three times, 'Bhagavān!",
        "source": "T01n0001_001:0008c09_3"
    },
    {
        "source_sentence": "若不說法，今此世間便為壞敗，甚可哀愍。",
        "translation": "If someone doesn't teach the Dharma, this world will now be destroyed and decayed, which is pitiable.",
        "source": "T01n0001_001:0008c10_4"
    },
    {
        "source_sentence": "唯願世尊以時敷演，勿使眾生墜落餘趣！』",
        "translation": "Please, Bhagavān, don't let sentient beings fall into other destinies!'",
        "source": "T01n0001_001:0008c11_5"
    },
    {
        "source_sentence": "爾時，世尊三聞梵王慇懃勸請，即以佛眼觀視世界，眾生垢有厚薄，根有利鈍，",
        "translation": "At that time the World-honored One, being implored by the brahma kings of the three hearers, looked over the world with the Buddha’s eye and saw that sentient beings therein were thick and dull in defilement, with sharp and weak faculties.",
        "source": "T01n0001_001:0008c12_6"
    },
    {
        "source_sentence": "教有難易。",
        "translation": "There are difficulties and difficulties in teaching.",
        "source": "T01n0001_001:0008c14_7"
    },
    {
        "source_sentence": "易受教者畏後世罪，能滅惡法，出生善道。",
        "translation": "Those who easily receive the teaching fear future sins, which can extinguish bad qualities and give rise to good destinies.",
        "source": "T01n0001_001:0008c14_8"
    },
    {
        "source_sentence": "譬如優鉢羅花、鉢頭摩華、鳩勿頭華、分陀利華，或有始出汙泥未至水者，",
        "translation": "It's like the utpala flower, padma flower, kumbhūta flower, and puṇḍarīka flower, or there may be someone who emerges from dirty mud but doesn't reach water.",
        "source": "T01n0001_001:0008c15_9"
    },
    {
        "source_sentence": "或有已出與水平者，或有出水未敷開者，然皆不為水所染著，易可開敷。",
        "translation": "Sometimes there's someone who has emerged and is level, and sometimes there's someone who emerges but doesn't open it, but they aren't stained by water and are easy to open and cover.",
        "source": "T01n0001_001:0008c17_10"
    },
    {
        "source_sentence": "世界眾生，亦復如是。",
        "translation": "So it is with the sentient beings in the world.",
        "source": "T01n0001_001:0008c19_0"
    },
    {
        "source_sentence": "「爾時，世尊告梵王曰：『吾愍汝等，今當開演甘露法門，是法深妙，",
        "translation": "At that time the World-honored One said to the brahma kings: Having pity on you, I will now expound the teaching of the ambrosia of immortality. This teaching is profound and subtle.",
        "source": "T01n0001_001:0008c19_1"
    },
    {
        "source_sentence": "難可解知，今為信受樂聽者說，不為觸擾無益者說。』",
        "translation": "It's difficult to understand and know, but now I'll explain it for those who believe and listen with joy, not for those who are disturbed by contact and useless.'",
        "source": "T01n0001_001:0008c21_0"
    },
    {
        "source_sentence": "「爾時，梵王知佛受請，歡喜踊躍，遶佛三匝，頭面禮足，忽然不現。",
        "translation": "Knowing that the Buddha had accepted his invitation, Brahmā rejoiced and jumped for joy. He circumambulated the Buddha three times, bowed his forehead at his feet, and suddenly disappeared.",
        "source": "T01n0001_001:0008c22_1"
    },
    {
        "source_sentence": "其去未久，是時如來靜默自思：『我今先當為誰說法？』",
        "translation": "Not long after his departure, the Tathāgata then quietly thought to himself, 'Who will I teach the Dharma for now?'",
        "source": "T01n0001_001:0008c23_2"
    },
    {
        "source_sentence": "即自念言：『當入槃頭城內，先為王子提舍、大臣子騫茶開甘露法門。』",
        "translation": "He then thought to himself, 'Should I enter the city of Padmavṛṣa and first open the ambrosial dharma-gate for Prince Tiṣya and the minister's son Candra?'",
        "source": "T01n0001_001:0008c24_3"
    },
    {
        "source_sentence": "於是，世尊如力士屈伸臂頃，於道樹忽然不現，至槃頭城槃頭王鹿野苑中，",
        "translation": "Then the World-honored One, just as if a strong man were to bend and stretch out his arm, suddenly disappeared from the tree of enlightenment. He came to the city of Padmavyūha, where he was staying in the Deer Preserve of King Pāṭikāputra’s Deer Park.",
        "source": "T01n0001_001:0008c26_4"
    },
    {
        "source_sentence": "敷座而坐。」",
        "translation": "He spreads out his seat and sits there.",
        "source": "T01n0001_001:0008c28_5"
    },
    {
        "source_sentence": "「如師子在林，　　自恣而遊行；",
        "translation": "“Suppose a lion is in the forest, Traveling freely and at will.",
        "source": "T01n0001_001:0008c28_6"
    },
    {
        "source_sentence": "　彼佛亦如是，　　遊行無罣礙。",
        "translation": "So it is with that Buddha, Who travels without obstruction.",
        "source": "T01n0001_001:0008c28_6"
    },
    {
        "source_sentence": "佛於是頌曰：「毘婆尸佛告守苑人曰：『汝可入城，語王子提舍、大臣子騫茶：寧欲知不？",
        "translation": "The Buddha then composed the following verse: Vipaśyin Buddha said to the guardians of the park, “May you enter the city and tell Prince Tiṣya and his ministers, ‘Do you wish to know this?",
        "source": "T01n0001_001:0008c28_6"
    },
    {
        "source_sentence": "毘婆尸佛今在鹿野苑中，欲見卿等，宜知是時。』",
        "translation": "Vipaśyin Buddha is now in the Deer Preserve, and if he wants to see you, it's a good idea to know this.'",
        "source": "T01n0001_001:0009a03_7"
    },
    {
        "source_sentence": "時，彼守苑人受教而行，至彼二人所，具宣佛教。",
        "translation": "The guards of the park then took their instruction and went to those two people, where they explained the Buddha's teaching in detail.",
        "source": "T01n0001_001:0009a04_8"
    },
    {
        "source_sentence": "二人聞已，即至佛所，頭面禮足，却坐一面。",
        "translation": "Having heard this, the two men went to the Buddha. After bowing their foreheads and feet at his feet, they withdrew and sat off to one side.",
        "source": "T01n0001_001:0009a06_0"
    },
    {
        "source_sentence": "佛漸為說法，示教利喜：施論、戒論、生天之論，欲惡不淨，上漏為患，",
        "translation": "The Buddha gradually taught them the Dharma, encouraging, guiding, benefiting, and delighting them: the doctrine of generosity, the doctrine of morality, the doctrine of rebirth in heaven, the doctrine that desire is evil and unclean, and the doctrine that higher learning is a danger.",
        "source": "T01n0001_001:0009a06_1"
    },
    {
        "source_sentence": "讚歎出離為最微妙清淨第一。",
        "translation": "He praises renunciation as the most subtle, pure, and foremost.",
        "source": "T01n0001_001:0009a08_2"
    },
    {
        "source_sentence": "爾時，世尊見此二人心意柔輭，歡喜信樂，堪受正法，於是即為說苦聖諦，",
        "translation": "At that time the World-honored One, seeing that their minds and hearts were gentle and receptive, joyful and faithful, ready to receive the true teaching, then taught them the holy truth of suffering.",
        "source": "T01n0001_001:0009a09_3"
    },
    {
        "source_sentence": "敷演開解，分布宣釋苦集聖諦、苦滅聖諦、苦出要諦。",
        "translation": "They expound and explain the noble truth of suffering's accumulation, the noble truth of suffering's cessation, and the essential truth of suffering's escape.",
        "source": "T01n0001_001:0009a10_4"
    },
    {
        "source_sentence": "「爾時，王子提舍、大臣子騫茶，即於座上遠離塵垢，得法眼淨，猶若素質易為受染。",
        "translation": "At the time, Prince Tiṣya and the minister's son Kauṇḍinya were seated on their seats, removed themselves from dirt and dirt, and attained purity of the Dharma eye, just as if they were simple and easy to stain.",
        "source": "T01n0001_001:0009a12_5"
    },
    {
        "source_sentence": "是時，地神即唱斯言：『毗婆尸如來於槃頭城鹿野苑中轉無上法輪，沙門、婆羅門、諸天、魔、梵及餘世人所不能轉。』",
        "translation": "The earth god then called out, saying, 'The Tathāgata Vipaśyin turns the unsurpassed Dharma wheel in the Deer Preserve of the Buddha's Park in the city of Padmavṛṣa, which ascetics, priests, gods, Māras, Brahmās, and other worldly people can't turn it.'",
        "source": "T01n0001_001:0009a14_6"
    },
    {
        "source_sentence": "如是展轉，聲徹四天王，乃至他化自在天，須臾之頃，聲至梵天。」",
        "translation": "In this way, the sound spreads and penetrates the four heavenly kings up to the Paranirmitavaśavartin gods, and in a moment's time, the sound reaches the Brahma Heaven.",
        "source": "T01n0001_001:0009a16_7"
    },
    {
        "source_sentence": "「歡喜心踊躍，　　稱讚於如來，",
        "translation": "With joy and hearts roaring, They praised the buddhas.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　毘婆尸成佛，　　轉無上法輪。",
        "translation": "Vipaśyin becomes a buddha, Turning the supreme wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　初從樹王起，　　往詣槃頭城，",
        "translation": "At first he rose from the king of trees And approached the city of Padmavṛṣa.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　為騫茶、提舍，　　轉四諦法輪。",
        "translation": "He turns the wheel of the Dharma of the four truths for the sake of Kauṇḍinya and Tiṣya.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　時騫茶、提舍，　　受佛教化已，",
        "translation": "After they had received the teaching of Buddhism, Kauṣṭhila and Tiṣya Bodhisattvas",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　於淨法輪中，　　梵行無有上。",
        "translation": "In the pure wheel of the Dharma, there's nothing higher than the religious practice.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　彼忉利天眾，　　及以天帝釋，",
        "translation": "The Trāyastriṃśa gods and Śakra Devānām-Indra,",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　歡喜轉相告，　　諸天無不聞。",
        "translation": "Rejoicing, they tell each other, and none of the gods hear them.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　佛出於世間，　　轉無上法輪；",
        "translation": "The Buddha has appeared in the world, Turning the supreme wheel of teaching.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　增益諸天眾，　　減損阿須倫。",
        "translation": "They increase the number of gods and decrease the asuras.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　昇仙名普聞，　　善智離世邊；",
        "translation": "The supremely enlightened sage is universally renowned, Whose good knowledge transcends the world.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　於諸法自在，　　智慧轉法輪。",
        "translation": "Being free of all dharmas, his wisdom turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　觀察平等法，　　息心無垢穢；",
        "translation": "Observing the principle of equality, They calm their minds without defilement.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　以離生死扼，　　智慧轉法輪。",
        "translation": "Being free of the bondage of birth and death, he turns the wheel of the Dharma with wisdom.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　滅苦離諸惡，　　出欲得自在；",
        "translation": "Cessation of suffering, separation from evil, Deliverance from desire and attain freedom.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　離於恩愛獄，　　智慧轉法輪。",
        "translation": "Being free of the hell of kindness and craving, his wisdom turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　正覺人中尊，　　二足尊調御；",
        "translation": "The Right Enlightened One is the honored one among humans. He is the Tamer of Two-Footed Honored Ones.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　一切縛得解，　　智慧轉法輪。",
        "translation": "All bonds are freed, and wisdom turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　教化善導師，　　能降伏魔怨；",
        "translation": "A teacher who teaches and guides well can overcome the enemies of Māra.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　彼離於諸惡，　　智慧轉法輪。",
        "translation": "They are free of evil, And their knowledge turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　無漏力降魔，　　諸根定不懈；",
        "translation": "The power of noncontamination subdues demons; Their faculties are concentrated without slackening.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　盡漏離魔縛，　　智慧轉法輪。",
        "translation": "Extinguishing the contaminants, they're freed from the demonic bonds, and their wisdom turns the Dharma wheel.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　若學決定法，　　知諸法無我；",
        "translation": "If one studies certain dharmas, One will know that all things are without self.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　此為法中上，　　智慧轉法輪。",
        "translation": "This is the supreme of all dharmas, The wisdom that turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　不以利養故，　　亦不求名譽；",
        "translation": "They don’t seek fame for profit, Nor do they seek fame.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　愍彼眾生故，　　智慧轉法輪。",
        "translation": "Because they pity those sentient beings, their wisdom turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　見眾生苦厄，　　老病死逼迫；",
        "translation": "They see sentient beings in distress, oppressed by old age, sickness, and death.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　為此三惡趣，　　智慧轉法輪。",
        "translation": "For the sake of these three evil destinies, his wisdom turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　斷貪瞋恚癡，　　拔愛之根原；",
        "translation": "They cut off craving, hatred, malice, and delusion And uprooted the roots of desire.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　不動而解脫，　　智慧轉法輪。",
        "translation": "Being unmoving and liberated, he turns the wheel of the Dharma with wisdom.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　難勝我已勝，　　勝已自降伏；",
        "translation": "The difficulty of overcoming is already overcome by self, and the victorious one subdues it on his own.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　已勝難勝魔，　　智慧轉法輪。",
        "translation": "Having conquered the devil that is difficult to conquer, His wisdom turns the wheel of the Dharma.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　此無上法輪，　　唯佛乃能轉；",
        "translation": "Only Buddha can turn this supreme wheel of teaching.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　諸天魔釋梵，　　無有能轉者。",
        "translation": "No gods, Māra, Indra, or Brahmā Can turn it.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　親近轉法輪，　　饒益天人眾；",
        "translation": "They become intimate with the turning of the wheel of the Teaching, Benefiting celestial and human beings.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "　此等天人師，　　得度于彼岸。",
        "translation": "These teachers of gods and humans will be able to cross over to the other shore.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "佛時頌曰：「是時，王子提舍、大臣子騫茶，見法得果，真實無欺，成就無畏，",
        "translation": "The Buddha then continued in verse: At that time the prince Tiṣya and the minister Kauṇḍinya, seeing the Dharma and attaining its fruit, were genuinely free from deceitfulness and had perfected fearlessness.",
        "source": "T01n0001_001:0009a18_8"
    },
    {
        "source_sentence": "即白毘婆尸佛言：『我等欲於如來法中淨修梵行。』",
        "translation": "He then said to Vipaśyin Buddha, 'We want to purify the religious practice in the Tathāgata's teaching.'",
        "source": "T01n0001_001:0009b27_9"
    },
    {
        "source_sentence": "佛言：『善來，比丘！",
        "translation": "The Buddha said, 'Well come, monk!",
        "source": "T01n0001_001:0009b28_10"
    },
    {
        "source_sentence": "吾法清淨自在，修行以盡苦際。』",
        "translation": "My teaching is pure and unimpeded, and I cultivate it to end the limits of suffering.'",
        "source": "T01n0001_001:0009b29_0"
    },
    {
        "source_sentence": "爾時，二人即得具戒。",
        "translation": "At that point, they both attain the full set of precepts.",
        "source": "T01n0001_001:0009b29_1"
    },
    {
        "source_sentence": "具戒未久，如來又以三事示現：一曰神足，二曰觀他心，三曰教誡，即得無漏、心解脫、生死無疑智。",
        "translation": "Not long after he had fulfilled the precepts, the Tathāgata showed them in three ways: first, his supernormal powers, second, observing the minds of others, and third, admonishment, which would enable him to attain uncontaminated, liberated mind and freedom from birth-and-death without doubt.",
        "source": "T01n0001_001:0009c01_2"
    },
    {
        "source_sentence": "「爾時，槃頭城內眾多人民，聞二人出家學道，法服持鉢，淨修梵行，",
        "translation": "“At that time many people in the city of Padmavyūha heard that the two renunciant monks were learning the path, wearing religious robes and holding bowls to purify the holy life.",
        "source": "T01n0001_001:0009c03_3"
    },
    {
        "source_sentence": "皆相謂曰：『其道必真，乃使此等捨世榮位，捐棄所重。』",
        "translation": "They all said to each other, 'The path must be true, so that they'll abandon their position of worldly prosperity and discard what's important.'",
        "source": "T01n0001_001:0009c05_0"
    },
    {
        "source_sentence": "時，城內八萬四千人往詣鹿野苑中毘婆尸佛所，頭面禮足，却坐一面。",
        "translation": "Eighty-four thousand people in the city then went to Vipaśyin Buddha in Deer Preserve, bowed their foreheads and feet, and withdrew to sit at one side.",
        "source": "T01n0001_001:0009c06_1"
    },
    {
        "source_sentence": "佛漸為說法，示教利喜：施論、戒論、生天之論，欲惡不淨，上漏為患，",
        "translation": "The Buddha gradually taught them the Dharma, encouraging, guiding, benefiting, and delighting them: the doctrine of generosity, the doctrine of morality, the doctrine of rebirth in heaven, the doctrine that desire is evil and unclean, and the doctrine that higher learning is a danger.",
        "source": "T01n0001_001:0009c07_2"
    },
    {
        "source_sentence": "讚歎出離為最微妙清淨第一。",
        "translation": "He praises renunciation as the most subtle, pure, and foremost.",
        "source": "T01n0001_001:0009c09_3"
    },
    {
        "source_sentence": "爾時，世尊見此大眾心意柔輭，歡喜信樂，堪受正法，於是即為說苦聖諦，",
        "translation": "At that time the World-honored One, seeing that the minds of those present in the assembly were receptive, joyful, and faithful, ready to receive the true teaching, then taught them the holy truth of suffering.",
        "source": "T01n0001_001:0009c10_4"
    },
    {
        "source_sentence": "敷演開解，分布宣釋苦集聖諦、苦滅聖諦、苦出要諦。",
        "translation": "They expound and explain the noble truth of suffering's accumulation, the noble truth of suffering's cessation, and the essential truth of suffering's escape.",
        "source": "T01n0001_001:0009c11_5"
    },
    {
        "source_sentence": "「時，八萬四千人即於座上遠塵離垢，得法眼淨，猶如素質易為受色，",
        "translation": "“Then the eighty-four thousand bodhisattvas were seated on their seats, far removed from dirt and dust, purified by attaining the supernatural vision of the Dharma. Just as a silk cloth can easily be dyed any color,",
        "source": "T01n0001_001:0009c13_0"
    },
    {
        "source_sentence": "見法得果，真實無欺，成就無畏，即白佛言：『我等欲於如來法中淨修梵行。』",
        "translation": "Seeing the Dharma attain its fruit, they truly have no deceit and accomplish fearlessness, so they say to the Buddha, 'We want to cultivate the pure religious practice in the Tathāgata's teaching.'",
        "source": "T01n0001_001:0009c14_1"
    },
    {
        "source_sentence": "佛言：『善來，比丘！",
        "translation": "The Buddha said, 'Well come, monk!",
        "source": "T01n0001_001:0009c16_2"
    },
    {
        "source_sentence": "吾法清淨自在，修行以盡苦際。』",
        "translation": "My teaching is pure and unimpeded, and I cultivate it to end the limits of suffering.'",
        "source": "T01n0001_001:0009c16_3"
    },
    {
        "source_sentence": "時，八萬四千人即得具戒。",
        "translation": "Eighty-four thousand people then attained the full set of precepts.",
        "source": "T01n0001_001:0009c17_4"
    },
    {
        "source_sentence": "具戒未久，世尊以三事教化：一曰神足，二曰觀他心，三曰教誡，即得無漏、心解脫、生死無疑智現前。",
        "translation": "Not long after he had fulfilled the precepts, the Bhagavān taught him three things: first, supernormal abilities, second, observing the minds of others, and third, admonishment, which would enable him to attain uncontaminated, mental liberation, and the absence of doubtless knowledge in birth-and-death.",
        "source": "T01n0001_001:0009c18_5"
    },
    {
        "source_sentence": "八萬四千人聞佛於鹿野苑中，轉無上法輪，沙門、婆羅門、諸天、魔、梵及餘世人所不能轉，",
        "translation": "Eighty-four thousand people heard that the Buddha had turned the supreme wheel of the Dharma in the Deer Preserve. No śramaṇas, brāhmaṇas, as well as gods, Māras, Brahmās, or any other worldly being could turn it.",
        "source": "T01n0001_001:0009c20_6"
    },
    {
        "source_sentence": "即詣槃頭城毘婆尸佛所，頭面禮足，却坐一面。」",
        "translation": "He went to Vipaśyin Buddha in the city of Padmavṛṣa, bowed his head and feet, and withdrew to sit at one side.",
        "source": "T01n0001_001:0009c22_7"
    },
    {
        "source_sentence": "「如人救頭燃，　　速疾求滅處；",
        "translation": "“Suppose a man rescues someone whose hair is on fire And quickly seeks the place of extinction.",
        "source": "T01n0001_001:0009c23_8"
    },
    {
        "source_sentence": "　彼人亦如是，　　速詣於如來。",
        "translation": "That person is likewise, quickly approaching the Tathāgata.",
        "source": "T01n0001_001:0009c23_8"
    },
    {
        "source_sentence": "佛時頌曰：「時，佛為說法亦復如是。",
        "translation": "The Buddha then spoke a verse, saying, So it is when the Buddha teaches the Dharma for them.",
        "source": "T01n0001_001:0009c23_8"
    },
    {
        "source_sentence": "爾時，槃頭城有十六萬八千大比丘眾，提舍比丘、騫茶比丘於大眾中上昇虛空，",
        "translation": "At that time in the city of Padma there were six hundred and sixty-eight thousand great bhikṣus. The monks Tiṣya and Kaṇṭhaka rose up into the sky among the great assembly.",
        "source": "T01n0001_001:0009c26_9"
    },
    {
        "source_sentence": "身出水火，現諸神變，而為大眾說微妙法。",
        "translation": "He emanated water and fire from his body, manifested miraculous transformations, and taught the subtle Dharma to the masses.",
        "source": "T01n0001_001:0009c28_10"
    },
    {
        "source_sentence": "爾時，如來默自念言：『今此城內乃有十六萬八千大比丘眾，宜遣遊行，",
        "translation": "At that time, the Tathāgata remained silent and thought to himself: There are now sixty-eight thousand bhikṣus living in this city.",
        "source": "T01n0001_001:0009c29_11"
    },
    {
        "source_sentence": "各二人俱在在處處，至於六年，還來城內說具足戒。』",
        "translation": "Each of these two people stayed in their place for six years and returned to the city to explain the full set of precepts.'",
        "source": "T01n0001_001:0010a02_12"
    },
    {
        "source_sentence": "「時，首陀會天知如來心，譬如力士屈伸臂頃，從彼天沒，忽然至此，",
        "translation": "“Then the Sudarśana goddess knew the Tathāgata’s thoughts, just as if a strong man were to descend from that heaven and suddenly come here while extending his arm,",
        "source": "T01n0001_001:0010a03_13"
    },
    {
        "source_sentence": "於世尊前，頭面禮足，却住一面，須臾白佛言：『如是，世尊！",
        "translation": "In front of the Bhagavān, he bowed his head and feet, withdrew to one side, and in a moment said to the Buddha, 'So it is, Bhagavān!",
        "source": "T01n0001_001:0010a04_14"
    },
    {
        "source_sentence": "此槃頭城內比丘眾多，宜各分布，處處遊行，至於六年，乃還此城，說具足戒，",
        "translation": "Within the city of Padma there were many bhikṣus, and it was appropriate for each to be distributed among them. After six years had passed, they returned to this city and preached the full set of precepts.",
        "source": "T01n0001_001:0010a06_15"
    },
    {
        "source_sentence": "我當擁護，令無伺求得其便者。』",
        "translation": "I will embrace them so that there won't be anyone who asks for an advantage.'",
        "source": "T01n0001_001:0010a08_0"
    },
    {
        "source_sentence": "爾時，如來聞此天語，默然可之。",
        "translation": "At the time, the Tathāgata heard these divine words and quietly approved of them.",
        "source": "T01n0001_001:0010a08_1"
    },
    {
        "source_sentence": "「時，首陀會天見佛默然許可，即禮佛足，忽然不現，還至天上。",
        "translation": "Seeing the Buddha's silent approval, the Śuddhodana assembly goddess bowed at his feet, suddenly disappeared, and returned to heaven.",
        "source": "T01n0001_001:0010a09_2"
    },
    {
        "source_sentence": "其去未久，佛告諸比丘：『今此城內，比丘眾多，宜各分布，遊行教化，",
        "translation": "Not long after his departure, the Buddha said to the monks: There are now many bhikṣus in this city. It is advisable for you to distribute them among yourselves so that they may travel and teach together.",
        "source": "T01n0001_001:0010a10_3"
    },
    {
        "source_sentence": "至六年已，還集說戒。』",
        "translation": "After six years have passed, they'll return and assemble to preach the precepts.'",
        "source": "T01n0001_001:0010a12_4"
    },
    {
        "source_sentence": "時，諸比丘受佛教已，執持衣鉢，禮佛而去。」",
        "translation": "After they had received the Buddha's teaching, the monks took their robes and bowls, bowed to him, and departed.",
        "source": "T01n0001_001:0010a13_0"
    },
    {
        "source_sentence": "「佛悉無亂眾，　　無欲無戀著；",
        "translation": "All buddhas are without disturbing beings, Without desire or attachment.",
        "source": "T01n0001_001:0010a14_0"
    },
    {
        "source_sentence": "　威如金翅鳥，　　如鶴捨空池。",
        "translation": "It's as powerful as a garuḍa bird, like a crane leaving an empty pond.",
        "source": "T01n0001_001:0010a14_0"
    },
    {
        "source_sentence": "佛時頌曰：「時，首陀會天於一年後告諸比丘：『汝等遊行已過一年，",
        "translation": "The Buddha then continued in verse: One year later, the assembly god Śuddhodana said to the bhikṣus: You monks, you have been traveling for more than one year.",
        "source": "T01n0001_001:0010a14_0"
    },
    {
        "source_sentence": "餘有五年。",
        "translation": "The remaining five years are five years.",
        "source": "T01n0001_001:0010a18_1"
    },
    {
        "source_sentence": "汝等當知，訖六年已，還城說戒。』",
        "translation": "You should know that after six years have passed, you'll return to the city and explain the precepts.'",
        "source": "T01n0001_001:0010a18_2"
    },
    {
        "source_sentence": "如是至于六年，天復告言：『六年已滿，當還說戒。』",
        "translation": "For six years in this way, the gods again told him, 'Six years have passed, and you'll return to preach the precepts.'",
        "source": "T01n0001_001:0010a19_3"
    },
    {
        "source_sentence": "時，諸比丘聞天語已，攝持衣鉢，還槃頭城，至鹿野苑毘婆尸佛所，頭面禮足，",
        "translation": "Having heard the divine teaching, the monks gathered their robes and bowls and returned to the city of Padmavṛṣa. They came to the place where Vipaśyin Buddha was staying in the Deer Preserve with their foreheads bowed at his feet.",
        "source": "T01n0001_001:0010a20_4"
    },
    {
        "source_sentence": "却坐一面。」",
        "translation": "He sits to one side.",
        "source": "T01n0001_001:0010a22_5"
    },
    {
        "source_sentence": "「如象善調，　　隨意所之；",
        "translation": "“Suppose an elephant is well-adjusted And follows what it wishes.",
        "source": "T01n0001_001:0010a22_6"
    },
    {
        "source_sentence": "　大眾如是，　　隨教而還。",
        "translation": "So it is with the great assembly of monks, Who follow my instruction and return.",
        "source": "T01n0001_001:0010a22_6"
    },
    {
        "source_sentence": "佛時頌曰：「爾時，如來於大眾前上昇虛空，結加趺坐，講說戒經：忍辱為第一，",
        "translation": "The Buddha then continued in verse: At that time the Tathāgata rose up into the air before the assembly of bhikṣus and sat cross-legged. He taught the sutra on the precepts, saying:",
        "source": "T01n0001_001:0010a22_6"
    },
    {
        "source_sentence": "佛說涅槃最，不以除鬚髮害他為沙門。",
        "translation": "The Buddha teaches that nirvāṇa is the best, and he doesn't harm others with removing his hair as a monk.",
        "source": "T01n0001_001:0010a26_7"
    },
    {
        "source_sentence": "「『如來大智，　　微妙獨尊，",
        "translation": "'The Tathāgata Mahāprajñāpāramitā, the subtle and unique honored one,",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "　　止觀具足，　　成最正覺。",
        "translation": "Endowed with cessation and contemplation, he becomes the most perfectly enlightened.",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "　　愍群生故，　　在世成道，",
        "translation": "Because of their hatred for sentient beings, they attain enlightenment in the world.",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "　　以四真諦，　　為聲聞說。",
        "translation": "He teaches the four true truths For the sake of the śrāvakas.",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "　　苦與苦因，　　滅苦之諦，",
        "translation": "The Truth of Suffering and the Cause of Suffering, the Truth of Extinguishing Suffering",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "　　賢聖八道，　　到安隱處。",
        "translation": "Good men and sages of the eightfold path Have arrived in a peaceful place.",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "　　毘婆尸佛，　　出現于世，",
        "translation": "Vipaśyin Buddha appeared in the world.",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "　　在大眾中，　　如日光曜。』",
        "translation": "In the midst of the masses, it's like the sun shining brightly.'",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "時，首陀會天去佛不遠，以偈頌曰：「說此偈已，忽然不現。」",
        "translation": "Not far from the Buddha, the Śuddhodana assembly god then spoke in verse, saying, After you say this verse, it suddenly doesn't appear.",
        "source": "T01n0001_001:0010a27_8"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「我自思念：『昔一時於羅閱城耆闍崛山，時，",
        "translation": "At that time the World-honored One said to the monks: I remember one day in the past, when on Mount Gṛdhrakūṭa in Rājagṛha there was a holy man named Mahāprajāpatīṃśavartin.",
        "source": "T01n0001_001:0010b08_9"
    },
    {
        "source_sentence": "生是念：我所生處，無所不遍，唯除首陀會天，設生彼天，則不還此。』",
        "translation": "He thinks, 'There's nothing that I won't pervade where I'm born except for the god Śuddhâvāsa gods, and if I were to be born there, I wouldn't return here.'",
        "source": "T01n0001_001:0010b09_10"
    },
    {
        "source_sentence": "我時，比丘！",
        "translation": "At the time, monk!",
        "source": "T01n0001_001:0010b11_11"
    },
    {
        "source_sentence": "復生是念：『我欲至無造天上。』",
        "translation": "Again, he thought, 'I want to go up to the uncreated heavens.'",
        "source": "T01n0001_001:0010b11_12"
    },
    {
        "source_sentence": "時，我如壯士屈伸臂頃，於此間沒，現於彼天。",
        "translation": "At the time, I'm like a strong man who bends and extends his arm, disappears here, and appears in that heaven.",
        "source": "T01n0001_001:0010b12_13"
    },
    {
        "source_sentence": "時，彼諸天見我至彼，頭面作禮，於一面立，而白我言：『我等皆是毘婆尸如來弟子，",
        "translation": "When those gods saw me approaching them, they bowed their foreheads and faces, stood to one side, and said to me:",
        "source": "T01n0001_001:0010b13_14"
    },
    {
        "source_sentence": "從彼佛化，故來生此，具說彼佛因緣本末。",
        "translation": "Because they came from that buddha’s instruction, they are reborn here. The causes and conditions of those buddhas are explained in detail:",
        "source": "T01n0001_001:0010b15_15"
    },
    {
        "source_sentence": "又尸棄佛、毘沙婆佛、拘樓孫佛、拘那含佛、迦葉佛、釋迦牟尼佛，皆是我師，",
        "translation": "Śikhin Buddha, Viśvabhū Buddha, Krakucchanda Buddha, Kauṇḍinya Buddha, Kanakamuni Buddha, Kāśyapa Buddha, and Śākyamuni Buddha were all my teachers.",
        "source": "T01n0001_001:0010b16_16"
    },
    {
        "source_sentence": "我從受化，故來生此。』",
        "translation": "I came here from being transformed, so I'm born here.'",
        "source": "T01n0001_001:0010b18_17"
    },
    {
        "source_sentence": "亦說諸佛因緣本末，至生阿迦尼吒諸天，亦復如是。」",
        "translation": "They also explain the causes and conditions for the buddhas' origins up to the point where they're born in the Akaniṣṭha gods, which are likewise.",
        "source": "T01n0001_001:0010b18_18"
    },
    {
        "source_sentence": "「譬如力士，　　屈伸臂頃，",
        "translation": "“Suppose a strong man bends and extends his arm for an instant,",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　我以神足，　　至無造天。",
        "translation": "With my supernormal powers, I reach the uncreated heaven.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　第七大仙，　　降伏二魔，",
        "translation": "The seventh great sage Subdued the two Māras,",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　無熱無見，　　叉手敬禮。",
        "translation": "Without fever or vision, they saluted him with their palms joined.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　如晝度樹，　　釋師遠聞，",
        "translation": "Like the pārijāta tree, The teacher of Buddhism has heard it from afar.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　相好具足，　　到善見天。",
        "translation": "Their features are perfect, and they'll reach the well-viewed gods.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　猶如蓮華，　　水所不著，",
        "translation": "It's like a lotus flower that doesn't cling to water.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　世尊無染，　　至大善見。",
        "translation": "Bhagavān, you're undefiled, up to the great good view.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　如日初出，　　淨無塵翳，",
        "translation": "Like when the sun first comes out, It’s pure and without dust or dirt.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　明若秋月，　　詣一究竟。",
        "translation": "It's clear that if it's an autumn moon, he'll reach the end of his journey.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　此五居處，　　眾生所淨，",
        "translation": "These five dwelling places are Purified by sentient beings.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　心淨故來，　　詣無煩惱。",
        "translation": "Because their minds are pure, they come to the absence of afflictions.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　淨心而來，　　為佛弟子，",
        "translation": "They come with pure minds And become disciples of the Buddha.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　捨離染取，　　樂於無取。",
        "translation": "Being free of defiled grasping, he enjoys the absence of grasping.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　見法決定，　　毘婆尸子，",
        "translation": "Seeing the Dharma with certainty, Vipaśyin,",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　淨心善來，　　詣大仙人，",
        "translation": "Come, good man, with a pure heart, To see the great sage.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　尸棄佛子，　　無垢無為，",
        "translation": "Śikhin is the Buddha’s disciple, Undefiled and unconditioned.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　以淨心來，　　詣離有尊。",
        "translation": "With a pure mind, he came to leave the place where there was an honored one.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　毘沙婆子，　　諸根具足，",
        "translation": "Vaiśravaṇa, the son of Vaiśravaṇa, Is endowed with all faculties.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　淨心詣我，　　如日照空。",
        "translation": "A pure mind comes to me like the sun shining in the sky.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　拘樓孫子，　　捨離諸欲，",
        "translation": "Krakucchanda's grandson, who abandoned all desires,",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　淨心詣我，　　妙光焰盛。",
        "translation": "The pure mind comes to me, with a blazing flame of marvelous light.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　拘那含子，　　無垢無為，",
        "translation": "Kanakamuni’s disciples are spotless and uncreated.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　淨心詣我，　　光如月滿。",
        "translation": "Come to me with a pure mind, full of light like the moon.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　迦葉弟子，　　諸根具足，",
        "translation": "Kāśyapa’s disciples Are endowed with all faculties.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　淨心詣我，　　如北天念，　　不亂大仙，",
        "translation": "Come to me with a pure mind, like the northern celestial being’s thoughts. Don’t disturb the great sage!",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　神足第一，　　以堅固心，",
        "translation": "The first is the supreme in supernormal abilities, Because of his steadfast mind.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　為佛弟子。　　淨心而來，",
        "translation": "They are disciples of the Buddha and come with pure minds.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　為佛弟子，　　禮敬如來，",
        "translation": "I am a disciple of the Buddha, venerating the Tathāgata.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　具啟人尊。　　所生成道，",
        "translation": "The paths that have been produced by the enlightened ones are like this:",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　名、姓、種族，　　知見深法，",
        "translation": "Their names, castes, and clansmen Know and see the profound teaching.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　成無上道。　　比丘靜處，",
        "translation": "They will attain the highest path.” The bhikṣu stayed in a quiet place,",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　離于塵垢，　　精勤不懈，",
        "translation": "Being free of defilement, he exerts himself with energy and without slackening.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　斷諸有結。　　此是諸佛，",
        "translation": "These are the buddhas who cut off all bonds of existence.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "　本末因緣，　　釋迦如來，",
        "translation": "The original and derivative causes and conditions, the Tathāgata Śākyamuni,",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "佛時頌曰：　之所演說。」",
        "translation": "The Buddha then spoke a verse, saying, What he teaches.",
        "source": "T01n0001_001:0010b20_0"
    },
    {
        "source_sentence": "佛說此大因緣經已，諸比丘聞佛所說，歡喜奉行。",
        "translation": "After the Buddha taught this great causal scripture, the monks who heard what he taught rejoiced and remembered it well.",
        "source": "T01n0001_001:0010c28_0"
    },
    {
        "source_sentence": "佛說長阿含經卷第一",
        "translation": "Foshuo Chang ahan jing jing, vol. 1",
        "source": "T01n0001_001:0011a01_0"
    }
]