[
    {
        "source_sentence": "起世因本經卷第六",
        "translation": "Qishi jingben ben jing, vol. 6",
        "source": "T01n0025_006:0392b02_0"
    },
    {
        "source_sentence": "隋天竺沙門達摩笈多譯",
        "translation": "Translated by the Sui translator Dharmagupta, a renunciant of India",
        "source": "T01n0025_006:0392b04_0"
    },
    {
        "source_sentence": "阿修羅品下",
        "translation": "Second Chapter of the Asuras",
        "source": "T01n0025_006:0392b05_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0392b06_0"
    },
    {
        "source_sentence": "其阿修羅七頭聚會處所，有二岐道，通為彼王遊戲去來；",
        "translation": "At the place where the seven-headed asura assembled, there were two different paths leading to and fro for the king.",
        "source": "T01n0025_006:0392b06_1"
    },
    {
        "source_sentence": "其鞞摩質多囉阿修囉王宮殿處所，有二岐道，亦復如前；",
        "translation": "The palace and quarters of the asura king Yamacitra were located on two sides, just as before.",
        "source": "T01n0025_006:0392b07_2"
    },
    {
        "source_sentence": "諸小阿修囉王輩宮殿處所，亦二岐道；",
        "translation": "The palaces and dwelling places of the small asura kings are also in two different paths.",
        "source": "T01n0025_006:0392b08_3"
    },
    {
        "source_sentence": "諸小阿修囉王輩住止處所，亦二岐道；",
        "translation": "The dwelling places of the small asura kings are also twofold:",
        "source": "T01n0025_006:0392b09_4"
    },
    {
        "source_sentence": "其娑羅園林，亦二岐道；",
        "translation": "The sal trees and forests are also on two different paths.",
        "source": "T01n0025_006:0392b10_5"
    },
    {
        "source_sentence": "奢摩梨園林，亦二岐道；",
        "translation": "There are also two different paths in the Sāmarī grove.",
        "source": "T01n0025_006:0392b11_6"
    },
    {
        "source_sentence": "俱毘陀囉園林，亦二岐道；",
        "translation": "The grove of the kovidāra trees also has two paths.",
        "source": "T01n0025_006:0392b11_7"
    },
    {
        "source_sentence": "難陀那園林，亦二岐道；",
        "translation": "Nanda’s grove and forest are also on two different paths.",
        "source": "T01n0025_006:0392b12_8"
    },
    {
        "source_sentence": "其難陀池，亦二岐道；",
        "translation": "Nanda’s pond was also twofold:",
        "source": "T01n0025_006:0392b13_0"
    },
    {
        "source_sentence": "蘇質多囉波吒囉大樹，亦二岐道；",
        "translation": "The great tree sucitarapaṭala also has two paths.",
        "source": "T01n0025_006:0392b13_1"
    },
    {
        "source_sentence": "悉皆如前，七頭聚處，相通來往。",
        "translation": "They are all as before, with the seven-headed clusters of places that pass from one to the other.",
        "source": "T01n0025_006:0392b14_2"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0392b15_0"
    },
    {
        "source_sentence": "其鞞摩質多囉阿修囉王，意欲向彼娑羅園林，奢摩梨、俱毘陀囉、難陀那園林等，",
        "translation": "The asura king Yamacitra wished to go to those salā groves, śāmarī, kovidāra, nandanavana, and so forth.",
        "source": "T01n0025_006:0392b15_1"
    },
    {
        "source_sentence": "澡浴嬉戲，遊行受樂。",
        "translation": "They bathe, play, and enjoy the pleasures of excursions.",
        "source": "T01n0025_006:0392b17_2"
    },
    {
        "source_sentence": "爾時，心念彼諸小阿修囉王輩，及念諸小阿修囉輩。",
        "translation": "At that point, he's mindful of those small asura kings and the small asura groups.",
        "source": "T01n0025_006:0392b17_3"
    },
    {
        "source_sentence": "是時，彼諸小阿修囉王輩，并及諸小阿修囉等，即生是心：『鞞摩質多囉阿修囉王意念我等。』",
        "translation": "At that point, those lesser asura kings and the other lesser asura kings then had this thought, 'The mind of the asura king Yamacitra thinks of us.'",
        "source": "T01n0025_006:0392b18_4"
    },
    {
        "source_sentence": "如是知已，即以種種眾寶瓔珞，莊嚴其身，各嚴飾已，乘種種乘，俱來詣向鞞摩質多囉阿修囉王宮門之外，",
        "translation": "Having thus known, they adorned their bodies with various ornaments of jewels, each adorned with a variety of jewelry, and riding in various vehicles, they all came to the outside of the doors of the palace of the asura king Yamacitra.",
        "source": "T01n0025_006:0392b20_5"
    },
    {
        "source_sentence": "到已入向鞞摩質多囉阿修囉王殿前而住。",
        "translation": "When he arrived, he entered the monastery and stayed in front of the asura king's hall.",
        "source": "T01n0025_006:0392b23_6"
    },
    {
        "source_sentence": "「爾時，鞞摩質多囉阿修羅王，見彼諸小阿修囉王，及諸小阿修羅眾來，",
        "translation": "At that time, the asura king Yamacitra saw those minor asura kings and the assembly of minor asura kings coming.",
        "source": "T01n0025_006:0392b25_0"
    },
    {
        "source_sentence": "即便自以種種瓔珞莊嚴其身，莊嚴身已，即便騎乘。",
        "translation": "He then adorned himself with various jewelry, and after adorning his body, he even rode it.",
        "source": "T01n0025_006:0392b26_1"
    },
    {
        "source_sentence": "是時，諸小阿修囉王并及諸小阿修囉輩，左右四面周匝圍遶，前後導從，",
        "translation": "The kings of the asura demons and their retinues were surrounded on all four sides, following them one after the other.",
        "source": "T01n0025_006:0392b27_2"
    },
    {
        "source_sentence": "相將詣向娑羅園林，及奢摩梨園林、俱毘陀囉園林、難陀那園林等。",
        "translation": "They were all headed for the Sāra grove, the Sāmarī grove, the Kuvidāra grove, the Nandanavana grove, and so forth.",
        "source": "T01n0025_006:0392b29_3"
    },
    {
        "source_sentence": "到彼處已，在於難陀園林前住。",
        "translation": "After arriving there, he stayed in front of the Nanda's park and forest.",
        "source": "T01n0025_006:0392c02_0"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0392c02_1"
    },
    {
        "source_sentence": "其難陀園林，有三風輪，自然吹動，莊嚴彼園。",
        "translation": "In the forest of Nanda’s grove there are three kinds of wind, blowing spontaneously and adorning the grove.",
        "source": "T01n0025_006:0392c02_2"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T01n0025_006:0392c04_0"
    },
    {
        "source_sentence": "所謂開者、淨者、吹者。",
        "translation": "They're called the initiator, the pure one, and the blower.",
        "source": "T01n0025_006:0392c04_1"
    },
    {
        "source_sentence": "何者名開？",
        "translation": "What's called enlightenment?",
        "source": "T01n0025_006:0392c04_2"
    },
    {
        "source_sentence": "有風輪來，開閉諸門。",
        "translation": "A wind whirl came and opened and closed the doors.",
        "source": "T01n0025_006:0392c05_0"
    },
    {
        "source_sentence": "何者為淨？",
        "translation": "What's pure?",
        "source": "T01n0025_006:0392c05_1"
    },
    {
        "source_sentence": "有風輪來，掃彼園林，令地清淨。",
        "translation": "A wind-wheel came and swept the grove away, making the ground pure.",
        "source": "T01n0025_006:0392c05_2"
    },
    {
        "source_sentence": "何者為吹？",
        "translation": "What's blowing?",
        "source": "T01n0025_006:0392c06_3"
    },
    {
        "source_sentence": "有風輪來，吹動彼園林樹眾華，飄零四散。",
        "translation": "When a wind whirls, it blows the flowers of the trees in that grove and scatter them in all directions.",
        "source": "T01n0025_006:0392c06_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0392c07_5"
    },
    {
        "source_sentence": "其難陀那園林之中，風散種種微妙眾華，下到於膝，有種種香，其香氛馥，",
        "translation": "In the forest of Nanda’s grove a wind swirled various subtle flowers, reaching down to his knees. There were various kinds of fragrances and their odors were exquisitely fragrant.",
        "source": "T01n0025_006:0392c07_6"
    },
    {
        "source_sentence": "遍滿園林。",
        "translation": "It fills the garden and forest.",
        "source": "T01n0025_006:0392c09_7"
    },
    {
        "source_sentence": "當於彼時，其鞞摩質多囉阿修羅王，及諸小阿修羅王，并諸小阿修囉等輩圍遶，",
        "translation": "At that time, the asura king Yamacitra and all the other minor asura kings were surrounded by small groups of asuras.",
        "source": "T01n0025_006:0392c09_8"
    },
    {
        "source_sentence": "即入彼難陀那園林，入已洗浴，觀看遊戲，隨意而住。",
        "translation": "He entered the Nandanavana grove. Having entered it, after having bathed and bathed, he remained there to enjoy the pleasures and amusements as he wished.",
        "source": "T01n0025_006:0392c11_9"
    },
    {
        "source_sentence": "諸阿修囉等，於彼園林，或復一月二月三月，澡浴遊戲，隨意止住，各隨所欲去處而去。",
        "translation": "The asuras and so forth, whether it's a month, a month, a second month, or a third month, bathe and play in that grove, stay as they wish, and depart wherever they want.",
        "source": "T01n0025_006:0392c12_10"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0392c15_0"
    },
    {
        "source_sentence": "其鞞摩質多囉阿修羅王，恒常別有五阿修囉，停住其側，擁護守視諸惡事故。",
        "translation": "The asura king Yamacitra always had five other asura demons standing beside him, protecting and guarding them from evil.",
        "source": "T01n0025_006:0392c15_1"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T01n0025_006:0392c17_0"
    },
    {
        "source_sentence": "一名隨喜、二者名有、三者名醉、四名牟真隣陀、五名鞞呵多囉。",
        "translation": "One is called joyful, two are called existence, three are called drunkenness, four are called samādhinirnda, and five are called anghatara.",
        "source": "T01n0025_006:0392c17_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0392c18_2"
    },
    {
        "source_sentence": "其鞞摩質多囉阿修囉王，有如是等五阿修羅，恒常在於鞞摩質多囉阿修囉王側，",
        "translation": "As for the asura king Yamacitra, he had five such-and-such asuras who were always beside him.",
        "source": "T01n0025_006:0392c18_3"
    },
    {
        "source_sentence": "為守護故。",
        "translation": "It's for the sake of guarding.",
        "source": "T01n0025_006:0392c20_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0392c21_0"
    },
    {
        "source_sentence": "而彼鞞摩質多囉阿修囉王宮殿之上，有萬踰闍那海水而住，其彼水聚自然而有四種風持。",
        "translation": "On top of that palace of the asura king Yamacitra, there's 10,000 yojanas of water standing on it, and that mass of water naturally has four kinds of wind supporting it.",
        "source": "T01n0025_006:0392c21_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T01n0025_006:0392c23_2"
    },
    {
        "source_sentence": "所謂一住、二者安住、三者不墮、四名牢固主。",
        "translation": "The so-called first abode, second, abiding in peace, third, not falling down, and fourth are called the firm master.",
        "source": "T01n0025_006:0392c23_3"
    },
    {
        "source_sentence": "為此風持，常住不動。",
        "translation": "In order to maintain this wind, he always abides and doesn't move.",
        "source": "T01n0025_006:0392c24_4"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0392c26_0"
    },
    {
        "source_sentence": "去須彌留山王南面千踰闍那，在大海下，有踊躍阿修囉王宮殿住處。",
        "translation": "A thousand yojanas to the south of Mount Sumeru and below the ocean is the dwelling place of the royal palace of the asura king Yongyuo.",
        "source": "T01n0025_006:0392c26_1"
    },
    {
        "source_sentence": "其處縱廣八萬踰闍那，七重垣牆，略說猶如鞞摩質多囉阿修囉王種種所有，",
        "translation": "The place was eighty thousand yojanas in width and depth, protected by seven walls as numerous as the various possessions of King Yama’s asura king.",
        "source": "T01n0025_006:0392c27_2"
    },
    {
        "source_sentence": "此中一一亦如彼說，汝應當知。",
        "translation": "Each one of these is also as they say, you should know.",
        "source": "T01n0025_006:0392c29_3"
    },
    {
        "source_sentence": "乃至此王宮殿之上，所有水聚，亦為四種風輪住持，一住、二安住、三不墮、四牢固主。",
        "translation": "Even the water masses above this king's palace are also sustained by four kinds of wind, which are one abode, two resting, three not falling, and four firmly held.",
        "source": "T01n0025_006:0393a01_4"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393a04_0"
    },
    {
        "source_sentence": "去須彌留山王西面千踰闍那，大海水下，有奢婆羅(隋言幻化)阿修羅王宮殿住處，",
        "translation": "“A thousand yojanas to the west of Mount Sumeru, one thousand yojanas to the west of this great ocean is the abode of the asura king Kassapa (known as illusory in the Sui dynasty) at the foot of the great sea.",
        "source": "T01n0025_006:0393a04_1"
    },
    {
        "source_sentence": "其處縱廣八萬踰闍那，七重垣牆，略說猶如鞞摩質多羅阿修羅王種種所有，",
        "translation": "The place was eighty thousand yojanas in width and depth, protected by seven walls that resembled the various possessions of the asura king Yamacitra.",
        "source": "T01n0025_006:0393a05_2"
    },
    {
        "source_sentence": "此中一一亦如彼說，汝應當知。",
        "translation": "Each one of these is also as they say, you should know.",
        "source": "T01n0025_006:0393a07_3"
    },
    {
        "source_sentence": "乃至此王宮殿之上，所有水聚，亦為四種風輪住持，一住、二安住、三不墮、四牢固主。",
        "translation": "Even the water masses above this king's palace are also sustained by four kinds of wind, which are one abode, two resting, three not falling, and four firmly held.",
        "source": "T01n0025_006:0393a08_4"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393a11_0"
    },
    {
        "source_sentence": "須彌留山王北面，如上相去，大海水下，有羅睺羅阿修羅王宮殿住處，",
        "translation": "On the northern side of Mount Sumeru, as above, there is a great ocean at the bottom of which lies the palace and dwelling quarters of the asura king Rāhula.",
        "source": "T01n0025_006:0393a11_1"
    },
    {
        "source_sentence": "其處縱廣如上所說，彼諸牆壁，及以門樓，臺閣却敵。",
        "translation": "The width and depth of the place is as described above. The walls, gates, towers, terraces, and buildings are built to resist enemies.",
        "source": "T01n0025_006:0393a12_2"
    },
    {
        "source_sentence": "園苑諸池，有種種樹，與種種葉，種種華果，種種香熏，有種種鳥，各各自鳴。",
        "translation": "In the gardens and ponds there are various trees with various leaves, flowers and fruits of various kinds of fragrance. There are also various kinds of birds that each sing in their own way.",
        "source": "T01n0025_006:0393a14_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0393a15_4"
    },
    {
        "source_sentence": "彼之處所，為羅睺羅阿修羅王有城，王住其城，名曰摩婆帝(隋言寂主)，",
        "translation": "At that place, there was a city where King Rāhula the Asura lived. The king lived in that city and called it Mapotī (known as Silent Lord in the Sui).",
        "source": "T01n0025_006:0393a16_0"
    },
    {
        "source_sentence": "縱廣莊嚴亦如上說。",
        "translation": "Even if it's vast and adorned, it's likewise as explained above.",
        "source": "T01n0025_006:0393a17_1"
    },
    {
        "source_sentence": "牆壁七重，七重欄楯，七重多羅行樹，七重鈴網，周匝圍遶，雜色可觀，",
        "translation": "It is surrounded by seven walls of sevenfold walls embellished with seven railings, seven lines of palm trees and seven networks of bells, all beautifully arrayed in variegated colors.",
        "source": "T01n0025_006:0393a17_2"
    },
    {
        "source_sentence": "七寶所成，乃至車璩馬瑙等寶。",
        "translation": "It's made of the seven treasures, up to the treasures of chariots, horse agate, and so forth.",
        "source": "T01n0025_006:0393a19_3"
    },
    {
        "source_sentence": "彼等垣牆高下縱廣，亦如前說。",
        "translation": "The height and width of these walls are also as has been said previously.",
        "source": "T01n0025_006:0393a20_4"
    },
    {
        "source_sentence": "彼諸垣牆，亦有諸門。",
        "translation": "The walls there also have gates.",
        "source": "T01n0025_006:0393a21_5"
    },
    {
        "source_sentence": "彼等諸門高下縱廣一一如前。",
        "translation": "Each of those gates is as high and wide as before.",
        "source": "T01n0025_006:0393a21_6"
    },
    {
        "source_sentence": "而彼諸門所有層樓，却敵臺閣，園苑諸池，及華沼等，亦有諸樹，與種種葉，",
        "translation": "And the storeyed buildings of those gates, as well as the enemy terraces and pavilions, parks, ponds, and flowering ponds, all had trees with various kinds of leaves.",
        "source": "T01n0025_006:0393a22_7"
    },
    {
        "source_sentence": "種種花果，種種香熏，亦有種種諸雜類鳥，各各自鳴。",
        "translation": "Various kinds of flowers and fruits were offered in various fragrances, and there were also various birds of various species that each sounded differently.",
        "source": "T01n0025_006:0393a24_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393a26_0"
    },
    {
        "source_sentence": "其彼摩婆帝城王所住處，為羅睺羅阿修羅王有聚會處，還名七頭，其處縱廣如上所說，",
        "translation": "At the place where the king of Magadha lived, there was a gathering place for Rāhula the asuras, who were also called the “seven-headed.” The width and depth of their abode was as described above.",
        "source": "T01n0025_006:0393a26_1"
    },
    {
        "source_sentence": "欄楯七重，及諸鈴網，多羅行樹，周匝圍遶，雜色可觀，亦為七寶之所莊嚴，",
        "translation": "It is surrounded by sevenfold railings and a network of bells, with palm trees surrounding it. The variegated colors that can be seen all adorn themselves with the seven kinds of treasure.",
        "source": "T01n0025_006:0393a28_2"
    },
    {
        "source_sentence": "乃至車璩馬瑙等寶。",
        "translation": "It's even made of treasures like chariots, horse agate, and so forth.",
        "source": "T01n0025_006:0393b01_3"
    },
    {
        "source_sentence": "普四方面各有諸門，彼等諸門亦有樓櫓，雜色可觀，七寶所成，乃至車璩馬瑙等寶。",
        "translation": "Each of the four directions has its own gates, and those gates also have towers of mixed colors that can be seen, made of seven treasures, up to chariots, carriages, horse agates, and other treasures.",
        "source": "T01n0025_006:0393b01_4"
    },
    {
        "source_sentence": "而彼下分以天車璩分布，其地柔軟，觸之猶如迦旃隣提衣。",
        "translation": "The lower part is distributed with a heavenly chariot, and the ground is soft and gentle, touching it like Kātyāyana's robe.",
        "source": "T01n0025_006:0393b03_5"
    },
    {
        "source_sentence": "而彼處中有一寶柱，高下縱廣如上所說。",
        "translation": "In that place, however, there's a jeweled pillar that's as high and wide as described above.",
        "source": "T01n0025_006:0393b04_6"
    },
    {
        "source_sentence": "其彼柱下，為羅睺羅阿修羅王置一高座，其座高下縱廣莊挍，一一如前，",
        "translation": "At the foot of that pillar was a high seat arranged for Rāhula the king of the asuras. The height and width of each seat was one-sidedly as before.",
        "source": "T01n0025_006:0393b05_7"
    },
    {
        "source_sentence": "雜色可觀，七寶所成，乃至車璩馬瑙等寶，柔軟細滑，觸之猶如迦旃隣提衣。",
        "translation": "The variegated colors can be observed, made of the seven treasures, or even chariots, carriages, horse agate, and other treasures are as soft and fine as touching them like kaṭinīntika robes.",
        "source": "T01n0025_006:0393b07_8"
    },
    {
        "source_sentence": "其座左邊，為十六小阿修羅王亦各別置諸妙高座，雜色可觀，七寶所成，",
        "translation": "On the left side of his throne were sixteen great asura kings, each seated on a separate set of high seats made of the seven kinds of treasure.",
        "source": "T01n0025_006:0393b09_9"
    },
    {
        "source_sentence": "乃至車璩馬瑙等寶。",
        "translation": "It's even made of treasures like chariots, horse agate, and so forth.",
        "source": "T01n0025_006:0393b11_0"
    },
    {
        "source_sentence": "右邊亦然，為十六小阿修羅王，有諸高座，亦如上說，柔軟觸之，如迦旃隣提衣。",
        "translation": "On the right side, it's likewise for the sixteen minor asura kings who have high seats, which are as explained above and are gentle to touch like Kātyāyana's robe.",
        "source": "T01n0025_006:0393b11_1"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393b14_0"
    },
    {
        "source_sentence": "彼七頭聚會阿修羅王住處東面，為羅睺羅阿修羅王更置別住宮殿處所。",
        "translation": "To the east of the place where the seven-headed assembled asura king was staying, he placed Rāhula the asura king in a separately resident palace and abode.",
        "source": "T01n0025_006:0393b14_1"
    },
    {
        "source_sentence": "其處縱廣一一如前，七重垣牆、七重欄楯、七重鈴網，乃至七重多羅行樹，",
        "translation": "The width and depth of the place were as before: seven walls, seven railings, seven nets of bells, up to seven lines of palm trees.",
        "source": "T01n0025_006:0393b15_2"
    },
    {
        "source_sentence": "四面普皆周匝圍遶，雜色可觀，七寶所成，乃至車璩馬瑙等寶。",
        "translation": "It is surrounded on all four sides, with variegated colors that can be seen. It is made of the seven kinds of treasure, up to the precious treasures of chariots, agate, and horse agate.",
        "source": "T01n0025_006:0393b17_3"
    },
    {
        "source_sentence": "四方諸面各有諸門，彼等諸門各有樓臺，却敵重閣。",
        "translation": "On each of the four sides there are gates, and on each of those gates is a tower that pulls out an enemy's heavy pavilion.",
        "source": "T01n0025_006:0393b19_4"
    },
    {
        "source_sentence": "園苑諸池，眾華泉沼，有種種樹，與種種葉，種種華果，種種香熏。",
        "translation": "The parks, gardens, ponds, and flowery springs are filled with various kinds of trees, leaves, flowers, fruits, and various fragrances.",
        "source": "T01n0025_006:0393b20_5"
    },
    {
        "source_sentence": "復有種種眾類異鳥，各各自鳴，其音和雅，甚可愛樂。",
        "translation": "There were also various different kinds of birds, each singing its own voice in a pleasing and harmonious voice.",
        "source": "T01n0025_006:0393b21_6"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393b24_0"
    },
    {
        "source_sentence": "彼七頭聚會阿修羅王住處，東西南北，為諸小阿修羅王輩各有宮殿住處，",
        "translation": "To the east, west, south, and north, there were palaces and dwelling places for the assembly of the seven-headed asura kings.",
        "source": "T01n0025_006:0393b24_1"
    },
    {
        "source_sentence": "其處縱廣九百踰闍那，或有八百，或有七百，及以六百五四三二，其最小者百踰闍那，",
        "translation": "It is nine hundred yojanas long and wide, sometimes eight hundred, sometimes seven hundred, sometimes six hundred, sometimes five hundred, sometimes four, sometimes three, sometimes two; the smallest being one hundred yojanas in width.",
        "source": "T01n0025_006:0393b26_0"
    },
    {
        "source_sentence": "皆有七重牆壁欄楯，略說乃至，種種眾鳥，各各自鳴。",
        "translation": "Each of them has seven walls and railings, which are briefly described up to the point where various kinds of birds each sing.",
        "source": "T01n0025_006:0393b27_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0393b29_2"
    },
    {
        "source_sentence": "彼七頭聚會阿修羅王住處，東西南北，為彼諸小阿修羅輩亦各別有宮殿住處，",
        "translation": "To the east, west, south, and north, there are separate palaces and dwelling places for the asura kings of the seven-headed assembly.",
        "source": "T01n0025_006:0393b29_3"
    },
    {
        "source_sentence": "其處縱廣九十踰闍那，或有八十七十六十五四三二，極最小者猶故縱廣十二踰闍那，",
        "translation": "It may be eighty-seven yojanas long and wide, or eighty-seven, sixteen, fifteen, four, three, or two; the smallest is twelve yojanas long and wide.",
        "source": "T01n0025_006:0393c02_4"
    },
    {
        "source_sentence": "七重垣牆，略說乃至，種種眾鳥，各各自鳴。",
        "translation": "Seven walls of seven stories were built, each one sounding like a different kind of bird.",
        "source": "T01n0025_006:0393c04_5"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0393c05_6"
    },
    {
        "source_sentence": "其阿修羅王七頭聚會處所東面，為羅睺羅阿修羅王有園苑住，名娑羅林，",
        "translation": "To the east of the place where the seven-headed asura king gathered together, there was a park named sal trees and grove for the asura king Rāhula.",
        "source": "T01n0025_006:0393c05_7"
    },
    {
        "source_sentence": "其林縱廣，一一如前，七重垣牆，七重欄楯，乃至馬瑙，七寶所成。",
        "translation": "Each of the forests is as before, with sevenfold walls and sevenfold railings, all made of the seven kinds of treasure.",
        "source": "T01n0025_006:0393c07_0"
    },
    {
        "source_sentence": "普四方面各有諸門，彼等諸門皆有樓櫓，雜色可觀，乃至亦為車璩馬瑙七寶所成，",
        "translation": "In each of the four directions there were gates. Each gate had a tower, which could be seen in various colors and was also made of seven kinds of precious stones, such as chariots, carriages, horses, and watchtowers.",
        "source": "T01n0025_006:0393c08_1"
    },
    {
        "source_sentence": "甚可愛樂。",
        "translation": "It's very pleasing.",
        "source": "T01n0025_006:0393c10_2"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393c11_0"
    },
    {
        "source_sentence": "其阿修羅王七頭聚會處所南面，為羅睺羅阿修羅王有園苑住，名奢摩梨林，",
        "translation": "On the southern side of the place where the seven-headed asura king gathered together, there was a park called Sāmarīka’s Grove, which was the abode of the asura king Rāhula.",
        "source": "T01n0025_006:0393c11_1"
    },
    {
        "source_sentence": "縱廣莊嚴，皆如上說，七重垣牆，七重多羅行樹，雜色可觀，亦為七寶之所挍成，",
        "translation": "The width and depth of the embellishments were all as described above. They were built of sevenfold walls, protected by seven lines of palm trees with variegated colors that could be seen; they were also made of the seven kinds of treasure.",
        "source": "T01n0025_006:0393c13_0"
    },
    {
        "source_sentence": "乃至車璩馬瑙等寶。",
        "translation": "It's even made of treasures like chariots, horse agate, and so forth.",
        "source": "T01n0025_006:0393c14_1"
    },
    {
        "source_sentence": "普四方面各有諸門，彼等諸門有諸樓櫓，乃至馬瑙七寶所成。",
        "translation": "Each of the four directions has its own gates, and those gates have towers that are made of the seven treasures of agate.",
        "source": "T01n0025_006:0393c15_2"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393c17_0"
    },
    {
        "source_sentence": "其阿修羅王七頭聚會處所西面，為羅睺羅阿修羅王有園苑住，名曰俱毘陀羅林，",
        "translation": "To the west of the place where the seven-headed asura king gathered together, there was a park called the “kuvidāra asura’s forest” where King Rāhula the asura lived.",
        "source": "T01n0025_006:0393c17_1"
    },
    {
        "source_sentence": "其林縱廣一一皆如上說，七重垣牆，乃至馬瑙七寶所成。",
        "translation": "Each of the forests is as described above, with sevenfold walls and even agate trees made of the seven treasures.",
        "source": "T01n0025_006:0393c19_2"
    },
    {
        "source_sentence": "普四方面各有諸門，而彼諸門亦有樓櫓，種種挍飾，雜色可觀，乃至車璩馬瑙等寶之所莊嚴，",
        "translation": "Each of the four directions had gates, and each gate also had a tower, variously decorated with variegated colors that could be seen, adorned with chariots, carriages, horse carts, agate, and other treasures.",
        "source": "T01n0025_006:0393c20_3"
    },
    {
        "source_sentence": "甚可愛樂。",
        "translation": "It's very pleasing.",
        "source": "T01n0025_006:0393c22_4"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393c23_0"
    },
    {
        "source_sentence": "其阿修羅王七頭聚會處所北面，為羅睺羅阿修羅王有園苑住，名曰難陀那林，",
        "translation": "To the north of the place where the seven-headed asura king gathered together, there lived the asura king Rāhula in a park called Nandanavana Grove.",
        "source": "T01n0025_006:0393c23_1"
    },
    {
        "source_sentence": "其林縱廣如上所說，七重垣牆，乃至馬瑙七寶所成。",
        "translation": "The length and width of the forest is as described above. It is enclosed by sevenfold walls, all made of the seven kinds of treasure, from agate up to mahogany.",
        "source": "T01n0025_006:0393c25_2"
    },
    {
        "source_sentence": "普四方面各有諸門，而彼諸門亦有樓櫓，種種挍飾，雜色可觀，乃至車璩馬瑙等寶之所莊嚴，",
        "translation": "Each of the four directions had gates, and each gate also had a tower, variously decorated with variegated colors that could be seen, adorned with chariots, carriages, horse carts, agate, and other treasures.",
        "source": "T01n0025_006:0393c26_3"
    },
    {
        "source_sentence": "甚可愛樂。",
        "translation": "It's very pleasing.",
        "source": "T01n0025_006:0393c28_4"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0393c29_0"
    },
    {
        "source_sentence": "其奢摩梨及娑羅林，二處中間，為羅睺羅阿修羅王，有一池水，名曰難陀，",
        "translation": "Between the śamālī and sal trees, there was a pool of water called nanda between Rāmara and Rāmaṇḍa.",
        "source": "T01n0025_006:0393c29_1"
    },
    {
        "source_sentence": "其池縱廣如上所說。",
        "translation": "The width and depth of the pond are as described above.",
        "source": "T01n0025_006:0394a01_2"
    },
    {
        "source_sentence": "其水涼冷，柔軟輕甜，清淨不濁。",
        "translation": "The water is cool and refreshing, soft and sweet, pure and undisturbed.",
        "source": "T01n0025_006:0394a02_3"
    },
    {
        "source_sentence": "以七寶塼，七重而砌。",
        "translation": "It was built of seven jeweled bricks, made of seven layers.",
        "source": "T01n0025_006:0394a03_4"
    },
    {
        "source_sentence": "以七寶版，間錯莊嚴。",
        "translation": "It was decorated with seven-jeweled wooden boards, which were interspersed with ornaments.",
        "source": "T01n0025_006:0394a03_5"
    },
    {
        "source_sentence": "七重欄楯，七重鈴網，亦有七重多羅行樹，周匝圍遶，雜色可觀，乃至馬瑙七寶所成。",
        "translation": "It is surrounded by sevenfold railings, sevenfold nets of bells, and also enclosed by sevenfold palm trees with variegated colors that can be seen all the way up to the agate, which is made of the seven kinds of treasure.",
        "source": "T01n0025_006:0394a04_6"
    },
    {
        "source_sentence": "又其四方有諸階道，甚可愛樂，亦為七寶之所挍成。",
        "translation": "In the four directions there are many paths, which are very attractive and well constructed of the seven kinds of treasure.",
        "source": "T01n0025_006:0394a06_7"
    },
    {
        "source_sentence": "又生諸華優鉢羅華、鉢陀摩、究牟頭、奔茶梨迦，其華火色火形火光，",
        "translation": "It also produced various kinds of flowers, such as blue lotus blossoms, red lotus blossoms, pink lotus blossoms, white lotus blossoms, and black lotus blossoms.",
        "source": "T01n0025_006:0394a07_8"
    },
    {
        "source_sentence": "略說乃至如上，水色水形水光，明照四方。",
        "translation": "It's briefly explained up to the point where it's like the above, with water form and water form and water light shining brightly illuminating the four directions.",
        "source": "T01n0025_006:0394a09_0"
    },
    {
        "source_sentence": "香氣氛氳，普熏一切。",
        "translation": "Its fragrance permeated the whole world.",
        "source": "T01n0025_006:0394a10_0"
    },
    {
        "source_sentence": "又有藕根，汁白味甜，食之甘美，如無蠟蜜。",
        "translation": "There is also a root of lotus root with white juice and sweet taste. When eaten, it is as sweet and delicious as uncooked honey.",
        "source": "T01n0025_006:0394a10_1"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0394a12_0"
    },
    {
        "source_sentence": "其俱毘陀羅林及難陀那，二林中間，為彼羅睺羅阿修羅王有一大樹，其樹名曰蘇質多羅波吒羅，",
        "translation": "Between the two forests of Kapilavastu and Nandana, there was a large tree named Sudarśanapāṭalā belonging to King Rāhula the asuras.",
        "source": "T01n0025_006:0394a12_1"
    },
    {
        "source_sentence": "其樹縱廣種種莊嚴，皆如上說，乃至七重牆壁欄楯，車璩瑪瑙七寶所成，",
        "translation": "The length and width of the trees are variously adorned, as described above, up to seven walls, railings, chariots, and agate made of the seven treasures.",
        "source": "T01n0025_006:0394a14_2"
    },
    {
        "source_sentence": "甚可愛樂，略說乃至，種種眾鳥，各各自鳴，其音和雅，聽者歡喜。",
        "translation": "The sound was so sweet that the listeners were delighted and rejoiced.",
        "source": "T01n0025_006:0394a16_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0394a18_0"
    },
    {
        "source_sentence": "其阿修羅王七頭聚會處所嚴飾，如上所說，亦有岐道，去來徑路，為彼羅睺羅阿修羅王遊宮殿故。",
        "translation": "The asura king's seven-headed congregation is adorned with the places where he assembles, as explained above, and there are also paths of departure and arrival because they travel to the palace for the Rāhula asura king.",
        "source": "T01n0025_006:0394a18_1"
    },
    {
        "source_sentence": "又復為諸小阿修羅王，及諸小阿修羅輩，亦有岐道，通往來故。",
        "translation": "Again, for the sake of the lesser asura kings and the other lesser asura groups, there's also a divergence of paths because it's possible to go and come.",
        "source": "T01n0025_006:0394a20_2"
    },
    {
        "source_sentence": "向奢摩梨及俱毘陀羅，亦有岐道。",
        "translation": "There's also a divergence in the path that leads to śāmarī and kovidāra.",
        "source": "T01n0025_006:0394a22_0"
    },
    {
        "source_sentence": "向難陀那及難陀池、蘇質多羅波吒羅樹等，皆有岐道，通其往來，遊戲樂故。",
        "translation": "The directions of Nandana, Nanda Lake, Sucitarapāṭala Tree, and so forth all have different paths that allow them to come and go because they're playing and enjoying themselves.",
        "source": "T01n0025_006:0394a22_1"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0394a25_0"
    },
    {
        "source_sentence": "其羅睺羅阿修羅王，若欲向彼娑羅林苑及難陀那林等澡浴遊戲出觀看時，",
        "translation": "When the king Rāhula the asuras wanted to go out to bathe, play, and look around in the forests of Sāra and Nanda’s Grove,",
        "source": "T01n0025_006:0394a25_1"
    },
    {
        "source_sentence": "爾時心念鞞摩質多羅阿修羅王。",
        "translation": "It was then that he thought of the asura king Kāmacitra.",
        "source": "T01n0025_006:0394a26_2"
    },
    {
        "source_sentence": "爾時，鞞摩質多羅阿修羅王，作如是心：『彼羅睺羅阿修羅王，心念於我，",
        "translation": "At that time, the asura king Yamacitra thought to himself:",
        "source": "T01n0025_006:0394a27_3"
    },
    {
        "source_sentence": "欲共遊戲。』",
        "translation": "I want to play together.'",
        "source": "T01n0025_006:0394a29_4"
    },
    {
        "source_sentence": "其時鞞摩質多羅阿修羅王，作是念已，復自念其諸小阿修羅王，及諸小阿修羅眾輩。",
        "translation": "After he had this thought, the asura king Yamacitra again thought to himself, The small asura kings and the other small asura kings.",
        "source": "T01n0025_006:0394a29_5"
    },
    {
        "source_sentence": "爾時，彼諸小阿修羅王，并諸小阿修羅輩，即生是心：『鞞摩質多羅阿修羅王，",
        "translation": "At that time, those minor asura kings and the other minor asura clanspeople had this thought:",
        "source": "T01n0025_006:0394b02_6"
    },
    {
        "source_sentence": "念我等輩，我等當往。』",
        "translation": "Mindful of us, we'll go there.'",
        "source": "T01n0025_006:0394b04_7"
    },
    {
        "source_sentence": "即以種種眾寶瓔珞莊嚴其身，嚴飾身已，各乘騎乘，詣向鞞摩質多羅阿修羅所，",
        "translation": "They adorned their bodies with various jewel necklaces. Having adorned their bodies, they each mounted a horse and approached the asuras Yamacitra.",
        "source": "T01n0025_006:0394b04_8"
    },
    {
        "source_sentence": "到已在彼宮門之所，齊整而立。",
        "translation": "Having arrived there, he stood upright at the entrance of the palace gate.",
        "source": "T01n0025_006:0394b06_9"
    },
    {
        "source_sentence": "爾時，鞞摩質多羅阿修羅王，既見諸小阿修羅王并及諸小阿修羅眾皆聚集已，",
        "translation": "At that time, the asura king Yamacitra saw all the small asura kings and their retinues gathered together.",
        "source": "T01n0025_006:0394b07_10"
    },
    {
        "source_sentence": "即自嚴身，服諸瓔珞，馭種種乘，共諸小王及阿修羅眾，左右圍遶前後導從，",
        "translation": "He adorned himself, donned various jewelry, and drove in all kinds of carriages, accompanied by the small kings and the assembly of asuras, surrounded on their left and right, following them.",
        "source": "T01n0025_006:0394b09_11"
    },
    {
        "source_sentence": "向羅睺羅阿修羅王所，到已而住。",
        "translation": "He went to the asura king Rāhula and stayed there when he arrived.",
        "source": "T01n0025_006:0394b10_12"
    },
    {
        "source_sentence": "「爾時，羅睺羅阿修羅王，又復念彼踊躍及奢婆羅二阿修羅王等。",
        "translation": "At the time, the Rāhula asura king was also mindful of those two asura kings who jumped for joy and Śavara and so forth.",
        "source": "T01n0025_006:0394b12_0"
    },
    {
        "source_sentence": "時，彼踊躍及奢婆羅二阿修羅王亦如是念：『其羅睺羅阿修羅王，今念我等。』",
        "translation": "The two asura kings Rāhula and Śambara then also had this thought, 'That Rāhula is the asura king who's mindful of us now.'",
        "source": "T01n0025_006:0394b13_1"
    },
    {
        "source_sentence": "如是知已，彼等復各念其諸小阿修羅王及諸眾輩，其各知已，又並聚集，",
        "translation": "Known in this way, they each think of the small asura kings and their retinues. Having known each other, they assemble together again:",
        "source": "T01n0025_006:0394b15_2"
    },
    {
        "source_sentence": "嚴飾而來，各向踊躍、奢婆羅等二阿修羅王邊，到已各各嚴身瓔珞乘騎，",
        "translation": "Having arrived, they each adorned themselves with a necklace and mounted their chariots.",
        "source": "T01n0025_006:0394b16_3"
    },
    {
        "source_sentence": "將從圍遶，來向彼羅睺羅阿修羅邊，到已各各隨所在住。",
        "translation": "Surrounded by them, they came to the side of that asura named Rāhula. When they arrived there, each stayed wherever he was.",
        "source": "T01n0025_006:0394b18_4"
    },
    {
        "source_sentence": "「爾時，羅睺羅阿修羅王，見鞞摩質多羅阿修羅王等並雲集已，自念諸小阿修羅王及其眾輩。",
        "translation": "At the time, Rāhula the king of the asura kings saw King Yamacitra and other asura kings gathered together in clouds, and then he thought of the small asura kings and their retinues.",
        "source": "T01n0025_006:0394b20_0"
    },
    {
        "source_sentence": "彼等知已，亦各嚴飾服乘而來，到羅睺羅阿修羅王前，儼然住立。",
        "translation": "Knowing this, they each adorned themselves with their robes and carriages and came before the asura king Rāhula and remained standing there.",
        "source": "T01n0025_006:0394b22_1"
    },
    {
        "source_sentence": "時，彼羅睺羅阿修羅王，見已自著種種瓔珞，莊嚴其身，駕種種乘，前後圍遶，",
        "translation": "Having seen this, the asura king Rāhula clad himself in various jewelry and adorned his body in various vehicles, surrounded before and after him.",
        "source": "T01n0025_006:0394b23_2"
    },
    {
        "source_sentence": "即共鞞摩質多羅阿修羅王，并及踊躍、奢婆羅等阿修羅王，并諸小王阿修羅眾輩，",
        "translation": "He was accompanied by the asura king Yamacitra, the asura kings Rājagṛha and Śavara, as well as all the other minor royal asura kings.",
        "source": "T01n0025_006:0394b25_3"
    },
    {
        "source_sentence": "雲集導從，向娑羅林、奢摩梨林、俱毘陀羅林、難陀那林等，到已在前少時而住。",
        "translation": "The clouds gathered and followed him, heading for the salā trees, śamālī trees, kumbhīra trees, and nandanavana trees, where they stayed for a short time before arriving.",
        "source": "T01n0025_006:0394b27_4"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0394c01_0"
    },
    {
        "source_sentence": "其難陀那林苑之中，自然而有三種風輪。",
        "translation": "In the forest of Nandanavana, there are naturally three kinds of wind wheels.",
        "source": "T01n0025_006:0394c01_1"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T01n0025_006:0394c02_2"
    },
    {
        "source_sentence": "所謂開者、淨者、吹者。",
        "translation": "They're called the initiator, the pure one, and the blower.",
        "source": "T01n0025_006:0394c02_3"
    },
    {
        "source_sentence": "於中開者，所有風輪，開敞諸門；",
        "translation": "When the doors are opened within, all the wind-wheels that exist open the doors.",
        "source": "T01n0025_006:0394c02_4"
    },
    {
        "source_sentence": "淨者風輪掃除諸地；",
        "translation": "The pure one’s wind-wheel sweeps the earth.",
        "source": "T01n0025_006:0394c03_5"
    },
    {
        "source_sentence": "吹者風輪吹諸華樹。",
        "translation": "A blowing wind is a wind whirl that blows flowers and trees.",
        "source": "T01n0025_006:0394c04_6"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0394c04_7"
    },
    {
        "source_sentence": "其難陀那林苑之中，上妙好華遍散滿地，其花香氣普熏園林，莊嚴充足，",
        "translation": "In the grove of Nandanavana’s forest, exquisitely beautiful flowers scattered all over the ground. The fragrance of these flowers perfumed the garden and its trees with an abundance of adornments.",
        "source": "T01n0025_006:0394c04_8"
    },
    {
        "source_sentence": "種種可觀。",
        "translation": "Various kinds can be contemplated.",
        "source": "T01n0025_006:0394c06_9"
    },
    {
        "source_sentence": "「爾時，羅睺羅阿修羅王，及鞞摩質多羅阿修羅王、踊躍阿修羅王、奢婆羅阿修羅王等，",
        "translation": "“At that time, the asura king Rāhula, the asura king Yamacitra, the asura king Dṛṣṭiprāpta, the asura king Jīvaka, the asura king Śavara, and so forth.",
        "source": "T01n0025_006:0394c07_0"
    },
    {
        "source_sentence": "并諸小王，群眾眷屬小阿修羅輩，圍遶而入難陀那園。",
        "translation": "He was surrounded by the small kings, their retinues, and the small asura tribesmen, and they entered Nandanavana's Park.",
        "source": "T01n0025_006:0394c09_0"
    },
    {
        "source_sentence": "入已澡浴遊戲受樂，種種觀矚，或行或住或臥或坐，隨所欲往，任意而行。",
        "translation": "After entering, they bathe, play, and enjoy various views, either walking or standing, lying or sitting, traveling at will as they wish.",
        "source": "T01n0025_006:0394c10_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0394c12_0"
    },
    {
        "source_sentence": "其羅睺羅阿修羅王，亦常有五阿修羅，擁護惡事，名字如前。",
        "translation": "The king of the Rāhula asura also always had five asura demons who protected him against evil deeds. Their names were as before.",
        "source": "T01n0025_006:0394c12_1"
    },
    {
        "source_sentence": "宮上海水，縱廣厚薄，四種風持，令不墮墜，亦如上說。",
        "translation": "The water of the palace and shanghai rivers, even though wide and thick, is sustained by four kinds of wind and prevents it from falling down.",
        "source": "T01n0025_006:0394c13_2"
    },
    {
        "source_sentence": "起世經四天王品第七",
        "translation": "The Seventh Chapter of the Sutra on the Awakening of the World: The Four Celestial Kings",
        "source": "T01n0025_006:0394c15_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0394c16_0"
    },
    {
        "source_sentence": "其須彌留山王，東面半腹，去地四萬二千踰闍那，由乾陀山頂，有提頭賴吒天王城郭住處，",
        "translation": "At the eastern side of this mountain, halfway up the east of Mount Sumeru, forty-two thousand yojanas above the ground at the top of the summit of Yugaṃdhara Mountain is the dwelling place of the celestial king Dhṛtarāṣṭra’s citadel.",
        "source": "T01n0025_006:0394c16_1"
    },
    {
        "source_sentence": "城名賢上，縱廣六百踰闍那，七重垣牆、七重欄楯、七重鈴網。",
        "translation": "The city was called Bhadraśri, six hundred yojanas long and wide, with seven walls, seven railings, and seven networks of bells.",
        "source": "T01n0025_006:0394c18_2"
    },
    {
        "source_sentence": "復有七重多羅行樹，周匝圍遶，雜色可觀，悉以七寶而為莊嚴，所謂金銀鞞琉璃、頗致迦赤真珠、車璩馬瑙等之所成就。",
        "translation": "It is also surrounded by sevenfold palm trees of variegated colors, all adorned with the seven kinds of treasure: so-called gold, silver, lapis lazuli, crystal, red pearl, agate, and emerald.",
        "source": "T01n0025_006:0394c19_3"
    },
    {
        "source_sentence": "普四方面各有諸門，而彼諸門有諸樓櫓却敵臺觀、園苑諸池。",
        "translation": "Each of the four directions has its own gates, and those gates have towers, towers, enemies, terraces, pavilions, parks, and ponds.",
        "source": "T01n0025_006:0394c22_4"
    },
    {
        "source_sentence": "其諸花林有種種樹，與種種葉，種種花果，種種香熏。",
        "translation": "In the forest of flowers there are various kinds of trees, with various kinds of leaves and different kinds of flowers and fruits that have various fragrances.",
        "source": "T01n0025_006:0394c23_5"
    },
    {
        "source_sentence": "有種種鳥，各各自鳴，其音調和，甚可愛樂。",
        "translation": "There were various kinds of birds, each singing its own voice in a pleasing and harmonious voice.",
        "source": "T01n0025_006:0394c24_6"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0394c26_0"
    },
    {
        "source_sentence": "其須彌留山王，南面半腹，去地亦四萬二千踰闍那，由乾陀山頂，有毘婁勒迦天王城郭住處，",
        "translation": "At the southern half-side of Mount Sumeru, which is forty-two thousand yojanas above the ground at the summit of Yugaṃdhara, is the dwelling place of the celestial king Virūḍhaka.",
        "source": "T01n0025_006:0394c26_1"
    },
    {
        "source_sentence": "城名善現，縱廣莊嚴一一如前提頭賴吒天王處所，略說乃至，種種諸鳥，",
        "translation": "The city is called Sudarśana, adorned one by one as if it were the abode of the celestial king Dhṛtarāṣṭra, and so on, up to various birds.",
        "source": "T01n0025_006:0394c28_2"
    },
    {
        "source_sentence": "各各自鳴。",
        "translation": "Each one sounded its own name.",
        "source": "T01n0025_006:0395a01_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0395a02_0"
    },
    {
        "source_sentence": "其須彌留山王，西面半腹，去地亦四萬二千踰闍那，由乾陀山頂，有毘婁博叉天王城郭住處，",
        "translation": "At the west side of the king of Mount Sumeru, halfway to the west and also forty-two thousand yojanas above the ground at the summit of Yugaṃdhara, is the dwelling place of the celestial king Virūḍhaka.",
        "source": "T01n0025_006:0395a02_1"
    },
    {
        "source_sentence": "城名善觀。",
        "translation": "The city is called Shanguan (“Good Contemplation”).",
        "source": "T01n0025_006:0395a04_2"
    },
    {
        "source_sentence": "縱廣莊嚴一一如前提頭賴吒天王處所，略說乃至，種種諸鳥，各各自鳴，",
        "translation": "Each one of them was adorned as if they were the abode of the celestial king Dhṛtarāṣṭra, briefly speaking up to various kinds of birds each singing their own song.",
        "source": "T01n0025_006:0395a04_3"
    },
    {
        "source_sentence": "其音調和，甚可愛樂。",
        "translation": "The sound was harmonious and very pleasing.",
        "source": "T01n0025_006:0395a06_4"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0395a07_0"
    },
    {
        "source_sentence": "其須彌留山王，北面半腹，去地亦四萬二千踰闍那，由乾陀山頂，為毘沙門天王有三城郭，",
        "translation": "The king of Mount Sumeru, which is halfway to the northwest and also forty-two thousand yojanas from the ground at the top of the mountain, has three castles as his heavenly king Vaiśravaṇa.",
        "source": "T01n0025_006:0395a07_1"
    },
    {
        "source_sentence": "以為住處。",
        "translation": "They think it's a dwelling place.",
        "source": "T01n0025_006:0395a09_2"
    },
    {
        "source_sentence": "其三者何？",
        "translation": "What are these three?",
        "source": "T01n0025_006:0395a09_3"
    },
    {
        "source_sentence": "第一所謂毘舍羅婆、第二名為伽婆鉢帝、第三名曰阿茶槃多。",
        "translation": "The first is called Vaiśravaṇa, the second is called Kapilavastu, and the third is called Avapāṇḍa.",
        "source": "T01n0025_006:0395a09_4"
    },
    {
        "source_sentence": "各各縱廣六百踰闍那，七重垣牆，七重欄楯，略說乃至種種眾鳥，各各自鳴。",
        "translation": "Each one was six hundred yojanas long and wide, protected by seven walls and seven railings. In short, all the kinds of birds that lived there each sang a song.",
        "source": "T01n0025_006:0395a11_5"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0395a13_0"
    },
    {
        "source_sentence": "唯除月天子宮殿、日天子七大宮殿，其間所有自餘貫屬四大天王諸天宮殿，",
        "translation": "Except for the palaces of the moon gods, the palaces of the celestial constellations, and the seven great palaces of the sun gods, all the other palaces in between belonged to the four great guardian gods.",
        "source": "T01n0025_006:0395a13_1"
    },
    {
        "source_sentence": "或有縱廣四十踰闍那，或有三十二十十二，其最小者，猶故縱廣六踰闍那，",
        "translation": "It may be forty yojanas long and wide, or thirty-twenty-two yojanas in length and width. The smallest is still six yojanas long and wide.",
        "source": "T01n0025_006:0395a15_2"
    },
    {
        "source_sentence": "亦各七重垣牆欄楯，略說如前，乃至各各眾鳥自鳴。",
        "translation": "Each also has sevenfold walls and railings, as briefly described above. All the birds in each case sing for themselves.",
        "source": "T01n0025_006:0395a16_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0395a19_0"
    },
    {
        "source_sentence": "其毘舍羅婆及伽婆鉢帝，二宮殿間，為毘沙門天王有一池水，其池名曰那墀尼，",
        "translation": "Between the two palaces of Vaiśravaṇa and Gavāṃpati, there was a pool of water called Nāmaṇi between Vaiśravaṇa and Devānām-Indra.",
        "source": "T01n0025_006:0395a19_1"
    },
    {
        "source_sentence": "縱廣四十踰闍那。",
        "translation": "It's forty yojanas long and wide.",
        "source": "T01n0025_006:0395a21_2"
    },
    {
        "source_sentence": "其水調和，清涼輕軟，其味甜美，香潔不濁。",
        "translation": "The water is delicately blended and clear, cool, light, and soft. The taste of the water is sweet and delicious, fragrant and not turbid.",
        "source": "T01n0025_006:0395a21_3"
    },
    {
        "source_sentence": "其池四邊七重塼砌，七重寶版，間錯分明，七重欄楯，七重鈴網。",
        "translation": "The four sides of the pond were built of seven-story brick, adorned with sevenfold jeweled boards arranged in distinctive patterns. The seven railings and seven sets of bell nets embellished the rows at intervals.",
        "source": "T01n0025_006:0395a22_4"
    },
    {
        "source_sentence": "亦有七重多羅行樹，周匝圍遶，雜色可觀，七寶所成，乃至車璩馬瑙等寶。",
        "translation": "It is also surrounded by sevenfold palm trees of variegated colors that can be seen, all made of the seven kinds of treasure, up to the precious treasures of chariots, agate, horse cartriages, and so on.",
        "source": "T01n0025_006:0395a24_0"
    },
    {
        "source_sentence": "普四方面各有階道，亦為七寶之所莊嚴。",
        "translation": "Each of the four directions has a staircase, which is also adorned with seven treasures.",
        "source": "T01n0025_006:0395a25_1"
    },
    {
        "source_sentence": "於其池中，有優鉢羅、鉢陀摩、究牟陀、奔茶梨迦等諸華，自然出生。",
        "translation": "In that pond, there are flowers like utpala, padma, kumbhūḍa, and puṇḍarīka that naturally grow.",
        "source": "T01n0025_006:0395a26_2"
    },
    {
        "source_sentence": "其華火色火形火光，乃至水色水形水光，華開縱廣大如車輪。",
        "translation": "The flowers are the color of fire, the shape of fire is the light of fire, and the water is the color of water and the shape of water is the light of water, and the flowers bloom wide and long like a chariot wheel.",
        "source": "T01n0025_006:0395a28_3"
    },
    {
        "source_sentence": "其光明照半踰闍那，其香氣熏一踰闍那。",
        "translation": "That light shone for half a yojana, and its fragrance permeated one yojana.",
        "source": "T01n0025_006:0395a29_4"
    },
    {
        "source_sentence": "有諸藕根，大如車軸，割之汁出，色白如乳，食之甜美，味甘猶蜜。",
        "translation": "There are roots of various kinds of lotus root as large as a carriage axle, which are cut and juice is produced. Their color is white like milk but when eaten they are sweet and delicious, with the taste of sweetness like honey.",
        "source": "T01n0025_006:0395b01_5"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0395b04_0"
    },
    {
        "source_sentence": "其伽婆鉢帝及阿茶槃多，二宮殿間，為毘沙門天王有園苑住，其園名曰迦毘延多，",
        "translation": "Between the two palaces of Kapilavastu and Acabandhu, there was a pleasure park called Kapilavastu for Vaiśravaṇa.",
        "source": "T01n0025_006:0395b04_1"
    },
    {
        "source_sentence": "縱廣正等四十踰闍那，七重垣牆、七重欄楯，乃至七重多羅行樹，周匝圍遶，",
        "translation": "It was forty yojanas in width and depth, surrounded by seven walls, seven railings, and even seven lines of palm trees.",
        "source": "T01n0025_006:0395b06_2"
    },
    {
        "source_sentence": "雜色可觀，略說如前，乃至七寶之所成就。",
        "translation": "A mixture of form can be observed, which is briefly described as before, up to the point where it's accomplished by seven treasures.",
        "source": "T01n0025_006:0395b07_3"
    },
    {
        "source_sentence": "其提頭賴吒天王，賢上住處，城郭往來，有二岐道；",
        "translation": "The celestial king Dhṛtarāṣṭra, the abode of the wise and virtuous, came and went on two different paths from one city to another.",
        "source": "T01n0025_006:0395b08_4"
    },
    {
        "source_sentence": "毘婁勒迦天王，善現住處，城郭去來，亦二岐道；",
        "translation": "Virūḍhaka, the king of the heavens, is a well-presented dwelling place. His castles and enclosures are also on two different paths, past and future.",
        "source": "T01n0025_006:0395b10_5"
    },
    {
        "source_sentence": "毘婁博叉天王，其善觀處，城郭去來，有二岐道；",
        "translation": "Virūpākṣa is a good observation point, with two distinctive paths of going and coming from one city to another.",
        "source": "T01n0025_006:0395b11_6"
    },
    {
        "source_sentence": "其毘沙門天王，阿茶槃多城郭處所，有二岐道；",
        "translation": "Vaiśravaṇa, the heavenly king of Vaiśravaṇa, resided in the city walls of Acavata. There were two paths leading to and from each other.",
        "source": "T01n0025_006:0395b12_7"
    },
    {
        "source_sentence": "毘舍羅婆及伽婆鉢帝等城郭處所，亦各俱有二岐之道；",
        "translation": "The cities Vaiśravaṇa and Kapilavastu also each had two different paths.",
        "source": "T01n0025_006:0395b13_8"
    },
    {
        "source_sentence": "其四天王所有眷屬，諸小天眾宮殿處所，亦各往來有二岐道；",
        "translation": "The retinues of the rulers of the four heavens, as well as the palaces and residences of the gods in the lesser heavens, also came and went on two different paths.",
        "source": "T01n0025_006:0395b14_9"
    },
    {
        "source_sentence": "其那墀尼池，及迦毘延多苑等，亦各往來有二岐道。",
        "translation": "The Naanni Lake and the Kapilavastu Groves also each had two different paths of going and coming.",
        "source": "T01n0025_006:0395b16_10"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0395b18_0"
    },
    {
        "source_sentence": "其毘沙門天王，若欲至彼迦毘延多苑中遊戲澡浴之時，內心即念提頭賴吒天王。",
        "translation": "When Vaiśravaṇa, the king of Vaiśravaṇa, wanted to go play and bathe in the Kāpīyāntaka Park, he thought internally of Dhṛtarāṣṭra, the king of gods.",
        "source": "T01n0025_006:0395b18_1"
    },
    {
        "source_sentence": "爾時，提頭賴吒天王亦心生念：『毘沙門天王意中念我。』",
        "translation": "At the time, the celestial king Dhṛtarāṣṭra also had this thought in his mind, 'The heavenly king Vaiśravaṇa is mindful of me.'",
        "source": "T01n0025_006:0395b20_2"
    },
    {
        "source_sentence": "如是知已，其即自念其天所屬諸小天王及天眾等。",
        "translation": "Known in this way, they then think of the small celestial kings and other gods who belong to their gods.",
        "source": "T01n0025_006:0395b21_3"
    },
    {
        "source_sentence": "是時，東面所屬身天王及眾輩，作如是念：『提頭賴吒天王，心念我等。』",
        "translation": "At the time, the body-heaven king and the crowd of people to whom he belonged to the east had this thought, 'The heavenly king Titrāyaṭa is mindful of us.'",
        "source": "T01n0025_006:0395b22_4"
    },
    {
        "source_sentence": "如是知已，各各嚴身種種瓔珞，乘種種騎，詣向提頭賴吒大天王邊，到已在前，",
        "translation": "Having thus known, they each adorned their bodies with various jewelry and rode on various horses to the side of the great celestial king Dhṛtarāṣṭra, who was in front of them.",
        "source": "T01n0025_006:0395b24_5"
    },
    {
        "source_sentence": "一面而住。",
        "translation": "He stood to one side.",
        "source": "T01n0025_006:0395b26_0"
    },
    {
        "source_sentence": "爾時，提頭賴吒天王，即自莊嚴，服諸瓔珞。",
        "translation": "At that time, the celestial king Dhṛtarāṣṭra adorned himself and donned various jewelry.",
        "source": "T01n0025_006:0395b26_1"
    },
    {
        "source_sentence": "馭駕乘已，與諸小王天眾眷屬，前後圍遶，相將往詣毘沙門大天王邊，",
        "translation": "Having driven the chariot, he was accompanied by the retinues of the minor kings and gods. Surrounded in front and behind him, they were about to go to the side of Vaiśravaṇa, the great celestial king.",
        "source": "T01n0025_006:0395b27_2"
    },
    {
        "source_sentence": "到已在彼毘沙門王面前而住。",
        "translation": "When he arrived, he was standing in front of that Vaiśravaṇa king.",
        "source": "T01n0025_006:0395b28_3"
    },
    {
        "source_sentence": "「爾時，毘沙門天王，心念毘婁勒迦、毘婁博叉二大天王。",
        "translation": "At the time, Vaiśravaṇa was mindful of the two great celestial kings Virūḍhaka and Virūḍhaka.",
        "source": "T01n0025_006:0395c01_0"
    },
    {
        "source_sentence": "時，彼二王心如是念：『毘沙門王，意念我等。』",
        "translation": "Those two kings then had this thought in their minds, 'The king of Vaiśravaṇa thinks of us.'",
        "source": "T01n0025_006:0395c02_1"
    },
    {
        "source_sentence": "如是知已，即各自念己所統領諸小天王并諸天眾。",
        "translation": "Known in this way, they each think of the small celestial kings and their heavenly hosts that they lead.",
        "source": "T01n0025_006:0395c03_2"
    },
    {
        "source_sentence": "時，彼小王及諸天眾亦復心念：『我等大王心念我輩，宜時速往。』",
        "translation": "The lesser kings and the gods then also thought, 'We great kings are mindful of us, so it's better to go quickly.'",
        "source": "T01n0025_006:0395c04_3"
    },
    {
        "source_sentence": "如是知已，各自嚴飾瓔珞其身，俱共往詣毘婁勒迦及毘婁博叉二天王所，",
        "translation": "Knowing thus, they each adorned their bodies with jewelry and went together to the abode of the two celestial kings Virūḍhaka and Virūpākṣa.",
        "source": "T01n0025_006:0395c06_0"
    },
    {
        "source_sentence": "到已而住。",
        "translation": "After arriving, he stayed.",
        "source": "T01n0025_006:0395c07_1"
    },
    {
        "source_sentence": "時，二天王知諸小王及餘天眾聚集來已，各自嚴身，服眾瓔珞，便即騎乘，",
        "translation": "Then the two guardian gods of heaven, knowing that the kings of the lesser gods and those of the other guardian gods had assembled, each adorned themselves with a variety of jewelry, and rode their horses.",
        "source": "T01n0025_006:0395c08_0"
    },
    {
        "source_sentence": "與眾圍遶，皆共往詣毘沙門宮大天王所，到已在前，俱各停住。",
        "translation": "Surrounded by the crowd, they all went to Vaiśravaṇa's palace and the great celestial king, who was in front of them when he arrived, and each stopped.",
        "source": "T01n0025_006:0395c09_1"
    },
    {
        "source_sentence": "「爾時，毘沙門天王，知諸二王天眾集已，復自念其所領小天王及諸群眾。",
        "translation": "At the time, Vaiśravaṇa knew that the two kings and gods had gathered, and then he thought of the small heavenly kings and the masses he led.",
        "source": "T01n0025_006:0395c12_0"
    },
    {
        "source_sentence": "爾時，北方諸小天王及其天眾，作如是心：『毘沙門天王今念我等。』",
        "translation": "At the time, the small celestial kings and other gods in the north had this thought, 'The Vaiśravaṇa Devānām-Indra is calling us now.'",
        "source": "T01n0025_006:0395c13_1"
    },
    {
        "source_sentence": "如是知已，各著種種眾寶瓔珞，莊嚴身已，詣毘沙門大天王前，各皆立住。",
        "translation": "Known in this way, they each wore various jeweled jewelry. Having adorned their bodies, they went to the great celestial king Vaiśravaṇa and each stood there.",
        "source": "T01n0025_006:0395c15_2"
    },
    {
        "source_sentence": "「爾時，毘沙門天王，自著種種眾寶瓔珞，莊嚴自身駕種種乘，共提頭賴吒、毘婁勒迦、毘婁博叉等四大天王，",
        "translation": "At that time the deva king Vaiśravaṇa, wearing a necklace of all kinds of jewels, adorned himself and drove in various vehicles together with the four great deva kings Dhṛtarāṣṭra, Videla, and Videha.",
        "source": "T01n0025_006:0395c17_0"
    },
    {
        "source_sentence": "各與所屬諸天王眾，前後圍遶，俱皆詣向迦毘延多園所，到已在苑前住。",
        "translation": "Each was surrounded by a group of celestial kings who belonged to them, and they all went to the Kāpīyāntaka Park in front of the park.",
        "source": "T01n0025_006:0395c19_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0395c21_2"
    },
    {
        "source_sentence": "其迦毘延多苑中，自然而有三風輪來，一開、二淨、三吹。",
        "translation": "In that Kāpīyāntaka Park, there are three winds that naturally come from the three wheels of wind, one blowing, two pure, and three blowing.",
        "source": "T01n0025_006:0395c21_3"
    },
    {
        "source_sentence": "開者開彼園門；",
        "translation": "“Enlightenment” is to enlighten the gates of those parks.",
        "source": "T01n0025_006:0395c22_4"
    },
    {
        "source_sentence": "淨者淨彼園地；",
        "translation": "The pure one purifies the land of that park.",
        "source": "T01n0025_006:0395c22_5"
    },
    {
        "source_sentence": "吹者吹彼園樹，諸華飄颺。",
        "translation": "The blower blows the tree in that grove, and the flowers float away.",
        "source": "T01n0025_006:0395c23_6"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0395c23_7"
    },
    {
        "source_sentence": "其迦毘延多苑中眾華，積至于膝，種種香氣周遍普熏。",
        "translation": "The flowers in the Kapilavastu grove piled up to their knees, with various fragrances pervading and permeating them all over.",
        "source": "T01n0025_006:0395c24_8"
    },
    {
        "source_sentence": "「爾時，毘沙門天王、提頭賴吒天王、毘婁勒迦王、毘婁博叉王等，與諸小王通及眷屬圍遶，",
        "translation": "At that time the deva king Vaiśravaṇa, the deva king Dhṛtarāṣṭra, the deva king Videha, the deva king Virūḍhaka, the deva king Videha, and the deva king Videha were there together with their retinues.",
        "source": "T01n0025_006:0395c26_0"
    },
    {
        "source_sentence": "共入迦毘延多苑中，澡浴遊戲，種種受樂。",
        "translation": "Together they entered the park of Kapilavastu to bathe, play, and enjoy various pleasures.",
        "source": "T01n0025_006:0395c28_1"
    },
    {
        "source_sentence": "於彼園中，或復一月二月三月。",
        "translation": "In that park, it might be another month, two months, or three months.",
        "source": "T01n0025_006:0395c29_2"
    },
    {
        "source_sentence": "澡浴訖已，遊戲受樂，隨欲去處，自恣而行。",
        "translation": "After having bathed and bathed, they play and enjoy the pleasures. Wherever they wish to go or not, they do so as freely as they wish.",
        "source": "T01n0025_006:0395c29_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0396a01_4"
    },
    {
        "source_sentence": "其毘沙門，亦有五夜叉神王，恒常隨逐，側近左右，為守護故。",
        "translation": "The Vaiśravaṇa also had five divine kings of yakṣa spirits who constantly pursued him, following him from side to side in order to protect him.",
        "source": "T01n0025_006:0396a02_0"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T01n0025_006:0396a03_1"
    },
    {
        "source_sentence": "一名五丈、二名曠野、三名金山、四名長身、五名針毛。",
        "translation": "One is five zhang tall, two are called the wilderness, three are called the golden mountain, four are long-bodied, and five are called the needle hair.",
        "source": "T01n0025_006:0396a03_2"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0396a04_3"
    },
    {
        "source_sentence": "其毘沙門天王，遊戲去來，常為此等五夜叉神之所守護。",
        "translation": "Vaiśravaṇa, the heavenly king of Vaiśravaṇa, always plays and comes and goes under the protection of these five yakṣa spirits.",
        "source": "T01n0025_006:0396a05_4"
    },
    {
        "source_sentence": "起世經三十三天品第八上",
        "translation": "A Forest of Pearls from the Dharma Garden, Volume II The Eighth Chapter of the Sutra on the Arising of the World",
        "source": "T01n0025_006:0396a07_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0396a08_0"
    },
    {
        "source_sentence": "其須彌留山王頂上，有三十三天宮殿住處，其處縱廣八萬踰闍那，七重垣牆、七重欄楯、七重鈴網，",
        "translation": "On top of the summit of Mount Sumeru is the abode of the palace of the thirty-three gods, measuring eighty thousand yojanas in length and breadth with seven walls, seven rails, seven railings, and seven networks of bells.",
        "source": "T01n0025_006:0396a08_1"
    },
    {
        "source_sentence": "七重多羅行樹，周匝圍遶，雜色可觀，七寶所成，所謂金銀鞞琉璃，頗致迦赤真珠，",
        "translation": "It is surrounded by sevenfold palm trees of variegated colors, all made of the seven kinds of treasure: so-called gold, silver, copper, and lapis lazuli.",
        "source": "T01n0025_006:0396a10_2"
    },
    {
        "source_sentence": "車璩馬瑙等。",
        "translation": "chariots, carriages, horse agate, and so forth.",
        "source": "T01n0025_006:0396a12_3"
    },
    {
        "source_sentence": "其垣牆高四百踰闍那，廣五十踰闍那，彼等垣牆，相去各各五百踰闍那，",
        "translation": "The walls were four hundred yojanas high and fifty yojanas wide, and each wall was five hundred yojanas in distance from the other.",
        "source": "T01n0025_006:0396a12_4"
    },
    {
        "source_sentence": "於其中間有諸門住。",
        "translation": "Among them, there are various approaches that abide.",
        "source": "T01n0025_006:0396a14_5"
    },
    {
        "source_sentence": "彼等諸門高三十踰闍那，廣十踰闍那。",
        "translation": "These gates are thirty yojanas high and ten yojanas wide.",
        "source": "T01n0025_006:0396a14_6"
    },
    {
        "source_sentence": "其門兩邊，有諸樓櫓却敵臺閣及輦輿等。",
        "translation": "On both sides of the gate were towers, enemies’ terraces and pavilions as well as carriages.",
        "source": "T01n0025_006:0396a15_7"
    },
    {
        "source_sentence": "又有諸池及以花林，有種種樹，種種葉，種種花果，種種香熏，有種種鳥，",
        "translation": "There are also ponds and flower groves with various kinds of trees, various kinds of leaves, various kinds of flowers and fruit, various kinds of fragrances, and various kinds of birds.",
        "source": "T01n0025_006:0396a16_8"
    },
    {
        "source_sentence": "各各自鳴，其音調和，甚可愛樂。",
        "translation": "Each of them each sounded, and their voices were harmonious and very pleasing.",
        "source": "T01n0025_006:0396a18_9"
    },
    {
        "source_sentence": "又彼諸門，各各常有五百夜叉，為三十三天作守護故。",
        "translation": "Also, each of those gates always has five hundred night-vision yakṣas, which are the guardians of the thirty-three gods.",
        "source": "T01n0025_006:0396a18_10"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0396a20_11"
    },
    {
        "source_sentence": "彼垣牆內，為三十三天王有一城郭，名曰善見，其城縱廣六萬踰闍那，",
        "translation": "Inside the wall was a city called Sudarśana, built for the king of the thirty-three gods. That city was sixty thousand yojanas in length and width.",
        "source": "T01n0025_006:0396a20_12"
    },
    {
        "source_sentence": "七重垣牆、七重欄楯、七重鈴網，七重多羅行樹，周匝圍遶，雜色可觀，",
        "translation": "It is surrounded by sevenfold walls embellished with seven railings, seven ornamental nets of bells, and seven lines of palm trees.",
        "source": "T01n0025_006:0396a21_13"
    },
    {
        "source_sentence": "亦為七寶之所莊嚴，乃至車璩馬瑙等寶。",
        "translation": "It's also adorned with seven treasures, including chariots, horse agate, and other treasures.",
        "source": "T01n0025_006:0396a23_14"
    },
    {
        "source_sentence": "彼城壁高百踰闍那，其上廣五十踰闍那，彼城垣牆亦各相去五百踰闍那，",
        "translation": "The walls of that city are one hundred yojanas high and fifty yojanas wide above each other, and the walls of those walls are also five hundred yojanas apart.",
        "source": "T01n0025_006:0396a24_15"
    },
    {
        "source_sentence": "於其中間有諸門住，其門各高三十踰闍那，廣十踰闍那。",
        "translation": "Among them, there are various approaches standing in the middle. Each approach is thirty yojanas high and ten yojanas wide.",
        "source": "T01n0025_006:0396a26_16"
    },
    {
        "source_sentence": "彼等諸門，亦有樓櫓却敵臺閣，諸池花林，有種種樹，種種葉，種種花果，",
        "translation": "At each of these gates there was a tower, an enemy terrace and pavilion. There were ponds, flowering trees, various kinds of trees, various kinds of leaves, and various kinds of flowers and fruit.",
        "source": "T01n0025_006:0396a27_17"
    },
    {
        "source_sentence": "種種香熏，種種眾鳥，各各自鳴。",
        "translation": "Various kinds of fragrances were perfumed, and various kinds of birds each sounded their own voices.",
        "source": "T01n0025_006:0396a29_18"
    },
    {
        "source_sentence": "彼等諸門，門別各有五百夜叉，為三十三天而作守護。",
        "translation": "Each of those gates has five hundred night-sharks, guarded by the thirty-three gods.",
        "source": "T01n0025_006:0396a29_19"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0396b03_0"
    },
    {
        "source_sentence": "近彼天宮善見城側，為伊羅鉢那大龍象王有宮殿住，其宮殿縱廣六百踰闍那，",
        "translation": "At the side of the city Sudarśana near the celestial palace was a palace built for the great dragon elephant king Airāvana, six hundred yojanas in length and width.",
        "source": "T01n0025_006:0396b03_1"
    },
    {
        "source_sentence": "亦有七重牆壁欄楯，略說乃至種種眾鳥，各各自鳴。",
        "translation": "There are also sevenfold walls and railings, which are briefly described as various kinds of birds each singing.",
        "source": "T01n0025_006:0396b05_0"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0396b06_1"
    },
    {
        "source_sentence": "彼善見城大垣牆內，為三十三天有聚會處，名善法堂，其處縱廣五百踰闍那，",
        "translation": "Within the great wall of the city of Sudarśana there is a meeting place for the thirty-three gods called Sudharma Hall, which is five hundred yojanas long and wide.",
        "source": "T01n0025_006:0396b06_2"
    },
    {
        "source_sentence": "七重欄楯、七重鈴網、七重多羅行樹，周匝圍遶，雜色可觀，七寶所成，",
        "translation": "It is surrounded by sevenfold walls embellished with seven railings, seven ornamental nets of bells, and seven lines of palm trees. The colors are variegated and can be seen to be made of the seven kinds of treasure.",
        "source": "T01n0025_006:0396b08_3"
    },
    {
        "source_sentence": "乃至車璩馬瑙等寶。",
        "translation": "It's even made of treasures like chariots, horse agate, and so forth.",
        "source": "T01n0025_006:0396b09_4"
    },
    {
        "source_sentence": "普四方面各有諸門，皆有樓櫓却敵臺觀，種種雜色，七寶所成。",
        "translation": "Each of the four directions had gates, each with a tower and an enemy pavilion, all made of the seven kinds of treasure.",
        "source": "T01n0025_006:0396b10_5"
    },
    {
        "source_sentence": "其地純是青琉璃寶，柔軟滑澤，觸之猶如迦旃隣提衣。",
        "translation": "The ground was purely made of blue lapis lazuli, as soft and slippery as if touched by a khattiya garment.",
        "source": "T01n0025_006:0396b11_6"
    },
    {
        "source_sentence": "當其中間，有一寶柱，高二十踰闍那。",
        "translation": "Between them was a jeweled pillar twenty yojanas in height.",
        "source": "T01n0025_006:0396b13_7"
    },
    {
        "source_sentence": "於其柱下，為天帝釋置立一座，高一踰闍那，廣半踰闍那，雜色可觀，",
        "translation": "At the foot of the pillar was a pavilion erected for Indra, one yojana in height and half a yojana in width, with variegated colors that could be seen.",
        "source": "T01n0025_006:0396b14_0"
    },
    {
        "source_sentence": "乃至車璩馬瑙七寶成就，柔軟細滑，觸之如前。",
        "translation": "It's even made of the seven treasures of chariot, horse agate, and agate, which are as soft and gentle to touch as before.",
        "source": "T01n0025_006:0396b15_1"
    },
    {
        "source_sentence": "其座兩邊，各有十六小天王座，而侍衛之，七寶所成，雜色可觀，細滑觸之，",
        "translation": "On both sides of the throne were sixteen small celestial king seats, each guarded by an attendant made of the seven kinds of treasure with variegated colors that could be seen and touched.",
        "source": "T01n0025_006:0396b16_2"
    },
    {
        "source_sentence": "如前不異。",
        "translation": "As before, it's not different.",
        "source": "T01n0025_006:0396b18_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0396b19_0"
    },
    {
        "source_sentence": "其善法堂諸天集處，為天帝釋更立宮殿，其宮殿廣千踰闍那，七重垣牆，",
        "translation": "At the place where the gods assembled in the hall of the fine dharma, they built another palace for Indra. That palace was one thousand yojanas in width and enclosed by seven walls.",
        "source": "T01n0025_006:0396b19_1"
    },
    {
        "source_sentence": "乃至眾鳥，各各自鳴。",
        "translation": "Each of the birds sings its own song.",
        "source": "T01n0025_006:0396b20_2"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0396b21_3"
    },
    {
        "source_sentence": "其善法堂諸天集處，東西南北，為諸小王有宮殿住，縱廣九百踰闍那者，",
        "translation": "To the east, west, south, and north of this hall of the Hall of Good Dharma are the places where the gods assemble. For the sake of the minor kings there is a palace that extends nine hundred yojanas in length and breadth.",
        "source": "T01n0025_006:0396b21_4"
    },
    {
        "source_sentence": "或八或七六五四三二，其最小者，廣百踰闍那，七重垣牆，乃至眾鳥，",
        "translation": "The smallest is one hundred yojanas in width, surrounded by seven walls and so on, all the way up to a great many birds.",
        "source": "T01n0025_006:0396b23_5"
    },
    {
        "source_sentence": "各各自鳴。",
        "translation": "Each one sounded its own name.",
        "source": "T01n0025_006:0396b24_6"
    },
    {
        "source_sentence": "其善法堂諸天會處東西南北，為三十三天諸小天宮，縱廣九十踰闍那，",
        "translation": "To the east, west, south, and north of these halls of the Hall of Good Dharma are the thirty-three celestial palaces, measuring ninety yojanas in length and breadth.",
        "source": "T01n0025_006:0396b25_0"
    },
    {
        "source_sentence": "八十七十六十五十四十三十二十，其最小者，廣十二踰闍那，七重垣牆，",
        "translation": "The smallest of these is twelve yojanas in width, surrounded by seven walls.",
        "source": "T01n0025_006:0396b26_1"
    },
    {
        "source_sentence": "乃至眾鳥，各各自鳴。",
        "translation": "Each of the birds sings its own song.",
        "source": "T01n0025_006:0396b28_2"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0396b29_0"
    },
    {
        "source_sentence": "其善法堂諸天聚會處東面，為三十三天王有園苑住，名波婁沙，縱廣千踰闍那，",
        "translation": "To the east of the hall of the Hall of Good Dharma and the place where the gods assembled, there was a park called Parusāra, one thousand yojanas long and wide, built for the king of the thirty-three deities.",
        "source": "T01n0025_006:0396b29_1"
    },
    {
        "source_sentence": "略說乃至七重垣牆，為馬瑙等七寶所成。",
        "translation": "It's briefly explained that the sevenfold wall is made of agate and other seven treasures.",
        "source": "T01n0025_006:0396c02_2"
    },
    {
        "source_sentence": "普四方面各有諸門，彼等諸門有諸樓櫓，雜色可觀，乃至馬瑙七寶所成。",
        "translation": "Each of the four directions has its own gates, and those gates have towers of various colors that can be seen, even up to the point where they're made of the seven treasures of agate.",
        "source": "T01n0025_006:0396c03_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0396c04_4"
    },
    {
        "source_sentence": "其波婁沙園苑之中，有二大石，一名賢、二名善賢。",
        "translation": "In the middle of the park in Parusāra there were two large rocks, one called Xian and the other Shanxian.",
        "source": "T01n0025_006:0396c04_5"
    },
    {
        "source_sentence": "為天馬瑙之所成就，各皆縱廣五十踰闍那，柔軟細滑，觸之猶如迦旃隣提衣。",
        "translation": "They are all made of heavenly horse agate, each measuring fifty yojanas in length and breadth, as soft and slippery as if touching a kaṭinīntika robe.",
        "source": "T01n0025_006:0396c06_6"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0396c08_0"
    },
    {
        "source_sentence": "其善法堂諸天聚集處所南面，為三十三天王有一園苑，名雜色車，其園縱廣千踰闍那，",
        "translation": "To the south of the place where the gods assembled at the hall of the fine dharma, there was a park called the chariot of miscellaneous colors for the king of the thirty-three heavenly kings, one thousand yojanas long and wide.",
        "source": "T01n0025_006:0396c08_1"
    },
    {
        "source_sentence": "七重垣牆乃至馬瑙之所成就。",
        "translation": "It's made of seven-story walls or even agate.",
        "source": "T01n0025_006:0396c10_2"
    },
    {
        "source_sentence": "普四方面各有諸門，彼等諸門皆有樓櫓，雜色可觀，乃至馬瑙之所成就。",
        "translation": "Each of the four directions has gates, and each of those gates has a tower, which can be seen in various colors up to the point where it's accomplished by the agate.",
        "source": "T01n0025_006:0396c11_0"
    },
    {
        "source_sentence": "其彼園中亦有二石，一名雜色、二名善雜色。",
        "translation": "In that park, there are also two rocks, one of which is mixed color and the other well-mixed color.",
        "source": "T01n0025_006:0396c12_1"
    },
    {
        "source_sentence": "純以天青琉璃所成，亦各縱廣五十踰闍那，柔軟細滑，觸之猶如迦旃隣提衣。",
        "translation": "Purely made of heavenly blue lapis lazuli, each as long and wide as fifty yojanas in length is as soft and supple as a kaṭhina robe when touched.",
        "source": "T01n0025_006:0396c13_2"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0396c16_0"
    },
    {
        "source_sentence": "其善法堂諸天聚集處所西面，為三十三天王亦有園苑，名為雜穢，其園縱廣千踰闍那，",
        "translation": "To the west of the place where the gods assembled in this hall of the fine dharma were there was a park called Sadāparvata, one thousand yojanas long and wide, which belonged to the thirty-three kings.",
        "source": "T01n0025_006:0396c16_1"
    },
    {
        "source_sentence": "七重垣牆，乃至七寶之所成就。",
        "translation": "Seven walls of seven stories are built, all made of the seven kinds of treasure.",
        "source": "T01n0025_006:0396c18_2"
    },
    {
        "source_sentence": "四方有門，皆有樓櫓却敵臺閣，俱七寶成。",
        "translation": "In each of the four directions there were gates with towers and enemy terraces, all made of the seven kinds of treasure.",
        "source": "T01n0025_006:0396c18_3"
    },
    {
        "source_sentence": "彼雜穢園，亦有二石，一名善現、二名小善現。",
        "translation": "In that defiled park there are also two rocks, one called Shancheng and the other Lesser Shancheng.",
        "source": "T01n0025_006:0396c19_4"
    },
    {
        "source_sentence": "以天頗致迦所成，亦各縱廣五十踰闍那，柔軟細滑，觸之猶如迦旃隣提衣。",
        "translation": "It's made of heavenly pāṭika, and each is fifty yojanas long and wide, as soft and fine as a kaṭinīntika robe when touched.",
        "source": "T01n0025_006:0396c21_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0396c23_0"
    },
    {
        "source_sentence": "其善法堂諸天聚集處所北面，為三十三天王有園苑住，名曰歡喜，其園縱廣千踰闍那，",
        "translation": "To the north of the place where the gods assembled at the hall of the fine dharma, there was a park named Rejoicing, one thousand yojanas long and wide, in which lived the thirty-three heavenly kings.",
        "source": "T01n0025_006:0396c23_1"
    },
    {
        "source_sentence": "七重垣牆乃至馬瑙七寶所成。",
        "translation": "It's made of seven-story walls and even agate, made of seven treasures.",
        "source": "T01n0025_006:0396c25_2"
    },
    {
        "source_sentence": "四方有門，各有樓櫓却敵臺閣，亦為七寶之所莊嚴。",
        "translation": "In each of the four directions there were gates and towers, as well as enemies’ terraces and pavilions adorned with the seven kinds of treasure.",
        "source": "T01n0025_006:0396c26_0"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0396c27_1"
    },
    {
        "source_sentence": "歡喜園中，亦有二石，一名歡喜、二名善歡喜。",
        "translation": "In the park of joy, there are also two rocks, one called joyful and two called well-joyed.",
        "source": "T01n0025_006:0396c27_2"
    },
    {
        "source_sentence": "以天銀成，亦各縱廣五十踰闍那，柔軟潤澤，觸之猶如迦旃隣提衣。",
        "translation": "It's made of heavenly silver, and each is fifty yojanas long and wide, as soft and moistened as a kaṭinīnandi robe when touched.",
        "source": "T01n0025_006:0396c28_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0397a02_0"
    },
    {
        "source_sentence": "其波婁沙園及雜色車，二園中間，為三十三天王有一池水，名為歡喜，",
        "translation": "Between the Paruva Grove and the chariot of various colors, there was a pool of water called “joy” between the two parks for the thirty-three-fold heavenly king.",
        "source": "T01n0025_006:0397a02_1"
    },
    {
        "source_sentence": "縱廣五百踰闍那。",
        "translation": "It's 500 yojanas long and wide.",
        "source": "T01n0025_006:0397a03_2"
    },
    {
        "source_sentence": "其水涼冷，輕軟甘甜，清潔不濁。",
        "translation": "The water is cool and refreshing, light and soft, sweet and sweet, clean and undisturbed.",
        "source": "T01n0025_006:0397a04_3"
    },
    {
        "source_sentence": "以七寶塼，四面而壘。",
        "translation": "It is built of seven kinds of precious materials, which are cast on all four sides.",
        "source": "T01n0025_006:0397a05_0"
    },
    {
        "source_sentence": "七重寶版，而間錯之。",
        "translation": "The seven-jeweled wooden boards were interspersed with rows of jewel pieces.",
        "source": "T01n0025_006:0397a05_1"
    },
    {
        "source_sentence": "七重欄楯，乃至七重多羅行樹，周匝圍遶，雜色可觀。",
        "translation": "It is surrounded by sevenfold railings and even seven lines of palm trees with variegated colors that can be seen.",
        "source": "T01n0025_006:0397a06_0"
    },
    {
        "source_sentence": "又其四方，各有階道，並為七寶之所莊嚴。",
        "translation": "In each of the four directions there were stairways, all adorned with the seven kinds of treasure.",
        "source": "T01n0025_006:0397a07_1"
    },
    {
        "source_sentence": "中有諸華，優鉢羅華、鉢陀摩、究牟陀、奔茶梨迦花等。",
        "translation": "Within it are flowers such as the utpala flower, padma flower, kumuda flower, and puṇḍarīka flower.",
        "source": "T01n0025_006:0397a08_2"
    },
    {
        "source_sentence": "其華火色火形火光，乃至水色水形水光，縱廣大小，皆如車輪。",
        "translation": "The flowers are the color of fire, the shape of fire is the light of fire, up to the shape of water is the form of water, and the shape of water is the light of water. Even if they are large and small, they all look like a chariot wheel.",
        "source": "T01n0025_006:0397a09_3"
    },
    {
        "source_sentence": "其光明照一踰闍那，風吹香氣，熏一踰闍那。",
        "translation": "That light shone for one yojana, and the wind blew a fragrance that perfumed it for one yojana.",
        "source": "T01n0025_006:0397a11_0"
    },
    {
        "source_sentence": "有諸藕根，大如車軸，割之汁流，色白如乳，其味甘甜，如無蠟蜜。",
        "translation": "There are roots of lotus roots as large as a carriage shaft, which are cut and flow with juice. Their color is white like milk but their taste is sweet and sweet like uncooked honey.",
        "source": "T01n0025_006:0397a12_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0397a14_0"
    },
    {
        "source_sentence": "其雜穢園及歡喜園，二園中間，為三十三天王有一大樹，名波利夜多羅俱毘陀羅，",
        "translation": "Between the polluted grove and the joy grove, there was a large tree named Pārijātaka-kauṇḍinya for the king of the thirty-three gods.",
        "source": "T01n0025_006:0397a14_1"
    },
    {
        "source_sentence": "其根周匝七踰闍那，略說乃至，枝葉遍覆，及院縱廣五百踰闍那，七重垣牆，",
        "translation": "Its roots are seven yojanas in circumference, up to a few yojanas in length and width, covered with branches and leaves; the courtyard is five hundred yojanas long and wide, enclosed by seven walls.",
        "source": "T01n0025_006:0397a16_2"
    },
    {
        "source_sentence": "乃至眾鳥，各各自鳴。",
        "translation": "Each of the birds sings its own song.",
        "source": "T01n0025_006:0397a17_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0397a18_4"
    },
    {
        "source_sentence": "其波利夜多羅俱毘陀羅大樹之下，有一大石，其石名曰槃茶甘婆羅，以天金成，",
        "translation": "Beneath the great pārijātaka-kauṇḍinya tree was a large rock called Fantā甘婆羅, which was made of heavenly gold.",
        "source": "T01n0025_006:0397a18_5"
    },
    {
        "source_sentence": "縱廣五十踰闍那，柔軟潤澤，如觸迦旃隣提衣。",
        "translation": "It measures fifty yojanas in length and breadth and is as soft and moistened as touching a kaṭhina's robe.",
        "source": "T01n0025_006:0397a20_6"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_006:0397a22_0"
    },
    {
        "source_sentence": "於彼中間，何因何緣，其善法堂諸天集會，稱為善法？",
        "translation": "Among them, for what reason and why did the gods of that hall of good dharma assembly? They are called the good dharma.",
        "source": "T01n0025_006:0397a22_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0397a23_2"
    },
    {
        "source_sentence": "其善法堂諸天會處，三十三天王聚集坐已，於中唯論微妙細密諸深義，",
        "translation": "The thirty-three great kings of the gods gathered in the assembly hall and sat there. Here they discussed only subtle, subtle, esoteric, and profound doctrines.",
        "source": "T01n0025_006:0397a23_3"
    },
    {
        "source_sentence": "審諦思惟，稱量觀察，多是世間諸要法事，真實正理，是以天稱為善法堂集會之處。",
        "translation": "They carefully contemplate, weigh, measure, and observe that many of the world's essentials and dharmas are true and correct principles, which is why the gods call it the hall of good dharma assembly.",
        "source": "T01n0025_006:0397a25_4"
    },
    {
        "source_sentence": "又何因緣，名波婁沙迦苑(波婁沙迦隋言麁澁)？",
        "translation": "For what reason is it called the Paruṣaka Garden (known as Paruṣaka in Chinese)?",
        "source": "T01n0025_006:0397a27_5"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0397a28_6"
    },
    {
        "source_sentence": "麤澁園中，三十三天王入已，坐賢善賢二石上已，唯論世間麤惡不善語言戲謔，",
        "translation": "In the pleasure grove, the king of the thirty-three gods entered. Having entered it, they sat on two rocks belonging to Bhadra and Samantabhadra and discussed only worldly matters such as sexual misconduct, unwholesome speech, amusement, and prattle.",
        "source": "T01n0025_006:0397a28_7"
    },
    {
        "source_sentence": "是故稱為波婁沙迦。",
        "translation": "That's why it's called puruṣaka.",
        "source": "T01n0025_006:0397b01_8"
    },
    {
        "source_sentence": "又何因緣，名雜色車苑？",
        "translation": "For what reason is the chariot park of miscellaneous colors called “chariot park”?",
        "source": "T01n0025_006:0397b02_9"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0397b02_10"
    },
    {
        "source_sentence": "雜色車園中，三十三天王入已，坐於雜色及善雜色二石之上，論說世間種種雜類色相語言，",
        "translation": "In the chariot park of variegated colors, having entered it, the king of the thirty-three gods sat on two stones of variegated colors and good variegated colors, discussing various worldly forms, characteristics, and speech.",
        "source": "T01n0025_006:0397b02_11"
    },
    {
        "source_sentence": "是故稱為雜色車苑。",
        "translation": "That's why it's called the chariot park of mixed colors.",
        "source": "T01n0025_006:0397b05_12"
    },
    {
        "source_sentence": "又何因緣，名雜亂苑？",
        "translation": "For what reason is it called the A Forest of Confusion?",
        "source": "T01n0025_006:0397b05_13"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_006:0397b06_0"
    },
    {
        "source_sentence": "雜亂園中，三十三天王，常以月八日十四日十五日，放其宮內一切婇女，",
        "translation": "On the eighth, fourteenth, and fifteenth days of each month the king of the thirty-three gods frequently released all the court ladies in their palaces on the eighth, ninth, fourteenth, and fifteenth days.",
        "source": "T01n0025_006:0397b06_1"
    },
    {
        "source_sentence": "向彼園中，令共三十三天眾輩合，雜嬉雜戲不生障隔，恣其歡娛，受天五欲，",
        "translation": "In that park he caused the thirty-three gods to gather together, playing and frolicking in unison without creating any obstacles. They indulged in delightful amusements and enjoyed the pleasures of the five heavenly pleasures.",
        "source": "T01n0025_006:0397b07_2"
    },
    {
        "source_sentence": "具足功德，遊行受樂。",
        "translation": "They are endowed with virtue and enjoy the pleasures of travel.",
        "source": "T01n0025_006:0397b09_3"
    },
    {
        "source_sentence": "是故彼處諸天眾等，共稱彼園為雜亂苑。",
        "translation": "That's why the gods and others there called that park a mixed-up park.",
        "source": "T01n0025_006:0397b10_4"
    },
    {
        "source_sentence": "起世因本經卷第六",
        "translation": "Qishi jingben ben jing, vol. 6",
        "source": "T01n0025_006:0397b12_0"
    }
]