[
    {
        "source_sentence": "起世因本經卷第二",
        "translation": "Qishi jingben ben jing, vol. 2",
        "source": "T01n0025_002:0371b12_0"
    },
    {
        "source_sentence": "隋天竺沙門達摩笈多譯",
        "translation": "Translated by the Sui translator Dharmagupta, a renunciant of India",
        "source": "T01n0025_002:0371b14_0"
    },
    {
        "source_sentence": "欝多囉究留品下",
        "translation": "Second Chapter of the Bhadrakūṭa-sūtra",
        "source": "T01n0025_002:0371b15_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0371b16_0"
    },
    {
        "source_sentence": "其欝多囉究留人輩，頭髮青色，垂長八指，其人一色一形一像，無有別色可知其異。",
        "translation": "The people of Uttarakuru had blue hair and their hair was eight fingers long. They were one color, one shape, and one form; there were no different colors to tell the differences.",
        "source": "T01n0025_002:0371b16_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0371b18_2"
    },
    {
        "source_sentence": "欝多囉究留人輩，不全露形，不半露形，無有適莫，齒皆平密，不踈不缺，",
        "translation": "The people of Uttarakuru don’t reveal their full forms, nor do they reveal half a part of their forms; there is no place for them to be. Their teeth are even and dense, neither crooked nor missing.",
        "source": "T01n0025_002:0371b18_3"
    },
    {
        "source_sentence": "善好潔白，猶如珂貝，明淨可憙。",
        "translation": "Good, good, clean, and white like a seashell, it's clear and debilitating.",
        "source": "T01n0025_002:0371b20_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0371b20_5"
    },
    {
        "source_sentence": "欝多囉究留人輩，若有飢渴須食飲時，彼等即取，不曾耕種自然粳米，",
        "translation": "When the people of Uttarakuru are hungry and thirsty and need food or drink, they immediately take it. They never plow or sow rice that is naturally milled.",
        "source": "T01n0025_002:0371b21_6"
    },
    {
        "source_sentence": "清淨潔白無有糠糩。",
        "translation": "It's pure, clean, white, and without any chaff.",
        "source": "T01n0025_002:0371b22_7"
    },
    {
        "source_sentence": "取已擲置敦持果中，置已即將火珠置底。",
        "translation": "After he takes it, he tosses it into the fruit of Dunhuo and puts it in the bottom of the fire bead.",
        "source": "T01n0025_002:0371b23_8"
    },
    {
        "source_sentence": "而彼火珠，眾生福力，自然出焰，飯食熟已，焰還即滅。",
        "translation": "That fire pearl, the power of sentient beings' virtue, naturally produces a flame, and when the rice and food are cooked, the flame returns and goes out.",
        "source": "T01n0025_002:0371b24_9"
    },
    {
        "source_sentence": "彼等人輩，欲食飯者，即坐座上。",
        "translation": "Those of those in the assembly who wanted to eat the rice were seated on their seats.",
        "source": "T01n0025_002:0371b25_10"
    },
    {
        "source_sentence": "於彼時中，東西南北來欲食者，為彼人等設於飯食，飯終不盡，乃至彼等施飯食人坐而不起，",
        "translation": "At the time, those who came from east, west, south, and north to eat would set up food for them. The food wouldn't run out until they gave it to the person who ate it, sat down and didn't rise.",
        "source": "T01n0025_002:0371b26_11"
    },
    {
        "source_sentence": "彼之飯食則常盈滿。",
        "translation": "The food they eat always fills them up.",
        "source": "T01n0025_002:0371b28_12"
    },
    {
        "source_sentence": "彼等食彼自然粳米成熟之飯，無有糠糩，清淨香美不假羹臛，眾味具足白如花聚，",
        "translation": "They ate the rice cooked from natural millet, which had no husks or edges. It was pure, fragrant, and delicious; they did not rely on any kind of broth. All its flavors were as white as clusters of",
        "source": "T01n0025_002:0371b29_0"
    },
    {
        "source_sentence": "其色猶如天酥陀味。",
        "translation": "Its color is like the taste of heavenly butter.",
        "source": "T01n0025_002:0371c01_1"
    },
    {
        "source_sentence": "彼等人輩，食是食時，身分充盈，無有缺減，無老無變，湛然不動，乃至彼食，",
        "translation": "When they eat this food, their bodies are full and without any deficiency. They neither age nor change, remaining calm and motionless as long as they eat it.",
        "source": "T01n0025_002:0371c02_2"
    },
    {
        "source_sentence": "資益彼等，色力安樂，辯才具足。",
        "translation": "They are endowed with physical form, power, and well-being, and they are endowed with eloquence.",
        "source": "T01n0025_002:0371c04_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0371c05_0"
    },
    {
        "source_sentence": "其欝多囉究留人輩，若有欲於諸婦女邊，生染著心，意相向者，彼即觀看彼之婦女，",
        "translation": "Those in the caste of Uttarakuru, if they have desires and give rise to defiled minds at the women’s sides or direct their thoughts toward them, then they will look at those women.",
        "source": "T01n0025_002:0371c05_1"
    },
    {
        "source_sentence": "而彼婦女，即便隨逐彼人而行，至於樹下。",
        "translation": "The woman then followed that man and went to the foot of the tree.",
        "source": "T01n0025_002:0371c07_2"
    },
    {
        "source_sentence": "若彼婦女，是彼人母，或復是姨、是姉妹等，為彼等故，彼之樹林枝不垂下，",
        "translation": "If that woman is their mother, or if she's an aunt, sister, or so forth. For their sake, the branches of those trees won't fall down.",
        "source": "T01n0025_002:0371c08_3"
    },
    {
        "source_sentence": "其葉即時萎黃枯落，各不相覆，亦不出華，亦無床敷；",
        "translation": "The leaves immediately withered and withered, each without covering the other, neither producing flowers nor laying out beds.",
        "source": "T01n0025_002:0371c09_4"
    },
    {
        "source_sentence": "若非是母，亦非是姨，非是姉妹，彼諸樹木即便垂覆，枝葉欝茂，樹枝各各共相蔭映，",
        "translation": "If they weren't their mothers, or aunts, or sisters, those trees and trees would even hang down to cover them, with branches and leaves growing luxuriantly, each of which would give shade to the other.",
        "source": "T01n0025_002:0371c11_5"
    },
    {
        "source_sentence": "眾華鮮榮，亦為彼人，出百千種床敷臥具，彼等相將入於彼處，歡娛受樂，",
        "translation": "Hundreds of thousands of kinds of beds and bedding were offered to those who lived there. They all entered the place, amusement and pleasure.",
        "source": "T01n0025_002:0371c13_6"
    },
    {
        "source_sentence": "隨意所作。",
        "translation": "It's done as you wish.",
        "source": "T01n0025_002:0371c14_7"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0371c16_0"
    },
    {
        "source_sentence": "其欝多囉究留人輩，住胎七日，至第八日，而彼婦人即便產生。",
        "translation": "The people of Uttarakuru stayed in the womb for seven days, and on the eighth day the woman gave birth.",
        "source": "T01n0025_002:0371c16_1"
    },
    {
        "source_sentence": "其產既訖，若男若女，即將彼子安置坐於四衢道中，捨之而去。",
        "translation": "When the baby is born, whether it's a boy or a woman, he puts his child down on the four side streets and leaves him.",
        "source": "T01n0025_002:0371c17_2"
    },
    {
        "source_sentence": "時，彼所有東西南北人輩來者，彼等諸人，為欲養育彼男女故，各將手指，",
        "translation": "At the time, all those people from east, west, south, and north came. Because they wanted to nourish their sons and daughters, they each pointed at them with their fingers.",
        "source": "T01n0025_002:0371c19_3"
    },
    {
        "source_sentence": "內於彼等男女口中，彼等指頭，出好甘乳，與彼男女，飲已得活。",
        "translation": "Within the mouths of those men and women, sweet milk comes out from their fingers and gives it to them as a drink. After drinking it, they'll be able to live.",
        "source": "T01n0025_002:0371c20_4"
    },
    {
        "source_sentence": "如是七日，彼等男女，還成就彼一種身量，如彼人輩等無殊異。",
        "translation": "For seven days like this, those men and women will again attain the same measurement of their bodies for that one type of body, just as they did for all other people without any difference.",
        "source": "T01n0025_002:0371c22_5"
    },
    {
        "source_sentence": "若是男子，即隨男伴，相逐而行。",
        "translation": "If it's a man, he follows his male companions and walks along with them.",
        "source": "T01n0025_002:0371c23_6"
    },
    {
        "source_sentence": "若是女人，即隨婦女，徒伴而去。",
        "translation": "If it's a woman, she follows the women and leaves them alone.",
        "source": "T01n0025_002:0371c24_7"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0371c26_0"
    },
    {
        "source_sentence": "其欝多囉究留人輩，壽命一定，無有中夭，若命終時，即便上生。",
        "translation": "The people of Uttarakuru have a fixed life span, but there is no intermediate death. When their life ends, they are reborn in the higher realms.",
        "source": "T01n0025_002:0371c26_1"
    },
    {
        "source_sentence": "復次於中，何因緣故，其欝多囉究留人輩，得定壽命，命終已後，皆向上者？",
        "translation": "Furthermore, what are the causes and conditions that caused the people of Uttarakuru to attain a fixed life span and all go upward after their lives die?",
        "source": "T01n0025_002:0371c27_2"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0371c29_3"
    },
    {
        "source_sentence": "世有一人，專作殺生、盜他財物、邪婬、妄語、兩舌、惡口，及綺語等，",
        "translation": "One person in the world exclusively commits killing, stealing others’ property, sexual misconduct, false speech, divisive speech, harsh speech, and fancy speech.",
        "source": "T01n0025_002:0371c29_4"
    },
    {
        "source_sentence": "貪瞋邪見；",
        "translation": "They are greed, hatred, and false views.",
        "source": "T01n0025_002:0372a02_5"
    },
    {
        "source_sentence": "以是因緣，身壞命終，當墮惡道在地獄中。",
        "translation": "Because of these causes and conditions, they'll fall into a bad destiny in hell when their body breaks up and their life ends.",
        "source": "T01n0025_002:0372a02_6"
    },
    {
        "source_sentence": "復有一人，不曾殺生、不盜他物、不行邪婬，又不妄語、不兩舌、不綺語、不惡口，",
        "translation": "“Furthermore, suppose there’s another person who has never killed a living being, doesn’t steal others’ property, doesn’t engage in sexual misconduct, doesn’t lie, doesn’t speak divisively, doesn’t flatter",
        "source": "T01n0025_002:0372a03_7"
    },
    {
        "source_sentence": "不貪不瞋，又不邪見；",
        "translation": "They are neither greedy nor angry, and they do not hold wrong views.",
        "source": "T01n0025_002:0372a05_8"
    },
    {
        "source_sentence": "以是因緣，身壞命終，趣向善道，生人天中。",
        "translation": "Because of these causes and conditions, when his body breaks up and his life ends, he's destined for a good path and born among humans and gods.",
        "source": "T01n0025_002:0372a05_9"
    },
    {
        "source_sentence": "復何因緣，向下生者？",
        "translation": "What are the causes and conditions that lead downward to rebirth?",
        "source": "T01n0025_002:0372a06_10"
    },
    {
        "source_sentence": "以其殺生及邪見等。",
        "translation": "It's because they kill sentient beings and hold wrong views.",
        "source": "T01n0025_002:0372a07_11"
    },
    {
        "source_sentence": "向上生者，以不殺生及正見等。",
        "translation": "Upward birth means not taking life, right view and so forth.",
        "source": "T01n0025_002:0372a07_12"
    },
    {
        "source_sentence": "復有一人，作如是念：『我於今者，應行十善。』",
        "translation": "Again, there's another person who thinks, 'Now, I should perform the ten good deeds.'",
        "source": "T01n0025_002:0372a08_13"
    },
    {
        "source_sentence": "是因緣故，身壞當生欝多囉究留人中。",
        "translation": "Because of these causes and conditions, his body breaks up and he'll be born in Uttarakuru and stay among humans.",
        "source": "T01n0025_002:0372a09_14"
    },
    {
        "source_sentence": "彼中生已，住一千年，不增不減。",
        "translation": "After being born there, they abide for 1,000 years, neither increasing nor decreasing.",
        "source": "T01n0025_002:0372a10_15"
    },
    {
        "source_sentence": "彼作如是諸善願已，行十善業，身壞當生欝多囉究留中，彼於彼處，其壽命住滿一千年，",
        "translation": "Having made these kinds of good vows, they will perform the ten kinds of good deeds and be reborn in Uttarakuru when their bodies disintegrate. Their life span there will be one thousand years.",
        "source": "T01n0025_002:0372a11_16"
    },
    {
        "source_sentence": "不增減也。",
        "translation": "It doesn't increase or decrease.",
        "source": "T01n0025_002:0372a13_17"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372a13_18"
    },
    {
        "source_sentence": "此因緣故，其欝多囉究留人，得定壽命。",
        "translation": "Because of these causes and conditions, the people in Uttarakuru will attain a fixed life span.",
        "source": "T01n0025_002:0372a13_19"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0372a15_0"
    },
    {
        "source_sentence": "何因緣，向於上生？",
        "translation": "What are the causes and conditions that lead to rebirth upward?",
        "source": "T01n0025_002:0372a15_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372a15_2"
    },
    {
        "source_sentence": "閻浮洲人，於他邊受十善業已，身壞當生欝多囉究留人中。",
        "translation": "The people of Jambudvīpa will be reborn among the Uttarakuru people when their bodies disintegrate after they've received the ten good actions in other directions.",
        "source": "T01n0025_002:0372a15_3"
    },
    {
        "source_sentence": "其欝多囉究留人輩，若其舊有具足十善業，如法行已，身壞皆當向上善處諸天中生。",
        "translation": "The people of Uttarakuru, if they had the ten good actions in the past, and had done so according to the teaching, would all be born among the gods in the heavens upward into a good place when their bodies disintegrate.",
        "source": "T01n0025_002:0372a17_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372a19_5"
    },
    {
        "source_sentence": "此因此緣，其欝多囉究留人輩，向上勝處。",
        "translation": "Because of this condition, the people of Uttarakuru stayed upward in a superior place.",
        "source": "T01n0025_002:0372a19_6"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372a20_7"
    },
    {
        "source_sentence": "其欝多囉究留人輩，若其壽命終盡之時，彼無有人憂愁啼哭，唯莊嚴已，",
        "translation": "At the end of their life, no one grieves or wails in sorrow but only those who adorn themselves.",
        "source": "T01n0025_002:0372a20_8"
    },
    {
        "source_sentence": "棄置四大衢道之中，捨已而去。",
        "translation": "He abandoned it in the middle of the four major thoroughfares and departed after abandoning it.",
        "source": "T01n0025_002:0372a22_9"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0372a23_0"
    },
    {
        "source_sentence": "其欝多囉究留人輩，有如是法。",
        "translation": "The people of Uttarakuru have this kind of teaching.",
        "source": "T01n0025_002:0372a23_1"
    },
    {
        "source_sentence": "若彼眾生，壽命盡已，應時即有一鳥飛來，其鳥名曰優禪伽摩(隋言高行)。",
        "translation": "If those sentient beings die, then there's a bird that comes flying in response, which is called Udyānagāma (Sui: high-flying).",
        "source": "T01n0025_002:0372a23_2"
    },
    {
        "source_sentence": "爾時，彼鳥優禪伽摩，從大山谷迅疾飛來，即銜其髮，將彼死屍擲置餘洲。",
        "translation": "At the time, that bird Udyāna came swiftly from a great valley and tossed its dead body off to another continent.",
        "source": "T01n0025_002:0372a25_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0025_002:0372a27_4"
    },
    {
        "source_sentence": "以欝多囉究留人輩業清淨故，欲意憙故，不令風吹彼臭穢氣。",
        "translation": "It's because the actions of the people in Uttarakuru are pure, and because their desires and intentions are strong, they won't allow the wind to blow that foul smell.",
        "source": "T01n0025_002:0372a27_5"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372a28_6"
    },
    {
        "source_sentence": "其欝多囉究留人輩，若欲大小便利之時，為彼人故，彼地開裂，出已還合。",
        "translation": "The people of Uttarakuru, if they want to use their large and small relics, the ground opens and splits up for that person's sake, and after emerging, it closes back together.",
        "source": "T01n0025_002:0372a29_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0025_002:0372b01_1"
    },
    {
        "source_sentence": "其欝多囉究留人輩，欲清淨故，欲意憙故。",
        "translation": "The people of Uttarakuru are pure in their desires and have a weak mind because they want to purify it.",
        "source": "T01n0025_002:0372b01_2"
    },
    {
        "source_sentence": "復次，於中有何因緣，說彼名曰欝多囉究留洲？",
        "translation": "Furthermore, what are the causes and conditions that make it known as Uttarakuru?",
        "source": "T01n0025_002:0372b02_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372b03_4"
    },
    {
        "source_sentence": "其欝多囉究留洲，於四天下，比餘三洲，最上最妙最勝，彼故說欝多囉究留洲，",
        "translation": "Uttarakuru is the highest of the four continents and the most subtle and superior among the other three continents. That is why it is called Uttarakuru.",
        "source": "T01n0025_002:0372b04_5"
    },
    {
        "source_sentence": "為欝多囉究留洲也(欝多囉究留隋言上作)。",
        "translation": "It's the continent of Uttarakuru (known as Uttarakuru in the Sui language).",
        "source": "T01n0025_002:0372b06_0"
    },
    {
        "source_sentence": "起世經轉輪王品第三",
        "translation": "The Third Chapter of the Wheel-Turning King Chapter of the Awakening Sutra",
        "source": "T01n0025_002:0372b07_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0372b08_0"
    },
    {
        "source_sentence": "閻浮洲內，若轉輪王出現世時，此閻浮提，自然而有七寶具足，其轉輪王，",
        "translation": "In Jambudvfpa, when wheel-turning kings appear in the world, this Jambudvipa is naturally endowed with the seven treasures.",
        "source": "T01n0025_002:0372b08_1"
    },
    {
        "source_sentence": "復有四種神通德力。",
        "translation": "Again, there are four kinds of miraculous virtues and powers.",
        "source": "T01n0025_002:0372b09_2"
    },
    {
        "source_sentence": "云何七寶？",
        "translation": "What are the seven treasures?",
        "source": "T01n0025_002:0372b10_3"
    },
    {
        "source_sentence": "一金輪寶、二白象寶、三紺馬寶、四神珠寶、五玉女寶、六藏主寶、七兵將寶，",
        "translation": "The first is the treasure of the golden wheel; the second is the treasure of the white elephant; the third is the treasure of the dark blue horse; the fourth is the treasure of the divine gem; the fifth is the treasure of the jadelike",
        "source": "T01n0025_002:0372b10_4"
    },
    {
        "source_sentence": "是為七寶。",
        "translation": "These are the seven treasures.",
        "source": "T01n0025_002:0372b12_5"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372b12_6"
    },
    {
        "source_sentence": "云何轉輪聖王輪寶具足？",
        "translation": "How are the wheel-turning sage king's wheel treasures replete?",
        "source": "T01n0025_002:0372b12_7"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372b13_8"
    },
    {
        "source_sentence": "其轉輪王，出閻浮提，以水灌頂，為察帝利。",
        "translation": "The wheel-turning king came out of Jambudvfpa and poured water over the top of his head to make sure he was cakravartin.",
        "source": "T01n0025_002:0372b13_9"
    },
    {
        "source_sentence": "於彼逋沙他(隋言齋日)十五日月圓滿時，洗沐頭髮，著不擣白疊，垂髮下向，",
        "translation": "On the fifteenth day of the month, when the moon is full, he washes his hair and puts it on a white cloth that doesn't stand on dry, hanging downward.",
        "source": "T01n0025_002:0372b14_10"
    },
    {
        "source_sentence": "飾以摩尼及諸瓔珞，在樓閣上，親屬諸臣，前後圍遶。",
        "translation": "He was adorned with jewels and jewelry, surrounded by his relatives and ministers in front and behind him.",
        "source": "T01n0025_002:0372b16_11"
    },
    {
        "source_sentence": "是時，王前自然而有天金輪寶，千輻轂輞，諸相滿足，自然來應，非工匠成，",
        "translation": "At that time, there was a divine golden wheel of jewels in front of the king’s presence. With its thousand-spoked hub and spokes, these treasures were naturally endowed with all their characteristics; they had not been made by",
        "source": "T01n0025_002:0372b17_12"
    },
    {
        "source_sentence": "輪徑七肘。",
        "translation": "The wheel's diameter is seven feet.",
        "source": "T01n0025_002:0372b19_13"
    },
    {
        "source_sentence": "爾時，灌頂察帝利轉輪王，作如是念：『我昔曾聞如是言說：「若有灌頂察帝利王，",
        "translation": "At that time, the wheel-turning king Consecration Cakravartin had this thought: In the past I have heard such words as these:",
        "source": "T01n0025_002:0372b19_14"
    },
    {
        "source_sentence": "於彼逋沙他十五日滿月正圓時，洗沐頭已，身著不擣白疊之衣，服諸瓔珞，",
        "translation": "On the fifteenth day of that month, on the moon Vaiśravaṇa, at the full moon, after washing his hair and head, he puts on white cotton clothes not made of rags and wears various jewelry.",
        "source": "T01n0025_002:0372b21_15"
    },
    {
        "source_sentence": "在樓閣上，親屬諸臣，前後圍遶。",
        "translation": "On the top of the tower, he was surrounded by his relatives and ministers in front and behind him.",
        "source": "T01n0025_002:0372b23_16"
    },
    {
        "source_sentence": "是時，王前自然而有天金輪寶，千輻轂輞，諸相滿足，自然來應，非工匠成，",
        "translation": "At that time, there was a divine golden wheel of jewels in front of the king’s presence. With its thousand-spoked hub and spokes, these treasures were naturally endowed with all their characteristics; they had not been made by",
        "source": "T01n0025_002:0372b23_17"
    },
    {
        "source_sentence": "皆是金色，輪徑七肘。",
        "translation": "They are all of golden color, seven feet in circumference.",
        "source": "T01n0025_002:0372b25_18"
    },
    {
        "source_sentence": "有是瑞時，彼則成就轉輪王德。」",
        "translation": "When there's such an auspicious sign, he accomplishes the virtue of a wheel-turning king.",
        "source": "T01n0025_002:0372b26_19"
    },
    {
        "source_sentence": "我今定應是轉輪王。』",
        "translation": "Now, I must surely be the wheel-turning king.'",
        "source": "T01n0025_002:0372b26_20"
    },
    {
        "source_sentence": "「爾時，灌頂察帝利轉輪王，欲得試彼天輪寶故，即令嚴備四種分力身兵，",
        "translation": "“At that time, the wheel-turning king Consecrating Indra, wishing to test the divine wheel treasure, ordered him to prepare four kinds of armor:",
        "source": "T01n0025_002:0372b28_0"
    },
    {
        "source_sentence": "所謂象身、馬身、車身、步身。",
        "translation": "They are called the body of an elephant, the body of a horse, the body of a chariot, and the body of a footstool.",
        "source": "T01n0025_002:0372b29_1"
    },
    {
        "source_sentence": "四種分力身嚴備已，即時詣向天金輪邊，到已偏露右臂，在於金輪前，",
        "translation": "Having adorned himself with the four kinds of power, he immediately went to the side of the golden wheel facing toward heaven. When he arrived there, he bared his right shoulder and placed it in front of him.",
        "source": "T01n0025_002:0372c01_2"
    },
    {
        "source_sentence": "右膝著地，以右手捫彼天輪寶，作如是言：『謂天輪寶，我今若是轉輪王者，",
        "translation": "He knelt with his right knee on the ground and, touching the divine wheel treasure with his right hand, said to him:",
        "source": "T01n0025_002:0372c02_3"
    },
    {
        "source_sentence": "未降伏地為我降伏。』",
        "translation": "The ground that hasn't yet been subdued is subdued by me.'",
        "source": "T01n0025_002:0372c04_4"
    },
    {
        "source_sentence": "其天輪寶，應時便轉，為欲降伏諸未伏故。",
        "translation": "The divine wheel treasure then turns in response, wanting to subdue those who haven't been subdued.",
        "source": "T01n0025_002:0372c05_5"
    },
    {
        "source_sentence": "諸比丘。",
        "translation": "The monks.",
        "source": "T01n0025_002:0372c06_6"
    },
    {
        "source_sentence": "是時，灌頂察帝利王，既見彼天輪寶轉已，其轉輪王，即便嚴駕向東方行，",
        "translation": "Having seen the divine wheel treasure turn, the wheel-turning king drove eastward in a chariot.",
        "source": "T01n0025_002:0372c06_7"
    },
    {
        "source_sentence": "彼天輪寶，及四種分象馬身兵，一時皆從。",
        "translation": "The divine wheel treasure and the four kinds of elephants, horses, and soldiers were all following him at once.",
        "source": "T01n0025_002:0372c08_0"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0372c09_0"
    },
    {
        "source_sentence": "其輪寶前，復有四大天身而行，其天輪寶所到他方住止之處，其轉輪王及四分力象馬身兵，",
        "translation": "In front of the wheel treasure, there were also four great celestial beings walking on their bodies. Wherever the divine wheel treasure traveled and wherever they lived, those wheel-turning kings, as well as the fourfold army of elephan",
        "source": "T01n0025_002:0372c09_1"
    },
    {
        "source_sentence": "皆於彼中停住止宿。",
        "translation": "They all stopped there and stayed overnight.",
        "source": "T01n0025_002:0372c11_2"
    },
    {
        "source_sentence": "「爾時，東方所有一切諸國王等，各取金器盛滿銀粟，或以銀器盛滿金粟，",
        "translation": "At that time, all the kings of the eastern countries each took a golden vessel filled with silver grains and some silver vessels filled with golden grains.",
        "source": "T01n0025_002:0372c12_0"
    },
    {
        "source_sentence": "如是具已，皆前詣向轉輪王所，到已啟白轉輪王言：『大王善來！",
        "translation": "Having done so, they all went to the wheel-turning king and addressed him, saying, 'Welcome, great king!'",
        "source": "T01n0025_002:0372c13_1"
    },
    {
        "source_sentence": "此是天物，東方人民，豐熟安樂，無怖無畏，多有人民，甚可愛樂。",
        "translation": "The people of the eastern direction are prosperous and peaceful, free from fear and fright. There are many inhabitants who are very delighted.",
        "source": "T01n0025_002:0372c15_2"
    },
    {
        "source_sentence": "唯願大天，垂哀受取，憐愍我等微細諸王。",
        "translation": "All we ask, Great goddess, is that you take pity on us tiny kings and have mercy upon us.",
        "source": "T01n0025_002:0372c16_3"
    },
    {
        "source_sentence": "我等今日，承奉天王，一無有二。』",
        "translation": "Today, we'll inherit the king of gods, and there are no two of us.'",
        "source": "T01n0025_002:0372c17_4"
    },
    {
        "source_sentence": "時，轉輪王告諸王言：『汝等誠心，若能爾者，汝等各各於自境界如法治化，",
        "translation": "The wheel-turning kings then said to the other kings: O gods, you must be sincere in your minds. If you are able to do so, each of you should teach others according to the Dharma within your respective realms.",
        "source": "T01n0025_002:0372c18_5"
    },
    {
        "source_sentence": "莫令國土有不如法。",
        "translation": "Don't let the land have anything that isn't according to the Dharma.",
        "source": "T01n0025_002:0372c20_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0025_002:0372c20_7"
    },
    {
        "source_sentence": "汝等若令我之國內有諸非法惡行顯現，我當治汝。",
        "translation": "If you cause unlawful and bad actions to appear in my country, I will punish you.",
        "source": "T01n0025_002:0372c20_8"
    },
    {
        "source_sentence": "今教汝等，當斷殺生，教人不殺，不與勿取，邪婬妄語，乃至邪見，皆不應為。",
        "translation": "Now, I'll teach you to stop killing sentient beings and teach people not to kill, not to give or take anything, and not to engage in sexual misconduct, false speech, or even wrong views, which shouldn't be done.",
        "source": "T01n0025_002:0372c22_9"
    },
    {
        "source_sentence": "若汝等輩，斷於殺生，教人不殺，不與勿取，不行邪婬，實語正見者，",
        "translation": "If all of you abstain from killing living beings, teach others not to kill, don’t give or take what is not given, don’t engage in sexual misconduct, and speak truthfully and rightly.",
        "source": "T01n0025_002:0372c23_10"
    },
    {
        "source_sentence": "我即當知，汝等諸王，國土降伏。』",
        "translation": "I will then know, you kings, that your lands are subdued.'",
        "source": "T01n0025_002:0372c25_11"
    },
    {
        "source_sentence": "「爾時，東方諸國王等，聞彼轉輪王如是勅已，一時同受十善業行，受已遵承，",
        "translation": "“At the time, all the kings of the eastern countries heard this command from the wheel-turning king, and they all simultaneously undertook the ten wholesome deeds at once. Having undertaken them, they followed it.",
        "source": "T01n0025_002:0372c27_0"
    },
    {
        "source_sentence": "各各國土，如法治化。",
        "translation": "Each country and land is taught according to the rules of the Dharma.",
        "source": "T01n0025_002:0372c28_1"
    },
    {
        "source_sentence": "是轉輪王，自在力故，所向之處，輪寶隨行。",
        "translation": "Because of his unimpeded power, the cakravartin follows the wheel treasure wherever he goes.",
        "source": "T01n0025_002:0372c29_2"
    },
    {
        "source_sentence": "時，彼聖王天金輪寶，如是降伏東方國已，達東海岸，周遍而迴。",
        "translation": "The holy king, the divine wheel-turning jewel of the golden wheel, having subdued the eastern countries in this way, reached the east shore and circled all over.",
        "source": "T01n0025_002:0373a01_3"
    },
    {
        "source_sentence": "次第歷到南方西方乃至北方，依於古昔轉輪王道，引導而行。",
        "translation": "They proceeded in order to the south, west, and up to the north, following the ancient ways of the universal ruler.",
        "source": "T01n0025_002:0373a02_4"
    },
    {
        "source_sentence": "其轉輪王及四兵身，相次行時，而彼在先天輪寶前，復有四大天身而行。",
        "translation": "When the wheel-turning king and the bodies of the four soldiers were walking one after another, they were standing in front of the divine wheel treasure before the first one, and there were also the bodies of the four major gods who were walking.",
        "source": "T01n0025_002:0373a04_5"
    },
    {
        "source_sentence": "時，此輪寶所住之處，於彼方面，其轉輪王及四種兵，即便停宿。",
        "translation": "At the time, where this wheel treasure was staying, the wheel-turning king and his four kinds of troops were staying overnight at that place.",
        "source": "T01n0025_002:0373a05_6"
    },
    {
        "source_sentence": "「爾時，北方所有一切諸國王等，亦各齎持天真金器，盛滿銀粟，天真銀器盛滿金粟，",
        "translation": "At the time, all the kings of the northern kingdoms also carried divine gold vessels filled with silver grains and divine silver vessels filled with golden grains.",
        "source": "T01n0025_002:0373a08_0"
    },
    {
        "source_sentence": "俱來詣向轉輪王所，到已長跪，作如是言：『善哉天來！",
        "translation": "They all came to the wheel-turning king and knelt down long enough to say, 'Good, goddess!'",
        "source": "T01n0025_002:0373a09_1"
    },
    {
        "source_sentence": "善哉天來！",
        "translation": "Good, goddess!",
        "source": "T01n0025_002:0373a11_2"
    },
    {
        "source_sentence": "我等北方，蒙天王故，人民熾盛，豐熟安隱，無諸怖畏，甚可愛樂。",
        "translation": "In the northern direction we are endowed with heavenly kingship. The people are prosperous and their livelihood is peaceful. They have no fears and are very delighted.",
        "source": "T01n0025_002:0373a11_3"
    },
    {
        "source_sentence": "天留治化，我等隨順。』",
        "translation": "The gods will stay to govern and transform, and we'll follow them.'",
        "source": "T01n0025_002:0373a12_4"
    },
    {
        "source_sentence": "其轉輪王，即便勅言：『若能然者，汝等各各治化自境，一依教令，勿不如法。",
        "translation": "The wheel-turning king then commanded them, saying, 'If you can do so, each of you will govern and transform your own objects, relying on one teaching and not disobey the other.'",
        "source": "T01n0025_002:0373a13_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0025_002:0373a15_6"
    },
    {
        "source_sentence": "勿令我境有非法人及惡行者。",
        "translation": "Don't allow unlawful people and bad actions to exist in my realm.",
        "source": "T01n0025_002:0373a15_7"
    },
    {
        "source_sentence": "又復汝等，莫作殺生，教人不殺，不與勿取，邪婬妄語，乃至邪見，汝等當斷。",
        "translation": "Again, you should not kill living beings. You should teach others not to kill and not to give or take what is not given. You should abandon sexual misconduct, false speech, and so on, up to wrong views.",
        "source": "T01n0025_002:0373a16_8"
    },
    {
        "source_sentence": "若離殺生，乃至若當行於正見，能如是者，我即當知，汝等國土，善已降伏。』",
        "translation": "If you abstain from killing sentient beings, or even if you practice right view and can do so, I will know that your lands have been well subdued.'",
        "source": "T01n0025_002:0373a17_9"
    },
    {
        "source_sentence": "其諸王等，同共啟白轉輪王言：『如天教勅，我當奉行。』",
        "translation": "The kings and others all said to the wheel-turning king, 'As the god commands, I will follow it.'",
        "source": "T01n0025_002:0373a19_10"
    },
    {
        "source_sentence": "「爾時，北方諸國王等，聞轉輪王如是勅已，各各遵承，受十善業。",
        "translation": "“At the time, the kings of the northern countries heard this command from the wheel-turning king, and each one obeyed it and received the ten good actions.",
        "source": "T01n0025_002:0373a21_0"
    },
    {
        "source_sentence": "受已奉行，皆悉如法，依律治化。",
        "translation": "Having accepted it, they all practice it according to the teaching and govern it according to the precepts.",
        "source": "T01n0025_002:0373a22_1"
    },
    {
        "source_sentence": "其轉輪王，自在力故，所行之處，其天輪寶，隨逐而行。",
        "translation": "Because of the king’s sovereign power, the divine wheel treasure traveled with him wherever he went.",
        "source": "T01n0025_002:0373a23_2"
    },
    {
        "source_sentence": "此天金輪，如是次第。",
        "translation": "These heavenly wheels of gold are arranged in this order:",
        "source": "T01n0025_002:0373a24_3"
    },
    {
        "source_sentence": "降北方已，度海北岸，所有土地，周迴其際，遍已還來。",
        "translation": "He descended to the north and crossed over to the northern shore of the sea. All the land he possessed pervaded the entire area, and when he reached this point he returned again and again.",
        "source": "T01n0025_002:0373a25_0"
    },
    {
        "source_sentence": "爾時，始於閻浮提中，選擇最上威德形勝極精妙地，其天輪寶當於彼上，",
        "translation": "It was then that the divine wheel treasure first emerged in Jambudvfpa, choosing the highest and most majestic stage of great  splendor.",
        "source": "T01n0025_002:0373a26_1"
    },
    {
        "source_sentence": "東西經絡，闊七由旬，南北規畵，十二由旬。",
        "translation": "It is seven yojanas wide from east to west and twelve yojanas in width from south to north.",
        "source": "T01n0025_002:0373a27_2"
    },
    {
        "source_sentence": "如是度已，爾時諸天即夜下來，自然為彼轉輪聖王，造立宮殿，應時成就。",
        "translation": "After thus liberating them, the gods then came down at night and naturally built a palace for that wheel-turning sage king, which would be completed in time.",
        "source": "T01n0025_002:0373a28_3"
    },
    {
        "source_sentence": "既成就已，妙色端嚴，四寶所作，謂天金銀頗梨琉璃。",
        "translation": "Once completed, it's marvelously colored and dignified, made of the four treasures, which are heavenly gold, silver, pāri, and lapis lazuli.",
        "source": "T01n0025_002:0373b01_4"
    },
    {
        "source_sentence": "是時，彼天真金輪寶，為於聖王，當宮內門上虛空中，嶷然停住，如著軸輪，",
        "translation": "At that time, the divine real golden wheel treasure was placed in the sky at the entrance of the palace for the sake of the holy king.",
        "source": "T01n0025_002:0373b02_5"
    },
    {
        "source_sentence": "不搖不動。",
        "translation": "It doesn't shake or move.",
        "source": "T01n0025_002:0373b04_6"
    },
    {
        "source_sentence": "其轉輪王，當于爾時，生大歡喜，踊躍無量，作是念言：『我今已受天輪寶耶！』",
        "translation": "At that point, the wheel-turning king becomes greatly joyful, jumps up and down without measure, and thinks, 'Have I received the divine wheel treasure now?'",
        "source": "T01n0025_002:0373b04_7"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373b06_8"
    },
    {
        "source_sentence": "彼轉輪王，有如是形，天金輪寶，自然具足。",
        "translation": "That wheel-turning king has such a shape and naturally possesses the divine golden wheel treasure.",
        "source": "T01n0025_002:0373b06_9"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0373b07_10"
    },
    {
        "source_sentence": "其轉輪王，復有何等白色象寶，應當具足？",
        "translation": "What white elephant treasure did the wheel-turning king have that should be endowed with it?",
        "source": "T01n0025_002:0373b07_11"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373b08_12"
    },
    {
        "source_sentence": "是轉輪王，於日初分，坐宮觀時，即當王前，出生象寶。",
        "translation": "At the first part of the day, when he was sitting in his palace to contemplate, the wheel-turning king came before the king and produced an elephant treasure.",
        "source": "T01n0025_002:0373b09_13"
    },
    {
        "source_sentence": "其象妙色，形體純白，如拘物頭，七支拄地，有大神力，飛騰虛空，其頭赤色，",
        "translation": "The elephant was beautifully colored, pure white in body and shape, like the head of a condemned animal. With seven limbs resting on the ground, with great supernatural powers it flew up into the sky, its head red-colored",
        "source": "T01n0025_002:0373b10_14"
    },
    {
        "source_sentence": "如因陀羅瞿波迦蟲，象有六牙，並皆纖利，其牙微妙，雜色莊嚴，猶如金粟，",
        "translation": "Like the insect Indra Gopalka, an elephant has six tusks that are all slender and slender. The teeth are subtle and adorned with variegated colors like golden corn.",
        "source": "T01n0025_002:0373b12_15"
    },
    {
        "source_sentence": "其象名曰烏逋沙他(隋言受齋)。",
        "translation": "The elephant was named Ucchuṣāṭa (Sui: undertaking purification).",
        "source": "T01n0025_002:0373b14_0"
    },
    {
        "source_sentence": "轉輪聖王見象寶已，作如是念：『此象既現，若調伏時，堪受諸事，作賢乘不？』",
        "translation": "Seeing the elephant treasure, the wheel-turning sage king thinks, 'Now that this elephant has appeared, is it capable of undergoing all kinds of tasks when disciplined and will it become the good vehicle?'",
        "source": "T01n0025_002:0373b14_1"
    },
    {
        "source_sentence": "時，此象寶，一日之中，即便調伏，堪任駕馭一切諸事，猶如無量百千歲數所調伏來，",
        "translation": "In a single day the elephant treasure was able to subdue it. It could drive all kinds of carriages, just as if it had been subdued for immeasurable hundreds of thousands of years.",
        "source": "T01n0025_002:0373b16_2"
    },
    {
        "source_sentence": "端嚴賢善，隨順調適。",
        "translation": "They are dignified and good-looking; they adapt themselves accordingly.",
        "source": "T01n0025_002:0373b18_3"
    },
    {
        "source_sentence": "如是如是，彼之象寶，於一日中，受諸調伏，堪任眾事，亦復如是。",
        "translation": "Thus and so forth, it's likewise with that elephant treasure, who undergoes discipline in a single day, and is capable of performing all kinds of tasks.",
        "source": "T01n0025_002:0373b18_4"
    },
    {
        "source_sentence": "時，轉輪王欲試象寶，於其晨朝日初出時，乘彼象寶，周迴巡歷，遍諸海岸，",
        "translation": "At that time the wheel-turning king wished to test the elephant treasure. In the morning, when the sun began to rise on the first day of the month, he rode the elephant treasure and circumambulated it all over the seacoast.",
        "source": "T01n0025_002:0373b20_5"
    },
    {
        "source_sentence": "盡大地際；",
        "translation": "They pervade all the extents of the earth.",
        "source": "T01n0025_002:0373b22_6"
    },
    {
        "source_sentence": "周匝既已，還來至本宮殿之處。",
        "translation": "After circumambulating it, he returned to his original palace.",
        "source": "T01n0025_002:0373b22_7"
    },
    {
        "source_sentence": "是轉輪王，便進小食。",
        "translation": "That wheel-turning king then offered a small meal.",
        "source": "T01n0025_002:0373b23_8"
    },
    {
        "source_sentence": "以是因緣，彼王爾時，於其內心，歡喜踊躍，為我故生如此象寶。",
        "translation": "Because of these causes and conditions, that king then rejoiced and jumped for joy in his heart. Such an elephant treasure as this was produced for my sake.",
        "source": "T01n0025_002:0373b23_9"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373b25_10"
    },
    {
        "source_sentence": "彼轉輪王，有於如是白色象寶，自然具足。",
        "translation": "That wheel-turning king has such white elephant treasures, which are naturally replete.",
        "source": "T01n0025_002:0373b25_11"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0373b27_0"
    },
    {
        "source_sentence": "何等是彼轉輪聖王馬寶具足？",
        "translation": "What's the treasure of that wheel-turning sage king horse?",
        "source": "T01n0025_002:0373b27_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373b27_2"
    },
    {
        "source_sentence": "是轉輪王，日初分時，坐宮殿上，即於王前，出紺馬寶。",
        "translation": "At the first watch of the day, when the wheel-turning king was seated in his palace, a dark blue horse treasure appeared before the king.",
        "source": "T01n0025_002:0373b28_3"
    },
    {
        "source_sentence": "身青體潤，毛色悅澤，頭黑髲[髟\\/公\\/心]，有神通力，飛騰虛空，",
        "translation": "Their bodies were blue in color and bodily moistened; their hair was graceful and lustrous. Their heads were black and coarse, and they possessed the supernatural power of flying up into the sky.",
        "source": "T01n0025_002:0373b29_4"
    },
    {
        "source_sentence": "其馬名曰婆羅囉呵(隋言長毛)。",
        "translation": "The name of the horse is Vārāṇasī (Sui: long hair).",
        "source": "T01n0025_002:0373c01_5"
    },
    {
        "source_sentence": "是轉輪王，見此馬已，作如是念：『此馬既現，若調伏時，堪受諸事，",
        "translation": "Seeing this horse, the cakravartin thought:",
        "source": "T01n0025_002:0373c02_6"
    },
    {
        "source_sentence": "能得為我作善乘耶？』",
        "translation": "Can you create a good vehicle for me?'",
        "source": "T01n0025_002:0373c03_7"
    },
    {
        "source_sentence": "時，彼馬寶一日之中，應時調伏，堪受諸事，猶如無量年歲調來，妙勝賢善。",
        "translation": "In the course of one day, that horse treasure was disciplined and able to undergo all kinds of deeds just as he had been disciplined for measureless years. He was marvelously superior and good-natured.",
        "source": "T01n0025_002:0373c04_8"
    },
    {
        "source_sentence": "彼馬如是如是調時，一日之內，堪受彼等一切諸事。",
        "translation": "When that horse is thus and thus disciplined, within a day, he'll be able to accept all these things.",
        "source": "T01n0025_002:0373c06_9"
    },
    {
        "source_sentence": "時，轉輪王欲試馬寶，於其晨朝日初出時，乘彼馬寶，周歷大地，還來本宮。",
        "translation": "The wheel-turning king then wished to test the treasured horse. In the morning, when the sun began to rise at dawn, he rode that treasured horse all over the land and returned to his palace.",
        "source": "T01n0025_002:0373c07_10"
    },
    {
        "source_sentence": "彼轉輪王，乃至進食。",
        "translation": "It's the wheel-turning king who advances to food.",
        "source": "T01n0025_002:0373c09_11"
    },
    {
        "source_sentence": "以是因緣故生歡喜，踊躍無量：『我今已生紺馬之寶。』",
        "translation": "Because of these causes and conditions, he becomes joyful and jumps up and down immeasurably, 'Now that I've produced the treasure of the dark blue horse.'",
        "source": "T01n0025_002:0373c09_12"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373c10_13"
    },
    {
        "source_sentence": "是轉輪王，有如是色馬寶具足。",
        "translation": "This wheel-turning king has such a colored horse that's replete with treasures.",
        "source": "T01n0025_002:0373c11_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0373c12_0"
    },
    {
        "source_sentence": "是轉輪王，何等名為珠寶具足？",
        "translation": "What's the name of this wheel-turning king who's fully endowed with jewels?",
        "source": "T01n0025_002:0373c12_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373c12_2"
    },
    {
        "source_sentence": "彼轉輪王，有摩尼寶，毘琉璃色，妙好八楞，非工匠造，自然出生，清淨明曜。",
        "translation": "That wheel-turning king had a maṇi jewel, the color of vaiḍūrya, beautifully decorated with eight lapis lazuli colors that were not made by artisans but came into being naturally pure and bright.",
        "source": "T01n0025_002:0373c13_3"
    },
    {
        "source_sentence": "其轉輪王，見此珠已，作如是念：『此摩尼寶，眾相滿足，應當懸之置於宮內，",
        "translation": "Seeing this jewel, the wheel-turning king thought:",
        "source": "T01n0025_002:0373c14_4"
    },
    {
        "source_sentence": "令顯光明。』",
        "translation": "I'll make it manifest its light.'",
        "source": "T01n0025_002:0373c16_5"
    },
    {
        "source_sentence": "時，轉輪王欲試於彼摩尼寶故，嚴備四兵，所謂象兵馬兵車兵步兵，具四兵已，",
        "translation": "At that time the wheel-turning king, wishing to test those treasures, prepared his fourfold army of elephant troops, cavalry, horse troops, chariot troops, and infantry.",
        "source": "T01n0025_002:0373c16_6"
    },
    {
        "source_sentence": "則於夜半重雲黑暗，電光出時天降微雨。",
        "translation": "At midnight, heavy clouds and darkness arose in the sky, and when lightning emerged it rained little rain.",
        "source": "T01n0025_002:0373c18_7"
    },
    {
        "source_sentence": "時，轉輪王取彼珠寶，懸置幢上，出園苑中，意欲遊觀，驗珠德故。",
        "translation": "The wheel-turning king then took the jewel, hung it over the banner, and went out of the garden to enjoy a pleasure trip in order to test its virtue.",
        "source": "T01n0025_002:0373c19_8"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373c21_9"
    },
    {
        "source_sentence": "彼摩尼寶，在於幢頭，光明周遍，普照四方，及四兵身，悉皆明了，如日照世。",
        "translation": "That maṇi treasure was at the top of the banner, pervaded by a ray of light that shone in all directions and illuminated the bodies of the four armies as brightly as the sun shining in the world.",
        "source": "T01n0025_002:0373c21_10"
    },
    {
        "source_sentence": "爾時，彼地所有一切諸婆羅門，及居士等，在彼住者，悉皆覺起，作諸事業，",
        "translation": "At that time, all the brāhmaṇas and wealthy householders living in those villages awakened to their aspirations and undertaken various deeds.",
        "source": "T01n0025_002:0373c23_11"
    },
    {
        "source_sentence": "謂言：『已明，是日出耶？』",
        "translation": "They say, 'It's clear, is it the sun rising?'",
        "source": "T01n0025_002:0373c24_12"
    },
    {
        "source_sentence": "以是因緣，其轉輪王，受大歡喜，踊躍無量，心念此寶，為我生耶。",
        "translation": "Because of these causes and conditions, the wheel-turning king was greatly delighted. Immeasurable with joy and dancing in uncountable numbers, he thought to himself, “This treasure will arise for me!",
        "source": "T01n0025_002:0373c25_13"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373c26_14"
    },
    {
        "source_sentence": "彼轉輪王，有如是色珠寶具足。",
        "translation": "That wheel-turning king is endowed with such colored jewels.",
        "source": "T01n0025_002:0373c27_15"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0373c28_0"
    },
    {
        "source_sentence": "何等名為轉輪聖王女寶具足？",
        "translation": "What's called the jeweled possession of the wheel-turning sage king's daughter?",
        "source": "T01n0025_002:0373c28_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0373c28_2"
    },
    {
        "source_sentence": "是轉輪王，出生女寶，不短不長、不麤不細、不白不黑，端正姝妍，甚可愛樂，",
        "translation": "“This cakravartin kingdess gave birth to a woman treasure, neither short nor long, neither rough nor fine, neither white nor black, handsome and beautiful, very attractive and delightful.",
        "source": "T01n0025_002:0373c29_3"
    },
    {
        "source_sentence": "最勝最妙，色貌備充。",
        "translation": "The monastery was the best and most marvelous, endowed with an array of colors and forms.",
        "source": "T01n0025_002:0374a01_4"
    },
    {
        "source_sentence": "若天熱時，女寶身涼，寒時身暖。",
        "translation": "If the gods are hot, the woman's treasure body is cool, and her body is warm when it's cold.",
        "source": "T01n0025_002:0374a02_5"
    },
    {
        "source_sentence": "彼身體上出栴檀香，口氣恒如青優鉢羅香。",
        "translation": "From his body a sandalwood fragrance emerges, and his mouth always has the air of blue utpala-like odor.",
        "source": "T01n0025_002:0374a03_6"
    },
    {
        "source_sentence": "為轉輪王，晚臥早起，勤奉恭敬，有所作事，無失王心；",
        "translation": "As the universal ruler, he lays down late at night and rises early in the morning. He is respected and served with utmost reverence. Whatever he does, he does so without losing his kingly mind.",
        "source": "T01n0025_002:0374a04_7"
    },
    {
        "source_sentence": "彼女意尚不生惡念，況其身口。",
        "translation": "The woman's mind doesn't yet give rise to bad thoughts, so why wouldn't her body and mouth?",
        "source": "T01n0025_002:0374a05_8"
    },
    {
        "source_sentence": "以是因緣，轉輪聖王，受大歡喜，踊躍無量，內心念云：『此已為我生女寶耶！』",
        "translation": "Because of these causes and conditions, the wheel-turning sage king was greatly joyful, jumped up and down without measure, and thought to himself, 'Has this been my birth as a woman treasure?'",
        "source": "T01n0025_002:0374a06_9"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374a07_10"
    },
    {
        "source_sentence": "彼轉輪王，有如是形女寶具足。",
        "translation": "That wheel-turning king has such a form that she's fully endowed with the treasure of women.",
        "source": "T01n0025_002:0374a08_11"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0374a09_0"
    },
    {
        "source_sentence": "何等名為轉輪聖王主藏臣寶威神具足？",
        "translation": "What's called the jeweled and authoritative power of the treasured treasury minister, the wheel-turning sage king lord?",
        "source": "T01n0025_002:0374a09_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374a10_2"
    },
    {
        "source_sentence": "彼轉輪王，生主藏寶，大富饒財，多有功果。",
        "translation": "That wheel-turning king produces a treasury of treasure, which is very wealthy and endowed with possessions and many meritorious effects.",
        "source": "T01n0025_002:0374a10_3"
    },
    {
        "source_sentence": "以業報故，生有天眼，洞見地中，或有主藏、或無主藏，皆為彼眼之所洞視，",
        "translation": "Because of the retribution of karma, there arises the divine eye that sees everything in the earth: whether it has an owner or not. All are perceived by this divine eye.",
        "source": "T01n0025_002:0374a11_4"
    },
    {
        "source_sentence": "雖復水陸若遠若近，於中所有，其主藏臣，皆悉為彼如法作護。",
        "translation": "Even though there's water and land, whether distant or near, the treasury councilor who owns it will always guard it for them according to the teaching.",
        "source": "T01n0025_002:0374a13_5"
    },
    {
        "source_sentence": "若無主者，即便收取彼中金銀，為轉輪王有所資須，財寶用事，應時辦具。",
        "translation": "If there's no owner, they'll even collect gold and silver from that place to provide the wheel-turning king with whatever he needs, and their possessions and necessities will be provided for them at the right time.",
        "source": "T01n0025_002:0374a14_6"
    },
    {
        "source_sentence": "時，彼藏臣即便詣向轉輪王所，到已啟白轉輪王言：『大聖天王！",
        "translation": "The treasury minister then went to the wheel-turning king and said, 'Great sage king!",
        "source": "T01n0025_002:0374a16_7"
    },
    {
        "source_sentence": "若天所須財寶用者，願天勿憂，我能為天有所須者，皆悉備具。』",
        "translation": "If the gods need their possessions and treasures, may they not grieve, and I can provide whatever they need for them.'",
        "source": "T01n0025_002:0374a17_8"
    },
    {
        "source_sentence": "時，轉輪王欲試於彼主藏寶故，行到水邊，上船上坐，住水中流，告藏臣言：『汝主藏臣，",
        "translation": "Then the wheel-turning king, wishing to test the treasures belonging to the treasury councilor, went to the water’s edge, sat on a boat, and said to the treasurer in charge of the storehouse:",
        "source": "T01n0025_002:0374a19_9"
    },
    {
        "source_sentence": "我須財寶，可速備具，可速備具。』",
        "translation": "I need property and treasure, so I can quickly prepare it; I can quickly prepare it.'",
        "source": "T01n0025_002:0374a21_10"
    },
    {
        "source_sentence": "主藏啟云：『唯願大天，待須臾時，此船至岸，當於彼處，為天取財，",
        "translation": "The treasury councilor said, “O great goddess, please let this ship reach the shore in a moment’s time.",
        "source": "T01n0025_002:0374a22_11"
    },
    {
        "source_sentence": "以供天用。』",
        "translation": "It's for the use of offerings to gods.'",
        "source": "T01n0025_002:0374a23_12"
    },
    {
        "source_sentence": "王告藏臣：『我今不欲岸上取財，但於此處，為我具備。』",
        "translation": "The king told the treasurer, 'Now, I don't want to take my money on shore; just keep it here for me.'",
        "source": "T01n0025_002:0374a23_13"
    },
    {
        "source_sentence": "其主藏臣，即白王言：『如天所勅，我不敢違。』",
        "translation": "The lord of the treasury said to the king, 'As the gods have commanded me, I won't dare disobey them.'",
        "source": "T01n0025_002:0374a25_14"
    },
    {
        "source_sentence": "時，主藏臣聞王勅已，即袒右臂，便以右膝，著船板上，手攬海水，指如螃蟹，",
        "translation": "The treasury councilor, having heard the king’s edict, bared his right shoulder, knelt with his right knee on the bottom of the ship’s bow, and, holding the water in his hand, looked like a crab.",
        "source": "T01n0025_002:0374a26_15"
    },
    {
        "source_sentence": "多撮金銀，滿諸瓮中，安船板上，奉上轉輪王，而白王言：『此天金銀，",
        "translation": "They gathered a large quantity of gold and silver, filled all the jars, placed it on the boat’s surface, and presented it to the wheel-turning king. He said:",
        "source": "T01n0025_002:0374a28_0"
    },
    {
        "source_sentence": "天以此寶，供贍於王，為財事用。』",
        "translation": "Because of this treasure, the gods offered it to the king for his wealth and service.'",
        "source": "T01n0025_002:0374a29_1"
    },
    {
        "source_sentence": "時，轉輪王告藏臣言：『我不須財，但試汝耳。』",
        "translation": "The wheel-turning king then addressed the treasurer, saying, 'I don't need money, but I'll test you.'",
        "source": "T01n0025_002:0374b01_2"
    },
    {
        "source_sentence": "時，主藏臣聞王此語，還收金銀，置於水內。",
        "translation": "When the treasury councilor heard these words of the king, he collected the gold and silver and placed them inside the water.",
        "source": "T01n0025_002:0374b02_3"
    },
    {
        "source_sentence": "以是因緣，其轉輪王，受大歡喜，踊躍無量，我今已生藏臣寶耶。",
        "translation": "Because of these causes and conditions, the wheel-turning king was greatly delighted and jumped with immeasurable joy. I am now born as a treasury councilor!",
        "source": "T01n0025_002:0374b03_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374b04_5"
    },
    {
        "source_sentence": "彼轉輪王，有如是等藏寶具足。",
        "translation": "That wheel-turning king has such a store of treasures that's complete.",
        "source": "T01n0025_002:0374b05_6"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0374b06_0"
    },
    {
        "source_sentence": "何等名為轉輪聖王主兵臣寶威相具足？",
        "translation": "What's called the jeweled and authoritative characteristic of a wheel-turning sage king lord or military commander?",
        "source": "T01n0025_002:0374b06_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374b07_2"
    },
    {
        "source_sentence": "是轉輪王，福德力故，自然出生兵將之寶，所謂巧智，多諸策謀，洞識軍機，",
        "translation": "Because of the power of his virtue and virtue, this cakravartin king naturally produced treasures such as soldiers and generals called skillful intelligence. He had many strategies and was well versed in military abilities.",
        "source": "T01n0025_002:0374b07_3"
    },
    {
        "source_sentence": "神慧具足。",
        "translation": "He's endowed with supernormal wisdom.",
        "source": "T01n0025_002:0374b09_4"
    },
    {
        "source_sentence": "彼轉輪王，若須兵力，即能備具。",
        "translation": "If that wheel-turning king requires the strength of his troops, he'll be able to prepare them.",
        "source": "T01n0025_002:0374b09_5"
    },
    {
        "source_sentence": "所謂若欲走兵身時，即皆齊走，欲散即散，若欲置立，即能置立。",
        "translation": "It means that when someone wants to walk, the body of an army is assembled, they all walk together, and when they want to disperse it, they disperse it; if they want to place it, they can do so.",
        "source": "T01n0025_002:0374b10_6"
    },
    {
        "source_sentence": "時，兵將寶即便詣向轉輪王所，到已啟白轉輪王言：『若王欲須兵眾教習，",
        "translation": "Then the general of soldiers approached the wheel-turning king and said to him, “If Your Majesty wishes to send your troops to train with you, why don’t you tell me how to do so?” The cakravartin answered:",
        "source": "T01n0025_002:0374b11_7"
    },
    {
        "source_sentence": "願王勿慮，我當為王教習兵眾，使令如心調柔隨順。』",
        "translation": "May the king not worry, for I will teach the king to train his troops so that they are disciplined and compliant with their minds.'",
        "source": "T01n0025_002:0374b13_8"
    },
    {
        "source_sentence": "時，轉輪王欲試於彼兵將寶故，即勅備具四種兵身，所謂象寶兵身、馬寶兵身、車兵、步兵，",
        "translation": "When the cakravartin wished to test those treasured generals, he ordered them to prepare four kinds of army: elephant-jeweled soldiers, horse-jeweled soldiers, chariot-jeweled soldiers,",
        "source": "T01n0025_002:0374b14_9"
    },
    {
        "source_sentence": "悉皆如是。",
        "translation": "They're all like this.",
        "source": "T01n0025_002:0374b16_10"
    },
    {
        "source_sentence": "嚴勅備具四兵身已，時王勅彼兵將寶言：『汝兵將主，善好為我備具兵身，",
        "translation": "Having ordered the four divisions of his army to be supplied with their bodies, the king then commanded the general in charge of the army, Ratnākara, “May your majesty, commander of the troops, please provide me with my",
        "source": "T01n0025_002:0374b16_11"
    },
    {
        "source_sentence": "教令隨順，善走善行，善集善散，如法勿違。』",
        "translation": "He teaches them to follow, walk well, practice well, gather well, disperse well, and don't disobey according to the teaching.'",
        "source": "T01n0025_002:0374b18_12"
    },
    {
        "source_sentence": "其兵將主，聞轉輪王如是勅已，白言大王：『如天教勅，我不敢違。』",
        "translation": "After hearing this command from the wheel-turning king, the general of his army heard it and said to the great king, 'As the god has commanded me, I won't dare disobey it.'",
        "source": "T01n0025_002:0374b19_13"
    },
    {
        "source_sentence": "其四兵身，並備具訖，依王所勅，教走能走，教散能散，乃至若欲置立皆能。",
        "translation": "The bodies of the four kinds of soldiers were all fully prepared, and as instructed by the king, he taught them to run and be able to run; he taught them to disperse and dispersed. Anyone who wished to do so would be",
        "source": "T01n0025_002:0374b21_0"
    },
    {
        "source_sentence": "以是因緣，彼轉輪王，受大歡喜，踊躍無量，我今已生主兵將寶。",
        "translation": "Because of these causes and conditions, that wheel-turning king was greatly delighted and jumped with immeasurable joy. Now I have already produced the treasure army commander!",
        "source": "T01n0025_002:0374b22_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374b24_2"
    },
    {
        "source_sentence": "彼轉輪王，有如是形主兵將寶威力具足。",
        "translation": "That wheel-turning king has such a form and is endowed with the mighty power of his army general treasure.",
        "source": "T01n0025_002:0374b24_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374b25_4"
    },
    {
        "source_sentence": "若有如是七寶現者，然後得名轉輪聖王。",
        "translation": "If someone thus manifests these seven treasures, they'll then be called a wheel-turning sage king.",
        "source": "T01n0025_002:0374b25_5"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0374b26_6"
    },
    {
        "source_sentence": "何等是彼轉輪聖王四種自在神通具足？",
        "translation": "What are the four kinds of unimpeded supernormal powers possessed by those wheel-turning kings?",
        "source": "T01n0025_002:0374b26_7"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374b27_8"
    },
    {
        "source_sentence": "彼轉輪王，年歲壽命，長遠久住，於迦羅時三摩耶時，一切世間無有人生，",
        "translation": "That wheel-turning king has a long life span of many years. At the time of Kālā and at the time of samaya, there is no human being born in any world.",
        "source": "T01n0025_002:0374b27_9"
    },
    {
        "source_sentence": "能得如是安隱久處，如彼轉輪王，長命久住。",
        "translation": "He's able to attain such a peaceful place for a long time, like that wheel-turning king who lives a long life and stays there for a long time.",
        "source": "T01n0025_002:0374b29_10"
    },
    {
        "source_sentence": "是則名為轉輪聖王第一壽命神通具足。",
        "translation": "This is called the first life span of a wheel-turning sage king whose supernormal powers are complete.",
        "source": "T01n0025_002:0374c01_11"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0374c03_0"
    },
    {
        "source_sentence": "彼轉輪王所受身體，無病少惱，眾相具足。",
        "translation": "The body that the wheel-turning king receives is free of illness and little discomfort, endowed with all characteristics.",
        "source": "T01n0025_002:0374c03_1"
    },
    {
        "source_sentence": "又復其腹不大不小，寒煖冷熱，隨時節調，進止輕便，食飲消化，安隱快樂。",
        "translation": "Again, their bellies are neither large nor small. They are cold and hot at the same time; they are regulated according to seasons with moderation in eating, drinking, digestion, and being peaceful and happy.",
        "source": "T01n0025_002:0374c04_2"
    },
    {
        "source_sentence": "於迦羅時三摩耶時，無有餘人世間生者，能爾少病無諸疾惱，如彼聖王。",
        "translation": "At the time of Kāla, there's no other person in the world to be born when he's samaya, and he's able to have few illnesses and no illnesses like that noble king.",
        "source": "T01n0025_002:0374c06_3"
    },
    {
        "source_sentence": "是則名為轉輪聖王第二身力神通具足。",
        "translation": "This is called the second body of the wheel-turning sage king that's endowed with physical strength and supernormal abilities.",
        "source": "T01n0025_002:0374c07_4"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0374c09_0"
    },
    {
        "source_sentence": "彼轉輪王，報得形容可憙端正，為諸世間常所樂觀，最勝最妙，色身清淨，",
        "translation": "That wheel-turning king was rewarded with an appearance that was graceful and handsome, always delighted by all the people in the world to see. Supreme and most marvelous, his form and body pure and genuine, he adorned himself like a",
        "source": "T01n0025_002:0374c09_1"
    },
    {
        "source_sentence": "具足莊嚴。",
        "translation": "It's fully adorned.",
        "source": "T01n0025_002:0374c11_2"
    },
    {
        "source_sentence": "於迦羅時三摩耶時，無有人中所受生者，能得如是端正可憙，為於世間願樂觀矚，",
        "translation": "At the time of the kalala, there was no one to be born among humans who could attain such a deportment and look out for worldly pleasures.",
        "source": "T01n0025_002:0374c11_3"
    },
    {
        "source_sentence": "如彼轉輪王，形相備者。",
        "translation": "It's like that wheel-turning king, whose form is complete.",
        "source": "T01n0025_002:0374c13_4"
    },
    {
        "source_sentence": "是則名為轉輪聖王第三色貌神通具足。",
        "translation": "This is called the third form and appearance of the wheel-turning sage king that's endowed with supernormal abilities.",
        "source": "T01n0025_002:0374c13_5"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0374c15_0"
    },
    {
        "source_sentence": "彼轉輪王業報因緣，大有福德，所謂種種資產豐饒，世間珍奇眾寶具足。",
        "translation": "Because of the karmic retribution of that wheel-turning king's actions, he greatly possesses merit, which is called abundant in various possessions and endowed with worldly treasures and rare treasures.",
        "source": "T01n0025_002:0374c15_1"
    },
    {
        "source_sentence": "於迦羅時三摩耶時，無有人中所受生者，有如是富、有如是財，服玩眾多、寶物充溢，",
        "translation": "At the time of the kalala, there was no one to be born among humans who had such wealth and possessions, which were so abundant in clothing and games and filled with treasures.",
        "source": "T01n0025_002:0374c17_2"
    },
    {
        "source_sentence": "得及於彼轉輪王者。",
        "translation": "They'll attain it and those who are wheel-turning kings.",
        "source": "T01n0025_002:0374c19_0"
    },
    {
        "source_sentence": "是則名為轉輪聖王第四果報神通具足。",
        "translation": "This is called the fourth realization of the karmic retribution of the wheel-turning sage king's supernormal abilities that are complete.",
        "source": "T01n0025_002:0374c19_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0374c20_2"
    },
    {
        "source_sentence": "若有如是四種神通，皆具足者，然後得名轉輪聖王。",
        "translation": "If someone has these four kinds of supernormal powers and is fully endowed with them, then they'll be called a wheel-turning sage king.",
        "source": "T01n0025_002:0374c20_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0374c22_0"
    },
    {
        "source_sentence": "又彼福德轉輪聖王，得諸人民之所愛重，心常喜樂，譬如諸子愛敬其父；",
        "translation": "Moreover, the universal ruler blessed with virtue who turns the wheel of sagehood receives the affection of the people and their hearts are always joyful. It is analogous to a child who loves his father.",
        "source": "T01n0025_002:0374c22_1"
    },
    {
        "source_sentence": "又諸人民得轉輪王之所憐愍，意恒慈念，如父愛子。",
        "translation": "Furthermore, the people were pitied by the wheel-turning king and their minds were always compassionate like fathers who love their children.",
        "source": "T01n0025_002:0374c23_2"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0374c26_0"
    },
    {
        "source_sentence": "其轉輪王坐毘闍耶多(隋言最勝好車)，欲出遊歷觀看園林及諸善地。",
        "translation": "The wheel-turning king sat in the Vaijayata (known as the most excellent chariot in the Sui language), wanting to go out and visit the gardens, forests, and good places.",
        "source": "T01n0025_002:0374c26_1"
    },
    {
        "source_sentence": "於彼時中，諸人民等得覩於彼轉輪王時，皆大歡喜，各共同告彼馭者言：『汝善馭者，",
        "translation": "At the time, all the people were greatly delighted when they saw that wheel-turning king. They each said to the charioteer, “O skillful charioteer!",
        "source": "T01n0025_002:0374c27_2"
    },
    {
        "source_sentence": "唯願持轡，緩緩徐行，勿過速疾。",
        "translation": "I beg you, World-Honored One, to bear the burden and walk slowly, not too quickly.",
        "source": "T01n0025_002:0374c29_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0025_002:0375a01_4"
    },
    {
        "source_sentence": "汝若安步，寬縱車行，願我等輩，多時得見轉輪聖王。』",
        "translation": "If you walk calmly and widely in a chariot, may we all see the wheel-turning sage king for a long time.'",
        "source": "T01n0025_002:0375a01_5"
    },
    {
        "source_sentence": "其轉輪王，聞此語已，亦復如是，告馭者言：『汝善馭者，徐徐緩行，",
        "translation": "Having heard these words, the wheel-turning king was likewise. Hearing them, he said to the charioteer, “O good charioteer, go slowly and gradually.",
        "source": "T01n0025_002:0375a02_6"
    },
    {
        "source_sentence": "慎莫速疾。",
        "translation": "Be cautious and not hasty.",
        "source": "T01n0025_002:0375a04_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T01n0025_002:0375a04_8"
    },
    {
        "source_sentence": "汝若安住，善持車行，則令我今多時如是周遍觀矚彼諸人民。』",
        "translation": "If you abide calmly and skillfully carry the chariot, then I will now often thus pervade and look at those people.'",
        "source": "T01n0025_002:0375a04_9"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375a06_10"
    },
    {
        "source_sentence": "其諸人民，見輪王已，皆各自持所有珍寶，或以珍寶於前奉獻轉輪聖王，",
        "translation": "Having seen the wheel-turning sage king, each of those people carried his own treasures or offered them to the wheel-turning sage king.",
        "source": "T01n0025_002:0375a06_11"
    },
    {
        "source_sentence": "上已白言：『我今奉天，此物屬天，願天受已，隨天所用，但此之物，",
        "translation": "The king said, “I now serve the gods. This belongs to the gods. May the gods accept it and use it as they see fit.",
        "source": "T01n0025_002:0375a08_12"
    },
    {
        "source_sentence": "唯應天用。』",
        "translation": "It's only appropriate for heavenly use.'",
        "source": "T01n0025_002:0375a09_13"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375a10_0"
    },
    {
        "source_sentence": "其轉輪王，出現世時，此閻浮洲，清淨平整，無有荊棘及諸稠林丘墟坑坎，",
        "translation": "When the wheel-turning king appeared in the world, this Jambudvipa was pure and level, without thorns or thorny plants, as well as dense forests, hills, mounds, pits, and ditches.",
        "source": "T01n0025_002:0375a10_1"
    },
    {
        "source_sentence": "并餘廁溷雜穢臭處、礓石瓦礫沙鹵等物，自然金銀七寶具足，不寒不熱時節均調。",
        "translation": "They naturally possess the seven treasures of gold, silver, and silver. They are neither too cold nor too hot; they are evenly balanced at all seasons.",
        "source": "T01n0025_002:0375a11_2"
    },
    {
        "source_sentence": "又諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0375a13_3"
    },
    {
        "source_sentence": "其轉輪王，出現世時，此閻浮洲，自然安置八萬城邑，皆悉快樂，無諸怖畏，",
        "translation": "When the cakravartin appears in the world, this continent of Jambudvfpa naturally establishes eighty thousand cities. All are blissful and free from fear.",
        "source": "T01n0025_002:0375a14_0"
    },
    {
        "source_sentence": "甚可愛樂，穀米豐饒，聚落眾多，人民熾盛。",
        "translation": "It is a very attractive and pleasant place with plenty of cereals and rice. The villages are numerous and the inhabitants are prosperous.",
        "source": "T01n0025_002:0375a15_1"
    },
    {
        "source_sentence": "又諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0375a16_2"
    },
    {
        "source_sentence": "其轉輪王，出現世時，此閻浮提，村落城邑，王所治處，比屋連甍，雞飛相及，",
        "translation": "When the wheel-turning king appeared in the world, this Jambudvfpa was divided into villages and cities. The place ruled by the king was as small as a house with its many chickens flying together like each other.",
        "source": "T01n0025_002:0375a17_0"
    },
    {
        "source_sentence": "人民快樂，不可思議。",
        "translation": "The happiness of the people is unfathomable.",
        "source": "T01n0025_002:0375a18_1"
    },
    {
        "source_sentence": "又諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0375a19_2"
    },
    {
        "source_sentence": "其轉輪王，出現世時，此閻浮洲，常於夜半，從阿那婆達多池中，起大雲氣，",
        "translation": "When the cakravartin appears in the world, this Jambudvipa always produces a great cloud of energy from Anavatapta’s pond at midnight.",
        "source": "T01n0025_002:0375a19_3"
    },
    {
        "source_sentence": "遍閻浮洲及諸山海，即便澍雨，乃至如一[(殼-一)\\/牛]牛乳頃，",
        "translation": "And rain poured down like a drop of milk from a cow’s shell on all the continents of Jambudvfpa and the great mountains.",
        "source": "T01n0025_002:0375a21_4"
    },
    {
        "source_sentence": "其水具足八功德味，水深四指，更不傍流，當於下處即浸入地，皆沒不現；",
        "translation": "The water was endowed with the taste of the eight kinds of virtue. The water was four inches deep and did not flow sideways. At that point it sank into the ground, but disappeared without appearing.",
        "source": "T01n0025_002:0375a22_5"
    },
    {
        "source_sentence": "到夜後分，雲悉開除，還從海中，起清涼風，吹彼潤澤，觸諸人民，皆受安樂，",
        "translation": "When the night came to an end, the clouds all cleared away and they returned from the ocean. Again, a cool breeze blew and moistened the water; touching the people there, they all felt at ease.",
        "source": "T01n0025_002:0375a24_6"
    },
    {
        "source_sentence": "又彼甘澤，潤閻浮洲，普使肥鮮。",
        "translation": "Also, that sweet swamp moistens Jambudvīpa and makes it all fat and fresh.",
        "source": "T01n0025_002:0375a25_7"
    },
    {
        "source_sentence": "譬如世人巧作鬘師、若鬘師弟子，作鬘成已，以水灑上，令其悅澤，華色光鮮，",
        "translation": "Good man, this is analogous to how the people in the world skillfully make a bowl of rice cakes. Suppose someone who has made a bowl of rice cakes or one of his disciples pours water over it so that they will be delighted and",
        "source": "T01n0025_002:0375a26_8"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T01n0025_002:0375a28_9"
    },
    {
        "source_sentence": "「復次，其轉輪王出現世時，此閻浮提土地，恒常沃壤滋茂。",
        "translation": "“Furthermore, when that wheel-turning king appears in the world, this land of Jambudvīpa is always fertile and abundant.",
        "source": "T01n0025_002:0375a29_0"
    },
    {
        "source_sentence": "譬如有人用酥油塗其地，津液肥美膏腴，亦復如是。",
        "translation": "Good man, this is analogous to someone who coats the earth with butter and soaking it with oil. The water that flows from the fountain is as thick and fragrant as if he were wearing a rich ointment.",
        "source": "T01n0025_002:0375b01_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375b02_2"
    },
    {
        "source_sentence": "彼轉輪王，出現在世，經歷無量久遠年時，雖受人間所有覺觸。",
        "translation": "That wheel-turning king appeared in the world for an immeasurable long time, and even though he had experienced all the sensations and tactile sensations of humans for an immeasurable long time.",
        "source": "T01n0025_002:0375b02_3"
    },
    {
        "source_sentence": "譬如細軟柔弱體人，食好美食，運動施為，少時疲觸，須臾消化。",
        "translation": "It's like a person with fine, soft, and flexible bodies who eats good food, exercises and gives alms, feels tired for a little while, and digests it in a moment.",
        "source": "T01n0025_002:0375b04_4"
    },
    {
        "source_sentence": "如是如是，彼轉輪王，處世久時，生死覺觸，亦復如是。",
        "translation": "Thus and so it is, and so it is with that wheel-turning king who lives in the world for a long time, feeling and touching birth and death as well.",
        "source": "T01n0025_002:0375b05_5"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375b07_6"
    },
    {
        "source_sentence": "彼轉輪王壽終之時，捨身命已，上生天中，與彼三十三天共俱。",
        "translation": "When that wheel-turning king's life ends, he abandons his body and life and goes up to be born in heaven with the Trāyastriṃśa gods.",
        "source": "T01n0025_002:0375b07_7"
    },
    {
        "source_sentence": "「又諸比丘！",
        "translation": "Again, monks!",
        "source": "T01n0025_002:0375b09_0"
    },
    {
        "source_sentence": "彼轉輪王當命終時，上虛空中，雨優鉢羅、鉢頭摩、拘物頭、分陀利等種種香華，",
        "translation": "At the end of his life, the wheel-turning king ascended up into the sky and showered various fragrant flowers like blue lotus blossoms, red lotus blossoms, pink lotus blossoms, white lotus blos",
        "source": "T01n0025_002:0375b09_1"
    },
    {
        "source_sentence": "為轉輪王作供養故，又復更雨天沈水末、多伽羅末、栴檀香末，及天曼陀羅華等，",
        "translation": "For the sake of making offerings to the wheel-turning king, he also rained heavenly water powder, sandalwood powder, sandalwood powder, and heavenly maṇḍala flowers.",
        "source": "T01n0025_002:0375b11_0"
    },
    {
        "source_sentence": "復有天諸微妙樂音，不鼓自鳴，亦有天妙歌歎之聲，為供養彼轉輪王身作福利故。",
        "translation": "Again, there are subtle sounds of divine music that don't drum and sound themselves, and there are wonderful sounds of divine singing and praising in order to make offerings to the body of the wheel-turning king for his benefit.",
        "source": "T01n0025_002:0375b12_1"
    },
    {
        "source_sentence": "「諸比丘。",
        "translation": "“Monks.",
        "source": "T01n0025_002:0375b15_0"
    },
    {
        "source_sentence": "時，彼女寶及主藏寶、兵將寶等，取輪王身，即以種種香湯洗之，香汁洗已，",
        "translation": "The woman treasure, the treasure of the lord of the treasury, the treasure of the generals, and the treasure of soldiers then took the wheel-turning king's body, washed it with various kinds of fragrant water and juice, and",
        "source": "T01n0025_002:0375b15_1"
    },
    {
        "source_sentence": "最初先用劫波娑纏，然後乃以不擣疊衣持用裹之，次復更以微妙細疊足五百端，",
        "translation": "First, he wrapped it in a cotton cloth and then wrapped it around him with an uncoated robe. Next, he wrapped the cloth around his feet [with] five hundred patches of finely woven cloth.",
        "source": "T01n0025_002:0375b16_2"
    },
    {
        "source_sentence": "就上次第如是纏已，又取金棺，滿盛酥油，持輪王身，安置棺中，安棺中已，",
        "translation": "After he had been tethered like this in order above, he took the golden coffin, filled it with butter and oil, carried the wheel-turning king’s body, placed it in a coffin, and settled it there.",
        "source": "T01n0025_002:0375b18_3"
    },
    {
        "source_sentence": "更取銀槨，復以金棺，內銀槨中，內銀槨已，以釘釘之，又復集諸一切香木，",
        "translation": "He took the silver casket, placed it in a golden coffin, placed it inside a silver casket, and, having placed the silver casket inside the coffin, nailed it with nails. Then he collected all kinds of fragrant wood.",
        "source": "T01n0025_002:0375b20_4"
    },
    {
        "source_sentence": "作於大[卄\\/積]，然後闍毘。",
        "translation": "It's made in the great [twenty \\/ heap], and then it's made jhāvi.",
        "source": "T01n0025_002:0375b22_5"
    },
    {
        "source_sentence": "既闍毘已，乃於四郊大衢道中，為轉輪王作蘇偷婆(隋言寶塔)，高一由旬，",
        "translation": "Having paid his respects, he built a stupa one yojana high for the wheel-turning king at the great thoroughfare in the four suburbs of the capital.",
        "source": "T01n0025_002:0375b22_6"
    },
    {
        "source_sentence": "闊半由旬，雜色校飾四寶所成，所謂金銀琉璃頗梨，其塔四院，周圍縱廣五十由旬，",
        "translation": "It is half a yojana wide and made of the four kinds of treasure, such as gold, silver, lapis lazuli, and crystal. The four courtyards of this stupa are fifty yojanas in width and length all around it.",
        "source": "T01n0025_002:0375b24_7"
    },
    {
        "source_sentence": "七重垣牆、七重欄楯，略說如上，乃至眾鳥，各各自鳴。",
        "translation": "The seven walls and seven railings are as briefly described above, up to the sound of birds singing individually.",
        "source": "T01n0025_002:0375b26_8"
    },
    {
        "source_sentence": "時，彼女寶，并及主藏、主兵寶等，為轉輪王作蘇偷婆成就訖已，然後施設微妙供具，",
        "translation": "The treasure of the queen, along with the treasures of the king’s treasury and military treasures, were then given to the wheel-turning king. Having done so, King Mahāsudassana prepared a subtle offering for her.",
        "source": "T01n0025_002:0375b27_9"
    },
    {
        "source_sentence": "所謂種種諸來求索，須食與食、須飲與飲、須乘與乘、須衣與衣、須財與財、須寶與寶，",
        "translation": "It's called various kinds of requests from people who need food and food, drink and drink, vehicles and vehicles, clothing and robes, property and possessions, treasures and treasures.",
        "source": "T01n0025_002:0375b29_10"
    },
    {
        "source_sentence": "盡給與之，悉令滿足。",
        "translation": "He gave them all to them and made them all complete.",
        "source": "T01n0025_002:0375c02_11"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0375c04_0"
    },
    {
        "source_sentence": "彼轉輪王命終已後，經於七日，彼金輪寶、象寶、馬寶、摩尼珠寶，一切自然隱沒不現，",
        "translation": "“Seven days after his death, the wheel-turning king’s treasures of golden wheels, elephants, horses, and maṇi jewels all naturally disappeared without appearing.",
        "source": "T01n0025_002:0375c04_1"
    },
    {
        "source_sentence": "女寶、主藏及兵將等，皆亦命終。",
        "translation": "The woman treasure, the lord of the treasury, and the general of soldiers all died.",
        "source": "T01n0025_002:0375c06_2"
    },
    {
        "source_sentence": "彼四寶城，各各改變，為摶土城，彼之人民，亦皆次第隨而減少。",
        "translation": "Each of those cities of the four treasures was transformed into a city of coarse dirt, and its inhabitants also decreased in order.",
        "source": "T01n0025_002:0375c06_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375c08_4"
    },
    {
        "source_sentence": "一切諸行，有為無常，如是遷變，無有常住，破壞離散，不得自在，是磨滅法，",
        "translation": "All formations are conditioned and impermanent. Thus they change, have no permanence or continuance, break down and disintegrate, and do not attain mastery. This is the law of destruction.",
        "source": "T01n0025_002:0375c08_5"
    },
    {
        "source_sentence": "暫時須臾，非久停住。",
        "translation": "It lasts for a little while, but not for a long time.",
        "source": "T01n0025_002:0375c10_6"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375c10_7"
    },
    {
        "source_sentence": "乃至應須捨於諸行，應須遠離、應須厭惡，應當速求解脫之道。",
        "translation": "It's even necessary to abandon conditioned things, become far removed from them, and become disillusioned with evil, and quickly seek the path of liberation.",
        "source": "T01n0025_002:0375c11_0"
    },
    {
        "source_sentence": "起世經地獄品第四上",
        "translation": "A Forest of Pearls from the Dharma Garden, Volume I The Fourth and Supreme Chapter of the Hell of the Arising Sutra",
        "source": "T01n0025_002:0375c13_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0375c14_0"
    },
    {
        "source_sentence": "其四大洲及八萬小洲，諸餘大山及須彌山王等外，別有一山，名為輪圓(前代舊譯云鐵圍山)，",
        "translation": "Beyond the four continents and 80,000 small continents, beyond the other great mountains and Mount Sumeru, there's another mountain named Wheel-Turning Circle (formerly translated as Iron Mountain).",
        "source": "T01n0025_002:0375c14_1"
    },
    {
        "source_sentence": "高六百八十萬由旬，縱廣亦有六百八十萬由旬，彌密牢固，金剛所成，",
        "translation": "It is six hundred and eighty million yojanas high and six hundred and eighty million yojanas long and wide, made of diamond.",
        "source": "T01n0025_002:0375c16_2"
    },
    {
        "source_sentence": "難可破壞。",
        "translation": "It's difficult to destroy.",
        "source": "T01n0025_002:0375c17_3"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375c17_4"
    },
    {
        "source_sentence": "此輪圓外更有一重大輪圓山，由旬高廣正等如前。",
        "translation": "Beyond this circumference is another great circular mountain, one yojana in height and exactly the same width as before.",
        "source": "T01n0025_002:0375c18_5"
    },
    {
        "source_sentence": "其兩山間，極大黑闇，無有光明；",
        "translation": "Between the two mountains there was a great darkness and no light.",
        "source": "T01n0025_002:0375c19_6"
    },
    {
        "source_sentence": "日月如是有大威神大力大德，不能照彼使見光明。",
        "translation": "Thus, the sun and moon are so greatly authoritative, powerful, and virtuous that they can't illuminate their messengers to see their light.",
        "source": "T01n0025_002:0375c20_7"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0375c21_8"
    },
    {
        "source_sentence": "彼兩山間，有八大地獄。",
        "translation": "Between the two mountains there are eight great hells.",
        "source": "T01n0025_002:0375c21_9"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T01n0025_002:0375c22_10"
    },
    {
        "source_sentence": "所謂活大地獄、黑大地獄、眾合大地獄、叫喚大地獄、大叫喚地獄、熱惱大地獄、大熱惱地獄、阿毘脂大地獄。",
        "translation": "They are the great hell of livelihood, the great hell of blackness, the great hell of conjunction, the great hell of screaming, the great hell of wailing, the great hell of fever, the great hell of fever, and the great",
        "source": "T01n0025_002:0375c22_11"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0375c25_0"
    },
    {
        "source_sentence": "彼八大地獄，各各復有十六小地獄，周匝圍遶而為眷屬，是十六獄，悉皆縱廣五百由旬。",
        "translation": "Each of those eight great hells had sixteen minor hells, each surrounded and followed by their followers. These were the sixteen hells, all five hundred yojanas in length and breadth.",
        "source": "T01n0025_002:0375c25_1"
    },
    {
        "source_sentence": "何等十六？",
        "translation": "What are these sixteen?",
        "source": "T01n0025_002:0375c27_2"
    },
    {
        "source_sentence": "所謂黑雲沙地獄、糞屎泥地獄、五叉地獄、飢地獄、渴地獄、膿血地獄、一銅釜地獄、多銅釜地獄、疊磑地獄、斛量地獄雞地獄、灰河地獄、斫板地獄、刀鍱地獄、狐狼地獄、寒氷地獄。",
        "translation": "They are the hell of black sand, the hell of excrement, the hell of mud, the hell of five fetters, the hell of hunger, the hell of thirst, the hell of pus and blood, the hell of one copper pot, the hell of",
        "source": "T01n0025_002:0375c27_3"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0376a03_0"
    },
    {
        "source_sentence": "何因緣故，名活大地獄？",
        "translation": "For what causes and conditions is it called the Great hell of vitality?",
        "source": "T01n0025_002:0376a03_1"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0376a03_2"
    },
    {
        "source_sentence": "彼活大地獄諸眾生輩，生者、有者、出現者、轉住者，手指自然自有鐵爪生，",
        "translation": "Those living beings in the great hell of birth, existence, appearance, and transmigration have their fingers spontaneously produced by themselves with iron nails.",
        "source": "T01n0025_002:0376a03_3"
    },
    {
        "source_sentence": "纖長尖利，並皆鋒鋩。",
        "translation": "They are slender and long, pointed and sharp, all with distinctive edges.",
        "source": "T01n0025_002:0376a05_4"
    },
    {
        "source_sentence": "彼等眾生，既相見已，心意濁亂，心既濁亂，各以鐵爪，自爴破身，或自擘身，",
        "translation": "Having seen each other, the minds of those sentient beings are disturbed. Their minds are disturbed, and each pierces their bodies with an iron fingernail or breaks their own bodies.",
        "source": "T01n0025_002:0376a06_5"
    },
    {
        "source_sentence": "擘已復擘，或復大擘，裂已復裂，或復大裂，割已復割，或復大割。",
        "translation": "After crushing it, he breaks it again and again; after being broken, he breaks it again and again; after being broken, he breaks it again and again; after being broken, he cuts it again and again; or after being cut, he cuts",
        "source": "T01n0025_002:0376a07_6"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0376a09_7"
    },
    {
        "source_sentence": "彼等眾生，於彼時中，作如是知：『我已被傷，我今已死。』",
        "translation": "At the time, those sentient beings then knew, 'I've been hurt, and now I'm dead.'",
        "source": "T01n0025_002:0376a09_8"
    },
    {
        "source_sentence": "然於彼時，以業報故，復生冷風，來吹其身，須臾更生，身體皮肉，筋骨血等，",
        "translation": "At that moment, however, as a consequence of their deeds, cool wind again blows and the body is blown by it. The flesh, skin, flesh, tendons, bones, blood, etc., are produced in an instant.",
        "source": "T01n0025_002:0376a10_9"
    },
    {
        "source_sentence": "已復還活。",
        "translation": "He's already returned to life.",
        "source": "T01n0025_002:0376a12_10"
    },
    {
        "source_sentence": "既得活已，以業力故，復起東西，各相告言：『汝眾生輩，願欲得活，",
        "translation": "Because of the power of their deeds, they rose up again and said to each other, “O you sentient beings! We entreat you to live.",
        "source": "T01n0025_002:0376a12_11"
    },
    {
        "source_sentence": "活已勝耶。』",
        "translation": "Is he already alive and superior?'",
        "source": "T01n0025_002:0376a14_12"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0376a14_13"
    },
    {
        "source_sentence": "於是中間，少分分別，故名活耳。",
        "translation": "In the midst of this, there's a partial discernment, so it's called living.",
        "source": "T01n0025_002:0376a14_14"
    },
    {
        "source_sentence": "然於彼中，更有別業，極受辛苦，大重諸惱，楚毒難忍。",
        "translation": "Still, there's another karma in them that's extremely painful and vexing, with a great deal of anguish and pain that's intolerable.",
        "source": "T01n0025_002:0376a15_15"
    },
    {
        "source_sentence": "而於彼中，命既未終，乃至彼惡不善之業，未盡未滅、未除未轉、未少分現、未全分現，",
        "translation": "And yet their lives have not ended, and so on, up to bad and unwholesome actions haven’t ended, haven’t ceased, haven’t been removed, haven’t changed, haven’t been partially manifested, haven’t been completely",
        "source": "T01n0025_002:0376a16_16"
    },
    {
        "source_sentence": "若於先世，起者造者，若人非人身中作者。",
        "translation": "If someone produced it in a prior lifetime, they'll create it, but if someone doesn't create it in the body of a person.",
        "source": "T01n0025_002:0376a18_17"
    },
    {
        "source_sentence": "「復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0376a20_0"
    },
    {
        "source_sentence": "彼活大地獄中，諸眾生輩，生者有者出現者轉住者，手指又復生鐵刀子、半鐵刀子，",
        "translation": "Those living in the great hell are born, some who appear, some who abide, and those who turn their fingers to produce iron sword pieces and half-iron sword pieces.",
        "source": "T01n0025_002:0376a20_1"
    },
    {
        "source_sentence": "極長纖利，各各相著，心意惱亂，乃至爴裂擘割破截等死已，冷風來吹須臾還活。",
        "translation": "The extremely long and slender, each attached to the other, their minds are disturbed, and after they die, a cold wind blows and returns to life in a moment.",
        "source": "T01n0025_002:0376a22_2"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0376a24_3"
    },
    {
        "source_sentence": "如是少分，略而言之，名為活也。",
        "translation": "Thus, a small part of this is briefly described as living.",
        "source": "T01n0025_002:0376a24_4"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T01n0025_002:0376a25_5"
    },
    {
        "source_sentence": "更復別業，而於彼中，極受苦惱，苦未畢故，求死不得，乃至彼惡不善之業，",
        "translation": "They undergo various kinds of rebirth, yet they experience extreme pain and suffering there. Because their pain has not ended, they are unable to find shelter in the realm of desire or death.",
        "source": "T01n0025_002:0376a25_6"
    },
    {
        "source_sentence": "未盡未滅、未除未離，或復往昔作者造者，若人身作，若非人身作，如是一切，",
        "translation": "They are not destroyed yet, they are not destroyed yet, they are not destroyed yet, they are not destroyed yet, they are not destroyed yet, they are not destroyed yet, they are not destroyed yet, they are not destroyed yet, they",
        "source": "T01n0025_002:0376a27_7"
    },
    {
        "source_sentence": "次第具受。",
        "translation": "They are received in order.",
        "source": "T01n0025_002:0376a28_8"
    },
    {
        "source_sentence": "「又復彼等大活地獄諸眾生輩，無量時中，苦報盡已，從於大活地獄得出，",
        "translation": "“Furthermore, those sentient beings in the hell of great living will emerge from the hell of great living after suffering has ended for an immeasurable number of time.",
        "source": "T01n0025_002:0376b01_0"
    },
    {
        "source_sentence": "出已復走，更求其餘屋宅之處、救護之處、歸依之處。",
        "translation": "After emerging, he ran away and looked for the other dwelling places, rescue places, and refuges.",
        "source": "T01n0025_002:0376b02_1"
    },
    {
        "source_sentence": "作是念已，以罪業故，即便入於黑雲沙小地獄中，廣五百由旬。",
        "translation": "Because of their sins, they'll even go into the small hell of black clouds and sand, which is 500 leagues wide.",
        "source": "T01n0025_002:0376b03_2"
    },
    {
        "source_sentence": "入彼中已，上虛空中，起大黑雲，雨下如沙，其焰熾然，極大猛熱，墮於彼等地獄眾生身分之上，",
        "translation": "Having entered them, they rose up into the sky and produced great black clouds that rained down like sand. The blazing flames were so intensely hot that they fell on the bodies of the sentient beings in those hells.",
        "source": "T01n0025_002:0376b05_3"
    },
    {
        "source_sentence": "墮皮燒皮、墮肉燒肉，至筋燒筋、至骨燒骨、至髓燋髓，出烟出焰，洞徹熾然，",
        "translation": "They fall into skin and burn skin; they fall into flesh and burn flesh, up to the point where tendons burn tendons, up to the point where bones burn bones, up to the point where marrow crushes marrow; smoke comes out and",
        "source": "T01n0025_002:0376b07_4"
    },
    {
        "source_sentence": "受極苦惱。",
        "translation": "They experience extreme pain and suffering.",
        "source": "T01n0025_002:0376b09_5"
    },
    {
        "source_sentence": "以其受苦未畢盡故，求死不得，乃至未盡惡不善業，不滅不除、不轉不變、不離不失，",
        "translation": "“Because their suffering has not yet ended, they seek death but can’t; up to the end of bad and unwholesome actions, they don’t cease or remove them, don’t evolve or change, don’t part or lose",
        "source": "T01n0025_002:0376b09_6"
    },
    {
        "source_sentence": "若於往昔，人及非人如是作來，次第而受，更無量時。",
        "translation": "If in the past, humans and non-humans thus created and received them in order, there would be an infinite number of times.",
        "source": "T01n0025_002:0376b11_7"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0376b13_0"
    },
    {
        "source_sentence": "彼等眾生，經歷無量久遠長道，從黑雲沙地獄中出，出已復走，求屋求宅、求救求覆、求歸依處。",
        "translation": "After going for an immeasurable long distance and a long path, those sentient beings emerge from the hell of black clouds and sands and leave it. Having emerged, they run again, seeking shelter and homes, protection and shelter, and",
        "source": "T01n0025_002:0376b13_1"
    },
    {
        "source_sentence": "作是念已，又復入於糞屎熱泥小地獄中，廣五百由旬。",
        "translation": "After thinking this, he'll again enter the small hell of excrement and hot mud, which is 500 yojanas in width.",
        "source": "T01n0025_002:0376b15_2"
    },
    {
        "source_sentence": "彼等入已，從咽已下，生糞屎泥熱沸焰中，入已行焰燒手燒脚，耳鼻身體一時燋然，",
        "translation": "After entering it, they go down from their throat and are born in a blazing fire of excrement, dung, mud, and hot boiling water. Entering it, the fire burns their hands and feet, and their ears, nose,",
        "source": "T01n0025_002:0376b16_3"
    },
    {
        "source_sentence": "乃至彼惡不善之業，未盡未滅、未除未轉、不離不失，以於往昔若人非人作重業來。",
        "translation": "Even those bad and unskillful actions that haven't ended, haven't ceased, haven't been removed, haven't changed, haven't parted, and haven't been lost come because of the heavy karma they did in the past whether human or",
        "source": "T01n0025_002:0376b18_4"
    },
    {
        "source_sentence": "復次，諸比丘！",
        "translation": "Furthermore, monks!",
        "source": "T01n0025_002:0376b20_5"
    },
    {
        "source_sentence": "其糞屎泥小地獄中，有諸鐵蟲，名為針口，住彼獄中，為諸眾生處處鑽身，",
        "translation": "In the small hell of excrement and mud, there are iron worms called needle mouths that live in those hells and drill their bodies for sentient beings everywhere.",
        "source": "T01n0025_002:0376b20_6"
    },
    {
        "source_sentence": "悉令穿破，先鑽破皮，鑽破皮已次鑽破肉，鑽破肉已次鑽破筋，鑽破筋已然後破骨，",
        "translation": "He causes them all to penetrate and break through. First, he pierces skin; after he has pierced skin, he pierces flesh; after having pierced flesh, he pierces tendons; after having pierced tendons, he breaks bone.",
        "source": "T01n0025_002:0376b22_7"
    },
    {
        "source_sentence": "既鑽破骨住於髓中，食於彼等眾生脂髓，令彼眾生受嚴劇苦。",
        "translation": "Having drilled and broken bones, he abides in marrow and eats the fat marrow of those sentient beings, causing them to experience severe pain.",
        "source": "T01n0025_002:0376b24_8"
    },
    {
        "source_sentence": "乃至壽命猶未畢終，既未盡彼惡不善業，乃至不滅，如是次第具足而受。",
        "translation": "Even before their life has ended, they haven't ended bad and unskillful actions, or even haven't ceased them, and they are received in order like this.",
        "source": "T01n0025_002:0376b26_0"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0376b28_0"
    },
    {
        "source_sentence": "彼等地獄諸眾生輩，有時多時長道久遠，從糞屎泥小地獄出，出已奔走，",
        "translation": "The sentient beings in those hells sometimes go a long distance for a long time. They emerge from the small hell of excrement and mud, running after emerging.",
        "source": "T01n0025_002:0376b28_1"
    },
    {
        "source_sentence": "求室求宅、求護求洲及歸依處，即入五叉小地獄中，其獄亦廣五百由旬。",
        "translation": "Seeking a room, a house, protection, a continent, or a place of refuge, they'll enter the five-pronged lesser hell, which is also 500 leagues wide.",
        "source": "T01n0025_002:0376b29_2"
    },
    {
        "source_sentence": "彼等入於五叉獄已，時守獄卒，取彼地獄受罪眾生，撲於熾然熱鐵地上，",
        "translation": "Having entered the fivefold hell, the guards in this hell seize the offenders and throw them on a blazing hot iron floor.",
        "source": "T01n0025_002:0376c02_3"
    },
    {
        "source_sentence": "其焰洞起。",
        "translation": "The flame rises up from the cave.",
        "source": "T01n0025_002:0376c04_4"
    },
    {
        "source_sentence": "時諸罪人在中仰臥，如是臥已，於兩脚掌，釘兩鐵釘熱焰熾然，又兩手掌釘兩鐵釘，",
        "translation": "The sinners then reclined upright in the middle and, lying cross-legged like this, were nailed to their palms at both feet with two pairs of iron nails blazing hot flames.",
        "source": "T01n0025_002:0376c04_5"
    },
    {
        "source_sentence": "焰亦熾然，又臍輪中釘一鐵釘，焰又熾然。",
        "translation": "The flame is also blazing hot, and there's another iron nailing in the navel wheel, and the flame is also blazing hot.",
        "source": "T01n0025_002:0376c06_6"
    },
    {
        "source_sentence": "獄卒於是以五叉搩，極受嚴苦，乃至彼處壽命未終，惡業未盡，若往昔造，",
        "translation": "The guards in this hell experience extreme pain and suffering with five kinds of fetters, until their life there is about to end and their evil deeds have not ended.",
        "source": "T01n0025_002:0376c07_7"
    },
    {
        "source_sentence": "若人非人身中所造，如是次第彼地獄受。",
        "translation": "If someone isn't created in a person's body, they'll receive it in this order in that hell.",
        "source": "T01n0025_002:0376c09_8"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0376c10_0"
    },
    {
        "source_sentence": "彼諸眾生，多時長遠，從於五叉小地獄出，復走求救、求室求洲、求依求覆及守護處，",
        "translation": "For a long time, those sentient beings emerge from the five intermediate hells and again run around in search of rescue, shelter, continent, refuge, covering, and protection.",
        "source": "T01n0025_002:0376c10_1"
    },
    {
        "source_sentence": "詣向飢餓五百由旬小地獄中。",
        "translation": "They'll go to the small hell of hunger, five hundred yojanas in size.",
        "source": "T01n0025_002:0376c12_2"
    },
    {
        "source_sentence": "入彼處已，時守獄者遙見彼等眾生來已，即前問言：『汝等今者來何所欲？』",
        "translation": "After entering that place, the jailer saw those sentient beings coming from a distance and asked them, 'What do you want when you're here now?'",
        "source": "T01n0025_002:0376c12_3"
    },
    {
        "source_sentence": "彼等皆共答言：『仁者！",
        "translation": "They all replied together, saying, 'Sir, my lord!",
        "source": "T01n0025_002:0376c14_4"
    },
    {
        "source_sentence": "我等飢餓。』",
        "translation": "We're starving.'",
        "source": "T01n0025_002:0376c15_5"
    },
    {
        "source_sentence": "時守獄者，即便取彼地獄眾生，撲著熾然熱鐵地上，令其仰臥，便以鐵鉗開張其口，",
        "translation": "The guards in this hell seize the malefactors and force them to lie face down on a hot iron floor. Then they open and close their mouths with an iron cudgel.",
        "source": "T01n0025_002:0376c15_6"
    },
    {
        "source_sentence": "用熱鐵丸擲著口中。",
        "translation": "He throws a hot iron ball into his mouth.",
        "source": "T01n0025_002:0376c17_7"
    },
    {
        "source_sentence": "時彼地獄眾生脣口，應時燒然，燒脣已燒舌，燒舌已燒腭，燒腭已燒咽，",
        "translation": "The lips and mouths of those sentient beings in that hell are burned at the right time. Having burned their lips, they burn their tongues. Having burned their tongues, they burn palate. Having burned palate, they burn throat",
        "source": "T01n0025_002:0376c17_8"
    },
    {
        "source_sentence": "燒咽已燒心，燒心已燒胸，燒胸已燒腸，燒腸已燒胃，燒胃已經過小腸，",
        "translation": "Having burned the throat, he burns the heart; having burned the heart, he burns the chest; having burned the chest, he burns the intestines; having burned the intestines, he burns the stomach; and",
        "source": "T01n0025_002:0376c19_9"
    },
    {
        "source_sentence": "向下而出，其丸尚赤。",
        "translation": "He went downward and came out, but the ball was still red.",
        "source": "T01n0025_002:0376c21_10"
    },
    {
        "source_sentence": "如是彼等地獄眾生，於其時中受嚴極苦，命未終故，略說乃至若人非人先世所作，",
        "translation": "Sentient beings in these hells experience extreme pain and suffering at that very moment, because their lives have not yet ended. In sum, it is so briefly explained:",
        "source": "T01n0025_002:0376c21_11"
    },
    {
        "source_sentence": "如是次第，彼地獄中，種種具受。",
        "translation": "In this order, they'll be received in those hells in various ways.",
        "source": "T01n0025_002:0376c23_12"
    },
    {
        "source_sentence": "「諸比丘！",
        "translation": "“Monks!",
        "source": "T01n0025_002:0376c25_0"
    },
    {
        "source_sentence": "彼眾生輩，於無量時久長遠道，從彼飢餓小地獄出，復馳奔走，略說如前，",
        "translation": "For an immeasurable amount of time, those sentient beings have traveled a long and distant path for a long time. Having emerged from the small hell of hunger, they will again rush and run, as before.",
        "source": "T01n0025_002:0376c25_1"
    },
    {
        "source_sentence": "求守護處，詣向燋渴五百由旬小地獄中。",
        "translation": "Seeking to guard it, they'll go to the small hell of hunger and thirst, which is 500 leagues in size.",
        "source": "T01n0025_002:0376c26_2"
    },
    {
        "source_sentence": "入彼處已，時守獄者，遙見彼等地獄眾生來，而問言：『汝等今者何所求須？』",
        "translation": "After entering that place, the jailer who guards it then sees the sentient beings in those hells coming from a distance and asks, 'What do you need now?'",
        "source": "T01n0025_002:0376c27_3"
    },
    {
        "source_sentence": "彼等答言：『仁者！",
        "translation": "They replied, 'Sir, my lord!",
        "source": "T01n0025_002:0376c29_4"
    },
    {
        "source_sentence": "我今甚渴。』",
        "translation": "Now, I'm very thirsty.'",
        "source": "T01n0025_002:0376c29_5"
    },
    {
        "source_sentence": "時守獄者，即取彼等地獄眾生，撲著熱鐵熾然地上，在猛焰中，仰而臥之，",
        "translation": "The guards in this hell seize the sentient beings there and throw them into a blazing fire on the ground, where they lie upright in a fierce flame.",
        "source": "T01n0025_002:0377a01_6"
    },
    {
        "source_sentence": "便取鐵鉗開張其口，融赤銅汁灌其口中。",
        "translation": "He then took an iron forceps, opened his mouth, melted red copper juice, and poured it into his mouth.",
        "source": "T01n0025_002:0377a02_7"
    },
    {
        "source_sentence": "時彼地獄眾生，脣口即便燋爛，脣口爛已燒舌，燒舌已燒腭，燒腭已燒咽喉，",
        "translation": "The sentient beings in those hells will even have their lips and mouths scorched and burned. After the lips and mouths are scorched, they'll burn their tongues; after burning their tongues, they'll burn their palates; after",
        "source": "T01n0025_002:0377a03_8"
    },
    {
        "source_sentence": "燒咽喉已燒心，燒心已燒胸，燒胸已燒腸，燒腸已燒胃，燒胃已直破小腸，",
        "translation": "Having burned the throat, he burns the heart; having burned the heart, he burns the chest; having burned the chest, he burns the intestines; having burned the intestines, he burns the stomach; having",
        "source": "T01n0025_002:0377a05_9"
    },
    {
        "source_sentence": "向下而出。",
        "translation": "He went downward and came out.",
        "source": "T01n0025_002:0377a07_10"
    },
    {
        "source_sentence": "彼等眾生，各於其中，受嚴重苦，受極痛苦，受異種苦。",
        "translation": "In each of those sentient beings, they experience severe pain, extreme pain, and different kinds of pain.",
        "source": "T01n0025_002:0377a07_11"
    },
    {
        "source_sentence": "彼等乃至壽命未終，若不盡彼惡不善業，略說如前，乃至若人非人時造，",
        "translation": "If they don't end bad and unskillful actions until their life doesn't end, it's briefly explained as before, up to when they're created by humans or non-humans.",
        "source": "T01n0025_002:0377a08_12"
    },
    {
        "source_sentence": "如是次第，具足而受。",
        "translation": "In this order, they are received in full.",
        "source": "T01n0025_002:0377a10_13"
    },
    {
        "source_sentence": "起世因本經卷第二",
        "translation": "Qishi jingben ben jing, vol. 2",
        "source": "T01n0025_002:0377a11_0"
    }
]