[
    {
        "source_sentence": "般泥洹經卷上",
        "translation": "Parinirvāṇa-sūtra, vol. 1",
        "source": "T01n0006_001:0176a02_0"
    },
    {
        "source_sentence": "不載譯人附東晉錄",
        "translation": "Not included in the Eastern Jin Record of the Translator's Commentary",
        "source": "T01n0006_001:0176a04_0"
    },
    {
        "source_sentence": "聞如是：一時，佛遊於王舍鷂山，從大眾比丘，比丘千二百五十。",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Rājagaha Mountain, accompanied by one thousand two hundred and fifty bhikṣus from the assembly of monks.",
        "source": "T01n0006_001:0176a05_0"
    },
    {
        "source_sentence": "時，摩竭王阿闍世，與越祇不相得，眾臣議言：「越祇自恃國富民眾，",
        "translation": "At that time the king of Magadha, Ajātaśatru, did not get along with Vātsīputrīya. The ministers discussed among themselves, saying:",
        "source": "T01n0006_001:0176a06_1"
    },
    {
        "source_sentence": "地沃野豐多出珍寶，不首伏我，當往攻伐。」",
        "translation": "The land is fertile and abundant with treasures, so if you don't lead the way to subdue me, you'll go and attack it.",
        "source": "T01n0006_001:0176a07_2"
    },
    {
        "source_sentence": "國賢大臣名曰雨舍，梵志種也。",
        "translation": "The minister of national goodness was named雨舍, a brahman by the name.",
        "source": "T01n0006_001:0176a08_3"
    },
    {
        "source_sentence": "王命使行，[旃-方+示]首佛足，敬問消息，興居輕強氣力遊步，德化日昇，",
        "translation": "The king ordered his envoy to go on, and the Buddha stepped at their feet. They respectfully inquired of him for news about the arrival of the emperor; they came out to live with lightness and strength and travelled vigorously.",
        "source": "T01n0006_001:0176a09_4"
    },
    {
        "source_sentence": "言：「阿闍世與越祇有憾，眾臣之議，欲往攻伐。",
        "translation": "He said, The Ajātaśatru and Vṛji had a grudge against each other, and the ministers agreed to go there to attack.",
        "source": "T01n0006_001:0176a11_5"
    },
    {
        "source_sentence": "願聞眾祐，有以教之。」",
        "translation": "May I hear the blessings of the gods and have some way to teach them.",
        "source": "T01n0006_001:0176a12_6"
    },
    {
        "source_sentence": "大臣受命，即嚴車五百乘，騎二千步人二千，行詣鷂山，到小道口，下車步進，",
        "translation": "At the king’s command, the minister prepared a chariot drawn in five hundred carriages, two thousand paces on which were two thousand horsemen and two thousand men riding. They proceeded to the mouth of the small path at the summit of Mount Bimbisāraka, dismounted from the chariot and entered on foot.",
        "source": "T01n0006_001:0176a12_7"
    },
    {
        "source_sentence": "見佛歡喜，貌色恭辭，氣重揖讓畢長跪言：「摩竭王阿闍世，[旃-方+示]首佛足，",
        "translation": "The Buddha was delighted to see him. His countenance was dignified and respectful, and he bowed his head at the Buddha’s feet.",
        "source": "T01n0006_001:0176a14_8"
    },
    {
        "source_sentence": "敬問消息，興居輕強氣力遊步，德化日昇。」",
        "translation": "I respectfully inquire about the news, rise up to live with lightness and strength, travel with energy, and cultivate virtue day by day.",
        "source": "T01n0006_001:0176a16_9"
    },
    {
        "source_sentence": "佛言：「甚善，王與國人及汝皆安不？」",
        "translation": "The Buddha said, Very good, is the king, the people of his country, and you all at peace?",
        "source": "T01n0006_001:0176a17_10"
    },
    {
        "source_sentence": "雨舍白言：「王與越祇有憾，眾臣之議，以彼自恃國富民眾，地沃野豐多出珍寶，",
        "translation": "Śubhavyūha said, “The king has regrets about the dispute with Vṛji. It is because he relies upon his ministers and officials for his support. The land is fertile and there are plenty of rare treasures in the wilderness.",
        "source": "T01n0006_001:0176a17_11"
    },
    {
        "source_sentence": "不首伏我，欲往伐之。",
        "translation": "They won't lead the way to subjugate me, but want to go and attack them.",
        "source": "T01n0006_001:0176a19_12"
    },
    {
        "source_sentence": "願聞佛教。」",
        "translation": "May I hear the Buddha's teaching?",
        "source": "T01n0006_001:0176a20_13"
    },
    {
        "source_sentence": "佛報大臣：「昔吾一時曾遊越祇正躁神舍，見其國人，皆多謹勅，我時為說治國七法不危之道，",
        "translation": "The Buddha told the ministers, “Formerly I once visited a deity’s monastery in Jeta’s Grove. When I saw the people of that country, many of whom were disciplined by me, I preached to them the seven principles for governing the state and the way out of danger.",
        "source": "T01n0006_001:0176a20_14"
    },
    {
        "source_sentence": "其能行者，日當興盛未之衰也。",
        "translation": "Those who can practice it will flourish in the sun and not decline in the moon.",
        "source": "T01n0006_001:0176a22_15"
    },
    {
        "source_sentence": "即叉手言：『願聞七法，蓋何施行？』",
        "translation": "He then saluted with his palms together and said, 'I wish to hear the seven dharmas, so how can I do them?'",
        "source": "T01n0006_001:0176a23_16"
    },
    {
        "source_sentence": "佛言：『諦聽。』",
        "translation": "The Buddha said, 'Listen closely.'",
        "source": "T01n0006_001:0176a24_17"
    },
    {
        "source_sentence": "對曰：『受教。』」",
        "translation": "He replied, 'I'll accept the teaching.'",
        "source": "T01n0006_001:0176a24_18"
    },
    {
        "source_sentence": "時，賢者阿難，住後扇佛。",
        "translation": "At the time, the good man Ānanda stayed behind and fanned the Buddha.",
        "source": "T01n0006_001:0176a24_19"
    },
    {
        "source_sentence": "佛言阿難：「汝寧不聞越祇國人數相聚會，講論政事，修備自守？」",
        "translation": "The Buddha said to Ānanda, Wouldn't you hear that the people of Vṛji gathered together to discuss government affairs and prepare yourselves?",
        "source": "T01n0006_001:0176a25_20"
    },
    {
        "source_sentence": "對曰：「聞其數相聚會，講論政事，修備自守。」",
        "translation": "He said, I've heard that they're assembled to discuss the affairs of government and prepare for self-protection.",
        "source": "T01n0006_001:0176a26_21"
    },
    {
        "source_sentence": "佛言：「如是，彼為不衰，汝聞越祇君臣常和，所任忠良，轉相承用。」",
        "translation": "The Buddha said, So it is, they won't decline; you've heard that the rulers and ministers of Vṛji are always reconciled, and what they do is faithful and serve each other.",
        "source": "T01n0006_001:0176a27_22"
    },
    {
        "source_sentence": "對曰：「聞其君臣常和，所任忠良，轉相承用。",
        "translation": "They said in reply, “We have heard that the ruler and his ministers are always peaceful and loyal to each other.",
        "source": "T01n0006_001:0176a29_23"
    },
    {
        "source_sentence": "汝聞越祇奉法相率，無取無願，不敢有過？」",
        "translation": "Have you heard that Vṛji serves the Dharma as a guide, has no grasping or wishing, and doesn't dare to do anything wrong?",
        "source": "T01n0006_001:0176b01_24"
    },
    {
        "source_sentence": "對曰：「聞其奉法相率，無取無願，不敢有過。」",
        "translation": "He replied, I've heard that they serve the Dharma as their guide, have no grasping or wishing, and don't dare to do anything wrong.",
        "source": "T01n0006_001:0176b02_25"
    },
    {
        "source_sentence": "「汝聞越祇禮化謹敬，男女有別，長幼相事？」",
        "translation": "Have you heard that there's a distinction between men and women, whether old or young, in terms of how they serve each other?",
        "source": "T01n0006_001:0176b03_26"
    },
    {
        "source_sentence": "對曰：「聞其禮化謹敬，男女有別，長幼相事。」",
        "translation": "He said, I've heard that their manner is respectful, that men and women have distinctions, and that the old and young are engaged in mutual affairs.",
        "source": "T01n0006_001:0176b04_27"
    },
    {
        "source_sentence": "「汝聞越祇孝於父母，遜悌師長，受識教誨？」",
        "translation": "Have you heard that Vātsīputrīya is filial to his parents, that he's a humble teacher and elder, and that he receives the instructions of consciousness?",
        "source": "T01n0006_001:0176b05_28"
    },
    {
        "source_sentence": "對曰：「聞其孝於父母，遜悌師長，受識教誨。」",
        "translation": "He said, I've heard that his filial piety is based on his parents, and he's been taught by the consciousnesses.",
        "source": "T01n0006_001:0176b06_29"
    },
    {
        "source_sentence": "「汝聞越祇承天則地，敬畏鬼神，敬順四時？」",
        "translation": "Have you heard that the gods of Vṛji inherit the earth, revere ghosts and spirits, and venerate the four seasons?",
        "source": "T01n0006_001:0176b07_30"
    },
    {
        "source_sentence": "對曰：「聞其承天則地，敬畏鬼神，敬順四時。」",
        "translation": "He said, I've heard that they inherit the gods and earth, revere ghosts and spirits, and venerate the four seasons.",
        "source": "T01n0006_001:0176b08_31"
    },
    {
        "source_sentence": "「汝聞越祇尊奉道德，國有沙門應真及四方來者，供養衣食臥床疾藥？」",
        "translation": "Have you heard that the Bhagavān consecrates morality and that there are ascetics in the country, arhats, and those from the four directions who come to make offerings of clothing, food, bedding, and medicine for illness?",
        "source": "T01n0006_001:0176b09_32"
    },
    {
        "source_sentence": "對曰：「聞其尊奉道德，國有沙門應真及四方來者，供養衣食臥床疾藥。」",
        "translation": "He said, I've heard that his veneration is based on morality, and there are ascetics in the country who come from the four directions to support him with clothing, food, bedding, and medicine for illness.",
        "source": "T01n0006_001:0176b10_33"
    },
    {
        "source_sentence": "佛言：「夫有國者，行此七法，難可得危。」",
        "translation": "The Buddha said, If there's a country that practices these seven things, it's difficult to attain danger.",
        "source": "T01n0006_001:0176b12_34"
    },
    {
        "source_sentence": "雨舍對曰：「使越祇人持一者，尚不可攻，何況有七？",
        "translation": "Śākyamuni said to him, “If the people of Vātsīputrīya maintain one and the other two are the same, we cannot attack them. How much less can we attack those who possess seven?",
        "source": "T01n0006_001:0176b13_35"
    },
    {
        "source_sentence": "國事多故當還。」",
        "translation": "Because there are so many national affairs, I'll return.",
        "source": "T01n0006_001:0176b14_36"
    },
    {
        "source_sentence": "請辭。",
        "translation": "He asked to leave.",
        "source": "T01n0006_001:0176b14_37"
    },
    {
        "source_sentence": "佛言：「可，置知是時。」",
        "translation": "The Buddha said, Yes, let's know when it's the right time.",
        "source": "T01n0006_001:0176b14_38"
    },
    {
        "source_sentence": "即從座起，禮佛而去。",
        "translation": "He rose from his seat, venerated the Buddha, and departed.",
        "source": "T01n0006_001:0176b15_39"
    },
    {
        "source_sentence": "是時，佛勅賢者阿難，請鷂山中諸倚行比丘，令會講堂。",
        "translation": "At the time, the Buddha instructed the good man Ānanda to summon the resting monks on Mount Sumeru and cause them to assemble in a lecture hall.",
        "source": "T01n0006_001:0176b15_40"
    },
    {
        "source_sentence": "即請悉會，[旃-方+示]首畢，一面坐。",
        "translation": "He then invited them to the assembly and, having bowed his head in respect, sat to one side.",
        "source": "T01n0006_001:0176b17_41"
    },
    {
        "source_sentence": "佛告：「諸比丘！",
        "translation": "The Buddha told them, Monks!",
        "source": "T01n0006_001:0176b17_42"
    },
    {
        "source_sentence": "聽我所言，善念行之。」",
        "translation": "Listen to what I say, and be mindful of it.",
        "source": "T01n0006_001:0176b18_43"
    },
    {
        "source_sentence": "皆曰：「受教。」",
        "translation": "They all said, Accept the teaching.",
        "source": "T01n0006_001:0176b18_44"
    },
    {
        "source_sentence": "佛言：「比丘有七教，則法不衰。",
        "translation": "The Buddha said, If a monk has seven teachings, then the Dharma won't decline.",
        "source": "T01n0006_001:0176b18_45"
    },
    {
        "source_sentence": "何等七教？",
        "translation": "What are these seven teachings?",
        "source": "T01n0006_001:0176b19_46"
    },
    {
        "source_sentence": "一當數會講誦經道，無有懈怠。",
        "translation": "One, he should recite the sūtras and paths repeatedly in assemblies without laziness.",
        "source": "T01n0006_001:0176b19_47"
    },
    {
        "source_sentence": "二當和順，忠正相教，轉相承用。",
        "translation": "The second is that they should be harmonious, faithful and correct in their teachings, and mutually beneficial in their use.",
        "source": "T01n0006_001:0176b20_48"
    },
    {
        "source_sentence": "三當無取無願於他，唯樂山澤。",
        "translation": "Third, there should be no grasping and no wishing for others, but only the pleasure of mountains and swamps.",
        "source": "T01n0006_001:0176b21_49"
    },
    {
        "source_sentence": "四當絕望長幼先後，相事以禮。",
        "translation": "Fourth, they should cut off hopes that the old and young will precede each other and venerate each other in terms of service.",
        "source": "T01n0006_001:0176b22_50"
    },
    {
        "source_sentence": "五當慈孝承事師長，受識教誨。",
        "translation": "Fifth, they should be compassionate and filial to their teachers and elders and receive the instruction of consciousness.",
        "source": "T01n0006_001:0176b22_51"
    },
    {
        "source_sentence": "六當奉法，敬畏經戒，以修梵行。",
        "translation": "Sixth, they should revere the Dharma and venerate the scriptures and precepts in order to cultivate the religious practice.",
        "source": "T01n0006_001:0176b23_52"
    },
    {
        "source_sentence": "七當遵道供養聖眾，開解童蒙，來學者受給施衣、食、臥床、疾藥。",
        "translation": "Seven, they should follow the path to make offerings to the noble multitude, disclose the boy's enlightenment, and allow scholars to receive gifts of clothing, food, bedding, and medicine for illness.",
        "source": "T01n0006_001:0176b24_53"
    },
    {
        "source_sentence": "如是七法，可得久住。",
        "translation": "These are the seven things that can abide for a long time.",
        "source": "T01n0006_001:0176b25_54"
    },
    {
        "source_sentence": "「又比丘有七守，則法不衰，當善念行：一守清淨，不樂有為。",
        "translation": "Again, a monk has seven ways to keep the teaching from decaying should be well-contemplated and practiced. The first is to keep the teaching pure and not rely on conditioned things.",
        "source": "T01n0006_001:0176b26_55"
    },
    {
        "source_sentence": "二守無欲，不貪利養。",
        "translation": "The second is to guard the absence of desire and not covet profit.",
        "source": "T01n0006_001:0176b27_56"
    },
    {
        "source_sentence": "三守忍辱，無所諍訟。",
        "translation": "Third, he observes tolerance and forbearance without dispute.",
        "source": "T01n0006_001:0176b28_57"
    },
    {
        "source_sentence": "四守空行，不入眾聚。",
        "translation": "Fourth, he guards his practice of emptiness and doesn't enter the crowd.",
        "source": "T01n0006_001:0176b28_58"
    },
    {
        "source_sentence": "五守法意，不起眾想。",
        "translation": "Five, he guards the mind of the Dharma and doesn't give rise to all thoughts.",
        "source": "T01n0006_001:0176b29_59"
    },
    {
        "source_sentence": "六守一心，坐禪定意。",
        "translation": "Sixth, he guards his single mind with the intention of sitting in meditation.",
        "source": "T01n0006_001:0176b29_60"
    },
    {
        "source_sentence": "七守約損，衣食麁踈，草蓐為床。",
        "translation": "Seven, it's a violation of the precepts, with food and clothing being burned and grass being used as a bed.",
        "source": "T01n0006_001:0176c01_61"
    },
    {
        "source_sentence": "如是七法，可得久住。",
        "translation": "These are the seven things that can abide for a long time.",
        "source": "T01n0006_001:0176c01_62"
    },
    {
        "source_sentence": "「又比丘有七敬，則法不衰，當善念行：一為敬佛，善心禮事，無他倚行。",
        "translation": "Again, a monk who has seven kinds of reverence so that the Dharma won't decline should practice with good mindfulness: first, venerating the Buddha; second, serving him wholeheartedly; and third, practicing without relying on others.",
        "source": "T01n0006_001:0176c02_63"
    },
    {
        "source_sentence": "二為敬法，志在道意，無他倚行。",
        "translation": "The second is to venerate the Dharma, aspire to the path with the intention of enlightenment, and practice without other supports.",
        "source": "T01n0006_001:0176c04_64"
    },
    {
        "source_sentence": "三為敬眾，依受教令，無他倚行。",
        "translation": "Three, in order to honor the congregation, they rely on receiving instruction and have no other basis for their practice.",
        "source": "T01n0006_001:0176c04_65"
    },
    {
        "source_sentence": "四為敬學，事持戒者，無他倚行。",
        "translation": "Fourth, it's for the sake of respect and training, serving those who observe precepts without relying on others.",
        "source": "T01n0006_001:0176c05_66"
    },
    {
        "source_sentence": "五為敬聞，事講授者，無他倚行。",
        "translation": "The fifth is to respectfully hear and serve those who teach, so there's no other to rely on.",
        "source": "T01n0006_001:0176c06_67"
    },
    {
        "source_sentence": "六為敬淨無欲，無他倚行。",
        "translation": "The sixth is to honor and purify the absence of desire and lack other-dependent action.",
        "source": "T01n0006_001:0176c07_68"
    },
    {
        "source_sentence": "七為敬定，事坐禪寂，無他倚行。",
        "translation": "The seventh is the practice of reverent concentration, where one serves and sits in meditative absorption without resting or walking with others.",
        "source": "T01n0006_001:0176c07_69"
    },
    {
        "source_sentence": "如是七法，可得久住。",
        "translation": "These are the seven things that can abide for a long time.",
        "source": "T01n0006_001:0176c08_70"
    },
    {
        "source_sentence": "「又比丘有七財，則法不衰，當善念行：一當有信，見正喜樂。",
        "translation": "Again, a monk who has seven possessions so that the Dharma won’t decline should practice with good mindfulness: first, he should have faith and be rightly delighted when he sees.",
        "source": "T01n0006_001:0176c08_71"
    },
    {
        "source_sentence": "二當有戒，慎護不犯，三當有慚，改過自悔。",
        "translation": "Two, there should be precepts that are guarded with caution and not violated, and three, there should be shame and repentance for one's faults.",
        "source": "T01n0006_001:0176c10_72"
    },
    {
        "source_sentence": "四當有愧，順所言行。",
        "translation": "Fourth, one should be ashamed and act in accordance with what is said.",
        "source": "T01n0006_001:0176c11_73"
    },
    {
        "source_sentence": "五當多聞，諷誦無厭。",
        "translation": "Five, they should hear much and recite it without tire.",
        "source": "T01n0006_001:0176c11_74"
    },
    {
        "source_sentence": "六當智慧，深行微妙。",
        "translation": "Sixth, it should be the depth of wisdom and subtlety of practice.",
        "source": "T01n0006_001:0176c12_75"
    },
    {
        "source_sentence": "七當法施，勿望禮貺。",
        "translation": "Seven, you should bestow the Dharma without expecting to pay homage.",
        "source": "T01n0006_001:0176c12_76"
    },
    {
        "source_sentence": "如是七法，可得久住。",
        "translation": "These are the seven things that can abide for a long time.",
        "source": "T01n0006_001:0176c13_77"
    },
    {
        "source_sentence": "「又比丘有七覺意，則法不衰，當善念行：一志念覺倚淨無淫，捨分散意。",
        "translation": "Again, a monk who has seven awakening intentions so that the Dharma won't weaken should practice with good mindfulness: single-mindedly awakening to rely on purity and absence of sexual misconduct and abandoning distracting thoughts.",
        "source": "T01n0006_001:0176c13_78"
    },
    {
        "source_sentence": "二法解覺倚淨無淫，捨分散意。",
        "translation": "The second is the awakening to understanding the Dharma that relies on purity and absence of sexual misconduct and abandons distracted thought.",
        "source": "T01n0006_001:0176c15_79"
    },
    {
        "source_sentence": "三精進覺倚淨無淫，捨分散意。",
        "translation": "The third is the awakening to exertion, which relies on purity and non-conduct and abandons distracted thought.",
        "source": "T01n0006_001:0176c16_80"
    },
    {
        "source_sentence": "四愛喜覺倚淨無淫，捨分散意。",
        "translation": "Fourth, the awakening to craving and joy relies on purity and non-conduct, abandoning distracted thoughts.",
        "source": "T01n0006_001:0176c16_81"
    },
    {
        "source_sentence": "五一向覺倚淨無淫，捨分散意。",
        "translation": "Five, he always perceives the pure absence of sexual misconduct and abandons distracting thoughts.",
        "source": "T01n0006_001:0176c17_82"
    },
    {
        "source_sentence": "六惟定覺倚淨無淫，捨分散意。",
        "translation": "Sixth, he only relies on the awakening of concentration to rely on purity without sexual desire and abandons distracted thoughts.",
        "source": "T01n0006_001:0176c18_83"
    },
    {
        "source_sentence": "七行護覺倚淨無淫，捨分散意。",
        "translation": "The seventh practice is to guard the awakening, rely on purity and non-conduct, and abandon distracted thought.",
        "source": "T01n0006_001:0176c19_84"
    },
    {
        "source_sentence": "如是七法，可得久住。",
        "translation": "These are the seven things that can abide for a long time.",
        "source": "T01n0006_001:0176c20_85"
    },
    {
        "source_sentence": "「又比丘有七知，則法不衰，當善念行：一當知法，佛十二部經，諦受誦論。",
        "translation": "Again, a monk has seven knowledges that the Dharma won’t decline if he well-understands them. First, he should know the Dharma; he should recite and study the twelve kinds of scriptures taught by the Buddha.",
        "source": "T01n0006_001:0176c20_86"
    },
    {
        "source_sentence": "二當知議，求諸法慧，博解其要。",
        "translation": "Second, you should know and discuss the wisdom of seeking the teachings and extensively understand their essentials.",
        "source": "T01n0006_001:0176c22_87"
    },
    {
        "source_sentence": "三當知時，可誦可步可禪可臥，無失時宜。",
        "translation": "Third, you should know that it's a good idea to recite it, walk up and meditate, and lie down at the right time without losing time.",
        "source": "T01n0006_001:0176c23_88"
    },
    {
        "source_sentence": "四當自知，所入法行，多少深淺，熟與初始，志當曰勝。",
        "translation": "Fourth, you should know for yourself the depth and depth of the practice of the Dharma that you have entered, its maturation and beginning, and the intention to be superior.",
        "source": "T01n0006_001:0176c24_89"
    },
    {
        "source_sentence": "五當知節，勿貪美妙，適身節食，無以自病。",
        "translation": "Fifth, you should know moderation and not crave delicious foods. You should eat moderation appropriately to your body; there is no way to get sick by yourself.",
        "source": "T01n0006_001:0176c25_90"
    },
    {
        "source_sentence": "六當知眾，入比丘眾，梵志聖人，君子及士民眾分別知可敬、可住、可坐、可默、可語。",
        "translation": "Sixth, you should know that the assembly enters into the assembly of monks, which consists of priests, sages, brahmins, gentlemen, and men who discern what they venerate, what they can stand, what they can sit, what they can be silent about, and what they can say.",
        "source": "T01n0006_001:0176c26_91"
    },
    {
        "source_sentence": "七當知人，觀其所好，察其志能，隨意勸導，令知聖化。",
        "translation": "Seven, you should know that a person observes what’s good for him, examines his aspirations and abilities, encourages and guides them as he wishes, so that he knows the noble teaching.",
        "source": "T01n0006_001:0176c28_92"
    },
    {
        "source_sentence": "如是七法，可得久住。",
        "translation": "These are the seven things that can abide for a long time.",
        "source": "T01n0006_001:0176c29_93"
    },
    {
        "source_sentence": "「又比丘有七惟，則法不衰，當善念行：一惟經道，當如人念父母，父母生子，",
        "translation": "Again, bhikṣus, there are seven principles that keep the dharma from declining. They should be practiced with good mindfulness:",
        "source": "T01n0006_001:0177a01_94"
    },
    {
        "source_sentence": "思極一世，惟法活人，無數世度人生死。",
        "translation": "At the end of the thought, there's only one time when the Dharma is alive, and countless lives are saved by birth and death in countless times.",
        "source": "T01n0006_001:0177a02_95"
    },
    {
        "source_sentence": "二惟人生，無不有苦，憂念妻之家屬所有，死各離散不知所墮，若身有罪，",
        "translation": "The second is only birth, which has no non-existence and no suffering. He grieves for the existence of his wife and all the things that belong to her family. When he dies, they are separated from each other and do not know where he will fall.",
        "source": "T01n0006_001:0177a03_96"
    },
    {
        "source_sentence": "親不能解，知此非常，當念行道。",
        "translation": "If you can't understand it directly, know that this is extraordinary, and you should mindfully practice the path.",
        "source": "T01n0006_001:0177a05_97"
    },
    {
        "source_sentence": "三惟精進，端身口意，取道不難。",
        "translation": "Third, he should exert himself sparing no effort; his body, speech, and thought should be disciplined so that it is not difficult to follow the path.",
        "source": "T01n0006_001:0177a06_98"
    },
    {
        "source_sentence": "四惟謙虛，無自憍大，承事明哲，矜誨未聞，愍傷教之。",
        "translation": "Fourth, he should be humble and modest, not self-indulgent. He should serve the wise and learned without taking pride in his greatness or arrogance. Being ashamed of what he has not heard, he pities those who have been taught with compassion.",
        "source": "T01n0006_001:0177a07_0"
    },
    {
        "source_sentence": "五惟降意，不馳六情，抑淫怒癡態，無有邪行。",
        "translation": "Five, he simply subdues his mind and doesn't chase the six emotions, suppresses lust, anger, and delusion, and has no wrong actions.",
        "source": "T01n0006_001:0177a08_1"
    },
    {
        "source_sentence": "六惟軀中，但盛臭穢，風寒熱血，無可貪者。",
        "translation": "Sixth, it's just that the body is full of foul odor and bad smell, and there's no craving for wind, cold, heat, or blood.",
        "source": "T01n0006_001:0177a09_2"
    },
    {
        "source_sentence": "七惟自觀，形如糞土，日當念死，天地開闢，生民以來，無不死者，世間如夢，",
        "translation": "Seventh, he observes for himself that his body is shaped like dung and dirt. Every day he thinks of the world as a dream in which heaven and earth are enlightened and all living beings are born without fail.",
        "source": "T01n0006_001:0177a10_3"
    },
    {
        "source_sentence": "所見歡愛，不知為化，悟乃覺空，當知是幻，勿以自欺。",
        "translation": "Being delighted at what he sees, he doesn't know that it's a transformation, and realizing it is emptiness, you should know that it's an illusion, so don't deceive yourself.",
        "source": "T01n0006_001:0177a12_4"
    },
    {
        "source_sentence": "如是七法，可得久住。",
        "translation": "These are the seven things that can abide for a long time.",
        "source": "T01n0006_001:0177a13_5"
    },
    {
        "source_sentence": "「又比丘復有六重法，當善念行，可得久住：一為修身，以起慈心，依聖旬通，",
        "translation": "Again, bhikṣus, there are another six principles by which a bhikṣu should be well-maintained and practiced so as to enable him to remain [in the Pure Land] for a long time:",
        "source": "T01n0006_001:0177a13_6"
    },
    {
        "source_sentence": "諸清淨者，行此重任，和一愛敬，施於同學，無取無諍，勉共守行行。",
        "translation": "Pure people practice this heavy duty, harmonize with one love and respect, give it to fellow students, don't take it or dispute it, and strive together to guard their practice.",
        "source": "T01n0006_001:0177a15_7"
    },
    {
        "source_sentence": "二為修口善行，以起慈心。",
        "translation": "The second is to cultivate good verbal actions in order to give rise to a mind of kindness.",
        "source": "T01n0006_001:0177a17_8"
    },
    {
        "source_sentence": "三為修意善行，以起慈心。",
        "translation": "The third is to cultivate good intentions and practices in order to give rise to a mind of kindness.",
        "source": "T01n0006_001:0177a17_9"
    },
    {
        "source_sentence": "四為所見法際，若得衣食、應器餘物，終不愛藏。",
        "translation": "Fourth, it's because he sees the limit of the Dharma, and if he obtains clothing, food, a container, or other things, he never loves to hide them.",
        "source": "T01n0006_001:0177a18_10"
    },
    {
        "source_sentence": "五為持戒不犯，不以摸質，能用勸人。",
        "translation": "The fifth is to observe the precepts without violating them and not touch their quality, so that they can be used to encourage others.",
        "source": "T01n0006_001:0177a19_11"
    },
    {
        "source_sentence": "六為若從正見得出正要受道苦盡度知見了，行此重任，皆以聖旬通清淨用和愛敬，",
        "translation": "Sixth, if they attain liberation from right view and receive the path of righteousness, experience the extinction of suffering in the path of liberation, know and perceive it, and practice this heavy duty, all with noble zeal, penetrating purity, using harmony, love, respect, and reverence.",
        "source": "T01n0006_001:0177a20_12"
    },
    {
        "source_sentence": "施於同道，無取無諍，轉相建立，共守道行。",
        "translation": "Giving is the same as the path, with no grasping and no anger, established in mutual dependence, and shared in the practice of guarding the path.",
        "source": "T01n0006_001:0177a22_13"
    },
    {
        "source_sentence": "又復比丘，當為愍傷，一切蠕動，至於蟣蝨，必加慈心，人之死亡，當為悲哀，",
        "translation": "Again, the bhikṣu should feel compassion for all those wriggling creatures who die from their wriggling movements and so forth, as many as there are lice in the wilderness.",
        "source": "T01n0006_001:0177a23_14"
    },
    {
        "source_sentence": "彼得為人，如不聞道，家室啼哭，亦不知死，魂神所趣；",
        "translation": "Like a man who does not hear the [Buddhist] Way, his householders cry in distress and do not know where he is about to die.",
        "source": "T01n0006_001:0177a25_15"
    },
    {
        "source_sentence": "唯得道者，能知之耳。",
        "translation": "Only someone who has attained the Way can know it.",
        "source": "T01n0006_001:0177a26_16"
    },
    {
        "source_sentence": "佛為是故敷陳經法，經不可不學，道不可不行，天下多道，王道為大，",
        "translation": "For this reason the Buddha expounds scriptures and teachings, saying: “There is no scripture that should not be studied; there is no doctrine that should not be practiced. There are many doctrines in the realm under heaven but the kingly path is the great one.",
        "source": "T01n0006_001:0177a27_17"
    },
    {
        "source_sentence": "佛道如是，最為其上。",
        "translation": "The Buddha Way is like this, foremost of all.",
        "source": "T01n0006_001:0177a28_18"
    },
    {
        "source_sentence": "譬數十人，俱共射准，有前中者，有後中者，要射不止，必復中准，又如天下眾流不息皆歸于海。",
        "translation": "It's like a group of dozens of people who all share the same marksmanship, with the one who goes before and the one who goes after. If he doesn't stop firing, he'll surely go back to his marksmanship; it's like the many streams in the world that don't stop flowing and all return to the ocean.",
        "source": "T01n0006_001:0177a29_19"
    },
    {
        "source_sentence": "比丘如此，行道不止，會得解脫，如佛法教，轉相承用，諷詠佛語，常用時誨，",
        "translation": "In the same way, a bhikṣu does not cease his practice of the path; he attains liberation at the same time. According to the Buddha’s teaching and in accordance with the Buddha’s doctrine, they are mutually reinforcing, reciting the Buddha’s words while chanting them one after another, always giving instruction according to the [proper] season.",
        "source": "T01n0006_001:0177b02_20"
    },
    {
        "source_sentence": "四輩弟子，展轉相教，如是佛經，可得久住。」",
        "translation": "The four groups of disciples teach each other in turn, and thus the Buddha's sūtras can abide for a long time.",
        "source": "T01n0006_001:0177b04_21"
    },
    {
        "source_sentence": "彼時，佛請賢者阿難，俱之巴連弗邑，即受教行。",
        "translation": "At that time the Buddha invited Venerable Ānanda, accompanied by Paranirmita-vaśavartin, to take up his instruction and practice.",
        "source": "T01n0006_001:0177b05_22"
    },
    {
        "source_sentence": "佛攝衣鉢，歷王舍城，去行半道所，頓止王園。",
        "translation": "The Buddha gathered his robes and bowl, traveled halfway through the city of Rājagṛha, and stopped at the royal park.",
        "source": "T01n0006_001:0177b06_23"
    },
    {
        "source_sentence": "佛告諸比丘：「皆聽，其為道者，當知四諦，凡人不知，故走長塗，宛轉生死，",
        "translation": "The Buddha said to the monks: All of you, listen attentively. Those who follow the path should know the four noble truths. Ordinary people do not know them; therefore, they walk a long distance and are constantly subject to birth-and-death.",
        "source": "T01n0006_001:0177b07_24"
    },
    {
        "source_sentence": "無休止時，吾是以啟汝意。",
        "translation": "When there's no rest, I want to reveal what you think.",
        "source": "T01n0006_001:0177b09_25"
    },
    {
        "source_sentence": "何等四？",
        "translation": "What are these four?",
        "source": "T01n0006_001:0177b09_26"
    },
    {
        "source_sentence": "一曰知苦苦，是謂真諦。",
        "translation": "The first is knowledge of suffering as suffering. This is the true truth.",
        "source": "T01n0006_001:0177b09_27"
    },
    {
        "source_sentence": "二曰苦由習生，是謂真諦。",
        "translation": "The second is that suffering arises from accumulation, which is called the true truth.",
        "source": "T01n0006_001:0177b10_28"
    },
    {
        "source_sentence": "三曰苦習盡滅，是謂真諦。",
        "translation": "The third is the extinction of the accumulation of suffering, which is called the true truth.",
        "source": "T01n0006_001:0177b11_29"
    },
    {
        "source_sentence": "四曰苦習盡受道，是謂真諦。",
        "translation": "The fourth, the path of ending the accumulation of suffering and entering nirvāṇa, is called the true truth.",
        "source": "T01n0006_001:0177b11_30"
    },
    {
        "source_sentence": "於苦不慧不知，故走長塗，生死不休，當以知此苦諦。",
        "translation": "Because he doesn't know the wisdom of suffering and doesn't know it, he walks through a long period of birth-and-death without stopping, so he should know this truth of suffering.",
        "source": "T01n0006_001:0177b12_31"
    },
    {
        "source_sentence": "苦者謂生苦、老苦、病苦、死苦、憂悲惱苦、愛別離苦、所求不得苦；",
        "translation": "“Suffering” means the suffering of birth, the suffering of old age, the suffering of sickness, the suffering of death, the suffering of sorrow and vexation, the suffering of separation from loved ones, and the suffering of not getting what one wishes.",
        "source": "T01n0006_001:0177b13_32"
    },
    {
        "source_sentence": "以要言之，五盛陰苦。",
        "translation": "To sum up, the five flourishing aggregates are painful.",
        "source": "T01n0006_001:0177b15_33"
    },
    {
        "source_sentence": "已覺斯苦，能斷愛習，是謂得眼，為極是生，後不復有苦；",
        "translation": "Having perceived this kind of suffering, one is able to eliminate the habit of clinging. This is reckoned to be the attainment of vision. At its peak it is arising and there is no more suffering afterwards.",
        "source": "T01n0006_001:0177b15_34"
    },
    {
        "source_sentence": "猶習者從愛，苦習都盡，受道之諦，得眼見證，為盡是生，後不復有。",
        "translation": "It is just as when the condition arises from craving and all the accumulations of suffering are exhausted. When one receives the truth of the path, he acquires the eye to see and experience it. To be exhausted is birth; later there is no more existence.",
        "source": "T01n0006_001:0177b17_35"
    },
    {
        "source_sentence": "已見真諦，得道眼者，無復生死，長塗永絕。",
        "translation": "Those who have seen the true truth and attained the eye of enlightenment will no longer experience birth and death, and their long-abiding defilement will be permanently eliminated.",
        "source": "T01n0006_001:0177b18_36"
    },
    {
        "source_sentence": "如是比丘，又當復知道得八行。",
        "translation": "Thus, monks, you should also know that you've attained eight practices.",
        "source": "T01n0006_001:0177b19_37"
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T01n0006_001:0177b20_38"
    },
    {
        "source_sentence": "一以專心，受佛經法。",
        "translation": "One, they concentrate their minds to receive the teachings of the Buddha's sūtras and teachings.",
        "source": "T01n0006_001:0177b20_39"
    },
    {
        "source_sentence": "二棄愛欲，與世無諍。",
        "translation": "The second is to abandon craving and desire and have no quarrel with the world.",
        "source": "T01n0006_001:0177b21_40"
    },
    {
        "source_sentence": "三終不為殺、盜、婬行。",
        "translation": "Three, they never engage in killing, stealing, or sexual misconduct.",
        "source": "T01n0006_001:0177b21_41"
    },
    {
        "source_sentence": "四不欺讒侫飾惡罵。",
        "translation": "Fourth, they won't deceive others and decorate themselves with bad words.",
        "source": "T01n0006_001:0177b22_42"
    },
    {
        "source_sentence": "五不嫉妬貪餮不信。",
        "translation": "Five, they aren't jealous, greedy, and unfaithful.",
        "source": "T01n0006_001:0177b22_43"
    },
    {
        "source_sentence": "六念非常、苦、空、非身。",
        "translation": "Sixth, mindfulness of impermanence, suffering, emptiness, and non-body.",
        "source": "T01n0006_001:0177b23_44"
    },
    {
        "source_sentence": "七觀形中臭穢不淨。",
        "translation": "Seven, he observes that the form is fragrant and impure in form.",
        "source": "T01n0006_001:0177b23_45"
    },
    {
        "source_sentence": "八不貪身知當歸土。",
        "translation": "Eight, he doesn't crave the body and knows that he'll return to the land.",
        "source": "T01n0006_001:0177b24_0"
    },
    {
        "source_sentence": "諸往古佛，皆見此四諦，諸當來佛，亦見此四諦，其有貪慕家居恩愛及樂世間榮名之壽者，",
        "translation": "The ancient buddhas of the past all saw these four truths. All future buddhas also saw these four truths. Those who longed for home, love and delight in worldly prosperity (i.e., longevity).",
        "source": "T01n0006_001:0177b24_1"
    },
    {
        "source_sentence": "終不得是度世之道；",
        "translation": "They will never attain the path of worldly salvation.",
        "source": "T01n0006_001:0177b26_2"
    },
    {
        "source_sentence": "道從心生，心淨者乃得道。",
        "translation": "The path arises from the mind, and when the mind is pure, it attains the path.",
        "source": "T01n0006_001:0177b27_0"
    },
    {
        "source_sentence": "其次心端，不犯五戒，可得上天；",
        "translation": "At the end of the second thought, if one does not violate the five precepts he can be reborn in heaven.",
        "source": "T01n0006_001:0177b27_1"
    },
    {
        "source_sentence": "其次信道，好學經法，後可得作人。",
        "translation": "Next, he believed in the Way and liked to study the scriptures and teachings. Later he could become a monk.",
        "source": "T01n0006_001:0177b28_2"
    },
    {
        "source_sentence": "若都欲斷絕地獄、畜生、餓鬼道者，當以一心，奉行經戒。",
        "translation": "If you all want to end the hells, animals, and hungry ghost realms, you must whole-heartedly practice the sūtras and precepts with one mind.",
        "source": "T01n0006_001:0177b29_3"
    },
    {
        "source_sentence": "今佛為天下，解脫生死，開現正道，其欲學者，當諦思惟。」",
        "translation": "Now, for the sake of the world, the Buddha has liberated sentient beings from birth and death and revealed the right path, so those who want to study it should consider it carefully.",
        "source": "T01n0006_001:0177c01_4"
    },
    {
        "source_sentence": "佛與賢者阿難，前到巴連弗，止城外神樹下。",
        "translation": "The Buddha and the venerable Ānanda went to Pāliputra and stopped at the foot of a sacred tree outside the city.",
        "source": "T01n0006_001:0177c02_5"
    },
    {
        "source_sentence": "諸梵志居士，聞佛從諸弟子來，皆出城外，欲覲見供養佛，有持席薦，",
        "translation": "When the brahmin householders heard that the Buddha had come from among his disciples, they all went out of the city. Wishing to see him and make offerings to him, they offered them seats [to him].",
        "source": "T01n0006_001:0177c03_6"
    },
    {
        "source_sentence": "有持毾[毯-炎+登]，有持水漿，及錠燈者，行詣佛所，稽首畢一面坐。",
        "translation": "Someone holding a woolen blanket, some holding water, juice, and a blindfolded lamp approached the Buddha. They bowed their heads in respect and sat to one side.",
        "source": "T01n0006_001:0177c05_7"
    },
    {
        "source_sentence": "佛告諸梵志居士：「人在世間，好貪欲恣意者，有五消耗：一自放恣，",
        "translation": "The Buddha told the priests and householders, In the world, there are five kinds of consumption for people who like craving and desire to indulge in sexual indulgence:",
        "source": "T01n0006_001:0177c06_8"
    },
    {
        "source_sentence": "財產日減。",
        "translation": "Their property decreased day by day.",
        "source": "T01n0006_001:0177c08_9"
    },
    {
        "source_sentence": "二自放恣，危身失道。",
        "translation": "The second is self-indulgence, which endangers oneself and loses the path.",
        "source": "T01n0006_001:0177c08_10"
    },
    {
        "source_sentence": "三自放恣，眾人不敬，死時有悔。",
        "translation": "The third is self-indulgence, which is disrespected by the people and has regrets at the time of death.",
        "source": "T01n0006_001:0177c09_11"
    },
    {
        "source_sentence": "四自放恣，醜名惡聲，周聞天下。",
        "translation": "The fourth is self-indulgence, which has an ugly name and bad reputation and is heard throughout the world.",
        "source": "T01n0006_001:0177c09_12"
    },
    {
        "source_sentence": "五自放恣，身死魂神墮三惡道，人能降心。",
        "translation": "Five are self-inflicted, and their bodies die and spirits fall into the three bad destinies, so people can subdue their minds.",
        "source": "T01n0006_001:0177c10_13"
    },
    {
        "source_sentence": "不放恣者，有五豐德：一自撿攝，財產日增。",
        "translation": "Someone who doesn't let go of the rules has five abundant virtues: first, he collects his own possessions and their wealth increases day by day.",
        "source": "T01n0006_001:0177c11_14"
    },
    {
        "source_sentence": "二自撿攝，得近道意。",
        "translation": "The second is to gather it on one's own and attain the intention to follow the path.",
        "source": "T01n0006_001:0177c12_15"
    },
    {
        "source_sentence": "三自撿攝，眾人所敬，至死無悔。",
        "translation": "Three, he collected himself and was respected by the people until his death without regret.",
        "source": "T01n0006_001:0177c13_16"
    },
    {
        "source_sentence": "四自撿攝，好名善譽，周聞天下。",
        "translation": "Fourth, he collected and collected the relics himself. Being fond of fame and good repute, he was widely renowned in the world.",
        "source": "T01n0006_001:0177c13_17"
    },
    {
        "source_sentence": "五自撿攝，身死神生天上福地。",
        "translation": "Fifth, when he collects it himself, his body dies and the spirit is born in a heavenly blessed place.",
        "source": "T01n0006_001:0177c14_18"
    },
    {
        "source_sentence": "人不自恣，有此五善，宜思念之。」",
        "translation": "A person who doesn't self-restraint has these five good qualities, so it's appropriate to consider them.",
        "source": "T01n0006_001:0177c15_19"
    },
    {
        "source_sentence": "佛為眾人說法正化若干要語，無不歡喜，皆前稽首佛足，繞三匝而去。",
        "translation": "The Buddha taught the Dharma, correctly transforming [the minds of sentient beings] in a number of essential ways for them. They all rejoiced and bowed their heads at the Buddha’s feet, circumambulated him three times, and departed.",
        "source": "T01n0006_001:0177c16_20"
    },
    {
        "source_sentence": "於是，佛起，到阿衛陬，坐一樹下，持神心道眼，見上諸天，使賢神守護此地。",
        "translation": "Then the Buddha arose, went to Āvīci, sat under a tree, maintained his supernormal power of mind and eye of enlightenment, and saw the gods above him. He instructed the good deities to guard this place.",
        "source": "T01n0006_001:0177c17_21"
    },
    {
        "source_sentence": "賢者阿難，從燕坐起，稽首畢一面住。",
        "translation": "Good man Ānanda rose from his seat in Sāvatthī. After paying respect with his head [to the Buddha], he remained off to one side.",
        "source": "T01n0006_001:0177c19_22"
    },
    {
        "source_sentence": "佛問阿難：「誰圖此巴連弗起城郭者？」",
        "translation": "The Buddha asked Ānanda, Who intends to build a city here in Pāṭaliputra?",
        "source": "T01n0006_001:0177c20_23"
    },
    {
        "source_sentence": "對曰：「是摩竭大臣雨舍所建，所其欲以遏絕越祇。」",
        "translation": "He said, This is the rain dwelling built by the minister of Magadha, and whatever he wants to stop transgressions should be done.",
        "source": "T01n0006_001:0177c21_24"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T01n0006_001:0177c22_25"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T01n0006_001:0177c22_26"
    },
    {
        "source_sentence": "雨舍之賢，乃知圖此。",
        "translation": "The wise monks of the rainy dwelling knew this story.",
        "source": "T01n0006_001:0177c22_27"
    },
    {
        "source_sentence": "吾見忉利諸神妙天，共持此地，其有土地為天神所護，必安且貴。",
        "translation": "I've seen the gods of Trāyastriṃśa gods and marvelous gods holding this land together, and if there's land that's protected by gods and goddesses, it's sure to be peaceful and valuable.",
        "source": "T01n0006_001:0177c23_28"
    },
    {
        "source_sentence": "又此地者，近天之中，主此地神，名曰人意，人意所護，其國久而益勝，",
        "translation": "In addition, the goddess of this land is called human intention. Herd by human intention and protected by human intention, that kingdom grows in strength over time.",
        "source": "T01n0006_001:0177c24_29"
    },
    {
        "source_sentence": "必多聖賢仁智豪俊，餘國弗及，亦莫能壞。",
        "translation": "There must be many saints, good men, and people of great intelligence and wisdom. The other kingdoms are unable to match them and cannot harm them.",
        "source": "T01n0006_001:0177c26_30"
    },
    {
        "source_sentence": "此城久久，如欲壞時，當以三事：一者大火，二者大水，三者中人與外人謀，",
        "translation": "For a long time the city will be like this. When it is about to disintegrate, there are three things: first, great fire; second, great flooding; and third, schism between the inhabitants and the outsiders.",
        "source": "T01n0006_001:0177c27_31"
    },
    {
        "source_sentence": "乃壞此城。」",
        "translation": "This city will then be destroyed.",
        "source": "T01n0006_001:0177c29_32"
    },
    {
        "source_sentence": "雨舍聞佛與眾弟子俱遊到此，即乘王威嚴車五百乘，出城欲覲見供養佛。",
        "translation": "When Rāṣṭrapāla heard that the Buddha and his disciples had arrived here, he rode out of the city in the king's majestic chariot with five hundred carriages to see and make offerings to the Buddha.",
        "source": "T01n0006_001:0177c29_33"
    },
    {
        "source_sentence": "到即下車，步入園門，見佛歡喜，貌色恭辭，氣重揖讓畢一面坐。",
        "translation": "When he arrived, he dismounted from his carriage and entered the garden gate on foot. Seeing the Buddha, he was delighted to see him. His features were dignified and respectful; after bowing with a heavy air, he sat down to one side.",
        "source": "T01n0006_001:0178a02_34"
    },
    {
        "source_sentence": "佛為說法正化若干要語，雨舍歡喜，乃避坐言：「欲設微食，願與聖眾俱屈威神。」",
        "translation": "The Buddha taught the Dharma for him, correctly transformed himself in several essentials, and raised his rainbow with joy, he avoided his seat and said, I want to set up a small meal, wishing to join the noble ones in submitting to their authority.",
        "source": "T01n0006_001:0178a03_35"
    },
    {
        "source_sentence": "佛以默如可之。",
        "translation": "The Buddha allowed him to do so by remaining silent.",
        "source": "T01n0006_001:0178a05_36"
    },
    {
        "source_sentence": "即起稽首，繞佛三匝而歸。",
        "translation": "He then got up, bowed his head, circumambulated the Buddha three times, and returned.",
        "source": "T01n0006_001:0178a05_37"
    },
    {
        "source_sentence": "大臣歸，乃通夜具作好食嚴室，內施牀座。",
        "translation": "When the minister returned home, he prepared all the necessary necessities for the night and made a finely decorated room with seats and cushions.",
        "source": "T01n0006_001:0178a06_38"
    },
    {
        "source_sentence": "早行白佛：「食具已辦，唯聖知時。」",
        "translation": "Early in the morning, he said to the Buddha, The food preparations have been prepared, but only the sage knows the time.",
        "source": "T01n0006_001:0178a07_39"
    },
    {
        "source_sentence": "佛即攝衣持鉢，與眾弟子俱到其舍，就高座於眾前坐，雨舍手自斟酌[酉*典]美奉鉢致漿，",
        "translation": "The Buddha then gathered his robes, took his bowl, and arrived at the monastery accompanied by his disciples. He sat on a raised seat in front of the congregation, poured wine with his hand over his almsbowl to offer it to the venerable bhikṣu [you*典] who was presenting him with an almsbowl and juice.",
        "source": "T01n0006_001:0178a08_40"
    },
    {
        "source_sentence": "行澡水畢，住白佛言：「已所施福，願佛呪願，此國士民，一切天人，",
        "translation": "When the water had been boiled, he stayed and said to the Buddha: The blessedness that you have bestowed upon us is due to the vow of the Buddha’s incantations. All the citizens of this country and all the gods and human beings who live therein will not be able to repay your kindness.",
        "source": "T01n0006_001:0178a10_41"
    },
    {
        "source_sentence": "使長得安。」",
        "translation": "That way, they'll always attain peace.",
        "source": "T01n0006_001:0178a11_42"
    },
    {
        "source_sentence": "佛呪願言：「佛助爾喜，為天人供養，土民作導，飯佛比丘僧，稱譽正法，",
        "translation": "The Buddha prayed in a mantra, saying, “The Buddha helped you rejoice and offered offerings to gods and humans. The native people served as guides and fed the Buddha, the monks and bhikṣus, extolling the true Dharma.",
        "source": "T01n0006_001:0178a12_43"
    },
    {
        "source_sentence": "受道慧語，奉行經戒，都呪願此，可敬知敬，可事知事，博施兼愛，有慈哀心，",
        "translation": "He receives the teaching of enlightenment and wisdom, practices the scriptures and precepts, and wishes to be honored by all these incantations. He should be respected and known for his kindness, serve and know him well, and loves both generosity and affection with a compassionate mind.",
        "source": "T01n0006_001:0178a13_44"
    },
    {
        "source_sentence": "使汝一切常獲福利，得見正道。」",
        "translation": "It will cause you all to always attain well-being and attain the right path.",
        "source": "T01n0006_001:0178a15_45"
    },
    {
        "source_sentence": "大臣歡喜，佛復言：「汝於今世，雖有官事，緣由此福，後必解脫。",
        "translation": "The ministers rejoiced, and the Buddha said again, Although you have official duties in this life, it's because of this merit that you'll surely be liberated in the future.",
        "source": "T01n0006_001:0178a16_46"
    },
    {
        "source_sentence": "若人得飯佛及真賢持戒者，沙門呪願，終不徒棄。",
        "translation": "If someone attains the precepts of rice buddhas and true sages, the ascetic's dhāraṇī vows will never be abandoned in vain.",
        "source": "T01n0006_001:0178a17_47"
    },
    {
        "source_sentence": "又當以知，若欲在官及居位者，不可有貪心，不可侈心，不可憍心，不可虐心，",
        "translation": "You should also know that if you want to live in official positions or high offices, you must not have thoughts of greed, anger, hatred, or cruelty.",
        "source": "T01n0006_001:0178a18_48"
    },
    {
        "source_sentence": "不可快心，去此五者，後無咎悔，死得上天，除惡道罪。」",
        "translation": "Those who don't have a compassionate mind and leave these five will later be blameless and attain heaven after death, removing the sins of bad destinies.",
        "source": "T01n0006_001:0178a20_49"
    },
    {
        "source_sentence": "佛說已從坐起，出東城門，雨舍追侍曰：「當名此門為瞿曇門。」",
        "translation": "After the Buddha said this, he got up from his seat and left the eastern gate of the city, rained down a shelter to chase after him, saying, This gate will be called the Gautama gate.",
        "source": "T01n0006_001:0178a22_0"
    },
    {
        "source_sentence": "佛度津渚，又追名之，為瞿曇津。",
        "translation": "The Buddha crossed the river and named the island after it, which was also known as the Gautama River.",
        "source": "T01n0006_001:0178a23_1"
    },
    {
        "source_sentence": "是時人民，有乘舫舟渡者，有乘小船，或乘竹[簿-尃+卑]及木桴渡，",
        "translation": "At that time some of the people crossed the river in boats, others in small boats, and some on bamboo rafts or wooden bridges.",
        "source": "T01n0006_001:0178a24_2"
    },
    {
        "source_sentence": "渡者甚眾。",
        "translation": "There were many people crossing the river.",
        "source": "T01n0006_001:0178a25_3"
    },
    {
        "source_sentence": "佛坐定意自思：「往昔未作佛時，身所更來，乘此桴舡，不可復數；",
        "translation": "The Buddha sat in meditation and thought to himself: In the past, when I did not become a buddha, I came back again from my own body.",
        "source": "T01n0006_001:0178a25_4"
    },
    {
        "source_sentence": "今以解脫，不復乘此，亦使我諸弟子得離是。」",
        "translation": "Now that I'm liberated, I won't ride here again, and I will allow my disciples to part with it.",
        "source": "T01n0006_001:0178a27_5"
    },
    {
        "source_sentence": "「佛為海船師，　　法橋渡河津，",
        "translation": "The Buddha is the captain of the ocean ship, crossing the river at the bridge of the Dharma.",
        "source": "T01n0006_001:0178a28_6"
    },
    {
        "source_sentence": "　大乘道之典，　　一切渡天人，",
        "translation": "The scriptures of the Great Vehicle teach that all transmigrate among gods and humans.",
        "source": "T01n0006_001:0178a28_6"
    },
    {
        "source_sentence": "　亦為自解脫，　　度岸得昇仙，",
        "translation": "They are also liberated for themselves, cross the shore and attain supreme enlightenment.",
        "source": "T01n0006_001:0178a28_6"
    },
    {
        "source_sentence": "　都使諸弟子，　　縛解致泥洹。」",
        "translation": "They all cause their disciples to be bound and liberated into nirvāṇa.",
        "source": "T01n0006_001:0178a28_6"
    },
    {
        "source_sentence": "佛從定覺，自說頌曰：彼時，佛請賢者阿難，俱之拘利邑，受教皆行，",
        "translation": "Then the Buddha, awakened from concentration, spoke these verses himself: At that time the Buddha invited the venerable Ānanda to live in the village of Kauṇḍinya.",
        "source": "T01n0006_001:0178a28_6"
    },
    {
        "source_sentence": "到坐樹下。",
        "translation": "He went to sit under a tree.",
        "source": "T01n0006_001:0178b05_7"
    },
    {
        "source_sentence": "佛告諸比丘：「皆聽！",
        "translation": "The Buddha told the monks, All listen!",
        "source": "T01n0006_001:0178b05_8"
    },
    {
        "source_sentence": "當持淨戒，當思定意，當解慧行。",
        "translation": "You should observe pure precepts, contemplate concentration, and understand the practice of wisdom.",
        "source": "T01n0006_001:0178b05_9"
    },
    {
        "source_sentence": "此三者，禪譽既豐，又得離於婬怒癡垢，是謂正度欲疾。",
        "translation": "These three, because the fame of meditation is abundant and he's freed from the stain of lust, anger, and delusion, this is called rightly liberating himself from the disease of desire.",
        "source": "T01n0006_001:0178b06_10"
    },
    {
        "source_sentence": "望此當力自解，用盡是生，入清淨行，務如應作，而知一心，以善其性，",
        "translation": "Relying on this, they will be able to free themselves through their own power. The exhaustion of function is birth. Entering pure practices, they undertake what should be done and know one-pointedness of mind in order to improve its essence.",
        "source": "T01n0006_001:0178b07_11"
    },
    {
        "source_sentence": "與世無諍，已知世事，宜自憂身，靜居內思，意志即明，三垢已除，便自得道。",
        "translation": "He had no quarrel with the world and knew all worldly affairs, so it was better to worry about one’s own body than to dwell in meditation. One’s mind would be enlightened if he reflected internally. Having removed the three defilements, he himself attained enlightenment.",
        "source": "T01n0006_001:0178b09_12"
    },
    {
        "source_sentence": "心不復走，亦無所著，譬如國王為萬姓主，比丘自思惟能萬端，皆心為主。」",
        "translation": "The mind doesn't run away again, and there's nothing to cling to, like when a king is the lord of myriad castes, and a monk thinks for himself that he can control myriad directions, all with his mind as their leader.",
        "source": "T01n0006_001:0178b11_13"
    },
    {
        "source_sentence": "佛與阿難俱，到喜豫邑，止河水邊揵祇樹下。",
        "translation": "The Buddha, accompanied by Ānanda, went to the town of Jeta’s Grove and stopped at the foot of a mango tree beside the river.",
        "source": "T01n0006_001:0178b12_14"
    },
    {
        "source_sentence": "諸弟子且入城，乞食已澡洗畢還禮佛，住白佛言：「是國多疫到有死者，",
        "translation": "The disciples then entered the city. After they had eaten alms food, after having bathed and washed, they returned to pay their respects to the Buddha. Abiding there, they said to him:",
        "source": "T01n0006_001:0178b13_15"
    },
    {
        "source_sentence": "朝所共聞，有清信士，玄黮、時仙、初動、或震、叔良、快賢、伯宗、兼篤、德稱、淨高，",
        "translation": "All the monks and nuns of the monastery heard this from him. There were some who had pure faith in Buddhism, such as Xuanzang (i.e., Confucianism), Xianzhi (Samantabhadra), Huixuan (Skt. xuanzang), Shuliang (Śāriputra), Shanxian (Xiuyan), Jingxian (",
        "source": "T01n0006_001:0178b15_16"
    },
    {
        "source_sentence": "十人皆死，是輩喪身，當趣何道？」",
        "translation": "The ten people all died, so what path will they go to if they lose their bodies?",
        "source": "T01n0006_001:0178b17_17"
    },
    {
        "source_sentence": "佛告諸比丘：「此十人者，已斷自然魂神，上生十八天上，到不還地，",
        "translation": "The Buddha told the monks, These ten people had cut off their natural spirits and were born up in the eighteen heavens to reach the ground of nonreturner.",
        "source": "T01n0006_001:0178b18_18"
    },
    {
        "source_sentence": "不復來下受世間法。",
        "translation": "He'll no longer come down to receive worldly dharmas.",
        "source": "T01n0006_001:0178b19_19"
    },
    {
        "source_sentence": "又是國死，非但此也。",
        "translation": "It's not just here that the kingdom died.",
        "source": "T01n0006_001:0178b20_20"
    },
    {
        "source_sentence": "佛天眼見，五百清信士，悉如難提，等離三垢，五道斷死，皆上生不還之地，",
        "translation": "The Buddha’s divine eye saw that the five hundred pure faithful bodhisattvas were all like Nandi, equally freed from the three defilements, and having been reborn in the five realms of rebirth and non-returner.",
        "source": "T01n0006_001:0178b20_21"
    },
    {
        "source_sentence": "止取泥洹。",
        "translation": "He stops taking the nirvāṇa.",
        "source": "T01n0006_001:0178b22_22"
    },
    {
        "source_sentence": "又有三百清信士，已斷三結，無婬怒癡，昇頻來地，後來下生，當見苦際。",
        "translation": "Also, 300 pure believers have cut the three bonds, are free of anger, anger, and delusion, rise up and frequently come to the land, and will later be born down below, where they'll see the painful realm.",
        "source": "T01n0006_001:0178b22_23"
    },
    {
        "source_sentence": "復有五百清信女，皆得四喜，三結盡，得溝港，離三惡道，生天人中，",
        "translation": "Again, there were five hundred women of pure faith who all attained the four kinds of joy. Having cut off the three bonds, they entered a ditch and were born among goddesses and goddesses.",
        "source": "T01n0006_001:0178b24_24"
    },
    {
        "source_sentence": "不過七世，當得應真。」",
        "translation": "It's only after seven generations that they'll attain the truth.",
        "source": "T01n0006_001:0178b26_25"
    },
    {
        "source_sentence": "於是佛謂諸比丘：「汝說彼死者，為撓擾佛也。",
        "translation": "The Buddha then said to the monks, You're saying that this dead man is a disturbance to the Buddha.",
        "source": "T01n0006_001:0178b26_26"
    },
    {
        "source_sentence": "然吾為佛，不復受此，亦當何懼？",
        "translation": "But as a buddha, I won't accept this again, so what fear should I have?",
        "source": "T01n0006_001:0178b27_27"
    },
    {
        "source_sentence": "微哉妙矣。",
        "translation": "How subtle and marvelous!",
        "source": "T01n0006_001:0178b28_28"
    },
    {
        "source_sentence": "生死有時，夫諸佛興，雖曰生於世，不佛法情矣。",
        "translation": "There are times when birth and death arise, but even though it's said to arise in the world, it's not the Buddha's Dharma sentiment.",
        "source": "T01n0006_001:0178b28_29"
    },
    {
        "source_sentence": "何則？",
        "translation": "What's the reason?",
        "source": "T01n0006_001:0178b29_30"
    },
    {
        "source_sentence": "如來法情已止，無所不覺，已了是生，現說分明。",
        "translation": "The Tathāgata's feeling for the Dharma has stopped, and there's nothing he doesn't perceive. Having understood that this is birth, he now explains it clearly.",
        "source": "T01n0006_001:0178b29_31"
    },
    {
        "source_sentence": "所謂妙者，從有是令得是，無有是不得是，從是起令是生，是滅者乃都滅。",
        "translation": "The so-called marvelous thing is that it arises from what's present and causes what's present to become what's present, doesn't have what's present and doesn't obtain what's present, produces what's produced from what's present and causes what's produced to arise, and then everything ceases when it ceases.",
        "source": "T01n0006_001:0178c02_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0006_001:0178c03_1"
    },
    {
        "source_sentence": "用有欲求故為不明，緣不明行，緣行識，緣識名色，緣名色六入，緣六入更樂，",
        "translation": "The consciousness that has name-and-form as supporting object, the six sense-fields of name-and-form as supporting object, and contact and pleasure as supporting object.",
        "source": "T01n0006_001:0178c04_0"
    },
    {
        "source_sentence": "緣更樂痛，緣痛愛，緣愛受，緣受有，緣有生，緣生老死憂悲苦懣惱，",
        "translation": "Conditioned by contact with pleasure and pain, conditioned by pain and craving, conditioned by craving and sensation, conditioned by sensation and existence, conditioned by existence and birth, and conditioned by birth, old age, sorrow, lamentation, pain, vexation, and vexation.",
        "source": "T01n0006_001:0178c05_1"
    },
    {
        "source_sentence": "致是具足苦性習，有生死之本，轉如車輪，行無休息。",
        "translation": "As a result, they are fully conditioned by the nature of suffering and have the basis of birth-and-death, which turns like a chariot wheel and travels without rest.",
        "source": "T01n0006_001:0178c07_2"
    },
    {
        "source_sentence": "從癡不明故有生死，假令不明無餘無欲以滅則行滅，行滅則識滅，識滅則名色滅，",
        "translation": "It is from delusion that there is birth and death because they do not know it. If they do not know it but do not have no other craving, the cessation of volition occurs with the cessation of volition; the cessation of volition occurs with the cessation of consciousness; and the cessation of consciousness occurs with the cessation",
        "source": "T01n0006_001:0178c08_3"
    },
    {
        "source_sentence": "名色滅則六入滅，六入滅則更樂滅，更樂滅則痛滅，痛滅則愛滅，愛滅則受滅，",
        "translation": "When name and form cease, the six sense-fields cease; when the six sense-fields cease, contact ceases; when contact ceases, pain ceases; when pain ceases, desire ceases; and when desire ceases, sensation ceases.",
        "source": "T01n0006_001:0178c10_4"
    },
    {
        "source_sentence": "受滅則有滅，有滅則生滅，生滅則老死憂悲苦懣惱，致是具足苦性習有為都滅矣。",
        "translation": "When sensation ceases, there's cessation; when there's cessation, birth ceases; and when birth ceases, old age, grief, sorrow, pain, and vexation cease.",
        "source": "T01n0006_001:0178c12_5"
    },
    {
        "source_sentence": "故先為若說，癡者有生死，慧者持道不復生死。",
        "translation": "That's why it's first explained that delusion has birth and death, and wisdom maintains the path and doesn't have birth and death again.",
        "source": "T01n0006_001:0178c14_6"
    },
    {
        "source_sentence": "當思念此，挫其心乃不持復更生死之道。",
        "translation": "You should think about this, and if you dispel their minds, they won't maintain the path of birth-and-death again.",
        "source": "T01n0006_001:0178c15_7"
    },
    {
        "source_sentence": "又欲近道，當有四喜，宜善念行：一曰念佛，意喜不離。",
        "translation": "Also, if you want to approach the path, there should be four kinds of joy, and it's advisable to practice mindfulness well: one, mindfulness of the Buddha, which doesn't separate from joy in mind.",
        "source": "T01n0006_001:0178c16_8"
    },
    {
        "source_sentence": "二曰念法，意喜不離。",
        "translation": "The second is mindfulness of the Dharma, which doesn't part from thoughts and joy.",
        "source": "T01n0006_001:0178c17_9"
    },
    {
        "source_sentence": "三曰念眾，意喜不離。",
        "translation": "The third is mindfulness of the multitude, which doesn't part from one's thoughts and joy.",
        "source": "T01n0006_001:0178c18_10"
    },
    {
        "source_sentence": "四曰念戒，意喜不離。",
        "translation": "The fourth is mindfulness of the precepts, which are not separated by thoughts and emotions.",
        "source": "T01n0006_001:0178c18_11"
    },
    {
        "source_sentence": "念此四喜，必令具足，而自了見，當望正度求解身要，可以除斷地獄、畜生、鬼神之道，",
        "translation": "Mindful of these four kinds of joy, he will surely be endowed with them and perceive for himself the essentials of liberation so that he can get rid of the hells, the animals, and the realms of ghosts and spirits.",
        "source": "T01n0006_001:0178c19_12"
    },
    {
        "source_sentence": "以致溝港，不墮惡地，雖往來走天上人中，不過七生，自得苦際。」",
        "translation": "Because of this, they won't fall into a bad place in the ditch or harbor, and even though they come and go among gods and humans, they won't be reborn for seven lifetimes to attain the limit of suffering on their own.",
        "source": "T01n0006_001:0178c21_0"
    },
    {
        "source_sentence": "彼時，佛請賢者阿難，俱之維耶離國，即受教行。",
        "translation": "At the time, the Buddha invited the good man Ānanda to leave Vaiśālī's country and immediately accepted his instruction.",
        "source": "T01n0006_001:0178c22_1"
    },
    {
        "source_sentence": "佛樂拘利歷城中去，到止城外，故望女奈氏園。",
        "translation": "The Buddha delighted to leave the city of Kauṇḍinya and came to a place outside the city, where he stayed.",
        "source": "T01n0006_001:0178c23_2"
    },
    {
        "source_sentence": "奈女聞佛從諸弟子自越祇來，即嚴車衣服，從五百女弟子，俱出城詣奈園，",
        "translation": "When Nai heard that the Buddha had come from Vṛji with his disciples, she adorned her chariot and dressed herself. Accompanied by five hundred female disciples, they all left the city and went to Nai’s pleasure grove.",
        "source": "T01n0006_001:0178c24_3"
    },
    {
        "source_sentence": "欲跪拜侍覲。",
        "translation": "He wanted to kneel and pay homage to the attendants.",
        "source": "T01n0006_001:0178c26_4"
    },
    {
        "source_sentence": "佛遙見其五百女來，勅諸比丘：「見是，皆當低頭內觀，自端汝心，彼好莊衣，",
        "translation": "Seeing the five hundred women coming from a distance, the Buddha said to the bhikṣus: All of you who see these beautifully arrayed women should look inside with your heads bowed and think thus.",
        "source": "T01n0006_001:0178c26_5"
    },
    {
        "source_sentence": "譬如畵瓶，雖表彩色，中但屎尿，當知好女，皆盡畵瓶輩也。",
        "translation": "It's like a clay pot that shows color but contains only excrement and urine, which should be known as good-looking women, all of whom are from the clay pot group.",
        "source": "T01n0006_001:0178c28_6"
    },
    {
        "source_sentence": "夫為道者，不當惑彼，故當健制，志惟分別，是奈女來，亦從我教。",
        "translation": "Because those who follow the path should not confuse others. Therefore, you should be disciplined and determined to discriminate with discernment. This is a nailed woman who has come from me.",
        "source": "T01n0006_001:0178c29_7"
    },
    {
        "source_sentence": "何謂健制？",
        "translation": "What's meant by健制?",
        "source": "T01n0006_001:0179a02_8"
    },
    {
        "source_sentence": "已生惡法，能即斷却，治性精進，自攝意端；",
        "translation": "When evil states have already arisen, they are able to immediately eliminate them. Their antidote-by-nature energy is self-contained at the end of thought.",
        "source": "T01n0006_001:0179a02_9"
    },
    {
        "source_sentence": "未生惡法，能令不起，治性精進，自攝意端；",
        "translation": "An evil dharma not yet arisen can cause it not to arise. Their antidote-by-nature energy takes care of its own mental state.",
        "source": "T01n0006_001:0179a03_10"
    },
    {
        "source_sentence": "未生善法，意能發生，治性精進，自攝意端；",
        "translation": "Good dharmas that have not yet arisen can be produced by thought. Their antidote-by-nature energy takes care of its own state of thought.",
        "source": "T01n0006_001:0179a04_11"
    },
    {
        "source_sentence": "已生善法，志立弗忘，能使增廣，治性精進，自攝意端。",
        "translation": "Good dharmas that have already arisen are not forgotten in their aspiration, which can cause them to increase and become more extensive. Their antidote by nature is energy, which takes care of its own mental states.",
        "source": "T01n0006_001:0179a05_12"
    },
    {
        "source_sentence": "是以當為，寧破筋骨，自碎身體，不隨心而為惡，是為健制。",
        "translation": "That is why you should do so. You should rather break through the tendons and bones, crush your own bodies without doing evil according to your heart. This is a bold restraint.",
        "source": "T01n0006_001:0179a06_13"
    },
    {
        "source_sentence": "何謂志惟？",
        "translation": "What's meant by aspiration?",
        "source": "T01n0006_001:0179a08_14"
    },
    {
        "source_sentence": "惟內身循身觀，惟外身循身觀，以內外觀思念分別斷不使意；",
        "translation": "Only the inward body follows the contemplation of the body; the outer body follows the contemplation of the body:",
        "source": "T01n0006_001:0179a08_15"
    },
    {
        "source_sentence": "惟內痛循痛觀，惟外痛循痛觀，以內外觀思念分別斷不使意；",
        "translation": "They contemplate only internal pain as pain, and they contemplate only external pain as pain. They eliminate discriminating thoughts within by means of internal appearances; they do not disturb thought.",
        "source": "T01n0006_001:0179a10_0"
    },
    {
        "source_sentence": "惟內意循意觀，惟外意循意觀，以內外觀思念分別斷不使意；",
        "translation": "He follows thought only inwardly and thinks according to thought; he follows thought only inwardly and thinks according to thought.",
        "source": "T01n0006_001:0179a11_1"
    },
    {
        "source_sentence": "惟內法循法觀，惟外法循法觀，以內外觀思念分別斷不使意；",
        "translation": "He observed the doctrine inwardly, while observing the doctrine inwardly. He observed the doctrine inwardly, while observing the doctrine inwardly; he observed the doctrine inwardly, while observing the doctrine inwardly.",
        "source": "T01n0006_001:0179a12_2"
    },
    {
        "source_sentence": "是為志惟。",
        "translation": "This is the intention.",
        "source": "T01n0006_001:0179a14_3"
    },
    {
        "source_sentence": "何謂分別知可行不可行？",
        "translation": "What's meant by discriminating and knowing what's to be done and what's not to be done?",
        "source": "T01n0006_001:0179a14_4"
    },
    {
        "source_sentence": "從其正能別行，是為分別。",
        "translation": "This is called discrimination from the distinctive practices that are correctly capable of doing so.",
        "source": "T01n0006_001:0179a15_5"
    },
    {
        "source_sentence": "夫能健制志惟分別，乃為有力，非謂壯士多力而為健也。",
        "translation": "A strong man who restrains and deliberates on distinctions is powerful, not a strong man who has many strengths but becomes strong.",
        "source": "T01n0006_001:0179a15_6"
    },
    {
        "source_sentence": "能去惡就善，是謂最健。",
        "translation": "Being able to remove evil and turn it into goodness is called the most vigorous.",
        "source": "T01n0006_001:0179a17_7"
    },
    {
        "source_sentence": "自吾求佛與心諍以來，其劫無數，用不聽邪心故，今得為若世間作佛亦可休止，",
        "translation": "Countless eons have passed since I sought buddhahood in order to reconcile my mind with it, but because of not listening to wrong thoughts I am now able to become a buddha for the sake of all beings.",
        "source": "T01n0006_001:0179a17_8"
    },
    {
        "source_sentence": "汝意久在不淨之中，可自拔擢免斯眾苦。",
        "translation": "Your mind has been in the midst of impurity for a long time, so you can pull yourself out and escape this kind of suffering.",
        "source": "T01n0006_001:0179a19_9"
    },
    {
        "source_sentence": "見是女來，當如我教。」",
        "translation": "Seeing this woman coming, you'll follow my instructions.",
        "source": "T01n0006_001:0179a20_10"
    },
    {
        "source_sentence": "於是奈女到，稽首畢一面坐，佛問言：「今汝諸女意何如？」",
        "translation": "When the Nai woman arrived, she bowed her head and sat to one side. The Buddha asked, What do you women think now?",
        "source": "T01n0006_001:0179a21_11"
    },
    {
        "source_sentence": "對曰：「受佛大恩，得聞法教，愚癡醒悟，夙夜自勅，不敢邪心。」",
        "translation": "He replied, Accepting the Buddha's great kindness, they hear the teaching of the Dharma, are foolish and awakened, command their own minds day and night, and don't dare to think wrongly.",
        "source": "T01n0006_001:0179a22_12"
    },
    {
        "source_sentence": "佛告奈女：「好邪婬者，有五自妨：一者多聲不好。",
        "translation": "The Buddha told Nai, Good sexual misconduct has five kinds of self-obstructions: one, many sounds that aren't good.",
        "source": "T01n0006_001:0179a23_13"
    },
    {
        "source_sentence": "二者王法所疾。",
        "translation": "Two, the king's illness is caused by the Dharma.",
        "source": "T01n0006_001:0179a25_14"
    },
    {
        "source_sentence": "三者懷異多疑。",
        "translation": "Third, he harbors many doubts and doubts.",
        "source": "T01n0006_001:0179a25_15"
    },
    {
        "source_sentence": "四者死入地獄。",
        "translation": "Fourth, they'll die and go to hell.",
        "source": "T01n0006_001:0179a25_16"
    },
    {
        "source_sentence": "五者地獄罪竟受畜生形。",
        "translation": "Fifth, the sinners in hell receive the form of an animal after their sins.",
        "source": "T01n0006_001:0179a26_17"
    },
    {
        "source_sentence": "皆所致，能自滅心。",
        "translation": "They are all the result of being able to extinguish their own minds.",
        "source": "T01n0006_001:0179a26_18"
    },
    {
        "source_sentence": "不邪婬者，有五增福：一者多人稱譽。",
        "translation": "There are five kinds of increasing merit for someone who doesn't engage in sexual misconduct: first, praise from many people.",
        "source": "T01n0006_001:0179a27_19"
    },
    {
        "source_sentence": "二者不畏縣官。",
        "translation": "Two, they won't fear the officials of the prefecture.",
        "source": "T01n0006_001:0179a28_20"
    },
    {
        "source_sentence": "三者身得安隱。",
        "translation": "Third, he attains peace and comfort in body.",
        "source": "T01n0006_001:0179a28_21"
    },
    {
        "source_sentence": "四者死上天生。",
        "translation": "Fourth, they die and are reborn in the heavens.",
        "source": "T01n0006_001:0179a29_0"
    },
    {
        "source_sentence": "五者從立清淨泥洹道。",
        "translation": "Fifth, he follows the path of establishing pure nirvāṇa.",
        "source": "T01n0006_001:0179a29_1"
    },
    {
        "source_sentence": "是以當自患厭，母人生病，月期不淨，拘絆捶杖，不得自在，受行經戒，",
        "translation": "For this reason, you should become disgusted with the fact that your mother is ill and has an impure moonlight. You should restrain her from beating a cane or cudgel for months without being free [from killing her] and receive the precepts of the scriptures.",
        "source": "T01n0006_001:0179a29_2"
    },
    {
        "source_sentence": "可得如佛清淨之道。」",
        "translation": "They can attain the pure path of being like the Buddha.",
        "source": "T01n0006_001:0179b02_3"
    },
    {
        "source_sentence": "佛為奈女說法正化若干要語，奈女歡喜，避坐長跪白言：「欲設微食，",
        "translation": "The Buddha preached the Dharma to Nāgasena and taught her some essentials of righteousness. Nāgasena, overjoyed, fled from her seat and knelt down long enough to say, “I wish to offer you a light meal.",
        "source": "T01n0006_001:0179b02_4"
    },
    {
        "source_sentence": "願佛聖眾，俱屈威神。」",
        "translation": "May the buddhas and sages all bend their mighty spirits.",
        "source": "T01n0006_001:0179b04_5"
    },
    {
        "source_sentence": "佛以默然可之，即作禮而去。",
        "translation": "The Buddha accepted it in silence, paid homage, and departed.",
        "source": "T01n0006_001:0179b05_6"
    },
    {
        "source_sentence": "去未久，維耶離豪姓，有諸離車，聞佛從諸弟子來，去城七里，即乘王威嚴四色車，",
        "translation": "Not long after his departure, Vaiśravaṇa left the householder’s house. There were some Licchavi monks who heard that the Buddha had come from among his disciples. Seven li away from the city, they boarded the royally decorated four-colored chariot drawn by the king.",
        "source": "T01n0006_001:0179b05_7"
    },
    {
        "source_sentence": "出欲見佛。",
        "translation": "It's out of desire to see the Buddha.",
        "source": "T01n0006_001:0179b07_8"
    },
    {
        "source_sentence": "諸離車中，有乘青馬青車，青衣青蓋青幢青幡，官屬皆青；",
        "translation": "Among the Licchavi ministers there were some who rode in blue horses and blue chariots. They wore blue clothes, blue canopies, blue banners, and blue pennants, and all their officials were blue.",
        "source": "T01n0006_001:0179b07_9"
    },
    {
        "source_sentence": "有乘黃馬黃車，黃衣黃蓋黃幢黃幡，官屬皆黃；",
        "translation": "Some were riding on yellow horses, yellow carts, yellow robes, yellow canopies, yellow banners, and yellow pennants. All their officials were yellow.",
        "source": "T01n0006_001:0179b09_10"
    },
    {
        "source_sentence": "有乘赤馬赤車，衣蓋幢幡官屬皆赤；",
        "translation": "Some were riding on a red horse and a red chariot, with robes, canopies, banners, pennants, and official ranks all red.",
        "source": "T01n0006_001:0179b10_11"
    },
    {
        "source_sentence": "有乘白馬白車，衣蓋幢幡官屬皆白。",
        "translation": "There was a white horse riding in a white chariot, with white robes, canopies, banners, and officials all white.",
        "source": "T01n0006_001:0179b11_12"
    },
    {
        "source_sentence": "佛見車騎數十萬眾填路而來，即告諸比丘：「汝欲見忉利天上天帝苑中侍從出入者，",
        "translation": "Seeing that hundreds of thousands of monks riding in chariots and carts were coming along the road, the Buddha said to the bhikṣus:",
        "source": "T01n0006_001:0179b12_13"
    },
    {
        "source_sentence": "如此無異耶。」",
        "translation": "Is there no difference like this?",
        "source": "T01n0006_001:0179b14_0"
    },
    {
        "source_sentence": "諸離車到，皆下車，步入奈園，作禮畢一面坐，佛為大眾說法正化。",
        "translation": "When the Licchavi ministers had arrived, they all dismounted from their carriages, entered Naivana Park on foot, paid homage, and sat to one side. The Buddha taught the Dharma and correctly transformed the assembly of monks.",
        "source": "T01n0006_001:0179b14_1"
    },
    {
        "source_sentence": "有一人字并餼，避坐起整衣服，向佛自陳言：「每聞佛功德，巍巍甚大，",
        "translation": "There was a man named Anāthapiṇḍika, who withdrew from his seat and straightened his clothes. He said to the Buddha, “Whenever I hear about the merits of the Buddha, they are so lofty and great!",
        "source": "T01n0006_001:0179b15_2"
    },
    {
        "source_sentence": "天上天下，無不傾動，常從在所，夙夜敬仰，服重清化，不敢有惱。」",
        "translation": "There's nothing in heaven or under heaven that doesn't tilt, always following where it is, venerating it day and night with veneration, taking it seriously and transforming it, and not daring to disturb it.",
        "source": "T01n0006_001:0179b17_3"
    },
    {
        "source_sentence": "佛語并餼：「天下叡哲，乃知敬佛，夫敬佛者，自得其福，死皆上天，",
        "translation": "The Buddha said to the Licchavi Vimalakīrti, “The wise and saintly people of the world know respect for buddhas. Those who revere buddhas will attain their own merits and all die in heaven.",
        "source": "T01n0006_001:0179b19_4"
    },
    {
        "source_sentence": "不墮惡道。」",
        "translation": "They won't fall into a bad path.",
        "source": "T01n0006_001:0179b20_5"
    },
    {
        "source_sentence": "「敬謁法王來，　　心正道力安，",
        "translation": "Revere the coming of the king of the Dharma, Whose mind is settled by the power of the right path.",
        "source": "T01n0006_001:0179b20_6"
    },
    {
        "source_sentence": "　最勝號為佛，　　名顯若雪山。",
        "translation": "The most superior name is Buddha, and his name is like the snow-capped mountain.",
        "source": "T01n0006_001:0179b20_6"
    },
    {
        "source_sentence": "　譬華淨無疑，　　得喜如近香，",
        "translation": "It's like a flower that's pure and without doubt, which gets joy like the near fragrance.",
        "source": "T01n0006_001:0179b20_6"
    },
    {
        "source_sentence": "　方身觀無厭，　　光若露耀明。",
        "translation": "The square body observes without weariness, shining brightly as if it were exposed.",
        "source": "T01n0006_001:0179b20_6"
    },
    {
        "source_sentence": "　唯佛智高妙，　　明盛無瑕塵，",
        "translation": "Only the Buddha’s knowledge is lofty and marvelous, Their light flourishing without blemish.",
        "source": "T01n0006_001:0179b20_6"
    },
    {
        "source_sentence": "　願奉清信戒，　　自歸於三尊。」",
        "translation": "May I serve the precepts of pure faith and take refuge in the three honored ones.",
        "source": "T01n0006_001:0179b20_6"
    },
    {
        "source_sentence": "於是并餼，說頌讚曰：是時坐中五百豪姓，各解身上衣，以授并餼，并餼持衣，",
        "translation": "At that moment, the five hundred members of the householders who were seated in the assembly each untied their upper garments and gave them food and drink as well as robes.",
        "source": "T01n0006_001:0179b20_6"
    },
    {
        "source_sentence": "前白佛言：「是諸尊者，聞善言喜，共以五百上衣，奉獻世尊，願哀受之。」",
        "translation": "He went before the Buddha and said, These are the five hundred superior robes of the Bhagavān that all the venerable people who hear good words rejoice and offer them to the Bhagavān with pity.",
        "source": "T01n0006_001:0179b29_7"
    },
    {
        "source_sentence": "佛受已告言：「傳士！",
        "translation": "After accepting it, the Buddha told him,傳士!",
        "source": "T01n0006_001:0179c02_0"
    },
    {
        "source_sentence": "當知，佛為如來、至真、等正覺、明行成已、善逝、世間解、無上士、道法御、天人師，",
        "translation": "You should know that the Buddha is the Tathāgata, the Supreme Truth, the Completely Enlightened One, the accomplished in knowledge and conduct, the Well-gone One, the understander of the world, the unsurpassed one, the teacher of the path, the Dharma king, and the teacher of gods and humans.",
        "source": "T01n0006_001:0179c02_1"
    },
    {
        "source_sentence": "號佛、眾祐，出興於世，有五難有自然之法。",
        "translation": "They are called buddhas and myriad blessings that arise in the world, and there are five difficulties with natural dharmas.",
        "source": "T01n0006_001:0179c04_2"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T01n0006_001:0179c05_3"
    },
    {
        "source_sentence": "佛出教化天下，釋梵沙門梵志，龍神帝王，以自然慧，為世現證，開說真道，",
        "translation": "The Buddha came forth to teach and edify the world. His disciples, brahmins, renunciants, brahmins, brahmins, nāgas, gods, and emperors revealed the true path of enlightenment by means of their spontaneous wisdom in order to make it known to the world.",
        "source": "T01n0006_001:0179c05_4"
    },
    {
        "source_sentence": "上語亦善，中語亦善，下語亦善，至要義具，清淨究暢，一切敷演，是一難有自然法也。",
        "translation": "The above words are also good, the middle words are also good, and the lower words are also good, up to the point where their essential meanings are complete, pure and extensive, and all of them are explained in detail, which is a difficulty that there's a natural dharma.",
        "source": "T01n0006_001:0179c07_0"
    },
    {
        "source_sentence": "佛說經於天下，聞者皆樂，信學諷誦，端身口意，去邪入正，是二難有自然之法也。",
        "translation": "The Buddha taught the sūtras to all the people in the world. All who heard them were delighted, and those who believed in their study and recitation, disciplined body, speech, and thought, and abandoned what was evil and entered what was right. These two difficulties were natural dharmas.",
        "source": "T01n0006_001:0179c09_0"
    },
    {
        "source_sentence": "天下人民，聞佛經道，意去開解，深之思惟，皆得明慧，是三難有自然之法也。",
        "translation": "The people of the world heard the Buddha’s scriptures and paths, but their minds departed to enlightenment. Through deep reflection they all attained clarity and insight. These are the three kinds of natural dharmas that present difficulties.",
        "source": "T01n0006_001:0179c10_1"
    },
    {
        "source_sentence": "天下人民，聞佛教誡，多以愛敬，出三惡道，生天人中獲大利，是四難有自然之法也。",
        "translation": "The people of the world listened to the Buddha’s exhortation and, out of affection and respect, they were reborn in the three evil realms. Being born among gods and humans, they obtained great rewards. These are the four difficulties that make it a natural dharma.",
        "source": "T01n0006_001:0179c12_2"
    },
    {
        "source_sentence": "天下人民，聞佛道奧深妙法言，解本生死緣之事，斷情絕欲，皆得出要，",
        "translation": "The people of the whole empire heard the profound and mysterious teaching of the Buddha’s path. Understanding the causal conditions of birth and death in their native land, they cut off feelings and desires and all attained liberation.",
        "source": "T01n0006_001:0179c14_3"
    },
    {
        "source_sentence": "第一精進得應真道，第二精進得不還道，第三精進得頻來道，第四精進得溝港道，",
        "translation": "The first effort attains the true path of response, the second effort attains the path of nonreturning, the third effort attains the frequently coming path, and the fourth effort attains the ditch-port path.",
        "source": "T01n0006_001:0179c16_4"
    },
    {
        "source_sentence": "是五難有自然之法也。",
        "translation": "These are the five difficulties that have natural dharmas.",
        "source": "T01n0006_001:0179c18_5"
    },
    {
        "source_sentence": "凡人於佛，而有反復之心，以施少善者，皆得大福，不唐棄也。",
        "translation": "Ordinary people who have the intention of repeating themselves to the Buddha and giving a little goodness will attain great merit, which they won't abandon.",
        "source": "T01n0006_001:0179c18_6"
    },
    {
        "source_sentence": "是故并餼，當自勗勉，以學此得。」",
        "translation": "Therefore, they'll both be disciplined and disciplined, and they'll strive themselves to study this attainment.",
        "source": "T01n0006_001:0179c20_7"
    },
    {
        "source_sentence": "佛說已，諸離車從坐起，整衣服叉手言：「本欲請佛，而奈女以奪我先，",
        "translation": "Having said this, the Licchavi Vimalakīrti arose from his seat and straightened his clothes. He saluted the Buddha by placing his palms together [in respect], saying:",
        "source": "T01n0006_001:0179c21_8"
    },
    {
        "source_sentence": "願須後日，我等多務，欲還請辭。」",
        "translation": "May it be necessary for the day after tomorrow, when we'll have a lot of work to do, to return and ask permission to leave.",
        "source": "T01n0006_001:0179c22_9"
    },
    {
        "source_sentence": "佛言：「可當知時。」",
        "translation": "The Buddha said, You should know the time.",
        "source": "T01n0006_001:0179c23_10"
    },
    {
        "source_sentence": "時，即皆稽首佛足，繞三匝而去。",
        "translation": "They all bowed their heads at the Buddha’s feet, circumambulated him three times, and departed.",
        "source": "T01n0006_001:0179c23_11"
    },
    {
        "source_sentence": "奈女通夜，作濃美食，嚴飾室內，晨施牀座，行白佛言：「食具已辦，",
        "translation": "Throughout the night, she prepared a rich and delicious dish to adorn the room. In the morning she offered him a seat on which to sit.",
        "source": "T01n0006_001:0179c24_12"
    },
    {
        "source_sentence": "唯聖知時。」",
        "translation": "It's only when the sage knows it.",
        "source": "T01n0006_001:0179c26_13"
    },
    {
        "source_sentence": "佛與眾弟子，俱到其舍，就高座於眾前坐。",
        "translation": "The Buddha and his disciples all arrived at the monastery, took their high seats, and sat before the assembly.",
        "source": "T01n0006_001:0179c26_14"
    },
    {
        "source_sentence": "奈女手自斟酌，奉鉢致漿，行澡水畢，取小牀坐佛前，欲問法。",
        "translation": "The Nai woman prepared a drink with her own hands, offered the bowl to the Buddha and gave him some juice. When the water was running out for washing, she took a small seat in front of the Buddha’s presence and wished to ask him about the Dharma.",
        "source": "T01n0006_001:0179c27_15"
    },
    {
        "source_sentence": "佛言：「我代若喜好布施者，後無怨畏，多得稱譽，善名日增，眾人愛敬，",
        "translation": "The Buddha said: On my behalf, if someone is fond of generosity, he will be free from enmity and fear. He will gain much praise and good repute; his reputation will increase day by day, and the people will love and respect him.",
        "source": "T01n0006_001:0179c28_16"
    },
    {
        "source_sentence": "人能無慳，仁慧為智，如是無垢安隱，生天上諸天相娛樂。」",
        "translation": "People can be free of stinginess, and kindness and wisdom are their knowledge; thus, they're unsullied and peaceful, born in heaven and enjoying the gods' pleasures.",
        "source": "T01n0006_001:0180a01_17"
    },
    {
        "source_sentence": "佛為奈女說法正化若干要說，已皆歡喜。",
        "translation": "The Buddha taught the Dharma for Naiyi and correctly transformed her into several essentials, and they all rejoiced when they had done so.",
        "source": "T01n0006_001:0180a02_18"
    },
    {
        "source_sentence": "佛請賢者阿難，俱至竹芳邑，止城北林樹下。",
        "translation": "The Buddha invited the venerable Ānanda, and they all went to the town of Bamboo Grove and stopped at the foot of a tree in the forest north of the city.",
        "source": "T01n0006_001:0180a03_19"
    },
    {
        "source_sentence": "是歲竹芳邑，飢饉穀糴騰貴。",
        "translation": "In that year the bamboo and grapes were good and the starving rice and grain crops flourished in great value.",
        "source": "T01n0006_001:0180a04_20"
    },
    {
        "source_sentence": "佛告諸比丘：「是間飢饉，乞求難得，汝等宜分部行，別到維耶及越祇諸陬邑，",
        "translation": "The Buddha said to the bhikṣus: This is a time of famine and it is difficult to obtain almsfood. Therefore, you should distribute your food equally among the various religious orders and go separately to the towns of Vaiśālī and Vṛji.",
        "source": "T01n0006_001:0180a05_21"
    },
    {
        "source_sentence": "可以無乏。」",
        "translation": "It can be without deficiency.",
        "source": "T01n0006_001:0180a07_22"
    },
    {
        "source_sentence": "受教當行，佛言：「比丘！",
        "translation": "When he was instructed to do so, the Buddha said, Monk!",
        "source": "T01n0006_001:0180a07_23"
    },
    {
        "source_sentence": "當知自損，得善無喜，得惡勿憂，食取支身，勿貪求美，但坐嗜味，愛求之故，",
        "translation": "You should know that when you harm yourself, you gain good without rejoicing. When you gain evil, do not grieve. Eat and take the limbs of your body; do not covet what is good but simply sit and enjoy it.",
        "source": "T01n0006_001:0180a08_24"
    },
    {
        "source_sentence": "生死不絕。",
        "translation": "Birth and death don't cease.",
        "source": "T01n0006_001:0180a09_25"
    },
    {
        "source_sentence": "夫知節身，能自損者，可得定意。」",
        "translation": "If someone knows the body of a moderation and can harm themselves, they can attain concentration.",
        "source": "T01n0006_001:0180a10_26"
    },
    {
        "source_sentence": "佛為說法正化若干要語，皆歡喜禮佛去，各分部行，到諸國邑。",
        "translation": "The Buddha preached the Dharma for them, correctly transformed them, and explained various essential teachings. They all joyfully venerated the Buddha and departed. Each of them traveled in groups to their respective countries and cities.",
        "source": "T01n0006_001:0180a10_27"
    },
    {
        "source_sentence": "佛獨與阿難俱，到衛沙聚。",
        "translation": "The Buddha, accompanied by Ānanda alone, went to the monastery in Vaiśālī.",
        "source": "T01n0006_001:0180a12_28"
    },
    {
        "source_sentence": "是時佛身疾，舉軀皆痛。",
        "translation": "At the time, the Buddha's body was ill, and all his movements were painful.",
        "source": "T01n0006_001:0180a12_29"
    },
    {
        "source_sentence": "佛念痛甚，而弟子皆不在，當須眾來，乃取泥洹，宜為是疾自力精進，",
        "translation": "The Buddha was greatly distressed, but his disciples were not present. It was necessary for the assembly to come before he entered nirvana. Because of this illness it was better to make effort on one’s own.",
        "source": "T01n0006_001:0180a13_30"
    },
    {
        "source_sentence": "以受不念眾想之定，即如其像正受三昧思惟，不念眾想之定，以是忍意，",
        "translation": "Because he receives the concentration of not being mindful of all thoughts, that is to say, he correctly experiences samādhi and contemplates it in accordance with its images, and doesn’t think about the concentration of all thoughts.",
        "source": "T01n0006_001:0180a15_31"
    },
    {
        "source_sentence": "而自得聞。",
        "translation": "They can hear it for themselves.",
        "source": "T01n0006_001:0180a16_32"
    },
    {
        "source_sentence": "賢者阿難，從一樹下起，詣佛稽首畢一面住，問佛消息：「疾寧瘳損？",
        "translation": "Good man Ānanda rose from his seat under a tree and approached the Buddha. After paying respect with his head at the Buddha’s feet, he remained to one side.",
        "source": "T01n0006_001:0180a17_33"
    },
    {
        "source_sentence": "聞聖體疾，實用憂懼，世尊得無欲取泥洹？",
        "translation": "When I heard that the holy one was seriously ill and practically fearful, did the Bhagavān attain nirvāṇa without desire?",
        "source": "T01n0006_001:0180a18_34"
    },
    {
        "source_sentence": "願有教令，於眾弟子。」",
        "translation": "May there be an instruction for the disciples.",
        "source": "T01n0006_001:0180a19_35"
    },
    {
        "source_sentence": "佛報阿難：「佛豈與眾相違遠乎？",
        "translation": "The Buddha replied to Ānanda, Is the Buddha at odds with the crowd?",
        "source": "T01n0006_001:0180a20_36"
    },
    {
        "source_sentence": "吾亦恒在比丘眾中，所當施為教誡，以具前後所說，皆在眾所，但當精進案經行之。",
        "translation": "I am also always present in the assembly of bhikṣus. Whatever admonitions should be given to them, I will follow what has been taught before and after [by you]. Being present in the assembly, I will simply make every effort to practice according to the scriptures.",
        "source": "T01n0006_001:0180a20_37"
    },
    {
        "source_sentence": "向吾疾生，舉軀痛甚，即思不念眾想之定，意不著疾故，忍中正要者。",
        "translation": "When my illness arises, my body is so painful that I think and don't think about the concentration of all thoughts, and my mind isn't attached to illness, which is the correct essentials of forbearance.",
        "source": "T01n0006_001:0180a22_38"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0006_001:0180a24_39"
    },
    {
        "source_sentence": "我所說法，中外備悉，佛為法師，無所遺忘，所當施行，自足可知。",
        "translation": "The teachings that I teach are fully explained both inside and out. As the Buddha is my teacher of the Dharma, I have nothing to forget. The practices I should perform can be known for their sufficientness.",
        "source": "T01n0006_001:0180a24_40"
    },
    {
        "source_sentence": "我亦已老，年且八十，形如故車，無牢無強，吾本說，生死有時，無生不終。",
        "translation": "I am also old. At the age of eighty my body is shaped like an old carriage, without any firmness or strength. As I said before, there is a time of birth and death, neither beginning nor end.",
        "source": "T01n0006_001:0180a26_41"
    },
    {
        "source_sentence": "極上有天名不想入，其壽八十四千萬劫，彼亦有死。",
        "translation": "The highest heaven is called nonentry because it has a life span of eighty-four thousand world ages. Death occurs there as well.",
        "source": "T01n0006_001:0180a27_42"
    },
    {
        "source_sentence": "是以佛起經於天下，咸示泥洹大道，以斷生死之本。",
        "translation": "That's why the Buddha initiated sūtras throughout the world to show the path of nirvāṇa, cutting off the source of birth-and-death.",
        "source": "T01n0006_001:0180a29_0"
    },
    {
        "source_sentence": "我今都為有身作錠令身歸，為法教錠令法自歸。",
        "translation": "Now, I've made a lock for the sake of existence to cause my body to return, and I've taught the lock for the sake of the Dharma to cause it to return on its own.",
        "source": "T01n0006_001:0180b01_1"
    },
    {
        "source_sentence": "彼何謂錠？",
        "translation": "What does that mean by a lock?",
        "source": "T01n0006_001:0180b02_2"
    },
    {
        "source_sentence": "何謂自歸？",
        "translation": "What's meant by self-reliance?",
        "source": "T01n0006_001:0180b02_3"
    },
    {
        "source_sentence": "謂是專心在四志惟，一惟觀身，二惟觀痛，三惟觀意，四惟觀法，健制思念，",
        "translation": "It means to concentrate one’s mind on four kinds of thought: (1) contemplation of body, (2) contemplation of pain, (3) contemplation of thought, and (4) contemplation of the Dharma.",
        "source": "T01n0006_001:0180b02_4"
    },
    {
        "source_sentence": "斷不使想，是為一切作法教錠，當以自歸。",
        "translation": "To stop the perception of non-causation is to make all the teachings and fetters of the Dharma, which should be self-contained.",
        "source": "T01n0006_001:0180b04_5"
    },
    {
        "source_sentence": "吾為此已重說，如欲解者，當精進行中外戒法，必使如常。",
        "translation": "I've already explained this again for you, and those who want to understand it will diligently practice the middle and external precepts, so they'll surely be as usual.",
        "source": "T01n0006_001:0180b05_6"
    },
    {
        "source_sentence": "其有自歸，覺佛經道，皆佛子孫。",
        "translation": "Those who had self-reliance and realized the Buddha's sūtras and path were all the Buddha's children and grandchildren.",
        "source": "T01n0006_001:0180b07_7"
    },
    {
        "source_sentence": "今我委棄轉輪王位，為天下作佛，憂度三界，汝等亦宜自憂其身，以斷眾苦。」",
        "translation": "Now that I've abandoned the position of wheel-turning king and become a buddha in the world, I'm grieved to liberate the three realms, so you should grieve for yourselves and end all suffering.",
        "source": "T01n0006_001:0180b07_8"
    },
    {
        "source_sentence": "彼避雨時，補繕衣畢，佛請賢者阿難，俱至維耶離，受教即行。",
        "translation": "When they avoided the rain and finished mending their robes, the Buddha invited Venerable Ānanda to go with them to Vaiśālī, where they all accepted the instructions and went on.",
        "source": "T01n0006_001:0180b09_9"
    },
    {
        "source_sentence": "既到止猨猴館，行乞食畢，滌鉢澡洗，又與阿難俱，到急疾神地。",
        "translation": "When he arrived at the monkey monastery, he washed his bowl and bathed. He also accompanied Ānanda to a place where he was suffering from an acute illness.",
        "source": "T01n0006_001:0180b11_10"
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T01n0006_001:0180b12_11"
    },
    {
        "source_sentence": "維耶離樂，越祇亦樂，今此天下，十六大國，其諸郡邑皆樂。",
        "translation": "Vaiśālī’s departure from happiness is also happiness in Vṛji. In this world there are now sixteen great kingdoms, all of which have happiness in their counties and towns.",
        "source": "T01n0006_001:0180b12_12"
    },
    {
        "source_sentence": "熙連然河，多出黃金，閻浮提地，五色畫，人生於世，以壽為樂。",
        "translation": "In the Hiraṇyavatī River most of the gold is produced. The land of Jambudvīpa is painted in five colors and people are born in the world, taking longevity as happiness.",
        "source": "T01n0006_001:0180b14_13"
    },
    {
        "source_sentence": "若比丘比丘尼，知四神足，是為拔苦，多修習行，當念不忘，在意所欲，",
        "translation": "If monks and nuns know the four miraculous powers, this is to remove suffering and often cultivate practice. They should be mindful not to forget [what they have] and concentrate on what they want.",
        "source": "T01n0006_001:0180b15_14"
    },
    {
        "source_sentence": "可得不死，一劫不啻。",
        "translation": "They can attain immortality without dying, and they won't die for an eon.",
        "source": "T01n0006_001:0180b17_15"
    },
    {
        "source_sentence": "如是阿難！",
        "translation": "Thus, Ānanda!",
        "source": "T01n0006_001:0180b17_16"
    },
    {
        "source_sentence": "佛四神足，已多習行，專念不忘，在意所欲，如來可止一劫有餘。」",
        "translation": "The Buddha's four miraculous powers have been practiced many times, and he focuses his attention without forgetting them. If he wants to, the Tathāgata can stop it for an eon with remainder.",
        "source": "T01n0006_001:0180b18_17"
    },
    {
        "source_sentence": "佛重說是至再三，時，阿難意沒在邊想，為魔所蔽，曚曚不悟，默而不對。",
        "translation": "When the Buddha repeatedly said this three times, Ānanda's mind was submerged in extreme thoughts, and he was hindered by Māra, who didn't awaken from his anger and remained silent without replying.",
        "source": "T01n0006_001:0180b19_18"
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T01n0006_001:0180b21_19"
    },
    {
        "source_sentence": "汝去到一樹下，靜意自思。」",
        "translation": "Go to the foot of a tree and think quietly for yourself.",
        "source": "T01n0006_001:0180b21_20"
    },
    {
        "source_sentence": "即受教一處坐。",
        "translation": "He then accepted the teaching and sat in one place.",
        "source": "T01n0006_001:0180b22_21"
    },
    {
        "source_sentence": "時，魔波旬來曰：「佛意無欲可般泥洹，教誨已周已訖，可滅度矣。",
        "translation": "Māra Pāpīyān then came and said, “The Buddha’s mind is free from desire. We should enter final nirvana. Having completed his exhortation, we can be liberated.",
        "source": "T01n0006_001:0180b22_22"
    },
    {
        "source_sentence": "昔者佛遊傴留河上，解說諸老曰：『吾為佛，雖得自在，不貪久住，非謂今也。",
        "translation": "Formerly when the Buddha was staying at Benares in the Ganges River, he explained to the assembly of old monks, “I am the Buddha. Although I have attained sovereignty, I do not wish to live any longer.",
        "source": "T01n0006_001:0180b24_23"
    },
    {
        "source_sentence": "所度亦畢，可般泥洹。』」",
        "translation": "I'll finish what I've crossed over to, so I can parinirvāṇa.'",
        "source": "T01n0006_001:0180b25_24"
    },
    {
        "source_sentence": "佛報波旬：「吾所以至於是未滅度者，須我眾比丘及比丘尼，令皆智慧承用經戒，",
        "translation": "The Buddha answered Pāpīyān, Because I am not yet liberated, it is necessary for all the bhikṣus and bhikṣuṇīs of my assembly to be endowed with wisdom so that they may inherit the scriptures and precepts.",
        "source": "T01n0006_001:0180b26_25"
    },
    {
        "source_sentence": "勸請未入，使學者成，亦以須我請清信士及清信女，令得智慧承用經戒，",
        "translation": "Encourage those who haven't yet entered to make their scholarship complete, and also by requesting me to invite faithful men and women with pure faith so that they may attain wisdom and use the sūtras and precepts.",
        "source": "T01n0006_001:0180b28_26"
    },
    {
        "source_sentence": "未入者入，受法者成。",
        "translation": "Those who haven't yet entered enter, and those who have received the teaching are formed.",
        "source": "T01n0006_001:0180b29_27"
    },
    {
        "source_sentence": "如是波旬，吾以待此四輩弟子，皆得法意，展轉相教，解諸童蒙，使學成就，",
        "translation": "Thus, Pāpīyān, I waited for these four groups of disciples who had all attained the intention to follow the Dharma and taught them one after another so that they could understand the meaning of the teaching and make their studies complete.",
        "source": "T01n0006_001:0180c01_28"
    },
    {
        "source_sentence": "是以至今，未滅度耳。」",
        "translation": "That's why they haven't been liberated so far.",
        "source": "T01n0006_001:0180c03_29"
    },
    {
        "source_sentence": "魔曰：「可足時已畢矣。」",
        "translation": "Māra said, It's enough for the time.",
        "source": "T01n0006_001:0180c03_30"
    },
    {
        "source_sentence": "佛言：「汝默，如來不久，是後三月當取泥洹。」",
        "translation": "The Buddha said, Be silent, for it won't be long before the Tathāgata takes nirvāṇa three months from now.",
        "source": "T01n0006_001:0180c04_31"
    },
    {
        "source_sentence": "魔心乃悅，歡喜而去。",
        "translation": "The demon’s mind was delighted and departed with joy.",
        "source": "T01n0006_001:0180c05_32"
    },
    {
        "source_sentence": "佛即正坐，定意自思：「於三昧中，不住性命，棄餘壽行。」",
        "translation": "The Buddha then sat upright and thought to himself in concentration, In samādhi, he doesn't abide by nature or life but abandons the rest of his life.",
        "source": "T01n0006_001:0180c05_33"
    },
    {
        "source_sentence": "當此之時，地為大動，空中清淨，佛之光明，徹照無窮，諸天神來側滿虛空。",
        "translation": "At that time the earth trembled greatly and the sky became pure. The Buddha’s ray of light illuminated everywhere without limit, and heavenly gods came to fill the sky with space.",
        "source": "T01n0006_001:0180c06_34"
    },
    {
        "source_sentence": "「無量眾德行，　　有為吾今捨，",
        "translation": "“Innumerable virtuous practices, conditioned by virtue, I will abandon them now.",
        "source": "T01n0006_001:0180c08_35"
    },
    {
        "source_sentence": "　近遠應度者，　　已度應度者。」",
        "translation": "Those who should be liberated from nearness and those who have been liberated should be liberated.",
        "source": "T01n0006_001:0180c08_35"
    },
    {
        "source_sentence": "佛從定覺，自說偈曰：賢者阿難，心驚毛竪，疾行詣佛，稽首畢一面住，",
        "translation": "Then, awakened from meditation, the Buddha said in verse: Good man, Ānanda, my hair stood on end in fear. I hastily approached the Buddha. Having saluted him by bowing my head, I remained at one side.",
        "source": "T01n0006_001:0180c08_35"
    },
    {
        "source_sentence": "白佛言：「甚哉世尊！",
        "translation": "He said to the Buddha, How wonderful, Bhagavān!",
        "source": "T01n0006_001:0180c13_36"
    },
    {
        "source_sentence": "地動乃爾，是何因緣？」",
        "translation": "What is the cause and condition for the earth's movement?",
        "source": "T01n0006_001:0180c13_37"
    },
    {
        "source_sentence": "佛語阿難：「凡世地動，有八因緣。",
        "translation": "The Buddha said to Ānanda: There are eight reasons why the earth moves.",
        "source": "T01n0006_001:0180c14_38"
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T01n0006_001:0180c14_39"
    },
    {
        "source_sentence": "天下地在水上，水止於風，風止於空，空中大風有時自起則大水擾，大水擾則普地動，",
        "translation": "The earth of the realm under heaven rests on water, while water rests on wind and wind in space. When a gale begins blowing in midair, great turbulence occurs due to the distraction of water; when that great turbulence is accompanied by water, all the earth shakes.",
        "source": "T01n0006_001:0180c15_0"
    },
    {
        "source_sentence": "是為一也。",
        "translation": "This is one.",
        "source": "T01n0006_001:0180c17_0"
    },
    {
        "source_sentence": "有時得道沙門，及神妙天，戒德隆盛，欲自試力，手按少地，則普地動，",
        "translation": "At times there were ascetics of the Way and divinely marvelous celestial beings with preeminent moral virtues. Wishing to test their power, they touched a little earth with their hands, but the ground trembled everywhere.",
        "source": "T01n0006_001:0180c17_1"
    },
    {
        "source_sentence": "是為二也。",
        "translation": "These are the two.",
        "source": "T01n0006_001:0180c18_2"
    },
    {
        "source_sentence": "若始菩薩，從第四天，下入母胎，明哲慈意，欲見道化，開發愚曚，乃放神光，",
        "translation": "If the first bodhisattva descends from the fourth heaven and enters his mother’s womb with insight, wisdom, kindness, and compassion, wishing to see the path of enlightenment and awaken ignorance, he then emits a divine light.",
        "source": "T01n0006_001:0180c19_3"
    },
    {
        "source_sentence": "震動天地，令梵釋魔沙門梵志一切見明，是為三也。",
        "translation": "Shaking heaven and earth and causing Brahmā, Śakra, Māra, ascetics, and priests to see all things clearly is the third.",
        "source": "T01n0006_001:0180c21_0"
    },
    {
        "source_sentence": "若菩薩生出母胎時，德感諸天，淨無雲曀，神光遠照，則普地動，是為四也。",
        "translation": "When a bodhisattva is born and emerges from his mother's womb, the gods are endowed with virtue, pure and without clouds, and their divine light shines far and wide, causing the earth to shake everywhere.",
        "source": "T01n0006_001:0180c22_1"
    },
    {
        "source_sentence": "至於菩薩得無上道正真佛時，普地大動，天神四布，稱揚佛名，是為五也。",
        "translation": "As for the fifth, when a bodhisattva attains the unsurpassed path of right and true buddhahood, the whole earth shakes with great trembling, heavenly spirits spread in four directions, and he praises the Buddha's name.",
        "source": "T01n0006_001:0180c23_2"
    },
    {
        "source_sentence": "及已作佛，初大會時，法輪三轉，天人則解，此彼菩薩，昇成大道，光明遠照，",
        "translation": "At the time of the first great assembly, when the wheel of the Dharma turned in three ways and gods and humans understood it, this or that bodhisattva ascended to enlightenment, his light shone far and wide.",
        "source": "T01n0006_001:0180c25_3"
    },
    {
        "source_sentence": "時普地動，是為六也。",
        "translation": "When the earth moves everywhere, these are the six.",
        "source": "T01n0006_001:0180c27_4"
    },
    {
        "source_sentence": "佛教將畢，欲棄壽行，不住性命，乃大放光，勸發天人，則普地動，是為七也。",
        "translation": "Seventh, when the Buddha’s discourse was about to end and he wished to forsake his life span but did not abide by his natural course of existence, then he emitted a great ray of light. Encouraging heavenly beings to be inspired, the earth trembled in all directions. This is the seventh omen.",
        "source": "T01n0006_001:0180c28_0"
    },
    {
        "source_sentence": "如佛眾祐，臨當棄身般泥洹時，明無不照，天神參至則地普動，是為八也。」",
        "translation": "Just as when the Buddha's multitude of blessings is about to abandon his body and enter final nirvāṇa, there's nothing that isn't illuminated by insight, and when gods and goddesses come together, the earth moves everywhere; this is the eighth.",
        "source": "T01n0006_001:0180c29_1"
    },
    {
        "source_sentence": "阿難言：「今佛已為捨性命耶？」",
        "translation": "Ānanda said, Has the Buddha abandoned his nature and life now?",
        "source": "T01n0006_001:0181a02_2"
    },
    {
        "source_sentence": "佛言：「已捨。」",
        "translation": "The Buddha said, I've abandoned it.",
        "source": "T01n0006_001:0181a03_3"
    },
    {
        "source_sentence": "阿難曰：「昔聞佛說：『若有弟子，知四神足，多修習行，專念不忘，",
        "translation": "Ānanda replied: I have heard the Buddha teach that if a disciple knows the four kinds of supernormal powers, he should practice them extensively and keep them in mind.",
        "source": "T01n0006_001:0181a03_4"
    },
    {
        "source_sentence": "在意所欲，可止不死一劫有餘。』",
        "translation": "Whatever you want, you can stop it and not die for an eon with a remainder.'",
        "source": "T01n0006_001:0181a04_5"
    },
    {
        "source_sentence": "而佛道德，過殊於此，亦不可久止乎？」",
        "translation": "But the Buddha's morality is so different from this that it can't be stopped for a long time?",
        "source": "T01n0006_001:0181a05_6"
    },
    {
        "source_sentence": "佛報阿難：「今汝言之，豈不過耶？",
        "translation": "The Buddha replied to Ānanda, Isn't that the only thing you say now?",
        "source": "T01n0006_001:0181a06_7"
    },
    {
        "source_sentence": "吾與汝言四神足者，乃至再三；",
        "translation": "I will give you the four supernormal powers of enlightenment, up to three times.",
        "source": "T01n0006_001:0181a07_8"
    },
    {
        "source_sentence": "而若徑默，沒在暗昧，不發明想，為魔所蔽，而復何云具佛所說，言一出口寧自違乎？」",
        "translation": "If he were to go into silence, remain in darkness, not give rise to ideas of enlightenment, and be blinded by Māra, then why would he say that he's fully explained what the Buddha teaches, saying that it's contrary to himself?",
        "source": "T01n0006_001:0181a08_0"
    },
    {
        "source_sentence": "對曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T01n0006_001:0181a10_0"
    },
    {
        "source_sentence": "「如是阿難！",
        "translation": "Thus, Ānanda!",
        "source": "T01n0006_001:0181a10_1"
    },
    {
        "source_sentence": "夫不智者既自發言而追違之；",
        "translation": "Those who are not wise make their own announcements and pursue those who disobey them.",
        "source": "T01n0006_001:0181a10_2"
    },
    {
        "source_sentence": "我無是也。」",
        "translation": "I'm not like that.",
        "source": "T01n0006_001:0181a11_3"
    },
    {
        "source_sentence": "阿難垂涕曰：「亦何駛哉！",
        "translation": "Ānanda wept and said, How is it so fast?",
        "source": "T01n0006_001:0181a11_4"
    },
    {
        "source_sentence": "佛取泥洹，一何疾哉！",
        "translation": "The Buddha took the nirvāṇa, and what's so urgent about it?",
        "source": "T01n0006_001:0181a12_5"
    },
    {
        "source_sentence": "世間眼滅。」",
        "translation": "The worldly eye ceases.",
        "source": "T01n0006_001:0181a12_6"
    },
    {
        "source_sentence": "彼時，佛勅賢者阿難，請維耶離國倚行比丘。",
        "translation": "At the time, the Buddha commanded the good man Ānanda to invite the monk Vaiśravaṇa to leave his country and relied on him.",
        "source": "T01n0006_001:0181a12_7"
    },
    {
        "source_sentence": "受教即請，悉會講堂，稽首畢一面住。",
        "translation": "They all assembled in the assembly hall, bowed their heads and remained at one side.",
        "source": "T01n0006_001:0181a13_8"
    },
    {
        "source_sentence": "佛告諸比丘：「世間無常，無有牢固，皆當離散，無常在者，心識所行，",
        "translation": "The Buddha said to the bhikṣus: The world is impermanent. It does not have any firmness and will all be disintegrated. Being impermanent, it exists only in the mind and mental consciousness.",
        "source": "T01n0006_001:0181a14_9"
    },
    {
        "source_sentence": "但為自欺，恩愛合會，其誰得久，天地須彌，尚有崩壞，況于人物，而欲長存？",
        "translation": "But in order to deceive themselves, they are united by affection and love. Who will be able to live for a long time? Heaven and earth, as well as Mount Sumeru, may still crumble and disintegrate, much less human beings, even if they wish to exist forever.",
        "source": "T01n0006_001:0181a16_10"
    },
    {
        "source_sentence": "生死憂苦，可厭已矣！",
        "translation": "The sorrow and suffering of birth-and-death is enough to be disgusting!",
        "source": "T01n0006_001:0181a18_11"
    },
    {
        "source_sentence": "佛後三月，當般泥洹，勿怪勿憂。",
        "translation": "Three months after the Buddha will enter final nirvana, so don't be surprised or grieve.",
        "source": "T01n0006_001:0181a18_12"
    },
    {
        "source_sentence": "且夫一切去來現佛，皆從法得，經法且存，但當自勉勤學力行，持清淨心，",
        "translation": "Furthermore, all buddhas of past and future appearing in the world are attained from the Dharma. The scriptures and teachings exist but they should strive themselves to diligently study and practice with energy, maintaining a pure mind.",
        "source": "T01n0006_001:0181a19_13"
    },
    {
        "source_sentence": "趣得度脫，心識情休，則不死不復生，亦不復走於五道捨一身受一身也。",
        "translation": "When he's headed for liberation, his mind and consciousnesses cease, then he doesn't die and doesn't arise again, and he doesn't go back to the five paths to abandon one body and receive another body.",
        "source": "T01n0006_001:0181a21_14"
    },
    {
        "source_sentence": "五陰已斷，乃無飢渴寒熱憂悲苦惱之患。",
        "translation": "Once the five aggregates have been cut off, there's no hunger, thirst, cold, heat, sorrow, pain, and vexation.",
        "source": "T01n0006_001:0181a22_15"
    },
    {
        "source_sentence": "人知正心，天上諸天，皆代人喜，當以降心柔弱自損，勿隨心行，心之行無不為，",
        "translation": "People will know their minds are correct, and the gods in heaven will all rejoice on their behalf. They will then be self-indulgent and self-defeated, so that they won’t act according to their minds.",
        "source": "T01n0006_001:0181a23_16"
    },
    {
        "source_sentence": "得道者亦心也。",
        "translation": "Attaining the path is also mind.",
        "source": "T01n0006_001:0181a25_17"
    },
    {
        "source_sentence": "心作天，心作人，心作鬼神畜生地獄，皆心所為也。",
        "translation": "The mind creates gods, the mind creates humans, and the mind creates ghosts, spirits, animals, and hells, which are all created by the mind.",
        "source": "T01n0006_001:0181a25_18"
    },
    {
        "source_sentence": "從心行得起諸法，心作識，識作意，意轉入心，心也者取為長，心志為行，",
        "translation": "The dharmas that arise from the mental states, mind as consciousness, perceptual consciousness as perceptual consciousness, thought as perceptual consciousness, and thought as perceptual consciousness.",
        "source": "T01n0006_001:0181a27_19"
    },
    {
        "source_sentence": "行作為命，賢愚在行，壽夭在命。",
        "translation": "Practice acts as life, good and foolish are in practice, and longevity and death are in life.",
        "source": "T01n0006_001:0181a28_20"
    },
    {
        "source_sentence": "夫志行命三者相須，所作好惡，身自當之；",
        "translation": "Volition, action, and the three vital principles are mutually exclusive. The good or bad deeds they undertake should be done by oneself.",
        "source": "T01n0006_001:0181a29_21"
    },
    {
        "source_sentence": "父作不善，子不代受，子作不善，父亦不受，善自獲福，惡自受殃。",
        "translation": "When a father does something unwholesome, the son doesn't accept it on behalf of him, and when a son does something unwholesome, the father doesn't accept it either, which is good for itself to attain merit and bad for itself to experience misfortune.",
        "source": "T01n0006_001:0181b01_22"
    },
    {
        "source_sentence": "今佛為天上天下所尊敬者，皆志所為，是故當以正心行法，唯行法者，",
        "translation": "Because the Buddha is honored by gods in heaven and earth, they all want to do what they want. Therefore, you should practice the Dharma with a correct mind; practitioners of the Dharma are the only ones who practice it.",
        "source": "T01n0006_001:0181b03_23"
    },
    {
        "source_sentence": "能現世得休，現世得安，宜善取持諦受諷誦，靜意思惟，然則我清淨法，",
        "translation": "If you can attain peace in the present life and attain peace in the present life, it’s advisable to skillfully grasp, retain, recite, and meditate quietly. Yet I am a pure dharma.",
        "source": "T01n0006_001:0181b04_24"
    },
    {
        "source_sentence": "可得久住，可以愍度世間眾苦，道利綏寧諸天人民。",
        "translation": "If you can live for a long time, you will be able to cross over the sufferings of the world and liberate the gods and goddesses who are endowed with benefit and peace.",
        "source": "T01n0006_001:0181b06_25"
    },
    {
        "source_sentence": "「比丘當知！",
        "translation": "You should know, monks!",
        "source": "T01n0006_001:0181b07_26"
    },
    {
        "source_sentence": "何等為法？",
        "translation": "What are their dharmas?",
        "source": "T01n0006_001:0181b08_0"
    },
    {
        "source_sentence": "謂是四志惟、四意端、四神足、四禪行、五根、五力、七覺、八道諦，",
        "translation": "These are the four kinds of intention, the four kinds of mental command, the four kinds of supernormal power, the four practices of meditation, the five faculties, the five powers, the seven forms of enlightenment, and the eightfold path.",
        "source": "T01n0006_001:0181b08_1"
    },
    {
        "source_sentence": "如受行可得解脫，令法不衰。",
        "translation": "It's like receiving practice that enables one to attain liberation and keeps the teaching from decaying.",
        "source": "T01n0006_001:0181b09_2"
    },
    {
        "source_sentence": "「彼何謂四志惟？",
        "translation": "What are the four kinds of contemplation?",
        "source": "T01n0006_001:0181b10_3"
    },
    {
        "source_sentence": "惟內身循身觀，惟外身循身觀，以內外觀，分別思念，斷癡惑意；",
        "translation": "Only the inward body follows the contemplation of the body; the outer body follows the contemplation of the body. With an inward appearance, they discriminate, think, and eliminate thoughts of delusion.",
        "source": "T01n0006_001:0181b10_4"
    },
    {
        "source_sentence": "惟痛之觀，及意與法，皆如初說。",
        "translation": "Only the contemplation of pain and the mind and dharmas are as explained above.",
        "source": "T01n0006_001:0181b12_5"
    },
    {
        "source_sentence": "「何謂為四意端？",
        "translation": "“What are the four mental states?",
        "source": "T01n0006_001:0181b13_6"
    },
    {
        "source_sentence": "已生惡法，能即斷却，治性精進，自攝意端；",
        "translation": "When evil states have already arisen, they are able to immediately eliminate them. Their antidote-by-nature energy is self-contained at the end of thought.",
        "source": "T01n0006_001:0181b13_7"
    },
    {
        "source_sentence": "未生惡法，制使不起，治性精進，自攝意端；",
        "translation": "The evil states not yet produced are restrained and prevented from being produced; the energy of antidote by nature is self-contained at the point of thought.",
        "source": "T01n0006_001:0181b14_8"
    },
    {
        "source_sentence": "未生善法，即能發生，治性精進，自攝意端；",
        "translation": "Good dharmas not yet arisen can be produced, and the antidote-by-nature energy of enlightenment is self-contained at the point of thought.",
        "source": "T01n0006_001:0181b15_9"
    },
    {
        "source_sentence": "已生善法，志立不忘，能使增踰，精進意端。",
        "translation": "Good qualities that have already arisen, which are established with the intention of not forgetting them, can cause their superiority to increase, and it's the point of mindfulness of exertion.",
        "source": "T01n0006_001:0181b16_10"
    },
    {
        "source_sentence": "「何謂為四神足？",
        "translation": "“What are the four miraculous powers?",
        "source": "T01n0006_001:0181b17_11"
    },
    {
        "source_sentence": "思惟欲定，以滅眾行，具念神足，其欲不邪，不取無捨，常守清行；",
        "translation": "They contemplate the concentration of desire in order to eliminate all actions, being mindful of their spiritual powers. Their desire is not wrong; they do not grasp or relinquish and always keep pure action.",
        "source": "T01n0006_001:0181b17_12"
    },
    {
        "source_sentence": "惟精進定，惟意志定，惟戒習定，皆同，文如初說。",
        "translation": "Only the absorption of energy, the absorption of volition and the absorption of morality are the same. The text is as has been said previously.",
        "source": "T01n0006_001:0181b19_13"
    },
    {
        "source_sentence": "「何謂四禪？",
        "translation": "What is the fourth meditative state of absorption?",
        "source": "T01n0006_001:0181b20_14"
    },
    {
        "source_sentence": "棄欲惡法，但念但行，志樂無為成一禪行；",
        "translation": "They abandon bad states of attachment, being only mindful and acting; their aspiration for the unconditioned becomes the practice of meditation.",
        "source": "T01n0006_001:0181b20_15"
    },
    {
        "source_sentence": "念行已滅，內守一心，志在恬靜，成二禪行；",
        "translation": "Having eliminated thought and thought formations, he keeps his mind unified internally. Abiding in quietude, he settles into the practice of the second meditative state of absorption.",
        "source": "T01n0006_001:0181b21_16"
    },
    {
        "source_sentence": "惟觀無婬，心安體正，分別見真，成三禪行；",
        "translation": "He observed the absence of dispute, his mind peaceful and correct in essence; discriminating and seeing truth, he settled into the practice of the third meditation.",
        "source": "T01n0006_001:0181b22_17"
    },
    {
        "source_sentence": "已斷苦樂，無憂喜想，意已清淨，成四禪行。",
        "translation": "Having cut off pain and pleasure, he has no thoughts of grief or joy, his mind is purified, and he accomplishes the practice of the fourth meditation.",
        "source": "T01n0006_001:0181b23_18"
    },
    {
        "source_sentence": "「何謂五根？",
        "translation": "What are the five faculties?",
        "source": "T01n0006_001:0181b24_19"
    },
    {
        "source_sentence": "一為信根，意向四喜；",
        "translation": "The first is the faculty of faith, which consists of four kinds of joy:",
        "source": "T01n0006_001:0181b25_0"
    },
    {
        "source_sentence": "二為精進根，治四意端；",
        "translation": "The second is the faculty of zeal, which cures the four mental states.",
        "source": "T01n0006_001:0181b25_1"
    },
    {
        "source_sentence": "三為念根，念四志惟；",
        "translation": "The third is the faculty of mindfulness:",
        "source": "T01n0006_001:0181b26_2"
    },
    {
        "source_sentence": "四為定根，思四禪行；",
        "translation": "The fourth is the faculty of meditative absorption:",
        "source": "T01n0006_001:0181b26_3"
    },
    {
        "source_sentence": "五為智根，見四真諦。",
        "translation": "The fifth is the faculty of knowledge, which sees the four true truths.",
        "source": "T01n0006_001:0181b27_4"
    },
    {
        "source_sentence": "「何謂五力？",
        "translation": "“What are the five powers?",
        "source": "T01n0006_001:0181b27_5"
    },
    {
        "source_sentence": "一為信力，喜意不壞；",
        "translation": "The first is the power of faith, unshakable by delight.",
        "source": "T01n0006_001:0181b27_6"
    },
    {
        "source_sentence": "二為精進力，常能健制；",
        "translation": "The second is the power of exertion, being always able to restrain.",
        "source": "T01n0006_001:0181b28_7"
    },
    {
        "source_sentence": "三為念力，得志惟觀；",
        "translation": "The third is the power of mindfulness, which enables one to concentrate on contemplation.",
        "source": "T01n0006_001:0181b28_8"
    },
    {
        "source_sentence": "四為定力，禪意不亂；",
        "translation": "The fourth is the power of concentration, unconfused by the thought of meditation.",
        "source": "T01n0006_001:0181b29_9"
    },
    {
        "source_sentence": "五為智力，以道自證。",
        "translation": "The fifth is the power of knowledge, which is self-realized by means of the path.",
        "source": "T01n0006_001:0181b29_10"
    },
    {
        "source_sentence": "「何謂七覺？",
        "translation": "“What are the seven kinds of awakening?",
        "source": "T01n0006_001:0181c01_11"
    },
    {
        "source_sentence": "志念覺意，法解覺意，精進覺意，愛喜覺意，一向覺意，惟定覺意，行護覺意。",
        "translation": "They are the awakening thought of intention, the awakening thought of understanding the Dharma, the awakening thought of effort, the awakening thought of joy, the awakening thought of love, the awakening thought of concentration, and the awakening thought of protecting practice.",
        "source": "T01n0006_001:0181c01_12"
    },
    {
        "source_sentence": "「何謂八道？",
        "translation": "“What are the eightfold paths?",
        "source": "T01n0006_001:0181c03_13"
    },
    {
        "source_sentence": "正見、正思、正言、正行、正命、正治、正志、正定，是為度世清淨之法」彼時，",
        "translation": "Right view, right thought, right speech, right action, right livelihood, right action, right action, right effort, right intention, and right concentration are the pure dharmas that save the world.",
        "source": "T01n0006_001:0181c03_14"
    },
    {
        "source_sentence": "佛請賢者阿難，俱至拘利邑，即受教行。",
        "translation": "The Buddha invited the venerable Ānanda, and they all went to the town of Kauṇḍinya to receive instruction and practice.",
        "source": "T01n0006_001:0181c05_15"
    },
    {
        "source_sentence": "佛樂維耶，過國中出城門，迴身右轉視門而笑。",
        "translation": "The Buddha, delighted with Vaiśravaṇa, passed the country and left the city gates, turned his body around to the right, looked at the gates, and laughed.",
        "source": "T01n0006_001:0181c06_16"
    },
    {
        "source_sentence": "賢者阿難即整衣服，右膝著地，長跪問曰：「自我得侍二十餘年，未曾見佛行以無緣；",
        "translation": "Good man Ānanda straightened his clothes, knelt on the ground with his right knee touching the ground, and knelt down long enough to ask, “I myself have been attending the Buddha for more than twenty years without ever having seen him.",
        "source": "T01n0006_001:0181c07_17"
    },
    {
        "source_sentence": "如迴身視門而笑，是何因緣？」",
        "translation": "What's the reason for turning around and looking at the door with a smile?",
        "source": "T01n0006_001:0181c09_18"
    },
    {
        "source_sentence": "佛言：「如是如是。",
        "translation": "The Buddha said, So it is.",
        "source": "T01n0006_001:0181c09_19"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0006_001:0181c10_20"
    },
    {
        "source_sentence": "佛之儀法不妄迴身虛而笑也。",
        "translation": "The Buddha's manner isn't false, turning his body around and laughing in vain.",
        "source": "T01n0006_001:0181c10_21"
    },
    {
        "source_sentence": "是我最後見維耶離，故視笑耳。」",
        "translation": "This is the last time I'll see Vaiśālī, so I'll look at it and smile.",
        "source": "T01n0006_001:0181c11_22"
    },
    {
        "source_sentence": "「是吾之最後，　　遊觀維耶離，",
        "translation": "“This is the last of my excursions to Vaiśālī.",
        "source": "T01n0006_001:0181c11_23"
    },
    {
        "source_sentence": "　將遊彼泥洹，　　不復受有身。」",
        "translation": "I'll travel to that nirvāṇa, and I won't again experience a body.",
        "source": "T01n0006_001:0181c11_23"
    },
    {
        "source_sentence": "「佛稱此末後，　　身行極於斯，",
        "translation": "Toward the end of this buddha’s life (i.e., nirvana) His bodily actions will be even greater than these.",
        "source": "T01n0006_001:0181c11_23"
    },
    {
        "source_sentence": "　若遂淪清虛，　　於何覩聖來？」",
        "translation": "If they then fall into the clear sky, where will the noble ones come from?",
        "source": "T01n0006_001:0181c11_23"
    },
    {
        "source_sentence": "於是佛自頌曰：有異比丘，亦讚頌曰：佛與阿難俱到拘利止城北林樹下，",
        "translation": "Then the Buddha said in verse: Some heretic monks also praised him, saying: The Buddha and Ānanda arrived at the foot of a tree in the forest to the north of the city of Kapilavastu.",
        "source": "T01n0006_001:0181c11_23"
    },
    {
        "source_sentence": "告諸比丘：「當護淨戒，當思定意，當解智慧。",
        "translation": "He told the monks, You must observe pure precepts, contemplate concentration, and understand wisdom.",
        "source": "T01n0006_001:0181c18_24"
    },
    {
        "source_sentence": "夫以守戒，有定慧者，成大德致豐譽，永離貪婬、瞋恚、愚癡，可得應真，",
        "translation": "If someone observes the precepts with concentration and wisdom, they’ll attain great virtue and prosperity, permanently become free of craving, anger, and folly, and be able to attain truth.",
        "source": "T01n0006_001:0181c19_25"
    },
    {
        "source_sentence": "欲以現世望正度者，當加自解，令盡是生，入清淨道。",
        "translation": "Those who want to hope for right salvation in the present life should increase their self-understanding so that they can end this birth and enter the pure path.",
        "source": "T01n0006_001:0181c21_26"
    },
    {
        "source_sentence": "已如應行，乃自知身，後不復受。」",
        "translation": "After doing so, he knows his own body and won't accept it again.",
        "source": "T01n0006_001:0181c22_27"
    },
    {
        "source_sentence": "佛復請賢者阿難，俱之健持邑，止城北樹下坐。",
        "translation": "The Buddha again invited Venerable Ānanda to stay at the town of Kauśinagara and took his seat under a tree north of the city.",
        "source": "T01n0006_001:0181c23_28"
    },
    {
        "source_sentence": "告諸比丘：「當守淨戒，思惟定意，求解智慧。",
        "translation": "He told the monks, You must observe pure precepts, contemplate concentration and mind, and seek understanding and wisdom.",
        "source": "T01n0006_001:0181c24_29"
    },
    {
        "source_sentence": "守淨戒者不隨三態，惟定意者心不放散，已解慧者去離受欲，行無罣礙。",
        "translation": "Those who observe the pure precepts don't follow the three states, but those who are concentrated and mindful don't let their minds go, and those who have liberated themselves from craving and wisdom part with sensation and practice without obstruction.",
        "source": "T01n0006_001:0181c25_30"
    },
    {
        "source_sentence": "有戒定慧，德大豐譽，又離三垢，終得應真。",
        "translation": "He possesses morality, absorption, wisdom, and the great prestige of virtue. Freed from the three defilements, he has finally attained what should be true.",
        "source": "T01n0006_001:0181c27_31"
    },
    {
        "source_sentence": "欲以是身望得正度，當勤求解，令盡是生，入清淨道。",
        "translation": "If you want to hope to attain right liberation with this body, you must diligently seek understanding so that they end birth and enter the pure path.",
        "source": "T01n0006_001:0181c28_32"
    },
    {
        "source_sentence": "作如應行，乃自知滅，後不復受。」",
        "translation": "Doing so as you should, you'll know for yourself that it ceases and won't be experienced again.",
        "source": "T01n0006_001:0181c29_33"
    },
    {
        "source_sentence": "佛又與阿難俱，過掩滿邑，及出金邑、授手邑、華氏邑，至善淨邑。",
        "translation": "The Buddha, accompanied by Ānanda, crossed the towns of Kapphiṇapura and departed from the towns of Kanyakubja, Yudatta, and Huaji to the town of Shanjing.",
        "source": "T01n0006_001:0182a01_34"
    },
    {
        "source_sentence": "處處為弟子說此三要曰：「當護戒，當思定，當解慧。",
        "translation": "Everywhere he taught these three essentials to his disciples, saying, You must guard the precepts, contemplate concentration, and understand wisdom.",
        "source": "T01n0006_001:0182a02_35"
    },
    {
        "source_sentence": "守此三者，德豐譽大，消婬怒癡，是謂正度。",
        "translation": "He who guards these three, whose virtue is abundant and their reputation great, and he stops lust, anger, and delusion, this is called right liberation.",
        "source": "T01n0006_001:0182a03_36"
    },
    {
        "source_sentence": "已有戒心則定心成，定心已成則智心明，如染淨潔受色明好，有此三心則道易得，",
        "translation": "When there already is awareness of moral precepts, there is formation of awarenesses of meditative absorption. When the awareness of meditative absorption is settled, there is awareness of knowledge and awareness of insight. It is as when defilement and cleanliness receive form and light and beauty. With these three awarenesses, the path is easy to acquire.",
        "source": "T01n0006_001:0182a04_37"
    },
    {
        "source_sentence": "但當一意勤身求解，令盡是生已入清淨。",
        "translation": "You should simply singlemindedly diligently seek understanding with your body, so that you'll end this birth and enter purity after it's produced.",
        "source": "T01n0006_001:0182a06_38"
    },
    {
        "source_sentence": "行如應者，自知極此，不復受生。",
        "translation": "He who acts accordingly knows for himself that he's reached this point and won't be born again.",
        "source": "T01n0006_001:0182a07_39"
    },
    {
        "source_sentence": "若不能具戒定慧行，欲度世難。",
        "translation": "If someone can't fulfill the practice of morality, concentration, wisdom, and discernment, they want to save them from worldly difficulties.",
        "source": "T01n0006_001:0182a08_40"
    },
    {
        "source_sentence": "有此三者意自開解，坐而思惟便見五道——天上、人中、地獄、畜生、鬼神——分明，",
        "translation": "If there are these three, one’s mind is self-liberated. Sitting and reflecting, he sees clearly the five realms of rebirth: heaven, earth, hell, animals, and ghosts.",
        "source": "T01n0006_001:0182a09_41"
    },
    {
        "source_sentence": "悉知眾生意志所念。",
        "translation": "They all know what sentient beings think in their minds.",
        "source": "T01n0006_001:0182a10_42"
    },
    {
        "source_sentence": "譬如溪水清，其中沙礫，青黃白黑，所有皆見；",
        "translation": "It is as if the water of a stream was clear, and all the debris in that stream, blue, yellow, white, and black, were to be seen.",
        "source": "T01n0006_001:0182a11_43"
    },
    {
        "source_sentence": "得道之人，但心清故，所視悉見，欲得道者，當淨其中心。",
        "translation": "A person who has attained the path but his mind is pure, he'll see everything he looks at, and those who want to attain the path will purify their center.",
        "source": "T01n0006_001:0182a12_44"
    },
    {
        "source_sentence": "如水渾濁，則無所見，持心不淨，不得度世。",
        "translation": "It's like when water is muddy, there's nothing to see, and maintaining one's mind is impure, so you can't save the world.",
        "source": "T01n0006_001:0182a13_45"
    },
    {
        "source_sentence": "師所見說，弟子當行，師同不入弟子心中，就正其念，念意端者道自得矣。」",
        "translation": "When the teacher sees what he teaches, the disciple will go along with it. The teacher doesn't enter the disciple's mind, corrects his thoughts, and those who are mindful will attain the path on their own.",
        "source": "T01n0006_001:0182a14_46"
    },
    {
        "source_sentence": "佛已樂善淨，又請賢者阿難，俱之夫延邑，止城北樹下坐。",
        "translation": "Having delighted in goodness and purity, the Buddha also invited the venerable Ānanda to stay at Yanyi, where he sat under a tree north of the city.",
        "source": "T01n0006_001:0182a16_47"
    },
    {
        "source_sentence": "晡時，阿難從燕坐起，到佛所稽首畢，叉手問曰：「倉卒欲知地動幾事？」",
        "translation": "When the fire was over, Ānanda rose from his seat in Yan and went to the Buddha's place. After bowing his head at the Buddha's feet, he saluted him with his palms joined and asked, How much does the storekeeper want to know about the movement of the earth?",
        "source": "T01n0006_001:0182a17_48"
    },
    {
        "source_sentence": "佛語阿難：「有三因緣：一為地倚水上，水倚於風，風倚於空，大風起則水擾，",
        "translation": "The Buddha said to Ānanda: There are three reasons the earth rests on water, the water rests on wind, the wind rests on space, and when a gale arises the water is disturbed.",
        "source": "T01n0006_001:0182a19_49"
    },
    {
        "source_sentence": "水擾則地動。",
        "translation": "When water disturbs, the earth moves.",
        "source": "T01n0006_001:0182a20_50"
    },
    {
        "source_sentence": "二為得道沙門及神妙天，欲現感應故以地動。",
        "translation": "Second, in order to attain enlightenment, the ascetics of the Way and the divinely marvelous gods move with the earth because they want to show their response.",
        "source": "T01n0006_001:0182a21_51"
    },
    {
        "source_sentence": "三為佛力，自我作佛前後已動，三千日月萬二千天地無不感發，天人鬼神多得聞解。」",
        "translation": "Third, it's because of the Buddha's power that he himself becomes a buddha and moves before and after him, and 3,000 suns, moons, 12,000 heavens, and 12,000 gods all give rise to it, and gods, humans, ghosts, and spirits often hear and understand it.",
        "source": "T01n0006_001:0182a22_52"
    },
    {
        "source_sentence": "阿難歎曰：「妙哉！",
        "translation": "Ānanda praised him, saying, Marvelous!",
        "source": "T01n0006_001:0182a24_53"
    },
    {
        "source_sentence": "佛為無倫，以自然法無不感動，至德至道巍巍乃爾。」",
        "translation": "The Buddha is unequal, and there's nothing that isn't moved by natural dharmas that aren't touched by them, so it's because of his supreme virtue and path that he's so lofty.",
        "source": "T01n0006_001:0182a24_54"
    },
    {
        "source_sentence": "佛言：「如是如是。",
        "translation": "The Buddha said, So it is.",
        "source": "T01n0006_001:0182a25_55"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T01n0006_001:0182a26_56"
    },
    {
        "source_sentence": "佛德不小，乃從無數劫積累功德，奉行諸善自致作佛，有是神妙自然法化，",
        "translation": "Because the virtue of buddhahood is not small, it accumulates merit over countless eons and becomes buddha by itself through practice of goodness.",
        "source": "T01n0006_001:0182a26_57"
    },
    {
        "source_sentence": "一切知一切見，無不入無不化。",
        "translation": "All know and all see, and there's nothing that doesn't enter and nothing that doesn't transform.",
        "source": "T01n0006_001:0182a28_58"
    },
    {
        "source_sentence": "憶念我昔以慈悲心，若干百千人，天下諸王君子眾，化住相見，隨其像貌為安慰說經道，",
        "translation": "I remember that in the past hundreds of thousands of my lords, kings, princes, and gentlemen under various rulerships appeared to me with kindness and compassion. According to their physical forms I comforted them and taught them the path of enlightenment.",
        "source": "T01n0006_001:0182a28_59"
    },
    {
        "source_sentence": "周流教化使得善意。",
        "translation": "He spreads the teaching around and makes it possible to cultivate good intentions.",
        "source": "T01n0006_001:0182b01_60"
    },
    {
        "source_sentence": "如是現化，遍於八方，隨其國俗服飾語言，相其人行何法、知何經，而為演說授以正道，",
        "translation": "In the eight directions they teach in such a way, according to the customs and manners of dress and language of their countries. They show the people what doctrine they practice and tell them what scriptures they know, explaining and guiding them on the right path.",
        "source": "T01n0006_001:0182b02_61"
    },
    {
        "source_sentence": "樂義言者為設典教，解道理者為說上要，堅立其志已而捨沒。",
        "translation": "Those who delight in meaningful words establish the scriptures and teachings, those who understand principles explain the higher essentials, firmly establish their intentions, and then abandon them.",
        "source": "T01n0006_001:0182b04_62"
    },
    {
        "source_sentence": "設王君子莫知我誰，後皆耽味敬承法化，是為佛之清妙自然法也。",
        "translation": "If the king's gentlemen don't know who I am, and later they all indulge in taste and respectfully receive the teaching, this is the Buddha's pure and marvelous natural dharma.",
        "source": "T01n0006_001:0182b05_63"
    },
    {
        "source_sentence": "「又我，阿難！",
        "translation": "Again, Ānanda!",
        "source": "T01n0006_001:0182b07_64"
    },
    {
        "source_sentence": "得佛力遍入現化以佛儀法，入沙門眾為之師導，已後化入梵志之眾。",
        "translation": "Attaining the Buddha's power, he pervasively enters into the present teaching with the Buddha's manner of conduct, enters into the ascetic community to be his teacher and guide, and then transforms it into the community of priests.",
        "source": "T01n0006_001:0182b07_65"
    },
    {
        "source_sentence": "又居士儒林異學，隨其被服聲音語言，授與經道一切成就，為錯橫法，",
        "translation": "Furthermore, the householder was a heretic of Confucianism, who taught all the accomplishments of the scriptures and paths according to the sounds and words he heard.",
        "source": "T01n0006_001:0182b09_66"
    },
    {
        "source_sentence": "已而捨歿，子曹皆受我教而莫我知，是佛之難有自然法也。",
        "translation": "They all accepted my teaching and didn't know it, which is the Buddha's difficulty that there are natural dharmas.",
        "source": "T01n0006_001:0182b10_67"
    },
    {
        "source_sentence": "佛亦上入第一四天王，遍上第二忉利天，第三焰天，第四兜術天，第五不憍樂天，",
        "translation": "The Buddha also went up into the first of the four heavenly kings, pervading the second Trāyastriṃśa Heaven, the third Yama Heaven, the fourth Tuṣita Heaven, and the fifth A Forest of Pearls from the Dharma Garden, Volume II Nirmāṇarati Heaven.",
        "source": "T01n0006_001:0182b12_68"
    },
    {
        "source_sentence": "第六化應聲天，周印魔；",
        "translation": "The sixth was Nirmāṇaratideva, the universal mudrā Māra.",
        "source": "T01n0006_001:0182b14_69"
    },
    {
        "source_sentence": "又上第七梵天，第八梵眾天，第九梵輔天，第十大梵天，第十一水行天，",
        "translation": "The seventh Brahmadeva gods, the eighth Brahmakāyika gods, the ninth Brahmapurohita gods, the tenth Mahāprajñāpāramitā gods, and the eleventh Avaradhara gods were also present.",
        "source": "T01n0006_001:0182b14_70"
    },
    {
        "source_sentence": "第十二水微天，第十三水無量天，第十四水音天，第十五約淨天，第十六遍淨天，",
        "translation": "The twelfth is the subtle water element of water; the thirteenth is the infinite element of water; the fourteenth is the sound element of water; the fifteenth is the pure element; and the sixteenth is the universal pure element.",
        "source": "T01n0006_001:0182b16_71"
    },
    {
        "source_sentence": "第十七清明天，第十八守妙天，第十九玄妙天，第二十福德天，第二十一慤淳天，",
        "translation": "The seventeenth heaven is the clear sky, the eighteenth is the marvelous guardian god, the nineteenth is the mysterious heaven, the twentieth is the heaven of blessedness and virtue, the twenty-first is the pure heaven.",
        "source": "T01n0006_001:0182b18_72"
    },
    {
        "source_sentence": "第二十二近天，第二十三快見天，第二十四無結愛天，我皆周遍若干百千人。",
        "translation": "The twenty-second proximate heaven, the twenty-third heaven of blissful views, and the twenty-fourth heaven of no bonds and craving all pervade me with several hundreds of thousands of people.",
        "source": "T01n0006_001:0182b20_73"
    },
    {
        "source_sentence": "是諸天隨形貌與相見，樂清淨者為說清淨，達道意者勸使布化，在清人者立以大，",
        "translation": "When the gods see each other according to their form and appearance, they delight in purity and explain purity to those who delight in purity. Those who understand the meaning of the path are encouraged to propagate it, while those who are pure establish greatness among them.",
        "source": "T01n0006_001:0182b22_74"
    },
    {
        "source_sentence": "其解法情即授以要，誘勸導利化使得道訖輙捨歿，彼諸天輩莫知我誰，",
        "translation": "Those gods and goddesses did not know who I was, but they taught me the essentials of the Dharma. Encouraging, guiding, benefiting, and transforming others to follow the path, they ended their disputes and abandoned them.",
        "source": "T01n0006_001:0182b24_0"
    },
    {
        "source_sentence": "是佛之難有自然法也。",
        "translation": "This is the Buddha's difficulty that there are natural dharmas.",
        "source": "T01n0006_001:0182b25_1"
    },
    {
        "source_sentence": "上餘四天皆無形聲，故佛不往：第二十五空慧入天，第二十六識慧入天，",
        "translation": "The other heavens above are without form or sound. Therefore, the Buddha does not go there:",
        "source": "T01n0006_001:0182b26_2"
    },
    {
        "source_sentence": "第二十七不用慧入天，第二十八不想入天。",
        "translation": "The twenty-seventh doesn't use wisdom to enter heaven, and the twenty-eighth doesn't want to enter heaven.",
        "source": "T01n0006_001:0182b27_3"
    },
    {
        "source_sentence": "「如是阿難！",
        "translation": "Thus, Ānanda!",
        "source": "T01n0006_001:0182b28_4"
    },
    {
        "source_sentence": "佛恩廣大無不成，慘然而難值，佛出世間如漚波羅華時時有耳，佛所說法亦難聞聞，",
        "translation": "The Buddha’s benevolence is as vast as that of all the enlightening beings, yet it cannot be overcome by non-grasping and is difficult to find. When the Buddha appears in the world, like the blue lotus blossom flower, there are those who have ears at the right time and can hear what he teaches.",
        "source": "T01n0006_001:0182b29_5"
    },
    {
        "source_sentence": "已聞經法當受護持。",
        "translation": "Having heard the sūtras and teachings, they should accept and uphold them.",
        "source": "T01n0006_001:0182c02_6"
    },
    {
        "source_sentence": "護持云何？",
        "translation": "What's the guarding?",
        "source": "T01n0006_001:0182c02_7"
    },
    {
        "source_sentence": "我滅度後若有比丘言：『我見佛口受，是法、是律、是教。』",
        "translation": "After my extinction, if a monk says, 'I see the Buddha's mouth and receive it, this is the Dharma, this is the vinaya, and this is the teaching.'",
        "source": "T01n0006_001:0182c02_8"
    },
    {
        "source_sentence": "然其言說不近不經而虧損法，當持法句、經所言、律所見，為解說之。",
        "translation": "However, if someone's words don't approach or follow the sūtras and lack the Dharma, they should retain the words of the Dharma, what the sūtras say, and what the vinaya sees to explain them for their understanding.",
        "source": "T01n0006_001:0182c04_0"
    },
    {
        "source_sentence": "若經不入與法意諍則當諫曰：『賢者且聽，佛不說是，吾子妄受；",
        "translation": "If the sūtra doesn't enter into a dispute with the meaning of the teaching, then you should admonish him, saying, 'Good man, listen attentively. The Buddha won't say this; my son will accept it falsely.",
        "source": "T01n0006_001:0182c05_1"
    },
    {
        "source_sentence": "與法意違，非法非律，不如佛教，當知棄是。』",
        "translation": "It's contrary to the meaning of the teaching, unlawful and non- vinaya, not like Buddhism, so you should know that it's abandoned.'",
        "source": "T01n0006_001:0182c07_0"
    },
    {
        "source_sentence": "若有比丘言：『我所止得，依聖眾有法戒者面受，是法是律是教。』",
        "translation": "Suppose a monk says, 'I'll stop and receive it face-to-face based on the noble ones who rely on the teachings and precepts that exist in the dharmas of the sages, which are the Dharma, the vinaya, and the teachings.'",
        "source": "T01n0006_001:0182c07_1"
    },
    {
        "source_sentence": "然其言說，不近不經虧損正法，當持法句、經義、律語，為解說之。",
        "translation": "However, their words and explanations don't approach or offend the right teaching, so they should maintain the words of the teaching, the meaning of the sūtras, and the words of the vinaya to explain it for them.",
        "source": "T01n0006_001:0182c09_2"
    },
    {
        "source_sentence": "若經不入與法意諍則當諫謂：『賢者且聽，比丘眾者知法曉律。",
        "translation": "If the sūtras don't enter into a dispute with the meaning of the teaching, then they should admonish him, saying, 'Good man, listen, monks, you know the teaching and understand the precepts.",
        "source": "T01n0006_001:0182c10_3"
    },
    {
        "source_sentence": "此非法律，吾子妄受，不應於經與法意違，不如佛教，當知棄是。』",
        "translation": "This is not the Dharma, and my son accepted it falsely; he shouldn't contradict the meaning of the sūtras and the teachings, which are not as good as Buddhism, so you should know that he abandons them.'",
        "source": "T01n0006_001:0182c12_4"
    },
    {
        "source_sentence": "若有比丘言：『我面從耆舊長老者口受，是法是律是教。』",
        "translation": "If a monk says, 'My face is received verbally from an elderly old man, this is the Dharma, this is the vinaya, and this is the teaching.'",
        "source": "T01n0006_001:0182c13_5"
    },
    {
        "source_sentence": "然其言教不近不經虧損正法，當持法句、經義語，為解說之。",
        "translation": "However, if their words and teachings don't approach or offend the right teaching, they should maintain the words of the teaching and the meaning of the sūtras and explain them for their understanding.",
        "source": "T01n0006_001:0182c14_6"
    },
    {
        "source_sentence": "若經不入與法意違則當諫謂：『賢者且聽，耆舊長老知法曉律，此非法律，",
        "translation": "If the sūtras don't enter and contradict the meaning of the teaching, then you should admonish them, saying, 'Good man, listen.",
        "source": "T01n0006_001:0182c16_7"
    },
    {
        "source_sentence": "吾子妄受；",
        "translation": "My son accepted it falsely.",
        "source": "T01n0006_001:0182c18_0"
    },
    {
        "source_sentence": "不應於經與法意違，不如律教，當知棄是。』",
        "translation": "You shouldn't contradict the meaning of the sūtras and the teachings by disobeying the vinaya, so you should know that you're abandoning them.'",
        "source": "T01n0006_001:0182c18_1"
    },
    {
        "source_sentence": "若有比丘言：『我得近賢才高明智達福慧眾所宗事面從受，是經法律教。』",
        "translation": "Suppose there's a monk who says, 'I've attained the faculty to receive the teachings of the doctrine taught by the multitude of virtuous people who are approaching the wise and high-minded with knowledge and wisdom, which are the sūtras and legal teachings.'",
        "source": "T01n0006_001:0182c19_2"
    },
    {
        "source_sentence": "然其言說不近不經虧損正法，當持法句義解說之。",
        "translation": "However, if their words don't approach or go along with the right teaching and diminish the right teaching, they should uphold the meaning of the Dharma phrase and explain it clearly.",
        "source": "T01n0006_001:0182c20_3"
    },
    {
        "source_sentence": "若經不入與法意諍則當諫謂：『正賢者且聽，賢哲高明曉法律，此非法律，",
        "translation": "If the sūtra doesn't enter into a dispute with the meaning of the teaching, then he should admonish it, saying, 'Should you, good man, listen. Good men and wise men are so noble in understanding the teaching that this is not the teaching.",
        "source": "T01n0006_001:0182c22_0"
    },
    {
        "source_sentence": "吾子妄受；",
        "translation": "My son accepted it falsely.",
        "source": "T01n0006_001:0182c23_1"
    },
    {
        "source_sentence": "不應於經與法意違，不如佛教，知棄是。』",
        "translation": "You shouldn't disagree with the meaning of the sūtras and the teachings, which is not like Buddhism, knowing that you're abandoning them.'",
        "source": "T01n0006_001:0182c23_2"
    },
    {
        "source_sentence": "「又復阿難！",
        "translation": "Again, Ānanda!",
        "source": "T01n0006_001:0182c24_3"
    },
    {
        "source_sentence": "若有言：『我得從佛受是法語。』",
        "translation": "Suppose someone says, 'I'll receive this teaching from the Buddha.'",
        "source": "T01n0006_001:0182c25_4"
    },
    {
        "source_sentence": "而其言謬不合經法；",
        "translation": "Their words were inconsistent with the teachings of the scriptures.",
        "source": "T01n0006_001:0182c25_5"
    },
    {
        "source_sentence": "若有言：『我從依聖眾奉法者受。』",
        "translation": "If someone says, 'I'll accept it from the noble people who rely on me to serve the Dharma.'",
        "source": "T01n0006_001:0182c26_6"
    },
    {
        "source_sentence": "而其言謬不合經法；",
        "translation": "Their words were inconsistent with the teachings of the scriptures.",
        "source": "T01n0006_001:0182c27_0"
    },
    {
        "source_sentence": "若復言：『我口從耆舊長老受是。』",
        "translation": "If he also says, 'I'll accept this from the elderly old man with my mouth.'",
        "source": "T01n0006_001:0182c27_1"
    },
    {
        "source_sentence": "其言錯謬不合經法；",
        "translation": "Their words were incoherent and did not accord with the teachings of the scriptures.",
        "source": "T01n0006_001:0182c28_2"
    },
    {
        "source_sentence": "若言：『我從賢才高明智大福慧面受是語。』",
        "translation": "If someone says, 'I'll accept this kind of speech from the face of goodness, talent, high insight, wisdom, great merit, and wisdom.'",
        "source": "T01n0006_001:0182c28_3"
    },
    {
        "source_sentence": "而其言非、不合經法；",
        "translation": "What they say is not true and does not accord with the teachings of the scriptures.",
        "source": "T01n0006_001:0182c29_4"
    },
    {
        "source_sentence": "當舉佛語以解曉之，趣使其人入經承律，以為詳說佛經法教，聖眾所承，",
        "translation": "You should cite the Buddha’s words in order to understand and awaken them, so as to enable people to enter into the scriptures and receive the Vinaya. In order to explain in detail the doctrine of the Buddha’s scriptures that are taught by holy beings,",
        "source": "T01n0006_001:0183a01_5"
    },
    {
        "source_sentence": "長老所明，賢才所識，賢者諦受，如律教無得諍。",
        "translation": "What the elder explains, what the wise man knows, and what the wise man accepts with respect, as the Vinaya teaches, there's no gain or loss.",
        "source": "T01n0006_001:0183a02_6"
    },
    {
        "source_sentence": "當知持是四。",
        "translation": "You should know that maintaining is four.",
        "source": "T01n0006_001:0183a04_0"
    },
    {
        "source_sentence": "若彼，阿難！",
        "translation": "If they do, Ānanda!",
        "source": "T01n0006_001:0183a04_1"
    },
    {
        "source_sentence": "有是四暗，虧損正法，當為分別，令棄邪媚受四正意，是為受持護法者也。",
        "translation": "These are the four darknesses that harm the right teaching, which should be discerned so that they abandon wrong and deceptive forms of sexual misconduct and receive the four right intentions, which is called someone who retains and protects the teaching.",
        "source": "T01n0006_001:0183a04_2"
    },
    {
        "source_sentence": "其不承經戒者，眾比丘當黜之，稊稗不去害善穀苗，弟子不善壞我道法，",
        "translation": "Those who don't accept the sūtras and precepts will be expelled by the monks, but they won't harm good grains or seedlings, and their disciples won't well disparage my teaching.",
        "source": "T01n0006_001:0183a06_3"
    },
    {
        "source_sentence": "當相檢校，無得以佛去故不承用教。",
        "translation": "They should examine each other, but they won't be allowed to leave the Buddha and therefore won't accept his teaching.",
        "source": "T01n0006_001:0183a07_4"
    },
    {
        "source_sentence": "世有沙門，奉行經戒，則天下得福，天神皆喜。",
        "translation": "If there are śramaṇas in the world who uphold the sūtras and precepts, the whole world will attain blessedness, and gods and goddesses will all rejoice.",
        "source": "T01n0006_001:0183a08_5"
    },
    {
        "source_sentence": "若聞在所，有明經比丘、長老比丘、新人學者，當從諮受；",
        "translation": "If there are any bhikṣus who teach the scriptures, senior bhikṣus, or newly enlightened scholars living in the assembly at their places, they should follow and consult with them.",
        "source": "T01n0006_001:0183a09_6"
    },
    {
        "source_sentence": "如是則清信之士、清信之女，樂供衣、食、牀臥、疾藥。",
        "translation": "Thus, a man with pure faith and a woman with pure faith delight in making offerings of clothing, food, bedding, and medicine for illness.",
        "source": "T01n0006_001:0183a11_7"
    },
    {
        "source_sentence": "比丘同道，不可不和，其墮地獄三惡道者，皆不和故耳。",
        "translation": "A monk who follows the same path should not be at odds with each other. Those who fall into hell or one of the three evil destinies are always at odds with each other.",
        "source": "T01n0006_001:0183a12_8"
    },
    {
        "source_sentence": "比丘不可轉相形笑言：『我知經多，汝知經少。』",
        "translation": "A monk shouldn't change his appearance and laugh, saying, 'I know the sūtras are numerous, but you know the sūtras are few.'",
        "source": "T01n0006_001:0183a13_9"
    },
    {
        "source_sentence": "知多知少，各自行之。",
        "translation": "Knowing much and knowing little, they each practice it.",
        "source": "T01n0006_001:0183a14_10"
    },
    {
        "source_sentence": "言說應經者用，不合者棄，是佛所說，比丘所受，必善持之。",
        "translation": "Those who say the sūtras should be used and those who don't follow them discard what the Buddha teaches, and the monks who receive it will surely retain it well.",
        "source": "T01n0006_001:0183a15_11"
    },
    {
        "source_sentence": "若令如後，凡講論經，當言：『聞如是。",
        "translation": "If you cause them to do so later, whenever you teach a treatise or sūtra, you should say, 'I'll hear it like this.",
        "source": "T01n0006_001:0183a16_12"
    },
    {
        "source_sentence": "一時佛在某國某處，與某比丘俱說是經。』",
        "translation": "One time, the Buddha was in a certain place in a certain country or place with a certain monk who taught this sūtra.'",
        "source": "T01n0006_001:0183a17_13"
    },
    {
        "source_sentence": "若其經是，不得苟言非。",
        "translation": "If that sūtra is true, they can't say it's not true.",
        "source": "T01n0006_001:0183a18_14"
    },
    {
        "source_sentence": "佛所說，相承用，如是者比丘法可得久住。」",
        "translation": "What the Buddha teaches, they inherit each other, and thus the monk's teaching can abide for a long time.",
        "source": "T01n0006_001:0183a18_15"
    },
    {
        "source_sentence": "彼時，佛請賢者阿難，俱之波旬國，弟子皆行。",
        "translation": "At the time, the Buddha invited the good man Ānanda to travel with him to the country of Pāpīyān, where his disciples were all traveling.",
        "source": "T01n0006_001:0183a19_16"
    },
    {
        "source_sentence": "佛以樂夫延，歷城中去，到止城外禪頭園中。",
        "translation": "The Buddha, delighted with Fuyan, left the city and went to stay in the meditation grove at the top of his head outside the city.",
        "source": "T01n0006_001:0183a20_17"
    },
    {
        "source_sentence": "波旬豪姓有諸華氏，聞佛來到皆出作禮，稽首畢一面坐。",
        "translation": "When the noble family of Pāpīyān and other members of the Hua family heard that the Buddha was coming, they all came out to pay homage and bowed their heads at one side.",
        "source": "T01n0006_001:0183a21_18"
    },
    {
        "source_sentence": "佛告諸華氏：「智者居家，恭儉節用，所奉有四，用得歡喜。",
        "translation": "The Buddha told the flowery people, A wise person lives at home with respect and frugality, and there are four ways to rejoice when he serves them.",
        "source": "T01n0006_001:0183a23_19"
    },
    {
        "source_sentence": "一為供養父母妻子，二為瞻視人客奴婢，三為給施親屬知友，四為奉事君天正神沙門道士。",
        "translation": "One is to make offerings to their parents and wives, two are to look after the guest slaves and maids, three are to give them to their relatives and friends, and four are to serve the ascetic monks of the ruler's true spirit.",
        "source": "T01n0006_001:0183a24_20"
    },
    {
        "source_sentence": "是謂知生全身安家，得力得色，富足名聞，死得上天。」",
        "translation": "This is called knowing that you'll be born whole-heartedly at home, gain strength and form, become wealthy and renowned, and attain higher heaven when you die.",
        "source": "T01n0006_001:0183a26_21"
    },
    {
        "source_sentence": "佛為諸華氏說法正化若干要語，皆歡喜去。",
        "translation": "The Buddha preached the Dharma for the various essentials of righteousness and transformation to the flowery people, and they all departed joyfully.",
        "source": "T01n0006_001:0183a27_22"
    },
    {
        "source_sentence": "有華氏子淳，獨留，起整衣服，長跪白佛：「欲設微食，願與聖眾，俱屈威神。」",
        "translation": "A son of the Hua family, Shun, stayed alone, got up and straightened his clothes, knelt down long enough to tell the Buddha, Wishing to set up a small meal, I'd like to join the noble ones who are both bent over their authority.",
        "source": "T01n0006_001:0183a28_23"
    },
    {
        "source_sentence": "佛以慈哀默而可之。",
        "translation": "The Buddha accepted it with compassion and silence.",
        "source": "T01n0006_001:0183b01_24"
    },
    {
        "source_sentence": "淳喜為禮而歸，調作濃美，嚴飾室內，晨敷牀座畢，行白佛：「食具已辦，",
        "translation": "Purely delighted, he paid his respects and returned home. cooked a rich and delicate dish to adorn the room. After setting up his seat in the morning, he said to the Buddha, “The food preparation has been done.",
        "source": "T01n0006_001:0183b02_25"
    },
    {
        "source_sentence": "唯聖知時。」",
        "translation": "It's only when the sage knows it.",
        "source": "T01n0006_001:0183b03_26"
    },
    {
        "source_sentence": "佛與弟子，俱到其舍，就高座於眾前坐，淳手自斟酌，奉鉢致漿。",
        "translation": "The Buddha and his disciples all went to the monastery, sat on their high seats in front of the assembly, poured wine with their palms joined together, presented bowls, and offered wine.",
        "source": "T01n0006_001:0183b04_0"
    },
    {
        "source_sentence": "有惡比丘，已欲取器，佛知之，淳念聖恩，善意供養，行澡水畢，取小牀坐佛前，",
        "translation": "There was a bad bhikṣu who wished to take the water vessel. Knowing this, the Buddha offered it to him with good intentions as an offering for his holy benevolence. After he had bathed and drenched himself with water, he took a small cushion and sat before the Buddha.",
        "source": "T01n0006_001:0183b05_1"
    },
    {
        "source_sentence": "「請賢聖慈智，　　已度到彼岸，",
        "translation": "“Invited by the wise and holy, kind and knowledgeable, Having crossed over to the other shore,",
        "source": "T01n0006_001:0183b07_2"
    },
    {
        "source_sentence": "　法御為折疑，　　將幾沙門輩。」",
        "translation": "The Dharma king wanted to dispel doubts, so he led a group of ascetics.",
        "source": "T01n0006_001:0183b07_2"
    },
    {
        "source_sentence": "說頌問曰：佛告淳：「沙門有四，當識別之。",
        "translation": "He spoke a verse and asked, The Buddha told Jun, There are four ascetics who should be distinguished.",
        "source": "T01n0006_001:0183b07_2"
    },
    {
        "source_sentence": "一曰行道殊勝，二曰達道能言，三曰依道生活，四曰為道作穢。",
        "translation": "One, the practice of the path is superior, two, the attainment of the path can speak, three, living according to the path, and four, creating defilement for the sake of the path.",
        "source": "T01n0006_001:0183b10_3"
    },
    {
        "source_sentence": "何謂殊勝？",
        "translation": "What's called superior?",
        "source": "T01n0006_001:0183b12_4"
    },
    {
        "source_sentence": "佛所說法，不可稱量，能行無比，降心能度，憂畏為法，御導世間，是輩沙門為最殊勝。",
        "translation": "The Dharma preached by the Buddha cannot be measured; it is incomparable in all respects. It can be practiced and overcome by one who subdues his mind with a mind free of regret and fear, thereby protecting and guiding the world. This group of śramaṇas is the most distinguished [in this regard].",
        "source": "T01n0006_001:0183b12_5"
    },
    {
        "source_sentence": "何謂能言？",
        "translation": "What's meant by being able to speak?",
        "source": "T01n0006_001:0183b14_6"
    },
    {
        "source_sentence": "佛所稱貴微妙之法，體解其情行之不疑，亦能為人演說道跡，是輩沙門，",
        "translation": "This is a group of śramaṇas who believe that the doctrine taught by the Buddha is valuable and subtle, that he understands its essence without doubt in all his thoughts and practices, and that he can expound the teaching for others.",
        "source": "T01n0006_001:0183b14_7"
    },
    {
        "source_sentence": "為愍能言。",
        "translation": "It's because it's crude and capable of speech.",
        "source": "T01n0006_001:0183b16_8"
    },
    {
        "source_sentence": "何謂依道？",
        "translation": "What's meant by the path of reliance?",
        "source": "T01n0006_001:0183b16_9"
    },
    {
        "source_sentence": "念在自守，勤綜學業，一向不迴，孜孜無倦，以法自養，是輩沙門，為知生活。",
        "translation": "They are self-disciplined, diligent in learning and practice, never turning back. They strive tirelessly and zealously to support themselves by means of the Dharma. This group of śramaṇas know their livelihood.",
        "source": "T01n0006_001:0183b16_10"
    },
    {
        "source_sentence": "何謂作穢？",
        "translation": "What's meant by creating defilement?",
        "source": "T01n0006_001:0183b18_11"
    },
    {
        "source_sentence": "恣意所樂，依恃種姓，專為穢行，為眾致議，不敬佛語，亦不畏罪，是輩沙門為道作穢；",
        "translation": "Relying on their castes and clans, they indulge exclusively in defiled behavior. They discuss matters with the assembly of bhikṣus without paying respect to the Buddha’s words or fearing crimes. This group of śramaṇas create defilement for the sake of the path.",
        "source": "T01n0006_001:0183b18_12"
    },
    {
        "source_sentence": "凡人見聞，將謂在道，學淨智者，如此而已。",
        "translation": "Ordinary people who see and hear it will think it's the path, and those who train in pure cognition are simply like this.",
        "source": "T01n0006_001:0183b21_0"
    },
    {
        "source_sentence": "當知是中，有真有偽，有善有惡，不可齊同以為一也。",
        "translation": "You should know that within this, there's truth and hypocrisy, good and evil, which can't be combined into one.",
        "source": "T01n0006_001:0183b22_0"
    },
    {
        "source_sentence": "彼不善者，為賢致謗，是故佛律，黜夫惡者，譬如苗中生草，不去害禾。",
        "translation": "Those who are unwholesome criticize because of their goodness, which is why the Buddha's vinaya removes those who are evil, like growing grass in a seedling and not harming grain.",
        "source": "T01n0006_001:0183b23_1"
    },
    {
        "source_sentence": "世多此輩，內懷穢濁，外如清淨，若知福者，信心奉道，終不為彼起恨想也。",
        "translation": "Many of these people in the world harbor impure thoughts internally but pure thoughts externally. If they know meritorious deeds, they believe in them and serve Buddhism so as not to give rise to feelings of hatred toward them.",
        "source": "T01n0006_001:0183b24_2"
    },
    {
        "source_sentence": "識善之人，修己遠惡除欲怒癡，故得道疾。」",
        "translation": "A conscious person who cultivates goodness and distances himself from evil and rids himself of desire, anger, and delusion will therefore attain the disease of the path.",
        "source": "T01n0006_001:0183b26_3"
    },
    {
        "source_sentence": "佛說已，淳歡喜。",
        "translation": "Having said this, the Buddha was overjoyed.",
        "source": "T01n0006_001:0183b27_4"
    },
    {
        "source_sentence": "般泥洹經卷上",
        "translation": "Parinirvāṇa-sūtra, vol. 1",
        "source": "T01n0006_001:0183b28_0"
    }
]