[
    {
        "source_sentence": "佛說長阿含經卷第六",
        "translation": "Foshuo Chang ahan jing jing, vol. 6",
        "source": "T01n0001_006:0036b25_0"
    },
    {
        "source_sentence": "後秦弘始年佛陀耶舍共竺佛念譯",
        "translation": "Translated by Zhu Fonian at Buddhayaśas in the Hongshi year of the Later Qin dynasty",
        "source": "T01n0001_006:0036b27_0"
    },
    {
        "source_sentence": "（五）第二分初小緣經第一",
        "translation": "(5) The First Part of the Second Part of the Sutra on Lesser Conditions",
        "source": "T01n0001_006:0036b28_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛在舍衛國清信園林鹿母講堂，與大比丘眾千二百五十人俱。",
        "translation": "Thus I have heard. At one time the Buddha was staying at Sāvatthī, in the Deer-Mother’s Assembly Hall of the Pure Faithful Grove and Deer Park in Sāvatthī, accompanied by one thousand two hundred and fifty disciples.",
        "source": "T01n0001_006:0036b29_0"
    },
    {
        "source_sentence": "爾時，有二婆羅門以堅固信往詣佛所，出家為道，一名婆悉吒，二名婆羅墮。",
        "translation": "At the time, there were two Brāhmaṇas who went to the Buddha with firm faith and renounced family life as a religious practitioner, one named Vasiṣṭha and another named Vārāṇasī.",
        "source": "T01n0001_006:0036c02_0"
    },
    {
        "source_sentence": "爾時，世尊於靜室出，在講堂上彷徉經行。",
        "translation": "At the time, the Bhagavān emerged from his secluded room and wandered up and down in the lecture hall.",
        "source": "T01n0001_006:0036c03_1"
    },
    {
        "source_sentence": "時，婆悉吒見佛經行，即尋速疾詣婆羅墮，而語之言：「汝知不耶？",
        "translation": "When Vasiṣṭha saw the Buddha walking in meditation, he quickly approached Vārāṇasī and said to him, Do you know?",
        "source": "T01n0001_006:0036c04_2"
    },
    {
        "source_sentence": "如來今者出於靜室，堂上經行，我等可共詣世尊所，儻聞如來有所言說。」",
        "translation": "Now that the Tathāgata has emerged from his secluded room and walked up to the hall, we can go together to the Bhagavān and hear what the Tathāgata says.",
        "source": "T01n0001_006:0036c06_3"
    },
    {
        "source_sentence": "時，婆羅墮聞其語已，即共詣世尊所，頭面禮足，隨佛經行。",
        "translation": "Having heard these words, Vārāṇasī came to the place where the World-honored One was. They bowed their foreheads at his feet and followed the Buddha’s lead in following the practice of meditation.",
        "source": "T01n0001_006:0036c08_4"
    },
    {
        "source_sentence": "爾時，世尊告婆悉吒曰：「汝等二人出婆羅門種，以信堅固於我法中出家修道耶？」",
        "translation": "It was then that the Bhagavān addressed Vāseṭṭha, Are you two of the Brāhmaṇa family who leave home and cultivate your faith so strongly in my teaching?",
        "source": "T01n0001_006:0036c09_5"
    },
    {
        "source_sentence": "答曰：「如是！」",
        "translation": "He replied, So it is!",
        "source": "T01n0001_006:0036c11_6"
    },
    {
        "source_sentence": "佛言：「婆羅門！",
        "translation": "The Buddha said, Brāhmaṇa!",
        "source": "T01n0001_006:0036c11_7"
    },
    {
        "source_sentence": "今在我法中出家為道，諸婆羅門得無嫌責汝耶？」",
        "translation": "Now that you've renounced home in my teaching as a religious, will the Brāhmaṇas attain freedom from blameworthiness?",
        "source": "T01n0001_006:0036c11_8"
    },
    {
        "source_sentence": "答曰：「唯然！",
        "translation": "He replied, Yes!",
        "source": "T01n0001_006:0036c13_9"
    },
    {
        "source_sentence": "蒙佛大恩，出家修道，實自為彼諸婆羅門所見嫌責。」",
        "translation": "Because of the Buddha's great kindness, he left home and cultivated his path, which is really what those brāhmaṇas see and resent him.",
        "source": "T01n0001_006:0036c13_10"
    },
    {
        "source_sentence": "佛言：「彼以何事而嫌責汝？」",
        "translation": "The Buddha said, What's the reason they resented you?",
        "source": "T01n0001_006:0036c14_11"
    },
    {
        "source_sentence": "尋白佛言：「彼言：『我婆羅門種最為第一，餘者卑劣；",
        "translation": "They said, “We are the foremost among the brāhmaṇas. The others are inferior.",
        "source": "T01n0001_006:0036c15_12"
    },
    {
        "source_sentence": "我種清白，餘者黑冥；",
        "translation": "My seeds are white and white, while the rest are black and dark.",
        "source": "T01n0001_006:0036c16_13"
    },
    {
        "source_sentence": "我婆羅門種出自梵天，從梵口生，於現法中得清淨解，後亦清淨；",
        "translation": "I, a brāhmaṇa, came from the god Brahmā and am born of his mouth. Having attained pure understanding in regard to the present life, I will also attain purity thereafter.",
        "source": "T01n0001_006:0036c16_14"
    },
    {
        "source_sentence": "汝等何故捨清淨種，入彼瞿曇異法中耶？』",
        "translation": "Why are you abandoning the pure seeds and entering that different teaching of Gautama?'",
        "source": "T01n0001_006:0036c18_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T01n0001_006:0036c19_16"
    },
    {
        "source_sentence": "彼見我於佛法中出家修道，以如此言而呵責我。」",
        "translation": "Seeing me leaving home and cultivating the path in the Buddha's teaching, they rebuke me with such words.",
        "source": "T01n0001_006:0036c19_17"
    },
    {
        "source_sentence": "佛告婆悉吒：「汝觀諸人愚冥無識猶如禽獸，虛假自稱：『婆羅門種最為第一，",
        "translation": "The Buddha said to Vāseṭṭha: You should observe that all the people are ignorant and ignorant, like birds and beasts. They falsely claim that the brāhmaṇa class is the foremost among them.",
        "source": "T01n0001_006:0036c20_18"
    },
    {
        "source_sentence": "餘者卑劣；",
        "translation": "The others are inferior.",
        "source": "T01n0001_006:0036c22_19"
    },
    {
        "source_sentence": "我種清白，餘者黑冥；",
        "translation": "My seeds are white and white, while the rest are black and dark.",
        "source": "T01n0001_006:0036c22_20"
    },
    {
        "source_sentence": "我婆羅門種出自梵天，從梵口生，現得清淨，後亦清淨。』",
        "translation": "My brāhmaṇa family comes from the Brahma gods, arises from the mouth of Brahma, and now attains purity, which will be pure in the future.'",
        "source": "T01n0001_006:0036c23_21"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0036c24_22"
    },
    {
        "source_sentence": "今我無上正真道中不須種姓，不恃吾我憍慢之心，俗法須此，我法不爾。",
        "translation": "Now, I don't need a family name in the unsurpassed true path, and I don't rely on self or arrogance. The secular teaching requires this, but my teaching isn't like that.",
        "source": "T01n0001_006:0036c24_23"
    },
    {
        "source_sentence": "若有沙門、婆羅門，自恃種姓，懷憍慢心，於我法中終不得成無上證也。",
        "translation": "If there are ascetics or priests who rely on their own castes and harbor conceit, they'll never attain the unsurpassed realization of self and dharmas.",
        "source": "T01n0001_006:0036c26_24"
    },
    {
        "source_sentence": "若能捨離種姓，除憍慢心，則於我法中得成道證，堪受正法。",
        "translation": "If someone can abandon their castes and rid themselves of conceit, then they'll attain realization of the path in my teaching and be able to receive the right teaching.",
        "source": "T01n0001_006:0036c28_25"
    },
    {
        "source_sentence": "人惡下流，我法不爾。」",
        "translation": "People go downstream badly, but my teaching isn't like that.",
        "source": "T01n0001_006:0036c29_26"
    },
    {
        "source_sentence": "佛告婆悉吒：「有四姓種，善惡居之，智者所舉，智者所責。",
        "translation": "The Buddha told Vāseṭṭha, There are four castes of people who live there, good and bad, which are raised by the wise and blamed by the wise.",
        "source": "T01n0001_006:0037a01_27"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T01n0001_006:0037a02_28"
    },
    {
        "source_sentence": "一者剎利種，二者婆羅門種，三者居士種，四者首陀羅種。",
        "translation": "They are (1) the kṣatriya caste, (2) the brāhmaṇa caste, (3) the vaiśya caste, and (4) the śūdra caste.",
        "source": "T01n0001_006:0037a02_29"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037a04_30"
    },
    {
        "source_sentence": "汝聽剎利種中有殺生者，有盜竊者，有婬亂者，有欺妄者，有兩舌者，",
        "translation": "“May you hear that among the kṣatriya people there are some who kill, some who steal, some who commit injustice, some who lie, and some who speak falsehoods.",
        "source": "T01n0001_006:0037a04_31"
    },
    {
        "source_sentence": "有惡口者，有綺語者，有慳貪者，有嫉妬者，有邪見者；",
        "translation": "Some speak harshly, some speak fancy words, some are stingy and greedy, some are jealous of others, and some hold wrong views.",
        "source": "T01n0001_006:0037a06_32"
    },
    {
        "source_sentence": "婆羅門種、居士種、首陀羅種亦皆如是，雜十惡行。",
        "translation": "The brāhmaṇa, vaiśya, and śūdra classes are likewise, combining the ten bad practices.",
        "source": "T01n0001_006:0037a07_33"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037a08_34"
    },
    {
        "source_sentence": "夫不善行有不善報，為黑冥行則有黑冥報，若使此報獨在剎利、居士、首陀羅種，",
        "translation": "An unwholesome action has an unwholesome retribution, and a black or dark action has a black or dark retribution. If this retribution were to occur only among the kṣatriyas, vaiśyas, and śūdra classes,",
        "source": "T01n0001_006:0037a08_35"
    },
    {
        "source_sentence": "不在婆羅門種者，則婆羅門種應得自言：『我婆羅門種最為第一，餘者卑劣；",
        "translation": "If someone does not belong to the brāhmaṇa class, then the brāhmaṇa class should be able to claim that they are the foremost among their class. The others are inferior.",
        "source": "T01n0001_006:0037a10_36"
    },
    {
        "source_sentence": "我種清白，餘者黑冥；",
        "translation": "My seeds are white and white, while the rest are black and dark.",
        "source": "T01n0001_006:0037a12_37"
    },
    {
        "source_sentence": "我婆羅門種出自梵天，從梵口生，現得清淨，後亦清淨。』",
        "translation": "My brāhmaṇa family comes from the Brahma gods, arises from the mouth of Brahma, and now attains purity, which will be pure in the future.'",
        "source": "T01n0001_006:0037a12_38"
    },
    {
        "source_sentence": "若使行不善行有不善報，為黑冥行有黑冥報，必在婆羅門種、剎利、居士、首陀羅種者，",
        "translation": "If someone were to do unwholesome actions and have unwholesome consequences, and if they did black and dark actions with black and dark consequences, they would surely be of the brāhmaṇa, kṣatriya, vaiśya, or śūdra classes.",
        "source": "T01n0001_006:0037a14_39"
    },
    {
        "source_sentence": "則婆羅門不得獨稱：『我種清淨，最為第一。』",
        "translation": "Then the Brāhmaṇa won't be able to claim alone, 'My seed is pure and the best.'",
        "source": "T01n0001_006:0037a16_40"
    },
    {
        "source_sentence": "「婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037a17_41"
    },
    {
        "source_sentence": "若剎利種中有不殺者，有不盜、不婬、不妄語、不兩舌、不惡口、不綺語、不慳貪、不嫉妬、不邪見；",
        "translation": "Among the kṣatriya people, there are those who abstain from killing. They abstain from taking what is not given, sexual misconduct, false speech, divisive speech, harsh speech, flattery, stinginess and greed, envy and jealousy, and wrong views.",
        "source": "T01n0001_006:0037a17_42"
    },
    {
        "source_sentence": "婆羅門種、居士、首陀羅種亦皆如是，同修十善。",
        "translation": "The brāhmaṇas, vaiśyas, and śūdra people are all likewise, cultivating the ten good qualities together.",
        "source": "T01n0001_006:0037a19_43"
    },
    {
        "source_sentence": "夫行善法必有善報，行清白行必有白報，若使此報獨在婆羅門，不在剎利、居士、首陀羅者，",
        "translation": "A good practice necessarily has a good retribution, and a pure practice necessarily has a white retribution. If this retribution were to occur only among the brāhmaṇas and not among the kṣatriyas, vaiśyas, or śūdra people, it would be possible for them to attain [the fruit of enlightenment] by themselves.",
        "source": "T01n0001_006:0037a20_44"
    },
    {
        "source_sentence": "則婆羅門種應得自言：『我種清淨，最為第一。』",
        "translation": "Then the Brāhmaṇa type should be able to say for themselves, 'My type is pure and the best.'",
        "source": "T01n0001_006:0037a22_45"
    },
    {
        "source_sentence": "若使四姓同有此報者，則婆羅門不得獨稱：『我種清淨，最為第一。』」",
        "translation": "If the four castes all had this reward, then the Brāhmaṇa wouldn't be able to claim alone, 'My seed is pure and the best.'",
        "source": "T01n0001_006:0037a23_46"
    },
    {
        "source_sentence": "佛告婆悉吒：「今者現見婆羅門種，嫁娶產生，與世無異，而作詐稱：『我是梵種，",
        "translation": "The Buddha said to Vāseṭṭha: Now we see that the brāhmaṇas, who are not different from the people of the world in terms of marriage and rebirth, deceitfully claim that they belong to the religious order.",
        "source": "T01n0001_006:0037a25_47"
    },
    {
        "source_sentence": "從梵口生，現得清淨，後亦清淨。』",
        "translation": "It arises from the mouth of Brahma and is purified in the present, and it's purified afterward.'",
        "source": "T01n0001_006:0037a26_48"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037a27_49"
    },
    {
        "source_sentence": "汝今當知，今我弟子，種姓不同，所出各異，於我法中出家修道，若有人問：『汝誰種姓？』",
        "translation": "Now you should know that my disciples now have different castes and different places to come out of, so if someone asks, 'Whose castes are you?'",
        "source": "T01n0001_006:0037a27_50"
    },
    {
        "source_sentence": "當答彼言：『我是沙門釋種子也。』",
        "translation": "You should reply to them, saying, 'I'm the ascetic or Śākyamuni seed.'",
        "source": "T01n0001_006:0037a29_51"
    },
    {
        "source_sentence": "亦可自稱：『我是婆羅門種，親從口生，從法化生，現得清淨，後亦清淨。』",
        "translation": "They can also claim to themselves, 'I am a brāhmaṇa who was born from my mouth and transformed by the Dharma, attained purity in the present and will be purified in the future.'",
        "source": "T01n0001_006:0037b01_52"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_006:0037b03_53"
    },
    {
        "source_sentence": "大梵名者即如來號，如來為世間眼，法為世間智，為世間法，為世間梵，",
        "translation": "The name Mahāprajñāpāramitā is the epithet of the Tathāgata. The Tathāgata is the worldly eye, the Dharma is the knowledge of the world, the dharma of the world, and the Brahma of the world.",
        "source": "T01n0001_006:0037b03_54"
    },
    {
        "source_sentence": "為世間法輪，為世間甘露，為世間法主。",
        "translation": "He's the wheel of the Dharma for the world, the ambrosia of the world, and the lord of the Dharma for the world.",
        "source": "T01n0001_006:0037b05_55"
    },
    {
        "source_sentence": "「婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037b06_56"
    },
    {
        "source_sentence": "若剎利種中有篤信於佛、如來、至真、等正覺，十號具足，篤信於法，",
        "translation": "If there are any among the kṣatriyas who have devoted faith in the Buddha, the Tathāgata, the Supreme Truth, and the Completely Enlightened One, whose ten epithets are complete, and who devote faith in the Dharma,",
        "source": "T01n0001_006:0037b06_57"
    },
    {
        "source_sentence": "信如來法，微妙清淨，現可修行，說無時節，示泥洹要，智者所知，非是凡愚所能及教；",
        "translation": "They believe that the Teaching of the Tathagata is subtle and pure, to be practiced in the present; they teach it without season or seasons, showing the essentials of nirvana. The wise know these teachings, which cannot be taught by ordinary ignorant people.",
        "source": "T01n0001_006:0037b07_58"
    },
    {
        "source_sentence": "篤信於僧，性善質直，道果成就，眷屬成就，佛真弟子法法成就；",
        "translation": "They are devoted to faith in the Sangha. Their nature is wholesome and straightforward; they have perfected the fruits of enlightenment, their followers are perfected, and truly are disciples of Buddha.",
        "source": "T01n0001_006:0037b09_59"
    },
    {
        "source_sentence": "所謂眾者，戒眾成就，定眾、慧眾、解脫眾、解脫知見眾成就。",
        "translation": "The so-called multitude is the accomplishment of the multitude of precepts, the accomplishment of the multitude of concentration, the multitude of wisdom, the multitude of liberation, and the accomplishment of the multitude of knowledge and vision of liberation.",
        "source": "T01n0001_006:0037b11_60"
    },
    {
        "source_sentence": "向須陀洹、得須陀洹；",
        "translation": "They proceed toward stream-entry and attain stream-entry.",
        "source": "T01n0001_006:0037b12_61"
    },
    {
        "source_sentence": "向斯陀含，得斯陀含；",
        "translation": "Toward the one who is once-returner he attains once-returning.",
        "source": "T01n0001_006:0037b13_0"
    },
    {
        "source_sentence": "向阿那含，得阿那含；",
        "translation": "Going toward the anāgāmi-phala, one attains the anāgāmi-phala.",
        "source": "T01n0001_006:0037b13_1"
    },
    {
        "source_sentence": "向阿羅漢，得阿羅漢；",
        "translation": "Going toward the arhat, one attains arhatship.",
        "source": "T01n0001_006:0037b13_2"
    },
    {
        "source_sentence": "四雙八輩，是為如來弟子眾也。",
        "translation": "The four pairs and eight groups are the assembly of disciples of the Tathāgata.",
        "source": "T01n0001_006:0037b14_3"
    },
    {
        "source_sentence": "可敬可尊，為世福田，應受人供；",
        "translation": "Venerable and venerable, they are a field of blessings for the world. They should receive human offerings.",
        "source": "T01n0001_006:0037b15_4"
    },
    {
        "source_sentence": "篤信於戒，聖戒具足，無有缺漏，無諸瑕隙，亦無點污，智者所稱，具足善寂。",
        "translation": "They earnestly believe in the precepts. The holy precepts are complete, without any deficiency or imperfection, free from blemishes or spots, and praised by wise people as being endowed with good quiescence.",
        "source": "T01n0001_006:0037b15_5"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037b17_6"
    },
    {
        "source_sentence": "諸婆羅門種、居士、首陀羅種亦應如是篤信於佛、信法、信眾，成就聖戒。",
        "translation": "The brāhmaṇas, vaiśyas, and śūdras should also thus earnestly believe in the Buddha, believe in the Dharma, believe in the Sangha, and perfect the noble precepts.",
        "source": "T01n0001_006:0037b18_0"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037b19_1"
    },
    {
        "source_sentence": "剎利種中亦有供養羅漢，恭敬禮拜者；",
        "translation": "Among the kṣatriya people there were also those who offered support to arhats and venerated and worshiped them.",
        "source": "T01n0001_006:0037b19_2"
    },
    {
        "source_sentence": "婆羅門、居士、首陀羅亦皆供養羅漢，恭敬禮拜。」",
        "translation": "Brāhmaṇas, householders, and śūdras all offered support to the arhat and venerated him.",
        "source": "T01n0001_006:0037b20_3"
    },
    {
        "source_sentence": "佛告婆悉吒：「今我親族釋種亦奉波斯匿王，宗事禮敬，波斯匿王復來供養禮敬於我，",
        "translation": "The Buddha said to Vāseṭṭha: At the present time my relatives, the Śākya clanspeople, also serve King Prasenajit and pay their respects to him.",
        "source": "T01n0001_006:0037b21_4"
    },
    {
        "source_sentence": "彼不念言：『沙門瞿曇出於豪族，我姓卑下；",
        "translation": "They do not think, “The śramaṇa Gautama is born into a powerful family and we are inferior in caste.",
        "source": "T01n0001_006:0037b23_5"
    },
    {
        "source_sentence": "沙門瞿曇出大財富、大威德家，我生下窮鄙陋小家故，致供養禮敬如來也。』",
        "translation": "The ascetic Gautama comes from a house of great wealth and great authority, and because I'm born in a humble, coarse, and small family, I offer support and venerate the Tathāgata.'",
        "source": "T01n0001_006:0037b24_6"
    },
    {
        "source_sentence": "波斯匿王於法觀法，明識真偽，故生淨信，致敬如來耳。",
        "translation": "King Prasenajit observed the Dharma from the Dharma and discerned what was true and what was false. Because of this he had pure faith in the Dharma and venerated the Tathāgata.",
        "source": "T01n0001_006:0037b26_7"
    },
    {
        "source_sentence": "「婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037b27_8"
    },
    {
        "source_sentence": "今當為汝說四姓本緣。",
        "translation": "Now, I will explain the original conditions of the four castes for you.",
        "source": "T01n0001_006:0037b28_9"
    },
    {
        "source_sentence": "天地始終，劫盡壞時，眾生命終皆生光音天，自然化生，以念為食，光明自照，",
        "translation": "At the beginning and end of the cosmic age, at the breaking up of the cosmic age, all beings die and are reborn in Ābhāsvara Heaven. Beings born through spontaneous transformation are sustained by thought; their light shines on its own.",
        "source": "T01n0001_006:0037b28_10"
    },
    {
        "source_sentence": "神足飛空，其後此地盡變為水，無不周遍。",
        "translation": "The foot of supernatural power flew up into the sky, and after that this land completely changed into water. It did not fail to reach everywhere.",
        "source": "T01n0001_006:0037c01_11"
    },
    {
        "source_sentence": "當於爾時，無復日月星辰，亦無晝夜年月歲數，唯有大冥。",
        "translation": "At that time, there would be no sun, moon, or stars, and no days, nights, years, months, or years, but only the great darkness.",
        "source": "T01n0001_006:0037c02_12"
    },
    {
        "source_sentence": "其後此水變成大地，光音諸天福盡命終，來生此間。",
        "translation": "After that, this water transformed into a great earth and the gods of Ābhāsvara Heaven were born here.",
        "source": "T01n0001_006:0037c03_13"
    },
    {
        "source_sentence": "雖來生此，猶以念食，神足飛空，身光自照，於此住久，各自稱言：『眾生！",
        "translation": "Even though they came and were born here, they still nourish themselves with mindfulness, flew up into the sky with supernormal powers, and illuminate themselves with their own light. For a long time living there, each of them says:",
        "source": "T01n0001_006:0037c04_14"
    },
    {
        "source_sentence": "眾生！』",
        "translation": "Sentient beings!'",
        "source": "T01n0001_006:0037c06_15"
    },
    {
        "source_sentence": "其後此地甘泉涌出，狀如酥蜜。",
        "translation": "After that, a sweet fountain sprang forth from this place, shaped like butter and honey.",
        "source": "T01n0001_006:0037c06_16"
    },
    {
        "source_sentence": "彼初來天性輕易者，見此泉已，默自念言：『此為何物？",
        "translation": "Seeing this fountain, the first-come goddess quietly thought to herself: What is this water?",
        "source": "T01n0001_006:0037c07_17"
    },
    {
        "source_sentence": "可試甞之。』",
        "translation": "Let's try to eat it.'",
        "source": "T01n0001_006:0037c08_18"
    },
    {
        "source_sentence": "即內指泉中，而試甞之，如是再三，轉覺其美，便以手抄自恣食之，如是樂著，",
        "translation": "He then pointed inward to the spring and tasted it. After tasting it three times like this, realizing its deliciousness, he ate with his own hands as freely as he wished.",
        "source": "T01n0001_006:0037c09_19"
    },
    {
        "source_sentence": "遂無厭足，其餘眾生復效食之，如是再三，復覺其美，食之不已，其身轉麤，",
        "translation": "The other sentient beings also ate it, and repeatedly and repeatedly perceived its deliciousness. They did not stop eating it; their bodies became coarse again and again.",
        "source": "T01n0001_006:0037c10_20"
    },
    {
        "source_sentence": "肌肉堅[革*卬]，失天妙色，無復神足，履地而行，身光轉滅，天地大冥。",
        "translation": "Their flesh became firm and they lost their marvelous divine form. Without any more supernormal powers, they walked on the ground while treading. The light of their bodies gradually disappeared, and heaven and earth were greatly darkened.",
        "source": "T01n0001_006:0037c12_21"
    },
    {
        "source_sentence": "「婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0037c14_22"
    },
    {
        "source_sentence": "當知天地常法，大冥之後，必有日月星像現於虛空，然後方有晝夜晦明、日月歲數。",
        "translation": "You should know that according to the eternal law of heaven and earth, after the great darkness there must be a sun, moon, stars, and images appearing in space. Only then will there be day and night, dull and bright, days and months, and years.",
        "source": "T01n0001_006:0037c14_23"
    },
    {
        "source_sentence": "爾時，眾生但食地味，久住世間，其食多者，顏色麤醜；",
        "translation": "At that time sentient beings simply ate the taste of the earth. Those who lived in the world for a long time ate abundantly, and their appearance was coarse and ugly.",
        "source": "T01n0001_006:0037c16_24"
    },
    {
        "source_sentence": "其食少者，色猶悅澤，好醜端正，於是始有；",
        "translation": "Those who ate sparingly the food were delightful and graceful in appearance, good-looking and ugly but handsome. This was the beginning of their existence.",
        "source": "T01n0001_006:0037c17_25"
    },
    {
        "source_sentence": "其端正者，生憍慢心，輕醜陋者；",
        "translation": "Those who are handsome will become conceited and despise those who are ugly.",
        "source": "T01n0001_006:0037c18_26"
    },
    {
        "source_sentence": "其醜陋者，生嫉惡心，憎端正者。",
        "translation": "The ugly one becomes jealous and hates the handsome one.",
        "source": "T01n0001_006:0037c19_27"
    },
    {
        "source_sentence": "眾生於是各共忿諍，是時甘泉自然枯涸，其後此地生自然地肥，色味具足，",
        "translation": "Each of the sentient beings then became angry, and at that time the sweet fountain dried up naturally. After that arose spontaneously from the soil on this earth, rich in color and taste.",
        "source": "T01n0001_006:0037c20_28"
    },
    {
        "source_sentence": "香潔可食，是時眾生復取食之，久住世間。",
        "translation": "When it's fragrant and edible, the sentient beings then again take it and eat it, remaining in the world for a long time.",
        "source": "T01n0001_006:0037c21_29"
    },
    {
        "source_sentence": "其食多者，顏色麤醜；",
        "translation": "Those who ate abundantly the food had coarse and ugly features.",
        "source": "T01n0001_006:0037c22_30"
    },
    {
        "source_sentence": "其食少者，色猶悅澤。",
        "translation": "The food is scarce but the color of the animals is pleasant and luxuriant.",
        "source": "T01n0001_006:0037c23_31"
    },
    {
        "source_sentence": "其端正者，生憍慢心，輕醜陋者；",
        "translation": "Those who are handsome will become conceited and despise those who are ugly.",
        "source": "T01n0001_006:0037c23_32"
    },
    {
        "source_sentence": "其醜陋者，生嫉惡心，憎端正者，眾生於是各共諍訟，是時地肥遂不復生。",
        "translation": "The ugly one becomes jealous and dislikes the handsome one, and the sentient beings then argue with each other. At that point, the fatness of the earth doesn't grow again.",
        "source": "T01n0001_006:0037c24_33"
    },
    {
        "source_sentence": "「其後此地復生麤厚地肥，亦香美可食，不如前者，是時眾生復取食之，",
        "translation": "“After that, thick and thick layers of earth appear on this land. It’s also fragrant and edible but not as good as the one before.",
        "source": "T01n0001_006:0037c26_34"
    },
    {
        "source_sentence": "久住世間。",
        "translation": "They've been in the world for a long time.",
        "source": "T01n0001_006:0037c27_35"
    },
    {
        "source_sentence": "其食多者，色轉麤醜，其食少者，色猶悅澤，端正醜陋，迭相是非，遂生諍訟，",
        "translation": "When the food is abundant, its color becomes coarse and ugly; when it is scarce, its color remains pleasing and lustrous. The people are handsome and ugly but they may or may not each other’s colors.",
        "source": "T01n0001_006:0037c27_36"
    },
    {
        "source_sentence": "地肥於是遂不復生；",
        "translation": "As a consequence, the soil and fertility will not grow again.",
        "source": "T01n0001_006:0037c29_37"
    },
    {
        "source_sentence": "其後此地生自然粳米，無有糠糩，色味具足，香潔可食；",
        "translation": "Later, this land produced uncooked rice that had no husks or edges and was endowed with color and taste. It was fragrant and edible.",
        "source": "T01n0001_006:0038a01_38"
    },
    {
        "source_sentence": "是時眾生復取食之，久住於世，便有男女，互共相視，漸有情欲，轉相親近，",
        "translation": "The sentient beings then again ate it. Once they lived in the world for a long time, and there were men and women who looked at each other. Sentient beings gradually developed desires and became intimate with each other.",
        "source": "T01n0001_006:0038a02_39"
    },
    {
        "source_sentence": "其餘眾生見已，語言：『汝所為非！",
        "translation": "Seeing them, the other sentient beings said, 'That's not what you did!'",
        "source": "T01n0001_006:0038a04_40"
    },
    {
        "source_sentence": "汝所為非！』",
        "translation": "What you do is wrong!'",
        "source": "T01n0001_006:0038a04_41"
    },
    {
        "source_sentence": "即排擯驅遣出於人外，過三月已，然後還歸。」",
        "translation": "After three months have passed, he'll be driven out and expelled from the human realm and returned home.",
        "source": "T01n0001_006:0038a05_42"
    },
    {
        "source_sentence": "佛告婆悉吒：「昔所非者，今以為是。",
        "translation": "The Buddha told Vāseṭṭha, What was wrong in the past is now considered right.",
        "source": "T01n0001_006:0038a06_43"
    },
    {
        "source_sentence": "時，彼眾生習於非法，極情恣欲，無有時節，以慙愧故，遂造屋舍，世間於是始有房舍。",
        "translation": "At the time, those sentient beings were accustomed to what was unlawful and indulged in extreme emotions and desires without any limit. Because of their shame, they built a dwelling for them. This is how the living quarters began to be constructed in the world.",
        "source": "T01n0001_006:0038a06_44"
    },
    {
        "source_sentence": "翫習非法，婬欲轉增，便有胞胎，因不淨生，世間胞胎始於是也。",
        "translation": "When sexual desire increases, there will be a foetal embryo. The foetal embryo is born because of impurity. This is how the worldly foetal embryo comes into being.",
        "source": "T01n0001_006:0038a08_45"
    },
    {
        "source_sentence": "時，彼眾生食自然粳米，隨取隨生，無可窮盡。",
        "translation": "At the time, those sentient beings were eating rice that came naturally and took it as they ate, and there was no limit to how much they could eat.",
        "source": "T01n0001_006:0038a10_46"
    },
    {
        "source_sentence": "時，彼眾生有懈惰者，默自念言：『朝食朝取，暮食暮取，於我勞勤，",
        "translation": "Those sentient beings who were lazy at that time remained silent and thought to themselves, “The morning meal is taken in the morning; the evening meal is taken at night.",
        "source": "T01n0001_006:0038a11_47"
    },
    {
        "source_sentence": "今欲併取，以終一日。』",
        "translation": "Now, I want to take it together for the rest of the day.'",
        "source": "T01n0001_006:0038a12_48"
    },
    {
        "source_sentence": "即尋併取；",
        "translation": "That is, they search for and apprehend together.",
        "source": "T01n0001_006:0038a13_49"
    },
    {
        "source_sentence": "於後等侶喚共取米，其人答曰：『我已併取，以供一日，汝欲取者，自可隨意。』",
        "translation": "When the latter group of people called out to collect rice together, the man answered, 'I've collected it together for one day; if you want to collect it, you can do as you like.'",
        "source": "T01n0001_006:0038a13_50"
    },
    {
        "source_sentence": "彼人復自念言：『此人黠慧，能先儲積，我今亦欲積粮，以供三日。』",
        "translation": "Again, that person thinks to himself, 'This man is wise and able to store up what he can; now, I want to store grain for three days.'",
        "source": "T01n0001_006:0038a15_51"
    },
    {
        "source_sentence": "其人即儲三日餘粮。",
        "translation": "That man then stored the remaining grain for three days.",
        "source": "T01n0001_006:0038a16_52"
    },
    {
        "source_sentence": "有餘眾生復來語言：『可共取米。』",
        "translation": "Some other sentient beings then came back and said, 'We can take the rice together.'",
        "source": "T01n0001_006:0038a17_53"
    },
    {
        "source_sentence": "答言：『吾已先積三日餘粮，汝欲取者可往自取。』",
        "translation": "He replied, 'I've already accumulated the remaining rice for three days; if you want to take it, go and get it yourself.'",
        "source": "T01n0001_006:0038a18_54"
    },
    {
        "source_sentence": "彼人復念：『此人黠慧，先積餘粮，以供三日，吾當效彼，積粮以供五日。』",
        "translation": "Again, that person thinks, 'This man of intelligence first accumulates the remaining grain for three days to make offerings, and I'll follow him and store it for five days to make offerings.'",
        "source": "T01n0001_006:0038a19_55"
    },
    {
        "source_sentence": "即便往取。",
        "translation": "He then went to get it.",
        "source": "T01n0001_006:0038a20_56"
    },
    {
        "source_sentence": "「時，彼眾生競儲積已，粳米荒穢，轉生糠糩，刈已不生。",
        "translation": "“At the time, those sentient beings were competing for a store of millet and rice, which was desolate and dirty, turning into uncooked grains that didn’t grow after mowing.",
        "source": "T01n0001_006:0038a21_0"
    },
    {
        "source_sentence": "時，彼眾生見此不悅，遂成憂迷，各自念言：『我本初生，以念為食，",
        "translation": "When those sentient beings saw this, they were displeased and became sad. Each thought to himself, “When I was born as a human being in the first existence my thoughts served as food for me.",
        "source": "T01n0001_006:0038a22_1"
    },
    {
        "source_sentence": "神足飛空，身光自照，於世久住，其後此地甘泉涌出，狀如酥蜜，香美可食，",
        "translation": "The Buddha flew up into the air with supernormal powers and his body shone brightly. He remained in the world for a long time, but after that sweet fountain of immortality emerged at this place, shaped like butter and honey, fragrant and edible.",
        "source": "T01n0001_006:0038a23_2"
    },
    {
        "source_sentence": "我等時共食之；",
        "translation": "We ate together at that time.",
        "source": "T01n0001_006:0038a25_3"
    },
    {
        "source_sentence": "食之轉久，其食多者，顏色麤醜；",
        "translation": "When they ate for a long time, those who ate abundantly ate with coarse and ugly features.",
        "source": "T01n0001_006:0038a25_4"
    },
    {
        "source_sentence": "其食少者，色猶悅澤。",
        "translation": "The food is scarce but the color of the animals is pleasant and luxuriant.",
        "source": "T01n0001_006:0038a26_5"
    },
    {
        "source_sentence": "由是食故，使我等顏色有異，眾生於是各懷是非，迭相憎嫉，是時甘泉自然枯竭，",
        "translation": "Because of this food, our appearances will be different. Sentient beings will thus each harbor right or wrong thoughts and hate each other. Then the sweet fountain will naturally dry up.",
        "source": "T01n0001_006:0038a26_6"
    },
    {
        "source_sentence": "其後此地生自然地肥，色味具足，香美可食，時我曹等復取食之。",
        "translation": "Then a naturally grown soil, rich in color and flavor, fragrant and edible, grew out of this land. We began to eat it again.",
        "source": "T01n0001_006:0038a28_7"
    },
    {
        "source_sentence": "其食多者，顏色麤醜，其食少者，顏色悅澤，眾生於是復懷是非，迭相憎嫉，",
        "translation": "Those who ate large ate with coarse and ugly complexions, while those who ate less ate with sweet and lustrous complexions. The sentient beings then harbored feelings of anger and hatred toward each other.",
        "source": "T01n0001_006:0038b01_8"
    },
    {
        "source_sentence": "是時地肥遂不復生。",
        "translation": "At that point, the earth's fat won't grow again.",
        "source": "T01n0001_006:0038b03_0"
    },
    {
        "source_sentence": "其後復生麤厚地肥，亦香美可食，時，我曹等復取食之；",
        "translation": "Then a thick rice plant grows, which is also fragrant and good to eat. At that time the whole group of us take it again and eat it.",
        "source": "T01n0001_006:0038b03_1"
    },
    {
        "source_sentence": "多食色麤，少食色悅，復生是非，共相憎嫉，是時地肥遂不復現。",
        "translation": "When they eat large amounts of food with coarse color and are delighted with small amounts of food, right or wrong views arise again, and when they share the same hatred and jealousy, the fat on the earth doesn't appear again.",
        "source": "T01n0001_006:0038b04_2"
    },
    {
        "source_sentence": "更生自然粳米，無有糠糩，時，我曹等復取食之，久住於世，其懈怠者，",
        "translation": "The rice that grows naturally has no husks or grains. When the rice is harvested, we once again take it and eat it. For a long time we have been living in the world.",
        "source": "T01n0001_006:0038b06_3"
    },
    {
        "source_sentence": "競共儲積，由是粳米荒穢，轉生糠糩，刈已不生，今當如何？』",
        "translation": "They competed to store up what they had, and as a result, the millet became desolate and turned into rice husks that didn't grow after being harvested, so what will happen now?'",
        "source": "T01n0001_006:0038b07_4"
    },
    {
        "source_sentence": "復自相謂言：『當共分地，別立幖幟。』",
        "translation": "Again, they said to each other, 'We'll share the land and set up a separate signpost.'",
        "source": "T01n0001_006:0038b09_5"
    },
    {
        "source_sentence": "即尋分地，別立幖幟。",
        "translation": "They then searched the different parts of the land and erected separate signposts.",
        "source": "T01n0001_006:0038b09_6"
    },
    {
        "source_sentence": "「婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0038b10_7"
    },
    {
        "source_sentence": "猶此因緣，始有田地名生。",
        "translation": "It's like this cause and condition that gives rise to the name arising when there's a field.",
        "source": "T01n0001_006:0038b10_8"
    },
    {
        "source_sentence": "彼時眾生別封田地，各立疆畔，漸生盜心，竊他禾稼，其餘眾生見已，",
        "translation": "The sentient beings then divided the land into separate plots of land and established boundaries, gradually developing thoughts of stealing. They stole others’ crops.",
        "source": "T01n0001_006:0038b11_9"
    },
    {
        "source_sentence": "語言：『汝所為非！",
        "translation": "They say, 'What you do is wrong!'",
        "source": "T01n0001_006:0038b12_10"
    },
    {
        "source_sentence": "汝所為非！",
        "translation": "What you do is wrong!",
        "source": "T01n0001_006:0038b13_11"
    },
    {
        "source_sentence": "自有田地，而取他物，自今已後，勿復爾也。』",
        "translation": "He owns his own land and takes the things of others, so from now on, he won't do it again.'",
        "source": "T01n0001_006:0038b13_12"
    },
    {
        "source_sentence": "其彼眾生猶盜不已，其餘眾生復重呵責而猶不已，便以手加之，告諸人言：『此人自有田稼，",
        "translation": "Those sentient beings did not stop stealing. The other sentient beings again criticized them, but they did not stop stealing. They joined [their hands] and told the others, “This man has his own land and crops.",
        "source": "T01n0001_006:0038b14_13"
    },
    {
        "source_sentence": "而盜他物。』",
        "translation": "They steal other things.'",
        "source": "T01n0001_006:0038b16_14"
    },
    {
        "source_sentence": "其人復告：『此人打我。』",
        "translation": "Again, that person told me, 'That person beats me.'",
        "source": "T01n0001_006:0038b17_0"
    },
    {
        "source_sentence": "時，彼眾人見二人諍已，愁憂不悅，懊惱而言：『眾生轉惡，世間乃有此不善，",
        "translation": "When those people saw that the two men were angry, they became sad and displeased. Being distressed, they said, “As sentient beings become evil, this unwholesome condition exists in the world.",
        "source": "T01n0001_006:0038b17_1"
    },
    {
        "source_sentence": "生穢惡不淨，此是生、老、病、死之原，煩惱苦報墮三惡道，由有田地致此諍訟。",
        "translation": "This is the origin of birth, old age, sickness, and death. The painful retribution of defilement leads to falling into the three evil destinies:",
        "source": "T01n0001_006:0038b19_2"
    },
    {
        "source_sentence": "今者寧可立一人為主以治理之，可護者護，可責者責，眾共減米，以供給之，",
        "translation": "Now we should appoint one person as king to govern the rice harvest. Those who are capable of protecting it should be protected, while those who are capable of reprimand should be punished. All the members of the sangha will reduce their rice harvest and offer it to him.",
        "source": "T01n0001_006:0038b21_3"
    },
    {
        "source_sentence": "使理諍訟。』",
        "translation": "It causes the principle to be disputed.'",
        "source": "T01n0001_006:0038b23_4"
    },
    {
        "source_sentence": "「時，彼眾中自選一人，形體長大，顏貌端正，有威德者，而語之言：『汝今為我等作平等主，",
        "translation": "“Thereupon, one of the bhikṣus elected among the members of the sangha to be their equal ruler. He should be big and tall in stature with a dignified appearance.",
        "source": "T01n0001_006:0038b23_5"
    },
    {
        "source_sentence": "應護者護，應責者責，應遣者遣，當共集米，以相供給。』",
        "translation": "Those who should guard and those who should be disciplined, those who should be reprimanded and those who should be expelled will gather rice together to make offerings.'",
        "source": "T01n0001_006:0038b25_6"
    },
    {
        "source_sentence": "時，彼一人聞眾人言，即與為主，斷理諍訟，眾人即共集米供給。",
        "translation": "When that man heard the words of the crowd, he gave it to the host and resolved the dispute over principle. The people then gathered rice together to make offerings.",
        "source": "T01n0001_006:0038b26_7"
    },
    {
        "source_sentence": "時，彼一人復以善言慰勞眾人，眾人聞已，皆大歡喜，皆共稱言：『善哉！",
        "translation": "That person then again comforted the people with good words, and when they heard them, they all rejoiced greatly and said, 'Good!'",
        "source": "T01n0001_006:0038b28_8"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T01n0001_006:0038b29_9"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T01n0001_006:0038b29_10"
    },
    {
        "source_sentence": "大王！』",
        "translation": "Great king!'",
        "source": "T01n0001_006:0038b29_11"
    },
    {
        "source_sentence": "於是，世間便有王名，以正法治民，故名剎利，於是世間始有剎利名生。",
        "translation": "Thus, in the world, there's a king named Śāriputra because he correctly governs the people, so he's called Śāriputra.",
        "source": "T01n0001_006:0038c01_12"
    },
    {
        "source_sentence": "「時，彼眾中獨有一人作如是念：『家為大患，家為毒刺，我今寧可捨此居家，",
        "translation": "At that time, only one of the members of the assembly had this thought: The householder’s life is in great danger and the householder’s life is poisonous.",
        "source": "T01n0001_006:0038c02_13"
    },
    {
        "source_sentence": "獨在山林，閑靜修道。』",
        "translation": "I'm alone in the mountains and forests, cultivating in seclusion.'",
        "source": "T01n0001_006:0038c04_14"
    },
    {
        "source_sentence": "即捨居家，入於山林，寂默思惟，至時持器入村乞食，眾人見已，皆樂供養，",
        "translation": "Having renounced the householder’s life, he entered a mountain forest to meditate in quietude. When the time came, he took his almsbowl and went into the village to solicit almsfood. On seeing him, everyone delighted in making offerings.",
        "source": "T01n0001_006:0038c05_0"
    },
    {
        "source_sentence": "歡喜稱讚：『善哉！",
        "translation": "They rejoiced and praised him, saying, 'Good!",
        "source": "T01n0001_006:0038c06_1"
    },
    {
        "source_sentence": "此人能捨家居，獨處山林，靜默修道，捨離眾惡。』",
        "translation": "This person can abandon their home, live alone in the mountains and forests, quietly cultivate meditation, and abandon all evils.'",
        "source": "T01n0001_006:0038c07_2"
    },
    {
        "source_sentence": "於是，世間始有婆羅門名生。",
        "translation": "It was then that a Brāhmaṇa named Sengsheng began to appear in the world.",
        "source": "T01n0001_006:0038c08_3"
    },
    {
        "source_sentence": "彼婆羅門中有不樂閑靜坐禪思惟者，便入人間，誦習為業，又自稱言：『我是不禪人！』",
        "translation": "Those among the Brāhmaṇas who don't enjoy sitting quietly in meditation and contemplation will then enter the community, recite it as a task, and claim, 'I'm a person who doesn't meditate!'",
        "source": "T01n0001_006:0038c08_4"
    },
    {
        "source_sentence": "於是，世人稱不禪婆羅門。",
        "translation": "The people of the world then called him a brahman who didn't practice meditation.",
        "source": "T01n0001_006:0038c10_5"
    },
    {
        "source_sentence": "由入人間故，名為人間婆羅門，於是，世間有婆羅門種；",
        "translation": "Because he entered the human world, he is called a “commoner of the human world” (i.e., a brāhmaṇa). At that time there was a brahman family in the world.",
        "source": "T01n0001_006:0038c11_6"
    },
    {
        "source_sentence": "彼眾生中有人好營居業，多積財寶，因是眾人名為居士；",
        "translation": "Among those sentient beings there were some who liked to live and work, accumulating wealth and treasure. Because of this they were called householders.",
        "source": "T01n0001_006:0038c12_7"
    },
    {
        "source_sentence": "彼眾生中有多機巧，多所造作，於是世間始有首陀羅工巧之名。",
        "translation": "Among those sentient beings, there are many skillful people who have many abilities and much to create, so the name śūdra of skillfulness began to be used in the world.",
        "source": "T01n0001_006:0038c14_8"
    },
    {
        "source_sentence": "「婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0038c15_9"
    },
    {
        "source_sentence": "今此世間有四種名，第五有沙門眾名。",
        "translation": "Now, there are four kinds of names in this world, and the fifth has the names of the ascetics.",
        "source": "T01n0001_006:0038c15_10"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T01n0001_006:0038c16_11"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0038c17_0"
    },
    {
        "source_sentence": "剎利眾中，或時有人自厭己法，剃除鬚髮，而披法服，於是始有沙門名生。",
        "translation": "Among the kṣatriyas, some people sometimes become disillusioned with their own teaching and shave their hair and beards while wearing religious robes. This is how a śramaṇa named Sengsheng came into being.",
        "source": "T01n0001_006:0038c17_1"
    },
    {
        "source_sentence": "婆羅門種、居士種、首陀羅種，或時有人自厭己法，剃除鬚髮，法服修道，",
        "translation": "Some people of the brāhmaṇa, vaiśya, and śūdra classes sometimes become disgusted with their own teachings, shave their hair and beards, don the religious robes, and practice.",
        "source": "T01n0001_006:0038c19_0"
    },
    {
        "source_sentence": "名為沙門。",
        "translation": "He's called an ascetic.",
        "source": "T01n0001_006:0038c20_1"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0038c20_2"
    },
    {
        "source_sentence": "剎利種中，身行不善，口行不善，意行不善身壞命終，必受苦報。",
        "translation": "Among the kṣatriyas, bad bodily actions, bad verbal actions, and bad mental actions will surely bring painful retribution when their bodies disintegrate and their lives end.",
        "source": "T01n0001_006:0038c21_3"
    },
    {
        "source_sentence": "婆羅門種、居士種、首陀羅種，身行不善，口行不善，意行不善，身壞命終，",
        "translation": "The brāhmaṇas, vaiśyas, and śūdras commit evil deeds of body, speech, and mind when their bodies dissolve and their lives come to an end.",
        "source": "T01n0001_006:0038c22_4"
    },
    {
        "source_sentence": "必受苦報。",
        "translation": "They'll surely experience painful retribution.",
        "source": "T01n0001_006:0038c24_5"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0038c24_6"
    },
    {
        "source_sentence": "剎利種中，有身行善，口、意行善，身壞命終，必受樂報。",
        "translation": "Among the kṣatriya people, there are those who perform good deeds of body, speech, and mind. At the breaking up of the body at death they will surely experience a pleasant retribution.",
        "source": "T01n0001_006:0038c24_7"
    },
    {
        "source_sentence": "婆羅門、居士、首陀羅種中，身行善，口、意行善，身壞命終，必受樂報。",
        "translation": "Among the brāhmaṇas, vaiśyas, and śūdras, if they perform good deeds in body, speech, and thought, they will surely experience pleasant rewards when their bodies dissolve and their lives end.",
        "source": "T01n0001_006:0038c25_8"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0038c27_9"
    },
    {
        "source_sentence": "剎利眾中，身行二種，口、意行二種，身壞命終，受苦樂報。",
        "translation": "Among the kṣatriyas, there are two kinds of bodily actions and two kinds of verbal and mental actions that result in painful and pleasant retribution when their bodies break up and their lives end.",
        "source": "T01n0001_006:0038c27_10"
    },
    {
        "source_sentence": "婆羅門種、居士種、首陀羅種，身行二種，口、意行二種，身壞命終，",
        "translation": "The Brahman caste, the vaiśya caste and the śūdra caste are of two kinds in bodily action, verbal action and mental action.",
        "source": "T01n0001_006:0038c28_11"
    },
    {
        "source_sentence": "受苦樂報。",
        "translation": "They experience painful and pleasant rewards.",
        "source": "T01n0001_006:0039a01_12"
    },
    {
        "source_sentence": "「婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0039a01_13"
    },
    {
        "source_sentence": "剎利種中，有剃除鬚髮，法服修道，修七覺意，道成不久。",
        "translation": "Among the kṣatriya people, some shaved their hair and beards, dressed in Buddhist robes, and practiced the seven kinds of enlightenment. Before long the Way was accomplished.",
        "source": "T01n0001_006:0039a01_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_006:0039a02_15"
    },
    {
        "source_sentence": "彼族姓子法服出家，修無上梵行，於現法中自身作證：『生死已盡，梵行已立，",
        "translation": "That clansman renounced the householder’s life because he wore the religious robe and renounced domestic life. He practiced the highest form of pure and genuine austerity. In this life he personally testified:",
        "source": "T01n0001_006:0039a03_16"
    },
    {
        "source_sentence": "所作已辦，不復受有。』",
        "translation": "What's done has been done, and there won't be another existence.'",
        "source": "T01n0001_006:0039a04_17"
    },
    {
        "source_sentence": "婆羅門、居士、首陀羅種中，有剃除鬚髮，法服修道，修七覺意，道成不久。",
        "translation": "Among the brāhmaṇas, vaiśyas, and śūdras, some shaved their hair and beards, donned religious robes, and cultivated the practice of the seven kinds of enlightenment. Before long the Way was accomplished.",
        "source": "T01n0001_006:0039a05_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T01n0001_006:0039a07_19"
    },
    {
        "source_sentence": "彼族姓子法服出家，修無上梵行，於現法中自身作證：『生死已盡，梵行已立，",
        "translation": "That clansman renounced the householder’s life because he wore the religious robe and renounced domestic life. He practiced the highest form of pure and genuine austerity. In this life he personally testified:",
        "source": "T01n0001_006:0039a07_20"
    },
    {
        "source_sentence": "所作已辦，不復受有。』",
        "translation": "What's done has been done, and there won't be another existence.'",
        "source": "T01n0001_006:0039a09_21"
    },
    {
        "source_sentence": "婆悉吒！",
        "translation": "Vasiṣṭha!",
        "source": "T01n0001_006:0039a09_22"
    },
    {
        "source_sentence": "此四種中皆出明行成就羅漢，於五種中為最第一。」",
        "translation": "These four kinds of arhats are the most distinguished among the five kinds of arhats who have accomplished insight and practice.",
        "source": "T01n0001_006:0039a09_23"
    },
    {
        "source_sentence": "「『生中剎利勝，　　能捨種姓去；",
        "translation": "'In birth, the kṣatriyas are superior, Able to abandon their castes and leave them.",
        "source": "T01n0001_006:0039a11_0"
    },
    {
        "source_sentence": "　　明行成就者，　　世間最第一。』」",
        "translation": "It's clear that someone who has accomplished practice is the best in the world.'",
        "source": "T01n0001_006:0039a11_0"
    },
    {
        "source_sentence": "佛告婆悉吒：「梵天王頌曰：佛告婆悉吒：「此梵善說，非不善說；",
        "translation": "The Buddha said to Vāseṭṭha, “The god Brahmā spoke these verses:",
        "source": "T01n0001_006:0039a11_0"
    },
    {
        "source_sentence": "此梵善受，非不善受。",
        "translation": "This brahma receives [the precepts] well, not badly.",
        "source": "T01n0001_006:0039a14_1"
    },
    {
        "source_sentence": "我時即印可其言，所以者何？",
        "translation": "I then approved of his words, and why is that?",
        "source": "T01n0001_006:0039a15_2"
    },
    {
        "source_sentence": "「『生中剎利勝，　　能捨種姓去；",
        "translation": "'In birth, the kṣatriyas are superior, Able to abandon their castes and leave them.",
        "source": "T01n0001_006:0039a15_3"
    },
    {
        "source_sentence": "　　明行成就者，　　世間最第一。』」",
        "translation": "It's clear that someone who has accomplished practice is the best in the world.'",
        "source": "T01n0001_006:0039a15_3"
    },
    {
        "source_sentence": "今我如來、至真亦說是義：爾時，世尊說此法已，婆悉吒、婆羅墮無漏心解脫，",
        "translation": "I, the Tathāgata and Arhat, have also taught this doctrine. At that time the World-honored One had discoursed thus:",
        "source": "T01n0001_006:0039a15_3"
    },
    {
        "source_sentence": "聞佛所說，歡喜奉行。",
        "translation": "Having heard the Buddha’s exhortation, they were delighted and remembered it well.",
        "source": "T01n0001_006:0039a20_4"
    },
    {
        "source_sentence": "（六）佛說長阿含第二分轉輪聖王修行經第二",
        "translation": "(6) The Second Part of the Sutra on the Cultivation of the Twofold Wheel-Turning Sage King, Spoken by the Buddha in the Longer Āgamas",
        "source": "T01n0001_006:0039a21_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛在摩羅醯搜人間遊行，與千二百五十比丘漸至摩樓國。",
        "translation": "Thus I have heard. One time, while the Buddha was staying among the people of Māra’s Grove, accompanied by one thousand two hundred and fifty bhikṣus, he gradually reached the country of Mālava.",
        "source": "T01n0001_006:0039a22_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「汝等當自熾燃，熾燃於法，勿他熾燃；",
        "translation": "At that time the World-honored One said to the monks: You should make yourselves ignite, make the Dharma ignite and not make anything else ignite.",
        "source": "T01n0001_006:0039a23_1"
    },
    {
        "source_sentence": "當自歸依，歸依於法，勿他歸依。",
        "translation": "You should rely on yourself, rely on the Dharma, and don't rely on others.",
        "source": "T01n0001_006:0039a25_2"
    },
    {
        "source_sentence": "云何比丘當自熾燃，熾燃於法，勿他熾燃？",
        "translation": "How should a monk make himself his fire, make the Dharma his fire and not make anything else his fire?",
        "source": "T01n0001_006:0039a26_3"
    },
    {
        "source_sentence": "當自歸依，歸依於法，勿他歸依？",
        "translation": "You should rely on yourself, rely on the Dharma, and not on others.",
        "source": "T01n0001_006:0039a27_4"
    },
    {
        "source_sentence": "於是，比丘內身身觀，精勤無懈，憶念不忘，除世貪憂；",
        "translation": "Thereupon, the bhikṣu observed his inner body and mind with unremitting exertion, being mindful of it without forgetting it to remove worldly desires and cravings.",
        "source": "T01n0001_006:0039a27_5"
    },
    {
        "source_sentence": "外身身觀、內外身身觀，精勤無懈，識念不忘，除世貪憂。",
        "translation": "He observes the outer body as body, and observes both inner and outer body as body; exerting himself energetically without laziness, being mindful of his observations and keeping them in memory, he removes worldly desires and sorrow.",
        "source": "T01n0001_006:0039a29_6"
    },
    {
        "source_sentence": "受、意、法觀，亦復如是，是為比丘自熾燃，熾燃於法，不他熾燃；",
        "translation": "The same applies to the contemplation on feeling, to the mind and to the doctrine. This is what makes a monk self-extinguished, one who is enlightened with respect to the doctrine and not with respect to others.",
        "source": "T01n0001_006:0039b01_7"
    },
    {
        "source_sentence": "自歸依，歸依於法，不他歸依。",
        "translation": "He takes refuge in himself, takes refuge in the Dharma, and doesn't take refuge in others.",
        "source": "T01n0001_006:0039b02_8"
    },
    {
        "source_sentence": "「如是行者，魔不能嬈，功德日增，所以者何？",
        "translation": "“Those who practice like this cannot be disturbed by Māra and their merit increases day by day.",
        "source": "T01n0001_006:0039b03_9"
    },
    {
        "source_sentence": "乃往過去久遠世時，有王名堅固念，剎利水澆頭種，為轉輪聖王，領四天下。",
        "translation": "In the distant past a long time ago, there was a king named Stable Mindfulness who poured water over his head as a wheel-turning sage king to govern the four quarters of the earth.",
        "source": "T01n0001_006:0039b04_10"
    },
    {
        "source_sentence": "時，王自在以法治化，人中殊特，七寶具足，一者金輪寶，二者白象寶，",
        "translation": "At that time the king ruled freely and his people were distinguished by their extraordinary characteristics. They possessed seven treasures: first, the golden wheel treasure; second, the white elephant treasure.",
        "source": "T01n0001_006:0039b06_11"
    },
    {
        "source_sentence": "三者紺馬寶，四者神珠寶，五者玉女寶，六者居士寶，七者主兵寶。",
        "translation": "The third treasure is the dark blue horse treasure, the fourth divine jewel, the fifth treasure of the jadelike queen, the sixth treasure of the householder, and the seventh treasure of the military commander.",
        "source": "T01n0001_006:0039b07_12"
    },
    {
        "source_sentence": "千子具足，勇健雄猛，能伏怨敵，不用兵杖，自然太平。",
        "translation": "The king had a thousand sons, all of whom were endowed with courage and mighty strength. They defeated enemies without the use of weapons and naturally pacified themselves peacefully.",
        "source": "T01n0001_006:0039b09_13"
    },
    {
        "source_sentence": "堅固念王久治世已，時，金輪寶即於虛空忽離本處，時，典輪者速往白王：『大王！",
        "translation": "After King Stable Mindfulness had ruled the world for a long time, the golden wheel treasure suddenly left its original place in space.",
        "source": "T01n0001_006:0039b10_14"
    },
    {
        "source_sentence": "當知今者輪寶離於本處。』",
        "translation": "You should know that now, the wheel treasure is free from its original place.'",
        "source": "T01n0001_006:0039b12_15"
    },
    {
        "source_sentence": "時，堅固王聞已念言：『我曾於先宿耆舊所聞，若轉輪聖王輪寶移者，",
        "translation": "Having heard these words, King Stable thought: I have heard it from the ancients and learned it from my predecessors. If the wheel-turning sage king (cakravartin) were to steer the treasure wheel,",
        "source": "T01n0001_006:0039b12_16"
    },
    {
        "source_sentence": "王壽未幾。",
        "translation": "The king's life span was not long.",
        "source": "T01n0001_006:0039b14_17"
    },
    {
        "source_sentence": "我今已受人中福樂，宜更方便受天福樂，當立太子領四天下，別封一邑與下髮師，",
        "translation": "Now that I have received the blessings and happiness of a human being, it is better for me to receive the blessings and happiness of gods through skillful means.",
        "source": "T01n0001_006:0039b14_18"
    },
    {
        "source_sentence": "命下鬚髮，服三法衣，出家修道。』",
        "translation": "He ordered them to lower their hair, put on the three robes of the Dharma, leave home, and cultivate.'",
        "source": "T01n0001_006:0039b16_19"
    },
    {
        "source_sentence": "「時，堅固念王即命太子而告之曰：『卿為知不？",
        "translation": "Then, King Daḷhanemi summoned the prince and told him, 'Do you know?'",
        "source": "T01n0001_006:0039b17_20"
    },
    {
        "source_sentence": "吾曾從先宿耆舊所聞，若轉輪聖王金輪離本處者，王壽未幾。",
        "translation": "I've heard from a former elderly man who said, 'If the wheel-turning sage king with the golden wheel leaves his original place, the king's life won't be long.'",
        "source": "T01n0001_006:0039b18_21"
    },
    {
        "source_sentence": "吾今已受人中福樂，當更方便遷受天福，今欲剃除鬚髮，服三法衣，出家為道，",
        "translation": "I now wish to shave my hair and beard, don the three robes of a mendicant, and renounce domestic life for religious practice.",
        "source": "T01n0001_006:0039b20_0"
    },
    {
        "source_sentence": "以四天下委付於汝，宜自勉力，存恤民物。』",
        "translation": "It's appropriate to entrust the four worlds to you, and it's advisable to exert yourself to save the property of the people.'",
        "source": "T01n0001_006:0039b21_1"
    },
    {
        "source_sentence": "是時，太子受王教已，時，堅固念王即剃除鬚髮，服三法衣，出家修道。",
        "translation": "Having received the king’s instruction, the prince at that time shaved his hair and beard, donned the three robes of a mendicant, renounced domestic life, and entered religious practice.",
        "source": "T01n0001_006:0039b22_2"
    },
    {
        "source_sentence": "「時，王出家過七日已，彼金輪寶忽然不現，其典輪者往白王言：『大王！",
        "translation": "After seven days had passed since the king renounced home, the golden wheel treasure suddenly disappeared. The treasury councilor went to the king and said:",
        "source": "T01n0001_006:0039b24_3"
    },
    {
        "source_sentence": "當知今者輪寶忽然不現。』",
        "translation": "You should know that now, the wheel treasure suddenly doesn't appear.'",
        "source": "T01n0001_006:0039b26_0"
    },
    {
        "source_sentence": "時王不悅，即往詣堅固念王所，到已白王：『父王！",
        "translation": "The king was displeased, so he went to the king of Stable Mindfulness and said to him, 'Father!",
        "source": "T01n0001_006:0039b26_1"
    },
    {
        "source_sentence": "當知今者輪寶忽然不現。』",
        "translation": "You should know that now, the wheel treasure suddenly doesn't appear.'",
        "source": "T01n0001_006:0039b27_2"
    },
    {
        "source_sentence": "時，堅固念王報其子曰：『汝勿懷憂以為不悅，此金輪寶者非汝父產，",
        "translation": "Then King Daḷhanemi said to his son, “Do not be sad and displeased. This golden-wheeled treasure is not your father’s property.",
        "source": "T01n0001_006:0039b28_3"
    },
    {
        "source_sentence": "汝但勤行聖王正法，行正法已，於十五日月滿時，沐浴香湯，婇女圍遶，",
        "translation": "On the fifteenth day of the month, on the full moon, you should bathe yourself in scented warm water and be surrounded by palace ladies.",
        "source": "T01n0001_006:0039b29_4"
    },
    {
        "source_sentence": "昇正法殿上，金輪神寶自然當現，輪有千輻，光色具足，天匠所造，非世所有。』",
        "translation": "When ascending to the hall of the true teaching, the divine treasure of the golden wheel will naturally appear, which has a thousand spokes that are endowed with radiance and color, made by heavenly artisans and not owned by the world.'",
        "source": "T01n0001_006:0039c02_5"
    },
    {
        "source_sentence": "「子白父王：『轉輪聖王正法云何？",
        "translation": "The son said to his father, 'What's the right teaching of the wheel-turning sage king?'",
        "source": "T01n0001_006:0039c04_6"
    },
    {
        "source_sentence": "當云何行？』",
        "translation": "How will it be done?'",
        "source": "T01n0001_006:0039c05_7"
    },
    {
        "source_sentence": "王告子曰：『當依於法，立法具法，恭敬尊重，觀察於法，以法為首，",
        "translation": "The king said to his children, “Rely on the Dharma and enact laws in accordance with the Dharma. Respectfully and respectfully following the Dharma, you should pay close attention to the Dharma and make the Dharma your primary concern.",
        "source": "T01n0001_006:0039c05_8"
    },
    {
        "source_sentence": "守護正法；",
        "translation": "They guard the true teaching.",
        "source": "T01n0001_006:0039c06_9"
    },
    {
        "source_sentence": "又當以法誨諸婇女，又當以法護視教誡諸王子、大臣、群寮、百官及諸人民、沙門、婆羅門，",
        "translation": "You should teach the courtesy maidens according to the Dharma and protect, in accordance with the Dharma, princes, ministers, officials, monks, laymen, nuns, brahmans, mendicants, and brāhmaṇas.",
        "source": "T01n0001_006:0039c07_10"
    },
    {
        "source_sentence": "下至禽獸，皆當護視。』",
        "translation": "Down to the animals, they'll all guard and look after them.'",
        "source": "T01n0001_006:0039c09_11"
    },
    {
        "source_sentence": "「又告子曰：『又汝土境所有沙門、婆羅門履行清真，功德具足，精進不懈，",
        "translation": "Again, Ānanda, all the śramaṇas and brāhmaṇas living in your country practiced purity and genuine integrity, perfected in virtue and endowed with energy and without slackening.",
        "source": "T01n0001_006:0039c09_12"
    },
    {
        "source_sentence": "去離憍慢，忍辱仁愛，閑獨自修，獨自止息，獨到涅槃，自除貪欲，化彼除貪；",
        "translation": "Being free of arrogance and conceit, he endures humility and kindness. Cultivating himself in seclusion, he alone stops and calms it for himself. Going alone to nirvana, he rids himself of craving and develops others to rid themselves of craving.",
        "source": "T01n0001_006:0039c11_13"
    },
    {
        "source_sentence": "自除瞋恚，化彼除瞋；",
        "translation": "They themselves get rid of anger and teach others to get rid of anger.",
        "source": "T01n0001_006:0039c13_14"
    },
    {
        "source_sentence": "自除愚癡，化彼除癡。",
        "translation": "He rids himself of delusion and transforms others to rid themselves of delusion.",
        "source": "T01n0001_006:0039c13_15"
    },
    {
        "source_sentence": "於染不染，於惡不惡，於愚不愚，可著不著，可住不住，可居不居。",
        "translation": "In regard to defilement and not defilement, in regard to evil and not evil, and in regard to foolishness and not foolishness, they can attach or not attach, abide or not abide, and live or not live.",
        "source": "T01n0001_006:0039c14_16"
    },
    {
        "source_sentence": "身行質直，口言質直，意念質直；",
        "translation": "The quality of bodily action is straightforward, the quality of verbal action is straightforward, and the quality of thought is straightforward.",
        "source": "T01n0001_006:0039c15_17"
    },
    {
        "source_sentence": "身行清淨，口言清淨，意念清淨，正念清淨，仁慧無厭，衣食知足，持鉢乞食，",
        "translation": "They are pure in body and conduct, pure in speech and thought, pure in mindfulness and right mindfulness, kind and wise without weariness, content with food and clothing, begging for alms by holding bowls.",
        "source": "T01n0001_006:0039c16_18"
    },
    {
        "source_sentence": "以福眾生。",
        "translation": "It's because of the virtue of sentient beings.",
        "source": "T01n0001_006:0039c18_19"
    },
    {
        "source_sentence": "有如是人者，汝當數詣，隨時諮問，凡所修行，何善何惡？",
        "translation": "If there are people like this, you should visit them frequently and consult with them at any time. What is good and what is bad for everyone who practices Buddhism?",
        "source": "T01n0001_006:0039c18_20"
    },
    {
        "source_sentence": "云何為犯？",
        "translation": "What's a violation?",
        "source": "T01n0001_006:0039c19_21"
    },
    {
        "source_sentence": "云何非犯？",
        "translation": "What's not a violation?",
        "source": "T01n0001_006:0039c20_22"
    },
    {
        "source_sentence": "何者可親？",
        "translation": "What's to be intimate with?",
        "source": "T01n0001_006:0039c20_23"
    },
    {
        "source_sentence": "何者不可親？",
        "translation": "What's unfaithful?",
        "source": "T01n0001_006:0039c20_24"
    },
    {
        "source_sentence": "何者可作？",
        "translation": "Which one can be done?",
        "source": "T01n0001_006:0039c20_25"
    },
    {
        "source_sentence": "何者不可作？",
        "translation": "What's unacceptable?",
        "source": "T01n0001_006:0039c21_26"
    },
    {
        "source_sentence": "施行何法，長夜受樂？",
        "translation": "What teaching does he practice that brings happiness for a long time?",
        "source": "T01n0001_006:0039c21_27"
    },
    {
        "source_sentence": "汝諮問已，以意觀察，宜行則行，宜捨則捨。",
        "translation": "Having inquired about this matter, you should examine it with the following thought: “It is advisable for me to do what should be done. It is advisable for me to relinquish [this posture].” The Buddha said:",
        "source": "T01n0001_006:0039c22_0"
    },
    {
        "source_sentence": "國有孤老，當拯給之；",
        "translation": "If there are orphans and old people in the state, they should be provided with help.",
        "source": "T01n0001_006:0039c23_0"
    },
    {
        "source_sentence": "貧窮困劣，有來取者，慎勿違逆。",
        "translation": "Those who are poor and destitute and those who have come to take it should be careful not to disobey them.",
        "source": "T01n0001_006:0039c23_1"
    },
    {
        "source_sentence": "國有舊法，汝勿改易，此是轉輪聖王所修行法，汝當奉行。』」",
        "translation": "The country has an old teaching, so don't change it; this is the teaching cultivated by the wheel-turning sage king, and you must follow it.'",
        "source": "T01n0001_006:0039c24_2"
    },
    {
        "source_sentence": "佛告諸比丘：「時，轉輪聖王受父教已，如說修行，後於十五日月滿時，",
        "translation": "The Buddha said to the monks: Having received his father’s instruction, the wheel-turning sage king thus practiced as he had been taught on the full fifteenth day of the month.",
        "source": "T01n0001_006:0039c25_3"
    },
    {
        "source_sentence": "沐浴香湯，昇高殿上，婇女圍遶，自然輪寶忽然在前，輪有千輻，光色具足，",
        "translation": "He bathed himself in scented warm water and ascended to a high hall surrounded by palace ladies. Suddenly the divine wheel suddenly appeared before him, with one thousand spokes of which he was endowed with light and color.",
        "source": "T01n0001_006:0039c27_4"
    },
    {
        "source_sentence": "天匠所造，非世所有，真金所成，輪徑丈四。",
        "translation": "It was made by a heavenly artisan and did not belong to the world. Made of genuine gold, it had a diameter of fourteen feet.",
        "source": "T01n0001_006:0039c29_5"
    },
    {
        "source_sentence": "時，轉輪王默自念言：『我曾從先宿耆舊所聞，若剎利王水澆頭種，以十五日月滿時，",
        "translation": "Then the wheel-turning king thought to himself in silence, saying: I have heard from my ancient ancestors that on the fifteenth day of the month it is the time for King Sāriputta to pour water over his hair and seeds.",
        "source": "T01n0001_006:0040a01_6"
    },
    {
        "source_sentence": "沐浴香湯，昇寶殿上，婇女圍遶，自然金輪忽現在前，輪有千輻，光色具足，",
        "translation": "He bathed himself in scented warm water and ascended to the jeweled palace, surrounded by court ladies. Suddenly a golden wheel appeared before him, one thousand spokes long, shining with all its splendors.",
        "source": "T01n0001_006:0040a02_7"
    },
    {
        "source_sentence": "天匠所造，非世所有，真金所成，輪徑丈四，是則名為轉輪聖王。",
        "translation": "The wheel is made of genuine gold, one zhang and fourteen feet in diameter. This is called the universal ruler who turns the sacred wheel.",
        "source": "T01n0001_006:0040a04_8"
    },
    {
        "source_sentence": "今此輪現，將無是耶？",
        "translation": "Wouldn't this be the case when this wheel appears now?",
        "source": "T01n0001_006:0040a06_9"
    },
    {
        "source_sentence": "今我寧可試此輪寶。』",
        "translation": "Now, I'd better test this wheel treasure.'",
        "source": "T01n0001_006:0040a06_10"
    },
    {
        "source_sentence": "「時，轉輪王即召四兵，向金輪寶偏露右臂，右膝著地，復以右手摩捫金輪，",
        "translation": "The wheel-turning king then summoned the four divisions of his army and faced the golden wheel. He bared his right shoulder, knelt with his right knee on the ground, and stroked the gold wheel with his right hand.",
        "source": "T01n0001_006:0040a07_11"
    },
    {
        "source_sentence": "語言：『汝向東方，如法而轉，勿違常則。』",
        "translation": "They said, 'Go east, turn around according to the teaching and don't disobey the eternal rules.'",
        "source": "T01n0001_006:0040a08_12"
    },
    {
        "source_sentence": "輪即東轉。",
        "translation": "The wheel then turns eastward.",
        "source": "T01n0001_006:0040a09_13"
    },
    {
        "source_sentence": "時，王即將四兵隨從其後，金輪寶前有四神導，輪所住處，王即止駕。",
        "translation": "The king then followed him with four divisions of his army, and in front of the golden wheel treasure there were four divine guides. Wherever the wheel was stationed, the king stopped the carriage.",
        "source": "T01n0001_006:0040a09_14"
    },
    {
        "source_sentence": "爾時，東方諸小國王見大王至，以金鉢盛銀粟，銀鉢盛金粟，來趣王所，",
        "translation": "At that time the kings of the small countries in the eastern direction, seeing the great king approaching them, filled a golden bowl with silver grains and a silver bowl with golden grains.",
        "source": "T01n0001_006:0040a11_15"
    },
    {
        "source_sentence": "拜首白言：『善來，大王！",
        "translation": "He bowed his head and said, 'Well come, great king!'",
        "source": "T01n0001_006:0040a13_16"
    },
    {
        "source_sentence": "今此東方土地豐樂，人民熾盛，志性仁和，慈孝忠順，唯願聖王於此治正，",
        "translation": "Your majesty, the land of the eastern direction is prosperous and well populated. The inhabitants are vigorous and prosperous; their aspirations are benevolent and harmonious, kind and filial, loyal and obedient. All we ask, Your Majesty, is that Your Majesty govern this land correctly.",
        "source": "T01n0001_006:0040a13_17"
    },
    {
        "source_sentence": "我等當給使左右，承受所當。』",
        "translation": "We will give it to the messenger's left and right, bearing what's appropriate.'",
        "source": "T01n0001_006:0040a15_18"
    },
    {
        "source_sentence": "時，轉輪大王語小王言：『止！",
        "translation": "The wheel-turning great king then said to the lesser king, 'Stop!",
        "source": "T01n0001_006:0040a15_19"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T01n0001_006:0040a16_20"
    },
    {
        "source_sentence": "諸賢！",
        "translation": "Venerable friends!",
        "source": "T01n0001_006:0040a16_21"
    },
    {
        "source_sentence": "汝等則為供養我已，但當以正法治，勿使偏枉，無令國內有非法行，此即名曰我之所治。』",
        "translation": "For your sake to make offerings to me, you must simply follow the correct rules of the Dharma so that they won't be biased and injusticed, so that there won't be any unlawful activity in my country, which is called self- governed by me.'",
        "source": "T01n0001_006:0040a16_22"
    },
    {
        "source_sentence": "「時，諸小王聞此教已，即從大王巡行諸國，至東海表，次行南方、西方、北方，",
        "translation": "Having heard this instruction, the kings of the small countries followed the great kings on their pilgrimage to the eastern seacoast and proceeded south, west, and north.",
        "source": "T01n0001_006:0040a18_23"
    },
    {
        "source_sentence": "隨輪所至，其諸國王各獻國土，亦如東方諸小國比。",
        "translation": "Wherever the wheel arrived, the kings of those countries each offered their lands, just like the small countries in the east.",
        "source": "T01n0001_006:0040a20_24"
    },
    {
        "source_sentence": "時，轉輪王既隨金輪，周行四海，以道開化，安慰民庶，已還本國。",
        "translation": "At that time the cakravartin followed the golden wheel and traveled in all four seas. Enlightened by means of the Way, he comforted the people and brought them home.",
        "source": "T01n0001_006:0040a21_25"
    },
    {
        "source_sentence": "時，金輪寶在宮門上虛空中住，時，轉輪王踊躍而言：『此金輪寶真為我瑞，",
        "translation": "At that time the golden-wheeled treasure was hovering in midair above the palace gates.",
        "source": "T01n0001_006:0040a23_26"
    },
    {
        "source_sentence": "我今真為轉輪聖王，是為金輪寶成就。』",
        "translation": "Now that I am truly the wheel-turning sage king, this is the accomplishment of the golden wheel treasure.'",
        "source": "T01n0001_006:0040a25_0"
    },
    {
        "source_sentence": "「其王久治世已，時，金輪寶即於虛空忽離本處，其典輪者速往白王：『大王！",
        "translation": "After the king had ruled the world for a long time, the gold wheel treasure suddenly left its original place in space. The treasury councilor quickly went to the king and said:",
        "source": "T01n0001_006:0040a25_1"
    },
    {
        "source_sentence": "當知今者輪寶離於本處。』",
        "translation": "You should know that now, the wheel treasure is free from its original place.'",
        "source": "T01n0001_006:0040a27_2"
    },
    {
        "source_sentence": "時，王聞已即自念言：『我曾於先宿耆舊所聞，若轉輪聖王輪寶移者，",
        "translation": "Having heard these words, the king thought to himself: I have heard it from an elderly man who lived a long time before me.",
        "source": "T01n0001_006:0040a28_3"
    },
    {
        "source_sentence": "王壽未幾。",
        "translation": "The king's life span was not long.",
        "source": "T01n0001_006:0040a29_4"
    },
    {
        "source_sentence": "我今已受人中福樂，宜更方便受天福樂，當立太子領四天下，別封一邑與下髮師，",
        "translation": "Now that I have received the blessings and happiness of a human being, it is better for me to receive the blessings and happiness of gods through skillful means.",
        "source": "T01n0001_006:0040b01_0"
    },
    {
        "source_sentence": "令下鬚髮，服三法衣，出家修道。』",
        "translation": "He ordered them to lower their hair, put on the three robes of the Dharma, leave home, and cultivate.'",
        "source": "T01n0001_006:0040b03_0"
    },
    {
        "source_sentence": "「時，王即命太子而告之曰：『卿為知不？",
        "translation": "The king then summoned the prince and told him, 'Do you know?'",
        "source": "T01n0001_006:0040b03_1"
    },
    {
        "source_sentence": "吾曾從先宿耆舊所聞，若轉輪聖王金輪寶離本處者，王壽未幾。",
        "translation": "I've heard from a former elderly old man that if the wheel-turning sage king, the golden wheel treasure, leaves his original place, the king's life will not be long.",
        "source": "T01n0001_006:0040b04_2"
    },
    {
        "source_sentence": "吾今已受人中福樂，當設方便遷受天樂，今欲剃除鬚髮，服三法衣，出家修道，",
        "translation": "I now wish to shave my hair and beard, don the three robes of a mendicant, renounce domestic life, and practice austerity.",
        "source": "T01n0001_006:0040b06_3"
    },
    {
        "source_sentence": "以四天下委付於汝，宜自勉力，存恤民物。』",
        "translation": "It's appropriate to entrust the four worlds to you, and it's advisable to exert yourself to save the property of the people.'",
        "source": "T01n0001_006:0040b08_4"
    },
    {
        "source_sentence": "爾時，太子受王教已，王即剃除鬚髮，服三法衣，出家修道。",
        "translation": "At that time, having received the king’s instruction, the prince shaved his hair and beard, donned the three robes of a mendicant, renounced domestic life, and entered religious practice.",
        "source": "T01n0001_006:0040b09_5"
    },
    {
        "source_sentence": "時，王出家過七日已，其金輪寶忽然不現，典金輪者往白王言：『大王！",
        "translation": "After seven days had passed since the king renounced household life, the golden wheel treasure suddenly disappeared. The gold wheel treasurer went to the king and said:",
        "source": "T01n0001_006:0040b10_6"
    },
    {
        "source_sentence": "當知今者輪寶忽然不現。』",
        "translation": "You should know that now, the wheel treasure suddenly doesn't appear.'",
        "source": "T01n0001_006:0040b11_7"
    },
    {
        "source_sentence": "時王聞已，不以為憂，亦復不往問父王意。",
        "translation": "When the king heard this, he didn't become sad and didn't go to ask his father or king what he wanted.",
        "source": "T01n0001_006:0040b12_8"
    },
    {
        "source_sentence": "時，彼父王忽然命終。",
        "translation": "Then, that father suddenly died.",
        "source": "T01n0001_006:0040b13_9"
    },
    {
        "source_sentence": "「自此以前，六轉輪王皆展轉相承，以正法治，唯此一王自用治國，不承舊法，",
        "translation": "“Earlier the rulers of the six universal monarchs were all inherited from each other and ruled according to their respective laws. Only this one king ruled his own country independently, not following the old rules.",
        "source": "T01n0001_006:0040b14_0"
    },
    {
        "source_sentence": "其政不平，天下怨訴，國土損減，人民凋落。",
        "translation": "The governance of the empire was uneven and the ruling powers were resentful. All the kingdoms lost their territory and all the inhabitants withdrew.",
        "source": "T01n0001_006:0040b15_1"
    },
    {
        "source_sentence": "時，有一婆羅門大臣往白王言：『大王！",
        "translation": "A Brāhmaṇa minister then went to the king and said, 'Great king!",
        "source": "T01n0001_006:0040b16_2"
    },
    {
        "source_sentence": "當知今者國土損減，人民凋落，轉不如常。",
        "translation": "You should know that the land is now in diminution, with its population shrinking and going against the seasons.",
        "source": "T01n0001_006:0040b17_3"
    },
    {
        "source_sentence": "王今國內多有知識，聰慧博達，明於古今，備知先王治政之法，何不命集問其所知，",
        "translation": "In the king’s country there are many learned scholars, wise and knowledgeable. They know all the teachings of both ancient and contemporary theories as well as the ways in which former kings governed. Why don’t they summon them together to ask what they know?",
        "source": "T01n0001_006:0040b18_4"
    },
    {
        "source_sentence": "彼自當答？』",
        "translation": "Will they themselves answer?'",
        "source": "T01n0001_006:0040b20_5"
    },
    {
        "source_sentence": "時，王即召群臣，問其先王治政之道。",
        "translation": "The king then summoned his ministers and asked the former king about the path of governance.",
        "source": "T01n0001_006:0040b20_6"
    },
    {
        "source_sentence": "時，諸智臣具以事答，王聞其言，即行舊政，以法護世，而由不能拯濟孤老，",
        "translation": "The wise ministers replied in detail, saying: When the king heard these words, he immediately resumed his old ways of governance and sought to protect the world by means of the Dharma but could not save the orphaned and the elderly.",
        "source": "T01n0001_006:0040b21_7"
    },
    {
        "source_sentence": "施及下窮。",
        "translation": "Giving and the lower level are exhausted.",
        "source": "T01n0001_006:0040b23_8"
    },
    {
        "source_sentence": "「時，國人民轉至貧困，遂相侵奪，盜賊滋甚，伺察所得，將詣王所白言：『此人為賊，",
        "translation": "At that time the people of that country became increasingly impoverished and plundered each other. Stealing and thieving grew in popularity. Seeking to steal, they approached the king and said, “This man is a thief!",
        "source": "T01n0001_006:0040b23_9"
    },
    {
        "source_sentence": "願王治之。』",
        "translation": "May the king rule them.'",
        "source": "T01n0001_006:0040b25_10"
    },
    {
        "source_sentence": "王即問言：『汝實為賊耶？』",
        "translation": "The king then asked, 'Are you really thieves?'",
        "source": "T01n0001_006:0040b25_11"
    },
    {
        "source_sentence": "答曰：『實爾！",
        "translation": "He replied, 'It's true!",
        "source": "T01n0001_006:0040b26_12"
    },
    {
        "source_sentence": "我貧窮飢餓，不能自存，故為賊耳。』",
        "translation": "I'm poor and hungry, unable to sustain myself; therefore, I'm a thief.'",
        "source": "T01n0001_006:0040b26_13"
    },
    {
        "source_sentence": "時，王即出庫物以供給之，而告之曰：『汝以此物供養父母，并恤親族，",
        "translation": "The king then came out of his storehouse to offer the treasure and said, “Through these things you should support your parents and extend sympathy to their kinsmen.",
        "source": "T01n0001_006:0040b27_14"
    },
    {
        "source_sentence": "自今已後，勿復為賊。』",
        "translation": "From now on, don't become a thief again.'",
        "source": "T01n0001_006:0040b29_0"
    },
    {
        "source_sentence": "餘人轉聞有作賊者，王給財寶，於是復行劫盜他物，復為伺察所得，將詣王所白言：『此人為賊，",
        "translation": "The others heard that thieves had committed robbery, and the king gave them their riches and treasures. So they plundered other people’s property. Again, in order to find out what they had gained, they approached the king and said:",
        "source": "T01n0001_006:0040b29_1"
    },
    {
        "source_sentence": "願王治之。』",
        "translation": "May the king rule them.'",
        "source": "T01n0001_006:0040c02_2"
    },
    {
        "source_sentence": "王復問言：『汝實為賊耶？』",
        "translation": "The king again asked, 'Are you really thieves?'",
        "source": "T01n0001_006:0040c03_0"
    },
    {
        "source_sentence": "答曰：『實爾！",
        "translation": "He replied, 'It's true!",
        "source": "T01n0001_006:0040c03_1"
    },
    {
        "source_sentence": "我貧窮飢餓，不能自存，故為賊耳。』",
        "translation": "I'm poor and hungry, unable to sustain myself; therefore, I'm a thief.'",
        "source": "T01n0001_006:0040c03_2"
    },
    {
        "source_sentence": "時，王復出庫財以供給之，復告之曰：『汝以此物供養父母，并恤親族，",
        "translation": "Then the king again came out of his treasury and offered them to him. Again he said, “Through these things you should support your parents and sympathize with their griefs.",
        "source": "T01n0001_006:0040c04_3"
    },
    {
        "source_sentence": "自今已後，勿復為賊。』",
        "translation": "From now on, don't become a thief again.'",
        "source": "T01n0001_006:0040c06_4"
    },
    {
        "source_sentence": "「復有人聞有作賊者，王給財寶，於是復行劫盜他物，復為伺察所得，",
        "translation": "“Furthermore, some people hear that there are thieves who give their wealth and treasures to kings. So they plunder others’ property and again seek to obtain it.",
        "source": "T01n0001_006:0040c06_5"
    },
    {
        "source_sentence": "將詣王所白言：『此人為賊，願王治之。』",
        "translation": "He went to the king and said, 'This man is a thief, so may the king punish him.'",
        "source": "T01n0001_006:0040c08_6"
    },
    {
        "source_sentence": "王復問言：『汝實為賊耶？』",
        "translation": "The king again asked, 'Are you really thieves?'",
        "source": "T01n0001_006:0040c09_7"
    },
    {
        "source_sentence": "答曰：『實爾！",
        "translation": "He replied, 'It's true!",
        "source": "T01n0001_006:0040c09_8"
    },
    {
        "source_sentence": "我貧窮飢餓，不能自存，故為賊耳。』",
        "translation": "I'm poor and hungry, unable to sustain myself; therefore, I'm a thief.'",
        "source": "T01n0001_006:0040c10_0"
    },
    {
        "source_sentence": "時王念言：『先為賊者，吾見貧窮，給其財寶，謂當止息，而餘人聞，",
        "translation": "The king thought to himself, “I formerly became a thief. Seeing the rich and poor in poverty, I gave them all their riches and property, saying that they would be able to live as long as possible but others did not.” Then the king said:",
        "source": "T01n0001_006:0040c10_1"
    },
    {
        "source_sentence": "轉更相効，盜賊日滋，如是無已，我今寧可杻械其人，令於街巷，然後載之出城，",
        "translation": "Now I should punish the thief and make him stay in the streets. Only then will he be driven out of the city.",
        "source": "T01n0001_006:0040c12_2"
    },
    {
        "source_sentence": "刑於曠野，以誡後人耶！』",
        "translation": "Did he die in the wilderness to admonish those who came after him?'",
        "source": "T01n0001_006:0040c14_3"
    },
    {
        "source_sentence": "「時，王即勅左右：『使收繫之，聲鼓唱令，遍諸街巷，訖已載之出城，",
        "translation": "“The king then ordered his aides, ‘Take the messengers and tie them up.’ They sounded the drum of the gong and issued an edict that all streets and lanes were to be shut off from the city until they had been freed.",
        "source": "T01n0001_006:0040c14_4"
    },
    {
        "source_sentence": "刑於曠野。』",
        "translation": "He'll be executed in the wilderness.'",
        "source": "T01n0001_006:0040c16_5"
    },
    {
        "source_sentence": "國人盡知彼為賊者，王所收繫，令於街巷，刑之曠野。",
        "translation": "Knowing that the thief was a thief, the king captured him and imprisoned him in the streets and lanes and executed him in the wilderness.",
        "source": "T01n0001_006:0040c16_6"
    },
    {
        "source_sentence": "時，人展轉自相謂言：『我等設為賊者，亦當如是，與彼無異。』",
        "translation": "The people then said to each other, 'Suppose we were to become thieves, and so it would be likewise, no different from them.'",
        "source": "T01n0001_006:0040c17_7"
    },
    {
        "source_sentence": "於是，國人為自防護，遂造兵杖、刀劍、弓矢，迭相殘害，攻劫掠奪。",
        "translation": "In order to protect themselves, the people of that country made weapons such as cannons, swords, bows, arrows, and spears. They inflicted harm on each other in turn, attacking and plundering others.",
        "source": "T01n0001_006:0040c19_8"
    },
    {
        "source_sentence": "自此王來始有貧窮，有貧窮已始有劫盜，有劫盜已始有兵杖，有兵杖已始有殺害，",
        "translation": "From the time of King Ajātaśatru poverty began to arise, robbery and thievery ceased to be. And as soon as there was robbery and thievery, weapons and sticks were available, and as soon as weapons and sticks were available, killing occurred.",
        "source": "T01n0001_006:0040c20_9"
    },
    {
        "source_sentence": "有殺害已則顏色憔悴，壽命短促。",
        "translation": "When someone kills, their appearance is emaciated and their life span is short.",
        "source": "T01n0001_006:0040c22_10"
    },
    {
        "source_sentence": "時，人正壽四萬歲，其後轉少，壽二萬歲，然其眾生有壽、有夭、有苦、有樂。",
        "translation": "At that time the human life span was forty thousand years in length. Later, when it decreased to twenty thousand years in length, however, some sentient beings lived longer, some died younger, and some were experiencing pain and pleasure.",
        "source": "T01n0001_006:0040c23_11"
    },
    {
        "source_sentence": "彼有苦者，便生邪婬、貪取之心，多設方便，圖謀他物。",
        "translation": "Those who experience suffering will give rise to thoughts of sexual misconduct and greed, often using skillful means to plot against others.",
        "source": "T01n0001_006:0040c25_12"
    },
    {
        "source_sentence": "是時，眾生貧窮劫盜，兵杖殺害，轉轉滋甚，人命轉減，壽一萬歲。",
        "translation": "At that time, the sentient beings were poor and robbed by thieves, killed with weapons and sticks, and became increasingly prosperous. The human life span decreased from one thousand years to ten thousand years.",
        "source": "T01n0001_006:0040c26_13"
    },
    {
        "source_sentence": "「一萬歲時，眾生復相劫盜，為伺察所得，將詣王所白言：『此人為賊，",
        "translation": "At the age of ten thousand years, when sentient beings again robbed and stole from each other, they went to the king's place to search for his money and said, 'This man is a thief.",
        "source": "T01n0001_006:0040c27_14"
    },
    {
        "source_sentence": "願王治之。』",
        "translation": "May the king rule them.'",
        "source": "T01n0001_006:0040c29_15"
    },
    {
        "source_sentence": "王問言：『汝實作賊耶？』",
        "translation": "The king asked, 'Did you really become a thief?'",
        "source": "T01n0001_006:0040c29_16"
    },
    {
        "source_sentence": "答曰：『我不作！』",
        "translation": "He replied, 'I won't do it!'",
        "source": "T01n0001_006:0041a01_17"
    },
    {
        "source_sentence": "便於眾中故作妄語。",
        "translation": "He then spoke falsely in the midst of the crowd.",
        "source": "T01n0001_006:0041a01_18"
    },
    {
        "source_sentence": "時，彼眾生以貧窮故便行劫盜，以劫盜故便有刀兵，以刀兵故便有殺害，",
        "translation": "Because of their poverty, those sentient beings then commit robbery and theft. Because they steal, they have swords and armies; because of these swords and armies, they are subject to killing.",
        "source": "T01n0001_006:0041a02_0"
    },
    {
        "source_sentence": "以殺害故便有貪取、邪婬，以貪取、邪婬故便有妄語，有妄語故其壽轉減，",
        "translation": "Because of killing, there is attachment and sexual misconduct; because of attachment and sexual misconduct, there is false speech; because of false speech, the duration of life decreases.",
        "source": "T01n0001_006:0041a03_1"
    },
    {
        "source_sentence": "至于千歲；",
        "translation": "It will be one thousand years in duration.",
        "source": "T01n0001_006:0041a05_2"
    },
    {
        "source_sentence": "千歲之時，便有口三惡行始出于世，一者兩舌，二者惡口，三者綺語，",
        "translation": "At the age of one thousand years, there will be three kinds of evil speech and deeds that appear in the world: (1) duplicitous speech, (2) harsh speech, and (3) fancy speech.",
        "source": "T01n0001_006:0041a05_3"
    },
    {
        "source_sentence": "此三惡業展轉熾盛，人壽稍減至五百歲；",
        "translation": "These three kinds of evil deeds spread widely and the human life span decreased to five hundred years in length.",
        "source": "T01n0001_006:0041a07_4"
    },
    {
        "source_sentence": "五百歲時，眾生復有三惡行起，一者非法婬，二者非法貪，三者邪見，",
        "translation": "At the time of five hundred years, there are again three bad actions among sentient beings: first, unlawful sexual misconduct; second, unlawful greed; and third, wrong views.",
        "source": "T01n0001_006:0041a08_5"
    },
    {
        "source_sentence": "此三惡業展轉熾盛，人壽稍減，三百、二百，我今時人，乃至百歲，少出多減。",
        "translation": "These three kinds of evil deeds will continue to flourish and the human life span will decrease gradually, from three hundred to two hundred years. At the present time the human life span is up to one hundred years in length, with a few births and many deaths.",
        "source": "T01n0001_006:0041a09_6"
    },
    {
        "source_sentence": "「如是展轉，為惡不已，其壽稍減，當至十歲，十歲時人，女生五月便行嫁。",
        "translation": "Their life span decreases gradually and eventually becomes ten years old. At the time when they are ten years old, it is customary for a female layman to marry in five months.",
        "source": "T01n0001_006:0041a11_7"
    },
    {
        "source_sentence": "是時世間酥油、石蜜、黑石蜜，諸甘美味不復聞名，粳粮、禾稻變成草莠，",
        "translation": "At that time the delicacies such as butter, sour milk, sugarcane, and black sugarcane in the world no longer heard their names. Crops and rice became grass and weeds.",
        "source": "T01n0001_006:0041a13_0"
    },
    {
        "source_sentence": "繒、絹、錦、綾、劫貝、白[疊*毛]，今世名服，時悉不現，織麤毛縷以為上衣。",
        "translation": "Goods such as silk, silk cloth, brocade, woolen blankets, cotton cloth, cotton cloth, and white cotton cloth are renowned in the present world but they are not seen at the appropriate time. They wove woven woolen yarn to make their upper garments.",
        "source": "T01n0001_006:0041a14_1"
    },
    {
        "source_sentence": "是時，此地多生荊棘，蚊、虻、蠅、虱、蛇、蚖、蜂、蛆，毒蟲眾多，",
        "translation": "At that time much thorns and thorny plants grow in this place. mosquitoes, gadflies, flies, lice, snakes, vipers, crocodiles, bees, maggots, and many poisonous insects live there.",
        "source": "T01n0001_006:0041a16_2"
    },
    {
        "source_sentence": "金、銀、琉璃、珠璣、名寶，盡沒於地，遂有瓦石砂礫出於地上。",
        "translation": "Gold, silver, lapis lazuli, pearls, and famous treasures all disappeared from the ground, and so did rubble and stones and gravel come out of the ground.",
        "source": "T01n0001_006:0041a17_3"
    },
    {
        "source_sentence": "「當於爾時，眾生之類永不復聞十善之名，但有十惡充滿世間。",
        "translation": "At that point, sentient beings will never hear the names of the ten good qualities again, but there will be ten bad qualities that fill the world.",
        "source": "T01n0001_006:0041a18_4"
    },
    {
        "source_sentence": "是時，乃無善法之名，其人何由得修善行？",
        "translation": "At that point, there's no name for good qualities, so how could they cultivate good actions?",
        "source": "T01n0001_006:0041a20_5"
    },
    {
        "source_sentence": "是時，眾生能為極惡，不孝父母，不敬師長，不忠不義，返逆無道者便得尊敬。",
        "translation": "At the time, sentient beings can be extremely bad, not filial to their parents, not respectful to their teachers and elders, not loyal and not meaningful, and then they'll be revered by those who return back against the path.",
        "source": "T01n0001_006:0041a21_6"
    },
    {
        "source_sentence": "如今能修善行，孝養父母，敬順師長，忠信懷義，順道修行者便得尊敬。",
        "translation": "Now they can cultivate good deeds, are filial to their parents, respectful to teachers and elders, loyal and faithful, and harbor meaning. Those who follow the path will attain respect.",
        "source": "T01n0001_006:0041a23_0"
    },
    {
        "source_sentence": "爾時，眾生多修十惡，多墮惡道，眾生相見，常欲相殺，猶如獵師見於群鹿。",
        "translation": "At the time, many sentient beings cultivated the ten bad qualities and often fell into bad destinies, and when they saw each other, they always wanted to kill each other, just like a hunter who saw a group of deer.",
        "source": "T01n0001_006:0041a24_1"
    },
    {
        "source_sentence": "時，此土地多有溝坑，溪澗深谷，土曠人希，行來恐懼。",
        "translation": "At that time in this land there were many ditches and deep valleys with streams and streams, and the soil was scarce to be cultivated. All the travelers feared it.",
        "source": "T01n0001_006:0041a26_2"
    },
    {
        "source_sentence": "爾時，當有刀兵劫起，手執草木，皆成戈鉾，於七日中，展轉相害。",
        "translation": "At the time, an eon of swords and armies would arise, carrying grass and trees in their hands, all becoming spears and spears that would kill each other in turn for seven days.",
        "source": "T01n0001_006:0041a27_3"
    },
    {
        "source_sentence": "「時，有智者遠逃叢林，依倚坑坎，於七日中懷怖畏心，發慈善言：『汝不害我，",
        "translation": "“At that time, the wise man fled far away from the jungle and lay in a pit or cave. For seven days he harbored fear and thought to himself, ‘If you do not harm me,",
        "source": "T01n0001_006:0041a29_4"
    },
    {
        "source_sentence": "我不害汝。』",
        "translation": "I won't harm you.'",
        "source": "T01n0001_006:0041b01_5"
    },
    {
        "source_sentence": "食草木子以存性命，過七日已，從山林出。",
        "translation": "After seven days had passed, he came out of the mountain forest.",
        "source": "T01n0001_006:0041b02_6"
    },
    {
        "source_sentence": "時有存者，得共相見，歡喜慶賀言：『汝不死耶？",
        "translation": "When some of the survivors saw each other, they rejoiced and congratulated themselves, saying, 'Did you not die?'",
        "source": "T01n0001_006:0041b03_7"
    },
    {
        "source_sentence": "汝不死耶？』",
        "translation": "Are you not dead?'",
        "source": "T01n0001_006:0041b04_8"
    },
    {
        "source_sentence": "猶如父母唯有一子，久別相見，歡喜無量。",
        "translation": "It's like a father and mother with only one child who have been separated from each other for a long time, and their joy is immeasurable.",
        "source": "T01n0001_006:0041b04_9"
    },
    {
        "source_sentence": "彼人如是各懷歡喜，迭相慶賀，然後推問其家，其家親屬死亡者眾，復於七日中悲泣號咷，",
        "translation": "Each of them were thus delighted and congratulated the other, and then they asked their families. Their relatives and friends who had died in this way grieved and cried out in distress for seven days.",
        "source": "T01n0001_006:0041b05_10"
    },
    {
        "source_sentence": "啼哭相向。",
        "translation": "They cried and faced each other.",
        "source": "T01n0001_006:0041b07_11"
    },
    {
        "source_sentence": "過七日已，復於七日中共相慶賀，娛樂歡喜，尋自念言：『吾等積惡彌廣，",
        "translation": "After seven days had passed, they congratulated each other and rejoiced. They thought to themselves, “Our accumulation of evil is too great!",
        "source": "T01n0001_006:0041b07_12"
    },
    {
        "source_sentence": "故遭此難，親族死亡，家屬覆沒，今者宜當少共修善，宜修何善？",
        "translation": "Consequently, my relatives died and my family members fell into this difficulty. Now it is advisable for me to perform the wholesome practice together with a limited number of people. What wholesome practice should I perform?",
        "source": "T01n0001_006:0041b09_13"
    },
    {
        "source_sentence": "當不殺生。』",
        "translation": "You won't kill people.'",
        "source": "T01n0001_006:0041b11_0"
    },
    {
        "source_sentence": "「爾時，眾生盡懷慈心，不相殘害，於是眾生色壽轉增，其十歲者壽二十歲。",
        "translation": "At the time, all sentient beings were compassionate and didn't harm each other. As a result, the life span of sentient beings increased by ten years, and those who became ten years old grew up to 20 years old.",
        "source": "T01n0001_006:0041b11_1"
    },
    {
        "source_sentence": "二十時人復作是念：『我等由少修善行，不相殘害故，壽命延長至二十歲，",
        "translation": "The people of that age would think, “Because we practiced the good deeds for a little while and were not harming each other, our life span will be extended to twenty years.",
        "source": "T01n0001_006:0041b12_2"
    },
    {
        "source_sentence": "今者寧可更增少善，當修何善？",
        "translation": "What kind of goodness should be cultivated?",
        "source": "T01n0001_006:0041b14_3"
    },
    {
        "source_sentence": "已不殺生，當不竊盜。』",
        "translation": "You won't kill people, and you won't steal.'",
        "source": "T01n0001_006:0041b15_4"
    },
    {
        "source_sentence": "已修不盜，則壽命延長至四十歲。",
        "translation": "After cultivating the practice of not stealing, his life span will be extended to forty years.",
        "source": "T01n0001_006:0041b15_5"
    },
    {
        "source_sentence": "四十時人復作是念：『我等由少修善，壽命延長，今者寧可更增少善，",
        "translation": "The forty people of that age also thought, “Through having cultivated a little bit of goodness we have lengthened our life spans. Now we should increase the number of good deeds.",
        "source": "T01n0001_006:0041b16_6"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041b18_7"
    },
    {
        "source_sentence": "當不邪婬。』",
        "translation": "You won't commit sexual misconduct.'",
        "source": "T01n0001_006:0041b18_8"
    },
    {
        "source_sentence": "於是，其人盡不邪婬，壽命延長至八十歲。",
        "translation": "The people thereupon became completely free of sexual misconduct and their life span was extended to eighty years.",
        "source": "T01n0001_006:0041b18_9"
    },
    {
        "source_sentence": "「八十歲人復作是念：『我等由少修善，壽命延長，今者寧可更增少善，",
        "translation": "Again, the eighty-young bhikṣus thought: Through having practiced a little bit of goodness we have lengthened our life spans. Now we should increase still further by practicing a little bit of goodness.",
        "source": "T01n0001_006:0041b19_10"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041b21_11"
    },
    {
        "source_sentence": "當不妄語。』",
        "translation": "You mustn't speak falsely.'",
        "source": "T01n0001_006:0041b21_12"
    },
    {
        "source_sentence": "於是，其人盡不妄語，壽命延長至百六十。",
        "translation": "Thus, that person's life span was extended to one hundred and sixty years without lying.",
        "source": "T01n0001_006:0041b21_13"
    },
    {
        "source_sentence": "百六十時人復作是念：『我等由少修善，壽命延長，我今寧可更增小善，",
        "translation": "Hundreds and sixty people in the assembly thought, “Through our cultivation of goodness we have lengthened our life spans. Now we should increase the number of good deeds.",
        "source": "T01n0001_006:0041b22_14"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041b24_15"
    },
    {
        "source_sentence": "當不兩舌。』",
        "translation": "You won't have two tongues.'",
        "source": "T01n0001_006:0041b24_16"
    },
    {
        "source_sentence": "於是，其人盡不兩舌，壽命延長至三百二十歲。",
        "translation": "Their life spans will be extended to three hundred and twenty years.",
        "source": "T01n0001_006:0041b25_17"
    },
    {
        "source_sentence": "三百二十歲時人復作是念：『我等由少修善故，壽命延長，今者寧可更增少善，",
        "translation": "The people at that time would think, “Because of our having cultivated little goodness we have lengthened our life spans. Now we should increase the number of good deeds.",
        "source": "T01n0001_006:0041b26_18"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041b28_19"
    },
    {
        "source_sentence": "當不惡口。』",
        "translation": "You won't speak harshly.'",
        "source": "T01n0001_006:0041b28_20"
    },
    {
        "source_sentence": "於是，其人盡不惡口，壽命延長至六百四十。",
        "translation": "At that point, their life span was extended to six hundred and forty years without anger.",
        "source": "T01n0001_006:0041b28_21"
    },
    {
        "source_sentence": "「六百四十時人復作是念：『我等由修善故，壽命延長，今者寧可更增少善，",
        "translation": "Again, those six hundred and forty-four thousand śramaṇas and brāhmaṇas thought to themselves, “Because of our practice of goodness we have lengthened our life spans. Now we should increase the number of good deeds.",
        "source": "T01n0001_006:0041b29_22"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041c02_23"
    },
    {
        "source_sentence": "當不綺語。』",
        "translation": "You shouldn't speak fancy words.'",
        "source": "T01n0001_006:0041c02_24"
    },
    {
        "source_sentence": "於是，其人盡不綺語，壽命延長至二千歲。",
        "translation": "Their life spans will be extended to a length of two thousand years.",
        "source": "T01n0001_006:0041c02_25"
    },
    {
        "source_sentence": "二千歲時人復作是念：『我等由修善故，壽命延長，今者寧可更增少善，",
        "translation": "The people at that time would think, “Because of our cultivation of goodness we have lengthened our life spans. Now we should increase the number of good deeds.",
        "source": "T01n0001_006:0041c03_26"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041c05_27"
    },
    {
        "source_sentence": "當不慳貪。』",
        "translation": "You mustn't be stingy and greedy.'",
        "source": "T01n0001_006:0041c05_28"
    },
    {
        "source_sentence": "於是，其人盡不慳貪而行布施，壽命延長至五千歲。",
        "translation": "Thus, that person's life span was extended to 5,000 years because they practiced generosity without stinginess or greed.",
        "source": "T01n0001_006:0041c05_29"
    },
    {
        "source_sentence": "五千歲時人復作是念：『我等由修善故，壽命延長，今者寧可更增少善，",
        "translation": "The five thousand-year-old people then thought: Because we practiced the wholesome, our life spans will be extended. Now we should increase the number of wholesome ones.",
        "source": "T01n0001_006:0041c07_30"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041c08_31"
    },
    {
        "source_sentence": "當不嫉妬，慈心修善。』",
        "translation": "You mustn't be jealous and cultivate goodness with kindness.'",
        "source": "T01n0001_006:0041c09_32"
    },
    {
        "source_sentence": "於是，其人盡不嫉妬，慈心修善，壽命延長至於萬歲。",
        "translation": "At that time the people were completely free from jealousy and, being compassionate and cultivating virtue, their life span was extended to ten thousand years.",
        "source": "T01n0001_006:0041c09_33"
    },
    {
        "source_sentence": "「萬歲時人復作是念：『我等由修善故，壽命延長，今者寧可更增少善，",
        "translation": "At that time the people of Manjushri thought: Because we have cultivated wholesomeness, our life spans have been extended. Now we should increase still further by means of some wholesomeness.",
        "source": "T01n0001_006:0041c10_34"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041c12_35"
    },
    {
        "source_sentence": "當行正見，不生顛倒。』",
        "translation": "You should practice right view and not give rise to mistaken views.'",
        "source": "T01n0001_006:0041c12_36"
    },
    {
        "source_sentence": "於是，其人盡行正見，不起顛倒，壽命延長至二萬歲。",
        "translation": "Their life spans will be extended to twenty thousand years.",
        "source": "T01n0001_006:0041c13_37"
    },
    {
        "source_sentence": "二萬歲時人復作是念：『我等由修善故，壽命延長，今者寧可更增少善，",
        "translation": "The people at that time would think, “Because of our cultivation of goodness we have lengthened our life spans. Now we should increase the number of good deeds.",
        "source": "T01n0001_006:0041c14_38"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041c16_39"
    },
    {
        "source_sentence": "當滅三不善法，一者非法婬，二者非法貪，三者邪見。』",
        "translation": "You will extinguish three unwholesome dharmas, which are (1) unlawful sexual misconduct, (2) unlawful greed, and (3) wrong views.'",
        "source": "T01n0001_006:0041c16_40"
    },
    {
        "source_sentence": "於是，其人盡滅三不善法，壽命延長至四萬歲。",
        "translation": "That man then completely extinguished the three unwholesome states and his life span extended to 40,000 years.",
        "source": "T01n0001_006:0041c17_41"
    },
    {
        "source_sentence": "四萬歲時人復作是念：『我等由修善故，壽命延長，今者寧可更增少善，",
        "translation": "The people at that time would think, “Because of our cultivation of goodness we have lengthened our life spans. Now we should increase the number of good deeds.",
        "source": "T01n0001_006:0041c18_42"
    },
    {
        "source_sentence": "何善可修？",
        "translation": "What goodness can be cultivated?",
        "source": "T01n0001_006:0041c20_43"
    },
    {
        "source_sentence": "當孝養父母，敬事師長。』",
        "translation": "You should be filial to your parents and respectfully serve your teachers and elders.'",
        "source": "T01n0001_006:0041c20_44"
    },
    {
        "source_sentence": "於是，其人即孝養父母，敬事師長，壽命延長至八萬歲。",
        "translation": "The people then became filial to their parents and respectfully served their teachers and elders, and their life span was extended to 80,000 years.",
        "source": "T01n0001_006:0041c21_45"
    },
    {
        "source_sentence": "「八萬歲時人，女年五百歲始出行嫁。",
        "translation": "At the age of 80,000 years old, a woman is married for the first time at the age of 500 years old.",
        "source": "T01n0001_006:0041c22_46"
    },
    {
        "source_sentence": "時，人當有九種病，一者寒，二者熱，三者飢，四者渴，五者大便，六者小便，",
        "translation": "The first is cold. The second is heat. The third is hunger. The fourth is thirst. The fifth is excretion. The sixth is urination.",
        "source": "T01n0001_006:0041c23_47"
    },
    {
        "source_sentence": "七者欲，八者饕餮，九者老。",
        "translation": "The seventh is desire, the eighth is pride, and the ninth is old age.",
        "source": "T01n0001_006:0041c24_48"
    },
    {
        "source_sentence": "時，此大地坦然平整，無有溝坑、丘墟、荊棘，亦無蚊、虻、蛇、蚖、毒蟲，",
        "translation": "At that time the earth was level and there were no ditches, mounds, hills, or thorny shrubs. There were also no mosquitoes, gadflies, snakes, vipers, or poisonous insects.",
        "source": "T01n0001_006:0041c25_49"
    },
    {
        "source_sentence": "瓦石、沙礫變成琉璃，人民熾盛，五穀平賤，豐樂無極。",
        "translation": "The country is densely populated and the five grains are neither high nor low, with an infinite variety of plenty and happiness.",
        "source": "T01n0001_006:0041c27_0"
    },
    {
        "source_sentence": "是時，當起八萬大城，村城隣比，雞鳴相聞。",
        "translation": "At the time, 80,000 large cities would arise, and villages and cities would be located close to each other, with fowls singing and hearing each other.",
        "source": "T01n0001_006:0041c28_1"
    },
    {
        "source_sentence": "當於爾時，有佛出世，名為彌勒如來、至真、等正覺，十號具足，如今如來十號具足，",
        "translation": "At that time a buddha named Maitreya, the Tathāgata, Arhat, Perfectly Enlightened One, appeared in the world. He was endowed with ten epithets, as is the Tathāgata today.",
        "source": "T01n0001_006:0041c29_2"
    },
    {
        "source_sentence": "彼於諸天、釋、梵、魔、若魔、天、諸沙門、婆羅門、諸天、世人中，",
        "translation": "Among the gods, Śākyamunis, Brahmās, Māras, Māra-māras, gods, ascetics, brahmins, gods, and worldlings,",
        "source": "T01n0001_006:0042a02_0"
    },
    {
        "source_sentence": "自身作證，亦如我今於諸天、釋、梵、魔、若魔、天、沙門、婆羅門、諸天、世人中，",
        "translation": "I myself have personally realized it, just as I now am among the gods, Śākyamunis, Brahmās, Māras, Māras, gods, śramaṇas, brāhmaṇas, gods, goddesses, and humans.",
        "source": "T01n0001_006:0042a03_1"
    },
    {
        "source_sentence": "自身作證。",
        "translation": "He himself realizes it.",
        "source": "T01n0001_006:0042a04_2"
    },
    {
        "source_sentence": "彼當說法，初言亦善，中下亦善，義味具足，淨修梵行，如我今日說法，",
        "translation": "They will teach the Dharma that is good at the beginning and good at the middle, as well as good at the end. Endowed with true meanings and real essences, they will cultivate practice of austerity in a pure and genuine way, just as I teach the Dharma today.",
        "source": "T01n0001_006:0042a05_3"
    },
    {
        "source_sentence": "上中下言，皆悉真正，義味具足，梵行清淨。",
        "translation": "The above, middle, and lower teachings are all genuine, endowed with meaning and flavor, and purified by religious practice.",
        "source": "T01n0001_006:0042a06_4"
    },
    {
        "source_sentence": "彼眾弟子有無數千萬，如我今日弟子數百。",
        "translation": "There were innumerable thousands of myriads of these disciples, as many as today’s hundreds of my disciples.",
        "source": "T01n0001_006:0042a07_5"
    },
    {
        "source_sentence": "彼時，人民稱其弟子號曰慈子，如我弟子號曰釋子。",
        "translation": "The people then called his disciple Maitreya, just like my disciple Śākyamuni.",
        "source": "T01n0001_006:0042a08_6"
    },
    {
        "source_sentence": "「彼時，有王名曰儴伽，剎利水澆頭種轉輪聖王，典四天下，以正法治，",
        "translation": "“At that time there was a king named Sangha, the kṣatriya by name. He was a universal ruler who poured water from his hair on the head of the buddha and ruled over the four quarters of the earth in accordance with the law.",
        "source": "T01n0001_006:0042a09_7"
    },
    {
        "source_sentence": "莫不靡伏，七寶具足，一金輪寶、二白象寶、三紺馬寶、四神珠寶，五玉女寶、六居士寶、七主兵寶。",
        "translation": "They were all endowed with seven treasures: the first was the golden wheel treasure, the second the white elephant treasure, the third the dark blue horse treasure, the four divine gems, the fifth the jadelike queen treasure, the sixth the householder treasure, and the seventh the military commander treasure.",
        "source": "T01n0001_006:0042a11_8"
    },
    {
        "source_sentence": "王有千子，勇猛雄烈，能却外敵，四方敬順，不加兵杖，自然太平。",
        "translation": "The king had a thousand sons, valiant and heroic, who could defeat all enemies. They were respected by the four quarters of the empire but they did not resort to force or weapons; peace prevailed over them naturally.",
        "source": "T01n0001_006:0042a13_9"
    },
    {
        "source_sentence": "爾時，聖王建大寶幢，圍十六尋，上高千尋，千種雜色嚴飾其幢；",
        "translation": "At that time the holy king built a great jeweled pennant sixteen feet in circumference, one thousand feet high at the top. A thousand different colors adorned the pennants.",
        "source": "T01n0001_006:0042a15_10"
    },
    {
        "source_sentence": "幢有百觚，觚有百枝，寶縷織成，眾寶間廁。",
        "translation": "The banner has a hundred strings of bells, while the harp has a hundred branches woven with precious thread. All the treasures are stored among the railings.",
        "source": "T01n0001_006:0042a16_11"
    },
    {
        "source_sentence": "於是，聖王壞此幢已，以施沙門、婆羅門、國中貧者，然後剃除鬚髮，",
        "translation": "Then the holy king destroyed this banner and gave it to the śramaṇas, brāhmaṇas, and the poor of the country. After that he shaved his hair and beard.",
        "source": "T01n0001_006:0042a17_12"
    },
    {
        "source_sentence": "服三法衣，出家修道，修無上行，於現法中自身作證，生死已盡，梵行已立，",
        "translation": "He wears the three robes of the Dharma, renounces household life, and practices enlightenment. Cultivating the highest path, he realizes it for himself in the present life. Birth and death have been done, the holy life has been established.",
        "source": "T01n0001_006:0042a19_13"
    },
    {
        "source_sentence": "所作已辦，不受後有。」",
        "translation": "What's done has been done, and it won't be done in the future.",
        "source": "T01n0001_006:0042a20_14"
    },
    {
        "source_sentence": "佛告諸比丘：「汝等當勤修善行，以修善行，則壽命延長，顏色增益，",
        "translation": "The Buddha said to the bhikṣus: You should exert yourself in performing good deeds. If you perform good deeds, your life span increases and your appearance improves.",
        "source": "T01n0001_006:0042a21_15"
    },
    {
        "source_sentence": "安隱快樂，財寶豐饒，威力具足，猶如諸王順行轉輪聖王舊法，則壽命延長，",
        "translation": "They are peaceful and happy, rich in riches and treasures, endowed with great power. It is as if the kings obeyed the old rules of the cakravartin sage kings and their rulers extended their life spans.",
        "source": "T01n0001_006:0042a22_16"
    },
    {
        "source_sentence": "顏色增益，安隱快樂，財寶豐饒，威力具足。",
        "translation": "Their appearance improved and they lived peacefully and happily. They possessed abundant wealth and possessions and were endowed with great power.",
        "source": "T01n0001_006:0042a24_17"
    },
    {
        "source_sentence": "比丘亦如是，當修善法，壽命延長，顏色增益，安隱快樂，財寶豐饒，",
        "translation": "Monks, it is the same with you. You should cultivate wholesome states so that your life span increases, your complexion improves, you will be secure and happy, and you will have plenty of wealth and possessions.",
        "source": "T01n0001_006:0042a25_18"
    },
    {
        "source_sentence": "威力具足。",
        "translation": "They are endowed with authoritative power.",
        "source": "T01n0001_006:0042a27_19"
    },
    {
        "source_sentence": "「云何比丘壽命延長？",
        "translation": "How does a monk's life span increase?",
        "source": "T01n0001_006:0042a27_20"
    },
    {
        "source_sentence": "如是比丘修習欲定，精勤不懈，滅行成就，以修神足；",
        "translation": "In the same way, when a bhikṣu practices the absorption of desire he does not refrain from exerting himself with energy. He develops cessation and attainment of conditioned states of equanimity in order to cultivate his supernormal powers.",
        "source": "T01n0001_006:0042a27_21"
    },
    {
        "source_sentence": "修精進定、意定、思惟定，精勤不懈，滅行成就，以修神足，是為壽命延長。",
        "translation": "Cultivating concentration of effort, concentration of mind, and concentration of contemplation with energy and without slackening, he cultivates his supernormal powers in order to extend his life span.",
        "source": "T01n0001_006:0042a29_0"
    },
    {
        "source_sentence": "何謂比丘顏色增益？",
        "translation": "What's meant by a monk whose appearance increases?",
        "source": "T01n0001_006:0042b01_1"
    },
    {
        "source_sentence": "於是比丘戒律具足，成就威儀，見有小罪，生大怖畏，等學諸戒，周滿備悉，",
        "translation": "The bhikṣu observed the precepts and was fully endowed with them. Having perfected his deportment, he committed a minor offense and became greatly fearful. He studied the precepts in such a way as to be completely familiar with them.",
        "source": "T01n0001_006:0042b02_2"
    },
    {
        "source_sentence": "是為比丘顏色增益。",
        "translation": "This is called a monk whose appearance increases.",
        "source": "T01n0001_006:0042b03_3"
    },
    {
        "source_sentence": "何謂比丘安隱快樂？",
        "translation": "What does it mean for a monk to be peaceful and happy?",
        "source": "T01n0001_006:0042b04_4"
    },
    {
        "source_sentence": "於是比丘斷除婬欲，去不善法，有覺、有觀，離生喜、樂，行第一禪；",
        "translation": "The bhikṣu then abandoned sexual desire and renounced all unwholesome states. He entered the first meditative state of absorption in which there is neither initial thought nor sustained thought but, being free from it, gives rise to joy and bliss.",
        "source": "T01n0001_006:0042b04_5"
    },
    {
        "source_sentence": "除滅覺、觀，內信歡悅，撿心專一，無覺、無觀，定生喜、樂，行第二禪；",
        "translation": "He enters the second meditative state of absorption in which there is neither initial thought nor sustained thought to be apprehended nor an examination for enlightenment.",
        "source": "T01n0001_006:0042b06_6"
    },
    {
        "source_sentence": "捨喜守護，專心不亂，自知身樂，賢聖所求，護念、樂行，行第三禪；",
        "translation": "In the third meditative state of absorption free from delight and joy, they concentrate their minds without disturbance. Knowing for themselves the bliss of body and mind, sought by wise and holy beings, they guard and practice it with mindfulness and ease.",
        "source": "T01n0001_006:0042b07_7"
    },
    {
        "source_sentence": "捨滅苦樂，先除憂喜，不苦不樂，護念清淨，行第四禪，是為比丘安隱快樂。",
        "translation": "He abandons pain and pleasure, first removes sorrow and joy, avoids neither pain nor pleasure, keeps his mindfulness pure, and practices the fourth meditation. This is a monk’s peace and happiness.",
        "source": "T01n0001_006:0042b09_8"
    },
    {
        "source_sentence": "「何謂比丘財寶豐饒？",
        "translation": "“What does it mean for a monk to have abundant possessions?",
        "source": "T01n0001_006:0042b10_9"
    },
    {
        "source_sentence": "於是比丘修習慈心，遍滿一方，餘方亦爾，周遍廣普，無二無量，除眾結恨，",
        "translation": "Then the bhikṣu cultivated a mind of benevolence, pervading one direction and so on to all the other directions. It extended everywhere, without duality or limitation, eliminating all enemies.",
        "source": "T01n0001_006:0042b11_10"
    },
    {
        "source_sentence": "心無嫉惡，靜默慈柔，以自娛樂，悲、喜、捨心亦復如是，是為比丘財寶豐饒。",
        "translation": "The bhikṣu is free of jealousy and hostility, remains silent and sympathetic, and enjoys self-reliance in order to amuse himself. The same applies to compassion, joy, and equanimity. This is how a bhikṣu is endowed with abundant possessions.",
        "source": "T01n0001_006:0042b13_11"
    },
    {
        "source_sentence": "何謂比丘威力具足？",
        "translation": "What's meant by a monk whose authority is complete?",
        "source": "T01n0001_006:0042b14_12"
    },
    {
        "source_sentence": "於是比丘如實知苦聖諦，習、盡、道諦亦如實知，是為比丘威力具足。」",
        "translation": "That monk then knows the noble truth of suffering as it really is, and he knows the truths of accumulation, cessation, and the path as they really are; this is how a monk is endowed with authority.",
        "source": "T01n0001_006:0042b15_13"
    },
    {
        "source_sentence": "佛告比丘：「我今遍觀諸有力者無過魔力，然漏盡比丘力能勝彼。」",
        "translation": "The Buddha told the monks, Now, I'll pervasively observe that there's nothing more powerful than the power of Māra, but the power of a monk whose contaminants have ended can overcome them.",
        "source": "T01n0001_006:0042b16_14"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T01n0001_006:0042b18_15"
    },
    {
        "source_sentence": "佛說長阿含經卷第六",
        "translation": "Foshuo Chang ahan jing jing, vol. 6",
        "source": "T01n0001_006:0042b20_0"
    }
]