[
    {
        "source_sentence": "大樓炭經卷第二",
        "translation": "Sutra of the Burning Coal Treasury, Volume 2",
        "source": "T01n0023_002:0282b06_0"
    },
    {
        "source_sentence": "西晉沙門法立共法炬譯",
        "translation": "Translated by the Western Jin Dynasty Translation of the Ascetic Fali and Dharma Torch",
        "source": "T01n0023_002:0282b08_0"
    },
    {
        "source_sentence": "轉輪王品第三(之二)",
        "translation": "The Third Chapter of the Wheel-Turning King (of Two)",
        "source": "T01n0023_002:0282b09_0"
    },
    {
        "source_sentence": "「轉輪王有玉女寶者，何等類？",
        "translation": "“ wheel-turning king has a treasure of the jadelike queen. What sort is it?",
        "source": "T01n0023_002:0282b10_0"
    },
    {
        "source_sentence": "轉輪王明旦與諸大臣共坐參議，時有自然玉女寶在前現，端正姝好面色無比，",
        "translation": "The next morning the wheel-turning king and his ministers sat together to discuss the matter. At that time a woman named Jadelike Jewel of spontaneous birth appeared before him, with an incomparably handsome countenance like that of a heavenly maiden.",
        "source": "T01n0023_002:0282b10_1"
    },
    {
        "source_sentence": "亦不長不短，不肥不瘦，不白不黑。",
        "translation": "Nor is it long or short, neither fat nor thin, neither white nor black.",
        "source": "T01n0023_002:0282b12_2"
    },
    {
        "source_sentence": "冬時身則溫，夏時身則凉，身體諸毛孔皆栴檀香，口出蓮華香，轉輪王甚愛重，",
        "translation": "The body is warm in winter and cool in summer. All the pores of the body are covered with the fragrance of sandalwood, and the mouth emits the fragrance of lotus blossoms. The wheel-turning king loves it very much.",
        "source": "T01n0023_002:0282b13_3"
    },
    {
        "source_sentence": "意不起婬欲向他人，何況當復身行？",
        "translation": "He doesn't give rise to anger in his mind and wants to turn it toward others, so why wouldn't he do so?",
        "source": "T01n0023_002:0282b15_4"
    },
    {
        "source_sentence": "爾時轉輪王甚歡喜踊躍言：『已為我自然玉女寶，今我已作轉輪王。』",
        "translation": "It was then that the wheel-turning king rejoiced and jumped, saying, 'You've naturally given me the jadelike woman treasure, and now I've become the wheel-turning king.'",
        "source": "T01n0023_002:0282b16_0"
    },
    {
        "source_sentence": "轉輪王有玉女寶如是。",
        "translation": "The wheel-turning king has a jadelike queen treasure like this.",
        "source": "T01n0023_002:0282b17_1"
    },
    {
        "source_sentence": "「轉輪王有主藏聖臣寶，何等類？",
        "translation": "“ wheel-turning king has a treasury of noble ministers and treasures, what are they?",
        "source": "T01n0023_002:0282b18_2"
    },
    {
        "source_sentence": "轉輪王明旦坐參議，時見主藏聖臣寶在前，解慧曉事至誠，往至轉輪王所白言：『轉輪王所欲求索者，",
        "translation": "The next morning the wheel-turning king was seated in the assembly hall. When he saw that the treasury councilor, the noble minister treasurer, was before him, understanding and attentive to matters with utmost sincerity, he approached the wheel-turning king and said:",
        "source": "T01n0023_002:0282b18_3"
    },
    {
        "source_sentence": "我為天王辦之，王但安隱坐。』",
        "translation": "I prepared it for the king of gods, but the king simply sat quietly.'",
        "source": "T01n0023_002:0282b21_4"
    },
    {
        "source_sentence": "轉輪王欲試主藏聖臣寶，使會四部兵，乘船入水，告主藏聖臣：『我欲得金銀珍寶，",
        "translation": "The wheel-turning king wished to test the treasures of the treasury councilor treasurer, so he assembled his fourfold army and entered the water in a boat. He said to the treasurer treasurer councilor treasurer, “I wish to obtain gold, silver, and precious jewels.",
        "source": "T01n0023_002:0282b21_5"
    },
    {
        "source_sentence": "當與我。』",
        "translation": "You will give it to me.'",
        "source": "T01n0023_002:0282b23_6"
    },
    {
        "source_sentence": "主藏聖臣白轉輪王言：『渡水已，隨王欲，當與之。』",
        "translation": "The lord of the treasury, the noble minister, said to the wheel-turning king, 'After crossing the water, I'll give it to him as he wishes.'",
        "source": "T01n0023_002:0282b23_7"
    },
    {
        "source_sentence": "王言：『今當於此用之，疾與我金銀珍寶，渡水已我不用。』",
        "translation": "The king said, 'Now, let's use it here; quickly give me gold, silver, and other treasures, and I won't use them after crossing the water.'",
        "source": "T01n0023_002:0282b25_8"
    },
    {
        "source_sentence": "主藏聖臣聞受其教，整衣服船上長跪右手撓水，以器鈔金銀珍寶。",
        "translation": "The lord of the treasury, a holy minister, heard and accepted his instruction, adjusted his clothes, knelt down long enough to cross the water with his right hand, and filled the container with gold, silver, and precious treasures.",
        "source": "T01n0023_002:0282b26_9"
    },
    {
        "source_sentence": "譬如蟲著樹，諸金銀珍寶器，著手如是。",
        "translation": "It's like when an insect goes to a tree and puts gold, silver, and treasured vessels in his hand.",
        "source": "T01n0023_002:0282b27_10"
    },
    {
        "source_sentence": "爾時，主藏聖臣，持眾珍寶著船上，白轉輪王言：『欲得幾許金銀珍寶？",
        "translation": "At the time, the lord of the treasury's noble minister, carrying all the treasures on his boat, said to the wheel-turning king, 'How much gold and silver treasure do you want?'",
        "source": "T01n0023_002:0282b28_11"
    },
    {
        "source_sentence": "今當與王。』",
        "translation": "Now, I will give it to the king.'",
        "source": "T01n0023_002:0282c01_12"
    },
    {
        "source_sentence": "轉輪王告主藏聖臣言：『我所有金銀珍寶甚眾多，但欲試卿耳！』",
        "translation": "The wheel-turning king told the lord of the treasury, saying, 'There are so many treasures of gold and silver that I want to test you!'",
        "source": "T01n0023_002:0282c01_13"
    },
    {
        "source_sentence": "主藏聖臣聞已，便還持金銀珍寶著水中。",
        "translation": "On hearing this, the lord of the treasury and sage ministers returned with gold and silver treasures to put them in the water.",
        "source": "T01n0023_002:0282c02_14"
    },
    {
        "source_sentence": "爾時，轉輪王甚歡喜踊躍言：『已為我自然主藏聖臣寶，我已為轉輪王。』",
        "translation": "At the time, the wheel-turning king was overjoyed and jumped up and down, saying, 'I've naturally mastered the treasure of the noble minister who stores it for me, and I've become the wheel-turning king.'",
        "source": "T01n0023_002:0282c03_15"
    },
    {
        "source_sentence": "轉輪王有主藏聖臣寶如是。",
        "translation": "The wheel-turning king has treasures like this from the lord of the treasury, the noble minister.",
        "source": "T01n0023_002:0282c05_16"
    },
    {
        "source_sentence": "「轉輪王有兵臣寶，何等類？",
        "translation": "“O universal ruler! What sort of treasure is the king’s treasure that is possessed by his ministers?",
        "source": "T01n0023_002:0282c06_17"
    },
    {
        "source_sentence": "轉輪王明旦坐參議，時見有兵臣在前，解慧勇猛曉事，往至轉輪王所，",
        "translation": "The next morning the wheel-turning king was seated in the assembly hall. When he saw an army minister before him, understanding and wise as well as courageous and knowledgeable, he went to where the wheel-turning king was.",
        "source": "T01n0023_002:0282c06_18"
    },
    {
        "source_sentence": "白轉輪王言：『所欲為作我為辦，王但自安坐莫憂！』",
        "translation": "He said to the wheel-turning king, 'Whatever you want, I'll do it for you; the king simply sit calmly and don't worry!'",
        "source": "T01n0023_002:0282c08_19"
    },
    {
        "source_sentence": "爾時，轉輪王欲試兵臣，使會四部兵，告兵臣寶言：『不曉兵法者教令曉之，",
        "translation": "At that time, wishing to test his military commander, the cakravartin assembled the fourfold army and said to the treasured military commander, “Those who do not know how to fight should be taught.",
        "source": "T01n0023_002:0282c09_20"
    },
    {
        "source_sentence": "已曉者教令重知，不曉住者教令知住，不曉騎乘弓馬者教令知。』",
        "translation": "Those who have understood it will be instructed to know it again, those who don't understand it will be instructed to know it when they live, and those who don't understand it will be instructed to know it when they ride on a bow or horse.'",
        "source": "T01n0023_002:0282c11_21"
    },
    {
        "source_sentence": "兵臣寶即受教，皆教諸兵。",
        "translation": "The military ministers and treasures then accepted the teaching, and they all taught the soldiers.",
        "source": "T01n0023_002:0282c12_22"
    },
    {
        "source_sentence": "轉輪王甚歡喜踊躍言：『已為我自然兵臣寶，我今已為轉輪王。』",
        "translation": "The wheel-turning king was overjoyed and jumped up and down, saying, 'You've been my natural treasure of soldiers and ministers, and now I'm the wheel-turning king.'",
        "source": "T01n0023_002:0282c13_23"
    },
    {
        "source_sentence": "轉輪王有兵臣寶如是。」",
        "translation": "The wheel-turning king has an army of ministers and treasures like this.",
        "source": "T01n0023_002:0282c15_0"
    },
    {
        "source_sentence": "佛言：「轉輪王有七寶如是。」",
        "translation": "The Buddha said, Thus are the seven treasures of the wheel-turning king.",
        "source": "T01n0023_002:0282c15_1"
    },
    {
        "source_sentence": "佛言：「轉輪王有四德。",
        "translation": "The Buddha said, Wheel-turning king has four virtues.",
        "source": "T01n0023_002:0282c16_2"
    },
    {
        "source_sentence": "云何為四德？",
        "translation": "What are the four virtues?",
        "source": "T01n0023_002:0282c16_3"
    },
    {
        "source_sentence": "一者大富，珍寶田宅奴婢珠玉象馬工巧者眾多，天下人富無有如轉輪王者，",
        "translation": "The first is great wealth. There are many treasures, jewels, fields, householders, servants, pearls, jade, elephants, horses, and skillful artisans; no one in the world is as wealthy as a universal ruler.",
        "source": "T01n0023_002:0282c17_0"
    },
    {
        "source_sentence": "是為轉輪王第一德。",
        "translation": "This is the first virtue of a wheel-turning king.",
        "source": "T01n0023_002:0282c18_1"
    },
    {
        "source_sentence": "二者轉輪王最端正姝好顏色無比，天下人端正姝好，無有如轉輪王者，",
        "translation": "The second is that the wheel-turning king is most handsome and beautiful, with incomparable appearance. All the people in the world are as handsome and beautiful as the wheel-turning king.",
        "source": "T01n0023_002:0282c19_2"
    },
    {
        "source_sentence": "是為轉輪王第二德。",
        "translation": "This is the second virtue of a wheel-turning king.",
        "source": "T01n0023_002:0282c21_0"
    },
    {
        "source_sentence": "三者轉輪王常安隱無疾病，身常等等，亦不寒熱，寒熱適其意，諸所飲食食皆安隱，",
        "translation": "Third, the universal ruler is always at ease and free of sickness. His body is neither cold nor hot; neither cold or hot suits his wishes. The food he eats and drinks are all peaceful.",
        "source": "T01n0023_002:0282c21_1"
    },
    {
        "source_sentence": "天下人無有如轉輪王無疾病者，是為轉輪王第三德。",
        "translation": "Nothing exists in the world like the wheel-turning king who has no illness, which is the third virtue of the wheel-turning king.",
        "source": "T01n0023_002:0282c23_2"
    },
    {
        "source_sentence": "四者轉輪王常安隱長壽，天下人無有常安隱長壽如轉輪王者，是為轉輪王四德。",
        "translation": "These are the four virtues of a universal ruler. 4. The universal ruler is always peaceful and long-lived, but there is no one in the world who is as peaceful and long-lived like a universal ruler.",
        "source": "T01n0023_002:0282c24_3"
    },
    {
        "source_sentence": "轉輪王有七寶及四德如是。",
        "translation": "The wheel-turning king has seven treasures and four virtues like this.",
        "source": "T01n0023_002:0282c26_4"
    },
    {
        "source_sentence": "「轉輪王以正法行為政現，不轉善現，行十善事。",
        "translation": "“The wheel-turning king governs his appearance by following the right teaching, doesn’t follow good appearances, and performs ten good deeds.",
        "source": "T01n0023_002:0282c27_5"
    },
    {
        "source_sentence": "教諸小國王傍臣左右人民，奉行十善事。",
        "translation": "He instructed the kings of the small countries, their attendants, and the people to perform the ten good deeds.",
        "source": "T01n0023_002:0282c28_6"
    },
    {
        "source_sentence": "轉輪王哀念諸郡國人民，如父哀子，諸郡國人民，愛敬轉輪王如子愛父。",
        "translation": "The wheel-turning king grieves for the people of the prefectures and countries, just as a father grieves for his children, and the people of prefectures love and respect the wheel-turning king like a child who loves his father.",
        "source": "T01n0023_002:0282c29_7"
    },
    {
        "source_sentence": "轉輪王治天下，閻浮利地平正無有高下，無有棘刺，無有毒獸蟲蟻，無有山陵谿谷，",
        "translation": "The land of Jambudvfpa is neither high nor low; there are no thorns or thorn roots, poisonous animals, insects, or ants. There are no mountains, mounds, or valleys.",
        "source": "T01n0023_002:0283a02_8"
    },
    {
        "source_sentence": "無有礫石地，但有棄捐金銀明月珠玉琉璃琥珀水精車璩馬瑙珊瑚。",
        "translation": "There's no gravel or rocky ground, but there's discarded gold, silver, bright moon, pearls, jade, lapis lazuli, ambrosia, chariots, agate, and coral.",
        "source": "T01n0023_002:0283a03_9"
    },
    {
        "source_sentence": "轉輪王在天下治國時，富樂安隱熾盛，五穀豐熟人民眾多。」",
        "translation": "When the wheel-turning king ruled his country under heaven, he was prosperous and peaceful, abundant in five grains, and had a large population.",
        "source": "T01n0023_002:0283a05_10"
    },
    {
        "source_sentence": "佛語諸比丘：「轉輪王治國時，天下有八萬郡國聚落居，鷄鳴展轉相聞。",
        "translation": "The Buddha said to the monks, When the wheel-turning king ruled his country, there were 80,000 counties and villages in the world under him, and the cries of the foxes were heard one after another.",
        "source": "T01n0023_002:0283a06_11"
    },
    {
        "source_sentence": "轉輪王治國時，天下常遍有水，草木常青，木常有葉華；",
        "translation": "When the cakravartin ruled his kingdom water always flowed everywhere in the world. All the grasses and trees always grew green, and all the trees always had leaves and flowers.",
        "source": "T01n0023_002:0283a08_12"
    },
    {
        "source_sentence": "其地草葉，周匝分布，色如孔雀毛，其香如華香，足蹈上四寸入地，舉足還復如故，",
        "translation": "The grass and leaves on the ground are spread all around, with the color of a peacock’s hair. Their fragrance is like that of flowers. The trees touch the ground four inches above their feet as they walk, but when they lift their legs they do so just as before.",
        "source": "T01n0023_002:0283a09_13"
    },
    {
        "source_sentence": "地草又無四寸空缺處。",
        "translation": "The ground and grass are also nowhere four inches apart.",
        "source": "T01n0023_002:0283a11_14"
    },
    {
        "source_sentence": "有香樹常生華實，破其實出種種香。",
        "translation": "There are fragrant trees that always produce flowers and fruits, and they break down and actually produce various kinds of fragrance.",
        "source": "T01n0023_002:0283a12_15"
    },
    {
        "source_sentence": "有衣被樹，出華實及種種衣被。",
        "translation": "There are robes covered with trees that produce flowers, fruits, and various kinds of robes.",
        "source": "T01n0023_002:0283a13_0"
    },
    {
        "source_sentence": "有珠寶瓔珞樹出華實，破中有無央數種種珠寶瓔珞。",
        "translation": "There's a tree of jeweled jewelry that produces flowers and fruits, and there's an incalculable number of various kinds of jeweled jewelry in the breach.",
        "source": "T01n0023_002:0283a13_1"
    },
    {
        "source_sentence": "有不息華樹出華實，破中有種種不息。",
        "translation": "There's an unceasing flower tree that produces flowers and fruits, and there are various kinds of unceasing in the broken fruit.",
        "source": "T01n0023_002:0283a14_2"
    },
    {
        "source_sentence": "有果樹，常生華實，破中有種種果。",
        "translation": "There's a fruit tree that always produces flowers and fruits, and there are various fruits in the broken fruit.",
        "source": "T01n0023_002:0283a15_3"
    },
    {
        "source_sentence": "有器樹生華實，破中有種種器。",
        "translation": "There's a container tree that produces flowers and fruits, and there are various containers in the refutation.",
        "source": "T01n0023_002:0283a16_4"
    },
    {
        "source_sentence": "有妓樂樹生華實，破中有種種音樂。",
        "translation": "There's a tree of music that produces flowers and fruits, and there are various kinds of music in the breach.",
        "source": "T01n0023_002:0283a17_5"
    },
    {
        "source_sentence": "轉輪王治國，是時天下閻浮利不耕種，米穀稻粮皆自然生，清潔無穬，",
        "translation": "When the wheel-turning king ruled his country, Jambudvfpa under heaven did not cultivate soil; rice, grain, rice, and cereals all arose naturally, being pure and without abscesses.",
        "source": "T01n0023_002:0283a18_6"
    },
    {
        "source_sentence": "出其有種種甘。",
        "translation": "It produces various kinds of sweetness.",
        "source": "T01n0023_002:0283a19_7"
    },
    {
        "source_sentence": "轉輪王臨壽終時，身不甚痛。",
        "translation": "When the wheel-turning king's life came to an end, his body didn't experience much pain.",
        "source": "T01n0023_002:0283a20_8"
    },
    {
        "source_sentence": "譬如習樂人大食，腹不甚痛。",
        "translation": "It's like eating a large amount of food that's cultivated for pleasure and doesn't cause great pain in the abdomen.",
        "source": "T01n0023_002:0283a20_9"
    },
    {
        "source_sentence": "轉輪王臨壽終時，身體不痛如是。",
        "translation": "When the wheel-turning king's life came to an end, his body didn't hurt like this.",
        "source": "T01n0023_002:0283a21_10"
    },
    {
        "source_sentence": "轉輪王命過已後，金輪、白象寶便滅去，紺色馬、明月珠寶亦沒去，玉女寶、主藏聖臣寶、導道聖臣寶，",
        "translation": "After the wheel-turning king had passed away, the golden wheel and the white elephant treasures disappeared; the dark blue horse and the moon jewel in the morning also disappeared. The jadelike queen treasure, the treasury treasure, the holy attendant treasure of the ruler, and the holy attendant treasure of the Guide of the Way all disappeared.",
        "source": "T01n0023_002:0283a22_11"
    },
    {
        "source_sentence": "便沐浴轉輪王身，以綿纏身，復以五百張[疊*毛]纏身，著鐵棺中，",
        "translation": "He then bathed the body of the wheel-turning king, covered it with cotton cloth, wrapped it in another five hundred patches of cotton cloth, and buried it in an iron coffin.",
        "source": "T01n0023_002:0283a24_12"
    },
    {
        "source_sentence": "以酥灌其上，滿已蓋覆之，以釘釘之。",
        "translation": "He pours butter over it, covers it with a lid that's full, and nailes it with a nail.",
        "source": "T01n0023_002:0283a25_13"
    },
    {
        "source_sentence": "出轉輪王棺，眾人共作妓樂歌舞。",
        "translation": "The coffin of the universal ruler came out, and all the people performed music, singing and dancing together.",
        "source": "T01n0023_002:0283a26_14"
    },
    {
        "source_sentence": "出著城外，積一切香薪，持轉輪王棺，著上便放火燒。",
        "translation": "Outside the city, he stored all kinds of fragrant wood and carried a universal coffin. When he ascended to it, he set fire to burn it.",
        "source": "T01n0023_002:0283a27_15"
    },
    {
        "source_sentence": "燒已玉女寶、主藏聖臣寶、導道聖臣寶，共收骨以置於四徼道中起塔，",
        "translation": "Having burned the treasures of the jadelike queen, the treasures of the treasury councilor and the treasures of the holy ministers who led the way, they collected the bones together and placed them in a stupa built on the four sides of the road.",
        "source": "T01n0023_002:0283a28_16"
    },
    {
        "source_sentence": "高四十里，廣長四十里，周匝起墻廣長二百里，以七寶金銀水精琉璃赤真珠車璩馬瑙，",
        "translation": "It was forty li high and forty li long, two hundred li in all directions surrounded by walls built of the seven kinds of treasure: gold, silver, crystal, lapis lazuli, ruby, pearls, chariots, agate, and horse ashes.",
        "source": "T01n0023_002:0283b01_17"
    },
    {
        "source_sentence": "七重欄楯、七重交露、七重行樹，周匝圍遶，甚姝好。",
        "translation": "It is surrounded by sevenfold railings, sevenfold interlocks, and sevenfold lines of trees that are very beautiful.",
        "source": "T01n0023_002:0283b03_18"
    },
    {
        "source_sentence": "其從四方來，禮轉輪王，行法起塔，皆得無數福。",
        "translation": "Those who come from the four directions venerate wheel-turning kings, practice the Dharma, and build stūpas will attain countless merits.",
        "source": "T01n0023_002:0283b04_19"
    },
    {
        "source_sentence": "爾時玉女寶、主藏聖臣寶、導道聖臣寶，為轉輪王起塔已，便布施飢者與飯，",
        "translation": "It was then that the treasure of the jadelike queen, the treasure of the treasury lord, the treasure of the noble ministers, and the treasure of the noble ministers guiding the path were built a stūpa for the wheel-turning king, and he gave it to the hungry man and gave him food.",
        "source": "T01n0023_002:0283b05_20"
    },
    {
        "source_sentence": "渴者與漿，欲得衣者與衣，欲得香熏華者與香熏華，欲得財物牛羊者與之。",
        "translation": "Those who are thirsty give wine, those who want to get robes give robes, those who want to obtain fragrant flowers give fragrant flowers, and those who want to obtain property or cattle and sheep give it.",
        "source": "T01n0023_002:0283b07_21"
    },
    {
        "source_sentence": "其後玉女寶、主藏聖臣寶、導道聖臣寶乃命過。」",
        "translation": "After that, the treasure of the jadelike queen, the treasure of the lord of the treasury, the treasure of the noble ministers of the path, and the treasure of the noble ministers of the path were ordered to pass away.",
        "source": "T01n0023_002:0283b09_22"
    },
    {
        "source_sentence": "大樓炭經泥犁品第四(之一)",
        "translation": "Chapter Four (one) of the Niraya Chapter of the Sutra on the Cultivation of Charcoal Trees",
        "source": "T01n0023_002:0283b11_0"
    },
    {
        "source_sentence": "佛告比丘：「有大鐵圍山，更復有第二大鐵圍山，中間窈窈冥冥，其日月大尊神光明不能及照。",
        "translation": "The Buddha told the monks, There's a large iron ring mountain and another large iron ring mountain in between, which is so dark and mysterious that the sun and moon of the great venerable god cannot match its illumination.",
        "source": "T01n0023_002:0283b12_0"
    },
    {
        "source_sentence": "其中有八大泥犁，一泥犁者，有十六部。",
        "translation": "Among them there are eight great mud plows, and the one mud plow has sixteen parts.",
        "source": "T01n0023_002:0283b14_1"
    },
    {
        "source_sentence": "第一大泥犁名想、第二大泥犁名黑耳、第三大泥犁名僧乾、第四大泥犁名樓獵、第五大泥犁名噭嚾、第六大泥犁名燒炙、第七大泥犁名釜煮、第八大泥犁名阿鼻摩訶。」",
        "translation": "The first great nirvāṇa is called conception, the second great nirvāṇa is called black ears, the third great nirvāṇa is called dryness, the fourth great nirvāṇa is called hunting, the fifth great nirvāṇa is called torment, the sixth great nirvāṇa is called burning, the seventh great nirvāṇa is called cooking",
        "source": "T01n0023_002:0283b15_0"
    },
    {
        "source_sentence": "佛言：「何以名為想？",
        "translation": "The Buddha said, What's called conception?",
        "source": "T01n0023_002:0283b18_1"
    },
    {
        "source_sentence": "其大想泥犁，若有人墮中，其八指生爪如利刀，以相把刺，其肉應手墮去，",
        "translation": "If someone were to fall into that great imagined mud plow, their eight fingers would give rise to nails like sharp swords, and if they touched each other with a thorn, the flesh would fall off in their hands.",
        "source": "T01n0023_002:0283b19_2"
    },
    {
        "source_sentence": "想念欲相殺，以是麤事，名為想泥犁。",
        "translation": "Thinking of each other and wanting to kill each other, this is called conceptualizing the mud plow because it's a debilitating thing.",
        "source": "T01n0023_002:0283b21_3"
    },
    {
        "source_sentence": "更復有餘種種因緣，復次，其大想泥犁，若有人墮中者，手中自然刀劍，",
        "translation": "Furthermore, there are various other causes and conditions. Furthermore, the great ideation is that if someone falls into a mud plow, they'll naturally have a sword in their hand.",
        "source": "T01n0023_002:0283b21_4"
    },
    {
        "source_sentence": "以相斫刺，想欲殺他人，以是麤想事故，名為想。",
        "translation": "To think of sexual misconduct as wanting to kill others, and to think of sexual misconduct as an incident that's called conception.",
        "source": "T01n0023_002:0283b23_5"
    },
    {
        "source_sentence": "復有餘因緣，其有人墮中者，手自然小刀，以刺剝他人，想念欲殺之，",
        "translation": "Again, suppose there are other reasons why a man falls into the middle. He naturally has a small knife in his hand to pierce others and thinks he wants to kill them.",
        "source": "T01n0023_002:0283b24_6"
    },
    {
        "source_sentence": "以是麤想事故，名為想。",
        "translation": "It's called perception because it's the cause of debilitating perception.",
        "source": "T01n0023_002:0283b26_7"
    },
    {
        "source_sentence": "復有餘因緣，其有人墮大想泥犁中者，以手搔從足剝餘者至頂，想念欲殺他人，",
        "translation": "Again, there are other reasons why some people fall into the great conceptual mud plow. They scrape the remaining parts up to the top of their heads with their hands and think that they want to kill others.",
        "source": "T01n0023_002:0283b26_8"
    },
    {
        "source_sentence": "涼風起吹之，身瘡平復，展轉相語，當復長生，中復有相語言：『我曹今適生。』",
        "translation": "When a cool breeze arises and blows it, the sores on their bodies are restored, and they talk to each other in turn, and they'll be born again for a long time.",
        "source": "T01n0023_002:0283b28_9"
    },
    {
        "source_sentence": "以是故，名為想泥犁。",
        "translation": "Because of this, it's called the imagined mud plow.",
        "source": "T01n0023_002:0283c01_10"
    },
    {
        "source_sentence": "復有餘因緣，用是故泥犁人壽長久，乃從想泥犁中出，便走求解脫。",
        "translation": "Again, there are other causes and conditions that make it possible for people to have a long life span in the mud plow because of which they emerge from the mud plow of ideation and then run away to seek liberation.",
        "source": "T01n0023_002:0283c01_11"
    },
    {
        "source_sentence": "「復有泥犁，名為黑界，縱廣二萬里，悉入中裏，火從身出，繞身三匝還入身，",
        "translation": "Again, there is a mud plow called the “dark realm.” Twenty thousand li in all directions and twenty thousand li in width, it enters inside and out. The fire emerges from its body, circumambulates it three times, and returns within.",
        "source": "T01n0023_002:0283c03_12"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未解故不死。",
        "translation": "The poisonous pain is unbearable, and they won't die because their faults haven't been resolved.",
        "source": "T01n0023_002:0283c04_13"
    },
    {
        "source_sentence": "復次，黑界泥犁東壁火繞三匝燒人，火焰至西壁，西壁火焰至東壁，南壁火焰至北壁，",
        "translation": "Again, the fire circled the eastern wall of the niraya of the black realm three times and burned people. The flame of the fire reached the western wall, the flame of the western wall reached the eastern wall, and the flame of the southern wall reached the northern wall.",
        "source": "T01n0023_002:0283c05_14"
    },
    {
        "source_sentence": "北壁火焰至南壁，上火焰下至地，下焰上至上，人在中燒炙，毒痛不可忍，",
        "translation": "The flame of the fire from the northern wall reaches the southern wall, and the flame from the upper one reaches the ground; the flame from the lower one reaches up to the upper one. All the people in this hell are burned and tormented with unbearable pain and suffering.",
        "source": "T01n0023_002:0283c07_15"
    },
    {
        "source_sentence": "過惡未解故不死，在其中甚久久，乃從黑界泥犁出，便走求解脫。",
        "translation": "Because their faults and evils haven't been untied, they won't die. After being there for a long time, they emerge from the mud plow of the black realm and run away to seek liberation.",
        "source": "T01n0023_002:0283c09_16"
    },
    {
        "source_sentence": "「有泥犁名沸屎，縱廣二萬里，悉入沸屎中，自然至頸，熱沸踊躍，人以把蹶，",
        "translation": "“There’s a mud plow called Boiling Excrement, twenty thousand li in length and width, which naturally reaches its neck when it enters boiling excrement.",
        "source": "T01n0023_002:0283c10_17"
    },
    {
        "source_sentence": "欲出不能得，身體手足耳鼻面目皆爛熟，毒痛不可忍，過惡未盡故不死；",
        "translation": "Their bodies, hands, feet, ears, nose, face, and eyes all rotten away. The pain of the poison cannot be tolerated; they do not die until their faults have been eliminated.",
        "source": "T01n0023_002:0283c12_18"
    },
    {
        "source_sentence": "有蟲名鐵口，啄人髑髏，啄人肉穿之，破骨噉人髓。",
        "translation": "There's a worm named iron mouth that pecks at people's skulls, pecks into their flesh, penetrates it, breaks through their bones, and digs up human marrow.",
        "source": "T01n0023_002:0283c14_19"
    },
    {
        "source_sentence": "泥犁中人，手捲屎食之，脣舌皆燋，咽喉腹中腸胃皆爛，便下過去，毒痛不可忍，",
        "translation": "A man in a mud plow eats the excrement with his hands wrapped around it. His lips and tongue all blistering, his throat, abdomen, stomach, intestines, and stomach all rotting away, and he goes down and passes on, unbearably pained by the poison.",
        "source": "T01n0023_002:0283c15_20"
    },
    {
        "source_sentence": "過惡未盡故不死，在其中甚久，以後乃從沸屎泥犁中出，便走欲求解脫。",
        "translation": "Because their faults and evils haven't ended, they won't die; they stay there for a long time. After that, they emerge from the boiling mud plow and run away to seek liberation.",
        "source": "T01n0023_002:0283c17_21"
    },
    {
        "source_sentence": "「有泥犁名五百釘，縱廣二萬里悉入中，泥犁旁各取人手足，臥撲著釘地，",
        "translation": "“There’s a mud plow called Five Hundred Nails, twenty thousand li in length and width, all entering into it. At the side of each mud plow people take their hands and feet and prostrate them on the ground with their legs touching the nails.",
        "source": "T01n0023_002:0283c18_22"
    },
    {
        "source_sentence": "以燒鐵釘釘其右掌，以鐵釘釘左掌，以鐵釘釘其右足，復以鐵釘釘其左足、復以鐵釘釘其心、復以鐵釘遍釘其身下徹地，",
        "translation": "He fastened his right palm with a burning iron nailing, his left palm with an iron nailing, his right foot with an iron nailing, his left foot with an iron nailing, his heart with an iron nailing, and his whole body with an iron nailing that penetrated the ground beneath him.",
        "source": "T01n0023_002:0283c20_23"
    },
    {
        "source_sentence": "悉以五百釘釘其身，續動欲起，毒痛不可忍。",
        "translation": "They all nailed their bodies with five hundred nails, continuing to move and wanting to give rise to pain and suffering unbearable.",
        "source": "T01n0023_002:0283c23_24"
    },
    {
        "source_sentence": "泥犁旁問言：『欲求何等？』",
        "translation": "Aside the mud plow, he asked, 'What do you want?'",
        "source": "T01n0023_002:0283c24_25"
    },
    {
        "source_sentence": "報言：『我但苦飢渴！』",
        "translation": "They replied, 'I'm only suffering from hunger and thirst!'",
        "source": "T01n0023_002:0283c24_26"
    },
    {
        "source_sentence": "泥犁旁取鉗拗開口，燒熱鐵著其咽中，脣舌咽皆燋，腹中腸胃皆燋爛，",
        "translation": "At the side of the mud plow, he takes a forceps and opens his mouth. Burning hot iron is placed in his throat. His lips, tongue, and throat are all scorched, and everything in his abdomen, intestines, and stomach are burned away.",
        "source": "T01n0023_002:0283c25_27"
    },
    {
        "source_sentence": "與腸胃下過去，毒痛不可忍，過惡未盡故不死，用是故人在泥犁中甚長久，",
        "translation": "The poison and pain they experience cannot be tolerated. They do not die until the exhaustion of their past evil deeds. For this reason, for a very long time people live in mud plows.",
        "source": "T01n0023_002:0284a02_0"
    },
    {
        "source_sentence": "以後乃從五百釘泥犁得出，便走求欲解脫。",
        "translation": "After that, he emerged from the five hundred naked mud plows and ran away in search of liberation.",
        "source": "T01n0023_002:0284a03_1"
    },
    {
        "source_sentence": "「有泥犁名車怗，縱廣二萬里，悉入其中，泥犁旁便問言：『欲求何等？』",
        "translation": "There's a mud plow named chariot, 20,000 miles long and wide, that all enters it, and beside the mud plow he asks, 'What do you want?'",
        "source": "T01n0023_002:0284a04_2"
    },
    {
        "source_sentence": "報言：『但苦飢渴。』",
        "translation": "They replied, 'It's only painful hunger and thirst.'",
        "source": "T01n0023_002:0284a06_3"
    },
    {
        "source_sentence": "泥犁旁便各各取其身撲著地，取鉗拗開其口，取消銅灌人口，脣舌皆燋，",
        "translation": "Beside the mud plow, they each took their bodies and pushed them to the ground. Using forceps and blows, they opened their mouths, expelled the copper clay that had been poured into the earth, and their lips and tongues stuck together.",
        "source": "T01n0023_002:0284a06_4"
    },
    {
        "source_sentence": "腹中五藏腸胃，皆燋爛燒炙，毒痛不可忍，過惡未盡故不死，在泥犁中甚長久，",
        "translation": "The five stores of intestines and stomach in the belly are all scorched, burned, and scorched. The poisonous pain they experience is unbearable. They do not die until their evil deeds have been done; they remain in the mud plow for a very long time.",
        "source": "T01n0023_002:0284a08_5"
    },
    {
        "source_sentence": "已後乃得出，便走求解脫。",
        "translation": "After that, he came out and ran away in search of liberation.",
        "source": "T01n0023_002:0284a10_6"
    },
    {
        "source_sentence": "「有泥犁名為飲，悉入其中，泥犁旁便問言：『欲求何等？』",
        "translation": "There's a mud plow named drinking, and they all enter it, and the other side of the mud plow asks, 'What do you want?'",
        "source": "T01n0023_002:0284a10_7"
    },
    {
        "source_sentence": "報言：『我但苦飢渴！』",
        "translation": "They replied, 'I'm only suffering from hunger and thirst!'",
        "source": "T01n0023_002:0284a12_0"
    },
    {
        "source_sentence": "泥犁旁即各各取其人身撲著燒熱地，以鉗拗開其口，以燒鐵丸著人口中，",
        "translation": "At the side of the mud plow, they each took their bodies and pushed them into a scorching hot place, opened their mouths with forceps, burned iron balls, and placed them among the people.",
        "source": "T01n0023_002:0284a12_1"
    },
    {
        "source_sentence": "脣舌咽皆燋，五臟腸胃盡燋，便下過去，毒痛不可忍，過惡未解故不死，",
        "translation": "Their lips, tongue, and throat all blistering, their five internal organs, intestines, stomach, and stomach are all burned away, and they pass away. The pain of the poison cannot be tolerated, so they won’t die until they have undergone excruciating torture.",
        "source": "T01n0023_002:0284a14_2"
    },
    {
        "source_sentence": "在其中甚長久，乃從飲泥犁中出，便走求解脫。",
        "translation": "After staying there for a long time, he emerged from the mud plow and ran away in search of liberation.",
        "source": "T01n0023_002:0284a15_3"
    },
    {
        "source_sentence": "「有泥犁名一銅釜，縱廣二萬里，盡入中。",
        "translation": "“There is a mud plow called the copper pot, twenty thousand li long and twenty thousand li in width, all entering into it.",
        "source": "T01n0023_002:0284a16_4"
    },
    {
        "source_sentence": "泥犁旁便共舉人身體手足著釜中煮，在底亦熟在上亦熟，湯沸踊躍起伏，",
        "translation": "Beside the mud plow, they all lifted their bodies, hands and feet, and put them into the pot to cook. At the bottom it was cooked, and at the top it was cooked as well. The water boiled and jumped up and down in unison.",
        "source": "T01n0023_002:0284a17_5"
    },
    {
        "source_sentence": "有在上露手足者覆亦熟，譬如煮豆，在底亦熟在上亦熟，覆亦熟露亦熟。",
        "translation": "If someone exposes their hands and feet above, they're covered and also cooked, like boiling beans that are cooked at the bottom and cooked above, which are covered and cooked and exposed as well.",
        "source": "T01n0023_002:0284a19_6"
    },
    {
        "source_sentence": "泥犁中人亦如是，在二萬里銅釜泥犁中，上下皆熟，頭面耳鼻手足皆見熟爛。",
        "translation": "So it is with the people in the mud plows, who are 20,000 miles away in a copper pot and mud plow, whose heads, faces, ears, nose, hands, and feet all see ripening and rotting.",
        "source": "T01n0023_002:0284a21_7"
    },
    {
        "source_sentence": "泥犁旁以矛刺內其中，毒痛不可忍，過惡未解故不死，用是故在其中甚久長，",
        "translation": "To the side of the mud plow he thrusts a spear into it, which inflicts unbearable pain and suffering. He does not die until his offenses have been resolved. Because of this functioning, he remains in this hell for a very long time.",
        "source": "T01n0023_002:0284a22_8"
    },
    {
        "source_sentence": "已後乃從一銅釜泥犁中出，便走欲求解脫。",
        "translation": "After that, he emerged from the mud plow of a copper cauldron and ran away in order to seek liberation.",
        "source": "T01n0023_002:0284a24_9"
    },
    {
        "source_sentence": "「有泥犁名多銅釜，縱廣二萬里悉入中，泥犁旁便各各舉其身手足著釜中，",
        "translation": "There was a mud plow called “many copper pots” twenty thousand li in length and thirty thousand li in width, which all entered the furnace. Beside the mud plow they each put their bodies, hands, feet, and hands into it.",
        "source": "T01n0023_002:0284a25_10"
    },
    {
        "source_sentence": "湯沸踊躍，展轉在底在上，頭面手足皆見熟爛，泥犁旁便以矛[打-丁+鳥]罪人，",
        "translation": "The water boiled and jumped forth, rising up to the bottom. The sinners’ heads, faces, hands, and feet all looked as if they were cooked. Beside the mud plow was a spear that struck the sinners.",
        "source": "T01n0023_002:0284a27_11"
    },
    {
        "source_sentence": "持著餘釜中見煮亦如是，毒痛不可忍，過惡未解故不死，在其中甚長久，",
        "translation": "So it is when one holds and cooks in another cauldron. The pain of the poisonous poison cannot be tolerated, and because they are not yet liberated from their evil deeds they do not die. They remain in this cauldron for a very long time.",
        "source": "T01n0023_002:0284a29_12"
    },
    {
        "source_sentence": "已後乃從多銅釜泥犁中出，便走欲求解脫。",
        "translation": "After that, he emerged from the mud plow of many copper cauldrons and ran away in order to seek liberation.",
        "source": "T01n0023_002:0284b01_13"
    },
    {
        "source_sentence": "「有泥犁名磨，縱廣二萬里悉入其中，泥犁旁便各各取人，著鐵磨上臥，",
        "translation": "“There’s a mud plow called grinding, twenty thousand li in length and width that all enters into it. At the side of each mud plow there are two kinds of people:",
        "source": "T01n0023_002:0284b02_14"
    },
    {
        "source_sentence": "以蓋覆，便捉磨使碎，血肉流下，骨留在磨，中火出燒，炙毒痛不可忍，",
        "translation": "They cover it with a canopy and crush it into bits of flesh and blood. The bones are left to be crushed, and the fire that burns them in the midst of it causes unbearable pain and suffering.",
        "source": "T01n0023_002:0284b04_15"
    },
    {
        "source_sentence": "過惡未解故不死，用是故在其中甚長久，已後乃從鐵磨泥犁中出，便走欲求解脫。",
        "translation": "Because their faults and evils haven't been untied, they won't die; it's because of this that they stay there for a long time. After that, they emerge from the iron-ground plow and run away to seek liberation.",
        "source": "T01n0023_002:0284b06_0"
    },
    {
        "source_sentence": "「有泥犁名膿血，縱廣二萬里，人悉入其中，即自然有膿血火焰出，人以手足把歷欲出，",
        "translation": "“There is a mud plow called pus and blood, twenty thousand li in length and breadth. All the people who enter into it naturally produce pus and blood as flames of fire.",
        "source": "T01n0023_002:0284b07_1"
    },
    {
        "source_sentence": "頭面耳鼻身體手足皆燋，便自以手取膿血食之，脣舌咽皆燋，腹中腸胃五臟皆燋，",
        "translation": "Their heads, faces, ears, nose, bodies, hands, feet, and nails are all gross, so they take the pus and blood with their own hands and eat it. Their lips, tongue, and throat are all gross, and everything in their belly, intestines, stomach, and five internal organs are all gross.",
        "source": "T01n0023_002:0284b09_2"
    },
    {
        "source_sentence": "便下過去，毒痛不可忍，過惡未解故不死，在其中甚長久，已後乃從膿血泥犁中出，",
        "translation": "So they came down and passed away, suffering unbearably from the pain of the poison. Because their faults were not yet resolved they did not die. After remaining there for a very long time, they emerged from the plow drawn with pus, blood, and mud.",
        "source": "T01n0023_002:0284b11_3"
    },
    {
        "source_sentence": "便走欲求解脫。",
        "translation": "He then ran away in order to seek liberation.",
        "source": "T01n0023_002:0284b13_4"
    },
    {
        "source_sentence": "「有泥犁名高峻，縱廣二萬里，人悉入其中，泥犁火焰出，泥犁旁即走人上下山，",
        "translation": "“There is a mud plow called Vaiśravaṇa, twenty thousand li in length and thirty thousand li in width. All the people walk up and down the mountain beside it.",
        "source": "T01n0023_002:0284b14_0"
    },
    {
        "source_sentence": "頭面耳鼻身體手足皆燋爛，毒痛不可忍，過惡未解故不死，在其中甚長久，",
        "translation": "Their heads, faces, ears, nose, bodies, hands, and feet are all scorched and burned away. The pain of the poison cannot be tolerated. Because their faults have not been resolved, they do not die. They remain in this hell for a long time.",
        "source": "T01n0023_002:0284b15_1"
    },
    {
        "source_sentence": "已後乃從高峻泥犁中出，便走欲求解脫。",
        "translation": "After that, he emerged from the high mud plow and ran away in order to seek liberation.",
        "source": "T01n0023_002:0284b17_2"
    },
    {
        "source_sentence": "「有泥犁名斫板，縱廣二萬里，人悉入中，泥犁旁便各各取人，撲燒鐵地，",
        "translation": "“There is a mud plow called the hollow plank, twenty thousand li in length and thirty thousand li in width. All the people enter into it. At the side of each mud plow they pick up their own hands and throw them down on an iron ground.",
        "source": "T01n0023_002:0284b18_3"
    },
    {
        "source_sentence": "以鐵繩量度其身，以兩手持斧，斫削身及頭面手足鼻耳，毒痛不可忍，",
        "translation": "He measures his body with an iron rope, carries an axe in both hands, and cuts off his body, head, face, hands, feet, nose, and ears. The pain of the poison cannot be endured.",
        "source": "T01n0023_002:0284b20_4"
    },
    {
        "source_sentence": "過惡未解故不死，在其中甚長久，已後乃從斫板泥犁中出，便走欲求解脫。",
        "translation": "Because their faults and evils haven't been untied, they won't die; they stay there for a very long time. After that, they emerge from the mud plow of coarse boards and then run away to seek liberation.",
        "source": "T01n0023_002:0284b21_5"
    },
    {
        "source_sentence": "「有泥犁名斛，縱廣二萬里，人悉入其中，泥犁旁即取炭火中人，使著斛中量，",
        "translation": "“There is a mud plow called ‘hu’ twenty thousand li in length and width. All the people enter into it. Beside the mud plow, they take the coal from the ground and burn it to make it weigh as much as one hu [to be transported].",
        "source": "T01n0023_002:0284b23_6"
    },
    {
        "source_sentence": "以手摩上，頭面身體手足鼻耳皆燋爛，泥犁旁走人火上，往還燒炙，毒痛不可忍，",
        "translation": "Their heads, bodies, hands, feet, noses, and ears are all burned away. Someone walking beside a mud plow is thrown back and forth into the fire and burned to death in unbearable pain.",
        "source": "T01n0023_002:0284b25_7"
    },
    {
        "source_sentence": "過惡未解故不死，在其中甚長久，已後乃從斛泥犁中出，便走欲求解脫。",
        "translation": "Because their faults and evils haven't been untied, they won't die; they stay there for a long time. After that, they emerge from the tub of clay plow and run away to seek liberation.",
        "source": "T01n0023_002:0284b27_8"
    },
    {
        "source_sentence": "「有泥犁名劍樹葉，縱廣二萬里，人悉入其中，風生吹鐵劍樹葉墮，落截人手足頭面耳鼻身體，",
        "translation": "“There’s a mud plow called Sword-tree Leaf, twenty thousand li in length and thirty thousand li in width. When people enter it, the iron sword- tree leaves blown by wind fall off, cutting off their hands, feet, heads, faces, ears, nose, and body.",
        "source": "T01n0023_002:0284b28_9"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未解故不死，在其中甚長久，已後乃從鐵劍樹泥犁中出，",
        "translation": "The poison and pain they experience cannot be tolerated. They are not allowed to die until their offenses have been expiated. After remaining in this hell for a very long time, they emerge from the iron sword-like tree or mud plow.",
        "source": "T01n0023_002:0284c01_10"
    },
    {
        "source_sentence": "便走欲求解脫。",
        "translation": "He then ran away in order to seek liberation.",
        "source": "T01n0023_002:0284c03_11"
    },
    {
        "source_sentence": "「有泥犁名撓撈河，縱廣二萬里，河兩邊生剃頭刀草，人悉入其中，刀逆刺人，",
        "translation": "“There’s a mud plow called ‘dragging up the river.’ Twenty thousand li in length and breadth, shaving one’s hair with a sword and blade grows on both banks of the river. All the people enter it, but the sword pierces them directly.",
        "source": "T01n0023_002:0284c03_12"
    },
    {
        "source_sentence": "斷人手足頭面鼻耳身體，毒痛不可忍。",
        "translation": "Their hands, feet, heads, faces, noses, ears, and bodies are cut off, and the pain of poison cannot be tolerated.",
        "source": "T01n0023_002:0284c05_13"
    },
    {
        "source_sentence": "「爾時，人皆墮撓撈河，湯沸涌躍，下底有八寸蒺[卄\\/梨]刺，刺人身血流灑，",
        "translation": "At that time, the people all fell down and drew water from the river. Boiling water bubbled high and jumped up and down in uncooked water. On the bottom of the stream was an eight-inch thick thorn, which pierced their bodies and dropped blood onto them.",
        "source": "T01n0023_002:0284c07_0"
    },
    {
        "source_sentence": "但有其骨，便沸涌躍轉上人，毒痛不可忍，風吹至岸邊草，刀逆向內，",
        "translation": "But if someone has a bone, they'll boil and jump up and down. The poisonous pain won't be tolerable, and the wind blows into the grass at the edge of the shore, with its sword pointing inward.",
        "source": "T01n0023_002:0284c08_1"
    },
    {
        "source_sentence": "截人頭面耳鼻身體手足，毒痛不可忍，過惡未解故不死，泥犁旁即問人言：『欲求何等。』",
        "translation": "He cuts off the head, face, ears, nose, body, hands, and feet of a person whose venomous pain can't be tolerated, and he doesn't die because his past evil hasn't been untied. Beside the mud plow, he asks someone, 'What do you want?'",
        "source": "T01n0023_002:0284c10_2"
    },
    {
        "source_sentence": "報言：『我但苦飢渴！』",
        "translation": "They replied, 'I'm only suffering from hunger and thirst!'",
        "source": "T01n0023_002:0284c12_3"
    },
    {
        "source_sentence": "泥犁旁便各各取人撲著燒熱地，以消銅灌人口中，脣舌咽喉皆燋，身體五臟腸胃皆燋，",
        "translation": "Beside the mud plow, they each took a man and pushed him into a scorching hot place. He poured molten copper into the living beings’ mouths to extinguish the heat. Their lips, tongues, throats, and throats were all scorched; their bodies, five internal organs, intestines, stomach, and stomach were all scorched.",
        "source": "T01n0023_002:0284c12_4"
    },
    {
        "source_sentence": "便下過去，毒痛不可忍，過惡未解故不死。",
        "translation": "He then went down and passed away, suffering unbearably from the poison and pain, and he didn't die because his faults hadn't been resolved.",
        "source": "T01n0023_002:0284c14_5"
    },
    {
        "source_sentence": "河兩邊有鐵樹，泥犁旁便取人舉著鐵樹下，樹生刺刺下垂，刺人身體，",
        "translation": "On both banks of the river there are iron trees. Next to the plows drawn by the mud, they pick up the dead bodies and place them under an iron tree. The thorns grow on top of the trees and hang down their branches, which pierce the bodies of those beings.",
        "source": "T01n0023_002:0284c15_6"
    },
    {
        "source_sentence": "血肉流墮，餘但有骨，風起吹人身體，平復如故；",
        "translation": "The blood and flesh flowed down but the rest had bones. When the wind rose and blew the body of the man was restored to its original form.",
        "source": "T01n0023_002:0284c17_7"
    },
    {
        "source_sentence": "有鳥名鐵烏喙，啄其頭噉其腦，在頭上住，啄取人瞳子，人欲下鐵刺向仰刺人，",
        "translation": "There's a bird named the iron crow beak that pecks at its head and pierces its brain, standing on top of it. It pecks to get people's pupils, and when they want to put down an iron thorn, it spits upward and strikes them.",
        "source": "T01n0023_002:0284c18_8"
    },
    {
        "source_sentence": "欲上向下刺人。",
        "translation": "They want to go upward, face downward, and stab people.",
        "source": "T01n0023_002:0284c20_9"
    },
    {
        "source_sentence": "爾時人走行欲求解脫，還墮撓撈河中，湯沸涌躍墮底，為蒺[卄\\/梨]所刺如故，",
        "translation": "At that time the people, wanting to seek liberation, ran back and fell into the river. The water boiled and jumped up and down to the bottom but they were still pierced by the current as before.",
        "source": "T01n0023_002:0284c20_10"
    },
    {
        "source_sentence": "上堓浮風吹堓邊，刀逆截傷人頭面耳鼻身體手足，毒痛不可忍，過惡未解故不死，",
        "translation": "When the wind blows at the edge of the river, a sharp sword goes up and cuts their heads, faces, ears, nose, bodies, hands, and feet. The pain is unbearable; they do not die until they have overcome evil and are freed from it.",
        "source": "T01n0023_002:0284c22_11"
    },
    {
        "source_sentence": "樹泥犁旁問言：『欲求何等？』",
        "translation": "Beside the tree and mud plow, he asked, 'What do you want?'",
        "source": "T01n0023_002:0284c24_12"
    },
    {
        "source_sentence": "言：『我但苦飢渴！』",
        "translation": "They say, 'I'm only suffering from hunger and thirst!'",
        "source": "T01n0023_002:0284c24_13"
    },
    {
        "source_sentence": "便持消銅灌口中，脣舌咽喉腸胃皆，燋爛，便下過去。",
        "translation": "He then poured the cessation copper into his mouth, and his lips, tongue, throat, intestines, and stomach were all scorched and rotten, so he went down and passed away.",
        "source": "T01n0023_002:0284c25_14"
    },
    {
        "source_sentence": "上堓邊，泥犁旁復著堓邊樹上，欲下上刀逆刺人；",
        "translation": "On the side of the upper part of the carriage, next to the mud plow, he puts his sword on a tree at the edge of the carriage and intends to draw down another sword in order to pierce the man.",
        "source": "T01n0023_002:0285a01_15"
    },
    {
        "source_sentence": "有鳥名那尼喙，啄人頭噉其腦，在人頭上啄人瞳子，欲上下刺逆向刺人，",
        "translation": "There's a bird named Nāgârjuna beak that pecks at people's heads and pierces their brains. On top of someone's head, it pecks at their pupils, wanting to spit up and down and twirl back and forth against them.",
        "source": "T01n0023_002:0285a02_16"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未盡故不死。",
        "translation": "The pain and suffering of the poison cannot be tolerated, and they won't die until their past evil has ended.",
        "source": "T01n0023_002:0285a04_17"
    },
    {
        "source_sentence": "復還墮撓撈河，在中毒痛如故，風復吹至堓邊，草刀逆刺剝人如故，泥犁旁復問人言：『欲求何等。』",
        "translation": "Again, he fell back into the river and was as painful as before. The wind blew up to the edge of the pond, drew a blade of grass against him, and stripped him away as before. Beside the mud plow, he asked the man again, 'What do you want?'",
        "source": "T01n0023_002:0285a04_18"
    },
    {
        "source_sentence": "報言：『但苦飢渴！』",
        "translation": "They replied, 'It's just suffering hunger and thirst!'",
        "source": "T01n0023_002:0285a07_19"
    },
    {
        "source_sentence": "以其消銅灌其口中如故，燒炙毒痛不可忍，在其中甚長久，已後乃從撓撈河得出，",
        "translation": "He poured the molten copper into his mouth as before and burned it, inflicting unbearable pain and suffering. After remaining there for a very long time, he came out of the Nimindhara and escaped from the river.",
        "source": "T01n0023_002:0285a07_20"
    },
    {
        "source_sentence": "便走欲求解脫。",
        "translation": "He then ran away in order to seek liberation.",
        "source": "T01n0023_002:0285a09_21"
    },
    {
        "source_sentence": "「有泥犁名狼野干，縱廣二萬里，人悉入其中，狼野干自然在前住，身中出火焰，",
        "translation": "“There’s a mud plow called the wolf-grasping, twenty thousand li in length and thirty thousand li in width, where people enter. The wolf-grasping will naturally stand in front of them, and fire blazes forth from their bodies.",
        "source": "T01n0023_002:0285a09_22"
    },
    {
        "source_sentence": "所齧人身肉，應其口而食之，毒痛不可忍，飛鳥共來，啄噉人者，脫人眼者，",
        "translation": "They feed on the flesh and blood of those beings who eat it, eating it according to their mouths. The poison and pain they experience cannot be tolerated.",
        "source": "T01n0023_002:0285a11_23"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未盡故不死，在其中甚長久，已後乃從狼野干泥犁得出，",
        "translation": "The pain of the poison cannot be tolerated. They do not die until all their evil deeds have been done, and after remaining in this hell for a very long time, they emerge from the wilderness of the wolf’s rebirth by drying up the mud plow.",
        "source": "T01n0023_002:0285a13_24"
    },
    {
        "source_sentence": "便走欲求解脫。",
        "translation": "He then ran away in order to seek liberation.",
        "source": "T01n0023_002:0285a15_0"
    },
    {
        "source_sentence": "「有泥犁名寒氷，縱廣二萬里，人悉入其中，風周匝四面起寒冷，吹人身肌膚皮肉筋骨入髓中，",
        "translation": "Again, there is a holy hell called Cold Ice, twenty thousand li in length and width, where the wind blows on all four sides to produce cold air. The skin, flesh, tendons, bones, and marrow of the human body are blown into it.",
        "source": "T01n0023_002:0285a15_1"
    },
    {
        "source_sentence": "用是故便於中死。」",
        "translation": "Because of this, they'll die in it.",
        "source": "T01n0023_002:0285a17_2"
    },
    {
        "source_sentence": "佛言：「何以故名為黑耳泥犁？",
        "translation": "The Buddha said, Why is it called the black-eared mud plow?",
        "source": "T01n0023_002:0285a18_0"
    },
    {
        "source_sentence": "若有人墮黑耳泥犁中者，黑風熱沙，雨其身上，即隨墮地，焦皮肌膚骨肉脂髓，",
        "translation": "If someone falls into a black-eared mud plow, the black wind blows and hot sand rain pours down on their bodies, and they fall to the ground along with it, scorching skin, soaking flesh, fat, and marrow.",
        "source": "T01n0023_002:0285a18_1"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未盡故不死，用是故名為黑耳。",
        "translation": "The poisonous pain is unbearable, and they won't die because their past evil hasn't ended; this is why they're called black ears.",
        "source": "T01n0023_002:0285a20_2"
    },
    {
        "source_sentence": "復有餘因緣，復次，黑耳大泥犁，其有人墮中者，以燒鐵黑索縛其身，",
        "translation": "“Furthermore, there are other reasons. Again, if a black-eared plow is big like a great mud plow, and someone falls into it, they’ll be bound by an iron or black thread that burns their bodies.",
        "source": "T01n0023_002:0285a21_3"
    },
    {
        "source_sentence": "風便勒結之，斷其身皮肌膚，破骨出髓，毒痛不可忍，過惡未盡故不死，",
        "translation": "When the wind blows, they cut off the skin and flesh on their bodies, breaking open the bones and discharging the marrow. The pain of the poison cannot be endured. They are not allowed to die until all their evil has been done.",
        "source": "T01n0023_002:0285a23_4"
    },
    {
        "source_sentence": "用是故名黑耳。",
        "translation": "Because of this function, it's called black ear.",
        "source": "T01n0023_002:0285a24_5"
    },
    {
        "source_sentence": "復次有因緣，墮其黑耳大泥犁中者，泥犁旁以黑鐵燒熱繩，纏裹人身，",
        "translation": "“Furthermore, if someone has a reason to fall into the black-eared great mud plow and wraps his body around a hot rope of black iron beside the mud plow.",
        "source": "T01n0023_002:0285a25_6"
    },
    {
        "source_sentence": "焦皮肉肌膚骨髓，毒痛不可忍，過惡未盡故不死，用是故名為黑耳。",
        "translation": "Their charred skin, flesh, emaciated bones, and marrow are painful and unbearable, and they won't die until their past evil has ended; therefore, it's called black ear.",
        "source": "T01n0023_002:0285a26_7"
    },
    {
        "source_sentence": "復次，其有人入大黑耳，泥犁旁以鐵繩，左右絞其人身，以鋸截之，以斧斷之，",
        "translation": "“Furthermore, suppose there is another man who enters the great black-eared hell. At the side of a mud plow he wraps his body around an iron rope and cuts it off with a saw or axe.",
        "source": "T01n0023_002:0285a28_8"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未盡故不死，用是故名為黑耳。",
        "translation": "The poisonous pain is unbearable, and they won't die because their past evil hasn't ended; this is why they're called black ears.",
        "source": "T01n0023_002:0285b01_0"
    },
    {
        "source_sentence": "復次，人在其中甚長久，燒炙毒痛，乃從黑耳泥犁中出，便走欲求解脫。",
        "translation": "Again, for a very long time the people in these hells are burned and tortured with venomous pain. Then they emerge from the black-eared mud plow and run away to seek liberation.",
        "source": "T01n0023_002:0285b02_1"
    },
    {
        "source_sentence": "「有泥犁名黑火，縱廣二萬里，人悉入中，黑火從當身出，繞身三匝還入身，",
        "translation": "“There’s a mud plow called Black Fire, twenty thousand li long and wide, in which all the people enter. The black fire emerges from their respective bodies, circumambulates them three times, and returns back into their bodies.",
        "source": "T01n0023_002:0285b03_2"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未盡故不死，在泥犁中甚長久，乃從黑火泥犁中出，",
        "translation": "The poison and pain they experience cannot be tolerated. They do not die until the exhaustion of their past evil deeds. After remaining in the mud plow for a long time, they emerge from the black-hot clay plow.",
        "source": "T01n0023_002:0285b05_3"
    },
    {
        "source_sentence": "隨次入如前十六泥犁，至寒氷泥犁乃命過。」",
        "translation": "He enters the sixteen mud plows in order as before, and when he reaches the cold ice-mud plow, his life passes away.",
        "source": "T01n0023_002:0285b07_4"
    },
    {
        "source_sentence": "佛言：「何以故名為僧乾泥犁？",
        "translation": "The Buddha said, Why is it called the saṃgha's dry mud plow?",
        "source": "T01n0023_002:0285b08_5"
    },
    {
        "source_sentence": "其有人墮僧乾大泥犁中者，自然兩鐵山出火，火山合拍泥犁中人，破碎其身，",
        "translation": "If someone falls into the great mud plow of Saṃghârāmaṅga, they'll naturally emerge from two iron mountains and fire will rise out of their bodies, and the people in the mud plow will be crushed by a conflagration.",
        "source": "T01n0023_002:0285b08_6"
    },
    {
        "source_sentence": "毒痛不可忍，過惡未盡故不死，是故名為僧乾。",
        "translation": "The poisonous pain is unbearable, and he won't die because his past evil hasn't ended; therefore, it's called dryness of the saṃgha.",
        "source": "T01n0023_002:0285b10_7"
    },
    {
        "source_sentence": "復有餘因緣，復次，若有人墮僧乾大泥犁中者，人悉入其中，有兩山相拍，",
        "translation": "Again, if a man were to fall into the great mud plow of Saṃghârāmaṇetra, all the people would enter it; and two mountains would beat against each other.",
        "source": "T01n0023_002:0285b11_8"
    },
    {
        "source_sentence": "罪人身皆破碎解墮，毒痛不可忍，過惡未盡故不死，是故名為僧乾。",
        "translation": "The sinners' bodies are all broken and disintegrated, painful and unbearable, and they won't die until their faults and evils have ended.",
        "source": "T01n0023_002:0285b13_9"
    },
    {
        "source_sentence": "復有餘因緣。",
        "translation": "Again, there are other causes and conditions.",
        "source": "T01n0023_002:0285b14_10"
    },
    {
        "source_sentence": "人在其中甚長久，乃從大僧乾泥犁中出，便走欲求解脫。",
        "translation": "After a very long time, the man emerged from the great monk's dry mud plow and ran away to seek liberation.",
        "source": "T01n0023_002:0285b15_11"
    },
    {
        "source_sentence": "復次，入十六泥犁如前，復至寒氷泥犁乃命過。」",
        "translation": "Furthermore, he enters the sixteen mud plows as before and goes back to the cold ice mud plow where his life is over.",
        "source": "T01n0023_002:0285b16_12"
    },
    {
        "source_sentence": "佛言：「何以故名樓獵泥犁？",
        "translation": "The Buddha said, Why is it called the Loutan niraya?",
        "source": "T01n0023_002:0285b17_13"
    },
    {
        "source_sentence": "其有人墮樓獵中者，泥犁旁各各取人著鐵銚中，人大喚呼，大毒大痛，",
        "translation": "If someone falls into the middle of a hunting tower, they'll each take a man in an iron pickup at the side of a mud plow and shout out loudly, causing great poison and pain.",
        "source": "T01n0023_002:0285b18_14"
    },
    {
        "source_sentence": "是故名為樓獵。",
        "translation": "That's why it's called a lotus hunt.",
        "source": "T01n0023_002:0285b19_15"
    },
    {
        "source_sentence": "復次，有罪人墮樓獵泥犁中者，泥犁旁取人著鐵鼎中，大毒大痛噭喚，",
        "translation": "Again, if a sinner falls into a mud plow that's hunting in a tower and takes a man beside the mud plow and puts him in an iron tripod, he'll experience great pain and scream.",
        "source": "T01n0023_002:0285b20_16"
    },
    {
        "source_sentence": "是故名為樓獵。",
        "translation": "That's why it's called a lotus hunt.",
        "source": "T01n0023_002:0285b21_17"
    },
    {
        "source_sentence": "復次，其有罪人墮樓獵泥犁中者，泥犁旁各各取之著鐵釜中，大毒大痛噭喚，",
        "translation": "Furthermore, if there are sinners who fall into the mud plow of a tower hunter, they'll each take it from the side of the mud plow and put it in an iron cauldron, which is so poisonous and painful that it screams.",
        "source": "T01n0023_002:0285b22_18"
    },
    {
        "source_sentence": "是故名為樓獵。",
        "translation": "That's why it's called a lotus hunt.",
        "source": "T01n0023_002:0285b24_0"
    },
    {
        "source_sentence": "復有餘因緣。",
        "translation": "Again, there are other causes and conditions.",
        "source": "T01n0023_002:0285b24_1"
    },
    {
        "source_sentence": "罪人在其中甚長久，乃從樓獵泥犁中出，便走欲求解脫，復隨次入十六泥犁如前，",
        "translation": "For a very long time the malefactors emerged from their lords’ hunting mud plows. They ran away in order to seek liberation, but again they entered sixteen hells one after another, just as before.",
        "source": "T01n0023_002:0285b24_2"
    },
    {
        "source_sentence": "至寒氷泥犁乃命過。」",
        "translation": "When it reaches cold ice and mud plows, then his life is over.",
        "source": "T01n0023_002:0285b26_3"
    },
    {
        "source_sentence": "佛言：「何以故名為大噭喚？",
        "translation": "The Buddha said, Why is it called a great wailing?",
        "source": "T01n0023_002:0285b28_0"
    },
    {
        "source_sentence": "其有人墮大噭喚泥犁中者，泥犁旁各各取其人身，著大銚中煮，極毒痛大噭喚，",
        "translation": "If someone falls into a great wailing mud plow, they'll each take their bodies to the side of the mud plow and put them in a large mortar to cook, which will cause extreme pain and trembling.",
        "source": "T01n0023_002:0285b28_1"
    },
    {
        "source_sentence": "是故名為大噭喚。",
        "translation": "That's why it's called a great wailing.",
        "source": "T01n0023_002:0285c01_2"
    },
    {
        "source_sentence": "復有餘因緣，其有罪人，墮大噭喚泥犁中者，泥犁旁各各取其人身，著大釜中，",
        "translation": "Again, there are other reasons why some of the sinners fall into a large mud plow that screams loudly. Each side of the mud plow takes their own bodies and puts them in a large pot.",
        "source": "T01n0023_002:0285c02_3"
    },
    {
        "source_sentence": "甚毒痛大噭喚。",
        "translation": "It's very painful and greatly distressing, and it's called out.",
        "source": "T01n0023_002:0285c03_4"
    },
    {
        "source_sentence": "復有餘因緣，其人墮大噭喚泥犁中者，泥犁旁各各取人，著鼎鑊中煮，",
        "translation": "Again, there are other causes and conditions that cause those who fall into the great wailing mud plow to take a human being from each side of the mud plow and place it in a cauldron or cauldron.",
        "source": "T01n0023_002:0285c04_5"
    },
    {
        "source_sentence": "甚毒痛大噭喚。",
        "translation": "It's very painful and greatly distressing, and it's called out.",
        "source": "T01n0023_002:0285c05_6"
    },
    {
        "source_sentence": "是故在其中甚長久，乃從大噭喚泥犁中出，便走欲求解脫，隨次入十六泥犁如前，",
        "translation": "Having remained there for a very long time, they emerged from the great holy hell and came out of the mud plow. They ran away to seek liberation but entered sixteen different kinds of mud plows one after another as before.",
        "source": "T01n0023_002:0285c06_7"
    },
    {
        "source_sentence": "至寒氷乃死。」",
        "translation": "When it reaches cold ice, he dies.",
        "source": "T01n0023_002:0285c08_8"
    },
    {
        "source_sentence": "佛言：「何以故名為燒炙？",
        "translation": "The Buddha said, Why is it called burned?",
        "source": "T01n0023_002:0285c08_9"
    },
    {
        "source_sentence": "其有罪人墮大燒炙泥犁中者，泥犁旁各各取人，著鐵舍中，自然出火燒炙毒痛，",
        "translation": "If there are sinners who fall into a great blazing mud plow, they'll each take a man beside the mud plow and put him in an iron dwelling, and he'll naturally experience the pain of being burned by fire.",
        "source": "T01n0023_002:0285c09_0"
    },
    {
        "source_sentence": "是故名為燒炙。",
        "translation": "Therefore, it's called burning and scorching.",
        "source": "T01n0023_002:0285c10_1"
    },
    {
        "source_sentence": "復次，其有罪人，墮大泥犁燒炙中者，泥犁旁牽人入鐵交露中，自然有火，",
        "translation": "Again, if a sinner falls into the great mud plow and is burned in it, dragged alongside the mud plow to an exposed place made of iron, there will naturally be fire.",
        "source": "T01n0023_002:0285c11_2"
    },
    {
        "source_sentence": "燒炙毒痛，是故名為燒炙，過惡未盡故不死。",
        "translation": "Because of the venomous pain of burning and scorching, it's therefore called burning and scorching.",
        "source": "T01n0023_002:0285c12_3"
    },
    {
        "source_sentence": "復次，其有罪人墮大燒炙泥犁中者，泥犁旁牽人入鐵堂上，自然有火，",
        "translation": "Again, if a sinner falls into a great tormented mud plow and drags him to an iron chamber beside the mud plow, there will naturally be fire.",
        "source": "T01n0023_002:0285c13_4"
    },
    {
        "source_sentence": "燒炙毒痛，是故名為燒炙。",
        "translation": "It's called burning because of the poisonous pain of burning.",
        "source": "T01n0023_002:0285c15_5"
    },
    {
        "source_sentence": "罪人在其中甚長久，乃從燒炙泥犁中出，便走欲求解脫，隨次入十六泥犁如前，",
        "translation": "For a very long time, the sinners emerged from their burning mud plows and ran away in order to seek liberation. They entered sixteen hells one after another, as before.",
        "source": "T01n0023_002:0285c16_6"
    },
    {
        "source_sentence": "至寒氷泥犁命過死。」",
        "translation": "Up to the cold ice and mud plow, his life is overdue death.",
        "source": "T01n0023_002:0285c17_7"
    },
    {
        "source_sentence": "佛言：「何以故名為阿鼻摩訶？",
        "translation": "The Buddha said, Why is it called avīci-mahā?",
        "source": "T01n0023_002:0285c19_0"
    },
    {
        "source_sentence": "其有罪人，墮阿鼻摩訶泥犁中者，眼但見惡色不見善色，耳但聞惡聲不聞善聲，",
        "translation": "If there are sinners who fall into the avīci-mahānīya, their eyes only see bad form and don't see good form, and their ears only hear bad sounds and don't hear good sounds.",
        "source": "T01n0023_002:0285c19_1"
    },
    {
        "source_sentence": "口所食但得惡味不得甘美，鼻所聞臭不聞好香，身所更但得惡意，所念法但有惡無善，",
        "translation": "What they eat in their mouths only gets bad flavors and no sweetness, what they smell in their noses they don't smell good odors, what they do in their bodies they only get bad thoughts, and the things they think of are only bad and not good.",
        "source": "T01n0023_002:0285c21_2"
    },
    {
        "source_sentence": "是故名為阿鼻摩訶。",
        "translation": "Therefore, it's called abhidharma-mahā.",
        "source": "T01n0023_002:0285c23_3"
    },
    {
        "source_sentence": "復有餘因緣，有罪人墮阿鼻摩訶泥犁中者，東壁火焰至西壁，西壁火焰至東壁，",
        "translation": "Again, there are other reasons why if a sinner falls into an avīci-mahānīya, the flame of the fire on the eastern wall reaches the western wall, and the flame of the fire on the western wall reaches the eastern wall.",
        "source": "T01n0023_002:0285c24_0"
    },
    {
        "source_sentence": "南壁火焰至北壁，北壁火焰至南壁，上火焰下至地，地火焰上至上，六面火來，",
        "translation": "A flame from the south wall reaches the north wall, a flame from the north wall reaches the south wall, a flame from the upper wall reaches the ground, a flame from the earth flame reaches upward, and a flame from the six sides of the fire.",
        "source": "T01n0023_002:0285c25_1"
    },
    {
        "source_sentence": "燒炙人毒痛，是故名為阿鼻摩訶。",
        "translation": "It burns and scorches people with venomous pain; therefore, it's called avīci-mahā.",
        "source": "T01n0023_002:0285c27_2"
    },
    {
        "source_sentence": "復次，其罪人墮阿鼻摩訶泥犁中者，彈指頃無有樂，是故名為阿鼻摩訶。",
        "translation": "Furthermore, when that offender falls into the avīci-mahānīya, there's no pleasure for as long as he snaps his fingers; therefore, it's called an avīci-mahā.",
        "source": "T01n0023_002:0285c28_3"
    },
    {
        "source_sentence": "罪人在其中甚長久，乃從阿鼻摩訶泥犁中出，便走欲求解脫，隨次入十六泥犁如前，",
        "translation": "For a very long time the sinners emerged from the avīci-mahānīya and ran away to seek liberation. They entered sixteen hells one after another, just as before.",
        "source": "T01n0023_002:0286a01_4"
    },
    {
        "source_sentence": "至寒氷泥犁乃死。」",
        "translation": "When it reaches cold ice and mud plows, he dies.",
        "source": "T01n0023_002:0286a03_5"
    },
    {
        "source_sentence": "佛言：「大鐵圍山外，閻浮利天下南，有閻羅王城，縱廣二十四萬里，",
        "translation": "The Buddha said: Beyond the great ring of iron mountains to the south of Jambudvīpa is the royal city of Yama, twenty-four thousand li in length and width.",
        "source": "T01n0023_002:0286a04_0"
    },
    {
        "source_sentence": "以七寶作七重壁，七重欄楯，七重刀分，七重行樹，園觀浴池，周匝圍繞，",
        "translation": "They built seven walls made of the seven kinds of treasure, embellished with seven railings, seven pairs of swords, and seven lines of trees. The park was surrounded by bathing ponds and pleasure gardens.",
        "source": "T01n0023_002:0286a05_1"
    },
    {
        "source_sentence": "金壁銀門，銀壁金門，琉璃壁水精門，水精壁琉璃門，赤真珠壁馬瑙門，",
        "translation": "The golden wall is endowed with silver gates, the silver wall with golden gates, the lapis wall with lapis gates, the quartz gate with lapis gates, and the ruby wall with agate gates.",
        "source": "T01n0023_002:0286a07_2"
    },
    {
        "source_sentence": "馬瑙壁赤真珠門，車璩壁一切寶門，上有曲箱蓋交露，下有園觀浴池，",
        "translation": "The agate wall is decorated with red genuine pearls, the chariot wall with all kinds of precious doors. Above it are covered with fold-up boxes and canopies, while below it there is a bathing pond or pleasure garden.",
        "source": "T01n0023_002:0286a08_3"
    },
    {
        "source_sentence": "有種種樹葉花實，出種種香，種種飛鳥，相和而鳴。」",
        "translation": "There are various kinds of trees, leaves, flowers, fruits, various fragrances, and flying birds that sing in harmony with each other.",
        "source": "T01n0023_002:0286a10_4"
    },
    {
        "source_sentence": "佛言：「人身行惡口言惡心念惡，死後墮此閻羅王泥犁中者，泥犁旁便反縛罪人，",
        "translation": "The Buddha said, A person who commits evil in body, speech, and thoughts will fall into this hell-king's mud plow after death, and the sinner will be bound by the mud plow.",
        "source": "T01n0023_002:0286a11_5"
    },
    {
        "source_sentence": "以見閻羅王，白王言：『此諸人悉不孝於父母，不承事沙門道人，不畏後世禁忌，",
        "translation": "Seeing the king of Yama, he said to the king, “These people are not filial to their parents. They do not serve renunciants and religious practitioners. They do not fear the constraints that will arise in the afterlife.",
        "source": "T01n0023_002:0286a13_6"
    },
    {
        "source_sentence": "願王隨所知而罰之。』",
        "translation": "May the king punish him according to what he knows.'",
        "source": "T01n0023_002:0286a15_7"
    },
    {
        "source_sentence": "王即呼人前，安諦審實，問其人：『汝昔在世間時，不見人年老百二十，",
        "translation": "The king called the man before him and asked him, “In the past you were in the world but did not see people of one hundred and twenty years old.",
        "source": "T01n0023_002:0286a15_8"
    },
    {
        "source_sentence": "頭白齒落，面皺皮緩，氣力衰微，持杖而行，身體戰慄？』",
        "translation": "Their heads are white, their teeth fall off, their faces are wrinkled, their skin is loose, their vitality weakened, they walk with a cane, and their bodies tremble?'",
        "source": "T01n0023_002:0286a17_9"
    },
    {
        "source_sentence": "其人言：『已見。』",
        "translation": "The man said, 'I've seen it.'",
        "source": "T01n0023_002:0286a18_10"
    },
    {
        "source_sentence": "『何以不自念：「我亦當如是老極，無有能脫不老者。」",
        "translation": "Why doesn't he think to himself, 'I will also become so old that there's no one who can be freed and not grow old.'",
        "source": "T01n0023_002:0286a18_11"
    },
    {
        "source_sentence": "何不自改身口意為善？』",
        "translation": "Why don't you change your own body, speech, and thought for good?'",
        "source": "T01n0023_002:0286a19_12"
    },
    {
        "source_sentence": "人對言：『我實婬亂。』",
        "translation": "People say, 'I'm really confused.'",
        "source": "T01n0023_002:0286a20_13"
    },
    {
        "source_sentence": "王言：『今我當便問汝婬亂之意，是過非父母過，亦非兄弟過，亦非天帝王過，",
        "translation": "The king said, ‘Now I will question you about the meaning of this dispute. This is neither a fault nor a fault of my parents, nor a fault of my brothers, nor a fault of the emperor.",
        "source": "T01n0023_002:0286a20_14"
    },
    {
        "source_sentence": "亦非親屬知識過，亦非先祖去人過，亦非沙門婆羅門過。",
        "translation": "Nor is it the fault of a relative or friend, nor the fault of a patriarch leaving someone behind, nor the fault of an ascetic or brāhmaṇa.",
        "source": "T01n0023_002:0286a22_15"
    },
    {
        "source_sentence": "汝作惡，身自當受。』",
        "translation": "You've done evil, and you yourself will experience it.'",
        "source": "T01n0023_002:0286a23_16"
    },
    {
        "source_sentence": "第一閻羅王問，王第二安諦審實問：『汝昔在世間時，為不見人男女病，",
        "translation": "The first king of Yama asked: Did you not see the sicknesses of men, women, and men in the world when you were formerly in the world?",
        "source": "T01n0023_002:0286a24_17"
    },
    {
        "source_sentence": "困劣著床，惡露自出，身臥其上，不能坐起，居人坐起飲食之？』",
        "translation": "A poor man who's stuck on a bed with bad dew coming out of his body and lying down on it can't sit or get up, so why would the inhabitants sit or drink from it?'",
        "source": "T01n0023_002:0286a25_18"
    },
    {
        "source_sentence": "其人對言：『已見。』",
        "translation": "That person replied, 'I've seen it.'",
        "source": "T01n0023_002:0286a27_19"
    },
    {
        "source_sentence": "王言：『汝何以不念：「我亦當如是病瘦。」",
        "translation": "The king said, 'Why don't you think, 'I will also suffer from such illness and thinness.'",
        "source": "T01n0023_002:0286a27_20"
    },
    {
        "source_sentence": "自改身口意為善？』",
        "translation": "Is self-transformation of body, speech, and thought as good?'",
        "source": "T01n0023_002:0286a28_21"
    },
    {
        "source_sentence": "『我實婬亂。』",
        "translation": "'I'm really confused.'",
        "source": "T01n0023_002:0286a28_22"
    },
    {
        "source_sentence": "王言：『今我當便問汝婬亂之意，是過亦非父母過，亦非兄弟過，亦非天帝王過，",
        "translation": "“The king said, ‘Now I will question you about the meaning of this dispute. This is neither a fault committed by my parents nor by my brothers, and neither a fault committed by the ruler of the gods.",
        "source": "T01n0023_002:0286a29_23"
    },
    {
        "source_sentence": "亦非親屬知識過，亦非先祖去人之過，亦非沙門非婆羅門過。",
        "translation": "Nor is it the fault of a relative or friend, nor the fault of a person's ancestor leaving home, nor the fault of an ascetic or a brāhmaṇa.",
        "source": "T01n0023_002:0286b01_24"
    },
    {
        "source_sentence": "汝自作惡，身自當受。』",
        "translation": "You yourself have done evil, and your body will itself experience it.'",
        "source": "T01n0023_002:0286b03_25"
    },
    {
        "source_sentence": "第二閻羅王問，王第三問：『汝昔在世間時，為不見男女死時，身體壞敗，",
        "translation": "The second king of Yama asked, and the third king asked, 'In the past, when you were in the world, why didn't you see men and women die when their bodies disintegrated?",
        "source": "T01n0023_002:0286b03_26"
    },
    {
        "source_sentence": "破碎如林木棄捐，為烏鳥蟲蟻狐狼所食，若有燒者葬埋者？』",
        "translation": "It breaks apart like a forest tree that's discarded, and it's eaten by crows, birds, insects, ants, foxes, and wolves; if someone is burned, they'll be buried.'",
        "source": "T01n0023_002:0286b05_27"
    },
    {
        "source_sentence": "其人對言：『已見。』",
        "translation": "That person replied, 'I've seen it.'",
        "source": "T01n0023_002:0286b06_28"
    },
    {
        "source_sentence": "『汝何以不自念：「我亦當如是死。」",
        "translation": "'Why don't you think to yourself, I will die likewise?'",
        "source": "T01n0023_002:0286b07_29"
    },
    {
        "source_sentence": "當自改身口意為善？』",
        "translation": "Will you change your body, speech, and thought for good?'",
        "source": "T01n0023_002:0286b08_0"
    },
    {
        "source_sentence": "『我實婬亂。』",
        "translation": "'I'm really confused.'",
        "source": "T01n0023_002:0286b08_1"
    },
    {
        "source_sentence": "王言：『我當問汝婬亂之意，是非父母過，亦非兄弟過，亦非天帝王過，",
        "translation": "The king said, ‘I will question you about the meaning of this dispute. It is neither the fault of your parents nor the fault of your brothers; it is not the fault of Emperor Tiandi.",
        "source": "T01n0023_002:0286b08_2"
    },
    {
        "source_sentence": "亦非先祖去人過，亦非親屬知識過，亦非沙門婆羅門過。",
        "translation": "Nor is it the fault of a person's ancestor who goes away, nor is it the fault of a relative or friend, nor is it the fault of an ascetic or brāhmaṇa.",
        "source": "T01n0023_002:0286b10_3"
    },
    {
        "source_sentence": "汝自作惡，身自當受。』",
        "translation": "You yourself have done evil, and your body will itself experience it.'",
        "source": "T01n0023_002:0286b11_4"
    },
    {
        "source_sentence": "第三閻羅王問，閻羅王第四問：『汝昔在世間，為不見小兒無所知屎溺自身？』",
        "translation": "The third king of Yama asks, and the fourth king of Yama asks, 'In the past, did you not see a small child in the world who didn't know that excrement was drowning himself?'",
        "source": "T01n0023_002:0286b12_5"
    },
    {
        "source_sentence": "其人言：『我已見。』",
        "translation": "That person says, 'I've seen it.'",
        "source": "T01n0023_002:0286b13_6"
    },
    {
        "source_sentence": "『何以不自念：「我本亦如是。」",
        "translation": "Why don't you think to yourself, 'So was I in the past?'",
        "source": "T01n0023_002:0286b14_7"
    },
    {
        "source_sentence": "當自改身口意為善？』",
        "translation": "Will you change your body, speech, and thought for good?'",
        "source": "T01n0023_002:0286b14_8"
    },
    {
        "source_sentence": "『我實婬亂。』",
        "translation": "'I'm really confused.'",
        "source": "T01n0023_002:0286b15_9"
    },
    {
        "source_sentence": "王言：『今我當問汝婬亂之意，是過非父母過，亦非兄弟過，亦非天帝王過，",
        "translation": "The king said, 'Now, I will ask you about the meaning of this dispute. It's not a fault of parents, nor a fault of brothers, nor a fault of lord of gods.",
        "source": "T01n0023_002:0286b15_10"
    },
    {
        "source_sentence": "亦非先祖去人過，亦非親屬知識過，亦非沙門婆羅門過。",
        "translation": "Nor is it the fault of a person's ancestor who goes away, nor is it the fault of a relative or friend, nor is it the fault of an ascetic or brāhmaṇa.",
        "source": "T01n0023_002:0286b17_11"
    },
    {
        "source_sentence": "汝自作惡，身自當受。』",
        "translation": "You yourself have done evil, and your body will itself experience it.'",
        "source": "T01n0023_002:0286b18_12"
    },
    {
        "source_sentence": "第四閻羅王問，閻羅王第五安諦審實問：『汝昔在世間時，為不見郡國縣邑得盜賊犯事殺人者以見白王，",
        "translation": "The fourth king of Yama asks, and the fifth king of Yama investigates reality and asks, 'In the past, when you were in the world, why didn't you see the counties, states, prefectures, cities, thieves, criminals, and killers who reported this to the king?",
        "source": "T01n0023_002:0286b19_13"
    },
    {
        "source_sentence": "王勅使四支梟掉之；",
        "translation": "The king ordered the four members of the envoy to be driven away by the owl.",
        "source": "T01n0023_002:0286b21_14"
    },
    {
        "source_sentence": "若著釜中煮，若生燒之；",
        "translation": "If he were to put it in a cauldron and cook it, or if he were to burn it alive.",
        "source": "T01n0023_002:0286b22_0"
    },
    {
        "source_sentence": "若閉著牢獄，掠笞毒痛；",
        "translation": "If one is imprisoned in a prison, the torture of being plundered and beaten will occur.",
        "source": "T01n0023_002:0286b22_1"
    },
    {
        "source_sentence": "若斷手足鼻耳，若生貫之，若斷頭，種種酷毒之？』",
        "translation": "If he cuts off his hands, feet, nose, ears, nose, and nose, or if he rawly penetrates it, or if he cuts off his head, will he be tortured in various ways?'",
        "source": "T01n0023_002:0286b23_2"
    },
    {
        "source_sentence": "其人對言：『已見。』",
        "translation": "That person replied, 'I've seen it.'",
        "source": "T01n0023_002:0286b24_3"
    },
    {
        "source_sentence": "『汝何以不自念：「我若有過，亦當取我如是。」",
        "translation": "'Why don't you think to yourself, 'If there's a mistake in me, I'll take it as well.'",
        "source": "T01n0023_002:0286b24_4"
    },
    {
        "source_sentence": "當改身口意為善？』",
        "translation": "Will you change your body, speech, and thought for good?'",
        "source": "T01n0023_002:0286b25_5"
    },
    {
        "source_sentence": "『我實婬亂。』",
        "translation": "'I'm really confused.'",
        "source": "T01n0023_002:0286b25_6"
    },
    {
        "source_sentence": "『當問汝婬亂之意，是過非父母過，亦非兄弟過，亦非天帝王過，亦非先祖去人過，",
        "translation": "'You should ask, 'What's the meaning of this dispute? It's not a fault of parents, nor a fault of brothers, nor a fault of Indra, nor a fault of ancestors who leave their people.",
        "source": "T01n0023_002:0286b26_7"
    },
    {
        "source_sentence": "亦非親屬知識過，亦非沙門婆羅門過。",
        "translation": "Nor is it the fault of a relative or friend, and nor is it the fault of an ascetic or brāhmaṇa.",
        "source": "T01n0023_002:0286b27_8"
    },
    {
        "source_sentence": "汝自作惡，身自當受。』",
        "translation": "You yourself have done evil, and your body will itself experience it.'",
        "source": "T01n0023_002:0286b28_9"
    },
    {
        "source_sentence": "第五閻羅王問，便持付泥犁旁，即各各取人倒著泥犁，泥犁城廣長，各四萬里，",
        "translation": "When the fifth king of Yama asked, he handed it over to the side of the mud plow. They each took a man and placed him on top of the mud plow. The city of the mud plow was forty thousand li long and wide, one by one.",
        "source": "T01n0023_002:0286b29_10"
    },
    {
        "source_sentence": "窈窈冥冥。」",
        "translation": "It's mysterious and obscure.",
        "source": "T01n0023_002:0286c02_11"
    },
    {
        "source_sentence": "「四方有四門，　　諸角治甚堅，",
        "translation": "“In the four directions there are four gates, The corners of which are very hard to cross.",
        "source": "T01n0023_002:0286c02_12"
    },
    {
        "source_sentence": "　垣壁以鐵作，　　上亦用鐵覆，",
        "translation": "The walls of the enclosure are made of iron, and the top is also covered with iron.",
        "source": "T01n0023_002:0286c02_12"
    },
    {
        "source_sentence": "　其地悉布鐵，　　火悉自然出。",
        "translation": "The ground is covered with iron, and the fire naturally comes out.",
        "source": "T01n0023_002:0286c02_12"
    },
    {
        "source_sentence": "佛爾時說偈言：「其界有十大泥犁：第一名阿浮、第二名尼羅浮、第三名阿呵不、第四名阿波浮、第五名阿羅留、第六名優鉢、第七名修揵、第八名蓮花、第九名拘文、第十名分陀利。」",
        "translation": "It was then that the Buddha spoke a verse, saying, There are ten great nirayas in that realm: the first name is Ābhū, the second name is Nirvāṇa, the third name is Ahāfu, the fourth name is Upagupta, the fifth name is Ārāli, the sixth name is Upāsaka, the seventh name is修, the eighth",
        "source": "T01n0023_002:0286c02_12"
    },
    {
        "source_sentence": "佛言：「何故名為阿浮？",
        "translation": "The Buddha said, Why is it called abhidharma?",
        "source": "T01n0023_002:0286c09_13"
    },
    {
        "source_sentence": "阿浮泥犁中罪人，自然生身，譬如雲氣，是故名為阿浮。",
        "translation": "The sinners in the avīci hell naturally give rise to bodies resembling clouds and breath. Because of this, they are called avīci.",
        "source": "T01n0023_002:0286c10_14"
    },
    {
        "source_sentence": "何以故名為尼羅浮？",
        "translation": "Why is it called nirarbuda?",
        "source": "T01n0023_002:0286c11_15"
    },
    {
        "source_sentence": "尼羅浮泥犁中罪人身，譬如鹿獨肉，是故名為尼羅浮。",
        "translation": "The body of a sinner in Nirarbuda's mud plow is like the flesh of a deer alone, so it's therefore called nirarbuda.",
        "source": "T01n0023_002:0286c11_16"
    },
    {
        "source_sentence": "何以故名為阿呵不？",
        "translation": "Why is it called aha?",
        "source": "T01n0023_002:0286c13_17"
    },
    {
        "source_sentence": "阿呵不泥犁中罪人，甚大苦甚大痛喚呼，是故名為阿呵不。",
        "translation": "Ahoy, a sinner in a mud plow is very painful and screams with great pain; therefore, it's called ahoy.",
        "source": "T01n0023_002:0286c13_18"
    },
    {
        "source_sentence": "何以故名為阿波浮？",
        "translation": "Why is it called abhidharma?",
        "source": "T01n0023_002:0286c15_19"
    },
    {
        "source_sentence": "阿波浮泥犁中罪人，甚酷甚痛，大呼[口*弟]喚，是故名為阿波浮。",
        "translation": "The sinners in the abhidharma's mud plow are so cruel and painful that they shout [mouth*di], which is why it's called abhidharma.",
        "source": "T01n0023_002:0286c15_20"
    },
    {
        "source_sentence": "何以故名為阿羅留？",
        "translation": "Why is it called ar Rūpadhātu?",
        "source": "T01n0023_002:0286c16_21"
    },
    {
        "source_sentence": "阿羅留泥犁中罪人，甚苦甚痛，欲喚呼不能，但動舌，是故名為阿羅留。",
        "translation": "The sinners in Ārāḍu's niraya are so painful and distressed that they can't be called but move their tongues, which is why they're called Ārāḍu.",
        "source": "T01n0023_002:0286c17_22"
    },
    {
        "source_sentence": "何以故名為修揵？",
        "translation": "Why is it called ‘cultivating hatred’?",
        "source": "T01n0023_002:0286c19_0"
    },
    {
        "source_sentence": "修揵泥犁中罪人，身譬黃火，是故名為修揵。",
        "translation": "Cultivating a sinful person in a mud plow is likened to a yellow fire, which is why it's called cultivating a sin.",
        "source": "T01n0023_002:0286c19_1"
    },
    {
        "source_sentence": "何以故名為優鉢？",
        "translation": "Why is it called Upagupta?",
        "source": "T01n0023_002:0286c20_2"
    },
    {
        "source_sentence": "優鉢泥犁中罪人，身青譬如優鉢，是故名為優鉢。",
        "translation": "The sinners in the mud plow of Upagupta's body are blue like Upagupta, which is why they're called Upagupta.",
        "source": "T01n0023_002:0286c20_3"
    },
    {
        "source_sentence": "何以故名為拘文？",
        "translation": "Why is it called Kauṇḍinya?",
        "source": "T01n0023_002:0286c22_4"
    },
    {
        "source_sentence": "拘文泥犁中罪人，身色黃白，譬如拘文，是故名為拘文。",
        "translation": "The offenders in Kauṇḍinya's mud plow are yellow and white like Kauṇḍinya, which is why they're called Kauṇḍinya.",
        "source": "T01n0023_002:0286c22_5"
    },
    {
        "source_sentence": "何以故名為分陀利？",
        "translation": "Why is it called Puṇḍarīka?",
        "source": "T01n0023_002:0286c23_6"
    },
    {
        "source_sentence": "分陀利泥犁中罪人，身色赤如分陀利，是故名為分陀利。",
        "translation": "A sinner in the puṇḍarīka's mud plow whose body is red like a puṇḍarīka, therefore it's called a puṇḍarīka.",
        "source": "T01n0023_002:0286c24_7"
    },
    {
        "source_sentence": "何以故名為蓮華，蓮華泥犁中罪人，身紅色，是故名為蓮華。」",
        "translation": "Why is it called lotus flower because the sinners in the lotus flower mud plow have red bodies, which is why it's called lotus flower.",
        "source": "T01n0023_002:0286c25_8"
    },
    {
        "source_sentence": "佛言：「譬如有百二十斛四升篅，滿中芥子，百歲者人取一芥子去。",
        "translation": "The Buddha said, Suppose there's a hundred-twenty-pound four-ounce bowl full of mustard seed and a hundred-year-old man takes a mustard seed and leaves it.",
        "source": "T01n0023_002:0286c26_9"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T01n0023_002:0286c28_10"
    },
    {
        "source_sentence": "是百二十斛四升芥子悉盡，人在阿浮泥犁中常未竟。",
        "translation": "These one hundred and twenty hu units of four sheng of mustard seeds were all exhausted, and they were always in the abhinine plow but never finished eating them.",
        "source": "T01n0023_002:0286c28_11"
    },
    {
        "source_sentence": "若人在尼羅浮泥犁中者，百歲取一芥子，盡二千四百八十斛芥子，乃得出耳。",
        "translation": "If someone were to stay in the Nirvāṇarati plow, they'd take a mustard seed for a hundred years and end up with 2,800 cubic feet of mustard seeds, and then they'd be able to get out.",
        "source": "T01n0023_002:0286c29_12"
    },
    {
        "source_sentence": "在阿呵不泥犁中，百歲取一芥子，盡四萬八千一百六十斛乃得出。",
        "translation": "In the aha不泥犁中, he takes a mustard seed for a hundred years and reaches out after exhausting 48,960 cubic feet.",
        "source": "T01n0023_002:0287a02_13"
    },
    {
        "source_sentence": "在阿波浮泥犁中，百歲取一芥子，盡九十六萬三千三百斛乃得出。",
        "translation": "In the abhidharma, he takes a mustard seed one hundred years old and produces ninety-sixty-three thousand three hundred cubic feet.",
        "source": "T01n0023_002:0287a03_14"
    },
    {
        "source_sentence": "在阿羅留泥犁中，百歲取一芥子，盡千九百二十六萬四千斛乃得出。",
        "translation": "At one hundred years old, he takes a mustard seed from the Ārāḍuṇī plow and leaves it out at the full extent of one thousand nine hundred twenty-sixty-four thousand cubic feet.",
        "source": "T01n0023_002:0287a05_15"
    },
    {
        "source_sentence": "在修揵泥犁中，百歲取一芥子，盡三億八千萬五百二十八斛乃得出。",
        "translation": "In the mud plow of cultivation, he takes a mustard seed for a hundred years and leaves it at the end of three hundred million eighty-thousand five hundred and twenty-eight ounces.",
        "source": "T01n0023_002:0287a07_0"
    },
    {
        "source_sentence": "在青蓮華泥犁中，百歲取一芥子，盡八十六億五百六十斛乃得出。",
        "translation": "In the blue lotus-flower mud plow, he takes a mustard seed for a hundred years and reaches out after exhausting eighty-six billion five hundred and sixty thousand cubic feet.",
        "source": "T01n0023_002:0287a08_1"
    },
    {
        "source_sentence": "在黃白蓮華泥犁中，百歲取一芥子，盡千七百二億萬一千二百斛乃得出。",
        "translation": "In the yellow-white lotus mud plow, he takes a mustard seed for a hundred years and reaches out with a thousand, seven hundred, two hundred million, one thousand, or twelve hundred cubic feet.",
        "source": "T01n0023_002:0287a10_2"
    },
    {
        "source_sentence": "在拘文蓮華泥犁中，百歲取一芥子，盡三萬四千四百億二十二萬四千斛乃得出。",
        "translation": "In the lotus-flower clay plow at Kuśinagara, he took a mustard seed for a hundred years and exhausted thirty-four thousand four hundred million twenty-two thousand cubic feet.",
        "source": "T01n0023_002:0287a11_3"
    },
    {
        "source_sentence": "在紅蓮華泥犁中，百歲取一芥子，盡六十萬八千八百億四百四十八萬斛乃得出。",
        "translation": "In the red lotus-flower mud plow, he takes a mustard seed for a hundred years and reaches out at the end of sixty-eight thousand eight hundred million four hundred and forty-eight myriad cubic feet.",
        "source": "T01n0023_002:0287a13_4"
    },
    {
        "source_sentence": "二十小劫為半劫，有人名句波利，墮紅蓮華泥犁中，坐誹謗舍利弗、摩訶目揵連。」",
        "translation": "Twenty minor eons are half an eon when someone named Kauṇḍalī falls into a red lotus mud plow and sits there to denigrate Śāriputra and Mahāmaudgalyāyana.",
        "source": "T01n0023_002:0287a15_5"
    },
    {
        "source_sentence": "「若有人發起者，　　從口語出刀刃，",
        "translation": "“If someone gives rise to it, they’ll produce a blade of sword from their mouth.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "　坐語說惡之事，　　便還而自截傷。",
        "translation": "Sitting and saying evil, he returned and cut himself off.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "　若有誹反歎譽，　　可歎者反誹謗，",
        "translation": "If someone denigrates and praises what’s praised, those who can be praised denigrate what’s admired.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "　口說惡猶重過，　　口過重不安隱。",
        "translation": "To say evil verbally is still a serious offense, and to speak falsely is a serious offense that makes you feel uneasy.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "　譬如人博掩者，　　是諸惡過薄耳，",
        "translation": "It's like a person who hides widely, which is the weakness of bad faults.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "　有惡意向賢者，　　是過為最重大。",
        "translation": "Good men with bad intentions are the most serious fault.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "　泥犁浮有百千，　　阿浮有三十五。",
        "translation": "There are a hundred thousand mud plows floating, and there are thirty-five afflictions.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "佛於是說偈言：「閻羅王晝夜各三過燒熱銅，自然火在前宮中，王即恐畏，",
        "translation": "Then the Buddha spoke these verses: Three times each day and night King Yama burned a hot copper. A spontaneous fire blazed in front of him, and the king was terrified.",
        "source": "T01n0023_002:0287a17_6"
    },
    {
        "source_sentence": "衣毛起竪，即出宮舍外，外亦自然有，大王大怖懅還入宮，泥犁旁便各各取閻羅王，",
        "translation": "The hair on his hair stood on end and he came out of the palace. There was also a man outside the palace, but the king returned to the palace in great fear. At the side of the mud plow they each took the king of the hells.",
        "source": "T01n0023_002:0287a27_7"
    },
    {
        "source_sentence": "擿燒鐵地，持鐵鉤鈎其口皆開，以消銅灌王口中，燋喉咽以皆燋腹中腸胃五臟，",
        "translation": "He burns the iron ground, hooks his mouth with an iron hook, opens it all up, pours black copper into his mouth, and digests its throat and throat to purge the stomach, intestines, stomach, and five viscera in his belly.",
        "source": "T01n0023_002:0287a29_8"
    },
    {
        "source_sentence": "銅便下過去燒炙，毒痛不可忍，過惡未盡故不死，世間其有身行惡、口言惡、心念惡，",
        "translation": "The copper sinks down into the past and burns it, which is unbearable in pain and venom. It does not die until all its evil deeds have been done; but some people in the world commit evil physically, verbally, or mentally.",
        "source": "T01n0023_002:0287b02_9"
    },
    {
        "source_sentence": "死後墮惡道，燒炙毒痛，如泥犁中罪人。",
        "translation": "After death, they'll fall into a bad destiny, burned and inflicting pain like a sinner in a mud plow.",
        "source": "T01n0023_002:0287b04_0"
    },
    {
        "source_sentence": "世間人其有身行善、口言善、心念善，死後皆生天上。」",
        "translation": "People in the world who have good physical actions, good speech, and good thoughts will be born in heaven after death.",
        "source": "T01n0023_002:0287b04_1"
    },
    {
        "source_sentence": "「王使神呼問之，　　人民所作惡過，",
        "translation": "The king’s envoy called out to the gods and asked, “The people committed evil deeds.",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "　其人常而憂毒，　　人用是身勤苦。",
        "translation": "That person is always grieved and poisonous, and people use this body to suffer intensely.",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "　知當問不作惡，　　即奉行賢善法，",
        "translation": "Knowing that they should ask questions and not do evil, they will practice virtue and goodness.",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "　若有恐見因緣，　　生但有病及死。",
        "translation": "If someone fears that they'll see the causes and conditions, then there's only illness and death in birth.",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "　無因緣便解脫，　　生病死便滅盡，",
        "translation": "Without cause or condition they are liberated, And at sickness and death they are extinguished.",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "　得安隱甚快樂，　　即見在得滅度。",
        "translation": "Attaining peace and great bliss, he sees that he's attained cessation.",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "　一切恐怖畏懅，　　度無為獨有常。」",
        "translation": "All fears and fears are subdued, and the liberation of nonbeing alone has permanence.",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "佛於是說偈言：大樓炭經阿須倫品第五佛言：「須彌山下深四十萬里中，",
        "translation": "Then the Buddha spoke these verses: At the foot of Mount Sumeru, at a depth of forty thousand li,",
        "source": "T01n0023_002:0287b06_2"
    },
    {
        "source_sentence": "有阿須倫，名抄多尸利。",
        "translation": "There was an asuras named Shataśilī.",
        "source": "T01n0023_002:0287b15_3"
    },
    {
        "source_sentence": "其城郭廣長各三百三十六萬里，以七寶作之，甚姝好，金銀水精琉璃赤真珠車璩馬瑙，",
        "translation": "The city walls, three hundred and sixty million li in width and length, were built of the seven kinds of treasure. They were very beautifully decorated with golden, silver, crystal, lapis, red, genuine pearls, chariots, carriages, agate, and horse-drawn aisles.",
        "source": "T01n0023_002:0287b16_4"
    },
    {
        "source_sentence": "周匝圍繞。",
        "translation": "It's surrounded by it.",
        "source": "T01n0023_002:0287b18_5"
    },
    {
        "source_sentence": "有七重壁欄楯、七重刀分、七重行樹，高八萬里，長六萬里，皆以七寶作也。",
        "translation": "There are sevenfold walls, sevenfold railings, sevenfold sword parts, and sevenfold lines of trees, eighty thousand li in height and sixty thousand li in length, all made from the seven kinds of treasure.",
        "source": "T01n0023_002:0287b18_6"
    },
    {
        "source_sentence": "四方有四門，門高百萬里，廣六千里。",
        "translation": "In each of the four directions there are four gates one million li in height and six thousand li in width.",
        "source": "T01n0023_002:0287b20_7"
    },
    {
        "source_sentence": "一一門邊，各各有十阿須倫居止，以七寶作殿舍，七重壁、七重欄楯、七重刀分、七重行樹，",
        "translation": "At the side of each gate were ten asuras, each dwelling in a palace made of seven kinds of treasure: seven walls, seven railings, seven sections with swords, and seven lines of trees.",
        "source": "T01n0023_002:0287b21_8"
    },
    {
        "source_sentence": "周匝圍遶。",
        "translation": "It's surrounded by it.",
        "source": "T01n0023_002:0287b23_9"
    },
    {
        "source_sentence": "樹有青色者、紅色者、黃色者、白色者，有葉樹、華樹、實樹。",
        "translation": "The trees are blue, red, yellow, and white; there are leafy, flowering, and fruiting trees.",
        "source": "T01n0023_002:0287b23_10"
    },
    {
        "source_sentence": "樹上有飛鳥止，名為鶴孔雀鴝鵒白鴿，悉在樹上，甚好相和而鳴。",
        "translation": "On top of the tree, flying birds called cranes, peacocks, and white doves are all on top of the tree, singing harmoniously together in perfect harmony.",
        "source": "T01n0023_002:0287b24_11"
    },
    {
        "source_sentence": "抄多尸利阿須倫東出四萬里，中有阿須倫城郭，廣長各三十六萬里，以七寶彩畫姝好，",
        "translation": "At a distance of forty thousand li to the east of the asuras’s city of Shataśilī there is an asuras wall, three hundred and sixty thousand li in width and length, beautifully painted with the colors of the seven kinds of treasure.",
        "source": "T01n0023_002:0287b26_12"
    },
    {
        "source_sentence": "金銀琉璃水精赤真珠車璩馬瑙，作七重壁、七重欄楯、七重刀分、七重行樹，",
        "translation": "It was made of gold, silver, lapis lazuli, crystal, red, and genuine pearls, carriages, chariots, horse agate, seven walls, seven railings, seven sections with swords, and seven lines of trees.",
        "source": "T01n0023_002:0287b28_13"
    },
    {
        "source_sentence": "周匝圍繞。",
        "translation": "It's surrounded by it.",
        "source": "T01n0023_002:0287c01_14"
    },
    {
        "source_sentence": "四方有門，門高十萬里，廣六萬里，各各有三百阿須倫止。",
        "translation": "In each of the four directions was a gateway one hundred thousand li in height and sixty thousand li in width, wherein lived three hundred asuras.",
        "source": "T01n0023_002:0287c01_15"
    },
    {
        "source_sentence": "周匝圍遶，有七重流水甚深滿，中有青蓮華，黃蓮華，紅蓮華，白蓮華，",
        "translation": "It was surrounded by seven layers of water flowing very deeply. There were blue lotus blossoms, yellow lotus blossoms, red lotus blossoms, and white lotus blossoms.",
        "source": "T01n0023_002:0287c02_16"
    },
    {
        "source_sentence": "其底沙皆金，邊有樹，青色者，紅色者，黃色者，白色者，有葉樹、華樹、實樹，",
        "translation": "The sand at the bottom is all made of gold, and there are trees along its edges that are blue in color, red in color, yellow in color, and white in color. There are leafy trees, flowering trees, and fruit-bearing trees.",
        "source": "T01n0023_002:0287c04_17"
    },
    {
        "source_sentence": "樹上有種種飛鳥止，甚姝好相和而鳴。",
        "translation": "On top of the tree, various flying birds rest, and they're very beautiful and sing in harmony.",
        "source": "T01n0023_002:0287c06_18"
    },
    {
        "source_sentence": "抄多尸利阿須倫南出四萬里，中有阿須倫，名波陀呵阿須倫。",
        "translation": "At a distance of forty thousand li to the south of the asuras at Sthavira, there was an asuras named Bhadrika Asura.",
        "source": "T01n0023_002:0287c06_19"
    },
    {
        "source_sentence": "城郭廣長各四十六萬里，以七寶彩畫姝好，七重壁、七重欄楯、七重刀分、七重行樹。",
        "translation": "Each of the cities was forty-six million li in width and length, beautifully painted with the colors of the seven kinds of treasure. They had seven walls, seven railings, seven sections of swords, and seven lines of trees.",
        "source": "T01n0023_002:0287c08_20"
    },
    {
        "source_sentence": "四方有門，門高十萬里廣六萬里，一一門各有三百阿須倫止。",
        "translation": "In each of the four directions there were gates one hundred thousand li in height and sixty thousand li in width. Each gate had three hundred asuras standing on it.",
        "source": "T01n0023_002:0287c10_21"
    },
    {
        "source_sentence": "周匝有七重流水甚深滿，其水底沙皆金。",
        "translation": "It is surrounded by seven layers of flowing water that are very deep and filling, and all the sand at its bottom is made of gold.",
        "source": "T01n0023_002:0287c11_22"
    },
    {
        "source_sentence": "中有青紅黃白蓮華，有七重壁、七重欄楯，刀分、行樹，周匝圍遶。",
        "translation": "In the middle were blue, red, yellow, and white lotus flowers with seven walls and seven railings, surrounded by sword parts and walking trees.",
        "source": "T01n0023_002:0287c12_23"
    },
    {
        "source_sentence": "有青紅黃白樹，生葉華實樹，樹各有種種飛鳥，甚好相和而鳴。",
        "translation": "There are blue, red, yellow, and white trees that grow leaves, flowers, and real trees. Each of the trees has various kinds of flying birds that sing in perfect harmony with each other.",
        "source": "T01n0023_002:0287c14_24"
    },
    {
        "source_sentence": "抄多尸利阿須倫西出四萬里，有阿須倫名波利。",
        "translation": "At a distance of forty thousand li to the west of the asuras at Śataśilī, there was an asuras named Pāri.",
        "source": "T01n0023_002:0287c15_25"
    },
    {
        "source_sentence": "其城郭廣長各三十六萬里，皆以七寶彩畫姝好，作七重壁，欄楯刀分，",
        "translation": "Each of the cities was thirty-six million li in width and length, each beautifully painted with the colors of the seven kinds of treasure. They were made into seven walls, which were separated by railings and swords.",
        "source": "T01n0023_002:0287c16_26"
    },
    {
        "source_sentence": "樹木垣牆，高十萬里，廣六萬里。",
        "translation": "The trees and walls are one hundred thousand li high and sixty thousand li in width.",
        "source": "T01n0023_002:0287c18_27"
    },
    {
        "source_sentence": "四方有四門，門高十萬里，廣六萬里，皆以七寶作門，一一門邊，各有三百阿須倫止。",
        "translation": "In each of the four directions there were four gates one hundred thousand li in height and sixty thousand li in width, all made of the seven kinds of treasure. Each gate had three hundred asuras standing beside it.",
        "source": "T01n0023_002:0287c19_28"
    },
    {
        "source_sentence": "其宮殿亦以七寶作，七重壁、欄楯、刀分、樹木，七重流水甚深滿，其水底沙皆金，",
        "translation": "The palace was also made of the seven kinds of treasure, with seven walls, railings, sword fragments, and trees. Seven streams of water flowed deeply into it, and all the grains of sand at the bottom of the stream were gold.",
        "source": "T01n0023_002:0287c21_29"
    },
    {
        "source_sentence": "亦有青紅黃白蓮華，亦有青紅黃白樹生葉華實，上有種種飛鳥，甚好相和而鳴。",
        "translation": "There are also blue, red, yellow, white, and white lotus blossoms, as well as blue, red, yellow, and white trees that produce leaves and flowers and fruit. Above these there are various kinds of flying birds singing harmoniously together in perfect harmony.",
        "source": "T01n0023_002:0287c23_30"
    },
    {
        "source_sentence": "抄多尸利阿須倫宮北出四萬里，中有羅呼阿須倫。",
        "translation": "At a distance of forty thousand li to the north of the palace of the asuras at Śataśilī there was an asuras, named Rāhu.",
        "source": "T01n0023_002:0287c24_31"
    },
    {
        "source_sentence": "其城郭廣長各三十六萬里，亦以七寶彩畫姝好，作七寶壁、欄楯、刀分、樹木，",
        "translation": "The city walls were thirty million li wide and sixty million li in length, each of which was beautifully painted with the colors of the seven kinds of treasure. They also had walls made of the seven kinds of treasure, railings, moats, sword postures, trees, and boundaries embellished with ornaments of the seven kinds of treasure.",
        "source": "T01n0023_002:0287c26_32"
    },
    {
        "source_sentence": "周匝圍遶。",
        "translation": "It's surrounded by it.",
        "source": "T01n0023_002:0287c27_33"
    },
    {
        "source_sentence": "垣墻高十萬里，廣六萬里。",
        "translation": "The walls are one hundred thousand li high and sixty thousand li in width.",
        "source": "T01n0023_002:0287c28_34"
    },
    {
        "source_sentence": "四方有四門，門高十萬里，廣六萬里，一一門邊，各有三百阿須倫止。",
        "translation": "In each of the four directions there were four gates, one hundred thousand li in height and sixty thousand li in width. Each gate had three hundred asuras standing at its end.",
        "source": "T01n0023_002:0287c28_35"
    },
    {
        "source_sentence": "其宮殿亦以七寶作，七重壁，七重欄楯、刀分、樹木，周匝七重流水深滿，",
        "translation": "The palace was also made of the seven kinds of treasure, with seven walls embellished with seven railings, sword fragments, and trees, all surrounded by seven layers of running water.",
        "source": "T01n0023_002:0288a01_36"
    },
    {
        "source_sentence": "中有青紅黃白蓮華，其底沙皆金。",
        "translation": "In the middle are blue, red, yellow, and white lotus blossoms, all of which are golden in color.",
        "source": "T01n0023_002:0288a02_37"
    },
    {
        "source_sentence": "復以七重欄楯、刀分、樹木，周匝圍遶，有青紅黃白樹，生華葉實，上有種種飛鳥，",
        "translation": "Again, surrounded by sevenfold railings, sword parts, and trees, there are blue, red, yellow, and white trees that provide the fruit of flowering leaves and various kinds of flying birds.",
        "source": "T01n0023_002:0288a03_38"
    },
    {
        "source_sentence": "甚好相和而鳴。",
        "translation": "They sounded in harmony with each other.",
        "source": "T01n0023_002:0288a05_39"
    },
    {
        "source_sentence": "「抄多尸利阿須倫城，中有大樹，名為晝過度，高十二萬里，周匝亦十二萬里，",
        "translation": "“In the city of Śataśilī the asuras there is a great tree called Pārijāta, twelvety thousand li in height and twelve thousand li in circuit.",
        "source": "T01n0023_002:0288a05_40"
    },
    {
        "source_sentence": "根深二萬里，莖圍四萬里，常有花實。",
        "translation": "Its roots are twenty thousand li deep and its stems are forty thousand li in circumference. The flowers always bear fruit.",
        "source": "T01n0023_002:0288a07_41"
    },
    {
        "source_sentence": "抄多尸利阿須倫身高二萬八千里，有高二萬四千里者，有高二萬里，有高萬六千里者，",
        "translation": "Twenty-eight thousand li in height, twenty-four thousand li in height and twelve thousand li in height.",
        "source": "T01n0023_002:0288a08_42"
    },
    {
        "source_sentence": "有高萬二千里，有高八千里，有七聲者，長六聲者、五聲者、四聲者、三聲者、二聲者，",
        "translation": "It is twelve thousand li in height and eight thousand li high. Some say it has seven sounds, while those that have six sounds are the longest; those that have five sounds are the fastest; those that have four sounds are the fastest; those that have three sounds are the fastest; and those that have two sounds are the fastest.",
        "source": "T01n0023_002:0288a10_43"
    },
    {
        "source_sentence": "最小者長半聲。",
        "translation": "The smallest one is half a sound long.",
        "source": "T01n0023_002:0288a12_44"
    },
    {
        "source_sentence": "抄多尸利阿須倫宮有四品常持風持之。",
        "translation": "The palace of the asuras in Śataśilī has four chapters that always hold the wind and maintain it.",
        "source": "T01n0023_002:0288a12_45"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T01n0023_002:0288a13_46"
    },
    {
        "source_sentence": "一者不可壞風、二者堅住風、三者持風、四者上風。",
        "translation": "One is indestructible wind, two are firmly abiding winds, three are sustaining winds, and four are upward winds.",
        "source": "T01n0023_002:0288a14_47"
    },
    {
        "source_sentence": "是為四品風，主持水在上如浮雲矣。」",
        "translation": "These are the four kinds of wind that carry water upward like floating clouds.",
        "source": "T01n0023_002:0288a15_48"
    },
    {
        "source_sentence": "大樓炭經卷第二",
        "translation": "Sutra of the Burning Coal Treasury, Volume 2",
        "source": "T01n0023_002:0288a17_0"
    },
    {
        "source_sentence": "(咸亨四年章武郡公蘇慶節為父刑國公敬造一切經)",
        "translation": "(All scriptures were compiled in the fourth year of Xianxiang's reign and honored by the ruler of Zhang Wu Commandery, So Qingjie, as his father, the ruler of Yue國.)",
        "source": "T01n0023_002:0288a18_0"
    }
]