[
    {
        "source_sentence": "佛說是法非法經(出《中阿含》)",
        "translation": "Foshuo zhifa neiqiao jing (from the Middle Length Āgamas)",
        "source": "T01n0048_001:0837c21_0"
    },
    {
        "source_sentence": "後漢安息國三藏安世高譯",
        "translation": "Translated by An Shigao, the Tripiṭaka Master of Anxi in the Later Han Dynasty",
        "source": "T01n0048_001:0837c23_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T01n0048_001:0837c24_0"
    },
    {
        "source_sentence": "是時，佛告諸比丘，比丘應曰：「唯然。」",
        "translation": "The Buddha then addressed the monks, and the monks replied, Yes.",
        "source": "T01n0048_001:0837c24_1"
    },
    {
        "source_sentence": "比丘從佛聽。",
        "translation": "The monks listened to the Buddha's teaching.",
        "source": "T01n0048_001:0837c25_2"
    },
    {
        "source_sentence": "佛說：「有賢者法，比丘聽說，亦有非賢者法，當聽熟聽、熟知熟念說。」",
        "translation": "The Buddha said, There's the teaching of a good person, and a monk who listens to it or doesn't have the teaching of a good person should listen well-versed and well-understood and well-intended.",
        "source": "T01n0048_001:0837c26_0"
    },
    {
        "source_sentence": "比丘唯然，從佛受教，佛便說是。",
        "translation": "The monks simply accepted the teaching from the Buddha, and the Buddha said so.",
        "source": "T01n0048_001:0837c27_1"
    },
    {
        "source_sentence": "「何等比丘非賢者法？",
        "translation": "What's the teaching of a monk who isn't a good man?",
        "source": "T01n0048_001:0837c29_0"
    },
    {
        "source_sentence": "若比丘大姓，憙道欲學道，若有餘同學比丘非大姓，比丘大姓故，為自憍身欺餘，",
        "translation": "“Suppose a monk has a big family name and desires to learn the path. If there are other fellow monks, but he is not a big family name, then because of his big family name, the monk deceives others by taking advantage of himself",
        "source": "T01n0048_001:0837c29_1"
    },
    {
        "source_sentence": "是非賢者法。",
        "translation": "It's not the Dharma of the good man.",
        "source": "T01n0048_001:0838a02_2"
    },
    {
        "source_sentence": "「何等為賢者法？",
        "translation": "What's the good man's teaching?",
        "source": "T01n0048_001:0838a03_0"
    },
    {
        "source_sentence": "賢者學計是我不必從大姓，能斷貪婬、能斷瞋恚、能斷愚癡。",
        "translation": "Good man, it's not necessary for me to follow a great family name and be able to stop craving, stop anger, and stop folly.",
        "source": "T01n0048_001:0838a03_1"
    },
    {
        "source_sentence": "或時有比丘非大姓家，但有方便受法，如法說、如要行、隨法行，為從是名聞故；",
        "translation": "Sometimes there are bhik$us who do not belong to a great caste but have skillful means for receiving the dharma. They teach it in accordance with the dharma, practice it according to its essentials, and follow [the teaching]; this is so because",
        "source": "T01n0048_001:0838a04_2"
    },
    {
        "source_sentence": "如法行、隨法諦，不自譽，亦不欺餘，是賢者法。",
        "translation": "Practicing according to the teaching and following the truth of the teaching without praising oneself or deceiving others is the way of a good man.",
        "source": "T01n0048_001:0838a06_3"
    },
    {
        "source_sentence": "「或時一者比丘，色像多端正，餘比丘不如，便從端正故自譽欺餘，是非賢者法。",
        "translation": "Sometimes one is a monk whose appearance is often handsome but the other monks aren't handsome, so he praises himself for being handsome because he deceives others, which is not the way of a good man.",
        "source": "T01n0048_001:0838a07_4"
    },
    {
        "source_sentence": "賢者復不爾，賢者自計，色端正我不必從是，能斷貪婬、能斷瞋恚、能斷愚癡。",
        "translation": "Good man, it's not like that. Good man, you think for yourself that form is correct and I needn't follow it, which will cut off craving, cut off anger, and cut off folly.",
        "source": "T01n0048_001:0838a09_5"
    },
    {
        "source_sentence": "或時有比丘不端正，但隨法多少受行，便從是得譽得名聞，受法諦隨法行，",
        "translation": "“Sometimes there is a monk who is not dignified but follows the teaching according to how much he receives and practices. From this he gains renown and reputation, and receives the teaching of truth and follows the teaching in practice.",
        "source": "T01n0048_001:0838a11_6"
    },
    {
        "source_sentence": "不自譽亦不欺餘，是賢者法。",
        "translation": "Not praising oneself and not deceiving others is the way of a good man.",
        "source": "T01n0048_001:0838a12_7"
    },
    {
        "source_sentence": "「或時一者比丘，善語言善說，餘比丘不如，便從善語言善說自譽欺餘，",
        "translation": "“Sometimes a monk speaks well and teaches well, but the others don’t. So he follows [the way of] speaking well and praising himself to deceive others.",
        "source": "T01n0048_001:0838a14_0"
    },
    {
        "source_sentence": "是非賢者法。",
        "translation": "It's not the Dharma of the good man.",
        "source": "T01n0048_001:0838a15_1"
    },
    {
        "source_sentence": "賢者復不爾，賢者學計是我不必從善美語，亦不從知善美說，能斷欲貪、能斷瞋恚、能斷愚癡。",
        "translation": "Good man, it's not like that. Good man, you mustn't train yourself to think that I can stop craving, stop anger, and stop folly by following good words or good deeds, or by speaking from the knowledge of goodness",
        "source": "T01n0048_001:0838a15_2"
    },
    {
        "source_sentence": "「或時比丘，言語不善美，亦不善說故，但如法受教，多少隨行，便從是得恭敬，",
        "translation": "“Sometimes a monk’s words are unwholesome, and he does not speak well. He receives instruction in accordance with the Dharma but follows it for as long as he wishes. As a result, he is able to attain reverence",
        "source": "T01n0048_001:0838a19_0"
    },
    {
        "source_sentence": "從是得名聞，是法從受法行諦，不自譽亦不欺餘，是賢者法。",
        "translation": "From this, they attain fame and learning, which is the teaching that follows from the acceptance of the practice of the teaching and doesn't praise themselves or deceive others, which is the good man's teaching.",
        "source": "T01n0048_001:0838a20_1"
    },
    {
        "source_sentence": "「或時是聞一者比丘，年大多知識，相知富饒，餘比丘不如，便從年大從多知識，",
        "translation": "“Sometimes this is a learned monk of one caste. He is well versed in the classics and knows well [the Buddhist doctrines]. The other monks are not endowed with them. So he follows the old and follows",
        "source": "T01n0048_001:0838a23_0"
    },
    {
        "source_sentence": "從是自譽自憍欺餘，是非賢者法。",
        "translation": "From this, he praises himself and deceives others, which is not the teaching of a good man.",
        "source": "T01n0048_001:0838a24_1"
    },
    {
        "source_sentence": "「賢者復不爾，賢者但念學計是我不必從年大故，亦不從多知識故，亦不從多得福故，",
        "translation": "Venerable friend, it is not like that. Rather, [the Buddha said to me]: “Friend, you should be mindful of the fact that your studies and calculations are exclusively self because they do not have to arise at an advanced age",
        "source": "T01n0048_001:0838a26_0"
    },
    {
        "source_sentence": "能斷貪欲、能斷瞋恚、能斷愚癡。",
        "translation": "They can stop craving, stop anger, and stop folly.",
        "source": "T01n0048_001:0838a28_0"
    },
    {
        "source_sentence": "「或時比丘年亦不大，亦不多知識，福亦不饒，但受法，欲隨法，欲隨法行多少，",
        "translation": "“Sometimes a monk is neither old nor young, doesn’t know much, isn’t blessed or fortunate, but only receives the Dharma, wants to follow the Dharma, and wants to practice according to the Dharma.",
        "source": "T01n0048_001:0838a29_0"
    },
    {
        "source_sentence": "便從是得名聞。",
        "translation": "From this, they'll then attain fame and hearing.",
        "source": "T01n0048_001:0838b01_1"
    },
    {
        "source_sentence": "是從法隨法諦，不自譽不自憍亦不欺餘，是賢者法。",
        "translation": "It follows the truth of the teaching from the teaching and doesn't praise themselves, blame themselves, or deceive others, which is the teaching of the good man.",
        "source": "T01n0048_001:0838b02_2"
    },
    {
        "source_sentence": "「或時是聞一者比丘，知聞經能說經、知律知入通經，餘比丘不如，便從入故、從通經故，",
        "translation": "“Perhaps it is the case that a monk who has heard only one doctrine and knows what he has heard, can expound the doctrine of the discourse by means of his knowledge of the discourse; or he knows the disciplinary rules [for",
        "source": "T01n0048_001:0838b04_0"
    },
    {
        "source_sentence": "自譽自憍欺餘，是非賢者法。",
        "translation": "To praise oneself and deceive others is not the way of a good man.",
        "source": "T01n0048_001:0838b06_0"
    },
    {
        "source_sentence": "「賢者復不爾，賢者但計學是我不必從入故，亦不從通經故，能斷貪欲、能斷瞋恚、能斷愚癡。",
        "translation": "Good man, it's not like that; good man, you simply imagine that training is the self because it doesn't have to come from entry and doesn't come from the general sūtras, so you can stop craving, stop anger, and stop fol",
        "source": "T01n0048_001:0838b07_0"
    },
    {
        "source_sentence": "「或時有比丘，無有入，亦不通經，但受法隨法，正求隨法行，便從是得恭敬得名聞。",
        "translation": "Sometimes there's a monk who doesn't enter, doesn't understand the sūtras, but accepts the teaching and follows the teaching, correctly pursues the practice of following the teaching, and then he attains respect and reputation because of this.",
        "source": "T01n0048_001:0838b10_0"
    },
    {
        "source_sentence": "是從持法隨法行諦，不自譽、不自憍亦不欺餘，是賢者法。",
        "translation": "This is the teaching of a good man who follows the practice of following the Dharma from maintaining it and doesn't praise himself, blame himself, or deceive others.",
        "source": "T01n0048_001:0838b11_1"
    },
    {
        "source_sentence": "「或時一者比丘，自求不從相知求，不過七家，一處坐一時食，從後不取，",
        "translation": "“Sometimes, a monk asks for food at one time while sitting in one of the seven houses and doesn’t take it from behind.",
        "source": "T01n0048_001:0838b14_0"
    },
    {
        "source_sentence": "餘比丘不如，便從一食後不取，自譽自憍欺餘，是非賢者法。",
        "translation": "The other monks didn't do so, so they won't take it after a meal and praise themselves for deceiving others, which is not the good man's teaching.",
        "source": "T01n0048_001:0838b15_1"
    },
    {
        "source_sentence": "賢者復不爾，賢者但學，我不必從一食後不取不從，是故能斷貪欲、能斷瞋恚、能斷愚癡。",
        "translation": "Good man, it is not like that. Good man, you should simply learn: I need not take or follow food after a single [coarse] meal. That is why I am able to eliminate craving, eliminate hatred, and eliminate folly.",
        "source": "T01n0048_001:0838b17_2"
    },
    {
        "source_sentence": "或時比丘不一食不從後取，但受法隨法正受隨法，從是得恭敬，從是得名聞；",
        "translation": "Sometimes a bhikṣu does not eat once and does not take food at the end; he simply receives the Dharma according to the Dharma, directly receives the Dharma according to the Dharma. Because of this he gains respect and because of this he gains fame.",
        "source": "T01n0048_001:0838b19_3"
    },
    {
        "source_sentence": "是法隨法諦，不自譽、不自憍亦不欺餘，是賢者法。",
        "translation": "This is the teaching that follows the truth of the Dharma and doesn't praise themselves, blame themselves, or deceive others, which is the teaching of the good man.",
        "source": "T01n0048_001:0838b21_0"
    },
    {
        "source_sentence": "「或時一者比丘，土中塚間止，但三領名故，餘比丘不如，便從名故，",
        "translation": "“Sometimes one monk stayed in a tomb in the dirt, but because he had three names, the other monks weren’t like him. So it is because of these names that they came here.",
        "source": "T01n0048_001:0838b23_0"
    },
    {
        "source_sentence": "自譽自憍欺餘，是非賢者法。",
        "translation": "To praise oneself and deceive others is not the way of a good man.",
        "source": "T01n0048_001:0838b24_1"
    },
    {
        "source_sentence": "「賢者復不爾，賢者但計學我不必從三領名故，能斷貪欲、能斷瞋恚、能斷愚癡。",
        "translation": "Good man, again, that's not the case. Good man, you simply impute that I needn't learn from the three names to be able to stop craving, stop anger, and stop folly.",
        "source": "T01n0048_001:0838b26_0"
    },
    {
        "source_sentence": "或時比丘，無有三領名，但受法隨法，正受隨法，便從是得恭敬得名聞；",
        "translation": "Sometimes a bhikṣu does not possess the three kinds of prestige. He receives the Dharma according to the Dharma, directly receives the Dharma according to the Dharma; from this he gains respect and reputation through receiving it.",
        "source": "T01n0048_001:0838b27_1"
    },
    {
        "source_sentence": "是法隨法諦，不自譽、不自憍亦不欺餘，是賢者法。",
        "translation": "This is the teaching that follows the truth of the Dharma and doesn't praise themselves, blame themselves, or deceive others, which is the teaching of the good man.",
        "source": "T01n0048_001:0838b29_2"
    },
    {
        "source_sentence": "「或時一者比丘露中止，或時樹下，或時空澤塚間，在所臥具，餘比丘不如，",
        "translation": "“Sometimes a monk stays in the open air, sometimes under a tree, sometimes in an empty marsh mound, while others don’t.",
        "source": "T01n0048_001:0838c02_0"
    },
    {
        "source_sentence": "便從是故，自譽自憍欺餘，是非賢者法。",
        "translation": "It's because of this that they praise themselves and deceive others, which is not the Dharma of good men.",
        "source": "T01n0048_001:0838c03_1"
    },
    {
        "source_sentence": "「賢者復不爾，賢者但計學我不必從是露中樹下、空澤間故，能斷貪欲、能斷瞋恚、能斷愚癡。",
        "translation": "Good man, it's not like that; good man, you simply impute that I needn't train myself to stop craving, stop anger, and stop folly because of the place between the trees and swamps in the dew.",
        "source": "T01n0048_001:0838c05_0"
    },
    {
        "source_sentence": "「或時比丘，無有是上說，但受法隨法，正受隨法，便從是得恭敬得名聞；",
        "translation": "“Sometimes a bhikṣu does not teach the above but receives the Dharma in accordance with the Dharma. Having received the Dharma in accordance with the Dharma, he or she may attain respect and reputation through [recalling] this practice.",
        "source": "T01n0048_001:0838c08_0"
    },
    {
        "source_sentence": "是法隨法諦，不自譽、不自憍、不欺餘，是賢者法。",
        "translation": "This is the teaching that follows the truth of the Dharma and doesn't praise themselves, blame themselves, or deceive others, which is the teaching of the good man.",
        "source": "T01n0048_001:0838c09_1"
    },
    {
        "source_sentence": "「或時比丘，已得第一禪，餘比丘不如，便從第一禪故，自譽自憍欺餘，",
        "translation": "“Sometimes when a monk has attained the first absorption but the other monks aren’t as good as him, then because of the first absorption he praises himself and deceives others.",
        "source": "T01n0048_001:0838c11_0"
    },
    {
        "source_sentence": "是非賢者法。",
        "translation": "It's not the Dharma of the good man.",
        "source": "T01n0048_001:0838c12_1"
    },
    {
        "source_sentence": "「賢者復不爾，賢者但學第一禪者，佛說自知是，受是法諦，不自譽、不自憍、不欺餘，",
        "translation": "Good man, it is not like that. Good man, you should simply train in the first meditative state of absorption. The Buddha himself knows this and receives this doctrine. He does not praise himself, blame others, or deceive others",
        "source": "T01n0048_001:0838c13_0"
    },
    {
        "source_sentence": "是賢者法。",
        "translation": "This is the Dharma of the good man.",
        "source": "T01n0048_001:0838c14_1"
    },
    {
        "source_sentence": "「或時比丘，有二禪德，或有三禪德，或有四禪德，如第一禪說，是賢者法。",
        "translation": "“Sometimes a monk has the virtue of the second dhyāna, the virtue of the third dhyāna, or the virtue of the fourth dhyāna, as explained in the first dhyāna.",
        "source": "T01n0048_001:0838c16_0"
    },
    {
        "source_sentence": "「或時比丘，解空行意，或時解識行意，或時解非常行意，或時解無有思想意行有思想行意，",
        "translation": "“Sometimes a monk understands the meaning of practice in emptiness; sometimes he understands the meaning of practice in consciousness; sometimes he understands the meaning of practice in an impermanent state; sometimes he understands the meaning of practice without thought and",
        "source": "T01n0048_001:0838c18_0"
    },
    {
        "source_sentence": "餘比丘不如，便從是得思想無有思想行，便自譽自憍亦欺餘，是非賢者法。",
        "translation": "If the other monks aren't like that, then they'll attain thought without thought and practice from this, and they'll praise themselves for their self-conceit and deceive others, which is not the good man's teaching.",
        "source": "T01n0048_001:0838c20_1"
    },
    {
        "source_sentence": "賢者復不爾，賢者但計學無有思想亦無有思想行，佛說從計我有是，是受法隨法諦，",
        "translation": "Good man, this is not the case either. Good man, you only impute training without thought and without thought-concomitance. The Buddha has said that one follows the doctrine of imputing a self: this is the truth of the law in relation",
        "source": "T01n0048_001:0838c21_2"
    },
    {
        "source_sentence": "不自譽、不自憍、不欺餘，是賢者法。」",
        "translation": "Not praising oneself, not blaming oneself, and not deceiving others is the way of a good man.",
        "source": "T01n0048_001:0838c23_3"
    },
    {
        "source_sentence": "佛說：「比丘！",
        "translation": "The Buddha said, Monks!",
        "source": "T01n0048_001:0838c25_0"
    },
    {
        "source_sentence": "我已說賢者法，亦說非賢者法，比丘當自思惟，賢者法亦當思惟。",
        "translation": "I've explained the good man's teaching and what's not the good man's teaching, so a monk should contemplate it for himself, and the good man's teaching should also be contemplated.",
        "source": "T01n0048_001:0838c25_1"
    },
    {
        "source_sentence": "非賢者法已思惟，當行賢者法，捨非賢者法，受賢者法。",
        "translation": "After contemplating the teachings of those who aren't good, they should practice the teachings of good men, abandon the teachings of those who aren't good, and accept the teachings of good men.",
        "source": "T01n0048_001:0838c26_2"
    },
    {
        "source_sentence": "隨法比丘應當學是。」",
        "translation": "A monk who follows the teaching should train like this.",
        "source": "T01n0048_001:0838c28_3"
    },
    {
        "source_sentence": "佛說是，比丘受著心行。",
        "translation": "The Buddha said, Yes, a monk who's addicted to mental action.",
        "source": "T01n0048_001:0838c28_4"
    },
    {
        "source_sentence": "佛說是法非法經",
        "translation": "\\",
        "source": "T01n0048_001:0839a01_0"
    }
]