[
    {
        "source_sentence": "玉耶經",
        "translation": "Yao jing",
        "source": "T02n0143_001:0865c19_0"
    },
    {
        "source_sentence": "東晉天竺三藏竺曇無蘭譯",
        "translation": "Translated by the translator of the Tripiṭaka of Tianzhusa in the Eastern Jin Dynasty, Zhu Dharmarman",
        "source": "T02n0143_001:0865c21_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園，佛為四輩弟子說法。",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, the Buddha taught the Dharma to four groups of disciples.",
        "source": "T02n0143_001:0865c22_0"
    },
    {
        "source_sentence": "時給孤獨家，先為子娶婦長者家女，女名玉耶，端正姝好而生憍慢，不以婦禮承事妐姑夫婿。",
        "translation": "At the time, Anāthapiṇḍika had previously married a woman named Yuya, a daughter of an elderly man's family for her son, who was beautiful and conceited but didn't serve him as his aunt or husband with courtesy.",
        "source": "T02n0143_001:0865c23_1"
    },
    {
        "source_sentence": "給孤長者夫妻議言：「子婦不順不依法禮，設加杖捶不欲行此，置不教呵其過轉增，",
        "translation": "An orphaned elder's wife and husband agreed, saying, 'My son and wife don't obey the Dharma and don't venerate it. If they were to be given a cane and beaten, they wouldn't want to do this, and if they weren't taught and criticized, their faults would increase.",
        "source": "T02n0143_001:0865c25_2"
    },
    {
        "source_sentence": "當如之何？」",
        "translation": "What will it be like?",
        "source": "T02n0143_001:0865c27_3"
    },
    {
        "source_sentence": "長者曰：「唯佛大聖善能化物，剛強弭伏無敢不從，請佛來化。」",
        "translation": "The elder said, Only the Buddha is a great sage who can skillfully transform things, and he doesn't dare not comply when he's overcome with rigidity and suppresses it; he invites the Buddha to come and transform it.",
        "source": "T02n0143_001:0865c27_4"
    },
    {
        "source_sentence": "妻言：「大善。」",
        "translation": "The wife said, Very good.",
        "source": "T02n0143_001:0865c29_5"
    },
    {
        "source_sentence": "明旦嚴服往詣佛所，頭面著地前白佛言：「我家為子娶婦甚大憍慢，不以禮節承事我子，",
        "translation": "On the morning, he dressed himself in formal clothing and approached the Buddha. He bowed his head at the ground and said to him: At my house I marry my wife for my child.",
        "source": "T02n0143_001:0865c29_6"
    },
    {
        "source_sentence": "唯願世尊，明日自屈，將諸弟子到舍中飯，并為玉耶說法，令心開解改過行善。」",
        "translation": "I only wish, Bhagavān, that you will bend yourself tomorrow and take your disciples to the monastery to eat and teach the Dharma for them, so that their minds will be enlightened and they'll change their faults and practice goodness.",
        "source": "T02n0143_001:0866a02_7"
    },
    {
        "source_sentence": "佛告長者：「善哉！",
        "translation": "The Buddha told the elder, Good!",
        "source": "T02n0143_001:0866a04_8"
    },
    {
        "source_sentence": "善哉！」",
        "translation": "Excellent!",
        "source": "T02n0143_001:0866a04_9"
    },
    {
        "source_sentence": "給孤長者聞佛受請，歡喜禮佛接足而去，歸舍齋戒供辦中飯。",
        "translation": "When the orphaned elder Anāthapiṇḍika heard the Buddha's invitation, he rejoiced, saluted him by bowing his forehead to his feet, departed, returned home, observed precepts, and prepared a midday meal.",
        "source": "T02n0143_001:0866a04_10"
    },
    {
        "source_sentence": "明日佛與千二百五十弟子到長者家，長者歡喜迎佛作禮，佛坐已定，大小皆出禮佛却住，",
        "translation": "On the following day, the Buddha and his one thousand two hundred and fifty disciples came to the house of the wealthy merchant householder. The wealthy householder was delighted to greet the Buddha and offered him obeisance. After the Buddha had taken his seat in meditation, everyone, both old and young, large and small, came out to pay their respects to the Buddha and",
        "source": "T02n0143_001:0866a06_11"
    },
    {
        "source_sentence": "玉耶逃藏不肯禮佛。",
        "translation": "Yao ran away and refused to pay homage to the Buddha.",
        "source": "T02n0143_001:0866a08_12"
    },
    {
        "source_sentence": "佛即變化，令長者家，屋宅牆壁，皆如琉璃、水精之色內外相見，玉耶見佛有三十二相、八十種好，",
        "translation": "The Buddha then manifested his magical emanation, causing the house of the wealthy householder to be surrounded by walls that looked like lapis lazuli or crystal. Each wall was adorned with the thirty-two marks and eighty secondary signs of a buddha.",
        "source": "T02n0143_001:0866a08_13"
    },
    {
        "source_sentence": "身紫金色，光明暉暉，玉耶惶怖心驚毛竪，即出禮佛，頭頂懺悔却在右面。",
        "translation": "His body was purplish-gold in color, shining brilliantly bright. Fearful and frightened, his hair stood on end in fear, and he came out to pay homage to the Buddha. He repented at the top of his head and withdrew toward the right side.",
        "source": "T02n0143_001:0866a10_14"
    },
    {
        "source_sentence": "佛告玉耶：「女人不當自恃端正輕慢夫婿。",
        "translation": "The Buddha told Yuye, A woman shouldn't rely on her own manner and despise her husband.",
        "source": "T02n0143_001:0866a12_15"
    },
    {
        "source_sentence": "何謂端正？",
        "translation": "What's meant by correct?",
        "source": "T02n0143_001:0866a13_16"
    },
    {
        "source_sentence": "除却邪態八十四姤，定意一心是為端正，不以顏色面目髮綵為端正也。",
        "translation": "Removing the eighty-four patches of wrong form and concentrating on one mind is what's correct, not using colorful features or facial hair as what's correct.",
        "source": "T02n0143_001:0866a13_17"
    },
    {
        "source_sentence": "女人身中有十惡事，何等為十？",
        "translation": "What are the ten bad things in a woman’s body?",
        "source": "T02n0143_001:0866a15_18"
    },
    {
        "source_sentence": "一者、女人初生墮地父母不喜。",
        "translation": "1. When a woman is first born, she falls into the ground and her parents aren't happy.",
        "source": "T02n0143_001:0866a16_19"
    },
    {
        "source_sentence": "二者、養育視無滋味。",
        "translation": "2. nurturing and nurturing that doesn't taste good.",
        "source": "T02n0143_001:0866a16_20"
    },
    {
        "source_sentence": "三者、女人心常畏人。",
        "translation": "3. A woman's mind always fears people.",
        "source": "T02n0143_001:0866a17_21"
    },
    {
        "source_sentence": "四者、父母恒憂嫁娶。",
        "translation": "4. Their parents are constantly grieved to marry.",
        "source": "T02n0143_001:0866a17_22"
    },
    {
        "source_sentence": "五者、與父母生相離別。",
        "translation": "5. separation from the characteristic of being born with one's parents.",
        "source": "T02n0143_001:0866a18_23"
    },
    {
        "source_sentence": "六者、常畏夫婿視其顏色，歡悅輒喜瞋恚則懼。",
        "translation": "6. He always fears his husband's son-in-law, looks at his appearance, rejoices, and becomes frightened when he's angry.",
        "source": "T02n0143_001:0866a18_24"
    },
    {
        "source_sentence": "七者、懷妊產生甚難。",
        "translation": "7. It's very difficult to conceive and give birth.",
        "source": "T02n0143_001:0866a19_25"
    },
    {
        "source_sentence": "八者、女人小為父母所撿錄。",
        "translation": "Eighth, the woman's smallness is recorded by her parents.",
        "source": "T02n0143_001:0866a20_26"
    },
    {
        "source_sentence": "九者、中為夫婿所制。",
        "translation": "9. The middle is regulated by the husband's son-in-law.",
        "source": "T02n0143_001:0866a20_27"
    },
    {
        "source_sentence": "十者、年老為兒孫所呵，從生至終不得自在。",
        "translation": "10. The old are criticized by their children and grandchildren, and they don't attain freedom from birth to death.",
        "source": "T02n0143_001:0866a21_28"
    },
    {
        "source_sentence": "是為十事，女人不自覺知。」",
        "translation": "These are the ten things a woman doesn't know for herself.",
        "source": "T02n0143_001:0866a22_29"
    },
    {
        "source_sentence": "玉耶長跪叉手白佛：「稟受賤身不閑禮儀。",
        "translation": "Yao knelt down with his palms joined and said to the Buddha, Accepting a humble body without lazy manner, he paid homage.",
        "source": "T02n0143_001:0866a22_30"
    },
    {
        "source_sentence": "唯願世尊，具說教訓為婦之法。」",
        "translation": "Please, Bhagavān, explain the teachings for women.",
        "source": "T02n0143_001:0866a23_31"
    },
    {
        "source_sentence": "佛告玉耶：「婦事姑妐夫婿，有五善三惡。",
        "translation": "The Buddha told Yao, A woman who serves an aunt's husband and son-in-law has five good and three bad qualities.",
        "source": "T02n0143_001:0866a24_32"
    },
    {
        "source_sentence": "何等為五善？",
        "translation": "What are the five kinds of wholesomeness?",
        "source": "T02n0143_001:0866a25_33"
    },
    {
        "source_sentence": "一者、為婦當晚臥早起，櫛梳髮綵整頓衣服，洗拭面目勿有垢穢，執於作事先啟所尊，",
        "translation": "1. When the woman goes to bed late at night and rises early in the morning, combs, combs, robes, and clothes are neat and tidy, washes her face so that it doesn't stain, clings to what she makes, and reveals it to the honored one beforehand.",
        "source": "T02n0143_001:0866a25_34"
    },
    {
        "source_sentence": "心常恭順，設有甘美不得先食。",
        "translation": "Their minds are always respectful and obedient, and if there's sweet food, they won't eat it first.",
        "source": "T02n0143_001:0866a27_35"
    },
    {
        "source_sentence": "二者、夫壻呵罵不得瞋恨。",
        "translation": "2. Those who harshly ridicule and abuse others won't be allowed to become angry.",
        "source": "T02n0143_001:0866a28_36"
    },
    {
        "source_sentence": "三者、一心守夫婿，不得念邪婬。",
        "translation": "3. A husband who singlemindedly guards his son-in-law and doesn't think of sexual misconduct.",
        "source": "T02n0143_001:0866a29_37"
    },
    {
        "source_sentence": "四者、常願夫婿長壽，出行婦當整頓家中。",
        "translation": "4. He always wishes for the long life of his husband's son-in-law, and when he leaves home, his wife will be neatly dressed at home.",
        "source": "T02n0143_001:0866a29_38"
    },
    {
        "source_sentence": "五者、常念夫善不念夫惡，是為五善。",
        "translation": "5. Being always mindful of what's good and not mindful of what's bad are the five good qualities.",
        "source": "T02n0143_001:0866b01_39"
    },
    {
        "source_sentence": "何等為三惡？",
        "translation": "What are the three evils?",
        "source": "T02n0143_001:0866b02_40"
    },
    {
        "source_sentence": "一者、不以婦禮承事姑妐夫婿，但欲美食先而噉之，未冥早臥日出不起，",
        "translation": "One, they don't serve their aunt's husband or son-in-law with courtesy of their wife but want to eat good food before they lie down early in the morning and can't get up at sunrise.",
        "source": "T02n0143_001:0866b02_41"
    },
    {
        "source_sentence": "夫欲教呵瞋目視夫，應拒猶罵。",
        "translation": "If someone wants to teach an angry man to look at him with their eyes, they should reject and scold him.",
        "source": "T02n0143_001:0866b04_42"
    },
    {
        "source_sentence": "二者、不一心向夫婿，但念他男子。",
        "translation": "2. They don't singlemindedly address their husband and son-in-law but simply think of other men.",
        "source": "T02n0143_001:0866b05_43"
    },
    {
        "source_sentence": "三者、欲令夫死早得更嫁，是為三惡。」",
        "translation": "Third, they want to cause their husbands to die early enough to be remarried, which are the three bad things.",
        "source": "T02n0143_001:0866b06_44"
    },
    {
        "source_sentence": "玉耶默然無辭答佛。",
        "translation": "Yao remained silent and didn't answer the Buddha with words.",
        "source": "T02n0143_001:0866b07_45"
    },
    {
        "source_sentence": "佛告玉耶：「世間有七輩婦：一、婦如母，二、婦如妹，三、婦如善知識，",
        "translation": "The Buddha told Yao, There are seven kinds of women in the world: 1. women like mothers, 2. women like sisters, and 3. women like good friends.",
        "source": "T02n0143_001:0866b07_46"
    },
    {
        "source_sentence": "四、婦如婦，五、婦如婢，六、婦如怨家，七、婦如奪命，是為七輩婦，",
        "translation": "4. A wife is like a wife, 5. a wife is like a maidservant, 6. a wife is like a house of enemies, and 7. a wife is like taking life.",
        "source": "T02n0143_001:0866b09_47"
    },
    {
        "source_sentence": "汝豈解乎？」",
        "translation": "Do you understand?",
        "source": "T02n0143_001:0866b10_48"
    },
    {
        "source_sentence": "玉耶白佛：「不知七婦盡何所施行？",
        "translation": "Yao said to the Buddha, I don't know what all seven women do.",
        "source": "T02n0143_001:0866b10_49"
    },
    {
        "source_sentence": "願佛為解之。」",
        "translation": "May the Buddha understand it for them.",
        "source": "T02n0143_001:0866b11_50"
    },
    {
        "source_sentence": "佛告玉耶：「諦聽諦聽，善思念之，吾當為汝分別解說。",
        "translation": "The Buddha told Yuye, Listen closely and listen carefully, and consider it well; I will explain it for you with discernment.",
        "source": "T02n0143_001:0866b11_51"
    },
    {
        "source_sentence": "何等為母婦？",
        "translation": "What are their mothers and wives?",
        "source": "T02n0143_001:0866b12_52"
    },
    {
        "source_sentence": "母婦者，愛念夫婿猶若慈母，侍其晨夜不離左右，供養盡心不失時宜，",
        "translation": "The mother and wife are fond of their husbands and sons just as if they were kind to their mother, attending them morning and evening without leaving their left or right. They make offerings at all times without missing the proper time.",
        "source": "T02n0143_001:0866b13_53"
    },
    {
        "source_sentence": "夫若行來恐人輕易，見則憐念心不疲厭，憐夫如子，是為母婦。",
        "translation": "If a woman is afraid that she'll be disrespectful to people and sees them, then she's compassionate and doesn't tire of it, and she pities her husband like a child, which is the mother and wife.",
        "source": "T02n0143_001:0866b14_54"
    },
    {
        "source_sentence": "何等為妹婦？",
        "translation": "What are their sisters and wives?",
        "source": "T02n0143_001:0866b16_55"
    },
    {
        "source_sentence": "妹婦者，承事夫婿盡其敬誠，若如兄弟同氣分形，骨肉至親無有二情，",
        "translation": "Sisters and wives should serve their husbands and sons with utmost respect, just as if brothers share the same vitality and form, and there are no two emotions between bones and flesh and relatives.",
        "source": "T02n0143_001:0866b16_56"
    },
    {
        "source_sentence": "尊奉敬之如妹事兄，是為妹婦。",
        "translation": "Venerable and respectful, like a sister serving her brother, this is a sister's wife.",
        "source": "T02n0143_001:0866b18_57"
    },
    {
        "source_sentence": "何等為善知識婦者？",
        "translation": "What's a woman of good knowledge?",
        "source": "T02n0143_001:0866b18_58"
    },
    {
        "source_sentence": "侍其夫婿愛念懇至，依依戀戀不能相棄，私密之事常相告示，見過依呵令行無失，",
        "translation": "They attend their husband's son-in-law with affection and sincerity, relying on support and attachment that can't be abandoned, always telling each other about private affairs, seeing faults and criticizing one another to make sure they don't do them.",
        "source": "T02n0143_001:0866b19_59"
    },
    {
        "source_sentence": "善事相敬使益明慧，相愛欲令度世如善知識，是為善知識婦。",
        "translation": "Respecting each other for good deeds makes them become more insightful, and they love each other and want to save the world like a good teacher. This is the wife of a good teacher.",
        "source": "T02n0143_001:0866b21_60"
    },
    {
        "source_sentence": "何等為婦婦者？",
        "translation": "What are their wives?",
        "source": "T02n0143_001:0866b22_61"
    },
    {
        "source_sentence": "供養大人竭誠盡敬，承事夫婿謙遜順命，夙興夜寐恭恪言命，口無逸言身無逸行，",
        "translation": "With utmost sincerity and respect, they serve their husbands, sons, and daughters-in-law with humility and obedience. They sleep at night long enough to earnestly express their wishes, without slackening in speech or bodily action.",
        "source": "T02n0143_001:0866b23_62"
    },
    {
        "source_sentence": "有善推讓過則稱己，誨訓仁施勸進為道，心端專一無有分邪，精修婦節終無闕廢，",
        "translation": "If there are those who defer to faults, then they praise themselves. Teaching and instructing kindness, charity, and encouragement are the [way of] enlightenment. Their minds are singleminded and concentrated, without any discriminating error. They diligently cultivate women’s senses with effort, never lacking them.",
        "source": "T02n0143_001:0866b25_0"
    },
    {
        "source_sentence": "進不犯儀退不失禮，唯和為貴，是為婦婦。",
        "translation": "A woman who advances, doesn't violate the precepts, retreats, and doesn't lose their propriety but makes harmony the only thing that's valued as a wife.",
        "source": "T02n0143_001:0866b26_1"
    },
    {
        "source_sentence": "何等為婢婦者？",
        "translation": "What are their maidservants?",
        "source": "T02n0143_001:0866b27_2"
    },
    {
        "source_sentence": "常懷畏慎不敢自慢，兢兢趣事無所避憚，心常恭恪忠孝盡節，言以柔軟性常和穆，",
        "translation": "They are always fearful and cautious, not daring to be self-conceited. They are steadfast in their undertakings and have nothing to fear. Their minds are always respectful, loyal, filial, and observant of the disciplinary rules. With gentle words they speak with a gentle and peaceful voice.",
        "source": "T02n0143_001:0866b28_3"
    },
    {
        "source_sentence": "口不犯麁邪之言，身不入放逸之行，貞良純一質朴直信，恒自嚴整，以禮自將，",
        "translation": "Their speech did not offend against the law of sexual misconduct, and their bodies did not indulge in lazy acts. They were pure and genuine; they believed in simplicity and straightforwardness. They always kept themselves neat and tidy with reverence and self-control.",
        "source": "T02n0143_001:0866c01_4"
    },
    {
        "source_sentence": "夫婿納幸不以憍慢，設不接遇不以為怨，或得捶杖分受不恚，及見罵辱默而不恨，",
        "translation": "The husband's son-in-law accepts the invitation without being conceited, doesn't become enemies if he doesn't meet them, or receives a portion of a beating cane that isn't angry, and doesn't hate when he's insulted and remains silent in silence.",
        "source": "T02n0143_001:0866c02_5"
    },
    {
        "source_sentence": "甘心樂受無有二意，勸進所好不妬聲色，遇己曲薄不訴求直，務修婦節不擇衣食，",
        "translation": "Their minds are receptive to pleasure, without dualistic ideas. They encourage the enjoyment of good things and not jealousy; when confronted by their own weaknesses, they do not complain or seek advantage over others. They cultivate women’s ways but do not choose clothing or food.",
        "source": "T02n0143_001:0866c04_6"
    },
    {
        "source_sentence": "專精恭恪唯恐不及，敬奉夫婿婢事大家，是為婢婦。",
        "translation": "I'm afraid they won't be able to honor their husbands, sons, maidservants, and all the people who serve them, which is called a maidservant.",
        "source": "T02n0143_001:0866c06_7"
    },
    {
        "source_sentence": "何等為怨家婦者？",
        "translation": "What are their enemies' wives?",
        "source": "T02n0143_001:0866c07_8"
    },
    {
        "source_sentence": "見夫不歡恒懷瞋恚，晝夜思念欲得解離，無夫婦心常如寄客，狺狺鬪諍無所畏忌，",
        "translation": "They see their husbands not rejoicing but always harboring anger. Day and night they think of each other, wishing to be freed from the bonds of enmity. Their minds are neither married nor unmarried, just as if they were sending a guest. They engage in arguments and battles without fear or anxiety.",
        "source": "T02n0143_001:0866c08_9"
    },
    {
        "source_sentence": "亂頭墜臥不可作使，不念治家養活兒子，或行婬蕩不知羞恥，狀如犬畜毀辱親里，",
        "translation": "They don't think of governing their family and raising their children, or they may engage in sexual misconduct without knowing shame, resembling dogs and animals that disparage their relatives.",
        "source": "T02n0143_001:0866c10_10"
    },
    {
        "source_sentence": "譬如怨家，是為怨家婦。",
        "translation": "It's like a wife of a grudge family who's a wife of a grudge family.",
        "source": "T02n0143_001:0866c12_11"
    },
    {
        "source_sentence": "何等為奪命婦者？",
        "translation": "What's meant by taking a woman's life?",
        "source": "T02n0143_001:0866c12_12"
    },
    {
        "source_sentence": "晝夜不寐恚心相向，當何方便得相遠離？",
        "translation": "Day and night, they don't sleep or sleep, but their minds are directed toward each other, so what method will they use to attain separation?",
        "source": "T02n0143_001:0866c13_13"
    },
    {
        "source_sentence": "欲與毒藥恐人覺知，或至親里遠近寄之，作是瞋恚常共賊之，若持寶物雇人害之，",
        "translation": "They want to give poison and medicine, fearing that people will realize it. Or they may send it to their relatives from near or far who become angry and always share the thief's possessions with them. If they hire someone else to harm them with their treasures,",
        "source": "T02n0143_001:0866c14_14"
    },
    {
        "source_sentence": "或使傍夫伺而殺之，怨抂夫命，是為奪命婦。",
        "translation": "Or they may cause an unenlightened man to look for them and kill them, or resent the husband's life, which is a woman who snatches away his life.",
        "source": "T02n0143_001:0866c16_15"
    },
    {
        "source_sentence": "是為七輩婦。」",
        "translation": "These are the seven groups of women.",
        "source": "T02n0143_001:0866c17_16"
    },
    {
        "source_sentence": "玉耶默然。",
        "translation": "Yao remained silent.",
        "source": "T02n0143_001:0866c17_17"
    },
    {
        "source_sentence": "佛告玉耶：「五善婦者常有顯名，言行有法眾人愛敬，宗親九族並蒙其榮，",
        "translation": "The Buddha said to the crown prince, “The five kinds of wives are always renowned for their virtue. They practice what they preach and uphold the Dharma with affection and reverence from all the people who belong to the nine classes of Buddhist followers.",
        "source": "T02n0143_001:0866c18_0"
    },
    {
        "source_sentence": "天龍鬼神皆來擁護使不抂撗，萬分之後得生天上七寶宮殿，在所自然侍從左右，",
        "translation": "Deities, dragons, ghosts, and spirits all came to embrace him so that he wouldn't fight. Ten thousand parts later, he'd be born in the seven-jeweled palace up in heaven, where he would naturally follow his left and right.",
        "source": "T02n0143_001:0866c19_1"
    },
    {
        "source_sentence": "壽命延長恣意所欲快樂難言。",
        "translation": "Their life spans are prolonged, and it's difficult to say what they want and enjoy at will.",
        "source": "T02n0143_001:0866c21_2"
    },
    {
        "source_sentence": "天上壽盡下生世間，當為富貴侯王子孫，端正聰慧人所奉尊。",
        "translation": "When the life span of gods in heaven ends, they'll be born in the world below, where they'll be honored by wealthy princes, princes, and grandchildren, upright, intelligent people, and people who serve them.",
        "source": "T02n0143_001:0866c22_3"
    },
    {
        "source_sentence": "其惡婦者常得惡名，令現在身不得安寧，數為惡鬼眾毒所病，臥起不安惡夢驚怖，",
        "translation": "That evil wife always gets a bad reputation, causing her body not to be at peace in the present life. She is frequently sick by the poison of ghosts and demons, lying down and waking uncomfortably, having nightmares and fearful dreams.",
        "source": "T02n0143_001:0866c23_4"
    },
    {
        "source_sentence": "所願不得多逢災撗，萬分之後魂神受形，當入地獄餓鬼畜生，展轉三塗累劫不竟。」",
        "translation": "Their wishes won't be met with many calamities, and after ten thousand parts, their souls and spirits will receive form, and they'll go to hell, hungry ghosts, animals, and the three destinies will continue for a long time without end.",
        "source": "T02n0143_001:0866c25_5"
    },
    {
        "source_sentence": "佛告玉耶：「是七輩婦汝欲行何？」",
        "translation": "The Buddha told Yuye, What do you want to do with these seven groups of women?",
        "source": "T02n0143_001:0866c28_0"
    },
    {
        "source_sentence": "玉耶流涕前白佛言：「我心愚癡無智所作，自今以後改往修來，當如婢婦，",
        "translation": "Yao wept and said to the Buddha: My mind is ignorant and unintelligent. From now on I will change my ways of going and coming, just like a maidservants’ wife.",
        "source": "T02n0143_001:0866c28_1"
    },
    {
        "source_sentence": "奉事妐姑夫婿，盡我壽命不敢憍慢。」",
        "translation": "They serve their aunt's husband and son-in-law, and they don't dare to be conceited for the rest of my life.",
        "source": "T02n0143_001:0867a01_2"
    },
    {
        "source_sentence": "佛告玉耶：「善哉！",
        "translation": "The Buddha told Yuye, Good!",
        "source": "T02n0143_001:0867a02_3"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T02n0143_001:0867a02_4"
    },
    {
        "source_sentence": "人誰無過？",
        "translation": "Who is without fault?",
        "source": "T02n0143_001:0867a02_5"
    },
    {
        "source_sentence": "能改者，善莫大焉。」",
        "translation": "Those who can change it, don't be greatly good.",
        "source": "T02n0143_001:0867a02_6"
    },
    {
        "source_sentence": "玉耶即前請受十戒為優婆夷。",
        "translation": "Yao then asked him to accept the ten precepts as a layman.",
        "source": "T02n0143_001:0867a03_7"
    },
    {
        "source_sentence": "佛告玉耶：「持一戒者、不得殺生，二者、不得偷盜取他人財物，三者、不得婬他男子，",
        "translation": "The Buddha told Yao, A person who observes one precept doesn't allow him to kill people; two, he doesn't steal the property of others; and three, he doesn't deceive other men.",
        "source": "T02n0143_001:0867a04_8"
    },
    {
        "source_sentence": "四者、不得飲酒，五者、不得妄語，六者、不得惡罵，七者、不得綺語，",
        "translation": "4. They mustn't drink alcohol, 5. They mustn't lie, 6. They mustn't abuse others, and 7. They mustn't talk fancyly.",
        "source": "T02n0143_001:0867a06_0"
    },
    {
        "source_sentence": "八者、不得嫉妬，九者、不得瞋恚，十者、當信作善得福作惡得罪。",
        "translation": "Eight, they mustn't be jealous, nine, don't become angry, and ten, they must believe that doing good will bring merit and doing evil will bring sin.",
        "source": "T02n0143_001:0867a07_1"
    },
    {
        "source_sentence": "信佛信法信比丘僧，是為十戒優婆夷法，終身奉行不敢違犯。」",
        "translation": "Believing in the Buddha's faith in the Dharma and believing in monks and nuns, these are the ten precepts for laymen who uphold them throughout their lives and don't dare to violate them.",
        "source": "T02n0143_001:0867a08_2"
    },
    {
        "source_sentence": "佛說經已，諸弟子皆悉作禮。",
        "translation": "After the Buddha taught the sūtra, all the disciples paid homage.",
        "source": "T02n0143_001:0867a10_3"
    },
    {
        "source_sentence": "給孤長者姑妐大小及其玉耶，盡行澡水供養佛百味飲食。",
        "translation": "He gave the orphaned elder's aunt, large and small, as well as their jade treasures, all the water they practiced to offer the Buddha a hundred flavors of food and drink.",
        "source": "T02n0143_001:0867a11_0"
    },
    {
        "source_sentence": "佛告玉耶：「當信布施常得其福德，後世當復生長者家。」",
        "translation": "The Buddha told Yao, You should believe that generosity will always attain its merits, and in a later life you'll be born again in the home of someone who gives.",
        "source": "T02n0143_001:0867a12_1"
    },
    {
        "source_sentence": "玉耶言：「諾。」",
        "translation": "Yao said, Yes.",
        "source": "T02n0143_001:0867a13_2"
    },
    {
        "source_sentence": "佛飯畢竟，噠嚫呪願：「五十善神擁護汝身。」",
        "translation": "After the Buddha's meal was over, he burned a mantra and vowed, Fifty good spirits will protect you.",
        "source": "T02n0143_001:0867a13_3"
    },
    {
        "source_sentence": "佛告玉耶：「勤念經戒。」",
        "translation": "The Buddha told Yuye, Be diligent in reciting the sūtras and precepts.",
        "source": "T02n0143_001:0867a14_4"
    },
    {
        "source_sentence": "玉耶言：「我蒙佛恩得聞經法。」",
        "translation": "Yao said, I've been blessed by the Buddha to hear the sūtras and teachings.",
        "source": "T02n0143_001:0867a15_5"
    },
    {
        "source_sentence": "皆前為佛作禮而退。",
        "translation": "They all previously paid homage to the Buddha and withdrew.",
        "source": "T02n0143_001:0867a16_6"
    },
    {
        "source_sentence": "玉耶經",
        "translation": "Yao jing",
        "source": "T02n0143_001:0867a17_0"
    }
]