[
    {
        "source_sentence": "佛說三摩竭經",
        "translation": "Samādhi-sūtra Spoken by the Buddha",
        "source": "T02n0129_001:0843a25_0"
    },
    {
        "source_sentence": "吳天竺沙門竺律炎譯",
        "translation": "Wu Tianzhusheng shaman Zhu Luyan translated it",
        "source": "T02n0129_001:0843a27_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園，與千二百五十比丘、五百菩薩俱，",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, accompanied by one thousand two hundred and fifty bhikṣus and five hundred bodhisattvas.",
        "source": "T02n0129_001:0843a28_0"
    },
    {
        "source_sentence": "帝王人民及諸天龍鬼神無復央數。",
        "translation": "The emperor, the people, gods, dragons, ghosts, and spirits are countless.",
        "source": "T02n0129_001:0843a29_1"
    },
    {
        "source_sentence": "爾時，有難國王名分陂檀，不信佛法但好外道，日於宮中飯諸尼揵萬餘人。",
        "translation": "At the time, there was a king named Pūrvapāda in the kingdom of Nanda who didn't believe in the Buddha's teaching but preferred non-Buddhists. Every day he fed more than ten thousand nuns and nuns in his palace.",
        "source": "T02n0129_001:0843b01_2"
    },
    {
        "source_sentence": "難國王常喜貢高，自謂智慧無雙，以鐵鍱其腹，常恐智慧從腹橫出。",
        "translation": "The king of the kingdom of Nanda always cherished pride and pride, claiming that his wisdom was peerless. He pierced his belly with an iron butchering sleeve in fear that his wisdom might come out of his belly.",
        "source": "T02n0129_001:0843b03_3"
    },
    {
        "source_sentence": "王欲為其太子娶婦，即問左右群臣：「天下寧有智慧如我者不？",
        "translation": "The king wanted to marry the prince's wife, so he asked his left and right ministers, Would anyone in the world have wisdom like mine?",
        "source": "T02n0129_001:0843b04_4"
    },
    {
        "source_sentence": "若有者，我欲為子娶其女。」",
        "translation": "If there is, I want to marry that woman for my child.",
        "source": "T02n0129_001:0843b06_5"
    },
    {
        "source_sentence": "大臣便受王教，即遍至國中求索，了無有如王，亦自知國中無有，即更遣使者行到他國，",
        "translation": "Then the minister, having received the king’s instruction, went to all the countries of the empire to solicit money. He understood that there was nothing like the king and also knew for himself that there was nothing in his country. So he sent another messenger to go to another country.",
        "source": "T02n0129_001:0843b06_6"
    },
    {
        "source_sentence": "求索智士女。",
        "translation": "He asked the wise man to ask for a woman.",
        "source": "T02n0129_001:0843b08_7"
    },
    {
        "source_sentence": "爾時，使者即受王教，便至舍衛國，使者便問國中人民：「是國中寧有好道賢者不乎？」",
        "translation": "At that point, the messenger then accepted the king's instruction and went to Śrāvastī, and the messenger asked the people of his country, Is there a good man of the Way in this country?",
        "source": "T02n0129_001:0843b09_8"
    },
    {
        "source_sentence": "人答言：「有。」",
        "translation": "The people replied, Yes.",
        "source": "T02n0129_001:0843b11_0"
    },
    {
        "source_sentence": "使者言：「姓字何等？」",
        "translation": "The messenger said, What's your name?",
        "source": "T02n0129_001:0843b11_1"
    },
    {
        "source_sentence": "人報言：「字為佛。」",
        "translation": "The people replied, His name is Buddha.",
        "source": "T02n0129_001:0843b11_2"
    },
    {
        "source_sentence": "使者言：「佛寧有女無？」",
        "translation": "The envoy said, How could the Buddha have a woman?",
        "source": "T02n0129_001:0843b12_3"
    },
    {
        "source_sentence": "人言：「佛者道人也，無有女。」",
        "translation": "The people said, Buddha is a man of the Way, and there's no woman.",
        "source": "T02n0129_001:0843b12_4"
    },
    {
        "source_sentence": "使者言：「次復有誰人？」",
        "translation": "The envoy said, Next, who will there be?",
        "source": "T02n0129_001:0843b13_5"
    },
    {
        "source_sentence": "答言：「復有人字阿難邠坻，大賢善好道，有好女，國中第一。」",
        "translation": "He replied, Again, there's someone named Ānanda, a great sage and good man of the Way who has good qualities and is the best among women in the country.",
        "source": "T02n0129_001:0843b13_6"
    },
    {
        "source_sentence": "使者言：「何用為第一？」",
        "translation": "The messenger said, What's the first?",
        "source": "T02n0129_001:0843b14_7"
    },
    {
        "source_sentence": "國中人言：「曾與太子祇共請買園田八十頃持上佛，復以象負運黃金數千萬億持雇園田，",
        "translation": "The people of the country said, “Formerly I was invited by Prince Jeta to buy a plot of land for eighty yojanas from you.",
        "source": "T02n0129_001:0843b15_8"
    },
    {
        "source_sentence": "不貪重寶但念為善耳。」",
        "translation": "They don't crave precious treasures but think of them as good.",
        "source": "T02n0129_001:0843b17_9"
    },
    {
        "source_sentence": "使者聞國中人言，大歡喜，自知以得消息，即還本國白王言：「迺舍衛國中有賢善者大好道，",
        "translation": "The envoy heard the words of the people of his country and was greatly delighted. Knowing this news, he returned to his own country and reported it to the king, saying: In the country of Vaiśālī there is a good man named Mahāprajāpatīṃdhara Bodhisattva.",
        "source": "T02n0129_001:0843b18_0"
    },
    {
        "source_sentence": "字阿難邠坻。」",
        "translation": "He's called Ānanda.",
        "source": "T02n0129_001:0843b20_1"
    },
    {
        "source_sentence": "難國王聞使者言，便作書即遣太子與群臣百官，嚴駕載珍寶，俱相隨到舍衛國，",
        "translation": "The king of the country of Nanda, hearing what the messenger said, wrote a letter to the crown prince and his ministers and hundreds of officials, arriving at Sāvatthī in their carriages carrying precious treasures.",
        "source": "T02n0129_001:0843b20_2"
    },
    {
        "source_sentence": "止頓太子著城外，使人便入城至阿難邠坻舍。",
        "translation": "The prince Zhiding stayed outside the city, and his envoy went into the city to Ānanda's house.",
        "source": "T02n0129_001:0843b22_3"
    },
    {
        "source_sentence": "時守門者，便入白阿難邠坻：「外有使者來。」",
        "translation": "The gatekeeper then entered and said to Ānanda, There's an envoy coming from outside.",
        "source": "T02n0129_001:0843b23_4"
    },
    {
        "source_sentence": "阿難邠坻即自出應門，見使者黑醜如鬼，阿難邠坻大驚言：「汝何等人乎？」",
        "translation": "Ānanda then went out of his own door and saw that the messengers were black and ugly like ghosts, and Ānanda was so startled that he said, Who are you people?",
        "source": "T02n0129_001:0843b24_5"
    },
    {
        "source_sentence": "即答言：「我是難國王使者。」",
        "translation": "He replied, I'm the envoy of the king of Nālandā.",
        "source": "T02n0129_001:0843b25_6"
    },
    {
        "source_sentence": "阿難邠坻言：「卿來欲何等求？」",
        "translation": "Ānanda asked, What do you want from me?",
        "source": "T02n0129_001:0843b26_7"
    },
    {
        "source_sentence": "使者言：「我來宣傳教命，難國王雖不相見，遙相愛敬，人每往來歌歎卿功德無有量，",
        "translation": "The envoy said, “I am here to proclaim your instruction. Although the kings of the troubled countries have not seen each other, they love and venerate one another from a distance. Every time people come to praise you with song and dance in admiration of immeasurable virtue.",
        "source": "T02n0129_001:0843b27_8"
    },
    {
        "source_sentence": "聞君賢善大好道，有女，故來欲為太子求君女，王亦自有書相聞。」",
        "translation": "I've heard that you're a good man of great learning who has a woman and therefore wants to seek the prince's courtesy, and the king himself has written about it.",
        "source": "T02n0129_001:0843b28_9"
    },
    {
        "source_sentence": "阿難邠坻即欲罵之，便自忍而不言，便呼前共坐，相問訊談語，使者便以書視之。",
        "translation": "Ānanda then wanted to scold him, so he forbade himself and didn't say anything. So he summoned them to sit together in front of him, exchanged greetings and conversations, and the messenger looked at him with a letter.",
        "source": "T02n0129_001:0843c01_10"
    },
    {
        "source_sentence": "阿難邠坻即讀書訖竟，答使者言：「我有大人當往報之，若聽我者，我當還語卿消息。」",
        "translation": "Ānanda then completed his studies and answered the messenger, saying, I have an elder who will report back to you; if he hears me, I'll return with your message.",
        "source": "T02n0129_001:0843c03_11"
    },
    {
        "source_sentence": "便留坐使者，阿難邠坻便到佛所，即前為佛作禮，却長跪叉手白佛言：「今難國王遣使者來到我家，",
        "translation": "Ānanda came before the Buddha. Having saluted him, he knelt down with his palms joined together and said to him: The king of the country of Nanda is sending a messenger to my house.",
        "source": "T02n0129_001:0843c05_12"
    },
    {
        "source_sentence": "其人狀類黑如鬼，辭言，欲為王太子求我女三摩竭，今當云何？」",
        "translation": "That man was black in color like a ghost, and he said, What will I do now if I want to ask the prince king for my daughter's samādhi?",
        "source": "T02n0129_001:0843c07_13"
    },
    {
        "source_sentence": "佛言：「與之。」",
        "translation": "The Buddha said, Give it to him.",
        "source": "T02n0129_001:0843c08_14"
    },
    {
        "source_sentence": "阿難邠坻言：「使者黑如鬼，其王太子當何類？",
        "translation": "Ānanda said, The messenger is black like a ghost, so what kind should the prince be?",
        "source": "T02n0129_001:0843c09_0"
    },
    {
        "source_sentence": "我復曾從佛聞，難國王但事諸尼揵，裸形無有衣被，狀類醜黑，驚怖我女耶？」",
        "translation": "Again, I've heard from the Buddha that the king of Nālandā merely serves nuns and nuns, is naked without a robe or covering, has an ugly black appearance, and is frightened by my daughter?",
        "source": "T02n0129_001:0843c10_0"
    },
    {
        "source_sentence": "佛言：「不也，與之，當知是因緣，三摩竭應當於裸形國度脫八萬人。」",
        "translation": "The Buddha said, No, give it to him; you should know that this is the cause and condition for samāgata to liberate 80,000 people in the naked land.",
        "source": "T02n0129_001:0843c11_1"
    },
    {
        "source_sentence": "阿難邠坻不敢復問佛，心懷恨意，即還歸謂使者言：「卿奉王教命，故從遠來求索我女，",
        "translation": "Ānanda did not dare to question the Buddha again. With a feeling of hatred toward him, he returned home and said to the messenger, “Dear king, you have come from a distant land to ask me for my daughter.",
        "source": "T02n0129_001:0843c13_2"
    },
    {
        "source_sentence": "大善，當相與。」",
        "translation": "Great goodness, you'll give it to him.",
        "source": "T02n0129_001:0843c15_3"
    },
    {
        "source_sentence": "使者聞阿難邠坻言，即還到城外至太子所，便與太子相隨來，到阿難邠坻舍。",
        "translation": "Hearing Ānanda’s words, the messenger returned out of the city and arrived at the prince’s place. They came together with the prince and went to Ānanda’s chamber.",
        "source": "T02n0129_001:0843c15_4"
    },
    {
        "source_sentence": "即從車上下，金銀及禮娉與阿難邠坻，便共請人客，飲食相娛樂七日訖竟，",
        "translation": "He immediately descended from the carriage and went up and down. The gold, silver, and scrip­ tion were given to Ānanda as a gift. They invited all the guest-accompaniments together for seven days with food and drink and entertainment.",
        "source": "T02n0129_001:0843c17_5"
    },
    {
        "source_sentence": "阿難邠坻遣送三摩竭，奴婢衣服及與珍寶無復央數，太子便載三摩竭去還歸本國。",
        "translation": "Ānanda sent the samāgata, his servants and maidservants, their clothing, and other treasures in an uncountable number, and the prince carried the samāgata back and forth to his native land.",
        "source": "T02n0129_001:0843c18_6"
    },
    {
        "source_sentence": "爾時，難國王見子婦來歸即大歡喜，便請其師尼揵若陀弗及萬二千弟子，",
        "translation": "At that time the king of [Apara]godānīya, greatly delighted to see his son and wife returning home, invited their teacher Nirgrantha Devaputra and twelve thousand disciples.",
        "source": "T02n0129_001:0843c21_0"
    },
    {
        "source_sentence": "悉入宮飯之，難國王夫人及太子悉下飯具。",
        "translation": "They all entered the palace to feed him, and the king's wife and prince of Nālandā went down with food provisions.",
        "source": "T02n0129_001:0843c22_1"
    },
    {
        "source_sentence": "爾時，呼三摩竭來出，欲令下飯分共禮諸師。",
        "translation": "It was then that he summoned Samāgata to come out and wanted to let him go down to pay homage to the masters with a share of his meal.",
        "source": "T02n0129_001:0843c23_2"
    },
    {
        "source_sentence": "三摩竭適至第三門中，遙見諸尼揵悉羅坐裸形無有衣被，三摩竭即大驚，",
        "translation": "When Samāgata arrived at the third gate, he saw the Nirgranthas from a distance sitting naked with no clothes or coverlets.",
        "source": "T02n0129_001:0843c24_3"
    },
    {
        "source_sentence": "是為狗畜生無有異，便兩手覆面遙唾之，即還入室不肯復出。",
        "translation": "That's because the dog and animals are no different, so he covers them with both hands and spits at them from a distance.",
        "source": "T02n0129_001:0843c26_4"
    },
    {
        "source_sentence": "諸尼揵皆瞋恚三摩竭所，即告王言：「從何得此熒惑不吉利之人在王宮？",
        "translation": "The nuns and nuns were all angry at the samāgata's place, and they said to the king, How did you get this person who's deluded and unfortuneful in the king's palace?",
        "source": "T02n0129_001:0843c27_5"
    },
    {
        "source_sentence": "促遣令去，若不遣去者，當壞敗王國中。」",
        "translation": "Urge them to leave, and if they don't leave, the kingdom will be destroyed and defeated.",
        "source": "T02n0129_001:0843c29_6"
    },
    {
        "source_sentence": "諸尼揵不肯復飯食，即欲起去，王便辭謝諸師：「我當為大師遣去，明日不復令現於宮中。」",
        "translation": "The nuns were unwilling to resume their food and wanted to get up and leave, so the king withdrew and apologized to the masters, saying, I will send you away for the sake of the great teacher, and you won't be allowed to appear in the palace again tomorrow.",
        "source": "T02n0129_001:0844a01_7"
    },
    {
        "source_sentence": "諸尼揵及飯食訖便去。",
        "translation": "After the nuns had eaten their rice and food, they left.",
        "source": "T02n0129_001:0844a03_8"
    },
    {
        "source_sentence": "即日太子自往至三摩竭所，三摩竭時大瞋恚，教婢令閉門，如是四五日，",
        "translation": "On the same day, the prince went on his way to Sāmaṅga. At that time he became greatly angry and instructed the maidservants to shut the doors of the monastery. So it was for four or five days.",
        "source": "T02n0129_001:0844a03_9"
    },
    {
        "source_sentence": "太子不敢復往。",
        "translation": "The prince didn't dare to go back.",
        "source": "T02n0129_001:0844a05_10"
    },
    {
        "source_sentence": "夫人即問太子：「何故不往？」",
        "translation": "The lady asked the prince, Why won't you go?",
        "source": "T02n0129_001:0844a05_11"
    },
    {
        "source_sentence": "太子默聲不言，夫人以知之，即自往到三摩竭所。",
        "translation": "The prince remained silent and did not say anything. Knowing this, the queen went her own way to Samāgata’s place.",
        "source": "T02n0129_001:0844a06_12"
    },
    {
        "source_sentence": "「我為子娶若，今當承事我子，何故折辱我子？」",
        "translation": "If I were to marry my son, why would I humiliate my son if he were to serve me now?",
        "source": "T02n0129_001:0844a07_13"
    },
    {
        "source_sentence": "三摩竭答言：「夫人子所事師及國中人民，皆如狗畜生無有異。」",
        "translation": "Samāgata answered, The teacher whom the wife serves and the people of the country are all like dogs and animals without any difference.",
        "source": "T02n0129_001:0844a08_14"
    },
    {
        "source_sentence": "夫人聞之大慚愧，即還白王言：「大王！",
        "translation": "The queen was greatly embarrassed when she heard this and returned to the king, saying, Great king!",
        "source": "T02n0129_001:0844a10_15"
    },
    {
        "source_sentence": "自用道智無雙，國中無有可王意者，王迺勞群臣八千里求婦。",
        "translation": "Because there was no one in the kingdom who agreed with the king's wishes, the king then asked his ministers to go 8,000 miles to search for a woman.",
        "source": "T02n0129_001:0844a10_16"
    },
    {
        "source_sentence": "今婦無所畏難，折辱我子，復面罵我，言比狗畜生。」",
        "translation": "Now, the woman has no fear and doesn't harm my child, but she insults me with her face and scolds me, saying it's like a dog or an animal.",
        "source": "T02n0129_001:0844a12_17"
    },
    {
        "source_sentence": "王聞夫人言，即自往到三摩竭所。",
        "translation": "The king heard the queen’s words and went to Samāgata’s quarters on his own.",
        "source": "T02n0129_001:0844a13_18"
    },
    {
        "source_sentence": "爾時，三摩竭大憍慢，不肯出為王作禮。",
        "translation": "At the time, Samāgata was greatly embarrassed and refused to go out to pay homage to the king.",
        "source": "T02n0129_001:0844a14_19"
    },
    {
        "source_sentence": "王即遙問三摩竭：「我行八千里娶若，以賢善故。",
        "translation": "The king then asked the samāgata from a distance, I'll go 8,000 miles to marry him because he's good and good.",
        "source": "T02n0129_001:0844a15_20"
    },
    {
        "source_sentence": "若間者既辱我師，今復面罵夫人及太子，豈有不可乎？」",
        "translation": "If someone in between insults my teacher and now ridicules the wife and prince with their faces, isn't that possible?",
        "source": "T02n0129_001:0844a16_21"
    },
    {
        "source_sentence": "三摩竭報言：「然。",
        "translation": "Samāgata replied, Yes.",
        "source": "T02n0129_001:0844a17_22"
    },
    {
        "source_sentence": "大王師及夫人太子并其國中人民，皆如狗畜生無異。」",
        "translation": "The great king's teacher, the prince of his wife, and the people of his country are all like dogs and animals without difference.",
        "source": "T02n0129_001:0844a17_23"
    },
    {
        "source_sentence": "王即驚言：「是小女子！",
        "translation": "The king was startled and said, Yes, little woman!",
        "source": "T02n0129_001:0844a19_0"
    },
    {
        "source_sentence": "今折辱我如是，我恐智從腹中橫出以鐵鍱我腹，我日飯諸道士萬餘人，",
        "translation": "Now that you have humiliated me like this, I am afraid my knowledge will come out of my abdomen and pierce my belly with an iron ball.",
        "source": "T02n0129_001:0844a19_1"
    },
    {
        "source_sentence": "誰能及我者？",
        "translation": "Who can surpass me?",
        "source": "T02n0129_001:0844a21_2"
    },
    {
        "source_sentence": "今汝交面相罵？」",
        "translation": "Now, you're cursing each other face to face?",
        "source": "T02n0129_001:0844a21_3"
    },
    {
        "source_sentence": "三摩竭言：「王國中人民所事師，常無有衣裳裸形相視，當有何等道？",
        "translation": "Sāmaṅga said, The kingdom's teachers served by the people always had no clothes or clothing to look at each other naked, so what path would there be?",
        "source": "T02n0129_001:0844a21_4"
    },
    {
        "source_sentence": "設使有道，尚不足以貴，何況無道？",
        "translation": "Even if there were a path, it wouldn't be enough to value it, so why wouldn't there be no path?",
        "source": "T02n0129_001:0844a23_5"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T02n0129_001:0844a24_6"
    },
    {
        "source_sentence": "雖日飯是輩萬餘人者，皆是我所不恭敬輩，常唾賤者。」",
        "translation": "Even though there are more than ten thousand people in this group who eat every day, they're all selfless and disrespectful to me, and I always spit at those who despise me.",
        "source": "T02n0129_001:0844a24_7"
    },
    {
        "source_sentence": "爾時，難國王大窮，即自思惟：「當共誰議是事？」",
        "translation": "It was then that the king of Nālandā became greatly impoverished and thought to himself, Who will discuss this matter with me?",
        "source": "T02n0129_001:0844a25_8"
    },
    {
        "source_sentence": "即自往到尼揵若陀弗所，前為師作禮白言：「我娶婦以於舍衛國得婦，",
        "translation": "He went on his way to Nirgrantha Devaputra, paid his respects to the teacher, and said, “I married my wife in order to obtain a wife in Sāvatthī.",
        "source": "T02n0129_001:0844a26_9"
    },
    {
        "source_sentence": "間者無狀，既折辱大師，今復憍慢面罵我及夫人太子，比狗畜生。",
        "translation": "The intermediate monk has no form, and now that he's humiliated the great teacher, he's arrogant and verbally abused me and my wife and prince, comparing them to dogs and animals.",
        "source": "T02n0129_001:0844a28_10"
    },
    {
        "source_sentence": "雖是婦，不以婦禮事我，今當云何？」",
        "translation": "Even though she's a woman, she doesn't serve me with women; what will I do now?",
        "source": "T02n0129_001:0844a29_11"
    },
    {
        "source_sentence": "師告王：「復往問之，言：『汝國中人民所事，何如我國中人民所事？』",
        "translation": "The teacher told the king, Again, go and ask him, saying, 'What's the business of the people in your country? What's the business of the people in my country?'",
        "source": "T02n0129_001:0844b01_12"
    },
    {
        "source_sentence": "如何等言。",
        "translation": "How can we say that it's equal?",
        "source": "T02n0129_001:0844b02_13"
    },
    {
        "source_sentence": "王往，慎勿得瞋怒，徐問之，自當有語。」",
        "translation": "When the king goes there, be careful not to get angry; ask him slowly and quietly, for he will have something to say.",
        "source": "T02n0129_001:0844b03_0"
    },
    {
        "source_sentence": "王即受教，如師所言，便至三摩竭所問言：「汝國中人民所事，何用勝我國中人民所事？」",
        "translation": "The king then accepted the teaching, followed what his teacher had told him, and went to Samāgata and asked, What's the use of doing for the people in your country if they want to be superior to the people in my country?",
        "source": "T02n0129_001:0844b03_1"
    },
    {
        "source_sentence": "三摩竭言：「我國中人民所事最尊，男女皆有衣裳，尊卑異路，身體不相見。",
        "translation": "Sāmaṅga said, The people in my country serve the most honored ones, and men and women have robes and clothing; the noble and the humble go different ways, but their bodies don't see each other.",
        "source": "T02n0129_001:0844b05_2"
    },
    {
        "source_sentence": "現有大小名佛，教授數千億萬人，皆令得度世泥洹道，入火不燒、入水不溺。",
        "translation": "There are also buddhas of great and small name who teach thousands of koṭis of myriads of koṭis of people, all enabling them to attain the path of world-transcending nirvāṇa, entering fire without being burned and entering water without being submerged.",
        "source": "T02n0129_001:0844b07_3"
    },
    {
        "source_sentence": "能典攬三千大千日月、萬二千億天地，變化入無間出無孔，知當來過去今現在事，",
        "translation": "They can embrace three thousand great one-thousand suns, moons, and twelve thousand myriads of koṭis of celestial bodies; their emanations enter and emerge without interruption. They know the future, past, present, and future events.",
        "source": "T02n0129_001:0844b09_4"
    },
    {
        "source_sentence": "身有三十二相、八十種好，道德通達，諸天帝王人民雜會稽首來謁。」",
        "translation": "His body has the thirty-two marks and eighty kinds of beauty, and his morality is so penetrating that gods, kings, and people gather together to pay homage and come to him.",
        "source": "T02n0129_001:0844b11_0"
    },
    {
        "source_sentence": "王聞三摩竭語，即大踊躍歡喜。",
        "translation": "The king heard the words of Samantabhadra and jumped up and down in great joy.",
        "source": "T02n0129_001:0844b12_1"
    },
    {
        "source_sentence": "爾時，難國王告三摩竭言：「汝所事佛，寧可得見不？」",
        "translation": "It was then that the king of Nanda addressed Samāgata, saying, Would you like to see the Buddha whom you serve?",
        "source": "T02n0129_001:0844b14_0"
    },
    {
        "source_sentence": "三摩竭言：「我能為大王遙請之，即可致。」",
        "translation": "The samāgata said, I can invite him from a distance for the great king and bring him here.",
        "source": "T02n0129_001:0844b15_1"
    },
    {
        "source_sentence": "王言：「大善！",
        "translation": "The king said, Great good!",
        "source": "T02n0129_001:0844b16_0"
    },
    {
        "source_sentence": "迺相去八千里，請佛當云何？」",
        "translation": "What will happen if we go 8,000 miles away from each other and invite the Buddha?",
        "source": "T02n0129_001:0844b16_1"
    },
    {
        "source_sentence": "三摩竭言：「不須大王遣人請，但當至意遙燒香請也。",
        "translation": "Sāmaṅga said, It's not necessary for the king to send someone to invite him, but he should wholeheartedly burn incense and invite it from a distance.",
        "source": "T02n0129_001:0844b16_2"
    },
    {
        "source_sentence": "佛神通照知人心中所念，王夫人及太子皆當隨我後。」",
        "translation": "The Buddha's supernormal illumination knows what people think in their minds, and the king's wife and prince will follow me.",
        "source": "T02n0129_001:0844b18_3"
    },
    {
        "source_sentence": "三摩竭即自上高臺上，政服便向舍衛國長跪燒香，持頭面著地作禮言：「今難國王，",
        "translation": "Samāgata then ascended from the high terrace and, dressed in formal clothing, knelt down toward the king of Sāvatthī to burn incense, touched his forehead and face to the ground, and bowed respectfully, saying:",
        "source": "T02n0129_001:0844b19_4"
    },
    {
        "source_sentence": "不知天下有佛，當用一切人民故，哀悲諸懃苦，願佛明旦與諸比丘僧，",
        "translation": "I do not know that there is a buddha in the world who should use all sentient beings to grieve for their pain and suffering. May the Buddha give it to the monks and nuns tomorrow morning!",
        "source": "T02n0129_001:0844b21_5"
    },
    {
        "source_sentence": "勞屈尊神來到難國王所飯。」",
        "translation": "It's because the venerable spirit of labor came to the king of Nandika and fed him.",
        "source": "T02n0129_001:0844b22_6"
    },
    {
        "source_sentence": "言適竟，香煙便達佛所，遶佛三匝於佛上化作香蓋。",
        "translation": "After he finished speaking, the incense smoke then reached the Buddha and circled him three times to make a fragrant canopy over him.",
        "source": "T02n0129_001:0844b23_7"
    },
    {
        "source_sentence": "佛時適為無數千人說法，爾時，阿難前長跪叉手白佛言：「是何等感應迺爾？",
        "translation": "When the Buddha was teaching the Dharma for countless thousands of people, Ānanda knelt down in front of him and saluted him with his palms joined together, saying, What's your response?",
        "source": "T02n0129_001:0844b24_8"
    },
    {
        "source_sentence": "願佛解說其意。」",
        "translation": "May the Buddha understand and explain his meaning.",
        "source": "T02n0129_001:0844b26_9"
    },
    {
        "source_sentence": "佛告阿難：「難國王及三摩竭，明旦當請佛及諸比丘僧。",
        "translation": "The Buddha told Ānanda, King Nanda and the samāgata will invite the Buddha and the monks tomorrow morning.",
        "source": "T02n0129_001:0844b26_10"
    },
    {
        "source_sentence": "三摩竭有至心，欲令難國人民悉捨邪見、令向正道，香來至此請佛。」",
        "translation": "The samāgata has an earnest mind that wants to cause the people of a difficult country to abandon wrong views and lead them to the right path, so fragrance comes here to invite the Buddha.",
        "source": "T02n0129_001:0844b28_0"
    },
    {
        "source_sentence": "爾時，即告摩訶目揵連勅諸比丘僧，明旦當到難國三摩竭所食。",
        "translation": "It was then that he told Mahāmaudgalyāyana to command the monks and nuns, who were about to go to the country of Nanda tomorrow morning to eat at Samāgata's place.",
        "source": "T02n0129_001:0844b29_1"
    },
    {
        "source_sentence": "摩訶目連受佛教，即宣語諸比丘：「明日當就請，勿得他餘行。」",
        "translation": "Mahāmaudgalyāyana accepted the Buddha's teaching and declared to the monks, Tomorrow, you must go and invite him, so that you won't get anything else to do.",
        "source": "T02n0129_001:0844c02_2"
    },
    {
        "source_sentence": "於是三摩竭，皆令王、夫人、太子及諸婇女，齋戒燒香布坐席，設飯食具悉辦。",
        "translation": "At that samāgata, they all ordered the king, his wife, princes, and court ladies to observe the precepts, burn incense, spread out their seats, set up food and bedding, and prepare them all.",
        "source": "T02n0129_001:0844c03_3"
    },
    {
        "source_sentence": "三摩竭知佛當來，與王、夫人、太子、婇女及諸尼揵共住中庭。",
        "translation": "Knowing the Buddha's future arrival, Samantabhadra and the king, his wife, princes, court ladies, and nuns were staying together in the court.",
        "source": "T02n0129_001:0844c05_4"
    },
    {
        "source_sentence": "三摩竭告王、夫人、太子：「皆隨我後，今諸羅漢當先來至，佛最在後。",
        "translation": "Samantabhadra told the king, his wife, and the princes, They'll all follow me. Now, the arhats will come first, with the Buddha at the back.",
        "source": "T02n0129_001:0844c06_5"
    },
    {
        "source_sentence": "卿曹慎莫驚怖，隨我所為。」",
        "translation": "Don't be frightened, and follow what I do.",
        "source": "T02n0129_001:0844c07_6"
    },
    {
        "source_sentence": "三摩竭於是復長跪燒香言：「飯具已辦，願佛用時。」",
        "translation": "Samāgata then knelt down again and burned the incense, saying, The food preparations have been prepared, so may the Buddha use them.",
        "source": "T02n0129_001:0844c08_7"
    },
    {
        "source_sentence": "佛知三摩竭心所念，即告諸比丘：「今日當到難國食，爾曹各以道變化自在所為。」",
        "translation": "Knowing what samāgata thought in his mind, the Buddha told the monks, Today, you'll go to the difficult country to eat, and you'll each do it freely with the transformation of the path.",
        "source": "T02n0129_001:0844c09_8"
    },
    {
        "source_sentence": "諸比丘即受教，中有化作龍虎鳳凰、孔雀牛鳩鴿、百鳥梟獸交露帳者，",
        "translation": "The monks then accepted the teaching, and some of them were transformed into dragons, tigers, phoenixes, peacocks, cattle, pigeons, hundreds of birds, owls, and beasts.",
        "source": "T02n0129_001:0844c11_9"
    },
    {
        "source_sentence": "諸眾僧悉在其中坐，各各皆不同。",
        "translation": "The saṃgha were all seated there, each different from the other.",
        "source": "T02n0129_001:0844c13_10"
    },
    {
        "source_sentence": "爾時，佛自坐師子交露帳中，即與千二百五十比丘、五百菩薩、諸天鬼神龍俱，",
        "translation": "At that time, the Buddha sat himself in the cross-shaped canopy of a lion. He was accompanied by one thousand two hundred and fifty bhikṣus, five hundred bodhisattvas, gods, ghosts, spirits, and dragons.",
        "source": "T02n0129_001:0844c13_11"
    },
    {
        "source_sentence": "從虛空中神足飛行。",
        "translation": "From space, he flew with supernormal powers.",
        "source": "T02n0129_001:0844c15_12"
    },
    {
        "source_sentence": "適至難國，佛便放光明，天地大震動，諸羅漢菩薩各悉作變化先來下，",
        "translation": "When he arrived in the troubled land, the Buddha emitted a ray of light. The heavens and earth trembled with great trembling; all the arhats and bodhisattvas each manifested their magical emanations just as had been done before.",
        "source": "T02n0129_001:0844c16_13"
    },
    {
        "source_sentence": "難國人民見此變化皆大驚怖。",
        "translation": "The people of the kingdom of Nandika saw this transformation and were all greatly frightened.",
        "source": "T02n0129_001:0844c17_14"
    },
    {
        "source_sentence": "王問三摩竭言：「是佛不也？」",
        "translation": "The king asked the samāgata, Is this the Buddha?",
        "source": "T02n0129_001:0844c18_15"
    },
    {
        "source_sentence": "答言：「非佛。」",
        "translation": "He replied, It's not Buddha.",
        "source": "T02n0129_001:0844c19_0"
    },
    {
        "source_sentence": "三摩竭告王：「勿恐，是諸弟子也。",
        "translation": "Samāgata told the king, Don't be afraid, for these are my disciples.",
        "source": "T02n0129_001:0844c19_1"
    },
    {
        "source_sentence": "佛最在後，身中有三十二相、八十種好。」",
        "translation": "The Buddha is the most late, with thirty-two marks and eighty kinds of beauty in his body.",
        "source": "T02n0129_001:0844c19_2"
    },
    {
        "source_sentence": "須臾之間佛俱從上來下，釋梵四天王在前導，諸天鼓琴作其倡伎而樂佛。",
        "translation": "In a moment, the Buddhas all came from above and came down, with the four heavenly kings of Śakra and Brahmā in front to guide them, and the gods played their drums and lutes to delight in the Buddha.",
        "source": "T02n0129_001:0844c20_3"
    },
    {
        "source_sentence": "三摩竭與王、夫人、太子，即持華香迎佛，前為佛作禮，便相將入宮即就座。",
        "translation": "The samāgata and the king, his wife, and the princes greeted the Buddha with flowers and incense, bowed to him before they went into the palace, and took their seats.",
        "source": "T02n0129_001:0844c22_4"
    },
    {
        "source_sentence": "諸菩薩、阿羅漢皆前坐，大小相次，三摩竭即令王、夫人、太子前行澡水，",
        "translation": "When the bodhisattvas and arhats were all seated in front of him, arranged according to their major and minor signs, Samantabhadra then ordered the king, his wife, and princes to go before him to wash water.",
        "source": "T02n0129_001:0844c24_5"
    },
    {
        "source_sentence": "便下飯食具，國中人民來觀者甚眾多，王令大臣閉宮門。",
        "translation": "The king ordered his ministers to close the palace gates.",
        "source": "T02n0129_001:0844c25_6"
    },
    {
        "source_sentence": "人民見王閉宮門，大瞋恚王所，各持斧欲破宮門。",
        "translation": "The people saw that the king had shut the palace gates, and at the place where King Mahāprajāpatī held an axe in his hand they each wanted to break through the doors of the palace.",
        "source": "T02n0129_001:0844c27_7"
    },
    {
        "source_sentence": "佛遙知之，言：「我所行化，皆欲令作善，今難國人民皆來觀，而王閉宮門也。」",
        "translation": "Knowing this from a distance, the Buddha said, Whatever I teach, I want to make them do good, but now it's difficult for people in my country to come to see me, and the king has closed the palace gates.",
        "source": "T02n0129_001:0844c28_8"
    },
    {
        "source_sentence": "佛爾時，欲令一切人等見佛，即使宮門牆壁悉化作水精色，內外相見，",
        "translation": "At that time the Buddha wished to enable all living beings to see him, and so they magically cast the light of water spirits emanating from their palaces, doors, walls, and all objects inside and out.",
        "source": "T02n0129_001:0844c29_9"
    },
    {
        "source_sentence": "難國人民見佛及諸菩薩、羅漢，皆大歡喜。",
        "translation": "The people of the kingdom of Nandi greatly rejoiced when they saw the Buddha, the bodhisattvas, and the arhats.",
        "source": "T02n0129_001:0845a02_10"
    },
    {
        "source_sentence": "爾時，佛有一羅漢名賓頭盧，時坐山上忽忘至難國，賓頭盧坐來久，適欲以針縫縷衣，",
        "translation": "At that time, the Buddha had an arhat named Piṇḍola, who was seated in the mountains. When he sat there, he suddenly forgot to go to the kingdom of Nālandā. Piṇḍola had been sitting there for a long time and wished to thread his robe with needles.",
        "source": "T02n0129_001:0845a04_0"
    },
    {
        "source_sentence": "以鍼刺地，縷與衣相連。",
        "translation": "He pierced the ground with a needle and thread connected it to his robe.",
        "source": "T02n0129_001:0845a06_0"
    },
    {
        "source_sentence": "是時佛已應難國王宮中坐已，賓頭盧即以神足飛行至難國，山便隨賓頭盧後。",
        "translation": "After the Buddha had been seated in the palace of the king of Rājagṛha, Piṇḍola flew with his supernormal powers to the kingdom of Rājagṛha, and the mountain followed him behind Piṇḍola.",
        "source": "T02n0129_001:0845a06_1"
    },
    {
        "source_sentence": "爾時，國中有一女人懷軀，見山來政黑恐墮其上，便大惶怖即墮軀。",
        "translation": "At the time, there was a woman in the kingdom who was carrying her body. Seeing black clouds coming from the mountain and fearful of falling on it, she became frightened and fell down with great fear.",
        "source": "T02n0129_001:0845a08_2"
    },
    {
        "source_sentence": "佛以遙知之，即令摩訶目連以神足飛行迎問：「賓頭盧！",
        "translation": "Knowing him from a distance, the Buddha caused Mahāmaudgalyāyana to fly with his spiritual feet to greet him and ask, Piṇḍola!",
        "source": "T02n0129_001:0845a09_3"
    },
    {
        "source_sentence": "汝後何等？」",
        "translation": "What's next to you?",
        "source": "T02n0129_001:0845a11_4"
    },
    {
        "source_sentence": "賓頭盧即還顧見山，以手攬山擲故處八千里。",
        "translation": "Piṇḍola then looked back and saw the mountain, embraced it in his hand, and tossed it 8,000 li from its old place.",
        "source": "T02n0129_001:0845a11_5"
    },
    {
        "source_sentence": "爾時，賓頭盧即到前，為佛作禮却坐。",
        "translation": "It was then that Piṇḍola went before the Buddha and paid homage to him, withdrew, and sat down.",
        "source": "T02n0129_001:0845a12_6"
    },
    {
        "source_sentence": "佛告賓頭盧：「我教天下人欲令悉度世，今汝既失期，復殺一人。",
        "translation": "The Buddha told Piṇḍola, I taught the people of the world to want to cause them all to save the world, but now that you've lost your time, you've killed another person.",
        "source": "T02n0129_001:0845a14_0"
    },
    {
        "source_sentence": "人命至重，是我道所不喜。",
        "translation": "The human life is so great that I won't rejoice in my teaching.",
        "source": "T02n0129_001:0845a15_1"
    },
    {
        "source_sentence": "汝從今已後，不得復隨我食及與眾會。",
        "translation": "From now on, you mustn't again follow me to eat or give it to the assembly.",
        "source": "T02n0129_001:0845a16_0"
    },
    {
        "source_sentence": "若當留住，後須彌勒佛出，迺般泥洹去耳。」",
        "translation": "If he stays, then Sumeru Buddha comes out and goes into nirvāṇa.",
        "source": "T02n0129_001:0845a16_1"
    },
    {
        "source_sentence": "賓頭盧聞佛說如是，即默然憂愁復自悔責，食訖便起前為作禮，及諸菩薩、阿羅漢共辭，",
        "translation": "When Piṇḍola heard the Buddha’s discourse in this way, he remained silent and sorrowful. Having subdued his remorse, he stood up to pay homage to the buddha and all the bodhisattvas and arhats withdrew.",
        "source": "T02n0129_001:0845a17_2"
    },
    {
        "source_sentence": "便入山中。",
        "translation": "He then entered the mountain.",
        "source": "T02n0129_001:0845a19_3"
    },
    {
        "source_sentence": "爾時，難國王師尼揵若陀弗白佛言：「寧可共捔道不？",
        "translation": "It was then that the king of Nanda's teacher Nirgrantha Devaputra said to the Buddha, Would you like to share the path of sexual misconduct?",
        "source": "T02n0129_001:0845a20_4"
    },
    {
        "source_sentence": "若不如者當投著井中。」",
        "translation": "If he doesn't, he'll throw himself into a well.",
        "source": "T02n0129_001:0845a21_5"
    },
    {
        "source_sentence": "佛言：「大善！",
        "translation": "The Buddha said, Great good!",
        "source": "T02n0129_001:0845a21_6"
    },
    {
        "source_sentence": "不須多言，三問不如者，當投著井中。」",
        "translation": "If you don't need to say much, and the three questions are not like that, you'll throw them into a well.",
        "source": "T02n0129_001:0845a22_0"
    },
    {
        "source_sentence": "尼揵若陀弗言：「大善！」",
        "translation": "Nirgrantha Devaputra said, Great good!",
        "source": "T02n0129_001:0845a22_1"
    },
    {
        "source_sentence": "佛即問：「若誦經時云何？」",
        "translation": "The Buddha then asked, What happens when you recite the sūtras?",
        "source": "T02n0129_001:0845a23_2"
    },
    {
        "source_sentence": "尼揵若陀弗言：「我誦經時匍匐而行。」",
        "translation": "Nirgrantha Devaputra said, When I recite the sūtras, I prostrate and walk.",
        "source": "T02n0129_001:0845a23_3"
    },
    {
        "source_sentence": "「匍匐而行是為狗，狗迺匍匐而行。」",
        "translation": "crawling and walking is a dog, and a dog crawls and walks.",
        "source": "T02n0129_001:0845a24_4"
    },
    {
        "source_sentence": "尼揵若陀弗便不如佛，諸弟子皆瞋，餘語為賜那正說是事也，悉還恚其師所，",
        "translation": "Nirgrantha Devaputra did not do as the Buddha. The disciples were all angry and said, “Ganjana, you should explain this matter correctly.” They all returned to their teacher’s place.",
        "source": "T02n0129_001:0845a25_5"
    },
    {
        "source_sentence": "取師欲投著井中，師即大惶怖，以兩手拒地不肯入井中。",
        "translation": "He took the teacher and wanted to throw him into the well, but he was so frightened that he held his two hands against the ground and refused to enter the well.",
        "source": "T02n0129_001:0845a27_6"
    },
    {
        "source_sentence": "佛言：「置之。」",
        "translation": "The Buddha said, Put it away.",
        "source": "T02n0129_001:0845a28_7"
    },
    {
        "source_sentence": "爾時，中庭自然有大火出，其焰上詣第七梵天，其火中自然有千葉蓮華，",
        "translation": "At that time a great flame naturally emerged from the courtyard and went up to the seventh heaven of Brahmā. In the flame there was a thousand-petaled lotus flower,",
        "source": "T02n0129_001:0845a29_0"
    },
    {
        "source_sentence": "華上有五百梵天，皆叉手長跪問佛：「飯何等人得福多者？",
        "translation": "On top of the flower were five hundred Brahmā gods, all kneeling with palms joined and knelt down long enough to ask the Buddha, Who among them will attain much merit?",
        "source": "T02n0129_001:0845b01_1"
    },
    {
        "source_sentence": "飯何等人得福少者？」",
        "translation": "What kind of people attain little merit with rice?",
        "source": "T02n0129_001:0845b02_2"
    },
    {
        "source_sentence": "佛答梵天言：「譬如以五種穀散著火中，為生不？」",
        "translation": "The Buddha answered the Brahmadeva gods, Suppose five kinds of grain are scattered in a fire and are they produced?",
        "source": "T02n0129_001:0845b03_3"
    },
    {
        "source_sentence": "梵天言：「不生。」",
        "translation": "The Brahmadeva gods said, It won't arise.",
        "source": "T02n0129_001:0845b04_4"
    },
    {
        "source_sentence": "佛言：「難國王前後所飯諸尼揵，譬如五穀著火中，終不復生；",
        "translation": "The Buddha said: It is as if five grains were to be thrown into a fire and would never grow again.",
        "source": "T02n0129_001:0845b04_5"
    },
    {
        "source_sentence": "今日飯佛及諸菩薩、羅漢，得福多無有量。",
        "translation": "Today, the rice buddhas, bodhisattvas, and arhats will attain an immeasurable amount of merit.",
        "source": "T02n0129_001:0845b06_6"
    },
    {
        "source_sentence": "譬如人有好地有好種，天復時雨，何憂不生？",
        "translation": "It's like when a person has good land and good seeds, and it rains again in the sky, so why doesn't sorrow arise?",
        "source": "T02n0129_001:0845b07_7"
    },
    {
        "source_sentence": "今佛是一切人福田，隨人所種必得其願。",
        "translation": "Now, the Buddha is a field of merit for all people, and whatever they plant will surely attain their vow.",
        "source": "T02n0129_001:0845b08_8"
    },
    {
        "source_sentence": "愚癡人喜教他為外道，是人命盡皆當墮太山地獄中甚懃苦，悔無所復及，",
        "translation": "A foolish man likes to teach others as non-Buddhists. When their life ends, they'll all fall into the great bitter pain of Mount Taishan hell, and there's nothing more to regret.",
        "source": "T02n0129_001:0845b09_9"
    },
    {
        "source_sentence": "前人坐之未出，後人復教作之，世間人愚癡，但更相欺調，是故不知真道。",
        "translation": "Before the former person sits it, he doesn't emerge, and the latter person teaches him to do it again. The people of the world are foolish, but they further deceive each other, so they don't know the true path.",
        "source": "T02n0129_001:0845b10_10"
    },
    {
        "source_sentence": "若有黠人當學正道，其道不生不老不病不死，是為泥洹大道。",
        "translation": "If there are wise people who should train in the right path, whose path doesn't give rise to old age, illness, and death, this is the great path of nirvāṇa.",
        "source": "T02n0129_001:0845b12_11"
    },
    {
        "source_sentence": "世間凡有九十六種道，皆不及佛道。」",
        "translation": "Where there are ninety-six kinds of paths in the world, they all don't match the Buddha Way.",
        "source": "T02n0129_001:0845b13_12"
    },
    {
        "source_sentence": "佛言：「以一天下樹枝及與鳥毛，作筆書佛經，樹枝鳥毛悉皆可盡，佛智不可盡；",
        "translation": "The Buddha said: With a single day’s worth of trees, branches, and bird hair growing from the ground as well as writing brush strokes on buddha scriptures can all be exhausted; but the knowledge of Buddha cannot be exhausted.",
        "source": "T02n0129_001:0845b14_13"
    },
    {
        "source_sentence": "大如須彌山墨磨研，四海水沾筆，須彌山墨、四海水皆可盡，佛智終不可盡。」",
        "translation": "It's as large as the Sumeru mountain of ink that's polished and polished by the four oceans of water, and the Sumeru mountain of ink and the four oceans of water can all be exhausted, but the Buddha's wisdom can't be exhausted.",
        "source": "T02n0129_001:0845b16_14"
    },
    {
        "source_sentence": "五百梵天聞佛語，應時舉聲言：「善哉！",
        "translation": "When the five hundred Brahma gods heard the Buddha's words, they raised their voices and said, Good!",
        "source": "T02n0129_001:0845b18_15"
    },
    {
        "source_sentence": "審如佛所言。」",
        "translation": "It's just as the Buddha said.",
        "source": "T02n0129_001:0845b18_16"
    },
    {
        "source_sentence": "於是五百梵天忽然不見。",
        "translation": "Then the five hundred brahma gods suddenly disappeared.",
        "source": "T02n0129_001:0845b19_17"
    },
    {
        "source_sentence": "爾時，難國王眷屬三百人，千二百婇女，五百大臣，見佛變化，皆踊躍歡喜，",
        "translation": "At that time the king of Nanda’s retinue numbered three hundred. One thousand two hundred court ladies and five hundred ministers, seeing the Buddha’s magical manifestation, all jumped up and down in joy.",
        "source": "T02n0129_001:0845b19_18"
    },
    {
        "source_sentence": "悉發阿耨多羅三藐三菩提心。",
        "translation": "They all give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T02n0129_001:0845b21_19"
    },
    {
        "source_sentence": "時二千婆羅門即除鬚髮皆作比丘，應時悉得羅漢道。",
        "translation": "Two thousand Brāhmaṇas then removed their hair and became monks, and they all attained the path of the arhat at that time.",
        "source": "T02n0129_001:0845b22_20"
    },
    {
        "source_sentence": "萬二千尼揵應時悉解脫，中有得須陀洹道者，有得斯陀含道者，有得阿那含道者。",
        "translation": "Among the twelve thousand nuns who were liberated at that time, some had attained the path of stream entry, some had attained the path of once-returning, and some had attained the path of non-returning.",
        "source": "T02n0129_001:0845b23_21"
    },
    {
        "source_sentence": "國中細民復有六萬四千人，皆信向佛法。",
        "translation": "There were another sixty-four thousand people in the country, all of whom believed in the buddha-dharma.",
        "source": "T02n0129_001:0845b25_22"
    },
    {
        "source_sentence": "即受五戒悉為優婆塞。",
        "translation": "That is, they'll all receive the five precepts as laymen.",
        "source": "T02n0129_001:0845b26_23"
    },
    {
        "source_sentence": "佛說經已，即與諸菩薩、阿羅漢俱現神足飛去。",
        "translation": "After the Buddha had taught the sūtras, he flew away with the bodhisattvas and arhats presenting their miraculous feet.",
        "source": "T02n0129_001:0845b26_24"
    },
    {
        "source_sentence": "爾時，難國王及夫人、太子、群臣、人民，皆大歡喜，悉持頭著地，遙為佛作禮。",
        "translation": "At the time, the king of Nandika and his wife, princes, ministers, and people were all greatly delighted, bowed to the Buddha from a distance with their heads touching the ground.",
        "source": "T02n0129_001:0845b27_25"
    },
    {
        "source_sentence": "佛說三摩竭經",
        "translation": "Samādhi-sūtra Spoken by the Buddha",
        "source": "T02n0129_001:0845c01_0"
    }
]