[
    {
        "source_sentence": "佛說三轉法輪經",
        "translation": "Sutra on the Three Turns of the Wheel of the Dharma",
        "source": "T02n0110_001:0504a04_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T02n0110_001:0504a06_0"
    },
    {
        "source_sentence": "如是我聞：一時，薄伽梵在婆羅痆斯仙人墮處施鹿林中。",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at Vārāṇasī, and the sage Śāriputra fell into the Deer Forest of Giving.",
        "source": "T02n0110_001:0504a07_0"
    },
    {
        "source_sentence": "爾時，世尊告五苾芻曰：「汝等苾芻！",
        "translation": "It was then that the Bhagavān addressed the five monks, saying, You monks!",
        "source": "T02n0110_001:0504a08_1"
    },
    {
        "source_sentence": "此苦聖諦，於所聞法如理作意，能生眼智明覺，汝等苾芻！",
        "translation": "This noble truth of suffering, which gives rise to vision, knowledge, insight, and awakening based on the correct contemplation of what's heard, you monks!",
        "source": "T02n0110_001:0504a09_2"
    },
    {
        "source_sentence": "此苦集、苦滅、順苦滅道聖諦之法，如理作意，能生眼智明覺。",
        "translation": "These noble truths of suffering's arising, suffering's cessation, and following the path to suffering's cessation are correctly contemplated so that they can give rise to vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a10_3"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a12_0"
    },
    {
        "source_sentence": "此苦聖諦是所了法，如是應知，於所聞法如理作意，能生眼智明覺。",
        "translation": "These noble truths of suffering are the things that are comprehended, so they should be known in this way, correctly contemplating what they've heard, and being able to give rise to vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a12_1"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a14_0"
    },
    {
        "source_sentence": "此苦集聖諦是所了法，如是應斷，於所聞法如理作意，能生眼智明覺。",
        "translation": "These noble truths of suffering and accumulation are the things that are comprehended, which should thus be stopped, and with correct attention to the things they hear, it's possible to produce vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a14_1"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a16_0"
    },
    {
        "source_sentence": "此苦滅聖諦是所了法，如是應證，於所聞法如理作意，能生眼智明覺。",
        "translation": "This noble truth of suffering's cessation is the thing that's comprehended, and thus it should be realized that correctly contemplating what's heard gives rise to vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a16_1"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a17_2"
    },
    {
        "source_sentence": "此順苦滅道聖諦是所了法，如是應修，於所聞法如理作意，能生眼智明覺。",
        "translation": "This noble truth of following the path to suffering's cessation is the thing that's comprehended, so it should be cultivated in this way, which correctly contemplates what's heard and produces vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a18_3"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a20_0"
    },
    {
        "source_sentence": "此苦聖諦是所了法，如是已知，於所聞法如理作意，能生眼智明覺。",
        "translation": "This noble truth of suffering is the thing that's comprehended, and thus they know it, correctly contemplate the things they hear, and can give rise to vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a20_1"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a22_0"
    },
    {
        "source_sentence": "此苦集聖諦是所了法，如是已斷，於所聞法如理作意，能生眼智明覺。",
        "translation": "This noble truth of suffering's accumulation is the thing that's comprehended, and having thus stopped it, he correctly contemplates the things he hears in order to give rise to vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a22_1"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a24_0"
    },
    {
        "source_sentence": "此苦滅聖諦是所了法，如是已證，於所聞法如理作意，能生眼智明覺。",
        "translation": "This noble truth of the cessation of suffering is the thing that's comprehended, and having thus realized it, he correctly contemplates the things he hears in order to give rise to vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a24_1"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a26_0"
    },
    {
        "source_sentence": "此順苦滅道聖諦是所了法，如是已修，於所聞法如理作意，能生眼智明覺。",
        "translation": "This noble truth of following the path to suffering's cessation is the thing that's comprehended, and having cultivated it in this way, he correctly contemplates the things he hears, which can give rise to vision, knowledge, insight, and awakening.",
        "source": "T02n0110_001:0504a26_1"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504a28_0"
    },
    {
        "source_sentence": "若我於此四聖諦法未了三轉十二相者，眼智明覺皆不得生，我則不於諸天魔梵、沙門婆羅門一切世間，",
        "translation": "If I hadn’t understood the thirty-two characteristics of these teachings of the four noble truths, neither vision, knowledge, insight, and awakening would have arisen. Then I wouldn’t be born in all the worlds of gods, Māra, Brahmā, renunciants, or brāhmaṇas.",
        "source": "T02n0110_001:0504a28_1"
    },
    {
        "source_sentence": "捨離煩惱心得解脫，不能證得無上菩提。",
        "translation": "Being liberated from the afflictions, they can't realize unsurpassed enlightenment.",
        "source": "T02n0110_001:0504b01_2"
    },
    {
        "source_sentence": "「汝等苾芻！",
        "translation": "You monks!",
        "source": "T02n0110_001:0504b03_0"
    },
    {
        "source_sentence": "由我於此四聖諦法解了三轉十二相故，眼智明覺皆悉得生，乃於諸天魔梵、沙門婆羅門一切世間，",
        "translation": "Because of my understanding of these teachings of the four holy truths in regard to the dharmas of the three revolutions and twelve characteristics, vision, knowledge, insight, and awakening can all arise. Then I will be born in all the worlds of gods, Māra, Brahmā, renunciants, brahmins, and brāhmaṇas.",
        "source": "T02n0110_001:0504b03_1"
    },
    {
        "source_sentence": "捨離煩惱心得解脫，便能證得無上菩提。」",
        "translation": "By abandoning the afflictions and attaining liberation, they'll be able to realize unsurpassed enlightenment.",
        "source": "T02n0110_001:0504b05_2"
    },
    {
        "source_sentence": "爾時世尊說是法時，具壽憍陳如及八萬諸天，遠塵離垢得法眼淨。",
        "translation": "When the Bhagavān explained this teaching, the Kauśinagara Tathāgata and 80,000 gods became dustless and spotless and attained purity of the Dharma eye.",
        "source": "T02n0110_001:0504b07_0"
    },
    {
        "source_sentence": "佛告憍陳如：「汝解此法不？」",
        "translation": "The Buddha told Kauṇḍinya, Do you understand this teaching?",
        "source": "T02n0110_001:0504b08_1"
    },
    {
        "source_sentence": "答言：「已解。",
        "translation": "He replied, I've understood.",
        "source": "T02n0110_001:0504b09_2"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T02n0110_001:0504b09_3"
    },
    {
        "source_sentence": "「汝解此法不？」",
        "translation": "Do you understand this teaching?",
        "source": "T02n0110_001:0504b09_4"
    },
    {
        "source_sentence": "答言：「已解。",
        "translation": "He replied, I've understood.",
        "source": "T02n0110_001:0504b09_5"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T02n0110_001:0504b10_0"
    },
    {
        "source_sentence": "由憍陳如解了法故，因此即名阿若憍陳如(阿若是解了義)。",
        "translation": "Because Kauṇḍinya thus understands the teaching, it's called Ājñāta Kauṇḍinya thus (if Ājñāta understands the meaning of understanding).",
        "source": "T02n0110_001:0504b10_1"
    },
    {
        "source_sentence": "是時地居藥叉聞佛說已，出大音聲，告人天曰：「仁等當知，佛在婆羅痆斯仙人墮處施鹿林中，",
        "translation": "Having heard the Buddha’s exhortation, the yakṣa spirit Dṛṣṭiprāpta of that land uttered a loud voice and said to humans and gods: You should know that the Buddha is in the Deer Preserve where the holy man Vārāṇasī fell.",
        "source": "T02n0110_001:0504b12_0"
    },
    {
        "source_sentence": "廣說三轉十二行相法輪，由此能於天人魔梵、沙門婆羅門一切世間，為大饒益，",
        "translation": "He expounded in detail the teaching of the Dharma wheel consisting of three revolutions and twelve aspects. Because of these he was able to greatly benefit gods, humans, Māra, Brahmā, renunciants, and brahmins in all worlds.",
        "source": "T02n0110_001:0504b14_1"
    },
    {
        "source_sentence": "令同梵行者速至安隱涅槃之處，人天增盛阿蘇羅減少。」",
        "translation": "Causing those who practice the same religious teachings to quickly reach the place of peaceful nirvāṇa, humans and gods increase and asuras decrease.",
        "source": "T02n0110_001:0504b15_2"
    },
    {
        "source_sentence": "由彼藥叉作如是告，虛空諸天四大王眾皆悉聞知。",
        "translation": "Because that yakṣa told them this, the four great kings of the heavens in space heard and knew it all.",
        "source": "T02n0110_001:0504b17_3"
    },
    {
        "source_sentence": "如是展轉於剎那頃盡六欲天，須臾之間乃至梵天普聞其響，梵眾聞已復皆遍告廣說如前，",
        "translation": "In this way, in succession, for the duration of a moment, all the gods of the six heavens of the realm of sexual passion are exhausted. The sound is instantaneous and reaches up to the brahma-heaven; and when the brahma-heaven hears it, it also tells everything as before.",
        "source": "T02n0110_001:0504b18_4"
    },
    {
        "source_sentence": "因名此經為三轉法輪。",
        "translation": "That's why this sūtra is called the threefold turning of the wheel of the Dharma.",
        "source": "T02n0110_001:0504b20_5"
    },
    {
        "source_sentence": "時五苾芻及人天等，聞佛說已，歡喜奉行。",
        "translation": "When the five monks and humans and gods heard the Buddha's teaching, they rejoiced and carried it out.",
        "source": "T02n0110_001:0504b21_6"
    },
    {
        "source_sentence": "佛說三轉法輪經",
        "translation": "Sutra on the Three Turns of the Wheel of the Dharma",
        "source": "T02n0110_001:0504b22_0"
    }
]