[
    {
        "source_sentence": "佛說阿含正行經",
        "translation": "Foshuo ahan jing zhengxing jing",
        "source": "T02n0151_001:0883b23_0"
    },
    {
        "source_sentence": "後漢安息國三藏安世高譯",
        "translation": "Translated by An Shigao, the Tripiṭaka Master of Anxi in the Later Han Dynasty",
        "source": "T02n0151_001:0883b25_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0151_001:0883b26_0"
    },
    {
        "source_sentence": "是時，佛告諸比丘言：「我為汝說經，上語亦善，中語亦善，下語亦善，",
        "translation": "At that time the Buddha said to the bhikṣus: I will expound a discourse for you, saying: “The above-mentioned discourse is also wholesome; the middle discourse is also wholesome; the following discourse is also wholesome.",
        "source": "T02n0151_001:0883b26_1"
    },
    {
        "source_sentence": "語深說度世之道，正心為本。",
        "translation": "Their words profoundly explain the path of worldly salvation, with right mindfulness as their root.",
        "source": "T02n0151_001:0883b28_2"
    },
    {
        "source_sentence": "聽我言，使後世傳行之。」",
        "translation": "Listen to my words, so that they'll be transmitted in later generations.",
        "source": "T02n0151_001:0883b29_3"
    },
    {
        "source_sentence": "諸比丘叉手受教。",
        "translation": "The monks joined their palms and accepted the teaching.",
        "source": "T02n0151_001:0883b29_4"
    },
    {
        "source_sentence": "佛言：「人身中有五賊，牽人入惡道。",
        "translation": "The Buddha said, There are five thieves in the human body that lead people into a bad path.",
        "source": "T02n0151_001:0883c01_5"
    },
    {
        "source_sentence": "何等五賊？",
        "translation": "What are the five thieves?",
        "source": "T02n0151_001:0883c01_6"
    },
    {
        "source_sentence": "一者色，二者痛痒，三者思想，四者生死，五者識，是五者人所常念。」",
        "translation": "One is form, two are pain and itch, three are thoughts, four are births and deaths, and five are consciousnesses, which are the five constant thoughts of people.",
        "source": "T02n0151_001:0883c02_7"
    },
    {
        "source_sentence": "佛言：「人常為目所欺，為耳所欺，為鼻所欺，為口所欺，為身所欺。",
        "translation": "The Buddha said, People are always deceived by the eyes, deceived by the ears, deceived by the nose, deceived by the mouth, and deceived by the body.",
        "source": "T02n0151_001:0883c03_8"
    },
    {
        "source_sentence": "目但能見不能聞；",
        "translation": "The organ of sight sees but not hearing.",
        "source": "T02n0151_001:0883c05_9"
    },
    {
        "source_sentence": "耳但能聞不能見；",
        "translation": "The organ of hearing hears and does not see.",
        "source": "T02n0151_001:0883c05_10"
    },
    {
        "source_sentence": "鼻但能知香，不能聞；",
        "translation": "The organ of smell only knows the odor but not the taste.",
        "source": "T02n0151_001:0883c05_11"
    },
    {
        "source_sentence": "口但能知味，不能知香；",
        "translation": "Their mouths can only know taste, but they cannot smell.",
        "source": "T02n0151_001:0883c06_12"
    },
    {
        "source_sentence": "身體但能知寒溫，不能知味。",
        "translation": "The body can only know cold and warm but not taste.",
        "source": "T02n0151_001:0883c06_13"
    },
    {
        "source_sentence": "是五者，皆屬心，心為本。」",
        "translation": "These five are all mental, and mind is the root.",
        "source": "T02n0151_001:0883c07_14"
    },
    {
        "source_sentence": "佛言：「諸比丘！",
        "translation": "The Buddha said, Monks!",
        "source": "T02n0151_001:0883c08_15"
    },
    {
        "source_sentence": "欲求道者，當端汝心，從癡但墮十二因緣，便有生死。",
        "translation": "Those who want to pursue the path should focus their minds on you, and if they simply fall from delusion into twelve causes and conditions, then there will be birth and death.",
        "source": "T02n0151_001:0883c08_16"
    },
    {
        "source_sentence": "何等十二？",
        "translation": "What are these twelve?",
        "source": "T02n0151_001:0883c09_17"
    },
    {
        "source_sentence": "一者本為癡，二者行，三者識，四者字，五者六入，六者栽，七者痛，",
        "translation": "The first is fundamental ignorance; the second is volition; the third is consciousness; the fourth is syllable; the fifth is sixfold sense base; the sixth is planting; and the seventh is pain.",
        "source": "T02n0151_001:0883c09_18"
    },
    {
        "source_sentence": "八者愛，九者受，十者有，十一者生，十二者死。",
        "translation": "The eighth is craving, the ninth is sensation, the tenth is existence, the eleventh is birth, and the twelfth is death.",
        "source": "T02n0151_001:0883c11_19"
    },
    {
        "source_sentence": "施行善者，復得為人，施行惡者，死入地獄、餓鬼、畜生中。",
        "translation": "Those who do good deeds will again be allowed to become human beings, and those who do evil deeds will die and go to hell, hungry ghosts, or animals.",
        "source": "T02n0151_001:0883c12_20"
    },
    {
        "source_sentence": "佛坐思念：『人癡故有生死，何等為癡？』",
        "translation": "The Buddha sat and thought, 'Because people are deluded, there's birth-and-death; what's delusion?'",
        "source": "T02n0151_001:0883c13_21"
    },
    {
        "source_sentence": "本從癡中來，今生為人，復癡心不解目不開，不知死當所趣向？",
        "translation": "Originally coming from delusion, he's now born as a human being. Furthermore, his deluded mind doesn't understand and his eyes don't open, so he doesn't know where to go in death?",
        "source": "T02n0151_001:0883c14_22"
    },
    {
        "source_sentence": "見佛不問，見經不讀，見沙門不承事，不信道德，見父母不敬，不念世間苦，",
        "translation": "Seeing the Buddha, they do not ask questions; seeing scriptures, they do not recite them; seeing renunciants they do not serve them; they do not believe in virtue; seeing their parents they do not honor them; and they do not think of worldly sufferings.",
        "source": "T02n0151_001:0883c15_23"
    },
    {
        "source_sentence": "不知泥犁中考治劇，是名為癡故有生死。",
        "translation": "They don't know that there's birth-and-death in the mud plow as a result of their delusion.",
        "source": "T02n0151_001:0883c17_24"
    },
    {
        "source_sentence": "不止生死，如呼吸間，脆不過於人命。",
        "translation": "It doesn't stop from birth and death, just as when it's between breathing, its fragility isn't limited to human life.",
        "source": "T02n0151_001:0883c18_25"
    },
    {
        "source_sentence": "人身中有三事，身死識去心去意去，是三者，常相追逐。",
        "translation": "There are three things in a person's body, which are the departure of body, death, and consciousness, and the departure of mind and thought. These three things are always chasing each other.",
        "source": "T02n0151_001:0883c19_26"
    },
    {
        "source_sentence": "施行惡者，死入泥犁、餓鬼、畜生、鬼神中；",
        "translation": "Those who commit evil are driven into the realms of hell, hungry ghosts, animals, and spirits.",
        "source": "T02n0151_001:0883c20_27"
    },
    {
        "source_sentence": "施行善者，亦有三相追逐，或生天上，或生人中，墮是五道中者，皆坐心不端故。」",
        "translation": "Those who perform good deeds also have three characteristics that chase them, whether they're born in heaven or among humans, and those who fall into these five destinies are all sitting there because their minds aren't straight.",
        "source": "T02n0151_001:0883c21_28"
    },
    {
        "source_sentence": "佛告諸比丘：「皆端汝心，端汝目，端汝耳，端汝鼻，端汝口，端汝身，",
        "translation": "The Buddha said to the bhikṣus: All of them are just as if they were touching your mind, eyes, ears, nose, mouth, and body.",
        "source": "T02n0151_001:0883c23_29"
    },
    {
        "source_sentence": "端汝意，身體當斷於土，魂神當不復入泥犁、餓鬼、畜生、鬼神中。",
        "translation": "In accordance with your wishes, your body will be cut off from the earth, and your soul and spirit won't go back into the mud plow, hungry ghosts, animals, or ghosts.",
        "source": "T02n0151_001:0883c24_30"
    },
    {
        "source_sentence": "視人家有惡子，為吏所取，皆坐心不端故。",
        "translation": "He looked around the house and saw that there were bad children in the house who had been taken by the officials, but they all sat cross-legged because their minds weren't straight.",
        "source": "T02n0151_001:0883c26_31"
    },
    {
        "source_sentence": "人身有百字，如車有百字，人多貪好怒，不思惟身中事，死入泥犁中，",
        "translation": "The human body has a hundred syllables, just as a carriage has a hundred syllables. Many people are greedy with pleasure and anger; they do not think of anything in their bodies but die and enter the mud plow.",
        "source": "T02n0151_001:0883c27_0"
    },
    {
        "source_sentence": "悔無所復及。」",
        "translation": "There's nothing more to repent of.",
        "source": "T02n0151_001:0883c28_1"
    },
    {
        "source_sentence": "佛言：「我身棄國捐，遮迦越王憂斷生死，欲度世間人使得泥洹道。",
        "translation": "The Buddha said, My body is abandoned and my country is given up, and the king of Kātyāyapa's grief stops birth-and-death and wants to save worldly people so that they can enter the path of nirvāṇa.",
        "source": "T02n0151_001:0883c28_2"
    },
    {
        "source_sentence": "第一精進者，即得阿羅漢道。",
        "translation": "The first kind of effort is the attainment of the path of the arhat.",
        "source": "T02n0151_001:0884a01_3"
    },
    {
        "source_sentence": "第二精進者，自致阿那含道。",
        "translation": "The second kind of energy is that which leads to the path of non-returning on its own.",
        "source": "T02n0151_001:0884a01_4"
    },
    {
        "source_sentence": "第三精進者，得斯陀含道。",
        "translation": "The third kind of energy is the attainment of the path of once-returning.",
        "source": "T02n0151_001:0884a02_5"
    },
    {
        "source_sentence": "第四精進者，得須陀洹道。",
        "translation": "The fourth form of zeal is acquisition of the path of stream-winner.",
        "source": "T02n0151_001:0884a03_6"
    },
    {
        "source_sentence": "雖不能大精進者，當持五戒：一不殺，二不盜，三不兩舌，四不婬妷，",
        "translation": "Even though they can’t make great effort, they should observe five precepts: first, not killing; second, not stealing; third, not speaking falsehoods; and fourth, not sexual misconduct.",
        "source": "T02n0151_001:0884a03_7"
    },
    {
        "source_sentence": "五不飲酒。」",
        "translation": "Five, not drinking alcohol.",
        "source": "T02n0151_001:0884a05_8"
    },
    {
        "source_sentence": "佛言：「人坐起常當思念是四事，何等四？",
        "translation": "The Buddha said, These are the four things that people should always think about when they're seated and rise up. What are the four?",
        "source": "T02n0151_001:0884a05_9"
    },
    {
        "source_sentence": "一者自觀身，觀他人身。",
        "translation": "One is observing oneself and observing others’ bodies.",
        "source": "T02n0151_001:0884a06_10"
    },
    {
        "source_sentence": "二者自觀痛痒，觀他人痛痒。",
        "translation": "The second is to observe for yourself the pain and itch of others.",
        "source": "T02n0151_001:0884a07_0"
    },
    {
        "source_sentence": "三者自觀意，觀他人意。",
        "translation": "The third is to examine one’s own thoughts and the thoughts of others.",
        "source": "T02n0151_001:0884a07_1"
    },
    {
        "source_sentence": "四者自觀法，觀他人法。",
        "translation": "The fourth is to examine one’s own doctrine and the doctrines of others.",
        "source": "T02n0151_001:0884a08_2"
    },
    {
        "source_sentence": "內復欲亂者，心小自端視身體，飽亦極，飢亦極，住亦極，坐亦極，行亦極，",
        "translation": "Again, if someone’s mind is disturbed by internal desire, they look at their bodies with a small awareness and keep an eye out for themselves. Their hunger is also extreme, their hunger while standing is also extreme, their sitting is also extreme, and their walking is also extreme.",
        "source": "T02n0151_001:0884a08_3"
    },
    {
        "source_sentence": "寒亦極，熱亦極，臥亦極。",
        "translation": "The cold is also extreme, the heat is also extreme, and the lie down is also extreme.",
        "source": "T02n0151_001:0884a10_4"
    },
    {
        "source_sentence": "臥欲來時，當自驚起坐，坐不端者，當起立，立不端者，當經行，心儻不端者，",
        "translation": "When he lies down and wishes to come, he should get up and sit in fear; those who don’t stand upright while sitting should get up and stand up. Those who aren’t standing upright should walk back and forth, and those whose minds are coarse and unsteady should restrain themselves.",
        "source": "T02n0151_001:0884a10_5"
    },
    {
        "source_sentence": "當自正。",
        "translation": "You should correct yourself.",
        "source": "T02n0151_001:0884a12_6"
    },
    {
        "source_sentence": "譬如國王將兵出鬪，健者在前，既在前鄙復却適欲却著後人；",
        "translation": "It is as if a king were to send his troops out to battle, and the strongest of men would be in front. Once they are there, the coarse ones will retreat because they want to defeat the stronger ones and rely on the people who come after them.",
        "source": "T02n0151_001:0884a12_7"
    },
    {
        "source_sentence": "沙門既棄家，去妻子，除鬚髮，作沙門，雖一世苦，後長得解脫。",
        "translation": "Having renounced the householder’s life, he forsakes his wife and children, shaves his hair and beard, and becomes a monk. Although he suffered through one worldly rebirth, he will attain liberation in the future.",
        "source": "T02n0151_001:0884a14_8"
    },
    {
        "source_sentence": "已得道者，內獨歡喜，視妻如視姊弟，視子如知識，無貪愛之心，常慈哀十方諸天人民，",
        "translation": "Those who have attained enlightenment rejoice within themselves, looking after their wives as sisters and brothers, seeing their children as teachers, not covetous or attached, always compassionately pitying the gods and people of the ten directions.",
        "source": "T02n0151_001:0884a15_9"
    },
    {
        "source_sentence": "泥犁、餓鬼、畜生，蜎飛蠕動之類，皆使富貴安隱度脫得泥洹之道，見地蟲當以慈心傷哀之。",
        "translation": "A mud plow, a hungry ghost, an animal, or a flying and wriggling species will all be made wealthy and peaceful and liberated to attain the path of nirvāṇa, and they'll be saddened by seeing earthworms with compassion.",
        "source": "T02n0151_001:0884a17_10"
    },
    {
        "source_sentence": "知生不復癡，能有是意，常念師事佛，如人念父母，如獄中有死罪囚，",
        "translation": "Knowing that sentient beings are no longer deluded, they can have this thought and always think of their teacher as serving the Buddha, just like a man who is mindful of his parents or imprisoned in prison.",
        "source": "T02n0151_001:0884a19_11"
    },
    {
        "source_sentence": "有賢者往請囚，囚黠慧常念賢者恩。",
        "translation": "A good man went there to invite the prisoner, and the prisoner was wise and always mindful of the good man's kindness.",
        "source": "T02n0151_001:0884a21_12"
    },
    {
        "source_sentence": "比丘以得道，常念佛如是，念經如人念飯食。」",
        "translation": "A monk who attains the path always recites the Buddha's name in this way, and he recites the sūtras like a person reciting rice and food.",
        "source": "T02n0151_001:0884a22_13"
    },
    {
        "source_sentence": "佛言：「諸比丘！",
        "translation": "The Buddha said, Monks!",
        "source": "T02n0151_001:0884a24_0"
    },
    {
        "source_sentence": "轉相承事，如弟事兄，中有癡者，當問慧者，展轉相教。",
        "translation": "They are mutually assisting, just as a brother serves his brother, and there's delusion in someone who asks about wisdom and teaches them to each other.",
        "source": "T02n0151_001:0884a24_1"
    },
    {
        "source_sentence": "問慧者，如冥中有燈火，無得陰搆作惡，無得諍訟。",
        "translation": "He who asks about wisdom, it's like a lamp in the darkness that doesn't get aggregates and does evil, and he doesn't get arguments.",
        "source": "T02n0151_001:0884a25_2"
    },
    {
        "source_sentence": "見金銀當如視土，無得妄證人入罪法，無得傳人惡言，轉相鬪語言，無得中傷人意。",
        "translation": "Seeing gold and silver should be like looking at the land, which doesn't allow someone to falsely realize the principle of sinfulness, doesn't allow bad words to be transmitted from person to person, and turns into arguments that don't harm people's minds.",
        "source": "T02n0151_001:0884a26_3"
    },
    {
        "source_sentence": "不聞莫言聞，不見莫言見，行道常當低頭視地，蟲無得蹈殺。",
        "translation": "They don't hear and don't say they hear, don't see and don't say they see, and when they walk the path, they always look down with their heads and feet, so insects won't be allowed to touch or kill them.",
        "source": "T02n0151_001:0884a28_4"
    },
    {
        "source_sentence": "無得自貪人婦女，無得形相人婦女。",
        "translation": "They don't attain self-craving people and women, and they don't attain forms and women.",
        "source": "T02n0151_001:0884a29_5"
    },
    {
        "source_sentence": "坐自思惟，去貪愛之心，乃得為道耳。」",
        "translation": "Sitting and reflecting on it for yourself, he removes the mind of craving and attains the path.",
        "source": "T02n0151_001:0884b01_6"
    },
    {
        "source_sentence": "佛言：「欲求道者，當於空閑處坐，自呼吸其喘息，知息短長，息不報形體皆極，",
        "translation": "The Buddha said: Those who wish to seek enlightenment should take their seats in a quiet place, exhale and pant for themselves. They know that breaths are short and long, and that they do not respond when they are exhaled.",
        "source": "T02n0151_001:0884b02_7"
    },
    {
        "source_sentence": "閉氣不息，形體亦極。",
        "translation": "Their form and essence are also extremely large.",
        "source": "T02n0151_001:0884b04_8"
    },
    {
        "source_sentence": "分別自思惟：『形體誰作者？』",
        "translation": "He discerns and thinks to himself, 'Who is the author of the form body?'",
        "source": "T02n0151_001:0884b04_9"
    },
    {
        "source_sentence": "心當觀外，亦當觀內。",
        "translation": "The mind should contemplate outside, and it should also contemplate inside.",
        "source": "T02n0151_001:0884b05_10"
    },
    {
        "source_sentence": "自思惟歡然，與人有異心，當是時不用天下珍寶，心稍欲隨正道，意復欲小動者，",
        "translation": "At that time he did not use worldly jewels. His mind had some desire to follow the right path, but his intention was to cause others to do so.",
        "source": "T02n0151_001:0884b06_0"
    },
    {
        "source_sentence": "當攝止即還守，意即為還。",
        "translation": "He'll gather it and stop it, which is to return and guard it, and his intention is to return.",
        "source": "T02n0151_001:0884b07_1"
    },
    {
        "source_sentence": "譬如人有鏡，不明不見形，磨去其垢，即自見形。",
        "translation": "It's like when a person has a mirror that doesn't know its shape and removes its dirt, and then they see their own shape.",
        "source": "T02n0151_001:0884b08_2"
    },
    {
        "source_sentence": "人已去貪婬瞋恚愚癡，譬如磨鏡。",
        "translation": "A person who has removed craving, ill-will, anger, and folly is like a mirror that's been polished.",
        "source": "T02n0151_001:0884b09_3"
    },
    {
        "source_sentence": "諦思惟天下，皆無有堅固，亦無有常。」",
        "translation": "Contemplate the fact that there's no firmness in the world, and there's no permanence.",
        "source": "T02n0151_001:0884b10_4"
    },
    {
        "source_sentence": "佛告諸比丘：「持心當如四方石，石在中庭，雨墮亦不能壞，日炙亦不能消，",
        "translation": "The Buddha said to the bhikṣus: One should keep one’s mind fixed like a stone in all four directions. When the stone is in the courtyard, it will not be broken down by rain or when scorched by the heat of the sun.",
        "source": "T02n0151_001:0884b11_5"
    },
    {
        "source_sentence": "風吹亦不能起，持心當如石。」",
        "translation": "Even when the wind blows, it can't arise; its hold will be like a stone.",
        "source": "T02n0151_001:0884b12_6"
    },
    {
        "source_sentence": "佛告諸比丘：「天下人心如流水，中有草木，各自流去，不相顧望，前者亦不顧後，",
        "translation": "The Buddha said to the bhikṣus: The minds of all the people in the world are like running water. There are plants and trees within them, but each goes his separate ways without looking out for the other. Those who come before him also do not look after him.",
        "source": "T02n0151_001:0884b14_0"
    },
    {
        "source_sentence": "後者亦不顧前，草木流行，各自如故。",
        "translation": "The latter doesn't look back, and the grass and trees are prevalent, each as before.",
        "source": "T02n0151_001:0884b15_1"
    },
    {
        "source_sentence": "人心亦如是，一念來一念去，如草木前後不相顧望，於天上天下無所復樂，",
        "translation": "Like grass and trees that do not look at each other in front or behind them, there is no longer any pleasure in heaven or earth.",
        "source": "T02n0151_001:0884b16_2"
    },
    {
        "source_sentence": "寄居天地間，棄身不復生。",
        "translation": "They live between heaven and earth, abandoning their bodies and not being reborn.",
        "source": "T02n0151_001:0884b18_3"
    },
    {
        "source_sentence": "道成乃知師恩，見師者即承事，不見師即思念其教誡，如人念父母，意定乃能有一心，",
        "translation": "Daosheng then knew the teacher’s kindness. When he saw his teacher, he honored him and served him; but when he did not see his teacher, he immediately thought of his instructions. Just as a man who is mindful of his father and mother can concentrate his thoughts on one thing:",
        "source": "T02n0151_001:0884b18_4"
    },
    {
        "source_sentence": "便有哀天下人民蜎飛蠕動之類。",
        "translation": "They'll then have compassion for the people of the world who flee and wriggle.",
        "source": "T02n0151_001:0884b20_5"
    },
    {
        "source_sentence": "坐自笑我已脫身於天下及五道，一者天道，二者人道，三者餓鬼道，四者畜生道，",
        "translation": "Sitting there, he smiled to himself and said, “I am liberated from the realms under heaven and the five realms of rebirth. The first is the realm of gods, the second is the realm of humans, the third is the realm of hungry ghosts, and the fourth is the realm of animals.",
        "source": "T02n0151_001:0884b21_6"
    },
    {
        "source_sentence": "五者泥犁道。",
        "translation": "The fifth is the path of the niraya.",
        "source": "T02n0151_001:0884b23_7"
    },
    {
        "source_sentence": "得阿羅漢者，欲飛行變化即能，身中出水火即能，出無間入無孔亦能，",
        "translation": "Attaining arhatship, he's capable of wanting to fly and transform himself, which is capable of emanating water and fire from his body, and he's capable of emanating without interruption and entering without holes.",
        "source": "T02n0151_001:0884b23_8"
    },
    {
        "source_sentence": "離世間苦取泥洹道亦能。」",
        "translation": "Being free of worldly suffering and grasping to the path of nirvāṇa is also possible.",
        "source": "T02n0151_001:0884b25_9"
    },
    {
        "source_sentence": "佛告諸比丘：「道不可不作，經不可不讀。」",
        "translation": "The Buddha told the monks, You mustn't do so; you mustn't read the sūtras.",
        "source": "T02n0151_001:0884b26_0"
    },
    {
        "source_sentence": "佛說經已，五百沙門皆得阿羅漢。",
        "translation": "After the Buddha taught the sūtras, all five hundred ascetics attained arhatship.",
        "source": "T02n0151_001:0884b26_1"
    },
    {
        "source_sentence": "諸沙門皆起前，以頭面著地為佛作禮。",
        "translation": "The ascetics all rose in front of him and bowed to the Buddha with their heads and faces touching the ground.",
        "source": "T02n0151_001:0884b27_2"
    },
    {
        "source_sentence": "佛說阿含正行經",
        "translation": "Foshuo ahan jing zhengxing jing",
        "source": "T02n0151_001:0884b29_0"
    }
]