[
    {
        "source_sentence": "佛說七處三觀經",
        "translation": "Sutra on the Three Contemplations of the Seven Places",
        "source": "T02n0150A_001:0875b05_0"
    },
    {
        "source_sentence": "後漢安息國三藏安世高譯",
        "translation": "Translated by An Shigao, the Tripiṭaka Master of Anxi in the Later Han Dynasty",
        "source": "T02n0150A_001:0875b07_0"
    },
    {
        "source_sentence": "（一）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(1) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0150A_001:0875b08_0"
    },
    {
        "source_sentence": "佛告：「比丘！」",
        "translation": "The Buddha told him, Monk!",
        "source": "T02n0150A_001:0875b09_0"
    },
    {
        "source_sentence": "比丘應：「然。」",
        "translation": "The monk replied, Yes.",
        "source": "T02n0150A_001:0875b09_1"
    },
    {
        "source_sentence": "佛言：「比丘！",
        "translation": "The Buddha said, Monks!",
        "source": "T02n0150A_001:0875b09_2"
    },
    {
        "source_sentence": "七處為知，三處為觀，疾為在道法脫結，無有結，意脫從黠得法，已見法自證道，",
        "translation": "Seven places are knowledge, three places are contemplation, and sickness is the way to be freed from fetters in the path. There are no fetters.",
        "source": "T02n0150A_001:0875b09_3"
    },
    {
        "source_sentence": "受生盡，行道竟，作可作，不復來還。」",
        "translation": "When he's finished receiving birth, he'll finish the path of practice, do what should be done, and no longer come back.",
        "source": "T02n0150A_001:0875b11_4"
    },
    {
        "source_sentence": "佛問比丘：「何謂為七處為知？",
        "translation": "The Buddha asked the monk, What are the seven places of knowing?",
        "source": "T02n0150A_001:0875b12_5"
    },
    {
        "source_sentence": "是聞比丘，色如本諦知，亦知色習，亦知色盡，亦知色滅度行；",
        "translation": "This learned bhikṣu knows matter as it is in the fundamental truth. He also knows the arising of matter, knows the exhaustion of matter, and knows the path leading to the cessation of matter.",
        "source": "T02n0150A_001:0875b13_0"
    },
    {
        "source_sentence": "亦知色味，亦知色苦，亦知色出要，亦至誠知。",
        "translation": "They also know form and taste, they also know form and suffering, they also know form and its essentials, and they truly know them.",
        "source": "T02n0150A_001:0875b14_1"
    },
    {
        "source_sentence": "如是痛癢、思想、生死、識如本知諦知，亦知識習，亦知識盡，亦知識盡受如本知；",
        "translation": "“In this way they know the truth of pain, itching, thought, transmigration, birth and death, and consciousness as they were originally known. They also know the arising of knowledge, the exhaustion of knowledge, and the experience of the destruction of knowledge as they were originally known.",
        "source": "T02n0150A_001:0875b15_2"
    },
    {
        "source_sentence": "亦知識味，亦知識苦，亦知識出要，亦知識本至誠。",
        "translation": "They also know taste, they know suffering, they know the essentials of liberation, and they know the root of sincerity.",
        "source": "T02n0150A_001:0875b17_3"
    },
    {
        "source_sentence": "何等為色如諦如所？",
        "translation": "What are their forms as truths and objects?",
        "source": "T02n0150A_001:0875b18_4"
    },
    {
        "source_sentence": "色為四大，亦為在四大虺所，色本如是如本知。",
        "translation": "Form is the four elements, and it's also in the place where the four elements are crude; form is originally thus as it was known before.",
        "source": "T02n0150A_001:0875b19_5"
    },
    {
        "source_sentence": "何等為色習如本知？",
        "translation": "What are their accumulations of form as they were originally known?",
        "source": "T02n0150A_001:0875b20_6"
    },
    {
        "source_sentence": "愛習為色習，如是色習為知。",
        "translation": "The arising of craving is the arising of form, and thus the arising of form is knowledge.",
        "source": "T02n0150A_001:0875b20_7"
    },
    {
        "source_sentence": "何等為知？",
        "translation": "What is knowledge?",
        "source": "T02n0150A_001:0875b21_8"
    },
    {
        "source_sentence": "色盡如至誠知，愛盡為色盡，如是色盡為至誠知。",
        "translation": "When form is exhausted, he knows it with utmost sincerity; when craving is exhausted, he knows form; and when form is exhausted, he knows it with utmost sincerity.",
        "source": "T02n0150A_001:0875b21_9"
    },
    {
        "source_sentence": "何等為色行盡如至誠知？",
        "translation": "What is their knowledge of the exhaustion of form and action as they truly are?",
        "source": "T02n0150A_001:0875b22_10"
    },
    {
        "source_sentence": "若所色為是八行，諦見到諦定為八，如是色盡受行如至誠知本。",
        "translation": "If form is the eightfold aspect, the truth of seeing and the truth of meditative attainment are the eight. Such [things] as form in its totality, feeling and volition are as one who knows with utmost sincerity the source.",
        "source": "T02n0150A_001:0875b23_11"
    },
    {
        "source_sentence": "何等為色味如至誠知？",
        "translation": "What are their forms and flavors as they truly know them?",
        "source": "T02n0150A_001:0875b24_12"
    },
    {
        "source_sentence": "所色欲生喜生欲生，如是為味如至誠知。",
        "translation": "Desire for form that gives rise to desire and joy that gives rise to desire, thus is this taste as the ultimate truth of knowing.",
        "source": "T02n0150A_001:0875b25_13"
    },
    {
        "source_sentence": "何等為色惱如至誠知？",
        "translation": "What are their forms and afflictions as they truly know?",
        "source": "T02n0150A_001:0875b26_14"
    },
    {
        "source_sentence": "所色不常苦轉法，如是為色惱如至誠知。",
        "translation": "Form that's impermanent, painful, and evolving dharmas, thus form and affliction are as we know with utmost sincerity.",
        "source": "T02n0150A_001:0875b26_15"
    },
    {
        "source_sentence": "何等為色要如至誠知？",
        "translation": "What's the essential nature of form as they truly know it?",
        "source": "T02n0150A_001:0875b27_16"
    },
    {
        "source_sentence": "所色欲貪能解，能棄欲能度欲，如是為色知要如至誠知。",
        "translation": "The craving for form that's desired can be freed, and the ability to abandon desire and overcome desire can be liberated. Such is the knowledge of form that requires such sincere knowledge.",
        "source": "T02n0150A_001:0875b28_17"
    },
    {
        "source_sentence": "「何等為痛癢？",
        "translation": "What's painful and itchy?",
        "source": "T02n0150A_001:0875c01_0"
    },
    {
        "source_sentence": "能知六痛癢：眼栽痛癢，耳鼻口身意栽痛癢，如是為知痛癢。",
        "translation": "They can know the six kinds of pain and itch: when the eye plants pain and itch, and when the ear, nose, mouth, body, and mind plant pain and itch, this is how they know pain and itch.",
        "source": "T02n0150A_001:0875c01_1"
    },
    {
        "source_sentence": "何等為痛癢習？",
        "translation": "What are their habits of pain and itching?",
        "source": "T02n0150A_001:0875c02_2"
    },
    {
        "source_sentence": "栽習為痛癢習，如是為痛癢習。",
        "translation": "The accumulation of planting is the accumulation of pain and itch, and this is the accumulation of pain and itch.",
        "source": "T02n0150A_001:0875c03_3"
    },
    {
        "source_sentence": "何等為痛癢盡知？",
        "translation": "What is their knowledge of the exhaustion of pain and itch?",
        "source": "T02n0150A_001:0875c04_4"
    },
    {
        "source_sentence": "栽盡為痛癢盡知，如是為痛癢盡知。",
        "translation": "To know the exhaustion of planting is to know the exhaustion of pain and itch, and this is to know the exhaustion of pain and itch.",
        "source": "T02n0150A_001:0875c04_5"
    },
    {
        "source_sentence": "何等為痛癢盡受行？",
        "translation": "What's painful, itchy, and full of sensation and action?",
        "source": "T02n0150A_001:0875c05_6"
    },
    {
        "source_sentence": "若受八行，諦見到諦定意為八，如是痛癢如盡受行為道。",
        "translation": "If he receives eight practices, the noble truth of seeing and concentrating his mind on the noble truths are eight, and so forth, such pain and itch are like the path of acting as if they were all received.",
        "source": "T02n0150A_001:0875c05_7"
    },
    {
        "source_sentence": "何等為痛癢味識？",
        "translation": "What's pain, itch, taste, and consciousness?",
        "source": "T02n0150A_001:0875c07_8"
    },
    {
        "source_sentence": "所為痛癢求可求喜求，如是為痛癢識味為知。",
        "translation": "Seeking what's painful and itchy, seeking what's to be sought, and seeking what's to be sought with joy is thus painful and itchy, and consciousness and taste are known.",
        "source": "T02n0150A_001:0875c07_9"
    },
    {
        "source_sentence": "何等為痛癢惱識？",
        "translation": "What's painful, itchy, and distressing consciousness?",
        "source": "T02n0150A_001:0875c08_10"
    },
    {
        "source_sentence": "所痛癢為不常敗苦惱意，如是為痛癢惱識。",
        "translation": "What's painful and itchy is the mind that doesn't always disintegrate as painful and distressing, and this is the painful and itchy consciousness.",
        "source": "T02n0150A_001:0875c09_11"
    },
    {
        "source_sentence": "何等為痛癢要？",
        "translation": "What's the essential point of pain and itch?",
        "source": "T02n0150A_001:0875c10_12"
    },
    {
        "source_sentence": "所痛癢欲能活為愛，能斷愛貪為自度，如是為痛癢要識如諦知也。",
        "translation": "The desire that pains, itches, and desires are able to live is craving, and the ability to stop craving and desire is self-rescue, which is the essential knowledge of pain and itching as a truth.",
        "source": "T02n0150A_001:0875c10_13"
    },
    {
        "source_sentence": "「何等為思想？",
        "translation": "What's thought?",
        "source": "T02n0150A_001:0875c13_0"
    },
    {
        "source_sentence": "識為身六思想：眼栽思想，耳鼻口身意栽思想，如是是六識思想。",
        "translation": "Consciousness is the sixfold conceptual identification of the body: conceptual identification of the eye, conceptual identification of the ear, nose, mouth, body and mind - these are the six forms of conceptual identification of consciousness.",
        "source": "T02n0150A_001:0875c13_1"
    },
    {
        "source_sentence": "何等為思想習識？",
        "translation": "What's thought and accumulated consciousness?",
        "source": "T02n0150A_001:0875c14_2"
    },
    {
        "source_sentence": "栽習為思想習，如是為思想習識。",
        "translation": "The arising of planting is the arising of conceptual thought. This is the arising of conceptual thought as consciousness.",
        "source": "T02n0150A_001:0875c15_3"
    },
    {
        "source_sentence": "何等為思望？",
        "translation": "What are their thoughts and expectations?",
        "source": "T02n0150A_001:0875c16_0"
    },
    {
        "source_sentence": "惡便望苦會得是故，我為說捨身惡行，若比丘已捨身惡行，便得利便得安隱。",
        "translation": "If a monk has abandoned bad physical actions, he'll attain benefit and then attain peace.",
        "source": "T02n0150A_001:0875c16_1"
    },
    {
        "source_sentence": "是故我為說捨身惡行，口意亦如上說。」",
        "translation": "That's why I explain the bad physical and verbal actions of renunciation for my sake, as explained above.",
        "source": "T02n0150A_001:0875c18_2"
    },
    {
        "source_sentence": "（二）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(2) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0875c19_0"
    },
    {
        "source_sentence": "是時處到佛已，到佛禮便坐，已坐問佛：「何等不守不守身？",
        "translation": "After arriving at the Buddha, he bowed to him and then sat down. Having sat down, he asked the Buddha, What's not guarding and what's not guarding body?",
        "source": "T02n0150A_001:0875c20_1"
    },
    {
        "source_sentence": "何等不守不守口聲？",
        "translation": "What doesn't guard and doesn't guard verbal sounds?",
        "source": "T02n0150A_001:0875c21_2"
    },
    {
        "source_sentence": "何等不守不守意？」",
        "translation": "What's not guarded and what's not guarded?",
        "source": "T02n0150A_001:0875c21_3"
    },
    {
        "source_sentence": "佛便說：「給孤獨家意不守身行，亦不得守口聲行，亦不得守心行，亦不守己行，",
        "translation": "The Buddha then said, An orphaned monk who doesn't guard his bodily actions and doesn't guard his verbal actions, doesn't guard his mental actions, and doesn't guard his own actions.",
        "source": "T02n0150A_001:0875c22_4"
    },
    {
        "source_sentence": "不守身己行，不守口聲己行，不守心身行便腐，聲說便腐，心行亦腐；",
        "translation": "If one does not control body and movement, speech and voice do not control body and movement; if one does not control mind and bodily movements, decay occurs; if one speaks words and sounds, decay occurs; and if one acts mentally, decay occurs.",
        "source": "T02n0150A_001:0875c24_5"
    },
    {
        "source_sentence": "已腐身行聲行心行便不善，死亦不善受亦不善處。",
        "translation": "When the decaying body moves, sound moves, and mind moves, it's unwholesome, and death is also unwholesome to experience and an unwholesome place.",
        "source": "T02n0150A_001:0875c25_6"
    },
    {
        "source_sentence": "譬喻迦羅越！",
        "translation": "It's a metaphor, Kālāmaṇḍarī!",
        "source": "T02n0150A_001:0875c26_7"
    },
    {
        "source_sentence": "若樓若堂屋不覆，若使雨來，柞亦漬椽亦漬壁亦漬，已漬壁亦腐椽亦腐柞亦腐，",
        "translation": "If a building or hall isn't covered, and if it causes rain to come, the brick is also soaked, and the wall that's soaked is also soaked, and the wall that's already soaked is also rotten, and the brick that's rotten is also rotten, and the brick that's rotten is also rotten.",
        "source": "T02n0150A_001:0875c27_0"
    },
    {
        "source_sentence": "譬如是。",
        "translation": "It's like this.",
        "source": "T02n0150A_001:0875c28_1"
    },
    {
        "source_sentence": "迦羅越！",
        "translation": "Kālāditya!",
        "source": "T02n0150A_001:0875c29_2"
    },
    {
        "source_sentence": "己意不守，身行亦不守，口行亦不守，念行亦不守，己意聲身不守便不善，",
        "translation": "They don’t guard their own thoughts, don’t guard their bodily actions, don’t guard verbal actions, don’t guard mental actions, and don’t guard mental states of mindfulness. If they don’t guard their thoughts, sounds, and bodies, then they won’t be good.",
        "source": "T02n0150A_001:0875c29_3"
    },
    {
        "source_sentence": "死便不善受便不善處。」",
        "translation": "When they die, they'll be unwholesome and receive what's unwholesome.",
        "source": "T02n0150A_001:0876a01_4"
    },
    {
        "source_sentence": "迦羅越便問佛：「何等為守令得身守？",
        "translation": "Kālôdayin then asked the Buddha, What's meant by guarding so that he can guard his body?",
        "source": "T02n0150A_001:0876a02_5"
    },
    {
        "source_sentence": "何等為守令得口守？",
        "translation": "What are their guards that enable them to attain verbal guarding?",
        "source": "T02n0150A_001:0876a03_6"
    },
    {
        "source_sentence": "何等為守令得念守？」",
        "translation": "What are they guarded so that they can be guarded by mindfulness?",
        "source": "T02n0150A_001:0876a03_7"
    },
    {
        "source_sentence": "佛告迦羅越：「意已守，身口念索守，己身守己口守己念守，便身不腐便聲不腐便念不腐，",
        "translation": "The Buddha told Kālôdayin, Having guarded his mind, he asks to be guarded by body and speech. He guards himself, guards himself, guards himself by speech, and guards himself by thought; so that the body doesn’t decay and the sound doesn’t decay and the thought doesn’t decay.",
        "source": "T02n0150A_001:0876a04_8"
    },
    {
        "source_sentence": "已不腐身行，已不腐聲行，已不腐念行，死時得善死得善受得善處。",
        "translation": "They don't decay bodily actions, sound actions, or thoughts actions, and at the time of death they attain a good death and a good feeling and a good place.",
        "source": "T02n0150A_001:0876a06_9"
    },
    {
        "source_sentence": "譬喻，迦羅越！",
        "translation": "It's a metaphor, Kālāditya!",
        "source": "T02n0150A_001:0876a07_10"
    },
    {
        "source_sentence": "若樓若堂屋上覆蓋，若便雨來，柞亦不漬椽亦不漬壁亦不漬，已不漬壁亦不腐椽亦不腐柞亦不腐，",
        "translation": "If a tower or hall is covered by a roof, and if it rains, the brick isn't wet, the brick isn't wet, the wall isn't wet, and the wall isn't wet; and the wall that hasn't been wet doesn't decay.",
        "source": "T02n0150A_001:0876a08_11"
    },
    {
        "source_sentence": "如是譬喻。",
        "translation": "It's like this metaphor.",
        "source": "T02n0150A_001:0876a10_12"
    },
    {
        "source_sentence": "意以守，身亦守口亦守，己意身口守，便死時善死便善受持便得善處。」",
        "translation": "When the mind guards it, the body guards it and the mouth guards it, and when he guards his own mind, his body and mouth guard it, and when he dies, he'll be well-departed, well-maintained, and then he'll attain a good place.",
        "source": "T02n0150A_001:0876a10_13"
    },
    {
        "source_sentence": "佛從後說絕：「不守意者，邪疑故，亦睡眠故，魔便得自在。",
        "translation": "The Buddha then said, Not guarding one's mind, because of wrong doubt and also because of drowsiness, Māra will attain mastery.",
        "source": "T02n0150A_001:0876a12_14"
    },
    {
        "source_sentence": "如是但當守意，若欲諦行但當見諦行，亦當知內出已，不墮睡眠，便得斷苦本。」",
        "translation": "Thus, you should only guard your mind; if you practice the path of the truth of desire but practice the path of seeing the truth, you should also know that after emerging from within, you won't fall into sleep and will then be able to stop the source of suffering.",
        "source": "T02n0150A_001:0876a13_15"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0876a15_16"
    },
    {
        "source_sentence": "（三）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(3) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0876a16_0"
    },
    {
        "source_sentence": "佛告比丘：「有三輩人。",
        "translation": "The Buddha told the monks, There are three groups of people.",
        "source": "T02n0150A_001:0876a17_1"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T02n0150A_001:0876a17_2"
    },
    {
        "source_sentence": "一輩眼不見，二輩一眼，三輩兩眼。",
        "translation": "The eyes of one group don't see it, the eyes of two groups have one eye, and the eyes of three groups have both.",
        "source": "T02n0150A_001:0876a17_3"
    },
    {
        "source_sentence": "無有眼為何等？",
        "translation": "What's the eye that doesn't exist?",
        "source": "T02n0150A_001:0876a18_4"
    },
    {
        "source_sentence": "世間比丘有人無有是眼因緣，我當為未得治生，當為治生，無有是意已得，",
        "translation": "Monks, there are people in the world who say, “There is no such eye as the cause and condition for [this] eye. Therefore, I am bound to be reborn because I have not yet attained it or will attain it.” There is no such thing as a mind that has already attained it.",
        "source": "T02n0150A_001:0876a18_5"
    },
    {
        "source_sentence": "亦復妄用，亦無有是眼，我當為布施，我當為作福，令我從是因緣後世善樂，",
        "translation": "I will perform meritorious deeds for the sake of charity, so that from this cause and condition I may attain goodness and happiness in future lives.",
        "source": "T02n0150A_001:0876a20_6"
    },
    {
        "source_sentence": "亦從是上天無有計，是名為無有眼。",
        "translation": "Also, there's no discrimination from these higher heavens, which is called having no eyes.",
        "source": "T02n0150A_001:0876a22_7"
    },
    {
        "source_sentence": "一眼人名為何等？",
        "translation": "What's the name of a person with one eye?",
        "source": "T02n0150A_001:0876a23_8"
    },
    {
        "source_sentence": "世間比丘一眼者，有如是眼，令我未得財當為得，已得財當為莫折減，",
        "translation": "A monk in the world with one eye has this kind of eye, which causes me to attain wealth that I have not yet attained, and what I have already attained should not be diminished.",
        "source": "T02n0150A_001:0876a23_9"
    },
    {
        "source_sentence": "但有是眼無有是眼，我當為幻布施，當從是因緣得上天，無有如是眼，",
        "translation": "But if there is an eye like this and no eye like that, I will give it as a magical gift, and from this cause and condition I will attain the highest heaven.",
        "source": "T02n0150A_001:0876a25_10"
    },
    {
        "source_sentence": "是名為一眼。",
        "translation": "This is called one eye.",
        "source": "T02n0150A_001:0876a26_11"
    },
    {
        "source_sentence": "兩眼名為何等？",
        "translation": "What are the names of these two eyes?",
        "source": "T02n0150A_001:0876a27_0"
    },
    {
        "source_sentence": "世間比丘有人有是眼，令我未得財產當為得致，已致得當為莫折減，有如是眼，",
        "translation": "Monks, there are people in the world who have this kind of vision that will cause me to attain property that I have not yet attained. If I have attained it, don’t let it diminish. There are those who have such eyes",
        "source": "T02n0150A_001:0876a27_1"
    },
    {
        "source_sentence": "亦復有是眼，令我行布施，令從是因緣上天，亦有是眼，是名為兩眼人。",
        "translation": "They also have this eye, which causes me to practice generosity and cause the gods up there from these causes and conditions to also have this eye, which is called a person with two eyes.",
        "source": "T02n0150A_001:0876a29_2"
    },
    {
        "source_sentence": "「從後說想盡識，栽盡為思想盡識，如是為思想盡識。",
        "translation": "“From the latter, it's said that the cessation of perception and consciousness is the cessation of thought as the end of consciousness, and this is the end of thought as the end of consciousness.",
        "source": "T02n0150A_001:0876b01_3"
    },
    {
        "source_sentence": "何等為思想盡受行識？",
        "translation": "What are their thoughts, feelings, volitions, and consciousnesses?",
        "source": "T02n0150A_001:0876b03_0"
    },
    {
        "source_sentence": "是為八行識識，諦見到諦定意為八，如是盡思想受行識。",
        "translation": "These are the eight conditioned consciousnesses of volition and consciousness. In truth, the view-attainer and the one concentrating on the truths constitute eight. Such is the exhaustion of thoughts, feelings, formations, and conscious constructs.",
        "source": "T02n0150A_001:0876b03_1"
    },
    {
        "source_sentence": "何等為思想味識？",
        "translation": "What are their thoughts, tastes, and consciousnesses?",
        "source": "T02n0150A_001:0876b04_2"
    },
    {
        "source_sentence": "所為思想因緣生樂得意憙，如是為思想味識。",
        "translation": "The thoughts that are the causes and conditions for what's contemplated give rise to happiness and good intentions, and this is called the thought-taste consciousness.",
        "source": "T02n0150A_001:0876b05_3"
    },
    {
        "source_sentence": "何等為思想惱識？",
        "translation": "What's thought that disturbs consciousness?",
        "source": "T02n0150A_001:0876b06_4"
    },
    {
        "source_sentence": "所為思想不常盡苦轉法，如是為思想惱識。",
        "translation": "The thought that's contemplated doesn't always end the teaching of suffering and change, and thus it's called the thought that disturbs consciousness.",
        "source": "T02n0150A_001:0876b06_5"
    },
    {
        "source_sentence": "何等為思想要識？",
        "translation": "What's the essential consciousness of thought?",
        "source": "T02n0150A_001:0876b07_6"
    },
    {
        "source_sentence": "所思想欲貪能解，欲貪能斷，欲貪能自度，如是為思想要識。",
        "translation": "Desire and craving that are contemplated can be liberated, desire and craving can be stopped, and desire and craving can save themselves. This is the essential consciousness of thought.",
        "source": "T02n0150A_001:0876b08_7"
    },
    {
        "source_sentence": "「何等為生死識？",
        "translation": "What's the consciousness of birth and death?",
        "source": "T02n0150A_001:0876b10_0"
    },
    {
        "source_sentence": "為六身生死識，眼栽生死識，耳鼻口身意栽行，如是為生死識。",
        "translation": "For the sake of the six conscious constructs of birth-and-death in the body, the eye plants birth-and-death consciousness, and the ear, nose, mouth, body, and mind plant their actions, this is the consciousness of birth-and-death.",
        "source": "T02n0150A_001:0876b10_1"
    },
    {
        "source_sentence": "何等為生死習？",
        "translation": "What are their habits of birth and death?",
        "source": "T02n0150A_001:0876b11_2"
    },
    {
        "source_sentence": "栽習為生死習識。",
        "translation": "The cultivation of planting is the accumulated consciousness of birth-and-death.",
        "source": "T02n0150A_001:0876b12_3"
    },
    {
        "source_sentence": "何等為生死盡識？",
        "translation": "What's the end of birth and death consciousness?",
        "source": "T02n0150A_001:0876b12_4"
    },
    {
        "source_sentence": "栽盡為生死盡識。",
        "translation": "The exhaustion of planting is the exhaustion of birth and death consciousness.",
        "source": "T02n0150A_001:0876b13_5"
    },
    {
        "source_sentence": "何等為生死欲盡受行識？",
        "translation": "What's birth-and-death that wants to end sensation, volition, and consciousness?",
        "source": "T02n0150A_001:0876b13_6"
    },
    {
        "source_sentence": "為是八行識，諦見至諦定為八，如是為生死欲滅受行識。",
        "translation": "These are the eight conditioned conscious constructs. The seeing of the truths and the absoṟption from the truths to the absolute truths constitute eight. This is so for birth, death, desire, cessation, feeling, action, and consciousness.",
        "source": "T02n0150A_001:0876b14_7"
    },
    {
        "source_sentence": "何等為生死味識？",
        "translation": "What's the taste consciousness of birth and death?",
        "source": "T02n0150A_001:0876b15_8"
    },
    {
        "source_sentence": "所為生死因緣生樂喜意，如是為生死味識。",
        "translation": "This is the taste consciousness of birth-and-death that gives rise to happiness and joy as causes and conditions for birth-and-death.",
        "source": "T02n0150A_001:0876b15_9"
    },
    {
        "source_sentence": "何等為生死惱識？",
        "translation": "What's birth-and-death disturbing consciousness?",
        "source": "T02n0150A_001:0876b16_10"
    },
    {
        "source_sentence": "所有生死不常盡苦轉法，如是為生死惱識。",
        "translation": "All births and deaths that are impermanent, endless, painful, and evolving dharmas are thus the afflictive consciousness of birth-and-death.",
        "source": "T02n0150A_001:0876b17_11"
    },
    {
        "source_sentence": "何等為生死要識？",
        "translation": "What's the essential consciousness of birth and death?",
        "source": "T02n0150A_001:0876b18_12"
    },
    {
        "source_sentence": "所為生死欲貪隨欲貪能斷欲能度，如是為生死要識。",
        "translation": "The desire for birth-and-death and the desire for subsequent desires that can cut off desire and liberate it, such is the essential consciousness of birth-and-death.",
        "source": "T02n0150A_001:0876b18_13"
    },
    {
        "source_sentence": "「何等為識身？",
        "translation": "What's the body of consciousness?",
        "source": "T02n0150A_001:0876b20_0"
    },
    {
        "source_sentence": "六衰識，眼栽識，耳鼻口身意栽識，如是為識識。",
        "translation": "The six consciousnesses of decay, the eye planted consciousness, and the ears, nose, mouth, body, and mind planted consciousness, are thus called consciousness.",
        "source": "T02n0150A_001:0876b20_1"
    },
    {
        "source_sentence": "何等為識習？",
        "translation": "What's the accumulation of consciousness?",
        "source": "T02n0150A_001:0876b21_2"
    },
    {
        "source_sentence": "命字習為識習，如是習為識。",
        "translation": "Accumulation of the letter ‘life’ is the accumulation of consciousness. Such accumulation is consciousness.",
        "source": "T02n0150A_001:0876b21_3"
    },
    {
        "source_sentence": "何等為識盡受行為識？",
        "translation": "What's the consciousness that ends sensation and acts as consciousness?",
        "source": "T02n0150A_001:0876b22_4"
    },
    {
        "source_sentence": "命字盡為盡識，如是為識盡。",
        "translation": "The letter ‘destruction of life’ is the destruction of consciousness. This is the destruction of consciousness.",
        "source": "T02n0150A_001:0876b23_0"
    },
    {
        "source_sentence": "何等為識盡受行為識？",
        "translation": "What's the consciousness that ends sensation and acts as consciousness?",
        "source": "T02n0150A_001:0876b23_1"
    },
    {
        "source_sentence": "八行，諦見至諦定為八，如是為識盡欲受行如諦識。",
        "translation": "Eight aspects: the seeing of the truths up to the concentration of the truths as eight. In this way, it is the consciousness that experiences and acts on the cessation of sensual desire as a truth.",
        "source": "T02n0150A_001:0876b24_2"
    },
    {
        "source_sentence": "何等為識味知所識？",
        "translation": "What's consciousness that tastes and knows what's conscious?",
        "source": "T02n0150A_001:0876b25_3"
    },
    {
        "source_sentence": "因緣故生樂生喜意，如是為味生為味識知。",
        "translation": "Because of causes and conditions, happiness arises and joy arises, and thus the taste arises and the taste consciousness knows.",
        "source": "T02n0150A_001:0876b25_4"
    },
    {
        "source_sentence": "何等為識惱識？",
        "translation": "What's consciousness that disturbs consciousness?",
        "source": "T02n0150A_001:0876b26_5"
    },
    {
        "source_sentence": "所識為盡為苦為轉，如是為識惱識。",
        "translation": "The consciousnesses that are exhausted, which are painful and which are transformed, are thus the consciousnesses that are disturbed.",
        "source": "T02n0150A_001:0876b27_6"
    },
    {
        "source_sentence": "何等為要識？",
        "translation": "What's the essential consciousness?",
        "source": "T02n0150A_001:0876b28_0"
    },
    {
        "source_sentence": "所識欲貪能活欲貪能度，如是為要識。",
        "translation": "Desire and craving that are recognized can give rise to desire and craving that can be liberated, and this is the essential consciousness.",
        "source": "T02n0150A_001:0876b28_1"
    },
    {
        "source_sentence": "「如是比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0150A_001:0876b29_2"
    },
    {
        "source_sentence": "七處為覺知。",
        "translation": "The seven places are perceived.",
        "source": "T02n0150A_001:0876b29_3"
    },
    {
        "source_sentence": "何等為七？",
        "translation": "What are these seven?",
        "source": "T02n0150A_001:0876b29_4"
    },
    {
        "source_sentence": "色習盡道味苦要，是五陰各有七事。",
        "translation": "The five aggregates each have seven things: the arising of matter, the exhaustion of accumulation, the path, relishing and unsatisfactoriness.",
        "source": "T02n0150A_001:0876b29_5"
    },
    {
        "source_sentence": "何等為三觀？",
        "translation": "What are these three?",
        "source": "T02n0150A_001:0876c01_6"
    },
    {
        "source_sentence": "識亦有七事，得五陰成六衰，觀身為一色，觀五陰為二，觀六衰為三，",
        "translation": "Consciousness also has seven things: it acquires the five aggregates, becoming six and decaying. It is observed that the body is one material form; it is observed that the five aggregates are two; and it is observed that the six and decaying are three.",
        "source": "T02n0150A_001:0876c02_7"
    },
    {
        "source_sentence": "故言三觀。",
        "translation": "That's why it's called the three contemplations.",
        "source": "T02n0150A_001:0876c03_8"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0876c03_9"
    },
    {
        "source_sentence": "能曉七處亦能三觀，不久行修道斷結，無有結意，脫黠活，見道見要，",
        "translation": "He can understand the seven sense-fields and also three contemplations. Soon he practices the path of cultivation to abandon fetters, has no fetters in his mind, liberates himself wisely, and sees the essentials of enlightenment.",
        "source": "T02n0150A_001:0876c03_10"
    },
    {
        "source_sentence": "一證受止，已斷生死意行，所作竟，不復來還生死，得道。」",
        "translation": "One, he realizes the cessation of sensation, stops the mental functioning of birth-and-death, finishes what he's done, doesn't return to birth-and-death again, and attains the path.",
        "source": "T02n0150A_001:0876c05_11"
    },
    {
        "source_sentence": "佛說如是，比丘歡喜受行。",
        "translation": "When the Buddha said this, the monk rejoiced and accepted it.",
        "source": "T02n0150A_001:0876c06_12"
    },
    {
        "source_sentence": "（四）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(4) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0876c08_0"
    },
    {
        "source_sentence": "佛便告比丘：「有四著。",
        "translation": "The Buddha then told the monk, There are four attachments.",
        "source": "T02n0150A_001:0876c09_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0876c09_2"
    },
    {
        "source_sentence": "一為欲著，二為世間著，三為見著，四為癡著。",
        "translation": "One is attachment to desire, two are worldly attachments, three are view attachments, and four are deluded attachments.",
        "source": "T02n0150A_001:0876c09_3"
    },
    {
        "source_sentence": "亦有四離不著，離欲不著，離世間不著，離見不著，離癡不著。」",
        "translation": "There are also four that are free of attachment and not attached, free of desire and not attached, free of worldly attachment, free of views and not attached, and free of delusion and not attached.",
        "source": "T02n0150A_001:0876c10_4"
    },
    {
        "source_sentence": "從後說絕：「欲見著癡繞，從是因緣在世間，亦從是受身，若能捨欲亦得離世間，",
        "translation": "From the latter, it's said to be cut off, saying, Desire and views are addicted to delusion, which is the reason they're in the world and the body received from them. If they can abandon desire, they'll also be freed from the world.",
        "source": "T02n0150A_001:0876c12_5"
    },
    {
        "source_sentence": "見亦得斷，癡亦得滅，是得通樂見在，亦無為從一切著，不復著亦不復隨生死。」",
        "translation": "Seeing also attains cessation, and delusion also attains cessation, which is the view of attaining supernormal knowledge and bliss that's present, has nothing to do with all attachments, doesn't become attached again, and doesn't follow birth and death.",
        "source": "T02n0150A_001:0876c14_6"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0876c16_7"
    },
    {
        "source_sentence": "（五）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(5) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0876c17_0"
    },
    {
        "source_sentence": "佛便告比丘：「思想有四顛倒，意見亦爾。",
        "translation": "The Buddha then told the monk, There are four mistaken thoughts and so are the opinions.",
        "source": "T02n0150A_001:0876c18_1"
    },
    {
        "source_sentence": "從是顛倒為人身矇為綜為人意撰，不能走為走，今世後世自惱，居世間為生死不得離。",
        "translation": "From this mistake, it's because the person's body is deluded and compiled for the benefit of others, unable to walk or not able to walk, self- tormented in present and future lives, and abiding in the world for birth and death that they can't escape.",
        "source": "T02n0150A_001:0876c19_0"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0876c21_0"
    },
    {
        "source_sentence": "一為非常為常，是為思想顛倒、為意顛倒、為見顛倒。",
        "translation": "One is that it's neither permanent nor eternal, which are mistaken thoughts, mistaken thoughts of mind, and mistaken views.",
        "source": "T02n0150A_001:0876c21_1"
    },
    {
        "source_sentence": "二者以苦為樂。",
        "translation": "The second is that they take suffering as pleasure.",
        "source": "T02n0150A_001:0876c22_2"
    },
    {
        "source_sentence": "三者非身為身。",
        "translation": "Three, it's not the body body body body.",
        "source": "T02n0150A_001:0876c22_3"
    },
    {
        "source_sentence": "四者不淨為淨，為思為意為見顛倒。」",
        "translation": "The fourth is that what's impure is pure, and what's considered to be thought or thought is mistaken in views.",
        "source": "T02n0150A_001:0876c23_4"
    },
    {
        "source_sentence": "從後說絕：「非常人意為常，思苦為樂，不應身用作身，不淨見淨，顛倒如是，",
        "translation": "From the latter, it's said that impermanent people and minds are permanent, and contemplation of suffering as pleasure; they shouldn't use body to create body, which is impure and view pure, mistakenly like this.",
        "source": "T02n0150A_001:0876c23_5"
    },
    {
        "source_sentence": "意業離，便助摩不宜欲得宜，今致老死。",
        "translation": "When mental activity is free of it, it's not appropriate to help moisten it and wants to attain its benefit, but now it causes old age and death.",
        "source": "T02n0150A_001:0876c26_6"
    },
    {
        "source_sentence": "譬喻犢母，已有佛在世間，念天上天下得道眼度世，便見是法除一切苦，",
        "translation": "It's like a Vātsīputrīya, who already has a Buddha in the world and is mindful of the heavenly realm under heaven when he attains the eye of enlightenment to save the world, and then sees this teaching to remove all suffering.",
        "source": "T02n0150A_001:0876c27_7"
    },
    {
        "source_sentence": "亦說苦從生亦度苦，亦見賢者八種行通至甘露，已聞是法者，便見非常苦非身，",
        "translation": "It is also said that suffering proceeds from birth and also liberates one from suffering. One also sees the eightfold practice of the wise up to the realm of immortality. Those who have already heard this doctrine will see that it is neither eternally painful nor bodily.",
        "source": "T02n0150A_001:0876c29_8"
    },
    {
        "source_sentence": "亦身已不淨見不淨，便無所畏，得樂見世，得無為，從一切惱度世無所著。」",
        "translation": "Also, once his body is impure and views are impure, he has no fear, sees the world with pleasure, attains nothingness, and liberates the world from all afflictions without attachment.",
        "source": "T02n0150A_001:0877a01_9"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0877a03_10"
    },
    {
        "source_sentence": "（六）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(6) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877a04_0"
    },
    {
        "source_sentence": "佛便告比丘：「四施為人同心。",
        "translation": "The Buddha then told the monk, The four kinds of giving are for people with the same mind.",
        "source": "T02n0150A_001:0877a05_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0877a05_2"
    },
    {
        "source_sentence": "一為布施，二為相愛，三為利，四為同利。",
        "translation": "One is for generosity, two are for love of characteristics, three are for profit, and four are for the same profit.",
        "source": "T02n0150A_001:0877a06_0"
    },
    {
        "source_sentence": "第一說布施為何等？",
        "translation": "What's the first one that explains generosity?",
        "source": "T02n0150A_001:0877a06_1"
    },
    {
        "source_sentence": "無極布施不過於法。",
        "translation": "Unexcelled generosity is nothing but the Dharma.",
        "source": "T02n0150A_001:0877a07_2"
    },
    {
        "source_sentence": "第二相愛，不過於數，聞經亦開意。",
        "translation": "The second is craving for characteristics, but it's only counting, and listening to the sūtras also enlighten one's mind.",
        "source": "T02n0150A_001:0877a07_3"
    },
    {
        "source_sentence": "第三利不過不信令信，教人上，不持戒者令持戒，不學者令學，慳者令布施，",
        "translation": "The third benefit is only to cause those who don’t believe to believe and teach others to do so. Those who don’t keep the precepts are asked to keep the precepts, those who lack learning are asked to learn, and those who are stingy are asked to make donations.",
        "source": "T02n0150A_001:0877a08_4"
    },
    {
        "source_sentence": "愚者令黠，牽出入正道。",
        "translation": "Foolishness makes them clever, leading them out and into the right path.",
        "source": "T02n0150A_001:0877a10_5"
    },
    {
        "source_sentence": "第四同利，極同利無有過阿羅漢，阿那含、斯陀含、須陀洹亦爾，持戒者同利。」",
        "translation": "The fourth benefit is the same as the ultimate benefit, and there's nothing beyond that of an arhat; so are the non-returners, sakṛdāgāmins, and stream-winners who observe precepts the same benefit.",
        "source": "T02n0150A_001:0877a10_6"
    },
    {
        "source_sentence": "從後說絕。",
        "translation": "From then on, it's said to be cut off.",
        "source": "T02n0150A_001:0877a12_7"
    },
    {
        "source_sentence": "（七）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(7) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877a13_0"
    },
    {
        "source_sentence": "佛告比丘：「有四行法輪，令天亦人從是四輪行，若墮人天，是輪法行便得尊一得豪，",
        "translation": "The Buddha said to the bhikṣus: There are four aspects of the wheel of the Dharma that enable gods and humans also to follow these four aspects. If they fall into the human realm, this aspect of the wheel of the Dharma will lead to the attainment of the distinction of honored one and the acquisition of greatness.",
        "source": "T02n0150A_001:0877a14_1"
    },
    {
        "source_sentence": "從善法行。",
        "translation": "It's from the practice of good qualities.",
        "source": "T02n0150A_001:0877a15_2"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0877a16_3"
    },
    {
        "source_sentence": "一為善群居。",
        "translation": "One, it's for the sake of good living in groups.",
        "source": "T02n0150A_001:0877a16_4"
    },
    {
        "source_sentence": "二為依賢者。",
        "translation": "The second is to rely on the good man.",
        "source": "T02n0150A_001:0877a16_5"
    },
    {
        "source_sentence": "三者知諦願。",
        "translation": "The third is the vow to know the truth.",
        "source": "T02n0150A_001:0877a17_0"
    },
    {
        "source_sentence": "四為宿命有福行。」",
        "translation": "Fourth, it's because of the meritorious actions of past lives.",
        "source": "T02n0150A_001:0877a17_1"
    },
    {
        "source_sentence": "從後說絕：「善群居依賢者，為知諦願宿命行，為樂得無有憂，得善自在。」",
        "translation": "From the latter, it's said to be cut off, Good people who live in a good group rely on the good person for the sake of knowing the truth and wishing to do what they did in their past lives so that they can happily attain freedom without sorrow and attain goodness.",
        "source": "T02n0150A_001:0877a17_2"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0877a19_3"
    },
    {
        "source_sentence": "（八）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(8) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877a20_0"
    },
    {
        "source_sentence": "佛告比丘：「人有四輩。",
        "translation": "The Buddha told the monks, There are four groups of people.",
        "source": "T02n0150A_001:0877a21_1"
    },
    {
        "source_sentence": "有人自護身不護他人身，有人護他人身不自護身，有人亦不自護亦不護他人，",
        "translation": "“Some people protect their own bodies but they do not protect the bodies of others. Some people protect the bodies of others but they do not protect their own bodies. Some people neither protect themselves nor others.",
        "source": "T02n0150A_001:0877a21_2"
    },
    {
        "source_sentence": "有人亦自護亦護他人。」",
        "translation": "Some people also protect themselves and protect others.",
        "source": "T02n0150A_001:0877a23_3"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0877a23_4"
    },
    {
        "source_sentence": "（九）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(9) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877a25_0"
    },
    {
        "source_sentence": "佛告比丘：「人有四輩。",
        "translation": "The Buddha told the monks, There are four groups of people.",
        "source": "T02n0150A_001:0877a26_1"
    },
    {
        "source_sentence": "有人自護身不護他人身，有人護他人身不自護身，有人亦不自護亦不護他人，",
        "translation": "“Some people protect their own bodies but they do not protect the bodies of others. Some people protect the bodies of others but they do not protect their own bodies. Some people neither protect themselves nor others.",
        "source": "T02n0150A_001:0877a26_2"
    },
    {
        "source_sentence": "有人亦自護亦護他人。",
        "translation": "Some people also protect themselves and protect others.",
        "source": "T02n0150A_001:0877a28_3"
    },
    {
        "source_sentence": "是人不自護亦不護他人，是最下賤人；",
        "translation": "Such a person is not protecting himself and not protecting others. This is the lowest and most despicable among people.",
        "source": "T02n0150A_001:0877a28_4"
    },
    {
        "source_sentence": "護他人不自護是勝上；",
        "translation": "Protecting others and not protecting oneself is superior.",
        "source": "T02n0150A_001:0877a29_5"
    },
    {
        "source_sentence": "若人自護不護他人是勝上；",
        "translation": "If someone protects himself and doesn’t protect others, they are the most superior.",
        "source": "T02n0150A_001:0877b01_6"
    },
    {
        "source_sentence": "若自護亦護他是勝上。",
        "translation": "If he protects himself and protects others, he'll be superior.",
        "source": "T02n0150A_001:0877b01_7"
    },
    {
        "source_sentence": "若如是人最第一。」",
        "translation": "If such a person is the best, then he'll be the best.",
        "source": "T02n0150A_001:0877b02_8"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0877b02_9"
    },
    {
        "source_sentence": "（一〇）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(10) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877b04_0"
    },
    {
        "source_sentence": "佛告比丘：「有四輩雲，第一但有雷無有雨。",
        "translation": "The Buddha told the monks, There are four groups of clouds, but the first has thunder and no rain.",
        "source": "T02n0150A_001:0877b05_1"
    },
    {
        "source_sentence": "第二但有雨無有雷。",
        "translation": "Second, there's only rain and no thunder.",
        "source": "T02n0150A_001:0877b06_2"
    },
    {
        "source_sentence": "第三亦無雨亦無雷。",
        "translation": "The third is that there's neither rain nor thunder.",
        "source": "T02n0150A_001:0877b06_3"
    },
    {
        "source_sentence": "第四亦有雨亦有雷。",
        "translation": "The fourth is that there's rain and thunder as well.",
        "source": "T02n0150A_001:0877b07_0"
    },
    {
        "source_sentence": "譬喻如雲，人亦有四輩，一者人但有雷無有雨。",
        "translation": "It's like a cloud, for example, where there are four groups of people and one group of people who only have thunder and no rain.",
        "source": "T02n0150A_001:0877b07_1"
    },
    {
        "source_sentence": "二者但有雨無有雷。",
        "translation": "Two, there's only rain and no thunder.",
        "source": "T02n0150A_001:0877b08_2"
    },
    {
        "source_sentence": "三者無有雷無有雨。",
        "translation": "Third, there is neither thunder nor rain.",
        "source": "T02n0150A_001:0877b09_0"
    },
    {
        "source_sentence": "四者亦有雷亦有雨。",
        "translation": "Fourth, there's thunder and rain as well.",
        "source": "T02n0150A_001:0877b09_1"
    },
    {
        "source_sentence": "何等人為有雷無有雨？",
        "translation": "What kind of people have thunder and no rain?",
        "source": "T02n0150A_001:0877b09_2"
    },
    {
        "source_sentence": "是間比丘一人但說經，上亦說善，中亦說善，要亦說善，有行分別，但要具行見要，",
        "translation": "One of the bhikṣus in this assembly simply taught the sūtras. The superior also taught what is wholesome. The middle also taught what is wholesome. What is essential is also said to be wholesome. There is discretion as to whether it is practiced or not:",
        "source": "T02n0150A_001:0877b10_3"
    },
    {
        "source_sentence": "亦自不知法，亦不知法法如行，是人名為但有雷無有雨。",
        "translation": "They don't know the teaching themselves, and they don't know the teaching as it is practiced; this person is called someone who only has thunder and no rain.",
        "source": "T02n0150A_001:0877b12_4"
    },
    {
        "source_sentence": "何等為但有雨無有雷？",
        "translation": "Why is there only rain and no thunder?",
        "source": "T02n0150A_001:0877b13_5"
    },
    {
        "source_sentence": "是間有人亦不說法經，上亦不說善，中亦不說善，要亦不說善，亦無有行分別，",
        "translation": "“Some people here also do not expound the doctrine of the scriptures. Nor do they teach what is good at the top [of the discourse], nor do they teach what is good in the middle [of the discourse]. Nor do they teach what is good at the end [of the discourse], nor do they teach what is good and there is no discrimination of conditioned states",
        "source": "T02n0150A_001:0877b14_6"
    },
    {
        "source_sentence": "亦不要具行不見要，但意在法中行和利行，亦如法，亦受法法行，亦同行隨法，",
        "translation": "Nor should he practice in accordance with the teaching or not according to the essentials. Rather, his mind should be directed toward practicing harmonious and beneficial conduct within the doctrine, thus following the Teaching, enabling them to receive the teaching of the doctrine as well as acting in accordance with it.",
        "source": "T02n0150A_001:0877b16_0"
    },
    {
        "source_sentence": "是人為但有雨無有雷。",
        "translation": "Why is it that there's only rain and no thunder?",
        "source": "T02n0150A_001:0877b17_1"
    },
    {
        "source_sentence": "何等為無有雨亦無有雷？",
        "translation": "What's the absence of rain and thunder?",
        "source": "T02n0150A_001:0877b18_2"
    },
    {
        "source_sentence": "為不說經，上亦不說善，中亦不說善，要亦不說善，分別亦不說，善要具行亦不說，",
        "translation": "Why is it that the sūtras are not spoken of? The above also does not speak of what is wholesome. The intermediate one does not speak of what is wholesome. The essential one does not speak of what is wholesome. The discriminating one does not speak of [what is] good.",
        "source": "T02n0150A_001:0877b18_3"
    },
    {
        "source_sentence": "善法亦自不解，到法亦自不行，是人名為無有雨無有雷。",
        "translation": "Good qualities don't themselves understand them, and they don't follow the teachings themselves when they reach them, which is called having no rain and no thunder.",
        "source": "T02n0150A_001:0877b20_4"
    },
    {
        "source_sentence": "何等為亦有雨亦有雷？",
        "translation": "What's why there's rain and thunder as well?",
        "source": "T02n0150A_001:0877b22_5"
    },
    {
        "source_sentence": "是間有人說經法，上亦說善，中亦說善，要亦說善，分別亦說善，要具行亦自解，",
        "translation": "“Some people here teach the doctrine of the scriptures. The superior also teaches what is wholesome. The middle one also teaches what is wholesome. Those who need to be taught are also said to be wholesome. Those who discriminate are also said to be wholesome, and those who have practiced well are also themselves liberated.",
        "source": "T02n0150A_001:0877b22_6"
    },
    {
        "source_sentence": "法到法法亦知，行亦說，善亦自在法中解，到法法行亦自知解，是人為亦有雨亦有雷。」",
        "translation": "When the Dharma reaches the Dharma, he also knows it, practices it, explains it, understands it well and freely understands it, and when he reaches the Dharma and practices it, he knows and understands it himself; this is a person who has rain and thunder.",
        "source": "T02n0150A_001:0877b24_7"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0877b26_8"
    },
    {
        "source_sentence": "（一一）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(21) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877b27_0"
    },
    {
        "source_sentence": "佛便告比丘：「有四舍。",
        "translation": "The Buddha then told the monk, There are four houses.",
        "source": "T02n0150A_001:0877b28_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0877b28_2"
    },
    {
        "source_sentence": "一者為舍舍，二為守舍，三為護舍，四為行舍。",
        "translation": "They are (1) the dwelling, (2) the guardian dwelling, (3) the dwelling for protection, and (4) the dwelling for practice.",
        "source": "T02n0150A_001:0877b28_3"
    },
    {
        "source_sentence": "何等為舍舍者？",
        "translation": "What are their dwellings?",
        "source": "T02n0150A_001:0877b29_4"
    },
    {
        "source_sentence": "念來不受不聲舍曉離遠，若以瞋恚亦從欺不聲舍曉離遠，是名為舍舍。",
        "translation": "When he's mindful and doesn't accept the noiseless sheds that are far away from him, or when he's angry and deceives the noiseless sheds that are far away from him because of his anger, this is called a shed.",
        "source": "T02n0150A_001:0877c01_5"
    },
    {
        "source_sentence": "何等為守舍者？",
        "translation": "What are their guardians of the house?",
        "source": "T02n0150A_001:0877c02_6"
    },
    {
        "source_sentence": "眼已見色。",
        "translation": "The eye has seen form.",
        "source": "T02n0150A_001:0877c03_7"
    },
    {
        "source_sentence": "不受相不觀相，若從因緣見惡生。",
        "translation": "If they don't experience characteristics and don't contemplate characteristics, then they'll see bad birth from causes and conditions.",
        "source": "T02n0150A_001:0877c03_8"
    },
    {
        "source_sentence": "若從因緣見癡，若從因緣見不可意，若從因緣見弊惡意起。",
        "translation": "If they see delusion from causes and conditions, if they see what's unwholesome from causes and conditions, or if they see bad and bad thoughts that arise from causes and conditions.",
        "source": "T02n0150A_001:0877c04_9"
    },
    {
        "source_sentence": "便自守受行福，守眼耳鼻口身意。",
        "translation": "They then guard themselves for the merit of performing good deeds and guard their eyes, ears, nose, mouth, body, and mind.",
        "source": "T02n0150A_001:0877c05_10"
    },
    {
        "source_sentence": "為如法不受相，如上說，是名為守舍。",
        "translation": "Because they don't receive characteristics according to the teaching, as explained above, this is called guarding the house.",
        "source": "T02n0150A_001:0877c06_11"
    },
    {
        "source_sentence": "何等為護舍？",
        "translation": "What are their shelters?",
        "source": "T02n0150A_001:0877c07_12"
    },
    {
        "source_sentence": "是間比丘比丘已生所非一善相，若紅汁膖脹，若狐犬半食，若血流赤，",
        "translation": "If there's not a single good sign that a monk or monk has produced, if red juice is coarse and swollen, if a fox or dog eats halfway, or if blood flows out in red,",
        "source": "T02n0150A_001:0877c07_13"
    },
    {
        "source_sentence": "若青黑腐，若骨白，若髑髏，熟諦視視，善護令意莫失善相，是名為護舍。",
        "translation": "If it's blue, black, decayed, white, or a skull, they should carefully examine it and guard it well so that the mind doesn't lose its good characteristics, which is called a guardian dwelling.",
        "source": "T02n0150A_001:0877c09_0"
    },
    {
        "source_sentence": "何等為行舍？",
        "translation": "What are their dwellings of practice?",
        "source": "T02n0150A_001:0877c10_1"
    },
    {
        "source_sentence": "是間比丘比丘覺意行離故，別分故，分別遠故，如是到至觀覺意，是名為行舍。」",
        "translation": "This is called the practice house when a monk or monk's awakening mind and practice are separated, distinct, and distant from each other, thus arriving at the awakening mind of contemplation in this way.",
        "source": "T02n0150A_001:0877c10_2"
    },
    {
        "source_sentence": "從後說絕：「守舍亦護亦行，是名為四舍，諦說如是，賢者行是不中止，",
        "translation": "From the latter, it's said to be cut off, What's guarded and what's practiced are called the four dwellings, which are truly explained like this, but the good man's practice is not stopped.",
        "source": "T02n0150A_001:0877c12_3"
    },
    {
        "source_sentence": "為盡苦得道。」",
        "translation": "In order to end suffering and attain the path, he said.",
        "source": "T02n0150A_001:0877c14_4"
    },
    {
        "source_sentence": "佛說如是，弟子起禮佛受行。",
        "translation": "The Buddha said so, and the disciple bowed to the Buddha and accepted his practice.",
        "source": "T02n0150A_001:0877c14_5"
    },
    {
        "source_sentence": "（一二）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(12) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877c16_0"
    },
    {
        "source_sentence": "佛告比丘：「若比丘有四行，不自侵要近無為。",
        "translation": "The Buddha told the monks, Suppose a monk has four practices that don't violate themselves and approach nothingness.",
        "source": "T02n0150A_001:0877c17_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0877c18_2"
    },
    {
        "source_sentence": "是間比丘比丘持戒行戒中，律根亦閉至自守意，飯食節度，不多食不喜多食，",
        "translation": "Among the monks and bhikṣus who observe precepts and practice precepts, the faculty of restraint is likewise closed up to self-restraint. They are frugal in eating and drinking but they don't eat much and don't delight in eating much.",
        "source": "T02n0150A_001:0877c18_3"
    },
    {
        "source_sentence": "上夜後夜常守行，是為四行。",
        "translation": "These are the four practices of always guarding one’s conduct during the night before and after midnight.",
        "source": "T02n0150A_001:0877c20_4"
    },
    {
        "source_sentence": "比丘不自侵亦近無為。」",
        "translation": "A monk who doesn't attack himself and approaches nothingness.",
        "source": "T02n0150A_001:0877c20_5"
    },
    {
        "source_sentence": "從後說絕：「若比丘立戒根，亦攝食，亦知節度，亦不離覺，如是行精進，",
        "translation": "If a monk establishes the faculty of morality and also includes food, knows moderation, and doesn't part with feelings, then he practices this kind of exertion.",
        "source": "T02n0150A_001:0877c21_6"
    },
    {
        "source_sentence": "上夜後夜不中止。",
        "translation": "It doesn't stop for the night before or after midnight.",
        "source": "T02n0150A_001:0877c23_7"
    },
    {
        "source_sentence": "要不自侵減，要近無為。」",
        "translation": "They mustn't attack themselves and decrease, and they must approach nothingness.",
        "source": "T02n0150A_001:0877c23_8"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0877c24_9"
    },
    {
        "source_sentence": "（一三）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(13) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0877c25_0"
    },
    {
        "source_sentence": "佛便告比丘：「若賢者家中居法行侵四家得歡喜。",
        "translation": "The Buddha then told the monk, Suppose a good man lives at home and violates the four houses of the Dharma practice and becomes joyous.",
        "source": "T02n0150A_001:0877c26_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0877c27_2"
    },
    {
        "source_sentence": "一者父母妻子，二者兒客奴婢，三者知識親屬交友，四者王天王鬼神、沙門婆羅門。」",
        "translation": "1. their parents, wives, children, guests, servants, friends, relatives, and friends, and 4. kings, gods, ghosts, spirits, ascetics, and brāhmaṇas.",
        "source": "T02n0150A_001:0877c27_3"
    },
    {
        "source_sentence": "從後說絕：「父母亦監沙門亦婆羅門，天祠亦爾，居家信祠，若干人故，",
        "translation": "From then on, it was said to be extinguished, saying, “My parents are both śramaṇas and brāhmaṇas. The deva temples are the same as well.",
        "source": "T02n0150A_001:0877c29_4"
    },
    {
        "source_sentence": "能事持戒親屬，亦彼人見在生者，亦不犯天王親屬，亦自身一切人亦受恩。",
        "translation": "Those who serve their relatives who uphold the precepts and also see them in birth don't violate the god king's relatives, and all of them themselves are also given kindness.",
        "source": "T02n0150A_001:0878a02_5"
    },
    {
        "source_sentence": "如是居黠生，是聞善行得豪，亦名聞現世，無有說盡，後世上天。」",
        "translation": "Thus, the wise living being who hears good deeds and attains greatness is also called hearing in the present life; there's nothing to say that it's up in the heavens of later generations.",
        "source": "T02n0150A_001:0878a04_0"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0878a05_1"
    },
    {
        "source_sentence": "（一四）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(24) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0878a06_0"
    },
    {
        "source_sentence": "是時，他婆羅門到佛已，到佛便問佛起居，已問起居便問佛：「何因緣，",
        "translation": "At that time, the other brāhmaṇa approached the Buddha. On arriving there, he asked him how to rise and stay at home. Having done so, he said to the Buddha, “Through what cause and condition is it that you have come here?",
        "source": "T02n0150A_001:0878a07_1"
    },
    {
        "source_sentence": "賢者！",
        "translation": "Good man!",
        "source": "T02n0150A_001:0878a08_2"
    },
    {
        "source_sentence": "今世人少顏色無有力，多病少壽不大豪？」",
        "translation": "Nowadays, people have little color and lack power, and they're often sick and short-lived, not very powerful.",
        "source": "T02n0150A_001:0878a08_3"
    },
    {
        "source_sentence": "佛報告婆羅門：「今世婆羅門非法貪世間，橫欲行意墮非法，以是輩人自洿念墮非法，",
        "translation": "The Buddha reported this to the brāhmaṇas: In the present world, brahmans are unlawfully greedy with worldly desires and indulge in sexual misconduct. Because of their compassion for these people, they think that they will be unlawful.",
        "source": "T02n0150A_001:0878a09_4"
    },
    {
        "source_sentence": "橫墮貪非是是習者，便從是因緣日月不正行；",
        "translation": "Those who fall into craving horizontally and not as a condition, then from these causes and conditions the sun and moons do not act correctly.",
        "source": "T02n0150A_001:0878a11_5"
    },
    {
        "source_sentence": "已不正行，便星宿亦不正行；",
        "translation": "If one does not proceed correctly, the stars and constellations also do not proceed correctly.",
        "source": "T02n0150A_001:0878a12_6"
    },
    {
        "source_sentence": "已星宿不正行，便日月亦不正，時歲亦不正；",
        "translation": "If the stars and constellations do not move correctly, neither does the sun nor moon move correctly. The seasons and years are also not right.",
        "source": "T02n0150A_001:0878a13_7"
    },
    {
        "source_sentence": "已時歲不正，便漏刻時不正；",
        "translation": "If the years are not right, then the time is not right for the carvings.",
        "source": "T02n0150A_001:0878a14_8"
    },
    {
        "source_sentence": "已漏刻時不正，便有橫風；",
        "translation": "When the carving is not correctly done, a gust of wind blows horizontally.",
        "source": "T02n0150A_001:0878a15_0"
    },
    {
        "source_sentence": "已有橫風，便天不時時雨墮；",
        "translation": "There is already a horizontal wind that blows and causes rain to fall from time to time in the sky.",
        "source": "T02n0150A_001:0878a15_1"
    },
    {
        "source_sentence": "已天不時時雨墮，便若人種地便不時，生熟得不如意；",
        "translation": "When the rain does not fall at the proper time in heaven, it is like when someone plants seeds but does so at an ungodly hour.",
        "source": "T02n0150A_001:0878a16_2"
    },
    {
        "source_sentence": "已不時生熟，所穀若人食，若畜生飛鳥，便少色、少力、多病、少命、少豪，",
        "translation": "If someone eats the grain or an animal or a flying bird, they’ll have little color, little strength, much illness, little life, and little wealth.",
        "source": "T02n0150A_001:0878a17_3"
    },
    {
        "source_sentence": "是為，婆羅門！",
        "translation": "That's right, Brāhmaṇa!",
        "source": "T02n0150A_001:0878a19_0"
    },
    {
        "source_sentence": "本是因緣，今世人少色、少力、多病、少命、少豪。」",
        "translation": "Originally, this was the cause and condition, but now people have few forms, little strength, much illness, little life, and little wealth.",
        "source": "T02n0150A_001:0878a19_1"
    },
    {
        "source_sentence": "便婆羅門持頭禮佛：「已覺知，從今已後，自歸佛、自歸法、自歸比丘僧。」",
        "translation": "The Brāhmaṇa then bowed his head to the Buddha and said, I've realized that from now on, I will take refuge in the Buddha, Dharma, and monks and nuns for myself.",
        "source": "T02n0150A_001:0878a20_2"
    },
    {
        "source_sentence": "佛說教如是。",
        "translation": "The Buddha teaches and teaches thus.",
        "source": "T02n0150A_001:0878a21_3"
    },
    {
        "source_sentence": "（一五）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(15) Thus I have heard: One time, the Buddha was staying at Sāvatthī, walking in Anāthapiṇḍada Park in Jeta’s Grove.",
        "source": "T02n0150A_001:0878a23_0"
    },
    {
        "source_sentence": "佛便告比丘：「五福時布施。",
        "translation": "The Buddha then addressed the monk, Giving at the time of the five virtues.",
        "source": "T02n0150A_001:0878a24_1"
    },
    {
        "source_sentence": "何等為五福？",
        "translation": "What are the five kinds of merit?",
        "source": "T02n0150A_001:0878a24_2"
    },
    {
        "source_sentence": "一者遠來布施，二者為欲去布施，三為病瘦布施，四為穀貴時布施，五為嘗新，",
        "translation": "The first is to give alms for the sake of those who have come from afar, the second for the sake of those who want to leave home, the third for the sake of those who are ill and thin, the fourth for the sake of grain when it’s valuable, and the fifth for the sake of those who taste new food.",
        "source": "T02n0150A_001:0878a25_0"
    },
    {
        "source_sentence": "未自食當為上，與持戒者行者，從後自食為福。」",
        "translation": "Those who haven't eaten themselves will be the best, and those who practice with someone who observes precepts will be the best, and those who eat themselves afterward will be the best.",
        "source": "T02n0150A_001:0878a26_1"
    },
    {
        "source_sentence": "從後說絕：「黠人時與信，行無有慳意，時與賢者淨意無有疑，福從無有量。」",
        "translation": "From the latter, it's said to be cut off, A wise person who practices with faith at the right time and doesn't have stinginess in his mind when he acts, and a good man with pure intentions at the right time has no doubt in his mind, and merit follows measurelessly.",
        "source": "T02n0150A_001:0878a27_2"
    },
    {
        "source_sentence": "佛說如是，比丘受行歡喜。",
        "translation": "The Buddha said so, and the monk was delighted when he accepted it.",
        "source": "T02n0150A_001:0878a29_3"
    },
    {
        "source_sentence": "（一六）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(161) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0878b02_0"
    },
    {
        "source_sentence": "佛便告比丘：「賢者布施有五品。",
        "translation": "The Buddha then told the monk, Good man, there are five kinds of generosity.",
        "source": "T02n0150A_001:0878b03_1"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T02n0150A_001:0878b03_2"
    },
    {
        "source_sentence": "一者為賢者信與布施，二為多與，三為自手與，四為時與，五為不侵他人與。」",
        "translation": "One is to give generosity for the sake of a good man's faith, two for the sake of giving much, three for the sake of giving with one's own hands, four for the sake of giving at the right time, and five for the sake of not encroaching on others.",
        "source": "T02n0150A_001:0878b04_3"
    },
    {
        "source_sentence": "佛復告比丘：「信與布施得何等福？",
        "translation": "Again, the Buddha told the monk, What merit does faith and generosity attain?",
        "source": "T02n0150A_001:0878b05_4"
    },
    {
        "source_sentence": "信與者，為得與者為得富多，所有多財產、多珍寶、多可意、多好器物，",
        "translation": "A donor who believes in giving because he wants to give and obtains wealth, possesses a great deal of possessions, rare treasures, good intentions, and beautiful objects.",
        "source": "T02n0150A_001:0878b06_5"
    },
    {
        "source_sentence": "世間亦信信者，是比丘信布施福。",
        "translation": "The world also believes in faith, which is a monk who believes in the merit of generosity.",
        "source": "T02n0150A_001:0878b08_6"
    },
    {
        "source_sentence": "何等為多與富？",
        "translation": "What are their many and their riches?",
        "source": "T02n0150A_001:0878b08_7"
    },
    {
        "source_sentence": "如上頭說，亦從父母得愛敬難，兄弟亦敬難，妻子亦敬難，兒從奴婢亦敬難，",
        "translation": "As explained above, it's also difficult to love and respect from parents, the brothers are also difficult to respect, the wife is also difficult to respect, and the children are also difficult to respect from slaves and maids.",
        "source": "T02n0150A_001:0878b09_8"
    },
    {
        "source_sentence": "知識邊人亦敬難，五種親屬皆敬難，是比丘從多與福。",
        "translation": "A monk who knows that it's difficult to be respected by people at the side of friends and has difficulty respecting five kinds of relatives, this is a monk who gives merit from many.",
        "source": "T02n0150A_001:0878b10_9"
    },
    {
        "source_sentence": "自手與，得何等自手與為富？",
        "translation": "If you give it with your own hands, what kind of wealth will you attain by giving it with your own hands?",
        "source": "T02n0150A_001:0878b12_10"
    },
    {
        "source_sentence": "如上說，亦為家中所有意得樂，得第一可、第一衣、第一床臥具自意得樂，",
        "translation": "As explained above, they'll also attain happiness for the sake of their own intentions at home, attaining the first approval, the first garment, and the first bed and bedding that will themselves attain happiness.",
        "source": "T02n0150A_001:0878b12_11"
    },
    {
        "source_sentence": "色聲香味細滑自意得樂，是比丘為從自手與得福。",
        "translation": "When form, sound, odor, fineness, subtlety, and slipperiness are obtained by one's own mind, that monk gives them to someone else from his own hand to obtain merit.",
        "source": "T02n0150A_001:0878b14_12"
    },
    {
        "source_sentence": "何等為時與福？",
        "translation": "What's the time and merit?",
        "source": "T02n0150A_001:0878b15_13"
    },
    {
        "source_sentence": "時與福者，為富如上說，亦命欲盡時，財產珍寶物現在對，如意不散四面，",
        "translation": "The time and the blessed one are spoken of for the rich as above. Also, when life is about to end, possessions and rare treasures will not be scattered on all sides at will.",
        "source": "T02n0150A_001:0878b16_14"
    },
    {
        "source_sentence": "是比丘時與福。",
        "translation": "That monk is given merit at the right time.",
        "source": "T02n0150A_001:0878b17_15"
    },
    {
        "source_sentence": "何等為比丘不侵他人行布施福？",
        "translation": "What's the merit of a monk who doesn't attack others and practices generosity?",
        "source": "T02n0150A_001:0878b18_16"
    },
    {
        "source_sentence": "不侵他人持戒行布施者，為富如上說，若有所從精進治生，自從手臂勤力，",
        "translation": "Those who don't encroach on others to observe precepts and practice generosity will be described as wealthy as above. If they are disciplined by effort from the strength of their arms upward,",
        "source": "T02n0150A_001:0878b18_17"
    },
    {
        "source_sentence": "寒苦致犯治得，便從是無有能橫奪福者，縣官盜賊水火皆不能得害，亦無有用費不可意，",
        "translation": "If there's cold and suffering that causes offenses to be committed and corrected, then there's no one who can steal merit from it. County officials, thieves, thieves, thieves, thieves, water, or fire can't get harmed, and there's no need for expense or non-thought.",
        "source": "T02n0150A_001:0878b20_18"
    },
    {
        "source_sentence": "是比丘不侵他人行布施福。」",
        "translation": "That monk doesn't encroach on the merits of others who practice generosity.",
        "source": "T02n0150A_001:0878b22_19"
    },
    {
        "source_sentence": "從後說絕：「信多自手與時與，不侵他人賢者布施，如是從與施，得樂無有極分別，",
        "translation": "From the latter, it's said to be cut off, Faithful people give with their own hands at the right time and don't violate the generosity of other good men. Thus, when they give from giving, they attain happiness without extreme discrimination.",
        "source": "T02n0150A_001:0878b23_20"
    },
    {
        "source_sentence": "行福亦分別。」",
        "translation": "The merit of practice is also discriminated.",
        "source": "T02n0150A_001:0878b25_21"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0878b25_22"
    },
    {
        "source_sentence": "（一七）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0878b26_0"
    },
    {
        "source_sentence": "佛便告比丘：「若人意在五法中，設使聞佛法教，不應除塵垢，亦不得道眼。",
        "translation": "The Buddha then told the monk, Suppose someone's intention is to focus on five dharmas, and if they hear the Buddha's teaching of the Dharma, they shouldn't remove the dust and dirt, and they won't attain the eye of enlightenment.",
        "source": "T02n0150A_001:0878b27_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0878b28_2"
    },
    {
        "source_sentence": "一者若惱說經者，二者若求便，三者若求窮，四者聞亦邪念意著他因緣，",
        "translation": "One, if he disturbs someone who teaches the sūtras; two, if he seeks an opportunity; three, if he seeks to exhaust it; and four, if he hears [the teaching] but also wrongly thinks of others as causes and conditions for attachment.",
        "source": "T02n0150A_001:0878b29_0"
    },
    {
        "source_sentence": "五者亦無有自高意，令所聞分別好醜。",
        "translation": "Five, they don't have self-exalted intentions, causing what they hear to discriminate good and bad.",
        "source": "T02n0150A_001:0878c01_1"
    },
    {
        "source_sentence": "若人意隨是五法，設使聞佛說法，不應自解塵垢，亦不應生法眼。」",
        "translation": "If someone's mind follows these five things, then even if they hear the Buddha teach the Dharma, they shouldn't free themselves from the defilement of dust or give rise to the Dharma eye.",
        "source": "T02n0150A_001:0878c02_2"
    },
    {
        "source_sentence": "佛復告比丘：「有五法，若人意在五法，即聞佛所教行法，為應自解塵垢，",
        "translation": "Again, the Buddha said to the bhikṣus: There are five kinds of doctrinal items that should be avoided by one who is mindful of these five kinds of doctrinal items.",
        "source": "T02n0150A_001:0878c04_0"
    },
    {
        "source_sentence": "亦應得道眼。",
        "translation": "They should also attain the eye of enlightenment.",
        "source": "T02n0150A_001:0878c05_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0878c05_2"
    },
    {
        "source_sentence": "一者無有惡意在說經者；",
        "translation": "The first is that there is no evil intent in those who teach the scriptures.",
        "source": "T02n0150A_001:0878c06_3"
    },
    {
        "source_sentence": "二者亦不求經中長短，有疑問解休；",
        "translation": "The second is that they do not seek length or shortcomings in the scriptures, and are free from doubt and understanding.",
        "source": "T02n0150A_001:0878c06_4"
    },
    {
        "source_sentence": "三者意亦不在色，意亦不在他因緣；",
        "translation": "The third is that thought also does not abide in form, and neither does thought have any other cause or condition.",
        "source": "T02n0150A_001:0878c07_5"
    },
    {
        "source_sentence": "四者亦自有黠意能解善惡；",
        "translation": "The fourth is that they themselves have wise intentions and are able to understand good and evil.",
        "source": "T02n0150A_001:0878c08_6"
    },
    {
        "source_sentence": "五者分別自知；",
        "translation": "The fifth is discriminating one’s own knowledge.",
        "source": "T02n0150A_001:0878c09_0"
    },
    {
        "source_sentence": "是五法。",
        "translation": "These are the five dharmas.",
        "source": "T02n0150A_001:0878c09_1"
    },
    {
        "source_sentence": "若人意隨是五法，能得自解塵垢，一為不惱說經者，二為不求經中長短，",
        "translation": "If someone follows these five things in their minds, they'll be able to free themselves from the defilement of dust. One is to explain the sūtras without offending them, and two is not to seek length or shortness in the sūtras.",
        "source": "T02n0150A_001:0878c09_2"
    },
    {
        "source_sentence": "三為不求窮，四者為亦不邪念，五為亦自有黠意，能分別白黑。」",
        "translation": "Third, it's because they don't seek extremes, fourth, because they don't have wrong thoughts, and fifth, because they have the wise intention to discern between white and black.",
        "source": "T02n0150A_001:0878c11_3"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0878c12_4"
    },
    {
        "source_sentence": "（一八）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(18) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0878c13_0"
    },
    {
        "source_sentence": "佛便告比丘：「五行見一。",
        "translation": "The Buddha then addressed the monk, Five practices are seen as one.",
        "source": "T02n0150A_001:0878c14_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0878c14_2"
    },
    {
        "source_sentence": "若行者有行者，是身從頭至手足，上髮頭腦皮，如有滿若干種不淨相，",
        "translation": "If the practitioner has a practitioner, this body is from the head to the hands and feet, up to the top of the head and brain skin, as if it were filled with various kinds of impure characteristics.",
        "source": "T02n0150A_001:0878c14_3"
    },
    {
        "source_sentence": "觀是身有髮、毛、爪、齒、血脈、肌肉、筋骨、脾、腎、大腸、小腸、大小腹、大便、小便、淚、汗、洟、唾、肝、肺、心、膽、血、肥膏、髓、風、熱、頂[寧*頁]，",
        "translation": "He observes that his body has hair, nails, nails, teeth, blood vessels, flesh, sinews, bones, spleen, kidneys, large and small intestines, large and small intestines, abdomen big and small, urinating and excreting, tears, sweat, abscess pain, spittle, liver, lungs, heart, gall",
        "source": "T02n0150A_001:0878c16_4"
    },
    {
        "source_sentence": "若有是計是為第一念到見一。",
        "translation": "If someone thinks this to be the first thought up to the point where they see one, then...",
        "source": "T02n0150A_001:0878c19_0"
    },
    {
        "source_sentence": "若行者復計如上說，意不動在他如上說意念，是賢者第二行見一。",
        "translation": "If a practitioner further calculates as explained above, and his mind doesn't move when others think of it as explained above, this is the second practice of the good man who sees one.",
        "source": "T02n0150A_001:0878c19_1"
    },
    {
        "source_sentence": "若行者復觀是，如上說受識行，計是識為今世耶？",
        "translation": "If a practitioner further observes this, as explained above, feeling and consciousness are conditioned by sensation, so is it considered to be consciousness in the present life?",
        "source": "T02n0150A_001:0878c21_2"
    },
    {
        "source_sentence": "為後世耶？",
        "translation": "Is for the sake of later generations?",
        "source": "T02n0150A_001:0878c22_3"
    },
    {
        "source_sentence": "若行者有是意，是為第三行見一。",
        "translation": "If a practitioner has this thought, this is the third practice that sees oneness.",
        "source": "T02n0150A_001:0878c22_4"
    },
    {
        "source_sentence": "若行者念計如上說，為計觀識今世、後世無有止處，若行者覺是計，是為第四行見一。",
        "translation": "If a practitioner conceptualizes mindfulness as explained above in order to conceptualize and observe that consciousness has no place of abiding in the present or future lives, and if a practitioner perceives it as conceptualization, this is the fourth practice that sees one.",
        "source": "T02n0150A_001:0878c23_5"
    },
    {
        "source_sentence": "若行者計如上說，人有識人計是事，是人今世、後世無有止處，已不得淨觀一，",
        "translation": "If practitioners conceptualize it as explained above, and people with consciousnesses conceptualize it as a thing, this person has no place to stay in the present life or future life, and hasn't yet attained the pure contemplation of one.",
        "source": "T02n0150A_001:0878c25_6"
    },
    {
        "source_sentence": "若行者有是意解是計，為第五淨行見一。」",
        "translation": "If a practitioner has this intention and understands that it's imagination, the fifth pure practice is to see one.",
        "source": "T02n0150A_001:0878c27_7"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0878c28_0"
    },
    {
        "source_sentence": "（一九）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(19) Thus I have heard: One time, the Buddha was staying at Sāvatthī, walking in Jeta’s Grove, Anāthapiṇḍika’s Park.",
        "source": "T02n0150A_001:0878c29_0"
    },
    {
        "source_sentence": "佛便告比丘：「五因緣，比丘！",
        "translation": "The Buddha then addressed the monks, For five reasons, monks!",
        "source": "T02n0150A_001:0879a01_1"
    },
    {
        "source_sentence": "令人眼不止，為生癡、為壞黠、為惱人，令不得無為。",
        "translation": "It causes the eyes to stop, and it's for the sake of producing delusion, destroying intelligence, and disturbing people that they can't attain nothingness.",
        "source": "T02n0150A_001:0879a01_2"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879a02_3"
    },
    {
        "source_sentence": "一者愛欲，二者瞋恚，三者睡眠，四者五樂，五者疑不信。」",
        "translation": "One is craving, two are anger, three are sleep, four are the five pleasures, and five are doubts and disbelief.",
        "source": "T02n0150A_001:0879a03_4"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879a04_5"
    },
    {
        "source_sentence": "（二〇）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(20) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0879a05_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「步行有五德。",
        "translation": "At the time, the Buddha told the monk, Walking has five virtues.",
        "source": "T02n0150A_001:0879a06_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879a06_2"
    },
    {
        "source_sentence": "一者能走，二者有力，三者除睡，四者飯食易消不作病，五者為行者易得定意，",
        "translation": "One, they can walk; two, they are strong; three, they get rid of drowsiness; four, food and drink are easy to digest and not cause illness; and five, it is easy for practitioners to attain concentration.",
        "source": "T02n0150A_001:0879a07_3"
    },
    {
        "source_sentence": "已得定意為久。」",
        "translation": "It's been a long time since I attained concentration.",
        "source": "T02n0150A_001:0879a09_0"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879a09_1"
    },
    {
        "source_sentence": "（二一）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(21) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0879a10_0"
    },
    {
        "source_sentence": "佛便告比丘：「若有比丘五法行，能在山上亦澤中居，能草蓐居臥。",
        "translation": "The Buddha then told the monk, If a monk practices five things, he'll be able to live on the mountain and in the marsh, and he'll be able to sit or lie on grass.",
        "source": "T02n0150A_001:0879a11_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879a12_2"
    },
    {
        "source_sentence": "一者能持戒不犯，攝守學戒；",
        "translation": "The first is to be able to keep the precepts without transgressing them, by taking care of observing and learning the precepts.",
        "source": "T02n0150A_001:0879a12_3"
    },
    {
        "source_sentence": "二亦能攝根門守行；",
        "translation": "The second is that they are also able to embrace the aspects of faculties and practices.",
        "source": "T02n0150A_001:0879a13_4"
    },
    {
        "source_sentence": "三亦能行精進，亦有精進力，親不離要，不捨精進至得道；",
        "translation": "The third is also able to make effort. He also has the power of energy, being intimate and not detached from the essentials; he does not give up energy in order to reach enlightenment.",
        "source": "T02n0150A_001:0879a14_5"
    },
    {
        "source_sentence": "四已受佛律自曉了；",
        "translation": "Having received the Buddha’s precepts, they know for themselves.",
        "source": "T02n0150A_001:0879a15_6"
    },
    {
        "source_sentence": "五聞經亦易解諦。",
        "translation": "The five kinds of hearing the sūtras are also easy to understand the truth.",
        "source": "T02n0150A_001:0879a15_7"
    },
    {
        "source_sentence": "若行者受是五法，如上說能得居山上亦澤中。」",
        "translation": "If a practitioner receives these five dharmas, as explained above, he'll be able to live on the mountain and also in the marsh.",
        "source": "T02n0150A_001:0879a16_8"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879a17_9"
    },
    {
        "source_sentence": "（二二）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(21) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0879a18_0"
    },
    {
        "source_sentence": "是時，佛告阿難：「一切，阿難！",
        "translation": "The Buddha then addressed Ānanda, All of you, Ānanda!",
        "source": "T02n0150A_001:0879a19_1"
    },
    {
        "source_sentence": "我說身不可行惡，口意亦爾。」",
        "translation": "I say you mustn't do evil with body, and so it is with speech and thought.",
        "source": "T02n0150A_001:0879a19_2"
    },
    {
        "source_sentence": "阿難便白佛：「一切身口意不可行惡，人不止為作，從是作望幾惡？」",
        "translation": "Ānanda then said to the Buddha, You mustn't do evil with body, speech, or mind, and people don't stop doing it; how many evil deeds can you expect to do from this?",
        "source": "T02n0150A_001:0879a20_3"
    },
    {
        "source_sentence": "佛告阿難：「為五惡。",
        "translation": "The Buddha told Ānanda, For five bad reasons.",
        "source": "T02n0150A_001:0879a21_4"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879a22_5"
    },
    {
        "source_sentence": "一為自欺身，二者為亦欺他人，三為語時上下不可賢者意，四為十方不名聞，",
        "translation": "The first is to deceive themselves; the second is to deceive others; the third is not to follow the ways of the wise when they speak; and the fourth is not to be known in the ten directions.",
        "source": "T02n0150A_001:0879a22_6"
    },
    {
        "source_sentence": "五為已死墮地獄。」",
        "translation": "Five, it's because they've died and fallen into hell.",
        "source": "T02n0150A_001:0879a24_7"
    },
    {
        "source_sentence": "佛復告阿難：「一切，阿難！",
        "translation": "Again, the Buddha told Ānanda, All of you, Ānanda!",
        "source": "T02n0150A_001:0879a25_0"
    },
    {
        "source_sentence": "身善行，我教為可作，口意亦爾。」",
        "translation": "Good bodily actions are what I teach to be done, and so are words and thoughts.",
        "source": "T02n0150A_001:0879a25_1"
    },
    {
        "source_sentence": "阿難復白：「佛說一切身善行我教當為行，口意亦爾。",
        "translation": "Ānanda again said, The Buddha teaches that all good bodily actions of self and what I teach should be done, and so is verbal action.",
        "source": "T02n0150A_001:0879a26_2"
    },
    {
        "source_sentence": "人亦行是行，欲望幾福？」",
        "translation": "How much merit does a person who practices this practice want?",
        "source": "T02n0150A_001:0879a27_3"
    },
    {
        "source_sentence": "佛告阿難：「為五福。",
        "translation": "The Buddha told Ānanda, For five merits.",
        "source": "T02n0150A_001:0879a28_0"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T02n0150A_001:0879a28_1"
    },
    {
        "source_sentence": "一為不自欺身，二為亦不欺他人，三為語言上下可賢者意，四為十方名聞，",
        "translation": "The first is to not deceive oneself; the second is not to deceive others; the third is to speak for the sake of superiors and inferiors who are worthy of praise; and the fourth is to be known in all quarters.",
        "source": "T02n0150A_001:0879a28_2"
    },
    {
        "source_sentence": "五為已死上天。」",
        "translation": "Five, it's because they've died up in the heavens.",
        "source": "T02n0150A_001:0879b01_3"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879b01_4"
    },
    {
        "source_sentence": "（二三）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(23) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0879b02_0"
    },
    {
        "source_sentence": "佛便告比丘：「有五惱，人人相依可。",
        "translation": "The Buddha then told the monk, There are five kinds of anguish that make people rely on each other.",
        "source": "T02n0150A_001:0879b03_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879b03_2"
    },
    {
        "source_sentence": "若比丘人人相依可已，有時依有過，便比丘僧不欲見；",
        "translation": "If a bhikṣu allows the people to rely on each other, and if there is sometimes a mistake in relying on one another, then the bhikṣus and the sangha will not wish to see him.",
        "source": "T02n0150A_001:0879b04_3"
    },
    {
        "source_sentence": "出便相依者，念所我相依者，比丘僧便出不欲見。",
        "translation": "Those who come out and then rely on each other: those who are mindful of the mutual dependence of self and what's supported by self, the monks and nuns come out and don't want to see it.",
        "source": "T02n0150A_001:0879b05_4"
    },
    {
        "source_sentence": "便愛著意不欲至比丘聚，我何以當復至比丘聚，便不復行；",
        "translation": "So he became addicted and did not want to go to the assembly of monks. Why would I go again to the assembly of monks? Then he stopped walking.",
        "source": "T02n0150A_001:0879b06_5"
    },
    {
        "source_sentence": "已聚不復行，便不復見比丘聚；",
        "translation": "When the assembly has been assembled, he does not proceed any more. Then he will no longer see the assembly of monks.",
        "source": "T02n0150A_001:0879b07_6"
    },
    {
        "source_sentence": "已不復見比丘聚，便不聞法；",
        "translation": "Having no longer seen the assembly of monks, they will not hear the Dharma.",
        "source": "T02n0150A_001:0879b08_7"
    },
    {
        "source_sentence": "已不聞法便不墮法，便離法便不在法，是比丘第一惱人人相依。",
        "translation": "If someone doesn't hear the teaching, they won't fall into the teaching; if they part with the teaching, they won't be in the teaching; this is the first monk who disturbs people's mutual dependence.",
        "source": "T02n0150A_001:0879b09_8"
    },
    {
        "source_sentence": "二者亦有比丘若人所愛者，所愛者人亦有犯過便比丘聚，便有過者最著下坐，",
        "translation": "Second, there are also bhikṣus who belong to those beloved by others. Those beloved by others also commit offenses and so the assembly of bhikṣus proceeds accordingly. The one who does so is seated at the bottom [of the congregation].",
        "source": "T02n0150A_001:0879b10_9"
    },
    {
        "source_sentence": "便愛者意計我所愛者，為比丘聚最著下坐，我不復為至比丘聚，為比丘聚最著下坐，",
        "translation": "Those who are attached will think, ‘I am the one whom you love.’ They will be the most attached among the monks in the assembly and sit at the bottom of the seat. I will no longer be the leader of the assembly of monks or the most attached among the assembly of monks.",
        "source": "T02n0150A_001:0879b12_10"
    },
    {
        "source_sentence": "我不復為至比丘聚，中亦如上說。",
        "translation": "I won't go back to the congregation of monks, which is likewise explained above.",
        "source": "T02n0150A_001:0879b14_11"
    },
    {
        "source_sentence": "三者持鉢袈裟至他國。",
        "translation": "Three, he takes his bowl and robe to another country.",
        "source": "T02n0150A_001:0879b15_12"
    },
    {
        "source_sentence": "四者棄戒受白衣。",
        "translation": "Fourth, he renounces the precepts and accepts white robes.",
        "source": "T02n0150A_001:0879b15_13"
    },
    {
        "source_sentence": "五者自坐愁失名，亦如上說。」",
        "translation": "Five, the name of self-seated grief that's lost is also as explained above.",
        "source": "T02n0150A_001:0879b16_14"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879b16_15"
    },
    {
        "source_sentence": "（二四）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(24) Thus I have heard: One time, the Buddha was staying at Sāvatthī, walking in Anāthapiṇḍada Park in Jeta’s Grove.",
        "source": "T02n0150A_001:0879b18_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「五惡不忍辱。",
        "translation": "The Buddha then addressed the monk, Five bad things can't be tolerated.",
        "source": "T02n0150A_001:0879b19_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879b19_2"
    },
    {
        "source_sentence": "一者多怨，二者多讒，三者多不可意，四者十方不名聞惡行，五者已命盡身墮惡地獄，",
        "translation": "The first is that they have many enemies, the second much anger, the third much displeasure, the fourth no reputation for bad actions in the ten directions, and the fifth falling into a bad hell after their lives have ended.",
        "source": "T02n0150A_001:0879b20_3"
    },
    {
        "source_sentence": "是為五惡不忍辱者。」",
        "translation": "These are the five bad forms of someone who doesn't tolerate humility.",
        "source": "T02n0150A_001:0879b22_0"
    },
    {
        "source_sentence": "佛復告比丘：「有五善忍辱者，為無有怨，為無有讒，為無有不可意，",
        "translation": "Again, the Buddha said to the bhikṣus: There are five kinds of patience that are cultivated wholeheartedly. They have no enemies, no hatred, and no malice.",
        "source": "T02n0150A_001:0879b22_1"
    },
    {
        "source_sentence": "為有十方名聞，為命盡生天上。」",
        "translation": "It's because there are names and reputations in the ten directions, and it's because their lives end up being born in heaven.",
        "source": "T02n0150A_001:0879b23_2"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879b24_3"
    },
    {
        "source_sentence": "（二五）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(25) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0879b25_0"
    },
    {
        "source_sentence": "是時佛告比丘：「有五惡，不耐行者人，不耐行者人。",
        "translation": "The Buddha then addressed the monks, There are five bad qualities that people who aren't tolerant of practitioners and those who aren't tolerant of practitioners.",
        "source": "T02n0150A_001:0879b26_1"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879b27_2"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879b27_3"
    },
    {
        "source_sentence": "一者為從不耐者為麁，二為急性，三為已後恨，四為無有愛多憎，五為身命盡墮地獄；",
        "translation": "The first is that those who do not tolerate it become angry. The second is a sense of urgency. The third is hatred afterwards. The fourth is the absence of desire and much hatred. The fifth is falling into hell when their bodies and lives are exhausted.",
        "source": "T02n0150A_001:0879b27_4"
    },
    {
        "source_sentence": "倒是為淨。」",
        "translation": "It's pure.",
        "source": "T02n0150A_001:0879b29_5"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879b29_6"
    },
    {
        "source_sentence": "（二六）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(26) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0879c01_0"
    },
    {
        "source_sentence": "佛便告比丘：「象有五相，為應官，為中王用，為可王意，為象引王隨法中。",
        "translation": "The Buddha then told the monk, An elephant has five characteristics that should be used by the king in order to serve him as an official, for the king's use, for the king's opinion, and for the elephant to guide the king according to the rules.",
        "source": "T02n0150A_001:0879c02_1"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T02n0150A_001:0879c03_2"
    },
    {
        "source_sentence": "一者聞受，二者能住，三者能鬪，四者能走，五能自守。",
        "translation": "One is able to hear and receive, two can abide, three can fight, four can walk, and five can defend themselves.",
        "source": "T02n0150A_001:0879c04_0"
    },
    {
        "source_sentence": "何等為，比丘！",
        "translation": "What are they, monks?",
        "source": "T02n0150A_001:0879c05_1"
    },
    {
        "source_sentence": "宮象自守？",
        "translation": "Is the palace elephant guarding itself?",
        "source": "T02n0150A_001:0879c05_2"
    },
    {
        "source_sentence": "若象入軍中，前足能鬪，後足尻背腹肩項鼻能自護，如是名為自守。",
        "translation": "If an elephant enters an army, its front legs can fight, and its hind legs, back, neck, back, abdomen, shoulders, neck, and nose can protect themselves, which is called self-protecting.",
        "source": "T02n0150A_001:0879c05_3"
    },
    {
        "source_sentence": "若比丘五因緣具，便應禮名聞，便應從人受叉手，便福地無有極。",
        "translation": "If a monk is endowed with five causes and conditions, then he should venerate his name and hear it, and he should receive the salute from someone else, so that there's no limit to the ground of merit.",
        "source": "T02n0150A_001:0879c07_4"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879c08_5"
    },
    {
        "source_sentence": "聞受為一，能為二，受為三，行為四，守為五。",
        "translation": "hearing and feeling are one; what can be felt is two; feeling is three; volition is four; discipline is five.",
        "source": "T02n0150A_001:0879c09_0"
    },
    {
        "source_sentence": "何等為口中味，身中細滑，意中所念，能制不受相？",
        "translation": "What's the taste in the mouth, fine and smooth in the body, and what's thought in the mind that can restrain the characteristic of not accepting?",
        "source": "T02n0150A_001:0879c10_0"
    },
    {
        "source_sentence": "如是比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0150A_001:0879c11_1"
    },
    {
        "source_sentence": "比丘能自守，為守六衰。",
        "translation": "A monk who guards himself can guard the six weaknesses.",
        "source": "T02n0150A_001:0879c11_2"
    },
    {
        "source_sentence": "第二者為禪，第三受為忍辱，第四能為持戒，第五聞受為精進。",
        "translation": "The second is meditation, the third is acceptance as forbearance, the fourth is being able to observe precepts, and the fifth is hearing and accepting as effort.",
        "source": "T02n0150A_001:0879c11_3"
    },
    {
        "source_sentence": "行者有是五事，便應名聞，便應從人受叉手，便福地無有極，弟子聞可意受。」",
        "translation": "If practitioners have these five things, then they should be called hearers, and they should receive their palms together from someone else, so that the ground of merit has no limit, and the disciple who hears them can accept them with intention.",
        "source": "T02n0150A_001:0879c13_4"
    },
    {
        "source_sentence": "（二七）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(27) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0879c15_0"
    },
    {
        "source_sentence": "佛告比丘：「惡不依他人有五。",
        "translation": "The Buddha told the monks, There are five kinds of evil that don't rely on others.",
        "source": "T02n0150A_001:0879c16_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T02n0150A_001:0879c16_2"
    },
    {
        "source_sentence": "一者不依者意不解，二者依意曲離，三者自意不解，四者犯道行，五者不受佛嚴教。",
        "translation": "One, those who don't rely on the mind of someone who doesn't understand it, two, those who rely on the mind and diverge from it, three, those who don't understand their own mind, four, those who violate the practice of the path, and five, those who don't accept the Buddha's strict teaching.",
        "source": "T02n0150A_001:0879c17_3"
    },
    {
        "source_sentence": "五善依他人，不相疾者好意解，解意不墮亂自意，解天下等意行，後來者與眼。」",
        "translation": "The five kinds of goodness rely on others, those who aren't sick with each other are well-understood in their minds, understand their minds and don't fall into the confusion of their own minds, understand the mental actions of the world and so forth, and give them to someone else later.",
        "source": "T02n0150A_001:0879c19_0"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0879c20_1"
    },
    {
        "source_sentence": "（二八）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(208) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0879c22_0"
    },
    {
        "source_sentence": "彼時佛告比丘：「諸畏是謂為欲。",
        "translation": "The Buddha then addressed the monk, Fears are called desires.",
        "source": "T02n0150A_001:0879c23_1"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c23_2"
    },
    {
        "source_sentence": "謂諸苦是謂為欲。",
        "translation": "It means that suffering is called desire.",
        "source": "T02n0150A_001:0879c24_0"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c24_1"
    },
    {
        "source_sentence": "諸疾病是謂為欲。",
        "translation": "The illnesses are called desires.",
        "source": "T02n0150A_001:0879c24_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c25_0"
    },
    {
        "source_sentence": "諸結是謂為欲。",
        "translation": "The bonds are called desire.",
        "source": "T02n0150A_001:0879c25_1"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c25_2"
    },
    {
        "source_sentence": "諸瘡是謂為欲。",
        "translation": "These sores are called desires.",
        "source": "T02n0150A_001:0879c25_3"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c26_0"
    },
    {
        "source_sentence": "諸染泥是謂為欲。",
        "translation": "The defiled mud is called desire.",
        "source": "T02n0150A_001:0879c26_1"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c26_2"
    },
    {
        "source_sentence": "諸著是謂為欲。",
        "translation": "These are called desires.",
        "source": "T02n0150A_001:0879c26_3"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c27_0"
    },
    {
        "source_sentence": "諸墮母腹中是謂為欲。",
        "translation": "To fall into the mother's womb is called desire.",
        "source": "T02n0150A_001:0879c27_1"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c28_0"
    },
    {
        "source_sentence": "何以故諸畏為欲？",
        "translation": "Why are fears therefore desires?",
        "source": "T02n0150A_001:0879c28_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆，為貪欲所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "Using worldly deluded people who are tormented by craving and bound by craving, they can't be freed from their fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0879c28_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0879c30_3"
    },
    {
        "source_sentence": "以是故諸畏為欲。",
        "translation": "Because of this, the fears are desires.",
        "source": "T02n0150A_001:0879c30_4"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a01_0"
    },
    {
        "source_sentence": "何以故諸苦為欲？",
        "translation": "What is the reason why suffering is desire?",
        "source": "T02n0150A_001:0880a01_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆，為貪欲所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "Using worldly deluded people who are tormented by craving and bound by craving, they can't be freed from their fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0880a01_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a03_3"
    },
    {
        "source_sentence": "以是故諸苦為欲。",
        "translation": "It's because of this that suffering is desire.",
        "source": "T02n0150A_001:0880a03_4"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a04_0"
    },
    {
        "source_sentence": "何以故諸病為欲？",
        "translation": "Why are the old diseases desired?",
        "source": "T02n0150A_001:0880a04_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "They use worldly deluded people who are bound by craving and covetousness, which can't be freed from the fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0880a04_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a06_3"
    },
    {
        "source_sentence": "以是故諸病為欲。",
        "translation": "Because of this, the illnesses are desires.",
        "source": "T02n0150A_001:0880a06_4"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a07_0"
    },
    {
        "source_sentence": "何以故諸結為欲？",
        "translation": "Why are the fetters desired?",
        "source": "T02n0150A_001:0880a07_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆，為貪欲所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "Using worldly deluded people who are tormented by craving and bound by craving, they can't be freed from their fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0880a07_2"
    },
    {
        "source_sentence": "以是故諸結為欲。",
        "translation": "Because of this, the fetters are desires.",
        "source": "T02n0150A_001:0880a09_3"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a10_0"
    },
    {
        "source_sentence": "何以故諸瘡為欲？",
        "translation": "Why are the sores of old used as desire?",
        "source": "T02n0150A_001:0880a10_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆，為貪欲所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "Using worldly deluded people who are tormented by craving and bound by craving, they can't be freed from their fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0880a10_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a12_3"
    },
    {
        "source_sentence": "以是故諸瘡為欲。",
        "translation": "Because of this, the sores are desires.",
        "source": "T02n0150A_001:0880a12_4"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a13_0"
    },
    {
        "source_sentence": "何以故諸染泥為欲？",
        "translation": "Why are the defiled muds desired?",
        "source": "T02n0150A_001:0880a13_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆，為貪欲所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "Using worldly deluded people who are tormented by craving and bound by craving, they can't be freed from their fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0880a13_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a15_3"
    },
    {
        "source_sentence": "以是故諸染為欲。",
        "translation": "Because of this, the defilements are desires.",
        "source": "T02n0150A_001:0880a15_4"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a16_0"
    },
    {
        "source_sentence": "何以故諸著為欲？",
        "translation": "Why are the attachments desired?",
        "source": "T02n0150A_001:0880a16_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆，為貪欲所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "Using worldly deluded people who are tormented by craving and bound by craving, they can't be freed from their fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0880a16_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a18_3"
    },
    {
        "source_sentence": "以是故諸著為欲。",
        "translation": "Because of this, the attachments are desires.",
        "source": "T02n0150A_001:0880a18_4"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a19_0"
    },
    {
        "source_sentence": "何以故諸墮母腹中為欲？",
        "translation": "Why do they fall into their mother's womb as desires?",
        "source": "T02n0150A_001:0880a19_1"
    },
    {
        "source_sentence": "用世間癡人為貪欲所泆，為貪欲所縛，用現世不得脫諸畏，後世亦不得脫。",
        "translation": "Using worldly deluded people who are tormented by craving and bound by craving, they can't be freed from their fears in the present life but can't be freed in the afterlife.",
        "source": "T02n0150A_001:0880a19_2"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880a21_3"
    },
    {
        "source_sentence": "是故諸墮母腹中為欲。」",
        "translation": "That's why they fall into the mother's womb for desire.",
        "source": "T02n0150A_001:0880a21_4"
    },
    {
        "source_sentence": "佛以說是，從後說絕：「畏苦病結瘡是謂為欲，癡人為是所縛已，可色從彼墮母腹中，",
        "translation": "When the Buddha said this, he spoke of stopping it from being explained later: This is called desire. A deluded person who has been bound by these fetters will fall into his mother’s womb through the sexual misconduct of a woman with form.",
        "source": "T02n0150A_001:0880a22_5"
    },
    {
        "source_sentence": "上頭所說，比丘正意已知莫離諸畏，為深黠人度彼，當觀世間生老行展轉。」",
        "translation": "The above-mentioned teaching is that a monk who correctly knows the fears and doesn't part with them, saves them by being a profound wise person, and observes the world's cycle of birth and old age.",
        "source": "T02n0150A_001:0880a24_6"
    },
    {
        "source_sentence": "時佛說如是。",
        "translation": "The Buddha then explained it this way.",
        "source": "T02n0150A_001:0880a26_7"
    },
    {
        "source_sentence": "「瘡有八輩：一為疑瘡，二為愛瘡，三為貪瘡，四為瞋恚瘡，五為癡瘡，",
        "translation": "(1) the sores of doubt, (2) the sores of desire, (3) the sores of greed, (4) the sores of hatred, and (5) the sores of delusion.",
        "source": "T02n0150A_001:0880a27_0"
    },
    {
        "source_sentence": "六為憍慢瘡，七為邪瘡，八為生死瘡。」",
        "translation": "Six are the sores of arrogance, seven are the sores of wrong views, and eight are the sores of birth-and-death.",
        "source": "T02n0150A_001:0880a28_1"
    },
    {
        "source_sentence": "（二九）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(21) Thus I have heard: One time, the Buddha was staying at Sāvatthī, walking in Anāthapiṇḍada Park in Jeta’s Grove.",
        "source": "T02n0150A_001:0880a30_0"
    },
    {
        "source_sentence": "佛便請比丘，比丘至，佛便說是譬喻：「比丘人有腫之歲，若干歲聚便為所腫，",
        "translation": "The Buddha then invited the monk, and when the monk arrived, the Buddha spoke this metaphor: When a monk has swelling at the age of several years old, he'll be covered with swelling.",
        "source": "T02n0150A_001:0880b01_1"
    },
    {
        "source_sentence": "九孔、九痛、九漏，從所孔所漏所渧所走，但為不淨出，但為不淨走，",
        "translation": "The nine pores, the nine pains, and the nine impure influences do not arise from the pores that are contaminated or from the abscesses that are purified. They only come forth because of impurity; they only come forth because of impurity.",
        "source": "T02n0150A_001:0880b02_2"
    },
    {
        "source_sentence": "真惡難惡出流走腫。",
        "translation": "It's really bad and difficult, and it's a swelling that comes out of the flow.",
        "source": "T02n0150A_001:0880b04_3"
    },
    {
        "source_sentence": "比丘為是身四因緣，名是四因緣身者，為九孔、九痛，為九漏從所漏所渧所走，",
        "translation": "A monk takes these four causes and conditions as the basis for his body, which are called “these four causes and conditions for my body”: These are the nine pores (i.e., the five sense faculties), the nine pains (duhkhas) and the nine impure influences (samskrta) [that make up the body] from which the impure influence",
        "source": "T02n0150A_001:0880b04_4"
    },
    {
        "source_sentence": "但為不淨出，但為不淨流，但為臭惡出流走。",
        "translation": "It's only for the sake of impurity that it emerges, but for the sake of impurity that it flows out, and for the sake of foulness that it exits and runs away.",
        "source": "T02n0150A_001:0880b06_5"
    },
    {
        "source_sentence": "如是比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0150A_001:0880b07_6"
    },
    {
        "source_sentence": "為因緣腫，可慚、可怖、可畏、可學，如是比丘！」",
        "translation": "It's for the sake of causes and conditions that swelling is shameable, fearful, fearful, and deserving of training, such a monk!",
        "source": "T02n0150A_001:0880b07_7"
    },
    {
        "source_sentence": "佛說如是，比丘受行歡喜。",
        "translation": "The Buddha said so, and the monk was delighted when he accepted it.",
        "source": "T02n0150A_001:0880b08_8"
    },
    {
        "source_sentence": "（三〇）佛說積骨經",
        "translation": "(30. Sutra on the Accumulated bones Spoken by the Buddha",
        "source": "T02n0150A_001:0880b10_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在王舍國雞山中，便告比丘：「人居世間一劫中生死，",
        "translation": "Thus I have heard: One time, while the Buddha was staying at Kaśinagara in Rājagṛha, he said to the bhikṣus:",
        "source": "T02n0150A_001:0880b11_0"
    },
    {
        "source_sentence": "取其骨藏之不腐、不消、不滅，積之與須彌山等；",
        "translation": "They collected the bones and stored them in a place where they did not decay, disappear, or perish. The accumulation of these treasures was as great as Mount Sumeru.",
        "source": "T02n0150A_001:0880b12_1"
    },
    {
        "source_sentence": "人或有百劫生死者，或有千劫生死者，尚未能得阿羅漢道泥洹。」",
        "translation": "A person may have a hundred eons of birth and death or a thousand eons of birth and death, but they haven't yet attained the nirvāṇa of the arhat path.",
        "source": "T02n0150A_001:0880b13_2"
    },
    {
        "source_sentence": "佛告比丘：「人一劫中合會其骨與須彌山等，我故現其本因緣。",
        "translation": "The Buddha told the monks, In an eon, a person's bones are combined with Mount Sumeru and so forth, and I therefore show their original causes and conditions.",
        "source": "T02n0150A_001:0880b15_3"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880b16_4"
    },
    {
        "source_sentence": "若曹皆當拔其本根，去離本惡，用是故不復生死，不復生死，便得度世泥洹道。」",
        "translation": "If they all pull out their original faculties and part with their original evil, then because of this, they won't be born again and again, and if they don't die again, they'll attain the path of worldly nirvāṇa.",
        "source": "T02n0150A_001:0880b16_5"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0880b18_6"
    },
    {
        "source_sentence": "佛說七處三觀經",
        "translation": "Sutra on the Three Contemplations of the Seven Places",
        "source": "T02n0150A_001:0880b19_0"
    },
    {
        "source_sentence": "佛說九橫",
        "translation": "nine aspects of the Buddha's teaching",
        "source": "T02n0150A_001:0880b20_0"
    },
    {
        "source_sentence": "（三一）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(31) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0880b21_0"
    },
    {
        "source_sentence": "佛告諸比丘：「有九輩因緣，人命未盡便橫死。",
        "translation": "The Buddha told the monks, There are nine causes and conditions that cause people to die unintentionally before their lives end.",
        "source": "T02n0150A_001:0880b22_1"
    },
    {
        "source_sentence": "何等為九？",
        "translation": "What are these nine?",
        "source": "T02n0150A_001:0880b23_2"
    },
    {
        "source_sentence": "一為不應飯，二為不量飯，三為不習飯飯，四為不出生，五為止熟，六為不持戒，",
        "translation": "The first is food that should not be eaten; the second is food of unlimited quantity; the third is food that does not grow in moderation; the fourth is food that does not arise; the fifth is cooked until it has been done; and the sixth is food that does not keep the precepts.",
        "source": "T02n0150A_001:0880b23_3"
    },
    {
        "source_sentence": "七為近惡知識，八為入里不時不如法行，九為可避不避。",
        "translation": "The seventh is to approach bad friends, the eighth is to enter a village that doesn't practice according to the teaching at the right time, and the ninth is to avoid what can be avoided and not avoided.",
        "source": "T02n0150A_001:0880b25_4"
    },
    {
        "source_sentence": "如是為九因緣，人命為橫盡。」",
        "translation": "Thus are these nine causes and conditions, and human life is horizontally exhausted.",
        "source": "T02n0150A_001:0880b26_5"
    },
    {
        "source_sentence": "諸比丘聞佛語，歡喜作禮。",
        "translation": "The monks who heard the Buddha’s words were delighted and greeted him with veneration.",
        "source": "T02n0150A_001:0880b27_6"
    },
    {
        "source_sentence": "「何等為不應飯者？",
        "translation": "What's a person who shouldn't eat?",
        "source": "T02n0150A_001:0880b28_0"
    },
    {
        "source_sentence": "名為不可意飯，亦為以飯腹不停諷，是名為不應飯。",
        "translation": "It's called unwholesome food, and it's also because he doesn't stop chanting with his rice belly, which is called unshouldful food.",
        "source": "T02n0150A_001:0880b28_1"
    },
    {
        "source_sentence": "「何等為不量飯者，名為不知節度，多飯過足，是名為不量飯。",
        "translation": "“What’s immeasurable rice? It’s called not knowing moderation.",
        "source": "T02n0150A_001:0880c01_0"
    },
    {
        "source_sentence": "「何等為不習飯飯者？",
        "translation": "What's the reason they don't cultivate rice?",
        "source": "T02n0150A_001:0880c03_0"
    },
    {
        "source_sentence": "名為不知時，冬夏為至他郡國，不知俗宜，不能消飲食，未習故，是名為不習飯飯。",
        "translation": "When they don't know the name, it's called a time when they go to another country in winter or summer and don't know the customs and seasons, so they can't eat food and drink because they haven't cultivated it, which is called not cultivating rice.",
        "source": "T02n0150A_001:0880c03_1"
    },
    {
        "source_sentence": "「何等為不出生者？",
        "translation": "What are those who don't arise?",
        "source": "T02n0150A_001:0880c06_0"
    },
    {
        "source_sentence": "名為飯物未消，復從上飯，不服藥吐下，不時消，是名為不出生。",
        "translation": "It's called a food that hasn't yet been digested, which comes back from the upper rice, doesn't take medicine and spits down, and doesn't pass away at the right time.",
        "source": "T02n0150A_001:0880c06_1"
    },
    {
        "source_sentence": "「何等為止熟者？",
        "translation": "What's the ultimate ripening?",
        "source": "T02n0150A_001:0880c08_0"
    },
    {
        "source_sentence": "名為大便小便來時不即行，噫吐嚏下風來時制之，是名為止熟。",
        "translation": "It's called stopping and maturing when he comes to urinate or defecate, and it's stopped when he exhales and sneezes and winds down.",
        "source": "T02n0150A_001:0880c08_1"
    },
    {
        "source_sentence": "「何等為不持戒者？",
        "translation": "What are those who don't observe the precepts?",
        "source": "T02n0150A_001:0880c10_0"
    },
    {
        "source_sentence": "名為犯五戒，殺、盜、犯人婦女、兩舌、飲酒，亦有餘戒以犯便入縣官，",
        "translation": "It's called violating the five precepts, which are killing, stealing, violating people and women, duplicitous speech, and drinking alcohol. Also, there are other precepts that are violated by entering a magistrate's office because of their offenses.",
        "source": "T02n0150A_001:0880c10_1"
    },
    {
        "source_sentence": "或強死、或得杖死、或得字亦餓便從是死；",
        "translation": "Some die by force, some die on the strength of a cane, and some die as soon as it is given to them.",
        "source": "T02n0150A_001:0880c12_0"
    },
    {
        "source_sentence": "或以得脫外，從怨家得手死，或驚怖念罪憂死，是為不持戒。",
        "translation": "Sometimes they'll be freed from it, and their hand will die from the enemy's house, or they'll be frightened and think of sin and grief as death, which is not observing the precepts.",
        "source": "T02n0150A_001:0880c13_0"
    },
    {
        "source_sentence": "「何等為近惡知識者？",
        "translation": "“What are their approaches to bad friends?",
        "source": "T02n0150A_001:0880c15_0"
    },
    {
        "source_sentence": "名為惡知識，以作惡便及人。",
        "translation": "They're called bad friends because they do evil for the sake of doing evil and people.",
        "source": "T02n0150A_001:0880c15_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T02n0150A_001:0880c16_2"
    },
    {
        "source_sentence": "坐不離惡知識故，不覺善惡，不計惡知識惡態，不思惟惡知識惡行，是名為近惡知識。",
        "translation": "Because they don't sit apart from bad friends, don't perceive good and bad, don't contemplate bad qualities of bad friends, and don't contemplate bad actions of bad friends, this is called approaching bad friends.",
        "source": "T02n0150A_001:0880c16_3"
    },
    {
        "source_sentence": "「何等為入里不時者？",
        "translation": "What's the reason they don't enter the village at the right time?",
        "source": "T02n0150A_001:0880c19_0"
    },
    {
        "source_sentence": "名為冥行，亦里有譊譊諍時行，亦遇縣官長吏出追捕，不避不可避行者，",
        "translation": "It's called a mysterious practice, which is also common in the village and meets with magistrates and officials who come out to pursue and arrest people who don't avoid or can't avoid practitioners.",
        "source": "T02n0150A_001:0880c19_1"
    },
    {
        "source_sentence": "入里妄入他家舍中，妄見不可見，妄聽不可聽，妄犯不可犯，妄說不可說，",
        "translation": "They enter villages and go into someone else’s house without knowing it. They enter their home without seeing or hearing it, without knowing it; they enter others’ houses without knowing it, without seeing or hearing it, without understanding it, without hearing it, without violating it, without speaking it, without saying anything.",
        "source": "T02n0150A_001:0880c21_2"
    },
    {
        "source_sentence": "妄憂不可憂，妄索不可索，是名為入里不時不如法行。",
        "translation": "Falsely grieving and not grieving, and falsely claiming and not claiming, is called entering a village that doesn't practice according to the teaching at the right time.",
        "source": "T02n0150A_001:0880c23_0"
    },
    {
        "source_sentence": "何等為可避不避者？",
        "translation": "What's avoidable and what's not avoidable?",
        "source": "T02n0150A_001:0880c24_1"
    },
    {
        "source_sentence": "名為當避弊象弊馬、牛犇車馳馬、蛇虺坑井、水火拔刀、醉人惡人，亦餘若干，",
        "translation": "It's called avoiding bad elephants, bad horses, ox carts chasing horses, snakes pitting wells, water and fire pulling out swords, drunkards and bad people, and a few others.",
        "source": "T02n0150A_001:0880c24_2"
    },
    {
        "source_sentence": "是名為可避不避。",
        "translation": "This is called something that can be avoided and not avoided.",
        "source": "T02n0150A_001:0880c26_3"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0880c27_0"
    },
    {
        "source_sentence": "如是為因緣，九人輩命未盡，當坐是盡。",
        "translation": "Because of these causes and conditions, the lives of the nine members of the assembly have not yet ended. The time for sitting is now over.",
        "source": "T02n0150A_001:0880c27_1"
    },
    {
        "source_sentence": "黠人當識是、當避是因緣，以避乃得兩福，一者得長壽，二者以長壽乃得聞道好語善言，",
        "translation": "A wise person should know this and avoid it as a cause and condition. By avoiding it, they will attain two kinds of blessings: first, longevity; second, hearing the truth and speaking well for a long time because of their longevity.",
        "source": "T02n0150A_001:0880c28_2"
    },
    {
        "source_sentence": "亦能為道。」",
        "translation": "It can also be the path.",
        "source": "T02n0150A_001:0881a01_3"
    },
    {
        "source_sentence": "佛說如是，皆歡喜受。",
        "translation": "When the Buddha teaches this, they all rejoice and accept it.",
        "source": "T02n0150A_001:0881a01_4"
    },
    {
        "source_sentence": "（三二）聞如是。",
        "translation": "(32) He hears thus.",
        "source": "T02n0150A_001:0881a02_0"
    },
    {
        "source_sentence": "一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881a02_1"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世間難得。",
        "translation": "The Buddha then addressed the monk, It's difficult for two people in the world to attain it.",
        "source": "T02n0150A_001:0881a03_2"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881a04_0"
    },
    {
        "source_sentence": "一者前施人者，二者有返復不忘恩。」",
        "translation": "One is the person who gave to the donor before, and the other is someone who doesn't forget their kindness when they return.",
        "source": "T02n0150A_001:0881a04_1"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881a05_2"
    },
    {
        "source_sentence": "（三三）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(33) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881a06_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世間難得。",
        "translation": "The Buddha then addressed the monk, It's difficult for two people in the world to attain it.",
        "source": "T02n0150A_001:0881a07_1"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881a08_0"
    },
    {
        "source_sentence": "一者所不可為行恩，二者受恩復報恩。」",
        "translation": "One is the kindness of doing what shouldn't be done, and two is the kindness of receiving and repaying kindness.",
        "source": "T02n0150A_001:0881a08_1"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881a09_2"
    },
    {
        "source_sentence": "（三四）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(3 (3) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881a10_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世聞難得。",
        "translation": "At the time, the Buddha told the monk, It's difficult for two people to hear it in the world.",
        "source": "T02n0150A_001:0881a11_1"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881a12_2"
    },
    {
        "source_sentence": "一者得得聚，二者得得不駐遣。」",
        "translation": "One, they'll attain a cluster, and two, they'll attain it without being rejected.",
        "source": "T02n0150A_001:0881a12_3"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881a13_4"
    },
    {
        "source_sentence": "（三五）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(325) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0881a14_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世間易厭。",
        "translation": "At the time, the Buddha told the monk, Two people in the world are easy to dislike.",
        "source": "T02n0150A_001:0881a15_1"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881a16_0"
    },
    {
        "source_sentence": "一者得得聚守，二者得得遣去。」",
        "translation": "One, they'll be able to obtain a group of guards, and two, they'll be able to get rid of it.",
        "source": "T02n0150A_001:0881a16_1"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881a17_0"
    },
    {
        "source_sentence": "（三六）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(336) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881a18_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世間難得。",
        "translation": "The Buddha then addressed the monk, It's difficult for two people in the world to attain it.",
        "source": "T02n0150A_001:0881a19_1"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881a19_2"
    },
    {
        "source_sentence": "一者人飽，二者能飽。」",
        "translation": "One is when people are satisfied, and the other is when they can be satisfied.",
        "source": "T02n0150A_001:0881a20_3"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881a20_4"
    },
    {
        "source_sentence": "（三七）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(27) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881a21_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世間難得。",
        "translation": "The Buddha then addressed the monk, It's difficult for two people in the world to attain it.",
        "source": "T02n0150A_001:0881a22_1"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881a23_0"
    },
    {
        "source_sentence": "一者布施意無有悔，二者比丘從正得無為。」",
        "translation": "One, the mind of generosity has no regrets, and two, the monk attains nothingness from righteousness.",
        "source": "T02n0150A_001:0881a23_1"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881a24_2"
    },
    {
        "source_sentence": "（三八）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(3 (8) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881a25_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世間難得。",
        "translation": "The Buddha then addressed the monk, It's difficult for two people in the world to attain it.",
        "source": "T02n0150A_001:0881a26_1"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881a27_0"
    },
    {
        "source_sentence": "一者離垢慳意，家中行牧手手易與，常樂成布施等分布施，二者比丘從正得無為。」",
        "translation": "One, they're free of defiled stinginess, travel at home with their hands and feet as easy to give, always happy to make donations and distribute them, and two, the monk attains nothingness from righteousness.",
        "source": "T02n0150A_001:0881a27_1"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881a29_2"
    },
    {
        "source_sentence": "（三九）聞如是。",
        "translation": "(3 (9) Hearing thus.",
        "source": "T02n0150A_001:0881b01_0"
    },
    {
        "source_sentence": "一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881b01_1"
    },
    {
        "source_sentence": "是時，佛告比丘：「二人世間難斷難勝。",
        "translation": "The Buddha then addressed the monks, saying, Two people in the world are difficult to stop and difficult to overcome.",
        "source": "T02n0150A_001:0881b02_2"
    },
    {
        "source_sentence": "何等二人？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881b03_3"
    },
    {
        "source_sentence": "一者家中居，施衣、飯食、床、應病瘦藥，所用當與，二者若比丘信不用家，",
        "translation": "First, if a bhikṣu resides at home he should give his robes, food and drink, bed mats, and medicine for curing the ill and giving it to those who are ill. Second, if a bhikṣu believes that he does not need [to live] at home, then he should make offerings of clothing, food and drink, seats, and medicine for curing the",
        "source": "T02n0150A_001:0881b03_4"
    },
    {
        "source_sentence": "舍行一切身，舍斷愛却受，向無為、不離無為。」",
        "translation": "She practices all body, stops craving for sheds and rejects feelings, goes to nothingness, doesn't part with nothingness, and doesn't part with nothingness.",
        "source": "T02n0150A_001:0881b05_5"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881b06_6"
    },
    {
        "source_sentence": "（四〇）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(401) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0881b07_0"
    },
    {
        "source_sentence": "是時，佛告比丘：「二清白法能得觀世間。",
        "translation": "The Buddha then addressed the monk, Two pure and white dharmas can be observed in the world.",
        "source": "T02n0150A_001:0881b08_1"
    },
    {
        "source_sentence": "何等二？",
        "translation": "What are these two?",
        "source": "T02n0150A_001:0881b09_2"
    },
    {
        "source_sentence": "一者媿，二者慚。",
        "translation": "One is anger, and the other is shame.",
        "source": "T02n0150A_001:0881b09_3"
    },
    {
        "source_sentence": "設是世間無有是二法，為不得分別若父若母、若兄若弟、若男女、若從學若師、若君若大人。",
        "translation": "Suppose there aren't these two things in the world, so they can't discriminate between father and mother, brothers and sisters, men and women, trainees and teachers, or gentlemen and men.",
        "source": "T02n0150A_001:0881b09_4"
    },
    {
        "source_sentence": "設有是世間不正，譬如牛馬象鷄猪狗亦畜生，但觀是清白二法故，媿亦慚故，",
        "translation": "Good man, even if there is a world in which these things are not right, it would be like the case where cows, horses, elephants, chickens, pigs, dogs, and also animals simply observe these two principles of purity and whiteness, because they are both gross and shameful.",
        "source": "T02n0150A_001:0881b11_5"
    },
    {
        "source_sentence": "為得分明為父為母、為兄為弟、為男女、為從學為師、為君為大人。",
        "translation": "In order to share the insight, they're father and mother, brothers and brothers, men and women, followers and teachers, and gentlemen and men.",
        "source": "T02n0150A_001:0881b13_6"
    },
    {
        "source_sentence": "設有是世間不正，譬如牛馬象鷄猪狗亦畜生，但觀是法清白故，為得分別。」",
        "translation": "Suppose there's a world that's not correct, such as cows, horses, elephants, chickens, pigs, and dogs are also animals, but they only observe the purity of this teaching in order to discern it.",
        "source": "T02n0150A_001:0881b15_7"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881b17_8"
    },
    {
        "source_sentence": "（四一）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(41) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0881b18_0"
    },
    {
        "source_sentence": "佛便告比丘：「舍身惡行，何以故？",
        "translation": "The Buddha then addressed the monk, What's the reason for this bad physical action?",
        "source": "T02n0150A_001:0881b19_1"
    },
    {
        "source_sentence": "能得舍故。",
        "translation": "It's because they can obtain a dwelling.",
        "source": "T02n0150A_001:0881b20_0"
    },
    {
        "source_sentence": "若不能得舍身惡行，佛亦不能說舍身惡行。",
        "translation": "If they can't attain the bad actions of the house body, the Buddha won't explain the bad actions of the house body.",
        "source": "T02n0150A_001:0881b20_1"
    },
    {
        "source_sentence": "可得舍身惡行，是故，我為說舍身惡行者，不舍身惡行，便絕無有財產，",
        "translation": "That is why I preach for those who commit evil deeds in the body of renunciation. If they do not renounce evil deeds in the body, their wealth will be cut off.",
        "source": "T02n0150A_001:0881b21_2"
    },
    {
        "source_sentence": "亦不行布施，是墮兩侵，眼在但無所見，從是墮地獄，無有眼到彼間處，",
        "translation": "If someone doesn't practice generosity, they'll fall into two kinds of encroachment, where their eyes are there but don't see anything. From that, they'll fall into hell, and there won't be a place where their eyes reach them.",
        "source": "T02n0150A_001:0881b23_0"
    },
    {
        "source_sentence": "不自守者，名為一眼。",
        "translation": "Someone who doesn't guard themselves is called one-eyed.",
        "source": "T02n0150A_001:0881b24_1"
    },
    {
        "source_sentence": "盜弊態兩舌、妄語，但有財產，但世間自樂，致法非法諛諂，致大多財，",
        "translation": "Stealing, hypocrisy, duplicitous speech, and false speech only have property but the world enjoys it for their own pleasure. They commit violations of the law, unlawful flattery, and deceitfulness, leading to large amounts of wealth.",
        "source": "T02n0150A_001:0881b25_2"
    },
    {
        "source_sentence": "亦不自樂，亦不布施，已墮地獄一眼處。",
        "translation": "They don't enjoy themselves and don't give alms, and they've fallen into the hell of one-eyed place.",
        "source": "T02n0150A_001:0881b26_3"
    },
    {
        "source_sentence": "兩眼者最第一法。",
        "translation": "The two eyes are the supreme dharma.",
        "source": "T02n0150A_001:0881b27_4"
    },
    {
        "source_sentence": "致治生，自所有自食亦布施，從是行福自在，如不黠自食亦施，得時上天常不離法。",
        "translation": "As a result, they cultivate goodness freely, such as feeding themselves without being clever and giving their own food when they do so, and they attain the eternal and non-separate dharmas of the time in the upper heavens.",
        "source": "T02n0150A_001:0881b28_5"
    },
    {
        "source_sentence": "無有眼亦一眼，但當遠莫近，黠人但當校計兩眼，兩眼第一，今世、後世。」",
        "translation": "There's no eye or eye with one eye, but it should be distant and not near, and a wise person should simply calculate the two eyes, which are the first in both eyes, now and in the future.",
        "source": "T02n0150A_001:0881c01_6"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881c02_7"
    },
    {
        "source_sentence": "（四二）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(482) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0881c04_0"
    },
    {
        "source_sentence": "時賢者阿難行至佛，已到禮佛，便白問佛：「世間世何等為世？",
        "translation": "Good man Ānanda then went to the Buddha, paid homage to him, and asked him, What's worldly?",
        "source": "T02n0150A_001:0881c05_1"
    },
    {
        "source_sentence": "說是何等為世？」",
        "translation": "What's the world that's explained?",
        "source": "T02n0150A_001:0881c06_2"
    },
    {
        "source_sentence": "「是世，阿難！",
        "translation": "“O Ānanda, this is the world!",
        "source": "T02n0150A_001:0881c07_3"
    },
    {
        "source_sentence": "為三，一為欲世，二為色世，三為不色世。",
        "translation": "The first is the world of sexual passion, the second is the world of form, and the third is the world of formlessness.",
        "source": "T02n0150A_001:0881c07_4"
    },
    {
        "source_sentence": "亦若人所致罪令復得，是名為世。",
        "translation": "Also, if someone commits a sin and causes it to be regained, this is called the world.",
        "source": "T02n0150A_001:0881c08_5"
    },
    {
        "source_sentence": "若阿難！",
        "translation": "Suppose Ānanda!",
        "source": "T02n0150A_001:0881c09_6"
    },
    {
        "source_sentence": "欲致罪無有，欲世亦無有。",
        "translation": "There's no desire to cause sin, and there's no desire for the world.",
        "source": "T02n0150A_001:0881c09_7"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T02n0150A_001:0881c09_8"
    },
    {
        "source_sentence": "報佛不離是。」",
        "translation": "This is the reward Buddha who doesn't part with it.",
        "source": "T02n0150A_001:0881c10_9"
    },
    {
        "source_sentence": "佛便告阿難：「是阿難！",
        "translation": "The Buddha then addressed Ānanda, Yes, Ānanda!",
        "source": "T02n0150A_001:0881c10_10"
    },
    {
        "source_sentence": "罪為地識，為種欲，為愛癡，為冥，已癡人無有眼，便惡行，已惡便識在惡，",
        "translation": "Sin is the earthly consciousness, the seed of desire, craving and delusion, and darkness. Those who are deluded have no eyes, so they do evil deeds; those who are evil do not have consciousnesses in evil.",
        "source": "T02n0150A_001:0881c10_11"
    },
    {
        "source_sentence": "墮欲世。",
        "translation": "They'll fall into the desire realm.",
        "source": "T02n0150A_001:0881c12_12"
    },
    {
        "source_sentence": "若阿難！",
        "translation": "Suppose Ānanda!",
        "source": "T02n0150A_001:0881c12_13"
    },
    {
        "source_sentence": "色行人不致色，世亦無有。」",
        "translation": "A form practitioner doesn't cause form, and there's no form in the world.",
        "source": "T02n0150A_001:0881c12_14"
    },
    {
        "source_sentence": "佛復重告阿難：「不致是有不？」",
        "translation": "Again, the Buddha again addressed Ānanda, Is it true that they aren't?",
        "source": "T02n0150A_001:0881c13_15"
    },
    {
        "source_sentence": "阿難便白佛：「不離是。」",
        "translation": "Ānanda then said to the Buddha, Not separate from it.",
        "source": "T02n0150A_001:0881c14_16"
    },
    {
        "source_sentence": "佛復告阿難：「是行地識，為種欲為愛癡為冥，癡冥為中，行識便在中止，",
        "translation": "Again, the Buddha said to Ānanda: The consciousness of volition has as its seeds desire, thirst, and delusion for its roots, while delusion and delusion are in between.",
        "source": "T02n0150A_001:0881c14_17"
    },
    {
        "source_sentence": "是為色世有。",
        "translation": "This is form that exists in the world.",
        "source": "T02n0150A_001:0881c16_18"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T02n0150A_001:0881c16_19"
    },
    {
        "source_sentence": "不色行福故有不色世，若無有不色行，亦無有不色。」",
        "translation": "It's because of the merit of formless practice that there's formlessness in the world, and if there's no formless practice, there's no formlessness.",
        "source": "T02n0150A_001:0881c16_20"
    },
    {
        "source_sentence": "阿難白佛：「不離是。」",
        "translation": "Ānanda said to the Buddha, Not separate from it.",
        "source": "T02n0150A_001:0881c18_21"
    },
    {
        "source_sentence": "「從是行，阿難！",
        "translation": "From this, Ānanda!",
        "source": "T02n0150A_001:0881c18_22"
    },
    {
        "source_sentence": "便為福地，識種欲愛癡冥已，人有癡便無有眼，已不大了眼故，為無有色，",
        "translation": "It is a blessed state because the seeds of consciousness, desire, thirst, and delusion are not present in humans with delusion. Because they do not understand the eye very well, they lack form.",
        "source": "T02n0150A_001:0881c18_23"
    },
    {
        "source_sentence": "上識便名為無有色世。」",
        "translation": "The higher consciousness is then called the formless world.",
        "source": "T02n0150A_001:0881c20_24"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0881c21_25"
    },
    {
        "source_sentence": "（四三）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(43) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0881c22_0"
    },
    {
        "source_sentence": "是時，佛告比丘，比丘應：「唯然。」",
        "translation": "The Buddha then addressed the monk, and the monk replied, Yes.",
        "source": "T02n0150A_001:0881c23_1"
    },
    {
        "source_sentence": "佛便說：「信者有三行，令從行信淨可。",
        "translation": "The Buddha then said, A believer has three practices that cause faith to be purified from practice.",
        "source": "T02n0150A_001:0881c23_2"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T02n0150A_001:0881c24_3"
    },
    {
        "source_sentence": "一者欲見明者，二者欲聞經，三者離垢慳意，家中居牧費，直手分布與，",
        "translation": "One, those who want to see insight; two, those who want to hear the sūtras; and three, free from defiled stinginess, they distribute their householders' expenses with straight hands.",
        "source": "T02n0150A_001:0881c25_0"
    },
    {
        "source_sentence": "成布施等意。」",
        "translation": "It's the intention to make offerings and so forth.",
        "source": "T02n0150A_001:0881c26_1"
    },
    {
        "source_sentence": "　「欲見明者，　　當樂聞經，　　亦除垢慳，",
        "translation": "Those who want to see insight should delight in listening to the sutras And also rid themselves of greed and stinginess.",
        "source": "T02n0150A_001:0881c27_0"
    },
    {
        "source_sentence": "　是名為信。」　　佛說如是。",
        "translation": "This is called faith.” The Buddha said in this way.",
        "source": "T02n0150A_001:0881c27_0"
    },
    {
        "source_sentence": "從後說絕：（四四）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "At one time the Buddha was staying at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s Park.",
        "source": "T02n0150A_001:0881c27_0"
    },
    {
        "source_sentence": "是時，佛告比丘，比丘應：「唯然。」",
        "translation": "The Buddha then addressed the monk, and the monk replied, Yes.",
        "source": "T02n0150A_001:0882a02_1"
    },
    {
        "source_sentence": "佛便說：「有三安善樂，若慧者欲求是，當為護戒。",
        "translation": "The Buddha then said, There are three kinds of well-being, and if a wise person wants to pursue them, they should guard the precepts.",
        "source": "T02n0150A_001:0882a02_2"
    },
    {
        "source_sentence": "一者欲名聞法俱相隨護戒，二者欲財樂俱可意惠，欲得者當護戒，三者念是身受，",
        "translation": "One, they want to protect the precepts by following both names and teachings; two, they want both possessions and pleasures that are agreeable to their minds; those who want to attain them should protect the precepts; and three, mindfulness is bodily sensation.",
        "source": "T02n0150A_001:0882a04_3"
    },
    {
        "source_sentence": "更身欲度世上天慧，欲得者當護戒。」",
        "translation": "Those who want to save the world by rebirth in heaven will guard the precepts if they want to attain them.",
        "source": "T02n0150A_001:0882a06_4"
    },
    {
        "source_sentence": "從後說絕：「慧者當護戒，欲得三願名聞亦利後世，欲樂天上是說處，",
        "translation": "From then on, it's said to be cut off, saying, Wise people should guard the precepts, wanting to attain the three vows of fame and reputation that will also benefit later generations.",
        "source": "T02n0150A_001:0882a06_5"
    },
    {
        "source_sentence": "若慧能習是事如上說，是世間得樂淨。」",
        "translation": "If wisdom can cultivate these things as explained above, the world will attain happiness and purity.",
        "source": "T02n0150A_001:0882a09_6"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0882a10_7"
    },
    {
        "source_sentence": "（四五）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(475) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0882a11_0"
    },
    {
        "source_sentence": "佛便告比丘：「世間有三大病，人身中各自有。",
        "translation": "The Buddha then addressed the monks, There are three major illnesses in the world that each have their own bodies in humans.",
        "source": "T02n0150A_001:0882a12_1"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T02n0150A_001:0882a13_2"
    },
    {
        "source_sentence": "一為風，二為熱，三為寒，是三大病。",
        "translation": "The first is wind, the second fever, and the third cold. These are the three major diseases.",
        "source": "T02n0150A_001:0882a13_3"
    },
    {
        "source_sentence": "比丘有三大藥，風者比丘大病，麻油大藥，亦麻油輩。",
        "translation": "A monk has three great medicines; a monk with wind is greatly ill, and a monk with sesame oil is greatly good, which is also called sesame oil.",
        "source": "T02n0150A_001:0882a14_4"
    },
    {
        "source_sentence": "熱大病者，酪酥大藥，亦如酪酥輩。",
        "translation": "The great disease of fever is the great medicine of curds and butter, as well as the group of curds and butter.",
        "source": "T02n0150A_001:0882a15_5"
    },
    {
        "source_sentence": "寒大病者，蜜大藥，亦如蜜輩。",
        "translation": "The great cold sickness is the great medicine of honey, which is also like the sugar group.",
        "source": "T02n0150A_001:0882a16_6"
    },
    {
        "source_sentence": "是比丘三大病、是三大藥。",
        "translation": "These are the three major illnesses of a monk, and these are the three major medicines.",
        "source": "T02n0150A_001:0882a17_7"
    },
    {
        "source_sentence": "如是，人亦有三病共生共居道德法見說，何等為三？",
        "translation": "Thus, people also have three illnesses that are co-arisen and co-abiding in shared moral views of the Dharma. What are these three?",
        "source": "T02n0150A_001:0882a17_8"
    },
    {
        "source_sentence": "一者欲，二者恚，三者癡。",
        "translation": "One is desire, two are anger, and three are delusion.",
        "source": "T02n0150A_001:0882a19_9"
    },
    {
        "source_sentence": "是比丘三大病有三大藥，欲比丘大病者，惡露觀思惟大藥，恚大病，等慈行大藥，",
        "translation": "This monk's three major illnesses of great severity have three major medicines, and if he wants a monk with a major illness, he should contemplate the great medicine of badly exposed contemplation, discuss the great medicine of debilitating illness, and practice the great medicine of equal compassion.",
        "source": "T02n0150A_001:0882a19_10"
    },
    {
        "source_sentence": "癡大病，從本因緣生觀大藥，是比丘三大病者三藥。」",
        "translation": "The great illness of delusion is the great medicine of contemplation that arises from the original causes and conditions, which are the three medicines for the three major illnesses of a monk.",
        "source": "T02n0150A_001:0882a21_11"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0882a22_12"
    },
    {
        "source_sentence": "（四六）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(436) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T02n0150A_001:0882a24_0"
    },
    {
        "source_sentence": "佛便告比丘：「有三惡本：貪為一惡本，恚為二惡本，癡為三惡本。",
        "translation": "The Buddha then told the monk, There are three bad roots: greed is the first bad root, anger is the second bad root, and delusion is the third bad root.",
        "source": "T02n0150A_001:0882a25_1"
    },
    {
        "source_sentence": "以貪為惡本，慳亦貪本，以慳不得離慳，便身行惡、口行惡、意行惡，",
        "translation": "Because craving is the root of evil, and because stinginess is also the root of greed. Because stinginess prevents you from getting rid of stinginess, you will do evil with your body, evil with your speech, and evil with your mind.",
        "source": "T02n0150A_001:0882a26_2"
    },
    {
        "source_sentence": "是名亦惡。",
        "translation": "This is called also bad.",
        "source": "T02n0150A_001:0882a28_3"
    },
    {
        "source_sentence": "以慳便身不諦受，是心不諦受，是亦惡本。",
        "translation": "Because of stinginess, they don't accept it with respect to the body, and because they don't accept it with respect to the mind, this is also the bad root.",
        "source": "T02n0150A_001:0882a28_4"
    },
    {
        "source_sentence": "以慳著慳，便自壞身，亦壞身奇，亦兩壞是亦惡，以慳便不知，自身亦不知，",
        "translation": "Because they are stingy and attached to stinginess, they destroy their own bodies. The destruction of others’ bodies is also marvelous, and it is also bad that both should be destroyed. Because they are stingy, they do not know; neither do they themselves.",
        "source": "T02n0150A_001:0882a29_5"
    },
    {
        "source_sentence": "奇亦不知，兩是亦惡。",
        "translation": "What's strange doesn't know either, and both are bad as well.",
        "source": "T02n0150A_001:0882b02_6"
    },
    {
        "source_sentence": "以慳著慳，奇欲施，若殺、若係、若縛、若滅亡、若論議，是亦惡，以慳著、慳奇、欲施苦以施，",
        "translation": "Giving because of stinginess and attachment to stinginess, giving out of delight in sensual desires, or giving because of killing, imprisoning, fetters, annihilation, and arguments is also evil. Giving because of stinginess and attachment, being stingy and strange, and wanting to give out of pain are also evil.",
        "source": "T02n0150A_001:0882b02_7"
    },
    {
        "source_sentence": "若殺、若係、若縛、若滅亡、若論議，受心喜心得如願，是亦惡。",
        "translation": "If someone kills, attaches, binds, extinguishes, or discusses with a mind that's joyous and wishing to do so, this is also bad.",
        "source": "T02n0150A_001:0882b04_8"
    },
    {
        "source_sentence": "如是人比丘，名為不時說，亦名不如非法說，亦名不止惡說。",
        "translation": "Such a person or monk is called someone who doesn't speak at the right time, and they're also called someone who doesn't speak according to what's not taught, and they're also called someone who doesn't stop speaking badly.",
        "source": "T02n0150A_001:0882b06_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T02n0150A_001:0882b07_10"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0882b07_11"
    },
    {
        "source_sentence": "是人不時說，亦名不止惡說，但比丘，自身亦奇為欺，自癡復增癡，若人說至誠，",
        "translation": "That person doesn't speak at the right time, and it's also called not stopping bad speech. But a monk who speaks with utmost sincerity is also marvelously deceiving himself, and his own delusion increases further because of that delusion.",
        "source": "T02n0150A_001:0882b08_0"
    },
    {
        "source_sentence": "知不欲受至誠，若人說不至誠，不可意說病，是不是，如是我無有，是故如是人名為惡，",
        "translation": "They know that they do not wish to receive sincerity. If someone says, “I am not sincere,” and does not want to speak ill of illness, is this right? Such a self does not exist! That is why such a person is said to be evil.",
        "source": "T02n0150A_001:0882b09_1"
    },
    {
        "source_sentence": "說不至誠，不致好非法說，不止惡說。",
        "translation": "They speak words that are not sincere, don't lead to good or bad speech, and don't stop speaking badly.",
        "source": "T02n0150A_001:0882b11_2"
    },
    {
        "source_sentence": "如是人比丘，慳從慳因緣多非一，麁惡法從是致，恚癡從是致亦如是。",
        "translation": "Such a person or monk who is stingy and follows the causes and conditions of stinginess are often not one and the same, and it's because of this that crude and bad qualities are produced, and it's because of this that anger and delusion are produced.",
        "source": "T02n0150A_001:0882b12_3"
    },
    {
        "source_sentence": "如是人從後若干非一，貪恚癡、麁惡非法，布覆開滿拘，今見如是法說止苦，",
        "translation": "In this way, the person is not one and the same as the others. Their attachment to greed, hatred, delusion, hatred, hostility, and unlawfulness covers them up and fills them with prisoners. Now that he sees such a doctrine, he speaks of stopping suffering.",
        "source": "T02n0150A_001:0882b14_4"
    },
    {
        "source_sentence": "更并憂惱畏壞身望墮惡。",
        "translation": "It's accompanied by grief, anguish, fear, disintegration, and the expectation to fall into evil.",
        "source": "T02n0150A_001:0882b16_5"
    },
    {
        "source_sentence": "譬喻，比丘！",
        "translation": "It's a metaphor, monk!",
        "source": "T02n0150A_001:0882b16_6"
    },
    {
        "source_sentence": "如樹前芽栽[夫*夫]拮布覆閉滿封，如是非一，若干貪恚癡不好能法，",
        "translation": "It is as if the buds in front of a tree had sprouted, planted, covered, and filled with seeds. Just as right and wrong are not one and the same, so too desire, hatred, delusion, and non-cognisance do not exist together.",
        "source": "T02n0150A_001:0882b17_7"
    },
    {
        "source_sentence": "亦為己布覆閉滿封，如是為見在苦，止苦憂惱自燒己身墮惡。",
        "translation": "It's also because they cover themselves with their own cloth and shut it up, thus seeing that they're in pain and stopping suffering and distress, burning themselves and falling into evil.",
        "source": "T02n0150A_001:0882b18_8"
    },
    {
        "source_sentence": "「有三福好本，一為不貪好本，二為不恚好本，三為不惑好本。",
        "translation": "“There are three good roots of merit, the first is the good root of not craving, the second is the good root of not being stingy, and the third is the good root of not being confused.",
        "source": "T02n0150A_001:0882b20_9"
    },
    {
        "source_sentence": "若不貪，是亦好，若不慳，身行好行，口行好行，心行好行，是亦好，",
        "translation": "If they are not greedy, it is also good; if they are not stingy, good bodily actions, good verbal actions, and good mental actions are also good.",
        "source": "T02n0150A_001:0882b21_10"
    },
    {
        "source_sentence": "身諦受，口諦受，心諦受，是亦好。",
        "translation": "The feeling of the truth of body, the feeling of the truth of speech and the feeling of the truth of mind are also good.",
        "source": "T02n0150A_001:0882b23_11"
    },
    {
        "source_sentence": "若不念自身侵，若不念奇身侵，若不念兩侵，是亦好。",
        "translation": "If they aren't mindful of self-inflicted injury, don't think of strange physical injury, and don't think of both kinds of injury, this is also good.",
        "source": "T02n0150A_001:0882b24_0"
    },
    {
        "source_sentence": "若不慳亦不連慳，若自身知，若奇身知，若兩知，是亦好。",
        "translation": "If he doesn't stingy and doesn't share the same kind of stinginess, if he knows it himself, knows it in a strange body, or knows it both ways, this is also good.",
        "source": "T02n0150A_001:0882b25_1"
    },
    {
        "source_sentence": "若不慳，若連若不奇，人為有苦有憂，不若令有若殺、若斫、若捶、若讒、若亡、若論議，",
        "translation": "If someone isn’t stingy, or if they aren’t licentious, or if they aren’t strange, and people experience pain and grief, then they won’t be allowed to kill, beat, flog, eat, die, or discuss.",
        "source": "T02n0150A_001:0882b26_2"
    },
    {
        "source_sentence": "是亦好。",
        "translation": "This is also good.",
        "source": "T02n0150A_001:0882b28_3"
    },
    {
        "source_sentence": "若不慳、若不著慳、若不令奇，人若憂，不令有若殺、若斫、若捶、若讒、若亡、若論議，",
        "translation": "If someone isn’t stingy, doesn’t cling to stinginess, and doesn’t cause people to wonder, and if they grieve, they won’t allow others to kill, beat, flog, eat, die, or discuss.",
        "source": "T02n0150A_001:0882b28_4"
    },
    {
        "source_sentence": "心不受，心喜，令奇，人如願，是亦好。",
        "translation": "The mind doesn't accept it, and the mind delights in it, making it marvelous, and people do as they wish, which is also good.",
        "source": "T02n0150A_001:0882c01_5"
    },
    {
        "source_sentence": "如是人名為時說、如說、福說、法說、止惡說，是亦好。",
        "translation": "Such a person is called someone who teaches at the right time, teaches as he teaches, teaches merit, teaches the Dharma, and stops bad speech, which is also good.",
        "source": "T02n0150A_001:0882c02_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T02n0150A_001:0882c03_7"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0150A_001:0882c03_8"
    },
    {
        "source_sentence": "如是人名為時說、如說、法說、止惡說，為自知態亦知餘態，不匿不覆。",
        "translation": "Such a person is called someone who speaks at the right time, speaks accordingly, speaks the Dharma, stops speaking badly, knows for himself the characteristics and knows the other characteristics, without hiding or covering them.",
        "source": "T02n0150A_001:0882c03_9"
    },
    {
        "source_sentence": "若自知愚癡、憍慢亦餘態，若覺發人說不匿，受言不言我不知，或人不至誠作論議，",
        "translation": "If someone knows for themselves that foolishness and arrogance are the same as other states, or if they perceive those who give rise to feelings and tell others not to hide, accept words and don't say I don't know them, or if people don't sincerely engage in arguments,",
        "source": "T02n0150A_001:0882c05_10"
    },
    {
        "source_sentence": "即時自曉意報是事，我無有不至誠，無有是我亦無有是為，是故人時說、如說、福說、法說、止惡說，",
        "translation": "They immediately realize for themselves that the mental retribution is this: “There is no self that does not act with sincerity. There is no self, and there is no such thing as a self.” Because of this, people speak at the right time, speak accordingly, speak wisely, speak virtuously, speak in accordance with the Dharma, and stop speaking falsehoods.",
        "source": "T02n0150A_001:0882c07_11"
    },
    {
        "source_sentence": "不慳慳因緣亦如是非一。",
        "translation": "The causes and conditions of not being stingy and stingy are likewise the same as those of right and wrong.",
        "source": "T02n0150A_001:0882c09_12"
    },
    {
        "source_sentence": "若干好法，從是致死無有恚，亦如是無有癡，亦好從是致，如是比丘人非一，",
        "translation": "There are certain good qualities that lead to death because of which there is no anger, and so it is likewise without delusion. And the good [dharmas] also follow because of which there is no anger.",
        "source": "T02n0150A_001:0882c10_13"
    },
    {
        "source_sentence": "若干貪恚癡、弊惡法已舍已，更不復生，為見法安行，無有苦、無有惱、無有憂、無有熱，",
        "translation": "“Some people who have abandoned craving, hatred, delusion, and the evil of bad states will not arise again. They will see things as peaceful, without suffering, without vexation, without sorrow, and without fever.",
        "source": "T02n0150A_001:0882c12_14"
    },
    {
        "source_sentence": "已壞身便望好處。",
        "translation": "Once the body has been destroyed, they'll then hope to be reborn.",
        "source": "T02n0150A_001:0882c14_15"
    },
    {
        "source_sentence": "譬喻，比丘！",
        "translation": "It's a metaphor, monk!",
        "source": "T02n0150A_001:0882c14_16"
    },
    {
        "source_sentence": "如樹前芽栽，[夫*夫]拮便布覆閉滿封。",
        "translation": "It's like when a sprout is planted in front of a tree, the [fu*f] pāṇḍa then covers it and closes it completely.",
        "source": "T02n0150A_001:0882c15_0"
    },
    {
        "source_sentence": "若有人來不可[夫*夫]拮，不欲令有不駐，不欲令隱，不欲令通，便[夫*夫]拮掘根，",
        "translation": "If someone comes along and doesn’t want to make it available, or doesn’t want to make it stand still, or doesn’t want to make it accessible, then [such a person] will be deprived of his faculties.",
        "source": "T02n0150A_001:0882c15_1"
    },
    {
        "source_sentence": "便斷本；",
        "translation": "He then cut off the roots.",
        "source": "T02n0150A_001:0882c17_2"
    },
    {
        "source_sentence": "已斷本，便斷枝；",
        "translation": "Having cut off the roots, he cuts off the branches.",
        "source": "T02n0150A_001:0882c17_3"
    },
    {
        "source_sentence": "已斷枝，便破碎；",
        "translation": "Having cut off the branches, they are crushed.",
        "source": "T02n0150A_001:0882c18_4"
    },
    {
        "source_sentence": "已破碎，便劈；",
        "translation": "Having been broken down, they are split.",
        "source": "T02n0150A_001:0882c18_5"
    },
    {
        "source_sentence": "已劈便風暴燥，風暴燥已，便火燒；",
        "translation": "Once it has been chopped down, the wind is strong and dry. When the wind is strong and dry, a fire burns it.",
        "source": "T02n0150A_001:0882c18_6"
    },
    {
        "source_sentence": "已火燒，便作灰；",
        "translation": "Once the fire has burned it, they turn it into ashes.",
        "source": "T02n0150A_001:0882c19_7"
    },
    {
        "source_sentence": "已作灰，便大風颺；",
        "translation": "As soon as the ashes had been burned, a gale blew in the wind.",
        "source": "T02n0150A_001:0882c20_0"
    },
    {
        "source_sentence": "亦投彼河中，為是[夫*夫]拮。",
        "translation": "They'll also throw themselves into that river for this [fu*f] pāṇḍa.",
        "source": "T02n0150A_001:0882c20_1"
    },
    {
        "source_sentence": "從是本因緣已，已斷本，上下不復見，後不復生，如是不比丘自如是譬，",
        "translation": "Monks, it is just like this analogy: “After the original cause and condition has been destroyed through this cause and condition, there will no longer be a view up and down. There will no longer be a [new] birth.” This is so, monks.",
        "source": "T02n0150A_001:0882c21_0"
    },
    {
        "source_sentence": "上人行者亦如是非一。",
        "translation": "The superior practitioner is likewise one who practices right and wrong.",
        "source": "T02n0150A_001:0882c22_1"
    },
    {
        "source_sentence": "若貪恚癡、弊惡法已舍，已便不復生，為見法安行，無有苦、無有惱、無有憂、無有熱，",
        "translation": "“If someone’s craving, hatred, delusion, and the evil of bad qualities have been abandoned, then they won’t arise again. They will practice in order to see the Dharma peacefully, without suffering, without vexation, without sorrow, and without fever.",
        "source": "T02n0150A_001:0882c23_2"
    },
    {
        "source_sentence": "已壞身便望好處。」",
        "translation": "After the body breaks down, they'll then hope to repay it.",
        "source": "T02n0150A_001:0882c25_3"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0882c25_4"
    },
    {
        "source_sentence": "（四七）聞如是：一時，佛在舍衛國，行在祇樹給孤獨園。",
        "translation": "(49.7) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove while traveling in Śrāvastī.",
        "source": "T02n0150A_001:0882c26_0"
    },
    {
        "source_sentence": "佛便告比丘：「四行為黠所有、為賢者所知，非愚者所知、慧者可意。",
        "translation": "The Buddha then addressed the monks, Four practices are skillfully possessed by wise people and known by good men; they aren't known by foolish people and are desirable to wise people.",
        "source": "T02n0150A_001:0882c27_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T02n0150A_001:0882c28_2"
    },
    {
        "source_sentence": "布施，比丘！",
        "translation": "Giving, monk!",
        "source": "T02n0150A_001:0882c29_3"
    },
    {
        "source_sentence": "黠人知、賢者知，慧者可可者；",
        "translation": "The wise know and the wise know, while the wise are what is agreeable.",
        "source": "T02n0150A_001:0882c29_4"
    },
    {
        "source_sentence": "不欺，比丘！",
        "translation": "Don't lie, monk!",
        "source": "T02n0150A_001:0883a01_0"
    },
    {
        "source_sentence": "一切天下所黠知，如上說；",
        "translation": "All the wise ones of all worlds are as explained above.",
        "source": "T02n0150A_001:0883a01_1"
    },
    {
        "source_sentence": "孝事父母，比丘！",
        "translation": "Being filial to your parents, monks!",
        "source": "T02n0150A_001:0883a01_2"
    },
    {
        "source_sentence": "所黠知，如上說；",
        "translation": "The wise ones are as has been said above.",
        "source": "T02n0150A_001:0883a02_3"
    },
    {
        "source_sentence": "作沙門，比丘！",
        "translation": "Become an ascetic, monk!",
        "source": "T02n0150A_001:0883a02_4"
    },
    {
        "source_sentence": "所黠知，如上說；",
        "translation": "The wise ones are as has been said above.",
        "source": "T02n0150A_001:0883a03_0"
    },
    {
        "source_sentence": "法行道，比丘！",
        "translation": "Practicing the path of the Dharma, monks!",
        "source": "T02n0150A_001:0883a03_1"
    },
    {
        "source_sentence": "所黠知，亦賢者知，愚人所不知，黠者可。」",
        "translation": "A wise person knows what they know, and a good person knows it; a fool doesn't know it, but a wise person is allowed to do so.",
        "source": "T02n0150A_001:0883a03_2"
    },
    {
        "source_sentence": "從後說絕：「自知有布施，不欺、制意、自守，亦孝父母有守行，是事一切為黠者行，",
        "translation": "From then on, it's said to be cut off, Knowing for themselves that there's generosity, not deceiving, restrained, and self-controlled, and being filial to parents and guarding oneself, these things are all the actions of wise people.",
        "source": "T02n0150A_001:0883a04_3"
    },
    {
        "source_sentence": "如是可見成就，便世間得淨願。」",
        "translation": "Thus, it's visible and accomplished, and then the world attains the pure vow.",
        "source": "T02n0150A_001:0883a06_4"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T02n0150A_001:0883a07_5"
    },
    {
        "source_sentence": "佛說七處三觀經卷上",
        "translation": "Foshuo 七處三觀經經卷上",
        "source": "T02n0150A_001:0883a08_0"
    }
]