[
    {
        "source_sentence": "增壹阿含經卷第三十七",
        "translation": "Zengyi ahan jing, vol. 37",
        "source": "T02n0125_037:0751c03_0"
    },
    {
        "source_sentence": "東晉罽賓三藏瞿曇僧伽提婆譯",
        "translation": "Translated by Gautama Saṃghadeva of the Tripiṭaka of Kāśmīra in the Eastern Jin Dynasty",
        "source": "T02n0125_037:0751c05_0"
    },
    {
        "source_sentence": "八難品第四十二之二",
        "translation": "The forty-second and second parts of the forty-second chapter of the Eight Difficulties",
        "source": "T02n0125_037:0751c06_0"
    },
    {
        "source_sentence": "「當云何與車那比丘從事？」",
        "translation": "How will you work with the monk Chanda?",
        "source": "T02n0125_037:0751c07_0"
    },
    {
        "source_sentence": "世尊告曰：「當以梵法罰之。」",
        "translation": "The Bhagavān told them, You will punish him with the religious teaching.",
        "source": "T02n0125_037:0751c07_1"
    },
    {
        "source_sentence": "阿難白佛：「云何梵法罰之？」",
        "translation": "Ānanda said to the Buddha, How does the Sanskrit teaching punish him?",
        "source": "T02n0125_037:0751c08_2"
    },
    {
        "source_sentence": "世尊告曰：「不應與車那比丘有所說，亦莫言善，復莫言惡，然此比丘亦復不向汝當有所說。」",
        "translation": "The Bhagavān told him, You shouldn't say anything to the monk Cunda, and you shouldn't say good or bad, but this monk doesn't say anything to you.",
        "source": "T02n0125_037:0751c08_3"
    },
    {
        "source_sentence": "阿難白佛言：「設不究事者，此則犯罪不重乎？」",
        "translation": "Ānanda said to the Buddha, If someone doesn't investigate things, isn't this a serious offense?",
        "source": "T02n0125_037:0751c11_4"
    },
    {
        "source_sentence": "世尊告曰：「但不與語，即是梵法之罰；",
        "translation": "The World-honored One said: If you do not give me words, that would be the punishment for violating the religious precepts.",
        "source": "T02n0125_037:0751c12_5"
    },
    {
        "source_sentence": "然由不改者，當將詣眾中諸人共彈使出，莫與說戒，亦莫與法會從事。」",
        "translation": "However, if someone doesn't change their minds, they'll go to the congregation and all the people in the assembly will criticize him and send him out, don't explain the precepts to them, and don't attend the Dharma assembly.",
        "source": "T02n0125_037:0751c13_6"
    },
    {
        "source_sentence": "「欲與彼怨家，　　而報其怨者，",
        "translation": "“If you want to give up that enemy’s house And repay the enemy’s enemies,",
        "source": "T02n0125_037:0751c14_7"
    },
    {
        "source_sentence": "　恒念莫與語，　　此惡無過者。」",
        "translation": "Be always mindful and don't say anything, for this bad thing is not wrong.",
        "source": "T02n0125_037:0751c14_7"
    },
    {
        "source_sentence": "爾時，世尊便說此偈：是時，拘尸那竭人民聞如來當取滅度，剋在夜半。",
        "translation": "It was then that the World-honored One uttered these verses: At that time the people of Kuśinagara heard that the Tathāgata was about to enter nirvana, and it was midnight.",
        "source": "T02n0125_037:0751c14_7"
    },
    {
        "source_sentence": "是時，國土人民往至雙樹間。",
        "translation": "The people of the land then went to the place between the two trees.",
        "source": "T02n0125_037:0751c19_8"
    },
    {
        "source_sentence": "到已，頭面禮足，在一面坐。",
        "translation": "When he arrived, he bowed his head and feet and sat to one side.",
        "source": "T02n0125_037:0751c19_9"
    },
    {
        "source_sentence": "爾時，人民白世尊言：「今聞如來當取滅度，我等當云何興敬？」",
        "translation": "It was then that the people said to the Bhagavān, Now that we've heard that the Tathāgata is about to enter nirvāṇa, how will we revere him?",
        "source": "T02n0125_037:0751c20_10"
    },
    {
        "source_sentence": "是時，世尊顧視阿難。",
        "translation": "The Bhagavān then looked at Ānanda.",
        "source": "T02n0125_037:0751c21_11"
    },
    {
        "source_sentence": "是時，阿難即作是念：「如來今日身體疲倦，欲使我旨授彼義。」",
        "translation": "Ānanda then had this thought, Today, the Tathāgata's body is so exhausted that he wants me to teach them their meaning.",
        "source": "T02n0125_037:0751c22_12"
    },
    {
        "source_sentence": "是時，阿難右膝著地，長跪叉手，白世尊言：「今有二種之姓，一名婆阿陀，",
        "translation": "At that moment, Ānanda knelt with his right knee on the ground. Kneeling cross-legged, he said to the World-honored One:",
        "source": "T02n0125_037:0751c23_13"
    },
    {
        "source_sentence": "二名須拔陀，今來自歸如來聖眾：『唯願世尊聽為優婆塞，自今已後不復殺生！』",
        "translation": "The second name is Subhadra, which now comes from the Tathāgata's noble congregation: 'May the Bhagavān listen to you as a layman and not kill again from now on!'",
        "source": "T02n0125_037:0751c25_14"
    },
    {
        "source_sentence": "復有名帝奢，二名優波帝奢，復有名佛舍，二名雞頭，如是之比皆來歸如來：『唯願世尊聽為優婆塞，",
        "translation": "Again, there is another name called Tiṣya. The second name is Upāsaka. There is another name of the Buddha’s house. The second name is Kukkuṭapāda.",
        "source": "T02n0125_037:0751c27_15"
    },
    {
        "source_sentence": "自今之後不復殺生，奉持五戒！』」",
        "translation": "From now on, he won't kill again and observes the five precepts!'",
        "source": "T02n0125_037:0752a01_0"
    },
    {
        "source_sentence": "是時，世尊廣為說法，發遣使歸。",
        "translation": "The Bhagavān then extensively taught the Dharma for them, sending an envoy to return.",
        "source": "T02n0125_037:0752a01_1"
    },
    {
        "source_sentence": "是時，五百摩羅眾即從座起，繞佛三匝，便退而去。",
        "translation": "The five hundred Mallan clanspeople then rose from their seats, circumambulated the Buddha three times, and departed.",
        "source": "T02n0125_037:0752a02_2"
    },
    {
        "source_sentence": "爾時，世尊告阿難曰：「吾最後受證弟子，所謂拘尸那竭五百摩羅是也。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, I'm the last disciple to receive assurance, which is called Kauśinagara and the five hundred māras.",
        "source": "T02n0125_037:0752a03_3"
    },
    {
        "source_sentence": "爾時，須拔梵志從彼國來至拘尸那竭國，遙見五百人來，即問之曰：「汝等為從何來？」",
        "translation": "It was then that Suppository Brahma came from that country to the country of Kuśinagara and saw five hundred people coming from a distance, and asked them, Where are you coming from?",
        "source": "T02n0125_037:0752a05_4"
    },
    {
        "source_sentence": "五百人報曰：「須拔當知，如來今日當取滅度，在雙樹間。」",
        "translation": "The five hundred people replied, Suppose you'll know that the Tathāgata will enter nirvāṇa today and be among the twin trees.",
        "source": "T02n0125_037:0752a07_5"
    },
    {
        "source_sentence": "是時，須拔便作是念：「如來出現於世甚為難遇，如來出世時時乃有，",
        "translation": "At that time, Subhadra thought thus: “The appearance of the Tathāgata in the world is very difficult to encounter.",
        "source": "T02n0125_037:0752a08_6"
    },
    {
        "source_sentence": "如優曇鉢華億劫乃出。",
        "translation": "It's like the udumbara flower that emerges after a billion eons.",
        "source": "T02n0125_037:0752a10_7"
    },
    {
        "source_sentence": "我今少多有疑不解諸法，唯彼瞿曇沙門能解我狐疑。",
        "translation": "I now have few or many doubts and don't understand the teachings, but that Gautama monk alone can understand my doubts.",
        "source": "T02n0125_037:0752a10_8"
    },
    {
        "source_sentence": "我今可往至彼瞿曇所，而問此義。」",
        "translation": "Now, I can go to that Gautama and ask about this meaning.",
        "source": "T02n0125_037:0752a12_0"
    },
    {
        "source_sentence": "是時，須拔梵志至雙樹間，到阿難所，白阿難曰：「吾聞世尊今日當取滅度，",
        "translation": "At that time, the brahmin Subhadra went to Ānanda’s place between two śāla trees and said to him: I have heard that the World-honored One is about to enter nirvana today.",
        "source": "T02n0125_037:0752a12_1"
    },
    {
        "source_sentence": "為審爾不？」",
        "translation": "Is it for your sake?",
        "source": "T02n0125_037:0752a14_2"
    },
    {
        "source_sentence": "阿難報曰：「審有其事。」",
        "translation": "Ānanda replied, Let's examine this matter.",
        "source": "T02n0125_037:0752a14_3"
    },
    {
        "source_sentence": "須拔白言：「然我今日猶有狐疑，唯願聽許白世尊此言：『餘人不解六師所說，",
        "translation": "Sudarśana said, “O Bhagavat! Today I still have doubts. All I ask is that you allow me to say this:",
        "source": "T02n0125_037:0752a15_4"
    },
    {
        "source_sentence": "為得見沙門瞿曇所說乎？』」",
        "translation": "Is it possible to see what the ascetic Gautama teaches?'",
        "source": "T02n0125_037:0752a17_5"
    },
    {
        "source_sentence": "阿難白言：「止！",
        "translation": "Ānanda said, Stop!",
        "source": "T02n0125_037:0752a17_6"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T02n0125_037:0752a18_7"
    },
    {
        "source_sentence": "須拔！",
        "translation": "Suppository!",
        "source": "T02n0125_037:0752a18_8"
    },
    {
        "source_sentence": "勿嬈如來。」",
        "translation": "Don't disturb the Tathāgata.",
        "source": "T02n0125_037:0752a18_9"
    },
    {
        "source_sentence": "如是再三，復白阿難曰：「如來出世甚不可遇，如優曇鉢華時時乃有，",
        "translation": "Again and again, he said to Ānanda: When the Tathāgata appears in the world it is most unlikely that he will be encountered. It is like the flower of the udumbara fig tree growing seasonally.",
        "source": "T02n0125_037:0752a18_10"
    },
    {
        "source_sentence": "如來亦復如是，時時乃出，然我今觀如來足能解我狐疑，我今所問義者蓋不足言。",
        "translation": "The Tathāgata is also like this, but I now observe that the Tathāgata's feet are capable of understanding my doubts, so it's not enough to explain the meaning of what I'm asking.",
        "source": "T02n0125_037:0752a20_11"
    },
    {
        "source_sentence": "又今，阿難！",
        "translation": "Again, Ānanda!",
        "source": "T02n0125_037:0752a22_12"
    },
    {
        "source_sentence": "不與我往白世尊。",
        "translation": "They won't go with me to tell the Bhagavān.",
        "source": "T02n0125_037:0752a22_13"
    },
    {
        "source_sentence": "又聞如來却觀無窮，前覩無極，然今日獨不見接納。」",
        "translation": "I've also heard that the Tathāgata doesn't observe infinity and that his past deeds are limitless, but today I don't see him alone taking them in.",
        "source": "T02n0125_037:0752a22_14"
    },
    {
        "source_sentence": "是時，世尊以天耳遇聞須拔向阿難作如是論。",
        "translation": "At the time, the Bhagavān encountered and heard Subhadra with his divine ears and addressed Ānanda with this kind of argument.",
        "source": "T02n0125_037:0752a24_15"
    },
    {
        "source_sentence": "爾時，世尊告阿難曰：「止！",
        "translation": "It was then that the Bhagavān addressed Ānanda, Stop!",
        "source": "T02n0125_037:0752a25_16"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T02n0125_037:0752a25_17"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T02n0125_037:0752a25_18"
    },
    {
        "source_sentence": "勿遮須拔梵志。",
        "translation": "Don't obscure the monk Suppository.",
        "source": "T02n0125_037:0752a26_19"
    },
    {
        "source_sentence": "所以然者，此來問義多所饒益，若我說法者即得度脫。」",
        "translation": "That's because the meaning of this question is so beneficial, and if I teach it, I'll be liberated.",
        "source": "T02n0125_037:0752a26_20"
    },
    {
        "source_sentence": "是時，阿難語須拔言：「善哉！",
        "translation": "Ānanda then said to Suppository, Good!",
        "source": "T02n0125_037:0752a27_21"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T02n0125_037:0752a28_22"
    },
    {
        "source_sentence": "如來今聽在內問法。」",
        "translation": "The Tathāgata now listens to the teaching and asks questions inside.",
        "source": "T02n0125_037:0752a28_23"
    },
    {
        "source_sentence": "是時，須拔聞此語已，歡喜踊躍，不能自勝。",
        "translation": "After hearing these words, Suppository was overjoyed and jumped for joy, unable to control himself.",
        "source": "T02n0125_037:0752a29_0"
    },
    {
        "source_sentence": "又復須拔往至世尊所，頭面禮足，在一面坐。",
        "translation": "Again, he had to pull it out and go to the Bhagavān, bowed his head and feet, and sat to one side.",
        "source": "T02n0125_037:0752b01_0"
    },
    {
        "source_sentence": "爾時，須拔白世尊言：「我今欲有所問，唯願聽許！」",
        "translation": "It was then that Suppository said to the Bhagavān, Now, I want to ask a question, so please listen!",
        "source": "T02n0125_037:0752b02_0"
    },
    {
        "source_sentence": "是時，世尊告須拔曰：「今正是時，宜可時問。」",
        "translation": "The Bhagavān then addressed Suppository, Now is the right time to ask questions at the right time.",
        "source": "T02n0125_037:0752b03_1"
    },
    {
        "source_sentence": "是時，須拔白佛言：「諸異沙門，瞿曇！",
        "translation": "At that point, Suppository said to the Buddha,異沙門, Gautama!",
        "source": "T02n0125_037:0752b04_2"
    },
    {
        "source_sentence": "知諸算術，多所過度。",
        "translation": "He knows that there are many ways to do calculation and so forth.",
        "source": "T02n0125_037:0752b04_3"
    },
    {
        "source_sentence": "所謂不蘭迦葉、阿夷耑、瞿耶樓、胝休迦旃、先毘盧持、尼揵子等，如此之比，",
        "translation": "The so-called Pūraṇa-kāśyapa, Ajita, Gotama, Kauṇḍinya, Kātyāyana, Saṃpilubha, and Nirgranthabyas are likewise.",
        "source": "T02n0125_037:0752b05_4"
    },
    {
        "source_sentence": "知三世事乎？",
        "translation": "Do you know the affairs of the three times?",
        "source": "T02n0125_037:0752b07_5"
    },
    {
        "source_sentence": "為不解耶？",
        "translation": "Why is it not understood?",
        "source": "T02n0125_037:0752b07_6"
    },
    {
        "source_sentence": "其六師之中復有勝如來乎？」",
        "translation": "Among those six teachers, is there another superior tathāgata?",
        "source": "T02n0125_037:0752b07_7"
    },
    {
        "source_sentence": "爾時，世尊告曰：「止！",
        "translation": "It was then that the Bhagavān addressed him, Stop!",
        "source": "T02n0125_037:0752b08_8"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T02n0125_037:0752b09_0"
    },
    {
        "source_sentence": "須拔，勿問此義，何煩問此勝如來乎？",
        "translation": "Suppository, don't ask about this meaning; why would you bother to ask about the superior Tathāgata?",
        "source": "T02n0125_037:0752b09_1"
    },
    {
        "source_sentence": "然我今日在此座上，當與汝說法，善思念之。」",
        "translation": "Still, today, while I'm here on my seat, I will explain the teaching to you, and you should think well of it.",
        "source": "T02n0125_037:0752b09_2"
    },
    {
        "source_sentence": "須拔白佛言：「今當為問深義，唯願世尊以時說之。」",
        "translation": "Suppository said to the Buddha, Now, I'll ask a profound question for his sake, but may the Bhagavān explain it at the right time.",
        "source": "T02n0125_037:0752b11_3"
    },
    {
        "source_sentence": "爾時，世尊告曰：「我初學道時年二十九，欲度人民故，三十五年在外道中學，",
        "translation": "At that time the World-honored One said to them: I was twenty-nine years old when I began my studies in the path of religion. In order to save the people, I spent thirty-five years in a heretical religious school.",
        "source": "T02n0125_037:0752b12_4"
    },
    {
        "source_sentence": "自是已來更不見沙門、婆羅門，其大眾中無八賢聖道者，則無沙門四果。",
        "translation": "Since then no śramaṇas or brāhmaṇas have been seen in the assembly. If there weren't eight good and holy paths, there wouldn't be four fruits of śramaṇahood.",
        "source": "T02n0125_037:0752b14_5"
    },
    {
        "source_sentence": "是謂，須拔，世間空虛，更無真人得道者也。",
        "translation": "This means that the world must be removed, and there's no real person who attains the path.",
        "source": "T02n0125_037:0752b15_6"
    },
    {
        "source_sentence": "以其賢聖法中有賢聖法者，則有沙門四果之報。",
        "translation": "If there's a good and noble dharma in that good and noble dharma, then there are the four fruits of asceticism.",
        "source": "T02n0125_037:0752b16_7"
    },
    {
        "source_sentence": "所以然者，因有沙門四果之報，皆由賢聖八品道也。",
        "translation": "The reason for this is that the four fruits of rebirth as a śramaṇa are all due to the eightfold path of the wise and holy.",
        "source": "T02n0125_037:0752b18_0"
    },
    {
        "source_sentence": "若須拔！",
        "translation": "If it's necessary, then...",
        "source": "T02n0125_037:0752b19_1"
    },
    {
        "source_sentence": "若我不得無上正真之道，皆由不得賢聖八品道；",
        "translation": "If I do not attain the unsurpassed true path, it is all because I have not attained the eightfold path of saints and sages.",
        "source": "T02n0125_037:0752b19_2"
    },
    {
        "source_sentence": "以其得賢聖八品道，故成佛道。",
        "translation": "Because they've attained the eightfold path of goodness and nobleness, they'll attain the Buddha Way.",
        "source": "T02n0125_037:0752b20_3"
    },
    {
        "source_sentence": "是故，須拔，當求方便，成賢聖道。」",
        "translation": "Therefore, you must remove it and seek skillful means to achieve the noble path of goodness.",
        "source": "T02n0125_037:0752b21_4"
    },
    {
        "source_sentence": "然須拔復白佛言：「我亦樂聞賢聖八品道，唯願演說！」",
        "translation": "Still, Suppository again said to the Buddha, I'm happy to hear the eightfold path of goodness and nobleness, so please explain it!",
        "source": "T02n0125_037:0752b22_5"
    },
    {
        "source_sentence": "世尊告曰：「所謂八道者，等見、等治、等語、等命、等業、等方便、等念、等三昧。",
        "translation": "The Bhagavān told them, So-called eight paths are equal in view, equal in cure, equal in speech, equal in life, equal in action, equal in effort, equal in mindfulness, and equal in concentration.",
        "source": "T02n0125_037:0752b23_6"
    },
    {
        "source_sentence": "是謂，須拔，賢聖八品道。」",
        "translation": "This is called the eightfold path of upādhyāya, the good and noble.",
        "source": "T02n0125_037:0752b25_7"
    },
    {
        "source_sentence": "是時，須拔即於座上得法眼淨。",
        "translation": "At that point, Suppository then attained purity of the Dharma eye while sitting on his seat.",
        "source": "T02n0125_037:0752b25_8"
    },
    {
        "source_sentence": "爾時，須拔語阿難言：「爾我今快得善利，唯願世尊聽為沙門。」",
        "translation": "It was then that Suppository said to Ānanda, Now, I'll quickly attain good benefits, so may the Bhagavān hear me become a monk.",
        "source": "T02n0125_037:0752b26_9"
    },
    {
        "source_sentence": "阿難報言：「汝今自往至世尊所，求作沙門。」",
        "translation": "Ānanda replied, Now, go to the Bhagavān's place and seek to become an ascetic.",
        "source": "T02n0125_037:0752b27_10"
    },
    {
        "source_sentence": "是時，須拔往至世尊所，頭面禮足，白世尊言：「唯願世尊聽作沙門。」",
        "translation": "Sudhana then went to the Bhagavān, bowed his head and feet, and said to the Bhagavān, Please, Bhagavān, let's hear you become a monk.",
        "source": "T02n0125_037:0752b28_11"
    },
    {
        "source_sentence": "爾時，須拔即成沙門身，著三法衣。",
        "translation": "At that point, Suppository then formed into the body of an ascetic and put on the three Dharma robes.",
        "source": "T02n0125_037:0752c01_12"
    },
    {
        "source_sentence": "時須拔仰觀世尊顏，即於座上有漏心得解脫。",
        "translation": "Sudhana then looked up and saw the Bhagavān's face, and he was seated on his seat with an impure mind liberated.",
        "source": "T02n0125_037:0752c02_13"
    },
    {
        "source_sentence": "爾時，世尊告阿難曰：「我最後弟子之中，所謂須拔是也。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, Among my last disciples, it's called Suppository.",
        "source": "T02n0125_037:0752c03_14"
    },
    {
        "source_sentence": "爾時，須拔白佛言：「我今聞世尊夜半當取般涅槃，唯願世尊先聽我取涅槃，",
        "translation": "At that moment, Subhadra said to the Buddha: I have now heard that the World-honored One is about to enter final nirvana at midnight. May the World-honored One first allow me to enter nirvana!",
        "source": "T02n0125_037:0752c04_15"
    },
    {
        "source_sentence": "我不堪見如來先取滅度。」",
        "translation": "I can't see the Tathāgata first attain nirvāṇa.",
        "source": "T02n0125_037:0752c06_16"
    },
    {
        "source_sentence": "爾時，世尊默然可之。",
        "translation": "At the time, the Bhagavān was silent and approved of it.",
        "source": "T02n0125_037:0752c07_0"
    },
    {
        "source_sentence": "所以然者，過去恒沙諸佛世尊，最後取證弟子先取般涅槃，如來後取滅度。",
        "translation": "The reason for this is that in the past buddhas and world-honored ones as numerous as the grains of sand in the Ganges River took the final realization disciples first, attained parinirvāṇa first, and the Tathāgata later entered nirvana.",
        "source": "T02n0125_037:0752c07_1"
    },
    {
        "source_sentence": "此是諸佛世尊常法，非適今日也！",
        "translation": "This is the eternal dharma of the buddhas and world-honored ones, not what's appropriate today!",
        "source": "T02n0125_037:0752c09_2"
    },
    {
        "source_sentence": "是時，須拔見世尊已可之，即在如來前，正身正意，繫念在前，於無餘涅槃界而取滅度。",
        "translation": "Seeing that the Bhagavān had approved of it, Suppository then stood in front of the Tathāgata, corrected his body and mind, concentrated his thoughts before him, and entered nirvāṇa without remainder.",
        "source": "T02n0125_037:0752c10_3"
    },
    {
        "source_sentence": "是時，此地六變振動。",
        "translation": "At the time, this place was shaken by six transformations.",
        "source": "T02n0125_037:0752c12_4"
    },
    {
        "source_sentence": "「一切行無常，　　生者必有死，",
        "translation": "All conditioned things are impermanent, and birth necessarily has death.",
        "source": "T02n0125_037:0752c12_5"
    },
    {
        "source_sentence": "　不生則不死，　　此滅為最樂。」",
        "translation": "If they don't arise, they won't die; this cessation is the most pleasant.",
        "source": "T02n0125_037:0752c12_5"
    },
    {
        "source_sentence": "爾時，世尊便說此偈：是時，世尊告阿難曰：「自今已後勅諸比丘！",
        "translation": "At that point, the Bhagavān then spoke this verse: The Bhagavān then addressed Ānanda, From now on, I'll command the monks!",
        "source": "T02n0125_037:0752c12_5"
    },
    {
        "source_sentence": "不得卿僕相向，大稱尊，小稱賢，相視當如兄弟，自今已後不得稱父母所作字。」",
        "translation": "You mustn't face each other with your servants, which are called honored by the great and venerated by the lesser, and look at each other like brothers; from now on, you mustn't call them what their parents say.",
        "source": "T02n0125_037:0752c17_0"
    },
    {
        "source_sentence": "是時，阿難白世尊言：「如今諸比丘當云何自稱名號？」",
        "translation": "Ānanda then said to the Bhagavān, Now, how will the monks call themselves by name?",
        "source": "T02n0125_037:0752c19_0"
    },
    {
        "source_sentence": "世尊告曰：「若小比丘向大比丘稱長老，大比丘向小比丘稱姓字，又諸比丘欲立字者，",
        "translation": "The World-honored One said: If a minor bhikṣu addresses a major bhikṣu and calls him an elder, or if a major bhikṣu addresses a minor bhikṣu and calls him by his family name.",
        "source": "T02n0125_037:0752c20_1"
    },
    {
        "source_sentence": "當依三尊。",
        "translation": "You should rely on the three honored ones.",
        "source": "T02n0125_037:0752c22_2"
    },
    {
        "source_sentence": "此是我之教誡。」",
        "translation": "This is my teaching and admonition.",
        "source": "T02n0125_037:0752c22_3"
    },
    {
        "source_sentence": "是時，阿難聞世尊所說，歡喜奉行。",
        "translation": "Having heard the World-honored One’s exhortation, Ānanda was delighted and remembered it well.",
        "source": "T02n0125_037:0752c23_0"
    },
    {
        "source_sentence": "（四）聞如是：一時，佛在舍衛國鹿野苑中，與大比丘眾五百人俱。",
        "translation": "(4) Thus I have heard: One time, the Buddha was staying at Deer Preserve in Sāvatthī, accompanied by five hundred great bhikṣus.",
        "source": "T02n0125_037:0752c24_0"
    },
    {
        "source_sentence": "是時，波呵羅阿須倫及牟提輪天子，非時至世尊所，頭面禮足，在一面坐。",
        "translation": "At the time, it wasn't the right time for the Bhagavān to go there, so the asuras Pāhora and the wheel-turning celestial sons of Muti went to the Bhagavān, bowed their heads and feet, and sat to one side.",
        "source": "T02n0125_037:0752c25_1"
    },
    {
        "source_sentence": "是時，如來問阿須倫曰：「汝等甚樂大海中乎？」",
        "translation": "The Tathāgata then asked the asuras, Are you very happy in the ocean?",
        "source": "T02n0125_037:0752c27_2"
    },
    {
        "source_sentence": "阿須倫白佛言：「實樂，非為不樂。」",
        "translation": "The asuras said to the Buddha, It's really pleasant, not unpleasant.",
        "source": "T02n0125_037:0752c28_3"
    },
    {
        "source_sentence": "世尊告曰：「大海之中有何奇特之法，汝等見已，於中娛樂？」",
        "translation": "The Bhagavān told them, What's the extraordinary thing in the ocean that you see and amuse yourself in it?",
        "source": "T02n0125_037:0752c29_4"
    },
    {
        "source_sentence": "阿須倫白佛言：「大海之中有八未曾有之法，諸阿須倫娛樂其中。",
        "translation": "The asuras said to the Buddha, “There are eight extraordinary qualities of the great ocean that delight the asuras.",
        "source": "T02n0125_037:0753a01_5"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T02n0125_037:0753a03_0"
    },
    {
        "source_sentence": "於是，大海之中極深且廣，是謂初未曾有之法。",
        "translation": "This was the first extraordinary quality of the great ocean.",
        "source": "T02n0125_037:0753a03_1"
    },
    {
        "source_sentence": "「復次，大海有此神德，四大江河，一一河者將從五百以投大海，便失本名字，",
        "translation": "“Furthermore, since the great ocean has this divine quality, each of the four great rivers will follow the five hundred [coast] rivers to enter the great ocean and lose their original names.",
        "source": "T02n0125_037:0753a04_2"
    },
    {
        "source_sentence": "是謂第二之法也。",
        "translation": "This is the second teaching.",
        "source": "T02n0125_037:0753a06_3"
    },
    {
        "source_sentence": "「復次，大海皆同一味，是謂第三之法也。",
        "translation": "“Furthermore, the great oceans are all of the same taste—this is the third principle.",
        "source": "T02n0125_037:0753a06_4"
    },
    {
        "source_sentence": "「復次，大海以時朝賀，不失時節，是謂第四未曾有之法。",
        "translation": "Again, this is the fourth extraordinary quality of a great ocean.",
        "source": "T02n0125_037:0753a07_5"
    },
    {
        "source_sentence": "「復次，大海鬼神所居，有形之類無不在大海中者，是謂第五未曾有之法。",
        "translation": "“Furthermore, this is the fifth extraordinary quality of a great ocean where ghosts live and there are no shaped creatures that aren’t in the ocean.",
        "source": "T02n0125_037:0753a08_6"
    },
    {
        "source_sentence": "「復次，大海之中皆容極大之形，百由旬形，乃至七千由旬形，亦不逼迮，",
        "translation": "“Furthermore, the great ocean contains a hundred yojanas in size and so forth, up to seven thousand yojanas in size, without crowding.",
        "source": "T02n0125_037:0753a10_7"
    },
    {
        "source_sentence": "是謂第六未曾有之法。",
        "translation": "This is the sixth unprecedented thing.",
        "source": "T02n0125_037:0753a12_8"
    },
    {
        "source_sentence": "「復次，大海之中出若干種珍寶，硨璩、瑪瑙、真珠、琥珀、水精、琉璃，",
        "translation": "“Furthermore, various kinds of rare treasures emerge from the great ocean: coral, agate, genuine pearls, ambrosia, crystal, and lapis lazuli.",
        "source": "T02n0125_037:0753a12_9"
    },
    {
        "source_sentence": "是謂第七未曾有之法。",
        "translation": "This is the seventh unprecedented thing.",
        "source": "T02n0125_037:0753a14_10"
    },
    {
        "source_sentence": "「復次，大海之中下有金沙，又有須彌山，四寶所成，是謂第八未曾有之法。",
        "translation": "“Furthermore, the eighth extraordinary quality is that there is a golden sand beneath the ocean and also Mount Sumeru, formed of the four kinds of treasure.",
        "source": "T02n0125_037:0753a14_11"
    },
    {
        "source_sentence": "此名八未曾有之法，使諸阿須倫娛樂其中。」",
        "translation": "These are called the eight unprecedented dharmas that cause the asuras to amuse themselves in them.",
        "source": "T02n0125_037:0753a16_12"
    },
    {
        "source_sentence": "是時，阿須倫白世尊：「如來法中有何奇特，使諸比丘見已，娛樂其中？」",
        "translation": "The asuras then said to the Bhagavān, What's so special about the Tathāgata's teaching that it causes the monks to see it and enjoy it?",
        "source": "T02n0125_037:0753a17_13"
    },
    {
        "source_sentence": "佛告阿須倫曰：「有八未曾有之法，使諸比丘娛樂其中。",
        "translation": "The Buddha told the asuras, There are eight extraordinary qualities that enable the monks to amuse themselves there.",
        "source": "T02n0125_037:0753a19_14"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T02n0125_037:0753a20_15"
    },
    {
        "source_sentence": "又我法中戒律具足，無放逸行，是謂初未曾有之法。",
        "translation": "Furthermore, in my teaching, the precepts and vinaya are fully endowed, and there's no careless practice. This is called the first unprecedented thing.",
        "source": "T02n0125_037:0753a20_16"
    },
    {
        "source_sentence": "諸比丘見已，娛樂其中，如彼大海極深且廣。",
        "translation": "Seeing this, the monks amuse themselves in it, just like the great ocean that is deep and wide.",
        "source": "T02n0125_037:0753a22_17"
    },
    {
        "source_sentence": "「復次，我法中有四種姓，於我法中作沙門，不錄前名，更作餘字，猶如彼海，",
        "translation": "“Furthermore, in my teaching there are four castes of people who become śramaṇas according to my teaching. They don’t record their former names or make any other words for them, just as they did in that ocean.",
        "source": "T02n0125_037:0753a23_18"
    },
    {
        "source_sentence": "四大江河皆投于海而同一味，更無餘名，是謂第二未曾有之法。",
        "translation": "The four great rivers all plunge into the ocean with one and the same taste, without any other names. This is the second extraordinary quality.",
        "source": "T02n0125_037:0753a25_19"
    },
    {
        "source_sentence": "「復次，我法中施設禁戒，相隨亦不越敘，是謂第三未曾有之法。",
        "translation": "“Furthermore, this is the third extraordinary quality of my teaching that establishes prohibitions and precepts without going beyond words.",
        "source": "T02n0125_037:0753a26_20"
    },
    {
        "source_sentence": "「復次，我法中皆同一味，所謂賢聖八品道味，是謂第四未曾有之法也，",
        "translation": "“Furthermore, the self and dharmas are all of one and the same taste. The so-called eight flavors of the path of enlightenment of the wise and holy ones is the fourth extraordinary quality.",
        "source": "T02n0125_037:0753a28_21"
    },
    {
        "source_sentence": "如彼大海悉同一味。",
        "translation": "Like that great ocean, they all have the same taste.",
        "source": "T02n0125_037:0753a29_22"
    },
    {
        "source_sentence": "「復次，我法中種種法充滿其中，所謂四意斷、四神足、五根、五力、七覺意、八真直行，",
        "translation": "“Furthermore, there are various things in my teaching that fill them: the four kinds of mental elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of enlightenment, and the eight true and straightforward practices.",
        "source": "T02n0125_037:0753b01_23"
    },
    {
        "source_sentence": "諸比丘見已，娛樂其中，如彼大海諸神居其中，是謂第五未曾有之法。",
        "translation": "The fifth extraordinary quality is that when the bhikṣus see it, they amuse themselves in it like the gods of the great ocean living there.",
        "source": "T02n0125_037:0753b03_24"
    },
    {
        "source_sentence": "「復次，我法中有種種珍寶。",
        "translation": "“Furthermore, there are various treasures in my teaching.",
        "source": "T02n0125_037:0753b04_25"
    },
    {
        "source_sentence": "所謂念覺意寶、法覺意寶、精進覺意寶、喜覺意寶、猗覺意寶、定覺意寶、護覺意寶，",
        "translation": "It's called the awakening intention treasure of mindfulness, the awakening intention treasure of principles, the awakening intention treasure of effort, the awakening intention treasure of joy, the awakening intention treasure of peace, the awakening intention treasure of concentration, and the awakening intention treasure of protection.",
        "source": "T02n0125_037:0753b05_26"
    },
    {
        "source_sentence": "是謂第六未曾有之法。",
        "translation": "This is the sixth unprecedented thing.",
        "source": "T02n0125_037:0753b07_27"
    },
    {
        "source_sentence": "諸比丘見已，娛樂其中，如彼大海出種種珍寶。",
        "translation": "Seeing this, the monks were delighted and amused, just like the various treasures that emerged from the great ocean.",
        "source": "T02n0125_037:0753b07_28"
    },
    {
        "source_sentence": "「復次，我法中諸有眾生類，剃除鬚髮，著三法衣，出家學道，於無餘涅槃界而取滅度。",
        "translation": "“Furthermore, in my teaching, there are sentient beings who shave their hair and beards, don the three robes of the Dharma, leave home to train on the path, and attain liberation in the sphere of nirvāṇa without remainder.",
        "source": "T02n0125_037:0753b08_29"
    },
    {
        "source_sentence": "然我法中無有增減，如彼大海，諸河投之無有增減，是謂第七未曾有之法，",
        "translation": "This is the seventh extraordinary quality of a buddha.",
        "source": "T02n0125_037:0753b10_30"
    },
    {
        "source_sentence": "諸比丘見已，娛樂其中。",
        "translation": "The monks saw this and amuse themselves in it.",
        "source": "T02n0125_037:0753b12_31"
    },
    {
        "source_sentence": "「復次，我法中有金剛三昧，有滅盡三昧，一切光明三昧，得不起三昧，",
        "translation": "“Furthermore, in my teaching there is the vajra-samādhi, the samādhi of cessation, the samādhi of all lights, and the samādhi of neither arising nor ceasing.",
        "source": "T02n0125_037:0753b13_32"
    },
    {
        "source_sentence": "種種三昧不可稱計，諸比丘見已娛樂，如彼大海下有金沙，是謂第八未曾有之法。",
        "translation": "The eighth extraordinary quality is that the various concentrations cannot be measured, and once they are seen, the bhikṣus are delighted, just as there is gold sand beneath the great ocean.",
        "source": "T02n0125_037:0753b14_33"
    },
    {
        "source_sentence": "諸比丘見已，娛樂其中。",
        "translation": "The monks saw this and amuse themselves in it.",
        "source": "T02n0125_037:0753b16_34"
    },
    {
        "source_sentence": "於我法中有此八未曾有之法，諸比丘甚自娛樂。」",
        "translation": "Among these eight extraordinary qualities of my teaching, the monks are greatly amused.",
        "source": "T02n0125_037:0753b17_35"
    },
    {
        "source_sentence": "是時，阿須倫白世尊曰：「如來法中使有一未曾有法者，勝彼海中八未曾有之法，",
        "translation": "At that time, the asuras said to the World-honored One: There is an extraordinary quality of the Tathāgata’s teaching that surpasses all the eight extraordinary qualities of the ocean.",
        "source": "T02n0125_037:0753b18_36"
    },
    {
        "source_sentence": "百倍、千倍不可為比，所謂賢聖八道是也。",
        "translation": "It's a hundredfold and a thousandfold incalculable, which are called the eight paths of goodness and nobleness.",
        "source": "T02n0125_037:0753b20_37"
    },
    {
        "source_sentence": "善哉，世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T02n0125_037:0753b21_38"
    },
    {
        "source_sentence": "快說斯言。」",
        "translation": "Quickly say these words.",
        "source": "T02n0125_037:0753b21_39"
    },
    {
        "source_sentence": "爾時，世尊暫與說法，所謂施論、戒論、生天之論，欲不淨想，漏為大患，",
        "translation": "At that time, the World-honored One briefly taught them the Dharma: “The doctrine of generosity, the doctrine of morality, the doctrine of rebirth in heaven, and the doctrine of desire are great dangers to sentient beings because they have impure conceptions of attachment.",
        "source": "T02n0125_037:0753b22_40"
    },
    {
        "source_sentence": "出要為妙。",
        "translation": "The essentials are marvelous.",
        "source": "T02n0125_037:0753b23_41"
    },
    {
        "source_sentence": "爾時，以見彼心開意解，諸佛世尊常所說法：苦、習、盡、道，盡與說之。",
        "translation": "At the time, because they saw their minds enlightened, the buddhas and world-honored ones always taught suffering, accumulation, cessation, and the path, explaining it to them in full.",
        "source": "T02n0125_037:0753b24_42"
    },
    {
        "source_sentence": "爾時，阿須倫便作是念：「應有五諦，今世尊但說四諦，與諸天說五諦。」",
        "translation": "At that point, the asuras then had this thought, There should be five truths, and now the Bhagavān only teaches the four truths and explains the five truths to the gods.",
        "source": "T02n0125_037:0753b25_43"
    },
    {
        "source_sentence": "是時，天子即於座上得法眼淨，阿須倫白世尊言：「善哉！",
        "translation": "The celestial being then attained purity of the Dharma eye while sitting on his seat, and the asuras said to the Bhagavān, Good!",
        "source": "T02n0125_037:0753b27_44"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T02n0125_037:0753b28_45"
    },
    {
        "source_sentence": "快說斯言，今欲還所在。」",
        "translation": "Quickly say these words, and now I'll return to my place.",
        "source": "T02n0125_037:0753b28_46"
    },
    {
        "source_sentence": "世尊告曰：「宜知是時。」",
        "translation": "The Bhagavān told him, It's a good idea to know this.",
        "source": "T02n0125_037:0753b29_47"
    },
    {
        "source_sentence": "即從座起，頭面禮足，復道而去。",
        "translation": "He rose from his seat, bowed his head and feet, and departed.",
        "source": "T02n0125_037:0753b29_48"
    },
    {
        "source_sentence": "時，天子語阿須倫曰：「汝今所念極為不善，云：『如來與諸天說五諦，",
        "translation": "The celestial being then said to the asuras: What you think now is most unwholesome. You say that the Tathāgata teaches the five truths to the gods,",
        "source": "T02n0125_037:0753c01_49"
    },
    {
        "source_sentence": "與我說四諦。』",
        "translation": "Teach me the four noble truths.'",
        "source": "T02n0125_037:0753c03_50"
    },
    {
        "source_sentence": "所以然者，諸佛世尊終無二言，諸佛終不捨眾生，說法亦無懈倦，說法亦復無盡，",
        "translation": "The buddhas ultimately do not abandon sentient beings. They teach the Dharma tirelessly, and they also teach the Dharma inexhaustibly.",
        "source": "T02n0125_037:0753c03_51"
    },
    {
        "source_sentence": "亦復不選擇人與說法，平等心而說法，有四諦，苦、習、盡、道。",
        "translation": "Nor does he discriminate between people who teach the Dharma and those who teach it, teaching with an impartial mind. There are four truths: suffering, accumulation, cessation, and the path.",
        "source": "T02n0125_037:0753c05_52"
    },
    {
        "source_sentence": "汝今莫作是念，而呰如來言有五諦。」",
        "translation": "Don't think like this now, for the Tathāgata says there are five noble truths.",
        "source": "T02n0125_037:0753c06_53"
    },
    {
        "source_sentence": "是時，阿須倫報曰：「我今所造不善，自當懺悔！",
        "translation": "The asuras then replied, What's unwholesome in what I've done now will be repented of!",
        "source": "T02n0125_037:0753c07_54"
    },
    {
        "source_sentence": "要當至如來所便問此義。」",
        "translation": "You must go to the Tathāgata and ask about this meaning.",
        "source": "T02n0125_037:0753c08_55"
    },
    {
        "source_sentence": "爾時，阿須倫及天子聞佛所說，歡喜奉行。",
        "translation": "At the time, the asuras and celestial beings who heard what the Buddha taught rejoiced and carried it out.",
        "source": "T02n0125_037:0753c09_56"
    },
    {
        "source_sentence": "（五）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(5) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_037:0753c11_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「天地大動有八因緣。",
        "translation": "It was then that the Bhagavān addressed the monks, There are eight reasons for the great earthquake in heaven and earth.",
        "source": "T02n0125_037:0753c12_1"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T02n0125_037:0753c13_2"
    },
    {
        "source_sentence": "比丘當知，此閻浮里地，南北二萬一千由旬，東西七千由旬，厚六萬八千由旬，",
        "translation": "Monks, you should know that this land of Jambudvīpa is twenty-one thousand yojanas from south to north and seven thousand yojanas from east to west with a thickness of sixty-eight thousand yojanas.",
        "source": "T02n0125_037:0753c13_3"
    },
    {
        "source_sentence": "水厚八萬四千由旬，火厚八萬四千由旬，火下有風厚六萬八千由旬，風下際有金剛輪，",
        "translation": "The water is eighty-four thousand yojanas thick, while the fire is eighty-four thousand yojanas thick. Beneath the fire there is a wind sixty-eight thousand yojanas thick, and below the wind there is a diamond wheel.",
        "source": "T02n0125_037:0753c15_4"
    },
    {
        "source_sentence": "過去諸佛世尊舍利盡在彼間。",
        "translation": "The relics of the buddhas and world-honored ones of the past are all there.",
        "source": "T02n0125_037:0753c17_5"
    },
    {
        "source_sentence": "比丘當知，或有是時，大風正動，火亦動；",
        "translation": "Monks, you should know that sometimes there is a time when the wind blows and the fire moves as well.",
        "source": "T02n0125_037:0753c17_6"
    },
    {
        "source_sentence": "火已動，水便動；",
        "translation": "As soon as the fire is extinguished, the water moves.",
        "source": "T02n0125_037:0753c18_7"
    },
    {
        "source_sentence": "水已動，地便動，是謂第一因緣使地大動。",
        "translation": "After the water has moved, the earth moves. This is the first condition that causes the earth to shake greatly.",
        "source": "T02n0125_037:0753c19_8"
    },
    {
        "source_sentence": "「復次，菩薩從兜術天降神來下，在母胎中，是時地亦大動，是謂第二因緣使地大動。",
        "translation": "“Furthermore, when the bodhisattva descends down from Tuṣita Heaven and is in his mother’s womb, the earth also shakes violently. This is the second causal condition that causes the earth to shake violently.",
        "source": "T02n0125_037:0753c20_9"
    },
    {
        "source_sentence": "「復次，菩薩降神出母胎時，天地大動，是謂第三因緣使地大動。",
        "translation": "“Furthermore, when the bodhisattva descends from his mother’s womb and emerges, heaven and earth shake greatly. This is the third cause by which the earth shakes greatly.",
        "source": "T02n0125_037:0753c22_10"
    },
    {
        "source_sentence": "「復次，菩薩出家學道，成無上正真等正覺，是時天地大動，是謂第四因緣使地大動。",
        "translation": "“Furthermore, when a bodhisattva leaves home to train in the path and becomes unsurpassed true and perfect enlightenment, heaven and earth shake greatly. This is the fourth causal condition that causes the earth to shake greatly.",
        "source": "T02n0125_037:0753c23_11"
    },
    {
        "source_sentence": "「復次，若如來入無餘涅槃界而取滅度，是時天地大動，是謂第五因緣使地大動。",
        "translation": "“Furthermore, if the Tathāgata enters the realm of nirvāṇa without remainder and attains cessation, then heaven and earth shake greatly. This is the fifth causal condition that causes the earth to shake greatly.",
        "source": "T02n0125_037:0753c25_12"
    },
    {
        "source_sentence": "「復次，有大神足比丘心得自在，隨意欲行無數變化，或分身為百千之數，",
        "translation": "“Furthermore, suppose there is a bhikṣu endowed with great supernormal powers who, having attained mastery of his mind, manifests innumerable transformations as he wishes, sometimes multiplying his body into several hundreds of thousands of bodies.",
        "source": "T02n0125_037:0753c27_13"
    },
    {
        "source_sentence": "復還為一，飛行虛空，石壁皆過，踊沒自由，觀地無地想，了悉空無，",
        "translation": "Again, it becomes one: flying through space, the stone walls all pass by, rising up and falling down freely. Observing that earth has no earth, he perceives emptiness as none.",
        "source": "T02n0125_037:0753c29_14"
    },
    {
        "source_sentence": "是時地為大動，是謂第六因緣地為大動。",
        "translation": "This is the sixth reason the earthquake occurs.",
        "source": "T02n0125_037:0754a01_15"
    },
    {
        "source_sentence": "「復次，諸天大神足，神德無量，從彼命終還生彼間，由宿福行，具足諸德，",
        "translation": "“Furthermore, the great supernormal powers of the gods have immeasurable spiritual qualities. At the end of their life, they return to be reborn elsewhere. Because of past meritorious deeds, they are endowed with all virtues.",
        "source": "T02n0125_037:0754a02_16"
    },
    {
        "source_sentence": "捨本天形，得作帝釋、若梵天王。",
        "translation": "If he renounces his original heavenly form, he'll be reborn as Indra or Brahmā.",
        "source": "T02n0125_037:0754a05_0"
    },
    {
        "source_sentence": "時地為大動，是謂第七因緣地為大動。",
        "translation": "The earth at that time is the seventh great tremor.",
        "source": "T02n0125_037:0754a05_1"
    },
    {
        "source_sentence": "「復次，若眾生命終福盡，是時諸國王不樂本邦，各各相攻伐，或飢儉死者，",
        "translation": "“Furthermore, if the blessings of sentient beings die at the end of their lives, then the kings of those kingdoms will not delight in their own countries. They may attack each other or starve to death.",
        "source": "T02n0125_037:0754a06_2"
    },
    {
        "source_sentence": "或刀刃死者，是時天地大動，是謂第八因緣使地大動。",
        "translation": "If someone dies with a sword or blade, then heaven and earth will shake. This is the eighth reason the earth shakes greatly.",
        "source": "T02n0125_037:0754a08_3"
    },
    {
        "source_sentence": "如是，比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_037:0754a09_4"
    },
    {
        "source_sentence": "有八因緣使天地大動。」",
        "translation": "There are eight causes and conditions that cause heaven and earth to shake greatly.",
        "source": "T02n0125_037:0754a09_5"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_037:0754a10_6"
    },
    {
        "source_sentence": "（六）聞如是：一時，尊者阿那律遊在四佛所居之處。",
        "translation": "(6) Thus I have heard: One time, Venerable Anuruddha was staying at the place where the four buddhas lived.",
        "source": "T02n0125_037:0754a12_0"
    },
    {
        "source_sentence": "是時，阿那律在閑靜之處，便作是念：「諸釋迦文佛弟子之中，戒德、智慧成就者皆依戒律，",
        "translation": "At that time, Aniruddha was in a secluded place and thought: Among the disciples of Śākyamuni Buddha, all those who have perfected moral virtue and wisdom rely on the precepts and disciplines.",
        "source": "T02n0125_037:0754a13_1"
    },
    {
        "source_sentence": "於此正法中而得長養；",
        "translation": "In this true teaching they attain nourishment.",
        "source": "T02n0125_037:0754a15_2"
    },
    {
        "source_sentence": "諸聲聞之中不具足戒律者，斯等之類皆離正法，不與戒律相應。",
        "translation": "Those among śrāvakas who don't possess the precepts and vinaya, these kinds of people are all free of the right teaching and aren't associated with the precepts and vinaya.",
        "source": "T02n0125_037:0754a15_3"
    },
    {
        "source_sentence": "如今此二法，戒與聞何者為勝？",
        "translation": "Now, of these two things, which is the superiority of morality and learning?",
        "source": "T02n0125_037:0754a17_4"
    },
    {
        "source_sentence": "我今可以此因緣之本，往問如來是事如何？」",
        "translation": "Now, can I ask the Tathāgata about this source of these causes and conditions?",
        "source": "T02n0125_037:0754a18_5"
    },
    {
        "source_sentence": "阿那律復作是念：「此法，知足者之所行，非無厭者之所行；",
        "translation": "Again, Anuruddha thought: This doctrine should be practiced by those who are content; it should not be practiced by the unwearying.",
        "source": "T02n0125_037:0754a19_6"
    },
    {
        "source_sentence": "少欲者之所行，非為多欲者之所行；",
        "translation": "They belong to those with few desires and not to those with many desires.",
        "source": "T02n0125_037:0754a20_7"
    },
    {
        "source_sentence": "此法，應閑居者之所行，非在憒閙之所行；",
        "translation": "This teaching should be practised by those who live in seclusion, not by the noisy and disturbed.",
        "source": "T02n0125_037:0754a21_8"
    },
    {
        "source_sentence": "此法，持戒人之所行，非犯戒者之所行；",
        "translation": "These things are practiced by those who keep the precepts; they are not practiced by anyone who breaks them.",
        "source": "T02n0125_037:0754a22_9"
    },
    {
        "source_sentence": "三昧者之所行，非亂者之所行；",
        "translation": "It is the course of action of those in samdhi and not the course of those in disarray.",
        "source": "T02n0125_037:0754a23_10"
    },
    {
        "source_sentence": "智慧者之所行，非愚者之所行；",
        "translation": "What the wise one does, not what the ignorant one does.",
        "source": "T02n0125_037:0754a24_0"
    },
    {
        "source_sentence": "多聞者之所行，非少聞者之所行。」",
        "translation": "It's practiced by those who are well-versed, not by those who are less well-versed.",
        "source": "T02n0125_037:0754a24_1"
    },
    {
        "source_sentence": "是時，阿那律思惟此八大人念：「今我可往至世尊所，而問此義。」",
        "translation": "Aniruddha then contemplated these eight great men and thought, Now, I can go to the Bhagavān and ask about this meaning.",
        "source": "T02n0125_037:0754a25_2"
    },
    {
        "source_sentence": "爾時，世尊在舍衛城祇樹給孤獨園。",
        "translation": "At the time, the Bhagavān was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_037:0754a26_3"
    },
    {
        "source_sentence": "是時，王波斯匿請如來及比丘僧，夏坐九十日。",
        "translation": "The king Prasenajit then invited the Tathāgata and the monks to spend the summer retreat for ninety days.",
        "source": "T02n0125_037:0754a27_4"
    },
    {
        "source_sentence": "是時，阿那律漸漸人間，將五百比丘遊化，轉至舍衛國，到如來所，頭面禮足，",
        "translation": "At that time Aniruddha gradually came to the native land and, accompanied by five hundred bhikṣus, proceeded to Sāvatthī. Having arrived at Sāvatthī, he approached the place where the Tathāgata was staying, bowed his forehead and forth with respect.",
        "source": "T02n0125_037:0754a28_5"
    },
    {
        "source_sentence": "在一面坐。",
        "translation": "He sat to one side.",
        "source": "T02n0125_037:0754b01_6"
    },
    {
        "source_sentence": "時，阿那律白世尊言：「我在閑靜之處，思惟此義：『戒與聞，此二法何者最勝乎？』」",
        "translation": "Aniruddha then said to the Bhagavān, I was in a quiet place and thought about this meaning, 'Which of these two things are the most superior, precepts and hearing?'",
        "source": "T02n0125_037:0754b01_7"
    },
    {
        "source_sentence": "「戒勝聞勝耶？　　汝今起狐疑。",
        "translation": "“Are the precepts superior and the teachings superior?",
        "source": "T02n0125_037:0754b03_8"
    },
    {
        "source_sentence": "　戒勝於聞者，　　於中何狐疑？",
        "translation": "The precepts are superior to those who hear, so why doubt them?",
        "source": "T02n0125_037:0754b03_8"
    },
    {
        "source_sentence": "是時，世尊與阿那律便說此偈：「所以然者，阿那律當知，若比丘戒成就者，",
        "translation": "At that time, the World-honored One spoke these verses to Anuruddha:",
        "source": "T02n0125_037:0754b03_8"
    },
    {
        "source_sentence": "便得定意；",
        "translation": "They will then attain concentration.",
        "source": "T02n0125_037:0754b08_0"
    },
    {
        "source_sentence": "已得定意，便獲智慧；",
        "translation": "Having attained concentration, they attain wisdom.",
        "source": "T02n0125_037:0754b08_1"
    },
    {
        "source_sentence": "已得智慧，便得多聞；",
        "translation": "Having attained wisdom, they become well learned.",
        "source": "T02n0125_037:0754b08_2"
    },
    {
        "source_sentence": "已得多聞，便得解脫；",
        "translation": "Having heard much, they attain liberation.",
        "source": "T02n0125_037:0754b09_3"
    },
    {
        "source_sentence": "已得解脫，於無餘涅槃而取滅度。",
        "translation": "Having attained liberation, they attain cessation without remainder in nirvāṇa.",
        "source": "T02n0125_037:0754b09_4"
    },
    {
        "source_sentence": "以此明之，戒為最勝。」",
        "translation": "Because of this explanation, the precepts are the most superior.",
        "source": "T02n0125_037:0754b10_5"
    },
    {
        "source_sentence": "是時，阿那律向世尊說此八大人念。",
        "translation": "Aniruddha then addressed the Bhagavān with these eight kinds of thoughts of greatness.",
        "source": "T02n0125_037:0754b11_6"
    },
    {
        "source_sentence": "佛告阿那律曰：「善哉！",
        "translation": "The Buddha told Aniruddha, Good!",
        "source": "T02n0125_037:0754b11_7"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T02n0125_037:0754b12_8"
    },
    {
        "source_sentence": "阿那律！",
        "translation": "Aniruddha!",
        "source": "T02n0125_037:0754b12_9"
    },
    {
        "source_sentence": "汝今所念者，正是大人之所思惟也。",
        "translation": "What you're thinking now is precisely what the great man thinks.",
        "source": "T02n0125_037:0754b12_10"
    },
    {
        "source_sentence": "少欲知足、在閑居之處、戒成就、三昧成就、智慧成就、解脫成就、多聞成就。",
        "translation": "They have few desires and are satisfied, live in a secluded place, perfect the precepts, perfect samādhi, perfect wisdom, perfect liberation, and perfect learning.",
        "source": "T02n0125_037:0754b13_11"
    },
    {
        "source_sentence": "汝今，阿那律！",
        "translation": "Now, Anuruddha!",
        "source": "T02n0125_037:0754b15_12"
    },
    {
        "source_sentence": "當建是意，思惟八大人念。",
        "translation": "You should establish this intention and contemplate the thoughts of the eight great men.",
        "source": "T02n0125_037:0754b15_13"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T02n0125_037:0754b16_14"
    },
    {
        "source_sentence": "此法精進者之所行，非懈怠者之所行。",
        "translation": "This teaching is practiced by those who make effort, not by lazy people.",
        "source": "T02n0125_037:0754b16_15"
    },
    {
        "source_sentence": "所以然者，彌勒菩薩應三十劫當成無上正真等正覺，我以精進之力超越成佛。",
        "translation": "The reason for this is that Maitreya Bodhisattva will attain unsurpassed true perfect enlightenment in 30 eons, and I'll transcend becoming a buddha by the power of my effort.",
        "source": "T02n0125_037:0754b17_16"
    },
    {
        "source_sentence": "「阿那律知之，諸佛世尊皆同一類，同其戒律、解脫、智慧而無有異，",
        "translation": "Aniruddha knows that the buddhas and world-honored ones are all one and the same in their morality, discipline, liberation, and wisdom, without any difference.",
        "source": "T02n0125_037:0754b19_17"
    },
    {
        "source_sentence": "亦復同空，無相、願，有三十二相、八十種好，而莊嚴其身，視無厭足，",
        "translation": "They are also like space, signless and wishless, with the thirty-two marks and eighty kinds of beauty. Yet they adorn their bodies, looking without weariness or dissatisfaction.",
        "source": "T02n0125_037:0754b20_18"
    },
    {
        "source_sentence": "無能見頂者，皆悉不異。",
        "translation": "There's no one who can see the top, and they're all not different.",
        "source": "T02n0125_037:0754b22_19"
    },
    {
        "source_sentence": "唯有精進不同，於過去當來諸佛世尊，精進者，吾最為勝。",
        "translation": "Only their energy is different, and I'm the best among all the buddhas and world-honored ones of the past and future.",
        "source": "T02n0125_037:0754b22_20"
    },
    {
        "source_sentence": "是故，阿那律！",
        "translation": "Therefore, Anuruddha!",
        "source": "T02n0125_037:0754b24_21"
    },
    {
        "source_sentence": "此第八大人之念，此為最為上，為尊為貴，為無有喻。",
        "translation": "This is the eighth great thought of a great person, which is the most superior, honored, noble, and without metaphors.",
        "source": "T02n0125_037:0754b24_22"
    },
    {
        "source_sentence": "猶如由乳有酪，由酪有酥，由酥有醍醐，然復醍醐於中最上，為無有比。",
        "translation": "It is just as when there is milk because of which there is curds, cream because of which there is butter, and clarified butter because of which there is evaporated butter. Yet the supreme quality of uncooked butter is incomparable.",
        "source": "T02n0125_037:0754b25_23"
    },
    {
        "source_sentence": "此亦如是，精進之念，於八大人念中最上，實無有比！",
        "translation": "Similarly, this is the supreme thought of energy among the eight kinds of thoughts of great persons, which really has no equal!",
        "source": "T02n0125_037:0754b27_24"
    },
    {
        "source_sentence": "「是故，阿那律！",
        "translation": "Therefore, Anuruddha!",
        "source": "T02n0125_037:0754b28_25"
    },
    {
        "source_sentence": "當奉八大人念，亦當與四部眾分別其義。",
        "translation": "You should pay homage to the eight great men's thoughts, and you should also discern their meaning with the four groups of people.",
        "source": "T02n0125_037:0754b29_26"
    },
    {
        "source_sentence": "設當八大人念流布在世者，令我弟子皆當成須陀洹道、斯陀含道、阿那含道、阿羅漢道。",
        "translation": "Suppose eight great men's thoughts are spread in the world, causing my disciples to attain the path of stream entry, the path of once-returning, the path of non-returning, and the path of arhatship.",
        "source": "T02n0125_037:0754c01_27"
    },
    {
        "source_sentence": "所以然者，我法，少欲者之所行，非多欲者所行也；",
        "translation": "The reason is that the self and dharmas are practiced by those with few desires, not by those with many desires.",
        "source": "T02n0125_037:0754c03_28"
    },
    {
        "source_sentence": "我法，知足者之所行，非無厭者之所行也；",
        "translation": "The doctrine of self is practiced by those who are content, not by those who are without weariness.",
        "source": "T02n0125_037:0754c04_29"
    },
    {
        "source_sentence": "我法，閑居者之所行，非眾中者之所行也；",
        "translation": "The self and dharmas are practiced by those who live in seclusion, not by the people of the assembly.",
        "source": "T02n0125_037:0754c05_30"
    },
    {
        "source_sentence": "我法，持戒者之所行，非犯戒者之所行也。",
        "translation": "The self and dharmas are practiced by someone who observes the precepts, not by someone who violates them.",
        "source": "T02n0125_037:0754c06_31"
    },
    {
        "source_sentence": "我法，定者之所行，非亂者所行也；",
        "translation": "The doctrine of self is practised by those in samdhi, not by those in disunity.",
        "source": "T02n0125_037:0754c07_32"
    },
    {
        "source_sentence": "我法，智者之所行，非愚者之所行也；",
        "translation": "The doctrine of self is practiced by the wise, not by the ignorant.",
        "source": "T02n0125_037:0754c08_33"
    },
    {
        "source_sentence": "我法，多聞者之所行，非少聞者所行也；",
        "translation": "The doctrine of self is practiced by those who are learned, not by those who are less learned.",
        "source": "T02n0125_037:0754c09_34"
    },
    {
        "source_sentence": "我法，精進者之所行，非懈怠者所行也。",
        "translation": "The self and dharmas are practiced by those who make effort, not by lazy people.",
        "source": "T02n0125_037:0754c10_35"
    },
    {
        "source_sentence": "是故，阿那律！",
        "translation": "Therefore, Anuruddha!",
        "source": "T02n0125_037:0754c11_36"
    },
    {
        "source_sentence": "四部之眾當求方便，行此八大人念。",
        "translation": "The four groups of people in the assembly should seek skillful means and practice these eight kinds of great thought.",
        "source": "T02n0125_037:0754c11_37"
    },
    {
        "source_sentence": "如是，阿那律！",
        "translation": "So it is, Anuruddha!",
        "source": "T02n0125_037:0754c12_38"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_037:0754c12_39"
    },
    {
        "source_sentence": "爾時，阿那律聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, Aniruddha was delighted and remembered it well.",
        "source": "T02n0125_037:0754c12_40"
    },
    {
        "source_sentence": "（七）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(7) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_037:0754c14_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「有八部之眾，汝等當知。",
        "translation": "It was then that the Bhagavān addressed the monks, There are eight groups of people, you should know.",
        "source": "T02n0125_037:0754c15_1"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T02n0125_037:0754c16_2"
    },
    {
        "source_sentence": "所謂剎利眾、婆羅門眾、長者眾、沙門眾、四天王眾、三十三天眾、魔眾、梵天眾。",
        "translation": "They are called the kṣatriyas, the brāhmaṇas, the elders, the ascetics, the śramaṇas, the four heavenly kings, the Trāyastriṃśa gods, the Māras, and the Brahma gods.",
        "source": "T02n0125_037:0754c16_3"
    },
    {
        "source_sentence": "比丘當知，我曩昔已來至剎利眾中，共相問訊，言談講論，亦復無人與我等者，",
        "translation": "O bhikṣus, you should know that since ancient times I have been among the kṣatriya monks. They exchanged greetings to each other and talked among themselves. There was no one else who could join us in discussion.",
        "source": "T02n0125_037:0754c18_4"
    },
    {
        "source_sentence": "獨步無侶，亦無儔匹；",
        "translation": "They walk alone without companions and have no opponents.",
        "source": "T02n0125_037:0754c20_5"
    },
    {
        "source_sentence": "少欲知足，念不錯亂，戒成就、三昧成就、智慧成就、解脫成就、多聞成就，",
        "translation": "Having few desires and being content with them, they are not disturbed by thought. They have perfected morality, concentration, wisdom, liberation, and learning.",
        "source": "T02n0125_037:0754c20_6"
    },
    {
        "source_sentence": "精進成就。",
        "translation": "It's the accomplishment of effort.",
        "source": "T02n0125_037:0754c22_7"
    },
    {
        "source_sentence": "「復自憶念，至婆羅門眾中、長者眾中、沙門眾中、四天王眾中、三十三天眾中、魔王眾中、梵天王眾中，",
        "translation": "“Furthermore, he recalls to himself: Among the assembly of brahmans, among the assembly of wealthy householders, among the assembly of śramaṇas, among the assembly of the four guardian gods of heaven, among the assembly of the thirty-three deities, among the assembly of Māra kings",
        "source": "T02n0125_037:0754c22_8"
    },
    {
        "source_sentence": "共相問訊，言談講論，獨步無侶，亦無儔匹，於中最尊，亦無等倫；",
        "translation": "They exchanged greetings and talked to each other. There were no companions, no brahmans, and no opponents among the solitary practitioners; they were the most venerable of all and had no peers.",
        "source": "T02n0125_037:0754c24_9"
    },
    {
        "source_sentence": "少欲知足，意不錯亂，戒成就、三昧成就，智慧成就、解脫成就、多聞成就、精進成就。",
        "translation": "They have few desires and are satisfied, their minds aren't disturbed, the accomplishment of precepts, the accomplishment of samādhi, the accomplishment of wisdom, the accomplishment of liberation, the accomplishment of much learning, and the accomplishment of effort.",
        "source": "T02n0125_037:0754c26_10"
    },
    {
        "source_sentence": "我當爾時，在八部眾中獨步無侶，與爾許眾生作大覆蓋。",
        "translation": "At the time, I was walking alone among the eight groups of people with no companions and made a great covering for all those sentient beings.",
        "source": "T02n0125_037:0754c28_11"
    },
    {
        "source_sentence": "是時，八部之眾無能見頂，亦不敢瞻顏，何況當共論議乎。",
        "translation": "At that time, the eightfold assembly of monks and nuns were unable to see the Buddha’s head. They did not even dare to look at his face; how much less would they dare to debate with him.",
        "source": "T02n0125_037:0754c29_12"
    },
    {
        "source_sentence": "所以然者，我亦不見天上、人中、魔、若魔天、沙門、婆羅門眾中，有能成就此八法者，",
        "translation": "For this reason, I do not see any among the gods, humans, Māras, gods, asuras, śramaṇas, or brāhmaṇas who can perfect these eight qualities.",
        "source": "T02n0125_037:0755a01_13"
    },
    {
        "source_sentence": "除如來存不論之。",
        "translation": "Except for the Tathāgata's existence, it doesn't matter.",
        "source": "T02n0125_037:0755a03_14"
    },
    {
        "source_sentence": "是故，比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_037:0755a04_15"
    },
    {
        "source_sentence": "當求方便，行此八法。",
        "translation": "You should seek skillful means to practice these eight things.",
        "source": "T02n0125_037:0755a04_16"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_037:0755a05_0"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_037:0755a05_1"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_037:0755a05_2"
    },
    {
        "source_sentence": "（八）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(8) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_037:0755a07_0"
    },
    {
        "source_sentence": "爾時，阿那邠邸長者往至世尊所，頭面禮足，在一面坐。",
        "translation": "At the time, the elder Anavatapta went to the Bhagavān, bowed his head and feet, and sat to one side.",
        "source": "T02n0125_037:0755a08_1"
    },
    {
        "source_sentence": "是時，世尊告長者曰：「長者家中廣施不乎？」",
        "translation": "The Bhagavān then addressed the elder, Does the elder's house give generously?",
        "source": "T02n0125_037:0755a09_2"
    },
    {
        "source_sentence": "長者白佛：「貧家惠施，晝夜不斷，四城門中，及大市中，家中行路，",
        "translation": "The wealthy man said to the Buddha, “The charity given by a poor family is unceasing day and night.",
        "source": "T02n0125_037:0755a10_3"
    },
    {
        "source_sentence": "及佛、比丘僧，是為八處惠施。",
        "translation": "These are the eight kinds of giving to buddhas, bhikṣus, and saṃgha.",
        "source": "T02n0125_037:0755a11_4"
    },
    {
        "source_sentence": "如是，世尊！",
        "translation": "So it is, Bhagavān!",
        "source": "T02n0125_037:0755a12_5"
    },
    {
        "source_sentence": "其有所須，須衣惠衣，須食與食，國中珍寶終不違逆，衣被、飲食、床臥具、病瘦醫藥，",
        "translation": "Whatever he needed, he asked for clothing, food, drink, bedding, and medicine for his illness.",
        "source": "T02n0125_037:0755a12_6"
    },
    {
        "source_sentence": "悉給施之。",
        "translation": "He gave them all to him.",
        "source": "T02n0125_037:0755a14_7"
    },
    {
        "source_sentence": "亦有諸天來至我所，在虛空中而告我曰：『分別尊卑，此者持戒，此者犯戒，",
        "translation": "Also, some heavenly beings came to me and said to me in the sky, “This is observing the precepts. This is breaking the precepts.",
        "source": "T02n0125_037:0755a14_8"
    },
    {
        "source_sentence": "與此獲福，與彼無報。』",
        "translation": "They'll obtain merit with this, and they'll have no reward with that.'",
        "source": "T02n0125_037:0755a16_9"
    },
    {
        "source_sentence": "然我心正無有彼此，不起增減之心，普等慈心於一切眾生。",
        "translation": "However, my mind is correct and there's no mutuality, and I don't give rise to an increasing or diminishing mind, with a mind of universal compassion for all sentient beings.",
        "source": "T02n0125_037:0755a17_10"
    },
    {
        "source_sentence": "有其眾生依命根存形，有食則存，非食命不濟。",
        "translation": "If there are sentient beings who rely on the vital faculty to preserve form and have food, then they'll preserve it, but life won't help them if they don't.",
        "source": "T02n0125_037:0755a18_11"
    },
    {
        "source_sentence": "施惠一切眾生，其報無量，受其果報，無有增減。」",
        "translation": "Giving to all sentient beings has measureless rewards, and there's no increase or decrease in the rewards they experience.",
        "source": "T02n0125_037:0755a19_12"
    },
    {
        "source_sentence": "佛告長者：「善哉，善哉！",
        "translation": "The Buddha told the elder, Good, good!",
        "source": "T02n0125_037:0755a20_13"
    },
    {
        "source_sentence": "長者！",
        "translation": "Elder!",
        "source": "T02n0125_037:0755a21_14"
    },
    {
        "source_sentence": "平等施者福第一尊。",
        "translation": "Equanimous giving is the first honored in terms of merit.",
        "source": "T02n0125_037:0755a21_15"
    },
    {
        "source_sentence": "然眾生之心復有勝，如施持戒人勝犯戒者。」",
        "translation": "Still, there's another superiority in the mind of sentient beings, such as giving to someone who upholds the precepts over someone who violates them.",
        "source": "T02n0125_037:0755a22_16"
    },
    {
        "source_sentence": "「佛說擇施尊，　　愚眾有增減，",
        "translation": "The Buddha said, selecting the honored one who bestows, There is increase and decrease in the number of ignorant beings.",
        "source": "T02n0125_037:0755a23_17"
    },
    {
        "source_sentence": "　求其良福田，　　何過如來眾。",
        "translation": "Seeking this good field of merit is no better than the Tathāgata's congregation.",
        "source": "T02n0125_037:0755a23_17"
    },
    {
        "source_sentence": "是時，虛空神、天，稱慶無量，即時而說此偈：「然今世尊所說極為快哉，",
        "translation": "The gods and goddesses of space then praised the Buddha Immeasurable, immediately uttered these verses: O Bhagavat! What you have taught is most wonderful.",
        "source": "T02n0125_037:0755a23_17"
    },
    {
        "source_sentence": "施持戒人，勝犯戒者。」",
        "translation": "Giving to someone who upholds the precepts is superior to someone who violates them.",
        "source": "T02n0125_037:0755a27_18"
    },
    {
        "source_sentence": "爾時，世尊告阿那邠邸長者：「今當與汝說賢聖之眾，善思念之，抱在心懷。",
        "translation": "At the time, the Bhagavān addressed the elder Anavatapta, Now, I will tell you about the wise and noble people, who are well thought of and embraced in their hearts.",
        "source": "T02n0125_037:0755a28_19"
    },
    {
        "source_sentence": "或施少獲福多，或施多獲福多。」",
        "translation": "Some give little to obtain much merit, and some give much to obtain much merit.",
        "source": "T02n0125_037:0755a29_20"
    },
    {
        "source_sentence": "阿那邠邸長者白佛言：「唯願世尊敷演其義！",
        "translation": "The elder of Anavatapta said to the Buddha, Please, Bhagavān, explain its meaning!",
        "source": "T02n0125_037:0755b01_21"
    },
    {
        "source_sentence": "云何施少獲福多？",
        "translation": "How is it that giving with little merit obtains much merit?",
        "source": "T02n0125_037:0755b02_22"
    },
    {
        "source_sentence": "云何施多獲福多？」",
        "translation": "How does generosity obtain much merit?",
        "source": "T02n0125_037:0755b03_23"
    },
    {
        "source_sentence": "佛告長者：「向阿羅漢、得阿羅漢、向阿那含、得阿那含、向斯陀含、得斯陀含、向須陀洹、得須陀洹。",
        "translation": "The Buddha told the elder, Go to the arhat, attain arhatship, go to non-returner, attain non-returner, go to once-returner, attain once-returner, go to stream-enterer, and attain stream-entry.",
        "source": "T02n0125_037:0755b03_24"
    },
    {
        "source_sentence": "是謂，長者！",
        "translation": "This is called that, householder!",
        "source": "T02n0125_037:0755b05_25"
    },
    {
        "source_sentence": "賢聖之眾，施少獲福多，施多獲福多。」",
        "translation": "Good men and noble people who give little get much merit, and those who give much get much merit.",
        "source": "T02n0125_037:0755b05_26"
    },
    {
        "source_sentence": "「四向成就人，　　四者成果實，",
        "translation": "“Those who have accomplished the four dedications, And those who are endowed with the fruit of realization.",
        "source": "T02n0125_037:0755b06_27"
    },
    {
        "source_sentence": "　此名賢聖眾，　　惠施獲福廣。",
        "translation": "These are called the wise and saintly assemblies, who give generously and attain vast merit.",
        "source": "T02n0125_037:0755b06_27"
    },
    {
        "source_sentence": "爾時，世尊便說此偈：「過去久遠諸佛世尊，亦復有此賢聖之眾，如我今日無異；",
        "translation": "It was then that the World-honored One uttered these verses: Once long ago, many buddhas and world-honored ones also had this assembly of wise and saintly bhikṣus, just as I have today.",
        "source": "T02n0125_037:0755b06_27"
    },
    {
        "source_sentence": "正使當來諸佛世尊出現於世者，亦得如此賢聖之眾。",
        "translation": "It's precisely because those future buddhas and world-honored ones who appear in the world will also attain such a multitude of good men and noble people.",
        "source": "T02n0125_037:0755b11_28"
    },
    {
        "source_sentence": "是故，長者！",
        "translation": "That's why, householder!",
        "source": "T02n0125_037:0755b12_29"
    },
    {
        "source_sentence": "歡喜悅心，供養聖眾。」",
        "translation": "They rejoice and delight in their hearts, offering support to the noble ones.",
        "source": "T02n0125_037:0755b12_30"
    },
    {
        "source_sentence": "是時，世尊與彼長者說微妙法，立不退轉之地。",
        "translation": "The Bhagavān then explained the subtle teaching to that elder, establishing a ground of nonretrogression.",
        "source": "T02n0125_037:0755b13_31"
    },
    {
        "source_sentence": "長者聞法已，喜慶無量，即從坐起，頭面禮足，繞佛三匝，便退而去。",
        "translation": "Having heard the Dharma, the householder was greatly delighted. He rose from his seat, bowed his forehead and feet, circumambulated the Buddha three times, withdrew, and departed.",
        "source": "T02n0125_037:0755b14_32"
    },
    {
        "source_sentence": "是時，阿那邠邸長者聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the householder Anavatapta was delighted and remembered it well.",
        "source": "T02n0125_037:0755b16_33"
    },
    {
        "source_sentence": "（九）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(9) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_037:0755b18_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「若善男子、善女人，以財物惠施，獲八功德。",
        "translation": "It was then that the Bhagavān addressed the monks, If good men and good women were to give their possessions as alms, they'd attain eight merits.",
        "source": "T02n0125_037:0755b19_1"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T02n0125_037:0755b20_2"
    },
    {
        "source_sentence": "一者隨時惠施，非為非時；",
        "translation": "The first is that they give at the right time, not at the wrong time.",
        "source": "T02n0125_037:0755b20_3"
    },
    {
        "source_sentence": "二者鮮潔惠施，非為穢濁；",
        "translation": "The second is generosity pure and genuine, not defiled.",
        "source": "T02n0125_037:0755b21_4"
    },
    {
        "source_sentence": "三者手自斟酌，不使他人；",
        "translation": "The third is to offer food and drink with one’s own hands without inviting others.",
        "source": "T02n0125_037:0755b22_5"
    },
    {
        "source_sentence": "四者誓願惠施，無憍恣心；",
        "translation": "The fourth is that they vow to give generously, without covetousness or complacency.",
        "source": "T02n0125_037:0755b22_6"
    },
    {
        "source_sentence": "五者解脫惠施，不望其報；",
        "translation": "The fifth is the generous giving of liberation, not expecting rewards.",
        "source": "T02n0125_037:0755b23_7"
    },
    {
        "source_sentence": "六者惠施求滅，不求生天；",
        "translation": "The sixth is to give aid in seeking cessation and not in seeking rebirth in heaven.",
        "source": "T02n0125_037:0755b24_0"
    },
    {
        "source_sentence": "七者施求良田，不施荒地；",
        "translation": "The seventh is generosity seeking good fields and not giving to desolate land.",
        "source": "T02n0125_037:0755b24_1"
    },
    {
        "source_sentence": "八者然持此功德，惠施眾生，不自為己。",
        "translation": "Eight, he maintains this merit and bestows it on sentient beings without doing so for himself.",
        "source": "T02n0125_037:0755b25_2"
    },
    {
        "source_sentence": "如是，比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_037:0755b26_3"
    },
    {
        "source_sentence": "善男子、善女人，以財物惠施，獲八功德。」",
        "translation": "Good men and good women give their possessions as gifts to obtain the eight virtues.",
        "source": "T02n0125_037:0755b26_4"
    },
    {
        "source_sentence": "「智者隨時施，　　無有慳貪心，",
        "translation": "A wise person gives at any time, without stinginess or greed.",
        "source": "T02n0125_037:0755b27_5"
    },
    {
        "source_sentence": "　所作功德已，　　盡用惠施人。",
        "translation": "After the merit of what they've done, they give it to someone with all kindness.",
        "source": "T02n0125_037:0755b27_5"
    },
    {
        "source_sentence": "　此施為最勝，　　諸佛所加歎，",
        "translation": "This giving is the most superior, Praised by the Buddhas.",
        "source": "T02n0125_037:0755b27_5"
    },
    {
        "source_sentence": "　現身受其果，　　逝則受天福。",
        "translation": "The present body receives its fruit, and the deceased receives heavenly merit.",
        "source": "T02n0125_037:0755b27_5"
    },
    {
        "source_sentence": "爾時，世尊便說斯偈：「是故，比丘！",
        "translation": "It was then that the Bhagavān spoke this verse, That's why, monk!",
        "source": "T02n0125_037:0755b27_5"
    },
    {
        "source_sentence": "欲求其果報者，當行此八事。",
        "translation": "Those who want to seek their reward should perform these eight things.",
        "source": "T02n0125_037:0755c04_6"
    },
    {
        "source_sentence": "其報無量，不可勝計，獲甘露之寶，漸至滅度。",
        "translation": "The rewards were immeasurable and incalculable. They obtained the jewel of ambrosia and gradually entered nirvana.",
        "source": "T02n0125_037:0755c04_7"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_037:0755c06_8"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_037:0755c06_9"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_037:0755c06_10"
    },
    {
        "source_sentence": "（一〇）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(10) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_037:0755c08_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「我今當說趣泥犁之路，向涅槃之道，善思念之，",
        "translation": "At that time the World-honored One said to the monks: I shall now tell you how to proceed on the path leading to nirvana and the path leading to nirvana.",
        "source": "T02n0125_037:0755c09_1"
    },
    {
        "source_sentence": "無令漏失。」",
        "translation": "They won't let the contaminants go.",
        "source": "T02n0125_037:0755c10_2"
    },
    {
        "source_sentence": "諸比丘白佛言：「如是。",
        "translation": "The monks said to the Buddha, So it is.",
        "source": "T02n0125_037:0755c11_0"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T02n0125_037:0755c11_1"
    },
    {
        "source_sentence": "諸比丘從佛受教。",
        "translation": "The monks received the teaching from the Buddha.",
        "source": "T02n0125_037:0755c11_2"
    },
    {
        "source_sentence": "佛告比丘：「彼云何趣泥犁之路，向涅槃之道？",
        "translation": "The Buddha told the monks, How does he go down the path of the mud plow and the path to nirvāṇa?",
        "source": "T02n0125_037:0755c12_3"
    },
    {
        "source_sentence": "邪見趣泥犁路，正見向涅槃之道；",
        "translation": "A wrong view leads to the path of nirvana, while a right view is the path leading to nirvana.",
        "source": "T02n0125_037:0755c13_4"
    },
    {
        "source_sentence": "邪治趣泥犁之路，正治向涅槃之道；",
        "translation": "The wrong path is the path leading to nirvana, while the right path is the path leading to nirvana.",
        "source": "T02n0125_037:0755c14_5"
    },
    {
        "source_sentence": "邪語趣泥犁之路，正語向涅槃之道；",
        "translation": "Wrong speech is the path leading to nirvana, right speech the path leading to nirvana.",
        "source": "T02n0125_037:0755c15_6"
    },
    {
        "source_sentence": "邪業趣泥犁之路，正業向涅槃之道；",
        "translation": "False action proceeds to the path of nirvana; right action proceeds to the path of nirvana.",
        "source": "T02n0125_037:0755c16_7"
    },
    {
        "source_sentence": "邪命趣泥犁之路，正命向涅槃之道；",
        "translation": "A wrong livelihood leads to the path of nirvana, while right livelihood leads to the path of nirvana.",
        "source": "T02n0125_037:0755c17_0"
    },
    {
        "source_sentence": "邪方便趣泥犁之路；",
        "translation": "They follow the wrong path of skillful means and proceed on the road to niraya.",
        "source": "T02n0125_037:0755c17_1"
    },
    {
        "source_sentence": "正方便向涅槃之道；",
        "translation": "The path of right effort leading to nirvana;",
        "source": "T02n0125_037:0755c18_2"
    },
    {
        "source_sentence": "邪念趣泥犁之路，正念向涅槃之道；",
        "translation": "They think wrongly of the path leading to nirvana and right thought of the path leading to nirvana.",
        "source": "T02n0125_037:0755c19_0"
    },
    {
        "source_sentence": "邪定趣泥犁之路，正定向涅槃之道。",
        "translation": "Wrong concentration is the path to nirvāṇa, and right concentration is the path to nirvāṇa.",
        "source": "T02n0125_037:0755c19_1"
    },
    {
        "source_sentence": "是謂，比丘！",
        "translation": "This is called that, monk!",
        "source": "T02n0125_037:0755c20_2"
    },
    {
        "source_sentence": "趣泥犁之路，向涅槃之道。",
        "translation": "They are on the path of nirvana and the path leading to nirvana.",
        "source": "T02n0125_037:0755c21_3"
    },
    {
        "source_sentence": "諸佛世尊常所應說法，今已果矣！",
        "translation": "The buddhas and world-honored ones always taught the Dharma that should be taught, but now it's been done!",
        "source": "T02n0125_037:0755c21_4"
    },
    {
        "source_sentence": "汝等樂在閑居處，樹下露坐，念行善法，無起懈慢。",
        "translation": "All of you, please take delight in living in a secluded place. Sitting out in the open air under trees, be mindful of your good deeds and practice them without laziness or conceit.",
        "source": "T02n0125_037:0755c22_5"
    },
    {
        "source_sentence": "今不勤行，後悔無及。」",
        "translation": "Now, if you don't diligently practice it, there's nothing to regret.",
        "source": "T02n0125_037:0755c23_6"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_037:0755c24_7"
    },
    {
        "source_sentence": "　非時、泥犁、道　　須倫天、地動",
        "translation": "When it is not the right time, when it is neither the niraya nor the path, the earth moves in the lord gods and goddesses.",
        "source": "T02n0125_037:0755c26_0"
    },
    {
        "source_sentence": "　大人八念、眾　　善男子施、道",
        "translation": "Great men, the eight kinds of mindfulness, the congregation, good sons, generosity and enlightenment",
        "source": "T02n0125_037:0755c27_0"
    },
    {
        "source_sentence": "增壹阿含經卷第三十七",
        "translation": "Zengyi ahan jing, vol. 37",
        "source": "T02n0125_037:0755c28_0"
    }
]