[
    {
        "source_sentence": "增壹阿含經卷第十一",
        "translation": "Increased by one ahan jing, vol. 11",
        "source": "T02n0125_011:0596c18_0"
    },
    {
        "source_sentence": "東晉罽賓三藏瞿曇僧伽提婆譯",
        "translation": "Translated by Gautama Saṃghadeva of the Tripiṭaka of Kāśmīra in the Eastern Jin Dynasty",
        "source": "T02n0125_011:0596c20_0"
    },
    {
        "source_sentence": "善知識品第二十",
        "translation": "Chapter 20 of the Good Teachers",
        "source": "T02n0125_011:0596c21_0"
    },
    {
        "source_sentence": "（一）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(1) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0596c22_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「當親近善知識，莫習惡行，信於惡業。",
        "translation": "At the time, the Bhagavān addressed the monks, You must become intimate with good friends and not engage in bad actions or believe in bad actions.",
        "source": "T02n0125_011:0596c23_1"
    },
    {
        "source_sentence": "所以然者，諸比丘！",
        "translation": "That's why, monks!",
        "source": "T02n0125_011:0596c24_2"
    },
    {
        "source_sentence": "親近善知識已，信便增益，聞、施、智慧普悉增益。",
        "translation": "Being close to a good teacher, faith increases, and hearing, generosity, and wisdom all increase.",
        "source": "T02n0125_011:0596c24_3"
    },
    {
        "source_sentence": "若比丘親近善知識，莫習惡行。",
        "translation": "If a monk becomes intimate with good friends, don't practice bad actions.",
        "source": "T02n0125_011:0596c26_0"
    },
    {
        "source_sentence": "所以然者，若近惡知識，便無信、戒、聞、施、智慧。",
        "translation": "The reason is that if someone approaches bad friends, they'll lack faith, precepts, hearing, generosity, and wisdom.",
        "source": "T02n0125_011:0596c26_1"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0596c27_2"
    },
    {
        "source_sentence": "當親近善知識，莫近惡知識。",
        "translation": "You should become intimate with good friends and not with bad friends.",
        "source": "T02n0125_011:0596c28_3"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0596c28_4"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0596c29_5"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0596c29_6"
    },
    {
        "source_sentence": "（二）聞如是：一時，佛在羅閱城迦羅陀竹園所，與大比丘五百人俱。",
        "translation": "(2) Thus I heard: One time, the Buddha was staying at the Kalāda Bamboo Park in Rājagṛha, accompanied by five hundred great monks.",
        "source": "T02n0125_011:0597a02_0"
    },
    {
        "source_sentence": "前後圍遶而為說法。",
        "translation": "He was surrounded by them before and after, teaching the Dharma for them.",
        "source": "T02n0125_011:0597a03_1"
    },
    {
        "source_sentence": "爾時，提婆達兜將五百比丘去如來不遠而逕過。",
        "translation": "At the time, Devadatta took five hundred monks to the Tathāgata's place not far from him and passed by him.",
        "source": "T02n0125_011:0597a04_2"
    },
    {
        "source_sentence": "「莫親惡知識，　　亦莫愚從事；",
        "translation": "Don’t associate with bad friends, And don’t act foolishly.",
        "source": "T02n0125_011:0597a05_3"
    },
    {
        "source_sentence": "　當近善知識，　　人中最勝者。",
        "translation": "You should approach a good teacher, the best among men.",
        "source": "T02n0125_011:0597a05_3"
    },
    {
        "source_sentence": "　人本無有惡，　　習近惡知識，",
        "translation": "A human being is inherently free of evil, and he becomes accustomed to bad friends.",
        "source": "T02n0125_011:0597a05_3"
    },
    {
        "source_sentence": "　後必種惡根，　　永在闇冥中。」",
        "translation": "They'll surely plant bad roots later, and they'll always be in darkness.",
        "source": "T02n0125_011:0597a05_3"
    },
    {
        "source_sentence": "世尊遙見提婆達兜自將門徒，便說此偈：是時，提婆達兜五百弟子聞世尊說此偈已，",
        "translation": "Seeing Devadatta from a distance, the World-honored One said these verses to his disciples: When the five hundred disciples of Devadatta heard these verses uttered by the World-honored One,",
        "source": "T02n0125_011:0597a05_3"
    },
    {
        "source_sentence": "便來至世尊所，頭面禮足，在一面坐。",
        "translation": "He came to the place where the World-honored One was. After bowing his forehead at his feet, he sat to one side.",
        "source": "T02n0125_011:0597a12_0"
    },
    {
        "source_sentence": "斯須退坐，向世尊悔過：「我等愚惑，無所識知，唯願世尊受我等懺悔。」",
        "translation": "They must retreat from their seats and repent to the Bhagavān, saying, We're foolish and have no consciousness; we only wish that the Bhagavān would accept our repentance.",
        "source": "T02n0125_011:0597a12_1"
    },
    {
        "source_sentence": "爾時，世尊受彼五百比丘懺悔，便與說法，令得信根。",
        "translation": "At the time, the Bhagavān accepted the repentance of those five hundred monks and taught them the Dharma so that they would attain the faculty of faith.",
        "source": "T02n0125_011:0597a14_2"
    },
    {
        "source_sentence": "爾時，五百比丘在閑靜之處思惟深法。",
        "translation": "At the time, five hundred monks were in a secluded place contemplating the profound Dharma.",
        "source": "T02n0125_011:0597a15_3"
    },
    {
        "source_sentence": "所以然者，族姓子出家學道，以信堅固，修無上梵行。",
        "translation": "The reason for this is that clansmen leave home and study the path, cultivating the unsurpassed religious practice because of their firm faith.",
        "source": "T02n0125_011:0597a16_4"
    },
    {
        "source_sentence": "爾時，彼五百比丘便成阿羅漢：生死已盡，所作已辦，梵行已立，更不復受胎有，",
        "translation": "At that time, those five hundred bhikṣus had become arhats. Having exhausted birth and death, having accomplished what should be done, and thus established in the practice of austerity, they were no longer subject to existence in the mother’s womb.",
        "source": "T02n0125_011:0597a18_0"
    },
    {
        "source_sentence": "如實知之。",
        "translation": "Know them as they really are.",
        "source": "T02n0125_011:0597a19_1"
    },
    {
        "source_sentence": "爾時，五百人成阿羅漢。",
        "translation": "At the time, five hundred people became arhats.",
        "source": "T02n0125_011:0597a20_2"
    },
    {
        "source_sentence": "諸比丘聞佛所說，歡喜奉行。",
        "translation": "Having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well. ****** 13. The Scripture on the Explication of Underlying Meaning:",
        "source": "T02n0125_011:0597a20_3"
    },
    {
        "source_sentence": "（三）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(3) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0597a22_0"
    },
    {
        "source_sentence": "爾時，世尊與無央數之眾圍遶說法。",
        "translation": "At the time, the Bhagavān was surrounded by an incalculable number of people who taught the Dharma.",
        "source": "T02n0125_011:0597a23_1"
    },
    {
        "source_sentence": "是時，曇摩留支在靜室中，獨自思惟，入禪三昧，觀見前身在大海中作魚，",
        "translation": "Dharmaruci then remained in his secluded room to meditate alone. He entered meditative absorption and observed that his former body was fishing in the great ocean.",
        "source": "T02n0125_011:0597a23_2"
    },
    {
        "source_sentence": "身長七百由旬。",
        "translation": "His body was seven hundred yojanas in height.",
        "source": "T02n0125_011:0597a25_3"
    },
    {
        "source_sentence": "即從靜室起，猶如力士屈申臂頃，便往至大海中故死屍上而經行。",
        "translation": "He rose from his secluded room, just as a strong man does when he bends and stretches out his arm, and then went into the great ocean to walk on top of an old corpse.",
        "source": "T02n0125_011:0597a26_4"
    },
    {
        "source_sentence": "「生死無數劫，　　流轉不可計；",
        "translation": "Birth and death are countless eons; Their transmigration is incalculable.",
        "source": "T02n0125_011:0597a27_5"
    },
    {
        "source_sentence": "　各各求所安，　　數數受苦惱。",
        "translation": "Each of them sought to be settled, and they'll experience pain and suffering repeatedly.",
        "source": "T02n0125_011:0597a27_5"
    },
    {
        "source_sentence": "　設復見身已，　　意欲造舍宅；",
        "translation": "Suppose he also sees the body and wants to build a dwelling place in his mind.",
        "source": "T02n0125_011:0597a27_5"
    },
    {
        "source_sentence": "　一切支節壞，　　形體不得全。",
        "translation": "All the limbs will disintegrate, And their forms and bodies won’t be complete.",
        "source": "T02n0125_011:0597a27_5"
    },
    {
        "source_sentence": "　心已離諸行，　　愛著永無餘；",
        "translation": "Their minds are already free of conditioned phenomena, And their cravings and attachments never remain.",
        "source": "T02n0125_011:0597a27_5"
    },
    {
        "source_sentence": "　更不受此形，　　長樂涅槃中。」",
        "translation": "They won't accept this form again, and they'll long enjoy nirvāṇa.",
        "source": "T02n0125_011:0597a27_5"
    },
    {
        "source_sentence": "爾時，曇摩留支便說此偈：爾時，尊者曇摩留支說此偈已，即從彼沒，",
        "translation": "It was then that Dharmaruci spoke these verses: At that time, having uttered these verses, the venerable Dharmaruci disappeared from that place.",
        "source": "T02n0125_011:0597a27_5"
    },
    {
        "source_sentence": "來至舍衛祇洹精舍，往至世尊所。",
        "translation": "They came to the monastery of Śrāvastī and went to the Bhagavān.",
        "source": "T02n0125_011:0597b07_0"
    },
    {
        "source_sentence": "爾時，世尊見曇摩留支來，作是告曰：「善哉！",
        "translation": "At the time, the Bhagavān saw Dharmaruci coming and told him this, Good!",
        "source": "T02n0125_011:0597b07_1"
    },
    {
        "source_sentence": "曇摩留支！",
        "translation": "Dharmaruci!",
        "source": "T02n0125_011:0597b08_2"
    },
    {
        "source_sentence": "久來此間。」",
        "translation": "I've been here for a long time.",
        "source": "T02n0125_011:0597b09_3"
    },
    {
        "source_sentence": "曇摩留支白世尊曰：「如是。",
        "translation": "Dharmaruci said to the Bhagavān, So it is.",
        "source": "T02n0125_011:0597b09_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T02n0125_011:0597b09_5"
    },
    {
        "source_sentence": "久來此間。」",
        "translation": "I've been here for a long time.",
        "source": "T02n0125_011:0597b10_6"
    },
    {
        "source_sentence": "爾時，上坐及諸比丘各生斯念：「此曇摩留支恒在世尊左右，然今世尊告曰：『善哉！",
        "translation": "At that point, the superior seat and the monks each had this thought, This Dharmaruci always stood at the Bhagavān's side, but now the Bhagavān has told them, 'Good!",
        "source": "T02n0125_011:0597b10_7"
    },
    {
        "source_sentence": "曇摩留支！",
        "translation": "Dharmaruci!",
        "source": "T02n0125_011:0597b12_8"
    },
    {
        "source_sentence": "久來此間。』」",
        "translation": "I've been here for a long time.'",
        "source": "T02n0125_011:0597b12_9"
    },
    {
        "source_sentence": "爾時，世尊知諸比丘心中所念，欲斷狐疑故，便告諸比丘：「非為曇摩留支久來此間，",
        "translation": "Knowing what the monks thought, the World-honored One wished to dispel their doubts and therefore said to the monks: It is not because Dharmaruci has come here for a long time.",
        "source": "T02n0125_011:0597b12_10"
    },
    {
        "source_sentence": "故我言此義。",
        "translation": "That's why I say this meaning.",
        "source": "T02n0125_011:0597b14_11"
    },
    {
        "source_sentence": "所以然者，昔者過去無數劫時，有定光如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "In the past, innumerable kalpas ago, there was a buddha named Dīpaṅkara, the Tathāgata of Concentration, Arhat, Completely Enlightened One. He perfected his knowledge and conduct, became a Well-gone One, Knower of the World, Unsurpassed One, Tamer of the Dharma of the Way, Teacher of gods and",
        "source": "T02n0125_011:0597b15_0"
    },
    {
        "source_sentence": "為佛、眾祐，出現於世，治在鉢摩大國，與大比丘眾十四萬八千人俱。",
        "translation": "He appeared in the world for the sake of the buddhas and the blessed ones, governing the great kingdom of Padma, accompanied by a large congregation of 140,000 bhikṣus.",
        "source": "T02n0125_011:0597b17_1"
    },
    {
        "source_sentence": "爾時，四部之眾不可稱計，國王、臣吏、人民之類，皆來供養給其所須。",
        "translation": "At that time, the fourfold assembly of monks and nuns could not be counted. All the kings, ministers, officials, and other members of the common people came to make offerings to those who needed them.",
        "source": "T02n0125_011:0597b18_2"
    },
    {
        "source_sentence": "「爾時，有梵志名耶若達，在雪山側住，看諸祕讖，天文、地理靡不貫博，",
        "translation": "At the time, there was a priest named Yajñadatta who lived on the side of the Himalayas and looked into all the esoteric theories as well as astronomy and geography.",
        "source": "T02n0125_011:0597b20_3"
    },
    {
        "source_sentence": "書疏文字亦悉了知，諷誦一句五百言大人之相亦復了知，事諸火神、日月、星宿，",
        "translation": "The characteristics of the writing and commentaries are also fully discerned. The marks of a great person recited in one line or five hundred syllables are also discerned. They serve the fire gods, the sun, moon, and star constellations.",
        "source": "T02n0125_011:0597b22_4"
    },
    {
        "source_sentence": "教五百弟子宿夜不惓。",
        "translation": "He taught the five hundred disciples not to sleep during the night.",
        "source": "T02n0125_011:0597b23_5"
    },
    {
        "source_sentence": "耶若達梵志有弟子名曰雲雷，顏貌端政，世之希有，髮紺青色。",
        "translation": "The brahmin Yaoduo had a disciple named Yun Lei, who was rare in the world with a graceful appearance of deep blue color.",
        "source": "T02n0125_011:0597b24_6"
    },
    {
        "source_sentence": "雲雷梵志聰明博見，靡事不通，恒為耶若達所見愛敬，不去須臾。",
        "translation": "The brahmin Yunle was a wise and erudite man who could not understand all things. He always liked to be seen by Yajnanda and did not leave him for even a single moment.",
        "source": "T02n0125_011:0597b26_0"
    },
    {
        "source_sentence": "是時，婆羅門所行呪術，盡皆備舉。",
        "translation": "At the time, all the spells performed by the Brāhmaṇa were listed in full.",
        "source": "T02n0125_011:0597b27_1"
    },
    {
        "source_sentence": "「爾時，雲雷梵志便作是念：『我今所應學者悉皆備已。』",
        "translation": "At that point, the priest Yunle then had this thought, 'All the scholars I should now have are fully prepared.'",
        "source": "T02n0125_011:0597b28_2"
    },
    {
        "source_sentence": "然復自念：『書籍所載，諸有學梵志行術過者，當報師恩。",
        "translation": "Still, he thought to himself, 'That's a book that says, 'Those who are trained brahmins who practice skillfully should repay the teacher's kindness.",
        "source": "T02n0125_011:0597b29_3"
    },
    {
        "source_sentence": "又我今日所應學者皆復知之，我今宜可報於師恩。",
        "translation": "Furthermore, all the scholars and scholars who should be taught today will also know them. Now it is appropriate for me to repay my teacher’s kindness.",
        "source": "T02n0125_011:0597c01_4"
    },
    {
        "source_sentence": "然復貧匱，空無所有可用供養師者；",
        "translation": "Still, they are poor and helpless. Emptiness has nothing to offer as an offering to their teacher.",
        "source": "T02n0125_011:0597c03_5"
    },
    {
        "source_sentence": "宜當往詣國界求所須者。』",
        "translation": "It's advisable to go to the national border and seek what's needed.'",
        "source": "T02n0125_011:0597c04_6"
    },
    {
        "source_sentence": "「爾時，雲雷梵志便往至師所，而白師曰：『梵志所學技術之法，今悉知已，",
        "translation": "“At that time, the brahmin Yunle approached his teacher and said to him: O teacher, I am now thoroughly familiar with all the technical skills of the brāhmaṇa.",
        "source": "T02n0125_011:0597c04_7"
    },
    {
        "source_sentence": "然復書籍所載，諸有學術過者，當報師恩。",
        "translation": "However, it's also recorded in the book, and those who have scholarly faults should repay their teacher's kindness.",
        "source": "T02n0125_011:0597c06_8"
    },
    {
        "source_sentence": "然復貧乏，無有金銀珍寶可用供養者，今欲詣國界求索財物，用供養師。』",
        "translation": "Still, he's poor and has no gold or silver treasures to offer as an offering, so now he wants to go to the borders of his country to solicit property and use it to make offerings to his teacher.'",
        "source": "T02n0125_011:0597c07_9"
    },
    {
        "source_sentence": "「爾時，耶若達婆羅門便作是念：『此雲雷梵志我之所愛，不去心首。",
        "translation": "At the time, the Brāhmaṇa Yajñadatta had this thought, 'This cloud thunder priest is beloved by me and doesn't go to my heart.",
        "source": "T02n0125_011:0597c09_10"
    },
    {
        "source_sentence": "設吾死者尚不能別離，何況今日欲捨吾去。",
        "translation": "Even if I die, I won't be able to part with them, so why would you want to abandon me today?",
        "source": "T02n0125_011:0597c10_11"
    },
    {
        "source_sentence": "我今當作何方宜，使留得住耶？』",
        "translation": "Where will I now make it appropriate for you to stay?'",
        "source": "T02n0125_011:0597c11_12"
    },
    {
        "source_sentence": "「是時，耶若達梵志即告雲雷曰：『汝梵志！",
        "translation": "At that point, the priest Yajñadatta then addressed Yunle, saying, 'You priest!",
        "source": "T02n0125_011:0597c12_13"
    },
    {
        "source_sentence": "今故有婆羅門所應學者，卿尚不知。』",
        "translation": "Now, there's a Brāhmaṇa who should be studied, but you still don't know him.'",
        "source": "T02n0125_011:0597c13_14"
    },
    {
        "source_sentence": "是時，雲雷梵志便前白師：『唯願見教，何者未誦？』",
        "translation": "The priest Yunle then went forward and said to his teacher, 'I'd like to see the teaching, so why isn't it recited?'",
        "source": "T02n0125_011:0597c14_15"
    },
    {
        "source_sentence": "是時，耶若達梵志便思惟造五百言誦，告雲雷曰：『今有此書名五百言誦，",
        "translation": "At that time, the brahmin Yajnada thought to compose a recitation in five hundred syllables. He said to Yunle, “There is now a book called this, ‘ Recitation in Five Hundred Syllables.",
        "source": "T02n0125_011:0597c15_16"
    },
    {
        "source_sentence": "汝可受之。』",
        "translation": "You may accept it.'",
        "source": "T02n0125_011:0597c17_17"
    },
    {
        "source_sentence": "雲雷白言：『願師見授，欲得諷誦！』",
        "translation": "Yun Lei said, 'May the teacher see it and want to recite it!'",
        "source": "T02n0125_011:0597c17_18"
    },
    {
        "source_sentence": "「比丘當知，爾時，耶若達便授弟子此五百言誦。",
        "translation": "“Monks, you should know that it was then that Yajñadatta instructed his disciples to recite these five hundred words.",
        "source": "T02n0125_011:0597c18_19"
    },
    {
        "source_sentence": "未逕幾日，悉皆流利。",
        "translation": "Before a few days passed, they all flowed in streams.",
        "source": "T02n0125_011:0597c19_20"
    },
    {
        "source_sentence": "是時，耶若達婆羅門告五百弟子曰：『此雲雷梵志技術悉備，無事不通，",
        "translation": "At that time the brāhmaṇa Yajnadatta said to his five hundred disciples, “This brahmin Bhaiṣajyarāja is well versed in all arts and sciences.",
        "source": "T02n0125_011:0597c20_21"
    },
    {
        "source_sentence": "即以立名，名曰超術。",
        "translation": "That's when he establishes a name, which is called transcendent technique.",
        "source": "T02n0125_011:0597c21_22"
    },
    {
        "source_sentence": "此超術梵志極為高才，天文、地理靡不觀博，書疏文字亦悉了知。』",
        "translation": "This transcendent priest is extremely highly talented, and he observes astronomy and geography without fail, and he knows all the words and syllables in writing and commentaries.'",
        "source": "T02n0125_011:0597c22_23"
    },
    {
        "source_sentence": "爾時，超術梵志復經數日，復白師曰：『梵志所學技術之法，今悉知已，",
        "translation": "After a few days he said to his teacher, “The brahmin has now thoroughly mastered all the technical disciplines that should be studied by him.",
        "source": "T02n0125_011:0597c23_24"
    },
    {
        "source_sentence": "然復書籍所載，諸有學術過者，當報師恩。",
        "translation": "However, it's also recorded in the book, and those who have scholarly faults should repay their teacher's kindness.",
        "source": "T02n0125_011:0597c25_25"
    },
    {
        "source_sentence": "加復貧乏，無有金銀珍寶可用供養師者，今欲詣國界求索財物，用供養師，",
        "translation": "Moreover, they are poor and unable to find gold, silver, or precious treasures to offer as an offering to their teacher. They now wish to go to the frontier of the country to solicit property in order to support their teacher.",
        "source": "T02n0125_011:0597c26_26"
    },
    {
        "source_sentence": "唯願聽許！』",
        "translation": "Please listen and allow it!'",
        "source": "T02n0125_011:0597c28_27"
    },
    {
        "source_sentence": "爾時，耶若達梵志告曰：『汝知是時。』",
        "translation": "It was then that the priest Yajñada told him, 'You know it's the right time.'",
        "source": "T02n0125_011:0597c28_28"
    },
    {
        "source_sentence": "超術梵志前禮師足，便退而去。",
        "translation": "The brahmin Chaoshuo bowed his head at the teacher’s feet and withdrew.",
        "source": "T02n0125_011:0597c29_29"
    },
    {
        "source_sentence": "「爾時，鉢摩大國去城不遠，有眾梵志普集一處，欲共大祠，亦欲講論。",
        "translation": "At the time, not far from the city of Padma, there were many priests gathered in one place to perform a great sacrifice together and also to hold a discussion.",
        "source": "T02n0125_011:0598a02_0"
    },
    {
        "source_sentence": "時，有八萬四千梵志共集。",
        "translation": "At that time, there were eighty-four thousand brahmans assembled together.",
        "source": "T02n0125_011:0598a03_1"
    },
    {
        "source_sentence": "第一上坐亦復諷誦外道書疏，莫不練知，天文、地理、星宿變怪，皆悉了知。",
        "translation": "The first superior seat also recited the commentaries of non-Buddhist books, and they all knew everything about astronomy, geography, constellations, and strange phenomena.",
        "source": "T02n0125_011:0598a04_2"
    },
    {
        "source_sentence": "各欲散時，便以五百兩金及金杖一枚，金澡罐一枚，牛千頭，用奉上師，",
        "translation": "When they each wished to disperse, they offered five hundred taels of gold and one piece of the golden staff, one golden bathing pot, a thousand heads of cow, to the Master.",
        "source": "T02n0125_011:0598a06_0"
    },
    {
        "source_sentence": "與第一上坐。",
        "translation": "He's sitting with the first superior seat.",
        "source": "T02n0125_011:0598a07_1"
    },
    {
        "source_sentence": "「爾時，超術梵志聞，去鉢摩大國不遠，有諸梵志八萬四千集在一處，",
        "translation": "“At that time, not far from the great kingdom of Brahmakāyika some eighty-four thousand brahmins had assembled in one place.",
        "source": "T02n0125_011:0598a07_2"
    },
    {
        "source_sentence": "其有試術過者，便與五百兩金及金杖一枚，金澡罐一枚，大牛千頭。",
        "translation": "Those who had failed to test the technique offered five hundred taels of gold and one piece of a golden cane, a golden bathing pot, and a thousand heads of a great ox.",
        "source": "T02n0125_011:0598a09_3"
    },
    {
        "source_sentence": "是時，超術梵志自念：『我今何故家家乞求？",
        "translation": "At that point, the supernormal priest thought to himself, 'Why am I begging at home now?'",
        "source": "T02n0125_011:0598a11_0"
    },
    {
        "source_sentence": "不如詣彼大眾共捔技術。』",
        "translation": "It's not as good as going to the masses and discussing skills together.'",
        "source": "T02n0125_011:0598a11_1"
    },
    {
        "source_sentence": "是時，超術梵志便往至大眾所。",
        "translation": "At that point, the supernormal priest then went to the assembled crowd.",
        "source": "T02n0125_011:0598a12_2"
    },
    {
        "source_sentence": "「爾時，眾多梵志遙見超術梵志，各各高聲喚曰：『善哉！",
        "translation": "At that point, many priests saw the supernormal priest from a distance, and each of them raised their voices and called out, 'Good!",
        "source": "T02n0125_011:0598a13_3"
    },
    {
        "source_sentence": "祠主，今獲大利，乃使梵天躬自下降。』",
        "translation": "Now that the shrine owner has obtained great rewards, he causes the Brahma gods to descend in person.'",
        "source": "T02n0125_011:0598a14_4"
    },
    {
        "source_sentence": "時，八萬四千諸梵志等各起共迎，異口同音而作是語：『善來，大梵神天！』",
        "translation": "Eighty-four thousand priests and others then rose to greet each other, spoke together in unison, and said, 'Well come, Mahābrahmā!'",
        "source": "T02n0125_011:0598a15_5"
    },
    {
        "source_sentence": "時，超術梵志便生此念：『此諸梵志謂呼吾是梵天，然復吾亦非梵天。』",
        "translation": "The transcendent priest then had this thought, 'These priests say that I'm the Brahma god, but again, I'm not the Brahma god either.'",
        "source": "T02n0125_011:0598a16_6"
    },
    {
        "source_sentence": "是時，超術梵志語諸婆羅門曰：『止！",
        "translation": "The priest Kauṣṭhila then said to the Brāhmaṇas, 'Stop!",
        "source": "T02n0125_011:0598a18_7"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T02n0125_011:0598a19_8"
    },
    {
        "source_sentence": "諸賢！",
        "translation": "Venerable friends!",
        "source": "T02n0125_011:0598a19_9"
    },
    {
        "source_sentence": "勿呼吾是梵天也。",
        "translation": "Don't call me the Brahma gods.",
        "source": "T02n0125_011:0598a19_10"
    },
    {
        "source_sentence": "汝等豈不聞乎？",
        "translation": "Haven't you heard?",
        "source": "T02n0125_011:0598a19_11"
    },
    {
        "source_sentence": "雪山北有大梵志眾師，名耶若達，天文、地理靡不貫練。』",
        "translation": "To the north of the snowy mountains there's a great priestly teacher named Yajñadatta, who trains in astronomy and geography.'",
        "source": "T02n0125_011:0598a20_12"
    },
    {
        "source_sentence": "諸梵志曰：『吾等聞之，但不見耳！』",
        "translation": "The priests said, 'We've heard it but haven't seen it!'",
        "source": "T02n0125_011:0598a21_13"
    },
    {
        "source_sentence": "超術梵志曰：『我是其弟子，名曰超術。』",
        "translation": "The priest Daosun said, 'I'm his disciple named Daosun.'",
        "source": "T02n0125_011:0598a22_14"
    },
    {
        "source_sentence": "是時，超術梵志便向彼眾第一上坐而告之曰：『設知技術者，向吾說之。』",
        "translation": "The priest Chaos then addressed the first seat of the assembly and told him, 'If you know the technique, tell me about it.'",
        "source": "T02n0125_011:0598a23_15"
    },
    {
        "source_sentence": "「爾時，彼眾第一上坐即向超術梵志誦三藏技術，無有漏失。",
        "translation": "At the time, the first of those people at the top seat in the assembly addressed the transcendent priest who recited the techniques of the tripiṭaka without any error or mistake.",
        "source": "T02n0125_011:0598a24_16"
    },
    {
        "source_sentence": "時，超術婆羅門復語彼上坐曰：『一句五百言，今可說之。』",
        "translation": "The Brāhmaṇa Chaos then again said to the superior seat, 'A sentence of five hundred words can now be explained.'",
        "source": "T02n0125_011:0598a26_17"
    },
    {
        "source_sentence": "是時，彼上坐曰：『我不解此義，何等是一句五百言者？』",
        "translation": "The superior seat then said, 'I don't understand this meaning, so what are these five hundred words in one sentence?'",
        "source": "T02n0125_011:0598a27_18"
    },
    {
        "source_sentence": "時，超術梵志告曰：『諸賢！",
        "translation": "The supernormal priest then addressed them, saying, 'Dear friends!",
        "source": "T02n0125_011:0598a28_19"
    },
    {
        "source_sentence": "默然聽說一句五百言大人之相。』",
        "translation": "He listened quietly to the five hundred words of the sentence and heard the characteristics of the great man's appearance.'",
        "source": "T02n0125_011:0598a29_20"
    },
    {
        "source_sentence": "「比丘當知，爾時，超術梵志便誦三藏之術，及一句五百言大人之相。",
        "translation": "“Monks, you should know that it was then that the priest Kauṣṭhila recited the teachings of the Tripiṭaka and a sentence of five hundred words about the characteristics of a great man.",
        "source": "T02n0125_011:0598b01_21"
    },
    {
        "source_sentence": "爾時，八萬四千梵志歎未曾有：『甚奇！",
        "translation": "At the time, 84,000 priests praised it as unprecedented: 'How marvelous!",
        "source": "T02n0125_011:0598b02_22"
    },
    {
        "source_sentence": "甚特！",
        "translation": "That's extraordinary!",
        "source": "T02n0125_011:0598b03_23"
    },
    {
        "source_sentence": "我等初不聞一句五百言大人之相，今尊者宜在上頭第一上坐。』",
        "translation": "At first, we didn't hear a single phrase of five hundred words about the characteristics of greatness, so now it's advisable for the venerable to sit at the top of the head.'",
        "source": "T02n0125_011:0598b03_24"
    },
    {
        "source_sentence": "「爾時，超術梵志移彼上坐已，便在第一上頭坐。",
        "translation": "“At that point, the supernormal priest moved his upper seat and sat down at the top of the first.",
        "source": "T02n0125_011:0598b05_0"
    },
    {
        "source_sentence": "爾時，彼眾上坐極懷瞋恚，發此誓願：『今此人移我坐處，自補其處。",
        "translation": "At that time, the members of the assembly were seated in great anger and made this vow:",
        "source": "T02n0125_011:0598b06_1"
    },
    {
        "source_sentence": "我今所誦經籍，持戒苦行，設當有福者，盡持用作誓：「此人所生之處，",
        "translation": "I will now recite the scriptures, observe precepts and ascetic practices, and, if there are any who are blessed, maintain them in full and make a vow:",
        "source": "T02n0125_011:0598b07_2"
    },
    {
        "source_sentence": "所欲作事，我恒當壞敗其功。」』",
        "translation": "Whatever I want to do, I'll always destroy its merit.'",
        "source": "T02n0125_011:0598b09_3"
    },
    {
        "source_sentence": "「是時，彼施之主即出五百兩金及金杖一枚，金澡罐一枚，牛千頭，好女一人，",
        "translation": "“Then the donor presented five hundred taels of gold and a golden staff, a golden bathing pot, a thousand heads of cow, and one handsome woman.",
        "source": "T02n0125_011:0598b10_0"
    },
    {
        "source_sentence": "持用與上坐使呪願。",
        "translation": "He'll give it to the superior seat as a spell and vow.",
        "source": "T02n0125_011:0598b11_1"
    },
    {
        "source_sentence": "爾時，上坐告主人曰：『我今受此五百兩金及金杖、金澡罐，當用供養師。",
        "translation": "At that time, the superior seated monk said to his host: I will now accept these five hundred taels of gold, as well as my golden staff and golden pitcher for washing.",
        "source": "T02n0125_011:0598b12_2"
    },
    {
        "source_sentence": "此女人，及牛千頭還施主人。",
        "translation": "This woman and a thousand heads of cattle returned to their master.",
        "source": "T02n0125_011:0598b13_3"
    },
    {
        "source_sentence": "所以然者，吾不習欲，亦不積財。』",
        "translation": "That's why I don't cultivate desire and don't accumulate wealth.'",
        "source": "T02n0125_011:0598b14_4"
    },
    {
        "source_sentence": "「是時，超術梵志受此金杖、澡罐已，便往詣鉢摩大國。",
        "translation": "“At that time, the brahmin Chaoshuo had accepted these golden staffs and bathing pot. Then he went to the great country of Padma [and stayed there].",
        "source": "T02n0125_011:0598b15_5"
    },
    {
        "source_sentence": "其王名曰光明。",
        "translation": "The king's name was Guangming.",
        "source": "T02n0125_011:0598b16_6"
    },
    {
        "source_sentence": "時，彼國王請定光如來及比丘眾衣食供養。",
        "translation": "The king of that country then invited the Tathāgata of Congwang and the other monks to make offerings with food and clothing.",
        "source": "T02n0125_011:0598b17_0"
    },
    {
        "source_sentence": "時，彼國王告令城內：『其有人民有香華，盡不得賣，若有賣者當重罰之；",
        "translation": "The king of that country then ordered his officials in the city, “If there are any citizens who have fragrant flowers they should not sell them to anyone.",
        "source": "T02n0125_011:0598b18_1"
    },
    {
        "source_sentence": "吾自出買，不須轉賣。』",
        "translation": "I'll buy it myself, so there's no need to change and sell it.'",
        "source": "T02n0125_011:0598b19_2"
    },
    {
        "source_sentence": "復勅人民，掃灑令淨，勿使有土沙穢惡；",
        "translation": "Again, the king ordered his people to sweep away dirt and make it pure so that no dirty dirt or sand would grow.",
        "source": "T02n0125_011:0598b20_3"
    },
    {
        "source_sentence": "懸繒幡蓋，香汁塗地，作倡妓樂，不可稱計。",
        "translation": "They hang silken banners and canopies, scented juice is applied to the ground, and countless singers and musicians are performed.",
        "source": "T02n0125_011:0598b21_4"
    },
    {
        "source_sentence": "「爾時，彼梵志見已，便問行道人曰：『今是何日？",
        "translation": "Seeing this, the brahmin asked the practitioner of the Way, “What day is it now?” The practitioner replied:",
        "source": "T02n0125_011:0598b22_5"
    },
    {
        "source_sentence": "掃灑道路，除治不淨，懸繒幡蓋，不可稱計。",
        "translation": "The roads were swept up to remove dirt and the banners and canopies suspended, which could not be measured.",
        "source": "T02n0125_011:0598b23_6"
    },
    {
        "source_sentence": "將非國主太子有所娉娶？』",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T02n0125_011:0598b24_7"
    },
    {
        "source_sentence": "彼行道人報曰：『梵志不知耶？",
        "translation": "The practitioner of the Way replied, 'Didn't the priest know?'",
        "source": "T02n0125_011:0598b25_8"
    },
    {
        "source_sentence": "鉢摩大國王今請定光如來、至真、等正覺，衣食供養，故平治道路，懸繒幡蓋耳。』",
        "translation": "Now, the great king of Padma invites the Tathāgata of Consecutive Light, the Supreme Truth, and the Completely Enlightened One to make offerings with food and clothing, so he levels the road and hangs a silhouettering banner and canopy.'",
        "source": "T02n0125_011:0598b25_9"
    },
    {
        "source_sentence": "然梵志祕記亦有此語：『如來出世，甚難得遇，時時乃出，實不可見，",
        "translation": "The Blessed One said: When the Tathāgata appears in the world, it is very difficult to meet him. He appears only occasionally and at different times but cannot really be seen.",
        "source": "T02n0125_011:0598b27_10"
    },
    {
        "source_sentence": "猶如優曇鉢華，時時乃出。』",
        "translation": "It's like the flower of the udumbara flower that comes out at the right time.'",
        "source": "T02n0125_011:0598b29_11"
    },
    {
        "source_sentence": "此亦如是，如來出現於世，甚不可值。",
        "translation": "In much the same way, when a buddha appears in the world it is hard to find.",
        "source": "T02n0125_011:0598b29_12"
    },
    {
        "source_sentence": "又梵志書亦有語：『有二人出世甚難得值。",
        "translation": "Also, the Sanskrit book also says, 'There are two people who appear in the world that are very difficult to meet.",
        "source": "T02n0125_011:0598c01_13"
    },
    {
        "source_sentence": "云何二人？",
        "translation": "What are these two?",
        "source": "T02n0125_011:0598c02_14"
    },
    {
        "source_sentence": "如來及轉輪聖王。",
        "translation": "The Tathāgata and the wheel-turning sage king.",
        "source": "T02n0125_011:0598c03_15"
    },
    {
        "source_sentence": "此二人出現甚難得值。』",
        "translation": "It's very difficult to meet these two people who appear.'",
        "source": "T02n0125_011:0598c03_16"
    },
    {
        "source_sentence": "爾時，彼復作是念：『我今可急速報佛恩，今且以此五百兩金奉上定光如來。』",
        "translation": "It was then that he again thought, 'Now, I can quickly repay the Buddha's kindnesses, so now let's offer these five hundred taels of gold to the Tathāgata of Concentration and Light.'",
        "source": "T02n0125_011:0598c04_17"
    },
    {
        "source_sentence": "復作是念：『書記所載，如來不受金銀珍寶；",
        "translation": "Again, he thought: As recorded in the scriptures, the Tathāgata did not accept gold, silver, or precious treasures.",
        "source": "T02n0125_011:0598c05_18"
    },
    {
        "source_sentence": "我可持此五百兩金，用買華香，散如來上。』",
        "translation": "I can take these five hundred taels of gold and use it to buy flowers and incense and scatter them on top of the Tathāgata.'",
        "source": "T02n0125_011:0598c06_19"
    },
    {
        "source_sentence": "「是時，梵志即入城內求買華香。",
        "translation": "“At the time, the priest went inside the city to buy flowers and incense.",
        "source": "T02n0125_011:0598c08_0"
    },
    {
        "source_sentence": "爾時，城中行人報曰：『梵志不知耶？",
        "translation": "It was then that the pedestrians in the city reported, 'Didn't you know?",
        "source": "T02n0125_011:0598c08_1"
    },
    {
        "source_sentence": "國王有教令，其有香華賣者當重罰之。』",
        "translation": "The king of the king has an order, and those who sell incense or flowers will be severely punished if they do so.'",
        "source": "T02n0125_011:0598c09_2"
    },
    {
        "source_sentence": "時，彼超術梵志便作是念：『是我薄祐，求華不獲，將知如何？』",
        "translation": "That transcendent priest then had this thought, 'This is my poor fortune; I won't get the flowers if I seek them, so what will I know?'",
        "source": "T02n0125_011:0598c10_3"
    },
    {
        "source_sentence": "便還出城，在門外立。",
        "translation": "He then returned out of the city and stood outside the gate.",
        "source": "T02n0125_011:0598c11_4"
    },
    {
        "source_sentence": "「爾時，有婆羅門女名曰善味，持水瓶行取水，手執五枚華。",
        "translation": "“At the time, there was a Brāhmaṇa woman named Sunetra, carrying a water bottle and walking to get water, holding five flower flowers in her hand.",
        "source": "T02n0125_011:0598c12_5"
    },
    {
        "source_sentence": "梵志見已，語彼女人曰：『大妹！",
        "translation": "Seeing this, the priest said to the woman:",
        "source": "T02n0125_011:0598c13_6"
    },
    {
        "source_sentence": "我今須華，願妹見賣與我。』",
        "translation": "Now that I need flowers, may my sister see and sell them to me.'",
        "source": "T02n0125_011:0598c14_7"
    },
    {
        "source_sentence": "梵志女曰：『我何時是汝妹？",
        "translation": "The brahman woman said, 'When was I your sister?'",
        "source": "T02n0125_011:0598c15_8"
    },
    {
        "source_sentence": "為識我父母不？』",
        "translation": "Does he know my parents?'",
        "source": "T02n0125_011:0598c15_9"
    },
    {
        "source_sentence": "時，超術梵志復生此念：『此女人性行寬博，意在戲笑。』",
        "translation": "The transcendent priest then again had this thought, 'This woman's nature and conduct are broad and extensive, and her intention is to play and laugh.'",
        "source": "T02n0125_011:0598c16_10"
    },
    {
        "source_sentence": "即復語言：『賢女！",
        "translation": "He then again said, 'Good girl!",
        "source": "T02n0125_011:0598c17_11"
    },
    {
        "source_sentence": "我當與價，是非見惠此華。』",
        "translation": "I will give you the price, and I won't see this flower as a blessing.'",
        "source": "T02n0125_011:0598c17_12"
    },
    {
        "source_sentence": "梵志女曰：『豈不聞大王有嚴教，不得賣華乎？』",
        "translation": "The priestly woman said, 'Haven't you heard that the great king had a strict teaching that he couldn't sell flowers?'",
        "source": "T02n0125_011:0598c18_13"
    },
    {
        "source_sentence": "「梵志曰：『賢女！",
        "translation": "The priest said, 'Good girl!",
        "source": "T02n0125_011:0598c19_14"
    },
    {
        "source_sentence": "此事無苦，王不奈汝何！",
        "translation": "This matter is not painful, so what the king can't do for you!",
        "source": "T02n0125_011:0598c19_15"
    },
    {
        "source_sentence": "我今急須此五枚華，我得此華，汝得貴價。』",
        "translation": "Now, I urgently need these five flowers; if I obtain these flowers, you'll get their valuable value.'",
        "source": "T02n0125_011:0598c20_16"
    },
    {
        "source_sentence": "梵志女曰：『汝急須華，欲作何等？』",
        "translation": "The priestly woman said, 'You urgently need flowers; what do you want to make?'",
        "source": "T02n0125_011:0598c21_17"
    },
    {
        "source_sentence": "梵志報曰：『我今見有良地，欲種此華。』",
        "translation": "The priest replied, 'Now, I see a good place to plant this flower.'",
        "source": "T02n0125_011:0598c22_18"
    },
    {
        "source_sentence": "梵志女曰：『此華以離其根，終不可生。",
        "translation": "The brahman woman said, 'This flower will never arise because it's free of its roots.",
        "source": "T02n0125_011:0598c22_19"
    },
    {
        "source_sentence": "云何方言我欲種之？』",
        "translation": "How do you say, 'I want to plant it?'",
        "source": "T02n0125_011:0598c23_20"
    },
    {
        "source_sentence": "梵志報曰：『如我今日所見良田，種死灰尚生，何況此華？』",
        "translation": "The priest replied, 'Suppose I see a good field today that's planted with dead ashes and still growing, let alone this flower.'",
        "source": "T02n0125_011:0598c24_21"
    },
    {
        "source_sentence": "「梵志女曰：『何者是良田，種死灰乃生乎？』",
        "translation": "The priestly woman said, 'What's the good field that grows when you plant dead ashes?'",
        "source": "T02n0125_011:0598c25_22"
    },
    {
        "source_sentence": "梵志報曰：『賢女！",
        "translation": "The priest replied, 'Good girl!",
        "source": "T02n0125_011:0598c26_23"
    },
    {
        "source_sentence": "有定光佛、如來、至真、等正覺，出現於世。』",
        "translation": "There's the Buddha of Concentration, the Tathāgata, the supreme truth, and the perfectly enlightened one who appear in the world.'",
        "source": "T02n0125_011:0598c26_24"
    },
    {
        "source_sentence": "梵志女曰：『定光如來為何等類？』",
        "translation": "The priestly woman said, 'What kind is the Tathāgata of Concentration Light?'",
        "source": "T02n0125_011:0598c27_25"
    },
    {
        "source_sentence": "梵志即報彼女曰：『定光如來者，有如是之德，有如是之戒，成諸功德。』",
        "translation": "The priest then reported to the woman, saying, 'The Tathāgata of Concentration and Light has such virtues, such precepts, and such merits that he accomplishes them.'",
        "source": "T02n0125_011:0598c28_26"
    },
    {
        "source_sentence": "梵志女曰：『設有功德者，欲求何等福？』",
        "translation": "The priestly woman said, 'If there's merit, what kind of merit do you want to pursue?'",
        "source": "T02n0125_011:0599a01_27"
    },
    {
        "source_sentence": "梵志報曰：『願我後生當如定光如來、至真、等正覺，禁戒、功德亦當如是。』",
        "translation": "The priest replied, 'May I be born in the future like the Tathāgata of Concentration Light, the Supreme Truth, and the Completely Awakened One, and so will the forbidden precepts and merits be likewise.'",
        "source": "T02n0125_011:0599a02_28"
    },
    {
        "source_sentence": "「梵志女曰：『設汝許我世世作夫婦，我便與汝華。』",
        "translation": "The priestly woman said, 'Suppose you allow me to be a husband and wife in the world, and I'll give you flowers.'",
        "source": "T02n0125_011:0599a03_29"
    },
    {
        "source_sentence": "梵志曰：『我今所行，意不著欲。』",
        "translation": "The priest said, 'What I'm doing now is not attached to desire in my mind.'",
        "source": "T02n0125_011:0599a05_0"
    },
    {
        "source_sentence": "梵志女曰：『如我今身不求為汝作妻，使我將來世與汝作妻。』",
        "translation": "The priestly woman said, 'Suppose I don't seek to be your wife in my present body and make me your wife in a future life.'",
        "source": "T02n0125_011:0599a05_1"
    },
    {
        "source_sentence": "超術梵志曰：『菩薩所行，無有愛惜，設與我作妻者，必壞我心。』",
        "translation": "The transcendent priest said, 'There's no craving for what the bodhisattva does, and if he were to give me as his wife, it would surely destroy my mind.'",
        "source": "T02n0125_011:0599a07_2"
    },
    {
        "source_sentence": "梵志女曰：『我終不壞汝施意，正使持我身施與人者，終不壞施心。』",
        "translation": "The priestly woman said, 'I'll never break your intention to give, but if I were to give my body to someone, I wouldn't break your intention to give.'",
        "source": "T02n0125_011:0599a08_3"
    },
    {
        "source_sentence": "是時，便持五百金錢，用買五枚華，與彼女人，共作誓願，各自別去。",
        "translation": "They then took the five hundred coins, bought five pieces of flowers, gave them to the woman, made a common vow, and departed separately.",
        "source": "T02n0125_011:0599a10_4"
    },
    {
        "source_sentence": "「是時，定光如來、至真、等正覺時到著衣持鉢，與比丘僧前後圍繞，",
        "translation": "“At that time, when the Tathāgata of Concentration and the supremely true and perfectly enlightened one arrived, they put on their robes, took their bowls, and surrounded by the monks and nuns,",
        "source": "T02n0125_011:0599a11_5"
    },
    {
        "source_sentence": "入鉢摩大國。",
        "translation": "He entered the great kingdom of Padma.",
        "source": "T02n0125_011:0599a13_6"
    },
    {
        "source_sentence": "時，超術梵志遙見定光如來顏貌端政，見莫不歡，諸根寂靜，行不錯亂，",
        "translation": "The brahmin Chaos then saw from a distance that the Tathāgata Samādhiprabha was endowed with an imposing countenance. Seeing him, he was delighted; his sense faculties were calm and his movements were not disturbed.",
        "source": "T02n0125_011:0599a13_7"
    },
    {
        "source_sentence": "有三十二相、八十種好。",
        "translation": "They have the thirty-two marks and eighty kinds of beauty.",
        "source": "T02n0125_011:0599a15_8"
    },
    {
        "source_sentence": "猶如澄水無有穢濁，光明徹照，無所罣礙。",
        "translation": "It's like clear water that has no dirt or dirt, and its light penetrates it without obstruction.",
        "source": "T02n0125_011:0599a15_9"
    },
    {
        "source_sentence": "亦如寶山，出諸山上。",
        "translation": "It's also like a jeweled mountain that emerges from the mountains.",
        "source": "T02n0125_011:0599a16_10"
    },
    {
        "source_sentence": "見已，便發歡喜心，於如來所持此五莖華，至定光如來所。",
        "translation": "Having seen it, he then became delighted and took these five- stemd flower that the Tathāgata held to him and went to the Tathāgata of Concentration Light.",
        "source": "T02n0125_011:0599a17_11"
    },
    {
        "source_sentence": "到已，在一面住。",
        "translation": "When he arrived, he stayed to one side.",
        "source": "T02n0125_011:0599a18_12"
    },
    {
        "source_sentence": "「時，超術梵志白定光佛言：『願見採受，設世尊今不授決者，便當於此處斷其命根，",
        "translation": "At that time, the brahmin Chaoshuo said to the Buddha Dīpaṅkara, “May I request that you take this food and accept it? If the World-honored One does not grant me a ruling now, I will cut off my life from this body.",
        "source": "T02n0125_011:0599a19_13"
    },
    {
        "source_sentence": "不願此生。』",
        "translation": "I don't want to be born here.'",
        "source": "T02n0125_011:0599a21_14"
    },
    {
        "source_sentence": "爾時，世尊告曰：『梵志！",
        "translation": "It was then that the Bhagavān addressed him, saying, 'Brahmin!",
        "source": "T02n0125_011:0599a21_15"
    },
    {
        "source_sentence": "不可以此五莖華授無上等正覺。』",
        "translation": "You mustn't give these five stalks of flowers to the unsurpassed perfect enlightenment.'",
        "source": "T02n0125_011:0599a21_16"
    },
    {
        "source_sentence": "梵志白言：『願世尊與我說菩薩所行法！』",
        "translation": "The priest said, 'May the Bhagavān explain to me the bodhisattva's practice!'",
        "source": "T02n0125_011:0599a22_17"
    },
    {
        "source_sentence": "定光佛告曰：『菩薩所行，無所愛惜。』",
        "translation": "The Buddha of Concentration and Light told him, 'There's nothing to cherish what the bodhisattva does.'",
        "source": "T02n0125_011:0599a23_18"
    },
    {
        "source_sentence": "「『不敢以父母，　　持施與外人；",
        "translation": "'I won't dare to give it to outsiders with my parents as a gift.",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "　　諸佛真人長，　　亦復不敢施。",
        "translation": "The buddhas are truly long-lived, and they don't dare to give anything.",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "　　日月周行世，　　此二不可施；",
        "translation": "The sun and moon traverse the world, but these two cannot be given.",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "　　餘者盡可施，　　意決無有難。』",
        "translation": "The rest can be given in full, and there's no difficulty in making up your mind.'",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "「『如汝所說施，　　亦不如來言；",
        "translation": "'As you teach about giving, it's not like what the Buddha said.",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "　　當忍億劫苦，　　施頭身耳目。",
        "translation": "You should endure suffering for billions of eons, bestowing your head, body, ears, and eyes.",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "　　妻子國財寶，　　車馬僕從人；",
        "translation": "Their wives, wealth and treasures, Vehicles, horses, and servants were all entrusted to people.",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "　　設能堪與者，　　今當授汝決。』",
        "translation": "Suppose someone can give it to you, and now I'll give you a decision.'",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "「爾時，梵志便說偈言：「爾時，定光佛復以此偈報梵志曰：「爾時，",
        "translation": "“At that time, the brahmin spoke these verses: At that moment, the Buddha Candracchattra addressed the brahmin in this way:",
        "source": "T02n0125_011:0599a24_19"
    },
    {
        "source_sentence": "「『大山熾如火，　　億劫堪頂戴；",
        "translation": "The great mountain is as blazing as a fire, capable of being sustained for billions of kalpas.",
        "source": "T02n0125_011:0599b05_20"
    },
    {
        "source_sentence": "　　不能壞道意，　　唯願時授決。』",
        "translation": "They can't destroy the intention for the path, but may they give a ruling at the right time.'",
        "source": "T02n0125_011:0599b05_20"
    },
    {
        "source_sentence": "摩納復說此偈：「爾時，定光如來默然不語。",
        "translation": "Mānava again spoke this verse, At the time, the Tathāgata of Concentration and Light was silent and not speaking.",
        "source": "T02n0125_011:0599b05_20"
    },
    {
        "source_sentence": "時，彼梵志手執五莖華，右膝著地，散定光如來，並作是說：『持是福祐，",
        "translation": "The brāhmaṇa, holding the five-petaled lotus in his hand, knelt with his right knee touching the ground, and said to the Tathāgata Saṃdhinirmocana:",
        "source": "T02n0125_011:0599b08_21"
    },
    {
        "source_sentence": "使將來世當如定光如來、至真、等正覺，而無有異！』",
        "translation": "In the future, it will be like the Tathāgata of Concentration Light, the Supreme Truth, and the Equally Enlightened One, without any difference!'",
        "source": "T02n0125_011:0599b10_22"
    },
    {
        "source_sentence": "即自散髮在于淤泥。",
        "translation": "They then scatter themselves into the mud.",
        "source": "T02n0125_011:0599b11_23"
    },
    {
        "source_sentence": "『若如來授我決者，便當以足蹈我髮上過。』",
        "translation": "'If the Tathāgata gives me a ruling, then he'll step on me with his feet.'",
        "source": "T02n0125_011:0599b12_24"
    },
    {
        "source_sentence": "「比丘當知：爾時，定光如來觀察梵志心中所念，便告梵志曰：『汝將來世當作釋迦文佛、如來、至真、等正覺。』",
        "translation": "You should know, monks, that it's then that the Tathāgata of Concentration Light observes what's in the mind of the priest and tells the priest, 'In a future life, you will become Śākyamuni Buddha, the Tathāgata, the supreme truth, and the perfectly enlightened one.'",
        "source": "T02n0125_011:0599b13_25"
    },
    {
        "source_sentence": "「時，超術梵志有同學，名曇摩留支，在如來邊，見定光佛授超術梵志決，",
        "translation": "“At that time, there was a fellow disciple named Dharmaruci by the name of Vimalakīrti among the brahmins. He was staying at the side of the Tathāgata’s path when he saw the buddha Dīpaṅkara bestowing supernatural knowledge on him.",
        "source": "T02n0125_011:0599b15_26"
    },
    {
        "source_sentence": "又足蹈髮上。",
        "translation": "He also steps on it with his feet.",
        "source": "T02n0125_011:0599b17_27"
    },
    {
        "source_sentence": "見已，便作是說：『此禿頭沙門何忍，乃舉足蹈此清淨梵志髮上？",
        "translation": "Seeing this, he said, 'How can this bald-headed ascetic tolerate that he raises his feet and steps on this pure priest?'",
        "source": "T02n0125_011:0599b17_28"
    },
    {
        "source_sentence": "此非人行！』」",
        "translation": "This is not human action!'",
        "source": "T02n0125_011:0599b19_0"
    },
    {
        "source_sentence": "佛告諸比丘：「爾時耶若達梵志者，豈異人乎？",
        "translation": "The Buddha told the monks, Isn't that a different person than the priest Yajñadatta at the time?",
        "source": "T02n0125_011:0599b19_1"
    },
    {
        "source_sentence": "莫作是觀。",
        "translation": "Don't make such an observation.",
        "source": "T02n0125_011:0599b20_2"
    },
    {
        "source_sentence": "所以然者，爾時耶若達者，今白淨王是。",
        "translation": "The reason for this is that at the time, Yajñadatta was now King Śubhavyūha.",
        "source": "T02n0125_011:0599b20_3"
    },
    {
        "source_sentence": "爾時八萬四千梵志上坐者，今提婆達兜身是也。",
        "translation": "At the time, 84,000 priests were seated above him, and this is Devadatta's body now.",
        "source": "T02n0125_011:0599b21_4"
    },
    {
        "source_sentence": "時超術梵志者，即我身是也。",
        "translation": "The priest who transfigured himself at that time is the self.",
        "source": "T02n0125_011:0599b22_5"
    },
    {
        "source_sentence": "是時梵志女賣華者，今瞿夷是也。",
        "translation": "The priestly woman selling flowers at the time was now Gopīi.",
        "source": "T02n0125_011:0599b23_6"
    },
    {
        "source_sentence": "爾時祠主者，今執杖梵志是也。",
        "translation": "At the time, the head of the shrine was a priest holding a staff.",
        "source": "T02n0125_011:0599b24_7"
    },
    {
        "source_sentence": "爾時曇摩留支，口所造行，吐不善響，今曇摩留支是也。",
        "translation": "It was then that Dharmaruci, a practitioner created by mouth and producing an unwholesome sound, is now Dharmaruci.",
        "source": "T02n0125_011:0599b24_8"
    },
    {
        "source_sentence": "然復曇摩留支無數劫中恒作畜生，最後受身在大海作魚，身長七百由旬，",
        "translation": "The Dharmaruci always remained an animal for innumerable kalpas. At the last moment he was reborn as a fish, seven hundred yojanas in height, with his body at sea and sixty li in circumference.",
        "source": "T02n0125_011:0599b26_9"
    },
    {
        "source_sentence": "從彼命終，來生此間，與善知識從事，恒親近在善知識，習諸善法，根門通利。",
        "translation": "At the end of their life, they're born here, where they work with good teachers, always associate with good teachers, cultivate good qualities, and have penetrating faculties.",
        "source": "T02n0125_011:0599b27_10"
    },
    {
        "source_sentence": "以此因緣故，我言：『久來此間。』",
        "translation": "Because of these causes and conditions, I say, 'I've been here for a long time.'",
        "source": "T02n0125_011:0599b29_11"
    },
    {
        "source_sentence": "曇摩留支亦復自陳：『如是，世尊！",
        "translation": "Dharmaruci also said to himself, 'So it is, Bhagavān!",
        "source": "T02n0125_011:0599c01_12"
    },
    {
        "source_sentence": "久來此間。』",
        "translation": "I've been here for a long time.'",
        "source": "T02n0125_011:0599c02_13"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0599c02_14"
    },
    {
        "source_sentence": "常當修習身、口、意行。",
        "translation": "You should always cultivate bodily, verbal, and mental actions.",
        "source": "T02n0125_011:0599c02_15"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0599c03_16"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0599c03_17"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0599c03_18"
    },
    {
        "source_sentence": "（四）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(4) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0599c05_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「我今當說，有人似師子者，有似羊者，汝等諦聽！",
        "translation": "At the time, the Bhagavān addressed the monks, Now, I will explain that some people resemble lions and some resemble sheep, so listen closely!",
        "source": "T02n0125_011:0599c06_1"
    },
    {
        "source_sentence": "善思念之。」",
        "translation": "Think of it well.",
        "source": "T02n0125_011:0599c07_2"
    },
    {
        "source_sentence": "諸比丘對曰：「如是。",
        "translation": "The monks replied, So it is.",
        "source": "T02n0125_011:0599c07_3"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T02n0125_011:0599c08_4"
    },
    {
        "source_sentence": "爾時，諸比丘從佛受教。",
        "translation": "It was then that the monks accepted the teaching from the Buddha.",
        "source": "T02n0125_011:0599c08_5"
    },
    {
        "source_sentence": "世尊告曰：「彼人云何似師子者？",
        "translation": "The Bhagavān told them, How does that person look like a lion?",
        "source": "T02n0125_011:0599c09_6"
    },
    {
        "source_sentence": "於是，比丘！",
        "translation": "Then, monks!",
        "source": "T02n0125_011:0599c09_7"
    },
    {
        "source_sentence": "或有人得供養衣被、飲食、床臥具、病瘦醫藥；",
        "translation": "Suppose there is a person who obtains an offering of clothing, food and drink, bedding, or medicine for the emaciation of illness.",
        "source": "T02n0125_011:0599c10_8"
    },
    {
        "source_sentence": "彼得已，便自食噉，不起染著之心，亦無有欲意，不起諸想，都無此念，",
        "translation": "Having subdued it, he eats and partakes of it himself. He does not give rise to thoughts of defilement or attachment, nor has he any thought of desire. He does not give rise to thoughts of desire.",
        "source": "T02n0125_011:0599c11_9"
    },
    {
        "source_sentence": "自知出要之法。",
        "translation": "He knows for himself the essentials of the teaching that he's leaving.",
        "source": "T02n0125_011:0599c12_10"
    },
    {
        "source_sentence": "設使不得利養，不起亂念，無增減心。",
        "translation": "Suppose someone doesn't attain profit, doesn't give up distracting thoughts, and doesn't increase or decrease their mind.",
        "source": "T02n0125_011:0599c13_11"
    },
    {
        "source_sentence": "猶師子王食噉小畜，爾時，彼獸王亦不作是念：此者好，此者不好，不起染著之心，",
        "translation": "It is as if the king of lions were to feed on cow dung and small animals. At that time, the king of animals did not think: “This is good or this is bad.” They do not give rise to thoughts of defiled attachment.",
        "source": "T02n0125_011:0599c14_0"
    },
    {
        "source_sentence": "亦無欲意，不起諸想。",
        "translation": "Nor does he have the mind of desire, and he doesn't give rise to perceptions.",
        "source": "T02n0125_011:0599c15_1"
    },
    {
        "source_sentence": "此人亦復如是，若得供養衣被、飯食、床臥具、病瘦醫藥，彼得已，便自食噉，",
        "translation": "In much the same way, if someone were to receive an offering of clothing and bedding, food and drink, a bed and bedding, or medicine for curing thinness in illness. Having accepted it, they would eat their own rice.",
        "source": "T02n0125_011:0599c16_2"
    },
    {
        "source_sentence": "不起想著之意；",
        "translation": "They do not give rise to conceptions or thoughts of attachment.",
        "source": "T02n0125_011:0599c18_3"
    },
    {
        "source_sentence": "設使不得，亦無諸念。",
        "translation": "Even if they don't get it, there are no thoughts.",
        "source": "T02n0125_011:0599c18_4"
    },
    {
        "source_sentence": "「猶如有人受人供養衣被、飯食、床臥具、病瘦醫藥，得已，便自食噉，",
        "translation": "“Suppose a man were to accept an offering of clothing, food and drink, bedding, or medicine for the treatment of illness and thinness from someone else. Having obtained it, he would feed on it himself.",
        "source": "T02n0125_011:0599c19_5"
    },
    {
        "source_sentence": "起染著之心，生愛欲意，不知出要之道；",
        "translation": "They give rise to thoughts of defiled attachment and develop feelings of craving, not knowing the means of emancipation.",
        "source": "T02n0125_011:0599c20_6"
    },
    {
        "source_sentence": "設使不得，恒生此想念。",
        "translation": "Even if they don't get it, they'll always give rise to this thought.",
        "source": "T02n0125_011:0599c21_7"
    },
    {
        "source_sentence": "彼人得供養已，向諸比丘而自貢高，毀蔑他人：『我所能得衣被、飯食、床臥具、病瘦醫藥，",
        "translation": "Having received these offerings, that person should bow to the bhikṣus and exalt themselves in self-conceit. disparaging others, “I am able to obtain robes, blankets, food and drink, bedding for lying on a bed, and medicine for curing my thinness of illness.” The bhikṣus may or may not accept this kind of offering because they think:",
        "source": "T02n0125_011:0599c22_8"
    },
    {
        "source_sentence": "此諸比丘不能得之。』",
        "translation": "These monks can't get it.'",
        "source": "T02n0125_011:0599c24_9"
    },
    {
        "source_sentence": "猶如大群羊中有一羊，出群已，詣大糞聚，此羊飽食屎已，還至羊群中，",
        "translation": "It is just as if there were a sheep in a large herd of sheep. Having left the herd, it would go to a large pile of excrement. After being fed with excrement, the sheep returns among the herd of sheep.",
        "source": "T02n0125_011:0599c24_10"
    },
    {
        "source_sentence": "便自貢高：『我能得好食，此諸羊不能得食。』",
        "translation": "He then prided himself, saying, 'I can get good food, but these goats won't be able to eat it.'",
        "source": "T02n0125_011:0599c26_11"
    },
    {
        "source_sentence": "此亦如是，若有一人，得利養衣被、床臥具、病瘦醫藥，起諸亂想，生染著心，",
        "translation": "Suppose there is a man who receives benefits such as clothing, bedding, bed mattresses, and medicine for illness and thinness. He gives rise to thoughts of confusion and develops thoughts of defilement and attachment.",
        "source": "T02n0125_011:0599c27_12"
    },
    {
        "source_sentence": "便向諸比丘而自貢高：『我能得供養，此諸比丘不能得供養。』",
        "translation": "He then bowed to the monks and said, 'I can make offerings, but these monks can't make offerings.'",
        "source": "T02n0125_011:0599c29_13"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0600a01_14"
    },
    {
        "source_sentence": "當學如師子王，莫如羊也。",
        "translation": "You should train like a lion king and not like a sheep.",
        "source": "T02n0125_011:0600a02_0"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0600a02_1"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0600a03_0"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0600a03_1"
    },
    {
        "source_sentence": "（五）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(5) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0600a05_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「若有眾生知反復者，此人可敬，小恩尚不忘，",
        "translation": "At that time the World-honored One said to the monks: If there are any living beings who know and repeat [these words], they should be revered. They will not forget even a small gesture of kindness.",
        "source": "T02n0125_011:0600a06_1"
    },
    {
        "source_sentence": "何況大恩！",
        "translation": "How could it be more so than great kindness!",
        "source": "T02n0125_011:0600a07_2"
    },
    {
        "source_sentence": "設使離此間千由旬、百千由旬，故不為遠，猶近我不異。",
        "translation": "Even if it were to be a thousand yojanas or a hundred thousand yojanas from here, it wouldn't be far away because it's still near and not different from me.",
        "source": "T02n0125_011:0600a07_3"
    },
    {
        "source_sentence": "所以然者，比丘當知，我恒歎譽知返復者，諸有眾生不知反復者，大恩尚不憶，",
        "translation": "For this reason, monks, you should know that I always praise those who return with knowledge and reverence. All living beings who do not know the way to return [to their homeland] will not even remember my great kindness.",
        "source": "T02n0125_011:0600a09_4"
    },
    {
        "source_sentence": "何況小者！",
        "translation": "How much more so when it's small!",
        "source": "T02n0125_011:0600a11_5"
    },
    {
        "source_sentence": "彼非近我，我不近彼，正使著僧伽梨在吾左右，此人猶遠。",
        "translation": "They aren't near me, and I won't be near them. The correct messenger wearing a monk's robe is at my right and left, but this person is still far away.",
        "source": "T02n0125_011:0600a11_6"
    },
    {
        "source_sentence": "所以然者，我恒不說無反復者。",
        "translation": "The reason for this is that I always don't say there's no repetition.",
        "source": "T02n0125_011:0600a12_7"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0600a13_8"
    },
    {
        "source_sentence": "當念反復，莫學無反復。",
        "translation": "You should be mindful of repeating it, and don't train without repeating it.",
        "source": "T02n0125_011:0600a14_0"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0600a14_1"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0600a14_2"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0600a15_3"
    },
    {
        "source_sentence": "（六）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(6) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0600a17_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「若有人懈惰，種不善行，於事有損。",
        "translation": "At the time, the Bhagavān addressed the monks, Suppose someone is lazy and plants unwholesome actions that will harm their business.",
        "source": "T02n0125_011:0600a18_1"
    },
    {
        "source_sentence": "若能不懈惰精進者，此者最妙，於諸善法便有增益。",
        "translation": "If someone can make diligent effort without laziness, this is the most marvelous, and good qualities will increase.",
        "source": "T02n0125_011:0600a19_2"
    },
    {
        "source_sentence": "所以然者，彌勒菩薩經三十劫應當作佛、至真、等正覺，我以精進力、勇猛之心，",
        "translation": "For this reason, Maitreya, for thirty world ages the bodhisattva Maitreya should become buddha, fully awakened and perfectly enlightened.",
        "source": "T02n0125_011:0600a20_3"
    },
    {
        "source_sentence": "使彌勒在後。",
        "translation": "The messenger Maitreya was behind him.",
        "source": "T02n0125_011:0600a22_4"
    },
    {
        "source_sentence": "過去恒沙多薩阿竭、阿羅訶、三耶三佛，皆由勇猛而得成佛。",
        "translation": "In the past, as many buddhas as there are in the sands of the Ganges River, such as Tathāgata, Ārāha, and Samyak-saṃbuddha, all became buddhas because of their courage.",
        "source": "T02n0125_011:0600a22_5"
    },
    {
        "source_sentence": "以此方便，當知懈惰為苦，作諸惡行，於事有損。",
        "translation": "Because of this skillful means, you should know that laziness is painful and that bad actions are done that harm things.",
        "source": "T02n0125_011:0600a24_6"
    },
    {
        "source_sentence": "若能精進勇猛心強，諸善功德便有增益。",
        "translation": "If someone can make effort and have a strong mind, good qualities will increase.",
        "source": "T02n0125_011:0600a25_7"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0600a26_8"
    },
    {
        "source_sentence": "當念精進，勿有懈怠。",
        "translation": "You should be mindful of your effort and not lazy.",
        "source": "T02n0125_011:0600a26_9"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0600a27_10"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0600a27_11"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0600a27_12"
    },
    {
        "source_sentence": "（七）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(7) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0600a29_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「阿練比丘當修行二法。",
        "translation": "It was then that the Bhagavān addressed the monks, The monks of Ārya will cultivate two things.",
        "source": "T02n0125_011:0600b01_1"
    },
    {
        "source_sentence": "云何二法？",
        "translation": "(5) What is the double item?",
        "source": "T02n0125_011:0600b02_2"
    },
    {
        "source_sentence": "所謂止與觀也。",
        "translation": "It's called stopping and observing.",
        "source": "T02n0125_011:0600b02_3"
    },
    {
        "source_sentence": "若阿練比丘得休息止，則戒律成就，不失威儀，不犯禁行，作諸功德。",
        "translation": "If an arhat monk can rest and stop, then the precepts are fulfilled, doesn't lose their manner, doesn't violate the prohibitions, and performs meritorious actions.",
        "source": "T02n0125_011:0600b02_4"
    },
    {
        "source_sentence": "若復阿練比丘得觀已，便觀此苦，如實知之。",
        "translation": "If another monk in a forest attains contemplation, he then observes this suffering and knows it as it really is.",
        "source": "T02n0125_011:0600b04_5"
    },
    {
        "source_sentence": "觀苦習、觀苦盡、觀苦出要，如實知之。",
        "translation": "He observes the accumulation of suffering, observes the extinction of suffering, and observes the essentials of suffering’s escape as they really are.",
        "source": "T02n0125_011:0600b05_6"
    },
    {
        "source_sentence": "彼如是觀已，欲漏心解脫，有漏心、無明漏心得解脫，便得解脫智：生死已盡，",
        "translation": "Having observed them in this way, they are liberated from the mind tainted with attachment to sensual pleasure. The mind tainted with passion and the mind tainted with ignorance are also liberated. Then they attain knowledge of liberation:",
        "source": "T02n0125_011:0600b06_7"
    },
    {
        "source_sentence": "梵行已立，所作已辦，更亦不復受有，如實知之。",
        "translation": "The practice of austerity has been established, what should be done [for religious salvation] has been done. There will no longer be another existence. One knows this as it really is.",
        "source": "T02n0125_011:0600b08_8"
    },
    {
        "source_sentence": "「過去諸多薩阿竭、阿羅訶、三耶三佛，皆由此二法而得成就。",
        "translation": "In the past, many tathāgatas, arhats, and samyak-saṃbuddhas were all accomplished by these two things.",
        "source": "T02n0125_011:0600b09_9"
    },
    {
        "source_sentence": "所以然者，猶如菩薩坐樹王下時，先思惟此法止與觀也。",
        "translation": "It's because it's like when a bodhisattva is sitting under a tree king, he first contemplates this method of calming and observing.",
        "source": "T02n0125_011:0600b10_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩得止已，便能降伏魔怨；",
        "translation": "“If great enlightening beings attain cessation, they will be able to subdue Māra’s enemies.",
        "source": "T02n0125_011:0600b12_11"
    },
    {
        "source_sentence": "若復菩薩得觀已，尋成三達智，成無上至真、等正覺。",
        "translation": "If another bodhisattva has attained contemplation, he'll then attain the three kinds of comprehending cognition and become unsurpassed true and perfectly enlightened.",
        "source": "T02n0125_011:0600b13_0"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0600b14_1"
    },
    {
        "source_sentence": "阿練比丘當求方便，行此二法。",
        "translation": "A monk in a forest should seek skillful means to practice these two things.",
        "source": "T02n0125_011:0600b14_2"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0600b15_3"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0600b15_4"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0600b15_5"
    },
    {
        "source_sentence": "（八）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(8) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0600b17_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「若有阿練比丘在閑靜處，不在眾中，恒當恭敬，",
        "translation": "At that time the World-honored One said to the monks: If an arhat monk is staying in a secluded place and not among the sangha, he should always be treated with reverence.",
        "source": "T02n0125_011:0600b18_1"
    },
    {
        "source_sentence": "發歡喜心。",
        "translation": "He arouses the mind of joy.",
        "source": "T02n0125_011:0600b19_2"
    },
    {
        "source_sentence": "若復阿練比丘在閑靜處，無有恭敬，不發歡喜心，正使在大眾中，為人所論、不知阿練之法，",
        "translation": "“Furthermore, if an Āryan monk stays in a secluded place with no respect or reverence and doesn’t give rise to feelings of joy, then he will surely be discussed by others in the assembly and won’t know the rules of the assembly.",
        "source": "T02n0125_011:0600b19_3"
    },
    {
        "source_sentence": "云：『此阿練比丘無恭敬心，不發歡喜！』",
        "translation": "They say, 'This monk of Ārāḍa doesn't have respect and doesn't rejoice!'",
        "source": "T02n0125_011:0600b22_4"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T02n0125_011:0600b23_0"
    },
    {
        "source_sentence": "阿練比丘在閑靜處，不在眾中，常當精進，莫有懈慢，悉當解了諸法之要。",
        "translation": "A monk in a secluded place, not among the congregation, should always exert effort so that he has no laziness and fully understands the essentials of the teachings.",
        "source": "T02n0125_011:0600b23_1"
    },
    {
        "source_sentence": "若復阿練比丘在閑靜之處，有懈慢心，作諸惡行，彼在眾中，為人所論：『此阿練比丘懈怠，",
        "translation": "Again, if a monk in a secluded place becomes lazy and conceited and engages in evil deeds, that monk will be discussed by others in the assembly as one who is lazy.",
        "source": "T02n0125_011:0600b25_0"
    },
    {
        "source_sentence": "無有精進。』",
        "translation": "There's no effort.'",
        "source": "T02n0125_011:0600b27_1"
    },
    {
        "source_sentence": "是故，比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0600b27_2"
    },
    {
        "source_sentence": "阿練比丘在閑靜處，不在眾中，常當下意發歡喜心，莫有懈慢、無有恭敬，",
        "translation": "The bhikṣu Ālaya stayed in a secluded place, neither among the monks nor among the members of the sangha. He remained humble and joyful; he was neither lazy nor respectful.",
        "source": "T02n0125_011:0600b27_3"
    },
    {
        "source_sentence": "念行精進，意不移轉，於諸善法，悉當具足。",
        "translation": "With mindfulness, effort, and unwavering mind, he'll be fully endowed with all good qualities.",
        "source": "T02n0125_011:0600b29_4"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0600c01_5"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0600c01_6"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0600c02_7"
    },
    {
        "source_sentence": "（九）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(9) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0600c03_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「有二人不能善說法語。",
        "translation": "It was then that the Bhagavān addressed the monks, There are two people who can't speak well.",
        "source": "T02n0125_011:0600c04_1"
    },
    {
        "source_sentence": "云何為二人？",
        "translation": "What are these two?",
        "source": "T02n0125_011:0600c05_2"
    },
    {
        "source_sentence": "無信之人與說信法，此事甚難；",
        "translation": "It is very difficult for someone who lacks faith to teach the doctrine of faith.",
        "source": "T02n0125_011:0600c05_3"
    },
    {
        "source_sentence": "慳貪之人為說施法，此亦甚難。",
        "translation": "It's also very difficult for someone who's stingy and greedy to teach the Dharma of generosity.",
        "source": "T02n0125_011:0600c06_4"
    },
    {
        "source_sentence": "若復，比丘！",
        "translation": "Again, monks!",
        "source": "T02n0125_011:0600c06_5"
    },
    {
        "source_sentence": "無信之人與說信法，便興瞋恚，起傷害心，猶如狗惡，加復傷鼻，倍更瞋恚。",
        "translation": "An unbelieving person who teaches the Dharma to someone with faith becomes angry and harmful, just like a dog that hurts its nose and is doubly angry.",
        "source": "T02n0125_011:0600c07_6"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T02n0125_011:0600c08_7"
    },
    {
        "source_sentence": "此亦如是，無信之人與說信法，便起瞋恚，生傷害心。",
        "translation": "This is also likewise, when an unbelieving person teaches the Dharma to someone who believes it, they become angry and harmful.",
        "source": "T02n0125_011:0600c09_8"
    },
    {
        "source_sentence": "若復，比丘！",
        "translation": "Again, monks!",
        "source": "T02n0125_011:0600c10_9"
    },
    {
        "source_sentence": "慳貪之人與說施法，便生瞋恚，起傷害心，猶如癰瘡未熟，復加刀割，",
        "translation": "When a stingy and greedy person teaches the Dharma to them, they become angry and harmful, just like a sore that has not yet matured and is cut off with a knife.",
        "source": "T02n0125_011:0600c10_10"
    },
    {
        "source_sentence": "痛不可忍。",
        "translation": "The pain can't be tolerated.",
        "source": "T02n0125_011:0600c12_11"
    },
    {
        "source_sentence": "此亦如是，慳貪之人與說施法，倍復瞋恚，起傷害心。",
        "translation": "Similarly, when a person who is stingy and greedy teaches the Dharma with generosity, they become even more angry and give rise to harmful thoughts.",
        "source": "T02n0125_011:0600c12_12"
    },
    {
        "source_sentence": "是謂，比丘！",
        "translation": "This is called that, monk!",
        "source": "T02n0125_011:0600c13_13"
    },
    {
        "source_sentence": "此二人難為說法。",
        "translation": "It's difficult for these two people to teach the Dharma.",
        "source": "T02n0125_011:0600c14_0"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T02n0125_011:0600c14_1"
    },
    {
        "source_sentence": "有二人易為說法。",
        "translation": "There were two people who easily taught the Dharma for him.",
        "source": "T02n0125_011:0600c14_2"
    },
    {
        "source_sentence": "云何為二？",
        "translation": "What are these two?",
        "source": "T02n0125_011:0600c15_3"
    },
    {
        "source_sentence": "有信之人與說信法，不慳貪人與說施法。",
        "translation": "A person with faith teaches the Dharma to someone who believes it, and a person who isn't stingy or greedy teaches the Dharma to someone who gives.",
        "source": "T02n0125_011:0600c15_4"
    },
    {
        "source_sentence": "若，比丘！",
        "translation": "Yes, monks!",
        "source": "T02n0125_011:0600c16_5"
    },
    {
        "source_sentence": "有信之人與說信法，便得歡喜，意不變悔。",
        "translation": "A faithful person who teaches the Dharma to someone who believes in it will be delighted, and his mind won't repent.",
        "source": "T02n0125_011:0600c16_6"
    },
    {
        "source_sentence": "猶如有病之人，與說除病之藥，便得平復。",
        "translation": "It's like when a sick person explains the antidote for illness to someone who's ill, and they'll be cured.",
        "source": "T02n0125_011:0600c17_7"
    },
    {
        "source_sentence": "此亦如是，有信之人與說信法，便得歡喜，心不改變。",
        "translation": "A faithful person who teaches the Dharma to someone who believes in it will be delighted, and his mind won't change.",
        "source": "T02n0125_011:0600c18_8"
    },
    {
        "source_sentence": "若復無貪之人與說施法，即得歡喜，無有悔心。",
        "translation": "If another person who has no craving gives the Dharma to someone who teaches it, they'll be delighted and have no regrets.",
        "source": "T02n0125_011:0600c19_9"
    },
    {
        "source_sentence": "猶如有男女端政，自喜沐浴手面；",
        "translation": "It is just as if a man or woman were to enjoy bathing their hands and faces.",
        "source": "T02n0125_011:0600c20_10"
    },
    {
        "source_sentence": "復有人來，持好華奉上，倍有顏色；",
        "translation": "Again, some people came and presented beautiful flowers to the image, doubling in color.",
        "source": "T02n0125_011:0600c21_11"
    },
    {
        "source_sentence": "復以好衣服飾奉上其人，彼人得已，益懷歡喜。",
        "translation": "Again, he adorned them with beautiful clothing and presented it to their person. Having received it, that person becomes even more joyful.",
        "source": "T02n0125_011:0600c22_12"
    },
    {
        "source_sentence": "此亦如是，無慳貪之人與說施法，便得歡喜，無有悔心。",
        "translation": "This is likewise, when someone who has no stinginess or greed teaches the teaching of generosity to someone, they'll be delighted and have no regrets.",
        "source": "T02n0125_011:0600c23_13"
    },
    {
        "source_sentence": "是謂，比丘！",
        "translation": "This is called that, monk!",
        "source": "T02n0125_011:0600c25_14"
    },
    {
        "source_sentence": "此二人易為說法。",
        "translation": "It's easy for these two people to teach the Dharma.",
        "source": "T02n0125_011:0600c25_15"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0600c25_16"
    },
    {
        "source_sentence": "當學有信，亦當學布施，莫有慳貪。",
        "translation": "You should train in having faith and also train in generosity, not being stingy or greedy.",
        "source": "T02n0125_011:0600c26_17"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0600c26_18"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0600c27_19"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0600c27_20"
    },
    {
        "source_sentence": "（一〇）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(10) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0600c29_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「有二法與凡夫人，得大功德，成大果報，得甘露味，",
        "translation": "At that time the World-honored One said to the bhikṣus: There are two ways in which one can bestow great merit upon an ordinary person and attain a great reward, namely by repaying his virtue with the sweet taste of immortality.",
        "source": "T02n0125_011:0601a01_1"
    },
    {
        "source_sentence": "至無為處。",
        "translation": "He reaches the point of nonexistence.",
        "source": "T02n0125_011:0601a02_2"
    },
    {
        "source_sentence": "云何為二法？",
        "translation": "What are these two things?",
        "source": "T02n0125_011:0601a03_3"
    },
    {
        "source_sentence": "供養父母，是謂二人獲大功德，成大果報。",
        "translation": "Making offerings to their parents means that these two people attain great merit and achieve great rewards.",
        "source": "T02n0125_011:0601a03_4"
    },
    {
        "source_sentence": "若復供養一生補處菩薩，獲大功德，得大果報。",
        "translation": "If they also make offerings to the bodhisattvas in one lifetime, they'll attain great merit and obtain great rewards.",
        "source": "T02n0125_011:0601a04_5"
    },
    {
        "source_sentence": "是謂，比丘！",
        "translation": "This is called that, monk!",
        "source": "T02n0125_011:0601a05_6"
    },
    {
        "source_sentence": "施此二人獲大功德，受大果報，得甘露味，至無為處。",
        "translation": "Giving to these two people will obtain great merit, receive great rewards, and attain the taste of immortality until they reach the unconditioned realm.",
        "source": "T02n0125_011:0601a05_7"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0601a07_0"
    },
    {
        "source_sentence": "常念孝順供養父母。",
        "translation": "He's always mindful of filial piety and offering support to his parents.",
        "source": "T02n0125_011:0601a07_1"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0601a07_2"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0601a08_3"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0601a08_4"
    },
    {
        "source_sentence": "（一一）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(21) Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0601a10_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「教二人作善不可得報恩。",
        "translation": "It was then that the Bhagavān addressed the monks, Teaching two people to do good deeds won't reward them.",
        "source": "T02n0125_011:0601a11_1"
    },
    {
        "source_sentence": "云何為二？",
        "translation": "What are these two?",
        "source": "T02n0125_011:0601a12_2"
    },
    {
        "source_sentence": "所謂父母也。",
        "translation": "They're called parents.",
        "source": "T02n0125_011:0601a12_3"
    },
    {
        "source_sentence": "若復，比丘！",
        "translation": "Again, monks!",
        "source": "T02n0125_011:0601a12_4"
    },
    {
        "source_sentence": "有人以父著左肩上，以母著右肩上，至千萬歲，衣被、飯食、床蓐臥具、病瘦醫藥，",
        "translation": "“Some people put their father on their left shoulder and mother on their right shoulder, reaching the age of ten thousand years with clothing, food, shelter, beds, bedding, and medicine for sickness and thinness.",
        "source": "T02n0125_011:0601a13_0"
    },
    {
        "source_sentence": "即於肩上放於屎溺，猶不能得報恩。",
        "translation": "He then released a drop of excrement over his shoulder, but he still couldn't repay the kindness.",
        "source": "T02n0125_011:0601a14_1"
    },
    {
        "source_sentence": "比丘當知，父母恩重，抱之、育之，隨時將護，不失時節，得見日月。",
        "translation": "The monks should know that their parents are deeply grateful to them, embracing and nurturing them, protecting them at any time and without losing the seasons so that they can see the sun and moon.",
        "source": "T02n0125_011:0601a15_2"
    },
    {
        "source_sentence": "以此方便，知此恩難報。",
        "translation": "Because of this skillful means, he knows that this kindness is difficult to repay.",
        "source": "T02n0125_011:0601a17_3"
    },
    {
        "source_sentence": "是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T02n0125_011:0601a17_4"
    },
    {
        "source_sentence": "當供養父母，常當孝順，不失時節。",
        "translation": "You should make offerings to your parents and always be filial and obedient, not losing time and season.",
        "source": "T02n0125_011:0601a18_5"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0601a19_6"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0601a19_7"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0601a19_8"
    },
    {
        "source_sentence": "（一二）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(12) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0601a21_0"
    },
    {
        "source_sentence": "爾時，尊者槃特告弟朱利槃特曰：「若不能持戒者，還作白衣。」",
        "translation": "It was then that Venerable Pāṇḍulī told his disciple, If you can't observe the precepts, return to white robes.",
        "source": "T02n0125_011:0601a22_1"
    },
    {
        "source_sentence": "是時，朱利槃特聞此語已，便詣祇洹精舍門外立而墮淚。",
        "translation": "After hearing these words, Zhāriputra went to the door of the monastery in Jeta and stood there, shedding tears.",
        "source": "T02n0125_011:0601a23_2"
    },
    {
        "source_sentence": "爾時，世尊以天眼清淨，觀是朱利槃特比丘在門外立，而悲泣不能自勝。",
        "translation": "At the time, the Bhagavān, with his divine eye pure and clear, observed that the monk Jyotipantika was standing outside the door, weeping and unable to overcome himself.",
        "source": "T02n0125_011:0601a24_3"
    },
    {
        "source_sentence": "時，世尊從靜室起，如似經行至祇洹精舍門外，告朱利槃特曰：「比丘！",
        "translation": "The Bhagavān then rose from his secluded room, walked as if he were walking up and down the steps, went outside the entrance of the Jetavana monastery, and told Jyotipantha, Monk!",
        "source": "T02n0125_011:0601a26_4"
    },
    {
        "source_sentence": "何故在此悲泣？」",
        "translation": "Why are you weeping here?",
        "source": "T02n0125_011:0601a28_5"
    },
    {
        "source_sentence": "朱利槃特報曰：「世尊！",
        "translation": "Zhulipan specially reported, Bhagavān!",
        "source": "T02n0125_011:0601a28_6"
    },
    {
        "source_sentence": "兄見驅逐：『若不能持戒者，還作白衣，不須住此。』",
        "translation": "When the brother saw him expelled, he said, 'If you can't observe the precepts, return to your white clothes and don't stay here.'",
        "source": "T02n0125_011:0601a29_7"
    },
    {
        "source_sentence": "是故悲泣耳。」",
        "translation": "That's why weep with pity.",
        "source": "T02n0125_011:0601b01_8"
    },
    {
        "source_sentence": "世尊告曰：「比丘！",
        "translation": "The Bhagavān told him, Monk!",
        "source": "T02n0125_011:0601b01_9"
    },
    {
        "source_sentence": "勿懷畏怖，我成無上等正覺，不由卿兄槃特得道。」",
        "translation": "Don't harbor fear, for I'll become unsurpassed perfect enlightenment without your brother Pāṇḍi attaining the Way.",
        "source": "T02n0125_011:0601b02_0"
    },
    {
        "source_sentence": "爾時，世尊手執朱利槃特詣靜室教使就坐，世尊復教使執掃[打-丁+彗]：「汝誦此字，",
        "translation": "At that time, the World-honored One reached to his seat in a secluded room and asked him to take his seat. The World-honored One again instructed [Dai-ding+Comer], “Please recite this letter:",
        "source": "T02n0125_011:0601b03_1"
    },
    {
        "source_sentence": "為字何等？」",
        "translation": "What's the word for?",
        "source": "T02n0125_011:0601b05_2"
    },
    {
        "source_sentence": "是時，朱利槃特誦得掃，復忘[打-丁+彗]；",
        "translation": "At that time, the venerable Upariṭṭṭha recited a verse to sweep it away and then again forgot [da-ding+comet].",
        "source": "T02n0125_011:0601b05_3"
    },
    {
        "source_sentence": "若誦得[打-丁+彗]，復忘掃。",
        "translation": "If he recites it and gets [da-ding+come], then he forgets to sweep it.",
        "source": "T02n0125_011:0601b06_4"
    },
    {
        "source_sentence": "爾時，尊者朱利槃特誦此掃[打-丁+彗]乃經數日。",
        "translation": "At the time, Venerable Upariṭṭṭha recited this sweeping [da-ding+come] for several days.",
        "source": "T02n0125_011:0601b06_5"
    },
    {
        "source_sentence": "然此掃[打-丁+彗]復名除垢，朱利槃特復作是念：「何者是除？",
        "translation": "Still, this sweeping [da-ding+come] is also called removing dirt, and Juriesan then had another thought, What's removing it?",
        "source": "T02n0125_011:0601b07_6"
    },
    {
        "source_sentence": "何者是垢？",
        "translation": "What's defilement?",
        "source": "T02n0125_011:0601b08_7"
    },
    {
        "source_sentence": "垢者灰土瓦石，除者清淨也。」",
        "translation": "What's dirty is ashes, soil, tiles, and stones, and what's removed is pure.",
        "source": "T02n0125_011:0601b09_8"
    },
    {
        "source_sentence": "復作是念：「世尊何故以此教悔我？",
        "translation": "Again, he thought, Bhagavān, why did you tell me to repent?",
        "source": "T02n0125_011:0601b09_9"
    },
    {
        "source_sentence": "我今當思惟此義。」",
        "translation": "Now, I will contemplate this meaning.",
        "source": "T02n0125_011:0601b10_10"
    },
    {
        "source_sentence": "以思惟此義，復作是念：「今我身上亦有塵垢，我自作喻，何者是除？",
        "translation": "He reflected on this meaning and again thought, Now, there's also dirt in my body, but I myself created a metaphor to remove it.",
        "source": "T02n0125_011:0601b11_11"
    },
    {
        "source_sentence": "何者是垢？」",
        "translation": "What's the defilement?",
        "source": "T02n0125_011:0601b12_12"
    },
    {
        "source_sentence": "彼復作是念：「縛結是垢，智慧是除，我今可以智慧之[打-丁+彗]掃此結縛。」",
        "translation": "Again, he thought, The fetters are the stain, and wisdom is the removal, so now I can sweep away these fetters with the [trance-ding+comet] of wisdom.",
        "source": "T02n0125_011:0601b12_13"
    },
    {
        "source_sentence": "爾時，尊者朱利槃特思惟五盛陰成者、敗者：所謂此色、色習、色滅，",
        "translation": "At that time, the venerable Upariṭṭha meditated on the five flourishing aggregates of becoming and decaying:",
        "source": "T02n0125_011:0601b14_14"
    },
    {
        "source_sentence": "是謂痛、想、行、識，成者、敗者。",
        "translation": "This is called pain, perception, volition, and consciousness, which are formed and decayed.",
        "source": "T02n0125_011:0601b15_15"
    },
    {
        "source_sentence": "爾時，思惟此五盛陰已，欲漏心得解脫，有漏心、無明漏心得解脫。",
        "translation": "At that point, after contemplating these five flourishing aggregates, the contaminated mind of desire is liberated, and the contaminated mind and the contaminated mind of ignorance are liberated.",
        "source": "T02n0125_011:0601b16_16"
    },
    {
        "source_sentence": "已得解脫，便得解脫智：生死已盡，梵行已立，所作已辦，更不復受胎有，",
        "translation": "Having attained liberation, they’ll then attain the knowledge of liberation: birth and death have ended, the holy life has been established, what was to be done has been done. They won’t again experience existence in the womb.",
        "source": "T02n0125_011:0601b18_17"
    },
    {
        "source_sentence": "如實知之。",
        "translation": "Know them as they really are.",
        "source": "T02n0125_011:0601b19_18"
    },
    {
        "source_sentence": "尊者朱利槃特便成阿羅漢。",
        "translation": "Venerable Zhāriputra then became an arhat.",
        "source": "T02n0125_011:0601b20_19"
    },
    {
        "source_sentence": "已成阿羅漢，即從坐起，詣世尊所，頭面禮足，在一面坐。",
        "translation": "Having attained arhatship, he rose from his seat and approached the World-honored One. After bowing his forehead at [the Buddha’s] feet, he sat to one side.",
        "source": "T02n0125_011:0601b20_20"
    },
    {
        "source_sentence": "白世尊曰：「今已有智，今已有慧，今已解掃[打-丁+彗]。」",
        "translation": "He said to the Bhagavān, Now there's wisdom, now there's wisdom, and now there's [ding+comet] that's been removed.",
        "source": "T02n0125_011:0601b22_21"
    },
    {
        "source_sentence": "世尊告曰：「比丘！",
        "translation": "The Bhagavān told him, Monk!",
        "source": "T02n0125_011:0601b23_22"
    },
    {
        "source_sentence": "云何解之？」",
        "translation": "How do you understand it?",
        "source": "T02n0125_011:0601b23_23"
    },
    {
        "source_sentence": "朱利槃特報曰：「除者謂之慧，垢者謂之結。」",
        "translation": "Zhulipan said in a special report, What's removed is called wisdom, and what's dirty is called fetter.",
        "source": "T02n0125_011:0601b23_24"
    },
    {
        "source_sentence": "世尊告曰：「善哉！",
        "translation": "The Bhagavān told him, Good!",
        "source": "T02n0125_011:0601b24_25"
    },
    {
        "source_sentence": "比丘！",
        "translation": "Monks!",
        "source": "T02n0125_011:0601b25_26"
    },
    {
        "source_sentence": "如汝所言，除者是慧，垢者是結。」",
        "translation": "As you say, what's removed is wisdom, and what's defiled is bondage.",
        "source": "T02n0125_011:0601b25_27"
    },
    {
        "source_sentence": "「今誦此已足，　　如尊之所說；",
        "translation": "The present recitation is sufficient, just as Your Reverence has taught.",
        "source": "T02n0125_011:0601b26_28"
    },
    {
        "source_sentence": "　智慧能除結，　　不由其餘行。」",
        "translation": "Wisdom can remove bonds without relying on other actions.",
        "source": "T02n0125_011:0601b26_28"
    },
    {
        "source_sentence": "爾時，尊者朱利槃特向世尊而說此偈：世尊告曰：「比丘！",
        "translation": "At the time, Venerable Zulipantha addressed the Bhagavān and spoke this verse: The Bhagavān told him, Monk!",
        "source": "T02n0125_011:0601b26_28"
    },
    {
        "source_sentence": "如汝所言，以智慧，非由其餘。」",
        "translation": "As you say, it's because of wisdom, not from anything else.",
        "source": "T02n0125_011:0601b29_29"
    },
    {
        "source_sentence": "爾時，尊者聞世尊所說，歡喜奉行。",
        "translation": "At that time, having heard the World-honored One’s exhortation, the venerable one was delighted and remembered it well.",
        "source": "T02n0125_011:0601c01_30"
    },
    {
        "source_sentence": "（一三）聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "(13) Thus I heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T02n0125_011:0601c02_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「有此二法，不可敬待，亦不足愛著，世人所捐棄。",
        "translation": "At the time, the Bhagavān addressed the monks, There are these two things that shouldn't be respected or attached, and they won't be abandoned by the world.",
        "source": "T02n0125_011:0601c03_1"
    },
    {
        "source_sentence": "云何為二法？",
        "translation": "What are these two things?",
        "source": "T02n0125_011:0601c04_2"
    },
    {
        "source_sentence": "怨憎共會，此不可敬待，亦不足愛著，世人所捐棄；",
        "translation": "Enemies and enemies are united together, but they cannot be honored or esteemed by them. They should not be cherished or attached; the world will abandon them.",
        "source": "T02n0125_011:0601c05_0"
    },
    {
        "source_sentence": "恩愛別離，不可敬待，亦不足愛著，世人所捐棄。",
        "translation": "Being separated from kindness and craving, they shouldn't be honored or esteemed, nor should they be loved or attached, which the world abandons.",
        "source": "T02n0125_011:0601c06_1"
    },
    {
        "source_sentence": "是謂，比丘！",
        "translation": "This is called that, monk!",
        "source": "T02n0125_011:0601c07_2"
    },
    {
        "source_sentence": "有此二法，世人所不喜，不可敬待。",
        "translation": "There are these two things that the world doesn't like and shouldn't venerate.",
        "source": "T02n0125_011:0601c07_3"
    },
    {
        "source_sentence": "「比丘！",
        "translation": "Monks!",
        "source": "T02n0125_011:0601c08_4"
    },
    {
        "source_sentence": "復有二法，世人所不棄。",
        "translation": "Again, there are two things that people in the world don't abandon.",
        "source": "T02n0125_011:0601c08_5"
    },
    {
        "source_sentence": "云何為二法？",
        "translation": "What are these two things?",
        "source": "T02n0125_011:0601c09_6"
    },
    {
        "source_sentence": "怨憎別離，世人之所喜；",
        "translation": "Being free of enemies and haters, they are delighted by the world.",
        "source": "T02n0125_011:0601c09_7"
    },
    {
        "source_sentence": "恩愛集一處，甚可愛敬，世人之所喜。",
        "translation": "All kindness and affection are collected in one place, which is very desirable and respected by the people of the world.",
        "source": "T02n0125_011:0601c10_8"
    },
    {
        "source_sentence": "是謂，比丘！",
        "translation": "This is called that, monk!",
        "source": "T02n0125_011:0601c11_0"
    },
    {
        "source_sentence": "有此二法，世人所喜。",
        "translation": "There are these two things that the world delights in.",
        "source": "T02n0125_011:0601c11_1"
    },
    {
        "source_sentence": "「我今說此怨憎共會、恩愛別離；",
        "translation": "“Now, I teach that these enemies are to be united with each other and separated by affection.",
        "source": "T02n0125_011:0601c11_2"
    },
    {
        "source_sentence": "復說怨憎別離、恩愛共會，有何義？",
        "translation": "What does it mean to say that there is separation from one’s enemies and those who hate one another and the convergence of love and affection?",
        "source": "T02n0125_011:0601c12_3"
    },
    {
        "source_sentence": "有何緣？」",
        "translation": "What are the reasons for this?",
        "source": "T02n0125_011:0601c13_4"
    },
    {
        "source_sentence": "比丘報曰：「世尊諸法之王，唯願世尊與我等說，諸比丘聞已，當共奉行。」",
        "translation": "The monks replied, Bhagavān, the king of all dharmas, please let the Bhagavān explain it to us; after hearing it, the monks will serve it together.",
        "source": "T02n0125_011:0601c13_5"
    },
    {
        "source_sentence": "世尊告曰：「諦聽！",
        "translation": "The Bhagavān told him, Listen closely!",
        "source": "T02n0125_011:0601c15_6"
    },
    {
        "source_sentence": "善思念之。",
        "translation": "Consider it well and think of it.",
        "source": "T02n0125_011:0601c15_7"
    },
    {
        "source_sentence": "吾當為汝分別說之。",
        "translation": "I will explain it separately for you.",
        "source": "T02n0125_011:0601c15_8"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T02n0125_011:0601c16_9"
    },
    {
        "source_sentence": "此二法由愛興，由愛生，由愛成，由愛起；",
        "translation": "These two dharmas arise by reason of thirst, they arise by reason of thirst; they are formed by reason of thirst and produced by reason of thirst.",
        "source": "T02n0125_011:0601c16_10"
    },
    {
        "source_sentence": "當學除其愛，不令使生。",
        "translation": "You should train to remove their cravings and not allow them to arise.",
        "source": "T02n0125_011:0601c17_11"
    },
    {
        "source_sentence": "如是，諸比丘！",
        "translation": "So it is, monks!",
        "source": "T02n0125_011:0601c18_0"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T02n0125_011:0601c18_1"
    },
    {
        "source_sentence": "爾時，諸比丘聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well.",
        "source": "T02n0125_011:0601c18_2"
    },
    {
        "source_sentence": "增壹阿含經卷第十一",
        "translation": "Increased by one ahan jing, vol. 11",
        "source": "T02n0125_011:0601c20_0"
    }
]