[
    {
        "source_sentence": "佛說鴦掘摩經",
        "translation": "Aṅgulimālya-sūtra",
        "source": "T02n0118_001:0508b17_0"
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, a translator of the Tripiṭaka of the Western Jin state of Yuezhi",
        "source": "T02n0118_001:0508b19_0"
    },
    {
        "source_sentence": "聞如是：一時，佛遊舍衛國祇樹給孤獨園，與大比丘五百眾俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Sāvatthī, accompanied by five hundred great bhikṣus.",
        "source": "T02n0118_001:0508b20_0"
    },
    {
        "source_sentence": "舍衛城中有異梵志，博綜三經無所疑滯，具暢五典所問即對，精生講肆莫不稟仰，",
        "translation": "In the city of Śrāvastī there was a heretical brahman who had extensive knowledge of the three scriptures and did not have any doubts about them. He mastered all the five kinds of scriptures, and he answered questions in reply to them. All the living beings in the assembly hall revered this brahman.",
        "source": "T02n0118_001:0508b21_1"
    },
    {
        "source_sentence": "國老諮諏群儒宗焉，門徒濟濟有五百人。",
        "translation": "The old ministers of the state consulted with Confucian scholars and there were five hundred disciples named Jiji.",
        "source": "T02n0118_001:0508b23_2"
    },
    {
        "source_sentence": "上首弟子名鴦掘摩(晉曰指鬘)，儀幹剛猛力超壯士，手能接飛走先奔馬，",
        "translation": "The chief disciple named Aṅgulimālya (known as Zhixiang in the Jin dynasty) was a strong and vigorous man of great strength. His hands were capable of catching up with flying, running, and galloping horses before he could do so.",
        "source": "T02n0118_001:0508b24_3"
    },
    {
        "source_sentence": "聰慧才辯志性和雅，安詳敏達一無疑礙，色像第一師所嘉異。",
        "translation": "He was wise and eloquent, of lofty aspiration and refined characteristics. His manner was peaceful and quick-witted; he had no doubts or hindrances in his intellect. Form and shape were all marveled at by the Master.",
        "source": "T02n0118_001:0508b25_4"
    },
    {
        "source_sentence": "室主欽敬候夫出處，往造指鬘而謂之曰：「觀爾顏彩有堂堂之容，推步年齒相覺不殊，",
        "translation": "The lord of the monastery respectfully waited for the Master to come out and said to him, “I see that you have a dignified countenance with an elegant appearance. You are not different in age or teeth from me.",
        "source": "T02n0118_001:0508b27_5"
    },
    {
        "source_sentence": "寧可同歡接所娛乎！」",
        "translation": "How could we all rejoice and enjoy what we're enjoying?",
        "source": "T02n0118_001:0508b29_6"
    },
    {
        "source_sentence": "指鬘聞之慞惶怖懼，毛衣起竪跪而答曰：「夫人比母師則當父，猥垂斯教儀不敢許，",
        "translation": "Hearing this, the monk was frightened and panic-stricken. Kneeling with his hairy clothes on his knees, he said in reply, “If a wife is inferior to her mother’s teacher, she should be like my father. I am unworthy of tolerating such behavior.",
        "source": "T02n0118_001:0508b29_7"
    },
    {
        "source_sentence": "心所不甘甚非法也。」",
        "translation": "What the mind doesn't approve of is quite unlawful.",
        "source": "T02n0118_001:0508c02_8"
    },
    {
        "source_sentence": "師婦又曰：「飢者與食、渴給水漿，有何非法？",
        "translation": "The teacher and wife also said, What's wrong with a hungry man who gives food or water and juice to someone who's thirsty?",
        "source": "T02n0118_001:0508c02_9"
    },
    {
        "source_sentence": "寒施溫衣、熱惠清涼，有何非法？",
        "translation": "What's wrong with cold giving, warm clothing, hot wisdom, and coolness?",
        "source": "T02n0118_001:0508c03_10"
    },
    {
        "source_sentence": "裸露覆之、危厄救之，有何非法？」",
        "translation": "What's wrong with covering them naked and saving them from danger?",
        "source": "T02n0118_001:0508c04_11"
    },
    {
        "source_sentence": "指鬘答曰：「赴趣患急寬濟窮頓，實無非法。",
        "translation": "He pointed to the monk and replied, There's really no unlawfulness in going to a place where there's an urgent need to rescue someone who's exhausted.",
        "source": "T02n0118_001:0508c05_12"
    },
    {
        "source_sentence": "夫人母也，師之所重，隨婬著色慢犯非宜，如蛇蝘體服毒褒。」",
        "translation": "It's also the mother of a woman, and it's not appropriate for a teacher to be deceived by anger or pride in sexual behavior like a snake that feeds on poisonous praise.",
        "source": "T02n0118_001:0508c06_13"
    },
    {
        "source_sentence": "師室聞之即懷愧恨，歸自總滅裂衣裳，欝金黃面佯愁委臥。",
        "translation": "When the teacher's room heard this, he felt ashamed and resented it, returned to his own place, cut off his robes and clothes, covered his gold and yellow face, and lay down with sadness.",
        "source": "T02n0118_001:0508c07_14"
    },
    {
        "source_sentence": "時，夫行還，問曰：「何故，有何不善？",
        "translation": "When the monk returned, he asked, Why is there anything unwholesome?",
        "source": "T02n0118_001:0508c09_15"
    },
    {
        "source_sentence": "誰相嬲觸？」",
        "translation": "Who are they touching each other?",
        "source": "T02n0118_001:0508c09_16"
    },
    {
        "source_sentence": "室人譖曰：「君常所歎聰慧弟子，柔仁貞潔履行無闕，君旦不在來見牽掣，",
        "translation": "The monks of the monastery said in reply, “You are always praised as a learned disciple who is gentle, kind, pure, and impeccably virtuous. Your presence at dawn does not deprive you of the opportunity to receive your instructions.",
        "source": "T02n0118_001:0508c10_17"
    },
    {
        "source_sentence": "欲肆逆慢妾不順從，而被陵侮摧捽委頓，是以受辱不能自起。」",
        "translation": "They want to harm the conceited concubine and disobey her, but they're humiliated and deceived, so they can't get up on their own because of being humiliated.",
        "source": "T02n0118_001:0508c11_18"
    },
    {
        "source_sentence": "師聞悵然意懷盛怒，欲加楚罰掠治姦暴，慮之雄霸非力所伏，退欲靜默深惟不道，",
        "translation": "When the Master heard this, he was disheartened and angry. Wishing to punish him with cruel punishment or punishment, he plundered and committed sexual misconduct. Fearing that his lord would not be able to subdue him by force, he withdrew in fear and remained quiet and deeply silent, thinking only of what he did not say.",
        "source": "T02n0118_001:0508c13_19"
    },
    {
        "source_sentence": "穢染閨閤上下失序，進退沈吟將如之何？",
        "translation": "What's the order of defilement in the chamber and up and down that's lost, and what's the order of advancement and retreat and sinking?",
        "source": "T02n0118_001:0508c15_20"
    },
    {
        "source_sentence": "乃咿悒歎曰：「當微改常倒教而教，教使殺人限至于百，各貫一指以鬘其額。",
        "translation": "He then praised the brahman, saying, I will change my ways slightly and always teach them in error, so that they can kill as many people as a hundred, each with one finger pointing at their foreheads.",
        "source": "T02n0118_001:0508c16_21"
    },
    {
        "source_sentence": "殺人之罪罪莫大焉！",
        "translation": "There's no greater sin than the sin of killing people!",
        "source": "T02n0118_001:0508c17_22"
    },
    {
        "source_sentence": "不加楚酷必就辜戮，現受危沒，沒墮地獄，不可釋置縱使滋甚也。」",
        "translation": "If they aren't subject to cruelty, they'll surely be killed. They'll now experience danger and fall into hell, and they won't be released or imprisoned, even if they do so in order to increase their prosperity.",
        "source": "T02n0118_001:0508c18_23"
    },
    {
        "source_sentence": "於是，師命指鬘而告曰：「卿之聰慧所學周密，升堂入室精生無首，唯之一藝未施行耳。」",
        "translation": "Then, the teacher ordered him to point fingers and tell them, Your wiseness is so esoteric that you go up to the hall and enter the room; there's no head in the spirit of enlightenment but a single skill that hasn't been practiced.",
        "source": "T02n0118_001:0508c20_0"
    },
    {
        "source_sentence": "指鬘進曰：「願聞所告。」",
        "translation": "He pointed to Zhixian and said, May I hear what you've told me?",
        "source": "T02n0118_001:0508c22_0"
    },
    {
        "source_sentence": "師曰：「欲速成者宜執利劍，晨於四衢躬殺百人，人取一指以為傅飾，",
        "translation": "The teacher said, “Those who want to quickly achieve it should take sharp swords and kill a hundred people at the four quarters in the morning.",
        "source": "T02n0118_001:0508c22_1"
    },
    {
        "source_sentence": "至于日中使百指滿。",
        "translation": "In the middle of the day, he makes a hundred fingers full.",
        "source": "T02n0118_001:0508c24_2"
    },
    {
        "source_sentence": "設勤奉遵，則道德備矣。」",
        "translation": "If you diligently follow it, your morality will be complete.",
        "source": "T02n0118_001:0508c24_3"
    },
    {
        "source_sentence": "便以劒授。",
        "translation": "He then gave it to him with a bow.",
        "source": "T02n0118_001:0508c25_4"
    },
    {
        "source_sentence": "指鬘受劍聞告愕懼，心懷愁慼：「設違教旨非孝弟子，順而行之畏陷失理。」",
        "translation": "He was frightened when he heard the sword pointed at his fingers and received it, and became sad in his heart, Suppose someone who disobeyed the teaching or wasn't a filial disciple and practiced accordingly is afraid of falling into error.",
        "source": "T02n0118_001:0508c25_5"
    },
    {
        "source_sentence": "奉劍而退垂淚言曰：「淨修梵行則梵志法，孝養父母則梵志法，修為眾善則梵志法，",
        "translation": "He honored his sword and withdrew, weeping in tears, saying, “The practice of pure austerity is the way to become a brahmin. Being filial to one’s parents is the way to become a brahmin. Cultivating wholesomeness is the way to become a brahmin.",
        "source": "T02n0118_001:0508c27_6"
    },
    {
        "source_sentence": "不邪正歸則梵志法，柔和仁惠則梵志法，弘慈四等則梵志法，得五神通則梵志法，",
        "translation": "The doctrine of brahminhood is based on non-wickedness and righteousness; the doctrine of brahminhood is based on gentleness and benevolence; the doctrine of brahminhood is based on the four principles of kindness; the doctrine of brahminhood is based on the attainment of the five transcendent powers;",
        "source": "T02n0118_001:0508c28_7"
    },
    {
        "source_sentence": "超上梵天則梵志法。",
        "translation": "To transcend the higher Brahma heavens, it's the teaching of the priest.",
        "source": "T02n0118_001:0509a01_8"
    },
    {
        "source_sentence": "今暴伐殺非法失理，躊躇懊惱當如之何？」",
        "translation": "What's the point of being reluctant and distressed to do so now that you've violated the law by violently attacking someone who kills?",
        "source": "T02n0118_001:0509a02_9"
    },
    {
        "source_sentence": "即詣前樹四衢路側，悲怒激憤。",
        "translation": "He then went to the side of the four roads in front of the tree and became angry and saddened.",
        "source": "T02n0118_001:0509a03_10"
    },
    {
        "source_sentence": "惡鬼助禍，耗亂其心，瞋目噴吒四顧遠視，如鬼師子，如虎狼獸，跳騰馳踊，",
        "translation": "Bad spirits help harm them and disturb their minds. Their angry eyes are like lion beasts, hungry ghosts, lions, tigers, wolves, and animals jumping and chasing after each other.",
        "source": "T02n0118_001:0509a04_11"
    },
    {
        "source_sentence": "色貌可畏。",
        "translation": "Their appearance is fearsome.",
        "source": "T02n0118_001:0509a05_12"
    },
    {
        "source_sentence": "行者四集，悉當趣城，即奮長劍多所殺害，莫不迸怖值無遺脫，去來往返而無覺者。",
        "translation": "The practitioners of the fourfold assembly all headed for the city, where they raised their long swords and killed many people. None of them burst into flames and fled in fear, leaving nothing to be done. They came and went back and forth but there was no one who could awaken.",
        "source": "T02n0118_001:0509a06_0"
    },
    {
        "source_sentence": "無數之眾稱怨悲叫，入趣王宮告：「有逆賊，遮截要路害人不少，唯願天王，",
        "translation": "Countless multitudes cried out in distress and went into the king’s palace to report, “There is a heinous band of robbers who have blocked the road leading up to the harmful place. May your majesty!",
        "source": "T02n0118_001:0509a07_1"
    },
    {
        "source_sentence": "為民除患。」",
        "translation": "It's for the sake of the people to remove their afflictions.",
        "source": "T02n0118_001:0509a09_2"
    },
    {
        "source_sentence": "時諸比丘入城分衛，見諸告者恐怖如是。",
        "translation": "The monks then entered the city's quarters to guard it, and when they saw the tellers, they were so frightened.",
        "source": "T02n0118_001:0509a09_3"
    },
    {
        "source_sentence": "分衛還出飯食畢訖，往詣佛所稽首足下白世尊曰：「見國人眾詣王宮門，",
        "translation": "After he had finished his meal, Pūrvavideha went to the place where the Buddha was. He bowed his head at the Buddha’s feet and said to the World-honored One: I see that the citizens of my country are approaching the entrance of the royal palace.",
        "source": "T02n0118_001:0509a10_4"
    },
    {
        "source_sentence": "告大逆賊名曰指鬘，手執利劍多所危害，體掌污血路無行人。」",
        "translation": "He told the great heinous thief named fingernail, who held a sharp sword in his hand and was often harmful, with his palm dirty and bloody body without a practitioner.",
        "source": "T02n0118_001:0509a12_5"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「汝等且止，吾往救之。」",
        "translation": "It was then that the Bhagavān addressed the monks, All of you, stop right here; I'll go and rescue him.",
        "source": "T02n0118_001:0509a14_0"
    },
    {
        "source_sentence": "佛從坐起尋到其所，道逢蒭牧荷負載乘。",
        "translation": "When the Buddha rose from his seat and went to where he was, he found a cart carrying a load of cow dung and milk.",
        "source": "T02n0118_001:0509a14_1"
    },
    {
        "source_sentence": "佃居民眾白世尊曰：「大聖所湊勿由斯路，前有逆賊四徼道斷，取殺狼藉，",
        "translation": "The tenants and householders of the monastery said to the World-honored One, “Do not go down this road where the Great Sage resides.",
        "source": "T02n0118_001:0509a15_2"
    },
    {
        "source_sentence": "唯改所從，又且獨步無侍衛故也。」",
        "translation": "They simply change their place of departure, and they're walking alone without an attendant to guard them.",
        "source": "T02n0118_001:0509a17_3"
    },
    {
        "source_sentence": "世尊告曰：「設使三界盡為寇虜，吾不省錄，況一賊乎？」",
        "translation": "The Bhagavān told him, Suppose the three realms are all invaded and taken prisoner, and I don't record it, so why wouldn't I record it as a thief?",
        "source": "T02n0118_001:0509a18_4"
    },
    {
        "source_sentence": "指鬘之母怪子不歸，時至不食，懼必當飢。",
        "translation": "Their fingers touched each other and the mother wondered if she hadn't returned. When she arrived, she didn't eat, fearing that she would surely starve.",
        "source": "T02n0118_001:0509a19_5"
    },
    {
        "source_sentence": "齎餉出城，就而餉之。",
        "translation": "He brought the food out of the city and offered it to him.",
        "source": "T02n0118_001:0509a20_6"
    },
    {
        "source_sentence": "日欲向中百指未滿，恐日移昳，道業不具，欲還害母以充其數。",
        "translation": "When the sun was about to rise and his fingers were less than a hundred inches in diameter, he feared that the sun would move his calf. He was not endowed with religious activities and wished to return home so as to kill his mother to satisfy his number.",
        "source": "T02n0118_001:0509a20_7"
    },
    {
        "source_sentence": "佛念：「指鬘若害母者，在不中止罪不可救。」",
        "translation": "The Buddha thought, If someone were to point fingers at a woman who harmed their mother, they wouldn't be able to save them if they didn't stop the sin.",
        "source": "T02n0118_001:0509a22_8"
    },
    {
        "source_sentence": "佛便怱然住立其前，時，鴦掘摩見佛捨母，如師子步往迎世尊，心自念言：「十人百人見我馳迸，",
        "translation": "The Buddha then stood in front of him. When Aṅgulimālya saw the Buddha leaving his mother’s house, he looked as if a lion was walking on foot to greet the World-honored One. He thought to himself, Ten people and one hundred others saw me burst into flames.",
        "source": "T02n0118_001:0509a23_9"
    },
    {
        "source_sentence": "不敢當也，吾常奮威縱橫自恣，況此沙門獨身而至？",
        "translation": "I don't dare to do so; I always arouse my authority and indulge in self-restraint, so why wouldn't this ascetic come alone?",
        "source": "T02n0118_001:0509a25_10"
    },
    {
        "source_sentence": "今我規圖必勦其命。」",
        "translation": "Now, my rules and regulations will surely deceive their lives.",
        "source": "T02n0118_001:0509a26_11"
    },
    {
        "source_sentence": "即執劍趣佛，不能自前，竭力奔走亦不能到，則心念曰：「我跳度江河解諸繫縛，",
        "translation": "He then held his sword and went to the Buddha but could not advance.",
        "source": "T02n0118_001:0509a27_12"
    },
    {
        "source_sentence": "投捭勇猛曾無匹敵，重關固塞無不開闔。",
        "translation": "He was unrivaled in the bravery and heroic strength of his troops. The heavy barriers were strong, and none of the strong walls did not open or close.",
        "source": "T02n0118_001:0509a28_13"
    },
    {
        "source_sentence": "而此沙門徐步裁動，我走不及，殫盡威勢永不摩近。」",
        "translation": "This ascetic walks slowly and steadfastly, but I can't get close to him because of my lack of authority.",
        "source": "T02n0118_001:0509a29_14"
    },
    {
        "source_sentence": "指鬘謂佛：「沙門且止。」",
        "translation": "He pointed to the monk and said to the Buddha, As a monk, please stop.",
        "source": "T02n0118_001:0509b02_0"
    },
    {
        "source_sentence": "佛告逆賊：「吾止已來其日久矣，但汝未止。」",
        "translation": "The Buddha told the rebellious thief, It's been a long time since I stopped, but you haven't stopped.",
        "source": "T02n0118_001:0509b02_1"
    },
    {
        "source_sentence": "「寂志語何謂，　　自云已停跱？",
        "translation": "What's the meaning of the words of a renunciant who says, 'I've stopped waking up?'",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　斯言何所趣，　　以我為不止。",
        "translation": "What's the point of this statement, which doesn't stop with self?",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　今佛云何立，　　謂身行不住，",
        "translation": "How does the Buddha now establish that bodily action doesn’t abide?",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　反以我若茲，　　願說解此義。」",
        "translation": "Instead, it's because I want to explain this meaning here.",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "「指鬘聽佛住，　　世尊除君過，",
        "translation": "Having pointed to the Buddha’s abode, The World-honored One has removed all your faults.",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　汝走無智想，　　吾定爾不止。",
        "translation": "You walk around with no thoughts of wisdom, and I certainly won't stop.",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　吾安住三脫，　　樂法修梵行，",
        "translation": "I abide in the three liberations, delighting in the Dharma and cultivating religious practice.",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　汝獨驅癡想，　　懷害今未止。",
        "translation": "You alone drive away the thoughts of delusion, harboring harm that has yet to stop.",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　大聖無極慧，　　讚寂於四衢，",
        "translation": "The great sage of infinite wisdom Praises tranquility in the four quarters.",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "　尋聞所說罪，　　聽采詠法義。」",
        "translation": "Seeking to hear the offense explained, he listens to the meaning of the teaching and sings it.",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "時，鴦掘摩遙以偈頌曰：於是世尊為指鬘頌偈，而告之曰：於是，指鬘心即開悟，",
        "translation": "Āṅgulimālīya then spoke these verses from a distance: Then the World-honored One pointed out [to Aṅgulimālīya] in verse and said to him:",
        "source": "T02n0118_001:0509b03_2"
    },
    {
        "source_sentence": "棄劍稽首自投于地：「唯願世尊，恕我迷謬，興害集指，念欲見道。",
        "translation": "They abandoned their swords, bowed their heads, and prostrated themselves on the ground. “May the World-honored One forgive my misdeeds! I beg you, O World-honored One, to harm me so many fingers that I am anxious to see the [Buddhist] Way.",
        "source": "T02n0118_001:0509b15_3"
    },
    {
        "source_sentence": "僥賴慈化，乞原罪舋，垂哀接濟，得使出家受成就戒。」",
        "translation": "I'm grateful to you for your compassionate transformation, which begs for the original sin and pityingly takes pity on him so that he can leave home and receive the accomplished precepts.",
        "source": "T02n0118_001:0509b16_4"
    },
    {
        "source_sentence": "佛則授之即為沙門。",
        "translation": "The Buddha then gave it to him as an ascetic.",
        "source": "T02n0118_001:0509b18_5"
    },
    {
        "source_sentence": "爾時，世尊威神巍巍，智慧光明結加趺坐，賢者指鬘翼從左右，還至祇樹給孤獨園。",
        "translation": "At the time, the Bhagavān was so imposing and majestic that he sat cross-legged with his wisdom and light. The good man pointed to Śāriputra and left him, and returned to Anāthapiṇḍika's Park in Jeta Grove.",
        "source": "T02n0118_001:0509b19_0"
    },
    {
        "source_sentence": "指鬘蒙化眾祐所信，諸尊弟子亦共攝持。",
        "translation": "He pointed to the fact that he had been taught by the gods and believed in them, and the venerable disciples also shared his support.",
        "source": "T02n0118_001:0509b20_1"
    },
    {
        "source_sentence": "其族姓子，下鬚髮者則被法服，以家之信捨家為道，具足究竟無上梵行，",
        "translation": "Their clansmen, bearing the hair on their lower beards, were dressed in religious robes and renounced the householder’s life because they believed in the path of religion. They perfected the practice of unexcelled austerity.",
        "source": "T02n0118_001:0509b21_2"
    },
    {
        "source_sentence": "得六通證生死已斷。",
        "translation": "He attains the six supernormal powers and realizes that birth and death have been stopped.",
        "source": "T02n0118_001:0509b23_3"
    },
    {
        "source_sentence": "稱舉淨德，所作已辦，解名色本，即得應真。",
        "translation": "He praises pure virtue, accomplishes what he's done, understands the source of name-and-form, and then attains its true meaning.",
        "source": "T02n0118_001:0509b24_4"
    },
    {
        "source_sentence": "時，王波私匿(晉號和悅)，與四部眾象馬步騎，嚴駕出征欲討穢逆，",
        "translation": "At that time the king Prasenajit (known as Vātsīputrīya in the Jin dynasty) and his fourfold assembly, elephants, horses, chariots, and infantry were coming out to battle against the defilements.",
        "source": "T02n0118_001:0509b26_0"
    },
    {
        "source_sentence": "其身疲弊而被塵土，過詣佛所稽首足下。",
        "translation": "His body was exhausted and covered with dirt, and when he went to the Buddha's place, he bowed his head at his feet.",
        "source": "T02n0118_001:0509b27_1"
    },
    {
        "source_sentence": "佛問王曰：「從何所來身被塵土？」",
        "translation": "The Buddha asked the king, Where did his body come from to be covered with dirt?",
        "source": "T02n0118_001:0509b28_2"
    },
    {
        "source_sentence": "王白佛言：「唯然，世尊！",
        "translation": "The king said to the Buddha, Yes, Bhagavān!",
        "source": "T02n0118_001:0509b29_0"
    },
    {
        "source_sentence": "有大逆賊名鴦掘摩，兇暴懷害斷四徼道，手執嚴刃傷殺人民，今故匡勒四部之眾，",
        "translation": "There was a great treacherous thief named Aṅgulimālya, who was fierce and harbored violence. He cut off the four branches of the Four Noble Truths (i.e., the Mahāprajñāpāramitā-sūtra) and struck the people with an iron sword in his hand.",
        "source": "T02n0118_001:0509b29_1"
    },
    {
        "source_sentence": "欲出討捕。」",
        "translation": "I want to go out and capture him.",
        "source": "T02n0118_001:0509c02_2"
    },
    {
        "source_sentence": "是時，指鬘在於會中，去佛不遠，佛告王曰：「指鬘在此，已除鬚髮今為比丘，",
        "translation": "Not far from the Buddha, he said to the king, “I am here. I have already shaved my hair and beard so as to become a bhikṣu.",
        "source": "T02n0118_001:0509c02_3"
    },
    {
        "source_sentence": "本與云何？」",
        "translation": "What's the original?",
        "source": "T02n0118_001:0509c04_4"
    },
    {
        "source_sentence": "王白佛言：「已志于道無如之何，當盡形壽給其衣食、臥起床坐、病瘦醫藥。」",
        "translation": "The king said to the Buddha, There's nothing like this for someone who has set out for the path and will give them food and clothing, bedding, rising and sitting, and medicine for illness and thinness for the rest of their life.",
        "source": "T02n0118_001:0509c04_5"
    },
    {
        "source_sentence": "又問世尊：「唯然大聖，凶害逆人焉得至道履行寂義乎！",
        "translation": "Again, he asked the Bhagavān, Yes, great sage, how could a fierce person who harms others attain the ultimate path and fulfill the meaning of quiescence?",
        "source": "T02n0118_001:0509c06_6"
    },
    {
        "source_sentence": "今為安在？」",
        "translation": "Now, is it settled?",
        "source": "T02n0118_001:0509c07_7"
    },
    {
        "source_sentence": "佛告王曰：「近在斯坐。」",
        "translation": "The Buddha told the king, He's sitting here now.",
        "source": "T02n0118_001:0509c07_8"
    },
    {
        "source_sentence": "王遙見之，心即懷懼衣毛為竪。",
        "translation": "Seeing them from a distance, the king was frightened and his hair stood on end in fear.",
        "source": "T02n0118_001:0509c08_9"
    },
    {
        "source_sentence": "佛言：「大王！",
        "translation": "The Buddha said, Great king!",
        "source": "T02n0118_001:0509c08_10"
    },
    {
        "source_sentence": "莫恐莫懅！",
        "translation": "Don't be afraid, and don't get angry!",
        "source": "T02n0118_001:0509c09_11"
    },
    {
        "source_sentence": "今以仁賢無復逆意。」",
        "translation": "Now, it's because kindness and goodness don't have any further adverse intentions.",
        "source": "T02n0118_001:0509c09_12"
    },
    {
        "source_sentence": "王造禮之謂曰：「賢者！",
        "translation": "The king paid homage to him and said, Good man!",
        "source": "T02n0118_001:0509c09_13"
    },
    {
        "source_sentence": "是指鬘乎？」",
        "translation": "Is is it a dispute?",
        "source": "T02n0118_001:0509c10_14"
    },
    {
        "source_sentence": "答曰：「是也。」",
        "translation": "He replied, Yes.",
        "source": "T02n0118_001:0509c10_15"
    },
    {
        "source_sentence": "王又問曰：「仁姓為何？」",
        "translation": "The king also asked, What's your family name?",
        "source": "T02n0118_001:0509c11_0"
    },
    {
        "source_sentence": "曰：「奇角氏。」",
        "translation": "He said, That's a strange horn family.",
        "source": "T02n0118_001:0509c11_1"
    },
    {
        "source_sentence": "又問：「何謂奇角氏？」",
        "translation": "Again, he asked, What's the name of the奇角 family?",
        "source": "T02n0118_001:0509c11_2"
    },
    {
        "source_sentence": "曰：「父本姓。」",
        "translation": "He said, My father's original family name.",
        "source": "T02n0118_001:0509c12_3"
    },
    {
        "source_sentence": "王曰：「唯奇角子受吾供養，衣食、床臥、病瘦醫藥各盡形壽。」",
        "translation": "The king said, Only the Marvelous horned boy accepted my offerings, and his clothing, food, bedding, and medicine for illness and thinness all ended their lives.",
        "source": "T02n0118_001:0509c12_4"
    },
    {
        "source_sentence": "即然所供，王以獲許稽首辭還，歎世尊曰：「能調諸不調，能成諸未成，",
        "translation": "Having accepted the offering, the king bowed his head in respect and departed. He praised the World-honored One, saying:",
        "source": "T02n0118_001:0509c13_5"
    },
    {
        "source_sentence": "安住垂大慈，無所不開道，消伏患逆使充法會，亦令黎庶逮斯調定，我國多事意欲請退。」",
        "translation": "Abiding peacefully and with great kindness, there's nothing that doesn't give rise to the path, subduing afflictions and enabling them to fulfill the Dharma assembly, causing the common people to gain control of their regulation, and my country has many things to do in order to ask for withdrawal.",
        "source": "T02n0118_001:0509c15_6"
    },
    {
        "source_sentence": "佛告：「便去，從志所奉。」",
        "translation": "The Buddha told him, Go away and follow what you wish to serve.",
        "source": "T02n0118_001:0509c17_7"
    },
    {
        "source_sentence": "王禮佛足稽首而歸。",
        "translation": "The king bowed his head at the Buddha’s feet and withdrew.",
        "source": "T02n0118_001:0509c17_8"
    },
    {
        "source_sentence": "爾時，賢者指鬘，處於閑居服五納衣，明旦持鉢入舍衛城普行分衛，見有諸家懷妊女人，",
        "translation": "At that time the venerable monk, wearing the five kinds of undergarments, took his bowl into Śrāvastī in the morning and entered the city to distribute among the householders.",
        "source": "T02n0118_001:0509c19_0"
    },
    {
        "source_sentence": "月滿產難心歸怙之。",
        "translation": "When the moon is full, it's difficult to rely on him.",
        "source": "T02n0118_001:0509c21_0"
    },
    {
        "source_sentence": "問指鬘曰：「欲何至趣唯蒙救濟。」",
        "translation": "He asked Zhiqian, Where do you want to go? he said, Only to be rescued.",
        "source": "T02n0118_001:0509c21_1"
    },
    {
        "source_sentence": "指鬘得供出城食畢，澡竟去器獨坐加敬，詣佛稽首白世尊曰：「我朝晨旦著衣持鉢入城分衛，",
        "translation": "When the food had been served, he went out of the city and withdrew to his almsbowl. After having bathed, he left the almsbowl and sat alone in respect. He approached the Buddha [and] bowed his head at the feet of the Buddha and said to the World-honored One: “Early this morning I put on my robes, took my bowl,",
        "source": "T02n0118_001:0509c22_2"
    },
    {
        "source_sentence": "見有女人臨月欲產，產難恐懼求見救護。」",
        "translation": "Seeing a woman about to give birth in the moon, she's afraid of giving birth and seeks protection.",
        "source": "T02n0118_001:0509c24_3"
    },
    {
        "source_sentence": "佛告指鬘：「汝便速往謂女人曰：『如指鬘言至誠不虛，從生已來未嘗殺生，",
        "translation": "The Buddha said to Śāriputra, “Go quickly and tell the woman, ‘Suppose you speak sincerely like Śāriputra’s fingernails.",
        "source": "T02n0118_001:0509c25_4"
    },
    {
        "source_sentence": "審如是者，姊當尋生安隱無患。』」",
        "translation": "If you judge it like this, your sister will be born in peace and without trouble.'",
        "source": "T02n0118_001:0509c27_0"
    },
    {
        "source_sentence": "指鬘白佛：「我作眾罪不可稱計，殺九十九人一不滿百，而發此言，豈非兩舌乎？」",
        "translation": "He pointed to the monk and said to the Buddha, I committed numerous sins that can't be counted, killing ninety-nine people for less than a hundred but saying these words, isn't it just duplicitous speech?",
        "source": "T02n0118_001:0509c27_1"
    },
    {
        "source_sentence": "世尊告曰：「前生異世今生不同，是則至誠不為妄語，如斯用時救彼女厄。」",
        "translation": "The Bhagavān told her, If someone was born in a different world in the past and isn't born here now, then they were sincere and didn't speak falsely; thus, they used this time to save her from trouble.",
        "source": "T02n0118_001:0509c29_2"
    },
    {
        "source_sentence": "即奉聖旨往到女所，如佛言曰：「如我至誠所言不虛，從生以來未曾殺生，",
        "translation": "Then, following the holy decree, he went to the queen’s house. As the Buddha had said, “As I speak with utmost sincerity and not falsely, I have never killed a living being since my birth.",
        "source": "T02n0118_001:0510a02_3"
    },
    {
        "source_sentence": "審如是者，當令大姊安隱在產。」",
        "translation": "If you judge it like this, you'll make sure that the big sister is safely in the womb.",
        "source": "T02n0118_001:0510a03_4"
    },
    {
        "source_sentence": "所言未竟，女尋娩軀兒亦獲安。",
        "translation": "Before he finished speaking, the woman searched and gave birth to a body that was also peaceful.",
        "source": "T02n0118_001:0510a04_5"
    },
    {
        "source_sentence": "爾時，指鬘入舍衛城，群小童黻見之分衛，或瓦石擲、或以箭射、或刀斫刺、或杖捶擊。",
        "translation": "At the time, he entered Śrāvastī with his fingers pointing into the city of Śrāvastī, where a group of children saw him and partially guarded him, either tossed by tile or stone, shot with an arrow, stabbed with a sword, or beaten with a stick.",
        "source": "T02n0118_001:0510a06_0"
    },
    {
        "source_sentence": "「我前本為賊，　　指鬘名普聞，",
        "translation": "In the past I was originally a thief, pointing out and scolding people with names that are universally heard.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　大淵以枯竭，　　則歸命正覺。",
        "translation": "Because the great abyss has dried up, he then returns to the right awakening.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　斯以成忍辱，　　逮佛開化眾，",
        "translation": "Because of this, they attain forbearance and Attain the Buddha’s enlightenment.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　聽經常以時，　　是故無躓礙。",
        "translation": "Their hearing is always at the right time; Therefore they are not disturbed by any hindrance.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　今已歸命佛，　　受真諦法戒，",
        "translation": "I now pay homage to the Buddha and accept the true truth of the Dharma precepts.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　逮得三通達，　　則順諸佛教。",
        "translation": "Attaining the three supernormal knowledges, he follows the teachings.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　昔暴懷兇毒，　　多傷眾類命，",
        "translation": "In the past I harbored ferocious thoughts of cruelty and poison, often injuring the lives of all living beings.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　雖古多所危，　　吾今名無害。",
        "translation": "Although there were many dangers in the past, I'm now called harmless.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　身口所犯過，　　志懷殺害心，",
        "translation": "The offenses committed by body and speech are intended to harm others.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　其不危他餘，　　未曾遭諸厄。",
        "translation": "They won't be in danger of others and never experience any trouble.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　又復無過去，　　持其法寂然，",
        "translation": "Furthermore, there’s no past that maintains its teaching in silence.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　應受凶暴名，　　自調成仁賢。",
        "translation": "They should receive the name of fierceness and be disciplined themselves to become benevolent and wise.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　以才一調定，　　如鉤調諸象，",
        "translation": "Because of his talent, he's able to regulate concentration like a hook that regulates elephants.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　如來成就我，　　無劍亦無杖。",
        "translation": "The Tathāgata has accomplished self, which has no sword and no staff.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　其前為放逸，　　然後能自制，",
        "translation": "The former is carelessness, and the latter can restrain themselves.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　彼明炤於世，　　由日出於雲。",
        "translation": "It shines brightly in the world, and it's because the sun rises above the clouds.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　假使犯眾惡，　　不斷眾善德，",
        "translation": "Even if one commits numerous evil deeds, He will not stop performing many virtuous deeds.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　彼明炤於世，　　由雲消日出。",
        "translation": "It shines brightly in the world, and it's because the clouds disappear that the sun rises.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　若新學比丘，　　勤修於佛教，",
        "translation": "If a newly trained monk diligently cultivates Buddhism,",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　其明炤於世，　　如月盛滿時。",
        "translation": "It shines brightly in the world, like the moon when it's full.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　其有犯眾罪，　　當歸於惡道，",
        "translation": "Those who commit various sins will surely return to a bad destiny.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　不復難諸患，　　服食無所著。",
        "translation": "They will no longer be afflicted by the afflictions, and they won't eat or drink without attachment.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　亦不求於生，　　未曾會德死，",
        "translation": "Nor do they seek birth; They have never met with virtue or death.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　唯須待時日，　　心常志於定。",
        "translation": "It's only necessary to wait for the right time and day, and his mind always focuses on concentration.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　如是鴦掘摩，　　已得成羅漢，",
        "translation": "Thus, Aṅgulimālya has attained arhatship.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "　在佛世尊前，　　口自頌斯偈。」",
        "translation": "In front of the Bhagavān, he recites this verse himself.",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "賢者指鬘，破頭傷體衣服破裂，還詣佛所，稽首足下起於佛前頌曰：佛說如是。",
        "translation": "The good man's fingers are pierced, his hair breaks off, his body is injured, and his clothing breaks open. When he returns to the Buddha, he pays homage at his feet and rises up in front of the Buddha with a verse:",
        "source": "T02n0118_001:0510a07_1"
    },
    {
        "source_sentence": "賢者指鬘及諸比丘眾，聞經歡喜奉行。",
        "translation": "The good man pointed to the monks and other monks who heard the sūtras and rejoiced in their practice.",
        "source": "T02n0118_001:0510b07_2"
    },
    {
        "source_sentence": "佛說鴦掘摩經",
        "translation": "Aṅgulimālya-sūtra",
        "source": "T02n0118_001:0510b09_0"
    }
]