[
    {
        "source_sentence": "佛說戒香經",
        "translation": "Sutra on the Fragrance of the Precepts Spoken by the Buddha",
        "source": "T02n0117_001:0508a06_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試光祿卿",
        "translation": "Xitian zhuan jing sanzang朝散 dafu xiguan luqing",
        "source": "T02n0117_001:0508a08_0"
    },
    {
        "source_sentence": "明教大師臣法賢奉，　詔譯如是我聞：一時，佛在舍衛國祇樹給孤獨園，",
        "translation": "Thus have I heard. At one time the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Sāvatthī,",
        "source": "T02n0117_001:0508a09_0"
    },
    {
        "source_sentence": "與大比丘眾俱。",
        "translation": "He was accompanied by a large group of monks.",
        "source": "T02n0117_001:0508a11_0"
    },
    {
        "source_sentence": "爾時，尊者阿難來詣佛所，到已頭面禮足，合掌恭敬而白佛言：「世尊！",
        "translation": "At that point, Venerable Ānanda came to the Buddha. Having arrived there, he bowed his forehead at his feet, joined his palms in respect, and said to the Buddha:",
        "source": "T02n0117_001:0508a11_1"
    },
    {
        "source_sentence": "我有少疑欲當啟問，唯願世尊為我解說。",
        "translation": "World-Honored One, I have a few doubts that I should ask. May the World-honored One explain them to me!",
        "source": "T02n0117_001:0508a12_2"
    },
    {
        "source_sentence": "我見世間有三種香，所謂根香、花香、子香，此三種香遍一切處，有風而聞，",
        "translation": "“World-honored One, I see that there are three kinds of fragrance in the world. The so-called fragrance of the roots, the fragrance of flowers, and the fragrance of seeds pervade all places; and a wind blows to hear them.",
        "source": "T02n0117_001:0508a13_3"
    },
    {
        "source_sentence": "無風亦聞，其香云何？」",
        "translation": "What's the fragrance that can also be heard without wind?",
        "source": "T02n0117_001:0508a15_4"
    },
    {
        "source_sentence": "爾時，世尊告尊者阿難：「勿作是言，謂此三種之香，遍一切處有風而聞，",
        "translation": "At that time the World-honored One said to Venerable Ānanda: Do not say such a thing. It means that these three kinds of fragrance are heard by the wind blowing everywhere,",
        "source": "T02n0117_001:0508a17_0"
    },
    {
        "source_sentence": "無風亦聞。",
        "translation": "Without wind, they'll also hear it.",
        "source": "T02n0117_001:0508a18_1"
    },
    {
        "source_sentence": "此三種香有風無風，遍一切處而非得聞。",
        "translation": "These three kinds of fragrance have wind and no wind, pervading everywhere but not hearing it.",
        "source": "T02n0117_001:0508a18_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T02n0117_001:0508a19_3"
    },
    {
        "source_sentence": "汝今欲聞普遍香者，應當諦聽，為汝宣說。」",
        "translation": "Now, if you want to hear the universal fragrance, you should listen closely and explain it for you.",
        "source": "T02n0117_001:0508a19_4"
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, Bhagavān!",
        "source": "T02n0117_001:0508a20_5"
    },
    {
        "source_sentence": "我今樂聞，唯願宣說。」",
        "translation": "Now, I'm happy to hear it, so please explain it.",
        "source": "T02n0117_001:0508a21_6"
    },
    {
        "source_sentence": "佛告阿難：「有風無風香遍十方者，世間若有近事男、近事女，持佛淨戒行諸善法，",
        "translation": "The Buddha said to Ānanda: If the fragrance of wind and the absence of wind pervade the ten directions, how could anyone in the world who is intimate with men and women observe the pure precepts of buddhahood and practice wholesome behavior?",
        "source": "T02n0117_001:0508a22_0"
    },
    {
        "source_sentence": "謂不殺、不盜、不婬、不妄及不飲酒。",
        "translation": "They are not killing, not stealing, not engaging in sexual misconduct, not speaking falsehoods, and not drinking alcohol.",
        "source": "T02n0117_001:0508a23_1"
    },
    {
        "source_sentence": "是近事男、近事女，如是戒香遍聞十方，而彼十方咸皆稱讚，而作是言：『於某城中有如是近事男女，",
        "translation": "The fragrance of these precepts pervaded the ten directions, and all praised them in those ten directions, saying:",
        "source": "T02n0117_001:0508a24_2"
    },
    {
        "source_sentence": "持佛淨戒行諸善法，謂不殺、不盜、不婬、不妄及不飲酒等。』",
        "translation": "They observe the Buddha's pure precepts and practice good qualities, which are not killing, stealing, sexual misconduct, speaking falsely, and not drinking alcohol.'",
        "source": "T02n0117_001:0508a26_3"
    },
    {
        "source_sentence": "具此戒法，是人獲如是之香，有風無風遍聞十方，咸皆稱讚而得愛敬。」",
        "translation": "If someone possesses these precepts, they'll attain such an odor, which is heard in the ten directions with or without wind and praised by all to gain affection and respect.",
        "source": "T02n0117_001:0508a28_4"
    },
    {
        "source_sentence": "「世間所有諸花果，　　乃至沈檀龍麝香，",
        "translation": "All the flowers and fruits of the world, including the fragrance of sandalwood, dragon, and musk",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "　如是等香非遍聞，　　唯聞戒香遍一切。",
        "translation": "These kinds of fragrance are not pervasively smelled; They only smell the fragrance of morality, pervading all.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "　旃檀欝金與蘇合，　　優鉢羅并摩隷花，",
        "translation": "The sandalwood and gold are combined with soap; the utpala and māli flowers.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "　如是諸妙花香中，　　唯有戒香而最上。",
        "translation": "Among these wonderful flowers and fragrances, only the fragrance of precepts is the highest.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "　所有世間沈檀等，　　其香微少非遍聞，",
        "translation": "The fragrance of all the worldly sandalwood and so forth Is not pervasive.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "　若人持佛淨戒香，　　諸天普聞皆愛敬。",
        "translation": "If someone holds the fragrance of the Buddha's pure precepts, the gods hear them all and love and respect them.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "　如是具足清淨戒，　　乃至常行諸善法，",
        "translation": "They are thus endowed with pure morality And always practice virtuous ways.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "　是人能解世間縛，　　所有諸魔常遠離。」",
        "translation": "That person can free themselves from the worldly bonds, and all the Māras they have are always far removed.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "爾時，世尊而說頌曰：爾時，尊者阿難及比丘眾，聞佛語已，歡喜信受，",
        "translation": "At that time the World-honored One spoke these verses: Then, having listened to the Buddha’s words, Venerable Ānanda and the assembly of monks were delighted and believed them.",
        "source": "T02n0117_001:0508b01_0"
    },
    {
        "source_sentence": "禮佛而退。",
        "translation": "He bowed to the Buddha and withdrew.",
        "source": "T02n0117_001:0508b11_1"
    },
    {
        "source_sentence": "佛說戒香經",
        "translation": "Sutra on the Fragrance of the Precepts Spoken by the Buddha",
        "source": "T02n0117_001:0508b12_0"
    }
]