[
    {
        "source_sentence": "過去現在因果經卷第一",
        "translation": "Sutra on Past and Present Causes and Effects, Volume 1",
        "source": "T03n0189_001:0620c12_0"
    },
    {
        "source_sentence": "宋天竺三藏求那跋陀羅譯",
        "translation": "Song Dynasty Translation of the Tripiṭaka of India, translated by Guanabhadra",
        "source": "T03n0189_001:0620c14_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國，祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T03n0189_001:0620c15_0"
    },
    {
        "source_sentence": "爾時世尊，與諸比丘住於竹林。",
        "translation": "It was then that the Bhagavān and the monks were staying in the bamboo forest.",
        "source": "T03n0189_001:0620c16_0"
    },
    {
        "source_sentence": "是諸比丘，於晨朝時，著衣持鉢，入城乞食；",
        "translation": "In the early morning these monks, putting on their robes and with their bowls in hand, entered the city to solicit alms.",
        "source": "T03n0189_001:0620c16_1"
    },
    {
        "source_sentence": "還歸所住，食竟澡漱，各攝衣鉢，集在講堂，悉欲共說過去因緣。",
        "translation": "They returned to their dwelling place, bathed and rinsed themselves after they had finished eating, put away their robes and bowls, assembled in the assembly hall, and all wished to explain the causes and conditions of the past together.",
        "source": "T03n0189_001:0620c17_2"
    },
    {
        "source_sentence": "爾時世尊，以淨天耳超於世間，聞諸比丘語論之聲。",
        "translation": "It was then that the Bhagavān transcended the world with his pure divine ear and heard the sounds of the monks' arguments.",
        "source": "T03n0189_001:0620c19_3"
    },
    {
        "source_sentence": "即從座起，到講堂上，於眾中坐。",
        "translation": "He rose from his seat, entered the assembly hall, and sat in the midst of the assembly.",
        "source": "T03n0189_001:0620c20_4"
    },
    {
        "source_sentence": "問諸比丘：「汝等共集，欲說何法？」",
        "translation": "He asked the monks, What teaching do you want to teach when you're assembled together?",
        "source": "T03n0189_001:0620c21_5"
    },
    {
        "source_sentence": "時諸比丘，即白佛言：「世尊！",
        "translation": "The monks then said to the Buddha, Bhagavān!",
        "source": "T03n0189_001:0620c22_6"
    },
    {
        "source_sentence": "我等食竟澡漱已訖，故共集此各欲聞說過去因緣。」",
        "translation": "We've finished washing and rinsing after we finish eating, so we'll gather here together to hear the causes and conditions of the past.",
        "source": "T03n0189_001:0620c22_7"
    },
    {
        "source_sentence": "是時世尊語諸比丘：「汝等樂聞過去因緣者，諦聽！",
        "translation": "The Bhagavān then said to the monks, All of you who are happy to hear about past causes and conditions, listen closely!",
        "source": "T03n0189_001:0620c24_0"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T03n0189_001:0620c25_1"
    },
    {
        "source_sentence": "善思念之，今為汝說。」",
        "translation": "Consider it well, and now I'll explain it for you.",
        "source": "T03n0189_001:0620c25_2"
    },
    {
        "source_sentence": "比丘白言：「唯然，世尊！",
        "translation": "The monks said, Yes, Bhagavān!",
        "source": "T03n0189_001:0620c25_3"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T03n0189_001:0620c26_4"
    },
    {
        "source_sentence": "佛言：「比丘！",
        "translation": "The Buddha said, Monks!",
        "source": "T03n0189_001:0620c26_5"
    },
    {
        "source_sentence": "過去無數阿僧祇劫，爾時有一仙人，名曰善慧，淨修梵行，求一切種智，",
        "translation": "Countless, incalculable kalpas ago there was a holy man named Sunetra who practiced pure and genuine austerity and sought omniscience.",
        "source": "T03n0189_001:0620c26_6"
    },
    {
        "source_sentence": "為欲成就此大智故，樂處生死，周遍五道；",
        "translation": "In order to perfect this great knowledge, they sojourned in the blissful state of birth and death, pervading the five realms of rebirth.",
        "source": "T03n0189_001:0620c28_7"
    },
    {
        "source_sentence": "一身死壞，復受一身，生死無量。",
        "translation": "One body dies and disintegrates, and another body is subject to birth-and-death without measure.",
        "source": "T03n0189_001:0620c29_8"
    },
    {
        "source_sentence": "譬盡天下草木，斬以為籌，數其故身，不能窮盡。",
        "translation": "It's like cutting down all the grass and trees in the world to make a chip, counting their old body without limit.",
        "source": "T03n0189_001:0621a01_9"
    },
    {
        "source_sentence": "夫極天地之始終，謂之一劫，而其經天地成壞者，不可稱載也。",
        "translation": "The beginning of the last heaven and earth is one kalpa, but the succession of heaven and earth as they form and disintegrate cannot be measured.",
        "source": "T03n0189_001:0621a02_10"
    },
    {
        "source_sentence": "所以感傷群生耽惑愛欲沈流苦海，起慈悲心，欲拔濟之。",
        "translation": "That's why they cause sentient beings who are addicted to craving and desire to sink into the ocean of suffering, give rise to a mind of kindness and pity, and want to rescue them.",
        "source": "T03n0189_001:0621a03_11"
    },
    {
        "source_sentence": "又作此念：『今諸眾生，沒於生死，不能自出；",
        "translation": "Again, they think: All sentient beings are now submerged in the mundane whirl and cannot leave it on their own.",
        "source": "T03n0189_001:0621a05_12"
    },
    {
        "source_sentence": "皆由貪欲、瞋恚、愚癡，樂著色、聲、香、味、觸、法故，我當決定斷其此病。』",
        "translation": "It's all because of craving, anger, anger, and folly that they are delighted with form, sound, odor, taste, touch, and dharmas, and I will surely stop this illness.'",
        "source": "T03n0189_001:0621a06_13"
    },
    {
        "source_sentence": "雖生諸趣，不忘斯念。",
        "translation": "Even though they are born in various destinies, they don't forget this thought.",
        "source": "T03n0189_001:0621a07_14"
    },
    {
        "source_sentence": "於諸眾生怨親平等，以布施攝貧窮，持戒攝毀禁，忍辱攝瞋恚，精進攝懈怠，",
        "translation": "To be impartial toward all sentient beings’ enemies and relatives, they subdue poverty by means of generosity; upholding precepts to subdue immorality; enduring humility to subdue anger; effort to sub",
        "source": "T03n0189_001:0621a08_15"
    },
    {
        "source_sentence": "禪定攝亂意，智慧攝愚癡；",
        "translation": "Distraction is included in meditation; confusion is included in wisdom; ignorance is included in knowledge.",
        "source": "T03n0189_001:0621a10_16"
    },
    {
        "source_sentence": "如是長夜增益眾生，普為一切而作歸依。",
        "translation": "Thus, for a long time, they've benefited sentient beings and made their refuge for all of them.",
        "source": "T03n0189_001:0621a10_17"
    },
    {
        "source_sentence": "於諸如來，恭敬供養，樂欲聽法，亦為他說。",
        "translation": "They honor and venerate the buddhas, delight in listening to their exhortations, and also teach others.",
        "source": "T03n0189_001:0621a11_18"
    },
    {
        "source_sentence": "常以四事，奉給眾僧，於佛法眾，尊重守護，如是諸行，不可稱數。",
        "translation": "He always gave four things to the saṃgha, honoring and protecting the buddha-dharma community with respect and these practices are incalculable.",
        "source": "T03n0189_001:0621a12_19"
    },
    {
        "source_sentence": "「爾時有王，名曰燈照；",
        "translation": "“At that time there was a king named Dōshō.",
        "source": "T03n0189_001:0621a14_20"
    },
    {
        "source_sentence": "城名提播婆底；",
        "translation": "The city was named Devapati.",
        "source": "T03n0189_001:0621a14_21"
    },
    {
        "source_sentence": "其國人民，壽八萬歲，安隱豐樂，極為熾盛，所欲自在，猶如諸天。",
        "translation": "The people of that country had a life span of eighty thousand years. They lived peacefully and prosperously, flourishing at the peak of their longevity. Being free to do anything they wished, they were like gods.",
        "source": "T03n0189_001:0621a15_22"
    },
    {
        "source_sentence": "時彼國王，正法治世，不抂人民，無有殺戮楚撻之苦，視諸人民，有如一子。",
        "translation": "The king of that country then ruled the world correctly, didn't pity the people and didn't experience the pain of killing or punishment, and looked at the people as if they were a child.",
        "source": "T03n0189_001:0621a16_23"
    },
    {
        "source_sentence": "時燈照王，始生太子，端嚴無比，威德具足，有三十二相八十種好。",
        "translation": "When King Dōshō was first born, the prince was incomparably dignified and endowed with authoritative virtue, endowed with the thirty-two marks and eighty kinds of beauty.",
        "source": "T03n0189_001:0621a18_24"
    },
    {
        "source_sentence": "初生之日，四方皆明，日月珠火，不復為用。",
        "translation": "On the day of his first birth, all four directions will become clear, and the sun and moon beads and fire won't be used again.",
        "source": "T03n0189_001:0621a20_0"
    },
    {
        "source_sentence": "王見太子有如此瑞，即召諸臣，共集議言：『太子初生，有此奇特，當為太子，",
        "translation": "Seeing this miraculous sign, the king summoned his ministers and assembled them together to discuss the matter. They said, “The prince is born for the first time.",
        "source": "T03n0189_001:0621a21_0"
    },
    {
        "source_sentence": "作何等名？』",
        "translation": "What's the name for it?'",
        "source": "T03n0189_001:0621a22_1"
    },
    {
        "source_sentence": "諸臣答言：『應名太子以為普光。』",
        "translation": "The ministers replied, 'Should you name the prince as Samantabhadra?'",
        "source": "T03n0189_001:0621a23_2"
    },
    {
        "source_sentence": "又召相師而占相之。",
        "translation": "He also summoned a fortune teller to divine his appearance.",
        "source": "T03n0189_001:0621a23_3"
    },
    {
        "source_sentence": "相師答言：『今觀太子，若在家者，為轉輪王，統四天下；",
        "translation": "The soothsayers replied, “We now see that the prince who remains at home becomes a universal monarch ruling over the four quarters of the earth.",
        "source": "T03n0189_001:0621a24_4"
    },
    {
        "source_sentence": "若出家者，為天人尊，成薩婆若。』",
        "translation": "If someone leaves home, they'll become the honored one among gods and humans who become sarvajña.'",
        "source": "T03n0189_001:0621a25_5"
    },
    {
        "source_sentence": "王及夫人後宮婇女，聞相師言，於此太子，深生愛念；",
        "translation": "The king and the palace maidservants of the queen’s wife heard the soothsayer’s words, and deeply cherished affection for the prince.",
        "source": "T03n0189_001:0621a26_6"
    },
    {
        "source_sentence": "亦為天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽，人非人等，",
        "translation": "They are also gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T03n0189_001:0621a27_7"
    },
    {
        "source_sentence": "供養恭敬，尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T03n0189_001:0621a29_8"
    },
    {
        "source_sentence": "「是時太子，在於後宮，為夫人婇女，說種種法。",
        "translation": "At the time, the prince was in the rear palace explaining various teachings to his wife and daughters.",
        "source": "T03n0189_001:0621a29_9"
    },
    {
        "source_sentence": "太子年至二萬九千歲，捨轉輪王位，啟其父母，求欲出家；",
        "translation": "When the prince was twenty-nine thousand years old, he renounced the throne of universal monarchship and asked his parents to allow him to leave home.",
        "source": "T03n0189_001:0621b01_10"
    },
    {
        "source_sentence": "既不聽已，乃至三請，猶尚不許。",
        "translation": "After not listening, they still won't allow it even after three requests are made.",
        "source": "T03n0189_001:0621b03_11"
    },
    {
        "source_sentence": "太子慈悲，志存拯濟，忍其小違，以成大順。",
        "translation": "The prince was compassionate and sympathetic, determined to save and rescue them. Forbearing the slightest disobedience, he formed a great obedience.",
        "source": "T03n0189_001:0621b03_12"
    },
    {
        "source_sentence": "即便往詣山林樹下，剃除鬚髮，被著法服，勤修苦行，滿六千歲，成阿耨多羅三藐三菩提。",
        "translation": "He then went to the foot of a tree in a mountain forest, shaved his hair and beard, donned religious robes, and diligently practiced austerities until he was six thousand years old, attaining highest, complete enlightenment.",
        "source": "T03n0189_001:0621b04_13"
    },
    {
        "source_sentence": "為諸天人及八部眾，轉於法輪；",
        "translation": "He turned the wheel of the Teaching for the sake of gods, humans, and the eightfold assembly.",
        "source": "T03n0189_001:0621b06_14"
    },
    {
        "source_sentence": "此輪微妙，一切世間，天人魔梵，所不能轉。",
        "translation": "This wheel is so subtle that it cannot be turned by gods, humans, Māra, or Brahmā in any world.",
        "source": "T03n0189_001:0621b07_15"
    },
    {
        "source_sentence": "以三乘法教化眾生，所可利益，不可稱數。",
        "translation": "They teach and transform sentient beings with the teachings of the three vehicles, and their benefits can't be counted.",
        "source": "T03n0189_001:0621b08_16"
    },
    {
        "source_sentence": "爾時父王及其夫人後宮婇女，聞太子普光成阿耨多羅三藐三菩提，心大歡喜，",
        "translation": "At that time the king’s father and his queen, as well as the palace ladies of their wives and consorts, were greatly delighted when they heard that the prince Universal Light had attained highest, complete enlightenment.",
        "source": "T03n0189_001:0621b09_17"
    },
    {
        "source_sentence": "踊躍無量。",
        "translation": "Their boundless leaps and dances are countless.",
        "source": "T03n0189_001:0621b11_18"
    },
    {
        "source_sentence": "爾時群臣國內人民，婆羅門等，聞太子道成，心各念言：『太子普光，",
        "translation": "It was then that the ministers, the citizens of the kingdom, and the brahmans heard that the prince’s path had been accomplished. They each thought to themselves, “The prince is universally shining!",
        "source": "T03n0189_001:0621b11_19"
    },
    {
        "source_sentence": "捨轉輪王位，剃除鬚髮，被著法服，出家修道，得成正覺；",
        "translation": "He renounced the throne of universal rulership, shaved his hair and beard, donned religious robes, renounced household life, and practiced Buddhism to attain enlightenment.",
        "source": "T03n0189_001:0621b13_20"
    },
    {
        "source_sentence": "我等今者，亦當出家。』",
        "translation": "Now, we'll also leave home.'",
        "source": "T03n0189_001:0621b14_21"
    },
    {
        "source_sentence": "作此念已，悉皆往詣普光佛所。",
        "translation": "After they had this thought, they all went to the Buddha Samantabhadra.",
        "source": "T03n0189_001:0621b15_22"
    },
    {
        "source_sentence": "爾時普光如來，即觀其心，隨其因緣，而為說法；",
        "translation": "It was then that the Buddha Universal Light, observing his mind, expounded the Teaching according to its causes and conditions.",
        "source": "T03n0189_001:0621b16_0"
    },
    {
        "source_sentence": "大臣婆羅門等，有四千人，成阿羅漢；",
        "translation": "Among the ministers and brahmans, there were four thousand who became arhats.",
        "source": "T03n0189_001:0621b17_1"
    },
    {
        "source_sentence": "國中人民及餘四方諸來會眾，有八萬人，亦得無著法忍。",
        "translation": "The people of that country and the other 80,000 people from the four directions who came to the assembly also attained unattached tolerance of the Dharma.",
        "source": "T03n0189_001:0621b18_0"
    },
    {
        "source_sentence": "「爾時普光如來與八萬四千諸阿羅漢，往詣國界，遊行教化。",
        "translation": "It was then that the Tathāgata Samantabhadra and 84,000 arhats went to the border of the country, traveled, and taught.",
        "source": "T03n0189_001:0621b19_1"
    },
    {
        "source_sentence": "父王聞已，心大歡喜，即勅國中，平治道路，香水灑地，懸諸繒綵寶幢幡蓋，",
        "translation": "Having heard this, the father rejoiced greatly and ordered his kingdom to level the roads of the roads, sprinkling scented water on the ground with fragrant water, hanging silk-mbroidered banners, jeweled",
        "source": "T03n0189_001:0621b20_2"
    },
    {
        "source_sentence": "散眾名華，如是莊嚴，滿十二踰闍那。",
        "translation": "The scattered multitude is called a flower, which is thus adorned for twelve yojanas.",
        "source": "T03n0189_001:0621b22_3"
    },
    {
        "source_sentence": "又復擊鼓唱令國內諸有華者，不得私賣，悉輸與王；",
        "translation": "Again, he beat the drum to make sure that all the flowers in the kingdom would not be allowed to be privately traded and they would all be given to the king.",
        "source": "T03n0189_001:0621b23_4"
    },
    {
        "source_sentence": "并勅人民，不得先我供養於佛；",
        "translation": "They also ordered the people not to allow me to precede them in making offerings to the Buddha.",
        "source": "T03n0189_001:0621b24_5"
    },
    {
        "source_sentence": "即遣大臣，并作伎樂，燒香散華，而往請彼普光如來。",
        "translation": "He then sent his ministers and musicians, burned incense and scattered flowers, and went to invite the Tathāgata Samantabhadra.",
        "source": "T03n0189_001:0621b25_6"
    },
    {
        "source_sentence": "「爾時善慧仙人，在於山中，得五奇特夢：一者，夢臥大海；",
        "translation": "At that time the sage Sunetra had five extraordinary dreams while staying in the mountain:",
        "source": "T03n0189_001:0621b26_7"
    },
    {
        "source_sentence": "二者，夢枕須彌；",
        "translation": "The second is the mountain of dream-sleeping pillows.",
        "source": "T03n0189_001:0621b27_8"
    },
    {
        "source_sentence": "三者，夢海中一切眾生入其身內；",
        "translation": "The third is that all sentient beings in the ocean of dreams enter their bodies.",
        "source": "T03n0189_001:0621b28_9"
    },
    {
        "source_sentence": "四者，夢手執日；",
        "translation": "The fourth is that they dream of holding the sun in their hands.",
        "source": "T03n0189_001:0621b29_10"
    },
    {
        "source_sentence": "五者，夢手執月。",
        "translation": "Fifth, he dreams of holding the moon in his hand.",
        "source": "T03n0189_001:0621b29_11"
    },
    {
        "source_sentence": "得此夢已，即大驚悟，心自念言：『我今此夢，非為小緣，當以問誰？",
        "translation": "Having had this dream, he was greatly frightened and thought to himself, 'Now that I'm having this dream, it's not for minor reasons; who will I ask?'",
        "source": "T03n0189_001:0621b29_12"
    },
    {
        "source_sentence": "宜入城內，問諸智者。』",
        "translation": "It's better to enter the city and ask the wise.'",
        "source": "T03n0189_001:0621c02_13"
    },
    {
        "source_sentence": "作是念已，披鹿皮衣，手執水瓶及杖繖蓋，行入城邑；",
        "translation": "Having thought thus, he wore a deerskin robe, carried a water pitcher and cane in his hand, and marched into the city.",
        "source": "T03n0189_001:0621c02_14"
    },
    {
        "source_sentence": "路過外道所止住處，有五百人，而為上首。",
        "translation": "There were five hundred non-Buddhist monks, led by the chief of the order, who lived there.",
        "source": "T03n0189_001:0621c04_15"
    },
    {
        "source_sentence": "善慧念言：『我今當以所夢問之，并得觀其所修之業。』",
        "translation": "Sunetra thought, 'Now, I will ask him about the dream that he's dreaming of and examine the actions he cultivates.'",
        "source": "T03n0189_001:0621c05_16"
    },
    {
        "source_sentence": "即共諸人，講論道義，破其異見。",
        "translation": "Together with the others, they discussed the doctrine of the Way and refuted their divergent views.",
        "source": "T03n0189_001:0621c06_17"
    },
    {
        "source_sentence": "時五百人，即便受屈，求為弟子，於善慧所深生恭敬，各以銀錢一枚而以上之。",
        "translation": "The five hundred people were then even humiliated, asked to be disciples, and with deep respect for Shanhui, each offered him a silver coin and raised it above him.",
        "source": "T03n0189_001:0621c07_18"
    },
    {
        "source_sentence": "復有五百外道，既見善慧辯才聰明，亦生隨喜。",
        "translation": "Also, there were five hundred non-Buddhist priests who saw that Shanhui was eloquent and intelligent, and they also became delighted.",
        "source": "T03n0189_001:0621c09_0"
    },
    {
        "source_sentence": "時諸外道自共議言：『今普光如來出興于世。』",
        "translation": "The non-Buddhists then discussed it together, saying, 'Now, the Tathāgata Samantabhadra appears in the world.'",
        "source": "T03n0189_001:0621c10_1"
    },
    {
        "source_sentence": "善慧仙人，聞斯語已，舉體毛竪，心大歡喜，踊躍無量，便與外道，分別而去。",
        "translation": "When the sage Sunetra heard these words, his body hair stood on end and he was greatly delighted. Immeasurable with dancing and leaping, he gave up his non-Buddhist teachings to the heretics and departed.",
        "source": "T03n0189_001:0621c11_2"
    },
    {
        "source_sentence": "外道問言：『師何所趣？』",
        "translation": "The non-Buddhist asked, 'What's the teacher's destination?'",
        "source": "T03n0189_001:0621c13_0"
    },
    {
        "source_sentence": "答言：『我今當往普光佛所，欲施供養。』",
        "translation": "He replied, 'Now, I'll go to the Buddha Samantabhadra and want to make offerings.'",
        "source": "T03n0189_001:0621c13_1"
    },
    {
        "source_sentence": "外道白言：『師若去者，願樂隨從。』",
        "translation": "The non-Buddhist said, 'If the teacher leaves, I'd like to follow him.'",
        "source": "T03n0189_001:0621c14_2"
    },
    {
        "source_sentence": "善慧答曰：『我今有緣，宜應先行。』",
        "translation": "Shanhui answered, 'Now that I have conditions, it's appropriate for me to go first.'",
        "source": "T03n0189_001:0621c15_3"
    },
    {
        "source_sentence": "爾時善慧，齎五百銀錢，隨路而去。",
        "translation": "It was then that Shanhui carried the five hundred silver coins and departed on his way.",
        "source": "T03n0189_001:0621c15_4"
    },
    {
        "source_sentence": "諸外道眾，悲戀懊惱，辭別而歸。",
        "translation": "The heretics, grieved and distressed, departed and returned home.",
        "source": "T03n0189_001:0621c16_5"
    },
    {
        "source_sentence": "「善慧至前，見王家人，平治道路，香水灑地，列幢幡蓋，種種莊嚴。",
        "translation": "When Sunetra came before him, he saw the king’s householders paving the road and sprinkling scented the ground with fragrant water. They were arrayed with banners, pennants, canopies, and various adornments.",
        "source": "T03n0189_001:0621c17_6"
    },
    {
        "source_sentence": "即便問言：『何因緣故，而作是事？』",
        "translation": "He even asked, 'What's the reason for doing this?'",
        "source": "T03n0189_001:0621c19_0"
    },
    {
        "source_sentence": "王人答言：『世有佛興，名曰普光，今燈照王，請來入城，所以怱怱莊嚴道路。』",
        "translation": "The king answered, 'There's a Buddha that arises in the world named Samantabhadra, and now King Dōshō is invited to enter the city because he wants to adorn the road.'",
        "source": "T03n0189_001:0621c19_1"
    },
    {
        "source_sentence": "善慧即復問彼路人：『汝知何處有諸名花？』",
        "translation": "Sunetra then again asked the fellow practitioner, 'Do you know where there are names and flowers?'",
        "source": "T03n0189_001:0621c21_2"
    },
    {
        "source_sentence": "答言：『道士！",
        "translation": "He replied, 'Teacher!",
        "source": "T03n0189_001:0621c22_3"
    },
    {
        "source_sentence": "燈照大王，擊鼓唱令國內，名花皆不得賣，悉以輸王。』",
        "translation": "The great king of Dōshō beats his drum and calls it an order to the kingdom, saying that names and flowers won't be sold or given to the king.'",
        "source": "T03n0189_001:0621c22_4"
    },
    {
        "source_sentence": "善慧聞已，心大懊惱，意猶不息，苦訪花所。",
        "translation": "When Sunetra heard this, his mind was greatly distressed. His thoughts never ceased and he visited the flower-treasury in distress.",
        "source": "T03n0189_001:0621c23_5"
    },
    {
        "source_sentence": "「俄爾即遇王家青衣，密持七莖青蓮花過，畏王制令，藏著瓶中。",
        "translation": "“Soon after that, he met the king’s blue clothes and secretly carried seven stalks of blue lotus flowers with him. Fearing the king’s edict, he hid them in a pot.",
        "source": "T03n0189_001:0621c25_0"
    },
    {
        "source_sentence": "善慧至誠，感其蓮花踊出瓶外，善慧遙見，即追呼曰：『大姊，且止！",
        "translation": "Shanhui, sincere and sincere, sensed that the lotus flower was springing out of the vial. Seeing it from a distance, Shanhui called out to him, saying, 'Great sister, please stop!'",
        "source": "T03n0189_001:0621c26_1"
    },
    {
        "source_sentence": "此花賣不？』",
        "translation": "Will this flower be sold?'",
        "source": "T03n0189_001:0621c28_0"
    },
    {
        "source_sentence": "青衣聞已，心大驚愕，而自念言：『藏花甚密，此何男子，乃見我花，",
        "translation": "On hearing this, the man in blue robes were greatly startled and thought to himself, “The hidden flower is so dense. What kind of man would see my flower?",
        "source": "T03n0189_001:0621c28_1"
    },
    {
        "source_sentence": "求索買耶？』",
        "translation": "Are you asking for something to buy?'",
        "source": "T03n0189_001:0621c29_2"
    },
    {
        "source_sentence": "顧看其瓶，果見花出，生奇特想，答言：『男子！",
        "translation": "Looking at the vase, he saw a flower coming out and wondered how it had grown.",
        "source": "T03n0189_001:0621c29_3"
    },
    {
        "source_sentence": "此青蓮花當送宮內，欲以上佛，不可得也。』",
        "translation": "This blue lotus flower will be sent to the palace, and it's unobtainable if you want to go up to the Buddha.'",
        "source": "T03n0189_001:0622a01_4"
    },
    {
        "source_sentence": "善慧又言：『請以五百銀錢，雇五莖耳。』",
        "translation": "Sunetra also said, 'Invited to hire five stalks with 500 silver coins.'",
        "source": "T03n0189_001:0622a03_0"
    },
    {
        "source_sentence": "青衣意疑，復自念言：『此花所直不過數錢，而今男子，乃以銀錢五百求買五莖。』",
        "translation": "Doubtful, the blue-robed man again thought to himself, 'This flower doesn't amount to a few coins, but now that he's a man, he asks for five stalks with 500 silver coins.'",
        "source": "T03n0189_001:0622a03_1"
    },
    {
        "source_sentence": "即問之言：『欲持此花用作何等？』",
        "translation": "He asked them, 'What do you want to use this flower for?'",
        "source": "T03n0189_001:0622a05_2"
    },
    {
        "source_sentence": "善慧答言：『今有如來，出興於世，燈照大王，請來入城，故須此花，",
        "translation": "Sunetra replied, “There is a Tathāgata who appears in the world now. The great king Candraprabha invited him to come and enter the city. That is why he needs this flower.",
        "source": "T03n0189_001:0622a06_3"
    },
    {
        "source_sentence": "欲以供養。",
        "translation": "They want to make offerings.",
        "source": "T03n0189_001:0622a08_4"
    },
    {
        "source_sentence": "大姊當知，諸佛如來，難可值遇，如優曇鉢花時乃一現。』",
        "translation": "Great sister, you should know that it's difficult to meet buddhas and tathāgatas, like the udumbara flower that appears once.'",
        "source": "T03n0189_001:0622a08_5"
    },
    {
        "source_sentence": "青衣又問：『供養如來，為求何等？』",
        "translation": "Again, Qingyao asked, 'What's the purpose of making offerings to the Tathāgata?'",
        "source": "T03n0189_001:0622a09_6"
    },
    {
        "source_sentence": "善慧答曰：『為欲成就一切種智，度脫無量苦眾生故。』",
        "translation": "Sunetra answered, 'It's because I want to accomplish all kinds of cognition and liberate measureless suffering sentient beings.'",
        "source": "T03n0189_001:0622a10_7"
    },
    {
        "source_sentence": "爾時青衣，得聞此語，心自念言：『今此男子，顏容端正，披鹿皮衣，",
        "translation": "Hearing these words, the man in blue robes thought to himself, “Now this man has a handsome countenance and is wearing a deerskin robe.",
        "source": "T03n0189_001:0622a11_8"
    },
    {
        "source_sentence": "纔蔽形體，乃爾至誠，不惜錢寶。』",
        "translation": "Only by obscuring their form and body, they're so sincere that they don't cherish money or treasure.'",
        "source": "T03n0189_001:0622a13_9"
    },
    {
        "source_sentence": "即語之曰：『我今當以此花相與，願我生生常為君妻。』",
        "translation": "He then said to him, 'Now, I will give this flower to you, wishing that my births will always be your wife.'",
        "source": "T03n0189_001:0622a14_0"
    },
    {
        "source_sentence": "善慧答言：『我修梵行，求無為道，不得相許生死之緣。』",
        "translation": "Sunetra answered, 'I cultivate religious practice and seek the path of nonproductivity, but I can't agree with the conditions of birth and death.'",
        "source": "T03n0189_001:0622a15_1"
    },
    {
        "source_sentence": "青衣即言：『若當不從我此願者，花不可得。』",
        "translation": "The blue-robed man then said, 'If you don't follow this vow from me, the flowers won't be obtained.'",
        "source": "T03n0189_001:0622a16_2"
    },
    {
        "source_sentence": "善慧又曰：『汝若決定不與我花，當從汝願。",
        "translation": "Again, Sunetra said, 'If you're certain not to give me flowers, you must follow your vow.",
        "source": "T03n0189_001:0622a17_3"
    },
    {
        "source_sentence": "我好布施，不逆人意，若使有來從我乞求頭目髓腦，及與妻子，汝莫生閡，",
        "translation": "I am fond of generosity and do not disobey people’s wishes. If someone comes to ask me for my head, eyes, marrow, bone marrow, and even my wife, don’t let this cause you any trouble.",
        "source": "T03n0189_001:0622a18_4"
    },
    {
        "source_sentence": "壞吾施心。』",
        "translation": "It destroys my mind of giving.'",
        "source": "T03n0189_001:0622a20_5"
    },
    {
        "source_sentence": "青衣答言：『善哉！",
        "translation": "The blue-robed man replied, 'Good!",
        "source": "T03n0189_001:0622a20_6"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T03n0189_001:0622a20_7"
    },
    {
        "source_sentence": "敬從來命。",
        "translation": "I respectfully follow your orders.",
        "source": "T03n0189_001:0622a21_8"
    },
    {
        "source_sentence": "今我女弱不能得前，請寄二花以獻於佛，使我生生不失此願，好醜不離，",
        "translation": "Now that my daughter is weak and unable to get ahead, I ask you to send me two flowers to offer them to the Buddha so that when I am born, I won't lose this vow, neither good nor bad, without leaving it.",
        "source": "T03n0189_001:0622a21_9"
    },
    {
        "source_sentence": "必置心中，令佛知之。』",
        "translation": "They must put it in their minds so that the Buddha will know it.'",
        "source": "T03n0189_001:0622a23_10"
    },
    {
        "source_sentence": "「爾時，燈照王與其諸子，及眾官屬、婆羅門等，持好香花種種供具，",
        "translation": "“At the time, King Dōshō and his sons, as well as their officials and brāhmaṇas, brought various offerings of fragrant flowers and incense.",
        "source": "T03n0189_001:0622a24_0"
    },
    {
        "source_sentence": "而出奉迎普光如來，舉國人民，亦皆隨從。",
        "translation": "He came out to greet the Buddha Samantabhadra, and all the people of his country followed him.",
        "source": "T03n0189_001:0622a25_1"
    },
    {
        "source_sentence": "是時善慧五百弟子，共相謂言：『今日國王及諸臣民，悉皆往詣普光佛所，",
        "translation": "The five hundred disciples of the Buddha of Good Wisdom then said to each other, “Today the king and his subjects have all approached the buddha-field of Universal Light.",
        "source": "T03n0189_001:0622a26_2"
    },
    {
        "source_sentence": "大師今者亦當已去，我等宜應往彼禮敬。』",
        "translation": "Now, the great teacher will also depart, so we should go there to pay homage.'",
        "source": "T03n0189_001:0622a28_3"
    },
    {
        "source_sentence": "作此言已，即共俱行；",
        "translation": "Having said these words, they immediately proceed together.",
        "source": "T03n0189_001:0622a29_4"
    },
    {
        "source_sentence": "在道未遠，逢見善慧，師徒相遇，喜悅無量，即共同詣普光佛所。",
        "translation": "Not far from the Way, they met Shanhui. The teacher and his disciples encountered each other with immeasurable joy and delight. They went together to visit the Buddha Samantabhadra.",
        "source": "T03n0189_001:0622a29_5"
    },
    {
        "source_sentence": "見燈照王，已到佛前，最得在初供養禮拜，如是次第，至諸大臣，亦各禮敬，",
        "translation": "Having arrived before the Buddha, King Candraprabha paid his respects to him at the very first moment of veneration and greetings. All the ministers bowed their heads in this order.",
        "source": "T03n0189_001:0622b02_6"
    },
    {
        "source_sentence": "并散名花，花悉墮地。",
        "translation": "They also scattered a name-flower, and all the flowers fell to the ground.",
        "source": "T03n0189_001:0622b04_0"
    },
    {
        "source_sentence": "「于時善慧，與五百弟子，見諸人眾供養畢已，諦觀如來相好之容，又欲濟拔諸苦眾生，",
        "translation": "“At that time Supratishthita and his five hundred disciples, seeing the multitude of people who had paid their respects to the Tathāgata, contemplated closely on the auspicious signs and marks of the Tathāgata’s appearance.",
        "source": "T03n0189_001:0622b04_1"
    },
    {
        "source_sentence": "亦欲滿足一切種智故，即散五莖，皆住空中，化成花臺；",
        "translation": "Also, wishing to fulfill omniscience, they scattered five stalks in the sky and transformed them into flower beds.",
        "source": "T03n0189_001:0622b06_2"
    },
    {
        "source_sentence": "後散二莖，亦止空中，夾佛兩邊。",
        "translation": "Later, the two stalks scattered and also stopped in the air, clinging to both sides of the Buddha.",
        "source": "T03n0189_001:0622b07_3"
    },
    {
        "source_sentence": "爾時國王及其眷屬，一切臣民，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽，",
        "translation": "The king of that country and his retinues, all the ministers, gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas.",
        "source": "T03n0189_001:0622b08_4"
    },
    {
        "source_sentence": "人非人等，見此奇特，歎未曾有。",
        "translation": "People and non-people saw this marvel and praised it as unprecedented.",
        "source": "T03n0189_001:0622b10_5"
    },
    {
        "source_sentence": "於是普光如來，以無礙智，讚善慧言：『善哉，善哉！",
        "translation": "Then the Tathāgata Samantabhadra praised Suprabuddha with unhindered knowledge, saying: Excellent, excellent!",
        "source": "T03n0189_001:0622b11_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0189_001:0622b12_7"
    },
    {
        "source_sentence": "汝以是行，過無量阿僧祇劫，當得成佛，號釋迦牟尼如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。』",
        "translation": "Because of this practice, you'll become a buddha after measureless incalculable eons and be called the Tathāgata, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of",
        "source": "T03n0189_001:0622b12_8"
    },
    {
        "source_sentence": "當於善慧受記之時，無量天、龍、夜叉、乾闥婆、阿修羅、伽樓羅、緊那羅、摩睺羅伽，",
        "translation": "When they receive the prediction of good wisdom, measureless gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas",
        "source": "T03n0189_001:0622b15_9"
    },
    {
        "source_sentence": "人非人等，散眾妙花，滿虛空中，而發誓言：『善慧將來成佛道時，我等皆願為其眷屬。』",
        "translation": "People, not people, and so forth, scattered marvelous flowers that filled the sky and made a vow, 'When Shanhui will become a buddha in the future, we all wish to be his followers.'",
        "source": "T03n0189_001:0622b17_10"
    },
    {
        "source_sentence": "是時普光如來，即記之曰：『汝等皆當得生其國。』",
        "translation": "The Tathāgata of Universal Light then wrote a note to them, saying, 'You will all be born in that country.'",
        "source": "T03n0189_001:0622b19_11"
    },
    {
        "source_sentence": "「爾時如來，既授記已，猶見善慧，作仙人髻，披鹿皮衣；",
        "translation": "At that time the Tathāgata, having given his prediction, looked upon Suprabuddha and made a holy man’s hair stand on end, wearing a deerskin robe.",
        "source": "T03n0189_001:0622b20_12"
    },
    {
        "source_sentence": "如來欲令捨此服儀，即便化地，以為淤泥。",
        "translation": "Desiring to cause them to abandon this manner of dress, the Tathāgata transformed the earth into mud.",
        "source": "T03n0189_001:0622b21_13"
    },
    {
        "source_sentence": "善慧見佛應從此行而地濁濕，心自念言：『云何乃令千輻輪足蹈此而過？』",
        "translation": "Seeing that the Buddha of Good Wisdom should follow this practice, the ground becomes muddy and wet, and his mind thinks to himself, 'How did you cause a thousand-spoked wheel with feet to pass by here?'",
        "source": "T03n0189_001:0622b22_14"
    },
    {
        "source_sentence": "即脫皮衣，以用布地，不足掩泥，仍又解髮，亦以覆之。",
        "translation": "He then took off his leather clothes and spread them on the ground, not enough to cover the mud, but uncovered it as well.",
        "source": "T03n0189_001:0622b24_15"
    },
    {
        "source_sentence": "如來即便踐之而度，因記之曰：『汝後得佛當於五濁惡世，度諸天人，",
        "translation": "The Tathāgata then proceeded to save them. He instructed the gods, “You will attain buddhahood in the future and save all sentient beings in the troubled world of the five turbid states.",
        "source": "T03n0189_001:0622b25_16"
    },
    {
        "source_sentence": "不以為難，必如我也。』",
        "translation": "They won't think it's difficult, but they'll surely be like me.'",
        "source": "T03n0189_001:0622b27_17"
    },
    {
        "source_sentence": "于時善慧，聞斯記已，歡欣踊躍，喜不自勝；",
        "translation": "Upon hearing this prediction, Sudarśana was overjoyed and jumped for joy.",
        "source": "T03n0189_001:0622b27_18"
    },
    {
        "source_sentence": "「『今見世間導，　　令我開慧眼；",
        "translation": "'Now I see the world as a guide, Causing me to open my eye of wisdom.",
        "source": "T03n0189_001:0622b28_19"
    },
    {
        "source_sentence": "　　為說清淨法，　　去離一切著。",
        "translation": "He teaches the pure Dharma, getting rid of all attachments.",
        "source": "T03n0189_001:0622b28_19"
    },
    {
        "source_sentence": "　　今遇天人尊，　　令我得無生；",
        "translation": "Now I have met with the honored one, goddess of humans, Who has caused me to attain birthlessness.",
        "source": "T03n0189_001:0622b28_19"
    },
    {
        "source_sentence": "　　願將來獲果，　　亦如兩足尊。』",
        "translation": "May I attain fruit in the future, just like the two-legged honored one.'",
        "source": "T03n0189_001:0622b28_19"
    },
    {
        "source_sentence": "即時便解一切法空，得無生忍，身昇虛空，去地七多羅樹，以偈讚佛：「是時善慧，",
        "translation": "Immediately, he then understood the emptiness of all dharmas and attained the tolerance of nonarising. His body rose up into the sky, departed from the seven palm trees on the ground, and praised the Buddha in verse:",
        "source": "T03n0189_001:0622b28_19"
    },
    {
        "source_sentence": "說此讚已，從空中下，到於佛前，五體投地，而白佛言：『唯願世尊，",
        "translation": "Having praised him thus, he descended from the air and came before the Buddha. He prostrated himself with his five bodies on the ground and said to him:",
        "source": "T03n0189_001:0622c06_20"
    },
    {
        "source_sentence": "哀愍我故，聽我出家。』",
        "translation": "Because of pity for me, I'll be allowed to leave home.'",
        "source": "T03n0189_001:0622c07_21"
    },
    {
        "source_sentence": "爾時普光如來答言：『善哉！",
        "translation": "It was then that the Tathāgata of Universal Light answered, 'Good!",
        "source": "T03n0189_001:0622c08_22"
    },
    {
        "source_sentence": "善來比丘。』",
        "translation": "Well-come monk!'",
        "source": "T03n0189_001:0622c08_23"
    },
    {
        "source_sentence": "鬚髮自落，袈裟著身，即成沙門。",
        "translation": "His hair stood on end and his hair stood on end. As soon as he had shaved his hair the monk’s hair stood on end and his hair stood on end.",
        "source": "T03n0189_001:0622c09_24"
    },
    {
        "source_sentence": "「爾時有二貧窮老人，各與親屬一百人俱，覩佛相好，威德嚴顯，自傷貧乏無以供養。",
        "translation": "At the time, there were two poor old men, each accompanied by a hundred members of their families, who saw the Buddha's good appearance and his authoritative qualities so solemnly expressed that they harmed the poor and had no way to support him",
        "source": "T03n0189_001:0622c10_0"
    },
    {
        "source_sentence": "是時如來，愍其心至，即化前地，生諸草穢，令二貧人，見地不淨，發歡喜心，",
        "translation": "The Tathāgata then had pity on the poor man’s sincerity of mind and immediately transformed his former land into a place where grasses grew up to become filthy, causing two poor people to see that the land was impure.",
        "source": "T03n0189_001:0622c12_0"
    },
    {
        "source_sentence": "而便灑掃。",
        "translation": "He then swept it away.",
        "source": "T03n0189_001:0622c13_1"
    },
    {
        "source_sentence": "普光如來，而記之曰：『汝過無量阿僧祇劫，釋迦牟尼佛出興於世，汝等爾時當作第一聲聞弟子。』",
        "translation": "The Samantabhadra Tathāgata then recorded it for him, saying, 'For measureless incalculably long eons, you Śākyamuni Buddha emerged in the world, and you were the first śrāvaka disciple at that point.'",
        "source": "T03n0189_001:0622c14_0"
    },
    {
        "source_sentence": "爾時普光如來，記貧人已，與八萬四千比丘及燈照王，并婆羅門，諸臣民等，",
        "translation": "It was then that the Tathāgata Samantabhadra remembered the poor and gave them to eighty-four thousand bhikṣus, together with King Candraprabha as well as the other brāhmaṇas and their ministers.",
        "source": "T03n0189_001:0622c16_1"
    },
    {
        "source_sentence": "前後圍繞，入提播婆底城。",
        "translation": "Surrounded by them in front and behind, they entered the city of Devadatta.",
        "source": "T03n0189_001:0622c18_2"
    },
    {
        "source_sentence": "「時燈照王與其眷屬，以四事供養普光如來并及八萬四千比丘，經四萬歲，",
        "translation": "“At that time King Candraprabha and his retinues offered four kinds of offerings to the Tathāgata Samantabhadra, together with eighty-four thousand bhikṣus, forty thousand years.",
        "source": "T03n0189_001:0622c18_3"
    },
    {
        "source_sentence": "王即捨位，以付其子；",
        "translation": "The king relinquished his throne and gave it to his son.",
        "source": "T03n0189_001:0622c20_4"
    },
    {
        "source_sentence": "與其眷屬，及夫人眷屬，各八萬四千人，同於佛法，出家修道，得陀羅尼諸法三昧。",
        "translation": "He and his retinues, as well as the eighty-four thousand members of his wife’s retinue, all followed the Buddha’s teaching. They renounced domestic life to practice Buddhism and attained the samādhi called ‘Dāraṇī of",
        "source": "T03n0189_001:0622c20_5"
    },
    {
        "source_sentence": "善慧比丘，亦隨普光如來，受王供養，滿四萬歲，於諸法中，得深三昧，",
        "translation": "The bhikṣu Sunetra also followed the universally shining buddha Samantabhadra and accepted the king’s offerings. After forty thousand years had passed, he attained a profound concentration in regard to all doctrines.",
        "source": "T03n0189_001:0622c22_6"
    },
    {
        "source_sentence": "教化眾生不可稱數。",
        "translation": "It's incalculable to teach sentient beings.",
        "source": "T03n0189_001:0622c24_7"
    },
    {
        "source_sentence": "爾時善慧比丘白普光如來言：『世尊！",
        "translation": "It was then that the monk of good wisdom said to the Tathāgata Samantabhadra, 'Bhagavān!",
        "source": "T03n0189_001:0622c24_8"
    },
    {
        "source_sentence": "我於昔日，在深山中，得五奇特夢：一者、夢臥大海；",
        "translation": "In the past, while deep in the mountains I had five extraordinary dreams:",
        "source": "T03n0189_001:0622c25_9"
    },
    {
        "source_sentence": "二者、夢枕須彌；",
        "translation": "The second is the mountain of dream-sleeping pillows.",
        "source": "T03n0189_001:0622c27_0"
    },
    {
        "source_sentence": "三者、夢海中一切眾生，入我身內；",
        "translation": "The third is that all sentient beings in the ocean of dreams enter my body.",
        "source": "T03n0189_001:0622c27_1"
    },
    {
        "source_sentence": "四者、夢手執日；",
        "translation": "The fourth is that they dream of holding the sun in their hands.",
        "source": "T03n0189_001:0622c28_2"
    },
    {
        "source_sentence": "五者、夢手執月。",
        "translation": "5. In a dream, he holds the moon in his hand.",
        "source": "T03n0189_001:0622c28_3"
    },
    {
        "source_sentence": "唯願世尊，為我解說此夢之相。』",
        "translation": "Please, Bhagavān, explain the characteristics of this dream for me.'",
        "source": "T03n0189_001:0622c28_4"
    },
    {
        "source_sentence": "爾時普光如來答言：『善哉！",
        "translation": "It was then that the Tathāgata of Universal Light answered, 'Good!",
        "source": "T03n0189_001:0622c29_5"
    },
    {
        "source_sentence": "汝若欲知此夢義者，當為汝說。",
        "translation": "If you want to know the meaning of this dream, you must explain it for you.",
        "source": "T03n0189_001:0623a01_6"
    },
    {
        "source_sentence": "夢臥大海者，汝身即時在於生死大海之中；",
        "translation": "“If you dream of lying in the great ocean, your body will be instantly in the great ocean of birth and death.",
        "source": "T03n0189_001:0623a02_0"
    },
    {
        "source_sentence": "夢枕須彌者，出於生死得般涅槃相；",
        "translation": "The mountain of dreams and pillows is the mark of emerging from birth and death to attain final nirvana.",
        "source": "T03n0189_001:0623a03_1"
    },
    {
        "source_sentence": "夢大海中一切眾生入身內者，當於生死大海，為諸眾生作歸依處；",
        "translation": "In the great ocean of dreams all sentient beings who enter their bodies will become refuges for sentient beings in the great sea of birth and death.",
        "source": "T03n0189_001:0623a04_0"
    },
    {
        "source_sentence": "夢手執日者，智慧光明，普照法界；",
        "translation": "Daydream-holder of the hand holding the sun, the light of knowledge and wisdom illumining the whole cosmos.",
        "source": "T03n0189_001:0623a05_1"
    },
    {
        "source_sentence": "夢手執月者，以方便智，入於生死，以清涼法，化導眾生，令離惱熱。",
        "translation": "A man holding the moon in his hand in a dream enters birth and death with skillful means and wisdom, transforms sentient beings with the Dharma of purity and coolness, and causes them to part with the fever of affliction.",
        "source": "T03n0189_001:0623a06_2"
    },
    {
        "source_sentence": "此夢因緣，是汝將來成佛之相。』",
        "translation": "This is the cause and condition of this dream, which is the sign that you'll become a buddha in the future.'",
        "source": "T03n0189_001:0623a08_0"
    },
    {
        "source_sentence": "善慧聞已，歡喜踊躍，不能自勝，禮佛而退。",
        "translation": "Having heard this, Sunetra was overjoyed and jumped for joy. He could not control himself but withdrew after venerating the Buddha.",
        "source": "T03n0189_001:0623a08_1"
    },
    {
        "source_sentence": "「爾時普光如來，復經少時，入般涅槃。",
        "translation": "At the time, the Tathāgata Samantabhadra entered parinirvāṇa after a short while.",
        "source": "T03n0189_001:0623a09_2"
    },
    {
        "source_sentence": "善慧比丘，護持正法，滿二萬歲，以三乘法，教化眾生，所利益者，不可稱計。",
        "translation": "The monk Sunetra preserved the true-dharma for twenty thousand years, teaching and transforming sentient beings by means of the teachings of the three vehicles. The benefits he provided cannot be measured in words.",
        "source": "T03n0189_001:0623a10_3"
    },
    {
        "source_sentence": "爾時善慧比丘，於彼命終，即便上生，為四天王，以三乘法，化諸天眾；",
        "translation": "At that time the bhikṣu Sunetra entered nirvana and was reborn as king of the four heavenly kings. He guided the gods by the teachings of the three-vehicle assembly.",
        "source": "T03n0189_001:0623a12_4"
    },
    {
        "source_sentence": "盡彼天壽，下生人間，為轉輪聖王，王四天下，七寶具足：一、金輪寶，",
        "translation": "At the end of his heavenly life, he was reborn among humans as a wheel-turning sage king who ruled over the four continents and possessed seven treasures:",
        "source": "T03n0189_001:0623a14_0"
    },
    {
        "source_sentence": "二、白象寶，三、紺馬寶，四、神珠寶，五、玉女寶，六、主藏臣寶，",
        "translation": "2. the treasure of white elephants, 3. the treasure of dark blue horses, 4. the treasure of divine jewels, 5. the treasure of jadelike women, and 6. the treasure of the treasury councilor,",
        "source": "T03n0189_001:0623a15_1"
    },
    {
        "source_sentence": "七、主兵臣寶；",
        "translation": "The seventh treasure is that of the military commander.",
        "source": "T03n0189_001:0623a16_2"
    },
    {
        "source_sentence": "千子具足，皆悉勇健，能伏怨敵；",
        "translation": "He had a thousand sons, all of whom were valiant and strong, able to vanquish enemies.",
        "source": "T03n0189_001:0623a17_3"
    },
    {
        "source_sentence": "以正法治，無諸憂惱；",
        "translation": "They rule the world correctly, without any worries or distress.",
        "source": "T03n0189_001:0623a17_4"
    },
    {
        "source_sentence": "常以十善，化諸人民。",
        "translation": "He always taught the people by means of the ten good deeds.",
        "source": "T03n0189_001:0623a18_5"
    },
    {
        "source_sentence": "於此壽終，生忉利天，為彼天主；",
        "translation": "At the end of his life, he was reborn in Trāyastriṃśa gods as their ruler.",
        "source": "T03n0189_001:0623a18_6"
    },
    {
        "source_sentence": "壽終下生，為轉輪聖王；",
        "translation": "At the end of his life, he was reborn as a universal ruler.",
        "source": "T03n0189_001:0623a19_7"
    },
    {
        "source_sentence": "終其壽命，乃至生於第七梵天；",
        "translation": "At the end of their life, they are reborn in the seventh brahma-heaven.",
        "source": "T03n0189_001:0623a20_8"
    },
    {
        "source_sentence": "上為天王，下為聖主，各三十六反；",
        "translation": "The higher one is the king of gods and the lower one is the ruler of the sages, each thirty-six times.",
        "source": "T03n0189_001:0623a21_0"
    },
    {
        "source_sentence": "其間或為仙人，或為外道六師，或為婆羅門，或為小王；",
        "translation": "Some of them were sages, some non-Buddhist teachers, some brahmans, and some minor kings.",
        "source": "T03n0189_001:0623a21_1"
    },
    {
        "source_sentence": "如是變現，不可稱數。",
        "translation": "Such manifestations are incalculable.",
        "source": "T03n0189_001:0623a23_2"
    },
    {
        "source_sentence": "「爾時善慧菩薩，功行滿足，位登十地，在一生補處，近一切種智，生兜率天，",
        "translation": "“At that time the bodhisattva Sunetra, having fulfilled his practice of goodness and virtue, ascended to the tenth stage. In one rebirth he approached omniscience and was born in the Tushita heaven.",
        "source": "T03n0189_001:0623a24_0"
    },
    {
        "source_sentence": "名聖善白；",
        "translation": "They are called noble and virtuous white.",
        "source": "T03n0189_001:0623a25_1"
    },
    {
        "source_sentence": "為諸天主，說於一生補處之行；",
        "translation": "To the lords of the gods they teach the practice of remediation in one lifetime.",
        "source": "T03n0189_001:0623a26_2"
    },
    {
        "source_sentence": "亦於十方國土，現種種身，為諸眾生，隨應說法；",
        "translation": "He also manifested various bodies in the lands of the ten directions, teaching the truth to sentient beings according to their needs.",
        "source": "T03n0189_001:0623a26_3"
    },
    {
        "source_sentence": "期運將至，當下作佛，即觀五事：一者、觀諸眾生熟與未熟；",
        "translation": "When the time was approaching, he came down to become a buddha. He observed five things:",
        "source": "T03n0189_001:0623a27_4"
    },
    {
        "source_sentence": "二者、觀時至與未至；",
        "translation": "The second is that they contemplate the time of arrival and the time of nonarrival.",
        "source": "T03n0189_001:0623a29_5"
    },
    {
        "source_sentence": "三者、觀諸國土何國處中；",
        "translation": "The third is to contemplate in which of the various continents are they located?",
        "source": "T03n0189_001:0623a29_6"
    },
    {
        "source_sentence": "四者、觀諸種族何族貴盛；",
        "translation": "The fourth is to observe the various kinds of clans and their prosperity.",
        "source": "T03n0189_001:0623b01_7"
    },
    {
        "source_sentence": "五者、觀過去因緣，誰最真正應為父母。",
        "translation": "5. Observing past causes and conditions, who is the most genuine person who should be their father and mother?",
        "source": "T03n0189_001:0623b02_0"
    },
    {
        "source_sentence": "觀五事已，即自思惟：『今諸眾生，皆是我初發心以來所成熟者，堪能受於清淨妙法，",
        "translation": "Having observed these five things, he thought to himself, “All sentient beings of the present are my heirs who have matured since I first set out for enlightenment and are capable of receiving the pure and wonderful Dharma.",
        "source": "T03n0189_001:0623b02_1"
    },
    {
        "source_sentence": "於此三千大千世界，此閻浮提迦毘羅斾兜國最為處中，諸族種姓釋迦第一甘蔗苗裔聖王之後：觀白淨王過去因緣，",
        "translation": "Among these 3,000 great one-thousand worlds, this Jambudvipa and the country of Kapilavastu are the foremost among them. After the noble king who was the first among the sugarcane crops descendants of the Śākya",
        "source": "T03n0189_001:0623b04_2"
    },
    {
        "source_sentence": "夫妻真正堪為父母；",
        "translation": "A husband and wife are truly capable of being parents.",
        "source": "T03n0189_001:0623b07_3"
    },
    {
        "source_sentence": "又觀摩耶夫人，壽命脩短，懷抱太子，滿足十月，太子便生，生七日已，",
        "translation": "Again, as the life span of Lady Maya was short, she carried the prince in her arms for a full ten months. The prince was born seven days after he had been born.",
        "source": "T03n0189_001:0623b08_4"
    },
    {
        "source_sentence": "其母命終。』",
        "translation": "His mother died.'",
        "source": "T03n0189_001:0623b09_5"
    },
    {
        "source_sentence": "「既作此觀，又自思惟：『我今若便即下生者，不能廣利諸天人眾，仍於天宮，",
        "translation": "Having made this contemplation, he thought to himself: If I were to descend into the world and be reborn there, it would not benefit gods and human beings.",
        "source": "T03n0189_001:0623b10_6"
    },
    {
        "source_sentence": "現五種相，令諸天子，皆悉覺知菩薩期運應下作佛：一者、菩薩眼現瞬動；",
        "translation": "They manifested five kinds of signs, causing the celestial beings to all perceive the enlightening beings’ future destinies and become buddhas.",
        "source": "T03n0189_001:0623b11_7"
    },
    {
        "source_sentence": "二者、頭上花萎；",
        "translation": "The second is that the flowers on their heads wither.",
        "source": "T03n0189_001:0623b13_8"
    },
    {
        "source_sentence": "三者、衣受塵垢；",
        "translation": "The third is that their clothes are covered with dirt.",
        "source": "T03n0189_001:0623b13_9"
    },
    {
        "source_sentence": "四者、腋下汗出；",
        "translation": "The fourth is that sweat flows out of their armpits.",
        "source": "T03n0189_001:0623b14_10"
    },
    {
        "source_sentence": "五者、不樂本座。』",
        "translation": "Five, he doesn't enjoy his seat.'",
        "source": "T03n0189_001:0623b14_11"
    },
    {
        "source_sentence": "時諸天眾，忽見菩薩有此異相，心大驚怖，身諸毛孔，血流如雨，自相謂言：『菩薩不久捨於我等。』",
        "translation": "Suddenly, the gods suddenly saw that the bodhisattva had this strange sign and became so frightened in mind that their pores on his body bled like rain and said to each other, 'Soon, the bodhisattva will abandon us.",
        "source": "T03n0189_001:0623b15_0"
    },
    {
        "source_sentence": "「爾時菩薩，又現五瑞：一者，放大光明，普照三千大千世界；",
        "translation": "“At that time the enlightening being manifested five more signs:",
        "source": "T03n0189_001:0623b17_1"
    },
    {
        "source_sentence": "二者、大地十八相動，須彌海水，諸天宮殿，皆悉震搖；",
        "translation": "Second, the earth moves in eighteen ways: it shakes the ocean water of the polar mountain and all the celestial palaces shake.",
        "source": "T03n0189_001:0623b18_2"
    },
    {
        "source_sentence": "三者、諸魔宮宅隱蔽不現；",
        "translation": "The third is that all the abodes of demons are concealed and not manifested.",
        "source": "T03n0189_001:0623b19_3"
    },
    {
        "source_sentence": "四者、日月星辰無復光明；",
        "translation": "The fourth is that the sun, moon, and stars no longer shine brightly.",
        "source": "T03n0189_001:0623b20_4"
    },
    {
        "source_sentence": "五者、天龍八部身皆震動，不能自禁。",
        "translation": "5. The eight kinds of bodies of gods, dragons, and nāgas all shake their bodies and can't restrain themselves.",
        "source": "T03n0189_001:0623b21_0"
    },
    {
        "source_sentence": "是時兜率諸天，見菩薩身，已有五相，又復覩外五希有事，皆悉聚集，",
        "translation": "The gods of the Tushita heaven saw that the body of the enlightening being had already manifested five distinctive marks. Also there were five extraordinary signs outside the sky, all gathering together like this:",
        "source": "T03n0189_001:0623b21_1"
    },
    {
        "source_sentence": "到菩薩所，頭面禮足白言：『尊者！",
        "translation": "He went to the bodhisattva, bowed his head and feet, and said, 'Venerable!",
        "source": "T03n0189_001:0623b23_2"
    },
    {
        "source_sentence": "我等今日見此諸相，舉身震動，不能自安，唯願為我釋此因緣。』",
        "translation": "Today, when we see these signs, we shake our bodies and can't be comfortable; please explain these causes and conditions for us.'",
        "source": "T03n0189_001:0623b24_3"
    },
    {
        "source_sentence": "菩薩即便答諸天言：『善男子！",
        "translation": "The bodhisattva then answered the gods, saying, 'Good man!",
        "source": "T03n0189_001:0623b25_4"
    },
    {
        "source_sentence": "當知諸行皆悉無常，我今不久，捨此天宮，生閻浮提。』",
        "translation": "You should know that all conditioned things are impermanent, and it won't be long before I abandon this heavenly palace and be born in Jambudvīpa.'",
        "source": "T03n0189_001:0623b26_5"
    },
    {
        "source_sentence": "「于時諸天，聞此語已，悲號涕泣，心大憂惱，舉身血現，如波羅奢花；",
        "translation": "Having heard these words, the gods wept and wailed in sorrow. Their hearts were overcome with great grief, and their blood flowed like the white lotus flower.",
        "source": "T03n0189_001:0623b27_6"
    },
    {
        "source_sentence": "或有不復樂於本座；",
        "translation": "“Some people will no longer be able to enjoy their seats.",
        "source": "T03n0189_001:0623b29_7"
    },
    {
        "source_sentence": "或有棄其莊嚴之具；",
        "translation": "Some abandon their adornments.",
        "source": "T03n0189_001:0623b29_8"
    },
    {
        "source_sentence": "或有宛轉迷悶於地；",
        "translation": "Some people may wander about in confusion on the ground.",
        "source": "T03n0189_001:0623c01_9"
    },
    {
        "source_sentence": "或有深歎無常苦者。",
        "translation": "Perhaps there's someone who deeply praises the suffering of impermanence.",
        "source": "T03n0189_001:0623c01_10"
    },
    {
        "source_sentence": "「『菩薩在於此，　　開我等法眼；",
        "translation": "Here the enlightening beings Are opening our dharmic eyes.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　今者遠我去，　　如盲離導師。",
        "translation": "Now that I'm far away, I'm like a blind man leaving his guide.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　又如欲渡水，　　忽然失橋船；",
        "translation": "It is also like the case of those who want to cross water but suddenly lose their bridges and boats.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　亦似嬰孩兒，　　喪亡其慈母。",
        "translation": "It's also like an infant who loses his compassionate mother.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　我等亦如是，　　失所歸依處，",
        "translation": "We are likewise, losing our place of refuge.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　方漂生死流，　　了無有出緣。",
        "translation": "Only then does he float in the stream of birth and death, comprehending that there's no reason to leave.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　我等於長夜，　　為癡箭所射，",
        "translation": "For a long time we have been shot by the arrow of delusion.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　既失大醫王，　　誰當救我者？",
        "translation": "Since you've lost the great king of doctors, who will rescue me?",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　滯臥無明床，　　長沒愛欲海，",
        "translation": "They're stuck on the bed of ignorance, long submerged in the ocean of craving and desire.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "　　永絕尊者訓，　　未見超出期。』",
        "translation": "I'll never cut off the teaching of the venerable, and I won't see it beyond its time.'",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "爾時有一天子即說偈言：「爾時菩薩，見諸天子悲泣懊惱，又復聞說戀慕之偈，",
        "translation": "It was then that the celestial being spoke these verses: At that time the bodhisattva saw the celestial beings weeping and distressed, and he also heard them recite a verse of affection.",
        "source": "T03n0189_001:0623c02_11"
    },
    {
        "source_sentence": "即以慈音而告之曰：『善男子！",
        "translation": "He then addressed them with the sound of compassion, saying, 'Good sons!",
        "source": "T03n0189_001:0623c14_12"
    },
    {
        "source_sentence": "凡人受生無不死者；",
        "translation": "Ordinary people receive birth and there is no one who does not die.",
        "source": "T03n0189_001:0623c14_13"
    },
    {
        "source_sentence": "恩愛合會，必有別離；",
        "translation": "When kindness and affection are united, there must be separation.",
        "source": "T03n0189_001:0623c15_14"
    },
    {
        "source_sentence": "上至阿迦膩吒天，下至阿鼻地獄，其中一切諸眾生等，無有不為無常大火之所煎炙。",
        "translation": "Up to the Akaniṣṭha Heaven and down to the avīci hell, all the sentient beings there are neither cooked nor roasted by the great fire of impermanence.",
        "source": "T03n0189_001:0623c15_15"
    },
    {
        "source_sentence": "是故汝等不應於我獨生戀慕；",
        "translation": "Therefore, you should not be attached to me alone.",
        "source": "T03n0189_001:0623c18_0"
    },
    {
        "source_sentence": "我今與汝皆悉未離生死熾火，乃至一切貧富貴賤，皆不免脫。』",
        "translation": "Now, neither I nor you are free from the blazing fire of birth-and-death, and all the rich and powerful, noble and humble, won't escape.'",
        "source": "T03n0189_001:0623c18_1"
    },
    {
        "source_sentence": "「『諸行無常，　　是生滅法；",
        "translation": "'All conditioned forces are impermanent, which is the law of arising and ceasing.",
        "source": "T03n0189_001:0623c20_2"
    },
    {
        "source_sentence": "　　生滅滅已，　　寂滅為樂。』",
        "translation": "After arising and ceasing cease, cessation becomes bliss.'",
        "source": "T03n0189_001:0623c20_2"
    },
    {
        "source_sentence": "於是菩薩即說偈言：「爾時菩薩語天子言：『此偈乃是過去諸佛之所共說，",
        "translation": "The bodhisattva then spoke these verses: At that moment the Bodhisattva said to the celestial being, These verses were taught by all the buddhas of the past.",
        "source": "T03n0189_001:0623c20_2"
    },
    {
        "source_sentence": "諸行性相法皆如是；",
        "translation": "The nature and characteristics of conditioned states are all like this.",
        "source": "T03n0189_001:0623c24_3"
    },
    {
        "source_sentence": "汝等今者勿生憂惱，我於生死無量劫來，今者唯有此一生在，不久當得離於諸行。",
        "translation": "I have been in birth and death for immeasurable kalpas, but now only this one lifetime remains. Soon I will be able to leave all conditioned states of existence.",
        "source": "T03n0189_001:0623c24_4"
    },
    {
        "source_sentence": "汝等當知，今是度脫眾生之時，我應下生閻浮提中，迦毘羅斾兜國，甘蔗苗裔，",
        "translation": "You should know that now is the time for liberation of sentient beings. I should be reborn in Jambudvfpa, as a sugarcane seedling native of Kapilavastu.",
        "source": "T03n0189_001:0623c26_5"
    },
    {
        "source_sentence": "釋姓種族，白淨王家。",
        "translation": "The Śākya clan belonged to the white royal family.",
        "source": "T03n0189_001:0623c28_6"
    },
    {
        "source_sentence": "我生於彼，遠離父母，棄捨妻子及轉輪王位，出家學道，勤修苦行，降伏魔怨，",
        "translation": "I was born there, separated from my parents, abandoned my wife and the throne of a universal ruler, renounced domestic life to study the path, diligently practiced austerities, and conquered Māra’s enemies.",
        "source": "T03n0189_001:0623c29_7"
    },
    {
        "source_sentence": "成一切種智，轉於法輪。",
        "translation": "He accomplishes all kinds of cognition and turns the Dharma wheel.",
        "source": "T03n0189_001:0624a02_0"
    },
    {
        "source_sentence": "一切世間天人魔梵，所不能轉，亦依過去諸佛所行法式，廣利一切諸天人眾，",
        "translation": "All the worlds of gods, humans, Māras, and Brahmās are unable to change it. They also rely on the teachings practiced by past buddhas to extensively benefit all sentient beings.",
        "source": "T03n0189_001:0624a02_1"
    },
    {
        "source_sentence": "建大法幢，傾倒魔幢，竭煩惱海，淨八正路，以諸法印，印眾生心；",
        "translation": "They built great banners of teaching, overturned the banners of demons, exhausted the ocean of afflictions, and purified the eightfold right path; they stamped the minds of sentient beings with the mudrās of all teachings.",
        "source": "T03n0189_001:0624a04_2"
    },
    {
        "source_sentence": "設大法會，請諸天人。",
        "translation": "He set up a great assembly of the Dharma and invited gods and humans.",
        "source": "T03n0189_001:0624a05_3"
    },
    {
        "source_sentence": "汝等爾時亦當皆同在於此會，飡受法食；",
        "translation": "At that time you should all be equally present in this assembly and accept the food of the Dharma with affection.",
        "source": "T03n0189_001:0624a06_4"
    },
    {
        "source_sentence": "以是因緣，不應憂惱。』",
        "translation": "Because of these causes and conditions, you shouldn't grieve.'",
        "source": "T03n0189_001:0624a07_5"
    },
    {
        "source_sentence": "「『我於此不久，　　當下閻浮提，",
        "translation": "'Soon after this, I will descend down to Jambudvīpa.",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "　　迦毘羅斾兜，　　白淨王宮生；",
        "translation": "Kapilavastu was born in the palace of the White Pure King.",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "　　辭父母親屬，　　捨轉輪王位；",
        "translation": "He renounced the throne of universal rulership, leaving his parents and relatives behind.",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "　　出家行學道，　　成一切種智。",
        "translation": "Having renounced the householder’s life, they practice and study the path And attain omniscience.",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "　　建立正法幢，　　能竭煩惱海，",
        "translation": "Established as a banner of the true teaching, they can dry up the ocean of afflictions.",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "　　閉塞惡趣門，　　淨開八正道。",
        "translation": "They shut the door to bad destinies and purify the eightfold right path.",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "　　廣利諸天人，　　其數不可計；",
        "translation": "Their vast benefits to gods and humans cannot be counted.",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "　　以是因緣故，　　不應生憂惱。』",
        "translation": "Because of these causes and conditions, grief shouldn't arise.'",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "爾時菩薩，以偈頌曰：「爾時菩薩舉身毛孔皆放光明；",
        "translation": "It was then that the enlightening being uttered these verses:",
        "source": "T03n0189_001:0624a07_6"
    },
    {
        "source_sentence": "諸天子等聞菩薩言，又復見身出大光明，歡喜踴躍，離諸憂苦。",
        "translation": "The celestials and others heard the bodhisattva's words, saw a great ray of light emanate from his body, rejoiced, and were freed from their grief and suffering.",
        "source": "T03n0189_001:0624a17_7"
    },
    {
        "source_sentence": "各心念言：『菩薩不久當成正覺。』",
        "translation": "Each mind thinks, 'Soon, the bodhisattva will become perfectly enlightened.'",
        "source": "T03n0189_001:0624a19_8"
    },
    {
        "source_sentence": "「爾時菩薩觀降胎時至，即乘六牙白象，發兜率宮；",
        "translation": "“Then the enlightening being Bodhisattva, observing the time of his descent into the womb, rose from the palace of Tuṣita Heaven on a white elephant with sixteen-horse chariot.",
        "source": "T03n0189_001:0624a20_0"
    },
    {
        "source_sentence": "無量諸天，作諸伎樂，燒眾名香，散天妙花；",
        "translation": "Innumerable gods performed music, burned various kinds of famous incense, and scattered heavenly flowers.",
        "source": "T03n0189_001:0624a21_1"
    },
    {
        "source_sentence": "隨從菩薩，滿虛空中，放大光明，普照十方；",
        "translation": "The enlightening beings following them filled the sky, emanating great rays of light that shone everywhere in the ten directions.",
        "source": "T03n0189_001:0624a22_2"
    },
    {
        "source_sentence": "以四月八日明星出時，降神母胎。",
        "translation": "On the eighth day of the fourth month, when the stars emerged, he descended to his mother's womb.",
        "source": "T03n0189_001:0624a23_3"
    },
    {
        "source_sentence": "于時摩耶夫人，於眠寤之際，見菩薩乘六牙白象騰虛而來，從右脇入，",
        "translation": "At that time Lady Maya saw the Bodhisattva riding on a white elephant with sixteen-horse chariot coming from her right side.",
        "source": "T03n0189_001:0624a24_0"
    },
    {
        "source_sentence": "影現於外如處琉璃；",
        "translation": "The outer surface of the image is like a patch of lapis lazuli.",
        "source": "T03n0189_001:0624a25_1"
    },
    {
        "source_sentence": "夫人體安快樂，如服甘露，顧見自身，如日月照，心大歡喜，踊躍無量。",
        "translation": "The queen’s body was as peaceful and blissful as if she had drunk the sweet dew of immortality. Looking at herself, she looked as if the sun and moon shone upon her. Her heart was greatly joyous and infinitely",
        "source": "T03n0189_001:0624a26_2"
    },
    {
        "source_sentence": "見此相已，豁然而覺，生希有心，即便往至白淨王所，而白王言：『我於向者眠寤之際，",
        "translation": "Having seen these signs, Sudhana suddenly awoke and thought with great wonder. He immediately went to King Bimbisāra and said to him:",
        "source": "T03n0189_001:0624a27_3"
    },
    {
        "source_sentence": "其狀如夢，見諸瑞相，極為奇特。』",
        "translation": "It's shaped like a dream, and when it sees the auspicious signs, it's extremely rare.'",
        "source": "T03n0189_001:0624a29_4"
    },
    {
        "source_sentence": "王即答言：『我向亦見有大光明，又復覺汝顏貌異常，汝可為說所見瑞相。』",
        "translation": "The king then answered, 'I've also seen a great ray of light in the past, and I've also perceived that your appearance is abnormal; you can tell me the auspicious signs you've seen.'",
        "source": "T03n0189_001:0624b01_5"
    },
    {
        "source_sentence": "「『見有乘白象，　　皎淨如日月；",
        "translation": "Seeing a white elephant riding on a carriage, It shines as bright and pure as the sun and moon.",
        "source": "T03n0189_001:0624b03_6"
    },
    {
        "source_sentence": "　　釋梵諸天眾，　　皆悉執寶幢，",
        "translation": "The gods Indra and Brahmā All held jeweled banners.",
        "source": "T03n0189_001:0624b03_6"
    },
    {
        "source_sentence": "　　燒香散天花，　　并作眾伎樂；",
        "translation": "They burned incense, scattered heavenly flowers, And performed various music and dances.",
        "source": "T03n0189_001:0624b03_6"
    },
    {
        "source_sentence": "　　充滿虛空中，　　圍繞而來下。",
        "translation": "Filling the sky, They surround it and come down.",
        "source": "T03n0189_001:0624b03_6"
    },
    {
        "source_sentence": "　　來入我右脇，　　猶如處琉璃；",
        "translation": "Come and enter my right hypochondrium, just as if you were to place a piece of lapis lazuli.",
        "source": "T03n0189_001:0624b03_6"
    },
    {
        "source_sentence": "　　今以現大王，　　此為何瑞相？』",
        "translation": "Now that you've shown the great king, what's this auspicious sign?'",
        "source": "T03n0189_001:0624b03_6"
    },
    {
        "source_sentence": "夫人即便具說上事，以偈頌曰：「爾時白淨王，見摩耶夫人諸瑞相已，",
        "translation": "The queen then explained the above matter in verse: At that time King Bimbisāra, seeing the miraculous signs of Lady Maya’s appearance, said to the king, “May your majesty have mercy on me.",
        "source": "T03n0189_001:0624b03_6"
    },
    {
        "source_sentence": "歡喜踊躍，不能自勝；",
        "translation": "They were overjoyed and jumped for joy, unable to control themselves.",
        "source": "T03n0189_001:0624b11_7"
    },
    {
        "source_sentence": "即便遣請善相婆羅門，以妙香花種種飲食而供養之。",
        "translation": "He then sent an invitation to the good-looking brāhmaṇa and offered him various foods and drinks of exquisitely fragrant flowers as an offering.",
        "source": "T03n0189_001:0624b12_8"
    },
    {
        "source_sentence": "供養畢已，示夫人右脇并說瑞相，白婆羅門言：『願為占之，有何等異？』",
        "translation": "After he had finished making the offering, he showed his wife to her right side and explained the auspicious signs, saying to the Brāhmaṇa, 'May I divine it for you, what's wrong with that?'",
        "source": "T03n0189_001:0624b13_9"
    },
    {
        "source_sentence": "時婆羅門，即占之曰：『大王！",
        "translation": "The Brāhmaṇa then divined it and said, 'Great king!",
        "source": "T03n0189_001:0624b15_10"
    },
    {
        "source_sentence": "夫人所懷太子，諸善妙相，不可具說，今當為王略言之耳。",
        "translation": "The good and marvelous features of the prince held by the queen cannot be described in detail. I shall now give a brief account of them for the king’s sake.",
        "source": "T03n0189_001:0624b15_11"
    },
    {
        "source_sentence": "大王當知，今此夫人胎中之子，必能光顯釋迦種族，降胎之時，放大光明，",
        "translation": "Great king, you should know that this queen’s child in the womb will surely be able to manifest the lineage of the Śākya clan. At the time of her descent into the womb she will emanate a ray of light like this:",
        "source": "T03n0189_001:0624b17_12"
    },
    {
        "source_sentence": "諸天釋梵，執侍圍繞，此相必是正覺之瑞，若不出家，為轉輪聖王，王四天下，",
        "translation": "The gods, Indra and Brahmā, surrounded by their attendants, will surely be signs of enlightenment. If you do not renounce household life, you will become the universal ruler who turns the sacred wheel and reigns",
        "source": "T03n0189_001:0624b19_13"
    },
    {
        "source_sentence": "七寶自至，千子具足。』",
        "translation": "Seven treasures are self-accompanied, and a thousand sons are fully endowed.'",
        "source": "T03n0189_001:0624b20_14"
    },
    {
        "source_sentence": "時王聞此婆羅門言，深自慶幸，踊躍無量；",
        "translation": "The king, hearing the words of this brahman, was deeply delighted and jumped for joy.",
        "source": "T03n0189_001:0624b21_15"
    },
    {
        "source_sentence": "即以金銀雜寶象馬車乘，及以村邑，而用供給此婆羅門。",
        "translation": "He then offered this brahman an elephant-horse chariot made of gold, silver, mixed treasures, elephants, horses, carts, villages, and towns.",
        "source": "T03n0189_001:0624b22_16"
    },
    {
        "source_sentence": "時摩耶夫人，以其婇女，并及珍寶，亦以奉施。",
        "translation": "Lady Māyā then offered her courtesy, along with the treasures and jewels, to him.",
        "source": "T03n0189_001:0624b23_17"
    },
    {
        "source_sentence": "「自從菩薩處胎以來，摩耶夫人，日更修行六波羅蜜；",
        "translation": "“Since the enlightening being was in the womb, Lady Maya had cultivated the practice of the six transcendent ways day after day.",
        "source": "T03n0189_001:0624b24_18"
    },
    {
        "source_sentence": "天獻飲食，自然而至，不復樂於人間之味；",
        "translation": "The gods offered food and drink but they arrived spontaneously, no longer enjoying the taste of the human world.",
        "source": "T03n0189_001:0624b25_19"
    },
    {
        "source_sentence": "三千大千世界，常皆大明，其界中間幽冥之處，日月威光所不能照，亦皆朗然。",
        "translation": "The 3,000 great one-thousand worlds are always bright, and in the midst of those worlds there are mysterious places where the sun and moon can't shine with their authoritative radiance, and they're all brilliant.",
        "source": "T03n0189_001:0624b26_20"
    },
    {
        "source_sentence": "其中眾生各得相見，共相謂言：『此中云何忽生眾生？』",
        "translation": "The sentient beings among them each got to see each other and said to each other, 'How are the sentient beings suddenly born here?'",
        "source": "T03n0189_001:0624b28_21"
    },
    {
        "source_sentence": "菩薩降胎之時，三千大千世界十八相動，清涼香風起於四方，諸抱疾者皆悉除愈，",
        "translation": "When the enlightening being descended into the womb, the great manifold cosmos moved in eighteen ways; a breeze of fragrance and warmth rose in all directions. All those who suffered from pain were cured.",
        "source": "T03n0189_001:0624c01_0"
    },
    {
        "source_sentence": "貪欲瞋癡亦皆休息。",
        "translation": "Both craving, desire, anger, and delusion are also at rest.",
        "source": "T03n0189_001:0624c02_1"
    },
    {
        "source_sentence": "「爾時兜率天宮，有一天子，作是念言：『菩薩已生白淨王宮，我亦當復下生人間，",
        "translation": "“At that time the celestial beings in the palace of the Tushita heaven had this thought:",
        "source": "T03n0189_001:0624c04_0"
    },
    {
        "source_sentence": "菩薩成佛，我得在先為其眷屬，供養聽法。』",
        "translation": "When the bodhisattva becomes a buddha, I'll first make offerings to his retinue and listen to the teaching.'",
        "source": "T03n0189_001:0624c05_1"
    },
    {
        "source_sentence": "作此念已，即便下生王舍城中，明月種姓，旃陀羅及多王家。",
        "translation": "After he had this thought, he was even reborn in the city of Rājagṛha, with the name Mañjuśrī as his family and the house of Candra and King Sadāparibhūta.",
        "source": "T03n0189_001:0624c06_2"
    },
    {
        "source_sentence": "復有天子，生舍衛國王家；",
        "translation": "Again, there was a celestial being born in the house of the king of Sāvatthī.",
        "source": "T03n0189_001:0624c08_3"
    },
    {
        "source_sentence": "復有天子，生偷羅厥叉國王家；",
        "translation": "Again, there was a celestial being born in the house of the king of Krakucchanda.",
        "source": "T03n0189_001:0624c08_4"
    },
    {
        "source_sentence": "復有天子，生犢子國王家；",
        "translation": "Again, there was a celestial offspring born in the house of the king Vātsīputrīya.",
        "source": "T03n0189_001:0624c09_5"
    },
    {
        "source_sentence": "復有天子，生跋羅國王家；",
        "translation": "Again, there was a celestial being born in the house of the king of Vārāṇasī.",
        "source": "T03n0189_001:0624c10_6"
    },
    {
        "source_sentence": "復有天子，生盧羅國王家；",
        "translation": "Again, there was a celestial being born in the house of the king of the country of Luo.",
        "source": "T03n0189_001:0624c10_7"
    },
    {
        "source_sentence": "復有天子，生德叉尸羅國王家；",
        "translation": "Again, there was a celestial being born in the house of the king Takshakaśīla.",
        "source": "T03n0189_001:0624c11_8"
    },
    {
        "source_sentence": "復有天子，生拘羅婆國王家；",
        "translation": "Again, there was a celestial being born in the house of the king of Kālāva.",
        "source": "T03n0189_001:0624c12_9"
    },
    {
        "source_sentence": "復有天子，生婆羅門家；",
        "translation": "Again, there was a celestial being born in the house of a brahman.",
        "source": "T03n0189_001:0624c13_0"
    },
    {
        "source_sentence": "復有天子，生長者居士毘舍首陀羅家；",
        "translation": "Again, there were celestial beings growing up in the house of the householder Vaiśravaṇa.",
        "source": "T03n0189_001:0624c13_1"
    },
    {
        "source_sentence": "復有五百天子，生釋種姓家；",
        "translation": "Again, five hundred celestial beings were born in the house of the Śākya clan.",
        "source": "T03n0189_001:0624c14_2"
    },
    {
        "source_sentence": "有如是等諸天子眾，其數凡有九十九億，下生人間。",
        "translation": "There were such a multitude of celestial beings, numbering nine billion and nine hundred million in number, who descended to be born among humans.",
        "source": "T03n0189_001:0624c15_3"
    },
    {
        "source_sentence": "又從他化自在天，乃至四天王所下生者，不可稱計。",
        "translation": "Also, those born from the Paranirmitavaśavartin gods up to the four heavenly kings can't be counted.",
        "source": "T03n0189_001:0624c16_4"
    },
    {
        "source_sentence": "復有色界天王與其眷屬亦皆下生，而作仙人。",
        "translation": "Again, there's the heavenly king of the form realm and his retinues who are all born down below and become sages.",
        "source": "T03n0189_001:0624c17_5"
    },
    {
        "source_sentence": "「菩薩在胎，行、住、坐、臥，無所妨礙，又不令母有諸苦患。",
        "translation": "“When the bodhisattva is in the womb, he walks, stands, sits, and lies down without obstruction, and doesn’t cause his mother to experience any pain or suffering.",
        "source": "T03n0189_001:0624c18_6"
    },
    {
        "source_sentence": "菩薩晨朝於母胎中，為色界諸天，說種種法。",
        "translation": "In the morning, the bodhisattva was in his mother's womb and explained various teachings to the gods of the form realm.",
        "source": "T03n0189_001:0624c20_0"
    },
    {
        "source_sentence": "至日中時，為欲界諸天，亦說諸法。",
        "translation": "When it reaches midday, he explains the teachings to the gods in the desire realm.",
        "source": "T03n0189_001:0624c21_1"
    },
    {
        "source_sentence": "於日晡時，又復為諸鬼神說法。",
        "translation": "At sunset, he also taught the Dharma to the ghosts and spirits.",
        "source": "T03n0189_001:0624c21_2"
    },
    {
        "source_sentence": "於夜三時，亦復如是，成熟利益無量眾生。",
        "translation": "At the three watches of the night, it's likewise, ripening and benefiting measureless sentient beings.",
        "source": "T03n0189_001:0624c22_3"
    },
    {
        "source_sentence": "菩薩在胎，夫人婇女有來禮拜而供養者；",
        "translation": "When the enlightening being was in the womb, all the maidservants and nymphs came to pay their respects.",
        "source": "T03n0189_001:0624c23_4"
    },
    {
        "source_sentence": "或復有來作是願言：『當令得成轉輪聖王。』",
        "translation": "Perhaps another person comes along and makes this vow, saying, 'I will cause you to become a wheel-turning sage king.'",
        "source": "T03n0189_001:0624c24_5"
    },
    {
        "source_sentence": "菩薩聞已，心不喜樂。",
        "translation": "After hearing it, the bodhisattva doesn't rejoice in his heart.",
        "source": "T03n0189_001:0624c25_6"
    },
    {
        "source_sentence": "或復有來作是願言：『當令得成一切種智。』",
        "translation": "Perhaps another person comes along and makes this vow, saying, 'I will cause them to attain all kinds of cognition.'",
        "source": "T03n0189_001:0624c26_7"
    },
    {
        "source_sentence": "菩薩聞已，心大歡喜。",
        "translation": "Having heard it, the bodhisattva was greatly delighted.",
        "source": "T03n0189_001:0624c27_8"
    },
    {
        "source_sentence": "「菩薩處胎，垂滿十月，身諸支節及以相好，皆悉具足，亦使其母諸根寂定，",
        "translation": "“When the enlightening being was in the womb for ten months, all his limbs and embellishments were perfected. He also caused his mother’s sense faculties to be tranquil and concentrated.",
        "source": "T03n0189_001:0624c27_9"
    },
    {
        "source_sentence": "樂處園林，不喜憒鬧。",
        "translation": "They are happy to live in a garden or forest and do not delight in noisy music.",
        "source": "T03n0189_001:0624c29_10"
    },
    {
        "source_sentence": "時白淨王，心自思惟：『夫人懷妊，日月將滿，而不見其有生產相。』",
        "translation": "He then said to King Śubhavyūha, thinking to himself, 'My wife is pregnant, and she's about to be born every day, but I don't see her with the characteristic of birth.'",
        "source": "T03n0189_001:0625a01_11"
    },
    {
        "source_sentence": "作此念時，會遇夫人遣信白王：『我今欲出園林遊觀。』",
        "translation": "When he had this thought, he met his wife and sent a letter to the king, saying, 'Now, I want to leave the garden and excursion.'",
        "source": "T03n0189_001:0625a02_12"
    },
    {
        "source_sentence": "時王聞此益懷歡喜；",
        "translation": "When the king heard these words he was overjoyed and rejoiced.",
        "source": "T03n0189_001:0625a03_13"
    },
    {
        "source_sentence": "即勅於外，令淨掃灑藍毘尼園，更使栽植諸妙花果；",
        "translation": "He ordered the outside world to sweep out the blue fig tree grove and also planted various kinds of wonderful flowers and fruit.",
        "source": "T03n0189_001:0625a04_14"
    },
    {
        "source_sentence": "流泉浴池，悉令清潔；",
        "translation": "The flowing fountains and bathing ponds were all made clean.",
        "source": "T03n0189_001:0625a05_15"
    },
    {
        "source_sentence": "欄楯階陛，皆以七寶而為莊嚴。",
        "translation": "The railings and staircases are all adorned with the seven kinds of treasure.",
        "source": "T03n0189_001:0625a06_16"
    },
    {
        "source_sentence": "翡翠鴛鴦，鸞鳳凰鷖，異類眾鳥，鳴集其中；",
        "translation": "The emerald trees, mandarin ducks, lions, phoenixes, and other birds of various species singed in this monastery.",
        "source": "T03n0189_001:0625a06_17"
    },
    {
        "source_sentence": "懸繒幡蓋，散花燒香，作諸伎樂，猶如帝釋歡喜之園。",
        "translation": "They hang silhouetted banners and canopies, scattered flowers and burned incense, and performed various kinds of music like Indra’s joyful park.",
        "source": "T03n0189_001:0625a07_18"
    },
    {
        "source_sentence": "又勅中間所經行處，皆令嚴淨種種莊嚴。",
        "translation": "He also ordered all the places where he walked to and fro to be adorned with various adornments.",
        "source": "T03n0189_001:0625a09_19"
    },
    {
        "source_sentence": "又勅嚴辦十萬七寶車輦，一一車輦，雕玩殊絕；",
        "translation": "I also ordered that carriages made of one hundred thousand seventy-thousand kinds of jewels be arranged in an ornate array, each carriage adorned with a variety of carvings and plays.",
        "source": "T03n0189_001:0625a10_20"
    },
    {
        "source_sentence": "又復勅外，嚴辦四軍，象兵、馬兵、車兵、步兵；",
        "translation": "Again, the emperor ordered that four armies be deployed: elephant troops, cavalry, horse troops, chariot troops, and infantry.",
        "source": "T03n0189_001:0625a11_21"
    },
    {
        "source_sentence": "又復選取後宮婇女，容顏端正，不老不少，氣性調和，聰慧明了，其數凡有八萬四千，",
        "translation": "Again, the goddess of the latter palace had a handsome countenance and was neither old nor young. Her vitality was harmonious and she was intelligent and perceptive. There were altogether eighty-four thousand such women.",
        "source": "T03n0189_001:0625a12_22"
    },
    {
        "source_sentence": "以用給侍摩耶夫人。",
        "translation": "He gave it to Lady Māyā, his attendant.",
        "source": "T03n0189_001:0625a14_23"
    },
    {
        "source_sentence": "又復擇取八萬四千端正童女，著妙瓔珞嚴身之具，齎持香花，先往住彼藍毘尼園。",
        "translation": "Again, they selected eighty-four thousand handsome girls, adorned themselves with beautiful jewelry and body ornaments, carried incense and flowers, and went first to live in the Lumbinī grove.",
        "source": "T03n0189_001:0625a14_24"
    },
    {
        "source_sentence": "王又勅諸群臣百官，夫人去者，皆悉侍從。",
        "translation": "The king also ordered his ministers and hundreds of officials to accompany the queen’s departure.",
        "source": "T03n0189_001:0625a16_25"
    },
    {
        "source_sentence": "於是夫人，即昇寶輿，與諸官屬并及婇女，前後導從，往藍毘尼園。",
        "translation": "The lady then ascended the jeweled carriage and went to the Lumbinī grove, accompanied by her officials and court ladies.",
        "source": "T03n0189_001:0625a17_26"
    },
    {
        "source_sentence": "爾時復有天龍八部，亦皆隨從，充滿虛空。",
        "translation": "At the time, there were also gods, dragons, and eight groups of people who filled the sky with them.",
        "source": "T03n0189_001:0625a19_27"
    },
    {
        "source_sentence": "「爾時夫人，既入園已，諸根寂靜；",
        "translation": "“At that time the queen’s faculties were at peace as soon as she entered the park.",
        "source": "T03n0189_001:0625a20_28"
    },
    {
        "source_sentence": "十月滿足，於二月八日日初出時，夫人見彼園中，有一大樹，名曰無憂，",
        "translation": "When the duration of the tenth month was over, on the first day of the eighth month, when the sun began to rise on the eighth day of the second month, the queen saw in that park a large tree named Aśoka.",
        "source": "T03n0189_001:0625a20_29"
    },
    {
        "source_sentence": "花色香鮮，枝葉分布，極為茂盛；",
        "translation": "The flowers are colorful and fragrant, with branches and leaves spreading in abundance.",
        "source": "T03n0189_001:0625a22_30"
    },
    {
        "source_sentence": "即舉右手，欲牽摘之；",
        "translation": "He then raised his right hand and wished to pull it away.",
        "source": "T03n0189_001:0625a23_31"
    },
    {
        "source_sentence": "菩薩漸漸從右脇出。",
        "translation": "The bodhisattva gradually emerged from his right side.",
        "source": "T03n0189_001:0625a23_32"
    },
    {
        "source_sentence": "于時樹下，亦生七寶七莖蓮花，大如車輪；",
        "translation": "At that time under the trees also grew seven-jeweled lotus flowers with seven stalks, as large as a carriage wheel.",
        "source": "T03n0189_001:0625a24_33"
    },
    {
        "source_sentence": "菩薩即便墮蓮花上，無扶侍者，自行七步，舉其右手而師子吼：『我於一切天人之中最尊最勝，",
        "translation": "The bodhisattva then fell to the top of a lotus flower without any attendants. Seven paces on his own, he raised his right hand and roared with a lion’s roar: Among all the devas and humans, I am the most",
        "source": "T03n0189_001:0625a25_34"
    },
    {
        "source_sentence": "無量生死於今盡矣，此生利益一切人天。』",
        "translation": "Measureless birth and death are now over, and this birth benefits all humans and gods.'",
        "source": "T03n0189_001:0625a27_35"
    },
    {
        "source_sentence": "說是言已，時四天王，即以天繒接太子身，置寶机上；",
        "translation": "Having said these words, the four guardian gods then took the prince’s body and placed it on a jeweled table.",
        "source": "T03n0189_001:0625a28_36"
    },
    {
        "source_sentence": "釋提桓因手執寶蓋，大梵天王又持白拂，侍立左右；",
        "translation": "Śakra Devānām-Indra held a jeweled canopy in his hand and Mahābrahmā, holding a white whisk in his hand, stood to his left and right.",
        "source": "T03n0189_001:0625a29_37"
    },
    {
        "source_sentence": "難陀龍王、優波難陀龍王，於虛空中，吐清淨水，一溫一涼，灌太子身——身黃金色有三十二相，",
        "translation": "The dragon kings Nanda and Upananda spit forth pure water from the sky to pour it over the prince’s body, which was golden in color with thirty-two distinctive marks.",
        "source": "T03n0189_001:0625b02_38"
    },
    {
        "source_sentence": "放大光明，普照三千大千世界——天龍八部亦於空中作天伎樂，歌唄讚頌，",
        "translation": "It emanated a great ray of light that shone throughout the great manifold cosmos. The gods, dragons, and the eight kinds of celestial beings also played heavenly music in the sky, singing hymns of praise and song.",
        "source": "T03n0189_001:0625b04_39"
    },
    {
        "source_sentence": "燒眾名香，散諸妙花，又雨天衣及以瓔珞，繽紛亂墜不可稱數。",
        "translation": "They burned various kinds of famous incense and scattered exquisite flowers. Also they rained heavenly robes and jewelry, causing untold numbers of people to fall down in distress.",
        "source": "T03n0189_001:0625b06_40"
    },
    {
        "source_sentence": "「爾時摩耶夫人生太子已，身安快樂，無有苦患，歡喜踊躍，止於樹下，",
        "translation": "“At that time, the prince Māyaiputra was born. His body was at peace and he had no pain or discomfort. He was delighted and jumped up and down to rest under a tree.",
        "source": "T03n0189_001:0625b08_0"
    },
    {
        "source_sentence": "前後自然忽生四井，其水香潔具八功德。",
        "translation": "The four wells that had been spontaneously produced before and after the stupas all possessed the eight kinds of meritorious qualities.",
        "source": "T03n0189_001:0625b09_1"
    },
    {
        "source_sentence": "爾時摩耶夫人與其眷屬，隨所欲須，自恣洗漱。",
        "translation": "At the time, Lady Māyā and her retinue washed themselves freely as they wished.",
        "source": "T03n0189_001:0625b10_2"
    },
    {
        "source_sentence": "復有諸夜叉王，皆悉圍繞，守護太子及摩耶夫人。",
        "translation": "There were also other yakṣa kings, all surrounded by them, guarding the prince and Lady Maya.",
        "source": "T03n0189_001:0625b11_3"
    },
    {
        "source_sentence": "當爾之時，閻浮提人，乃至阿迦膩吒天，雖離喜樂，皆亦於此歡喜讚歎：『一切種智，",
        "translation": "At that time the people of Jambudvfpa and so on, up to the Akaniṣṭha gods, though free from joy and happiness, all rejoiced and praised this:",
        "source": "T03n0189_001:0625b12_4"
    },
    {
        "source_sentence": "今出於世，無量眾生，皆得利益；",
        "translation": "Now that he has emerged in the world, infinite sentient beings will all be benefited.",
        "source": "T03n0189_001:0625b14_5"
    },
    {
        "source_sentence": "唯願速成正覺之道，轉於法輪，廣度眾生。』",
        "translation": "May I quickly achieve the path of right awakening, turn the wheel of the Dharma, and save sentient beings everywhere?'",
        "source": "T03n0189_001:0625b15_6"
    },
    {
        "source_sentence": "唯有魔王，獨懷愁惱，不安本座。",
        "translation": "Only the king of Māra alone was grieved and unsettled at his seat.",
        "source": "T03n0189_001:0625b16_7"
    },
    {
        "source_sentence": "「當爾之時，所感瑞應，三十有四：一者、十方世界，皆悉大明；",
        "translation": "At that time there were thirty-four such signs. The first was the great luminosity of all the worlds in the ten directions.",
        "source": "T03n0189_001:0625b17_8"
    },
    {
        "source_sentence": "二者、三千大千世界，十八相動丘墟平坦；",
        "translation": "The second was that in the great manifold cosmos of the 3,000 great one-thousand worlds the eighteen phases moved and the hills and mounds were level.",
        "source": "T03n0189_001:0625b18_9"
    },
    {
        "source_sentence": "三者、一切枯木悉更敷榮，國界自然生奇特樹；",
        "translation": "The third was that all withered trees grew ever more luxuriant, and special trees sprang up naturally from the boundaries of the land.",
        "source": "T03n0189_001:0625b19_10"
    },
    {
        "source_sentence": "四者、園苑生異甘果；",
        "translation": "The fourth is that the park produces extraordinary sweet fruits.",
        "source": "T03n0189_001:0625b20_11"
    },
    {
        "source_sentence": "五者、陸地生寶蓮花大如車輪；",
        "translation": "The fifth was that jeweled lotus blossoms produced on land were as large as a carriage wheel.",
        "source": "T03n0189_001:0625b21_12"
    },
    {
        "source_sentence": "六者、地中伏藏悉自發出；",
        "translation": "The sixth is that all the subdued stores in the earth are emitted by themselves.",
        "source": "T03n0189_001:0625b22_0"
    },
    {
        "source_sentence": "七者、諸藏珍寶放大光明；",
        "translation": "The seventh was the great ray of light emanating from all the treasures in the treasury.",
        "source": "T03n0189_001:0625b22_1"
    },
    {
        "source_sentence": "八者、諸天妙服自然來降；",
        "translation": "The eighth is that the celestial beings naturally descend in beautiful robes.",
        "source": "T03n0189_001:0625b23_2"
    },
    {
        "source_sentence": "九者、眾川萬流恬靜澄清；",
        "translation": "The ninth is that all the rivers and streams of myriad streams are tranquil and pure.",
        "source": "T03n0189_001:0625b23_3"
    },
    {
        "source_sentence": "十者、風止雲除空中明淨；",
        "translation": "The tenth is that the wind stops clouds and removes light and purity from the sky.",
        "source": "T03n0189_001:0625b24_4"
    },
    {
        "source_sentence": "十一者、香風芬芳從四方來，細雨潤澤以歛飛塵；",
        "translation": "The eleventh was that a fragrant wind of fragrance came from the four directions, showering flying dust with subtle rain and moisture.",
        "source": "T03n0189_001:0625b24_5"
    },
    {
        "source_sentence": "十二者、國中疾病皆悉除愈；",
        "translation": "The twelfth was that all the sicknesses in his country were cured.",
        "source": "T03n0189_001:0625b26_6"
    },
    {
        "source_sentence": "十三者、國內宮舍無不明曜，燈燭之光不復為用；",
        "translation": "The thirteenth was that there were no unknown lights in the houses of the royal palaces, and the light of a candlelight would no longer be used.",
        "source": "T03n0189_001:0625b26_7"
    },
    {
        "source_sentence": "十四者、日月星辰停住不行；",
        "translation": "The fourteenth is that the sun, moon, stars, and other celestial bodies are neither stationary nor active.",
        "source": "T03n0189_001:0625b27_8"
    },
    {
        "source_sentence": "十五者、毘舍佉星下現人間，待太子生；",
        "translation": "(15) The fifteenth omen is that the crown prince will appear in the human world under Vaiśravaṇa and await his birth.",
        "source": "T03n0189_001:0625b28_9"
    },
    {
        "source_sentence": "十六者、諸梵天王執素寶蓋，列覆宮上；",
        "translation": "The sixteenth was that the great celestial kings of the Brahma heavens, holding canopies made of plain jewels, covered the palace.",
        "source": "T03n0189_001:0625b29_10"
    },
    {
        "source_sentence": "十七者、八方諸仙人師奉寶來獻；",
        "translation": "The seventeenth was that the sages of the eighteen directions had come to offer their treasures to the Buddha.",
        "source": "T03n0189_001:0625c01_11"
    },
    {
        "source_sentence": "十八者、天百味食自然在前；",
        "translation": "The eighteenth is that the food of all kinds of flavors naturally appears before them.",
        "source": "T03n0189_001:0625c02_12"
    },
    {
        "source_sentence": "十九者、無數寶瓶盛諸甘露；",
        "translation": "(19) The nineteenth was an innumerable number of jeweled vases filled with ambrosia.",
        "source": "T03n0189_001:0625c02_13"
    },
    {
        "source_sentence": "二十者、諸天妙車載寶而至；",
        "translation": "The twenty-first was the arrival of divine chariots carrying treasures.",
        "source": "T03n0189_001:0625c03_14"
    },
    {
        "source_sentence": "二十一者、無數白象子首戴蓮花，列住殿前；",
        "translation": "The twenty-first was an incalculable number of white elephants, carrying lotus flowers on their heads, standing before the palace.",
        "source": "T03n0189_001:0625c04_15"
    },
    {
        "source_sentence": "二十二者、天紺馬寶自然而來；",
        "translation": "The twenty-second was that the divine jewel of the dark blue horse came naturally.",
        "source": "T03n0189_001:0625c05_16"
    },
    {
        "source_sentence": "二十三者、五百白師子王從雪山出，息其惡情，心懷歡喜，羅住城門；",
        "translation": "The twenty-third and the five hundred white lion kings emerged from the Himalayan mountains, extinguished their evil feelings, were delighted, and stayed at the city gates.",
        "source": "T03n0189_001:0625c05_17"
    },
    {
        "source_sentence": "二十四者、諸天伎女於虛空中作妙音樂；",
        "translation": "(24) Twenty-fourth, the heavenly maidens performed sublime music in the sky.",
        "source": "T03n0189_001:0625c07_18"
    },
    {
        "source_sentence": "二十五者、諸天玉女執孔雀拂，現宮牆上；",
        "translation": "The twenty-fifth was that the celestial maidens, holding a peacock’s whisk in their hands, appeared above the walls of the palace.",
        "source": "T03n0189_001:0625c08_19"
    },
    {
        "source_sentence": "二十六者、諸天玉女各持金瓶盛滿香汁，列住空中；",
        "translation": "26. Each of the celestial jadelike maidens, holding a golden pitcher filled with fragrant juice, stood in the sky.",
        "source": "T03n0189_001:0625c09_20"
    },
    {
        "source_sentence": "二十七者、諸天歌頌讚太子德；",
        "translation": "The twenty-seventh was that the heavenly gods sang praises of the prince’s virtues.",
        "source": "T03n0189_001:0625c10_21"
    },
    {
        "source_sentence": "二十八者、地獄休息毒痛不行；",
        "translation": "The twenty-eight [factors] are:",
        "source": "T03n0189_001:0625c11_22"
    },
    {
        "source_sentence": "二十九者、毒蟲隱伏，惡鳥善心；",
        "translation": "29. The poisonous insects are subdued, with bad birds and good minds.",
        "source": "T03n0189_001:0625c12_23"
    },
    {
        "source_sentence": "三十者、諸惡律儀一時慈悲；",
        "translation": "The thirtieth is that all the bad forms of restraint are simultaneously accompanied by compassion.",
        "source": "T03n0189_001:0625c12_24"
    },
    {
        "source_sentence": "三十一者、國內孕婦產者悉男，其有百病自然除愈；",
        "translation": "The thirty-first is that all those who give birth in the country are male. If they have a hundred illnesses, they will naturally be cured.",
        "source": "T03n0189_001:0625c13_25"
    },
    {
        "source_sentence": "三十二者、一切樹神化作人形，悉來禮侍；",
        "translation": "The thirty-second was that all the tree spirits, transforming themselves into human forms, came to pay their respects.",
        "source": "T03n0189_001:0625c14_26"
    },
    {
        "source_sentence": "三十三者、諸餘國王各齎名寶同來臣伏；",
        "translation": "33. The other kings each brought their names and jewels with them to the thirty-three.",
        "source": "T03n0189_001:0625c15_27"
    },
    {
        "source_sentence": "三十四者、一切人天無非時語。",
        "translation": "34. All humans and gods do not speak at an ungodly hour.",
        "source": "T03n0189_001:0625c16_28"
    },
    {
        "source_sentence": "「爾時諸婇女眾見此瑞相，極大歡喜，自相謂言：『太子今生，有如此等嘉祥之事，",
        "translation": "“At that time the court ladies saw these auspicious signs and were greatly delighted. They said to each other, ‘The prince is about to be born.",
        "source": "T03n0189_001:0625c17_29"
    },
    {
        "source_sentence": "唯願長壽，無諸疾苦，勿令我等生大憂惱。』",
        "translation": "I only wish for a long life, no illness or suffering, so that we won't become greatly grieved.'",
        "source": "T03n0189_001:0625c19_30"
    },
    {
        "source_sentence": "作此言已，以天細[疊*毛]裹抱太子，至夫人所。",
        "translation": "Having said these words, he wrapped the prince in heavenly fine cotton cloth and went to his wife.",
        "source": "T03n0189_001:0625c20_31"
    },
    {
        "source_sentence": "時四天王在虛空中，恭敬隨從；",
        "translation": "The four guardian gods of heaven then flew up into the sky to follow them.",
        "source": "T03n0189_001:0625c21_32"
    },
    {
        "source_sentence": "釋提桓因執蓋來覆；",
        "translation": "Śakra, lord of the gods, came to cover it with a canopy.",
        "source": "T03n0189_001:0625c22_33"
    },
    {
        "source_sentence": "有二十八大鬼神王，在園四角，守衛奉護。",
        "translation": "Twenty-eight great kings of demons and spirits were present at the four corners of the garden, guarding and protecting it.",
        "source": "T03n0189_001:0625c22_34"
    },
    {
        "source_sentence": "爾時有一青衣，聰慧明了，從藍毘尼園，還入宮中，到白淨王所而白王言：『大王威德，",
        "translation": "It was then that a man in blue robes, intelligent and insightful, came back into the palace from the Lumbinī grove. He approached King Bimbisāra and said to him:",
        "source": "T03n0189_001:0625c23_35"
    },
    {
        "source_sentence": "轉更增進；",
        "translation": "They develop further and further.",
        "source": "T03n0189_001:0625c25_36"
    },
    {
        "source_sentence": "摩耶夫人已生太子，顏貌端正，有三十二相、八十種好；",
        "translation": "Lady Maya had already given birth to the prince, who was handsome in appearance and endowed with the thirty-two marks and eighty-eight kinds of beauty.",
        "source": "T03n0189_001:0625c25_37"
    },
    {
        "source_sentence": "墮蓮花上，自行七步，舉其右手而師子吼：「我於一切天人之中最尊最勝，",
        "translation": "He fell on top of the lotus flower, took seven steps on his own, raised his right hand, and roared with a lion's roar: Among all gods and humans, I am the most honored and superior.",
        "source": "T03n0189_001:0625c27_38"
    },
    {
        "source_sentence": "無量生死於今盡矣，此生利益一切人天。」",
        "translation": "Measureless birth and death are now over, and this birth benefits all humans and gods.",
        "source": "T03n0189_001:0625c28_39"
    },
    {
        "source_sentence": "有如是等諸奇特事，非可具說。』",
        "translation": "Such extraordinary things as these can't be described in detail.'",
        "source": "T03n0189_001:0625c29_40"
    },
    {
        "source_sentence": "時白淨王聞彼青衣說此語已，歡喜踊躍不能自勝，即脫身瓔珞而以賜之。",
        "translation": "Having heard these words, the white king of purity rejoiced and jumped joyfully but could not overcome himself. He took off his jewelry and gave it to him.",
        "source": "T03n0189_001:0626a01_41"
    },
    {
        "source_sentence": "「爾時白淨王即嚴四兵眷屬圍繞，并與一億釋迦種姓，前後導從，入藍毘尼園，",
        "translation": "At that time King Baijing, surrounded by his fourfold army and accompanied by one hundred million members of the Śākya clan, entered the Lumbinī grove.",
        "source": "T03n0189_001:0626a04_0"
    },
    {
        "source_sentence": "見彼園中天龍八部皆悉充滿；",
        "translation": "They saw that park filled with the eight kinds of celestial beings and dragons.",
        "source": "T03n0189_001:0626a05_1"
    },
    {
        "source_sentence": "到夫人所，見太子身，相好殊異，歡喜踊躍，猶如江海諸大波浪；",
        "translation": "When he arrived at the queen’s quarters, he saw that the prince’s body was as big and beautiful as a great wave in the ocean.",
        "source": "T03n0189_001:0626a06_2"
    },
    {
        "source_sentence": "慮其短壽又懷悚惕，譬如須彌山王，難可動搖；",
        "translation": "Thinking of his short life, he also harbored fear, resembling a great mountain whose king cannot be shaken.",
        "source": "T03n0189_001:0626a08_3"
    },
    {
        "source_sentence": "大地動時，此山乃動。",
        "translation": "When the earth moves, this mountain moves.",
        "source": "T03n0189_001:0626a09_4"
    },
    {
        "source_sentence": "彼白淨王素性恬靜，常無歡慼，今見太子，一喜一懼，亦復如是。",
        "translation": "That white king was always quiet and peaceful by nature, always without rejoicing. Now that he saw the prince, his feelings of joy and fear were likewise.",
        "source": "T03n0189_001:0626a09_5"
    },
    {
        "source_sentence": "摩耶夫人，為性調和。",
        "translation": "Lady Māyā, it's for the sake of sexual harmony.",
        "source": "T03n0189_001:0626a11_6"
    },
    {
        "source_sentence": "既生太子，見諸奇瑞，倍增柔軟。",
        "translation": "When the prince was born, he saw various miraculous signs and became even more pliable.",
        "source": "T03n0189_001:0626a11_7"
    },
    {
        "source_sentence": "爾時白淨王，叉手合掌，禮諸天神；",
        "translation": "At that time King Baijing knelt with his palms joined, saluted the heavenly gods and bowed to them.",
        "source": "T03n0189_001:0626a12_8"
    },
    {
        "source_sentence": "前抱太子，置於七寶象輿之上，與諸群臣後宮婇女虛空諸天，作諸伎樂，",
        "translation": "He took the prince in front of him and placed him on an elephant-drawn carriage made of the seven kinds of jewels, accompanied by his ministers.",
        "source": "T03n0189_001:0626a13_9"
    },
    {
        "source_sentence": "隨從入城。",
        "translation": "He followed them into the city.",
        "source": "T03n0189_001:0626a15_10"
    },
    {
        "source_sentence": "時白淨王及諸釋子，未識三寶，即將太子，往詣天寺；",
        "translation": "At that time King Śubhavyūha and the other sons of the Śākya clan did not know the Three Jewels, so they took the prince to a heavenly monastery.",
        "source": "T03n0189_001:0626a15_11"
    },
    {
        "source_sentence": "太子既入，梵天形像，皆從座起，禮太子足而語王言：『大王！",
        "translation": "When the prince had entered, the forms of the Brahma gods all rose from their seats and bowed at the prince's feet and said to the king, 'Great king!",
        "source": "T03n0189_001:0626a16_12"
    },
    {
        "source_sentence": "當知，今此太子天人中尊；",
        "translation": "You should know that this prince is now the most honored among gods and humans.",
        "source": "T03n0189_001:0626a17_13"
    },
    {
        "source_sentence": "虛空天神，皆悉禮敬；",
        "translation": "Celestial beings in the sky and earth all paid homage to him.",
        "source": "T03n0189_001:0626a18_14"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0189_001:0626a19_15"
    },
    {
        "source_sentence": "豈不見如此耶？",
        "translation": "Hasn't it been seen like this?",
        "source": "T03n0189_001:0626a19_16"
    },
    {
        "source_sentence": "云何而今來此禮我？』",
        "translation": "How did you come here to pay homage to me?'",
        "source": "T03n0189_001:0626a19_17"
    },
    {
        "source_sentence": "時白淨王及諸釋子，群臣內外，聞見是已，歎未曾有。",
        "translation": "He then said to King Śubhavyūha and the other Śākyamunis, a group of ministers inside and outside the palace, who had heard and seen this, that it was unprecedented.",
        "source": "T03n0189_001:0626a20_18"
    },
    {
        "source_sentence": "即將太子出於天寺，還入後宮。",
        "translation": "The prince then left the celestial temple and returned to the rear palace.",
        "source": "T03n0189_001:0626a21_19"
    },
    {
        "source_sentence": "「當爾之時，諸釋種姓，亦同一日，生五百男；",
        "translation": "On the same day, five hundred male offspring were born to all the members of the Śākya clan.",
        "source": "T03n0189_001:0626a22_20"
    },
    {
        "source_sentence": "時王廐中，象生白子；",
        "translation": "At that time an elephant in the king’s stable gave birth to a white child.",
        "source": "T03n0189_001:0626a23_21"
    },
    {
        "source_sentence": "馬生白駒；",
        "translation": "A horse gave birth to a white colt.",
        "source": "T03n0189_001:0626a23_22"
    },
    {
        "source_sentence": "牛羊亦生五色羔犢；",
        "translation": "Cows and sheep also gave birth to five-colored offspring.",
        "source": "T03n0189_001:0626a23_23"
    },
    {
        "source_sentence": "如是等類，數各五百。",
        "translation": "Each of these categories numbered five hundred in number.",
        "source": "T03n0189_001:0626a24_24"
    },
    {
        "source_sentence": "王家青衣，亦生五百蒼頭。",
        "translation": "The king's family wore blue robes and also gave rise to five hundred blue hairs.",
        "source": "T03n0189_001:0626a24_25"
    },
    {
        "source_sentence": "爾時宮中，五百伏藏，自然發出；",
        "translation": "At that time the five hundred hidden treasures in the palace emerged spontaneously.",
        "source": "T03n0189_001:0626a25_26"
    },
    {
        "source_sentence": "一一伏藏，有七寶藏，而圍繞之。",
        "translation": "Each one is surrounded by a storehouse of seven treasures.",
        "source": "T03n0189_001:0626a26_27"
    },
    {
        "source_sentence": "又有諸大國商人，從海採寶，還迦毘羅斾兜國；",
        "translation": "Again, there were merchants of various great countries who came from the sea to collect precious treasures and returned to Kapilavastu.",
        "source": "T03n0189_001:0626a27_28"
    },
    {
        "source_sentence": "彼諸商人，各齎奇寶，而來獻王。",
        "translation": "Each of those merchants brought a rare treasure and came to present it to the king.",
        "source": "T03n0189_001:0626a28_29"
    },
    {
        "source_sentence": "時白淨王，問諸商人：『汝等入海，採諸珍寶，悉皆吉利，無苦惱不？",
        "translation": "He then said to the king of Jīvaka, asking the merchants, 'Have you entered the sea to gather treasures that are all auspicious and not painful?'",
        "source": "T03n0189_001:0626a29_0"
    },
    {
        "source_sentence": "及諸伴侶，無遺落耶？』",
        "translation": "Is there no residue for the companions?'",
        "source": "T03n0189_001:0626b01_1"
    },
    {
        "source_sentence": "彼諸商人，答言：『大王！",
        "translation": "The merchants replied, 'Great king!",
        "source": "T03n0189_001:0626b02_0"
    },
    {
        "source_sentence": "所經道路，極自安隱。』",
        "translation": "The path that I'll follow will be perfectly peaceful.'",
        "source": "T03n0189_001:0626b02_1"
    },
    {
        "source_sentence": "王聞此言，甚大歡喜，即遣請諸婆羅門等。",
        "translation": "Having heard these words, the king was greatly delighted and immediately sent an invitation to all the brahmans.",
        "source": "T03n0189_001:0626b03_0"
    },
    {
        "source_sentence": "婆羅門眾皆悉集已，設諸供養，或與象馬及以七寶，田宅僮僕。",
        "translation": "Having assembled the assembly of brāhmaṇas, they offered various offerings, such as elephants, horses, the seven kinds of treasure, land, and servants.",
        "source": "T03n0189_001:0626b04_0"
    },
    {
        "source_sentence": "供養畢已，抱太子出，即便白諸婆羅門言：『當為太子作何等名？』",
        "translation": "After he had finished making the offering, he took the prince out and said to the brāhmaṇas, 'What's the name that will be given to the prince?'",
        "source": "T03n0189_001:0626b05_1"
    },
    {
        "source_sentence": "諸婆羅門，即共論議，而答王言：『太子生時，一切寶藏皆悉發出，所有諸瑞莫非吉祥，",
        "translation": "The brāhmaṇas then had a discussion with the king and replied, “When the prince was born, all kinds of jewel treasure objects appeared to him. All the various auspicious signs he possessed were not unforgettable.",
        "source": "T03n0189_001:0626b07_0"
    },
    {
        "source_sentence": "以此義故，當名太子為薩婆悉達。』",
        "translation": "Because of this meaning, he'll be called the prince Sarvâstivāda.'",
        "source": "T03n0189_001:0626b08_1"
    },
    {
        "source_sentence": "說此語時，虛空天神，即擊天鼓，燒香散花，唱言：『善哉！』",
        "translation": "When he spoke these words, the sky gods struck the celestial drum, burned incense and scattered flowers, and said, 'Good!'",
        "source": "T03n0189_001:0626b09_2"
    },
    {
        "source_sentence": "諸天人民，即便稱曰：『薩婆悉達。』",
        "translation": "The gods and people even called out, 'Suppose it's a siddhânta.'",
        "source": "T03n0189_001:0626b11_3"
    },
    {
        "source_sentence": "「爾時八王，亦於是日，與白淨王，同生太子。",
        "translation": "On that day, the eight kings were also born together with King Bimbisāra as princes.",
        "source": "T03n0189_001:0626b11_4"
    },
    {
        "source_sentence": "彼諸國王，各懷歡喜：『我今生子，有諸奇異。』",
        "translation": "The kings of those countries each rejoiced, saying, 'Now that I've given birth to a child, there are strange things.'",
        "source": "T03n0189_001:0626b12_5"
    },
    {
        "source_sentence": "而不知是薩婆悉達之瑞相也。",
        "translation": "They didn't know that this was the miraculous sign of Sāva Siddhārtha.",
        "source": "T03n0189_001:0626b13_6"
    },
    {
        "source_sentence": "皆集婆羅門，各為太子，制好名字，王舍城太子名曰頻毘娑羅；",
        "translation": "They all gathered the brāhmaṇas as princes, each named by a different name. The prince in Rājagṛha was named Bimbisara.",
        "source": "T03n0189_001:0626b14_7"
    },
    {
        "source_sentence": "舍衛國太子名婆斯匿；",
        "translation": "The prince of Sāvatthī was named Vasanti.",
        "source": "T03n0189_001:0626b16_0"
    },
    {
        "source_sentence": "偷羅拘吒國太子名拘臈婆；",
        "translation": "The prince of Krakuṭa is called Kauṣṭhila.",
        "source": "T03n0189_001:0626b16_1"
    },
    {
        "source_sentence": "犢子國太子名優陀延；",
        "translation": "The prince of Vātsīputrīya was named Udayana.",
        "source": "T03n0189_001:0626b17_2"
    },
    {
        "source_sentence": "跋羅國太子名欝陀羅延；",
        "translation": "The prince of Vārāṇasī was named Candrayana.",
        "source": "T03n0189_001:0626b17_3"
    },
    {
        "source_sentence": "盧羅國太子名曰疾光；",
        "translation": "The prince of the country of Luo was named Silent Light.",
        "source": "T03n0189_001:0626b18_4"
    },
    {
        "source_sentence": "德叉尸羅國太子名弗迦羅娑羅；",
        "translation": "The prince of Taksasila was named Pukarasara.",
        "source": "T03n0189_001:0626b18_5"
    },
    {
        "source_sentence": "拘羅婆國太子名拘羅婆。",
        "translation": "The prince of Kālāva is called Kālāva.",
        "source": "T03n0189_001:0626b19_6"
    },
    {
        "source_sentence": "「爾時白淨王普勅群臣，令訪聰明多聞，智慧善知占相，為諸世人所知識者。",
        "translation": "At the time, King Śubhavyūha universally instructed his ministers to visit intelligent and well-versed people who have wisdom and good knowledge of divination signs and are known by everyone in the world.",
        "source": "T03n0189_001:0626b20_7"
    },
    {
        "source_sentence": "群臣聞已，四方推覓。",
        "translation": "After the ministers heard this, they searched in all directions.",
        "source": "T03n0189_001:0626b22_8"
    },
    {
        "source_sentence": "時王即便於後園中，起一大殿，窓牖欄楯，七寶莊飾。",
        "translation": "The king then built a large hall in the rear garden, decorated with windows, walls, and railings, adorned with the seven kinds of treasure.",
        "source": "T03n0189_001:0626b22_9"
    },
    {
        "source_sentence": "爾時群臣，得五百婆羅門聰明知相見諸奇瑞，欲來詣王，會王遣信疾速而至。",
        "translation": "It was then that the ministers of the assembly found five hundred brahmans who were intelligent and knew they saw each other's miraculous signs, and wanted to come to the king, so they quickly arrived when the king sent a letter from the assem",
        "source": "T03n0189_001:0626b23_10"
    },
    {
        "source_sentence": "諸臣白王：『知相婆羅門，今者已到。』",
        "translation": "The ministers said to the king, 'Know that the Brāhmaṇa has arrived now.'",
        "source": "T03n0189_001:0626b25_11"
    },
    {
        "source_sentence": "王聞歡喜，即勅令前請入殿坐，設諸供養。",
        "translation": "The king was delighted to hear this, and ordered him to go in front of the monastery to ask permission to enter the hall to take his seat and make offerings.",
        "source": "T03n0189_001:0626b26_12"
    },
    {
        "source_sentence": "彼婆羅門即白王言：『我聞大王，新生太子，有諸相好奇特之瑞，願令我等悉得見之。』",
        "translation": "The Brāhmaṇa then said to the king, 'I've heard that the great king, the newly born prince, has various signs of wonder and special auspiciousness, so may we all see them.'",
        "source": "T03n0189_001:0626b27_13"
    },
    {
        "source_sentence": "時王即勅抱太子出。",
        "translation": "The king then ordered the prince to embrace him and leave.",
        "source": "T03n0189_001:0626b29_14"
    },
    {
        "source_sentence": "諸婆羅門既見太子相好威嚴，歎未曾有。",
        "translation": "The brahmans, seeing the prince’s beautiful and imposing features, marveled at this unprecedented event.",
        "source": "T03n0189_001:0626c01_15"
    },
    {
        "source_sentence": "王即問言：『今占太子，其相云何？』",
        "translation": "The king then asked, 'Now, what's the characteristic of the prince who's divining it?'",
        "source": "T03n0189_001:0626c02_16"
    },
    {
        "source_sentence": "婆羅門言：『一切眾生皆欲子好；",
        "translation": "The brāhmaṇa said: All sentient beings desire the good fortune of their children.",
        "source": "T03n0189_001:0626c02_17"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0189_001:0626c03_18"
    },
    {
        "source_sentence": "今者所生太子，是大珍異，勿生憂怖。』",
        "translation": "The prince who's born now is a great treasure, so don't become sad and fearful.'",
        "source": "T03n0189_001:0626c03_19"
    },
    {
        "source_sentence": "即又白言：『所生太子，大王！",
        "translation": "He then again said, 'That's the prince born, great king!",
        "source": "T03n0189_001:0626c04_20"
    },
    {
        "source_sentence": "雖言是王之子，乃是世間人天之眼。』",
        "translation": "Even though it's said to be the king's child, it's the eyes of humans and gods in the world.'",
        "source": "T03n0189_001:0626c05_21"
    },
    {
        "source_sentence": "王復問言：『云何得知？』",
        "translation": "The king again asked, 'How do you know?'",
        "source": "T03n0189_001:0626c06_22"
    },
    {
        "source_sentence": "婆羅門言：『我觀太子，身色光焰，猶如真金，有諸相好，極為明淨，",
        "translation": "The brāhmaṇa said, “I see that the prince’s physical form is as shining and flaming as pure gold, endowed with all the marks and embellishments of great splendor.",
        "source": "T03n0189_001:0626c06_23"
    },
    {
        "source_sentence": "若當出家，成一切種智；",
        "translation": "If he renounces the householder’s life, he will attain omniscience.",
        "source": "T03n0189_001:0626c08_24"
    },
    {
        "source_sentence": "若在家者，為轉輪聖王，領四天下，譬如江河，海為第一；",
        "translation": "Those who remain householders will become universal monarchs ruling over the four quarters of the earth, just as a river or ocean is the first in the world.",
        "source": "T03n0189_001:0626c08_25"
    },
    {
        "source_sentence": "眾山之中，須彌最勝；",
        "translation": "Among the mountains, Mount Sumeru is the most prominent.",
        "source": "T03n0189_001:0626c09_26"
    },
    {
        "source_sentence": "凡諸光暉，日為無上；",
        "translation": "All the rays of light shine brightly, and the sun is the highest.",
        "source": "T03n0189_001:0626c10_27"
    },
    {
        "source_sentence": "一切清涼，唯有明月；",
        "translation": "All that is cool is only the moon of light.",
        "source": "T03n0189_001:0626c10_28"
    },
    {
        "source_sentence": "天人世，間太子為尊。』",
        "translation": "In the world of gods and humans, the prince is the most honored among them.'",
        "source": "T03n0189_001:0626c11_29"
    },
    {
        "source_sentence": "王聞此語，心大歡喜，離諸怵惕。",
        "translation": "When the king heard these words, he was greatly delighted and left all his fears.",
        "source": "T03n0189_001:0626c11_30"
    },
    {
        "source_sentence": "彼婆羅門又白王言：『有一梵仙名阿私陀，具足五通，在於香山，彼能為王斷諸疑惑。』",
        "translation": "The Brāhmaṇa also said to the king, 'There's a Brahmā sage named Asita who possesses the five supernormal powers and lives on Mount Gandhamādana, and he can cut off doubt and confusion for the king.'",
        "source": "T03n0189_001:0626c12_31"
    },
    {
        "source_sentence": "諸婆羅門說此語已，辭別而去。",
        "translation": "Having said these words, the brāhmaṇas departed.",
        "source": "T03n0189_001:0626c14_32"
    },
    {
        "source_sentence": "「爾時白淨王心自思惟：『阿私陀仙人，居在香山，途逕嶮絕，非人所到，",
        "translation": "At that time King Baijing thought to himself, “The holy man Asita lives in the mountain of fragrance on a precipitous path that no one can reach.",
        "source": "T03n0189_001:0626c16_0"
    },
    {
        "source_sentence": "當以何方請來至此。』",
        "translation": "Where will I be invited to come here?'",
        "source": "T03n0189_001:0626c17_1"
    },
    {
        "source_sentence": "王可作此心念之時，阿私陀仙人遙知王意；",
        "translation": "When the king had this thought, the sage Asita knew the king’s thoughts from a distance.",
        "source": "T03n0189_001:0626c18_2"
    },
    {
        "source_sentence": "又復先見諸奇瑞相，深解菩薩為破生死故現受生；",
        "translation": "“Furthermore, seeing the signs of miracles first, they deeply understood that enlightening beings manifest birth in order to destroy birth and death.",
        "source": "T03n0189_001:0626c19_3"
    },
    {
        "source_sentence": "以神通力，騰虛而來，到王宮門。",
        "translation": "With supernatural powers, he rose up into the air and came to the door of the king’s palace.",
        "source": "T03n0189_001:0626c20_4"
    },
    {
        "source_sentence": "時守門者入白王言：『阿私陀仙人，乘虛空來，今在門外。』",
        "translation": "The gatekeeper then entered and said to the king, 'The sage Asita came in space, but now he's outside the gate.'",
        "source": "T03n0189_001:0626c21_5"
    },
    {
        "source_sentence": "王聞歡喜，即勅令前，王至門上自奉迎之；",
        "translation": "The king was delighted to hear this, and immediately ordered his men to go before him. The king went up to the gate to greet them.",
        "source": "T03n0189_001:0626c22_6"
    },
    {
        "source_sentence": "既見仙人，恭敬禮拜，而即問言：『尊者既來，住門不進，為守門者不聽前耶？』",
        "translation": "When he saw the sage, he venerated him respectfully and asked, 'Has the venerable one who's come here stayed at the door and didn't enter it, or did the gatekeeper who guards the door not allow him to go in front",
        "source": "T03n0189_001:0626c23_7"
    },
    {
        "source_sentence": "仙人答言：『無見止者，既來相詣，宜須先白。』",
        "translation": "The sage replied, 'There's no one who can see and stop me; since I've come to visit you, it's advisable to first confess.'",
        "source": "T03n0189_001:0626c25_8"
    },
    {
        "source_sentence": "王便隨從，入於後宮，敬請令坐，而問訊言：『尊者！",
        "translation": "The king then followed him, entered the rear palace, asked to be seated, and greeted him, saying, 'Sir, venerable!",
        "source": "T03n0189_001:0626c26_9"
    },
    {
        "source_sentence": "四大常安和不？』",
        "translation": "Do the four elements always harmonize?'",
        "source": "T03n0189_001:0626c27_10"
    },
    {
        "source_sentence": "仙人答言：『蒙大王恩，幸得安樂。』",
        "translation": "The sage replied, 'I'm fortunate to have received the king's kindness and been able to attain well-being.'",
        "source": "T03n0189_001:0626c27_11"
    },
    {
        "source_sentence": "時白淨王白仙人言：『尊者！",
        "translation": "He then said to the king of purity and said to the sage, 'Venerable!",
        "source": "T03n0189_001:0626c28_12"
    },
    {
        "source_sentence": "今日能來下降，我等種族，方大熾盛，從今已去，日就吉祥，為是經過故來此耶？』",
        "translation": "Today, we're able to descend down and our clans are so prosperous that from now on, the sun will reach Auspicious; is it because of this passage that you've come here?'",
        "source": "T03n0189_001:0626c29_13"
    },
    {
        "source_sentence": "仙人答言：『我在香山，見大光明諸奇特相，又知大王心之所念，以是因緣故來到此；",
        "translation": "The holy man replied, “I am in the mountain of fragrance. I see great rays of light and various marvelous signs. Knowing what the king thought about them, he came here for this reason.",
        "source": "T03n0189_001:0627a02_14"
    },
    {
        "source_sentence": "我以神力，乘虛而來，聞上諸天說：「王太子必當得成一切種智，度脫天人；",
        "translation": "Because of my supernatural powers, I came in space and heard the gods say to me: Your majesty, prince, you will surely attain omniscience and liberate heavenly beings.",
        "source": "T03n0189_001:0627a04_15"
    },
    {
        "source_sentence": "又王太子，從右脇生，墮於七寶蓮花之上而行七步，舉其右手而師子吼：『我於天人之中，",
        "translation": "Again, the crown prince rose from his right shoulder, fell to the top of a lotus flower adorned with the seven kinds of jewels, and walked seven paces. He raised his right hand and roared like a lion:",
        "source": "T03n0189_001:0627a06_0"
    },
    {
        "source_sentence": "最尊最勝；",
        "translation": "They are the most honored and superior.",
        "source": "T03n0189_001:0627a08_1"
    },
    {
        "source_sentence": "無量生死於今盡矣，此生利益一切天人。』」",
        "translation": "Measureless birth and death are now over, and this birth benefits all gods and humans.'",
        "source": "T03n0189_001:0627a08_2"
    },
    {
        "source_sentence": "又復諸天圍繞恭敬，聞有如此大奇特事；",
        "translation": "Furthermore, the gods surrounded and honored him. They heard that such extraordinary things were to be done.",
        "source": "T03n0189_001:0627a09_3"
    },
    {
        "source_sentence": "快哉大王！",
        "translation": "How wonderful, great king!",
        "source": "T03n0189_001:0627a10_4"
    },
    {
        "source_sentence": "宜應欣慶。",
        "translation": "It's appropriate to rejoice.",
        "source": "T03n0189_001:0627a10_5"
    },
    {
        "source_sentence": "太子今者可得見不？』",
        "translation": "Is the prince able to see it now?'",
        "source": "T03n0189_001:0627a10_6"
    },
    {
        "source_sentence": "即將仙人至太子所，王及夫人抱太子出，欲禮仙人；",
        "translation": "When the holy man arrived at the prince’s place, the king and his consorts came out to greet him.",
        "source": "T03n0189_001:0627a11_7"
    },
    {
        "source_sentence": "時彼仙人，即止王曰：『此是天人三界中尊，云何而令禮於我耶？』",
        "translation": "That sage then stopped the king and said, 'This is the honored one among gods and humans in the three realms, so how did you make him pay homage to me?'",
        "source": "T03n0189_001:0627a12_8"
    },
    {
        "source_sentence": "時彼仙人，即起合掌，禮太子足。",
        "translation": "The sage then stood up, joined his palms and bowed at the prince's feet.",
        "source": "T03n0189_001:0627a14_9"
    },
    {
        "source_sentence": "「王及夫人白仙人言：『唯願尊者為相太子。』",
        "translation": "The king and his wife said to the sage, 'May you, Venerable, be the prince of characteristics.'",
        "source": "T03n0189_001:0627a14_10"
    },
    {
        "source_sentence": "仙人言：『善。』",
        "translation": "The sage said, 'Good.'",
        "source": "T03n0189_001:0627a15_11"
    },
    {
        "source_sentence": "即便占相，具見相已；",
        "translation": "Even so, they can divine the signs and show them to others.",
        "source": "T03n0189_001:0627a16_12"
    },
    {
        "source_sentence": "忽然悲泣，不能自勝；",
        "translation": "Suddenly they cried in distress and were unable to control themselves.",
        "source": "T03n0189_001:0627a16_13"
    },
    {
        "source_sentence": "王及夫人見彼仙人悲泣流淚，舉身戰怖，生大憂惱，如大波浪動於小船，",
        "translation": "The king and his consorts saw that the holy man wept in sorrow and cried out in tears. They raised their bodies in fear and became overcome with great grief, as if a small ship were to be driven by a great wave",
        "source": "T03n0189_001:0627a17_14"
    },
    {
        "source_sentence": "問仙人言：『我子初生，具諸瑞相，有何不祥而悲泣耶？』",
        "translation": "He asked the sage, 'When my son was born, he had all these auspicious signs, so why didn't he weep sadly?'",
        "source": "T03n0189_001:0627a18_15"
    },
    {
        "source_sentence": "爾時仙人歔欷答言：『大王！",
        "translation": "It was then that the sage replied, 'Great king!",
        "source": "T03n0189_001:0627a20_16"
    },
    {
        "source_sentence": "太子相好具足，無有不祥。』",
        "translation": "The prince is endowed with good features, and there's nothing inauspicious about it.'",
        "source": "T03n0189_001:0627a20_17"
    },
    {
        "source_sentence": "王又問言：『願更為我占視太子，有長壽相不？",
        "translation": "Again, the king asked, 'May I give it to you to divine and examine the prince, will he have a long life span?'",
        "source": "T03n0189_001:0627a21_18"
    },
    {
        "source_sentence": "得轉輪王位王四天下不？",
        "translation": "Will you attain the position of wheel-turning king and king of the four heavens?",
        "source": "T03n0189_001:0627a22_19"
    },
    {
        "source_sentence": "我年既暮，欲以國土皆悉付之，當隱山林出家學道，所可志願，唯在於此。",
        "translation": "At the end of my old age, I wish to entrust all of my native land to you. I should remain in seclusion in a mountain forest and renounce household life so as to study the path. The only place where I can make an aspiration is",
        "source": "T03n0189_001:0627a22_20"
    },
    {
        "source_sentence": "尊者為觀，必定果耶？』",
        "translation": "Is the venerable one observing, and will he surely realize it?'",
        "source": "T03n0189_001:0627a24_21"
    },
    {
        "source_sentence": "「爾時仙人又答王言：『大王！",
        "translation": "It was then that the sage again answered the king, saying, 'Great king!",
        "source": "T03n0189_001:0627a25_22"
    },
    {
        "source_sentence": "太子具三十二相，一者、足下安平平如奩底；",
        "translation": "The prince had thirty-two marks:",
        "source": "T03n0189_001:0627a25_23"
    },
    {
        "source_sentence": "二者、足下千輻網輪輪相具足；",
        "translation": "The second is that they are endowed with the characteristics of a thousand-spoked net under their feet.",
        "source": "T03n0189_001:0627a26_24"
    },
    {
        "source_sentence": "三者、手足相指長勝於餘人；",
        "translation": "The third is that their hands and feet are as long as the fingers of other people.",
        "source": "T03n0189_001:0627a27_25"
    },
    {
        "source_sentence": "四者、手足柔軟勝餘身分；",
        "translation": "The fourth is that their hands and feet are more pliant than those of other people.",
        "source": "T03n0189_001:0627a28_26"
    },
    {
        "source_sentence": "五者、足跟廣具足滿好；",
        "translation": "The fifth is that their heels are wide and full of goodness.",
        "source": "T03n0189_001:0627a28_27"
    },
    {
        "source_sentence": "六者、足指合縵網勝於餘人；",
        "translation": "The sixth is that their toes are joined together like a webbed mesh, surpassing those of other people.",
        "source": "T03n0189_001:0627a29_28"
    },
    {
        "source_sentence": "七者、足趺高平好與跟相稱；",
        "translation": "The seventh is that their feet are rough, high, flat, and well balanced with the heels.",
        "source": "T03n0189_001:0627b01_29"
    },
    {
        "source_sentence": "八者、伊泥延鹿腨纖好如伊泥延鹿王；",
        "translation": "The eighth is that the hair of the Īniryāyana deer is as slender and beautiful as the hair of the Īniryāyana deer king.",
        "source": "T03n0189_001:0627b01_30"
    },
    {
        "source_sentence": "九者、平住兩手摩膝；",
        "translation": "The ninth is that they stand upright, their hands touching each other’s knees.",
        "source": "T03n0189_001:0627b02_31"
    },
    {
        "source_sentence": "十者、陰藏相如馬王象王；",
        "translation": "The tenth is that the characteristics of the aggregates are like those of a horse king or an elephant king.",
        "source": "T03n0189_001:0627b03_32"
    },
    {
        "source_sentence": "十一者、身縱廣等如尼拘類樹；",
        "translation": "The eleventh is that their bodies are as long and wide as the nyagrodha trees.",
        "source": "T03n0189_001:0627b03_33"
    },
    {
        "source_sentence": "十二者、一一孔一毛生青色柔軟右旋；",
        "translation": "(12) Each pore has a hair that grows blue in color and curls to the right.",
        "source": "T03n0189_001:0627b04_34"
    },
    {
        "source_sentence": "十三者、毛上向靡，青色柔軟右旋；",
        "translation": "The thirteenth is that the hair curls upward and turns to the right, being blue in color and soft.",
        "source": "T03n0189_001:0627b05_35"
    },
    {
        "source_sentence": "十四者、金色相其色微妙勝閻浮檀金；",
        "translation": "The fourteenth was the golden-colored sign, with a subtle and exquisitely delicate color like that of gold from Jambudvlpa.",
        "source": "T03n0189_001:0627b06_36"
    },
    {
        "source_sentence": "十五者、身光面一丈；",
        "translation": "The fifteenth is the radiance of his body one zhang above his face.",
        "source": "T03n0189_001:0627b06_37"
    },
    {
        "source_sentence": "十六者、皮薄細滑不受塵垢不停蚊蚋；",
        "translation": "The sixteenth is that their skin is thin and fine, not covered by dirt or mosquitoes.",
        "source": "T03n0189_001:0627b07_38"
    },
    {
        "source_sentence": "十七者、七處滿，兩足下兩手中兩肩上項中皆滿，字相分明；",
        "translation": "The seventeenth is the completion in seven places, complete at the base of the two feet, in the middle of the two hands, on the shoulders, and above the neck.",
        "source": "T03n0189_001:0627b08_39"
    },
    {
        "source_sentence": "十八者、兩腋下滿如摩尼珠；",
        "translation": "The eighteenth was that his armpits were filled with jewel-like pearls.",
        "source": "T03n0189_001:0627b09_40"
    },
    {
        "source_sentence": "十九者、身如師子；",
        "translation": "The nineteenth is that their bodies are like lions.",
        "source": "T03n0189_001:0627b10_41"
    },
    {
        "source_sentence": "二十者、身廣端直；",
        "translation": "20. Their bodies are broad and straight.",
        "source": "T03n0189_001:0627b10_42"
    },
    {
        "source_sentence": "二十一者、肩圓好；",
        "translation": "(21) The twenty-first is that their shoulders are well rounded.",
        "source": "T03n0189_001:0627b11_43"
    },
    {
        "source_sentence": "二十二者、口四十齒；",
        "translation": "The twenty-second is forty bodily teeth.",
        "source": "T03n0189_001:0627b11_44"
    },
    {
        "source_sentence": "二十三者、齒白齊密而根深；",
        "translation": "The twenty-third is that their teeth are white and evenly spaced, with deep roots.",
        "source": "T03n0189_001:0627b12_45"
    },
    {
        "source_sentence": "二十四者、四牙最白而大；",
        "translation": "(24) Twenty-four: The four tusks are the whitest of the four teeth and grow in size.",
        "source": "T03n0189_001:0627b12_46"
    },
    {
        "source_sentence": "二十五者、方頰車如師子；",
        "translation": "The twenty-fifth is that their square cheeks are like those of a lion.",
        "source": "T03n0189_001:0627b13_47"
    },
    {
        "source_sentence": "二十六者、味中得上味，咽中二處津液流出；",
        "translation": "26. The strong liquor flows out of the two places in the palate.",
        "source": "T03n0189_001:0627b13_48"
    },
    {
        "source_sentence": "二十七者、舌大軟薄能覆面至耳髮際；",
        "translation": "The twenty-seventh is that their tongues are big and slender, able to cover their faces up to the extent of their ears.",
        "source": "T03n0189_001:0627b14_49"
    },
    {
        "source_sentence": "二十八者、梵音深遠如迦陵頻伽聲；",
        "translation": "The twenty-eighth is that the sound of Brahma is as deep and distant as the sound of kalaviṅka.",
        "source": "T03n0189_001:0627b15_50"
    },
    {
        "source_sentence": "二十九者、眼色如金精；",
        "translation": "The twenty-nineth is that their eyes have the color of gold.",
        "source": "T03n0189_001:0627b16_51"
    },
    {
        "source_sentence": "三十者、眼睫如牛王；",
        "translation": "The thirtyth is that their eyelashes are like the eyelashes of an ox.",
        "source": "T03n0189_001:0627b17_52"
    },
    {
        "source_sentence": "三十一者、眉間白毫相軟白如兜羅綿；",
        "translation": "The thirty-first is that the white hair between their eyebrows is as soft and white as cotton cloth.",
        "source": "T03n0189_001:0627b17_53"
    },
    {
        "source_sentence": "三十二者、頂髻肉成。",
        "translation": "33. The topknot is made of flesh.",
        "source": "T03n0189_001:0627b18_54"
    },
    {
        "source_sentence": "具有如此相好之身，若在家者，年二十九，為轉輪聖王；",
        "translation": "At the age of twenty-nine for those who remain householders at home, he becomes a universal ruler.",
        "source": "T03n0189_001:0627b18_55"
    },
    {
        "source_sentence": "若出家者，成一切種智，廣濟天人。",
        "translation": "If someone leaves home, they'll attain all kinds of wisdom that will extensively save gods and humans.",
        "source": "T03n0189_001:0627b20_56"
    },
    {
        "source_sentence": "然王太子，必當學道得成阿耨多羅三藐三菩提，不久當轉清淨法輪，利益天人開世間眼。",
        "translation": "Still, prince of kings, you must train in the path to attain supreme perfect enlightenment and soon turn the pure wheel of the Dharma for the benefit of gods and humans and open the eyes of the world.",
        "source": "T03n0189_001:0627b21_57"
    },
    {
        "source_sentence": "我今年壽，已百二十，不久命終，生無想天，不覩佛興，不聞經法，故自悲耳。』",
        "translation": "Soon after my life will end, I'll be born in the Heaven of No-thought, where I won't see the Buddha arise or hear the sūtras and teachings; therefore, I'm sad.'",
        "source": "T03n0189_001:0627b23_58"
    },
    {
        "source_sentence": "「又問仙人：『尊者向占言，有二種：一當作王；",
        "translation": "Again, he asked the holy man, saying: There are two kinds of divination statements by the venerable:",
        "source": "T03n0189_001:0627b25_59"
    },
    {
        "source_sentence": "二成正覺；",
        "translation": "The second is the attainment of true awakening.",
        "source": "T03n0189_001:0627b26_60"
    },
    {
        "source_sentence": "而今云何言決定成一切種智。』",
        "translation": "How can we now say that it's certain to become all kinds of cognition?'",
        "source": "T03n0189_001:0627b26_61"
    },
    {
        "source_sentence": "時仙人言：『我相之法，若有眾生，具三十二相，或生非處，又不明顯，",
        "translation": "The holy man said, “If there are sentient beings who possess the thirty-two marks, then some of them may be born in a different place but they will not appear clearly.",
        "source": "T03n0189_001:0627b27_62"
    },
    {
        "source_sentence": "此人必為轉輪聖王；",
        "translation": "These people will surely become wheel-turning sage kings.",
        "source": "T03n0189_001:0627b28_63"
    },
    {
        "source_sentence": "若三十二相，皆得其處，又復明顯，此人必成一切種智。",
        "translation": "If the thirty-two marks all obtain their place and are also clearly visible, this person will surely attain omniscience.",
        "source": "T03n0189_001:0627b29_64"
    },
    {
        "source_sentence": "我觀大王太子諸相，皆得其所，又極明顯，是以決定知成正覺。』",
        "translation": "I've observed the characteristics of the prince, the great king, and they all attain their place, which are so distinct that I'm certain to become perfectly enlightened.'",
        "source": "T03n0189_001:0627c01_65"
    },
    {
        "source_sentence": "仙人為王說此語已，辭別而退。",
        "translation": "After he spoke these words for the king, the sage left and withdrew.",
        "source": "T03n0189_001:0627c02_66"
    },
    {
        "source_sentence": "「爾時白淨王既聞仙人決定之說，心懷愁惱，慮恐出家；",
        "translation": "At that time King Baijing, having heard the ṛṣi’s words of certainty, was greatly distressed and feared leaving household life.",
        "source": "T03n0189_001:0627c04_0"
    },
    {
        "source_sentence": "即擇五百青衣賢明多智為作嬭母，養視太子，其中或有乳者，或有抱者，",
        "translation": "He selected five hundred women in blue robes, some of whom were wise and knowledgeable, to be his stepmother, nurturing the prince. Some of them had milk, while others embraced him.",
        "source": "T03n0189_001:0627c05_1"
    },
    {
        "source_sentence": "或有浴者，或有浣濯者；",
        "translation": "Some people bathe, while others wash.",
        "source": "T03n0189_001:0627c07_2"
    },
    {
        "source_sentence": "如是等比，供給太子，皆悉具足。",
        "translation": "Such comparisons and offerings are all fully present to the prince.",
        "source": "T03n0189_001:0627c07_3"
    },
    {
        "source_sentence": "又復別為起三時殿，溫涼寒暑，各自異處；",
        "translation": "Again, they set up separately three seasonal palaces for the assembly: hot, cold, and hot.",
        "source": "T03n0189_001:0627c08_4"
    },
    {
        "source_sentence": "其殿皆以七寶莊嚴，衣裳服飾，皆悉隨時；",
        "translation": "The halls were all adorned with the seven kinds of treasure. All their robes, garments, and ornaments were worn according to season.",
        "source": "T03n0189_001:0627c09_5"
    },
    {
        "source_sentence": "王恐太子棄家學道，使其城門開閉之聲聞四十里；",
        "translation": "The king feared that the prince would give up his home to study the path and ordered the city gates to be opened and shut forty li for the śrāvakas.",
        "source": "T03n0189_001:0627c10_6"
    },
    {
        "source_sentence": "又復擇取五百妓女，形容端正，不肥不瘦，不長不短，不白不黑，才能巧妙，",
        "translation": "Again, he selected five hundred courtesans who were neither fat nor thin, neither long nor short, neither white nor black, and capable of skillful means.",
        "source": "T03n0189_001:0627c11_7"
    },
    {
        "source_sentence": "各兼數技，皆以名寶，瓔珞其身，百人一番，迭代宿衛；",
        "translation": "Each of them possessed several skills, all adorned their bodies with name-jewels and jewelry. A hundred soldiers were present to guard each other in succession.",
        "source": "T03n0189_001:0627c13_8"
    },
    {
        "source_sentence": "於其殿前，列樹甘果，枝葉蔚映，花實繁茂；",
        "translation": "In front of the hall there were sweet fruit trees with luxuriant branches and leaves and plenty of flowers and realities.",
        "source": "T03n0189_001:0627c14_9"
    },
    {
        "source_sentence": "又有浴池，清淨澄潔，池邊香草，雜色蓮花，猗靡芬敷，不可稱計；",
        "translation": "There was also a bathing pond, pure and clean, with fragrant grass growing along the edge of the pond and lotus flowers of various colors spreading in an unfathomably fragrant array.",
        "source": "T03n0189_001:0627c15_10"
    },
    {
        "source_sentence": "異類之鳥，數百千種，光麗心目，趣悅太子。",
        "translation": "There were hundreds of thousands of different kinds of birds, shining brilliantly with their minds and eyes to delight the prince.",
        "source": "T03n0189_001:0627c17_0"
    },
    {
        "source_sentence": "「太子既生，始滿七日，其母命終，以懷太子功德大故，上生忉利，封受自然。",
        "translation": "“Seven days after the prince had been born, his mother died. Because she cherished the prince’s great virtue, she was reborn in Trāyastriṃśa Heaven and assumed the throne spontaneously.",
        "source": "T03n0189_001:0627c18_0"
    },
    {
        "source_sentence": "太子自知，福德威重，無有女人堪受禮者，故因將終，託之而生。",
        "translation": "Knowing for himself that the prince’s virtue was so great and mighty that no woman would be able to pay him homage, the prince died and was reborn entrusted with the throne.",
        "source": "T03n0189_001:0627c19_1"
    },
    {
        "source_sentence": "爾時太子姨母摩訶波闍波提，乳養太子，如母無異。",
        "translation": "It was then that the prince's aunt Mahāprajāpatī nursed the prince with milk just as if he were his mother.",
        "source": "T03n0189_001:0627c21_2"
    },
    {
        "source_sentence": "時白淨王，勅作七寶天冠及以瓔珞，而與太子。",
        "translation": "White King Śubhavyūha then ordered a seven-jeweled celestial crown and jewelry made of the seven treasures to be given to the prince.",
        "source": "T03n0189_001:0627c22_3"
    },
    {
        "source_sentence": "太子年漸長大，為辦象、馬、牛、羊之車，凡是童子所玩好具，無不給與。",
        "translation": "As the prince grew up, he prepared elephant carts, horse carts, cattle carts, and sheep carts. All the good things that the children played with were given to them without fail.",
        "source": "T03n0189_001:0627c23_4"
    },
    {
        "source_sentence": "爾時舉國人民，皆行仁惠，五穀豐熟，風雨以時，又無盜賊，快樂安隱，",
        "translation": "At that time the people of that country all practiced benevolence and kindness. The five crops were abundant and the wind and rain came at the proper seasons, and there were no thieves or robbers. They lived happily and peacefully",
        "source": "T03n0189_001:0627c25_5"
    },
    {
        "source_sentence": "皆是太子福德力故。",
        "translation": "It's all because of the prince's power of merit.",
        "source": "T03n0189_001:0627c26_6"
    },
    {
        "source_sentence": "時王又以青衣所生是車匿等五百蒼頭，給侍太子。",
        "translation": "The king then gave the five hundred blue heads of Chanda and so forth produced from his green robes to the attendant prince.",
        "source": "T03n0189_001:0627c27_7"
    },
    {
        "source_sentence": "至年七歲，父王心念：『太子已大，宜令學書。』",
        "translation": "When he was seven years old, his father thought to himself, 'The prince has grown up, so it's advisable for him to study writing.'",
        "source": "T03n0189_001:0627c28_8"
    },
    {
        "source_sentence": "訪覓國中聰明婆羅門善諸書藝，請使令來以教太子。",
        "translation": "He sought out intelligent brahmans of the country who were good in calligraphy and arts and invited an envoy to come to teach the prince.",
        "source": "T03n0189_001:0627c29_9"
    },
    {
        "source_sentence": "爾時有一婆羅門，名跋陀羅尼，與五百婆羅門，以為眷屬，來受王請。",
        "translation": "At the time, there was a Brāhmaṇa named Bhadrani, who had five hundred Brāhmaṇas as his retinue and came to accept the king's invitation.",
        "source": "T03n0189_001:0628a01_10"
    },
    {
        "source_sentence": "即白婆羅門言：『欲屈尊者為太子師，此可爾不？』",
        "translation": "He then said to the Brāhmaṇa, 'Do you want to humiliate the Bhagavān as the prince's teacher, is that possible?'",
        "source": "T03n0189_001:0628a03_11"
    },
    {
        "source_sentence": "婆羅門言：『當隨所知，以授太子。』",
        "translation": "The Brāhmaṇa said, 'Follow what you know and give it to the prince.'",
        "source": "T03n0189_001:0628a04_12"
    },
    {
        "source_sentence": "時白淨王，更為太子起大學堂，七寶莊嚴，床[木*翕]學具，極令精麗；",
        "translation": "The king then said, “Your majesty, the prince should build a hall of higher learning, beautifully adorned with the seven kinds of treasure and furnished with cushions made of wood.",
        "source": "T03n0189_001:0628a05_13"
    },
    {
        "source_sentence": "卜擇吉日，即以太子與婆羅門，而令教之。",
        "translation": "On an auspicious day, he gave the prince and the brāhmaṇa to teach him.",
        "source": "T03n0189_001:0628a06_14"
    },
    {
        "source_sentence": "爾時婆羅門，以四十九書字之本，教令讀之。",
        "translation": "It was then that the Brāhmaṇa gave him forty-nine books and instructed him to read them.",
        "source": "T03n0189_001:0628a07_15"
    },
    {
        "source_sentence": "于時太子見此事已，問其師言：『此何等書？",
        "translation": "Seeing this, the prince asked his teacher, 'What's this book?'",
        "source": "T03n0189_001:0628a08_16"
    },
    {
        "source_sentence": "閻浮提中，一切諸書，凡有幾種？』",
        "translation": "How many kinds are there in all the books in Jambudvīpa?'",
        "source": "T03n0189_001:0628a09_17"
    },
    {
        "source_sentence": "師即默然不知所答。",
        "translation": "The teacher then remained silent and didn't know what to answer.",
        "source": "T03n0189_001:0628a10_18"
    },
    {
        "source_sentence": "又復問言：『此阿一字，有何等義？』",
        "translation": "Again, he asked, 'What's the meaning of this letter a?'",
        "source": "T03n0189_001:0628a11_19"
    },
    {
        "source_sentence": "師又默然亦不能答；",
        "translation": "The teacher remained silent and could not reply.",
        "source": "T03n0189_001:0628a11_20"
    },
    {
        "source_sentence": "內懷慙愧，即從座起，禮太子足而讚歎言：『太子初生行七步時，自言天人之中最尊最勝，",
        "translation": "With a sense of shame within himself, he rose from his seat, saluted the prince by bowing at his feet, and praised him, saying: At the first birth of the prince, when he walked seven paces, he declared that he was the most",
        "source": "T03n0189_001:0628a12_21"
    },
    {
        "source_sentence": "此言不虛，唯願為說閻浮提書凡有幾種。』",
        "translation": "This is not false, but I'd like to explain for you how many kinds of writing there are in Jambudvīpa.'",
        "source": "T03n0189_001:0628a14_22"
    },
    {
        "source_sentence": "太子答言：『閻浮提中，或有梵書，或佉樓書，或蓮花書，有如是等六十四種；",
        "translation": "The prince answered: In Jambudvfpa there are sixty-four kinds of writing such as the Sanskrit alphabet, the Avalokiteśvara alphabet, and the lotus flower script.",
        "source": "T03n0189_001:0628a15_23"
    },
    {
        "source_sentence": "此阿字者，是梵音聲，又此字義，是不可壞，亦是無上正真道義，凡如此義，",
        "translation": "The letter a is the Sanskrit phoneme a, and its meaning is unbreakable. It is also the meaning of the unsurpassed true path.",
        "source": "T03n0189_001:0628a17_24"
    },
    {
        "source_sentence": "無量無邊。』",
        "translation": "It's immeasurable and limitless.'",
        "source": "T03n0189_001:0628a18_25"
    },
    {
        "source_sentence": "爾時婆羅門，深生慙愧。",
        "translation": "At the time, the Brāhmaṇa was deeply ashamed.",
        "source": "T03n0189_001:0628a19_26"
    },
    {
        "source_sentence": "還至王所，而白王言：『大王！",
        "translation": "He returned to the king and said, 'Great king!",
        "source": "T03n0189_001:0628a19_27"
    },
    {
        "source_sentence": "太子是天人中第一之師，云何而欲令我教耶？』",
        "translation": "The prince is the first teacher among gods and humans, so why would you want me to teach him?'",
        "source": "T03n0189_001:0628a20_28"
    },
    {
        "source_sentence": "爾時父王聞婆羅門言，倍生歡喜，歎未曾有，即厚供養彼婆羅門，隨意所之。",
        "translation": "When his father heard the words of the brāhmaṇa, he was doubly delighted and praised them as unprecedented. He offered a generous offering to the brāhmaṇa at his wish.",
        "source": "T03n0189_001:0628a21_29"
    },
    {
        "source_sentence": "凡諸技藝典籍議論，天文地理，算數射御，太子皆悉自然知之。",
        "translation": "The prince naturally knew all the arts and crafts, books, astronomy, geography, calculations, and archery.",
        "source": "T03n0189_001:0628a23_30"
    },
    {
        "source_sentence": "◎過去現在因果經卷第一",
        "translation": "Sutra on Past and Present Causes and Effects, Volume 1",
        "source": "T03n0189_001:0628a25_0"
    }
]