[
    {
        "source_sentence": "佛說師子素駄娑王斷肉經",
        "translation": "Foshuo 師子素駄娑王斷肉經, Sutra on the Cutting off of Meat by the Buddha",
        "source": "T03n0164_001:0392a03_0"
    },
    {
        "source_sentence": "大唐沙門智嚴譯",
        "translation": "Great Tang Translation by the ascetic Zhiyan",
        "source": "T03n0164_001:0392a05_0"
    },
    {
        "source_sentence": "　我憶過去無量劫，　　有王名曰素駄娑！",
        "translation": "I remember an immeasurable eon in the past, when there was a king named Sudarśana!",
        "source": "T03n0164_001:0392a06_0"
    },
    {
        "source_sentence": "　其王一時出遊山，　　群臣部從獵蟲獸，",
        "translation": "The king once went out on a pleasure excursion to the mountain, accompanied by his ministers and hunting insects.",
        "source": "T03n0164_001:0392a07_0"
    },
    {
        "source_sentence": "　忽逢雷雹惡風起，　　諸人分散悉驚惶，",
        "translation": "Suddenly a storm of thunder and hailstorms appeared, And all the people scattered in fear.",
        "source": "T03n0164_001:0392a08_0"
    },
    {
        "source_sentence": "　王獨走入深山林，　　臨河蘇息無人伴，",
        "translation": "The king walks alone into the deep mountain forest, facing the river to sleep without companions.",
        "source": "T03n0164_001:0392a09_0"
    },
    {
        "source_sentence": "　牝母師子在山藪，　　見王獨坐逼王身。",
        "translation": "While the queen mother and lion were in the mountains, they saw the king sitting alone and pressing his body.",
        "source": "T03n0164_001:0392a10_0"
    },
    {
        "source_sentence": "　眾生惡業夙緣故，　　轉種地獄苦無量。",
        "translation": "Because sentient beings' bad actions are long-standing causes, the suffering of transmigration in hell is immeasurable.",
        "source": "T03n0164_001:0392a11_0"
    },
    {
        "source_sentence": "　王與師子夙因緣，　　欲情俱起共交會，",
        "translation": "The king and the lion have always been in intimacy Because of their long-standing desires for sexual union.",
        "source": "T03n0164_001:0392a12_0"
    },
    {
        "source_sentence": "　多劫食肉殺生者，　　夙習故入師子胎，",
        "translation": "For many kalpas, someone who eats meat and kills sentient beings enters the lion's womb because of their long-standing habituation.",
        "source": "T03n0164_001:0392a13_0"
    },
    {
        "source_sentence": "　便生人身師子首，　　斑足丈夫如獸王。",
        "translation": "They'll then give rise to a human body with the head of a lion, and a man with spotless feet will be like an animal king.",
        "source": "T03n0164_001:0392a14_0"
    },
    {
        "source_sentence": "　長成迅速甚猛利，　　問母：「我是誰體胤？」",
        "translation": "Changcheng grew up quickly and very vigorously, and asked his mother, Who am I, my essence?",
        "source": "T03n0164_001:0392a15_0"
    },
    {
        "source_sentence": "　其母師子答子云：　　「汝父竭國素駄王。」",
        "translation": "The mother lion replied to her son, Your father is the king of Soda in the kingdom of Kālôdayin.",
        "source": "T03n0164_001:0392a16_0"
    },
    {
        "source_sentence": "　子聞是已速往尋，　　摩竭提國父王所，",
        "translation": "Having heard this, the prince quickly went and searched for the place where his father, the king of Magadha,",
        "source": "T03n0164_001:0392a17_0"
    },
    {
        "source_sentence": "　引現具啟往因緣，　　王聞自悟收為子。",
        "translation": "He cited the present to reveal the causes and conditions of his past lives, and the king heard that he had awakened himself and taken him as his son.",
        "source": "T03n0164_001:0392a18_0"
    },
    {
        "source_sentence": "　然為父王年老邁，　　登樓冊子立為王，",
        "translation": "Still, as his father the king grew old and advanced, he ascended to the palace and established him as king.",
        "source": "T03n0164_001:0392a19_0"
    },
    {
        "source_sentence": "　號為師子素駄娑，　　御殿朝政理臣民。",
        "translation": "He was called Siṃhala Sudarśana, the ruler and ministers of the imperial palace.",
        "source": "T03n0164_001:0392a20_0"
    },
    {
        "source_sentence": "　師子展轉惡習故，　　多劫食肉害眾生，",
        "translation": "Because of the evolving bad habits of lions, For many kalpas they eat meat and harm sentient beings.",
        "source": "T03n0164_001:0392a21_0"
    },
    {
        "source_sentence": "　雖居人王不食穀，　　唯飡鳥獸水陸蟲。",
        "translation": "Even though the king of the inhabitants did not eat grain, Only birds and beasts such as hawks and crows feed on it.",
        "source": "T03n0164_001:0392a22_0"
    },
    {
        "source_sentence": "　供進雜肉時將至，　　闥拔獸肉狗銜將，",
        "translation": "When the time came for offerings of cooked meat and porridge, he was pulling out the flesh of animals and dogs to lead the procession.",
        "source": "T03n0164_001:0392a23_0"
    },
    {
        "source_sentence": "　闕肉厨人懼王斬，　　走出捕捉小嬰孩，",
        "translation": "The cook who lacked meat was afraid the king would kill him, and he went out to catch a small infant.",
        "source": "T03n0164_001:0392a24_0"
    },
    {
        "source_sentence": "　密截頭項并手足，　　全煑鑊中供進王。",
        "translation": "They secretly cut off their heads, necks, hands, and feet, And offered them all to the king in the cauldron.",
        "source": "T03n0164_001:0392a25_0"
    },
    {
        "source_sentence": "　王食其肉甚將美，　　長嗜肉味狀燒薪，",
        "translation": "The king ate the meat, which was very good and delicious. For a long time he indulged in the taste of meat and burned firewood.",
        "source": "T03n0164_001:0392a26_0"
    },
    {
        "source_sentence": "　王問食官是何肉？　　食官惶怖具啟王，",
        "translation": "The king asked the eater what kind of meat he ate.",
        "source": "T03n0164_001:0392a27_0"
    },
    {
        "source_sentence": "　王赦其罪勿憂愁，　　每日供進是肉來。",
        "translation": "The king forgives his sins and doesn't grieve, offering this kind of flesh every day.",
        "source": "T03n0164_001:0392a28_0"
    },
    {
        "source_sentence": "　厨人既承大王教，　　變服每日盜他兒，",
        "translation": "The cook, having received the king’s instruction, Every day he changed his clothes and stole from another child.",
        "source": "T03n0164_001:0392a29_0"
    },
    {
        "source_sentence": "　積年竊盜他男女，　　如行羅剎復如鷹，",
        "translation": "Stealing others’ men and women for many years Is like walking a rāṣāṇa, or like an eagle.",
        "source": "T03n0164_001:0392b01_0"
    },
    {
        "source_sentence": "　國內人民並持服，　　為失子息各慞惶，",
        "translation": "The citizens of the kingdom all accepted it, But in fear of losing their children they became frightened.",
        "source": "T03n0164_001:0392b02_0"
    },
    {
        "source_sentence": "　兩兩執手互相問，　　氣噎無處告皇天。",
        "translation": "The two men clasped their hands and asked each other questions, but there was no place to tell the emperor.",
        "source": "T03n0164_001:0392b03_0"
    },
    {
        "source_sentence": "　邑人守捕獲其賊，　　厨賊訴云：「不自由。」",
        "translation": "The villagers guarded and captured the thief, and the cook accused him, saying, Not free.",
        "source": "T03n0164_001:0392b04_0"
    },
    {
        "source_sentence": "　國人聞此啟諫王，　　王聞忿怒大嗔責：",
        "translation": "The people of the kingdom heard this and remonstrated with the king. When the king heard this, he became furious and inflicted a great deal of rebuke,",
        "source": "T03n0164_001:0392b05_0"
    },
    {
        "source_sentence": "「比日令密進孩肉，　　從今每自料一人。」",
        "translation": "On the next day, he ordered him to secretly enter the flesh of a child, and from now on he'll always pay for one person.",
        "source": "T03n0164_001:0392b06_0"
    },
    {
        "source_sentence": "　親戚、臣民次第食，　　如羊欄內被牽將，",
        "translation": "Their relatives and ministers eat one after the other, like a sheep being led inside a railing.",
        "source": "T03n0164_001:0392b07_0"
    },
    {
        "source_sentence": "　闔國絕望無控告，　　普集王衙欲除君。",
        "translation": "All the kingdoms were cut off from hope and no one was charged, and they assembled all the king's offices to remove the ruler.",
        "source": "T03n0164_001:0392b08_0"
    },
    {
        "source_sentence": "　王上高臺祈神鬼：　　「請翅飛騰免斯難，",
        "translation": "The king ascended to the high terrace and prayed to the spirits, Requesting their wings to fly upward to avoid this difficulty.",
        "source": "T03n0164_001:0392b09_0"
    },
    {
        "source_sentence": "　若得翅飛取諸方，　　百國王頭祭山神。」",
        "translation": "If he gets his wings to fly in all directions and takes them, the kings of a hundred kingdoms will offer their heads to the mountain spirit.",
        "source": "T03n0164_001:0392b10_0"
    },
    {
        "source_sentence": "　師子猛獸惡習故，　　立得翅飛接諸王，",
        "translation": "Because of the bad habits of fierce animals like lions, They stand up and fly with their wings to reach the kings.",
        "source": "T03n0164_001:0392b11_0"
    },
    {
        "source_sentence": "　囚縶高峯峻巖上，　　已得九十九國王，",
        "translation": "He was imprisoned on a high peak in a lofty cliff and had already attained ninety-nine kingdoms.",
        "source": "T03n0164_001:0392b12_0"
    },
    {
        "source_sentence": "　惟少一王擬當祭，　　師子而下更尋求。",
        "translation": "Only a small number of kings intended to make offerings, and the lion went down to search for them.",
        "source": "T03n0164_001:0392b13_0"
    },
    {
        "source_sentence": "　於時王舍菩薩王，　　號為聞月園苑浴，",
        "translation": "The bodhisattva king Rājagṛha then called it the bathing of the moon palace.",
        "source": "T03n0164_001:0392b14_0"
    },
    {
        "source_sentence": "　師子見王坐玉矴，　　下捉右臂欲擒將。",
        "translation": "When the lion saw the king seated on a jeweled carriage, he grabbed his right arm and wanted to capture him.",
        "source": "T03n0164_001:0392b15_0"
    },
    {
        "source_sentence": "　爾時聞月王悲泣，　　師子問王：「何故啼？」",
        "translation": "When he heard that the king of the moon was weeping in sorrow, the lion asked the king, Why are you crying?",
        "source": "T03n0164_001:0392b16_0"
    },
    {
        "source_sentence": "「我聞大王勇猛智，　　菩薩不顧身命財。」",
        "translation": "I've heard that the great king is courageous and wise, and the bodhisattva doesn't care about body, life, or possessions.",
        "source": "T03n0164_001:0392b17_0"
    },
    {
        "source_sentence": "「若也如是當應忍，　　何得苦憂不自由？」",
        "translation": "If that's the case, you should tolerate it; how can you attain suffering and distress and not freedom?",
        "source": "T03n0164_001:0392b18_0"
    },
    {
        "source_sentence": "　聞月答王師子云：　　「一切憂苦不過慈，",
        "translation": "Hearing this, Moon answered the king’s lion, saying: All sorrow and suffering are nothing but kindness.",
        "source": "T03n0164_001:0392b19_0"
    },
    {
        "source_sentence": "　修行菩薩大慈悲，　　我今憂彼百國王，",
        "translation": "The great compassion of the bodhisattva who practices enlightenment Is how I grieve for those one hundred kings.",
        "source": "T03n0164_001:0392b20_0"
    },
    {
        "source_sentence": "　一生豪貴主天下，　　今日囚縶命欲終；",
        "translation": "In one lifetime I will be the ruler of the realm under heaven. Today I am imprisoned and about to die.",
        "source": "T03n0164_001:0392b21_0"
    },
    {
        "source_sentence": "　我又百國求佛法，　　請得法師遠方來，",
        "translation": "I also seek the buddha-dharma in a hundred countries And ask you, O teacher of the Dharma, To come from such a great distance.",
        "source": "T03n0164_001:0392b22_0"
    },
    {
        "source_sentence": "　未及聽法親授教，　　國人渴仰未曾聞，",
        "translation": "They had never before heard the Buddha’s teaching taught them directly, And the people of that land longed to hear it.",
        "source": "T03n0164_001:0392b23_0"
    },
    {
        "source_sentence": "　汝捨施我一七日，　　供養三寶聽法音，",
        "translation": "You should give me one day and a fortnight to make offerings to the Three Treasures, listening to the Teaching.",
        "source": "T03n0164_001:0392b24_0"
    },
    {
        "source_sentence": "　集會群臣囑累法，　　八日當自迎大王。」",
        "translation": "He gathered the ministers and instructed them to entrust the Dharma, and on the eighth day he greeted the king himself.",
        "source": "T03n0164_001:0392b25_0"
    },
    {
        "source_sentence": "　以其菩薩無詐妄，　　師子許王七日期，",
        "translation": "Because the bodhisattva was not deceitless, The lion allowed the king to do so for seven days.",
        "source": "T03n0164_001:0392b26_0"
    },
    {
        "source_sentence": "　八日聞月出城迎，　　捨身施待師子王。",
        "translation": "On the eighth day, he heard that the moon was coming out of the city to meet him, and he gave up his body to the king of lions.",
        "source": "T03n0164_001:0392b27_0"
    },
    {
        "source_sentence": "　於時師子如雲現，　　擒接聞月對眾將。",
        "translation": "The lion then appeared like a cloud, capturing the learned moon and facing the generals.",
        "source": "T03n0164_001:0392b28_0"
    },
    {
        "source_sentence": "　師子問王：「可無畏？　　敢出我前如獸王？」",
        "translation": "The lion asked the king, Fearless, would you dare to come out in front of me like a king of animals?",
        "source": "T03n0164_001:0392b29_0"
    },
    {
        "source_sentence": "　聞月答王師子言：　　「是身虛假施大王，",
        "translation": "Hearing this, Moon answered the king’s lion, saying: This body is a false offering for the great king.",
        "source": "T03n0164_001:0392c01_0"
    },
    {
        "source_sentence": "　寧捨百千身命財，　　不犯前言失汝期。」",
        "translation": "I'd rather give up a hundred thousand pieces of my body, life, and possessions than to violate the previous statement and lose your promise.",
        "source": "T03n0164_001:0392c02_0"
    },
    {
        "source_sentence": "　和顏悅色方便語，　　聽我少時說因緣：",
        "translation": "A harmonious countenance, pleasing form and skillful means, Listen as I explain the causes and conditions for a little while:",
        "source": "T03n0164_001:0392c03_0"
    },
    {
        "source_sentence": "「汝欲祭祀邪神鬼，　　諸部善神與汝殃，",
        "translation": "“If you want to sacrifice yourself to evil spirits and demons, the good spirits of the various sects will share your misfortune.",
        "source": "T03n0164_001:0392c04_0"
    },
    {
        "source_sentence": "　十方佛剎諸賢聖，　　多劫汝不更聞名；",
        "translation": "Good men and sages of buddha-lands in the ten directions, For many eons you will not hear their names again.",
        "source": "T03n0164_001:0392c05_0"
    },
    {
        "source_sentence": "　是身虛假合因緣，　　命若電光無停住，",
        "translation": "This body is a conjoined cause and condition, like life or lightning without stopping or abiding.",
        "source": "T03n0164_001:0392c06_0"
    },
    {
        "source_sentence": "　五根六識無人我，　　眼耳鼻舌觸為因，",
        "translation": "The five faculties and six consciousnesses are without self. Eye, ear, nose, tongue and touch are the cause.",
        "source": "T03n0164_001:0392c07_0"
    },
    {
        "source_sentence": "　如幻變化見眾像，　　眾生妄想執為真，",
        "translation": "Like illusions and magical transformations, they see all images; Sentient beings falsely believe them to be real.",
        "source": "T03n0164_001:0392c08_0"
    },
    {
        "source_sentence": "　從頭至足驗此軀，　　無有一事是常住，",
        "translation": "From head to toe, they examine this body: There is not a single thing that abides permanently.",
        "source": "T03n0164_001:0392c09_0"
    },
    {
        "source_sentence": "　如水中泡剎那滅，　　老、病、死、苦亦無常，",
        "translation": "Just as the bubble in water disappears instantaneously, So too old age, sickness, death, and suffering are impermanent.",
        "source": "T03n0164_001:0392c10_0"
    },
    {
        "source_sentence": "　汝今雖肉養其身，　　究竟無依無善路，",
        "translation": "Although you nourish your body with flesh, You ultimately have no basis and no good path.",
        "source": "T03n0164_001:0392c11_0"
    },
    {
        "source_sentence": "　殺生無量食噉肉，　　展轉受苦惡道中。」",
        "translation": "They kill an infinite amount of sentient beings and eat meat and flesh, and they'll be subject to painful and bad destinies in turn.",
        "source": "T03n0164_001:0392c12_0"
    },
    {
        "source_sentence": "　爾時聞月無量偈，　　勸化師子素駄王，",
        "translation": "It was then that he heard an immeasurable number of verses in the moon, Encouraging and transforming the lion king Sudarśana,",
        "source": "T03n0164_001:0392c13_0"
    },
    {
        "source_sentence": "　師子聞已漸廻心，　　聽聞無我實相體。",
        "translation": "After hearing it, the lion gradually turns his mind around and hears it, which is the true essence of selflessness.",
        "source": "T03n0164_001:0392c14_0"
    },
    {
        "source_sentence": "　師子問王：「如何計？　　祭祀無罪得神歡。」",
        "translation": "The lion asked the king, How can we calculate that it's no offense to make an offering and attain supernormal joy?",
        "source": "T03n0164_001:0392c15_0"
    },
    {
        "source_sentence": "　聞月答云：「辦素味，　　無辜淨食祭祀天。」",
        "translation": "I heard the moon answer, prepare a plain taste, and there's no blameworthy offering of pure food to the gods.",
        "source": "T03n0164_001:0392c16_0"
    },
    {
        "source_sentence": "　師子依命祭山神，　　捨身施與聞月王，",
        "translation": "The lion relied on the order to sacrifice his body to the mountain deity and gave it to King Mañjuśrī.",
        "source": "T03n0164_001:0392c17_0"
    },
    {
        "source_sentence": "　山中囚禁諸王者，　　並皆付囑聞月將。",
        "translation": "The kings imprisoned in the mountain were all entrusted to the commander of the moon.",
        "source": "T03n0164_001:0392c18_0"
    },
    {
        "source_sentence": "　聞月各引還本國，　　依舊安置理人民，",
        "translation": "Each of the moon-hearers was led back to his own country, where they were housed among the ruler and his people.",
        "source": "T03n0164_001:0392c19_0"
    },
    {
        "source_sentence": "　并將師子素駄王，　　摩竭提國坐本宮，",
        "translation": "He also summoned the lion king Sadāparvata and sat in his own palace in the country of Magadha.",
        "source": "T03n0164_001:0392c20_0"
    },
    {
        "source_sentence": "　和合諸臣及萬姓，　　合國斷肉不殺生。",
        "translation": "Together with the ministers and myriad castes, they cut off flesh and didn't kill people in a unified state.",
        "source": "T03n0164_001:0392c21_0"
    },
    {
        "source_sentence": "　爾時聞月發大願：　　「願我成等正覺時，",
        "translation": "It was then that the moon of hearing gave rise to the great vow,",
        "source": "T03n0164_001:0392c22_0"
    },
    {
        "source_sentence": "　解脫一切普含生，　　此等諸王同成佛，",
        "translation": "Their liberation contains all sentient beings: These kings all become buddhas together.",
        "source": "T03n0164_001:0392c23_0"
    },
    {
        "source_sentence": "　所授師子王妙法，　　願其重罪得雲銷。」",
        "translation": "The wonderful teaching given to the lion king of the lion, may his serious sins be extinguished in clouds.",
        "source": "T03n0164_001:0392c24_0"
    },
    {
        "source_sentence": "又念：「過去阿僧祇劫，釋提桓因處忉利宮，以於過去食肉餘習，變身為鷹而逐於鴿。",
        "translation": "Again, he thought, In a past incalculably long eon, the lord of Śakra Devānām-Indra stayed at the palace in Trāyastriṃśa Heaven and transformed himself into an eagle instead of a pigeon",
        "source": "T03n0164_001:0392c25_0"
    },
    {
        "source_sentence": "我時作王，名曰尸毘，愍念其鴿，枰身割肉代鴿償命。",
        "translation": "At the time, I was a king named Śivi, and in pity for that pigeon, I cut off my body and flesh to repay it for its life.",
        "source": "T03n0164_001:0392c26_1"
    },
    {
        "source_sentence": "尸毘王者，我身是也，後當作王名曰聞月；",
        "translation": "I myself am the king of Śivi, and he will be called hearer of the moon after me.",
        "source": "T03n0164_001:0392c28_2"
    },
    {
        "source_sentence": "其時帝釋化為鷹者，後當作王師子素駄。",
        "translation": "At the time, Indra transformed himself into an eagle and later became the king's lion suda.",
        "source": "T03n0164_001:0392c29_3"
    },
    {
        "source_sentence": "釋試我故尚生惡道，況餘眾生無慚專殺，食噉血肉無止足時。」",
        "translation": "He explains that he's still born in a bad destiny because he tried to test himself, so why wouldn't other sentient beings have the shame to kill themselves and eat crude flesh and blood without stopping?",
        "source": "T03n0164_001:0393a01_4"
    },
    {
        "source_sentence": "一切眾生從無始來，靡不曾作父母親屬，易生鳥獸，如何忍食？",
        "translation": "All sentient beings have never been parents or relatives since beginningless time. How can birds and animals that are born easily tolerate food?",
        "source": "T03n0164_001:0393a02_5"
    },
    {
        "source_sentence": "夫食肉者，歷劫之中生於鳥獸，食他血肉展轉償命。",
        "translation": "A person who eats meat is born among birds and animals over many eons, feeding on the flesh of others in order to repay their lives.",
        "source": "T03n0164_001:0393a04_6"
    },
    {
        "source_sentence": "若生人間專殺嗜肉，死墮阿鼻無時暫息。",
        "translation": "If he's born among humans and focuses on killing and indulging in flesh, he'll die and fall into avīci without a moment of rest.",
        "source": "T03n0164_001:0393a05_7"
    },
    {
        "source_sentence": "若人能斷一生食肉，乃至成佛無由再食。",
        "translation": "If someone can stop eating meat for one lifetime and become a buddha, there's no way to eat it again.",
        "source": "T03n0164_001:0393a06_8"
    },
    {
        "source_sentence": "佛說師子素駄娑王斷肉經",
        "translation": "Foshuo 師子素駄娑王斷肉經, Sutra on the Cutting off of Meat by the Buddha",
        "source": "T03n0164_001:0393a08_0"
    }
]