[
    {
        "source_sentence": "修行本起經卷下",
        "translation": "Xiuxing benqi jing, vol. 2",
        "source": "T03n0184_002:0466b10_0"
    },
    {
        "source_sentence": "後漢西域三藏竺大力共康孟詳譯",
        "translation": "Latter Han Dynasty Translated in detail by the Tripiṭaka of the Western Regions, Zhu Daishi and Kang Meng",
        "source": "T03n0184_002:0466b12_0"
    },
    {
        "source_sentence": "遊觀品第三",
        "translation": "The Third Part of the Chapter on Traveling to Contemplation",
        "source": "T03n0184_002:0466b13_0"
    },
    {
        "source_sentence": "「於是王告太子：『當行遊觀。』",
        "translation": "The king then told the prince, 'Should you go on a excursion to observe it?'",
        "source": "T03n0184_002:0466b14_0"
    },
    {
        "source_sentence": "太子念言：『久在深宮，思欲出遊，審得所願。』",
        "translation": "The prince thought, 'I've been in the deep palace for a long time, thinking about going out and traveling, and I'll examine what I want.'",
        "source": "T03n0184_002:0466b14_1"
    },
    {
        "source_sentence": "王勅國中，太子當出，嚴整道巷，灑掃燒香，懸繒幡蓋，務令鮮潔。",
        "translation": "The king had ordered that the princes of the country should go out and arrange the road lanes in an orderly way. They swept up the dirt and burned incense, hanging silk banners and canopies to make them pure and clean.",
        "source": "T03n0184_002:0466b15_2"
    },
    {
        "source_sentence": "太子導從，千乘萬騎，始出東城門，時首陀會天，名難提和羅，欲令太子速疾出家，",
        "translation": "The prince, accompanied by a thousand chariots and ten thousand horsemen, began to leave the eastern gate of the city. Then Sudarśana (known as Nandipāla) wished to allow the prince to quickly renounce household life.",
        "source": "T03n0184_002:0466b17_3"
    },
    {
        "source_sentence": "救濟十方三毒火然，願雨法水，以滅毒火。",
        "translation": "They rescue the three poisonous fires in the ten directions, wishing to rain down the Dharma water to extinguish the poisonous fires.",
        "source": "T03n0184_002:0466b19_4"
    },
    {
        "source_sentence": "難提和羅，化作老人，踞於道傍，頭白齒落，皮緩面皺，肉消脊軁，支節萎曲，",
        "translation": "Nandipāla transformed himself into an old man. He was seated at the side of the road, with white hair on his head and white teeth protruding from his forehead. His skin was loose and his face wrinkled; his flesh disappeared, and his back became crooked.",
        "source": "T03n0184_002:0466b20_5"
    },
    {
        "source_sentence": "眼淚鼻涕，涎出相屬，上氣肩息，身色黧黑，頭手肬掉，軀體戰懾，惡露自出，",
        "translation": "Their eyes, tears, nose, and nose weep; their saliva all flowed out in unison. Their upper air blew away at the shoulders with a sigh of exhalation. Their bodies looked coarse and dark but their hair stood on end as if they were trembling. Their bodies trembled and shivered violently.",
        "source": "T03n0184_002:0466b21_6"
    },
    {
        "source_sentence": "坐臥其上。",
        "translation": "He sat and lay on top of it.",
        "source": "T03n0184_002:0466b23_7"
    },
    {
        "source_sentence": "太子問言：『此為何人？』",
        "translation": "The prince asked, 'What's this person?'",
        "source": "T03n0184_002:0466b23_8"
    },
    {
        "source_sentence": "天神寤僕，僕言：『老人。』",
        "translation": "The gods, goddesses, and servants said, 'Elderly man.'",
        "source": "T03n0184_002:0466b24_9"
    },
    {
        "source_sentence": "『何等為老？』",
        "translation": "'What's old?'",
        "source": "T03n0184_002:0466b24_10"
    },
    {
        "source_sentence": "曰：『夫老者，年耆根熟，形變色衰，氣微力竭，食不消化，骨節欲離，",
        "translation": "He said, “When an old man grows old, his faculties mature and his body shape changes; his vitality weakens, his food is not digested, and his bones are dismembered.",
        "source": "T03n0184_002:0466b25_11"
    },
    {
        "source_sentence": "坐起須人，目冥耳聾，便旋即忘，言輙悲哀，餘命無幾，故謂之老。』",
        "translation": "When someone asks for a seat to rise up, their eyes are blind and their ears are deaf, so they quickly turn around and forget it. They say sorrowfully, pitying that there won't be many other lives, which is why they're called old.'",
        "source": "T03n0184_002:0466b26_12"
    },
    {
        "source_sentence": "太子歎曰：『人生於世，有此老患，愚人貪愛，何可樂者？",
        "translation": "The prince lamented, saying, 'I'll be born in the world with this old age and affliction, and foolish people will crave it; how can they enjoy it?'",
        "source": "T03n0184_002:0466b28_13"
    },
    {
        "source_sentence": "物生於春，秋冬悴枯，老至如電，身安足恃。』",
        "translation": "When things are born in spring, they'll be emaciated in autumn and wither, grow old like lightning, and have stable bodies and feet to rely on.'",
        "source": "T03n0184_002:0466b29_14"
    },
    {
        "source_sentence": "「『老則色衰，　　病無光澤，",
        "translation": "'With old age, form declines, and illness has no luster.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "　　皮緩肌縮，　　死命近促。",
        "translation": "Their skin is loose and their flesh shrinks, and they're approaching death and life.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "　　老則形變，　　喻如故車，",
        "translation": "The transformation of old age is likened to an old chariot.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "　　法能除苦，　　宜以力學。",
        "translation": "The Dharma can remove suffering, so it's appropriate to train with strength.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "　　命欲日夜盡，　　及時可勤力，",
        "translation": "When your life is about to end day and night, you can work diligently at the right time.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "　　世間諦非常，　　莫惑墮冥中。",
        "translation": "The worldly truth is impermanent, so don't be confused and fall into the darkness.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "　　當學燃意燈，　　自練求智慧，",
        "translation": "You should train in the burning of the lamp of mind, Practice yourself and seek wisdom.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "　　離垢勿染污，　　執燭觀道地。』",
        "translation": "Be free of dirt and undefiled, hold a candle and contemplate the ground of the path.'",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "即說偈言：「於是太子，即迴車還，愍傷一切，有此太患，憂思不樂。",
        "translation": "He then spoke a verse, saying, So the prince immediately returned back in his chariot, grieving that all of them had this great misfortune and were sad and unhappy.",
        "source": "T03n0184_002:0466c01_15"
    },
    {
        "source_sentence": "王問其僕：『太子出遊，何故速還？』",
        "translation": "The king asked his servant, 'Why did the prince leave and return so quickly?'",
        "source": "T03n0184_002:0466c11_16"
    },
    {
        "source_sentence": "其僕答言：『道逢老人，傷念不樂。』",
        "translation": "The servant replied, 'I'm sad and unhappy when I meet an old man on the road.'",
        "source": "T03n0184_002:0466c12_0"
    },
    {
        "source_sentence": "還宮愁思，數年小差，復欲出遊。",
        "translation": "He returned to the palace in sorrow and thought of it for several years. There was a minor mishap and he again wished to go on an excursion.",
        "source": "T03n0184_002:0466c12_1"
    },
    {
        "source_sentence": "王勅國中，太子當出，禁諸臭穢，莫在道側。",
        "translation": "The king ordered that the princes of the country should go out, forbidding all smelly and filthy people from being at the side of the road.",
        "source": "T03n0184_002:0466c13_2"
    },
    {
        "source_sentence": "於是太子，駕乘出城南門。",
        "translation": "The prince then rode out of the south gate of the city in his carriage.",
        "source": "T03n0184_002:0466c14_3"
    },
    {
        "source_sentence": "天化為病人，在于道側，身瘦腹大，軀體黃熟，咳嗽嘔[口*逆]，百節痛毒，",
        "translation": "The gods transformed him into a sick man, lying at the side of the road. His body was thin and large in stature, his abdomen grew yellowish; he coughed and vomited [mouthing], and all his limbs were painful and venomous.",
        "source": "T03n0184_002:0466c15_4"
    },
    {
        "source_sentence": "九孔敗漏，不淨自沒，目不見色，耳不聞聲，呻吟呼吸，手足摸空，喚呼父母，",
        "translation": "Their eyes do not see any visible matter, and their ears cannot hear sound. They groan and breathe, touching the air with their hands and feet; they call to their parents.",
        "source": "T03n0184_002:0466c16_5"
    },
    {
        "source_sentence": "悲戀妻子。",
        "translation": "He was grieved for his wife and children.",
        "source": "T03n0184_002:0466c18_6"
    },
    {
        "source_sentence": "太子問曰：『此為何等？』",
        "translation": "The prince asked, 'What's this?'",
        "source": "T03n0184_002:0466c18_7"
    },
    {
        "source_sentence": "其僕答言：『病人也。』",
        "translation": "The servant replied, 'He's sick.'",
        "source": "T03n0184_002:0466c19_8"
    },
    {
        "source_sentence": "『何如為病？』",
        "translation": "'What's thus for sickness?'",
        "source": "T03n0184_002:0466c19_9"
    },
    {
        "source_sentence": "答言：『人有四大，地、水、火、風，大有百一病，展轉相鑽，四百四病，",
        "translation": "Answer: People have four major elements: earth, water, fire and wind. There are one hundred and one minor ailments in every major element of the earth:",
        "source": "T03n0184_002:0466c19_10"
    },
    {
        "source_sentence": "同時俱作，此人必以極寒、極熱、極飢、極飽、極飲、極渴，將節失所，",
        "translation": "If they do so at the same time, this person is bound to experience extreme cold, heat, hunger, thirst, nutriment, drinking, and thirst, losing all his limbs.",
        "source": "T03n0184_002:0466c21_11"
    },
    {
        "source_sentence": "臥起無常，故致斯病。』",
        "translation": "Because lying and rising are impermanent, they cause this illness.'",
        "source": "T03n0184_002:0466c22_12"
    },
    {
        "source_sentence": "太子嘆曰：『吾處富貴，極世所珍，飲食快口，放心自恣，婬於五欲，",
        "translation": "The prince exclaimed, “I live in a wealthy and prosperous place with the highest worldly value. My food and drink are delicious and my mouth is full of energy. I am at ease to satisfy myself and indulge in the pleasures of the five senses.",
        "source": "T03n0184_002:0466c23_13"
    },
    {
        "source_sentence": "不能自覺，亦當有病，與彼何異。』",
        "translation": "If you can't perceive it for yourself, you'll also have illness, so why is it different from that?'",
        "source": "T03n0184_002:0466c24_14"
    },
    {
        "source_sentence": "「『是身為脆哉，　　常俱四大中，",
        "translation": "'Is this body so fragile that it's always present in the four elements?",
        "source": "T03n0184_002:0466c25_15"
    },
    {
        "source_sentence": "　　九孔不淨漏，　　有老有病患。",
        "translation": "The nine pores are impure and contaminated, with old age and illness.",
        "source": "T03n0184_002:0466c25_15"
    },
    {
        "source_sentence": "　　生天皆無常，　　人間老病憂，",
        "translation": "All births and heavens are impermanent. Old age, sickness, and sorrow in the human world:",
        "source": "T03n0184_002:0466c25_15"
    },
    {
        "source_sentence": "　　觀身如雨泡，　　世間何可樂。』」",
        "translation": "Observing the body like a rain bubble, how can the world be happy?'",
        "source": "T03n0184_002:0466c25_15"
    },
    {
        "source_sentence": "即說偈言：「於是太子，迴車還宮，思念一切有此大患。",
        "translation": "He then spoke a verse, saying, So the prince returned to the palace in his chariot and thought that everything was suffering from this great danger.",
        "source": "T03n0184_002:0466c25_15"
    },
    {
        "source_sentence": "王問其僕：『太子出遊，今者何如？』",
        "translation": "The king asked his servant, 'The prince went out on a journey, but what's the present?'",
        "source": "T03n0184_002:0467a01_16"
    },
    {
        "source_sentence": "其僕答言：『逢見病人，於是不樂。』",
        "translation": "The servant replied, 'When I met a sick man, I didn't enjoy it.'",
        "source": "T03n0184_002:0467a02_17"
    },
    {
        "source_sentence": "數年小差，復欲出遊。",
        "translation": "After a few years of minor differences, he again wished to go on an excursion.",
        "source": "T03n0184_002:0467a03_18"
    },
    {
        "source_sentence": "王勅國中，太子當出，平治臭處，無令近道。",
        "translation": "The king ordered that the princes of the country should go out to quell the foulsmelling place and not allow them to approach the road.",
        "source": "T03n0184_002:0467a03_19"
    },
    {
        "source_sentence": "出西城門，天作死人，扶輿出城，室家隨車，啼哭呼天，奈何捨我，永為別離。",
        "translation": "When he came out at the west gate of the city, a deity appeared as a dead man. Carrying his carriage out of the city with him, their families followed the chariot and cried in distress, “Dear god, why would you abandon me?",
        "source": "T03n0184_002:0467a04_20"
    },
    {
        "source_sentence": "太子問曰：『此為何等？』",
        "translation": "The prince asked, 'What's this?'",
        "source": "T03n0184_002:0467a06_21"
    },
    {
        "source_sentence": "僕言：『死人。』",
        "translation": "The servant said, 'Dead man.'",
        "source": "T03n0184_002:0467a07_22"
    },
    {
        "source_sentence": "『何如為死？』",
        "translation": "'What's like death?'",
        "source": "T03n0184_002:0467a07_23"
    },
    {
        "source_sentence": "答言：『死者盡也，精神去矣。",
        "translation": "He replied, 'Death is over, and the spirits are gone.'",
        "source": "T03n0184_002:0467a07_24"
    },
    {
        "source_sentence": "四大欲散，魂神不安，風去息絕，火滅身冷，風先火次，魂靈去矣。",
        "translation": "When the four elements were about to disperse, his spirits became restless. As the wind went away, the fire died and his body became cold. The wind preceded the fire but his spirits departed after each other.",
        "source": "T03n0184_002:0467a08_25"
    },
    {
        "source_sentence": "身體挺直，無所復知，旬日之間，肉壞血流，膖脹爛臭，無一可取。",
        "translation": "In ten days the flesh disintegrates and blood flows out, screaming and foulsmelling. There is not a single thing to eat.",
        "source": "T03n0184_002:0467a09_26"
    },
    {
        "source_sentence": "身中有蟲，蟲還食之，筋脉爛盡，骨節解散，髑髏異處，脊脇肩臂，髀脛足指，",
        "translation": "There was an insect in his body, and the insects returned to eat it. His tendons and veins were all burned out, and his bones dissociated themselves from each other. The skeleton was found elsewhere, with back, flanks, shoulders, arms, legs, hips, shins, feet, and fingers.",
        "source": "T03n0184_002:0467a11_27"
    },
    {
        "source_sentence": "各自異處，飛鳥走獸，競來食之。",
        "translation": "They each went to a different place, where flying birds and animals rushed to eat them.",
        "source": "T03n0184_002:0467a13_0"
    },
    {
        "source_sentence": "天龍鬼神，帝王人民，貧富貴賤，無免此患。』",
        "translation": "The gods, dragons, ghosts, emperors, and people, rich and poor, noble and humble, can't escape this danger.'",
        "source": "T03n0184_002:0467a13_1"
    },
    {
        "source_sentence": "「『觀見老病死，　　太子心長歎，",
        "translation": "' Observing old age, illness, and death, the prince deeply sighs in admiration.",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "　　人生無常在，　　吾身亦當然。",
        "translation": "Man’s birth is impermanent, and so is my body.",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "　　是身為死物，　　精神無形法，",
        "translation": "This body is a dead thing, but the spirit has no form.",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "　　假令死復生，　　罪福不敗亡。",
        "translation": "Even if someone were to die and return to life, sins and fortune wouldn't perish.",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "　　終始非一世，　　從癡愛久長，",
        "translation": "The beginning and end are not the same as one time period: it is from delusion that craving lasts.",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "　　自此受苦樂，　　身死神不喪。",
        "translation": "From then on, they'll experience pain and pleasure, and their bodies won't die or lose their spirits.",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "　　非空非海中，　　非入山石間，",
        "translation": "They are neither empty nor in the ocean, Nor do they enter mountains or stones.",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "　　無有地方所，　　脫止不受死。』",
        "translation": "There's no place, and there's no place where they'll be liberated and not subject to death.'",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "太子長嘆，而說頌曰：「於是太子，迴車還宮，愍念眾生有老、病、死苦惱大患，",
        "translation": "The prince, exclaiming for a long time, uttered these verses: Then the prince returned to his chariot and returned to the palace. With pity for sentient beings who are suffering from old age, sickness, and death, he spoke these verses:",
        "source": "T03n0184_002:0467a14_2"
    },
    {
        "source_sentence": "憂思不食。",
        "translation": "He's sad and doesn't eat.",
        "source": "T03n0184_002:0467a25_3"
    },
    {
        "source_sentence": "王問其僕：『太子出遊，寧有樂乎？』",
        "translation": "The king asked his servant, 'Is the prince going out to travel, or is there any pleasure?'",
        "source": "T03n0184_002:0467a25_4"
    },
    {
        "source_sentence": "即答王言：『逢見死人，遂致不樂。』",
        "translation": "He then answered the king, 'When I met a dead man, I ended up unhappy.'",
        "source": "T03n0184_002:0467a26_5"
    },
    {
        "source_sentence": "數年小差，復欲遊觀，嚴駕出北城門。",
        "translation": "Several years later, after a minor departure, he again wished to visit the monastery and came out of the northern city gates in an orderly carriage.",
        "source": "T03n0184_002:0467a26_6"
    },
    {
        "source_sentence": "天復化作沙門，法服持鉢，行步安詳，目不離前。",
        "translation": "Again, the god transformed himself into an ascetic, dressed in the Dharma robe and with his almsbowl in hand, he walked step by step in a peaceful manner, not letting his eyes go before him.",
        "source": "T03n0184_002:0467a27_7"
    },
    {
        "source_sentence": "太子問曰：『此為何人？』",
        "translation": "The prince asked, 'What's this person?'",
        "source": "T03n0184_002:0467a28_8"
    },
    {
        "source_sentence": "其僕答曰：『沙門也！』",
        "translation": "The servant answered, 'That's an ascetic!'",
        "source": "T03n0184_002:0467a29_9"
    },
    {
        "source_sentence": "『何等為沙門？』",
        "translation": "'What's an ascetic?'",
        "source": "T03n0184_002:0467a29_10"
    },
    {
        "source_sentence": "『蓋聞沙門之為道也，捨家妻子，捐棄愛欲，斷絕六情，守戒無為，得一心者，",
        "translation": "'I've heard that the ascetic is a practitioner of the path who abandons his family and wife, abandons craving, stops the six emotions, observes precepts without doing anything, and attains one-pointedness of mind.",
        "source": "T03n0184_002:0467b01_11"
    },
    {
        "source_sentence": "則萬邪滅矣。",
        "translation": "Then all evils will cease.",
        "source": "T03n0184_002:0467b02_12"
    },
    {
        "source_sentence": "一心之道，謂之羅漢，羅漢者真人也。",
        "translation": "The path of one mind is called the arhat, and the arhat is a real person.",
        "source": "T03n0184_002:0467b03_0"
    },
    {
        "source_sentence": "聲色不能污，榮位不能屈，難動如地，已免憂苦，存亡自在。』",
        "translation": "Sound and form can't be defiled, prosperity and position can't be flexed, and it's as difficult to move as the ground, so they're free of sorrow and suffering and have control over birth and death.'",
        "source": "T03n0184_002:0467b03_1"
    },
    {
        "source_sentence": "太子曰：『善哉！",
        "translation": "The prince said, 'Good!",
        "source": "T03n0184_002:0467b05_2"
    },
    {
        "source_sentence": "唯是為快。』",
        "translation": "This is the only thing that's pleasant.'",
        "source": "T03n0184_002:0467b05_3"
    },
    {
        "source_sentence": "「『痛哉有此苦，　　生老病死患，",
        "translation": "'It's painful that there's this suffering of birth, old age, illness, and death.",
        "source": "T03n0184_002:0467b05_4"
    },
    {
        "source_sentence": "　　精神還入罪，　　經歷諸勤苦。",
        "translation": "Their spirits return to sin and undergo various kinds of hardship.",
        "source": "T03n0184_002:0467b05_4"
    },
    {
        "source_sentence": "　　今當滅諸苦，　　生老病死除，",
        "translation": "I will now extinguish the suffering of birth, old age, sickness, and death.",
        "source": "T03n0184_002:0467b05_4"
    },
    {
        "source_sentence": "　　不復與愛會，　　永令得滅度。』",
        "translation": "They won't be able to associate with their loved ones again, and they'll be permanently liberated.'",
        "source": "T03n0184_002:0467b05_4"
    },
    {
        "source_sentence": "即說偈言：「於是太子，即迴車還，齋思不食。",
        "translation": "He then spoke a verse, saying, So the prince returned in his chariot and fasted without eating.",
        "source": "T03n0184_002:0467b05_4"
    },
    {
        "source_sentence": "王問其僕：『太子又出，意豈樂乎？』",
        "translation": "The king asked his servant, 'Is the prince happy when he comes out again?'",
        "source": "T03n0184_002:0467b11_5"
    },
    {
        "source_sentence": "僕言：『行見沙門，倍更憂思，不向飲食。』",
        "translation": "The servant said, 'When I saw the ascetic, I became even more grieved and didn't go to eat or drink.'",
        "source": "T03n0184_002:0467b12_6"
    },
    {
        "source_sentence": "王聞大怒，舉手自擊，前勅修道，復令太子輙見不祥，罪應刑戮。",
        "translation": "The king was furious when he heard this, raised his hand and struck him himself. He had previously instructed the prince to cultivate Buddhism but again caused the prince to see that it was inauspicious and would be punished by death.",
        "source": "T03n0184_002:0467b13_7"
    },
    {
        "source_sentence": "即召群臣，各使建議，設何方術，當令太子不出學道。",
        "translation": "He then summoned the ministers, each of whom was instructed to advise him on where to set up his skillful means so that the prince wouldn't leave home to study the path.",
        "source": "T03n0184_002:0467b14_8"
    },
    {
        "source_sentence": "有一臣言：『宜令太子監農種殖，役其意思，使不念道。』",
        "translation": "A minister said, 'Should the prince be instructed to supervise farming and growing crops so that he doesn't think of the path?'",
        "source": "T03n0184_002:0467b16_0"
    },
    {
        "source_sentence": "便以農器犁牛千具，僕從大小相率上田，令監課之。",
        "translation": "He then took a thousand implements for farming, plows, cattle, and oxen, went up to the field with their attendants, large and small, and ordered them to supervise him.",
        "source": "T03n0184_002:0467b17_1"
    },
    {
        "source_sentence": "太子坐閻浮樹下，見耕者墾壤出蟲，天復化令牛領興壞，蟲下淋落，烏隨啄吞。",
        "translation": "When the prince was sitting under a Jambudvīpa tree, he saw a plower clearing soil and producing worms, and gods again transformed the cow to lead it up and down. The worms went down and drowned, and the cow pecked and swallowed along with them.",
        "source": "T03n0184_002:0467b18_2"
    },
    {
        "source_sentence": "又作蝦蟇，追食曲蟺，蛇從穴出，吞食蝦蟇，孔雀飛下啄吞其蛇，有鷹飛來，",
        "translation": "Again, they become frogs and chase after the crocodiles. A snake emerges from its burrow to feed on the frogs; a peacock flies down to peck at them and swallows them.",
        "source": "T03n0184_002:0467b20_3"
    },
    {
        "source_sentence": "搏取孔雀，鵰鷲復來，搏撮食之。",
        "translation": "He wrestled the peacock and eagles came back to feed on it.",
        "source": "T03n0184_002:0467b22_0"
    },
    {
        "source_sentence": "菩薩見此眾生品類展轉相吞，慈心愍傷，即於樹下得第一禪。",
        "translation": "Seeing these sentient beings, the bodhisattva gradually swallowed each other in various ways, and with kindness and pity, he attained the first dhyāna under a tree.",
        "source": "T03n0184_002:0467b22_1"
    },
    {
        "source_sentence": "日光赫奕，樹為曲枝，隨蔭其軀。",
        "translation": "The sun was shining brilliantly, and the trees were crooked branches that shaded their bodies.",
        "source": "T03n0184_002:0467b24_2"
    },
    {
        "source_sentence": "「王念太子，常在宮中，未曾執苦，即問其僕：『太子何如？』",
        "translation": "The king thought that the prince was always in the palace and hadn't experienced suffering, so he asked his servants, 'What's the prince like?'",
        "source": "T03n0184_002:0467b24_3"
    },
    {
        "source_sentence": "對言：『今在閻浮樹下，一心禪定。』",
        "translation": "He replied, 'Now, I'm at the foot of a Jambudvīpa tree, concentrating my mind in meditation.'",
        "source": "T03n0184_002:0467b26_4"
    },
    {
        "source_sentence": "王曰：『吾令監作欲亂其思，然故禪定，在家何異？』",
        "translation": "The king said, 'I ordered the superintendent to disturb his thoughts, but why is it different at home from my old meditation?'",
        "source": "T03n0184_002:0467b26_5"
    },
    {
        "source_sentence": "王勅嚴駕便往迎之。",
        "translation": "The king ordered an official carriage to go and greet him.",
        "source": "T03n0184_002:0467b28_0"
    },
    {
        "source_sentence": "遙見太子，樹枝曲蔭，神曜非常。",
        "translation": "From a distance he saw the prince, whose shadow was covered by branches of trees and divine light shining brilliantly.",
        "source": "T03n0184_002:0467b28_1"
    },
    {
        "source_sentence": "不識下馬，為作禮時，即與俱還。",
        "translation": "He didn't know how to dismount the horse, and when he paid homage for it, he returned with them.",
        "source": "T03n0184_002:0467b29_2"
    },
    {
        "source_sentence": "未及城門，無數千人，華香奉迎，相師一切，稱壽無量。",
        "translation": "He did not reach the city gates but was greeted by countless thousands of people with flowers and incense. All his attendants lived an immeasurable number of years.",
        "source": "T03n0184_002:0467b29_3"
    },
    {
        "source_sentence": "王問：『何故？』",
        "translation": "The king asked, 'Why is that?'",
        "source": "T03n0184_002:0467c02_4"
    },
    {
        "source_sentence": "梵志答言：『明旦日出，七寶當至。』",
        "translation": "The priest answered, 'The sun will rise tomorrow morning, and the seven treasures will arrive.'",
        "source": "T03n0184_002:0467c02_5"
    },
    {
        "source_sentence": "王大歡喜，必成聖王。",
        "translation": "The king was greatly delighted, thinking that he would surely become a sage king.",
        "source": "T03n0184_002:0467c03_6"
    },
    {
        "source_sentence": "出家品第五",
        "translation": "The Fifth Chapter of Becoming a renunciant",
        "source": "T03n0184_002:0467c04_0"
    },
    {
        "source_sentence": "「是時太子，還宮思惟，念道清淨，不宜在家，當處山林，研精行禪。",
        "translation": "The prince then returned to the palace and reflected, remembering that the path was pure and he shouldn't stay at home; he should be in a mountain forest where he studied meditation.",
        "source": "T03n0184_002:0467c05_0"
    },
    {
        "source_sentence": "至年十九，四月七日，誓欲出家。",
        "translation": "On the seventh day of the fourth month, when he was nineteen years old, he vowed to leave home.",
        "source": "T03n0184_002:0467c06_1"
    },
    {
        "source_sentence": "至夜半後，明星出時，諸天側塞虛空，勸太子去。",
        "translation": "At midnight, when the stars emerged, the heavenly gods at their sides filled the sky and exhorted the prince to depart.",
        "source": "T03n0184_002:0467c07_2"
    },
    {
        "source_sentence": "時裘夷見五夢，即便驚覺，太子問之：『何故驚寤？』",
        "translation": "When Kauśina saw five dreams, he was even startled and awoke, and the prince asked him, Why are you so startled?",
        "source": "T03n0184_002:0467c08_3"
    },
    {
        "source_sentence": "對曰：『向者夢中，見須彌山崩、月明落地、珠光忽滅、頭髻墮地、人奪我蓋，",
        "translation": "He said in reply, “In a dream I saw that the polar mountain collapsed, the moonlight fell to the ground at dawn, the light of the jewel suddenly disappeared, my hair dropped into the ground on top of my head, and people snatched off my lid.",
        "source": "T03n0184_002:0467c09_4"
    },
    {
        "source_sentence": "是故驚覺。』",
        "translation": "That's why I'm frightened.'",
        "source": "T03n0184_002:0467c11_5"
    },
    {
        "source_sentence": "菩薩心念：『五夢者應吾身耳，念當出家。』",
        "translation": "The bodhisattva thought to himself, 'The five dreams should be my ears, thinking that I'll leave home.'",
        "source": "T03n0184_002:0467c11_6"
    },
    {
        "source_sentence": "告裘夷言：『須彌不崩、月明續照、珠光不滅、頭髻不落、傘蓋今在，",
        "translation": "He said to Kauṇḍinya, “The polar mountain will not crumble. The moonlight will continue to shine brightly as long as the moon; the light of the jewels will not be extinguished. The topknot of the Buddha’s head will not fall down.",
        "source": "T03n0184_002:0467c12_7"
    },
    {
        "source_sentence": "且自安寐，莫憂失蓋。』",
        "translation": "Just lie down and don't worry about losing your cover.'",
        "source": "T03n0184_002:0467c13_8"
    },
    {
        "source_sentence": "於是諸天言：『太子當去，恐作稽留。』",
        "translation": "The gods then said, 'The prince will depart, and I'm afraid he'll stay.'",
        "source": "T03n0184_002:0467c14_9"
    },
    {
        "source_sentence": "召烏蘇慢(漢名厭神)，適來入宮，國內厭寐。",
        "translation": "He summoned Wu Suzhi (known as the disillusioned spirit in Chinese), who came to the palace and fell asleep because of his disillusionment.",
        "source": "T03n0184_002:0467c15_10"
    },
    {
        "source_sentence": "時難提和羅，化諸宮殿盡為塚墓，裘夷伎女皆成死人，骨節解散，髑髏異處，",
        "translation": "Nandipāla then transformed all the palaces into tomb mounds. The cowherds and nymphs all became dead bodies, their bones dissolved and disintegrated, and the skeletons were buried in a different place.",
        "source": "T03n0184_002:0467c15_11"
    },
    {
        "source_sentence": "膖脹爛臭，青瘀膿血，流漫相屬。",
        "translation": "Swollen, swollen, rotten, and foul-smelling abscesses, bruises, pus, and blood all flow together.",
        "source": "T03n0184_002:0467c17_12"
    },
    {
        "source_sentence": "太子觀視宮殿，悉作塚墓，鵄鵂狐狸，豺狼鳥獸，飛走其間。",
        "translation": "The prince observed the palace and all made tomb mounds, with fox, foxes, jackals, wolves, birds, and animals flying among them.",
        "source": "T03n0184_002:0467c18_13"
    },
    {
        "source_sentence": "太子觀見一切所有，如幻如化如夢如響，皆悉歸空，而愚者保之。",
        "translation": "The prince observes that everything exists like illusions, magic tricks, dreams, and echoes, all returning to emptiness, but the foolish man keeps it.",
        "source": "T03n0184_002:0467c19_14"
    },
    {
        "source_sentence": "即呼車匿，急令被馬。",
        "translation": "He then called Chanda and quickly ordered him to be put on a horse.",
        "source": "T03n0184_002:0467c21_15"
    },
    {
        "source_sentence": "車匿言：『天尚未曉，被馬何湊？』",
        "translation": "Chanda said, 'The gods haven't yet dawned, so where are the horses collected?'",
        "source": "T03n0184_002:0467c21_16"
    },
    {
        "source_sentence": "「『今我不樂世，　　車匿莫稽留，",
        "translation": "'Now, I won't delight in the world, so don't stay in a chariot or carriage.",
        "source": "T03n0184_002:0467c22_17"
    },
    {
        "source_sentence": "　　使吾本願成，　　除汝三世苦。』",
        "translation": "May my original vow be fulfilled, and I'll remove the suffering of your three worlds.'",
        "source": "T03n0184_002:0467c22_17"
    },
    {
        "source_sentence": "太子為車匿而說偈言：「於是車匿，即行被馬，馬便跳踉，不可得近。",
        "translation": "The prince spoke a verse for Chandaṇi, saying, So Chandaṇi, he was riding on a horse, and the horse jumped and tumbled, unable to get near him.",
        "source": "T03n0184_002:0467c22_17"
    },
    {
        "source_sentence": "還白太子：『馬今不可得被。』",
        "translation": "He returned to the prince and said, 'Now, that horse can't be covered.'",
        "source": "T03n0184_002:0467c27_0"
    },
    {
        "source_sentence": "「『在於生死久，　　騎乘絕於今，",
        "translation": "'It's been a long time since birth and death, but the mounted vehicle is now extinguished.",
        "source": "T03n0184_002:0467c27_1"
    },
    {
        "source_sentence": "　　騫特送我出，　　得道不忘汝。』",
        "translation": "Please send me out, and I won't forget you when I get the teaching.'",
        "source": "T03n0184_002:0467c27_1"
    },
    {
        "source_sentence": "菩薩自往拊拍馬背，而說頌言：「於是被馬訖。",
        "translation": "The bodhisattva went on his own, patted the horse's back, and spoke a verse, saying, So he finished carrying the horse.",
        "source": "T03n0184_002:0467c27_1"
    },
    {
        "source_sentence": "騫特自念言：『今當足[跳-兆+答]地，感動中外人。』",
        "translation": "Kauṣṭhila thought to himself, 'Now, I'll [jump - zhao + answer] the ground with my feet and move people here and there.'",
        "source": "T03n0184_002:0468a02_2"
    },
    {
        "source_sentence": "四神接舉足，令脚不著地。",
        "translation": "The four deities touched and lifted his feet so that their feet wouldn't touch the ground.",
        "source": "T03n0184_002:0468a03_3"
    },
    {
        "source_sentence": "馬時復欲鳴，使聲遠近聞。",
        "translation": "The horse then wanted to sound again, so that the sound would be heard far and near.",
        "source": "T03n0184_002:0468a03_4"
    },
    {
        "source_sentence": "天神散馬聲，皆令入虛空。",
        "translation": "The sound of heavenly gods scattering horses caused them all to enter the sky.",
        "source": "T03n0184_002:0468a04_5"
    },
    {
        "source_sentence": "太子即上馬，出行詣城門，諸天、龍神、釋梵四天，皆悉導從，蓋於虛空。",
        "translation": "The prince then ascended to the horse and traveled to the city gates, where the gods, dragons, goddesses, and Śakra and Brahmā gods all led him up into the sky.",
        "source": "T03n0184_002:0468a05_6"
    },
    {
        "source_sentence": "時城門神人現，稽首言：『迦維羅衛國，天下最為中。",
        "translation": "The deities at the gates of the city then appeared and bowed their heads, saying, 'The country of Kapilavastu is the best in the world.",
        "source": "T03n0184_002:0468a06_7"
    },
    {
        "source_sentence": "豐樂人民安，何故捨之去？』",
        "translation": "Why did you abandon it when the people were prosperous and peaceful?'",
        "source": "T03n0184_002:0468a07_8"
    },
    {
        "source_sentence": "「『生死為久長，　　精神經五道，",
        "translation": "'Birth and death are long-lasting, and the five paths of the spiritual scriptures",
        "source": "T03n0184_002:0468a08_9"
    },
    {
        "source_sentence": "　　使我本願成，　　當開泥洹門。』",
        "translation": "If my original vow is accomplished, I'll open the gate of nirvāṇa.'",
        "source": "T03n0184_002:0468a08_9"
    },
    {
        "source_sentence": "太子以偈答言：「於是城門自然便開，出門飛去。",
        "translation": "The prince answered in verse, So the gates of the city naturally opened and flew out.",
        "source": "T03n0184_002:0468a08_9"
    },
    {
        "source_sentence": "天曉，行四百八十里，到阿奴摩國(漢言常滿)。",
        "translation": "At dawn he traveled for four hundred and eighty li to the country of Anuma (known as Changmen in Chinese).",
        "source": "T03n0184_002:0468a11_10"
    },
    {
        "source_sentence": "太子下馬，解身寶衣纓絡寶冠，盡與闡特，告言：『汝便牽馬歸，上謝大王及國群臣。』",
        "translation": "The prince dismounted from his horse, untied his jeweled robes, wrapped his precious crown around his neck, and gave them to the  Chanda, saying, 'Take the horse home and thank the great king and his ministers.'",
        "source": "T03n0184_002:0468a12_11"
    },
    {
        "source_sentence": "闡特言：『今當隨從，供給所須，不可獨還放馬令去。",
        "translation": "The icchantika said, 'Now, I will follow it and provide what's needed; I can't go back by myself or let the horse go.",
        "source": "T03n0184_002:0468a14_12"
    },
    {
        "source_sentence": "山中多有毒蟲虎狼師子，誰當供養飲食水漿床臥之具？",
        "translation": "In the mountain there are many poisonous insects, tigers, wolves, and lions, so who will make offerings of food, drink, water, juice, beds, and bedding?",
        "source": "T03n0184_002:0468a15_13"
    },
    {
        "source_sentence": "當何從得，要當隨從與并身命。』",
        "translation": "Where will you get it? You must follow it and give it to me along with your body and life.'",
        "source": "T03n0184_002:0468a16_14"
    },
    {
        "source_sentence": "騫特長跪，淚出舐足，見水不飲，得草不食，鳴啼流涕徘徊不去。",
        "translation": "When he knelt down long enough to lick his feet with tears, he saw water that he couldn't drink, grass that he didn't eat, and cries and wandered away in tears.",
        "source": "T03n0184_002:0468a17_15"
    },
    {
        "source_sentence": "「『身強得病摧，　　氣盛老至衰，",
        "translation": "'The body is strong, the disease breaks down, and the vitality grows old and becomes weak.",
        "source": "T03n0184_002:0468a19_16"
    },
    {
        "source_sentence": "　　死亡生別離，　　云何樂世間。』",
        "translation": "Death and birth are separated, so how can we enjoy the world?'",
        "source": "T03n0184_002:0468a19_16"
    },
    {
        "source_sentence": "太子復說偈言：「於是闡特，悲泣禮足，牽馬辭還。",
        "translation": "The prince again uttered the following verse: Then Chanda, weeping in sorrow and paying respect at his feet, led the horse home and withdrew.",
        "source": "T03n0184_002:0468a19_16"
    },
    {
        "source_sentence": "未至國城，四十里外，白馬悲鳴，其聲徹國中，國中皆云：『太子來還！』",
        "translation": "Before he arrived at the capital city, forty miles away, white horses cried out in sorrow, and their voice penetrated the country, saying, 'Come back, prince!'",
        "source": "T03n0184_002:0468a22_17"
    },
    {
        "source_sentence": "舉國人民，絡繹出迎，但見闡特牽馬空還。",
        "translation": "The king and his people came out to greet him but they saw Chanda pulling the horse back through the air.",
        "source": "T03n0184_002:0468a24_18"
    },
    {
        "source_sentence": "裘夷見此，自投殿下，前抱馬頸淚下交橫。",
        "translation": "Seeing this, Kauṇḍinya threw himself down to the palace, embraced the horse in front of him, and wailed under his neck with tears.",
        "source": "T03n0184_002:0468a25_19"
    },
    {
        "source_sentence": "王見裘夷泣，五內皆摧傷，自抑告言曰：『吾子學自然。』",
        "translation": "Seeing Kauṇḍinya weeping, the king crushed his five internal wounds and told him to suppress himself, 'My son is studying naturally.'",
        "source": "T03n0184_002:0468a26_20"
    },
    {
        "source_sentence": "國中臣民，見王及裘夷哽咽悲泣，莫不為摧傷。",
        "translation": "All the officials and citizens of the kingdom saw the king and his barbarians sobbing in sorrow and weeping, and none of them were saddened.",
        "source": "T03n0184_002:0468a27_21"
    },
    {
        "source_sentence": "裘夷日夜思，王便召群臣：『吾有一太子，捨我而入山。",
        "translation": "Day and night he thought to himself: The king summoned his ministers, saying: I have a prince who has abandoned me and gone into the mountains.",
        "source": "T03n0184_002:0468a28_22"
    },
    {
        "source_sentence": "卿曹今差次，令數滿五人，共追侍太子，慎勿中來還。』",
        "translation": "Now, I'll send a succession of five people to follow the prince and make sure he doesn't come back or go in.'",
        "source": "T03n0184_002:0468b01_23"
    },
    {
        "source_sentence": "「太子得離俗，踊躍欣喜，安徐步行入城。",
        "translation": "Having renounced the householder’s life, the prince was delighted and jumped for joy. He entered the city on foot at ease.",
        "source": "T03n0184_002:0468b02_24"
    },
    {
        "source_sentence": "國人覩太子，歡喜無有厭。",
        "translation": "The people of the kingdom delighted in seeing the prince, rejoicing and not getting tired of it.",
        "source": "T03n0184_002:0468b03_25"
    },
    {
        "source_sentence": "太子離恩愛，遠諸苦惱根，思欲剃頭髮，倉卒無有具。",
        "translation": "The prince, free of affection and love and far removed from the roots of suffering and distress, wished to shave himself, but the storehousekeeper had no provisions.",
        "source": "T03n0184_002:0468b03_26"
    },
    {
        "source_sentence": "帝釋持刀來，天神受髮去，遂復前行。",
        "translation": "Indra came with a sword, and the gods accepted it and departed, so they went on again.",
        "source": "T03n0184_002:0468b05_27"
    },
    {
        "source_sentence": "國中人民，隨而觀之。",
        "translation": "The people of the kingdom followed him and observed him.",
        "source": "T03n0184_002:0468b05_28"
    },
    {
        "source_sentence": "於是出國，小復前行，到摩竭國，從右門入左門出。",
        "translation": "So he left the empire and proceeded again for a short distance to the country of Magadha, where he entered through the right gate and left through the left gate.",
        "source": "T03n0184_002:0468b06_29"
    },
    {
        "source_sentence": "國中人民，男女大小，見太子者，或言天人，或言帝釋梵王、天神龍王，",
        "translation": "The people of the kingdom, men and women alike, large and small, saw the prince. Some said he was a heavenly being, while others said he was Indra, Brahmā, god or dragon king.",
        "source": "T03n0184_002:0468b07_30"
    },
    {
        "source_sentence": "歡喜踊躍，不知何神。",
        "translation": "Rejoicing and jumping for joy, he didn't know what spirit it was.",
        "source": "T03n0184_002:0468b09_31"
    },
    {
        "source_sentence": "太子知其所念，便下道坐樹下，人民圍繞，歡喜觀視。",
        "translation": "Knowing what he thought, the prince went down the road and sat under a tree. Surrounded by the people, he was delighted to look around.",
        "source": "T03n0184_002:0468b09_32"
    },
    {
        "source_sentence": "時國王瓶沙，即問臣吏：『國中何以寂默，了無音聲？』",
        "translation": "The king of the country then asked his ministers, 'Why is it so silent in the kingdom that there's no sound?'",
        "source": "T03n0184_002:0468b10_33"
    },
    {
        "source_sentence": "對曰：『朝有道士，經國過去，光相威儀，非世所有。",
        "translation": "He said in reply, 'There's a Daoist priest in the court who passed away from his country and whose radiant appearance and manner are not worldly.",
        "source": "T03n0184_002:0468b12_34"
    },
    {
        "source_sentence": "國人大小，追出而觀，于今未還。』",
        "translation": "The people of the country, large and small, pursued it and observed it, but they haven't returned now.'",
        "source": "T03n0184_002:0468b13_35"
    },
    {
        "source_sentence": "「於是王與群臣，出詣道士。",
        "translation": "“Thereupon, the king and his ministers went out to visit the Daoists.",
        "source": "T03n0184_002:0468b13_36"
    },
    {
        "source_sentence": "遙見太子光相殊妙，便問太子：『是何神乎？』",
        "translation": "Seeing the prince's marvelous appearance from a distance, he asked the prince, 'What's this spirit?'",
        "source": "T03n0184_002:0468b14_37"
    },
    {
        "source_sentence": "太子答言：『吾非神也！』",
        "translation": "The prince answered, 'I'm not a god!'",
        "source": "T03n0184_002:0468b15_38"
    },
    {
        "source_sentence": "『若非神者，從何國來？",
        "translation": "'If it's not a soul, where will it come from?",
        "source": "T03n0184_002:0468b16_0"
    },
    {
        "source_sentence": "何所姓族？』",
        "translation": "What's the family?'",
        "source": "T03n0184_002:0468b16_1"
    },
    {
        "source_sentence": "太子報言：『吾出香山之東、雪山之北，國名迦維，父名白淨，母名摩耶。』",
        "translation": "The prince replied, 'I'll go east of the fragrant mountain and north of the snowy mountains, named Kapilavastu, with a father named Baijing and a mother namedmaya.'",
        "source": "T03n0184_002:0468b16_2"
    },
    {
        "source_sentence": "瓶沙問言：『將非悉達乎？』",
        "translation": "Vaiśravaṇa asked, 'Is it not a siddhânta?'",
        "source": "T03n0184_002:0468b18_3"
    },
    {
        "source_sentence": "答言：『是也！』",
        "translation": "He replied, 'Yes!'",
        "source": "T03n0184_002:0468b18_4"
    },
    {
        "source_sentence": "驚起禮足：『太子生多奇異，形相炳著，當君四天下為轉輪聖王，四海顒顒冀神寶至。",
        "translation": "Surprised, he stood up and bowed at his feet, saying, 'The prince's birth is so marvelous that his form shines brilliantly. He will rule over the four quarters of the earth as a wheel-turning sage king, and the four seas in the sea hope that divine treasures will arrive.",
        "source": "T03n0184_002:0468b19_5"
    },
    {
        "source_sentence": "何棄天位，自投山藪？",
        "translation": "Why did you abandon your heavenly throne and throw yourself into a mountainous forest?",
        "source": "T03n0184_002:0468b21_6"
    },
    {
        "source_sentence": "必有異見，願聞其志。』",
        "translation": "There must be a different view, so I'd like to hear its intention.'",
        "source": "T03n0184_002:0468b21_7"
    },
    {
        "source_sentence": "太子答言：『以吾所見，天地人物，出生有死，劇痛有三，老、病、死苦，",
        "translation": "The prince replied: As far as I see it, the heavens and earth are subject to birth and death. Old age, sickness, and death are of three types:",
        "source": "T03n0184_002:0468b22_8"
    },
    {
        "source_sentence": "不可得離。",
        "translation": "They can't be separated.",
        "source": "T03n0184_002:0468b23_9"
    },
    {
        "source_sentence": "身為苦器，憂畏無量，若在尊寵，則有憍逸，貪求快意，天下被患，此吾所厭故欲入山。』",
        "translation": "My body is a vessel of suffering, and my grief and fear are immeasurable; if I were to be honored, there would be sexual misconduct, craving and happiness, and the whole world would be afflicted by it, which is why I'd like to enter the mountain because I'm disillusioned with it.'",
        "source": "T03n0184_002:0468b23_10"
    },
    {
        "source_sentence": "諸耆長曰：『夫老、病、死，自世之常，何獨預憂？",
        "translation": "The elders said, 'Since old age, illness, and death are constant in their own world, why should we worry alone?'",
        "source": "T03n0184_002:0468b25_11"
    },
    {
        "source_sentence": "乃棄美號，隱遁潛居，以勞其形，不亦難耶？』",
        "translation": "So he abandoned his good reputation and retired in seclusion to live in seclusion, so wouldn't it be difficult to trouble his form?'",
        "source": "T03n0184_002:0468b26_12"
    },
    {
        "source_sentence": "「於是太子，即說頌言：「『如令人在胎，不為不淨；",
        "translation": "The prince then uttered the following verse:",
        "source": "T03n0184_002:0468b27_13"
    },
    {
        "source_sentence": "　　如令在淨，不為不淨污；",
        "translation": "He causes them to abide in purity and not be defiled by impurity.",
        "source": "T03n0184_002:0468c01_0"
    },
    {
        "source_sentence": "　　如令苦，不為多、無有數；",
        "translation": "It is like causing suffering, which is neither numerous nor countless.",
        "source": "T03n0184_002:0468c02_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0468c03_0"
    },
    {
        "source_sentence": "　　如令人老形，不若干變；",
        "translation": "It is as if someone were to grow old and not undergo certain transformations.",
        "source": "T03n0184_002:0468c04_0"
    },
    {
        "source_sentence": "　　如令善行者，不為惡行；",
        "translation": "Those who are directed to perform good deeds don’t do evil deeds.",
        "source": "T03n0184_002:0468c05_0"
    },
    {
        "source_sentence": "　　如令愛別離，不為苦痛；",
        "translation": "“Good son, it is as if someone were to divorce their craving and not experience pain.",
        "source": "T03n0184_002:0468c06_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0468c07_0"
    },
    {
        "source_sentence": "　　如令病瘦，無復有大畏；",
        "translation": "In the same way, he caused his sickness to be so thin that he no longer had great fear.",
        "source": "T03n0184_002:0468c08_0"
    },
    {
        "source_sentence": "　　如令後世，無有諸惡對；",
        "translation": "In the same way, they cause no evil to oppose them in future ages.",
        "source": "T03n0184_002:0468c09_0"
    },
    {
        "source_sentence": "　　如令墮地獄，無有苦痛；",
        "translation": "It is as if someone were to fall into hell without any pain or suffering.",
        "source": "T03n0184_002:0468c10_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0468c11_0"
    },
    {
        "source_sentence": "　　如令年少形，不變壞者；",
        "translation": "Suppose you order a youthful form not to change or disintegrate.",
        "source": "T03n0184_002:0468c12_0"
    },
    {
        "source_sentence": "　　如令所不可，不以著心；",
        "translation": "Whatever they ordered not to do, they did so without attachment of mind.",
        "source": "T03n0184_002:0468c13_0"
    },
    {
        "source_sentence": "　　如令死至時，無有眾畏；",
        "translation": "They feel no fear of anyone when they are about to die, just as they have no fear of anyone.",
        "source": "T03n0184_002:0468c14_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0468c15_0"
    },
    {
        "source_sentence": "　　如令愚癡，不以為厚冥；",
        "translation": "They cause ignorance and delusion, yet they do not think of it as deep darkness.",
        "source": "T03n0184_002:0468c16_0"
    },
    {
        "source_sentence": "　　如令瞋恚，不為強怨家；",
        "translation": "“Good son, it is as if someone were to get angry and not become a strong enemy.",
        "source": "T03n0184_002:0468c17_0"
    },
    {
        "source_sentence": "　　如令五樂心，不為染惡；",
        "translation": "They cause the five kinds of bliss not to be defiled by evil.",
        "source": "T03n0184_002:0468c18_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0468c19_0"
    },
    {
        "source_sentence": "　　如令不與，諸癡人共居；",
        "translation": "If you order them not to give it, the ignorant will live together with you.",
        "source": "T03n0184_002:0468c20_0"
    },
    {
        "source_sentence": "　　如令眾癡法，自遠離人；",
        "translation": "In the same way they cause all the deluded dharmas to be separated themselves from others.",
        "source": "T03n0184_002:0468c21_0"
    },
    {
        "source_sentence": "　　如令諸癡人，無有思想；",
        "translation": "It is as if they caused the deluded to have no thought.",
        "source": "T03n0184_002:0468c22_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0468c23_0"
    },
    {
        "source_sentence": "　　如令諸惡種，不若干輩；",
        "translation": "They cause the bad seeds not to be divided into different classes.",
        "source": "T03n0184_002:0468c24_0"
    },
    {
        "source_sentence": "　　如令諸惡，盡滅自離人；",
        "translation": "In the same way he caused all evil to be completely extinguished and separated himself from others.",
        "source": "T03n0184_002:0468c25_0"
    },
    {
        "source_sentence": "　　如令諸惡念，無有思想；",
        "translation": "In the same way they cause bad thoughts to have no thought.",
        "source": "T03n0184_002:0468c26_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0468c27_0"
    },
    {
        "source_sentence": "　　如令世間惡，為最尊上；",
        "translation": "He is the most honored among all those who do evil in the world.",
        "source": "T03n0184_002:0468c28_0"
    },
    {
        "source_sentence": "　　如令惡行已，滅不復生；",
        "translation": "In the same way, after causing evil deeds to be done, they cease and no longer arise.",
        "source": "T03n0184_002:0468c29_0"
    },
    {
        "source_sentence": "　　如令諸惡行，盡無有實；",
        "translation": "In the same way, if one were to cause bad actions, there would be no reality in their totality.",
        "source": "T03n0184_002:0469a01_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0469a02_0"
    },
    {
        "source_sentence": "　　如令諸天，食福常不動；",
        "translation": "It is as if they caused the gods to nourish themselves with blessings and always remain unmoving.",
        "source": "T03n0184_002:0469a03_0"
    },
    {
        "source_sentence": "　　如令世人，壽命得常存；",
        "translation": "In the same way, he caused the world to attain eternal existence by extending life spans.",
        "source": "T03n0184_002:0469a04_0"
    },
    {
        "source_sentence": "　　如令諸處所，不為行趣；",
        "translation": "In the same way they cause all places not to be the courses of action.",
        "source": "T03n0184_002:0469a05_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？",
        "translation": "Suppose it's like this, who wouldn't delight in the world?",
        "source": "T03n0184_002:0469a06_0"
    },
    {
        "source_sentence": "　　如令諸蔭蓋，不為怨家；",
        "translation": "It is like causing all the shades and coverings to be without enemies.",
        "source": "T03n0184_002:0469a07_0"
    },
    {
        "source_sentence": "　　如令諸六入，無有苦惱；",
        "translation": "They cause the six sense-fields to be free of suffering and distress.",
        "source": "T03n0184_002:0469a08_0"
    },
    {
        "source_sentence": "　　如令一切世間，為不苦；",
        "translation": "In the same way they cause all worlds to be without suffering.",
        "source": "T03n0184_002:0469a09_0"
    },
    {
        "source_sentence": "　　假令如是，誰不樂世者？』",
        "translation": "Suppose it's like this, who wouldn't enjoy the world?'",
        "source": "T03n0184_002:0469a10_0"
    },
    {
        "source_sentence": "「於是如諸君言：『不當預憂，使我為王，老到病至，若當死時，寧有代我受此厄者不？",
        "translation": "Then, just as you people said, 'You shouldn't worry about me being king when old and sick, so how could there be someone who would accept this trouble on my behalf if I were to die?'",
        "source": "T03n0184_002:0469a11_0"
    },
    {
        "source_sentence": "如無有代，胡可勿憂？",
        "translation": "As there is no emperor, why should we not grieve?",
        "source": "T03n0184_002:0469a12_1"
    },
    {
        "source_sentence": "天下有慈父孝子，愛徹骨髓，至當死時不得相代。",
        "translation": "There were loving fathers and filial sons in the world who loved their bones and marrow, and they couldn't replace each other when they died.",
        "source": "T03n0184_002:0469a13_2"
    },
    {
        "source_sentence": "若此偽身，苦至之日，雖居高位，六親在側，如為盲人設燭，何益於無眼者。",
        "translation": "If this fake body, even though it's in a high place and six relatives are at his side on the day of suffering, is like setting up a candle for a blind man, what good would it do to someone who has no eyes?",
        "source": "T03n0184_002:0469a14_3"
    },
    {
        "source_sentence": "吾覩眾行，一切無常，皆化非真，樂少苦多。",
        "translation": "I pity all conditioned phenomena that are impermanent, and they are all transformations that aren't true, with little pleasure and much suffering.",
        "source": "T03n0184_002:0469a16_4"
    },
    {
        "source_sentence": "身非己有，世間虛無，難得久居。",
        "translation": "The body does not exist for itself; the world is empty and nonexistent. It is difficult to live a long time.",
        "source": "T03n0184_002:0469a17_5"
    },
    {
        "source_sentence": "物生有死，事成有敗，安則有危，得則有亡。",
        "translation": "When things arise, there's death; when things are formed, there's defeat; when they're peaceful, there's danger; and when they're gained, there's loss.",
        "source": "T03n0184_002:0469a18_6"
    },
    {
        "source_sentence": "萬物紛擾，皆當歸空，精神無形，躁濁不明。",
        "translation": "All things are disturbed, and they all return to emptiness, their spirits have no form, and the turbidity of agitation is unknown.",
        "source": "T03n0184_002:0469a19_7"
    },
    {
        "source_sentence": "行致死生之厄，非直一受而已也。",
        "translation": "What's practiced causes the trouble of death and birth, not just a single sensation.",
        "source": "T03n0184_002:0469a20_8"
    },
    {
        "source_sentence": "但為貪愛，蔽在癡網，沒生死河，莫之能覺。",
        "translation": "But because of their craving, they're hindered by the web of delusion and submerged in the river of birth-and-death, so no one can awaken to it.",
        "source": "T03n0184_002:0469a20_9"
    },
    {
        "source_sentence": "故吾欲入山，一心思四空淨，度色滅恚，斷求念空，無所適莫，是將反其原而歸其本，",
        "translation": "That is why I want to enter the mountains. With a single mind, purified by the four kinds of emptiness, I transcend form and extinguish anguish lust. Having cut off all thoughts of emptiness, there is no place for me to go. This is how I will turn from the original into the original.",
        "source": "T03n0184_002:0469a21_10"
    },
    {
        "source_sentence": "始出其根，如我願得乃可大安。』",
        "translation": "When he first produces his faculties, he'll be able to attain great peace as I wish.'",
        "source": "T03n0184_002:0469a23_11"
    },
    {
        "source_sentence": "瓶沙王及諸耆長，歡喜意解：『太子志妙，世間難有，必得佛道，願先度我。』",
        "translation": "The king of Vaiśravaṇa and the elders rejoiced and resolved, saying, 'The prince's aspiration is marvelous; it's rare in the world; he will surely attain the Buddha Way, so may he first save me.'",
        "source": "T03n0184_002:0469a24_12"
    },
    {
        "source_sentence": "「太子默然而逝，復前念言：『今我入山，當用寶衣為？",
        "translation": "The prince passed away in silence. Again, he thought to himself: Now that I am entering the mountains, should I use my precious raiment?",
        "source": "T03n0184_002:0469a26_13"
    },
    {
        "source_sentence": "世間癡人，皆為財所危。』",
        "translation": "The world's deluded people are all in danger of possessions.'",
        "source": "T03n0184_002:0469a27_14"
    },
    {
        "source_sentence": "即便見獵師，駈遊被法衣。",
        "translation": "He then saw that the hunter was wandering about wearing the Dharma robe.",
        "source": "T03n0184_002:0469a28_15"
    },
    {
        "source_sentence": "太子喜念言：『此則真人衣，度世慈悲服，獵者何故著？",
        "translation": "The prince rejoiced and thought, saying, 'This is the robe of a true person, the robe of world-transcendent kindness and compassion. Why would a hunter wear it?'",
        "source": "T03n0184_002:0469a28_16"
    },
    {
        "source_sentence": "心念欲貿易，成我志所願。』",
        "translation": "My mind is mindful of wanting to trade, and I'll fulfill my wish.'",
        "source": "T03n0184_002:0469b01_0"
    },
    {
        "source_sentence": "便持金縷衣，貿所法震越。",
        "translation": "He then took a robe of gold thread and traded it for the Dharma that shook him.",
        "source": "T03n0184_002:0469b01_1"
    },
    {
        "source_sentence": "獵者內歡喜，菩薩亦俱然。",
        "translation": "The hunter rejoiced inside, and so did the bodhisattva.",
        "source": "T03n0184_002:0469b02_2"
    },
    {
        "source_sentence": "太子被震越，柔軟鮮且潔，顧視僧伽梨，過佛無差別，於是遂入山。",
        "translation": "The prince had been shaken by the earthquake and was soft, fresh, and clean. Looking at Siṃhala he saw that there was no difference between him and the Buddha. So he went into the mountains.",
        "source": "T03n0184_002:0469b02_3"
    },
    {
        "source_sentence": "菩薩得法服，欣喜光照耀。",
        "translation": "When the bodhisattva attained the Dharma robe, he was delighted and shining brightly.",
        "source": "T03n0184_002:0469b04_4"
    },
    {
        "source_sentence": "山林諸道士，一名為阿蘭，二名為迦蘭，學來積年，四禪具足，獲致五通，",
        "translation": "The monks in the mountain forest were all called Ārāḍa and two of them were called Kālāma. They had studied Buddhism for many years and perfected the fourth absorption, enabling them to attain the five higher knowledges.",
        "source": "T03n0184_002:0469b05_0"
    },
    {
        "source_sentence": "見光驚怖，此何瑞應？",
        "translation": "Seeing the light, they're frightened, so what's the auspicious sign that should be shown here?",
        "source": "T03n0184_002:0469b06_1"
    },
    {
        "source_sentence": "便共出觀，遙見太子：『是為悉達，今果出家。",
        "translation": "They then went out together to observe and saw the prince from a distance, saying, 'This is Siddhârtha, who has now left home.",
        "source": "T03n0184_002:0469b07_2"
    },
    {
        "source_sentence": "善來悉達便坐是榻，冷泉美果今可食之。』",
        "translation": "Well-come, Siddhârtha then sat down on this couch, and now he can eat it from a cool spring of good fruit.'",
        "source": "T03n0184_002:0469b08_3"
    },
    {
        "source_sentence": "「『日王初出時，　　在於山頂上，",
        "translation": "'When the king of the sun first emerges, he's at the top of the mountain,",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "　　是故慧明照，　　一切諸群生。",
        "translation": "Therefore, wisdom clearly illuminates all sentient beings.",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "　　若有觀面像，　　終竟不知厭，",
        "translation": "If there are those who contemplate images of the Buddha’s face, They will never tire of it.",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "　　是故道德最，　　無雙無有比。』",
        "translation": "Therefore, morality is the greatest, and there's no equal or inferior.'",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "「『雖修四定意，　　不知無上慧，",
        "translation": "'Although I cultivate the four mental states of concentration, I don't know the unsurpassed wisdom.",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "　　道心正為本，　　不在事邪神。",
        "translation": "The mind of enlightenment is precisely the root, Not depending on evil spirits.",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "　　行俗謂為真，　　長夜求梵天，",
        "translation": "Practice and secularism are said to be true, seeking the Brahma heavens for a long time.",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "　　是故不識道，　　輪轉墮生死。』",
        "translation": "Therefore, they don't know the path and fall into birth-and-death in transmigration.'",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "而作頌曰：「是時菩薩而說頌曰：「於是菩薩，行起慈心，遍念眾生老耄專愚，",
        "translation": "He composed the following verse: Then the Bodhisattva spoke these verses: Thereupon, the Bodhisattva practiced loving-kindness and universally thought of sentient beings as old and ignorant.",
        "source": "T03n0184_002:0469b09_4"
    },
    {
        "source_sentence": "不免疾病死喪之痛，欲令解脫，以一其意；",
        "translation": "They cannot escape the pain of sickness, death, and sorrow; they want to be liberated but do so with one thought:",
        "source": "T03n0184_002:0469b20_0"
    },
    {
        "source_sentence": "而起悲心，愍傷一切，皆有飢渴寒暑得失罪咎艱難之患，欲令安隱，以一其意；",
        "translation": "They become compassionate and pitying all those who suffer from hunger, thirst, cold, heat, sins, blameworthiness, and distress. Wishing to make them feel at ease, they concentrate on their thoughts.",
        "source": "T03n0184_002:0469b20_1"
    },
    {
        "source_sentence": "而起喜心，念諸世間，皆有憂苦恐怖遭逢之患，欲令淡泊，以一其意；",
        "translation": "They become joyful and think of all the worlds as grieved, pained, and terrified when confronted with danger.",
        "source": "T03n0184_002:0469b22_2"
    },
    {
        "source_sentence": "而起護心，欲度五道八難眾生，愚蔽曚闇，不見正道，念欲成濟使得無為，",
        "translation": "They want to liberate sentient beings from the five realms of rebirth and the eight difficulties that afflict living beings. Foolishly blinded by ignorance and darkness, they do not see the right path. They are mindful of their aspiration for enlightenment in order to accomplish it so as to make it nonexistent.",
        "source": "T03n0184_002:0469b24_3"
    },
    {
        "source_sentence": "以一其意；",
        "translation": "By focusing on one thought:",
        "source": "T03n0184_002:0469b26_4"
    },
    {
        "source_sentence": "得善不喜，逢惡不憂，捨世八事，利衰毀譽稱譏苦樂，不以傾動，成二禪行。",
        "translation": "Attaining goodness, he doesn't rejoice, encounters evil and isn't sad, abandons the eight things in the world, profits and losses, disparages fame and criticizes suffering and happiness, doesn't move because of it, and accomplishes the practice of the second dhyāna.",
        "source": "T03n0184_002:0469b26_5"
    },
    {
        "source_sentence": "「復前到斯那川，其川平正，多眾果樹，處處皆有流泉浴池，其中淨潔，",
        "translation": "“Going on, he reached the Sinā River. The river was even and there were many fruit trees growing in it. Everywhere there was a flowing fountain and bathing pond, pure and clean.",
        "source": "T03n0184_002:0469b28_6"
    },
    {
        "source_sentence": "無有蚑、蜂、蚊、虻、蠅、蚤。",
        "translation": "There are no abscesses, bees, gnats, flies, or fleas.",
        "source": "T03n0184_002:0469b29_7"
    },
    {
        "source_sentence": "川中道士，名為斯那，教授弟子等五百人，修其所術。",
        "translation": "The Daoist priest named Senā taught the Dharma to five hundred disciples, who cultivated their skills.",
        "source": "T03n0184_002:0469c01_8"
    },
    {
        "source_sentence": "於是菩薩坐娑羅樹下，便為一切志求無上正真之道。",
        "translation": "The bodhisattva then sat under the sal trees and sought the unsurpassed true path for all their aspirations.",
        "source": "T03n0184_002:0469c02_9"
    },
    {
        "source_sentence": "諸天奉甘露，菩薩一不肯受，自誓日食一麻一米，以續精氣。",
        "translation": "The gods offered sweet dew, but the Bodhisattva refused to accept it. He made a vow that he would eat one grain of hemp and one grain of rice every day in order to maintain his vitality.",
        "source": "T03n0184_002:0469c03_10"
    },
    {
        "source_sentence": "端坐六年，形體羸瘦，皮骨相連，玄精靜寞，寂默一心，內思安般——一數、二隨、三止、四觀、五還、六淨——遊志三四出十二門，",
        "translation": "He sat there for six years. His body was emaciated and thin in stature, his skin and bones separated one from the other. His spirit of enlightenment was tranquil and lonely but he remained silent and unified with a concentrated mind. He meditated internally on counting [the number of precepts], following [the precepts], calming [",
        "source": "T03n0184_002:0469c05_11"
    },
    {
        "source_sentence": "無分散意，神通妙達，棄欲惡法，無復五蓋，不受五欲，眾惡自滅，念計分明，",
        "translation": "He had no distracting thoughts, and his supernormal powers were marvelously enlightened. He renounced the evil deeds of desire and abandoned the five hindrances. He did not experience the five kinds of sexual desire. All evil ceased on their own, being clearly discriminated in each thought.",
        "source": "T03n0184_002:0469c07_12"
    },
    {
        "source_sentence": "思視無為，譬如健人得勝怨家，意以清淨，成三禪行。",
        "translation": "It's like a strong man who wins over a house of enemies and purifies his mind with the practice of the three meditations by contemplating nonexistence.",
        "source": "T03n0184_002:0469c09_13"
    },
    {
        "source_sentence": "「天帝釋意念言：『菩薩坐樹下，六年已滿，形體羸瘦，今當使世間人，",
        "translation": "Śakra, lord of the gods, thought to himself, “The bodhisattva was sitting under a tree for six years.",
        "source": "T03n0184_002:0469c10_14"
    },
    {
        "source_sentence": "奉轉輪王食，補六年之飢虛。』",
        "translation": "I'll offer food to the wheel-turning king and make up for the six years of hunger.'",
        "source": "T03n0184_002:0469c12_15"
    },
    {
        "source_sentence": "便感斯那二女，使於夢中見天下盡成為水，中有一花七寶光色，須臾便萎，",
        "translation": "Then the two daughters of Cesna had a dream in which they saw all the world become water, and there was a flower with the shining color of the seven kinds of treasure. In a moment it withered.",
        "source": "T03n0184_002:0469c13_16"
    },
    {
        "source_sentence": "失其本色。",
        "translation": "They lose their original form.",
        "source": "T03n0184_002:0469c14_17"
    },
    {
        "source_sentence": "見有一人，以水灑上，更生如故。",
        "translation": "When he saw a man, he sprinkled water over him and was born again as before.",
        "source": "T03n0184_002:0469c15_18"
    },
    {
        "source_sentence": "水中眾花，始生萌芽，覆水而出。",
        "translation": "The flowers in the water began to grow and sprouting, covering the water and coming out.",
        "source": "T03n0184_002:0469c15_19"
    },
    {
        "source_sentence": "二女夢寤，怪未曾有，即啟語父。",
        "translation": "The two daughters had a dream in which they wondered at something unprecedented. They told their father.",
        "source": "T03n0184_002:0469c16_20"
    },
    {
        "source_sentence": "其父不解，盡問耆年，皆不能說。",
        "translation": "The father did not understand and asked all the elderly monks, but they could not answer.",
        "source": "T03n0184_002:0469c17_21"
    },
    {
        "source_sentence": "天帝復下化作梵志，為女解夢言：『汝見天下水中生一花者，是白淨王太子初生時；",
        "translation": "Again, the lord of gods appeared and transformed himself into a brahmin. He said to the queen, “If you see a flower growing in the water under heaven, this is the first birth of Prince Śubhavyūha.” The queen told her:",
        "source": "T03n0184_002:0469c18_22"
    },
    {
        "source_sentence": "今在樹下六年，身羸形瘦，是花萎時；",
        "translation": "Now he has been under the tree for six years. His body is weak and his form is thin. This is the season when the flowers wither.",
        "source": "T03n0184_002:0469c20_23"
    },
    {
        "source_sentence": "見一人水灑更生者，是能獻食者；",
        "translation": "To see one person sprinkling water on the living beings is to be able to offer food.",
        "source": "T03n0184_002:0469c20_24"
    },
    {
        "source_sentence": "小花萠芽欲出者，是五道生死人也。』",
        "translation": "A small flower whose buds are about to sprout is a person in the five destinies of birth-and-death.'",
        "source": "T03n0184_002:0469c21_25"
    },
    {
        "source_sentence": "「『六年不傾猗，　　亦不念飢寒，",
        "translation": "'For six years, he doesn't incline and doesn't think of hunger and cold.",
        "source": "T03n0184_002:0469c22_26"
    },
    {
        "source_sentence": "　　精進無所著，　　形瘦骨皮連。",
        "translation": "Their vigor has no attachment, And their form is thin and skeletonlike.",
        "source": "T03n0184_002:0469c22_26"
    },
    {
        "source_sentence": "　　汝等修敬意，　　奉獻於菩薩，",
        "translation": "You should cultivate reverence and offer it to the bodhisattva.",
        "source": "T03n0184_002:0469c22_26"
    },
    {
        "source_sentence": "　　現世獲大福，　　後世受果報。』",
        "translation": "They'll attain great merit in the present life and receive its fruit in a later life.'",
        "source": "T03n0184_002:0469c22_26"
    },
    {
        "source_sentence": "時天帝釋，即說偈言：「女言：『獻食者其法云何？』",
        "translation": "Śakra Devānām-Indra then spoke a verse, saying, What's the teaching of the woman who says, 'What's the way to offer food?'",
        "source": "T03n0184_002:0469c22_26"
    },
    {
        "source_sentence": "梵志答言：『當取五百牛乳，展轉相飲至于一牛，[愨-心+牛]一牛湩持用作糜，",
        "translation": "The brahmin answered, 'You must take the milk of five hundred cows and drink it one after another until you reach a cow.",
        "source": "T03n0184_002:0469c28_27"
    },
    {
        "source_sentence": "乳糜涌沸，出高七仞，左上右下，右上左下，斟糜入鉢，釜杓不污。』",
        "translation": "The milk gruel wells up and boils, rising seven feet in height from the left top to the right bottom, the right top to the left bottom, and pouring the gruel into the bowl so that the pot and ladle won't defile it.'",
        "source": "T03n0184_002:0470a01_28"
    },
    {
        "source_sentence": "二女恭肅，奉獻菩薩。",
        "translation": "The two daughters were reverent and offered them to the Bodhisattva.",
        "source": "T03n0184_002:0470a02_29"
    },
    {
        "source_sentence": "菩薩意念，欲先沐浴然後受糜，行詣流水側，洗浴身形。",
        "translation": "The bodhisattva thought to himself, wanting to first bathe and then accept the gruel, went to the side of the flowing water and washed his body and form.",
        "source": "T03n0184_002:0470a03_30"
    },
    {
        "source_sentence": "浴訖欲出水，天神按樹枝，二女奉乳糜。",
        "translation": "When the water was about to come out from the bath, the goddess pressed a branch of the tree and two women offered milk gruel.",
        "source": "T03n0184_002:0470a04_31"
    },
    {
        "source_sentence": "得色氣力充，呪願福無量，令女歸三尊。",
        "translation": "She attained the power of physical form and energy, vowed immeasurable merits, and caused the woman to return to the three honored ones.",
        "source": "T03n0184_002:0470a05_32"
    },
    {
        "source_sentence": "食畢洗手漱口，澡鉢已還擲水中，逆流未至七里，天化作金翅鳥飛來捧鉢去，",
        "translation": "After he had eaten the food, he washed his hands and rinsed his mouth. Having bathed his almsbowl, he tossed it back into the water but did not go downstream for seven li. A magical bird with golden wings came flying in and went away holding his almsbowl.",
        "source": "T03n0184_002:0470a06_33"
    },
    {
        "source_sentence": "并髮一處，供養起塔。",
        "translation": "They also built a stūpa in one place to make offerings.",
        "source": "T03n0184_002:0470a08_34"
    },
    {
        "source_sentence": "即復前行，當渡尼連禪河。",
        "translation": "He then proceeded again and crossed the Nairañjanā River.",
        "source": "T03n0184_002:0470a08_35"
    },
    {
        "source_sentence": "「『渡水尼連禪，　　慈愍一切人，",
        "translation": "'The crossing of the water at Nairañjāna meditation, kind and compassionate to all people,",
        "source": "T03n0184_002:0470a09_36"
    },
    {
        "source_sentence": "　　五道三毒垢，　　使除如水淨。",
        "translation": "The five destinies and three poisonous defilements are purified by removing them like water.",
        "source": "T03n0184_002:0470a09_36"
    },
    {
        "source_sentence": "　　菩薩興是念，　　一切癡墮冥，",
        "translation": "Enlightening beings give rise to this thought: All delusion falls into the darkness.",
        "source": "T03n0184_002:0470a09_36"
    },
    {
        "source_sentence": "　　當持八直水，　　洗除三毒垢。",
        "translation": "You should hold the eightfold water and wash away the three poisonous stains.",
        "source": "T03n0184_002:0470a09_36"
    },
    {
        "source_sentence": "　　是時始上岸，　　青雀有五百，",
        "translation": "At that time there were five hundred bluebirds on the shore.",
        "source": "T03n0184_002:0470a09_36"
    },
    {
        "source_sentence": "　　飛來繞菩薩，　　三匝悲鳴去。』",
        "translation": "The flying bodhisattva circumambulates him three times and cries out in pity.'",
        "source": "T03n0184_002:0470a09_36"
    },
    {
        "source_sentence": "是時菩薩，便說偈言：「於是復前行，當過瞽龍池時，龍大歡喜，踊出見菩薩，",
        "translation": "The bodhisattva then spoke these verses: “Then he proceeded on his way. When he passed by the dragon Anavatapta’s pond, the dragon was greatly delighted and came out to see the Bodhisattva.",
        "source": "T03n0184_002:0470a09_36"
    },
    {
        "source_sentence": "「『善哉見悉達，　　來救何以晚，",
        "translation": "'Splendid, Siddhārtha! How late is it for you to come and rescue me?",
        "source": "T03n0184_002:0470a17_37"
    },
    {
        "source_sentence": "　　本請一切眾，　　無上甘露漿。",
        "translation": "All the assemblies were originally invited for the supreme ambrosia of immortality.",
        "source": "T03n0184_002:0470a17_37"
    },
    {
        "source_sentence": "　　行步地震動，　　眾樂自然鳴，",
        "translation": "Each step is shaken by an earthquake, And all the music spontaneously sounds.",
        "source": "T03n0184_002:0470a17_37"
    },
    {
        "source_sentence": "　　正與過佛等，　　於我無有疑。",
        "translation": "They're precisely the same as the faults of buddhas and so forth, and there's no doubt about self.",
        "source": "T03n0184_002:0470a17_37"
    },
    {
        "source_sentence": "　　今持無上慧，　　降伏諸魔怨，",
        "translation": "Now he preserves the highest wisdom to subdue the Māra's enemies.",
        "source": "T03n0184_002:0470a17_37"
    },
    {
        "source_sentence": "　　今當佛日照，　　覺諸群生眠。』",
        "translation": "Now, when the Buddha shines brightly in the sun, he awakens the sentient beings to sleep.'",
        "source": "T03n0184_002:0470a17_37"
    },
    {
        "source_sentence": "便說偈言：「於是復前行，望見叢林山，其地平正，四望清淨，生草柔軟，",
        "translation": "He said in verse, “Then he proceeded on his way and looked out to see the jungle mountains. The ground was even and peaceful; the four sides of the road were clear and clean; there grew luxuriant weeds growing along the path.",
        "source": "T03n0184_002:0470a17_37"
    },
    {
        "source_sentence": "甘泉盈流，花香茂潔，中有一樹，高雅奇特，枝枝相次，葉葉相加，花色蓊欝，",
        "translation": "The sweet fountain filled the stream, and the flowers were fragrant and luxuriant. There was a tree in the middle of it, lofty and wonderfully tall, with branches growing one after another; leaves added together to give off a variegated flowery color.",
        "source": "T03n0184_002:0470a25_38"
    },
    {
        "source_sentence": "如天莊飾，天幡在樹頂，是則為元吉，眾樹林中王。",
        "translation": "It's like the heavenly adornment, with a heavenly banner at the top of a tree, which is the original fortune and the king among the many trees in the forest.",
        "source": "T03n0184_002:0470a27_39"
    },
    {
        "source_sentence": "於是小前行，見一刈草人，菩薩便問曰：『今汝名何等？』",
        "translation": "When he saw a mower in front of him, the bodhisattva asked, 'What's your name now?'",
        "source": "T03n0184_002:0470a28_40"
    },
    {
        "source_sentence": "『我名為吉祥，今刈吉祥草。』",
        "translation": "'My name is Auspicious, and now I'm mowing the auspicious grass.'",
        "source": "T03n0184_002:0470a29_41"
    },
    {
        "source_sentence": "『今汝施我草，十方皆吉祥。』",
        "translation": "'Now, give me my grass, for it's auspicious in all ten directions.'",
        "source": "T03n0184_002:0470b01_42"
    },
    {
        "source_sentence": "「『以棄聖王位，　　七寶玉女妻，",
        "translation": "'In order to abandon the throne of the sage king, he renounces the seven-jeweled jade woman's wife.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　　金銀之床榻，　　氍氀錦繡褥。",
        "translation": "The golden and silver beds and couches are draped with brocaded, embroidered mattresses.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　　吉祥哀樂聲，　　八部真音響，",
        "translation": "Auspicious is the sound of sorrow and joy, The voice of the eightfold truth.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　　超越過梵天，　　今用芻草為？』",
        "translation": "It's beyond the Brahma gods, so why do you use it now for a monk's grass?'",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "「『發願阿僧祇，　　欲度五道人，",
        "translation": "'After an incalculable number of vows have been made, I want to save the people of the five destinies.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　　今往滿本願，　　是故欲得草。』",
        "translation": "Now that I've fulfilled my original vow, I want to obtain the grass.'",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "「人與把亂草，　　便持向樹王：",
        "translation": "“Then the man and his men took the disturbed grass And carried it to the king of trees, saying:",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "『世間意皆亂，　　我當正其志。』",
        "translation": "'The minds of the world are all disturbed, and I will correct their intentions.'",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "「即持草灑地，　　齊正如所言，",
        "translation": "He then held the grass and sprinkled it on the ground, just as he had said.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　菩薩便坐上，　　一切蒙其恩。",
        "translation": "The bodhisattva then sat there, and everyone was blessed by his kindness.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　菩薩作三要：　　『心坐及其樹，",
        "translation": "The bodhisattva composed three essentials:",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　若我不得道，　　終不離三誓。",
        "translation": "If I don't attain the path, I'll never part with the three vows.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　言我肌骨枯，　　不動會當成，",
        "translation": "If you say my flesh and bones are withered, it will be formed in the unmoving assembly.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "　過佛得道時，　　皆悉出一心。』",
        "translation": "Whenever a buddha attains the path, they all emerge with one mind.'",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "時人吉祥即說偈言：「菩薩以偈答言：「於是菩薩，安坐入定，棄苦樂意，",
        "translation": "The man Auspicious then spoke these verses: The Bodhisattva answered in verse, saying: Thereupon, the bodhisattva sat quietly in meditation and forgot all his thoughts of pain and pleasure.",
        "source": "T03n0184_002:0470b01_43"
    },
    {
        "source_sentence": "無憂喜想，心不依善，亦不附惡，正在其中，如人沐浴淨潔覆以白褻，",
        "translation": "They have no thoughts of sorrow or joy. Their minds do not rely on what is wholesome, nor are they attached to what is evil. They dwell therein like people bathing in the water and covering themselves with white cloth.",
        "source": "T03n0184_002:0470b18_44"
    },
    {
        "source_sentence": "中外俱淨，表裏無垢，喘息自滅，寂然無變，成四禪行。",
        "translation": "The fourth absorption is accomplished by calming and exhaling oneself without panting or breathing. Being still and unchanging, he enters the state of neither meditation nor nonconcentration.",
        "source": "T03n0184_002:0470b20_45"
    },
    {
        "source_sentence": "以得定意，不捨大悲，智慧方便，究暢要妙，通三十七道品之行。",
        "translation": "By attaining concentration, he doesn't abandon great compassion, wisdom and skillful means, investigates essentials and subtleties, and practices the thirty-seven factors of the path.",
        "source": "T03n0184_002:0470b21_46"
    },
    {
        "source_sentence": "何謂三十七品？",
        "translation": "What are the thirty-seven chapters?",
        "source": "T03n0184_002:0470b23_47"
    },
    {
        "source_sentence": "一為四意止，二為四意斷，三為四神足，四為五根，五為五力，六為七覺意，",
        "translation": "The first is the cessation of thought by means of four [factors], the second is the elimination by means of four [factors], the third is the power of the four supernormal powers, the fourth is the faculty of the five faculties, the fifth is the faculty of the five powers, and the sixth is the intellect of the",
        "source": "T03n0184_002:0470b23_48"
    },
    {
        "source_sentence": "七為八直行。",
        "translation": "The seventh is the eighth straightforward practice.",
        "source": "T03n0184_002:0470b25_49"
    },
    {
        "source_sentence": "周而復始，苦空非常，無想無願。",
        "translation": "Suffering and emptiness are impermanent, without ideation or wish.",
        "source": "T03n0184_002:0470b25_50"
    },
    {
        "source_sentence": "『我念世間，貪愛嗜欲，墮生死苦，少能自覺本從十二因緣起。",
        "translation": "'I'm mindful of the world, which is addicted to craving and desire, falls into the suffering of birth-and-death, and can rarely perceive for itself that it originally arose from twelve causes and conditions.",
        "source": "T03n0184_002:0470b26_51"
    },
    {
        "source_sentence": "何等為十二本？",
        "translation": "What are these twelve texts?",
        "source": "T03n0184_002:0470b27_52"
    },
    {
        "source_sentence": "從癡行便有識，緣識行便有名字，從名字行便有六入，緣六入行便有更樂，",
        "translation": "Consciousness comes from the mental action of delusion, and names come from the mental action of consciousness. The six sense-fields come from the mental action of names.",
        "source": "T03n0184_002:0470b28_53"
    },
    {
        "source_sentence": "緣更樂行便有痛，緣痛行便有愛，緣愛行便有受，緣受行便有有，緣有行便有生，",
        "translation": "Conditioned by contact, there is pain; conditioned by pain, there is desire; conditioned by desire, there is sensation; conditioned by sensation, there is volition; conditioned by volition, there is birth; conditioned by volition, there is birth.",
        "source": "T03n0184_002:0470b29_54"
    },
    {
        "source_sentence": "緣生行便有老死憂悲苦痛心惱大患，具有精神，從是轉墮生死。",
        "translation": "Conditioned by birth and volition, there's old age, grief, sorrow, pain, and great distress, and with spirit, they fall into birth-and-death from this.",
        "source": "T03n0184_002:0470c02_55"
    },
    {
        "source_sentence": "欲得道者，當斷貪愛，滅除情欲，無為無起，然則癡滅。",
        "translation": "Those who want to attain the path will stop craving and extinguish emotions and desires, which are unconditioned and unarisen, but then their delusion will cease.",
        "source": "T03n0184_002:0470c04_56"
    },
    {
        "source_sentence": "癡滅則行滅，行滅則識滅，識滅則名字滅，名字滅則六入滅，六入滅則更樂滅，",
        "translation": "When delusion ceases, volition ceases; when volition ceases, consciousness ceases. When consciousness ceases, names cease. When names cease, the six sense operations cease. When the six sense operations cease, contact ceases.",
        "source": "T03n0184_002:0470c05_57"
    },
    {
        "source_sentence": "更樂滅則痛滅，痛滅則愛滅，愛滅則受滅，受滅則有滅，有滅則生滅，",
        "translation": "When there is cessation of contact and pleasure, there is cessation of pain; when there is cessation of pain, there is cessation of craving; when there is cessation of craving, there is cessation of feeling; when there is cessation of feeling, there is cessation of existence; when there is cessation, there is cessation",
        "source": "T03n0184_002:0470c07_58"
    },
    {
        "source_sentence": "生滅則老死憂悲苦痛心惱大患皆盡，是謂得道。』",
        "translation": "When it arises and ceases, the great afflictions of old age, sorrow, pain, pain, and mental distress are all ended, which is called attaining the path.'",
        "source": "T03n0184_002:0470c09_59"
    },
    {
        "source_sentence": "「菩薩心自念言：『今當降魔官屬。』",
        "translation": "The bodhisattva thought to himself, 'Now, I will subdue the officials of Māra.'",
        "source": "T03n0184_002:0470c11_0"
    },
    {
        "source_sentence": "即放眉間毫相光明，感動魔宮。",
        "translation": "He then radiated a ray of light from the tuft of hair between his eyebrows, touching the demon's palace.",
        "source": "T03n0184_002:0470c11_1"
    },
    {
        "source_sentence": "魔大惶怖，心中不寧，觀見菩薩，已在樹下，清淨無欲，精思不懈，心中煩毒，",
        "translation": "Greatly frightened, his mind uneasy, Māra observed that the enlightening being was already at the foot of a tree. He was pure and dispassionate; his energy was not lazy, and his mind was filled with vexation.",
        "source": "T03n0184_002:0470c12_2"
    },
    {
        "source_sentence": "飲食不甘，伎樂不御，念是道成，必大勝我，欲及其未作佛，壞其道意。",
        "translation": "Their food and drink aren't delicious, and their music and tricks aren't controlled; if they think this path is accomplished, they'll surely become a great victory over me, wanting to destroy their intention for the path and those who haven't yet become buddhas.",
        "source": "T03n0184_002:0470c14_3"
    },
    {
        "source_sentence": "魔子須摩提(漢言賢意)前諫父曰：『菩薩行淨，三界無比，以得自然神通，",
        "translation": "The Māra-son Sumati (known as Xianyi in Chinese) remonstrated with his father, saying, “The practice of enlightening beings is pure and incomparable in the three realms.",
        "source": "T03n0184_002:0470c15_4"
    },
    {
        "source_sentence": "眾梵諸天億百皆往禮侍，此非天人所當沮壞，無為興惡自毀其福。』",
        "translation": "The gods, Brahmās, and goddesses hundreds of millions of gods all went to serve him, but this isn't the place where gods and humans will be discouraged or destroyed, and nothing will cause them to do evil and disparage their own merits.'",
        "source": "T03n0184_002:0470c17_5"
    },
    {
        "source_sentence": "魔王不聽，三女自占，一名恩愛，二名常樂，三名大樂：『父王莫憂，",
        "translation": "The king of Māra won’t listen, and the three daughters deceive each other. One is called affectionate, two are always happy, and three are greatly happy:",
        "source": "T03n0184_002:0470c18_6"
    },
    {
        "source_sentence": "吾等自往壞菩薩道意，不足勞父王，勿復憂念。』",
        "translation": "We've destroyed the bodhisattva's intention for the path since we went there, so don't trouble our father or king, and don't worry again.'",
        "source": "T03n0184_002:0470c20_7"
    },
    {
        "source_sentence": "「於是三女，嚴莊天服，從五百玉女，到菩薩所，彈琴歌頌，婬欲之辭欲亂道意。",
        "translation": "“Then the three women, adorned with celestial garments and dressed in five hundred heavenly maidens, came to the bodhisattva’s presence. They played lute and sang hymns of praise, saying that they desired sexual union but wished to disturb his thoughts of enlightenment.",
        "source": "T03n0184_002:0470c21_8"
    },
    {
        "source_sentence": "三女復言：『仁德至重，諸天所敬，應有供養，故天獻我。",
        "translation": "The three women then said, 'Your kindness and virtue are so great that the gods should honor them with offerings; therefore, the gods offered me to them.",
        "source": "T03n0184_002:0470c23_9"
    },
    {
        "source_sentence": "我等好潔，年在盛時，願得晨起夜寐供侍左右。』",
        "translation": "We're good and clean, so when the year is in full bloom, may we get up in the morning and sleep at night to serve our aides.'",
        "source": "T03n0184_002:0470c24_10"
    },
    {
        "source_sentence": "菩薩答言：『汝宿有福，受得天身，不惟無常，而作妖媚，形體雖好，",
        "translation": "The bodhisattva replied, 'Your constellations are blessed, and you've received a heavenly body. You don't think it's impermanent but create seductive charms that appear to be beautiful in appearance.",
        "source": "T03n0184_002:0470c25_11"
    },
    {
        "source_sentence": "而心不端。",
        "translation": "The mind isn't straightforward.",
        "source": "T03n0184_002:0470c27_12"
    },
    {
        "source_sentence": "譬如畫瓶中盛臭毒，將以自壞。",
        "translation": "It's like a painted vase filled with bad odor and poison that's about to break down on its own.",
        "source": "T03n0184_002:0470c27_13"
    },
    {
        "source_sentence": "有何等奇，福難久居，婬惡不善，自亡其本，福盡罪至，墮三惡道，受六畜形，",
        "translation": "What wonder is there about the difficulty of accumulating virtue for a long time? When evil and unwholesome deeds are committed, one destroys the root cause by himself. At the end of his good deeds, he will fall into the three evil destinies and be reborn in the six forms of an animal.",
        "source": "T03n0184_002:0470c28_14"
    },
    {
        "source_sentence": "欲脫致難。",
        "translation": "They want to be freed and cause difficulties.",
        "source": "T03n0184_002:0471a01_0"
    },
    {
        "source_sentence": "汝輩亂人道意，不計非常，經歷劫數，展轉五道。",
        "translation": "You people disturb the minds of the Way and do not think it is impermanent. For many kalpas you have passed through the five realms of rebirth.",
        "source": "T03n0184_002:0471a01_1"
    },
    {
        "source_sentence": "今汝曹等，未離勤苦。",
        "translation": "Now, you people haven't yet parted with the pain and suffering of diligence.",
        "source": "T03n0184_002:0471a02_2"
    },
    {
        "source_sentence": "吾在世間，處處所生，觀視老者如母，中者如姊，小者如妹，諸姊等各各還宮，",
        "translation": "I am in the world. Wherever I may be born, I look upon old people as if they are my mothers, those in the middle [world] as if they were my sisters, and those younger [world] as if they were my sisters. Each of them returns to her own palace.",
        "source": "T03n0184_002:0471a02_3"
    },
    {
        "source_sentence": "勿復作是曹事。』",
        "translation": "Don't do such a thing again.'",
        "source": "T03n0184_002:0471a04_4"
    },
    {
        "source_sentence": "菩薩一言，便成老母，頭白齒落，眼冥脊傴，柱杖相扶而還。",
        "translation": "As soon as the Bodhisattva had uttered these words he became an old woman, with white hair on her head and white teeth protruding out of her mouth. Her eyes were blindfolded by darkness; she was cuddled up in a crooked posture, supported by both pillars and canes.",
        "source": "T03n0184_002:0471a05_5"
    },
    {
        "source_sentence": "「魔見三女還皆成老母，益大忿怒，更召鬼神王，合得十八億，皆從天來下，",
        "translation": "“When Māra saw that the three daughters had all returned to become old mothers, he became even more furious and summoned the king of ghosts and spirits. Altogether they obtained one hundred and eighty million [hermaphrodites], all descending from heaven.",
        "source": "T03n0184_002:0471a06_6"
    },
    {
        "source_sentence": "圍繞菩薩，三十六由旬，皆使變成師子、熊羆、兕虎、象、龍、牛、馬、犬、豕、猴猿之形，",
        "translation": "They surrounded the bodhisattvas, thirty-six yojanas in circumference, and caused them all to take the forms of lions, bears, tigers, elephants, dragons, dragons, cows, horses, dogs, mules, and monkeys.",
        "source": "T03n0184_002:0471a08_7"
    },
    {
        "source_sentence": "不可稱言。",
        "translation": "It can't be called that.",
        "source": "T03n0184_002:0471a09_8"
    },
    {
        "source_sentence": "蟲頭人軀蚖虵之身黿龜之首，而有六目，或一頸而多頭，齒牙爪距，擔山吐火，",
        "translation": "The heads of these animals are like the heads of a tortoise or a turtle, with six eyes. Some have one neck but many heads; their teeth, teeth, tusks, and nails are separated from each other. They carry mountains and spit out fire.",
        "source": "T03n0184_002:0471a10_9"
    },
    {
        "source_sentence": "雷電四繞，擭持戟鉾。",
        "translation": "Thunder and lightning surrounded them in all directions, and the enemy was carrying a halberd and spear.",
        "source": "T03n0184_002:0471a12_0"
    },
    {
        "source_sentence": "菩薩慈心，不驚不怖一毛不動，光顏益好，鬼兵不能得近。",
        "translation": "The bodhisattva's compassionate mind isn't frightened or terrified by a hair that doesn't move, and his radiant appearance grows more beautiful, so ghosts and armies can't get close to him.",
        "source": "T03n0184_002:0471a12_1"
    },
    {
        "source_sentence": "「『比丘何求坐樹下，　　樂於林藪毒獸間，",
        "translation": "'Why would a monk seek to sit under a tree and enjoy the pleasures of a forest or among poisonous animals?",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　雲起可畏窈冥冥，　　天魔圍繞不以驚。』",
        "translation": "Fearsome clouds arise in the darkness, and gods and Māra don't frighten them.'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『古有真道佛所行，　　恬惔為上除不祥，",
        "translation": "'In the past, there were buddhas of true enlightenment who practiced quietude as the best way to remove inauspiciousness.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　其成最勝法滿藏，　　吾求斯座決魔王。』",
        "translation": "They've accomplished the most excellent teaching that completes the store, and I'm seeking this seat to resolve the demon king of Māra.'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『汝當作王轉金輪，　　七寶自至典四方，",
        "translation": "'You will be the king who turns the golden wheel, and you will have seven treasures at your command in the four directions.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　所受五欲最無比，　　斯處無道起入宮。』",
        "translation": "The five desires that are received are most incomparable, and there's no path here to enter the palace.'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『吾覩欲盛吞火銅，　　棄國如唾無所貪，",
        "translation": "'My lustful desire is to swallow the copper of a fire, and I abandon my country like a spittle without craving it.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　得王亦有老死憂，　　去此無利勿妄談。』",
        "translation": "The king who obtains it also has the grief of old age and death, so don't talk falsely about it.'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『何安坐林如大語，　　委國財位守空閑，",
        "translation": "'Why is it that you're sitting in a forest like the great saying, entrusting your national wealth and position to keep an open space?",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　不見我興四部兵，　　象馬步兵十八億？』",
        "translation": "Don't you see me raising four armies of elephants, horses, and foot soldiers of  1.8 billion?'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『已見猴猿師子面，　　虎兕毒虵豕鬼形，",
        "translation": "'I've seen the face of a monkey, a lion, a tiger, a viper, and a poisonous ghost.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　皆持刀劍擭戈鉾，　　超躍哮吼滿空中。",
        "translation": "They all carry swords, swords, arrows, spears, and spears, leaping and roaring in the sky.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　設復億姟神武備，　　為魔如汝來會此，",
        "translation": "Even if there are billions of myriadstical weapons, Come and assemble here for the sake of Māra like you.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　矢刃火攻如風雨，　　不先得佛終不起。",
        "translation": "An arrow and a blade of fire attack like wind and rain, without first attaining the Buddha, it never rises up.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　魔有本願令我退，　　吾亦自誓不空還，",
        "translation": "The devil has the original vow to cause me to retreat, And I also vow not to return in vain.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　今汝福地何如佛？　　於是可知誰得勝。』",
        "translation": "How could your blessed ground now be like that of a buddha?’ So you may know who will be victorious.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『吾曾終身快布施，　　故典六天為魔王，",
        "translation": "'I once spent my whole life quickly giving alms, and the six heavenly kings of old were Māra King.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　比丘知我宿福行，　　自稱無量誰為證？』",
        "translation": "A monk knows the merits of my past actions, and who will realize them if he calls himself immeasurable?'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『昔吾行願從錠光，　　受拜為佛釋迦文，",
        "translation": "'In the past, I practiced and vowed to follow Dīpaṅkara, accepting homage as the Buddha and Śākyamuni,",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　怒畏想盡故坐斯，　　意定必解壞汝軍。",
        "translation": "Because you're sitting here because your thoughts of anger and fear have ended, your mind will surely be liberated and destroyed by your army.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　我所奉事諸佛多，　　財寶衣食常施人，",
        "translation": "I serve many buddhas, Always giving wealth, jewels, food, and clothing to those who need them.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　仁戒積德厚於地，　　是以脫想無患難。』",
        "translation": "The virtue of the accumulation of kindness and morality is thicker than the earth, so it's because there's no difficulty in freeing yourself from conception.'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「菩薩即以智慧力，　　申手按地是知我，",
        "translation": "The bodhisattva then, by the power of wisdom, extended his hand and pressed it to the ground to know that this was me.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　應時普地軯大動，　　魔與官屬顛倒墮。",
        "translation": "At the time, the whole earth shook with great trembling, and Māra and his officials fell down in error.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　魔王敗績悵失利，　　惛迷却踞前畫地，",
        "translation": "The king of Māra was defeated and disheartened, withdrew to sit on the painted ground in front of him.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　其子又曉心乃寤，　　即時自歸前悔過：",
        "translation": "The boy again awakened, and his mind was disturbed. He immediately returned to where he had been and repented:",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「『吾以不復用兵器，　　等行慈心却魔怨，",
        "translation": "'By not using weapons again, I'll equally practice compassion and rid Māra of his enemies.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　世用兵器動人心，　　而我以汝等眾生。",
        "translation": "The world uses weapons to move the minds of sentient beings, And I give them to you sentient beings.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　若調象馬雖已調，　　然後故態會復生，",
        "translation": "If they tame elephants and horses, even if they have tamed them, Then the old form will arise again.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　　若得最調如佛性，　　已如佛調無不仁。』",
        "translation": "If he attains the supreme discipline like the buddha-nature, then there's nothing unworthy of being disciplined like the Buddha.'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "「垓天見佛擒魔眾，　　忍調無想怨自降，",
        "translation": "Hundreds of thousands of myriadstical celestial beings saw the Buddha capture the hosts of Māra, enduring and subduing their enemies without ideation.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　諸天歡喜奉華臻：　　『非法王壞法王勝。",
        "translation": "The gods rejoiced and offered flowers to him, saying, 'The illegitimate king who destroys the king of the Dharma is superior.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　本從等意智慧力，　　慧能即時禳不祥，",
        "translation": "Based on the power of wisdom based on equal intent, Wisdom can instantly destroy bad omens.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　能使怨家為弟子，　　當禮四等道之證。",
        "translation": "Those who can cause their enemies to become disciples should venerate the realization of the four equal paths.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　面如滿月色從容，　　名聞十方德如山，",
        "translation": "His countenance is like the full moon, his color follows his features; Fame and reputation in the ten directions are like mountains of virtue.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "　求佛像貌難得比，　　當稽首斯度世仙。』",
        "translation": "Seeking the Buddha's appearance is difficult to compare, so you should bow your head in homage to save the worldly sage.'",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "魔王便前說偈問言——菩薩慈心，所問盡答——曰：「菩薩累劫清淨之行，",
        "translation": "The king of Māra then went on to ask a question in verse, saying-the bodhisattva's compassionate mind answered all the questions he asked-saying, A bodhisattva who practices purely for eons like this will not be able to attain enlightenment.",
        "source": "T03n0184_002:0471a13_2"
    },
    {
        "source_sentence": "至儒大慈，道定自然，忍力降魔，鬼兵退散，定意如故，不以智慮，無憂喜想，",
        "translation": "With great compassion and great benevolence, he was naturally concentrated on the path of enlightenment; his patience subdued Māra. The spirits and armies withdrew in dispersal but his concentration remained as before. He did not think thoughts of sorrow or joy without thinking of it as wisdom.",
        "source": "T03n0184_002:0471b22_3"
    },
    {
        "source_sentence": "是日夜半後，得三術闍(三術闍者漢言三神滿具足)，漏盡結解，自知本昔久所習行，",
        "translation": "At midnight on that day, he attained the three skillful means of ācārya (Sanskrit: “complete with the three supernormal powers”). Knowing his past practice for a long time, he renounced the defilements and entered nirvana.",
        "source": "T03n0184_002:0471b24_4"
    },
    {
        "source_sentence": "四神足念，精進定、欲定、意定、戒定，得變化法，所欲如意，不復用思；",
        "translation": "The fourth is the supernormal power of mental command, which consists of concentrated effort, concentrated desire, concentrated thought, and concentrated absorption. Having attained this power of magical transformation, he does as he wishes without further thought.",
        "source": "T03n0184_002:0471b25_5"
    },
    {
        "source_sentence": "身能飛行；",
        "translation": "Their bodies can fly.",
        "source": "T03n0184_002:0471b27_6"
    },
    {
        "source_sentence": "能分一身，作百作千至億萬無數，復合為一；",
        "translation": "They can be divided into one body, made into a hundred forms and counted from a thousand to a hundred million.",
        "source": "T03n0184_002:0471b27_7"
    },
    {
        "source_sentence": "能徹入地，石壁皆過，從一方現，俯沒仰出，譬如水波；",
        "translation": "They can penetrate into the ground and pass through all the stone walls. Appearing from one side, they sink down and emerge upward like waves of water.",
        "source": "T03n0184_002:0471b28_8"
    },
    {
        "source_sentence": "能身中出水火；",
        "translation": "They are able to produce water and fire from their bodies.",
        "source": "T03n0184_002:0471b29_9"
    },
    {
        "source_sentence": "能履水行虛，身不陷墜；",
        "translation": "They can walk on water and travel in space, yet their bodies do not fall.",
        "source": "T03n0184_002:0471c01_10"
    },
    {
        "source_sentence": "坐臥空中，如飛鳥翔；",
        "translation": "Sitting or lying in the air, he is like a flying bird.",
        "source": "T03n0184_002:0471c01_11"
    },
    {
        "source_sentence": "立能及天，手捫日月，欲身平立，至梵自在；",
        "translation": "The gods of the realm of desire stand upright, reaching as far as Brahmā’s freedom.",
        "source": "T03n0184_002:0471c02_12"
    },
    {
        "source_sentence": "眼徹視，耳洞聽，意預知，諸天人龍鬼神蚑行蠕動之類，身行口言心所念，",
        "translation": "Their eyes looked in all directions, and their ears heard what they saw. They foresaw the thoughts of gods, humans, nāgas, ghosts, yakṣas, and wrigglers, as well as bodily, verbal, and mental actions.",
        "source": "T03n0184_002:0471c03_13"
    },
    {
        "source_sentence": "悉見聞知。",
        "translation": "They all see, hear, and know.",
        "source": "T03n0184_002:0471c05_14"
    },
    {
        "source_sentence": "諸有貪婬無貪婬者，有瞋怒無瞋怒者，有愚癡無愚癡者，有愛欲無愛欲者，",
        "translation": "Those with craving and those without craving, those with anger and those without anger, those with folly and those without folly, and those with desire and those without desire.",
        "source": "T03n0184_002:0471c05_15"
    },
    {
        "source_sentence": "有大志行無大志行者，有內外行無內外行者，有念善不念善者，有一心無一心者，",
        "translation": "Those who practice with great determination but do not practice with great determination, those who practice both inside and without and those who practice neither inside nor outside, those who are mindful of what’s good but not mindful of what’s good, and those with one mind but not those without one mind.",
        "source": "T03n0184_002:0471c07_16"
    },
    {
        "source_sentence": "有解脫意無解脫意者，一切悉知。",
        "translation": "He knows all those who have the intention to be liberated and those who don't have the intention to be liberated.",
        "source": "T03n0184_002:0471c09_17"
    },
    {
        "source_sentence": "「菩薩觀天上、人中、地獄、畜生、鬼神五道，先世父母、兄弟、妻子中外姓字，",
        "translation": "“Enlightening beings observe the heavens, humans, hells, animals, and ghosts in the five realms of rebirth:",
        "source": "T03n0184_002:0471c09_18"
    },
    {
        "source_sentence": "一一分別，一世十世，百千億万無數世事，至于天地一劫崩壞空荒之時，",
        "translation": "In each of these divisions, there are one world and ten worlds, hundreds of thousands of myriads of koṭis of incalculable worldly affairs, up to the time when heaven and earth crumbled into emptiness in an eon.",
        "source": "T03n0184_002:0471c11_19"
    },
    {
        "source_sentence": "一劫始成，人物初興，能知十劫百劫至千萬億無數劫中，內外姓字，衣食苦樂，",
        "translation": "In the course of ten kalpas, from a hundred kalpas up to thousands of myriads of koṭis of incalculable kalpas, they can know the names of the gods and goddesses, their internal and external bodies, as well as the painful and pleasurable conditions of food and drink.",
        "source": "T03n0184_002:0471c13_20"
    },
    {
        "source_sentence": "壽命長短，死此生彼，展轉所趣，從上頭始，諸所更身，生長老終，形色好醜，",
        "translation": "Their life spans are long and short; they die here and are born there. They go from one place to another in succession, beginning at the top of their heads.",
        "source": "T03n0184_002:0471c15_21"
    },
    {
        "source_sentence": "賢愚苦樂，一切三界，皆分別知。",
        "translation": "Good and bad, painful and pleasant, all three realms, are discriminated and known.",
        "source": "T03n0184_002:0471c16_22"
    },
    {
        "source_sentence": "見人魂神，各自隨行，生五道中，或墮地獄，或墮畜生，或作鬼神，或生天上，",
        "translation": "They see human spirits and goddesses, each following their lead, born in the five destinies, sometimes falling into hell, sometimes into animals, sometimes into ghosthood, sometimes being reborn in heaven.",
        "source": "T03n0184_002:0471c17_23"
    },
    {
        "source_sentence": "或入人形，有生豪貴富樂家者，有生卑鄙貧賤家者。",
        "translation": "Some may enter the human form, and some will be born in a house of noble wealth and happiness, and some will be born in a house of lowliness and poverty.",
        "source": "T03n0184_002:0471c19_24"
    },
    {
        "source_sentence": "知眾生或五陰自弊，一色像，二痛痒，三思想，四行作，五魂識，皆習五欲，",
        "translation": "They know whether sentient beings may have five aggregates that are naturally bad, which are one form or formless, two pain and itch, three thoughts, four volitions, and five souls and consciousnesses, all conditioned by the five desires.",
        "source": "T03n0184_002:0471c20_25"
    },
    {
        "source_sentence": "眼貪色，耳貪聲，鼻貪香，舌貪味，身貪細滑，牽於愛欲，或於財色思望安樂，",
        "translation": "The eye desires form, the ear desires sound, the nose desires smell, the tongue desires taste, and the body desires fineness and smoothness, which lead to craving or contemplation of wealth and form for peace and happiness.",
        "source": "T03n0184_002:0471c22_26"
    },
    {
        "source_sentence": "從是生諸惡本，從惡致苦。",
        "translation": "From this, bad roots arise, and from bad causes suffering.",
        "source": "T03n0184_002:0471c24_27"
    },
    {
        "source_sentence": "能斷愛習，不隨婬心，大如毛髮，受行八道，則眾苦滅，譬如無薪亦無火，",
        "translation": "He can cut off the habit of craving and not follow coarse thoughts, which are as large as hair. If he receives and practices the eight paths, all forms of suffering will be extinguished, just as there is no fuel and no fire.",
        "source": "T03n0184_002:0471c24_28"
    },
    {
        "source_sentence": "是謂無為度世之道。",
        "translation": "This is called the worldly path of liberation through nonexistence.",
        "source": "T03n0184_002:0471c26_29"
    },
    {
        "source_sentence": "「菩薩自知，已棄惡本，無婬怒癡，生死五陰諸種悉斷，無餘災孽所作已成，",
        "translation": "“The enlightening beings know for themselves that they have abandoned the root of evil, are free from lust, anger, and delusion. The seeds of the five aggregates of birth and death have all been annihilated, and there is no remaining destructive action to be done.",
        "source": "T03n0184_002:0471c27_0"
    },
    {
        "source_sentence": "智慧已了。",
        "translation": "His wisdom has been comprehended.",
        "source": "T03n0184_002:0471c28_1"
    },
    {
        "source_sentence": "明星出時，廓然大悟，得無上正真道，為最正覺，得佛十八法，有十神力、四無所畏。",
        "translation": "When the star emerges, he's clearly greatly enlightened, attains the unsurpassed true path, becomes the most correct awakening, and attains the 18 Buddha-dharmas, which have ten supernormal powers and four fearlessnesses.",
        "source": "T03n0184_002:0471c29_0"
    },
    {
        "source_sentence": "佛十八法者，謂從得佛至于泥曰，一、無失道，二、無空言，三、無妄志，",
        "translation": "The Buddha’s eighteen doctrines are as follows:",
        "source": "T03n0184_002:0472a01_1"
    },
    {
        "source_sentence": "四、無不淨意，五、無若干想，六、無不省視，七、志欲無減，八、精進無減，",
        "translation": "4. the absence of impure thoughts, 5. the absence of certain perceptions, 6. the absence of uncontaminated attention, 7. the absence of decrease in aspiration, and 8. the absence of decrease in effort,",
        "source": "T03n0184_002:0472a03_2"
    },
    {
        "source_sentence": "九、定意無減，十、智慧無減，十一、解脫無減，十二、度知見無減，",
        "translation": "(9) The state of concentration is not diminished; (10) the state of wisdom is not diminished; (11) the state of liberation is not diminished; (12) the state of surpassing knowledge and vision is not diminished.",
        "source": "T03n0184_002:0472a05_0"
    },
    {
        "source_sentence": "十三、古世之事悉知見，十四、來世之事悉知見，十五、今世之事悉知見，",
        "translation": "13. He knows and sees all the events of ancient times, 14. He knows and sees all the events of future lives, and 15. He knows and sees all the events of the present life.",
        "source": "T03n0184_002:0472a06_1"
    },
    {
        "source_sentence": "十六、攬眾身行化以始所知，十七、攬眾言行化以始所知，十八、攬眾意行化以始所知，",
        "translation": "The sixteenth is to embrace the practices and transformations of all bodies as the beginning of knowing, the seventeenth is to embrace the practices and transformations of all words as the beginning of knowing, and the eighteenth is to embrace the practices and transformations of all minds as the beginning of knowing.",
        "source": "T03n0184_002:0472a07_2"
    },
    {
        "source_sentence": "是為佛十八不共之法。",
        "translation": "These are the eighteen unique qualities of a buddha.",
        "source": "T03n0184_002:0472a09_3"
    },
    {
        "source_sentence": "「十神力者，諸佛悉見知，深微隱遠，是處非處，明審如有，一力也；",
        "translation": "“The ten kinds of supernormal power are: the buddhas all see and know, deeply and subtly, whether it is right or wrong. They clearly discern if it exists or not; this is one power.",
        "source": "T03n0184_002:0472a10_4"
    },
    {
        "source_sentence": "佛悉明知來今往古所造行地，其受報處，二力也；",
        "translation": "The Buddha clearly knows the places of past, present, and future created practices as well as the places where they receive retribution: these are the two powers.",
        "source": "T03n0184_002:0472a11_5"
    },
    {
        "source_sentence": "佛悉分別天人眾生彼彼異念，三力也；",
        "translation": "The Buddha discerns all the different thoughts of gods, humans, sentient beings, and other beings—three powers.",
        "source": "T03n0184_002:0472a13_0"
    },
    {
        "source_sentence": "佛知眾生若干種語及度世語，四力也；",
        "translation": "The Buddha knows the various kinds of speech of sentient beings, as well as the speech for salvation. These are the four powers.",
        "source": "T03n0184_002:0472a13_1"
    },
    {
        "source_sentence": "佛悉了知世間雜種無量情態，五力也；",
        "translation": "The Buddha knows the world in all its various forms and infinite states of mind: these are the five powers.",
        "source": "T03n0184_002:0472a14_2"
    },
    {
        "source_sentence": "佛能現禪解定行，除眾勞諍，六力也；",
        "translation": "The Buddha is able to manifest the practice of meditation, understanding, and meditative absorption. This is apart from all weariness and torpor by the six powers.",
        "source": "T03n0184_002:0472a15_3"
    },
    {
        "source_sentence": "佛知欲縛知欲解要在所宜行，七力也；",
        "translation": "The Buddha, knowing the bond of desire and knowing the liberation from it, dwells in appropriate action: this is the seventh power.",
        "source": "T03n0184_002:0472a16_4"
    },
    {
        "source_sentence": "佛智如海善言無量追識一切宿命所更，八力也；",
        "translation": "The Buddha’s knowledge is like an ocean of good words, immeasurable; it knows the past lives of all sentient beings and goes wherever they are.",
        "source": "T03n0184_002:0472a17_5"
    },
    {
        "source_sentence": "佛天眼淨見人物死神所出生，善惡殃福，隨行受報，九力也；",
        "translation": "The Buddha’s divine eye sees all beings with purity, and they are born in the realm of death. Good or evil, bad or good fortune, receive retribution according to their actions: these are the nine powers.",
        "source": "T03n0184_002:0472a18_6"
    },
    {
        "source_sentence": "佛漏已盡，無復縛著，神真叡智，自知見證，究暢道行，可作能作，無餘生死，",
        "translation": "The Buddha has extinguished the taints of defilement and is no longer attached to it. His supernormal powers are genuine, his knowledge and wisdom are self-knowing and experiencing; he perfects the practice of enlightenment, knows what can be done and what cannot be done, leaving birth and death without remainder.",
        "source": "T03n0184_002:0472a20_7"
    },
    {
        "source_sentence": "其智明審，是為佛十神力也。",
        "translation": "Their knowledge and insight are the Buddha’s ten supernatural powers.",
        "source": "T03n0184_002:0472a21_8"
    },
    {
        "source_sentence": "「四無所畏者，佛神智正覺，無所不知，愚人或言：『佛未悉知。』",
        "translation": "The four fearlessnesses are when the Buddha's supernormal knowledge and right awakening know nothing, and foolish people sometimes say, 'The Buddha doesn't know everything.'",
        "source": "T03n0184_002:0472a22_9"
    },
    {
        "source_sentence": "至於梵摩眾聖，皆莫能論佛之智故，獨步不懼，一無畏也。",
        "translation": "As for the Brahmas and other sages, none of them could discuss the Buddha's wisdom, so they were alone and didn't fear it, which is the first fearlessness.",
        "source": "T03n0184_002:0472a23_10"
    },
    {
        "source_sentence": "佛漏盡悉止，愚惑相言：『佛漏未盡。』",
        "translation": "When the Buddha's contaminants are ended, they all stop, and the characteristic of delusion says, 'The Buddha's contaminants haven't ended yet.'",
        "source": "T03n0184_002:0472a25_11"
    },
    {
        "source_sentence": "至梵摩眾聖，莫能論佛之志故，獨步不懼，二無畏也。",
        "translation": "Up to the Brahmakāyika sages, they can't discuss the Buddha's aspirations, so they don't fear it when they walk alone, which are two kinds of fearlessness.",
        "source": "T03n0184_002:0472a26_12"
    },
    {
        "source_sentence": "佛說經戒，天下誦習，愚惑相言：『佛經可遏。』",
        "translation": "The Buddha teaches the sūtras and precepts, which are recited throughout the world, and foolish people say, 'The Buddha's sūtras can be suppressed.'",
        "source": "T03n0184_002:0472a27_13"
    },
    {
        "source_sentence": "至梵摩眾聖，莫能論毀佛正經故，獨步不懼，三無畏也。",
        "translation": "Up to the Brahma sages, they can't discuss disparaging the Buddha's right sūtras because they don't fearlessly walk alone and don't fear them, which are the three fearlessnesses.",
        "source": "T03n0184_002:0472a28_14"
    },
    {
        "source_sentence": "佛現道義，言真而要，能度苦厄，愚惑相言：『不能度苦。』",
        "translation": "The Buddha shows the meaning of the path, saying that it's true and essential to save them from suffering and distress, and foolish people say, 'I can't save them from suffering.'",
        "source": "T03n0184_002:0472a29_15"
    },
    {
        "source_sentence": "至梵摩眾聖，莫能論佛正道故，周行不懼，四無畏也。",
        "translation": "Up to the Brahmakāyika sages, they can't discuss the Buddha's right path, so they travel around without fear, which are the four fearlessnesses.",
        "source": "T03n0184_002:0472b02_16"
    },
    {
        "source_sentence": "「佛得是意，一切知見，坐自念言：『是實微妙，難知難明，甚難得也，",
        "translation": "Having gained this thought, the Buddha knew and saw everything. Sitting there, he thought to himself, “This is indeed subtle, difficult to know and difficult to fathom.",
        "source": "T03n0184_002:0472b03_17"
    },
    {
        "source_sentence": "高而無上，廣不可極，淵而無下，深不可測，大苞天地，細入無間，養育眾生，",
        "translation": "It is unexcelled in height and depth, immeasurable in width and depth, deep and immeasurable in depth. It encompasses heaven and earth; subtly entering without interruption, it nourishes sentient beings.",
        "source": "T03n0184_002:0472b04_18"
    },
    {
        "source_sentence": "如視赤子，承事諸佛，積德無量，累劫懃苦，不忘其功也，今悉得之。』",
        "translation": "Like looking at a red child who serves the buddhas, his accumulated virtue is immeasurable, and he doesn't forget their merit for eons of suffering; now he's fully attained it.'",
        "source": "T03n0184_002:0472b06_19"
    },
    {
        "source_sentence": "「『作福之報快，　　眾願皆得成，",
        "translation": "'The reward for doing good is immediate, and all your vows will be fulfilled.",
        "source": "T03n0184_002:0472b08_20"
    },
    {
        "source_sentence": "　　速疾入眾寂，　　皆得至泥洹。",
        "translation": "They quickly enter the many quiescences and all attain nirvāṇa.",
        "source": "T03n0184_002:0472b08_20"
    },
    {
        "source_sentence": "　　今覺佛極貴，　　棄婬淨無漏，",
        "translation": "Now that the Buddha of Enlightenment is so greatly esteemed, He has abandoned coarse and pure practices.",
        "source": "T03n0184_002:0472b08_20"
    },
    {
        "source_sentence": "　　一切能將導，　　從者必歡豫。』",
        "translation": "All those who can guide will surely rejoice when they follow them.'",
        "source": "T03n0184_002:0472b08_20"
    },
    {
        "source_sentence": "善自頌曰：「是時佛在摩竭提界善勝道場貝多樹下，德力降魔，覺慧神靜，",
        "translation": "Sunetra then composed the following verse: At that time the Buddha was staying at the foot of a palm tree on the terrace of enlightenment called Sudarśana in the great city of Magadha. The power of his virtue subdued Māra, and the tranquility of his intellect and wisdom entered upon him.",
        "source": "T03n0184_002:0472b08_20"
    },
    {
        "source_sentence": "三達無礙。",
        "translation": "The third is the unobstructed attainment.",
        "source": "T03n0184_002:0472b14_21"
    },
    {
        "source_sentence": "度二賈客，提謂、波利，授三自歸，及與五戒，為清信士。",
        "translation": "He delivered two merchants, Devadatta and Upāli, who gave them the three self-refuges and five precepts as a man of pure faith.",
        "source": "T03n0184_002:0472b14_22"
    },
    {
        "source_sentence": "「念昔錠光別我為佛：『汝後百劫，當得作佛，名釋迦文如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "「念昔錠光別我為佛,『後百劫, 汝後得作佛名釋迦文如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師,",
        "source": "T03n0184_002:0472b16_0"
    },
    {
        "source_sentence": "號佛、世尊，度脫眾生，如我今也。』",
        "translation": "They're called buddhas and world-honored ones who liberate sentient beings, just as I am now.'",
        "source": "T03n0184_002:0472b18_1"
    },
    {
        "source_sentence": "吾從是來，建立弘誓，奉行六度、四等、四恩、三十七品，善權隨時，",
        "translation": "From that time forth, I have made a great vow to practice the six perfections, the four higher knowledges, the four kinds of benevolence, and the thirty-seven chapters of the Vinaya.",
        "source": "T03n0184_002:0472b19_2"
    },
    {
        "source_sentence": "一切諸法，積累不倦，高行殊異，忍苦無量，功報不遺，大願果成。」",
        "translation": "All dharmas are accumulated without weariness, differ in their lofty actions, endure immeasurable suffering, don't leave behind the rewards of their efforts, and fulfill the fruit of their great vows.",
        "source": "T03n0184_002:0472b20_3"
    },
    {
        "source_sentence": "佛說經已，一切眾會，皆大歡喜，為佛作禮而去。",
        "translation": "After the Buddha had taught the sutra, all the people in the assembly were greatly delighted. They bowed to the Buddha and departed.",
        "source": "T03n0184_002:0472b22_4"
    },
    {
        "source_sentence": "修行本起經卷下",
        "translation": "Xiuxing benqi jing, vol. 2",
        "source": "T03n0184_002:0472b24_0"
    }
]