[
    {
        "source_sentence": "悲華經卷第二",
        "translation": "Compassionate Flower Scripture, Volume 2",
        "source": "T03n0157_002:0174b26_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T03n0157_002:0174b28_0"
    },
    {
        "source_sentence": "大施品第三之一",
        "translation": "Chapter Three of the Great Chapter on Giving, Part I",
        "source": "T03n0157_002:0174b29_0"
    },
    {
        "source_sentence": "爾時，會中有菩薩摩訶薩名曰寂意，瞻覩如來種種神化已，白佛言：「世尊！",
        "translation": "At the time, there was a bodhisattva Mahāsattva named Silent Mind in the assembly who looked at the Tathāgata's various miraculous transformations and said to the Buddha, Bhagavān!",
        "source": "T03n0157_002:0174c01_0"
    },
    {
        "source_sentence": "何因緣故，其餘諸佛所有世界，清淨微妙種種莊嚴，離於五濁無諸穢惡，",
        "translation": "“World-honored One, why are all the other buddha-fields pure and subtle in their various adornments, free of the five defilements and without any dirt or stain?",
        "source": "T03n0157_002:0174c02_1"
    },
    {
        "source_sentence": "其中純有諸大菩薩，成就種種無量功德，受諸快樂，其土乃至無有聲聞、辟支佛名，",
        "translation": "Purely there were great enlightening beings there, perfecting various immeasurable virtues and experiencing all kinds of happiness. That land had no names of śrāvakas or pratyekabuddhas in it.",
        "source": "T03n0157_002:0174c04_2"
    },
    {
        "source_sentence": "何況當有二乘之實？",
        "translation": "How could there be the reality of the two vehicles?",
        "source": "T03n0157_002:0174c06_3"
    },
    {
        "source_sentence": "今我世尊，何因何緣處斯穢惡不淨世界，命濁、劫濁、眾生濁、見濁、煩惱濁，",
        "translation": "“World-honored One, what is the cause and reason we are now in this world, which is defiled by life, eon, sentient beings, views, and afflictions?",
        "source": "T03n0157_002:0174c06_4"
    },
    {
        "source_sentence": "於是五濁惡世之中，成阿耨多羅三藐三菩提？",
        "translation": "In the midst of these five turbid and evil worlds, will he attain supreme perfect enlightenment?",
        "source": "T03n0157_002:0174c08_5"
    },
    {
        "source_sentence": "在四眾中說三乘法？",
        "translation": "In the fourfold assembly, he teaches the teachings of the three vehicles.",
        "source": "T03n0157_002:0174c09_6"
    },
    {
        "source_sentence": "以何緣故，不取如是清淨世界，而不遠離五濁惡世？」",
        "translation": "What is the reason why they don't take such a pure world and aren't far removed from the five turbid and bad worlds?",
        "source": "T03n0157_002:0174c10_7"
    },
    {
        "source_sentence": "佛告寂意菩薩：「善男子！",
        "translation": "The Buddha told Silent Mind Bodhisattva, Good sons!",
        "source": "T03n0157_002:0174c11_8"
    },
    {
        "source_sentence": "菩薩摩訶薩以本願故取淨妙國，亦以願故取不淨土。",
        "translation": "Because of the original vow, the bodhisattva Mahāsattva takes the pure and marvelous land, and because of the vow, he takes the impure land.",
        "source": "T03n0157_002:0174c12_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0157_002:0174c13_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0174c13_11"
    },
    {
        "source_sentence": "菩薩摩訶薩成就大悲故，取斯弊惡不淨土耳。",
        "translation": "Because the bodhisattva Mahāsattva has accomplished great compassion, he takes this bad and impure land.",
        "source": "T03n0157_002:0174c13_12"
    },
    {
        "source_sentence": "是故吾以本願，處此不淨穢惡世界，成阿耨多羅三藐三菩提。",
        "translation": "Therefore, with my original vow, I'll stay in this impure and defiled world and attain unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0174c14_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0174c16_14"
    },
    {
        "source_sentence": "汝今諦聽，善思念之，善受善持，吾今當說。」",
        "translation": "Now, listen closely, consider it well, remember it well, receive it well, and maintain it well; I will explain it now.",
        "source": "T03n0157_002:0174c16_15"
    },
    {
        "source_sentence": "時諸菩薩受教而聽。",
        "translation": "The bodhisattvas then accepted the teaching and listened.",
        "source": "T03n0157_002:0174c17_16"
    },
    {
        "source_sentence": "佛告寂意菩薩：「善男子！",
        "translation": "The Buddha told Silent Mind Bodhisattva, Good sons!",
        "source": "T03n0157_002:0174c17_17"
    },
    {
        "source_sentence": "我於往昔過恒河沙等阿僧祇劫，此佛世界名刪提嵐，是時大劫名曰善持。",
        "translation": "In the distant past, as many eons as there are grains of sand in the Ganges River and so forth, this buddha world was called Shandiran, and at that time a great kalpa was called Shanchi.",
        "source": "T03n0157_002:0174c18_18"
    },
    {
        "source_sentence": "於彼劫中有轉輪聖王名無諍念，主四天下。",
        "translation": "In that eon, there was a wheel-turning sage king named Wuqianming, ruling over the four continents.",
        "source": "T03n0157_002:0174c20_19"
    },
    {
        "source_sentence": "有一大臣名曰寶海，是梵志種，善知占相。",
        "translation": "There was a minister named Jewel Ocean, a brahmin of the Brahmanic caste who well knew the signs of divination.",
        "source": "T03n0157_002:0174c21_20"
    },
    {
        "source_sentence": "時生一子，有三十二相瓔珞其身，八十種好次第莊嚴，以百福德成就一相，",
        "translation": "At that time a son was born, endowed with the thirty-two marks of a great being. His body was adorned in eighty kinds of embellishments, and he possessed one characteristic by one hundred meritorious virtues.",
        "source": "T03n0157_002:0174c22_21"
    },
    {
        "source_sentence": "常光一尋，其身圓足如尼拘盧樹，諦觀一相無有厭足。",
        "translation": "He always shines for a fathom, his body with round legs like a nyagrodha tree, and he observes one characteristic without tire of it.",
        "source": "T03n0157_002:0174c24_22"
    },
    {
        "source_sentence": "當其生時，有百千諸天來共供養，因為作字號曰寶藏。",
        "translation": "At the time of his birth, hundreds of thousands of gods came to make offerings to him, and he was given the name Baozang.",
        "source": "T03n0157_002:0174c25_23"
    },
    {
        "source_sentence": "其後長大，剃除鬚髮法服出家，成阿耨多羅三藐三菩提，還號寶藏如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "When he grew up, he shaved his hair and beard, removed his religious robes, left home, and became an unsurpassed, correct enlightenment, and returned to be called the Ratnaketu Tathāgata, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-Departed, Understander of the World, Unsurpassed,",
        "source": "T03n0157_002:0174c26_24"
    },
    {
        "source_sentence": "即轉法輪，令百千無量億那由他諸眾生等，得生人、天或得解脫。",
        "translation": "That is, he turns the wheel of the Dharma so that hundreds of thousands of measureless millions of sentient beings can be born among humans or gods or attain liberation.",
        "source": "T03n0157_002:0174c29_25"
    },
    {
        "source_sentence": "如是利益諸天、人已，與百千億那由他聲聞大眾，恭敬圍遶，次第遊行城邑聚落，",
        "translation": "Having benefited the gods and humans in this way, they were surrounded by hundreds of thousands of koṭis of nayutas of śrāvakas, accompanied by a great assembly of śrāvakas.",
        "source": "T03n0157_002:0175a02_26"
    },
    {
        "source_sentence": "漸到一城，名安周羅，即是聖王所治之處。",
        "translation": "He gradually reached a city called Anzhula, which was ruled by a holy king.",
        "source": "T03n0157_002:0175a04_27"
    },
    {
        "source_sentence": "去城不遠有一園林，名曰閻浮。",
        "translation": "Not far from the city was a pleasure grove called Jambudvīpa.",
        "source": "T03n0157_002:0175a05_28"
    },
    {
        "source_sentence": "爾時，如來與百千無量億那由他聲聞大眾止頓此林。",
        "translation": "At the time, the Tathāgata and hundreds of thousands of immeasurable millions of other śrāvakas stopped at this forest.",
        "source": "T03n0157_002:0175a06_29"
    },
    {
        "source_sentence": "「時轉輪王聞寶藏佛與百千無量億那由他大聲聞眾，次第遊行至閻浮林。",
        "translation": "At the time, the wheel-turning king heard that the Buddha of the Jeweled Treasury and hundreds of thousands of immeasurable millions of great śrāvakas had traveled to the Jambudvīpa forest in order.",
        "source": "T03n0157_002:0175a07_30"
    },
    {
        "source_sentence": "爾時，聖王便作是念：『我今當往至於佛所，禮拜、圍遶、供養、恭敬、尊重、讚歎。』",
        "translation": "It was then that the noble king thought, 'Now, I will go to the Buddha and venerate, circumambulate, offer support, respect, venerate, venerate, and praise him.'",
        "source": "T03n0157_002:0175a09_31"
    },
    {
        "source_sentence": "作是念已，即便自以聖王神力，與無量大眾前後圍遶，出安周羅城向閻浮林。",
        "translation": "After he had this thought, he himself, surrounded by the holy king's supernormal powers and accompanied by an immeasurable number of people in front and behind him, left the city of Anāthapiṇḍada and headed for the Jambudvīpa.",
        "source": "T03n0157_002:0175a10_32"
    },
    {
        "source_sentence": "既至林外如法下車，步至佛所。",
        "translation": "When he arrived outside the forest, he dismounted from his chariot in accordance with the rules and walked to where the Buddha was staying.",
        "source": "T03n0157_002:0175a12_33"
    },
    {
        "source_sentence": "到佛所已，頭面禮足，右遶三匝却坐一面。",
        "translation": "Having approached the Buddha, he bowed his forehead and feet, circumambulated him three times to his right, and withdrew to sit at one side.",
        "source": "T03n0157_002:0175a13_34"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0175a14_35"
    },
    {
        "source_sentence": "爾時，寶藏多陀阿伽度、阿羅呵、三藐三佛陀，即為聖王說於正法，以種種方便示教利喜。",
        "translation": "At the time, the treasure-store tathāgata, arhat, and samyak-saṃbuddha taught the right teaching for the noble king, showing them various ways to teach, benefit, and delight.",
        "source": "T03n0157_002:0175a14_36"
    },
    {
        "source_sentence": "說是法已，默然而止。",
        "translation": "After explaining this teaching, he remained silent and stopped.",
        "source": "T03n0157_002:0175a16_37"
    },
    {
        "source_sentence": "時轉輪王便從坐起，長跪叉手前白佛言：『唯願如來及諸聖眾，於三月中受我供養衣被、飲食、臥具、湯藥。』",
        "translation": "The wheel-turning king then rose from his seat, knelt down with his palms together and said to the Buddha, 'May the Tathāgata and the holy people accept my offerings of clothing, food, bedding, and medicine for three months.'",
        "source": "T03n0157_002:0175a17_38"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0175a19_39"
    },
    {
        "source_sentence": "彼時如來默然許之。",
        "translation": "The Tathāgata then remained silent and agreed with him.",
        "source": "T03n0157_002:0175a19_40"
    },
    {
        "source_sentence": "時王即知佛已許可，頭面作禮，遶佛三匝歡喜而去。",
        "translation": "Knowing that the Buddha had given his permission, the king bowed his head and face, circumambulated him three times, rejoiced, and departed.",
        "source": "T03n0157_002:0175a20_41"
    },
    {
        "source_sentence": "時轉輪王告諸小王、大臣、人民及其眷屬，作如是言：『汝等知不？",
        "translation": "The wheel-turning king then addressed the lesser kings, ministers, people, and their retinues, saying, 'Do you know?'",
        "source": "T03n0157_002:0175a21_42"
    },
    {
        "source_sentence": "我今已請寶藏如來及其大眾，終竟三月，奉諸所安。",
        "translation": "I have now invited the Tathāgata Ratnacchattra and his assembly of bhikṣus to this monastery. For the duration of the end of the third month, I will pay homage to all those who have settled here.",
        "source": "T03n0157_002:0175a23_43"
    },
    {
        "source_sentence": "自我所用愛重之物，諸供養具、僮使僕從，我今悉捨，以奉施佛及諸聖眾。",
        "translation": "I will now give away all the treasures, offerings, and servants of my own accord to the Buddha and his holy ones.",
        "source": "T03n0157_002:0175a24_44"
    },
    {
        "source_sentence": "汝等今者亦當如是捨所重物，諸供養具、僮使僕從，以奉施佛及諸聖眾。』",
        "translation": "Now, you must also thus abandon your valuable things, such as offerings, servants, messengers, and servants to the Buddha and the noble people.'",
        "source": "T03n0157_002:0175a26_0"
    },
    {
        "source_sentence": "諸人聞已，即便受教，歡喜奉行。",
        "translation": "Having heard it, the people accepted the teaching and joyfully carried it out.",
        "source": "T03n0157_002:0175a27_1"
    },
    {
        "source_sentence": "「時，主寶臣於閻浮林中以純金為地，於其地上作七寶樓。",
        "translation": "“At the time, the lord treasure minister had made pure gold as the ground in the Jambudvīpa forest and built a seven-jeweled tower on that ground.",
        "source": "T03n0157_002:0175a28_2"
    },
    {
        "source_sentence": "其樓四門七寶所成，七寶行樹，其樹皆懸寶衣瓔珞，種種真珠、妙好寶蓋及諸寶器以用莊嚴。",
        "translation": "The four gates of the tower were made of the seven kinds of treasure, and the seven-jeweled trees in each direction hung jeweled robes, jewelry, various genuine pearls, exquisitely beautiful jeweled canopies, and precious vessels adorned with them.",
        "source": "T03n0157_002:0175a29_3"
    },
    {
        "source_sentence": "復有諸香、妙寶、華果以莊挍樹，散種種華，綩綖繒纊以為敷具，懸諸繒幡。",
        "translation": "There were also various kinds of fragrances, exquisite jewels, and flower fruits that adorned the trees, spreading various kinds of flowers, covered with silk to make cloth for their bedding, and hung with silk banners.",
        "source": "T03n0157_002:0175b02_4"
    },
    {
        "source_sentence": "聖王金輪於樓觀前懸處虛空去地七尺，令白象寶在如來後持七寶樹，其樹復有真珠繒帛，",
        "translation": "The holy king’s golden wheel was suspended in the sky seven feet above the ground in front of the tower, causing the white elephant treasure to be behind the Buddha and holding a tree made of the seven kinds of treasure. That tree also contained genuine pearls, silk, and cotton cloth.",
        "source": "T03n0157_002:0175b04_5"
    },
    {
        "source_sentence": "種種瓔珞以用莊挍，其上復有七寶妙蓋。",
        "translation": "Various kinds of jewelry adorned it, and on top of it were wonderful canopies made of the seven treasures.",
        "source": "T03n0157_002:0175b06_6"
    },
    {
        "source_sentence": "使玉女寶於如來前，磨牛頭栴檀及黑沈水用散佛上，以摩尼珠寶置於佛前，",
        "translation": "Then, in the presence of the buddha-tathāgata, they polished the sandalwood from the top of the cow’s head and scattered it over the Buddha. They placed the precious maṇi jewel in front of him.",
        "source": "T03n0157_002:0175b07_7"
    },
    {
        "source_sentence": "寶珠、金輪二光微妙，常明遍滿閻浮檀林晝夜無異。",
        "translation": "The two lights of the jeweled pearl and the golden wheel are subtle and always bright, filling the Jambudvīpa forest day and night without any difference.",
        "source": "T03n0157_002:0175b09_8"
    },
    {
        "source_sentence": "寶藏如來常身光明微妙清淨，遍滿三千大千世界。",
        "translation": "Jewel-Store Tathāgata's eternal body of light is subtle and pure, pervading 3,000 great one-thousand worlds.",
        "source": "T03n0157_002:0175b11_0"
    },
    {
        "source_sentence": "以牛頭栴檀為一一聲聞作諸床[木*翕]，一一床邊牛頭栴檀以為机隥。",
        "translation": "Each śrāvaka is made of ox-head sandalwood for each [wooden] seat, and the edges of each seat are made of ox-head sandalwood as a table.",
        "source": "T03n0157_002:0175b12_1"
    },
    {
        "source_sentence": "一一座後有白象寶，持七寶樹，種種莊嚴亦如如來。",
        "translation": "Behind one pavilion was a white elephant treasure carrying a seven-jeweled tree, variously adorned like the Tathāgata’s.",
        "source": "T03n0157_002:0175b13_2"
    },
    {
        "source_sentence": "一一座前有玉女寶，磨牛頭栴檀及黑沈水散以供養。",
        "translation": "In front of one pavilion was the treasure of the jadelike queen, which was offered by grinding oxhead sandalwood and scattering black-hot water to make offerings.",
        "source": "T03n0157_002:0175b15_3"
    },
    {
        "source_sentence": "於一一聲聞座前，各各安置摩尼寶珠。",
        "translation": "Before each śrāvaka's seat, he placed a maṇi-jeweled pearl in front of him.",
        "source": "T03n0157_002:0175b16_4"
    },
    {
        "source_sentence": "其園林中作種種伎樂，其園外邊有四兵寶周匝圍遶。",
        "translation": "Various kinds of music were played in the grove, surrounded by four treasures outside the grove.",
        "source": "T03n0157_002:0175b17_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0175b18_6"
    },
    {
        "source_sentence": "時轉輪王清旦出城向於佛所，既至林外，如法下車步至佛所。",
        "translation": "The wheel-turning king then left the city at dawn and headed for the Buddha's place. Having arrived outside the forest, he went to the Buddha's place on foot or in a chariot according to the rules.",
        "source": "T03n0157_002:0175b18_7"
    },
    {
        "source_sentence": "至佛所已，頭面禮足右遶三匝，自行澡水，手自斟酌上妙餚饌佛及大眾。",
        "translation": "When he arrived at the Buddha's place, he bowed his head and feet, circumambulated him three times to his right, washed himself with water, and offered a handful of delicious food to the Buddha and the crowd.",
        "source": "T03n0157_002:0175b20_8"
    },
    {
        "source_sentence": "飲食已訖，捨鉢漱口。",
        "translation": "After he had finished eating and drinking, he discarded his bowl and rinsed his mouth.",
        "source": "T03n0157_002:0175b22_9"
    },
    {
        "source_sentence": "時轉輪王手執寶扇，以扇如來及一一聲聞。",
        "translation": "The wheel-turning king then held a jeweled fan in his hand and used it to fan the Tathāgata and each of the śrāvakas.",
        "source": "T03n0157_002:0175b22_10"
    },
    {
        "source_sentence": "時王千子及八萬四千諸小王等，悉皆供養一一聲聞，如轉輪王供養世尊。",
        "translation": "The king's thousand sons and 84,000 minor kings then all made offerings to each śrāvaka, just like the wheel-turning king making offerings to the Bhagavān.",
        "source": "T03n0157_002:0175b23_11"
    },
    {
        "source_sentence": "尋於食後，有百千無量億那由他眾生入閻浮林，於如來所聽受正法。",
        "translation": "After the meal, hundreds of thousands of measureless millions of sentient beings entered the Jambudvīpa forest and listened to the right teaching from the Tathāgata.",
        "source": "T03n0157_002:0175b25_12"
    },
    {
        "source_sentence": "「爾時，虛空中有百千無量億那由他諸天，散諸天華、作天伎樂以供養佛，",
        "translation": "At that time hundreds of thousands of myriads of koṭis of immeasurable millions of nayutas of devas in the sky scattered heavenly flowers and performed heavenly music to honor the Buddha.",
        "source": "T03n0157_002:0175b28_0"
    },
    {
        "source_sentence": "是時虛空中有天衣、瓔珞、種種寶蓋而自迴轉。",
        "translation": "At the time, there were celestial robes, jewelry, and various jeweled canopies in the sky that revolved themselves.",
        "source": "T03n0157_002:0175b29_1"
    },
    {
        "source_sentence": "復有四萬青衣夜叉，於栴檀林取牛頭栴檀，為佛大眾然火熟食。",
        "translation": "Again, there were 40,000 blue-clad yakṣas who took the sandalwood ox-head sandalwood from the sandalwood grove and cooked it into a fire for the Buddha's masses.",
        "source": "T03n0157_002:0175c01_2"
    },
    {
        "source_sentence": "時轉輪王其夜於佛及大眾前，然百千無量億那由他燈。",
        "translation": "At the time, the wheel-turning king was standing in front of the Buddha and the crowd that night, but there were hundreds of thousands of measureless millions of nayutas of lamps.",
        "source": "T03n0157_002:0175c03_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0175c04_4"
    },
    {
        "source_sentence": "時轉輪王頂戴一燈，肩荷二燈，左右手中執持四燈，其二膝上各置一燈，",
        "translation": "The wheel-turning king then wore one lamp on his head, carried two lamps on his shoulders, held four lamps in his left and right hands, and placed one lamp on each of the two knees.",
        "source": "T03n0157_002:0175c04_5"
    },
    {
        "source_sentence": "兩足趺上亦各一燈，如是竟夜供養如來。",
        "translation": "On each of the two-legged sandals, there's also a lamp, and thus he makes offerings to the Tathāgata throughout the night.",
        "source": "T03n0157_002:0175c06_6"
    },
    {
        "source_sentence": "佛神力故，身心快樂無有疲極，譬如比丘入第三禪，轉輪聖王所受快樂亦復如是，",
        "translation": "“Furthermore, it is like a bhikṣu entering the third meditative state of absorption whose body and mind are neither exhausted nor overcome by sorrow. The same applies to the bliss experienced by the cakravartin king:",
        "source": "T03n0157_002:0175c07_7"
    },
    {
        "source_sentence": "如是供養終竟三月。",
        "translation": "Thus, the offering lasts for three months.",
        "source": "T03n0157_002:0175c09_8"
    },
    {
        "source_sentence": "時王千子及八萬四千諸小王等，百千無量億那由他眾，亦以妙食供養一一諸聲聞等，",
        "translation": "The king's thousand sons and eighty-four thousand lesser kings, as well as hundreds of thousands of immeasurable millions of nayutas, also offered subtle food to each of the śrāvakas.",
        "source": "T03n0157_002:0175c09_9"
    },
    {
        "source_sentence": "亦如聖王所食餚饌，亦滿三月。",
        "translation": "It's like the food and delicacies that the noble king eats, which also last three months.",
        "source": "T03n0157_002:0175c11_10"
    },
    {
        "source_sentence": "其玉女寶亦以種種華香供養，如轉輪王供養於佛，等無差別。",
        "translation": "The treasure of the jadelike queen also offered various kinds of flowers and incense, just as the wheel-turning king offered to the Buddha equally without distinction.",
        "source": "T03n0157_002:0175c12_11"
    },
    {
        "source_sentence": "其餘眾生華香供養，亦如玉女供養聲聞，無有異也。",
        "translation": "The other sentient beings are offered flowers and incense, just as the jadelike maidens are offered to śrāvakas, without any difference.",
        "source": "T03n0157_002:0175c14_12"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0175c15_13"
    },
    {
        "source_sentence": "時轉輪王過三月已，以主藏寶臣貢上如來閻浮檀金作龍頭瓔，八萬四千上金輪寶，",
        "translation": "After three months had passed, the wheel-turning king made a dragon’s head necklace out of the Tathāgata’s Jambudvīpa gold and eighty-four thousand ounces of pure gold.",
        "source": "T03n0157_002:0175c15_14"
    },
    {
        "source_sentence": "白象紺馬、摩尼珠寶，妙好火珠，主藏臣寶、主四兵寶，諸小王等安周羅城諸小城邑，",
        "translation": "White elephants, dark blue horses, maṇi jewels, exquisite fire beads, the treasures of the treasury councilor and the treasures of the four kinds of army lords, as well as the small kings living in the cities and towns.",
        "source": "T03n0157_002:0175c17_15"
    },
    {
        "source_sentence": "七寶衣樹、妙寶華聚、種種寶蓋，轉輪聖王所著妙衣，種種華鬘、上妙瓔珞，",
        "translation": "The trees of the seven-jeweled robes, beautiful jeweled lotus blossoms, various jeweled canopies, exquisite raiment worn by the universal ruler, various kinds of flower garlands and exquisitely ornamented necklaces.",
        "source": "T03n0157_002:0175c19_16"
    },
    {
        "source_sentence": "七寶妙車、種種寶床，七寶頭目挍絡寶網，閻浮金鎖、寶真珠貫，上妙履屣、綩綖茵蓐，",
        "translation": "It was decorated with seven kinds of exquisite carts made of the seven kinds of treasure and various kinds of precious chairs. Their heads and eyes were endowed with the seven kinds of jewel ornaments, their necks covered with jewel nets, adorned with jambu-gold chains, embellished with genuine pearls; they wore exquisitely",
        "source": "T03n0157_002:0175c21_17"
    },
    {
        "source_sentence": "微妙机隥、七寶器物、鐘鼓伎樂，寶鈴珂貝、園林幢幡，寶灌燈燭、七寶鳥獸，",
        "translation": "It was decorated with exquisite tables and chairs, seven kinds of precious utensils, bells, drums, music, jeweled bells, eagles, shells, parks, forests, banners, streamers, lamps, candles, and birds and beasts of the seven kinds of treasure.",
        "source": "T03n0157_002:0175c23_18"
    },
    {
        "source_sentence": "雜廁妙扇、種種諸藥，如是等物各八萬四千，以用奉施佛及聖眾。",
        "translation": "Each of these things, eighty-four thousand in number, were given to the Buddha and the holy ones for their use.",
        "source": "T03n0157_002:0175c24_19"
    },
    {
        "source_sentence": "作是施已，白佛言：『世尊！",
        "translation": "After making this gift, he said to the Buddha, 'Bhagavān!",
        "source": "T03n0157_002:0175c26_20"
    },
    {
        "source_sentence": "我國多事，有諸不及，今我悔過。",
        "translation": "My country has many affairs and there are some failures, but now I'll repent.",
        "source": "T03n0157_002:0175c26_21"
    },
    {
        "source_sentence": "唯願如來久住此園，復當令我數得往來，禮拜圍遶、恭敬供養、尊重讚歎。』",
        "translation": "May the Tathāgata stay in this park for a long time, and he'll also allow me to repeatedly come and go, venerate, circumambulate, respect, offer support, honor, and praise them.'",
        "source": "T03n0157_002:0175c27_22"
    },
    {
        "source_sentence": "「彼王諸子在佛前坐，一一王子復各請佛及比丘僧，終竟三月奉諸所安，",
        "translation": "When the princes of that king sat before the Buddha, each prince invited the Buddha and the bhikṣus to his monastery. After three months had passed, they offered their support to him.",
        "source": "T03n0157_002:0175c29_23"
    },
    {
        "source_sentence": "唯願許可。",
        "translation": "Please allow me to do so.",
        "source": "T03n0157_002:0176a02_24"
    },
    {
        "source_sentence": "爾時，如來默然許之。",
        "translation": "At that point, the Tathāgata remained silent and gave his permission.",
        "source": "T03n0157_002:0176a02_25"
    },
    {
        "source_sentence": "時轉輪王已知如來受諸子請，頭面禮佛及比丘僧，右遶三匝歡喜而去。",
        "translation": "Knowing that the Tathāgata had accepted the invitation of the children, the wheel-turning king bowed his head and face to the Buddha and the monks, circumambulated them three times to their right, rejoiced, and departed.",
        "source": "T03n0157_002:0176a02_26"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0176a04_27"
    },
    {
        "source_sentence": "時王千子第一太子名曰不眴，終竟三月供養如來及比丘僧，奉諸所安一如聖王。",
        "translation": "The first prince of the king's thousand sons, named Sadāparibhūta, spent the last three months making offerings to the Tathāgata and the monks and consecrated themselves to what they had settled like a noble king.",
        "source": "T03n0157_002:0176a04_28"
    },
    {
        "source_sentence": "時轉輪王日至佛所，瞻覩尊顏及比丘僧，聽受妙法。",
        "translation": "The wheel-turning king then went to the Buddha, looked at his venerable appearance and the monks and listened to the wonderful teaching.",
        "source": "T03n0157_002:0176a06_29"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0176a07_30"
    },
    {
        "source_sentence": "爾時大臣寶海梵志，周遍到於閻浮提內，男子女人、童男童女一切人所，",
        "translation": "It was then that the minister, the jeweled ocean priest, pervaded throughout Jambudvfpa with men, women, boys, girls, and all the people there.",
        "source": "T03n0157_002:0176a08_0"
    },
    {
        "source_sentence": "乞求所須。",
        "translation": "He begs for what's needed.",
        "source": "T03n0157_002:0176a09_1"
    },
    {
        "source_sentence": "爾時，梵志先要施主：『汝今若能歸依三寶，發阿耨多羅三藐三菩提心者，",
        "translation": "At that point, the priest first asked the donor, 'Now, if you can take refuge in the Three Treasures and give rise to the mind of unsurpassed, correct, and complete enlightenment,",
        "source": "T03n0157_002:0176a09_2"
    },
    {
        "source_sentence": "然後乃當受汝所施。』",
        "translation": "After that, I'll accept what you give.'",
        "source": "T03n0157_002:0176a11_3"
    },
    {
        "source_sentence": "時閻浮提一切眾生，其中乃至無有一人不從梵志受三歸依，發阿耨多羅三藐三菩提心者。",
        "translation": "None of the sentient beings in Jambudvīpa, even a single one of them, didn't accept the three refuges from the priest and give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0176a12_4"
    },
    {
        "source_sentence": "既令諸人受教誡已，即便受其所施之物。",
        "translation": "Having caused people to receive the instruction, they'll even accept the things they give.",
        "source": "T03n0157_002:0176a14_5"
    },
    {
        "source_sentence": "「爾時，梵志令百千億無量眾生住三福處，及發阿耨多羅三藐三菩提心。",
        "translation": "At the time, the priest caused hundreds of thousands of millions of measureless sentient beings to live in the three places of merit and aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0176a16_0"
    },
    {
        "source_sentence": "太子不眴供養如來及比丘僧，竟三月已，所奉噠嚫，八萬四千金龍頭瓔，",
        "translation": "The prince did not beg to pay homage to the Tathāgata and all the bhikṣus and monks. After three months had passed, he presented a golden bowl of eighty-four thousand kinds of necklaces made of gold ornaments with the heads of dragons’ jewelry.",
        "source": "T03n0157_002:0176a17_1"
    },
    {
        "source_sentence": "唯無聖王金輪白象、紺馬玉女，藏臣主兵、摩尼寶珠，其餘所有金輪象馬、妙好火珠，",
        "translation": "Only the golden-wheeled elephants, white elephants, dark blue horses, and jadelike maidens of honor were missing from the holy king. They stored their ministers, soldiers, maṇi treasures, and other precious jewels, while the others had golden-wheeled elephants, horses, and beautiful fire beads.",
        "source": "T03n0157_002:0176a19_2"
    },
    {
        "source_sentence": "童男童女、七寶衣樹，七寶華聚、種種寶蓋，微妙衣服、種種華鬘，上好瓔珞、七寶妙車，",
        "translation": "The young girls and boys, the seven-jeweled cloth trees, the flower clusters of the seven treasures, the various jeweled canopies, the subtle clothes, the various kinds of flower garlands, the most beautiful necklaces, the exquisite chariots of the seven treasures.",
        "source": "T03n0157_002:0176a21_3"
    },
    {
        "source_sentence": "種種寶床、七寶頭目，挍絡寶網、閻浮金鎖，寶真珠貫、上妙履屣，綩綖茵蓐、微妙机隥，",
        "translation": "Various kinds of jeweled beds, head and eyes made of the seven kinds of treasure, draped with silhouetted jewel nets, j embroidered with golden chains, embellished with precious pearls, exquisitely shaped footstools, covered with woolen carpets, decorated with exquisite table cloth.",
        "source": "T03n0157_002:0176a23_4"
    },
    {
        "source_sentence": "七寶器物、鐘皷伎樂，寶鈴珂貝、園林幢幡，寶灌燈燭、七寶鳥獸，雜廁妙扇、種種諸藥，",
        "translation": "It was decorated with seven kinds of precious utensils, bells, chimes, music and dances, jewel bells, shellfish bells, parklands, banners, streamers, lamps, candles, clouds of the seven kinds of birds and beasts, as well as exquisitely perfumed fountains, various medicines, and all kinds of",
        "source": "T03n0157_002:0176a25_5"
    },
    {
        "source_sentence": "如是等物，各八萬四千，以奉獻佛及比丘僧。",
        "translation": "Each of these things amounted to eighty-four thousand pieces and were offered to the Buddha and the monks and nuns.",
        "source": "T03n0157_002:0176a27_6"
    },
    {
        "source_sentence": "作是施已，白佛言：『世尊！",
        "translation": "After making this gift, he said to the Buddha, 'Bhagavān!",
        "source": "T03n0157_002:0176a28_7"
    },
    {
        "source_sentence": "所有不及，今日悔過。』",
        "translation": "Whatever it is, I'll repent today.'",
        "source": "T03n0157_002:0176a28_8"
    },
    {
        "source_sentence": "「時第二王子名曰尼摩，終竟三月，供養如來及比丘僧，如不眴太子所奉噠嚫，",
        "translation": "At that time the second prince, named Nimalakīrti, remained alive for three months to pay homage to the Tathāgata and the assembly of bhikṣus, just as he did to the bamboo bowl offered to him by Prince Sadāparibhūta.",
        "source": "T03n0157_002:0176a29_9"
    },
    {
        "source_sentence": "如上所說。",
        "translation": "It's as explained above.",
        "source": "T03n0157_002:0176b02_10"
    },
    {
        "source_sentence": "第三王子名曰王眾，第四王子名能加羅，第五王子名無所畏，第六王子名曰虛空，",
        "translation": "The third prince is called King Sthavira; the fourth prince is called Kanakalā; the fifth prince is called fearless; and the sixth prince is called Ākāśika.",
        "source": "T03n0157_002:0176b02_11"
    },
    {
        "source_sentence": "第七王子名曰善臂，第八王子名曰泯圖，第九王子名曰蜜蘇，第十王子名曰濡心，",
        "translation": "The seventh prince is called Shanpa, the eighth prince is called Mintu, the ninth prince is called Misu, and the tenth prince is called Mucilinda.",
        "source": "T03n0157_002:0176b04_12"
    },
    {
        "source_sentence": "十一王子名瞢伽奴，十二王子名摩樗滿，十三王子名摩奴摸，十四王子名摩嗟麤滿，",
        "translation": "The names of the eleven princes were Kauṇḍinya; the names of the twelve princes were Mañjuśrī; the names of the thirteen princes were Mañjuśrī; and the names of the fourteen princes were Mañjuśrī.",
        "source": "T03n0157_002:0176b06_13"
    },
    {
        "source_sentence": "十五王子名摩闍奴，十六王子名曰無垢，十七王子名阿闍滿，十八王子名曰無缺，",
        "translation": "The fifteenth prince is called Mājanun; the sixteenth prince is called Vimalakīrti; the seventeenth prince is called Ajātaśatru; and the eighteenth prince is called Acala.",
        "source": "T03n0157_002:0176b08_14"
    },
    {
        "source_sentence": "十九王子名曰義雲，二十王子名曰因陀羅，二十一名尼婆盧，二十二名尼伽珠，",
        "translation": "The names of the nineteen princes were Yiyun; the names of the twenty-one princes were Indra; the names of the twenty-one princes were Nivaloka; the names of the twenty-two princes were Nirgrantha;",
        "source": "T03n0157_002:0176b10_15"
    },
    {
        "source_sentence": "二十三名曰月念，二十四名曰日念，二十五名曰王念，二十六名金剛念，",
        "translation": "Twenty-three are called moon thoughts, twenty-four are called sun thoughts, twenty-five are called king thoughts, and twenty-six are called adamantine thoughts.",
        "source": "T03n0157_002:0176b12_16"
    },
    {
        "source_sentence": "二十七名忍辱念，二十八名曰住念，二十九名曰遠念，三十名曰寶念，",
        "translation": "Twenty-seven names are called mindfulness of tolerance, twenty-eight names are called abiding mindfulness, twenty-nine names are called far-reaching mindfulness, and thirty names are called precious mindfulness.",
        "source": "T03n0157_002:0176b13_17"
    },
    {
        "source_sentence": "三十一名羅睺，三十二名羅睺力，三十三名羅睺質多羅，三十四名羅摩質多羅，",
        "translation": "The thirty-one names are Rāmacitra, the thirty-two names Rāmacitra, the thirty-three names Rāmacitra,",
        "source": "T03n0157_002:0176b15_18"
    },
    {
        "source_sentence": "三十五名曰國財，三十六名曰欲轉，三十七名蘭陀滿，三十八名羅剎盧蘇，",
        "translation": "The thirty-fifth name is state property, the thirty-sixth name is transmutation of desire, the thirty-seventh name is Landa Puṇṇa, and the thirty-eighth name is Rāṣṭrapāla.",
        "source": "T03n0157_002:0176b17_19"
    },
    {
        "source_sentence": "三十九名羅耶輸，四十名炎摩，四十一名夜婆滿，四十二名夜闍盧，四十三名夜磨區，",
        "translation": "The thirty-sixth name is Luoyaśoa, the fortyth name is Yama, the forty-first name is Yavana, the forty-second name is Yajurveda, and the forty-third name is Yamuci.",
        "source": "T03n0157_002:0176b19_20"
    },
    {
        "source_sentence": "四十四名夜墮珠，四十五名夜頗奴，四十六名夜娑奴，四十七名南摩珠帝，",
        "translation": "The forty-fourth name is Yadatta, the forty-fifth name is Yapāṇu, the forty-sixth name is Yaṣānī, and the forty-seventh name is Nanmuci.",
        "source": "T03n0157_002:0176b21_21"
    },
    {
        "source_sentence": "四十八名阿藍遮奴，如是等聖王千子，各各三月，供養如來及比丘僧，",
        "translation": "The forty-eighth name was Ārācanu, and each of these sacred kings had a thousand sons, each three months old, to make offerings to the Tathāgata and the monks.",
        "source": "T03n0157_002:0176b23_22"
    },
    {
        "source_sentence": "一切所須衣服、飲食、臥具、醫藥，亦復皆如第一太子，所奉噠嚫種種之物，",
        "translation": "All the necessities of clothing, food, drink, bedding, and medicine were also like the various things offered to the crown prince as almsfood.",
        "source": "T03n0157_002:0176b24_23"
    },
    {
        "source_sentence": "亦復各各八萬四千。",
        "translation": "Again, there are another 84,000 each.",
        "source": "T03n0157_002:0176b26_24"
    },
    {
        "source_sentence": "因其所施各各發心，或願忉利天王，或求梵王，或求魔王，或求轉輪聖王，",
        "translation": "Their gifts each aroused the aspiration of wishing for the king of Trāyastriṃśa gods, or for the king of Brahmā, or for the king of Māra, or for the wheel-turning sage king.",
        "source": "T03n0157_002:0176b26_25"
    },
    {
        "source_sentence": "或願大富，或求聲聞，是諸王子，其中乃至尚無一人求於緣覺，況求大乘。",
        "translation": "They may wish to be greatly wealthy or seek śrāvakas, but there are princes among them who don't even a single one of them to seek pratyekabuddhas, so why would they seek the great vehicle?",
        "source": "T03n0157_002:0176b28_26"
    },
    {
        "source_sentence": "時轉輪王因布施故，而復還求轉輪王位。",
        "translation": "Because of his generosity, the wheel-turning king then returned to seek the position of wheel-turning king again.",
        "source": "T03n0157_002:0176c01_27"
    },
    {
        "source_sentence": "是時聖王及其千子，如是供養滿二百五十歲，各各向佛及比丘僧悔諸不及。",
        "translation": "The noble king and his thousand sons then thus made offerings for two hundred and fifty years, each facing the Buddha and the monks and repenting of their failures.",
        "source": "T03n0157_002:0176c02_28"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0176c04_29"
    },
    {
        "source_sentence": "時寶海梵志尋往佛所，而白佛言：『唯願如來及比丘僧，滿七歲中受我供養衣服、飲食、臥具、醫藥。』",
        "translation": "The Jewel-Sea Brahman then went to the Buddha and said to him, 'May the Tathāgata and the monks and nuns be allowed to receive my offerings of clothing, food, drink, bedding, and medicine for seven years.'",
        "source": "T03n0157_002:0176c04_30"
    },
    {
        "source_sentence": "爾時，如來默然許可，受梵志請。",
        "translation": "At that point, the Tathāgata remained silent and gave his permission to accept the invitation of the priest.",
        "source": "T03n0157_002:0176c06_31"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0176c07_32"
    },
    {
        "source_sentence": "爾時梵志供養如來及比丘僧所須之物，亦如聖王之所供養。",
        "translation": "It was then that the priest offered support to the Tathāgata and the things needed by the monks and nuns, just as the noble king offered support.",
        "source": "T03n0157_002:0176c07_33"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0176c08_34"
    },
    {
        "source_sentence": "寶海梵志復於後時作如是念：『我今已令百千億那由他眾生，發阿耨多羅三藐三菩提心，",
        "translation": "“At some point later, however, the brahmin Jewel-Sea also had this thought: I have already caused hundreds of thousands of myriads of koṭis of nayutas of sentient beings to give rise to the thought of highest, complete enlightenment.",
        "source": "T03n0157_002:0176c09_35"
    },
    {
        "source_sentence": "然我不知轉輪聖王所願何等，為願人王？",
        "translation": "Still, I don't know what the wheel-turning sage king wishes for, and what he wishes for human kingship.",
        "source": "T03n0157_002:0176c11_36"
    },
    {
        "source_sentence": "天王？",
        "translation": "King of gods?",
        "source": "T03n0157_002:0176c12_37"
    },
    {
        "source_sentence": "聲聞？",
        "translation": "śrāvakas?",
        "source": "T03n0157_002:0176c12_38"
    },
    {
        "source_sentence": "緣覺？",
        "translation": "pratyekabuddha?",
        "source": "T03n0157_002:0176c12_39"
    },
    {
        "source_sentence": "為求阿耨多羅三藐三菩提？",
        "translation": "In order to seek supreme perfect enlightenment?",
        "source": "T03n0157_002:0176c12_40"
    },
    {
        "source_sentence": "若我來世必成阿耨多羅三藐三菩提，度未度者；",
        "translation": "In the future I will surely attain unexcelled complete perfect enlightenment, liberating those who have not been liberated.",
        "source": "T03n0157_002:0176c13_41"
    },
    {
        "source_sentence": "解未解者；",
        "translation": "Those who understand and those who do not understand.",
        "source": "T03n0157_002:0176c14_42"
    },
    {
        "source_sentence": "未離生老病死憂悲苦惱，悉令得離；",
        "translation": "They are not yet free of the sorrow, pain, and vexation of birth, old age, sickness, and death.",
        "source": "T03n0157_002:0176c14_43"
    },
    {
        "source_sentence": "未滅度者，令得滅度。",
        "translation": "Those who haven't yet been liberated are made to attain liberation.",
        "source": "T03n0157_002:0176c15_44"
    },
    {
        "source_sentence": "定如是者，我於夜臥，當有諸天魔梵、諸龍及夜叉等，諸佛世尊、聲聞沙門、婆羅門等，",
        "translation": "If I were to lie down at night, there would be gods, Māra, Brahmā, nāgas, yakṣas, buddhas, world-honored ones, śrāvakas, śramaṇas, brāhmaṇas, and so forth.",
        "source": "T03n0157_002:0176c16_0"
    },
    {
        "source_sentence": "為我現夢說此聖王之所志求，為求人王？",
        "translation": "Is it because I'm telling this noble king what he wants in my present dream, or is it to solicit the king?",
        "source": "T03n0157_002:0176c17_1"
    },
    {
        "source_sentence": "為求天王？",
        "translation": "In order to seek heavenly kings?",
        "source": "T03n0157_002:0176c18_2"
    },
    {
        "source_sentence": "為求聲聞、辟支佛乘、阿耨多羅三藐三菩提耶？』",
        "translation": "Is it to seek the śrāvaka, pratyekabuddha vehicle, and unsurpassed, correct enlightenment?'",
        "source": "T03n0157_002:0176c19_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0176c20_4"
    },
    {
        "source_sentence": "時寶海梵志於睡眠中見有光明，因此光故，即見十方如恒河沙等諸世界中在在處處諸佛世尊。",
        "translation": "At the time, the Jewel-Sea Brahman priest saw a light in his sleep, and because of that light, he saw worlds in the ten directions like the sands of the Ganges in all their worlds, where there were buddhas and world-honored ones everywhere.",
        "source": "T03n0157_002:0176c20_5"
    },
    {
        "source_sentence": "彼諸世尊各各遙以微妙好華，與此梵志。",
        "translation": "Each of those world-honored ones gave this priest a subtle and beautiful flower from a distance to him.",
        "source": "T03n0157_002:0176c22_6"
    },
    {
        "source_sentence": "其華臺中見日輪像，於日輪上各各悉有七寶妙蓋，一一日輪各各皆出六十億光，",
        "translation": "On each of the sun-wheels were beautiful canopies made of the seven kinds of jewels. Each sun-wheel emitted sixty million rays of light a day.",
        "source": "T03n0157_002:0176c23_7"
    },
    {
        "source_sentence": "是諸光明皆悉來入梵志口中。",
        "translation": "These lights all came into the mouth of the priest.",
        "source": "T03n0157_002:0176c25_8"
    },
    {
        "source_sentence": "自見其身滿千由旬，淨無垢穢，譬如明鏡。",
        "translation": "He saw for himself that his body, one thousand yojanas in circumference, was pure and spotless like a clear mirror.",
        "source": "T03n0157_002:0176c26_9"
    },
    {
        "source_sentence": "見其腹內有六十億那由他百千菩薩，在蓮華上結加趺坐三昧正受。",
        "translation": "Within his belly, he saw sixty billion nayutas and hundreds of thousands of bodhisattvas sitting cross-legged on top of the lotus flower in samādhi and meditating.",
        "source": "T03n0157_002:0176c27_10"
    },
    {
        "source_sentence": "復見日鬘圍遶其身，於諸華中出諸伎樂，踰於天樂。",
        "translation": "He also saw the sun surrounded his body, and from the flowers came forth music that surpassed heavenly music.",
        "source": "T03n0157_002:0176c29_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0177a01_12"
    },
    {
        "source_sentence": "爾時梵志又見其王血污其身，四方馳走，面首似猪，噉種種蟲。",
        "translation": "The priest then saw that the king's blood defiled his body, running in all four directions, his face and head looking like a pig, and he was feeding on various insects.",
        "source": "T03n0157_002:0177a01_13"
    },
    {
        "source_sentence": "既噉蟲已，坐伊蘭樹下，有無量眾生來食其身，唯有骨鎖。",
        "translation": "Innumerable sentient beings came and ate their bodies, leaving only the chain of bones behind them.",
        "source": "T03n0157_002:0177a03_14"
    },
    {
        "source_sentence": "捨骨鎖已，數數受身，亦復如是。",
        "translation": "The same applies up to the one who has abandoned the chain of bones and receives a body repeatedly.",
        "source": "T03n0157_002:0177a04_15"
    },
    {
        "source_sentence": "於是復見諸王子等，或作猪面，或作象面，或水牛面，或師子面，或狐狼豹面，",
        "translation": "Then they saw princes and so forth, some with piglike faces, some with elephant-faces, some with water ox-faces, some with lion-faces, some with fox-faces, wolf-faces, or cherub-faces.",
        "source": "T03n0157_002:0177a05_16"
    },
    {
        "source_sentence": "或獼猴面，以血污身，亦各皆噉無量眾生，坐伊蘭樹下，復有無量眾生來食其身，",
        "translation": "Or the face of a rhesus monkey defiles its body with blood, and each feeds on an infinite number of sentient beings.",
        "source": "T03n0157_002:0177a07_17"
    },
    {
        "source_sentence": "乃至骨鎖，離骨鎖已，數數受身，亦復如是。",
        "translation": "The same applies up to the chain of bones. After being free from the chain of bones, one repeatedly experiences a body again and again:",
        "source": "T03n0157_002:0177a09_18"
    },
    {
        "source_sentence": "或見王子須曼那華以作瓔珞，載小弊車駕以水牛，從不正道南向馳走。",
        "translation": "Or they may see the prince, wearing a necklace made of sramana flowers and carrying a small chariot drawn by a water buffalo, running southward from the wrong path.",
        "source": "T03n0157_002:0177a10_19"
    },
    {
        "source_sentence": "復見四天大王、釋提桓因、大梵天王來至其所，告梵志言：『汝今四邊所有蓮華，",
        "translation": "Again, he saw the great kings of the four heavenly kings, Indra and Brahmā coming to him. He said to the brahmā god Brahmā, “Your majesty, what kind of lotus flowers are you holding on these four sides?",
        "source": "T03n0157_002:0177a11_20"
    },
    {
        "source_sentence": "應先取一華與轉輪王。",
        "translation": "You should first take one flower and give it to the wheel-turning king.",
        "source": "T03n0157_002:0177a13_21"
    },
    {
        "source_sentence": "一一王子各與一華，其餘諸華與諸小王，次與汝子并及餘人。』",
        "translation": "Each prince gave one flower, the other flowers to the small kings, and then you, your child, and the others.'",
        "source": "T03n0157_002:0177a14_22"
    },
    {
        "source_sentence": "梵志得聞如是語已，即如其言，悉取賦之。",
        "translation": "When the priest heard these words, he did as he said and gave them all to him.",
        "source": "T03n0157_002:0177a15_23"
    },
    {
        "source_sentence": "如是夢已忽然而寤，從臥起坐，憶念夢中所見諸事，尋時得知轉輪聖王所願卑下，",
        "translation": "In the same way, after this dream he suddenly awakened from his bed and remembered all the things he had seen in that dream. At that moment he learned of the inferiority of the wishes of the universal ruler:",
        "source": "T03n0157_002:0177a16_24"
    },
    {
        "source_sentence": "愛樂生死，貪著世樂。",
        "translation": "They love birth and death and cling to worldly pleasures.",
        "source": "T03n0157_002:0177a18_25"
    },
    {
        "source_sentence": "我今復知：『諸王子中或有所願卑小下劣，以諸王子有發心求聲聞乘者故，",
        "translation": "Again, I know that some of the princes may have inferior aspirations or inferior aspirations. It is because there are those among the princes who desire the vehicle of the śrāvakas.",
        "source": "T03n0157_002:0177a19_26"
    },
    {
        "source_sentence": "我夢見須曼那華以作瓔珞，載水牛車於不正道南向馳走。",
        "translation": "In a dream, I saw the flower of Samantabhadra made into a necklace and carried it on a water ox cart to the south of an impure path.",
        "source": "T03n0157_002:0177a21_27"
    },
    {
        "source_sentence": "我何緣故，昨夜夢中見大光明，及見十方無量世界，在在處處諸佛世尊，",
        "translation": "“World-honored One, why did I see a great ray of light in my dream last night? And why did I see all the buddhas and world-honored ones everywhere in the infinite worlds of the ten directions.",
        "source": "T03n0157_002:0177a22_28"
    },
    {
        "source_sentence": "以我先教閻浮提內無量眾生，悉令安住三福處故。",
        "translation": "It's because I first taught measureless sentient beings inside Jambudvīpa to all abide in the three abodes of merit.",
        "source": "T03n0157_002:0177a24_29"
    },
    {
        "source_sentence": "是故於夢得見光明，及見十方無量世界，在在處處諸佛世尊，以我教勅閻浮提內一切眾生，",
        "translation": "“Furthermore, the buddhas and world-honored ones who saw their light in those dreams and also saw infinite worlds in the ten directions, wherever they were, taught by me to all sentient beings of Jambudvfpa.",
        "source": "T03n0157_002:0177a25_30"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心。",
        "translation": "He arouses the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0177a27_31"
    },
    {
        "source_sentence": "請寶藏佛及比丘僧，足滿七歲奉諸所安，是以夢中見十方諸佛與我蓮華。",
        "translation": "He invited the jeweled treasury buddha and the monks, who were seven years old when their feet were full, to present them with lotus flowers to me.",
        "source": "T03n0157_002:0177a28_32"
    },
    {
        "source_sentence": "以我發阿耨多羅三藐三菩提心故，是以夢見十方諸佛與我寶蓋。",
        "translation": "Because I gave rise to the mind of unsurpassed, correct, and complete enlightenment, I dreamt that the buddhas of the ten directions gave me the jeweled canopy.",
        "source": "T03n0157_002:0177b01_33"
    },
    {
        "source_sentence": "如我所見蓮華臺中見日輪像，有無量光明入我口中，及見大身滿千由旬，",
        "translation": "And just as I see the reflection of the sun in the lotus flower dais, so also do I see it in my mouth with an infinite ray of light.",
        "source": "T03n0157_002:0177b02_34"
    },
    {
        "source_sentence": "七寶蓋上以日為飾，及見腹中有六十億百千菩薩，在蓮華上結加趺坐，",
        "translation": "On the seven-jeweled canopy he adorned himself with the sun and saw sixty billions of hundreds of thousands of bodhisattvas sitting cross-legged on lotus blossoms in his belly.",
        "source": "T03n0157_002:0177b04_35"
    },
    {
        "source_sentence": "三昧正受。",
        "translation": "Samādhi is correctly received.",
        "source": "T03n0157_002:0177b06_36"
    },
    {
        "source_sentence": "時梵天王所可教勅賦諸蓮華，如是等夢非我所解，唯有如來乃能解之，",
        "translation": "At that time the lord of Brahmā was able to teach and command all kinds of lotus blossoms, but such dreams are not something I can understand. Only the Tathāgata can understand them.",
        "source": "T03n0157_002:0177b06_37"
    },
    {
        "source_sentence": "我今當往至世尊所，問其所以。",
        "translation": "Now, I will go to the Bhagavān and ask him why.",
        "source": "T03n0157_002:0177b08_38"
    },
    {
        "source_sentence": "何因緣故見是諸事？』",
        "translation": "What are the causes and conditions for seeing these things?'",
        "source": "T03n0157_002:0177b09_39"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0177b09_40"
    },
    {
        "source_sentence": "爾時，寶海梵志過夜清旦，即至佛所，飲食以辦，自行澡水，手自斟酌上妙餚饌。",
        "translation": "It was then that the brahmin Jewel-Sea went to the Buddha at dawn after the night had passed. He prepared food and drink for the sake of the Buddha, poured water on his own, and served a delicious meal with his own hands.",
        "source": "T03n0157_002:0177b09_41"
    },
    {
        "source_sentence": "食已行水収舉鉢訖，即於一面坐卑小床，欲聽妙法。",
        "translation": "After he had eaten, he went to the water and collected his bowl. He sat cross-legged on a small seat at one side with the intention of listening to the wonderful Dharma.",
        "source": "T03n0157_002:0177b11_42"
    },
    {
        "source_sentence": "爾時，聖王及其千子無量無邊百千大眾，出安周羅城恭敬圍遶向閻浮園，",
        "translation": "At that time the holy king and his thousand princes, accompanied by an immeasurable assembly of hundreds of thousands of myriads of bodhisattvas, left the city of Anāthapiṇḍada and proceeded on their way to Jambudvīpa.",
        "source": "T03n0157_002:0177b12_43"
    },
    {
        "source_sentence": "到園外已，如法下車步至佛所，頭面禮佛及比丘僧，在佛前坐為欲聽法。",
        "translation": "After arriving outside the park, he went to the Buddha in accordance with the teaching, dismounted from his chariot and walked up to him. He bowed his forehead to the Buddha and the monks and sat down before the Buddha to listen to the Dharma.",
        "source": "T03n0157_002:0177b14_44"
    },
    {
        "source_sentence": "爾時，梵志如夢中所見具向佛說。",
        "translation": "At the time, the priest explained it to the Buddha as he saw it in a dream.",
        "source": "T03n0157_002:0177b16_45"
    },
    {
        "source_sentence": "「佛告梵志：『汝夢所見有大光明，十方無量如恒河沙等諸世界中，在在處處諸佛世尊與汝蓮華，",
        "translation": "“The Buddha said to the brāhmaṇa: In that dream you saw a great ray of light as infinite as the number of grains of sand in the Ganges River in all ten directions, reaching everywhere like the polar mountain.",
        "source": "T03n0157_002:0177b17_46"
    },
    {
        "source_sentence": "於華臺中有日輪像，大光入口，以汝先於二百五十年中，教閻浮提內無量眾生，",
        "translation": "On the flower pedestal there is an image of the sun in the circumference, with its entrance endowed with a great ray of light. For two hundred and fifty years you have been teaching immeasurable sentient beings throughout Jambudvlpa:",
        "source": "T03n0157_002:0177b19_47"
    },
    {
        "source_sentence": "令住三福處，復令無量眾生發阿耨多羅三藐三菩提心。",
        "translation": "It causes them to abide in the three abodes of merit and also causes measureless sentient beings to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0177b21_48"
    },
    {
        "source_sentence": "於今復作如是大施，供養如來及比丘僧，以是故十方諸佛授汝阿耨多羅三藐三菩提記，",
        "translation": "Because of this, the buddhas of the ten directions have granted you the assurance of highest, complete enlightenment.",
        "source": "T03n0157_002:0177b22_49"
    },
    {
        "source_sentence": "十方如恒河沙等諸佛世尊現在說法，與汝蓮華，銀莖金葉，琉璃為鬚，",
        "translation": "The buddhas of the ten directions, as numerous as the grains of sand in the Ganges River, are presently expounding the Dharma. Give me these lotus blossoms with silver stems and golden leaves, their beards made of lapis lazuli.",
        "source": "T03n0157_002:0177b24_50"
    },
    {
        "source_sentence": "馬瑙為[革*茸]，蓮華臺中有日輪像，如是等事皆是汝之受記相貌。",
        "translation": "The agate is [leather*grasps], and the sun-wheel image on the lotus dais contains the sun. All these things are your marks of receiving the prediction.",
        "source": "T03n0157_002:0177b26_51"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0177b27_52"
    },
    {
        "source_sentence": "汝夢所見十方如恒河沙等諸世界中，在在處處諸佛世尊現在說法，彼諸世尊所可與汝七寶妙蓋，",
        "translation": "In the ten directions, as many worlds as there are grains of sand in the Ganges River in all those buddha-fields that you saw in your dream, wherever these buddhas and world-honored ones were teaching the Dharma, those world-honored ones will be able to give you this wonderful seven-jeweled canopy.",
        "source": "T03n0157_002:0177b27_53"
    },
    {
        "source_sentence": "蓋上莊飾至梵天者，汝於來世，當於夜分成阿耨多羅三藐三菩提，即於其夜有大名稱，",
        "translation": "In the future you will attain unexcelled, perfect enlightenment on that night. That night you will have great fame and renown.",
        "source": "T03n0157_002:0177c01_54"
    },
    {
        "source_sentence": "遍滿十方如恒河沙等諸世界中上至梵天，當得無見頂相無能過者，即是汝之成道初相。",
        "translation": "Pervading the worlds in the ten directions like the sands of the Ganges River and so forth up to the Brahma heavens, you'll attain the first sign of your accomplishment of enlightenment that has no visible topknot and nothing beyond it.",
        "source": "T03n0157_002:0177c03_55"
    },
    {
        "source_sentence": "汝夢見大身又見日鬘而自圍遶者，汝於來世成阿耨多羅三藐三菩提已，",
        "translation": "In that dream you saw a great body, surrounded by the sun and the moon. Having attained unexcelled, perfect enlightenment in the future,",
        "source": "T03n0157_002:0177c05_56"
    },
    {
        "source_sentence": "汝先所可於閻浮提內教無量眾生，令發阿耨多羅三藐三菩提心者，亦當同時於十方如微塵等世界之中，",
        "translation": "If you had previously taught innumerable sentient beings within Jambudvfpa to give rise to the mind of unexcelled, complete perfect enlightenment, you would also have simultaneously manifested it in as many worlds as atoms in the ten directions.",
        "source": "T03n0157_002:0177c07_57"
    },
    {
        "source_sentence": "成阿耨多羅三藐三菩提，亦皆各各發此讚言：「我於往昔為寶海梵志之所勸化，",
        "translation": "Having attained anuttarii samyaksarrzbodhi, each of them also praised it, saying, “In the past I was encouraged and inspired by a priest named Jewel-Sea.",
        "source": "T03n0157_002:0177c10_0"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心，是故我等今日，悉成阿耨多羅三藐三菩提。",
        "translation": "Because they have aroused the mind of unsurpassed, correct, and complete enlightenment, today we all attain unexcelled, correct, and complete enlightenment.",
        "source": "T03n0157_002:0177c11_1"
    },
    {
        "source_sentence": "某甲世尊，即是我之真善知識。」",
        "translation": "Bhagavān, this is the true good friend of mine.",
        "source": "T03n0157_002:0177c13_2"
    },
    {
        "source_sentence": "爾時，諸佛各各自遣諸大菩薩，為供養汝故。",
        "translation": "At that point, the buddhas each sent great bodhisattvas to make offerings to you.",
        "source": "T03n0157_002:0177c14_3"
    },
    {
        "source_sentence": "諸菩薩等，以先所得己佛世界種種自在師子遊戲神足變化而以供養。",
        "translation": "The bodhisattvas and so forth, they'll make offerings with the various kinds of self-contained lions who play with miraculous powers and transform themselves in their own buddha worlds that they've previously attained.",
        "source": "T03n0157_002:0177c15_4"
    },
    {
        "source_sentence": "爾時諸菩薩種種供養已，於彼聽法，得陀羅尼三昧忍辱。",
        "translation": "After they had made various offerings, the bodhisattvas listened to the teaching and attained the forbearance of dhāraṇī samādhi.",
        "source": "T03n0157_002:0177c16_5"
    },
    {
        "source_sentence": "是諸菩薩聽受法已各還本土，向佛世尊稱說汝國所有諸事。",
        "translation": "After listening to the teaching, each of these bodhisattvas returned to their native land and told the Bhagavān Buddha about all the affairs of your country.",
        "source": "T03n0157_002:0177c18_6"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0177c19_7"
    },
    {
        "source_sentence": "如是夢事，皆是汝之成道相貌。",
        "translation": "Such dreams and such things are all the features of your attainment of enlightenment.",
        "source": "T03n0157_002:0177c19_8"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0177c20_9"
    },
    {
        "source_sentence": "汝所夢見於其腹內有無量億諸大菩薩，在蓮華上結加趺坐三昧正受者，",
        "translation": "In that dream you saw in your belly countless hundreds of millions of great bodhisattvas sitting cross-legged on lotus blossoms, absorbed in concentration.",
        "source": "T03n0157_002:0177c20_10"
    },
    {
        "source_sentence": "汝於來世成阿耨多羅三藐三菩提已，復當勸化無量億萬百千眾生，令不退於阿耨多羅三藐三菩提。",
        "translation": "In the future, after you attain unsurpassed, correct, and complete enlightenment, you'll also encourage measureless millions of millions of sentient beings to cultivate themselves so that they won't regress from unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0177c22_11"
    },
    {
        "source_sentence": "汝入無上般涅槃已，其後未來之世，當有十方世界無量諸佛法王世尊，",
        "translation": "World-Honored One, you have entered the peerless liberation. In the future there will be innumerable buddha-dharma kings and world-honored ones of all buddha-fields in the ten directions.",
        "source": "T03n0157_002:0177c25_0"
    },
    {
        "source_sentence": "亦當稱汝名字作如是言：「過去微塵數等大劫有某甲佛，是佛世尊勸化我等，",
        "translation": "You should also call yourself by that name and make the following statement, “There was a certain buddha in the past as many great kalpas ago as atoms in the polar mountain:",
        "source": "T03n0157_002:0177c26_1"
    },
    {
        "source_sentence": "安住於阿耨多羅三藐三菩提令不退轉，是故我等今成阿耨多羅三藐三菩提作正法王。」",
        "translation": "They abide in unsurpassed, correct, and complete enlightenment so that they don't regress; therefore, we now become unsurpassed, correct, and complete enlightenment as the king of the right teaching.",
        "source": "T03n0157_002:0177c28_2"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0178a01_3"
    },
    {
        "source_sentence": "如是等夢皆是汝之成道相貌。",
        "translation": "All these dreams and so forth are the appearance of your attainment of enlightenment.",
        "source": "T03n0157_002:0178a01_4"
    },
    {
        "source_sentence": "「『梵志！",
        "translation": "'Brahmin!",
        "source": "T03n0157_002:0178a02_5"
    },
    {
        "source_sentence": "汝夢所見人形猪面，乃至獼猴面，以血污身，噉種種蟲已，坐伊蘭樹下，",
        "translation": "In that dream you saw the human form with a pore like a pig, or even the face of a rhesus monkey. Covering your body with blood and feeding on various kinds of insects, you sat under an iran tree.",
        "source": "T03n0157_002:0178a02_6"
    },
    {
        "source_sentence": "無量眾生唼食其身乃至骨瑣，離骨瑣已數數受身者，有諸癡人住三福處，",
        "translation": "Countless sentient beings devour their bodies, up to the smallest pieces of bone. Those who are free from the smallest pieces of bone and who receive bodies repeatedly after they have been liberated - those with delusion abide in the three spheres of merit.",
        "source": "T03n0157_002:0178a04_7"
    },
    {
        "source_sentence": "所謂布施、調伏、善攝身口。",
        "translation": "It's called generosity, discipline, and well-contained body and speech.",
        "source": "T03n0157_002:0178a06_8"
    },
    {
        "source_sentence": "如是人等，當生魔天，有退沒苦；",
        "translation": "Such people will be reborn in the realm of Māra and experience the pain of falling back.",
        "source": "T03n0157_002:0178a06_9"
    },
    {
        "source_sentence": "若生人中，受生老病死憂悲苦惱、愛別離苦、怨憎會苦、所求不得苦；",
        "translation": "When they are born among humans, they experience the suffering of birth, old age, sickness, death, sorrow, pain, grief, separation from loved ones, the suffering of association with those who dislike them, and the suffering of not getting what one wishes.",
        "source": "T03n0157_002:0178a07_10"
    },
    {
        "source_sentence": "生餓鬼中，受飢渴苦；",
        "translation": "They are born in the realm of hungry ghosts and suffer from hunger and thirst.",
        "source": "T03n0157_002:0178a09_11"
    },
    {
        "source_sentence": "生畜生中，無明黑闇有斷頭苦；",
        "translation": "When they are born in the realm of animals there is ignorance, darkness, and blackness.",
        "source": "T03n0157_002:0178a09_12"
    },
    {
        "source_sentence": "生地獄中，受種種苦。",
        "translation": "They'll be born in hell and experience various kinds of suffering.",
        "source": "T03n0157_002:0178a10_13"
    },
    {
        "source_sentence": "欲得不離如是諸苦，是故安住修三福處。",
        "translation": "Because they want to attain it and aren't free of such suffering, they therefore abide in the cultivation of the three places of merit.",
        "source": "T03n0157_002:0178a11_14"
    },
    {
        "source_sentence": "願求天王、轉輪聖王，或欲主領一四天下，乃至主領四四天下，如是癡人食一切眾生，",
        "translation": "May they seek heavenly kings and universal ruler, or may they wish to rule over one of the four continents, or up to govern all four continents. Such ignorant people eat all sentient beings.",
        "source": "T03n0157_002:0178a12_15"
    },
    {
        "source_sentence": "是眾生等復當還食如是癡人。",
        "translation": "These sentient beings and so forth will then return to eat such a deluded person.",
        "source": "T03n0157_002:0178a14_16"
    },
    {
        "source_sentence": "如是展轉，行於生死不可得量。",
        "translation": "In this way, they proceed in such a succession that the number of births and deaths cannot be measured.",
        "source": "T03n0157_002:0178a14_17"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0178a15_18"
    },
    {
        "source_sentence": "如是夢者，即是久受生死之相貌也。",
        "translation": "Such a dream is the appearance of being subject to birth and death for a long time.",
        "source": "T03n0157_002:0178a15_19"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0178a16_20"
    },
    {
        "source_sentence": "汝夢所見有諸人等，須曼那華以作瓔珞，載小弊車駕以水牛，於不正道南向馳走。",
        "translation": "You saw in your dream that there were people like you who made a necklace of samāṇa flowers, carried small and ugly carts, drove water buffaloes, and chased themselves south on the wrong path.",
        "source": "T03n0157_002:0178a16_21"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0178a18_22"
    },
    {
        "source_sentence": "即是安住於三福事，能自調伏令得寂靜，向聲聞乘者之相貌也。』",
        "translation": "That is, it's the appearance of someone who abides peacefully in the three meritorious things and can subdue themselves so that they attain quiescence and turn to the śrāvaka vehicle.'",
        "source": "T03n0157_002:0178a18_23"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0178a20_24"
    },
    {
        "source_sentence": "爾時寶海梵志白轉輪王言：『大王當知，人身難得。",
        "translation": "It was then that the priest Jeweled Ocean said to the wheel-turning king, 'Great king, you should know that a human body is difficult to obtain.",
        "source": "T03n0157_002:0178a20_25"
    },
    {
        "source_sentence": "王今已得成就無難，諸佛世尊出世甚難，過優曇華，調善欲心及作善願，",
        "translation": "Now that the king has attained accomplishment, it is not difficult. The buddhas, world-honored ones, who appear in the world with great difficulty, go beyond the udumbara flowers and tame their minds with good desires and make good vows.",
        "source": "T03n0157_002:0178a21_26"
    },
    {
        "source_sentence": "乃復甚難。",
        "translation": "It's also very difficult.",
        "source": "T03n0157_002:0178a23_27"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0157_002:0178a23_28"
    },
    {
        "source_sentence": "今者若願天人，即是苦本。",
        "translation": "Now, if we wish for gods and humans, that's the root of suffering.",
        "source": "T03n0157_002:0178a23_29"
    },
    {
        "source_sentence": "若欲得主一四天下及二三四，亦是苦本，輪轉生死。",
        "translation": "If someone wants to attain the lord of one of the four realms under heavens and two or three, they're also the source of suffering, which transmigrates through birth and death.",
        "source": "T03n0157_002:0178a24_30"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0157_002:0178a25_31"
    },
    {
        "source_sentence": "若生人、天，皆是無常無決定相，猶如疾風，其人貪著樂於五欲，心不厭足，",
        "translation": "If one were to be born human or divine, they would all be impermanent and without definite characteristics, just like a sudden wind. That person is addicted to the pleasure of the five desires and will not tire of satisfying them.",
        "source": "T03n0157_002:0178a25_32"
    },
    {
        "source_sentence": "猶如小兒見水中月。",
        "translation": "It's like a small child who sees the moon in water.",
        "source": "T03n0157_002:0178a27_33"
    },
    {
        "source_sentence": "若有願求在天人中受放逸樂，其人數數墮於地獄受無量苦；",
        "translation": "If one wishes to experience the bliss of heedlessness among gods and humans, he or she will fall into hell innumerable times and suffer immeasurable pain.",
        "source": "T03n0157_002:0178a28_34"
    },
    {
        "source_sentence": "若生人中，受愛別離苦、怨憎會苦；",
        "translation": "When born among humans, they experience the pain of separation from loved ones and the pain of encountering enemies and haters.",
        "source": "T03n0157_002:0178a29_35"
    },
    {
        "source_sentence": "若生天上有退沒苦，當復數數有受胎苦，復有種種互相食噉奪命之苦。",
        "translation": "If they're born in heaven, there's the pain of falling back and forth, which will repeatedly experience the pain of being born in the womb, and there's the pain of various kinds of mutual food and drink that take away their lives.",
        "source": "T03n0157_002:0178b01_36"
    },
    {
        "source_sentence": "癡如嬰兒心不知厭。",
        "translation": "Foolishness is like an infant whose mind doesn't know disillusionment.",
        "source": "T03n0157_002:0178b03_37"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0157_002:0178b03_38"
    },
    {
        "source_sentence": "離善知識故，不作善願故，不行精進故，應得者不得故，應解者不解故，",
        "translation": "Because they are free from the spiritual benefactors, because they do not make good vows, because they do not practice zealous effort, because those who should acquire it will not attain it and those who should understand will not understand.",
        "source": "T03n0157_002:0178b03_39"
    },
    {
        "source_sentence": "應證者不證故，癡如嬰兒無所識別。",
        "translation": "Because those who should realize it don't realize it, delusion is like a baby with no discrimination.",
        "source": "T03n0157_002:0178b05_40"
    },
    {
        "source_sentence": "唯菩提心能離諸苦，無有遺餘而反生厭；",
        "translation": "Only the will for enlightenment can be freed from all sufferings, and there is nothing left to become disillusioned with.",
        "source": "T03n0157_002:0178b06_41"
    },
    {
        "source_sentence": "世間生死，數數受苦，而更甘樂，遂令諸苦轉復增長。",
        "translation": "Birth and death in the world are repeatedly subject to suffering, yet they become more pleasant and cause suffering to grow again and again.",
        "source": "T03n0157_002:0178b07_42"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0157_002:0178b08_43"
    },
    {
        "source_sentence": "今當思惟生死有如是等種種諸苦。",
        "translation": "Now, you should contemplate that birth and death have various kinds of suffering like this.",
        "source": "T03n0157_002:0178b08_44"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0157_002:0178b09_45"
    },
    {
        "source_sentence": "今者已供養佛，已種善根，是故於三寶中應生深信。",
        "translation": "Now that they've made offerings to the Buddha and planted good roots, they should therefore give rise to deep faith in the Three Treasures.",
        "source": "T03n0157_002:0178b09_46"
    },
    {
        "source_sentence": "大王當知，先所供養佛世尊者，即是來世大富之因；",
        "translation": "Great king, you should know that the former offerings made to the Buddha, the world-honored one, are the cause of great prosperity in future lives.",
        "source": "T03n0157_002:0178b11_47"
    },
    {
        "source_sentence": "愛護禁戒，即是來世人天中因；",
        "translation": "Being fond of protecting the precepts is the cause among humans and gods in future ages.",
        "source": "T03n0157_002:0178b12_48"
    },
    {
        "source_sentence": "今者聽法，即是來世智慧因也。",
        "translation": "Now, listening to the teaching is the cause of wisdom in future lives.",
        "source": "T03n0157_002:0178b13_49"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0157_002:0178b13_50"
    },
    {
        "source_sentence": "今者已得成就如是等事，應發阿耨多羅三藐三菩提心。』",
        "translation": "Now that such things have been accomplished, you should give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0178b13_51"
    },
    {
        "source_sentence": "「時，王答言梵志：『我今不用如是菩提，我心今者愛樂生死。",
        "translation": "The king then answered, saying to the priest, 'Now that I don't need such an enlightenment, my mind now longs for birth and death.",
        "source": "T03n0157_002:0178b15_52"
    },
    {
        "source_sentence": "以是緣故，布施、持戒、聽受妙法。",
        "translation": "Because of these causes and conditions, they give alms, observe precepts, and listen to the wonderful Dharma.",
        "source": "T03n0157_002:0178b16_53"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0178b17_54"
    },
    {
        "source_sentence": "無上菩提甚深難得。』",
        "translation": "The unsurpassed enlightenment is profound and difficult to attain.'",
        "source": "T03n0157_002:0178b17_55"
    },
    {
        "source_sentence": "「是時，梵志復白大王：『是道清淨，應當一心具足願求。",
        "translation": "At that point, the priest again said to the great king, 'This path is pure, so you should singlemindedly fulfill your vow.",
        "source": "T03n0157_002:0178b18_56"
    },
    {
        "source_sentence": "是道無濁，心清淨故。",
        "translation": "This path is without turbidity because the mind is pure.",
        "source": "T03n0157_002:0178b19_57"
    },
    {
        "source_sentence": "是道正直，無諂曲故。",
        "translation": "This path is straightforward, because there's no flattery.",
        "source": "T03n0157_002:0178b19_58"
    },
    {
        "source_sentence": "是道鮮白，離煩惱故。",
        "translation": "This path is pure and white because it's free of afflictions.",
        "source": "T03n0157_002:0178b20_59"
    },
    {
        "source_sentence": "是道廣大，無障閡故。",
        "translation": "This path is vast because there are no obstacles or hindrances.",
        "source": "T03n0157_002:0178b20_60"
    },
    {
        "source_sentence": "是道含受，多思惟故。",
        "translation": "This path contains feeling, because it's often contemplated.",
        "source": "T03n0157_002:0178b21_61"
    },
    {
        "source_sentence": "是道無畏，不行諸惡故。",
        "translation": "This path is fearless because it doesn't practice bad things.",
        "source": "T03n0157_002:0178b21_62"
    },
    {
        "source_sentence": "是道大富，行檀波羅蜜故。",
        "translation": "It's the great wealth of the path because it practices the perfection of giving.",
        "source": "T03n0157_002:0178b22_63"
    },
    {
        "source_sentence": "是道清淨，行尸羅波羅蜜故。",
        "translation": "This path is pure because it practices the śīla-pāramitā.",
        "source": "T03n0157_002:0178b22_64"
    },
    {
        "source_sentence": "是道無我，行羼提波羅蜜故。",
        "translation": "This path has no self because it practices the perfection of kṣatriya.",
        "source": "T03n0157_002:0178b23_65"
    },
    {
        "source_sentence": "是道不住，行毘梨耶波羅蜜故。",
        "translation": "This path doesn't abide, which is because it practices the pārājika-pāramitā.",
        "source": "T03n0157_002:0178b24_66"
    },
    {
        "source_sentence": "是道不亂，行禪波羅蜜故。",
        "translation": "It's because the path isn't disturbed, and it's because they practice the perfection of meditation.",
        "source": "T03n0157_002:0178b25_67"
    },
    {
        "source_sentence": "是道善擇，行般若波羅蜜故。",
        "translation": "This path is well-discriminated because it practices the perfection of prajñā.",
        "source": "T03n0157_002:0178b25_68"
    },
    {
        "source_sentence": "是道乃是真實智慧之所至處，行大慈故。",
        "translation": "This path is the destination of true wisdom, because it practices great kindness.",
        "source": "T03n0157_002:0178b26_69"
    },
    {
        "source_sentence": "是道不退，行大悲故。",
        "translation": "This is the path that doesn't regress because it practices great compassion.",
        "source": "T03n0157_002:0178b27_70"
    },
    {
        "source_sentence": "是道歡喜，行大喜故。",
        "translation": "This path is rejoicing because it's the practice of great joy.",
        "source": "T03n0157_002:0178b27_71"
    },
    {
        "source_sentence": "是道堅牢，行大捨故。",
        "translation": "This path is firm because it practices great relinquishment.",
        "source": "T03n0157_002:0178b28_72"
    },
    {
        "source_sentence": "是道無刺棘，常遠離欲恚惱覺故。",
        "translation": "This path has no thorns or thorns, because it's always free of feelings of desire and anger.",
        "source": "T03n0157_002:0178b28_73"
    },
    {
        "source_sentence": "是道安隱，心無障閡故。",
        "translation": "This path is peaceful because the mind has no obstructions or hindrances.",
        "source": "T03n0157_002:0178b29_74"
    },
    {
        "source_sentence": "是道無賊，分別色、聲、香、味、觸故。",
        "translation": "This path has no thief, because it discriminates form, sound, odor, taste, and touch.",
        "source": "T03n0157_002:0178c01_75"
    },
    {
        "source_sentence": "是道壞魔，善分別陰、入、界故。",
        "translation": "This path destroys Māra because it skillfully discerns the aggregates, sense-fields, and elements.",
        "source": "T03n0157_002:0178c01_76"
    },
    {
        "source_sentence": "是道離魔，斷諸結故。",
        "translation": "This path is free of Māra, because it ends the bonds.",
        "source": "T03n0157_002:0178c02_77"
    },
    {
        "source_sentence": "是道妙勝，離聲聞、緣覺所思惟故。",
        "translation": "This path is marvelously superior because it's free of what śrāvakas and pratyekbuddhas contemplate.",
        "source": "T03n0157_002:0178c03_78"
    },
    {
        "source_sentence": "是道遍滿，一切諸佛所受持故。",
        "translation": "This path is pervasive because it's received and maintained by all the buddhas.",
        "source": "T03n0157_002:0178c03_79"
    },
    {
        "source_sentence": "是道珍寶，一切智慧故。",
        "translation": "This is the treasure of the Way, because it's the treasure of all wisdom.",
        "source": "T03n0157_002:0178c04_80"
    },
    {
        "source_sentence": "是道明淨，智慧光明無障閡故。",
        "translation": "This path is luminous and pure because the light of wisdom is unobstructed.",
        "source": "T03n0157_002:0178c05_81"
    },
    {
        "source_sentence": "是道善說，為善知識之所護故。",
        "translation": "This path is well explained because it's guarded by a good teacher.",
        "source": "T03n0157_002:0178c05_82"
    },
    {
        "source_sentence": "是道平等，斷愛憎故。",
        "translation": "This path is equal because it stops craving and hatred.",
        "source": "T03n0157_002:0178c06_83"
    },
    {
        "source_sentence": "是道無塵，離恚穢忿怒故。",
        "translation": "This path is without dust, because it's free of defilement and wrath.",
        "source": "T03n0157_002:0178c07_84"
    },
    {
        "source_sentence": "是道善趣，離一切不善故。",
        "translation": "This path leads to a good destiny because it's free of all unwholesomeness.",
        "source": "T03n0157_002:0178c07_85"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0157_002:0178c08_86"
    },
    {
        "source_sentence": "是道如是，能到安樂之處乃至涅槃，是故應發阿耨多羅三藐三菩提心。』",
        "translation": "Such is the path that leads to a place of well-being up to nirvāṇa, so you should give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0178c08_87"
    },
    {
        "source_sentence": "「爾時，轉輪聖王答大臣言：『梵志！",
        "translation": "It was then that the wheel-turning sage king answered the minister, saying, 'Brahmin!",
        "source": "T03n0157_002:0178c10_88"
    },
    {
        "source_sentence": "今者如來出現於世，壽八萬歲。",
        "translation": "The Tathāgata appears in the world now, with a life span of eighty thousand years.",
        "source": "T03n0157_002:0178c11_0"
    },
    {
        "source_sentence": "其命有限，不能悉與一切眾生斷諸惡業、令種善根。",
        "translation": "Their life span is limited, and they can't give all sentient beings the opportunity to stop bad actions and plant good roots.",
        "source": "T03n0157_002:0178c11_1"
    },
    {
        "source_sentence": "種善根已安置聖果，或得陀羅尼三昧忍辱，或得菩薩勝妙善根，諸佛授記得阿耨多羅三藐三菩提。",
        "translation": "After planting good roots, they'll place the noble fruit, either attain the dhāraṇī samādhi of forbearance or attain the bodhisattva's excellent and marvelous good roots, and the buddhas will grant them to remember their unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0178c13_2"
    },
    {
        "source_sentence": "或少善根，於天人中受諸快樂，是諸眾生各各自受善不善報。",
        "translation": "Or those with few good roots who experience pleasures among gods and humans are each subject to the results of good and unskillful actions.",
        "source": "T03n0157_002:0178c15_3"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0178c16_4"
    },
    {
        "source_sentence": "於眾生中乃至一人無善根者，如來不能說斷苦法。",
        "translation": "If someone among sentient beings or even one person lacks good roots, the Tathāgata can't explain the method of ending suffering.",
        "source": "T03n0157_002:0178c17_0"
    },
    {
        "source_sentence": "如來世尊雖為福田，若無善根，不能令斷諸苦惱法。",
        "translation": "Although the Tathāgata Bhagavān is a field of merit, if he doesn't have good roots, he won't be able to stop the painful and distressing dharmas.",
        "source": "T03n0157_002:0178c18_1"
    },
    {
        "source_sentence": "梵志！",
        "translation": "O brāhmaṇa ascetic!",
        "source": "T03n0157_002:0178c19_2"
    },
    {
        "source_sentence": "我今發阿耨多羅三藐三菩提心，我行菩薩道時修集大乘，入於不可思議法門，",
        "translation": "Now that I have set my mind on unexcelled complete perfect enlightenment, I cultivate the great vehicle while practicing the path of enlightening beings and enter the inconceivable teaching.",
        "source": "T03n0157_002:0178c19_3"
    },
    {
        "source_sentence": "教化眾生而作佛事，終不願於五濁之世穢惡國土發菩提心。",
        "translation": "They teach sentient beings and perform buddha-works, never wishing to give rise to the mind of enlightenment in a defiled land in the five turbid worlds.",
        "source": "T03n0157_002:0178c21_4"
    },
    {
        "source_sentence": "我今行菩薩道，願成阿耨多羅三藐三菩提時，世界眾生無諸苦惱。",
        "translation": "When I now practice the bodhisattva path and wish to attain supreme perfect enlightenment, sentient beings in the world won't experience suffering or distress.",
        "source": "T03n0157_002:0178c23_5"
    },
    {
        "source_sentence": "若我得如是佛剎者，爾乃當成阿耨多羅三藐三菩提。』",
        "translation": "If I attain such a buddha-stage, then I'll attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0178c24_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0178c26_7"
    },
    {
        "source_sentence": "爾時，寶藏多陀阿伽度、阿羅呵、三藐三佛陀即入三昧，其三昧名見種種莊嚴。",
        "translation": "At that point, the treasure-store tathāgata, arhat, and samyak-saṃbuddha then entered samādhi, which is called seeing various adornments.",
        "source": "T03n0157_002:0178c26_8"
    },
    {
        "source_sentence": "入三昧已，作神足變化放大光明，以三昧力故，現十方世界一一方面各千佛剎，",
        "translation": "Having entered concentration, he manifested miraculous powers and magically emanated great rays of light. Because of the power of concentration, he manifested one direction in all worlds in the ten directions, each with a thousand buddha-lands:",
        "source": "T03n0157_002:0178c28_0"
    },
    {
        "source_sentence": "微塵數等諸佛世界種種莊嚴，或有世界佛已涅槃；",
        "translation": "The various adornments of buddha-lands as numerous as atoms in all the continents, some with worlds and buddhas already gone into nirvana.",
        "source": "T03n0157_002:0178c29_1"
    },
    {
        "source_sentence": "或有世界佛始涅槃；",
        "translation": "“Sometimes there are worldly buddhas who enter nirvana for the first time.",
        "source": "T03n0157_002:0179a02_2"
    },
    {
        "source_sentence": "或有世界其中菩薩始坐道場，菩提樹下降伏魔怨；",
        "translation": "In some worlds, when enlightening beings first sat on the terrace of enlightenment, the tree of enlightenment came down to subdue Māra’s enemies.",
        "source": "T03n0157_002:0179a02_3"
    },
    {
        "source_sentence": "或有世界佛始成道便轉法輪；",
        "translation": "“Some buddhas of worlds turn the wheel of teaching as soon as they attain enlightenment.",
        "source": "T03n0157_002:0179a03_4"
    },
    {
        "source_sentence": "或有世界佛久成道方轉法輪；",
        "translation": "“Sometimes there are worlds where buddhas turn the wheel of teaching only after a long time of enlightenment.",
        "source": "T03n0157_002:0179a04_5"
    },
    {
        "source_sentence": "或有世界純諸菩薩摩訶薩等遍滿其國，無有聲聞、緣覺之名；",
        "translation": "“Some worlds may be filled with pure enlightening beings and so on, filling their lands, but there are no names of śrāvakas or pratyekabuddhas.",
        "source": "T03n0157_002:0179a05_6"
    },
    {
        "source_sentence": "或有世界佛說聲聞、辟支佛乘；",
        "translation": "Some world buddhas teach the vehicles of śrāvakas and pratyekabuddhas.",
        "source": "T03n0157_002:0179a06_7"
    },
    {
        "source_sentence": "或有世界無佛、菩薩、聲聞、緣覺；",
        "translation": "In some worlds there are no buddhas, bodhisattvas, disciples, or pratyekabuddhas.",
        "source": "T03n0157_002:0179a07_8"
    },
    {
        "source_sentence": "或有世界五濁弊惡；",
        "translation": "“Sometimes there are worlds with the five turbid and evil influences.",
        "source": "T03n0157_002:0179a08_9"
    },
    {
        "source_sentence": "或有世界清淨微妙無諸濁惡；",
        "translation": "Some worlds are pure and subtle, without any turbidity or evil.",
        "source": "T03n0157_002:0179a08_10"
    },
    {
        "source_sentence": "或有世界卑陋不淨；",
        "translation": "Or there may be worlds that are inferior and impure.",
        "source": "T03n0157_002:0179a09_11"
    },
    {
        "source_sentence": "或有世界嚴淨妙好；",
        "translation": "Sometimes there are worlds that are beautifully adorned and pure.",
        "source": "T03n0157_002:0179a10_12"
    },
    {
        "source_sentence": "或有世界壽命無量；",
        "translation": "In some worlds the life span is immeasurable.",
        "source": "T03n0157_002:0179a10_13"
    },
    {
        "source_sentence": "或有世界壽命短促；",
        "translation": "In some worlds the life span is short:",
        "source": "T03n0157_002:0179a11_14"
    },
    {
        "source_sentence": "或有世界有大火災；",
        "translation": "In some worlds there is a great calamity of fire.",
        "source": "T03n0157_002:0179a11_15"
    },
    {
        "source_sentence": "或有世界有大水災；",
        "translation": "In some worlds there is a great flood.",
        "source": "T03n0157_002:0179a12_16"
    },
    {
        "source_sentence": "或有世界有大風災；",
        "translation": "“Sometimes there is a great windstorm in a world.",
        "source": "T03n0157_002:0179a12_17"
    },
    {
        "source_sentence": "或有世界劫始欲成；",
        "translation": "“Sometimes there is an eon when worlds are about to be formed.",
        "source": "T03n0157_002:0179a13_18"
    },
    {
        "source_sentence": "或有世界成就以竟。",
        "translation": "Perhaps there's a world that accomplishes it by completing it.",
        "source": "T03n0157_002:0179a13_19"
    },
    {
        "source_sentence": "有如是等無量世界，微妙光明悉皆遍照，令得顯現。",
        "translation": "There are innumerable such worlds, all pervaded by subtle rays of light that make them appear.",
        "source": "T03n0157_002:0179a14_20"
    },
    {
        "source_sentence": "「爾時，大眾悉見如是等無量清淨諸佛世界種種莊嚴。",
        "translation": "At the time, the masses saw all these kinds of various adornments of measureless pure buddha-realms.",
        "source": "T03n0157_002:0179a16_0"
    },
    {
        "source_sentence": "時，寶海梵志白轉輪王：『大王！",
        "translation": "The jeweled ocean priest then said to the wheel-turning king, 'Great king!",
        "source": "T03n0157_002:0179a17_1"
    },
    {
        "source_sentence": "今者已得見此諸佛世界種種莊嚴，是故今應發阿耨多羅三藐三菩提心，",
        "translation": "Having seen the various adornments of these buddha-fields, they should now set their minds on unexcelled, perfect enlightenment.",
        "source": "T03n0157_002:0179a17_2"
    },
    {
        "source_sentence": "隨意欲求何等佛土。』",
        "translation": "What kind of Buddha land do you want to pursue as you wish?'",
        "source": "T03n0157_002:0179a19_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179a20_4"
    },
    {
        "source_sentence": "時轉輪王向佛叉手，而白佛言：『世尊！",
        "translation": "The wheel-turning king then saluted the Buddha with his palms together and said to him, 'Bhagavān!",
        "source": "T03n0157_002:0179a20_5"
    },
    {
        "source_sentence": "諸菩薩等以何業故，取清淨世界？",
        "translation": "What's the reason why bodhisattvas and so forth take a pure world?",
        "source": "T03n0157_002:0179a21_6"
    },
    {
        "source_sentence": "以何業故，取不淨世界？",
        "translation": "What's the reason they take impure worlds?",
        "source": "T03n0157_002:0179a22_7"
    },
    {
        "source_sentence": "以何業故，壽命無量？",
        "translation": "Because of what action is the life span immeasurable?",
        "source": "T03n0157_002:0179a22_8"
    },
    {
        "source_sentence": "以何業故，壽命短促？』",
        "translation": "Why is the life span so short because of what actions?'",
        "source": "T03n0157_002:0179a23_9"
    },
    {
        "source_sentence": "佛告聖王：『大王當知，諸菩薩等以願力故，取清淨土、離五濁惡。",
        "translation": "The Buddha told the noble king, 'Great king, you should know that it's because of the power of their vows that bodhisattvas take the pure land and part with the five turbid evils.",
        "source": "T03n0157_002:0179a23_10"
    },
    {
        "source_sentence": "復有菩薩以願力故，求五濁惡。』",
        "translation": "Again, there are bodhisattvas who seek the five turbid evils because of the power of their vows.'",
        "source": "T03n0157_002:0179a25_11"
    },
    {
        "source_sentence": "爾時，聖王前白佛言：『世尊！",
        "translation": "It was then that the noble king went before the Buddha and said, 'Bhagavān!",
        "source": "T03n0157_002:0179a25_12"
    },
    {
        "source_sentence": "我今還城，於閑靜處專心思惟，當作誓願。",
        "translation": "I will now return to the city and concentrate my thoughts in a secluded place.",
        "source": "T03n0157_002:0179a26_13"
    },
    {
        "source_sentence": "如我所見佛土相貌，離五濁惡，願求清淨莊嚴世界。』",
        "translation": "As I see the appearance of the Buddha land, free of the five turbid and evil forms, I wish to seek a purely adorned world.'",
        "source": "T03n0157_002:0179a27_14"
    },
    {
        "source_sentence": "佛告聖王：『宜知是時。』",
        "translation": "The Buddha told the noble king, 'Should you know this is the right time?'",
        "source": "T03n0157_002:0179a28_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179a29_16"
    },
    {
        "source_sentence": "時轉輪王頭面禮佛及比丘僧，右遶三匝，即退而去。",
        "translation": "The wheel-turning king then bowed his head and face to the Buddha and the monks, circled him three times to his right, withdrew, and departed.",
        "source": "T03n0157_002:0179a29_17"
    },
    {
        "source_sentence": "便還入城到所住處，自宮殿中在一屏處，一心端坐思惟修集種種莊嚴己佛世界。",
        "translation": "He then returned into the city, went to his dwelling place, sat in a secluded place in his own palace, and meditated with one mind on cultivating various ways to adorn his own Buddha-realm.",
        "source": "T03n0157_002:0179b01_18"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179b03_19"
    },
    {
        "source_sentence": "時寶海梵志，次白太子不眴：『善男子！",
        "translation": "The Jewel-Sea priest then next said to the prince without offense, 'Good sons!",
        "source": "T03n0157_002:0179b03_20"
    },
    {
        "source_sentence": "汝今亦當發於阿耨多羅三藐三菩提心，如汝所行三福處者，所謂布施、調伏、善攝身口，",
        "translation": "You should now also give rise to the mind of unexcelled, complete perfect enlightenment. Just as you have practiced the three kinds of meritorious virtue, namely generosity, self-control, discipline, and skillfully controlling body, speech,",
        "source": "T03n0157_002:0179b04_21"
    },
    {
        "source_sentence": "及餘所行清淨善業，盡應和合迴向阿耨多羅三藐三菩提。』",
        "translation": "As well as the other pure and good actions that they perform, they should all be combined and returned to unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0179b06_22"
    },
    {
        "source_sentence": "爾時，太子作如是言：『我今先應還至宮殿，在一屏處端坐思惟。",
        "translation": "It was then that the prince said, 'Now, I should first return to the palace and sit in a single secluded place to contemplate.",
        "source": "T03n0157_002:0179b08_23"
    },
    {
        "source_sentence": "若我必能發阿耨多羅三藐三菩提心者，我當還來至於佛所，當於佛前畢定發心，",
        "translation": "If I am bound to give rise to the thought of unexcelled, perfect enlightenment, then I will return to the presence of the Buddha and concentrate on this thought before him.",
        "source": "T03n0157_002:0179b09_24"
    },
    {
        "source_sentence": "願取種種淨妙佛土。』",
        "translation": "May I take various kinds of pure and marvelous buddha lands.'",
        "source": "T03n0157_002:0179b11_25"
    },
    {
        "source_sentence": "爾時，太子頭面禮佛及比丘僧，右遶三匝，即還而去。",
        "translation": "The prince then bowed his head and face to the Buddha and the monks, circled them three times to their right, and departed.",
        "source": "T03n0157_002:0179b12_26"
    },
    {
        "source_sentence": "至本宮殿，在一屏處一心端坐，思惟修集種種莊嚴己佛世界。",
        "translation": "He went to his original palace, sat cross-legged in a single seat, and contemplated the cultivation of various ways to adorn his own buddha-realm.",
        "source": "T03n0157_002:0179b13_27"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179b14_28"
    },
    {
        "source_sentence": "爾時，梵志復白第二王子，作如是言：『善男子！",
        "translation": "It was then that the priest again said to the second prince, saying, 'Good man!",
        "source": "T03n0157_002:0179b15_0"
    },
    {
        "source_sentence": "汝今當發阿耨多羅三藐三菩提心。』",
        "translation": "Now, you must give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0179b16_1"
    },
    {
        "source_sentence": "如是聖王千子，皆悉教化令發阿耨多羅三藐三菩提心。",
        "translation": "Thus, the noble king's thousand sons all taught and transformed them to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0179b16_2"
    },
    {
        "source_sentence": "爾時，梵志復教化八萬四千諸小王等，及餘九萬二千億眾生，令發阿耨多羅三藐三菩提心。",
        "translation": "At the time, the priest again taught 84,000 minor kings and other 92,000 billion sentient beings to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0179b18_3"
    },
    {
        "source_sentence": "一切大眾皆作是言：『梵志！",
        "translation": "All the masses said, 'Brahmin!",
        "source": "T03n0157_002:0179b20_4"
    },
    {
        "source_sentence": "我等今當各各還至所住之處，在一靜處一心端坐，思惟修集種種莊嚴己佛世界。』",
        "translation": "Now, we'll each return to where we live and sit in a single quiet place with one mind at the end of our seats, contemplating and cultivating various ways to adorn our own buddha world.'",
        "source": "T03n0157_002:0179b20_5"
    },
    {
        "source_sentence": "如是大眾一心寂靜於七歲中，各各於己本所住處，一心端坐，思惟修集種種莊嚴己佛世界。",
        "translation": "Thus, for seven years, each of these great assemblies remained unified in their minds. Each sat with his or her head at the end of his or her seat where he or she was originally residing and meditated on collecting all kinds of adornments to adorn his or her own buddha world.",
        "source": "T03n0157_002:0179b22_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179b25_7"
    },
    {
        "source_sentence": "寶海梵志復於後時作如是念：『今我教化無量百千億那由他眾生，令發阿耨多羅三藐三菩提心。",
        "translation": "Again, at some point later, the priest Jewel-Sea Brahmā thought, 'Now, I'll teach measureless hundreds of thousands of millions of sentient beings to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0179b25_8"
    },
    {
        "source_sentence": "我今已請佛及大眾，於七歲中奉諸所安。",
        "translation": "Now, I've invited the Buddha and the masses to consecrate what's peaceful for seven years.",
        "source": "T03n0157_002:0179b27_9"
    },
    {
        "source_sentence": "若我當來必成阿耨多羅三藐三菩提，所願成就者，我當勸喻天、龍、鬼神、阿修羅、乾闥婆、緊那羅、摩睺羅伽、夜叉、羅剎、拘辦荼等，",
        "translation": "If in the future I will surely attain anuttarii samyaksarrzbodhi and fulfill my vow, I will exhort gods, dragons, ghosts, asuras, gandharvas, kinnaras, mahoragas, yakṣas, rāṣas, kovidāras, and so forth.",
        "source": "T03n0157_002:0179b28_10"
    },
    {
        "source_sentence": "令其供養如是大眾。』",
        "translation": "He causes them to make offerings to such a large group of people.'",
        "source": "T03n0157_002:0179c02_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179c03_12"
    },
    {
        "source_sentence": "爾時，梵志即念毘沙門天王。",
        "translation": "At the time, the priest was mindful of Vaiśravaṇa.",
        "source": "T03n0157_002:0179c03_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179c04_14"
    },
    {
        "source_sentence": "爾時天王即知梵志心之所念，與百千億無量夜叉，恭敬圍遶至梵志所，",
        "translation": "Knowing what the brahmin thought, the king of gods accompanied by hundreds of thousands of myriadstical koṭis of immeasurable yakṣas surrounded the brahmin with respect.",
        "source": "T03n0157_002:0179c04_15"
    },
    {
        "source_sentence": "尋於其夜在梵志前，作如是言：『梵志！",
        "translation": "On that night, he was in front of the priest and said, 'Brahmin!",
        "source": "T03n0157_002:0179c05_16"
    },
    {
        "source_sentence": "欲何教勅？』",
        "translation": "What do you want to teach?'",
        "source": "T03n0157_002:0179c06_17"
    },
    {
        "source_sentence": "梵志問言：『汝是誰耶？』",
        "translation": "The priest asked, 'Who are you?'",
        "source": "T03n0157_002:0179c07_18"
    },
    {
        "source_sentence": "毘沙門言：『梵志！",
        "translation": "Vaiśravaṇa said, 'Brahmin!",
        "source": "T03n0157_002:0179c07_19"
    },
    {
        "source_sentence": "汝頗曾聞毘沙門王不？",
        "translation": "Have you ever heard of King Vaiśravaṇa?",
        "source": "T03n0157_002:0179c07_20"
    },
    {
        "source_sentence": "即我身是。",
        "translation": "That is, it's the self-body.",
        "source": "T03n0157_002:0179c08_21"
    },
    {
        "source_sentence": "欲何所勅？』",
        "translation": "What do you want to order?'",
        "source": "T03n0157_002:0179c08_22"
    },
    {
        "source_sentence": "時梵志言：『善來，大王！",
        "translation": "The priest then said, 'Well come, great king!",
        "source": "T03n0157_002:0179c08_23"
    },
    {
        "source_sentence": "我今供養如是大眾，汝可助我共供養之。』",
        "translation": "Now, I'll make offerings to such a large group of people, so you can help me make offerings to them together.'",
        "source": "T03n0157_002:0179c09_24"
    },
    {
        "source_sentence": "毘沙門王言：『敬如所勅，隨意所須。』",
        "translation": "The king of Vaiśravaṇa said, 'I respectfully follow what I've been commanded to do as I wish.'",
        "source": "T03n0157_002:0179c10_25"
    },
    {
        "source_sentence": "梵志復言：『大王！",
        "translation": "Again, the priest said, 'Great king!",
        "source": "T03n0157_002:0179c11_26"
    },
    {
        "source_sentence": "若能隨我意者，令諸夜叉發阿耨多羅三藐三菩提心，復當宣告諸夜叉等，",
        "translation": "If you can follow my wishes, cause the yakṣas to give rise to the mind of unsurpassed, correct, and complete enlightenment, and you will also proclaim it to the yakṣas.",
        "source": "T03n0157_002:0179c11_27"
    },
    {
        "source_sentence": "欲得福者、欲得阿耨多羅三藐三菩提者，可度大海，日日往取牛頭栴檀及以沈水，",
        "translation": "Those who want to attain merit and those who want to attain anuttarii samyaksarrzbodhi can cross the great ocean and go day after day to fetch oxhead sandalwood and sunken water.",
        "source": "T03n0157_002:0179c13_28"
    },
    {
        "source_sentence": "并諸餘香、種種諸華，持來至此，亦當如我日日供養佛及眾僧。』",
        "translation": "And the other kinds of incense and various flowers that I bring here will also be offered to the Buddha and the saṃgha on a daily basis like mine.'",
        "source": "T03n0157_002:0179c15_29"
    },
    {
        "source_sentence": "爾時，天王聞是語已，還至住處，擊鼓集會夜叉羅剎，唱如是言：『卿等知不？",
        "translation": "After hearing these words, the king of gods returned to his dwelling place, beat his drum and assembled the night-shark Rāṣṭrapāla, called out like this, 'Do you know?'",
        "source": "T03n0157_002:0179c16_30"
    },
    {
        "source_sentence": "此閻浮提有轉輪聖王名無諍念，有梵志名曰寶海，即是聖王之大臣也。",
        "translation": "In this Jambudvfpa there is a universal ruler called Wuqianyan, and in that country there is a brahmin named Baohai, who is the king’s minister.",
        "source": "T03n0157_002:0179c18_31"
    },
    {
        "source_sentence": "終竟七歲請佛及僧奉諸所安。",
        "translation": "At the end of his seven years, he invited the Buddha and the saṃgha to serve what was peaceful.",
        "source": "T03n0157_002:0179c20_32"
    },
    {
        "source_sentence": "卿等！",
        "translation": "You!",
        "source": "T03n0157_002:0179c21_33"
    },
    {
        "source_sentence": "於此福德應生隨喜，生隨喜已，以是善根，發心迴向阿耨多羅三藐三菩提。』",
        "translation": "In this virtue, they should give rise to rejoicing, and after giving rise to rejoicing, they use these good roots to arouse the intention to return to unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0179c21_34"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0179c23_0"
    },
    {
        "source_sentence": "爾時，有百千無量億那由他夜叉等，叉手合掌作如是言：『若寶海梵志，",
        "translation": "At that time hundreds of thousands of myriads of incalculable koṭis of nayutas of yakṣas joined their palms and said:",
        "source": "T03n0157_002:0179c23_1"
    },
    {
        "source_sentence": "於七歲中供養如來及比丘僧，奉諸所安，善根福報，我等隨喜。",
        "translation": "At the age of seven we will pay homage to the Tathāgata and all the bhikṣus and monks, and offer them comforts. The meritorious retribution for their good deeds will be according to our wishes.",
        "source": "T03n0157_002:0179c24_2"
    },
    {
        "source_sentence": "以是隨喜善根故，令我等成阿耨多羅三藐三菩提。』",
        "translation": "Because of this good root of following joy, we'll attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0179c26_3"
    },
    {
        "source_sentence": "爾時，天王復作是言：『卿等諦聽！",
        "translation": "At that point, the king of gods again said, 'Listen attentively!",
        "source": "T03n0157_002:0179c27_4"
    },
    {
        "source_sentence": "欲得福德及善根者，便可日日渡於大海，為彼梵志，取牛頭栴檀及以沈水，",
        "translation": "If you want to attain merit and good roots, you can cross the ocean day by day. For that brahmin’s sake, take some oxhead sandalwood and a drop of water [to dry it up].",
        "source": "T03n0157_002:0179c28_5"
    },
    {
        "source_sentence": "熟食飯佛及比丘僧。』",
        "translation": "cooked rice for the Buddha and the monks and nuns.'",
        "source": "T03n0157_002:0180a01_6"
    },
    {
        "source_sentence": "時有九萬二千夜叉同時發言：『天王！",
        "translation": "At the time, 92,000 yakṣas all simultaneously spoke out, saying, 'O king of gods!",
        "source": "T03n0157_002:0180a01_7"
    },
    {
        "source_sentence": "我等今者於七歲中，常當取是牛頭栴檀及以沈水，與彼梵志，熟食飯佛及比丘僧。』",
        "translation": "Now, for seven years, we'll always take this ox-head sandalwood and sunken water and give it to that priest, the cooked rice of the Buddha and the monks and nuns.'",
        "source": "T03n0157_002:0180a02_8"
    },
    {
        "source_sentence": "復有四萬六千夜叉，亦同聲言：『我等當取微妙諸香，與彼梵志，供養如來及比丘僧。』",
        "translation": "Again, there are 46,000 yakṣas who all say with one voice, 'We will take these subtle fragrances and give them to the priest to make offerings to the Tathāgata and the monks and nuns.'",
        "source": "T03n0157_002:0180a04_9"
    },
    {
        "source_sentence": "復有五萬二千諸夜叉等，亦各同聲作如是言：『我等當取種種妙華，與彼梵志，",
        "translation": "Again, there were fifty-two thousand yakṣas and so forth, each of whom said in unison, “We should take various kinds of wonderful flowers and give them to that brahmin.",
        "source": "T03n0157_002:0180a06_10"
    },
    {
        "source_sentence": "供養如來及比丘僧。』",
        "translation": "Make offerings to the Tathāgata and the monks.'",
        "source": "T03n0157_002:0180a08_11"
    },
    {
        "source_sentence": "復有二萬諸夜叉等，亦同聲言：『我等當取諸味之精，與彼梵志，調和飲食，",
        "translation": "Twenty thousand other yakṣas and so forth also said in unison, “We should take the energy of all flavors and offer them to the brahmin as food and drink.",
        "source": "T03n0157_002:0180a08_12"
    },
    {
        "source_sentence": "以供養佛及比丘僧。』",
        "translation": "It's to make offerings to the Buddha and the monks.'",
        "source": "T03n0157_002:0180a10_13"
    },
    {
        "source_sentence": "爾時，復有七萬夜叉亦同聲言：『我等當往與作飲食，供養如來及比丘僧。』",
        "translation": "At the time, another 70,000 yakṣas also said in unison, 'We will go and offer food and drink to the Tathāgata and the monks.'",
        "source": "T03n0157_002:0180a10_14"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0180a12_15"
    },
    {
        "source_sentence": "爾時梵志復作是念：『次當勸喻毘樓勒叉天王、毘樓羅叉天王、提頭賴吒天王。』",
        "translation": "It was then that the priest again thought, 'Next, I'll encourage the god king Vairocana, the god king Vairocana, and the god king Titrāyaṣṭha.'",
        "source": "T03n0157_002:0180a12_16"
    },
    {
        "source_sentence": "作是念已，爾時三王即知其念，往梵志所，乃至還所住處，毘樓勒叉與百千億那由他拘辦荼等，",
        "translation": "Having thought thus, the three kings immediately knew their thoughts. They went to the priest’s place and returned to where they were staying:",
        "source": "T03n0157_002:0180a14_17"
    },
    {
        "source_sentence": "毘樓羅叉天王與百千無量億那由他諸龍，提頭賴吒與百千無量億那由他諸乾闥婆，",
        "translation": "The celestial king Virūḍhaka and a hundred thousand incalculable millions of trillions of dragons, and the deities Dhṛtarāṣṭra and a hundred thousand incalculable millions of gandharvas.",
        "source": "T03n0157_002:0180a16_18"
    },
    {
        "source_sentence": "乃至發阿耨多羅三藐三菩提心亦如是。",
        "translation": "It's likewise with the mind that arouses the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0180a18_19"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0180a19_20"
    },
    {
        "source_sentence": "爾時，梵志即復念於第二天下四天大王，彼四天王以佛力故，至梵志所，",
        "translation": "At that time, the brahmin was also thinking of the four great kings of the gods in the second heavenly realm below him. Because of the power of the Buddha, those four great kings came to the brahmin’s place and said:",
        "source": "T03n0157_002:0180a20_21"
    },
    {
        "source_sentence": "作如是言：『梵志！",
        "translation": "He said, 'Brahmin!",
        "source": "T03n0157_002:0180a21_22"
    },
    {
        "source_sentence": "今者欲何所勅？』",
        "translation": "What do you want to order now?'",
        "source": "T03n0157_002:0180a22_23"
    },
    {
        "source_sentence": "梵志答言：『我今勸汝與諸眷屬，發阿耨多羅三藐三菩提心。』",
        "translation": "The priest answered, 'Now, I'll encourage you and your followers to give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0180a22_24"
    },
    {
        "source_sentence": "四天王言：『敬如所勅。』",
        "translation": "The four heavenly kings said,'Venerate as you've been commanded.'",
        "source": "T03n0157_002:0180a23_25"
    },
    {
        "source_sentence": "即各還至所住之處，與諸眷屬悉共發於阿耨多羅三藐三菩提心。",
        "translation": "They each returned to the place where they lived and all of their retinues together aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0180a24_26"
    },
    {
        "source_sentence": "如是乃至三千大千世界百億毘沙門王，發阿耨多羅三藐三菩提心。",
        "translation": "Thus, up to a hundred billion Vaiśravaṇa kings in 3,000 great one-thousand worlds give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0180a25_27"
    },
    {
        "source_sentence": "百億毘樓勒叉天王、百億毘樓羅叉、百億提頭賴吒，各各自與所有眷屬，",
        "translation": "Ten billion Virūḍhaka celestial kings, ten billion Virūḍhakas, and ten billion Dhṛṣṭiprāpta were each given their retinues.",
        "source": "T03n0157_002:0180a27_28"
    },
    {
        "source_sentence": "亦復如是發阿耨多羅三藐三菩提心。",
        "translation": "They also similarly give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0180a29_29"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0180b01_30"
    },
    {
        "source_sentence": "爾時，梵志復作是念：『若我未來必成阿耨多羅三藐三菩提，所願成就得己利者，",
        "translation": "At that point, the priest again had this thought, 'If I will surely attain supreme perfect enlightenment in the future and accomplish what I want to attain for my own benefit,",
        "source": "T03n0157_002:0180b01_31"
    },
    {
        "source_sentence": "當令一切諸天皆使得此福德之分，亦勸使發阿耨多羅三藐三菩提心。",
        "translation": "They will cause all the gods to make this portion of merit possible, and they'll also encourage them to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_002:0180b03_32"
    },
    {
        "source_sentence": "若我來世以是善根，必成阿耨多羅三藐三菩提者，忉利天王當來至此與我相見；",
        "translation": "In the future I will surely attain unexcelled complete perfect enlightenment through these roots of goodness, and the celestial king Trāyastriṃśa gods will come to see me here.",
        "source": "T03n0157_002:0180b04_33"
    },
    {
        "source_sentence": "夜摩天子、兜術天子、化樂天子、他化自在天子，亦當來此與我相見。』",
        "translation": "The gods Yama, Tuṣita, Nirmāṇarati, Nirmāṇarati, and Paranirmitavaśavartin will also come to see me here.'",
        "source": "T03n0157_002:0180b06_34"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0180b08_35"
    },
    {
        "source_sentence": "爾時梵志作是念已，忉利天王、夜摩天王、兜術天王、化樂天王、他化自在天王，",
        "translation": "After the priest had this thought, the celestial kings of Trāyastriṃśa gods, Yama gods, Tuṣita gods, Nirmāṇarati gods, and Paranirmitavaśavartin gods",
        "source": "T03n0157_002:0180b08_36"
    },
    {
        "source_sentence": "悉皆來此，與梵志相見作如是言：『梵志！",
        "translation": "They all came here and met the priest and said, 'Brahmin!",
        "source": "T03n0157_002:0180b10_37"
    },
    {
        "source_sentence": "今者欲何所勅？』",
        "translation": "What do you want to order now?'",
        "source": "T03n0157_002:0180b11_38"
    },
    {
        "source_sentence": "梵志答言：『汝是誰也？』",
        "translation": "The priest answered, 'Who are you?'",
        "source": "T03n0157_002:0180b11_39"
    },
    {
        "source_sentence": "時五天王各稱姓名，復言梵志：『欲何所勅？",
        "translation": "The five celestial kings then called their names and again said to the priest, 'What do you want me to order?'",
        "source": "T03n0157_002:0180b12_40"
    },
    {
        "source_sentence": "不須在此大會使耶？』",
        "translation": "Isn't there a need for an envoy here in the great assembly?'",
        "source": "T03n0157_002:0180b13_41"
    },
    {
        "source_sentence": "「梵志答言：『天王當知，汝等天上所有妙寶臺殿樓閣，有諸寶樹及諸衣樹、香樹、華樹、果蓏之樹，",
        "translation": "The brāhmaṇa replied, “O kings of gods, you should know that in the heavenly realms there are wonderful jeweled terraces, halls, and towers, as well as jeweled trees, clothed-up trees, fragrant trees, flowering trees, and fruit-apple trees.",
        "source": "T03n0157_002:0180b13_42"
    },
    {
        "source_sentence": "天衣天座綩綖茵蓐，上妙寶器及以瓔珞，天幢天蓋諸繒幡等種種莊嚴，",
        "translation": "They wore heavenly garments and celestial thrones, covered with draped silhouetted cloth, adorned with exquisitely jeweled vessels and necklaces. The sky-banners, the canopies, the parasols, banners, and other various ornaments were also arrayed there.",
        "source": "T03n0157_002:0180b15_43"
    },
    {
        "source_sentence": "諸天所有種種伎樂。",
        "translation": "The gods have various kinds of music and tricks.",
        "source": "T03n0157_002:0180b17_44"
    },
    {
        "source_sentence": "汝等可以如此之物，種種莊嚴此閻浮園，供養於佛及比丘僧。』",
        "translation": "You can thus variously adorn this Jambudvīpa with these things and make offerings to the Buddha and the monks and nuns.'",
        "source": "T03n0157_002:0180b17_45"
    },
    {
        "source_sentence": "時五天王作如是言：『敬如所勅。』",
        "translation": "The five heavenly kings then said,'Venerate as you've been commanded.'",
        "source": "T03n0157_002:0180b19_46"
    },
    {
        "source_sentence": "時諸天王各各還至所住之處。",
        "translation": "Each of the heavenly kings then returned to where he was staying.",
        "source": "T03n0157_002:0180b20_47"
    },
    {
        "source_sentence": "忉利天王告毘樓勒天子，夜摩天王告阿荼滿天子，兜術天王告路醯天子，",
        "translation": "The king of Trāyastriṃśa gods told the celestial being Virūḍhaka, the king of Yama gods told the celestial being Ajātaśatru, and the king of Tuṣita gods told the celestial being Lokeśavartin.",
        "source": "T03n0157_002:0180b20_48"
    },
    {
        "source_sentence": "化樂天王告拘陀羅天子，他化自在天王告難陀天子，各作是言：『卿今當下閻浮提界，",
        "translation": "The lord of the Nirmāṇaratideva heaven addressed the celestial being Kauṣṭhila, and the lord of the Paranirmitavaśavartin heaven addressed the celestial being Nanda. They each said:",
        "source": "T03n0157_002:0180b22_49"
    },
    {
        "source_sentence": "以此所有種種，莊嚴彼閻浮園，懸諸瓔珞，敷種種座，如諸天王種種莊嚴，",
        "translation": "They adorned the Jambudvipa with all kinds of jewel ornaments, draped various jewelry, and set up various seats, just like the various adornments of heavenly kings.",
        "source": "T03n0157_002:0180b24_50"
    },
    {
        "source_sentence": "為如來故作寶高樓，當使如此忉利天上所有寶樓。』",
        "translation": "For the sake of the Tathāgata, he'll build a high jeweled tower like this one in Trāyastriṃśa Heaven that contains all the jeweled towers.'",
        "source": "T03n0157_002:0180b26_51"
    },
    {
        "source_sentence": "是諸天子聞是教已，即下來至閻浮提中，尋於其夜，種種莊嚴是閻浮園，",
        "translation": "Having heard these teachings, the celestial beings descended to Jambudvīpa. On that night they found various adornments of Jambudvīpa’s park.",
        "source": "T03n0157_002:0180b27_52"
    },
    {
        "source_sentence": "以諸寶樹乃至天幡而莊挍之，為如來故作七寶樓，如忉利天所有寶樓。",
        "translation": "It's adorned with jeweled trees and even heavenly banners, and it's made into a seven-jeweled tower for the Tathāgata's sake, just like the jeweled tower in Trāyastriṃśa Heaven.",
        "source": "T03n0157_002:0180b29_53"
    },
    {
        "source_sentence": "是五天子持諸寶物，種種莊嚴閻浮提園已，尋還天上各白其王：『大王當知，",
        "translation": "These five celestial beings, carrying various kinds of precious things, adorned the Jambudvipa grove in various ways. Having returned to heaven, each said to their king:",
        "source": "T03n0157_002:0180c02_54"
    },
    {
        "source_sentence": "我等已往莊挍彼園，所有之物如此無異，為如來故作七寶樓，如忉利天所有寶樓，",
        "translation": "We adorned the grove with the seven kinds of jeweled buildings for the sake of the World-honored One, just like the jeweled towers of the Trāyastriṃśa gods.",
        "source": "T03n0157_002:0180c03_55"
    },
    {
        "source_sentence": "等無差別。』",
        "translation": "There's no distinction between equal and equal.'",
        "source": "T03n0157_002:0180c05_56"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0180c06_57"
    },
    {
        "source_sentence": "時忉利天王、夜摩天王、兜術天王、化樂天王、他化自在天王，即便來至閻浮提中，",
        "translation": "Then the celestial kings of Trāyastriṃśa Heaven, Yama Heaven, Tuṣita Heaven, Nirmāṇarati Heaven, and Paranirmitavaśavartin Heaven came to Jambudvīpa.",
        "source": "T03n0157_002:0180c06_58"
    },
    {
        "source_sentence": "到梵志所，作如是言：『梵志！",
        "translation": "He went to the priest and said, 'Brahmin!",
        "source": "T03n0157_002:0180c08_59"
    },
    {
        "source_sentence": "我今已為佛及眾僧，莊挍此園，更何所勅？",
        "translation": "Now that I've adorned this park for the sake of the Buddha and the saṃgha, why would I order it?",
        "source": "T03n0157_002:0180c08_60"
    },
    {
        "source_sentence": "願便說之。』",
        "translation": "May it be explained.'",
        "source": "T03n0157_002:0180c09_61"
    },
    {
        "source_sentence": "梵志答言：『汝等各各自於境界，有自在力可集諸天，汝持我言：「閻浮提內有大梵志名曰寶海，",
        "translation": "The brahmins replied, “Each of you have sovereign power over your own territory to assemble the gods.",
        "source": "T03n0157_002:0180c10_62"
    },
    {
        "source_sentence": "於七歲中請佛世尊及無量僧奉諸所安。",
        "translation": "At the age of seven, he invited the Bhagavān and measureless saṃgha to serve what was peaceful.",
        "source": "T03n0157_002:0180c12_63"
    },
    {
        "source_sentence": "卿等今者於此福德應生隨喜，生隨喜已，發心迴向阿耨多羅三藐三菩提，",
        "translation": "\\",
        "source": "T03n0157_002:0180c13_64"
    },
    {
        "source_sentence": "是故應往佛所，見佛世尊及比丘僧，供養所須，聽受妙法。」』",
        "translation": "That's why you should go to the Buddha, see the Bhagavān and the monks and bhikṣus, make offerings as needed, and listen to the wonderful teaching.'",
        "source": "T03n0157_002:0180c15_65"
    },
    {
        "source_sentence": "時五天王，從梵志所聞是言已，各各自還至所住處。",
        "translation": "After hearing these words from the priest, the five celestial kings each returned to their dwelling place.",
        "source": "T03n0157_002:0180c16_66"
    },
    {
        "source_sentence": "「爾時，忉利天王釋提桓因，即集諸天而告之曰：『卿等當知，閻浮提內有轉輪聖王名無諍念，",
        "translation": "At that time, the lord of the Trāyastriṃśa gods, named Śakra Devānām-Indra, assembled the heavenly gods and said to them: You should know that in Jambudvīpa there is a universal ruler called Vimalakīrti.",
        "source": "T03n0157_002:0180c17_67"
    },
    {
        "source_sentence": "有大梵志名曰寶海，即其聖王之大臣也，請佛世尊及無量億僧，終竟七歲奉諸所安，",
        "translation": "There was a great brāhmaṇa called Jewel Ocean, who was the minister of that holy king. He invited the Buddha, the World-honored One, and innumerable millions of monks to his monastery for seven years.",
        "source": "T03n0157_002:0180c20_0"
    },
    {
        "source_sentence": "我已先為佛比丘僧，取諸寶物種種莊嚴彼閻浮園。",
        "translation": "I've already taken all the treasures and various adornments of that Jambudvīpa park for the sake of the buddhas, monks, and nuns.",
        "source": "T03n0157_002:0180c22_1"
    },
    {
        "source_sentence": "卿等以是善根因緣，生隨喜心，生隨喜已，發心迴向阿耨多羅三藐三菩提，",
        "translation": "Because of these roots of goodness, you give rise to thoughts of joy. Having given rise to those thoughts of joy, you have undertaken to dedicate yourselves to unexcelled, complete perfect enlightenment.",
        "source": "T03n0157_002:0180c23_2"
    },
    {
        "source_sentence": "亦令梵志得如所願。』",
        "translation": "It will also cause the priest to attain what he wishes.'",
        "source": "T03n0157_002:0180c25_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0180c25_4"
    },
    {
        "source_sentence": "爾時，百千無量億那由他忉利天子，恭敬叉手，作如是言：『我等今者於是善根生隨喜心，",
        "translation": "At that time one hundred thousand myriads of incalculable koṭis of nayutas of the Trāyastriṃśa gods saluted them with their palms joined and said:",
        "source": "T03n0157_002:0180c25_5"
    },
    {
        "source_sentence": "以是隨喜故，令我等一切得成阿耨多羅三藐三菩提。』",
        "translation": "Because of this joy, we'll all attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0180c27_6"
    },
    {
        "source_sentence": "「夜摩天王、兜術天王、化樂天王、他化自在天王，如是等各集諸天而告之曰：『卿等當知，",
        "translation": "The king of Yama Heaven, the king of Tuṣita Heaven, the king of Nirmāṇarati Heaven, the king of Paranirmitavaśavartin Heaven, and the king of Paranirmitavaśavartin Heaven each gathered the gods together and said:",
        "source": "T03n0157_002:0180c29_7"
    },
    {
        "source_sentence": "閻浮提內有轉輪聖王名無諍念，有大梵志名曰寶海，即其聖王之大臣也，",
        "translation": "In Jambudvfpa there was a universal ruler named Anavatapta. There was a great brahmin named Ratnacchattra, who was the minister of that king.",
        "source": "T03n0157_002:0181a02_8"
    },
    {
        "source_sentence": "請佛世尊及無量億僧，終竟七歲奉諸所安，我已先為佛比丘僧，取諸寶物種種莊挍彼閻浮園，",
        "translation": "Invited by the Buddha, World-honored One, and innumerable millions of myriads of koṭis of bhikṣus, I presented these offerings for seven years at the end of my life. Having done so, I became a bhikṣu on behalf of the buddhas and bhikṣus who were formerly endowed with various adornments made of precious",
        "source": "T03n0157_002:0181a04_0"
    },
    {
        "source_sentence": "卿等以是善根因緣故，應生隨喜，生隨喜已，發心迴向阿耨多羅三藐三菩提，",
        "translation": "Because of these causes and conditions of the roots of goodness, you should give rise to rejoicing. Having given rise to rejoicing, you should resolve to turn your minds toward unexcelled complete perfect enlightenment.",
        "source": "T03n0157_002:0181a06_1"
    },
    {
        "source_sentence": "當令梵志得如所願。』",
        "translation": "You will cause the priest to attain what he wishes.'",
        "source": "T03n0157_002:0181a08_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0181a08_3"
    },
    {
        "source_sentence": "爾時，四天各有百千無量億那由他天子，恭敬叉手，作如是言：『我等今者，",
        "translation": "At that time hundreds of thousands of myriads of incalculable koṭis of nayutas of celestial beings in each of the four quarters bowed their palms in reverence and said:",
        "source": "T03n0157_002:0181a08_4"
    },
    {
        "source_sentence": "於是善根，生隨喜心，以是隨喜故，令我等一切皆得成阿耨多羅三藐三菩提。』",
        "translation": "As a result of these good roots, they give rise to the mind of following joy, and because of this following joy, we all attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0181a10_5"
    },
    {
        "source_sentence": "「爾時，五王各各告言：『卿等！",
        "translation": "At that point, each of the five kings told them, 'You!",
        "source": "T03n0157_002:0181a12_6"
    },
    {
        "source_sentence": "今當至閻浮提，見寶藏佛及比丘僧，禮拜、圍遶、恭敬、供養、尊重、讚歎。』",
        "translation": "Now, when I go to Jambudvīpa, I'll see the Jewel-Store Buddha and the monks and nuns venerate, circumambulate, respect, offer support, venerate, venerate, and praise them.'",
        "source": "T03n0157_002:0181a12_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0181a14_8"
    },
    {
        "source_sentence": "時五天王各各於夜，一一將諸天子、天女、童男、童女，及餘眷屬百千億那由他眾，",
        "translation": "At night, each of the five guardian gods gathered their heavenly princes, goddesses, celestial maidens, boys, girls, and hundreds of thousands of myriads of koṭis of other retinues.",
        "source": "T03n0157_002:0181a14_9"
    },
    {
        "source_sentence": "前後圍遶來至佛所，頂禮佛足及比丘僧，從佛聽法至明清旦，遷住虛空，",
        "translation": "They came to the place where the Buddha was, bowed their heads at his feet, and greeted the bhikṣus and monks. After listening to the Dharma from the Buddha’s discourse until dawn they flew up into the sky in the morning.",
        "source": "T03n0157_002:0181a16_10"
    },
    {
        "source_sentence": "以種種天華、優鉢羅華、鉢頭摩華、拘物頭華、分陀利華、須曼那華、婆尸師華、阿提目多伽占婆伽華、曼陀羅華、摩訶曼陀羅華，",
        "translation": "He offered various celestial flowers, blue lotus blossoms, red lotus blossoms, white lotus blossoms, blue lotus blossoms, pink lotus blossoms, red lotus blossoms, blue lotus blossoms, red lotus blossoms, black lotus blossoms, yellow lotus blossoms",
        "source": "T03n0157_002:0181a18_11"
    },
    {
        "source_sentence": "以散大會，如雨而下，并鼓天樂而以供養。",
        "translation": "They scattered the great assembly down like rain and played heavenly music to make offerings.",
        "source": "T03n0157_002:0181a21_12"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0181a22_13"
    },
    {
        "source_sentence": "爾時寶海梵志復作是念：『若我當來必成阿耨多羅三藐三菩提，所願成就得己利者，",
        "translation": "It was then that the brahmin Jewel-Sea also had another thought, 'If I were to attain unexcelled complete perfect enlightenment in the future, accomplish what I want and obtain my own benefit,",
        "source": "T03n0157_002:0181a22_14"
    },
    {
        "source_sentence": "復當教化諸阿修羅，悉令發於阿耨多羅三藐三菩提心。』",
        "translation": "You will also teach and transform the asura, causing them all to give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0181a24_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0181a25_16"
    },
    {
        "source_sentence": "爾時，梵志作是念已，有五阿修羅王到梵志所，乃至百千無量億那由他阿修羅男子、女人、童男、童女，",
        "translation": "Having thought thus, the brahmin thoughted: “Then five great asura kings came before the brahmin. Hundreds of thousands of myriads of koṭis of nayutas of men, women, girls, boys, and nymphs of the asura kings came to see the brahmin.",
        "source": "T03n0157_002:0181a25_17"
    },
    {
        "source_sentence": "如梵志教發阿耨多羅三藐三菩提心，至於佛所，聽受妙法。",
        "translation": "Suppose a priest teaches that he arouses the mind of unsurpassed, correct, and complete enlightenment and goes to the Buddha to hear and receive the wonderful teaching.",
        "source": "T03n0157_002:0181a28_18"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0181a29_19"
    },
    {
        "source_sentence": "爾時，寶海梵志復作是念：『若我當來必成阿耨多羅三藐三菩提，所願成就得己利者，",
        "translation": "At that time, the brahmin Jewel-Sea also had this thought: In the future I will surely attain unexcelled complete perfect enlightenment.",
        "source": "T03n0157_002:0181a29_20"
    },
    {
        "source_sentence": "復當教化天魔波旬，令發阿耨多羅三藐三菩提心。』",
        "translation": "Again, you will teach the god Māra Pāpīyān and cause him to give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_002:0181b02_21"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_002:0181b03_22"
    },
    {
        "source_sentence": "時魔波旬，即知梵志心之所念，尋與百千無量億那由他男子、女人、童男、童女，",
        "translation": "Knowing what the brahmin’s thoughts were, Māra the Evil One Pāpīyān immediately searched out hundreds of thousands of myriads of koṭis of nayutas of men, women, boys, girls, and goddesses.",
        "source": "T03n0157_002:0181b04_23"
    },
    {
        "source_sentence": "至梵志所敬如教勅，發阿耨多羅三藐三菩提心，乃至聽法亦復如是。」",
        "translation": "Up to the point where a priest venerates them as he teaches and gives rise to the mind of unsurpassed, correct, and complete enlightenment, and so it's likewise with listening to the teaching.",
        "source": "T03n0157_002:0181b05_24"
    },
    {
        "source_sentence": "悲華經卷第二",
        "translation": "Compassionate Flower Scripture, Volume 2",
        "source": "T03n0157_002:0181b08_0"
    }
]