[
    {
        "source_sentence": "佛本行集經卷第四十五",
        "translation": "Fobenxing ji jing, vol. 45",
        "source": "T03n0190_045:0860c23_0"
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Translated by the Tripiṭaka of India, translated by Jñānagupta",
        "source": "T03n0190_045:0860c25_0"
    },
    {
        "source_sentence": "布施竹園品下",
        "translation": "Second Chapter of the Chapter on Giving to the Bamboo Grove",
        "source": "T03n0190_045:0860c26_0"
    },
    {
        "source_sentence": "爾時，王舍大城之中有一長者，名迦蘭陀，國中大富，多有資財，豐饒駈使，",
        "translation": "At that time there was an elder named Kalandaka in the great city of Rājagṛha. His name was Kalandaka and his country was very wealthy, possessing plenty of means of livelihood.",
        "source": "T03n0190_045:0860c27_0"
    },
    {
        "source_sentence": "乃至其家，猶如北方毘沙門宮，一種無異。",
        "translation": "It's like the northern Vaiśravaṇa palace in Vaiśravaṇa, with one kind and no different.",
        "source": "T03n0190_045:0860c28_1"
    },
    {
        "source_sentence": "其迦蘭陀竹林處所，是彼長者自己之物，去城不遠，乃至堪為善人居處。",
        "translation": "That place in the Kalandaka's bamboo forest is his own property, and it's not far from the city or even a place where good people can live.",
        "source": "T03n0190_045:0860c29_2"
    },
    {
        "source_sentence": "彼園中有諸求道人，來去居住，其道人名阿耆毘伽(隋言邪命)。",
        "translation": "In that park, there are people seeking the Way who come and go to live, and those who seek it are called Agnivika (Sui for wrong livelihood).",
        "source": "T03n0190_045:0861a02_3"
    },
    {
        "source_sentence": "（迦葉遺師作如是說：「爾時，四鎮四大天王，告青色身夜叉等言：『汝輩速疾往迦蘭陀竹園之內，",
        "translation": "Kāśyapa's legacy is like this: At the time, the four great celestial kings of the four towns addressed the blue-bodied yakṣas and so forth, saying, 'You must quickly go to the bamboo",
        "source": "T03n0190_045:0861a03_4"
    },
    {
        "source_sentence": "掃灑除却一切沙礫礓石荊棘糞穢土塠，皆令平正，勿使坑坎仰其淨潔，",
        "translation": "He sweeps away all the sand, gravel, stones, thorns, excrement, dirty dirt, and dirty dirt, so that they are not digested in pits or ditches.",
        "source": "T03n0190_045:0861a05_5"
    },
    {
        "source_sentence": "今日世尊欲於彼園安居坐夏。』",
        "translation": "Today, the Bhagavān wants to spend the summer retreat in that park.'",
        "source": "T03n0190_045:0861a07_6"
    },
    {
        "source_sentence": "是時青色夜叉等眾，承彼四大天王之威如是教已，即便白言：『如天王勅。』",
        "translation": "After receiving the authority of those four great celestial kings, the blue-colored yakṣas and others then taught it this way, they even said, 'It's as the heavenly king commands.'",
        "source": "T03n0190_045:0861a07_7"
    },
    {
        "source_sentence": "疾至彼園，掃灑清淨，乃至悉皆平正嚴淨。」",
        "translation": "They quickly go to that park, sweep it clean, and everything is evenly and correctly purified.",
        "source": "T03n0190_045:0861a09_8"
    },
    {
        "source_sentence": "）爾時，有一阿耆毘伽學道之人，於晨朝起，明星將現，見四青色夜叉而來掃灑竹園，",
        "translation": ") At the time, there was an Agnibhika practitioner of the Way who rose in the morning and when the stars were about to appear, he saw four blue-colored yakṣas coming to sweep away the bamboo grove.",
        "source": "T03n0190_045:0861a10_9"
    },
    {
        "source_sentence": "見已即至彼等邊，問作如是言：「長老云何？",
        "translation": "Seeing them, he went to their side and asked, What's the elder?",
        "source": "T03n0190_045:0861a12_10"
    },
    {
        "source_sentence": "汝等是誰？」",
        "translation": "Who are you?",
        "source": "T03n0190_045:0861a13_11"
    },
    {
        "source_sentence": "彼等報言：「仁者！",
        "translation": "They replied, Sir!",
        "source": "T03n0190_045:0861a14_12"
    },
    {
        "source_sentence": "我輩青色夜叉，被四天王駈遣我等來於此處，掃灑竹園，乃至平正。",
        "translation": "We, a group of blue-colored yakṣas, have been deceived by the four heavenly kings and sent to this place by us, sweeping up and down the bamboo grove until it's level.",
        "source": "T03n0190_045:0861a14_13"
    },
    {
        "source_sentence": "如來今欲於此安居經一夏坐，以是義故，我等今來料理此處。」",
        "translation": "The Tathāgata now wants to spend the summer retreat here, so for this reason we've come to take care of this place.",
        "source": "T03n0190_045:0861a16_14"
    },
    {
        "source_sentence": "爾時，阿耆毘伽道人見如是事，過夜日出，速疾往至迦蘭陀所大長者邊，",
        "translation": "At that time the holy monk Agnibhika, seeing such a sight, came out at night and quickly approached the great wealthy man Kalandaka’s side.",
        "source": "T03n0190_045:0861a18_0"
    },
    {
        "source_sentence": "到已語彼迦蘭陀言：「汝大長者！",
        "translation": "When he arrived, he said to Kālānda, You great elder!",
        "source": "T03n0190_045:0861a19_1"
    },
    {
        "source_sentence": "今若知時，昨夜將盡，明星現時，我見有四青色夜叉，掃灑料理於竹林園，",
        "translation": "I see four blue-colored yakṣas, sweeping and tending the bamboo grove in a bamboo grove.",
        "source": "T03n0190_045:0861a20_2"
    },
    {
        "source_sentence": "我既見已，至彼等邊，借問其言：『諸長老輩！",
        "translation": "When I saw them, I went to their side and asked them, 'Elders!",
        "source": "T03n0190_045:0861a22_3"
    },
    {
        "source_sentence": "汝等是誰？』",
        "translation": "Who are you?'",
        "source": "T03n0190_045:0861a23_4"
    },
    {
        "source_sentence": "彼報我言：『我等是彼青色夜叉，被四天王駈使而來至於此處，遣於我等掃此竹園，",
        "translation": "They replied to me, “We are the blue-colored yakṣas. Having been appointed by the four heavenly kings as messengers, we came here and sent them to sweep up this bamboo grove for us.",
        "source": "T03n0190_045:0861a23_5"
    },
    {
        "source_sentence": "而語我言：「汝等至於竹林園內，乃至修治，使令平正，世尊今欲住此安居。",
        "translation": "He said to me, “O World-honored One, go to the bamboo grove and cultivate your practices so as to bring peace and serenity. The World-honored One now wishes to live in this monastery.",
        "source": "T03n0190_045:0861a25_6"
    },
    {
        "source_sentence": "是故我等故來此處，摒擋料理此竹園中。」』」",
        "translation": "That's why we came here to bury and care for this bamboo grove.'",
        "source": "T03n0190_045:0861a27_7"
    },
    {
        "source_sentence": "爾時，阿耆毘伽道人語長者言：「汝今於先將竹林園，奉施沙門瞿曇受用，",
        "translation": "It was then that the holy man Agnibhika said to the householder, “Earlier you offered the bamboo grove in the bamboo grove to the śramaṇa Gautama for his use.",
        "source": "T03n0190_045:0861a29_0"
    },
    {
        "source_sentence": "恐畏於後摩伽陀王頻頭娑羅，奪彼園與沙門瞿曇，汝之長者！",
        "translation": "I'm afraid that the latter Mahāprajāpatī King Bimbisāra will take that park and give it to the ascetic Gautama, your wealthy man!",
        "source": "T03n0190_045:0861b01_1"
    },
    {
        "source_sentence": "當於爾時，恐不得施。",
        "translation": "At that point, I'm afraid I won't be able to give it.",
        "source": "T03n0190_045:0861b03_2"
    },
    {
        "source_sentence": "此之功德，汝當不得，徒自虛損。」",
        "translation": "You won't obtain this merit, and you'll only lose it yourself.",
        "source": "T03n0190_045:0861b03_3"
    },
    {
        "source_sentence": "時，迦蘭陀大富長者，從彼阿耆毘伽道人聞是言已，即詣佛所，半由旬道，",
        "translation": "Then the great wealthy merchant Kālānda, having heard these words from that holy man Agnibhika, approached the Buddha half a yojana in all directions.",
        "source": "T03n0190_045:0861b04_4"
    },
    {
        "source_sentence": "逆逢世尊。",
        "translation": "I've met the Bhagavān.",
        "source": "T03n0190_045:0861b06_5"
    },
    {
        "source_sentence": "其迦蘭陀長者，遙見世尊前來，可憙端正，眾人憙見，乃至諸相莊嚴其身，",
        "translation": "The wealthy man Kalandaka saw the World-honored One coming from a distance. He was so handsome and beautiful that everyone could see him, even to the point where his body was adorned with various marks.",
        "source": "T03n0190_045:0861b06_6"
    },
    {
        "source_sentence": "猶如眾星莊嚴虛空。",
        "translation": "It's like the sky adorned with stars.",
        "source": "T03n0190_045:0861b08_7"
    },
    {
        "source_sentence": "見已即便於世尊所，心生清淨，心生歡喜，詣向佛邊，到佛所已，頂禮佛足，",
        "translation": "Having seen this, they immediately went to the place where the World-honored One was. Their minds became pure and their hearts became joyful. They approached the Buddha. Having arrived there, they bowed at his feet with their heads at his feet.",
        "source": "T03n0190_045:0861b08_8"
    },
    {
        "source_sentence": "手執金瓶，以清淨水，灌於佛手。",
        "translation": "Holding a golden vase in his hand, he poured pure water into the Buddha’s hand.",
        "source": "T03n0190_045:0861b10_9"
    },
    {
        "source_sentence": "爾時，長者口作是言：「善哉！",
        "translation": "It was then that the elder said, Good!",
        "source": "T03n0190_045:0861b12_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0190_045:0861b12_1"
    },
    {
        "source_sentence": "我住王舍，名迦蘭陀，我有一園，稱為竹林，去城不遠，乃至堪為善人安處。",
        "translation": "I live in a royal residence called Kalandaka. There is a park for me called the Bamboo Grove, which is not far from the city and may be a peaceful place for good people.",
        "source": "T03n0190_045:0861b12_2"
    },
    {
        "source_sentence": "我今將彼園奉世尊，世尊為我受彼園，用慈憐愍故。」",
        "translation": "Now, I'll present that park to the Bhagavān, and the Bhagavān will accept that park for me with kindness and pity.",
        "source": "T03n0190_045:0861b14_3"
    },
    {
        "source_sentence": "爾時，佛告彼長者言：「若當有人布施奉佛，或復園林，或復宅地，或餘衣服，",
        "translation": "It was then that the Buddha said to the wealthy man, “Suppose someone were to offer almsfood to the Buddha.",
        "source": "T03n0190_045:0861b16_0"
    },
    {
        "source_sentence": "或餘資財空施佛者，然彼之物，於天人中，即成為塔，餘不得用。」",
        "translation": "Perhaps the rest of their possessions are given to the Buddha in vain, but those things will become a stūpa among gods and humans, and the rest won't be used.",
        "source": "T03n0190_045:0861b17_1"
    },
    {
        "source_sentence": "佛告長者：「汝今若將彼之竹園，布施招提，若在未來，一切大眾，皆悉得用。",
        "translation": "The Buddha told the elder, Now, if you take that bamboo grove and give it to Zhaoti, all the members of the assembly will be able to use it.",
        "source": "T03n0190_045:0861b20_0"
    },
    {
        "source_sentence": "勸汝如是殷重布施。」",
        "translation": "I encourage you to thus give generously.",
        "source": "T03n0190_045:0861b21_1"
    },
    {
        "source_sentence": "時迦蘭陀長者聞佛如是語已，即白佛言：「如世尊教，我不敢違。」",
        "translation": "After hearing the Buddha's words, the elder Kālānda said to the Buddha, As the Bhagavān teaches, I won't dare disobey them.",
        "source": "T03n0190_045:0861b22_2"
    },
    {
        "source_sentence": "爾時，長者重白佛言：「世尊！",
        "translation": "It was then that the elder again said to the Buddha, Bhagavān!",
        "source": "T03n0190_045:0861b24_0"
    },
    {
        "source_sentence": "我今將竹林園，布施未來三世一切眾僧，來者皆隨意用。",
        "translation": "Now, I'll give the bamboo grove to all the saṃgha of the future three times, and those who come will use it as they wish.",
        "source": "T03n0190_045:0861b24_1"
    },
    {
        "source_sentence": "願為於我，受用彼園，憐愍我故。」",
        "translation": "May you take advantage of that park for my sake and enjoy it, having pity for me.",
        "source": "T03n0190_045:0861b25_2"
    },
    {
        "source_sentence": "是時，世尊從迦蘭陀長者之邊受彼竹園，為欲憐愍彼長者故，即說偈頌，",
        "translation": "“Then the World-honored One greeted that bamboo grove from the side of the householder Kalandaka. Out of pity for the householder Kalandaka, he spoke these verses:",
        "source": "T03n0190_045:0861b26_3"
    },
    {
        "source_sentence": "而呪願言：「其偈初云，樹木雜園，乃至略說，即得生天。」",
        "translation": "He then made a vow, saying, At the beginning of the verse, he said, The trees and miscellaneous parks, even briefly explained, will lead to birth in heaven.",
        "source": "T03n0190_045:0861b28_4"
    },
    {
        "source_sentence": "此是世尊最先受施竹園因緣。",
        "translation": "This is the cause and condition for the Bhagavān's earliest acceptance of the donation to the bamboo grove.",
        "source": "T03n0190_045:0861b29_5"
    },
    {
        "source_sentence": "爾時，世尊在王舍城迦蘭陀鳥竹園之內，與大比丘徒眾千人，所謂悉是舊仙螺髻梵志出家。",
        "translation": "At the time, the Bhagavān was staying inside the Kalandaka's bamboo grove in Rājagṛha, accompanied by a large group of monks and thousands of disciples, all called the old sage Śāriput",
        "source": "T03n0190_045:0861c01_6"
    },
    {
        "source_sentence": "佛本行集經大迦葉因緣品第四十七上爾時，去彼王舍大城，不近不遠，",
        "translation": "At that time the Buddha was neither near nor far from the great city of Rājagaha.",
        "source": "T03n0190_045:0861c04_0"
    },
    {
        "source_sentence": "有於一村，名新竪立。",
        "translation": "There was a village named Xinqianli.",
        "source": "T03n0190_045:0861c05_1"
    },
    {
        "source_sentence": "（別有一師作如是言：「摩訶僧祇。」",
        "translation": "(There's another teacher who says, Mahāsāṃghika.",
        "source": "T03n0190_045:0861c06_2"
    },
    {
        "source_sentence": "復作是說：「摩伽陀國王舍大城，有一聚落，其聚落名摩訶娑陀羅(隋言大澤田)，",
        "translation": "Again, he said, “In the great city of Sāvatthī in the kingdom of Magadha there is a village called Mahāsādhara (Sui: mahāsādhara).",
        "source": "T03n0190_045:0861c06_3"
    },
    {
        "source_sentence": "彼處有一娑羅門村，其村還名摩訶娑陀羅。」",
        "translation": "There's a Sramana village there, which is also called Mahāsādhara.",
        "source": "T03n0190_045:0861c08_4"
    },
    {
        "source_sentence": "）而彼村內，有一大富婆羅門，名尼拘盧陀羯波(隋言堪用樹)。",
        "translation": ") In that village, there was a large wealthy brāhmaṇa named Nigrodhakapā (Sui: Able to Use Tree).",
        "source": "T03n0190_045:0861c09_5"
    },
    {
        "source_sentence": "彼大長者，巨富饒財，多有駈使，乃至其家，猶如北方毘沙門天宮宅無異。",
        "translation": "That great wealthy man was very wealthy and prosperous, endowed with many debilitating tendencies, just like the northern palace of Vaiśravaṇa in the north.",
        "source": "T03n0190_045:0861c10_6"
    },
    {
        "source_sentence": "而彼長者大婆羅門，領五百村，處分駈使，受其節度。",
        "translation": "That wealthy man, a great brāhmaṇa, governed over five hundred villages and divided the land into scrip­ tures so as to receive their allowances.",
        "source": "T03n0190_045:0861c12_7"
    },
    {
        "source_sentence": "爾時，摩伽陀國頻頭娑羅王，有一千具犁牛耕地，彼婆羅門，止少一具，",
        "translation": "At that time the king Bindusāra of Magadha had a thousand carts and carts to plow the land with plows and oxen. That brahman lived on less than one cart.",
        "source": "T03n0190_045:0861c14_0"
    },
    {
        "source_sentence": "不滿一千。",
        "translation": "It's less than 1,000.",
        "source": "T03n0190_045:0861c15_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_045:0861c15_2"
    },
    {
        "source_sentence": "恐畏頻頭娑羅大王生嫉妬心，所以故減。",
        "translation": "Fearing that the great king Bimbisāra might become jealous, they decreased.",
        "source": "T03n0190_045:0861c16_3"
    },
    {
        "source_sentence": "其婆羅門所有六畜，不可知數，唯數烟火，知其多少。",
        "translation": "The six animals that the brāhmaṇa had were innumerable, but he only counted the number of smoke and fires and knew their quantity.",
        "source": "T03n0190_045:0861c17_0"
    },
    {
        "source_sentence": "其金錢藏，一切合有二十五窖，而彼大富婆羅門婦，至其園中，遊戲觀看，",
        "translation": "The treasury of gold and silver had twenty-five vaults in all. Then the wealthy brāhmaṇa’s wife went into the garden to play and look at it.",
        "source": "T03n0190_045:0861c18_1"
    },
    {
        "source_sentence": "彼婦因在一畢鉢羅樹下而坐。",
        "translation": "The woman then sat under a pippala tree.",
        "source": "T03n0190_045:0861c19_2"
    },
    {
        "source_sentence": "爾時，彼婦先舊懷娠，即便在彼樹下而產生一童子，可憙端正，眾人樂觀，",
        "translation": "At that time, the queen’s formerly pregnant woman had already given birth to a child under the tree. The boy was attractive and handsome, and all the people enjoyed watching him.",
        "source": "T03n0190_045:0861c21_0"
    },
    {
        "source_sentence": "世間無比，猶如金像。",
        "translation": "The world is incomparable, like a golden image.",
        "source": "T03n0190_045:0861c22_1"
    },
    {
        "source_sentence": "而彼童子初生之時，於彼樹上，即自然出一妙天衣。",
        "translation": "When the boy was first born, he naturally produced a wonderful celestial robe from that tree.",
        "source": "T03n0190_045:0861c23_2"
    },
    {
        "source_sentence": "彼衣現已，其父母見，作是思惟：「此之天衣，必是童子福德故生。」",
        "translation": "When that robe appeared, his parents saw it and thought, This celestial robe must have been born because of the boy's merit.",
        "source": "T03n0190_045:0861c24_3"
    },
    {
        "source_sentence": "是故即因此之瑞相，名畢鉢羅耶那(隋言樹下生)。",
        "translation": "That's why the auspicious sign is called pippalayana (known as 'growing under a tree' in the Sui).",
        "source": "T03n0190_045:0861c25_4"
    },
    {
        "source_sentence": "而彼童子，從生已來，因樹為名，相傳即稱畢鉢羅耶那。",
        "translation": "That boy, however, had been named after the tree since he was born, and it's been called Pippalayana by tradition.",
        "source": "T03n0190_045:0861c26_5"
    },
    {
        "source_sentence": "爾時，父母與彼童子，各別安置四種嬭母，謂抱持嬭、乳餔之嬭、將遊戲嬭、看養育嬭，",
        "translation": "At the time, their parents and that boy were each placed separately in four kinds of lustful mothers, namely, those who embraced a child, those who gave milk to him, those who were about to play with him, and those who nursed",
        "source": "T03n0190_045:0861c28_0"
    },
    {
        "source_sentence": "而彼四嬭，養育洗浴，抱持戲笑，與乳餔飼，令其增長。",
        "translation": "They nourish, wash, bathe, embrace, play, and feed the four kinds of birds with milk to make them grow.",
        "source": "T03n0190_045:0861c29_1"
    },
    {
        "source_sentence": "時，畢鉢羅耶那童子，而其父母，唯此一兒，愛重之心，暫不聽離，若不見時，",
        "translation": "At that time, the boy Pippalayana had only this one child by his parents. Because of their affection for him, they would not allow him to leave them for a moment.",
        "source": "T03n0190_045:0862a02_2"
    },
    {
        "source_sentence": "父母心中，即便不樂。",
        "translation": "In their parents' minds, they don't even enjoy it.",
        "source": "T03n0190_045:0862a03_3"
    },
    {
        "source_sentence": "爾時，童子福德因緣，養育未幾，漸向增長，不久之間，成就智慧，乃至稍大，",
        "translation": "At that time the boy’s virtue gradually grew in strength for a short time. Soon thereafter he perfected wisdom and eventually became even more endowed with it.",
        "source": "T03n0190_045:0862a05_0"
    },
    {
        "source_sentence": "能行能走。",
        "translation": "He's able to walk and can walk.",
        "source": "T03n0190_045:0862a06_1"
    },
    {
        "source_sentence": "而其父母，及胎年數至滿八歲，即為其受婆羅門戒，既受戒已，即便付囑父母家業，",
        "translation": "When their parents and the embryo reached the age of eight, he gave them the Brāhmaṇa precepts. Having received these precepts, he entrusted his family business to his parents.",
        "source": "T03n0190_045:0862a06_2"
    },
    {
        "source_sentence": "諸雜技藝，祭祀法式，悉遣令教，所謂書畫算數刻印，及四韋陀諸授記法，",
        "translation": "All the various arts and crafts, as well as the methods of sacrificial rites and rituals, were sent to be taught by imperial decree. The so-called calligraphy, painting, calculation, engraving, and all the teachings",
        "source": "T03n0190_045:0862a08_3"
    },
    {
        "source_sentence": "世辯言談，受持杖法，大呪術法，闡陀之論，種種文章，五行星宿，度數陰陽，",
        "translation": "He spoke eloquently in the world, upholding the teachings of the cane, the great spells and magic tricks, the treatises of the icchantikas, various writings, the five-lined star constellations, calculating",
        "source": "T03n0190_045:0862a10_4"
    },
    {
        "source_sentence": "渧漏知時。",
        "translation": "When he knows the contaminants of debilitating hindrances, he doesn't know them.",
        "source": "T03n0190_045:0862a12_5"
    },
    {
        "source_sentence": "一日一夜，凡若干時，如是則凶，如是則吉。",
        "translation": "For one day and night, for a certain number of time periods, it's thus bad and thus fortunate.",
        "source": "T03n0190_045:0862a12_6"
    },
    {
        "source_sentence": "又復童子，知地動相，雷鳴震吼，鳥獸鳴呼，飛走驚動，候相盡知一切諸變。",
        "translation": "Again, the boy knows the characteristics of the earth; thunder and lightning shake it. birds and beasts sing and roar, flying and tredding in fear. The signs and omens show all kinds of changes.",
        "source": "T03n0190_045:0862a13_7"
    },
    {
        "source_sentence": "又占相知諸技藝相，知男女相，知六畜相，知人洗淨清淨之行，知受水法受澡罐法，",
        "translation": "They also divine signs to know the characteristics of arts and crafts, male and female bodies, the six kinds of animals, the ways people wash themselves cleanly and purely, the methods for bathing water and the methods for washing a pot",
        "source": "T03n0190_045:0862a15_8"
    },
    {
        "source_sentence": "知受灰法，知唱唄歌，明識吉祥盛衰之相，禳災解除祭祀火神，大人諸天，",
        "translation": "They know the ritual for accepting ashes, and they know how to sing and recite hymns of praise. They clearly discern the signs of the auspicious and the signs of prosperity and demise of the wise. The fire goddess",
        "source": "T03n0190_045:0862a17_9"
    },
    {
        "source_sentence": "悉皆備訖。",
        "translation": "They're all complete.",
        "source": "T03n0190_045:0862a18_10"
    },
    {
        "source_sentence": "既自學已，復能教他，受他物時，或施他物，皆悉學得。",
        "translation": "Having training themselves, they can also teach others. When they receive things from others or give them to others, they will all learn and attain them.",
        "source": "T03n0190_045:0862a19_11"
    },
    {
        "source_sentence": "於世間中，無所不達，無處不知，叡智捷疾，黠慧聰明，敏博辯才，利根多巧。",
        "translation": "There is nothing in the world that he doesn’t understand, and nowhere he doesn’t know. He’s wise and quick-witted, clever and intelligent, sharp and eloquent, with keen faculties and many skills.",
        "source": "T03n0190_045:0862a20_12"
    },
    {
        "source_sentence": "而彼童子，本性質直，常厭世間，知慾不淨，心生捨離。",
        "translation": "That boy, who was straightforward by nature and always disillusioned with the world, knew his desires were impure and abandoned them in his mind.",
        "source": "T03n0190_045:0862a22_13"
    },
    {
        "source_sentence": "以昔曾見諸佛世尊，於彼佛邊種諸善根，修諸功德，已得成就，知諸食相，",
        "translation": "In the past I have seen buddhas, world-honored ones, planting roots of goodness at the side of those buddhas and cultivating virtues. Having perfected them, I know the characteristics of food.",
        "source": "T03n0190_045:0862a23_14"
    },
    {
        "source_sentence": "心多欲入向涅槃門，常欲求出，捨諸煩惱，不受一切世間有為，不受一切生老病死，",
        "translation": "Their minds are full of desire to enter the gate of nirvana. They always wish to seek emancipation, getting rid of all afflictions and not accepting any worldly conditioned things. They do not accept birth, old age, sickness, or",
        "source": "T03n0190_045:0862a24_15"
    },
    {
        "source_sentence": "往昔修行，以爛一切諸業繫縛，因此智力，至成熟地一生補處。",
        "translation": "He cultivated it in the past because he was bound by all the karmic bonds, and with the power of his knowledge, he reached the stage of ripening for one lifetime as a replacement.",
        "source": "T03n0190_045:0862a26_16"
    },
    {
        "source_sentence": "時，畢鉢羅耶那童子父母見其年漸長成，堪受世慾，如是知已，即告彼言：「耶那童子！",
        "translation": "When his parents saw that he was growing old enough to experience worldly desires, they knew it this way and told him, Boy Yaṇasena!",
        "source": "T03n0190_045:0862a29_0"
    },
    {
        "source_sentence": "我欲為兒娉娶女子與兒為侍。」",
        "translation": "I want to serve my child, marry a woman, and take my child as an attendant.",
        "source": "T03n0190_045:0862b01_1"
    },
    {
        "source_sentence": "作是語已，時畢鉢羅耶那童子，白父母言：「波波摩摩！",
        "translation": "After he said this, the boy Upāliyāna then said to his parents, Upamālya!",
        "source": "T03n0190_045:0862b02_2"
    },
    {
        "source_sentence": "我心不樂娶妻畜婦，我意願樂欲修梵行。」",
        "translation": "My mind doesn't delight in taking wives, animals, or women, and I want to cultivate the religious practice.",
        "source": "T03n0190_045:0862b03_3"
    },
    {
        "source_sentence": "爾時，耶那童子父母告其子言：「我所愛子兒，今先須生子立世，然後任當修於梵行。",
        "translation": "It was then that the boy Yaṇa's parents addressed his son, saying, My beloved child, I must first give birth to a child who establishes the world and then let him cultivate the religious practice.",
        "source": "T03n0190_045:0862b05_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0190_045:0862b06_1"
    },
    {
        "source_sentence": "此事相承傳聞說言：『若人無子，無有繼後，彼人終不得生天上。』」",
        "translation": "This is a mutually inherited tradition that says, 'If someone has no children and no successors, they'll never be born in heaven.'",
        "source": "T03n0190_045:0862b07_2"
    },
    {
        "source_sentence": "時，彼童子報父母言：「波波摩摩！",
        "translation": "The boy then reported to his parents, saying, Padmasaṃbhava!",
        "source": "T03n0190_045:0862b08_3"
    },
    {
        "source_sentence": "我今不用立世相傳，亦復不用繼續於後，我當梵行。」",
        "translation": "Now, I don't need to establish worldly transmissions, and I don't need to continue after them; I will practice the religious life.",
        "source": "T03n0190_045:0862b09_4"
    },
    {
        "source_sentence": "如是父母再過三過告畢鉢羅耶那童子，作如是言：「愛子要須立世娶婦。",
        "translation": "Thus, the parents repeatedly and three times in error told the boy Upāliyaṇa, saying, My beloved son, it's necessary to establish a worldly wife for me.",
        "source": "T03n0190_045:0862b10_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0190_045:0862b12_6"
    },
    {
        "source_sentence": "畏我等家當絕嗣胤。」",
        "translation": "They're afraid that our family will be cut off from their heirs.",
        "source": "T03n0190_045:0862b12_7"
    },
    {
        "source_sentence": "時，畢鉢羅耶那童子，乃至三過，被其父母如是惱時，即便捉取閻浮檀金，",
        "translation": "At that moment, the boy Pippalayana, being tormented like this by his parents for three faults, immediately snatched away the gold of Jambudvlpa.",
        "source": "T03n0190_045:0862b13_0"
    },
    {
        "source_sentence": "教於工匠，作婦女形，作已將向其父母邊，出以示現，向其父母，作如是言：「波波摩摩！",
        "translation": "He taught the artisan to make a woman's form, and when he made it, he faced his parents, went out to show it to them, faced their parents, and said,波波摩摩!",
        "source": "T03n0190_045:0862b14_1"
    },
    {
        "source_sentence": "我不用受五慾之樂，願修梵行。",
        "translation": "I don't need to experience the pleasure of the five desires, but rather wish to cultivate the religious practice.",
        "source": "T03n0190_045:0862b16_2"
    },
    {
        "source_sentence": "若必波波摩摩，要欲為我娶婦持立世者，必當須覓如是顏色如閻浮檀金形狀者。」",
        "translation": "If someone must ripen their bodies and wish to marry a woman for me to maintain the world, they must look for someone whose color is like the gold shape of Jambudvīpa.",
        "source": "T03n0190_045:0862b17_3"
    },
    {
        "source_sentence": "時，畢鉢羅耶那童子父母，既見如是事已，心大憂愁，悵怏不樂，心作是念：「我等何處能得婦女如閻浮檀金色形者？」",
        "translation": "After seeing such a thing, the parents of the boy Pippalayana were greatly distressed and disheartened, and they thought, Where can we find a woman with the golden-colored form of Jambudvīpa?",
        "source": "T03n0190_045:0862b20_0"
    },
    {
        "source_sentence": "時，拘盧陀大婆羅門，坐於樓上，心裏不歡，默然而住。",
        "translation": "At that time, the great brāhmaṇa Kumārata was seated in the tower. He did not feel depressed at heart and remained silent.",
        "source": "T03n0190_045:0862b22_1"
    },
    {
        "source_sentence": "爾時，彼家有婆羅門，為其門師，恒常來往，至彼大富婆羅門家。",
        "translation": "At the time, there was a Brāhmaṇa in that house who served as their teacher and always came and went to that great wealthy Brāhmaṇa's house.",
        "source": "T03n0190_045:0862b23_2"
    },
    {
        "source_sentence": "時，彼門師婆羅門來入其家已，而呪願彼富婆羅門，作如是言：「大施檀主！",
        "translation": "After he entered his house, the master of the doorway came and cursed the wealthy Brāhmaṇa, saying, Great donor!",
        "source": "T03n0190_045:0862b26_0"
    },
    {
        "source_sentence": "願汝增加一切財錢，吉祥果報，無所乏少，妻妾子息，願多增益。」",
        "translation": "May you increase all your wealth and possessions, which will be auspicious and fruitful rewards, have nothing to lose, and let your wives, concubines, and children live longer, and wish for much gain.",
        "source": "T03n0190_045:0862b27_1"
    },
    {
        "source_sentence": "復更重問其家人言：「汝之大家！",
        "translation": "Again, he asked the family members again, You people!",
        "source": "T03n0190_045:0862b29_2"
    },
    {
        "source_sentence": "今在何處？」",
        "translation": "Where are you now?",
        "source": "T03n0190_045:0862b29_3"
    },
    {
        "source_sentence": "家人報言：「大婆羅門！",
        "translation": "The family members replied, Great brāhmaṇa!",
        "source": "T03n0190_045:0862c01_4"
    },
    {
        "source_sentence": "我大家今在於樓上，心大悵怏，愁憂不樂，默坐而住。」",
        "translation": "Now, we're all in the tower, and our minds are greatly disheartened. We're sad and unhappy, sitting quietly and staying there.",
        "source": "T03n0190_045:0862c01_5"
    },
    {
        "source_sentence": "時，彼門師婆羅門即至於大富婆羅門邊，如是白言：「願大施主！",
        "translation": "The brāhmaṇa teacher then went to the side of the great wealthy brāhmaṇa and said, May you, Great donor!",
        "source": "T03n0190_045:0862c03_0"
    },
    {
        "source_sentence": "增長家計，宿昔何如？",
        "translation": "What's the past and future like when it grows in family calculations?",
        "source": "T03n0190_045:0862c04_1"
    },
    {
        "source_sentence": "於夜臥時食消以不？",
        "translation": "Do you eat and drink at night while lying in bed?",
        "source": "T03n0190_045:0862c04_2"
    },
    {
        "source_sentence": "又復夜共愛人相戲，受於快樂，稱意以不？」",
        "translation": "Again, at night they play with their loved ones and enjoy pleasure, and do they praise each other?",
        "source": "T03n0190_045:0862c05_3"
    },
    {
        "source_sentence": "而彼主人富婆羅門，默然不報。",
        "translation": "The host, a wealthy brāhmaṇa, remained silent and did not reply.",
        "source": "T03n0190_045:0862c06_4"
    },
    {
        "source_sentence": "彼復問言：「汝今何故默然不報？",
        "translation": "Again, he asked, Why are you now silent and not answering?",
        "source": "T03n0190_045:0862c07_0"
    },
    {
        "source_sentence": "我今如是與汝小來，同苦同樂，汝今何故不共我語？」",
        "translation": "Now that I've been here with you since the distant past, we share the same pain and happiness, so why aren't you talking to me now?",
        "source": "T03n0190_045:0862c07_1"
    },
    {
        "source_sentence": "時，拘盧陀大婆羅門，向其門師婆羅門邊，委說前事，說已語彼婆羅門言：「我今何處得如是女如閻浮檀金色形者？」",
        "translation": "The great brāhmaṇa Kumāda then went to the Brāhmaṇa's side, told him about the previous events, and after he explained them, he said to the Brāhmaṇa, Where can I now find such a woman in the golden",
        "source": "T03n0190_045:0862c09_0"
    },
    {
        "source_sentence": "爾時，門師婆羅門，報大婆羅門，作如是言：「汝大施主富婆羅門！",
        "translation": "It was then that the doorkeeper Brāhmaṇa reported to the great Brāhmaṇa, saying, You great donor, wealthy Brāhmaṇa!",
        "source": "T03n0190_045:0862c11_1"
    },
    {
        "source_sentence": "莫愁莫苦！",
        "translation": "Don't grieve and don't suffer!",
        "source": "T03n0190_045:0862c13_0"
    },
    {
        "source_sentence": "汝既為我作於施主，我所須者，衣食具度，常從汝得，我為汝覓求於如是閻浮檀形金色之女。",
        "translation": "Since you've made me your donor and what I need, I'll always get whatever food and clothing I need from you. I'll search for such a golden-colored woman in the shape of Jambudvīpa for you.",
        "source": "T03n0190_045:0862c13_1"
    },
    {
        "source_sentence": "汝心莫疑，我覓決得，我須道粮，并及道伴，汝覓與我，我共彼等，相隨而去，",
        "translation": "Don’t doubt in your mind. I am able to find the right price for you. I need provisions for the journey and travelling companions, so please give them to me.",
        "source": "T03n0190_045:0862c15_2"
    },
    {
        "source_sentence": "四方求覓。」",
        "translation": "They look for it in all directions.",
        "source": "T03n0190_045:0862c17_3"
    },
    {
        "source_sentence": "爾時，大富婆羅門聞如是語已，稱其所言皆悉辦具，及徒伴與。",
        "translation": "After hearing these words, the great wealthy brāhmaṇa praised what he said and gave them to him in full along with his companions.",
        "source": "T03n0190_045:0862c17_4"
    },
    {
        "source_sentence": "時，彼門師婆羅門，得種種資粮，相發遣已，即作四色神明繖蓋，種種莊挍，",
        "translation": "The brāhmaṇa teachers of the monastery then obtained various provisions and, having sent them to each other, they made a canopy of four-colored divine cloth covering all kinds of adornments.",
        "source": "T03n0190_045:0862c18_5"
    },
    {
        "source_sentence": "立為神明，於其前作種種音樂，前後圍遶。",
        "translation": "He establishes himself as a divine luminosity and creates various kinds of music in front of him, surrounded by them before and behind him.",
        "source": "T03n0190_045:0862c20_6"
    },
    {
        "source_sentence": "或有傘蓋底打金作，其神明面或以銀作，或頗梨作神明之面，或琉璃作神明之面，",
        "translation": "Some of them were made of gold, some of silver, some of crystal, some of lapis lazuli, some of lapis lazuli.",
        "source": "T03n0190_045:0862c21_7"
    },
    {
        "source_sentence": "作已別遣三傘蓋行向於餘方，其一自隨。",
        "translation": "After he had done so, he sent three separate umbrellas to travel to another place, and one of them followed him.",
        "source": "T03n0190_045:0862c23_8"
    },
    {
        "source_sentence": "告彼別道諸人等言：「汝輩所至村邑方處，普告一切諸村女言：『此是神明，",
        "translation": "He said to all the villages and towns wherever you were going, “This is a divine light.",
        "source": "T03n0190_045:0862c24_9"
    },
    {
        "source_sentence": "阿誰女能施設供養？",
        "translation": "Who among the goddesses is able to make offerings?",
        "source": "T03n0190_045:0862c25_10"
    },
    {
        "source_sentence": "若供養者，稱彼女心所欲求願，即得成就。』",
        "translation": "If someone makes an offering, they'll praise the desires and vows of that woman's mind and attain their accomplishment.'",
        "source": "T03n0190_045:0862c26_11"
    },
    {
        "source_sentence": "汝等當觀，其諸女內，若見有女作於金色，汝等當問其姓氏族名字住處，",
        "translation": "\\",
        "source": "T03n0190_045:0862c27_12"
    },
    {
        "source_sentence": "宜速疾來還向我邊。」",
        "translation": "It's better to quickly come back to me.",
        "source": "T03n0190_045:0862c29_13"
    },
    {
        "source_sentence": "如是語已，即便別去。",
        "translation": "Having said these words, he departed.",
        "source": "T03n0190_045:0862c29_14"
    },
    {
        "source_sentence": "時，彼門師大婆羅門，即自將一傘蓋神明，置於囊裹，及食糧具，詣於他方，",
        "translation": "The great brāhmaṇa teacher of the monastery then took an umbrella and a divine light from his own hands, wrapped it in a sack, filled with food and drink, and went to another place.",
        "source": "T03n0190_045:0863a02_0"
    },
    {
        "source_sentence": "或至州村聚落城邑王宮巷陌，所入之處，即將音聲樂彼神明，所至之處有諸女等，",
        "translation": "Or they may go to towns, villages, cities, kingdoms, palaces, roads, or lanes, and wherever they enter into them, their voices will play the goddess’s music. Wherever they go, there will be women",
        "source": "T03n0190_045:0863a03_1"
    },
    {
        "source_sentence": "聞彼音聲，一切悉來，聚集觀察。",
        "translation": "When they hear their sounds, all come and gather together to observe them.",
        "source": "T03n0190_045:0863a05_2"
    },
    {
        "source_sentence": "爾時，彼大婆羅門見諸女集聚，即從囊中，出神明形，示現女輩，口作是言：「汝等女輩！",
        "translation": "Seeing the women assembled, the great brāhmaṇa emerged from his sack and manifested his divine form. He said to them:",
        "source": "T03n0190_045:0863a07_0"
    },
    {
        "source_sentence": "各當供養此之神明，若有女能供養於此神明之者，其女所可有心求願，",
        "translation": "If a woman is able to offer support to the light of that goddess, she can make offerings to him or her.",
        "source": "T03n0190_045:0863a08_1"
    },
    {
        "source_sentence": "即得成就。」",
        "translation": "That's when it's accomplished.",
        "source": "T03n0190_045:0863a10_2"
    },
    {
        "source_sentence": "爾時，彼等一切女輩，即將種種塗香末香華鬘散花，從家將來，欲用供養彼之神明，",
        "translation": "At the time, all of those women scattered various ointments, scents, powders, incense, flowers, garlands, and flowers from their houses to make offerings to that spirit's luminosity.",
        "source": "T03n0190_045:0863a10_3"
    },
    {
        "source_sentence": "如是方便，漸漸行至毘耶離城。",
        "translation": "With this method, he gradually traveled to the city of Vaiśālī.",
        "source": "T03n0190_045:0863a12_4"
    },
    {
        "source_sentence": "爾時，去彼毘耶離城不遠，有於一大村，名迦羅毘迦(隋言赤黃色)，",
        "translation": "At that time, not far from the city of Vaiśālī, there was a large village called kalaviṅka (Sui: red-colored).",
        "source": "T03n0190_045:0863a14_0"
    },
    {
        "source_sentence": "時彼村內，有一巨富大婆羅門，名迦毘羅(隋言黃赤)。",
        "translation": "In that village, there was a very wealthy and great brāhmaṇa named Kapilavastu (known as Yellow Red in the Sui).",
        "source": "T03n0190_045:0863a15_1"
    },
    {
        "source_sentence": "彼婆羅門，富足資財，多饒駈使，乃至彼家，猶如北方毘沙門宮，一種無異。",
        "translation": "That Brāhmaṇa was wealthy and well endowed with all kinds of necessities. He had many servants, and even his householder’s quarters were just like the Vaiśravaṇa’s palace in the northern direction, one",
        "source": "T03n0190_045:0863a16_2"
    },
    {
        "source_sentence": "彼婆羅門，有於一女，名跋陀羅迦卑梨耶(隋言賢色黃女)，彼女可憙，",
        "translation": "That Brāhmaṇa had a woman named Bhadrakapālīya (known in the Sui as Bhadrakavyūha), whose name was Sadāparibhūta.",
        "source": "T03n0190_045:0863a18_3"
    },
    {
        "source_sentence": "端正殊絕，眾人樂見，世無有雙，不短不長，不麤不細，不白不黑，不紫不青，",
        "translation": "It is neither short nor long, neither coarse nor fine, neither white nor black, neither purple nor blue.",
        "source": "T03n0190_045:0863a19_4"
    },
    {
        "source_sentence": "其在盛年，堪為天下玉女之寶。",
        "translation": "In the prosperous years, she's capable of being the treasure of the world's jadelike queen.",
        "source": "T03n0190_045:0863a21_5"
    },
    {
        "source_sentence": "爾時，彼處毘耶離城，有一節日名為燃火，其節日內，有五百女共來集聚，",
        "translation": "At the time, there was a festival in Vaiśālī called “Commission of Fire.” On that festival day, five hundred women came together and assembled.",
        "source": "T03n0190_045:0863a23_0"
    },
    {
        "source_sentence": "跋陀羅女身亦來集在彼會中。",
        "translation": "Bhadra's female body also came and gathered at that assembly.",
        "source": "T03n0190_045:0863a24_1"
    },
    {
        "source_sentence": "爾時，彼將傘蓋神明大婆羅門，詣向於彼諸女之邊，到已從囊即出神明，",
        "translation": "At that time the great brāhmaṇa Candracchattra, carrying an umbrella and a spirit of illumination, approached those maidens. Having arrived there, he came out of his sack [and said to them]:",
        "source": "T03n0190_045:0863a25_2"
    },
    {
        "source_sentence": "示現彼等一切諸女，口作是言：「汝諸女輩！",
        "translation": "Showing all of those women, he said, You women!",
        "source": "T03n0190_045:0863a27_0"
    },
    {
        "source_sentence": "此是天神，最勝最妙，汝等各當供養祭祀，若有女人，供養此神，可有心願皆悉得成。」",
        "translation": "These are the gods and goddesses, the most excellent and marvelous, and each of you should make offerings to them as sacrifices; if there's a woman who makes offerings to this god, they can all be accomplished with mental vows.",
        "source": "T03n0190_045:0863a27_1"
    },
    {
        "source_sentence": "爾時，彼等一切諸女，各將種種末香塗香花鬘散花，速走向彼神明之邊，",
        "translation": "At the time, all those women each scattered various powdered perfumes, ointments, flowers, garlands, and flowers, quickly proceeding toward the edge of that divine light.",
        "source": "T03n0190_045:0863b01_0"
    },
    {
        "source_sentence": "口作是言：「我今供養此天神明。」",
        "translation": "He said, Now, I'll make offerings to this goddess of insight.",
        "source": "T03n0190_045:0863b02_1"
    },
    {
        "source_sentence": "唯自有彼跋陀羅女，獨不肯往近彼神明，而彼一切諸女伴輩強抱其將往神明邊，",
        "translation": "But the woman Bhadra alone would not go to that goddess, and all her companions forcibly embraced her as she was about to go.",
        "source": "T03n0190_045:0863b03_2"
    },
    {
        "source_sentence": "亦到彼處。",
        "translation": "They'll also go there.",
        "source": "T03n0190_045:0863b05_3"
    },
    {
        "source_sentence": "其威光力，彼閻浮檀金色之形即無威光，便失本色。",
        "translation": "Because of its authoritative luminosity, the golden-colored shape of Jambudvīpa has no authoritative luminosity and loses its original color.",
        "source": "T03n0190_045:0863b05_4"
    },
    {
        "source_sentence": "爾時，彼處跋陀羅女，於女伴邊出力挺身，即便得脫，走向自家，白己父母，",
        "translation": "At that time, the Bhadra’s daughter at that place came out from her maidservant’s side and straightened her legs.",
        "source": "T03n0190_045:0863b07_0"
    },
    {
        "source_sentence": "作如是言：「波波摩摩！",
        "translation": "He said, Upagupta-mātṛ!",
        "source": "T03n0190_045:0863b08_1"
    },
    {
        "source_sentence": "願莫將我與於餘人。",
        "translation": "Please don't give me to anyone else.",
        "source": "T03n0190_045:0863b09_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0190_045:0863b09_3"
    },
    {
        "source_sentence": "我今不用人作夫主，我心中欲修行梵行。」",
        "translation": "Now, I don't need someone to be my husband and wife, but I want to cultivate the religious practice in my mind.",
        "source": "T03n0190_045:0863b09_4"
    },
    {
        "source_sentence": "爾時，彼女所有兄弟，語跋陀羅，作如是言：「阿姊阿妹！",
        "translation": "It was then that all the brothers of the woman spoke to Bhadra and said, A sister!",
        "source": "T03n0190_045:0863b10_5"
    },
    {
        "source_sentence": "我等實亦不欲與汝暫時別離，但我等輩，若不嫁汝，於道理中，復不能得。",
        "translation": "We really don't want to part with you temporarily, but we are a group of people. If we don't marry you, we won't be able to attain it in principle.",
        "source": "T03n0190_045:0863b11_6"
    },
    {
        "source_sentence": "世人或言，是女兄弟必於其邊有邪私意，是故不肯嫁與他人，恐涉此疑。」",
        "translation": "People in the world might say, 'These women and brothers must have wrong private intentions at their side; therefore, they won't marry others, lest they become involved in this doubt.'",
        "source": "T03n0190_045:0863b13_7"
    },
    {
        "source_sentence": "是時，彼女兄弟復更作如是言：「汝但莫愁！",
        "translation": "At that point, the two brothers again said, Don't be sad!",
        "source": "T03n0190_045:0863b16_0"
    },
    {
        "source_sentence": "我等若當將汝欲許於他人者，會當為汝多索錢財，而彼人求，若不能辦多許錢物，",
        "translation": "If we were to give your money to someone else, they would ask a great deal of money and property for you. But if that person asks for it but doesn’t manage the large amount of money and property,",
        "source": "T03n0190_045:0863b16_1"
    },
    {
        "source_sentence": "則汝自然不離家居。」",
        "translation": "Then you won't naturally leave home.",
        "source": "T03n0190_045:0863b18_2"
    },
    {
        "source_sentence": "而彼兄弟，可有人來求彼女者，即作是言：「若人欲求我姊妹者，還聚好金，",
        "translation": "And those brothers, suppose someone comes and asks for a woman. They say, “If someone wants to ask for my sisters, they’ll gather back some nice gold",
        "source": "T03n0190_045:0863b19_3"
    },
    {
        "source_sentence": "令如女大，乃當相與。」",
        "translation": "They'll give it to each other if they make a woman as large as that.",
        "source": "T03n0190_045:0863b21_0"
    },
    {
        "source_sentence": "爾時，彼所求女門師大婆羅門，將閻浮金女形行者，既覩於彼跋陀羅女見已，",
        "translation": "At that time, the great brāhmaṇa Maitrāyaniputra, the teacher of the female disciples he sought, took the form of a golden-haired woman in Jambudvīpa.",
        "source": "T03n0190_045:0863b22_0"
    },
    {
        "source_sentence": "問彼諸別女言：「此女是誰？",
        "translation": "He asked the other women, Who is this woman?",
        "source": "T03n0190_045:0863b23_1"
    },
    {
        "source_sentence": "誰家所生？」",
        "translation": "Who's born at home?",
        "source": "T03n0190_045:0863b24_2"
    },
    {
        "source_sentence": "時，彼諸女報於彼客婆羅門言：「此處有一最勝巨富大婆羅門，名迦毘羅，",
        "translation": "The women then reported to the visiting brāhmaṇa, saying: “There is a very wealthy brāhmaṇa named Kapilavastu.",
        "source": "T03n0190_045:0863b24_3"
    },
    {
        "source_sentence": "彼是其女。」",
        "translation": "That's his daughter.",
        "source": "T03n0190_045:0863b26_4"
    },
    {
        "source_sentence": "爾時，彼客婆羅門聞此因緣已，日將欲沒，至黃昏時，漸到於彼富婆羅門迦毘羅家。",
        "translation": "After hearing these reasons, the guest brāhmaṇa was about to go down in the sun and gradually arrived at the house of the wealthy brāhmaṇa Kapilavastu toward dusk.",
        "source": "T03n0190_045:0863b27_0"
    },
    {
        "source_sentence": "到其家已，從乞寄宿，而彼家人，即便許可，借其宿處。",
        "translation": "When he arrived at the house, he asked for permission to spend the night in it, but the other family members agreed and borrowed a place to sleep.",
        "source": "T03n0190_045:0863b28_1"
    },
    {
        "source_sentence": "時彼寄宿客婆羅門，過其夜已，至彼後日於晨朝時，詣迦毘羅婆羅門邊，",
        "translation": "After the night had passed, the brāhmaṇa stayed overnight at Kapilavastu. On the day after his arrival there, in the morning, he approached the brāhmaṇa Kapilavastu.",
        "source": "T03n0190_045:0863c01_2"
    },
    {
        "source_sentence": "到其邊已，即在其前而呪願言：「願此仁者婆羅門家，常勝增長。」",
        "translation": "When he arrived at their side, he was in front of them and made a vow, saying, May this kind man's brāhmaṇa family always be superior and grow.",
        "source": "T03n0190_045:0863c02_3"
    },
    {
        "source_sentence": "作於如是呪願畢已，却坐一面。",
        "translation": "After he had made this vow, he withdrew and sat to one side.",
        "source": "T03n0190_045:0863c04_4"
    },
    {
        "source_sentence": "其迦毘羅問於彼客婆羅門言：「仁者！",
        "translation": "Kapilavastu asked the guest Brāhmaṇa, saying, Sir!",
        "source": "T03n0190_045:0863c04_5"
    },
    {
        "source_sentence": "昨夜安隱以不？",
        "translation": "Did you have a peaceful night last night?",
        "source": "T03n0190_045:0863c05_6"
    },
    {
        "source_sentence": "宿昔何如？」",
        "translation": "What was it like in the past?",
        "source": "T03n0190_045:0863c06_7"
    },
    {
        "source_sentence": "是時，彼客婆羅門，報作如是言：「我昨夜中，甚大安隱，快樂無惱。」",
        "translation": "The guest Brāhmaṇa then replied, Yesterday night, I was so peaceful and happy without disturbance.",
        "source": "T03n0190_045:0863c06_8"
    },
    {
        "source_sentence": "爾時，彼家跋陀羅女，於晨朝時從眠臥起，至其父邊，到已頂禮於其父足，",
        "translation": "At that time, in the morning, the daughter of Bhadra’s family rose from her bed at dawn and went to her father’s side. Having arrived there, she bowed down at his feet.",
        "source": "T03n0190_045:0863c08_0"
    },
    {
        "source_sentence": "却立一面。",
        "translation": "He stood to one side.",
        "source": "T03n0190_045:0863c09_1"
    },
    {
        "source_sentence": "時，彼求女客婆羅門，白迦毘羅富婆羅門，作如是言：「善哉仁者！",
        "translation": "The brāhmaṇa who sought the woman then addressed the brāhmaṇa Kapilavastu and said, Good, my lord!",
        "source": "T03n0190_045:0863c09_2"
    },
    {
        "source_sentence": "此是誰女？」",
        "translation": "Who is this woman?",
        "source": "T03n0190_045:0863c11_3"
    },
    {
        "source_sentence": "其迦毘羅報彼客言：「是我之女。」",
        "translation": "Kapilavastu replied to the guest, This is my daughter.",
        "source": "T03n0190_045:0863c11_4"
    },
    {
        "source_sentence": "彼婆羅門復問：「仁者！",
        "translation": "The Brāhmaṇa again asked, Sir!",
        "source": "T03n0190_045:0863c12_5"
    },
    {
        "source_sentence": "此女頗有與處以不？」",
        "translation": "Is there a place for this woman?",
        "source": "T03n0190_045:0863c12_6"
    },
    {
        "source_sentence": "迦毘羅言：「此女未有許與他處。」",
        "translation": "Kapilavastu said, This woman hasn't given it to anyone else.",
        "source": "T03n0190_045:0863c13_7"
    },
    {
        "source_sentence": "時，彼求女客婆羅門，即白主人迦毘羅言：「大富仁者！",
        "translation": "The Brāhmaṇa who was seeking women then addressed his host Kapilavastu, saying, Great wealthy man!",
        "source": "T03n0190_045:0863c14_0"
    },
    {
        "source_sentence": "摩伽陀國有一聚落，名摩訶娑陀羅，彼聚落內有於一村，其村還名摩訶娑陀羅，",
        "translation": "In the country of Magadha, there's a village named Mahāsādhara; within that village there's a village, which is also called Mahāsādhara.",
        "source": "T03n0190_045:0863c15_1"
    },
    {
        "source_sentence": "其中有一大婆羅門，名尼拘盧陀羯波，巨富饒財。",
        "translation": "Among them was a great brāhmaṇa named Nirgranthakapāda, who was very wealthy and prosperous.",
        "source": "T03n0190_045:0863c17_2"
    },
    {
        "source_sentence": "彼有一子，名畢鉢羅耶那摩那婆，諸義自解，復能教他，於三韋陀，悉皆洞解。",
        "translation": "He had a son named Upāliyaṇa Manabha, who understood all the meanings for himself and was also able to teach others so that they could fully understand the three Vedas.",
        "source": "T03n0190_045:0863c18_3"
    },
    {
        "source_sentence": "復解一事十名之論，及尼乾輈書論，往事五明論等，一句半句，一偈半偈，",
        "translation": "He also understood one treatise on the ten names of a single doctrine, as well as the Nirgrantha-śāstra and the Nirgrantha-śāstra. In addition, he went on to study the theories of the five branches of",
        "source": "T03n0190_045:0863c19_4"
    },
    {
        "source_sentence": "皆能分別。",
        "translation": "They can all discern them.",
        "source": "T03n0190_045:0863c21_5"
    },
    {
        "source_sentence": "授記世辯，六十種論，解大丈夫諸要相等，一切技藝，無所乏少。」",
        "translation": "He teaches worldly eloquence, explains 60 kinds of treatises, understands the essentials of greatness equally, and has no lack of all arts and skills.",
        "source": "T03n0190_045:0863c21_6"
    },
    {
        "source_sentence": "爾時，彼客婆羅門說如是語已，白主人言：「今勸仁者！",
        "translation": "After he spoke these words, the guest Brāhmaṇa said to his host, Now, you're encouraged, sir!",
        "source": "T03n0190_045:0863c23_7"
    },
    {
        "source_sentence": "將此女與彼摩那婆，持以為妻。」",
        "translation": "Take this woman to that manasattva and take her as your wife.",
        "source": "T03n0190_045:0863c24_8"
    },
    {
        "source_sentence": "是時，彼大富婆羅門及諸兒子，報於彼客婆羅門言：「大婆羅門！",
        "translation": "The great wealthy brāhmaṇa and his sons then reported to the guest brāhmaṇa, saying, Great brāhmaṇa!",
        "source": "T03n0190_045:0863c25_9"
    },
    {
        "source_sentence": "此女若嫁，索多錢財，有誰能取？」",
        "translation": "If this woman is married and asks for a lot of money and possessions, who will be able to take them?",
        "source": "T03n0190_045:0863c26_10"
    },
    {
        "source_sentence": "客婆羅門問主人言：「索幾多財？」",
        "translation": "The guest Brāhmaṇa asked the host, How much money do you ask for?",
        "source": "T03n0190_045:0863c27_11"
    },
    {
        "source_sentence": "彼等報言：「稱此女形，索若干金。」",
        "translation": "They replied, Calling this woman's form, they asked for a certain amount of gold.",
        "source": "T03n0190_045:0863c28_12"
    },
    {
        "source_sentence": "爾時，彼客婆羅門聞，即從袋出彼閻浮檀金女之形，示現於彼父母兄弟，",
        "translation": "At that time, on hearing this, the guest brahman came out of his sack and emerged in the form of a golden-haired woman from Jambudvlpa. He appeared before her parents and brothers.",
        "source": "T03n0190_045:0863c29_0"
    },
    {
        "source_sentence": "訖作是言：「此閻浮檀金色之形，應稱是女，汝等當取與我此女。」",
        "translation": "He then said, This is the golden-colored form of Jambudvīpa, which should be called a woman; you must take her and give her to me.",
        "source": "T03n0190_045:0864a01_1"
    },
    {
        "source_sentence": "爾時，彼女父母兄弟作如是念：「應彼處人聞我此女如是端正，集聚多許閻浮檀金，",
        "translation": "At the time, her parents and brothers had this thought:",
        "source": "T03n0190_045:0864a03_2"
    },
    {
        "source_sentence": "造作女形，使若干大。」",
        "translation": "He creates a woman's form so that it becomes several large.",
        "source": "T03n0190_045:0864a04_3"
    },
    {
        "source_sentence": "爾時，彼女父母兄弟共如是言：「我等今者若取此形閻浮檀金，不觀彼家錢財多少，",
        "translation": "At that time, the daughter’s parents and brothers said to each other in unison:",
        "source": "T03n0190_045:0864a06_0"
    },
    {
        "source_sentence": "又不諳悉其國禮儀法則高下，我女脫若至於彼家，當見苦惱，今須密使私觀彼家。」",
        "translation": "Also, I don't know how high and low their countries are in terms of mannerisms and rituals, and if my daughter goes to that house without permission, she'll see suffering and distress, so now I must secretly allow her to look inside the house",
        "source": "T03n0190_045:0864a07_1"
    },
    {
        "source_sentence": "作是念已，告彼求女婆羅門言：「善使仁者大婆羅門！",
        "translation": "After he had this thought, he told the woman-seeking brāhmaṇa, Good envoy, you great brāhmaṇa!",
        "source": "T03n0190_045:0864a09_2"
    },
    {
        "source_sentence": "我今欲遣使觀彼家法用云何？",
        "translation": "Now, I want to send an envoy to observe what's the function of that family's teaching?",
        "source": "T03n0190_045:0864a10_3"
    },
    {
        "source_sentence": "然後思量可與以不？」",
        "translation": "Will you give it to me after that?",
        "source": "T03n0190_045:0864a11_4"
    },
    {
        "source_sentence": "是時，彼客大婆羅門報言：「如是！",
        "translation": "The guest great brāhmaṇa replied, So it is!",
        "source": "T03n0190_045:0864a12_5"
    },
    {
        "source_sentence": "任意當觀。」",
        "translation": "You should observe it at will.",
        "source": "T03n0190_045:0864a12_6"
    },
    {
        "source_sentence": "爾時，彼客大婆羅門作是語已，即辭主人，歸還本國，到尼拘盧陀羯波婆羅門邊，",
        "translation": "Having said these words, the guest great brāhmaṇa departed his host and returned home.",
        "source": "T03n0190_045:0864a14_0"
    },
    {
        "source_sentence": "到已白言：「善勝仁者大婆羅門，心應歡喜，我求得女如閻浮檀金色形者，",
        "translation": "When he arrived, he said, “O Sunetra, great brāhmaṇa, my heart should be overjoyed. I wish to have a woman of the golden color of Jambudvīpa’s sandalwood.",
        "source": "T03n0190_045:0864a15_1"
    },
    {
        "source_sentence": "彼甚可憙端正無雙，眾人樂見。」",
        "translation": "They're so beautiful and handsome that they're unsurpassed in their appearance, and the crowds are happy to see them.",
        "source": "T03n0190_045:0864a17_2"
    },
    {
        "source_sentence": "時，彼大富婆羅門，問於彼求女婆羅門言：「大婆羅門！",
        "translation": "The great wealthy brāhmaṇa then asked the woman-seeking brāhmaṇa, Great brāhmaṇa!",
        "source": "T03n0190_045:0864a19_0"
    },
    {
        "source_sentence": "仁者何處得見是女？」",
        "translation": "Where did you see this woman, my dear friend?",
        "source": "T03n0190_045:0864a20_1"
    },
    {
        "source_sentence": "彼婆羅門即報之言：「彼女舍去毘耶離城，其間不遠，有於一村名迦毘羅，",
        "translation": "The brahman reported to him, saying: Not far from the city of Vaiśālī, there is a village called Kapilavastu.",
        "source": "T03n0190_045:0864a20_2"
    },
    {
        "source_sentence": "其內有一富婆羅門名迦毘羅，彼婆羅門有女名曰跋陀羅迦卑梨耶。」",
        "translation": "Inside it, there was a wealthy Brāhmaṇa named Kapilavastu, and that Brāhmaṇa had a woman named Bhadrakapālīya.",
        "source": "T03n0190_045:0864a22_3"
    },
    {
        "source_sentence": "爾時，畢鉢羅耶那父母聞是事已，心大歡喜，遍滿其體，不能自勝。",
        "translation": "At that point, the parents of Pippalayana heard this, and their hearts rejoiced greatly, filling their bodies with joy, unable to control themselves.",
        "source": "T03n0190_045:0864a24_0"
    },
    {
        "source_sentence": "是時，尼拘盧陀羯波大婆羅門，即便置立從己坐村連接，乃至毘耶離城，",
        "translation": "At that time the great brāhmaṇa Nirgranthakapāda stood upright and proceeded from his seated village to the city of Vaiśālī.",
        "source": "T03n0190_045:0864a25_1"
    },
    {
        "source_sentence": "其間步地半由旬道安一牛群，并造客舍，如是處處安置訖了。",
        "translation": "At half a yojana's distance between them, he placed a herd of cattle and built guest dwellings on the road, placing them all in this way.",
        "source": "T03n0190_045:0864a27_2"
    },
    {
        "source_sentence": "時，迦毘羅大婆羅門，告於彼等當牧牛人，作如是言：「汝等各應如是備擬，",
        "translation": "The great brāhmaṇa Kapilavastu then addressed the cowherd, saying:",
        "source": "T03n0190_045:0864a28_3"
    },
    {
        "source_sentence": "若其有人，從毘耶離城來於此，彼等所須一切諸物，汝等迎接供奉彼人，",
        "translation": "If someone comes here from the city of Vaiśālī, greet and offer them whatever they need.",
        "source": "T03n0190_045:0864b01_4"
    },
    {
        "source_sentence": "勿令乏短。」",
        "translation": "Don't let them lack it.",
        "source": "T03n0190_045:0864b02_5"
    },
    {
        "source_sentence": "爾時，跋陀羅卑梨耶女兄弟從其家出，向摩伽陀，至王舍城。",
        "translation": "It was then that the Bhadraptiya brothers left their house and headed for Magadha, arriving in the city of Rājagṛha.",
        "source": "T03n0190_045:0864b04_0"
    },
    {
        "source_sentence": "彼等值初第一牛群所居之處，彼處諸人，曲躬出迎，口作是言：「善來人輩！",
        "translation": "At the first place where the herd of cows lived, the people there bow out to greet them and say, Well come, you people!",
        "source": "T03n0190_045:0864b05_1"
    },
    {
        "source_sentence": "從於何方遠來到此？」",
        "translation": "Where did you come from and where did you come from?",
        "source": "T03n0190_045:0864b07_2"
    },
    {
        "source_sentence": "即引將入客舍之中，以諸香湯與令澡浴，復以種種香塗其身，復將種種無價之衣，",
        "translation": "He led them into the guest’s quarters, bathed them in scented warm water, anointed their bodies with various perfumes, and provided them with various priceless robes.",
        "source": "T03n0190_045:0864b07_3"
    },
    {
        "source_sentence": "與其令著，復將種種雜好香花，結用作鬘，置其頭上。",
        "translation": "He gave it to them so that they would put it on their heads, and then he gathered various kinds of good fragrant flowers and mixed them into a bowl and placed them on their heads.",
        "source": "T03n0190_045:0864b09_4"
    },
    {
        "source_sentence": "然後別將種種甘美餚饍飲食，與其令噉，所謂唼[口*束]嚼齧嘗啜，",
        "translation": "Then he gave them various delicious foods and drinks to partake of. They were then given the name mouthful [mouth * bundle], chewed, roasted, and sipped.",
        "source": "T03n0190_045:0864b10_5"
    },
    {
        "source_sentence": "種種味具，皆悉充足。",
        "translation": "All kinds of delicacies and food were plentiful.",
        "source": "T03n0190_045:0864b12_6"
    },
    {
        "source_sentence": "自恣飽已，始告語言：「此中即是我等牛舍，可停一宿，後日早起，隨意而行。」",
        "translation": "After he had satisfied himself, he began to tell them, This is our ox-house, so we can stay here for one night and get up early the next day to go as we wish.",
        "source": "T03n0190_045:0864b12_7"
    },
    {
        "source_sentence": "時，彼等客問牛子言：「此誰牛舍？」",
        "translation": "The guests then asked the cowherd, Who is this cow's house?",
        "source": "T03n0190_045:0864b14_8"
    },
    {
        "source_sentence": "牛子報言：「此是尼拘盧陀羯波富婆羅門牧牛之舍，故為仁等，客行安立，",
        "translation": "The cowherd replied, “This is the cattle herding hut of the brāhmaṇa Nirgrantha Kassapa.",
        "source": "T03n0190_045:0864b14_9"
    },
    {
        "source_sentence": "恐畏仁等行來疲乏，飢渴困極，所須不得。」",
        "translation": "I'm afraid you'll be exhausted, hungry and thirsty, and unable to get what you need.",
        "source": "T03n0190_045:0864b16_10"
    },
    {
        "source_sentence": "而彼客人，一夜安臥，後日起行。",
        "translation": "That guest, however, spent the night lying down and traveled on the following day.",
        "source": "T03n0190_045:0864b17_11"
    },
    {
        "source_sentence": "如是次第值於第二牛群之舍，如是第三第四第五第六第七，悉皆如是出迎承接，",
        "translation": "In this way, in order, they came to the house of the second herd of cows. The third, the fourth, the fifth, the sixth, and the seventh sheds all came out to receive them.",
        "source": "T03n0190_045:0864b18_12"
    },
    {
        "source_sentence": "復口白言：「汝等仁輩！",
        "translation": "Again, he said, You people!",
        "source": "T03n0190_045:0864b20_13"
    },
    {
        "source_sentence": "從何遠來？",
        "translation": "Where did you come from?",
        "source": "T03n0190_045:0864b20_14"
    },
    {
        "source_sentence": "乃至令宿一夜，安樂眠臥，後日隨意而行。」",
        "translation": "It's up to the end of the night, when he sleeps and lies soundly asleep in comfort and walks as he wishes on the following day.",
        "source": "T03n0190_045:0864b20_15"
    },
    {
        "source_sentence": "時，彼等客問主人言：「如是牛舍，可有幾許？」",
        "translation": "The guests then asked the host, How many feet does this ox-house have?",
        "source": "T03n0190_045:0864b22_0"
    },
    {
        "source_sentence": "牛子報言：「從彼摩訶娑陀羅村已來，至於毘耶離城，半由旬間，置一牛舍。」",
        "translation": "The cowherd replied, From that village of Mahāsādhara up to the city of Vaiśālī, for half a yojana, I'll place a cowhouse.",
        "source": "T03n0190_045:0864b22_1"
    },
    {
        "source_sentence": "爾時，跋陀羅迦卑梨耶女兄弟，共聞如此語已，即作是念：「彼人牛舍，",
        "translation": "It was then that the Bhadrakapālīya brothers, having heard these words together, had this thought:",
        "source": "T03n0190_045:0864b24_2"
    },
    {
        "source_sentence": "尚有若干，其餘錢財，更何須說？",
        "translation": "There are still some, but the rest of the money and possessions need not be explained.",
        "source": "T03n0190_045:0864b26_3"
    },
    {
        "source_sentence": "我等從此應須迴反還向本家，我等當以我之姊妹，嫁與彼家，以為其婦。」",
        "translation": "From here, we should return back to our original home; we'll marry our sisters to that house and make them their wives.",
        "source": "T03n0190_045:0864b26_4"
    },
    {
        "source_sentence": "時，彼兄弟即遣使人告彼大富婆羅門言：「汝來可取我之姊妹為汝新婦。」",
        "translation": "The brothers then sent an envoy to the great wealthy brāhmaṇa, saying, Come and take my sister as your new wife.",
        "source": "T03n0190_045:0864b29_0"
    },
    {
        "source_sentence": "作是語已，從彼迴還。",
        "translation": "After he says this, he returns from there.",
        "source": "T03n0190_045:0864c01_1"
    },
    {
        "source_sentence": "時，畢鉢羅耶摩那婆，聞於使人以得稱其心意之女，聞已即作如是念言：「我今應當自往觀看彼女，",
        "translation": "Hearing this, Pippalāyāmaṇabha thought: I should go and see the queen.",
        "source": "T03n0190_045:0864c02_2"
    },
    {
        "source_sentence": "實有如是德行智慧以不？」",
        "translation": "Is there really such virtue, practice, and wisdom?",
        "source": "T03n0190_045:0864c04_3"
    },
    {
        "source_sentence": "是時，畢鉢羅耶童子即便至己父母之邊，長跪白言：「菴婆多多！",
        "translation": "At that point, the boy Pippalāya went to his parents' side and knelt down long enough to say, Upagupta!",
        "source": "T03n0190_045:0864c04_4"
    },
    {
        "source_sentence": "我心實亦不用五欲願修梵行，而尊長今既強為我求於匹對，是故我今自應往彼次第乞食，",
        "translation": "Venerable sir, it is true that my mind does not rely on the five kinds of desire to practice celibacy. But now that you have forced me to beg for a partaking of food and drink, I should go there in order to solicit alms",
        "source": "T03n0190_045:0864c06_5"
    },
    {
        "source_sentence": "觀看彼女，實如使人言語以不？」",
        "translation": "Look at that woman, is she really like the messenger's words?",
        "source": "T03n0190_045:0864c08_6"
    },
    {
        "source_sentence": "時，其父母即告子言：「若知時者，汝當自行。」",
        "translation": "The parents then addressed their children, saying, If you know the time, you must go on your own.",
        "source": "T03n0190_045:0864c10_0"
    },
    {
        "source_sentence": "而彼童子，即便辭行，次第乞食，漸漸至迦卑羅迦村。",
        "translation": "The boy then departed, went to the village of Kapilavastu, begged for almsfood one by one, and gradually arrived there.",
        "source": "T03n0190_045:0864c10_1"
    },
    {
        "source_sentence": "時彼國內，有如是法，若有沙門若婆羅門來乞食者，女手將食出與彼人。",
        "translation": "At the time, there was a rule in that country that if an ascetic or brāhmaṇa came to solicit alms, the woman's hand would give food to him.",
        "source": "T03n0190_045:0864c12_2"
    },
    {
        "source_sentence": "爾時，跋陀羅女，即從其家，自將食出，授與彼客摩那婆手。",
        "translation": "At that point, the Bhadra's daughter left her house, went out for food on her own, and gave it to the guest Manabha in his hand.",
        "source": "T03n0190_045:0864c13_3"
    },
    {
        "source_sentence": "爾時，畢鉢羅耶見彼女已，作如是念：「此決定應是彼女也。」",
        "translation": "After he saw that woman, Upāliya thought, This must surely be a woman.",
        "source": "T03n0190_045:0864c16_0"
    },
    {
        "source_sentence": "是時其女，自手授與彼摩那婆飯食訖已，頂禮其足，却住一面。",
        "translation": "The woman then handed the rice and food to Mānava with her own hands, bowed her head at his feet, and withdrew to one side.",
        "source": "T03n0190_045:0864c17_1"
    },
    {
        "source_sentence": "時摩那婆問彼女言：「仁者善女！",
        "translation": "Manabha then asked the woman, Sir, good girl!",
        "source": "T03n0190_045:0864c18_2"
    },
    {
        "source_sentence": "有嫁處未？」",
        "translation": "Is there a place to marry?",
        "source": "T03n0190_045:0864c19_3"
    },
    {
        "source_sentence": "爾時，彼女即便報言：「仁者摩那婆！",
        "translation": "At that point, the woman even replied, Sir Manabha!",
        "source": "T03n0190_045:0864c20_0"
    },
    {
        "source_sentence": "摩伽陀國有一聚落，其聚落名摩訶羯波，彼處有一婆羅門村，彼村有一富婆羅門名尼拘盧陀羯波，",
        "translation": "In the country of Magadha, there's a village named Mahākāpa, and there's a Brāhmaṇa village there, and in that village there's a wealthy Brāhmaṇa named Nikuladakarpa.",
        "source": "T03n0190_045:0864c20_1"
    },
    {
        "source_sentence": "彼有一子名畢鉢羅耶，我之父母，以將我許與彼為妻。」",
        "translation": "There was a son named Pippalāya, and my parents gave me permission to him as their wife.",
        "source": "T03n0190_045:0864c23_2"
    },
    {
        "source_sentence": "爾時，畢鉢羅耶即便報彼跋陀羅女，作如是言：「善女！",
        "translation": "It was then that Pippalāya even reported to the Bhadra's daughter, saying, Good girl!",
        "source": "T03n0190_045:0864c25_0"
    },
    {
        "source_sentence": "我聞彼摩那婆，內心不用行於五慾，願修梵行。」",
        "translation": "I've heard that Manabha doesn't use the five desires in his mind to cultivate religious practice.",
        "source": "T03n0190_045:0864c26_1"
    },
    {
        "source_sentence": "是時，彼女即便諮白摩那婆言：「大婆羅門！",
        "translation": "The woman then even asked Manabha, Great brāhmaṇa!",
        "source": "T03n0190_045:0864c27_2"
    },
    {
        "source_sentence": "我今得聞如是言者，甚大歡喜，我亦不用行於五慾，願修梵行。",
        "translation": "Now that I have heard such words, I am overjoyed. Nor should I indulge in the desires of the five senses and wish to practice austerity.",
        "source": "T03n0190_045:0864c28_3"
    },
    {
        "source_sentence": "今日許他，此是父母世間之意，我實不用。",
        "translation": "Today, I'll allow others to do so. This is my father and mother's worldly intention, but I really don't use it.",
        "source": "T03n0190_045:0864c29_4"
    },
    {
        "source_sentence": "今強以我，隨同世人，適彼為妻。」",
        "translation": "Now, I'm forcing myself to follow the same worldly people as their wives.",
        "source": "T03n0190_045:0865a01_5"
    },
    {
        "source_sentence": "爾時，畢鉢羅耶童子聞是語已，問彼女言：「謂仁善女！",
        "translation": "After hearing these words, the boy Pippalāya asked the woman, saying, Yes, you're a kind and good girl!",
        "source": "T03n0190_045:0865a03_0"
    },
    {
        "source_sentence": "汝昔曾見畢鉢羅耶摩那婆不？」",
        "translation": "Have you ever seen Upāli Mānava in the past?",
        "source": "T03n0190_045:0865a04_1"
    },
    {
        "source_sentence": "彼女報言：「善摩那婆！",
        "translation": "The woman replied, Good, Manabha!",
        "source": "T03n0190_045:0865a04_2"
    },
    {
        "source_sentence": "我未曾見。」",
        "translation": "I've never seen it before.",
        "source": "T03n0190_045:0865a05_3"
    },
    {
        "source_sentence": "時，摩那婆復更重語於彼女言：「謂汝善女！",
        "translation": "Mānava then again repeatedly said to the woman, saying, Tell her, good girl!",
        "source": "T03n0190_045:0865a05_4"
    },
    {
        "source_sentence": "即我是彼畢鉢羅耶摩那婆身，我實不用行於五慾，我今內心願行梵行。",
        "translation": "That is, I am that person in the body of Pippalāya Manabha. I really don't need to practice the five kinds of desire; now, with my mind, I wish to practice the religious life.",
        "source": "T03n0190_045:0865a06_5"
    },
    {
        "source_sentence": "此之事情，是我父母眷屬之意，直是父母，故強與我，取汝為妻。」",
        "translation": "These things are the intentions of my parents and their dependents, who are simply my parents; therefore, they forcibly give them to me and take you as their wife.",
        "source": "T03n0190_045:0865a08_6"
    },
    {
        "source_sentence": "爾時，跋陀羅女聞是語已，即便白彼摩那婆言：「善哉仁者大摩那婆！",
        "translation": "After hearing these words, the Bhadra said to Manabha, Good, sir, great Manabha!",
        "source": "T03n0190_045:0865a09_7"
    },
    {
        "source_sentence": "我得是言，甚大歡喜，仁必不用世五慾者，今莫久住，速宜取我，莫令於彼有無梵行世間之人而求索我。」",
        "translation": "I'm overjoyed when I hear these words, and you mustn't use the five desires of the world. Don't stay here for a long time now; quickly take me! Don't let anyone in the world who doesn't practice celiba",
        "source": "T03n0190_045:0865a11_8"
    },
    {
        "source_sentence": "爾時，畢鉢羅耶得是語已，即從彼處迴還向家，至父母邊，到已長跪白父母言：「菴婆多多！",
        "translation": "After he had heard these words, Pippalāya returned home from that place, went to his parents, knelt down long enough to tell them, Upagupta!",
        "source": "T03n0190_045:0865a13_9"
    },
    {
        "source_sentence": "我實不用行世五慾，願修梵行，二尊為我欲娶婦者，但速疾為我迎彼婦來。」",
        "translation": "I really don't need to practice the five desires of the world and wish to cultivate religious practice; the two honored ones want to marry a woman for me, but quickly greet that woman for me.",
        "source": "T03n0190_045:0865a15_10"
    },
    {
        "source_sentence": "爾時，畢鉢羅耶父母，即共迦卑羅迦大婆羅門，立於言契，交關下財，",
        "translation": "At that time, Pippalāya’s parents and the great brāhmaṇa Kapilavastu entered into a verbal agreement to exchange their property.",
        "source": "T03n0190_045:0865a18_0"
    },
    {
        "source_sentence": "隨索多少辦具種種飲食雜味，無價瓔珞，妙寶衣等，選求吉祥善好宿日，",
        "translation": "They were provided with various foods and drinks, priceless necklaces, exquisite jeweled robes, and so on, according to the number of their requests. They chose the auspicious, good, and delightful constellations for the",
        "source": "T03n0190_045:0865a19_1"
    },
    {
        "source_sentence": "多齎財寶，往彼迎取跋陀羅迦卑羅之女，與兒作妻。",
        "translation": "Carrying a large amount of money and treasure, he went there to meet Bhadra Kapilavastu's daughter and gave her to him as his wife.",
        "source": "T03n0190_045:0865a21_2"
    },
    {
        "source_sentence": "迎入家已，於一室內鋪二合[木*翕]。",
        "translation": "After welcoming him into the house, he spreads two pairs of [wooden*woven] mats in one room.",
        "source": "T03n0190_045:0865a22_3"
    },
    {
        "source_sentence": "既安置已，而彼二人在一室內，各各收歛不相染觸。",
        "translation": "After they had placed it there, the two men were in one room, each collected and untouched.",
        "source": "T03n0190_045:0865a23_4"
    },
    {
        "source_sentence": "爾時，畢鉢羅耶父母聞此事已，作如是念：「彼之二人，在一室內不相染觸，",
        "translation": "After hearing this, Pippalāya’s parents had the following thought: The two of them were living together in one room without being touched.",
        "source": "T03n0190_045:0865a25_0"
    },
    {
        "source_sentence": "此事云何？」",
        "translation": "What's the matter?",
        "source": "T03n0190_045:0865a26_1"
    },
    {
        "source_sentence": "即更方便，却一合[木*翕]，止留一[木*翕]，其既同眠，自應相合。",
        "translation": "He then uses another method, removes one [mu*] and stops a [mu*], and since they both sleep together, they should be united by themselves.",
        "source": "T03n0190_045:0865a26_2"
    },
    {
        "source_sentence": "而彼二人，猶不相觸，若畢鉢羅耶著於睡眠，其跋陀羅女即起經行。",
        "translation": "If Pippalāya was addicted to sleep, the Bhadra girl would go up and walk.",
        "source": "T03n0190_045:0865a28_3"
    },
    {
        "source_sentence": "若跋陀羅女，著於睡眠，其畢鉢羅耶即復經行。",
        "translation": "If a Bhadra's daughter is addicted to sleep, that pippalāya will again walk up and down.",
        "source": "T03n0190_045:0865a29_4"
    },
    {
        "source_sentence": "如是更互周歷年載，終不同寢。",
        "translation": "Thus, they traveled around each other for years and years, never sleeping together.",
        "source": "T03n0190_045:0865b01_5"
    },
    {
        "source_sentence": "佛本行集經卷第四十五",
        "translation": "Fobenxing ji jing, vol. 45",
        "source": "T03n0190_045:0865b03_0"
    }
]