[
    {
        "source_sentence": "佛說眾許摩訶帝經卷第九",
        "translation": "Foshuo zhixiu mohaiti jing, vol. 9",
        "source": "T03n0191_009:0957c03_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚少卿",
        "translation": "Xitian zhuan jing sanzang朝散 dafu xi Hongun shouxing",
        "source": "T03n0191_009:0957c05_0"
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao daishi jing faxian Feng imperial edict translation",
        "source": "T03n0191_009:0957c06_0"
    },
    {
        "source_sentence": "爾時世尊度彼六十賢眾已，復思何人先可受化，乃憶西曩野儞聚落之中，",
        "translation": "At that time the World-honored One, having liberated those sixtyfold assembly of bhikṣus, thought to himself, “Who should first undergo this instruction?” Thinking thus, he remembered one day in the wilderness village",
        "source": "T03n0191_009:0957c07_0"
    },
    {
        "source_sentence": "有難那及長女并眷屬等堪先受化。",
        "translation": "There are Nandika, the elder daughters, their retinues, and so forth who are capable of first undergoing transformation.",
        "source": "T03n0191_009:0957c08_1"
    },
    {
        "source_sentence": "憶念：「我昔苦行去時經過彼舍，時難那及長女并眷屬等，共持乳粥及酥蜜等來獻於我。",
        "translation": "I remember, In the past, when I was practicing austerities, I passed by that house and presented milk gruel, butter, honey, and so forth to me at the time of my departure.",
        "source": "T03n0191_009:0957c09_2"
    },
    {
        "source_sentence": "今觀彼等根緣已熟，堪可化度。」",
        "translation": "Now, I'll observe that their faculties and conditions have matured, and they're capable of being liberated.",
        "source": "T03n0191_009:0957c11_3"
    },
    {
        "source_sentence": "作是念已，世尊翌日伺候食時，執持應器入西曩野儞聚落之中，次第乞食至難那舍。",
        "translation": "When he had this thought, the Bhagavān was waiting for a meal the next day, took his almsbowl and entered the village of Nirmāṇarati in the western wilderness to solicit alms and went to Nanda's dwelling",
        "source": "T03n0191_009:0957c12_4"
    },
    {
        "source_sentence": "時彼難那及長女等，見佛至門踊躍歡喜，即謂佛曰：「善來世尊！",
        "translation": "Seeing the Buddha at the door, they jumped and rejoiced, and said to the Buddha, Well-come, Bhagavān!",
        "source": "T03n0191_009:0957c14_5"
    },
    {
        "source_sentence": "聖體安否？",
        "translation": "Is the essence of the sage stable?",
        "source": "T03n0191_009:0957c15_6"
    },
    {
        "source_sentence": "世尊大慈，暫過我舍。」",
        "translation": "Bhagavān, great compassionate, please pass by my house for a moment.",
        "source": "T03n0191_009:0957c15_7"
    },
    {
        "source_sentence": "佛即入門，難那并女為佛敷座。",
        "translation": "The Buddha then entered the door, and Nandana and the woman prepared a seat for him.",
        "source": "T03n0191_009:0957c16_8"
    },
    {
        "source_sentence": "世尊昇座，彼難那及女并諸眷屬，即以頭面禮佛雙足，各各禮已退坐一面。",
        "translation": "When the Bhagavān ascended his seat, that Nandha and the women and their retinues bowed at the Buddha's feet with their heads and feet, each bowed and withdrew to sit at one side.",
        "source": "T03n0191_009:0957c17_9"
    },
    {
        "source_sentence": "爾時世尊即為說法。",
        "translation": "It was then that the Bhagavān explained the teaching for him.",
        "source": "T03n0191_009:0957c19_0"
    },
    {
        "source_sentence": "佛言：「難那！",
        "translation": "The Buddha said, Nana!",
        "source": "T03n0191_009:0957c19_1"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T03n0191_009:0957c19_2"
    },
    {
        "source_sentence": "布施、持戒生天之因，雖感欲樂終當退失，汝等當斷一切煩惱以求出離。」",
        "translation": "Although it's the cause of generosity and observance of precepts that give rise to birth in heaven, you will eventually regress even though you experience desire and pleasure, and you will end all afflictions and seek escape.",
        "source": "T03n0191_009:0957c19_3"
    },
    {
        "source_sentence": "又復廣為分別生滅之法而令了知。",
        "translation": "Furthermore, it's also explained in detail for the sake of discerning the dharmas that arise and cease.",
        "source": "T03n0191_009:0957c21_4"
    },
    {
        "source_sentence": "佛說是時，彼難那等根緣成熟蓋障即除，深心思惟歡喜無量。",
        "translation": "When the Buddha said this, the hindrances of those nanas and other faculties that ripened as a condition for their maturation were removed, and they deeply contemplated with joy and rejoiced without measure.",
        "source": "T03n0191_009:0957c22_5"
    },
    {
        "source_sentence": "佛即又為廣說苦、集、滅、道四聖諦法。",
        "translation": "The Buddha then explained in detail the four noble truths of suffering, arising, cessation, and the path.",
        "source": "T03n0191_009:0957c23_6"
    },
    {
        "source_sentence": "時難那并女及眷屬等，即於座上得法知見，證四諦理斷諸疑惑，貪愛永除一向信佛，",
        "translation": "At that time Nanda, together with the other women and their retinues, immediately attained knowledge and vision of the Dharma from their seats. Realizing the truth of the fourfold doctrine, they cut off doubts and doubts, abandoned craving and",
        "source": "T03n0191_009:0957c24_7"
    },
    {
        "source_sentence": "即從座起合掌頂禮白言：「世尊！",
        "translation": "He rose from his seat, joined his palms and bowed his head in respect, saying, Bhagavān!",
        "source": "T03n0191_009:0957c26_8"
    },
    {
        "source_sentence": "我於世尊所說諸法實得知見，我今歸佛、歸法、歸依僧伽，願為近事永不殺生。」",
        "translation": "I truly know and see the teachings taught by the Bhagavān, and now I take refuge in the Buddha, Dharma, and saṃgha, wishing to never kill people for their sake.",
        "source": "T03n0191_009:0957c27_9"
    },
    {
        "source_sentence": "又白佛言：「食時已至，願佛大慈受我供養。」",
        "translation": "Again, he said to the Buddha, When the time comes for food, may the Buddha have great compassion and accept my offerings.",
        "source": "T03n0191_009:0957c29_10"
    },
    {
        "source_sentence": "佛即默然。",
        "translation": "The Buddha then remained silent.",
        "source": "T03n0191_009:0958a01_0"
    },
    {
        "source_sentence": "時彼難那并眷屬等，見佛默然知已受請，持種種香花飲食手自奉上。",
        "translation": "Seeing the Buddha's silence, they accepted the invitation and offered various kinds of incense, flowers, food, and drink with their hands to him.",
        "source": "T03n0191_009:0958a01_1"
    },
    {
        "source_sentence": "世尊食畢澡漱已竟，難那眷屬復處卑座樂欲聽法，佛即方便種種說法，",
        "translation": "When the World-honored One had finished washing and rinsing, Nanda’s retinue returned to their humble seats with delight in listening to the Dharma. The Buddha then taught them various doctrines through skillful means.",
        "source": "T03n0191_009:0958a02_2"
    },
    {
        "source_sentence": "難那眷屬復得聞法，歡喜踊躍，禮佛而退。",
        "translation": "The Nandika clanspeople, having heard the Dharma again, were delighted and jumped for joy. They bowed to the Buddha and withdrew.",
        "source": "T03n0191_009:0958a04_3"
    },
    {
        "source_sentence": "爾時世尊於西曩野儞聚落化難那等已，即復思念，欲詣摩伽陀國隨緣利樂。",
        "translation": "At the time, the Bhagavān was staying in the village of Nirmāṇarati and so forth in the west, and then he had another thought, wanting to go to the country of Magadha for profit and pleasure according to conditions.",
        "source": "T03n0191_009:0958a06_0"
    },
    {
        "source_sentence": "時摩伽陀國有善相師烏嚕尾螺迦葉，壽年三百歲，自謂已得阿羅漢道，",
        "translation": "At that time in the country of Magadha there was a skillful soothsayer named Uruvilvā-Kāśyapa, whose life span was three hundred years. He claimed to have attained the path of the arhat.",
        "source": "T03n0191_009:0958a07_1"
    },
    {
        "source_sentence": "居尼連河側，弟子眷屬有五百人；",
        "translation": "On the bank of the Nairañjanā River there were five hundred disciples and followers.",
        "source": "T03n0191_009:0958a09_2"
    },
    {
        "source_sentence": "摩伽陀國王及輔相一切民眾，皆尊重供養更無有上。",
        "translation": "The king of Magadha and his assistants and all the people respected and offered offerings to him, unsurpassed anyone.",
        "source": "T03n0191_009:0958a10_3"
    },
    {
        "source_sentence": "「彼摩伽陀國有無量人眾，由如盲冥黑暗障蔽，常依烏嚕尾螺以為引導，",
        "translation": "“In that country of Magadha there were innumerable people who, being blind and blinded by the darkness of ignorance, always relied on Uruvilvā as their guide.",
        "source": "T03n0191_009:0958a11_4"
    },
    {
        "source_sentence": "彼諸人眾雖承化導無由出離。",
        "translation": "Even though they are guided by those people, there's no way to escape them.",
        "source": "T03n0191_009:0958a13_0"
    },
    {
        "source_sentence": "我今化彼烏嚕尾螺迦葉，及彼人眾，使見正道。」",
        "translation": "Now, I'll transform that Uruvilvā-Kāśyapa and those people to see the right path.",
        "source": "T03n0191_009:0958a13_1"
    },
    {
        "source_sentence": "既思惟已，行詣摩伽陀國尼連河側烏嚕尾螺迦葉住處。",
        "translation": "After he had thought about it, he traveled to the country of Magadha and went to the place where Uruvilvā-Kāśyapa lived on the bank of the Nairañjāna River.",
        "source": "T03n0191_009:0958a14_2"
    },
    {
        "source_sentence": "時烏嚕尾螺迦葉忽見世尊來至住處，又見相好具足威德殊異，即前迎接復加恭敬，",
        "translation": "When Uruvilvā-Kāśyapa suddenly saw the Bhagavān coming to his dwelling place, and also saw that he was endowed with such extraordinary features and mighty virtues, he greeted him and venerated him.",
        "source": "T03n0191_009:0958a16_3"
    },
    {
        "source_sentence": "而謂佛言：「善來大沙門！",
        "translation": "He said to the Buddha, Well come, great ascetic!",
        "source": "T03n0191_009:0958a18_0"
    },
    {
        "source_sentence": "先住何處？",
        "translation": "Where did you live before?",
        "source": "T03n0191_009:0958a18_1"
    },
    {
        "source_sentence": "今忽至此。」",
        "translation": "Now, they've suddenly arrived here.",
        "source": "T03n0191_009:0958a18_2"
    },
    {
        "source_sentence": "即為世尊敷座請坐。",
        "translation": "He then spread out his seat for the Bhagavān and invited him to sit.",
        "source": "T03n0191_009:0958a19_0"
    },
    {
        "source_sentence": "世尊就坐，彼烏嚕尾螺迦葉亦自就坐，即以種種言辭慰問世尊，世尊亦以種種方便開導教化。",
        "translation": "When the Bhagavān took his seat, that Uruvilvā Kāśyapa also took his seat, comforted the Bhagavān with various words and greetings, and the Bhagavān also guided and taught him with various methods.",
        "source": "T03n0191_009:0958a19_1"
    },
    {
        "source_sentence": "談論未竟，日已西暮，佛即告言：「今已日暮，我於汝舍有寂靜處欲寄一宿。」",
        "translation": "When the discussion hadn't ended, it was past sunset, and the Buddha said, Now that it's sunset, I have a quiet place in your house where I want to stay for one night.",
        "source": "T03n0191_009:0958a21_2"
    },
    {
        "source_sentence": "烏嚕尾螺迦葉白言：「大沙門！",
        "translation": "Uruvilvā-kāśyapa said, Great ascetic!",
        "source": "T03n0191_009:0958a23_3"
    },
    {
        "source_sentence": "我諸房舍眷屬在中，唯一靜處堪沙門宿；",
        "translation": "Among them, the members of my household are staying there. There is only one quiet place where I am allowed to spend the night as a śramaṇa.",
        "source": "T03n0191_009:0958a23_4"
    },
    {
        "source_sentence": "然此靜處毒龍在中，雖不悋惜恐有所損。",
        "translation": "Still, this quiet place is where poisonous dragons live, and even though they don't cherish it, they're afraid to harm it.",
        "source": "T03n0191_009:0958a24_5"
    },
    {
        "source_sentence": "請自思之。」",
        "translation": "Please think about it for yourself.",
        "source": "T03n0191_009:0958a25_6"
    },
    {
        "source_sentence": "佛告烏嚕尾螺迦葉言：「但願見借，必無傷害。」",
        "translation": "The Buddha told Uruvilvā-Kāśyapa, Please let me borrow it, and I won't harm you.",
        "source": "T03n0191_009:0958a26_7"
    },
    {
        "source_sentence": "烏嚕尾螺迦葉告言：「若能爾者當自隨意。」",
        "translation": "Uruvilvā-Kāśyapa told him, If you can do so, you'll follow it yourself.",
        "source": "T03n0191_009:0958a27_8"
    },
    {
        "source_sentence": "於是世尊即詣龍舍。",
        "translation": "The Bhagavān then went to the dragon's dwelling.",
        "source": "T03n0191_009:0958a28_0"
    },
    {
        "source_sentence": "佛於舍外洗足已便入龍舍，自布淨草跏趺而坐，佛即便入三摩地。",
        "translation": "After washing his feet outside the dwelling, the Buddha entered the dragon's dwelling and sat cross-legged on a covered mat of pure grass.",
        "source": "T03n0191_009:0958a28_1"
    },
    {
        "source_sentence": "時彼毒龍忽見世尊在舍中坐，即發瞋怒，乃作煙霧遍舍內外，於是世尊以神通力亦化煙霧；",
        "translation": "Suddenly the poisonous dragon saw the World-honored One seated inside the monastery. Immediately angry and furious, it created a cloud of smoke that covered both inside and outside the monastery. Then the World-honored",
        "source": "T03n0191_009:0958b01_0"
    },
    {
        "source_sentence": "毒龍轉怒舍內火著，佛以神力亦化其火，佛與毒龍二火俱熾，時彼龍舍周遍內外成大火聚，",
        "translation": "When the poisonous dragon became angry, the fire burned inside the cave. The Buddha also extinguished the fire by means of his supernatural powers. Then the Buddha and the poisonous dragon were all ablaze with two kinds of fire",
        "source": "T03n0191_009:0958b03_1"
    },
    {
        "source_sentence": "火焰上騰明照遠近。",
        "translation": "The flame rises upward to illuminate the distant and the near.",
        "source": "T03n0191_009:0958b05_2"
    },
    {
        "source_sentence": "時彼迦葉常於夜分出觀星像，乃復觀見龍舍成大火聚，即便傷嘆：「苦哉！",
        "translation": "That Kāśyapa always came out at night to observe the stars and images, and then he also observed that the dragon's dwelling became a great mass of fire, and he even lamented, How painful!",
        "source": "T03n0191_009:0958b05_3"
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T03n0191_009:0958b07_4"
    },
    {
        "source_sentence": "彼端正沙門不聽我語，龍火熾盛百倍於常，可惜沙門必被傷害。」",
        "translation": "That handsome ascetic won't listen to my words, and the dragon-fire blazes a hundred times more intense than usual; it's a pity that the ascetic will surely be harmed.",
        "source": "T03n0191_009:0958b07_5"
    },
    {
        "source_sentence": "時烏嚕尾螺迦葉及與眷屬，皆見大火熾盛之相。",
        "translation": "Uruvilvā-Kāśyapa and his retinue then all saw the characteristic of a great fire blazing brightly.",
        "source": "T03n0191_009:0958b08_6"
    },
    {
        "source_sentence": "時彼毒龍知於世尊不能損害，又以自身亦大疲乏，乃息惡毒火便消滅；",
        "translation": "Knowing that the World-honored One would not be able to harm them, the poisonous dragon became very exhausted. Then he extinguished the blazing fire and disappeared.",
        "source": "T03n0191_009:0958b10_7"
    },
    {
        "source_sentence": "世尊是時亦攝神力，毒龍降伏收於鉢內。",
        "translation": "The Bhagavān then also gathered his supernormal powers, subdued the poisonous dragon, and put it in his bowl.",
        "source": "T03n0191_009:0958b11_8"
    },
    {
        "source_sentence": "天曉之後，烏嚕尾螺迦葉與眷屬等，行詣龍舍觀於沙門。",
        "translation": "After dawn, Uruvilvā-Kāśyapa and his retinue went to the dragon's dwelling to observe the ascetic.",
        "source": "T03n0191_009:0958b12_9"
    },
    {
        "source_sentence": "既到龍舍，見佛端然而白佛言：「汝大沙門！",
        "translation": "When he arrived at the dragon's dwelling, he saw the Buddha standing upright and said to him, You great ascetic!",
        "source": "T03n0191_009:0958b13_10"
    },
    {
        "source_sentence": "宿夜安否？」",
        "translation": "Are the constellations and nights peaceful?",
        "source": "T03n0191_009:0958b14_11"
    },
    {
        "source_sentence": "佛言：「我安。」",
        "translation": "The Buddha said, I'll be at peace.",
        "source": "T03n0191_009:0958b15_12"
    },
    {
        "source_sentence": "「汝大沙門，鉢中何物？」",
        "translation": "What's in your bowl, great ascetic?",
        "source": "T03n0191_009:0958b15_13"
    },
    {
        "source_sentence": "佛言：「此舍之龍。」",
        "translation": "The Buddha said, This is the dragon of the house.",
        "source": "T03n0191_009:0958b15_14"
    },
    {
        "source_sentence": "佛又告言：「汝言此舍有是毒龍，人不敢止；",
        "translation": "Again, the Buddha said: You say that there is a poisonous dragon in this house. People will not dare to stay here.",
        "source": "T03n0191_009:0958b16_15"
    },
    {
        "source_sentence": "我今降伏收於鉢中，汝可審觀了知其實。」",
        "translation": "Now, I'll subdue them and put them in my bowl, so you can examine and know the truth.",
        "source": "T03n0191_009:0958b17_16"
    },
    {
        "source_sentence": "烏嚕尾螺迦葉自以耆年德重行苦學優，凡所見知無有過者，及見世尊龍火不傷又能降置鉢內，",
        "translation": "Uruvilvā-Kāśyapa himself practiced austerities and studied well because of his senior virtue. All those who saw him knew that there was nothing wrong with him, as well as those who saw the World-honored One’s holy",
        "source": "T03n0191_009:0958b18_17"
    },
    {
        "source_sentence": "乃讚歎曰：「奇哉！",
        "translation": "He praised them, saying, Marvelous!",
        "source": "T03n0191_009:0958b20_18"
    },
    {
        "source_sentence": "沙門！",
        "translation": "Sramanaries!",
        "source": "T03n0191_009:0958b20_19"
    },
    {
        "source_sentence": "有大威力，我所見聞希有此事，是大沙門是大丈夫，亦是阿羅漢。」",
        "translation": "He has great authority, and what I've seen and heard is rare; he's a great ascetic, a great man, or an arhat.",
        "source": "T03n0191_009:0958b20_20"
    },
    {
        "source_sentence": "爾時世尊降毒龍已，至第二日即於烏嚕尾螺迦葉住處不遠，就一樹下經行宴坐，",
        "translation": "On the second day after having subdued the poisonous dragon, the World-honored One took his seat in a tree not far from where he was staying at Uruvilvā-Kāśyapa.",
        "source": "T03n0191_009:0958b23_0"
    },
    {
        "source_sentence": "即於是夜有四大天王下來聽法。",
        "translation": "That night, there were four great heavenly kings who came down to listen to the teaching.",
        "source": "T03n0191_009:0958b24_1"
    },
    {
        "source_sentence": "時迦葉夜出觀於星像，乃見佛前有四大火聚。",
        "translation": "Kāśyapa then went out at night to observe the star image and saw that there were four large clusters of fire in front of the Buddha.",
        "source": "T03n0191_009:0958b25_2"
    },
    {
        "source_sentence": "迦葉即謂諸弟子曰：「彼大沙門亦事於火。」",
        "translation": "Kāśyapa then said to his disciples, That great ascetic also serves the fire.",
        "source": "T03n0191_009:0958b26_3"
    },
    {
        "source_sentence": "諸弟子曰：「師何由知？」",
        "translation": "The disciples said, How did the teacher know?",
        "source": "T03n0191_009:0958b27_4"
    },
    {
        "source_sentence": "迦葉告言：「我夜觀星像，乃見大沙門前有四大火聚，我知沙門事火無疑。」",
        "translation": "Kāśyapa told him, Tonight, while observing the star image, I saw four large masses of fire in front of the great ascetic, and I knew that the ascetic was serving the fire without doubt.",
        "source": "T03n0191_009:0958b28_5"
    },
    {
        "source_sentence": "時烏嚕尾螺迦葉纔至天曉，速詣佛所而白佛言：「汝大沙門！",
        "translation": "Uruvilvā-Kāśyapa then, just before dawn, quickly went to the Buddha and said to him, You great ascetic!",
        "source": "T03n0191_009:0958b29_6"
    },
    {
        "source_sentence": "亦事火耶？」",
        "translation": "Does it also serve the fire?",
        "source": "T03n0191_009:0958c02_7"
    },
    {
        "source_sentence": "佛即報言：「我不事火。」",
        "translation": "The Buddha then replied, I don't serve the fire.",
        "source": "T03n0191_009:0958c02_8"
    },
    {
        "source_sentence": "迦葉又言：「我夜中觀星，見沙門前有四火聚；",
        "translation": "Kāśyapa again said: In the middle of the night I observed the stars and saw that in front of the śramaṇa there was a cluster of four kinds of fire.",
        "source": "T03n0191_009:0958c02_9"
    },
    {
        "source_sentence": "若不事火，此乃何用？」",
        "translation": "If you don't serve the fire, what use is there for this?",
        "source": "T03n0191_009:0958c03_10"
    },
    {
        "source_sentence": "佛即報言：「此非是火，是四大天王下來聽法，是彼四天身光之耳！」",
        "translation": "The Buddha then replied, This isn't fire; these are the four great celestial kings who came down to hear the Dharma, and these are the four heavenly bodies of those gods shining brightly!",
        "source": "T03n0191_009:0958c04_11"
    },
    {
        "source_sentence": "迦葉驚曰：「奇哉！",
        "translation": "Kāśyapa was startled and said, Marvelous!",
        "source": "T03n0191_009:0958c05_12"
    },
    {
        "source_sentence": "沙門！",
        "translation": "Sramanaries!",
        "source": "T03n0191_009:0958c06_13"
    },
    {
        "source_sentence": "有是事也。",
        "translation": "There's this thing.",
        "source": "T03n0191_009:0958c06_14"
    },
    {
        "source_sentence": "此大沙門有斯威德，感得天王俱來聽法，此亦是阿羅漢耶？」",
        "translation": "Is this great ascetic with such authoritative virtue that he's been able to cause both heavenly kings to come and listen to the teaching, is this also an arhat?",
        "source": "T03n0191_009:0958c06_15"
    },
    {
        "source_sentence": "至第三日，帝釋天主乃於夜分來至佛所，頭面禮足退坐一面，佛為帝釋如應說法。",
        "translation": "On the third day, the lord of Indra came to the Buddha at night and bowed his head and feet, withdrew, and sat to one side. The Buddha taught the Dharma to Indra as it should be taught.",
        "source": "T03n0191_009:0958c07_16"
    },
    {
        "source_sentence": "帝釋天主得聞法已，歡喜踊躍還歸天宮。",
        "translation": "Indra, the lord of the gods, having heard the Dharma, rejoiced and jumped with joy and returned to the heavenly palace.",
        "source": "T03n0191_009:0958c09_17"
    },
    {
        "source_sentence": "時烏嚕尾螺迦葉夜觀星像，又見樹下世尊前面有一火聚，極大熾盛光明照耀，",
        "translation": "When Uruvilvā-kāśyapa was observing the star images at night, he saw another cluster of fire under a tree in front of the Bhagavān, extremely large and blazingly bright.",
        "source": "T03n0191_009:0958c10_18"
    },
    {
        "source_sentence": "如日初出。",
        "translation": "It's like when the sun first rises.",
        "source": "T03n0191_009:0958c12_19"
    },
    {
        "source_sentence": "而彼迦葉謂弟子曰：「而此沙門定事於火。」",
        "translation": "That Kāśyapa then said to the disciple, Yet this ascetic is concentrating on fire.",
        "source": "T03n0191_009:0958c12_20"
    },
    {
        "source_sentence": "至天曉已，與諸弟子速詣佛所，而白佛言：「汝大沙門！",
        "translation": "When dawn came, he quickly went to the Buddha with his disciples and said to him, You great ascetic!",
        "source": "T03n0191_009:0958c13_21"
    },
    {
        "source_sentence": "我昨夜出觀於星像，又見火聚熾於座前，火光上騰如日初出，我今定知沙門事火。」",
        "translation": "Yesterday night, I went out to observe the star images and saw a cluster of fire blazing in front of my seat, rising above it like the first appearance of the sun, and now I'm sure I know that the ascetic is engaged in",
        "source": "T03n0191_009:0958c14_22"
    },
    {
        "source_sentence": "佛即報言：「我非事火；",
        "translation": "The Buddha replied, “I do not serve the fire.",
        "source": "T03n0191_009:0958c16_23"
    },
    {
        "source_sentence": "昨夜帝釋下來聽法，是彼身光之所照耀。」",
        "translation": "Yesterday night, the emperor Śākyamuni came down to listen to the teaching, and this was the light shining from his body.",
        "source": "T03n0191_009:0958c17_24"
    },
    {
        "source_sentence": "迦葉歎曰：「奇哉！",
        "translation": "Kāśyapa praised him, saying, Marvelous!",
        "source": "T03n0191_009:0958c18_25"
    },
    {
        "source_sentence": "沙門！",
        "translation": "Sramanaries!",
        "source": "T03n0191_009:0958c18_26"
    },
    {
        "source_sentence": "有大威德，此實希有；",
        "translation": "He possessed great prestige and virtue, which was really rare.",
        "source": "T03n0191_009:0958c18_27"
    },
    {
        "source_sentence": "我今定知亦得阿羅漢果。」",
        "translation": "Now, I'll surely know that I'll also attain the fruit of arhatship.",
        "source": "T03n0191_009:0958c19_28"
    },
    {
        "source_sentence": "至第四日，烏嚕尾螺迦葉出門觀星，又復觀見沙門座前有大火聚，光明照耀如日正中。",
        "translation": "On the fourth day, Uruvilvā-Kāśyapa went out to observe the stars and again observed that there was a large cluster of fire in front of the monk's seat, shining brightly like the middle of the sun.",
        "source": "T03n0191_009:0958c19_29"
    },
    {
        "source_sentence": "是時迦葉還告弟子：「我於今夜又觀星像，復見沙門座前有火，光明照耀轉倍於前，",
        "translation": "Kāśyapa then again said to his disciples: Tonight, while I was staring at the celestial moon Vaiśravaṇa, I saw that there was a fire in front of the śramaṇa’s seat.",
        "source": "T03n0191_009:0958c21_30"
    },
    {
        "source_sentence": "如日正中等無有異，審察是相定事火也。」",
        "translation": "It's like when the sun is right in the middle and so forth without any difference, examining it to determine whether it's a mark or a matter of fire.",
        "source": "T03n0191_009:0958c23_31"
    },
    {
        "source_sentence": "至天曉已行詣佛所，而白佛言：「我夜觀星，亦見沙門座前有火，我知沙門定事火也。」",
        "translation": "At dawn, he went to the Buddha and said to him, Tonight, I've observed the stars, and I've also seen a fire in front of the ascetic's seat; I know that the ascetic is engaged in",
        "source": "T03n0191_009:0958c24_32"
    },
    {
        "source_sentence": "佛言：「迦葉！",
        "translation": "The Buddha said, Kāśyapa!",
        "source": "T03n0191_009:0958c26_33"
    },
    {
        "source_sentence": "我無所求，何用於火？",
        "translation": "I have nothing to ask for, so why should I use fire?",
        "source": "T03n0191_009:0958c26_34"
    },
    {
        "source_sentence": "昨夜之中，彼娑婆世界主大梵天王下來聽法在我前坐，汝所見者是彼身光。」",
        "translation": "In the middle of the night, that lord of the sahā world, the great Brahma king, came down and listened to the teaching while sitting in front of me, and what you saw was the light of his body.",
        "source": "T03n0191_009:0958c27_35"
    },
    {
        "source_sentence": "時彼迦葉還復歎曰：「此大沙門乃有如是大威德力，能感梵王下來聽法，",
        "translation": "Then Kāśyapa again spoke in praise, saying: This great renunciant possesses such great and mighty power that he can summon Brahmā to come down to hear the Dharma.",
        "source": "T03n0191_009:0958c28_36"
    },
    {
        "source_sentence": "實為希有；",
        "translation": "It is really rare.",
        "source": "T03n0191_009:0959a01_37"
    },
    {
        "source_sentence": "我定得知亦證阿羅漢果。」",
        "translation": "I'll surely know that I'll also realize the fruit of arhatship.",
        "source": "T03n0191_009:0959a01_38"
    },
    {
        "source_sentence": "至第五日，時烏嚕尾螺迦葉弟子摩拏嚩迦等，五百人眾，俱事三火，各有三鑪，",
        "translation": "On the fifth day, there were five hundred people, including Uruvilvā Kāśyapa’s disciples Māra and others, who all served three kinds of fire.",
        "source": "T03n0191_009:0959a02_39"
    },
    {
        "source_sentence": "其鑪共有一千五百。",
        "translation": "There were 1,500 of them in all.",
        "source": "T03n0191_009:0959a03_40"
    },
    {
        "source_sentence": "是時世尊在彼樹下，又值彼眾用火祭天。",
        "translation": "At the time, the Bhagavān was under that tree, and he met another multitude of people there who offered a fire sacrifice to the gods.",
        "source": "T03n0191_009:0959a04_41"
    },
    {
        "source_sentence": "彼五百人常式發火火不能然，彼弟子眾即速告師，至烏嚕尾螺所而白言曰：「師可知否？",
        "translation": "The five hundred men always set fire to the conflagration, but they were unable to do so. The disciples quickly reported to their teacher and went to Uruvilvā and said:",
        "source": "T03n0191_009:0959a05_42"
    },
    {
        "source_sentence": "我等然火，火終不然。",
        "translation": "We are still on fire, but the fire isn't like that.",
        "source": "T03n0191_009:0959a07_43"
    },
    {
        "source_sentence": "不知今日何因若此？」",
        "translation": "Don't you know why it's like this today?",
        "source": "T03n0191_009:0959a07_44"
    },
    {
        "source_sentence": "烏嚕尾螺迦葉思惟是事：「而彼沙門在此近住，恐彼威力而有所制。」",
        "translation": "Uruvilvā-Kāśyapa thought about this, That ascetic lives here nearby because he's afraid of his authority and has some restraints.",
        "source": "T03n0191_009:0959a08_45"
    },
    {
        "source_sentence": "即與弟子同詣佛所而白佛言：「汝大沙門！",
        "translation": "He went with his disciples to the Buddha and said to him, You great ascetics!",
        "source": "T03n0191_009:0959a09_46"
    },
    {
        "source_sentence": "我之弟子摩拏嚩迦五百人眾，常式用火而為火祀，今旦然火終不能著。",
        "translation": "My disciples, the five hundred Mahākauṣṭhilas, always used fire as their ritual for a fire sacrifice, but now at dawn they can't touch it.",
        "source": "T03n0191_009:0959a10_47"
    },
    {
        "source_sentence": "我疑此事，定是沙門威力所制。」",
        "translation": "I doubt this matter, for sure it's the authority of the ascetic.",
        "source": "T03n0191_009:0959a12_48"
    },
    {
        "source_sentence": "佛即答言：「汝欲火然？」",
        "translation": "The Buddha then answered, Do you want the fire to burn?",
        "source": "T03n0191_009:0959a13_49"
    },
    {
        "source_sentence": "迦葉答言：「欲然。」",
        "translation": "Kāśyapa replied, Yes, I want to.",
        "source": "T03n0191_009:0959a13_50"
    },
    {
        "source_sentence": "佛言：「汝去，火當自然。」",
        "translation": "The Buddha said, Go away; the fire will come naturally.",
        "source": "T03n0191_009:0959a14_0"
    },
    {
        "source_sentence": "迦葉還家，火已然矣。",
        "translation": "Kāśyapa returned home but the fire had already gone out.",
        "source": "T03n0191_009:0959a14_1"
    },
    {
        "source_sentence": "時彼迦葉及與弟子皆稱讚曰：「此大沙門有力如是，必應亦得阿羅漢果。」",
        "translation": "That Kāśyapa and his disciples then praised him, saying, This great ascetic is so powerful that he'll surely attain the fruit of arhatship.",
        "source": "T03n0191_009:0959a14_2"
    },
    {
        "source_sentence": "用火祭訖，欲滅其火，火不能滅，盡其彼力終不能滅。",
        "translation": "When he finishes the offering with fire, he wants to extinguish the fire, but the fire won't extinguish it, and when he uses his power, it won't extinguish it.",
        "source": "T03n0191_009:0959a16_3"
    },
    {
        "source_sentence": "摩拏嚩迦諸弟子等，疾詣烏嚕尾螺迦葉之所白言：「我師知否？",
        "translation": "The disciples of Mātṛkā quickly went to Uruvilvā-Kāśyapa and said, Does my teacher know?",
        "source": "T03n0191_009:0959a17_4"
    },
    {
        "source_sentence": "火雖得然，今不能滅。」",
        "translation": "Although the fire was able to do so, it can't be extinguished now.",
        "source": "T03n0191_009:0959a19_5"
    },
    {
        "source_sentence": "迦葉報言：「此必還是沙門所為。」",
        "translation": "Kāśyapa replied, This must be what the ascetic does.",
        "source": "T03n0191_009:0959a19_6"
    },
    {
        "source_sentence": "迦葉復來至世尊所白言：「沙門！",
        "translation": "Kāśyapa again came to the Bhagavān and said, As a monk!",
        "source": "T03n0191_009:0959a20_7"
    },
    {
        "source_sentence": "火雖得然，今不能滅。",
        "translation": "Even though the fire was able to do so, it couldn't be extinguished now.",
        "source": "T03n0191_009:0959a21_8"
    },
    {
        "source_sentence": "莫是沙門而復制也？」",
        "translation": "Don't be an ascetic and then restrain it again?",
        "source": "T03n0191_009:0959a21_9"
    },
    {
        "source_sentence": "佛即報言：「汝欲滅耶？」",
        "translation": "The Buddha then replied, Do you want to cease?",
        "source": "T03n0191_009:0959a22_0"
    },
    {
        "source_sentence": "迦葉告言：「欲令火滅。」",
        "translation": "Kāśyapa told him, I want to make the fire go out.",
        "source": "T03n0191_009:0959a22_1"
    },
    {
        "source_sentence": "佛言：「汝但還去，必自滅。」",
        "translation": "The Buddha said, Just go back and you'll surely cease on your own.",
        "source": "T03n0191_009:0959a22_2"
    },
    {
        "source_sentence": "迦葉迴還，火已滅矣。",
        "translation": "Kāśyapa returned and the fire had already gone out.",
        "source": "T03n0191_009:0959a23_3"
    },
    {
        "source_sentence": "又復歎曰：「此大沙門有是神力，亦阿羅漢也。」",
        "translation": "Again, he praised him, saying, This great ascetic has such supernormal powers, and he's also an arhat.",
        "source": "T03n0191_009:0959a24_0"
    },
    {
        "source_sentence": "至第六日，烏嚕尾螺迦葉自欲用火祭其火天，火又不然，即自入定欲令火然，",
        "translation": "On the sixth day, Uruvilvā-Kāśyapa wished to sacrifice himself to the fire deity with fire. But the fire was not like that. He entered concentration on his own in order to make the fire glow.",
        "source": "T03n0191_009:0959a25_0"
    },
    {
        "source_sentence": "火亦不然。",
        "translation": "So it is with fire.",
        "source": "T03n0191_009:0959a26_1"
    },
    {
        "source_sentence": "來至佛所而白佛言：「我自用火，常式得然；",
        "translation": "They came to the place where the Buddha was staying and said to him: I myself have always been able to do so by using fire.",
        "source": "T03n0191_009:0959a27_0"
    },
    {
        "source_sentence": "今不能然，莫是沙門力所制也？」",
        "translation": "Now, you can't do so; isn't it the result of the ascetic's power?",
        "source": "T03n0191_009:0959a27_1"
    },
    {
        "source_sentence": "佛言：「迦葉！",
        "translation": "The Buddha said, Kāśyapa!",
        "source": "T03n0191_009:0959a28_2"
    },
    {
        "source_sentence": "汝欲火然？」",
        "translation": "Do you want the fire to blaze?",
        "source": "T03n0191_009:0959a28_3"
    },
    {
        "source_sentence": "答言：「欲然。」",
        "translation": "He replied, Yes, I want to do so.",
        "source": "T03n0191_009:0959a29_4"
    },
    {
        "source_sentence": "佛言：「但去，火必自然。」",
        "translation": "The Buddha said, Just go away, and the fire will surely come naturally.",
        "source": "T03n0191_009:0959a29_5"
    },
    {
        "source_sentence": "迦葉迴還，火已然矣。",
        "translation": "Kāśyapa returned, and the fire was already gone.",
        "source": "T03n0191_009:0959a29_6"
    },
    {
        "source_sentence": "用火事訖欲滅其火，火又不滅，又復入定欲令火滅，火終不滅。",
        "translation": "When he finishes using the fire, he wants to extinguish the fire, but the fire doesn't go out, and when he enters again into meditation with the intention to make it go out, the fire doesn't go out.",
        "source": "T03n0191_009:0959b01_7"
    },
    {
        "source_sentence": "事不獲免，來白佛言：「火雖得然，今又不滅。",
        "translation": "They came to the Buddha and said, “Even if the fire is still burning, it won’t go out.",
        "source": "T03n0191_009:0959b02_8"
    },
    {
        "source_sentence": "必是沙門力所制也。」",
        "translation": "It must be restrained by the ascetic's power.",
        "source": "T03n0191_009:0959b03_9"
    },
    {
        "source_sentence": "佛言：「汝欲滅耶？」",
        "translation": "The Buddha said, Do you want to cease?",
        "source": "T03n0191_009:0959b04_10"
    },
    {
        "source_sentence": "迦葉告言：「欲令火滅。」",
        "translation": "Kāśyapa told him, I want to make the fire go out.",
        "source": "T03n0191_009:0959b04_11"
    },
    {
        "source_sentence": "佛言：「但去，火必自滅。」",
        "translation": "The Buddha said, Go away, and the fire will surely go out on its own.",
        "source": "T03n0191_009:0959b05_0"
    },
    {
        "source_sentence": "及至還家，火已滅矣。",
        "translation": "When he returned home, the fire had gone out.",
        "source": "T03n0191_009:0959b05_1"
    },
    {
        "source_sentence": "火滅已後，以彼餘炭積於一處。",
        "translation": "After the fire goes out, he puts the remaining charcoal into one place.",
        "source": "T03n0191_009:0959b05_2"
    },
    {
        "source_sentence": "移時之後其炭自然，與諸弟子同滅其火，盡其力分終不能滅。",
        "translation": "When the charcoal was moved, it naturally went out with the disciples to extinguish the fire, but they were unable to extinguish it until all their efforts had been exhausted.",
        "source": "T03n0191_009:0959b06_3"
    },
    {
        "source_sentence": "又來白佛：「汝大沙門！",
        "translation": "Again, he came to the Buddha and said, You great ascetic!",
        "source": "T03n0191_009:0959b08_4"
    },
    {
        "source_sentence": "火適得滅，今還自然熾盛倍常，我不能滅。",
        "translation": "When the fire was about to be extinguished, it naturally became more intense and doubled in intensity; but I could not extinguish it.",
        "source": "T03n0191_009:0959b08_5"
    },
    {
        "source_sentence": "此必沙門力所制也。」",
        "translation": "This must be the result of the ascetic's power.",
        "source": "T03n0191_009:0959b09_6"
    },
    {
        "source_sentence": "佛言：「火又然耶？」",
        "translation": "The Buddha said, Is that true of the fire?",
        "source": "T03n0191_009:0959b09_7"
    },
    {
        "source_sentence": "答言：「火然。」",
        "translation": "He replied, Yes, it's fire.",
        "source": "T03n0191_009:0959b10_8"
    },
    {
        "source_sentence": "「汝不能滅耶？」",
        "translation": "Can you not extinguish it?",
        "source": "T03n0191_009:0959b10_9"
    },
    {
        "source_sentence": "答言：「我不能滅。」",
        "translation": "He replied, I can't cease it.",
        "source": "T03n0191_009:0959b10_10"
    },
    {
        "source_sentence": "佛即報言：「汝但迴去，火自息滅。」",
        "translation": "The Buddha then replied, Go away, and the fire will cease on its own.",
        "source": "T03n0191_009:0959b11_11"
    },
    {
        "source_sentence": "迦葉即迴，火已自滅。",
        "translation": "Kāśyapa then turned around, and the fire went out on its own.",
        "source": "T03n0191_009:0959b11_12"
    },
    {
        "source_sentence": "迦葉歎曰：「奇哉！",
        "translation": "Kāśyapa praised him, saying, Marvelous!",
        "source": "T03n0191_009:0959b12_13"
    },
    {
        "source_sentence": "沙門！",
        "translation": "Sramanaries!",
        "source": "T03n0191_009:0959b12_14"
    },
    {
        "source_sentence": "有斯力也。",
        "translation": "It's because of this power.",
        "source": "T03n0191_009:0959b12_15"
    },
    {
        "source_sentence": "我欲然火，火不能然，告以得然；",
        "translation": "I want to make a fire, but the fire won’t make it.",
        "source": "T03n0191_009:0959b13_16"
    },
    {
        "source_sentence": "我欲滅火，火不能滅，告以得滅。",
        "translation": "I want to extinguish the fire, but the fire won't go out; tell me so that it can be extinguished.",
        "source": "T03n0191_009:0959b13_17"
    },
    {
        "source_sentence": "今火再著，不能再滅；",
        "translation": "Now the fire is so strong that it cannot be extinguished.",
        "source": "T03n0191_009:0959b14_18"
    },
    {
        "source_sentence": "今火得滅，亦由彼力。",
        "translation": "Now the fire has been extinguished through the power of that god.",
        "source": "T03n0191_009:0959b15_19"
    },
    {
        "source_sentence": "是大沙門有大威德，此實希有，必應亦是阿羅漢也。」",
        "translation": "This great ascetic has great authority and virtue, which is really rare; he must also be an arhat.",
        "source": "T03n0191_009:0959b15_20"
    },
    {
        "source_sentence": "過是日已，烏嚕尾螺迦葉作外道法設七日會，彼摩伽陀國王士庶皆悉聞知。",
        "translation": "After seven days had passed, Uruvilvā-Kāśyapa set up a seven-day assembly for the non-Buddhist teachings, and all the kings and common people of Magadha heard it.",
        "source": "T03n0191_009:0959b16_21"
    },
    {
        "source_sentence": "迦葉思惟：「今大沙門在此近住，前所火祀皆能力制，今所作法莫復制耶？",
        "translation": "Kāśyapa thought, Now that the great ascetic is living here nearby, will he be able to restrain the fire rituals that were previously performed?",
        "source": "T03n0191_009:0959b18_22"
    },
    {
        "source_sentence": "若彼沙門七日不來，我法必成；",
        "translation": "If that renunciant doesn’t come back for seven days, my teaching will surely be accomplished.",
        "source": "T03n0191_009:0959b20_23"
    },
    {
        "source_sentence": "若復來者，或恐被制。」",
        "translation": "If someone comes back, they might be afraid to be disciplined.",
        "source": "T03n0191_009:0959b20_24"
    },
    {
        "source_sentence": "又作是念：「彼大沙門相好端嚴，威德殊勝，國中士庶若見殊勝，或恐捨我而事於彼。」",
        "translation": "Again, he thought, That great ascetic has good features and looks that are dignified and imposing, and if the citizens of the country see them as superior, they might be afraid to abandon me and serve them.",
        "source": "T03n0191_009:0959b21_25"
    },
    {
        "source_sentence": "以斯事故思念再三。",
        "translation": "Because of these things, he thought three times and three times.",
        "source": "T03n0191_009:0959b23_26"
    },
    {
        "source_sentence": "佛即尋知，佛於七日他處遊化，雖在近住，迦葉及眾於七日中不見世尊。",
        "translation": "The Buddha then found out, and for seven days the Buddha traveled to another place to teach. Although he was staying nearby, Kāśyapa and the other monks did not see the World-honored One during those seven days.",
        "source": "T03n0191_009:0959b23_27"
    },
    {
        "source_sentence": "時彼迦葉作七日法，國中士庶悉持香花及與財寶，廣作供養。",
        "translation": "That Kāśyapa then made a seven-day ritual, in which the citizens of the country all brought incense, flowers, and possessions to make extensive offerings.",
        "source": "T03n0191_009:0959b25_28"
    },
    {
        "source_sentence": "作法既畢設會亦終，却復思念：「彼大沙門七日不見，我今設會多有餘長，",
        "translation": "After he had completed his duty, the assembly was also over. Then he thought: That great renunciant has not seen me for seven days. Now that I have set up this assembly, there is much more to be done.",
        "source": "T03n0191_009:0959b26_29"
    },
    {
        "source_sentence": "沙門若來甚有供養。」",
        "translation": "If an ascetic comes, he'll have a lot to offer.",
        "source": "T03n0191_009:0959b28_30"
    },
    {
        "source_sentence": "作是念已，佛知其意，即便行詣迦葉住處。",
        "translation": "Knowing what he thought, the Buddha knew his intention and went to Kāśyapa's dwelling place.",
        "source": "T03n0191_009:0959b28_31"
    },
    {
        "source_sentence": "迦葉纔見心即歡喜：「此大沙門我思便至。」",
        "translation": "When Kāśyapa saw this, he rejoiced and said, This great ascetic will come with my thoughts.",
        "source": "T03n0191_009:0959b29_32"
    },
    {
        "source_sentence": "乃白佛言：「沙門來耶！」",
        "translation": "He then said to the Buddha, Come, as a monk!",
        "source": "T03n0191_009:0959c01_33"
    },
    {
        "source_sentence": "佛言：「我來！」",
        "translation": "The Buddha said, I'll come!",
        "source": "T03n0191_009:0959c02_34"
    },
    {
        "source_sentence": "又曰：「七日之中何以不來？」",
        "translation": "Again, he said, Why won't you come back in seven days?",
        "source": "T03n0191_009:0959c02_35"
    },
    {
        "source_sentence": "佛言：「汝作是念：『我設七日法會，若彼沙門來者恐法不成。』",
        "translation": "The Buddha said, You think, 'I'll set up a seven-day dharma assembly, and if that ascetic comes, I'm afraid the Dharma won't be accomplished.'",
        "source": "T03n0191_009:0959c03_36"
    },
    {
        "source_sentence": "我知汝意是以不來。",
        "translation": "I know what you mean by not coming.",
        "source": "T03n0191_009:0959c04_37"
    },
    {
        "source_sentence": "今汝思念：『作法已畢，沙門若來甚有供養。』",
        "translation": "Now, you must think, 'After performing the ritual, there's a great offering if an ascetic comes along.'",
        "source": "T03n0191_009:0959c04_38"
    },
    {
        "source_sentence": "我亦知爾，是以此來。」",
        "translation": "I also know this, so it's because of this.",
        "source": "T03n0191_009:0959c05_39"
    },
    {
        "source_sentence": "迦葉思惟：「此大沙門是大聖者，悉知我意，必定亦是阿羅漢也。」",
        "translation": "Kāśyapa thought, This great ascetic is a great sage who knows my intention and will surely be an arhat.",
        "source": "T03n0191_009:0959c06_40"
    },
    {
        "source_sentence": "佛與迦葉言論已竟，尋還所止。",
        "translation": "After he had finished speaking with Kāśyapa, the Buddha returned to where he was staying.",
        "source": "T03n0191_009:0959c07_41"
    },
    {
        "source_sentence": "迦葉於後以虔潔心造諸飲食，極令香美異其常品，待至來日自詣佛所，",
        "translation": "Kāśyapa then prepared various foods and drinks with a pure mind of reverence, such that they were extremely fragrant and different from ordinary food. On the day after tomorrow he himself came before the Buddha to see them.",
        "source": "T03n0191_009:0959c08_42"
    },
    {
        "source_sentence": "白言：「沙門！",
        "translation": "He said, As a monk!",
        "source": "T03n0191_009:0959c10_43"
    },
    {
        "source_sentence": "我以專心備辦食竟，願過我舍而受供養。」",
        "translation": "After I've prepared my food with concentration, may I go to my house and receive an offering.",
        "source": "T03n0191_009:0959c10_44"
    },
    {
        "source_sentence": "佛受請已而告之曰：「汝但先去，吾當便至。」",
        "translation": "After accepting the invitation, the Buddha told him, Just go ahead and I'll come.",
        "source": "T03n0191_009:0959c11_45"
    },
    {
        "source_sentence": "迦葉既去，世尊入三摩地，由如壯士屈伸臂頃，於贍部洲界取贍部樹果，",
        "translation": "When Kāśyapa had departed, the World-honored One entered concentration called absorption. It was just as if a strong man were to bend and stretch out his arm in order to take Jambudvīpa fruit from Jambudvīpa’s",
        "source": "T03n0191_009:0959c12_46"
    },
    {
        "source_sentence": "盛滿鉢已迴還，先至迦葉住處跏趺而坐。",
        "translation": "After he had filled his bowl and returned, he first went to Kāśyapa's dwelling place and sat cross-legged.",
        "source": "T03n0191_009:0959c13_47"
    },
    {
        "source_sentence": "迦葉後至，見佛先到驚而言曰：「沙門來耶！」",
        "translation": "When Kāśyapa arrived later, he saw the Buddha arrive first and was startled, saying, Is the ascetic coming?",
        "source": "T03n0191_009:0959c14_48"
    },
    {
        "source_sentence": "佛言：「我來久矣。」",
        "translation": "The Buddha said, I've been here a long time.",
        "source": "T03n0191_009:0959c15_49"
    },
    {
        "source_sentence": "迦葉又言：「從何道來？」",
        "translation": "Kāśyapa again said, Where did you come from?",
        "source": "T03n0191_009:0959c16_50"
    },
    {
        "source_sentence": "佛即報言：「我從住處往贍部洲界取贍部樹果，還來於此。」",
        "translation": "The Buddha then replied, From my place of abode, I'll go to the limits of Jambudvīpa to obtain Jambudvīpa fruit from the Jambudvīpa tree and return here.",
        "source": "T03n0191_009:0959c16_51"
    },
    {
        "source_sentence": "迦葉言：「大沙門乃有如是神通迅疾，於少時間能往於彼取果還來，此大沙門亦是阿羅漢也。」",
        "translation": "Kāśyapa said, A great ascetic has such a swiftness of supernormal powers that for a short time he can go there to get the fruit and return it, and this great ascetic is also an arhat.",
        "source": "T03n0191_009:0959c17_52"
    },
    {
        "source_sentence": "佛即以果示之：「迦葉！",
        "translation": "The Buddha then showed him the fruit, Kāśyapa!",
        "source": "T03n0191_009:0959c20_0"
    },
    {
        "source_sentence": "汝曾見不？」",
        "translation": "Have you ever seen it?",
        "source": "T03n0191_009:0959c20_1"
    },
    {
        "source_sentence": "迦葉言：「我未曾見。」",
        "translation": "Kāśyapa said, I've never seen it before.",
        "source": "T03n0191_009:0959c20_2"
    },
    {
        "source_sentence": "佛言：「汝樂食不？」",
        "translation": "The Buddha said, Would you like to eat?",
        "source": "T03n0191_009:0959c21_3"
    },
    {
        "source_sentence": "答言：「樂食。」",
        "translation": "He replied, Pleasant food.",
        "source": "T03n0191_009:0959c21_4"
    },
    {
        "source_sentence": "佛言：「隨意。」",
        "translation": "The Buddha said, As you wish.",
        "source": "T03n0191_009:0959c21_5"
    },
    {
        "source_sentence": "迦葉食果歎未曾有。",
        "translation": "Kāśyapa ate the fruit and praised it as unprecedented.",
        "source": "T03n0191_009:0959c22_0"
    },
    {
        "source_sentence": "食果已竟，即以所造種種飲食自手奉上。",
        "translation": "After he finished eating the fruit, he presented himself with various foods and drinks that he had created.",
        "source": "T03n0191_009:0959c22_1"
    },
    {
        "source_sentence": "佛喫食已澡漱亦畢，即為迦葉說偈，祝願訖，尋迴樹下。",
        "translation": "After the Buddha had eaten, bathed, and rinsed himself, he spoke a verse to Kāśyapa, completed his vow, and returned to the foot of the tree.",
        "source": "T03n0191_009:0959c23_2"
    },
    {
        "source_sentence": "又第二日請佛受供，佛即依前入三摩地，往弗婆提取菴摩羅果，先至迦葉住處。",
        "translation": "On the second day, he invited the Buddha to accept the offerings, entered samādhi as before, went to Pūrvavideha to obtain the ambrosia fruit, and arrived at Kāśyapa's dwelling place.",
        "source": "T03n0191_009:0959c24_3"
    },
    {
        "source_sentence": "又第三日請佛受供，佛入三摩地，往西衢陀洲取得尾螺迦閉他果，還來先至迦葉住處。",
        "translation": "On the third day, he invited the Buddha to accept the offerings, entered samādhi, went to the western continent of Kuda and obtained the fruit of Īśāra-kāśyapa, returned first, and arrived at Kāśyapa'",
        "source": "T03n0191_009:0959c26_4"
    },
    {
        "source_sentence": "至第四日請佛受供，佛即入三摩地，如屈伸臂頃，往北俱盧洲取自然米飯鉢中持來，",
        "translation": "On the fourth day, he invited the Buddha to accept the offerings. The Buddha entered concentration and, just as quickly as if he were extending his arm, went to the northern continent of Kauśinagara to take some rice and rice bowls made of",
        "source": "T03n0191_009:0959c28_5"
    },
    {
        "source_sentence": "先至迦葉住處安坐，已久迦葉方來。",
        "translation": "He had previously arrived at the place where Kāśyapa was staying and sat quietly. It had been a long time since Kāśyapa had come.",
        "source": "T03n0191_009:0960a01_6"
    },
    {
        "source_sentence": "迦葉又問：「自何道來？」",
        "translation": "Kāśyapa again asked, Where did you come from?",
        "source": "T03n0191_009:0960a02_7"
    },
    {
        "source_sentence": "佛答：「迦葉！",
        "translation": "The Buddha answered, Kāśyapa!",
        "source": "T03n0191_009:0960a02_8"
    },
    {
        "source_sentence": "我適往彼北俱盧洲，取自然米飯持來至此。」",
        "translation": "I'll go to the northern continent of Kauśinagara and take rice and rice from my native land and bring it here.",
        "source": "T03n0191_009:0960a03_0"
    },
    {
        "source_sentence": "迦葉歎曰：「此大沙門有是神通，必是亦得阿羅漢果。」",
        "translation": "Kāśyapa praised him, This great ascetic has such supernormal powers, and he'll surely attain the fruit of arhatship.",
        "source": "T03n0191_009:0960a04_0"
    },
    {
        "source_sentence": "佛還問言：「北洲之飯汝樂食耶？」",
        "translation": "The Buddha returned and asked, Are you happy to eat the rice of the northern continent?",
        "source": "T03n0191_009:0960a05_1"
    },
    {
        "source_sentence": "答言：「樂食。」",
        "translation": "He replied, Pleasant food.",
        "source": "T03n0191_009:0960a05_2"
    },
    {
        "source_sentence": "佛言：「隨意。」",
        "translation": "The Buddha said, As you wish.",
        "source": "T03n0191_009:0960a06_3"
    },
    {
        "source_sentence": "迦葉食已歎未曾有，於是以自所辦種種飲食奉上於佛。",
        "translation": "Having eaten the food, Kāśyapa praised it as unprecedented and offered various foods he prepared to the Buddha.",
        "source": "T03n0191_009:0960a06_4"
    },
    {
        "source_sentence": "佛受食竟澡漱亦畢，即為迦葉說偈，祝願已，還歸樹下。",
        "translation": "After the Buddha had accepted the food and washed it, he spoke a verse to Kāśyapa, made his vow, and returned to the foot of the tree.",
        "source": "T03n0191_009:0960a07_5"
    },
    {
        "source_sentence": "世尊來日乃自持鉢往四大王天，直至忉利天取天酥味，還來所止樹下而食。",
        "translation": "On the next day, the Bhagavān took his bowl and went to the four great kings' heavens, up to the Trāyastriṃśa gods who took the taste of heavenly butter and returned home, stopped under a tree, and ate",
        "source": "T03n0191_009:0960a08_6"
    },
    {
        "source_sentence": "喫食既畢，思水澡漱。",
        "translation": "After he had finished eating, he thought of water for washing and rinsing.",
        "source": "T03n0191_009:0960a10_7"
    },
    {
        "source_sentence": "帝釋天主知佛思水，如展臂頃來至佛所，白世尊言：「欲水用耶？」",
        "translation": "Knowing that the lord of Indra was thinking about water, he came to the Buddha in an instant as if he were extending his arm and said to the Bhagavān, Do you want water for your use?",
        "source": "T03n0191_009:0960a11_8"
    },
    {
        "source_sentence": "佛言：「欲水。」",
        "translation": "The Buddha said, Desire water.",
        "source": "T03n0191_009:0960a12_9"
    },
    {
        "source_sentence": "帝釋即觀近地先有涸池，以手指之，水即湧出，清淨香潔無與等者。",
        "translation": "Indra then observed that there was previously a dried-up pond near the ground and pointed to it with his fingers, and the water immediately flowed out, which was as pure and fragrant as none other.",
        "source": "T03n0191_009:0960a12_10"
    },
    {
        "source_sentence": "佛即澡漱隨意受用。",
        "translation": "The Buddha then rinsed it and used it as he wished.",
        "source": "T03n0191_009:0960a14_11"
    },
    {
        "source_sentence": "帝釋天主還歸天宮。",
        "translation": "Indra the lord of the gods returned to the heavenly palace.",
        "source": "T03n0191_009:0960a14_12"
    },
    {
        "source_sentence": "迦葉忽見驚怪非常：「而此涸池無水已久，今復水滿，不知何來？」",
        "translation": "Kāśyapa suddenly saw this and was startled, saying, But this dried-up pond hasn't had water for a long time, and now it's full again, so he doesn't know where it comes from.",
        "source": "T03n0191_009:0960a15_13"
    },
    {
        "source_sentence": "速至佛所而白佛言：「大沙門！",
        "translation": "They quickly went to the Buddha and said to him, Great ascetic!",
        "source": "T03n0191_009:0960a16_14"
    },
    {
        "source_sentence": "此池久涸，水因何有？」",
        "translation": "This pond has been dried up for a long time, so why does the water exist?",
        "source": "T03n0191_009:0960a17_15"
    },
    {
        "source_sentence": "佛即報言：「今日食畢無水澡漱，帝釋遙知，乃下天來為我出水。」",
        "translation": "The Buddha then reported, Today's meal is over and there's no water to wash or rinse, but the emperor knows from a distance that he's coming down from heaven to give me water.",
        "source": "T03n0191_009:0960a17_16"
    },
    {
        "source_sentence": "迦葉歎言：「未曾有也！",
        "translation": "Kāśyapa praised him, saying, Never has it been done!",
        "source": "T03n0191_009:0960a19_17"
    },
    {
        "source_sentence": "食從天取，水令天出，能感如是，此必亦得阿羅漢也。」",
        "translation": "When the food is taken from the gods and the water causes the gods to come out, and when they can experience it like this, they'll surely also attain arhatship.",
        "source": "T03n0191_009:0960a19_18"
    },
    {
        "source_sentence": "迦葉乃立池名，謂之播抳佉多。",
        "translation": "Kāśyapa then established the name of the pond, which was called Pūrvavideha.",
        "source": "T03n0191_009:0960a20_19"
    },
    {
        "source_sentence": "佛於後時入池澡浴，池岸之側先有大樹，名阿祖囉曩，佛以袈裟挂於樹上，",
        "translation": "At a later time the Buddha entered the pond to bathe. On the bank of the pond there was a big tree called Asurasāṭa, where he hung his monks’ robe on top of the tree.",
        "source": "T03n0191_009:0960a21_20"
    },
    {
        "source_sentence": "迦葉來至見佛袈裟挂於樹上，知佛澡浴即來瞻覩。",
        "translation": "Kāśyapa came and saw the Buddha's reddish-brown robe hanging from a tree, and knowing that the Buddha was bathing, he came to look around.",
        "source": "T03n0191_009:0960a23_21"
    },
    {
        "source_sentence": "佛既浴訖，出水上岸，即展其手欲攀樹枝，時阿祖囉曩枝便低亞。",
        "translation": "After he had bathed, the Buddha emerged from the water and went up to the shore, spreading out his hand to climb a branch of the tree, and then the branches of the asuras withdrew.",
        "source": "T03n0191_009:0960a24_22"
    },
    {
        "source_sentence": "迦葉乃見，還復歎曰：「此大沙門實不思議，感得無情自然低亞，沙門亦得阿羅漢也。」",
        "translation": "When Kāśyapa saw this, he again praised it, saying, This great ascetic is really inconceivable; he's naturally inferior to sentient beings and the ascetic has attained arhatship.",
        "source": "T03n0191_009:0960a25_23"
    },
    {
        "source_sentence": "世尊後時思欲洗衣：「云何得石而為用耶？」",
        "translation": "The Bhagavān then wanted to wash, How could he get a stone for his use?",
        "source": "T03n0191_009:0960a27_24"
    },
    {
        "source_sentence": "帝釋遙知，尋至佛所白言：「世尊！",
        "translation": "Knowing from a distance, Indra went to the Buddha and said, Bhagavān!",
        "source": "T03n0191_009:0960a28_25"
    },
    {
        "source_sentence": "佛欲洗衣而用石耶？」",
        "translation": "Does the Buddha want to wash it and use rocks?",
        "source": "T03n0191_009:0960a29_26"
    },
    {
        "source_sentence": "佛言：「要石。」",
        "translation": "The Buddha said, Essential stone.",
        "source": "T03n0191_009:0960a29_27"
    },
    {
        "source_sentence": "帝釋即令夜叉於大山中取石一塊，修令平正復使光潔，置於池側。",
        "translation": "Indra then ordered the night-shark to take a piece of rock from the great mountain, cultivate it so that it was even and shiny, and place it beside the pond.",
        "source": "T03n0191_009:0960b01_28"
    },
    {
        "source_sentence": "佛即洗衣，洗已欲曬。",
        "translation": "The Buddha then did the washing, and after washing it, he wanted to dry it.",
        "source": "T03n0191_009:0960b02_29"
    },
    {
        "source_sentence": "帝釋又令夜叉別取一石置於池岸，佛洗衣竟就石曬之。",
        "translation": "Indra also ordered the yakṣa to separately take a stone and place it on the bank of the pond, and when the Buddha had finished washing his clothes, he dried it on the stone.",
        "source": "T03n0191_009:0960b03_30"
    },
    {
        "source_sentence": "迦葉來至，又見池岸忽然有石，乃自驚怪：「池岸先無，今從何來？」",
        "translation": "When Kāśyapa arrived, he saw another stone suddenly on the bank of the pond and wondered to himself, Where did the shore of the pond come from now?",
        "source": "T03n0191_009:0960b04_31"
    },
    {
        "source_sentence": "而白佛言：「大沙門！",
        "translation": "He said to the Buddha, Great ascetic!",
        "source": "T03n0191_009:0960b05_32"
    },
    {
        "source_sentence": "池岸之石自何而有？」",
        "translation": "Where did the stone on the bank of the pond come from?",
        "source": "T03n0191_009:0960b06_33"
    },
    {
        "source_sentence": "佛即報言：「我欲洗衣為無石故，即起思念，帝釋下來為我安置；",
        "translation": "The Buddha said in reply, “I wish to wash my clothes for the sake of the stoneless.",
        "source": "T03n0191_009:0960b06_34"
    },
    {
        "source_sentence": "我又思念無處曬衣，彼天帝釋又安一石。",
        "translation": "I also thought, 'There's no place to dry my clothes,' and that god Indra again placed another stone.",
        "source": "T03n0191_009:0960b08_35"
    },
    {
        "source_sentence": "二石所來，皆帝釋也。」",
        "translation": "The two stone objects that came are all Indra.",
        "source": "T03n0191_009:0960b09_36"
    },
    {
        "source_sentence": "迦葉大歎：「此大沙門，凡是所作非世之有，必已證得阿羅漢也。",
        "translation": "Kāśyapa greatly praised him, saying, This great ascetic, whatever he does, is not a worldly existence, and he must have realized arhatship.",
        "source": "T03n0191_009:0960b09_37"
    },
    {
        "source_sentence": "然其所證應莫超吾。」",
        "translation": "However, what they realize shouldn't surpass me.",
        "source": "T03n0191_009:0960b11_0"
    },
    {
        "source_sentence": "迦葉之心似有省悟，世尊又以方便更現異相，教化迦葉令入正道。",
        "translation": "Kāśyapa's mind seemed to have reflection and awakening, and the Bhagavān also used skillful means to show different characteristics and teach Kāśyapa so that he would enter the right path.",
        "source": "T03n0191_009:0960b11_1"
    },
    {
        "source_sentence": "佛即化彼尼連河水忽然汎溢，居河左右人多漂溺，枯涸陂池處處皆滿，",
        "translation": "The water of the Nairañjanā River suddenly overflowed, and all the people on both sides of the river were submerged. All the ponds that withered and dried up inundated everywhere.",
        "source": "T03n0191_009:0960b13_2"
    },
    {
        "source_sentence": "佛所止處正居其內，佛以神力令水環遶，四面壁立中心塵起。",
        "translation": "Where the Buddha was staying, they were correctly residing inside it, and the Buddha used his miraculous powers to cause water to circle them, and dust rose up at the center of the wall on four sides.",
        "source": "T03n0191_009:0960b14_3"
    },
    {
        "source_sentence": "迦葉是時見河汎溢最盛於常，即思念言：「彼大沙門得不漂溺？」",
        "translation": "When Kāśyapa saw that the river was overflowing and floating, he thought, Did that great ascetic get to not drown?",
        "source": "T03n0191_009:0960b16_4"
    },
    {
        "source_sentence": "由是乘船速至佛所，乃見世尊樹下經行步步塵起，又以環水壁立不能下船，",
        "translation": "As soon as they reached the place where the Buddha was staying, they saw the World-honored One walking up and down in the footsteps beneath a tree. They climbed up into the water but could not board the boat because of the rings [of the",
        "source": "T03n0191_009:0960b17_5"
    },
    {
        "source_sentence": "歎異倍常，遙相慰曰：「沙門安否？",
        "translation": "He praised the monk's dissimilarity, which was twice as great as usual, and comforted him from a distance, saying, Is the monk at peace?",
        "source": "T03n0191_009:0960b19_6"
    },
    {
        "source_sentence": "得無憂惱耶？」",
        "translation": "Is it possible to have no sorrow?",
        "source": "T03n0191_009:0960b20_0"
    },
    {
        "source_sentence": "佛言：「我無憂惱，勞相諭也。」",
        "translation": "The Buddha said, I'm not sad and troubled; it's up to you to admonish me.",
        "source": "T03n0191_009:0960b20_1"
    },
    {
        "source_sentence": "復思念言：「此大沙門自有神通，何不離此？」",
        "translation": "Again, he thought, This great ascetic has his own supernormal powers, so why doesn't he leave here?",
        "source": "T03n0191_009:0960b20_2"
    },
    {
        "source_sentence": "迦葉又言：「莫欲乘船離於此耶？」",
        "translation": "Kāśyapa again said, Don't you want to leave here in a boat?",
        "source": "T03n0191_009:0960b21_3"
    },
    {
        "source_sentence": "佛言：「欲離於此。」",
        "translation": "The Buddha said, I want to leave here.",
        "source": "T03n0191_009:0960b22_4"
    },
    {
        "source_sentence": "迦葉白言：「若欲離者當自上船。」",
        "translation": "Kāśyapa said, If you want to leave, you'll board the boat yourself.",
        "source": "T03n0191_009:0960b22_5"
    },
    {
        "source_sentence": "佛以神力，如彈指頃，已在船中跏趺而坐。",
        "translation": "The Buddha used his supernatural powers to snap his fingers as quickly as if he were sitting cross-legged in the boat.",
        "source": "T03n0191_009:0960b23_6"
    },
    {
        "source_sentence": "迦葉見佛已坐，不見所來所入。",
        "translation": "Kāśyapa saw that the Buddha was already seated and did not see where he came or entered.",
        "source": "T03n0191_009:0960b24_7"
    },
    {
        "source_sentence": "迦葉歎言：「沙門是大丈夫，有大威德，乃有神通能如是也。」",
        "translation": "Kāśyapa praised him, saying, This ascetic is a great man with great authority and virtue, so he has the supernormal powers to do so.",
        "source": "T03n0191_009:0960b25_8"
    },
    {
        "source_sentence": "迦葉白言：「我自亦得阿羅漢果，然不及沙門所證之道。」",
        "translation": "Kāśyapa said, I myself have attained the fruit of arhatship, but it's not as good as the path realized by an ascetic.",
        "source": "T03n0191_009:0960b26_9"
    },
    {
        "source_sentence": "佛知迦葉決定迴心，便即告言：「汝自言證阿羅漢者，非實證也！」",
        "translation": "Knowing Kāśyapa's determined dedication of mind, the Buddha then told him, You yourself say you've realized the arhat, but it's not true realization!",
        "source": "T03n0191_009:0960b27_10"
    },
    {
        "source_sentence": "迦葉忽聞世尊發如是語，身毛皆竪轉自尅責：「此大沙門悉能知我種種之事，",
        "translation": "When Kāśyapa suddenly heard these words uttered by the World-honored One, his body hair stood on end and he reproached himself: This great renunciant knows all my various affairs.",
        "source": "T03n0191_009:0960b29_11"
    },
    {
        "source_sentence": "今宜師之以進其道。」",
        "translation": "Now, it's appropriate for the teacher to advance his path.",
        "source": "T03n0191_009:0960c01_12"
    },
    {
        "source_sentence": "作念已定而白佛言：「大沙門！",
        "translation": "After he had made this thought, he concentrated and said to the Buddha, Great ascetic!",
        "source": "T03n0191_009:0960c02_13"
    },
    {
        "source_sentence": "願知我意，今欲於大沙門法中出家而為僧伽，稟奉教勅修持梵行，唯願慈悲特賜聽許。」",
        "translation": "May you know what I want, so now that I want to leave home in the great ascetic teachings and become a monk for the sake of the saṃgha, upholding the precepts and cultivating the religious practice, please have mercy and com",
        "source": "T03n0191_009:0960c03_14"
    },
    {
        "source_sentence": "佛知迦葉證道時至，又以方便化彼徒眾，乃謂迦葉曰：「汝欲於吾法中出家學道為沙門者，",
        "translation": "Knowing that it was the right time for Kāśyapa to realize enlightenment, the Buddha again instructed his disciples with skillful means. He said to Kāśyapa, “If you wish to renounce domestic life and study the path in my",
        "source": "T03n0191_009:0960c05_15"
    },
    {
        "source_sentence": "還曾令諸弟子悉知已否？」",
        "translation": "Have you ever told the disciples to know it?",
        "source": "T03n0191_009:0960c07_16"
    },
    {
        "source_sentence": "迦葉答言：「弟子未知。」",
        "translation": "Kāśyapa replied, The disciple doesn't know.",
        "source": "T03n0191_009:0960c07_17"
    },
    {
        "source_sentence": "佛言：「汝為人師，不得卒暴。",
        "translation": "The Buddha said, You're a teacher for people, so you mustn't suddenly become violent.",
        "source": "T03n0191_009:0960c08_18"
    },
    {
        "source_sentence": "且可歸還與弟子議，若謂然者即可再來，斯亦未晚。」",
        "translation": "You may return and discuss it with the disciple, or if you say so, you can go back; it won't be too late.",
        "source": "T03n0191_009:0960c08_19"
    },
    {
        "source_sentence": "迦葉奉教還至住處，乃與摩拏嚩迦等五百弟子同集一處，告而言曰：「彼大沙門相好異常神通難及，",
        "translation": "Having been instructed, Kāśyapa returned to his dwelling place and assembled together with the five hundred disciples Mahākāśyapa in one place. He said: That great śramaṇa has extraordinary features that are difficult to be matched by",
        "source": "T03n0191_009:0960c10_0"
    },
    {
        "source_sentence": "凡所動止天悉遙知，或來座前而聽其法，或有要用皆能給送，累見神變我實不如。",
        "translation": "Anyone who moves or stops the gods will know from a distance that they may come before their seats to listen to their teachings, or they may be able to give them whatever they need, and they'll often see that the miraculous self is really",
        "source": "T03n0191_009:0960c12_1"
    },
    {
        "source_sentence": "今欲師彼出家以進其道。",
        "translation": "Now, I want to teach them to leave home in order to advance their path.",
        "source": "T03n0191_009:0960c14_2"
    },
    {
        "source_sentence": "吾已決定，汝等如何？",
        "translation": "I've already decided, so what about you?",
        "source": "T03n0191_009:0960c14_3"
    },
    {
        "source_sentence": "細自籌量以實報我。」",
        "translation": "Consider it for yourself in detail to give me a real reward.",
        "source": "T03n0191_009:0960c15_4"
    },
    {
        "source_sentence": "摩拏嚩迦白迦葉言：「彼火龍暴惡首先降伏，神異他心眾人目覩。",
        "translation": "Mātṛkā said to Kāśyapa, That fierce fire dragon first subdued it, and the minds of gods differ from those of others.",
        "source": "T03n0191_009:0960c15_5"
    },
    {
        "source_sentence": "我等所業悉自師傳，師既未如，弟子何說。",
        "translation": "All of our actions have been handed down by our teacher. Since the teacher has not yet done so, what did he teach us?",
        "source": "T03n0191_009:0960c17_6"
    },
    {
        "source_sentence": "師若決志，我等皆隨；",
        "translation": "If the teacher is determined, we will follow him.",
        "source": "T03n0191_009:0960c18_7"
    },
    {
        "source_sentence": "師若達彼宗源，亦願垂於濟度，我等已決眾共一心，今或可行不可失也。」",
        "translation": "If the teacher understands the source of that doctrine, he also wishes to save and liberate them; we've decided that the congregation is united with one mind, so now it might be possible to practice without losing it.",
        "source": "T03n0191_009:0960c18_8"
    },
    {
        "source_sentence": "於是迦葉知眾誠願，乃令弟子取事火具，護摩杓等種種之器，及鹿皮衣、樹皮衣、淨瓶、拄杖、革屣等物，",
        "translation": "Knowing the sincerity of the wishes of the monks, Kāśyapa ordered his disciples to take all the fire altar utensils, water bowls, ladles, and other various articles, as well as robes made of deer",
        "source": "T03n0191_009:0960c20_9"
    },
    {
        "source_sentence": "悉棄尼連河中，以示不迴之相，師徒相率同詣佛所，頂禮佛足退立一面。",
        "translation": "They all abandoned them in the Nairañjanā River to show their signs of not turning back. The teachers and disciples, accompanied by one another, approached the Buddha together; bowed at his feet and withdrew to one side.",
        "source": "T03n0191_009:0960c22_10"
    },
    {
        "source_sentence": "爾時世尊謂迦葉曰：「汝復來耶？」",
        "translation": "It was then that the Bhagavān said to Kāśyapa, Are you coming again?",
        "source": "T03n0191_009:0960c25_0"
    },
    {
        "source_sentence": "迦葉答言：「今與弟子同來，欲於大沙門法中出家修學。」",
        "translation": "Kāśyapa answered, Now, I'm here with my disciples, wanting to leave home and train in the great ascetic teachings.",
        "source": "T03n0191_009:0960c25_1"
    },
    {
        "source_sentence": "佛已懸知乃更審曰：「汝諸弟子誠心以否？」",
        "translation": "Knowing this, the Buddha then further examined it and said, Are your disciples sincere in mind?",
        "source": "T03n0191_009:0960c26_2"
    },
    {
        "source_sentence": "迦葉答言：「我與弟子皆悉誠心，唯願慈哀咸垂濟度。」",
        "translation": "Kāśyapa replied, All of my disciples and I are sincere in our hearts; we only wish to be saved by kindness and pity.",
        "source": "T03n0191_009:0960c27_3"
    },
    {
        "source_sentence": "佛即默許度為沙門，又復報言：「汝等今朝是真出家、是真梵行，披袈裟衣而實沙門。」",
        "translation": "The Buddha then quietly agreed to be ordained as a monk, and he also reported, Now, you're truly renunciants and truly religious practitioners who wear the reddish-brown robes and are really monks.",
        "source": "T03n0191_009:0960c29_4"
    },
    {
        "source_sentence": "爾時烏嚕尾螺迦葉身著袈裟成沙門相，又聞佛言：「汝今是真出家、是真梵行。」",
        "translation": "It was then that Uruvilvā-Kāśyapa put on his robes and became a monk's appearance, and he heard the Buddha again say, Now, you truly leave home and truly practice religiously.",
        "source": "T03n0191_009:0961a02_0"
    },
    {
        "source_sentence": "私自慶喜我心全滅。",
        "translation": "They privately rejoice for themselves, and their minds completely cease.",
        "source": "T03n0191_009:0961a03_1"
    },
    {
        "source_sentence": "又復思惟：「往昔大仙嘗說斯事：『世稀有佛出興於世，得無上覺具一切智，",
        "translation": "Again, he thought: Once long ago the great sage said these things: Rarely has a buddha emerged in the world who has attained the supreme awakening and perfected omniscience.",
        "source": "T03n0191_009:0961a04_2"
    },
    {
        "source_sentence": "是大聖人天上人間悉能利樂。』",
        "translation": "This is a great sage who's able to bring benefit and happiness to gods and humans.'",
        "source": "T03n0191_009:0961a05_3"
    },
    {
        "source_sentence": "我於前時夜出觀星有大火聚，謂其事火與我同宗，乃是梵王、帝釋、四天王等互來聽法。",
        "translation": "In the past night, I went out to observe the stars and saw a large fire cluster that said that the fire in question was the same as mine, and that Brahmā, Indra, the four heavenly kings, and others were listening to each other's teaching",
        "source": "T03n0191_009:0961a06_4"
    },
    {
        "source_sentence": "今惟此事是大聖人，此非大聖，孰為聖也？」",
        "translation": "Now, this is the only thing that's a great sage, not a great sage; who is a sage?",
        "source": "T03n0191_009:0961a08_5"
    },
    {
        "source_sentence": "於是迦葉易沙門稱，呼佛為世尊也。",
        "translation": "Kāśyapa then changed the name of the ascetic and called the Buddha the Bhagavān.",
        "source": "T03n0191_009:0961a09_6"
    },
    {
        "source_sentence": "佛說眾許摩訶帝經卷第九",
        "translation": "Foshuo zhixiu mohaiti jing, vol. 9",
        "source": "T03n0191_009:0961a11_0"
    }
]