[
    {
        "source_sentence": "佛本行集經卷第五十六",
        "translation": "Fobenxing ji jing, vol. 56",
        "source": "T03n0190_056:0910b02_0"
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Translated by the Tripiṭaka of India, translated by Jñānagupta",
        "source": "T03n0190_056:0910b04_0"
    },
    {
        "source_sentence": "羅睺羅因緣品下",
        "translation": "Under Rāhula's Chapter on Causes and Conditions",
        "source": "T03n0190_056:0910b05_0"
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「汝諸比丘！",
        "translation": "It was then that the Buddha addressed the monks, saying, You monks!",
        "source": "T03n0190_056:0910b06_0"
    },
    {
        "source_sentence": "我念往昔，過去久遠，在迦尸國，於彼聚落，近有一山，名欝蒸伽。",
        "translation": "World-Honored One, I remember a long time in the past when I was living in the country of Kāśi. In that village there was a mountain nearby named Nirmāṇaratika.",
        "source": "T03n0190_056:0910b06_1"
    },
    {
        "source_sentence": "其山南面，有一園林，其園雜樹，數過十萬，華果茂盛，枝葉扶踈，遙遠瞻望，",
        "translation": "On the southern side of the mountain there was a pleasure grove, more than one hundred thousand yojanas in number, with plenty of flowers and fruit. The branches and leaves were luxuriant and looked out from a distance.",
        "source": "T03n0190_056:0910b08_2"
    },
    {
        "source_sentence": "如青雲隊。",
        "translation": "It's like a cluster of blue clouds.",
        "source": "T03n0190_056:0910b09_3"
    },
    {
        "source_sentence": "於其園內，處處皆有蓮華池沼，其數眾多，莊嚴園林，其林高大空閑寂靜(或有師說欝蒸伽山近波羅[木*奈]城)。",
        "translation": "Within that park, there are lotus ponds and marshes everywhere, many in number, adorned with gardens and forests, which are lofty, high, large, empty, and tranquil (some masters say that Mount Anavatapta is near the city",
        "source": "T03n0190_056:0910b10_4"
    },
    {
        "source_sentence": "爾時彼山有諸群象，其象群內，有一象母，生育一子，形體端正，觀者無厭。",
        "translation": "At the time, there were a group of elephants on that mountain. Among those elephants, there was an elephant mother who gave birth to a son whose body was handsome and beautiful in appearance, and the observers didn't tire of it.",
        "source": "T03n0190_056:0910b12_0"
    },
    {
        "source_sentence": "然彼象子，其身潔白，六牙備足，其頭純黑，如因陀羅瞿波鳥頭，七支拄地。",
        "translation": "The elephant boy, however, his body was pure white, with the six-tusked legs and feet, and his head was pure black like the head of a Indragopa bird, seven limbs on the ground.",
        "source": "T03n0190_056:0910b13_1"
    },
    {
        "source_sentence": "其彼象子，養育不久，成大象龍，如法修行，孝順父母，供養之時，有敬重心。",
        "translation": "Soon after that the elephant-child grew up and became a great elephant dragon. Cultivating himself in accordance with the Dharma, he was filial to his parents and respectfully offered support with veneration.",
        "source": "T03n0190_056:0910b15_2"
    },
    {
        "source_sentence": "然彼象子，諸有飲食，草果根等，先奉父母，令其充飽，然後自食。",
        "translation": "Still, those elephants who have food and drink, such as grass, fruit, roots, and so forth, first serve their parents to satisfy them before they eat it themselves.",
        "source": "T03n0190_056:0910b17_3"
    },
    {
        "source_sentence": "「爾時，象龍又於一時，因求草果諸飲食等，處處遊行。",
        "translation": "At the time, there was another time when the elephants and dragons traveled from place to place in search of grass, fruit, food, and drink.",
        "source": "T03n0190_056:0910b19_0"
    },
    {
        "source_sentence": "有諸獵師，忽見此象，即作是念：『此之象龍，非是餘人所堪乘者，唯梵德王，",
        "translation": "Some hunters suddenly saw the elephant and thought, “This elephant is not capable of being driven by anyone but Brahmā.",
        "source": "T03n0190_056:0910b20_1"
    },
    {
        "source_sentence": "堪能乘耳。』",
        "translation": "They're capable of riding it.'",
        "source": "T03n0190_056:0910b21_2"
    },
    {
        "source_sentence": "作是念已，遂即往詣梵德王邊，到已白言：『大王！",
        "translation": "Having had this thought, he went to the side of King Brahmadeva and said, 'Great king!",
        "source": "T03n0190_056:0910b22_3"
    },
    {
        "source_sentence": "當知，某處林內，有一象龍，端正可喜，其身潔白，具有六牙，其象黑頭，",
        "translation": "You should know that in a certain forest there was an elephant-nāga, handsome and graceful, with white body and six tusks. That elephant had a black head, legs, feet, and ears like the lion’s",
        "source": "T03n0190_056:0910b23_4"
    },
    {
        "source_sentence": "如因陀羅瞿波之鳥，七支拄地，如我所見。",
        "translation": "It's like the Indra Gopal bird with seven limbs on the ground, just as I see it.",
        "source": "T03n0190_056:0910b24_5"
    },
    {
        "source_sentence": "彼象當堪大王乘之，如其大王意所樂者，可往遣人搦彼象，取將示王來。』",
        "translation": "That elephant will be capable of being ridden by the king, and if he wants what the king desires, he can send someone to see that elephant and take it and show it to the king.'",
        "source": "T03n0190_056:0910b25_6"
    },
    {
        "source_sentence": "時梵德王，尋即召喚能搦象者，勅告之言：『我聞他說，有一象龍，其象六牙，",
        "translation": "Then King Brahmadeva summoned the elephant-turning elephant and said to him, “I have heard you say that there is an elephant dragon whose elephant has six tusks.",
        "source": "T03n0190_056:0910b27_7"
    },
    {
        "source_sentence": "端正可喜，觀看之者，無有厭足，乃至七支，悉皆拄地。",
        "translation": "It's delightful and pleasing, and anyone who looks at it doesn't tire of it, even up to seven limbs that are all supported on the ground.",
        "source": "T03n0190_056:0910b29_8"
    },
    {
        "source_sentence": "汝等必當速往彼處，捉彼象龍，將至我所，勿使遲遲令有失脫。』",
        "translation": "You must quickly go there, grab that elephant or dragon and bring it to me, so you won't lose your way.'",
        "source": "T03n0190_056:0910c01_9"
    },
    {
        "source_sentence": "「爾時所有諸搦象人，聞梵德王有如是勅，而報之言：『如王所勅，不敢違教。』",
        "translation": "At the time, all the elephants and men there heard that King Brahmadeva had such an edict, and they reported it to him, saying, 'As the king has instructed me, I won't dare disobey his teaching.'",
        "source": "T03n0190_056:0910c03_0"
    },
    {
        "source_sentence": "即辦牢韌諸皮索等，往至象邊，以呪呪之。",
        "translation": "He then prepared a bundle of leather cords and so forth, went to the elephant's side, cursed it with a spell.",
        "source": "T03n0190_056:0910c04_1"
    },
    {
        "source_sentence": "其象自來赴向人所，遂即捉之，以彼皮繩，繫縛象已，牽來將至梵德王邊。",
        "translation": "The elephant came out and went to the place where the man was. So he captured the elephant, tied it with a leather rope around its neck, and led it to the king Brahmā’s side.",
        "source": "T03n0190_056:0910c05_2"
    },
    {
        "source_sentence": "「時梵德王，遙見彼等將其象龍欲至之時，即起出迎，以歡喜故，作如是言：『快得如是妙好大乘，",
        "translation": "“Then King Brahmadeva saw them from a distance, leading their elephants and dragons. When they were about to arrive, he stood up to greet them. Because of his delight, he said:",
        "source": "T03n0190_056:0910c08_0"
    },
    {
        "source_sentence": "快得如是妙好大乘。』",
        "translation": "They'll quickly attain such a marvelous great vehicle.'",
        "source": "T03n0190_056:0910c10_1"
    },
    {
        "source_sentence": "「時，梵德王身自養飼，但於彼象所堪食者，悉皆與之，一切所食，自看自與。",
        "translation": "“Then King Brahmadeva sustained himself by feeding the elephant. He gave whatever he ate to each of the four kinds of animals that he saw fit to eat.",
        "source": "T03n0190_056:0910c11_0"
    },
    {
        "source_sentence": "雖復如此，而彼象龍，反更羸瘦，恒大呻吟，呼聲大叫，悲啼流淚，無時暫憩。",
        "translation": "Even so, the elephants and dragons grow weaker and thinner. They cry aloud and wail in distress, weeping piteously, shedding tears of grief; there is no time for them to rest.",
        "source": "T03n0190_056:0910c12_1"
    },
    {
        "source_sentence": "時梵德王，見彼象龍羸瘦憔悴，乃至悲啼流淚如此，至於象前，合十指掌，",
        "translation": "King Brahmadeva then saw that the elephant-nāga was so thin and emaciated that he cried in sorrow. He came before the elephant, joining his palms with his ten fingers.",
        "source": "T03n0190_056:0910c14_2"
    },
    {
        "source_sentence": "語象龍言：『我將一切諸好飲食，供養於汝，汝乃羸瘦，不著膚體，減損色力，",
        "translation": "He said to the elephant-nāga, “I will offer you all kinds of delicious food and drink as an offering.",
        "source": "T03n0190_056:0910c16_0"
    },
    {
        "source_sentence": "身嬰羸瘠，然我觀汝，心不悅懌，不受歡樂。",
        "translation": "Your body is small and weak, but when I look at you, my mind isn't happy or depressed, and I don't experience happiness.",
        "source": "T03n0190_056:0910c17_1"
    },
    {
        "source_sentence": "我心愛汝，供給瞻養，未曾暫捨。",
        "translation": "I love you with affection and offer you my support, never giving it up for a moment.",
        "source": "T03n0190_056:0910c18_2"
    },
    {
        "source_sentence": "汝須何事，我今皆與，令汝歡喜，汝何緣故，不喜不樂？』",
        "translation": "What things you need, I'll give them to you now and make you rejoice; for what reason don't you rejoice or delight?'",
        "source": "T03n0190_056:0910c19_3"
    },
    {
        "source_sentence": "「爾時，象龍白梵德王作如是言：『我今啟白大王一語，令王歡喜。』",
        "translation": "At the time, the elephant dragon said to King Brahmadeva, 'Now, I'll reveal one thing to the great king that will make him rejoice.'",
        "source": "T03n0190_056:0910c21_0"
    },
    {
        "source_sentence": "「時梵德王，聞彼象龍作如是言，生大希有歡喜之心，復作是念：『希有此事！",
        "translation": "When King Brahmadeva heard that elephant-nāga say this, he became very rare and joyous, and then he thought, 'How rare it is!'",
        "source": "T03n0190_056:0910c23_0"
    },
    {
        "source_sentence": "此龍象王，能作人語。』",
        "translation": "This dragon king or elephant king can speak human words.'",
        "source": "T03n0190_056:0910c24_1"
    },
    {
        "source_sentence": "作是念已，報彼象龍作如是言：『汝象龍王！",
        "translation": "After he had this thought, he reported to the elephant king and said, 'You, elephant king!",
        "source": "T03n0190_056:0910c25_2"
    },
    {
        "source_sentence": "出如是語，令我歡喜。』",
        "translation": "Producing such words will make me rejoice.'",
        "source": "T03n0190_056:0910c26_3"
    },
    {
        "source_sentence": "「爾時，象龍白梵德王作如是言：『大王！",
        "translation": "At the time, the elephant dragon said to King Brahmadeva, 'Great king!",
        "source": "T03n0190_056:0910c27_0"
    },
    {
        "source_sentence": "當知，彼林之內，我有父母，年老力衰，住彼林內，我念未被王所搦時自爾已前，",
        "translation": "You should know that inside the forest there was my father and mother. As they grew old and weakened, I stayed inside the forest.",
        "source": "T03n0190_056:0910c27_1"
    },
    {
        "source_sentence": "不曾憶有先自食噉始與父母，水漿亦爾，先與父母，然後自飲。",
        "translation": "I do not recall ever having eaten rice for my parents before giving it to me. The same applies to water and juice. First give it to your parents, and then drink it yourself.",
        "source": "T03n0190_056:0910c29_2"
    },
    {
        "source_sentence": "我今思量，受王供給，一切資須，無所乏少，養育於我。",
        "translation": "I now consider and accept the king’s offer to provide me with all my necessities, without any lack.",
        "source": "T03n0190_056:0911a02_0"
    },
    {
        "source_sentence": "然其父母，在彼林中，乃成孤獨，受大苦辛。",
        "translation": "Still, while his parents were in that forest, he became an orphan and suffered great pain.",
        "source": "T03n0190_056:0911a03_1"
    },
    {
        "source_sentence": "我今正以不見父母，是故如此憂愁不樂。』",
        "translation": "Now, it's precisely because I don't see my parents that I'm so sad and unhappy.'",
        "source": "T03n0190_056:0911a04_2"
    },
    {
        "source_sentence": "「時，梵德王聞此語已，生未曾有奇特之心，作如是念：『希有此事！",
        "translation": "Having heard these words, King Brahmadeva had an unprecedented feeling of wonder and thought:",
        "source": "T03n0190_056:0911a06_0"
    },
    {
        "source_sentence": "不可思議！",
        "translation": "Inconceivable!",
        "source": "T03n0190_056:0911a07_1"
    },
    {
        "source_sentence": "人中猶尚難有此法，云何象龍乃如此也？』",
        "translation": "It's still rare among humans to have such a teaching, so why would elephants and dragons be like this?'",
        "source": "T03n0190_056:0911a07_2"
    },
    {
        "source_sentence": "作是念已，告彼象龍如是言曰：『大象龍王！",
        "translation": "After he had this thought, he addressed the elephant dragon and said, 'Great elephant king!",
        "source": "T03n0190_056:0911a08_3"
    },
    {
        "source_sentence": "我今寧自將此身命，閉於牢獄，不將如是如法之行，持戒妙行，孝養父母，",
        "translation": "I will now rather take this body and life for my own sake, imprisoned in the hells. I will not be subject to such conduct that accords with the Dharma, observes the precepts, practices virtuous behavior, and is filial to my parents",
        "source": "T03n0190_056:0911a09_4"
    },
    {
        "source_sentence": "於如此事不敢擾亂。』",
        "translation": "I wouldn't dare to disturb such things.'",
        "source": "T03n0190_056:0911a11_5"
    },
    {
        "source_sentence": "「爾時，梵德復告象龍作如是言：『汝象龍王！",
        "translation": "At that point, Brahmā again addressed the elephant dragon king and said, 'You elephant dragon king!",
        "source": "T03n0190_056:0911a12_0"
    },
    {
        "source_sentence": "我今放汝，至父母邊，共其父母，自相供養，隨意受樂。』",
        "translation": "Now, I'll let you go to the side of your parents, share their parents with them, make offerings to each other, and enjoy happiness as you wish.'",
        "source": "T03n0190_056:0911a12_1"
    },
    {
        "source_sentence": "「『汝今好去象龍王，　　供養父母當孝順，",
        "translation": "'Now, why don't you go to the elephant king and make offerings to your parents who will be obedient?",
        "source": "T03n0190_056:0911a14_2"
    },
    {
        "source_sentence": "　　我寧自捨此命根，　　於汝更不相擾亂。』",
        "translation": "I'd rather abandon this life root for myself, so that you won't be disturbed by it.'",
        "source": "T03n0190_056:0911a14_2"
    },
    {
        "source_sentence": "然梵德王放象龍時即說偈言：「爾時，梵德放彼象龍，其象龍王既得脫已，",
        "translation": "When King Brahmadeva released the elephant-nāga, however, he spoke these verses: At that moment, Brahmā Brahmadeva released the elephant-nāga.",
        "source": "T03n0190_056:0911a14_2"
    },
    {
        "source_sentence": "漸至彼林。",
        "translation": "He gradually reached the other forest.",
        "source": "T03n0190_056:0911a17_3"
    },
    {
        "source_sentence": "彼象龍母於時正以不見子故，憂愁懊惱，泣淚啼哭，兩目失明。",
        "translation": "The mother of the elephant-nāga, who hadn't seen her child at the time, was grieved and distressed, weeping and sobbing, and lost her eyesight.",
        "source": "T03n0190_056:0911a18_4"
    },
    {
        "source_sentence": "以失明故，東西馳走，從於本處，遊行他所。",
        "translation": "Because of their lack of clarity, they rushed east and west, leaving their original place and traveling to other places.",
        "source": "T03n0190_056:0911a19_5"
    },
    {
        "source_sentence": "象龍初還至彼林時，求覓其母，了不知處。",
        "translation": "When the elephant-nāga first returned to that forest, he searched for his mother and didn't know where she was.",
        "source": "T03n0190_056:0911a20_6"
    },
    {
        "source_sentence": "以不見故，放聲大喚。",
        "translation": "Because they don't see it, they make a loud noise and wail.",
        "source": "T03n0190_056:0911a21_7"
    },
    {
        "source_sentence": "於時象母，聞其叫聲，即知彼聲是其己子。",
        "translation": "When the mother of the elephant heard his screaming voice, she knew that sound was her own son.",
        "source": "T03n0190_056:0911a21_8"
    },
    {
        "source_sentence": "其母爾時，亦即放聲，叫喚悲泣。",
        "translation": "At that point, his mother also raised her voice and cried out in distress.",
        "source": "T03n0190_056:0911a22_9"
    },
    {
        "source_sentence": "彼象龍王，聞其母喚，遂爾尋聲，往至母所。",
        "translation": "When that elephant-nāga king heard his mother calling him, he sought the sound and went to her mother.",
        "source": "T03n0190_056:0911a23_10"
    },
    {
        "source_sentence": "其象龍王，既見其母，近一水池，止息而住，安置其母在於岸上。",
        "translation": "Seeing his mother, the elephant-nāga king approached a pool of water and remained there. He placed her on the shore.",
        "source": "T03n0190_056:0911a24_11"
    },
    {
        "source_sentence": "「爾時，象龍入其水池，取滿鼻水，出已歡喜，身心踊躍，遍滿其體，",
        "translation": "“At that time, the elephant-nāga entered the pond and filled it with water. Having emerged, he was delighted. His body and mind leaped for joy, filling it all over his body.",
        "source": "T03n0190_056:0911a26_0"
    },
    {
        "source_sentence": "不能自勝。",
        "translation": "They can't overcome themselves.",
        "source": "T03n0190_056:0911a27_1"
    },
    {
        "source_sentence": "至其母邊，以水散灑，而洗浴之。",
        "translation": "He went to his mother’s side, sprinkled water over her, and bathed her.",
        "source": "T03n0190_056:0911a27_2"
    },
    {
        "source_sentence": "「爾時，其母得子持水洗浴身時，眼還清淨，勝於本目。",
        "translation": "“At the time, his mother had a child who washed and bathed her body with water, whose eyes were clearer than their original ones.",
        "source": "T03n0190_056:0911a29_0"
    },
    {
        "source_sentence": "而彼象母，既見其子，而問之言：『子何處來？",
        "translation": "When the mother of the elephant saw her son, she asked him, 'Where did you come from?'",
        "source": "T03n0190_056:0911b01_1"
    },
    {
        "source_sentence": "今日始還，令我多時不得見汝。』",
        "translation": "Today, I won't be able to see you for a long time.'",
        "source": "T03n0190_056:0911b02_2"
    },
    {
        "source_sentence": "「時，彼象龍向母具說，如梵德王，遣人所搦，將向王宮，供養因緣，",
        "translation": "“Then the elephant-nāga told his mother, ‘Suppose brahmin king Brahmadeva sends something to be eaten and takes it to the palace of the king in order to honor him.",
        "source": "T03n0190_056:0911b03_0"
    },
    {
        "source_sentence": "并放得脫還歸之事，一切皆悉向其母說。",
        "translation": "They were released, liberated, and returned home, and they all told their mother.",
        "source": "T03n0190_056:0911b04_1"
    },
    {
        "source_sentence": "「爾時，象母聞此語已，歡喜踊躍，遍滿其體，不能自勝。",
        "translation": "“At that time, having heard these words, the mother of the elephant was overjoyed and jumped for joy. Filling her body all over her, she could not control herself.",
        "source": "T03n0190_056:0911b06_0"
    },
    {
        "source_sentence": "唱言：『子子，如我今日而得與汝共相養活，喜樂如是，願梵德王，共其父母妻子男女諸眷屬輩，",
        "translation": "They called out, saying: Just as today I am able to live and nourish myself together with you. Such is my joy and happiness! May the king of brahma-virtuous gods share their parents, wives, children, and other members of their retinues",
        "source": "T03n0190_056:0911b07_1"
    },
    {
        "source_sentence": "及以知親大臣百官一切輔佐，共相養活，如我今日受斯快樂。』」",
        "translation": "It's because they know their relatives, ministers, hundreds of officials, and all the assistants will support each other as if today I were to experience this happiness.'",
        "source": "T03n0190_056:0911b09_2"
    },
    {
        "source_sentence": "爾時，佛告諸比丘等作如是言：「汝諸比丘！",
        "translation": "It was then that the Buddha addressed the monks and others in this way, saying, You monks!",
        "source": "T03n0190_056:0911b11_0"
    },
    {
        "source_sentence": "若有心疑，彼象龍王，此是誰也？",
        "translation": "If there's any doubt in your mind, who is this elephant-nāga king?",
        "source": "T03n0190_056:0911b11_1"
    },
    {
        "source_sentence": "即我身是。",
        "translation": "That is, it's the self-body.",
        "source": "T03n0190_056:0911b12_2"
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_056:0911b12_3"
    },
    {
        "source_sentence": "若有心疑，彼時象母，此是誰者？",
        "translation": "If someone has a doubt in their mind, who was the mother of the elephant at the time?",
        "source": "T03n0190_056:0911b13_4"
    },
    {
        "source_sentence": "莫作異見，此即摩訶波闍波提憍曇彌是。",
        "translation": "Don't make a different view, for this is Mahāprajāpatī Gautamī.",
        "source": "T03n0190_056:0911b13_5"
    },
    {
        "source_sentence": "當於彼時，為我啼哭，悲涕流淚，受於苦惱，兩目失明，還因我故，而得清淨。",
        "translation": "At the time, he cried out in pity for me, wept with sorrow and tears, suffered pain, lost his eyesight in both directions, and regained purity because of me.",
        "source": "T03n0190_056:0911b14_6"
    },
    {
        "source_sentence": "今亦如是，摩訶波闍波提憍曇彌不見我故，悲號啼哭，憂愁苦惱，兩目失明，",
        "translation": "Because Mahāprajāpatī Kauṇḍinya did not see me, he wept and wailed in sorrow, grieved and distressed, and lost his eyesight.",
        "source": "T03n0190_056:0911b16_7"
    },
    {
        "source_sentence": "今還因我而得清淨。",
        "translation": "Now, it's because of me that they'll attain purity.",
        "source": "T03n0190_056:0911b18_8"
    },
    {
        "source_sentence": "汝諸比丘！",
        "translation": "You monks!",
        "source": "T03n0190_056:0911b18_9"
    },
    {
        "source_sentence": "如來昔在因地之時，未得成佛，尚為眾生，作是利益，況於今日，已得成就阿耨多羅三藐三菩提也。",
        "translation": "In the past, when the Tathāgata was in the causal stage, he hadn't yet become a buddha, but he did so for the benefit of sentient beings, so why wouldn't he do so today? How could he have accomplished unsur",
        "source": "T03n0190_056:0911b18_10"
    },
    {
        "source_sentence": "是故諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T03n0190_056:0911b21_11"
    },
    {
        "source_sentence": "若有智者，恒於佛所，作敬重心希有之心，於法僧邊，亦須生於敬重之心。",
        "translation": "If there are wise people, they'll always pay respect to the Buddha with veneration and a rare mind, and they must also give respect to the Dharma and Saṃgha at the side of them.",
        "source": "T03n0190_056:0911b21_12"
    },
    {
        "source_sentence": "汝等比丘！",
        "translation": "You monks!",
        "source": "T03n0190_056:0911b23_0"
    },
    {
        "source_sentence": "當如是學。」",
        "translation": "You should thus train.",
        "source": "T03n0190_056:0911b23_1"
    },
    {
        "source_sentence": "佛本行集經難陀出家因緣品第五十七上爾時，世尊教化難陀釋種之子，",
        "translation": "At the time, the Bhagavān was teaching and transforming the Śākyamunis of the Nanda family.",
        "source": "T03n0190_056:0911b24_0"
    },
    {
        "source_sentence": "捨家出家，數數為說出家因緣，亦復讚歎出家因緣，而作是言：「汝來難陀！",
        "translation": "He renounced home and left home, explained the causes and conditions for leaving home repeatedly, praised the causes and conditions for leaving home, and said, Come, Nanda!",
        "source": "T03n0190_056:0911b25_1"
    },
    {
        "source_sentence": "當就出家。」",
        "translation": "You will leave home soon.",
        "source": "T03n0190_056:0911b27_2"
    },
    {
        "source_sentence": "作是語已，釋子難陀白言：「世尊！",
        "translation": "After he said this, the Śākyamuni Nanda said, Bhagavān!",
        "source": "T03n0190_056:0911b27_3"
    },
    {
        "source_sentence": "我不出家。",
        "translation": "I won't leave home.",
        "source": "T03n0190_056:0911b28_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_056:0911b28_5"
    },
    {
        "source_sentence": "我以四事，供養世尊及比丘僧，乃至盡其一形，供養衣服臥具飲食湯藥。」",
        "translation": "With these four things, I'll make offerings to the Bhagavān and the monks, up to their single form, clothing, bedding, food, drink, bathing, and medicine.",
        "source": "T03n0190_056:0911b29_0"
    },
    {
        "source_sentence": "如是世尊第二第三，教化難陀，讚歎捨家出家功德，乃至數數說其出家因緣之事，",
        "translation": "In this way, the second and third times the World-honoured One instructs Nanda to praise the merit of renunciation by extinguishing household life and leaving home. Up to [the extent that] he repeatedly explains the causes and conditions",
        "source": "T03n0190_056:0911c01_1"
    },
    {
        "source_sentence": "及以讚歎勸其出家，而彼難陀，不肯出家，猶言求以衣服臥具飲食湯藥，",
        "translation": "He praised him and encouraged him to renounce the householder’s life, but Nanda refused to renounce the householder’s life. Instead, he simply begged [the bhikṣu] for clothing, bedding, food, drink, water",
        "source": "T03n0190_056:0911c03_2"
    },
    {
        "source_sentence": "盡形供養佛及眾僧因緣之事。",
        "translation": "They should make offerings in all their forms to the Buddha and the causes and conditions of the saṃgha.",
        "source": "T03n0190_056:0911c05_3"
    },
    {
        "source_sentence": "爾時，世尊經於少時，飯食訖已，將一侍者，徐徐向彼釋種童子難陀之家。",
        "translation": "It was then that the Bhagavān, after he had finished his meal for a short time, took an attendant and slowly headed toward the house of Nanda, the boy of the Śākyas.",
        "source": "T03n0190_056:0911c06_0"
    },
    {
        "source_sentence": "然彼釋種童子難陀，當於彼時，在重閣上，共孫陀利，昇樓觀看，遊遨而坐。",
        "translation": "At that time, however, Nanda, the boy of the Śākya clan, was staying in a heavy pavilion. He and Sundarī climbed up into the tower to look around, roamed about, and sat there.",
        "source": "T03n0190_056:0911c07_1"
    },
    {
        "source_sentence": "爾時，難陀在樓閣上，遙見世尊，將至其所，速即驚起下於重閣，往至佛邊，",
        "translation": "At that time Nanda was in the tower. Seeing the World-honored One approaching him from a distance, he quickly got up in fear and came down from the storeyed pavilion toward the Buddha’s side.",
        "source": "T03n0190_056:0911c09_2"
    },
    {
        "source_sentence": "頂禮佛足，却立一面。",
        "translation": "He bowed his head at the Buddha’s feet and withdrew to one side.",
        "source": "T03n0190_056:0911c11_3"
    },
    {
        "source_sentence": "因白佛言：「善來世尊！",
        "translation": "He then said to the Buddha, Good, Bhagavān!",
        "source": "T03n0190_056:0911c11_4"
    },
    {
        "source_sentence": "何從遠至？",
        "translation": "How did it come from a great distance?",
        "source": "T03n0190_056:0911c12_5"
    },
    {
        "source_sentence": "唯願垂神，入我堂室，昇座而坐。」",
        "translation": "Please, goddess, please enter my room, ascend to your seat, and sit down.",
        "source": "T03n0190_056:0911c12_6"
    },
    {
        "source_sentence": "爾時，世尊入彼堂室，昇座坐已，慰喻難陀，慰喻已訖，默然而坐。",
        "translation": "At that time, the World-honored One entered the hall. Having ascended his seat and sat down, he comforted Nanda. After having comforted him, [the Buddha] remained silent and took his seat.",
        "source": "T03n0190_056:0911c14_0"
    },
    {
        "source_sentence": "爾時，難陀白佛言：「世尊！",
        "translation": "It was then that Nanda said to the Buddha, Bhagavān!",
        "source": "T03n0190_056:0911c16_0"
    },
    {
        "source_sentence": "唯願今者於此受供，我遣備辦餚饍飲食。」",
        "translation": "Please let me now accept the offering here, and I'll send provisions for food and drink.",
        "source": "T03n0190_056:0911c16_1"
    },
    {
        "source_sentence": "佛告難陀：「我已食訖，不須備辦。」",
        "translation": "The Buddha told Nanda, I've finished eating, so I don't need to prepare it.",
        "source": "T03n0190_056:0911c17_2"
    },
    {
        "source_sentence": "爾時，釋種童子難陀復白佛言：「今有蜜漿，非時飲不？」",
        "translation": "It was then that the Śākyamuni boy Nanda again said to the Buddha, Now there's honey and juice, isn't it time to drink it?",
        "source": "T03n0190_056:0911c19_0"
    },
    {
        "source_sentence": "佛告難陀：「我隨汝意。」",
        "translation": "The Buddha told Nanda, I'll follow your wishes.",
        "source": "T03n0190_056:0911c20_1"
    },
    {
        "source_sentence": "爾時難陀復白佛言：「唯然世尊！」",
        "translation": "It was then that Nanda again said to the Buddha, Yes, Bhagavān!",
        "source": "T03n0190_056:0911c20_2"
    },
    {
        "source_sentence": "於是難陀執持佛鉢，盛非時漿，奉與世尊。",
        "translation": "Nanda then took the Buddha's bowl, filled it with unseasonable milk, and presented it to the Bhagavān.",
        "source": "T03n0190_056:0911c21_3"
    },
    {
        "source_sentence": "於時，世尊未為受取。",
        "translation": "At the time, the Bhagavān didn't accept it.",
        "source": "T03n0190_056:0911c22_4"
    },
    {
        "source_sentence": "爾時，釋種童子難陀，即持彼鉢，將與侍者，而彼侍者，復不受取。",
        "translation": "It was then that the boy of the Śākya clan, Nanda, took his bowl and gave it to the attendant, who again didn't accept it.",
        "source": "T03n0190_056:0911c23_0"
    },
    {
        "source_sentence": "爾時，世尊從座而起，與諸侍從相逐而還，欲向本處，其釋童子，亦從重閣，",
        "translation": "At that time, the World-honored One rose from his seat, proceeded in company with his attendants, and departed. Wishing to return home, the young brahmin Śāriputra also came out of the storeyed pavilion:",
        "source": "T03n0190_056:0911c25_0"
    },
    {
        "source_sentence": "持彼蜜漿，欲隨佛去。",
        "translation": "He took that sweet wine and wanted to go with the Buddha.",
        "source": "T03n0190_056:0911c26_1"
    },
    {
        "source_sentence": "爾時，釋種女孫陀利，見釋難陀執其滿鉢非時蜜漿從世尊行，其孫陀利，",
        "translation": "At that time, the daughter of the Buddha’s disciple Sunaudgalyāyana saw Śāriputra carrying a bowl full of uncooked honey and juice from the World-honored One.",
        "source": "T03n0190_056:0911c28_0"
    },
    {
        "source_sentence": "梳頭未訖，便即高聲喚難陀言：「聖子難陀！",
        "translation": "Before he finished combing his hair, he called out to Nanda in a loud voice and said, Noble son, Nanda!",
        "source": "T03n0190_056:0911c29_1"
    },
    {
        "source_sentence": "欲何去也？」",
        "translation": "Where do you want to go?",
        "source": "T03n0190_056:0912a01_2"
    },
    {
        "source_sentence": "爾時，難陀指彼鉢言：「欲將此鉢奉送如來，至彼即還。」",
        "translation": "It was then that Nanda pointed to the bowl and said, I want to present this bowl to the Tathāgata, so I'll return when I reach him.",
        "source": "T03n0190_056:0912a01_3"
    },
    {
        "source_sentence": "孫陀利言：「聖子速來！",
        "translation": "Sundatta said, Come quickly, noble son!",
        "source": "T03n0190_056:0912a03_0"
    },
    {
        "source_sentence": "莫久住彼。」",
        "translation": "Don't stay there for a long time.",
        "source": "T03n0190_056:0912a03_1"
    },
    {
        "source_sentence": "爾時，世尊出難陀家，為難陀故，步行東西，在於街巷，欲令城內一切人民，",
        "translation": "At that time, the World-honored One came out of Nanda’s house. For [the sake of] Nanda’s sake, he walked east and west on foot through the streets in order to enable all the citizens within the city to live",
        "source": "T03n0190_056:0912a04_0"
    },
    {
        "source_sentence": "見彼難陀執非時漿隨逐於佛。",
        "translation": "Seeing that Nanda, he clings to the Buddha's untimely juice and follows him.",
        "source": "T03n0190_056:0912a05_1"
    },
    {
        "source_sentence": "是時人民，見此事已，各相謂言：「今者世尊，必令難陀捨家出家。」",
        "translation": "After seeing this, the people said to each other, Now, Bhagavān, you must cause Nanda to leave home and leave home.",
        "source": "T03n0190_056:0912a06_2"
    },
    {
        "source_sentence": "爾時，世尊至僧伽藍，喚一比丘，密以手指，作其相貌，令取難陀手中蜜鉢。",
        "translation": "At the time, the Bhagavān went to the saṃghârāma and summoned a monk who secretly made his appearance with his fingers and asked him to take the bowl of honey in Nanda's hand.",
        "source": "T03n0190_056:0912a08_0"
    },
    {
        "source_sentence": "時，彼比丘知解佛意，從難陀邊，即取其鉢。",
        "translation": "Knowing and understanding what the Buddha wanted, that monk went from the side of Nanda and took his bowl.",
        "source": "T03n0190_056:0912a09_1"
    },
    {
        "source_sentence": "爾時，難陀頂禮佛足，白言：「世尊！",
        "translation": "It was then that Nanda bowed his head at the Buddha's feet and said, Bhagavān!",
        "source": "T03n0190_056:0912a11_0"
    },
    {
        "source_sentence": "我今辭佛，欲還向家。」",
        "translation": "Now, I'll leave the Buddha and want to return home.",
        "source": "T03n0190_056:0912a11_1"
    },
    {
        "source_sentence": "佛告難陀：「汝莫還去！」",
        "translation": "The Buddha told Nanda, Don't go back!",
        "source": "T03n0190_056:0912a12_2"
    },
    {
        "source_sentence": "爾時，難陀復白佛言：「世尊！",
        "translation": "It was then that Nanda again said to the Buddha, Bhagavān!",
        "source": "T03n0190_056:0912a12_3"
    },
    {
        "source_sentence": "我今思惟，不欲出家。",
        "translation": "I now think, ‘I do not wish to renounce household life.",
        "source": "T03n0190_056:0912a13_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0190_056:0912a13_5"
    },
    {
        "source_sentence": "我欲四事，盡其一形，供養如來及眾僧故。」",
        "translation": "I want four things, all in one form, to make offerings to the Tathāgata and the saṃgha.",
        "source": "T03n0190_056:0912a14_0"
    },
    {
        "source_sentence": "爾時，世尊復告難陀作如是言：「此閻浮提世界，縱廣七千由旬，北面廣闊，",
        "translation": "It was then that the World-honored One again addressed Nanda and said: This world Jambudvipa is seven thousand yojanas long and wide in both directions.",
        "source": "T03n0190_056:0912a15_0"
    },
    {
        "source_sentence": "南面狹小，猶如車箱，滿中羅漢，稠若甘蔗竹葦麻稻。",
        "translation": "The southern side is narrow and small, like a carriage box filled with arhats, as dense as sugarcane, bamboo, reeds, hemp, and rice.",
        "source": "T03n0190_056:0912a16_1"
    },
    {
        "source_sentence": "若有善男子善女人，供養彼等諸阿羅漢，盡其一形，四事不闕。",
        "translation": "If there are good men and good women who make offerings to those arhats, they'll have all one form without missing any of the four things.",
        "source": "T03n0190_056:0912a17_2"
    },
    {
        "source_sentence": "彼等羅漢入涅槃後，復更供養，起舍利塔。",
        "translation": "After they entered nirvana, those arhats again made offerings and built a stūpa of relics.",
        "source": "T03n0190_056:0912a19_3"
    },
    {
        "source_sentence": "於其塔上，各施幡蓋，及寶鈴幢，復以香華，及諸油燈，種種供養。",
        "translation": "On the top of each stupa, they offered banners, canopies, jeweled bells, banners, incense, flowers, oil lamps, and various offerings.",
        "source": "T03n0190_056:0912a20_4"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T03n0190_056:0912a21_5"
    },
    {
        "source_sentence": "是善男子善女人等，功德多不？」",
        "translation": "Are these good men and good women of great merit?",
        "source": "T03n0190_056:0912a21_6"
    },
    {
        "source_sentence": "難陀白言：「得福甚多。」",
        "translation": "Nanda said, They'll attain a lot of merit.",
        "source": "T03n0190_056:0912a22_7"
    },
    {
        "source_sentence": "爾時，世尊復告難陀：「若有羅漢，滿此閻浮，有人盡形，四事供養，",
        "translation": "At that time the World-honored One again said to Nanda: Suppose there is an arhat who fills Jambudvfpa. Someone, having exhausted his physical form, makes offerings in four ways:",
        "source": "T03n0190_056:0912a24_0"
    },
    {
        "source_sentence": "乃至香華，然諸油燈。",
        "translation": "It's even fragrant, but it's like oil lamps.",
        "source": "T03n0190_056:0912a25_1"
    },
    {
        "source_sentence": "若復有人，供養一佛功德果報，倍勝於彼。",
        "translation": "If another person were to make offerings to a single buddha, the reward for merit would be twice as great as theirs.",
        "source": "T03n0190_056:0912a25_2"
    },
    {
        "source_sentence": "「復次，難陀！",
        "translation": "Furthermore, Nanda!",
        "source": "T03n0190_056:0912a27_0"
    },
    {
        "source_sentence": "若人能入佛法教中，乃至出家，一日一夜，行於清淨梵行之法，此之果報，",
        "translation": "If a person can enter the teaching of the Buddha’s Dharma and leave home, for one day and night they practice the pure religious path. This is their retribution.",
        "source": "T03n0190_056:0912a27_1"
    },
    {
        "source_sentence": "倍多於彼。",
        "translation": "It's twice as great as that.",
        "source": "T03n0190_056:0912a28_2"
    },
    {
        "source_sentence": "是故難陀！",
        "translation": "Therefore, Nanda!",
        "source": "T03n0190_056:0912a29_3"
    },
    {
        "source_sentence": "必定出家，莫復貪受五欲樂也。",
        "translation": "They must leave home and no longer crave the pleasures of the five desires.",
        "source": "T03n0190_056:0912a29_4"
    },
    {
        "source_sentence": "「復次，難陀！",
        "translation": "Furthermore, Nanda!",
        "source": "T03n0190_056:0912b02_0"
    },
    {
        "source_sentence": "諸欲少味，多有苦患，諸欲無常，是可厭離，是大苦本，是大瘡疣，是大惡刺，",
        "translation": "Desire has few flavors, is often painful, and the desires are impermanent. This is to be abstained from. This is the root of great suffering. This is a serious sores and warts.",
        "source": "T03n0190_056:0912b02_1"
    },
    {
        "source_sentence": "是大厄縛，是大苦惱，是損減相，是破壞相，無常不住，無時暫停，是不牢固，",
        "translation": "This is the characteristic of great misfortune. This is the characteristic of great pain and suffering. This is the characteristic of loss and gain. This is the characteristic of diminution. This is the characteristic of disintegration. It is impermanent",
        "source": "T03n0190_056:0912b03_2"
    },
    {
        "source_sentence": "危脆易壞，多有怖畏，苦空無我，汝今必當諦觀諸欲如是過患。",
        "translation": "They are perilous, fragile, easy to break down, and often fearful. Suffering is emptiness without self. You must now carefully examine the faults of desire in this way.",
        "source": "T03n0190_056:0912b05_3"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T03n0190_056:0912b07_4"
    },
    {
        "source_sentence": "汝今應善思惟五欲過患，莫貪著也。」",
        "translation": "Now, you should well contemplate the five faults of desire and not cling to them.",
        "source": "T03n0190_056:0912b07_5"
    },
    {
        "source_sentence": "爾時，世尊雖向難陀說此過患，然其難陀，心故不欲願樂出家，但敬佛故，",
        "translation": "At that time, although the World-honored One had exhorted Nanda on these faults and distress, [the Buddha] did not wish to renounce the householder’s life because of his desire for renunciation but rather out of respect for the Buddha.",
        "source": "T03n0190_056:0912b09_0"
    },
    {
        "source_sentence": "低佪俛仰，白言：「世尊！",
        "translation": "He looked down and said, Bhagavān!",
        "source": "T03n0190_056:0912b10_1"
    },
    {
        "source_sentence": "我當出家。」",
        "translation": "I will leave home.",
        "source": "T03n0190_056:0912b11_2"
    },
    {
        "source_sentence": "爾時，世尊且因經行，以指作相，招一比丘，來語之言：「汝當喚一剃髮師來。」",
        "translation": "It was then that the Bhagavān took his fingers and drew a monk to him, saying, You must summon a shaver to come.",
        "source": "T03n0190_056:0912b12_0"
    },
    {
        "source_sentence": "時彼比丘，即喚眾中一剃髮師，在難陀前，手執剃刀，欲為難陀剃其鬚髮。",
        "translation": "That monk then summoned one of the shavers in the congregation, held a shaving sword in his hand in front of Nanda, and wanted to shave his hair for him.",
        "source": "T03n0190_056:0912b13_1"
    },
    {
        "source_sentence": "爾時，難陀，捉拳向彼剃除髮師，作如是言：「汝今何力敢剃我頭？」",
        "translation": "It was then that Nanda grabbed his fist and faced the master who shaved it, saying, How dare you shave my head now?",
        "source": "T03n0190_056:0912b15_2"
    },
    {
        "source_sentence": "爾時，世尊正念正意，告難陀言：「來汝比丘！",
        "translation": "At the time, the Bhagavān was correctly mindful of his right intention and addressed Nanda, saying, Come, monk!",
        "source": "T03n0190_056:0912b17_0"
    },
    {
        "source_sentence": "入我法中，行於梵行，盡諸苦故。」",
        "translation": "Entering into my teaching, I'll practice the religious practice and end all suffering.",
        "source": "T03n0190_056:0912b17_1"
    },
    {
        "source_sentence": "爾時，如來作是語已，難陀鬚髮，即自墮落，猶如比丘。",
        "translation": "After the Tathāgata spoke these words, Nanda's hair fell down on its own like a monk.",
        "source": "T03n0190_056:0912b18_2"
    },
    {
        "source_sentence": "剃其鬚髮，始經七日，自然體著袈裟色衣，手執鉢盂如法之器，而彼長老，",
        "translation": "For seven days after shaving his hair and beard, he naturally wore the colorful robes of a monk’s robe. He held a bowl in his hand that was according to the rules.",
        "source": "T03n0190_056:0912b19_3"
    },
    {
        "source_sentence": "即成出家，受具足戒。",
        "translation": "He then became a renunciant and received the full set of precepts.",
        "source": "T03n0190_056:0912b21_4"
    },
    {
        "source_sentence": "於時難陀，可喜端正，諸人樂觀，有三十相，具足不闕，身體金色，高下四指，",
        "translation": "At that time Nanda was delighted with his good appearance. All the people enjoyed observing him. He had thirty distinctive marks, all endowed without fail. His body was golden-colored, four inches high and five inches long.",
        "source": "T03n0190_056:0912b21_5"
    },
    {
        "source_sentence": "不及如來，所作袈裟，與佛衣服，等無有異。",
        "translation": "It was no different from the reddish-brown robe made by the Tathāgata, which resembled the Buddha’s robe and looked the same as his.",
        "source": "T03n0190_056:0912b23_6"
    },
    {
        "source_sentence": "作已受持，或諸比丘，遙見來者，皆謂難陀即是世尊，欲起迎逆，及至知非，",
        "translation": "Having done so, he receives and upholds it. Some monks who see him from a distance say that Nanda is the World-honored One, wishing to rise in order to greet [the Buddha] but do not know whether this is the case",
        "source": "T03n0190_056:0912b24_7"
    },
    {
        "source_sentence": "始還本座。",
        "translation": "He then returned to his seat.",
        "source": "T03n0190_056:0912b26_8"
    },
    {
        "source_sentence": "以此因緣，而諸比丘，嫌恨籌量，而作是言：「長老難陀，云何與佛衣服一等，",
        "translation": "Because of this causality, the monks resented it and said, “Elder Nanda, how can you give me the same amount of cloth as the Buddha’s?",
        "source": "T03n0190_056:0912b26_9"
    },
    {
        "source_sentence": "而用受持？」",
        "translation": "Why do you use it to receive and uphold it?",
        "source": "T03n0190_056:0912b28_10"
    },
    {
        "source_sentence": "時，諸比丘即往白佛。",
        "translation": "The monks then went to the Buddha and told him.",
        "source": "T03n0190_056:0912b28_11"
    },
    {
        "source_sentence": "爾時，世尊以此因緣，尋時聚集諸比丘眾，問難陀言：「汝作衣服僧伽梨等，",
        "translation": "It was then that the World-honored One, on account of this causality, assembled the assembly of monks and asked Nanda:",
        "source": "T03n0190_056:0912b29_0"
    },
    {
        "source_sentence": "與佛同量，而受持不？」",
        "translation": "Is it the same as the Buddha's, but accepted and maintained?",
        "source": "T03n0190_056:0912c01_1"
    },
    {
        "source_sentence": "爾時，難陀白言：「世尊！",
        "translation": "It was then that Nanda said, Bhagavān!",
        "source": "T03n0190_056:0912c03_0"
    },
    {
        "source_sentence": "此事實然。」",
        "translation": "This is true.",
        "source": "T03n0190_056:0912c03_1"
    },
    {
        "source_sentence": "佛言難陀：「此不如法。",
        "translation": "The Buddha said to Nanda, This is not according to the teaching.",
        "source": "T03n0190_056:0912c03_2"
    },
    {
        "source_sentence": "汝今云何與佛世尊，同量受持僧伽梨也？」",
        "translation": "How are you now the same as the Bhagavān, the Buddha, who accepts and upholds the saṃghāṭī?",
        "source": "T03n0190_056:0912c04_3"
    },
    {
        "source_sentence": "爾時，世尊訶責難陀，教如是已，告諸比丘：「從今日後，悉皆不得依世尊量作諸衣服而受持也；",
        "translation": "After the World-honored One had reprimanded Nanda and instructed him to do so, he said to the monks: From this day forth, you should not accept or hold any of these robes that have been made according to the measurements of the",
        "source": "T03n0190_056:0912c06_0"
    },
    {
        "source_sentence": "若有違者，如法治罪。」",
        "translation": "If someone disobeys them, they'll be punished according to the rules.",
        "source": "T03n0190_056:0912c08_1"
    },
    {
        "source_sentence": "爾時，難陀作如是念：「世尊已斷，不復更聽依世尊量受持衣服，今所作衣，",
        "translation": "It was then that Nanda had this thought, “The World-honored One has cut off his hair. He will no longer allow me to accept and carry the garments of the World-honored One’s clothing according to their dimensions.",
        "source": "T03n0190_056:0912c09_0"
    },
    {
        "source_sentence": "必須治打出其光澤而受持也。」",
        "translation": "They must be purified, produced, and maintained by their radiance.",
        "source": "T03n0190_056:0912c10_1"
    },
    {
        "source_sentence": "爾時，難陀尋即作彼打治之衣光澤而服，執持鉢器，眼塗媚藥，莊嚴其身，",
        "translation": "At that time, Nanda sought to dress himself in the shining and lustrous clothes he had worn for his overpowering assault. He took them, held an almsbowl in his hand, applied scented medicine to his eyes, and ador",
        "source": "T03n0190_056:0912c12_0"
    },
    {
        "source_sentence": "脚著革屣，左手執傘，右手持鉢，詣向佛所白言：「世尊！",
        "translation": "He put his feet on leather sandals, held an umbrella in his left hand and a bowl in his right hand, went to the Buddha and said, Bhagavān!",
        "source": "T03n0190_056:0912c13_1"
    },
    {
        "source_sentence": "我欲往入聚落乞食。」",
        "translation": "I want to go and enter a village to solicit alms.",
        "source": "T03n0190_056:0912c14_2"
    },
    {
        "source_sentence": "爾時，佛告長老難陀作如是言：「汝今豈非善男子也？",
        "translation": "It was then that the Buddha addressed the elder Nanda and said, Are you not a good man now?",
        "source": "T03n0190_056:0912c15_3"
    },
    {
        "source_sentence": "信心捨家而出家乎？」",
        "translation": "Have you abandoned home with faith and left home?",
        "source": "T03n0190_056:0912c16_4"
    },
    {
        "source_sentence": "難陀答言：「如是世尊！",
        "translation": "Nanda replied, So it is, Bhagavān!",
        "source": "T03n0190_056:0912c16_5"
    },
    {
        "source_sentence": "事實然也。」",
        "translation": "It's true.",
        "source": "T03n0190_056:0912c17_6"
    },
    {
        "source_sentence": "爾時，世尊復告難陀作如是言：「汝既信心之善男子，捨家出家，所持衣服，",
        "translation": "At that time, the World-honored One again addressed Nanda in this way: You faithful son of a virtuous family, renounce household life and leave home.",
        "source": "T03n0190_056:0912c18_0"
    },
    {
        "source_sentence": "何故打治令出光澤？",
        "translation": "Why is it healed and made to emit a shining luster?",
        "source": "T03n0190_056:0912c19_1"
    },
    {
        "source_sentence": "復以何緣，莊嚴身體，眼塗媚藥，脚著革屣，一手執傘，一手持鉢，欲乞食也？",
        "translation": "Again, what is the reason they adorn their bodies? Their eyes are coated with scented medicine and their feet covered with leather sandals. They hold an umbrella in one hand and a bowl in another to beg for food.",
        "source": "T03n0190_056:0912c20_2"
    },
    {
        "source_sentence": "「復次，難陀！",
        "translation": "Furthermore, Nanda!",
        "source": "T03n0190_056:0912c22_0"
    },
    {
        "source_sentence": "汝若在於阿蘭若處，乞食活命，著糞掃衣，此乃為善。」",
        "translation": "If you're in a forest dwelling place, begging for food to live and putting on rags and sweeping clothes, this would be good.",
        "source": "T03n0190_056:0912c22_1"
    },
    {
        "source_sentence": "「何時當得見難陀，　　住於空閑常乞食，",
        "translation": "“When will you be able to see Nanda, who lives in an empty place and always begs for food?",
        "source": "T03n0190_056:0912c24_0"
    },
    {
        "source_sentence": "　少欲知足捨遺餘，　　又樂遠離諸欲想。」",
        "translation": "Being satisfied with few desires, he abandons the remaining and delights in being free of thoughts of desire.",
        "source": "T03n0190_056:0912c24_0"
    },
    {
        "source_sentence": "爾時，世尊以此因緣，而說偈言：爾時，世尊以此因緣，以此事相，集諸比丘而告之言：「諸比丘輩！",
        "translation": "At that point, the Bhagavān spoke these verses for this reason: At that point, the Bhagavān gathered the monks together for this reason and addressed them, saying:",
        "source": "T03n0190_056:0912c24_0"
    },
    {
        "source_sentence": "從今日後，不得復著打出光衣；",
        "translation": "From this day forth, they will no longer wear the robe that emits light.",
        "source": "T03n0190_056:0912c28_1"
    },
    {
        "source_sentence": "若有受持出光衣者，如法治罪。",
        "translation": "If someone receives and holds a robe of emanating light, they'll be punished according to the rules for crimes.",
        "source": "T03n0190_056:0912c29_2"
    },
    {
        "source_sentence": "「亦復不得眼塗媚藥，及妙革屣，亦復不得執輕妙鉢。",
        "translation": "Again, they won't be allowed to rub their eyes with scented medicines or marvelous leather sandals, nor will they be allowed to carry a light and marvelous bowl.",
        "source": "T03n0190_056:0913a01_0"
    },
    {
        "source_sentence": "「亦復不得執傘入城聚落乞食；",
        "translation": "Again, the enlightening beings should not take umbrellas and go into cities, towns, or villages to solicit alms.",
        "source": "T03n0190_056:0913a03_0"
    },
    {
        "source_sentence": "若如是者，悉如法治。」",
        "translation": "If they do so, they'll all follow the rules of the Dharma.",
        "source": "T03n0190_056:0913a03_1"
    },
    {
        "source_sentence": "爾時，難陀雖被世尊斷此打治光澤之衣，并及不得眼塗媚藥，斷好革屣，",
        "translation": "It was then that Nanda, although the Bhagavān had cut off his shiny, lustrous robes for beating the World-honored One, didn't obtain eye polish or beauty remedy, and cut off his good leather sandals.",
        "source": "T03n0190_056:0913a05_0"
    },
    {
        "source_sentence": "并持輕鉢，及以傘蓋，猶尚憶念王之勢樂，不肯依斷。",
        "translation": "They carried a light bowl and an umbrella, but they still remembered the king’s delightfulness and were unwilling to rely on it.",
        "source": "T03n0190_056:0913a06_1"
    },
    {
        "source_sentence": "還憶彼女釋孫陀利，念其色欲，不行梵行，欲捨其戒，還本家宅。",
        "translation": "Again, he remembered the name of that woman, Sunaudrāyana, who was mindful of her sexual desires and not engaged in religious practice. Wishing to renounce those precepts, she returned home.",
        "source": "T03n0190_056:0913a07_2"
    },
    {
        "source_sentence": "以是因緣恒畫彼女孫陀利像，後於一時至阿蘭若空閑之處，或取塼瓦，",
        "translation": "Because of these causes and conditions, he always painted the portrait of that woman Suntory. Some time later he went to an uninhabited place in Araṇya or took a piece of coarse tile.",
        "source": "T03n0190_056:0913a09_3"
    },
    {
        "source_sentence": "或取木板，畫此釋女孫陀利像，如是觀看，便過一日。",
        "translation": "Or he might take a wooden board and paint the statue of this Śākya maiden Sun Dali, and it would be more than one day for him to look around like this.",
        "source": "T03n0190_056:0913a10_4"
    },
    {
        "source_sentence": "而諸比丘，其有見者，心生嫌恨，而相謂言：「長老難陀！",
        "translation": "Those monks who saw it became angry and said to each other, Elder Nanda!",
        "source": "T03n0190_056:0913a12_5"
    },
    {
        "source_sentence": "云何在於阿蘭若處，或取塼瓦，或取木板，畫婦女形，竟日觀看？」",
        "translation": "How is it possible to take a brick tile or wooden board at the place where you're staying in Araṇya, paint the shape of a woman, and look around all day long?",
        "source": "T03n0190_056:0913a13_6"
    },
    {
        "source_sentence": "時，諸比丘即將此事，往至白佛。",
        "translation": "The monks then asked the Buddha about this matter and went to him.",
        "source": "T03n0190_056:0913a15_0"
    },
    {
        "source_sentence": "爾時，世尊以此因緣，集諸比丘，在於眾內，問難陀言：「汝實在於阿蘭若處，",
        "translation": "It was then that the World-honored One, on account of this causality, assembled the monks. He remained within the assembly and asked Nanda:",
        "source": "T03n0190_056:0913a15_1"
    },
    {
        "source_sentence": "或取塼瓦，或取木板，畫婦女形，竟日看不？」",
        "translation": "Or take a brick tile or wooden board and paint the shape of a woman, will you see it all day long?",
        "source": "T03n0190_056:0913a17_2"
    },
    {
        "source_sentence": "難陀白佛：「實爾。",
        "translation": "Nanda said to the Buddha, Indeed so.",
        "source": "T03n0190_056:0913a18_3"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T03n0190_056:0913a18_4"
    },
    {
        "source_sentence": "爾時，佛告長老難陀作如是言：「汝為此事，是不善也。",
        "translation": "It was then that the Buddha addressed the elder Nanda and said, This is an unwholesome thing for you.",
        "source": "T03n0190_056:0913a19_0"
    },
    {
        "source_sentence": "出家比丘，豈得畫其婦女形像而觀看乎？」",
        "translation": "How could a renunciant monk paint the image of that woman and look at it?",
        "source": "T03n0190_056:0913a20_1"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘，作如是言：「汝諸比丘！",
        "translation": "It was then that the Bhagavān addressed the monks and said, You monks!",
        "source": "T03n0190_056:0913a22_0"
    },
    {
        "source_sentence": "從今不得畫婦女形，若實若虛，以著欲心，畫已觀看，若有如是故畫看者，",
        "translation": "From now on, you must not paint a woman’s form, whether real or unreal, with the mind attached to sensual desire. Having painted it, you should look at it. If there is such an old painting, show it to those who see it.",
        "source": "T03n0190_056:0913a22_1"
    },
    {
        "source_sentence": "得違戒罪。」",
        "translation": "They'll be guilty of violating the precepts.",
        "source": "T03n0190_056:0913a24_2"
    },
    {
        "source_sentence": "又於一時，長老難陀次第當直守護寺舍，彼時難陀，作如是念：「如來不久，",
        "translation": "Again, on another occasion, the elder Nanda was about to guard the monastery buildings in an orderly fashion.",
        "source": "T03n0190_056:0913a25_0"
    },
    {
        "source_sentence": "當入聚落乞食之時，我於今日，當得還家。」",
        "translation": "When you enter a village to solicit alms, today I'll be able to return home.",
        "source": "T03n0190_056:0913a26_1"
    },
    {
        "source_sentence": "爾時，世尊知彼難陀作是思惟，知已告言長老難陀：「汝若欲行，閉諸房門，",
        "translation": "Knowing this thought, the World-honored One knew Nanda’s thoughts and after knowing it, he said to the venerable Elder Nanda:",
        "source": "T03n0190_056:0913a28_0"
    },
    {
        "source_sentence": "然後還去。」",
        "translation": "After that, I'll go back.",
        "source": "T03n0190_056:0913a29_1"
    },
    {
        "source_sentence": "爾時，世尊作是語已，便即往入聚落乞食。",
        "translation": "After he said these words, the Bhagavān then went into a village to solicit alms.",
        "source": "T03n0190_056:0913b01_0"
    },
    {
        "source_sentence": "長老難陀，作如是念：「世尊已入聚落乞食，我今當得還其家內。」",
        "translation": "The elder Nanda thought, Bhagavān, the Bhagavān has entered a village to solicit alms, and now I'll be able to return home.",
        "source": "T03n0190_056:0913b01_1"
    },
    {
        "source_sentence": "爾時，難陀遂見世尊房門不閉，作如是念：「我閉此門，然後還去。」",
        "translation": "Seeing the Bhagavān's room door not closed, Nanda then had this thought, I close this door and go back.",
        "source": "T03n0190_056:0913b04_0"
    },
    {
        "source_sentence": "即閉彼門，見舍利弗房門復開，即復往閉舍利弗門。",
        "translation": "He then closed that door and saw that the door of Śāriputra's room opened again, and he went back and closed the door for Śāriputra.",
        "source": "T03n0190_056:0913b06_0"
    },
    {
        "source_sentence": "既閉彼門，其目揵連房門復開，尋即閉彼目連房門。",
        "translation": "When he closed that door, the door of Maudgalyāyana's room opened again, and when he did so, he closed the door of his room.",
        "source": "T03n0190_056:0913b08_0"
    },
    {
        "source_sentence": "既閉彼門，見大迦葉房門復開，尋即往閉大迦葉門。",
        "translation": "When he closed that door, he saw the door of Mahākāśyapa's room open again and then went to close the door of Mahākāśyapa's door.",
        "source": "T03n0190_056:0913b10_0"
    },
    {
        "source_sentence": "既閉彼門，復見摩訶迦旃延房，其門復開，尋復往閉迦旃延門。",
        "translation": "He closed the door and saw Mahākātyāyana's room. The door opened again, and he went back and closed the gate of Kātyāyana.",
        "source": "T03n0190_056:0913b12_0"
    },
    {
        "source_sentence": "既閉彼門，又見優樓頻螺迦葉房門復開，尋即往閉優樓頻蠡迦葉房門。",
        "translation": "When he closed that door, he saw the door of Uruvilvā-Kāśyapa's room again open, and he went to close the door of Uruvilvā-Kāśyapa's room.",
        "source": "T03n0190_056:0913b14_0"
    },
    {
        "source_sentence": "既閉彼已，那提迦葉房門復開，尋復往閉那提房門。",
        "translation": "After shutting them off, the door of Nādikāśyapa's room opened again and closed the door of Nādi's room.",
        "source": "T03n0190_056:0913b15_1"
    },
    {
        "source_sentence": "既閉彼已，伽耶迦葉房門復開。",
        "translation": "After he closed them, the door of Kāya Kāśyapa's room opened again.",
        "source": "T03n0190_056:0913b17_0"
    },
    {
        "source_sentence": "爾時，難陀尋復閉彼伽耶房門。",
        "translation": "At the time, Nanda then again closed the door of that Gayā's room.",
        "source": "T03n0190_056:0913b17_1"
    },
    {
        "source_sentence": "既閉彼已，優波斯那房門復開。",
        "translation": "After shutting them off, the door of Upāsena's room opened again.",
        "source": "T03n0190_056:0913b19_0"
    },
    {
        "source_sentence": "閉彼門已，見俱郗羅房門復開。",
        "translation": "After closing that door, he saw the door of the Kuśinagara's room open again.",
        "source": "T03n0190_056:0913b19_1"
    },
    {
        "source_sentence": "既閉彼已，復見摩訶專陀門開。",
        "translation": "After closing it, he saw the Mahākauṣṭhila's door open again.",
        "source": "T03n0190_056:0913b21_0"
    },
    {
        "source_sentence": "閉彼門已，見利婆多房門復開。",
        "translation": "After closing that door, he saw the door of Revata's room open again.",
        "source": "T03n0190_056:0913b21_1"
    },
    {
        "source_sentence": "閉彼門已，見優波離波多房門復開。",
        "translation": "After closing that door, he saw Upāliputra's room door open again.",
        "source": "T03n0190_056:0913b22_2"
    },
    {
        "source_sentence": "如是次第，閉一門已，第二門開，閉第三已，第四門開，彼見其門一開一閉，",
        "translation": "In this order, after having closed one door, the second door opens; after having closed the third door, the fourth door opens.",
        "source": "T03n0190_056:0913b24_0"
    },
    {
        "source_sentence": "遂作是念：「彼諸比丘，當能捉我作何事過，若開若閉？",
        "translation": "He then thought, What's wrong with those monks who will be able to catch me and make me open or close it?",
        "source": "T03n0190_056:0913b25_1"
    },
    {
        "source_sentence": "我當還去，將恐世尊不久來至。」",
        "translation": "I will return and leave, for fear that the Bhagavān won't come soon.",
        "source": "T03n0190_056:0913b26_2"
    },
    {
        "source_sentence": "作是念已，從尼俱陀樹林之內，將欲出時，世尊尋以天眼，觀彼難陀，",
        "translation": "Having thought thus, the World-honored One emerged from the forest of nyagrodha. As he was about to leave that forest, the World-honored One looked at Nanda with his divine eye and saw him:",
        "source": "T03n0190_056:0913b27_3"
    },
    {
        "source_sentence": "已見難陀將欲出其尼俱陀處。",
        "translation": "He had already seen that Nanda was about to leave his place of Nirgrantha.",
        "source": "T03n0190_056:0913b29_4"
    },
    {
        "source_sentence": "如來見已，從迦毘羅婆蘇都城，隱沒其身，便即至其尼俱陀林，出現於彼。",
        "translation": "Seeing this, the Tathāgata descended from Kapilavastu and withdrew to hide in the city of Kapilavastu. Then he came to the forest of nyagrodha trees [where he was staying] and appeared there.",
        "source": "T03n0190_056:0913b29_5"
    },
    {
        "source_sentence": "爾時，難陀見佛於彼林中出已，尋即依一尼俱陀樹，隱身而坐。",
        "translation": "Seeing the Buddha, Nanda emerged from that forest and took his seat in seclusion under a nyagrodha tree.",
        "source": "T03n0190_056:0913c02_6"
    },
    {
        "source_sentence": "爾時，世尊以神通力，舉彼大樹置於虛空，見彼難陀藏身而坐，作如是言：「汝今難陀！",
        "translation": "At the time, the Bhagavān, using his supernormal powers, lifted up that large tree and placed it in space. Seeing Nanda's hidden body sitting there, he said:",
        "source": "T03n0190_056:0913c04_0"
    },
    {
        "source_sentence": "欲何處去？」",
        "translation": "Where do you want to go?",
        "source": "T03n0190_056:0913c05_1"
    },
    {
        "source_sentence": "時彼難陀報言：「世尊！",
        "translation": "That Nanda then replied, Bhagavān!",
        "source": "T03n0190_056:0913c06_2"
    },
    {
        "source_sentence": "我於今者，還復憶彼王位快樂自在之事，兼復憶彼釋孫陀利，是故不樂行於梵行，",
        "translation": "Because of this, I no longer wish to practice the holy life.",
        "source": "T03n0190_056:0913c06_3"
    },
    {
        "source_sentence": "意欲捨戒還於本家。」",
        "translation": "I want to abandon the precepts and return to my home.",
        "source": "T03n0190_056:0913c08_4"
    },
    {
        "source_sentence": "「欲離叢林已得離，　　從林得出還入林，",
        "translation": "Desiring to leave the forest, they leave it and go back and forth from the forest.",
        "source": "T03n0190_056:0913c08_5"
    },
    {
        "source_sentence": "　汝富伽羅觀此事，　　從縛得脫還被縛。」",
        "translation": "You, Pūrṇa, observe this matter; you'll be freed from your bonds and returned to your bonds.",
        "source": "T03n0190_056:0913c08_5"
    },
    {
        "source_sentence": "佛因此事，而說偈言：爾時，世尊為彼難陀說法句已，更復勸言：「長老難陀！",
        "translation": "For this reason, the Buddha spoke these verses: At that point, the Bhagavān explained the teaching to Nanda, and then he again encouraged him, saying, Elder Nanda!",
        "source": "T03n0190_056:0913c08_5"
    },
    {
        "source_sentence": "汝當精心，於我自在法教之中，為盡諸苦，勤行梵行。」",
        "translation": "You must refine yourselves and diligently practice the religious practice for the sake of ending suffering in my unimpeded teaching of the Dharma.",
        "source": "T03n0190_056:0913c13_6"
    },
    {
        "source_sentence": "世尊以法教化難陀，難陀猶故不忘昔日五欲樂事，及在王位適意之樂，",
        "translation": "The World-honored One taught and inspired Nanda by the Dharma. For this reason, Nanda did not forget the pleasures of the five senses that he had enjoyed in the past, nor did he indulge in such pleasures as enjoying his royal throne",
        "source": "T03n0190_056:0913c14_7"
    },
    {
        "source_sentence": "猶復憶念釋孫陀利，不樂正法行於梵行，心欲捨戒還其家宅。",
        "translation": "They're also remembering that Śākyamuni didn't delight in the right teaching and practice of religious practice, and his mind wanted to abandon the precepts and return home.",
        "source": "T03n0190_056:0913c16_0"
    },
    {
        "source_sentence": "爾時，復有一大長者，欲請世尊供設飲食，於時難陀，次當守寺。",
        "translation": "At the time, there was another great elderly man who wanted to invite the Bhagavān to make offerings of food and drink, and then Nanda next guarded the temple.",
        "source": "T03n0190_056:0913c18_0"
    },
    {
        "source_sentence": "爾時，難陀復作是念：「世尊今者當入聚落受彼長者請食之時，我當還家。」",
        "translation": "It was then that Nanda again had this thought, Bhagavān, the Bhagavān, will now enter a village to receive food from that elder's invitation, and I'll return home.",
        "source": "T03n0190_056:0913c19_1"
    },
    {
        "source_sentence": "爾時，世尊預知難陀作此憶念，知已便即告難陀言：「汝今難陀！",
        "translation": "At the time, the Bhagavān knew that Nanda had this recollection, and knowing it, he then addressed Nanda, saying, Now, Nanda!",
        "source": "T03n0190_056:0913c21_0"
    },
    {
        "source_sentence": "須必知時，灑掃寺地，所有澡盥，悉令水滿。」",
        "translation": "You must know when it's time to sweep the grounds of the monastery and make all the baths and toilets fill up with water.",
        "source": "T03n0190_056:0913c22_1"
    },
    {
        "source_sentence": "作是語已，即往聚落，赴其所請。",
        "translation": "Having said these words, he went to the village and invited them there.",
        "source": "T03n0190_056:0913c23_2"
    },
    {
        "source_sentence": "長老難陀，於彼之時即作是念：「今者世尊，已赴他請，往於聚落，我今可得自往向家。」",
        "translation": "The elder Nanda then had this thought, Now, Bhagavān, the Bhagavān has gone to another place and invited him to a village, so now I can go home on my own.",
        "source": "T03n0190_056:0913c24_3"
    },
    {
        "source_sentence": "作是念已，顧見如來所住之房，多有糞土。",
        "translation": "After he had this thought, he looked around and saw that the room where the Tathāgata lived was full of dung and dirt.",
        "source": "T03n0190_056:0913c26_0"
    },
    {
        "source_sentence": "見已作念：「我今先往掃彼糞穢，然後向家。」",
        "translation": "After seeing it, he thought, Now, I'll go sweep away that filthy dung and then head home.",
        "source": "T03n0190_056:0913c26_1"
    },
    {
        "source_sentence": "作是念已，執持掃箒，往掃彼房。",
        "translation": "After he had this thought, he took the sweeper and went to sweep that room.",
        "source": "T03n0190_056:0913c27_2"
    },
    {
        "source_sentence": "其掃一邊，風來還吹，土草滿地，更須報掃。",
        "translation": "When he sweeps one side, a wind blows back and forth, filling the ground with dirt and grass, and he must also sweep it in return.",
        "source": "T03n0190_056:0913c28_3"
    },
    {
        "source_sentence": "彼時難陀，復作是念：「掃地且止，我先當令所有眾僧水澡盥器，先著水滿，",
        "translation": "Then Nanda thought to himself, “If you sweep the floor and do not disturb it, I should first make all the members of the sangha have water for washing their hands.",
        "source": "T03n0190_056:0913c29_4"
    },
    {
        "source_sentence": "然後向家。」",
        "translation": "Then he'll go home.",
        "source": "T03n0190_056:0914a02_5"
    },
    {
        "source_sentence": "作是念已，取彼澡盥，將至水所，悉滿盛水，其所滿器，滿已還覆。",
        "translation": "After he had this thought, he took that bath and wash, went to the water, filled it with water, and covered it back up when it's full.",
        "source": "T03n0190_056:0914a02_6"
    },
    {
        "source_sentence": "彼時難陀，作如是念：「我今何假掃地盛水，如來今者不久還來，我今亦可速至己家。」",
        "translation": "Nanda then had this thought, Why would I need to sweep the ground and fill it with water? The Tathāgata won't come back soon, but now I can quickly reach my own house.",
        "source": "T03n0190_056:0914a03_7"
    },
    {
        "source_sentence": "作是念已，即還從彼尼俱陀林，欲向家去。",
        "translation": "After he had this thought, he returned from that nun's forest and wanted to leave home.",
        "source": "T03n0190_056:0914a05_8"
    },
    {
        "source_sentence": "爾時，世尊在彼所請長者之家，以過人眼清淨天眼，觀彼難陀，已從彼處尼俱陀林欲出向家。",
        "translation": "At the time, the Bhagavān was staying at the house of the elderly man invited there, and with his supernormal vision purified by divine vision beyond human eyes, he observed Nanda, who had left that place to leave the forest",
        "source": "T03n0190_056:0914a07_0"
    },
    {
        "source_sentence": "既見是已，即別化身，從長者家，隱沒不現，尋一念頃，至尼俱陀樹林之內，",
        "translation": "Having seen this, the enlightening being manifested himself in a separate body. He came from the house of the wealthy householder and went into seclusion without appearing there. In an instant he arrived at the forest of nyagrodha trees.",
        "source": "T03n0190_056:0914a09_1"
    },
    {
        "source_sentence": "在彼長老難陀前出。",
        "translation": "He came out in front of the elder nanda.",
        "source": "T03n0190_056:0914a10_2"
    },
    {
        "source_sentence": "爾時，難陀遙見世尊來欲至已，即上一大高峻嶮堓，從彼岸下，至隈障處，",
        "translation": "At that time, seeing the World-honored One approaching from a distance, Nanda climbed up a great high and precipitous precipice to reach the place where the fence was built.",
        "source": "T03n0190_056:0914a12_0"
    },
    {
        "source_sentence": "存身而坐。",
        "translation": "He kept his body and sat down.",
        "source": "T03n0190_056:0914a13_1"
    },
    {
        "source_sentence": "爾時，世尊以神通力，令彼峻堓地平如掌。",
        "translation": "At the time, the Bhagavān used his supernormal powers to cause that lofty ground to be level like a palm.",
        "source": "T03n0190_056:0914a14_0"
    },
    {
        "source_sentence": "爾時，世尊見彼坐時，告言難陀：「汝今在此欲作何事？」",
        "translation": "When the Bhagavān saw him sitting there, he told Nanda, What do you want to do here now?",
        "source": "T03n0190_056:0914a14_1"
    },
    {
        "source_sentence": "於時難陀而白佛言：「婆伽婆！",
        "translation": "Nanda then said to the Buddha, Bhagavān!",
        "source": "T03n0190_056:0914a16_2"
    },
    {
        "source_sentence": "我已言許共孫陀利還家為期，今作是念：『勿使令我成其妄語。』",
        "translation": "I've promised to return home with Sundatta as a promise, and now I think, 'Don't let me do that false speech.'",
        "source": "T03n0190_056:0914a16_3"
    },
    {
        "source_sentence": "是故我今欲往彼處。」",
        "translation": "That's why I want to go there now.",
        "source": "T03n0190_056:0914a18_4"
    },
    {
        "source_sentence": "爾時，佛告長老難陀：「汝今何須見孫陀利？",
        "translation": "It was then that the Buddha addressed the elder Nanda, Why do you need to see Sundarī now?",
        "source": "T03n0190_056:0914a19_0"
    },
    {
        "source_sentence": "其身如是皮裹筋骨，內有髓腦膿血屎尿皆悉充滿，最可厭惡，猶如廁溷。",
        "translation": "His body is like this: skin wrapped around sinews and bones, with marrow, brain, pus, blood, excrement, and urine all filling it. The most disgusting thing is like a toilet bowl.",
        "source": "T03n0190_056:0914a19_1"
    },
    {
        "source_sentence": "如是難陀，我今略說，一一眾生，共婦和同，所出不淨，多於巨海，亦不知足。」",
        "translation": "Thus, Nanda, I'll briefly explain that each of these sentient beings who live together with their wives are in harmony, and what they produce is impure, much greater than the great ocean, which doesn't know how to satisfy",
        "source": "T03n0190_056:0914a21_2"
    },
    {
        "source_sentence": "「欲離稠林已得離，　　從林得脫還入林，",
        "translation": "Desiring to leave the dense forest, he leaves it and returns to the forest after emerging from it.",
        "source": "T03n0190_056:0914a24_0"
    },
    {
        "source_sentence": "　汝富伽羅觀此等，　　從縛得脫還得縛。」",
        "translation": "You, Pūrṇa, observe these things, and you'll be freed from your bonds and return to them.",
        "source": "T03n0190_056:0914a24_0"
    },
    {
        "source_sentence": "爾時，世尊以此因緣，而說彼偈：爾時，世尊教化難陀，說法教言：「今汝難陀！",
        "translation": "At that point, the Bhagavān spoke those verses for this reason: At that point, the Bhagavān educated Nanda and taught him the Dharma, saying, Now, Nanda!",
        "source": "T03n0190_056:0914a24_0"
    },
    {
        "source_sentence": "於我自在說法教中。",
        "translation": "In my own teaching of the Dharma, I'll explain it freely.",
        "source": "T03n0190_056:0914a27_1"
    },
    {
        "source_sentence": "嬉樂行於清淨梵行，為欲滅諸一切苦故。」",
        "translation": "They play and enjoy the pure religious practice because they want to extinguish all suffering.",
        "source": "T03n0190_056:0914a28_2"
    },
    {
        "source_sentence": "爾時，難陀雖被世尊作如是等方便教化，猶故不樂行於梵行，乃共六群諸比丘等，",
        "translation": "At that time, even though he had been taught and inspired by the World-honored One in this way, Nanda still did not take delight in religious practice. So he came together with six groups of monks:",
        "source": "T03n0190_056:0914b01_0"
    },
    {
        "source_sentence": "以為朋黨，數至彼邊，語言論說，從晨到夜，唯論邪命諸惡等事。",
        "translation": "They think they're a group of people who often go to the other side and talk about bad things like wrong livelihood from morning until night, only discussing bad things like wrong livelihood.",
        "source": "T03n0190_056:0914b02_1"
    },
    {
        "source_sentence": "爾時，世尊觀知其行，作如是念：「此之難陀，今已學彼六群比丘，恐畏損其功德業行，",
        "translation": "Knowing what he was doing, the World-honored One thought:",
        "source": "T03n0190_056:0914b04_2"
    },
    {
        "source_sentence": "我應斷其共彼人等以為朋黨。」",
        "translation": "I should cut off their company and make them into a group of friends.",
        "source": "T03n0190_056:0914b06_3"
    },
    {
        "source_sentence": "作是念已，即便告彼長老難陀作如是言：「難陀汝來！",
        "translation": "After he had this thought, he even addressed the elder nanda and said, Nanda, you've come!",
        "source": "T03n0190_056:0914b06_4"
    },
    {
        "source_sentence": "我欲共汝入迦毘羅婆蘇都城。」",
        "translation": "I want to go with you into the capital city of Kapilavastu.",
        "source": "T03n0190_056:0914b08_5"
    },
    {
        "source_sentence": "難陀白言：「唯如尊教！」",
        "translation": "Nanda said, Just as the venerable teaching!",
        "source": "T03n0190_056:0914b08_6"
    },
    {
        "source_sentence": "爾時，世尊與彼難陀入迦毘羅婆蘇都城，入已漸至一賣魚店。",
        "translation": "At the time, the Bhagavān and that Nanda entered the capital city of Kapilavastu and gradually went to a fish store after entering it.",
        "source": "T03n0190_056:0914b09_7"
    },
    {
        "source_sentence": "爾時，世尊見彼店內，茅草鋪上，有一百頭臭爛死魚，置彼草鋪。",
        "translation": "At the time, the Bhagavān saw that inside the store there was a bed of grass with one hundred pieces of dead fish on it smelling bad and rotten.",
        "source": "T03n0190_056:0914b11_0"
    },
    {
        "source_sentence": "見已告彼長老難陀，作如是言：「難陀汝來！",
        "translation": "Having seen it, he told the elder nanda, saying, Nanda, you've come!",
        "source": "T03n0190_056:0914b12_1"
    },
    {
        "source_sentence": "取此魚鋪一把茅草。」",
        "translation": "Take this fish spread a handful of thatch grass.",
        "source": "T03n0190_056:0914b13_2"
    },
    {
        "source_sentence": "其彼難陀而白佛言：「如世尊教。」",
        "translation": "That Nanda then said to the Buddha, As the Bhagavān teaches.",
        "source": "T03n0190_056:0914b13_3"
    },
    {
        "source_sentence": "作是語已，即於彼店，在魚鋪下，抽取一秉臭惡茅草。",
        "translation": "After he said this, he went to that store, placed it under a fish tray, pulled out a hold of foul-smelling grass, and took one.",
        "source": "T03n0190_056:0914b14_4"
    },
    {
        "source_sentence": "既執取已，佛復告言長老難陀：「少時捉住，還放於地。」",
        "translation": "After they had taken it, the Buddha again told the elder Nanda, An instant later, he caught it and released it to the ground.",
        "source": "T03n0190_056:0914b15_5"
    },
    {
        "source_sentence": "難陀白言：「如世尊教。」",
        "translation": "Nanda said, As the Bhagavān teaches.",
        "source": "T03n0190_056:0914b17_0"
    },
    {
        "source_sentence": "即把草住。",
        "translation": "He then held the grass and stayed there.",
        "source": "T03n0190_056:0914b17_1"
    },
    {
        "source_sentence": "爾時難陀，捉持彼草經一時頃，便放於地。",
        "translation": "It was then that Nanda grabbed the grass and released it to the ground for a moment.",
        "source": "T03n0190_056:0914b17_2"
    },
    {
        "source_sentence": "爾時，佛復告難陀言：「汝自嗅手。」",
        "translation": "It was then that the Buddha again addressed Nanda, Smell your own hands.",
        "source": "T03n0190_056:0914b18_3"
    },
    {
        "source_sentence": "爾時難陀即嗅其手。",
        "translation": "It was then that Nanda smelled his hand.",
        "source": "T03n0190_056:0914b19_4"
    },
    {
        "source_sentence": "爾時，佛復告難陀言：「汝手何氣？」",
        "translation": "It was then that the Buddha again addressed Nanda, What's the energy in your hand?",
        "source": "T03n0190_056:0914b20_0"
    },
    {
        "source_sentence": "長老難陀報言：「世尊！",
        "translation": "The elder Nanda replied, Bhagavān!",
        "source": "T03n0190_056:0914b20_1"
    },
    {
        "source_sentence": "唯有不淨腥臭氣也。」",
        "translation": "It's only impure, smelly, and foul-smelling.",
        "source": "T03n0190_056:0914b21_2"
    },
    {
        "source_sentence": "佛本行集經卷第五十六",
        "translation": "Fobenxing ji jing, vol. 56",
        "source": "T03n0190_056:0914b22_0"
    }
]