[
    {
        "source_sentence": "佛說眾許摩訶帝經卷第十三",
        "translation": "Foshuo zhixiang moha di jing, vol. 13",
        "source": "T03n0191_013:0971c13_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚少卿",
        "translation": "Xitian zhuan jing sanzang朝散 dafu xi Hongun shouxing",
        "source": "T03n0191_013:0971c15_0"
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao daishi jing faxian Feng imperial edict translation",
        "source": "T03n0191_013:0971c16_0"
    },
    {
        "source_sentence": "爾時淨飯王說是語已，心有所思忽然淚下。",
        "translation": "After King Śuddhodana said these words, he suddenly wept in tears with some thought in his mind.",
        "source": "T03n0191_013:0971c17_0"
    },
    {
        "source_sentence": "「往昔住宮中，　　多人同衛護；",
        "translation": "In the past, they lived in the palace and were guarded by many people.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　山野中怖畏，　　一身云何住？」",
        "translation": "How does one body abide in fear of the mountains and fields?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "世尊答曰：「聖者十種住，　　我悉已安處；",
        "translation": "The World-honored One answered, “Noble one, there are ten kinds of abiding:",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　牢繫今解脫，　　非住人王宮。」",
        "translation": "Now that he's freed from the bond of bondage, he doesn't live in the human king's palace.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「象床金寶飾，　　昔為汝所寢；",
        "translation": "The king said, “The elephant bed is decorated with golden treasures. It used to be your bed in the past.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　山野唯草木，　　云何得安眠？」",
        "translation": "The mountains and fields are only grass and trees, so how can they sleep peacefully?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「解脫之臥具，　　菩提分莊嚴；",
        "translation": "He answered, The bedding of liberation is adorned by the factors of enlightenment.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　眠睡甚適悅，　　無一切熱惱。」",
        "translation": "He sleeps and sleeps very pleasantly, without any heat or torment.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「象馬及輦輿，　　昔出入所乘；",
        "translation": "The king said, “Formerly I rode on elephants, horses, mules, and carriages.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　一切棘刺地，　　今云何可行？」",
        "translation": "All the thorns and thorns on the ground, how can they be practiced now?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「我有神足車，　　精勤乘往復；",
        "translation": "He replied, “I have a chariot with supernormal powers.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　雖行一切地，　　不礙煩惱刺。」",
        "translation": "Even though he practices all the stages, he doesn't obstruct the thorns of affliction.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「迦釋迦妙衣，　　嚴身昔自在；",
        "translation": "The king said, “The fine robes of the Kassapa gods Adorned their bodies freely in the past.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　今袈裟麤衣，　　云何忍被服？」",
        "translation": "Now, how can we tolerate being clothed in a monk's robe?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「僧伽梨麤衣，　　牟尼山中服；",
        "translation": "He replied, A monk's robe is made of sandalwood cloth and a monk's robe is made of silk.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　著已善相生，　　見者皆深悅。」",
        "translation": "They're addicted to the appearance of goodness that has arisen, and those who see it are deeply delighted.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「金寶器中食，　　恒食最上味；",
        "translation": "The king said, “The food in the golden vessel always has the best flavor.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　今自持應器，　　所食知云何？」",
        "translation": "Now that you're holding your own container, what do you know about what you eat?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「等引法味最，　　食之得出離；",
        "translation": "He answered, Equality leads to the supreme flavor of the Dharma, and by eating it one can attain deliverance.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　已斷世間愛，　　愍世故行化。」",
        "translation": "They've ended worldly cravings and practiced transformation because they hate the world.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「乳糖水甘美，　　飲之昔無厭；",
        "translation": "The king said, “The milk and sugar are delicious. I never tired of drinking them.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　今所飲冷熱，　　清濁知云何？」",
        "translation": "What do you know about the coolness and heat of what you're drinking now?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「王貴盛之水，　　世間人爭飲；",
        "translation": "He replied, “The king’s water is so valuable that everyone in the world wants to drink it.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　飲已或增染，　　如我無愛樂。」",
        "translation": "After drinking it, they may become increasingly defiled, just as I have no craving or pleasure.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「寶殿及樓閣，　　昔者隨心住；",
        "translation": "The king said, “The jeweled halls and the towers used to live according to their wishes.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　今獨處山林，　　云何得無怖？」",
        "translation": "Now that you're alone in a mountain forest, how can you attain fearlessness?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「已斷煩惱本，　　諸怖畏不生；",
        "translation": "He answered, Having cut off the root of affliction, fears and fears won’t arise.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　極微我亦無，　　隨處得安住。」",
        "translation": "The extremely subtle self is also nonexistent, and it can be settled anywhere.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「清淨妙香水，　　昔時恒沐浴；",
        "translation": "The king said, Pure and wonderful fragrant water used to bathe me constantly.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　今獨山野中，　　誰浴牟尼王？」",
        "translation": "Now, who bathes King Muṇi alone in the wilderness of a mountain?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「戒香漬法水，　　有德人恒浴；",
        "translation": "He answered, The fragrance of the precepts wets the water of the Dharma, and virtuous people always bathe it.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　潔身到彼岸，　　無量聖所說。」",
        "translation": "My pure body reaches the other shore, which is explained by measureless sages.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「昔妙香塗身，　　及著迦釋衣；",
        "translation": "The king said, “In the past I smeared my body with a wonderful fragrance and wore the kaṣākha robe.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　恒處內宮殿，　　離彼非相稱？」",
        "translation": "What's the eternal place inside the palace, and what's not called that apart from it?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「戒香最馚馥，　　用塗身莊嚴；",
        "translation": "He replied, The fragrance of the precepts is most fragrant, adorned with a body-smearing ointment.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　我今非愚迷，　　離寶衣嚴飾。」",
        "translation": "Now, I'm not foolish and deluded, but I'm free of my jeweled robes and adorned.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "王曰：「何處得輕慢，　　何處可怖畏；",
        "translation": "The king said, “Where can I be disrespectful or fearful?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　無事及有事，　　今問願當說？」",
        "translation": "What's not a thing and what's a thing, will I now ask you to explain it?",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "答曰：「老病死三法，　　可怖勿輕慢；",
        "translation": "He replied, Old age, sickness, and death are three things that should be feared and not despised.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "　當求適悅境，　　無事應愛樂。」",
        "translation": "You should seek an object that pleases, and there's nothing to be desired.",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "復說伽陀問世尊曰：爾時淨飯王聞是說已，歡喜無量讚言：「善生釋族，",
        "translation": "Again, he said to the Buddha: At that time King Śuddhodana heard this discourse and rejoiced immeasurably. He praised it, saying:",
        "source": "T03n0191_013:0971c18_0"
    },
    {
        "source_sentence": "於世八法而皆不染。」",
        "translation": "They aren't stained by the eight dharmas of the world.",
        "source": "T03n0191_013:0972b02_1"
    },
    {
        "source_sentence": "復以頭面禮如來足。",
        "translation": "Again, he bowed his head and face at the Tathāgata's feet.",
        "source": "T03n0191_013:0972b02_2"
    },
    {
        "source_sentence": "又復思惟：「我得善利，我子乃證如是功德。」",
        "translation": "Again, he thought, I'll attain good benefits, and my son will realize such merit.",
        "source": "T03n0191_013:0972b03_3"
    },
    {
        "source_sentence": "王與眷屬奉送世尊，入儞也(二合)誐嚕馱林精舍。",
        "translation": "The king and his retinues presented themselves to the Bhagavān and entered the monastery of Kaṇḍhaka (two combinations) in the forest.",
        "source": "T03n0191_013:0972b04_4"
    },
    {
        "source_sentence": "爾時世尊既至精舍登法座已，王及大臣乃至士庶圍繞瞻仰，虛空諸天歡喜讚歎。",
        "translation": "It was then that the Bhagavān arrived at the monastery and ascended the Dharma seat, surrounded by kings, ministers, and other men and women, and the gods in space rejoiced and praised him.",
        "source": "T03n0191_013:0972b06_0"
    },
    {
        "source_sentence": "佛觀會眾各各心意及與根性，如實知已，廣為解說四聖諦法。",
        "translation": "The Buddha observed that each of the assembly's members had their minds, thoughts, and faculties, and then knew them as they really were and explained the four noble truths in detail for them.",
        "source": "T03n0191_013:0972b07_1"
    },
    {
        "source_sentence": "時白淨飯王及釋眾等七十七千人，皆證須陀洹果。",
        "translation": "Seventy-seven thousand people, including King Śubhavyūha and the other members of the Śākya clan, all attained the fruit of stream entry.",
        "source": "T03n0191_013:0972b09_2"
    },
    {
        "source_sentence": "世尊又觀何處緣熟？",
        "translation": "Bhagavān, where do you observe the causal maturation?",
        "source": "T03n0191_013:0972b10_3"
    },
    {
        "source_sentence": "彼梵現林時可說法。",
        "translation": "When that Brahmā appears in the forest, he can teach the Dharma.",
        "source": "T03n0191_013:0972b11_0"
    },
    {
        "source_sentence": "佛與大眾悉詣彼處，無量人眾相隨聽法。",
        "translation": "The Buddha and the crowd all went there, and measureless people followed each other to listen to the teaching.",
        "source": "T03n0191_013:0972b11_1"
    },
    {
        "source_sentence": "世尊廣說四諦行相，彼斛飯王迨於釋眾乃至人天，有七十六千人，又證須陀洹果。",
        "translation": "The Bhagavān extensively explained the practices of the four truths, and there were 76,000 people in the Śākyamuni king's congregation up to humans and gods who also realized the fruit of stream entry.",
        "source": "T03n0191_013:0972b12_2"
    },
    {
        "source_sentence": "世尊復詣嚕呬怛迦林，亦有無量天人、釋眾、眷屬、人民、士庶隨佛聽法。",
        "translation": "The Bhagavān then went to the forest of Rūpadhātu, and there were measureless gods, goddesses, Śākyamunis, their retinues, people, and men who followed the Buddha and listened to the teaching.",
        "source": "T03n0191_013:0972b14_3"
    },
    {
        "source_sentence": "世尊同前廣演四諦，甘露飯王及釋眾等乃至人天，有七十五千人，證須陀洹果。",
        "translation": "The Bhagavān shared the previous extensive explanation of the four truths, with the ambrosial rice king and the Śākyamuni congregation up to humans and gods, there were 75,000 people who realized the fruit of stream entry.",
        "source": "T03n0191_013:0972b15_4"
    },
    {
        "source_sentence": "餘有證斯陀含果者，有證阿那含果者，有證阿羅漢果者；",
        "translation": "The rest are those who realize the fruit of once-returning, those who realize the fruit of nonreturning, and those who realize the fruit of arhatship.",
        "source": "T03n0191_013:0972b17_5"
    },
    {
        "source_sentence": "有發聲聞菩提心者，有發辟支菩提心者，有發無上菩提心者；",
        "translation": "Some develop the aspiration for enlightenment of the disciples, some develop the aspiration for enlightenment of the pratyekabuddhas, and some develop the aspiration for enlightenment of the peerless.",
        "source": "T03n0191_013:0972b19_0"
    },
    {
        "source_sentence": "亦有出家斷諸煩惱後證阿羅漢果者，乃至有發三歸心者。",
        "translation": "There are also renunciants who realize the fruit of arhatship after ending the afflictions and even those who give rise to the mind of the three refuges.",
        "source": "T03n0191_013:0972b20_1"
    },
    {
        "source_sentence": "時提婆達多既見世尊現於神變及說妙法，自無所證乃生妬心，發不善言，",
        "translation": "When Devadatta saw that the World-honored One manifested miraculous signs and preached the wonderful Dharma, but he himself had never experienced them. So he became jealous and spoke in unwholesome terms.",
        "source": "T03n0191_013:0972b21_2"
    },
    {
        "source_sentence": "謂釋眾曰：「一切盲人樂斯幻化，此幻化事一切能作。」",
        "translation": "He said to the Śākyamuni crowd, All blind people enjoy this illusory transformation, and all these illusory things can be done.",
        "source": "T03n0191_013:0972b23_3"
    },
    {
        "source_sentence": "有一釋眾名鉢囉摩拏野，告提婆達多言：「汝勿於世尊大丈夫所發如是惡言。」",
        "translation": "One of the Śākyamunis, named Padmaprabha, told Devadatta, Don't say such bad words to the Bhagavān and the great man.",
        "source": "T03n0191_013:0972b24_4"
    },
    {
        "source_sentence": "提婆達多尋便默然。",
        "translation": "Devadatta then remained silent.",
        "source": "T03n0191_013:0972b26_5"
    },
    {
        "source_sentence": "時淨飯王起心思惟：「昔者天人、阿修羅為世間供養，今佛出世，真是世間恭敬供養。」",
        "translation": "King Śuddhodana then got up and thought, In the past, gods, humans, and asuras were worldly offerings to the world, but now that the Buddha has appeared in the world, it's really a worldly offering of respect.",
        "source": "T03n0191_013:0972b26_6"
    },
    {
        "source_sentence": "「釋種大仙大丈夫，　　能降妙法甘露雨；",
        "translation": "The great sage hero of the Śākya clan Is able to send down the rain of ambrosia of the fine dharma.",
        "source": "T03n0191_013:0972b28_7"
    },
    {
        "source_sentence": "　救濟墮落黑闇者，　　開解脫門為引導。」",
        "translation": "To rescue someone who falls into the darkness of blackness, he opens the gate of liberation as a guide.",
        "source": "T03n0191_013:0972b28_7"
    },
    {
        "source_sentence": "有釋童子說偈讚佛曰：爾時淨飯王，聞此童子說偈讚佛深心歡喜，然於真實而未見諦，",
        "translation": "Then the god Śāriputra praised the Buddha in verse: At that time King Jīvaka, having heard these verses of praise from the Buddha, was deeply delighted; but he did not see the truth.",
        "source": "T03n0191_013:0972b28_7"
    },
    {
        "source_sentence": "唯云：「世尊是大丈夫具大威德，誰有聖子而同我耶？」",
        "translation": "They simply said, Bhagavān, this is a great man with great authority and virtue, so who among the noble sons would be the same as me?",
        "source": "T03n0191_013:0972c04_8"
    },
    {
        "source_sentence": "世尊思惟：「父淨飯王不見真實，乃為二事：一者我心；",
        "translation": "The World-honored One thought: When King Śuddhodana the father did not see reality, it was for two reasons.",
        "source": "T03n0191_013:0972c05_9"
    },
    {
        "source_sentence": "二者分別心。",
        "translation": "The second is the mind that discriminates.",
        "source": "T03n0191_013:0972c06_10"
    },
    {
        "source_sentence": "若能離此可見真實。」",
        "translation": "If you can be free of this, you'll see the true reality.",
        "source": "T03n0191_013:0972c07_11"
    },
    {
        "source_sentence": "佛觀大目虔連於淨飯王而有宿因，佛謂大目虔連曰：「汝以方便化淨飯王，",
        "translation": "When the Buddha observed that Mahāmaudgalyāyana had a constellate cause in King Śuddhodana, the Buddha said to Mahāmaudgalyāyana, “Your skillful means have transformed King Śuddhodana.",
        "source": "T03n0191_013:0972c07_12"
    },
    {
        "source_sentence": "令離我執。」",
        "translation": "It causes them to part with self-attachment.",
        "source": "T03n0191_013:0972c09_13"
    },
    {
        "source_sentence": "於是大目虔連即詣王處。",
        "translation": "Mahāmaudgalyāyana then went to the king's place.",
        "source": "T03n0191_013:0972c09_14"
    },
    {
        "source_sentence": "王見尊者心便歡喜，尊者應時入三摩地，隱於王前，乃出東方虛空之中，",
        "translation": "When the king saw this, his heart rejoiced. The venerable one then entered concentration and, hiding in front of the king, rose up into the eastern sky.",
        "source": "T03n0191_013:0972c10_15"
    },
    {
        "source_sentence": "現行、立、坐、臥四威儀相；",
        "translation": "He manifested the four deportments of walking, standing, sitting, and lying down.",
        "source": "T03n0191_013:0972c11_16"
    },
    {
        "source_sentence": "又復身中放五色光，猶如玻瓈互相映徹，或身上出水身下出火，或身上出火身下出水，",
        "translation": "Again, a five-colored ray of light emanated from his body, resembling the reflection of a pair of crystal bowls. Sometimes water came forth from his body; sometimes fire came forth from beneath his body; sometimes water came forth from bene",
        "source": "T03n0191_013:0972c12_17"
    },
    {
        "source_sentence": "如是種種現於神變；",
        "translation": "They manifested various such miraculous displays.",
        "source": "T03n0191_013:0972c14_18"
    },
    {
        "source_sentence": "東方若此，南、西、北方亦復如是；",
        "translation": "If this were so in the east, it would be likewise in the south, west, and north.",
        "source": "T03n0191_013:0972c14_19"
    },
    {
        "source_sentence": "作神變已沒於虛空，如彈指頃已在王前。",
        "translation": "After performing the miraculous transformation, he disappeared into space, just as if he had been in front of the king for an instant.",
        "source": "T03n0191_013:0972c15_20"
    },
    {
        "source_sentence": "王曰：「佛弟子中更有如尊者否？」",
        "translation": "The king said, Is there another such a venerable among the Buddha's disciples?",
        "source": "T03n0191_013:0972c16_21"
    },
    {
        "source_sentence": "「世尊弟子大威德，　　三明六通皆自在；",
        "translation": "“The disciples of the World-honored One had great preeminent virtue. They mastered the three sciences and the six transcendent powers.",
        "source": "T03n0191_013:0972c17_22"
    },
    {
        "source_sentence": "　解脫三界阿羅漢，　　聲聞牟尼如我多。」",
        "translation": "Being liberated from the arhats of the three realms, śrāvakas and nuns are like me.",
        "source": "T03n0191_013:0972c17_22"
    },
    {
        "source_sentence": "時大目虔連即說偈曰：時淨飯王初謂世尊獨有是事，心中常存我執之相，",
        "translation": "Mahāmaudgalyāyana then spoke these verses: At that time King Śuddhodana first said to the World-honored One, “There is only one thing with which I am concerned.",
        "source": "T03n0191_013:0972c17_22"
    },
    {
        "source_sentence": "及大目虔連現神變已，乃知弟子亦有斯證，王之我心由此得滅。",
        "translation": "When Mahāmaudgalyāyana and Mahāmaudgalyāyana manifested their miraculous transformations, they then knew that the disciples also had this realization, which would cause the king's mind to cease as a self.",
        "source": "T03n0191_013:0972c21_23"
    },
    {
        "source_sentence": "於是世尊即以方便作世間心：「云何得梵王、帝釋及淨光天來，我為說法？」",
        "translation": "The Bhagavān then made a worldly mind of skillful means, How did Brahmā, Indra, and the Pure Light gods come to preach for me?",
        "source": "T03n0191_013:0972c22_24"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T03n0191_013:0972c24_25"
    },
    {
        "source_sentence": "如來之心非聲聞、菩薩之所能知。",
        "translation": "The mind of the Tathāgata is not something that śrāvakas and bodhisattvas can know.",
        "source": "T03n0191_013:0972c24_26"
    },
    {
        "source_sentence": "所以然者，世間之心下至蟻子尚令得知，何況諸天。",
        "translation": "The reason for this is that the minds of the world go down to the ant child and still let him know, so why wouldn't the gods?",
        "source": "T03n0191_013:0972c25_27"
    },
    {
        "source_sentence": "於是帝釋告毘首羯磨天子言：「汝化儞也(二合)誐嚕馱林作大法會，",
        "translation": "Śakra then addressed the deity Vaiśravaṇa, saying:",
        "source": "T03n0191_013:0972c26_28"
    },
    {
        "source_sentence": "其中臺殿樓閣悉安師子之座，咸以眾寶而為嚴飾；",
        "translation": "In each of these terraces, halls, and towers were lion seats adorned with all kinds of jewels.",
        "source": "T03n0191_013:0972c27_29"
    },
    {
        "source_sentence": "復開四門各以四寶裝鉸，復令四天大王而守護之。」",
        "translation": "Again, he opens each of the four gates with a set of four treasures and causes the four heavenly kings to guard it.",
        "source": "T03n0191_013:0972c29_30"
    },
    {
        "source_sentence": "時毘首羯磨天子承帝釋命，變大法會種種嚴飾，如帝釋教，仍令四王為守門者。",
        "translation": "Vaiśravaṇa then instructed Indra to transform the great Dharma assembly into various adornments, just as Indra had taught them, and he still made the four kings guard the gate.",
        "source": "T03n0191_013:0973a01_31"
    },
    {
        "source_sentence": "作變化已，白於世尊：「法會已成，請佛往彼。」",
        "translation": "After performing the transformation, he said to the Bhagavān, The Dharma assembly has been completed, so ask the Buddha to go there.",
        "source": "T03n0191_013:0973a03_32"
    },
    {
        "source_sentence": "是時世尊與自眷屬及梵王、帝釋、淨光天等無數百千之眾，還儞也(二合)誐嚕馱林。",
        "translation": "The Bhagavān, his own retinues, Brahmā, Indra, the gods of pure light, and countless hundreds of thousands of other sentient beings then returned to the forest of garuḍa.",
        "source": "T03n0191_013:0973a04_33"
    },
    {
        "source_sentence": "佛既到已入於寶殿，昇師子座即說妙法。",
        "translation": "When the Buddha arrived, he entered the jeweled hall and ascended to the lion's seat to explain the wonderful teaching.",
        "source": "T03n0191_013:0973a05_34"
    },
    {
        "source_sentence": "時尊者大目虔連與淨飯王，同詣佛所。",
        "translation": "Venerable Mahāmaudgalyāyana and King Śuddhodana then went to the Buddha together.",
        "source": "T03n0191_013:0973a06_35"
    },
    {
        "source_sentence": "至法會門，尊者直入，王即止住。",
        "translation": "When he arrived at the door of the assembly, the venerable entered straight in, and the king stopped and stayed there.",
        "source": "T03n0191_013:0973a07_36"
    },
    {
        "source_sentence": "王曰：「何故障我？」",
        "translation": "The king said, What's wrong with me?",
        "source": "T03n0191_013:0973a08_37"
    },
    {
        "source_sentence": "對曰：「佛為淨光天等說法，凡人不得預會。」",
        "translation": "He replied, The Buddha teaches the Dharma for the gods of pure light and so forth, but ordinary people can't pre-arrange it.",
        "source": "T03n0191_013:0973a08_38"
    },
    {
        "source_sentence": "王曰：「汝何賢聖，居此守門？」",
        "translation": "The king said, Why are you so noble and virtuous that you're staying here to guard the gate?",
        "source": "T03n0191_013:0973a09_39"
    },
    {
        "source_sentence": "對曰：「我是持國天王。」",
        "translation": "He replied, I'm the king of the gods who hold the kingdom.",
        "source": "T03n0191_013:0973a10_40"
    },
    {
        "source_sentence": "時王乃問：「東門即爾，南門可否？」",
        "translation": "The king then asked, Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T03n0191_013:0973a10_41"
    },
    {
        "source_sentence": "對曰：「不知。」",
        "translation": "He replied, I don't know.",
        "source": "T03n0191_013:0973a11_42"
    },
    {
        "source_sentence": "既至南門復不得入，王乃問言：「何故如是？」",
        "translation": "When he arrived at the south gate and couldn't enter again, the king asked, Why is it like this?",
        "source": "T03n0191_013:0973a11_43"
    },
    {
        "source_sentence": "對曰：「佛為淨光諸天說法，凡人不得預會。」",
        "translation": "He replied, The Buddha teaches the Dharma for the gods of Pure Light, but ordinary people can't pre-arrange it.",
        "source": "T03n0191_013:0973a12_44"
    },
    {
        "source_sentence": "又問：「汝何賢聖，居此守門？」",
        "translation": "Again, he asked, What's the good man or sage who lives here guarding the gate?",
        "source": "T03n0191_013:0973a13_45"
    },
    {
        "source_sentence": "對曰：「我即增長天王，故守南門。」",
        "translation": "He replied, I am the king of the growing heavenly kings, so I guard the south gate.",
        "source": "T03n0191_013:0973a14_46"
    },
    {
        "source_sentence": "王自惟曰：「我去西門應恐得入。」",
        "translation": "The king thought to himself, If I go to the west gate, I'm afraid I'll enter.",
        "source": "T03n0191_013:0973a15_47"
    },
    {
        "source_sentence": "既至於彼亦不得入，王又審問：「何故如是？」",
        "translation": "When he arrived there, he couldn't enter either, and the king again asked, Why is it like this?",
        "source": "T03n0191_013:0973a15_48"
    },
    {
        "source_sentence": "對復如前。",
        "translation": "Again, it's like the previous one.",
        "source": "T03n0191_013:0973a16_49"
    },
    {
        "source_sentence": "又問：「汝何賢聖？」",
        "translation": "Again, he asked, What are you good and noble?",
        "source": "T03n0191_013:0973a16_50"
    },
    {
        "source_sentence": "答曰：「我是廣目天王。」",
        "translation": "He replied, I'm the king of the vast-eyed celestial king.",
        "source": "T03n0191_013:0973a17_51"
    },
    {
        "source_sentence": "淨飯王長息歎曰：「聖凡相隔，雖近至遠。」",
        "translation": "King Śuddhodana continued to sigh in admiration, saying, Although the noble and mortal are separated by each other, they're both near and far away.",
        "source": "T03n0191_013:0973a17_52"
    },
    {
        "source_sentence": "既心切見佛，更往北門，至彼同前止不令入。",
        "translation": "When he saw the Buddha with a fixed mind, he went to the north gate and stopped at the same place as before but didn't allow him to enter.",
        "source": "T03n0191_013:0973a18_53"
    },
    {
        "source_sentence": "王即厲聲謂守門者曰：「賢聖勿是北方天王否？」",
        "translation": "The king then raised his voice and said to the gatekeeper, Good man, isn't this the northern heavenly king?",
        "source": "T03n0191_013:0973a19_54"
    },
    {
        "source_sentence": "對曰：「我即毘沙門也。」",
        "translation": "He replied, I am the Vaiśravaṇa.",
        "source": "T03n0191_013:0973a20_55"
    },
    {
        "source_sentence": "時淨飯王聞此語已迨將悶絕，又復思惟：「我雖至親今則踈遠，我親分別從此泯滅。」",
        "translation": "After hearing these words, King Śuddhodana was about to faint and thought again, Even though I'm close to my relatives, now they're far away, and my relatives are discriminating and ceasing from here.",
        "source": "T03n0191_013:0973a21_56"
    },
    {
        "source_sentence": "於是世尊知無分別，又察情極，若不時見恐致無常；",
        "translation": "The World-honored One then, knowing that there was no discrimination, also discerned the extremes of sentient beings. If he did not see them at the right time, he feared that they might become impermanent.",
        "source": "T03n0191_013:0973a23_57"
    },
    {
        "source_sentence": "佛以神力變樓臺殿閣乃至垣牆，悉成玻瓈清淨映徹，內外相覩無所障礙。",
        "translation": "The Buddha transformed the towers, terraces, halls, and even walls with his miraculous powers, all becoming crystal-plated, pure, reflective, and unobstructed, both inside and outside.",
        "source": "T03n0191_013:0973a24_58"
    },
    {
        "source_sentence": "王得見佛心極歡喜，即便禮拜於一面坐。",
        "translation": "The king was greatly delighted to see the Buddha, so he bowed his head at one side and sat down.",
        "source": "T03n0191_013:0973a25_59"
    },
    {
        "source_sentence": "爾時世尊種種方便化其父王，令無我心及除分別，即為廣說苦、集、滅、道四聖諦法。",
        "translation": "At the time, the Bhagavān had variously transformed his father king into a selfless mind and removed discrimination, explaining in detail for him the four noble truths of suffering, arising, cessation, and the path.",
        "source": "T03n0191_013:0973a27_0"
    },
    {
        "source_sentence": "王得聞已，所有身見如二十山峯，以金剛智破滅無餘，便證須陀洹果。",
        "translation": "Having heard it, the king saw that his body was like twenty mountain peaks and destroyed it with adamantine wisdom without remainder, thereby attaining the fruit of stream-entry.",
        "source": "T03n0191_013:0973a28_1"
    },
    {
        "source_sentence": "王思念曰：「我今所證，非天、非仙、非父、非母，亦非親愛一切眷屬之所獲得，",
        "translation": "The king thought to himself, “What I have now attained is neither heavenly nor holy, neither my father nor mother, nor gained by any of my relatives and attendants.",
        "source": "T03n0191_013:0973b01_2"
    },
    {
        "source_sentence": "當從如來慈孝所致。」",
        "translation": "It should come from the Tathāgata's compassion and filial piety.",
        "source": "T03n0191_013:0973b03_3"
    },
    {
        "source_sentence": "又復思惟：「我於過去輪迴生死，骨聚如山血淚成海，或復墮落諸惡趣中，",
        "translation": "Again, he thought: In the past I cycled back and forth in birth and death. My bones were piled up like mountains of blood and tears to form a sea; or else I might have fallen into various evil destinies.",
        "source": "T03n0191_013:0973b03_4"
    },
    {
        "source_sentence": "今日乃入解脫門預於聖道。」",
        "translation": "Today, he enters the gate of liberation and prepares for the noble path.",
        "source": "T03n0191_013:0973b05_5"
    },
    {
        "source_sentence": "又復言云：「善哉！",
        "translation": "Again, he said, Good!",
        "source": "T03n0191_013:0973b05_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0191_013:0973b06_7"
    },
    {
        "source_sentence": "往昔修行無數苦行，不顧身命為利眾生，我今更求殊勝天報。」",
        "translation": "In the past, I cultivated countless ascetic practices that didn't care about my body and life for the benefit of sentient beings, but now I'm seeking the rewards of superior heaven.",
        "source": "T03n0191_013:0973b06_8"
    },
    {
        "source_sentence": "佛即悲念：「王今云何求斯報也？」",
        "translation": "The Buddha then had a compassionate thought, How does the king now seek this reward?",
        "source": "T03n0191_013:0973b07_9"
    },
    {
        "source_sentence": "時淨飯王即從座起，合掌頂禮白世尊言：「今欲請佛及諸聖眾，於我宮中來晨受食，",
        "translation": "King Śuddhodana then rose from his seat, joined his palms and bowed his head in respect, said to the World-honored One, “I now wish to invite the Buddha and the holy ones to come to my palace to receive their food",
        "source": "T03n0191_013:0973b08_10"
    },
    {
        "source_sentence": "唯願大慈咸垂降赴。」",
        "translation": "Please have great compassion on them all and send them down.",
        "source": "T03n0191_013:0973b10_11"
    },
    {
        "source_sentence": "佛即默然。",
        "translation": "The Buddha then remained silent.",
        "source": "T03n0191_013:0973b11_12"
    },
    {
        "source_sentence": "王知許已禮謝而歸。",
        "translation": "Knowing that he had given his permission, the king bowed his respects and returned.",
        "source": "T03n0191_013:0973b11_13"
    },
    {
        "source_sentence": "纔至宮中詔白淨飯王，告而言曰：「我已證道，不樂王位，汝受灌頂代我理國。」",
        "translation": "He just arrived at the palace and instructed King Jīvaka to tell him, I've realized the path, won't enjoy the king's throne, and you'll be consecrated in my country of principle.",
        "source": "T03n0191_013:0973b11_14"
    },
    {
        "source_sentence": "白淨飯王問：「何時證耶？」",
        "translation": "He asked the king of Śuddhodana, When did he realize it?",
        "source": "T03n0191_013:0973b13_15"
    },
    {
        "source_sentence": "答曰：「適於儞也(二合)誐嚕馱林聞法得證。」",
        "translation": "He answered, It's appropriate to hear the Dharma at Kaṇḍudālī (two combinations) when he hears it and realizes it.",
        "source": "T03n0191_013:0973b14_0"
    },
    {
        "source_sentence": "白淨飯王曰：「世尊初到彼林我已得證，王云代位，我實不能。」",
        "translation": "He said to King Śuddhodana, When the Bhagavān first arrived at that forest, I had already realized it, and the king said, I really can't.",
        "source": "T03n0191_013:0973b14_1"
    },
    {
        "source_sentence": "又詔斛飯王曰：「汝可灌頂代我理國。」",
        "translation": "He also instructed the king of Kudhrakūṭa, You may consecrate yourself to my kingdom of principle.",
        "source": "T03n0191_013:0973b16_2"
    },
    {
        "source_sentence": "對曰：「我於梵現林中聞法證果，所言代位，誠不樂也。」",
        "translation": "He said, I've heard the teaching and realized its fruit in the Brahmā manifesting forest, but what I've said is that it's really unpleasant to be a replacement.",
        "source": "T03n0191_013:0973b17_0"
    },
    {
        "source_sentence": "又謂甘露飯王曰：「汝受灌頂代我理國。」",
        "translation": "He also said to the king of Amṛta's rice, Accept the consecration for my kingdom of principle.",
        "source": "T03n0191_013:0973b18_1"
    },
    {
        "source_sentence": "對曰：「我於嚕呬多迦林聞法證果，今亦不樂處王位也。」",
        "translation": "He replied, I've heard the teaching and realized its fruit in the forest of Rūpadhātu, but now I won't be happy to stay in the king's position.",
        "source": "T03n0191_013:0973b19_2"
    },
    {
        "source_sentence": "淨飯王曰：「若如是者，當令何人守宗社也？」",
        "translation": "King Śuddhodana said, If that's the case, who will be allowed to guard the sect's community?",
        "source": "T03n0191_013:0973b20_3"
    },
    {
        "source_sentence": "諸王咸言：「釋族之中有賢德者，可令守之。」",
        "translation": "The kings all said, There's a good man of the Śākya clan who can be made to guard it.",
        "source": "T03n0191_013:0973b21_4"
    },
    {
        "source_sentence": "議事已畢。",
        "translation": "I've finished discussing the matter.",
        "source": "T03n0191_013:0973b22_5"
    },
    {
        "source_sentence": "淨飯王曰：「速令所司辦造種種珍饌飲食令極香美。」",
        "translation": "The king of Jōtan said, Quickly order the superintendent to prepare various delicious foods and drinks that will make them extremely fragrant.",
        "source": "T03n0191_013:0973b23_0"
    },
    {
        "source_sentence": "又勅潔淨內外除去葷穢，於正殿上當以清淨茵褥及上妙衣敷，置如來及聖眾坐位，",
        "translation": "Also, I command you to purify both inside and outside the palace so as to remove dirt and grime. In the main hall, place the Tathāgata and other saintly monks in their seats on clean mattresses and exquisitely clothed",
        "source": "T03n0191_013:0973b24_1"
    },
    {
        "source_sentence": "復設香花及淨水瓶無使闕備。",
        "translation": "He also sets up incense, flowers, and pure water bottles without fail.",
        "source": "T03n0191_013:0973b26_2"
    },
    {
        "source_sentence": "既至來晨遣使白佛：「今食已辦，請佛及眾同賜降臨。」",
        "translation": "When he arrived, he sent an envoy to the Buddha in the morning and said, Now that the food has been prepared, invited the Buddha and the others to give it to him.",
        "source": "T03n0191_013:0973b26_3"
    },
    {
        "source_sentence": "爾時世尊與諸聖眾前後圍繞，行詣王宮受食供養。",
        "translation": "It was then that the Bhagavān, surrounded by the holy ones in front and behind him, went to the king's palace to receive food and offerings.",
        "source": "T03n0191_013:0973b28_0"
    },
    {
        "source_sentence": "佛至宮門，王與眷屬執爐焚香引世尊入。",
        "translation": "When the Buddha arrived at the palace gate, the king and his retinue took a censer and burned incense to lead the Bhagavān into it.",
        "source": "T03n0191_013:0973b29_1"
    },
    {
        "source_sentence": "佛昇座已，諸聖眾等次第就坐。",
        "translation": "After the Buddha ascended his seat, the sages and others took their seats in order.",
        "source": "T03n0191_013:0973c01_2"
    },
    {
        "source_sentence": "時淨飯王與諸眷屬，禮拜問訊讚歎訖，即親手奉上種種飲食而伸供養。",
        "translation": "King Śuddhodana and his retinues then venerated, greeted, and praised him, offered various foods and drinks with their own hands, and extended offerings.",
        "source": "T03n0191_013:0973c01_3"
    },
    {
        "source_sentence": "食畢澡漱，供心圓滿。",
        "translation": "After he had eaten the food, he washed and rinsed it, and his mind was filled with offerings.",
        "source": "T03n0191_013:0973c03_4"
    },
    {
        "source_sentence": "時淨飯王即取金瓶灌世尊手，白言：「奉施儞也(二合)誐嚕馱林精舍，",
        "translation": "King Śuddhodana then took the golden vial and poured it into the Bhagavān's hand, saying, Give it to the monastery of Kaṇḍhaka (two combinations) in the forest.",
        "source": "T03n0191_013:0973c03_5"
    },
    {
        "source_sentence": "願佛隨意。」",
        "translation": "May the Buddha follow his wishes.",
        "source": "T03n0191_013:0973c05_6"
    },
    {
        "source_sentence": "瓶水出時有五功德聲。",
        "translation": "When a bottle of water emerges, there are five sounds of merit.",
        "source": "T03n0191_013:0973c05_7"
    },
    {
        "source_sentence": "佛亦施願云：「以所施福，王及釋族，一切所求，隨意獲得。」",
        "translation": "The Buddha also gave a vow, saying, Because of the merit they give, the kings and the Śākyas will obtain whatever they want with their generosity.",
        "source": "T03n0191_013:0973c06_8"
    },
    {
        "source_sentence": "王及眷屬聞是語已，歡喜踊躍禮佛而退，佛及聖眾迴還精舍。",
        "translation": "When the king and his retinue heard these words, they rejoiced, bowed to the Buddha, and withdrew. The Buddha and the holy ones returned to the monastery.",
        "source": "T03n0191_013:0973c07_9"
    },
    {
        "source_sentence": "後於一日世尊復在王宮受食，王之眷屬互相謂曰：「今世尊左右皆是耆年，",
        "translation": "One day the World-honored One was again at the royal palace to receive his food. The king’s attendants said among themselves, “All of you, O World-honored One, are now elderly people.",
        "source": "T03n0191_013:0973c08_10"
    },
    {
        "source_sentence": "善相威儀誠堪仰重，然侍奉世尊未為允當；",
        "translation": "Their good features and manner were genuinely dignified, yet they did not serve the World-honored One properly.",
        "source": "T03n0191_013:0973c10_11"
    },
    {
        "source_sentence": "可於釋族選其年少有賢善者，便令出家侍佛左右，貴得相稱。」",
        "translation": "You can choose a young man of the Śākya clan who's good and virtuous, and then he'll leave home to serve the Buddha on his left and right, which will be worthy of praise.",
        "source": "T03n0191_013:0973c11_12"
    },
    {
        "source_sentence": "時淨飯王勅下親族內外臣佐：「今一切義成捨轉輪王位，苦行修習為大法王，",
        "translation": "King Śuddhodana then instructed his relatives, both inside and outside ministers, to abandon the position of wheel-turning king in all senses and practice austerities as great king of the Dharma.",
        "source": "T03n0191_013:0973c12_13"
    },
    {
        "source_sentence": "宜各選其賢子捨令出家侍從世尊，以成其美。」",
        "translation": "It's appropriate for each to select their good sons and allow them to leave home and attend the Bhagavān in order to make them beautiful.",
        "source": "T03n0191_013:0973c14_14"
    },
    {
        "source_sentence": "時斛飯王有二子，一名阿儞嚕馱；",
        "translation": "At that time King Mucilinda had two sons, one of whom was named Anuruddha.",
        "source": "T03n0191_013:0973c15_15"
    },
    {
        "source_sentence": "二名摩賀曩摩。",
        "translation": "The second is called mahānāma.",
        "source": "T03n0191_013:0973c16_16"
    },
    {
        "source_sentence": "彼摩賀曩摩能理王務，然貪財利；",
        "translation": "Mahāmaudgalyāyana was able to govern the affairs of kingship, yet he coveted wealth and profit.",
        "source": "T03n0191_013:0973c16_17"
    },
    {
        "source_sentence": "阿儞嚕馱常處宮中隨意受樂。",
        "translation": "Anuruddha always stayed in the palace to receive pleasure as he wished.",
        "source": "T03n0191_013:0973c17_18"
    },
    {
        "source_sentence": "時斛飯王以勅旨宣下，乃呼摩賀曩摩：「汝可出家以奉王命。」",
        "translation": "When the king of Kuśinagara proclaimed it by imperial edict, he called Mahāprajāpaṇḍa and said, You may leave home to serve the king's order.",
        "source": "T03n0191_013:0973c18_19"
    },
    {
        "source_sentence": "子曰：「我不出家，彼阿儞嚕馱常在宮中受其快樂，可令出家。」",
        "translation": "The son said, I won't leave home; that asura always stays in the palace to experience happiness, so you can allow him to leave home.",
        "source": "T03n0191_013:0973c19_20"
    },
    {
        "source_sentence": "父言：「彼子福德汝勿指陳。」",
        "translation": "The father said, Don't point out the merits of that child.",
        "source": "T03n0191_013:0973c21_21"
    },
    {
        "source_sentence": "子曰：「此是父母愛憐所許，若實有福，當可試驗。」",
        "translation": "The son said, This is what my parents love and approve of, and if there's really merit, I can test it.",
        "source": "T03n0191_013:0973c21_22"
    },
    {
        "source_sentence": "父曰：「當何試驗？」",
        "translation": "The father said, What should I test?",
        "source": "T03n0191_013:0973c22_23"
    },
    {
        "source_sentence": "子曰：「常式送食，今可空盤送之；",
        "translation": "The prince said, “We always send food at the same time. Now we can send it in an empty tray.",
        "source": "T03n0191_013:0973c23_24"
    },
    {
        "source_sentence": "若其有福，食自然出。」",
        "translation": "If they have good fortune, the food will naturally come out.",
        "source": "T03n0191_013:0973c23_25"
    },
    {
        "source_sentence": "父即對面封以空盤，令宮嬪送之。",
        "translation": "The father then sealed him with an empty tray facing each other and ordered the courtier to send him off.",
        "source": "T03n0191_013:0973c24_26"
    },
    {
        "source_sentence": "誡曰：「若問何食，但對種種在內。」",
        "translation": "He admonished them, If you ask what food to eat, it's just various kinds of food inside.",
        "source": "T03n0191_013:0973c25_0"
    },
    {
        "source_sentence": "時天帝釋觀知此事，阿儞嚕馱昔曾以食供辟支佛，今日云何令其無食？",
        "translation": "Knowing this, Śakra Devānām-Indra observed that Anuruddha had once offered food to the pratyekabuddhas in the past, so how could he make them lack food today?",
        "source": "T03n0191_013:0973c25_1"
    },
    {
        "source_sentence": "乃化種種珍美品饌滿彼空盤。",
        "translation": "He then transformed various delicious foods to fill the empty tray.",
        "source": "T03n0191_013:0973c27_2"
    },
    {
        "source_sentence": "女使至彼，阿儞嚕馱問言：「何物？」",
        "translation": "When the woman's messenger arrived there, Anuruddha asked, What is it?",
        "source": "T03n0191_013:0973c28_3"
    },
    {
        "source_sentence": "宮嬪心嗔，不依誡勅答言：「無物。」",
        "translation": "The palace officials became angry and didn't rely on the admonition, replying, Nothing.",
        "source": "T03n0191_013:0973c28_4"
    },
    {
        "source_sentence": "阿儞嚕馱即思念曰：「父母云何送空盤耶？」",
        "translation": "Anuruddha then thought to himself, How did his parents send the empty tray?",
        "source": "T03n0191_013:0973c29_5"
    },
    {
        "source_sentence": "乃開封視之，異饌滿中人所罕見，馨香馚馥園苑皆滿。",
        "translation": "He then entrusted the monk with the throne to examine it. The extraordinary delicacies were rarely seen among the people of Pūrvavideha, and all the fragrant gardens and pleasure groves were filled with exquisite odors and",
        "source": "T03n0191_013:0974a01_6"
    },
    {
        "source_sentence": "阿儞嚕馱意亦深怪，問彼女言：「本有食耶？",
        "translation": "Anuruddha was also deeply surprised, and asked the woman, Is there food in the past?",
        "source": "T03n0191_013:0974a02_7"
    },
    {
        "source_sentence": "本空盤耶？」",
        "translation": "Is the originally empty tray?",
        "source": "T03n0191_013:0974a03_8"
    },
    {
        "source_sentence": "女曰：「空盤。」",
        "translation": "The woman said, An empty tray.",
        "source": "T03n0191_013:0974a03_9"
    },
    {
        "source_sentence": "遂却以此食奉上父母。",
        "translation": "He then offered this food to his parents.",
        "source": "T03n0191_013:0974a04_10"
    },
    {
        "source_sentence": "父母見食亦大驚怪，又以此食示摩賀曩摩：「汝看此食，是彼化出。",
        "translation": "Seeing this food, the parents were also greatly surprised and showed it to Mahāmaudgalyāyana with their food, saying, Look at this food; it's his apparition.",
        "source": "T03n0191_013:0974a04_11"
    },
    {
        "source_sentence": "彼阿嚕馱人皆愛樂，我言大福非汝等力，汝初不信，今已驗知。」",
        "translation": "Those arbudas are all delighted, and I say that great merit isn't due to your power; you didn't believe it at first, but now you've proven it.",
        "source": "T03n0191_013:0974a06_12"
    },
    {
        "source_sentence": "摩賀曩摩白父母言：「彼既大福可令出家，我今無福非出家者。」",
        "translation": "Mahāmaudgalyāyana said to his parents, Since they're so greatly blessed that they can be allowed to leave home, now there's no merit for me that isn't a renunciant.",
        "source": "T03n0191_013:0974a07_13"
    },
    {
        "source_sentence": "父母即謂阿儞嚕馱曰：「王今有勅，汝出家否？」",
        "translation": "His parents then said to Anuruddha, Now that the king has an edict, will you leave home?",
        "source": "T03n0191_013:0974a08_14"
    },
    {
        "source_sentence": "對曰：「出家有何利益？",
        "translation": "He said, What's the benefit of leaving home?",
        "source": "T03n0191_013:0974a09_15"
    },
    {
        "source_sentence": "在家有何過失？」",
        "translation": "What's wrong with being at home?",
        "source": "T03n0191_013:0974a10_16"
    },
    {
        "source_sentence": "父母言：「出家之人當證涅槃，可受天上人間第一供養。",
        "translation": "The parents said, A renunciant who will realize nirvāṇa can be offered the highest offering among gods and humans.",
        "source": "T03n0191_013:0974a10_17"
    },
    {
        "source_sentence": "若人在家、出家，真實離欲，亦得天上人間供養；",
        "translation": "If those who remain householders and those who have renounced the world are genuinely free from desire, they can also be offered support by gods and humans.",
        "source": "T03n0191_013:0974a12_18"
    },
    {
        "source_sentence": "若是在家妄稱出家，當感三惡道報。」",
        "translation": "If someone at home falsely calls themselves renunciant and leaves home, they'll experience the results of the three bad destinies.",
        "source": "T03n0191_013:0974a13_19"
    },
    {
        "source_sentence": "對曰：「出家在家得利失利我已曉了，今欲出家，上副王命。」",
        "translation": "He replied, I've understood the benefits and disadvantages of leaving home at home, but now I want to leave home, as instructed by the king.",
        "source": "T03n0191_013:0974a14_0"
    },
    {
        "source_sentence": "父母告曰：「汝言大善。」",
        "translation": "His parents told him, You say it's very good.",
        "source": "T03n0191_013:0974a15_1"
    },
    {
        "source_sentence": "時阿儞嚕馱有一同年，名曰賢王，最相知見，乃往彼處而相告白。",
        "translation": "At the time, there was a fellow monk named King of Goodness in Anuruddha who knew most about each other and went to that place to confess.",
        "source": "T03n0191_013:0974a15_2"
    },
    {
        "source_sentence": "至賢王門方聞品琴，又值絃斷五音不足，阿儞嚕馱擅琴之聲止立不進，",
        "translation": "At the gate of King Aśoka’s house they could hear the lute, but when they encountered a string and cut off the five sounds that were not enough to be heard, the sound of the arbuda playing the lute stood still and did not advance.",
        "source": "T03n0191_013:0974a17_3"
    },
    {
        "source_sentence": "待其調品令人入報。",
        "translation": "They'll wait for their adjustment to cause them to enter the rewards.",
        "source": "T03n0191_013:0974a18_4"
    },
    {
        "source_sentence": "賢王請入，謂阿儞嚕馱曰：「汝來何時？」",
        "translation": "The king of goodness invited him to enter and said to Anuruddha, When are you coming?",
        "source": "T03n0191_013:0974a19_5"
    },
    {
        "source_sentence": "答曰：「琴絃初斷我已到門，待其調品方令入報。」",
        "translation": "He answered, When the string of the lute was first cut off, I went to the door and waited for it to be tuned before I could enter its reward.",
        "source": "T03n0191_013:0974a20_6"
    },
    {
        "source_sentence": "賢王稱善執手請坐：「汝今何來？」",
        "translation": "The king of goodness called Shan, holding his hand and inviting him to sit down, Where are you coming from now?",
        "source": "T03n0191_013:0974a21_7"
    },
    {
        "source_sentence": "對曰：「淨飯王有勅，令釋族出家，意欲眷屬侍佛左右，以汝慕善故來相報。」",
        "translation": "He said, King Śuddhodana had an edict that the Śākyas were to leave home and want their retinues to attend the Buddha's left and right, so they'll come to repay you because you love goodness.",
        "source": "T03n0191_013:0974a21_8"
    },
    {
        "source_sentence": "賢王曰：「勅旨纔下尋亦便知，汝既出家我亦同往，汝可今夜宿於我舍。」",
        "translation": "The good king said, I'll just ask you to go down and find out as soon as you leave home, and I'll go with you; you may stay at my house tonight.",
        "source": "T03n0191_013:0974a23_9"
    },
    {
        "source_sentence": "阿儞嚕馱隨言即止。",
        "translation": "Anuruddha then stopped as he said.",
        "source": "T03n0191_013:0974a25_10"
    },
    {
        "source_sentence": "賢王令人為敷臥處，至夜眠睡無少安樂。",
        "translation": "The king of the wise men asked him to lay down a bed for him, and he spent the night in sleep with little peace and comfort.",
        "source": "T03n0191_013:0974a25_11"
    },
    {
        "source_sentence": "明晨相見，賢王問言：「得安睡否？」",
        "translation": "When they met in the morning, the good king asked, Can you sleep soundly?",
        "source": "T03n0191_013:0974a26_12"
    },
    {
        "source_sentence": "報言：「不得安睡。」",
        "translation": "He replied, You can't sleep soundly.",
        "source": "T03n0191_013:0974a27_13"
    },
    {
        "source_sentence": "又問：「何故如是？」",
        "translation": "Again, he asked, Why is it like this?",
        "source": "T03n0191_013:0974a27_14"
    },
    {
        "source_sentence": "對曰：「床所鋪者病觸之衣，是以令我不獲安寢。」",
        "translation": "He said, That's why I won't be able to sleep peacefully on the bed because the bed is covered with sick and touching clothes.",
        "source": "T03n0191_013:0974a28_15"
    },
    {
        "source_sentence": "賢王即喚所司侍人，問其緣由自何而得？",
        "translation": "The king of goodness then summoned the attendants in charge and asked, What's the reason for their acquisition?",
        "source": "T03n0191_013:0974a29_16"
    },
    {
        "source_sentence": "對曰：「王初生時敷設餘長，後因疾患曾已受用。」",
        "translation": "He replied, When the king was first born, he spread out his remaining longevity, and later he suffered from illness and experienced it.",
        "source": "T03n0191_013:0974b01_17"
    },
    {
        "source_sentence": "賢王歎曰：「善哉！",
        "translation": "The king of goodness praised him, saying, Good!",
        "source": "T03n0191_013:0974b02_18"
    },
    {
        "source_sentence": "釋族生此異子。」",
        "translation": "The Śākyamuni clan gave birth to this strange child.",
        "source": "T03n0191_013:0974b02_19"
    },
    {
        "source_sentence": "又言：「我出家者，提婆達多次當王位。」",
        "translation": "Again, he said, If I leave home, Devadatta will often become king.",
        "source": "T03n0191_013:0974b02_20"
    },
    {
        "source_sentence": "乃令左右呼提婆達多。",
        "translation": "He then ordered his left and right to call Devadatta.",
        "source": "T03n0191_013:0974b03_21"
    },
    {
        "source_sentence": "到已問言：「我等奉勅咸去出家，未委汝今當何所作？」",
        "translation": "When he arrived, he asked, We've all been instructed to leave home, but what will you do now?",
        "source": "T03n0191_013:0974b04_22"
    },
    {
        "source_sentence": "時提婆達多私自念曰：「若或我言不出家者，即令賢王亦不出家。」",
        "translation": "Devadatta then privately thought to himself, If I say I won't leave home, that will cause the good king to also leave home.",
        "source": "T03n0191_013:0974b05_23"
    },
    {
        "source_sentence": "便以誑言：「我亦出家。」",
        "translation": "He then said with a sigh, I'll leave home, too.",
        "source": "T03n0191_013:0974b06_24"
    },
    {
        "source_sentence": "時彼賢王速以公文奏淨飯王，王乃下勅告示內外：「今賢王、阿儞嚕馱及提婆達多等，",
        "translation": "The king then issued an imperial edict to both the monks and laymen, telling them, “Your majesty, good men, as well as arhats, mendicants, brahmans, hypocrites, sinners, heretics,",
        "source": "T03n0191_013:0974b07_25"
    },
    {
        "source_sentence": "釋種五百人出家，咸可知悉。」",
        "translation": "Five hundred members of the Śākyamuni family left home, and they can all be known.",
        "source": "T03n0191_013:0974b09_26"
    },
    {
        "source_sentence": "勅出之後中外歡喜，唯提婆達多獨自苦惱，意云：「本作方便欲令賢王出家，",
        "translation": "Devadatta alone suffered pain and agony. He thought, “In the past I used skillful means to enable you, king of men of virtue, to renounce household life.",
        "source": "T03n0191_013:0974b10_0"
    },
    {
        "source_sentence": "今或違言有妄語過，使我將來不得王位。」",
        "translation": "Now, if someone contradicts their words and speaks falsely, I won't attain the king's throne in the future.",
        "source": "T03n0191_013:0974b11_1"
    },
    {
        "source_sentence": "於是剛忍隨眾出家。",
        "translation": "So, Vajrapāṇi followed the crowd and left home.",
        "source": "T03n0191_013:0974b12_2"
    },
    {
        "source_sentence": "時淨飯王欲令後代知族尊貴，宣告內外，凡是街衢迨及城隍，一切嚴飾皆使殊勝，",
        "translation": "At that time King Śuddhodana, wishing to let the people of later ages know the nobility of his clan, proclaimed that all the streets and thoroughfares as well as the city walls would be distinguished by their adornments.",
        "source": "T03n0191_013:0974b13_3"
    },
    {
        "source_sentence": "布以淨土灑以香水；",
        "translation": "He spread cloth with pure earth and sprinkled perfume on it.",
        "source": "T03n0191_013:0974b15_0"
    },
    {
        "source_sentence": "復排幢幡、傘蓋、散花燒香，以擬賢王等五百釋種出家經過；",
        "translation": "He also arrayed banners, pennants, canopies, scattered flowers, and burned incense to depict the five hundred kinds of Buddhist disciples who had renounced the householder’s life, including King Bhadra",
        "source": "T03n0191_013:0974b15_1"
    },
    {
        "source_sentence": "彼釋種等各各父母，於衢路側及城門首，敷設觀看，亦命相師各相其子，",
        "translation": "Each of those Śākyamunis and others had their own parents, laying out to look at the other side of the road or the city gate. The soothsayers also ordered them to show each other their children.",
        "source": "T03n0191_013:0974b16_2"
    },
    {
        "source_sentence": "誰可出家？",
        "translation": "Who can leave home?",
        "source": "T03n0191_013:0974b18_3"
    },
    {
        "source_sentence": "誰當不可？",
        "translation": "Who will not?",
        "source": "T03n0191_013:0974b18_4"
    },
    {
        "source_sentence": "賢王先出，相師稱歎：「此若出家必證聖道。」",
        "translation": "The king of goodness first came out, and the master of characteristics praised him, saying, If you leave home here, you'll surely realize the noble path.",
        "source": "T03n0191_013:0974b18_5"
    },
    {
        "source_sentence": "阿儞嚕駄次行出城，相師亦云：「得聖非久。」",
        "translation": "Anuruddha then left the city, and the soothsayer also said, It won't be long before you attain sagehood.",
        "source": "T03n0191_013:0974b19_6"
    },
    {
        "source_sentence": "提婆達多出至城門，頭上寶冠忽然墮地，相師見已，「此惡業人，定入地獄。」",
        "translation": "Devadatta went out to the city gates, and the jeweled crown on his head suddenly fell to the ground. Seeing it, the soothsayer said, This bad-karman will surely enter hell.",
        "source": "T03n0191_013:0974b20_7"
    },
    {
        "source_sentence": "又不善人名曰海壽，纔到門際驢作惡聲，相者知之：「此有口業曾謗聲聞，",
        "translation": "An unwholesome man named Haishou came to the entrance of the gate, where the donkey cried out in a bad voice. The characteristicist recognized him, saying, “This is someone whose verbal action once denigrated śrāvakas",
        "source": "T03n0191_013:0974b22_8"
    },
    {
        "source_sentence": "當來果熟定墮惡趣。」",
        "translation": "In the future fruition, they'll surely fall into a bad destiny.",
        "source": "T03n0191_013:0974b24_9"
    },
    {
        "source_sentence": "烏波難陀次出，乘象方至門首瓔珞墮地，乃自下象親手收取。",
        "translation": "Upananda came out one after the other, rode an elephant to the door and dropped his jewelry onto the ground. Then he went down to collect it with his own hands.",
        "source": "T03n0191_013:0974b24_10"
    },
    {
        "source_sentence": "相師言曰：「此鄙悋人，當入地獄。」",
        "translation": "The master of signs said, This despicable man will go to hell.",
        "source": "T03n0191_013:0974b26_0"
    },
    {
        "source_sentence": "如是五百釋種各各出已，相師皆見，咸以善惡具告父母。",
        "translation": "Thus, each of the five hundred Śākyamuni clansmen emerged, and when their teachers saw them, they all told their parents about good and bad things.",
        "source": "T03n0191_013:0974b26_1"
    },
    {
        "source_sentence": "時釋眾等出迦毘羅城，復遊園苑次至佛處，各各白佛云求出家。",
        "translation": "The Śākyamunis and others then left the city of Kapilavastu and went back to the Buddha's place in a park, each telling him to leave home.",
        "source": "T03n0191_013:0974b28_0"
    },
    {
        "source_sentence": "世尊思惟：「今此釋眾雖求出家，有志樂者，有不樂者。」",
        "translation": "The Bhagavān thought, Now, although these Śākyamunis seek to leave home, there are those who have aspirations and those who don't.",
        "source": "T03n0191_013:0974b29_1"
    },
    {
        "source_sentence": "佛以四法度為苾芻。",
        "translation": "The Buddha used the four dharmas to save him as a monk.",
        "source": "T03n0191_013:0974c01_2"
    },
    {
        "source_sentence": "時淨飯王有承事人，名烏波梨，善能剃髮，王即遣與釋眾剃髮，既至彼處不肯與剃，",
        "translation": "When King Śuddhodana had a servant named Upāli who was good at shaving, the king sent him to that place to shave it. But when he arrived there, he would not shave it.",
        "source": "T03n0191_013:0974c02_3"
    },
    {
        "source_sentence": "乃作色煩惱又復悲泣。",
        "translation": "He then became afflicted by the afflictions of form and again wept in sorrow.",
        "source": "T03n0191_013:0974c04_0"
    },
    {
        "source_sentence": "賢王問言：「何以如是？」",
        "translation": "The king of goodness asked, Why is it so?",
        "source": "T03n0191_013:0974c04_1"
    },
    {
        "source_sentence": "烏波梨曰：「我奉一人，非眾所使，可寧捨命，髮不能剃。」",
        "translation": "Upāli said, I'm serving one person who isn't entrusted to others, so why wouldn't you rather give up your life and shave it?",
        "source": "T03n0191_013:0974c05_0"
    },
    {
        "source_sentence": "賢王諫曰：「勿作是言，汝奉王命非眾可使，此有善利請無煩惱。」",
        "translation": "The king of goodness remonstrated, Don't say that; you must obey the king's order and not allow others to do so; this will bring good benefits and invite no affliction.",
        "source": "T03n0191_013:0974c06_1"
    },
    {
        "source_sentence": "賢王復以方便告釋眾曰：「汝等出家，寶冠妙衣及裝嚴具，今日已去咸無所用，",
        "translation": "Again, King Bhadrapāla said to the Śākya clanspeople with skillful means: All of you who have renounced household life need not wear precious crowns, beautiful clothes, or any other adornments for today’s renunciation.",
        "source": "T03n0191_013:0974c07_2"
    },
    {
        "source_sentence": "都置一處與烏波梨，彼聞得者或可歡喜。」",
        "translation": "Put them all in one place and give them to Upāli, and those who hear them may rejoice.",
        "source": "T03n0191_013:0974c09_3"
    },
    {
        "source_sentence": "衣冠既集乃成大聚，時烏波梨即與剃髮。",
        "translation": "When the garments and crowns had gathered, they became a large group, and Upāli shaved them.",
        "source": "T03n0191_013:0974c10_4"
    },
    {
        "source_sentence": "及覩釋眾各各年少捨其富貴，「我今卑族，何所戀耶？",
        "translation": "Each of the Licchavis and Śākyamunis abandoned their riches and wealth when they were young, saying, Now that I'm a lowly family, what do I love?",
        "source": "T03n0191_013:0974c11_5"
    },
    {
        "source_sentence": "宜可棄彼恩愛去離煩惱，免其輪迴生滅之患。」",
        "translation": "It's advisable to abandon that kindness and love, part with the afflictions, and avoid the danger of birth and cessation in its transmigration.",
        "source": "T03n0191_013:0974c12_6"
    },
    {
        "source_sentence": "於是榰頤再三忖度。",
        "translation": "He then repeatedly reflected on it three times.",
        "source": "T03n0191_013:0974c13_7"
    },
    {
        "source_sentence": "尊者舍利弗見而問曰：「汝何榰頤？",
        "translation": "When Venerable Śāriputra saw him, he asked, What are you wearing?",
        "source": "T03n0191_013:0974c14_8"
    },
    {
        "source_sentence": "似有不樂？」",
        "translation": "Does it seem to have unpleasantness?",
        "source": "T03n0191_013:0974c14_9"
    },
    {
        "source_sentence": "答言：「非是不樂，有所思念。」",
        "translation": "He replied, It's not unpleasant; it's something to think about.",
        "source": "T03n0191_013:0974c15_10"
    },
    {
        "source_sentence": "具以情實告舍利弗。",
        "translation": "They told Śāriputra with their true feelings.",
        "source": "T03n0191_013:0974c15_11"
    },
    {
        "source_sentence": "舍利弗謂曰：「世尊度脫非間尊卑，今正是時，宜其猛利。」",
        "translation": "Śāriputra said, Bhagavān, the Bhagavān liberates those who aren't superior or inferior, and now is the right time for him to be so vigorous.",
        "source": "T03n0191_013:0974c16_12"
    },
    {
        "source_sentence": "世尊預知專期根熟，舍利弗將烏波梨來至佛前，五體投地伸其禮敬，白言：「世尊！",
        "translation": "Knowing that the Bhagavān was focusing on maturing his faculties, Śāriputra came before the Buddha with Upāli. He prostrated himself five-legged to the ground in respect and said:",
        "source": "T03n0191_013:0974c17_13"
    },
    {
        "source_sentence": "今烏波梨欲於正法出家，願佛哀愍。」",
        "translation": "Now, Upāli wants to leave home in the right teaching, so may the Buddha have mercy on him.",
        "source": "T03n0191_013:0974c19_14"
    },
    {
        "source_sentence": "佛告烏波梨言：「汝得梵行。」",
        "translation": "The Buddha told Upāli, You've attained the religious practice.",
        "source": "T03n0191_013:0974c20_15"
    },
    {
        "source_sentence": "世尊言訖，鬚髮自落袈裟著身，後七日中鬚髮再出，威儀庠序如百臘苾芻，",
        "translation": "When the World-honored One had finished his discourse, his hair stood on end and his hair stood on end. After seven days his hair stood on end and his hair stood on end again. His demeanor was as if he were a hundred years old.",
        "source": "T03n0191_013:0974c20_16"
    },
    {
        "source_sentence": "「我今於如來，　　正法求出家，",
        "translation": "“Now, I seek to leave home with the true teaching of the Tathāgata.",
        "source": "T03n0191_013:0974c22_17"
    },
    {
        "source_sentence": "　佛言得梵行，　　鬚髮尋自落，",
        "translation": "The Buddha said he had attained the practice of austerity, and his hair fell off on its own.",
        "source": "T03n0191_013:0974c22_17"
    },
    {
        "source_sentence": "　袈裟亦著身；　　此即從善本，",
        "translation": "The monk’s robe also touched his body, which was the root of virtue.",
        "source": "T03n0191_013:0974c22_17"
    },
    {
        "source_sentence": "　今日方成熟，　　故我為苾芻。」",
        "translation": "Today, I'm a monk because I'm only now ripe.",
        "source": "T03n0191_013:0974c22_17"
    },
    {
        "source_sentence": "自說伽陀曰：爾時世尊告大眾言：「今出家者，可依夏臘次第守其尊卑，",
        "translation": "He said to himself, Bhagavān, the Bhagavān then addressed the great assembly, saying, Now that you've renounced home, you can follow the order of the summer months and keep up your rank.",
        "source": "T03n0191_013:0974c22_17"
    },
    {
        "source_sentence": "乃至未來禮不得闕。」",
        "translation": "It won't be missing even in future rituals.",
        "source": "T03n0191_013:0974c28_18"
    },
    {
        "source_sentence": "於是烏波梨平視諸釋。",
        "translation": "Upāli then looked at the Śākyamunis equally.",
        "source": "T03n0191_013:0974c28_19"
    },
    {
        "source_sentence": "時彼賢王次第禮眾，至烏波梨前不肯禮拜，來白世尊：「今烏波梨是承事人，",
        "translation": "The wise king then bowed to the crowd in order and went to Upāli, but he refused to venerate him. He came to the World-honored One and said:",
        "source": "T03n0191_013:0974c29_20"
    },
    {
        "source_sentence": "今我禮者是不順也。」",
        "translation": "Now, I'm paying homage to someone who doesn't obey.",
        "source": "T03n0191_013:0975a01_21"
    },
    {
        "source_sentence": "佛言：「汝既出家當除我相，彼是上臘宜伸禮敬。」",
        "translation": "The Buddha said, Since you've left home, you must remove your marks of self, and it's appropriate to extend homage to him for the above-mentioned year.",
        "source": "T03n0191_013:0975a02_22"
    },
    {
        "source_sentence": "賢王纔禮，地六振動。",
        "translation": "As soon as King Bhadra paid his respects the earth shook in six ways.",
        "source": "T03n0191_013:0975a03_23"
    },
    {
        "source_sentence": "次提婆達多亦不肯禮，又來白佛。",
        "translation": "Next, Devadatta refused to pay homage and came back to tell the Buddha.",
        "source": "T03n0191_013:0975a03_24"
    },
    {
        "source_sentence": "佛言：「出家之人當除我相，彼是上臘宜可禮足。」",
        "translation": "The Buddha said, A renunciant should remove my characteristics; it's better for him to bow his feet at the top of their hair.",
        "source": "T03n0191_013:0975a04_25"
    },
    {
        "source_sentence": "於是諸釋無不禮者。",
        "translation": "There's no one among the Śākyamunis who doesn't venerate him.",
        "source": "T03n0191_013:0975a05_26"
    },
    {
        "source_sentence": "諸苾芻等各各心疑：「今賢王禮拜，地六種動，有何因緣？",
        "translation": "Each of the monks and others had doubts in their minds, Now that the good king is paying homage, what are the causes and conditions for the six kinds of earthquakes?",
        "source": "T03n0191_013:0975a06_27"
    },
    {
        "source_sentence": "唯願世尊，解諸疑網。」",
        "translation": "Please, Bhagavān, understand the web of doubt.",
        "source": "T03n0191_013:0975a07_28"
    },
    {
        "source_sentence": "佛言：「過去世時此閻浮提波羅奈國，有王統御，名曰梵壽，國界豐盛人民快樂。",
        "translation": "The Buddha said, In a past life, this country of Jambudvīpa was ruled by a king named Brahmashou, whose territory was prosperous and his people were happy.",
        "source": "T03n0191_013:0975a07_29"
    },
    {
        "source_sentence": "時彼城中有一娼女，名跋捺囉，色相端嚴人所愛羨。",
        "translation": "In that city, there was a prostitute named Upankara, whose appearance was dignified and desirable to people.",
        "source": "T03n0191_013:0975a09_30"
    },
    {
        "source_sentence": "有一男子，名孫那囉摩拏嚩迦，往彼女處言意相慕；",
        "translation": "There was a man named Suna Rāmaputra, who went to that woman’s place and said he wished to see her.",
        "source": "T03n0191_013:0975a10_31"
    },
    {
        "source_sentence": "女即報云：『備五百金錢可來相見。』",
        "translation": "The woman then replied, 'I'll give you five hundred coins to meet you.'",
        "source": "T03n0191_013:0975a12_32"
    },
    {
        "source_sentence": "是人貧匱莫副所言，別以方便而親附之，遂移居相隣時奉花果，後因節序男女作樂，",
        "translation": "That man, poor and helpless, didn't share what he said. He separately attached himself to them with skillful means, so he moved to live next door and offered flowers and fruits at the time. Later, due to seasonal conditions, men and women made music",
        "source": "T03n0191_013:0975a12_33"
    },
    {
        "source_sentence": "嚴身戴花各衒其美。",
        "translation": "Each of them adorned themselves with flowers to show their beauty.",
        "source": "T03n0191_013:0975a14_34"
    },
    {
        "source_sentence": "時跋捺囉起思念曰：『孫那囉摩拏嚩迦，彼人若來共作喜樂。』",
        "translation": "Upananda then had this thought, saying, 'Sunna Rāmaṇḍika, that person will be delighted if they come together.'",
        "source": "T03n0191_013:0975a15_35"
    },
    {
        "source_sentence": "須臾來至。",
        "translation": "In a moment, he arrived.",
        "source": "T03n0191_013:0975a16_36"
    },
    {
        "source_sentence": "女即喜曰：『可取花來與汝作樂。』",
        "translation": "The woman then rejoiced and said, 'Take the flowers and bring them to you for pleasure.'",
        "source": "T03n0191_013:0975a16_37"
    },
    {
        "source_sentence": "孫那囉摩拏嚩迦此日有事，心極煩惱通宵無睡，及天將曉熟寐不覺，眾人取花好者已盡，",
        "translation": "Suna Rāmaputra had some business on this day, and his mind was so greatly troubled that he didn’t sleep all night long. When the gods were about to awaken at dawn, he slept without waking. All the people gather",
        "source": "T03n0191_013:0975a17_38"
    },
    {
        "source_sentence": "乃得尸利沙花。",
        "translation": "He then obtained a flower of Śāriputra.",
        "source": "T03n0191_013:0975a19_39"
    },
    {
        "source_sentence": "「『戒不精進業，　　怠墮重睡眠；",
        "translation": "'戒戒不精進業, 怠墮重睡眠;",
        "source": "T03n0191_013:0975a20_0"
    },
    {
        "source_sentence": "　　眾採好花去，　　得尸利沙花。』",
        "translation": "The crowd gathered good flowers and departed, and they found the Śāriputra flower.'",
        "source": "T03n0191_013:0975a20_0"
    },
    {
        "source_sentence": "將與彼女，彼女不悅，即說偈言：「又復告言：『汝求別花。』",
        "translation": "He was about to give it to the woman, who didn't like it and said in verse, Again, he told her, 'Seek another flower.'",
        "source": "T03n0191_013:0975a20_0"
    },
    {
        "source_sentence": "時初秋月暑氣猶欝，乃再去尋花，以至中午採花唱歌都不覺熱。",
        "translation": "In the first month of autumn, when the hot air was still cool, he went back to search for flowers and collected flowers at midday to sing and sing without feeling fever.",
        "source": "T03n0191_013:0975a23_1"
    },
    {
        "source_sentence": "值梵壽王入草詣林避熱，忽聞歌唱，令人尋求，見已呼來，乃謂之曰：『日光下照如火燒腦，",
        "translation": "When King Brahmashou entered the grass and went into the forest to avoid heat, he suddenly heard a song of music that caused people to seek it out. Seeing it, he summoned [the god Brahmā] and said to him, “The",
        "source": "T03n0191_013:0975a24_2"
    },
    {
        "source_sentence": "云何歌唱都無所苦？』",
        "translation": "How can singing be painless?'",
        "source": "T03n0191_013:0975a26_3"
    },
    {
        "source_sentence": "「『我心迷故，　　非日不照；",
        "translation": "'It's because my mind is deluded that it doesn't shine without the sun.",
        "source": "T03n0191_013:0975a27_4"
    },
    {
        "source_sentence": "　　為事有少，　　故不知苦。』",
        "translation": "Because there are few things, they don't know suffering.'",
        "source": "T03n0191_013:0975a27_4"
    },
    {
        "source_sentence": "即以伽陀對曰：「時王思惟：『此採花人能言。』",
        "translation": "He said to Gadha, The king then thought, 'This flower collector can say.'",
        "source": "T03n0191_013:0975a27_4"
    },
    {
        "source_sentence": "乃留與語。",
        "translation": "He then stayed and talked to him.",
        "source": "T03n0191_013:0975b01_5"
    },
    {
        "source_sentence": "王曰：『我出值熱來此求涼，汝可以言解我熱惱。』",
        "translation": "The king said, 'I came out to meet a fever and came here to seek coolness, so you can say that you understand my fever.'",
        "source": "T03n0191_013:0975b01_6"
    },
    {
        "source_sentence": "孫那囉摩拏嚩迦本有智慧所言稱旨，乃說征伐之利，投王心機。",
        "translation": "Sunna Rāmaputra, who was originally wise and well-intentioned in what he said, explained the benefits of his expedition and cast them into the king's mind.",
        "source": "T03n0191_013:0975b02_7"
    },
    {
        "source_sentence": "王聞歎奇即忘熱惱，宣問大臣：『有於剎帝利灌頂王所假身命難者，最上之賜，",
        "translation": "When the king heard this marvel, he forgot about the fever and asked his ministers, 'There's a difficulty with the body and life of the kṣatriya consecrated king that is bestowed by the highest reward.",
        "source": "T03n0191_013:0975b04_8"
    },
    {
        "source_sentence": "國有何典？』",
        "translation": "What's the scripture that exists in a country?'",
        "source": "T03n0191_013:0975b06_9"
    },
    {
        "source_sentence": "大臣對曰：『可與儲君。』",
        "translation": "The minister replied, 'You can give it to the treasurer.'",
        "source": "T03n0191_013:0975b06_10"
    },
    {
        "source_sentence": "即勅大臣冊居其位，告報內外准式備儀，禮赴春宮尊處儲貳，凡日受用無非珍寶，",
        "translation": "He ordered his ministers to take up their seats in the throne, notifying the officials both inside and outside the palace according to the proper rules and regulations. They went to the treasury storehouse of the venerable quarters of the spring pala",
        "source": "T03n0191_013:0975b06_11"
    },
    {
        "source_sentence": "寢臥之所茵褥異常。",
        "translation": "The mattress on which he sleeps and lays is unusual.",
        "source": "T03n0191_013:0975b08_12"
    },
    {
        "source_sentence": "孫那囉摩拏嚩迦私自惟曰：『儲君若此，尊極可知。』",
        "translation": "Sunna Rāmaputra thought to himself, 'If you store it here, the honored one can know it.'",
        "source": "T03n0191_013:0975b09_13"
    },
    {
        "source_sentence": "便起貪心欲謀大寶，纔發斯念便自覺知：『我或如斯，堪云來報？』",
        "translation": "He then became greedy and wanted to steal the great treasure, and as soon as he had this thought aroused, he realized for himself, 'Suppose I do so, is it possible to say that I'll be rewarded?'",
        "source": "T03n0191_013:0975b10_14"
    },
    {
        "source_sentence": "由是追悔寢不安處，乃施麤席臥於地上。",
        "translation": "Because of this, he repented and slept in an uncomfortable place, so he gave him a cushioned seat and lay down on the ground.",
        "source": "T03n0191_013:0975b11_15"
    },
    {
        "source_sentence": "至明旦已，王即遣使觀其動止，乃見孫那囉摩拏嚩迦臥於地上，速來白王：『此非儲君，",
        "translation": "The next morning the king sent an envoy to observe his movements. Seeing Suna Rāmaputra lying on the ground, he came quickly and said to the king, “Your majesty, this is not a treasury councilor.",
        "source": "T03n0191_013:0975b12_16"
    },
    {
        "source_sentence": "乃賤人爾！』",
        "translation": "That's a lowly person!'",
        "source": "T03n0191_013:0975b14_17"
    },
    {
        "source_sentence": "王曰：『何知？』",
        "translation": "The king said, 'What do you know?'",
        "source": "T03n0191_013:0975b14_18"
    },
    {
        "source_sentence": "具事上聞。",
        "translation": "It's fully explained in the above-mentioned hearing.",
        "source": "T03n0191_013:0975b15_19"
    },
    {
        "source_sentence": "王曰：『此大智人，非是賤士。』",
        "translation": "The king said, 'This great wise man isn't a lowly man.'",
        "source": "T03n0191_013:0975b15_20"
    },
    {
        "source_sentence": "乃令詔來詢問其故。",
        "translation": "He then ordered an imperial edict to come and inquire about the reason for it.",
        "source": "T03n0191_013:0975b15_21"
    },
    {
        "source_sentence": "王曰：『夜不寢床臥於地者何意？』",
        "translation": "The king said, 'What's the meaning of someone who doesn't sleep on a bed or lying on the ground at night?'",
        "source": "T03n0191_013:0975b16_22"
    },
    {
        "source_sentence": "對曰：『貴非究竟，所以不樂。』",
        "translation": "He replied, 'The value is not ultimate, so it's not pleasant.'",
        "source": "T03n0191_013:0975b17_23"
    },
    {
        "source_sentence": "王曰：『汝意如何？』",
        "translation": "The king said, 'What do you think?'",
        "source": "T03n0191_013:0975b17_24"
    },
    {
        "source_sentence": "『今欲出家。』",
        "translation": "'Now, I want to leave home.'",
        "source": "T03n0191_013:0975b18_25"
    },
    {
        "source_sentence": "王復言曰：『未知此事。",
        "translation": "The king again said, 'I don't know this matter.",
        "source": "T03n0191_013:0975b18_26"
    },
    {
        "source_sentence": "云何出家？",
        "translation": "How do you leave home?",
        "source": "T03n0191_013:0975b18_27"
    },
    {
        "source_sentence": "有何功德？』",
        "translation": "What merit is there?'",
        "source": "T03n0191_013:0975b19_0"
    },
    {
        "source_sentence": "答言：『於寂靜處苦節修行，亦無聖師，亦不求侶，觀緣究理證獨覺菩提。』",
        "translation": "He replied, 'There's no no no noble teacher or companion who cultivates the practice of the painful section in a tranquil place, and he doesn't seek companions to examine conditions and investigate principles to realize the enlightenment of the soli",
        "source": "T03n0191_013:0975b19_1"
    },
    {
        "source_sentence": "王即稱善放令出家。",
        "translation": "The king then called Shan放 and ordered him to leave home.",
        "source": "T03n0191_013:0975b20_2"
    },
    {
        "source_sentence": "後證道果來至王前，於虛空中現神變相，王覩是事深生歸信，五體投地以伸敬禮，",
        "translation": "When the Master had attained enlightenment he came before the king and manifested miraculous signs in the sky. Having seen these signs, the king gave rise to a feeling of deep faith and prostrated himself on the ground with his five bodies",
        "source": "T03n0191_013:0975b21_3"
    },
    {
        "source_sentence": "「『善哉智慧人，　　非惡業能繫；",
        "translation": "Good, O wise man! It is not possible to be bound by evil deeds.",
        "source": "T03n0191_013:0975b23_4"
    },
    {
        "source_sentence": "　　求寂靜修行，　　證獨覺菩提。』",
        "translation": "Seeking quiescence and cultivating practice, he realizes the enlightenment of the solitary realizer.'",
        "source": "T03n0191_013:0975b23_4"
    },
    {
        "source_sentence": "即說伽陀曰：「說伽陀已。",
        "translation": "He then explained the verse to Gadha, saying, After explaining it to him, he said.",
        "source": "T03n0191_013:0975b23_4"
    },
    {
        "source_sentence": "又復言云：『若有諸摩拏嚩迦，出家求道我即隨喜。』",
        "translation": "Again, he said, 'If there are māṭika renunciants who leave home and seek the path, I'll follow them.'",
        "source": "T03n0191_013:0975b26_5"
    },
    {
        "source_sentence": "時有近臣名殑誐波羅，聞此偈已忻樂非常，記憶在心誡其貪愛。",
        "translation": "At the time, there was a near minister named Upāli who heard this verse and became delighted with extreme joy when he heard it, remembering it in his mind to admonish him for craving.",
        "source": "T03n0191_013:0975b27_6"
    },
    {
        "source_sentence": "王因此後亦自勗勵，乃踈宮室多樂寂靜。",
        "translation": "Consequently, the king later became self-indulgent and lived in a peaceful quietude in his palace.",
        "source": "T03n0191_013:0975b28_7"
    },
    {
        "source_sentence": "殑誐波羅後接王喜遂求出家，王既允許拜辭而出，即詣深山逢苦行仙人，",
        "translation": "Upāla then accepted the king’s invitation and asked to renounce the householder’s life. The king consented, paid his respects, and departed. So he went deep into the mountains to meet the holy monk Sadāparvata.",
        "source": "T03n0191_013:0975b29_8"
    },
    {
        "source_sentence": "便隨學道精勤策勵，亦證五通。",
        "translation": "He then followed the path of training, exerted himself energetically, and also realized the five supernormal powers.",
        "source": "T03n0191_013:0975c02_9"
    },
    {
        "source_sentence": "徑來王前現其神變，王乃問曰：『汝得如是功德耶？』",
        "translation": "When the king came before him and showed his miraculous transformation, the king asked, 'Have you attained such merit?'",
        "source": "T03n0191_013:0975c03_10"
    },
    {
        "source_sentence": "答曰：『我證。』",
        "translation": "He answered, 'I'll realize it.'",
        "source": "T03n0191_013:0975c04_11"
    },
    {
        "source_sentence": "王謂證聖，便禮其足，頭纔至地地即振動。",
        "translation": "The king, thinking that he had attained sainthood, bowed his head at his feet and shook it as soon as he touched the ground.",
        "source": "T03n0191_013:0975c04_12"
    },
    {
        "source_sentence": "「『若根本出家，　　禮事於沙門；",
        "translation": "'Suppose someone fundamentally leaves home and pays homage to the ascetic.",
        "source": "T03n0191_013:0975c05_13"
    },
    {
        "source_sentence": "　　寂默及精進，　　苦行成緣覺。",
        "translation": "Silent and diligent, they practice austerities to become pratyekabuddhas.",
        "source": "T03n0191_013:0975c05_13"
    },
    {
        "source_sentence": "　　一切罪永滅，　　一切福業生；",
        "translation": "All sins are forever extinguished, And all virtuous deeds arise.",
        "source": "T03n0191_013:0975c05_13"
    },
    {
        "source_sentence": "　　後於諸世間，　　廣利樂眾生。』」",
        "translation": "Later, in all the worlds, he'll extensively benefit sentient beings.'",
        "source": "T03n0191_013:0975c05_13"
    },
    {
        "source_sentence": "是時王母察此非真，乃為殑誐波羅說伽陀曰：佛告諸苾芻：「昔梵壽王者，",
        "translation": "Seeing this as untrue, the king’s mother said to Ambapālī, “The Buddha told the monks and nuns, saying:",
        "source": "T03n0191_013:0975c05_13"
    },
    {
        "source_sentence": "今賢王是；",
        "translation": "This is the present-day wise king.",
        "source": "T03n0191_013:0975c11_14"
    },
    {
        "source_sentence": "殑誐波羅者，烏波梨是；",
        "translation": "Upāli means Upāli.",
        "source": "T03n0191_013:0975c11_15"
    },
    {
        "source_sentence": "往昔禮拜地已振動，今日致禮與本無殊。",
        "translation": "Formerly the ground for paying homage had shaken, but today’s greeting is no different from the original one.",
        "source": "T03n0191_013:0975c12_16"
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Monks!",
        "source": "T03n0191_013:0975c13_17"
    },
    {
        "source_sentence": "此過去、現在種種之事，今為汝等再分別說，汝等聞者宜其諦信。」",
        "translation": "These various things of the past and present are now explained for you to discern again, so it's advisable for you who hear them to believe in them.",
        "source": "T03n0191_013:0975c13_18"
    },
    {
        "source_sentence": "時諸苾芻聞此說已，歡喜踊躍，禮佛而退。",
        "translation": "After hearing this teaching, the monks rejoiced and jumped for joy. They bowed to the Buddha and withdrew.",
        "source": "T03n0191_013:0975c15_0"
    },
    {
        "source_sentence": "佛說眾許摩訶帝經卷第十三",
        "translation": "Foshuo zhixiang moha di jing, vol. 13",
        "source": "T03n0191_013:0975c16_0"
    }
]