[
    {
        "source_sentence": "大乘悲分陀利經卷第四",
        "translation": "*Mahayana-paripṛcchā(sūtra), Volume 4",
        "source": "T03n0158_004:0256b12_0"
    },
    {
        "source_sentence": "失三藏名今附秦錄",
        "translation": "lost the name of the Tripiṭaka, which is now appended to the Qin records",
        "source": "T03n0158_004:0256b14_0"
    },
    {
        "source_sentence": "十千人授記品第十",
        "translation": "Ten Thousand Teachings Chapter 10",
        "source": "T03n0158_004:0256b15_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0256b16_0"
    },
    {
        "source_sentence": "於爾時十千懈怠者同發聲言：『唯！",
        "translation": "At that point, 10,000 lazy people all spoke together, saying, 'Yes!",
        "source": "T03n0158_004:0256b16_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0256b16_2"
    },
    {
        "source_sentence": "我等欲於淨佛土中，成如來、應供、正遍知，所謂世界普賢菩薩行菩薩行所修淨處，",
        "translation": "In the pure buddha-lands we want to become buddhas, worthy of offerings, and fully enlightened. This is called the world where Universally Good enlightening beings practice and purify themselves.",
        "source": "T03n0158_004:0256b17_3"
    },
    {
        "source_sentence": "如是我等行六波羅蜜，滿於佛土逮成正覺。』",
        "translation": "Thus, we practice the six perfections and fulfill them in the Buddha's land to attain perfect enlightenment.'",
        "source": "T03n0158_004:0256b18_4"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0256b19_5"
    },
    {
        "source_sentence": "寶藏如來亦復如是，授彼十千懈怠者記：『如普賢菩薩成阿耨多羅三藐三菩提時，",
        "translation": "The Buddha Jewel-Store is also like this, bestowing on those 10,000 lazy people the prediction that when the enlightening being Universally Good achieves unexcelled complete perfect enlightenment,",
        "source": "T03n0158_004:0256b20_6"
    },
    {
        "source_sentence": "汝等亦於周匝世界，成阿耨多羅三藐三菩提。",
        "translation": "You also attain supreme perfect enlightenment in the world that surrounds you.",
        "source": "T03n0158_004:0256b22_7"
    },
    {
        "source_sentence": "有千人同號智熾鍾自在聲如來；",
        "translation": "There were a thousand people there, all called Zhixiangzhong zhizhong zheng freely sounding thus-come buddha.",
        "source": "T03n0158_004:0256b23_8"
    },
    {
        "source_sentence": "復有千人同號攝自在師子音如來；",
        "translation": "There were also one thousand buddhas, all named Sovereign Sound of the Lion-Sound Buddha.",
        "source": "T03n0158_004:0256b23_9"
    },
    {
        "source_sentence": "復有千人同號無垢聲自在王如來；",
        "translation": "Again, there were one thousand buddhas of the same name, called independent king with unblemished voice.",
        "source": "T03n0158_004:0256b24_10"
    },
    {
        "source_sentence": "復有千人同號除恐畏音自在王如來；",
        "translation": "There were also a thousand other buddhas, the Tathāgata Fearlessness-Abandonment King Sound of freedom from fear.",
        "source": "T03n0158_004:0256b25_11"
    },
    {
        "source_sentence": "復有千人同號善無垢聲光曜自在王如來；",
        "translation": "Again, there were one thousand buddhas of the same name, Sovereign Enlightenment King Sunlike Radiance with Good and Immaculate Sound.",
        "source": "T03n0158_004:0256b26_12"
    },
    {
        "source_sentence": "復有五百人同號日明如來；",
        "translation": "Again, there were five hundred buddhas of the same name named Sunlight.",
        "source": "T03n0158_004:0256b27_13"
    },
    {
        "source_sentence": "復有五百人同號日藏自在王如來；",
        "translation": "Again, there were five hundred buddhas of the same name, Universal King Sun-Store Tathāgata.",
        "source": "T03n0158_004:0256b28_14"
    },
    {
        "source_sentence": "復七號龍雷如來；",
        "translation": "Again, there was the seventh buddha named Dragon Thunder Tathāgata.",
        "source": "T03n0158_004:0256b28_15"
    },
    {
        "source_sentence": "八號無畏稱王無垢光如來；",
        "translation": "The eighth is the Tathāgata Fearlessly Called King Undefiled Light of Immaculate Conception.",
        "source": "T03n0158_004:0256b29_16"
    },
    {
        "source_sentence": "十號無光音如來；",
        "translation": "The tenth epithet is the Tathāgata of Lightless Sound.",
        "source": "T03n0158_004:0256b29_17"
    },
    {
        "source_sentence": "十一號稱自在聲開法稱音如來；",
        "translation": "The eleventh epithet is called independent sound, revealing the Teaching and Sound of Universal Sound.",
        "source": "T03n0158_004:0256c01_18"
    },
    {
        "source_sentence": "九號德法稱王如來；",
        "translation": "The ninth was the enlightened Tathāgata Virtuous Dharma Calling King, a buddha named King.",
        "source": "T03n0158_004:0256c02_19"
    },
    {
        "source_sentence": "二十號不可思議意王如來；",
        "translation": "The enlightening being Universally Good was a buddha named King of Inconceivable Thoughts.",
        "source": "T03n0158_004:0256c02_20"
    },
    {
        "source_sentence": "三號寶幢月自在照牟尼智自在牆微無味王不可思議意智藏如來；",
        "translation": "The third is the buddha Jewel Banner Moon independently Shining Like a Self-illuminating Sage of the Three Names, the self-contained wall of knowledge of the sages who are free from all obstacles.",
        "source": "T03n0158_004:0256c03_21"
    },
    {
        "source_sentence": "十五號智高幢如來；",
        "translation": "The fifteenth is the Tathāgata Supreme Banner of Knowledge.",
        "source": "T03n0158_004:0256c04_22"
    },
    {
        "source_sentence": "五十號智海王如來；",
        "translation": "“Great enlightening being Universally Enlightened One is a buddha named King of the Ocean of Knowledge.",
        "source": "T03n0158_004:0256c05_23"
    },
    {
        "source_sentence": "二號大精進音自在王高德劫如來；",
        "translation": "The second is the buddha named Great Energy-Sound independent king of great effort, the supremely virtuous eon of enlightenment.",
        "source": "T03n0158_004:0256c05_24"
    },
    {
        "source_sentence": "八十號智無塵疾如來；",
        "translation": "The eighty-eighty epithets of knowledge are the Tathāgata Dustless Ailment.",
        "source": "T03n0158_004:0256c06_25"
    },
    {
        "source_sentence": "九十號自在種如來；",
        "translation": "“Great enlightening beings also have ninety epithets, namely,",
        "source": "T03n0158_004:0256c07_26"
    },
    {
        "source_sentence": "一百號智善無垢雷自在如來；",
        "translation": "“Great enlightening being Universally Enlightened One is the one hundredth buddha, knowledgeable, good, undefiled thusness free from all afflictions.",
        "source": "T03n0158_004:0256c07_27"
    },
    {
        "source_sentence": "八十號非食德海王智集力王如來；",
        "translation": "The eighty-eighty epithets are not food for the enlightened:",
        "source": "T03n0158_004:0256c08_28"
    },
    {
        "source_sentence": "四十號勝菩提自在王如來、牟尼積疾華如來、積德智意如來、金剛師子戒光音如來、賢上如來、無量光明如來；",
        "translation": "“Great enlightening beings in this assembly had forty buddha-teachings: The self-willed king of supreme enlightenment, the Buddha Silent Flower of Universal Goodness, the Tathāgata Greatly Enlightened One, the Tathāgata Greatly Illuminating Sound of the Precepts of the Diamond Lion, the Supreme Virtuous One, and the",
        "source": "T03n0158_004:0256c09_29"
    },
    {
        "source_sentence": "三師子喜如來、無盡智積寶光如來、智無垢如來、智珊瑚如來；",
        "translation": "“Great enlightening beings also have three buddhas, the Tathāgata of Delight in Virtuous Conduct, the Tathāgata of Inexhaustible Knowledge, the Tathāgata of Accumulated Jewel Light, the Tathāgata of Immeasurable Knowledge, the Tathāgata of Undefiled Knowledge, and the Tathāgata of Ocean of Knowledge.",
        "source": "T03n0158_004:0256c11_30"
    },
    {
        "source_sentence": "二師子稱如來、通德王如來、法華雨如來、光踊高如來、法踊王無垢如來、香自在如來、無垢眼如來、大積如來、阿僧祇力王如來、自智福德力如來、智衣如來、自在如來、阿僧祇饒益如來、智積如來、大高如來、力藏如來、德沈如來、枝華幢如來、照眾如來、無癡德王如來、金剛上如來、法勝如來、聲帝王如來、自執金剛持寶如來、自在踊幢止劫如來、樂雲法用婆羅王如來、普德海王如來、智積如來、智焰華如來、眾世主自在如來、優曇鉢華金幢如來、法幢雷王如來、栴檀善安隱起(丹超)勢如來、幢最燈如來、智起(丹超)如來、堅幢滅如來、法稱如來、降魔德焰如來、闍那波羅沙睺如來、智燈如來、安隱王如來、智音如來、幢集如來、金剛如來、金剛曜如來、莊嚴王如來、闍夜僧棄如來、善安意如來、月王如來、超吼王如來、婆羅王如來；",
        "translation": "The second is the Tathāgata of Siṃhala, the Tathāgata of King of Knowledge and Virtue, the Tathāgata of Dharma Flower Rain, the Tathāgata of Radiant Light, the Tathāgata of King of Truth, the Tathāgata of Immaculate Fragrance, the Tathāgata of Immaculate Eyes, the Tathāgata of Great Accumulation, the",
        "source": "T03n0158_004:0256c13_31"
    },
    {
        "source_sentence": "八十師子步如來；",
        "translation": "“Great enlightening beings have eighty buddha-teachings:",
        "source": "T03n0158_004:0256c29_32"
    },
    {
        "source_sentence": "五十那羅延勝藏如來；",
        "translation": "“Great enlightening beings in this assembly had fifty buddhas, namely:",
        "source": "T03n0158_004:0257a01_33"
    },
    {
        "source_sentence": "七十寶積德如來；",
        "translation": "“Great Enlightened One is a buddha of seventy-thousand jewels.",
        "source": "T03n0158_004:0257a01_34"
    },
    {
        "source_sentence": "三十月藏如來；",
        "translation": "The Tathāgata of the Thirty-Moon Treasury.",
        "source": "T03n0158_004:0257a02_35"
    },
    {
        "source_sentence": "二十星宿稱如來；",
        "translation": "The constellations of the twenty stars are called thusness.",
        "source": "T03n0158_004:0257a02_36"
    },
    {
        "source_sentence": "三十德力婆羅王如來；",
        "translation": "The Tathāgata of the Thirty Virtues, the Brahma King, was born in that world.",
        "source": "T03n0158_004:0257a03_0"
    },
    {
        "source_sentence": "九十軟音如來、梵上堅固如來；",
        "translation": "“Great enlightening beings have ten buddha-teachings:",
        "source": "T03n0158_004:0257a03_1"
    },
    {
        "source_sentence": "復有十號香華勝稱王如來；",
        "translation": "“Furthermore, there was another buddha named Supremely Famous King of Fragrant Flowers, the enlightened one with ten epithets.",
        "source": "T03n0158_004:0257a04_2"
    },
    {
        "source_sentence": "七十光明圓月照王如來；",
        "translation": "“Great enlightening being Universal Moon Shining King with Seventy-Sixty Lights.",
        "source": "T03n0158_004:0257a04_3"
    },
    {
        "source_sentence": "三十香華上如來、無量德海如來、智上如來、閻浮影如來；",
        "translation": "“Great enlightening beings in this assembly were the Tathāgata of Thirty Fragrant Flowers, the Buddha of Immeasurable Ocean of Virtue, the Buddha of Knowledge Above All Enlightenment, and the buddhas Jambudvlpa.",
        "source": "T03n0158_004:0257a05_4"
    },
    {
        "source_sentence": "一百二德山幢如來、師子最如來；",
        "translation": "“Great enlightening beings of the ten directions also saw these buddhas:",
        "source": "T03n0158_004:0257a06_5"
    },
    {
        "source_sentence": "百一龍吼華曜王如來、善香種無我如來、無量德曜王劫如來；",
        "translation": "“Great enlightening beings in this assembly had one hundred and ten buddha-teachings:",
        "source": "T03n0158_004:0257a07_6"
    },
    {
        "source_sentence": "復有千人同號捨法智龍王解脫覺世海眼止如來、應供、正遍知。",
        "translation": "Again, there were a thousand people who all called themselves the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One.",
        "source": "T03n0158_004:0257a09_0"
    },
    {
        "source_sentence": "汝等各於異國一日同時，當成阿耨多羅三藐三菩提，當壽十小劫。",
        "translation": "Each of you will attain highest, complete enlightenment on the same day in a different land for ten intermediate kalpas.",
        "source": "T03n0158_004:0257a10_1"
    },
    {
        "source_sentence": "汝等亦當同日入無上涅槃，後佛土正法七日皆滅。』",
        "translation": "You will also enter unsurpassed nirvāṇa on the same day, and seven days after that, the right teaching of the Buddha's land will all cease.'",
        "source": "T03n0158_004:0257a12_0"
    },
    {
        "source_sentence": "「彼十千人五體稽首禮寶藏如來足。",
        "translation": "Ten thousand people bowed their heads at the feet of the Ratnaketu Tathāgata with five bodies.",
        "source": "T03n0158_004:0257a13_1"
    },
    {
        "source_sentence": "「『起汝等妙堅龍吼，　　當求習最積善財；",
        "translation": "'Give rise to your wonderfully strong dragon roar, Seeking the accumulation of the greatest store of goodness.",
        "source": "T03n0158_004:0257a14_0"
    },
    {
        "source_sentence": "　　勤修六度莫懈怠，　　當為天人作導師。』",
        "translation": "diligently cultivate the six perfections without laziness, and you'll be a guide for gods and humans.'",
        "source": "T03n0158_004:0257a14_0"
    },
    {
        "source_sentence": "寶藏如來言：大乘悲分陀利經第九王子授記品第十一「善男子！",
        "translation": "Ratnaketu Tathāgata said, The ninth prince of the great vehicle compassionate partial dhāraṇī sūtra, Chapter 11, grants assurance of prediction, says, Good sons!",
        "source": "T03n0158_004:0257a14_0"
    },
    {
        "source_sentence": "爾時海濟婆羅門語第九王子阿彌具，略說。",
        "translation": "It was then that the Brāhmaṇa Haiji spoke to the ninth prince Amitâbha, explaining it briefly.",
        "source": "T03n0158_004:0257a19_1"
    },
    {
        "source_sentence": "彼白佛言：『我當如是行菩薩行，令十方恒河沙數世界中，恒河沙數現在住世諸佛世尊，",
        "translation": "They said to the Buddha: I should thus practice the deeds of enlightening beings, so that in as many worlds in the ten directions as there are grains of sand in the Ganges River they may become buddhas.",
        "source": "T03n0158_004:0257a20_2"
    },
    {
        "source_sentence": "證我行菩薩菩提行。",
        "translation": "He realizes that I'm practicing the bodhisattva's enlightenment practice.",
        "source": "T03n0158_004:0257a22_3"
    },
    {
        "source_sentence": "唯！",
        "translation": "Yes!",
        "source": "T03n0158_004:0257a22_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0257a22_5"
    },
    {
        "source_sentence": "如我今於佛前發菩提心，乃至成阿耨多羅三藐三菩提，於其中間行菩提行莫令心悔，",
        "translation": "“Furthermore, reverend Śāriputra, just as I have now developed the aspiration for enlightenment before the Buddha and attained unexcelled complete perfect enlightenment, so too should I do so without regret.",
        "source": "T03n0158_004:0257a22_6"
    },
    {
        "source_sentence": "乃至菩提際誓願堅固，如說修行不惱他心；",
        "translation": "At the end of enlightenment their vows are firm, cultivating practice as they teach without disturbing others’ minds.",
        "source": "T03n0158_004:0257a24_7"
    },
    {
        "source_sentence": "令我不生聲聞、辟支佛心；",
        "translation": "They cause me not to give rise to the minds of śrāvakas and pratyekabuddhas.",
        "source": "T03n0158_004:0257a25_8"
    },
    {
        "source_sentence": "令我心意不生愛欲，不與眠睡、慠慢、輕弄、誑惱、疑惑共俱；",
        "translation": "They cause my mind and thought not to give rise to craving or desire. They are not accompanied by sleepiness, self-conceit, hypocrisy, debauchery, anger, hatred, and doubt.",
        "source": "T03n0158_004:0257a26_9"
    },
    {
        "source_sentence": "不與殺生、偷盜及非梵行，妄語、兩舌、麤言、綺語、無明、掉動、邪見、嫉妬等俱；",
        "translation": "It is not accompanied by taking life, stealing, or non-Buddhist practices; it is not accompanied by false speech, divisive speech, harsh speech, fancy speech, idle talk, ignorance, agitation, wrong views, jealousy, etc.",
        "source": "T03n0158_004:0257a27_10"
    },
    {
        "source_sentence": "無不敬法心，亦無離心。",
        "translation": "There's no mind that doesn't revere the Dharma, and there's no mind that's free of it.",
        "source": "T03n0158_004:0257a29_11"
    },
    {
        "source_sentence": "我行菩薩行時，乃至菩提際，莫令心有如是等法。",
        "translation": "When I practice the bodhisattva's practice, even at the time of enlightenment, I won't allow my mind to have such things.",
        "source": "T03n0158_004:0257a29_12"
    },
    {
        "source_sentence": "願我乃至菩提際，舉足下足心常念佛，乃至菩提際，未曾不見佛、不聞法、不供養僧。",
        "translation": "May I always be mindful of the Buddha with my feet raised and lowered at the time of enlightenment, and may I never see a Buddha, hear the Dharma, or make offerings to the saṃgha until the time of enlightenment.",
        "source": "T03n0158_004:0257b02_0"
    },
    {
        "source_sentence": "在所生處常得出家，常糞掃衣但三衣，樹下止常坐空閑處，常乞食少欲知足，",
        "translation": "Where he was born, he always renounced the householder’s life. He always wore clothes made of rags and only three kinds of cloth. He lived in a quiet place under trees, always sitting at leisurely seats. He always begged almsfood with few desires and fulfilled his needs.",
        "source": "T03n0158_004:0257b03_1"
    },
    {
        "source_sentence": "常說法言無染著語；",
        "translation": "They always expound the Teaching in words without defiled speech.",
        "source": "T03n0158_004:0257b05_2"
    },
    {
        "source_sentence": "令我具足無量辯才，常不犯根罪，不雜妄語非毀他論，常念於空為女說法，",
        "translation": "They cause me to be endowed with boundless powers of elucidation, always avoiding offenses against my faculties and sins, not engaging in false speech or slanderous speech, always mindful of emptiness and teaching the Dharma to women.",
        "source": "T03n0158_004:0257b06_3"
    },
    {
        "source_sentence": "常思惟空。",
        "translation": "He always contemplates emptiness.",
        "source": "T03n0158_004:0257b07_4"
    },
    {
        "source_sentence": "於女人前不露齒笑，不染相動手為人說法。",
        "translation": "In front of the woman, he doesn't show his teeth or smile, doesn't stain their marks, and doesn't move his hand to teach the Dharma for others.",
        "source": "T03n0158_004:0257b08_5"
    },
    {
        "source_sentence": "我常於大乘菩薩，有師事供養之心。",
        "translation": "I always have the intention to serve and make offerings to great vehicle bodhisattvas.",
        "source": "T03n0158_004:0257b09_6"
    },
    {
        "source_sentence": "我若從他聞法敬意如師，我常恭敬沙門婆羅門，尊重供養唯如來前。",
        "translation": "If I hear the Dharma from others and respectfully venerate it as a teacher, I'll always pay respect to ascetics and priests, honoring and making offerings only in front of the Tathāgata.",
        "source": "T03n0158_004:0257b09_7"
    },
    {
        "source_sentence": "我不觀應與不應與而為布施，我於法施不生嫉妬心，我以身命濟應死者，",
        "translation": "I don't observe what should be given and what shouldn't be given as generosity; I don't become jealous of giving the Dharma, and I rescue those who should die with my body and life.",
        "source": "T03n0158_004:0257b11_8"
    },
    {
        "source_sentence": "自以精進辦及眾物救厄眾生。",
        "translation": "He saves sentient beings in distress with his own effort and various things.",
        "source": "T03n0158_004:0257b13_9"
    },
    {
        "source_sentence": "我不說在家、出家是非長短；",
        "translation": "I do not explain the length or shortcomings of what is right and wrong for those who remain householders and renunciants.",
        "source": "T03n0158_004:0257b13_10"
    },
    {
        "source_sentence": "我常觀察利、養、稱、譽，如火如毒如怨，心常遠避。",
        "translation": "I always observe profit, nourishment, fame, and renown like fire, poison, and enemies, and my mind always avoids them.",
        "source": "T03n0158_004:0257b14_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0257b15_12"
    },
    {
        "source_sentence": "若我乃至菩提際，成就如世尊前所立誓願者，令我兩手中自然輪寶，千輻輞轂明焰具足。』",
        "translation": "If I accomplish the vow I made before the Bhagavān up to the point of enlightenment, let me have a natural wheel treasure in both hands with a thousand-spoked hub and a bright flame that's complete.'",
        "source": "T03n0158_004:0257b15_13"
    },
    {
        "source_sentence": "「阿彌具王子適發言已，如其所願輪即在手。",
        "translation": "“After he spoke these words, the prince Amitâbha said, ‘The wheel that you wished for will now be in my hand.",
        "source": "T03n0158_004:0257b17_14"
    },
    {
        "source_sentence": "復白佛言：『世尊！",
        "translation": "Again, he said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0257b18_15"
    },
    {
        "source_sentence": "若我乃至菩提際如是意滿者，令此輪寶往至五濁空佛土中出是大聲，如難陀䟦難陀龍王之聲。",
        "translation": "If my mind is thus fulfilled until the point of enlightenment, I'll cause this wheel treasure to go to the Buddha land of the five turbid emptiness buddhas and produce this great sound, which sounds like the sound of the nandanavana, the nandanavana dragon king.",
        "source": "T03n0158_004:0257b19_16"
    },
    {
        "source_sentence": "一切佛土聲唱是言：「菩薩受記入不妄念智。」",
        "translation": "The sounds of all the buddha lands are called, A bodhisattva who receives assurance enters into the wisdom of not deludedly thinking.",
        "source": "T03n0158_004:0257b21_17"
    },
    {
        "source_sentence": "唱「修空不動意界法藏」。",
        "translation": "He called out, Cultivate the Dharma store of the immovable mind realm of emptiness and the Dharma store of the mind realm.",
        "source": "T03n0158_004:0257b22_18"
    },
    {
        "source_sentence": "一切眾生生其中者，此法藏聲入彼耳根；",
        "translation": "To all sentient beings born therein, the sound of this treasury of truth enters their faculty of hearing.",
        "source": "T03n0158_004:0257b23_0"
    },
    {
        "source_sentence": "適入耳已，令彼眾生欲愛即滅，瞋恚、愚癡、吾我、慳嫉皆滅；",
        "translation": "Entering into their ears, they instantly annihilate the cravings of those sentient beings. Their hatred, folly, selfishness, and stinginess all cease.",
        "source": "T03n0158_004:0257b23_1"
    },
    {
        "source_sentence": "令得思念佛境界智，發阿耨多羅三藐三菩提心。』",
        "translation": "Causing them to contemplate the Buddha's sphere of knowledge and give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0158_004:0257b25_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0257b26_3"
    },
    {
        "source_sentence": "阿彌具王子遣彼二輪，其輪甚速，譬如諸佛如來神通，如是往至十方無量阿僧祇五濁空佛土中。",
        "translation": "The prince Amitâbha sends out those two wheels, which are so quick that they're like the buddhas and tathāgatas with supernormal powers who thus go to the Buddha land of immeasurable incalculable five turbid emptinesses in the ten directions.",
        "source": "T03n0158_004:0257b26_4"
    },
    {
        "source_sentence": "至已為眾生唱：『菩薩受記入不妄念智，修空不動意界法藏。』",
        "translation": "After he had done so, he called out for sentient beings, 'The bodhisattva accepted the assurance and entered into the wisdom of not deludedly thinking, cultivating the Dharma store of the unmoving mind realm of emptiness and the Dharma store.'",
        "source": "T03n0158_004:0257b28_5"
    },
    {
        "source_sentence": "其中一切眾生，此法藏音入耳根已，一切欲愛乃至心意嫉妬滅；",
        "translation": "All sentient beings therein, having entered the ear faculty with this voice of the treasury of truth, ceased all desire and jealousy, up to their minds.",
        "source": "T03n0158_004:0257c01_6"
    },
    {
        "source_sentence": "皆悉思念如佛境界智，發阿耨多羅三藐三菩提心；",
        "translation": "They all thought of them as the sphere of buddhahood and developed the determination for unexcelled complete perfect enlightenment.",
        "source": "T03n0158_004:0257c02_7"
    },
    {
        "source_sentence": "須臾之頃，彼輪還來王子前住。",
        "translation": "In a moment, the wheel returned and stayed in front of the prince.",
        "source": "T03n0158_004:0257c03_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0257c04_9"
    },
    {
        "source_sentence": "爾時寶藏如來歎阿彌具王子言：『善哉，善哉！",
        "translation": "It was then that the Ratnaketu Tathāgata praised the prince Amitâbha, saying, 'Good, good!'",
        "source": "T03n0158_004:0257c04_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0257c05_11"
    },
    {
        "source_sentence": "如汝行菩薩行所願甚善，遣此自然輪寶至彼五濁空佛土中，令多阿僧祇億那由他百千眾生，",
        "translation": "“Furthermore, as you carry out the practice of enlightening beings and your vows are very good, send this jewel of the wheel of knowledge into the buddha-lands of the five turbid realms of emptiness so many hundreds of thousands of myriads of koṭis of sentient beings will be born there.",
        "source": "T03n0158_004:0257c05_12"
    },
    {
        "source_sentence": "住無濁心、無惱心，勸以菩提。",
        "translation": "He abides in a mind free of turbidity and affliction and encourages enlightenment.",
        "source": "T03n0158_004:0257c08_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0257c08_14"
    },
    {
        "source_sentence": "是故字汝為無惱。",
        "translation": "That's why it's called you being without affliction.",
        "source": "T03n0158_004:0257c08_15"
    },
    {
        "source_sentence": "汝無惱！",
        "translation": "You are not disturbed!",
        "source": "T03n0158_004:0257c09_16"
    },
    {
        "source_sentence": "當為世導，汝可取莊嚴佛土，隨汝所欲。』",
        "translation": "You will be the guide of the world, so you can adorn the Buddha's land and follow your wishes.'",
        "source": "T03n0158_004:0257c09_17"
    },
    {
        "source_sentence": "「阿彌具白佛言：『世尊！",
        "translation": "Amitâbha said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0257c10_18"
    },
    {
        "source_sentence": "我求如是莊嚴佛土，所謂一切黃金為地平正如掌，饒諸天寶周遍其中。",
        "translation": "I'm seeking to adorn the Buddha land like this, which is called a ground of gold that's as flat as my palm and surrounded by heavenly treasures.",
        "source": "T03n0158_004:0257c10_19"
    },
    {
        "source_sentence": "令無瓦礫土石諸山，地柔軟觸猶劫波育，足下則下，舉足還復。",
        "translation": "It causes the mountains of rubble, dirt, and stones to be left untouched, and the earth is as soft and gentle as if it were an eunuch's robe. When he steps down, he goes down; when he lifts his feet, he returns again.",
        "source": "T03n0158_004:0257c12_20"
    },
    {
        "source_sentence": "其中令無地獄、畜生、餓鬼之名。",
        "translation": "It causes them to lack the names hell, animals, and hungry ghosts.",
        "source": "T03n0158_004:0257c14_21"
    },
    {
        "source_sentence": "我佛土無諸臭穢，勝天妙香充滿其國，令天曼陀羅華周遍佛土。",
        "translation": "The Buddha land of mine has no smell or odor, and the wonderful fragrance of superior heaven fills that land, causing celestial maṇḍala flowers to pervade the Buddha land.",
        "source": "T03n0158_004:0257c14_22"
    },
    {
        "source_sentence": "令其中眾生無有老病，無相畏者，無相惱亂。",
        "translation": "They cause sentient beings therein to have no old age or illness, and those without marks of fear have no marks of affliction.",
        "source": "T03n0158_004:0257c16_23"
    },
    {
        "source_sentence": "令其中眾生無有橫死，死無悔恨，無不入三昧而命終者。",
        "translation": "It causes the sentient beings therein not to die indiscriminately, die without regret or resentment, and enter samādhi without fail when their lives end.",
        "source": "T03n0158_004:0257c17_24"
    },
    {
        "source_sentence": "令其中眾生思惟念佛而取命終，終已不墮惡趣，不生五濁空佛土中，乃至菩提般涅槃，",
        "translation": "They cause sentient beings therein to think of the Buddha and take his life as an end, not falling into bad destinies after death, not being born in the buddha-lands of the five turbid emptinesses, up to enlightenment and parinirvāṇa.",
        "source": "T03n0158_004:0257c18_25"
    },
    {
        "source_sentence": "未常不見佛、不聞法、不供養僧。",
        "translation": "They don't always see the Buddha, hear the Dharma, or make offerings to the saṃgha.",
        "source": "T03n0158_004:0257c20_26"
    },
    {
        "source_sentence": "令其中眾生少於愛欲、瞋恚、愚癡；",
        "translation": "They cause sentient beings therein to be fewer in craving, hatred, and folly.",
        "source": "T03n0158_004:0257c21_27"
    },
    {
        "source_sentence": "令其中一切眾生修十善業；",
        "translation": "Causing all sentient beings therein to cultivate the ten wholesome activities.",
        "source": "T03n0158_004:0257c22_0"
    },
    {
        "source_sentence": "令其佛土眾生無受戒無犯悔名；",
        "translation": "It is called causing sentient beings in those buddha-lands not to receive precepts and not to violate them.",
        "source": "T03n0158_004:0257c22_1"
    },
    {
        "source_sentence": "令其中眾生魔不得便；",
        "translation": "They cause sentient beings therein to be unable to get an advantage over Māra.",
        "source": "T03n0158_004:0257c23_2"
    },
    {
        "source_sentence": "令其中眾生無諸醜陋；",
        "translation": "I will cause all sentient beings therein to be free of ugliness.",
        "source": "T03n0158_004:0257c23_3"
    },
    {
        "source_sentence": "使其中眾生無有貴賤分別；",
        "translation": "They cause sentient beings therein to have no discrimination of superiority or inferiority.",
        "source": "T03n0158_004:0257c24_4"
    },
    {
        "source_sentence": "使其中眾生無我所無所作；",
        "translation": "They cause sentient beings therein to have no self, nothing whatsoever, and nothing to do.",
        "source": "T03n0158_004:0257c25_5"
    },
    {
        "source_sentence": "令其中聲聞、菩薩乃至夢中無失不淨；",
        "translation": "I cause all the enlightening beings therein, hearers, enlightening beings, and even those in dreams to be without loss or impurity.",
        "source": "T03n0158_004:0257c25_6"
    },
    {
        "source_sentence": "令其中一切眾生愛法求法；",
        "translation": "I cause all sentient beings therein to love the Teaching and seek the Teaching.",
        "source": "T03n0158_004:0257c26_7"
    },
    {
        "source_sentence": "令其佛土無有一人異學倒見；",
        "translation": "I will cause no one in the Buddha-lands to have mistaken views of heretics.",
        "source": "T03n0158_004:0257c27_8"
    },
    {
        "source_sentence": "令其中眾生身無疲懈心無勞惓；",
        "translation": "I cause sentient beings therein to be unwearied in body, mind, and spirit.",
        "source": "T03n0158_004:0257c27_9"
    },
    {
        "source_sentence": "使其中一切眾生皆得五通；",
        "translation": "They cause all sentient beings therein to attain the five transcendent powers.",
        "source": "T03n0158_004:0257c28_10"
    },
    {
        "source_sentence": "使其中眾生無飢渴患，隨所欲食充滿寶器而在其前如欲界天；",
        "translation": "They cause sentient beings therein to be free from hunger and thirst, filling jeweled vessels with food as they wish, just like the gods of the realm of desire.",
        "source": "T03n0158_004:0257c29_11"
    },
    {
        "source_sentence": "令其中眾生無有屎尿、涕唾、目淚、身汗。",
        "translation": "It causes the sentient beings therein to have no excrement, tears, eyes, tears, or bodily sweat.",
        "source": "T03n0158_004:0258a01_12"
    },
    {
        "source_sentence": "令其中無有寒熱；",
        "translation": "They cause neither cold nor heat to arise in them.",
        "source": "T03n0158_004:0258a02_13"
    },
    {
        "source_sentence": "令其中香風軟觸以動人天，隨意所欲有求涼風，有求暖風，有求優鉢羅香風，",
        "translation": "They cause the wind of fragrance and gentle touch to move people and gods, seeking cool breezes at will, warm breezes at will, and upala-flavoured breezes at will.",
        "source": "T03n0158_004:0258a03_14"
    },
    {
        "source_sentence": "有求木櫁香風，有求海此岸香，有求多伽羅香，有求沈水香，有求一切香風，",
        "translation": "There are those who seek the wind of fragrance of wood, and there are those who seek the wind of the seacoast; those who seek the wind of sandalwood; those who seek the wind of coral; those who seek the wind of salt water; and those who seek all kinds of fragrances.",
        "source": "T03n0158_004:0258a05_0"
    },
    {
        "source_sentence": "隨心所念悉皆令得；",
        "translation": "Whatever they think, they attain it.",
        "source": "T03n0158_004:0258a06_1"
    },
    {
        "source_sentence": "令無如是五濁世界；",
        "translation": "So that there would be no such a world of the five turbidities.",
        "source": "T03n0158_004:0258a07_2"
    },
    {
        "source_sentence": "令其國中有七寶臺，於彼臺中有七寶座，重敷茵蓐安置丹枕，觸甚柔軟如劫波育，",
        "translation": "He caused a seven-jeweled terrace to be built in his kingdom. On that terrace was a seat made of seven-jeweled stones, which were covered with cushions and draped with silk pillows as soft and supple as Kapośinagara.",
        "source": "T03n0158_004:0258a07_3"
    },
    {
        "source_sentence": "人所住處令其寶臺周匝有池，八功德水充滿其中，彼諸眾生以此為用；",
        "translation": "Where the people live, they cause their jeweled terraces to be surrounded by ponds filled with the water of the eight kinds of virtue. The living beings there use these ponds for their benefit.",
        "source": "T03n0158_004:0258a09_4"
    },
    {
        "source_sentence": "使其中諸樹行列須曼那莊嚴，以種種華、種種果、種種香、種種衣、種種蓋、種種瓔珞、種種嚴具以莊嚴樹；",
        "translation": "He caused the trees therein to be arrayed with rows of palm trees, adorned with various flowers, various fruits, various fragrances, various robes, various canopies, various necklaces, and various ornaments.",
        "source": "T03n0158_004:0258a11_5"
    },
    {
        "source_sentence": "其中眾生隨所樂衣，於如意樹上取而著之，如是華乃至嚴具隨取服之。",
        "translation": "The sentient beings among them, according to their preferred clothing, take it from the wish-granting tree and put it on it, and such flowers or even adornments are taken and given as they like.",
        "source": "T03n0158_004:0258a13_6"
    },
    {
        "source_sentence": "我菩提樹令七寶成，高千由旬，其莖徑一由旬，枝葉分布一千由旬，微風來吹枝葉相[敲-高+亭]，",
        "translation": "My tree of enlightenment will be made of the seven treasures, one thousand yojanas high, with a stem that is one yojana in diameter and branches spreading out to a distance of one thousand yojanas. A gentle breeze will blow from its roots and leaves;",
        "source": "T03n0158_004:0258a15_7"
    },
    {
        "source_sentence": "令出柔軟過天妙音，謂波羅蜜、神通、根、力、覺、道之聲，其有聞者心得離欲。",
        "translation": "It causes the subtle sound that's soft and transcendent, which is the sound of the pāramitā, supernormal abilities, faculties, powers, enlightenment, and the path, and those who hear it will attain freedom from desire.",
        "source": "T03n0158_004:0258a17_8"
    },
    {
        "source_sentence": "令其佛土女人具諸功德，譬如兜率天女，又其中女人無諸臭穢，不兩舌、慳嫉姤。",
        "translation": "It causes the women of that Buddha land to be endowed with merits like the goddesses of Tuṣita Heaven, and the women there have no smell or dirt, aren't duplicitous, and aren't stingy or jealous.",
        "source": "T03n0158_004:0258a18_9"
    },
    {
        "source_sentence": "使其男子不與女人觸身行欲，彼生欲心往觀女人，須臾之頃欲心即滅，",
        "translation": "He causes men not to touch women with their bodily desires, and they give rise to desires that go to women. In a moment, those desires cease.",
        "source": "T03n0158_004:0258a20_10"
    },
    {
        "source_sentence": "生大慚愧而去，令得淨無塵三昧，以是三昧常離魔所，終不更生欲心。",
        "translation": "He becomes greatly ashamed and leaves, so that he attains the pure, dustless samādhi, which always leaves Māra's place because of this samādhi and never gives rise to desire again.",
        "source": "T03n0158_004:0258a22_11"
    },
    {
        "source_sentence": "彼女人以欲心視男子已，令即有胎，適視已欲心俱滅。",
        "translation": "The woman looked at the man with craving and told him to have a fetus, and after looking at him appropriately, both desire and thought ceased.",
        "source": "T03n0158_004:0258a24_12"
    },
    {
        "source_sentence": "如是男女處胎身心受樂，譬如三十三天歡喜愛樂。",
        "translation": "Thus, when a man and woman are in the womb, they experience happiness in body and mind, like the Trāyastriṃśa gods rejoicing and enjoying happiness.",
        "source": "T03n0158_004:0258a25_13"
    },
    {
        "source_sentence": "使其佛土男女處胎七日七夜如是受樂，女人懷妊亦受是樂，譬如比丘入第二禪。",
        "translation": "It causes men and women in the Buddha's land to stay in the womb for seven days and nights like this to experience happiness, and women pregnant with pregnancy also experience such happiness, just as a monk enters the second dhyāna.",
        "source": "T03n0158_004:0258a26_14"
    },
    {
        "source_sentence": "彼處胎者不為不淨胎垢所污，於七日旦極香甚樂而得出生。",
        "translation": "Those in the womb won't be stained by impure womb dirt, and on the seventh day at dawn they'll be born with an extremely fragrant and very pleasant odor.",
        "source": "T03n0158_004:0258a28_15"
    },
    {
        "source_sentence": "令彼女人不受苦痛俱入池浴，令彼女人心即離欲得淨無塵三昧，以是三昧令離魔事常入三昧；",
        "translation": "He causes the woman to enter the lake and bathe without suffering or pain. He causes her mind to be dispassionate and attain pure, immaculate concentration free of all defilements. By means of this concentration he enables her to become free of demonic activity and always enters concentration.",
        "source": "T03n0158_004:0258a29_16"
    },
    {
        "source_sentence": "先身所作業行因緣，應多億劫受女人身，令以是三昧得盡除却一切女身，",
        "translation": "Because of the causes and conditions of their past actions, they should accept a woman’s body for millions of eons, so that by means of this concentration all women’s bodies can be annihilated.",
        "source": "T03n0158_004:0258b03_17"
    },
    {
        "source_sentence": "乃至菩提般涅槃更不復受。",
        "translation": "Up to the point where he attains enlightenment and parinirvāṇa, he won't accept it again.",
        "source": "T03n0158_004:0258b04_18"
    },
    {
        "source_sentence": "又有眾生，所作業行應過數劫常受胎苦，我逮菩提時，聞我名號心生喜樂者，",
        "translation": "Also, there are sentient beings whose actions should always experience the pain of birth in the womb for several eons. When I attain enlightenment, they hear my name and give rise to joy and happiness in their hearts.",
        "source": "T03n0158_004:0258b05_19"
    },
    {
        "source_sentence": "於彼命終即來我國，受胎眾生，其中一切所作業行盡彼除滅，乃至菩提際更不受胎生。",
        "translation": "At the end of their life, they'll come to our country and be born in the womb for sentient beings who receive birth, where all their actions will cease until they're removed or extinguished, and then they won't be born in the womb again at the time of enlightenment.",
        "source": "T03n0158_004:0258b07_20"
    },
    {
        "source_sentence": "有眾生善根熟者，令彼華中化生，有少福德未種善根，令彼胎生盡諸業行。",
        "translation": "If there are sentient beings whose good roots are ripe, they'll be born transformed in those flowers and have little merit who haven't planted good roots, so that they'll be born in the womb and end their karmic activities.",
        "source": "T03n0158_004:0258b09_21"
    },
    {
        "source_sentence": "我國土中，若為女人若復入胎，令彼眾生一向受樂充滿；",
        "translation": "In my land, I cause all sentient beings to always experience blissful fulfillment for the sake of women and those who are born again.",
        "source": "T03n0158_004:0258b11_0"
    },
    {
        "source_sentence": "令微風吹須曼那多羅披帝樹，出如是喜樂之聲，苦空無常無我之聲，以是音聲，",
        "translation": "I caused a gentle breeze to blow from the saumaṇnataka trees, producing such sounds of joy and happiness. The sound of suffering, emptiness, impermanence, and non-self came forth by these sounds.",
        "source": "T03n0158_004:0258b12_1"
    },
    {
        "source_sentence": "令其中人得然明三昧，以是三昧，令彼眾生覺明深空，令其佛土不出樂欲之聲。",
        "translation": "He causes those sentient beings to awaken to the profound emptiness, so that the Buddha's land doesn't give rise to the sound of pleasure and desire.",
        "source": "T03n0158_004:0258b14_2"
    },
    {
        "source_sentence": "「『世尊！",
        "translation": "'Bhagavān!",
        "source": "T03n0158_004:0258b16_0"
    },
    {
        "source_sentence": "我坐菩提樹下，願須臾之頃，逮阿耨多羅三藐三菩提。",
        "translation": "I sit under the tree of enlightenment, wishing to attain highest, complete enlightenment in a moment’s time.",
        "source": "T03n0158_004:0258b16_1"
    },
    {
        "source_sentence": "逮菩提已，令其佛土無日月光，亦無有夜，惟以華合。",
        "translation": "Having attained enlightenment, he caused the Buddha's land to lack the light of the sun and moon, and there was no night but a combination of flowers.",
        "source": "T03n0158_004:0258b17_2"
    },
    {
        "source_sentence": "我當放如是光明，遍照三千大千佛土無不周至，以是光照令彼眾生得如是大明，",
        "translation": "I will emanate such a ray of light, illuminating all the buddha-lands throughout the universe; illumining those sentient beings with this light, enabling them to attain such great insight.",
        "source": "T03n0158_004:0258b18_3"
    },
    {
        "source_sentence": "見十方無量阿僧祇餘世界中現在住世諸佛世尊。",
        "translation": "They'll see the buddhas and world-honored ones who are present in measureless incalculable worlds in the other worlds in the ten directions.",
        "source": "T03n0158_004:0258b20_4"
    },
    {
        "source_sentence": "我逮菩提時，當以如是聲說法，遍滿三千大千佛土，令其中眾生得念佛心，",
        "translation": "At the time of my attainment of enlightenment, I will preach in such a way as to pervade the great manifold cosmos of one thousand buddha-thousand buddha-lands and cause sentient beings therein to attain mindfulness of buddhas.",
        "source": "T03n0158_004:0258b21_5"
    },
    {
        "source_sentence": "隨所住處經行坐臥及與迴轉，令彼一切常得見我，隨所疑法適觀我已疑惑盡除。",
        "translation": "He follows the places where he lives, walks, sits, lies, and turns around, so that they always see me, correctly observes what's doubted according to the principle, and rids themselves of doubt after having doubted me.",
        "source": "T03n0158_004:0258b23_6"
    },
    {
        "source_sentence": "我逮菩提時，於十方無量阿僧祇佛土眾生，若求聲聞乘、若求大乘者，",
        "translation": "When I had attained enlightenment, all the sentient beings of the incalculable buddha-lands in the ten directions who sought the vehicle of the śrāvakas and those who sought the great vehicle",
        "source": "T03n0158_004:0258b25_7"
    },
    {
        "source_sentence": "從我聞法，令得深三昧忍辱陀羅尼，即住不退轉阿耨多羅三藐三菩提。",
        "translation": "Hearing the teaching from me, he causes them to attain the profound dhāraṇī of forbearance in samādhi and then abides in nonretrogressing unsurpassed, correct enlightenment.",
        "source": "T03n0158_004:0258b26_8"
    },
    {
        "source_sentence": "令我聲聞僧眾無量，無能數者，唯除如來。",
        "translation": "That will cause my śrāvakas and saṃgha to be immeasurable and incalculable, except for the Tathāgata.",
        "source": "T03n0158_004:0258b28_9"
    },
    {
        "source_sentence": "我逮菩提時，在所遊行投足之處，令有千葉金色蓮華，我遣彼華至空佛土，",
        "translation": "At the time of my attainment of enlightenment, I made a thousand petals of golden lotus blossoms grow in the place where I was walking and prostrated myself. I sent those flowers to the buddha-field of space.",
        "source": "T03n0158_004:0258b29_10"
    },
    {
        "source_sentence": "彼華至已稱讚於我，彼諸眾生聞我名者即生喜樂。",
        "translation": "When that flower arrives, it praises me, and those sentient beings who hear my name become delighted when they hear it.",
        "source": "T03n0158_004:0258c02_11"
    },
    {
        "source_sentence": "令彼眾生所有善根，盡皆迴向求生我國，於彼命終皆得來生。",
        "translation": "They cause all the good roots of those sentient beings to return to their country and seek birth, and at the end of their life, they'll be born again.",
        "source": "T03n0158_004:0258c03_12"
    },
    {
        "source_sentence": "令我聲聞僧無沙門垢、無諂曲，為令一切眾皆悉如是。",
        "translation": "I want my śrāvakas and saṃgha to be free of the stain of asceticism and without flattery, so that all sentient beings will be likewise.",
        "source": "T03n0158_004:0258c04_13"
    },
    {
        "source_sentence": "令我眷屬貴重於法，不貪財物不重榮利，樂於無常、苦、空、無我，勤修精進、敬佛樂法、重比丘僧。",
        "translation": "They cause my followers to esteem the Dharma, not covet property or value prosperity, delight in impermanence, suffering, emptiness, and selflessness, diligently cultivate effort, venerate the Buddha, enjoy the Dharma, and value the monks and nuns.",
        "source": "T03n0158_004:0258c05_14"
    },
    {
        "source_sentence": "令其中不退菩薩得入空意，隨所生處常說般若波羅蜜，乃至菩提際令不忘失。",
        "translation": "He causes the nonretrogressing bodhisattva in them to enter the mind of emptiness and always explains the perfection of wisdom wherever he's born, even up to the point of enlightenment so that he doesn't forget it.",
        "source": "T03n0158_004:0258c08_15"
    },
    {
        "source_sentence": "我逮菩提時，令住世十千大劫，般涅槃後正法住世千劫。』",
        "translation": "When I attained enlightenment, I made myself stay in the world for 10,000 great eons, and after parinirvāṇa, the right teaching stayed in the world for 1,000 eons.'",
        "source": "T03n0158_004:0258c09_16"
    },
    {
        "source_sentence": "「佛言：『善哉，善哉！",
        "translation": "The Buddha said, 'Good, good!",
        "source": "T03n0158_004:0258c11_17"
    },
    {
        "source_sentence": "丈夫取淨佛土。",
        "translation": "A man takes the pure Buddha land.",
        "source": "T03n0158_004:0258c11_18"
    },
    {
        "source_sentence": "汝阿閦，於當來世過一恒河沙數阿僧祇，始入二恒河沙，於東方去此千佛土，",
        "translation": "“O Ānanda, in the future aeons you will pass as many eons as there are grains of sand in two Ganges Rivers and leave this thousand buddha-lands in the east.",
        "source": "T03n0158_004:0258c11_19"
    },
    {
        "source_sentence": "有世界名樂喜，莊嚴成就如汝所願。",
        "translation": "There's a world named Blissful Joy, which is adorned and accomplished as you wish.",
        "source": "T03n0158_004:0258c13_20"
    },
    {
        "source_sentence": "汝當於中成阿耨多羅三藐三菩提，即名阿閦如來乃至佛、世尊。』",
        "translation": "You will attain unsurpassed, correct, and complete enlightenment in them, which is called the Tathāgata Akṣobhya or even the Buddha or Bhagavān.'",
        "source": "T03n0158_004:0258c14_21"
    },
    {
        "source_sentence": "阿閦白佛言：『世尊！",
        "translation": "Ānanda said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0258c15_22"
    },
    {
        "source_sentence": "若我如是意滿者，於一切世界中，眾生成陰、界、入有形之類，在眾生數者，",
        "translation": "If my mind is thus fulfilled, then in all the worlds where sentient beings are born, there will be aggregates, realms, and form-entry, which are numbered by sentient beings.",
        "source": "T03n0158_004:0258c16_23"
    },
    {
        "source_sentence": "令彼一切皆得慈心，無怨心，無濁心。",
        "translation": "He causes them all to attain a mind of kindness, a mind free of grudges and unsullied thoughts.",
        "source": "T03n0158_004:0258c18_24"
    },
    {
        "source_sentence": "令彼身意受樂，譬如住十地菩薩入蓮華三昧捨身得淨，使一切眾生身意受樂亦復如是。",
        "translation": "It causes their bodies and minds to experience pleasure, just as a bodhisattva who lives in the tenth ground enters lotus-flower samādhi and abandons his body to attain purity, so does it cause all sentient beings to experience pleasure in body and mind likewise.",
        "source": "T03n0158_004:0258c18_25"
    },
    {
        "source_sentence": "如我五體禮世尊足時，令一切地皆作金色。』",
        "translation": "It's like when I bowed my five bodies at the Bhagavān's feet and caused all the ground to become golden.'",
        "source": "T03n0158_004:0258c21_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0258c22_0"
    },
    {
        "source_sentence": "彼阿閦菩薩五體禮寶藏如來足，即時一切眾生受如是樂，如其所願，彼一切地皆作金色。",
        "translation": "The abhidharma bodhisattva bowed his five bodies at the feet of the jeweled treasure-treasury Tathāgata and immediately all sentient beings experienced such happiness, and all the ground became golden in color according to their wishes.",
        "source": "T03n0158_004:0258c22_1"
    },
    {
        "source_sentence": "「『起住妙意無惱心，　　寶輪最妙在汝手；",
        "translation": "'Arise and abide with subtle intentions without vexation; The finest jeweled wheel is in your hand.",
        "source": "T03n0158_004:0258c24_2"
    },
    {
        "source_sentence": "　　多億眾生得悲心，　　汝當淨意為世尊。』",
        "translation": "Many hundreds of millions of sentient beings attain compassion, so you must be the Bhagavān with pure intentions.'",
        "source": "T03n0158_004:0258c24_2"
    },
    {
        "source_sentence": "寶藏如來言：大乘悲分陀利經諸王子授記品第十二「善男子！",
        "translation": "The Jewel-Store Tathāgata said, Great Vehicle Compassionate Partalipute Sutra:",
        "source": "T03n0158_004:0258c24_2"
    },
    {
        "source_sentence": "爾時海濟婆羅門，語第十王子尼摩尼，略說。",
        "translation": "It was then that the Brāhmaṇa Haiji spoke to the tenth prince, Nirmāṇarati, and explained it briefly.",
        "source": "T03n0158_004:0258c28_3"
    },
    {
        "source_sentence": "王子尼摩尼，其所立願亦如阿閦。",
        "translation": "The princes, nuns, and maṇi, whose vows they establish are likewise like the abhidharma.",
        "source": "T03n0158_004:0258c29_4"
    },
    {
        "source_sentence": "『唯！",
        "translation": "'Yes!",
        "source": "T03n0158_004:0258c29_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0259a01_0"
    },
    {
        "source_sentence": "若我如是意滿，令一切眾生得念佛心；",
        "translation": "If my mind is thus fulfilled, I cause all sentient beings to attain mindfulness of buddha-mind.",
        "source": "T03n0158_004:0259a01_1"
    },
    {
        "source_sentence": "令其手中皆有海此岸栴檀之香；",
        "translation": "He caused the fragrance of sandalwood from this side of the sea to be found in their hands.",
        "source": "T03n0158_004:0259a02_0"
    },
    {
        "source_sentence": "令彼一切以是妙香供養佛像。』",
        "translation": "Let them all make offerings to the Buddha's image with this wonderful fragrance.'",
        "source": "T03n0158_004:0259a02_1"
    },
    {
        "source_sentence": "佛言：『善哉，善哉！",
        "translation": "The Buddha said, 'Good, good!",
        "source": "T03n0158_004:0259a03_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259a03_3"
    },
    {
        "source_sentence": "所願極妙。",
        "translation": "What he wishes for is extremely subtle.",
        "source": "T03n0158_004:0259a04_4"
    },
    {
        "source_sentence": "汝能使一切眾生手中，皆有海此岸栴檀妙香，發念佛心。",
        "translation": "You can cause all sentient beings to have the wonderful fragrance of sandalwood on this side of the ocean in their hands and give rise to the mind of mindfulness of the Buddha.",
        "source": "T03n0158_004:0259a04_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259a05_6"
    },
    {
        "source_sentence": "是故字汝為香手。",
        "translation": "That's why it's called you as the fragrant hand.",
        "source": "T03n0158_004:0259a05_7"
    },
    {
        "source_sentence": "汝香手！",
        "translation": "O you fragrant hand!",
        "source": "T03n0158_004:0259a06_8"
    },
    {
        "source_sentence": "於當來世過一恒河沙數阿僧祇、二恒河沙阿僧祇之餘，阿閦如來般涅槃正法滅已，",
        "translation": "“Furthermore, the Tathāgata Akṣobhya entered nirvana at the end of incalculable aeons past as many eons as there are grains of sand in one Ganges River.",
        "source": "T03n0158_004:0259a06_9"
    },
    {
        "source_sentence": "於後七日，汝香手！",
        "translation": "On the seventh day, your fragrant hand!",
        "source": "T03n0158_004:0259a08_10"
    },
    {
        "source_sentence": "於彼世界成阿耨多羅三藐三菩提，號金華如來、應供、正遍知乃至佛、世尊。』",
        "translation": "In that world, he achieves unsurpassed, correct, and complete enlightenment, which is called the Tathāgata, Worthy of Offerings, Perfectly Enlightened, Up to the Buddha, Bhagavān.'",
        "source": "T03n0158_004:0259a08_11"
    },
    {
        "source_sentence": "香手白佛言：『世尊！",
        "translation": "Gandhapāda said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0259a10_12"
    },
    {
        "source_sentence": "若我如是意滿，我五體禮世尊足時，令此園中周遍雨瞻蔔華。』",
        "translation": "If my mind is thus fulfilled, then when I venerate the Bhagavān's feet with five bodies, I cause it to rain down campaka flowers all over this park.'",
        "source": "T03n0158_004:0259a10_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259a12_14"
    },
    {
        "source_sentence": "爾時香手菩薩五體禮寶藏如來足時，尋遍園中雨瞻蔔華。",
        "translation": "It was then that the fragrant-handed bodhisattva bowed his five bodies at the feet of the jeweled treasury tathāgata and went around the garden raining campaka flowers.",
        "source": "T03n0158_004:0259a12_15"
    },
    {
        "source_sentence": "「『起極妙德意善香，　　雨瞻蔔華周遍園；",
        "translation": "Producing a fragrance of supremely wonderful virtue and good intention, They rained campaka flowers all over the grove.",
        "source": "T03n0158_004:0259a13_16"
    },
    {
        "source_sentence": "　　汝當顯示淨妙道，　　度多眾生無畏岸。』",
        "translation": "You will show the pure and marvelous path and save many sentient beings from the shore of fearlessness.'",
        "source": "T03n0158_004:0259a13_16"
    },
    {
        "source_sentence": "寶藏如來言：「善男子！",
        "translation": "The Ratnaketu Tathāgata said, Good man!",
        "source": "T03n0158_004:0259a13_16"
    },
    {
        "source_sentence": "爾時海濟婆羅門，語第十一王子名師子，略說。",
        "translation": "It was then that the Brāhmaṇa Haiji spoke to the eleventh prince named Shizi, speaking briefly.",
        "source": "T03n0158_004:0259a17_17"
    },
    {
        "source_sentence": "即以寶幢上寶藏如來，『如香手菩薩所願無異。』",
        "translation": "That's when the Tathāgata of the Jeweled Treasury on the jeweled banner says, 'It's no different than what the bodhisattva with fragrant hands wishes for.'",
        "source": "T03n0158_004:0259a18_18"
    },
    {
        "source_sentence": "寶藏如來言：『善哉，善哉！",
        "translation": "The Ratnaketu Tathāgata said, 'Good, good!'",
        "source": "T03n0158_004:0259a19_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259a19_20"
    },
    {
        "source_sentence": "是故字汝為寶勝。",
        "translation": "That's why it's called you the jeweled superior.",
        "source": "T03n0158_004:0259a20_21"
    },
    {
        "source_sentence": "於當來世過一恒河沙數阿僧祇、二恒河沙數阿僧祇之餘，金華如來般涅槃已，",
        "translation": "“Furthermore, in the future buddha-worlds beyond as many eons as there are grains of sand in one Ganges River and beyond as many eons as there are grains of sand in two Ganges Rivers, the Tathāgata Kassapa, having entered nirvana,",
        "source": "T03n0158_004:0259a20_22"
    },
    {
        "source_sentence": "正法滅後竟三劫，樂喜世界當名妙樂，汝當於中成阿耨多羅三藐三菩提，",
        "translation": "\\",
        "source": "T03n0158_004:0259a22_23"
    },
    {
        "source_sentence": "號自在龍雷音如來乃至佛、世尊，國土莊嚴如阿閦佛土無異。』",
        "translation": "They're called the Tathāgata of the Freely Awakened Dragon Thunder, the Tathāgata and even the buddhas and world-honored ones, whose lands are adorned like the Buddha land of Akṣobhya without difference.'",
        "source": "T03n0158_004:0259a24_0"
    },
    {
        "source_sentence": "寶勝白佛言：『世尊！",
        "translation": "Baosheng said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0259a25_1"
    },
    {
        "source_sentence": "若我如是意滿者，禮佛足時，令一切眾生得如是心，如菩薩住平等悲三昧，",
        "translation": "If my mind is thus fulfilled, then when I venerate the Buddha by bowing to his feet I cause all sentient beings to attain this kind of mind, just as a bodhisattva abides in the concentration of impartiality and compassion.",
        "source": "T03n0158_004:0259a25_2"
    },
    {
        "source_sentence": "為饒益一切眾生求菩提者令不退轉。』",
        "translation": "It's to benefit all sentient beings who seek enlightenment and cause them not to regress.'",
        "source": "T03n0158_004:0259a27_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259a28_4"
    },
    {
        "source_sentence": "寶勝菩薩五體禮寶藏如來足時，一切眾生得如是意，謂諸眾生得住悲心。",
        "translation": "When the Jewel Supreme Bodhisattva bowed his five bodies at the feet of the jeweled treasure-store Tathāgata, all sentient beings had this thought, which means that sentient beings were able to abide in compassion.",
        "source": "T03n0158_004:0259a28_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259b01_6"
    },
    {
        "source_sentence": "「『起勇善意大丈夫，　　能因眾生立堅誓；",
        "translation": "'The great hero who gives rise to courageous good intentions Can make a firm vow for sentient beings.",
        "source": "T03n0158_004:0259b01_7"
    },
    {
        "source_sentence": "　　安立多眾無塵心，　　於天世人當作佛。』",
        "translation": "He establishes the mind of many people without dust, and he becomes a buddha among gods and humans.'",
        "source": "T03n0158_004:0259b01_7"
    },
    {
        "source_sentence": "爾時寶藏如來告寶勝菩薩言：「略說。",
        "translation": "It was then that the Jewel-Store Tathāgata addressed the Ratnaketu Bodhisattva, saying, Tell me briefly.",
        "source": "T03n0158_004:0259b01_7"
    },
    {
        "source_sentence": "摩闍披等五百王子，立如是願：『取莊嚴佛土，如虛空印菩薩所願取淨佛土。』",
        "translation": "The five hundred princes Mahāprajāpa and others made this vow: 'Take the Buddha land of adornment, just as the space-seal bodhisattva wishes to take the pure Buddha land.'",
        "source": "T03n0158_004:0259b05_8"
    },
    {
        "source_sentence": "寶藏如來盡皆授阿耨多羅三藐三菩提記：『汝等同時各異世界，當證阿耨多羅三藐三菩提。』",
        "translation": "The Jeweled Treasury Tathāgata then gave them all the assurance of unsurpassed, correct, and complete enlightenment, saying, 'You will realize unsurpassed, correct, and complete enlightenment in each of your different worlds at the same time.'",
        "source": "T03n0158_004:0259b06_9"
    },
    {
        "source_sentence": "復有四百王子，立如是願：『取莊嚴佛土，如斷金剛慧照明菩薩。』",
        "translation": "Again, there are 400 princes who make this vow, 'Take the adornment of the Buddha's land and become like the Bodhisattva Light of Wisdom that Cuts off the Vajra.'",
        "source": "T03n0158_004:0259b08_10"
    },
    {
        "source_sentence": "寶藏如來亦皆授其阿耨多羅三藐三菩提記，各異世界。",
        "translation": "The Jewel-Store Tathāgata also gave them all the assurance of unsurpassed, correct, and complete enlightenment, which differs from world to world.",
        "source": "T03n0158_004:0259b10_11"
    },
    {
        "source_sentence": "復有八十九王子，立如是願：『取莊嚴佛土，如普賢菩薩。』",
        "translation": "Again, there were eighty-nine princes who made this vow, 'Take the adorned Buddha land and make it like Samantabhadra Bodhisattva.'",
        "source": "T03n0158_004:0259b11_12"
    },
    {
        "source_sentence": "又彼八萬四千諸小國王，皆立淨願各取莊嚴淨佛國土。",
        "translation": "The kings of the eighty-four thousand small countries all made a pure vow to each take the adorned pure buddha land.",
        "source": "T03n0158_004:0259b12_13"
    },
    {
        "source_sentence": "寶藏如來悉皆受其阿耨多羅三藐三菩提記，各異世界俱逮菩提。",
        "translation": "The Jeweled Treasury Tathāgatas all received the assurance of their unsurpassed, correct enlightenment, and each differed from the world in that they all attained enlightenment.",
        "source": "T03n0158_004:0259b14_14"
    },
    {
        "source_sentence": "如是九十二億眾生，皆各立願所修淨土，寶藏如來亦盡授阿耨多羅三藐三菩提記：『汝等同時各異世界，",
        "translation": "Thus these ninety-two million sentient beings each established their vows to cultivate the pure land, and the Jewel-Store Tathāgata also gave them all the assurance of unexcelled complete perfect enlightenment:",
        "source": "T03n0158_004:0259b15_15"
    },
    {
        "source_sentence": "當逮阿耨多羅三藐三菩提。』",
        "translation": "You will attain supreme perfect enlightenment.'",
        "source": "T03n0158_004:0259b18_16"
    },
    {
        "source_sentence": "大乘悲分陀利經八十子受記品",
        "translation": "*Mahayana-paripṛcchā(sūtra) of Compassionate Undertaking by the Eighty Children",
        "source": "T03n0158_004:0259b19_0"
    },
    {
        "source_sentence": "第十三",
        "translation": "thirteenth",
        "source": "T03n0158_004:0259b20_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259b21_0"
    },
    {
        "source_sentence": "時海濟婆羅門，有八十子，皆是寶藏如來之弟，其第一者名海自在童真。",
        "translation": "At the time, there were eighty sons of the Brāhmaṇa Haiji, all younger brothers of the Ratnaketu Tathāgata, the first of whom was named Ocean Free Children.",
        "source": "T03n0158_004:0259b21_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259b22_2"
    },
    {
        "source_sentence": "爾時海濟婆羅門，告海自在曰：『今汝童真可取清淨莊嚴佛土。』",
        "translation": "It was then that the Brāhmaṇa Haiji addressed Haeśvara, saying, 'Now, you children, may you truly take the pure and adorned Buddha land.'",
        "source": "T03n0158_004:0259b23_0"
    },
    {
        "source_sentence": "海自在言：『大師應先作師子吼。』",
        "translation": "The sovereign of the sea said, 'The great master should first make a lion's roar.'",
        "source": "T03n0158_004:0259b24_1"
    },
    {
        "source_sentence": "大師告言：『我所思願後乃說之。』",
        "translation": "The great teacher told him, 'I'll explain it after I think about it.'",
        "source": "T03n0158_004:0259b25_2"
    },
    {
        "source_sentence": "彼即白言：『我為取淨土，取不淨耶？』",
        "translation": "He then said, 'Did I take the pure land or the impure land?'",
        "source": "T03n0158_004:0259b25_3"
    },
    {
        "source_sentence": "大師告言：『其有菩薩具大悲者，取不淨土度諸濁意倒見眾生。",
        "translation": "The great teacher told them, 'There's a bodhisattva with great compassion who takes the impure land and saves sentient beings with turbid thoughts that mistakenly see it.",
        "source": "T03n0158_004:0259b26_4"
    },
    {
        "source_sentence": "汝童真！",
        "translation": "You,童真!",
        "source": "T03n0158_004:0259b28_5"
    },
    {
        "source_sentence": "自可知之。』",
        "translation": "You can know it for yourself.'",
        "source": "T03n0158_004:0259b28_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259b28_7"
    },
    {
        "source_sentence": "時海自在童真至寶藏如來前白佛言：『世尊！",
        "translation": "At the time, the Tathāgata of the Pure Jeweled Treasury of the Freely Enlightened童真至寶藏如來前白佛言,『世尊!",
        "source": "T03n0158_004:0259b28_8"
    },
    {
        "source_sentence": "我求阿耨多羅三藐三菩提，亦於如是八萬歲世人中證妙菩提，如今世尊。",
        "translation": "I've sought unsurpassed, correct, and complete enlightenment, and I've also realized marvelous enlightenment among people like this 80,000 years old, which is the present Bhagavān.",
        "source": "T03n0158_004:0259b29_9"
    },
    {
        "source_sentence": "願令眾生少於貪欲、瞋恚、愚癡等畏，能於生死以身為患，令於我所而得出家，",
        "translation": "May I cause sentient beings to be free from the fear of desire, hatred, folly, and so forth. May I cause them to become afflicted by birth-and-death in order to leave home with regard to me?",
        "source": "T03n0158_004:0259c02_10"
    },
    {
        "source_sentence": "我亦當以三乘為眾說法。",
        "translation": "I will also teach the Dharma for the sake of sentient beings in the three vehicles.",
        "source": "T03n0158_004:0259c04_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0259c04_12"
    },
    {
        "source_sentence": "若我如是意滿者，唯願世尊，當授我阿耨多羅三藐三菩提記。』",
        "translation": "If my mind is thus fulfilled, may the Bhagavān grant me the assurance of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0158_004:0259c04_13"
    },
    {
        "source_sentence": "寶藏佛言：『汝於來世過一恒河沙數阿僧祇，始入二恒河沙數阿僧祇，",
        "translation": "The Buddha Jewel-Store Buddha said: In the future you will pass through as many eons as there are grains of sand in one Ganges River, and enter as many eons as there are grains of sand in two Ganges Rivers.",
        "source": "T03n0158_004:0259c06_14"
    },
    {
        "source_sentence": "於散華劫時此佛土四天下當名妙勝，於八萬歲人中當逮菩提，號寶積如來乃至佛世尊。』",
        "translation": "During the scattered-flower eon, these four worlds of the Buddha's land will be called marvelous and superior, and among people 80,000 years old, they'll attain enlightenment, which is called the Ratnaketu Tathāgata or even the Bhagavān.'",
        "source": "T03n0158_004:0259c07_15"
    },
    {
        "source_sentence": "白佛言：『世尊！",
        "translation": "He said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0259c10_0"
    },
    {
        "source_sentence": "若我如是意滿者，令遍此園雨赤真珠，一切樹上出五樂音。』",
        "translation": "If my mind is thus fulfilled, I'll cause red real pearls to rain down from this park and five musical sounds to appear on top of all the trees.'",
        "source": "T03n0158_004:0259c10_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0259c11_2"
    },
    {
        "source_sentence": "海自在童真，五體禮寶藏如來足時，遍於園中雨赤真珠，一切樹上出五樂音。",
        "translation": "When the five-bodied Bodhisattva of freedom in the ocean bowed at the feet of the Tathāgata with his feet, he rained red genuine pearls all over the garden and produced five musical sounds from all the trees.",
        "source": "T03n0158_004:0259c11_3"
    },
    {
        "source_sentence": "「『起大勢力無盡慧，　　慈心眾庶愍傷仙；",
        "translation": "They give rise to great power and inexhaustible wisdom, compassionate toward all sentient beings and pitying the sages.",
        "source": "T03n0158_004:0259c13_4"
    },
    {
        "source_sentence": "　　所求當滿淨眾生，　　為群黎故世成佛。』",
        "translation": "What's sought will fulfill pure sentient beings and become buddhas in the world for the sake of all living beings.'",
        "source": "T03n0158_004:0259c13_4"
    },
    {
        "source_sentence": "寶藏如來言：「婆羅門第二子名曰成就，彼作是言：『如海自在所可立願，",
        "translation": "The Jewel-Store Tathāgata said, “The second son of the brāhmaṇa Candracchattra is called Sarvasaṃdarśana.",
        "source": "T03n0158_004:0259c13_4"
    },
    {
        "source_sentence": "我亦如是。』",
        "translation": "So it is with me.'",
        "source": "T03n0158_004:0259c17_5"
    },
    {
        "source_sentence": "略說。",
        "translation": "It's briefly explained.",
        "source": "T03n0158_004:0259c17_6"
    },
    {
        "source_sentence": "寶藏佛言：『汝童真，亦於散華劫妙勝佛土中四天下，於八萬歲世人中汝當成佛，",
        "translation": "The Buddha Jewel-Store Buddha said, 'You children, truly, you will also become a buddha among the people of the four continents in the wonderful buddha-lands of the scattered lotus eon, and you will be a buddha among the people of the eighty thousand years.",
        "source": "T03n0158_004:0259c17_7"
    },
    {
        "source_sentence": "號照明華如來乃至佛世尊。』",
        "translation": "He's called the Illuminating Flower Tathāgata or even the Bhagavān.'",
        "source": "T03n0158_004:0259c19_8"
    },
    {
        "source_sentence": "略。",
        "translation": "It's brief.",
        "source": "T03n0158_004:0259c20_9"
    },
    {
        "source_sentence": "告第三言：『汝於二千歲人中當逮菩提，號月持王如來乃至佛世尊。』",
        "translation": "He told the third, saying, 'You will attain enlightenment among people  2,000 years old, and you'll be called the moon-holding king tathāgata or even the Bhagavān.'",
        "source": "T03n0158_004:0259c20_10"
    },
    {
        "source_sentence": "略說授記：須摩那如來、山王如來、制眼如來、梵上如來、閻浮影如來、滿如來、高如來、寶山如來、海藏如來、那羅延如來、尸軀那牟尼如來、牟尼主如來、憍陳如如來、師子步如來、智幢如來、佛聲如來、最勝如來、開化如來、饒益如來、慧明如來、帝主如來、寂慧如來、作喜如來、無怒王如來、金銀如來、摩醯覩如來、日喜如來、寶髮如來、善明如來、背摩如來、善喜如來、梵征如來、吼如來、法月如來、現議如來、稱喜如來、稱上如來、端正香如來、四妙根如來、須尼闍覩如來、適遶如來、善意如來、妙乘慧如來、金幢如來、善目如來、天淨如來、淨道如來、善現如來、乘幢如來、毘樓波叉如來、梵音如來、德聚如來、德無塵如來、摩尼光如來、焰氣如來、釋迦牟尼如來、音自在如來、爾成如來、最尊如來、華成如來、等華如來、無惱如來、日藏如來、樂自在如來、月如來、龍齒如來、金剛照如來、稱王如來、常光如來、勝光如來、薩泥斫如來、智成如來、香自在如來、婆羅主如來、那羅延藏如來、月藏如來。",
        "translation": "略說授記:須摩那如來、山王如來、制眼如來、梵上如來、閻浮影如來、滿如來、高如來、寶山如來、海藏如來、那羅延如來、那羅延如來、尸體那牟尼如來、牟尼主如來、陳如如如如來、師子",
        "source": "T03n0158_004:0259c21_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260a12_12"
    },
    {
        "source_sentence": "其大師最後幼子名無恐畏，彼白寶藏如來言：『世尊授此七十九童真記，",
        "translation": "The last child of the great teacher, named Fearless, said to the Buddha Ratnacchattra, “O Bhagavat!",
        "source": "T03n0158_004:0260a13_13"
    },
    {
        "source_sentence": "於散華劫成阿耨多羅三藐三菩提。",
        "translation": "In the scattered-flower eon, he achieves unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0158_004:0260a14_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0260a15_15"
    },
    {
        "source_sentence": "我當發阿耨多羅三藐三菩提心盡散華劫。",
        "translation": "I will give rise to the mind of unsurpassed, correct, and complete enlightenment for as many kalpas as there are flowers in the sky.",
        "source": "T03n0158_004:0260a15_16"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0260a16_17"
    },
    {
        "source_sentence": "令我最後證妙菩提，如彼七十九佛壽命。",
        "translation": "It will cause me to finally realize marvelous enlightenment, just like the lives of those seventy-nine buddhas.",
        "source": "T03n0158_004:0260a16_18"
    },
    {
        "source_sentence": "令我逮菩提時授獨與等，如彼所度願我亦等。",
        "translation": "When I attain enlightenment, I'll be given it to them alone and so forth, and as they save me with their vow, I'll be likewise.",
        "source": "T03n0158_004:0260a17_19"
    },
    {
        "source_sentence": "彼三乘化，我亦當說三乘之法。",
        "translation": "To transform those three vehicles, I will also explain the teachings of the three vehicles.",
        "source": "T03n0158_004:0260a18_20"
    },
    {
        "source_sentence": "如彼所有聲聞僧數，我得佛時聲聞亦等。",
        "translation": "Just as they have the number of śrāvakas and saṃgha, so too are the śrāvakas when I attain Buddhahood.",
        "source": "T03n0158_004:0260a19_21"
    },
    {
        "source_sentence": "如彼七十九佛出世於散華劫，所有眾生得受人形，半劫盡時我逮阿耨多羅三藐三菩提，",
        "translation": "“Furthermore, just as when those seventy-nine buddhas appeared in the world during the scattered lotus eon, all sentient beings were able to receive their human forms, I attained unexcelled complete perfect enlightenment at the end of the half-eon.",
        "source": "T03n0158_004:0260a20_22"
    },
    {
        "source_sentence": "我當使彼一切眾生住於三乘。",
        "translation": "I will cause all those sentient beings to abide in the three vehicles.",
        "source": "T03n0158_004:0260a22_23"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0260a23_24"
    },
    {
        "source_sentence": "若我如是意滿者，佛當授我阿耨多羅三藐三菩提記。』",
        "translation": "If my mind is thus fulfilled, the Buddha will give me the assurance of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0158_004:0260a23_25"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260a24_26"
    },
    {
        "source_sentence": "爾時寶藏如來讚無恐畏言：『善哉，善哉！",
        "translation": "It was then that the Ratnaketu Tathāgata praised fearlessness and said, 'Good, good!'",
        "source": "T03n0158_004:0260a24_27"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260a25_28"
    },
    {
        "source_sentence": "汝能為過數眾生大悲饒益，汝於來世過一恒河沙數阿僧祇、入二恒河沙數阿僧祇，",
        "translation": "In the future you will benefit sentient beings whose number is too great to be counted. You will go beyond as many eons as there are grains of sand in one Ganges River and enter into as many eons as there are grains of sand in two Ganges Rivers.",
        "source": "T03n0158_004:0260a25_29"
    },
    {
        "source_sentence": "散華劫半盡時，汝當最後成阿耨多羅三藐三菩提，號無上勇王如來乃至佛、世尊；",
        "translation": "At the end of the half-eon scattered flowers eon, you will finally attain unexcelled complete perfect enlightenment, named Supreme Courageous King Tathāgata, up to Buddha and Bhagavat.",
        "source": "T03n0158_004:0260a27_30"
    },
    {
        "source_sentence": "如彼七十九佛共壽半劫，汝當獨壽半劫，乃至如汝所願悉皆當成。』",
        "translation": "Just as those seventy-nine buddhas have a shared life span of half an eon, you will have a separate life span of half an eon, and whatever you wish will be accomplished.'",
        "source": "T03n0158_004:0260a29_31"
    },
    {
        "source_sentence": "彼白佛言：『世尊！",
        "translation": "They said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0260b02_32"
    },
    {
        "source_sentence": "若我如意滿者，五體禮世尊足時，令此佛土普雨青蓮華極妙甚香，其有眾生聞是香氣，",
        "translation": "If my supernormal powers are fulfilled, I will cause this buddha-field to rain down blue lotus blossoms with a most wonderful fragrance when five bodies prostrate at the feet of the World-honored One. Those living beings who hear these fragrances",
        "source": "T03n0158_004:0260b02_33"
    },
    {
        "source_sentence": "四大調和眾病皆愈。』",
        "translation": "The four elements are well-adjusted, and all illnesses are healed.'",
        "source": "T03n0158_004:0260b04_34"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260b05_35"
    },
    {
        "source_sentence": "如無恐畏童真五體禮寶藏如來足，應時一切佛土雨青蓮華，眾生聞香彼一切四大調和眾病皆愈。",
        "translation": "Like the five-bodied, fearless boy who pays homage to the feet of the jeweled treasury buddha, it's appropriate for all the buddha lands to rain blue lotus flowers, and sentient beings who hear the fragrance will be cured by the four elements that harmonize with their illnesses.",
        "source": "T03n0158_004:0260b05_36"
    },
    {
        "source_sentence": "「『起習大悲善調心，　　多妙世尊皆敬汝；",
        "translation": "'Arouse great compassion and well regulate your mind, And many wonderful world-honored ones will revere you.",
        "source": "T03n0158_004:0260b07_37"
    },
    {
        "source_sentence": "　　諂結慳結如能斷，　　當得淨妙智慧藏。』",
        "translation": "If you can cut the bond of flattery and the bond of stinginess, you'll attain the store of pure and marvelous wisdom.'",
        "source": "T03n0158_004:0260b07_37"
    },
    {
        "source_sentence": "寶藏如來言：大乘悲分陀利經三億少童子受記品第十四「善男子！",
        "translation": "The Jewel-Store Tathāgata said, Great Vehicle Compassionate Partridge Sutra: Three Hundred Thousand Young Children Who Have Accepted the Teaching, Chapter 14 Good sons!",
        "source": "T03n0158_004:0260b07_37"
    },
    {
        "source_sentence": "時海濟婆羅門三億弟子，謂在園門坐，有人來為我三歸勸以菩提者。",
        "translation": "At the time, 300 million disciples of the Brāhmaṇa Haiji were sitting at the park's entrance, and someone came to offer me three refuges to encourage them to achieve enlightenment.",
        "source": "T03n0158_004:0260b12_38"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260b13_39"
    },
    {
        "source_sentence": "爾時海濟婆羅門告諸弟子言：『汝等童子，可發阿耨多羅三藐三菩提心，",
        "translation": "It was then that the brāhmaṇa Hayagrīva said to his disciples: Young men and women, give rise to the aspiration for highest, complete enlightenment.",
        "source": "T03n0158_004:0260b13_40"
    },
    {
        "source_sentence": "各隨所欲而取佛土，在如來前隨意發願。』",
        "translation": "Each one takes the Buddha's land as he wishes and makes a vow before the Tathāgata as he wishes.'",
        "source": "T03n0158_004:0260b15_41"
    },
    {
        "source_sentence": "其弟子中，有一童子名曰月忍，彼白師言：『是道云何？",
        "translation": "Among his disciples, there was a boy named Moon Forbearance who said to the teacher, 'What's the path?'",
        "source": "T03n0158_004:0260b16_42"
    },
    {
        "source_sentence": "當積何德、修何行、作何念而得菩提？』",
        "translation": "What virtue will you accumulate, cultivate, practice, and think of to attain enlightenment?'",
        "source": "T03n0158_004:0260b17_43"
    },
    {
        "source_sentence": "大師告曰：『童子！",
        "translation": "The great teacher told him, 'Boy!",
        "source": "T03n0158_004:0260b18_44"
    },
    {
        "source_sentence": "菩薩具四無量藏得逮菩提。",
        "translation": "The bodhisattva possesses the four immeasurable stores to attain enlightenment.",
        "source": "T03n0158_004:0260b18_45"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T03n0158_004:0260b19_46"
    },
    {
        "source_sentence": "具無盡福藏，具無盡智藏，具無盡慧藏，具無盡一切佛法藏，是名具足四無盡藏。",
        "translation": "To have an inexhaustible store of merit, an inexhaustible store of knowledge, an inexhaustible store of wisdom, and an inexhaustible store of all the Buddha's teachings are called having four inexhaustible stores.",
        "source": "T03n0158_004:0260b19_47"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260b21_48"
    },
    {
        "source_sentence": "如來說如是菩提道，名總集淨德度生死法門。",
        "translation": "The Tathāgata teaches the path of enlightenment like this, which is called the Dharma aspect of the general accumulation of pure virtue to save sentient beings from birth-and-death.",
        "source": "T03n0158_004:0260b21_49"
    },
    {
        "source_sentence": "菩薩具足行施，為度眾生故；",
        "translation": "Enlightening beings practice giving fully, wanting to liberate sentient beings.",
        "source": "T03n0158_004:0260b22_50"
    },
    {
        "source_sentence": "菩薩具足持戒，為滿願故；",
        "translation": "Enlightening beings are endowed with observance of precepts because they fulfill their vows.",
        "source": "T03n0158_004:0260b23_51"
    },
    {
        "source_sentence": "菩薩具足忍辱，成相好故；",
        "translation": "Enlightening beings are endowed with forbearance because they develop good characteristics.",
        "source": "T03n0158_004:0260b24_52"
    },
    {
        "source_sentence": "菩薩具足精進，以辦眾事故；",
        "translation": "Enlightening beings are endowed with energy to accomplish all things.",
        "source": "T03n0158_004:0260b24_53"
    },
    {
        "source_sentence": "菩薩具足禪，以調心故；",
        "translation": "Enlightening beings are endowed with meditation because they regulate their minds.",
        "source": "T03n0158_004:0260b25_54"
    },
    {
        "source_sentence": "菩薩具足慧，以滅諸結故；",
        "translation": "Enlightening beings are endowed with wisdom because they extinguish all fetters.",
        "source": "T03n0158_004:0260b25_55"
    },
    {
        "source_sentence": "菩薩具足聞，為阿僧祇辯才故；",
        "translation": "Enlightening beings are fully enlightened, for the sake of innumerable powers of elucidation.",
        "source": "T03n0158_004:0260b26_56"
    },
    {
        "source_sentence": "菩薩具足功德，潤益一切眾生故；",
        "translation": "Enlightening beings are replete with virtue, nourishing all sentient beings.",
        "source": "T03n0158_004:0260b27_57"
    },
    {
        "source_sentence": "菩薩具足智，為阿僧祇智故；",
        "translation": "Enlightening beings are endowed with knowledge because they want incalculable knowledge.",
        "source": "T03n0158_004:0260b27_58"
    },
    {
        "source_sentence": "菩薩具足止，隨心作故；",
        "translation": "Enlightening beings are endowed with tranquility, because they do so according to their minds.",
        "source": "T03n0158_004:0260b28_59"
    },
    {
        "source_sentence": "菩薩具足觀，為除疑惑故；",
        "translation": "Enlightening beings are endowed with contemplation, to remove doubt and confusion.",
        "source": "T03n0158_004:0260b29_60"
    },
    {
        "source_sentence": "菩薩具足慈，為心無礙故；",
        "translation": "Enlightening beings are endowed with compassion because their minds are unhindered.",
        "source": "T03n0158_004:0260b29_61"
    },
    {
        "source_sentence": "菩薩具足悲，為度化無疲厭故；",
        "translation": "Enlightening beings are imbued with compassion, unwearied and tireless in liberation.",
        "source": "T03n0158_004:0260c01_62"
    },
    {
        "source_sentence": "菩薩具足喜，為樂法喜故；",
        "translation": "Enlightening beings are endowed with joy because they delight in the joy of truth.",
        "source": "T03n0158_004:0260c02_63"
    },
    {
        "source_sentence": "菩薩具足捨，為除愛憎故；",
        "translation": "Enlightening beings are endowed with relinquishment, to get rid of craving and hatred.",
        "source": "T03n0158_004:0260c02_64"
    },
    {
        "source_sentence": "菩薩具足摩沙門，為除障礙故；",
        "translation": "Enlightening beings are fully endowed with the gate of space, because they get rid of obstacles.",
        "source": "T03n0158_004:0260c03_65"
    },
    {
        "source_sentence": "菩薩具足出家，為捨一切有為故；",
        "translation": "Enlightening beings leave home fully, abandoning all conditioned things.",
        "source": "T03n0158_004:0260c03_66"
    },
    {
        "source_sentence": "菩薩具足閑居，為滅不善業修益善業故；",
        "translation": "Enlightening beings are supplied with leisurely abode, to extinguish unwholesome actions and cultivate wholesome actions.",
        "source": "T03n0158_004:0260c04_67"
    },
    {
        "source_sentence": "菩薩具足念，為得持故；",
        "translation": "Enlightening beings are imbued with mindfulness because they attain and uphold it.",
        "source": "T03n0158_004:0260c05_68"
    },
    {
        "source_sentence": "菩薩具足意，為覺深解故；",
        "translation": "Enlightening beings are endowed with will because they awaken to profound understanding.",
        "source": "T03n0158_004:0260c06_69"
    },
    {
        "source_sentence": "菩薩具足強志，為覺義故；",
        "translation": "Enlightening beings are endowed with strong determination because of the meaning of enlightenment.",
        "source": "T03n0158_004:0260c06_70"
    },
    {
        "source_sentence": "菩薩具足念處，為觀身、受、心、法故；",
        "translation": "Enlightening beings are endowed with the state of mindfulness because they contemplate body, sensation, mind, and phenomena.",
        "source": "T03n0158_004:0260c07_71"
    },
    {
        "source_sentence": "菩薩具足正捨，為捨一切不善法修滿一切善故；",
        "translation": "Enlightening beings are endowed with right relinquishment because they relinquish all unwholesome states and cultivate all wholesomeness.",
        "source": "T03n0158_004:0260c08_72"
    },
    {
        "source_sentence": "菩薩具足神通，為輕身心故；",
        "translation": "Enlightening beings are endowed with supernatural powers because they despise body and mind.",
        "source": "T03n0158_004:0260c09_73"
    },
    {
        "source_sentence": "菩薩具足根，為滿攝根故；",
        "translation": "Enlightening beings are endowed with faculties, because they want to fulfill the means of collecting faculties.",
        "source": "T03n0158_004:0260c09_74"
    },
    {
        "source_sentence": "菩薩具足力，為伏一切結使故；",
        "translation": "Enlightening beings are endowed with the power of overcoming all bonds and tendencies.",
        "source": "T03n0158_004:0260c10_75"
    },
    {
        "source_sentence": "菩薩具足覺分，為覺實法故；",
        "translation": "Enlightening beings are endowed with the state of awakening because they perceive reality.",
        "source": "T03n0158_004:0260c11_76"
    },
    {
        "source_sentence": "菩薩具足六和敬法，為淨應度者心故。",
        "translation": "The bodhisattva is fully endowed with the six harmonious and respectful dharmas because he's purifying the mind of those who should be liberated.",
        "source": "T03n0158_004:0260c11_77"
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T03n0158_004:0260c12_78"
    },
    {
        "source_sentence": "是名總具足淨度生死法門。』",
        "translation": "This is called the Dharma teaching of the universally complete purification of birth-and-death.'",
        "source": "T03n0158_004:0260c12_79"
    },
    {
        "source_sentence": "「彼白師言：『聞世尊說：「布施得大富，饒益諸眷屬；",
        "translation": "“Then he said to his teacher: I have heard the World-honored One teach that generosity brings great wealth and benefits all the members of the sangha.",
        "source": "T03n0158_004:0260c13_80"
    },
    {
        "source_sentence": "持戒得生天；",
        "translation": "Observing precepts enables one to be reborn in heaven.",
        "source": "T03n0158_004:0260c14_81"
    },
    {
        "source_sentence": "多聞得大慧。",
        "translation": "He's well-versed and attained great wisdom.",
        "source": "T03n0158_004:0260c14_82"
    },
    {
        "source_sentence": "世尊說修淨，為度生死故。」』",
        "translation": "The Bhagavān teaches that cultivation of purity is for the sake of liberating people from birth and death.'",
        "source": "T03n0158_004:0260c15_83"
    },
    {
        "source_sentence": "大師告曰：『童子！",
        "translation": "The great teacher told him, 'Boy!",
        "source": "T03n0158_004:0260c15_84"
    },
    {
        "source_sentence": "有樂生死施者，如汝所說。",
        "translation": "Giving with pleasure of birth-and-death is as you say.",
        "source": "T03n0158_004:0260c16_85"
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T03n0158_004:0260c16_86"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260c16_87"
    },
    {
        "source_sentence": "善女人！",
        "translation": "Good woman!",
        "source": "T03n0158_004:0260c17_88"
    },
    {
        "source_sentence": "信菩提道施者，為調伏心故；",
        "translation": "Giving to those who believe in the path of enlightenment is to pacify the mind.",
        "source": "T03n0158_004:0260c17_89"
    },
    {
        "source_sentence": "持戒為滅心故；",
        "translation": "Observing precepts is cessation of thought.",
        "source": "T03n0158_004:0260c17_90"
    },
    {
        "source_sentence": "求聞為除心濁故；",
        "translation": "Seeking to hear is to remove mental turbidity.",
        "source": "T03n0158_004:0260c18_91"
    },
    {
        "source_sentence": "修悲為大悲心故；",
        "translation": "The practice of compassion is the heart of great compassion.",
        "source": "T03n0158_004:0260c18_92"
    },
    {
        "source_sentence": "餘法以智慧方便具足集行。",
        "translation": "The other dharmas are fully collected and practiced with wisdom and skillful means.",
        "source": "T03n0158_004:0260c19_93"
    },
    {
        "source_sentence": "童子！",
        "translation": "Boy!",
        "source": "T03n0158_004:0260c19_94"
    },
    {
        "source_sentence": "此是菩提道，具足集如是德、如是修、如是念，乃逮菩提。",
        "translation": "This is the path of enlightenment, and it's when they fully gather such virtue, cultivate it, and think about it that they attain enlightenment.",
        "source": "T03n0158_004:0260c19_95"
    },
    {
        "source_sentence": "諸童子！",
        "translation": "My dear children!",
        "source": "T03n0158_004:0260c21_96"
    },
    {
        "source_sentence": "菩提道行如是。",
        "translation": "Such is the practice of the path to enlightenment.",
        "source": "T03n0158_004:0260c21_97"
    },
    {
        "source_sentence": "諸童子！",
        "translation": "My dear children!",
        "source": "T03n0158_004:0260c21_98"
    },
    {
        "source_sentence": "可求菩提。",
        "translation": "They can seek enlightenment.",
        "source": "T03n0158_004:0260c21_99"
    },
    {
        "source_sentence": "諸童子！",
        "translation": "My dear children!",
        "source": "T03n0158_004:0260c22_100"
    },
    {
        "source_sentence": "菩提道淨，應至意立願，必當得滿。",
        "translation": "The path to enlightenment is pure, so you should make a vow with sincerity that it will surely be fulfilled.",
        "source": "T03n0158_004:0260c22_101"
    },
    {
        "source_sentence": "諸童子！",
        "translation": "My dear children!",
        "source": "T03n0158_004:0260c23_0"
    },
    {
        "source_sentence": "菩提道淨以意淨故。",
        "translation": "The path of enlightenment is purified because the mind is purified.",
        "source": "T03n0158_004:0260c23_1"
    },
    {
        "source_sentence": "諸童子！",
        "translation": "My dear children!",
        "source": "T03n0158_004:0260c23_2"
    },
    {
        "source_sentence": "菩提道直，淨除諸結無諂偽故。",
        "translation": "The path of enlightenment is straightforward because it purifies and removes the bonds without flattery or hypocrisy.",
        "source": "T03n0158_004:0260c23_3"
    },
    {
        "source_sentence": "諸童子！",
        "translation": "My dear children!",
        "source": "T03n0158_004:0260c24_4"
    },
    {
        "source_sentence": "菩提道乃至安隱無上涅槃際故。",
        "translation": "It's because it's the path of enlightenment up to the level of peaceful, unsurpassed nirvāṇa.",
        "source": "T03n0158_004:0260c24_5"
    },
    {
        "source_sentence": "是故汝等，今可立願，隨取嚴淨不淨佛土。』",
        "translation": "Therefore, you may now make a vow to follow the purity and impurity of the Buddha land.'",
        "source": "T03n0158_004:0260c25_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0260c26_7"
    },
    {
        "source_sentence": "爾時月忍童子至寶藏如來前，右膝著地叉手合掌而白佛言：『世尊！",
        "translation": "It was then that the moon-forbearing boy went to the front of the Jeweled Treasury Tathāgata, knelt with his right knee on the ground, joined his palms and said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0260c26_8"
    },
    {
        "source_sentence": "我今欲發阿耨多羅三藐三菩提心，於此濁佛土中眾生，少於貪欲、瞋恚、愚癡，",
        "translation": "I now want to give rise to the mind of unexcelled, complete perfect enlightenment so that all sentient beings in this turbid buddha-land will have few desires, anger, and folly.",
        "source": "T03n0158_004:0260c28_9"
    },
    {
        "source_sentence": "無忘失，無濁心、無怨心、無慳嫉心，無邪見心住正見心，無不善心常求善心，",
        "translation": "They have no forgetfulness, no turbid thoughts, no thoughts of enmity or hatred, no thoughts of stinginess or jealousy, no thoughts of wrong views and abiding in thoughts of right views, no thoughts that are not unwholesome and always seeking wholesome thoughts.",
        "source": "T03n0158_004:0261a01_0"
    },
    {
        "source_sentence": "無三惡趣心求人天心，集三福地善根心，求三乘心，我當於是中成阿耨多羅三藐三菩提。",
        "translation": "If someone doesn't have the mind of seeking heaven in the three bad destinies, the mind of accumulating good roots in the three virtuous stages, and the mind of seeking the three vehicles, then they'll attain unsurpassed, correct, and complete enlightenment there.",
        "source": "T03n0158_004:0261a02_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0261a04_2"
    },
    {
        "source_sentence": "若我如意滿者，令我兩手有自然龍象。』",
        "translation": "If my wish is fulfilled, I'll have a natural dragon elephant in both hands.'",
        "source": "T03n0158_004:0261a04_3"
    },
    {
        "source_sentence": "適發言已，蒙佛神力，於兩手中有自然龍象，其身純白七支具足。",
        "translation": "As soon as he had uttered these words, the Buddha's miraculous powers caused a natural dragon elephant to appear in both hands, whose body was pure white and fully endowed with seven limbs.",
        "source": "T03n0158_004:0261a05_4"
    },
    {
        "source_sentence": "躬自目見而告之曰：『汝二龍象，上昇虛空周遍此土，降極香妙八功德雨，",
        "translation": "Seeing it with his own eyes, he said to them: You two dragons and elephants have ascended up into the sky to pervade all over this land and showered down rain of the eight most fragrant and wonderful qualities.",
        "source": "T03n0158_004:0261a07_5"
    },
    {
        "source_sentence": "覺此佛土一切眾生；",
        "translation": "They awaken all sentient beings of this buddha-land.",
        "source": "T03n0158_004:0261a08_6"
    },
    {
        "source_sentence": "令此雨渧觸眾生身，有聞香者令除五蓋，謂愛、睡、掉、悔、疑。』",
        "translation": "It causes this rain to touch the bodies of sentient beings and those who hear it to remove the five hindrances, which are craving, sleep, agitation, remorse, and doubt.'",
        "source": "T03n0158_004:0261a09_7"
    },
    {
        "source_sentence": "適發是言，彼二龍象即昇虛空，如是健速，如大力士放箭甚疾。",
        "translation": "When he spoke these words, those two dragons and elephants rose up into the sky, thus as fast as a great man who releases an arrow so swiftly.",
        "source": "T03n0158_004:0261a10_8"
    },
    {
        "source_sentence": "彼二龍象如向所說，事訖而還在其前立。",
        "translation": "Those two dragons and elephants were as described above, but when the task was over they remained standing in front of him.",
        "source": "T03n0158_004:0261a12_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0261a13_10"
    },
    {
        "source_sentence": "爾時月忍童子極大歡喜。",
        "translation": "At that point, the moon-forbearing boy was overjoyed.",
        "source": "T03n0158_004:0261a13_11"
    },
    {
        "source_sentence": "時寶藏如來告彼言：『汝善男子！",
        "translation": "The Jewel-Store Tathāgata then addressed them, saying, 'You good sons!",
        "source": "T03n0158_004:0261a13_12"
    },
    {
        "source_sentence": "於當來世過一恒河沙數阿僧祇、始入二恒河沙阿僧祇，於照明劫明集佛土，",
        "translation": "In the future aeons he passed as many eons as there are grains of sand in one Ganges River and entered as many eons as there are grains of sand in two Ganges Rivers.",
        "source": "T03n0158_004:0261a14_13"
    },
    {
        "source_sentence": "此四天下，汝當成佛，號寶蓋勇光如來乃至佛世尊。』",
        "translation": "In these four worlds, you will become a buddha named Jeweled Canopy of Courageous Light Tathāgata or even Buddha Bhagavān.'",
        "source": "T03n0158_004:0261a16_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0261a17_15"
    },
    {
        "source_sentence": "爾時月忍菩薩，五體禮寶藏如來足。",
        "translation": "It was then that the Moon Forbearance Bodhisattva bowed his five bodies at the feet of the Jeweled Treasury Tathāgata.",
        "source": "T03n0158_004:0261a17_16"
    },
    {
        "source_sentence": "「『起汝無塵心甚淨，　　汝授多億眾生記；",
        "translation": "You give rise to a mind free from defilement that is extremely pure, And you entrust it to many billions of sentient beings.",
        "source": "T03n0158_004:0261a18_17"
    },
    {
        "source_sentence": "　　淨治菩提最妙道，　　汝當得仙導眾生。』",
        "translation": "The most wonderful path of purifying enlightenment, you will attain the sage's ability to guide sentient beings.'",
        "source": "T03n0158_004:0261a18_17"
    },
    {
        "source_sentence": "寶藏言：「略說。",
        "translation": "The jeweled store said, I'll explain it briefly.",
        "source": "T03n0158_004:0261a18_17"
    },
    {
        "source_sentence": "千人不滿，三億童子於此佛土立阿耨多羅三藐三菩提願，寶藏如來皆授彼記。",
        "translation": "A thousand people didn't fulfill it, and 300 million children established the vow for unsurpassed, correct, and complete enlightenment in this Buddha land, and the Ratnaketu Tathāgata gave them their predictions.",
        "source": "T03n0158_004:0261a21_18"
    },
    {
        "source_sentence": "其最後者，名毘波尸如來、式棄如來、鞞尸羅披如來。",
        "translation": "The last one is named the Tathāgata Vipaśyin, the Tathāgata Śikhin, and the Tathāgata Kauśinagara.",
        "source": "T03n0158_004:0261a22_19"
    },
    {
        "source_sentence": "是授童子記也。",
        "translation": "This is the assurance that he'll give the boy a prediction.",
        "source": "T03n0158_004:0261a24_20"
    },
    {
        "source_sentence": "大乘悲分陀利經千童子受記品",
        "translation": "*Mahayana-paripṛcchā(sūtra) of Compassionate Partridge, Chapter on the Acceptance of the Teachings by a Thousand Children",
        "source": "T03n0158_004:0261a25_0"
    },
    {
        "source_sentence": "第十五",
        "translation": "fifteenth",
        "source": "T03n0158_004:0261a26_0"
    },
    {
        "source_sentence": "「彼千童子，皆通四鞞陀，其最大者師而事之，名披由毘師紐。",
        "translation": "“These thousand children all had the four kinds of supernormal knowledge. The youngest of them all studied under a teacher named Piyuviśeṣaṇu.",
        "source": "T03n0158_004:0261a27_0"
    },
    {
        "source_sentence": "彼言：『我欲於彼五濁佛土證阿耨多羅三藐三菩提；",
        "translation": "They said, ‘I want to attain unexcelled complete perfect enlightenment in those five turbid buddha-lands.",
        "source": "T03n0158_004:0261a28_1"
    },
    {
        "source_sentence": "為極重貪欲、瞋恚、愚癡、諸結眾生而說法。』",
        "translation": "He teaches the Dharma for the sake of extremely heavy craving, anger, folly, and the bonds of sentient beings.'",
        "source": "T03n0158_004:0261a29_2"
    },
    {
        "source_sentence": "月鬘童子白大師言：『此披由毘師紐，見何等事乃能立願於五濁佛土？』",
        "translation": "The moon-mouthed boy said to the great master, 'What's the matter that you can make a vow for the five turbid buddha-lands when you see this monk in Vaiśravaṇa?'",
        "source": "T03n0158_004:0261b01_3"
    },
    {
        "source_sentence": "大師告曰：『童子！",
        "translation": "The great teacher told him, 'Boy!",
        "source": "T03n0158_004:0261b03_4"
    },
    {
        "source_sentence": "有大悲菩薩，彼於五濁佛土而逮菩提，無救無趣困於諸結邪見之厄，為此眾生作救趣饒益故，",
        "translation": "There's a bodhisattva of great compassion who has attained enlightenment in the five turbid buddha-lands, where there's no rescue and no destiny, and he's trapped by the afflictions of bonds and wrong views, because he creates paths of salvation and benefits for these sentient beings.",
        "source": "T03n0158_004:0261b03_5"
    },
    {
        "source_sentence": "於生死海度斯等類令住正見，以涅槃甘露之味充滿眾生，此現菩薩大悲立願於五濁佛土者。』",
        "translation": "In the ocean of birth and death, he saves these kinds of people and causes them to abide in right view, filling sentient beings with the taste of the ambrosia of nirvāṇa, and this is the present bodhisattva's great compassionate vow for the five turbid buddha-lands.'",
        "source": "T03n0158_004:0261b05_6"
    },
    {
        "source_sentence": "「時寶藏如來言：『汝披由毘師紐，於當來世過一恒河沙數阿僧祇、二恒河沙數阿僧祇之餘，",
        "translation": "“Then the Buddha Jewel-Store Tathāgata said to me, ‘If you don’t wear a pair of lapis lazuli jewelry, in future lives you will pass as many eons as there are grains of sand in one Ganges River and as many eons as there are grains of sand in two Ganges Rivers.",
        "source": "T03n0158_004:0261b07_7"
    },
    {
        "source_sentence": "於東方過佛土微塵數佛剎，有世界名結使幢。",
        "translation": "In the east, past as many buddha-lands as atoms in a buddha land, there's a world named the bonded messenger banner.",
        "source": "T03n0158_004:0261b09_8"
    },
    {
        "source_sentence": "汝善丈夫！",
        "translation": "You, good man!",
        "source": "T03n0158_004:0261b10_9"
    },
    {
        "source_sentence": "於中當成阿耨多羅三藐三菩提，號主山王如來乃至佛世尊。』",
        "translation": "In them, he'll attain the unsurpassed, correct, and complete enlightenment, which is called the Tathāgata Lord of Mountains or even the Bhagavān.'",
        "source": "T03n0158_004:0261b11_10"
    },
    {
        "source_sentence": "披由毘師紐白佛言：『禮世尊足時，唯願世尊，當以百福莊嚴兩手摩我頂上。』",
        "translation": "Pūrṇa Vaiśravaṇa said to the Buddha, 'When you bow at the Bhagavān's feet, please, Bhagavān, touch my head with both hands adorned with a hundred merits.'",
        "source": "T03n0158_004:0261b12_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0261b14_12"
    },
    {
        "source_sentence": "如披由毘師紐童子，頭面禮世尊足時，寶藏如來即以兩手摩披由毘師紐菩薩頂，",
        "translation": "Just as when the boy Pūrvavideha bowed his head and feet to the feet of the World-honored One, the Buddha Ratnacchattra touched the top of the enlightening being Pūrvavideha’s head with both hands.",
        "source": "T03n0158_004:0261b14_13"
    },
    {
        "source_sentence": "「『起大悲意深智惠，　　汝為菩提修妙行；",
        "translation": "Engendering great compassion, intent on profound knowledge and wisdom, You cultivate sublime practice for enlightenment.",
        "source": "T03n0158_004:0261b16_14"
    },
    {
        "source_sentence": "　　結縛甚堅強力斷，　　汝當成佛饒益世。』",
        "translation": "The bonds are so strong and powerful that they'll be cut, and you'll become a buddha who benefits the world.'",
        "source": "T03n0158_004:0261b16_14"
    },
    {
        "source_sentence": "而告之曰：「善男子！",
        "translation": "He told him, Good man!",
        "source": "T03n0158_004:0261b16_14"
    },
    {
        "source_sentence": "爾時月鬘童子，向寶藏如來，右膝著地而白佛言：『世尊！",
        "translation": "It was then that the moon-lipped boy approached the Jewel Treasury Tathāgata, knelt with his right knee on the ground, and said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0261b19_15"
    },
    {
        "source_sentence": "我欲發阿耨多羅三藐三菩提心，於此佛土貪欲、瞋恚、愚癡等分心眾生，",
        "translation": "I want to give rise to the mind of unexcelled complete perfect enlightenment, so that in this buddha-land all sentient beings with such mental states as greed, hatred, and folly may be liberated.",
        "source": "T03n0158_004:0261b20_16"
    },
    {
        "source_sentence": "不住諸善惡心眾生，於四萬歲世人中，我當成阿耨多羅三藐三菩提。』",
        "translation": "Not abiding in good and bad-minded sentient beings, I'll attain unsurpassed, correct, and complete enlightenment among the people of 40,000 years.'",
        "source": "T03n0158_004:0261b22_17"
    },
    {
        "source_sentence": "寶藏佛言：『汝於來世，過一恒河沙數阿僧祇、二恒河沙之餘，有世界當名娑訶。",
        "translation": "The Buddha Jewel-Store Buddha said, 'In a future life, there will be a world that's more than an incalculable number of eons beyond the number of grains of sand in one Ganges River and the rest of an incalculable number of eons beyond the number of grains of sand in two Ganges Rivers, which will be called Sahā.",
        "source": "T03n0158_004:0261b23_18"
    },
    {
        "source_sentence": "何故名娑訶？",
        "translation": "Why is it called svāhā?",
        "source": "T03n0158_004:0261b25_19"
    },
    {
        "source_sentence": "其中眾生忍樂貪欲、瞋恚、愚癡，一切結縛皆悉忍故，以是因緣名曰娑訶。",
        "translation": "Because sentient beings there tolerate pleasure, desire, anger, and folly, and all the bonds are completely tolerated, these causes and conditions are called sahā.",
        "source": "T03n0158_004:0261b25_20"
    },
    {
        "source_sentence": "時有大劫名賢。",
        "translation": "At the time, there was a great eon named Xian.",
        "source": "T03n0158_004:0261b27_21"
    },
    {
        "source_sentence": "何故名賢？",
        "translation": "Why are they called good men?",
        "source": "T03n0158_004:0261b27_22"
    },
    {
        "source_sentence": "於此劫行貪欲、瞋恚、愚癡、吾我眾生中，當有千大悲佛婆伽婆於中出故。",
        "translation": "In this eon, there will be craving, anger, folly, self, and sentient beings of greed, hatred, and delusion, and a thousand great compassionate buddhas and bhagavān in the midst of them.",
        "source": "T03n0158_004:0261b28_0"
    },
    {
        "source_sentence": "汝善丈夫！",
        "translation": "You, good man!",
        "source": "T03n0158_004:0261b29_1"
    },
    {
        "source_sentence": "始入賢劫，於四萬歲世人中，當先成阿耨多羅三藐三菩提，號迦羅迦孫馱如來乃至佛、世尊。",
        "translation": "When he first enters the good eon, among people 40,000 years old, he'll first attain unsurpassed, correct, and complete enlightenment, which is called the Tathāgata Kālakāśunda or even the Buddha and Bhagavān.",
        "source": "T03n0158_004:0261b29_2"
    },
    {
        "source_sentence": "當以三乘說法，有過數眾生，為生、老、病、死駛河所漂，汝當度著涅槃彼岸。』",
        "translation": "You will teach the Dharma of the three vehicles, and there are more than a number of sentient beings who are born, old, sick, and dead in the river of birth, old age, illness, and death, and you will cross over to the other shore of nirvāṇa.'",
        "source": "T03n0158_004:0261c03_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0261c04_1"
    },
    {
        "source_sentence": "爾時月鬘菩薩五體禮寶藏如來足却坐一面。",
        "translation": "It was then that the moon-shaped bodhisattva bowed his five bodies at the feet of the Jeweled Treasury Tathāgata withdrew and sat to one side.",
        "source": "T03n0158_004:0261c04_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0261c05_3"
    },
    {
        "source_sentence": "爾時第二童子名曰欽婆羅，前白寶藏如來言：『世尊！",
        "translation": "It was then that the second boy named Kambara went forward to the Ratnaketu Tathāgata and said, 'Bhagavān!",
        "source": "T03n0158_004:0261c06_4"
    },
    {
        "source_sentence": "我欲次迦羅迦孫駄如來後於三萬歲世人中當成佛。』",
        "translation": "I want to follow the Tathāgata Kālôdayin, who will become a buddha among the people 30,000 years from now.'",
        "source": "T03n0158_004:0261c07_5"
    },
    {
        "source_sentence": "寶藏佛言：『汝童子！",
        "translation": "The Jewel-Store Buddha said, 'You children!",
        "source": "T03n0158_004:0261c08_6"
    },
    {
        "source_sentence": "於當來世過一恒河沙數阿僧祇、二恒河沙阿僧祇之餘，於娑訶國土適入賢劫，",
        "translation": "In the future, more than an incalculable number of incalculable eons beyond the number of grains of sand in one Ganges River and an incalculable number of incalculable eons beyond the number of grains of sand in two Ganges Rivers remaining, he will enter the world age of enlightenment in the land of Sāhā.",
        "source": "T03n0158_004:0261c08_7"
    },
    {
        "source_sentence": "次迦羅迦孫馱如來後，於三萬歲世人中當得成佛，號迦那迦牟尼如來、應供、正遍知乃至佛、世尊，",
        "translation": "Next, after the Tathāgata Krakucchanda, he will become a buddha among the people of the world at the age of thirty-thousand years. He will be called Kanakamuni Buddha, Arhat, Perfectly Enlightened One, and so on, until he becomes a buddha or world-honored one.",
        "source": "T03n0158_004:0261c10_8"
    },
    {
        "source_sentence": "名稱流布。』",
        "translation": "It's called spreading.'",
        "source": "T03n0158_004:0261c12_9"
    },
    {
        "source_sentence": "「『善集和合巧次第，　　無失濁亂淨妙稱；",
        "translation": "Good collections are combined skillfully and sequentially, without losing the pure and marvelous reputation of turbidity.",
        "source": "T03n0158_004:0261c13_10"
    },
    {
        "source_sentence": "　　意極高廣諸仙尊，　　說菩提道如大[火*僉]。",
        "translation": "The supremely lofty and vast minds of the sage-honored ones teach the path to enlightenment like a great [fire*winner].",
        "source": "T03n0158_004:0261c13_10"
    },
    {
        "source_sentence": "　　興人德自百福滿，　　施寂樂道繞結山；",
        "translation": "The virtues of the enlightened are self-fulfilled with a hundred blessings, And their paths of benevolence and quiescence surround the mountains.",
        "source": "T03n0158_004:0261c13_10"
    },
    {
        "source_sentence": "　　牟尼所為無過者，　　授多眾生菩提記。』",
        "translation": "Nothing wrong with what Muni does, he grants the assurance of enlightenment to many sentient beings.'",
        "source": "T03n0158_004:0261c13_10"
    },
    {
        "source_sentence": "彼於世尊所聞授記已，頭面禮足起遶三匝，於寶藏如來前以華散佛，叉手合掌以偈讚曰：「善男子！",
        "translation": "After he had heard the prediction from the Bhagavān, he bowed his head and feet, stood up three times, scattered flowers in front of the Ratnaketu Tathāgata, saluted him with palms joined, praised him in verse, saying, Good man!",
        "source": "T03n0158_004:0261c13_10"
    },
    {
        "source_sentence": "爾時童子名厚攝，以七寶床著寶藏如來前，價直百千兩金，敷以所宜置之金鉢盛滿七寶，",
        "translation": "At that time the boy named Vaiśravaṇa, seated on a seven-jeweled couch in front of the Tathāgata Ratnachārabha, was worth hundreds of thousands of taels of gold. He spread his golden bowl as he wished and filled it with the seven treasures.",
        "source": "T03n0158_004:0261c20_11"
    },
    {
        "source_sentence": "以金澡盥并七寶床施佛及僧，而白佛言：『世尊！",
        "translation": "He gave the Buddha and the saṃgha a bath of gold and a seven-jeweled bed, and said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0261c22_12"
    },
    {
        "source_sentence": "我欲於來世過一恒河沙數阿僧祇、二恒河沙數之餘，於彼賢劫成如來、應供、正遍知。",
        "translation": "I want to become a tathāgata, an arhat, and a perfectly enlightened one in that good eon.",
        "source": "T03n0158_004:0261c23_13"
    },
    {
        "source_sentence": "眾善減時惡世瑞現，眾生住重貪欲、瞋恚、愚癡、慳嫉，依惡知識邪見，",
        "translation": "When goodness decreases, bad worldly omens appear. Sentient beings abide in heavy craving, hatred, ignorance, folly, and avarice, relying on the false views of bad friends.",
        "source": "T03n0158_004:0261c25_14"
    },
    {
        "source_sentence": "眾生常樂親近不善根心，離善根心，無正見心，邪命亂心；",
        "translation": "Sentient beings always delight in associating with minds of roots of unwholesomeness. They are free from minds of roots of wholesomeness; they have no mind of right view and a disturbed mind of wrong livelihood.",
        "source": "T03n0158_004:0261c26_15"
    },
    {
        "source_sentence": "迦那迦牟尼如來般涅槃已正法滅後，眾生盲冥世無導師，二萬歲世人中我當成阿耨多羅三藐三菩提。』",
        "translation": "After the Tathāgata Kanakamuni has parinirvāṇa and the right teaching ceases, sentient beings are blind in the dark world without a guide, and I will attain unsurpassed, correct, and complete enlightenment among people 20,000 years old.'",
        "source": "T03n0158_004:0261c28_16"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0262a01_17"
    },
    {
        "source_sentence": "時寶藏如來告厚攝曰：『善哉，善哉！",
        "translation": "The Ratnaketu Tathāgata then addressed Kauśinagara, saying, 'Good, good!'",
        "source": "T03n0158_004:0262a01_18"
    },
    {
        "source_sentence": "婆羅門！",
        "translation": "O brāhmaṇa!",
        "source": "T03n0158_004:0262a02_19"
    },
    {
        "source_sentence": "汝善丈夫具大明智，惡世人中瑞應出時，乃至二萬歲世人中盲無導師，",
        "translation": "Good man, you are endowed with great insight and knowledge. Among the evil worldly beings a divine apparition should appear at the right time. For as long as twenty-thousand years among the living beings there will be no guide or teacher for those who are blind.",
        "source": "T03n0158_004:0262a02_20"
    },
    {
        "source_sentence": "於中立願。",
        "translation": "Here, he establishes the vow.",
        "source": "T03n0158_004:0262a04_21"
    },
    {
        "source_sentence": "是故，善丈夫！",
        "translation": "Therefore, good man!",
        "source": "T03n0158_004:0262a04_22"
    },
    {
        "source_sentence": "字汝為明智悲意。",
        "translation": "The word you is the mind of wisdom and compassion.",
        "source": "T03n0158_004:0262a04_23"
    },
    {
        "source_sentence": "汝明智悲意！",
        "translation": "You understand the mind of wisdom and compassion!",
        "source": "T03n0158_004:0262a05_24"
    },
    {
        "source_sentence": "於當來世過一恒河沙數阿僧祇、二恒河沙之餘，即於此娑訶世界，在賢劫二萬歲世人中，",
        "translation": "In a future world more than one Ganges River, with the number of incalculable eons and the remaining parts of two Ganges Rivers, he will be among the people of this sahā world for twenty thousand years in the world age of the wise.",
        "source": "T03n0158_004:0262a05_25"
    },
    {
        "source_sentence": "當得成佛號迦葉如來乃至佛、世尊。』",
        "translation": "You'll become a buddha named Kāśyapa, the Tathāgata, or even the Bhagavān.'",
        "source": "T03n0158_004:0262a07_26"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0262a08_27"
    },
    {
        "source_sentence": "爾時明智悲意菩薩，五體禮寶藏如來足，於一面立，以華鬘香粖散寶藏如來，",
        "translation": "It was then that the enlightening being Mindful of Wisdom and Compassion bowed at the feet of the Buddha Jewel-Store Tathāgata with five bodies at his feet, stood to one side, and scattered flowers, garlands, incense, and perfumes over the Buddha Jewel-Store Tathāgata.",
        "source": "T03n0158_004:0262a08_28"
    },
    {
        "source_sentence": "「『人尊多聞蓋，　　皆生喜樂意；",
        "translation": "'The people honored as well-versed All give rise to joy and happiness.",
        "source": "T03n0158_004:0262a10_29"
    },
    {
        "source_sentence": "　　以巧妙善語，　　善智處人天。",
        "translation": "Because of skillful good speech, they're well-versed among humans and gods.",
        "source": "T03n0158_004:0262a10_29"
    },
    {
        "source_sentence": "　　授多眾生記，　　於十方作佛；",
        "translation": "Gives assurance to many sentient beings, Becoming buddhas in the ten directions.",
        "source": "T03n0158_004:0262a10_29"
    },
    {
        "source_sentence": "　　神通智意等，　　佛法無稱量；",
        "translation": "Spiritual powers, knowledge, intellect, etc., Buddha’s teachings are immeasurable.",
        "source": "T03n0158_004:0262a10_29"
    },
    {
        "source_sentence": "　　尊現菩提行，　　故我稽首禮。』",
        "translation": "The Bhagavān manifests the practice of enlightenment, so I bow my head in homage.'",
        "source": "T03n0158_004:0262a10_29"
    },
    {
        "source_sentence": "以偈讚曰：「善男子！",
        "translation": "He praised them in verse, Good sons!",
        "source": "T03n0158_004:0262a10_29"
    },
    {
        "source_sentence": "爾時海濟婆羅門，覺悟第四童子名無垢意。",
        "translation": "At the time, the fourth boy named Immaculate Mind was awakened by the Brāhmaṇa Haiji.",
        "source": "T03n0158_004:0262a16_30"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0262a17_31"
    },
    {
        "source_sentence": "爾時無垢意童子前白寶藏如來言：『我欲如是於此土賢劫中求菩提，以不如是惡世，",
        "translation": "It was then that the Licchavi Vimalakīrti youth said to the buddha Ratnacchattra: I wish to seek enlightenment in this world for a good eon, so as not to fall into such an evil world.",
        "source": "T03n0158_004:0262a17_32"
    },
    {
        "source_sentence": "迦葉如來般涅槃後正法滅已，於萬歲世人中，眾生布施、持戒、修定心意轉乏於七財；",
        "translation": "“O Kāśyapa, after the parinirvāṇa of the Tathāgata Kassapa, when the true-dharma ceased, sentient beings in the human world aged ten thousand years would lack seven kinds of means of subsistence: generosity, observance of precepts, and cultivation of meditation.",
        "source": "T03n0158_004:0262a19_33"
    },
    {
        "source_sentence": "敬惡知識以之為師，心不樂求於三福地；",
        "translation": "They honor evil friends and regard them as teachers, but their minds do not delight in seeking the path of enlightenment.",
        "source": "T03n0158_004:0262a21_34"
    },
    {
        "source_sentence": "亦不樂修三善之業，反樂為三不善惡業；",
        "translation": "Nor do they delight in performing the three kinds of good deeds; instead, they turn delight into the three kinds of bad and evil deeds.",
        "source": "T03n0158_004:0262a22_35"
    },
    {
        "source_sentence": "以諸結使闇亂心故，不欲樂求三乘之道。",
        "translation": "Because of the bonds and tendencies that disturb their minds, they don't want to happily pursue the path of the three vehicles.",
        "source": "T03n0158_004:0262a23_36"
    },
    {
        "source_sentence": "於當爾時尚無能辦菩提行者，況復千歲世人乃至百歲；",
        "translation": "At that time there was no one who could accomplish the practice of enlightenment, much less anyone in the world at the age of one thousand years or even a hundred years.",
        "source": "T03n0158_004:0262a24_37"
    },
    {
        "source_sentence": "爾時眾生無有善名況行善者。",
        "translation": "At that point, sentient beings don't have good names, so why wouldn't they practice goodness?",
        "source": "T03n0158_004:0262a25_38"
    },
    {
        "source_sentence": "是五濁世壽命轉減，乃至十歲刀兵劫起，即於爾時我當從天上下，拔濟眾生使捨不善，",
        "translation": "At that time I will go up and down from heaven to rescue sentient beings, causing them to abandon what is unwholesome.",
        "source": "T03n0158_004:0262a26_39"
    },
    {
        "source_sentence": "為說善法，令彼眾生住十善業，以諸善業除眾生結亦除五濁；",
        "translation": "In order to teach the good Dharma, they cause sentient beings to abide in ten wholesome actions. By means of these wholesome actions they remove the bonds of sentient beings and also the five defilements.",
        "source": "T03n0158_004:0262a28_40"
    },
    {
        "source_sentence": "乃至世人壽八萬歲，我乃於中成阿耨多羅三藐三菩提，為少貪欲、瞋恚、愚癡、無明、慳嫉眾生說法，",
        "translation": "At that time I attained unexcelled complete perfect enlightenment and taught the Dharma to sentient beings who had few desires, hatred, folly, ignorance, or stinginess.",
        "source": "T03n0158_004:0262a29_41"
    },
    {
        "source_sentence": "令住三乘。",
        "translation": "He causes them to abide in the three vehicles.",
        "source": "T03n0158_004:0262b02_42"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0262b02_43"
    },
    {
        "source_sentence": "若我如是意滿者，世尊應授我阿耨多羅三藐三菩提記。",
        "translation": "If my intention is thus fulfilled, the Bhagavān should give me the assurance of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0158_004:0262b03_44"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0262b04_45"
    },
    {
        "source_sentence": "設我不得如是授記，我當求聲聞地、若辟支佛速脫生死。』",
        "translation": "If I don't receive such a prediction, I'll seek the stage of śrāvakas and those who are pratyekabuddhas to quickly escape birth and death.'",
        "source": "T03n0158_004:0262b04_46"
    },
    {
        "source_sentence": "「寶藏如來言：『婆羅門！",
        "translation": "The Ratnaketu Tathāgata said, 'Brāhmaṇa!",
        "source": "T03n0158_004:0262b05_47"
    },
    {
        "source_sentence": "菩薩有四懈怠地，若有菩薩具此懈怠者，久樂生死為見所誤受生死苦，",
        "translation": "“Enlightening beings have four states of indolence. If enlightening beings are imbued with these indolence, the long-cherished pleasure of birth and death will cause them to experience the pain of birth and death by mistakenly seeing it.",
        "source": "T03n0158_004:0262b06_48"
    },
    {
        "source_sentence": "不速逮阿耨多羅三藐三菩提。",
        "translation": "They won't quickly attain unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0158_004:0262b08_0"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T03n0158_004:0262b08_1"
    },
    {
        "source_sentence": "或有菩薩，卑賤威儀，卑賤同學，卑賤分施，卑賤立願。",
        "translation": "Perhaps there are bodhisattvas who are inferior in manner, inferior in fellow students, inferior in generosity, and inferior in establishing vows.",
        "source": "T03n0158_004:0262b08_2"
    },
    {
        "source_sentence": "何謂菩薩卑賤威儀？",
        "translation": "What's meant by a bodhisattva's lowly demeanor?",
        "source": "T03n0158_004:0262b10_3"
    },
    {
        "source_sentence": "或有菩薩破身、口、意，或不攝威儀，與學聲聞、緣覺者俱，不一切施，",
        "translation": "Sometimes a bodhisattva breaks through body, speech, and mind, sometimes he doesn’t control his manner, sometimes he’s accompanied by śrāvakas and pratyekbuddhas who are training, and sometimes he doesn’t give everything.",
        "source": "T03n0158_004:0262b10_4"
    },
    {
        "source_sentence": "不一切處施，求人天福樂施，不至意立願莊嚴佛土為度眾生。",
        "translation": "They don't give in all places, seek heavenly blessings and happiness, and don't establish their vows with sincerity to adorn the Buddha land for the sake of liberating sentient beings.",
        "source": "T03n0158_004:0262b12_5"
    },
    {
        "source_sentence": "具四法，懈怠菩薩久受生死之苦，不速逮阿耨多羅三藐三菩提。",
        "translation": "They possess four dharmas, and lazy bodhisattvas who have suffered the pain of birth-and-death for a long time don't quickly attain unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0158_004:0262b13_6"
    },
    {
        "source_sentence": "有菩薩具四法，速成阿耨多羅三藐三菩提。",
        "translation": "There are bodhisattvas who possess four dharmas and quickly attain unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0158_004:0262b14_7"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T03n0158_004:0262b15_8"
    },
    {
        "source_sentence": "護持身、口、意，或常親近大乘學人，一切施，一切處施，為脫一切眾生苦故發悲心施，",
        "translation": "Protecting body, speech, and mind, or always associating with the great vehicle learners, they give all kinds of gifts, giving everywhere, and compassionately giving in order to liberate all sentient beings from suffering.",
        "source": "T03n0158_004:0262b16_9"
    },
    {
        "source_sentence": "至意立願莊嚴佛土為度眾生故；",
        "translation": "They wish to adorn the buddha-lands with their vows in order to liberate sentient beings.",
        "source": "T03n0158_004:0262b18_10"
    },
    {
        "source_sentence": "是為四法，菩薩行是速成阿耨多羅三藐三菩提。",
        "translation": "These are the four dharmas by which a bodhisattva's practice quickly becomes unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0158_004:0262b18_11"
    },
    {
        "source_sentence": "復有四法，菩薩具足攝菩提道。",
        "translation": "Again, there are four things that enable bodhisattvas to fully embrace the path of enlightenment.",
        "source": "T03n0158_004:0262b20_0"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T03n0158_004:0262b20_1"
    },
    {
        "source_sentence": "勤行波羅蜜，施攝眾生，修辦諸禪，遊戲神通；",
        "translation": "He diligently practiced the transcendent ways, giving to taking care of sentient beings. Cultivating his meditations, he played in mystic powers.",
        "source": "T03n0158_004:0262b20_2"
    },
    {
        "source_sentence": "是為四。",
        "translation": "These are the four.",
        "source": "T03n0158_004:0262b21_3"
    },
    {
        "source_sentence": "復有四無厭法，菩薩應具：施無厭，聞法無厭，攝眾生無厭，願無厭；",
        "translation": "“Furthermore, there are four kinds of tirelessness that should be possessed by enlightening beings:",
        "source": "T03n0158_004:0262b22_4"
    },
    {
        "source_sentence": "是為四。",
        "translation": "These are the four.",
        "source": "T03n0158_004:0262b23_5"
    },
    {
        "source_sentence": "復有四無盡藏，菩薩應滿：信無盡藏菩薩應滿，說法無盡藏菩薩應滿，",
        "translation": "Again, there are four inexhaustible treasuries that should be fulfilled by enlightening beings: the enlightening being Faithful to the Inexhaustible Treasury should be fulfilled by enlightening beings; the enlightening being Teaching the Truth of the Inexhaustible Treasury should be fulfilled by enlightening beings;",
        "source": "T03n0158_004:0262b23_6"
    },
    {
        "source_sentence": "迴向無盡藏菩薩應滿，濟窮厄眾生無盡藏菩薩應滿；",
        "translation": "The enlightening being Inexhaustible Treasury of dedication should be fulfilled, and the enlightening being Inexhaustible Treasury of relief for the helpless and distressed should be fulfilled.",
        "source": "T03n0158_004:0262b25_7"
    },
    {
        "source_sentence": "是為四。",
        "translation": "These are the four.",
        "source": "T03n0158_004:0262b26_8"
    },
    {
        "source_sentence": "復有四淨，菩薩應具：無我戒淨，無眾生三昧淨，無命慧淨，無人解脫知見淨；",
        "translation": "Again, there are four kinds of purity that should be possessed by enlightening beings: the purity of selfless precepts; the purity of samādhi without sentient beings; the purity of lifeless wisdom; and the purity of knowledge and vision with no one liberated.",
        "source": "T03n0158_004:0262b26_9"
    },
    {
        "source_sentence": "是為四法，菩薩應具。",
        "translation": "These are the four things that bodhisattvas should possess.",
        "source": "T03n0158_004:0262b28_10"
    },
    {
        "source_sentence": "菩薩以是速成阿耨多羅三藐三菩提，轉虛空輪、不可思議輪、無稱量無我輪、無言說輪、假現輪、厭患輪、轉未曾輪。",
        "translation": "Because of this, the bodhisattva quickly achieves unsurpassed, correct, and complete enlightenment, turning the wheel of space, the wheel of inconceivability, the wheel of immeasurable selflessness, the wheel of no speech, the wheel of provisional manifestation, the wheel of disillusionment, and the wheel of unprecedented transformation.",
        "source": "T03n0158_004:0262b29_11"
    },
    {
        "source_sentence": "汝無垢意！",
        "translation": "You, Mañjuśrī!",
        "source": "T03n0158_004:0262c02_12"
    },
    {
        "source_sentence": "於當來世，過一恒河沙數阿僧祇、於二恒河沙阿僧祇餘，入賢劫未久五濁以除，",
        "translation": "In the future, more than an incalculable number of incalculable eons beyond one Ganges River and an incalculable number of incalculable eons beyond two Ganges Rivers, he'll enter the good eon not long after entering it to remove the five turbidities.",
        "source": "T03n0158_004:0262c02_13"
    },
    {
        "source_sentence": "其壽轉增至八萬歲人中，汝當得逮阿耨多羅三藐三菩提，號彌勒如來乃至佛世尊。』",
        "translation": "Among those whose life span increases to 80,000 years, you'll attain supreme perfect enlightenment and be called the Maitreya Tathāgata or even the Bhagavān.'",
        "source": "T03n0158_004:0262c04_14"
    },
    {
        "source_sentence": "「時無垢意婆羅門，五體禮寶藏如來足已，於一面住，以華鬘粖香供養世尊，",
        "translation": "“Then the Licchavi Vimalakīrti brāhmaṇa bowed at the feet of the Buddha Ratnacchattra with five prostrations and, having saluted him by bowing his forehead to the Buddha’s feet, remained off to one side. He offered incense as an offering to the World-honored One.",
        "source": "T03n0158_004:0262c06_15"
    },
    {
        "source_sentence": "「『尊面如滿月，　　白毫相如雪，",
        "translation": "'The venerable's face is like a full moon, the white hair on his forehead is like snow,",
        "source": "T03n0158_004:0262c08_16"
    },
    {
        "source_sentence": "　　身淨如金山，　　誰不願牟尼？",
        "translation": "The body is as pure as a mountain of gold, Who wouldn't want it to be samādhi?",
        "source": "T03n0158_004:0262c08_16"
    },
    {
        "source_sentence": "　　雄猛如獸王，　　無量德照世，",
        "translation": "They are as heroic as the king of animals, With immeasurable virtue illumining the world.",
        "source": "T03n0158_004:0262c08_16"
    },
    {
        "source_sentence": "　　光明普周遍，　　今授我佛記。』",
        "translation": "The light pervades everywhere, and now you've given me the Buddha's prediction.'",
        "source": "T03n0158_004:0262c08_16"
    },
    {
        "source_sentence": "以偈讚曰：「大師海濟婆羅門，勸彼一千人，少一童子通四鞞陀得發菩提；",
        "translation": "He praised them in verse: The great teacher Haiji, a brahman, exhorted those thousand disciples to enter enlightenment. A small boy of the four quarters of the empire attained enlightenment.",
        "source": "T03n0158_004:0262c08_16"
    },
    {
        "source_sentence": "所謂：迦羅迦，孫馱迦那迦，牟尼迦葉，彌勒子照等千人。",
        "translation": "There were a thousand people, including Kālāka,孫馱迦那迦,牟尼迦葉,彌勒子照, and so forth.",
        "source": "T03n0158_004:0262c14_17"
    },
    {
        "source_sentence": "少二童子通四鞞陀，彼一切立阿耨多羅三藐三菩提願，於此賢劫，寶藏如來彼一切阿耨多羅三藐三菩提記，",
        "translation": "In this good eon, the Jewel-Store Tathāgata predicted all those unsurpassed, correct, and complete enlightenment vows of these two young boys who penetrated the four continents.",
        "source": "T03n0158_004:0262c15_18"
    },
    {
        "source_sentence": "於賢劫中其最小者。",
        "translation": "It's the smallest of the good eon.",
        "source": "T03n0158_004:0262c18_19"
    },
    {
        "source_sentence": "大師覺之：『咄！",
        "translation": "The great teacher awakened him, 'Duh!",
        "source": "T03n0158_004:0262c18_20"
    },
    {
        "source_sentence": "持大力！",
        "translation": "Mahāprajñāpāramitā!",
        "source": "T03n0158_004:0262c18_21"
    },
    {
        "source_sentence": "何以久觀？",
        "translation": "Why is it observed for a long time?",
        "source": "T03n0158_004:0262c19_22"
    },
    {
        "source_sentence": "汝摩訶薩捨餘意想，為眾生故可發大悲。』",
        "translation": "You, Mahāsattva, abandon the other mental thoughts and give rise to great compassion for the sake of sentient beings.'",
        "source": "T03n0158_004:0262c19_23"
    },
    {
        "source_sentence": "「『眾生老病死，　　沒於愛流河；",
        "translation": "'Sentient beings grow old, sick, and die, And sink into the river of craving.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　處在三界畏，　　受胎之微形。",
        "translation": "They're located in the three realms of fear, feeling the subtle form of the womb.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　飲結毒相害，　　曠野苦燒煑；",
        "translation": "Drinking the poison of fetters is harmful to each other, and in the wilderness they suffer from burning corpses.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　癡盲失善道，　　為生死所逼。",
        "translation": "Being deluded and blind, they lose the path of goodness And are oppressed by birth and death.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　三界苦熾然，　　皆住於邪見；",
        "translation": "The three realms of suffering and anguish are blazing, All abiding in wrong views.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　一切在五道，　　譬如車輪轉。",
        "translation": "All are in the five realms of rebirth, Like a carriage turning.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　眾生尠法眼，　　念無救眾生；",
        "translation": "Sentient beings see the eye of truth, But their thoughts do not save sentient beings.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　修慧除疑惑，　　今可求菩提。",
        "translation": "Cultivating wisdom to remove doubt and doubt, we can now seek enlightenment.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　為世渴愛河，　　作眾生橋梁；",
        "translation": "For the sake of the river of worldly thirst, They become bridges for sentient beings.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　解世結縛故，　　心迴向菩提。",
        "translation": "Because they understand the worldly bonds, their minds are directed toward enlightenment.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　除癡開法眼，　　施以無上道；",
        "translation": "Removing delusion, he opens the eye of truth and bestows the supreme path.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　生死三界然，　　充之以法味。",
        "translation": "The three realms of birth and death remain the same, yet they are filled with the flavor of the Dharma.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　速可詣饒益，　　頂禮牟尼足；",
        "translation": "Go quickly to the Benefactor and pay homage by bowing your head at the Buddha’s feet.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　可立最堅願，　　為佛世導師。",
        "translation": "They can make the most firm vow to be the guide of the Buddha's world.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　慰喻諸群生，　　曠野濟眾庶；",
        "translation": "He comforted all living beings And rescued the common people in the wilderness.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　施妙解脫道，　　根力及覺分，",
        "translation": "He bestows the wondrous path of liberation, faculties, powers, and factors of enlightenment.",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "　　為求雨法雨，　　以滅眾生苦。』",
        "translation": "They seek to rain down the Dharma rain in order to extinguish the suffering of sentient beings.'",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "以偈告曰：「善男子！",
        "translation": "He told them in verse, Good man!",
        "source": "T03n0158_004:0262c20_24"
    },
    {
        "source_sentence": "時持大力童子白言：『大師！",
        "translation": "The great boy Mahāprajñāpāramitā then said, 'Great master!",
        "source": "T03n0158_004:0263a09_25"
    },
    {
        "source_sentence": "我不樂生死，樂求尊德；",
        "translation": "I do not delight in birth and death but delight in seeking virtue.",
        "source": "T03n0158_004:0263a09_26"
    },
    {
        "source_sentence": "又復不求聲聞、辟支佛乘，欲求無上乘；",
        "translation": "Again, they do not seek the vehicles of śrāvakas or pratyekabuddhas. They want to seek the supreme vehicle.",
        "source": "T03n0158_004:0263a10_27"
    },
    {
        "source_sentence": "我觀所化處，待時立願。",
        "translation": "I observe the place where I'll be transformed, and I'll make a vow at the right time.",
        "source": "T03n0158_004:0263a11_28"
    },
    {
        "source_sentence": "大師！",
        "translation": "Great teacher!",
        "source": "T03n0158_004:0263a11_29"
    },
    {
        "source_sentence": "是故我住思惟至今，師待須臾聽我師子吼時。』",
        "translation": "That's why I've been contemplating it so far, and the teacher waited a moment to hear my lion roar.'",
        "source": "T03n0158_004:0263a11_30"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0263a12_31"
    },
    {
        "source_sentence": "爾時海濟婆羅門，捨彼而還告其弟子五婆羅門常給侍者：『汝諸童子！",
        "translation": "It was then that the Brāhmaṇa Haiji abandoned them and returned to his disciples, telling the five Brāhmaṇas who always served him, 'You children!",
        "source": "T03n0158_004:0263a13_32"
    },
    {
        "source_sentence": "可發阿耨多羅三藐三菩提心。』",
        "translation": "You can give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0158_004:0263a14_33"
    },
    {
        "source_sentence": "彼白師言：『我等無財寶物可供養佛及比丘僧，我等云何未種善根發菩提心？』",
        "translation": "They said to their teacher, 'We don't have property or possessions to offer to support the Buddha and the monks and nuns, so why haven't we planted good roots and aroused the mind of enlightenment?'",
        "source": "T03n0158_004:0263a15_34"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0263a17_35"
    },
    {
        "source_sentence": "爾時國大師告其弟子，一名迦羅浮殊，即與七寶耳璩；",
        "translation": "It was then that the great teacher of the country told his disciple, a kalaviṅka, to give him a seven-jeweled earring.",
        "source": "T03n0158_004:0263a17_36"
    },
    {
        "source_sentence": "二名他羅浮殊，亦與七寶耳璩；",
        "translation": "The second was named Paranirmita-vaśavartin, also giving him a seven-jeweled earring.",
        "source": "T03n0158_004:0263a18_37"
    },
    {
        "source_sentence": "第三名闍羅浮殊，與七寶床；",
        "translation": "The third was named Jālôdayin, who gave him a seven-jeweled bed.",
        "source": "T03n0158_004:0263a19_38"
    },
    {
        "source_sentence": "第四名佉伽浮殊，與七寶杖；",
        "translation": "The fourth was called Sanghabuddha, with a staff made of the seven kinds of treasure.",
        "source": "T03n0158_004:0263a19_39"
    },
    {
        "source_sentence": "第五名婆羅浮殊，與純金澡盥。",
        "translation": "The fifth name is Vārāputra, and he's given a bath of pure gold.",
        "source": "T03n0158_004:0263a20_40"
    },
    {
        "source_sentence": "而告之曰：『汝等可以此物供養佛及比丘僧，發阿耨多羅三藐三菩提心。』",
        "translation": "He told them, 'You can make these things an offering to the Buddha and the monks and nuns and give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0158_004:0263a21_41"
    },
    {
        "source_sentence": "時五給侍進詣世尊，各以所齎施佛及僧已，而白佛言：『唯願世尊！",
        "translation": "The five attendants then went to the Bhagavān, each gave what they brought to the Buddha and the saṃgha, and said to the Buddha, 'Please, Bhagavān!'",
        "source": "T03n0158_004:0263a23_0"
    },
    {
        "source_sentence": "授我等阿耨多羅三藐三菩提記，於彼賢劫，我等於中當成無上正真之道。』",
        "translation": "Give us the assurance of unsurpassed, correct, and complete enlightenment, and we will attain the unsurpassed true path in that good eon.'",
        "source": "T03n0158_004:0263a24_1"
    },
    {
        "source_sentence": "略說。",
        "translation": "It's briefly explained.",
        "source": "T03n0158_004:0263a26_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0263a26_3"
    },
    {
        "source_sentence": "時寶藏如來即與迦羅浮殊童子授菩提記，於賢劫中當名堅音如來；",
        "translation": "The Buddha Jewel Treasury then gave the assurance of enlightenment to the boy Kāla浮殊, and in the good eon he will be called Steadfast Sound Buddha.",
        "source": "T03n0158_004:0263a26_4"
    },
    {
        "source_sentence": "次後他羅浮殊當名樂相意如來；",
        "translation": "“Then the buddha named Paranirmita-vaśavartin will be a buddha named Delight in Virtue.",
        "source": "T03n0158_004:0263a28_5"
    },
    {
        "source_sentence": "次後闍羅浮殊當名商導如來；",
        "translation": "“The next buddha will be Jambudvfpa, to be known as Shangdao (“Common Guide”) Tathāgata.",
        "source": "T03n0158_004:0263a28_6"
    },
    {
        "source_sentence": "次後佉伽浮殊當名愛清如來；",
        "translation": "“Then the latter buddha was to be named Sadāparibhūtarstivāda.",
        "source": "T03n0158_004:0263a29_7"
    },
    {
        "source_sentence": "次後娑羅浮殊童子當名清葉髻王如來。",
        "translation": "Next, the boy Sāraputra will be called the Tathāgata King of Pure Topknots.",
        "source": "T03n0158_004:0263b01_8"
    },
    {
        "source_sentence": "佛適授彼五童子記於賢劫已，時大師重告持大力言：『汝持大力！",
        "translation": "After the Buddha had instructed those five children to record the good eon, the great teacher then again addressed Mahāprajñāpāramitā, saying, 'You, Mahāprajñāpāramitā!",
        "source": "T03n0158_004:0263b02_9"
    },
    {
        "source_sentence": "於世尊所今可立願，取莊嚴佛土隨意所欲，以法味謂一切眾生，堅固精進行菩薩行莫復久觀。』",
        "translation": "Now, the Bhagavān can make a vow to adorn the Buddha's land and take whatever he wants with the Dharma flavor for all sentient beings who are resolute in their bodhisattva practice without observing it for a long time.'",
        "source": "T03n0158_004:0263b03_10"
    },
    {
        "source_sentence": "自執其臂將至佛所。",
        "translation": "He took his own arm and was about to go to the Buddha.",
        "source": "T03n0158_004:0263b05_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0263b06_12"
    },
    {
        "source_sentence": "彼時持大力童子，住世尊前而白佛言：『世尊！",
        "translation": "The boy Mahāprajñāpāramitā then stood in front of the Bhagavān and said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0263b06_13"
    },
    {
        "source_sentence": "於當來世後賢劫中，當有幾牟尼曰出現於世。』",
        "translation": "In the future world after the good eon, how many sages will there be who say they'll appear in the world?'",
        "source": "T03n0158_004:0263b07_14"
    },
    {
        "source_sentence": "寶藏如來言：『童子！",
        "translation": "The Ratnaketu Tathāgata said, 'Boy!",
        "source": "T03n0158_004:0263b08_15"
    },
    {
        "source_sentence": "於半賢劫當有千四牟尼曰出現於世。』",
        "translation": "In the middle of the good eon, there will be a thousand or four sages who say they'll appear in the world.'",
        "source": "T03n0158_004:0263b09_0"
    },
    {
        "source_sentence": "童子白佛言：『世尊！",
        "translation": "The boy said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0263b09_1"
    },
    {
        "source_sentence": "於彼賢劫乃至千三牟尼曰般涅槃已，其最後娑羅浮殊童子，當成阿耨多羅三藐三菩提，",
        "translation": "At the end of that good eon, up to a thousand-three samādhis, it's called parinirvāṇa, and the final prince Sāraputta will attain unexcelled complete perfect enlightenment.",
        "source": "T03n0158_004:0263b10_2"
    },
    {
        "source_sentence": "名青葉髻王如來。",
        "translation": "He's called the Tathāgata of the King of the Topknot of green leaves.",
        "source": "T03n0158_004:0263b12_3"
    },
    {
        "source_sentence": "我當於爾所時行菩提行難行苦行，布施、持戒、修定、多聞、精進、忍辱，",
        "translation": "At that point, I'll practice enlightenment, hardship, and austerities, generosity, observing precepts, cultivating concentration, being well-versed, exerting effort, and tolerating humility.",
        "source": "T03n0158_004:0263b12_4"
    },
    {
        "source_sentence": "隨福德智慧我當具滿，於彼賢劫一切成佛未久我先施供養。",
        "translation": "Depending on their merits and wisdom, I'll be fully endowed with them, and before they become buddhas in all those good eons, I'll first make offerings to them.",
        "source": "T03n0158_004:0263b14_5"
    },
    {
        "source_sentence": "彼般涅槃後，如舍利法供養舍利護持正法。",
        "translation": "After his parinirvāṇa, he makes offerings to Śāriputra in accordance with the rules for relics and protects the right teaching.",
        "source": "T03n0158_004:0263b15_6"
    },
    {
        "source_sentence": "乏戒眾生，勸令持戒使住其中；",
        "translation": "Sentient beings lacking precepts were urged to keep the precepts, causing them to abide there.",
        "source": "T03n0158_004:0263b16_7"
    },
    {
        "source_sentence": "少見困厄眾生，勸令正見使住其中；",
        "translation": "To those in distress by the slightest views they urge right view and cause them to abide there.",
        "source": "T03n0158_004:0263b17_8"
    },
    {
        "source_sentence": "少意眾生勸住正意；",
        "translation": "Sentient beings with few intentions are encouraged to abide in right intention.",
        "source": "T03n0158_004:0263b18_9"
    },
    {
        "source_sentence": "無威儀者令住威儀；",
        "translation": "Those without deportment are caused to abide in deportment.",
        "source": "T03n0158_004:0263b18_10"
    },
    {
        "source_sentence": "當為眾生示現種種若干善行。",
        "translation": "They will show various kinds of good actions for sentient beings.",
        "source": "T03n0158_004:0263b19_11"
    },
    {
        "source_sentence": "彼諸佛世尊涅槃未久，我當復正法、眼正法、攝正法、興正法燈熾然於世。",
        "translation": "It won't be long before those buddhas and world-honored ones pass into nirvāṇa, and I will return to the right teaching, the right teaching of the eye, the right teaching of gathering in the right teaching, and the right teaching of producing the lamp of the right teaching blazing brightly in the world.",
        "source": "T03n0158_004:0263b19_12"
    },
    {
        "source_sentence": "刀兵劫時我當勸化眾生，使住不殺乃至正見，以十善業於邪逕路拔出眾生著善道中，",
        "translation": "At the time of the kalpa of swords and armies, I will encourage sentient beings to abide in non-killing... right view. By means of the ten wholesome activities, I will pluck out sentient beings on the path of wickedness and lead them into the good path.",
        "source": "T03n0158_004:0263b21_13"
    },
    {
        "source_sentence": "除彼惡行闇冥，開示善行法，劫濁乃至命、見、結、眾生濁世，我當滅除。",
        "translation": "I will remove the darkness of that bad action and reveal the principle of good conduct, which is a turbid eon up to the turbidity of life, views, bonds, and sentient beings in the world, and I will extinguish it.",
        "source": "T03n0158_004:0263b23_14"
    },
    {
        "source_sentence": "飢饉劫時我當勸化眾生，行檀波羅蜜令住其中，我以六波羅蜜，除滅一切飢饉之劫濁亂鬪諍及與怨嫉，",
        "translation": "At the time of the kalpa of hunger, I will encourage sentient beings to practice the perfection of giving and cause them to abide there. With these six perfections, I will remove all the turbidities, quarrels, disputes, and enemies of the kalpa of hunger by means of the six perfections.",
        "source": "T03n0158_004:0263b25_0"
    },
    {
        "source_sentence": "於眾生所除滅結垢。",
        "translation": "In sentient beings, he removes the defilement of the fetters.",
        "source": "T03n0158_004:0263b27_1"
    },
    {
        "source_sentence": "疾疫劫時，我當以六和敬、四攝法勸化眾生令住其中，除滅眾生疾疫闇冥乃至滅結。",
        "translation": "At the time of the eon of pestilence, I will exhort sentient beings with the six kinds of reverence and the four methods of gathering in sentient beings so that they may abide there. I will remove the darkness of affliction from sentient beings’ sicknesses and epidemics and bring about the cessation of their fetters.",
        "source": "T03n0158_004:0263b27_2"
    },
    {
        "source_sentence": "一切娑呵佛土半賢劫中，如是救濟眾生困厄。",
        "translation": "In all the sahā buddha lands and half a good eon, they thus rescue sentient beings in distress.",
        "source": "T03n0158_004:0263b29_3"
    },
    {
        "source_sentence": "千四世尊出現涅槃，彼一切正法滅已，於賢劫中，然後我當成阿耨多羅三藐三菩提，",
        "translation": "One thousand four world-honored ones will appear in nirvana. After the cessation of all right doctrine, I shall attain anuttarii samyaksarrzbodhi later in the Bhadrakalpa.",
        "source": "T03n0158_004:0263c01_4"
    },
    {
        "source_sentence": "如彼賢劫千四諸佛壽命限量。",
        "translation": "It's like the 1,400 buddhas of that good eon who have limited life spans.",
        "source": "T03n0158_004:0263c03_5"
    },
    {
        "source_sentence": "我逮菩提已，壽命與等；",
        "translation": "My life span after attaining enlightenment will be the same as this.",
        "source": "T03n0158_004:0263c04_6"
    },
    {
        "source_sentence": "如彼所有聲聞僧數，我聲聞眾亦當與等；",
        "translation": "As many śrāvakas as there are in that assembly, so will my disciples be equal to them.",
        "source": "T03n0158_004:0263c05_7"
    },
    {
        "source_sentence": "如彼半劫千四如來所度眾生，獨我與等；",
        "translation": "Good man, it is like the sentient beings liberated by those forty-four tathagatas in a half world age. I alone am equal to them.",
        "source": "T03n0158_004:0263c06_8"
    },
    {
        "source_sentence": "彼諸佛世尊學聲聞者，設違失戒墜邪見林，不敬諸佛，多憎嫉心、惡心、害心伺求法僧，",
        "translation": "Those buddhas and world-honored ones who train śrāvakas, if they violate the precepts and fall into the forest of wrong views, don't venerate the buddhas, are often hateful, jealous, angry, and harmful, and seek the Dharma and saṃgha.",
        "source": "T03n0158_004:0263c06_9"
    },
    {
        "source_sentence": "失心、過心誹謗賢聖，非毀正法作無間業者，願我逮菩提時，於生死中拔彼一切，",
        "translation": "May I attain enlightenment and be freed from all of them in birth and death!",
        "source": "T03n0158_004:0263c08_10"
    },
    {
        "source_sentence": "安置無畏涅槃城中。",
        "translation": "He'll be placed in the city of fearless nirvāṇa.",
        "source": "T03n0158_004:0263c10_11"
    },
    {
        "source_sentence": "乃至我般涅槃，隨正法幾時滅賢劫俱盡。",
        "translation": "Up to my parinirvāṇa, how long will it be when I follow the right teaching and cease the good eon?",
        "source": "T03n0158_004:0263c11_12"
    },
    {
        "source_sentence": "我正法滅賢劫盡已，當令我齒及身舍利，變成無量阿僧祇化佛，具足三十二大人之相以莊嚴身，",
        "translation": "“O Bhagavat! When the eon of my true teaching has ended, I will cause my teeth and all the relics of my body to become boundless incalculable buddhas, endowed with the thirty-two marks of greatness that adorn their bodies.",
        "source": "T03n0158_004:0263c12_13"
    },
    {
        "source_sentence": "令一一相八十種好而自莊嚴；",
        "translation": "They cause each characteristic to adorn themselves with eighty kinds of embellishments.",
        "source": "T03n0158_004:0263c14_14"
    },
    {
        "source_sentence": "令諸化佛往至十方無量阿僧祇無佛之國，令一一化佛勸彼無量阿僧祇眾生使住三乘。",
        "translation": "He causes the apparitional buddhas to go to measureless incalculable numbers of buddha-lands in the ten directions, and he causes each apparitional buddha to encourage measureless incalculable numbers of sentient beings to abide in the three vehicles.",
        "source": "T03n0158_004:0263c15_15"
    },
    {
        "source_sentence": "其有佛土為災劫所壞，令彼化佛往至其中，救濟眾生如前所說，然後令成如意摩尼。",
        "translation": "If there's a Buddha land that's destroyed by an eon of calamity, he causes those transformation buddhas to go there, rescue sentient beings as described above, and then he causes them to form the wish-granting maṇi.",
        "source": "T03n0158_004:0263c17_16"
    },
    {
        "source_sentence": "於諸佛土若有眾生乏無珍寶，到彼諸國如意雨寶示現伏藏。",
        "translation": "If there are sentient beings in the buddha lands who lack rare treasures, they'll go to those countries and show their wish-granting rain treasures to subdue them.",
        "source": "T03n0158_004:0263c19_17"
    },
    {
        "source_sentence": "又餘佛土眾生尠諸善業為病所困，亦到於彼令雨海此岸牛頭栴檀香，令彼香雨滅除眾生結病身患及與見困，",
        "translation": "Also, in other buddha-lands, when sentient beings are suffering from hunger and good deeds because they're afflicted by illness, they also go there to rain the sandalwood fragrance of oxhead sandalwood on this side of the sea, causing that fragrance to cease. That rain removes the bonds of sickness, physical pain, and vision for sentient",
        "source": "T03n0158_004:0263c20_18"
    },
    {
        "source_sentence": "令彼眾生勤三福地得生天上。",
        "translation": "It causes those sentient beings to diligently cultivate the three stages of merit and attain birth in heaven.",
        "source": "T03n0158_004:0263c23_19"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0263c23_20"
    },
    {
        "source_sentence": "我行菩薩行時，欲以如是濟度眾生。",
        "translation": "When I practice the bodhisattva's practice, I want to save sentient beings in this way.",
        "source": "T03n0158_004:0263c24_21"
    },
    {
        "source_sentence": "我逮菩提時，如是作佛事。",
        "translation": "When I attained enlightenment, I thus performed buddha-works.",
        "source": "T03n0158_004:0263c24_22"
    },
    {
        "source_sentence": "我般涅槃後，亦令如是無量無邊諸佛土中救濟眾生。",
        "translation": "After my parinirvāṇa, I'll also cause such measureless and limitless buddha lands to save sentient beings.",
        "source": "T03n0158_004:0263c25_23"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T03n0158_004:0263c26_24"
    },
    {
        "source_sentence": "若我如是不得滿，不為眾生能作良藥而救濟者，令我禮佛已不見十方無量無邊世界中現在住世說法諸佛，",
        "translation": "If, in this way, I do not attain enlightenment and am unable to provide medicine for sentient beings, so that they may be liberated, then after venerating the Buddha, I will not see the buddhas of the ten directions, who are presently abiding in infinite worlds everywhere, teaching the Dharma.",
        "source": "T03n0158_004:0263c26_25"
    },
    {
        "source_sentence": "今日世尊不授我阿耨多羅三藐三菩提記；",
        "translation": "Today the World-honored One did not give me the assurance of highest, complete enlightenment.",
        "source": "T03n0158_004:0263c29_26"
    },
    {
        "source_sentence": "又今世尊所授多億眾生阿耨多羅三藐三菩提記，令我亦不見彼諸佛世尊，",
        "translation": "“Furthermore, the assurance of unexcelled, perfect enlightenment granted by the World-honored One to hundreds of millions of living beings has caused me not to see those buddhas either.",
        "source": "T03n0158_004:0264a01_27"
    },
    {
        "source_sentence": "不聞菩提聲。",
        "translation": "They won't hear the sound of enlightenment.",
        "source": "T03n0158_004:0264a03_28"
    },
    {
        "source_sentence": "若如是意不滿者，令我流轉生死不聞佛聲、法聲、僧聲，不聞善業聲，",
        "translation": "If someone’s mind isn’t fulfilled in this way, they will cause the self to transmigrate in birth and death without hearing the sounds of buddhas, Dharma, or Sangha [and] without hearing the sounds of good deeds.",
        "source": "T03n0158_004:0264a03_29"
    },
    {
        "source_sentence": "令此諸聲不經我耳。",
        "translation": "That way, these sounds won't pass through my ears.",
        "source": "T03n0158_004:0264a05_0"
    },
    {
        "source_sentence": "令我常在阿鼻地獄。』",
        "translation": "I'll always be in the avīci hell.'",
        "source": "T03n0158_004:0264a05_1"
    },
    {
        "source_sentence": "「寶藏如來告持大力童子言：『善哉，善哉！",
        "translation": "The Ratnaketu Tathāgata addressed the boy Mahāprajñāpāramitā, saying, 'Good, good!",
        "source": "T03n0158_004:0264a05_2"
    },
    {
        "source_sentence": "善丈夫！",
        "translation": "Good man!",
        "source": "T03n0158_004:0264a06_3"
    },
    {
        "source_sentence": "汝當為眾生作善良藥脫諸苦難。",
        "translation": "You must create good medicine for sentient beings to free them from suffering and distress.",
        "source": "T03n0158_004:0264a07_4"
    },
    {
        "source_sentence": "善丈夫！",
        "translation": "Good man!",
        "source": "T03n0158_004:0264a07_5"
    },
    {
        "source_sentence": "是故字汝為無垢明藥王。",
        "translation": "That's why it's called you, the stainless luminous king of medicine.",
        "source": "T03n0158_004:0264a08_0"
    },
    {
        "source_sentence": "汝無垢明藥王！",
        "translation": "You, King of the stainless luminous medicine king!",
        "source": "T03n0158_004:0264a08_1"
    },
    {
        "source_sentence": "於當來世過一恒河沙數阿僧祇、二恒河沙數阿僧祇之餘，於賢劫中千四如來成佛未久汝先供養，",
        "translation": "“World-honored One, in the future aeons beyond as many eons as there are grains of sand in one Ganges River and after as many eons as there are grains of sand in two Ganges Rivers, you will first pay homage to the fourteen thousand buddhas of the present world age of enlightenment who will soon become buddhas.",
        "source": "T03n0158_004:0264a08_2"
    },
    {
        "source_sentence": "乃至如汝立願，青葉髻王如來般涅槃已。",
        "translation": "It's even like you made the vow that the Tathāgata King of the Topknot of blue leaves will enter parinirvāṇa after you do so.",
        "source": "T03n0158_004:0264a11_3"
    },
    {
        "source_sentence": "正法滅後，汝當成阿耨多羅三藐三菩提，號曰樓至如來乃至佛世尊，壽命半劫；",
        "translation": "“After the nirvana of the true-dharma, you will attain unexcelled complete perfect enlightenment, which will be called ‘anuttara samyaksarrzbodhi.’ The Tathāgata Ruci and so on, up to the Buddha Bhagavat, will have a life span of one-half eon.",
        "source": "T03n0158_004:0264a12_4"
    },
    {
        "source_sentence": "如彼賢劫千四諸佛聲聞僧數，汝聲聞眾獨與彼等，所度眾生亦復與等；",
        "translation": "Just as in those buddhas and śrāvakas of the fourteenth kalpa of goodness there were so many disciples, you disciples were the only ones who gave them to them. The sentient beings you liberated were also equal to their number.",
        "source": "T03n0158_004:0264a14_0"
    },
    {
        "source_sentence": "般涅槃後正法滅時賢劫俱盡，如是汝齒及以舍利成諸化佛；",
        "translation": "When the true-dharma disappears after parinirvana, the kalpa of goodness will all end. In this way your teeth and the relics will become apparitional buddhas.",
        "source": "T03n0158_004:0264a15_1"
    },
    {
        "source_sentence": "如是乃至無佛國中雨栴檀香，除彼結病見困身患，安置眾生著三福地皆得生天。』",
        "translation": "Thus, it doesn't even rain sandalwood incense in the Buddha's country, which removes the afflictions and illnesses of those who are freed from their bonds and sees the affliction of body and place sentient beings in the three meritorious stages that will all be born in heaven.'",
        "source": "T03n0158_004:0264a17_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0264a18_3"
    },
    {
        "source_sentence": "爾時無垢明藥王菩薩白佛言：『世尊！",
        "translation": "It was then that the Bodhisattva King of Immaculate Medicine said to the Buddha, 'Bhagavān!",
        "source": "T03n0158_004:0264a19_4"
    },
    {
        "source_sentence": "若我如是意得滿者，唯願世尊，以百福莊嚴相足著我頂上。』",
        "translation": "If I've fulfilled my intention like this, may the Bhagavān put my feet on top of my head with the mark of a hundred merits.'",
        "source": "T03n0158_004:0264a19_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0264a21_6"
    },
    {
        "source_sentence": "時寶藏如來即以百福莊嚴相足以摩其頂。",
        "translation": "The Jewel-Store Tathāgata then covered his head with the mark of a hundred merits.",
        "source": "T03n0158_004:0264a21_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0158_004:0264a22_8"
    },
    {
        "source_sentence": "時無垢明藥王菩薩，心大歡喜意甚踊躍，五體投地禮寶藏如來足已，却住一面。",
        "translation": "The Bodhisattva King of the Medicine King of Immaculate Illumination then, overjoyed and ecstatic, bowed his five bodies to the ground at the feet of the Ratnaketu Tathāgata and withdrew to one side.",
        "source": "T03n0158_004:0264a22_9"
    },
    {
        "source_sentence": "時海濟婆羅門以天劫波育衣與之，讚言：『善哉，善哉！",
        "translation": "The Brāhmaṇa Hayagrīva then gave him the celestial eunuch's robe and praised it, saying, 'Good, good!",
        "source": "T03n0158_004:0264a24_10"
    },
    {
        "source_sentence": "丈夫！",
        "translation": "Good man!",
        "source": "T03n0158_004:0264a25_11"
    },
    {
        "source_sentence": "所願甚善。",
        "translation": "What he wishes for is very good.",
        "source": "T03n0158_004:0264a25_12"
    },
    {
        "source_sentence": "自今已後勿為我使，隨意所欲。』",
        "translation": "From now on, don't be my messenger; do as you wish.'",
        "source": "T03n0158_004:0264a26_13"
    },
    {
        "source_sentence": "大乘悲分陀利經卷第四",
        "translation": "*Mahayana-paripṛcchā(sūtra), Volume 4",
        "source": "T03n0158_004:0264a27_0"
    }
]