[
    {
        "source_sentence": "佛說眾許摩訶帝經卷第二",
        "translation": "Foshuo zhixiang moha di jing, vol. 2",
        "source": "T03n0191_002:0935c15_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚少卿",
        "translation": "Xitian zhuan jing sanzang朝散 dafu xi Hongun shouxing",
        "source": "T03n0191_002:0935c17_0"
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao daishi jing faxian Feng imperial edict translation",
        "source": "T03n0191_002:0935c18_0"
    },
    {
        "source_sentence": "「爾時補多落迦大城有一婬女，色相端嚴形體殊妙。",
        "translation": "At the time, there was a nymphomaniac woman in the great city of Potalaka with an elegant appearance and a marvelous body.",
        "source": "T03n0191_002:0935c19_0"
    },
    {
        "source_sentence": "時有一人名彌里拏羅，於此女人而生躭染，即以金、銀、珠寶、上妙衣服而給與之。",
        "translation": "At the time, there was a man named Maitreya who became angry with this woman and gave her gold, silver, jewelry, and exquisite clothing.",
        "source": "T03n0191_002:0935c20_1"
    },
    {
        "source_sentence": "忽於後時復有一人，於此婬女亦生愛著，告婬女言：『我以金錢五百與汝受用，",
        "translation": "Suddenly, a man came along and said to the nymphomaniac woman, “I gave you five hundred pieces of gold for your use.",
        "source": "T03n0191_002:0935c22_0"
    },
    {
        "source_sentence": "汝可隨吾同為娛樂。』",
        "translation": "You can follow me and enjoy it together.'",
        "source": "T03n0191_002:0935c23_1"
    },
    {
        "source_sentence": "婬女聞已即與同行，乃令侍婢往白彌里拏羅：『今有他適，未遑相就。』",
        "translation": "After hearing this, the promiscuous woman and her companions then ordered their maidservants to go to Maitreya and tell him, 'Now that there's another suitable place, we won't have time to get together.'",
        "source": "T03n0191_002:0935c24_2"
    },
    {
        "source_sentence": "拏羅聞言即告婢曰：『彼若歸家，速令來至我住園林之中。』",
        "translation": "When he heard this, Kālā told the maidservant, 'If they return home, quickly send them to me to stay in the garden.'",
        "source": "T03n0191_002:0935c25_3"
    },
    {
        "source_sentence": "婢迴本舍，具以其事白於婬女。",
        "translation": "The maidservant returned to her original dwelling and told the promiscuous woman all about her affairs.",
        "source": "T03n0191_002:0935c27_4"
    },
    {
        "source_sentence": "婬女聞已略無行意，婢知不允，復往彌里拏羅處，具說婬女違背之事。",
        "translation": "Having heard this, the promiscuous maid had no intention of doing so. Knowing her disobedience, the maidservant went to another place in Miliṇḍa and told him all about the contrary events of the promiscuous maid.",
        "source": "T03n0191_002:0935c27_5"
    },
    {
        "source_sentence": "彼人聞已心生忿怒，遣婢勸說：『速令至我園林之中。』",
        "translation": "After hearing this, that person becomes angry and sends a maidservant to exhort her, saying, 'Quickly go to my garden.'",
        "source": "T03n0191_002:0935c29_6"
    },
    {
        "source_sentence": "婢既受教，以種種方便誘引婬女，婬女遂行。",
        "translation": "Having received the instruction, the maidservant tempted the promiscuous woman with various methods, and the promiscuous woman then did so.",
        "source": "T03n0191_002:0936a01_7"
    },
    {
        "source_sentence": "彼人見已呵責之曰：『我自昔來恒以衣服、寶貨、財物而常給濟，何故於今棄背於我？』",
        "translation": "Seeing this, that person rebuked him, saying, 'Since the distant past, I've always offered clothing, treasures, and possessions to help them, so why would you abandon me now?'",
        "source": "T03n0191_002:0936a02_8"
    },
    {
        "source_sentence": "即持利劍殺彼婬女。",
        "translation": "He then took a sharp sword and killed that promiscuous woman.",
        "source": "T03n0191_002:0936a04_9"
    },
    {
        "source_sentence": "「爾時瞿曇菴舍近彼園林，彌里拏羅潛將所執利劍，送置菴內而遂遁去。",
        "translation": "At the time, Gautama's house was near that grove, and Maitreya secretly took a sharp sword he held in his hand, sent it inside the box, and withdrew.",
        "source": "T03n0191_002:0936a04_10"
    },
    {
        "source_sentence": "時婬女婢高聲唱言：『此處殺人！』",
        "translation": "The maidservants then raised their voices and called out, 'There's a killer here!'",
        "source": "T03n0191_002:0936a06_11"
    },
    {
        "source_sentence": "眾多聞已，俱詣仙人所居菴舍，獲彼利刃鮮血尚存。",
        "translation": "After hearing this, many people went to the monastery where the sage lived and found that sharp sword and fresh blood was still alive.",
        "source": "T03n0191_002:0936a07_12"
    },
    {
        "source_sentence": "眾人責言：『汝是仙人，何故於今而行殺害？』",
        "translation": "The crowd rebuked him, saying, 'Why are you a sage and why are you killing people now?'",
        "source": "T03n0191_002:0936a08_13"
    },
    {
        "source_sentence": "作是語已，即以繩索縛仙人手，送往城中至王殿前。",
        "translation": "After he said this, he tied the sage's hand with a rope and sent it to the city in front of the king's palace.",
        "source": "T03n0191_002:0936a09_14"
    },
    {
        "source_sentence": "眾人告曰：『此是出家仙人，棄背梵行行不淨行；",
        "translation": "The people of the assembly said, “This is a renunciant sage who has renounced the practice of austerity and engaged in impurity.",
        "source": "T03n0191_002:0936a10_15"
    },
    {
        "source_sentence": "復以利劍斷婬女命。』",
        "translation": "Again, he uses a sharp sword to cut off the life of a nymphomaniac woman.'",
        "source": "T03n0191_002:0936a11_16"
    },
    {
        "source_sentence": "王聞是事，心生忿怒，即遣出城，令以木簽貫其支體。",
        "translation": "When the king heard this, his anger arose in his mind and he expelled him from the city and ordered wood to be glued around his limbs.",
        "source": "T03n0191_002:0936a12_17"
    },
    {
        "source_sentence": "王宣令已，是時仙人頂戴花鬘、身著青衣，從者周迴手執器仗，高聲唱言：『此是犯戒殺人之賊。』",
        "translation": "After the king had proclaimed the order, the sage then wore a flower garland on his head and a green robe over his body, circled around him with his hands holding a container and a weapon, and shouted loudly, 'This is",
        "source": "T03n0191_002:0936a13_18"
    },
    {
        "source_sentence": "爾時仙人都無怯怖，至城門外即依王法。",
        "translation": "At the time, the sage was not frightened, so he went outside the city gates and relied on the king's teaching.",
        "source": "T03n0191_002:0936a15_19"
    },
    {
        "source_sentence": "「爾時本師訖里瑟拏吠波野曩仙人，來至菴中不見弟子，即往隣近漸次尋訪；",
        "translation": "At that time the venerable Kṛṣa Upagupta, the teacher of the kṣatriyas, a holy man named Vaiśravaṇa, came to the cave but he did not see his disciple there.",
        "source": "T03n0191_002:0936a17_0"
    },
    {
        "source_sentence": "忽見弟子縛其手足，在木簽上受如是苦。",
        "translation": "Suddenly, he saw that the disciple was bound by his hands and feet and suffered this kind of pain above the wooden signpost.",
        "source": "T03n0191_002:0936a18_1"
    },
    {
        "source_sentence": "師既見已，身毛驚竪，悲淚涕泣問其弟子：『汝何如是有斯過罪？",
        "translation": "When the teacher saw this, his hair stood on end in fear and he asked his disciple with sorrowful tears and cries, 'What's so wrong with you?'",
        "source": "T03n0191_002:0936a19_2"
    },
    {
        "source_sentence": "又汝此身受諸苦惱，晝夜疼痛云何當忍？』",
        "translation": "Furthermore, this body of yours is subject to pain and suffering, so how can you tolerate day and night pain?'",
        "source": "T03n0191_002:0936a21_3"
    },
    {
        "source_sentence": "弟子白言：『大仙！",
        "translation": "The disciple said, 'Great sage!",
        "source": "T03n0191_002:0936a22_4"
    },
    {
        "source_sentence": "我於此身求諸疼痛都不可得。』",
        "translation": "'None of the pains I've asked for in this body can be obtained.'",
        "source": "T03n0191_002:0936a22_5"
    },
    {
        "source_sentence": "師曰：『汝何如是離其苦惱？』",
        "translation": "The teacher said, 'How are you thus free of their suffering and distress?'",
        "source": "T03n0191_002:0936a23_6"
    },
    {
        "source_sentence": "弟子白言：『我對師前發誠實願，若吾此身實無疼痛，即令我師身為金色。』",
        "translation": "The disciple said, 'I made a sincere vow before my teacher, saying, 'If this body of mine really has no pain, then I will cause my teacher's body to be golden-colored.'",
        "source": "T03n0191_002:0936a23_7"
    },
    {
        "source_sentence": "作是願已，經剎那頃，師自變身作真金色，一切人眾皆悉見之，是故立名金色仙人。",
        "translation": "After making this vow, the teacher transformed himself into a truly golden-colored sage and was seen by all the people; therefore, he's called a golden-colored sage.",
        "source": "T03n0191_002:0936a25_8"
    },
    {
        "source_sentence": "爾時弟子復問師曰：『我此命終當生何處？』",
        "translation": "It was then that the disciple again asked his teacher, 'Where will I be born at the end of my life?'",
        "source": "T03n0191_002:0936a27_9"
    },
    {
        "source_sentence": "師曰：『准婆羅門法，若絕嗣子即無生處。』",
        "translation": "The teacher said, 'According to the Brāhmaṇa teaching, if someone cuts off their heirs, that's the place of no birth.'",
        "source": "T03n0191_002:0936a28_10"
    },
    {
        "source_sentence": "弟子白言：『我作童子不樂王宮，捨位出家，豈有子耶？』",
        "translation": "The disciple said, 'I'm a boy who doesn't enjoy the king's palace and renounces my throne and leaves home, so how could there be a child?'",
        "source": "T03n0191_002:0936a29_11"
    },
    {
        "source_sentence": "師即告曰：『汝於今者何不思惟在王宮時娛樂之事。』",
        "translation": "The teacher then told him, 'Now, why don't you think about the entertaining things you do when you're in the king's palace?'",
        "source": "T03n0191_002:0936b01_12"
    },
    {
        "source_sentence": "弟子白言：『我今此身見受王法苦相如是，云何而能思前娛樂？』",
        "translation": "The disciple said, 'Now that I've seen the painful characteristics of the king's teaching in this body, how can I contemplate it and enjoy it?'",
        "source": "T03n0191_002:0936b02_13"
    },
    {
        "source_sentence": "「爾時金色仙人具大神通，經剎那間於虛空中降大風雨，淋弟子身即得清涼，",
        "translation": "“At that time the holy man Golden-colored One, endowed with great supernatural powers, showered down a great deal of wind and rain from the sky for an instant. The body of the disciple Dīpaṅkara thereupon became",
        "source": "T03n0191_002:0936b05_0"
    },
    {
        "source_sentence": "離諸苦惱平復如故；",
        "translation": "They will be freed from all suffering and distress, just as before.",
        "source": "T03n0191_002:0936b06_1"
    },
    {
        "source_sentence": "由是弟子思前快樂而生欲心，滴二滴精墮地面上。",
        "translation": "Because of this, the disciple thought about his former happiness and gave rise to a mind of desire, dropping two drops of semen on the ground.",
        "source": "T03n0191_002:0936b07_2"
    },
    {
        "source_sentence": "爾時瞿曇仙人有四思惟：一、思惟自身；",
        "translation": "It was then that the holy man Gautama had four kinds of thought:",
        "source": "T03n0191_002:0936b08_3"
    },
    {
        "source_sentence": "二、思惟眾生；",
        "translation": "The second is to think of sentient beings.",
        "source": "T03n0191_002:0936b09_4"
    },
    {
        "source_sentence": "三、思惟眾生成佛；",
        "translation": "The third is to contemplate the attainment of buddhahood by all beings.",
        "source": "T03n0191_002:0936b09_5"
    },
    {
        "source_sentence": "四、思惟一切佛剎。",
        "translation": "4. contemplating all the buddha bases.",
        "source": "T03n0191_002:0936b10_0"
    },
    {
        "source_sentence": "如是思已，其二滴精結成二卵，每日出時被日所照，不久之間其卵自破，",
        "translation": "Having thought in this way, these two drops of semen formed into two eggs. When the sun came out each day, they were illumined by the light of the sun. Soon thereafter the eggs broke apart on their own.",
        "source": "T03n0191_002:0936b10_1"
    },
    {
        "source_sentence": "生二童子色相端正。",
        "translation": "They gave birth to two children with correct appearances.",
        "source": "T03n0191_002:0936b12_2"
    },
    {
        "source_sentence": "瞿曇仙人將此二童子，入甘蔗園棲泊居止；",
        "translation": "The ṛṣi Gautama took these two children into the sugarcane grove to live and make their abodes.",
        "source": "T03n0191_002:0936b12_3"
    },
    {
        "source_sentence": "瞿曇因日所炙尋即命終。",
        "translation": "Gautama then died at the end of his life, just as he was being roasted that day.",
        "source": "T03n0191_002:0936b13_4"
    },
    {
        "source_sentence": "爾時金色仙人來入園中問言：『童子！",
        "translation": "It was then that the golden-colored sage came into the park and asked, 'Boy!",
        "source": "T03n0191_002:0936b14_5"
    },
    {
        "source_sentence": "汝誰人耶？』",
        "translation": "Who are you?'",
        "source": "T03n0191_002:0936b14_6"
    },
    {
        "source_sentence": "童子答言：『我即瞿曇所生之子。』",
        "translation": "The boy answered, 'I am the son born by Gautama.'",
        "source": "T03n0191_002:0936b15_7"
    },
    {
        "source_sentence": "金仙聞已心生歡喜，因挈二童歸菴養育。",
        "translation": "After hearing this, the golden sage rejoiced in his heart and took pity on the two children.",
        "source": "T03n0191_002:0936b15_8"
    },
    {
        "source_sentence": "以初生時卵因日照，乃為立名，名為日族為第一姓；",
        "translation": "Because the eggs at the time of their first birth are illuminated by the sun, they establish a name for them. The sun family is the first surname given to them.",
        "source": "T03n0191_002:0936b16_9"
    },
    {
        "source_sentence": "復是瞿曇所生之子，因立瞿曇為第二姓；",
        "translation": "Again, this was the second surname given to them by Gautama.",
        "source": "T03n0191_002:0936b18_10"
    },
    {
        "source_sentence": "又是自身所生，因立阿儗囉娑為第三姓；",
        "translation": "The third family name is asura, because they are born by themselves.",
        "source": "T03n0191_002:0936b19_0"
    },
    {
        "source_sentence": "由於甘蔗園中收得養育，因立甘蔗為第四姓。",
        "translation": "Because they harve and nourish themselves in the sugarcane grove, they establish sugarcane as the fourth family.",
        "source": "T03n0191_002:0936b20_0"
    },
    {
        "source_sentence": "「爾時有大國王名婆羅捺嚩惹，其王命終無子嗣位，輔相大臣共議斯事，",
        "translation": "At the time, there was a great king named Vārāṇasī who died without a son to succeed to the throne. The prime ministers and ministers discussed this matter together.",
        "source": "T03n0191_002:0936b22_0"
    },
    {
        "source_sentence": "未委何人可當灌頂王位。",
        "translation": "I'm not yet entrusted with the position of king who can be consecrated.",
        "source": "T03n0191_002:0936b23_1"
    },
    {
        "source_sentence": "有一大臣白群臣言：『先迦囉拏王有一太子，名曰瞿曇，捨父王位於山林間，",
        "translation": "One of the ministers said to the courtiers, “Formerly there was a prince named Gautama in the kingdom of Karāṇasī. He renounced his father’s throne and remained among the mountain forests.",
        "source": "T03n0191_002:0936b24_2"
    },
    {
        "source_sentence": "事訖里瑟拏吠波野曩仙人，彼是釋種，可得紹嗣灌頂王位。』",
        "translation": "He serves the sage Kṛṣaṇa Vaiśravaṇa, who's a Śākyamuni and can be reborn in the kingdom of consecration.'",
        "source": "T03n0191_002:0936b25_3"
    },
    {
        "source_sentence": "群臣聞已，即往山中，詣仙人所，頭面禮足白言：『大仙！",
        "translation": "When the ministers heard this, they went to the mountain and went to the sage, bowed their heads and feet, and said, 'Great sage!",
        "source": "T03n0191_002:0936b27_4"
    },
    {
        "source_sentence": "過去迦囉拏王有一太子，名曰瞿曇，今在何處？』",
        "translation": "In the past, there was a prince named Gautama from the king of Kārttika, whose name was Gautama; where is he now?'",
        "source": "T03n0191_002:0936b28_5"
    },
    {
        "source_sentence": "大仙白言：『久已命終。』",
        "translation": "The great sage said, 'It's been a long time since my life ended.'",
        "source": "T03n0191_002:0936b29_6"
    },
    {
        "source_sentence": "復為群臣具說上事。",
        "translation": "Again, he explained the above matters to his ministers.",
        "source": "T03n0191_002:0936c01_0"
    },
    {
        "source_sentence": "大臣聞已，心生懊惱：『我等今者甚得大罪。』",
        "translation": "After hearing this, the minister became distressed in mind and said, 'Now we've committed a great sin.'",
        "source": "T03n0191_002:0936c01_1"
    },
    {
        "source_sentence": "作是語已，見二童子身相端嚴，問：『是誰耶？』",
        "translation": "After he said this, he saw the two children's physical appearance and asked, 'Who are they?'",
        "source": "T03n0191_002:0936c02_2"
    },
    {
        "source_sentence": "金仙答言：『此即瞿曇所生之子。』",
        "translation": "The golden sage answered, 'This is the son born by Gautama.'",
        "source": "T03n0191_002:0936c03_3"
    },
    {
        "source_sentence": "群臣聞已，俱懷踊躍：『今此童子是王種族。』",
        "translation": "After the ministers heard this, they all rejoiced and said, 'Now, this boy is of the king's family.'",
        "source": "T03n0191_002:0936c04_4"
    },
    {
        "source_sentence": "即令繼紹灌頂王位，是故立姓名甘蔗王。",
        "translation": "He then ordered him to succeed the throne of the king of consecration, so he named himself King Ikṣuvāku.",
        "source": "T03n0191_002:0936c05_0"
    },
    {
        "source_sentence": "「此王之後子孫相繼，有一百甘蔗王，都補多落迦城。",
        "translation": "“This king’s descendants succeeded one hundred sugarcane kings, all in the city of Potalaka.",
        "source": "T03n0191_002:0936c05_1"
    },
    {
        "source_sentence": "其最後甘蔗王生其四子：一名烏羅迦目佉；",
        "translation": "The last king of sugarcane gave birth to four sons, one of whom was called Uraka-mukha.",
        "source": "T03n0191_002:0936c07_2"
    },
    {
        "source_sentence": "二名迦羅尼；",
        "translation": "The second is called the prātimokṣatriya.",
        "source": "T03n0191_002:0936c08_3"
    },
    {
        "source_sentence": "三名賀悉帝曩野；",
        "translation": "The third was named Hasetiya and the fourth Vaiśravaṇa.",
        "source": "T03n0191_002:0936c08_4"
    },
    {
        "source_sentence": "四名蘇曩布囉迦。",
        "translation": "Fourth, it's called sūṭapuraka.",
        "source": "T03n0191_002:0936c08_5"
    },
    {
        "source_sentence": "生四王子已，於其後時，妃后命終，王即愁惱，以手搘頤情懷悲痛。",
        "translation": "After the four princes had been born, the queen died soon afterward. The king was grieved and distressed; her hands touched each other’s chests and shedding tears of sorrow in his heart.",
        "source": "T03n0191_002:0936c09_6"
    },
    {
        "source_sentence": "時有大臣見王不樂，而共奏言：『大王！",
        "translation": "Seeing the king's displeasure, some ministers said together, 'Great king!",
        "source": "T03n0191_002:0936c10_7"
    },
    {
        "source_sentence": "云何而懷愁惱神情不悅？』",
        "translation": "How did you harbor sorrow and mental dissatisfaction?'",
        "source": "T03n0191_002:0936c11_8"
    },
    {
        "source_sentence": "王即答言：『我為妃后今忽無常有斯痛苦。』",
        "translation": "The king then answered, 'Now that I'm the queen and queen, I suddenly become impermanent and suffer this pain.'",
        "source": "T03n0191_002:0936c12_9"
    },
    {
        "source_sentence": "大臣聞已，而白王言：『我聞隣國小王，王有一女，具大福德，端正殊妙，",
        "translation": "Having heard this, the minister said to the king: I have heard that there was a daughter of the king of the neighboring villages who possessed great merit and was beautiful in appearance.",
        "source": "T03n0191_002:0936c13_10"
    },
    {
        "source_sentence": "堪為國后。』",
        "translation": "She's capable of becoming the king's queen.'",
        "source": "T03n0191_002:0936c14_11"
    },
    {
        "source_sentence": "王語群臣：『彼小國王欲侵我境，云何成親？』",
        "translation": "The king said to his ministers, 'That small king wants to attack my territory, so how can he become intimate?'",
        "source": "T03n0191_002:0936c14_12"
    },
    {
        "source_sentence": "大臣白言：『別有小國亦生端正殊勝之女，若納為妃甚適王情。』",
        "translation": "The ministers said, 'There's another small kingdom that also gives birth to a beautiful and superior woman who's well-behaved as a queen.'",
        "source": "T03n0191_002:0936c15_13"
    },
    {
        "source_sentence": "王既聞已，即遣使臣往彼小國，具述王意，欲娉其女立為妃后。",
        "translation": "After hearing this, the king sent an envoy to that small country and told the king what he wanted, intending to marry her and make her his queen.",
        "source": "T03n0191_002:0936c17_14"
    },
    {
        "source_sentence": "小王聞已，歡喜慶慰，乃告使臣：『若大國王欲娉我女立為妃后，如生男子令紹灌頂王位，",
        "translation": "Having heard these words, the king of the small countries rejoiced and said to his envoys, “If the king of a great country wishes to have my queen as his consort, just as if he were to give birth to a newly anoin",
        "source": "T03n0191_002:0936c18_15"
    },
    {
        "source_sentence": "我即許之。』",
        "translation": "I'll approve of it.'",
        "source": "T03n0191_002:0936c20_16"
    },
    {
        "source_sentence": "使臣迴國具奏上事。",
        "translation": "The envoy returned to his country and reported the above matters in detail.",
        "source": "T03n0191_002:0936c20_17"
    },
    {
        "source_sentence": "王聞所奏深情不悅：『我有長子合紹王位，云何幼小而得立耶？』",
        "translation": "When the king heard what he said, he was deeply displeased, saying, 'I have an elder son who's joined the throne of King Shao; how could he stand up when he's young?'",
        "source": "T03n0191_002:0936c21_18"
    },
    {
        "source_sentence": "大臣白言：『但且娉納，後時有子，男女未定。』",
        "translation": "The ministers said, 'Suppose you were to give birth to a child at some point later, but the men and women aren't yet determined.'",
        "source": "T03n0191_002:0936c22_19"
    },
    {
        "source_sentence": "王聞是語，即以金、銀、珍寶、羅紈、疋帛、嚴身之具迎娶歸國。",
        "translation": "When the king heard these words, he greeted them with gold, silver, treasures, jewelry, robes, silk cloth, and adorned body ornaments to take them back home.",
        "source": "T03n0191_002:0936c23_20"
    },
    {
        "source_sentence": "於後懷妊凡經九月，載生一子，身相端嚴，乃於生辰群臣慶賀。",
        "translation": "When the queen was pregnant for nine months, she gave birth to a son with an elegant appearance. On the day of his birth all the ministers congratulated him.",
        "source": "T03n0191_002:0936c24_21"
    },
    {
        "source_sentence": "王曰：『今我是子當立何名？』",
        "translation": "The king said, 'Now, what name will I give to my son?'",
        "source": "T03n0191_002:0936c26_22"
    },
    {
        "source_sentence": "大臣奏言：『彼小國王納女為妃，貴生太子繼王寶位，今請立名，名為樂王，",
        "translation": "The ministers said, “The king of that small country has taken the queen as his consort. His noble prince succeeded to the throne and is now asked to establish a name for himself, namely King Sadāparibhūta.",
        "source": "T03n0191_002:0936c26_23"
    },
    {
        "source_sentence": "命八夫人而為乳母養育太子。』",
        "translation": "He ordered eight wives to be milk mothers and nurturing princes.'",
        "source": "T03n0191_002:0936c28_24"
    },
    {
        "source_sentence": "「爾時大王欲令長子紹嗣王位，其小國王知是事已，心生忿怒，即遣使臣具論前事：『先許我女生子為王，",
        "translation": "Knowing this, the king of that small country became angry and sent an envoy to discuss the matter in detail:",
        "source": "T03n0191_002:0936c29_25"
    },
    {
        "source_sentence": "何故於今自違言約？",
        "translation": "Why does it now contradict itself by its own words?",
        "source": "T03n0191_002:0937a02_26"
    },
    {
        "source_sentence": "脫或如是，我即廣將兵眾討滅汝國。』",
        "translation": "Whether it's free or like this, I will extensively lead my troops to subjugate your country.'",
        "source": "T03n0191_002:0937a03_0"
    },
    {
        "source_sentence": "時大國王聞此語已，即生愁惱，告大臣言：『棄長立幼，於理非宜。』",
        "translation": "After hearing these words, the king of the great kingdom became distressed and told his ministers, 'It's not appropriate to abandon the old and establish the young.'",
        "source": "T03n0191_002:0937a03_1"
    },
    {
        "source_sentence": "群臣奏言：『彼小國王心力豪強，善於兵戰，舉戈犯境，必貽敗衄；",
        "translation": "The ministers of the assembly said, “The king of that small country has a strong mind and is skilled in military operations. If he attacks his territory with an artful stick he will surely defeat the enemy.",
        "source": "T03n0191_002:0937a05_2"
    },
    {
        "source_sentence": "若遣長子速疾出外，即我家國當免兵禍。』",
        "translation": "If he sends his eldest son out quickly, then my country will be spared the disaster of war.'",
        "source": "T03n0191_002:0937a06_3"
    },
    {
        "source_sentence": "王聞是語，默然未允。",
        "translation": "When the king heard these words he remained silent and did not agree.",
        "source": "T03n0191_002:0937a07_4"
    },
    {
        "source_sentence": "「爾時大臣共設權謀，即於近郊造一御園，亭池花果，林巒池沼，流泉飛閣，",
        "translation": "At that time the ministers of state agreed on a secret plan to build a royal park in the suburbs, consisting of pavilions, ponds, flowers, fruit trees, forests, lakes, ponds, streams, fountains, and",
        "source": "T03n0191_002:0937a08_5"
    },
    {
        "source_sentence": "處處遍滿。",
        "translation": "Everywhere it's pervaded.",
        "source": "T03n0191_002:0937a09_6"
    },
    {
        "source_sentence": "復以沈檀香木，雜寶纓絡，種種嚴飾殿宇樓觀。",
        "translation": "It was also decorated in various ways with sandalwood, fragrant wood, and mixed jewel ornaments.",
        "source": "T03n0191_002:0937a09_7"
    },
    {
        "source_sentence": "爾時大王長子與諸臣僚出城遊賞，見此園林訪問左右：『是誰所有？』",
        "translation": "It was then that the great king's eldest son and his ministers went out of the city to reward him, saw this park and visited his right and left, saying, 'Who owns it?'",
        "source": "T03n0191_002:0937a11_0"
    },
    {
        "source_sentence": "從臣對曰：『此是御園。』",
        "translation": "He replied to his ministers, 'This is the royal park.'",
        "source": "T03n0191_002:0937a12_1"
    },
    {
        "source_sentence": "太子聞已即時迴馬，左右勸請暫入觀覽。",
        "translation": "After hearing this, the prince immediately returned to his horse and asked him to enter the exposition for a moment.",
        "source": "T03n0191_002:0937a13_0"
    },
    {
        "source_sentence": "太子告曰：『皇王御苑我何敢往？』",
        "translation": "The prince told him, 'How dare I go to the imperial king's royal park?'",
        "source": "T03n0191_002:0937a13_1"
    },
    {
        "source_sentence": "從臣復白：『若是臣下及諸庶民即不得入，國王長子遊翫無妨。』",
        "translation": "Again, he said to his ministers, 'If these ministers and the common people won't enter, it won't be an obstruction for the king's eldest son to wander about.'",
        "source": "T03n0191_002:0937a14_2"
    },
    {
        "source_sentence": "是時太子即便入園作樂嬉戲。",
        "translation": "The prince then went into the garden to play and play.",
        "source": "T03n0191_002:0937a16_3"
    },
    {
        "source_sentence": "有一大臣上請於王：『先造御園今已成就，請王觀看。』",
        "translation": "A minister went up to the king and asked him, 'First, build a royal park that's now completed, and ask the king to look at it.'",
        "source": "T03n0191_002:0937a16_4"
    },
    {
        "source_sentence": "王聞所奏即時臨幸俯近苑囿，忽聞作樂王心疑慮。",
        "translation": "When the king heard this announcement, he immediately descended to the court and approached the monastery, where he suddenly heard that Kauśika had doubts in his mind.",
        "source": "T03n0191_002:0937a18_0"
    },
    {
        "source_sentence": "大臣白言：『太子先是在此作樂。』",
        "translation": "The ministers said, 'First, the prince was here to make music.'",
        "source": "T03n0191_002:0937a19_1"
    },
    {
        "source_sentence": "王遂赫怒：『我造此園未曾遊觀，云何太子先入作樂？",
        "translation": "The king then became furious and said, 'I've never visited this park before; how could the prince have entered it to make music?'",
        "source": "T03n0191_002:0937a19_2"
    },
    {
        "source_sentence": "其罪難捨即令出國。』",
        "translation": "That person's sin is difficult to abandon, so they'll be allowed to leave the country.'",
        "source": "T03n0191_002:0937a21_3"
    },
    {
        "source_sentence": "大臣諫爭，王怒不已，尋下詔命：『許將僕從及其眷屬，與限七日出離國城。』",
        "translation": "When the ministers remonstrated, the king became angry and ordered him to give permission to his servants and their retinues to leave the country's city for seven days.",
        "source": "T03n0191_002:0937a21_4"
    },
    {
        "source_sentence": "太子承父王勅，即與臣僚及諸親愛出補多落迦大城，去城匪遙而自安止；",
        "translation": "The prince, owing to the imperial edict of his father, went out of the great city of Potalaka together with his ministers and their relatives.",
        "source": "T03n0191_002:0937a23_5"
    },
    {
        "source_sentence": "王復遣令遠處居住。",
        "translation": "The king again sent an order to live in a distant place.",
        "source": "T03n0191_002:0937a24_6"
    },
    {
        "source_sentence": "「時雪山側婆儗囉河岸邊，有一仙人名迦毘羅，淨持梵行菴居修道。",
        "translation": "“At the time, there was a sage named Kapilavastu on the bank of the Potatara River beside the snowy mountains who purely maintained the religious practice and lived together to cultivate it.",
        "source": "T03n0191_002:0937a25_7"
    },
    {
        "source_sentence": "太子復將眷屬依止仙人，採獵禽獸以活其命。",
        "translation": "The prince then took his retinue and relied on the sage to gather hunting birds and animals to live.",
        "source": "T03n0191_002:0937a26_8"
    },
    {
        "source_sentence": "於後太子憶念色慾，顏容瘦悴。",
        "translation": "The prince then remembered his form and desires, and his countenance was emaciated.",
        "source": "T03n0191_002:0937a28_0"
    },
    {
        "source_sentence": "仙人疑問，太子具言：『我思婬樂而致斯苦。』",
        "translation": "The sage wondered, and the prince said, 'I'm thinking about sexual pleasure that causes this kind of suffering.'",
        "source": "T03n0191_002:0937a28_1"
    },
    {
        "source_sentence": "仙人白言：『勿於親姊而行欲事，餘可隨意。』",
        "translation": "The sage said, 'Don't do sexual acts with your relatives and sisters; you can do as you like.'",
        "source": "T03n0191_002:0937a29_2"
    },
    {
        "source_sentence": "太子耽著男女眾多，稚戲喧鬧日月滋甚。",
        "translation": "The prince was addicted to a large number of men and women, and the days and months of playfulness and noise grew in abundance.",
        "source": "T03n0191_002:0937b01_3"
    },
    {
        "source_sentence": "仙人心不虛靜，根識散亂，即告太子：『我今欲往別處營居。』",
        "translation": "The sage's mind isn't vacuous and still, and his faculties and consciousnesses are distracted, so he tells the prince, 'Now, I want to go to another place to live.'",
        "source": "T03n0191_002:0937b02_4"
    },
    {
        "source_sentence": "太子聞之深自慙感：『大仙於此修行歲久，道果已就，不可遷移，我於今辰，",
        "translation": "When the prince heard this, he was deeply saddened and thought to himself: Great holy man, you have cultivated your practice in this monastery for a long time. Now that you have attained enlightenment and its fruit, it cannot be moved",
        "source": "T03n0191_002:0937b03_5"
    },
    {
        "source_sentence": "將領眷屬別求住止。』",
        "translation": "He'll lead his retinue to seek a separate abode and stay.'",
        "source": "T03n0191_002:0937b05_6"
    },
    {
        "source_sentence": "仙人聞已甚適本心，即於菴居側近之處揀殊勝地，以金瓶水澆地為界，",
        "translation": "Having heard this, the holy man adapted himself to his original mind and selected a special place near the village where he lived. He poured water from a golden pitcher into the earth as a boundary.",
        "source": "T03n0191_002:0937b05_7"
    },
    {
        "source_sentence": "令太子住。",
        "translation": "He ordered the prince to stay.",
        "source": "T03n0191_002:0937b07_8"
    },
    {
        "source_sentence": "其後人民熾盛眷屬繁多，依界修城，因建國土，名迦毘羅國。",
        "translation": "The people thereafter prospered and their families were numerous. Relying on the territory they built a city, which was named Kapilavastu after the name of that country.",
        "source": "T03n0191_002:0937b07_9"
    },
    {
        "source_sentence": "復於後時有賢人指引，別造一城，名曰指城，王於此城亦號都邑。",
        "translation": "Later, another wise man instructed him to build a separate city named Zhicheng, which was also called the capital of the king.",
        "source": "T03n0191_002:0937b09_10"
    },
    {
        "source_sentence": "「爾時尾嚕茶迦王問大臣曰：『我之太子今在何處？』",
        "translation": "It was then that King Varuḍaka asked the minister, 'Where is my prince now?'",
        "source": "T03n0191_002:0937b11_0"
    },
    {
        "source_sentence": "大臣白言：『今在雪山南婆儗囉河側迦毘羅城，建二大城以為都邑，臣僚、士庶、骨肉眷屬富盛繁多，",
        "translation": "The ministers said, “To the south of the Himalayan mountain on the bank of the Kapilavastu River at present there are two big cities built to serve as capitals with numerous officials, soldiers, and other members of the royal family.",
        "source": "T03n0191_002:0937b12_1"
    },
    {
        "source_sentence": "有如大國。』",
        "translation": "There's like a great kingdom.'",
        "source": "T03n0191_002:0937b14_2"
    },
    {
        "source_sentence": "時尾嚕茶迦甘蔗王曲躬俛首，問大臣言：『我之童子能有此事。』",
        "translation": "The king of the Mahāprajñāpāramitā-sūtra then bowed his head and asked the minister, 'My boy can do this.'",
        "source": "T03n0191_002:0937b14_3"
    },
    {
        "source_sentence": "大臣白言：『太子仁德致茲雄盛。』",
        "translation": "The ministers said, 'The prince's kindness and virtue caused this to become so great.'",
        "source": "T03n0191_002:0937b16_0"
    },
    {
        "source_sentence": "因立姓氏。",
        "translation": "That's why he established his family name.",
        "source": "T03n0191_002:0937b16_1"
    },
    {
        "source_sentence": "尾嚕茶迦甘蔗王命終之後，能仁嗣位。",
        "translation": "After the death of the sugarcane king Varuḍaka, King Neng Ren succeeded to the throne.",
        "source": "T03n0191_002:0937b16_2"
    },
    {
        "source_sentence": "能仁有子，名烏羅迦目迦王；",
        "translation": "He had a son named King Urakamakosa, who was capable of benevolence.",
        "source": "T03n0191_002:0937b17_3"
    },
    {
        "source_sentence": "烏羅迦目迦王有子，名若迦抳王；",
        "translation": "The king Urakamika had a son named Rucika-rāja.",
        "source": "T03n0191_002:0937b18_4"
    },
    {
        "source_sentence": "若迦抳王有子，名賀悉帝王；",
        "translation": "If the king of Kassapa had a son, he would be called King Hasthaditya.",
        "source": "T03n0191_002:0937b19_5"
    },
    {
        "source_sentence": "賀悉帝王有子，名努布囉迦王；",
        "translation": "The king of Hesedi had a son named King Nakulaka.",
        "source": "T03n0191_002:0937b19_6"
    },
    {
        "source_sentence": "努布囉迦王有子，名烏布囉迦王。",
        "translation": "The king of upūraka had a son named King Upūraka.",
        "source": "T03n0191_002:0937b20_7"
    },
    {
        "source_sentence": "如是子孫相繼有五萬五千王，都迦毘羅大城。",
        "translation": "Thus there were fifty-five thousand successive kings, all in the great city Kapilavastu.",
        "source": "T03n0191_002:0937b21_8"
    },
    {
        "source_sentence": "「於後復有一王名十車王，十車王後有九十車王；",
        "translation": "“After that was another king named Ten-vehicle King, and after the ten-vehicle king there were ninety other kings.",
        "source": "T03n0191_002:0937b22_9"
    },
    {
        "source_sentence": "九十車王後有百車王；",
        "translation": "Behind the ninety chariot kings were a hundred chariot kings.",
        "source": "T03n0191_002:0937b23_10"
    },
    {
        "source_sentence": "百車王後有畫車王；",
        "translation": "Behind the king of one hundred chariots was the king of painted chariots.",
        "source": "T03n0191_002:0937b24_11"
    },
    {
        "source_sentence": "畫車王後有最勝車王；",
        "translation": "Behind the king of carts depicted is the supreme chariot king.",
        "source": "T03n0191_002:0937b24_12"
    },
    {
        "source_sentence": "最勝車王後有牢車王；",
        "translation": "Behind the king of the most superior chariot is the king of the laden chariot.",
        "source": "T03n0191_002:0937b25_13"
    },
    {
        "source_sentence": "牢車王後有十弓王；",
        "translation": "Behind the king of carts in chains was a king of ten bowmen.",
        "source": "T03n0191_002:0937b25_14"
    },
    {
        "source_sentence": "十弓王後有九十弓王；",
        "translation": "Behind the king of the ten-bow swords were ninety kings of the bow.",
        "source": "T03n0191_002:0937b26_15"
    },
    {
        "source_sentence": "九十弓王後有百弓王；",
        "translation": "Behind the king of ninetybows was the king of one hundredbows.",
        "source": "T03n0191_002:0937b26_16"
    },
    {
        "source_sentence": "百弓王後有最勝弓王；",
        "translation": "Behind the king of one hundred kinds of bow was the supremely superior king of bows.",
        "source": "T03n0191_002:0937b27_17"
    },
    {
        "source_sentence": "最勝弓王之後有畫弓王；",
        "translation": "Behind the king of the most superior bow is the king of painted bows.",
        "source": "T03n0191_002:0937b27_18"
    },
    {
        "source_sentence": "畫弓王之後有牢弓王，此王於南閻浮提弓射第一。",
        "translation": "Behind the king of drawn bows was the king of fastened bows, who was the first in southern Jambudvīpa to shoot a bow.",
        "source": "T03n0191_002:0937b28_19"
    },
    {
        "source_sentence": "時牢弓王有其二子：一名星賀賀努王；",
        "translation": "At that time King Lumbinī had two sons, one of whom was the king Hānanāga.",
        "source": "T03n0191_002:0937b29_20"
    },
    {
        "source_sentence": "二名師子吼王。",
        "translation": "The second is called the lion's roar king.",
        "source": "T03n0191_002:0937c01_21"
    },
    {
        "source_sentence": "爾時星賀賀努王生其四子：一名淨飯王；",
        "translation": "At that time the celestial king Hetu gave birth to four sons, one of whom was the king Jīvaka.",
        "source": "T03n0191_002:0937c01_22"
    },
    {
        "source_sentence": "二名白飯王；",
        "translation": "The second was called White Rice King.",
        "source": "T03n0191_002:0937c02_23"
    },
    {
        "source_sentence": "三曰斛飯王；",
        "translation": "The third is called the king of cooked rice.",
        "source": "T03n0191_002:0937c02_24"
    },
    {
        "source_sentence": "四名甘露飯王。",
        "translation": "The fourth name is the ambrosia rice king.",
        "source": "T03n0191_002:0937c03_25"
    },
    {
        "source_sentence": "淨飯王有二子：一名悉達多；",
        "translation": "King Śuddhodana had two sons: the first was Siddhārtha.",
        "source": "T03n0191_002:0937c03_26"
    },
    {
        "source_sentence": "二名難陀。",
        "translation": "The second name is named Nanda.",
        "source": "T03n0191_002:0937c04_27"
    },
    {
        "source_sentence": "白飯王有二子：一名娑帝疎嚕；",
        "translation": "King Bimbisāra had two sons: the first was Sadisara.",
        "source": "T03n0191_002:0937c04_28"
    },
    {
        "source_sentence": "二名婆捺哩賀。",
        "translation": "The second is called Vārāṇasīha.",
        "source": "T03n0191_002:0937c05_29"
    },
    {
        "source_sentence": "斛飯王有二子：一名摩賀曩麼；",
        "translation": "The king of Kukkuṭārāma had two sons: the first was Mahāprajāpaṇḍa.",
        "source": "T03n0191_002:0937c05_30"
    },
    {
        "source_sentence": "二名阿儞樓駄。",
        "translation": "The second is called Anavatapta.",
        "source": "T03n0191_002:0937c06_31"
    },
    {
        "source_sentence": "甘露飯王有二子：一名阿難陀；",
        "translation": "The king of the ambrosial rice had two sons: one was called Ananda.",
        "source": "T03n0191_002:0937c06_32"
    },
    {
        "source_sentence": "二名提婆達多。",
        "translation": "The second is called Devadatta.",
        "source": "T03n0191_002:0937c07_33"
    },
    {
        "source_sentence": "淨飯王有女，名蘇鉢囉；",
        "translation": "King Śuddhodana had a daughter named Subhadra.",
        "source": "T03n0191_002:0937c07_34"
    },
    {
        "source_sentence": "白飯王有女，名鉢怛囉摩黎；",
        "translation": "Ānanda, King Bimbisāra had a daughter named Padmavyūha.",
        "source": "T03n0191_002:0937c08_35"
    },
    {
        "source_sentence": "斛飯王有女，名䟦捺黎；",
        "translation": "There was a queen named Ambapālī in the palace of the king of cooked rice.",
        "source": "T03n0191_002:0937c08_36"
    },
    {
        "source_sentence": "甘露飯王有女，名細嚩羅。",
        "translation": "The king of the ambrosial rice had a daughter named Śubhavyūha.",
        "source": "T03n0191_002:0937c09_37"
    },
    {
        "source_sentence": "悉達多有子，名羅怙羅，此之佛子，是過去眾許王種族，今值佛世隨佛出家，",
        "translation": "Siddhârtha had a son named Rāhula, the son of the Buddha. This prince of the Buddha was from a royal family that had previously renounced the householder’s life and now lived in the buddha-world.",
        "source": "T03n0191_002:0937c09_38"
    },
    {
        "source_sentence": "了悟生死善斷輪迴，契證真空而成聖位。」",
        "translation": "Understanding birth and death well ends the cycle of transmigration, he realizes the emptiness and becomes a sage.",
        "source": "T03n0191_002:0937c11_39"
    },
    {
        "source_sentence": "爾時大目犍連說是語已，即從座起合掌向佛。",
        "translation": "After he spoke these words, Mahāmaudgalyāyana rose from his seat and joined his palms to face the Buddha.",
        "source": "T03n0191_002:0937c13_0"
    },
    {
        "source_sentence": "佛言：「汝復本座。",
        "translation": "The Buddha said, Return to your seat.",
        "source": "T03n0191_002:0937c14_1"
    },
    {
        "source_sentence": "善哉，善哉！",
        "translation": "Excellent, excellent!",
        "source": "T03n0191_002:0937c14_2"
    },
    {
        "source_sentence": "汝能為諸苾芻說於釋種過去所生種姓之事，令諸苾芻快得善利，長夜安隱。」",
        "translation": "You can tell the monks about the castes that were born in the past of the Śākyas for the sake of the monks, so that they'll quickly attain good benefits and be peaceful for a long time.",
        "source": "T03n0191_002:0937c14_3"
    },
    {
        "source_sentence": "時諸釋眾皆大歡喜，信受奉行。",
        "translation": "The Śākyamunis then all rejoiced greatly and believed it, accepted it, and carried it out.",
        "source": "T03n0191_002:0937c16_4"
    },
    {
        "source_sentence": "爾時迦毘羅國主星賀賀努王，具大福德資財無量，人民熾盛國土豐實。",
        "translation": "At the time, the king of Kapilavastu, the star lord of Kapilavastu, was endowed with great merit and immeasurable wealth, his people prospered, and his land was abundant.",
        "source": "T03n0191_002:0937c18_0"
    },
    {
        "source_sentence": "去此不遠有一國土，名曰天指城，有王名酥鉢囉沒馱，其國大富，金銀珍寶，",
        "translation": "Not far from here there is a land called Devānām-Indra (“citation of the divine finger”), where there is a king named Suprabuddha. This country is very wealthy, rich in gold, silver, and precious treasures.",
        "source": "T03n0191_002:0937c19_1"
    },
    {
        "source_sentence": "處處盈滿；",
        "translation": "Everywhere it filled everywhere.",
        "source": "T03n0191_002:0937c21_2"
    },
    {
        "source_sentence": "彼王有妃名龍弭禰，身色端嚴諸相具足。",
        "translation": "That king had a queen named Nāgârjuna, whose body and form were dignified and endowed with all characteristics.",
        "source": "T03n0191_002:0937c21_3"
    },
    {
        "source_sentence": "於其國內有一長者，宿植善本福德純厚，眷屬熾盛庫藏眾多，如毘沙門天王。",
        "translation": "In that country, there was an elderly man who had planted roots of goodness in the past and cultivated pure virtue, with a large treasury of followers like Vaiśravaṇa.",
        "source": "T03n0191_002:0937c22_4"
    },
    {
        "source_sentence": "爾時長者有一園苑，眾卉名花，流泉浴池，亭臺樓閣，異獸靈禽無不具足。",
        "translation": "It was then that the wealthy man had a garden with many famous flowers and flowing fountains, bathing ponds, pavilions, towers, and towers, as well as rare animals and spirits and birds.",
        "source": "T03n0191_002:0937c25_0"
    },
    {
        "source_sentence": "時酥鉢囉沒馱王，與其妃后及諸眷屬，來於此園作樂遊戲。",
        "translation": "At the time, King Prabhūtaratna and his queen and their retinues came to this park to make a pleasant play.",
        "source": "T03n0191_002:0937c26_1"
    },
    {
        "source_sentence": "時彼妃后見此園林種種華煥心生愛樂，即告於王：「我要此園恒以遊戲。」",
        "translation": "When that queen saw the various flowers in this garden and forest, she became delighted and told the king, I want this garden to always be a place to play.",
        "source": "T03n0191_002:0937c28_2"
    },
    {
        "source_sentence": "王白妃言：「惟此園林長者所有，云何能得？",
        "translation": "The king said to the queen, How could you get it if this garden belonged to an elder?",
        "source": "T03n0191_002:0937c29_3"
    },
    {
        "source_sentence": "我為國王當自刱造。」",
        "translation": "I will build it for the king of my country.",
        "source": "T03n0191_002:0938a01_4"
    },
    {
        "source_sentence": "即命國人，大興園苑，泉池臺觀，勝絕第一，名龍弭禰園。",
        "translation": "He then ordered the people of his country to build a large park, with fountains, ponds, terraces, and pavilions surpassing all others in beauty. The name was Nāgârjuna’s Park.",
        "source": "T03n0191_002:0938a02_5"
    },
    {
        "source_sentence": "爾時酥鉢囉沒馱王長夜思惟：「我今云何得生一子為金輪王？」",
        "translation": "It was then that King Prabhūtaratna thought for a long time, How could I now give birth to a son who's the king of the golden wheel?",
        "source": "T03n0191_002:0938a03_6"
    },
    {
        "source_sentence": "如是思念，忽於後時妃乃有娠，懷妊九月誕生一女，顏貌端正，諸相具足，",
        "translation": "Soon afterward the queen became pregnant and gave birth to a daughter in the ninth month of her pregnancy. She was endowed with good appearance and had all the marks [of a woman].",
        "source": "T03n0191_002:0938a04_7"
    },
    {
        "source_sentence": "福德智慧，於其世間最為殊勝。",
        "translation": "Their merit and wisdom are the most distinguished in the world.",
        "source": "T03n0191_002:0938a06_8"
    },
    {
        "source_sentence": "如是眾人覩斯福相俱言：「希有！",
        "translation": "Thus, the people saw this mark of merit and said, Rarely!",
        "source": "T03n0191_002:0938a07_9"
    },
    {
        "source_sentence": "應是毘首羯摩天所作，或是幻化所成。」",
        "translation": "It should be made by the Vaiśravaṇa gods, or it's made by illusory transformation.",
        "source": "T03n0191_002:0938a07_10"
    },
    {
        "source_sentence": "女生之後，一日、二日至三七日，王為此女集諸戚里及群臣等，慶賀作樂，",
        "translation": "On the first day, on the second day, and on the third or seventh day after the birth of the queen, the king gathered his relatives and ministers together to congratulate her and made music for her.",
        "source": "T03n0191_002:0938a08_11"
    },
    {
        "source_sentence": "即為立名，名為摩耶。",
        "translation": "That is, in order to establish a name, it's calledmaya.",
        "source": "T03n0191_002:0938a10_12"
    },
    {
        "source_sentence": "其女身相而有八乳，相師占曰：「此女後時當生貴子，紹灌頂王位。」",
        "translation": "The woman's bodily features had eight breasts, and the soothsayer said, At some point later, this woman will give birth to a noble child who will assume the position of king of consecration.",
        "source": "T03n0191_002:0938a10_13"
    },
    {
        "source_sentence": "又於後時復生一女，端嚴福相最為其上，初生之時有大光明，遍照國城祥瑞非常，",
        "translation": "At a later time another daughter was born, the best in beauty and virtue. When she was first born there was a great ray of light that shone brightly all over the kingdom’s city; its auspicious signs and omens were extraordinary.",
        "source": "T03n0191_002:0938a12_14"
    },
    {
        "source_sentence": "因慶賀日即為立名，名摩賀摩耶。",
        "translation": "On the day of his birthday, he established a name for him, which was called Mahāmamaya.",
        "source": "T03n0191_002:0938a14_15"
    },
    {
        "source_sentence": "相師占曰：「此女生男具三十二相，為金輪王。」",
        "translation": "The fortune teller said, This woman has the thirty-two marks of a man and is the king of the golden wheel.",
        "source": "T03n0191_002:0938a14_16"
    },
    {
        "source_sentence": "爾時酥鉢囉沒馱王，聞彼星賀賀努王太子具有賢德，即遣使人告彼國王：「我有二女：一名摩耶；",
        "translation": "It was then that the king of Kapilavastu, having heard that prince named Ānanda had virtue, dispatched an envoy to the king of that country, saying: “I have two daughters.",
        "source": "T03n0191_002:0938a16_0"
    },
    {
        "source_sentence": "二名摩賀摩耶。",
        "translation": "The second is called mahāma-maya.",
        "source": "T03n0191_002:0938a18_1"
    },
    {
        "source_sentence": "初生之時相師占言：『此之二女若後生子，具三十二相為金輪王。』」",
        "translation": "When they were first born, the soothsayer divined them, saying, 'If these two women give birth to a child later, he'll have the thirty-two marks as the king of the golden wheel.'",
        "source": "T03n0191_002:0938a18_2"
    },
    {
        "source_sentence": "星賀賀努王聞已，告淨飯太子曰：「酥鉢囉沒駄王欲娉二女與汝為妻，",
        "translation": "On hearing this, the celestial king Śubhavyūha said to Prince Jīvaka, “King Prabhūtaratna wishes to marry these two daughters to you.",
        "source": "T03n0191_002:0938a20_3"
    },
    {
        "source_sentence": "若後生子必作輪王。」",
        "translation": "If a child is born later, he'll surely become a wheel-turning king.",
        "source": "T03n0191_002:0938a21_4"
    },
    {
        "source_sentence": "即遣釋種五百人等往彼迎女。",
        "translation": "He then sent five hundred members of the Śākya clan to that place to meet the woman.",
        "source": "T03n0191_002:0938a22_5"
    },
    {
        "source_sentence": "爾時邊國別有一族，名半拏嚩，率領兵眾於其要路欲行劫奪。",
        "translation": "At the time, there was a separate tribe of people named Pūrvavideha who led an army and wanted to plunder the essential path.",
        "source": "T03n0191_002:0938a22_6"
    },
    {
        "source_sentence": "釋眾知已慮遭患害，具述上事請王同行。",
        "translation": "Knowing that they were worried about suffering, the Śākyamunis described the above matter and invited the king to accompany them.",
        "source": "T03n0191_002:0938a24_7"
    },
    {
        "source_sentence": "王即白言：「我今年老厭於戎事，令子淨飯躬自討伐，如獲勝捷當自立願。」",
        "translation": "The king then said, This year, I'm old and disillusioned with military affairs, so I'll cause my son Jīvaka to personally subdue them; if he attains victory, he'll make his own vow.",
        "source": "T03n0191_002:0938a25_8"
    },
    {
        "source_sentence": "爾時星賀賀努王，選練四兵，付釋種等與子淨飯，同殺惡族迎女迴歸。",
        "translation": "It was then that the star king Hānau selected four troops, entrusted them to the Śākyas and so forth, gave their children pure rice, killed all the bad tribes together, and welcomed the women back home.",
        "source": "T03n0191_002:0938a27_0"
    },
    {
        "source_sentence": "即白王言：「王先所宣令別立願，其義云何？」",
        "translation": "He said to the king, What's the meaning of the vow that was previously proclaimed by the king as a separate vow?",
        "source": "T03n0191_002:0938a28_1"
    },
    {
        "source_sentence": "王即告言：「汝於今者當納一女以為己妻，如後有子，善加保護令嗣國位。」",
        "translation": "The king then told them, Now, you must take a woman to be your wife, just as if there were a child later who was well-protected and made to succeed to the throne.",
        "source": "T03n0191_002:0938a29_2"
    },
    {
        "source_sentence": "及王歿後，其大臣等共立淨飯太子即紹王位。",
        "translation": "After the king's demise, those ministers and others jointly established Prince Jīvaka as Shaowang.",
        "source": "T03n0191_002:0938b02_3"
    },
    {
        "source_sentence": "時王國界人民豐盛，王與夫人及諸宮嬪恒受快樂。",
        "translation": "At the time, the king's kingdom was prosperous and his people were abundant, and the king, his wife, and the palace officials always enjoyed happiness.",
        "source": "T03n0191_002:0938b03_4"
    },
    {
        "source_sentence": "時釋迦菩薩在兜率天宮，欲生人間，作五種觀察：一、觀種姓。",
        "translation": "When the Śākya Bodhisattva was in the palace of Tuṣita Heaven and wanted to be born among humans, he made five kinds of observations: 1. Observing castes.",
        "source": "T03n0191_002:0938b04_5"
    },
    {
        "source_sentence": "菩薩思惟：「若婆羅門、吠舍、首陀，種姓非上非我所生；",
        "translation": "The enlightening beings think: “Suppose there are brāhmaṇas, vaiśyas, and śūdras whose caste is neither higher nor lower than me.",
        "source": "T03n0191_002:0938b05_6"
    },
    {
        "source_sentence": "若剎帝利我即當生，以彼時人重富貴故；",
        "translation": "If the kṣatriya I am about to be born, it will be because the people of that time are so wealthy.",
        "source": "T03n0191_002:0938b06_7"
    },
    {
        "source_sentence": "若生下姓人所不重，今為攝化眾生令彼歸依，是故當生剎帝利家。」",
        "translation": "If he's born in a lower caste and isn't valued by people, now that he's collecting sentient beings and causing them to rely on him, he'll be born in the house of the kṣatriyas.",
        "source": "T03n0191_002:0938b07_8"
    },
    {
        "source_sentence": "二、觀國土。",
        "translation": "2. observing the land.",
        "source": "T03n0191_002:0938b09_9"
    },
    {
        "source_sentence": "若其國土最上殊勝，有上味甘蔗，香美稻米，肥力大牛，無諸貧乞及鬪諍事，",
        "translation": "If their land is the highest and most distinguished, with exquisitely flavored sweet sugarcane, fragrant rice and rice, fat and strong big cattle, there are no poor beggars or quarrels.",
        "source": "T03n0191_002:0938b09_10"
    },
    {
        "source_sentence": "如是國土，名為中國，我即往生；",
        "translation": "Such a land as this is called China, where I am reborn.",
        "source": "T03n0191_002:0938b11_11"
    },
    {
        "source_sentence": "恐彼有情而興毀言，菩薩過去修大勝因，云何於今却生邊地。",
        "translation": "I'm afraid those sentient beings will criticize me, saying that the bodhisattva cultivated great superior causes in the past, so how could he be born in a marginal land now?",
        "source": "T03n0191_002:0938b12_12"
    },
    {
        "source_sentence": "三、觀時分。",
        "translation": "3. the time period of contemplation...",
        "source": "T03n0191_002:0938b13_13"
    },
    {
        "source_sentence": "若有增劫八萬歲時，有情根鈍，智慧愚劣，非為法器，是故不生；",
        "translation": "At the time of the Incremental cosmic age, when it is eighty thousand years in duration, sentient beings with weak faculties and ignorant wisdom are not endowed with the Dharma vessel; that is why they do not arise.",
        "source": "T03n0191_002:0938b13_14"
    },
    {
        "source_sentence": "若於減劫百歲之時，雖近五濁，彼時眾生，根性猛利，機器成熟，是故菩薩即乃下生。",
        "translation": "If someone approaches the five turbidities at the time of a decreasing eon, even though they're about to be born, those sentient beings have strong faculties and natures, and their abilities are mature; therefore, the bodhi",
        "source": "T03n0191_002:0938b15_15"
    },
    {
        "source_sentence": "四、觀上族。",
        "translation": "4. observing the superior clans.",
        "source": "T03n0191_002:0938b17_0"
    },
    {
        "source_sentence": "若淨飯王自過去世成劫之初，眾許王後子孫相繼，至淨飯王俱是輪王之族，",
        "translation": "If King Śuddhodana had been a universal monarch since the beginning of the cosmic age at the beginning of the past, his descendants would have passed from one king to another. Up to King Śuddhodana all belonged to the cakravartin family.",
        "source": "T03n0191_002:0938b17_1"
    },
    {
        "source_sentence": "是故菩薩即往受生。",
        "translation": "Therefore, the bodhisattva then goes to be born.",
        "source": "T03n0191_002:0938b19_0"
    },
    {
        "source_sentence": "五、觀母身。",
        "translation": "5. Observing the mother's body.",
        "source": "T03n0191_002:0938b19_1"
    },
    {
        "source_sentence": "若是女人智慧甚深，福德無量，諸相端嚴，持戒清潔，過去諸佛同與受記，",
        "translation": "Such a woman’s knowledge and wisdom are profound, her virtue immeasurable, her features dignified, she keeps the precepts pure. All the buddhas of the past gave her this assurance to her.",
        "source": "T03n0191_002:0938b19_2"
    },
    {
        "source_sentence": "我即受生；",
        "translation": "The self is that which receives birth.",
        "source": "T03n0191_002:0938b21_3"
    },
    {
        "source_sentence": "今見摩耶具上功德，復是王種，即乃生彼。",
        "translation": "Now, seeing that Māya is endowed with the highest virtue, he's again of the king's family, and he's born there.",
        "source": "T03n0191_002:0938b21_4"
    },
    {
        "source_sentence": "爾時菩薩作是觀已，復告六欲天子：「汝今諦聽！",
        "translation": "After observing this, the bodhisattva then again addressed the gods of the six desire heavens, Listen closely!",
        "source": "T03n0191_002:0938b22_5"
    },
    {
        "source_sentence": "我當下生南贍部洲託質摩耶，汝等為我降甘露雨令我受樂。」",
        "translation": "I'll descend to the southern Jambudvīpa and entrust it to Jīvakamaya, and you will send down an ambrosia rain for me so that I can experience happiness.",
        "source": "T03n0191_002:0938b23_6"
    },
    {
        "source_sentence": "天子告言：「南瞻部洲有六大惡人：一、老迦葉；",
        "translation": "The celestial beings told them, “In the southern continent of Jambudvipa there are six great evil people:",
        "source": "T03n0191_002:0938b25_7"
    },
    {
        "source_sentence": "二、摩娑迦梨虞婆子；",
        "translation": "The second was Māṣākālīputra.",
        "source": "T03n0191_002:0938b26_8"
    },
    {
        "source_sentence": "三、娑惹野尾囉致子；",
        "translation": "3. the son of Sājayano-varacika.",
        "source": "T03n0191_002:0938b26_9"
    },
    {
        "source_sentence": "四、阿[口*爾]多繼捨迦摩羅；",
        "translation": "The fourth was the practice of relinquishing the royal precepts for a long time to come.",
        "source": "T03n0191_002:0938b27_10"
    },
    {
        "source_sentence": "五、迦[底*也](切身)野；",
        "translation": "The fifth is the wilderness of khaṭi (cut-body).",
        "source": "T03n0191_002:0938b27_11"
    },
    {
        "source_sentence": "六、儞誐囉[(倪-臼+白)*也](切身)帝子。",
        "translation": "6. Śāriputra [(ni - mou + white)*ya] (cut his body), the emperor.",
        "source": "T03n0191_002:0938b27_12"
    },
    {
        "source_sentence": "南贍部洲復有六裸形外道：一、俱吒多努婆羅門；",
        "translation": "In the southern Jambudvipa there were also six heretics of naked form:",
        "source": "T03n0191_002:0938b28_13"
    },
    {
        "source_sentence": "二、酥嚕拏多拏婆羅門；",
        "translation": "The second were the brāhmaṇas known ashurumaṇḍa.",
        "source": "T03n0191_002:0938b29_14"
    },
    {
        "source_sentence": "三、摩儗婆羅門；",
        "translation": "The third was the brāhmaṇa Mātṛkā.",
        "source": "T03n0191_002:0938c01_0"
    },
    {
        "source_sentence": "四、梵受婆羅門；",
        "translation": "The fourth was the brahma priest Brahmā.",
        "source": "T03n0191_002:0938c01_1"
    },
    {
        "source_sentence": "五、布娑迦囉婆羅門；",
        "translation": "The fifth was the brahman Puṣkarasārin.",
        "source": "T03n0191_002:0938c01_2"
    },
    {
        "source_sentence": "六、路呬[底*也](切身)婆羅門。",
        "translation": "6. the Brāhmaṇa Lumbinī [ti*ya] (cut his body)",
        "source": "T03n0191_002:0938c02_3"
    },
    {
        "source_sentence": "南贍部洲復有六大力士：一、烏捺囉矩囉摩子；",
        "translation": "In the southern Jambudvipa there were also six great men of great power:",
        "source": "T03n0191_002:0938c02_4"
    },
    {
        "source_sentence": "二、阿囉拏；",
        "translation": "The second is arhatship.",
        "source": "T03n0191_002:0938c03_5"
    },
    {
        "source_sentence": "三、迦類摩；",
        "translation": "The third is the cakravartin-maṇḍala.",
        "source": "T03n0191_002:0938c03_6"
    },
    {
        "source_sentence": "四、酥跋捺囉；",
        "translation": "The fourth is the ghee-vardhana.",
        "source": "T03n0191_002:0938c04_7"
    },
    {
        "source_sentence": "五、波里沒囉惹迦；",
        "translation": "The fifth is the prātimokṣatra.",
        "source": "T03n0191_002:0938c04_8"
    },
    {
        "source_sentence": "六、散耶摩拏縛迦。",
        "translation": "6. Saṃya-mātṛkā.",
        "source": "T03n0191_002:0938c04_9"
    },
    {
        "source_sentence": "如是一十八種，難可調伏。」",
        "translation": "Such are the 18 kinds that are difficult to subdue.",
        "source": "T03n0191_002:0938c05_10"
    },
    {
        "source_sentence": "爾時人間有一仙人，年已衰老，名烏盧尾羅迦葉。",
        "translation": "At the time, there was a sage in the world named Uruvilākāśyapa, who was old and decrepit.",
        "source": "T03n0191_002:0938c05_11"
    },
    {
        "source_sentence": "思惟言曰：「當此國土福勝之地可十二由旬，於其中間堪為菩薩安坐說法之處，",
        "translation": "He thought to himself, “This land of blessedness is located at a distance of twelve yojanas in the direction where the bodhisattva may sit and teach the Dharma.",
        "source": "T03n0191_002:0938c07_12"
    },
    {
        "source_sentence": "願得菩薩速降人間，為我說法令我長夜甚得善利。」",
        "translation": "May you attain the bodhisattva's speedy descent into the human world and explain it to me so that I can obtain a great deal of good benefits for a long time.",
        "source": "T03n0191_002:0938c08_13"
    },
    {
        "source_sentence": "爾時菩薩告兜率天子：「汝今為我動一切樂。」",
        "translation": "It was then that the bodhisattva addressed the Tuṣita gods, Now, move all your happiness for me.",
        "source": "T03n0191_002:0938c11_0"
    },
    {
        "source_sentence": "諸天聞已競奏音樂。",
        "translation": "The gods heard it and competed to play the music.",
        "source": "T03n0191_002:0938c12_0"
    },
    {
        "source_sentence": "爾時菩薩吹大法螺，其聲高遠過於天樂一切音韻，如是南贍部洲一十八種難調有情，",
        "translation": "It was then that the enlightening beings blew the great conch of teaching, its sound far higher than that of celestial music and all the tones. Thus did the eighteen kinds of unruly sentient beings in Jambudvīpa",
        "source": "T03n0191_002:0938c12_1"
    },
    {
        "source_sentence": "菩薩以無礙辯振大法音，令彼有情自然降伏，亦復如是。",
        "translation": "Similarly, when a bodhisattva uses unhindered eloquence to revitalize the great voice of the Dharma and cause those sentient beings to naturally subdue it.",
        "source": "T03n0191_002:0938c14_2"
    },
    {
        "source_sentence": "「師子一吼眾獸伏，　　金剛一杵群峯碎；",
        "translation": "“A lion’s roar subdues all the animals, And a diamond pounder crushes the mountain peaks.",
        "source": "T03n0191_002:0938c15_3"
    },
    {
        "source_sentence": "　修羅無數一輪降，　　世間黑暗一日破。」",
        "translation": "The asura descends in an incalculably long wheel, and the world is destroyed by darkness for one day.",
        "source": "T03n0191_002:0938c15_3"
    },
    {
        "source_sentence": "而說偈言：爾時六欲天子及天帝釋，觀見菩薩乘六牙白象，下兜率天處摩耶腹，",
        "translation": "Then the gods of the six heavens of the realm of desire and Indra saw the Bodhisattva riding on a white elephant with six tusks, descending from the Tuṣita Heaven into the womb of Māra.",
        "source": "T03n0191_002:0938c15_3"
    },
    {
        "source_sentence": "「我觀天子下閻浮，　　甘蔗王宮而受生；",
        "translation": "“I see the celestial being born in Jambudvfpa, In the palace of a sugarcane king.",
        "source": "T03n0191_002:0938c20_4"
    },
    {
        "source_sentence": "　為利有情酬宿願，　　如日初出放光明。」",
        "translation": "In order to repay the past vows for the benefit of sentient beings, it's like when the sun first rises and emits light.",
        "source": "T03n0191_002:0938c20_4"
    },
    {
        "source_sentence": "即降甘露守護母腹清淨安隱，而說偈曰：佛說眾許摩訶帝經卷第二",
        "translation": "\\",
        "source": "T03n0191_002:0938c20_4"
    }
]