[
    {
        "source_sentence": "大方便佛報恩經卷第三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3",
        "source": "T03n0156_003:0136b13_0"
    },
    {
        "source_sentence": "失譯人名在後漢錄",
        "translation": "The lost translator's name appears in the Later Han Register",
        "source": "T03n0156_003:0136b15_0"
    },
    {
        "source_sentence": "論議品第五",
        "translation": "The Fifth Chapter of the Treatise",
        "source": "T03n0156_003:0136b16_0"
    },
    {
        "source_sentence": "爾時如來為母摩耶夫人并諸天眾說法九十日，閻浮提中亦九十日不知如來所在。",
        "translation": "It was then that the Tathāgata preached the Dharma for Mrs. Māyā and the gods for ninety days, and he didn't know where the Tathāgata was in Jambudvīpa for ninety days.",
        "source": "T03n0156_003:0136b17_0"
    },
    {
        "source_sentence": "大目揵連神力第一，盡其神力，於十方推求，亦復不知；",
        "translation": "Mahāmaudgalyāyana was the foremost in command of all his supernormal powers, and he did not know how to exhaust his supernormal powers.",
        "source": "T03n0156_003:0136b19_0"
    },
    {
        "source_sentence": "阿那律陀天眼第一，遍觀十方三千大千世界，亦復不見；",
        "translation": "The divine eye of Anuruddha was first, observing the 3,000 great one-thousand worlds in the ten directions; he also did not see them.",
        "source": "T03n0156_003:0136b20_1"
    },
    {
        "source_sentence": "乃至五百大弟子，不見如來，心懷憂惱。",
        "translation": "Even the five hundred great disciples did not see the Tathāgata and felt grief in their hearts.",
        "source": "T03n0156_003:0136b21_2"
    },
    {
        "source_sentence": "優填大王戀慕如來，心懷愁毒，即以牛頭栴檀，摽像如來所有色身，禮事供養，",
        "translation": "The great king Udayana, yearning for the Tathāgata, was grieved and distressed. He offered a sandalwood image of the Tathāgata’s form body made of oxhead sandalwood to the Buddha in order to pay homage to him",
        "source": "T03n0156_003:0136b22_3"
    },
    {
        "source_sentence": "如佛在時，無有異也。",
        "translation": "Just as when the Buddha was present, there was no difference.",
        "source": "T03n0156_003:0136b24_4"
    },
    {
        "source_sentence": "爾時大王召諸六師，卜問如來為何所在。",
        "translation": "It was then that the great king summoned the six masters and asked the Tathāgata where he was.",
        "source": "T03n0156_003:0136b25_0"
    },
    {
        "source_sentence": "爾時六師即作是言：「大王！",
        "translation": "It was then that the six masters said, Great king!",
        "source": "T03n0156_003:0136b25_1"
    },
    {
        "source_sentence": "當知瞿曇沙門正是幻術所化作耳。",
        "translation": "You should know that the Gautama ascetic is precisely what he creates by illusory magic.",
        "source": "T03n0156_003:0136b26_2"
    },
    {
        "source_sentence": "幻化之法，體無真實。",
        "translation": "The dharmas of illusory transformation have no reality in their essence.",
        "source": "T03n0156_003:0136b27_3"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0156_003:0136b27_4"
    },
    {
        "source_sentence": "當知我等經書四圍陀典說言：『千年二千年當有一幻人出世。』",
        "translation": "You should know that our sūtras and scriptures say, 'Two thousand years from now, there will be an illusory person who appears in the world.'",
        "source": "T03n0156_003:0136b27_5"
    },
    {
        "source_sentence": "瞿曇沙門正是其人。」",
        "translation": "That's the person of the Gautama ascetic.",
        "source": "T03n0156_003:0136b29_6"
    },
    {
        "source_sentence": "爾時，阿那律陀往詣大王所，白言：「大王！",
        "translation": "At that point, Anuruddha went to the great king and said, Great king!",
        "source": "T03n0156_003:0136c01_0"
    },
    {
        "source_sentence": "當知如來近在忉利天，却後七日當還閻浮提。」",
        "translation": "You should know that the Tathāgata is near the Trāyastriṃśa gods and will return to Jambudvīpa seven days after he leaves them.",
        "source": "T03n0156_003:0136c01_1"
    },
    {
        "source_sentence": "王聞是語，心生歡喜，宣令國土，掃灑燒香，懸繒幡蓋競共集聚，設眾供養種種餚饍、華香、伎樂。",
        "translation": "When the king heard these words he was overjoyed and ordered his land to sweep, sprinkle, burn incense, hang silk banners and canopies, and gather together to offer various foods, garlands, flowers, incense, and",
        "source": "T03n0156_003:0136c02_2"
    },
    {
        "source_sentence": "爾時六師見眾人集聚，設諸供養，種種餚饍。",
        "translation": "At the time, the six masters saw the crowd gathered together to make offerings and various dishes of food.",
        "source": "T03n0156_003:0136c06_0"
    },
    {
        "source_sentence": "六師問言：「汝等諸人設是供養，欲請國王耶？",
        "translation": "The six teachers asked, Do you people set up this offering and want to invite the king?",
        "source": "T03n0156_003:0136c07_0"
    },
    {
        "source_sentence": "王子耶？」",
        "translation": "Is a prince?",
        "source": "T03n0156_003:0136c08_1"
    },
    {
        "source_sentence": "答言：「非也。」",
        "translation": "He replied, No, it's not.",
        "source": "T03n0156_003:0136c08_2"
    },
    {
        "source_sentence": "「若不爾者，為請大臣耶？",
        "translation": "If that's not the case, is it an invitation to the minister?",
        "source": "T03n0156_003:0136c08_3"
    },
    {
        "source_sentence": "婆羅門居士耶？",
        "translation": "Is a Brāhmaṇa householder?",
        "source": "T03n0156_003:0136c09_4"
    },
    {
        "source_sentence": "若不爾者，親族會耶？」",
        "translation": "If you don't, will your relatives assemble?",
        "source": "T03n0156_003:0136c09_5"
    },
    {
        "source_sentence": "答言：「非也。",
        "translation": "He replied, No.",
        "source": "T03n0156_003:0136c10_6"
    },
    {
        "source_sentence": "欲請於佛。」",
        "translation": "I want to invite the Buddha.",
        "source": "T03n0156_003:0136c10_7"
    },
    {
        "source_sentence": "六師問言：「佛者是誰？」",
        "translation": "The six masters asked, Who is the Buddha?",
        "source": "T03n0156_003:0136c10_8"
    },
    {
        "source_sentence": "答言：「一切智人。」",
        "translation": "He replied, All wise people.",
        "source": "T03n0156_003:0136c11_9"
    },
    {
        "source_sentence": "復言：「一切智人為是誰？」",
        "translation": "Again, he said, Who is this person of omniscience?",
        "source": "T03n0156_003:0136c11_10"
    },
    {
        "source_sentence": "答言：「大慈悲父。",
        "translation": "He replied, Great compassionate father!",
        "source": "T03n0156_003:0136c12_11"
    },
    {
        "source_sentence": "汝不知耶？",
        "translation": "Don't you know?",
        "source": "T03n0156_003:0136c12_12"
    },
    {
        "source_sentence": "白淨王種，豪尊第一，從劫初已來，嫡嫡相承，作轉輪王。",
        "translation": "The white royal family was the first among the most powerful and noble, and from the beginning of the present eon their ancestors had inherited each other as universal monarchs.",
        "source": "T03n0156_003:0136c12_13"
    },
    {
        "source_sentence": "近來二世不作轉輪王，雖不作轉輪王，而作閻浮提王。",
        "translation": "In the last two worlds, he didn't become a wheel-turning king, and although he didn't become a wheel-turning king, he became the king of Jambudvīpa.",
        "source": "T03n0156_003:0136c14_14"
    },
    {
        "source_sentence": "兄弟三人，其最長者號曰淨飯王；",
        "translation": "The eldest of the three brothers was named King Śuddhodana.",
        "source": "T03n0156_003:0136c15_15"
    },
    {
        "source_sentence": "其次弟名曰斛飯王；",
        "translation": "The next younger brother was named King Kudhrakūṭa.",
        "source": "T03n0156_003:0136c16_16"
    },
    {
        "source_sentence": "其最小者名曰甘露飯王。",
        "translation": "The smallest of these is called the king of ambrosia rice.",
        "source": "T03n0156_003:0136c16_17"
    },
    {
        "source_sentence": "淨飯王生二子，長者名悉達，小者名難陀。",
        "translation": "King Śuddhodana gave birth to two sons, the elder named Siddhârtha and the younger named Nanda.",
        "source": "T03n0156_003:0136c17_18"
    },
    {
        "source_sentence": "斛飯王復生二子，長者名提婆達，小者名阿難。",
        "translation": "Again, King Mucilinda gave birth to two sons, the elder named Devadatta and the younger Ānanda.",
        "source": "T03n0156_003:0136c18_19"
    },
    {
        "source_sentence": "甘露飯王生一女，名甘露味女。",
        "translation": "The king of the ambrosia rice gave birth to a daughter named Ambrosia flavored Woman.",
        "source": "T03n0156_003:0136c19_20"
    },
    {
        "source_sentence": "爾時大兄悉達太子出城觀看，見老病死患，憂思不食。",
        "translation": "It was then that the elder brother, Prince Siddhārtha, leaving the city to look around, saw old age, illness, death, and sorrow and thought of not eating.",
        "source": "T03n0156_003:0136c20_21"
    },
    {
        "source_sentence": "悲念人生當有此患，無貴無賤，有形之類，無免此者。",
        "translation": "I am saddened to think that everyone will suffer from this kind of affliction, noble or humble, and there are formless people who can't escape it.",
        "source": "T03n0156_003:0136c21_22"
    },
    {
        "source_sentence": "即夜踰出宮城，菩提樹下苦行六年，然後得成一切智，故號一切智人。",
        "translation": "That night, he left the palace city and practiced under the bodhi tree for six years of austerities, and then he attained omniscience, which is why he's called the person of omniscience.",
        "source": "T03n0156_003:0136c22_23"
    },
    {
        "source_sentence": "獨悟成佛，具十力、四無所畏、十八不共法乃至一切種智。",
        "translation": "Being alone enlightened and become a buddha, he possesses the ten powers, four fearlessnesses, 18 unique qualities, and even all kinds of cognition.",
        "source": "T03n0156_003:0136c24_24"
    },
    {
        "source_sentence": "其生七日，母命便終，生忉利天。",
        "translation": "On the seventh day he was born, his mother’s life ended and he was reborn in Trāyastriṃśa Heaven.",
        "source": "T03n0156_003:0136c25_25"
    },
    {
        "source_sentence": "佛為母說法經九十日，却後一七當還閻浮提。」",
        "translation": "The Buddha taught the Dharma for his mother for ninety days, and one or seven of them will return to Jambudvīpa after that.",
        "source": "T03n0156_003:0136c26_26"
    },
    {
        "source_sentence": "爾時六師聞是語已，心生嫉妬，憂恚苦惱。",
        "translation": "After hearing these words, the six masters became jealous and grieved and suffered.",
        "source": "T03n0156_003:0136c27_27"
    },
    {
        "source_sentence": "即時六師徒眾集聚，共論議言：「瞿曇沙門若還閻浮提者，一切人民皆當捨我，",
        "translation": "The six teachers immediately assembled and discussed among themselves, saying: “If the renunciant Gotama returns to Jambudvfpa, all the people will abandon me.",
        "source": "T03n0156_003:0136c28_28"
    },
    {
        "source_sentence": "供養瞿曇。",
        "translation": "He made offerings to Gautama.",
        "source": "T03n0156_003:0137a01_29"
    },
    {
        "source_sentence": "我等孤窮，恐當不濟。」",
        "translation": "We're all orphaned and helpless, and I'm afraid we won't be able to help.",
        "source": "T03n0156_003:0137a01_30"
    },
    {
        "source_sentence": "爾時六師復作是念：「我等今當速往多人眾中，唱如是言：『諸人當知！",
        "translation": "It was then that the six masters again had this thought, Now, we'll quickly go to the large crowd of people and say, 'You should know!'",
        "source": "T03n0156_003:0137a02_0"
    },
    {
        "source_sentence": "瞿曇沙門實無所知。",
        "translation": "The Gautama monk really has no knowledge.",
        "source": "T03n0156_003:0137a03_1"
    },
    {
        "source_sentence": "黃口小兒，近出釋氏宮，菩提樹下自言得一切種智。",
        "translation": "A small boy with a yellow mouth came near the palace of the Śākya clan and said under the bodhi tree that he had attained omniscience.",
        "source": "T03n0156_003:0137a04_2"
    },
    {
        "source_sentence": "當知此則虛妄之言。",
        "translation": "You should know that this is a false statement.",
        "source": "T03n0156_003:0137a05_3"
    },
    {
        "source_sentence": "所以然者，阿耆達王來請瞿曇，所施供養唯是馬麥，瞿曇不知為惡而便受請，",
        "translation": "The reason for this is that King Ajita came to invite Gautama, and the offerings he offered were nothing but horse wheat. Not knowing evil, Gautama accepted the invitation.",
        "source": "T03n0156_003:0137a05_4"
    },
    {
        "source_sentence": "當知非一切智也。』",
        "translation": "You should know that it's not omniscience.'",
        "source": "T03n0156_003:0137a07_5"
    },
    {
        "source_sentence": "復次，問於阿難：『安居餘有幾日在？』",
        "translation": "Furthermore, he asked Ānanda, 'How many more days are the remaining days of your retreat?'",
        "source": "T03n0156_003:0137a08_6"
    },
    {
        "source_sentence": "阿難言：『餘有七日在。』",
        "translation": "Ānanda said, 'There are seven days left.'",
        "source": "T03n0156_003:0137a09_0"
    },
    {
        "source_sentence": "復次，問於阿難：『祇桓中何以多烏鳥聲？』",
        "translation": "Furthermore, he asked Ānanda, 'What's the sound of many crow-birds in Jīvaka?'",
        "source": "T03n0156_003:0137a09_1"
    },
    {
        "source_sentence": "阿難言：『眾鳥[口*爭]食。",
        "translation": "Ānanda said, 'The birds [mouth* fighting] eat.",
        "source": "T03n0156_003:0137a10_2"
    },
    {
        "source_sentence": "適生一七，其母命終。』",
        "translation": "When he was one or seven years old, his mother died.'",
        "source": "T03n0156_003:0137a10_3"
    },
    {
        "source_sentence": "以是事故，當知是薄相人，亦是極惡之人。",
        "translation": "Because of this, you should know that they're people with thin features and are also extremely bad people.",
        "source": "T03n0156_003:0137a11_4"
    },
    {
        "source_sentence": "所以然者，生已喪其母故。",
        "translation": "It's because his mother died after he was born.",
        "source": "T03n0156_003:0137a12_5"
    },
    {
        "source_sentence": "又復非慈孝、非供養，目下朝夜供給而反捐棄，入於深山。",
        "translation": "Again, it's neither compassionate nor an offering, so he makes offerings day and night under his eyes and returns to abandon them in the deep mountains.",
        "source": "T03n0156_003:0137a13_6"
    },
    {
        "source_sentence": "亦是無恩分人，父王為納娶瞿夷，竟不行婦人之禮，令憍曇彌受大苦惱。",
        "translation": "He's also a person who doesn't share kindness, and his father took Gopī for the king to accept him, so he doesn't perform the rituals of a woman that cause Gautama to experience great pain and suffering.",
        "source": "T03n0156_003:0137a14_7"
    },
    {
        "source_sentence": "是故當知不知恩不念恩。",
        "translation": "Therefore, you should know that they don't know kindness and don't think of kindness.",
        "source": "T03n0156_003:0137a16_8"
    },
    {
        "source_sentence": "瞿曇沙門，徒眾無尊卑，五百弟子各稱第一。",
        "translation": "The śramaṇa Gautama had five hundred disciples, each of whom was the best among all the śramaṇas.",
        "source": "T03n0156_003:0137a16_9"
    },
    {
        "source_sentence": "師既無法，弟子亦無修行之業。",
        "translation": "Since the teacher doesn't exist, the disciple also has no karma to cultivate.",
        "source": "T03n0156_003:0137a17_10"
    },
    {
        "source_sentence": "乃至知數其人陀驃比丘亦稱第一，聰明智慧舍利弗亦入其中，訥鈍槃特比丘亦入其中；",
        "translation": "Even the monk Dhāraṇī also praised him as the best. The wise and intelligent Śāriputra also entered into it, and so did the dull-witted Pāṇḍu entered into it.",
        "source": "T03n0156_003:0137a18_11"
    },
    {
        "source_sentence": "乃至少欲之人耶輸陀羅比丘尼亦入其中，舍衛城中婬亂不善蓮華色女亦入其中；",
        "translation": "Even the nun Yaśodharā bhikṣuṇī of few desires entered into it, and so did the wicked, unwholesome lotus-colored woman in Śrāvastī.",
        "source": "T03n0156_003:0137a20_12"
    },
    {
        "source_sentence": "乃至稚小無智均提小兒亦入其中，乃至極老須跋陀羅年百二十亦入其中；",
        "translation": "It also enters the bodies of all the tiny, ignorant children up to the middle-aged Cundalumbinī.",
        "source": "T03n0156_003:0137a22_13"
    },
    {
        "source_sentence": "乃至豪尊諸釋種亦入其中，極下賤王舍城中擔糞穢人亦入其中。",
        "translation": "Even the great and honored Śākyas also enter it, and even the most despicable people in the city of Rājagṛha who carry dung and dirt will enter it.",
        "source": "T03n0156_003:0137a24_14"
    },
    {
        "source_sentence": "是故，當知瞿曇法中，猥雜競共入中，皆無尊卑，不可恭敬。",
        "translation": "Therefore, you should know that among the teachings of the Gautama, there's no distinction between superior and inferior, and they can't be respected.",
        "source": "T03n0156_003:0137a26_15"
    },
    {
        "source_sentence": "譬如大風吹諸樹葉，聚在一處，瞿曇佛法亦復如是。",
        "translation": "Just as a great wind blows the leaves of trees and clusters them in one place, so it is with the Buddha’s teaching to the Gautama.",
        "source": "T03n0156_003:0137a27_16"
    },
    {
        "source_sentence": "譬如眾鳥隨逐世間人所遺棄衣服飲食，瞿曇徒眾隨取食之。",
        "translation": "It's like a multitude of birds following worldly people who abandon their clothing and food, and the Gautama crowd follows them to take it and eat it.",
        "source": "T03n0156_003:0137a28_17"
    },
    {
        "source_sentence": "汝等諸人，今日云何欲請瞿曇？」",
        "translation": "How do you people want to invite Gautama today?",
        "source": "T03n0156_003:0137b01_18"
    },
    {
        "source_sentence": "眾人聞已，譬如大地不可虧動。",
        "translation": "After the crowd heard this, it's like a great earth that can't be shaken.",
        "source": "T03n0156_003:0137b01_19"
    },
    {
        "source_sentence": "大眾渴仰如來，雖聞六師作如是說，心如金剛，無有增減，渴仰如來，",
        "translation": "The great assembly longed for the Tathāgata, and even though they had heard these words of the six teachers, their minds were like diamond, with no increase or decrease. They longed for the Tathāgata:",
        "source": "T03n0156_003:0137b02_20"
    },
    {
        "source_sentence": "如渴須飲。",
        "translation": "It's like a thirst that requires drinking.",
        "source": "T03n0156_003:0137b04_21"
    },
    {
        "source_sentence": "却後一七，如來從天來，下至閻浮提。",
        "translation": "One or seven years later, the Tathāgata came down from heaven and descended to Jambudvīpa.",
        "source": "T03n0156_003:0137b04_22"
    },
    {
        "source_sentence": "無量百千諸天隨從如來，放大光明；",
        "translation": "Countless hundreds of thousands of celestial beings followed the Buddha and emanated great rays of light.",
        "source": "T03n0156_003:0137b05_23"
    },
    {
        "source_sentence": "神力感動，作天伎樂百千萬種。",
        "translation": "He was moved by his supernatural powers, producing a hundred million kinds of heavenly music.",
        "source": "T03n0156_003:0137b06_24"
    },
    {
        "source_sentence": "乃至一切天，一切龍、鬼神、乾闥婆、緊那羅、摩睺羅伽、人、非人等，",
        "translation": "All gods, all dragons, ghosts, spirits, gandharvas, kinnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T03n0156_003:0137b06_25"
    },
    {
        "source_sentence": "一切大眾皆悉雲集，禮拜供養。",
        "translation": "All the monks and nuns gathered together in great numbers to venerate and make offerings.",
        "source": "T03n0156_003:0137b08_26"
    },
    {
        "source_sentence": "爾時優填大王大眾圍遶，遠迎如來，頭面禮足，却住一面。",
        "translation": "At that time the great king Udayana was surrounded by a great assembly, greeted the Buddha from afar, bowed his forehead at his feet, and withdrew to one side.",
        "source": "T03n0156_003:0137b08_27"
    },
    {
        "source_sentence": "爾時六師徒眾集聚，復作是念：「我等今者衰禍將至。",
        "translation": "It was then that the six teachers gathered together and again thought, Now we're about to go into trouble.",
        "source": "T03n0156_003:0137b11_0"
    },
    {
        "source_sentence": "雖復眾人之中唱說此言而不信受。",
        "translation": "Even though they may say these words among the people, they don't believe them.",
        "source": "T03n0156_003:0137b12_1"
    },
    {
        "source_sentence": "今當復往天人大眾之中，宣令如是，可知清白。」",
        "translation": "Now, I'll go back to the great assembly of gods and humans and proclaim it like this, so you can know it's pure and white.",
        "source": "T03n0156_003:0137b13_0"
    },
    {
        "source_sentence": "爾時六師作是念已，與其徒眾八千人俱，前後圍遶，往詣大眾，到已却坐一面。",
        "translation": "After the six masters had this thought, they were accompanied by 8,000 of their disciples, circled in front and behind them, went to the great assembly, withdrew, and sat to one side.",
        "source": "T03n0156_003:0137b14_1"
    },
    {
        "source_sentence": "爾時復有一乾闥婆子，名曰闥婆摩羅，彈七寶琴，往詣如來所，頭面禮足，",
        "translation": "At that time there was another gandharva boy named Ambamālī, who played the seven-jeweled lute. He approached the Tathāgata and bowed his forehead at his feet.",
        "source": "T03n0156_003:0137b16_0"
    },
    {
        "source_sentence": "却住一面，鼓樂絃歌出微妙音——其音和雅，悅可眾心。",
        "translation": "He withdrew and stood to one side. His drums played music, and his stringed instruments sang subtle sounds that were harmonious and pleasing to the minds of the people.",
        "source": "T03n0156_003:0137b17_1"
    },
    {
        "source_sentence": "聲聞辟支佛等，不覺動身起舞，須彌山王湧沒低昂。",
        "translation": "When śrāvakas and pratyekbuddhas don't feel movement, their bodies arise and dance, and Mount Sumeru the king of mountains springs up and goes down low.",
        "source": "T03n0156_003:0137b18_2"
    },
    {
        "source_sentence": "爾時如來即入有相三昧，以三昧力令其琴聲遠聞三千大千世界——其音具足演說苦、空、無常、不淨、無我。",
        "translation": "The Tathāgata then entered the samādhi of marklessness, and with the power of that samādhi, he caused his lute to sound far-reachingly throughout 3,000 great one-thousand worlds - its sound fully explaining suffering,",
        "source": "T03n0156_003:0137b21_0"
    },
    {
        "source_sentence": "放逸眾生聞此妙音具足演說如來知恩報恩，久於無量阿僧祇劫孝養父母。",
        "translation": "When careless sentient beings hear this wonderful sound and fully expound it, the Tathāgata knows kindness and repays kindness, and they've been filial to their parents for measureless incalculable eons.",
        "source": "T03n0156_003:0137b23_1"
    },
    {
        "source_sentence": "一切眾生皆隨聲至閻浮提，往到佛所，頭面禮足，却坐一面。",
        "translation": "All sentient beings came to Jambudvfpa in accordance with the sound, went to the Buddha, bowed their foreheads and feet, and withdrew to sit at one side.",
        "source": "T03n0156_003:0137b25_2"
    },
    {
        "source_sentence": "爾時大眾瞻仰如來，目不暫捨。",
        "translation": "It was then that the crowd looked up at the Tathāgata and didn't let go of his eyes for a moment.",
        "source": "T03n0156_003:0137b27_0"
    },
    {
        "source_sentence": "如來爾時三昧宴默，一切大眾亦皆默然。",
        "translation": "At the time, the Tathāgata was in samādhi and silent, and all the assembled people were also silent.",
        "source": "T03n0156_003:0137b27_1"
    },
    {
        "source_sentence": "於大眾中，有七寶塔從地踊出，住在空中，無數幢幡而懸其上，百千寶鈴不鼓自鳴，",
        "translation": "In the midst of the great assembly, a seven-jeweled stupa emerged from the earth and stood in midair above it with countless banners and pennants. Hundreds of thousands of myriads of jeweled bells sounded",
        "source": "T03n0156_003:0137b28_2"
    },
    {
        "source_sentence": "微風吹動，出微妙音。",
        "translation": "A gentle breeze blows and shakes, producing subtle sounds.",
        "source": "T03n0156_003:0137c01_3"
    },
    {
        "source_sentence": "爾時大眾見此寶塔從地踊出，心生疑網：「以何因緣，有此寶塔從地踊出？」",
        "translation": "Seeing this jeweled stūpa emerge from the ground, the crowd became suspicious and asked, What is the reason this jeweled stūpa emerges from the ground?",
        "source": "T03n0156_003:0137c03_0"
    },
    {
        "source_sentence": "諸聲聞眾舍利弗等，盡思度量，亦復不知。",
        "translation": "The śrāvakas, the Śāriputras, and so forth, did not even know the full extent of their deliberation.",
        "source": "T03n0156_003:0137c04_1"
    },
    {
        "source_sentence": "舊住娑婆世界菩薩摩訶薩，乃至彌勒菩薩亦復不知。",
        "translation": "The old bodhisattva Mahāsattva who lived in the sahā world and even Maitreya didn't know it.",
        "source": "T03n0156_003:0137c05_2"
    },
    {
        "source_sentence": "爾時六師作是念：「復何因緣，有此寶塔？",
        "translation": "It was then that the six masters had this thought, Again, for what reason did this jeweled stūpa exist?",
        "source": "T03n0156_003:0137c07_0"
    },
    {
        "source_sentence": "若有人來問我者，而我不知。",
        "translation": "If someone comes and asks me questions, but I don't know them.",
        "source": "T03n0156_003:0137c07_1"
    },
    {
        "source_sentence": "若不知者，云何復名一切知見？」",
        "translation": "If they don't know it, then how can they be called all knowing and seeing?",
        "source": "T03n0156_003:0137c08_2"
    },
    {
        "source_sentence": "復作是念：「瞿曇何不速為大眾敷演斯事？」",
        "translation": "Again, he thought, Why doesn't Gautama quickly explain these things for the masses?",
        "source": "T03n0156_003:0137c09_3"
    },
    {
        "source_sentence": "爾時如來出于三昧。",
        "translation": "It was then that the Tathāgata emerged from samādhi.",
        "source": "T03n0156_003:0137c11_0"
    },
    {
        "source_sentence": "釋提桓因、忉利天王即以天衣敷師子座。",
        "translation": "Śakra Devānām-Indra and the Trāyastriṃśa gods then spread out a lion's seat with heavenly robes.",
        "source": "T03n0156_003:0137c11_1"
    },
    {
        "source_sentence": "爾時如來即昇此座，結加趺坐，如須彌山王處于大海。",
        "translation": "The Tathāgata then ascended to this seat and sat cross-legged, like the king of Mount Sumeru facing the ocean.",
        "source": "T03n0156_003:0137c12_2"
    },
    {
        "source_sentence": "爾時彌勒菩薩觀察眾心，咸皆有疑，自亦未了。",
        "translation": "At the time, Maitreya observed the minds of the crowd, and they all had doubts, but he didn't understand them.",
        "source": "T03n0156_003:0137c14_0"
    },
    {
        "source_sentence": "即從座起，往到佛前，頭面禮足，合掌向佛，而作是言：「世尊！",
        "translation": "He rose from his seat, went to the Buddha, bowed his forehead at his feet, joined his palms in respect toward him, and said:",
        "source": "T03n0156_003:0137c15_1"
    },
    {
        "source_sentence": "以何因緣有此寶塔從地踊出？」",
        "translation": "What is the reason this jeweled stūpa emerged from the ground?",
        "source": "T03n0156_003:0137c16_2"
    },
    {
        "source_sentence": "佛告彌勒菩薩：「乃往過去不可思議阿僧祇劫有佛出世，號毗婆尸如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "The Buddha told Maitreya Bodhisattva: In an inconceivable, incalculable eon ago a buddha named Vipaśyin Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct,",
        "source": "T03n0156_003:0137c18_0"
    },
    {
        "source_sentence": "出現於世，教化無量百千萬億阿僧祇眾生，皆令堅固阿耨多羅三藐三菩提。",
        "translation": "They appear in the world and teach measureless hundreds of thousands of myriads of koṭis of incalculable sentient beings, all enabling them to firmly attain unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0156_003:0137c21_1"
    },
    {
        "source_sentence": "其佛滅後，於像法中，有國名波羅奈。",
        "translation": "After the parinirvāṇa of that buddha, there was a country named Vārāṇasī in the image Dharma.",
        "source": "T03n0156_003:0137c22_2"
    },
    {
        "source_sentence": "其波羅奈大王聰叡仁賢，常以正法治國，不枉人民。",
        "translation": "The great king of Vārāṇasī was sagacious and benevolent, always governing his country correctly without inflicting harm on the people.",
        "source": "T03n0156_003:0137c23_3"
    },
    {
        "source_sentence": "王主六十小國、八百聚落。",
        "translation": "The king ruled over sixty small countries and eight hundred villages.",
        "source": "T03n0156_003:0137c24_4"
    },
    {
        "source_sentence": "王了無子。",
        "translation": "The king understood that there were no children.",
        "source": "T03n0156_003:0137c25_5"
    },
    {
        "source_sentence": "王自供養奉事山神、樹神、一切神祇，經十二年不懈不息，求索有子。",
        "translation": "For twelve years the king honored and served the deities of the mountain, the tree gods, and all other deities without cease.",
        "source": "T03n0156_003:0137c25_6"
    },
    {
        "source_sentence": "第一夫人便覺有娠，十月足滿生一男兒。",
        "translation": "The first wife then became pregnant and gave birth to a boy at the age of ten months.",
        "source": "T03n0156_003:0137c27_7"
    },
    {
        "source_sentence": "其子端正，人相具足。",
        "translation": "The boy was handsome and endowed with the characteristics of a human being.",
        "source": "T03n0156_003:0137c28_8"
    },
    {
        "source_sentence": "生已召諸大臣、諸小國王，占相吉凶，即為立字。",
        "translation": "After he was born, he summoned the ministers and kings of the small countries to divine fortune and misfortune, which is the Sanskrit letter erected.",
        "source": "T03n0156_003:0137c28_9"
    },
    {
        "source_sentence": "以其太子性善不瞋，名曰忍辱。",
        "translation": "Because the prince's nature is good and not angry, he's called a forbearance.",
        "source": "T03n0156_003:0137c29_10"
    },
    {
        "source_sentence": "忍辱太子其年長大，好喜布施，聰明慈仁，於諸眾生等生慈心。",
        "translation": "When the prince Patience grew up, he was fond of generosity, intelligent and kind, and had compassion for all sentient beings equally.",
        "source": "T03n0156_003:0138a01_11"
    },
    {
        "source_sentence": "爾時大王有六大臣，其性暴惡，姧詭佞諂，枉橫無道，人民厭患。",
        "translation": "At the time, the great king had six ministers who were violent and wicked by nature, deceitful and flattering, injusticeful and lacking the path, and the people disliked them.",
        "source": "T03n0156_003:0138a02_12"
    },
    {
        "source_sentence": "時六大臣自知於行有違，常懷嫉妬，憎惡太子。",
        "translation": "Knowing that their conduct was contrary, the six ministers always harbored jealousy and hated the prince.",
        "source": "T03n0156_003:0138a04_13"
    },
    {
        "source_sentence": "「爾時大王身嬰重病，苦惱顦顇，命在旦夕。",
        "translation": "At the time, the great king was seriously ill and suffering from pain and distress, and his life lasted until dawn and dusk.",
        "source": "T03n0156_003:0138a06_0"
    },
    {
        "source_sentence": "忍辱太子往告諸臣：『父王困篤，今當奈何？』",
        "translation": "The prince Patience went to the ministers and told them, 'My father is in distress, so what should I do now?'",
        "source": "T03n0156_003:0138a07_0"
    },
    {
        "source_sentence": "諸臣聞已，心生瞋恚，報太子言：『王命不久。",
        "translation": "On hearing this, the ministers became angry and reported to the prince, saying, 'The king's order won't be long.",
        "source": "T03n0156_003:0138a08_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0156_003:0138a09_0"
    },
    {
        "source_sentence": "欲求妙藥，不可得故，是以當知命去不遠。』",
        "translation": "Because they want to seek the marvelous medicine, they can't obtain it; therefore, they should know that their life won't be far away.'",
        "source": "T03n0156_003:0138a09_1"
    },
    {
        "source_sentence": "太子聞已，心生苦惱，悶絕躃地。",
        "translation": "When the prince heard this, he was overcome with distress and crippled to a knee-high.",
        "source": "T03n0156_003:0138a10_2"
    },
    {
        "source_sentence": "「時六大臣即入靜室，共謀議言：『忍辱太子不除去者，我等終不得安隱也。』",
        "translation": "The six ministers then went into a quiet room and discussed the matter together, saying, 'If the prince of forbearance doesn't remove it, we won't be able to be comfortable.'",
        "source": "T03n0156_003:0138a11_0"
    },
    {
        "source_sentence": "作是念已，第一大臣言：『忍辱太子無事可除。』",
        "translation": "After he had this thought, the first minister said, 'There's nothing to remove from the prince of forbearance.'",
        "source": "T03n0156_003:0138a12_1"
    },
    {
        "source_sentence": "一臣復言：『我有方便能除去之。』",
        "translation": "A minister also said, 'I have the skillful means to remove it.'",
        "source": "T03n0156_003:0138a13_2"
    },
    {
        "source_sentence": "即往太子所，報太子言：『臣向在外，於六十小國八百聚落中求覓藥草，",
        "translation": "He went to the prince and reported to him, “I am going to search for medicine and herbs in sixty small countries and eighty-one villages.",
        "source": "T03n0156_003:0138a14_3"
    },
    {
        "source_sentence": "了不能得。』",
        "translation": "They can't understand it.'",
        "source": "T03n0156_003:0138a16_0"
    },
    {
        "source_sentence": "太子問言：『所求藥草為是何物？』",
        "translation": "The prince asked, 'What's the medicine and herbs you're seeking?'",
        "source": "T03n0156_003:0138a16_1"
    },
    {
        "source_sentence": "大臣報言：『太子當知，求藥草者，正是從生至終不瞋人眼睛及其人髓。",
        "translation": "The minister replied, 'You should know, prince, that someone seeking medicinal herbs is precisely someone who doesn't angrily look at people's eyes and marrow from birth to death.",
        "source": "T03n0156_003:0138a17_0"
    },
    {
        "source_sentence": "若得此藥，得全王命；",
        "translation": "If he obtains this medicine, he will attain the king’s life.",
        "source": "T03n0156_003:0138a18_1"
    },
    {
        "source_sentence": "若不得者，命在不久。",
        "translation": "If he doesn't get it, his life won't be long.",
        "source": "T03n0156_003:0138a19_2"
    },
    {
        "source_sentence": "於諸國土無有此人。』",
        "translation": "There's no such person in any land.'",
        "source": "T03n0156_003:0138a19_3"
    },
    {
        "source_sentence": "太子聞已，心生憂惱，即報大臣：『今我身者似是其人。",
        "translation": "When the prince heard this, he became distressed and reported to the minister, 'Now, I myself seem to be that person.",
        "source": "T03n0156_003:0138a20_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0156_003:0138a21_5"
    },
    {
        "source_sentence": "我從生已來未曾有瞋。』",
        "translation": "Ever since I was born, I've never had anger.'",
        "source": "T03n0156_003:0138a21_6"
    },
    {
        "source_sentence": "大臣言：『太子若是其人者，此事亦難。",
        "translation": "The ministers said, 'If that's the prince, it's difficult for him to do so.",
        "source": "T03n0156_003:0138a22_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0156_003:0138a23_8"
    },
    {
        "source_sentence": "天下所重莫若己身。』",
        "translation": "Nothing is valued in the world like my own body.'",
        "source": "T03n0156_003:0138a23_9"
    },
    {
        "source_sentence": "太子言：『不如諸臣所言也。",
        "translation": "The prince said, 'It's not like what the ministers say.",
        "source": "T03n0156_003:0138a23_10"
    },
    {
        "source_sentence": "但使父王病得損者，假使捨百千身，亦不為難，況我今日此穢身也？』",
        "translation": "It's just that if my father is ill and loses a hundred thousand bodies, it won't be difficult for him to abandon them, so why wouldn't I abandon this defiled body today?'",
        "source": "T03n0156_003:0138a24_11"
    },
    {
        "source_sentence": "大臣報言：『如此之事，隨太子意。』",
        "translation": "The minister replied, 'Such things are as the prince wishes.'",
        "source": "T03n0156_003:0138a26_0"
    },
    {
        "source_sentence": "「爾時忍辱太子心生歡喜，而作是念：『若使此藥能除父王病者，宜應速辦此事。』",
        "translation": "At that point, the prince of forbearance rejoiced and thought, 'If this medicine can remove the father's illness, it's advisable to quickly arrange this matter.'",
        "source": "T03n0156_003:0138a27_0"
    },
    {
        "source_sentence": "忍辱太子即入宮中，到其母所，頭面禮足，合掌向母，而作是言：『今者此身，",
        "translation": "The prince Patience entered the palace and went to his mother’s place. After honoring her by bowing his forehead at her feet, he joined his palms and said:",
        "source": "T03n0156_003:0138a28_1"
    },
    {
        "source_sentence": "欲為父王作治病藥。",
        "translation": "He wanted to make medicine for the king's father to treat his illness.",
        "source": "T03n0156_003:0138b01_2"
    },
    {
        "source_sentence": "恐其身命不得存立，是故與母共別。",
        "translation": "Because they feared that their bodies and lives wouldn't be able to survive, they were separated from their mother.",
        "source": "T03n0156_003:0138b02_0"
    },
    {
        "source_sentence": "願母莫憂苦，戀慕其子。』",
        "translation": "May the mother not grieve and suffer, and may she love her child.'",
        "source": "T03n0156_003:0138b02_1"
    },
    {
        "source_sentence": "其母聞是語已，心生悶絕，忘失四方，譬如人噎，又不得咽，不能勸進，",
        "translation": "When the mother heard these words she fainted in distress and forgot all four directions, like a man who is choked and unable to swallow or exhort.",
        "source": "T03n0156_003:0138b03_2"
    },
    {
        "source_sentence": "又不得吐，不能勸止。",
        "translation": "Again, he mustn't spit out, and he can't encourage or stop it.",
        "source": "T03n0156_003:0138b05_0"
    },
    {
        "source_sentence": "即前抱其太子，悶絕，以冷水灑面，良久乃穌。",
        "translation": "He then went forward to embrace the prince in front of him, fainted, and sprinkled his face with cold water. After a long while he lay down.",
        "source": "T03n0156_003:0138b05_1"
    },
    {
        "source_sentence": "爾時太子白其母言：『父王身命，須臾之間，不得久停。",
        "translation": "The prince then said to his mother, 'Father, the king's body and life won't last long for a moment.",
        "source": "T03n0156_003:0138b06_2"
    },
    {
        "source_sentence": "宜時速辦，令王服之。』",
        "translation": "It's advisable to prepare it quickly at the right time and cause the king to take it.'",
        "source": "T03n0156_003:0138b07_3"
    },
    {
        "source_sentence": "爾時太子即呼大臣、諸小國王，於大眾中，即宣此言：『我身今者與大眾別。』",
        "translation": "It was then that the prince summoned his ministers and the kings of the small countries in the great assembly and said, 'Now, I'm going to part with the great assembly.'",
        "source": "T03n0156_003:0138b08_4"
    },
    {
        "source_sentence": "爾時大臣即呼旃陀羅，斷骨出髓，剜其兩目。",
        "translation": "The minister then called out to Candra, cut off his bones and marrow, exhumed their two eyes.",
        "source": "T03n0156_003:0138b09_5"
    },
    {
        "source_sentence": "「爾時大臣即擣此藥，奉上大王。",
        "translation": "At the time, the minister then offered this medicine to the king.",
        "source": "T03n0156_003:0138b11_0"
    },
    {
        "source_sentence": "王即服之，病得除差。",
        "translation": "The king then took it, and his illness was cured.",
        "source": "T03n0156_003:0138b11_1"
    },
    {
        "source_sentence": "病既差已，問諸大臣：『汝等於何得此妙藥，除我患苦，得全身命？』",
        "translation": "After his illness had healed, he asked the ministers, 'Where did you get this wonderful medicine to remove my suffering and attain my whole body and life?'",
        "source": "T03n0156_003:0138b12_2"
    },
    {
        "source_sentence": "大臣白王：『今此藥者，忍辱太子之所辦耳。",
        "translation": "The ministers said to the king, 'Now, this medicine is prepared by the prince of forbearance.",
        "source": "T03n0156_003:0138b13_3"
    },
    {
        "source_sentence": "非諸臣力所堪辦也。』",
        "translation": "It's beyond the ability of the ministers to do so.'",
        "source": "T03n0156_003:0138b14_4"
    },
    {
        "source_sentence": "王聞是語，心驚毛竪，微聲問諸臣言：『忍辱太子今在何所？』",
        "translation": "When the king heard these words, his hair stood on end in fear, and he asked the ministers with a subtle voice, 'Where is the prince Kṣāntiputra now?'",
        "source": "T03n0156_003:0138b15_5"
    },
    {
        "source_sentence": "大臣答言：『太子今者在外，身體傷損，命不云遠。』",
        "translation": "The minister replied, 'Now that the prince is outside, his body is injured and his life won't be long.'",
        "source": "T03n0156_003:0138b16_6"
    },
    {
        "source_sentence": "王聞是語，舉聲大哭：『怪哉！",
        "translation": "When the king heard these words, he raised his voice and cried out in tears, 'How strange!",
        "source": "T03n0156_003:0138b17_7"
    },
    {
        "source_sentence": "怪哉！』",
        "translation": "That's amazing!'",
        "source": "T03n0156_003:0138b18_8"
    },
    {
        "source_sentence": "自投於地，塵土坌身：『如我今者，實自無情。",
        "translation": "He threw himself to the ground, covered his body with dust and dirt, saying, 'Such as I am now, I really have no feelings.",
        "source": "T03n0156_003:0138b18_9"
    },
    {
        "source_sentence": "云何乃能服此子藥？』",
        "translation": "How can you take this child's medicine?'",
        "source": "T03n0156_003:0138b19_10"
    },
    {
        "source_sentence": "往到子所，其命已終。",
        "translation": "He went to his son's place, and his life ended.",
        "source": "T03n0156_003:0138b19_11"
    },
    {
        "source_sentence": "王及夫人及諸臣民，無量大眾前後圍遶。",
        "translation": "The king, his wife, and the ministers were surrounded by an immeasurable crowd of people.",
        "source": "T03n0156_003:0138b20_12"
    },
    {
        "source_sentence": "其母懊惱，投身死尸：『以我宿世有諸過惡，今令子身受是苦也。",
        "translation": "Being distressed, the mother threw herself into a corpse and said, 'Because of my past faults and evils, I've caused my son to experience this kind of pain in body.",
        "source": "T03n0156_003:0138b21_13"
    },
    {
        "source_sentence": "今我身者，何不碎末如塵，乃令我子喪失身命。』",
        "translation": "Why wouldn't my body now be broken like dust, which would cause my son to lose his body and life?'",
        "source": "T03n0156_003:0138b22_14"
    },
    {
        "source_sentence": "爾時父王及諸小王即以牛頭栴檀香木，積以成[卄\\/積]，闍維太子所有身骨，",
        "translation": "It was then that the father and the other minor kings gathered the sandalwood wood from the ox-head sandalwood incense stick into a heap, and all the bones of Prince Jeta’s body were preserved there.",
        "source": "T03n0156_003:0138b23_15"
    },
    {
        "source_sentence": "復以七寶起塔供養。」",
        "translation": "Again, he built a stūpa of seven treasures to make offerings.",
        "source": "T03n0156_003:0138b25_16"
    },
    {
        "source_sentence": "爾時世尊告彌勒菩薩善男子等大眾：「當知爾時波羅奈大王者，今現我父悅頭檀是；",
        "translation": "It was then that the World-honored One addressed the great assembly of Maitreya Bodhisattva’s good men:",
        "source": "T03n0156_003:0138b26_0"
    },
    {
        "source_sentence": "爾時母者，今現我母摩耶是；",
        "translation": "The mother at that time was Maya, who is now my mother.",
        "source": "T03n0156_003:0138b27_1"
    },
    {
        "source_sentence": "忍辱太子者，今我身是。",
        "translation": "The prince Patience is the present-day self.",
        "source": "T03n0156_003:0138b28_2"
    },
    {
        "source_sentence": "菩薩於無量阿僧祇劫孝養父母，衣被、飲食、房舍、臥具，乃至身肉骨髓，",
        "translation": "“For immeasurable incalculable kalpas, the bodhisattva honored his parents by providing them with clothing, food and drink, dwelling places, bedding, flesh, bones, and marrow.",
        "source": "T03n0156_003:0138b29_3"
    },
    {
        "source_sentence": "其事如是，以此因緣自致成佛。",
        "translation": "Because of these causes and conditions, he became a buddha on his own.",
        "source": "T03n0156_003:0138c01_4"
    },
    {
        "source_sentence": "今此寶塔從地踊出者，即是我為其父母捨此骨髓及其身命，即於此處起塔供養。",
        "translation": "The reason this jeweled stupa emerges from the earth is that I gave up this bone marrow and my body for his parents, and then built a stupa here to make offerings.",
        "source": "T03n0156_003:0138c02_5"
    },
    {
        "source_sentence": "我今成佛，即踊現其前。」",
        "translation": "Now that I've become a buddha, I'll rise and appear before him.",
        "source": "T03n0156_003:0138c04_6"
    },
    {
        "source_sentence": "爾時大眾中無量人、天、諸龍、鬼神，聞是語已，悲喜交集，淚下滿目，",
        "translation": "Measureless multitudes of people, gods, dragons, ghosts, and spirits in the great assembly then heard these words. They were overcome with sorrow and joy, and their eyes were filled with tears.",
        "source": "T03n0156_003:0138c05_0"
    },
    {
        "source_sentence": "異口同音讚歎如來百千功德，尋時發於阿耨多羅三藐三菩提心；",
        "translation": "The enlightening being Universally Good spoke in unison, extolling the hundreds of thousands of virtues of the buddha-qualities of all buddhas.",
        "source": "T03n0156_003:0138c06_1"
    },
    {
        "source_sentence": "復有無量百千眾生發聲聞、辟支佛心；",
        "translation": "Countless hundreds of thousands of sentient beings also developed the minds of śrāvakas and pratyekabuddhas.",
        "source": "T03n0156_003:0138c08_0"
    },
    {
        "source_sentence": "復有無量人得須陀洹果乃至阿羅漢道；",
        "translation": "There were also innumerable people who had attained the state of stream-enterer, up to the path of the arhat.",
        "source": "T03n0156_003:0138c08_1"
    },
    {
        "source_sentence": "復有無量百千萬億菩薩摩訶薩，不久當得阿耨多羅三藐三菩提。",
        "translation": "There are also measureless hundreds of thousands of myriads of koṭis of bodhisattva mahāsattvas who will soon attain unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0156_003:0138c09_2"
    },
    {
        "source_sentence": "是故，當知如來今者真是孝養父母。",
        "translation": "Therefore, you should know that the Tathāgata is now truly filial to his parents.",
        "source": "T03n0156_003:0138c11_3"
    },
    {
        "source_sentence": "復次，菩薩本知母人之德，以其本願如是，生如來身。",
        "translation": "Furthermore, the bodhisattva originally knew the virtues of his mother and gave birth in the Tathāgata's body based on her original vow like this.",
        "source": "T03n0156_003:0138c13_0"
    },
    {
        "source_sentence": "以生如來，滿本願故，不堪受其禮故，因其將終。",
        "translation": "Because he gave birth to the Tathāgata, he fulfilled his original vow and was unable to receive his veneration; therefore, he was about to die.",
        "source": "T03n0156_003:0138c14_1"
    },
    {
        "source_sentence": "爾時大眾異口同音讚歎摩耶：「善哉摩耶！",
        "translation": "It was then that the whole crowd spoke in unison and praised Māya, Good, Māya!",
        "source": "T03n0156_003:0138c15_2"
    },
    {
        "source_sentence": "得生如來，天人世間無與等者。」",
        "translation": "The Tathāgata who's born is unsurpassed by gods and humans in the world.",
        "source": "T03n0156_003:0138c16_3"
    },
    {
        "source_sentence": "爾時闥婆摩羅即從座起，偏袒右肩，胡跪合掌，而白佛言：「世尊！",
        "translation": "At that point, Upagupta got up from his seat, bared his right shoulder, knelt down with his palms pressed together, and said to the Buddha, Bhagavān!",
        "source": "T03n0156_003:0138c18_0"
    },
    {
        "source_sentence": "摩耶夫人修何功德？",
        "translation": "What virtue did Lady Maya cultivate?",
        "source": "T03n0156_003:0138c19_1"
    },
    {
        "source_sentence": "以何因緣得生如來？」",
        "translation": "By what causes and conditions will the Tathāgata be born?",
        "source": "T03n0156_003:0138c19_2"
    },
    {
        "source_sentence": "佛言：「善聽！",
        "translation": "The Buddha said, Good listen!",
        "source": "T03n0156_003:0138c21_0"
    },
    {
        "source_sentence": "吾當為汝分別解說。」",
        "translation": "I will explain it separately for you.",
        "source": "T03n0156_003:0138c21_1"
    },
    {
        "source_sentence": "佛言：「乃往過去久遠不可計劫，有佛出世，號毘婆尸如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "The Buddha said: Long ago, in an uncountable eon, a buddha named Vipaśyin Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Un",
        "source": "T03n0156_003:0138c21_2"
    },
    {
        "source_sentence": "出現於世，乃至正法、像法滅已。",
        "translation": "They appear in the world, up to the cessation of the right teaching and the Dharma that's like it.",
        "source": "T03n0156_003:0138c24_3"
    },
    {
        "source_sentence": "爾時有國號波羅奈。",
        "translation": "At the time, there was a country named Vārāṇasī.",
        "source": "T03n0156_003:0138c25_4"
    },
    {
        "source_sentence": "去城不遠有山，名曰聖所遊居，以有百千辟支佛住此山中故，無量五通神仙亦住其中。",
        "translation": "Not far from the city, there's a mountain named noble abode where hundreds of thousands of pratyekabuddhas live because they live in this mountain, and measureless five supernormal spirits and sages also live there.",
        "source": "T03n0156_003:0138c25_5"
    },
    {
        "source_sentence": "以多仙聖止住其中故，號聖遊居山。",
        "translation": "Because many sages and sages stayed there, he was called the holy monk who lived on the mountain.",
        "source": "T03n0156_003:0138c27_6"
    },
    {
        "source_sentence": "其山有一仙人住在南窟，復有一仙住在北窟。",
        "translation": "On that mountain, there's a sage living in the south cave and another sage living in the north cave.",
        "source": "T03n0156_003:0138c28_7"
    },
    {
        "source_sentence": "二山中間有一泉水，其泉水邊有一平石。",
        "translation": "Between the two mountains, there's a fountain of water, and beside that fountain is a flat rock.",
        "source": "T03n0156_003:0138c29_8"
    },
    {
        "source_sentence": "「爾時南窟仙人在此石上，浣衣洗足已，便還所止。",
        "translation": "At the time, the sage named Nanquan was staying here on the rock. After washing his robes and feet, he returned to where he was staying.",
        "source": "T03n0156_003:0139a02_0"
    },
    {
        "source_sentence": "去後未久，有一雌鹿來飲泉水。",
        "translation": "Not long after his departure, a female deer came to drink water from the spring.",
        "source": "T03n0156_003:0139a03_1"
    },
    {
        "source_sentence": "次第到浣衣處，即飲是石上浣垢衣汁。",
        "translation": "When he arrived at the place to wash his robes one by one, he drank the juice of this rock where he washed his dirty clothes.",
        "source": "T03n0156_003:0139a03_2"
    },
    {
        "source_sentence": "飲此衣垢汁已，迴頭反顧，自舐小便處。",
        "translation": "After drinking the juice of this robe’s impure juice, they turned their heads in reverse and looked around at the place where they relieved themselves.",
        "source": "T03n0156_003:0139a04_3"
    },
    {
        "source_sentence": "「爾時雌鹿尋便懷妊，月滿產生。",
        "translation": "It was then that the female deer became pregnant and gave birth at the full moon.",
        "source": "T03n0156_003:0139a06_0"
    },
    {
        "source_sentence": "鹿產生法，要還向本得胎處。",
        "translation": "When a deer produces the Dharma, it must return to its original place of rebirth.",
        "source": "T03n0156_003:0139a06_1"
    },
    {
        "source_sentence": "即還水邊，住本石上，悲鳴宛轉，產生一女。",
        "translation": "She then returned to the water's edge, stayed on the original rock, cried in distress, and gave birth to a woman.",
        "source": "T03n0156_003:0139a07_2"
    },
    {
        "source_sentence": "爾時仙人聞此鹿悲鳴大喚。",
        "translation": "It was then that the sage heard the deer wailing in sorrow and screaming.",
        "source": "T03n0156_003:0139a08_3"
    },
    {
        "source_sentence": "爾時南窟仙人聞是鹿大悲鳴聲，心生憐愍，即出往看，見此雌鹿產生一女。",
        "translation": "At the time, the sage Nanquan heard the deer's great cries of sorrow and pity, so he went out to look around and saw that this female deer gave birth to a woman.",
        "source": "T03n0156_003:0139a08_4"
    },
    {
        "source_sentence": "爾時鹿母宛轉舐之，見仙人往，便捨而去。",
        "translation": "At that time the mother of the deer slowly licked it. Seeing the holy man approaching her, she abandoned him and departed.",
        "source": "T03n0156_003:0139a10_5"
    },
    {
        "source_sentence": "「爾時仙人見此女兒，形相端正，人相具足。",
        "translation": "“At the time, the sage saw that this daughter’s form was handsome and endowed with human features.",
        "source": "T03n0156_003:0139a12_0"
    },
    {
        "source_sentence": "見是事已，心生憐愍，即以草衣裹拭將還，採眾妙果，隨時將養，漸漸長大，",
        "translation": "Having seen this sight, he felt pity and wrapped it in a straw-covered cloth and was about to return home. He collected various good fruits and grew up gradually at different seasons.",
        "source": "T03n0156_003:0139a12_1"
    },
    {
        "source_sentence": "至年十四。",
        "translation": "He was 14 years old.",
        "source": "T03n0156_003:0139a14_2"
    },
    {
        "source_sentence": "其父愛念，常使宿火，令不斷絕。",
        "translation": "Their father loved them and always kept a constellation on fire so that they wouldn't be cut off.",
        "source": "T03n0156_003:0139a14_3"
    },
    {
        "source_sentence": "忽於一日，心不謹慎，便使火滅。",
        "translation": "Suddenly, on one day, he was not careful in his mind and caused the fire to go out.",
        "source": "T03n0156_003:0139a15_4"
    },
    {
        "source_sentence": "其父苦責數已，語其女言：『我長身已來，未曾使此火滅。",
        "translation": "After the father had been tortured and reprimanded, he said to his daughter, 'Since my long life, I've never caused this fire to go out.",
        "source": "T03n0156_003:0139a16_5"
    },
    {
        "source_sentence": "汝今日云何令滅？",
        "translation": "How will you be extinguished today?",
        "source": "T03n0156_003:0139a17_6"
    },
    {
        "source_sentence": "北窟有火，汝可往取。』",
        "translation": "There's a fire in the northern cave, so you can go and get it.'",
        "source": "T03n0156_003:0139a18_0"
    },
    {
        "source_sentence": "「爾時鹿女即隨父教，往詣北窟。",
        "translation": "“At the time, the deer girl followed her father’s instructions and went to the northern cave.",
        "source": "T03n0156_003:0139a19_0"
    },
    {
        "source_sentence": "步步舉足皆生蓮華，隨其蹤跡，行伍次第，如似街陌。",
        "translation": "Each step, raising its legs, produces lotus blossoms. Following the traces of these flowers, they walk in an orderly fashion, just as if walking along a road or a street.",
        "source": "T03n0156_003:0139a19_1"
    },
    {
        "source_sentence": "往至北窟，從彼仙人乞求少火。",
        "translation": "He went to the north cave and begged the sage for a little fire from him.",
        "source": "T03n0156_003:0139a20_2"
    },
    {
        "source_sentence": "爾時仙人見此女人福德，如是足下生於蓮華，報言：『欲得火者，汝當右遶我窟，",
        "translation": "Seeing the woman’s virtue, the holy man said to her, “If you wish to obtain fire, circumambulate my cave on your right.",
        "source": "T03n0156_003:0139a21_3"
    },
    {
        "source_sentence": "滿足七匝。』",
        "translation": "It's completed seven times.'",
        "source": "T03n0156_003:0139a23_4"
    },
    {
        "source_sentence": "行伍次第了了分明，隨其舉足，皆生蓮華。",
        "translation": "Each of the practitioners was clearly distinguished in order, and lotus flowers grew up as they lifted their feet.",
        "source": "T03n0156_003:0139a23_5"
    },
    {
        "source_sentence": "遶七匝已，語其女言：『欲得火者，復當在此右邊還歸去者。",
        "translation": "After circumambulating him seven times, he said to his daughter, 'If you want to get a fire, you must return here to the right side and go back.'",
        "source": "T03n0156_003:0139a24_6"
    },
    {
        "source_sentence": "當與汝火。』",
        "translation": "I will give you the fire.'",
        "source": "T03n0156_003:0139a26_0"
    },
    {
        "source_sentence": "「爾時鹿女為得火故，隨教而去。",
        "translation": "It was then that the deer woman, wanting to get the fire, departed as she had been taught.",
        "source": "T03n0156_003:0139a27_0"
    },
    {
        "source_sentence": "其女去後未久之間，波羅奈王將諸大臣，百千萬眾，前後圍遶，千乘萬騎，",
        "translation": "Not long after the queen’s departure, King Vārāṇasī, accompanied by his ministers and hundreds of thousands of myriads of soldiers, surrounded her with a thousand chariots and ten thousand horsemen.",
        "source": "T03n0156_003:0139a27_1"
    },
    {
        "source_sentence": "入山遊獵，馳逐群鹿。",
        "translation": "They entered the mountains to hunt and chased the herd of deer.",
        "source": "T03n0156_003:0139a29_2"
    },
    {
        "source_sentence": "波羅奈王獨乘名象，往到北窟仙人所，見其蓮華遶窟行列。",
        "translation": "King Vārāṇasī, riding alone on a famous elephant, went to the holy man in the northern cave and saw lotus flowers surrounding the rows of people in the cave.",
        "source": "T03n0156_003:0139a29_3"
    },
    {
        "source_sentence": "爾時大王心生歡喜，歎言：『善哉！",
        "translation": "At that point, the great king rejoiced in his heart and praised him, saying, 'Good!",
        "source": "T03n0156_003:0139b02_4"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T03n0156_003:0139b02_5"
    },
    {
        "source_sentence": "大德神仙！",
        "translation": "Great sage of great virtue!",
        "source": "T03n0156_003:0139b03_0"
    },
    {
        "source_sentence": "大仙導師！",
        "translation": "Great sage guide!",
        "source": "T03n0156_003:0139b03_1"
    },
    {
        "source_sentence": "福德巍巍，其事如是！』",
        "translation": "Their merit is so majestic, and their deeds are like this!'",
        "source": "T03n0156_003:0139b03_2"
    },
    {
        "source_sentence": "「爾時仙人即白王言：『大王！",
        "translation": "It was then that the sage said to the king, 'Great king!",
        "source": "T03n0156_003:0139b04_0"
    },
    {
        "source_sentence": "當知此蓮華者，非我所能。』",
        "translation": "You should know that this lotus is not something I can do.'",
        "source": "T03n0156_003:0139b04_1"
    },
    {
        "source_sentence": "王言：『非大師者，是誰所為。』",
        "translation": "The king said, 'If it's not the great teacher, who will do it?'",
        "source": "T03n0156_003:0139b05_2"
    },
    {
        "source_sentence": "報言：『大王！",
        "translation": "They replied, 'Great king!",
        "source": "T03n0156_003:0139b05_3"
    },
    {
        "source_sentence": "是南窟仙人生育一女，姿容端正，人相具足，世間難有。",
        "translation": "The ṛṣi of Nanquan gave birth to a daughter with an elegant appearance, endowed with the characteristics rare in the world.",
        "source": "T03n0156_003:0139b06_0"
    },
    {
        "source_sentence": "其女行時，隨其足下皆生蓮華。』",
        "translation": "When the woman walks, lotus flowers grow under her feet.'",
        "source": "T03n0156_003:0139b07_1"
    },
    {
        "source_sentence": "王聞是語，心生歡喜，即往南窟，見彼仙人，頭面禮足。",
        "translation": "Having heard these words, the king was overjoyed and went to the southern cave to see the holy man bowed his forehead at his feet.",
        "source": "T03n0156_003:0139b07_2"
    },
    {
        "source_sentence": "爾時仙人即出問訊：『大王！",
        "translation": "It was then that the sage asked, 'Great king!",
        "source": "T03n0156_003:0139b09_3"
    },
    {
        "source_sentence": "遠涉途路，得無疲極。』",
        "translation": "I've traveled a long distance on the path, and I've never tired of it.'",
        "source": "T03n0156_003:0139b09_4"
    },
    {
        "source_sentence": "爾時大王報仙人言：『聞君有女，欲求婚姻。』",
        "translation": "It was then that the great king reported to the sage, saying, 'I've heard that you have a woman who wants to seek marriage.'",
        "source": "T03n0156_003:0139b10_5"
    },
    {
        "source_sentence": "「爾時仙人報大王言：『貧身有此一女，稚小無知，未有所識。",
        "translation": "It was then that the sage reported to the king, saying, 'There's this one woman with a poor body who's small and ignorant, and she has no consciousness.",
        "source": "T03n0156_003:0139b12_0"
    },
    {
        "source_sentence": "少小已來住此深山，未閑人事，服草食果。",
        "translation": "Since his youth he lived deep in this mountain. He did not take leisurely time and ate from the herbs, plants, and fruit.",
        "source": "T03n0156_003:0139b13_1"
    },
    {
        "source_sentence": "王今云何乃欲顧錄？",
        "translation": "What does the king want to record now?",
        "source": "T03n0156_003:0139b14_2"
    },
    {
        "source_sentence": "又此女者，畜生所生。』",
        "translation": "Furthermore, this woman is born from an animal.'",
        "source": "T03n0156_003:0139b14_3"
    },
    {
        "source_sentence": "即以上事向王具說。",
        "translation": "He then explained the above matter to the king in detail.",
        "source": "T03n0156_003:0139b15_4"
    },
    {
        "source_sentence": "王言：『雖爾無苦。』",
        "translation": "The king said, 'Even so, it's not painful.'",
        "source": "T03n0156_003:0139b15_5"
    },
    {
        "source_sentence": "問其父言：『鹿女者今在何許？』",
        "translation": "He asked his father, 'Where's the deer-maiden now?'",
        "source": "T03n0156_003:0139b16_6"
    },
    {
        "source_sentence": "報言大王：『在此草窟。』",
        "translation": "He replied to the great king, 'Here in the grass cave.'",
        "source": "T03n0156_003:0139b16_7"
    },
    {
        "source_sentence": "爾時大王即入窟中，見其鹿女，心生歡喜。",
        "translation": "It was then that the great king entered the cave and saw the deer-maiden, rejoicing.",
        "source": "T03n0156_003:0139b17_8"
    },
    {
        "source_sentence": "即以沐浴香湯，名衣上服，百寶瓔珞莊嚴其身，乘大名象，百千導從，",
        "translation": "He was bathed in scented warm water, dressed in renowned robes and upper garments, adorned with hundreds of jewel necklaces, and riding on a great elephant, accompanied by one hundred thousand attendants.",
        "source": "T03n0156_003:0139b18_9"
    },
    {
        "source_sentence": "作倡伎樂，還歸本國。",
        "translation": "They played music and returned to their own country.",
        "source": "T03n0156_003:0139b20_0"
    },
    {
        "source_sentence": "爾時鹿女從生已來，未曾見如此大眾，心驚怖懼。",
        "translation": "At the time, the deer woman had never seen such a large crowd since she was born, and her mind was frightened and fearful.",
        "source": "T03n0156_003:0139b20_1"
    },
    {
        "source_sentence": "「爾時其父上高山頂，遙看其女，目不暫捨，而作是念：『我今遙觀我女，",
        "translation": "“At that time, his father was on the summit of a high mountain looking at my daughter from a distance. He did not let go of her eyes for a moment but thought:",
        "source": "T03n0156_003:0139b22_0"
    },
    {
        "source_sentence": "遠去不現，當還本處，悲號懊惱，流淚滿目。",
        "translation": "He was far away but did not appear. When he returned to his original place he cried in distress, shedding tears and tears all over her eyes.",
        "source": "T03n0156_003:0139b23_1"
    },
    {
        "source_sentence": "我生育此女未有所知，與我遠別。』",
        "translation": "I'll give birth to this woman who doesn't know anything, and she'll be far removed from me.'",
        "source": "T03n0156_003:0139b24_2"
    },
    {
        "source_sentence": "復作是念：『我今住此，不應餘轉。",
        "translation": "Again, he thinks, 'Now that I'm here, I shouldn't change anything else.",
        "source": "T03n0156_003:0139b25_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0156_003:0139b26_4"
    },
    {
        "source_sentence": "若我女反顧後望不見我者，令女憂苦。』",
        "translation": "If my daughter looks back and doesn't see me, I'll cause her to be sad and pained.'",
        "source": "T03n0156_003:0139b26_5"
    },
    {
        "source_sentence": "竚立良久，女去不現，竟不迴顧。",
        "translation": "After standing there for a long time, the woman departed without appearing and did not look back.",
        "source": "T03n0156_003:0139b27_6"
    },
    {
        "source_sentence": "「爾時其父心生恚恨，而作是言：『畜生所生，故不妄也。",
        "translation": "At the time, his father became angry and said, 'This is not false because it's produced by an animal.",
        "source": "T03n0156_003:0139b29_0"
    },
    {
        "source_sentence": "我小長養，今得成人。",
        "translation": "I grew up as a child and now become an adult.",
        "source": "T03n0156_003:0139c01_1"
    },
    {
        "source_sentence": "為王所念，而反孤棄。』",
        "translation": "They're thought of by the king and instead abandoned.'",
        "source": "T03n0156_003:0139c01_2"
    },
    {
        "source_sentence": "即入窟中誦持呪術而呪其女：『王若遇汝薄者，皎然不論。",
        "translation": "He then entered the cave, recited a spell, and cursed his daughter, saying, 'If the king meets you thin, he'll shine brightly without discrimination.",
        "source": "T03n0156_003:0139c02_3"
    },
    {
        "source_sentence": "若王以禮待接汝者，當令退沒，不果所願。』",
        "translation": "If the king receives you with courtesy, he'll cause you to retreat and disappear, which doesn't fulfill his wish.'",
        "source": "T03n0156_003:0139c03_4"
    },
    {
        "source_sentence": "「爾時波羅奈王到宮殿已，拜為第一，名曰鹿母夫人。",
        "translation": "When King Vārāṇasī arrived at the palace, he was the first to bow his head in respect, named Lady Deer Mother.",
        "source": "T03n0156_003:0139c05_0"
    },
    {
        "source_sentence": "諸小國王、百官、群臣皆來朝賀。",
        "translation": "The kings of the small countries, the hundred officials, and the ministers all came to congratulate him.",
        "source": "T03n0156_003:0139c06_1"
    },
    {
        "source_sentence": "王見此已，心生歡喜。",
        "translation": "Seeing this sight, the king was delighted.",
        "source": "T03n0156_003:0139c06_2"
    },
    {
        "source_sentence": "未久數日，便覺有娠。",
        "translation": "Not long after a few days she became pregnant.",
        "source": "T03n0156_003:0139c07_3"
    },
    {
        "source_sentence": "王自供養夫人，床臥飲食皆令細軟。",
        "translation": "The king himself made offerings to the queen, making their beds, bedding, food, and drink all fine and soft.",
        "source": "T03n0156_003:0139c07_4"
    },
    {
        "source_sentence": "至滿十月，望其生男，紹係國位。",
        "translation": "In the tenth month he was expecting to give birth to a boy, who assumed the throne of his country.",
        "source": "T03n0156_003:0139c08_5"
    },
    {
        "source_sentence": "月滿產生，生一蓮華。",
        "translation": "When the moon is full, a lotus flower grows.",
        "source": "T03n0156_003:0139c09_6"
    },
    {
        "source_sentence": "仙人呪力令王瞋恚，而作是言：『畜生所生，故不妄也。』",
        "translation": "The sage's power of the spell made the king angry and said, 'It's not false because it's produced by animals.'",
        "source": "T03n0156_003:0139c10_0"
    },
    {
        "source_sentence": "王即退其夫人職，其蓮華者使人遺棄。",
        "translation": "The king then withdrew his wife's position, leaving the lotus flower behind.",
        "source": "T03n0156_003:0139c11_1"
    },
    {
        "source_sentence": "其後數日，波羅奈王將諸群臣入後園中，遊戲觀看，作倡伎樂，鬪其象馬，",
        "translation": "Several days later, King Vārāṇasī entered the rear garden with his ministers to enjoy amusement in the park. They played music and argued among the elephants and horses of the royal family.",
        "source": "T03n0156_003:0139c12_2"
    },
    {
        "source_sentence": "并諸力士。",
        "translation": "He's accompanied by the strong men.",
        "source": "T03n0156_003:0139c13_3"
    },
    {
        "source_sentence": "中有第一大力士，踉[跳-兆+旁]顛蹶，以足蹴地，地皆震動，動蓮華池。",
        "translation": "In the middle was the first great man of great strength, who trembled and tumbled. He stepped on the ground with his feet; the earth shook and the lotus-flower pond trembled.",
        "source": "T03n0156_003:0139c14_4"
    },
    {
        "source_sentence": "其華池邊有大珊瑚，於珊瑚下有一蓮華迸墮水中。",
        "translation": "Beside the flower pond, there's a large coral, and beneath that coral is a lotus blossom that bursts into the water.",
        "source": "T03n0156_003:0139c15_5"
    },
    {
        "source_sentence": "其華紅赤，有妙光明。",
        "translation": "The flowers are red and crimson in color, shining brilliantly.",
        "source": "T03n0156_003:0139c16_6"
    },
    {
        "source_sentence": "王見此華，心生歡喜，問群臣言：『如此華者，未曾有也。』",
        "translation": "Seeing this flower, the king rejoiced and asked the ministers, 'Such flowers are unprecedented.'",
        "source": "T03n0156_003:0139c17_7"
    },
    {
        "source_sentence": "即使使者入池取之。",
        "translation": "Even so, the messenger went into the pond to get it.",
        "source": "T03n0156_003:0139c18_8"
    },
    {
        "source_sentence": "其華具足有五百葉，於一葉下有一童男，面首端正，形狀妙好。",
        "translation": "The flower had five hundred petals, and under each petal there was a young boy with a handsome countenance and beautiful features.",
        "source": "T03n0156_003:0139c19_9"
    },
    {
        "source_sentence": "爾時使者即前白王：『此蓮華者未曾有也。",
        "translation": "The messenger then went forward and said to the king, 'This lotus flower is unprecedented.",
        "source": "T03n0156_003:0139c20_10"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T03n0156_003:0139c21_11"
    },
    {
        "source_sentence": "當知其蓮華者具五百葉，於一葉下有一天童男。』",
        "translation": "You should know that the lotus has five hundred leaves, and there's a boy under one leaf.'",
        "source": "T03n0156_003:0139c21_12"
    },
    {
        "source_sentence": "王聞此語，心驚毛竪，慨歎所以，問使者言：『審實爾耶？",
        "translation": "When the king heard these words, his hair stood on end in fear and he wondered why. He asked the messengers, “Is this true?",
        "source": "T03n0156_003:0139c22_13"
    },
    {
        "source_sentence": "此非是我鹿母夫人所生華也？』",
        "translation": "Isn't this the flower produced by my wife, Mother of Deer?'",
        "source": "T03n0156_003:0139c23_14"
    },
    {
        "source_sentence": "即問青衣：『鹿母夫人所生華者，遺棄何處？』",
        "translation": "He asked the blue-robed man, 'Where's the place where the flowers produced by Lady Deer Mother will be abandoned?'",
        "source": "T03n0156_003:0139c24_15"
    },
    {
        "source_sentence": "答言：『大王！",
        "translation": "He replied, 'Great king!",
        "source": "T03n0156_003:0139c25_16"
    },
    {
        "source_sentence": "埋此池邊大珊瑚下。』",
        "translation": "He buried it under the great coral at the side of this pond.'",
        "source": "T03n0156_003:0139c25_17"
    },
    {
        "source_sentence": "王審實其事，知鹿母夫人所生。",
        "translation": "The king examined the true facts and knew that he had been born to Lady Lumbinī.",
        "source": "T03n0156_003:0139c26_18"
    },
    {
        "source_sentence": "王自入宮，向鹿母夫人自責悔過，而作是言：『我實愚癡無智，不識賢良，",
        "translation": "The king entered the palace himself and repented of his sins to Lady Lumbinī. He said, “I am really stupid and ignorant, not knowing what is good or bad.",
        "source": "T03n0156_003:0139c27_19"
    },
    {
        "source_sentence": "橫生惡賤，違逆夫人。』",
        "translation": "They'll give rise to bad and inferior conditions that disobey their wives.'",
        "source": "T03n0156_003:0139c28_20"
    },
    {
        "source_sentence": "懺謝訖已，還復本位。",
        "translation": "After he had made his confession, he returned to his original posture.",
        "source": "T03n0156_003:0139c29_21"
    },
    {
        "source_sentence": "王大歡喜，召諸群臣、諸小國王并諸婆羅門相師，一切集會。",
        "translation": "The king was greatly delighted, summoned his ministers, the kings of the small countries, and the brāhmaṇa teachers to assemble.",
        "source": "T03n0156_003:0139c29_22"
    },
    {
        "source_sentence": "抱五百太子，使諸相師占相吉凶，卦曰：『道德所歸，國蒙其福。",
        "translation": "He embraced the five hundred princes and asked the soothsayers to divine the fortune and misfortune of their appearance. The trigram said, 'I take refuge in morality, and my country will receive its blessedness.",
        "source": "T03n0156_003:0140a02_23"
    },
    {
        "source_sentence": "若在家者，四海顒顒，鬼神保之；",
        "translation": "Those who remain householders are protected by the four great oceans of deities and spirits.",
        "source": "T03n0156_003:0140a03_24"
    },
    {
        "source_sentence": "若出家者，必斷生死，超度欲流，越生死海，獲得三明六通，具四道果。』",
        "translation": "If someone leaves home, they'll surely end birth and death, transcend the flow of desire, cross the ocean of birth and death, attain the three insights and six supernormal powers, and have the fruit of the four paths.'",
        "source": "T03n0156_003:0140a04_25"
    },
    {
        "source_sentence": "王聞是語，遂增歡喜，即遍宣令國土，選取五百乳母。",
        "translation": "Having heard these words, the king was greatly delighted and immediately ordered all the kingdoms to select five hundred nursing maids.",
        "source": "T03n0156_003:0140a05_26"
    },
    {
        "source_sentence": "「爾時鹿母夫人白大王言：『王莫耗擾國土，召諸乳母。",
        "translation": "It was then that the deer mother said to the king, 'Don't trouble the king with his land; summon the milkmaids.",
        "source": "T03n0156_003:0140a08_0"
    },
    {
        "source_sentence": "王宮中自有五百夫人。",
        "translation": "In the king's palace, there were five hundred wives.",
        "source": "T03n0156_003:0140a09_1"
    },
    {
        "source_sentence": "諸夫人者妬我生男。",
        "translation": "The ladies are jealous of me and give birth to a man.",
        "source": "T03n0156_003:0140a09_2"
    },
    {
        "source_sentence": "王今可以一太子與一夫人，令其乳哺，非其子耶？』",
        "translation": "Now, the king can give one prince and one wife to feed them with milk, isn't it his son?'",
        "source": "T03n0156_003:0140a10_3"
    },
    {
        "source_sentence": "王報夫人：『五百夫人常懷嫉妬，惱害鹿母。",
        "translation": "The king reported to his wife, 'The five hundred wives always harbored jealousy and harmed the mother of the deer.",
        "source": "T03n0156_003:0140a11_4"
    },
    {
        "source_sentence": "鹿母今者欲令我鞭打杖策，擯出驅遣，奪其命者，不逆夫人。",
        "translation": "The mother of the deer now wishes to have me whipped, beaten, and caned her with a stick. If you drive her out and drive her away but take her life, she won’t go against my wife.",
        "source": "T03n0156_003:0140a12_5"
    },
    {
        "source_sentence": "夫人今者云何於怨嫌中放捨？",
        "translation": "Now, how did the wife abandon her in the midst of enmity?",
        "source": "T03n0156_003:0140a13_6"
    },
    {
        "source_sentence": "此事甚難及也。",
        "translation": "This is a very difficult thing to reach.",
        "source": "T03n0156_003:0140a14_7"
    },
    {
        "source_sentence": "又復能開天地之恩，以其太子與諸夫人。』",
        "translation": "Again, he's able to uncover the blessings of heaven and earth with his prince and his wives.'",
        "source": "T03n0156_003:0140a14_8"
    },
    {
        "source_sentence": "「爾時五百夫人心大歡喜：『鹿母夫人施我安隱快樂，云何復能以太子與我？』",
        "translation": "At that point, the five hundred wives were greatly delighted, saying, 'The wife of the deer mother gave me peace and happiness, so how could she give it to me with a prince?'",
        "source": "T03n0156_003:0140a16_0"
    },
    {
        "source_sentence": "歡喜無量。",
        "translation": "The joy is immeasurable.",
        "source": "T03n0156_003:0140a17_1"
    },
    {
        "source_sentence": "爾時無量百千大眾聞是事已，心生歡喜，皆發道心。",
        "translation": "After hearing this, measureless hundreds of thousands of people in the crowd rejoiced and all aroused the aspiration for enlightenment.",
        "source": "T03n0156_003:0140a18_0"
    },
    {
        "source_sentence": "「爾時大王報夫人言：『未曾有也！",
        "translation": "It was then that the great king reported to his wife, 'That's unprecedented!'",
        "source": "T03n0156_003:0140a20_0"
    },
    {
        "source_sentence": "吾不及汝。』",
        "translation": "I'm not as good as you.'",
        "source": "T03n0156_003:0140a20_1"
    },
    {
        "source_sentence": "夫人言：『貪恚所生，皆由嫉妬。",
        "translation": "The queen said, 'They all arise from craving and anger because of jealousy.",
        "source": "T03n0156_003:0140a20_2"
    },
    {
        "source_sentence": "諫惡以忍，諫怒以順。",
        "translation": "To admonish evil is to tolerate it, and to admonish anger is to follow it.",
        "source": "T03n0156_003:0140a21_3"
    },
    {
        "source_sentence": "我從生已來未曾與物共諍，諸夫人者自生惱害。",
        "translation": "Ever since I was born, I've never shared sexual misconduct with things, and the ladies themselves have caused harm to themselves.",
        "source": "T03n0156_003:0140a22_4"
    },
    {
        "source_sentence": "譬如有人夜行見杌，便起賊想，或起惡鬼之想。",
        "translation": "It's like a person who travels at night and sees lust, so they give rise to thoughts of thieves or bad ghosts.",
        "source": "T03n0156_003:0140a23_5"
    },
    {
        "source_sentence": "尋時驚怖，四散馳走，或投高巖，或覆水火，荊棘叢林傷壞身體。",
        "translation": "Surprised, they scattered in all directions and fled. Some were thrown into a high precipice or covered by water and fire; their bodies were burned to death by thorns and thorns growing in the jungle.",
        "source": "T03n0156_003:0140a24_6"
    },
    {
        "source_sentence": "因妄想故，禍害如是。",
        "translation": "As a result of deluded conceptions, such is the harmfulness.",
        "source": "T03n0156_003:0140a25_7"
    },
    {
        "source_sentence": "一切眾生亦復如是，自生自死，如蠶處繭，如蛾赴燈，無驅馳者。",
        "translation": "So it is with all sentient beings, who are born and die on their own, like silkworms in cocoons or moths going to a lamp without anyone chasing them.",
        "source": "T03n0156_003:0140a26_8"
    },
    {
        "source_sentence": "一切眾惡從妄想起，諸夫人者亦復如是。",
        "translation": "All evils arise from deluded thoughts, and so it is with the ladies.",
        "source": "T03n0156_003:0140a27_9"
    },
    {
        "source_sentence": "我今不應與彼群愚，起諸諍訟。』",
        "translation": "Now, I shouldn't argue with those foolish people.'",
        "source": "T03n0156_003:0140a28_10"
    },
    {
        "source_sentence": "五百夫人即前禮鹿母夫人，自謝悔過，奉事鹿母，如蒙賢聖，如母姉妹，",
        "translation": "The five hundred ladies then went forward to pay their respects to Lady Lumbinī and apologized for their faults. They served the deer’s mother as if she had been endowed with goodness and holiness, just as if they were her",
        "source": "T03n0156_003:0140a29_11"
    },
    {
        "source_sentence": "所養太子，如所生不異。",
        "translation": "The prince he raised was no different from the one he had raised.",
        "source": "T03n0156_003:0140b02_12"
    },
    {
        "source_sentence": "「時五百太子年漸長大。",
        "translation": "At that time, the five hundred princes grew up gradually.",
        "source": "T03n0156_003:0140b02_13"
    },
    {
        "source_sentence": "一一太子力敵一千，隣國反叛不賓屬者，自往伐之；",
        "translation": "Each prince was defeated by one thousand enemies, and the neighboring kings who rebelled against each other and did not have their retinues came to attack him.",
        "source": "T03n0156_003:0140b03_14"
    },
    {
        "source_sentence": "不起四兵，國土安隱；",
        "translation": "The four armies won’t arise and the land will be peaceful.",
        "source": "T03n0156_003:0140b04_15"
    },
    {
        "source_sentence": "天神歡喜，風雨以時，人民豐壤熾盛。",
        "translation": "The gods and goddesses were delighted, and the wind and rain came at the right time. The people lived in abundance and the soil flourished vigorously.",
        "source": "T03n0156_003:0140b05_0"
    },
    {
        "source_sentence": "時五百太子乘大名象，林野觀看；",
        "translation": "At that time five hundred princes rode the greatly renowned elephant and looked around in the woods and fields.",
        "source": "T03n0156_003:0140b05_1"
    },
    {
        "source_sentence": "遊戲自恣，快樂難量；",
        "translation": "The pleasures they experience are immeasurable.",
        "source": "T03n0156_003:0140b06_2"
    },
    {
        "source_sentence": "父母愛念，如護眼目。",
        "translation": "Their parents love and care for them like protecting their eyes.",
        "source": "T03n0156_003:0140b07_3"
    },
    {
        "source_sentence": "「爾時五百太子年漸長大，於後一時集一處，坐蓮華池邊，見其形容，",
        "translation": "“At that time the five hundred princes grew up and at one time assembled in one place to sit beside the lotus-flower pond, seeing their appearance.",
        "source": "T03n0156_003:0140b07_4"
    },
    {
        "source_sentence": "水底影現。",
        "translation": "The shadow appears at the water's bottom.",
        "source": "T03n0156_003:0140b09_5"
    },
    {
        "source_sentence": "時諸太子共相謂言：『一切諸法，如幻如化，如夢所見，如水中形，體無真實。",
        "translation": "The princes then said to each other: All things are like illusions, like magic tricks, like dreams, like shapes in water, without substance or reality.",
        "source": "T03n0156_003:0140b09_6"
    },
    {
        "source_sentence": "我等今者，亦復如是。",
        "translation": "So it is with us now.",
        "source": "T03n0156_003:0140b11_7"
    },
    {
        "source_sentence": "雖復豪尊，處在深宮，五欲自恣。",
        "translation": "Even so, the noble one was deep in his palace and indulged in the five desires on his own.",
        "source": "T03n0156_003:0140b11_8"
    },
    {
        "source_sentence": "壯年美色不可久保；",
        "translation": "Their vigor and beauty cannot be sustained for long.",
        "source": "T03n0156_003:0140b12_9"
    },
    {
        "source_sentence": "物成有敗，人生有死；",
        "translation": "When things are formed, there is decay; when they arise, there is birth and death.",
        "source": "T03n0156_003:0140b12_10"
    },
    {
        "source_sentence": "少壯不久，會當有老；",
        "translation": "Soon after his youthful vigor will grow, and there will be old age.",
        "source": "T03n0156_003:0140b13_11"
    },
    {
        "source_sentence": "飯食不節，會得有病；",
        "translation": "If one eats food in moderation he will surely experience illness.",
        "source": "T03n0156_003:0140b13_12"
    },
    {
        "source_sentence": "百年壽命，會當有死。』",
        "translation": "With a hundred years of life, there will be death in the assembly.'",
        "source": "T03n0156_003:0140b14_13"
    },
    {
        "source_sentence": "諸太子即愁憂不樂，不能飲食，即還宮殿，白父母言：『世界皆苦，無可樂者。",
        "translation": "The princes were so distressed and unhappy that they couldn't eat or drink. They returned to their palace and said to their parents, 'All the world is painful; there's nothing to enjoy.",
        "source": "T03n0156_003:0140b14_14"
    },
    {
        "source_sentence": "父母今者，聽我等出家。』",
        "translation": "Now, my parents, listen to us as we leave home.'",
        "source": "T03n0156_003:0140b16_15"
    },
    {
        "source_sentence": "王報太子：『生老病死，一切共有，汝何以獨愁？』",
        "translation": "The king reported to the prince, 'Birth, old age, illness, and death are all shared; why are you alone in sorrow?'",
        "source": "T03n0156_003:0140b17_0"
    },
    {
        "source_sentence": "白父王言：『不能復以死受生，勞我精神，周遍五道。』",
        "translation": "He said to his father, 'The king said, 'I can't be born again because of death; it troubles my spirit and pervades the five destinies.'",
        "source": "T03n0156_003:0140b18_1"
    },
    {
        "source_sentence": "王不忍拒，即便聽許。",
        "translation": "The king couldn't bear to reject it, and he even agreed to allow it.",
        "source": "T03n0156_003:0140b19_2"
    },
    {
        "source_sentence": "母報子言：『汝出家者，莫捨我遠去，可於後園。",
        "translation": "The mother said to her children, “If you renounce the householder’s life, do not abandon me.",
        "source": "T03n0156_003:0140b19_3"
    },
    {
        "source_sentence": "其中清淨，林木茂盛，四事供養，不令乏少。』",
        "translation": "It's pure, with luxuriant forests and trees that provide four kinds of offerings so they don't lack.'",
        "source": "T03n0156_003:0140b20_4"
    },
    {
        "source_sentence": "「時諸太子即便出家，受其母請，住後園中。",
        "translation": "The princes then left home, accepted their mother's invitation, and stayed in the back garden.",
        "source": "T03n0156_003:0140b21_5"
    },
    {
        "source_sentence": "一一太子皆得辟支佛道，如是次第四百九十九太子皆得道果。",
        "translation": "Each prince attained the path of the pratyekabuddha, and so did the other four hundred and ninety-nine princes attain the fruit of the path.",
        "source": "T03n0156_003:0140b22_6"
    },
    {
        "source_sentence": "往詣宮中，至父母前，報言父母：『出家利益，今已獲得。』",
        "translation": "He went to the palace, arrived before his parents, and reported to their parents, 'The benefits of leaving home have now been obtained.'",
        "source": "T03n0156_003:0140b24_7"
    },
    {
        "source_sentence": "時諸比丘身昇虛空，東踊西沒，西踊東沒，南踊北沒，北踊南沒。",
        "translation": "The bhikṣus then ascended up into the sky in an east-facing  midair and sank down in a west-facing direction. In the west-facing  midair they sank down in an east-facing direction, in the south",
        "source": "T03n0156_003:0140b25_8"
    },
    {
        "source_sentence": "或作大身滿虛空中，復以一身作無量身；",
        "translation": "Or they may make a great body filling space, or another body forming an infinite body with one body.",
        "source": "T03n0156_003:0140b26_9"
    },
    {
        "source_sentence": "或身上出水，身下出火；",
        "translation": "Sometimes water emerges from their bodies and fire emerges from under their bodies.",
        "source": "T03n0156_003:0140b27_10"
    },
    {
        "source_sentence": "身下出水，身上出火。",
        "translation": "Water came out from under his body, and fire came out of his body.",
        "source": "T03n0156_003:0140b28_11"
    },
    {
        "source_sentence": "為其父母作種種神變已，即便燒身，取般泥洹。",
        "translation": "After performing various miraculous transformations for his parents, he burned his body and took parinirvāṇa.",
        "source": "T03n0156_003:0140b28_12"
    },
    {
        "source_sentence": "時鹿母夫人收取身骨，於後園中，即起四百九十九塔供養。",
        "translation": "The deer mother then collected the bones of her body and placed them in the rear garden, whereupon she erected 4,099 stūpas to make offerings.",
        "source": "T03n0156_003:0140c01_0"
    },
    {
        "source_sentence": "最小太子過九十日已，亦得辟支佛道，亦為父母現大神變，現神變已即取泥洹。",
        "translation": "After ninety days had passed, the youngest prince also attained the path of the pratyekabuddhas and manifested a great miracle for his parents. Having done so, he then entered nirvana.",
        "source": "T03n0156_003:0140c02_1"
    },
    {
        "source_sentence": "爾時其母收取身骨，起塔供養。",
        "translation": "It was then that his mother collected the body's bones and raised a stūpa to make offerings.",
        "source": "T03n0156_003:0140c04_2"
    },
    {
        "source_sentence": "「爾時鹿母夫人燒眾名香，作妙伎樂，日日入後園中，供養是五百辟支佛塔。",
        "translation": "At the time, Lady Lumbinī burned many famous incenses and created marvelous music. Day after day she went into the back garden to make offerings to the five hundred pratyekabuddha stūpas.",
        "source": "T03n0156_003:0140c04_3"
    },
    {
        "source_sentence": "於其塔前愁憂不樂，而作是言：『我雖生是五百太子，雖復出家，而無一人能發菩提之心。』",
        "translation": "In front of that stūpa, he was sad and unhappy, saying, 'Even though I've been born to these five hundred princes, there's no one who can give rise to the mind of enlightenment even though they've left",
        "source": "T03n0156_003:0140c06_4"
    },
    {
        "source_sentence": "即立誓願：『我供養是五百辟支佛，并起五百塔，供養舍利功德，悉以迴向普及一切眾生。",
        "translation": "He then made a vow, saying, 'I'll make offerings to these five hundred pratyekabuddhas, build five hundred stūpas, and offer the merit of Śāriputra's relics to all sentient beings by dedicating them",
        "source": "T03n0156_003:0140c08_5"
    },
    {
        "source_sentence": "令我來世不用多生諸子，而不能發菩提之心，但生一子能發道心，現世出家，",
        "translation": "In the future, I won’t need many children to give rise to my aspiration for enlightenment but will give birth to just one child who will give rise to my aspiration for enlightenment.",
        "source": "T03n0156_003:0140c10_6"
    },
    {
        "source_sentence": "得一切智。』」",
        "translation": "They attain omniscience.'",
        "source": "T03n0156_003:0140c12_7"
    },
    {
        "source_sentence": "佛告阿難：「爾時鹿母夫人者，今摩耶夫人是。",
        "translation": "The Buddha told Ānanda, At the time, that wife of the deer mother was now Mrs. Māyā.",
        "source": "T03n0156_003:0140c13_0"
    },
    {
        "source_sentence": "摩耶夫人供養五百辟支佛，及修無量善業，是故今者得生如來身。」",
        "translation": "Lady Maya made offerings to the five hundred pratyekabuddhas and cultivated measureless good actions, so now she's able to give rise to the Tathāgata's body.",
        "source": "T03n0156_003:0140c14_1"
    },
    {
        "source_sentence": "佛說此法時，有無量百千人天，得初道果乃至四果。",
        "translation": "When the Buddha taught this teaching, measureless hundreds of thousands of gods attained the fruit of the first path up to the fourth fruit.",
        "source": "T03n0156_003:0140c15_2"
    },
    {
        "source_sentence": "有無量眾生，發阿耨多羅三藐三菩提心。",
        "translation": "Countless sentient beings aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0156_003:0140c16_3"
    },
    {
        "source_sentence": "爾時阿難白佛言：「世尊！",
        "translation": "It was then that Ānanda said to the Buddha, Bhagavān!",
        "source": "T03n0156_003:0140c18_0"
    },
    {
        "source_sentence": "摩耶夫人過去世時造何業行，生畜生中為鹿女也？」",
        "translation": "What actions did Lady Maya create in a past life that gave rise to being born among animals as a deer-maiden?",
        "source": "T03n0156_003:0140c18_1"
    },
    {
        "source_sentence": "佛告阿難：「善聽！",
        "translation": "The Buddha told Ānanda, Listen well!",
        "source": "T03n0156_003:0140c19_2"
    },
    {
        "source_sentence": "吾當為汝分別解說摩耶夫人宿世行業因緣。",
        "translation": "I will explain for you the causes and conditions of Lady Māyā’s past actions.",
        "source": "T03n0156_003:0140c20_3"
    },
    {
        "source_sentence": "乃往過去無量阿僧祇劫，爾時有佛出世，號毘婆尸如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "At that time a buddha named Vipaśyin Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, Tamer of Humans, Teacher of",
        "source": "T03n0156_003:0140c21_4"
    },
    {
        "source_sentence": "在世教化。",
        "translation": "It's in the world to teach and transform.",
        "source": "T03n0156_003:0140c24_0"
    },
    {
        "source_sentence": "滅度之後，於像法中，爾時有國號波羅奈。",
        "translation": "After his parinirvāṇa, there was a country named Vārāṇasī in the image Dharma at that time.",
        "source": "T03n0156_003:0140c24_1"
    },
    {
        "source_sentence": "其國有一婆羅門，唯生一女。",
        "translation": "In that country there was a brahman who had only one daughter.",
        "source": "T03n0156_003:0140c25_2"
    },
    {
        "source_sentence": "其父命終，婆羅門婦養育此女，年轉長大。",
        "translation": "When her father died, the brahman’s wife raised the daughter and she grew up into an adult.",
        "source": "T03n0156_003:0140c25_3"
    },
    {
        "source_sentence": "其家唯有一果園，其母以女守園，自往求食。",
        "translation": "In that house there was only one fruit grove. The mother, who guarded the grove with her daughters, went out on her own to solicit food.",
        "source": "T03n0156_003:0140c26_4"
    },
    {
        "source_sentence": "既自食已，後為其女而送食分，日日如是。",
        "translation": "After he had eaten it himself, he then sent the food portion for his daughter, and so did day after day.",
        "source": "T03n0156_003:0140c27_5"
    },
    {
        "source_sentence": "其母一日而便稽遲，過時不與。",
        "translation": "One day, his mother was late and didn't give it to him when the time passed.",
        "source": "T03n0156_003:0140c28_6"
    },
    {
        "source_sentence": "其女悒遲，飢渴所逼，而便恚心言：『我母今日何因緣故，不與我食，",
        "translation": "The queen, overcome by hunger and thirst, said earnestly to her mother, “What prevented you from giving me food today?",
        "source": "T03n0156_003:0140c29_7"
    },
    {
        "source_sentence": "不來見看。』",
        "translation": "They won't come to see and look at it.'",
        "source": "T03n0156_003:0141a02_8"
    },
    {
        "source_sentence": "乃至煩惋再三，尋復恚言：『我母今者不如畜生。",
        "translation": "Up to the third time he was overcome with grief, he looked around and said, 'My mother isn't like an animal now.",
        "source": "T03n0156_003:0141a02_9"
    },
    {
        "source_sentence": "我見畜獸野鹿，子飢渴時，心不捨離。』",
        "translation": "I see animals, wild animals, and deer, and when my children are hungry and thirsty, their minds aren't abandoned.'",
        "source": "T03n0156_003:0141a03_10"
    },
    {
        "source_sentence": "如是未久，母持食至。",
        "translation": "Soon after this, his mother came with food.",
        "source": "T03n0156_003:0141a04_11"
    },
    {
        "source_sentence": "正欲飲食，有一辟支佛沙門，從南方來，飛空北過。",
        "translation": "When he was about to eat and drink, there was a pratyekabuddha ascetic who came from the south and flew north in the sky.",
        "source": "T03n0156_003:0141a04_12"
    },
    {
        "source_sentence": "爾時其女見此比丘，心生歡喜，即起合掌，頭面作禮，即便請之，為敷淨座，",
        "translation": "At that moment, seeing this bhikṣu, the queen was overjoyed. She stood up and greeted him with her palms joined together in respect. Then she invited him to sit on a clean seat.",
        "source": "T03n0156_003:0141a06_0"
    },
    {
        "source_sentence": "取好妙華，減其食分，奉施比丘。",
        "translation": "He took the good and wonderful flowers, reduced his portion of food, and offered it to the monk.",
        "source": "T03n0156_003:0141a07_1"
    },
    {
        "source_sentence": "比丘食已，為說妙法，示教利喜。",
        "translation": "After he had eaten, the monk explained the wonderful teaching for him, showing it to benefit and delight in it.",
        "source": "T03n0156_003:0141a08_2"
    },
    {
        "source_sentence": "爾時其女即發願言：『願我來世，遭遇賢聖，禮事供養，使我面首端正，",
        "translation": "It was then that the queen’s daughter made a vow, “May I attain enlightenment in the future lives of all sages and goddesses by honoring and serving them.",
        "source": "T03n0156_003:0141a09_3"
    },
    {
        "source_sentence": "尊榮豪貴，若經行時，蓮華承足。』」",
        "translation": "When he walks, the lotus bears his feet when he's venerated and noble.'",
        "source": "T03n0156_003:0141a10_4"
    },
    {
        "source_sentence": "佛告阿難：「爾時女者，鹿母夫人是。",
        "translation": "The Buddha told Ānanda, That woman at that time was the wife of the deer mother.",
        "source": "T03n0156_003:0141a12_0"
    },
    {
        "source_sentence": "以其一食，淨華覆上，施辟支佛，五百世中尊榮豪貴，衣食自然，蓮華承足。",
        "translation": "He gave one food, covered with pure flowers, to the pratyekabuddhas who had been honored and wealthy for five hundred world ages. Their clothing and food came naturally from the lotus blossoms that supported their feet.",
        "source": "T03n0156_003:0141a12_1"
    },
    {
        "source_sentence": "願力因緣，今得值五百辟支佛禮事供養。",
        "translation": "Because of the power of their vow, they've now been able to meet five hundred pratyekabuddhas and venerate and make offerings to them.",
        "source": "T03n0156_003:0141a14_2"
    },
    {
        "source_sentence": "爾時以一惡言，不知其恩，毀罵其母，喻如畜生，以是惡口因緣，五百身中生鹿腹中。」",
        "translation": "At the time, he spoke one bad thing, didn't know his kindness, disparaged his mother, and resented her like an animal; because of these bad words, he was born in the belly of a deer in five hundred bodies.",
        "source": "T03n0156_003:0141a15_3"
    },
    {
        "source_sentence": "佛告阿難：「人生世間，禍從口生，當護於口，甚於猛火。",
        "translation": "The Buddha said to Ānanda: When one is born in the world, woe arises from his mouth. You should guard your mouth; it will be as fierce as a blazing fire.",
        "source": "T03n0156_003:0141a17_4"
    },
    {
        "source_sentence": "猛火熾然能燒一世，惡口熾然燒無數世；",
        "translation": "A blazing fire can burn a period of time; a blazing wicked word burns countless worlds.",
        "source": "T03n0156_003:0141a18_5"
    },
    {
        "source_sentence": "猛火熾然燒世間財，惡口熾然燒七聖財。",
        "translation": "A fierce fire blazes and burns worldly possessions, and a raging fire blazes and burns seven noble possessions.",
        "source": "T03n0156_003:0141a19_6"
    },
    {
        "source_sentence": "是故阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T03n0156_003:0141a20_7"
    },
    {
        "source_sentence": "一切眾生禍從口出。",
        "translation": "All the calamities of all sentient beings emanate from their mouths.",
        "source": "T03n0156_003:0141a20_8"
    },
    {
        "source_sentence": "口舌者，鑿身之斧，滅身之禍。」",
        "translation": "The mouth and tongue are the axe that cuts through the body and extinguishes the harm of the body.",
        "source": "T03n0156_003:0141a21_9"
    },
    {
        "source_sentence": "佛說此經時，有千優婆塞、優婆夷慎護口過，即得初果。",
        "translation": "When the Buddha taught this sūtra, a thousand laymen and laywomen guarded their mouths with caution, and they attained the first realization.",
        "source": "T03n0156_003:0141a22_10"
    },
    {
        "source_sentence": "復有無量比丘、比丘尼得初道果乃至四果；",
        "translation": "“Furthermore, there were also innumerable monks and nuns who had attained the fruit of the first path up to the fourth fruit.",
        "source": "T03n0156_003:0141a23_11"
    },
    {
        "source_sentence": "無量人天皆發阿耨多羅三藐三菩提心，乃至辟支佛心。",
        "translation": "Measureless people and gods all give rise to the mind of unsurpassed, correct, and complete enlightenment, up to the mind of a pratyekabuddha.",
        "source": "T03n0156_003:0141a24_12"
    },
    {
        "source_sentence": "一切大眾聞佛說法，歡喜奉行，作禮而去。",
        "translation": "The whole assembly, having heard the Buddha’s exhortation, was delighted and remembered it well. Having venerated him, they departed.",
        "source": "T03n0156_003:0141a25_13"
    },
    {
        "source_sentence": "爾時世尊與阿難入王舍城，乞食已，還出城，於城門外有大深坑。",
        "translation": "It was then that the Bhagavān and Ānanda entered the city of Rājagṛha, begged for food, and returned out of the city. Outside the city gates there was a large and deep pit.",
        "source": "T03n0156_003:0141a27_0"
    },
    {
        "source_sentence": "時王舍城人擔持大小便利，棄是坑中，天雨惡水亦入其中。",
        "translation": "The people of Rājagṛha then carried their large and small conveniences and abandoned them in the pit, and bad water rained down from heaven into it.",
        "source": "T03n0156_003:0141a28_1"
    },
    {
        "source_sentence": "爾時此洸水中有一虫，其形似人，眾多手足，遙見如來，擎頭出水，視於如來，",
        "translation": "At that time there was a worm in the water in the pool, shaped like a human being with many arms and legs. Seeing the Buddha from a distance, it raised its head to offer water and looked at him.",
        "source": "T03n0156_003:0141a29_2"
    },
    {
        "source_sentence": "流淚滿目。",
        "translation": "His eyes are covered with tears.",
        "source": "T03n0156_003:0141b02_3"
    },
    {
        "source_sentence": "如來見已，愍而哀傷，慘然不悅，即還耆闍崛山。",
        "translation": "Seeing this sight, the Tathāgata felt pity and grief. Being distressed and unhappy, he immediately returned to Mount Gṛdhrakūṭa.",
        "source": "T03n0156_003:0141b02_4"
    },
    {
        "source_sentence": "爾時，阿難敷尼師檀。",
        "translation": "At the time, Ānanda spread out a nun's sandalwood mat.",
        "source": "T03n0156_003:0141b04_5"
    },
    {
        "source_sentence": "如來坐上，結加趺坐。",
        "translation": "The Tathāgata sat cross-legged on the seat.",
        "source": "T03n0156_003:0141b04_6"
    },
    {
        "source_sentence": "爾時，阿難觀察眾心，問如來言：「世尊！",
        "translation": "At that point, Ānanda examined the minds of the crowd and asked the Tathāgata, Bhagavān!",
        "source": "T03n0156_003:0141b05_7"
    },
    {
        "source_sentence": "向所見洸屎中虫者，先世造何業行？",
        "translation": "What's the karma that was created in a previous life when you saw an insect in cow dung?",
        "source": "T03n0156_003:0141b05_8"
    },
    {
        "source_sentence": "生此水中，為幾時耶？",
        "translation": "At how many moments are they born in this water?",
        "source": "T03n0156_003:0141b06_9"
    },
    {
        "source_sentence": "復於何時當得解脫？」",
        "translation": "At what point will he again attain liberation?",
        "source": "T03n0156_003:0141b07_10"
    },
    {
        "source_sentence": "佛告阿難及諸大眾：「汝等善聽！",
        "translation": "The Buddha told Ānanda and the crowd, Listen well!",
        "source": "T03n0156_003:0141b07_11"
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T03n0156_003:0141b08_12"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T03n0156_003:0141b08_13"
    },
    {
        "source_sentence": "乃往過去無量千劫，爾時有佛出興于世。",
        "translation": "Countless thousands of eons ago, a buddha emerged in the world at that time.",
        "source": "T03n0156_003:0141b08_14"
    },
    {
        "source_sentence": "教化已周，遷神涅槃。",
        "translation": "Having completed his instruction, the Master passed away in a spirit of nirvana.",
        "source": "T03n0156_003:0141b09_15"
    },
    {
        "source_sentence": "滅度之後，於像法中有一婆羅門，造立僧房，供養眾僧。",
        "translation": "After his parinirvāṇa, there was a Brāhmaṇa who built a monk's quarters for the saṃgha in the image dharma and made offerings to the saṃgha.",
        "source": "T03n0156_003:0141b10_16"
    },
    {
        "source_sentence": "時有檀越多送酥油，時有客比丘來。",
        "translation": "At the time, there was a large amount of sandalwood and butter to send, and at the time, a guest monk came.",
        "source": "T03n0156_003:0141b11_17"
    },
    {
        "source_sentence": "爾時知事維那心生瞋恚，嫌客僧來多，隱匿酥油，停持不與。",
        "translation": "At the time, the  confessor Vimalakīrti became angry and disliked the large number of guest monks who came, hid the butter and stopped holding it and didn't give it to him.",
        "source": "T03n0156_003:0141b12_18"
    },
    {
        "source_sentence": "客眾僧言：『何不付酥油蜜耶？』",
        "translation": "The guest monks said, 'Why don't you pay for the butter and honey?'",
        "source": "T03n0156_003:0141b13_19"
    },
    {
        "source_sentence": "維那答言：『汝客我舊。』",
        "translation": "Vairocana replied, 'You're guesting on my old one.'",
        "source": "T03n0156_003:0141b14_20"
    },
    {
        "source_sentence": "客比丘言：『此是檀越施現前僧。』",
        "translation": "The guest monk said, 'This is the donor's donation to the present saṃgha.'",
        "source": "T03n0156_003:0141b15_21"
    },
    {
        "source_sentence": "爾時維那兇惡可畏，即便罵詈：『汝何不噉屎尿也！",
        "translation": "At the time, Vairocana was terrifying and fearful, and he even scolded him, 'Why don't you eat excrement and urine?'",
        "source": "T03n0156_003:0141b15_22"
    },
    {
        "source_sentence": "云何從我乃索酥油。』",
        "translation": "How did you ask for the butter and oil from me?'",
        "source": "T03n0156_003:0141b17_23"
    },
    {
        "source_sentence": "以此惡言，從是已來九十億劫，常生於是洸水之中。",
        "translation": "Because of these bad words, they've always been born in this river for nine billion eons since then.",
        "source": "T03n0156_003:0141b17_24"
    },
    {
        "source_sentence": "爾時維那者，今此洸水中虫，是由過去世發一惡言，訶罵眾僧，無量千世住此屎中。」",
        "translation": "It was then that Vaiśravaṇa, the present-day worm in this bathing water, spoke bad words in a past life to scold the saṃgha and lived in this dung for measureless thousands of years.",
        "source": "T03n0156_003:0141b18_25"
    },
    {
        "source_sentence": "佛告諸弟子：「當護於口，口之過患，甚於猛火。",
        "translation": "The Buddha told his disciples, You must guard your mouth, for the faults and dangers of your mouth are as great as a fierce fire.",
        "source": "T03n0156_003:0141b20_26"
    },
    {
        "source_sentence": "父母眾僧，宜應讚歎軟語，常念其恩。",
        "translation": "It's advisable for parents and other monks to praise their gentle words and always think of their kindness.",
        "source": "T03n0156_003:0141b21_27"
    },
    {
        "source_sentence": "眾僧者，出三界之福田；",
        "translation": "The community of monks is a field of blessings from the three realms.",
        "source": "T03n0156_003:0141b22_28"
    },
    {
        "source_sentence": "父母者，三界內最勝福田。",
        "translation": "The parents are the most superior field of merit within the three realms.",
        "source": "T03n0156_003:0141b23_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0156_003:0141b23_30"
    },
    {
        "source_sentence": "眾僧之中，有四雙、八輩、十二賢士，供之得福，進可成道。",
        "translation": "Among the saṃgha, there were four pairs, eight groups, and twelve good men who made offerings to them to attain merit and advance so that they could become monks.",
        "source": "T03n0156_003:0141b24_0"
    },
    {
        "source_sentence": "父母者，十月懷抱，推乾去濕，乳哺長大，教誨技藝，隨時將養，及其出家修得解脫，",
        "translation": "In the tenth month, his parents took him in their arms and pushed him dry and away from moisture. When he grew up to adulthood they fed him milk and taught him arts and crafts so that he could be raised at any time. He renounced",
        "source": "T03n0156_003:0141b25_1"
    },
    {
        "source_sentence": "度生死海，自利兼利一切眾生。」",
        "translation": "They save all sentient beings from the ocean of birth and death, benefiting themselves and all sentient beings at the same time.",
        "source": "T03n0156_003:0141b27_2"
    },
    {
        "source_sentence": "佛告阿難：「父母、眾僧是一切眾生種二福田，所謂人天、泥洹、解脫妙果，",
        "translation": "The Buddha said to Ānanda: “The parents and the Sangha are two fields of blessings for all sentient beings. They are humans, gods, devas, nirvana, and the marvelous fruit of liberation.",
        "source": "T03n0156_003:0141b27_3"
    },
    {
        "source_sentence": "因之得成。」",
        "translation": "It's the cause that makes it possible.",
        "source": "T03n0156_003:0141b29_4"
    },
    {
        "source_sentence": "佛說此經時，無量百千眾生、人及非人，或得初果，乃至四果，或發阿耨多羅三藐三菩提心，",
        "translation": "When the Buddha taught this sutra, countless hundreds of thousands of sentient beings, humans and nonhumans either attained the first realization or even the fourth realization, or aroused the aspiration for unexcelled, perfect enlightenment",
        "source": "T03n0156_003:0141b29_5"
    },
    {
        "source_sentence": "或發聲聞辟支佛心，各各合掌禮佛右遶，歡喜而去。",
        "translation": "Or they may give rise to the minds of śrāvakas and pratyekbuddhas, each joining their palms, venerating the Buddha with their palms together, circling him to his right, rejoicing, and departing.",
        "source": "T03n0156_003:0141c02_6"
    },
    {
        "source_sentence": "復次，波羅奈國有一輔相婆羅門，其家大富，多饒財寶，金銀琉璃、珊瑚虎珀、象馬牛羊、田業僮僕，",
        "translation": "“Furthermore, in the country of Vārāṇasī there was a brāhmaṇa minister. His family was very wealthy and possessed abundant riches such as gold, silver, lapis lazuli, coral, amber, elephants",
        "source": "T03n0156_003:0141c05_0"
    },
    {
        "source_sentence": "在所充足。",
        "translation": "It's in what's abundant.",
        "source": "T03n0156_003:0141c07_1"
    },
    {
        "source_sentence": "年過八十，生一男兒，妙色端正，人相具足。",
        "translation": "He was over eighty years old when he gave birth to a boy of marvelous color and appearance, fully endowed with human features.",
        "source": "T03n0156_003:0141c07_2"
    },
    {
        "source_sentence": "父母歡喜，召諸相師占相吉凶，為其立字，號曰均提。",
        "translation": "His parents rejoiced and summoned the soothsayers to divine the signs of good fortune and bad fortune, and they established a name for him, named Juṇḍi.",
        "source": "T03n0156_003:0141c08_3"
    },
    {
        "source_sentence": "年始七歲，父母愛念，放令出家，往詣剎提利因提羅山，至如來所。",
        "translation": "When he was just seven years old, his parents loved him so much that they ordered him to leave home and went to the Tathāgata’s place on the mountain of kṣatriya-Indra.",
        "source": "T03n0156_003:0141c09_4"
    },
    {
        "source_sentence": "爾時如來四眾圍遶，為諸天龍、鬼神、大眾廣說世論及出世間之法。",
        "translation": "At the time, the Tathāgata was surrounded by four groups of people who spoke extensively about worldly theories and supramundane dharmas for gods, dragons, ghosts, spirits, and the masses.",
        "source": "T03n0156_003:0141c11_5"
    },
    {
        "source_sentence": "時婆羅門白佛言：「世尊！",
        "translation": "The Brāhmaṇa then said to the Buddha, Bhagavān!",
        "source": "T03n0156_003:0141c12_6"
    },
    {
        "source_sentence": "垂老之年生育此兒，世尊大慈普覆一切，今以此兒為佛弟子。」",
        "translation": "In the year of his old age, he gave birth to this child, and the Bhagavān's great compassion covered them all, so now this child is a disciple of the Buddha.",
        "source": "T03n0156_003:0141c13_7"
    },
    {
        "source_sentence": "佛言：「善來比丘！",
        "translation": "The Buddha said, Well-come monk!",
        "source": "T03n0156_003:0141c15_0"
    },
    {
        "source_sentence": "鬚髮自落，袈裟著身。」",
        "translation": "The hair on his beard fell off, and the monk's robe touched his body.",
        "source": "T03n0156_003:0141c15_1"
    },
    {
        "source_sentence": "佛為說法，示教利喜，即得道果，三明六通，具八解脫。",
        "translation": "When the Buddha taught the Dharma for them, he showed them the benefits and joy of the path, which is to attain the fruit of the path, three insights, six supernormal powers, and eight liberations.",
        "source": "T03n0156_003:0141c15_2"
    },
    {
        "source_sentence": "爾時阿難觀察眾心咸皆有疑，即從坐起，整衣服，偏袒右肩，叉手合掌，",
        "translation": "At that moment, observing the minds of all the bhikṣus with doubt, Ānanda rose from his seat, arranged his clothes so as to bare one shoulder and joined his palms in salute.",
        "source": "T03n0156_003:0141c18_0"
    },
    {
        "source_sentence": "白佛言：「世尊！",
        "translation": "He said to the Buddha, Bhagavān!",
        "source": "T03n0156_003:0141c19_1"
    },
    {
        "source_sentence": "均提沙彌，過去世時，作何功德？",
        "translation": "What merit did Kauṇḍinya śrāmaṇer perform in a past life?",
        "source": "T03n0156_003:0141c19_2"
    },
    {
        "source_sentence": "修何行業？",
        "translation": "What activities are cultivated?",
        "source": "T03n0156_003:0141c20_3"
    },
    {
        "source_sentence": "值遇世尊獲得道果，何以速疾？」",
        "translation": "How can you quickly attain the fruit of the path when you meet the Bhagavān?",
        "source": "T03n0156_003:0141c21_0"
    },
    {
        "source_sentence": "佛告阿難：「均提沙彌非適今也。",
        "translation": "The Buddha told Ānanda, It's not appropriate for the śrāmaṇer Kauṇḍinya to do so now.",
        "source": "T03n0156_003:0141c22_0"
    },
    {
        "source_sentence": "過去世時，供養父母眾僧，修妙功德，遇善知識，今得道果。」",
        "translation": "In a past life, he offered support to his parents and the saṃgha, cultivated marvelous virtue, met good friends, and now attained the fruit of the path.",
        "source": "T03n0156_003:0141c22_1"
    },
    {
        "source_sentence": "阿難白佛言：「願佛說之。」",
        "translation": "Ānanda said to the Buddha, May the Buddha explain it.",
        "source": "T03n0156_003:0141c24_2"
    },
    {
        "source_sentence": "佛告阿難：「善聽！",
        "translation": "The Buddha told Ānanda, Listen well!",
        "source": "T03n0156_003:0141c24_3"
    },
    {
        "source_sentence": "乃往過去無量千歲，有佛出世，號毘婆尸，在世教化，利益天人。",
        "translation": "In the past, immeasurable thousands of years ago, a buddha named Vipaśyin appeared in the world to teach and benefit gods and humans.",
        "source": "T03n0156_003:0141c25_4"
    },
    {
        "source_sentence": "化緣已周，遷神涅槃。",
        "translation": "The conditions for his edification had already passed, and he was about to pass into nirvana.",
        "source": "T03n0156_003:0141c26_5"
    },
    {
        "source_sentence": "滅度之後，於正法中，有一年少比丘，通達三藏——所謂阿毘曇藏、毘尼藏、修多羅藏——面首端正，",
        "translation": "After his parinirvāṇa, there was a young bhikṣu of one year in the true-dharma who had thoroughly mastered the three collections - the Abhidharma piṭaka, the Vinaya piṭaka, and the sutra piṭaka.",
        "source": "T03n0156_003:0141c27_6"
    },
    {
        "source_sentence": "人相具足，辯才說法，有妙音聲，多人所識，剎利、婆羅門之所供養。",
        "translation": "The people are endowed with human characteristics and eloquent in preaching the Dharma. They have a wonderful voice that is well known by everyone, and it is offered to them by the kṣatriyas and brāhmaṇas.",
        "source": "T03n0156_003:0141c29_7"
    },
    {
        "source_sentence": "時有一比丘，形體麤醜，人相不豐，加復音聲鈍重，常好讚歎三寶。",
        "translation": "At the time, there was a monk whose body was crude and ugly in shape and his people were not endowed with abundant features. His voice was dull and he always liked to praise the Three Treasures.",
        "source": "T03n0156_003:0142a01_8"
    },
    {
        "source_sentence": "爾時三藏年少比丘見其聲惡，即便毀罵，而作是言：『如是音聲，不如狗吠。』",
        "translation": "Seeing his voice, the young monk of the Tripiṭaka then disparaged it and said, 'Such sounds are not like dogs barking.'",
        "source": "T03n0156_003:0142a03_9"
    },
    {
        "source_sentence": "時老比丘言：『汝何以見毀罵也？",
        "translation": "The old monk then said, 'Why are you criticizing me?'",
        "source": "T03n0156_003:0142a05_10"
    },
    {
        "source_sentence": "汝不識我耶？』",
        "translation": "Don't you know me?'",
        "source": "T03n0156_003:0142a05_11"
    },
    {
        "source_sentence": "三藏年少言：『我識汝，汝是毘婆尸佛正法中摩訶羅老比丘，何以不識？』",
        "translation": "The young monk of the Tripiṭaka said, 'I know you, but why don't you know this old monk Mahāra in the true teaching of Vipaśyin?'",
        "source": "T03n0156_003:0142a06_12"
    },
    {
        "source_sentence": "摩訶羅言：『我所作已辦，梵行已立，不受後有。』",
        "translation": "Mahāra said, 'My work has been done, the religious practice has been established, and I won't accept future existence.'",
        "source": "T03n0156_003:0142a07_13"
    },
    {
        "source_sentence": "三藏比丘聞是語已，心驚毛竪。",
        "translation": "When the Tripiṭaka monks heard these words, their hair stood on end in fear.",
        "source": "T03n0156_003:0142a09_0"
    },
    {
        "source_sentence": "爾時摩訶羅即舉右手，放大光明，普照十方。",
        "translation": "At that point, Mahāra then raised his right hand and radiated a ray of light that shone everywhere in the ten directions.",
        "source": "T03n0156_003:0142a09_1"
    },
    {
        "source_sentence": "爾時三藏即前，頭面接足禮敬，求哀懺悔：『而我愚癡，不識賢聖，作是惡業。",
        "translation": "It was then that the Tripiṭaka went forward, bowed its head and feet at their feet, and begged with pity and repentance, saying, 'I'm foolish, don't know the wise and noble, and did this bad action",
        "source": "T03n0156_003:0142a10_2"
    },
    {
        "source_sentence": "令我來世得近善友，值遇聖師，漏盡結解，亦如大德。』」",
        "translation": "It will cause me to become close to good friends in the future, meet a noble teacher, end the bonds of contamination, and be liberated, just like the great virtuous one.'",
        "source": "T03n0156_003:0142a12_3"
    },
    {
        "source_sentence": "佛告阿難：「爾時，三藏比丘以一惡言訶罵上座，五百身中，常作狗身。」",
        "translation": "The Buddha told Ānanda, At the time, the tripiṭaka monk reprimanded the superior monk with one bad word and made a dog-like appearance in his five hundred bodies.",
        "source": "T03n0156_003:0142a13_4"
    },
    {
        "source_sentence": "一切大眾聞佛說法，皆驚戰悚，俱發聲言：「怪哉！",
        "translation": "All the masses of people who heard the Buddha teach the Dharma were all terrified and cried out in fear, saying, That's amazing!",
        "source": "T03n0156_003:0142a15_5"
    },
    {
        "source_sentence": "怪哉！",
        "translation": "That's amazing!",
        "source": "T03n0156_003:0142a16_6"
    },
    {
        "source_sentence": "世間毒禍莫先於口。」",
        "translation": "The world's poisonous misfortune doesn't come first from the mouth.",
        "source": "T03n0156_003:0142a16_7"
    },
    {
        "source_sentence": "「假使熱鐵輪，　　在我頂上旋，",
        "translation": "“Suppose a hot iron wheel were to circle over my head,",
        "source": "T03n0156_003:0142a17_8"
    },
    {
        "source_sentence": "　終不為此苦，　　而發於惡言。",
        "translation": "They never speak evil for the sake of this suffering.",
        "source": "T03n0156_003:0142a17_8"
    },
    {
        "source_sentence": "　假使熱鐵輪，　　在我頂上旋，",
        "translation": "Suppose a hot iron wheel were to circle over my head.",
        "source": "T03n0156_003:0142a17_8"
    },
    {
        "source_sentence": "　終不為此苦，　　毀聖及善人。」",
        "translation": "They'll never suffer this pain, disparage the noble ones and good people.",
        "source": "T03n0156_003:0142a17_8"
    },
    {
        "source_sentence": "爾時，無量百千人皆立誓願，而說偈言：佛告阿難：「舍利弗者，於諸眾生為善知識，",
        "translation": "Measureless hundreds of thousands of people then made the vow, saying these verses: The Buddha said to Ānanda: O Śāriputra!",
        "source": "T03n0156_003:0142a17_8"
    },
    {
        "source_sentence": "晝夜六時，常以道眼觀五道眾生，所應度者，尋往度之。",
        "translation": "At six o f the day and night, he always observed sentient beings in the five realms of rebirth with the eye of enlightenment. Those who should be liberated looked for and went to liberate them.",
        "source": "T03n0156_003:0142a23_9"
    },
    {
        "source_sentence": "「爾時，摩竭提二國中間有五百賈客，經過嶮路。",
        "translation": "“At the time, there were five hundred merchants between the two countries of Magadha who passed by on a precipitous path.",
        "source": "T03n0156_003:0142a26_0"
    },
    {
        "source_sentence": "時估客主將一白狗。",
        "translation": "At the time, the guest's owner was carrying a white dog.",
        "source": "T03n0156_003:0142a27_1"
    },
    {
        "source_sentence": "爾時伴主初夜煑肉作食。",
        "translation": "It was then that the host of the companions cooked meat and made food for the first night.",
        "source": "T03n0156_003:0142a27_2"
    },
    {
        "source_sentence": "於後夜時，狗偷食之。",
        "translation": "On the latter part of the night, a dog stole and ate it.",
        "source": "T03n0156_003:0142a28_3"
    },
    {
        "source_sentence": "明日，伴主欲早飲食，求之不得，飢渴所逼，瞋恚內發，手自持刀，斷狗四足，",
        "translation": "On the next day his companion wished to eat and drink at an early hour but could not get food. Being overcome by hunger and thirst, he became angry and said, “Take your sword in your hand and cut off the four legs of",
        "source": "T03n0156_003:0142a28_4"
    },
    {
        "source_sentence": "投身坑中，捨之而去。",
        "translation": "He threw himself into a pit, abandoned it, and departed.",
        "source": "T03n0156_003:0142b01_5"
    },
    {
        "source_sentence": "其狗宛轉，受大苦惱。",
        "translation": "The dog simply turned around and suffered great pain and suffering.",
        "source": "T03n0156_003:0142b01_6"
    },
    {
        "source_sentence": "時舍利弗於初夜時，道眼遙見。",
        "translation": "At the beginning of the night, Śāriputra saw it from a distance with the eye of enlightenment.",
        "source": "T03n0156_003:0142b02_7"
    },
    {
        "source_sentence": "過夜至旦，著衣持鉢入城乞食已，往詣嶮路，至彼狗所，持食與之。",
        "translation": "When the night passed and dawn came, he put on his robes, took his bowl, entered the city to solicit alms, went down a precipitous path, arrived at the dog's place, and gave it food.",
        "source": "T03n0156_003:0142b03_8"
    },
    {
        "source_sentence": "因為說法，示教利喜。",
        "translation": "Because he teaches the Dharma, he shows instruction, benefits, and joy.",
        "source": "T03n0156_003:0142b04_9"
    },
    {
        "source_sentence": "狗聞法已，慚愧不樂，却後一七，罪畢得出生於人中。」",
        "translation": "After hearing the teaching, the dog was shameful and unhappy, withdrew one or seven, and after his sins were committed, he was born among humans.",
        "source": "T03n0156_003:0142b05_10"
    },
    {
        "source_sentence": "佛告阿難：「爾時白狗者，今均提沙彌是。",
        "translation": "The Buddha told Ānanda, That white dog at that time was the present-day Kauṇḍinya Sramana.",
        "source": "T03n0156_003:0142b07_0"
    },
    {
        "source_sentence": "由過去世毀罵賢聖，墮在惡道。",
        "translation": "As a result of disparaging the good and noble people in past lives, they've fallen into a bad destiny.",
        "source": "T03n0156_003:0142b07_1"
    },
    {
        "source_sentence": "由尋能改，慙愧懺悔，發誓願故，得遇善友。",
        "translation": "Because they sought to change their ways, repented shamefully and repentantly, and made a vow to meet a good friend.",
        "source": "T03n0156_003:0142b08_2"
    },
    {
        "source_sentence": "遇善友故，罪畢得出生於人中。",
        "translation": "Because they meet a good friend, they'll be born among humans after their sins have ended.",
        "source": "T03n0156_003:0142b09_3"
    },
    {
        "source_sentence": "遇佛世尊，即得漏盡。」",
        "translation": "When he meets the Bhagavān, he'll immediately end the contaminants.",
        "source": "T03n0156_003:0142b10_4"
    },
    {
        "source_sentence": "佛告阿難：「當念父母及善知識恩！",
        "translation": "The Buddha told Ānanda, Remember the kindness of your parents and good teachers!",
        "source": "T03n0156_003:0142b10_5"
    },
    {
        "source_sentence": "是故知恩，常當報恩。",
        "translation": "Because of this, they know that kindness always rewards kindness.",
        "source": "T03n0156_003:0142b11_6"
    },
    {
        "source_sentence": "善知識者是大因緣。」",
        "translation": "A good teacher is a great cause and condition.",
        "source": "T03n0156_003:0142b12_0"
    },
    {
        "source_sentence": "佛說此法時，無量百千眾生發阿耨多羅三藐三菩提心，乃至聲聞辟支佛心。",
        "translation": "When the Buddha taught this teaching, measureless hundreds of thousands of sentient beings aroused the mind of unsurpassed, correct, and complete enlightenment, even up to the minds of śrāvakas and pratyekbuddhas.",
        "source": "T03n0156_003:0142b12_1"
    },
    {
        "source_sentence": "一切大眾，聞佛說法，歡喜踊躍，作禮而去。",
        "translation": "All the people in the assembly, having heard the Buddha’s discourse, were delighted and jumped for joy. After paying their respects, they departed.",
        "source": "T03n0156_003:0142b14_2"
    },
    {
        "source_sentence": "大方便佛報恩經卷第三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3",
        "source": "T03n0156_003:0142b16_0"
    }
]