[
    {
        "source_sentence": "悲華經卷第九",
        "translation": "Compassionate Flower Scripture, Volume 9",
        "source": "T03n0157_009:0222a18_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T03n0157_009:0222a20_0"
    },
    {
        "source_sentence": "檀波羅蜜品第五之二",
        "translation": "The Fifth and Second Part of the Chapter on the perfection of giving",
        "source": "T03n0157_009:0222a21_0"
    },
    {
        "source_sentence": "「『善男子！",
        "translation": "'Good sons!",
        "source": "T03n0157_009:0222a22_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩助菩提法清淨之門？",
        "translation": "What is the pure aspect of the bodhisattva-mahāsattva's method of assisting enlightenment?",
        "source": "T03n0157_009:0222a22_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0222a23_2"
    },
    {
        "source_sentence": "布施即是助菩提法，化眾生故。",
        "translation": "Giving is the method of assisting enlightenment, because it transforms sentient beings.",
        "source": "T03n0157_009:0222a23_3"
    },
    {
        "source_sentence": "持戒即是助菩提法，具足善願故。",
        "translation": "Observing precepts is an aid to enlightenment, because they are replete with good vows.",
        "source": "T03n0157_009:0222a24_0"
    },
    {
        "source_sentence": "忍辱即是助菩提法，具足三十二相、八十隨形好故。",
        "translation": "Forbearance is an aid to enlightenment, because it has the thirty-two characteristics and eighty secondary signs.",
        "source": "T03n0157_009:0222a24_1"
    },
    {
        "source_sentence": "精進即是助菩提法，於諸眾生勤教化故。",
        "translation": "Energy is the aid to enlightenment, because it diligently teaches and transforms sentient beings.",
        "source": "T03n0157_009:0222a25_2"
    },
    {
        "source_sentence": "禪定即是助菩提法，令心具足得調伏故。",
        "translation": "Meditation is an aid to enlightenment, because it causes the mind to be fully disciplined.",
        "source": "T03n0157_009:0222a26_3"
    },
    {
        "source_sentence": "智慧即是助菩提法，具足能知諸煩惱故。",
        "translation": "Wisdom is the method of assisting enlightenment, being replete with the ability to know the afflictions.",
        "source": "T03n0157_009:0222a27_4"
    },
    {
        "source_sentence": "多聞即是助菩提法，於諸法中具無礙故。",
        "translation": "Being well-versed is the method of assisting enlightenment, because it's fully unobstructed in all dharmas.",
        "source": "T03n0157_009:0222a28_5"
    },
    {
        "source_sentence": "一切功德即是助菩提法，一切眾生得具足故。",
        "translation": "All merits are the factors that aid in enlightenment, because all sentient beings attain their fulfillment.",
        "source": "T03n0157_009:0222a29_6"
    },
    {
        "source_sentence": "智業即是助菩提法，得具足無礙智故。",
        "translation": "Wisdom and karma are the factors that aid in enlightenment, because they attain unhindered knowledge.",
        "source": "T03n0157_009:0222b01_7"
    },
    {
        "source_sentence": "修定即是助菩提法，悉得成就柔軟心故。",
        "translation": "Cultivating concentration is an aid to enlightenment, because it's the method of accomplishing a gentle mind.",
        "source": "T03n0157_009:0222b02_8"
    },
    {
        "source_sentence": "慧業即是助菩提法，遠離一切諸疑惑故。",
        "translation": "The action of wisdom is an aid to enlightenment, because it's free of all doubt and confusion.",
        "source": "T03n0157_009:0222b03_9"
    },
    {
        "source_sentence": "慈心即是助菩提法，於諸眾生，心無礙故。",
        "translation": "The mind of kindness is an aid to enlightenment, because the minds of sentient beings are unobstructed.",
        "source": "T03n0157_009:0222b04_10"
    },
    {
        "source_sentence": "悲心即是助菩提法，拔出眾生諸苦故。",
        "translation": "The mind of compassion is an aid to enlightenment, which removes the suffering of sentient beings.",
        "source": "T03n0157_009:0222b05_11"
    },
    {
        "source_sentence": "喜心即是助菩提法，受樂法故。",
        "translation": "Joy is an aid to enlightenment, because it brings happiness.",
        "source": "T03n0157_009:0222b06_12"
    },
    {
        "source_sentence": "捨心即是助菩提法，斷憎愛故。",
        "translation": "The mind of equanimity is an aid to enlightenment, because it stops hating and clinging.",
        "source": "T03n0157_009:0222b07_13"
    },
    {
        "source_sentence": "聽法即是助菩提法，斷五蓋故。",
        "translation": "Hearing the Dharma is an aid to enlightenment, which removes the five hindrances.",
        "source": "T03n0157_009:0222b08_14"
    },
    {
        "source_sentence": "出世即是助菩提法，捨諸所有故。",
        "translation": "supramundane is an aid to enlightenment, because it abandons all that exists.",
        "source": "T03n0157_009:0222b08_15"
    },
    {
        "source_sentence": "阿蘭若即是助菩提法，離諸怱務故。",
        "translation": "Arraṇya is an aid to enlightenment because it's free of debilitating duties.",
        "source": "T03n0157_009:0222b09_16"
    },
    {
        "source_sentence": "專念即是助菩提法，得陀羅尼故。",
        "translation": "Being concentrated is the method of assisting enlightenment, which is because he attains the dhāraṇī.",
        "source": "T03n0157_009:0222b10_17"
    },
    {
        "source_sentence": "正憶即是助菩提法，分別意識故。",
        "translation": "Correct recollection is an aid to enlightenment, because it discriminates the thinking consciousness.",
        "source": "T03n0157_009:0222b11_18"
    },
    {
        "source_sentence": "思惟即是助菩提法，於諸法中得成就義故。",
        "translation": "Meditation is an aid to enlightenment because it's the meaning of attaining accomplishment in all dharmas.",
        "source": "T03n0157_009:0222b12_19"
    },
    {
        "source_sentence": "念處即是助菩提法，身受心法覺分別故。",
        "translation": "The application of mindfulness is an aid to enlightenment, because it discriminates bodily feelings, mental feelings, and dharmas.",
        "source": "T03n0157_009:0222b13_20"
    },
    {
        "source_sentence": "正勤即是助菩提法，斷不善法，修善法故。",
        "translation": "Correct effort is an aid to enlightenment, because it stops bad qualities and cultivates good qualities.",
        "source": "T03n0157_009:0222b14_21"
    },
    {
        "source_sentence": "如意足即是助菩提法，身心輕利故。",
        "translation": "The supernormal abilities are the factors that aid in enlightenment, because their bodies and minds are light and sharp.",
        "source": "T03n0157_009:0222b15_22"
    },
    {
        "source_sentence": "諸根即是助菩提法，得一切眾生根具足故。",
        "translation": "The faculties are the factors that aid in enlightenment, because they attain the fulfillment of the faculties of all sentient beings.",
        "source": "T03n0157_009:0222b16_23"
    },
    {
        "source_sentence": "諸力即是助菩提法，具足能壞諸煩惱故。",
        "translation": "The powers are the factors that aid in enlightenment, because they are fully endowed with the ability to destroy afflictions.",
        "source": "T03n0157_009:0222b17_24"
    },
    {
        "source_sentence": "諸覺即是助菩提法，於諸法中具足覺知實法相故。",
        "translation": "The awakenings are the factors that aid in enlightenment, because they fully perceive the true characteristics of dharmas within dharmas.",
        "source": "T03n0157_009:0222b18_25"
    },
    {
        "source_sentence": "正道即是助菩提法，遠離一切諸邪道故。",
        "translation": "The right path is an aid to enlightenment, because it's free of all wrong paths.",
        "source": "T03n0157_009:0222b19_26"
    },
    {
        "source_sentence": "聖諦即是助菩提法，斷滅一切諸煩惱故。",
        "translation": "The noble truth is the method of assisting enlightenment, which extinguishes all afflictions.",
        "source": "T03n0157_009:0222b20_27"
    },
    {
        "source_sentence": "四辯即是助菩提法，得斷眾生諸疑惑故。",
        "translation": "The four kinds of eloquence are the factors that aid in enlightenment, because they cut off the doubts and confusions of sentient beings.",
        "source": "T03n0157_009:0222b21_28"
    },
    {
        "source_sentence": "緣念即是助菩提法，不從他聞得智慧故。",
        "translation": "Conditioned mindfulness is an aid to enlightenment because it doesn't hear wisdom from others.",
        "source": "T03n0157_009:0222b22_29"
    },
    {
        "source_sentence": "善友即是助菩提法，一切功德特成就故。",
        "translation": "A good friend is the method of assisting enlightenment, because all merits are especially accomplished.",
        "source": "T03n0157_009:0222b23_30"
    },
    {
        "source_sentence": "發心即是助菩提法，成就不誑諸眾生故。",
        "translation": "The arousal of mind is an aid to enlightenment, because it accomplishes not pitying sentient beings.",
        "source": "T03n0157_009:0222b24_31"
    },
    {
        "source_sentence": "用意即是助菩提法，出一切法故。",
        "translation": "The mind is the method of assisting enlightenment, which removes all dharmas.",
        "source": "T03n0157_009:0222b25_32"
    },
    {
        "source_sentence": "專心即是助菩提法，增益善法故。",
        "translation": "Concentration of mind is an aid to enlightenment, which increases good qualities.",
        "source": "T03n0157_009:0222b26_33"
    },
    {
        "source_sentence": "思惟善法即是助菩提法，隨所聞法得成就故。",
        "translation": "Meditation on good qualities is an aid to enlightenment, because it's accomplished according to the qualities that are heard.",
        "source": "T03n0157_009:0222b26_34"
    },
    {
        "source_sentence": "攝取即是助菩提法，成就教化諸眾生故。",
        "translation": "Taking in is an aid to enlightenment because it accomplishes the task of teaching sentient beings.",
        "source": "T03n0157_009:0222b28_35"
    },
    {
        "source_sentence": "護持正法即是助菩提法，令三寶種不斷絕故。",
        "translation": "Preserving the right teaching is an aid to enlightenment, which causes the seeds of the three treasures not to be cut off.",
        "source": "T03n0157_009:0222b29_36"
    },
    {
        "source_sentence": "善願即是助菩提法，成就嚴淨佛世界故。",
        "translation": "The good vow is an aid to enlightenment because it accomplishes the adornment and purity of the Buddha's world.",
        "source": "T03n0157_009:0222c01_37"
    },
    {
        "source_sentence": "方便即是助菩提法，速得成就一切智故。",
        "translation": "The method is an aid to enlightenment, because it quickly accomplishes omniscience.",
        "source": "T03n0157_009:0222c02_38"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0222c03_39"
    },
    {
        "source_sentence": "是名菩薩摩訶薩助菩提法清淨門經。』",
        "translation": "This is called the pure approach of the bodhisattva-mahāsattva's scripture that aids in the purification of the Dharma of enlightenment.'",
        "source": "T03n0157_009:0222c03_40"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0222c04_41"
    },
    {
        "source_sentence": "爾時，寶藏如來四顧遍觀菩薩大眾，告大悲言：『大悲！",
        "translation": "It was then that the Jewel-Store Tathāgata looked around the crowd of bodhisattvas and addressed them with great compassion, saying, 'Great compassion!",
        "source": "T03n0157_009:0222c04_42"
    },
    {
        "source_sentence": "云何菩薩以無所畏莊嚴瓔珞具足於忍？",
        "translation": "How does a bodhisattva perfect patience by adorning himself with the jewelry of fearlessness?",
        "source": "T03n0157_009:0222c05_43"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0222c06_44"
    },
    {
        "source_sentence": "若菩薩見第一義，得無癡精進，不著三界。",
        "translation": "If a bodhisattva sees the ultimate truth, he attains the absence of deluded effort and doesn't cling to the three realms.",
        "source": "T03n0157_009:0222c06_45"
    },
    {
        "source_sentence": "若不著三界，是謂三昧無畏沙門之法，如空中動手悉無所著，又觀諸法不見相貌。",
        "translation": "If he doesn't cling to the three realms, this is called the fearless ascetic practice of samādhi, which is like moving his hand in the air without attachment and observing the characteristics of things without seeing their appearance.",
        "source": "T03n0157_009:0222c07_46"
    },
    {
        "source_sentence": "大悲！",
        "translation": "Great compassion!",
        "source": "T03n0157_009:0222c09_47"
    },
    {
        "source_sentence": "是名菩薩摩訶薩以無所畏莊嚴瓔珞。",
        "translation": "This is called the bodhisattva-mahāsattva's jewelry adorned with fearlessness.",
        "source": "T03n0157_009:0222c10_48"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0222c11_0"
    },
    {
        "source_sentence": "云何菩薩具足於忍？",
        "translation": "How does a bodhisattva perfect patience?",
        "source": "T03n0157_009:0222c11_1"
    },
    {
        "source_sentence": "如是菩薩住於法時，不見諸法如微塵相貌，逆順觀行於諸法中解無果報，",
        "translation": "Thus, when the bodhisattva abides in principles, he doesn't see the characteristics of things as tiny dust motes, and he follows contemplation and practice to understand that there's no fruitful reward in principles.",
        "source": "T03n0157_009:0222c11_2"
    },
    {
        "source_sentence": "於所習慈了無有我，於所習悲了無眾生，於所習喜了無有命，於所習捨了無有人。",
        "translation": "He understands that kindness has no self in what's cultivated, pity has no sentient beings in what's cultivated, joy has no life in what's cultivated, and equanimity has no person in what's cultivated.",
        "source": "T03n0157_009:0222c13_3"
    },
    {
        "source_sentence": "雖行布施，不見施物。",
        "translation": "Even though they practice generosity, they don't see the things they give.",
        "source": "T03n0157_009:0222c15_4"
    },
    {
        "source_sentence": "雖行持戒，不見淨心。",
        "translation": "Even though they practice observing precepts, they don't see the pure mind.",
        "source": "T03n0157_009:0222c16_5"
    },
    {
        "source_sentence": "雖行忍辱，不見眾生。",
        "translation": "Even though they practice forbearance, they don't see sentient beings.",
        "source": "T03n0157_009:0222c16_6"
    },
    {
        "source_sentence": "雖行精進，無離欲心。",
        "translation": "Even though he practices exertion, there's no mind free of desire.",
        "source": "T03n0157_009:0222c17_7"
    },
    {
        "source_sentence": "雖行禪定，無除惡心。",
        "translation": "Even though they practice meditation, there's no removal of bad thoughts.",
        "source": "T03n0157_009:0222c17_8"
    },
    {
        "source_sentence": "雖行智慧，心無所行。",
        "translation": "Although he practices wisdom, his mind doesn't practice anything.",
        "source": "T03n0157_009:0222c18_9"
    },
    {
        "source_sentence": "雖行念處，不見思惟。",
        "translation": "Even though they practice the mindful abode of mindfulness, they don't see or contemplate it.",
        "source": "T03n0157_009:0222c18_10"
    },
    {
        "source_sentence": "雖行正勤，不見心之生滅。",
        "translation": "Even though they practice right effort, they don't see the arising and ceasing of mind.",
        "source": "T03n0157_009:0222c19_11"
    },
    {
        "source_sentence": "雖行如意足，不見無量心。",
        "translation": "Even though he practices supernormal abilities, he doesn't see measureless mind.",
        "source": "T03n0157_009:0222c19_12"
    },
    {
        "source_sentence": "雖行於信，不見無障礙心。",
        "translation": "Even though they practice faith, they don't see an unobstructed mind.",
        "source": "T03n0157_009:0222c20_13"
    },
    {
        "source_sentence": "雖行於念，不見心得自在。",
        "translation": "Even though they practice mindfulness, they don't see the mind as self-contained.",
        "source": "T03n0157_009:0222c21_14"
    },
    {
        "source_sentence": "雖行於定，不見入定心。",
        "translation": "Even though he's practicing concentration, he doesn't see the mind entering concentration.",
        "source": "T03n0157_009:0222c21_15"
    },
    {
        "source_sentence": "雖行於慧，不見慧根。",
        "translation": "Even though they practice wisdom, they don't see the faculty of wisdom.",
        "source": "T03n0157_009:0222c22_16"
    },
    {
        "source_sentence": "雖行諸力，無所破壞。",
        "translation": "Even though they practice their powers, there's nothing to destroy.",
        "source": "T03n0157_009:0222c23_17"
    },
    {
        "source_sentence": "雖行諸覺，心無分別。",
        "translation": "Even though they practice all the feelings, their minds have no discrimination.",
        "source": "T03n0157_009:0222c23_18"
    },
    {
        "source_sentence": "雖行正道，不見諸法。",
        "translation": "Even though they practice the right path, they don't see the teachings.",
        "source": "T03n0157_009:0222c24_19"
    },
    {
        "source_sentence": "雖行定業，不見心之寂靜。",
        "translation": "Even though they practice meditation, they don't see the mind's quiescence.",
        "source": "T03n0157_009:0222c24_20"
    },
    {
        "source_sentence": "雖行慧業，不見心之所行。",
        "translation": "Even though they practice wisdom and karma, they don't see what the mind does.",
        "source": "T03n0157_009:0222c25_21"
    },
    {
        "source_sentence": "雖行聖諦，不見通達法相。",
        "translation": "Even though they practice the noble truths, they don't see and comprehend the characteristics of dharmas.",
        "source": "T03n0157_009:0222c26_0"
    },
    {
        "source_sentence": "雖修念佛，不見無量行心。",
        "translation": "Even though they cultivate mindfulness of the Buddha, they don't see the mind of measureless practice.",
        "source": "T03n0157_009:0222c26_1"
    },
    {
        "source_sentence": "雖修念法，心等法界。",
        "translation": "Even though they cultivate mindfulness of dharmas, minds and so forth in the Dharma realm.",
        "source": "T03n0157_009:0222c27_2"
    },
    {
        "source_sentence": "雖修念僧，心無所住，教化眾生心得清淨。",
        "translation": "Even though he cultivates mindfulness of the saṃgha, his mind has no place to abide, and he teaches sentient beings so that their minds are pure.",
        "source": "T03n0157_009:0222c27_3"
    },
    {
        "source_sentence": "雖持正法，於諸法界心不分別。",
        "translation": "Even though he maintains the right teaching, his mind doesn't discriminate between the Dharma realm and the Dharma realm.",
        "source": "T03n0157_009:0222c28_4"
    },
    {
        "source_sentence": "雖修淨土，其心平等猶如虛空。",
        "translation": "Even though they cultivate the Pure Land, their minds are equal like space.",
        "source": "T03n0157_009:0222c29_5"
    },
    {
        "source_sentence": "雖修相好，心無諸相。",
        "translation": "Even though they cultivate good characteristics, the mind has no characteristics.",
        "source": "T03n0157_009:0223a01_6"
    },
    {
        "source_sentence": "雖得忍辱，心無所有。",
        "translation": "Even though they attain forbearance, their minds lack existence.",
        "source": "T03n0157_009:0223a02_0"
    },
    {
        "source_sentence": "雖住不退，常自不見退與不退。",
        "translation": "Even though they abide and don't regress, they always don't see themselves regressing or not regressing.",
        "source": "T03n0157_009:0223a02_1"
    },
    {
        "source_sentence": "雖行道場，解了三界無有異相。",
        "translation": "Even though they practice at the site of enlightenment, they understand that there are no different characteristics in the three realms.",
        "source": "T03n0157_009:0223a03_2"
    },
    {
        "source_sentence": "雖壞諸魔，乃是利益無量眾生。",
        "translation": "Even though it destroys the Māras, it's for the benefit of measureless sentient beings.",
        "source": "T03n0157_009:0223a04_3"
    },
    {
        "source_sentence": "雖行菩提，觀諸法空，無菩提心。",
        "translation": "Even though he practices enlightenment, he observes the emptiness of dharmas and doesn't have the mind of enlightenment.",
        "source": "T03n0157_009:0223a04_4"
    },
    {
        "source_sentence": "雖轉法輪，於一切法無轉無還。",
        "translation": "Even though they turn the wheel of the Dharma, they don't turn or return to all dharmas.",
        "source": "T03n0157_009:0223a05_5"
    },
    {
        "source_sentence": "雖復示現大般涅槃，於生死中，心等無異。",
        "translation": "Even though he manifests the great nirvāṇa, his mind and so forth are no different in birth and death.",
        "source": "T03n0157_009:0223a06_6"
    },
    {
        "source_sentence": "是名菩薩具足於忍。』」",
        "translation": "This is called a bodhisattva who possesses patience.'",
        "source": "T03n0157_009:0223a07_7"
    },
    {
        "source_sentence": "說是法時，有六十四億菩薩摩訶薩從十方來，至耆闍崛山釋迦牟尼佛所，",
        "translation": "When he had discoursed thus, sixty-four hundred million bodhisattva mahāsattvas came from the ten directions to the place where Śākyamuni Buddha of Mount Gṛdhrakūṭa was.",
        "source": "T03n0157_009:0223a07_8"
    },
    {
        "source_sentence": "聽此本緣三昧助菩提法清淨門經，聞是法已，得無生忍。",
        "translation": "After listening to this scripture on the pure approach of samādhi that aids in enlightenment and the principle of purity, he hears this teaching and attains the forbearance of nonarising.",
        "source": "T03n0157_009:0223a09_9"
    },
    {
        "source_sentence": "爾時，釋迦牟尼佛告諸大眾：「汝今當知，寶藏如來於往古世，說是法時，",
        "translation": "At that time, the Buddha Śākyamuni Buddha said to the great assembly of bhikṣus: You should now know that from ancient times when the Tathāgata Ratnacchattra had discoursed thus:",
        "source": "T03n0157_009:0223a11_10"
    },
    {
        "source_sentence": "有四十八恒河沙等菩薩摩訶薩得無生忍，四天下微塵數等菩薩摩訶薩住不退轉地，",
        "translation": "There were bodhisattvas and mahāsattvas as numerous as the grains of sand in forty-eight Ganges Rivers who had attained the tolerance of nonarising, and bodhisattvas and mahāsattvas as numerous as atoms in four continents lived in the stage of irreversibility.",
        "source": "T03n0157_009:0223a12_11"
    },
    {
        "source_sentence": "一恒河沙等菩薩摩訶薩，得此本緣三昧助菩提法清淨門經。",
        "translation": "A bodhisattva Mahāsattva as numerous as the number of grains of sand in the Ganges River obtained this scripture on the purifying aspect of the samādhi of original conditions that aids in enlightenment.",
        "source": "T03n0157_009:0223a14_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0223a16_13"
    },
    {
        "source_sentence": "爾時，大悲菩薩聞是法已，心生歡喜即得變身，其狀猶如年二十人，追隨如來猶影隨形。",
        "translation": "After hearing this teaching, the great compassionate bodhisattva was delighted and immediately transformed into a body as young as twenty years old, following the Tathāgata's shadow and form.",
        "source": "T03n0157_009:0223a16_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0223a18_15"
    },
    {
        "source_sentence": "爾時，轉輪聖王及其千子，八萬四千小王，九十二億人悉共出家，奉持禁戒修學多聞，",
        "translation": "At that time the cakravartin king and his one thousand sons, as well as eighty-four thousand minor kings, all renounced household life together with a total of ninety-two koṭis of people. They observed the precepts and practiced Buddhism; they learned extensively.",
        "source": "T03n0157_009:0223a18_16"
    },
    {
        "source_sentence": "忍辱三昧，勤行精進。",
        "translation": "He practiced the samādhi of forbearance and exerted himself energetically.",
        "source": "T03n0157_009:0223a20_17"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0223a21_18"
    },
    {
        "source_sentence": "爾時，大悲菩薩摩訶薩漸漸從佛諮受聲聞所有八萬四千法聚，緣覺所有九萬法聚，",
        "translation": "At that time, the great compassionate bodhisattva Mahāsattva gradually received the eighty-four thousand teachings of all the śrāvakas from the Buddha and the ninety-thousand teachings of all the pratyekabuddhas.",
        "source": "T03n0157_009:0223a21_19"
    },
    {
        "source_sentence": "受持諷誦，悉令通利。",
        "translation": "They receive, retain, recite, and make them all penetrate.",
        "source": "T03n0157_009:0223a23_20"
    },
    {
        "source_sentence": "大乘法藏身念處中十萬法聚，受念處中十萬法聚，心念處中十萬法聚，",
        "translation": "In the body of mindfulness of the great vehicle treasure house of teachings, there are 100,000 clusters of teachings; in the state of mindfulness of feeling, there are 100,000 clusters of teachings; in the state of mindfulness of mind, there are 100,000 clusters of teachings.",
        "source": "T03n0157_009:0223a23_21"
    },
    {
        "source_sentence": "法念處中十萬法聚，悉皆受持讀誦通利。",
        "translation": "In the abode of mindfulness of the Dharma, there are 100,000 clusters of teachings, all received, memorized, recited, and shared in their benefits.",
        "source": "T03n0157_009:0223a25_22"
    },
    {
        "source_sentence": "十八界中十萬法聚，十二入中十萬法聚，斷除貪欲十萬法聚，斷除瞋恚十萬法聚，",
        "translation": "In the eighteen elements, there are 100,000 clusters of teachings; in the twelve sense-fields, 100,000 clusters of teachings that remove craving and 100,000 clusters of teachings that remove anger and 100,000 clusters of teachings",
        "source": "T03n0157_009:0223a26_23"
    },
    {
        "source_sentence": "斷除愚癡十萬法聚，三昧解脫十萬法聚，諸力無畏不共之法十萬法聚，",
        "translation": "Hundreds of thousands of doctrines were purified from ignorance and delusion, hundreds of thousands of doctrines in concentration and liberation, and hundreds of thousands of doctrines in power, fearlessness, and unique qualities were purified.",
        "source": "T03n0157_009:0223a28_24"
    },
    {
        "source_sentence": "如是等十億法聚，皆悉受持讀誦通利。",
        "translation": "These billions of such things are all received, preserved, recited, and shared for their benefit.",
        "source": "T03n0157_009:0223a29_25"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0223b01_26"
    },
    {
        "source_sentence": "其後彼佛入般涅槃，爾時，大悲菩薩摩訶薩以無量無邊種種諸華、末香、塗香、寶幢、幡蓋、珍寶、妓樂，",
        "translation": "At that time the great compassionate bodhisattva Mahāsattva entered parinirvāṇa with flowers, powdered incense, scented ointments, jewel banners, pennants, precious canopies, rare treasures, and music.",
        "source": "T03n0157_009:0223b01_27"
    },
    {
        "source_sentence": "而以供養，以種種香積以為[卄\\/積]，闍維其身收取舍利，起七寶塔高五由旬，",
        "translation": "He offered various kinds of incense as offerings, piled them into a heap of all kinds of fragrances, cremated his body to collect the relics, and built a seven-jeweled stupa five yojanas high.",
        "source": "T03n0157_009:0223b04_28"
    },
    {
        "source_sentence": "縱廣正等滿一由旬。",
        "translation": "It's exactly one yojana long and wide.",
        "source": "T03n0157_009:0223b06_0"
    },
    {
        "source_sentence": "於七日中，復以種種無量無邊華香、妓樂、寶幢、幡蓋，而供養之。",
        "translation": "Within seven days, he also offered various kinds of measureless and limitless flowers, incense, music, jeweled banners, pennants, and canopies to them.",
        "source": "T03n0157_009:0223b06_1"
    },
    {
        "source_sentence": "爾時，復令無量無邊眾生安止住於三乘法中。",
        "translation": "At that point, they also cause measureless and limitless sentient beings to peacefully abide in the teachings of the three vehicles.",
        "source": "T03n0157_009:0223b07_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0223b09_0"
    },
    {
        "source_sentence": "大悲菩薩過七日已，與八萬四千人俱共出家，剃除鬚髮，著染袈裟，於寶藏佛般涅槃後，",
        "translation": "After seven days had passed, the great compassionate bodhisattva renounced the householder’s life together with eighty-four thousand bhikṣus. Having shaved his hair and beard, he donned a dyed monastic robe.",
        "source": "T03n0157_009:0223b09_1"
    },
    {
        "source_sentence": "隨順等心，熾然正法，滿十千歲，復令無量無邊阿僧祇眾生，安止住於三乘法中，",
        "translation": "“Furthermore, when the Buddha’s life span was ten thousand years in length, he caused immeasurable sentient beings to abide peacefully in the teaching of the three vehicles.",
        "source": "T03n0157_009:0223b11_2"
    },
    {
        "source_sentence": "及三歸依、五戒、八齋、沙彌十戒，次第具足大僧淨行。",
        "translation": "The three refuges, the five precepts, the eight precepts, and the ten precepts for novices are in order to fulfill the pure practices of the great saṃgha.",
        "source": "T03n0157_009:0223b13_3"
    },
    {
        "source_sentence": "復更勸化無量百千萬億眾生，安止住於神通方便四無量行，令觀五陰猶如怨賊，",
        "translation": "“Furthermore, encouraging and transforming countless hundreds of thousands of myriads of koṭis of sentient beings, peacefully abiding in the four immeasurable practices of transcendent skillful means, they cause them to contemplate the five aggregates like thieves.",
        "source": "T03n0157_009:0223b14_4"
    },
    {
        "source_sentence": "觀於諸入如空聚落，觀有為法從因緣生，勸化眾生令得知見，觀一切法如鏡中像，",
        "translation": "They contemplate all sense-fields as villages in the sky; they contemplate conditioned phenomena as arising from causes and conditions, encouraging sentient beings to know and see. They contemplate all phenomena as reflections in a mirror.",
        "source": "T03n0157_009:0223b16_5"
    },
    {
        "source_sentence": "如熱時炎，如水中月，於諸法中皆知無我、無生、無滅，第一寂靜微妙涅槃。",
        "translation": "Like the moon in water when it's hot, they all know that there's no self, no arising, and no cessation in all dharmas, and the first is subtle nirvāṇa of quiescence.",
        "source": "T03n0157_009:0223b18_6"
    },
    {
        "source_sentence": "復令無量無邊眾生，安止住於八聖道中，作如是等大利益已，即便命終。",
        "translation": "It also causes measureless and limitless sentient beings to live peacefully in the eight noble paths, and after performing such great benefits, their lives will end.",
        "source": "T03n0157_009:0223b20_7"
    },
    {
        "source_sentence": "尋時復有無量無邊百千諸人，以種種供養，供養大悲比丘舍利，其所供養悉如轉輪聖王之法，",
        "translation": "At that time there were also countless and limitless hundreds of thousands of people who offered various kinds of offerings to the relics of the great compassionate monk Sāriputta, all in accordance with the teachings of the universal ruler.",
        "source": "T03n0157_009:0223b22_0"
    },
    {
        "source_sentence": "如是大眾種種供養大悲舍利，亦復如是。",
        "translation": "So it is with the various kinds of offerings to the relics of great compassion made by this assembly.",
        "source": "T03n0157_009:0223b24_1"
    },
    {
        "source_sentence": "大悲比丘命終之日，寶藏如來所有正法，即於其日滅盡無餘，彼諸菩薩以本願故，",
        "translation": "On the day when the monk Mahāprajñāpāramitā’s life came to an end, all the true teachings of the buddha-tathāgata Ratnaketu Buddha disappeared on that very day without remainder. Because of their past vows, those bodhisattvas entered nirvana like this:",
        "source": "T03n0157_009:0223b25_2"
    },
    {
        "source_sentence": "生諸佛土，或生兜術人中、龍中，或夜叉中、或阿修羅，生於種種畜生之中。",
        "translation": "They'll be born in the buddha lands, or they'll be born among humans and dragons in Tuṣita, or among yakṣas and asuras, or among various animals.",
        "source": "T03n0157_009:0223b27_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0223b28_4"
    },
    {
        "source_sentence": "大悲比丘命終之後，以本願故，南方去此十千佛土，有佛世界名曰歡喜，",
        "translation": "“After the demise of this great compassionate monk, because of his original vow, ten thousand buddha-lands to the south from here in the ten thousand buddha-lands at the south will be a buddha world called Joy.",
        "source": "T03n0157_009:0223b29_0"
    },
    {
        "source_sentence": "彼中人民壽八十歲，集聚一切諸不善根，憙為殺害，安住諸惡，於諸眾生無慈悲心，",
        "translation": "At that time the life span of the people there was eighty years. They gathered together all their roots of unwholesomeness, killing and inflicting harm on others because of hatred. Abiding in evil, they had no compassion for sentient beings.",
        "source": "T03n0157_009:0223c01_1"
    },
    {
        "source_sentence": "不孝父母，乃至不畏未來之世。",
        "translation": "They aren't filial to their parents, and they won't fear future lives.",
        "source": "T03n0157_009:0223c03_2"
    },
    {
        "source_sentence": "大悲比丘以本願故，生彼世界旃陀羅家，所受身體長大端正，力勢剛強威猛勇健，",
        "translation": "Because of his original vow, the monk Mahāprajñāpāramitā was born in that world in the house of a caṇḍāla. The body he underwent became large and handsome, strong and powerful, majestic and bravely strong.",
        "source": "T03n0157_009:0223c04_3"
    },
    {
        "source_sentence": "專念問答辯才捷疾，如是諸事悉勝於人，以強力勢逼捉諸人，作如是言：『汝今若能受不盜戒，",
        "translation": "They concentrate their thoughts, questions, answers, and eloquence with such speed that they are all superior to those of the human race. Forcing others to do so by force, they say:",
        "source": "T03n0157_009:0223c06_4"
    },
    {
        "source_sentence": "乃至遠離種種邪見，行正見者，當施汝命，給汝所須資產之物，令無所乏。",
        "translation": "Even if you're free of various mistaken views and practice right view, I will give you your life and property that you need so you won't lack anything.",
        "source": "T03n0157_009:0223c08_5"
    },
    {
        "source_sentence": "若不受者，我今要當斷汝命根，然後乃去。』",
        "translation": "If you don't accept it, I will now cut off your life root and then leave.'",
        "source": "T03n0157_009:0223c10_6"
    },
    {
        "source_sentence": "爾時，諸人長跪叉手，作如是言：『仁者！",
        "translation": "At that point, the people knelt down with their palms joined and said, 'Sir, my dear friend!",
        "source": "T03n0157_009:0223c11_7"
    },
    {
        "source_sentence": "今已為我調御，如仁所勅，我今授持，盡其壽命不復偷盜，乃至正見亦復如是。』",
        "translation": "Now that you've been disciplined by me and thus instructed by kindness, I now entrust it to him so that he doesn't steal again for the rest of his life, and so does right view.'",
        "source": "T03n0157_009:0223c12_8"
    },
    {
        "source_sentence": "「爾時，強力旃陀羅往至王所或大臣所，作如是言：『我今困乏資產之具，",
        "translation": "At that moment, the powerful caṇḍāla approached the king or his ministers and said:",
        "source": "T03n0157_009:0223c14_9"
    },
    {
        "source_sentence": "所謂飲食、醫藥、衣服、臥具、香華、金銀、錢貨、真珠、琉璃、珂貝、璧玉、珊瑚、虎珀、真寶、偽寶。",
        "translation": "They are food, medicine, clothing, bedding, fragrant flowers, gold, silver, money, genuine pearls, lapis lazuli, jade, coral, amber, real treasures, and counterfeit treasures.",
        "source": "T03n0157_009:0223c15_10"
    },
    {
        "source_sentence": "若我得此種種物已，持施眾生。』",
        "translation": "If I obtain these various things, I'll give them to sentient beings.'",
        "source": "T03n0157_009:0223c17_11"
    },
    {
        "source_sentence": "爾時，國王大臣即與種種所須之物，令其充足。",
        "translation": "At that point, the king's ministers gave them various necessities and made them abundant.",
        "source": "T03n0157_009:0223c18_12"
    },
    {
        "source_sentence": "時旃陀羅因其施故，安止此王及其大臣住九善中。",
        "translation": "Because of his generosity, Candra stopped this king and his ministers from staying among the nine good men.",
        "source": "T03n0157_009:0223c19_13"
    },
    {
        "source_sentence": "爾時，人民增益壽命滿五百歲，其王命終，諸大臣等以旃陀羅紹繼王位，",
        "translation": "At that time, when the life span of the people increased to five hundred years, the king died and his ministers succeeded him to the throne as king.",
        "source": "T03n0157_009:0223c20_14"
    },
    {
        "source_sentence": "因為作字號功德力。",
        "translation": "It's because of the power of the merit of making words and names.",
        "source": "T03n0157_009:0223c22_15"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0223c22_16"
    },
    {
        "source_sentence": "爾時，功德力王不久王一國土，復以力故王二國土，如是不久乃至得作轉輪聖王王閻浮提，",
        "translation": "Soon after that, the king of merit and power won't soon rule over one land or two lands because of his strength, and so it won't be long before he becomes the wheel-turning sage king king of Jambudvfpa.",
        "source": "T03n0157_009:0223c23_17"
    },
    {
        "source_sentence": "然後教化一切眾生，安止令住不殺生戒，乃至正見亦復如是，隨諸眾生心所志樂，",
        "translation": "He then teaches all sentient beings to live peacefully and cause them to abide by the precept of not killing life, up to right view in much the same way, according to the mentalities and aspirations of sentient beings.",
        "source": "T03n0157_009:0223c25_18"
    },
    {
        "source_sentence": "勸化令住於三乘中。",
        "translation": "He encourages and transforms them to abide in the three vehicles.",
        "source": "T03n0157_009:0223c27_19"
    },
    {
        "source_sentence": "爾時，功德力王教化閻浮提內無量眾生於十善道及三乘中已，於閻浮提內大聲唱言：『若有乞求欲須食飲，",
        "translation": "At that time the king Virtuous Power King was teaching and edifying countless sentient beings in Jambudvfpa. Having led them to the ten wholesome paths and the three vehicles, they shouted loudly throughout Jambudvfpa, saying:",
        "source": "T03n0157_009:0223c27_20"
    },
    {
        "source_sentence": "乃至欲得種種珍寶，悉來至此，我當給施。』",
        "translation": "If you want to obtain various treasures, I'll give them to you if they all come here.'",
        "source": "T03n0157_009:0224a01_21"
    },
    {
        "source_sentence": "是時，閻浮提內一切乞士，聞是唱已悉來集會。",
        "translation": "At the time, all the beggars in Jambudvīpa heard this call and assembled.",
        "source": "T03n0157_009:0224a02_22"
    },
    {
        "source_sentence": "時功德力王種種隨意給施所須，皆令滿足。",
        "translation": "At the time, the king of merit and power gave various kinds of gifts as he wished to fulfill whatever he needed.",
        "source": "T03n0157_009:0224a03_23"
    },
    {
        "source_sentence": "爾時，有一尼乾子名曰灰音，往至王所而作是言：『王今所作種種大施，",
        "translation": "At that time, a Nirgrantha by the name of Ashes came to the king’s presence and said: O king, I now give you various kinds of charity.",
        "source": "T03n0157_009:0224a04_24"
    },
    {
        "source_sentence": "以求無上正真之道，我今所須王當與我，令得滿足，王於來世當熾然法燈。』",
        "translation": "In order to seek the unsurpassed true path, the king will give me what I need now, so that I'll attain its fulfillment, and the king will be a blazing lamp of the Dharma in future lives.'",
        "source": "T03n0157_009:0224a06_25"
    },
    {
        "source_sentence": "時王問言：『卿何所須？』",
        "translation": "The king then asked, 'What do you need?'",
        "source": "T03n0157_009:0224a08_26"
    },
    {
        "source_sentence": "彼人答言：『我誦持呪術，欲得與彼阿修羅鬪，怖其破壞自得勝利，是故白王如是事耳。",
        "translation": "The man replied, 'I recite the dhāraṇī and want to fight with that asura, but I'm afraid he'll damage it and attain its own advantage. That's why I told the king about such things.",
        "source": "T03n0157_009:0224a08_27"
    },
    {
        "source_sentence": "所可須者，未死之人皮之與眼。』",
        "translation": "What's needed is the skin and eyes of a person who hasn't died.'",
        "source": "T03n0157_009:0224a10_28"
    },
    {
        "source_sentence": "「爾時，大王聞是語已，如是思惟：『我今得是無量勢力轉輪聖王已，",
        "translation": "Having heard these words, the great king thought: ow! Now that I have attained this wheel-turning sage king of immeasurable power",
        "source": "T03n0157_009:0224a11_29"
    },
    {
        "source_sentence": "得安止無量眾生住於十善及三乘中，復作無量無邊大施，此善知識欲令我以不堅牢身貿堅牢身。』",
        "translation": "They can pacify measureless sentient beings who abide in the ten good and three-vehicle teachings and furthermore make measureless, limitless great offerings, and this good teacher wants to cause me to trade for a body that's not firm with a firm body.'",
        "source": "T03n0157_009:0224a13_30"
    },
    {
        "source_sentence": "爾時，大王便作是言：『汝今可生歡喜之心，我今以此凡夫肉眼布施於汝。",
        "translation": "At that point, the great king then said, 'Now, you may give rise to joyful thoughts, and now I'll give you this mortal's physical eye as an offering.",
        "source": "T03n0157_009:0224a15_31"
    },
    {
        "source_sentence": "以是緣故，令我來世得清淨慧眼。",
        "translation": "Because of these causes and conditions, I'll attain the pure eye of wisdom in a future life.",
        "source": "T03n0157_009:0224a17_32"
    },
    {
        "source_sentence": "以歡喜心剝皮施汝，復以是緣，令我成阿耨多羅三藐三菩提已，得金色身。』",
        "translation": "By rejoicing, I'll skin your skin and give it to you, and by this condition, I'll attain anuttarii samyaksarrzbodhi and attain a golden body.'",
        "source": "T03n0157_009:0224a18_33"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224a19_34"
    },
    {
        "source_sentence": "爾時，功德力王以其右手挑取二目施尼乾子，血流污面而作是言：『諸天龍神、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，",
        "translation": "At that time, the king of the power of virtue picked up two eyes with his right hand and gave them to the Nirgrantha as a gift to the Nirgrantha. bled their faces and said: The devas, nāgas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, nonhumans, etc.",
        "source": "T03n0157_009:0224a20_35"
    },
    {
        "source_sentence": "若在虛空，若在地者，悉聽我言。",
        "translation": "If you're in space or on earth, they'll all listen to my words.",
        "source": "T03n0157_009:0224a23_36"
    },
    {
        "source_sentence": "我今所施皆為無上菩提之道白淨涅槃，度諸眾生於四流水，令得安止住於涅槃。』",
        "translation": "Whatever I give now is for the sake of the unsurpassed path to enlightenment, white and pure nirvāṇa, liberating sentient beings from the four streams of water so that they can peacefully abide in nirvāṇa.'",
        "source": "T03n0157_009:0224a23_37"
    },
    {
        "source_sentence": "復作是言：『若我必定成阿耨多羅三藐三菩提者，雖作是事，所有命根不應斷壞，",
        "translation": "Again, he said, 'If I were to surely attain supreme perfect enlightenment, then even if I did this, the life root that exists wouldn't be cut off or destroyed.",
        "source": "T03n0157_009:0224a25_38"
    },
    {
        "source_sentence": "不失正命，不應生悔，令尼乾子所作呪術便得成就。』",
        "translation": "They won't lose their right livelihood, and they shouldn't give rise to regrets, so that the dhāraṇī created by Nirgrantha will then be accomplished.'",
        "source": "T03n0157_009:0224a27_39"
    },
    {
        "source_sentence": "復作是言：『汝今可來剝取我皮。』",
        "translation": "Again, he said, 'Now, you may come and remove my skin.'",
        "source": "T03n0157_009:0224a29_40"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224a29_41"
    },
    {
        "source_sentence": "時尼乾子即持利刀，剝取王皮，却後七日所作呪術悉得成就。",
        "translation": "Nirgrantha then took a sharp sword, removed the king's skin, and seven days later, he accomplished all the spells he did.",
        "source": "T03n0157_009:0224b01_42"
    },
    {
        "source_sentence": "爾時，大王於七日中，其命未終，不失正念，雖受是苦乃至一念不生悔心。",
        "translation": "For seven days, the great king hadn't yet died, and he didn't lose his right mindfulness; even though he suffered this pain, he didn't give rise to a single thought of regret.",
        "source": "T03n0157_009:0224b02_43"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224b04_44"
    },
    {
        "source_sentence": "汝今當知，爾時大悲菩薩者豈異人乎？",
        "translation": "You should now know that the bodhisattva Mahāprajñāpāramitā Bodhisattva at that time was no different from anyone.",
        "source": "T03n0157_009:0224b04_45"
    },
    {
        "source_sentence": "莫作是觀，則我身是。",
        "translation": "If you don't contemplate this, then I am myself.",
        "source": "T03n0157_009:0224b05_46"
    },
    {
        "source_sentence": "於過去世寶藏佛所，初發阿耨多羅三藐三菩提心，初發心已，勸化無量無邊眾生於阿耨多羅三藐三菩提。",
        "translation": "In the past, he first aroused the mind of unsurpassed, correct, and complete enlightenment in the presence of the Buddha Jewel Treasury Buddha, and after he first aroused it, he encouraged measureless and limitless sentient beings to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_009:0224b05_47"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224b08_48"
    },
    {
        "source_sentence": "是我最初勇健精進，爾時我以本願力故，命終生於歡樂世界旃陀羅家，",
        "translation": "Because of the power of my original vow, I was reborn at the end of my life in the house of Candra in the happy world.",
        "source": "T03n0157_009:0224b08_49"
    },
    {
        "source_sentence": "是我第二勇健精進。",
        "translation": "This is my second bold and vigorous effort.",
        "source": "T03n0157_009:0224b10_50"
    },
    {
        "source_sentence": "我生旃陀羅家，教化眾生於善法中，以自力勢乃至得作轉輪聖王，滅閻浮提鬪諍穢濁，",
        "translation": "I am born in the house of a caṇḍāla. Teaching sentient beings to follow the true Dharma, I exert my power so that they can become universal ruler and destroy the defilements of Jambudvfpa’s disputes.",
        "source": "T03n0157_009:0224b10_51"
    },
    {
        "source_sentence": "令得寂靜增長壽命，是我初始捨於身皮及以眼目。",
        "translation": "To attain quiescence and increase longevity is the first time I've abandoned my body, skin, eyes, and eyes for the first time.",
        "source": "T03n0157_009:0224b12_52"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224b14_53"
    },
    {
        "source_sentence": "我以願故，於彼命終，復還來生歡喜世界旃陀羅家，乃至得作轉輪聖王，",
        "translation": "Because of this vow, when my life ends there, I'll return to the house of Candra in the joyful world and become a wheel-turning sage king.",
        "source": "T03n0157_009:0224b14_54"
    },
    {
        "source_sentence": "以大勢力，安止眾生於善法中，於彼世界，復得除滅怨賊、鬪諍、穢濁之事，",
        "translation": "Because of their great power, they can pacify sentient beings in the good Dharma. In those worlds they are also able to exterminate enemies, bandits, fighters, and foul-smelling creatures.",
        "source": "T03n0157_009:0224b16_55"
    },
    {
        "source_sentence": "令諸眾生增益壽命，我於爾時始捨舌耳。",
        "translation": "It's when I first abandoned my tongue to cause sentient beings to increase their life span.",
        "source": "T03n0157_009:0224b17_56"
    },
    {
        "source_sentence": "於彼三千大千世界一一天下，作如是等大利益已，以願力故，精進堅牢如是次第。",
        "translation": "After performing such great benefits in each of those 3,000 great one-thousand worlds, they'll do so in order because of the power of their vows, and their effort will will be firm and resolute like this.",
        "source": "T03n0157_009:0224b18_57"
    },
    {
        "source_sentence": "復於如是一恒河沙等五濁惡世作大利益，安止眾生住於善法及三乘中，",
        "translation": "“Furthermore, in such a world as numerous as the sands of one Ganges River with its five turbid and evil destinies, they bring great benefit to sentient beings, enabling them to live in the good Dharma and in the three vehicles.",
        "source": "T03n0157_009:0224b20_58"
    },
    {
        "source_sentence": "滅除怨賊、鬪諍、穢濁。",
        "translation": "He extinguishes enemies, thieves, fighters, and defilements.",
        "source": "T03n0157_009:0224b22_59"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224b23_60"
    },
    {
        "source_sentence": "其餘他方清淨世界，所有諸佛本行阿耨多羅三藐三菩提時，不說他過，",
        "translation": "In the other pure worlds elsewhere, all the buddhas who were originally engaged in unexcelled complete perfect enlightenment did not tell others of their faults.",
        "source": "T03n0157_009:0224b23_61"
    },
    {
        "source_sentence": "不為他人說麤惡言，不以力勢示現恐怖，不勸眾生於聲聞乘、辟支佛乘，",
        "translation": "They don’t speak harsh words for others, don’t show fear by force, and don’t encourage sentient beings to follow the vehicles of the śrāvakas or pratyekabuddhas.",
        "source": "T03n0157_009:0224b25_0"
    },
    {
        "source_sentence": "是故諸佛具滿成就阿耨多羅三藐三菩提已，得此清淨妙好世界，無諸罪名，",
        "translation": "For this reason, the buddhas have perfected highest, complete enlightenment. Having attained this pure and wonderful world, there are no names of blameworthiness.",
        "source": "T03n0157_009:0224b26_1"
    },
    {
        "source_sentence": "無有受戒，耳終不聞麤惡之言，無不善聲常聞法聲，離於一切不適意聲，",
        "translation": "Their ears do not hear unwholesome sounds, and they always hear the sound of the Teaching. They are free of all inappropriate sounds.",
        "source": "T03n0157_009:0224b28_2"
    },
    {
        "source_sentence": "於諸眾生而得自在，無有聲聞辟支佛名。",
        "translation": "They attain mastery over all sentient beings, and there's no name for śrāvakas or pratyekbuddhas.",
        "source": "T03n0157_009:0224c01_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224c02_4"
    },
    {
        "source_sentence": "我於恒河沙等大劫，如恒河沙等無佛國土五濁之世，以麤惡言斷命因緣恐怖眾生，",
        "translation": "“For as many great kalpas as there are grains of sand in the Ganges River, such as grains of sand in the Ganges River and so forth, I have no buddha land or any of the five turbid worlds.",
        "source": "T03n0157_009:0224c02_5"
    },
    {
        "source_sentence": "然後勸令安住善法及三乘中，是餘業故，令得如是弊惡世界，以不善音唱滿世界，",
        "translation": "Because of these other deeds, they cause to attain such a bad world and fill it with unwholesome sounds.",
        "source": "T03n0157_009:0224c04_6"
    },
    {
        "source_sentence": "是故今得不善眾生充滿世界，說三乘法，如我本願取佛世界調伏眾生，",
        "translation": "Because of this, I am now able to fill the world with unwholesome sentient beings and teach the teachings of the three vehicles. As I originally wished to take the buddha-world to tame sentient beings,",
        "source": "T03n0157_009:0224c06_7"
    },
    {
        "source_sentence": "其事如是。",
        "translation": "It's like this.",
        "source": "T03n0157_009:0224c08_8"
    },
    {
        "source_sentence": "我已如說精勤修集行菩提道，是故今得種子相似佛之世界，如我本願今得如是。",
        "translation": "I've already explained how to diligently cultivate the path of accumulation and practice enlightenment, so now I'll attain a seed-like buddha world like mine, just as I originally vowed to attain it.",
        "source": "T03n0157_009:0224c08_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0224c10_10"
    },
    {
        "source_sentence": "今我略說往昔所行檀波羅蜜。",
        "translation": "Now, I'll briefly explain the perfection of giving practiced in the past.",
        "source": "T03n0157_009:0224c10_11"
    },
    {
        "source_sentence": "我行檀波羅蜜時，過去諸菩薩行菩薩道時，亦無有能行如是行，未來之世行菩薩道，",
        "translation": "When I practiced the perfection of giving, there were no bodhisattvas in the past who practiced the path of enlightening beings. Nor could any of them practice such a path. In the future they would practice the path of enlightening beings.",
        "source": "T03n0157_009:0224c11_12"
    },
    {
        "source_sentence": "亦無有能行如是行。",
        "translation": "Nor is there anyone who can perform such a practice.",
        "source": "T03n0157_009:0224c13_13"
    },
    {
        "source_sentence": "我為菩薩行檀波羅蜜時，唯除過去八善丈夫：第一菩薩名曰一地得，在此南方一切過患國，",
        "translation": "When I was practicing the perfection of giving for the sake of enlightening beings, with the exception of the eight good men of the past, the first bodhisattva’s name was Anāthapiṇḍika. In all the troubled countries in the southern direction,",
        "source": "T03n0157_009:0224c13_14"
    },
    {
        "source_sentence": "成阿耨多羅三藐三菩提，號破煩惱光明如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "They attain unexcelled complete perfect enlightenment and are called the Tathāgata of the Light of the Destruction of Defilements, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, Tamer of Humans, Teacher of Gods and People, Buddha, Bhagavat.",
        "source": "T03n0157_009:0224c16_15"
    },
    {
        "source_sentence": "人壽百歲，於中說法，七日之後入般涅槃。",
        "translation": "At the place where the human life span was one hundred years, he preached the Dharma and entered parinirvāṇa seven days later.",
        "source": "T03n0157_009:0224c18_16"
    },
    {
        "source_sentence": "第二菩薩名精進清淨，在此東方炎熾國土，成阿耨多羅三藐三菩提，號曰功德如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "The second bodhisattva, named Vaiśravaṇa, accomplished anuttarii samyaksarrzbodhi in this blazing land of the eastern direction. His name was Samantabhadra Tathāgata, Arhat, Perfectly Enlightened One, Perfect in Knowledge and Conduct, Perfect in Goodness, Knower of the World, Unsurpassed, Tamer of Humans,",
        "source": "T03n0157_009:0224c19_17"
    },
    {
        "source_sentence": "人壽百歲，於中說法，作佛事已，彼佛過一恒河沙等大劫已，入無上涅槃，",
        "translation": "When the human life span was one hundred years, they preached the Dharma and performed buddha-works there. That buddha passed through a great kalpa equal to the number of grains of sand in the Ganges River and entered supreme nirvana.",
        "source": "T03n0157_009:0224c23_18"
    },
    {
        "source_sentence": "其佛舍利乃至今日，在無佛國作於佛事，如我無異。",
        "translation": "That Buddha's relics are no different from those of mine today, as I am doing buddha-works in a land where there are no buddhas.",
        "source": "T03n0157_009:0224c24_19"
    },
    {
        "source_sentence": "第三菩薩名堅固華，於諸三昧勤行精進，以大力勢行於布施，於當來世過十恒河沙等大劫，",
        "translation": "The third bodhisattva is called the steadfast flower. He exerts himself energetically in all concentrations, practicing generosity with great vigor for as many eons as there are grains of sand in ten Ganges Rivers in future ages.",
        "source": "T03n0157_009:0224c26_0"
    },
    {
        "source_sentence": "在此北方歡樂世界，成阿耨多羅三藐三菩提，號斷愛王如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "In the northern direction, in the happy world, he accomplished anuttarii samyaksarrzbodhi and was called King of Cessation Tathāgata, Arhat, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavā",
        "source": "T03n0157_009:0224c28_1"
    },
    {
        "source_sentence": "第四菩薩名曰慧熾攝取歡喜，過一大劫在此西方可畏世界，人壽百歲，",
        "translation": "The fourth bodhisattva, named Wisdom Fiery, embraced and rejoiced. After one great kalpa, the human life span in this fearsome world in the western direction was one hundred years.",
        "source": "T03n0157_009:0225a02_2"
    },
    {
        "source_sentence": "於中成阿耨多羅三藐三菩提，號日藏光明無垢尊王如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "At that, he achieved unsurpassed, correct, and complete enlightenment, which was called the Tathāgata, Worthy, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavān.",
        "source": "T03n0157_009:0225a03_3"
    },
    {
        "source_sentence": "於今我前，有二菩薩，一名日光，二名喜臂，未來之世過於無量無邊大劫，",
        "translation": "“In front of me now are two kinds of enlightening beings: the first is called Sunlight, and the second Joyful Arm. In the future more than an infinitely long eon,",
        "source": "T03n0157_009:0225a06_4"
    },
    {
        "source_sentence": "在此上方灰霧國土，劫名大亂，五濁惡世，多諸煩惱，人壽五十歲，日光菩薩以本願故，",
        "translation": "In the above-mentioned land of ash and mist, an eon called Great Disturbance, with five turbid and bad worlds and many afflictions, the human life span was fifty years.",
        "source": "T03n0157_009:0225a08_5"
    },
    {
        "source_sentence": "於中成阿耨多羅三藐三菩提，號不思議日光明如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "Among them he attained unexcelled complete perfect enlightenment and was called the Tathāgata of Inconceivable Sunlight. He was a Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha",
        "source": "T03n0157_009:0225a10_6"
    },
    {
        "source_sentence": "滿十歲中，具足佛事而般涅槃，即涅槃日正法亦滅，其後十歲，空過無佛，",
        "translation": "When he was ten years old, he accomplished all the buddha-works and entered nirvana. That is to say, on the day of his nirvana the true-dharma also disappeared. Ten years later, there would be nothing but emptiness and no Buddha.",
        "source": "T03n0157_009:0225a13_7"
    },
    {
        "source_sentence": "人壽轉減，至三十歲，喜臂菩薩以本願故，於中得成阿耨多羅三藐三菩提，",
        "translation": "The human life span decreased to thirty years of age. Because of his former vow, the bodhisattva Joy-armed Bodhisattva attained highest, complete enlightenment there.",
        "source": "T03n0157_009:0225a14_8"
    },
    {
        "source_sentence": "號勝日光明如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "He was called the Sun of Supreme Light Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavat.",
        "source": "T03n0157_009:0225a16_9"
    },
    {
        "source_sentence": "彼佛世尊亦十歲中，具足佛事而般涅槃，般涅槃已，以本願故，正法住世滿七十歲。",
        "translation": "The Buddha Bhagavat, the World-honored One, also completed the buddha-works and entered nirvana at the age of ten. Having entered nirvana, because of his original vow, the True Dharma abided in the world for seventy years.",
        "source": "T03n0157_009:0225a18_10"
    },
    {
        "source_sentence": "時二菩薩在於我前，始得授阿耨多羅三藐三菩提記，以聞記故，心生歡喜，",
        "translation": "“Then the two bodhisattvas who were present before me at that time had just begun to receive my prediction of highest, complete enlightenment. Because they had heard my prediction, their hearts rejoiced and thought:",
        "source": "T03n0157_009:0225a20_11"
    },
    {
        "source_sentence": "頭面敬禮。",
        "translation": "He bowed his head and face in reverence.",
        "source": "T03n0157_009:0225a22_12"
    },
    {
        "source_sentence": "「『如來光明，　　殊於日月，",
        "translation": "'The Tathāgata's light is different from that of the sun and moon,",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　能於惡世，　　演大智慧。",
        "translation": "In the evil world They can expound great knowledge and wisdom.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　調御自淨，　　無有垢穢，",
        "translation": "Their discipline is self-clean, without dirt or stain.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　以妙論議，　　摧伏外道。",
        "translation": "With marvelous arguments, he subdues non-Buddhists.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　我無量劫，　　修無相定，",
        "translation": "For immeasurable kalpas I cultivated signless concentration.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　以求無上，　　勝妙菩提。",
        "translation": "They seek the unsurpassed, supremely marvelous enlightenment.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　供養諸佛，　　數如恒沙，",
        "translation": "The number of offerings to the Buddhas is as numerous as the sands of the Ganges River.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　而過去佛，　　不授我記。",
        "translation": "But the buddhas of the past Did not give me any assurance of future enlightenment.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　世尊離欲，　　心得解脫，",
        "translation": "Bhagavān, you’re free of desire, And your mind is liberated.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　於黑闇世，　　善為佛事。",
        "translation": "In the world of darkness, he does good for the sake of the buddhas.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　為諸失道，　　眾生說法，",
        "translation": "He teaches the Dharma for the sake of sentient beings who have lost their path.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　悉令得出，　　生死漂流。",
        "translation": "They all allow them to escape, floating in birth and death.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　我今所願，　　於此自在，",
        "translation": "Whatever I wish for now, Regarding this mastery,",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　清淨佛法，　　出家修道。",
        "translation": "They purify the Buddha's teaching and leave home to cultivate it.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　解脫淨戒，　　如說而行，",
        "translation": "The pure precepts of liberation are practiced as they have been taught.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　定心觀佛，　　如影隨行。",
        "translation": "He observes the Buddha with a concentrated mind, Like a shadow following his steps.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　不為利養，　　但求正法，",
        "translation": "They don’t seek profit but seek the right teaching.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　得聞法已，　　服甘露味。",
        "translation": "After hearing the Dharma, he takes the taste of ambrosia.",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　是故世尊，　　與我授記，",
        "translation": "Therefore, the Bhagavān gave me this prediction:",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "　　於未來世，　　得無上道。』",
        "translation": "In the future, he'll attain the unsurpassed path.'",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "以歡喜故，上昇虛空高七多羅樹，叉手向佛異口同音，而說偈言：「善男子！",
        "translation": "Because of their joy, they rose up into the sky from the seven-tārā tree and saluted the Buddha with palms joined. They spoke to him in unison, saying in verse:",
        "source": "T03n0157_009:0225a22_13"
    },
    {
        "source_sentence": "其餘二人故未發心。",
        "translation": "It's because the other two people haven't yet arisen the intention.",
        "source": "T03n0157_009:0225b15_14"
    },
    {
        "source_sentence": "已發心者，一名日光，二名喜臂。",
        "translation": "Those who have already arisen the intention are called sunlight, and two are called joyful arm.",
        "source": "T03n0157_009:0225b15_15"
    },
    {
        "source_sentence": "先有四人，一名地得，二名精進淨，三名堅固華，四名慧熾攝取歡喜，",
        "translation": "First, there were four people. The first had attained the stages of enlightenment; the second was called the “purity of zeal.” The third was called the “unbreakable flower” [of enlightenment]. The fourth was called the “rejoicing one who is absorbed by the fire of wisdom”.",
        "source": "T03n0157_009:0225b16_16"
    },
    {
        "source_sentence": "合有八人，是六菩薩，我初勸其令發阿耨多羅三藐三菩提心。",
        "translation": "Together these eight were the six bodhisattvas, whom I first encouraged to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_009:0225b18_17"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0225b19_18"
    },
    {
        "source_sentence": "汝今諦聽，往昔因緣。",
        "translation": "Listen attentively now, regarding the causes and conditions of the past.",
        "source": "T03n0157_009:0225b19_19"
    },
    {
        "source_sentence": "過去無量阿僧祇劫，爾時，此界名無垢須彌，人壽百歲，有佛出世，號香蓮華，",
        "translation": "In the past, innumerable aeons ago, this world was called Pure Mountain. The human life span was one hundred years. A buddha named Lotus of Fragrance appeared in the world:",
        "source": "T03n0157_009:0225b20_20"
    },
    {
        "source_sentence": "般涅槃後，像法之中，我於爾時作大強力轉輪聖王，號難沮壞。",
        "translation": "After parinirvāṇa, I'll become a great powerful wheel-turning sage king in the midst of the Dharma like this, and I'll be called Difficult to Destroy.",
        "source": "T03n0157_009:0225b21_21"
    },
    {
        "source_sentence": "王閻浮提，千子具足，我悉勸化令發阿耨多羅三藐三菩提心，其後尋於香蓮華佛像法之中，",
        "translation": "The king of Jambudvfpa had a thousand sons, all of whom I encouraged and inspired with the determination for unexcelled, complete perfect enlightenment. After that I sought the buddha-dharma of the image of Samantabhadra Buddha in the midst of fragrant lotus blossoms.",
        "source": "T03n0157_009:0225b23_22"
    },
    {
        "source_sentence": "出家修道，熾然增益佛之遺法，唯除六子，不肯出家發菩提心。",
        "translation": "He renounced the householder’s life and practiced Buddhism in order to fervorously promote the legacy of the Buddha’s teachings. With the exception of his six children, he refused to renounce family life and aspired to enlightenment.",
        "source": "T03n0157_009:0225b25_23"
    },
    {
        "source_sentence": "我於爾時數數告言：『卿等！",
        "translation": "At that point, I repeatedly told them, 'You!",
        "source": "T03n0157_009:0225b27_24"
    },
    {
        "source_sentence": "今者欲何所求？",
        "translation": "What do you want now?",
        "source": "T03n0157_009:0225b27_25"
    },
    {
        "source_sentence": "何以不發無上道心出家修道？』",
        "translation": "Why doesn't he give rise to the mind of the unsurpassed path and leave home to cultivate it?'",
        "source": "T03n0157_009:0225b28_26"
    },
    {
        "source_sentence": "是時六子作如是言：『不應出家。",
        "translation": "The six sons then said, 'Shouldn't you leave home?",
        "source": "T03n0157_009:0225b28_27"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T03n0157_009:0225b29_28"
    },
    {
        "source_sentence": "若於末世像法出家，不能成就護持戒聚，離聖七財，以不護戒，沒於生死污泥之中，",
        "translation": "If someone leaves home in the latter age to follow the Dharma, they won’t be able to accomplish the group of those who observe precepts, part with the noble seven possessions, and because they don’t observe precepts, they’ll fall into the mud of birth-and-death.",
        "source": "T03n0157_009:0225b29_29"
    },
    {
        "source_sentence": "墮三惡道，不能得生天上人中。",
        "translation": "They'll fall into the three bad destinies, and they won't be born among gods or humans.",
        "source": "T03n0157_009:0225c02_30"
    },
    {
        "source_sentence": "以是因緣，我等不能出家修道。』",
        "translation": "Because of these causes and conditions, we can't leave home and cultivate it.'",
        "source": "T03n0157_009:0225c03_31"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0225c04_32"
    },
    {
        "source_sentence": "我復重問：『卿等何以不發無上道心？』",
        "translation": "Again, I asked, 'Why don't you give rise to the mind of the unsurpassed path?'",
        "source": "T03n0157_009:0225c04_33"
    },
    {
        "source_sentence": "六子答言：『若能與我閻浮提者，然後我當發阿耨多羅三藐三菩提心。』",
        "translation": "The sixth son answered, 'If you can give me Jambudvīpa, then I will give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T03n0157_009:0225c05_34"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0225c07_35"
    },
    {
        "source_sentence": "我聞是已，心生歡喜，作是思惟：『我今已化閻浮提人，安置三歸、受八戒齋、住於三乘，",
        "translation": "Having heard these words, my mind was overjoyed and thought: I have now transformed the people of Jambudvfpa into followers of the holy Dharma. They will be established in the three refuges, observe the eight precepts, and practice the three vehicles.",
        "source": "T03n0157_009:0225c07_36"
    },
    {
        "source_sentence": "我今當分此閻浮提以為六分與此六子，令其得發無上道心，然後我當出家修道。』",
        "translation": "Now, I will divide this Jambudvīpa into six parts and give them to these six children so that they'll attain the mind of the unsurpassed path, and then I'll leave home and cultivate it.'",
        "source": "T03n0157_009:0225c09_37"
    },
    {
        "source_sentence": "思惟是已，如其所念，分閻浮提即為六分，賜與諸子，尋便出家。",
        "translation": "After he thought this, he divided the Jambudvīpa into six parts according to what he thought, gave them to his children, and then left home.",
        "source": "T03n0157_009:0225c11_38"
    },
    {
        "source_sentence": "爾時六王，各相違戾，不相承順，互相抄掠、攻伐、鬪諍、縛束、枷鎖。",
        "translation": "At the time, each of the six kings was at odds with the other and didn't obey one another, plundering, attacking, fighting, binding, and fetters.",
        "source": "T03n0157_009:0225c12_39"
    },
    {
        "source_sentence": "爾時，一切閻浮提內苗稼不登，人民飢餓，水雨不時，諸樹枯悴，不生華實，",
        "translation": "At that time all the native crops in Jambudvfpa did not grow, and the people were starving. The water and rain didn’t come at the right time. The trees withered and failed to produce any flowers or fruit.",
        "source": "T03n0157_009:0225c14_40"
    },
    {
        "source_sentence": "藥草不生，人民、禽獸及諸飛鳥，悉皆飢餓，其身熾然猶如火聚。",
        "translation": "People, animals, birds, and flying birds all suffer from hunger. Their bodies are as blazing as a heap of fire.",
        "source": "T03n0157_009:0225c16_41"
    },
    {
        "source_sentence": "我於爾時，復自思惟：『我今應當自捨己身肌體血肉，以施眾生令其飽滿。』",
        "translation": "At that point, I also thought to myself, 'Now, I should abandon my own body, flesh, blood, and flesh for the sake of sentient beings so that they'll be satisfied.'",
        "source": "T03n0157_009:0225c17_42"
    },
    {
        "source_sentence": "作是念已，從其所住阿蘭若處，至於人間，中路有山，名水愛護，住是山上，",
        "translation": "After he had this thought, he left the forest where he was staying and went among the people. On the middle of the road there was a mountain named Water Lover who lived on top of that mountain.",
        "source": "T03n0157_009:0225c19_43"
    },
    {
        "source_sentence": "「『如我自捨，　　所有身命，",
        "translation": "'It's like when I abandoned my own body and life,",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　為大悲心，　　不求果報，",
        "translation": "With great compassion, they do not seek rewards.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　但為利益，　　諸天及人，",
        "translation": "It's only for the benefit of gods and humans.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　願作肉山，　　給施眾生。",
        "translation": "I wish to make a mountain of flesh and give it to sentient beings.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　我今所捨，　　妙色端嚴，",
        "translation": "What I’ve abandoned now Is of marvelous color and adornment.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　不求帝釋，　　天魔梵王，",
        "translation": "They don't seek Indra, gods, Māra, or Brahmā,",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　但為利益，　　未來人天，",
        "translation": "It's only for the benefit of future humans and gods.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　以此血肉，　　施諸眾生，",
        "translation": "Give this flesh and blood To all sentient beings,",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　諸天龍神，　　人及非人。",
        "translation": "The gods, nāgas, devas, humans, and nonhumans.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　住山林者，　　今聽我言，",
        "translation": "Those who live in mountain forests, listen to my words now.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　為諸眾生，　　我起大悲，",
        "translation": "For the sake of sentient beings, I give rise to great compassion.",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "　　自以血肉，　　而給施之。』",
        "translation": "Give it to him with your own flesh and blood.'",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "復作是願，而說偈言：「善男子！",
        "translation": "Again, he made this vow and spoke a verse, Good man!",
        "source": "T03n0157_009:0225c21_0"
    },
    {
        "source_sentence": "我於爾時作是願已，諸天搔嬈，大地、諸山、須彌、大海皆六種動，人天大眾發聲悲號。",
        "translation": "After I made this vow at that time, the gods scratched the earth, mountains, Mount Sumeru, and the ocean all moved in six ways, and the masses of humans and gods cried out in pity.",
        "source": "T03n0157_009:0226a05_1"
    },
    {
        "source_sentence": "爾時，我於水愛護山，自投其身，以願力故，即成肉山，高一由旬，縱廣正等亦一由旬。",
        "translation": "At that time I loved the water and protected the mountains. By my willpower I built a mountain of flesh one yojana high and one yojana long, one yojana long and one yojana wide.",
        "source": "T03n0157_009:0226a07_2"
    },
    {
        "source_sentence": "是時，人民、飛鳥、禽獸，始於是時噉肉飲血。",
        "translation": "It was then that the people, flying birds, and animals began to eat meat and drink blood.",
        "source": "T03n0157_009:0226a09_3"
    },
    {
        "source_sentence": "以本願故，於夜中分，增益廣大其身，乃至高千由旬，縱廣正等亦千由旬，",
        "translation": "In the middle of the night his body grows as large as a thousand yojanas in height and one thousand yojanas in width.",
        "source": "T03n0157_009:0226a10_4"
    },
    {
        "source_sentence": "其邊自然而生人頭、髮毛、眼耳、鼻口、脣舌，具足而有。",
        "translation": "At their sides, a human head, hair, eyes, ears, nose, mouth, lips, and tongue will naturally grow, and they'll all exist.",
        "source": "T03n0157_009:0226a11_5"
    },
    {
        "source_sentence": "彼諸頭中，各各有聲而唱是言：『諸眾生等，各各自恣隨意取用，飲血、噉肉，",
        "translation": "In each of those heads, they each had a voice that said, 'Each of these sentient beings and so forth, each freely taking what he wishes to drink blood or abscess flesh.",
        "source": "T03n0157_009:0226a13_0"
    },
    {
        "source_sentence": "取頭目耳鼻、脣舌齒等，皆令滿足，然後悉發阿耨多羅三藐三菩提心，",
        "translation": "He takes the hair, eyes, ears, nose, lips, tongue, and teeth, and causes them all to be fulfilled, and then he gives rise to the mind of unexcelled complete perfect enlightenment.",
        "source": "T03n0157_009:0226a14_1"
    },
    {
        "source_sentence": "或發聲聞辟支佛心。",
        "translation": "Perhaps they give rise to the minds of śrāvakas and pratyekbuddhas.",
        "source": "T03n0157_009:0226a16_2"
    },
    {
        "source_sentence": "卿等！",
        "translation": "You!",
        "source": "T03n0157_009:0226a16_3"
    },
    {
        "source_sentence": "當知如是之物悉不可盡，食之易消，不夭壽命。』",
        "translation": "You should know that all these things are inexhaustible, and when you eat them, it's easy to digest without dying.'",
        "source": "T03n0157_009:0226a16_4"
    },
    {
        "source_sentence": "「有明智者，食肉飲血，取其頭目耳鼻舌者，或發聲聞辟支佛乘，或發阿耨多羅三藐三菩提心，",
        "translation": "“Some wise people eat meat and drink blood, taking their heads, eyes, ears, nose, and tongue, or they may give rise to the vehicle of śrāvakas and pratyekbuddhas, or they may give rise to the mind of unexcelled complete perfect enlightenment.",
        "source": "T03n0157_009:0226a18_5"
    },
    {
        "source_sentence": "或求天上人中富樂。",
        "translation": "Or they may seek the wealth and happiness of gods and humans.",
        "source": "T03n0157_009:0226a20_6"
    },
    {
        "source_sentence": "以本願故，身無損減，乃至萬歲，閻浮提內人及鬼神、飛鳥、禽獸，皆悉充足。",
        "translation": "Because of his original vow, his body didn't decline even for ten thousand years, and the people in Jambudvīpa, ghosts, spirits, flying birds, and animals were all plentiful.",
        "source": "T03n0157_009:0226a20_7"
    },
    {
        "source_sentence": "於萬歲中所施目如一恒河沙，所施血如四大海水，所捨肉如千須彌山，",
        "translation": "For ten thousand years the donor’s eyes were as numerous as the grains of sand in one Ganges River. The blood they gave was as large as the four great oceans of water, and the flesh they gave away was as big as a thousand polar mountains.",
        "source": "T03n0157_009:0226a22_8"
    },
    {
        "source_sentence": "所捨舌如大鐵圍山，所捨耳如純陀羅山，所捨鼻如毘富羅山，所捨齒如耆闍崛山，",
        "translation": "The tongue they abandoned was as big as a great circular mountain of iron; the ears they abandoned were as high as Mount Cunda; the noses they abandoned were as high as Mount Videha; and the teeth they abandoned were as high as Mount Gṛdhrakūṭa.",
        "source": "T03n0157_009:0226a24_9"
    },
    {
        "source_sentence": "所捨身皮，猶如三千大千世界所有地等。",
        "translation": "It's like the land that exists in 3,000 great one-thousand worlds.",
        "source": "T03n0157_009:0226a26_10"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0226a27_11"
    },
    {
        "source_sentence": "汝今當知，我於往昔萬歲之中，所捨無量無邊阿僧祇身，一壽命中，自以血肉給施如是無量無邊阿僧祇眾生，",
        "translation": "You should now know that in the past ten thousand years ago I abandoned an infinite number of myriad bodies, and during one lifetime I gave blood and flesh to such an infinite number of living beings.",
        "source": "T03n0157_009:0226a27_12"
    },
    {
        "source_sentence": "悉令飽足，乃至一念不生悔心。",
        "translation": "They'll all be satisfied, and even a single thought won't give rise to regret.",
        "source": "T03n0157_009:0226a29_13"
    },
    {
        "source_sentence": "我於爾時復作是言：『若我必定成阿耨多羅三藐三菩提，所願成就得己利者，",
        "translation": "At that point, I also said, 'If I were to surely attain unexcelled complete perfect enlightenment and fulfill what I wish to attain for my own benefit,",
        "source": "T03n0157_009:0226b01_14"
    },
    {
        "source_sentence": "我今於此一閻浮提萬歲之中，自以血肉給施一切無量眾生，如是一恒河沙等萬歲，",
        "translation": "In this one Jambudvipa, for ten thousand years I give my own blood and flesh to all the innumerable sentient beings.",
        "source": "T03n0157_009:0226b03_15"
    },
    {
        "source_sentence": "遍滿於此無垢須彌三千大千世界，作血肉山，一一天下於萬歲中，自以血肉頭目耳等，",
        "translation": "He filled the 3,000 great one-thousand worlds of this Immaculate polar mountain and created a mountain of flesh and blood. For ten thousand years, each world produced its own flesh, blood, hair, eyes, ears, and so forth.",
        "source": "T03n0157_009:0226b05_16"
    },
    {
        "source_sentence": "給施眾生，所謂天龍、鬼神、人及非人、一切畜生，若在虛空及因地者，",
        "translation": "They give to sentient beings, which are called gods, dragons, ghosts, spirits, humans, non-humans, and all animals. If they were in space or the causal ground,",
        "source": "T03n0157_009:0226b07_17"
    },
    {
        "source_sentence": "乃至餓鬼悉令滿足，然後勸化安置住於三乘法中。",
        "translation": "Even the hungry ghosts are all made to fulfill it, and then they're encouraged to stay in the three-vehicle teaching.",
        "source": "T03n0157_009:0226b09_18"
    },
    {
        "source_sentence": "若遍於此一佛世界，滿足眾生已，復至十方如一恒河沙等五濁惡世，復給血肉頭目耳等，",
        "translation": "Suppose he were to pervade this one buddha-world, satisfying sentient beings, and then go to the ten directions like the sands of a Ganges River in five turbid bad worlds, and give them blood, flesh, hair, eyes, ears, and so forth.",
        "source": "T03n0157_009:0226b10_19"
    },
    {
        "source_sentence": "給施眾生悉令充足。",
        "translation": "They give to sentient beings and make them all abundant.",
        "source": "T03n0157_009:0226b12_20"
    },
    {
        "source_sentence": "如是如一恒河沙等大劫之中為眾生故，自捨身命以施眾生。",
        "translation": "Thus, for the sake of sentient beings in a great eon as numerous as the grains of sand in one Ganges River, they give up their own bodies and lives to sentient beings.",
        "source": "T03n0157_009:0226b13_21"
    },
    {
        "source_sentence": "若我所願不成，不得己利者，即便欺誑十方世界無量無邊諸佛世尊，為諸眾生轉法輪者，",
        "translation": "If my wishes aren’t fulfilled, and I don’t attain self-benefit, I will deceive the buddhas of the ten directions who turn the wheel of the Dharma for sentient beings.",
        "source": "T03n0157_009:0226b14_22"
    },
    {
        "source_sentence": "必定不成阿耨多羅三藐三菩提，住於生死，畢竟不聞佛聲、法聲、比丘僧聲、波羅蜜聲、力無畏聲、乃至一切諸善根聲。",
        "translation": "They mustn't attain supreme perfect enlightenment and abide in birth-and-death, and ultimately they won't hear the sounds of buddhas, dharmas, monks, bhikṣus, pāramitās, powers, fearlessness, or even all the sounds of good roots.",
        "source": "T03n0157_009:0226b16_23"
    },
    {
        "source_sentence": "若我不能成就捨身布施，充足諸眾生者，常墮阿鼻地獄。』",
        "translation": "If I can't accomplish giving up my body and satisfy sentient beings, I'll always fall into the avīci hell.'",
        "source": "T03n0157_009:0226b19_24"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0226b20_25"
    },
    {
        "source_sentence": "我於往昔，如是所願皆悉成就，於一一天下捨身血肉，給施眾生悉令飽滿。",
        "translation": "In the past I fulfilled all these vows, and in each world I gave away my body, flesh, and blood to give to sentient beings so that they would all be satisfied.",
        "source": "T03n0157_009:0226b21_26"
    },
    {
        "source_sentence": "如是次第遍滿十方如恒河沙等諸佛世界，捨身血肉給施眾生悉令滿足。",
        "translation": "In order, they fill the ten directions with buddha worlds as numerous as the sands of the Ganges River and give their bodies, flesh, and blood to sentient beings so that they'll all be fulfilled.",
        "source": "T03n0157_009:0226b22_27"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0226b24_28"
    },
    {
        "source_sentence": "汝今當知，我於爾時為檀波羅蜜捨身布施，如是次第施於眼目，其聚滿此閻浮提內，",
        "translation": "You should now know that at that time I gave away my body as almsgiving for the sake of the sandalwood-pāramitā, giving it in this order to the eye and eyes.",
        "source": "T03n0157_009:0226b24_29"
    },
    {
        "source_sentence": "高至忉利天。",
        "translation": "It's as high as the Heaven of the Thirty-three Gods.",
        "source": "T03n0157_009:0226b26_30"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0226b27_31"
    },
    {
        "source_sentence": "是名如來略說捨身檀波羅蜜。",
        "translation": "This is called the Tathāgata's brief explanation of the perfection of giving up one's body.",
        "source": "T03n0157_009:0226b27_32"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T03n0157_009:0226b28_33"
    },
    {
        "source_sentence": "如是復過無量無邊阿僧祇劫，爾時此界轉名月電，亦五濁世。",
        "translation": "In the same way, after innumerable, boundless, and incalculable kalpas have passed, at that very moment this world becomes known as the lightning of the moon. It also has five turbid worlds:",
        "source": "T03n0157_009:0226b28_34"
    },
    {
        "source_sentence": "我於爾時作轉輪聖王，王閻浮提，號燈光明，亦教無量無邊阿僧祇人，",
        "translation": "At that time I was the universal ruler of Jambudvfpa. My name was Dāryapradīpa, and I also taught it to immeasurable, limitless, incalculable numbers of people.",
        "source": "T03n0157_009:0226b29_35"
    },
    {
        "source_sentence": "安止住於諸善法中，亦如上說。",
        "translation": "Abiding peacefully in good dharmas is likewise as explained above.",
        "source": "T03n0157_009:0226c02_36"
    },
    {
        "source_sentence": "作是事已，遊在園林，觀看土地，見有一人身被束縛，我即問言：『此何所犯？』",
        "translation": "After doing this, he traveled to the garden and looked at the land and saw a man tied up in fetters, and I asked, 'What's the offense here?'",
        "source": "T03n0157_009:0226c03_37"
    },
    {
        "source_sentence": "大臣白言：『諸有田作所得穀麥，應為六分，一分入官。",
        "translation": "The ministers said, 'There are fields that produce grain and wheat that should be made into six parts, and one part of it will go to the officials.",
        "source": "T03n0157_009:0226c05_38"
    },
    {
        "source_sentence": "是人不順王法，不肯輸送，是故被縛。』",
        "translation": "That person doesn't obey the king's teaching and won't transport it; therefore, they're bound.'",
        "source": "T03n0157_009:0226c06_39"
    },
    {
        "source_sentence": "我於爾時即勅令放，從今已後，不須強取。",
        "translation": "At that point, I immediately ordered him to be released, and from now on, there's no need to force him to do so.",
        "source": "T03n0157_009:0226c07_40"
    },
    {
        "source_sentence": "大臣答言：『是人民中，乃至無有一人生歡喜心，以義送之。",
        "translation": "The minister answered, 'There's not a single person among the people who rejoices in their hearts and sends them off with meaning.",
        "source": "T03n0157_009:0226c08_41"
    },
    {
        "source_sentence": "今諸王子、後宮眷屬、貴人婇女，諸所資用飲食之具，一切皆從他邊強取，",
        "translation": "The princes, the ladies of their rear palaces, the wealthy women, and the food and drink provisions they provide are all forcibly obtained from someone else.",
        "source": "T03n0157_009:0226c09_42"
    },
    {
        "source_sentence": "無有一人清淨心與。』",
        "translation": "There's no one person who gives it to a pure mind.'",
        "source": "T03n0157_009:0226c11_43"
    },
    {
        "source_sentence": "「我聞是已，心大憂愁，即自思惟：『此閻浮提當持與誰？』",
        "translation": "After hearing this, I became greatly distressed and thought to myself, 'Who will give it to this Jambudvīpa?'",
        "source": "T03n0157_009:0226c11_44"
    },
    {
        "source_sentence": "爾時，我有五百諸子，先已令發無上道心。",
        "translation": "At the time, I had five hundred children who had previously made me give rise to the mind of the unsurpassed path.",
        "source": "T03n0157_009:0226c13_0"
    },
    {
        "source_sentence": "『當分此地為五百分等與諸子，我當出家至阿蘭若處，修諸仙法，學梵淨行。』",
        "translation": "'Should you divide this place into five hundred parts equally and give it to my children, and I'll leave home and go to the forest where he cultivates the sage-dharma and trains in the pure practice of Brahmā?'",
        "source": "T03n0157_009:0226c14_0"
    },
    {
        "source_sentence": "思惟是已，尋分此地為五百分，等與諸子，即便出家，至南海邊欝頭摩樹大林之中，",
        "translation": "Having thought thus, he divided the land into five hundred parts and gave them equally to his children. Then he renounced household life and went to live in a big forest of white lotus trees on the southern shore of the South Sea.",
        "source": "T03n0157_009:0226c15_1"
    },
    {
        "source_sentence": "食諸果子漸漸修學，得五神通。",
        "translation": "Eating the fruits, they gradually cultivate their training and attain the five supernormal powers.",
        "source": "T03n0157_009:0226c17_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0226c18_3"
    },
    {
        "source_sentence": "時閻浮提有五百商人，入於大海欲採珍寶。",
        "translation": "At the time, there were five hundred merchants in Jambudvīpa who went into the ocean to gather treasure.",
        "source": "T03n0157_009:0226c18_4"
    },
    {
        "source_sentence": "有一商主名曰滿月，此人先世福德緣故，得如所願至於寶渚，多取種種諸珍寶已，",
        "translation": "There was a merchant lord named Candracchattra. Because of the blessedness and virtue of his former existence, he reached the jeweled island as he wished and obtained many kinds of rare treasures.",
        "source": "T03n0157_009:0226c19_5"
    },
    {
        "source_sentence": "即欲發引還閻浮提。",
        "translation": "He then wanted to give rise to the intention to return to Jambudvīpa.",
        "source": "T03n0157_009:0226c21_6"
    },
    {
        "source_sentence": "爾時海神高聲涕哭，多有諸龍心懷瞋恚欲害商人。",
        "translation": "It was then that the sea gods raised their voices in tears and cried, and many dragons became angry and wanted to harm the merchants.",
        "source": "T03n0157_009:0226c22_7"
    },
    {
        "source_sentence": "有一龍王名曰馬堅，是大菩薩，以本願故生於龍中，起發悲心，救護諸商，",
        "translation": "There was a dragon king named Ma Jian, the great bodhisattva. Because of his past vows he was born among the dragons and became compassionate to rescue the merchants.",
        "source": "T03n0157_009:0226c23_8"
    },
    {
        "source_sentence": "令得安隱過於大海至彼岸邊，龍王然後還本住處。",
        "translation": "So that they'll attain peace and cross the ocean to the other side, and then the dragon king returns to his original dwelling place.",
        "source": "T03n0157_009:0226c25_9"
    },
    {
        "source_sentence": "爾時復有大惡羅剎，隨逐商人，如影隨形，欲為虐害，是惡羅剎即於其日放大惡風。",
        "translation": "At the time, there was another great bad Rāṣṭrapāla who followed the merchants, following their form like a shadow and wanting to harm them. That bad Rāṣṭrapāla then blew a bad wind on that day.",
        "source": "T03n0157_009:0226c26_10"
    },
    {
        "source_sentence": "時諸商人迷悶失道，生大怖畏，失聲號哭，稱喚諸天摩醯首羅、水神、地神、火神、風神，",
        "translation": "The merchants were confused and lost their way. They became greatly frightened, cried out in fear, and wailed aloud to the gods Mahêśvara, the water gods, the earth gods, the fire gods, and the wind gods.",
        "source": "T03n0157_009:0226c28_11"
    },
    {
        "source_sentence": "復稱父母、妻子、眷屬，願救濟我。",
        "translation": "They also call their parents, wives, and members of their retinues to help them.",
        "source": "T03n0157_009:0227a01_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227a02_13"
    },
    {
        "source_sentence": "我於爾時以淨天耳聞其音聲，尋往其所，以柔軟音而慰撫之：『莫生怖畏，",
        "translation": "At that time, hearing the sound of his voice with my pure celestial ears, I went to him and comforted him in a gentle voice:",
        "source": "T03n0157_009:0227a02_14"
    },
    {
        "source_sentence": "當示汝道，令汝安隱還閻浮提。』",
        "translation": "I will show you the way and make you return to Jambudvīpa in peace.'",
        "source": "T03n0157_009:0227a04_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227a05_16"
    },
    {
        "source_sentence": "我於爾時白疊縛臂，以油灌之，然以為炬，發真實言：『我先以於欝頭摩林三十年中，",
        "translation": "At that time I covered my arms with white cloth and poured oil over them to make a torch. Then I said in truth, “For thirty years ago at the top of Mount Sumeru (i.e., Trāyastriṃśa Heaven)",
        "source": "T03n0157_009:0227a05_17"
    },
    {
        "source_sentence": "專精修行四無量心，為諸眾生食噉果子，勸化八萬四千諸龍、夜叉、神等，",
        "translation": "He concentrated his efforts on cultivating the four immeasurable states of mind, feeding sentient beings with fruit and encouraging eighty-four thousand dragons, yakṣas, spirits, and so forth.",
        "source": "T03n0157_009:0227a07_18"
    },
    {
        "source_sentence": "不退轉於阿耨多羅三藐三菩提。",
        "translation": "They don't regress from unsurpassed, correct, and complete enlightenment.",
        "source": "T03n0157_009:0227a09_19"
    },
    {
        "source_sentence": "以是善根因緣，今然此臂為示道故，令是諸商安隱得還閻浮提中。』",
        "translation": "Because of the causes and conditions of these good roots, this arm now serves to show the path so that those merchants will be able to return to Jambudvīpa in peace.'",
        "source": "T03n0157_009:0227a09_20"
    },
    {
        "source_sentence": "然臂乃至七日七夜，此諸商人尋便安隱還閻浮提。",
        "translation": "For seven days and nights, however, these merchants sought refuge and returned safely back to Jambudvīpa.",
        "source": "T03n0157_009:0227a11_21"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227a12_22"
    },
    {
        "source_sentence": "我於爾時復作善願：『若閻浮提無諸珍寶，若我必成阿耨多羅三藐三菩提，",
        "translation": "At that time I also made the following aspiration: If there were no treasures in Jambudvfpa, how could I attain highest, complete enlightenment?",
        "source": "T03n0157_009:0227a12_23"
    },
    {
        "source_sentence": "得己利者，當作商主，於一一天下，七返雨寶。",
        "translation": "He who obtains his own profit will become a merchant lord, and he'll rain treasure seven times in each of the worlds.",
        "source": "T03n0157_009:0227a14_24"
    },
    {
        "source_sentence": "復入大海取如意珠，於一一天下，復雨種種雜廁寶物。",
        "translation": "Again, he entered the great ocean to obtain the wish-granting pearl, and in each of the worlds it rained various kinds of mixed toiletries and treasures.",
        "source": "T03n0157_009:0227a15_25"
    },
    {
        "source_sentence": "如是次第遍此世界，乃至十方無量無邊阿僧祇諸世界中，亦復如是。』",
        "translation": "So it is when they pervade this world in order, up to measureless and limitless incalculable worlds in the ten directions.'",
        "source": "T03n0157_009:0227a17_26"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227a18_27"
    },
    {
        "source_sentence": "我於往昔諸所發願皆悉成就，如恒河沙等大劫中，常作無上薩薄之主，",
        "translation": "“All my past vows have been fulfilled, like the sands of the Ganges River. For eons as numerous as the grains of sand in the Ganges River, I have always been the supreme lord of the sahā world.",
        "source": "T03n0157_009:0227a18_28"
    },
    {
        "source_sentence": "於恒河沙等五濁惡世，雨種種珍寶，一日之中，七返雨之，如是利益無量眾生，",
        "translation": "In the five turbid and evil worlds as numerous as the grains of sand in the Ganges River, he showered various treasures. Within a single day he rained these treasures seven times over for the benefit of countless sentient beings.",
        "source": "T03n0157_009:0227a20_29"
    },
    {
        "source_sentence": "悉令珍寶得滿足已，然後勸化安止，令住於三乘中。",
        "translation": "He causes all the treasures to be fulfilled, then encourages them to be settled and made to abide in the three vehicles.",
        "source": "T03n0157_009:0227a22_30"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227a23_31"
    },
    {
        "source_sentence": "汝今當知。",
        "translation": "You should now know this.",
        "source": "T03n0157_009:0227a23_32"
    },
    {
        "source_sentence": "即是如來捨諸珍寶，為得諸相善根因緣。",
        "translation": "That's the cause and condition for the Tathāgata to abandon his treasures in order to attain the good roots of characteristics.",
        "source": "T03n0157_009:0227a24_33"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T03n0157_009:0227a25_34"
    },
    {
        "source_sentence": "如是復過無量無邊阿僧祇劫，此佛世界轉名為網，劫名知具足，其世五濁，",
        "translation": "“Furthermore, after innumerable, limitless, and incalculable kalpas had passed, this buddha world evolved to be called ‘network.’ The eon was called ‘complete with knowledge.’ This world was fivefold:",
        "source": "T03n0157_009:0227a25_35"
    },
    {
        "source_sentence": "人民壽命滿五萬歲。",
        "translation": "The life span of the people was fifty thousand years.",
        "source": "T03n0157_009:0227a27_36"
    },
    {
        "source_sentence": "以本願故，生閻浮提婆羅門家，字曰須香，讀誦外典闡陀章句。",
        "translation": "Because of his original vow, he was born in the house of a Brahman named Sugandha in Jambudvfpa and recited the icchantika chapters and verses of non-Buddhist scriptures.",
        "source": "T03n0157_009:0227a27_37"
    },
    {
        "source_sentence": "爾時，眾生多著常見，互共鬪諍，起怨賊想。",
        "translation": "At the time, many sentient beings were attached to common views and fought with each other, giving rise to thoughts of enemies and thieves.",
        "source": "T03n0157_009:0227a29_38"
    },
    {
        "source_sentence": "我於爾時以強力勢，為諸眾生說五受陰猶如怨家，說十二入如空聚落，",
        "translation": "At the time, I was teaching sentient beings about the five acquired aggregates as resembling a house of enemies and saying that the twelve sense-fields are like an empty village.",
        "source": "T03n0157_009:0227b01_39"
    },
    {
        "source_sentence": "說十二緣其性生滅，開示分別阿那婆那，令其修學，復作是言：『仁等！",
        "translation": "He explains the twelve conditions for their arising and ceasing by nature, reveals the discernment of anāvana, causes them to cultivate it, and then says, 'Friends!",
        "source": "T03n0157_009:0227b02_40"
    },
    {
        "source_sentence": "今者可發無上菩提之心，所作善根應生迴向。』",
        "translation": "Now, you can give rise to the mind of unsurpassed enlightenment, and the good roots you create should give rise to dedication.'",
        "source": "T03n0157_009:0227b04_41"
    },
    {
        "source_sentence": "我於是時自然而得五通神仙。",
        "translation": "At that point, I naturally attained the five supernormal powers of the gods and sages.",
        "source": "T03n0157_009:0227b05_42"
    },
    {
        "source_sentence": "爾時，復有無量無邊阿僧祇人，受我教故，悉得五通。",
        "translation": "At the time, there were also measureless and limitless incalculable numbers of people who accepted my teaching and all attained the five supernormal powers because they did so.",
        "source": "T03n0157_009:0227b06_43"
    },
    {
        "source_sentence": "復有無量無邊眾生，遠離鬪諍，滅除怨憎，出家入山，食果蓏子，晝夜修集四無量心。",
        "translation": "Again, there are measureless and limitless sentient beings who are free of fighting, extinguishing grudges, leaving home and entering the mountains, eating fruit and grapes, and cultivating the four immeasurable states of mind day and night.",
        "source": "T03n0157_009:0227b07_44"
    },
    {
        "source_sentence": "是劫欲盡，是諸人等各各分散，遊閻浮提教化眾生，令離鬪諍，除滅怨憎，",
        "translation": "When the kalpa was about to end, these people each scattered and traveled to Jambudvfpa to edify sentient beings so that they would be freed from fighting and rid themselves of enemies.",
        "source": "T03n0157_009:0227b09_45"
    },
    {
        "source_sentence": "悉使寂靜，或有水旱、暴風、惡雨，皆令除滅，其地柔軟，五穀成熟，",
        "translation": "The soil is soft and the five kinds of crops are ripe.",
        "source": "T03n0157_009:0227b11_46"
    },
    {
        "source_sentence": "食噉滋味。",
        "translation": "He eats the taste of salty food.",
        "source": "T03n0157_009:0227b12_47"
    },
    {
        "source_sentence": "以劫欲盡，眾生復為種種病苦之所纏惱。",
        "translation": "Because the eon was about to end, sentient beings were again tormented by various illnesses and pains.",
        "source": "T03n0157_009:0227b13_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227b14_0"
    },
    {
        "source_sentence": "我於爾時尋復思惟：『若我不能除眾生病，我則不成阿耨多羅三藐三菩提，",
        "translation": "At that time I thought again and again: If I were unable to remove the sicknesses of all living beings, I would not attain anuttarii samyaksarrzbodhi.",
        "source": "T03n0157_009:0227b14_1"
    },
    {
        "source_sentence": "為諸眾生斷除煩惱。",
        "translation": "It's for the sake of sentient beings who have cut off their afflictions.",
        "source": "T03n0157_009:0227b15_2"
    },
    {
        "source_sentence": "我今當以何等方便除眾生病？",
        "translation": "What method will I use now to remove the sicknesses of all people?",
        "source": "T03n0157_009:0227b16_3"
    },
    {
        "source_sentence": "唯有聚集一切大眾、釋天、梵天、四天王等，及諸天仙、龍仙、人仙，",
        "translation": "They assembled all the great assemblies, the gods of the Śākyas, Brahmā gods, the Trāyastriṃśa gods, the four guardian gods of heaven, as well as other deva sages, nāga sages, and human sages.",
        "source": "T03n0157_009:0227b17_4"
    },
    {
        "source_sentence": "問諸醫方，合集諸草，種種呪術，以療眾病。』",
        "translation": "He asks about the doctor's prescriptions, gathers together the herbs and various spells to treat illnesses.'",
        "source": "T03n0157_009:0227b18_5"
    },
    {
        "source_sentence": "思惟是已，即以神力至釋天、梵天、四天大王，及諸天、神龍、人仙所，",
        "translation": "Having thought thus, he went by spiritual power to the abode of the gods Śakra Devānām-Indra, Brahmā Devānām-Indra, the great kings of the four deva-heavens, as well as other gods, spirits, nāgas, humans, and holy ones.",
        "source": "T03n0157_009:0227b19_6"
    },
    {
        "source_sentence": "作如是言：『有毘陀山，願諸仁等皆共來集。』",
        "translation": "He said, 'There's Mount Veda, may all the kinds of people come together to assemble.'",
        "source": "T03n0157_009:0227b21_7"
    },
    {
        "source_sentence": "爾時，大眾聞是言已，皆悉集聚。",
        "translation": "After hearing these words, the crowd gathered together.",
        "source": "T03n0157_009:0227b22_8"
    },
    {
        "source_sentence": "既集聚已，皆共誦持毘陀呪術，以是力故，能却一切諸惡鬼神，擁護眾生，",
        "translation": "Having assembled them, they all recited the mantra of enlightenment. Because of their powers, they were able to drive away all evil spirits and protect sentient beings.",
        "source": "T03n0157_009:0227b22_9"
    },
    {
        "source_sentence": "復修醫方，能治痰癊風寒冷熱。",
        "translation": "Again, he cultivates a doctor's prescription that treats phlegm, abscesses, wind, coldness, and heat.",
        "source": "T03n0157_009:0227b24_10"
    },
    {
        "source_sentence": "以是因緣，令無量無邊阿僧祇人離諸苦惱。",
        "translation": "Because of these causes and conditions, measureless, limitless, and incalculable numbers of people will be freed from suffering and distress.",
        "source": "T03n0157_009:0227b25_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227b26_12"
    },
    {
        "source_sentence": "我於爾時復更作願：『若我已為此一天下無量眾生，作智慧光，安止住於三乘法中，",
        "translation": "At that time, I also made the following vow: If all these sentient beings under one sun were to become illuminated by my wisdom and settle in the teaching of the three vehicles,",
        "source": "T03n0157_009:0227b26_13"
    },
    {
        "source_sentence": "閉三惡門，通天人路，除諸病苦，令得歡喜；",
        "translation": "He closes the three evil doors and leads the way of gods and humans, relieving the pain of illness and enabling them to rejoice.",
        "source": "T03n0157_009:0227b28_14"
    },
    {
        "source_sentence": "復次第為無量無邊阿僧祇人，作智慧光乃至歡樂。",
        "translation": "Again, in order, he creates the light of wisdom for measureless, limitless, and incalculable numbers of people, making them happy.",
        "source": "T03n0157_009:0227b29_15"
    },
    {
        "source_sentence": "以是善根因緣果報故，令我所願皆得成就，逮得己利。",
        "translation": "Because of the causes, conditions, and consequences of these roots of goodness, my wishes will all be fulfilled, and I'll attain their own benefit.",
        "source": "T03n0157_009:0227c01_16"
    },
    {
        "source_sentence": "如我已為此一天下無量無邊阿僧祇人，閉三惡道，通天人路，為諸病者請諸天龍、神仙之人，",
        "translation": "“Furthermore, World-Honored One, it is just as if I had shut off the three evil destinies for an infinite number of incalculable numbers of people on account of this one day and passed away among gods and humans. For the sake of those who are ill, I invited heavenly beings, nāgas, yakṣas, gandharvas, and as",
        "source": "T03n0157_009:0227c03_17"
    },
    {
        "source_sentence": "集毘羅山修毘陀呪，令無量無邊阿僧祇人，悉得離病受於快樂，如是遍滿此網世界，",
        "translation": "He gathered the Vaiśravaṇa and cultivated the Vaiśravaṇa mantra, enabling measureless, limitless, and incalculable numbers of people to be freed from illness and experience happiness.",
        "source": "T03n0157_009:0227c05_18"
    },
    {
        "source_sentence": "利益一切在在處處無量眾生，安住三乘，閉三惡道，通天人路。",
        "translation": "They benefit all the countless sentient beings everywhere, abide in the three vehicles, close the three bad destinies, and pass through the paths of gods and humans.",
        "source": "T03n0157_009:0227c07_19"
    },
    {
        "source_sentence": "復為如是世界病者，請諸天龍、神仙之人，集毘羅山修毘陀呪，令此世界無量無邊阿僧祇人，",
        "translation": "Again, as for the sicknesses of this world, he invited gods, dragons, and sages to gather together at Mount Vilaśālī to cultivate the vaipulya dhāraṇī so that there would be measureless, limitless, and incalculable numbers of people in this world.",
        "source": "T03n0157_009:0227c08_20"
    },
    {
        "source_sentence": "悉得離病，受於快樂。",
        "translation": "They all attain freedom from illness and experience happiness.",
        "source": "T03n0157_009:0227c11_21"
    },
    {
        "source_sentence": "如此世界，乃至十方如恒河沙，五濁惡世亦復如是。』",
        "translation": "So it is with such a world, up to the ten directions like the sands of the Ganges River, and so are the five turbid bad worlds.'",
        "source": "T03n0157_009:0227c11_22"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227c12_23"
    },
    {
        "source_sentence": "我於爾時在網世界，乃至十方如恒河沙五濁惡世，諸所作願皆得成就。",
        "translation": "At that point, I'll be in a world of webs and even five turbid bad worlds in the ten directions like the sands of the Ganges River, and all my vows will be fulfilled.",
        "source": "T03n0157_009:0227c13_24"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T03n0157_009:0227c14_25"
    },
    {
        "source_sentence": "汝今當知，即是如來為菩薩時，增益智慧，修菩薩道，是名如來愛護三業善根種子。」",
        "translation": "Now, you should know that when the Tathāgata is a bodhisattva, he increases his wisdom and cultivates the bodhisattva path when he's a bodhisattva, which is called the seed of the Tathāgata's desire to protect the good roots of the three actions.",
        "source": "T03n0157_009:0227c15_0"
    },
    {
        "source_sentence": "悲華經卷第九",
        "translation": "Compassionate Flower Scripture, Volume 9",
        "source": "T03n0157_009:0227c17_0"
    }
]