[
    {
        "source_sentence": "佛說眾許摩訶帝經卷第一",
        "translation": "Foshuo zhixiu mohaiti jing, vol. 1",
        "source": "T03n0191_001:0932a25_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚少卿",
        "translation": "Xitian zhuan jing sanzang朝散 dafu xi Hongun shouxing",
        "source": "T03n0191_001:0932a27_0"
    },
    {
        "source_sentence": "明教大師臣法賢奉　詔譯",
        "translation": "Mingjiao daishi jing faxian Feng imperial edict translation",
        "source": "T03n0191_001:0932a28_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在迦毘羅國尼俱陀林中。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Kapilavastu in the forest of nyagrodha in Kapilavastu.",
        "source": "T03n0191_001:0932a29_0"
    },
    {
        "source_sentence": "爾時迦毘羅國有大釋眾而自思惟：「我佛世尊，於過去世何處所生？",
        "translation": "It was then that a large group of Śākyamunis in Kapilavastu thought to themselves, Where did I, Bhagavān, where were born in the past?",
        "source": "T03n0191_001:0932b01_0"
    },
    {
        "source_sentence": "何姓？",
        "translation": "What family name?",
        "source": "T03n0191_001:0932b02_1"
    },
    {
        "source_sentence": "何族？",
        "translation": "What clan is it?",
        "source": "T03n0191_001:0932b02_2"
    },
    {
        "source_sentence": "有何因緣？」",
        "translation": "What are the causes and conditions for this?",
        "source": "T03n0191_001:0932b02_3"
    },
    {
        "source_sentence": "而思惟已，告諸眾曰：「釋迦世尊，於過去世，何處所生？",
        "translation": "After reflecting on this, he addressed the crowd, saying, Bhagavān, where were you born in a past life?",
        "source": "T03n0191_001:0932b03_0"
    },
    {
        "source_sentence": "何姓？",
        "translation": "What family name?",
        "source": "T03n0191_001:0932b04_1"
    },
    {
        "source_sentence": "何族？",
        "translation": "What clan is it?",
        "source": "T03n0191_001:0932b04_2"
    },
    {
        "source_sentence": "有何因緣？",
        "translation": "What are the reasons for this?",
        "source": "T03n0191_001:0932b04_3"
    },
    {
        "source_sentence": "我等今者欲往佛所而問此義，如佛所說依教受持。」",
        "translation": "Now, we want to go to the Buddha's place and ask about this meaning, just as the Buddha teaches and upholds it according to his teaching.",
        "source": "T03n0191_001:0932b04_4"
    },
    {
        "source_sentence": "如是言已，與大釋眾即往佛所，頭面禮足依位而坐。",
        "translation": "After saying this, he and the great multitude of Śākyamunis went to the Buddha, bowed their heads and feet, and sat down in a supporting position.",
        "source": "T03n0191_001:0932b05_5"
    },
    {
        "source_sentence": "爾時迦毘羅國大釋眾白佛言：「世尊！",
        "translation": "It was then that the great Śākyamunis of Kapilavastu said to the Buddha, Bhagavān!",
        "source": "T03n0191_001:0932b07_0"
    },
    {
        "source_sentence": "我等大釋眾住迦毘羅國精舍之中，而忽思惟：『我佛世尊於過去世，何處所生？",
        "translation": "We great Śākyamunis were staying in the monastery of Kapilavastu and suddenly thought, 'Where did I, Bhagavān, where was born in a past life?'",
        "source": "T03n0191_001:0932b07_1"
    },
    {
        "source_sentence": "何姓？",
        "translation": "What family name?",
        "source": "T03n0191_001:0932b09_2"
    },
    {
        "source_sentence": "何族？",
        "translation": "What clan is it?",
        "source": "T03n0191_001:0932b09_3"
    },
    {
        "source_sentence": "有何因緣？』",
        "translation": "What are the causes and conditions for this?'",
        "source": "T03n0191_001:0932b09_4"
    },
    {
        "source_sentence": "我等不知，今與釋眾來詣佛所而問此義。",
        "translation": "We don't know, so now we'll go to the Buddha with the Śākyamunis and ask about this meaning.",
        "source": "T03n0191_001:0932b10_5"
    },
    {
        "source_sentence": "唯願世尊，為我宣說，我等得聞依教受持。」",
        "translation": "Please, Bhagavān, explain it for me so that we can hear and retain it according to the teaching.",
        "source": "T03n0191_001:0932b11_0"
    },
    {
        "source_sentence": "爾時世尊為斷眾疑，即說此義告釋眾曰：「我先不欲宣說此義。",
        "translation": "It was then that the Bhagavān cut off their doubts and explained this meaning to the Śākyamunis, saying, I didn't want to explain this meaning first.",
        "source": "T03n0191_001:0932b12_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T03n0191_001:0932b13_1"
    },
    {
        "source_sentence": "所有諸魔外道，若聞此事而復謗言：『沙門憍答摩自說其美，所樂即說、非樂不說，",
        "translation": "All the Māras and non-Buddhists who heard about this matter denigrated it, saying, “The renunciant Anavatapta declared his own good repute. What he delighted in he said what he liked and what he disliked he did not say.",
        "source": "T03n0191_001:0932b13_2"
    },
    {
        "source_sentence": "有何所益。』」",
        "translation": "What's the use of it?'",
        "source": "T03n0191_001:0932b15_3"
    },
    {
        "source_sentence": "爾時大目犍連現在大眾中，即從坐起，瞻仰尊顏目不暫捨。",
        "translation": "At the time, Mahāmaudgalyāyana was present in the great assembly, rose from his seat, and gazed at the venerable's face without momentarily relinquishing his eyes.",
        "source": "T03n0191_001:0932b16_0"
    },
    {
        "source_sentence": "世尊告曰：「目連！",
        "translation": "The Bhagavān told him, Maudgalyāyana!",
        "source": "T03n0191_001:0932b17_1"
    },
    {
        "source_sentence": "彼諸釋眾樂聞於我過去之事，所生之處？",
        "translation": "Are those Śākyamunis happy to hear about the places where I was born in the past?",
        "source": "T03n0191_001:0932b17_2"
    },
    {
        "source_sentence": "何姓？",
        "translation": "What family name?",
        "source": "T03n0191_001:0932b18_3"
    },
    {
        "source_sentence": "何族？",
        "translation": "What clan is it?",
        "source": "T03n0191_001:0932b18_4"
    },
    {
        "source_sentence": "有何因緣？",
        "translation": "What are the reasons for this?",
        "source": "T03n0191_001:0932b18_5"
    },
    {
        "source_sentence": "汝今志心而為宣說。」",
        "translation": "Now, you're determined to explain it for me.",
        "source": "T03n0191_001:0932b19_6"
    },
    {
        "source_sentence": "爾時會中大目犍連默然思惟，經須臾頃收僧伽梨衣安在頭邊，右脇枕臥累足不動入三摩地；",
        "translation": "At that time in the assembly, Mahāmaudgalyāyana remained silent and thought to himself. After a short while he put away his undergarment and placed it at the side of his head.",
        "source": "T03n0191_001:0932b20_0"
    },
    {
        "source_sentence": "而復觀察世尊過去之世，所生之處，若姓、若族及因緣事，如實了知無其錯謬，",
        "translation": "“Furthermore, the World-honored One observed all the places where the Buddha had been born in past lives—names, castes, clan names, and causal conditions as well as events—and knew exactly what they were without error or mistake.",
        "source": "T03n0191_001:0932b22_1"
    },
    {
        "source_sentence": "即便出定於大眾前復坐本座。",
        "translation": "He then emerged from concentration and returned to his seat in front of the crowd.",
        "source": "T03n0191_001:0932b23_2"
    },
    {
        "source_sentence": "尊者大目犍連告釋眾曰：「我於三昧觀彼憍答摩往昔之事，世界壞時，",
        "translation": "Venerable Mahāmaudgalyāyana said to the Śākyamunis, “In samādhi I contemplated the events of the past that took place in Jambudvīpa.",
        "source": "T03n0191_001:0932b24_3"
    },
    {
        "source_sentence": "彼諸眾生命終之後，而得往生遍靜天中；",
        "translation": "When their lives came to an end, those beings were reborn in the pervasively still heaven.",
        "source": "T03n0191_001:0932b26_4"
    },
    {
        "source_sentence": "生彼天已，諸根圓滿身相端嚴，眾苦不生身心適悅，色相光明騰空自在；",
        "translation": "When they are born in that heaven, their faculties are perfected, their bodies and forms are handsome. Their physical and mental well-being is neither painful nor pleasurable; their appearance and light rise up as freely as space.",
        "source": "T03n0191_001:0932b27_5"
    },
    {
        "source_sentence": "以天甘味而為飲食，壽量長時無中夭者。",
        "translation": "It's because of the sweet taste of heaven that they eat and drink, and there's no middle age when their life span is long.",
        "source": "T03n0191_001:0932b28_6"
    },
    {
        "source_sentence": "爾時大地，大水所生滿虛空中，猶如大海風吹波浪，如煎熟乳其水清涼，",
        "translation": "At that time the great waters of the earth arose and filled the sky, just as the great ocean breeze blows waves like cooked milk whose water is clear and cool.",
        "source": "T03n0191_001:0932b29_7"
    },
    {
        "source_sentence": "為彼後時一切眾生，所食清淨最上地味。」",
        "translation": "For the sake of all sentient beings at a later time, they'll eat the pure and highest taste of the earth.",
        "source": "T03n0191_001:0932c02_8"
    },
    {
        "source_sentence": "爾時大目犍連復告眾言：「當爾劫壞，眾生生遍靜天者，以彼天中福壽俱盡，",
        "translation": "It was then that Mahāmaudgalyāyana again addressed the assembly, saying: When the present eon breaks up and sentient beings are reborn in the heaven of universal tranquility, it is because their blessedness and longevity will be exhausted in that heaven.",
        "source": "T03n0191_001:0932c03_9"
    },
    {
        "source_sentence": "捨遍靜天生於人間，所生之身亦如天界，身相端嚴諸根無缺妙色廣大，",
        "translation": "The body he produced was also like that of the celestial realm. His bodily features were beautiful, his faculties intact, and his subtle form vast in size.",
        "source": "T03n0191_001:0932c05_10"
    },
    {
        "source_sentence": "自有身光恒常照曜，長壽喜樂騰空自在。",
        "translation": "The light of his own body always shone brightly, and he lived a long life with joy and happiness, rising up to the unimpededness of space.",
        "source": "T03n0191_001:0932c06_11"
    },
    {
        "source_sentence": "於其爾時無日月星辰，無歲數月時等，亦無男女眾生之相；",
        "translation": "At that time there were no suns, moons, stars, years, months, seasons, etc., nor male or female characteristics of sentient beings.",
        "source": "T03n0191_001:0932c07_12"
    },
    {
        "source_sentence": "出生地味以為飲食。",
        "translation": "The taste of the native land is used as food and drink.",
        "source": "T03n0191_001:0932c09_13"
    },
    {
        "source_sentence": "如是地味甘美細妙，有情食已而生愛著；",
        "translation": "The taste of this earth is sweet and subtle, and after being eaten by sentient beings they become attached to it.",
        "source": "T03n0191_001:0932c09_14"
    },
    {
        "source_sentence": "於其後時貪味轉盛，忽令身體而得沈重，所有光忽然不見，於是世間普皆黑暗。",
        "translation": "Later, as his craving became more intense, he suddenly caused his body to sink into a deep depression, and all the light that he saw suddenly disappeared, leaving the whole world in darkness.",
        "source": "T03n0191_001:0932c10_15"
    },
    {
        "source_sentence": "爾時有情見是世間普皆黑暗，種種驚惶心生憂惱，由是世間出現日月及星曜等，",
        "translation": "When sentient beings saw that the world was all dark, various fears and distress arose in their hearts. As a result, the sun, moon, stars, and other celestial objects appeared in the world.",
        "source": "T03n0191_001:0932c12_16"
    },
    {
        "source_sentence": "始分晝夜及其時候。",
        "translation": "It begins by dividing day and night into days and time periods.",
        "source": "T03n0191_001:0932c14_17"
    },
    {
        "source_sentence": "如是有情壽命長遠無諸病惱，於其地味貪著多者，色相損減而獲醜惡；",
        "translation": "In this way, sentient beings have a long life span and are free from all illnesses and afflictions. Those with great craving for the taste of that land lose their physical appearance and become ugly.",
        "source": "T03n0191_001:0932c14_18"
    },
    {
        "source_sentence": "貪著少者其身色相恒自端嚴，如是隨心分別二相黑白果報。",
        "translation": "Those who cling to little are always self-adorned with body form and characteristics, thus following the mind's discernment of the two characteristics as black and white fruitful rewards.",
        "source": "T03n0191_001:0932c16_19"
    },
    {
        "source_sentence": "而彼眾生互相憎嫉而成不善，以不善故，由此地味即便隱沒，以隱沒故，",
        "translation": "Because of being unwholesome, the taste of this earth disappears.",
        "source": "T03n0191_001:0932c17_20"
    },
    {
        "source_sentence": "令諸眾生心生熱惱，作如是言：『今無所食，深苦！",
        "translation": "Causing the minds of sentient beings to become feverish, they say, 'Now there's nothing to eat, which is profoundly painful!'",
        "source": "T03n0191_001:0932c19_21"
    },
    {
        "source_sentence": "深苦！』",
        "translation": "It's deeply painful!'",
        "source": "T03n0191_001:0932c20_22"
    },
    {
        "source_sentence": "又復思惟：『最上地味云何隱沒？",
        "translation": "Again, he thought, 'How is the taste of the highest ground hidden?'",
        "source": "T03n0191_001:0932c20_23"
    },
    {
        "source_sentence": "未來眾生云何得食？』",
        "translation": "How will future sentient beings be able to eat?'",
        "source": "T03n0191_001:0932c21_24"
    },
    {
        "source_sentence": "令生苦惱疲乏之患，而不可知、不可言說。",
        "translation": "It causes suffering, distress, and exhaustion to arise, but it can't be known or described.",
        "source": "T03n0191_001:0932c21_25"
    },
    {
        "source_sentence": "「爾時大地之中，不久之間即生地餅，其味殊妙馨香甘美，如迦梨尼迦囉花。",
        "translation": "Soon after that, a cake of earth appeared on the surface of the ground in the midst of the great earth. The taste of this cake was marvelous and sweet, like the flower garuḍaṇikāla.",
        "source": "T03n0191_001:0932c23_0"
    },
    {
        "source_sentence": "而諸眾生食此地餅，充益身體長壽安樂，身相端嚴氣力增盛。",
        "translation": "When sentient beings eat this cake, it nourishes their bodies and increases longevity and well-being, and their physical appearance is dignified and their vitality increases.",
        "source": "T03n0191_001:0932c24_1"
    },
    {
        "source_sentence": "若諸眾生貪食多者色相損減，貪食少者色相如故無其損減，由此分別二相黑白，",
        "translation": "If sentient beings desire food abundantly, their physical appearance decreases; if they desire food little, their physical appearance remains the same as before. Because of this, they discriminate black and white by distinguishing two distinctive characteristics:",
        "source": "T03n0191_001:0932c26_2"
    },
    {
        "source_sentence": "而互相非行不善業，令彼地餅隱沒不見。",
        "translation": "They don't perform unwholesome actions with each other, causing the cakes on the ground to be hidden and not seen.",
        "source": "T03n0191_001:0932c28_0"
    },
    {
        "source_sentence": "以不見故，而諸眾生復生苦惱，作如是言：『深苦！",
        "translation": "Because they don't see it, sentient beings again become painful and say, 'It's profoundly painful!'",
        "source": "T03n0191_001:0932c28_1"
    },
    {
        "source_sentence": "深苦！』",
        "translation": "It's deeply painful!'",
        "source": "T03n0191_001:0933a01_2"
    },
    {
        "source_sentence": "又復思惟：『所生地餅云何隱沒？",
        "translation": "Again, he thought, 'How are the cakes that grow on the ground hidden?'",
        "source": "T03n0191_001:0933a01_3"
    },
    {
        "source_sentence": "其義不知，而諸有情即得飢困疲乏之苦，未來眾生當於何食？』",
        "translation": "I don't know its meaning, but when sentient beings are starved and exhausted, where will future sentient beings eat?'",
        "source": "T03n0191_001:0933a01_4"
    },
    {
        "source_sentence": "由是不久為彼眾生復生林藤，其色殊妙香味甘美。",
        "translation": "Soon thereafter, for the sake of those sentient beings, he'll again grow a forest vine with a marvelous color, fragrance, and sweetness.",
        "source": "T03n0191_001:0933a03_5"
    },
    {
        "source_sentence": "如是有情食此林藤，氣力增盛壽量長遠，形色端嚴人相具足。",
        "translation": "Thus, sentient beings eat this forest of vines, increase in energy and longevity, have a long life span, and are endowed with form and appearance that's dignified and full of human features.",
        "source": "T03n0191_001:0933a04_6"
    },
    {
        "source_sentence": "又彼眾生，貪食多者色相損減，貪食少者色相如故，如是有情分別二相黑白，",
        "translation": "Also, those sentient beings who desire food abundantly have form and characteristics that diminish. Those who desire food little have the same form and characteristics as before. Sentient beings like this discriminate between black and white in two ways:",
        "source": "T03n0191_001:0933a05_7"
    },
    {
        "source_sentence": "而互相非行不善業，由是林藤隱沒不見。",
        "translation": "They don't practice each other's unwholesome actions, so the forest vines are hidden and not seen.",
        "source": "T03n0191_001:0933a07_8"
    },
    {
        "source_sentence": "既不見已，令諸眾生心生熱惱，作如是言：『苦哉！",
        "translation": "Having seen it, they cause sentient beings to become feverish and say, 'How painful!'",
        "source": "T03n0191_001:0933a08_9"
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T03n0191_001:0933a09_10"
    },
    {
        "source_sentence": "如是美味云何隱沒？",
        "translation": "How can such a delicious food be hidden?",
        "source": "T03n0191_001:0933a09_11"
    },
    {
        "source_sentence": "其義不知？",
        "translation": "Don't you know its meaning?",
        "source": "T03n0191_001:0933a10_12"
    },
    {
        "source_sentence": "我等云何而得飲食？』",
        "translation": "How did we get food and drink?'",
        "source": "T03n0191_001:0933a10_13"
    },
    {
        "source_sentence": "由是不久大地之中，出生自然上味香稻，其稻依時自然成熟。",
        "translation": "As a result, it won't be long before the earth produces naturally tasty, fragrant rice that ripens naturally at the right time.",
        "source": "T03n0191_001:0933a10_14"
    },
    {
        "source_sentence": "爾時眾生即取食之，亦甚香美，充益肢體壽量長遠。",
        "translation": "At that point, the sentient beings then took it and ate it, which was also very fragrant and delicious, enriching their limbs with longevity.",
        "source": "T03n0191_001:0933a12_15"
    },
    {
        "source_sentence": "由是爾時食於香稻，漸覺腹內有所妨礙，而即思惟：『云何除去？』",
        "translation": "Because of this, he then ate the fragrant rice and gradually perceived an obstruction in his belly at that point, and he thought, 'How can I remove it?'",
        "source": "T03n0191_001:0933a13_16"
    },
    {
        "source_sentence": "作是念已即生二根，男女差別形相各異。",
        "translation": "After this thought occurs, the two faculties arise: male and female. Distinct as they are, their forms and characteristics differ.",
        "source": "T03n0191_001:0933a14_17"
    },
    {
        "source_sentence": "爾時有情於色、香、味展轉愛著，於自親愛而以香花、衣服種種供養，",
        "translation": "At that point, sentient beings become increasingly attached to form, odor, taste, and flavor, and offer various offerings of incense, flowers, clothing, and other things they love.",
        "source": "T03n0191_001:0933a15_18"
    },
    {
        "source_sentence": "復以軟言慰喻歡喜令彼忻慶；",
        "translation": "He also comforted them with gentle words and encouraged their joy, enabling them to rejoice.",
        "source": "T03n0191_001:0933a17_19"
    },
    {
        "source_sentence": "若有眾生於己非愛，即便輕毀種種呵責，或以瓦石互相鬥打行不善行。",
        "translation": "If there are sentient beings who don't love themselves, they may even despise various kinds of criticism or fight each other with tiles and stones to do unwholesome actions.",
        "source": "T03n0191_001:0933a18_20"
    },
    {
        "source_sentence": "又彼眾生所有過去正法今為非法，過去律儀今為非律儀，乃至晝夜時分亦顛倒分別；",
        "translation": "Furthermore, all the right doctrine of those sentient beings of the past is now unlawful. The former forms of restraint are now non-restraint. Up to the time periods of day and night they also discriminate in error.",
        "source": "T03n0191_001:0933a19_21"
    },
    {
        "source_sentence": "譬如有人以斗量炭，而為平滿不正之行，亦復如是。",
        "translation": "It's like a person who uses a heap of charcoal to fill up an unwholesome practice, which is likewise.",
        "source": "T03n0191_001:0933a21_22"
    },
    {
        "source_sentence": "以倒想故正法為邪，由是香稻亦復隱沒。」",
        "translation": "Because of mistaken perception, the right teaching is considered wrong, and because of this, fragrant rice also goes into hiding.",
        "source": "T03n0191_001:0933a22_23"
    },
    {
        "source_sentence": "爾時大目犍連告釋眾言：「由香稻隱沒故，令彼眾生逐日諸處尋求稻種而欲種之。",
        "translation": "It was then that Mahāmaudgalyāyana addressed the Śākyamunis, saying, Because the fragrant rice is hidden, it causes those sentient beings to search for seeds of rice and want to plant them day after day.",
        "source": "T03n0191_001:0933a23_24"
    },
    {
        "source_sentence": "時有一人，其性慵懶貪著財利，雖有稻種而不能種。",
        "translation": "At the time, there was a man whose nature was lazy and greedy for wealth and profit, and even though he planted rice, he couldn't sow it.",
        "source": "T03n0191_001:0933a25_25"
    },
    {
        "source_sentence": "此人知已而告之言：『汝有稻種，與我少分我要種之。』",
        "translation": "Knowing this, the man told him, 'You have rice seeds, give me a little bit of it to me and I'll plant it.'",
        "source": "T03n0191_001:0933a26_26"
    },
    {
        "source_sentence": "彼人言曰：『我有香稻自要受用，汝今若要我即與汝。",
        "translation": "That man said, 'I have the fragrant rice that I want for my own use, and now if you want me, I'll give it to you.",
        "source": "T03n0191_001:0933a28_27"
    },
    {
        "source_sentence": "於後一日、二日，乃至七日却還我稻。』",
        "translation": "On the next day, two days, or even seven days, he'll return my rice.'",
        "source": "T03n0191_001:0933a29_28"
    },
    {
        "source_sentence": "此人言曰：『善哉！",
        "translation": "The man said, 'Good!",
        "source": "T03n0191_001:0933b01_29"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T03n0191_001:0933b01_30"
    },
    {
        "source_sentence": "若一日、二日，乃至七日，或未得還，如至半月、一月即得還之。』",
        "translation": "If he returns on one day, two days, or even seven days, or if he hasn't returned, he'll be able to return it in half a month or a month.'",
        "source": "T03n0191_001:0933b01_31"
    },
    {
        "source_sentence": "作是言已，即自思惟：『自前香稻非種自生，不假勤力自在受用；",
        "translation": "Having said this, he thought to himself: The fragrant rice mentioned earlier is not self-generated from seeds; it does not depend on human effort for its enjoyment.",
        "source": "T03n0191_001:0933b02_32"
    },
    {
        "source_sentence": "今得稻種，須住田野廣施勤力，晝夜相續方得生長。』",
        "translation": "Now that they've obtained rice seeds, they must live in the fields and extensively give them to diligently cultivate it day and night.'",
        "source": "T03n0191_001:0933b04_33"
    },
    {
        "source_sentence": "「如是念已，心生苦惱涕淚悲泣。",
        "translation": "“After this thought, his mind became pained and wept with tears and sorrow.",
        "source": "T03n0191_001:0933b05_34"
    },
    {
        "source_sentence": "又復思惟：『過去之世，所有眾生色相端正，諸根圓滿人相具足，身心適悅身有光明，",
        "translation": "“Furthermore, in a past life all the sentient beings were endowed with form and characteristics, their faculties well developed, their bodies well proportioned, pleasing, and shining.",
        "source": "T03n0191_001:0933b06_35"
    },
    {
        "source_sentence": "騰空自在壽命長遠，所食地味猶如天饌；",
        "translation": "Their life spans are long, and the food they eat resembles heavenly delicacies.",
        "source": "T03n0191_001:0933b08_36"
    },
    {
        "source_sentence": "而於後時，於此美食生貪著故，身即沈重光明即滅，於是世間普皆黑暗。",
        "translation": "At a later time, because they become addicted to this food, their bodies sink and light cease, and the whole world becomes dark.",
        "source": "T03n0191_001:0933b09_37"
    },
    {
        "source_sentence": "又彼有情貪食少者身相不減，貪食多者身相損減，由此分別二相黑白，",
        "translation": "Also, those sentient beings who desire food little will not lose their bodily characteristics; those who desire food much will gain or lose their bodily characteristics. Thus, the distinction between black and white is possible.",
        "source": "T03n0191_001:0933b10_38"
    },
    {
        "source_sentence": "互相輕毀行不善行。",
        "translation": "They despise each other's bad actions and unskillful actions.",
        "source": "T03n0191_001:0933b12_39"
    },
    {
        "source_sentence": "由是爾時地味即滅，地餅復生，色相殊妙甘美馨香，增益諸根身心適悅，",
        "translation": "As a result, the taste of earth disappeared and the rice cakes reappeared. The color and shape of these cakes were exquisite, sweet, fragrant, and pleasing to the body and mind, enhancing the sense faculties.",
        "source": "T03n0191_001:0933b12_40"
    },
    {
        "source_sentence": "壽命長遠；",
        "translation": "Their life spans are long and distant.",
        "source": "T03n0191_001:0933b14_41"
    },
    {
        "source_sentence": "貪食少者身相不減，貪食多者身相損減，由此分別二相黑白，互相輕毀行不善行。",
        "translation": "When there is little craving for food, the bodily characteristics are not diminished; when there is much craving for food, the bodily characteristics are diminished. Because of this, they discriminate two [forms] black and white, despising each other and doing unwholesome actions.",
        "source": "T03n0191_001:0933b14_42"
    },
    {
        "source_sentence": "爾時地餅亦復不見，由此非久復生林藤，色相殊妙其味甘善，亦如天食，",
        "translation": "At that time the cakes of earth also disappeared. Soon thereafter, as a consequence, some newly grown forest vines with distinctive colors and delicate tastes were planted, just like the food of gods.",
        "source": "T03n0191_001:0933b16_43"
    },
    {
        "source_sentence": "充益肢體壽命長遠；",
        "translation": "Their limbs will grow and their life spans will be long.",
        "source": "T03n0191_001:0933b18_44"
    },
    {
        "source_sentence": "貪食少者身相不減，貪食多者身相損減，由此分別二相黑白，互相輕毀行不善行。",
        "translation": "When there is little craving for food, the bodily characteristics are not diminished; when there is much craving for food, the bodily characteristics are diminished. Because of this, they discriminate two [forms] black and white, despising each other and doing unwholesome actions.",
        "source": "T03n0191_001:0933b18_45"
    },
    {
        "source_sentence": "爾時林藤亦復不見，於是世間有自然香稻從地出生，其米香美可長四指，",
        "translation": "At that time the forest-grass also disappeared. Then there appeared in the world naturally fragrant rice growing from the earth, which was as long as four fingers in length and had a sweet smell like rice.",
        "source": "T03n0191_001:0933b20_46"
    },
    {
        "source_sentence": "依時成熟其味甘美，充益肢體壽量長遠；",
        "translation": "At the appropriate time, they mature and have a sweet taste. They nourish their limbs and long life spans.",
        "source": "T03n0191_001:0933b22_47"
    },
    {
        "source_sentence": "由是眾生貪愛增故，所有香稻亦沒不見。",
        "translation": "Because sentient beings' craving increases, all the fragrant rice they have disappears and isn't seen.",
        "source": "T03n0191_001:0933b23_48"
    },
    {
        "source_sentence": "是故今者求此稻種住於田野，廣施勤力方得成熟。』",
        "translation": "That's why they now seek this rice to be planted in the fields and cultivate it with extensive effort.'",
        "source": "T03n0191_001:0933b24_49"
    },
    {
        "source_sentence": "「雖生稻米其米漸小，於是眾生貪著地利，廣占田野競多種植，而行非法生賊盜想，",
        "translation": "“Although rice and rice are growing, the rice is gradually decreasing. Thus sentient beings cling to profits from land and seize large plots of land and fields for cultivation, yet they practice what is against the Dharma and give rise to thoughts of thief and robbery.",
        "source": "T03n0191_001:0933b25_50"
    },
    {
        "source_sentence": "於他田種復行偷盜。",
        "translation": "They also steal from other fields and seeds.",
        "source": "T03n0191_001:0933b27_51"
    },
    {
        "source_sentence": "時有一人見是偷米，如是一遍、二遍乃至三遍，而告言曰：『汝自有米何不自用，",
        "translation": "Then a man saw this stealing rice and said to the thief, “Why don’t you use what you have for yourselves?” The thief did so one time, two times, or even three times.",
        "source": "T03n0191_001:0933b27_52"
    },
    {
        "source_sentence": "云何於他而行偷盜？",
        "translation": "How do they steal from others?",
        "source": "T03n0191_001:0933b29_53"
    },
    {
        "source_sentence": "從今之後勿更盜米。』",
        "translation": "From now on, don't steal rice again.'",
        "source": "T03n0191_001:0933c01_0"
    },
    {
        "source_sentence": "賊聞是言猶不改過，復於後時又行偷盜。",
        "translation": "When the thief heard these words, he didn't change his ways and continued stealing at a later time.",
        "source": "T03n0191_001:0933c01_1"
    },
    {
        "source_sentence": "前人復見而責之曰：『前已誡汝勿行偷盜，何故此時又亦作賊？』",
        "translation": "Again, the former man saw him and reprimanded him, saying, 'You were previously instructed not to steal, so why did you become a thief at that time?'",
        "source": "T03n0191_001:0933c02_2"
    },
    {
        "source_sentence": "即集多人共以責斷。",
        "translation": "That's when many people gathered together to rebuke and stop it.",
        "source": "T03n0191_001:0933c03_3"
    },
    {
        "source_sentence": "復於彼時，於眾人中揀一具福德者立為田主，均分田土各令平等，有不依法者令彼調伏。",
        "translation": "Again, at that point, he selects a person among the people who is endowed with virtue and establishes him as the owner of the land, distributes the land equally to make it equal, and causes those who don't follow the Dharma to be disciplined.",
        "source": "T03n0191_001:0933c04_4"
    },
    {
        "source_sentence": "田種若熟，輸其少分以賞田主。",
        "translation": "If the crops are ripe, he'll give a small part of them to the owner of the field to reward him.",
        "source": "T03n0191_001:0933c06_5"
    },
    {
        "source_sentence": "如是田主受行戒行，安慰世間依法決斷，合調伏者即便調伏。",
        "translation": "Thus, the lord of the field receives the precepts and practices that are practiced, comforts the world with the Dharma and decides to make a resolution based on it, and those who are harmonized and disciplined are even disciplined.",
        "source": "T03n0191_001:0933c07_6"
    },
    {
        "source_sentence": "「由此世間立剎帝利姓，名三摩達多王，王有大臣名為有情；",
        "translation": "Because of this, the caste of kṣatriyas is established in the world and they are called samdatta kings. The kings have ministers named sentient beings.",
        "source": "T03n0191_001:0933c08_7"
    },
    {
        "source_sentence": "其王後時生一太子，名為愛子，王有大臣名伊賀迦；",
        "translation": "At a later time the king had a prince named Aiṣṭika, who was accompanied by a minister named Ikṣvāku.",
        "source": "T03n0191_001:0933c09_8"
    },
    {
        "source_sentence": "時愛子王生一太子，名曰善友，彼有大臣名帝羅迦；",
        "translation": "At that time King Ajātaśatru gave birth to a prince named Sunetra, who had a minister there named Indraka.",
        "source": "T03n0191_001:0933c11_0"
    },
    {
        "source_sentence": "時善友王復生一子，名曰最上，彼有大臣名阿跋羅建姹；",
        "translation": "King Sudarśana then had another son named Supreme, who had a minister there named Avarakaṇṭika.",
        "source": "T03n0191_001:0933c12_1"
    },
    {
        "source_sentence": "最上王有子，名曰戒行，彼有大臣名哆羅惹伽。",
        "translation": "The supreme king had a son named Prātimokṣa, who had a minister named Rājagṛha.",
        "source": "T03n0191_001:0933c13_2"
    },
    {
        "source_sentence": "其王頂上生一肉靤，其靤柔軟，常以兜羅綿拂拂於肉靤無諸疼痛；",
        "translation": "On the top of the king’s head was a piece of flesh. The flesh was coarse and soft, and he always brushed it with cotton thread to remove any pain in his flesh.",
        "source": "T03n0191_001:0933c14_3"
    },
    {
        "source_sentence": "其靤後熟，自然破裂生一童子，福德端嚴，具三十二相，眾所愛重，因以立名名頂生王。",
        "translation": "After maturing, he naturally split and gave birth to a boy whose merits were so great that they possessed the thirty-two eminent marks beloved by everyone. For this reason he was given the name King Prabhūtaratna.",
        "source": "T03n0191_001:0933c16_4"
    },
    {
        "source_sentence": "纔下王頂即入內宮。",
        "translation": "He simply descended to the king's head and entered the inner palace.",
        "source": "T03n0191_001:0933c18_5"
    },
    {
        "source_sentence": "「爾時戒行王內宮之中，有六萬宮人各有嬭乳，俱白王言：『我有嬭乳，",
        "translation": "At the time, there were sixty thousand palace attendants inside the palace of King Śīlāditya, each with curds and milk. They all said to the king, “I have curds and milk.",
        "source": "T03n0191_001:0933c19_0"
    },
    {
        "source_sentence": "願嬭太子。』",
        "translation": "May it please the prince.'",
        "source": "T03n0191_001:0933c20_1"
    },
    {
        "source_sentence": "由此因緣亦名我嬭王。",
        "translation": "Because of these causes and conditions, he's also called the self-inflicted king.",
        "source": "T03n0191_001:0933c20_2"
    },
    {
        "source_sentence": "「爾時世間所有眾生智慧漸增，能細思惟，稱量分別微細之事，或是、或非及工巧等，",
        "translation": "“At that time the knowledge and wisdom of all sentient beings in the world gradually increased, and they were able to think subtly and deliberate on measured and differentiated subtle matters, whether they were good or bad, as well as their skillful means.",
        "source": "T03n0191_001:0933c22_0"
    },
    {
        "source_sentence": "是故立名號摩努沙。",
        "translation": "That's why it's called manaṣa.",
        "source": "T03n0191_001:0933c23_1"
    },
    {
        "source_sentence": "「爾時六大天子壽命無量，有六大臣：一名有情；",
        "translation": "At that time the life spans of the six great celestial beings were immeasurable. There were six ministers:",
        "source": "T03n0191_001:0933c25_0"
    },
    {
        "source_sentence": "二名伊賀羅；",
        "translation": "The second is called Eiheilā.",
        "source": "T03n0191_001:0933c26_1"
    },
    {
        "source_sentence": "三名帝羅迦；",
        "translation": "The third is called Indraka.",
        "source": "T03n0191_001:0933c26_2"
    },
    {
        "source_sentence": "四名阿跋羅建姹；",
        "translation": "The fourth name is avarakaṇṭika.",
        "source": "T03n0191_001:0933c26_3"
    },
    {
        "source_sentence": "五名多羅惹伽；",
        "translation": "The fifth is called Tālayaka.",
        "source": "T03n0191_001:0933c27_4"
    },
    {
        "source_sentence": "六名摩努惹。",
        "translation": "The sixth name is manas.",
        "source": "T03n0191_001:0933c27_5"
    },
    {
        "source_sentence": "如是六大臣，聰明多智，能治世間有大威德。",
        "translation": "Thus, these six ministers are intelligent and wise, capable of governing the world with great authority.",
        "source": "T03n0191_001:0933c27_6"
    },
    {
        "source_sentence": "時頂生王於其右股生一肉靤，其靤柔軟，常以兜羅綿拂拂於肉靤離諸疼痛；",
        "translation": "At that time King Mandhātu produced a piece of flesh on his right thigh. The flesh was coarse and soft, and he always brushed the flesh with cotton thread to remove any pain in it.",
        "source": "T03n0191_001:0933c28_7"
    },
    {
        "source_sentence": "於後靤熟自然開裂，生一童子，身相端嚴具三十二相，名為尼嚕，有大智慧福德無量，",
        "translation": "Then the embryo was spontaneously dismembered and a newborn boy appeared, endowed with thirty-two marks on his body. His name was Nirodha; he possessed great wisdom and immeasurable merit.",
        "source": "T03n0191_001:0934a01_8"
    },
    {
        "source_sentence": "為金輪王統四天下。",
        "translation": "He's the king of the golden wheel who governs the four realms under heaven.",
        "source": "T03n0191_001:0934a03_9"
    },
    {
        "source_sentence": "「尼嚕輪王於其後時，在左股上亦生一靤，其靤柔軟，常以兜羅綿拂拂於肉靤無諸疼痛；",
        "translation": "“After him, the wheel-turning king also produced a blistering sensation on his left thigh. The blistering sensation was gentle and supple; he always brushed his flesh and bones with cotton thread to remove it without pain.",
        "source": "T03n0191_001:0934a04_0"
    },
    {
        "source_sentence": "於後還熟，自然開裂生一童子，端正殊妙具三十二相，名烏波尼嚕，智慧深遠福德無量，",
        "translation": "When the fruit ripened later, he naturally dismembered and gave birth to a boy named Upaniputra, endowed with thirty-two beautiful features. His wisdom was profound and his virtue immeasurable.",
        "source": "T03n0191_001:0934a06_0"
    },
    {
        "source_sentence": "為銀輪王統三天下。",
        "translation": "He's the silver wheel-turning king who governs the three heavens.",
        "source": "T03n0191_001:0934a08_0"
    },
    {
        "source_sentence": "「烏波尼嚕王還於後時，向右足上生一肉靤，其靤柔軟，亦以兜羅綿拂拂於肉靤無諸疼痛；",
        "translation": "When King Upanijuta returned later, a piece of flesh appeared on the top of his right foot. The flesh was coarse and soft but he also brushed it with cotton thread to remove any pain from the flesh’s abscess.",
        "source": "T03n0191_001:0934a08_1"
    },
    {
        "source_sentence": "於後靤熟自然開裂生一童子，身相端嚴具三十二相，名室尼嚕，福慧深厚，",
        "translation": "Then the embryo was spontaneously dismembered and a young boy, endowed with thirty-two distinctive marks like Śāriputra, born after the embryo had matured. His physical appearance was dignified and his name was Śrīputra, profound in virtue and wisdom.",
        "source": "T03n0191_001:0934a10_2"
    },
    {
        "source_sentence": "為銅輪王統二天下。",
        "translation": "He's the copper wheel king who governs the two worlds.",
        "source": "T03n0191_001:0934a12_3"
    },
    {
        "source_sentence": "「室尼嚕王於左足上有一肉靤，其靤柔軟，以兜羅綿拂拂於肉靤無諸疼痛；",
        "translation": "“On the left foot of King Śāriputra’s feet was a piece of flesh. The flesh was coarse and soft, and he brushed it with cotton thread to remove any pain in his flesh.",
        "source": "T03n0191_001:0934a12_4"
    },
    {
        "source_sentence": "於後靤熟自然開裂生一童子，色相端正具三十二相，名摩尼嚕，福慧深厚，",
        "translation": "Then, the embryo spontaneously dismembered and gave birth to a boy whose features were beautiful and endowed with the thirty-two marks. His name was Maṇirūḍa; he possessed profound virtue and wisdom.",
        "source": "T03n0191_001:0934a14_5"
    },
    {
        "source_sentence": "為鐵輪王統一天下。」",
        "translation": "He's the iron wheel king who unifies the world.",
        "source": "T03n0191_001:0934a16_6"
    },
    {
        "source_sentence": "爾時大目犍連告釋眾言：「如是王位相繼至今其數極多，如是眾許王有子，",
        "translation": "It was then that Mahāmaudgalyāyana addressed the assembly of Śākyamunis, saying: Such is the succession of the throne of the king up to this very minute.",
        "source": "T03n0191_001:0934a16_7"
    },
    {
        "source_sentence": "名為愛王；",
        "translation": "He is called King of Delight.",
        "source": "T03n0191_001:0934a18_8"
    },
    {
        "source_sentence": "愛王有子，名善友王；",
        "translation": "King Ai had a son named Sudarśana, the king of good companions.",
        "source": "T03n0191_001:0934a18_9"
    },
    {
        "source_sentence": "善友王有子，名最上王；",
        "translation": "King Sudarśana had a son named Supreme King.",
        "source": "T03n0191_001:0934a19_10"
    },
    {
        "source_sentence": "最上王有子，名戒行王；",
        "translation": "The supreme king had a son named King Silavrataparamarsa.",
        "source": "T03n0191_001:0934a19_11"
    },
    {
        "source_sentence": "戒行王有子，名頂生王；",
        "translation": "The king of morality and practice had a son named King Mandhātu.",
        "source": "T03n0191_001:0934a20_12"
    },
    {
        "source_sentence": "頂生王有子，名尼嚕王；",
        "translation": "The king Mandhātu had a son named King Nakula.",
        "source": "T03n0191_001:0934a20_13"
    },
    {
        "source_sentence": "尼嚕王有子，名烏波尼嚕王；",
        "translation": "The king of Benares had a son named King Upanirjuna.",
        "source": "T03n0191_001:0934a21_14"
    },
    {
        "source_sentence": "烏波尼嚕王有子，名室尼嚕王；",
        "translation": "King Upaniputra had a son named Śubhavyūha.",
        "source": "T03n0191_001:0934a21_15"
    },
    {
        "source_sentence": "室尼嚕王有子，名摩尼嚕王；",
        "translation": "The king of Sūrya had a son named King Maṇirūḍhaka.",
        "source": "T03n0191_001:0934a22_16"
    },
    {
        "source_sentence": "摩尼嚕王有子，名嚕唧王；",
        "translation": "“Great king Maudgalyāyana had a son named Rāhuṣṭrapāla.",
        "source": "T03n0191_001:0934a23_17"
    },
    {
        "source_sentence": "嚕唧王有子，名酥嚕唧王；",
        "translation": "King Varuṣṭa had a son, named King Varuṣṭa.",
        "source": "T03n0191_001:0934a23_18"
    },
    {
        "source_sentence": "酥嚕唧王有子，名母唧王；",
        "translation": "The king of curds had a son named King Mucilinda.",
        "source": "T03n0191_001:0934a24_19"
    },
    {
        "source_sentence": "母唧王有子，名母唧鱗捺王；",
        "translation": "The king of the mother trees had a child named the king of the mother trees, called Maudgalaputra.",
        "source": "T03n0191_001:0934a24_20"
    },
    {
        "source_sentence": "母唧鱗捺王有子，名阿誐王；",
        "translation": "His mother, the king of Kapilavastu, had a son named King Anavatapta.",
        "source": "T03n0191_001:0934a25_21"
    },
    {
        "source_sentence": "阿誐王有子，名阿儗囉他王；",
        "translation": "King Anavatapta had a son named King Anavatapta.",
        "source": "T03n0191_001:0934a26_22"
    },
    {
        "source_sentence": "阿儗囉他王有子，名婆儗囉他王；",
        "translation": "King Athartha had a son named Vasiṣṭha.",
        "source": "T03n0191_001:0934a26_23"
    },
    {
        "source_sentence": "婆儗囉他王有子，名娑誐囉王；",
        "translation": "The king of Vātsīputra had a son named King Sadāparvata.",
        "source": "T03n0191_001:0934a27_24"
    },
    {
        "source_sentence": "娑誐囉王有子，名摩賀娑誐囉王；",
        "translation": "“The king of Sāgara had a son named King Mahasara.",
        "source": "T03n0191_001:0934a28_25"
    },
    {
        "source_sentence": "摩賀娑誐囉王有子，名舍矩禰王；",
        "translation": "“Great king Mahāsādhara had a son named King Śākyamuni.",
        "source": "T03n0191_001:0934a29_26"
    },
    {
        "source_sentence": "舍矩禰王有子，名摩賀舍矩禰王；",
        "translation": "Ānanda, King Śākyamuni had a son named King Mahāśakūṭa.",
        "source": "T03n0191_001:0934a29_27"
    },
    {
        "source_sentence": "摩賀舍矩禰王有子，名矩舍王；",
        "translation": "“The king of Magadha had a son named King Kuśinagara, who was called Kaśinagara.",
        "source": "T03n0191_001:0934b01_28"
    },
    {
        "source_sentence": "矩舍王有子，名烏波矩舍王；",
        "translation": "The king of Kuśinagara had a son named King Upaguśaila.",
        "source": "T03n0191_001:0934b02_29"
    },
    {
        "source_sentence": "烏波矩舍王有子，名摩賀矩舍王；",
        "translation": "The king Upagupta had a son named King Mahākauṣṭhila.",
        "source": "T03n0191_001:0934b03_0"
    },
    {
        "source_sentence": "摩賀矩舍王有子，名酥捺哩舍曩王；",
        "translation": "Ānanda, King Mahākauṣṭhila had a son named Kaṇṭhaka-rāja.",
        "source": "T03n0191_001:0934b03_1"
    },
    {
        "source_sentence": "酥捺哩舍曩王有子，名摩賀酥捺哩舍曩王；",
        "translation": "Ānanda had a son named Mahāhungaraśatru, king of the gandharvas.",
        "source": "T03n0191_001:0934b04_2"
    },
    {
        "source_sentence": "摩賀酥捺哩舍曩王有子，名鉢囉拏耶王；",
        "translation": "“Great king Mahesudarśana had a son named King Prasenajit.",
        "source": "T03n0191_001:0934b05_3"
    },
    {
        "source_sentence": "鉢囉拏耶王有子，名摩賀鉢囉拏耶王；",
        "translation": "King Prasenajit had a son named Mahaprasenajit.",
        "source": "T03n0191_001:0934b06_4"
    },
    {
        "source_sentence": "摩賀鉢囉拏耶王有子，名鉢囉拏那王；",
        "translation": "“The king Mahaprasenajit had a son named Prasenajit, who was called King Mahaprasenajit.",
        "source": "T03n0191_001:0934b07_5"
    },
    {
        "source_sentence": "鉢囉拏那王有子，名摩賀鉢囉拏那王；",
        "translation": "King Prasenajit had a son named Mahaprasenajit.",
        "source": "T03n0191_001:0934b08_6"
    },
    {
        "source_sentence": "摩賀鉢囉拏那王有子，名鉢囉半迦囉王；",
        "translation": "“O Mahāprajāpatīṇa had a son named King Prabhākaramātu.",
        "source": "T03n0191_001:0934b09_7"
    },
    {
        "source_sentence": "鉢囉半迦囉王有子，名鉢囉多波王；",
        "translation": "King Prabhākaramitra had a son named King Prabhūtaratna.",
        "source": "T03n0191_001:0934b10_8"
    },
    {
        "source_sentence": "鉢囉多波王有子，名嚩彌嚕王；",
        "translation": "The king of Pratapāda had a son named King Sumeru.",
        "source": "T03n0191_001:0934b10_9"
    },
    {
        "source_sentence": "嚩彌嚕王有子，名彌嚕摩多王；",
        "translation": "King Sumeru had a son, named King Sumeru the Great.",
        "source": "T03n0191_001:0934b11_10"
    },
    {
        "source_sentence": "彌嚕摩多王有子，名阿哩唧王；",
        "translation": "King Miliṇḍa had a son named Ariṣṭa-rāja.",
        "source": "T03n0191_001:0934b12_11"
    },
    {
        "source_sentence": "阿哩唧王有子，名囉哩唧瑟摩王；",
        "translation": "King Ariṣṭa had a son named King Rāriṣṭrapālasamarāja.",
        "source": "T03n0191_001:0934b13_12"
    },
    {
        "source_sentence": "囉哩唧瑟摩王有子，名曩哩唧瑟摩多王；",
        "translation": "The king of Rāriṣṭhāma had a son named King Upariṭṭṭha, who was the ruler of Rāriṣṭhāma.",
        "source": "T03n0191_001:0934b13_13"
    },
    {
        "source_sentence": "曩哩唧瑟摩多王有子，名阿哩止娑滿多王。",
        "translation": "The king of Kālṛkāṣmatī had a son named King Ariṣṭasamanta.",
        "source": "T03n0191_001:0934b14_14"
    },
    {
        "source_sentence": "如是等王子孫相繼，共有一百大國王，皆都布多羅迦城。",
        "translation": "These princes and their descendants succeeded one hundred great kings, all in the city of Potalaka.",
        "source": "T03n0191_001:0934b15_15"
    },
    {
        "source_sentence": "「於最後王生其一王，名降怨王，彼王有大威德能降諸怨，是故名降怨王。",
        "translation": "In the final king, there's a king named King Who Overcomes Enemies, and that king has great authority and virtue to overcome enemies; therefore, he's called the king who overcomes enemies.",
        "source": "T03n0191_001:0934b17_0"
    },
    {
        "source_sentence": "如是此王子孫相繼帝位不絕，有五萬四千王，都阿喻駄也城。",
        "translation": "Thus, this prince's throne of succession to the emperor is not cut off, and there are 54,000 kings who all live in the city of Anavatapta.",
        "source": "T03n0191_001:0934b18_1"
    },
    {
        "source_sentence": "又此最後王復生一子，名無能勝王，彼王子孫相繼，帝位相承，有六萬天子，",
        "translation": "Again, the last king had a son named King Anāgārjuna. The princes and their descendants succeeded one another in succession to rule over all sixty thousand celestial beings.",
        "source": "T03n0191_001:0934b20_0"
    },
    {
        "source_sentence": "都波羅奈國。",
        "translation": "It's the capital of the country of Vārāṇasī.",
        "source": "T03n0191_001:0934b21_1"
    },
    {
        "source_sentence": "於最後王又生一子，名耨鉢囉娑訶王，子孫相繼有八萬四千王，都緊閉羅城。",
        "translation": "The last king had another son named Upāsāha, who was called King Upāsāha. His descendants were eighty-four thousand in number and all lived in the city of Kaṅkala.",
        "source": "T03n0191_001:0934b22_0"
    },
    {
        "source_sentence": "於最後王復生一子，名梵授王，子孫相繼有三萬二千王，都賀悉帝曩布里城。",
        "translation": "In the last king, another son named Brahmadatta (i.e., King Brahmadatta) was born and there were thirty-two thousand princes in succession from one to the other who ruled over the whole empire. The duly anointed ruler ruled over the city of Parīttapālī.",
        "source": "T03n0191_001:0934b23_1"
    },
    {
        "source_sentence": "於最後王復生一子，名賀悉帝捺多王，子孫相繼有五千王，都怛叉尸羅城。",
        "translation": "The last king had another son, named King Hasetīdatta, who successively ruled over five thousand kings and all of his descendants lived in the city of Kauṣṭhila.",
        "source": "T03n0191_001:0934b25_2"
    },
    {
        "source_sentence": "於最後王復生一子，名娑多黎薩王，子孫相繼有三萬二千王，都烏囉娑大城。",
        "translation": "The last king had another son, named King Sadālīṣa, who ruled over thirty-two thousand kings from generation to generation and all inherited the great city of Ursavastu.",
        "source": "T03n0191_001:0934b27_3"
    },
    {
        "source_sentence": "於最後王復生一王，名曩誐曩[口*爾]曩王，子孫相繼有三萬二千王，",
        "translation": "In the last king, another king named Kauśinagara (“Mouth*er”) grew; his descendants numbered thirty-two thousand in succession.",
        "source": "T03n0191_001:0934b29_0"
    },
    {
        "source_sentence": "都無能大城。",
        "translation": "There's no capable great city at all.",
        "source": "T03n0191_001:0934c01_1"
    },
    {
        "source_sentence": "於最後王復生一王，名勝軍王，子孫相繼有一萬八千王，都瞻波大城。",
        "translation": "In succession to the last king, there was another king named King Prasenajit, whose descendants numbered one million eighty-eight thousand and all in the great city of Campā.",
        "source": "T03n0191_001:0934c01_2"
    },
    {
        "source_sentence": "於最後王復生一子，名龍天王，子孫相繼有二萬五千王，都怛摩黎多城。",
        "translation": "The last king had another son, named King of the Nāga-devas, who successively produced twenty-five thousand kings and capitalized in the city of Kālôdayin.",
        "source": "T03n0191_001:0934c03_3"
    },
    {
        "source_sentence": "於最後王復生一子，名為仁王，子孫相繼有一萬二千王，亦都怛摩黎多城。",
        "translation": "The last king had another son, named King Renwang, who was a descendant of twelve thousand kings and also capitalized in the city of Mathurā.",
        "source": "T03n0191_001:0934c05_4"
    },
    {
        "source_sentence": "於最後王復生一子，名為海王，子孫相繼有一萬八千王，都難多布里也城。",
        "translation": "The last king had another son, named the king of the sea, whose descendants succeeded one million eighty-eight thousand kings and all lived in the city of Nandapura.",
        "source": "T03n0191_001:0934c06_5"
    },
    {
        "source_sentence": "於最後王復生一子，名妙意王，子孫相繼有二萬五千王，都王舍城。",
        "translation": "The last king had another son named King Marvelous Wish, who successively produced twenty-five thousand kings and their capital was the city of Rājagṛha.",
        "source": "T03n0191_001:0934c08_6"
    },
    {
        "source_sentence": "於最後王復生一子，名娑多謨努那王，子孫相繼有一百王，亦都波羅奈國。",
        "translation": "The last king had another son, named King Sadānīputra, who was also the capital of the country of Vārāṇasī. His descendants successively had one hundred kings, all of whom ruled the country of Vārāṇasī.",
        "source": "T03n0191_001:0934c10_7"
    },
    {
        "source_sentence": "於最後王復生一子，名大軍王，子孫相繼有一千王，都矩舍嚩帝大城。",
        "translation": "The last king had another son, named Maha軍王, who in succession to his descendants ruled over one thousand kings and the capital was the great city of Kuśinagara.",
        "source": "T03n0191_001:0934c11_8"
    },
    {
        "source_sentence": "於最後王復生一子，名海軍王，子孫相繼有一千王，都補多羅迦城。",
        "translation": "The last king had another son, named King Naval Warrior, whose descendants were one thousand in number and the capital of which was the city of Potalaka.",
        "source": "T03n0191_001:0934c13_9"
    },
    {
        "source_sentence": "於最後王復生一子，名娑多半尼囉王，子孫相繼有八萬四千王，都矩舍嚩帝城。",
        "translation": "The last king had another son, named King Sadāparibhūtarjuna, who successively produced eighty-four thousand kings, all in the city of Kuśinagara.",
        "source": "T03n0191_001:0934c15_0"
    },
    {
        "source_sentence": "於最後王復生一王，名摩呬目佉王，子孫相繼有十萬王，亦都波羅奈國。",
        "translation": "In the last king, another king named Mahāmaudgalyāyana (known as Mahamaudgalyāyana) was born. His descendants had one hundred thousand kings in succession, all of whom ruled over the country of Vārāṇasī.",
        "source": "T03n0191_001:0934c16_1"
    },
    {
        "source_sentence": "於最後王復生一王，名摩呬鉢帝王，亦名地主王，子孫相繼有一百王，",
        "translation": "In the last king, another king named Mahāprajāpatīrāja (known as King Mahāprajāpatīrāja), also known as King Mahāprajāpatīrāja, was reborn. His descendants were one hundred in number.",
        "source": "T03n0191_001:0934c18_2"
    },
    {
        "source_sentence": "都阿喻駄大城中。",
        "translation": "It's in the great city of Anavatapta.",
        "source": "T03n0191_001:0934c20_3"
    },
    {
        "source_sentence": "於最後王復生一王，名持世王，子孫相繼有八萬四千王，都彌體羅城。",
        "translation": "In the last king, another king named Mahāprajāpatīṃdhara appeared. His descendants had eighty-four thousand kings in succession, all of whom ruled over the city of Mṛgāra.",
        "source": "T03n0191_001:0934c20_4"
    },
    {
        "source_sentence": "於最後王復生一王，名大天王，梵行清淨，子孫相繼有八萬四千王，亦都彌體羅城。",
        "translation": "In the last king, another king named Great King of Devas, who practiced pure and genuine austerity, had eighty-four thousand successive kings all in the city of Miliṇḍa.",
        "source": "T03n0191_001:0934c22_5"
    },
    {
        "source_sentence": "「於最後王復生一王，名儞彌王，彼王復生摩娛努王；",
        "translation": "“After the last king, there will be another king named King Sumeru, and that king will be reborn as Mahākauṣṭhila.",
        "source": "T03n0191_001:0934c24_6"
    },
    {
        "source_sentence": "摩娛努王復生涅里姹儞彌佉努王；",
        "translation": "“The king Mahāmaudgalyāyana was reborn as the king Nirṛṣiṣṭacāritra and the king Maitrāyaniputra.",
        "source": "T03n0191_001:0934c25_7"
    },
    {
        "source_sentence": "涅里姹儞彌佉努王復生嚕波佉努王；",
        "translation": "Then the king of Nirṛṣamāṇarati reappeared and was reborn as the king Rāpanna.",
        "source": "T03n0191_001:0934c26_8"
    },
    {
        "source_sentence": "嚕波佉努王復生佉努摩曩王；",
        "translation": "The king Upagupta grew to be reborn as the king Kaṇṭhakamātṛṣa.",
        "source": "T03n0191_001:0934c27_0"
    },
    {
        "source_sentence": "佉努摩曩王復生佉努滿多王；",
        "translation": "Then the king of Anavatapta was reborn as the king Anavatapta Mantāṇḍa.",
        "source": "T03n0191_001:0934c27_1"
    },
    {
        "source_sentence": "佉努滿多王復生酥涅里舍王；",
        "translation": "Then the king of Kaṇṭhaka and the king of Pūrvavideha were reborn as the kings of Kauśinagara and Nirissa.",
        "source": "T03n0191_001:0934c28_2"
    },
    {
        "source_sentence": "酥涅里舍王復生娑涅里舍王；",
        "translation": "The king of the nirvana of butter is reborn as the king of the saskāras.",
        "source": "T03n0191_001:0934c29_3"
    },
    {
        "source_sentence": "娑涅里舍王復生酥嚕多細曩王；",
        "translation": "The king of Sānīliṣa was reborn as the king gross and subtle turtle.",
        "source": "T03n0191_001:0934c29_4"
    },
    {
        "source_sentence": "酥嚕多細曩王復生達魔細曩王；",
        "translation": "The subtle garuḍa king was again reborn as the subtle garuḍa king Māra.",
        "source": "T03n0191_001:0935a01_5"
    },
    {
        "source_sentence": "達魔細曩王復生尾儞多王；",
        "translation": "The subtle serpent king Devadatta was reborn as the king Virūḍhaka.",
        "source": "T03n0191_001:0935a02_6"
    },
    {
        "source_sentence": "尾儞多王復生摩賀尾儞多王；",
        "translation": "“The king of Vaiśeṣika was reborn as the king of Mahā Vaiśeṣika.",
        "source": "T03n0191_001:0935a03_0"
    },
    {
        "source_sentence": "摩賀尾儞多王復生尾儞多細曩王；",
        "translation": "“The king Mahāvairocana also gave birth to the subtle garuḍa king Virūḍhaka.",
        "source": "T03n0191_001:0935a03_1"
    },
    {
        "source_sentence": "尾儞多細曩王復生阿輸迦王；",
        "translation": "The subtle garuḍa king Vaiśravaṇa was reborn as the king Aśoka.",
        "source": "T03n0191_001:0935a04_2"
    },
    {
        "source_sentence": "阿輸迦王復生尾誐多輸迦王；",
        "translation": "The king Aśoka was reborn as the king Vedantaśoka.",
        "source": "T03n0191_001:0935a05_3"
    },
    {
        "source_sentence": "尾誐多輸迦王復生頗羅娑埵王；",
        "translation": "Vimaladattaśoka the king was reborn as Phārasena the king.",
        "source": "T03n0191_001:0935a05_4"
    },
    {
        "source_sentence": "頗羅娑埵王復生惹羅娑埵王；",
        "translation": "The king Phārasākkha was reborn as the king Rāṣṭrapāla.",
        "source": "T03n0191_001:0935a06_5"
    },
    {
        "source_sentence": "惹羅娑埵王復生沒度摩囉王；",
        "translation": "Again, the king of Rāṣṭrapāla was reborn as the king Mucilinda.",
        "source": "T03n0191_001:0935a07_6"
    },
    {
        "source_sentence": "沒度摩囉王復生阿嚕拏王；",
        "translation": "“Then King Saddharmasara was reborn as the king Varuṇa.",
        "source": "T03n0191_001:0935a08_7"
    },
    {
        "source_sentence": "阿嚕拏王復生儞扇波帝王；",
        "translation": "Again, King Varuṇa was reborn as King Upariṭṭṭha.",
        "source": "T03n0191_001:0935a08_8"
    },
    {
        "source_sentence": "儞扇波帝王復生里娛王；",
        "translation": "King Upariṭṭṭha was reborn as the king of Riṣapālī.",
        "source": "T03n0191_001:0935a09_9"
    },
    {
        "source_sentence": "里娛王復生商迦囉迦王；",
        "translation": "The king Reṣu was reborn as the king Shangkaraka.",
        "source": "T03n0191_001:0935a10_10"
    },
    {
        "source_sentence": "商迦囉迦王復生阿難那王；",
        "translation": "The king Shangkaraka was reborn as the king Ānanda.",
        "source": "T03n0191_001:0935a10_11"
    },
    {
        "source_sentence": "阿難那王復生阿那里舍目佉王；",
        "translation": "Ānanda the king was again reborn as King Adaraśāmauddhodana.",
        "source": "T03n0191_001:0935a11_12"
    },
    {
        "source_sentence": "阿那里舍目佉王復生惹那迦王；",
        "translation": "“Then the king Adaraśāmaudgalyāyana was reborn as the king Jetaka.",
        "source": "T03n0191_001:0935a12_13"
    },
    {
        "source_sentence": "惹那迦王復生散惹曩佉王；",
        "translation": "Then the king ofjanaka was reborn as the king Sanskara.",
        "source": "T03n0191_001:0935a12_14"
    },
    {
        "source_sentence": "散惹曩佉王復生惹曩沙婆王；",
        "translation": "Again, the king Sanjayan was reborn as the king Jatasabha.",
        "source": "T03n0191_001:0935a13_15"
    },
    {
        "source_sentence": "惹曩沙婆王復生案曩播曩王；",
        "translation": "Again, the king of Jambudvfpa was reborn as the king Kasyapa.",
        "source": "T03n0191_001:0935a14_16"
    },
    {
        "source_sentence": "案曩播曩王復生鉢囉祖囉曩播曩王；",
        "translation": "At that time the king Kasyapaṇḍa was reborn as the king Prasenajit.",
        "source": "T03n0191_001:0935a14_17"
    },
    {
        "source_sentence": "鉢囉祖囉曩播曩王復生阿[口*爾]多王；",
        "translation": "The king Prasenajit was reborn as King Ajātaśatru.",
        "source": "T03n0191_001:0935a15_18"
    },
    {
        "source_sentence": "阿[口*爾]多王復生波羅[口*爾]多王；",
        "translation": "Again, King Atiṣṭavyūha was reborn as King Vārāṇasī.",
        "source": "T03n0191_001:0935a16_19"
    },
    {
        "source_sentence": "波囉[口*爾]多王復生鉢囉底瑟恥多王；",
        "translation": "King Pārāḍa [mouthed*er] again gave birth to King Pratīṣṭhita.",
        "source": "T03n0191_001:0935a17_20"
    },
    {
        "source_sentence": "鉢囉底瑟恥多王復生酥鉢囉底瑟恥多王；",
        "translation": "The king Pratīṣṭhita again gave birth to the king Supratiṣṭhita.",
        "source": "T03n0191_001:0935a18_21"
    },
    {
        "source_sentence": "酥鉢囉底瑟恥多王復生摩賀摩羅王；",
        "translation": "The king Kassaparatiṣṭhita was reborn as King Mahamalā.",
        "source": "T03n0191_001:0935a19_22"
    },
    {
        "source_sentence": "摩賀摩羅王復生嚩賀曩王；",
        "translation": "“Then King Mahāmaudgalyāyana was reborn as the king Kaṇṭhakavyūha.",
        "source": "T03n0191_001:0935a20_0"
    },
    {
        "source_sentence": "嚩賀曩王復生酥摩帝王；",
        "translation": "Ānanda the king of Gandhamādana was reborn as King Somatī.",
        "source": "T03n0191_001:0935a20_1"
    },
    {
        "source_sentence": "酥摩帝王復生涅里姹嚩賀王；",
        "translation": "Then the king of Kṣumatī was reborn as the king Nirṛṣṭacchattra.",
        "source": "T03n0191_001:0935a21_2"
    },
    {
        "source_sentence": "涅里姹嚩賀王復生捺捨馱努王；",
        "translation": "The king Nirṛṣṭipāla was reborn as the king Nandhadatta.",
        "source": "T03n0191_001:0935a22_0"
    },
    {
        "source_sentence": "捺捨馱努王復生設多馱努王；",
        "translation": "“Then the king Nadīputra was reborn as Sadāparibhūta.",
        "source": "T03n0191_001:0935a22_1"
    },
    {
        "source_sentence": "設多馱努王復生曩嚩帝馱努王；",
        "translation": "The king of Sudarśana was reborn as the king of Gandhāra, and again as the king of Gandhāra.",
        "source": "T03n0191_001:0935a23_2"
    },
    {
        "source_sentence": "曩嚩帝馱努王復生室左怛囉馱努王；",
        "translation": "Again, the king Candra dying was reborn as the royal cakravartin on the left side of his chamber.",
        "source": "T03n0191_001:0935a24_3"
    },
    {
        "source_sentence": "室左怛囉馱努王復生尾[口*爾]多馱努王；",
        "translation": "To the left of Śubhavyūha, King Dharaṇu again gave birth to King [mouth*er] Sadāparvata.",
        "source": "T03n0191_001:0935a25_4"
    },
    {
        "source_sentence": "尾[口*爾]多馱努王復生涅里姹馱努王；",
        "translation": "Ānanda, the king [mouthed*er] Daṇḍunu was reborn as King Nirṛpadhātu.",
        "source": "T03n0191_001:0935a26_0"
    },
    {
        "source_sentence": "涅里姹馱努王復生捺捨囉他王；",
        "translation": "The king of Nirṛpadhātu was reborn as the king Nasaratha.",
        "source": "T03n0191_001:0935a26_1"
    },
    {
        "source_sentence": "捺捨囉他王復生設多囉他王；",
        "translation": "The king naraṣṭrapāla was reborn as the king cakravartin.",
        "source": "T03n0191_001:0935a27_2"
    },
    {
        "source_sentence": "設多囉他王復生曩嚩帝囉他王；",
        "translation": "The king of caitya-rata was reborn as the king caitya-rata.",
        "source": "T03n0191_001:0935a28_3"
    },
    {
        "source_sentence": "曩嚩帝囉他王復生唧怛囉囉他王；",
        "translation": "The caṇḍirāṭa king was reborn as the caṇḍirāṭa king.",
        "source": "T03n0191_001:0935a29_4"
    },
    {
        "source_sentence": "唧怛囉囉他王復生涅里姹囉他王。",
        "translation": "The king of Kātṛṣarāṣṭra again gave birth to the king of Nirṛṣṭrapāla.",
        "source": "T03n0191_001:0935a29_5"
    },
    {
        "source_sentence": "如是等子孫相繼七萬七千王，都僧迦大城。",
        "translation": "In succession to these seventy-seven thousand kings, all of them ruled the great city of Siṃhala.",
        "source": "T03n0191_001:0935b01_6"
    },
    {
        "source_sentence": "「又最後王復生一王，名阿末麗沙王；",
        "translation": "Again, in the last king, another king named King Asurastha was born.",
        "source": "T03n0191_001:0935b02_7"
    },
    {
        "source_sentence": "彼王有子名龍護王，子孫相繼一百王，都波羅奈國。",
        "translation": "That king had a son named Nāgârjuna, who was the dragon guardian king. His descendants succeeded one hundred other kings and their capital was in the country of Vārāṇasī.",
        "source": "T03n0191_001:0935b03_8"
    },
    {
        "source_sentence": "又於最後王生其一子，名訖哩吉王。",
        "translation": "The last king also gave birth to a son named King Kṛji.",
        "source": "T03n0191_001:0935b04_9"
    },
    {
        "source_sentence": "爾時迦葉如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊出見世間，",
        "translation": "It was then that the Tathāgata Kassapa, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavat, appeared in the world.",
        "source": "T03n0191_001:0935b05_10"
    },
    {
        "source_sentence": "彼佛世尊為菩薩時，持戒梵行發大誓願求無上覺，於兜率天而為補處，",
        "translation": "When the Buddha Bhagavat was a bodhisattva, he observed the precepts and practiced austerity. He made a great vow to seek supreme awakening and took refuge in the heaven of satisfaction in the Tuṣita Heaven.",
        "source": "T03n0191_001:0935b07_11"
    },
    {
        "source_sentence": "機緣成熟下生於訖哩吉王宮，捨位修行而成佛道。",
        "translation": "He was reborn in the palace of King Kṛdhrakūṭa and renounced his throne to cultivate practice and become a buddha.",
        "source": "T03n0191_001:0935b09_12"
    },
    {
        "source_sentence": "「爾時訖哩吉王，有一太子名曰善生。",
        "translation": "At the time, there was a prince named Shansheng of King Kṛji.",
        "source": "T03n0191_001:0935b11_0"
    },
    {
        "source_sentence": "此善生王復生王子，如是子孫相繼有一百王。",
        "translation": "This king of good birth is reborn as a prince, and thus there are one hundred kings in succession from generation to generation.",
        "source": "T03n0191_001:0935b11_1"
    },
    {
        "source_sentence": "其最後王復生一子，名迦囉拏王，於其後時生二王子：一名瞿曇；",
        "translation": "The last king again gave birth to a son, named King karaṭṭṭha; and after him two princes were born.",
        "source": "T03n0191_001:0935b12_2"
    },
    {
        "source_sentence": "二名婆囉捺嚩惹。",
        "translation": "The second is called Vārāṇasī.",
        "source": "T03n0191_001:0935b14_3"
    },
    {
        "source_sentence": "此之王子，愛樂王宮貪於國位，恒自思惟，安慰世間行於王事。",
        "translation": "This prince loves the king's palace and craves statehood, always thinking to himself, comforting the world with the king's affairs.",
        "source": "T03n0191_001:0935b14_4"
    },
    {
        "source_sentence": "爾時瞿曇王子恒復思惟：『眾生生死沈沒三塗，苦惱輪迴而難出離。』",
        "translation": "It was then that the prince of Gautama always thought, 'Sentient beings are born in the three destinies and sink into the three destinies of birth and death, which are painful and transmigration, and it's difficult to escape.'",
        "source": "T03n0191_001:0935b16_5"
    },
    {
        "source_sentence": "作是念已，即詣父王稽首拜跪，而白王曰：『我今不樂王宮，欲於山野修習梵行而求出家。』",
        "translation": "After he had this thought, he went to his father, bowed his head and knelt down, and said to the king, 'Now, I won't enjoy the king's palace; I want to cultivate religious practice in the mountains and fields and leave home.'",
        "source": "T03n0191_001:0935b17_6"
    },
    {
        "source_sentence": "王即告言：『汝為我子，所有國土及於王位，宰輔大臣如在指掌，何故輕棄而求出家？』",
        "translation": "The king then told them, 'For my son, why would you discard the land and the king's throne as if they were in your hand? Why would you seek to leave home so lightly?'",
        "source": "T03n0191_001:0935b19_7"
    },
    {
        "source_sentence": "瞿曇白言：『大王！",
        "translation": "Gautama said, 'Great king!",
        "source": "T03n0191_001:0935b21_8"
    },
    {
        "source_sentence": "我觀三界如幻如化，無其堅實，念念無常，何堪愛樂？",
        "translation": "I observe that the three realms are like illusions or apparitions, and they lack their solidity; each thought is impermanent, so how can I enjoy them?",
        "source": "T03n0191_001:0935b22_0"
    },
    {
        "source_sentence": "我於今日辭王出家。』",
        "translation": "Today, I'll leave the king's home and leave home.'",
        "source": "T03n0191_001:0935b23_1"
    },
    {
        "source_sentence": "王既聞已，知子志意即便聽許。",
        "translation": "After hearing this, the king knew his son's intention and even agreed to allow it.",
        "source": "T03n0191_001:0935b23_2"
    },
    {
        "source_sentence": "「爾時山中有一仙人，名訖哩瑟拏吠波野努，於其山間以草為菴居止修行。",
        "translation": "At the time, there was a sage named Kṛṣva-Vipaṇḍinī in the mountains who lived and cultivated on grass as a hermitage in the mountains.",
        "source": "T03n0191_001:0935b25_0"
    },
    {
        "source_sentence": "時瞿曇童子即往彼處，踊躍歡喜五體投地頂禮仙足，而白仙曰：『我別王宮來於此處奉事仙人，",
        "translation": "The Gautama youth then proceeded to that place, leaping and dancing in joy. He prostrated himself at the feet of the holy man by bowing his forehead to the earth five-legged and said to him: I am coming from a separate royal palace to serve you here.",
        "source": "T03n0191_001:0935b26_1"
    },
    {
        "source_sentence": "願賜攝受。』",
        "translation": "May I be given the opportunity to take it in?'",
        "source": "T03n0191_001:0935b28_2"
    },
    {
        "source_sentence": "如是仙人觀於太子志意堅固，即便攝受。",
        "translation": "Thus, the sage observed that the prince's resolve was resolute, and he even accepted it.",
        "source": "T03n0191_001:0935b29_3"
    },
    {
        "source_sentence": "爾時童子即於山間，採果給水奉事仙人，如是辛勤累經歲月，師以彼童精勤不退，",
        "translation": "It was then that the boy went up into the mountains to gather fruit and provide water for the ṛṣi, serving him as his servant. Through years of such hard work, the teacher did not retreat because of the boy’s diligent efforts.",
        "source": "T03n0191_001:0935c01_4"
    },
    {
        "source_sentence": "即為立號亦名仙人。",
        "translation": "That's to establish the name for him, which is also called a sage.",
        "source": "T03n0191_001:0935c02_5"
    },
    {
        "source_sentence": "於後父王迦囉拏而乃命終，時弟婆囉捺惹，即紹王位行其國事。",
        "translation": "His younger brother, Vārāṇasī, then assumed the throne of king and did his national affairs.",
        "source": "T03n0191_001:0935c03_6"
    },
    {
        "source_sentence": "時瞿曇仙人知王命終，告本師曰：『我今不能於其山中採果給水，欲往城中而自住止。』",
        "translation": "Knowing that the king's life had ended, the sage Gautama told his teacher, 'Now, I can't go to the city and stay there on my own.'",
        "source": "T03n0191_001:0935c04_7"
    },
    {
        "source_sentence": "師即告言：『瞿曇！",
        "translation": "The teacher then told him, 'Gautama!",
        "source": "T03n0191_001:0935c06_8"
    },
    {
        "source_sentence": "汝先來此善住山野，何故於今却往城邑？",
        "translation": "Formerly you came here and lived well in the mountains and fields. Why are you now going to the cities?",
        "source": "T03n0191_001:0935c07_9"
    },
    {
        "source_sentence": "汝今去時勿往城內，只於補多落迦城側近寂靜之處卓菴居止，守護諸根精進梵行。』",
        "translation": "When you leave now, don't go inside the city; just stay at a quiet place near the city of Potalaka, where you stand and guard your faculties and diligently practice the holy life.'",
        "source": "T03n0191_001:0935c08_10"
    },
    {
        "source_sentence": "瞿曇童子聞是語已，即往補多落迦大城之外寂靜之處，卓菴結志崇修梵行。",
        "translation": "After hearing these words, the Gautama boy went to a quiet place outside the great city of Potalaka, where he cultivated the religious practice with zeal and determination.",
        "source": "T03n0191_001:0935c10_11"
    },
    {
        "source_sentence": "佛說眾許摩訶帝經卷第一",
        "translation": "Foshuo zhixiu mohaiti jing, vol. 1",
        "source": "T03n0191_001:0935c12_0"
    }
]