[
    {
        "source_sentence": "大莊嚴論經卷第六",
        "translation": "Dazhuangyan lun jing, vol. 6",
        "source": "T04n0201_006:0287a18_0"
    },
    {
        "source_sentence": "馬鳴菩薩造後秦三藏鳩摩羅什譯",
        "translation": "A Translation by Kumārajīva of the Tripiṭaka of the Latter Qin, composed by Mañjuśrī Bodhisattva",
        "source": "T04n0201_006:0287a20_0"
    },
    {
        "source_sentence": "（三一）復次，有實功德堪受供養，無實功德不堪受人信心供養。",
        "translation": "(21) Furthermore, there are real merits that can be offered and no real merits that can't be offered by someone with faith.",
        "source": "T04n0201_006:0287a21_0"
    },
    {
        "source_sentence": "我昔曾聞，拘沙種中有王名真檀迦膩吒，討東天竺，既平定已，威勢赫振福利具足，",
        "translation": "I have heard that once in the distant past there was a king named Zentan Kaniṭṭha among the Kauśina clanspeople who invaded eastern India. Having settled his peacefulness and pacified his mind, he was endowed with great power and prosperity.",
        "source": "T04n0201_006:0287a22_1"
    },
    {
        "source_sentence": "還向本國，於其中路有平博處，於中止宿。",
        "translation": "When he returned to his native land, there was a peaceful and spacious place on the roadway where he spent the night.",
        "source": "T04n0201_006:0287a24_2"
    },
    {
        "source_sentence": "爾時彼王心所愛樂，唯以佛法而為瓔珞，即在息處遙見一塔，以為佛塔，",
        "translation": "At that time, the king’s heart was filled with delight in the buddha-dharma and adorned it with jewels. He saw a stupa at his resting place from a distance and thought of it as a buddha-tathāgata.",
        "source": "T04n0201_006:0287a25_3"
    },
    {
        "source_sentence": "侍從千人往詣塔所，去塔不遠下馬步進，著寶天冠嚴飾其首，既到塔所歸命頂禮，",
        "translation": "The attendants, accompanied by a thousand men, approached the stupa. Not far from the stupa they descended on foot from their horses and entered it. They wore heavenly crowns of jewels to adorn their heads. Having arrived at the place where the stupa was built, they bowed in homage with reverence.",
        "source": "T04n0201_006:0287a27_4"
    },
    {
        "source_sentence": "「離欲諸結障，　　具足一切智，",
        "translation": "Being free of the bonds and hindrances of desire, they are endowed with omniscience.",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "　於諸仙聖中，　　最上無倫疋。",
        "translation": "Among the sages and sages, he's the most unequally discriminated.",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "　能為諸眾生，　　作不請親友，",
        "translation": "They can be uninvited friends and relatives for sentient beings,",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "　名稱世普聞，　　三界所尊重。",
        "translation": "His name is widely heard in the world, honored by the three realms.",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "　棄捨於三有，　　如來所說法，",
        "translation": "They abandon the three realms of existence, The teachings taught by the enlightened.",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "　諸論中最上，　　摧滅諸邪論。",
        "translation": "The highest of all the treatises, it destroys mistaken theories.",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "　我今歸命禮，　　真實阿羅漢。」",
        "translation": "Now, I'll pay homage to the true arhat.",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "說是偈言：爾時彼王，以念如來功德之故稽首敬禮，當作禮時塔即碎壞，",
        "translation": "He spoke these verses: At that time the king, thinking of the virtues of the Tathāgata, bowed his head in respect and paid homage to him. As soon as he had done so, the stupas were destroyed.",
        "source": "T04n0201_006:0287a29_5"
    },
    {
        "source_sentence": "猶如暴風之所吹散。",
        "translation": "It's like being blown away by a strong wind.",
        "source": "T04n0201_006:0287b09_6"
    },
    {
        "source_sentence": "爾時彼王見是事已甚大驚疑，而作是言：「今者此塔無觸近者，云何卒爾無事散壞？",
        "translation": "Seeing this, the king was greatly frightened and said, Now that this stūpa hasn't touched anyone near it, how could it not suddenly disintegrate?",
        "source": "T04n0201_006:0287b10_0"
    },
    {
        "source_sentence": "如斯變異必有因緣。」",
        "translation": "Such transformations must have causes and conditions.",
        "source": "T04n0201_006:0287b12_0"
    },
    {
        "source_sentence": "「帝釋長壽天，　　如是尊重者，",
        "translation": "Śakra Devānām-Indra, the long-lived goddess, thus honored him",
        "source": "T04n0201_006:0287b12_1"
    },
    {
        "source_sentence": "　合掌禮佛塔，　　都無有異相。",
        "translation": "They joined their palms and bowed to the Buddha’s stupa, Yet without any sign of difference.",
        "source": "T04n0201_006:0287b12_1"
    },
    {
        "source_sentence": "　十力大威德，　　尊重高勝人，",
        "translation": "The great and mighty virtue of the ten powers is honored by superior people.",
        "source": "T04n0201_006:0287b12_1"
    },
    {
        "source_sentence": "　大梵來敬禮，　　佛亦無異相。",
        "translation": "Great Brahma comes to pay homage, and the Buddha has no different characteristics.",
        "source": "T04n0201_006:0287b12_1"
    },
    {
        "source_sentence": "　我身輕於彼，　　不應以我壞，",
        "translation": "My body is despised by them, and they shouldn’t be destroyed by me.",
        "source": "T04n0201_006:0287b12_1"
    },
    {
        "source_sentence": "　為是呪術力，　　厭道之所作。」",
        "translation": "It's because of the power of this spell that it's made by someone who's disillusioned with the path.",
        "source": "T04n0201_006:0287b12_1"
    },
    {
        "source_sentence": "即說偈言：王說偈已，以塔碎壞心猶驚怖，而作是言：「願此變異，莫作災患當為吉祥，",
        "translation": "Having uttered these verses, the king was frightened by the destruction of the stupa and said: May this change not bring disaster and prosperity!",
        "source": "T04n0201_006:0287b12_1"
    },
    {
        "source_sentence": "令諸眾生皆得安隱。",
        "translation": "It causes all sentient beings to attain peace.",
        "source": "T04n0201_006:0287b20_2"
    },
    {
        "source_sentence": "我從昔來五體投地禮百千塔，未曾虧損一塵墮落，今者何故變異如是？",
        "translation": "Since the distant past, I've thrown my five bodies to the ground to venerate a hundred thousand stūpas without ever missing a single particle of dust. Why has it changed like this now?",
        "source": "T04n0201_006:0287b21_3"
    },
    {
        "source_sentence": "如斯之相我未曾見。」",
        "translation": "I've never seen such a mark before.",
        "source": "T04n0201_006:0287b22_4"
    },
    {
        "source_sentence": "「為天阿修羅，　　而共大戰鬪？",
        "translation": "Why would gods and asura demons fight together in great battle?",
        "source": "T04n0201_006:0287b23_5"
    },
    {
        "source_sentence": "　為是國欲壞，　　我命將不盡？",
        "translation": "If this country wants to break down, my life won't end?",
        "source": "T04n0201_006:0287b23_5"
    },
    {
        "source_sentence": "　將非有怨敵，　　欲毀於我國？",
        "translation": "Wouldn't there be an enemy who wants to disparage our country?",
        "source": "T04n0201_006:0287b23_5"
    },
    {
        "source_sentence": "　非穀貴刀兵，　　不有疾疫耶？",
        "translation": "Aren't grains valuable to swords and armies, and there's no epidemic?",
        "source": "T04n0201_006:0287b23_5"
    },
    {
        "source_sentence": "　非一切世間，　　欲有災患耶？",
        "translation": "Aren't all the worlds wanting to have disasters and distress?",
        "source": "T04n0201_006:0287b23_5"
    },
    {
        "source_sentence": "　此極是惡相，　　將非法欲滅。」",
        "translation": "This is an extremely bad sign that's about to be unlawfully extinguished.",
        "source": "T04n0201_006:0287b23_5"
    },
    {
        "source_sentence": "即說偈言：爾時近塔村人見王疑怪，即便向王作如是言：「大王！",
        "translation": "He then spoke a verse, saying, At that point, the people near the stūpa saw the king's doubt and wonder, and they even said this to the king, Great king!",
        "source": "T04n0201_006:0287b23_5"
    },
    {
        "source_sentence": "當知此非佛塔。」",
        "translation": "You should know that this isn't a stūpa of the Buddha.",
        "source": "T04n0201_006:0287c02_6"
    },
    {
        "source_sentence": "「尼揵甚愚癡，　　邪見燒其意，",
        "translation": "Nirgrantha is very ignorant and deluded, With wrong views burning her mind.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　斯即是彼塔。　　王作佛心禮，",
        "translation": "This is precisely the stupa.” The king paid respect to the Buddha and worshiped him.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　此塔德力薄，　　又復無舍利，",
        "translation": "Due to the weakness of this stupa’s virtue, There is no relic preserved.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　不堪受王敬，　　是故今碎壞。」",
        "translation": "It's unworthy of the king's respect, so now it's broken and destroyed.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "「此事實應爾，　　我以佛想禮，",
        "translation": "This is really the way it should be. I bow my head in respect to the Buddha,",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　此塔必散壞，　　龍象所載重，",
        "translation": "This stupa will surely disintegrate, Carried by dragons and elephants.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　非驢之所堪。　　佛說三種人，",
        "translation": "It is beyond the ability of a donkey. The Buddha taught that there are three kinds of people:",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　應為起塔廟，　　釋迦牛王尊，",
        "translation": "You should build a stūpa and a shrine for him, For the sake of the Tathāgata Ox King.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　正應為作塔。　　尼揵邪道滅，",
        "translation": "You should make a stūpa for them, so that the nuns and sinners who follow heretical paths will be extinguished.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　不應受是供，　　不淨尼揵子，",
        "translation": "You should not accept such an offering, impure nun!",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　不應受我禮。　　此塔崩壞時，",
        "translation": "You should not accept my greetings.” When this stupa collapsed,",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　出於大音聲，　　喻如多子塔。",
        "translation": "It produces a great sound, which is likened to a stūpa of many children.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　佛往迦葉所，　　迦葉禮佛足。",
        "translation": "When the Buddha went to Kāśyapa, Kāśyapa bowed his head at his feet.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "『是我婆伽婆，　　是我佛世尊。』",
        "translation": "'This is me, Bhagavān, and this is the Bhagavān.'",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　佛告迦葉曰：　　『若非阿羅漢，",
        "translation": "The Buddha said to Kāśyapa:",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　而受汝禮者，　　頭破作七分。』",
        "translation": "Those who receive your homage, their heads are broken into seven parts.'",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "　我今因此塔，　　驗佛語真實。」",
        "translation": "Now, because of this stūpa, I'll examine the truth of the Buddha's words.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "即說偈言：迦膩吒王倍於佛法生信敬心，身毛皆竪悲喜雨淚，而說偈言：如此木石無有心識，",
        "translation": "King Kaniṣṭha doubled his faith and reverence toward the Buddha’s teaching. His bodily hair stood on end in tears of sorrow and emotion, showering rain and tears of joy. He uttered these verses: Just as wood and stones have no mind or consciousness.",
        "source": "T04n0201_006:0287c02_7"
    },
    {
        "source_sentence": "而為尼揵作明證驗，知非一切智。",
        "translation": "He then makes a clear proof for Nirgrantha that he knows it's not omniscience.",
        "source": "T04n0201_006:0287c22_8"
    },
    {
        "source_sentence": "王見是已於大眾前歡喜踊躍，倍生信心容顏怡悅，而作是言：「南無婆伽婆！",
        "translation": "Seeing this, the king rejoiced and jumped for joy in front of the crowd, doubled his faith, made his countenance happy, and said, Namo Bhagavān!",
        "source": "T04n0201_006:0287c23_9"
    },
    {
        "source_sentence": "一切所尊解脫之師，釋迦牟尼佛師子吼言：『此法之外，更無沙門及婆羅門。』",
        "translation": "All the most honored teacher of liberation, Śākyamuni Buddha, the lion roars and says, 'There are no ascetics or brāhmaṇas outside this teaching.'",
        "source": "T04n0201_006:0287c25_10"
    },
    {
        "source_sentence": "佛語真實無有錯謬。",
        "translation": "The Buddha's words are true, without error.",
        "source": "T04n0201_006:0287c26_11"
    },
    {
        "source_sentence": "諸有眾生一足二足、無足多足，有色無色、有想無想，乃至非想非非想，",
        "translation": "“All sentient beings have one leg, two legs, no legs and many legs. They have form and formlessness, ideation and non-thought, up to neither ideation nor non-thought.",
        "source": "T04n0201_006:0287c27_12"
    },
    {
        "source_sentence": "於此眾中唯有如來最為尊勝。",
        "translation": "Among these people, only the Tathāgata is the most honored and superior.",
        "source": "T04n0201_006:0287c28_13"
    },
    {
        "source_sentence": "舉要言之，佛所說者今日皆現，一切外道不如草芥，況復尼揵師、富蘭那迦葉？」",
        "translation": "To summarize, what the Buddha teaches is shown today, and all non-Buddhists aren't like grass or mustard seed, so why wouldn't Nirgrantha and Pūranaka leaves?",
        "source": "T04n0201_006:0287c29_14"
    },
    {
        "source_sentence": "「我是人中王，　　不堪受我禮，",
        "translation": "I am the king among men, unworthy of receiving my bow.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　況復轉輪王，　　阿修羅王等！",
        "translation": "How could it be possible for wheel-turning kings, asura kings, and so forth!",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　此塔於今日，　　如為大象王，",
        "translation": "Today this stupa is like a great elephant king.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　牙足之威力，　　摧破令碎壞。",
        "translation": "The mighty power of his tusks and feet breaks it down and causes it to disintegrate.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　身具四種結，　　故名尼揵陀。",
        "translation": "The body is endowed with four kinds of fetters, so it's called a nun.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　猶如大熱時，　　能除彼熱者，",
        "translation": "It's like when there's a great fever, He can remove that fever.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　名為尼陀伽；　　如來佛世尊，",
        "translation": "It is called “nirodha”; the Tathāgata, the Buddha, the World-Honored One,",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　能斷一切結，　　真是尼陀伽。",
        "translation": "Able to cut all bonds, it's really a nirvāṇa.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　以是於今者，　　尼揵諸弟子，",
        "translation": "That’s why the disciples of Nirgrantha are here now.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　及諸餘天人，　　皆應供養佛。",
        "translation": "And the other gods and humans should all make offerings to the Buddha.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　佛種族智慧，　　名稱甚廣大，",
        "translation": "The wisdom of the Buddha’s lineage Is so vast as to be called great.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　如此之塔廟，　　天人阿修羅，",
        "translation": "Such a stūpa or shrine like this is for gods, humans, and asuras.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　若其禮敬時，　　無有傾動相。",
        "translation": "When he pays homage, there's no sign of tilting.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　猶如蚊子翅，　　扇於須彌山，",
        "translation": "It's like the wing of a mosquito fan on Mount Sumeru.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "　雖盡其勢力，　　不能令動搖。」",
        "translation": "Even though they've exhausted their power, they can't be moved.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "即說偈言：是故若人欲得福德，宜應禮拜佛之塔廟。",
        "translation": "He then spoke a verse, saying, Therefore, if someone wants to attain merit, they should venerate the Buddha's stūpa and temple.",
        "source": "T04n0201_006:0288a02_15"
    },
    {
        "source_sentence": "（三二）復次，若人學問，雖復毀行，以學問力尋能得道，以是義故應勤學問。",
        "translation": "(12) Furthermore, if someone trains and asks questions, even though they disparage their practice, and by the power of training they can attain the path, it's because of this meaning that they should diligently train.",
        "source": "T04n0201_006:0288a19_0"
    },
    {
        "source_sentence": "我昔曾聞，有一多聞比丘住阿練若處，時有寡婦數數往來此比丘所，聽其說法。",
        "translation": "I've heard once before that there was a well-versed monk living in a forest dwelling place, and there were widows who came to this monk several times and listened to his teaching.",
        "source": "T04n0201_006:0288a20_1"
    },
    {
        "source_sentence": "于時學問比丘於此寡婦心生染著，以染著故所有善法漸漸劣弱，為凡夫心結使所使，",
        "translation": "At the time, the monk Śākyamuni had a defiled attachment in his mind to this widow, and because of that defiled attachment, all the good qualities he possessed gradually weakened, being developed by ordinary mental messengers.",
        "source": "T04n0201_006:0288a22_2"
    },
    {
        "source_sentence": "與此婦女共為言要。",
        "translation": "Together with these women, I'll explain the essentials.",
        "source": "T04n0201_006:0288a24_3"
    },
    {
        "source_sentence": "婦女言：「汝今若能罷道還俗，我當相從。」",
        "translation": "The women said, Now, if you can abandon the path and return to the secular world, I will follow you.",
        "source": "T04n0201_006:0288a25_4"
    },
    {
        "source_sentence": "彼時比丘即便罷道。",
        "translation": "The monk then even abandoned his path.",
        "source": "T04n0201_006:0288a26_5"
    },
    {
        "source_sentence": "既罷道已，不能堪任世間苦惱，身體羸瘦不解生業，未知少作而大得財，",
        "translation": "Having renounced the householder’s life, he was unable to endure worldly suffering and distress. His body weakened and emaciated, he did not understand the karma that should be done in life. He did not know how little work he could do to earn a great deal of wealth.",
        "source": "T04n0201_006:0288a26_6"
    },
    {
        "source_sentence": "即自思惟：「我於今者作何方計得生活耶？」",
        "translation": "He then thought to himself, Where did I plan to live now?",
        "source": "T04n0201_006:0288a28_7"
    },
    {
        "source_sentence": "復作是念：「唯客殺羊，用功極輕兼得多利。」",
        "translation": "Again, he thought, It's only the guest who kills a goat that uses extreme effort and much profit.",
        "source": "T04n0201_006:0288a29_8"
    },
    {
        "source_sentence": "作是念已求覓是處，以凡夫心易朽敗故造作斯業，遂與屠兒共為親友。",
        "translation": "After he had this thought, he sought out a place and created this action because the minds of ordinary people are easy to decay, so he became friends with the butcher's boy.",
        "source": "T04n0201_006:0288b01_9"
    },
    {
        "source_sentence": "於賣肉時，有一相識乞食道人，於道路上偶值得見，見已便識頭髮蓬亂，",
        "translation": "At the time of selling meat, there was a characteristic that recognized the begging monk. He happened to be worthy of seeing on the roadway. On seeing him, he became aware that his hair stood on end in disarray.",
        "source": "T04n0201_006:0288b03_10"
    },
    {
        "source_sentence": "著青色衣身上有血，猶如閻羅羅剎，所執肉稱悉為血污。",
        "translation": "He's wearing a blue-colored robe with blood on his body, just like the Yama and Rāṣṭrapāla, holding flesh that's called all defiled by blood.",
        "source": "T04n0201_006:0288b05_11"
    },
    {
        "source_sentence": "見其稱肉欲賣與人，比丘見已即長歎息作是思惟：「佛語真實！",
        "translation": "Seeing his claimed flesh and wanting to sell it to someone, the monk sees it, and after seeing it, he sighs and thinks, The Buddha's words are true!",
        "source": "T04n0201_006:0288b06_12"
    },
    {
        "source_sentence": "凡夫之心輕躁不停，極易迴轉。",
        "translation": "Ordinary people's minds are mild and restless, and it's extremely easy to turn around.",
        "source": "T04n0201_006:0288b08_0"
    },
    {
        "source_sentence": "先見此人勤修學問護持禁戒，何意今日忽為斯事？」",
        "translation": "Seeing this person who had previously diligently cultivated discipline and observed the precepts, why would you suddenly want to do such a thing today?",
        "source": "T04n0201_006:0288b08_1"
    },
    {
        "source_sentence": "「汝若不調馬，　　放逸造眾惡，",
        "translation": "If you don't regulate your horse, carelessly creating all kinds of evil,",
        "source": "T04n0201_006:0288b10_0"
    },
    {
        "source_sentence": "　云何離慚愧，　　捨棄調伏法？",
        "translation": "How is it that you're free of shame and abandon the method of discipline?",
        "source": "T04n0201_006:0288b10_0"
    },
    {
        "source_sentence": "　威儀及進止，　　為人所樂見，",
        "translation": "Their deportment and their movements are liked by the people.",
        "source": "T04n0201_006:0288b10_0"
    },
    {
        "source_sentence": "　飛鳥及走獸，　　覩之不驚畏。",
        "translation": "Flying birds and walkers aren't frightened when they see it.",
        "source": "T04n0201_006:0288b10_0"
    },
    {
        "source_sentence": "　行恐傷蟻子，　　慈哀憐眾生，",
        "translation": "Fearing to harm the ants, he acts compassionately toward sentient beings.",
        "source": "T04n0201_006:0288b10_0"
    },
    {
        "source_sentence": "　如是悲愍心，　　今為安所在？」",
        "translation": "Such a compassionate mind, where is it now?",
        "source": "T04n0201_006:0288b10_0"
    },
    {
        "source_sentence": "作是念已，即說偈言：凡夫之人其心不定，正可名為沙門婆羅門數，是故如來不說標相；",
        "translation": "Having thought thus, he uttered the following verse: Ordinary people whose minds are unsettled can precisely be called śramaṇas and brāhmaṇas. Because of this, the Tathāgata does not teach marks.",
        "source": "T04n0201_006:0288b10_0"
    },
    {
        "source_sentence": "若得見諦真實，是名為沙門及婆羅門。",
        "translation": "If someone can see the truth as it is, they're called an ascetic or a brāhmaṇa.",
        "source": "T04n0201_006:0288b18_1"
    },
    {
        "source_sentence": "「勇捍而自稱，　　謂己真沙門，",
        "translation": "You should bravely express yourselves as a true śramaṇa.",
        "source": "T04n0201_006:0288b19_2"
    },
    {
        "source_sentence": "　為此不調心，　　忽作斯大惡。」",
        "translation": "Because of this uncontrolled mind, he suddenly does this great evil.",
        "source": "T04n0201_006:0288b19_2"
    },
    {
        "source_sentence": "復說偈言：說是偈已，尋即思惟：「我於今者作何方便令其開悟？",
        "translation": "After he spoke these verses, he immediately thought, What method will I use now to enlighten them?",
        "source": "T04n0201_006:0288b19_2"
    },
    {
        "source_sentence": "如佛言曰：『若教人時，先當令其於四不壞生清淨信，此四不壞能令眾生得見四諦。』",
        "translation": "As the Buddha said, 'When you teach people, you must first cause them to give rise to pure faith in the four indestructible things, and these four indestructible things can cause sentient beings to attain the four noble truths.'",
        "source": "T04n0201_006:0288b23_3"
    },
    {
        "source_sentence": "今當為說作業根本。」",
        "translation": "Now, I'll explain the root of my work for you.",
        "source": "T04n0201_006:0288b25_4"
    },
    {
        "source_sentence": "作是念已而語之言：「汝於今者極善稱量。」",
        "translation": "After he had this thought, he said to him, Now, you're extremely good at measuring it.",
        "source": "T04n0201_006:0288b25_5"
    },
    {
        "source_sentence": "時賣肉者作是念言：「此比丘既不買肉，何故語我極善稱量？」",
        "translation": "The meat seller then had this thought, Since this monk didn't buy the flesh, why did he tell me to measure it so well?",
        "source": "T04n0201_006:0288b26_6"
    },
    {
        "source_sentence": "「此必有悲愍，　　而來見濟拔！",
        "translation": "This must have compassion and pity, yet I've come to see Ji up!",
        "source": "T04n0201_006:0288b28_7"
    },
    {
        "source_sentence": "　如斯之比丘，　　久離市易法，",
        "translation": "Such a monk has been away from the marketplace for a long time.",
        "source": "T04n0201_006:0288b28_7"
    },
    {
        "source_sentence": "　見吾為惡業，　　故來欲救度。",
        "translation": "Seeing me as a bad action, I came to save and liberate you.",
        "source": "T04n0201_006:0288b28_7"
    },
    {
        "source_sentence": "　實是賢聖人，　　為我作利益！」",
        "translation": "This is really a good and noble person who benefits me!",
        "source": "T04n0201_006:0288b28_7"
    },
    {
        "source_sentence": "作是念已，即說偈言：說是偈已，尋憶昔者為比丘時造作諸行，念先所誦經名曰苦聚欲過欲味。",
        "translation": "After he had this thought, he spoke these verses, saying, Having spoken these verses, he recalled the actions created for the monks in the past and remembered the sūtras he had previously recited that were called the taste of suffering as a mass of desire and overpowering desire.",
        "source": "T04n0201_006:0288b28_7"
    },
    {
        "source_sentence": "思憶此已，即以肉稱遠投於地，於生死中深生厭患，語彼比丘：「大德，",
        "translation": "When he thought of this, he threw himself to the ground with his flesh and praised him. Being deeply disgusted by birth and death, he said to the monk:",
        "source": "T04n0201_006:0288c05_8"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T04n0201_006:0288c07_9"
    },
    {
        "source_sentence": "「欲味及欲過，　　何者為最多？",
        "translation": "What's the greatest? The taste of craving and the fault of craving.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　我以慚愧[革*玄]，　　捉持智慧秤。",
        "translation": "With shame [Ge * Xuan], I grasped the scale of wisdom.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　思量如此事，　　心已得通達，",
        "translation": "Considering such things, his mind has already comprehended them.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　不見其有利，　　純覩欲衰患。",
        "translation": "They don't see their benefits, and they are purely tormented by the decline of sexual desire.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　以是故我今，　　宜應捨離欲，",
        "translation": "For this reason it is appropriate for me now To become free of desire.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　往詣於僧坊，　　復還求出家。",
        "translation": "They go to the monastery and return home again, seeking to leave home.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　我今為欲作，　　身苦極下賤，",
        "translation": "Now that I want to do it, my body is painful and extremely inferior.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　雖是現在身，　　即如墮惡道。",
        "translation": "Even though it's the present body, it's like falling into a bad path.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　我昔出家時，　　濾水而後飲，",
        "translation": "Formerly, when I renounced the householder’s life, I filtered water and later drank it.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　悲愍護他命，　　無有傷害心。",
        "translation": "They are compassionate, protecting others' lives, and have no thoughts of harming them.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　今日如惡鬼，　　食人精血者，",
        "translation": "Today, it's like a bad demon who feeds on human semen and blood.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　我今樂殺害，　　習而不能捨。",
        "translation": "Now, I'm happy to kill and harm, but I can't abandon it.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　善哉佛所說，　　親近於欲者，",
        "translation": "Good, what the Buddha teaches: Being intimate with desire is like being attached to craving.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　無惡而不造。　　我今為欲使，",
        "translation": "Without doing evil, he does not do evil.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　衰苦乃至此。　　一切種智說，",
        "translation": "The knowledge of the destruction of suffering, etc., and so on up to this point.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　四諦我未證，　　從今日已去，",
        "translation": "I have not realized the four truths. From this day forth,",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　終不更放逸。　　十力尊所說，",
        "translation": "They will never again indulge in idleness.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　前為放逸者，　　後止更不作，",
        "translation": "The former one is careless, but the latter stops and no longer does it.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　如月離雲翳，　　明照于世間。",
        "translation": "Like the moon that is free of clouds, it shines brightly in the world.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　是故我今當，　　專心持禁戒，",
        "translation": "Therefore, I will now concentrate my mind on observing the precepts.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　設頭上火然，　　衣服亦焚燒，",
        "translation": "If the top of your head is on fire, Your clothes will be burned as well.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　我當堅精進，　　修行調順法，",
        "translation": "I will make firm effort, Practice the Dharma and follow it.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　斷難伏結使，　　必令得寂滅。",
        "translation": "To eliminate the afflictive tendencies that are difficult to subdue will surely cause them to attain cessation.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　假毀絕筋脈，　　形體皆枯乾，",
        "translation": "If one were to cut off the tendons and veins, Their bodies would all wither.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　不見四諦者，　　我終不休息，",
        "translation": "Those who don’t see the four truths, I never rest.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　先滅結使怨，　　得勝報施恩。」",
        "translation": "First, he extinguishes the bonds of enemies and attains the superior reward of generosity.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "「汝今若出家，　　必應得解脫，",
        "translation": "If you renounce the householder’s life now, You will surely attain liberation.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　迦梨與僧鉗，　　及以質多羅，",
        "translation": "Kālīya and the saṃgha's forceps, as well as the sūtra,",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　如此等比丘，　　皆七返罷道，",
        "translation": "Such monks as these All returned seven times to the path of renunciation.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　後復還出家，　　獲得阿羅漢。",
        "translation": "He then returned home and renounced the householder’s life, And attained arhatship.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　十力世尊戒，　　汝亦不毀犯，",
        "translation": "The ten powers of the Bhagavān's precepts, don't you violate them?",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　汝不起邪見，　　汝有多聞智，",
        "translation": "Don’t give rise to wrong views. You are well-versed and wise.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　生於厭離善，　　修習寂靜樂。",
        "translation": "They give rise to disillusionment, part with goodness, and cultivate the bliss of quiescence.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　汝有多聞燈，　　結使風所滅，",
        "translation": "You have many well-versed lamps, Which are bound to be destroyed by the wind of bondage.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　汝還修多聞，　　必至無畏方。",
        "translation": "You also cultivate much learning, which will surely lead you to fearlessness.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　為結之所漂，　　當依修定力，",
        "translation": "To be bound by the bonds, one should rely on the power of cultivating concentration.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　修定得勝力，　　明了見結使。",
        "translation": "Cultivating concentration and attaining superior power, he clearly understands the bond of seeing.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　由汝常修集，　　故樂出家法，",
        "translation": "Because you always practice and accumulate, You delight in renunciation of the world.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　心近善功德，　　為結使所壞，",
        "translation": "Their minds are proximate to virtuous qualities, destroyed by the bonds and tendencies.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　修集於正道，　　是意捉結使，",
        "translation": "Cultivating and accumulating the right path, this is the intention to grasp the bonds and tendencies.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "　如象絕羈靽，　　自恣隨意去。」",
        "translation": "It's like an elephant cutting off its reins and leaving it freely at will.",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "而說偈言：爾時比丘知其心念，彼智慧火方始欲然，即說偈言：時罷道比丘即捨惡業，",
        "translation": "He said in verse: At that moment the bhikṣu, knowing what he was thinking, his mind ignited with a fire of wisdom. Then he spoke these verses:",
        "source": "T04n0201_006:0288c07_10"
    },
    {
        "source_sentence": "出家精勤得阿羅漢果。",
        "translation": "He renounced the householder’s life and exerted himself diligently to attain arhatship.",
        "source": "T04n0201_006:0289a22_11"
    },
    {
        "source_sentence": "（三三）復次，若欲莊嚴無過善業，是故應當勤修諸善。",
        "translation": "(3) Furthermore, if they want to adorn themselves with unsurpassed good actions, they should diligently cultivate goodness.",
        "source": "T04n0201_006:0289a24_0"
    },
    {
        "source_sentence": "我昔曾聞，有一田夫聰明黠慧，與諸徒伴共來入城。",
        "translation": "I have heard that once in the past there was a learned and intelligent farmer who came into the city together with his companions.",
        "source": "T04n0201_006:0289a25_1"
    },
    {
        "source_sentence": "時見一人，容貌端正莊嚴衣服，種種瓔珞服乘嚴麗，多將侍從，悉皆嚴飾瓌瑋可觀。",
        "translation": "He saw a man of handsome appearance, well dressed in all kinds of jewelry and fine clothing, with many attendants. They were all beautifully decorated and pleasing to be seen.",
        "source": "T04n0201_006:0289a26_2"
    },
    {
        "source_sentence": "彼聰明者語諸行伴：「不好不好。」",
        "translation": "That wise man said to his fellow practitioners, Not good or not good.",
        "source": "T04n0201_006:0289a28_3"
    },
    {
        "source_sentence": "同伴語言：「如此之人威德端正，深可愛敬有何不好？」",
        "translation": "The companions said, What's wrong with such a person of authority and virtue who's so deeply desirable and respectful?",
        "source": "T04n0201_006:0289a29_4"
    },
    {
        "source_sentence": "聰明者言：「我自不好，亦不以彼用為不好，由我前身不造功德，致使今者受此賤身，",
        "translation": "The intelligent man said, “I myself am not good and do not regard their use as bad. It is because I did not perform meritorious deeds in my previous existence that I am now suffering from this inferior body.",
        "source": "T04n0201_006:0289b01_5"
    },
    {
        "source_sentence": "無有威勢人所不敬。",
        "translation": "There's no authority that people won't respect it.",
        "source": "T04n0201_006:0289b03_6"
    },
    {
        "source_sentence": "若先修福，豈當不及如此人者，是故我今應勤修善，必使將來有勝於彼。」",
        "translation": "If someone previously cultivated goodness, they wouldn't be inferior to such a person; therefore, I should now diligently cultivate goodness so that there will be someone who's superior to them in the future.",
        "source": "T04n0201_006:0289b04_0"
    },
    {
        "source_sentence": "「彼捨於放逸，　　修善獲福利，",
        "translation": "“They abandon carelessness, cultivate goodness, and attain benefit.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　我由放逸故，　　不修功德業，",
        "translation": "Because of my carelessness, I do not cultivate virtuous deeds.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　是以今貧賤，　　下劣無威勢，",
        "translation": "That’s why they are now poor and inferior, Weak and powerless.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　我今自愧責，　　故自稱不好。",
        "translation": "Now that I'm ashamed of myself and blameworthy, I therefore call myself bad.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　我今自觀察，　　窮賤極可愍，",
        "translation": "I now observe for myself that the world is extremely miserable and pitiable.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　結使所欺誑，　　放逸之所壞，",
        "translation": "They are deceived by the bonds and afflictions, destroyed by heedlessness.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　自從今以後，　　勤修施戒定，",
        "translation": "From now on, I’ll diligently cultivate generosity, morality, and meditation.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　必使將來生，　　種姓好眷屬，",
        "translation": "They will surely be born in the future, With good castes and retinues.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　端正有威德，　　財富多侍從，",
        "translation": "He was handsome and dignified, Endowed with great virtue. His attendants were rich and numerous.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　眾事不可嫌，　　為世所尊敬；",
        "translation": "All things cannot be disliked; They are honored by the world.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　莫如今日身，　　自悔無所及。",
        "translation": "Don't repent for your own daily body now, which has no limit to what you can repent for.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　惡心為我怨，　　欺我致貧賤，",
        "translation": "A bad mind is my enemy, and deceiving me leads to poverty.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　心能自悔責，　　修善得快樂。",
        "translation": "The mind can repent for itself, cultivate goodness, and attain happiness.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　設造惡業時，　　眾善都不生，",
        "translation": "When they commit evil deeds, All good deeds do not arise.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　制心修善者，　　榮樂無不具。",
        "translation": "Those who restrain their minds and cultivate goodness Will be endowed with prosperity and happiness.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　世間語不虛，　　善惡報差別，",
        "translation": "Worldly talk is not false, Good and bad rewards are different.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　佛說八正道，　　能至於涅槃。",
        "translation": "The Buddha teaches the eightfold correct path, which leads to nirvāṇa.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　若心著財利，　　富貴及榮勝，",
        "translation": "If someone's mind is attached to possessions, wealth, prosperity, and prosperity,",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　求於後有者，　　不免衰老患，",
        "translation": "Those who seek later existence won’t be spared the danger of old age.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　我當勤精專，　　趣向無畏方。",
        "translation": "I should concentrate my efforts Toward the sphere of fearlessness.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　譬如醉畫師，　　畫作諸形像，",
        "translation": "It's like a drunken painter who paints forms and images,",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　醒已覺其惡，　　除滅作勝者。",
        "translation": "After waking, he perceives his evil and removes the one who becomes superior.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　先世愚癡故，　　造作今惡身，",
        "translation": "Because of the ignorance of a previous life, I created this bad body now.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　今當滅惡業，　　將來求勝報。",
        "translation": "I will now extinguish evil deeds And seek the supreme reward in the future.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "　見惡果報已，　　智者深自責。」",
        "translation": "After seeing the results of bad consequences, the wise man deeply rebukes himself.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "即說偈言：（三四）復次，若聞善說應當思惟，必得義利，是故智者常應聽受善妙之法。",
        "translation": "He then spoke a verse, saying, (3) Furthermore, if someone hears good teachings, they should contemplate them and surely attain their meaning; therefore, wise people should always listen to and accept the good and marvelous teachings.",
        "source": "T04n0201_006:0289b05_1"
    },
    {
        "source_sentence": "我昔曾聞，舍衛國中佛與阿難曠野中行，於一田畔見有伏藏。",
        "translation": "I've heard that the Buddha and Ānanda of Sāvatthī were traveling in the wilderness in Sāvatthī, and I saw a hidden treasury at the edge of a field.",
        "source": "T04n0201_006:0289c03_2"
    },
    {
        "source_sentence": "佛告阿難：「是大毒蛇。」",
        "translation": "The Buddha told Ānanda, This is a great viper.",
        "source": "T04n0201_006:0289c05_3"
    },
    {
        "source_sentence": "阿難白佛：「是惡毒蛇。」",
        "translation": "Ānanda said to the Buddha, This is a bad viper.",
        "source": "T04n0201_006:0289c05_4"
    },
    {
        "source_sentence": "爾時田中有一耕人，聞佛、阿難說有毒蛇，作是念言：「我當視之，沙門以何為惡毒蛇？」",
        "translation": "It was then that a farmer in the field heard the Buddha and Ānanda say there was a poisonous snake, and he had this thought, I will look at it; what is an ascetic's bad poisonous snake?",
        "source": "T04n0201_006:0289c06_5"
    },
    {
        "source_sentence": "即往其所見真金聚，而作是言：「沙門所言是毒蛇者，乃是好金。」",
        "translation": "He went to the place where he saw a lump of real gold and said, The ascetic says this is a poisonous snake, but it's good gold.",
        "source": "T04n0201_006:0289c08_6"
    },
    {
        "source_sentence": "即取此金，還置家中。",
        "translation": "He then took the gold and returned it to his house.",
        "source": "T04n0201_006:0289c09_7"
    },
    {
        "source_sentence": "其人先貧衣食不供，以得金故，轉得富饒衣食自恣。",
        "translation": "That person was previously poor and didn't provide food or clothing, but because he got gold, he became wealthy and gave up food and clothing for self-reliance.",
        "source": "T04n0201_006:0289c10_8"
    },
    {
        "source_sentence": "王家策伺怪其卒富，而糺舉之繫在獄中，先所得金既已用盡，猶不得免，",
        "translation": "The king's householders wondered at the sudden wealth of his fortune, and he was imprisoned in jail. Having spent all the gold he had previously obtained, he could not escape punishment.",
        "source": "T04n0201_006:0289c11_9"
    },
    {
        "source_sentence": "將加刑戮。",
        "translation": "He was about to be executed.",
        "source": "T04n0201_006:0289c13_10"
    },
    {
        "source_sentence": "其人唱言：「毒蛇。",
        "translation": "The man cried out, A poisonous snake!",
        "source": "T04n0201_006:0289c13_11"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T04n0201_006:0289c13_12"
    },
    {
        "source_sentence": "惡毒蛇。",
        "translation": "It's a bad viper.",
        "source": "T04n0201_006:0289c13_13"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T04n0201_006:0289c14_14"
    },
    {
        "source_sentence": "傍人聞之，以狀白王，王喚彼人而問之曰：「何故唱言：『毒蛇。",
        "translation": "When the attendants heard this, they reported it to the king in writing. The king summoned the man and asked him, Why do you say,'venomous snake!'",
        "source": "T04n0201_006:0289c14_15"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T04n0201_006:0289c15_16"
    },
    {
        "source_sentence": "惡毒蛇。",
        "translation": "It's a bad viper.",
        "source": "T04n0201_006:0289c15_17"
    },
    {
        "source_sentence": "世尊！』」",
        "translation": "Bhagavān!'",
        "source": "T04n0201_006:0289c15_18"
    },
    {
        "source_sentence": "其人白王：「我於往日在田耕種，聞佛、阿難說言毒蛇，是惡毒蛇。",
        "translation": "The man said to the king, “I used to plow and sow rice in my fields. I heard the Buddha and Ānanda tell me that poisonous snakes are evil poisonous snakes.",
        "source": "T04n0201_006:0289c16_19"
    },
    {
        "source_sentence": "我於今者，方乃悟解實是毒蛇。」",
        "translation": "Only now will I realize that it's really a viper.",
        "source": "T04n0201_006:0289c17_20"
    },
    {
        "source_sentence": "「諸佛語無二，　　說為大毒蛇，",
        "translation": "The words of the buddhas are nondual, Explaining them as great vipers.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　阿難白世尊，　　實是惡毒蛇。",
        "translation": "Ānanda said to the World-honored One, “This is really a vicious serpent.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　惡毒蛇勢力，　　我今始證知，",
        "translation": "The power of the vicious snake is so great that I can only now realize it.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　於佛世尊所，　　倍增信敬心，",
        "translation": "In the presence of the Buddha, the World-honored One, They increase their faith and reverence.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　我今臨危難，　　是故稱佛語。",
        "translation": "I am now facing danger and difficulty, Therefore I praise the Buddha’s words.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　毒蛇之所螫，　　正及於一身，",
        "translation": "Stung by a poisonous snake, it's precisely and all over his body.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　親戚及妻子，　　奴婢僮僕等，",
        "translation": "Their relatives, wives, slaves, servants, and so forth.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　一切悉無有，　　而受苦惱者；",
        "translation": "Nothing exists in all, Yet they experience suffering and distress.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　財寶毒蛇螫，　　盡及家眷屬。",
        "translation": "Their wealth and possessions are stung by a poisonous snake, and they're all their family members.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　我今於財寶，　　及與親戚等，",
        "translation": "Now, regarding my possessions, treasures, relatives, and so forth,",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　視如惡毒蛇，　　瞋恚發作時。",
        "translation": "They're like a bad viper when anger arises.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　智者宜速離，　　如捨惡毒蛇，",
        "translation": "A wise person should quickly leave, like abandoning a bad viper.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　應速求出家，　　行詣於山林。",
        "translation": "You should quickly seek renunciation and go to the mountain forest.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　誰有智慧者，　　見聞如此事。",
        "translation": "Whoever possesses wisdom Sees and hears such things.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　而當著財寶，　　封惑迷其心？",
        "translation": "Should they be attached to possessions and treasures, or should they be deluded by afflictions and confusions?",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　我謂得大利，　　而反獲衰惱。」",
        "translation": "I think I'll attain great rewards but instead become depressed.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "「汝今能信敬，　　悲愍之大仙，",
        "translation": "Can you now believe and revere the great sage Sadāparibhūta?",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　所說語真實，　　未曾有二言。",
        "translation": "The words spoken are true; Never has there been such a thing as two.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　先所伏藏財，　　盡以用還汝，",
        "translation": "I'll return all of the treasures I previously subdued to you with your money.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　更復以財寶，　　而以供養汝。",
        "translation": "I'll also offer you my possessions and treasures as an offering.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　能敬信調御，　　善逝實語故，",
        "translation": "They can be disciplined with reverence and faith, Because they are the true words of the Buddha.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　大梵之所信，　　拔梨阿修羅，",
        "translation": "The great Brahmā believes in the prātimokṣatriya asura",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　天王及帝釋，　　我等與諸王，",
        "translation": "The king of gods and Indra, we and the kings.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　城中諸豪族，　　婆羅門剎利，",
        "translation": "The city's powerful clansmen, Brāhmaṇas and kṣatriyas,",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　尊勝智見人，　　無不信敬者。",
        "translation": "Venerable wisdom sees people, and there's no one who doesn't believe and venerate them.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　能同我信故，　　現得於花報，",
        "translation": "Being able to share my faith, I'll attain the flower reward in the present.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "　今信最信處，　　應獲第一果。」",
        "translation": "Now, the most faithful place of faith should attain the first realization.",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "即說偈言：王聞偈已，深知是人於佛語中生信解心，即說偈言：（三五）復次，",
        "translation": "He then spoke these verses: Having heard these verses, the king knew deeply that this man’s mind of faith and understanding arose in the Buddha’s words. Then he spoke these verses:",
        "source": "T04n0201_006:0289c18_21"
    },
    {
        "source_sentence": "諸欲求利者，或得或不得，有真善心者不求自得利實，無真善心者為得貪利，",
        "translation": "Those who want to seek profit may get it or not, those with true good intentions don’t seek self-benefiting and real benefits, and those without true good intentions attain covetousness.",
        "source": "T04n0201_006:0290a19_22"
    },
    {
        "source_sentence": "故應作真善心。",
        "translation": "Therefore, they should make a truly good mind.",
        "source": "T04n0201_006:0290a21_23"
    },
    {
        "source_sentence": "我昔曾聞，有一國王，時輔相子其父早喪，其子幼稚未任紹繼，錢財已盡，",
        "translation": "Formerly I have heard that there was once a king whose son, the chancellor of state, had lost his father at an early age. The prince was too young to succeed to the throne and all his money and riches were exhausted.",
        "source": "T04n0201_006:0290a21_24"
    },
    {
        "source_sentence": "無人通致可得見王，窮苦自活。",
        "translation": "There was no one who could reach the palace to see the king and lived on his own in extreme distress.",
        "source": "T04n0201_006:0290a23_25"
    },
    {
        "source_sentence": "遂漸長大有輔相才，理民斷事一切善知，年向成立盛壯之時，形體姝大勇猛大力才藝備具，",
        "translation": "He gradually grew up to be endowed with the talent of assistant ministers, and when he was about to establish his vigorousness in the ages, his physical form was graceful and greatly brave. He was endowed with great talent and ability.",
        "source": "T04n0201_006:0290a23_26"
    },
    {
        "source_sentence": "作是思惟：「我今貧窮，當何所作？",
        "translation": "He thought, Now that I'm poor, what should I do?",
        "source": "T04n0201_006:0290a26_27"
    },
    {
        "source_sentence": "又復不能作諸賤業。",
        "translation": "Again, they can't perform lowly actions.",
        "source": "T04n0201_006:0290a26_28"
    },
    {
        "source_sentence": "「『業來變化我，　　窮困乃如是，",
        "translation": "'The karma comes to transform me, and so is the self in distress.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　父母之家業，　　今無施用處。",
        "translation": "Their parents' family business, there's no place for giving and using it now.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　下賤所作業，　　非我所宜作，",
        "translation": "What’s done by the inferior is not appropriate for me to do.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　若我無福業，　　應生下賤家。",
        "translation": "If I don't have meritorious actions, I should be born in a humble home.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　生處雖復貴，　　困苦乃如是，",
        "translation": "Although the place of birth is still valuable, So is distress and suffering like this.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　賤業極易知，　　然我所不能。",
        "translation": "It's extremely easy to know lowly actions, but I can't.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　當作私竊業，　　使人都不知，",
        "translation": "I'll do privately and secretly, so no one will know it.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　正有作賊業，　　覆隱人不覺。",
        "translation": "There are certainly thieves who commit crimes that cover and hide people without realizing them.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　腰繫二箭筒，　　并持鋼利劍，",
        "translation": "He wore two arrow barrels at his waist and carried a sharp sword of steel.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　縛[蹲-酋+(十\\/田\\/ㄙ)]手秉弓，　　種種自莊嚴，",
        "translation": "They are bound, squatting, holding the bow in their hands And variously adorned themselves.",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "　　喻如師子兒，　　都無有所畏。』」",
        "translation": "It's like a lion child who has no fear whatsoever.'",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "今我無福，所有才藝不得施行，復不生於下賤之家，又聞他說是偈言：說是偈已作是思惟：「設劫餘處或令他貧，",
        "translation": "Now that I have no merit, and all my talents are unable to perform them, nor will I be born in a humble family. Having heard others say these verses, he thought:",
        "source": "T04n0201_006:0290a27_29"
    },
    {
        "source_sentence": "我當劫王。」",
        "translation": "I will be the king of the eon.",
        "source": "T04n0201_006:0290b12_0"
    },
    {
        "source_sentence": "作是念已，至王宮中詣王臥處，王覺有賊怖不敢語，持王衣服并諸瓔珞取安一處。",
        "translation": "After he had this thought, he went to the king's palace and went to the king's bedside, but when the king realized that thieves were terrified and didn't dare to say anything, he took the king's clothing and jewelry and placed them in a place.",
        "source": "T04n0201_006:0290b12_1"
    },
    {
        "source_sentence": "時王頭邊有一器水，邊復有灰，飢渴所逼，謂灰是麨和水而飲，飲已飽滿，",
        "translation": "On the side of the king’s head was a pot of water, and on the edge was another pot of water. Overwhelmed by hunger and thirst, they said, “The clay is clarified and mixed with water to drink; after drinking it, you will be satisfied.” Then Sudhana remembered this:",
        "source": "T04n0201_006:0290b14_2"
    },
    {
        "source_sentence": "乃知是灰。",
        "translation": "They then knew it was ashes.",
        "source": "T04n0201_006:0290b16_3"
    },
    {
        "source_sentence": "即自思惟：「灰猶可食，況其餘物？",
        "translation": "He thought to himself, “The ashes are still edible, so why wouldn’t the rest be?",
        "source": "T04n0201_006:0290b16_4"
    },
    {
        "source_sentence": "我寧食草，何用作賊？",
        "translation": "I'd rather eat grass, so why would I need to become a thief?",
        "source": "T04n0201_006:0290b17_5"
    },
    {
        "source_sentence": "先父以來不為此業。」",
        "translation": "Ever since my father, I haven't done this action.",
        "source": "T04n0201_006:0290b17_6"
    },
    {
        "source_sentence": "即棄諸物還來歸家。",
        "translation": "He then abandoned all his possessions and returned home.",
        "source": "T04n0201_006:0290b18_7"
    },
    {
        "source_sentence": "王見空出，歎言善哉！",
        "translation": "Seeing emptiness coming out, the king praised it and said, Good!",
        "source": "T04n0201_006:0290b18_8"
    },
    {
        "source_sentence": "即喚其人而語之言：「汝今何故既取此物，還置於地而便空去？」",
        "translation": "He called the man and said to him, Why are you taking this thing now that you've put it back on the ground and leaving it empty?",
        "source": "T04n0201_006:0290b19_9"
    },
    {
        "source_sentence": "白言：「大王！",
        "translation": "He said, Great king!",
        "source": "T04n0201_006:0290b20_10"
    },
    {
        "source_sentence": "聽我所說。」",
        "translation": "Listen to what I teach.",
        "source": "T04n0201_006:0290b20_11"
    },
    {
        "source_sentence": "「何故作非理？　　以為飢渴故，",
        "translation": "“Why is it unreasonable?",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　灰水止飢渴，　　是故息賊心。",
        "translation": "The ashes and water stop hunger and thirst, so they calm the thief's mind.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　今知是飢渴，　　易可得止息，",
        "translation": "Knowing now that this is hunger and thirst, it’s easy to stop them.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　我飲灰水已，　　擲器著地中，",
        "translation": "After drinking ashes and water, I tossed the bowl into the ground.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　慚愧生悔恨，　　不復更造惡。",
        "translation": "With shame and embarrassment, he repents and doesn't again do evil.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　大王應當知，　　我非凡庶人，",
        "translation": "Great king, you should know that I am no ordinary commoner.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　乃是輔相子，　　由家窮困故，",
        "translation": "He was the son of the chancellor, Because his family was in distress.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　故來至王宮，　　造作非法事。",
        "translation": "That's why they came to the king's palace and created unlawful things.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　從今日已去，　　常欲飲灰水，",
        "translation": "From today onward, he always wanted to drink ashes and water.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　食草而自活，　　不為偷盜業。",
        "translation": "They eat grass for their livelihood and don't engage in stealing.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　我家昔先人，　　自有家禮教，",
        "translation": "The ancestors of my house in the past had their own family rituals and teachings.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "　寧當自滅身，　　不毀舊法訓。」",
        "translation": "I'd rather extinguish my own body than disparage the old teachings.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "即說偈言：王見此事歎未曾有，稱種姓子真實不虛，雖有愆過尋能改悔，",
        "translation": "The king marveled at this unprecedented occurrence. He praised the true nature of his clansmen’s names and not falsely claimed that even if there were deceptive errors, he would be able to remedy them through investigation.",
        "source": "T04n0201_006:0290b21_12"
    },
    {
        "source_sentence": "「貧窮壞志耐，　　并棄於慚愧，",
        "translation": "The poor and the wretched lose their resolve, And abandon shamefulness.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　凡下鄙惡人，　　速疾造惡業。",
        "translation": "Ordinary people, lowly and mean, quickly commit bad actions.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　以己家法鉤，　　能制非法象，",
        "translation": "With the hook of his own teaching, he's able to restrain an unlawful elephant.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　汝能自抑心，　　不違家教法，",
        "translation": "You can restrain your mind and not disobey the teachings of your house.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　能有是賢行，　　還襲汝父處。",
        "translation": "If someone can do this good deed, they'll return to your father's place.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　汝今除癡心，　　能作難有事，",
        "translation": "Now, you've gotten rid of the mind of delusion, which makes it difficult to do anything.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　我今極歡喜，　　用汝為輔相。",
        "translation": "I am now greatly delighted, Using you as my assistant.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　不須覆觀察，　　我已見汝行，",
        "translation": "Don’t overweeningly observe: I have already seen your actions.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　心堅志勇健，　　兼復有智能。",
        "translation": "Their minds are resolute, determined, courageous, and wise.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　我今自見知，　　斯事實難有，",
        "translation": "I now see and know for myself that this is really hard to find.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "　才業倍勝父，　　以心真善故。」",
        "translation": "His talent is twice as great as his father's, because his mind is truly good.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "即說偈言：是故智者，當作真實，不應虛偽。",
        "translation": "He then spoke a verse, saying, Therefore, the wise person should be real and not false.",
        "source": "T04n0201_006:0290c06_13"
    },
    {
        "source_sentence": "（三六）復次，現在結使雖復不起，若未斷結，結使之得猶故成就，如以冷水投熱湯中。",
        "translation": "36. Furthermore, even though the present bonds and tendencies don't arise again, if they haven't cut the bonds, the bonds and tendencies will still be accomplished because they've been attained, like throwing cold water into hot water.",
        "source": "T04n0201_006:0290c19_0"
    },
    {
        "source_sentence": "我昔曾聞，有一師共一弟子，於其冬日在煖室中，見有火聚無有烟焰。",
        "translation": "I once heard that one teacher and his disciples saw a cluster of flames in the warm room during the winter, but there was no smoke or flame.",
        "source": "T04n0201_006:0290c20_1"
    },
    {
        "source_sentence": "師語弟子：「汝見是火無烟焰不？」",
        "translation": "The teacher said to the disciple, Do you see that this fire has no smoke or flame?",
        "source": "T04n0201_006:0290c22_2"
    },
    {
        "source_sentence": "弟子言：「見。」",
        "translation": "The disciple said, See.",
        "source": "T04n0201_006:0290c23_3"
    },
    {
        "source_sentence": "師語弟子：「汝著乾薪烟即時起。」",
        "translation": "The teacher said to the disciple, Put dry wood and smoke right away.",
        "source": "T04n0201_006:0290c23_4"
    },
    {
        "source_sentence": "復言：「口吹，火焰乃出。」",
        "translation": "Again, he said, A flame of fire comes out when it's blown by mouth.",
        "source": "T04n0201_006:0290c24_5"
    },
    {
        "source_sentence": "「先火無烟焰，　　慈心不淨觀，",
        "translation": "Before the fire, there’s no smoke or flame; With a compassionate mind and an impure contemplation,",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　現在結不生，　　如火無烟焰。",
        "translation": "The present fetters don't arise, just like fire without smoke or flame.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　如火得乾薪，　　烟焰俱時起，",
        "translation": "Just as fire obtains dry firewood, smoke and flames arise at the same time.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　心火遇因緣，　　值惡知識時，",
        "translation": "When the fire of mind meets causes and conditions, it meets bad friends.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　瞋恚烟便起，　　若覩好色時，",
        "translation": "The smoke of anger then rises, and when it's crude and nice form,",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　貪欲火熾然。　　是故應斷得，",
        "translation": "Because the fire of desire is blazing, one should cut off possessions.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　成就具三明，　　為斷貪瞋癡，",
        "translation": "Accomplished, they are endowed with the three knowledges In order to cut off craving, hatred, and delusion.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　應勤修精進。　　明行足斷心，",
        "translation": "They should exert themselves energetically and diligently in the cultivation of effort.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　結使草不生，　　喻如常行道，",
        "translation": "Conditioned so that the grass won't grow, it's a metaphor for always practicing the path.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　眾卉皆不出。　　貪欲及瞋恚，",
        "translation": "None of the other plants came out, and all kinds of craving and anger grew in them.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　未遇緣不起，　　根本未斷故，",
        "translation": "They do not arise without encountering the supporting object, because their roots have not been cut off.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　遇緣還復發。　　喻如得瘧病，",
        "translation": "It is like the case of a person suffering from malaria, whose condition causes it to reappear.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　四日定發現，　　於三二日時，",
        "translation": "On the fourth day, it's definitely discovered. On the third and second days,",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　遇緣還復發。　　又似世俗定，",
        "translation": "It is similar to the worldly absorption, which arises again and again in response to conditions.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　掩按結不起，　　都無有患相。",
        "translation": "They hide the bonds of attachment and don't arise, and they all have no troubled characteristics.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　欲如毒樹根，　　不拔芽還生，",
        "translation": "Desire is like the root of a poisonous tree, which doesn’t remove its sprouts and grows back.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　如人耻白髮，　　并剃其黑者，",
        "translation": "It's like a person who shames the white and shaves their black.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　剃之未久間，　　白髮尋還生。",
        "translation": "Soon after shaving it, the white hair reappeared.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　不永斷結使，　　其事亦如是，",
        "translation": "So it is with those who do not permanently eliminate the bonds and tendencies, The same thing.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　欲結及瞋恚，　　逼戒行機關，",
        "translation": "The fetter of desire and anger, the fetter of resentment, the fetter of suppressing precepts and practices,",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　對治隱不起。　　不造身口業，",
        "translation": "The antidote does not arise in seclusion; bodily or vocal action is not done.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　便生難有想，　　結使後還起，",
        "translation": "They then give rise to perceptions of difficulty, bonds and tendencies that arise later.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　毀犯於戒行。　　貪嗜著五欲，",
        "translation": "They violate the precepts, indulge in attachment to the five desires, and commit sexual misconduct.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "　如蛇隱入穴，　　還出則螫人。」",
        "translation": "It's like a snake that goes into a cave in hiding and then comes back out and stings people.",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "師為弟子，而說偈言：（三七）復次，施為解脫不為財物，若為財物不名為施，",
        "translation": "The Master spoke these verses for the sake of his disciples:",
        "source": "T04n0201_006:0290c25_0"
    },
    {
        "source_sentence": "若為解脫則得無生及涅槃樂，是故智者應為解脫而行布施。",
        "translation": "If it's for liberation, then they'll attain the bliss of nonproduction and nirvāṇa; therefore, wise people should practice generosity for liberation.",
        "source": "T04n0201_006:0291a22_1"
    },
    {
        "source_sentence": "我昔曾聞，有一檀越詣僧房設會，檀越知識道人語上座言：「今日檀越飲食精細，",
        "translation": "I once heard that a donor had gone to the monastery to set up an assembly. The donor’s friends and companions in the Way said to the superior monk, “Today you, as a donor, have provided me with delicious food and drink.",
        "source": "T04n0201_006:0291a23_2"
    },
    {
        "source_sentence": "好為檀越耐心說法。」",
        "translation": "They're fond of teaching the Dharma patiently for donors.",
        "source": "T04n0201_006:0291a25_3"
    },
    {
        "source_sentence": "是時上座已得三明六通具八解脫，善知他心深觀察之，為何事故而設此會，",
        "translation": "The venerable monk then had attained the three knowledges, the six supernatural powers, and the eight liberations. He knew well the minds of others and observed them deeply. For what reason did he set up this assembly?",
        "source": "T04n0201_006:0291a26_4"
    },
    {
        "source_sentence": "乃知此會為財利故。",
        "translation": "They then knew that this assembly was for wealth and profit.",
        "source": "T04n0201_006:0291a28_5"
    },
    {
        "source_sentence": "爾時上座為此檀越說三惡道苦，而作是言：「善哉善哉！",
        "translation": "It was then that the superior monk explained the suffering of the three bad destinies for this donor and said, Good, good!",
        "source": "T04n0201_006:0291a28_6"
    },
    {
        "source_sentence": "檀越汝今所設供養，極是時施，色香美味皆悉具足，極為清淨，三惡道中無所乏少。」",
        "translation": "What you've offered as an offering now, donor, is given at the right time, fully endowed with form, odor, taste, and deliciousness, which are so pure that there's nothing lacking in the three bad destinies.",
        "source": "T04n0201_006:0291a29_7"
    },
    {
        "source_sentence": "時知識道人語上座言：「何以為他呪願三惡道中都無所乏？」",
        "translation": "The knower of the Way then said to the superior monk, Why do you think there's nothing lacking in the three bad destinies of other spells and vows?",
        "source": "T04n0201_006:0291b02_8"
    },
    {
        "source_sentence": "時僧上座語彼道人子：「我雖年老倒錯說法，然此檀越不習於戒，結使所使，",
        "translation": "The abbot of the saṃgha then said to the monk, Although I am old and wrongly expounding the Dharma, this donor has not practiced the precepts.",
        "source": "T04n0201_006:0291b04_9"
    },
    {
        "source_sentence": "我觀彼心故作是說，此檀越為五欲樂及財寶畜生。」",
        "translation": "I observe their mind and therefore say, 'This donor is an animal of the five desires, pleasures, and possessions.'",
        "source": "T04n0201_006:0291b06_0"
    },
    {
        "source_sentence": "「施者所生處，　　財寶極廣大，",
        "translation": "The place where the donor is born Is extremely vast in wealth and treasure.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　以恃財寶故，　　能令起憍慢。",
        "translation": "Because of relying on wealth and treasure, they can cause arrogance to arise.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　憍慢越法度，　　盲冥愚凡夫，",
        "translation": "Arrogant and conceited, they transgress the path of enlightenment, blind and deluded worldlings.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　以越法度故，　　則墮三惡趣。",
        "translation": "Because of transgressing beyond the dharmas, they'll fall into the three bad destinies.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　處於三惡道，　　猶如己舍宅，",
        "translation": "They're in the three bad destinies, just like their own house.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　若生人天中，　　如似暫寄客。",
        "translation": "If someone is born among humans and gods, it's like being temporarily sent to a guest.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　是故戒施伴，　　俱受於涅槃，",
        "translation": "Therefore, the companions of morality and giving are both subject to nirvana.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　戒能得生天，　　施能備眾具，",
        "translation": "The precepts can attain birth in heaven, and giving can prepare all the necessities.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　所作為解脫，　　必盡於苦際。",
        "translation": "The liberation that one undertakes Is bound to end at the limit of suffering.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　譬如種藕根，　　花葉悉具得，",
        "translation": "It's like planting roots of lotus roots, All accompanied by flowers and leaves.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　其根亦可食。　　修行於施戒，",
        "translation": "Their faculties are also able to eat.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　親近解脫林，　　快樂喻花葉，",
        "translation": "Being close to the forest of liberation, bliss is like a flower leaf.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　根喻於解脫。　　是故修戒施，",
        "translation": "Because the faculties are a metaphor for deliverance, one cultivates morality and giving.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "　必當為解脫，　　不應為世利。」",
        "translation": "It must be for liberation and not for worldly benefits.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "即說偈言：（三八）復次，離諸難亦難，得於人身難，既得離諸難，應當常精勤。",
        "translation": "He then spoke a verse, saying, (3 (8) Furthermore, it's difficult to be free of difficulties, and it's difficult to attain the human body. Once you're free of difficulties, you should always exert effort.",
        "source": "T04n0201_006:0291b07_1"
    },
    {
        "source_sentence": "我昔曾聞，有一小兒聞經中說：「盲龜值浮木孔，其事甚難。」",
        "translation": "In the past, I once heard a little boy hear a sūtra saying, A blind tortoise meets a hole in floating wood, which is very difficult.",
        "source": "T04n0201_006:0291b23_2"
    },
    {
        "source_sentence": "時此小兒故穿一板作孔受頭，擲著池中，自入池中低頭舉頭欲望入孔，",
        "translation": "The boy then used a board to make a hole for his head and tossed it into the pond. Entering the hole by himself, he lowered his head and wanted to go through the hole.",
        "source": "T04n0201_006:0291b24_3"
    },
    {
        "source_sentence": "水漂板故不可得值。",
        "translation": "Because the water floated on the board, they couldn't meet it.",
        "source": "T04n0201_006:0291b26_4"
    },
    {
        "source_sentence": "即自思惟：「極生厭惡，人身難得，佛以大海為喻，浮木孔小盲龜無眼，",
        "translation": "He thought to himself: I am extremely disgusted with the fact that it is difficult to find a human body. The Buddha uses the great ocean as an analogy, saying: “There are holes in floating trees and small blind tortoises without eyes.",
        "source": "T04n0201_006:0291b27_5"
    },
    {
        "source_sentence": "百年一出實難可值。",
        "translation": "Every hundred years, it's really difficult to meet.",
        "source": "T04n0201_006:0291b28_6"
    },
    {
        "source_sentence": "我今池小其板孔大，復有兩眼日百出頭，猶不能值，況彼盲龜而當得值？」",
        "translation": "Now that I'm small in the pond and its board is large, and there are two eyes with a hundred hairs growing out of my head each day, so why wouldn't I be able to meet them, much less those blind tortoises?",
        "source": "T04n0201_006:0291b29_7"
    },
    {
        "source_sentence": "「巨海極廣大，　　浮木孔復小，",
        "translation": "The great ocean is extremely vast, and the hovering holes are even smaller.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　百年而一出，　　得值甚為難。",
        "translation": "It's very difficult to meet someone who comes out once in a hundred years.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　我今池水小，　　浮木孔極大，",
        "translation": "Now the water of my pond is small, but the holes in the floating mounds are very large.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　數數自出頭，　　不能值木孔。",
        "translation": "He repeatedly emerges from his head, but he can't find a hole in the wood.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　盲龜遇浮木，　　相值甚為難，",
        "translation": "A blind tortoise meets a floating tree, and it's very difficult to meet each other.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　惡道復人身，　　難值亦如是。",
        "translation": "A bad destiny returns to a human body, which is hard to find, and so it is likewise.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　我今值人身，　　應當不放逸，",
        "translation": "Now that I've found a human body, I shouldn't be careless.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　恒沙等諸佛，　　未曾得值遇。",
        "translation": "The buddhas as numerous as the grains of sand in the Ganges River Have never been encountered.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　今日得諮受，　　十力世尊言，",
        "translation": "Today, I'll be able to consult and accept the words of the Bhagavān Ten-Powered One.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　佛所說妙法，　　我必當修行。",
        "translation": "The sublime teaching taught by the Buddha I will practice.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　若能善修習，　　濟拔極為大，",
        "translation": "If someone can skillfully cultivate it, their salvation will be supremely great.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　非他作己得，　　是故自精勤。",
        "translation": "They do not make their own attainments for others; Therefore, they exert themselves.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　若墮八難處，　　云何可得離？",
        "translation": "If someone falls into the eight difficult places, how can they be freed?",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　世間業隨逐，　　墜墮於惡道。",
        "translation": "Worldly karma follows them, and they'll fall into a bad path.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　我今當逃避，　　得出三有獄，",
        "translation": "I will now flee and leave the hells of the world.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　若不出此獄，　　云何得解脫？",
        "translation": "If someone doesn't leave this hell, how will they attain liberation?",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　畜生道若干，　　歷劫極長久，",
        "translation": "The realms of animals and humans last for a great many kalpas.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　地獄及餓鬼，　　黑闇苦惱深。",
        "translation": "The hells and hungry ghosts are deep in darkness and suffering.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　我若不勤修，　　云何而得離，",
        "translation": "If I don’t diligently cultivate it, How can I be freed?",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　嶮難諸惡道？　　今日得人身，",
        "translation": "Today I am reborn as a human being in the troubled states of woe.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　不盡苦邊際，　　不離三有獄，",
        "translation": "They do not reach the limit of suffering, Do not leave the hells of all beings.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　應當勤方便，　　必離三有獄。",
        "translation": "You should diligently and skillfully escape the three hells of existence.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "　我今求出家，　　必使得解脫。」",
        "translation": "Now that I'm seeking to leave home, I'll surely be liberated.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "即說偈言：（三九）復次，財錢難捨，智者若能修於小施莫起輕想。",
        "translation": "He then spoke a verse, saying, (3 29.) Furthermore, it's difficult to abandon possessions and money, but if a wise person can cultivate small generosity, don't give lightly.",
        "source": "T04n0201_006:0291c02_8"
    },
    {
        "source_sentence": "我昔曾聞，須和多國昔日有王名薩多浮，時王遊獵偶值一塔，即以五錢布施彼塔。",
        "translation": "I've heard that there was once a king named Sadābhū in the country of Sāvatthī, and when the king traveled hunting, he happened to find a stūpa and gave five coins to it.",
        "source": "T04n0201_006:0291c27_9"
    },
    {
        "source_sentence": "有一旃陀羅遙唱善哉！",
        "translation": "How could there be a caṇḍāla who sings good from afar!",
        "source": "T04n0201_006:0291c29_10"
    },
    {
        "source_sentence": "即遣使捉將至王所。",
        "translation": "He then sent an envoy to capture him and took him to the king's place.",
        "source": "T04n0201_006:0291c29_11"
    },
    {
        "source_sentence": "時王語言：「汝今見我布施小故譏笑我耶？」",
        "translation": "The king then said, Do you see me now because my generosity is small and therefore ridicules me?",
        "source": "T04n0201_006:0292a01_12"
    },
    {
        "source_sentence": "彼人白王：「施我無畏然後當語。",
        "translation": "The man said to the king, Give me fearlessness and I'll tell you later.",
        "source": "T04n0201_006:0292a02_13"
    },
    {
        "source_sentence": "我於昔日於嶮道中劫掠作賊，捉得一人急拳其手。",
        "translation": "In the past, I robbed and plundered a thief on a precipitous path in a dangerous place.",
        "source": "T04n0201_006:0292a03_14"
    },
    {
        "source_sentence": "我即思惟：『此人拳手必有金錢。』",
        "translation": "I then thought, 'This man's fist must have money.'",
        "source": "T04n0201_006:0292a04_15"
    },
    {
        "source_sentence": "語令開手其人不肯，我捉弓箭用恐彼人，語言放手猶故不肯。",
        "translation": "He told me to tell him to open his hand, but he wouldn't allow it, and I caught a bow and arrow in my hand to frighten that man.",
        "source": "T04n0201_006:0292a05_16"
    },
    {
        "source_sentence": "我即挽弓向之，以貪寶故即便射殺，殺已即取得一銅錢。",
        "translation": "I then drew my bow and pointed it at him, killing him out of greed for the treasure. Having killed him, I obtained a copper coin.",
        "source": "T04n0201_006:0292a06_17"
    },
    {
        "source_sentence": "寧惜一錢不惜身命。",
        "translation": "I'd rather cherish a penny than my life.",
        "source": "T04n0201_006:0292a08_0"
    },
    {
        "source_sentence": "如今大王無逼惱者，能持五錢用施佛塔，是故我今歎言善哉！」",
        "translation": "Now, the great king has no oppressor who can carry five coins to give them to a stūpa for the Buddha's sake; therefore, I now praise it and say, Good!",
        "source": "T04n0201_006:0292a08_1"
    },
    {
        "source_sentence": "「挽弓圓如輪，　　將欲害彼命，",
        "translation": "To draw a bow as round as a wheel, wanting to harm their life,",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　彼寧喪身命，　　不肯輸一錢。",
        "translation": "They'd rather lose their body and life than give up a penny.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　我見如此人，　　捨命不捨錢，",
        "translation": "I see such a person who gives up his life and doesn’t give up money.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　是故我今者，　　見有捨錢者，",
        "translation": "Therefore, I now see that there are those who give up money.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　生於希有想，　　歎言難可作。",
        "translation": "They give rise to rare thoughts and praise the difficulty of saying it's difficult to do.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　不見有弓刀，　　強逼大王者，",
        "translation": "They don’t see anyone with a bow and sword Who forcibly attacks the great king.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　亦無有畏忌，　　開意捨難捨，",
        "translation": "They also have no fears or misgivings, Enlighten their minds and abandon what is difficult to abandon.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　苦求乃得錢。　　是故我今日，",
        "translation": "I beg for money, and therefore today I am able to give it.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　見有捨財者，　　心生未曾有。",
        "translation": "Seeing someone who abandons possessions, the mind arises like never before.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　我自見其證，　　極苦不肯捨，",
        "translation": "I see for myself their realization and refuse to relinquish extreme suffering.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "　大王今當知，　　慳心難可捨。」",
        "translation": "Now, you should know that it's difficult for the great king to abandon his stinginess.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "即說偈言：（四〇）復次，善觀察所作，當時雖有過，後必有大益。",
        "translation": "He then spoke a verse, saying, 40. Furthermore, he well observes what he does, even though there are faults at the time, and it will surely bring great benefit in the future.",
        "source": "T04n0201_006:0292a10_0"
    },
    {
        "source_sentence": "我昔曾聞，有一比丘常被盜賊，一日之中堅閉門戶，賊復來至扣門而喚，",
        "translation": "I once heard that a certain monk was constantly attacked by thieves and robbers. In the course of one day, he locked his doors tightly and when the thief came again, he closed the doors and called out to them.",
        "source": "T04n0201_006:0292a23_1"
    },
    {
        "source_sentence": "比丘答言：「我見汝時極大驚怖，汝可內手於彼向中，當與汝物。」",
        "translation": "The monk answered, When I saw you, I was terrified and frightened, so you can put your palms inside it and give it to me.",
        "source": "T04n0201_006:0292a24_2"
    },
    {
        "source_sentence": "賊即內手置於向中，比丘以繩繫之於柱，比丘執杖開門打之，打一下已語言：「歸依佛。」",
        "translation": "The thief put his inside hand in the direction, and the monk tied it to the pillar with a rope, took his staff, opened the door, beat him, and said, I take refuge in the Buddha.",
        "source": "T04n0201_006:0292a26_3"
    },
    {
        "source_sentence": "賊以畏故，即便隨語歸依於佛。",
        "translation": "Because of their fear, the thieves followed the Buddha's words and relied on him.",
        "source": "T04n0201_006:0292a28_4"
    },
    {
        "source_sentence": "復打二下語言：「歸依法。」",
        "translation": "Again, he beats two down and says, I take refuge in the Dharma.",
        "source": "T04n0201_006:0292a29_5"
    },
    {
        "source_sentence": "賊畏死故復言歸依法。",
        "translation": "Because the thief was afraid of dying, he said again, I take refuge in the Dharma.",
        "source": "T04n0201_006:0292a29_6"
    },
    {
        "source_sentence": "第三打時復語之言：「歸依僧。」",
        "translation": "When the third strike is made, he again says to the saṃgha, I take refuge in the saṃgha.",
        "source": "T04n0201_006:0292b01_7"
    },
    {
        "source_sentence": "賊時畏故言歸依僧。",
        "translation": "Because the thief was frightened at the time, he said he relied on the saṃgha.",
        "source": "T04n0201_006:0292b01_8"
    },
    {
        "source_sentence": "即自思惟：「今此道人有幾歸依？",
        "translation": "He thought to himself, Now, how many refuges does this man of the Way have?",
        "source": "T04n0201_006:0292b02_9"
    },
    {
        "source_sentence": "若多有者必更不見此閻浮提，必當命終。」",
        "translation": "If there are many, they won't see this Jambudvīpa again, and their lives will surely end.",
        "source": "T04n0201_006:0292b03_10"
    },
    {
        "source_sentence": "爾時比丘即放令去，以被打故身體疼痛久而得起，即求出家。",
        "translation": "At that point, the monk was released and ordered to leave, and his body ached for a long time because he had been beaten, so he asked to leave home.",
        "source": "T04n0201_006:0292b04_11"
    },
    {
        "source_sentence": "有人問言：「汝先作賊造諸惡行，以何事故出家修道？」",
        "translation": "Someone asked, Did you previously commit bad actions as a thief, and why did you leave home and cultivate?",
        "source": "T04n0201_006:0292b05_12"
    },
    {
        "source_sentence": "答彼人言：「我亦觀察佛法之利然後出家。",
        "translation": "He replied, I'll also observe the benefits of the Buddha's teaching and then leave home.",
        "source": "T04n0201_006:0292b06_13"
    },
    {
        "source_sentence": "我於今日遇善知識，以杖打我三下，唯有少許命在不絕。",
        "translation": "Today, when I met a good friend, he struck me three times with his staff and my life didn't end even for a little while.",
        "source": "T04n0201_006:0292b07_14"
    },
    {
        "source_sentence": "如來世尊實一切智者，若教弟子四歸依者，我命即絕。",
        "translation": "If the Bhagavān, the Tathāgata, were to teach my disciples the four refuges, my life would end.",
        "source": "T04n0201_006:0292b09_15"
    },
    {
        "source_sentence": "佛或遠見斯事教出比丘打賊三下，使我不死，是故世尊唯說三歸不說四歸，",
        "translation": "If the Buddha were to see these things from a distance, he would have instructed the bhikṣus to beat the thief three times so that I would not die. Therefore, the World-Honored One has explained only three refuges and not four.",
        "source": "T04n0201_006:0292b10_16"
    },
    {
        "source_sentence": "佛愍我故說三歸依不說四歸。」",
        "translation": "Because the Buddha pities me, he explains the three refuges and doesn't explain the four refuges.",
        "source": "T04n0201_006:0292b12_17"
    },
    {
        "source_sentence": "「決定一切智，　　以憐愍我故，",
        "translation": "Determined by omniscience, because of pity for self,",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　是以說三歸，　　不說有第四。",
        "translation": "That is why the three refuges are spoken of. The fourth is not spoken of.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　為於三有故，　　而說三歸依，",
        "translation": "For the sake of the three existences, He teaches the three refuges.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　若當第四者，　　我則無歸依。",
        "translation": "If it were the fourth, I would have no refuge.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　我今可憐愍，　　身命於彼盡，",
        "translation": "I must now have pity that my body and life are exhausted there.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　我見佛世尊，　　遠覩如斯事，",
        "translation": "I've seen the Bhagavān, the Buddha, who far distances himself from such things.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　生於未曾有，　　是故捨賊心。",
        "translation": "They give rise to something unprecedented, so they abandon the thief's mind.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　有因麤事解，　　或因細事悟，",
        "translation": "Some are enlightened by reason of debilitating things; Some are enlightened by reason of subtle things.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　麤者悟麤事，　　細者解細事。",
        "translation": "What's crude is the understanding of crude things, and what's subtle is the understanding of subtle things.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　由我心麤故，　　因麤事解悟，",
        "translation": "Because of self and mind being gross, they are enlightened by deceitful things.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "　我解斯事故，　　是以求出家。」",
        "translation": "I understand this matter, so I'll ask to leave home.",
        "source": "T04n0201_006:0292b13_18"
    },
    {
        "source_sentence": "即說偈言：大莊嚴論經卷第六",
        "translation": "Then he uttered the following verse:",
        "source": "T04n0201_006:0292b13_18"
    }
]