[
    {
        "source_sentence": "賢愚經卷第十三",
        "translation": "Sutra of Good and Evil, Volume 13",
        "source": "T04n0202_013:0437b25_0"
    },
    {
        "source_sentence": "元魏涼州沙門慧覺等在高昌郡譯",
        "translation": "Yuan Wei Liangzhou shaman Huijue and others translated it at Gaochang Commandery",
        "source": "T04n0202_013:0437b27_0"
    },
    {
        "source_sentence": "（六〇）五百鴈聞佛法生天品第五十三(丹本為六十)",
        "translation": "(60) The Fifty-third Chapter of the Five Hundred Who Were to Hear the Buddha's Teachings and Be born in Heaven (The Dan edition is 60)",
        "source": "T04n0202_013:0437b28_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在波羅[木*奈]國。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Benares.",
        "source": "T04n0202_013:0437b29_0"
    },
    {
        "source_sentence": "爾時世尊，於林澤中，為天人四輩之類，演說妙法。",
        "translation": "At the time, the Bhagavān was teaching the wonderful Dharma in a forest and swamp for the four groups of gods and humans.",
        "source": "T04n0202_013:0437b29_1"
    },
    {
        "source_sentence": "時虛空中，有五百群鴈，聞佛音聲，深心愛樂，盤桓迴翔，尋欲來下至世尊所。",
        "translation": "In the sky, there were five hundred groups of people who heard the sound of the Buddha's voice and became deeply attached to it. They flew back and forth in midair, wanting to come down and go to where the Bhagavān was.",
        "source": "T04n0202_013:0437c01_2"
    },
    {
        "source_sentence": "時有獵師，張施羅網，五百群鴈，墮彼網中，為獵師所殺；",
        "translation": "At that time a hunter opened a net of silkworms and five hundred animals fell into the net and were killed by the hunter.",
        "source": "T04n0202_013:0437c03_3"
    },
    {
        "source_sentence": "生忉利天，父母膝上，忽然生長，如八歲兒，身體端嚴，顏貌無比，光相明淨，",
        "translation": "He was born in Trāyastriṃśa goddess, his parents’ knees touching him. Suddenly he grew up to the size of an eighth-year-old child. His body was handsome and incomparable in appearance, shining as if he were a human being.",
        "source": "T04n0202_013:0437c05_4"
    },
    {
        "source_sentence": "喻若金山。",
        "translation": "It's a metaphor like the gold mountain.",
        "source": "T04n0202_013:0437c06_5"
    },
    {
        "source_sentence": "便自念言：「我以何因，生此天中？」",
        "translation": "He then thought to himself, What is the reason I'm born in this heaven?",
        "source": "T04n0202_013:0437c07_6"
    },
    {
        "source_sentence": "天人心聰神解，即識宿命，緣愛法聲，果報生天，當報其恩。",
        "translation": "The minds of gods and humans are wise and spiritually liberated, which means they know their past lives, listen to the sounds of the Dharma with affection, and are born in heaven as a reward for their kindness.",
        "source": "T04n0202_013:0437c07_7"
    },
    {
        "source_sentence": "即共同時，持天花香，下閻浮提波羅捺國，至世尊所，天光明曜，猶寶樹林，",
        "translation": "Together, they carried the heavenly flower incense and descended from the kingdom of Jambudvfpa to the place where the World-honored One was. The divine light shone brightly like a jeweled forest.",
        "source": "T04n0202_013:0437c09_8"
    },
    {
        "source_sentence": "一時曲身，禮世尊足，合掌白言：「我蒙世尊說法音聲，生在妙處，願重矜愍，",
        "translation": "At once he bent his body, bowed at the feet of the World-honored One, joined his palms in respect, and said: O World-honored One, I am born in a wonderful place to hear the voice of the Dharma preached by you.",
        "source": "T04n0202_013:0437c11_0"
    },
    {
        "source_sentence": "開示道要。」",
        "translation": "He reveals the essentials of the path.",
        "source": "T04n0202_013:0437c12_1"
    },
    {
        "source_sentence": "爾時世尊，便為演說四諦妙法，天人開悟，得須陀洹果，即還天上，不墮三塗，",
        "translation": "At that time the World-honored One expounded to them the wonderful Dharma of the four truths. Enlightened by gods and humans, they attained the state of stream-enterer and returned to heaven without falling into any of the three evil destinies.",
        "source": "T04n0202_013:0437c13_0"
    },
    {
        "source_sentence": "隨緣七生，得盡諸漏。",
        "translation": "Depending on the conditions of seven births, they'll attain the end of the contaminants.",
        "source": "T04n0202_013:0437c14_1"
    },
    {
        "source_sentence": "爾時阿難，白世尊言：「昨夜有天光明照曜，禮敬世尊。",
        "translation": "It was then that Ānanda said to the Bhagavān, Yesterday night, there was a divine light shining brightly and paying homage to the Bhagavān.",
        "source": "T04n0202_013:0437c15_2"
    },
    {
        "source_sentence": "不知其緣？",
        "translation": "Do you not know the reason for this?",
        "source": "T04n0202_013:0437c16_3"
    },
    {
        "source_sentence": "願見告示。」",
        "translation": "May I see it and tell you about it?",
        "source": "T04n0202_013:0437c16_4"
    },
    {
        "source_sentence": "佛告阿難：「善思念之！",
        "translation": "The Buddha told Ānanda, Consider it well!",
        "source": "T04n0202_013:0437c17_5"
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T04n0202_013:0437c17_6"
    },
    {
        "source_sentence": "世尊昨日在林澤中，為天世人四輩之眾，敷演妙法。",
        "translation": "Yesterday, the Bhagavān was in a forest and swamp, expounding the wonderful Dharma to the four groups of gods and humans.",
        "source": "T04n0202_013:0437c17_7"
    },
    {
        "source_sentence": "有五百群鴈，愛敬法聲，心悅欣慶，即共飛來，欲至我所，墮獵師網中。",
        "translation": "Five hundred herds of birds came flying together, delighted with respect for the sound of the Dharma and rejoicing in joy. Wishing to come to me, they fell into the hunter’s net.",
        "source": "T04n0202_013:0437c19_8"
    },
    {
        "source_sentence": "於時獵師，即取殺之。",
        "translation": "The hunter then took it and killed him.",
        "source": "T04n0202_013:0437c20_9"
    },
    {
        "source_sentence": "因此善心，生忉利天，自識宿命，故來報恩。」",
        "translation": "Because of this good intention, they're born in the Trāyastriṃśa gods and know their past lives for themselves, so they come to repay their kindness.",
        "source": "T04n0202_013:0437c21_10"
    },
    {
        "source_sentence": "爾時阿難，聞佛所說，歡喜踊躍，歎未曾有，而作是言：「如來出世，",
        "translation": "At that time, having heard the Buddha’s discourse, Ānanda was delighted and jumped for joy. He praised this unprecedented experience and said:",
        "source": "T04n0202_013:0437c22_11"
    },
    {
        "source_sentence": "實為奇妙！",
        "translation": "That's really marvelous!",
        "source": "T04n0202_013:0437c23_12"
    },
    {
        "source_sentence": "陶演法雨，莫不蒙潤，乃至禽鳥，猶聞法聲，獲福乃爾，豈況於人信心受持，",
        "translation": "The potter preached the Dharma rain, and none of them were not moistened by it. All the birds and beasts heard the sound of the Dharma to attain blessedness, much less those who believed in Buddhism received and practiced it.",
        "source": "T04n0202_013:0437c24_0"
    },
    {
        "source_sentence": "計其果報，過踰於彼，百千萬倍，不可為比。」",
        "translation": "The result of this calculation is a hundred million times greater than that, and it can't be compared.",
        "source": "T04n0202_013:0437c25_1"
    },
    {
        "source_sentence": "佛告阿難：「善哉善哉！",
        "translation": "The Buddha told Ānanda, Good, good!",
        "source": "T04n0202_013:0437c26_2"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T04n0202_013:0437c27_3"
    },
    {
        "source_sentence": "如來出世，多所潤益，普雨甘露，浸潤群生，以是之故，當共一心信敬佛法。」",
        "translation": "When the Tathāgata appears in the world, he's often nourished and enriched, raining sweet dew that nourishes all sentient beings; because of this, they will all singlemindedly believe and venerate the Buddha's teaching.",
        "source": "T04n0202_013:0437c27_4"
    },
    {
        "source_sentence": "爾時阿難，及諸眾會，聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, Ānanda and the other members of the sangha were delighted and remembered it well.",
        "source": "T04n0202_013:0437c29_5"
    },
    {
        "source_sentence": "（六一）堅誓師子品第五十四(丹本為六十一)",
        "translation": "(61) The Fifty-fifty-fourth Chapter of the Firmly Vowing Lion (The Dan edition is sixty-one)",
        "source": "T04n0202_013:0438a02_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在王舍城耆闍崛山中。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Mount Gṛdhrakūṭa in Rājagṛha.",
        "source": "T04n0202_013:0438a03_0"
    },
    {
        "source_sentence": "爾時提婆達多，恒懷惡心，向於世尊，欲害如來，自稱為佛；",
        "translation": "At that time Devadatta always harbored evil thoughts and faced the World-honored One. Wishing to harm the Buddha, he called himself a buddha.",
        "source": "T04n0202_013:0438a03_1"
    },
    {
        "source_sentence": "教阿闍世，害父為王。",
        "translation": "He taught the Ajātaśatru to harm his father as king.",
        "source": "T04n0202_013:0438a05_2"
    },
    {
        "source_sentence": "「新佛新王，治理天下，不亦快乎？」",
        "translation": "Wouldn't it be pleasant for a new Buddha or king to govern the world?",
        "source": "T04n0202_013:0438a05_3"
    },
    {
        "source_sentence": "王子信用，便殺其父，自立為王。",
        "translation": "The prince trusted him, killed his father, and made himself king.",
        "source": "T04n0202_013:0438a06_4"
    },
    {
        "source_sentence": "是時世人，咸懷惡心，於諸比丘，惡不欲見。",
        "translation": "The people of the world then all harbored bad thoughts, and they didn't want to see evil in the monks.",
        "source": "T04n0202_013:0438a07_5"
    },
    {
        "source_sentence": "時諸比丘，入城乞食，人民忿恚，咸不與語，空鉢而出，還到山中，白世尊言：「提婆達多，",
        "translation": "The monks then entered the city to solicit almsfood, but the people were so angry that they would not allow them to say anything. They left their empty bowls and returned to the mountain. They said to the World-honored One:",
        "source": "T04n0202_013:0438a08_6"
    },
    {
        "source_sentence": "作不善事，使諸四輩，各興惡心，向於沙門。」",
        "translation": "They do unwholesome things that cause the four groups of people to each give rise to bad thoughts and turn them toward the ascetic.",
        "source": "T04n0202_013:0438a10_7"
    },
    {
        "source_sentence": "爾時世尊告阿難言：「若有眾生，起於惡心，向諸沙門著染衣人，當知是人，",
        "translation": "It was then that the World-honored One said to Ānanda: If there are any sentient beings who, with evil thoughts, turn toward all the śramaṇas wearing dyed robes, know that they are like this.",
        "source": "T04n0202_013:0438a11_8"
    },
    {
        "source_sentence": "則便惡心，向於過去諸佛、辟支佛、阿羅漢，向於未來諸佛、辟支佛、阿羅漢，",
        "translation": "“Then they become evil-minded and turn their thoughts toward the buddhas, pratyekabuddhas, and arhats of the past and toward the buddhas, pratyekabuddhas, and arhats of the future.",
        "source": "T04n0202_013:0438a13_9"
    },
    {
        "source_sentence": "現在諸佛、辟支佛、阿羅漢。",
        "translation": "The present buddhas, pratyekabuddhas, and arhats.",
        "source": "T04n0202_013:0438a14_10"
    },
    {
        "source_sentence": "以發惡心向於三世諸賢聖故，便獲無量罪業果報。",
        "translation": "Because they give rise to bad thoughts directed toward the good and noble people of the three times, they'll attain the results of measureless sins and actions.",
        "source": "T04n0202_013:0438a15_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T04n0202_013:0438a16_12"
    },
    {
        "source_sentence": "染色之服，皆是三世賢聖標式，其有眾生，剃除鬚髮，著染衣者，當知是人，",
        "translation": "Those who shaved their hair and beard, wearing dyed robes, should be known to be people of the three times.",
        "source": "T04n0202_013:0438a17_0"
    },
    {
        "source_sentence": "不久當得解脫一切諸苦，獲無漏智，為諸眾生，作大救護。",
        "translation": "Soon they will attain liberation from all sufferings, attain uncontaminated knowledge, and become great saviors for sentient beings.",
        "source": "T04n0202_013:0438a18_1"
    },
    {
        "source_sentence": "若有眾生，能發信心，向於出家著染衣人，獲福難量。」",
        "translation": "If there are sentient beings who can give rise to faith and go forth to leave home wearing dyed robes, their merit will be immeasurable.",
        "source": "T04n0202_013:0438a20_2"
    },
    {
        "source_sentence": "佛告阿難：「我由往昔，於諸出家著染衣人，深生信心，敬戴之故，致得成佛。」",
        "translation": "The Buddha told Ānanda, In the past, I had deep faith in those who left home wearing dyed robes and became a buddha because of their respect and veneration.",
        "source": "T04n0202_013:0438a21_3"
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, Bhagavān!",
        "source": "T04n0202_013:0438a23_4"
    },
    {
        "source_sentence": "往昔深心，敬染衣人，其事云何？",
        "translation": "In the past I deeply venerated those who dyed my robes. What happened to me?",
        "source": "T04n0202_013:0438a23_5"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T04n0202_013:0438a24_6"
    },
    {
        "source_sentence": "佛告阿難：「善聽當說。」",
        "translation": "The Buddha told Ānanda, Listen well and explain it.",
        "source": "T04n0202_013:0438a24_7"
    },
    {
        "source_sentence": "「唯然世尊！",
        "translation": "Yes, Bhagavān!",
        "source": "T04n0202_013:0438a25_8"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T04n0202_013:0438a25_9"
    },
    {
        "source_sentence": "佛告阿難：「古昔無量阿僧祇劫，此閻浮提，有大國王，名曰提毘，總領八萬四千諸小國王，",
        "translation": "The Buddha said to Ānanda: In the distant past, during an incalculably long eon, there was a great king named Deva who ruled over eighty-four thousand small kingdoms in Jambudvfpa.",
        "source": "T04n0202_013:0438a25_10"
    },
    {
        "source_sentence": "世無佛法，有辟支佛，在於山間林中，坐禪行道飛騰變化，福度眾生。",
        "translation": "In the world there is no buddha-dharma, but there is a pratyekabuddha who lives among mountains in forests, meditates and travels on the path of enlightenment, soaring and transforming, blessedly liberating sentient beings.",
        "source": "T04n0202_013:0438a27_11"
    },
    {
        "source_sentence": "時諸野獸，咸來親附。",
        "translation": "All the wild animals then came and became intimate with him.",
        "source": "T04n0202_013:0438a29_12"
    },
    {
        "source_sentence": "有一師子，名號[跳-兆+茶]迦羅毘(晉言堅誓)，軀體金色，光相明顯煥然明裂，",
        "translation": "There was a lion named [jump-zhao+cha] kalaviṅka (known as Jianyi in the Jin dynasty). His body was golden in color, shining brilliantly and brilliantly.",
        "source": "T04n0202_013:0438b01_13"
    },
    {
        "source_sentence": "食果噉草，不害群生。",
        "translation": "They eat fruit and weeds that won't harm sentient beings.",
        "source": "T04n0202_013:0438b02_14"
    },
    {
        "source_sentence": "是時獵師，剃頭著袈裟，內佩弓箭，行於澤中，見有師子，甚懷歡喜，",
        "translation": "At that time the hunter shaved his hair and put on his reddish-brown robes, carried his bow and arrow inside, and walked among the marshlands. Seeing a lion in the marshlands, he was overjoyed.",
        "source": "T04n0202_013:0438b03_15"
    },
    {
        "source_sentence": "而心念言：『我今大利，得見此獸，可殺取皮，以用上王，足得脫貧。』",
        "translation": "He thought to himself, 'Now that I've gained great benefit from seeing this animal, I can kill it and skin it for the king's use so that he'll be able to escape poverty with my feet.'",
        "source": "T04n0202_013:0438b04_16"
    },
    {
        "source_sentence": "是時師子，適值睡眠，獵師便以毒箭射之。",
        "translation": "When the lion was asleep, the hunter shot him with a poisonous arrow.",
        "source": "T04n0202_013:0438b06_17"
    },
    {
        "source_sentence": "師子驚覺，即欲馳害，見著袈裟，便自念言：『如此之人，在世不久，",
        "translation": "The lion was startled and thought to himself, “Such a man will not live long in the world.",
        "source": "T04n0202_013:0438b07_18"
    },
    {
        "source_sentence": "必得解脫，離諸苦厄。",
        "translation": "They will surely attain liberation and be freed from suffering and distress.",
        "source": "T04n0202_013:0438b08_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T04n0202_013:0438b09_20"
    },
    {
        "source_sentence": "此染衣者，過去未來現在三世聖人標相，我若害之，則為惡心趣向三世諸賢聖人。』",
        "translation": "These dyed robes are marked by the marks of the sages of the three worlds in the past, future, and present, and if I harm them, they'll be bad-mindedly directed toward the good and noble people of the three times.'",
        "source": "T04n0202_013:0438b09_21"
    },
    {
        "source_sentence": "如是思惟，害意還息。",
        "translation": "When he thus reflects, his harmful thoughts will cease.",
        "source": "T04n0202_013:0438b11_22"
    },
    {
        "source_sentence": "「『耶羅羅　　婆奢沙　　娑呵』",
        "translation": "'耶羅羅羅 婆奢沙 娑呵,'",
        "source": "T04n0202_013:0438b12_23"
    },
    {
        "source_sentence": "毒箭兩行，命在不久，便說偈言：「說此語時，天地大動，無雲而雨，",
        "translation": "Soon after his death, the poisonous arrow had two strokes and said these verses in verse: When I uttered these words, heaven and earth trembled greatly; without clouds it rained.",
        "source": "T04n0202_013:0438b12_23"
    },
    {
        "source_sentence": "諸天惋惕，即以天眼下觀世間，見於獵師殺菩薩師子，於虛空中，雨諸天花，",
        "translation": "The gods, greatly distressed, looked down over the world with their divine eyes and saw that the hunter had killed the Bodhisattva’s lion and rained heavenly flowers in the sky.",
        "source": "T04n0202_013:0438b14_24"
    },
    {
        "source_sentence": "供養其屍。",
        "translation": "He made offerings to his corpse.",
        "source": "T04n0202_013:0438b16_25"
    },
    {
        "source_sentence": "是時獵師，剝師子皮，持至于家，以奉國王提毘，求索賞募。",
        "translation": "The hunter then stripped off the lion's skin and took it home to present it to the king of the country, Deva, to solicit a reward.",
        "source": "T04n0202_013:0438b16_26"
    },
    {
        "source_sentence": "時王念言：『經書有云：「若有畜獸身金色相，必是菩薩大士之人。」",
        "translation": "The king then thought, 'There's a sūtra that says, If an animal has a golden-colored body, it must be a bodhisattva or a great person.'",
        "source": "T04n0202_013:0438b18_27"
    },
    {
        "source_sentence": "我今云何資賞此人？",
        "translation": "How will I now reward this person?",
        "source": "T04n0202_013:0438b19_28"
    },
    {
        "source_sentence": "若與賞者，便為共此殺害無異。』",
        "translation": "If you give them a reward, then it's no different from killing someone who shares this with him.'",
        "source": "T04n0202_013:0438b20_29"
    },
    {
        "source_sentence": "是時獵師，素窮求哀，國王矜愍，與少財物，問獵師言：『師子死時，",
        "translation": "At that time the hunter was deeply distressed and grieved. The king felt disrespectful and gave him a small amount of money to beg for food. He asked the hunter, “When the lion dies,",
        "source": "T04n0202_013:0438b20_30"
    },
    {
        "source_sentence": "有何瑞應？』",
        "translation": "What's the auspicious response?'",
        "source": "T04n0202_013:0438b22_31"
    },
    {
        "source_sentence": "答言：『口說八字，天地普動，無雲而雨，天降諸花。』",
        "translation": "He replied, 'They say eight words in their mouths, and heaven and earth move everywhere without clouds or rain, and the gods send down flowers.'",
        "source": "T04n0202_013:0438b22_32"
    },
    {
        "source_sentence": "爾時國王，聞是語已，悲喜交集，信心益猛，即召諸臣耆舊智人，令解是義。",
        "translation": "When the king of that country heard these words, his compassion and joy gathered together, and his faith became stronger, so he summoned his ministers, senior scholars, and wise men to understand their meaning.",
        "source": "T04n0202_013:0438b23_33"
    },
    {
        "source_sentence": "時諸人眾，都不能解。",
        "translation": "The people at the time couldn't understand it.",
        "source": "T04n0202_013:0438b25_34"
    },
    {
        "source_sentence": "空林澤中，有一仙人，字奢摩，字義俱閑，仙人聰明，哲達貫練。",
        "translation": "In the empty forest and marshlands there was a holy man named Xiama, who lived in seclusion. The holy man was intelligent and learned but his philosophy was thoroughly unintelligent.",
        "source": "T04n0202_013:0438b26_35"
    },
    {
        "source_sentence": "使還白王，王即請來。",
        "translation": "The envoy returned and reported to the king, who invited him to come.",
        "source": "T04n0202_013:0438b27_36"
    },
    {
        "source_sentence": "仙人于時，具為大王解說其義：『耶羅羅，其義唯剃頭著染衣，當於生死疾得解脫。",
        "translation": "The ṛṣi then explained his meaning to the great king, saying, '耶羅羅羅羅, its meaning is that only by shaving your hair and wearing dyed robes will you quickly attain liberation from birth and death.",
        "source": "T04n0202_013:0438b28_37"
    },
    {
        "source_sentence": "婆奢沙，云剃頭著染衣者，皆是賢聖之相，近於涅槃。",
        "translation": "The Vaiśravaṇa says that someone who shaves their head and puts on dyed robes is a mark of the wise and saintly, approaching nirvāṇa.",
        "source": "T04n0202_013:0438c01_0"
    },
    {
        "source_sentence": "娑呵，云剃頭著染衣者，當為一切諸天世人所見敬仰。』",
        "translation": "Sāhā, it's said that someone who shaves their hair and puts on dyed robes will be respected by all the gods and worldlings.'",
        "source": "T04n0202_013:0438c02_1"
    },
    {
        "source_sentence": "於時仙人，解是語已，提毘歡喜，即召八萬四千小王，悉集一處，作七寶高車，",
        "translation": "Having understood these words, the holy man was delighted. Devadeva then summoned eighty-four thousand minor kings and assembled them all in one place to make a seven-jeweled high chariot.",
        "source": "T04n0202_013:0438c03_2"
    },
    {
        "source_sentence": "張師子皮，表示一切，悉共敬戴，燒香散花，而以供養，極盡忠心；",
        "translation": "They spread the lion’s skin to show their respect and veneration, burned incense and scattered flowers, and offered them as offerings.",
        "source": "T04n0202_013:0438c05_3"
    },
    {
        "source_sentence": "後復打金作棺，盛師子皮，以用起塔。",
        "translation": "He later beaten the coffin into gold and filled it with lion’s skin to build a stupa.",
        "source": "T04n0202_013:0438c06_4"
    },
    {
        "source_sentence": "爾時人民，緣是善心，壽終之後，皆得生天。」",
        "translation": "Because of this good intention, the people at that time will all be born in heaven after their lives end.",
        "source": "T04n0202_013:0438c07_5"
    },
    {
        "source_sentence": "佛告阿難及四部眾：「爾時師子，由發善心向染衣人，十億萬劫，作轉輪聖王，",
        "translation": "The Buddha said to Ānanda and the fourfold assembly: At that time the lion, having arisen with good intentions toward those wearing dyed robes, remained for one billion myriad eons as the universal ruler.",
        "source": "T04n0202_013:0438c08_6"
    },
    {
        "source_sentence": "給足眾生，廣殖福業，致得成佛。",
        "translation": "By providing for sentient beings, they cultivate a wide variety of meritorious actions that will lead to their attainment of buddhahood.",
        "source": "T04n0202_013:0438c10_7"
    },
    {
        "source_sentence": "爾時號[跳-兆+茶]迦毘羅者，豈異人乎？",
        "translation": "At the time, isn't that someone else who was called [jumping-zhao+cha] Kapila?",
        "source": "T04n0202_013:0438c11_8"
    },
    {
        "source_sentence": "今我身是也。",
        "translation": "'Now, this is my body.'",
        "source": "T04n0202_013:0438c12_9"
    },
    {
        "source_sentence": "時國王提毘，緣供養師子皮故，十萬億劫，天上人中，尊貴第一，修諸善本，",
        "translation": "The king of that country, Deva, honored as the lion’s skin because he offered it to him for one hundred myriad koṭis of kalpas, was the most noble among gods and humans in terms of his cultivation of virtue.",
        "source": "T04n0202_013:0438c12_10"
    },
    {
        "source_sentence": "今彌勒菩薩是。",
        "translation": "This is Maitreya Bodhisattva now.",
        "source": "T04n0202_013:0438c14_11"
    },
    {
        "source_sentence": "時仙人者，今舍利弗是。",
        "translation": "The sage of the time was Śāriputra, who is now Śāriputra.",
        "source": "T04n0202_013:0438c14_12"
    },
    {
        "source_sentence": "時獵師者，今提婆達多是。」",
        "translation": "The hunter at the time was Devadatta, who's now Devadatta.",
        "source": "T04n0202_013:0438c15_13"
    },
    {
        "source_sentence": "爾時四眾，從佛聞說過去因緣，心懷歡喜，深自惋悼悲歎而言：「我等愚癡！",
        "translation": "At that point, the fourfold assembly heard the Buddha teach the causes and conditions of past lives from the Buddha, rejoicing in their hearts, deeply grieving and lamenting, saying, We fools!",
        "source": "T04n0202_013:0438c15_14"
    },
    {
        "source_sentence": "不識明哲，生起惡心。",
        "translation": "Not knowing the philosophers, they give rise to bad thoughts.",
        "source": "T04n0202_013:0438c17_15"
    },
    {
        "source_sentence": "唯願如來！",
        "translation": "May it please the Tathāgata!",
        "source": "T04n0202_013:0438c18_0"
    },
    {
        "source_sentence": "憐愍愚癡，聽悔前罪。」",
        "translation": "Be compassionate and foolish, and listen to the repentance of past sins.",
        "source": "T04n0202_013:0438c18_1"
    },
    {
        "source_sentence": "世尊弘慈，因為說法四諦微妙，隨其宿緣，皆獲諸果，有得須陀洹、斯陀含、阿那含、阿羅漢果者，",
        "translation": "Because the World-honored One had great compassion, he taught the Dharma on the subtlety of the four noble truths. According to the conditions of their former existences, they all attained various fruits. Some were able to attain the fruit of stream-entry (srotaāpanna), the fruit of once-returning (sakṛdāgāmin), the fruit of non-returning",
        "source": "T04n0202_013:0438c18_2"
    },
    {
        "source_sentence": "有發無上正真道意者。",
        "translation": "There are those who give rise to the intention for the unsurpassed true path.",
        "source": "T04n0202_013:0438c21_0"
    },
    {
        "source_sentence": "是時阿難、四部之眾，聞佛所說，歡喜奉行。",
        "translation": "When Ānanda and the fourfold assembly heard what the Buddha taught, they rejoiced and remembered it well.",
        "source": "T04n0202_013:0438c21_1"
    },
    {
        "source_sentence": "（六二）梵志施佛納衣得受記品第五十五(丹本為六",
        "translation": "(62.) Chapter Fifty-fifth, The Vow to Give Up the Buddha's Assembled Clothes for religious Practitioners and Attend the Teaching (The Dan edition is sixteen copies long).",
        "source": "T04n0202_013:0438c23_0"
    },
    {
        "source_sentence": "十二)",
        "translation": "(12)",
        "source": "T04n0202_013:0438c24_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_013:0438c25_0"
    },
    {
        "source_sentence": "爾時世尊，將侍者阿難，入城分衛。",
        "translation": "It was then that the Bhagavān led his attendant Ānanda into the city to guard it.",
        "source": "T04n0202_013:0438c26_0"
    },
    {
        "source_sentence": "世尊身上所著之衣，有少穿壞，將欲以化應度眾生，乞食周訖，欲還所止。",
        "translation": "The Bhagavān's robe on his body, which was slightly torn and broken, was about to be worn to save sentient beings in order to transform them. After he had finished begging for food, he wanted to return to where he was staying.",
        "source": "T04n0202_013:0438c26_1"
    },
    {
        "source_sentence": "有一婆羅門，來至佛所，為佛作禮，覩佛容顏光相殊特，見佛身衣有少破壞，",
        "translation": "Then a certain brāhmaṇa came to the place where the Buddha was staying and, venerating him by bowing his forehead to his feet, he saw that the Buddha’s features were shining brilliantly. He saw that some of the body and clothes of the Buddha had been damaged.",
        "source": "T04n0202_013:0438c28_2"
    },
    {
        "source_sentence": "心存惠施，割省家中，得少白[(畾\\/且)*毛]，持用施佛：「唯願如來！",
        "translation": "He stored his mind in a generous gift, cut off his home, obtained a small amount of white [(and)*hair] hair, and gave it to the Buddha as a gift for use, saying, Please, Tathāgata!",
        "source": "T04n0202_013:0439a01_3"
    },
    {
        "source_sentence": "當持此[(畾\\/且)*毛]以用補衣。」",
        "translation": "You must take this [(twenty\\/and)*hair] to make up for your clothing.",
        "source": "T04n0202_013:0439a02_4"
    },
    {
        "source_sentence": "佛即受之。",
        "translation": "The Buddha then accepted it.",
        "source": "T04n0202_013:0439a03_5"
    },
    {
        "source_sentence": "時婆羅門，見佛受已，心情歡喜，倍加踊躍。",
        "translation": "The brāhmaṇa, seeing that the Buddha had accepted it, was overjoyed and doubled in joy.",
        "source": "T04n0202_013:0439a03_6"
    },
    {
        "source_sentence": "佛哀此人，即與授決：「於當來世二阿僧祇百劫之中，當得作佛，神通相好，",
        "translation": "The Buddha, pitying this man, gave him a prediction: In the future two incalculable hundreds of millions of world ages he will become a buddha endowed with supernormal powers and beautiful features.",
        "source": "T04n0202_013:0439a04_7"
    },
    {
        "source_sentence": "十號具足。」",
        "translation": "The ten epithets are complete.",
        "source": "T04n0202_013:0439a06_8"
    },
    {
        "source_sentence": "佛授記已歡喜而去。",
        "translation": "After the Buddha gave his prediction, he rejoiced and departed.",
        "source": "T04n0202_013:0439a06_9"
    },
    {
        "source_sentence": "國中豪賢長者居士，咸興此心：「云何世尊！",
        "translation": "The country's wealthy men and elders and householders all had this thought, Bhagavān!",
        "source": "T04n0202_013:0439a06_10"
    },
    {
        "source_sentence": "受彼少施，酬以大報？」",
        "translation": "Accepting a small gift from that person will be rewarded with a great reward?",
        "source": "T04n0202_013:0439a07_11"
    },
    {
        "source_sentence": "作是念已，各為如來，破損好[(畾\\/且)*毛]，作種種衣，持用奉佛。",
        "translation": "After they had this thought, each of them made various robes for the Tathāgata to wear and damage their good [(brown\\/and)*hair] hair, which they carried and offered to the Buddha.",
        "source": "T04n0202_013:0439a08_12"
    },
    {
        "source_sentence": "阿難問佛：「世尊先昔造何善行，能令一切奉施衣服？",
        "translation": "Ānanda asked the Buddha, Bhagavān, what good deeds did you perform in the past that caused you to offer clothing to all of them?",
        "source": "T04n0202_013:0439a09_13"
    },
    {
        "source_sentence": "願佛為說，令得開解。」",
        "translation": "May the Buddha explain it for them so that they'll attain enlightenment.",
        "source": "T04n0202_013:0439a10_14"
    },
    {
        "source_sentence": "世尊告曰：「諦聽著心，當為汝說過去因緣。」",
        "translation": "The Bhagavān told him, Listen attentively, mindful, and I will explain the causes and conditions of the past for you.",
        "source": "T04n0202_013:0439a11_15"
    },
    {
        "source_sentence": "阿難曰：「諾，我當善聽。」",
        "translation": "Ānanda said, Yes, I will listen well.",
        "source": "T04n0202_013:0439a12_16"
    },
    {
        "source_sentence": "佛告阿難：「乃往過去，無量無數阿僧祇劫，爾時有佛，名毘鉢尸，出現於世，",
        "translation": "The Buddha said to Ānanda: In the past, immeasurable, incalculable, and incalculable kalpas ago, a buddha named Vipaśyin appeared in the world.",
        "source": "T04n0202_013:0439a12_17"
    },
    {
        "source_sentence": "與其徒眾九萬人俱。",
        "translation": "He was accompanied by 90,000 of his disciples.",
        "source": "T04n0202_013:0439a14_18"
    },
    {
        "source_sentence": "彼時有王，名曰槃頭，有一大臣，請佛及僧，三月供養，佛即許可。",
        "translation": "At the time, there was a king named Pāṇḍu who had a minister invited the Buddha and the saṃgha to make offerings for three months, and the Buddha agreed.",
        "source": "T04n0202_013:0439a15_19"
    },
    {
        "source_sentence": "既蒙可已，還至其家，辦具所須。",
        "translation": "After receiving the permission, he returned to his home and prepared what was needed.",
        "source": "T04n0202_013:0439a16_20"
    },
    {
        "source_sentence": "時槃頭王，亦欲供養佛及眾僧，往至佛所，而白佛言：『貪得如來及比丘僧三月供養。』",
        "translation": "King Pāṇḍu also wanted to make offerings to the Buddha and the saṃgha, went to the Buddha and said to him, 'I'm covetous of the three-monthly offerings for the Tathāgata and the monks and nuns.'",
        "source": "T04n0202_013:0439a17_21"
    },
    {
        "source_sentence": "佛告槃頭：『吾先已受彼大臣請，大人之法，不宜中違。』",
        "translation": "The Buddha told Pāṇḍu, 'I've previously accepted that minister's invitation, and it's not appropriate for a great man to contradict his teaching.'",
        "source": "T04n0202_013:0439a19_22"
    },
    {
        "source_sentence": "王即還宮，告其臣曰：『佛處我國，吾欲供養，云卿已請；",
        "translation": "The king then returned to his palace and said to his ministers, “The Buddha is in my country. I wish to make offerings to you.” They said, “Your majesty, we have already invited him.",
        "source": "T04n0202_013:0439a20_23"
    },
    {
        "source_sentence": "今可避我，我供養訖，卿乃請之。』",
        "translation": "Now, you can avoid me. After I make my offerings, you'll ask me to do so.'",
        "source": "T04n0202_013:0439a21_24"
    },
    {
        "source_sentence": "臣答王言：『若使大王保我身命，復保如來常住於此，復令國土常安無災；",
        "translation": "The ministers replied to the king, saying: If a great king were to protect my life and body, he would also protect the Tathāgata who abides here permanently. He would also make his land always peaceful and without calamity.",
        "source": "T04n0202_013:0439a22_25"
    },
    {
        "source_sentence": "若使能保此諸事者，我乃息意，放王先請。』",
        "translation": "If someone can protect these things, then I'll stop thinking and let the king first ask for them.'",
        "source": "T04n0202_013:0439a24_26"
    },
    {
        "source_sentence": "王自念言：『斯事叵辦。』",
        "translation": "The king thought to himself, 'Such things are un manageable.'",
        "source": "T04n0202_013:0439a25_27"
    },
    {
        "source_sentence": "復更曉曰：『卿請一日，我復一日。』",
        "translation": "Again, he said at dawn, 'You're asking for one day, and I'll ask for another day.'",
        "source": "T04n0202_013:0439a25_28"
    },
    {
        "source_sentence": "臣便可之。",
        "translation": "The minister then approved of it.",
        "source": "T04n0202_013:0439a26_29"
    },
    {
        "source_sentence": "更互設會，各滿所願。",
        "translation": "They also set up an assembly among themselves, each fulfilling his vow.",
        "source": "T04n0202_013:0439a26_30"
    },
    {
        "source_sentence": "爾時大臣，為彼如來，辦具三衣，皆悉豐足，復為九萬諸比丘眾，作七條衣，",
        "translation": "At that time the minister prepared three kinds of robes for the Tathāgata’s sake, all rich and plentiful. He also made seven-piece robes for the assembly of ninety thousand bhikṣus:",
        "source": "T04n0202_013:0439a27_31"
    },
    {
        "source_sentence": "人與一領。",
        "translation": "The people and one receive it.",
        "source": "T04n0202_013:0439a29_32"
    },
    {
        "source_sentence": "阿難當知！",
        "translation": "Ānanda, you should know!",
        "source": "T04n0202_013:0439a29_33"
    },
    {
        "source_sentence": "爾時大臣，以上衣服，施佛及僧供養之者，豈異人乎？",
        "translation": "The minister then, isn't he someone else who gave the above-mentioned robes to the Buddha and the saṃgha to make offerings to them?",
        "source": "T04n0202_013:0439a29_34"
    },
    {
        "source_sentence": "則我身是。",
        "translation": "Then the self-body is self.",
        "source": "T04n0202_013:0439b02_0"
    },
    {
        "source_sentence": "我乃世世，殖福無厭，今悉自得，終不唐捐。」",
        "translation": "From generation to generation, I've cultivated merit without tire, and now I've attained it all by myself, so I won't give it away.",
        "source": "T04n0202_013:0439b02_1"
    },
    {
        "source_sentence": "時阿難等，聞說是已，歡喜懃修，造諸福業，心懷踊躍，頂戴奉行。",
        "translation": "When Ānanda and the others heard these words, they rejoiced and respectfully cultivated meritorious deeds. Their hearts trembled with joy as they carried out these deeds, bowed their heads in reverence, and handed them down.",
        "source": "T04n0202_013:0439b03_2"
    },
    {
        "source_sentence": "（六三）佛始起慈心緣品第五十六(丹本為六十三)",
        "translation": "(63) Chapter Fifty-six: Conditions for the Buddha's Beginning to Awaken the Mind of Compassion (The Dan edition is sixty-three)",
        "source": "T04n0202_013:0439b05_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_013:0439b06_0"
    },
    {
        "source_sentence": "爾時諸比丘，夏安居竟，往至佛所，禮敬問訊。",
        "translation": "It was then that the monks, having completed their summer retreat, went to the Buddha and greeted him with veneration.",
        "source": "T04n0202_013:0439b07_0"
    },
    {
        "source_sentence": "佛以慈心，慰喻撫恤：「汝等住彼，得無苦耶？」",
        "translation": "With a compassionate heart, the Buddha comforted and caressed them, saying, Are you staying there, attaining no suffering?",
        "source": "T04n0202_013:0439b08_1"
    },
    {
        "source_sentence": "慈心矜篤，極懷憐愍。",
        "translation": "Their minds are compassionate and affectionate, and they harbor extreme feelings of pity.",
        "source": "T04n0202_013:0439b09_2"
    },
    {
        "source_sentence": "阿難見之，而白佛言：「世尊！",
        "translation": "Seeing him, Ānanda said to the Buddha, Bhagavān!",
        "source": "T04n0202_013:0439b09_3"
    },
    {
        "source_sentence": "慈愍垂矜特隆。",
        "translation": "With kindness and pity, he was especially generous.",
        "source": "T04n0202_013:0439b10_4"
    },
    {
        "source_sentence": "不審，世尊！",
        "translation": "I'm not sure, Bhagavān!",
        "source": "T04n0202_013:0439b10_5"
    },
    {
        "source_sentence": "發如是心，為遠近耶？」",
        "translation": "Is it distant or near that you give rise to such a mind?",
        "source": "T04n0202_013:0439b10_6"
    },
    {
        "source_sentence": "佛告阿難：「若欲知之，當為汝說。",
        "translation": "The Buddha told Ānanda, If you want to know it, you should explain it for you.",
        "source": "T04n0202_013:0439b11_7"
    },
    {
        "source_sentence": "過去久遠，不可稱計阿僧祇劫，有二罪人，共在地獄，獄卒驅之使挽鐵車，",
        "translation": "In the distant past, an incalculable number of kalpas ago, two sinners were imprisoned together in hell. The jailer drove them away and had them pull the iron chariot.",
        "source": "T04n0202_013:0439b12_8"
    },
    {
        "source_sentence": "剝取其皮，用作車鞅，復以鐵棒，打令奔走，東西馳騁，無有休息。",
        "translation": "They peel off their skin and make a cart of carriages. Again, they beat them with an iron stick and cause them to run away, galloping east and west without cease.",
        "source": "T04n0202_013:0439b13_9"
    },
    {
        "source_sentence": "時彼一人，筋力尠薄，獄卒逼之，躃地便起，疲極困乏，絕死復蘇。",
        "translation": "At that time the strength of the man’s muscles weakened and he was tortured by the jailer. He fell to the ground in distress but after exhausted himself, he died and regained consciousness.",
        "source": "T04n0202_013:0439b15_10"
    },
    {
        "source_sentence": "彼共對者，見其困苦，興發慈心，憐愍此人，顧白獄卒：『唯願聽我躬代是人，",
        "translation": "Seeing this man in distress, they became compassionate and pitying him. They looked out for him and said to the wardens of hell, “All we ask is that you allow me to act as your witness for this man.",
        "source": "T04n0202_013:0439b16_11"
    },
    {
        "source_sentence": "獨挽此車。』",
        "translation": "I'll be the only one who pulls this chariot.'",
        "source": "T04n0202_013:0439b18_12"
    },
    {
        "source_sentence": "獄卒瞋恚，以棒打之，應時即死，生忉利天。",
        "translation": "The jailer became angry and beat him with a stick, and he died at that moment and was reborn in Trāyastriṃśa Heaven.",
        "source": "T04n0202_013:0439b18_13"
    },
    {
        "source_sentence": "阿難當知！",
        "translation": "Ānanda, you should know!",
        "source": "T04n0202_013:0439b20_0"
    },
    {
        "source_sentence": "爾時獄中慈心人者，我身是也。",
        "translation": "At the time, that person in prison with a compassionate mind was me.",
        "source": "T04n0202_013:0439b20_1"
    },
    {
        "source_sentence": "我乃爾時，於彼地獄受罪之時，初發如是慈矜之心，於一切人，未曾退捨，",
        "translation": "At the time, when I was being tortured in that hell, I first aroused this kind and compassionate mind, never turning away from all sentient beings.",
        "source": "T04n0202_013:0439b20_2"
    },
    {
        "source_sentence": "至於今日，故樂修行慈愍一切。」",
        "translation": "To this day, I'm therefore happy to cultivate compassion for all people.",
        "source": "T04n0202_013:0439b22_3"
    },
    {
        "source_sentence": "爾時阿難，聞佛所說，歡喜奉行。",
        "translation": "At that time Ānanda heard the Buddha’s discourse and was delighted to receive it.",
        "source": "T04n0202_013:0439b23_4"
    },
    {
        "source_sentence": "（六四）頂生王品第五十七(丹本為六十四)",
        "translation": "(64) Chapter Fifty-seventh of the King of Mansions (The Dan edition is sixty-four)",
        "source": "T04n0202_013:0439b25_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十人俱。",
        "translation": "Thus I have heard. One time the Buddha was staying at Jeta’s Grove in Sāvatthī, in Anāthapiṇḍika’s Park, accompanied by one thousand two hundred and fifty bhikṣus.",
        "source": "T04n0202_013:0439b26_0"
    },
    {
        "source_sentence": "爾時世尊，見諸比丘，貪於飾好，著於名利，多畜盈長，積聚無厭。",
        "translation": "At the time, the Bhagavān saw that the monks were addicted to decorations and adornments and attached to fame and profit, stockpiling large amounts of goods without tire.",
        "source": "T04n0202_013:0439b27_1"
    },
    {
        "source_sentence": "佛見此已，為諸比丘說貪利害：「夫貪欲者，現損身命，終歸三塗，受苦無量。",
        "translation": "Seeing this, the Buddha told the monks about the harmful effects of craving and profit: A desire that now harms one’s body and life will ultimately return to the three evil destinies with immeasurable suffering.",
        "source": "T04n0202_013:0439b29_2"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T04n0202_013:0439c02_0"
    },
    {
        "source_sentence": "吾自憶念過去世時，由於貪故，而便墮落，受諸苦惱。」",
        "translation": "I myself remember that in a past life, because of craving, I fell down and suffered various pains.",
        "source": "T04n0202_013:0439c02_1"
    },
    {
        "source_sentence": "爾時阿難，長跪叉手，前白佛言：「世尊！",
        "translation": "It was then that Ānanda knelt down with his palms joined and said to the Buddha, Bhagavān!",
        "source": "T04n0202_013:0439c04_0"
    },
    {
        "source_sentence": "過去由於貪故，而便墮落。",
        "translation": "In the past, it was because of craving that they fell down.",
        "source": "T04n0202_013:0439c04_1"
    },
    {
        "source_sentence": "其事云何？」",
        "translation": "What's the matter?",
        "source": "T04n0202_013:0439c05_2"
    },
    {
        "source_sentence": "世尊告曰：「乃往過去，無量無邊不可思議阿僧祇劫，此閻浮提，有一大王，",
        "translation": "The World-honored One said: In the distant past, immeasurable, limitless, inconceivable, and incalculable eons ago, there was a great king in Jambudvfpa.",
        "source": "T04n0202_013:0439c05_3"
    },
    {
        "source_sentence": "名瞿薩離，典斯天下八萬四千小國，有二萬夫人婇女，一萬大臣。",
        "translation": "He ruled over eighty-four thousand small countries in the empire under his rule, with twenty thousand wives and court ladies and ten thousand ministers.",
        "source": "T04n0202_013:0439c07_4"
    },
    {
        "source_sentence": "時王頂上欻生一皰，其形如繭，淨潔清徹，亦不疼痛。",
        "translation": "The king then gave rise to a blistering blistering on the top of his head in the shape of a cocoon, which was pure and penetrating, and didn't hurt.",
        "source": "T04n0202_013:0439c08_5"
    },
    {
        "source_sentence": "後轉轉大，乃至如瓠，便劈看之，得一童子，甚為端正，頭髮紺青，身紫金色。",
        "translation": "Later he grew larger and larger, until it looked like a bamboo bowl. Then he saw a young boy very handsome, with dark blue hair and purple-gold body.",
        "source": "T04n0202_013:0439c10_6"
    },
    {
        "source_sentence": "即召相師，占相吉凶，相師占已，便答王言：『此兒有德，雄姿奇特，",
        "translation": "He summoned the soothsayer to divine the auspicious signs. Having done so, the soothsayer answered the king in reply, saying:",
        "source": "T04n0202_013:0439c12_0"
    },
    {
        "source_sentence": "必為聖王，統臨四域。』",
        "translation": "He'll surely become a noble king who governs the four realms.'",
        "source": "T04n0202_013:0439c13_1"
    },
    {
        "source_sentence": "因為立字，名文陀竭(晉言頂生)。",
        "translation": "Because it establishes words, it's called Mūrdha (known in the Jin as Zhengsheng).",
        "source": "T04n0202_013:0439c14_2"
    },
    {
        "source_sentence": "年已長大，英德遂著，王以一國，用封給之。",
        "translation": "As he grew up, the emperor granted him a fief of one kingdom for his talent.",
        "source": "T04n0202_013:0439c14_3"
    },
    {
        "source_sentence": "大王後時，被病困篤，諸小王輩，皆來瞻省，不能自免，遂便薨背。",
        "translation": "When the king was ill and in distress, all the rulers of the small countries came to see him but they could not prevent themselves from doing so. So they died.",
        "source": "T04n0202_013:0439c15_4"
    },
    {
        "source_sentence": "諸附庸王共詣頂生，而咸啟曰：『大王已崩，願嗣國位。』",
        "translation": "The vassal kings all went to the top of their heads and asked, 'The great king has died, may he inherit the throne.'",
        "source": "T04n0202_013:0439c17_5"
    },
    {
        "source_sentence": "頂生答言：『若吾有福應為王者，要令四天及尊帝釋，來相迎授，爾乃登祚。』",
        "translation": "The top of the head replied, 'If I'm blessed enough to become king, I must cause the four gods and Venerable Śākyamuni to come to greet me, and then you'll ascend to the throne.'",
        "source": "T04n0202_013:0439c18_6"
    },
    {
        "source_sentence": "立誓已竟，四天即下，各捉寶瓶，盛滿香湯，以灌其頂。",
        "translation": "After they had made their vow, the four heavenly beings descended and each took a jeweled vase and filled it with scented water to pour it over their heads.",
        "source": "T04n0202_013:0439c20_7"
    },
    {
        "source_sentence": "時天帝釋，復持寶冠，來為著之，然後稱揚。",
        "translation": "Then Indra, lord of the gods, again wearing a jeweled crown, came to wear it for him and then praised it.",
        "source": "T04n0202_013:0439c21_8"
    },
    {
        "source_sentence": "諸王復勸當詣大國王所治處。",
        "translation": "The kings again encouraged him to go to the place where the great king ruled.",
        "source": "T04n0202_013:0439c22_9"
    },
    {
        "source_sentence": "頂生復言：『若我有福應為王者，國當就我，我不就國。』",
        "translation": "The topknot again said, 'If I have merit and should become king, the kingdom will follow me, but I won't follow the kingdom.'",
        "source": "T04n0202_013:0439c23_10"
    },
    {
        "source_sentence": "立誓適竟，大國之中所有宮殿，園林浴池，悉來就王。",
        "translation": "When the vow was fulfilled, all the palaces, parks, forests, and bathing ponds in the great country came to the king.",
        "source": "T04n0202_013:0439c24_11"
    },
    {
        "source_sentence": "金輪、象馬、玉女、神珠、典藏、典兵，悉亦應集，君四天下，為轉輪王。",
        "translation": "The golden wheel, elephants, horses, jade maidens, divine pearls, treasuries, treasure houses, and armies should all gather together to rule over the four quarters of the earth as universal monarchs.",
        "source": "T04n0202_013:0439c25_12"
    },
    {
        "source_sentence": "巡行國界，見諸人民，墾地耕種。",
        "translation": "He traveled around the borders of the country and saw the people plowing land and cultivating crops.",
        "source": "T04n0202_013:0439c27_13"
    },
    {
        "source_sentence": "王問臣吏：『此諸群生，欲作何等？』",
        "translation": "The king asked his ministers, 'What do these sentient beings want to do?'",
        "source": "T04n0202_013:0439c28_14"
    },
    {
        "source_sentence": "便答王言：『有形之類，由食得存，是以種穀，欲以濟命。』",
        "translation": "He then answered the king, saying, 'Form and form are sustained by food; therefore, we plant grain in order to save our lives.'",
        "source": "T04n0202_013:0439c28_15"
    },
    {
        "source_sentence": "王立誓言：『若我有福應為王者，當有自然百味飲食，充飽一切，使無飢渴。』",
        "translation": "The king made a vow, saying, 'If I'm blessed and should become king, I will naturally have a hundred flavors of food and drink to satisfy them all so that they won't hunger or thirst.'",
        "source": "T04n0202_013:0440a01_16"
    },
    {
        "source_sentence": "作願已竟，尋有飲食。",
        "translation": "After he had finished making the vow, he found some food and drink.",
        "source": "T04n0202_013:0440a03_17"
    },
    {
        "source_sentence": "王更出遊，見諸人民，紡績經織。",
        "translation": "The king went on another excursion and saw the people weaving silk cloth and scriptures.",
        "source": "T04n0202_013:0440a03_18"
    },
    {
        "source_sentence": "王復問言：『作此用為？』",
        "translation": "The king again asked, 'What's the purpose of doing this?'",
        "source": "T04n0202_013:0440a04_19"
    },
    {
        "source_sentence": "諸人對曰：『食已自然，無以嚴身，是故紡織用作服飾。』",
        "translation": "The people replied, 'After eating it naturally, there's no way to adorn the body; therefore, weaving and weaving are used as clothing.'",
        "source": "T04n0202_013:0440a04_20"
    },
    {
        "source_sentence": "王復立誓：『若我有福應為王者，當有妙衣自然而出，賑給萬民，使無窮乏。』",
        "translation": "Again, the king made a vow, 'If I'm blessed enough to become king, I will have wonderful clothing that comes out naturally and enriches all my people so that they don't lack it.'",
        "source": "T04n0202_013:0440a06_21"
    },
    {
        "source_sentence": "作願已竟，應時諸樹悉生種種異色妙服，一切人民，求得無盡。",
        "translation": "After he had finished making his vow, the trees then all gave rise to various kinds of marvelous robes of different colors and forms, which all the people asked for inexhaustibly.",
        "source": "T04n0202_013:0440a07_22"
    },
    {
        "source_sentence": "王更出遊，見諸群黎，修治樂器。",
        "translation": "The king went out on another excursion and saw the villagers cultivating music instruments.",
        "source": "T04n0202_013:0440a09_23"
    },
    {
        "source_sentence": "王因問之：『作此何為？』",
        "translation": "The king then asked him, 'What's the purpose of doing this?'",
        "source": "T04n0202_013:0440a10_24"
    },
    {
        "source_sentence": "諸人報言：『衣食既充，乏於音樂，所以治此，欲用自娛。』",
        "translation": "The people replied, 'Now that their food and clothing are plentiful and they lack music, why do they treat this place and want to use it for their own entertainment?'",
        "source": "T04n0202_013:0440a10_25"
    },
    {
        "source_sentence": "王復立誓：『若我有福應為王者，眾妙樂器，當自然至。』",
        "translation": "The king then made another vow, 'If I'm blessed and should become king, all the wonderful instruments of music will naturally arrive.'",
        "source": "T04n0202_013:0440a11_26"
    },
    {
        "source_sentence": "作願適竟，應時諸樹，若干種種伎樂，懸在其枝，若有須者，取而鼓之，",
        "translation": "When the vow was fulfilled, various kinds of music and tricks were played by the trees at that time. If they had anything to offer, they would take it and beat it.",
        "source": "T04n0202_013:0440a13_27"
    },
    {
        "source_sentence": "音聲和暢，其有聞者，無不歡預。",
        "translation": "The sound was so harmonious that none of the people who heard it would not rejoice.",
        "source": "T04n0202_013:0440a14_28"
    },
    {
        "source_sentence": "王德至重，萬善臻集，天雨七寶，遍諸國界。",
        "translation": "The king’s virtue was so great that all kinds of good deeds were assembled, and the heavenly rain of the seven treasures pervaded all the worlds.",
        "source": "T04n0202_013:0440a15_29"
    },
    {
        "source_sentence": "王問諸臣：『此誰之德？』",
        "translation": "The king asked the ministers, 'Whose virtue is this?'",
        "source": "T04n0202_013:0440a16_30"
    },
    {
        "source_sentence": "諸臣對曰：『此是王德，亦國民福。』",
        "translation": "The ministers replied, 'This is the king's virtue and the merit of his people.'",
        "source": "T04n0202_013:0440a16_31"
    },
    {
        "source_sentence": "王復立誓：『若是民福，寶當普雨；",
        "translation": "The king then made another vow, saying: If this is the blessing of the people, the treasures will rain down everywhere.",
        "source": "T04n0202_013:0440a17_32"
    },
    {
        "source_sentence": "若獨我德，齊雨宮內。』",
        "translation": "If we're alone in our virtue, we'll all rain it inside the palace.'",
        "source": "T04n0202_013:0440a18_33"
    },
    {
        "source_sentence": "作願適竟，餘處悉斷，唯雨宮裏，七日七夜。",
        "translation": "When his vow was fulfilled, all the other places were cut off except for the rain in the palace for seven days and nights.",
        "source": "T04n0202_013:0440a18_34"
    },
    {
        "source_sentence": "「其頂生王，於閻浮提，五欲自娛，經八萬四千歲。",
        "translation": "Ānanda, King Mandhātu enjoyed the pleasures of the five senses for himself in Jambudvfpa for eighty-four thousand years.",
        "source": "T04n0202_013:0440a19_35"
    },
    {
        "source_sentence": "時有夜叉，踊出殿前，高聲唱言：『東方有國，名弗婆提，其中豐樂，",
        "translation": "Then a yakṣa emerged from the front of the palace and shouted loudly, “There is a country in the east called Pubbastivāda with plenty of food and drink.",
        "source": "T04n0202_013:0440a21_36"
    },
    {
        "source_sentence": "快善無比，大王可往遊觀彼界。』",
        "translation": "The pleasure and goodness are incomparable, so the great king may go and visit that realm.'",
        "source": "T04n0202_013:0440a22_37"
    },
    {
        "source_sentence": "王則允可。",
        "translation": "The king agreed.",
        "source": "T04n0202_013:0440a23_38"
    },
    {
        "source_sentence": "意欲巡行，金輪復轉，躡虛而進，群臣七寶，皆悉隨從。",
        "translation": "When the Master wished to go on a excursion, the golden wheel again turned and advanced in midair. All the ministers and the seven kinds of treasures all followed him.",
        "source": "T04n0202_013:0440a23_39"
    },
    {
        "source_sentence": "既至彼土，諸小王等，盡來朝賀。",
        "translation": "When they arrived in that land, all the small kings and others came to congratulate them.",
        "source": "T04n0202_013:0440a24_40"
    },
    {
        "source_sentence": "王於彼國，五欲自恣，經八億歲。",
        "translation": "In that country, the king's five desires were self-imposed for 800 million years.",
        "source": "T04n0202_013:0440a25_41"
    },
    {
        "source_sentence": "夜叉復唱：『西方有國，名瞿耶尼，亦復快樂，王可至彼。』",
        "translation": "Again, the yakṣas called out, 'There's a country in the west named Gayānī, which is also happy, and the king can go there.'",
        "source": "T04n0202_013:0440a26_42"
    },
    {
        "source_sentence": "王即允然，往遊其土，食福受樂經十四億歲。",
        "translation": "The king then agreed and traveled to that land, where he ate good fortune and enjoyed pleasure for  1.4 billion years.",
        "source": "T04n0202_013:0440a27_43"
    },
    {
        "source_sentence": "夜叉復唱：『北方有國，名欝單曰，其土安豐，人民熾盛，王可到彼。』",
        "translation": "The yakṣas also called out, 'There's a country in the north named Uttarakuru, whose land is peaceful and prosperous, so the king can go there.'",
        "source": "T04n0202_013:0440a28_44"
    },
    {
        "source_sentence": "王即往詣，留止其中，上妙五欲，極情恣意，經十八億歲。",
        "translation": "The king then went and stayed there for eighteen billion years, indulging in the five most sublime desires with extreme affection and restraint.",
        "source": "T04n0202_013:0440b01_45"
    },
    {
        "source_sentence": "夜叉復唱：『有四天王處，其樂難量，王可遊之。』",
        "translation": "Again, the yakṣas called out, 'There are places where the four heavenly kings live, and their pleasure is immeasurable; the king can travel there.'",
        "source": "T04n0202_013:0440b02_46"
    },
    {
        "source_sentence": "王與群臣及四種兵，乘虛而上。",
        "translation": "The king, his ministers, and the four kinds of soldiers rode up in space.",
        "source": "T04n0202_013:0440b03_47"
    },
    {
        "source_sentence": "四天遙見，甚懷恐怖，即合兵眾，出外拒之，竟不奈何，還歸所止。",
        "translation": "Seeing this from a distance, the four guardian gods became very frightened and immediately joined their troops. They came out to repulse the enemy but they could not resist and returned home to where they were staying.",
        "source": "T04n0202_013:0440b04_48"
    },
    {
        "source_sentence": "頂生於中，優遊受樂，經數十億歲。",
        "translation": "He was born at the top of his head and spent billions of years roaming there enjoying pleasure.",
        "source": "T04n0202_013:0440b05_49"
    },
    {
        "source_sentence": "意中復念：『欲昇忉利。』",
        "translation": "In his mind, he also thinks, 'I want to ascend to Trāyastriṃśa Heaven.'",
        "source": "T04n0202_013:0440b06_50"
    },
    {
        "source_sentence": "即與群眾，蹈虛登上。",
        "translation": "He then joined the crowd and climbed up into space.",
        "source": "T04n0202_013:0440b07_51"
    },
    {
        "source_sentence": "「時有五百仙人，住在須彌山腹，王之象馬屎尿下落，污仙人身。",
        "translation": "At the time, there were five hundred sages living on the periphery of Mount Sumeru, and the king's elephants, horses, dung, urine, and urine fell down to defile the sage's body.",
        "source": "T04n0202_013:0440b07_52"
    },
    {
        "source_sentence": "諸仙相問：『何緣有此？』",
        "translation": "The sages asked each other, 'What's the reason for this?'",
        "source": "T04n0202_013:0440b09_53"
    },
    {
        "source_sentence": "中有智者，告眾人言：『吾聞頂生王，欲上三十三天，必是象馬失此不淨。』",
        "translation": "A wise person in the midst of it told the crowd, 'I've heard that King Mantāṇiputta wants to ascend to the Trāyastriṃśa gods, but it must be because elephants and horses lost this impurity.'",
        "source": "T04n0202_013:0440b09_54"
    },
    {
        "source_sentence": "仙人忿恨，便結神呪，令頂生王及其人眾，悉住不轉。",
        "translation": "Being angry, the sage then conjured up a spell to cause King Mandhātu and his people to stay and don't turn.",
        "source": "T04n0202_013:0440b11_55"
    },
    {
        "source_sentence": "王復知之，即立誓願：『若我有福，斯諸仙人，悉皆當來承供所為。』",
        "translation": "Knowing them again, the king made a vow, 'If I'm blessed, these sages will all come to make offerings to me.'",
        "source": "T04n0202_013:0440b12_56"
    },
    {
        "source_sentence": "王德弘博，能有感致，五百仙人盡到王邊，扶輪御馬，共至天上。",
        "translation": "The king’s virtue was vast and extensive, capable of producing a feeling of affection. All the five hundred holy ones came to the king’s side; supported by the cakravartin and riding on his royal horse, they went up to heaven together.",
        "source": "T04n0202_013:0440b14_57"
    },
    {
        "source_sentence": "未至之頃，遙覩天城，名曰快見，其色皦白，高顯殊特。",
        "translation": "Before he arrived, the Master saw from a distance the celestial city called Sudarśana, which was coarse white in color and very lofty.",
        "source": "T04n0202_013:0440b15_58"
    },
    {
        "source_sentence": "此快見城，有千二百門，諸天怖畏，悉閉諸門，著三重鐵關。",
        "translation": "This city of Vaiśravaṇa has one thousand two hundred gates, and the gods are terrified. They shut all the gates and set up three iron barriers.",
        "source": "T04n0202_013:0440b17_59"
    },
    {
        "source_sentence": "頂生兵眾，直趣不疑。",
        "translation": "At the top of their heads, there were soldiers who went straight ahead without doubt.",
        "source": "T04n0202_013:0440b18_60"
    },
    {
        "source_sentence": "王即取貝吹之，張弓扣彈，千二百門一時皆開。",
        "translation": "The king then took the shell and blew it, drew his bow, and struck it. One thousand two hundred doors were all opened at once.",
        "source": "T04n0202_013:0440b19_0"
    },
    {
        "source_sentence": "帝釋尋出，與共相見，因請入宮，與共分坐。",
        "translation": "Śakra, lord of the gods, came out and saw him together. So he was invited into the palace to share his seat with them.",
        "source": "T04n0202_013:0440b20_1"
    },
    {
        "source_sentence": "天帝人王，貌類一種，其初見者，不能分別，唯以視眴遲疾，知其異耳。",
        "translation": "The Trāyastriṃśa gods and human kings are similar in appearance but when they first saw each other they could not distinguish distinctly. All they did was to look at their debilitating hindrances and tell the others of their differences.",
        "source": "T04n0202_013:0440b21_2"
    },
    {
        "source_sentence": "「王於天上，受五欲樂，盡三十六帝，末後帝釋，是大迦葉。",
        "translation": "When the king was in heaven, he experienced the five pleasures of desire and exhausted the thirty-sixth emperor, and at the end of his reign, Śākyamuni, who was Mahākāśyapa.",
        "source": "T04n0202_013:0440b22_3"
    },
    {
        "source_sentence": "時阿修羅王興軍上天，與帝釋鬪，帝釋不如，退軍入城。",
        "translation": "When the asura king raised his army up to heaven and fought Indra, Indra didn't do as well, and withdrew his army into the city.",
        "source": "T04n0202_013:0440b24_4"
    },
    {
        "source_sentence": "頂生復出，吹貝扣弓，阿修羅王即時崩墜。",
        "translation": "The king of asura immediately fell to the ground.",
        "source": "T04n0202_013:0440b25_5"
    },
    {
        "source_sentence": "頂生自念：『我力如是，無有等者，今與帝釋，共坐何為？",
        "translation": "The top of his head thought to himself, 'Such is my strength; there's nothing equal to it. Now, why am I sitting with Indra?",
        "source": "T04n0202_013:0440b26_6"
    },
    {
        "source_sentence": "不如害之，獨霸為快。』",
        "translation": "It's better not to harm them, but it's better to blame alone.'",
        "source": "T04n0202_013:0440b27_7"
    },
    {
        "source_sentence": "「惡心已生，尋即墮落，當本殿前，委頓欲死。",
        "translation": "Once the evil thoughts have arisen, they'll suddenly fall down in front of their main hall and immediately want to die.",
        "source": "T04n0202_013:0440b28_8"
    },
    {
        "source_sentence": "諸人來問：『若後世人，問頂生王云何命終？",
        "translation": "People came and asked, 'If someone in a later life asks the king who was born at the top of his head, how did his life end?'",
        "source": "T04n0202_013:0440b29_9"
    },
    {
        "source_sentence": "何以報之？』",
        "translation": "What's the way to repay it?'",
        "source": "T04n0202_013:0440c01_10"
    },
    {
        "source_sentence": "王對之曰：『若有此問，便可答之：「頂生王者，由貪而死。",
        "translation": "The king said to him, 'If you have this question, you can answer it, saying, 'The king born at the top of his head died from craving.",
        "source": "T04n0202_013:0440c01_11"
    },
    {
        "source_sentence": "統領四域，四十億歲，七日雨寶，及在二天，而無厭足，故致墜落。」』",
        "translation": "He governs the four regions for 4 billion years, raining treasures for seven days and in two heavens, but he doesn't tire of them; therefore, he causes them to fall down.'",
        "source": "T04n0202_013:0440c03_0"
    },
    {
        "source_sentence": "是故比丘！",
        "translation": "Therefore, monks!",
        "source": "T04n0202_013:0440c04_1"
    },
    {
        "source_sentence": "夫利養者，實為大患，當思遠離深求道真。」",
        "translation": "A person who benefits is really a great danger, so they should consider being far removed from it and deeply seeking the truth of the path.",
        "source": "T04n0202_013:0440c04_2"
    },
    {
        "source_sentence": "阿難白佛：「此頂生王，宿殖何福，而獲如此無量大報？」",
        "translation": "Ānanda said to the Buddha, What good fortune did this king born at the top of his head cultivate in the past and obtain such an immeasurable great reward?",
        "source": "T04n0202_013:0440c05_3"
    },
    {
        "source_sentence": "佛告之曰：「乃往過去，不可計劫，時世有佛，號曰弗沙，與其徒眾，",
        "translation": "The Buddha said to them: In the distant past, an incalculable number of world ages ago, there was a buddha named Puṣkara and his retinue of disciples.",
        "source": "T04n0202_013:0440c07_4"
    },
    {
        "source_sentence": "遊化世間。",
        "translation": "He traveled to transform the world.",
        "source": "T04n0202_013:0440c08_5"
    },
    {
        "source_sentence": "時婆羅門子，適欲娶婦，手把大豆，當用散婦，是其曩世，俗家之禮。",
        "translation": "When the Brāhmaṇa's son was about to take his wife, he held a large bean in his hand and scattered it for her; this was the custom of the secular householders.",
        "source": "T04n0202_013:0440c08_6"
    },
    {
        "source_sentence": "於道值佛，心意歡喜，即持此豆，奉散於佛，四粒入鉢，一粒住頂。",
        "translation": "When he met the Buddha on the road, his mind rejoicing, he took this bean and offered it to him. Four grains were put into the bowl, and one grain remained at the top of the bowl.",
        "source": "T04n0202_013:0440c10_7"
    },
    {
        "source_sentence": "由此因緣，受無極福，四粒入鉢，王四天下；",
        "translation": "Because of this cause and condition, they receive unlimited blessedness. Four grains entered into their bowls and ruled over the four quarters of the earth.",
        "source": "T04n0202_013:0440c12_0"
    },
    {
        "source_sentence": "一粒在頂，受樂二天。」",
        "translation": "A grain of it is on the top of his head, and he'll experience happiness in two heavens.",
        "source": "T04n0202_013:0440c13_0"
    },
    {
        "source_sentence": "爾時諸弟子，聞佛所說，有得初果二果三果及阿羅漢者，不可稱數，受持佛語，",
        "translation": "At that time the disciples heard what the Buddha taught, and those who had attained the first fruits, second fruits, third fruits, and so on, as well as some arhats, cannot be counted. They accepted and remembered the Buddha’s words:",
        "source": "T04n0202_013:0440c13_1"
    },
    {
        "source_sentence": "歡喜奉行。",
        "translation": "They rejoice and venerate it.",
        "source": "T04n0202_013:0440c15_2"
    },
    {
        "source_sentence": "（六五）蘇曼女十子品第五十八(丹本為六十五)",
        "translation": "65. The Fifty-eighth Chapter of the Ten Sons of Samantabhadra (The Dan edition is 65)",
        "source": "T04n0202_013:0440c16_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_013:0440c17_0"
    },
    {
        "source_sentence": "爾時須達長者，末下小女，字曰蘇曼，面首端正，容貌最妙，其父憐愛，",
        "translation": "It was then that the wealthy householder Sudarśana, a young woman named Suman by the name of Samantabhadra, with graceful features and beautiful appearance, whom her father loved.",
        "source": "T04n0202_013:0440c18_0"
    },
    {
        "source_sentence": "特於諸子，若遊行時，每將共去。",
        "translation": "It was special for the children, and when they were traveling, they would always leave together.",
        "source": "T04n0202_013:0440c19_1"
    },
    {
        "source_sentence": "於是長者，將至佛所，其女見佛，情倍欣踊，願得好香，塗佛住室。",
        "translation": "The wealthy man then approached the Buddha. Seeing him, the woman was overjoyed and wished to obtain a good fragrance so as to rub it on the Buddha’s living quarters.",
        "source": "T04n0202_013:0440c20_2"
    },
    {
        "source_sentence": "斯女手中，有賓婆菓。",
        "translation": "In the hand of that woman, there was a pippala fruit.",
        "source": "T04n0202_013:0440c21_3"
    },
    {
        "source_sentence": "佛從索之，奉教便與。",
        "translation": "The Buddha begged for it and gave it to him in accordance with his instructions.",
        "source": "T04n0202_013:0440c22_4"
    },
    {
        "source_sentence": "佛尋於上，書香種稷，還以與之。",
        "translation": "The Buddha went upstairs, wrote incense and planted grapes, and gave them back to him.",
        "source": "T04n0202_013:0440c22_5"
    },
    {
        "source_sentence": "女共其父，還歸城裏，便行推買種種妙香，如佛所須，持詣祇洹，躬自擣磨，",
        "translation": "The woman returned to the city with her father. They went on a excursion and purchased various kinds of good incense, just as the Buddha desired. Carrying them to Jeta’s quarters, she personally polished and polished it herself.",
        "source": "T04n0202_013:0440c23_6"
    },
    {
        "source_sentence": "日日如是。",
        "translation": "Day after day, it's like this.",
        "source": "T04n0202_013:0440c25_7"
    },
    {
        "source_sentence": "於時持叉尸利國王，遣其一兒，使到舍衛，初適他土廣行觀看，漸漸展轉，",
        "translation": "At that time the king of Kaśmīra had sent one of his sons to Sāvatthī, and when he arrived at Sāvatthī, he traveled widely in other lands to see him.",
        "source": "T04n0202_013:0440c25_8"
    },
    {
        "source_sentence": "復至精舍，見蘇曼女在中磨香，愛其姿容，欲得為妻，即往入城，啟波斯匿王：「云有此女，",
        "translation": "When he returned to the monastery, he saw that Sumana’s daughter was there polishing incense. Desiring to have her as his wife, he went into the city and said to King Prasenajit:",
        "source": "T04n0202_013:0440c27_9"
    },
    {
        "source_sentence": "可適我意，願王見賜，勿違我志。」",
        "translation": "Please adapt to my wishes, and may the king grant it to you without di disagreeing with me.",
        "source": "T04n0202_013:0440c29_10"
    },
    {
        "source_sentence": "王問之曰：「是誰家女？」",
        "translation": "The king asked her, Who's the daughter of that family?",
        "source": "T04n0202_013:0441a01_11"
    },
    {
        "source_sentence": "答言：「是須達許。」",
        "translation": "He replied, Yes, Sudarśana.",
        "source": "T04n0202_013:0441a01_12"
    },
    {
        "source_sentence": "王言：「卿自從索，吾不能知。」",
        "translation": "The king said, Since you asked for it, I can't know.",
        "source": "T04n0202_013:0441a02_13"
    },
    {
        "source_sentence": "復重啟王：「王若相聽，當自求之。」",
        "translation": "Again, he asked the king, If you're listening to each other, you must ask for it yourself.",
        "source": "T04n0202_013:0441a03_0"
    },
    {
        "source_sentence": "王言：「可爾。」",
        "translation": "The king said, That's right.",
        "source": "T04n0202_013:0441a03_1"
    },
    {
        "source_sentence": "彼國王兒，發遣子弟、車乘眾物，先歸本國，唯留一象及己在後，往至祇洹，",
        "translation": "The king of that country sent his children and their chariots, as well as all the goods they possessed, back to their own country but leaving only one elephant behind. They proceeded on their way to Jīvaka.",
        "source": "T04n0202_013:0441a04_0"
    },
    {
        "source_sentence": "搏蘇曼女，累騎而去。",
        "translation": "Pāṣu-maṇḍikā mounted the horse and departed.",
        "source": "T04n0202_013:0441a05_1"
    },
    {
        "source_sentence": "須達聞之，遣人追逐，象走駛速，不能及逮。",
        "translation": "When Sudarśana heard this, he sent men to chase after the elephant. The elephant was running so fast that he could not catch it.",
        "source": "T04n0202_013:0441a06_2"
    },
    {
        "source_sentence": "即達本土，便用為婦，後遂懷妊，生卵十枚。",
        "translation": "She then reached the native land and became a wife. Later she became pregnant and gave birth to ten eggs.",
        "source": "T04n0202_013:0441a07_3"
    },
    {
        "source_sentence": "卵後開敷，有十男兒，形貌姝好，與人有異。",
        "translation": "After the eggs were laid, there were ten boys with beautiful appearances that differed from those of human beings.",
        "source": "T04n0202_013:0441a08_4"
    },
    {
        "source_sentence": "年遂長大，勇健非凡，然喜畋獵，傷害物命。",
        "translation": "He grew up to be an extraordinarily strong and brave man, but he was fond of hunting and killed animals.",
        "source": "T04n0202_013:0441a09_5"
    },
    {
        "source_sentence": "其母矜愍，教使莫爾。",
        "translation": "The mother was disrespectful and instructed the messenger not to do so.",
        "source": "T04n0202_013:0441a10_6"
    },
    {
        "source_sentence": "諸子白母：「射獵之事，最為快樂，母今相遮，將為見憎。」",
        "translation": "The children said to their mother, Shooting and hunting is the most delightful thing, and now that she's covering them up, she's about to become disgusted.",
        "source": "T04n0202_013:0441a11_0"
    },
    {
        "source_sentence": "母復告言：「吾愛汝等！",
        "translation": "The mother again told them, I love you!",
        "source": "T04n0202_013:0441a12_1"
    },
    {
        "source_sentence": "是以因制；",
        "translation": "This is why it is regulated by reason.",
        "source": "T04n0202_013:0441a12_2"
    },
    {
        "source_sentence": "若當憎汝，終無此言。",
        "translation": "If I hate you, I'll never say anything like that.",
        "source": "T04n0202_013:0441a13_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T04n0202_013:0441a13_4"
    },
    {
        "source_sentence": "夫殺生之罪，當入地獄，受諸苦惱，數千萬歲，常為鹿頭羊頭兔頭諸禽獸頭阿傍獄卒之所獵射，",
        "translation": "If someone commits the sin of killing, they'll go to hell and experience suffering for thousands of years. They'll always be hunted by deer-headed sheep, dog-headed rabbits, bird-headed animals, and lion-headed animals.",
        "source": "T04n0202_013:0441a13_5"
    },
    {
        "source_sentence": "無央數歲，雖思解脫。",
        "translation": "For an immeasurable number of years, he contemplated liberation even though he thought about it.",
        "source": "T04n0202_013:0441a16_6"
    },
    {
        "source_sentence": "其何由乎？」",
        "translation": "What is the reason for this?",
        "source": "T04n0202_013:0441a16_7"
    },
    {
        "source_sentence": "諸子白母：「如母所說，為自出心？",
        "translation": "The children said to their mother, As your mother said, is it because you're leaving your own mind?",
        "source": "T04n0202_013:0441a16_8"
    },
    {
        "source_sentence": "從他邊聞？」",
        "translation": "hear it from the side of others?",
        "source": "T04n0202_013:0441a17_9"
    },
    {
        "source_sentence": "母復告言：「吾昔從佛，聞如此事。」",
        "translation": "Again, his mother told him, I heard this story from the Buddha in the past.",
        "source": "T04n0202_013:0441a17_10"
    },
    {
        "source_sentence": "兒復問母：「佛者何人？",
        "translation": "Again, the boy asked his mother, Who's the Buddha?",
        "source": "T04n0202_013:0441a18_11"
    },
    {
        "source_sentence": "幸願具宣。」",
        "translation": "It's fortunate that it's fully proclaimed.",
        "source": "T04n0202_013:0441a19_12"
    },
    {
        "source_sentence": "母告諸子：「卿不聞乎？",
        "translation": "The mother told the children, Haven't you heard?",
        "source": "T04n0202_013:0441a19_13"
    },
    {
        "source_sentence": "迦維羅衛淨飯王子，形相炳著，應為聖王，厭老病死，出家學道，願行成就，",
        "translation": "The prince Kapilavastu, the pure rice king of Kapilavastu, should be the noble king, who is disgusted with old age, sickness, and death, renounces household life, trains in the path, and fulfills his vow.",
        "source": "T04n0202_013:0441a19_14"
    },
    {
        "source_sentence": "得無上果。",
        "translation": "They'll attain the unsurpassed fruit.",
        "source": "T04n0202_013:0441a21_15"
    },
    {
        "source_sentence": "巨身丈六，相好無比，三明六通，遐鑒無外，前知無窮，却知無極，觀知三世，",
        "translation": "His great body was sixteen feet in circumference and his features were incomparable. He possessed the three knowledges and the six supernatural powers and had no external or internal vision. Knowing as before, he knew without limit but knew infinitely. He perceived the past, present, and future.",
        "source": "T04n0202_013:0441a21_16"
    },
    {
        "source_sentence": "如掌中珠。」",
        "translation": "It's like the pearl in your palm.",
        "source": "T04n0202_013:0441a23_17"
    },
    {
        "source_sentence": "諸子聞之，心內欣然，因更問母：「佛今近遠，為可見不？」",
        "translation": "When the children heard this, they were delighted and asked their mother again, Is the Buddha visible from a distance now?",
        "source": "T04n0202_013:0441a24_0"
    },
    {
        "source_sentence": "母便答言：「今在舍衛。」",
        "translation": "The mother then answered, Now I'm in Śrāvastī.",
        "source": "T04n0202_013:0441a25_1"
    },
    {
        "source_sentence": "諸子啟母，求往覲佛，母即聽之，諸子同時，共詣舍衛。",
        "translation": "The children asked their mother to go to see the Buddha, and his mother heard them. All the children went together to Sāvatthī.",
        "source": "T04n0202_013:0441a25_2"
    },
    {
        "source_sentence": "其祖須達，見之情悅，倍加愛念，將至祇洹，奉覲如來。",
        "translation": "His grandfather, Sudarśana, was delighted by the sight and doubled his affection for it. He was about to go to Jetavana to pay his respects to the Tathāgata.",
        "source": "T04n0202_013:0441a27_0"
    },
    {
        "source_sentence": "諸子見佛，姿好形貌，踰前所聞，數千萬倍，五情欣喜，不能自勝，佛因隨宜，",
        "translation": "The children saw the Buddha’s beautiful appearance, several tens of millions greater than what they had heard before. The five senses were delighted and could not control themselves.",
        "source": "T04n0202_013:0441a28_1"
    },
    {
        "source_sentence": "為說妙法，十人俱時，得法眼淨，便復白佛，求索出家。",
        "translation": "In order to explain the marvelous teaching, the ten people at once attained purity of the Dharma eye and then again said to the Buddha, requesting permission to leave home.",
        "source": "T04n0202_013:0441b01_2"
    },
    {
        "source_sentence": "佛問之曰：「汝父母聽不？」",
        "translation": "The Buddha asked him, Will your parents listen?",
        "source": "T04n0202_013:0441b02_3"
    },
    {
        "source_sentence": "答言：「未諮。」",
        "translation": "He replied, I haven't consulted him.",
        "source": "T04n0202_013:0441b02_4"
    },
    {
        "source_sentence": "佛言：「父母未聽，不得染化。」",
        "translation": "The Buddha said, If my parents haven't heard it, they won't be allowed to defile and transform.",
        "source": "T04n0202_013:0441b03_5"
    },
    {
        "source_sentence": "須達復言：「斯是我孫，我得自在，我今放之，於理亦可。」",
        "translation": "Again, Sudarśana said, This is my grandson, for whom I've gained sovereignty; now that I've released him, it's possible in principle.",
        "source": "T04n0202_013:0441b03_6"
    },
    {
        "source_sentence": "佛便允然，聽使為道。",
        "translation": "The Buddha then agreed, and listened to the messengers as his path.",
        "source": "T04n0202_013:0441b05_7"
    },
    {
        "source_sentence": "鬚髮自落，法衣在身，便成沙門，精勤大業，盡得羅漢。",
        "translation": "The hair on his beard fell off spontaneously, and while the robes of the Dharma remained in his body he became a śramaṇa. He exerted himself with great effort to obtain arhatship.",
        "source": "T04n0202_013:0441b05_8"
    },
    {
        "source_sentence": "斯十比丘，甚相欽敬，行則俱進，住在同處，國中人民，莫不宗戴。",
        "translation": "These ten bhikṣus were greatly esteemed and respected by all the people in their respective countries. All of them, as soon as they set out for religious practice, lived together in the same monastery; everyone in the country cherished this veneration.",
        "source": "T04n0202_013:0441b06_9"
    },
    {
        "source_sentence": "阿難白佛：「此十比丘，有何福慶，生在貴家，容貌奇特，遭值世尊，",
        "translation": "Ānanda said to the Buddha: What blessedness have these ten bhikṣus acquired that they were born in a noble family and their appearance was so extraordinary that they happened to meet the World-honored One.",
        "source": "T04n0202_013:0441b08_10"
    },
    {
        "source_sentence": "盡於苦際？」",
        "translation": "At the end of suffering?",
        "source": "T04n0202_013:0441b09_11"
    },
    {
        "source_sentence": "佛告阿難：「乃往過去九十一劫，有毘婆尸佛，出現於世，教化畢訖，",
        "translation": "The Buddha said to Ānanda: Ninety-one past aeons ago, Vipaśyin Buddha appeared in the world and completed his spiritual edification.",
        "source": "T04n0202_013:0441b10_12"
    },
    {
        "source_sentence": "而般涅槃，分布舍利，起無量塔。",
        "translation": "He entered parinirvāṇa, distributed the relics, and built an immeasurable stūpa.",
        "source": "T04n0202_013:0441b11_13"
    },
    {
        "source_sentence": "時有一塔，朽故崩壞，有一老母，而修治之。",
        "translation": "At the time, there was a stūpa that had been decayed and disintegrated by an old mother who repaired it.",
        "source": "T04n0202_013:0441b12_14"
    },
    {
        "source_sentence": "有年少十人，偶行覩見，問老母曰：『何所施為？』",
        "translation": "There were ten young men who happened to see each other and asked the old mother, 'What's the gift?'",
        "source": "T04n0202_013:0441b13_15"
    },
    {
        "source_sentence": "老母語言：『斯是尊塔，功德彌弘，是以修補，欲望善果。』",
        "translation": "The old mother said, 'This is a venerable stūpa whose merits are so vast that it's cultivated and desired for good results.'",
        "source": "T04n0202_013:0441b14_16"
    },
    {
        "source_sentence": "年少歡喜，助共興功，所作已竟，誓為母子，其十年少，願共同生。",
        "translation": "The children rejoiced, wishing to help each other perform their duties. Having completed what they had to do, they made a vow to be mothers and children; when they were ten years old they wished to be born together.",
        "source": "T04n0202_013:0441b15_17"
    },
    {
        "source_sentence": "從是已來，九十一劫，天上人中，恒為俱生，受福快樂，常有三事，勝於餘人：一者形體端正，",
        "translation": "In the ninety-first cosmic age after that, they will always be born together with gods and humans. They will experience merit and happiness. They are always superior to other people in three ways:",
        "source": "T04n0202_013:0441b17_18"
    },
    {
        "source_sentence": "二者眾所敬愛，三者恒得長壽。",
        "translation": "Two, they're respected by the multitude, and three, they'll always attain long life.",
        "source": "T04n0202_013:0441b19_19"
    },
    {
        "source_sentence": "經爾許時，不墮三塗，今遇我世，沐浴清化，諸塵垢盡，咸逮應真。",
        "translation": "At that point, he won't fall into the three destinies, but now when he meets me in my world, he's bathed and transformed, and all the dust and dirt has ended, fully comprehending what should be true.",
        "source": "T04n0202_013:0441b20_20"
    },
    {
        "source_sentence": "欲知爾時老母者，今蘇曼女是。",
        "translation": "I want to know that the old mother of that time is now Sumeru's daughter.",
        "source": "T04n0202_013:0441b21_21"
    },
    {
        "source_sentence": "爾時十年少者，今十羅漢是。」",
        "translation": "Those who were ten years old at the time are now the ten arhats.",
        "source": "T04n0202_013:0441b22_22"
    },
    {
        "source_sentence": "佛說此時，其在大會，有得須陀洹、斯陀含、阿那含、阿羅漢者，發大乘意逮不退者，",
        "translation": "When the Buddha had discoursed thus, there were those in the assembly who had attained stream-entry, once-returner, non-returner, and arhatship. Those who had undertaken the aspiration for enlightenment but did not turn away from it.",
        "source": "T04n0202_013:0441b23_0"
    },
    {
        "source_sentence": "信受佛語，歡喜奉行。",
        "translation": "They believed in the Buddha’s words and joyfully carried them out.",
        "source": "T04n0202_013:0441b24_1"
    },
    {
        "source_sentence": "（六六）婆世躓品第五十九(丹本為六十六)",
        "translation": "(6) The Fifty-fifty-sixth Chapter of the Vasiṣṭha (the Dan edition is sixty-six)",
        "source": "T04n0202_013:0441b26_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在羅閱祇耆闍崛山中。",
        "translation": "Thus I have heard: One time, the Buddha was staying on Mount Rājagṛdhrakūṭa.",
        "source": "T04n0202_013:0441b27_0"
    },
    {
        "source_sentence": "于時此國有豪富長者，名尸利躓，其家大富，七寶盈溢。",
        "translation": "At the time, there was a wealthy elder named Śāriputra in this country, and his family was so wealthy that seven treasures filled it up.",
        "source": "T04n0202_013:0441b27_1"
    },
    {
        "source_sentence": "其婦懷妊，月滿生男，形容嚴妙，世之少雙。",
        "translation": "The queen was pregnant and gave birth to a boy when the full moon came. His appearance was marvelous and rare in the world.",
        "source": "T04n0202_013:0441b29_2"
    },
    {
        "source_sentence": "父母喜慶，深用自幸，便請相師，令占吉凶。",
        "translation": "The parents were delighted and felt deeply fortunate, so they invited a soothsayer to divine the fortune and misfortune.",
        "source": "T04n0202_013:0441c01_3"
    },
    {
        "source_sentence": "相師占已，語其二親：「斯子福德，榮煥宗族。」",
        "translation": "After the soothsayer had divined it, he said to his two relatives, This is a son of great merit and prosperous family.",
        "source": "T04n0202_013:0441c02_4"
    },
    {
        "source_sentence": "長者益歡，情在無量，因復勸請，便為立字。",
        "translation": "The elder became increasingly joyful, and his feelings were immeasurable. As he was again exhorted, he uttered the words of praise for him.",
        "source": "T04n0202_013:0441c03_5"
    },
    {
        "source_sentence": "相師問曰：「從有此兒，有何瑞應？」",
        "translation": "The master of signs asked, What's the auspicious sign that comes from having this child?",
        "source": "T04n0202_013:0441c04_6"
    },
    {
        "source_sentence": "長者報曰：「其母本來，訥口鈍辭，既懷此兒，談語巧妙，踰倍於常。」",
        "translation": "The elder replied, His mother was originally a dull-mouthed and dull-mouthed woman who harbored this child, whose words were more skillful than usual.",
        "source": "T04n0202_013:0441c05_7"
    },
    {
        "source_sentence": "便為作字，號婆世躓。",
        "translation": "He then composed a word for him, and he was called Vasiṣṭha.",
        "source": "T04n0202_013:0441c06_8"
    },
    {
        "source_sentence": "年歲已大，聰才邈群，與其等輩，遊行觀看，見那羅伎家，有一女子，",
        "translation": "As the boy grew up he became a man of great intelligence and talent. He was accompanied by his companions, who were all engaged in various activities such as walking and watching.",
        "source": "T04n0202_013:0441c07_9"
    },
    {
        "source_sentence": "面貌淨潔，暉容希偶，心便染著，欲得娉娶。",
        "translation": "Their features are pure and clean, and their radiant appearance is so rare that the mind becomes defiled with desire to marry them.",
        "source": "T04n0202_013:0441c08_10"
    },
    {
        "source_sentence": "歸啟父母：「願為求索。」",
        "translation": "He returned to his parents and asked, May I ask for it?",
        "source": "T04n0202_013:0441c09_11"
    },
    {
        "source_sentence": "父母告言：「吾是貴姓，彼是凡賤，高卑非匹，如何為婚？」",
        "translation": "The parents told him, I'm a noble family, they're worldlings and people of lowly families, and the high and low aren't equal; how can we marry?",
        "source": "T04n0202_013:0441c10_12"
    },
    {
        "source_sentence": "子情深愛，不能自釋，重更啟言：「莫問門戶，但論其身，幸垂顧愍，",
        "translation": "The children were deeply attached to him and could not explain their feelings. They repeatedly said, “Do not ask me about the door; let us talk only about my own body.",
        "source": "T04n0202_013:0441c11_13"
    },
    {
        "source_sentence": "哀為我求。",
        "translation": "I'm sorry to ask for it for my sake.",
        "source": "T04n0202_013:0441c12_14"
    },
    {
        "source_sentence": "若不如志，便自殞命。」",
        "translation": "If you don't do as you wish, you'll die yourself.",
        "source": "T04n0202_013:0441c13_15"
    },
    {
        "source_sentence": "父母從之，遣人往求。",
        "translation": "His parents followed him and sent someone to search for him.",
        "source": "T04n0202_013:0441c13_16"
    },
    {
        "source_sentence": "彼家報言：「君是大姓，我是小人，素非疇偶，何緣得爾？」",
        "translation": "The family replied, You're a big family, and I'm a small person; what is the reason you're allowed to do so?",
        "source": "T04n0202_013:0441c14_17"
    },
    {
        "source_sentence": "其兒慇懃，情猶不息，復更遣信，重從索之。",
        "translation": "His feelings of anger were still unquenchable, so he sent another letter and again asked for his money.",
        "source": "T04n0202_013:0441c15_18"
    },
    {
        "source_sentence": "彼家答言：「若能如我，習種種術，歌舞戲笑，悉令備知，及於王前，",
        "translation": "The householder replied, “If you can follow my example and learn all kinds of skills like me, such as singing, dancing, playing, and laughing, I will let you know.",
        "source": "T04n0202_013:0441c16_19"
    },
    {
        "source_sentence": "試使得中，然後乃當共作婚姻。」",
        "translation": "Let's try to make it so, and then we'll be married together.",
        "source": "T04n0202_013:0441c18_20"
    },
    {
        "source_sentence": "兒惑其色，不恥鄙事，即詣彼家，學習戲藝；",
        "translation": "The children, perplexed by their physical appearance and not ashamed of their unscrupulous deeds, immediately went to that house to learn the arts and games.",
        "source": "T04n0202_013:0441c18_21"
    },
    {
        "source_sentence": "數時之間，皆已成就。",
        "translation": "In a few moments, they've all accomplished it.",
        "source": "T04n0202_013:0441c19_22"
    },
    {
        "source_sentence": "是時國王，集諸那羅，上幢投窓，空中索走，如是種種眾多戲事。",
        "translation": "The king of that country then gathered the Nārāyaṇas, raised their banners and threw them into the window, and fled up in the air, thus performing many kinds of playful acts.",
        "source": "T04n0202_013:0441c20_23"
    },
    {
        "source_sentence": "時長者子，亦往王邊，次應現伎，上索而走，索走既竟，王脫不見，復勅更上，",
        "translation": "The son of the wealthy man then went to the king’s side. Next, he showed his trick and ran upstairs. Having run upstairs, the king got off and did not see him.",
        "source": "T04n0202_013:0441c21_24"
    },
    {
        "source_sentence": "奉命為之，氣力漸劣，中道欲墮，心中惶懅，無所歸依。",
        "translation": "I ordered him to do so, but his energy gradually weakened and he was about to fall into the intermediate path. His heart trembled in fear and he had no refuge.",
        "source": "T04n0202_013:0441c23_25"
    },
    {
        "source_sentence": "尊者目連，陵虛至邊，而告之曰：「如卿今日，寧全身命，出家學道？",
        "translation": "Venerable Maudgalyāyana climbed up to the edge of the air and said to him, “Suppose you were to renounce family life today in order to study the path.",
        "source": "T04n0202_013:0441c25_0"
    },
    {
        "source_sentence": "為寧墮地，娶彼女耶？」",
        "translation": "Why would you rather fall into the ground and marry a woman?",
        "source": "T04n0202_013:0441c26_1"
    },
    {
        "source_sentence": "尋報之言：「願自存濟，不用女也。」",
        "translation": "He replied, I wish to save myself and not use a woman.",
        "source": "T04n0202_013:0441c27_2"
    },
    {
        "source_sentence": "目連即時，於虛空中，化作平地，其人見已，情怖便止，因地而下，得全身首。",
        "translation": "Immediately, Maudgalyāyana flew up into the air and magically created a level ground. Seeing this, the man was frightened and went down because of the earth; his hair stood on end all over his body.",
        "source": "T04n0202_013:0441c27_3"
    },
    {
        "source_sentence": "既蒙安隱，喜不自勝，隨逐目連，往詣世尊，禮拜供養。",
        "translation": "Having gained peace and comfort, he was overcome with joy and displeasure. Following Maudgalyāyana, he went to the World-honored One to venerate and make offerings to him.",
        "source": "T04n0202_013:0441c29_4"
    },
    {
        "source_sentence": "佛於是時，廣說妙論，所謂論者，施論、戒論、生天之論，欲為不淨，",
        "translation": "At that time, the Buddha extensively taught a wonderful doctrine called “treatise” on generosity, morality, rebirth in heaven, and desire as impurity.",
        "source": "T04n0202_013:0442a01_5"
    },
    {
        "source_sentence": "出要最快，心意暢解，便得初果。",
        "translation": "The quickest way out is to attain the first realization with a mind that's fluent and understanding.",
        "source": "T04n0202_013:0442a03_6"
    },
    {
        "source_sentence": "因復白佛：「願得出家，奉修正法。」",
        "translation": "He then again said to the Buddha, May I leave home and follow the correct teaching.",
        "source": "T04n0202_013:0442a04_7"
    },
    {
        "source_sentence": "世尊聽之，鬚髮自落，法衣在身，便成沙門。",
        "translation": "When the World-honored One heard this, his hair stood on end and his hair stood on end. His religious robes remained on his body, and he became a śramaṇa.",
        "source": "T04n0202_013:0442a04_8"
    },
    {
        "source_sentence": "比丘專精禪思，遵修正業，諸漏得盡，成阿羅漢。",
        "translation": "A monk who focuses his mind on meditation and contemplation, follows the cultivation of good actions, ends the contaminants, and becomes an arhat.",
        "source": "T04n0202_013:0442a06_0"
    },
    {
        "source_sentence": "慧命阿難，前白佛言：「婆世躓沙門，往昔之時，與彼女子，有何因緣，",
        "translation": "Ānanda the Wise One asked Ānanda, “O Vāseṭṭha, what was the reason you and that woman’s son were once together in the past with a śramaṇa?",
        "source": "T04n0202_013:0442a07_1"
    },
    {
        "source_sentence": "心染惑著，幾致危沒？",
        "translation": "When the mind is defiled by passions and attachments, how many dangers do they cause?",
        "source": "T04n0202_013:0442a08_2"
    },
    {
        "source_sentence": "復共目連，造何善因，今蒙其恩，而獲寧濟？",
        "translation": "Again, what good cause did he share with Maudgalyāyana that now thanks to his kindness he has been able to attain peace and relief?",
        "source": "T04n0202_013:0442a09_3"
    },
    {
        "source_sentence": "復何因緣，自致應真？」",
        "translation": "Again, what are the causes and conditions that will cause them to become true on their own?",
        "source": "T04n0202_013:0442a10_4"
    },
    {
        "source_sentence": "佛告阿難：「乃往過去無量之劫，波羅[木*奈]國，有大長者，初生一子，",
        "translation": "The Buddha said to Ānanda: In an immeasurable kalpa ago, in the country of Benares there was a wealthy merchant named Mahāprajāpaṇiṣṭacāritra.",
        "source": "T04n0202_013:0442a10_5"
    },
    {
        "source_sentence": "端正無比。",
        "translation": "Their appearance is incomparable.",
        "source": "T04n0202_013:0442a12_6"
    },
    {
        "source_sentence": "當于是時，其家有人，從海中來，齎一鳥卵，用奉長者。",
        "translation": "At the time, a man of his family came from the ocean with an egg and a bird to offer it to the elder.",
        "source": "T04n0202_013:0442a12_7"
    },
    {
        "source_sentence": "長者納受，經少時間，其卵便剖，出一鳥鶵，毛羽光潤。",
        "translation": "A little while after the elder had accepted it, his eggs were cut open and a chick emerged, with its hair and feathers shining and moistened.",
        "source": "T04n0202_013:0442a13_8"
    },
    {
        "source_sentence": "長者愛之，與子使弄，漸漸長大，互相懷念。",
        "translation": "The wealthy man loved him and played with his children. As they grew up, they thought of each other in affection.",
        "source": "T04n0202_013:0442a15_9"
    },
    {
        "source_sentence": "時長者子，騎鳥背上，鳥便擔飛，處處遊觀，情既滿厭，還歸其舍，日日如是。",
        "translation": "The wealthy man's son, riding on the back of a bird, then flew with its burden and traveled to various places to look around. Being disgusted, he returned to his dwelling, and so did day after day.",
        "source": "T04n0202_013:0442a16_10"
    },
    {
        "source_sentence": "經歷多時，其長者子，聞他國王作那羅戲，便乘斯鳥，往至彼間，來下觀看，",
        "translation": "After a long while, the wealthy man’s son heard that the king of another kingdom was playing with Nāra. So he boarded this bird and came down to look at it.",
        "source": "T04n0202_013:0442a17_11"
    },
    {
        "source_sentence": "鳥住樹上。",
        "translation": "The bird was staying on a tree.",
        "source": "T04n0202_013:0442a19_12"
    },
    {
        "source_sentence": "偶見王女，情便染愛。",
        "translation": "On rare occasions he saw the queen’s daughter and became attached to her.",
        "source": "T04n0202_013:0442a19_13"
    },
    {
        "source_sentence": "其時遣信，騰說情狀，王女然可，便與共交。",
        "translation": "He then sent a letter to express his feelings, and the king's daughter said yes, so he had sexual intercourse with her.",
        "source": "T04n0202_013:0442a20_14"
    },
    {
        "source_sentence": "作事不密，為王所知，遣人推捕，尋時獲得，縛束其身，而當斬戮。",
        "translation": "Knowing that his actions were not secret, the king sent men to apprehend him. They found him at the time and bound him in a fetter so that he would be executed.",
        "source": "T04n0202_013:0442a21_15"
    },
    {
        "source_sentence": "長者子言：『諸君何為，勞力殺我？",
        "translation": "The wealthy man's son said, 'What are you doing killing me with effort?'",
        "source": "T04n0202_013:0442a22_16"
    },
    {
        "source_sentence": "聽我上樹自投而死。』",
        "translation": "He listened to me as I climbed up a tree and died on my own.'",
        "source": "T04n0202_013:0442a23_17"
    },
    {
        "source_sentence": "諸人聽許，便起攀枝而上，乘騎其鳥，翔虛而去。",
        "translation": "The people who listened to the instruction rose from their postures, climbed up a branch of the tree, rode on the bird, flew in midair, and departed.",
        "source": "T04n0202_013:0442a24_18"
    },
    {
        "source_sentence": "因此鳥故，得延壽命。」",
        "translation": "Because of this bird, he'll be able to prolong his life.",
        "source": "T04n0202_013:0442a25_19"
    },
    {
        "source_sentence": "佛告阿難：「彼時長者子，今婆世躓是。",
        "translation": "The Buddha told Ānanda, That was the elder's son at that time, and now it's Vātsīputrīya.",
        "source": "T04n0202_013:0442a25_20"
    },
    {
        "source_sentence": "爾時王女者，今伎家女是。",
        "translation": "At the time, the king's daughter was the daughter of the present-day Kukkuṭika family.",
        "source": "T04n0202_013:0442a26_21"
    },
    {
        "source_sentence": "爾時鳥者，則目連是。",
        "translation": "The bird at the time was Maudgalyāyana.",
        "source": "T04n0202_013:0442a27_22"
    },
    {
        "source_sentence": "過去世時，惑色致困，由鳥得濟；",
        "translation": "In a past life the gods were afflicted by the defilement of physical matter and suffered from starvation. Their distress was relieved by birds.",
        "source": "T04n0202_013:0442a27_23"
    },
    {
        "source_sentence": "今復貪色，垂當死亡，由目連故，致得安隱。",
        "translation": "Now, he's also addicted to form and will surely die, but it's because of Maudgalyāyana that he'll attain peace.",
        "source": "T04n0202_013:0442a28_24"
    },
    {
        "source_sentence": "其婆世躓，所說聰辯，成無漏者，乃往過去，波羅[木*奈]國，有一居士，",
        "translation": "In the country of Benares there lived a householder named Vātsīputrīya, who was wise and eloquent in what he taught. Having attained uncontaminated intelligence, he traveled to the distant past.",
        "source": "T04n0202_013:0442a29_25"
    },
    {
        "source_sentence": "見辟支佛，來從乞飯。",
        "translation": "Seeing the pratyekabuddha, he came and begged for food.",
        "source": "T04n0202_013:0442b02_26"
    },
    {
        "source_sentence": "居士即時，以食施與，因復勸請，令說經法。",
        "translation": "The householder immediately gave the food as an offering and then again encouraged him to explain the sūtras and teachings.",
        "source": "T04n0202_013:0442b02_27"
    },
    {
        "source_sentence": "其辟支佛，辭云不能，擲鉢虛空，騰踊而逝。",
        "translation": "The pratyekabuddha said, “I can’t.” Tossed his bowl into the air in midair, he rose up and passed away.",
        "source": "T04n0202_013:0442b03_28"
    },
    {
        "source_sentence": "居士念曰：『斯人神力，變化無方，然其不能敷宣道化；",
        "translation": "The householder thought to himself, “Through the supernatural power of these people’s magical creations there is no limit to how many miracles they can perform. Yet they are unable to expound the Teaching.",
        "source": "T04n0202_013:0442b04_29"
    },
    {
        "source_sentence": "願我後生，遭值聖尊，勝於此士，巨億萬倍，演散法義，無窮無盡，令我身者，",
        "translation": "“May I be born in a future existence and meet the holy ones. Being superior to those who are like this man, billions of myriads of times more numerous, I will expound the meaning of the Teaching without end or endlessly so as to enable them to reach me.” The Buddha said:",
        "source": "T04n0202_013:0442b06_0"
    },
    {
        "source_sentence": "亦獲果證。』",
        "translation": "They'll also attain fruition.'",
        "source": "T04n0202_013:0442b07_1"
    },
    {
        "source_sentence": "由此因緣，今世聰明，逮羅漢果。」",
        "translation": "Because of these causes and conditions, he's so intelligent in the present life that he attains the fruit of the arhat.",
        "source": "T04n0202_013:0442b08_2"
    },
    {
        "source_sentence": "佛說是時，莫不歡喜，有得須陀洹、斯陀含、阿那含、阿羅漢者，有種緣覺善根者，",
        "translation": "When the Buddha said this, none of them rejoiced. Some had attained stream-entry, some once-returned, some non-returners, and some arhats, while some had planted the roots of goodness of pratyekabuddhas.",
        "source": "T04n0202_013:0442b08_3"
    },
    {
        "source_sentence": "發菩薩心者，皆信佛語，頂戴奉行。",
        "translation": "Those who give rise to the bodhisattva aspiration all believe in the Buddha's words and venerate them with their heads held high.",
        "source": "T04n0202_013:0442b10_4"
    },
    {
        "source_sentence": "（六七）優波毱提品第六十(丹本為六十七)",
        "translation": "(67) Upagupta's Chapter 60 (The Sanskrit version is sixty-seventh)",
        "source": "T04n0202_013:0442b12_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_013:0442b13_0"
    },
    {
        "source_sentence": "爾時此國有一梵志，字阿巴毱提，聰明廣學，採古達今，往至佛所，求作沙門，",
        "translation": "At that time there was a brāhmaṇa in this country named Avatantī, intelligent and widely learned. He took up the ancient teachings of the present and went to the place where the Buddha was staying sought to become a śramaṇa.",
        "source": "T04n0202_013:0442b14_0"
    },
    {
        "source_sentence": "因復啟曰：「若我出家，智慧辯才，與舍利弗等者，情則甘樂；",
        "translation": "He then asked again, “If I renounced the householder’s life and became a bhikṣu like Śāriputra, imbued with wisdom and eloquence, my mind would be filled with delight.",
        "source": "T04n0202_013:0442b15_1"
    },
    {
        "source_sentence": "若當不如，便自歸家。」",
        "translation": "If he doesn't, then he'll return home.",
        "source": "T04n0202_013:0442b17_2"
    },
    {
        "source_sentence": "佛尋答曰：「卿不如也。」",
        "translation": "The Buddha investigated and answered, You're not like that.",
        "source": "T04n0202_013:0442b17_3"
    },
    {
        "source_sentence": "時彼梵志，止不作道，還歸其舍。",
        "translation": "The priest then stopped and didn't make a path, returning to his house.",
        "source": "T04n0202_013:0442b18_4"
    },
    {
        "source_sentence": "世尊於後，告眾會言：「我滅度已，一百歲中，此婆羅門，而當深化，",
        "translation": "Later, the World-honored One said to the assembly of bhikṣus: Having entered nirvana, within one hundred years after my parinirvāṇa this brāhmaṇa will be enlightened.",
        "source": "T04n0202_013:0442b19_5"
    },
    {
        "source_sentence": "逮成六通，智慧高遠，教化眾生，其數如塵。」",
        "translation": "He has attained the six supernormal powers, and his wisdom is so lofty that he teaches sentient beings, which are as numerous as dust.",
        "source": "T04n0202_013:0442b20_6"
    },
    {
        "source_sentence": "佛涅槃時，告阿難言：「我滅度後，一切經藏，悉付囑汝，汝當受持廣使流布。」",
        "translation": "When the Buddha entered nirvāṇa, he told Ānanda, After my parinirvāṇa, all the sūtras and stores will be entrusted to you, and you will accept and uphold them and spread them.",
        "source": "T04n0202_013:0442b21_7"
    },
    {
        "source_sentence": "世尊既滅，阿難持法。",
        "translation": "After the Bhagavān had ceased, Ānanda maintained the teaching.",
        "source": "T04n0202_013:0442b23_8"
    },
    {
        "source_sentence": "阿難後時，復欲捨身，告弟子耶貰羈言：「我去世後，所有典要，汝當護持。」",
        "translation": "Later, Ānanda again wanted to abandon his body and told his disciple Yaśodharā, After I die, you must guard all the essentials of the scriptures that you have.",
        "source": "T04n0202_013:0442b23_9"
    },
    {
        "source_sentence": "因復告曰：「波羅[木*奈]國，當有居士字為毱提，此人有子，名優波毱提。",
        "translation": "He then again told them, “In the country of Vārāṇasī there will be a householder named Upagupta. This man has a son called Upagupta.",
        "source": "T04n0202_013:0442b25_10"
    },
    {
        "source_sentence": "卿好求索，度用為道；",
        "translation": "You like to seek and ask for things, but the path consists of practicing moderation.",
        "source": "T04n0202_013:0442b27_11"
    },
    {
        "source_sentence": "卿若壽終，以法付之。」",
        "translation": "If your life ends, you'll entrust it to him with the Dharma.",
        "source": "T04n0202_013:0442b27_12"
    },
    {
        "source_sentence": "阿難滅已，此耶貰羈，奉持佛法，遊化世間，所度甚多。",
        "translation": "After the parinirvāṇa of Ānanda, this Yaśodharā preserved the buddha-dharma and sojourned in the world to edify many people.",
        "source": "T04n0202_013:0442b28_13"
    },
    {
        "source_sentence": "復至波羅[木*奈]，往造居士，與共相識，數數往來。",
        "translation": "Again, he went to Vārāṇasī and built a householder's dwelling, became acquainted with him together, and came and went again and again.",
        "source": "T04n0202_013:0442b29_14"
    },
    {
        "source_sentence": "其彼居士，生一男兒，字阿巴毱提，年在幼稚。",
        "translation": "That householder gave birth to a boy named Avatantī, who was in his youth.",
        "source": "T04n0202_013:0442c01_15"
    },
    {
        "source_sentence": "于時耶貰羈，往從索之，欲使為道。",
        "translation": "Yaśodharā then went to ask for it, wanting to make it the Way.",
        "source": "T04n0202_013:0442c02_16"
    },
    {
        "source_sentence": "其父答曰：「始有一子，當紹門戶，不可爾也，若後更生，便用相給。」",
        "translation": "The father answered, First, there's a son who should keep the door open for him; he can't do so; if he comes back to life later, he'll give it to them.",
        "source": "T04n0202_013:0442c03_17"
    },
    {
        "source_sentence": "後復生男，字難陀毱提。",
        "translation": "He was later reborn as a boy named Nandamati.",
        "source": "T04n0202_013:0442c05_0"
    },
    {
        "source_sentence": "時耶貰羈，復往從索，其父報言：「大子營外，次子營內，於其家居，",
        "translation": "Yaśodharā then went back and begged again. His father replied, “The elder son is going to stay at home while the younger one is away from home.",
        "source": "T04n0202_013:0442c05_1"
    },
    {
        "source_sentence": "乃可興隆。",
        "translation": "It's then that it can flourish.",
        "source": "T04n0202_013:0442c07_2"
    },
    {
        "source_sentence": "情中戀惜，未能相許，若後更有，信當奉惠。」",
        "translation": "They cherish it in their hearts and aren't able to give it to each other, and if there's another one after that, they'll be faithful and generous.",
        "source": "T04n0202_013:0442c07_3"
    },
    {
        "source_sentence": "此耶貰羈，是阿羅漢，三明具足，能知人根，觀此二兒，與道無緣，亦自息意，",
        "translation": "This Yamântaka is an arhat who is endowed with the three knowledges. He knows the human faculties and observes that these two sons have no connection with the [Buddhist] Way (i.e., the path) and thus can also restrain their thoughts.",
        "source": "T04n0202_013:0442c08_4"
    },
    {
        "source_sentence": "不慇懃求。",
        "translation": "He doesn't beg for it.",
        "source": "T04n0202_013:0442c10_5"
    },
    {
        "source_sentence": "時彼居士復更生男，顏貌端妙，形相殊特。",
        "translation": "The householder then again gave birth to a boy with a beautiful appearance and distinctive features.",
        "source": "T04n0202_013:0442c10_6"
    },
    {
        "source_sentence": "時耶貰羈，復往從索。",
        "translation": "Yao received the precepts and went back to pay his respects.",
        "source": "T04n0202_013:0442c11_7"
    },
    {
        "source_sentence": "其父報曰：「兒今猶小，未能奉事，又復家貧，無以餉送。",
        "translation": "The father said in reply, “My son is still too small to serve you. My family is also poor and there is no way to send him off.",
        "source": "T04n0202_013:0442c11_8"
    },
    {
        "source_sentence": "且欲停之，須大當與。」",
        "translation": "If you want to stop it, you must give it to me.",
        "source": "T04n0202_013:0442c13_9"
    },
    {
        "source_sentence": "年漸長大，才器益盛，父付財物，居肆販賣。",
        "translation": "As the boy grew up, his talent increased. His father entrusted him with property and he lived in a marketplace to sell it.",
        "source": "T04n0202_013:0442c13_10"
    },
    {
        "source_sentence": "時耶貰羈，往到其邊，而為說法，教使繫念，以白黑石子用當籌算，善念下白，",
        "translation": "Yaśodharā then went to the side of the road and preached the Dharma for him. He instructed his attendants to fix their thoughts, counting the white and black stone coins with which they would have to settle the account.",
        "source": "T04n0202_013:0442c14_11"
    },
    {
        "source_sentence": "惡念下黑。",
        "translation": "It's black below bad thoughts.",
        "source": "T04n0202_013:0442c16_12"
    },
    {
        "source_sentence": "優婆毱提奉受其教，善惡之念，輙投石子，初黑偏多，白者甚少，漸漸修習，",
        "translation": "Upagupta accepted his instruction and, being mindful of what was good and bad, he threw the bowl into a rock. At first it was black in color but mostly white; there were very few white people who cultivated it gradually.",
        "source": "T04n0202_013:0442c16_13"
    },
    {
        "source_sentence": "白黑正等，繫念不止，更無黑石，純有白者。",
        "translation": "White, black, and so forth, don't stop being tethered by mindfulness, and there's no black or white stone that purely has whiteness.",
        "source": "T04n0202_013:0442c18_14"
    },
    {
        "source_sentence": "善念已盛，逮得初果。",
        "translation": "Once the good thoughts have flourished, they'll attain the first fruit.",
        "source": "T04n0202_013:0442c19_15"
    },
    {
        "source_sentence": "時彼城中，有婬女人，遣婢持錢，往從買花。",
        "translation": "At the time, there was a promiscuous woman in that city who sent a maidservant with money to buy flowers from her.",
        "source": "T04n0202_013:0442c20_16"
    },
    {
        "source_sentence": "優波毱提，心性質直，饒與其花，不令有恨。",
        "translation": "Upagupta's mind was straightforward by nature, and he gave it to the flower so that there wouldn't be any anger.",
        "source": "T04n0202_013:0442c21_17"
    },
    {
        "source_sentence": "婢齎花歸，婬女甚怪，問其婢言：「前日買花，用錢一種，往何以少？",
        "translation": "The maidservant returned with the flowers, and the promiscuous woman was very surprised. She asked the maidservant, “The day before yesterday I bought flowers for a penny; why did you send me so little?",
        "source": "T04n0202_013:0442c22_18"
    },
    {
        "source_sentence": "今何以多？",
        "translation": "Why is it so numerous now?",
        "source": "T04n0202_013:0442c23_19"
    },
    {
        "source_sentence": "將無前時相欺減乎？」",
        "translation": "Will there be no deceitfulness in the past?",
        "source": "T04n0202_013:0442c24_0"
    },
    {
        "source_sentence": "婢答之言：「今日花主，慈仁守禮，平等相與，所以饒獲。",
        "translation": "The maidservant replied, Today, the flower owner is so kind and courteous that they give it equally to each other. That's why he gives them a generous reward.",
        "source": "T04n0202_013:0442c24_1"
    },
    {
        "source_sentence": "又復其人，形體殊妙，大家若見，復不有恨。」",
        "translation": "Furthermore, that person's form and body are marvelous, and if everyone sees them, there won't be any anger.",
        "source": "T04n0202_013:0442c25_2"
    },
    {
        "source_sentence": "婬女聞之，遣信請喚。",
        "translation": "The promiscuous woman heard this and sent a letter to summon him.",
        "source": "T04n0202_013:0442c26_3"
    },
    {
        "source_sentence": "優波毱提，自抑不往，又復延召，終不從命。",
        "translation": "Upagupta suppressed himself and didn't go there, and after further summoning him, he never obeyed his order.",
        "source": "T04n0202_013:0442c27_4"
    },
    {
        "source_sentence": "于時婬女，與王家兒，而共交通，貪其衣服眾寶所成，利興義衰，殺而藏之。",
        "translation": "The promiscuous woman then went on a conversation with the king's children, craving their clothing made of various treasures for profit and loss, killing them and hiding them.",
        "source": "T04n0202_013:0442c28_5"
    },
    {
        "source_sentence": "王家搜覓，於其舍得，尋取婬女，斬截手足，劓其耳鼻，懸於高標，竪置塜間，",
        "translation": "The king’s householders searched the monastery for her and found her in his dwelling. They found a promiscuous woman, who was beheaded, had her hands and feet mutilated, her ears and nose severed, and hung up on a high signpost.",
        "source": "T04n0202_013:0443a01_6"
    },
    {
        "source_sentence": "雖荷此苦，然未命終。",
        "translation": "Even though he suffers this pain, his life doesn't end.",
        "source": "T04n0202_013:0443a03_0"
    },
    {
        "source_sentence": "優波毱提，往到其所，婬女謂言：「往者端正，不肯相見，今日形殘，",
        "translation": "Upagupta approached her. The promiscuous maidservant said to her, “Your companions are so good-looking that you won’t see them.",
        "source": "T04n0202_013:0443a03_1"
    },
    {
        "source_sentence": "何所看乎？」",
        "translation": "What's to be seen?",
        "source": "T04n0202_013:0443a05_0"
    },
    {
        "source_sentence": "尋即對曰：「吾不愛色，而來至此，用相憐故，來到此耳。」",
        "translation": "He then said, I don't love form, so I came here; it's because of my pity for you that I came here.",
        "source": "T04n0202_013:0443a05_1"
    },
    {
        "source_sentence": "因為宣說四非常法。",
        "translation": "It's because they proclaim the four extraordinary qualities.",
        "source": "T04n0202_013:0443a06_2"
    },
    {
        "source_sentence": "「是身不淨苦空無我，一一諦察，有何可恃？",
        "translation": "This body is impure, painful, empty, and without self, so what can we rely on when we examine it one by one?",
        "source": "T04n0202_013:0443a07_0"
    },
    {
        "source_sentence": "愚惑之徒，妄生染想。」",
        "translation": "Those who are foolish and confused will falsely give rise to defiled conceptions.",
        "source": "T04n0202_013:0443a08_0"
    },
    {
        "source_sentence": "婬女聞法，逮法眼淨，優波毱提，成阿那含。",
        "translation": "When a promiscuous woman hears the Dharma and acquires purity of the Dharma eye, Upagupta becomes non-returner.",
        "source": "T04n0202_013:0443a08_1"
    },
    {
        "source_sentence": "時耶世羈，復從居士，索此少年，用作沙彌；",
        "translation": "Yaśodharā then asked the householder to make this youthful boy a novice.",
        "source": "T04n0202_013:0443a09_2"
    },
    {
        "source_sentence": "奉教持與。",
        "translation": "They were taught, maintained, and given to him.",
        "source": "T04n0202_013:0443a10_3"
    },
    {
        "source_sentence": "將至精舍，授其十戒，年滿二十，便授具足，白四羯磨竟，得阿羅漢道，",
        "translation": "He was about to go to the monastery and gave him the ten precepts. When he was twenty years old, he then taught them in full. After completing the fourfold religious service, he attained the path of arhatship.",
        "source": "T04n0202_013:0443a10_4"
    },
    {
        "source_sentence": "三明六通，皆悉滿具，言辭巧妙，所演無窮，便集眾人，欲為說法。",
        "translation": "They are endowed with all the three knowledges and six supernatural powers, speak eloquently and skillfully. What they teach has no limit. So they assemble to preach for the sake of sentient beings.",
        "source": "T04n0202_013:0443a12_5"
    },
    {
        "source_sentence": "時魔波旬，於會處所，而雨金錢。",
        "translation": "Māra Pāpīyān then rained money at the place where the assembly was held.",
        "source": "T04n0202_013:0443a13_6"
    },
    {
        "source_sentence": "眾人競拾，竟不聞法。",
        "translation": "People rushed to collect the relics but they could not hear the Dharma.",
        "source": "T04n0202_013:0443a14_7"
    },
    {
        "source_sentence": "於第二日，復集大眾，魔雨花鬘，以亂眾心。",
        "translation": "On the second day they again assembled the assembly, and Māra showered flowers and garlands to disturb the minds of the assembly.",
        "source": "T04n0202_013:0443a15_8"
    },
    {
        "source_sentence": "於第三日，復更集大眾，魔王便化作一大象，紺琉璃色，口有六牙，其一牙上，",
        "translation": "On the third day he assembled the assembly again. The king of Māra transformed himself into a great elephant, dark blue and lapis lazuli in color, with six tusks:",
        "source": "T04n0202_013:0443a16_9"
    },
    {
        "source_sentence": "有七浴池，其浴池中，有七蓮花，一一蓮花上，有七玉女，斯諸玉女，",
        "translation": "There are seven bathing ponds. In each of the pools there are seven lotus blossoms, and on top of each flower there are seven jadelike maidens:",
        "source": "T04n0202_013:0443a18_10"
    },
    {
        "source_sentence": "皆作伎樂，其象優遊徐步會側，眾人顧目，情不在法。",
        "translation": "They all played music, and the elephants traveled leisurely to the side of the assembly. All the people looked at them but their emotions were not attached to the Dharma.",
        "source": "T04n0202_013:0443a19_11"
    },
    {
        "source_sentence": "於第四日，復集大眾，魔王復化作一女人，端正美妙，侍立尊後，眾人注目，",
        "translation": "On the fourth day, he assembled the assembly. The king of Māra again transformed himself into a woman, beautiful and handsome, who stood before the venerable one. Everyone paid attention to her.",
        "source": "T04n0202_013:0443a21_0"
    },
    {
        "source_sentence": "忽忘法事。",
        "translation": "Suddenly, he forgets the Dharma service.",
        "source": "T04n0202_013:0443a22_1"
    },
    {
        "source_sentence": "于時尊者，尋化其女，令作白骨；",
        "translation": "The venerable one then transformed the woman into white bones.",
        "source": "T04n0202_013:0443a23_0"
    },
    {
        "source_sentence": "眾人見已乃專聽法，得道者眾。",
        "translation": "When the people saw this, they listened exclusively to the Dharma and those who had attained the Way were numerous.",
        "source": "T04n0202_013:0443a23_1"
    },
    {
        "source_sentence": "尊者本來，有一狗子，日日於耳，竊為說法。",
        "translation": "Venerable Ānanda, originally there was a dog that lived in my ears day by day and preached the Dharma for me.",
        "source": "T04n0202_013:0443a24_2"
    },
    {
        "source_sentence": "其狗命終，生第六天與魔波旬，共坐一床。",
        "translation": "When the dog died, he was born in the sixth heaven and sat on a single bed with Māra Pāpīyān.",
        "source": "T04n0202_013:0443a25_3"
    },
    {
        "source_sentence": "魔王思惟：「此天大德，乃與我等，為從何沒而來生此？」",
        "translation": "The king of Māra thought, This is the great virtuous god who gave it to us, so where did he die and come to be born here?",
        "source": "T04n0202_013:0443a26_4"
    },
    {
        "source_sentence": "尋觀察之，知從狗身。",
        "translation": "Observing it, he knows it's from the dog's body.",
        "source": "T04n0202_013:0443a27_5"
    },
    {
        "source_sentence": "「彼沙門者，相辱乃爾。」",
        "translation": "That ascetic is so disrespectful to himself.",
        "source": "T04n0202_013:0443a28_6"
    },
    {
        "source_sentence": "遙伺尊者入禪定時，持一寶冠，著其頭上。",
        "translation": "When the venerable entered meditation, he held a jeweled crown and placed it on his head.",
        "source": "T04n0202_013:0443a28_7"
    },
    {
        "source_sentence": "既從定起，覺頂有冠，尋便思察，知魔所為，即以神力，感魔使來，化其狗屍，",
        "translation": "Knowing what the devil was doing, he summoned an envoy by divine power to come and transformed the dog into a corpse.",
        "source": "T04n0202_013:0443a29_8"
    },
    {
        "source_sentence": "令似髴飾，而告魔言：「汝遺我冠，深謝來意；",
        "translation": "He caused them to look like ornaments and told the Māra, “Please leave me with my crown.",
        "source": "T04n0202_013:0443b02_9"
    },
    {
        "source_sentence": "今以髴飾，用相酬贈。」",
        "translation": "Now, we'll decorate it with silk and use it to reward each other.",
        "source": "T04n0202_013:0443b03_10"
    },
    {
        "source_sentence": "魔王受已，便還天上，而見所著乃是死狗，心中厭惡而欲去之，盡其神力不能令却。",
        "translation": "Having accepted it, the king of Māra returned to heaven and saw that what he was clinging to was a dead dog. Being disgusted with anger in his heart, he wished to drive it away but could not do so by exhausting his supernatural powers.",
        "source": "T04n0202_013:0443b04_11"
    },
    {
        "source_sentence": "復詣帝釋，求除不淨。",
        "translation": "Again, he went to Tīrṣa and begged to remove the impure.",
        "source": "T04n0202_013:0443b06_12"
    },
    {
        "source_sentence": "帝釋報言：「其作此者，斯人能捨，非是吾力之所任却。」",
        "translation": "Śakra replied, That person who does this will be able to abandon it; it's not something that I can do.",
        "source": "T04n0202_013:0443b06_13"
    },
    {
        "source_sentence": "魔王復去，廣問諸天乃至梵天，向之喜言：「願除茲穢。」",
        "translation": "Again, Māra King departed and asked the gods and even the Brahma gods in detail, pleasing them, May I remove this defilement?",
        "source": "T04n0202_013:0443b08_14"
    },
    {
        "source_sentence": "各答如初，非力所辦。",
        "translation": "Each answer is like the first, which isn't accomplished by force.",
        "source": "T04n0202_013:0443b09_15"
    },
    {
        "source_sentence": "事不獲已，來詣尊者，而謂言曰：「佛實大德，慈心無邊；",
        "translation": "When they had not obtained anything, they came to the venerable and said: The Buddha is indeed a great virtuous one.",
        "source": "T04n0202_013:0443b09_16"
    },
    {
        "source_sentence": "諸聲聞輩，誠為凶忌。",
        "translation": "The śrāvakas are really bad and fearful.",
        "source": "T04n0202_013:0443b11_17"
    },
    {
        "source_sentence": "何以驗之？",
        "translation": "What's the way to test it?",
        "source": "T04n0202_013:0443b11_18"
    },
    {
        "source_sentence": "我乃昔日，將諸魔兵凡十八億，攻圍菩薩，欲敗其道，猶懷慈悲，不以為怨；",
        "translation": "In the past I led eighteen billion myriads of armies of Māra and attacked the enemy bodhisattvas. Wishing to defeat them in battle, I harbored compassion and did not think it was an enemy.",
        "source": "T04n0202_013:0443b12_0"
    },
    {
        "source_sentence": "我今小觸，相困乃爾。」",
        "translation": "Now that I've touched them a little, they'll be stuck in each other.",
        "source": "T04n0202_013:0443b13_1"
    },
    {
        "source_sentence": "尊者答言：「理實如是。",
        "translation": "The venerable replied, So it is in principle.",
        "source": "T04n0202_013:0443b14_2"
    },
    {
        "source_sentence": "佛之於我，百千萬倍，不可為喻，如須彌山比彼芥子，如大海水方於牛跡，",
        "translation": "The Buddha is a hundred million times greater than I am, and cannot be compared to me. Just as the polar mountain is like a mustard seed that grows on the surface of water in the great ocean at the footprints of an ox,",
        "source": "T04n0202_013:0443b14_3"
    },
    {
        "source_sentence": "如師子王喻於野干，大小之形，實不相及。」",
        "translation": "It's like the lion king metaphor of a wilderness, whose size and shape are really not the same.",
        "source": "T04n0202_013:0443b16_4"
    },
    {
        "source_sentence": "尊者語魔：「吾生末世，不見如來。",
        "translation": "The Venerable said to Māra, I was born in the latter part of my life and didn't see the Tathāgata.",
        "source": "T04n0202_013:0443b17_5"
    },
    {
        "source_sentence": "聞汝神力能化作佛，試為一現，我欲觀之。」",
        "translation": "I've heard that your miraculous powers can transform you into a buddha, so please try to make one appearance, and I want to see it.",
        "source": "T04n0202_013:0443b18_6"
    },
    {
        "source_sentence": "魔王答言：「我今化現，慎莫為禮。」",
        "translation": "The king of Māra replied, Now that I'm transforming myself, be careful not to pay homage.",
        "source": "T04n0202_013:0443b19_7"
    },
    {
        "source_sentence": "對曰：「不禮。」",
        "translation": "He said, I won't pay homage.",
        "source": "T04n0202_013:0443b20_8"
    },
    {
        "source_sentence": "是時魔王化身作佛，軀體丈六，紫磨金色，三十二相、八十種好，光明赫弈，",
        "translation": "At that time Māra King manifested himself as a buddha, sixteen feet in height with a body of purplish-gold color, thirty-two marks and eighty secondary signs, shining brightly and brilliantly.",
        "source": "T04n0202_013:0443b20_9"
    },
    {
        "source_sentence": "踰倍日月。",
        "translation": "It's more than twice as long as the sun and moon.",
        "source": "T04n0202_013:0443b22_10"
    },
    {
        "source_sentence": "尊者欣悅，便前稽首。",
        "translation": "The venerable was delighted and bowed his head in respect.",
        "source": "T04n0202_013:0443b22_11"
    },
    {
        "source_sentence": "魔還復形，語尊者言：「向云不禮，今作禮何？」",
        "translation": "Again, Māra regained his form and said to the venerable, Did you say that you didn't pay homage, but what do you now?",
        "source": "T04n0202_013:0443b22_12"
    },
    {
        "source_sentence": "尊者答言：「我自禮佛，不禮於汝。」",
        "translation": "The venerable replied, I bow to the Buddha myself and don't bow to you.",
        "source": "T04n0202_013:0443b24_0"
    },
    {
        "source_sentence": "魔復謝曰：「唯願矜愍，却此死狗。」",
        "translation": "Again, Māra apologized and said, Please take pity on me and get rid of this dead dog.",
        "source": "T04n0202_013:0443b24_1"
    },
    {
        "source_sentence": "尊者告曰：「汝起慈心，擁護群生，則此死狗，變成寶飾；",
        "translation": "The venerable one said, “If you have compassion and protect all living beings, this dead dog will turn into a jeweled ornament.",
        "source": "T04n0202_013:0443b25_2"
    },
    {
        "source_sentence": "若懷惡意，則作狗屍。」",
        "translation": "If you harbor bad intentions, you'll become a dog or a corpse.",
        "source": "T04n0202_013:0443b26_3"
    },
    {
        "source_sentence": "魔以畏故，恒發善想。",
        "translation": "Because of their fear, Māra always gives rise to good thoughts.",
        "source": "T04n0202_013:0443b27_4"
    },
    {
        "source_sentence": "是時尊者成道已後，所化眾生，得四果者，一人一籌，籌長四寸，如此之籌，",
        "translation": "At that time, after the World-honored One had accomplished enlightenment, each of the sentient beings who were his disciples attained four fruits:",
        "source": "T04n0202_013:0443b27_5"
    },
    {
        "source_sentence": "滿於一房，房高六丈，縱廣亦爾。",
        "translation": "Each room was sixteen feet in height and the length and width of each room was the same.",
        "source": "T04n0202_013:0443b29_6"
    },
    {
        "source_sentence": "於是眾人白尊者言：「尊者福德，實為弘博，化度群萌，不可稱數。」",
        "translation": "The people then said to the venerable, Venerable, Your virtue is really vast and extensive, and it transforms and liberates all sentient beings that can't be counted.",
        "source": "T04n0202_013:0443c01_7"
    },
    {
        "source_sentence": "尊者告曰：「吾為畜生時，亦化眾生，使得聖果，何況今日？」",
        "translation": "The venerable told him, When I was an animal, I also transformed sentient beings and made them a holy fruit, so why wouldn't today?",
        "source": "T04n0202_013:0443c02_8"
    },
    {
        "source_sentence": "眾會白言：「不審先世，所度云何？」",
        "translation": "The assembled people said, I don't know what I did in a previous life.",
        "source": "T04n0202_013:0443c04_9"
    },
    {
        "source_sentence": "尊者告曰：「乃往過去，波羅[木*奈]國，有一仙山，五百辟支佛，",
        "translation": "The venerable monk said, “In the distant past in the country of Benares there was a holy mountain where five hundred pratyekabuddhas lived.",
        "source": "T04n0202_013:0443c04_10"
    },
    {
        "source_sentence": "止住其中。",
        "translation": "He stops and abides there.",
        "source": "T04n0202_013:0443c06_11"
    },
    {
        "source_sentence": "時有獼猴，日來供養，奉覲儀容。",
        "translation": "At that time a rhesus monkey came to the monastery every day to pay his respects and venerate him.",
        "source": "T04n0202_013:0443c06_12"
    },
    {
        "source_sentence": "諸辟支佛，後盡涅盤，復有五百梵志，續在中止。",
        "translation": "When the pratyekabuddhas entered nirvana, there were five hundred brahmins who continued to live in the monastery.",
        "source": "T04n0202_013:0443c07_13"
    },
    {
        "source_sentence": "諸梵志等，或事日月，或復事火，事日月者，翹脚向之，其事火者，朝夕燃之。",
        "translation": "The priests and others may serve the sun and moon, or they may serve fire. Those who serve the sun and moon will stand cross-legged facing them; those who serve fire will be burned in the morning and evening.",
        "source": "T04n0202_013:0443c08_14"
    },
    {
        "source_sentence": "時彼獼猴，見其翹脚，便取挽下，見其燃火，便取滅之。",
        "translation": "When that monkey saw him standing with legs crossed, he took it and pulled it down; and when he saw a burning fire, he extinguished it.",
        "source": "T04n0202_013:0443c10_15"
    },
    {
        "source_sentence": "獼猴于時，端坐思惟。",
        "translation": "At the time, the monkey sat upright and thought.",
        "source": "T04n0202_013:0443c11_16"
    },
    {
        "source_sentence": "諸梵志見，自相謂言：『此獼猴者，將為我曹示茲威儀。』",
        "translation": "Seeing this, the priests said to each other, 'This monkey will show me his manner.'",
        "source": "T04n0202_013:0443c11_17"
    },
    {
        "source_sentence": "尋各整身，諦察真理，心意開解，盡得辟支佛道。",
        "translation": "Each searched his body, examined the truth, opened his mind and intellect, and fully attained the path of the pratyekabuddhas.",
        "source": "T04n0202_013:0443c13_18"
    },
    {
        "source_sentence": "彼獼猴者，我身是也。」",
        "translation": "That monkey is me.",
        "source": "T04n0202_013:0443c14_19"
    },
    {
        "source_sentence": "眾會復白：「以何因緣，受獼猴身？」",
        "translation": "Again, the assembly asked, What's the reason for accepting the monkey's body?",
        "source": "T04n0202_013:0443c14_20"
    },
    {
        "source_sentence": "尊者告曰：「乃往過去九十一劫，有毘婆尸佛，出現于世，有諸比丘，",
        "translation": "The venerable monk said: Ninety-one world ages ago, Vipaśyin Buddha appeared in the world.",
        "source": "T04n0202_013:0443c15_21"
    },
    {
        "source_sentence": "在波羅[木*奈]仙山中住。",
        "translation": "He was staying at the monastery on Mount Vārāṇasī.",
        "source": "T04n0202_013:0443c17_22"
    },
    {
        "source_sentence": "時有應真，登上山巔，放脚輕疾。",
        "translation": "At the time, there was a man of true response who climbed up the mountain and released his feet with little illness.",
        "source": "T04n0202_013:0443c17_23"
    },
    {
        "source_sentence": "有一年少道人，而作是言：『彼行飄速，正似獼猴。』",
        "translation": "There was a young monk of the Way for a year who said, 'That monkey's movement is as fast as that of a rhesus monkey.'",
        "source": "T04n0202_013:0443c18_24"
    },
    {
        "source_sentence": "由此因緣，五百世中，常作獼猴。",
        "translation": "Because of these causes and conditions, he always became a rhesus monkey for five hundred generations.",
        "source": "T04n0202_013:0443c19_25"
    },
    {
        "source_sentence": "以是之故，凡在四輩，應自護口，勿妄出言。」",
        "translation": "Because of this, everyone in the four groups should guard their mouths themselves and not speak falsely.",
        "source": "T04n0202_013:0443c20_26"
    },
    {
        "source_sentence": "尊者優波毱提，說此法時，一切大會，有得須陀洹、斯陀含、阿那含、阿羅漢者，",
        "translation": "Venerable Upagupta, when he taught this teaching, in all the great assemblies there were those who had attained stream-entry, sakṛdāgāminship, non-returner, and arhatship.",
        "source": "T04n0202_013:0443c21_27"
    },
    {
        "source_sentence": "種緣覺善根者，發大乘心逮不退者，不可稱計，信受其教，歡喜奉行。",
        "translation": "Those who plant the good roots of pratyekabuddha and those who give rise to the great vehicle mind and acquire nonretrogression can't be counted, believe in their teaching, rejoice, and practice it.",
        "source": "T04n0202_013:0443c23_28"
    },
    {
        "source_sentence": "（六八）汪水中虫品第六十一(丹本為六十八)",
        "translation": "(Skt. sixty-eight) The Sixty-first Chapter of the Insects in the Great Ocean (the Dan edition is sixty-eight)",
        "source": "T04n0202_013:0443c25_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在羅閱祇耆闍崛山中。",
        "translation": "Thus I have heard: One time, the Buddha was staying on Mount Rājagṛdhrakūṭa.",
        "source": "T04n0202_013:0443c26_0"
    },
    {
        "source_sentence": "爾時城邊，有一汪水，污泥不淨，多諸糞穢，屎尿臭處。",
        "translation": "At the edge of the city, there was a pool of water that polluted the mud and made it impure, with plenty of dung and filthy excrement and foul-smelling urine.",
        "source": "T04n0202_013:0443c26_1"
    },
    {
        "source_sentence": "國中人民，凡鄙之類，恒以瑕穢，投歸其中。",
        "translation": "The people of the country, ordinary and vulgar creatures, always cast their filthy clothes into it.",
        "source": "T04n0202_013:0443c28_2"
    },
    {
        "source_sentence": "有一大虫，其形像蛇，加有四足，於其汪水，東西馳走，或沒或出，經歷年載，",
        "translation": "There was a large worm, shaped like a snake with four legs that flew east and west in the pond; it would sometimes go down or come out. For many years it did so.",
        "source": "T04n0202_013:0443c29_3"
    },
    {
        "source_sentence": "常處其中，受苦無量。",
        "translation": "They always stay there, and the suffering they experience is immeasurable.",
        "source": "T04n0202_013:0444a02_0"
    },
    {
        "source_sentence": "爾時世尊，將諸比丘，前後圍遶，至彼坑所，問諸比丘：「汝等頗識此虫宿緣所造行不？」",
        "translation": "It was then that the Bhagavān gathered the monks, surrounded them in front and behind him, went to the pit, asked the monks, Do you know the actions created by this insect for constellate reasons?",
        "source": "T04n0202_013:0444a02_1"
    },
    {
        "source_sentence": "時諸比丘，咸皆思量，無有能知斯所造行。",
        "translation": "The monks then all deliberated, and there was no one who could know what they did.",
        "source": "T04n0202_013:0444a04_2"
    },
    {
        "source_sentence": "俱共白佛，皆云：「不知。」",
        "translation": "They all told the Buddha together, and they all said, I don't know.",
        "source": "T04n0202_013:0444a05_3"
    },
    {
        "source_sentence": "時佛告曰：「汝等當聽！",
        "translation": "The Buddha then told them, You must listen!",
        "source": "T04n0202_013:0444a06_0"
    },
    {
        "source_sentence": "吾當為汝說斯所造行。",
        "translation": "I will explain for you the actions they create.",
        "source": "T04n0202_013:0444a06_1"
    },
    {
        "source_sentence": "過去有佛，名毘婆尸，出現於世，教化已周，遷神涅槃。",
        "translation": "In the past there was a buddha named Vipaśyin who appeared in the world. Having completed his edification, he transmigrated and entered nirvana.",
        "source": "T04n0202_013:0444a07_2"
    },
    {
        "source_sentence": "彼佛法中，有十萬比丘，淨修梵行，閑居樂靜，依於一山。",
        "translation": "Among the Buddha’s teachings, there were one hundred thousand monks who practiced pure and genuine austerity. They lived in seclusion and enjoyed peace and quietude; they relied on a single mountain for their support.",
        "source": "T04n0202_013:0444a08_3"
    },
    {
        "source_sentence": "其山左右，有好林樹，華果茂盛蓊欝無比，其諸樹間，流泉浴池，清涼可樂。",
        "translation": "To the left and right of the mountain there are luxuriant forest trees with incomparable flowers and fruit. Between these trees flows a fountain and bathing pond, which is cool and pleasant.",
        "source": "T04n0202_013:0444a09_4"
    },
    {
        "source_sentence": "時諸比丘，依慕住止，遵善行道，懃修不懈，悉具初果，乃至四果，無有凡夫。",
        "translation": "The monks then relied on it to abide, followed the path of good conduct, diligently cultivated it without slackening, and fully possessed the first realization up to the fourth realization, which had no ordinary people.",
        "source": "T04n0202_013:0444a11_5"
    },
    {
        "source_sentence": "時有五百估客，共相合集，欲入大海，發引徑路，經由此山，見諸比丘剋心精懃，",
        "translation": "At that time five hundred appraisers assembled together to enter the great sea and proceeded on their way. Having passed through this mountain, they saw the bhikṣus beating their hearts and agitating their minds.",
        "source": "T04n0202_013:0444a13_6"
    },
    {
        "source_sentence": "內懷欣敬，思欲設供。",
        "translation": "With affection and respect, they wished to make offerings.",
        "source": "T04n0202_013:0444a15_7"
    },
    {
        "source_sentence": "時諸賈客，共相合率，往請眾僧，求索供養；",
        "translation": "The merchants and travelers then assembled together, invited the monks, and begged to make offerings.",
        "source": "T04n0202_013:0444a15_8"
    },
    {
        "source_sentence": "值諸檀越，各各已請，日日相次，竟不從意。",
        "translation": "Each of the donors had already invited him, but he didn't comply with their wishes day after day.",
        "source": "T04n0202_013:0444a16_9"
    },
    {
        "source_sentence": "即詣眾僧，辭入大海。",
        "translation": "He then went to the saṃgha and withdrew into the great sea.",
        "source": "T04n0202_013:0444a17_10"
    },
    {
        "source_sentence": "『設我等眾，安隱來還，當設供養，願哀見許。』",
        "translation": "'Suppose we all of us were to come and return in peace, make offerings, and wish to be pitied and allowed to do so.'",
        "source": "T04n0202_013:0444a18_11"
    },
    {
        "source_sentence": "時僧默然，允可受請。",
        "translation": "The saṃgha remained silent and agreed to accept the invitation.",
        "source": "T04n0202_013:0444a19_12"
    },
    {
        "source_sentence": "眾賈入海，大獲珍寶，平安還至，到眾僧所，選眾妙寶最上價者，用施眾僧，",
        "translation": "The merchants entered the sea and obtained a great deal of precious treasures. They returned safely and arrived at the place where the monks were living. Choosing the highest price among the rare treasures, they gave them to the sangha.",
        "source": "T04n0202_013:0444a19_13"
    },
    {
        "source_sentence": "規俟飲食，若食多者，隨意用之。",
        "translation": "Regulations are to wait for food and drink, and if they eat a lot, they use it as they wish.",
        "source": "T04n0202_013:0444a21_14"
    },
    {
        "source_sentence": "於時眾僧受其寶物，持用付授僧摩摩帝。",
        "translation": "The saṃgha then accepted the treasure and handed it to Saṃmatī.",
        "source": "T04n0202_013:0444a22_15"
    },
    {
        "source_sentence": "於後眾僧，食具向盡，從其求索爾時珍寶，當用續食。",
        "translation": "When the food provisions for the later saṃgha are about to be exhausted, the treasures that they seek from them at that point in time will be used to continue eating.",
        "source": "T04n0202_013:0444a23_16"
    },
    {
        "source_sentence": "時摩摩帝，答眾僧言：『賈客前時，自與我寶，何緣乃索？』",
        "translation": "Māmatī then answered the saṃgha, 'In front of the merchant, he gave me my treasure, so why did he ask for it?'",
        "source": "T04n0202_013:0444a24_17"
    },
    {
        "source_sentence": "上座維那，語摩摩帝：『檀越前時，以寶施僧，令汝舉之。",
        "translation": "The superior monk Vairocana said to Māmatī, 'When you were giving the treasure to the saṃgha in front of the donor, I asked you to lift it up.",
        "source": "T04n0202_013:0444a25_18"
    },
    {
        "source_sentence": "今僧食盡，當用裨佐。』",
        "translation": "Now that the saṃgha has run out of food, he'll use it to help.'",
        "source": "T04n0202_013:0444a27_19"
    },
    {
        "source_sentence": "時摩摩帝，瞋恚而言：『汝曹噉屎！",
        "translation": "Māmatī then became angry and said, 'You stink!",
        "source": "T04n0202_013:0444a27_20"
    },
    {
        "source_sentence": "此寶是我所有，何緣乃索？』",
        "translation": "This treasure belongs to me, so why would I ask for it?'",
        "source": "T04n0202_013:0444a28_21"
    },
    {
        "source_sentence": "時彼眾僧，見摩摩帝已起惡意，即便散去。",
        "translation": "Seeing Māmati, the saṃgha then became angry and dispersed.",
        "source": "T04n0202_013:0444a28_22"
    },
    {
        "source_sentence": "由其欺僧惡口罵故，身壞命終，墮阿鼻獄，身常宛轉沸屎之中，歷九十二劫，",
        "translation": "Because they deceive the assembly, speak harshly and abusively, their bodies break up at death and they fall into the avīci hell. For ninety-two kalpas their bodies always revolve in boiling excrement.",
        "source": "T04n0202_013:0444a29_23"
    },
    {
        "source_sentence": "乃從獄出。",
        "translation": "He then came out of the hell.",
        "source": "T04n0202_013:0444b02_24"
    },
    {
        "source_sentence": "今復墮此屎尿池中，經歷年歲，未得解脫。",
        "translation": "Now they'll fall back into this lake of excrement and urine for years and years, but they won't be liberated.",
        "source": "T04n0202_013:0444b03_25"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T04n0202_013:0444b04_26"
    },
    {
        "source_sentence": "過去有佛，名曰尸棄，將諸比丘，臨過此坑，示諸弟子，為說本末。",
        "translation": "In the past, there was a buddha named Śikhin, who led the monks to this pit and showed his disciples how to explain the teachings for them.",
        "source": "T04n0202_013:0444b04_27"
    },
    {
        "source_sentence": "復次有佛，名曰隨葉，亦復將從諸比丘眾，往到其所，說其因緣，從此命終，",
        "translation": "“Furthermore, there was a buddha named Samantanetra. He also came to this place accompanied by the bhikṣus and explained the reasons why his life came to an end.",
        "source": "T04n0202_013:0444b06_0"
    },
    {
        "source_sentence": "還入地獄，經歷數萬億歲，其後命終復生是中。",
        "translation": "After going back into hell for thousands of myriads of koṭis of years, he'll be reborn here after his life ends.",
        "source": "T04n0202_013:0444b07_1"
    },
    {
        "source_sentence": "次復有佛，名曰拘留秦，亦共徒眾，圍遶至此坑，垂示諸比丘，說其本末。",
        "translation": "Next, there was another buddha named Krakucchanda, also surrounded by his disciples, who came to this pit and showed it to the monks so that they could tell their stories.",
        "source": "T04n0202_013:0444b08_2"
    },
    {
        "source_sentence": "次名拘那含牟尼佛，亦共弟子，來至此坑。",
        "translation": "The next buddha named Kanakamuni Buddha also came to this pit with his disciples.",
        "source": "T04n0202_013:0444b10_3"
    },
    {
        "source_sentence": "次迦葉佛，亦來至此，咸為弟子，說其因緣。",
        "translation": "The next buddha, Kāśyapa Buddha, also came to this monastery. All of them were his disciples and explained the reasons for their arrival.",
        "source": "T04n0202_013:0444b11_4"
    },
    {
        "source_sentence": "次第七佛，我釋迦牟尼，今示汝等因緣本末，觀視其虫。",
        "translation": "Next, the seventh buddha, I, Śākyamuni, will show you the causes and conditions for each of these worms.",
        "source": "T04n0202_013:0444b12_5"
    },
    {
        "source_sentence": "如是一切賢劫當來諸佛，各各皆爾，將諸弟子，到其坑所，指示其虫，",
        "translation": "In this way, all the buddhas of the future eon of enlightenment will be exactly like this. They will lead their disciples to a pit and point out the insects there.",
        "source": "T04n0202_013:0444b14_0"
    },
    {
        "source_sentence": "說其曩昔所造因緣。」",
        "translation": "He explains the causes and conditions that were created in the distant past.",
        "source": "T04n0202_013:0444b15_1"
    },
    {
        "source_sentence": "時諸比丘，聞佛所說，心驚毛竪，共相勅厲，慎護身口意業，信受佛語，",
        "translation": "When the bhikṣus heard what the Buddha taught them, their hair stood on end in fear and they all ordered others to do so. They guarded themselves against physical, verbal, and mental actions and believed those words of the Buddha.",
        "source": "T04n0202_013:0444b16_2"
    },
    {
        "source_sentence": "歡喜奉行。",
        "translation": "They rejoice and venerate it.",
        "source": "T04n0202_013:0444b17_3"
    },
    {
        "source_sentence": "（六九）沙彌均提品第六十二(丹本為六十九)",
        "translation": "(639) The Sixty-second Chapter of the Śrāmaṇeristic (The Sanskrit version is sixty-nine)",
        "source": "T04n0202_013:0444b18_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_013:0444b19_0"
    },
    {
        "source_sentence": "爾時尊者舍利弗，晝夜三時，恒以天眼，觀視世間，誰應度者，輙往度之。",
        "translation": "At the time, Venerable Śāriputra always observed the world with his divine eye three times a day and three times a night, and he went to save those who should be saved.",
        "source": "T04n0202_013:0444b20_0"
    },
    {
        "source_sentence": "爾時有諸估客，欲詣他國，其諸商人，共將一狗，至於中路。",
        "translation": "It was then that some appraisers wished to go to another country. The merchants together led a dog into the middle of the road.",
        "source": "T04n0202_013:0444b21_1"
    },
    {
        "source_sentence": "眾賈頓息，伺人不看閑靜之時，狗便盜取眾賈人肉。",
        "translation": "When the merchants suddenly stopped and waited for someone who didn't look at the quiet place, the dog stole to steal the flesh of the merchants.",
        "source": "T04n0202_013:0444b23_2"
    },
    {
        "source_sentence": "於時眾人即懷瞋恚，便共打狗，而折其脚，棄置空野，捨之而去。",
        "translation": "The people then became angry, beat the dog together, broke its legs, abandoned it in the open space, abandoned it, and departed.",
        "source": "T04n0202_013:0444b24_3"
    },
    {
        "source_sentence": "時舍利弗，遙以天眼，見此狗身，攣躃在地，飢餓困篤，懸命垂死，著衣持鉢，",
        "translation": "Śāriputra then saw the dog’s body from a distance with his divine eye. He was starving and in distress, dying while wearing his outer clothes and carrying his bowl.",
        "source": "T04n0202_013:0444b25_4"
    },
    {
        "source_sentence": "入城乞食，得已持出飛至狗所，慈心憐愍，以食施與。",
        "translation": "When he entered the city to solicit alms, he took it out and flew to the dog's place. With compassion and pity, he gave it food as an offering.",
        "source": "T04n0202_013:0444b27_5"
    },
    {
        "source_sentence": "狗得其食，濟活餘命，心甚歡喜，倍加踊躍。",
        "translation": "The dog, having obtained this food, survived and lived for the rest of its life. Being overjoyed, it doubled in speed and jumped again and again.",
        "source": "T04n0202_013:0444b28_6"
    },
    {
        "source_sentence": "時舍利弗，即為其狗，具足解說微妙之法，狗便命終，生舍衛國婆羅門家。",
        "translation": "Śāriputra then explained the subtle teaching to that dog, who was born in the brahman's house in Sāvatthī when his dog died.",
        "source": "T04n0202_013:0444b29_7"
    },
    {
        "source_sentence": "時舍利弗，獨行乞食，婆羅門見，而問之言：「尊者獨行，無沙彌耶？」",
        "translation": "When Śāriputra was walking alone to solicit alms, the Brāhmaṇa saw him and asked, Venerable, is there a śrāmaṇer who walks alone?",
        "source": "T04n0202_013:0444c02_8"
    },
    {
        "source_sentence": "舍利弗言：「我無沙彌，聞卿有子，當用見與。」",
        "translation": "Śāriputra said, I don't have a novice, but when you hear that you have a child, you must give him to me with your views.",
        "source": "T04n0202_013:0444c04_9"
    },
    {
        "source_sentence": "婆羅門言：「我有一子字曰均提，年既孩幼，不任使令。",
        "translation": "The brāhmaṇa said, “I have a son named Jyoti, who is too young to serve as my envoy.",
        "source": "T04n0202_013:0444c05_10"
    },
    {
        "source_sentence": "比前長大，當用相與。」",
        "translation": "They'll be given to each other when they grow up as compared to the previous one.",
        "source": "T04n0202_013:0444c06_11"
    },
    {
        "source_sentence": "時舍利弗，聞彼語已，即戢在心，還至祇洹。",
        "translation": "Having heard these words, Śāriputra was disheartened and returned to Jīvaka.",
        "source": "T04n0202_013:0444c06_12"
    },
    {
        "source_sentence": "至年七歲，復來求之。",
        "translation": "When he was seven years old, he came back to ask for it again.",
        "source": "T04n0202_013:0444c07_13"
    },
    {
        "source_sentence": "時婆羅門，即以其兒，付舍利弗，令使出家。",
        "translation": "The Brāhmaṇa then gave his child to Śāriputra and asked him to leave home.",
        "source": "T04n0202_013:0444c08_14"
    },
    {
        "source_sentence": "時舍利弗，便受其兒，將至祇洹，聽為沙彌，漸為具說種種妙法，心意開解，",
        "translation": "Śāriputra then accepted his child and was about to go to Jeta. He listened to the śrāmaṇerīs who gradually taught him all kinds of wonderful doctrines in order to enlighten his mind.",
        "source": "T04n0202_013:0444c09_15"
    },
    {
        "source_sentence": "得阿羅漢，六通清徹，功德悉備。",
        "translation": "Attaining arhatship, he had the six supernormal powers of purity and penetration and was fully endowed with virtue.",
        "source": "T04n0202_013:0444c11_16"
    },
    {
        "source_sentence": "時均提沙彌，始得道已，自以智力，觀過去世，本造何行，來受此形，",
        "translation": "When the śrāmaṇer Kauṇḍinya had just attained enlightenment, he observed by means of his own supernormal knowledge what past deeds he had done in a past life and how he came to receive their form.",
        "source": "T04n0202_013:0444c12_0"
    },
    {
        "source_sentence": "得遭聖師，而獲果證？",
        "translation": "Can you meet a noble teacher and attain fruition?",
        "source": "T04n0202_013:0444c13_1"
    },
    {
        "source_sentence": "觀見前身，作一餓狗，蒙我和上舍利弗恩，今得人身，并獲道果。",
        "translation": "Observing his former body, he became a hungry dog and was given to me by the above-mentioned Śāriputra, who now obtains a human body and attains the fruit of the path.",
        "source": "T04n0202_013:0444c14_2"
    },
    {
        "source_sentence": "欣心內發，而自念言：「我蒙師恩，得脫諸苦，今當盡身供給所須，永作沙彌，",
        "translation": "With a mind imbued with joy, he thought to himself, “I have been blessed by my teacher in liberating myself from all kinds of suffering. Now I will provide for the needs of my body and become a śrāmaṇer without ever leaving home.",
        "source": "T04n0202_013:0444c15_3"
    },
    {
        "source_sentence": "不受大戒。」",
        "translation": "They won't accept the great precepts.",
        "source": "T04n0202_013:0444c17_4"
    },
    {
        "source_sentence": "爾時阿難，而白佛言：「不審此人，曩昔之時，興何惡行，受此狗身？",
        "translation": "It was then that Ānanda said to the Buddha, I don't know what bad actions this person did in the distant past to receive the body of this dog.",
        "source": "T04n0202_013:0444c17_5"
    },
    {
        "source_sentence": "造何善根，而得解脫？」",
        "translation": "What good roots did you create to attain liberation?",
        "source": "T04n0202_013:0444c19_6"
    },
    {
        "source_sentence": "佛告阿難：「乃往過去迦葉佛時，有諸比丘，集在一處。",
        "translation": "The Buddha told Ānanda, In the past, at the time of Kāśyapa Buddha, there were monks who had gathered in one place.",
        "source": "T04n0202_013:0444c19_7"
    },
    {
        "source_sentence": "時年少比丘，音聲清雅，善巧讚唄，人所樂聽。",
        "translation": "The sound of the young bhikṣu’s voice was pure and elegant. Skillfully singing his praises, the people delighted in listening to them.",
        "source": "T04n0202_013:0444c20_8"
    },
    {
        "source_sentence": "有一比丘，年高耆老，音聲濁鈍，不能經唄，每自出聲，而自娛樂。",
        "translation": "There was a bhikṣu who was old and unable to recite the sutra. He always composed his own words, enjoying himself by himself.",
        "source": "T04n0202_013:0444c22_0"
    },
    {
        "source_sentence": "其老比丘，已得羅漢，沙門功德，皆悉具足。",
        "translation": "The old bhikṣu had already attained arhatship and was endowed with the qualities of a śramaṇa.",
        "source": "T04n0202_013:0444c23_1"
    },
    {
        "source_sentence": "于時年少妙音比丘，見老沙門音聲鈍濁，自恃好聲，而呵之言：『今汝長老，",
        "translation": "The young bhikṣu Miaosun, seeing that the old śramaṇa’s voice was dull and muffled, braved his good voice and rebuked him, saying:",
        "source": "T04n0202_013:0444c24_2"
    },
    {
        "source_sentence": "聲如狗吠。』",
        "translation": "The sound is like a dog barking.'",
        "source": "T04n0202_013:0444c26_3"
    },
    {
        "source_sentence": "輕呵已竟，時老比丘，便呼年少：『汝識我不？』",
        "translation": "After he had finished scolding him, the old monk then called out to the young man, 'Do you know me?'",
        "source": "T04n0202_013:0444c26_4"
    },
    {
        "source_sentence": "年少答言：『我大識汝，汝是迦葉佛時比丘。』",
        "translation": "The young man replied, 'I know you well; you were the monk at the time of Kāśyapa Buddha.'",
        "source": "T04n0202_013:0444c27_5"
    },
    {
        "source_sentence": "上座答曰：『我今已得阿羅漢道，沙門儀式，悉具足矣。』",
        "translation": "The superior monk answered, 'Now that I've attained the path of the arhat, the ascetic's rituals are complete.'",
        "source": "T04n0202_013:0444c28_6"
    },
    {
        "source_sentence": "時年少比丘，聞其所說，心驚毛竪，惶怖自責，即於其前，懺悔過咎。",
        "translation": "When the young bhikṣu heard what he said, his hair stood on end in fear and he repented.",
        "source": "T04n0202_013:0444c29_7"
    },
    {
        "source_sentence": "時老比丘，即聽懺悔。",
        "translation": "The old monk then listened and repented.",
        "source": "T04n0202_013:0445a02_8"
    },
    {
        "source_sentence": "由其惡言，五百世中，常受狗身；",
        "translation": "Because of these evil words, they will always receive the bodies of dogs for five hundred world ages.",
        "source": "T04n0202_013:0445a02_9"
    },
    {
        "source_sentence": "由其出家持淨戒故，今得見我，蒙得解脫」。",
        "translation": "Because he left home and observed pure precepts, he's now able to see me and attain liberation.",
        "source": "T04n0202_013:0445a03_10"
    },
    {
        "source_sentence": "爾時阿難，聞佛所說，歡喜信受，頂戴奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, Ānanda was delighted and believed it. He carried it with his palms joined and remembered it well.",
        "source": "T04n0202_013:0445a04_11"
    },
    {
        "source_sentence": "賢愚經卷第十三",
        "translation": "Sutra of Good and Evil, Volume 13",
        "source": "T04n0202_013:0445a06_0"
    }
]