[
    {
        "source_sentence": "出曜經卷第三十",
        "translation": "出曜經卷第三十",
        "source": "T04n0212_030:0770c09_0"
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian's translation",
        "source": "T04n0212_030:0770c11_0"
    },
    {
        "source_sentence": "梵志品之二",
        "translation": "two parts of the class of brahmins",
        "source": "T04n0212_030:0770c12_0"
    },
    {
        "source_sentence": "　◎若見侵欺，　　但念守戒，　　端身自調，",
        "translation": "If someone sees an encroachment or deceit, they simply observe the precepts with mindfulness, adjust their bodies and self-control,",
        "source": "T04n0212_030:0770c13_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0770c14_0"
    },
    {
        "source_sentence": "若復有人所見侵欺，不興惡懷有瞋怒意，守戒多聞降伏意識，身正影直心平道存。",
        "translation": "Again, if someone is seen to be deceiving and doesn't give rise to bad thoughts with angry thoughts, observes precepts that are well-versed and subdue the thinking consciousnesses, and their body is correctly shaped like a straightforward mind in which the path exists.",
        "source": "T04n0212_030:0770c15_0"
    },
    {
        "source_sentence": "是故說曰，若見侵欺，但念守戒，端身自調，是謂梵志。",
        "translation": "Therefore, it's said, 'If someone sees an encroachment but simply observes the precepts with mindfulness and self-control of their body, this is called a priest.'",
        "source": "T04n0212_030:0770c16_1"
    },
    {
        "source_sentence": "　世所善惡，　　脩短巨細，　　無取無與，",
        "translation": "What’s good and evil in the world is cultivated, long and small, big and small, without grasping or giving.",
        "source": "T04n0212_030:0770c19_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0770c20_0"
    },
    {
        "source_sentence": "世俗方略事有若干，欲察人情先採其語，說善說惡不記于懷，不見有長短廣狹，",
        "translation": "There are some minor matters of worldly conventionality that, in order to discern people’s emotions, they first grasp their words. Explaining what is good and speaking what is bad, they do not keep track of it; they do not see long, short, wide, or narrow [teachings].",
        "source": "T04n0212_030:0770c21_0"
    },
    {
        "source_sentence": "亦復不見有取有與，具足如是行者是謂梵志。",
        "translation": "Again, he doesn't see that there's grasping and giving, and someone who fulfills such practice is called a priest.",
        "source": "T04n0212_030:0770c22_1"
    },
    {
        "source_sentence": "是故說曰，世所善惡，脩短巨細，無取無與，是謂梵志。",
        "translation": "Therefore, it's said that what's good and bad in the world is cultivated to be neither grasped nor given. This is called a priest.",
        "source": "T04n0212_030:0770c23_2"
    },
    {
        "source_sentence": "　身為行本，　　口意無犯，　　能辦三處，",
        "translation": "Body is the root of action, speech and thought are not transgressions. It can be done in three ways:",
        "source": "T04n0212_030:0770c26_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0770c27_0"
    },
    {
        "source_sentence": "身不行殺、口不惡罵、意不嫉妬，於五鼎沸世能具此三行者，乃名為梵志。",
        "translation": "Those who don't practice killing, don't speak harshly, and don't become jealous of their minds are called priests if they can fulfill these three practices in the world that flourishes at the five thrones.",
        "source": "T04n0212_030:0770c28_0"
    },
    {
        "source_sentence": "是故說曰，身為行本，口意無犯，能辦三處，是謂梵志。",
        "translation": "Therefore, it's said, 'The body is the basis of practice, and there's no offense with speech or thought, so you can prepare three places.' This is called a priest.",
        "source": "T04n0212_030:0770c29_1"
    },
    {
        "source_sentence": "　來不作歡，　　去亦不憂，　　於聚離聚，",
        "translation": "Who comes and doesn’t rejoice, And goes without sorrow. Being assembled or separated from the assembled,",
        "source": "T04n0212_030:0771a02_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771a03_0"
    },
    {
        "source_sentence": "彼習行人持心牢固毀譽不動，見有來者不孚用歡，設見去者亦不用憂，",
        "translation": "Those practitioners hold their minds firmly and disparage those who don’t move. When they see a newcomer, they don’t rejoice; and even if they see someone leaving, they don’t have to worry.",
        "source": "T04n0212_030:0771a04_0"
    },
    {
        "source_sentence": "若在大眾若復離眾，心恒平等亦無高下。",
        "translation": "Whether they're in the masses or further apart from the masses, their minds are always equal, and there's no high or low.",
        "source": "T04n0212_030:0771a05_1"
    },
    {
        "source_sentence": "是故說曰，來不作歡，去亦不憂，於聚離聚，是謂梵志。",
        "translation": "Therefore, it's said, 'When you come, you don't rejoice, and when you go, you don't grieve; when you part with the group and leave the group, this is called a priest.",
        "source": "T04n0212_030:0771a06_2"
    },
    {
        "source_sentence": "　來亦不歡，　　去亦不憂，　　無憂清淨，",
        "translation": "Nor does he rejoice at the coming, Nor grieve at the going, Nor is he overcome with sorrow. He has no sorrow and is pure.",
        "source": "T04n0212_030:0771a08_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771a09_0"
    },
    {
        "source_sentence": "若見愛念不愛念者亦不用作歡。",
        "translation": "If someone sees what's loved and doesn't love it, they don't need to rejoice.",
        "source": "T04n0212_030:0771a10_0"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T04n0212_030:0771a10_1"
    },
    {
        "source_sentence": "恐心染著興起因緣。",
        "translation": "I'm afraid the mind will become defiled by the causes and conditions that give rise to it.",
        "source": "T04n0212_030:0771a11_0"
    },
    {
        "source_sentence": "設見去者便自念言：「我於彼人各無所犯，內外清淨息意不起亦名為梵志。」",
        "translation": "Suppose someone sees the departing and thinks to themselves, I'm not guilty of any offense against those people, and internal or external purity that doesn't arise from my mind is also called a priest.",
        "source": "T04n0212_030:0771a11_1"
    },
    {
        "source_sentence": "是故說曰，來亦不歡，去亦不憂，無憂清淨，是謂梵志。",
        "translation": "Therefore, it's said, Neither does he rejoice when he comes nor grieve when he leaves, and the absence of grief is pure. This is called a priest.",
        "source": "T04n0212_030:0771a13_2"
    },
    {
        "source_sentence": "　以斷恩愛，　　離家無欲，　　愛有已盡，",
        "translation": "He stops craving for kindness and separation from home, becomes dispassionate, and has ended craving.",
        "source": "T04n0212_030:0771a15_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771a16_0"
    },
    {
        "source_sentence": "如彼行人修習於道，永斷恩愛離家無欲遠遊無礙，盡諸有愛缺三界漏，",
        "translation": "Suppose that practitioner cultivates the path, permanently cuts off kindness and love, leaves home without desire, travels far and wide without obstruction, and ends the contaminants of the three realms of craving and deficiency.",
        "source": "T04n0212_030:0771a17_0"
    },
    {
        "source_sentence": "能具足如此者乃名梵志。",
        "translation": "Those who can do so are called priests.",
        "source": "T04n0212_030:0771a18_1"
    },
    {
        "source_sentence": "是故說曰，以斷恩愛，離家無欲，愛有已盡，是謂梵志。",
        "translation": "Therefore, it's said, 'This is called a priest who stops craving for kindness and leaves home without desire and has ended craving.'",
        "source": "T04n0212_030:0771a19_2"
    },
    {
        "source_sentence": "　適彼無彼，　　彼彼以無，　　捨離貪欲，",
        "translation": "When there’s neither one nor the other, Because this or that is nonexistent, One abandons craving.",
        "source": "T04n0212_030:0771a21_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771a22_0"
    },
    {
        "source_sentence": "所謂彼者外六入也，所謂無彼者內六入也，行人執意觀內外諸情斯悉虛寂，",
        "translation": "The so-called are the six external sense-fields. The so-called absence of these is the six internal sense-fields. Practitioners who cling to mental images and contemplate both internal and external feelings are completely in vain.",
        "source": "T04n0212_030:0771a23_0"
    },
    {
        "source_sentence": "捨離貪淫不興六情，具足如此眾行之本者，乃名為梵志。",
        "translation": "Those who abandon craving and sexual misconduct and don't give rise to the six emotions and are fully endowed with the basis of such practices are called priests.",
        "source": "T04n0212_030:0771a24_1"
    },
    {
        "source_sentence": "是故說曰，適彼無彼，彼彼以無，捨離貪欲，是謂梵志。",
        "translation": "Therefore, it's said, 'It's appropriate to say that there's neither one nor the other, and because they don't exist, they abandon craving.' This is called a priest.",
        "source": "T04n0212_030:0771a26_2"
    },
    {
        "source_sentence": "　適彼無彼，　　彼彼以虛，　　不染三處，",
        "translation": "It's appropriate for them and not for others, because they are empty. They aren't defiled by the three places.",
        "source": "T04n0212_030:0771a28_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771a29_0"
    },
    {
        "source_sentence": "彼習行人解知內外皆無結使，不著欲界色界無色界，能具足如此眾行者，",
        "translation": "That practitioner understands that both inside and outside are without fetters, not attached to the desire realm, form realm, formless realm, or formless realm, and can perfect such practices.",
        "source": "T04n0212_030:0771b01_0"
    },
    {
        "source_sentence": "乃名為梵志。",
        "translation": "He's called a priest.",
        "source": "T04n0212_030:0771b02_1"
    },
    {
        "source_sentence": "是故說曰，適彼無彼，彼彼以虛，不染三處，是謂梵志。",
        "translation": "Therefore, it's said, 'It's appropriate to say that there's neither one nor the other, and this is called a priest who doesn't stain the three places because they're false.'",
        "source": "T04n0212_030:0771b03_0"
    },
    {
        "source_sentence": "　能捨家業，　　拔於愛欲，　　無貪知足，",
        "translation": "He’s able to abandon family business, Reject craving and desire, Being free of greed and contentment.",
        "source": "T04n0212_030:0771b05_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771b06_0"
    },
    {
        "source_sentence": "夫人離家莫與世俗從事，正使出家不修其法，毀戒不精進，亦不多聞，",
        "translation": "A woman who leaves home and doesn't work with worldly people shouldn't be allowed to leave home, just so she won't cultivate her practice, violate precepts, lack effort, and don't learn much.",
        "source": "T04n0212_030:0771b07_0"
    },
    {
        "source_sentence": "亦不應與坐起從事，更不思惟當來利養，能具如此者乃名梵志。",
        "translation": "Nor should he give his seat to someone who rises and joins the congregation, or contemplate future benefits. Anyone who possesses such qualities is called a priest.",
        "source": "T04n0212_030:0771b08_1"
    },
    {
        "source_sentence": "是故說曰，能捨家業，拔於愛欲，無貪知足，是謂梵志。",
        "translation": "Therefore, it's said that someone who can abandon household activities, remove craving and desire, and have no craving or knowing enough is called a priest.",
        "source": "T04n0212_030:0771b10_2"
    },
    {
        "source_sentence": "　如今所知，　　究其苦際，　　無復有欲，",
        "translation": "Known today, they'll reach the limit of suffering, and no longer have desires.",
        "source": "T04n0212_030:0771b12_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771b13_0"
    },
    {
        "source_sentence": "於見法中能分別微妙無有眾惡，知苦是眾病之原首，能斷此者乃應於妙。",
        "translation": "In seeing the Dharma, they can discern subtle and subtle that there are no many bad things, knowing that suffering is the root of all illnesses, and those who can stop them should be marvelous.",
        "source": "T04n0212_030:0771b14_0"
    },
    {
        "source_sentence": "於見法中不與欲意共相應，瞋恚愚癡永盡無餘離諸縛著，能具如此者故名為梵志。",
        "translation": "They are not associated with the mind of desire in regard to the teachings, permanently eliminate anger and delusion, leave all attachments without remainder, and are called priests because they can do so.",
        "source": "T04n0212_030:0771b15_1"
    },
    {
        "source_sentence": "是故說曰，如今所知，究其苦際，無復有欲，是謂梵志。",
        "translation": "Therefore, it's said, 'Now that we know the limit of suffering, there are no more desires.' This is called a priest.",
        "source": "T04n0212_030:0771b17_2"
    },
    {
        "source_sentence": "　於罪與福，　　兩行永除，　　無憂無塵，",
        "translation": "The two practices of sin and virtue are permanently removed, without sorrow or dust.",
        "source": "T04n0212_030:0771b19_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771b20_0"
    },
    {
        "source_sentence": "正使有福世俗有漏善本功德得為人身，由故不脫生老病死。",
        "translation": "It's precisely because of the merit of good, worldly, conventional, and contaminated good roots that they attain a human body; therefore, they won't be freed from birth, old age, illness, and death.",
        "source": "T04n0212_030:0771b21_0"
    },
    {
        "source_sentence": "又復作罪種三惡本經歷生死，罪之與福二不足貪，兩行永除無復塵垢，",
        "translation": "Again, the three bad roots of sin and the seeds of sin are originally experienced in birth-and-death, but sin and merit aren't enough for craving, and both practices are permanently removed without further defilement.",
        "source": "T04n0212_030:0771b22_1"
    },
    {
        "source_sentence": "能具此行者，是謂梵志。",
        "translation": "Those who can fulfill these practices are called priests.",
        "source": "T04n0212_030:0771b24_2"
    },
    {
        "source_sentence": "是故說曰，於罪與福，兩行永除，無憂無塵，是謂梵志。",
        "translation": "Therefore, it's said, 'In sin and merit, the two practices are permanently removed, with no sorrow and no dust.' This is called a priest.",
        "source": "T04n0212_030:0771b24_3"
    },
    {
        "source_sentence": "　於罪與福，　　兩行永除，　　三處無染，",
        "translation": "In sin and merit, the two practices are permanently removed, and the three places are undefiled.",
        "source": "T04n0212_030:0771b26_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771b27_0"
    },
    {
        "source_sentence": "福之與罪無欲無染，中間禪樂無色禪樂，行人盡捨無所染著，不著三界欲界色界無色界，",
        "translation": "Good fortune and sin are without desire or defilement, with the bliss of meditation in the intermediate state of trance and the bliss of formless meditation. Practitioners abandon all [their] attachments and have no defiled attachments. They don’t cling to the three realms:",
        "source": "T04n0212_030:0771b28_0"
    },
    {
        "source_sentence": "能解此具足者乃名梵志。",
        "translation": "Those who can understand that this is complete are called priests.",
        "source": "T04n0212_030:0771c01_1"
    },
    {
        "source_sentence": "是故說曰，於罪與福，兩行永除，三處無染，是謂梵志。",
        "translation": "Therefore, it's said, 'In sin and merit, the two practices are permanently removed, and the three places are without defilement.' This is called a priest.",
        "source": "T04n0212_030:0771c01_2"
    },
    {
        "source_sentence": "　猶如眾華葉，　　以鍼貫芥子，",
        "translation": "It's like a lot of flowers and leaves that penetrate a mustard seed with a needle.",
        "source": "T04n0212_030:0771c03_0"
    },
    {
        "source_sentence": "　不為欲所染，　　是謂名梵志。",
        "translation": "Not being stained by desire, this is called a priest.",
        "source": "T04n0212_030:0771c04_0"
    },
    {
        "source_sentence": "猶如蓮華之葉不受塵水，彼修行人亦復如是，以離於欲不復著色聲香味細滑法，",
        "translation": "Just as the leaves of a lotus flower do not accept water or dirt, similarly those who practice meditation are free from desire and no longer attached to form, sound, odor, taste, fineness, or slipperiness.",
        "source": "T04n0212_030:0771c05_0"
    },
    {
        "source_sentence": "猶若以鍼欲貫藍豆及與芥子，難可獲也。",
        "translation": "It's like using a needle to penetrate blue beans and mustard seed with a needle, which are difficult to obtain.",
        "source": "T04n0212_030:0771c06_1"
    },
    {
        "source_sentence": "彼修行人無有婬欲，略說其要，不為惡所染。",
        "translation": "That practitioner has no sexual desire, and he briefly explains its essentials so that they won't be stained by evil.",
        "source": "T04n0212_030:0771c07_2"
    },
    {
        "source_sentence": "是故說曰，猶如眾華葉，以鍼貫芥子，不為欲所染，是謂名梵志。",
        "translation": "That's why it's said, 'It's like a lot of flower leaves that penetrate a mustard seed with a needle and aren't stained by desire,' which is called a priest.",
        "source": "T04n0212_030:0771c08_3"
    },
    {
        "source_sentence": "　心喜無垢，　　如月盛滿，　　謗毀已除，",
        "translation": "The mind’s joy is pure, Like the moon in full bloom. Having dispelled all your slanderous thoughts,",
        "source": "T04n0212_030:0771c11_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771c12_0"
    },
    {
        "source_sentence": "猶如月盛滿清淨無瑕穢無有五翳，眾星圍遶放大光明靡所不照。",
        "translation": "It's like when the moon is full and pure, without blemish or defilement, surrounded by stars that radiate great light that doesn't fail to illuminate anything.",
        "source": "T04n0212_030:0771c13_0"
    },
    {
        "source_sentence": "彼比丘清淨行人，永除五翳無復五結，心得解脫諸覺道品，眾定正受而自圍遶，",
        "translation": "That monk's pure practitioner, who permanently removes the five debilitating tendencies and no longer has any of the five bonds, attains liberation from the factors of awakening and enlightenment, and is surrounded by a multitude of concentrations that are correctly received.",
        "source": "T04n0212_030:0771c14_1"
    },
    {
        "source_sentence": "於中獨尊無有眾瑕，捨世八法毀譽已除，能具此行者故名為梵志。",
        "translation": "There are no numerous flaws in the solitary honored one among them, who abandons the eight worldly precepts and disparages their praise, and he's called a priest because he can fulfill these practices.",
        "source": "T04n0212_030:0771c16_2"
    },
    {
        "source_sentence": "是故說曰，心喜無垢，如月盛滿，謗毀已除，是謂梵志。",
        "translation": "Therefore, it's said, 'My mind is like a moon full of blamelessness, and I've removed the slanderousness.' This is called a priest.",
        "source": "T04n0212_030:0771c17_3"
    },
    {
        "source_sentence": "　如月清明，　　懸處虛空，　　不染於欲，",
        "translation": "Like the moon shining brightly, hanging in space, it’s not stained by desire.",
        "source": "T04n0212_030:0771c20_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771c21_0"
    },
    {
        "source_sentence": "如秋時月不為五事所翳，清淨無瑕放大光明靡所不照，修行比丘亦復如是，",
        "translation": "“Furthermore, just as in the autumn the moon is not subject to any of the five kinds of conditions, pure and spotless, emitting great rays of light that illuminate everywhere, so too does the religious practitioner monk.",
        "source": "T04n0212_030:0771c22_0"
    },
    {
        "source_sentence": "不為婬怒癡五結所翳，能具此行者故名為梵志。",
        "translation": "He's not subject to the five bonds of anger, anger, and delusion, and he's called a priest because he can fulfill these practices.",
        "source": "T04n0212_030:0771c23_1"
    },
    {
        "source_sentence": "是故說曰，如月清明，懸處虛空，不染於欲，是謂梵志。",
        "translation": "Therefore, it's said, 'Suppose the moon is so clear and bright that it hangs in space and isn't stained by desire.' This is called a priest.",
        "source": "T04n0212_030:0771c24_2"
    },
    {
        "source_sentence": "　避諍不諍，　　犯而不慍，　　惡來善待，",
        "translation": "He avoids sexual misconduct and doesn’t indulge in sexual misconduct, violates the precepts and doesn’t lie down, and treats evil people well.",
        "source": "T04n0212_030:0771c26_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0771c27_0"
    },
    {
        "source_sentence": "彼入定人不起諍訟，禪定一意念待喜安，自守五行具足乃名為定。",
        "translation": "That person who enters concentration doesn't argue, waits with joy and peace with a single thought in meditation, and observes the five practices for themselves as they are fulfilled, which is called concentration.",
        "source": "T04n0212_030:0771c28_0"
    },
    {
        "source_sentence": "設有惡意來相向者恒以善待。",
        "translation": "If there's bad intention to come and face each other, they'll always be treated with goodness.",
        "source": "T04n0212_030:0771c29_1"
    },
    {
        "source_sentence": "是故說曰，避諍不諍，犯而不慍，惡來善待，是謂梵志。",
        "translation": "Therefore, it's said, 'Abstain from sexual misconduct and abstain from sexual misconduct, violate the precept against not drinking alcohol, and treat evil people well.' This is called a priest.",
        "source": "T04n0212_030:0772a01_2"
    },
    {
        "source_sentence": "　解微妙慧，　　辨道不道，　　體行上義，",
        "translation": "Understanding subtle wisdom, They discern the path and not the path. Their essence and practice are supreme in meaning.",
        "source": "T04n0212_030:0772a03_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772a04_0"
    },
    {
        "source_sentence": "諸有人聞籌量算計圖度萬物分別義趣，一一分明辨其道趣，可就知就可捨知捨，",
        "translation": "If someone hears the meaning of all things that are measured, calculated, and mapped to discern their destinies, one by one they'll be able to discern the destinies of those paths in terms of knowing and equanimity in terms of what can be known.",
        "source": "T04n0212_030:0772a05_0"
    },
    {
        "source_sentence": "體行上義。",
        "translation": "It's the ultimate meaning of essence and practice.",
        "source": "T04n0212_030:0772a06_1"
    },
    {
        "source_sentence": "所謂上義者，滅盡泥洹是，能具足此法者故名為梵志。",
        "translation": "The so-called higher meaning is cessation of nirvāṇa, and someone who can fulfill this teaching is therefore called a priest.",
        "source": "T04n0212_030:0772a07_2"
    },
    {
        "source_sentence": "是故說曰，解微妙慧，辨道不道，體行上義，是謂梵志。",
        "translation": "Therefore, it's said that someone who understands subtle wisdom, discerns the path and doesn't follow it, and practices the ultimate meaning in essence, this is called a priest.",
        "source": "T04n0212_030:0772a08_3"
    },
    {
        "source_sentence": "　諸在人間，　　乞索自濟，　　無我無著，",
        "translation": "All the living beings in the world begged for their own salvation, Being without self or attachment.",
        "source": "T04n0212_030:0772a10_0"
    },
    {
        "source_sentence": "　不失梵行，　　說智無崖，　　是謂梵志。",
        "translation": "Not losing the religious practice and teaching that there's no cliff of wisdom is called a priest.",
        "source": "T04n0212_030:0772a11_0"
    },
    {
        "source_sentence": "或有貴族姓子，從四姓中出家學道，捨憍慢意去高就下不著榮冀，在在處處周旋往來。",
        "translation": "Perhaps there are noble clansmen who leave home from the four castes and train in the path, abandon their arrogance, remove their highness and lowness, don't cling to their aspirations for prosperity, and circumambulate everywhere.",
        "source": "T04n0212_030:0772a12_0"
    },
    {
        "source_sentence": "興有佛事恭奉三寶，若得衣食床臥具病瘦醫藥，便為呪願使彼施家世世受福，",
        "translation": "If there's a buddha who serves the Three Treasures and respects the Three Treasures, then if he obtains clothing, food, beds, bedding, medicine for illness and thinness, then he makes a vow to make that donor's family receive merit throughout the world.",
        "source": "T04n0212_030:0772a14_0"
    },
    {
        "source_sentence": "或以神足騰在虛空作十八變，施主見者莫不歡喜，便從受法皆得開悟，",
        "translation": "Sometimes the donor performs eighteen transformations by ascending into space with his supernormal power of travel. All who see him are delighted, and they all attain enlightenment through receiving the teaching from him.",
        "source": "T04n0212_030:0772a15_1"
    },
    {
        "source_sentence": "能具此行者故名為梵志。",
        "translation": "Those who can fulfill these practices are therefore called priests.",
        "source": "T04n0212_030:0772a17_2"
    },
    {
        "source_sentence": "是故說曰，諸在人間，乞索自濟，無我無著，不失梵行，說智無崖，是謂梵志。",
        "translation": "Therefore, it's said, All the people in the world beg for self-rescue, have no self and no attachment, don't lose the religious practice, and say there's no cliff of wisdom.",
        "source": "T04n0212_030:0772a18_3"
    },
    {
        "source_sentence": "　若能棄欲，　　去家捨愛，　　以斷欲漏，",
        "translation": "If they can abandon desire, leave home and abandon their cravings, stop the contaminants of desire by...",
        "source": "T04n0212_030:0772a20_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772a21_0"
    },
    {
        "source_sentence": "如彼行人盡能斷欲，親近道門愛而不捨，或有梵志未盡究竟，欲意未斷貪著五樂，",
        "translation": "Suppose a practitioner is able to stop craving completely and doesn't abandon the love for the path when they become intimate with it, or there are priests who haven't ended it but haven't ended it, and whose desire hasn't stopped their craving for the five pleasures.",
        "source": "T04n0212_030:0772a22_0"
    },
    {
        "source_sentence": "雖稱梵志不離於欲。",
        "translation": "Even though he calls himself a priest, he doesn't part with desire.",
        "source": "T04n0212_030:0772a23_1"
    },
    {
        "source_sentence": "諸有學人永滅欲漏不習恩愛，能具足此行者故名為梵志。",
        "translation": "Those students who permanently cease the contaminants of desire and don't cultivate kindness and love are called priests because they can fulfill these practices.",
        "source": "T04n0212_030:0772a24_2"
    },
    {
        "source_sentence": "是故說曰，若能棄欲，去家捨愛，以斷欲漏，是謂梵志。",
        "translation": "Therefore, it's said, If you can abandon desire and leave home and abandon craving by stopping the contaminants of desire, this is called a priest.",
        "source": "T04n0212_030:0772a25_3"
    },
    {
        "source_sentence": "　慈愍於人，　　使不驚懼，　　不害有益，",
        "translation": "Being compassionate toward others, he causes them not to be frightened, doesn’t harm and benefits.",
        "source": "T04n0212_030:0772a27_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772a28_0"
    },
    {
        "source_sentence": "眾行之要四等為本，恒當慈愍加被眾生，見有恐懼懷憂惱者，便往恤化永處安隱，",
        "translation": "The essentials of all practices are based on the four equanimities, and they should always compassionately pity sentient beings. Seeing those with fear and grief, they go to their rescue and eternally live in peace.",
        "source": "T04n0212_030:0772a29_0"
    },
    {
        "source_sentence": "無害於人興致供養，能具此行者名曰梵志。",
        "translation": "Those who don't harm people and make offerings, and those who can fulfill this practice are called priests.",
        "source": "T04n0212_030:0772b01_1"
    },
    {
        "source_sentence": "是故說曰，慈愍於人，使不驚懼，不害有益，是謂梵志。",
        "translation": "Therefore, it's said, Being compassionate to others so that they aren't frightened and don't harm them is beneficial, which is called a priest.",
        "source": "T04n0212_030:0772b02_2"
    },
    {
        "source_sentence": "　避怨不怨，　　無所傷損，　　去其邪僻，",
        "translation": "He avoids enemies and doesn’t harm them, Does not harm others, Rejects their errors.",
        "source": "T04n0212_030:0772b04_0"
    },
    {
        "source_sentence": "　故曰梵志。",
        "translation": "That's why it's called a priest.",
        "source": "T04n0212_030:0772b05_0"
    },
    {
        "source_sentence": "行人執意志操不同，用心平等設見怨家視如赤子，慈心普等平均無二。",
        "translation": "The practitioners cling to different minds and actions, their minds are equanimous when they see an enemy's home and look at it like a red child, and their compassionate minds are universally equal and non-dual.",
        "source": "T04n0212_030:0772b06_0"
    },
    {
        "source_sentence": "猶若忍心如地平等如秤，蜎飛蠕動蚑行喘息，視如己身，念之如父、念之如母、念之如子、念之如身，",
        "translation": "It's like when the mind of forbearance is equal to the ground and equal to a scale, he looks at it as himself, thoughts of it as father, thoughts of it as mother, thoughts of it as child, and thoughts of it as body.",
        "source": "T04n0212_030:0772b07_1"
    },
    {
        "source_sentence": "而無有異。",
        "translation": "There's no difference.",
        "source": "T04n0212_030:0772b09_2"
    },
    {
        "source_sentence": "能具此眾行者名曰梵志。",
        "translation": "Those who can fulfill these practices are called priests.",
        "source": "T04n0212_030:0772b10_3"
    },
    {
        "source_sentence": "是故說曰，避怨不怨，無所傷損，去其邪僻，故曰梵志。",
        "translation": "Therefore, it's called a priest because he avoids enemies and doesn't resent them, doesn't harm anything, and removes their errors.",
        "source": "T04n0212_030:0772b10_4"
    },
    {
        "source_sentence": "　于後于前，　　及中無有，　　無操無捨，",
        "translation": "There is neither the latter, nor the former, nor anything in between. There is neither action nor non-action.",
        "source": "T04n0212_030:0772b12_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772b13_0"
    },
    {
        "source_sentence": "猶如有人，於未來世不作眾惡行，已不作當不作，於過去世不作眾惡行，",
        "translation": "“Suppose a man does not commit all kinds of evil deeds in the future; he has done them or will not do them. He does not commit all kinds of evil deeds in past lives.",
        "source": "T04n0212_030:0772b14_0"
    },
    {
        "source_sentence": "已作眾惡行，已不作當不作現不作，及其中間作眾惡行不作眾惡行，已不作當不作現不作。",
        "translation": "They've done numerous bad actions, haven't done them, won't do them, will not do them, and won't do them in the present, and between them, they'll do numerous bad actions and won't do many bad actions, and won't do them in the present or won't do them after they don't do them.",
        "source": "T04n0212_030:0772b15_1"
    },
    {
        "source_sentence": "能捨此眾惡行者，故名為梵志。",
        "translation": "Being able to abandon these bad actions is therefore called a priest.",
        "source": "T04n0212_030:0772b18_0"
    },
    {
        "source_sentence": "是故說曰，于後于前，及中無有，無操無捨，是謂梵志。",
        "translation": "Therefore, it's said that there's nothing in the latter, nothing in the former, and nothing in the middle, and no action or equanimity is called a priest.",
        "source": "T04n0212_030:0772b18_1"
    },
    {
        "source_sentence": "　去婬怒癡，　　憍慢諸惡，　　鍼貫芥子，",
        "translation": "He rids himself of lust, anger, delusion, arrogance, and evil, pierces the mustard seed with a needle.",
        "source": "T04n0212_030:0772b20_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772b21_0"
    },
    {
        "source_sentence": "如彼行人欲為污心，不得至於虛寂之道，除去憍慢諸不善法，便得漸進至泥洹境，",
        "translation": "If those practitioners want to defile their minds, they won’t be able to reach the path of emptiness and quiescence, rid themselves of arrogance and unwholesome states, and will gradually advance to the state of nirvana.",
        "source": "T04n0212_030:0772b22_0"
    },
    {
        "source_sentence": "猶若鍼貫芥子終不可得。",
        "translation": "It's like when a needle penetrates a mustard seed and it can't be obtained.",
        "source": "T04n0212_030:0772b23_1"
    },
    {
        "source_sentence": "彼心亦復如是，不為婬怒癡繫所拘礙，能具此行者是謂梵志。",
        "translation": "That mind is likewise, not bound by the bonds of lust, anger, and delusion. Those who are able to fulfill these practices are called priests.",
        "source": "T04n0212_030:0772b24_2"
    },
    {
        "source_sentence": "是故說曰，去婬怒癡，憍慢諸惡，鍼貫芥子，是謂梵志。",
        "translation": "Therefore, it's said, 'Remove anger, anger, delusion, arrogance, and badness, and place a needle in a mustard seed.' This is called a priest.",
        "source": "T04n0212_030:0772b25_3"
    },
    {
        "source_sentence": "　城以塹為固，　　往來受其苦，",
        "translation": "The city is built of moats as strongholds, And suffers hardship in all directions.",
        "source": "T04n0212_030:0772b28_0"
    },
    {
        "source_sentence": "　欲適渡彼岸，　　不肯受他語，",
        "translation": "Wishing to cross over to the other shore, they won’t accept another’s words.",
        "source": "T04n0212_030:0772b29_0"
    },
    {
        "source_sentence": "　唯能滅不起，　　是謂名梵志。",
        "translation": "Only those who can cease and not arise are called priests.",
        "source": "T04n0212_030:0772c01_0"
    },
    {
        "source_sentence": "生死久遠涉苦無數，唯有禪定之人越此生死之難，去邪疑意無復猶豫，",
        "translation": "For a long time, birth and death have been accompanied by innumerable sufferings. Only those in meditative absorption can overcome the difficulties of birth and death without further hesitation to dispel their doubts or doubts.",
        "source": "T04n0212_030:0772c02_0"
    },
    {
        "source_sentence": "捨煩惱結使，受清淨結使。",
        "translation": "He abandons the afflictive tendencies and receives the pure tendencies.",
        "source": "T04n0212_030:0772c03_1"
    },
    {
        "source_sentence": "能具此者故名為梵志。",
        "translation": "Those who can fulfill this are therefore called priests.",
        "source": "T04n0212_030:0772c04_2"
    },
    {
        "source_sentence": "是故說曰，城以塹為固，往來受其苦，欲適渡彼岸，不肯受他語，唯能滅不起，",
        "translation": "For this reason it is said that the city walls are made of moats, which are strong and resistant; they endure all kinds of pain from one battlefield to another. They wish to cross over to the yonder shore but will not obey anyone’s words.",
        "source": "T04n0212_030:0772c04_3"
    },
    {
        "source_sentence": "是謂名梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772c06_4"
    },
    {
        "source_sentence": "　人能斷愛，　　今世後世，　　有愛已盡，",
        "translation": "A person is able to stop craving. In the present life and in the afterlife, there will be an end of craving.",
        "source": "T04n0212_030:0772c07_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772c08_0"
    },
    {
        "source_sentence": "愛根未盡則不至道，愛根已盡者乃能為道，欲求道者不斷三界結使則不至於道，",
        "translation": "When the faculty attachment is not exhausted yet, they do not reach the path; when the faculty attachment is exhausted yet, they are able to make the path. Those who want to seek the path but do not let go of the fetters of the three realms will not reach the path.",
        "source": "T04n0212_030:0772c09_0"
    },
    {
        "source_sentence": "能斷愛根然後乃至於道，能具足此者故名為梵志。",
        "translation": "He's called a priest because he can cut off the root of craving and then up to the path, and he's able to fulfill this.",
        "source": "T04n0212_030:0772c10_1"
    },
    {
        "source_sentence": "是故說曰，人能斷愛，今世後世，有愛已盡，是謂梵志。",
        "translation": "Therefore, it's said that a person can stop craving, and in the present life and future lives, there will be an end of craving. This is called a priest.",
        "source": "T04n0212_030:0772c12_2"
    },
    {
        "source_sentence": "　人無希望，　　今世後世，　　以無希望，",
        "translation": "People have no hope, and in the present life and future lives, because there’s no hope.",
        "source": "T04n0212_030:0772c14_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772c15_0"
    },
    {
        "source_sentence": "所謂希望者，天下萬物皆人之所希望，然此希望故未斷絕，如今現身未死見存於世，",
        "translation": "The so-called hope is that all things in the world will be wished by people, but this hope hasn't been cut off because they haven't cut off it, and now their present body isn't dead.",
        "source": "T04n0212_030:0772c16_0"
    },
    {
        "source_sentence": "正使後世取其命終，身死神逝無復希望。",
        "translation": "It's precisely because in a later life, when he reaches the end of his life, his body dies and his spirit passes away without further hope.",
        "source": "T04n0212_030:0772c18_0"
    },
    {
        "source_sentence": "能如此功德具足者，名曰梵志。",
        "translation": "Those who can be endowed with such merit are called priests.",
        "source": "T04n0212_030:0772c18_1"
    },
    {
        "source_sentence": "是故說曰，人無希望，今世後世，以無希望，是謂梵志。",
        "translation": "Therefore, it's said, 'A person has no hope, and because there's no hope in the present life or future life, this is called a priest.'",
        "source": "T04n0212_030:0772c19_2"
    },
    {
        "source_sentence": "　自不識知，　　天揵沓和，　　知無量觀，",
        "translation": "Not knowing for themselves, the gods see Vaiśravaṇa and know immeasurable contemplation.",
        "source": "T04n0212_030:0772c21_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0772c22_0"
    },
    {
        "source_sentence": "當佛如來坐禪之時，諸天世人竟不知佛今為所在。",
        "translation": "When the Buddha Tathāgata was sitting in meditation, the gods and people didn't even know where the Buddha was now.",
        "source": "T04n0212_030:0772c23_0"
    },
    {
        "source_sentence": "「歸命人中尊，　　歸命人中上，",
        "translation": "Among those who take refuge in the Dharma, he is the most honorable. Among those who take refuge in the Dharma, he is the highest.",
        "source": "T04n0212_030:0772c24_1"
    },
    {
        "source_sentence": "　不審今世尊，　　為因何等禪？",
        "translation": "I wonder, Bhagavān, what's the cause of this meditation?",
        "source": "T04n0212_030:0772c24_1"
    },
    {
        "source_sentence": "　唯願天中天，　　敷演其教義。」",
        "translation": "May it only be the god of gods among gods who lay out the meaning of their teaching.",
        "source": "T04n0212_030:0772c24_1"
    },
    {
        "source_sentence": "有一比丘名曰多耆奢，往至世尊所，便以此偈而讚如來曰：如來自說：「梵行之中無有出我者，",
        "translation": "There was a certain monk named Dagiṣṭha who came to the place where the World-honored One was. He praised the Tathāgata in verse: The Tathāgata declared, “There is no selflessness in the practice of austerity.",
        "source": "T04n0212_030:0772c24_1"
    },
    {
        "source_sentence": "所以知其然，禪解脫正受定意，猶是世之常法，諸天龍神不能知我之所在，",
        "translation": "That is why I know that it is so. Meditation, liberation, and meditative absorption are the eternal principles of the world. Gods, dragons, and goddesses cannot know where I am.",
        "source": "T04n0212_030:0772c29_2"
    },
    {
        "source_sentence": "況我當行佛事眾智之妙門？",
        "translation": "How could I practice the marvelous approach of the Buddha's service to sentient beings?",
        "source": "T04n0212_030:0773a02_3"
    },
    {
        "source_sentence": "天龍鬼神能知我處乎？」",
        "translation": "Can gods, dragons, ghosts, and spirits know where I am?",
        "source": "T04n0212_030:0773a03_4"
    },
    {
        "source_sentence": "是故說曰，自不識知，天揵沓和，知無量觀，是謂梵志。",
        "translation": "Therefore, it's said, 'I don't know for myself, goddess Kauṇḍinya, and I know the immeasurable contemplation,' which is called a priest.",
        "source": "T04n0212_030:0773a03_5"
    },
    {
        "source_sentence": "　自識宿命，　　見天人道，　　知生苦源，",
        "translation": "Knowing for themselves their past lives, They see the paths of gods and humans And know the source of suffering.",
        "source": "T04n0212_030:0773a05_0"
    },
    {
        "source_sentence": "　智心永寂。",
        "translation": "The mind of wisdom is permanently quiescent.",
        "source": "T04n0212_030:0773a06_0"
    },
    {
        "source_sentence": "自識宿命無數劫事，觀知地獄天上之事，餘者不能，唯有佛、如來、至真、等正覺，",
        "translation": "They know for themselves the events of past, present, and future innumerable aeons; they observe the events of hells and heavens. But others cannot: only Buddha, the Tathāgata, Arhat, Perfectly Enlightened One can do so.",
        "source": "T04n0212_030:0773a07_0"
    },
    {
        "source_sentence": "觀三千大千世界如掌觀珠，知生苦源究暢其本，捷疾之智速成羅漢道，",
        "translation": "Observing the great manifold cosmos of one thousand worlds like palms, he observed the jewel. Knowing the origin of suffering as birth, he investigated and clarified its source. With swift knowledge he quickly attained the path of the arhat.",
        "source": "T04n0212_030:0773a08_1"
    },
    {
        "source_sentence": "隨意所念而無流滯。",
        "translation": "He follows what he thinks without any obstruction.",
        "source": "T04n0212_030:0773a10_2"
    },
    {
        "source_sentence": "是故說曰，自識宿命，見天人道，知生苦源，智心永寂。",
        "translation": "Therefore, it's said that he knows his past lives and sees the paths of gods and humans, knows the source of suffering that arises, and has a wise mind that's always quiescent.",
        "source": "T04n0212_030:0773a10_3"
    },
    {
        "source_sentence": "　自知心解脫，　　脫欲無所著，",
        "translation": "Knowing for themselves that their minds are liberated, They’re freed from desire and have no attachment.",
        "source": "T04n0212_030:0773a13_0"
    },
    {
        "source_sentence": "　三明以成就，　　是謂為梵志。",
        "translation": "The third clarifies that it's accomplished by means of this, which is called a priest.",
        "source": "T04n0212_030:0773a14_0"
    },
    {
        "source_sentence": "如彼行人知心所念，解脫者不解脫者皆悉明知，欲想諸行永得解脫。",
        "translation": "Just as that practitioner knows what's in his mind, those who are liberated and those who aren't liberated all clearly know it, and the practices of desire and perception will always attain liberation.",
        "source": "T04n0212_030:0773a15_0"
    },
    {
        "source_sentence": "所謂三明者，自識宿命、天眼、漏盡，若具足如是行者名曰梵志。",
        "translation": "The so-called three kinds of insight are those who know for themselves past lives, the divine eye, and the end of contaminants, and if they fulfill such practices, they're called priests.",
        "source": "T04n0212_030:0773a16_1"
    },
    {
        "source_sentence": "是故說曰，自知心解脫，脫欲無所著，三明以成就，是謂為梵志。",
        "translation": "Therefore, it's said that he knows for himself that his mind is liberated, free of desire and without attachment, accomplished by the three insights, and this is called a priest.",
        "source": "T04n0212_030:0773a18_0"
    },
    {
        "source_sentence": "　自識於宿命，　　知眾生因緣，",
        "translation": "Knowing for themselves past lives, They know the causes and conditions of sentient beings.",
        "source": "T04n0212_030:0773a20_0"
    },
    {
        "source_sentence": "　如來佛無著，　　是謂為梵志。",
        "translation": "The Tathāgata Buddha has no attachment, which is called a priest.",
        "source": "T04n0212_030:0773a21_0"
    },
    {
        "source_sentence": "是時，如來知無數事，觀眾生性行一一分明，生者死者皆悉了知，猶如天雨普潤世界，",
        "translation": "At that time the Buddha, knowing innumerable things, observed the nature and conditioning of sentient beings with a partial clarity. All living beings and all dying beings were fully aware, just as the heavenly rain nourished the whole world.",
        "source": "T04n0212_030:0773a22_0"
    },
    {
        "source_sentence": "是時，世尊觀生死之類亦復如是，生者死者無不觀練。",
        "translation": "At the time, the Bhagavān observed birth and death in much the same way, and there's nothing that isn't cultivated by those who are born and die.",
        "source": "T04n0212_030:0773a23_1"
    },
    {
        "source_sentence": "爾時世尊與舍利弗，在閑靜室獨共遊處。",
        "translation": "It was then that the Bhagavān and Śāriputra were in a secluded room, traveling alone together.",
        "source": "T04n0212_030:0773a26_0"
    },
    {
        "source_sentence": "爾時有人已取命終，處在中陰精神不移。",
        "translation": "At the time, a person had passed away and was in the intermediate existence, but his spirit didn't move.",
        "source": "T04n0212_030:0773a26_1"
    },
    {
        "source_sentence": "佛告舍利弗：「汝今觀此中陰中識神，為從何許中來？",
        "translation": "The Buddha told Śāriputra, Now, when you're observing the consciousnesses in this intermediate aggregate, where will they come from?",
        "source": "T04n0212_030:0773a27_2"
    },
    {
        "source_sentence": "設復遷轉為處何所？」",
        "translation": "If it's further transformed, where will it be?",
        "source": "T04n0212_030:0773a29_3"
    },
    {
        "source_sentence": "是時，舍利弗即入四禪定意，觀此人神為從何來？",
        "translation": "At that point, Śāriputra entered the mind of the fourth meditation and observed where this person's spirit had come from.",
        "source": "T04n0212_030:0773a29_4"
    },
    {
        "source_sentence": "設當遷轉為處何處？",
        "translation": "Suppose there's a place where it's going to be transformed?",
        "source": "T04n0212_030:0773b01_5"
    },
    {
        "source_sentence": "時，舍利弗不知此人為從何來？",
        "translation": "Śāriputra did not know where the man came from.",
        "source": "T04n0212_030:0773b02_6"
    },
    {
        "source_sentence": "為趣何處？",
        "translation": "Where will they be reborn?",
        "source": "T04n0212_030:0773b02_7"
    },
    {
        "source_sentence": "爾時世尊告舍利弗曰：「汝今所見不及諸佛境界，此神所從來處此無數世界，",
        "translation": "At that time the World-honored One said to Śāriputra: What you see now is beyond the sphere of all buddhas. Where does this supernatural being come from?",
        "source": "T04n0212_030:0773b03_8"
    },
    {
        "source_sentence": "非汝神力之所能見。」",
        "translation": "It's not something you can see by your supernormal powers.",
        "source": "T04n0212_030:0773b04_9"
    },
    {
        "source_sentence": "佛告舍利弗：「汝復觀此精神當生何處？」",
        "translation": "The Buddha told Śāriputra, Again, where will this spirit be born?",
        "source": "T04n0212_030:0773b05_10"
    },
    {
        "source_sentence": "時舍利弗復入三昧，而不知精神所湊，舍利弗即從三昧起，前白佛言：「今日入定遍觀世界不知神之所湊。」",
        "translation": "Śāriputra then again entered samādhi but didn't know where the spirit was, and Śāriputra rose from samādhi and said to the Buddha, Today, he enters concentration and pervades the world without knowing where the spirit is.",
        "source": "T04n0212_030:0773b06_11"
    },
    {
        "source_sentence": "佛告舍利弗：「此神今日復當過一億世界，當生某甲家姓某字某。",
        "translation": "The Buddha told Śāriputra, Today, this god will again pass through a hundred million worlds and be born in a certain family name.",
        "source": "T04n0212_030:0773b08_12"
    },
    {
        "source_sentence": "如來所見，非是聲聞辟支佛所及知，宿命通唯有如來等正覺得此宿命通。」",
        "translation": "What the Tathāgata sees is beyond the ability of śrāvakas and pratyekbuddhas to know, and only the Tathāgata and so forth can directly experience this ability of knowing past lives.",
        "source": "T04n0212_030:0773b10_13"
    },
    {
        "source_sentence": "是故說曰，自識於宿命，知眾生因緣，如來佛無著，是謂為梵志。",
        "translation": "Therefore, it's said, 'I know for myself the causes and conditions of sentient beings' past lives, and the Tathāgata Buddha has no attachment,' which is called a priest.",
        "source": "T04n0212_030:0773b11_14"
    },
    {
        "source_sentence": "　盡斷一切結，　　亦不有熱惱，",
        "translation": "They cut off all bonds And have no anguish or displeasure.",
        "source": "T04n0212_030:0773b14_0"
    },
    {
        "source_sentence": "　如來佛無著，　　是謂為梵志。",
        "translation": "The Tathāgata Buddha has no attachment, which is called a priest.",
        "source": "T04n0212_030:0773b15_0"
    },
    {
        "source_sentence": "諸有眾生斷一切結使，羅漢辟支雖斷結使，由有相似結在，諸佛世尊無有相似，",
        "translation": "All sentient beings have cut all the bonds and tendencies, and even though arhats and pratyekabuddhas have cut the bonds and tendencies, it's because they have similar bonds that there are no similarities among the world-honored buddhas.",
        "source": "T04n0212_030:0773b16_0"
    },
    {
        "source_sentence": "是故如來佛無所著。",
        "translation": "Therefore, the Tathāgata Buddha has no attachment.",
        "source": "T04n0212_030:0773b17_1"
    },
    {
        "source_sentence": "是故說曰。",
        "translation": "Therefore, it's said.",
        "source": "T04n0212_030:0773b18_2"
    },
    {
        "source_sentence": "盡斷一切結。",
        "translation": "They completely eliminate all the bonds.",
        "source": "T04n0212_030:0773b18_3"
    },
    {
        "source_sentence": "亦不有熱惱。",
        "translation": "Nor does it have feverish anguish.",
        "source": "T04n0212_030:0773b18_4"
    },
    {
        "source_sentence": "如來佛無著。",
        "translation": "The Tathāgata Buddha has no attachment.",
        "source": "T04n0212_030:0773b19_5"
    },
    {
        "source_sentence": "是謂為梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0773b19_6"
    },
    {
        "source_sentence": "　仙人龍中上，　　大仙最為尊，",
        "translation": "Among the sages and dragons, the Great Sage is the most honored.",
        "source": "T04n0212_030:0773b20_0"
    },
    {
        "source_sentence": "　無數佛沐浴，　　是謂為梵志。",
        "translation": "Countless buddhas bathe, which is called a priest.",
        "source": "T04n0212_030:0773b21_0"
    },
    {
        "source_sentence": "所謂仙人者，得五通道，在群最尊無有出上，內外清徹無有眾瑕。",
        "translation": "The so-called sage attains the five paths, and there's nothing above him among the most venerable people in the assembly, which are clear and penetrating inside and out without any flaws.",
        "source": "T04n0212_030:0773b22_0"
    },
    {
        "source_sentence": "仙者亦名為象，長育形體獸中最大，執意剛強能却眾敵。",
        "translation": "The ṛṣi is also called an elephant, the long-lived form and body of which is the greatest among animals. It is strong in clinging to thought and able to defeat all enemies.",
        "source": "T04n0212_030:0773b23_1"
    },
    {
        "source_sentence": "無數沐浴，所謂沐浴者八解正浴池，去諸塵垢無有結使。",
        "translation": "Countless baths, the so-called bather's eight liberations are a correct bathing pond that removes dirt and has no bonds or tendencies.",
        "source": "T04n0212_030:0773b24_2"
    },
    {
        "source_sentence": "如來舒手，手所及處塵垢不著，伺察惡人不得其便。",
        "translation": "The Tathāgata extended his hand, didn't touch the dirt in his hands or places, and looked around for bad people who couldn't get an advantage over him.",
        "source": "T04n0212_030:0773b26_3"
    },
    {
        "source_sentence": "是故說曰，仙人龍中上，大仙最為尊，無數佛沐浴，是謂為梵志。",
        "translation": "That's why it's said, Among the sages and dragons, the great sage is the most honored, and countless buddhas bathe him; this is called a priest.",
        "source": "T04n0212_030:0773b27_4"
    },
    {
        "source_sentence": "　所有盡無，　　渡流無漏，　　從此越岸，",
        "translation": "What’s possessed is completely nonexistent, and crossing the river is uncontaminated.",
        "source": "T04n0212_030:0773b29_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0773c01_0"
    },
    {
        "source_sentence": "彼修行人，都越一切諸法，審諦分明解世所有悉無所有。",
        "translation": "That practitioner transcends all dharmas, examines and clearly understands that what exists in the world has no existence.",
        "source": "T04n0212_030:0773c02_0"
    },
    {
        "source_sentence": "所謂流者，流有四名：一名欲流，二名有流，三名無明流，四名見流。",
        "translation": "The so-called stream has four names: first, the flow of desire; second, the flow of existence; third, the flow of ignorance; and fourth, the flow of views.",
        "source": "T04n0212_030:0773c03_1"
    },
    {
        "source_sentence": "渡此四流者，然後乃得無漏之行。",
        "translation": "Those who cross these four streams will then attain uncontaminated practice.",
        "source": "T04n0212_030:0773c04_2"
    },
    {
        "source_sentence": "羅漢辟支猶尚思惟空無想願忍煖頂法，雖可思惟有漏俗法意結所在，或有是時，",
        "translation": "The arhats and pratyekabuddhas still contemplate emptiness, absence of ideation, vows, patience, warmth, and the highest dharma. Although they may contemplate where the mental fetters of impure worldly dharmas are located, sometimes there is a time when they do so.",
        "source": "T04n0212_030:0773c05_3"
    },
    {
        "source_sentence": "欲念無漏先念有漏，是以如來深藏則有大闕。",
        "translation": "Because mindfulness of desire is uncontaminated, the first thought is contaminated. This is why there is a great deficiency in the deep storehouse of the Tathagata.",
        "source": "T04n0212_030:0773c07_4"
    },
    {
        "source_sentence": "如來大聖繫意禪定從有至無，於無漏法觀未始有闕，得諸總持強記不忘，",
        "translation": "The great saintly concentrated meditation of the Tathāgata’s mind is conditioned by mental concentration, going from existence to nonexistence. He never fails to contemplate the uncontaminated dharmas and thus attains a firm memory that keeps them in one-pointed concentration.",
        "source": "T04n0212_030:0773c08_5"
    },
    {
        "source_sentence": "十力、四無畏、大慈大悲、三無礙道及神足行，是謂如來所修之法，非羅漢辟支佛所修之法。",
        "translation": "The ten powers, four forms of fearlessness, great kindness and compassion, three unhindered paths and the practice of supernormal abilities are qualities cultivated by the Tathāgata, not those cultivated by arhats or pratyekabuddhas.",
        "source": "T04n0212_030:0773c10_6"
    },
    {
        "source_sentence": "是故說曰，所有盡無，渡流無漏，從此越岸，是謂梵志。",
        "translation": "Therefore, it's said, Whatever exists is completely nonexistent, and crossing the river is uncontaminated, so from here he crosses over to the shore.",
        "source": "T04n0212_030:0773c12_7"
    },
    {
        "source_sentence": "　無禪無說，　　亦不念惡，　　禪智清淨，",
        "translation": "He has no meditation, no explanation, and no thoughts of evil. The knowledge of meditation is pure,",
        "source": "T04n0212_030:0773c14_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0773c15_0"
    },
    {
        "source_sentence": "彼修行人不念惡禪，夫入禪之人，無言無說常思善法。",
        "translation": "Those practitioners aren't mindful of bad meditation, and those who enter meditation always contemplate the good Dharma without saying anything.",
        "source": "T04n0212_030:0773c16_0"
    },
    {
        "source_sentence": "設見罵詈但守其法，若得味相應禪及中間禪，執意守之無所嬈惱，能具足此行者故名為梵志。",
        "translation": "Suppose someone sees that they're ridiculed but observes their teaching, and if they attain the taste associated with meditation and the middle dhyāna, they cling to it without being disturbed by it. Those who can fulfill this practice are therefore called priests.",
        "source": "T04n0212_030:0773c17_1"
    },
    {
        "source_sentence": "是故說曰，無禪無說，亦不念惡，禪智清淨，是謂梵志。",
        "translation": "Therefore, it's said, 'There's no meditation, no explanation, no mindfulness of evil, and the knowledge of meditation is pure,' which is called a priest.",
        "source": "T04n0212_030:0773c19_2"
    },
    {
        "source_sentence": "　比丘塜間衣，　　觀於欲非真，",
        "translation": "A monk wearing a patched robe observes that desire isn’t real,",
        "source": "T04n0212_030:0773c21_0"
    },
    {
        "source_sentence": "　坐樹空閑處，　　是謂為梵志。",
        "translation": "Sitting in a tree in an empty place, this is called a priest.",
        "source": "T04n0212_030:0773c22_0"
    },
    {
        "source_sentence": "塜間衣有四種：一者發家著衣出家學者，二者檀越施衣受而守護，三者百納拾諸遺餘，",
        "translation": "There are four kinds of intermittent robes: first, those who leave home wearing robes and leaving home as scholars; second, those who receive robes given by donors and guard them; and third, those who collect the remaining relics with a hundred collections.",
        "source": "T04n0212_030:0773c23_0"
    },
    {
        "source_sentence": "四者塜間污穢不淨。",
        "translation": "Fourth, it's defiled and impure in the midst of sexual desire.",
        "source": "T04n0212_030:0773c25_0"
    },
    {
        "source_sentence": "如來初學發家著衣，觀欲非真捨六萬夫人，棄轉輪王位，出家學道在閑靜處，",
        "translation": "At the beginning of his studies, the Tathāgata renounced the householder’s life and put on his monastic robes. Observing that desire is not real, he forsaked sixty thousand wives [and] abandoned the throne of a universal ruler (cakravartin), leaving home to study the path in a secluded place.",
        "source": "T04n0212_030:0773c25_1"
    },
    {
        "source_sentence": "坐樹王下，降伏魔王破十八億眾。",
        "translation": "Sitting under the king of trees, he subdued Māra King and defeated  1.8 billion people.",
        "source": "T04n0212_030:0773c27_2"
    },
    {
        "source_sentence": "能具此眾德者故名為梵志。",
        "translation": "Those who can possess these virtues are therefore called priests.",
        "source": "T04n0212_030:0773c28_3"
    },
    {
        "source_sentence": "是故說曰，比丘塜間衣，觀於欲非真，坐樹空閑處，是謂為梵志。",
        "translation": "Therefore, it's said, A monk who wears a patched robe and observes that desire isn't real and sits in a quiet place at a tree, which is called a priest.",
        "source": "T04n0212_030:0773c28_4"
    },
    {
        "source_sentence": "　人無識知，　　無語無說，　　體冷無煖，",
        "translation": "People have no consciousness or knowledge, No speech or language, Their bodies are cold and without heat.",
        "source": "T04n0212_030:0774a02_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0774a03_0"
    },
    {
        "source_sentence": "如來出世，無事不知無事不包，無語無說者，永除狐疑不懷猶豫，諸煩惱結使永盡無餘，",
        "translation": "When the Tathāgata appears in the world, he knows nothing and doesn’t contain anything. He has no words or explanations, forever removes doubts and doesn’t harbor hesitation. The bonds of affliction are permanently extinguished without remainder.",
        "source": "T04n0212_030:0774a04_0"
    },
    {
        "source_sentence": "逮甘露滅，能具此眾行故名為梵志。",
        "translation": "When he attains the cessation of ambrosia, he's called a priest because he can fulfill these practices.",
        "source": "T04n0212_030:0774a06_0"
    },
    {
        "source_sentence": "是故說曰，人無識知，無語無說，體冷無煖，是謂梵志。",
        "translation": "Therefore, it's said, A person has no consciousness, no speech, no explanation, and a body that's cold and lacks warmth, which is called a priest.",
        "source": "T04n0212_030:0774a06_1"
    },
    {
        "source_sentence": "　棄捐家居，　　無家之畏，　　逮甘露滅，",
        "translation": "They abandon their home, fear the fear of homelessness, and attain the cessation of ambrosia.",
        "source": "T04n0212_030:0774a08_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0774a09_0"
    },
    {
        "source_sentence": "所以居家者，安處人民得自生活，身者眾結之屋室，是以聖人教人離家，",
        "translation": "The reason for staying at home is that the people living in peace can live on their own. Their bodies are the dwellings of the sangha. This is why the holy ones teach people to leave home.",
        "source": "T04n0212_030:0774a10_0"
    },
    {
        "source_sentence": "在於閑靜求甘露滅，能具如是眾德者故曰梵志。",
        "translation": "He's in a quiet place seeking the cessation of ambrosia, and someone who possesses such many virtues is therefore called a priest.",
        "source": "T04n0212_030:0774a11_1"
    },
    {
        "source_sentence": "是故說曰，棄捐家居，無家之畏，逮甘露滅，是謂梵志。",
        "translation": "Therefore, it's said that someone who abandons their home and has no fear of homelessness and acquires the cessation of ambrosia is called a priest.",
        "source": "T04n0212_030:0774a12_2"
    },
    {
        "source_sentence": "　斷絕世事，　　口無麤言，　　八道審諦，",
        "translation": "They cut off worldly affairs, speak without harsh words. The eightfold path is the ultimate truth.",
        "source": "T04n0212_030:0774a15_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0774a16_0"
    },
    {
        "source_sentence": "如來世尊光相炳著，初轉法輪，八萬諸天及二王人、梵志七人，摩竭國王洴沙萬二千人，",
        "translation": "When the World-honored Tathāgata first turned the wheel of the Dharma, there were as many as eighty thousand devas and seven brahmins from the two kingdoms and twelve thousand brahmins from the whole empire of Magadha.",
        "source": "T04n0212_030:0774a17_0"
    },
    {
        "source_sentence": "摩竭國界石室之中，釋提桓因萬二千天，拘尸那竭國，最後度須拔。",
        "translation": "In the stone chamber at the border of the country of Magadha, King Śakra Devānām-Indra lived for twelve thousand gods and the country of Kuśinagara was the last to liberate Sudarśana.",
        "source": "T04n0212_030:0774a19_0"
    },
    {
        "source_sentence": "佛滅度後當有羅漢出世，名曰優波掘，於其中間濟度眾生不可稱計，演說八道無礙之法。",
        "translation": "After the parinirvāṇa of the Buddha, an arhat named Upagupta will appear in the world, called Upagupta, who will save measureless sentient beings among them and explain the unobstructed dharmas of the eight paths.",
        "source": "T04n0212_030:0774a20_1"
    },
    {
        "source_sentence": "是故說曰，斷絕世事，口無麤言，八道審諦，是謂梵志。",
        "translation": "Therefore, it's said that he stops worldly affairs, speaks without anger, and investigates the eight paths. This is called a priest.",
        "source": "T04n0212_030:0774a22_2"
    },
    {
        "source_sentence": "　遠逝獨遊，　　隱藏無形，　　難降能降，",
        "translation": "He travels alone from afar, hiding in formlessness. It is difficult to subdue and it can be subdued.",
        "source": "T04n0212_030:0774a24_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0774a25_0"
    },
    {
        "source_sentence": "如彼行人興無涯之想、散無邊之念，身形在此心在海表，人欲觀意知其形狀者甚為難剋。",
        "translation": "Suppose that practitioner gives rise to limitless thoughts and disperses limitless thoughts, and his body form is here and mind is on the surface of the ocean, and it's very difficult for someone who wants to observe its shape and knows its shape.",
        "source": "T04n0212_030:0774a26_0"
    },
    {
        "source_sentence": "心意流馳彈指之頃，過數千萬億江河山表，是以故說遠逝獨遊。",
        "translation": "In the time it takes to snap a finger, his mind and thought flowed for tens of thousands of myriads of koṭis of rivers and mountains. That is why he was said to have traveled far away alone.",
        "source": "T04n0212_030:0774a28_1"
    },
    {
        "source_sentence": "復有問者，心有十大地法，心為十一，何以故說遠逝獨遊乎？",
        "translation": "Again, some people ask, 'There are ten things in the mind that are the ten factors of the ten major stages, and the mind is one of the eleven. Why is it said to be traveling alone from afar?'",
        "source": "T04n0212_030:0774a29_2"
    },
    {
        "source_sentence": "報曰：「心者恒逐因緣隨前任行，當心在色聲，爾時無有香味細滑法；",
        "translation": "He said in reply, “The mind always follows its causes and conditions. When the mind is concentrated on matter or sound, there is no fragrance, odor, taste, fineness, or slipperiness at that time.",
        "source": "T04n0212_030:0774b02_0"
    },
    {
        "source_sentence": "當心在香，爾時無有色味細滑法；",
        "translation": "When the mind is in smell, there is no such thing as color, taste, or subtlety at that time.",
        "source": "T04n0212_030:0774b03_1"
    },
    {
        "source_sentence": "心在味，無色香細滑法；",
        "translation": "The mind is with relishing, the dharmas of formlessness, odorlessness, subtlety, and slip.",
        "source": "T04n0212_030:0774b04_2"
    },
    {
        "source_sentence": "心在細滑，爾時無色聲香味法；",
        "translation": "When the mind is subtle and slippery, it has no form, sound, odor, taste, or dharmas.",
        "source": "T04n0212_030:0774b05_0"
    },
    {
        "source_sentence": "心在法，無上五事。",
        "translation": "The mind abides in dharmas, which are the unsurpassed five things.",
        "source": "T04n0212_030:0774b05_1"
    },
    {
        "source_sentence": "當在色時心為法本，猶如王行羽儀賓從無不備有。",
        "translation": "When it comes to form, mind is the foundation of the Dharma, just like a king who practices feathery mannerisms and guest from which there's nothing that doesn't exist.",
        "source": "T04n0212_030:0774b06_2"
    },
    {
        "source_sentence": "但以王為名。",
        "translation": "They simply use the king as their name.",
        "source": "T04n0212_030:0774b07_3"
    },
    {
        "source_sentence": "此亦如是，心造因緣十法備有但不受名，亦如飛鳥飛行空中依其六翮，",
        "translation": "Just as a flying bird flies in the sky supported by its six wings.",
        "source": "T04n0212_030:0774b07_4"
    },
    {
        "source_sentence": "然但以鳥為名。",
        "translation": "Still, it's simply called a bird.",
        "source": "T04n0212_030:0774b09_5"
    },
    {
        "source_sentence": "此亦如是，心之無形亦無窠窟，非是世人肉眼所見，依止五陰，陰散則離非有形質，",
        "translation": "It is not seen by the physical eye of worldly beings. They depend on the five aggregates, and when the aggregates disperse, they are free from formlessness.",
        "source": "T04n0212_030:0774b09_6"
    },
    {
        "source_sentence": "心之難化猶木鑽鋼。",
        "translation": "The difficulty of transforming the mind is like drilling wood into steel.",
        "source": "T04n0212_030:0774b11_7"
    },
    {
        "source_sentence": "是以聖人遺教後生，欲降伏心者，晨用百藥中用百藥暮用百藥，空無想願止觀滅盡，",
        "translation": "That’s why the holy one inherited it from later generations and wants to subdue the mind. In the morning he uses a hundred medicines, in the morning he uses a hundred medicines, and in the evening he uses a hundred medicines. Through voidness and without ideation he wishes to stop and observe cessation.",
        "source": "T04n0212_030:0774b12_8"
    },
    {
        "source_sentence": "用療心病使得除愈，能具此者故曰梵志。」",
        "translation": "He's called a priest because he uses it to treat mental illnesses and make them healed, and someone who can do so is called a priest.",
        "source": "T04n0212_030:0774b14_9"
    },
    {
        "source_sentence": "是故說曰，遠逝獨遊，隱藏無形，難降能降，是謂梵志。",
        "translation": "Therefore, it's said, 'I'm traveling alone from afar, hiding in formlessness, and it's difficult to subdue or be able to subdue.' This is called a priest.",
        "source": "T04n0212_030:0774b15_0"
    },
    {
        "source_sentence": "　無色不可見，　　此亦不可見，",
        "translation": "The formless [realm] is invisible, and this [realm] is also invisible.",
        "source": "T04n0212_030:0774b17_0"
    },
    {
        "source_sentence": "　解知此句者，　　念則有所由，",
        "translation": "To understand and know this phrase, there’s a reason for mindfulness:",
        "source": "T04n0212_030:0774b18_0"
    },
    {
        "source_sentence": "　覺知結使盡，　　是世最梵志。",
        "translation": "Knowing the end of the bonds and tendencies, he's the most brahmin in the world.",
        "source": "T04n0212_030:0774b19_0"
    },
    {
        "source_sentence": "無色不可見者，何者？",
        "translation": "What's formless and invisible?",
        "source": "T04n0212_030:0774b20_0"
    },
    {
        "source_sentence": "心也？",
        "translation": "It's also mind?",
        "source": "T04n0212_030:0774b20_1"
    },
    {
        "source_sentence": "夫心興患與身招殃，猶若象馬剛強[怡-台+龍]戾不調，有目之士加於捶杖，",
        "translation": "They're like elephants and horses that are rigid [yi-tai+nāga] and disobedient, and the man with eyes adds a cane to his beating stick.",
        "source": "T04n0212_030:0774b20_2"
    },
    {
        "source_sentence": "使知楚痛，然後調良？",
        "translation": "If you know the pain, then you'll be well-adjusted?",
        "source": "T04n0212_030:0774b22_3"
    },
    {
        "source_sentence": "人心為患，牽致地獄餓鬼畜生，雖得為人處在卑賤，顏色醜陋為人所嫉，",
        "translation": "Their minds are troubled, leading to hell, hungry ghosts, animals, and sentient beings. Although they may be human or inferior, their appearance is ugly and despised by the people.",
        "source": "T04n0212_030:0774b22_4"
    },
    {
        "source_sentence": "是故說曰？",
        "translation": "That's why it's said?",
        "source": "T04n0212_030:0774b24_5"
    },
    {
        "source_sentence": "無色不可見，此亦不可見？",
        "translation": "What's invisible in formlessness, and what's invisible here?",
        "source": "T04n0212_030:0774b24_6"
    },
    {
        "source_sentence": "解知此句者？",
        "translation": "Understanding and knowing this phrase?",
        "source": "T04n0212_030:0774b25_7"
    },
    {
        "source_sentence": "念則有所由？",
        "translation": "Then what is the reason for mindfulness?",
        "source": "T04n0212_030:0774b25_8"
    },
    {
        "source_sentence": "覺知結使盡？",
        "translation": "Do you perceive the end of the bonds and tendencies?",
        "source": "T04n0212_030:0774b25_9"
    },
    {
        "source_sentence": "是世最梵志。",
        "translation": "He's the world's greatest priest.",
        "source": "T04n0212_030:0774b25_10"
    },
    {
        "source_sentence": "諸佛世尊所以出世者，正欲降此弊惡之心，諸佛世尊慈慜一切，弘慈普蓋靡所不照，",
        "translation": "The reason the buddhas and world-honored ones appear in the world is precisely because they want to subdue this unwholesome state of mind. The buddhas and world-honored ones have compassion for all living beings, extending great benevolence everywhere without fail.",
        "source": "T04n0212_030:0774b26_11"
    },
    {
        "source_sentence": "雖處於世無所染著。",
        "translation": "Even though it's in the world, there's no defiled attachment.",
        "source": "T04n0212_030:0774b28_12"
    },
    {
        "source_sentence": "　斷生死河，　　能忍超度，　　自覺出壍，",
        "translation": "Cutting the river of birth and death, he’s able to tolerate and transcend it. He knows for himself that he’s gotten rid of anger.",
        "source": "T04n0212_030:0774b29_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0774c01_0"
    },
    {
        "source_sentence": "如彼行人為五欲所繫，流轉生死之河，要須大聖指授權宜，從此岸得至彼岸。",
        "translation": "Suppose that practitioner is bound by the five desires and flowing through the river of birth-and-death, and he requires a great sage to point out what's appropriate for him so he can go from this side to the other side.",
        "source": "T04n0212_030:0774c02_0"
    },
    {
        "source_sentence": "如來降形非事不豫，要接有緣後乃滅度。",
        "translation": "The Tathāgata descends in form without preparation, and it's only after he meets with conditions that he'll be liberated.",
        "source": "T04n0212_030:0774c03_1"
    },
    {
        "source_sentence": "壍者憍慢之壍，能度此壍不為憍慢所繫。",
        "translation": "Anger is the anger of arrogance, and he's able to overcome this anger and isn't bound by arrogance.",
        "source": "T04n0212_030:0774c04_2"
    },
    {
        "source_sentence": "能具此者故名為梵志。",
        "translation": "Those who can fulfill this are therefore called priests.",
        "source": "T04n0212_030:0774c05_3"
    },
    {
        "source_sentence": "是故說曰，斷生死河，能忍超度，自覺出壍，是謂梵志。",
        "translation": "Therefore, it's said, 'I cut off the river of birth and death, tolerate transcendence, and self-realize on my own to escape anger.' This is called a priest.",
        "source": "T04n0212_030:0774c06_4"
    },
    {
        "source_sentence": "　當求截流渡，　　梵志無有欲，",
        "translation": "They should seek to cut off the flow and cross. The brahmins have no desire,",
        "source": "T04n0212_030:0774c08_0"
    },
    {
        "source_sentence": "　內自觀諸情，　　是謂為梵志，",
        "translation": "This is called a brahmin who observes all sentient beings internally.",
        "source": "T04n0212_030:0774c09_0"
    },
    {
        "source_sentence": "　能知如是者，　　乃復為梵志。",
        "translation": "Those who can know it like this Will again become priests.",
        "source": "T04n0212_030:0774c10_0"
    },
    {
        "source_sentence": "如彼行人不斷愛流四駛四淵者，進趣於道不亦難乎？",
        "translation": "If that practitioner doesn't stop the four rivers of craving and the four fast-moving four abysses, isn't it difficult for him to advance on the path?",
        "source": "T04n0212_030:0774c11_0"
    },
    {
        "source_sentence": "如河暴溢必有所傷，梵志貪欲死趣惡道。",
        "translation": "Like a river that overflows violently and must surely inflict harm, the priest craves death and goes to a bad destiny.",
        "source": "T04n0212_030:0774c12_1"
    },
    {
        "source_sentence": "是以如來誡以除貪，與說欲本污穢不淨，當斷諸邪使不流馳。",
        "translation": "That's why the Tathāgata admonished him to remove craving and explain that desire is inherently defiled and impure, and he will stop the wrong tendencies that don't flow.",
        "source": "T04n0212_030:0774c13_2"
    },
    {
        "source_sentence": "能具此眾行者故名為梵志。",
        "translation": "Those who can fulfill these many practices are therefore called priests.",
        "source": "T04n0212_030:0774c14_3"
    },
    {
        "source_sentence": "是故說曰，當求截流渡，梵志無有欲，內自觀諸情，是謂為梵志，能知如是者，",
        "translation": "Therefore, it is said, “You should seek to cut off the flow of water and cross the river.” The brahmins have no desire. They internally examine their own feelings. This is called a brahmin.",
        "source": "T04n0212_030:0774c15_4"
    },
    {
        "source_sentence": "乃名為梵志。",
        "translation": "He's called a priest.",
        "source": "T04n0212_030:0774c16_5"
    },
    {
        "source_sentence": "　先去其母，　　王及二臣，　　盡勝境界，",
        "translation": "He had previously left his mother, the king, and two ministers, To reach the sphere of ultimate victory.",
        "source": "T04n0212_030:0774c18_0"
    },
    {
        "source_sentence": "　是謂梵志。",
        "translation": "This is called a priest.",
        "source": "T04n0212_030:0774c19_0"
    },
    {
        "source_sentence": "先去其母者，愛心流馳以為源本，無漏意識能去斯病使盡無餘。",
        "translation": "Those who first leave their mother are the source of the flow of craving, and uncontaminated consciousness can remove this illness so that it's completely eliminated without remainder.",
        "source": "T04n0212_030:0774c20_0"
    },
    {
        "source_sentence": "王者我慢也，二臣戒盜身見。",
        "translation": "The king is self-conceited, and the two ministers adhere to the view of stealing their bodies.",
        "source": "T04n0212_030:0774c21_1"
    },
    {
        "source_sentence": "盡勝境界者，一切諸結使，能去眾結之患。",
        "translation": "The supreme realm of exhaustion means that all the bonds and tendencies are able to remove the afflictions of the bonds.",
        "source": "T04n0212_030:0774c22_2"
    },
    {
        "source_sentence": "故曰為梵志。",
        "translation": "That's why it's called a priest.",
        "source": "T04n0212_030:0774c23_3"
    },
    {
        "source_sentence": "是故說曰，先去其母，王及二臣，盡勝境界，是謂梵志。",
        "translation": "Therefore, it's said, 'First, go away from your mother, the king, and two ministers, and reach the superior realm.' This is called a priest.",
        "source": "T04n0212_030:0774c23_4"
    },
    {
        "source_sentence": "　不捶梵志，　　不放梵志，　　咄捶梵志，",
        "translation": "He doesn't strike priests, doesn't release priests, and duels priests.",
        "source": "T04n0212_030:0774c25_0"
    },
    {
        "source_sentence": "　放者亦咄。",
        "translation": "The one who releases it is also dumb.",
        "source": "T04n0212_030:0774c26_0"
    },
    {
        "source_sentence": "所謂梵志者，得阿羅漢道，不得以手捲刀杖加彼真人，不放梵志者，此是真人，",
        "translation": "The so-called brahmin attains the path of arhatship, but he mustn't offer his hand up a sword or stick to that real person. He who doesn't let go of the brahmin is this real person.",
        "source": "T04n0212_030:0774c27_0"
    },
    {
        "source_sentence": "恒當供養衣被服飯食床臥具病瘦醫藥，四事供養令不減少。",
        "translation": "They should always make offerings of clothing, food and drink, beds, bedding, medicine for illness and thinness, and four kinds of offerings so that they don't decrease.",
        "source": "T04n0212_030:0774c28_1"
    },
    {
        "source_sentence": "咄捶梵志，行惡之人，放者亦咄，復是惡人，不留供養飲食床臥具病瘦醫藥，",
        "translation": "Again, this is a bad person who doesn't allow offerings of food, drink, beds, bedding, and medicine for illness and thinness.",
        "source": "T04n0212_030:0775a01_2"
    },
    {
        "source_sentence": "能具此行故名為梵志。",
        "translation": "Because they can fulfill these practices, they're called priests.",
        "source": "T04n0212_030:0775a02_3"
    },
    {
        "source_sentence": "是故說曰，不捶梵志，不放梵志，咄捶梵志，放者亦咄。",
        "translation": "That's why it's said, Don't strike a priest, don't release the priest, beat the priest, and let him go.",
        "source": "T04n0212_030:0775a03_4"
    },
    {
        "source_sentence": "　諸有知深法，　　不問老以少，",
        "translation": "Those who know the profound teaching don’t ask about old age and youth.",
        "source": "T04n0212_030:0775a05_0"
    },
    {
        "source_sentence": "　審諦守戒信，　　猶祀火梵志。",
        "translation": "He observes the precepts with caution and faith, just like a fire priest who sacrifices his body.",
        "source": "T04n0212_030:0775a06_0"
    },
    {
        "source_sentence": "昔佛在世周旋教化。",
        "translation": "In the past, when the Buddha was in the world, he circled around and taught.",
        "source": "T04n0212_030:0775a07_0"
    },
    {
        "source_sentence": "時諸比丘不廣多聞，爾時世尊便作是念：「今諸比丘多有懈怠意不精懃，",
        "translation": "The monks weren't well-versed, and it was then that the Bhagavān had this thought, Now, many monks are lazy and lack energy.",
        "source": "T04n0212_030:0775a07_1"
    },
    {
        "source_sentence": "復自觀察當來過去三世之事，知當來世當有比丘，嫉妬恚癡不順道教，",
        "translation": "Again, he observed for himself the events of the three past ages in the future and knew that there would be monks in future ages who were jealous, wicked, and deluded, not following the path.",
        "source": "T04n0212_030:0775a09_2"
    },
    {
        "source_sentence": "便興誹謗損如來法輕慢於師，亦復不敬說法之人。」",
        "translation": "They then denigrate the Tathāgata's teaching and despise their teacher, and they don't venerate those who teach the Dharma.",
        "source": "T04n0212_030:0775a10_3"
    },
    {
        "source_sentence": "是以世尊觀察後世遺法中間，恐有老少共相上下尊卑不別，老恃耆艾少恃聰叡。",
        "translation": "That's why the Bhagavān observed the legacy of the teachings of later generations, fearing that there would be old and young people who shared the same characteristics with each other, superior and inferior beings wouldn't be distinguished, and old people relied on senior citizens and those who relied on wise people.",
        "source": "T04n0212_030:0775a11_4"
    },
    {
        "source_sentence": "老者自陳：「吾所目覩，非卿所知，汝今所見如螢火虫。」",
        "translation": "The old man said to himself, I don't know what you see with my eyes; what you see now is like a firefly.",
        "source": "T04n0212_030:0775a13_5"
    },
    {
        "source_sentence": "少者自陳：「老頓嚚鹵，情喪心塞，知何可歸？」",
        "translation": "The younger one said to himself, Old man, I'm so sad and saddened that my heart is overcome with grief, so how can I return?",
        "source": "T04n0212_030:0775a15_0"
    },
    {
        "source_sentence": "如來教曰：「當自守戒，猶若事火梵志五處然火，晝夜承事不失時節，",
        "translation": "The Tathāgata taught them, You should observe the precepts for yourself, just as if you serve a fire priest or brahmin in five places who are on fire and serve him day and night without losing time.",
        "source": "T04n0212_030:0775a16_0"
    },
    {
        "source_sentence": "香華繒綵事事供養。」",
        "translation": "Incense, flowers, garlands, silk, and other things are offered as offerings.",
        "source": "T04n0212_030:0775a17_1"
    },
    {
        "source_sentence": "是故說曰，諸有知深法，不問老以少，審諦守戒信，猶祀火梵志，歸命人中尊，",
        "translation": "Therefore, it is said, “Those who know the profound doctrine and do not ask questions regarding old age or youthfulness should carefully observe precepts and believe in them. They should pay homage to the brahmin Fiery Fire (i.e., Vimalakīrti) as one of the most venerable among men.",
        "source": "T04n0212_030:0775a18_0"
    },
    {
        "source_sentence": "亦如事火神。",
        "translation": "It's also like serving the fire deity.",
        "source": "T04n0212_030:0775a19_1"
    },
    {
        "source_sentence": "　諸有知深法，　　等覺之所說，",
        "translation": "All those who know the profound Dharma Are taught by the Equanimous Enlightened Ones.",
        "source": "T04n0212_030:0775a20_0"
    },
    {
        "source_sentence": "　審諦守戒信，　　猶祀火梵志。",
        "translation": "He observes the precepts with caution and faith, just like a fire priest who sacrifices his body.",
        "source": "T04n0212_030:0775a21_0"
    },
    {
        "source_sentence": "如來出現，億千萬劫時時乃出，遭賢遇聖實不可得，人能守戒信不失儀，",
        "translation": "When the Tathāgata appears, it's a hundred million eons before he emerges. It's really unobtainable to meet goodness and holiness, but people can observe precepts and believe without losing their manner.",
        "source": "T04n0212_030:0775a22_0"
    },
    {
        "source_sentence": "如祀火梵志。",
        "translation": "It's like the fire-worshiping priest.",
        "source": "T04n0212_030:0775a23_1"
    },
    {
        "source_sentence": "昔佛在世誡諸比丘：「自今以後不得誦外書外道異學所誦習者。",
        "translation": "In the past, when the Buddha was in the world, he admonished the monks, From now on, you mustn't recite non-Buddhist books or those recited by non-Buddhist practitioners.",
        "source": "T04n0212_030:0775a23_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T04n0212_030:0775a25_3"
    },
    {
        "source_sentence": "彼所陳說非真正義，亦復不是至道之本。」",
        "translation": "What they teach is not the true meaning, and it's also not the root of the ultimate path.",
        "source": "T04n0212_030:0775a25_4"
    },
    {
        "source_sentence": "是故說曰，諸有知深法，等覺之所說，審諦守戒信，猶祀火梵志，真誠歸命佛。",
        "translation": "Therefore, it's said, 'There are people who know the profound teaching taught by the virtually enlightened ones and carefully observe precepts and faith, just like paying homage to the fire priest and truly returning to the Buddha.'",
        "source": "T04n0212_030:0775a26_5"
    },
    {
        "source_sentence": "　於己法在外，　　梵志為最上，",
        "translation": "The brahmins are the foremost of those who do not abide by their own doctrine.",
        "source": "T04n0212_030:0775a29_0"
    },
    {
        "source_sentence": "　一切諸有漏，　　皆盡皆無餘。",
        "translation": "All the contaminants are completely extinguished without remainder.",
        "source": "T04n0212_030:0775b01_0"
    },
    {
        "source_sentence": "　或復觀於痛，　　皆盡皆無餘，",
        "translation": "Or they may also observe that all pains Are completely extinguished without remainder.",
        "source": "T04n0212_030:0775b02_0"
    },
    {
        "source_sentence": "　或復觀合會，　　皆盡皆無餘。",
        "translation": "Or they may also contemplate the conjunction, which is exhausted without remainder.",
        "source": "T04n0212_030:0775b03_0"
    },
    {
        "source_sentence": "　或復觀因緣，　　皆盡皆無餘。",
        "translation": "Or they may also observe the causes and conditions, which are all exhausted without remainder.",
        "source": "T04n0212_030:0775b04_0"
    },
    {
        "source_sentence": "於己法在外者，彼脩行人觀了一切眾法，無事不關無事不知，猶若梵志知天文地理星宿災變皆悉觀了，",
        "translation": "“Those outside the bounds of their own doctrine”: Those practitioners of the path observe all things. They know nothing about anything, are not concerned with anything, and do not know anything. Just as if a brahmin were to know astronomy, geography, stars, constellations, and calamities, they would be able to see them all.",
        "source": "T04n0212_030:0775b05_0"
    },
    {
        "source_sentence": "一切諸漏皆盡無餘。",
        "translation": "All the contaminants are completely extinguished without remainder.",
        "source": "T04n0212_030:0775b07_1"
    },
    {
        "source_sentence": "觀諸苦痛若好若醜，皆歸於盡，觀其合會必有離別因緣，暫有亦復歸滅。",
        "translation": "He observes that pain and suffering, whether good or bad, all return to extinction, and he observes that when they are united, there must be separate causes and conditions that are free from each other, and that what's temporary also returns to extinction.",
        "source": "T04n0212_030:0775b07_2"
    },
    {
        "source_sentence": "　猶若內法本，　　梵志為在表，",
        "translation": "It's like the case with the internal source of the Dharma, where a priest is present on the surface.",
        "source": "T04n0212_030:0775b10_0"
    },
    {
        "source_sentence": "　若使共床褥，　　如彼婆鉤盧。",
        "translation": "If someone shares a bed and mattress, it's like that Bhagavān.",
        "source": "T04n0212_030:0775b11_0"
    },
    {
        "source_sentence": "所謂內法者，四諦真如一一分別不失次緒，梵志於內則謂為表。",
        "translation": "The so-called internal dharmas are truly the four truths that are discerned one by one and don't lose their sequential order, and priests call them manifestations inside.",
        "source": "T04n0212_030:0775b12_0"
    },
    {
        "source_sentence": "是故說曰，猶若內法本，梵志為在表，若使共床褥，如婆鉤盧者。",
        "translation": "That's why it's said, 'Suppose there's an inner dharma-本, and a priest is present on the surface, or if he causes them to share a bed or bedding, like a pohula.'",
        "source": "T04n0212_030:0775b13_1"
    },
    {
        "source_sentence": "此婆鉤盧比丘出家以來，未曾與人說四句之義，正使與共同坐不聞說其正法，",
        "translation": "Having renounced the householder’s life, this bhikṣu Bakkula had never taught a four-line doctrine to anyone before. He simply invited them to sit with him and did not hear him teach the Dharma.",
        "source": "T04n0212_030:0775b14_2"
    },
    {
        "source_sentence": "從生至老八十一鉢和藍，未曾畜沙彌弟子及餘使人，若為人鮮潔託志虛無繫意玄寂。",
        "translation": "From birth until the old age of eighty-one years old, he had never held a novice disciple or other messengers, and if he entrusted his intention to someone who was pure and pure with no binding thoughts or mysterious quiescence.",
        "source": "T04n0212_030:0775b16_3"
    },
    {
        "source_sentence": "是故說曰，若使共床褥，如彼婆鉤盧。",
        "translation": "That's why it's said, 'Suppose someone were to share a bed and mattress with them, just like that Bhagavān.",
        "source": "T04n0212_030:0775b18_4"
    },
    {
        "source_sentence": "　猶如內法，　　梵志在表，　　知生知老，",
        "translation": "It's like the internal dharma, where a priest is present and knows birth and old age.",
        "source": "T04n0212_030:0775b20_0"
    },
    {
        "source_sentence": "　轉當至死。",
        "translation": "He'll go to death in the future.",
        "source": "T04n0212_030:0775b21_0"
    },
    {
        "source_sentence": "所謂內法者不誑惑人，一向而無傾，一向而無邪，唯有如來能越此境界，",
        "translation": "The so-called internal doctrine is that it does not deceive others. It is unified without overturning or tilting, and unified without error. Only the Tathāgata can transcend this sphere.",
        "source": "T04n0212_030:0775b22_0"
    },
    {
        "source_sentence": "以盡其生更不受有，如實知之。",
        "translation": "He knows it as it really is because he ends his birth and doesn't experience existence again.",
        "source": "T04n0212_030:0775b23_1"
    },
    {
        "source_sentence": "是故說曰，猶若內法，梵志在表，知生知老，轉當至死。",
        "translation": "Therefore, it's said, 'Suppose there's an internal dharma where a priest is on the surface and knows birth and knows old age, which will lead to death.",
        "source": "T04n0212_030:0775b24_2"
    },
    {
        "source_sentence": "　日照於晝，　　月照於夜，　　甲兵照軍，",
        "translation": "The sun shines during the day, the moon shines at night, armor and troops illuminate the army.",
        "source": "T04n0212_030:0775b26_0"
    },
    {
        "source_sentence": "　禪照道人，　　佛出天下，　　照一切冥。",
        "translation": "The practitioner of meditation shines brightly, and the Buddha emerges from the world to illuminate all the darkness.",
        "source": "T04n0212_030:0775b27_0"
    },
    {
        "source_sentence": "日照於晝者，當日天子初出之時，放億百千萬光明，使星宿月光無復光明；",
        "translation": "“The sun illumines the day”: When the sun god first appears, it emits billions of millions of rays of light so that the stars, constellations, and moons cannot shine brightly again.",
        "source": "T04n0212_030:0775b28_0"
    },
    {
        "source_sentence": "若復日沒之時，月及星宿皆共競明，俱有所照其明不同。",
        "translation": "Again, when the sun goes down, the moon and the stars all compete for their luminosity, and there's something to illuminate that differs in its luminosity.",
        "source": "T04n0212_030:0775b29_1"
    },
    {
        "source_sentence": "猶若大將之士兩敵相向，揚威奮武決戰勝負，震赫精刃鍾皷雷鳴。",
        "translation": "It's like when a general's men and two enemies face each other, expressing their authority and arrogance to determine victory and defeat, and the bell chimes and thunder sounds with the sword of Shakyamuni.",
        "source": "T04n0212_030:0775c02_2"
    },
    {
        "source_sentence": "禪定之人移山飛岳海水揚塵手捫日月，有此神力不自稱譽。",
        "translation": "A person in meditation moves mountains, flies up a mountain, and raises dust from the ocean water with his hands to touch the sun and moon, but he has this supernormal power that doesn't praise himself.",
        "source": "T04n0212_030:0775c03_3"
    },
    {
        "source_sentence": "方此諸人雖有此德，不及如來。",
        "translation": "Even though these people had such virtues, they weren't as good as the Tathāgata.",
        "source": "T04n0212_030:0775c05_0"
    },
    {
        "source_sentence": "佛出世間眾相具足，放大光明靡所不照，光明所及晝夜不絕，其見光者聾盲瘖瘂考掠苦痛自然休息。",
        "translation": "The Buddha appeared in the world, endowed with all characteristics, emanating great rays of light that illuminate everything without fail. His rays of light extended day and night without ceasing; those who saw them were deaf, blind, dumb, and crippled, and their pain and suffering passed away spontaneously.",
        "source": "T04n0212_030:0775c05_1"
    },
    {
        "source_sentence": "是故說曰，如日照於晝，月照於夜，甲兵照軍，禪照道人，佛出天下，",
        "translation": "Thus it is said, “Suppose the sun shines during the day and the moon shines at night. The armed soldiers shine to the armies [of the enemy]. Meditation shines to the religious practitioners.",
        "source": "T04n0212_030:0775c08_2"
    },
    {
        "source_sentence": "照一切冥。",
        "translation": "It illuminates all the darkness.",
        "source": "T04n0212_030:0775c09_3"
    },
    {
        "source_sentence": "　梵志無有是，　　有憂無憂念，",
        "translation": "There’s no such thing as a priest who has sorrow and no sorrowful thoughts.",
        "source": "T04n0212_030:0775c10_0"
    },
    {
        "source_sentence": "　如如意所轉，　　彼彼滅狐疑。",
        "translation": "As it's turned by supernormal power, they all cease doubt and doubt.",
        "source": "T04n0212_030:0775c11_0"
    },
    {
        "source_sentence": "梵志無有是，意著於殊妙之法，見樂不以為喜，見憂不以為慼，如如意所轉恒自念善，",
        "translation": "There is nothing like this in a brahmin’s way of thinking: “I am attached to marvelous things. When I see happiness, I do not think of it as joy; when I see sorrow, I do not think of it as anguish.",
        "source": "T04n0212_030:0775c12_0"
    },
    {
        "source_sentence": "彼彼自滅惡，得習聖諦分別諸使。",
        "translation": "They themselves cease evil and attain the cultivation of the noble truth that discerns the afflictive tendencies.",
        "source": "T04n0212_030:0775c14_0"
    },
    {
        "source_sentence": "是故說曰，梵志無有是，有憂無憂念，如如意所轉，彼彼滅狐疑。",
        "translation": "Therefore, it's said, There's no such thing as a priest who has sorrow and no sorrowful thoughts and thus acts according to his wishes, and then he or she ceases doubt.",
        "source": "T04n0212_030:0775c14_1"
    },
    {
        "source_sentence": "　出生諸深法，　　梵志習入禪，",
        "translation": "They give rise to profound teachings, and the priests practice and enter meditation.",
        "source": "T04n0212_030:0775c17_0"
    },
    {
        "source_sentence": "　能解狐疑網，　　身知其苦痛。",
        "translation": "Being able to untangle the web of doubt, they know their pain and suffering in body.",
        "source": "T04n0212_030:0775c18_0"
    },
    {
        "source_sentence": "如來等正覺初成佛時，七日之中禪定正受思惟十二因緣，一一分別知起知滅。",
        "translation": "When the Tathāgatas and other perfectly enlightened people first become buddhas, they meditate in meditation for seven days to contemplate twelve causes and conditions, each one of which are discerned as arising and ceasing with knowledge.",
        "source": "T04n0212_030:0775c19_0"
    },
    {
        "source_sentence": "「出生諸深法，　　梵志習入禪，",
        "translation": "Producing profound dharmas, the priest cultivates and enters meditation.",
        "source": "T04n0212_030:0775c20_1"
    },
    {
        "source_sentence": "　能解狐疑網，　　身知其苦痛。",
        "translation": "Being able to untangle the web of doubt, they know their pain and suffering in body.",
        "source": "T04n0212_030:0775c20_1"
    },
    {
        "source_sentence": "爾時如來即從三昧起而說斯偈：「如我所習積行所致，今日成等正覺實而不虛。」",
        "translation": "It was then that the Tathāgata rose from his samādhi and spoke this verse, As a result of my accumulated practices, today I've become perfectly enlightened, which are real and not false.",
        "source": "T04n0212_030:0775c20_1"
    },
    {
        "source_sentence": "梵志習入禪，去諸惡法悉壞狐疑網，於諸深法得無礙智，所念自在深知苦際，",
        "translation": "The brahmin practices entering meditation, getting rid of bad qualities and completely destroying the web of doubt. He attains unhindered knowledge of all profound truths and freely knows the limits of suffering in whatever he thinks.",
        "source": "T04n0212_030:0775c25_2"
    },
    {
        "source_sentence": "深知因緣合數之法權詐非實。",
        "translation": "They deeply know that the combined number of causes and conditions are dharmas that are deceptive and not real.",
        "source": "T04n0212_030:0775c26_3"
    },
    {
        "source_sentence": "略誦其要，當觀因緣法，復當觀盡法，一切諸法皆由合數，一切諸法皆由於痛，",
        "translation": "If you recite this sutra briefly, you should contemplate the causal principle and also contemplate the exhaustive principle. All things arise by reason of conjunction, and all things are due to pain.",
        "source": "T04n0212_030:0775c27_4"
    },
    {
        "source_sentence": "當知盡滅不造有漏。",
        "translation": "You should know that it's completely extinguished and doesn't create contaminants.",
        "source": "T04n0212_030:0775c29_5"
    },
    {
        "source_sentence": "　出生諸深法，　　梵志習入禪，",
        "translation": "They give rise to profound teachings, and the priests practice and enter meditation.",
        "source": "T04n0212_030:0776a01_0"
    },
    {
        "source_sentence": "　遍照一切世，　　猶日在虛空。",
        "translation": "It illuminates all worlds, just like the sky shining brightly.",
        "source": "T04n0212_030:0776a02_0"
    },
    {
        "source_sentence": "法能成人非法不就，晝夜思惟不去胸懷，身口意行不妄有犯，能成就如此法，",
        "translation": "The Dharma is capable of adulthood and not acting according to the law, day and night reflecting without going back or forth in one’s chest; bodily, verbal, and mental action are not falsely transgressive. It can accomplish such a dharma.",
        "source": "T04n0212_030:0776a03_0"
    },
    {
        "source_sentence": "便能照一切法。",
        "translation": "It's then possible to illuminate all dharmas.",
        "source": "T04n0212_030:0776a04_1"
    },
    {
        "source_sentence": "以己所得盡施眾生，猶若明日處在虛空普有所照，其有覩者莫不蒙光。",
        "translation": "They give whatever they have to sentient beings, just as if they were to be in space on the morrow and had something to illuminate them all, and those who are angry won't fail to receive their light.",
        "source": "T04n0212_030:0776a05_2"
    },
    {
        "source_sentence": "是故說曰，出生諸深法，梵志習入禪，遍照一切世，猶日在虛空。",
        "translation": "That's why it's said that profound dharmas arise, and the priest who cultivates entry into meditation universally illuminates all worlds like a sun in space.",
        "source": "T04n0212_030:0776a06_3"
    },
    {
        "source_sentence": "　出生諸深法，　　梵志習入禪，",
        "translation": "They give rise to profound teachings, and the priests practice and enter meditation.",
        "source": "T04n0212_030:0776a09_0"
    },
    {
        "source_sentence": "　能却魔眾敵，　　如佛脫眾垢。",
        "translation": "He can ward off the enemies of Māra, just like the Buddha who frees himself from all defilements.",
        "source": "T04n0212_030:0776a10_0"
    },
    {
        "source_sentence": "出生諸深法者，如來成等正覺，具足三十七道品之法，身口意行與無漏相應，",
        "translation": "The profound dharmas that arise are the Tathāgata's attainment of perfect enlightenment, which is fully endowed with the thirty-seven factors of the path. bodily, verbal, and mental actions are associated with the pure ones.",
        "source": "T04n0212_030:0776a11_0"
    },
    {
        "source_sentence": "降伏魔怨進却時宜，如來等正覺脫一切結使。",
        "translation": "When the time is right to subdue Māra's enemies and advance, the Tathāgata and other perfectly enlightened ones are freed from all the bonds and tendencies.",
        "source": "T04n0212_030:0776a12_1"
    },
    {
        "source_sentence": "出曜經卷第三十",
        "translation": "出曜經卷第三十",
        "source": "T04n0212_030:0776a14_0"
    }
]