[
    {
        "source_sentence": "佛說大魚事經",
        "translation": "Foshuo daioshi jing",
        "source": "T04n0216_001:0800c17_0"
    },
    {
        "source_sentence": "東晉天竺三藏竺曇無蘭譯",
        "translation": "Translated by the translator of the Tripiṭaka of Tianzhusa in the Eastern Jin Dynasty, Zhu Dharmarman",
        "source": "T04n0216_001:0800c19_0"
    },
    {
        "source_sentence": "聞如是：一時婆伽婆在舍衛城，祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī.",
        "source": "T04n0216_001:0800c20_0"
    },
    {
        "source_sentence": "爾時世尊，告諸比丘：「往昔時，有一水，饒諸大魚。",
        "translation": "It was then that the Bhagavān addressed the monks, In the past, there was a river of water that fed large fish.",
        "source": "T04n0216_001:0800c21_1"
    },
    {
        "source_sentence": "「爾時大魚勅小魚曰：『汝等莫離此間往他處所，備為惡人所得。』",
        "translation": "It was then that the large fish commanded the small fish, saying, 'Don't leave this place and go to another place for the sake of bad people.'",
        "source": "T04n0216_001:0800c22_2"
    },
    {
        "source_sentence": "「爾時小魚，不從大魚教，便往至他處所。",
        "translation": "At the time, the small fish didn't follow the instructions of the large fish, so they went to another place.",
        "source": "T04n0216_001:0800c23_3"
    },
    {
        "source_sentence": "「爾時魚師，以飯網羅線捕諸魚，諸小魚見，便趣大魚處所。",
        "translation": "At the time, the fisherman caught all the fish with a net of rice and lined it up; but when the small fish saw him, they went to where the large fish lived.",
        "source": "T04n0216_001:0800c24_4"
    },
    {
        "source_sentence": "「爾時大魚見小魚來，便問小魚曰：『汝等莫離此間往至他所。』",
        "translation": "Seeing the small fish coming, the large fish asked the small fish, 'Don't leave here and go to another place.'",
        "source": "T04n0216_001:0800c25_5"
    },
    {
        "source_sentence": "爾時小魚便答大魚曰：『我等向者以至他所來。』",
        "translation": "It was then that the small fish answered the large fish, saying, 'We'll go to someone else.'",
        "source": "T04n0216_001:0800c27_6"
    },
    {
        "source_sentence": "「大魚便勅小魚曰：『汝等至他所，不為羅網取捕耶？』",
        "translation": "The large fish then commanded the small fish, saying, 'Do you go to another place and don't catch it with a net?'",
        "source": "T04n0216_001:0800c28_7"
    },
    {
        "source_sentence": "「小魚答大魚曰：『我等至彼，不為人所捕，然遙見長線尋我後。』",
        "translation": "The small fish answered the large fish, 'We went there and weren't caught by anyone, but we saw a long line from a distance looking for me.'",
        "source": "T04n0216_001:0800c29_8"
    },
    {
        "source_sentence": "「大魚便語小魚曰：『汝等以為所害，所以然者，汝所遙見線尋後來者，",
        "translation": "The big fish said to the small fish, “You are killing me for my sake.",
        "source": "T04n0216_001:0801a01_9"
    },
    {
        "source_sentence": "昔先祖父母，盡為此線所害，汝今必為所害，汝非我兒。』",
        "translation": "In the past, my ancestors and parents were all harmed by this thread, but now you must have been harmed; you're not my child.'",
        "source": "T04n0216_001:0801a03_10"
    },
    {
        "source_sentence": "「爾時小魚，盡為魚師所捕，舉著岸上，如是小魚、大魚有死者，此亦如是。",
        "translation": "At the time, all the small fish were caught by the fisherman and raised to shore.",
        "source": "T04n0216_001:0801a04_11"
    },
    {
        "source_sentence": "「或有一比丘，在他聚落遊行，著衣持鉢，周行乞食，福度眾生；",
        "translation": "“Suppose there is a monk who, while wandering in another village, puts on his outer robe, takes his bowl, and goes around begging for food to save sentient beings.",
        "source": "T04n0216_001:0801a06_12"
    },
    {
        "source_sentence": "不守護身，不守護口意，不具足諸根，意不專一。",
        "translation": "They don't guard body, don't guard speech and thought, don't have the faculties, and don't concentrate their thoughts on one thing.",
        "source": "T04n0216_001:0801a07_13"
    },
    {
        "source_sentence": "「即於彼村落乞食，時見諸女人端正無雙，色猶桃華，見已便起婬心，",
        "translation": "“When he was begging for food in that village, he saw women of the same color as peach blossoms. Seeing them, he became angry and thought:",
        "source": "T04n0216_001:0801a09_0"
    },
    {
        "source_sentence": "以此婬心，身口意熾然。",
        "translation": "Because of this angry mind, his body, speech, and thought are blazing hot.",
        "source": "T04n0216_001:0801a10_1"
    },
    {
        "source_sentence": "「彼以身口意熾然，即於村落乞食，還所止處，故發欲想。",
        "translation": "Because their bodies, mouths, and minds are blazing hot, they beg for food in a village and return to the place where they live.",
        "source": "T04n0216_001:0801a11_2"
    },
    {
        "source_sentence": "「便往尊比丘所，以此因緣，具向諸比丘說。",
        "translation": "“Then he went to the place where the venerable bhikṣu was staying and explained these reasons in detail to the monks.",
        "source": "T04n0216_001:0801a12_3"
    },
    {
        "source_sentence": "「諸尊大比丘，告此比丘言：『汝起婬想，此不為淨。",
        "translation": "Venerable monks, the great monks told this monk, 'You give rise to thoughts of anger, which aren't pure.",
        "source": "T04n0216_001:0801a13_4"
    },
    {
        "source_sentence": "汝比丘！",
        "translation": "You monks!",
        "source": "T04n0216_001:0801a14_5"
    },
    {
        "source_sentence": "當惡露觀。』",
        "translation": "You should badly expose yourself and contemplate.'",
        "source": "T04n0216_001:0801a14_6"
    },
    {
        "source_sentence": "「尊大比丘，語復至再三。",
        "translation": "“The venerable monk, the great monk, spoke again and again.",
        "source": "T04n0216_001:0801a15_0"
    },
    {
        "source_sentence": "「爾時彼比丘，身口意熾盛，復至彼村落乞食，遙見女人端正無比，色猶桃華，",
        "translation": "At that time, the bhikṣu was overcome with physical and mental fever. Then he went back to his village to solicit alms. Seeing from a distance that the woman’s appearance was incomparably beautiful like that of a peach flower, he",
        "source": "T04n0216_001:0801a15_1"
    },
    {
        "source_sentence": "見已便起婬心，以此婬心，身口意熾然，彼以身口意熾然故，即於彼村落乞食已，",
        "translation": "Having seen this, they give rise to a feeling of anger. Because of this feeling of anger, their bodies, speech, and thought are engulfed in flames. Because their bodies, speech, and thought are engulfed in flames, they",
        "source": "T04n0216_001:0801a17_2"
    },
    {
        "source_sentence": "還所止處，往尊大比丘所，以此因緣，具向諸比丘說。",
        "translation": "He returned to his place of lodging and went to the place where the venerable monk was staying. For this reason, he told the monks in detail.",
        "source": "T04n0216_001:0801a19_3"
    },
    {
        "source_sentence": "「彼尊比丘，告此比丘言：『汝往，非我眾中比丘。』",
        "translation": "That venerable monk told this monk, 'Go there, you're not a monk in my congregation.'",
        "source": "T04n0216_001:0801a20_4"
    },
    {
        "source_sentence": "「爾時此比丘不捨禁戒，便著俗服，樂愛欲中，是謂比丘魔得其便，隨波旬所欲，",
        "translation": "At that time, the bhikṣu did not give up his precepts and instead wore lay clothes. This is how the bhikṣu Māra obtained [the opportunity]:",
        "source": "T04n0216_001:0801a21_5"
    },
    {
        "source_sentence": "亦不脫生老病死愁憂苦惱。",
        "translation": "They won't be free of the sorrow, pain, and suffering of birth, old age, illness, death, and grief.",
        "source": "T04n0216_001:0801a23_6"
    },
    {
        "source_sentence": "如是諸比丘利養具，甚為難，甚為苦，甚為恐畏，墮入惡趣，不生無上處。」",
        "translation": "Thus, these monks' provisions for profit and support are so difficult, so painful, so frightening, that they'll fall into a bad destiny and not be born in the unsurpassed place.",
        "source": "T04n0216_001:0801a23_7"
    },
    {
        "source_sentence": "「是故，諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T04n0216_001:0801a25_8"
    },
    {
        "source_sentence": "當作是學，已得利養當捨離之，未得利養不起貪意，如是諸比丘當作是學。」",
        "translation": "You should train in this way, abandon it after you've received benefits and won't become greedy when you haven't received benefits; such monks will thus train in this way.",
        "source": "T04n0216_001:0801a25_9"
    },
    {
        "source_sentence": "爾時諸比丘聞佛所說，歡喜奉行。",
        "translation": "When the monks heard what the Buddha taught, they rejoiced and carried it out.",
        "source": "T04n0216_001:0801a27_10"
    },
    {
        "source_sentence": "大魚事經",
        "translation": "*Mahāmegha-sūtra",
        "source": "T04n0216_001:0801a29_0"
    }
]