[
    {
        "source_sentence": "雜譬喻經卷上",
        "translation": "Saṃyuktâgama-sūtra, vol. 1",
        "source": "T04n0205_001:0502a25_0"
    },
    {
        "source_sentence": "失譯人名附後漢錄",
        "translation": "Lost the name of the translator appended to the Later Han Register",
        "source": "T04n0205_001:0502a27_0"
    },
    {
        "source_sentence": "（一）菩薩度人，譬若巧乳母養子，有四事：一者洗浴使淨、二者乳哺令飽、三者臥寐安穩、四者抱持出入恒使歡喜。",
        "translation": "(1) The bodhisattva saves people, analogous to a skillful nurse nurturing her child with four things: first, washing and bathing so that it's clean; second, feeding milk so that it's full; third, lying awake and peaceful while sleeping; and fourth, embracing and entering and exiting the body so that it's always joyous.",
        "source": "T04n0205_001:0502a28_0"
    },
    {
        "source_sentence": "以此四事長養其子令得成就。",
        "translation": "Because of these four things, he nourishes his child so that he'll attain their accomplishment.",
        "source": "T04n0205_001:0502b01_1"
    },
    {
        "source_sentence": "菩薩亦復如是，有四事育養眾生：一者以正法洗浴心垢、二者以經法飲食使飽、三者禪定三昧隨時興立、四者以四恩饒益一切恒令歡喜。",
        "translation": "Similarly, bodhisattvas have four things to nurture sentient beings: first, they bathe their minds with the right teaching; second, they nourish them with food and drink from sūtras and teachings; third, they establish themselves in meditation and concentration at any time; and fourth, they always make them rejoice because of the four kinds of benevolence that benefit all.",
        "source": "T04n0205_001:0502b02_2"
    },
    {
        "source_sentence": "以此四事勸誨一切，長育眾生使得至道。",
        "translation": "With these four things, he encourages all sentient beings to nurture sentient beings and make them reach the ultimate path.",
        "source": "T04n0205_001:0502b05_3"
    },
    {
        "source_sentence": "（二）世間有二知識，常與人為因緣，令人得大罪，亦令人得大福。",
        "translation": "(2) In the world, there are two kinds of knowledge that always serve as causes and conditions for people to attain great sins and great merits.",
        "source": "T04n0205_001:0502b07_0"
    },
    {
        "source_sentence": "何謂二知識？",
        "translation": "By what are these two knowledges meant?",
        "source": "T04n0205_001:0502b08_1"
    },
    {
        "source_sentence": "一者惡知識、二者善知識。",
        "translation": "One is bad friend, and the other is good friend.",
        "source": "T04n0205_001:0502b08_2"
    },
    {
        "source_sentence": "譬如賊師造惡逆，殺害君父破亂天下，眾生被毒殃無不加，與之從事令人得大罪。",
        "translation": "It's like a thief who commits a heinous act and kills his father and breaks up the world, and sentient beings are subject to poison and misfortune without fail.",
        "source": "T04n0205_001:0502b09_3"
    },
    {
        "source_sentence": "如釋迦文菩薩發意求道救護眾生，四等四恩接護一切，三界五道靡不蒙度也！",
        "translation": "Just as the Śākyamuni Bodhisattva arouses his intention to seek the path to save sentient beings, he receives and protects all four kinds of goodness in four ways, and the three realms and five destinies are all liberated!",
        "source": "T04n0205_001:0502b11_4"
    },
    {
        "source_sentence": "所謂善知識與之從事，令人得大福。",
        "translation": "It's called a good teacher who gives it to someone who serves him and causes them to attain great merit.",
        "source": "T04n0205_001:0502b13_5"
    },
    {
        "source_sentence": "（三）昔南天竺有一國名私呵絜，處海渚之上，其城縱廣八萬餘里。",
        "translation": "(3) Once upon a time, there was a country in southern India named Sihaozhi, which was situated on a sea island and its city was more than 80,000 miles long and wide.",
        "source": "T04n0205_001:0502b14_0"
    },
    {
        "source_sentence": "時他國有一老母名阿龍，遭難荒亂流離在此國，孤單無所歸，依乞匃生活，",
        "translation": "In another country, there was an old woman named Anuruddha, who was in distress and in turmoil. She lived in dependence on beggars to earn her living.",
        "source": "T04n0205_001:0502b15_1"
    },
    {
        "source_sentence": "詣長者家欲求寄附。",
        "translation": "He went to the elder's house and wanted to send it to him.",
        "source": "T04n0205_001:0502b17_2"
    },
    {
        "source_sentence": "時長者婦見之，問訊老母，老母具自陳說窮厄之意。",
        "translation": "When the elder's wife saw him, she greeted his old mother and told her all of her distress.",
        "source": "T04n0205_001:0502b17_3"
    },
    {
        "source_sentence": "長者愴然愍之，語老母言：「可住我家耳，當相資給。」",
        "translation": "The elder was overcome with pity and said to his old mother, You can stay at my house; you'll be able to provide for it.",
        "source": "T04n0205_001:0502b18_4"
    },
    {
        "source_sentence": "老母喜曰：「吾無以上報，當以小小作使，所作眾務不敢憚勞也！」",
        "translation": "The old mother rejoiced and said, I won't have any higher reward; I will make a small envoy, and I won't worry about the many duties I'll do!",
        "source": "T04n0205_001:0502b20_5"
    },
    {
        "source_sentence": "便停止住。",
        "translation": "He then stopped and stayed.",
        "source": "T04n0205_001:0502b21_6"
    },
    {
        "source_sentence": "意有悲喜：「昔日供侍眾僧隨意所設，今日忽爾窮厄，施心不達，內自感傷。」",
        "translation": "He had a feeling of pity and joy in his mind, saying, In the past, I offered support to the saṃgha as he wished, but today you suddenly became so miserable that you didn't understand it at heart and internally grieved.",
        "source": "T04n0205_001:0502b21_7"
    },
    {
        "source_sentence": "前禮道人問訊必訖：「不審僧朝中供未也？」",
        "translation": "The former veneration of the Way will surely end with a question and greeting, Don't you know whether the offerings are made in the saṃgha's court?",
        "source": "T04n0205_001:0502b23_8"
    },
    {
        "source_sentence": "道人答曰：「朝來入城乞匃了無所得，是以便還所解耳！」",
        "translation": "The monk replied, In the morning, he entered the city to beg for alms and didn't get anything; this is so that he could return what he had understood!",
        "source": "T04n0205_001:0502b24_9"
    },
    {
        "source_sentence": "老母即念：「欲得飯眾僧，而自了無所有。」",
        "translation": "The old mother then thought, I want to feed the saṃgha, but I don't own it.",
        "source": "T04n0205_001:0502b25_10"
    },
    {
        "source_sentence": "白諸道人：「我今入城視之，若得供辦者，當還白之！",
        "translation": "He said to the people of the Way, Now, I'll enter the city to examine it, and if I get an offering, I'll return and tell them!",
        "source": "T04n0205_001:0502b26_11"
    },
    {
        "source_sentence": "若無者亦當使知消息。」",
        "translation": "If it doesn't, you should also let them know the news.",
        "source": "T04n0205_001:0502b27_12"
    },
    {
        "source_sentence": "於是眾許可，各各解住樹下。",
        "translation": "The crowd then agreed, and each of them were released and stayed under a tree.",
        "source": "T04n0205_001:0502b28_13"
    },
    {
        "source_sentence": "於是老母還舍啟長者婦，宜用數千錢：「今我雖在此作使，願身自賣終身為婢，",
        "translation": "The old mother then returned to her house and asked the wealthy man’s wife for several thousand pieces of money. “Even now that I am staying here as an envoy, may I sell myself off in order to become a maidservant?",
        "source": "T04n0205_001:0502b29_14"
    },
    {
        "source_sentence": "可立券要？」",
        "translation": "Can you establish the essentials of the book?",
        "source": "T04n0205_001:0502c01_15"
    },
    {
        "source_sentence": "長者婦問曰：「卿在此仰我衣食，欻復用錢為？",
        "translation": "The wealthy man's wife asked, Are you here to offer me food and clothing or money?",
        "source": "T04n0205_001:0502c02_16"
    },
    {
        "source_sentence": "持作何等？」",
        "translation": "What's the point of maintaining it?",
        "source": "T04n0205_001:0502c03_17"
    },
    {
        "source_sentence": "老母白言：「私宜急用，不可得說。」",
        "translation": "The old mother said, It's advisable to use it privately; you can't explain it.",
        "source": "T04n0205_001:0502c03_18"
    },
    {
        "source_sentence": "於是長者婦以錢與之，語言：「為持去用，若有時自可還，我以券何為？」",
        "translation": "The wealthy man's wife then gave him the money and said, Take it away for your use, and if you can return on your own at any time, what will I give you as a coupon?",
        "source": "T04n0205_001:0502c04_19"
    },
    {
        "source_sentence": "老母得錢，詣其左右先素知識者，具以情告之：「以錢人人付，使為供六十家。」",
        "translation": "When the old mother got the money, she went to her left and right of a former practitioner who knew her, told him with emotion, Pay it to someone with money so that he'll make offerings to 60 families.",
        "source": "T04n0205_001:0502c05_20"
    },
    {
        "source_sentence": "須臾已辦，齎詣道人。",
        "translation": "In a moment’s time, they had already prepared it and carried it to the religious practitioner.",
        "source": "T04n0205_001:0502c07_21"
    },
    {
        "source_sentence": "「本謂無實定，至城乃爾。」",
        "translation": "It's originally said that there's no real concentration, but it's true when you reach the city.",
        "source": "T04n0205_001:0502c08_22"
    },
    {
        "source_sentence": "皆怪其精進，出於不意，而問老母：「居止何處？",
        "translation": "They all wondered at his energy and disdainfulness, and asked the old mother, Where are you staying?",
        "source": "T04n0205_001:0502c08_23"
    },
    {
        "source_sentence": "吾朝分衛無里不遍，何以都不相值見耶？」",
        "translation": "Why wouldn't we see each other if we were separated by guards and didn't pervade?",
        "source": "T04n0205_001:0502c09_24"
    },
    {
        "source_sentence": "老母具自陳說本末：「我是某國中人也，家先奉佛供養眾僧。",
        "translation": "The old mother explained the origin of the story in detail, saying, I'm a native of a certain country whose family had previously honored the Buddha and offered support to the saṃgha.",
        "source": "T04n0205_001:0502c10_25"
    },
    {
        "source_sentence": "值世荒亂流離至此，室家蕩盡一身孤獨，依附此國大長者家，給其使令，",
        "translation": "When the World-honored One came to this place in a state of desolation, his households were completely deserted and left home alone. He depended on the house of a great wealthy merchant native of this country and gave him an instruction [to go there].",
        "source": "T04n0205_001:0502c12_26"
    },
    {
        "source_sentence": "仰其衣食，空身寄命了無一錢。",
        "translation": "He looked up to pay for his food and clothing, but he left no money in his empty body to live.",
        "source": "T04n0205_001:0502c13_27"
    },
    {
        "source_sentence": "向見道人悲喜交集，心有所懷，悲願不果。",
        "translation": "I've seen the Way people gather together with pity and joy, but there's something in their minds that doesn't fulfill their compassionate vow.",
        "source": "T04n0205_001:0502c14_28"
    },
    {
        "source_sentence": "白夫人：『以身自賣，求索少少，欲飯眾僧。』",
        "translation": "He said to the lady, 'I'll sell my own body and ask for a small amount of money to feed the saṃgha.'",
        "source": "T04n0205_001:0502c15_29"
    },
    {
        "source_sentence": "慈惠見愍，微誠得遂耳！」",
        "translation": "With compassion and wisdom, we'll see the debilitating, but we'll attain it with little sincerity!",
        "source": "T04n0205_001:0502c16_30"
    },
    {
        "source_sentence": "道人歎曰：「真可謂盡信施矣！」",
        "translation": "The Daoist man praised him, saying, It's really true that it's called giving with complete faith!",
        "source": "T04n0205_001:0502c16_31"
    },
    {
        "source_sentence": "皆相謂曰：「吾等亦為五陰之身行求分衛，今日之食便為噉人肉也，宜各建意以報施功。」",
        "translation": "They all said to each other, We're also seeking to protect the five aggregates in our bodily actions for their protection, and today's food will be devoured by human flesh; we should each establish our intentions to reward the merit of giving.",
        "source": "T04n0205_001:0502c17_32"
    },
    {
        "source_sentence": "眾人齊心立八惟務禪，精盈感通即獲超定，神足威靈振動境界，樹木曲躬有似跪拜。",
        "translation": "The people concentrated their minds and established the eight precepts for meditation, and when they were endowed with energy and supernormal abilities, they attained transcendent concentration. Their spiritual powers and mighty spirit shook the realm, and the trees stood crouching in a kneeling posture like bowing.",
        "source": "T04n0205_001:0502c19_33"
    },
    {
        "source_sentence": "道人見證，讚敘施主。",
        "translation": "The monks and nuns witnessed this and praised the donor.",
        "source": "T04n0205_001:0502c21_34"
    },
    {
        "source_sentence": "國王驚肅怪其所以，召諸群臣共議：「原其感瑞，何緣致茲？」",
        "translation": "Surprised and surprised, the king of the country summoned his ministers to discuss it together, What's the reason for this?",
        "source": "T04n0205_001:0502c22_35"
    },
    {
        "source_sentence": "臣下四出觀察其所由，見城門外道人群集，施者濟濟，其共相慶賴。",
        "translation": "The ministers went out in four ways to examine the reason for this, and they saw crowds of monks outside the city gates gathered at the monastery's entrance. Those who gave donations were relieved, and they all rejoiced with each other.",
        "source": "T04n0205_001:0502c23_36"
    },
    {
        "source_sentence": "即入白，王曰：「正是所為，速請呼來！」",
        "translation": "He went in and said, That's exactly what I want, so quickly summon me!",
        "source": "T04n0205_001:0502c24_37"
    },
    {
        "source_sentence": "臣下還宣王命。",
        "translation": "The ministers returned and proclaimed the king's order.",
        "source": "T04n0205_001:0502c25_38"
    },
    {
        "source_sentence": "老母怖悸懼有非禍，報答臣曰：「吾身繫屬長者婦，不得自由。」",
        "translation": "The old mother was frightened and feared that there wouldn't be any harm, and she replied to the minister, My body is bound to the elder's wife, so I won't be free.",
        "source": "T04n0205_001:0502c26_39"
    },
    {
        "source_sentence": "臣還白此意，王曰：「并請命來。」",
        "translation": "The minister returned to this idea, and the king said, And I'll invite you to come.",
        "source": "T04n0205_001:0502c27_40"
    },
    {
        "source_sentence": "於是長者婦聞王勅命，即與老母詣王所。",
        "translation": "The elder's wife then heard the king's command and went to the king with her old mother.",
        "source": "T04n0205_001:0502c28_41"
    },
    {
        "source_sentence": "王問其意，老母具以本末白王言。",
        "translation": "The king asked him what he thought, and the old mother told him the story in full detail.",
        "source": "T04n0205_001:0502c29_42"
    },
    {
        "source_sentence": "王曰：「吾為國主富有自在，然不知奉敬三尊供養道士，如此老母致感若斯！」",
        "translation": "The king said, I'm the lord of the state and wealthy and sovereign, but I don't know how to honor the three honored ones and offer support to the Daoist priests, so why wouldn't such an old mother do so?",
        "source": "T04n0205_001:0503a01_0"
    },
    {
        "source_sentence": "王曰：「此母則吾師。」",
        "translation": "The king said, This mother is my teacher.",
        "source": "T04n0205_001:0503a02_1"
    },
    {
        "source_sentence": "迎着宮內，香湯洗浴坐於師位。",
        "translation": "He was greeted inside the palace, bathed in scented warm water, and seated himself at the master's throne.",
        "source": "T04n0205_001:0503a03_2"
    },
    {
        "source_sentence": "宮人、婇女合二萬人，王身受戒為優婆塞；",
        "translation": "Among the twenty thousand palace officials and court ladies, the king received the precepts in person as a layman.",
        "source": "T04n0205_001:0503a03_3"
    },
    {
        "source_sentence": "老人、婇女為優婆夷。",
        "translation": "The old man and the promiscuous woman are Upāsikā.",
        "source": "T04n0205_001:0503a04_4"
    },
    {
        "source_sentence": "國人一切普發道意。",
        "translation": "All the people of the country universally aroused the intention for enlightenment.",
        "source": "T04n0205_001:0503a05_5"
    },
    {
        "source_sentence": "（四）昔道人於山中學道。",
        "translation": "(4) In the past, there were people of the Way in the Daoist school on the mountain.",
        "source": "T04n0205_001:0503a06_0"
    },
    {
        "source_sentence": "山中多有蝮蛇，道人畏之，便依一樹下，高布床槈坐禪念定；",
        "translation": "In the mountain there were many vipers and snakes. Fearful of them, the monks relied on a tree to sit cross-legged on a high cushioned bed in meditation and recollection.",
        "source": "T04n0205_001:0503a06_1"
    },
    {
        "source_sentence": "而但苦睡，不能自制。",
        "translation": "They simply suffer from painful sleep and are unable to control themselves.",
        "source": "T04n0205_001:0503a07_2"
    },
    {
        "source_sentence": "天人則於空中笑，覺之，遂睡，不解天人因作方便，欲恐令不睡極。",
        "translation": "The gods and humans then laughed in the air, awoke, and went to sleep. But they did not understand that the gods and humans had done so because they wanted to prevent them from falling asleep.",
        "source": "T04n0205_001:0503a08_3"
    },
    {
        "source_sentence": "夜，天人言：「咄咄道人，毒蛇來矣！」",
        "translation": "At night, the gods and humans said, Duh-duh, you people of the Way, poisonous snakes have come!",
        "source": "T04n0205_001:0503a09_4"
    },
    {
        "source_sentence": "道人大怖，便然燈火，遍求之不見。",
        "translation": "Fearful, the great monk of the Way became frightened and burned the lamp in flames. Seeking everywhere he did not see it.",
        "source": "T04n0205_001:0503a10_5"
    },
    {
        "source_sentence": "天人數數不止，道人乃更恚曰：「天人何以犯兩舌？",
        "translation": "The number of the gods was more than that, and the monk said again in anger, Why would gods and humans commit duplicitous speech?",
        "source": "T04n0205_001:0503a11_6"
    },
    {
        "source_sentence": "都不見物，云何為言言毒蛇？」",
        "translation": "They don't see things, so why do they say poisonous snakes?",
        "source": "T04n0205_001:0503a12_7"
    },
    {
        "source_sentence": "天人語道人：「何不自觀內毒蛇？",
        "translation": "The gods and humans said to the practitioner, Why don't you look inside for your own poisonous snake?",
        "source": "T04n0205_001:0503a13_8"
    },
    {
        "source_sentence": "身中有四蛇不除，如何更從外求之乎？」",
        "translation": "If there are four snakes in your body that aren't removed, how can you look for them from the outside?",
        "source": "T04n0205_001:0503a14_0"
    },
    {
        "source_sentence": "道人聞天人語，即自思惟：「觀身歷藏，乃知四大為五陰六衰所沈沒，",
        "translation": "Hearing the words of gods and humans, the Daoist thought to himself: Having examined my body in the storehouse, I know that the four elements are submerged by the five aggregates and six decaying tendencies.",
        "source": "T04n0205_001:0503a14_1"
    },
    {
        "source_sentence": "無數劫來至今未脫。」",
        "translation": "Countless eons have passed since then but I haven't been liberated yet.",
        "source": "T04n0205_001:0503a16_2"
    },
    {
        "source_sentence": "即解四諦苦空非身。",
        "translation": "That is, he understands that the four noble truths of suffering and emptiness are not bodies.",
        "source": "T04n0205_001:0503a16_3"
    },
    {
        "source_sentence": "天未曉，漏盡意解，六通具足，得羅漢。",
        "translation": "Before dawn, the gods had exhausted their contaminants and liberated their minds. Endowed with the six supernatural powers, they attained arhatship.",
        "source": "T04n0205_001:0503a17_4"
    },
    {
        "source_sentence": "（五）昔有阿育王，於境內立千二百塔寺，後得病大困。",
        "translation": "(5) Once upon a time, there was King Aśoka who built 1,200 stūpas inside his territory and later became ill and in great distress.",
        "source": "T04n0205_001:0503a19_0"
    },
    {
        "source_sentence": "有一沙門往省王，王與相見，悲不能自勝。",
        "translation": "A certain śramaṇa visited the king and saw him. The king was unable to overcome his sorrowful feelings and could not control himself.",
        "source": "T04n0205_001:0503a20_1"
    },
    {
        "source_sentence": "道人曰：「王前後所作功德不可計數，當開大意，莫有恨也！」",
        "translation": "The monk said, The merits of what the king did before and after can't be counted, so you must open your mind with great intentions; don't have any grudge!",
        "source": "T04n0205_001:0503a21_2"
    },
    {
        "source_sentence": "王言：「正使死至不能有恨也。",
        "translation": "The king said, It's precisely because the messenger died and couldn't have any grudge.",
        "source": "T04n0205_001:0503a22_3"
    },
    {
        "source_sentence": "所以悲者，前為千二百寺，各織作金縷幡蓋千二百枚，欲自懸幡散華，",
        "translation": "The reason for this sorrow is that the formerly one thousand two hundred temples wove golden- threaded banners and canopies, one thousand two hundred pieces each, to hang their own banners and scatter flowers.",
        "source": "T04n0205_001:0503a23_4"
    },
    {
        "source_sentence": "於諸寺物始得辦，而得重病，恐不卒本願，故自悲耳！」",
        "translation": "I'm afraid I won't die from my original vow, so I'll pity myself!",
        "source": "T04n0205_001:0503a24_5"
    },
    {
        "source_sentence": "道人語王：「好！」",
        "translation": "The Daoist said to the king, Good!",
        "source": "T04n0205_001:0503a26_0"
    },
    {
        "source_sentence": "叉手一心，令王悉見一界中塔。",
        "translation": "He joined his palms together with one thought, causing the king to see all the stūpas in a single realm.",
        "source": "T04n0205_001:0503a26_1"
    },
    {
        "source_sentence": "道人即現神足，應時千二百塔皆在王前。",
        "translation": "The monks then manifested their miraculous powers, and at the right time, 1,200 stūpas were all in front of the king.",
        "source": "T04n0205_001:0503a27_0"
    },
    {
        "source_sentence": "見大歡喜，病即時差，取金幡金華懸諸剎上，塔寺低仰皆就王手。",
        "translation": "He was greatly delighted to see that his illness had immediately passed away, and he took the golden banners and gold flowers and hung them over the buddha-lands. All the stupas and temples, low and high, all fell into the king’s hands.",
        "source": "T04n0205_001:0503a27_1"
    },
    {
        "source_sentence": "王得本願身復病愈，即發大意，延二十五年，遂作功德逮得不退轉。",
        "translation": "When the king had recovered from his original vow and was cured of his illness, he immediately aroused the great intention to extend it for twenty-five years so that he could perform meritorious deeds and attain nonretrogression.",
        "source": "T04n0205_001:0503a29_2"
    },
    {
        "source_sentence": "（六）昔有阿育王，拜為政位，二十八萬里盡屬之，陸地龍、閱叉等亦奉獻臣使，",
        "translation": "(6) Once upon a time, there was King Aśoka, who ascended the throne and ruled over twenty-eighty thousand li in all directions. The nagas on land and yakṣas also offered their support to him as envoys.",
        "source": "T04n0205_001:0503b02_0"
    },
    {
        "source_sentence": "無不伏者。",
        "translation": "There's nothing that isn't subdued.",
        "source": "T04n0205_001:0503b03_1"
    },
    {
        "source_sentence": "唯有一龍王，北界所止之，池廣三百餘里，得佛一分舍利晝夜供養，獨不降首於阿育王。",
        "translation": "There was only one dragon king who lived in the northern boundary. The pond, more than three hundred li wide and over three hundred li deep, had a portion of the Buddha’s relic bones preserved for offerings day and night; it did not surrendered its head to King Aśoka alone.",
        "source": "T04n0205_001:0503b03_2"
    },
    {
        "source_sentence": "王即舉四種兵到其池上，龍不出應。",
        "translation": "The king then raised four kinds of troops and went up to the pond, but the dragon didn't respond.",
        "source": "T04n0205_001:0503b06_0"
    },
    {
        "source_sentence": "龍有威神，王亦不能得前。",
        "translation": "The dragon was so powerful that even the king couldn't get in front of him.",
        "source": "T04n0205_001:0503b06_1"
    },
    {
        "source_sentence": "如是三往，不能得龍。",
        "translation": "Thus, these three excursions won't allow him to get the dragon.",
        "source": "T04n0205_001:0503b07_2"
    },
    {
        "source_sentence": "「所以威神并者，福勝我故也！",
        "translation": "That's why the authoritative spirit is combined, because merit is superior to self!",
        "source": "T04n0205_001:0503b07_3"
    },
    {
        "source_sentence": "吾今當大作功德供養三尊，以往取必得不疑也！」",
        "translation": "I will now make a great offering of merit to the three honored ones, and I'll surely attain it without doubt in the past!",
        "source": "T04n0205_001:0503b08_4"
    },
    {
        "source_sentence": "於是修立塔寺、廣請眾僧，數數不息。",
        "translation": "He then constructed a stūpa and temple, invited the monks to it extensively, and didn't stop counting them.",
        "source": "T04n0205_001:0503b09_5"
    },
    {
        "source_sentence": "欲自試功德，便作一金龍，作一王身，著稱兩頭稱其輕重，作功德並稱二像，",
        "translation": "He wanted to test his own merits, so he made a golden dragon and a king’s body, weighed heavily on the two sides of its head and praised their lightness. All the merits he produced were praised in two images.",
        "source": "T04n0205_001:0503b10_6"
    },
    {
        "source_sentence": "龍重王輕；",
        "translation": "The dragons are heavier and the kings are lighter.",
        "source": "T04n0205_001:0503b12_7"
    },
    {
        "source_sentence": "後復稱之輕重衡平；",
        "translation": "They later praised their impartiality in terms of weighing and weighing.",
        "source": "T04n0205_001:0503b12_8"
    },
    {
        "source_sentence": "復作功德，後王稱日重、龍稱日輕。",
        "translation": "The king then praised him for his merits, and the dragon called him Lighter on the Sun.",
        "source": "T04n0205_001:0503b13_9"
    },
    {
        "source_sentence": "王知功德日多，興兵往討，未至道半，龍王大小奉迎首伏，所得佛一分舍利者獻阿育王，",
        "translation": "Knowing that the Buddha’s merit would increase day by day, the king mobilized his troops to attack him. Before halfway up the road, the dragon king was greeted and defeated with both big and small armies. The one who had obtained a portion of the Buddha’s relic bone relics offered to King Aśoka.",
        "source": "T04n0205_001:0503b14_10"
    },
    {
        "source_sentence": "阿育王復興塔寺廣闡佛法。",
        "translation": "King Aśoka restored the stūpa temple and extensively explained the Buddha's teaching.",
        "source": "T04n0205_001:0503b16_11"
    },
    {
        "source_sentence": "（七）昔佛般泥洹去百年後，有阿育王愛樂佛法，國中有二萬比丘，王恒供養之。",
        "translation": "(7) Once, a hundred years after the Buddha had passed into nirvāṇa, there was King Aśoka who loved the Buddha's teaching and 20,000 monks in his country always offered support to him.",
        "source": "T04n0205_001:0503b17_0"
    },
    {
        "source_sentence": "諸九十六種外道生嫉妬意，謀欲敗佛法，自共聚會思惟方便。",
        "translation": "The ninety-six kinds of non-Buddhists became jealous, intending to disparage the Buddha's teachings, and they assembled together to contemplate the method.",
        "source": "T04n0205_001:0503b18_1"
    },
    {
        "source_sentence": "中有一人善於幻化，便語眾人：「吾欲作幻，變惡鬼形索沙門，聞之必散亡。",
        "translation": "One of the monks was skilled in magical creations and said to the others, “I wish to create an illusion.",
        "source": "T04n0205_001:0503b20_2"
    },
    {
        "source_sentence": "當知其不如，必來歸吾等道矣！」",
        "translation": "You should know that they won't do well, and they will surely come back to our path!",
        "source": "T04n0205_001:0503b22_0"
    },
    {
        "source_sentence": "異道所奉神，名摩夷首羅，一頭四面八目八臂，諸鬼之最是可畏者。",
        "translation": "The deity worshiped by heretics is called Moheśvara, with one head, four sides, eight eyes, and eight arms, the most fearsome of all the ghosts.",
        "source": "T04n0205_001:0503b22_1"
    },
    {
        "source_sentence": "梵志即作是身，將諸醜鬼二百餘頭，洋洋行於國中，徐徐稍前至王宮門。",
        "translation": "The brahmin then formed this body and led the two hundred or so ugly ghosts, who were accompanied by more than two hundred spirits, to the king's palace gate in a leisurely way.",
        "source": "T04n0205_001:0503b24_2"
    },
    {
        "source_sentence": "一國男女莫不怖懼，王出迎之見大恐鬼，稽首問曰：「不審大神何所勅欲？」",
        "translation": "The men and women of one country were all frightened, and the king came out to greet them. Seeing a great fearful ghost, they bowed their heads and asked, Don't you wonder what the great deity wanted?",
        "source": "T04n0205_001:0503b25_3"
    },
    {
        "source_sentence": "鬼語王言：「吾欲噉人。」",
        "translation": "The demon said to the king, I want to eat people.",
        "source": "T04n0205_001:0503b27_4"
    },
    {
        "source_sentence": "王言：「不可爾也！」",
        "translation": "The king said, That's not possible!",
        "source": "T04n0205_001:0503b28_5"
    },
    {
        "source_sentence": "鬼曰：「若王惜人民者，國中有無益王者付我噉之。」",
        "translation": "The ghost said, If the king cherishes people, then there's a useless king in his country who will pay me to beg for them.",
        "source": "T04n0205_001:0503b28_6"
    },
    {
        "source_sentence": "王言：「無有也！」",
        "translation": "The king said, There's nothing!",
        "source": "T04n0205_001:0503b29_7"
    },
    {
        "source_sentence": "鬼言：「諸沙門等，亦不田作、亦不軍征、不臣屬王，此則無益者，付吾噉之。」",
        "translation": "The ghosts said, These ascetics and others don't cultivate fields, don't send armies or conquers, and don't serve the king; this is useless for them to entrust it to me.",
        "source": "T04n0205_001:0503c01_8"
    },
    {
        "source_sentence": "王心不樂，事不得已，便遣使詣祇桓，道其消息。",
        "translation": "The king was displeased and unable to do so. So he sent an envoy to Jīvaka, telling him the news.",
        "source": "T04n0205_001:0503c02_9"
    },
    {
        "source_sentence": "二万比丘中有最下沙彌，年十三歲名端正，白諸比丘：「我當行應焉！」",
        "translation": "Among the 20,000 monks, the youngest of the śrāmaṇeras, 13 years old and named Daosheng, said to the monks, I will follow it!",
        "source": "T04n0205_001:0503c03_10"
    },
    {
        "source_sentence": "即便聽許之。",
        "translation": "They even listened and approved of it.",
        "source": "T04n0205_001:0503c05_11"
    },
    {
        "source_sentence": "沙彌出外語維那曰：「其有梵志墮祇桓中者，便共剃頭，無令得脫。」",
        "translation": "The śrāmaṇer came out and said to Vaiśravaṇa, If there's a priest who falls into the kingdom of Jīvaka, he shaves his hair together so that he won't be freed.",
        "source": "T04n0205_001:0503c05_12"
    },
    {
        "source_sentence": "便往其所，語鬼神曰：「知汝來欲噉吾等，吾等是僧中最小，故來先相差次，",
        "translation": "They went to the place where they were and said to the spirits, “We know that you are coming to attack us. Because we are the smallest among the monks, we came before each other in order.",
        "source": "T04n0205_001:0503c07_13"
    },
    {
        "source_sentence": "其餘比丘安次當來。」",
        "translation": "The other monks will come in order.",
        "source": "T04n0205_001:0503c09_0"
    },
    {
        "source_sentence": "沙彌復言：「吾旦來未得食，卿等飯我令得一飽，乃却噉我。」",
        "translation": "Again, the novice said, When I came here at sunrise, I didn't get food, so you gave me a meal of rice and made me get one to eat, but then you deceived me.",
        "source": "T04n0205_001:0503c09_1"
    },
    {
        "source_sentence": "鬼神與之。",
        "translation": "The ghosts and spirits gave it to him.",
        "source": "T04n0205_001:0503c10_2"
    },
    {
        "source_sentence": "時從鬼梵志亦有二萬餘人，王作大厨，當與此等。",
        "translation": "At the time, there were also more than twenty thousand ghosts and priests, and the king made a large kitchen to give it to them.",
        "source": "T04n0205_001:0503c11_3"
    },
    {
        "source_sentence": "沙彌便取二萬人食，具皆著口中，神足飛著祇桓。",
        "translation": "The śrāmaṇer then took 20,000 foods, put them all in his mouth, and flew with supernormal powers to Jīvaka.",
        "source": "T04n0205_001:0503c12_4"
    },
    {
        "source_sentence": "故未飽，復取二萬梵志吞之，亦以神足送著祇桓中。",
        "translation": "Before he had eaten, he took another 20,000 priests to swallow it and carried it with his spiritual feet to Jīvaka.",
        "source": "T04n0205_001:0503c13_5"
    },
    {
        "source_sentence": "時作幻梵志走大怖懼，還復為人，稽首謝過，願作弟子。",
        "translation": "The illusion-generating priest then ran away in great fear, returned to the human world, bowed his head in thanks, and wished to become a disciple.",
        "source": "T04n0205_001:0503c14_6"
    },
    {
        "source_sentence": "諸比丘盡剃諸梵志頭，為說經法，皆得羅漢。",
        "translation": "All the bhikṣus shaved their hair on the heads of all the brāhmaṇas and preached the doctrine of the scriptures for them. They all attained arhatship.",
        "source": "T04n0205_001:0503c15_7"
    },
    {
        "source_sentence": "一國人民無不歡喜得福得度。",
        "translation": "The people of a single country don't fail to rejoice and attain blessedness and liberation.",
        "source": "T04n0205_001:0503c16_8"
    },
    {
        "source_sentence": "王思惟言：「一小沙彌感動如是，況摩訶衍海何所不有者？",
        "translation": "The king reflected and said, A small novice is moved like this, so why wouldn't there be anything in the great ocean of Mahāyāna?",
        "source": "T04n0205_001:0503c17_9"
    },
    {
        "source_sentence": "我便發無上正真道意。」",
        "translation": "I'll then give rise to the intention for the unsurpassed true path.",
        "source": "T04n0205_001:0503c18_10"
    },
    {
        "source_sentence": "從是以來佛法興盛，于今不滅。",
        "translation": "Since then the buddha-dharma has flourished and will not disappear in the present.",
        "source": "T04n0205_001:0503c19_11"
    },
    {
        "source_sentence": "（八）昔有國王喜食人肉，勅厨士曰：「汝等夜行密採人來以供厨。」",
        "translation": "(8) Once, there was a king of a country who liked to eat human flesh and commanded the cooks, You must secretly gather people at night to make offerings to the kitchen.",
        "source": "T04n0205_001:0503c21_0"
    },
    {
        "source_sentence": "以此為常。",
        "translation": "This is because it's permanent.",
        "source": "T04n0205_001:0503c22_1"
    },
    {
        "source_sentence": "臣下後咸知之，即共斥逐捐於界外，更求良賢以為國王。",
        "translation": "Knowing this later, the ministers together expelled him and abandoned him outside the boundary. They again sought good men to be their king.",
        "source": "T04n0205_001:0503c22_2"
    },
    {
        "source_sentence": "於是噉人王，十三年後身生兩翅行噉人，無復遠近，於山中向山樹神請求祈福：「當取國王、五百人祠山樹神，",
        "translation": "Thirteen years later, the king of Kauṇḍinya gave birth to a two-winged garuḍa. Without going near or far, he approached the mountain deity in the mountains and begged him to pray for blessedness:",
        "source": "T04n0205_001:0503c23_3"
    },
    {
        "source_sentence": "使我得復還國為王。」",
        "translation": "So that I can return to my country and become king.",
        "source": "T04n0205_001:0503c26_4"
    },
    {
        "source_sentence": "於是便飛行取之，得四百九十九人，之山谷以石密口。",
        "translation": "So they flew to get the treasure and found four hundred and ninety-nine men. The mountains and valleys were covered with rocky sockets for their mouths.",
        "source": "T04n0205_001:0503c26_5"
    },
    {
        "source_sentence": "時國王將諸後宮詣浴池戲，始出宮門逢一道人，說偈求乞，王即許之，",
        "translation": "When the king of that country was going to bathe in the pond and play in the pavilions at the rear quarters, he came out of the palace gates and met a man begging for almsfood by reciting verses. The king agreed with him.",
        "source": "T04n0205_001:0503c28_6"
    },
    {
        "source_sentence": "還宮當賜金銀。",
        "translation": "When he returns to the palace, he'll be given gold and silver.",
        "source": "T04n0205_001:0503c29_7"
    },
    {
        "source_sentence": "時王入池當欲澡洗，噉人王空中飛來，抱王得去還於山中。",
        "translation": "The king then entered the pond and wanted to bathe, but the dragon king flew up and came flying in midair, embraced the king, and returned to the mountain.",
        "source": "T04n0205_001:0504a01_8"
    },
    {
        "source_sentence": "國王見噉人王，不恐不怖顏色如故。",
        "translation": "When the king of that country saw the brahman, he was not afraid or frightened and his appearance looked as before.",
        "source": "T04n0205_001:0504a02_9"
    },
    {
        "source_sentence": "噉人王曰：「吾本捕取五百人當持祠天，已有四百九十九人，今復得卿一人，",
        "translation": "The king of Kauṇḍinya said, “In the past I captured five hundred and fifty-five people who will be used as guardians of the deva temple. There are already four hundred and ninety-nine such people.",
        "source": "T04n0205_001:0504a03_10"
    },
    {
        "source_sentence": "數已滿，殺以祠天。",
        "translation": "Having fulfilled the number, he kills them to be sacrificed to the gods.",
        "source": "T04n0205_001:0504a05_0"
    },
    {
        "source_sentence": "汝知是，何以不恐懼乎？」",
        "translation": "Knowing this, why aren't you afraid?",
        "source": "T04n0205_001:0504a05_1"
    },
    {
        "source_sentence": "國王對曰：「人生有死、物成有敗、合會有離，對來分之，不敢愁也！",
        "translation": "The king replied, There's birth and death, formation and decay of things, conjunction and separation, and the opponent who divides them doesn't dare to grieve!",
        "source": "T04n0205_001:0504a05_2"
    },
    {
        "source_sentence": "旦出宮時，道逢道士為吾說偈，即許施物，今未得與，以是為恨耳！",
        "translation": "When he emerged from the palace at dawn, he met a Daoist monk who spoke a verse for me and agreed to give something, but now he won't give it, which is why I hate him!",
        "source": "T04n0205_001:0504a07_3"
    },
    {
        "source_sentence": "今王弘慈寬恕，假數日中布施訖還，不違要誓也！」",
        "translation": "Now, the king's kindness and forbearance are so great that if he returns after giving alms in a few days, he won't disobey his essential vow!",
        "source": "T04n0205_001:0504a08_4"
    },
    {
        "source_sentence": "即聽令去，而告之曰：「與汝七日期，若不還者，吾往取汝亦無難也！」",
        "translation": "He then heard the order to leave and told him, Give you seven days; if you don't return, it won't be difficult for me to go and get you!",
        "source": "T04n0205_001:0504a09_5"
    },
    {
        "source_sentence": "王即還宮都中，內外莫不歡喜，即開庫藏布施遠近，拜太子為王，慰勞百姓辭決而去。",
        "translation": "The king then returned to the palace, rejoicing both inside and outside. Thereupon he opened the treasury and offered almsfood to all those who came from near or far. After paying respect to the prince as king, comforting the people by bowing their heads to his feet, he withdrew without a decision.",
        "source": "T04n0205_001:0504a11_6"
    },
    {
        "source_sentence": "噉人王遙見其來念曰：「此得無異人乎？",
        "translation": "The king of the Mallan people saw him from a distance and thought to himself, Is there no different person here who has attained it?",
        "source": "T04n0205_001:0504a13_7"
    },
    {
        "source_sentence": "從死得生而故來還。」",
        "translation": "They come back from death and are born, so they come back.",
        "source": "T04n0205_001:0504a14_8"
    },
    {
        "source_sentence": "即問曰：「身命世人所重愛者也，而卿捨命所信，世之難有，不審何守志趣？",
        "translation": "He asked, Your body and life are loved by the people in the world, but you abandoned what you believed in your life; it's difficult to find in the world, so why don't you know how to follow it?",
        "source": "T04n0205_001:0504a14_9"
    },
    {
        "source_sentence": "願說其意。」",
        "translation": "May I explain its meaning?",
        "source": "T04n0205_001:0504a16_10"
    },
    {
        "source_sentence": "即曰：「吾之慈施至誠信盟，當得阿惟三佛度十方。」",
        "translation": "He then said, My kindness and generosity reaches the point of faith that I'll attain the abhisaṃbuddhahood and save the ten directions.",
        "source": "T04n0205_001:0504a16_11"
    },
    {
        "source_sentence": "彼王曰：「求佛之義其事云何？」",
        "translation": "The king said, What's the matter with seeking the Buddha's meaning?",
        "source": "T04n0205_001:0504a17_12"
    },
    {
        "source_sentence": "便為廣說五戒、十善、四等、六度。",
        "translation": "He then explained in detail the five precepts, the ten good qualities, the four equal and six perfections.",
        "source": "T04n0205_001:0504a18_13"
    },
    {
        "source_sentence": "心開坦然，從受五戒為清信士，放四百九十九人，各各令還國。",
        "translation": "Their minds were enlightened and peaceful, and they accepted the five precepts as pure believers. They released four hundred and ninety-nine men, each returning to their own country.",
        "source": "T04n0205_001:0504a19_14"
    },
    {
        "source_sentence": "諸王追是後王共至其國，感其信誓蒙得濟命，各不肯還於本國，遂便住止此國。",
        "translation": "The kings chased after him, and the latter kings all went to his country, feeling their faith and vow to be saved, but they each refused to return to their own country and so stayed in that country.",
        "source": "T04n0205_001:0504a20_15"
    },
    {
        "source_sentence": "於此國王，各為立第一舍，彫文刻鏤光飾嚴整，法國王飲食服御，與王無異。",
        "translation": "Each of the kings of these countries built the first dwelling, which was decorated with carvings and embellishments as well as light. The food and drink offered by the rulers of the states were no different from those of the kings.",
        "source": "T04n0205_001:0504a22_16"
    },
    {
        "source_sentence": "四方來人問言：「何以有此如王舍，遍一國中？」",
        "translation": "People from the four directions asked, How could there be such a king's house that it would pervade one country?",
        "source": "T04n0205_001:0504a24_17"
    },
    {
        "source_sentence": "眾人答曰：「皆是諸王舍也！」",
        "translation": "The people replied, They're all the king's houses!",
        "source": "T04n0205_001:0504a25_18"
    },
    {
        "source_sentence": "名遂遠布。",
        "translation": "His name was then spread far and wide.",
        "source": "T04n0205_001:0504a25_19"
    },
    {
        "source_sentence": "從此以來號言王舍城。",
        "translation": "Since then, it's been called the city of Rājagṛha.",
        "source": "T04n0205_001:0504a26_20"
    },
    {
        "source_sentence": "佛得道已自說本末：「立信王者我身是也，噉人王者殃崛摩是，還王舍說法所度無量，",
        "translation": "When the Buddha had attained enlightenment he said to himself, “The king who establishes faith is none other than I myself. The king of the cowherds is Hāriṣa Kumārajīva.",
        "source": "T04n0205_001:0504a26_21"
    },
    {
        "source_sentence": "皆是宿命作王時因緣人也！」",
        "translation": "They're all the causes and conditions for people who were kings in their past lives!",
        "source": "T04n0205_001:0504a28_22"
    },
    {
        "source_sentence": "佛說是時，無不歡喜，得福得度，不可訾計。",
        "translation": "When the Buddha said this, none of them rejoiced and attained merit that could not be measured.",
        "source": "T04n0205_001:0504a29_23"
    },
    {
        "source_sentence": "（九）昔雪山有白象王，身有六牙，生二萬象。",
        "translation": "(9) Once upon a time, there was a white elephant king in the Himalayas who had six tusks and gave birth to 20,000 elephants.",
        "source": "T04n0205_001:0504b02_0"
    },
    {
        "source_sentence": "象王有二夫人，一人年長、一人年少，每出遊戲時夫人挾左右。",
        "translation": "The elephant king had two wives, one of whom was old and the other young. Each time they came out to play, the queen took them at her side.",
        "source": "T04n0205_001:0504b03_0"
    },
    {
        "source_sentence": "時王出戲，道過一大樹，樹花茂好，欲取二夫人身上以為光飾。",
        "translation": "The king then went out to play and passed by a large tree with luxuriant trees and flowers, intending to take the two ladies' bodies and make them into shining ornaments.",
        "source": "T04n0205_001:0504b04_1"
    },
    {
        "source_sentence": "鼻絞樹而搖逍之，風吹樹花獨落大夫人上，小夫人在下風不得華，謂王為有偏意，",
        "translation": "The king's nose twirled at the tree and shook it freely, and a wind blowing down from the tree dropped its flowers alone on top of the big queen. While the small queen was below, the wind didn't get the flowers, saying that the king had partial intentions.",
        "source": "T04n0205_001:0504b05_2"
    },
    {
        "source_sentence": "內生毒心。",
        "translation": "internally, a poisonous mind arises.",
        "source": "T04n0205_001:0504b07_3"
    },
    {
        "source_sentence": "後王池中生一金色千葉蓮花，小象見之取持上王，王得以與大夫人使著頭上；",
        "translation": "Then a golden lotus flower with a thousand petals appeared in the king’s pond. When the small elephant saw this, he took the upper king and carried it on his head. The king was able to give her to the queen as an envoy.",
        "source": "T04n0205_001:0504b08_4"
    },
    {
        "source_sentence": "小夫人遂益妬忿，念欲害王。",
        "translation": "The younger queen became increasingly jealous and thought of killing the king.",
        "source": "T04n0205_001:0504b09_5"
    },
    {
        "source_sentence": "雪山中多有道士，於是小夫人採取美果每供養百辟支佛，以後山上臨一嶮處而自誓願：「持是前後施辟支佛福報生於人中，",
        "translation": "There were many Daoists in the Himalayan mountains, so the young woman collected good fruits and each time offered them to a hundred pratyekabuddhas. After that she faced a  precipitous place on the mountain and made a vow: I will be born among humans as a result of my past and future charity to the pratyekabuddhas.",
        "source": "T04n0205_001:0504b10_6"
    },
    {
        "source_sentence": "有豪勢、自識宿命，害殺此象王。」",
        "translation": "A powerful man who knows his past lives will harm and kill this elephant king.",
        "source": "T04n0205_001:0504b13_7"
    },
    {
        "source_sentence": "即便放身自投山下而死。",
        "translation": "He then released himself into the mountains and died.",
        "source": "T04n0205_001:0504b14_8"
    },
    {
        "source_sentence": "神來生人間，為長者女，明慧遠識端正無比。",
        "translation": "The goddess came to be born among humans as the elder's daughter, who had insight and far-reaching consciousness and was incomparably beautiful.",
        "source": "T04n0205_001:0504b14_9"
    },
    {
        "source_sentence": "其女長大，國王聘為夫人，愛重之。",
        "translation": "When the daughter grew up, the king hired her as his wife and treated her affectionately.",
        "source": "T04n0205_001:0504b15_10"
    },
    {
        "source_sentence": "夫人念言：「今真得報宿怨矣！」",
        "translation": "The lady thought, Now I've really gotten the reward of my past enemies!",
        "source": "T04n0205_001:0504b16_11"
    },
    {
        "source_sentence": "便以梔子黃面委臥稱病。",
        "translation": "He then lay down with the yellow face of a herb and called himself sick.",
        "source": "T04n0205_001:0504b17_12"
    },
    {
        "source_sentence": "王入問之，答曰：「夜夢見象，頭有六牙，欲得其牙持作釵耳。",
        "translation": "The king entered to inquire of him and said, “I dreamt that I saw an elephant with six tusks on its head at night.",
        "source": "T04n0205_001:0504b17_13"
    },
    {
        "source_sentence": "王若不得此象牙者，病日篤矣！」",
        "translation": "If the king doesn't obtain this ivory, he'll be seriously ill for days!",
        "source": "T04n0205_001:0504b19_14"
    },
    {
        "source_sentence": "王素重之不敢違意，即召國中諸射獵者得數百人，而告之言：「汝等山中頗見有白象身有六牙者不？」",
        "translation": "The king respected him and didn't dare disobey his wishes, so he summoned several hundreds of archers and hunters from the kingdom and told them, Do you see white elephants with six-tusked bodies in the mountain?",
        "source": "T04n0205_001:0504b19_15"
    },
    {
        "source_sentence": "皆言：「未曾見也！」",
        "translation": "They all said, Never seen it!",
        "source": "T04n0205_001:0504b22_16"
    },
    {
        "source_sentence": "王意不樂。",
        "translation": "The king's mind isn't happy.",
        "source": "T04n0205_001:0504b22_17"
    },
    {
        "source_sentence": "使夫人呼獵者共道此意。",
        "translation": "He told the wife to call the hunter and tell him what he wanted.",
        "source": "T04n0205_001:0504b22_18"
    },
    {
        "source_sentence": "夫人言：「此間近處實無此象，汝眾中誰有能耐苦大膽者乎？」",
        "translation": "The woman said, There really isn't such an elephant here and there; who among you people in the crowd has a large liver that endures suffering?",
        "source": "T04n0205_001:0504b23_19"
    },
    {
        "source_sentence": "有一人長跪曰：「我最可矣！」",
        "translation": "A man knelt down and said, Most wonderful!",
        "source": "T04n0205_001:0504b24_20"
    },
    {
        "source_sentence": "於是夫人與萬兩金、與其鐵鉤斧鑿及法衣一具，告之：「汝徑詣雪山中，",
        "translation": "The queen then gave her ten thousand taels of gold, an iron- hooked axe and chisel, as well as one set of religious robes.",
        "source": "T04n0205_001:0504b25_21"
    },
    {
        "source_sentence": "道當有大樹，左右有蟒，身長數百丈不可得近，斧鑿穿樹從中過去。",
        "translation": "On the pathway there was a large tree, and to its left and right was a python several hundred feet in height that couldn't be approached; an axe penetrated through the tree and passed by.",
        "source": "T04n0205_001:0504b27_0"
    },
    {
        "source_sentence": "前行當見大水，有樹木臨水上，取鐵鉤鉤上樹，尋枝進而前度至象所住。",
        "translation": "In front of the elephant, he saw a tree facing the water. He climbed up onto the top of the tree with an iron hook and went straight ahead to where the elephant was staying.",
        "source": "T04n0205_001:0504b28_1"
    },
    {
        "source_sentence": "視其常可頓止處，當下作深坑薄覆其上，在中伺象來時，以箭射之。",
        "translation": "He looked for a place where the elephant could always be stopped at once, went down into a deep pit to cover it thinly, and shot him with an arrow while he was waiting for the elephant to come.",
        "source": "T04n0205_001:0504c01_2"
    },
    {
        "source_sentence": "即著袈裟如沙門法，象奉三尊終不害汝。」",
        "translation": "He then puts on his reddish-brown robes according to the ascetic's teaching, and the elephant serves the three honored ones without harming you.",
        "source": "T04n0205_001:0504c02_3"
    },
    {
        "source_sentence": "獵者受教即涉道去，七年七月七日到象所止處，作坑入其中。",
        "translation": "On the seventh day of the seventh month, on the seventh day of the seventh month, he went to where the elephant was staying and dug a pit in it.",
        "source": "T04n0205_001:0504c03_4"
    },
    {
        "source_sentence": "須臾象王還，獵者以毒箭射之，象被此箭不從遠來，便以鼻撈其邊地，",
        "translation": "Soon after the elephant king returned, and a hunter shot at him with a poisonous arrow. The elephant caught by the arrow did not come from a distant place; so he dug up the edge of the ground with his nose.",
        "source": "T04n0205_001:0504c05_5"
    },
    {
        "source_sentence": "見坑中人，即問：「何人？」",
        "translation": "Seeing someone in the pit, he asked, Who is it?",
        "source": "T04n0205_001:0504c06_6"
    },
    {
        "source_sentence": "其人大怖懼自首言：「我是應募人。」",
        "translation": "The great man was frightened and said to himself, I'm the one who should be recruited.",
        "source": "T04n0205_001:0504c07_7"
    },
    {
        "source_sentence": "象王即知是夫人所為，自截其牙用與獵者。",
        "translation": "Knowing what she had done, the elephant king cut off his own teeth and gave them to the hunter.",
        "source": "T04n0205_001:0504c08_8"
    },
    {
        "source_sentence": "語人言：「汝還去，諸象見汝即當害卿，教却行去，群象必當尋迹追汝。」",
        "translation": "He said to the man, Go back, and if the elephants see you, they'll immediately harm you and teach you to leave; the elephants will surely chase after you.",
        "source": "T04n0205_001:0504c09_9"
    },
    {
        "source_sentence": "象王以威神將護，七日之中得出部界，還至本國以象牙與夫人。",
        "translation": "In seven days the king of elephants, protected by his mighty deity, came out of the royal territory and returned to his own country. He gave the woman an ivory to him.",
        "source": "T04n0205_001:0504c10_10"
    },
    {
        "source_sentence": "夫人得之反覆視之，且喜且悔，未幾吐血死近。",
        "translation": "The queen saw him and looked at him repeatedly. She was both delighted and remorseful, but before long she vomited blood and died.",
        "source": "T04n0205_001:0504c12_11"
    },
    {
        "source_sentence": "釋迦文佛在世時，天、龍、鬼神、四輩弟子大會說法，坐中有大比丘尼，",
        "translation": "When Śākyamuni Buddha was in the world, gods, dragons, ghosts, spirits, and the four groups of disciples preached the Dharma to the assembly. There were great bhikṣus and nuns seated there.",
        "source": "T04n0205_001:0504c13_12"
    },
    {
        "source_sentence": "遙瞻視佛便大聲笑，須臾復舉聲哭，眾坐中無不怪者。",
        "translation": "Looking at the Buddha from a distance, they laughed loudly and in an instant raised their voices to wail. No one among the monks seated there wondered.",
        "source": "T04n0205_001:0504c14_13"
    },
    {
        "source_sentence": "阿難問佛：「云何此比丘尼得阿羅漢，何因且悲且喜不能自勝？",
        "translation": "Ānanda asked the Buddha, How did this monk and nun attain arhatship, and why were they so sad and joyous that they couldn't overcome themselves?",
        "source": "T04n0205_001:0504c16_14"
    },
    {
        "source_sentence": "願聞其事。」",
        "translation": "May I hear about it?",
        "source": "T04n0205_001:0504c17_15"
    },
    {
        "source_sentence": "佛告阿難：「爾時白象王者我身是，夫人者今瞿夷是，小夫人者今比丘尼是，",
        "translation": "The Buddha said to Ānanda: At that time the king of the white elephants was none other than I myself, while the queen’s wife was none other than Kauṇḍinya. The younger queen is none other than a bhikṣuṇī.",
        "source": "T04n0205_001:0504c17_16"
    },
    {
        "source_sentence": "以得神通識往昔事，所以悲者，不事心所喜，笑者，賊害善人更從得道。」",
        "translation": "Because they've attained supernormal abilities and consciousness of past events, those who are compassionate don't serve what their hearts delight in, laugh when thieves harm good people and then attain the path.",
        "source": "T04n0205_001:0504c19_17"
    },
    {
        "source_sentence": "眾會聞，皆念曰：「與世尊作惡因緣猶尚得度，況有道德之因緣乎！」",
        "translation": "When the assembly heard this, they all thought, The Bhagavān and the Bhagavān are still able to save them for bad causes and conditions, so why wouldn't there be moral causes and conditions?",
        "source": "T04n0205_001:0504c21_0"
    },
    {
        "source_sentence": "一切眾會皆發無上正真道意，願及十方廣度一切。",
        "translation": "All the assemblies all aroused the intention for the unsurpassed true path, vowing to save all people in the ten directions.",
        "source": "T04n0205_001:0504c22_1"
    },
    {
        "source_sentence": "（一〇）昔佛詣倮國受須竭請，其國近海，龍興雲雨，佛恐漂沒人民，",
        "translation": "(10) Once, when the Buddha went to the country of Kauṇḍinya and was invited by Śubhavyūha, a dragon raised clouds and rain near the sea in that country, and the Buddha was afraid he would drown the people.",
        "source": "T04n0205_001:0504c24_0"
    },
    {
        "source_sentence": "受飲食已，引眾詣阿耨達池。",
        "translation": "After he had received the food and drink, he led the crowd to Anavatapta Lake.",
        "source": "T04n0205_001:0504c25_1"
    },
    {
        "source_sentence": "佛會畢，眾坐已定，告：「舍利弗不在會中。」",
        "translation": "After the Buddha's assembly was over, the congregation was seated and fixed, and he told Śāriputra, Śāriputra isn't in the assembly.",
        "source": "T04n0205_001:0504c26_2"
    },
    {
        "source_sentence": "天帝念曰：「佛左右常得神足智慧，益佛光輝。」",
        "translation": "Emperor Tiandi thought, The Buddha's left and right always attain supernormal abilities and wisdom, which increase the Buddha's radiance.",
        "source": "T04n0205_001:0504c27_0"
    },
    {
        "source_sentence": "佛知其所念，告目揵連：「汝往呼舍利弗來。」",
        "translation": "Knowing what he thought, the Buddha told Maudgalyāyana, Go and call Śāriputra to come.",
        "source": "T04n0205_001:0504c28_0"
    },
    {
        "source_sentence": "目連作禮而往。",
        "translation": "Maudgalyāyana paid homage and departed.",
        "source": "T04n0205_001:0504c28_1"
    },
    {
        "source_sentence": "舍利弗補護法衣，目連曰：「佛在阿耨達池天大會，佛使我來相呼，願以時去。」",
        "translation": "Śāriputra guarded the Dharma robe, and Maudgalyāyana said, When the Buddha was at the great assembly of gods in Anavatapta's pond, the Buddha sent me to summon him; I wish to leave you at the right time.",
        "source": "T04n0205_001:0504c29_2"
    },
    {
        "source_sentence": "舍利弗言：「須我衣竟。」",
        "translation": "Śāriputra said, They need my robes when they're finished.",
        "source": "T04n0205_001:0505a02_3"
    },
    {
        "source_sentence": "目連答曰：「不時去者，吾當神足取卿及山石室置右掌中，持詣佛所。」",
        "translation": "Maudgalyāyana answered, If you don't leave at the right time, I will take your spiritual feet, place them in my right palm and carry them to the Buddha's place.",
        "source": "T04n0205_001:0505a02_4"
    },
    {
        "source_sentence": "舍利弗便解腰帶著地，語目連曰：「汝能令帶離於地者，我身乃可舉。」",
        "translation": "Śāriputra then untied his waist and carried it to the ground, saying to Maudgalyāyana, If you can make it leave the ground, I can lift it.",
        "source": "T04n0205_001:0505a04_5"
    },
    {
        "source_sentence": "目連即舉之，地能為振動，帶不可舉。",
        "translation": "Maudgalyāyana then raised it, and the earth could shake it, but the belt couldn't lift it.",
        "source": "T04n0205_001:0505a05_6"
    },
    {
        "source_sentence": "目連以神足還佛所，舍利弗先坐佛邊，目連乃知神足之力不如智慧之力也。",
        "translation": "Maudgalyāyana returned to the Buddha with his supernormal powers, and Śāriputra first sat beside the Buddha. Maudgalyāyana then knew that the power of his supernormal powers was not as great as the power of his wisdom.",
        "source": "T04n0205_001:0505a06_7"
    },
    {
        "source_sentence": "時坐中有一比丘，耳中有須曼花，眾坐皆疑：「比丘之法離於花飾，而此比丘著花何謂？」",
        "translation": "A monk in his seat at the time had a saṃman flower in his ears, and all the people sitting there wondered, What's the meaning of this monk wearing a flower when the monk's teaching is free of decorating flowers?",
        "source": "T04n0205_001:0505a08_8"
    },
    {
        "source_sentence": "天帝即白佛言：「不審比丘何以著花？」",
        "translation": "Emperor Tiandi then said to the Buddha, I don't know why a monk wears flowers?",
        "source": "T04n0205_001:0505a10_9"
    },
    {
        "source_sentence": "佛告比丘：「遣耳中花。」",
        "translation": "The Buddha told the monk, send flowers in your ears.",
        "source": "T04n0205_001:0505a11_10"
    },
    {
        "source_sentence": "比丘受教即手挽去其花；",
        "translation": "The bhikṣu accepted the instruction and pulled the flowers away with his palms.",
        "source": "T04n0205_001:0505a11_11"
    },
    {
        "source_sentence": "續復如故，如是取去，其處故有。",
        "translation": "The sequence is also as before: in this way, taking and leaving are acquired. Because of the existence of a certain place.",
        "source": "T04n0205_001:0505a12_12"
    },
    {
        "source_sentence": "佛語比丘：「以神足去之。」",
        "translation": "The Buddha said to the monk, remove it with your spiritual feet.",
        "source": "T04n0205_001:0505a13_13"
    },
    {
        "source_sentence": "即以三昧力作數千萬手，虛空中取耳中花，花故不盡。",
        "translation": "With the power of samādhi, he makes tens of thousands of myriads of hands and takes the flowers in his ears from space, which aren't exhausted because they don't have enough flowers.",
        "source": "T04n0205_001:0505a13_14"
    },
    {
        "source_sentence": "眾坐乃知是道德因緣，非暫著花也。",
        "translation": "The assembled monks then knew that this was the cause and condition for morality, not just a temporary attachment to flowers.",
        "source": "T04n0205_001:0505a15_0"
    },
    {
        "source_sentence": "天帝白佛：「願說本末，使眾會疑解。」",
        "translation": "Emperor Tiandi said to the Buddha, Please explain the source so that the assembly will doubt and understand it.",
        "source": "T04n0205_001:0505a15_1"
    },
    {
        "source_sentence": "佛告天帝：「昔惟衛佛時從來九十一劫。",
        "translation": "The Buddha told Indra, In the past, ninety-one eons had passed since the time of Vaiśravaṇa Buddha.",
        "source": "T04n0205_001:0505a16_2"
    },
    {
        "source_sentence": "時佛大會說法，有一醉客在會中聽，聞經歡喜，耳上著花取散佛上，作禮而去。",
        "translation": "When the Buddha was preaching the Dharma at the great assembly, there was a drunken guest in the assembly who heard the sūtras and rejoiced when he heard them. He put flowers on his ears, scattered them over the Buddha, paid homage, and departed.",
        "source": "T04n0205_001:0505a17_3"
    },
    {
        "source_sentence": "命終之後，九十一劫天上人中受福，不復更三惡道。",
        "translation": "After his death, ninety-one eons later, he'll be blessed among the gods and humans, and he won't go back to the three bad destinies again.",
        "source": "T04n0205_001:0505a19_4"
    },
    {
        "source_sentence": "欲知彼時人者，今此比丘是也，散一花福至今得道，故未盡也。」",
        "translation": "If you want to know who was the person of that time, this monk is the one who scattered a single flower of merit and attained enlightenment up to now; therefore, it's not enough.",
        "source": "T04n0205_001:0505a20_5"
    },
    {
        "source_sentence": "天帝白佛言：「往日醉客不受戒，亦不行六波羅蜜，一散花福乃九十一劫于今不盡，",
        "translation": "Śakra Devānām-Indra said to the Buddha: On a previous day an intoxicated traveler did not keep the precepts, nor did he practice the six transcendent ways. The merit of one scattered flower is ninety-one world ages and will not be exhausted until now.",
        "source": "T04n0205_001:0505a21_6"
    },
    {
        "source_sentence": "何況多作者！」",
        "translation": "How could there be many authors!",
        "source": "T04n0205_001:0505a23_7"
    },
    {
        "source_sentence": "佛告天帝：「當知薩芸若饒益一切如是。」",
        "translation": "The Buddha told the emperor, You should know that all these things are likewise for the benefit of Sākyamuni.",
        "source": "T04n0205_001:0505a24_8"
    },
    {
        "source_sentence": "一切眾會聞說如是，大歡喜，普發無上正真道意。",
        "translation": "All the assemblies heard this teaching and greatly rejoiced, universally arousing the mind of the unsurpassed true path.",
        "source": "T04n0205_001:0505a25_0"
    },
    {
        "source_sentence": "（一一）昔佛始得道，教化天下莫不承動，唯舍衛國王不時信解。",
        "translation": "(1) Once, when the Buddha first attained enlightenment, none of the world's teachings didn't accept it, except for the king of Śrāvastī who didn't believe in it at the time.",
        "source": "T04n0205_001:0505a27_0"
    },
    {
        "source_sentence": "佛之精舍與王園觀隔壁相近，皆臨江水，精舍中有沙彌，有三百餘人，",
        "translation": "The Buddha’s monastery was situated next to the king’s pleasure garden and beside a wall, facing the river. There were more than three hundred śrāmaṇeras in the monastery.",
        "source": "T04n0205_001:0505a28_1"
    },
    {
        "source_sentence": "每給三尊使令。",
        "translation": "Each time, he gave the three honored messengers an order.",
        "source": "T04n0205_001:0505b01_0"
    },
    {
        "source_sentence": "時維那使諸沙彌，各持瓶於江上取水。",
        "translation": "Vairocana then asked the śrāmaṇeras, each holding a pot, to go up the river to get water.",
        "source": "T04n0205_001:0505b01_1"
    },
    {
        "source_sentence": "諸沙彌至江岸，便脫袈裟作屋戲。",
        "translation": "When the śrāmaṇeras arrived at the river's bank, they took off their robes and made a house to play.",
        "source": "T04n0205_001:0505b02_2"
    },
    {
        "source_sentence": "時王波斯匿夫人在樓觀上坐，遙見沙彌等共戲如是，即謂夫人：「我之不信瞿曇，",
        "translation": "When the king’s wife Prasenajit was seated in the tower, he saw from a distance that the śrāmaṇeras and others were playing together like this. He said to her, “I do not believe in the theories of the Gautama.",
        "source": "T04n0205_001:0505b03_0"
    },
    {
        "source_sentence": "良以為是。",
        "translation": "It's well thought to be so.",
        "source": "T04n0205_001:0505b04_1"
    },
    {
        "source_sentence": "瞿曇之等，自稱清淨無有陰蓋，彼今戲樂與我無異，那得言真？」",
        "translation": "Gautama and so forth claim to be pure and have no aggregates or hindrances, but now that their playfulness is no different from mine, how can they say it's true?",
        "source": "T04n0205_001:0505b05_2"
    },
    {
        "source_sentence": "夫人答王：「譬如海中龍蛇，摩訶衍法亦復如是！",
        "translation": "The queen answered the king, Just as there are dragons and snakes in the ocean, so is the teaching of Mahāyāna!",
        "source": "T04n0205_001:0505b06_3"
    },
    {
        "source_sentence": "有得道者、有未得道者，不可一論也！」",
        "translation": "Those who have attained the path and those who haven't yet attained the path can't discuss it in a single way!",
        "source": "T04n0205_001:0505b07_4"
    },
    {
        "source_sentence": "夫人語未竟，諸沙彌等著衣服，各各取水正往向精舍所在，以神足挑三百瓶著虛空中，",
        "translation": "Before the queen had finished speaking, the śrāmaṇeras put on their robes and each took water and went directly to the place where the monastery was located. They picked up three hundred jars in the sky with their magical feet and placed them in the air.",
        "source": "T04n0205_001:0505b08_5"
    },
    {
        "source_sentence": "各各飛逐皆入精舍。",
        "translation": "Each one fled and went into the monastery.",
        "source": "T04n0205_001:0505b10_6"
    },
    {
        "source_sentence": "夫人便指大王所言：「王意未盡者，今現神足何如也！」",
        "translation": "The lady then pointed to what the king had said, What's so wonderful about manifesting miraculous abilities now that the king's mind hasn't ended?",
        "source": "T04n0205_001:0505b10_7"
    },
    {
        "source_sentence": "王見大歡喜，即下觀，與群臣百官共詣佛所，稽首作禮歸命悔過。",
        "translation": "The king was greatly delighted when he saw this. He went down to see the Buddha and, accompanied by his ministers and hundreds of officials, bowed his head in respect and repentance.",
        "source": "T04n0205_001:0505b12_8"
    },
    {
        "source_sentence": "佛為說法，王及夫人一切眾會，皆發無上正真道意。",
        "translation": "The Buddha taught the Dharma for them, and all the assembled people of the king and his wife aroused the intention for the unsurpassed true path.",
        "source": "T04n0205_001:0505b13_9"
    },
    {
        "source_sentence": "（一二）昔舍衛國梵志、長者出城遊戲，展轉到祇桓邊。",
        "translation": "(12) Once, there were priests and elders from Śrāvastī who left the city to play in Sāvatthī and went one after another to the edge of Jeta's Grove.",
        "source": "T04n0205_001:0505b15_0"
    },
    {
        "source_sentence": "佛知其人有功德可度，佛即出坐一樹下，放大光明照祇桓界，樹木土石皆作金色。",
        "translation": "Knowing that the man had merit to be saved, the Buddha went out of his seat under a tree and emitted great rays of light that shone brightly over the entire kingdom of Jīvaka. All the trees, shrubs, soil, and stones were all golden in color.",
        "source": "T04n0205_001:0505b16_1"
    },
    {
        "source_sentence": "梵志見光，問從者曰：「此為何光乎？」",
        "translation": "Seeing the light, the priest asked the attendant, What's this light?",
        "source": "T04n0205_001:0505b18_2"
    },
    {
        "source_sentence": "從者答曰：「不知。」",
        "translation": "The attendant replied, I don't know.",
        "source": "T04n0205_001:0505b19_0"
    },
    {
        "source_sentence": "長者曰：「非是日光耶？」",
        "translation": "The elder said, Isn't that sunlight?",
        "source": "T04n0205_001:0505b19_1"
    },
    {
        "source_sentence": "從人言：「日者光熱，此光寒涼和調，非日光矣！」",
        "translation": "They said to the people, The sun is a hot light, and this light is cold and cool and harmonious, not the sunlight!",
        "source": "T04n0205_001:0505b19_2"
    },
    {
        "source_sentence": "長者復問曰：「得無火光乎？」",
        "translation": "The elder again asked, Is there no firelight?",
        "source": "T04n0205_001:0505b20_3"
    },
    {
        "source_sentence": "從人曰：「非火光，火者動搖不定，此光澤然，不像火光也！」",
        "translation": "He said to the people, It's not like the light of a fire; the fire moves and doesn't budge, but this light is so shiny that it doesn't look like the light of a fire!",
        "source": "T04n0205_001:0505b21_4"
    },
    {
        "source_sentence": "從人思惟知之，語長者：「此是沙門瞿曇道德之光！」",
        "translation": "Knowing it from someone's reflection, he said to the elder, This is the light of the ascetic Gautama's morality!",
        "source": "T04n0205_001:0505b22_5"
    },
    {
        "source_sentence": "長者即曰：「勿說此！",
        "translation": "The elder then said, Don't say that!",
        "source": "T04n0205_001:0505b24_0"
    },
    {
        "source_sentence": "吾不喜瞿曇，速迴車還。」",
        "translation": "I don't like Gautama, so quickly turn around and return in my chariot.",
        "source": "T04n0205_001:0505b24_1"
    },
    {
        "source_sentence": "佛便作變化，三面皆自然有大澗，所向不得過，唯於佛前有道徑。",
        "translation": "The Buddha then manifested his transformation, and on each of the three sides there was a large stream that didn't pass through where he was headed, except for the path in front of him.",
        "source": "T04n0205_001:0505b25_0"
    },
    {
        "source_sentence": "從人白言：「瞿曇邊有道過矣！",
        "translation": "They came from the crowd and said, There's a mistake in the path at Gautama's side!",
        "source": "T04n0205_001:0505b26_1"
    },
    {
        "source_sentence": "事不得已。」",
        "translation": "The task can't be done.",
        "source": "T04n0205_001:0505b27_2"
    },
    {
        "source_sentence": "如前，遙見如來，即以扇覆面；",
        "translation": "As before, he saw the Buddha from a distance and covered his face with a fan.",
        "source": "T04n0205_001:0505b27_3"
    },
    {
        "source_sentence": "佛復以威神，使內外徹舉目，故與佛相見。",
        "translation": "Again, the Buddha used his majestic power to cause his eyes to be raised inside and out so that they could see each other.",
        "source": "T04n0205_001:0505b28_4"
    },
    {
        "source_sentence": "悟覺，下車，稽首作禮。",
        "translation": "Enlightened, he dismounted from his chariot and bowed his head in respect.",
        "source": "T04n0205_001:0505b29_5"
    },
    {
        "source_sentence": "佛與說法，便發無上正真道意，尋得不退轉。",
        "translation": "When the Buddha taught the Dharma to them, they then aroused the intention for the unsurpassed true path and attained nonretrogression.",
        "source": "T04n0205_001:0505b29_6"
    },
    {
        "source_sentence": "背佛去者尚得道慧，何況信向者哉。",
        "translation": "Those who turn their backs on the Buddha's departure will still attain the wisdom of the path, so why wouldn't those who believe in it?",
        "source": "T04n0205_001:0505c01_7"
    },
    {
        "source_sentence": "（一三）昔波羅奈國有大力士八人，一人當六十象力。",
        "translation": "(23) Once, there were eight great men in the kingdom of Vārāṇasī, one person equal to the strength of sixty elephants.",
        "source": "T04n0205_001:0505c03_0"
    },
    {
        "source_sentence": "中有一人，獨多權奇兵法，六十四變文武皆具，以是自恃無所畏難。",
        "translation": "Among them, there was a man who alone possessed many extraordinary weapons and had all the sixty-four different abilities. Because of this he relied on himself without any fear or difficulty.",
        "source": "T04n0205_001:0505c04_1"
    },
    {
        "source_sentence": "佛觀其人，必墮惡道中，往到其所欲度脫之。",
        "translation": "The Buddha observed that those people would surely fall into a bad path, and he went to where they wanted to be liberated.",
        "source": "T04n0205_001:0505c05_2"
    },
    {
        "source_sentence": "守門人白：「瞿曇在外，來欲相見。」",
        "translation": "The gatekeeper said, Gautama is outside, and he's coming to see you.",
        "source": "T04n0205_001:0505c06_3"
    },
    {
        "source_sentence": "力士聞之，語左右言：「瞿曇所在智，豈能勝我？",
        "translation": "When the strong man heard this, he said to his men and women, “O Gautama, how could you surpass me in wisdom?",
        "source": "T04n0205_001:0505c07_4"
    },
    {
        "source_sentence": "不如我也！」",
        "translation": "It's not like me!",
        "source": "T04n0205_001:0505c08_5"
    },
    {
        "source_sentence": "語守門者：「發遣令去，不能見之！」",
        "translation": "He said to the gatekeeper, send an order to leave, but you can't see him!",
        "source": "T04n0205_001:0505c08_6"
    },
    {
        "source_sentence": "佛三詣門不見。",
        "translation": "The Buddha didn't see him at the three approaches.",
        "source": "T04n0205_001:0505c09_7"
    },
    {
        "source_sentence": "佛於是化作年少力士來角倚，門人入白，力士問曰：「得無是國中八人耶？」",
        "translation": "The Buddha then transformed himself into a young warrior and came to stand at the corner, and his disciples entered to confess, and the warrior asked, Can there be eight people in this country?",
        "source": "T04n0205_001:0505c09_8"
    },
    {
        "source_sentence": "門人答言：「年少耳！",
        "translation": "The disciples replied, Young man!",
        "source": "T04n0205_001:0505c11_9"
    },
    {
        "source_sentence": "未曾見也！」",
        "translation": "I've never seen it before!",
        "source": "T04n0205_001:0505c12_0"
    },
    {
        "source_sentence": "力士出外相見，將詣戲場，輕其年少便欲撲殺之，語年少曰：「強來前，",
        "translation": "When the strong men came out to meet each other outside the city and were about to go to amusement park, they despised the youthful man and intended to drive him away. They said to the youthful man, “Come ahead!",
        "source": "T04n0205_001:0505c12_1"
    },
    {
        "source_sentence": "當共手搏。」",
        "translation": "You must wrestle with your hand.",
        "source": "T04n0205_001:0505c13_2"
    },
    {
        "source_sentence": "二人俱前，當欲合之間，佛以神足舉着空中去地十餘丈，下向視地但見火刃，",
        "translation": "When the two men were about to join together, the Buddha lifted them up in midair with his spiritual feet and flew away from the ground for more than ten zhang. Looking downward at the ground, he saw only the edge of a flaming sword.",
        "source": "T04n0205_001:0505c14_0"
    },
    {
        "source_sentence": "都失貢高瞋恚之意，但恐畏死，遙於空中言歸命下方。",
        "translation": "They all lost their high anger, but feared death and fled far away from the sky, saying they were returning to their lives.",
        "source": "T04n0205_001:0505c15_1"
    },
    {
        "source_sentence": "力士乞得全命，佛便著地還見佛身。",
        "translation": "When the strong man begged for his full life, the Buddha then touched the ground and returned to see the Buddha's body.",
        "source": "T04n0205_001:0505c17_2"
    },
    {
        "source_sentence": "力士知是佛，稽首作禮：「我當知佛神足力如是，不敢憍慢乃至於今也。",
        "translation": "Knowing that this was the Buddha, the strong man bowed his head in respect and made obeisance, saying, I should know that the Buddha's miraculous power is so great that I won't dare to be conceited even now.",
        "source": "T04n0205_001:0505c17_3"
    },
    {
        "source_sentence": "願見原恕，以滅重殃。」",
        "translation": "May I see Yuan's forgiveness to extinguish his heavy misfortune.",
        "source": "T04n0205_001:0505c19_4"
    },
    {
        "source_sentence": "佛即受之，為說深法。",
        "translation": "The Buddha then accepted it and taught him the profound Dharma.",
        "source": "T04n0205_001:0505c19_5"
    },
    {
        "source_sentence": "便發無上正真道意，即得阿惟越致。",
        "translation": "He then gave rise to the intention for the unsurpassed true path, which is to attain abhidharma.",
        "source": "T04n0205_001:0505c20_6"
    },
    {
        "source_sentence": "佛之權道所度如是。",
        "translation": "The Buddha's rightful path is thus liberated.",
        "source": "T04n0205_001:0505c21_7"
    },
    {
        "source_sentence": "（一四）昔羅閱祇國有婆羅門子，獨與母居，年少長大自問其母：「我父何所奉事？",
        "translation": "(24) Once, there was a Brāhmaṇa boy in Rājagṛha who lived alone with his mother. When he grew up, he asked his mother, What did my father serve?",
        "source": "T04n0205_001:0505c22_0"
    },
    {
        "source_sentence": "欲習其蹤。」",
        "translation": "I want to cultivate its traces.",
        "source": "T04n0205_001:0505c23_1"
    },
    {
        "source_sentence": "母語子言：「汝父在時，一日三反入水自洗浴。」",
        "translation": "The mother said to her son, When your father was alive, he went into the water three times a day to bathe himself.",
        "source": "T04n0205_001:0505c23_2"
    },
    {
        "source_sentence": "子言：「父作是，何所希望乎？」",
        "translation": "The son said, What's the hope for my father to do this?",
        "source": "T04n0205_001:0505c24_3"
    },
    {
        "source_sentence": "母言：「恒水遣垢，可得神通矣！」",
        "translation": "The mother said,恒水遣垢,可得神通矣!",
        "source": "T04n0205_001:0505c25_4"
    },
    {
        "source_sentence": "子曰：「不然。」",
        "translation": "The son said, No.",
        "source": "T04n0205_001:0505c26_5"
    },
    {
        "source_sentence": "母謂子：「汝寧有異見乎？」",
        "translation": "The mother said to her son, Do you have a different view?",
        "source": "T04n0205_001:0505c26_6"
    },
    {
        "source_sentence": "子言：「若其然者，水北居民日驅牛南渡放，日再洗浴，何不得道？",
        "translation": "The son said, If that's the case, why wouldn't the northerners who drive cattle south to cross and release them every day and wash and bathe again every day be allowed to follow the path?",
        "source": "T04n0205_001:0505c27_7"
    },
    {
        "source_sentence": "且水中有魚鼈之屬在水活，何以復不得道耶？」",
        "translation": "And since there's a fish and turtle in the water that's alive in the water, why isn't it able to follow the path?",
        "source": "T04n0205_001:0505c28_8"
    },
    {
        "source_sentence": "母言：「汝意云何？」",
        "translation": "The mother said, What do you think?",
        "source": "T04n0205_001:0505c29_9"
    },
    {
        "source_sentence": "子言：「唯有如來八解之池三昧之水，浴此乃無為耳！」",
        "translation": "The son said, There's nothing to bathe in here except the water of the Tathāgata's eight pools of liberation and concentration!",
        "source": "T04n0205_001:0506a01_10"
    },
    {
        "source_sentence": "因報母言，當詣佛所求沐神化。",
        "translation": "He then reported to his mother, saying, You must go to the Buddha and seek spiritual transformation.",
        "source": "T04n0205_001:0506a02_11"
    },
    {
        "source_sentence": "於是母子至佛所，佛為說法，子作沙門得羅漢道，還為母說法，復得須陀洹道。",
        "translation": "The mother and child then went to the Buddha, where the Buddha taught him the Dharma. The son became a śramaṇa and attained the path of arhatship. After returning to preach the Dharma for his mother, he again attained the path of stream entry.",
        "source": "T04n0205_001:0506a03_0"
    },
    {
        "source_sentence": "雜譬喻經卷上",
        "translation": "Saṃyuktâgama-sūtra, vol. 1",
        "source": "T04n0205_001:0506a05_0"
    }
]