[
    {
        "source_sentence": "出曜經卷第十一",
        "translation": "出曜經卷第十一",
        "source": "T04n0212_011:0666a04_0"
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian's translation",
        "source": "T04n0212_011:0666a06_0"
    },
    {
        "source_sentence": "誹謗品第九之餘",
        "translation": "the ninth and so forth of the class of denigrating",
        "source": "T04n0212_011:0666a07_0"
    },
    {
        "source_sentence": "　◎若猗內藏，　　依賢聖活，　　愚者墮惡，",
        "translation": "If someone relies on the internal store, relying on the wise and noble to live, the foolish will fall into evil,",
        "source": "T04n0212_011:0666a08_0"
    },
    {
        "source_sentence": "　猶願邪見。",
        "translation": "It's like wishing for wrong views.",
        "source": "T04n0212_011:0666a09_0"
    },
    {
        "source_sentence": "昔佛在舍衛國祇樹給孤獨園，時與數千萬眾前後圍繞而為說法。",
        "translation": "Formerly, when the Buddha was staying at Anāthapiṇḍada Park in Jeta’s Grove in Śrāvastī, accompanied by thousands of myriads of koṭis of bhikṣus, he preached the Dharma for them.",
        "source": "T04n0212_011:0666a10_0"
    },
    {
        "source_sentence": "有異比丘即從坐起，偏露右臂叉手合掌前白佛言：「如來莫說休息泥洹，",
        "translation": "An outsider monk rose from his seat, bared his right shoulder, saluted the Buddha with palms joined, and said to him: The Tathāgata, do not tell me how to rest in nirvana.",
        "source": "T04n0212_011:0666a11_1"
    },
    {
        "source_sentence": "如來出要賢聖妙法，如來於現法中閑靜無為而自娛樂。」",
        "translation": "The Tathāgata teaches the essentials of the good and noble marvelous Dharma, and the Tathāgata entertains himself in the present life in a secluded and unconstructed place.",
        "source": "T04n0212_011:0666a13_2"
    },
    {
        "source_sentence": "爾時世尊告諸比丘：「汝等觀此愚人，自墜惡趣永滅形壽。",
        "translation": "It was then that the Bhagavān addressed the monks, Observe this foolish man who himself fell into a bad destiny and permanently extinguished his form and life.",
        "source": "T04n0212_011:0666a14_3"
    },
    {
        "source_sentence": "不但今日呵制如來，乃往久遠無數世時，於毘波尸如來所，亦復呵制使不說法。",
        "translation": "Not only is the Tathāgata disciplined today, but he's also disciplined those who haven't taught the Dharma at the Tathāgata Vipaśyin's place for an incalculable number of years.",
        "source": "T04n0212_011:0666a15_4"
    },
    {
        "source_sentence": "不但呵制毘波尸如來，乃復呵制尸棄如來使不說法，次復呵制毘舍毘如來，",
        "translation": "Not only did the Tathāgata restrain Vipaśyin, but he also restrains Śikhin and restrains the Tathāgata from teaching the Dharma. Next, he restrains Vaiśravaṇa.",
        "source": "T04n0212_011:0666a17_5"
    },
    {
        "source_sentence": "次復呵制拘樓如來，復次呵制拘那含牟尼佛，次復呵制迦葉如來。",
        "translation": "He then again reprimanded the Tathāgata Kauṇḍinya, the Tathāgata Kanakamuni Buddha, and the Tathāgata Kassapa.",
        "source": "T04n0212_011:0666a19_6"
    },
    {
        "source_sentence": "我今第七如來、至真、等正覺出現於世，復來呵制使不說法。",
        "translation": "Now, I'm the seventh Tathāgata, the supremely true and perfectly enlightened one who appears in the world, and I'll again reprimand him so he won't teach the Dharma.",
        "source": "T04n0212_011:0666a21_7"
    },
    {
        "source_sentence": "如此愚人，端心正意不呵制如來者，即應此座上坐，諸塵垢盡得法眼淨。」",
        "translation": "Such a foolish man with good intentions and right intentions who doesn't rebuke the Tathāgata should then sit on this seat, so that all the defilements will be ended and he'll attain purity of the Dharma eye.",
        "source": "T04n0212_011:0666a22_8"
    },
    {
        "source_sentence": "「以失今良會，　　更立誓願求，",
        "translation": "Because of the failure of this good assembly, I made another vow to seek it.",
        "source": "T04n0212_011:0666a24_9"
    },
    {
        "source_sentence": "　終不見聖諦，　　況欲見究竟？",
        "translation": "They never see the noble truths, so why would they want to see the ultimate?",
        "source": "T04n0212_011:0666a24_9"
    },
    {
        "source_sentence": "是時，世尊在大眾中，說此偈曰：「比丘當知！",
        "translation": "At the time, the Bhagavān was in the midst of the crowd and spoke this verse, Monks, you should know!",
        "source": "T04n0212_011:0666a24_9"
    },
    {
        "source_sentence": "此愚癡凡夫之人，於賢聖道撿自喪形命，離於佛法聖眾。」",
        "translation": "This foolish worldling goes on the path of goodness and nobleness, loses his own body and life, and parts with the Buddha, Dharma, and holy people.",
        "source": "T04n0212_011:0666a27_10"
    },
    {
        "source_sentence": "若猗內藏者，如來深法之藏無所染著，其事有三：一者三界緣對結使永盡無餘亦名阿羅漢。",
        "translation": "If there's an internal store, it's the profound store of the Tathāgata's teaching that has no stain or attachment, and there are three things: one, the conditioned by the three realms to counteract the bonds so that they will be permanently ended without remainder, which is also called an arhat.",
        "source": "T04n0212_011:0666a28_11"
    },
    {
        "source_sentence": "二者不復生滅更無萌兆趣生熟藏。",
        "translation": "The second is that they no longer arise and cease, and there are no further signs of birth or destinies that give rise to the store of accumulation.",
        "source": "T04n0212_011:0666b01_12"
    },
    {
        "source_sentence": "三者於天人世興致供養悉能消化，使前施者受福無窮。",
        "translation": "Third, they are able to fully subdue the offerings offered by gods and humans in all worlds so that those who previously made donations will receive unlimited merit.",
        "source": "T04n0212_011:0666b02_13"
    },
    {
        "source_sentence": "是故說曰，若猗內藏也。",
        "translation": "That's why it's said, 'Suppose he were to enter the internal store.'",
        "source": "T04n0212_011:0666b03_14"
    },
    {
        "source_sentence": "依賢聖活者，賢聖有二：一者善根成就名曰賢聖，二者無漏成就名曰賢聖。",
        "translation": "Depending on the noble ones who are alive, there are two kinds of noble ones: those whose good roots are accomplished called noble ones and those whose uncontaminated accomplishments are called noble ones.",
        "source": "T04n0212_011:0666b04_15"
    },
    {
        "source_sentence": "如此賢聖不猗邪見而求活，乃依深法妙智而求活也。",
        "translation": "Thus, the good and noble people don't rely on wrong views and seek to live, but they rely on the profound Dharma and marvelous wisdom to seek to live.",
        "source": "T04n0212_011:0666b05_16"
    },
    {
        "source_sentence": "是故說曰，依賢聖活也。",
        "translation": "That's why it's said, Rely on the good and noble to live.",
        "source": "T04n0212_011:0666b07_17"
    },
    {
        "source_sentence": "愚者墮惡者，猶如彼比丘呵制如來使不說法。",
        "translation": "A foolish man who falls into evil is like that monk who reprimanded the Tathāgata and asked him not to teach the Dharma.",
        "source": "T04n0212_011:0666b07_18"
    },
    {
        "source_sentence": "「休息泥洹、如來出要、賢聖妙法，如來於現法中但當閑靜無為而自娛樂，",
        "translation": "Enlightenment rests in nirvana, the Tathāgata’s liberation from defilement, and the transcendent ways of the wise and saintly disciples. The Tathāgata should be neither involved in worldly activities nor engaged in self-conceit in the present life.",
        "source": "T04n0212_011:0666b08_19"
    },
    {
        "source_sentence": "何為與大眾說法？」",
        "translation": "Why do you teach the Dharma to the masses?",
        "source": "T04n0212_011:0666b10_20"
    },
    {
        "source_sentence": "如此比類，愚不識真自招禍惡，願樂湯火以為屋室，此人不當與坐起言語。",
        "translation": "Such people are foolish and don't know the truth that they themselves bring harm and evil, wishing to make a room with hot water and fire as their living quarters, and these people won't give it to them to sit or speak.",
        "source": "T04n0212_011:0666b10_21"
    },
    {
        "source_sentence": "是故說曰，愚者墮惡也。",
        "translation": "That's why it's said, Foolishness is falling into evil.",
        "source": "T04n0212_011:0666b12_22"
    },
    {
        "source_sentence": "猶願邪見者，懷猶豫見習顛倒久與邊見相應，如彼契經所說：「佛告長者：『夫邪見之人自犯身行如所說，",
        "translation": "It's like wishing for someone with wrong views who harbors hesitant views and cultivates mistaken views for a long time to be associated with extreme views, just as they say in the sūtras, The Buddha told the elderly man, 'A person with wrong views commits self-inflicted bodily actions as described.",
        "source": "T04n0212_011:0666b13_23"
    },
    {
        "source_sentence": "犯口所行如所說，犯意所行如所說，興意想念流馳萬端，盡興邪見不可親近，",
        "translation": "What's practiced by the offending mouth is as explained, what's practiced by the offending mind is as explained, and what's practiced by the offending mind is as explained. They give rise to thoughts and thoughts that flow everywhere, and they all give rise to wrong views that can't be associated with them.",
        "source": "T04n0212_011:0666b15_24"
    },
    {
        "source_sentence": "消滅善本增益惡種。",
        "translation": "They extinguish the good roots and increase the bad seeds.",
        "source": "T04n0212_011:0666b17_25"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T04n0212_011:0666b17_26"
    },
    {
        "source_sentence": "長者當知！",
        "translation": "You should know, householder!",
        "source": "T04n0212_011:0666b17_27"
    },
    {
        "source_sentence": "邪見為病迷於正法，猶伊叉桓子、帝多羅子、尸婆犁子種散於地，隨時長養漸得水潤，",
        "translation": "Like the yakṣa, pratyekabuddha, and śivāsapālī seeds that scatter to the ground as they grow and gradually moisten themselves with water at different times.",
        "source": "T04n0212_011:0666b18_28"
    },
    {
        "source_sentence": "火溫風動地持，後得長大，食之極苦麤澁穢臭不可食噉。』」",
        "translation": "When the fire warms, the wind stirs, and the earth moves, they'll grow up to eat it, which is so painful, crude, foul, smelly, and unworthy that they won't eat it.'",
        "source": "T04n0212_011:0666b20_29"
    },
    {
        "source_sentence": "邪見之人亦復如是，自犯身行口行意行，是故說曰，猶願邪見也。",
        "translation": "A person with wrong views is likewise, who violates his own body, speech, and thought practices; therefore, he says, 'I still wish for wrong views.'",
        "source": "T04n0212_011:0666b21_30"
    },
    {
        "source_sentence": "　竹蘆生節，　　還害其軀，　　吐言當善，",
        "translation": "The bamboo and reeds that grow in the seasons will return to harm their bodies, and it's good to spit out words.",
        "source": "T04n0212_011:0666b23_0"
    },
    {
        "source_sentence": "　不演惡教。",
        "translation": "They won't teach bad teachings.",
        "source": "T04n0212_011:0666b24_0"
    },
    {
        "source_sentence": "竹蘆生節者，竹蘆生節麤而且長，若遇暴風倚互相撐各入其節，節自枯朽更不復生。",
        "translation": "The bamboo and reeds give rise to the buds. The bamboo and reeds give rise to buds that are coarse and long, and if a strong wind blows against each other and enters their buds, the buds themselves wither and don't grow again.",
        "source": "T04n0212_011:0666b25_0"
    },
    {
        "source_sentence": "彼比丘所說亦復如是，自招其罪不為他人，是故說曰，竹蘆生節，還害其軀也。",
        "translation": "That monk's explanation is likewise, in which he himself commits his sins and doesn't do so for others. Therefore, he says, bamboo and reeds give rise to the flesh that returns to harm his body.",
        "source": "T04n0212_011:0666b27_0"
    },
    {
        "source_sentence": "吐言當善者，言當慈仁哀愍一切，是故說曰，吐言當善也。",
        "translation": "He who speaks words that will be good means he speaks words that will be kind and compassionate to all.",
        "source": "T04n0212_011:0666b28_1"
    },
    {
        "source_sentence": "不演惡教者，有吐言教不善之法後趣惡道，人身猶尚可行，言辯通達時乃有耳。",
        "translation": "Someone who doesn't teach badly says that there are people who say unwholesome things and then go to a bad path, but their bodies can still be practiced, so it's only when they speak eloquently and understand them.",
        "source": "T04n0212_011:0666c01_2"
    },
    {
        "source_sentence": "是故說曰，不演惡教也。",
        "translation": "That's why it's said, They don't teach bad teachings.",
        "source": "T04n0212_011:0666c02_3"
    },
    {
        "source_sentence": "　從善得解脫，　　為惡不得解，",
        "translation": "Attaining liberation from goodness, they don’t attain it because of evil.",
        "source": "T04n0212_011:0666c04_0"
    },
    {
        "source_sentence": "　善解者為賢，　　是為脫惡惱，",
        "translation": "Those who understand well are wise. This is the way to be freed from evil.",
        "source": "T04n0212_011:0666c05_0"
    },
    {
        "source_sentence": "　賢聖解不然，　　如彼愚得解。",
        "translation": "Good men and sages understand otherwise, just as that foolish man understands.",
        "source": "T04n0212_011:0666c06_0"
    },
    {
        "source_sentence": "從善得解脫者，夫至解脫無為之處，言當用善，巧言善語者，為人所敬，",
        "translation": "He who attains liberation from goodness is someone who goes to the unconditioned state of liberation and speaks with goodness, skillfully speaking well-worded words that will be respected by people.",
        "source": "T04n0212_011:0666c07_0"
    },
    {
        "source_sentence": "所至到方多所饒益，是故說曰，從善得解脫也。",
        "translation": "That's why it's said that they attain liberation from goodness.",
        "source": "T04n0212_011:0666c08_1"
    },
    {
        "source_sentence": "為惡不得解者，常懷愁憂心意煩惱恒懷恐懼，是故說，為惡不得解也。",
        "translation": "Someone who doesn't understand because of evil always harbors grief and mental afflictions and always harbors fear, so they say it's because they don't understand because of evil.",
        "source": "T04n0212_011:0666c09_2"
    },
    {
        "source_sentence": "善解者為賢者，言解脫未必是解脫，或能被繫王者所拘，所謂解脫者心身俱解脫，",
        "translation": "Good liberation is the wise one who says that liberation isn't necessarily liberation, or it might be imprisoned by a fettered king. The so-called liberation is mental and body liberation at the same time.",
        "source": "T04n0212_011:0666c11_3"
    },
    {
        "source_sentence": "是故說，善解者為賢。",
        "translation": "Therefore, it's said that someone who well understands is good.",
        "source": "T04n0212_011:0666c13_4"
    },
    {
        "source_sentence": "是謂脫惡惱者，縛有二緣，今身易後身，今身者桁械考掠及諸五毒之痛，",
        "translation": "This means that liberation from evil is conditioned by two conditions. The present body dissolves into a new body, and the body of the one born in the present body is subject to the pain of beating, banditry, and all five kinds of poisons.",
        "source": "T04n0212_011:0666c13_5"
    },
    {
        "source_sentence": "復被結使縛流轉五趣，於中能自拔濟乃為善解，是故說，解脫惡惱也。",
        "translation": "Again, they're bound by the bonds and tendencies that flow in the five destinies, and when they can themselves be freed from them, they are well liberated; therefore, they're said to be liberated from bad afflictions.",
        "source": "T04n0212_011:0666c15_6"
    },
    {
        "source_sentence": "賢聖解不然者，賢聖有二業：一者善本成就，二者無漏成就。",
        "translation": "Good and noble people understand otherwise. Good and noble people have two actions: first, the accomplishment of good roots; second, the accomplishment of pure ones.",
        "source": "T04n0212_011:0666c16_7"
    },
    {
        "source_sentence": "彼賢聖人所吐言教不自傷損，後無苦惱，是故說賢聖解不然也。",
        "translation": "That good and noble person's words and teachings that are spoken don't harm themselves, and there's no suffering or distress afterward; therefore, it's said that good and noble people understand otherwise.",
        "source": "T04n0212_011:0666c18_8"
    },
    {
        "source_sentence": "如彼愚得解者，愚人習行好著邪道不隨正路，以自牽往趣三惡道，是故說如彼愚得解也。",
        "translation": "Like that foolish man who attains understanding, a foolish person cultivates the wrong path and doesn't follow the right path, leading themselves to the three bad destinies, which is why it's said to be like that foolish man who attains understanding.",
        "source": "T04n0212_011:0666c19_9"
    },
    {
        "source_sentence": "　比丘抱損意，　　不躁言得忠，",
        "translation": "A monk who embraces harmful intentions, doesn't speak angrily and attains faith.",
        "source": "T04n0212_011:0666c22_0"
    },
    {
        "source_sentence": "　義說如法說，　　是言柔軟甘。",
        "translation": "The meaning is explained according to the teaching of the Dharma, which is called gentle and sweet.",
        "source": "T04n0212_011:0666c23_0"
    },
    {
        "source_sentence": "比丘抱損意者，比丘護口意，自能收攝，語不煩重，若處道俗，處中而說不嬈彼此，",
        "translation": "A monk who embraces harmful thoughts is a monk who guards his words and thoughts, being able to gather them in himself without bothering others. If he talks among the clergy or laymen, he speaks appropriately so that they won't disturb each other.",
        "source": "T04n0212_011:0666c24_0"
    },
    {
        "source_sentence": "是故說曰，比丘抱損意也。",
        "translation": "That's why it's said, A monk embraces harmful intentions.",
        "source": "T04n0212_011:0666c25_1"
    },
    {
        "source_sentence": "不躁言得忠者，少言多中不離佛語，世俗煩閙意恒遠離，是故說曰，不躁言得忠也。",
        "translation": "Someone who attains loyalty in words that aren't agitated because they don't part from the Buddha's words in a few words or many words and are always far removed from worldly afflictions and disturbances, so they say, Not agitating words attain loyalty.",
        "source": "T04n0212_011:0666c26_2"
    },
    {
        "source_sentence": "義說如法說者，具足而說，句身味身無所缺漏，是故說曰，義說如法說也。",
        "translation": "Someone who explains the meaning and explains it according to the teaching of the Dharma is fully explained, with words, bodies, flavors, and bodies that aren't missing anything; therefore, they say, 'Explain the meaning and explain it according to the teaching of the Dharma.'",
        "source": "T04n0212_011:0666c28_3"
    },
    {
        "source_sentence": "是言柔軟甘，出無量義解悅人意，所說無厭足，如天甘露善心無怒，亦不選擇彼豪族種、此卑家種，",
        "translation": "He speaks gently and sweetly, revealing immeasurable meanings to please people. What he teaches is without tire or contentment, like heavenly ambrosia. [The Buddha] has a wholesome mind free of anger, and does not discriminate between the noble and the humble.",
        "source": "T04n0212_011:0667a01_0"
    },
    {
        "source_sentence": "平等而說無增減心，是故說曰，是言柔軟甘也。",
        "translation": "It's said to be equal and without increase or decrease in mind, so it's said to be gentle and sweet.",
        "source": "T04n0212_011:0667a03_1"
    },
    {
        "source_sentence": "　善說賢聖教，　　法說如法二，",
        "translation": "Good exposition of the doctrine of the wise and holy. The doctrine that is to be taught according to the doctrine, are twofold.",
        "source": "T04n0212_011:0667a05_0"
    },
    {
        "source_sentence": "　念說如念三，　　諦說如諦四。",
        "translation": "Mindfulness is said to be threefold in relation to mindfulness; Truths are said to be fourfold in relation to truth.",
        "source": "T04n0212_011:0667a06_0"
    },
    {
        "source_sentence": "善說賢聖教者，賢聖出教必有所由，接度眾生無不有濟，是故說賢聖教也。",
        "translation": "Good explanation of the teachings of the wise and holy is that there must be a reason for the wise and holy to teach, and there's no one who can save sentient beings without help; therefore, it's called the teaching of the wise and holy.",
        "source": "T04n0212_011:0667a07_0"
    },
    {
        "source_sentence": "法說如法二者，賢聖教中正法所居、非法所居。",
        "translation": "“The doctrine is said to be as doctrine”: In the doctrine of the wise and holy one, right doctrine abides and unlawful doctrine abides.",
        "source": "T04n0212_011:0667a08_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T04n0212_011:0667a09_2"
    },
    {
        "source_sentence": "說法之時，廣布賢聖道長益善根，說非法時，增益不善根善法有損。",
        "translation": "When he teaches the Dharma, he spreads the good roots of the noble path widely and increases the good roots, and when he teaches what's not the Dharma, there's harm in increasing the unwholesome roots and good qualities.",
        "source": "T04n0212_011:0667a09_3"
    },
    {
        "source_sentence": "善說賢聖教，第一句；",
        "translation": "Good explanation of the doctrine of the wise and holy, the first phrase.",
        "source": "T04n0212_011:0667a11_4"
    },
    {
        "source_sentence": "法說如法說，是故說法說如法二也。",
        "translation": "The teaching of the Dharma and the teaching of the Dharma are therefore explained according to the teaching, which is why the teaching of the Dharma and the teaching of the Dharma are explained according to the Dharma.",
        "source": "T04n0212_011:0667a11_5"
    },
    {
        "source_sentence": "念說如念三者，出言柔和為人所愛念，出言麤獷為人所憎惡，欲為人所念者當自念其善，",
        "translation": "“Three kinds of mindfulness are said to be three kinds of mindfulness”: When uttering words that are gentle and peaceful, they are beloved by people; when uttering words that are coarse and harsh, they are hated by people. Those who want to be thought of by others should think of their own goodness.",
        "source": "T04n0212_011:0667a12_6"
    },
    {
        "source_sentence": "雖處畜生，聞其惡言皆懷愁慼。",
        "translation": "Even though they're in the animal kingdom, when they hear their bad words, they all harbor grief.",
        "source": "T04n0212_011:0667a14_7"
    },
    {
        "source_sentence": "昔有二人各畜力牛，一人自誇欲得與彼牛捔力，若不如者，要金錢五百，",
        "translation": "Formerly there were two men, each holding a powerful cow. One of them prided himself in his desire to be given the power of that cow’s yoke. If he did not, he would have to pay five hundred [Chinese] coins.",
        "source": "T04n0212_011:0667a15_8"
    },
    {
        "source_sentence": "試牛並耕一牛力實勝之。",
        "translation": "He tested the cow and cultivated one cow, and he was really superior to it in strength.",
        "source": "T04n0212_011:0667a17_9"
    },
    {
        "source_sentence": "其牛主罵曰：「弊牛努力。」",
        "translation": "The owner of the cow scolded him, saying, That's a bad cow that's trying hard.",
        "source": "T04n0212_011:0667a17_10"
    },
    {
        "source_sentence": "牛聞其罵，即便臥地，輸金錢五百枚。",
        "translation": "When the cow heard his scolding, he lay down on the ground and offered him five hundred pieces of money.",
        "source": "T04n0212_011:0667a18_11"
    },
    {
        "source_sentence": "復至後日主責牛曰：「名汝為快牛，乃使我失錢，令我慚愧。」",
        "translation": "When the day came back, the owner of the cow reprimanded him, saying, You're called a happy cow because you caused me to lose money and made me feel shame.",
        "source": "T04n0212_011:0667a19_12"
    },
    {
        "source_sentence": "牛報其主曰：「更可試之，當盡我力，當還倍得彼錢。」",
        "translation": "The cow reported to the owner, Let's test him again, and he'll use up my strength and return double that amount of money.",
        "source": "T04n0212_011:0667a20_13"
    },
    {
        "source_sentence": "即復更耕，如牛所言倍得彼錢。",
        "translation": "He then plowed again, just as the cow said, and doubled that amount of money.",
        "source": "T04n0212_011:0667a21_14"
    },
    {
        "source_sentence": "畜生尚識善惡之言，況人當不識善惡言乎？",
        "translation": "How could an animal still know the words of good and evil, let alone a human being who doesn't know the words of good and evil?",
        "source": "T04n0212_011:0667a22_15"
    },
    {
        "source_sentence": "是故說，念說如念三也。",
        "translation": "Therefore, it's said that mindfulness is explained as the three kinds of mindfulness.",
        "source": "T04n0212_011:0667a23_16"
    },
    {
        "source_sentence": "諦說如諦四者，好學之士畏懼生死五道患難，既損耗不益前人，如斯之類塞泥洹路開地獄門，",
        "translation": "The four truths are said to be the same as the truths: A person who is fond of learning fears the dangers and difficulties of the five destinies of birth and death, and because they harm others and don't benefit those who came before them, such kinds of people shut the path of nirvāṇa and open the gates of hell.",
        "source": "T04n0212_011:0667a23_17"
    },
    {
        "source_sentence": "如來欲現真妙之義，諦說如諦四也。",
        "translation": "The Tathāgata wants to show the true and marvelous meaning of the truths, which are explained in terms of the four truths.",
        "source": "T04n0212_011:0667a26_18"
    },
    {
        "source_sentence": "　是以言語者，　　必使己無患，",
        "translation": "That’s why those who speak words Will surely cause themselves no trouble.",
        "source": "T04n0212_011:0667a27_0"
    },
    {
        "source_sentence": "　亦不剋眾人，　　是為能善言。",
        "translation": "He doesn't oppress people, which is good speech that speaks well.",
        "source": "T04n0212_011:0667a28_0"
    },
    {
        "source_sentence": "是以言語者，言先自惟不自剋伐，使今世後世必無苦患，若今身為惡犯王者法，",
        "translation": "That's why it's called saying, 'First think about yourself and don't oppress yourself, so that there won't be any pain in the present life or future lives. If you were to violate the king's law of being a bad offender in your present body,",
        "source": "T04n0212_011:0667a29_0"
    },
    {
        "source_sentence": "或財產田業沒入於宮，或為盜賊劫掠，居業日耗所願必乖。",
        "translation": "Or their possessions and fields may disappear into the palace, or they may be plundered by thieves and robbers, and their daily activities will surely diverge from what they wish.",
        "source": "T04n0212_011:0667b01_1"
    },
    {
        "source_sentence": "若至後身，死入地獄畜生餓鬼，地獄五毒不可堪忍，畜生芻蒿負重為役，",
        "translation": "If he reaches the latter body, he'll die and go to hell as an animal or a hungry ghost, where the five poisons of hell are unbearable.",
        "source": "T04n0212_011:0667b03_2"
    },
    {
        "source_sentence": "餓鬼飢饉形&#;極苦。",
        "translation": "Hungry ghosts and hungry ghosts are extremely painful in form.",
        "source": "T04n0212_011:0667b04_3"
    },
    {
        "source_sentence": "若欲吐言當念謹慎，使今世後世永無苦患，為無數眾生見輒愛念，死生天上受福自然，",
        "translation": "If they want to utter words, they should be mindful and cautious so that there will be no suffering in the present life or any future life. Seeing countless sentient beings, they will cherish them for a long time; and when they die and are reborn in heaven they will receive blessedness spontaneously.",
        "source": "T04n0212_011:0667b05_4"
    },
    {
        "source_sentence": "是故說曰，是以言語者，必使己無患也。",
        "translation": "That's why it's said that someone who speaks this way will surely cause themselves to be without trouble.",
        "source": "T04n0212_011:0667b07_5"
    },
    {
        "source_sentence": "亦不剋眾人者，或有狂夫妄讒良善，使彼興恚以致喪身。",
        "translation": "Also, someone who doesn't oppress people might have a crazed man who falsely disputes goodness and causes them to become angry and lose their body.",
        "source": "T04n0212_011:0667b08_6"
    },
    {
        "source_sentence": "言說真誠不譏彼短則無所剋，是故說曰，亦不剋眾人也。",
        "translation": "When words are spoken with true sincerity and they don't criticize their shortcomings, there's nothing to oppress, so it's said that they don't oppress people.",
        "source": "T04n0212_011:0667b09_7"
    },
    {
        "source_sentence": "是為能善言者，人修善行言必有驗，或說泥洹趣要正路，順從佛教種天之福，",
        "translation": "This is the virtue of those who can speak well, for when people cultivate good practices their words will surely have testimony. Some may say that they are on the right path leading to nirvana and follow the blessedness of the Buddha’s way of rebirth in heaven.",
        "source": "T04n0212_011:0667b10_8"
    },
    {
        "source_sentence": "是故說，是為能善言也。",
        "translation": "Therefore, it's said that these are the words that can be good.",
        "source": "T04n0212_011:0667b12_9"
    },
    {
        "source_sentence": "　言使投意可，　　亦令得歡喜，",
        "translation": "When you say it’s appropriate to your mind, It also makes you rejoice.",
        "source": "T04n0212_011:0667b14_0"
    },
    {
        "source_sentence": "　不使至惡意，　　出言眾悉可。",
        "translation": "If you don't cause it to reach bad intentions, the people who speak it will approve of it.",
        "source": "T04n0212_011:0667b15_0"
    },
    {
        "source_sentence": "言使投意可者，人之處世當習方俗，或相顏而出語，或聽彼進趣而後報，",
        "translation": "Those who say it's appropriate for someone to give their attention and approve of it will be cultivated by people everywhere in the world, or they may speak with each other's faces or listen to their advancement and retribution.",
        "source": "T04n0212_011:0667b16_0"
    },
    {
        "source_sentence": "恒適彼人意良宜得所，或現威怒怯怕時人，或現羸弱伏從於人，將護其意令彼得所。",
        "translation": "He always adapts to the person's wishes and finds a place that's suitable for him, sometimes shows his mighty anger and fearfulness, sometimes shows weakness and subdues people, and will guard their thoughts and make them go where Peter is.",
        "source": "T04n0212_011:0667b17_1"
    },
    {
        "source_sentence": "是故說曰，言使投意可也。",
        "translation": "That's why it's said, It's a good idea to say so.",
        "source": "T04n0212_011:0667b19_2"
    },
    {
        "source_sentence": "亦令得歡喜者，出言向人必使有益，前人聞者倍用歡喜，不被罵詈來彼罵辱，",
        "translation": "It also causes those who attain rejoicing to say words that will surely bring benefit to others. Those who have heard it before are doubly joyful, and they won't be scolded or abused by someone else.",
        "source": "T04n0212_011:0667b20_3"
    },
    {
        "source_sentence": "是故說曰，亦令得歡喜也。",
        "translation": "That's why it's said, It also makes them rejoice.",
        "source": "T04n0212_011:0667b21_4"
    },
    {
        "source_sentence": "不使至惡意者，不施怨於人造不善行，亦不種地獄餓鬼畜生之行。",
        "translation": "Those who aren't led to bad intentions don't give enemies to people who do unwholesome actions, and they don't plant the practices of hell, hungry ghosts, or animals.",
        "source": "T04n0212_011:0667b22_5"
    },
    {
        "source_sentence": "造惡業者，當受三報，是故說曰，不使至惡意也。",
        "translation": "Making bad actions will result in three rewards; therefore, it's said that they won't lead to bad intentions.",
        "source": "T04n0212_011:0667b24_6"
    },
    {
        "source_sentence": "出言眾悉可者，與人從事恒當謙恭卑下，正使言論得勝，當自鄙不如，",
        "translation": "Those who proclaim that the assembly approves of it should always be humble and respectful to those who serve them, so that their speech will be superior and they will despise themselves.",
        "source": "T04n0212_011:0667b25_7"
    },
    {
        "source_sentence": "是故說曰，出言眾悉可也。",
        "translation": "That's why it's said, 'Explain that the multitude is perfectly acceptable.'",
        "source": "T04n0212_011:0667b26_8"
    },
    {
        "source_sentence": "　至誠甘露說，　　說法無有上，",
        "translation": "He teaches with utmost sincerity, like the ambrosia of immortality, Teaching the Dharma without peer.",
        "source": "T04n0212_011:0667b28_0"
    },
    {
        "source_sentence": "　諦說義如法，　　是為立道根。",
        "translation": "To explain the meaning of truth in accordance with the teaching is to establish the faculty of the path.",
        "source": "T04n0212_011:0667b29_0"
    },
    {
        "source_sentence": "至誠甘露說者，與人說法當修諸功德，如來法者，甚深微妙善住安隱，",
        "translation": "He who teaches the Dharma with utmost sincerity like ambrosia of immortality, teaching it to others and cultivating its virtues. The dharma of the Tathāgata is profound and subtle, well-abiding and peaceful.",
        "source": "T04n0212_011:0667c01_0"
    },
    {
        "source_sentence": "一切行無常、一切法無我，泥洹為滅盡，能意御亂，與人說法不懷懈怠，",
        "translation": "Because all conditioned things are impermanent and all phenomena are without self, nirvana is their cessation. They can subdue mental disturbances and teach the Dharma to others without laziness.",
        "source": "T04n0212_011:0667c02_1"
    },
    {
        "source_sentence": "是故說曰，至誠甘露說也。",
        "translation": "That's why it's said, 'It's a sincere teaching of ambrosia.'",
        "source": "T04n0212_011:0667c04_2"
    },
    {
        "source_sentence": "說法無有上者，出言真正輒有所度，趣道之要由是通達，是故說曰，說法無有上也。",
        "translation": "Someone who teaches the Dharma that there's nothing superior says, 'There's nothing superior in teaching the Dharma,' because they speak words that are truly true and easily liberated, and the essentials of the path leading to enlightenment are based on their comprehension.",
        "source": "T04n0212_011:0667c04_3"
    },
    {
        "source_sentence": "諦說義如法者，如念真實本際清淨，亦不顛倒不懷虛詐，如法者名句身句味句，",
        "translation": "He who teaches the meaning of truth in accordance with the teaching, just as mindfulness is true and originally pure, without error or hypocrisy. The Dharma-in accordance with the teaching is called phrase, phrase, phrase body, phrase, taste, phrase.",
        "source": "T04n0212_011:0667c06_4"
    },
    {
        "source_sentence": "真如法性亦不變易，是故說曰，諦說義如法也。",
        "translation": "The true nature of dharmas doesn't change, so it's therefore said that the truth is to explain their meaning as dharmas.",
        "source": "T04n0212_011:0667c08_5"
    },
    {
        "source_sentence": "是為立道根者，無漏善法永離塵垢，至解脫門逮無礙道，是為立道根也。",
        "translation": "This is the establishment of the faculty of the path because uncontaminated wholesome states that are permanently free from defilement and reach the gate of liberation and acquire the unobstructed path, which is the establishment of the faculty of the path.",
        "source": "T04n0212_011:0667c09_6"
    },
    {
        "source_sentence": "　說如佛言者，　　是吉得滅度，",
        "translation": "He who speaks according to the Buddha’s words Is bound to attain nirvana.",
        "source": "T04n0212_011:0667c12_0"
    },
    {
        "source_sentence": "　為能斷苦際，　　是謂言中上。",
        "translation": "In order to be able to cut off the state of suffering, it's called the middle and higher.",
        "source": "T04n0212_011:0667c13_0"
    },
    {
        "source_sentence": "說如佛言者，說四意止究生死原係念專意，或說意斷精進不懈，或說神足兼逮定，",
        "translation": "He who speaks as the Buddha says, he teaches four kinds of intention to stop and investigate birth-and-death in the land of mindfulness and concentrate his mind. Some say intention to cut off effort without laziness, or he teaches supernormal abilities and acquire concentration.",
        "source": "T04n0212_011:0667c14_0"
    },
    {
        "source_sentence": "或說根義於中逮慧根，或說力義成就於力，或說覺意令達覺法，或說八直道分別八道，",
        "translation": "Some say the meaning of faculties is to acquire the faculty of wisdom in them; some say the meaning of powers is to develop their powers; some say the meaning of enlightenment is to make enlightened minds understand the principles of enlightenment; some say the eightfold path is to distinguish the eight paths.",
        "source": "T04n0212_011:0667c15_1"
    },
    {
        "source_sentence": "亦復說若干眾法名身句身味身。",
        "translation": "It's also said that certain things are called bodies, phrases, bodies, tastes, and bodies.",
        "source": "T04n0212_011:0667c17_2"
    },
    {
        "source_sentence": "如來或說八十千諸度，使眾生類乘此度而度彼岸，是故說曰，說如佛言者。",
        "translation": "The Tathāgata sometimes teaches 80,000 perfections, causing sentient beings to ride these perfections and cross over to the other side; therefore, he says, 'Explain as the Buddha says.'",
        "source": "T04n0212_011:0667c18_3"
    },
    {
        "source_sentence": "是吉得泥洹者，永寂之處吉無不利，脫眾苦患離諸結使，亦復脫於生老病死憂慼難禍，",
        "translation": "This is a good omen to attain nirvāṇa, for when he's permanently quiescent, there's neither goodness nor disadvantage, freedom from suffering and distress, freedom from the afflictions, and also freedom from birth, old age, illness, death, grief, sorrow, pain, and hardship.",
        "source": "T04n0212_011:0667c20_4"
    },
    {
        "source_sentence": "是故說曰，是吉得泥洹也。",
        "translation": "That's why it's said, 'It's fortunate to attain nirvāṇa.'",
        "source": "T04n0212_011:0667c22_5"
    },
    {
        "source_sentence": "為能斷苦際者，所謂苦者五盛陰身，牽致冥室不覩慧明。",
        "translation": "The so-called suffering is the body of the five flourishing aggregates, which leads to a mysterious abode that doesn't see wisdom and insight.",
        "source": "T04n0212_011:0667c22_6"
    },
    {
        "source_sentence": "苦有八相，生苦、老苦、病苦、死苦、怨憎會苦、愛別離苦、所求不得苦，",
        "translation": "Suffering has eight characteristics: the suffering of birth, the suffering of old age, the suffering of illness, the suffering of death, the suffering of association with what is disliked, the suffering of separation from what is loved, and the suffering of not getting what one wishes.",
        "source": "T04n0212_011:0667c24_7"
    },
    {
        "source_sentence": "取要言之，五盛陰苦。",
        "translation": "To summarize, the five flourishing aggregates are painful.",
        "source": "T04n0212_011:0667c25_8"
    },
    {
        "source_sentence": "阿僧祇眾生涉歷苦塗至永寂處，如今眾生履行妙觀，越苦境界至無為岸者，",
        "translation": "Incalculable numbers of sentient beings travel through the realm of suffering to the eternal state of quiescence, but now sentient beings fulfill subtle contemplation and transcend the realm of suffering to reach the shore of nonexistence.",
        "source": "T04n0212_011:0667c26_9"
    },
    {
        "source_sentence": "皆由佛恩。",
        "translation": "It's all because of the Buddha's kindness.",
        "source": "T04n0212_011:0667c27_10"
    },
    {
        "source_sentence": "是故說曰，為能斷苦際也。",
        "translation": "That's why it's said to be able to cut the limit of suffering.",
        "source": "T04n0212_011:0667c28_11"
    },
    {
        "source_sentence": "是謂言中上者，所出言教無能過上，亦非二乘所能逮及，曠濟無量亦無邊福，",
        "translation": "This is called the “highest of the highest” [in terms of merit]. The words and doctrines that are uttered cannot surpass it, nor can they be overtaken by the two vehicles. They have unlimited rescue and limitless merit.",
        "source": "T04n0212_011:0667c28_12"
    },
    {
        "source_sentence": "是故說曰，是謂言中上也。",
        "translation": "That's why it's said, This is called the middle and highest of words.",
        "source": "T04n0212_011:0668a01_13"
    },
    {
        "source_sentence": "　一法過去，　　謂妄語人，",
        "translation": "One thing is past: lying to others.",
        "source": "T04n0212_011:0668a02_14"
    },
    {
        "source_sentence": "　不免後世，　　無惡不更。",
        "translation": "They won't be spared in the afterlife, and there's nothing bad that they won't change.",
        "source": "T04n0212_011:0668a02_14"
    },
    {
        "source_sentence": "◎◎出曜經行品第十昔佛在舍衛國祇樹給孤獨園。",
        "translation": "In the past, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0212_011:0668a02_14"
    },
    {
        "source_sentence": "爾時世尊像如經行，漸漸以次至羅云房中，時羅云遙見世尊，即從坐起，",
        "translation": "At that time, the World-honored One was walking like a sutra. He gradually descended one after another to Rāhula’s quarters. Seeing the World-honored One from a distance, Rāhula rose from his seat and said:",
        "source": "T04n0212_011:0668a06_15"
    },
    {
        "source_sentence": "更拂拭坐具清淨水。",
        "translation": "He then brushes away the sitting cloth and cleans it with water.",
        "source": "T04n0212_011:0668a08_16"
    },
    {
        "source_sentence": "世尊至房偏踞羅云床，取清淨水洗手足，留少殘水告羅云曰：「汝見留此水不？」",
        "translation": "When the Bhagavān arrived at the room, he sat cross-legged on the Rāhula bed and took some pure water to wash his hands and feet, leaving a little bit of residual water behind.",
        "source": "T04n0212_011:0668a08_17"
    },
    {
        "source_sentence": "「唯然已見。」",
        "translation": "“Yes, I’ve seen it.”",
        "source": "T04n0212_011:0668a10_18"
    },
    {
        "source_sentence": "佛告羅云：「沙門執行亦復如是，不知慚愧無有恥辱。",
        "translation": "The Buddha told Luo, So it is with the ascetic's conduct, which doesn't know shame and has no shame.",
        "source": "T04n0212_011:0668a10_19"
    },
    {
        "source_sentence": "羅云當知！",
        "translation": "Rāhula, you should know!",
        "source": "T04n0212_011:0668a12_0"
    },
    {
        "source_sentence": "設有比丘，如此行者，無惡不更無痛不遭，猶此惡垢水不可淨用。」",
        "translation": "Suppose there's a monk who thus conducts himself without evil and without pain or suffering, just like this badly dirty water that can't be used purely.",
        "source": "T04n0212_011:0668a12_1"
    },
    {
        "source_sentence": "爾時世尊躬自寫水於地，告羅云曰：「汝見吾寫水在地不乎？」",
        "translation": "It was then that the Bhagavān personally wrote water on the ground and told Rāhula, Do you see me writing water on the ground?",
        "source": "T04n0212_011:0668a13_2"
    },
    {
        "source_sentence": "「唯然已見。」",
        "translation": "“Yes, I’ve seen it.”",
        "source": "T04n0212_011:0668a15_3"
    },
    {
        "source_sentence": "「其有至誠執意妄語，不知慚愧無有恥辱，如此之行無惡不涉。」",
        "translation": "If someone sincerely clings to false speech and doesn't know shame and has no shame, such actions are not bad or unwholesome.",
        "source": "T04n0212_011:0668a15_4"
    },
    {
        "source_sentence": "爾時世尊手執水器覆地，語羅云曰：「汝見我覆此器不？」",
        "translation": "It was then that the Bhagavān covered the earth with a water container in his hand and said to Rāhula, Do you see me covering this container?",
        "source": "T04n0212_011:0668a16_5"
    },
    {
        "source_sentence": "「唯然已見。」",
        "translation": "“Yes, I’ve seen it.”",
        "source": "T04n0212_011:0668a18_0"
    },
    {
        "source_sentence": "「若有至誠執意妄語人，不知慚愧無有羞辱，如此之類無惡不涉。」",
        "translation": "If someone sincerely clings to intentions and speaks falsely, they don't know shame and have no shame, and such kinds of things are not bad or unwholesome.",
        "source": "T04n0212_011:0668a18_1"
    },
    {
        "source_sentence": "爾時世尊告羅云曰：「汝今當作是學，彈指戲笑之間不得妄語，況至誠妄語乎？",
        "translation": "It was then that the Bhagavān addressed Rāhula, Now, you must train yourself in this way, snapped your fingers and laughed without speaking falsely, so why wouldn't you speak falsely? How could you speak falsely with sincerity?",
        "source": "T04n0212_011:0668a19_2"
    },
    {
        "source_sentence": "如是羅云！",
        "translation": "So it is, Rāhula!",
        "source": "T04n0212_011:0668a21_3"
    },
    {
        "source_sentence": "當作是學。」",
        "translation": "I'll do this as a student.",
        "source": "T04n0212_011:0668a21_4"
    },
    {
        "source_sentence": "是故說曰，一法過去，謂妄語人。",
        "translation": "Therefore, it's said that there's one thing in the past, which is a person who speaks falsely.",
        "source": "T04n0212_011:0668a21_5"
    },
    {
        "source_sentence": "二百五十戒威儀內禁七法所說，犯一法者則受其[億-音+(天*天)]，",
        "translation": "The two hundred and fifty precepts are forbidden by the seven rules of deportment, and if someone violates one rule, they'll be subject to their [billion-sound+(tian*天)].",
        "source": "T04n0212_011:0668a22_6"
    },
    {
        "source_sentence": "是故說曰，一法過去，謂妄語人也。",
        "translation": "That's why it's said that there's one thing in the past, which is a person who speaks falsely.",
        "source": "T04n0212_011:0668a23_7"
    },
    {
        "source_sentence": "不免後世者，已捨後世功勳善本，夫人妄語眾人證知，況言重作罪，涉歷艱苦無不周遍，",
        "translation": "Those who cannot escape rebirth in a later existence will abandon the roots of virtue and goodness that are accumulated in a later existence. Their wives lie falsely to others so that they may realize their crimes, not to mention those who repeatedly commit serious sins, enduring all kinds of hardships and pains.",
        "source": "T04n0212_011:0668a24_8"
    },
    {
        "source_sentence": "是故說曰，不免後世，無惡不更。",
        "translation": "Therefore, it's said that they won't be spared in a later life, and there's nothing bad or no change.",
        "source": "T04n0212_011:0668a26_9"
    },
    {
        "source_sentence": "　寧噉燒鐵，　　吞飲洋銅，",
        "translation": "It's better to burn iron and swallow and drink cooked copper.",
        "source": "T04n0212_011:0668a28_0"
    },
    {
        "source_sentence": "　不以無戒，　　食人信施。",
        "translation": "They don't eat people and believe in giving because of the absence of precepts.",
        "source": "T04n0212_011:0668a29_0"
    },
    {
        "source_sentence": "寧噉燒鐵者，猶如鐵丸猛火燒赤，取而吞之，燒脣燒舌燒咽燒腹下過，",
        "translation": "It's like an iron ball with a fierce fire that burns red, takes it and swallows it, burns the lips, burns the tongue, burns the throat, burns the abdomen, and goes down.",
        "source": "T04n0212_011:0668b01_0"
    },
    {
        "source_sentence": "雖有此苦自致死亡，不緣此入地獄餓鬼畜生受苦無量，是故說曰，寧噉燒鐵，",
        "translation": "Even though there is this kind of suffering, the self-causing death results from this kind of suffering. It is not because of this that one enters hell and suffers immeasurable pain in hungry ghosts and animals. Therefore, it is said:",
        "source": "T04n0212_011:0668b02_1"
    },
    {
        "source_sentence": "吞飲洋銅也。",
        "translation": "It's also called swallowing and drinking ocean copper.",
        "source": "T04n0212_011:0668b04_2"
    },
    {
        "source_sentence": "不以無戒，食人信施者，不持戒人，外荷法服內懷姦詭，信無實行自大憍人，",
        "translation": "They don't eat people who believe in giving because of their lack of precepts, don't observe precepts, externally wear religious robes and internally harbor sexual misconduct, believe in the absence of real practices, and are self-indulgent.",
        "source": "T04n0212_011:0668b04_3"
    },
    {
        "source_sentence": "少有所知誇世自譽，受人信施謂宜應爾，不慮後世萬毒加形。",
        "translation": "Knowing little about anything, they boast of their worldly reputation and accept people's faithful donations as appropriate, not worrying about the myriad poisons that will be added to their form in later lives.",
        "source": "T04n0212_011:0668b06_4"
    },
    {
        "source_sentence": "見諸持梵行人興輕蔑心，死輒墮惡，身口意不具，亦不修威儀禮節，出入行來違失禁限；",
        "translation": "Seeing the companions in the holy life, they despise them and immediately fall into evil after death. They are not endowed with bodily or verbal strength, do not observe proper manners of behavior, and go about transgressing the disciplinary rules.",
        "source": "T04n0212_011:0668b07_5"
    },
    {
        "source_sentence": "見人得養生嫉妬心，死輒受困無罪不受。",
        "translation": "Seeing someone who has cultivated jealousy, they'll die and suffer from distress without guilt or suffering.",
        "source": "T04n0212_011:0668b09_6"
    },
    {
        "source_sentence": "是故說曰，不以無戒，食人信施也。",
        "translation": "That's why it's said, It's not because of the absence of precepts that they eat people who believe in giving.",
        "source": "T04n0212_011:0668b10_7"
    },
    {
        "source_sentence": "　若人畏苦，　　亦不樂苦，",
        "translation": "If someone fears suffering and doesn’t delight in suffering,",
        "source": "T04n0212_011:0668b12_0"
    },
    {
        "source_sentence": "　勿造惡行，　　念尋變悔。",
        "translation": "Don't create bad actions, and don't repent of them.",
        "source": "T04n0212_011:0668b13_0"
    },
    {
        "source_sentence": "若人畏苦者，己身畏苦不得施苦於人，施苦於人者後受其報。",
        "translation": "If someone fears suffering, they're afraid of suffering themselves and won't give painful things to others, and if they give painful things to others, they'll later experience their reward.",
        "source": "T04n0212_011:0668b14_0"
    },
    {
        "source_sentence": "是身如地，隨其所種各獲其果，眾生之類亦復如是，隨其種罪後受其報，",
        "translation": "This body is like the earth, which produces its fruit according to the seeds planted therein. So it is with living beings, who receive their retribution according to their sins.",
        "source": "T04n0212_011:0668b15_1"
    },
    {
        "source_sentence": "人心不同猶如形像，罪苦追身無有脫者。",
        "translation": "People's minds are different like shapes and images, and there's no liberation when they're tormented by sin and pursue their bodies.",
        "source": "T04n0212_011:0668b17_2"
    },
    {
        "source_sentence": "是故說曰，若人畏苦，亦不樂苦也。",
        "translation": "That's why it's said, If a person fears suffering and doesn't delight in suffering, they're also afraid of suffering.",
        "source": "T04n0212_011:0668b18_0"
    },
    {
        "source_sentence": "勿造惡行者，不得為惡加被一切，夫人自利乃得利人，不能自益安得益人？",
        "translation": "Those who don't commit bad actions can't be harmed by all of them, and when a woman benefits for herself, she benefits others, but they can't benefit themselves or benefit others?",
        "source": "T04n0212_011:0668b18_1"
    },
    {
        "source_sentence": "若處閙中若在閑靜，若大若小，可見不可見，當遠離於惡如避劫燒，是故說曰，",
        "translation": "If you are in a noisy place or in a quiet place, whether large or small, visible or invisible, you should be far removed from evil just as if you were avoiding the calamity of fire.",
        "source": "T04n0212_011:0668b20_2"
    },
    {
        "source_sentence": "勿造惡行，念尋變悔也。",
        "translation": "Do not commit evil deeds, and be mindful of the repentance that arises from investigation.",
        "source": "T04n0212_011:0668b22_3"
    },
    {
        "source_sentence": "　至誠為惡，　　已作當作，",
        "translation": "Their sincerity is bad, and they've done what they should do.",
        "source": "T04n0212_011:0668b23_0"
    },
    {
        "source_sentence": "　不免於苦，　　欲避何益？",
        "translation": "What's the benefit of wanting to avoid it if you can't escape suffering?",
        "source": "T04n0212_011:0668b24_0"
    },
    {
        "source_sentence": "至誠為惡者，或復有人已作當作方作，已作過去、方作現在、當作未來，",
        "translation": "“With utmost sincerity, it is evil”: Again, someone who has done what should be done in the past, will do what should be done in the future, and has done what was done in the past, will do what should be done in the future.",
        "source": "T04n0212_011:0668b25_0"
    },
    {
        "source_sentence": "三世作惡不知苦至，是故說，至誠為惡，已作當作也。",
        "translation": "The three worlds do evil and don't know the ultimate painfulness of suffering; therefore, it's said that sincerity is evil and what has been done will be done.",
        "source": "T04n0212_011:0668b26_1"
    },
    {
        "source_sentence": "不免於苦者，眾生之類心好為惡，不知後罪報至，若於現身犯王者禁，",
        "translation": "Those who aren’t exempt from suffering are the kinds of sentient beings with good intentions and bad intentions that don’t know the consequences of their subsequent sins will come.",
        "source": "T04n0212_011:0668b27_2"
    },
    {
        "source_sentence": "隨罪輕重料簡決斷，此內法禁亦復如是，習惡不自覺，縱情弛意，是故說，",
        "translation": "The same applies to this inward restraint of the doctrine. Accumulated evil is not self-aware, even if one feels it with a weary mind. That is why it is said:",
        "source": "T04n0212_011:0668b29_3"
    },
    {
        "source_sentence": "不免於惡，欲避何益也。",
        "translation": "What's the benefit of wanting to avoid it if you can't escape evil?",
        "source": "T04n0212_011:0668c02_0"
    },
    {
        "source_sentence": "死王閻羅遣獄卒阿傍，迎罪人魂神，身被五繫，將至閻羅王所。",
        "translation": "King Yama, the king of death, sent a jailer named Ajātaśatru to meet the sinners' spirits and souls. His body was bound in five fetters and taken to the king Yama's quarters.",
        "source": "T04n0212_011:0668c02_1"
    },
    {
        "source_sentence": "王問罪人：「汝頗見第一天使不耶？」",
        "translation": "The king asked the sinners, Have you seen the first arhat?",
        "source": "T04n0212_011:0668c03_2"
    },
    {
        "source_sentence": "對曰：「不見。」",
        "translation": "He replied, I don't see it.",
        "source": "T04n0212_011:0668c04_3"
    },
    {
        "source_sentence": "王問罪人：「云何男子！",
        "translation": "The king asked the sinners, What's the man?",
        "source": "T04n0212_011:0668c04_4"
    },
    {
        "source_sentence": "汝生在人間時，經過村落城郭郡縣，見諸男女父母懷抱，未能離大小便，",
        "translation": "When you were born among the people, you passed through villages, cities, states, and prefectures. You saw men and women carrying their children in their arms but they could not excrete or urinate.",
        "source": "T04n0212_011:0668c05_5"
    },
    {
        "source_sentence": "父母推燥處濕，沐浴澡洗澥浣衣裳，汝為見不？」",
        "translation": "Do you see the parents pushing dry places to wet, bathing, washing, and rinsing their clothes?",
        "source": "T04n0212_011:0668c07_6"
    },
    {
        "source_sentence": "對曰：「已見。」",
        "translation": "He replied, I've seen it.",
        "source": "T04n0212_011:0668c08_7"
    },
    {
        "source_sentence": "王告罪人曰：「汝何不作是慮？",
        "translation": "The king told the sinners, Why don't you worry about this?",
        "source": "T04n0212_011:0668c08_8"
    },
    {
        "source_sentence": "於現法中見善惡報，當自謹慎，淨身口意修諸善法。」",
        "translation": "In the present life, when you see good and bad rewards, you should be careful to purify your body, speech, and mind and cultivate good qualities.",
        "source": "T04n0212_011:0668c09_9"
    },
    {
        "source_sentence": "罪人報曰：「處在人間放意自恣愚不識真，本我所造今受其報。」",
        "translation": "The sinners replied, They're in the human realm, freely self-indulgent and foolish, don't know the truth, and they were created by me in the past and are now subject to their retribution.",
        "source": "T04n0212_011:0668c10_10"
    },
    {
        "source_sentence": "王告罪人：「如卿來語，卿本自造，今當受報，使放逸人知禁制難犯。",
        "translation": "The king told the offender, As you've said, you created it yourself in the past, but now you'll be punished, so that careless people will know that it's difficult to violate the precepts.",
        "source": "T04n0212_011:0668c11_11"
    },
    {
        "source_sentence": "汝所作罪業，非父母為，亦非兄弟五親沙門婆羅門所造。」",
        "translation": "You committed a sinful act that wasn't created by your parents or by the ascetics and brāhmaṇas of your brothers and five relatives.",
        "source": "T04n0212_011:0668c13_12"
    },
    {
        "source_sentence": "爾時閻羅王以此第一天使教誡，次復第二天使教誡之。",
        "translation": "It was then that King Yama instructed the first messenger to admonish him, followed by the second messenger who instructed him.",
        "source": "T04n0212_011:0668c14_13"
    },
    {
        "source_sentence": "「汝頗見第二天使不耶？」",
        "translation": "Do you see the second messenger?",
        "source": "T04n0212_011:0668c15_14"
    },
    {
        "source_sentence": "對曰：「不見。」",
        "translation": "He replied, I don't see it.",
        "source": "T04n0212_011:0668c16_15"
    },
    {
        "source_sentence": "王問罪人：「云何男子！",
        "translation": "The king asked the sinners, What's the man?",
        "source": "T04n0212_011:0668c16_16"
    },
    {
        "source_sentence": "汝在人間經過村落郡縣城邑，見諸男女疾病困篤，坐床褥上或坐或臥？」",
        "translation": "When you're among the people and pass through villages, counties, prefectures, and cities, do you see men and women with illness and distress sitting or lying on a bed or bedding?",
        "source": "T04n0212_011:0668c16_17"
    },
    {
        "source_sentence": "罪人報曰：「已見。」",
        "translation": "The sinners replied, I've seen it.",
        "source": "T04n0212_011:0668c18_18"
    },
    {
        "source_sentence": "「云何男子！",
        "translation": "What do you think, man?",
        "source": "T04n0212_011:0668c18_19"
    },
    {
        "source_sentence": "汝何不作是念：『於現在法中其罪如此，當自謹慎，淨身口意修諸善法。』」",
        "translation": "Why don't you think, 'In the present life, this is such a sin that you should be careful to purify your body, speech, and mind and cultivate good qualities.'",
        "source": "T04n0212_011:0668c19_20"
    },
    {
        "source_sentence": "罪人報曰：「處在人間放逸自恣愚不識真，本我所造今受其殃。」",
        "translation": "The sinners replied, They're among the people who are carelessly self-indulgent and foolish and don't know the truth, and they were created by me in the past and are now subject to their misfortune.",
        "source": "T04n0212_011:0668c20_21"
    },
    {
        "source_sentence": "王告罪人：「如卿所說，卿本自造今當受報，使放逸人知制難犯。",
        "translation": "The king told the offender, As you said, you originally created it yourself, but now you'll be punished, so that careless people will know how difficult it is to violate it.",
        "source": "T04n0212_011:0668c22_22"
    },
    {
        "source_sentence": "汝所作罪，非父母為，亦非兄弟五親沙門婆羅門所造，亦非諸天世人教卿所作。」",
        "translation": "What you've done is a sin that wasn't done by your parents, didn't be done by brothers and five relatives, was not done by ascetics or priests, and wasn't done by gods or people in the world who taught you.",
        "source": "T04n0212_011:0668c23_23"
    },
    {
        "source_sentence": "爾時王以此第二天使教誡已，次與第三天使重教誡之。",
        "translation": "After the king had been instructed by this second messenger, he was again instructed by the third divine messenger.",
        "source": "T04n0212_011:0668c25_24"
    },
    {
        "source_sentence": "「汝頗見第三天使不耶？」",
        "translation": "Have you seen the third heavenly messenger?",
        "source": "T04n0212_011:0668c26_25"
    },
    {
        "source_sentence": "對曰：「不見。」",
        "translation": "He replied, I don't see it.",
        "source": "T04n0212_011:0668c27_26"
    },
    {
        "source_sentence": "王問罪人：「云何男子！",
        "translation": "The king asked the sinners, What's the man?",
        "source": "T04n0212_011:0668c27_27"
    },
    {
        "source_sentence": "汝在人間經過村落城郭郡縣，見諸老人柱杖呻吟行步脊僂頭白齒落，飲食苦竭命在旦夕。",
        "translation": "You're among the people who pass through villages, castles, prefectures, and counties, and see old men with pillars, canes, cries, walkers, ridges, heads, white teeth, and toothlessness, and their lives are exhausted by the suffering of food and drink in the morning and evening.",
        "source": "T04n0212_011:0668c28_28"
    },
    {
        "source_sentence": "汝為見不？」",
        "translation": "Do you see it?",
        "source": "T04n0212_011:0669a01_29"
    },
    {
        "source_sentence": "罪人對曰：「唯然見之。」",
        "translation": "The sinners replied, Yes, I'll see it.",
        "source": "T04n0212_011:0669a01_30"
    },
    {
        "source_sentence": "王問罪人：「云何男子！",
        "translation": "The king asked the sinners, What's the man?",
        "source": "T04n0212_011:0669a01_31"
    },
    {
        "source_sentence": "汝何不作是念：『於現法中其事如此，當自謹慎，淨身口意修諸善法。』」",
        "translation": "Why don't you think, 'In the present life, this is how you should be careful to purify your body, speech, and mind and cultivate good qualities.'",
        "source": "T04n0212_011:0669a02_32"
    },
    {
        "source_sentence": "罪人報曰：「處在人間放逸自恣愚不識真，本我所造今受其殃。」",
        "translation": "The sinners replied, They're among the people who are carelessly self-indulgent and foolish and don't know the truth, and they were created by me in the past and are now subject to their misfortune.",
        "source": "T04n0212_011:0669a03_33"
    },
    {
        "source_sentence": "王告罪人：「如卿所說，卿本自造今當受報，使放逸人知禁制難犯。",
        "translation": "The king told the offender, As you said, you originally created it yourself, but now you'll be punished, so that careless people will know that it's difficult to violate the precepts.",
        "source": "T04n0212_011:0669a05_34"
    },
    {
        "source_sentence": "汝所作罪，非父母為，亦非兄弟五親沙門婆羅門所造，亦非諸天世人教卿使作。」",
        "translation": "You committed a sin that wasn't caused by your parents, didn't by brothers and five relatives, was not created by ascetics or priests, and wasn't created by gods or worldly people who taught you to do so.",
        "source": "T04n0212_011:0669a06_35"
    },
    {
        "source_sentence": "時閻羅王以此第三天使教誡已，次以第四天使重教誡之。",
        "translation": "After he admonished them with the third divine messenger, King Yama then again instructed him with the fourth divine messenger.",
        "source": "T04n0212_011:0669a08_36"
    },
    {
        "source_sentence": "「汝頗見第四天使不？」",
        "translation": "Have you seen the fourth arhat?",
        "source": "T04n0212_011:0669a10_0"
    },
    {
        "source_sentence": "對曰：「不見。」",
        "translation": "He replied, I don't see it.",
        "source": "T04n0212_011:0669a10_1"
    },
    {
        "source_sentence": "王問罪人：「云何男子？",
        "translation": "The king asked the sinners, What's the man?",
        "source": "T04n0212_011:0669a10_2"
    },
    {
        "source_sentence": "汝在人間經過城郭郡縣村落，見諸男女有終亡者，或死經一日二日乃至七日，",
        "translation": "When you pass through cities, towns, prefectures, provinces, and villages among the people, you will see men and women who die at the end of their life. They may live for one day, two days, or up to seven days.",
        "source": "T04n0212_011:0669a11_3"
    },
    {
        "source_sentence": "身體膖脹膿血流出，或為烏鵲虎狼所見噉食。",
        "translation": "Their bodies are swollen, pus and blood flowing out, or they may be eaten by crows, maggots, tigers, and wolves.",
        "source": "T04n0212_011:0669a13_0"
    },
    {
        "source_sentence": "汝見不耶？」",
        "translation": "Do you see it?",
        "source": "T04n0212_011:0669a14_1"
    },
    {
        "source_sentence": "罪人報曰：「唯然見之。」",
        "translation": "The sinners replied, Yes, I'll see it.",
        "source": "T04n0212_011:0669a14_2"
    },
    {
        "source_sentence": "「云何男子！",
        "translation": "What do you think, man?",
        "source": "T04n0212_011:0669a14_3"
    },
    {
        "source_sentence": "汝何不作是念：『於現法中其事如此，當自謹慎，淨身口意修諸善法。』」",
        "translation": "Why don't you think, 'In the present life, this is how you should be careful to purify your body, speech, and mind and cultivate good qualities.'",
        "source": "T04n0212_011:0669a15_4"
    },
    {
        "source_sentence": "罪人報曰：「處在人間放逸自恣愚不識真，本我所造今受其殃。」",
        "translation": "The sinners replied, They're among the people who are carelessly self-indulgent and foolish and don't know the truth, and they were created by me in the past and are now subject to their misfortune.",
        "source": "T04n0212_011:0669a16_5"
    },
    {
        "source_sentence": "王告罪人：「如卿所說，卿本自造今當受報，使放逸人知禁制難犯。",
        "translation": "The king told the offender, As you said, you originally created it yourself, but now you'll be punished, so that careless people will know that it's difficult to violate the precepts.",
        "source": "T04n0212_011:0669a18_0"
    },
    {
        "source_sentence": "汝所作罪，亦非父母兄弟五親沙門婆羅門所造，亦非諸天世人教卿使作。」",
        "translation": "Your sins are not created by your parents, brothers, five relatives, ascetics or brāhmaṇas, and they aren't created by gods or worldlings who teach you to do so.",
        "source": "T04n0212_011:0669a19_1"
    },
    {
        "source_sentence": "時閻羅王以此第四天使教誡已，次以第五天使重教誡之。",
        "translation": "After he admonished them with the fourth divine messenger, King Yama then again instructed him with the fifth divine messenger.",
        "source": "T04n0212_011:0669a21_2"
    },
    {
        "source_sentence": "「汝頗見第五天使不？」",
        "translation": "Have you seen the fifth arhat?",
        "source": "T04n0212_011:0669a22_3"
    },
    {
        "source_sentence": "對曰：「不見。」",
        "translation": "He replied, I don't see it.",
        "source": "T04n0212_011:0669a22_4"
    },
    {
        "source_sentence": "王問罪人：「云何男子！",
        "translation": "The king asked the sinners, What's the man?",
        "source": "T04n0212_011:0669a23_5"
    },
    {
        "source_sentence": "汝在人間經過城郭郡縣村落，見諸男子偷盜作賊，為王所縛，或截手截脚，",
        "translation": "When you pass through cities, towns, provinces, states, and villages among the people, you see men who steal and become thieves. They may be bound by the king or have their hands and feet mutilated.",
        "source": "T04n0212_011:0669a23_6"
    },
    {
        "source_sentence": "或截耳截鼻，或生剝其皮，或拔頭筋，或以鋸鋸頸，或以長橛刺臗從口出，",
        "translation": "Sometimes they cut off their ears and noses, sometimes they shaved their skin; sometimes they pulled out of their mouths with hair or tendons, sometimes with saws and necks, sometimes with long sleeves and thorns.",
        "source": "T04n0212_011:0669a25_7"
    },
    {
        "source_sentence": "或融銅灌身，或支節解其形，或倒懸於樹經於七日以箭射殺，或生革絡頭反縛野地上棄之曠野，",
        "translation": "They may pour molten copper into their bodies, or they may dismember their limbs, or they may hang upside down from a tree for seven days with an arrow to kill them, or they may wrap their leather around their heads and restrain them from touching it in the wilderness.",
        "source": "T04n0212_011:0669a27_8"
    },
    {
        "source_sentence": "或開腹抽腸以草充之。",
        "translation": "Sometimes he opens his abdomen and pulls out his intestines to fill them with grass.",
        "source": "T04n0212_011:0669a29_9"
    },
    {
        "source_sentence": "汝為見不？」",
        "translation": "Do you see it?",
        "source": "T04n0212_011:0669a29_10"
    },
    {
        "source_sentence": "對曰：「唯然見之。」",
        "translation": "He replied, Yes, I'll see it.",
        "source": "T04n0212_011:0669b01_11"
    },
    {
        "source_sentence": "「云何男子！",
        "translation": "What do you think, man?",
        "source": "T04n0212_011:0669b01_12"
    },
    {
        "source_sentence": "汝何不作是念：『於現法中其事如此，當自謹慎，淨身口意修諸善法。』」",
        "translation": "Why don't you think, 'In the present life, this is how you should be careful to purify your body, speech, and mind and cultivate good qualities.'",
        "source": "T04n0212_011:0669b01_13"
    },
    {
        "source_sentence": "罪人報曰：「處在人間放逸自恣愚不識真，本我所造今受其報。」",
        "translation": "The sinners replied, They're among the people who are carelessly self-indulgent and foolish and don't know the truth, and they were created by me in the past and now receive their rewards.",
        "source": "T04n0212_011:0669b03_14"
    },
    {
        "source_sentence": "王告罪人：「如卿所說，卿本自造今當受報，使放逸人知禁制難犯。",
        "translation": "The king told the offender, As you said, you originally created it yourself, but now you'll be punished, so that careless people will know that it's difficult to violate the precepts.",
        "source": "T04n0212_011:0669b04_15"
    },
    {
        "source_sentence": "汝所作罪，亦非父母兄弟五親沙門婆羅門所造，亦非諸天世人教卿使作。」",
        "translation": "Your sins are not created by your parents, brothers, five relatives, ascetics or brāhmaṇas, and they aren't created by gods or worldlings who teach you to do so.",
        "source": "T04n0212_011:0669b06_16"
    },
    {
        "source_sentence": "時閻羅王以此第五天使教誡已，即以罪人付獄卒，將詣鑊湯所，隨罪輕重使入百三十六鑊湯，",
        "translation": "Having been instructed by this fifth heavenly messenger, King Yama handed the sinners over to the jailer and took them to the cauldron. Depending on the severity of their offenses, they were put into one hundred and thirty-six cauldrons of hot water.",
        "source": "T04n0212_011:0669b07_17"
    },
    {
        "source_sentence": "經歷劫數受苦難量。",
        "translation": "They pass through eons of suffering that are immeasurable and painful.",
        "source": "T04n0212_011:0669b10_0"
    },
    {
        "source_sentence": "是故說曰，欲避何益也。",
        "translation": "Therefore, it's said, What good is it to want to avoid?",
        "source": "T04n0212_011:0669b10_1"
    },
    {
        "source_sentence": "　非空非海中，　　非入山石間，",
        "translation": "They are neither empty nor in the ocean, Nor do they enter mountains or stones.",
        "source": "T04n0212_011:0669b11_0"
    },
    {
        "source_sentence": "　莫能於此處，　　避免宿惡殃。",
        "translation": "No one can avoid the bad destinies of past lives here.",
        "source": "T04n0212_011:0669b12_0"
    },
    {
        "source_sentence": "昔佛在釋翅瘦迦惟羅越國尼鳩類園中。",
        "translation": "In the past, the Buddha was in the park of the Nirgrantha type in Śākyamuni's country of Kapilavastu.",
        "source": "T04n0212_011:0669b13_0"
    },
    {
        "source_sentence": "爾時流離王集四種兵，欲往攻伐舍夷國，將諸營從退父王位自立為王。",
        "translation": "At the time, King Rāmaudgalyāyana gathered four kinds of troops to attack Sāvatthī and withdrew his troops from their father's throne as king.",
        "source": "T04n0212_011:0669b13_1"
    },
    {
        "source_sentence": "有一惡臣名曰耶利，白流離王：「王本為王子時，至舍夷外家舍，到佛精舍，",
        "translation": "There was an evil minister named Yeli who said to the king of Liuli, “When the king was a prince, he went to the house of a non-Buddhist monk in Sāvatthī’s country and stayed at the Buddha’s monastery.",
        "source": "T04n0212_011:0669b15_2"
    },
    {
        "source_sentence": "為釋子所毀辱。",
        "translation": "He was disgraced by the Śākyamuni.",
        "source": "T04n0212_011:0669b17_3"
    },
    {
        "source_sentence": "時王見勅：『若我為王便啟此事。』",
        "translation": "The king then saw the command, 'If I were to reveal this matter for the king,' he said.",
        "source": "T04n0212_011:0669b17_4"
    },
    {
        "source_sentence": "今時已到，兵馬興盛。」",
        "translation": "Now that they've arrived, the armies and horses are flourishing.",
        "source": "T04n0212_011:0669b18_5"
    },
    {
        "source_sentence": "即勅嚴駕欲往報怨。",
        "translation": "He then ordered an official carriage to go there in order to repay his enemies.",
        "source": "T04n0212_011:0669b18_6"
    },
    {
        "source_sentence": "佛知其意，先至道側坐枯樹下，時流離王躬率兵馬往伐舍夷國，道遇如來，",
        "translation": "Knowing what he wished, the Buddha first came to the side of the road and sat under a withered tree. At that time King Sāriputta led his troops and horses to attack Śāyin’s country but encountered the Tathāgata on the road.",
        "source": "T04n0212_011:0669b19_7"
    },
    {
        "source_sentence": "即前禮覲前白世尊：「此間多諸好樹枝葉繁茂，何以捨之坐枯樹下？」",
        "translation": "He went up to pay his respects and said to the Bhagavān, Here are many good trees with abundant branches and leaves, so why would you abandon them and sit under a dried-up tree?",
        "source": "T04n0212_011:0669b21_0"
    },
    {
        "source_sentence": "佛告王曰：「五親蔭厚不可捨離，昔此樹茂枝葉熾盛，曾經過此得樹蔭力。」",
        "translation": "The Buddha told the king, The five relatives' shade is so thick that they can't be abandoned; in the past, this tree had luxuriant branches and leaves with blazing flowers, and it was once more powerful than this to attain the shade of a tree.",
        "source": "T04n0212_011:0669b22_1"
    },
    {
        "source_sentence": "王尋退還，還詣兵眾告語上下：「我等宜還不應前進。",
        "translation": "When the king withdrew and returned, he went back to his troops and told them above and below, It's better for us to return rather than advance.",
        "source": "T04n0212_011:0669b24_2"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T04n0212_011:0669b25_3"
    },
    {
        "source_sentence": "如來今日為彼五親，必佐神力不可攻伐。」",
        "translation": "Today, the Tathāgata will surely assist his five relatives with supernormal powers so that they won't be attacked.",
        "source": "T04n0212_011:0669b25_4"
    },
    {
        "source_sentence": "臣佐白王：「如來豈能恒坐樹下乎？」",
        "translation": "The ministers and assistants said to the king, How can the Tathāgata always sit under a tree?",
        "source": "T04n0212_011:0669b26_5"
    },
    {
        "source_sentence": "如來見流離王去後，知此宿緣不可得避，以宿命智觀其所由，觀諸釋種必當受苦。",
        "translation": "When the Tathāgata saw that King Rāmaudgalyāyana had departed, he knew that these lunar conditions couldn't be avoided, so he observed their causes with the knowledge of past lives and observed that the Śākyas would surely experience suffering.",
        "source": "T04n0212_011:0669b27_6"
    },
    {
        "source_sentence": "即從坐而去，還至比丘僧中在眾而坐。",
        "translation": "He departed from his seat and returned to sit among the monks in the assembly.",
        "source": "T04n0212_011:0669b29_7"
    },
    {
        "source_sentence": "時，大目連見如來憐愍五親如有憂悒，往到佛所前白佛言：「今流離王攻舍夷國，",
        "translation": "When Mahāmaudgalyāyana saw that the Tathāgata had pity on his five relatives and was grieved, he went before the Buddha and said to him, “The king of Rājagṛha is attacking Sāvatthī.",
        "source": "T04n0212_011:0669c01_8"
    },
    {
        "source_sentence": "念其中人當遭辛苦，欲以方便救接彼國。",
        "translation": "Thinking that the people there would suffer hardship, he wanted to rescue them with skillful means.",
        "source": "T04n0212_011:0669c02_9"
    },
    {
        "source_sentence": "一者舉舍夷國著虛空中，二者舉舍夷國著大海中，三者舉舍夷國著須彌山腹裏。",
        "translation": "One, raising the country of Śāriputra into space, two, raising the country of Śāriputra into the ocean, and three, raising the country of Śāriputra into the belly of Mount Sumeru.",
        "source": "T04n0212_011:0669c03_10"
    },
    {
        "source_sentence": "四者舉舍夷國人著此地下他方世界。",
        "translation": "Fourth, he raises the people of Śākyamuni and puts them in other worlds under this ground.",
        "source": "T04n0212_011:0669c05_11"
    },
    {
        "source_sentence": "令流離王不知其處。」",
        "translation": "He caused the king to run away and didn't know where he was.",
        "source": "T04n0212_011:0669c06_12"
    },
    {
        "source_sentence": "佛告目連：「知卿雖有此智德神足無量，安隱舍夷國人耳，何能安處宿對人耶？」",
        "translation": "The Buddha told Maudgalyāyana, Do you know that even though you have these boundless spiritual abilities of wisdom and virtue, how can you sleep peacefully among the people of Sāvatthī?",
        "source": "T04n0212_011:0669c07_13"
    },
    {
        "source_sentence": "於是目連禮已便退。",
        "translation": "After paying homage, Maudgalyāyana withdrew.",
        "source": "T04n0212_011:0669c08_14"
    },
    {
        "source_sentence": "爾時世尊與諸大眾，敷演其義，欲使正法久存於世，示現宿對永不可避。",
        "translation": "At the time, the Bhagavān and the  masses explained their meaning, wanting to cause the right teaching to remain in the world for a long time, showing that past actions can never be avoided.",
        "source": "T04n0212_011:0669c09_15"
    },
    {
        "source_sentence": "「非空非海中，　　非入山石間，",
        "translation": "“It’s not empty, not in the ocean, not between mountains or stones.",
        "source": "T04n0212_011:0669c11_0"
    },
    {
        "source_sentence": "　莫能於是處，　　避免宿惡殃。」",
        "translation": "Don't be able to avoid the bad destinies of past lives in this place.",
        "source": "T04n0212_011:0669c11_0"
    },
    {
        "source_sentence": "　眾生有苦惱，　　不得免老死，",
        "translation": "Sentient beings suffer pain and distress, Unable to escape old age and death.",
        "source": "T04n0212_011:0669c11_0"
    },
    {
        "source_sentence": "　唯有仁智者，　　不念人非惡。",
        "translation": "Only the wise and benevolent One does not think of others as evil.",
        "source": "T04n0212_011:0669c11_0"
    },
    {
        "source_sentence": "大眾聞其所說悵然悲泣，愍流離王當報宿緣，在於大眾而說頌曰：眾生有苦惱者，",
        "translation": "The great assembly, hearing what he said, wept in disappointment and sorrow. Then the king Kauṇḍinya, wanting to report the events of his previous existence, spoke these verses to the assembly: Sentient beings suffer from distress.",
        "source": "T04n0212_011:0669c11_0"
    },
    {
        "source_sentence": "若見他人非法之事，覺寤比丘專念五法，然後興發人意。",
        "translation": "If he sees another person doing an unlawful thing, the monk who perceives it focuses his attention on five things, and then he gives rise to human intentions.",
        "source": "T04n0212_011:0669c17_1"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T04n0212_011:0669c18_2"
    },
    {
        "source_sentence": "一者謂為前人契經不流利，二者戒不成就，三者定意不具，四者愚無黠慧，",
        "translation": "One, it means that the former person doesn’t follow the sūtras; two, the precepts aren’t fulfilled; three, concentration isn’t complete; and four, folly has no wiseness.",
        "source": "T04n0212_011:0669c18_3"
    },
    {
        "source_sentence": "五者諸漏不盡。",
        "translation": "Five, the contaminants aren't ended.",
        "source": "T04n0212_011:0669c20_4"
    },
    {
        "source_sentence": "是故說曰，眾生有苦惱，不得免老死也。",
        "translation": "That's why it's said that sentient beings have suffering and distress, and they can't escape old age and death.",
        "source": "T04n0212_011:0669c20_5"
    },
    {
        "source_sentence": "唯有人智者，欲止彼人當自謹慎，己自為穢復止他者，為人所譏嗤其所為。",
        "translation": "Only those who are wise among humans want to stop that person, but they should be careful about themselves. If they themselves become defiled and stop others, they'll be ridiculed by others for what they do.",
        "source": "T04n0212_011:0669c21_6"
    },
    {
        "source_sentence": "是故智者終已遠離，縛中牢者莫若緣對，縛處在泥犁，無有繫縛者，隨罪輕重各受其報。",
        "translation": "That's why the wise person has finally parted with it, and there's no reason for those who are bound in a prison to do so. The place where they're bound is in a mud plow, which has no fetters or bonds, and each receives its own retribution according to the severity of their sins.",
        "source": "T04n0212_011:0669c23_7"
    },
    {
        "source_sentence": "是故說曰：唯有仁智者，不念人非惡也。",
        "translation": "That's why it's said, Only someone with kindness and wisdom who doesn't think of people isn't bad.",
        "source": "T04n0212_011:0669c25_8"
    },
    {
        "source_sentence": "　妄證求賂，　　行己不正，　　怨譖良人，",
        "translation": "They falsely realize that they seek bribery, act incorrectly for themselves, and resent good people.",
        "source": "T04n0212_011:0669c27_0"
    },
    {
        "source_sentence": "　以枉治士，　　罪縛斯人，　　自投在坑。",
        "translation": "Because of their injusticeful treatment, these people are bound by their sins and throw themselves into a pit.",
        "source": "T04n0212_011:0669c28_0"
    },
    {
        "source_sentence": "妄證求賂者，或有眾生不自量己，內不思惟，恒求人短，見非則喜、見善不從，",
        "translation": "Those who falsely realize bribery may have sentient beings who don't judge themselves, don't think internally, always look for what's short, rejoice when they see what's not, and don't obey when they see what's good.",
        "source": "T04n0212_011:0669c29_0"
    },
    {
        "source_sentence": "所行眾事以邪為正，是故說曰，妄證求賂，行己不正也。",
        "translation": "Because the things they do are wrong and right, it's therefore said that they falsely realize bribery, and their actions are not right.",
        "source": "T04n0212_011:0670a01_1"
    },
    {
        "source_sentence": "怨譖良人者，或有良善之人，意在貪學，衣不蓋形食不充口，為愚者所輕，",
        "translation": "A grudge against a good person is when there's a good person who wants to be greedy with training, whose clothing doesn't cover form and food doesn't fill his mouth, and he's despised by the foolish.",
        "source": "T04n0212_011:0670a02_2"
    },
    {
        "source_sentence": "障塞其德不使顯現，緣是致咎，復當經歷百三十六地獄，從一地獄至一地獄，",
        "translation": "If someone obstructs their virtue and doesn't allow it to be revealed, this is the reason they're blamed, and they'll go through one hundred and thirty-six hells again, going from one hell to another.",
        "source": "T04n0212_011:0670a04_3"
    },
    {
        "source_sentence": "其中受苦不可稱計。",
        "translation": "The suffering that's experienced there can't be measured.",
        "source": "T04n0212_011:0670a06_4"
    },
    {
        "source_sentence": "以融銅為食，以釜湯為室，以膿血為盛饌，以髓腦為脂澤。",
        "translation": "It's made of molten copper as food, cauldron water as room, pus and blood as a generous delicacy, and marrow and brain as fat.",
        "source": "T04n0212_011:0670a06_5"
    },
    {
        "source_sentence": "畢彼罪已來入畜生，受形若干志趣不同，或高或下，食以芻草擔負重載，",
        "translation": "After their sins have been expiated, they'll enter the animal kingdom and receive different forms with different intentions, either high or low, eating to carry a load of sheep and grass.",
        "source": "T04n0212_011:0670a08_6"
    },
    {
        "source_sentence": "皆由先世抵突所致。",
        "translation": "It's all the result of a prior lifetime's resistance.",
        "source": "T04n0212_011:0670a09_7"
    },
    {
        "source_sentence": "若生餓鬼，以空氣充腹以鍼刺腹，內氣泄出尋還滿腹，猶如羅縠觀空表裏悉現。",
        "translation": "If a hungry ghost is born, he fills his belly with air and pierces it with a needle, and his internal breath flows out and returns back to fill his belly, just as Rāhu observes emptiness and all appear in the surface.",
        "source": "T04n0212_011:0670a10_8"
    },
    {
        "source_sentence": "是故說，怨譖良人，以枉治士也。",
        "translation": "That's why it's said that resentment and anger are harmful to good people because they treat people with injustice.",
        "source": "T04n0212_011:0670a12_9"
    },
    {
        "source_sentence": "罪縛斯人者，行對追身如影隨形，奔趣五道涉苦無量，所至到處不離四縛五結，",
        "translation": "Those who are bound by sin pursue their bodies like shadows and forms, running toward the five destinies with untold amounts of suffering, reaching everywhere without leaving the four fetters or five fetters.",
        "source": "T04n0212_011:0670a12_10"
    },
    {
        "source_sentence": "設處為人恒在牢獄繫閉，身被考掠求死不得，是故說曰：罪縛斯人，自投于坑也。",
        "translation": "Suppose a person is constantly locked up in prison, and their bodies are plundered and unable to die; therefore, it's said that this person is bound by sin and throws himself into a pit.",
        "source": "T04n0212_011:0670a14_11"
    },
    {
        "source_sentence": "　夫士為行，　　好之與惡，　　各自為身，",
        "translation": "Good and evil deeds are the bodies of men, Good and evil deeds are the bodies of women.",
        "source": "T04n0212_011:0670a17_0"
    },
    {
        "source_sentence": "　終不敗亡。",
        "translation": "They'll never perish.",
        "source": "T04n0212_011:0670a18_0"
    },
    {
        "source_sentence": "夫士為行者，一切有形眾生之類，心念口言身口意行，是故說，夫士為行也。",
        "translation": "A practitioner is the practice of all forms of sentient beings who are mindful, verbal, bodily, verbal, and mental actions; therefore, it's said that a practitioner is the practice.",
        "source": "T04n0212_011:0670a19_0"
    },
    {
        "source_sentence": "好之與惡者，或善不善，若好若醜，若苦若樂，或苦痛樂痛，斯名善惡皆由行興，",
        "translation": "Good and bad are either good or bad, whether good or bad, good or bad, good or bad, painful or painful, painful or painful, which is called good and bad all because of the arising of actions.",
        "source": "T04n0212_011:0670a20_1"
    },
    {
        "source_sentence": "是故說，好之與惡也。",
        "translation": "That's why it's said that good and evil are the same.",
        "source": "T04n0212_011:0670a22_2"
    },
    {
        "source_sentence": "各自為身者，人為善惡，若苦若樂若好若醜，盡當受報無免之者，善生天上惡入地獄，",
        "translation": "Each one is for his own sake, while the other is for good or evil. Whatever is painful, pleasant, good or ugly, they will all experience retribution and no one will be spared. Those who are born in heaven with good [rebirths] and enter hell with evil (i.e., a bad realm of rebirth).",
        "source": "T04n0212_011:0670a23_0"
    },
    {
        "source_sentence": "是故說，各自為身。",
        "translation": "Therefore, it's said that each is their own body.",
        "source": "T04n0212_011:0670a24_1"
    },
    {
        "source_sentence": "終不敗亡也，夫善惡之行猶形影相追，受對由行終不毀敗，正使天焦地融須彌崩頹海水枯涸、日月墮地星宿凋落，",
        "translation": "Good and bad deeds are like the mutual pursuit of form and shadow, but when they are opposed to each other, good and bad deeds will never be destroyed. It is precisely because the sky is scorched by fire, the earth melts, Mount Sumeru crumbles, the water in the ocean dries up, the sun and moon fall into the ground, and the stars",
        "source": "T04n0212_011:0670a25_2"
    },
    {
        "source_sentence": "善惡之報終不毀敗。",
        "translation": "The rewards of good and evil are never destroyed.",
        "source": "T04n0212_011:0670a28_0"
    },
    {
        "source_sentence": "「動轉屈申，　　影常親附，　　或起或住，",
        "translation": "Vimalakīrti: It moves and bends, Always accompanied by its reflection. Sometimes it arises, sometimes it remains.",
        "source": "T04n0212_011:0670a28_1"
    },
    {
        "source_sentence": "　不離其形。　　不但影隨，　　形亦隨影，",
        "translation": "They don’t part from form, but follow it; Form follows also form.",
        "source": "T04n0212_011:0670a28_1"
    },
    {
        "source_sentence": "　猶行善惡，　　終不相離。　　是故說終，",
        "translation": "Good or bad action is never separated from each other.",
        "source": "T04n0212_011:0670a28_1"
    },
    {
        "source_sentence": "於是頌曰：　不敗亡也。」",
        "translation": "He then said in verse, They won't be defeated.",
        "source": "T04n0212_011:0670a28_1"
    },
    {
        "source_sentence": "　好取之士，　　自以為可，　　沒取彼者，",
        "translation": "A person who likes to take it thinks it's good for himself, but he doesn't take it.",
        "source": "T04n0212_011:0670b04_0"
    },
    {
        "source_sentence": "　人亦滅亡。",
        "translation": "People will also cease and perish.",
        "source": "T04n0212_011:0670b05_0"
    },
    {
        "source_sentence": "好取之士者，夫人自善其身，不當念彼長短，亦莫譏別，擇地取要。",
        "translation": "A person who likes to take it will be self-improved by the wife, who won't think of their length or shortness, and doesn't criticize them for choosing a place to take the essentials.",
        "source": "T04n0212_011:0670b06_0"
    },
    {
        "source_sentence": "若詭欺於人虛妄不實，於百千生沒彼生此恒為人欺，展轉受報不離縛著，",
        "translation": "If someone deceives others and is false and unreal, they'll always be deceived by people in hundreds of thousands of births or births here and there, and they'll continue to receive their retribution without parting from their attachment.",
        "source": "T04n0212_011:0670b07_1"
    },
    {
        "source_sentence": "隨本作行今受其報。",
        "translation": "He follows the actions he did in the past and now receives their reward.",
        "source": "T04n0212_011:0670b09_2"
    },
    {
        "source_sentence": "如種果樹，苦得苦果甜得甜果。",
        "translation": "It's like planting fruit trees, which give painful fruits that are painful and sweet fruits that are sweet.",
        "source": "T04n0212_011:0670b09_3"
    },
    {
        "source_sentence": "善惡之報亦復如是，善受天福惡報地獄。",
        "translation": "Good and bad retribution are likewise, which is a good reward for heavenly merit and a bad retribution in hell.",
        "source": "T04n0212_011:0670b10_4"
    },
    {
        "source_sentence": "是故說曰，好取之士，自以為可，沒彼取者，人亦沒亡也。",
        "translation": "That's why it's said, A person who prefers to grasp and thinks it's good for themselves, but someone who doesn't grasp it will also perish.",
        "source": "T04n0212_011:0670b11_5"
    },
    {
        "source_sentence": "　作惡不起，　　如兵所截，　　牽往不覺，",
        "translation": "Doing evil doesn’t arise, just like being cut off by an enemy and leading away without realizing it.",
        "source": "T04n0212_011:0670b13_0"
    },
    {
        "source_sentence": "　己墮惡道，　　後受苦報，　　乃知前習。",
        "translation": "If you yourself fall into a bad path and later experience painful retribution, then you'll know the prior condition.",
        "source": "T04n0212_011:0670b14_0"
    },
    {
        "source_sentence": "作惡不起者，愚人思慮不與善俱，晝夜興想殺盜婬妷犯十惡行，是故說，",
        "translation": "Doing evil and not getting up is when a foolish person deliberates and doesn't associate with what's good, and day and night he gives rise to thoughts of killing, stealing, and sexual misconduct that violate the ten bad actions.",
        "source": "T04n0212_011:0670b15_0"
    },
    {
        "source_sentence": "作惡不起也。",
        "translation": "They don't do evil and don't arise.",
        "source": "T04n0212_011:0670b16_1"
    },
    {
        "source_sentence": "如兵所截，終不還變有迴顧心。",
        "translation": "It's like when an army is cut off, they never return and have a mind of retrospection.",
        "source": "T04n0212_011:0670b17_0"
    },
    {
        "source_sentence": "何以故爾？",
        "translation": "Why is it so?",
        "source": "T04n0212_011:0670b17_1"
    },
    {
        "source_sentence": "愚人自作是念：「檀越施主素自貧匱，慳嫉之人反更富貴。」",
        "translation": "The foolish man thought to himself, Donors and donors are always poor, and stingy and jealous people become richer instead.",
        "source": "T04n0212_011:0670b17_2"
    },
    {
        "source_sentence": "是以愚者見此譏變，執意遂堅心不開悟。",
        "translation": "That's why the foolish man saw this criticism and became so attached to it that he didn't awaken his mind.",
        "source": "T04n0212_011:0670b19_3"
    },
    {
        "source_sentence": "是故說曰，作惡不起，如兵所截也。",
        "translation": "That's why it's said that doing evil doesn't arise, like being cut off by an army.",
        "source": "T04n0212_011:0670b20_4"
    },
    {
        "source_sentence": "牽往不覺，己墮惡道者，不知現世後世所作善惡諸不善行，不慮後當無有覆護，",
        "translation": "Those who are led there without realizing it and fall into bad destinies themselves don’t know the good and bad deeds they have done in present and future lives, and they don’t think later that they won’t be disciplined.",
        "source": "T04n0212_011:0670b20_5"
    },
    {
        "source_sentence": "是故說曰，牽往不覺，己墮惡道也。",
        "translation": "That's why it's said that someone who leads away and doesn't realize it will fall into a bad path for themselves.",
        "source": "T04n0212_011:0670b22_6"
    },
    {
        "source_sentence": "後受苦報，乃知前習者，昔有居士戒勅家人以雉為食，先持雉肉著釜中，",
        "translation": "Formerly a householder had formerly instructed his family members to feed on pheasants. First, he put the flesh of the pheasant in the cauldron.",
        "source": "T04n0212_011:0670b23_7"
    },
    {
        "source_sentence": "然後方覓火煮之，不覺蛇墮釜中。",
        "translation": "Only then did he search for the fire to cook it, and didn't realize that the snake had fallen into the cauldron.",
        "source": "T04n0212_011:0670b25_8"
    },
    {
        "source_sentence": "居士食法，要當問師，師曰：「此不可食。」",
        "translation": "The householder had to ask the teacher about the method of eating, and he said, You can't eat this.",
        "source": "T04n0212_011:0670b26_0"
    },
    {
        "source_sentence": "不從師教遂便食之。",
        "translation": "They didn't follow the teacher's instructions, so they ate it.",
        "source": "T04n0212_011:0670b26_1"
    },
    {
        "source_sentence": "經宿蛇毒內發，方更問師，師曰：「不從我命，知當如何？」",
        "translation": "After the night passed, the poison of the snake arose internally, and he asked his teacher again, What do you know if you don't obey my order?",
        "source": "T04n0212_011:0670b27_2"
    },
    {
        "source_sentence": "「貪味遂食毒，　　不從吾往言，",
        "translation": "Desire and taste are the result of eating poison, so they won't follow my words.",
        "source": "T04n0212_011:0670b28_3"
    },
    {
        "source_sentence": "　為毒之所困，　　後乃自覺悟。」",
        "translation": "They'll be trapped by the poison, and then they'll realize it for themselves.",
        "source": "T04n0212_011:0670b28_3"
    },
    {
        "source_sentence": "爾時醫師向彼而說頌曰：爾時世尊告眾會人：「當為是離是，夫人為惡死入地獄，",
        "translation": "The physician then addressed them in verse: At that moment, the World-Honored One said to the assembly of bhikṣus:",
        "source": "T04n0212_011:0670b28_3"
    },
    {
        "source_sentence": "修行善者受彼天福。",
        "translation": "Those who cultivate goodness will receive the merits of those gods.",
        "source": "T04n0212_011:0670c04_4"
    },
    {
        "source_sentence": "然此眾生者有來久，不計無常遷變之事，不受如來真實至教，謂惡為善、以是為非。」",
        "translation": "Still, these sentient beings have come here for a long time, don't contemplate impermanent and transformative things, and don't accept the Tathāgata's true ultimate teaching that evil is good and this is what's wrong.",
        "source": "T04n0212_011:0670c04_5"
    },
    {
        "source_sentence": "「愚心不開悟，　　習惡不從吾，",
        "translation": "A foolish man’s mind isn’t enlightened, and he doesn’t follow me in the cultivation of evil.",
        "source": "T04n0212_011:0670c06_6"
    },
    {
        "source_sentence": "　受苦地獄痛，　　後乃憶真教。」",
        "translation": "They'll experience the pain of suffering in hell, and then they'll remember the true teaching.",
        "source": "T04n0212_011:0670c06_6"
    },
    {
        "source_sentence": "爾時世尊便說此偈：後受苦報，乃知前習者，地獄燒炙痛，餓鬼飢饉苦，",
        "translation": "At that time the World-Honored One uttered these verses: Knowing the subsequent retribution of suffering, one knows the former condition. Hell is tormented by burning and being burned; hungry ghosts suffer from hunger and thirst.",
        "source": "T04n0212_011:0670c06_6"
    },
    {
        "source_sentence": "畜生常重苦，是故說曰，後受苦報，乃知前習也。",
        "translation": "Because animals always suffer greatly from suffering, it's said that the subsequent painful retribution is known as the prior accumulation.",
        "source": "T04n0212_011:0670c11_7"
    },
    {
        "source_sentence": "　兇人行虐，　　沈漸數數，　　快欲為之，",
        "translation": "A fierce man commits violence, sinks gradually and repeatedly, and desires to do it.",
        "source": "T04n0212_011:0670c13_0"
    },
    {
        "source_sentence": "　罪報自然。",
        "translation": "The retribution for sins is natural.",
        "source": "T04n0212_011:0670c14_0"
    },
    {
        "source_sentence": "昔佛在舍衛國祇樹給孤獨園。",
        "translation": "In the past, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0212_011:0670c15_0"
    },
    {
        "source_sentence": "爾時拘薩羅國波斯匿王，在閑堂空室自生想念：「何等眾生不自念己？」",
        "translation": "It was then that King Prasenajit of Kośala thought to himself in a secluded hall or empty room, What sentient beings don't think of themselves?",
        "source": "T04n0212_011:0670c15_1"
    },
    {
        "source_sentence": "時王復重思惟：「諸有身口意念惡顛倒者，是謂斯人不自念己。",
        "translation": "The king then again thought, Suppose there's a person with bad thoughts of body, speech, and mind who doesn't think of themselves.",
        "source": "T04n0212_011:0670c17_2"
    },
    {
        "source_sentence": "云何眾生而自念己？",
        "translation": "How are sentient beings mindful of themselves?",
        "source": "T04n0212_011:0670c18_3"
    },
    {
        "source_sentence": "若有眾生身口意行清淨，是謂斯人為自念己。」",
        "translation": "If there are sentient beings whose bodily, verbal, and mental actions are pure, this is called a person who thinks of himself.",
        "source": "T04n0212_011:0670c19_4"
    },
    {
        "source_sentence": "爾時王波斯匿即從閑堂靜室起，即嚴駕羽寶車將諸營從至世尊所，到已頭面禮足在一面坐，",
        "translation": "It was then that King Prasenajit rose from his secluded chamber in a quiet hall, prepared his carriage of the finest jeweled feathers, and, accompanied by all the attendants, approached the World-honored One. Having arrived there, he bowed his forehead at [the Buddha’s] feet and took his seat to one side.",
        "source": "T04n0212_011:0670c20_5"
    },
    {
        "source_sentence": "須臾退坐前白佛言：「向在閑堂靜室自生心念：『何等眾生自念己？",
        "translation": "In a moment, he withdrew to his seat and said to the Buddha, Going into a quiet room in a quiet hall, he thought to himself, 'Who are these sentient beings who think of themselves?'",
        "source": "T04n0212_011:0670c22_6"
    },
    {
        "source_sentence": "何等眾生不自念己？』",
        "translation": "What sentient beings don't think of themselves?'",
        "source": "T04n0212_011:0670c23_7"
    },
    {
        "source_sentence": "時我，世尊！",
        "translation": "At the time, I, Bhagavān!",
        "source": "T04n0212_011:0670c24_8"
    },
    {
        "source_sentence": "復重思念：『諸有身口意念惡顛倒者，是謂斯人不自念己。",
        "translation": "Again, he thinks, 'Those who have bad thoughts of body, speech, and mind are mistaken; this is called a person who doesn't think for themselves.",
        "source": "T04n0212_011:0670c24_9"
    },
    {
        "source_sentence": "云何眾生而自念己？",
        "translation": "How are sentient beings mindful of themselves?",
        "source": "T04n0212_011:0670c25_10"
    },
    {
        "source_sentence": "若有眾生身口意行清淨，是謂斯人為自念己。』」",
        "translation": "If there are sentient beings whose bodily, verbal, and mental actions are pure, this is called a person who thinks for themselves.'",
        "source": "T04n0212_011:0670c26_11"
    },
    {
        "source_sentence": "爾時世尊告波斯匿曰：「如是！",
        "translation": "It was then that the Bhagavān addressed Prasenajit, So it is!",
        "source": "T04n0212_011:0670c27_12"
    },
    {
        "source_sentence": "如王所言。",
        "translation": "As the king said.",
        "source": "T04n0212_011:0670c28_13"
    },
    {
        "source_sentence": "諸有身口意行不清淨者，其人則不自念己。",
        "translation": "If someone's bodily, verbal, and mental actions are impure, that person doesn't think of themselves.",
        "source": "T04n0212_011:0670c28_14"
    },
    {
        "source_sentence": "若有身口意清淨者，則為自念己。",
        "translation": "If someone's body, speech, and mind are pure, then they're mindful of themselves.",
        "source": "T04n0212_011:0670c29_15"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T04n0212_011:0671a01_0"
    },
    {
        "source_sentence": "大王當知，諸有不自念己，為自減損、興不善法。",
        "translation": "Great king, you should know that there are people who don't think of themselves for their own sake and develop unwholesome qualities in order to subtract themselves and harm themselves.",
        "source": "T04n0212_011:0671a01_1"
    },
    {
        "source_sentence": "諸有身口意行清淨者，則自為己。",
        "translation": "If there are people whose bodily, verbal, and mental actions are pure, then they're themselves.",
        "source": "T04n0212_011:0671a02_2"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T04n0212_011:0671a03_3"
    },
    {
        "source_sentence": "以其人修清淨行故。」",
        "translation": "It's because that person cultivates pure practice.",
        "source": "T04n0212_011:0671a03_4"
    },
    {
        "source_sentence": "「夫人習惡者，　　不慮後世緣，",
        "translation": "A woman who practices evil doesn't think about the conditions of later lives,",
        "source": "T04n0212_011:0671a03_5"
    },
    {
        "source_sentence": "　為惡自受殃，　　殃身永不滅。」",
        "translation": "Because of their evil, they themselves experience misfortune, and the body of misfortune never ceases.",
        "source": "T04n0212_011:0671a03_5"
    },
    {
        "source_sentence": "爾時尊者馬聲便說斯偈：是故說曰，兇人行虐，沈漸數數，快欲為之，",
        "translation": "It was then that Venerable Ma Shen uttered these verses:",
        "source": "T04n0212_011:0671a03_5"
    },
    {
        "source_sentence": "罪報自然者，所生之處受其惡報，生地獄中榜笞無量，餓鬼中愚惑為苦，",
        "translation": "The natural retribution of sin is that the place where they are born receives their bad retribution, being born in hell with countless floggings and tortures, and suffering from ignorance and delusion among hungry ghosts.",
        "source": "T04n0212_011:0671a07_6"
    },
    {
        "source_sentence": "生畜生中償罪為苦，若生人中行缺為苦。",
        "translation": "Being born among animals to repay sins is painful, and being born among humans with a lack of actions is painful.",
        "source": "T04n0212_011:0671a09_7"
    },
    {
        "source_sentence": "是故說曰，快欲為之，罪報自然也。",
        "translation": "That's why it's said, 'I want to do it with pleasure, and the result of sin is natural.'",
        "source": "T04n0212_011:0671a10_8"
    },
    {
        "source_sentence": "　凡人為惡，　　不能自覺，　　愚癡快意，",
        "translation": "Ordinary people are evil and can't realize it for themselves. Foolish and joyous,",
        "source": "T04n0212_011:0671a12_0"
    },
    {
        "source_sentence": "　後受欝毒。",
        "translation": "Later, he'll be subject to the poison of anger.",
        "source": "T04n0212_011:0671a13_0"
    },
    {
        "source_sentence": "凡人為惡，不能自覺者，凡夫愚人恒懷愚惑，恣情為惡不能改更，亦不知後受其報，",
        "translation": "Ordinary people are evil and can't realize it for themselves. Ordinary foolish people always harbor deluded mental disturbances, and because they indulge in bad feelings, they can't change them, or they don't know the subsequent rewards of their actions.",
        "source": "T04n0212_011:0671a14_0"
    },
    {
        "source_sentence": "猶如有人行過山嶮，兩邊嶮峻閉眼而過，不知身危或致命終。",
        "translation": "It's like a person who walks past a precipitous mountain that's steep on both sides and passes through with their eyes closed, not knowing that his body is in danger or that he might die.",
        "source": "T04n0212_011:0671a15_1"
    },
    {
        "source_sentence": "此凡夫人亦復如是，生盲無智，亦不知後當受報，是故說曰，凡人為惡，",
        "translation": "This ordinary woman is also like this: born blind and ignorant, she does not know the consequences of future rebirth. For this reason it is said that ordinary people are evil.",
        "source": "T04n0212_011:0671a17_2"
    },
    {
        "source_sentence": "不能自覺也。",
        "translation": "They can't realize it for themselves.",
        "source": "T04n0212_011:0671a18_3"
    },
    {
        "source_sentence": "愚癡快意，後受欝毒者，有智之士明眼視瞻，猶如一趣之道有大火坑，",
        "translation": "Foolish and happy-minded, they'll later experience the poison of sexual misconduct. A wise man with clear eyesight looks at them like there's a great fire pit on the path to one destination.",
        "source": "T04n0212_011:0671a19_4"
    },
    {
        "source_sentence": "行人經過先不諳道，明者指授語行人曰：「中道有大火坑不得經過，卿等可於此息意，",
        "translation": "The wise one instructed the practitioner, saying to the practitioners, “There is a large fire pit in the middle of the road that cannot be passed by you. All of you may calm your thoughts here.",
        "source": "T04n0212_011:0671a20_5"
    },
    {
        "source_sentence": "勿復前行。」",
        "translation": "Don't go any further.",
        "source": "T04n0212_011:0671a22_6"
    },
    {
        "source_sentence": "諸人意勇不信其語，各共進前皆墮火坑，受痛甚苦號天喚呼悔亦無及，",
        "translation": "The men of the assembly did not believe what they said, but each went ahead and fell into a pit of fire. They all cried out in distress, uncontrollably.",
        "source": "T04n0212_011:0671a22_7"
    },
    {
        "source_sentence": "自相謂言：「智人所勅不從其教，今受苦痛知當訴誰？」",
        "translation": "They said to each other, The wise man didn't follow his instructions, but now that he's suffering pain and knows who to accuse?",
        "source": "T04n0212_011:0671a24_8"
    },
    {
        "source_sentence": "此眾生顛倒亦復如是，一向趣人道為智人所訶止：「道多艱難有欝毒痛，",
        "translation": "So it is with these sentient beings who are mistaken, always heading for the path of humans and being reprimanded by wise people: “The path is full of difficulties and has crude, painful, poisonous, and venomous pain.",
        "source": "T04n0212_011:0671a25_9"
    },
    {
        "source_sentence": "卿等設欲前進，必遇此患不免其難。」",
        "translation": "If you want to advance, you'll surely encounter this difficulty and won't be able to escape it.",
        "source": "T04n0212_011:0671a27_10"
    },
    {
        "source_sentence": "是故說曰，愚癡快意，後受欝毒也。",
        "translation": "That's why it's said, Foolish and happy-minded, they'll later experience the poison of sexual misconduct.",
        "source": "T04n0212_011:0671a28_11"
    },
    {
        "source_sentence": "　夫人行惡，　　還自熾然，　　啼泣流面，",
        "translation": "A woman commits evil, returns to blazing fire, weeps and flows her face.",
        "source": "T04n0212_011:0671a29_0"
    },
    {
        "source_sentence": "　後受其報。",
        "translation": "Later, he'll receive its reward.",
        "source": "T04n0212_011:0671b01_0"
    },
    {
        "source_sentence": "夫人行惡者，純惡不善不念不喜，是故說夫人行惡也。",
        "translation": "A wife who does evil is purely bad and unwholesome, not mindful or joyous; therefore, she's said to do evil.",
        "source": "T04n0212_011:0671b02_0"
    },
    {
        "source_sentence": "還自熾然者，若人懷變悔心，知有愁憂之惱，晝夜憂思以致煩熱，是故說曰，",
        "translation": "“Furthermore, it is self-extinguished”: When a person has changed his or her mind with regret and knows that there is sorrow. Day and night he or she feels remorse day and night, which causes unrest and feverishness. That is why it is said:",
        "source": "T04n0212_011:0671b03_1"
    },
    {
        "source_sentence": "夫人行惡，還自熾然也。",
        "translation": "The queen committed evil deeds and burned herself out in flames.",
        "source": "T04n0212_011:0671b05_0"
    },
    {
        "source_sentence": "啼泣流面者，晝夜悲泣，蓬頭亂髮舉聲悲泣，是故說，啼泣流面也。",
        "translation": "The face that weeps and flows is a day and night of sorrowful weeping, with the hair on its head in distress and raising sounds of sorrow.",
        "source": "T04n0212_011:0671b05_1"
    },
    {
        "source_sentence": "後受其報者，酸苦無量不可愛樂，兼有愁憂苦惱艱難無數憂慮百千，是故說，",
        "translation": "Those who subsequently experience its retribution are suffering immeasurable and unpleasant, accompanied by sorrow, pain, vexation, and incalculable grief. That is why it is said:",
        "source": "T04n0212_011:0671b07_0"
    },
    {
        "source_sentence": "後受其報也。",
        "translation": "He'll later receive its reward.",
        "source": "T04n0212_011:0671b08_1"
    },
    {
        "source_sentence": "　吉人行德，　　相隨積增，　　甘心為之，",
        "translation": "An auspicious person's virtue in conduct increases according to their characteristics, and his willingness is the reason for it.",
        "source": "T04n0212_011:0671b09_0"
    },
    {
        "source_sentence": "　福應自然。",
        "translation": "Merit should naturally arise.",
        "source": "T04n0212_011:0671b10_0"
    },
    {
        "source_sentence": "吉人行德者，猶如有人行應得至，為天人所恭敬，歎譽其德，稱揚善名，",
        "translation": "An auspicious person who practices virtue is like a person whose practice should lead to attainment, respected by gods and goddesses, praised for their virtue, and praised for their good reputation.",
        "source": "T04n0212_011:0671b11_0"
    },
    {
        "source_sentence": "四遠皆聞，無數諸人皆來供養，是故說，吉人行德也。",
        "translation": "The fourth is heard from afar, and countless people come to make offerings; therefore, it's said to be the virtue of an auspicious person's conduct.",
        "source": "T04n0212_011:0671b12_1"
    },
    {
        "source_sentence": "相隨積增者，晝夜喜慶無有憂愁，心意歡悅無有煩熱，是故說，相隨積增也。",
        "translation": "“Concomitant with the characteristic marks, there is increase”: Joyful day and night without sorrow. Their minds are joyous and without vexation. That is why they are said to be accompanied by the characteristic marks.",
        "source": "T04n0212_011:0671b13_2"
    },
    {
        "source_sentence": "甘心為之，福應自然者，若生天身福應自然，宮室百億五色玄黃快樂無極，",
        "translation": "If one were to be born in heaven, the body of blessedness would naturally arise spontaneously. The palace with its billions of myriads of koṭis of five colors, dark and yellow, is infinitely happy.",
        "source": "T04n0212_011:0671b15_3"
    },
    {
        "source_sentence": "若生人間，五樂自娛作倡伎樂以自歡悅，心意怡然不興亂想，是故說，",
        "translation": "When one is born among humans, he enjoys the five kinds of pleasure for himself, making music and dances to delight in himself. The mind is joyful and without disturbing thoughts. That is why it is said:",
        "source": "T04n0212_011:0671b17_4"
    },
    {
        "source_sentence": "甘心為之，福應自然。",
        "translation": "Being willing to do so, merit should come naturally.",
        "source": "T04n0212_011:0671b18_5"
    },
    {
        "source_sentence": "　戲笑為惡，　　已作身行，　　號泣受報，",
        "translation": "Laughing and laughing is evil, having done bodily actions, wailing and weeping to receive their retribution.",
        "source": "T04n0212_011:0671b20_0"
    },
    {
        "source_sentence": "　隨行罪至。",
        "translation": "They follow the sins of their actions until they reach them.",
        "source": "T04n0212_011:0671b21_0"
    },
    {
        "source_sentence": "戲笑為惡者，善惡之行皆有輕重，身口意造非獨一類，或依己身戲笑為惡，",
        "translation": "Someone who ridicules as evil means that good and bad deeds are both light and heavy. Bodily, verbal, and mental actions are not exclusively one type; or they may rely on their own body to ridicule as evil.",
        "source": "T04n0212_011:0671b22_0"
    },
    {
        "source_sentence": "觸嬈眾生不安其所，或以瓦石刀器共相傷害，或合會彼此由致鬪訟，猶如世人好喜鬪羊鬪雞、鬪駝鬪牛鬪人鬪象。",
        "translation": "They touch and disturb sentient beings who aren't comfortable with their place, or they may harm each other with tiles, stones, knives, and vessels, or they may gather together to cause disputes among themselves, just as the people of the world like to delight in fighting sheep, chickens, camels, cattle, cattle, men, and elephants.",
        "source": "T04n0212_011:0671b23_1"
    },
    {
        "source_sentence": "或以罵詈來往，見以歡喜不能自勝，若其壽終啼哭受苦。",
        "translation": "Or they may come and go because of verbal abuse, rejoicing when they see it and can't overcome themselves with joy, or weep and suffer suffering at the end of their life.",
        "source": "T04n0212_011:0671b26_2"
    },
    {
        "source_sentence": "是故說，戲笑為惡，已作身行，號泣受報，隨行罪至也。",
        "translation": "That's why it's said that playfulness and laughter are bad, physical actions that have already been done, wailing and weeping as retribution, and crimes that follow their actions.",
        "source": "T04n0212_011:0671b27_3"
    },
    {
        "source_sentence": "　惡不即時，　　如[(殼-一)\\/牛]牛乳，　　罪在陰伺，",
        "translation": "Bad dharmas are not immediately present, like cow's milk. The blame lies in the aggregates and waits.",
        "source": "T04n0212_011:0671b29_0"
    },
    {
        "source_sentence": "　如灰覆火。",
        "translation": "It's like covering a fire with ashes.",
        "source": "T04n0212_011:0671c01_0"
    },
    {
        "source_sentence": "惡不即時者，夫人造行報不即應。",
        "translation": "When badness isn't immediate, the wife doesn't immediately respond to the results of actions she creates.",
        "source": "T04n0212_011:0671c02_0"
    },
    {
        "source_sentence": "昔有異國生即應草，若以彼草著乳中者，即成為酪不移時節，是故說曰，",
        "translation": "In the past, there was a different kind of grass that grows in different countries. If you put this grass into milk, it will instantly turn into curds at the right time and season.",
        "source": "T04n0212_011:0671c02_1"
    },
    {
        "source_sentence": "惡不即時，如[(殼-一)\\/牛]牛乳也。",
        "translation": "Badness doesn't immediately arise, like [(housing - one)\\/cow] cow milk.",
        "source": "T04n0212_011:0671c04_2"
    },
    {
        "source_sentence": "若不爾者，其義云何？",
        "translation": "If that's not the case, what does it mean?",
        "source": "T04n0212_011:0671c04_3"
    },
    {
        "source_sentence": "答曰：「愚者被燒，然後乃悟。」",
        "translation": "He answered, A foolish man is burned and then awakened.",
        "source": "T04n0212_011:0671c05_4"
    },
    {
        "source_sentence": "罪在陰伺，如灰覆火者，猶若以灰覆火，人不覺，足往蹈之，漸漸熱徹乃知燒足。",
        "translation": "Sin lies in the aggregates, like ashes covering a fire. It is just as if you cover a fire with ashes and do not feel it by touching it with one’s feet.",
        "source": "T04n0212_011:0671c06_0"
    },
    {
        "source_sentence": "此眾生類亦復如是，當行惡時甘心悅豫，若壽終後身墮惡道五毒加治，",
        "translation": "These sentient beings are likewise. When they commit evil, their minds are sweet and joyful. If after the life span ends, they fall into a bad realm of rebirth with five poisons to oppress them.",
        "source": "T04n0212_011:0671c07_1"
    },
    {
        "source_sentence": "乃自覺悟方知罪至。",
        "translation": "He then realized for himself that only then did he realize the arrival of sin.",
        "source": "T04n0212_011:0671c09_2"
    },
    {
        "source_sentence": "是故說，罪在陰伺，如灰覆火也。",
        "translation": "Therefore, it's said that sin lies in the aggregates and discursively, like ashes covering a fire.",
        "source": "T04n0212_011:0671c09_3"
    },
    {
        "source_sentence": "　惡不即時，　　如彼利劍，　　不慮後世，",
        "translation": "Badness doesn't immediately follow, like that sharp sword, which doesn't think about the afterlife.",
        "source": "T04n0212_011:0671c11_0"
    },
    {
        "source_sentence": "　當受其報。",
        "translation": "They'll receive their reward.",
        "source": "T04n0212_011:0671c12_0"
    },
    {
        "source_sentence": "惡不即時者，或有眾生習其惡本，壽經百年自恃年壽謂為無罪，自相謂言：「人之為惡皆謂有罪，",
        "translation": "When evil is not immediate, sometimes there are sentient beings who cultivate the root of evil and whose life span is one hundred years in length. If they rely on their own life span, they think it is blameless. They say among themselves, “Evil is considered blameworthy by everyone.",
        "source": "T04n0212_011:0671c13_0"
    },
    {
        "source_sentence": "我躬行之方便延壽。」",
        "translation": "I myself practiced it to prolong my life.",
        "source": "T04n0212_011:0671c15_1"
    },
    {
        "source_sentence": "諸有屠兒獵師自興誹謗，謂沙門瞿曇行不真實，好行妄語虛辭萬端，教勅弟子言：「諸有殺生傷害人物者，",
        "translation": "Some butchers and hunters criticize themselves, saying that the ascetic Gautama’s conduct is unreal. They are fond of lying in all kinds of flattering terms. He commands his disciples to say:",
        "source": "T04n0212_011:0671c15_2"
    },
    {
        "source_sentence": "身壞命終，當入地獄畜生餓鬼受苦無量。」",
        "translation": "When his body breaks up and his life ends, he'll go to hell, animals, hungry ghosts, and suffering immeasurable pain.",
        "source": "T04n0212_011:0671c18_3"
    },
    {
        "source_sentence": "「惡為惡所纏，　　為惡不自覺，",
        "translation": "“Evil is tethered by evil, and because of evil I do not realize it for myself.",
        "source": "T04n0212_011:0671c19_4"
    },
    {
        "source_sentence": "　至惡知惡至，　　受惡惡根原。」",
        "translation": "Up to the point of knowing evil and reaching evil, he'll experience the root of bad and bad roots.",
        "source": "T04n0212_011:0671c19_4"
    },
    {
        "source_sentence": "是故世尊躬說偈曰：時彼屠兒聞佛所說猶不改更，是故說曰：「惡不即，",
        "translation": "That is why the World-Honored One himself said in verse: When that butcher had heard what the Buddha taught, he did not change his ways. For this reason he said:",
        "source": "T04n0212_011:0671c19_4"
    },
    {
        "source_sentence": "時如[(殼-一)\\/牛]牛乳，不慮後世，當受其報。」",
        "translation": "It's like [( casket-one)\\/cow] cow milk, which doesn't think about the future life and will receive its reward.",
        "source": "T04n0212_011:0671c23_5"
    },
    {
        "source_sentence": "報對卒至乃知為惡，復當經歷地獄餓鬼畜生，是故說，不慮後世，當受其報也。",
        "translation": "When the retribution arrives, they'll know it's bad and will again go through hell, hungry ghosts, animals, and animals; therefore, they say that they won't worry about future lives, and they'll be subject to their retribution.",
        "source": "T04n0212_011:0671c23_6"
    },
    {
        "source_sentence": "　如鐵生垢，　　反食其身，　　惡生於心，",
        "translation": "Like the dirt that grows from an iron, which is eaten back and forth by its body, bad thoughts arise in your mind.",
        "source": "T04n0212_011:0671c26_0"
    },
    {
        "source_sentence": "　還自壞形。",
        "translation": "It returns to its own decaying form.",
        "source": "T04n0212_011:0671c27_0"
    },
    {
        "source_sentence": "如鐵生垢者，猶如淨鐵及明淨鏡，瑩治淨潔無有塵垢，然其人藏隱不牢，",
        "translation": "It's like when dirt grows from iron, it's like when pure iron and a clear mirror are shiny and pure without dirt, but that person hides and isn't secure.",
        "source": "T04n0212_011:0671c28_0"
    },
    {
        "source_sentence": "或在土中或在濕地，便生重垢，觸便碎散不任本用。",
        "translation": "Whether it's in the soil or in a wet place, heavy dirt arises, and when touched, it breaks apart and doesn't allow its original function.",
        "source": "T04n0212_011:0671c29_1"
    },
    {
        "source_sentence": "猶如利刀人所愛敬，恒自防備不離其身，中便忘誤安置不牢，便生塵垢本鐵不存，",
        "translation": "It's like a sharp sword that's beloved and respected by people who are constantly guarding themselves without leaving their bodies, forgetting to place it in an unsealed place where dirty dirt and originally iron won't remain.",
        "source": "T04n0212_011:0672a01_2"
    },
    {
        "source_sentence": "追惟此刀乃無有價，一朝壞敗不可任用，是故說，如鐵生垢，反食其身也。",
        "translation": "I remember that this sword is priceless and one day breaks down and cannot be used. Therefore, it is said to be like an iron growing dirt which feeds on the body instead.",
        "source": "T04n0212_011:0672a03_3"
    },
    {
        "source_sentence": "彼修行人亦復如是，為貪欲所覆閉，不慮後世殃舋眾惱，與惡知識從事，",
        "translation": "So it is with those practitioners who are hindered by craving, who don’t think about the evils and misfortunes of future lives, and who associate with bad friends.",
        "source": "T04n0212_011:0672a05_4"
    },
    {
        "source_sentence": "不以善為友，緣是故殃自毀其根，不修梵行，婬妷不淨，已自招患而受其報。",
        "translation": "They do not take goodness as their friend. Because of this, they criticize their own roots with blameworthiness; they do not practice the holy life and are coarse and impure. Having inflicted misfortune on themselves, they experience its retribution.",
        "source": "T04n0212_011:0672a07_0"
    },
    {
        "source_sentence": "是故說曰，惡生於心，還自害形也。",
        "translation": "That's why it's said that bad thoughts arise in the mind and return to harm their own form.",
        "source": "T04n0212_011:0672a08_1"
    },
    {
        "source_sentence": "◎出曜經卷第十一",
        "translation": "*出曜經卷第十一",
        "source": "T04n0212_011:0672a10_0"
    }
]