[
    {
        "source_sentence": "賢愚經卷第十",
        "translation": "Xianyu jing, vol. 10",
        "source": "T04n0202_010:0417a09_0"
    },
    {
        "source_sentence": "元魏涼州沙門慧覺等在高昌郡譯",
        "translation": "Yuan Wei Liangzhou shaman Huijue and others translated it at Gaochang Commandery",
        "source": "T04n0202_010:0417a11_0"
    },
    {
        "source_sentence": "（四五）◎阿難總持品第三十八(丹本為四十三)",
        "translation": "(4 5) - Ānanda's Chapter on the Overarching Teaching, Part 38 (the Dan edition is forty-three)",
        "source": "T04n0202_010:0417a12_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_010:0417a13_0"
    },
    {
        "source_sentence": "爾時諸比丘，咸皆生疑：「賢者阿難，本造何行，獲此總持，聞佛所說，",
        "translation": "The monks then all wondered, “Dear friend Ānanda, what practice did you perform in the past that you acquired this dhāraṇī and listened to the Buddha’s exhortation?",
        "source": "T04n0202_010:0417a14_0"
    },
    {
        "source_sentence": "一言不失？」",
        "translation": "A single word isn't lost?",
        "source": "T04n0202_010:0417a15_1"
    },
    {
        "source_sentence": "俱往佛所，而白佛言：「賢者阿難，本興何福，而得如是無量總持？",
        "translation": "They both went to the Buddha and said to him, Good man, what merit did Ānanda produce in the past that allowed him to attain such an immeasurable dhāraṇī?",
        "source": "T04n0202_010:0417a15_2"
    },
    {
        "source_sentence": "唯願世尊！",
        "translation": "Please, Bhagavān!",
        "source": "T04n0202_010:0417a17_3"
    },
    {
        "source_sentence": "當見開示。」",
        "translation": "You'll see and reveal it.",
        "source": "T04n0202_010:0417a17_4"
    },
    {
        "source_sentence": "佛告諸比丘：「諦聽著心！",
        "translation": "The Buddha told the monks, Listen closely, mindful!",
        "source": "T04n0202_010:0417a17_5"
    },
    {
        "source_sentence": "斯之總持，皆由福德。",
        "translation": "The general maintenance of this is all due to merit.",
        "source": "T04n0202_010:0417a18_6"
    },
    {
        "source_sentence": "乃往過去阿僧祇劫，爾時有一比丘，畜一沙彌，恒以嚴勅，教令誦經，",
        "translation": "In the past incalculable kalpa ago, there was a bhikṣu who had kept a śrāmaṇer. He always instructed him to recite scriptures by means of strong commands.",
        "source": "T04n0202_010:0417a18_7"
    },
    {
        "source_sentence": "日日課程，其經足者，便以歡喜，若其不足，苦切責之。",
        "translation": "Every day he studied the scriptures, and those who were sufficient would be delighted. If they weren't enough, he would be severely reprimanded.",
        "source": "T04n0202_010:0417a20_8"
    },
    {
        "source_sentence": "於是沙彌，常懷懊惱，誦經雖得，復無食具，若行乞食，疾得食時，誦經便足，",
        "translation": "At that time the śrāmaṇer permanently distressed himself. Even though he had obtained some food through recitation of the scriptures, he did not have any food to eat. When he was going on a hunger strike or begging for food, he could only get it by simply reciting the sutras.",
        "source": "T04n0202_010:0417a21_9"
    },
    {
        "source_sentence": "乞食若遲，誦則不充，若經不足，當被切責，心懷愁悶，啼哭而行。",
        "translation": "If he begs for food late and doesn't recite it, or if the sūtras aren't enough, he'll be severely reprimanded, grieved, weeping, and walking.",
        "source": "T04n0202_010:0417a23_10"
    },
    {
        "source_sentence": "時有長者，見其啼哭，前呼問言：『何以懊惱？』",
        "translation": "When an elderly man saw him weeping, he called out and asked, 'Why are you so distressed?'",
        "source": "T04n0202_010:0417a25_11"
    },
    {
        "source_sentence": "沙彌答曰：『長者當知！",
        "translation": "The novice answered, 'Elder, you should know!'",
        "source": "T04n0202_010:0417a26_12"
    },
    {
        "source_sentence": "我師嚴難，勅我誦經，日日課限，若其足者，即以歡喜，若其不充，苦切見責。",
        "translation": "Because of the serious difficulty of my teacher, he instructed me to recite the sutras for a fixed number of days and nights. Anyone with legs would be delighted if they were able to do so. If they are unable to do so, I will punish them with painful reprimand.",
        "source": "T04n0202_010:0417a26_13"
    },
    {
        "source_sentence": "我行乞食，若疾得者，誦經即足，若乞遲得，誦便不充，若不得經，便被切責。",
        "translation": "If I go begging for food, if I get it quickly, I'll recite the sūtras as my feet; if I beg to get it late, they won't suffice; and if I don't get the sūtras, I'll be severely reprimanded.",
        "source": "T04n0202_010:0417a28_14"
    },
    {
        "source_sentence": "以是事故，我用愁耳。』",
        "translation": "Because of this, I'll use it to grieve.'",
        "source": "T04n0202_010:0417b01_15"
    },
    {
        "source_sentence": "於時長者，即語沙彌：『從今以往，常詣我家，當供飲食，令汝不憂，",
        "translation": "The wealthy man then said to the novice: From now on, always come to my house and offer me food and drink so that you won’t worry.",
        "source": "T04n0202_010:0417b01_16"
    },
    {
        "source_sentence": "食已專心勤加誦經。』",
        "translation": "After he eats, he concentrates his mind and diligently recites the sūtras.'",
        "source": "T04n0202_010:0417b03_17"
    },
    {
        "source_sentence": "於時沙彌，聞是語已，即得專心勤加誦學，課限不減，日日常度，師徒於是，",
        "translation": "Having heard these words, the śrāmaṇer listened attentively and concentrated his mind. He practiced chanting and studying diligently without slackening in the number of days he was allowed to do so. Every day he crossed the boundary [of Jambudvīpa] every day. Thus did his teacher and disciples.",
        "source": "T04n0202_010:0417b03_18"
    },
    {
        "source_sentence": "俱同歡喜。」",
        "translation": "They'll all rejoice together.",
        "source": "T04n0202_010:0417b05_19"
    },
    {
        "source_sentence": "佛告比丘：「爾時師者，定光佛是。",
        "translation": "The Buddha told the monk, At the time, that teacher was the Buddha of Concentration and Light.",
        "source": "T04n0202_010:0417b05_20"
    },
    {
        "source_sentence": "時沙彌者，今我身是。",
        "translation": "The śrāmaṇer of that time is now me.",
        "source": "T04n0202_010:0417b06_21"
    },
    {
        "source_sentence": "時大長者，供養食者，今阿難是。",
        "translation": "The great elder then, who was the food offering, is now Ānanda.",
        "source": "T04n0202_010:0417b07_22"
    },
    {
        "source_sentence": "乃由過去造是行故，今得總持，無有忘失。」",
        "translation": "It's because they created this practice in the past that they now attain mastery, and there's no forgetting it.",
        "source": "T04n0202_010:0417b07_23"
    },
    {
        "source_sentence": "爾時諸比丘，聞是說已，歡喜信受，頂戴奉行。",
        "translation": "After hearing these words, the monks rejoiced and believed them, bowed their heads in respect, and carried them out.",
        "source": "T04n0202_010:0417b08_24"
    },
    {
        "source_sentence": "（四六）◎優婆斯兄所殺品第三十九(丹本為四十四)",
        "translation": "(4.6. The Thirty-ninethree Part of the Chapter on killing by Upāsikā (the Sanskrit text is forty-four)",
        "source": "T04n0202_010:0417b10_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_010:0417b11_0"
    },
    {
        "source_sentence": "爾時羅閱祇國，有估客兄弟二人，共住一處。",
        "translation": "At the time, there were two treasured brothers in Rājagṛha who lived together in one place.",
        "source": "T04n0202_010:0417b12_0"
    },
    {
        "source_sentence": "兄求長者女，欲以為婦，其女年小，未任出適。",
        "translation": "The elder brother asked the wealthy woman to become his wife, but she was too young to allow him to do so.",
        "source": "T04n0202_010:0417b13_0"
    },
    {
        "source_sentence": "於時其兄，即與眾賈，遠至他國，經歷年歲，滯不時還。",
        "translation": "At that time his elder brother, who was accompanied by a group of merchants, went far away to another country. For many years he stayed there but did not return home at the proper time.",
        "source": "T04n0202_010:0417b14_1"
    },
    {
        "source_sentence": "女年向大，任可嫁處，而語其弟：「卿兄遠行，投彼不還，汝今宜可納取我女。」",
        "translation": "When she became old enough to be married, she said to her younger brother, Your brother was traveling far away and didn't return; now it's appropriate for you to take my daughter.",
        "source": "T04n0202_010:0417b15_2"
    },
    {
        "source_sentence": "其弟答言：「何有是事？",
        "translation": "The disciple replied, What's the matter?",
        "source": "T04n0202_010:0417b17_3"
    },
    {
        "source_sentence": "我兄存在，不敢有違。」",
        "translation": "My brother exists, so I won't dare to disobey him.",
        "source": "T04n0202_010:0417b17_4"
    },
    {
        "source_sentence": "爾時長者，數數陳說，其弟意堅，未曾迴轉。",
        "translation": "The elder then repeatedly explained that his younger brother's mind was resolute, and he never turned around.",
        "source": "T04n0202_010:0417b18_5"
    },
    {
        "source_sentence": "長者不已，詐作遠書，託諸賈客，說兄死亡，弟聞兄死心乃愕然。",
        "translation": "The elder didn't stop, and he fraudulently wrote a distant letter entrusting it to the merchants who told him that his brother had died, and when the younger brother heard that his brother was dead, his mind was startled.",
        "source": "T04n0202_010:0417b19_6"
    },
    {
        "source_sentence": "長者復往，而告之曰：「卿兄已死，女當云何？",
        "translation": "Again, the wealthy man went to her and told her, “Your brother has already died. What will happen to your daughter?",
        "source": "T04n0202_010:0417b20_7"
    },
    {
        "source_sentence": "卿若不取，當思餘計。」",
        "translation": "If you don't take it, you must consider other things.",
        "source": "T04n0202_010:0417b21_8"
    },
    {
        "source_sentence": "弟被急逼，即妻其女，經歷數時，女便懷妊。",
        "translation": "The younger brother was overcome with anguish and forced to marry his daughter. After a few moments, she became pregnant.",
        "source": "T04n0202_010:0417b22_9"
    },
    {
        "source_sentence": "兄後便乃從他國還。",
        "translation": "Later, the elder brother returned from another country.",
        "source": "T04n0202_010:0417b23_10"
    },
    {
        "source_sentence": "於時其弟，聞兄還國，心懷慙懼，逃至舍衛。",
        "translation": "When his younger brother heard that he was returning home, he became angry and fearful and fled to Śrāvastī.",
        "source": "T04n0202_010:0417b23_11"
    },
    {
        "source_sentence": "發跡之後，諸親友輩，按其婦腹，墮其胎兒。",
        "translation": "After they set out the traces, their friends and relatives fell into the womb in their mother’s womb.",
        "source": "T04n0202_010:0417b24_12"
    },
    {
        "source_sentence": "如是展轉，到於佛前，慙愧所逼，求索出家。",
        "translation": "In this way they came before the Buddha in succession and, overcome by shame and embarrassed, begged him to renounce household life.",
        "source": "T04n0202_010:0417b25_13"
    },
    {
        "source_sentence": "佛知可度，即時聽許。",
        "translation": "Knowing that they could be liberated, the Buddha immediately agreed to allow them.",
        "source": "T04n0202_010:0417b27_0"
    },
    {
        "source_sentence": "蒙佛聽已，便成沙門，名優婆斯，奉持律行，精勤不懈，應時便得阿羅漢道，",
        "translation": "Having listened to the Buddha’s exhortation, Śāriputra became a śramaṇa called Upāsaka. He upheld the disciplinary rules and practiced diligently without slackening. At that time he attained the path of an arhat.",
        "source": "T04n0202_010:0417b27_1"
    },
    {
        "source_sentence": "六通清徹，眾智具足。",
        "translation": "The six supernormal powers are clear and penetrating, and the multitude of knowledge is replete.",
        "source": "T04n0202_010:0417b29_2"
    },
    {
        "source_sentence": "時兄到家，見弟已娶其婦，嫉心內忿，往追欲殺，求索推問，云至舍衛。",
        "translation": "When the brother went home, he saw that his younger brother had married his wife, became jealous and angry internally, went to chase after her and wanted to kill her, begged for help, and asked questions, saying, I'll go to Śrāvastī.",
        "source": "T04n0202_010:0417b29_3"
    },
    {
        "source_sentence": "毒恚煩心，即出重募：「誰能取得我弟頭者，當與重賞金五百兩。」",
        "translation": "With venomous anguish and troubled minds, he said to the great collector, Whoever can get my younger brother's head will be given a large reward of five hundred taels of gold.",
        "source": "T04n0202_010:0417c02_4"
    },
    {
        "source_sentence": "時有一人，來應其募：「我能往取其頭。」",
        "translation": "There was then a man who came to respond to the request, I can go and take his head.",
        "source": "T04n0202_010:0417c04_5"
    },
    {
        "source_sentence": "兄即出金，用募其人，相將俱進，至舍衛國。",
        "translation": "The elder brothers then produced some gold to solicit the talent of those who could join them. They proceeded together and arrived at Sāvatthī.",
        "source": "T04n0202_010:0417c05_6"
    },
    {
        "source_sentence": "到彼見弟，坐禪思惟，於時彼人，欻生慈心，而作是念：「我當云何殺此比丘？",
        "translation": "When he arrived, he saw his younger brother sitting in meditation and contemplating, and the man then became compassionate and thought, How will I kill this monk?",
        "source": "T04n0202_010:0417c06_7"
    },
    {
        "source_sentence": "吾設不殺，當奪我金。」",
        "translation": "If I don't kill them, they'll snatch my money.",
        "source": "T04n0202_010:0417c07_8"
    },
    {
        "source_sentence": "引弓欲射，當挽弓時，向彼比丘，至於放矢，乃中其兄。",
        "translation": "He drew his bow and wanted to shoot, but when he drew the bow, he faced that monk. As soon as he released his arrow, he struck his brother.",
        "source": "T04n0202_010:0417c08_9"
    },
    {
        "source_sentence": "其兄懷恚，憤惱而死，後更受身，作毒蛇形，生彼道人戶樞之中，毒心未歇，",
        "translation": "The demon’s brother was tormented with anger and died. Later, he was reborn in the form of a poisonous snake born among the householders living in that monastic monastery but his poisonous thoughts did not stop.",
        "source": "T04n0202_010:0417c09_10"
    },
    {
        "source_sentence": "規當害之。",
        "translation": "Rui will harm him.",
        "source": "T04n0202_010:0417c11_11"
    },
    {
        "source_sentence": "戶數開閉，撽身而死。",
        "translation": "The doors of the house were frequently opened and closed, and they screamed and died.",
        "source": "T04n0202_010:0417c11_12"
    },
    {
        "source_sentence": "既死之後，未能改操，遂願更作小形毒蟲，依彼道人屋間而住，伺其道人端坐之時，",
        "translation": "Having died, they were unable to change their ways and wished to become small poisonous insects. They lived in the living quarters of the monastery where the monks lived and waited for them to take their seats.",
        "source": "T04n0202_010:0417c12_13"
    },
    {
        "source_sentence": "從屋間下，墮其頂上，惡毒猛熾，即殺比丘。",
        "translation": "He descended from the room and fell onto the top of his head, which was so badly poisonous and ablaze that it killed the monk.",
        "source": "T04n0202_010:0417c14_14"
    },
    {
        "source_sentence": "時舍利弗，見斯事已，往至佛所，而白佛言：「彼死比丘，本作何緣，",
        "translation": "Having seen this, Śāriputra went to the place where the Buddha was staying and said to him: O bhikṣus, for what reason did you kill that monk?",
        "source": "T04n0202_010:0417c15_15"
    },
    {
        "source_sentence": "今現得道，被毒而死？",
        "translation": "Now that you have attained enlightenment, will you be poisoned and die?",
        "source": "T04n0202_010:0417c16_16"
    },
    {
        "source_sentence": "唯願世尊！",
        "translation": "Please, Bhagavān!",
        "source": "T04n0202_010:0417c17_17"
    },
    {
        "source_sentence": "當見開示。」",
        "translation": "You'll see and reveal it.",
        "source": "T04n0202_010:0417c17_18"
    },
    {
        "source_sentence": "佛告舍利弗：「善聽善念！",
        "translation": "The Buddha told Śāriputra, Listen well and remember well!",
        "source": "T04n0202_010:0417c17_19"
    },
    {
        "source_sentence": "吾當為汝具分別說。",
        "translation": "I will explain it for you in detail.",
        "source": "T04n0202_010:0417c18_20"
    },
    {
        "source_sentence": "乃往過去無數世中，有辟支佛，出現於世，處在山林，修遂其志。",
        "translation": "In an uncountable number of worlds in the past, there was a pratyekabuddha who appeared in the world and stayed in a mountain forest to cultivate his aspirations.",
        "source": "T04n0202_010:0417c18_21"
    },
    {
        "source_sentence": "時有獵師，恒捕禽獸，施設方計，望伺苟得。",
        "translation": "There was a hunter at the time who always caught birds and beasts. He set up a detailed account of their numbers and hoped to catch them.",
        "source": "T04n0202_010:0417c20_22"
    },
    {
        "source_sentence": "時辟支佛，驚其禽獸，令其獵師伺捕不得，便懷瞋恚，懊惱憤結，即以毒箭，",
        "translation": "The pratyekabuddha then frightened the animals and caused their hunters to search for them but they could not find them. So he became angry and distressed, weeping wickedly.",
        "source": "T04n0202_010:0417c21_23"
    },
    {
        "source_sentence": "射辟支佛。",
        "translation": "He shoots at the pratyekabuddha.",
        "source": "T04n0202_010:0417c23_24"
    },
    {
        "source_sentence": "時辟支佛，心愍此人，欲令改悔，為現神足，所謂飛行履虛，屈伸舒戢，",
        "translation": "The pratyekabuddha then felt pity for this man and wanted to make him repent. In order to show his supernormal powers, he flew up and down in the air, stretching and contracting as he could.",
        "source": "T04n0202_010:0417c23_25"
    },
    {
        "source_sentence": "出沒自在，神足變現。",
        "translation": "They can go and come out freely, and their supernormal powers are manifested.",
        "source": "T04n0202_010:0417c25_26"
    },
    {
        "source_sentence": "於時獵師，見是事已，心懷敬仰，恐怖自責，歸誠謝過，求哀懺悔。",
        "translation": "When the hunter saw this, he respected it with veneration and fearful rebuke, apologized in sincerity, and begged to repent.",
        "source": "T04n0202_010:0417c25_27"
    },
    {
        "source_sentence": "時辟支佛，受其懺悔，懺悔已竟，被毒而死。",
        "translation": "The pratyekabuddha then accepted his repentance, and after he had done so, he was poisoned and died.",
        "source": "T04n0202_010:0417c27_28"
    },
    {
        "source_sentence": "其人命終，便墮地獄，既出地獄，五百世中，常被毒死，至于今日，得阿羅漢道，",
        "translation": "At the end of their life, they will fall into hell. Having emerged from that hell, for five hundred world ages they will always be poisoned and die; but today they have attained the path of the arhats.",
        "source": "T04n0202_010:0417c28_29"
    },
    {
        "source_sentence": "猶為毒蟲，見螫斷命。",
        "translation": "They're like a poisonous insect that sees its sting and cuts off life.",
        "source": "T04n0202_010:0418a01_30"
    },
    {
        "source_sentence": "由興惡意，即還懺悔，而發誓願：『使我來世遭值聖師，所得神足，如今者。』",
        "translation": "Because of this bad intention, he repents and makes a vow, 'May I be able to meet the noble teacher in a future life who has attained miraculous abilities like the present.'",
        "source": "T04n0202_010:0418a01_31"
    },
    {
        "source_sentence": "故今得值我，蒙獲道法。」",
        "translation": "Therefore, now that you've met me, you've been given the teaching of the path.",
        "source": "T04n0202_010:0418a03_32"
    },
    {
        "source_sentence": "爾時舍利弗，及與眾會，聞佛所說，歡喜奉行。",
        "translation": "At the time, Śāriputra and the assembled people heard what the Buddha taught, rejoicing and venerating it.",
        "source": "T04n0202_010:0418a04_0"
    },
    {
        "source_sentence": "（四七）◎兒誤殺父品第四十(丹本為四十五)",
        "translation": "(49.7) The Fourteenth Chapter of killing the father by mistake (the Dan edition is forty-five)",
        "source": "T04n0202_010:0418a06_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T04n0202_010:0418a07_0"
    },
    {
        "source_sentence": "爾時有一老翁，早失其婦，獨與兒居，困無財寶，覺世非常，念欲出家，",
        "translation": "At that time there was an old man who had lost his wife early in life. He lived alone with his children, bewildered by the absence of property and possessions. Realizing that the world was unreal, he thought of leaving home.",
        "source": "T04n0202_010:0418a08_0"
    },
    {
        "source_sentence": "即往佛所，求索入道。",
        "translation": "He went to the Buddha and begged him to enter the Way.",
        "source": "T04n0202_010:0418a09_1"
    },
    {
        "source_sentence": "時佛怜愍，即聽出家。",
        "translation": "With compassion, the Buddha then listened and left home.",
        "source": "T04n0202_010:0418a10_2"
    },
    {
        "source_sentence": "於時其父，便作比丘，時兒年小，即為沙彌，恒共其父，入村乞食，暮還所止。",
        "translation": "His father then became a monk, and when he was young enough to become a novice, he always went with his father into the village to solicit alms and stayed there at night.",
        "source": "T04n0202_010:0418a10_3"
    },
    {
        "source_sentence": "時有一村，最為邊遠，至彼乞食，逼暮當還。",
        "translation": "At that time there was a village the remotest from the monastery, and when he went there to solicit alms he would return in the evening.",
        "source": "T04n0202_010:0418a12_4"
    },
    {
        "source_sentence": "其父年老，行步遲緩，其兒恐懼，畏諸毒獸，急扶其父，推之進路，執之不固，",
        "translation": "The father grew old and walked slowly. Fearful of the danger of poisonous animals, the child was urged to help his father; but he pushed him along the road and held him in an unsteady position.",
        "source": "T04n0202_010:0418a13_5"
    },
    {
        "source_sentence": "推父倒地，應時其父，當手而死。",
        "translation": "He pushed his father down to the ground, and then his father died at that point.",
        "source": "T04n0202_010:0418a15_6"
    },
    {
        "source_sentence": "父死之後，獨至佛所。",
        "translation": "After his father died, he went to the Buddha's place alone.",
        "source": "T04n0202_010:0418a16_7"
    },
    {
        "source_sentence": "時諸比丘，問沙彌言：「汝朝與師，至村乞食，今為所在？」",
        "translation": "The monks then asked the novice, Suppose you were to give it to your teacher in the morning and go to the village to solicit alms, where are you now?",
        "source": "T04n0202_010:0418a16_8"
    },
    {
        "source_sentence": "沙彌答言：「我向與師，至彼乞食，日暮還時，師行小遲，我時恐怖，",
        "translation": "The śrāmaṇer replied, “I am going to go with my teacher. When I come to that place to beg for food and return at sunset, the teacher is walking slowly. At that time I am afraid.",
        "source": "T04n0202_010:0418a18_9"
    },
    {
        "source_sentence": "故急推之，推之手急，撲師著地，我師於時，即死道中。」",
        "translation": "That's why he pushed it hastily, pushed it with his hand hastily, and pounced the teacher on the ground; at that point, my teacher was in the path of death.",
        "source": "T04n0202_010:0418a19_10"
    },
    {
        "source_sentence": "時諸比丘，呵責沙彌：「汝大惡人！",
        "translation": "The monks then reprimanded the novice, You're a great bad person!",
        "source": "T04n0202_010:0418a20_11"
    },
    {
        "source_sentence": "殺父殺師。」",
        "translation": "He killed his father and killed his teacher.",
        "source": "T04n0202_010:0418a21_12"
    },
    {
        "source_sentence": "即以白佛。",
        "translation": "He then said to the Buddha.",
        "source": "T04n0202_010:0418a21_13"
    },
    {
        "source_sentence": "佛告之曰：「此師雖死，不以惡意。」",
        "translation": "The Buddha told him, Even though this teacher dies, he doesn't do so with bad intentions.",
        "source": "T04n0202_010:0418a22_14"
    },
    {
        "source_sentence": "即問沙彌：「汝殺師不？」",
        "translation": "He then asked the novice, Do you kill your teacher?",
        "source": "T04n0202_010:0418a22_15"
    },
    {
        "source_sentence": "沙彌答言：「我實排之，不以惡意而殺父也。」",
        "translation": "The śrāmaṇer replied, I'm really remonstrating with them, not killing my father with bad intentions.",
        "source": "T04n0202_010:0418a23_16"
    },
    {
        "source_sentence": "佛可其語。",
        "translation": "The Buddha agreed with his words.",
        "source": "T04n0202_010:0418a24_17"
    },
    {
        "source_sentence": "「如是沙彌！",
        "translation": "Thus, Sramana!",
        "source": "T04n0202_010:0418a24_18"
    },
    {
        "source_sentence": "我知汝心無有惡意。",
        "translation": "I know that your mind has no bad intentions.",
        "source": "T04n0202_010:0418a25_19"
    },
    {
        "source_sentence": "過去世時，亦復如是，無有惡意，而相殺害。」",
        "translation": "In a past life, they were likewise, with no bad intentions, and they killed each other.",
        "source": "T04n0202_010:0418a25_20"
    },
    {
        "source_sentence": "時諸比丘，聞佛語已，即共白佛：「不審，世尊！",
        "translation": "The monks then heard the Buddha's words, and they all said to him, Not sure, Bhagavān!",
        "source": "T04n0202_010:0418a26_21"
    },
    {
        "source_sentence": "過去世時，斯人父子，有何因緣而便相殺？」",
        "translation": "In a past life, what were the causes and conditions for this person's father and son to kill each other?",
        "source": "T04n0202_010:0418a27_22"
    },
    {
        "source_sentence": "佛言：「諦聽！",
        "translation": "The Buddha said, Listen closely!",
        "source": "T04n0202_010:0418a28_23"
    },
    {
        "source_sentence": "吾當說之。",
        "translation": "I will explain it.",
        "source": "T04n0202_010:0418a28_24"
    },
    {
        "source_sentence": "過去無量阿僧祇劫時，父子二人，共住一處。",
        "translation": "In the past, when there were measureless incalculable eons, fathers and sons lived together in one place.",
        "source": "T04n0202_010:0418a29_25"
    },
    {
        "source_sentence": "時父病極，於時睡臥，多有虻蠅，數來惱觸，父即令兒遮逐其蠅，望得安眠以解疲勞。",
        "translation": "When the father was seriously ill, he fell asleep and lay with many gadflies that often came to disturb him. The father told his child to keep away from these flies, hoping to sleep soundly to relieve his exhaustion.",
        "source": "T04n0202_010:0418b01_26"
    },
    {
        "source_sentence": "時兒急遮，蠅遂數來，數來不止，兒便瞋恚，即持大杖，伺蠅當殺。",
        "translation": "The boy then quickly stopped it, and the fly came again and again. Not stopping after coming again and again, the boy became angry and took up a large stick to wait for the fly to kill him.",
        "source": "T04n0202_010:0418b03_27"
    },
    {
        "source_sentence": "時諸虻蠅，競來父額，以杖打之，即殺其父。",
        "translation": "The gadflies then rushed to their father's forehead and struck him with a stick, killing his father.",
        "source": "T04n0202_010:0418b04_28"
    },
    {
        "source_sentence": "當於爾時，亦非惡意。",
        "translation": "At that point, it's not bad intention either.",
        "source": "T04n0202_010:0418b05_29"
    },
    {
        "source_sentence": "比丘當知！",
        "translation": "Monks, you should know!",
        "source": "T04n0202_010:0418b06_30"
    },
    {
        "source_sentence": "爾時父者，此沙彌是。",
        "translation": "The father at the time was this śrāmaṇer.",
        "source": "T04n0202_010:0418b06_31"
    },
    {
        "source_sentence": "時兒以杖打父額者，今彼死比丘是。",
        "translation": "The boy then beat his father's forehead with a stick, and now that dead monk is him.",
        "source": "T04n0202_010:0418b07_0"
    },
    {
        "source_sentence": "由於爾時無有惡心，以杖打父殺之，不以惡意，今還相報，亦非故殺。」",
        "translation": "Because they didn't have bad intentions at the time, they beat their father with a stick and killed him, but they didn't kill him with bad intentions; now they'll retaliate by killing each other, which isn't an intentional killing.",
        "source": "T04n0202_010:0418b07_1"
    },
    {
        "source_sentence": "於時沙彌，漸漸修學，勤加不懈，遂得羅漢。",
        "translation": "The śrāmaṇer then gradually cultivated his training, exerted himself diligently and without slackening, and eventually attained arhatship.",
        "source": "T04n0202_010:0418b09_2"
    },
    {
        "source_sentence": "爾時諸比丘，聞佛所說，心悉信解，歡喜奉行。",
        "translation": "When the monks heard what the Buddha taught them, their minds were completely convinced and they rejoiced and remembered it well.",
        "source": "T04n0202_010:0418b10_3"
    },
    {
        "source_sentence": "（四八）◎須達起精舍品第四十一(丹本為四十六)",
        "translation": "(4 (8) - Chapter 41 of the Sūda起精舍品第四十一(丹本為四十六)",
        "source": "T04n0202_010:0418b12_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在王舍城竹園中止。",
        "translation": "Thus I have heard: One time, the Buddha was staying at the bamboo grove in Rājagṛha.",
        "source": "T04n0202_010:0418b13_0"
    },
    {
        "source_sentence": "爾時舍衛國王波斯匿，有一大臣，名曰須達，居家巨富，財寶無限，好喜布施，",
        "translation": "It was then that the king of Sāvatthī, Prasenajit, had a minister named Sudarśana, who lived in wealth and possessed unlimited riches.",
        "source": "T04n0202_010:0418b13_1"
    },
    {
        "source_sentence": "賑濟貧乏及諸孤老，時人因行，為其立號，名給孤獨。",
        "translation": "It relieves the poor and the orphaned, and it's called Anāthapiṇḍika when people practice it and raise a cry for them.",
        "source": "T04n0202_010:0418b15_2"
    },
    {
        "source_sentence": "爾時長者，生七男兒，年各長大，為其納娶，次第至六。",
        "translation": "The wealthy man then gave birth to seven boys, each of whom grew up to the age of six.",
        "source": "T04n0202_010:0418b17_0"
    },
    {
        "source_sentence": "其第七兒，端政殊異，偏心愛念，當為娶妻，欲得極妙容姿端政有相之女，",
        "translation": "The seventh child, whose features are extraordinary and different in appearance, will have a biased mind with craving for her. He will marry his wife to obtain a woman of the utmost splendor, who will be handsome and attractive.",
        "source": "T04n0202_010:0418b18_1"
    },
    {
        "source_sentence": "為兒求之。",
        "translation": "I'll ask for it for my child.",
        "source": "T04n0202_010:0418b20_2"
    },
    {
        "source_sentence": "即語諸婆羅門言：「誰有好女相貌備足，當為我兒往求索之。」",
        "translation": "He then said to the Brāhmaṇas, Whoever has a good-looking woman with sufficient appearance will go and ask for her for my child?",
        "source": "T04n0202_010:0418b20_3"
    },
    {
        "source_sentence": "諸婆羅門，便為推覓，展轉行乞，到王舍城。",
        "translation": "The brāhmaṇas searched for the treasure and went to the city of Rājagṛha in order to beg for it.",
        "source": "T04n0202_010:0418b21_4"
    },
    {
        "source_sentence": "王舍城中，有一大臣，名曰護彌，財富無量，信敬三寶。",
        "translation": "In the city of Rājagṛha, there was a minister named護彌, with immeasurable wealth and faith in the Triple Gem.",
        "source": "T04n0202_010:0418b22_5"
    },
    {
        "source_sentence": "時婆羅門，到家從乞。",
        "translation": "The Brāhmaṇa then went home and begged.",
        "source": "T04n0202_010:0418b24_6"
    },
    {
        "source_sentence": "國法施人，要令童女，持物布施。",
        "translation": "The donor of the state's teaching is to cause a young woman to carry things and give them as alms.",
        "source": "T04n0202_010:0418b24_7"
    },
    {
        "source_sentence": "護彌長者，時有一女，威容端正，顏色殊妙，即持食出，施婆羅門。",
        "translation": "At the time, there was a woman of dignified appearance and good looks who gave food to the brāhmaṇa.",
        "source": "T04n0202_010:0418b25_8"
    },
    {
        "source_sentence": "婆羅門見，心大歡喜：「我所覓者，今日見之。」",
        "translation": "Seeing this, the Brāhmaṇa was overjoyed and said, Today, I'll see what I'm looking for.",
        "source": "T04n0202_010:0418b26_9"
    },
    {
        "source_sentence": "即問女言：「頗有人來求索汝未？」",
        "translation": "She asked the woman, Could it be that someone came to ask for you?",
        "source": "T04n0202_010:0418b27_10"
    },
    {
        "source_sentence": "答言：「未也。」",
        "translation": "He replied, Not yet.",
        "source": "T04n0202_010:0418b28_11"
    },
    {
        "source_sentence": "問言：「女子！",
        "translation": "He asked, Woman!",
        "source": "T04n0202_010:0418b29_0"
    },
    {
        "source_sentence": "汝父在不？」",
        "translation": "Is your father here?",
        "source": "T04n0202_010:0418b29_1"
    },
    {
        "source_sentence": "其女言：「在。」",
        "translation": "The woman said, Yes.",
        "source": "T04n0202_010:0418b29_2"
    },
    {
        "source_sentence": "婆羅門言：「語令出外，我欲見之與共談語。」",
        "translation": "The Brāhmaṇa said, Tell him to go outside; I want to see him and talk to him.",
        "source": "T04n0202_010:0418b29_3"
    },
    {
        "source_sentence": "時女入內，白其父言：「外有乞人，欲得相見。」",
        "translation": "The woman then went inside and said to her father, Outside, there's a beggar who wants to see you.",
        "source": "T04n0202_010:0418c01_4"
    },
    {
        "source_sentence": "父便出外。",
        "translation": "The father then went outside.",
        "source": "T04n0202_010:0418c02_5"
    },
    {
        "source_sentence": "時婆羅門，問訊起居安和善吉：「舍衛國王，有一大臣，字曰須達，輔相識不？」",
        "translation": "The Brāhmaṇa then asked, Does the king of Sāvatthī have a minister named Sudarśana who's assisting him?",
        "source": "T04n0202_010:0418c03_6"
    },
    {
        "source_sentence": "答言：「未見，但聞其名。」",
        "translation": "He replied, I haven't seen it; I've only heard its name.",
        "source": "T04n0202_010:0418c04_7"
    },
    {
        "source_sentence": "報言：「知不？",
        "translation": "He replied, Do you know?",
        "source": "T04n0202_010:0418c05_8"
    },
    {
        "source_sentence": "是人於彼舍衛國中，第一富貴，汝於此間，富貴第一。",
        "translation": "That man is the richest and wealthiest among the people in Sāvatthī. You are the richest and wealthiest among the people here.",
        "source": "T04n0202_010:0418c05_9"
    },
    {
        "source_sentence": "須達有兒，端正殊妙，卓略多奇，欲求君女，為可爾不？」",
        "translation": "Sudarśana has a child, who's so handsome and marvelous that he wants to ask for a woman, is that possible?",
        "source": "T04n0202_010:0418c06_10"
    },
    {
        "source_sentence": "答言：「可爾。」",
        "translation": "He replied, That's right.",
        "source": "T04n0202_010:0418c08_11"
    },
    {
        "source_sentence": "值有估客欲至舍衛，時婆羅門，作書因之，送與須達，具陳其事。",
        "translation": "When an appraiser was about to go to Śrāvastī, the brāhmaṇa wrote a letter in reply and gave it to Sudarśana to give him all the details of his journey.",
        "source": "T04n0202_010:0418c08_12"
    },
    {
        "source_sentence": "須達歡喜，詣王求假，為兒娶婦。",
        "translation": "Delighted, Sudarśana approached the king to seek a temporary release and married his wife for her sake.",
        "source": "T04n0202_010:0418c10_13"
    },
    {
        "source_sentence": "王即聽之。",
        "translation": "The king then listened to it.",
        "source": "T04n0202_010:0418c10_14"
    },
    {
        "source_sentence": "大載珍寶，趣王舍城，於其道次，賑濟貧乏，到王舍城，至護彌家，為兒求妻。",
        "translation": "Carrying a large quantity of rare treasures, he proceeded to the city of Rājagṛha. On the right path leading down the road, in order to relieve the poor and impoverished, he reached the city of Rājagṛha and came to the house of Kauśāmbī, where he sought a wife for his children.",
        "source": "T04n0202_010:0418c11_15"
    },
    {
        "source_sentence": "護彌長者，歡喜迎逆，安置敷具，暮宿其舍，家內搔搔，辦具飲食。",
        "translation": "Rejoicing and greeting, the elder Kauṇḍinya settled his bedding and spent the night in his dwelling at night. The householders scratched it inside the house to prepare food and drink for them.",
        "source": "T04n0202_010:0418c13_0"
    },
    {
        "source_sentence": "須達念言：「今此長者，大設供具，欲作何等？",
        "translation": "Sudarśana thought, Now, what do you want this wealthy man to do when he sets up a great offering?",
        "source": "T04n0202_010:0418c14_1"
    },
    {
        "source_sentence": "將請國王太子大臣、長者居士、婚姻親戚，設大會耶？」",
        "translation": "Will you invite the king, princes, ministers, elders, householders, and married relatives to set up a large assembly?",
        "source": "T04n0202_010:0418c15_2"
    },
    {
        "source_sentence": "思惟所以，不能了知，而問之言：「長者今暮，躬自執勞，經理事務，",
        "translation": "The reason he thought so was unknown and asked, “Tonight the householder is engaged in running his own affairs.",
        "source": "T04n0202_010:0418c16_3"
    },
    {
        "source_sentence": "施設供具，為欲請王太子大臣？」",
        "translation": "Do you want to invite the king's crown prince and ministers to make offerings?",
        "source": "T04n0202_010:0418c18_4"
    },
    {
        "source_sentence": "答言：「不也。」",
        "translation": "He replied, No.",
        "source": "T04n0202_010:0418c19_0"
    },
    {
        "source_sentence": "「欲營婚姻親戚會耶？」",
        "translation": "Do you want to arrange a marriage and relatives' meeting?",
        "source": "T04n0202_010:0418c19_1"
    },
    {
        "source_sentence": "答言：「不也。」",
        "translation": "He replied, No.",
        "source": "T04n0202_010:0418c19_2"
    },
    {
        "source_sentence": "「將何所作？」",
        "translation": "What will you do?",
        "source": "T04n0202_010:0418c20_3"
    },
    {
        "source_sentence": "答言：「請佛及比丘僧。」",
        "translation": "He replied, Invited the Buddha and the monks.",
        "source": "T04n0202_010:0418c20_4"
    },
    {
        "source_sentence": "於時須達，聞佛僧名，忽然毛竪如有所得，心情悅豫，重問之言：「云何名佛？",
        "translation": "When Sudarśana heard the name of the Buddha and the saṃgha, his hair suddenly stood on end as if he had attained enlightenment. Delighted, he asked again, What's the name of the Buddha?",
        "source": "T04n0202_010:0418c20_5"
    },
    {
        "source_sentence": "願解其義。」",
        "translation": "May you understand its meaning.",
        "source": "T04n0202_010:0418c22_6"
    },
    {
        "source_sentence": "長者答言：「汝不聞乎？",
        "translation": "The elder replied, Haven't you heard?",
        "source": "T04n0202_010:0418c22_7"
    },
    {
        "source_sentence": "淨飯王子，厥名悉達，其生之日，天降瑞應三十有二，萬神侍衛，即行七步，",
        "translation": "The prince Jīvaka, named Siddhārtha, was born. On the day he was born, a divine light descended from heaven and there were thirty-two omens in the sky. Ten thousand deities guarded him as he walked seven paces.",
        "source": "T04n0202_010:0418c23_8"
    },
    {
        "source_sentence": "舉手而言：『天上天下，唯我為尊。』",
        "translation": "He raised his hand and said, 'In heaven and earth, I'm the only honored one.'",
        "source": "T04n0202_010:0418c25_9"
    },
    {
        "source_sentence": "身黃金色，三十二相、八十種好，應王金輪典四天下。",
        "translation": "His body was golden in color, endowed with the thirty-two marks and eighty minor embellishments of a great being. He ruled over the four quarters of the earth under the king of gold wheels.",
        "source": "T04n0202_010:0418c26_10"
    },
    {
        "source_sentence": "見老病死苦，不樂在家，出家修道，六年苦行，得一切智，盡結成佛。",
        "translation": "Seeing the suffering of old age, illness, and death, he doesn't delight in staying home, leaves home, cultivates it, practices asceticism for six years, attains omniscience, and ends his bonds to become a buddha.",
        "source": "T04n0202_010:0418c27_11"
    },
    {
        "source_sentence": "降諸魔眾十八億萬，號曰能仁，十力無畏，十八不共，光明照耀，三達遐鑒，",
        "translation": "He subdued the eighteen billion myriads­ ions of Māras. His name was Nengren; his ten powers and fearlessness were not shared by any of the eighteen gods, and his light shone brilliantly.",
        "source": "T04n0202_010:0418c29_12"
    },
    {
        "source_sentence": "故號佛也。」",
        "translation": "That's why they're called buddhas.",
        "source": "T04n0202_010:0419a01_13"
    },
    {
        "source_sentence": "須達問言：「云何名僧？」",
        "translation": "Sudarśana asked, What's called a monk?",
        "source": "T04n0202_010:0419a02_14"
    },
    {
        "source_sentence": "護彌答言：「佛成道已，梵天勸請轉妙法輪，至波羅[木*奈]鹿野苑中，",
        "translation": "Gotama answered, “Once the Buddha had attained enlightenment, the Brahmadeva god Brahmā invited him to turn the wheel of the wonderful Dharma and went to the Deer Preserve of Benares.",
        "source": "T04n0202_010:0419a02_15"
    },
    {
        "source_sentence": "為拘隣五人，轉四真諦，漏盡結解，便成沙門，六通具足，四意、七覺、八道悉練，",
        "translation": "For the sake of these five [monks] Kauṇḍinya, he taught them the four genuine truths and ended the defilements. They then became śramaṇas endowed with the six supernatural knowledges and fully trained in the four kinds of thought, the seven transcendent thoughts, and the eightfold path.",
        "source": "T04n0202_010:0419a04_16"
    },
    {
        "source_sentence": "上虛空中，八萬諸天得須陀洹，無量天人發無上正真道意。",
        "translation": "In the sky above, 80,000 gods attain stream entry, and measureless gods give rise to the intention for the unsurpassed true path.",
        "source": "T04n0202_010:0419a05_17"
    },
    {
        "source_sentence": "次度欝卑迦葉兄弟千人，漏盡意解，如其五人。",
        "translation": "Next, he liberated a thousand of the Kāśyapa brothers in Upāsikāśyapa, and they ended their contaminants and resolved to do so, just like those five.",
        "source": "T04n0202_010:0419a07_18"
    },
    {
        "source_sentence": "次第度舍利弗、目連徒眾五百，亦得應真。",
        "translation": "The five hundred disciples Śāriputra and Maudgalyāyana, who were liberated one after the other in order, also attained reality.",
        "source": "T04n0202_010:0419a08_19"
    },
    {
        "source_sentence": "如是之等，神足自在，能為眾生，作良祐福田，故名僧也。」",
        "translation": "Such people have the power of supernormal abilities and are able to create a good field of blessedness for sentient beings, so they're called monks.",
        "source": "T04n0202_010:0419a09_20"
    },
    {
        "source_sentence": "須達聞說如此妙事，歡喜踊躍，感念信敬，企望至曉，當往見佛。",
        "translation": "When Sudarśana heard this marvelous teaching, he rejoiced and jumped for joy. With a feeling of faith and respect, he wished to see the Buddha at dawn.",
        "source": "T04n0202_010:0419a10_21"
    },
    {
        "source_sentence": "誠報神應，見地明曉，尋明即往羅閱城門，夜三時開，初夜中夜後夜，",
        "translation": "At dawn he went to the gate of Rājagṛha. The city gates opened at three o’clock in the morning and closed at midnight, middle of the night, and after midnight.",
        "source": "T04n0202_010:0419a12_22"
    },
    {
        "source_sentence": "是謂三時。",
        "translation": "These are the three times.",
        "source": "T04n0202_010:0419a13_23"
    },
    {
        "source_sentence": "中夜出門，見有天祠，即為禮拜，忽忘念佛，心自還闇，便自念言：「今夜故闇，",
        "translation": "In the middle of the night he went out and saw a deva temple. Immediately after worshipping it, he suddenly forgot to remember the Buddha’s name. His mind became dark in itself. He thought to himself, “Tonight is so dark that I cannot sleep.",
        "source": "T04n0202_010:0419a14_0"
    },
    {
        "source_sentence": "若我往者，儻為惡鬼猛獸見害，且還入城。」",
        "translation": "If I go there, I'll be harmed by a bad demon or fierce animal and return to the city.",
        "source": "T04n0202_010:0419a15_1"
    },
    {
        "source_sentence": "待曉當往。",
        "translation": "I'll go there at dawn.",
        "source": "T04n0202_010:0419a16_2"
    },
    {
        "source_sentence": "時有親友，命終生四天，見其欲悔，便下語之：「居士！",
        "translation": "At the time, there was a friend who died and was born in the four heavens. Seeing his desire to repent, he went down and said to him:",
        "source": "T04n0202_010:0419a17_3"
    },
    {
        "source_sentence": "莫悔也！",
        "translation": "Don't regret it!",
        "source": "T04n0202_010:0419a18_4"
    },
    {
        "source_sentence": "汝往見佛，得利無量，正使今得百車珍寶，不如轉足一步往趣世尊，所得利深，",
        "translation": "Go see the Buddha and you will obtain immeasurable benefits. Even if you were to acquire a hundred carts of rare treasures, it would not be as good as going one step at a time to visit the World-honored One. The benefits you have gained are profound.",
        "source": "T04n0202_010:0419a18_5"
    },
    {
        "source_sentence": "過踰於彼。",
        "translation": "It's beyond that.",
        "source": "T04n0202_010:0419a20_6"
    },
    {
        "source_sentence": "居士！",
        "translation": "householder!",
        "source": "T04n0202_010:0419a20_7"
    },
    {
        "source_sentence": "汝去莫悔！",
        "translation": "Go away and don't regret it!",
        "source": "T04n0202_010:0419a20_8"
    },
    {
        "source_sentence": "正使今得白象珍寶，不如舉足一步往趣世尊，利過於彼。",
        "translation": "Now that they've obtained the white elephant treasure, why wouldn't they lift their feet and go one step toward the Bhagavān, which is more profitable than that?",
        "source": "T04n0202_010:0419a21_9"
    },
    {
        "source_sentence": "居士！",
        "translation": "householder!",
        "source": "T04n0202_010:0419a22_10"
    },
    {
        "source_sentence": "汝去莫悔！",
        "translation": "Go away and don't regret it!",
        "source": "T04n0202_010:0419a22_11"
    },
    {
        "source_sentence": "正使今得一閻浮提滿中珍寶，不如轉足一步至世尊所，得利弘多。",
        "translation": "Now, it's better to attain a Jambudvīpa full of treasures than to turn your feet one step toward the Bhagavān and attain vast benefits.",
        "source": "T04n0202_010:0419a22_12"
    },
    {
        "source_sentence": "居士！",
        "translation": "householder!",
        "source": "T04n0202_010:0419a24_13"
    },
    {
        "source_sentence": "汝去莫悔！",
        "translation": "Go away and don't regret it!",
        "source": "T04n0202_010:0419a24_14"
    },
    {
        "source_sentence": "正使今得一四天下滿中珍寶，不如舉足一步至世尊所，所得盈利，踰過於彼，",
        "translation": "It is better to reach the World-honored One by walking one step without rising his feet. The profit he receives far surpasses those [those who do so].",
        "source": "T04n0202_010:0419a24_15"
    },
    {
        "source_sentence": "百千萬倍。」",
        "translation": "It's a hundred million times greater.",
        "source": "T04n0202_010:0419a26_16"
    },
    {
        "source_sentence": "須達聞天說如此語，益增歡喜，敬念世尊，闇即還曉，尋路往至，到世尊所。",
        "translation": "When Sudarśana heard these words of the gods, he became even more joyful and venerated the Bhagavān. In the darkness [of the night] at once dawned again. Traveling on a different path, he reached the place where the Bhagavat was staying.",
        "source": "T04n0202_010:0419a27_17"
    },
    {
        "source_sentence": "爾時世尊，知須達來，出外經行。",
        "translation": "It was then that the Bhagavān knew Sudarśana had come and went out to practice.",
        "source": "T04n0202_010:0419a28_18"
    },
    {
        "source_sentence": "是時須達，遙見世尊，猶如金山，相好威容，儼然炳著，過踰護彌所說萬倍，",
        "translation": "Sudarśana then saw the World-honored One from a distance, resembling a mountain of gold. His good features and majestic appearance were as brilliantly shining as if he were walking in the sky, ten thousand times greater than what Pūrvavideha had said.",
        "source": "T04n0202_010:0419a29_19"
    },
    {
        "source_sentence": "覩之心悅，不知禮法，直問世尊：「不審瞿曇！",
        "translation": "He was delighted, didn't know the rules of propriety, and asked the Bhagavān directly, Not sure, Gautama!",
        "source": "T04n0202_010:0419b02_20"
    },
    {
        "source_sentence": "起居何如？」",
        "translation": "What's the way to get up and stay?",
        "source": "T04n0202_010:0419b03_21"
    },
    {
        "source_sentence": "世尊即時，命令就坐。",
        "translation": "The Bhagavān immediately ordered him to take his seat.",
        "source": "T04n0202_010:0419b03_22"
    },
    {
        "source_sentence": "時首陀會天，遙見須達，雖覩世尊，不知禮拜供養之法，化為四人，行列而來。",
        "translation": "The assembly of the śūdra gods then saw Sudarśana from a distance, and even though they pityed the Bhagavān, they didn't know how to venerate and make offerings, transforming themselves into four people who came in rows.",
        "source": "T04n0202_010:0419b04_23"
    },
    {
        "source_sentence": "到世尊所，接足作禮，長跪問訊，起居輕利，右遶三匝，却住一面。",
        "translation": "When he arrived at the place where the World-honored One was, he touched his feet and made obeisance. Kneeling down to greet him by bowing his forehead [to his feet], he rose in an upright posture, circumambulated him three times to his right, and withdrew to one side.",
        "source": "T04n0202_010:0419b05_24"
    },
    {
        "source_sentence": "是時須達，見其如是，乃為愕然，而自念言：「恭敬之法，事應如是。」",
        "translation": "When Sudarśana saw this, he was startled and thought to himself, Such is the way things should be done with respect for the Dharma.",
        "source": "T04n0202_010:0419b07_25"
    },
    {
        "source_sentence": "即起離坐，如彼禮敬，問訊起居，右遶三匝，却住一面。",
        "translation": "He rose and departed from his seat, paid homage to them, greeted them, got up and stayed there, circumambulated them three times to their right, and withdrew to one side.",
        "source": "T04n0202_010:0419b09_0"
    },
    {
        "source_sentence": "爾時世尊，即為說法，四諦微妙，苦空無常。",
        "translation": "It was then that the Bhagavān taught the Dharma for them, explaining that the four noble truths are subtle, painful, empty, and impermanent.",
        "source": "T04n0202_010:0419b10_1"
    },
    {
        "source_sentence": "聞法歡喜，便染聖法，成須陀洹，譬如淨潔白疊易染為色。",
        "translation": "Rejoicing when he hears the teaching, he then stains the noble teaching and becomes a stream entrant, like a white cloth that's pure and easy to dye as color.",
        "source": "T04n0202_010:0419b11_2"
    },
    {
        "source_sentence": "長跪合掌，問世尊言：「舍衛城中，如我伴輩，聞法易染，更有如我比不？」",
        "translation": "Kneeling down with joined palms, he asked the Bhagavān, Is there anyone in Śrāvastī like me among my companions who hear the Dharma easily dyed?",
        "source": "T04n0202_010:0419b12_3"
    },
    {
        "source_sentence": "佛告須達：「更無有二如卿之者。",
        "translation": "The Buddha told Sudarśana, There are no two more people like you.",
        "source": "T04n0202_010:0419b14_4"
    },
    {
        "source_sentence": "舍衛城中，人多信邪，難染聖教。」",
        "translation": "In Śrāvastī, there are many people who believe in error and can't be influenced by the noble teachings.",
        "source": "T04n0202_010:0419b15_5"
    },
    {
        "source_sentence": "須達白佛：「唯願如來！",
        "translation": "Sudarśana said to the Buddha, Please, Tathāgata!",
        "source": "T04n0202_010:0419b15_6"
    },
    {
        "source_sentence": "垂神降屈，臨履舍衛，使中眾生除邪就正。」",
        "translation": "He bends his spirit down and walks up to Śrāvastī, so that the sentient beings among them will remove what's wrong and become right.",
        "source": "T04n0202_010:0419b16_7"
    },
    {
        "source_sentence": "世尊告曰：「出家之法，與俗有別，住止處所，應當有異，彼無精舍，",
        "translation": "The World-honored One said: There is a distinction between the rules for renunciation and the lay [practices]. Those who remain householders should have different dwelling places, as there are no temples in that country.",
        "source": "T04n0202_010:0419b17_8"
    },
    {
        "source_sentence": "云何得去？」",
        "translation": "How can you leave?",
        "source": "T04n0202_010:0419b18_9"
    },
    {
        "source_sentence": "須達白佛言：「弟子能起，願見聽許。」",
        "translation": "Sudarśana said to the Buddha, If you can get up, I'd like to see and hear it.",
        "source": "T04n0202_010:0419b19_10"
    },
    {
        "source_sentence": "世尊默然。",
        "translation": "The Bhagavān remained silent.",
        "source": "T04n0202_010:0419b20_0"
    },
    {
        "source_sentence": "須達辭往，為兒娶婦。",
        "translation": "Sudarśana departed and married his wife for the sake of her child.",
        "source": "T04n0202_010:0419b20_1"
    },
    {
        "source_sentence": "竟辭佛還家，因白佛言：「還到本國，當立精舍，不知摸法？",
        "translation": "When he left the Buddha and returned home, he said to the Buddha, “Come back to your own country.",
        "source": "T04n0202_010:0419b20_2"
    },
    {
        "source_sentence": "唯願世尊！",
        "translation": "Please, Bhagavān!",
        "source": "T04n0202_010:0419b22_3"
    },
    {
        "source_sentence": "使一弟子共往勅示。」",
        "translation": "I'll cause one of my disciples to go and show it to me.",
        "source": "T04n0202_010:0419b22_4"
    },
    {
        "source_sentence": "世尊思惟：「舍衛城內，婆羅門眾，信邪倒見，餘人往者，必不能辦；",
        "translation": "The World-honored One thought: In the city of Sāvatthī there were many brahmans who believed in heretical theories. Anyone else who came to see them would not be able to do so.",
        "source": "T04n0202_010:0419b22_5"
    },
    {
        "source_sentence": "唯舍利弗，是婆羅門種，少小聰明，神足兼備，去必有益。」",
        "translation": "Only Śāriputra is a Brāhmaṇa of little intelligence and supernormal abilities, and he'll surely benefit from going there.",
        "source": "T04n0202_010:0419b24_6"
    },
    {
        "source_sentence": "即便命之，共須達往。",
        "translation": "He then ordered him to go with Sudarśana.",
        "source": "T04n0202_010:0419b25_7"
    },
    {
        "source_sentence": "須達問言：「世尊足行，日能幾里？」",
        "translation": "Sudarśana asked, Bhagavān, how many miles can you walk each day?",
        "source": "T04n0202_010:0419b26_8"
    },
    {
        "source_sentence": "舍利弗言：「日半由旬，如轉輪王足行之法，世尊亦爾。」",
        "translation": "Śāriputra said, It's like the practice of the wheel-turning king's feet when he walks for half a yojana each day, so does the Bhagavān.",
        "source": "T04n0202_010:0419b27_0"
    },
    {
        "source_sentence": "是時須達，即於道次，二十里，作一客舍，計挍功作，出錢雇之，安止使人，",
        "translation": "At that time Sudarśana built a guesthouse twenty li away from the road, calculating the labor required to build it. He gave him money to hire it and let him live as an envoy.",
        "source": "T04n0202_010:0419b28_1"
    },
    {
        "source_sentence": "飲食敷具，悉皆令足。",
        "translation": "They were provided with food, drink, and bedding to satisfy their needs.",
        "source": "T04n0202_010:0419b29_2"
    },
    {
        "source_sentence": "從王舍城，至舍衛國，還來到舍，共舍利弗，按行諸地，何處平博，中起精舍，",
        "translation": "From the city of Rājagṛha they proceeded to Sāvatthī and came back to their dwelling. Together with Śāriputra, they built a monastery in the middle of the plains wherever they were going.",
        "source": "T04n0202_010:0419c01_3"
    },
    {
        "source_sentence": "按行周遍，無可意處。",
        "translation": "They are pervasive according to their actions, and there's no place where they can think.",
        "source": "T04n0202_010:0419c03_4"
    },
    {
        "source_sentence": "唯王太子祇陀有園，其地平正，其樹欝茂，不遠不近，正得處所。",
        "translation": "Only Prince Jeta, the king’s prince, had a park in which the ground was even and the trees were so luxuriant that it seemed to be neither far away nor near where he could find his place.",
        "source": "T04n0202_010:0419c03_5"
    },
    {
        "source_sentence": "時舍利弗，告須達言：「今此園中，宜起精舍，若遠作之，乞食則難，",
        "translation": "Śāriputra then said to Sudarśana: It is advisable for you to build a monastery in this park. If you do so from a distance it will be difficult to obtain almsfood.",
        "source": "T04n0202_010:0419c05_6"
    },
    {
        "source_sentence": "近處憒鬧，妨廢行道。」",
        "translation": "The nearby place is noisy and obstructs the path of practice.",
        "source": "T04n0202_010:0419c06_7"
    },
    {
        "source_sentence": "須達歡喜，到太子所，白太子言：「我今欲為如來起立精舍，太子園好，",
        "translation": "Delighted, Sudarśana approached the prince and said to him: I now wish to build a monastery for the sake of the Tathāgata.",
        "source": "T04n0202_010:0419c07_8"
    },
    {
        "source_sentence": "今欲買之。」",
        "translation": "Now, I want to buy it.",
        "source": "T04n0202_010:0419c09_0"
    },
    {
        "source_sentence": "太子笑言：「我無所乏，此園茂盛，當用遊戲逍遙散志。」",
        "translation": "The prince smiled and said, I have nothing to lack, for this park is so dense that I'll use it to play freely and scatter my mind.",
        "source": "T04n0202_010:0419c09_1"
    },
    {
        "source_sentence": "須達慇懃乃至再三，太子貪惜。",
        "translation": "Sudarśana and so forth, up to the third time, the prince cherished it.",
        "source": "T04n0202_010:0419c10_2"
    },
    {
        "source_sentence": "「增倍求價，謂呼價貴，當不能買。」",
        "translation": "“Doubling by asking for a price means to call it valuable and won’t buy it.”",
        "source": "T04n0202_010:0419c11_3"
    },
    {
        "source_sentence": "語須達言：「汝若能以黃金布地，令間無空者，便當相與。」",
        "translation": "He said to Sudarśana, If you can spread gold on the ground so there's no space between them, then you'll give it to him.",
        "source": "T04n0202_010:0419c12_4"
    },
    {
        "source_sentence": "須達曰：「諾，聽隨其價。」",
        "translation": "Sudarśana said, Yes, I'll listen according to their price.",
        "source": "T04n0202_010:0419c13_5"
    },
    {
        "source_sentence": "太子祇陀言：「我戲語耳。」",
        "translation": "The prince Jīvaka said, I'll play with words.",
        "source": "T04n0202_010:0419c13_6"
    },
    {
        "source_sentence": "須達白言：「為太子法，不應妄語，妄語欺詐，云何紹繼，撫恤人民？」",
        "translation": "Sudarśana said, For the sake of the prince's teaching, you shouldn't speak falsely; speaking falsely and deceitfully, how can you continue to care for the people?",
        "source": "T04n0202_010:0419c14_7"
    },
    {
        "source_sentence": "即共太子，欲往訟了。",
        "translation": "They then went with the prince and wanted to go there to settle the dispute.",
        "source": "T04n0202_010:0419c16_0"
    },
    {
        "source_sentence": "時首陀會天，以當為佛起精舍故，恐諸大臣偏為太子，即化作一人，下為評詳。",
        "translation": "At the time, the Śuddhodana assembly gods were afraid that they would build a monastery for the Buddha because they feared the ministers would be partial princes, so they transformed themselves into one person and wrote a detailed commentary below.",
        "source": "T04n0202_010:0419c16_1"
    },
    {
        "source_sentence": "語太子言：「夫太子法，不應妄語，已許價決，不宜中悔。」",
        "translation": "He said to the prince, The prince's teaching is that you shouldn't speak falsely; you've agreed on a price and won't regret it.",
        "source": "T04n0202_010:0419c18_2"
    },
    {
        "source_sentence": "遂斷與之。",
        "translation": "He then cut it off and gave it to him.",
        "source": "T04n0202_010:0419c19_3"
    },
    {
        "source_sentence": "須達歡喜，便勅使人：「象負金出。」",
        "translation": "Rejoicing, Sudarśana then instructed his messengers, An elephant carrying gold comes out.",
        "source": "T04n0202_010:0419c19_4"
    },
    {
        "source_sentence": "八十頃中，須臾欲滿，殘有少地。",
        "translation": "In the eighty-hour period, as soon as he wishes to fulfill it, there's a little bit of earth left.",
        "source": "T04n0202_010:0419c20_5"
    },
    {
        "source_sentence": "須達思惟：「何藏金足？",
        "translation": "Sudarśana thought, What stores the gold feet?",
        "source": "T04n0202_010:0419c21_6"
    },
    {
        "source_sentence": "不多不少，當取滿足。」",
        "translation": "Not many and not many, you'll take it and fulfill it.",
        "source": "T04n0202_010:0419c21_7"
    },
    {
        "source_sentence": "祇陀問言：「嫌貴置之。」",
        "translation": "Jeta asked, What's the value of stopping it?",
        "source": "T04n0202_010:0419c22_8"
    },
    {
        "source_sentence": "答言：「不也。",
        "translation": "He replied, No.",
        "source": "T04n0202_010:0419c23_0"
    },
    {
        "source_sentence": "自念金藏，何者可足？",
        "translation": "He thought to himself, “What store of gold is sufficient for me?",
        "source": "T04n0202_010:0419c23_1"
    },
    {
        "source_sentence": "當補滿耳。」",
        "translation": "You'll be able to fill it up.",
        "source": "T04n0202_010:0419c23_2"
    },
    {
        "source_sentence": "祇陀念言：「佛必大德，乃使斯人輕寶乃爾？」",
        "translation": "Jeta thought, The Buddha must be a great virtuous man, so why would he allow this person to despise the treasure?",
        "source": "T04n0202_010:0419c24_3"
    },
    {
        "source_sentence": "教齊是止！",
        "translation": "Teaching is the same as stopping!",
        "source": "T04n0202_010:0419c25_4"
    },
    {
        "source_sentence": "「勿更出金，園地屬卿，樹木屬我，我自上佛，共立精舍。」",
        "translation": "Don't produce any more gold; the park belongs to you, the trees and trees belong to me, and I am the Buddha who built the monastery together.",
        "source": "T04n0202_010:0419c25_5"
    },
    {
        "source_sentence": "須達歡喜，即然可之，即便歸家，當施功作。",
        "translation": "Sudarśana rejoiced, approved of it, and immediately returned home to perform the meritorious service.",
        "source": "T04n0202_010:0419c26_6"
    },
    {
        "source_sentence": "六師聞之，往白國王：「長者須達，買祇陀園，欲為瞿曇沙門興立精舍。",
        "translation": "When the six teachers heard this, they went to tell the king of the country, The elder Sudarśana bought the Jetavana Garden and wanted to build a monastery for the ascetic Gautama.",
        "source": "T04n0202_010:0419c27_7"
    },
    {
        "source_sentence": "聽我徒眾與共捔術，沙門得勝，便聽起立，若其不如，不得起也。",
        "translation": "He listened to my disciples who were engaged in a dispute with each other, and when the ascetic was victorious, he heard me get up and stood up. If he didn't, he couldn't get up.",
        "source": "T04n0202_010:0419c29_8"
    },
    {
        "source_sentence": "瞿曇徒眾，住王舍城，我等徒眾，當住於此。」",
        "translation": "The Gautama disciples will stay in Rājagṛha, and we disciples will stay here.",
        "source": "T04n0202_010:0420a02_9"
    },
    {
        "source_sentence": "王召須達，而問之言：「今此六師云，卿買祇陀園，欲為瞿曇沙門起立精舍，",
        "translation": "The king summoned Sudarśana and asked him, “These six teachers now tell me that you have purchased the Jetavana Garden in order to build a monastery for the śramaṇa Gautama.",
        "source": "T04n0202_010:0420a03_10"
    },
    {
        "source_sentence": "求共沙門弟子捔其伎術，若得勝者，得立精舍，苟其不如，便不得起。」",
        "translation": "Seeking to share with an ascetic disciple to see his skillful means, if he wins, he'll be allowed to build a monastery, but if he doesn't, then he won't get up.",
        "source": "T04n0202_010:0420a04_11"
    },
    {
        "source_sentence": "須達歸家，著垢膩衣，愁惱不樂。",
        "translation": "Sudarśana returned home, wearing dirty and greasy clothes, grieved and unhappy.",
        "source": "T04n0202_010:0420a06_12"
    },
    {
        "source_sentence": "時舍利弗，明日到時，著衣持鉢，至須達家。",
        "translation": "When Śāriputra arrived on the morning, he put on his robe and bowl and went to Sudarśana's house.",
        "source": "T04n0202_010:0420a07_13"
    },
    {
        "source_sentence": "見其不樂，即問之曰：「何故不樂？」",
        "translation": "Seeing that he wasn't happy, he asked him, Why isn't it happy?",
        "source": "T04n0202_010:0420a08_14"
    },
    {
        "source_sentence": "須達答言：「所立精舍，但恐不成，是故愁耳。」",
        "translation": "Sudarśana replied, I'm afraid the monastery that was built won't be built; therefore, I'm sad.",
        "source": "T04n0202_010:0420a09_15"
    },
    {
        "source_sentence": "舍利弗言：「有何事故，畏不成就？」",
        "translation": "Śāriputra said, What's the matter with fear that it won't be accomplished?",
        "source": "T04n0202_010:0420a10_16"
    },
    {
        "source_sentence": "答言：「今諸六師，詣王求挍，尊人得勝，聽立精舍，若其不如，遮不聽起。",
        "translation": "They replied, Now, the six masters are going to the king to seek a dispute, and the venerable one who won the victory will be allowed to build a monastery, but if he doesn't, they won't allow him to get up.",
        "source": "T04n0202_010:0420a11_17"
    },
    {
        "source_sentence": "此六師輩，出家來久，精誠有素，所學技術，無能及者；",
        "translation": "These six śramaṇas and brāhmaṇas had renounced the householder’s life a long time ago. All of them were sincere and upright, and there was no one who could surpass them in their learning.",
        "source": "T04n0202_010:0420a12_18"
    },
    {
        "source_sentence": "我今不知，尊人伎藝，能與捔不？」",
        "translation": "Now, I don't know whether the venerable man of arts and crafts can give me a dispute.",
        "source": "T04n0202_010:0420a14_19"
    },
    {
        "source_sentence": "舍利弗言：「正使此輩六師之眾，滿閻浮提，數如竹林，不能動吾足上一毛。",
        "translation": "Śāriputra said, It's precisely because these six teachers of the assembly filled Jambudvīpa like bamboo forests that they couldn't move a hair on my feet.",
        "source": "T04n0202_010:0420a14_20"
    },
    {
        "source_sentence": "欲捔何等，自恣聽之。」",
        "translation": "What's the point of wanting to hear it, so listen freely.",
        "source": "T04n0202_010:0420a16_21"
    },
    {
        "source_sentence": "須達歡喜，更著新衣，沐浴香湯，即往白王：「我已問之，六師欲捔，",
        "translation": "Rejoicing, Sudarśana put on his new clothes and bathed in scented warm water. Then he went to the king and said:",
        "source": "T04n0202_010:0420a17_22"
    },
    {
        "source_sentence": "恣隨其意。」",
        "translation": "He'll do as he wishes.",
        "source": "T04n0202_010:0420a18_23"
    },
    {
        "source_sentence": "國王是時，告諸六師：「今聽汝等共沙門捔。」",
        "translation": "At the time, the king of the country told the six masters, Now, I'll listen to you and the ascetics who joined him.",
        "source": "T04n0202_010:0420a19_0"
    },
    {
        "source_sentence": "是時六師，宣語國人：「却後七日，當於城外寬博之處，與沙門挍。」",
        "translation": "The six teachers then proclaimed to the people of the country, Seven days from now, he'll be outside the city in a wide area and fight with the ascetic.",
        "source": "T04n0202_010:0420a20_1"
    },
    {
        "source_sentence": "舍衛國中，十八億人，時彼國法，擊鼓會眾，若擊銅鼓，八億人集，若打銀鼓，",
        "translation": "In the country of Sāvatthī there were eighteen billion in number. According to the law of that country, if one playeds a brass drum or beats a copper drum, eight billion people would assemble; and if one beats a silver drum, they would all gather together into one great assembly.",
        "source": "T04n0202_010:0420a21_2"
    },
    {
        "source_sentence": "十四億集，若打金鼓，一切皆集，七日期滿，至平博處，打擊金鼓，一切都集，",
        "translation": "If he beats a golden drum, they all gather together. When the seventh day is over, he reaches a square place and strikes a golden drum. All of them gather together.",
        "source": "T04n0202_010:0420a23_3"
    },
    {
        "source_sentence": "六師徒眾，有三億人。",
        "translation": "There were 300 million disciples of the six teachers.",
        "source": "T04n0202_010:0420a25_4"
    },
    {
        "source_sentence": "是時人民，悉為國王及其六師，敷施高座。",
        "translation": "The people then prepared a high seat for the king and his six teachers.",
        "source": "T04n0202_010:0420a25_5"
    },
    {
        "source_sentence": "爾時須達，為舍利弗而施高座。",
        "translation": "It was then that Sudarśana gave a high seat to Śāriputra.",
        "source": "T04n0202_010:0420a26_6"
    },
    {
        "source_sentence": "時舍利弗，在一樹下，寂然入定，諸根寂默，遊諸禪定，通達無礙，而作是念：「此會大眾，",
        "translation": "Śāriputra, who was seated at the foot of a tree, quietly entered concentration. His faculties were tranquil and he engaged in meditation without hindrance. He had this thought:",
        "source": "T04n0202_010:0420a27_7"
    },
    {
        "source_sentence": "習邪來久，憍慢自高，草芥群生，當以何德而降伏之？」",
        "translation": "For a long time since they've cultivated wrongdoing, they've been arrogant and arrogant, and what virtue will the grass and mustard seeds of sentient beings use to subdue them?",
        "source": "T04n0202_010:0420a29_8"
    },
    {
        "source_sentence": "思惟是已，當以二德，即立誓言：「若我無數劫中，慈孝父母、敬尚沙門婆羅門者，",
        "translation": "After reflecting on this, you should make a vow based on two virtues, saying, “If for countless eons I were to be compassionate to my parents and venerate the śramaṇas and brāhmaṇas,",
        "source": "T04n0202_010:0420b01_9"
    },
    {
        "source_sentence": "我初入會，一切大眾，當為我禮。」",
        "translation": "When I first enter the assembly, all the people will bow to me.",
        "source": "T04n0202_010:0420b03_10"
    },
    {
        "source_sentence": "爾時六師，見眾已集，而舍利弗獨未來到，便白王言：「瞿曇弟子，自知無術，",
        "translation": "When the six teachers saw that the assembly had already assembled, Śāriputra came alone in the future and said to the king, “Your majesty, disciple of the Gautama, know that you have no skillful means.",
        "source": "T04n0202_010:0420b04_11"
    },
    {
        "source_sentence": "偽求挍能，眾會既集，怖畏不來。」",
        "translation": "They falsely seek to be able, but when the assembly is assembled, they're afraid and won't come.",
        "source": "T04n0202_010:0420b06_12"
    },
    {
        "source_sentence": "王告須達：「汝師弟子，挍時已至，宜來談論。」",
        "translation": "The king told Sudarśana, Your teacher's disciple, it's time for you to come and discuss it.",
        "source": "T04n0202_010:0420b07_13"
    },
    {
        "source_sentence": "是時須達，至舍利弗所，長跪白言：「大德！",
        "translation": "Sudarśana then went to Śāriputra and knelt down long enough to say, Mañjuśrī!",
        "source": "T04n0202_010:0420b08_14"
    },
    {
        "source_sentence": "大眾已集，願來詣會。」",
        "translation": "The masses have assembled, so may they come to the assembly.",
        "source": "T04n0202_010:0420b09_15"
    },
    {
        "source_sentence": "時舍利弗，從禪定起，更整衣服，以尼師壇，著左肩上，徐庠而步，如師子王，",
        "translation": "Śāriputra then rose from his meditation, adjusted his clothes, placed the nun’s altar on his left shoulder, and walked slowly like a lion.",
        "source": "T04n0202_010:0420b09_16"
    },
    {
        "source_sentence": "往詣大眾。",
        "translation": "He went to the masses.",
        "source": "T04n0202_010:0420b11_17"
    },
    {
        "source_sentence": "是時眾人，見其形容法服有異，及諸六師，忽然起立，如風靡草，不覺為禮。",
        "translation": "When the crowd saw that his appearance and manner of dress differed from those of the Buddha, the six teachers stood up suddenly like a wind blowing through the grass without knowing how to pay homage.",
        "source": "T04n0202_010:0420b11_18"
    },
    {
        "source_sentence": "時舍利弗便昇須達所敷之座。",
        "translation": "Śāriputra then ascended to the seat spread out by Sudarśana.",
        "source": "T04n0202_010:0420b13_19"
    },
    {
        "source_sentence": "六師眾中，有一弟子，名勞度差，善知幻術，於大眾前，呪作一樹，自然長大，",
        "translation": "Among the six teachers, there was a disciple named Sadāparibhūta, well versed in magic tricks. In front of the great assembly he magically created a tree and it grew up naturally.",
        "source": "T04n0202_010:0420b14_20"
    },
    {
        "source_sentence": "蔭覆眾會，枝葉欝茂，花果各異。",
        "translation": "It shaded the assembly and its branches and leaves were luxuriant, with different flowers and fruits.",
        "source": "T04n0202_010:0420b15_21"
    },
    {
        "source_sentence": "眾人咸言：「此變乃是勞度差作。」",
        "translation": "The people all said, This transformation is the result of labor and error.",
        "source": "T04n0202_010:0420b16_22"
    },
    {
        "source_sentence": "時舍利弗，便以神力，作旋嵐風，吹拔樹根，倒著於地，碎為微塵。",
        "translation": "Śāriputra then, using his supernormal powers, created a swirling wind that uprooted the roots of the tree and tumbled them to the ground, crushing them into dust.",
        "source": "T04n0202_010:0420b17_23"
    },
    {
        "source_sentence": "眾人皆言：「舍利弗勝！",
        "translation": "The people all said, Śāriputra!",
        "source": "T04n0202_010:0420b18_24"
    },
    {
        "source_sentence": "今勞度差，便為不如。」",
        "translation": "Now, it's not as good as the difference between labor and liberation.",
        "source": "T04n0202_010:0420b19_25"
    },
    {
        "source_sentence": "又復呪作一池，其池四面，皆以七寶，池水之中，生種種華。",
        "translation": "Again, he casts a spell to create a pond that has seven treasures on each of its four sides and various flowers grow in the water.",
        "source": "T04n0202_010:0420b19_26"
    },
    {
        "source_sentence": "眾人咸言：「是勞度差之所作也。」",
        "translation": "The people all said, This is the work of labor and error.",
        "source": "T04n0202_010:0420b21_27"
    },
    {
        "source_sentence": "時舍利弗，化作一大六牙白象，其一牙上，有七蓮花，一一花上，有七玉女，",
        "translation": "Śāriputra then transformed himself into a large white elephant with sixteen tusks. On each of his tusks were seven lotus flowers, and on each flower there were seven jadelike maidens.",
        "source": "T04n0202_010:0420b21_28"
    },
    {
        "source_sentence": "其象徐庠，往詣池邊，并含其水，池即時滅。",
        "translation": "The elephant climbed slowly and went to the edge of the pond, where it contained the water. The pond immediately disappeared.",
        "source": "T04n0202_010:0420b23_29"
    },
    {
        "source_sentence": "眾人悉言：「舍利弗勝！",
        "translation": "The people all said, Śāriputra!",
        "source": "T04n0202_010:0420b24_30"
    },
    {
        "source_sentence": "勞度差不如。」",
        "translation": "The difference between labor and liberation is not as good as that.",
        "source": "T04n0202_010:0420b25_31"
    },
    {
        "source_sentence": "復作一山，七寶莊嚴，泉池樹木，花果茂盛。",
        "translation": "They also built a mountain of the seven kinds of treasure, adorned with fountains, ponds, trees, and abundant flowers and fruit.",
        "source": "T04n0202_010:0420b25_32"
    },
    {
        "source_sentence": "眾人咸言：「此是勞度差作。」",
        "translation": "The people all said, This is the work of labor and error.",
        "source": "T04n0202_010:0420b26_33"
    },
    {
        "source_sentence": "時舍利弗，即便化作金剛力士，以金剛杵，遙用指之，山即破壞，無有遺餘。",
        "translation": "Śāriputra then transformed himself into a vajra warrior and pointed at him from a distance with his vajra, causing the mountain to disintegrate without remainder.",
        "source": "T04n0202_010:0420b27_34"
    },
    {
        "source_sentence": "眾會皆言：「舍利弗勝！",
        "translation": "The assembled people all said, Śāriputra!",
        "source": "T04n0202_010:0420b28_35"
    },
    {
        "source_sentence": "勞度差不如。」",
        "translation": "The difference between labor and liberation is not as good as that.",
        "source": "T04n0202_010:0420b29_36"
    },
    {
        "source_sentence": "復作一龍，身有十頭，於虛空中，雨種種寶，雷電振地，驚動大眾。",
        "translation": "Again, he created a dragon with ten heads in his body that rained various treasures from the sky and shook the earth with thunder and lightning, terrifying the crowd.",
        "source": "T04n0202_010:0420b29_37"
    },
    {
        "source_sentence": "眾人咸言：「此亦勞度差作。」",
        "translation": "The people all said, This is also a labor of salvation.",
        "source": "T04n0202_010:0420c02_38"
    },
    {
        "source_sentence": "時舍利弗，便化作一金翅鳥王，擘裂噉之。",
        "translation": "Śāriputra then transformed himself into a king of the garuḍas with golden wings and broke them open.",
        "source": "T04n0202_010:0420c03_39"
    },
    {
        "source_sentence": "眾人皆言：「舍利弗勝！",
        "translation": "The people all said, Śāriputra!",
        "source": "T04n0202_010:0420c04_40"
    },
    {
        "source_sentence": "勞度差不如。」",
        "translation": "The difference between labor and liberation is not as good as that.",
        "source": "T04n0202_010:0420c04_41"
    },
    {
        "source_sentence": "復作一牛，身體高大，肥壯多力，麤脚利角，爮地大吼，奔突來前。",
        "translation": "Again, he made a cow whose body was tall and big in stature. It was fat and powerful with strong legs and sharp horns. The hoarse oars roared on the ground and came running before him.",
        "source": "T04n0202_010:0420c04_42"
    },
    {
        "source_sentence": "時舍利弗，化作師子王，分裂食之。",
        "translation": "Śāriputra then transformed himself into the lion king and ate it separately.",
        "source": "T04n0202_010:0420c06_43"
    },
    {
        "source_sentence": "眾人言曰：「舍利弗勝！",
        "translation": "The crowd said, Śāriputra!",
        "source": "T04n0202_010:0420c07_44"
    },
    {
        "source_sentence": "勞度差不如。」",
        "translation": "The difference between labor and liberation is not as good as that.",
        "source": "T04n0202_010:0420c07_45"
    },
    {
        "source_sentence": "復變其身，作夜叉鬼，形體長大，頭上火燃，目赤如血，四牙長利，口自出火，",
        "translation": "They also transformed their bodies into the forms of yakṣa ghosts. Their bodies grew in stature, with fire blazing on their heads and eyes as red as blood. With four tusks long and sharp, they emerged like flames from their mouths.",
        "source": "T04n0202_010:0420c08_0"
    },
    {
        "source_sentence": "騰躍奔赴。",
        "translation": "They rise up and run away.",
        "source": "T04n0202_010:0420c09_1"
    },
    {
        "source_sentence": "時舍利弗，自化其身，作毘沙門王，夜叉恐怖，即欲退走，四面火起，",
        "translation": "Śāriputra then transformed himself into Vaiśravaṇa and became king of the yakṣas. Fearful, the yakṣas were about to retreat and run away.",
        "source": "T04n0202_010:0420c10_2"
    },
    {
        "source_sentence": "無有去處。",
        "translation": "There's no place to go.",
        "source": "T04n0202_010:0420c11_3"
    },
    {
        "source_sentence": "唯舍利弗邊，涼冷無火，即時屈伏，五體投地，求哀脫命。",
        "translation": "Only at the side of Śāriputra, cool and without fire, he was immediately subdued and prostrated with five bodies to the ground, crying out in pity for his life.",
        "source": "T04n0202_010:0420c11_4"
    },
    {
        "source_sentence": "辱心已生，火即還滅。",
        "translation": "Once the feeling of shame has arisen, the fire goes out.",
        "source": "T04n0202_010:0420c13_5"
    },
    {
        "source_sentence": "眾咸唱言：「舍利弗勝！",
        "translation": "The crowd all called out, Śāriputra!",
        "source": "T04n0202_010:0420c13_6"
    },
    {
        "source_sentence": "勞度差不如。」",
        "translation": "The difference between labor and liberation is not as good as that.",
        "source": "T04n0202_010:0420c14_7"
    },
    {
        "source_sentence": "時舍利弗，身昇虛空，現四威儀，行住坐臥，身上出水，身下出火，東沒西踊，",
        "translation": "Śāriputra then rose up into the air and manifested four kinds of deportment, walking, standing, sitting, and lying down. Water poured forth from his body, fire came forth from beneath his body, and stamped out in the east and west.",
        "source": "T04n0202_010:0420c14_8"
    },
    {
        "source_sentence": "西沒東踊，北沒南踊，南沒北踊，或現大身，滿虛空中，而復現小，或分一身，",
        "translation": "They may appear as large bodies filling the sky, or they may appear as small bodies. Or they may be divided into two:",
        "source": "T04n0202_010:0420c16_9"
    },
    {
        "source_sentence": "作百千萬億身，還合為一身，於虛空中，忽然在地，履地如水，履水如地。",
        "translation": "He made a hundred thousand myriad of koṭis of bodies and combined them into one body. Suddenly he landed in midair, treading on the ground like water and on the water like earth.",
        "source": "T04n0202_010:0420c18_10"
    },
    {
        "source_sentence": "作是變已，還攝神足，坐其本座。",
        "translation": "After he had done this transformation, he returned with his spiritual feet and sat down on his original seat.",
        "source": "T04n0202_010:0420c19_11"
    },
    {
        "source_sentence": "時會大眾，見其神力，咸懷歡喜。",
        "translation": "At that time the assembly was greatly delighted to see his miraculous powers.",
        "source": "T04n0202_010:0420c20_12"
    },
    {
        "source_sentence": "時舍利弗，即為說法，隨其本行宿福因緣，各得道迹，或得須陀洹、斯陀含、阿那含、阿羅漢者，",
        "translation": "Śāriputra then taught the Dharma to them. According to the causes and conditions of their former good deeds, each attained the path; some became stream-enterers, some once-returners, some renunciants, some anāgāmins, and some arhats.",
        "source": "T04n0202_010:0420c21_13"
    },
    {
        "source_sentence": "六師徒眾，三億弟子，於舍利弗所，出家學道。",
        "translation": "The six teachers and their followers, three hundred million disciples, renounced the householder’s life in Śāriputra’s place to study the path under him.",
        "source": "T04n0202_010:0420c23_14"
    },
    {
        "source_sentence": "挍技訖已，四眾便罷，各還所止。",
        "translation": "After the match was over, the fourfold assembly departed and returned to their respective places.",
        "source": "T04n0202_010:0420c24_15"
    },
    {
        "source_sentence": "長者須達，共舍利弗，往圖精舍，須達手自捉繩一頭，時舍利弗自捉一頭，",
        "translation": "The householder Sudarśana went with Śāriputra to the monastery. Sudarśana grabbed one piece of the rope in his hand and Śāriputra caught it himself.",
        "source": "T04n0202_010:0420c25_16"
    },
    {
        "source_sentence": "共經精舍。",
        "translation": "He shared the sūtras with the monastery.",
        "source": "T04n0202_010:0420c27_17"
    },
    {
        "source_sentence": "時舍利弗，欣然含笑。",
        "translation": "Śāriputra then smiled joyfully and laughed.",
        "source": "T04n0202_010:0420c27_18"
    },
    {
        "source_sentence": "須達問言：「尊人何笑？」",
        "translation": "Sudarśana asked, What's the Bhagavān laughing at?",
        "source": "T04n0202_010:0420c28_19"
    },
    {
        "source_sentence": "答言：「汝始於此經地，六欲天中，宮殿已成。」",
        "translation": "He replied, At the beginning of this sūtra, you're in the six heavens of desire where the palace has been completed.",
        "source": "T04n0202_010:0420c28_20"
    },
    {
        "source_sentence": "即借道眼，須達悉見六欲天中嚴淨宮殿，問舍利弗：「是六欲天，何處最樂？」",
        "translation": "He then borrowed the eye of the path, and Sudarśana saw the pure palace in the six heavens of desire and asked Śāriputra, Where's the most pleasant place in the six heavens of desire?",
        "source": "T04n0202_010:0420c29_21"
    },
    {
        "source_sentence": "舍利弗言：「下三天中，色欲深厚，上二天中，憍逸自恣，第四天中，",
        "translation": "Śāriputra said: The gods in the lower three heavens have deep sexual passion. In the upper two heavens they indulge in sexual misconduct freely, while in the fourth heaven there is no sexual misconduct.",
        "source": "T04n0202_010:0421a02_22"
    },
    {
        "source_sentence": "少欲知足，恒有一生補處菩薩，來生其中，法訓不絕。」",
        "translation": "With few desires and contentment, there's always a bodhisattva in the first birthplace who comes to be born among them and teaches the Dharma without stopping.",
        "source": "T04n0202_010:0421a03_23"
    },
    {
        "source_sentence": "須達言曰：「我正當生第四天上。」",
        "translation": "Sudarśana said, I'll be born in the fourth heaven.",
        "source": "T04n0202_010:0421a05_0"
    },
    {
        "source_sentence": "出言已竟，餘宮悉滅，唯第四天宮殿湛然。",
        "translation": "After he finished speaking, the other palaces all ceased, except for the fourth heavenly palace, which was perfectly stilled.",
        "source": "T04n0202_010:0421a05_1"
    },
    {
        "source_sentence": "復更從繩，時舍利弗，慘然憂色。",
        "translation": "When he again came down from the rope, Śāriputra looked sad and distressed.",
        "source": "T04n0202_010:0421a06_2"
    },
    {
        "source_sentence": "即問尊者：「何故憂色？」",
        "translation": "He then asked the venerable, Why are you sad?",
        "source": "T04n0202_010:0421a07_3"
    },
    {
        "source_sentence": "答言：「汝今見此地中蟻子不耶？」",
        "translation": "He replied, Do you see the ants in this place now?",
        "source": "T04n0202_010:0421a07_4"
    },
    {
        "source_sentence": "對曰：「已見。」",
        "translation": "He replied, I've seen it.",
        "source": "T04n0202_010:0421a08_5"
    },
    {
        "source_sentence": "時舍利弗，語須達言：「汝於過去毘婆尸佛，亦於此地，為彼世尊起立精舍，",
        "translation": "Śāriputra then said to Sudarśana: In the past, when Vipaśyin Buddha was still alive, you built a monastery here for him.",
        "source": "T04n0202_010:0421a08_6"
    },
    {
        "source_sentence": "而此蟻子在此中生。",
        "translation": "But this  ant child is born here.",
        "source": "T04n0202_010:0421a10_7"
    },
    {
        "source_sentence": "尸棄佛時，汝為彼佛，亦於是中造立精舍，而此蟻子亦在中生。",
        "translation": "At the time of Śikhin Buddha, you built a temple there for that Buddha and these ants were born there as well.",
        "source": "T04n0202_010:0421a11_8"
    },
    {
        "source_sentence": "毘舍浮佛時，汝為世尊，於此地中起立精舍，而此蟻子亦在中生。",
        "translation": "At the time of Vaiśravaṇa Buddha, you were the Bhagavān, setting up a temple in this place, and these ants were also born there.",
        "source": "T04n0202_010:0421a12_9"
    },
    {
        "source_sentence": "拘留秦佛時，亦為世尊，在此地中起立精舍，而是蟻子亦於此中生。",
        "translation": "At the time of Krakucchanda Buddha, he was also the Bhagavān who built a temple in this place, but the ants and children were also born here.",
        "source": "T04n0202_010:0421a14_10"
    },
    {
        "source_sentence": "拘那含牟尼佛時，汝為世尊，於此地中起立精舍，而此蟻子亦在中生。",
        "translation": "At the time of Kanakamuni Buddha, you were the Bhagavān when you built a temple in this place, and this  ant child was also born there.",
        "source": "T04n0202_010:0421a15_11"
    },
    {
        "source_sentence": "迦葉佛時，汝亦為佛，於此地中起立精舍，而此蟻子亦在中生。",
        "translation": "At the time of Kāśyapa Buddha, you were also a buddha, setting up a temple in this place, and this  ant child was born there.",
        "source": "T04n0202_010:0421a17_12"
    },
    {
        "source_sentence": "乃至今日，九十一劫，受一種身，不得解脫。",
        "translation": "Today, for ninety-one eons, they'll experience one kind of body and won't be liberated.",
        "source": "T04n0202_010:0421a19_13"
    },
    {
        "source_sentence": "生死長遠，唯福為要，不可不種。」",
        "translation": "Birth and death are long-lasting, but merit is the only thing that matters; they can't be planted without it.",
        "source": "T04n0202_010:0421a20_14"
    },
    {
        "source_sentence": "是時須達，悲怜愍傷。",
        "translation": "At the time, Sudarśana was grieved and saddened.",
        "source": "T04n0202_010:0421a20_15"
    },
    {
        "source_sentence": "經地已竟，起立精舍，為佛作窟，以妙栴檀，用為香泥，別房住止，千二百處，",
        "translation": "After the earth had been crossed, they built a monastery for the Buddha and made caves for him. They poured fine sandalwood into fragrant mud to make separate dwelling-houses one thousand two hundred in each direction.",
        "source": "T04n0202_010:0421a21_16"
    },
    {
        "source_sentence": "凡百二十處，別打犍椎。",
        "translation": "Where there are one hundred and twenty places, he strikes the gandharva separately.",
        "source": "T04n0202_010:0421a23_17"
    },
    {
        "source_sentence": "施設已竟，欲往請佛，復自思惟：「上有國王，應當令知，若不啟白，",
        "translation": "Having set up the monastery, he wished to go and invite the Buddha. Again, he thought to himself: The king of the country above should let me know.",
        "source": "T04n0202_010:0421a23_18"
    },
    {
        "source_sentence": "儻有瞋恨。」",
        "translation": "I'm angry and hateful.",
        "source": "T04n0202_010:0421a25_19"
    },
    {
        "source_sentence": "即往白王：「我為世尊，已起精舍，唯願大王！",
        "translation": "He went to the king and said, Bhagavān, I've built a monastery, but please, great king!",
        "source": "T04n0202_010:0421a25_20"
    },
    {
        "source_sentence": "遣使請佛。」",
        "translation": "I'll send an envoy to invite the Buddha.",
        "source": "T04n0202_010:0421a26_21"
    },
    {
        "source_sentence": "時王聞已，即遣使者，詣王舍城，請佛及僧：「唯願世尊！",
        "translation": "After hearing this, the king sent an envoy to the city of Rājagṛha and invited the Buddha and the saṃgha, Please, Bhagavān!",
        "source": "T04n0202_010:0421a26_22"
    },
    {
        "source_sentence": "臨覆舍衛。」",
        "translation": "He's approaching Śrāvastī.",
        "source": "T04n0202_010:0421a28_23"
    },
    {
        "source_sentence": "爾時世尊，與諸四眾，前後圍遶，放大光明震動大地，至舍衛國，所經客舍，",
        "translation": "At that time the World-honored One, surrounded by the fourfold assembly, emanating great beams of light and shaking the earth with trembling thunder, arrived at Sāvatthī.",
        "source": "T04n0202_010:0421a28_24"
    },
    {
        "source_sentence": "悉於中止，道次度人，無有限量，漸漸來近舍衛城邊，一切大眾，持諸供具，",
        "translation": "They all came gradually to the edge of Śrāvastī. All the monks and nuns in the great assembly, carrying provisions [for the relics], approached the monastery.",
        "source": "T04n0202_010:0421b01_25"
    },
    {
        "source_sentence": "迎待世尊。",
        "translation": "They greeted the Bhagavān.",
        "source": "T04n0202_010:0421b03_26"
    },
    {
        "source_sentence": "世尊到國，至廣博處，放大光明，遍照三千大千世界，足指按地，地皆震動，",
        "translation": "When the World-honored One arrived in that kingdom, he reached a vast expanse of ground and emanated a great ray of light which shone throughout the entire trichiliocosm. The earth trembled as his toes touched the ground.",
        "source": "T04n0202_010:0421b03_27"
    },
    {
        "source_sentence": "城中伎樂，不鼓自鳴，盲視聾聽，啞語僂申，癃[病-丙+淺]拘癖，",
        "translation": "In the city music and dances are performed spontaneously without drums or bells, while the blind and deaf watch and listen. The dumb cries out in a crouching voice and the coarse and dumb people suffer from hunger and thirst.",
        "source": "T04n0202_010:0421b05_28"
    },
    {
        "source_sentence": "皆得具足。",
        "translation": "They'll all attain their fulfillment.",
        "source": "T04n0202_010:0421b06_29"
    },
    {
        "source_sentence": "一切人民男女大小，覩斯瑞應，歡喜踊躍，來詣佛所，十八億人，都悉集聚。",
        "translation": "All the people, men and women alike, large and small, saw this miraculous sign and rejoiced in joy. They came to the Buddha’s presence with great joy. Eighty-eight koṭis of people gathered there.",
        "source": "T04n0202_010:0421b06_30"
    },
    {
        "source_sentence": "爾時世尊，隨病投藥，為說妙法，宿緣所應，各得道迹，有得須陀洹、斯陀含、阿那含、阿羅漢者，",
        "translation": "At that time the World-honored One prescribed medicine for his illness and explained the sublime Dharma to them. According to the conditions of their former existences, they each found the traces of enlightenment. There are those who have attained stream-entry, once-returning, non-returning, and arhatship.",
        "source": "T04n0202_010:0421b08_31"
    },
    {
        "source_sentence": "有種辟支佛因緣者，有發無上正真道意者，各各歡喜，奉行佛語。",
        "translation": "Those who cultivate the causes and conditions of a pratyekabuddha and those who give rise to the intention for the unsurpassed true path will each rejoice and follow the Buddha's words.",
        "source": "T04n0202_010:0421b10_32"
    },
    {
        "source_sentence": "佛告阿難：「今此園地，須達所買，林樹華菓，祇陀所有，二人同心，",
        "translation": "The Buddha said to Ānanda: At this park, which Sudarśana had purchased, there are trees, flowers, and fruit in the forest that were all owned by Jeta.",
        "source": "T04n0202_010:0421b12_33"
    },
    {
        "source_sentence": "共立精舍，應當與號太子祇樹給孤獨園，名字流布，傳示後世。」",
        "translation": "Together, they should build a monastery and give it to the prince named Jeta's Grove or Anāthapiṇḍada Park, whose names will spread and be transmitted to future generations.",
        "source": "T04n0202_010:0421b13_34"
    },
    {
        "source_sentence": "爾時阿難，及四部眾，聞佛所說，頂戴奉行。",
        "translation": "At that time Ānanda and the fourfold assembly, having heard the Buddha’s exhortation, bowed their heads in reverence and remembered it well.",
        "source": "T04n0202_010:0421b15_35"
    },
    {
        "source_sentence": "（四九）◎大光明始發無上心品第四十二(丹本為四十七)",
        "translation": "(49) - Chapter 48 of the Great Light that First Awakens the Unexcelled Mind (The Dan edition is forty-seven)",
        "source": "T04n0202_010:0421b17_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在羅閱祇迦蘭陀竹園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Rājagṛha’s Kalandaka Bamboo Grove.",
        "source": "T04n0202_010:0421b18_0"
    },
    {
        "source_sentence": "爾時阿難，在林樹間，靜坐思惟，欻生此念：「如來正覺，諸根具足，",
        "translation": "At that time Ānanda was sitting quietly among the trees in the forest, meditating. Suddenly he thought to himself:",
        "source": "T04n0202_010:0421b19_0"
    },
    {
        "source_sentence": "功德慧明，殊妙難量。",
        "translation": "Their merit, wisdom, and insight are so marvelous and immeasurable that they cannot be measured.",
        "source": "T04n0202_010:0421b20_1"
    },
    {
        "source_sentence": "世尊先昔，本何因緣，發此大乘無上之心？",
        "translation": "Bhagavān, what were the causes and conditions that gave rise to this unsurpassed mind of the great vehicle in the past?",
        "source": "T04n0202_010:0421b21_0"
    },
    {
        "source_sentence": "修習何事，而得如是勝妙之利？」",
        "translation": "What is the thing that cultivates and obtains such a marvelous benefit?",
        "source": "T04n0202_010:0421b22_0"
    },
    {
        "source_sentence": "作是念已，即從禪起，往詣佛所，頭面作禮，前白佛言：「如諸世尊，",
        "translation": "Having thought thus, he rose from his meditation and approached the Buddha. After venerating him by bowing his forehead and face, he said to the Buddha: “O Bhagavat!",
        "source": "T04n0202_010:0421b22_1"
    },
    {
        "source_sentence": "於諸世間人天之中，最尊最妙，功德慧明，巍巍無量。",
        "translation": "Among humans and gods in the world, he's the most honored and most marvelous among them, endowed with great virtue and insight, majestic and immeasurable.",
        "source": "T04n0202_010:0421b24_2"
    },
    {
        "source_sentence": "不審，世尊！",
        "translation": "I'm not sure, Bhagavān!",
        "source": "T04n0202_010:0421b25_3"
    },
    {
        "source_sentence": "先昔以何因緣，發此大乘無上之心？」",
        "translation": "What were the causes and conditions that gave rise to this unsurpassed mind of the great vehicle in the past?",
        "source": "T04n0202_010:0421b25_4"
    },
    {
        "source_sentence": "佛告阿難：「汝欲知者，善思念之。",
        "translation": "The Buddha told Ānanda, If you want to know it, think well of it.",
        "source": "T04n0202_010:0421b26_5"
    },
    {
        "source_sentence": "吾當為汝，具分別說。」",
        "translation": "I will explain it for you in detail.",
        "source": "T04n0202_010:0421b27_6"
    },
    {
        "source_sentence": "阿難白佛：「諾當善聽！」",
        "translation": "Ānanda said to the Buddha, You will listen well!",
        "source": "T04n0202_010:0421b27_7"
    },
    {
        "source_sentence": "佛告阿難：「過去久遠，無量無邊不可思議阿僧祇劫，此閻浮提，有大國王，",
        "translation": "The Buddha said to Ānanda: O Ānanda, in the distant past, immeasurable, limitless, inconceivable, and incalculably long eons ago, there was a great king of Jambudvfpa who ruled over Jambudvipa.",
        "source": "T04n0202_010:0421b28_8"
    },
    {
        "source_sentence": "名摩訶波羅婆修，晉言大光明，主五百小國。",
        "translation": "He was called Mahāprajāpatī (known as Great Light in Sanskrit) and ruled over five hundred small countries.",
        "source": "T04n0202_010:0421c01_9"
    },
    {
        "source_sentence": "爾時大王，與諸群臣俱出遊獵，王所乘象，欲心熾盛，擔王馳走，奔逐牸象，",
        "translation": "It was then that the king and his ministers went out on a hunting excursion. The king’s desire to ride the elephant became so strong that he fled in chase after the cow elephant.",
        "source": "T04n0202_010:0421c02_10"
    },
    {
        "source_sentence": "漸逼大林，突入樹間。",
        "translation": "They gradually conquered the great forest and plunged into the trees.",
        "source": "T04n0202_010:0421c04_0"
    },
    {
        "source_sentence": "象師白王：『捉樹自立，足得全濟。』",
        "translation": "The elephant master said to the king, 'Take a tree and stand up for yourself, and your feet will be completely relieved.'",
        "source": "T04n0202_010:0421c04_1"
    },
    {
        "source_sentence": "王用其言，俱共持樹。",
        "translation": "The king used his words, and they all held the tree together.",
        "source": "T04n0202_010:0421c05_2"
    },
    {
        "source_sentence": "象去之後，王心大怒，苦責象師，欲即殺之。",
        "translation": "After the departure of the elephant, the king became furious and inflicted harm on the elephant trainer, intending to kill him.",
        "source": "T04n0202_010:0421c05_3"
    },
    {
        "source_sentence": "『由卿調象不合制度，致使今者幾危吾身。』",
        "translation": "'It's because you regulated the elephant and didn't follow the rules, so now how could I be in danger?'",
        "source": "T04n0202_010:0421c06_4"
    },
    {
        "source_sentence": "象師白王：『調之如法，但今此象，為欲所惑，欲心難調，非臣咎也，",
        "translation": "The elephant trainer said to the king, “Your majesty, this elephant has been tamed in accordance with the rules. But now it is afflicted by craving and cannot be tamed by its mind free of craving. It is no fault of my servants.",
        "source": "T04n0202_010:0421c07_5"
    },
    {
        "source_sentence": "願見寬恕。",
        "translation": "May I see your forgiveness?",
        "source": "T04n0202_010:0421c09_6"
    },
    {
        "source_sentence": "却後三日，象必自還，觀臣試之，萬死不恨。』",
        "translation": "Three days after his departure, the elephant will surely return on its own, and when he examines it with a minister, he won't hate it even if he dies.'",
        "source": "T04n0202_010:0421c09_7"
    },
    {
        "source_sentence": "即便停置。",
        "translation": "He then stopped and put it away.",
        "source": "T04n0202_010:0421c10_8"
    },
    {
        "source_sentence": "如期三日，象還詣宮。",
        "translation": "Three days later the elephant returned to the palace.",
        "source": "T04n0202_010:0421c11_9"
    },
    {
        "source_sentence": "爾時象師，燒七鐵丸，令色正赤，逼象吞之，象不敢違，吞盡即死。",
        "translation": "At the time, the elephant trainer burned seven iron balls that made them exactly red in color and forced the elephant to swallow them. The elephant didn't dare disobey him, but when he swallowed them all, he died.",
        "source": "T04n0202_010:0421c11_10"
    },
    {
        "source_sentence": "王意開解，及諸群臣，歎未曾有。",
        "translation": "The king's mind was enlightened, and his ministers praised it as unprecedented.",
        "source": "T04n0202_010:0421c13_11"
    },
    {
        "source_sentence": "復問之曰：『如此欲心，誰能調者？』",
        "translation": "Again, he asked them, 'Who can regulate such a mind of desire?'",
        "source": "T04n0202_010:0421c13_12"
    },
    {
        "source_sentence": "時有天神感悟象師，令答王曰：『佛能調之。』",
        "translation": "A celestial deity then awakened the elephant master and asked him to reply to the king, 'The Buddha can tame it.'",
        "source": "T04n0202_010:0421c14_13"
    },
    {
        "source_sentence": "王聞是語，便發心言：『如此膠固，難調伏法，唯佛能除。』",
        "translation": "Hearing these words, the king then arouses his mind and says, 'Such glue is so hard to tame that only the Buddha can remove it.'",
        "source": "T04n0202_010:0421c15_14"
    },
    {
        "source_sentence": "即自誓願：『願求作佛。』",
        "translation": "He then made a vow to himself, 'May I become a buddha.'",
        "source": "T04n0202_010:0421c16_15"
    },
    {
        "source_sentence": "精勤歷劫，未曾休替，至於今日，果獲其報。」",
        "translation": "My effort has passed through many eons without cease, and today I've actually received its reward.",
        "source": "T04n0202_010:0421c17_16"
    },
    {
        "source_sentence": "佛告阿難：「欲知爾時大國王者，今我身是。」",
        "translation": "The Buddha told Ānanda, You want to know that the great king of that time is now me.",
        "source": "T04n0202_010:0421c18_17"
    },
    {
        "source_sentence": "爾時眾會，聞佛所說，咸發無上正真道意，歡喜踊躍，不能自勝，頂受奉行。",
        "translation": "At that point, the assembly heard what the Buddha taught, all arouse the intention for the unsurpassed true path, rejoiced and jumped up and down in joy, couldn't overcome themselves, and accepted it with their heads and carried it out.",
        "source": "T04n0202_010:0421c19_18"
    },
    {
        "source_sentence": "（五〇）◎勒那闍耶品第四十三(丹本為四十八)",
        "translation": "(50.) Śākyamuni's Chapter 43 (The Dan edition is forty-eight)",
        "source": "T04n0202_010:0421c22_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在迦毘羅衛國尼拘盧陀僧伽藍。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Kapilavastu Monastery in Nigrodha Monastery in Kapilavastu.",
        "source": "T04n0202_010:0421c23_0"
    },
    {
        "source_sentence": "爾時諸釋，覩見世尊光明神變，闡揚妙化，甚奇甚特，巍巍堂堂，無能及者。",
        "translation": "It was then that the Śākyas saw the Bhagavān's miraculous transformation of light and illumination, expounding his marvelous transformation, which was so rare and extraordinary that no one could match it in a majestic hall.",
        "source": "T04n0202_010:0421c24_1"
    },
    {
        "source_sentence": "又復歎美憍陳如等：「宿有何慶？",
        "translation": "Again, he praised Kauṇḍinya and others, What's the joy of the past?",
        "source": "T04n0202_010:0421c25_2"
    },
    {
        "source_sentence": "如來出世，法鼓初震，最先得聞，甘露始降，而便蒙澤，永離垢穢，心體玄要；",
        "translation": "When the World-honored One appeared in the world, when the first earthquake of the drum of the Teaching occurred he was the first to hear it. The sweet dew of enlightenment first descended and then moistened the soil; forever freed from dirt and filth, his mind’s essence was mysterious and essential.",
        "source": "T04n0202_010:0421c26_3"
    },
    {
        "source_sentence": "城營村邑，群黨相隨，異口同音，稱讚無量？」",
        "translation": "The cities and villages are built, the groups of people follow each other, speak in unison, and praise measurelessly?",
        "source": "T04n0202_010:0421c28_4"
    },
    {
        "source_sentence": "時諸比丘，聞是語已，往至佛所，頭面禮足，前白佛言：「今此國界人民之類，",
        "translation": "Having heard these words, the bhikṣus went to the place where the Buddha was. After honoring him by bowing their foreheads at his feet, they said to him:",
        "source": "T04n0202_010:0421c29_5"
    },
    {
        "source_sentence": "咸共集聚，異口同音，讚詠世尊，若干德行，及與五人，宿有何慶，獨先蒙度？」",
        "translation": "They all gathered together, spoked with one voice and one voice, praised the Bhagavān, performed various virtuous deeds, and gave them to five people. What good fortune did they have in the past that they were saved alone?",
        "source": "T04n0202_010:0422a02_6"
    },
    {
        "source_sentence": "佛告比丘：「非獨今日先度五人，我於久遠，亦濟此等，以身為船，救彼沒溺，",
        "translation": "The Buddha said to the bhikṣus: Today I am not the only one who has saved five people. For a long time I have also been rescuing these people, putting myself in their boat to rescue them from drowning.",
        "source": "T04n0202_010:0422a03_7"
    },
    {
        "source_sentence": "全其生命，各得安隱，得至彼岸。",
        "translation": "Throughout their lives, they'll each attain peace and reach the other shore.",
        "source": "T04n0202_010:0422a05_8"
    },
    {
        "source_sentence": "吾今成佛，先拔濟之。」",
        "translation": "Now that I've become a buddha, I'll first rescue him.",
        "source": "T04n0202_010:0422a06_9"
    },
    {
        "source_sentence": "時諸比丘，即白佛言：「不審，世尊！",
        "translation": "The monks then said to the Buddha, Not sure, Bhagavān!",
        "source": "T04n0202_010:0422a07_0"
    },
    {
        "source_sentence": "先昔之時，云何拔濟，令各安隱？",
        "translation": "How did you rescue them and make them all at ease in the past?",
        "source": "T04n0202_010:0422a07_1"
    },
    {
        "source_sentence": "唯願世尊！",
        "translation": "Please, Bhagavān!",
        "source": "T04n0202_010:0422a08_2"
    },
    {
        "source_sentence": "當為說之。」",
        "translation": "I will explain it for you.",
        "source": "T04n0202_010:0422a08_3"
    },
    {
        "source_sentence": "佛告比丘：「若樂聞者，當為汝說。」",
        "translation": "The Buddha told the monk, If you're happy to hear it, I'll explain it for you.",
        "source": "T04n0202_010:0422a09_0"
    },
    {
        "source_sentence": "皆曰：「唯然。」",
        "translation": "They all said, Yes.",
        "source": "T04n0202_010:0422a09_1"
    },
    {
        "source_sentence": "佛告比丘：「過去久遠，此閻浮提波羅[木*奈]國，時彼國王，名梵摩達。",
        "translation": "The Buddha told the monks, Long ago, long ago, this country of Jambudvīpa [munai] was a king named Brahmadatta.",
        "source": "T04n0202_010:0422a10_0"
    },
    {
        "source_sentence": "爾時國中，有大薩薄，名勒那闍耶，遊出於外，到林樹間，見有一人，",
        "translation": "At that time in the kingdom of Vaiśālī there was a great sattva named Lenājāya. He traveled outward and came to a forest or forest-dwelling place, where he saw a man named Pūrṇa Maitrāyaniputra.",
        "source": "T04n0202_010:0422a11_1"
    },
    {
        "source_sentence": "涕泣悲切，以索繫樹，入頭在中，欲自絞死，便前問之：『汝何以爾？",
        "translation": "He wept and cried in distress, tied his rope around the tree with a rope, entered into it at the top of his head, and tried to force himself to die.",
        "source": "T04n0202_010:0422a13_2"
    },
    {
        "source_sentence": "人身難得，命復危脆，衰變無數，恒恐自至。』",
        "translation": "It's difficult to obtain a human body, and my life is again in distress, with countless declines and changes, so I'm always afraid I'll come on my own.'",
        "source": "T04n0202_010:0422a14_3"
    },
    {
        "source_sentence": "種種曉喻，教令捨索。",
        "translation": "Various kinds of explanations and metaphors are taught to abandon the claim.",
        "source": "T04n0202_010:0422a15_4"
    },
    {
        "source_sentence": "人報之曰：『我之薄福，貧窮理極，債負盈集，甚多難計。",
        "translation": "The people reported to him, saying, 'My blessedness is weak, I'm poor and extremely poor in principle, and my debts are so great that it's difficult to calculate.",
        "source": "T04n0202_010:0422a16_5"
    },
    {
        "source_sentence": "諸債主輩，競見剝脫，日夜催切，憂心不釋。",
        "translation": "The creditors and debtors rushed to see the Master’s release. Day and night they pressed for his release, but he was grieved and could not be released.",
        "source": "T04n0202_010:0422a17_6"
    },
    {
        "source_sentence": "天地雖寬，無容身處，今欲自沒避離此苦。",
        "translation": "Even though the heavens and earth are wide, there's no room for a place of body, and now I want to disappear on my own to avoid this suffering.",
        "source": "T04n0202_010:0422a18_7"
    },
    {
        "source_sentence": "仁雖諫及，存不如死。』",
        "translation": "Although you're kind and remonstrate, it's not as good as death.'",
        "source": "T04n0202_010:0422a19_8"
    },
    {
        "source_sentence": "爾時薩薄，即許之曰：『卿但釋索，所負多少，悉代汝償。』",
        "translation": "It was then that Sārthavāha agreed with him, saying, 'You simply explain the request, and the amount owed will be paid for it by you.'",
        "source": "T04n0202_010:0422a20_0"
    },
    {
        "source_sentence": "作是語已，彼人便休，歡喜踊躍，感戴無量，隨從薩薄，俱至市中，宣令一切云欲償債。",
        "translation": "Having said these words, the man then withdrew. Rejoicing and ecstatic, immeasurable in joy and emotion, they all followed Sārthavāha into the marketplace and announced to everyone that they wished to repay the debt.",
        "source": "T04n0202_010:0422a21_1"
    },
    {
        "source_sentence": "時諸債主，競共雲集，迎取所負，來者無限，空竭其財。",
        "translation": "The creditors then gathered together in a great hurry to collect the debts they owed, but there were so many people coming and going that they ran out of money.",
        "source": "T04n0202_010:0422a23_2"
    },
    {
        "source_sentence": "財貨已盡，猶不畢債，妻子窮凍，乞匂自活。",
        "translation": "Their wealth and goods had been exhausted but they were not yet paid their debts. Their wives and children were starving and begged for help to live on their own.",
        "source": "T04n0202_010:0422a24_3"
    },
    {
        "source_sentence": "宗親國邑，悉共呵嫌：『此是狂夫，自破家業。』",
        "translation": "All the clans, relatives, and cities all rebuked him, saying, 'This is a crazy man who breaks up his family business for himself.'",
        "source": "T04n0202_010:0422a25_4"
    },
    {
        "source_sentence": "「當于是時，有眾賈客，勸進薩薄，欲共入海，即答之曰：『為薩薄法，",
        "translation": "At that time, a large group of merchants and travelers were encouraging Sārthavāha to enter the sea together.",
        "source": "T04n0202_010:0422a26_5"
    },
    {
        "source_sentence": "當辦船具；",
        "translation": "You should prepare the ship’s provisions.",
        "source": "T04n0202_010:0422a28_6"
    },
    {
        "source_sentence": "我今窮困，無所復有，何緣得從？』",
        "translation": "Now that I'm in distress, there's nothing else to follow, so why would I want to follow it?'",
        "source": "T04n0202_010:0422a28_7"
    },
    {
        "source_sentence": "眾人報言：『我等眾人凡有五百，開意出錢，用辦船具。』",
        "translation": "The people replied, 'We're five hundred of them, and we opened our minds with money to prepare the boat's provisions.'",
        "source": "T04n0202_010:0422a29_8"
    },
    {
        "source_sentence": "聞是語已，即便許可。",
        "translation": "After hearing these words, he even agreed to them.",
        "source": "T04n0202_010:0422b01_9"
    },
    {
        "source_sentence": "眾人許合，大獲金寶。",
        "translation": "All the people agreed to join together and obtained a great deal of gold treasure.",
        "source": "T04n0202_010:0422b01_10"
    },
    {
        "source_sentence": "爾時薩薄，以三千兩金，千兩辦船，千兩辦粮，千兩用俟船上所須，餘故大有給活妻子。",
        "translation": "At the time, Sārthavāha offered 3,000 taels of gold for a thousand taels to prepare boats and 1,000 taels of grain for a thousand taels to store up what they needed on board. The rest was largely provided for their livelihood and wives.",
        "source": "T04n0202_010:0422b02_11"
    },
    {
        "source_sentence": "便於海邊，施作大船，船有七重，嚴辦已訖，推著水中，以七大索，繫著岸邊，",
        "translation": "On the edge of the sea he offered a large ship, consisting of seven carriages. Having arranged everything in proper order, he pushed it into the water and fastened it to the shore by means of seven big ropes.",
        "source": "T04n0202_010:0422b04_12"
    },
    {
        "source_sentence": "擊大金鈴，宣令一切：『誰欲入海得大妙寶奇珍異物用無盡者，今可雲集共詣寶所。』",
        "translation": "He struck a great golden bell and told all of them, 'Those who want to enter the ocean and attain great marvelous treasures that are inexhaustible in terms of their use can now gather together into a cloud and go to the treasure.'",
        "source": "T04n0202_010:0422b06_13"
    },
    {
        "source_sentence": "復告之曰：『其誰不愛父母妻子閻浮提樂及身命者，乃可往耳。",
        "translation": "Again, he told them, 'Whoever doesn't love the pleasures of their parents, wife, Jambudvīpa, and body and life can go there.'",
        "source": "T04n0202_010:0422b08_14"
    },
    {
        "source_sentence": "所以然者，大海之中，艱險眾多，迴波暴風，大魚惡鬼，如是種種，不可具陳。』",
        "translation": "That's why there are so many difficulties and dangers in the ocean, such as waves and storms, big fish and bad ghosts, and so forth, which can't be described in detail.'",
        "source": "T04n0202_010:0422b09_15"
    },
    {
        "source_sentence": "作是語已，即斷一索；",
        "translation": "Having said this, the king cut off one of his arrows.",
        "source": "T04n0202_010:0422b11_16"
    },
    {
        "source_sentence": "日日如是，至第七日，斷索都盡，船即馳去。",
        "translation": "Day after day, on the seventh day, when the rope was cut and all the ropes were exhausted, the boat ran away.",
        "source": "T04n0202_010:0422b12_17"
    },
    {
        "source_sentence": "便於道中，卒遇暴風，破碎其船，眾人喚救，無所歸依，或有能得板檣浮囊以自度者，",
        "translation": "On the way they were suddenly struck by a violent wind and their boats broke up in distress. Many people called out to rescue them but they had no one to rely on. Some could save themselves by means of wooden boards, bamboo baskets, or floating bags.",
        "source": "T04n0202_010:0422b13_18"
    },
    {
        "source_sentence": "或有墮水溺死之者。",
        "translation": "Some people may fall into water and drown themselves.",
        "source": "T04n0202_010:0422b15_19"
    },
    {
        "source_sentence": "中有五人，共白薩薄：『依汝來此，今當沒死，危險垂至，願見救度。』",
        "translation": "Five people in the assembly said to Sārthavāha, 'Depending on you coming here, I'll surely die and be rescued.'",
        "source": "T04n0202_010:0422b15_20"
    },
    {
        "source_sentence": "薩薄答曰：『吾聞大海，不宿死屍。",
        "translation": "Sārthavāha replied, 'I've heard that the ocean won't contain a dead corpse.",
        "source": "T04n0202_010:0422b17_21"
    },
    {
        "source_sentence": "汝等今者，悉各捉我，我為汝故，當自殺身，以濟爾厄，誓求作佛。",
        "translation": "All of you have now taken hold of me. For your sakes I will kill myself in order to save you from this calamity, and I vow to become a buddha.",
        "source": "T04n0202_010:0422b18_22"
    },
    {
        "source_sentence": "後成佛時，當以無上正法之船，度汝生死大海之苦。』",
        "translation": "When you later become a buddha, you will use the boat of the unsurpassed right teaching to save you from the suffering of the great ocean of birth and death.'",
        "source": "T04n0202_010:0422b19_23"
    },
    {
        "source_sentence": "作是語已，以刀自割。",
        "translation": "After he said this, he cut himself with a knife.",
        "source": "T04n0202_010:0422b20_24"
    },
    {
        "source_sentence": "命斷之後，海神起風，吹至彼岸，得度大海，皆獲安隱。」",
        "translation": "After their lives were cut off, the sea gods raised a wind and blew it to the other shore, crossed the ocean, and they all attained peace.",
        "source": "T04n0202_010:0422b21_25"
    },
    {
        "source_sentence": "佛告比丘：「欲知爾時勒那闍耶者，今我身是。",
        "translation": "The Buddha told the monk, You want to know that I am now the person who was Lenājāya at that time.",
        "source": "T04n0202_010:0422b22_26"
    },
    {
        "source_sentence": "時五人者，拘隣等是。",
        "translation": "The five people at the time were Kauṇḍinya and so forth.",
        "source": "T04n0202_010:0422b23_27"
    },
    {
        "source_sentence": "我於先世，濟彼人等生死之命；",
        "translation": "In a former existence I saved the lives of those people in birth and death.",
        "source": "T04n0202_010:0422b24_28"
    },
    {
        "source_sentence": "今得成佛，令其五人皆最初得無漏正法，遠離長流結使大海。」",
        "translation": "Now that he's become a buddha, he causes those five people to first attain the uncontaminated right teaching and be far removed from the long-flowing fetters that bind the ocean.",
        "source": "T04n0202_010:0422b25_29"
    },
    {
        "source_sentence": "爾時諸比丘，皆共讚歎，如來大悲，深妙難量，咸勤剋勵，聞佛所說，",
        "translation": "The bhikṣus then praised the great compassion of the Tathāgata, whose depth and profundity were immeasurable. They all exerted themselves to enlightenment in order to hear the Buddha’s discourse:",
        "source": "T04n0202_010:0422b26_30"
    },
    {
        "source_sentence": "歡喜奉行。",
        "translation": "They rejoice and venerate it.",
        "source": "T04n0202_010:0422b28_31"
    },
    {
        "source_sentence": "（五一）◎迦毘梨百頭品第四十四(丹本為四十九)",
        "translation": "(21) - Kapilavastu Chapter 44 (the Sanskrit text is forty-nine)",
        "source": "T04n0202_010:0422b29_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在摩竭國竹園之中。",
        "translation": "Thus I have heard: One time, the Buddha was staying at a bamboo grove in the kingdom of Magadha.",
        "source": "T04n0202_010:0422c01_0"
    },
    {
        "source_sentence": "爾時世尊與諸比丘，向毘舍離，到梨越河所。",
        "translation": "It was then that the Bhagavān and the monks headed for Vaiśālī and went to the river of Revata.",
        "source": "T04n0202_010:0422c01_1"
    },
    {
        "source_sentence": "是時河邊，有五百牧牛人，五百捕魚人。",
        "translation": "At the river's edge, there were 500 cowherdmen and 500 fishermen.",
        "source": "T04n0202_010:0422c03_0"
    },
    {
        "source_sentence": "其捕魚者，作三種網，大小不同，小者二百人挽，中者三百人挽，大者五百人挽。",
        "translation": "The catchers of the fish form three kinds of nets, each different in size. The smallest is caught by two hundred people; the middle by 300 people; and the bigest by five hundred people.",
        "source": "T04n0202_010:0422c03_1"
    },
    {
        "source_sentence": "於時如來，去河不遠而坐止息，及諸比丘亦皆共坐。",
        "translation": "The Tathāgata then sat and stopped, not far from the river, and the monks were all seated together.",
        "source": "T04n0202_010:0422c05_2"
    },
    {
        "source_sentence": "時捕魚人，網得一大魚，五百人挽，不能使出；",
        "translation": "At that time a fisherman caught a big fish in the net, but five hundred people pulled it and couldn’t let it out.",
        "source": "T04n0202_010:0422c06_3"
    },
    {
        "source_sentence": "復喚牧牛之眾，合有千人，并力挽出，得一大魚，身有百頭，若干種類，",
        "translation": "Again, he summoned the herd of cowherds, a thousand in number, and pulled them out by force. They obtained a large fish with a hundred heads on its body, which was of various species.",
        "source": "T04n0202_010:0422c08_0"
    },
    {
        "source_sentence": "驢馬駱駝、虎狼猪狗、猨猴狐狸，如斯之屬。",
        "translation": "A donkey, a horse, a camel, a tiger, a wolf, a pig, a dog, a rhesus monkey, or a fox belong to the same class.",
        "source": "T04n0202_010:0422c09_1"
    },
    {
        "source_sentence": "眾人甚怪，競集看之。",
        "translation": "The crowd was greatly surprised and rushed to see it.",
        "source": "T04n0202_010:0422c10_2"
    },
    {
        "source_sentence": "是時世尊，告阿難曰：「彼有何事，大眾皆集？",
        "translation": "The Bhagavān then addressed Ānanda, What's the matter with them that all the people have gathered together?",
        "source": "T04n0202_010:0422c11_3"
    },
    {
        "source_sentence": "汝往試看。」",
        "translation": "Come and test it.",
        "source": "T04n0202_010:0422c12_4"
    },
    {
        "source_sentence": "阿難受教，即往看視。",
        "translation": "Ānanda, having received the instruction, went to see and pay his respects.",
        "source": "T04n0202_010:0422c12_5"
    },
    {
        "source_sentence": "見一大魚，身有百頭，還白世尊，如所見事。",
        "translation": "Seeing a large fish with a hundred heads in his body, he returned to the Bhagavān and told him what he had seen.",
        "source": "T04n0202_010:0422c12_6"
    },
    {
        "source_sentence": "世尊尋時，共諸比丘，往至魚所，而問魚言：「汝是迦毘梨不？」",
        "translation": "When the Bhagavān sought it, he went to the fish with the monks and asked the fish, Are you Kapilavastu?",
        "source": "T04n0202_010:0422c13_7"
    },
    {
        "source_sentence": "答言：「實是。」",
        "translation": "He replied, It's true.",
        "source": "T04n0202_010:0422c15_8"
    },
    {
        "source_sentence": "鄭重三問：「汝是迦毘梨不？」",
        "translation": "Zheng Chong asked three times, Are you Kapilavastu?",
        "source": "T04n0202_010:0422c15_9"
    },
    {
        "source_sentence": "答言：「實是。」",
        "translation": "He replied, It's true.",
        "source": "T04n0202_010:0422c16_0"
    },
    {
        "source_sentence": "復問：「教匠汝者，今在何處？」",
        "translation": "Again, he asked, Where is the teacher who taught you?",
        "source": "T04n0202_010:0422c16_1"
    },
    {
        "source_sentence": "答言：「墮阿鼻地獄中。」",
        "translation": "He replied, They'll fall into the avīci hell.",
        "source": "T04n0202_010:0422c16_2"
    },
    {
        "source_sentence": "爾時阿難，及於大眾，不知其緣，白世尊曰：「今者何故，喚百頭魚，",
        "translation": "At that time Ānanda and the members of the assembly did not know the reason for this. They asked the World-honored One, “Why are you calling out to these hundreds of thousands of fishes?",
        "source": "T04n0202_010:0422c17_3"
    },
    {
        "source_sentence": "為迦毘梨？",
        "translation": "Why is it Kapilavastu?",
        "source": "T04n0202_010:0422c18_4"
    },
    {
        "source_sentence": "唯願垂愍！",
        "translation": "May it please you!",
        "source": "T04n0202_010:0422c19_5"
    },
    {
        "source_sentence": "而見告示。」",
        "translation": "They'll see it and tell it.",
        "source": "T04n0202_010:0422c19_6"
    },
    {
        "source_sentence": "佛告阿難：「諦聽諦聽！",
        "translation": "The Buddha told Ānanda, Listen closely and listen closely!",
        "source": "T04n0202_010:0422c19_7"
    },
    {
        "source_sentence": "當為汝說！",
        "translation": "I will explain it for you!",
        "source": "T04n0202_010:0422c20_8"
    },
    {
        "source_sentence": "昔迦葉佛時，有婆羅門，生一男兒，字迦毘梨(晉言黃頭)，聰明博達，",
        "translation": "Formerly in the time of Kāśyapa Buddha there was a brahman who gave birth to a boy named Kapilavastu (known as Yellowhead in Chinese), an intelligent and erudite man.",
        "source": "T04n0202_010:0422c20_9"
    },
    {
        "source_sentence": "於種類中，多聞第一，唯復不如諸沙門輩。",
        "translation": "Among the various kinds of śramaṇas, he was the best among the well-versed. He did not fare as good as other śramaṇas.",
        "source": "T04n0202_010:0422c21_10"
    },
    {
        "source_sentence": "其父臨終，慇懃約勅：『汝當慎莫與迦葉佛沙門講論道理。",
        "translation": "When his father died, he made a secret decree, saying, 'You must be careful not to discuss the doctrine with Kāśyapa Buddha's ascetic.",
        "source": "T04n0202_010:0422c22_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T04n0202_010:0422c24_12"
    },
    {
        "source_sentence": "沙門智深，汝必不如。』",
        "translation": "The ascetic's wisdom is deep, but you mustn't be like that.'",
        "source": "T04n0202_010:0422c24_13"
    },
    {
        "source_sentence": "父沒之後，其母問曰：『汝本高朗，今頗更有勝汝者不？』",
        "translation": "After his father died, his mother asked him, 'In the past you were so lofty, but now is there anyone who surpasses you?'",
        "source": "T04n0202_010:0422c25_0"
    },
    {
        "source_sentence": "答言：『沙門殊勝於我。』",
        "translation": "He replied, 'The ascetic is superior to me.'",
        "source": "T04n0202_010:0422c26_1"
    },
    {
        "source_sentence": "母復問言：『云何為勝？』",
        "translation": "Again, the mother asked, 'What's superior?'",
        "source": "T04n0202_010:0422c26_2"
    },
    {
        "source_sentence": "答言：『我有所疑，往問沙門，其所演說，令人開解。",
        "translation": "He replied, 'I have some doubts, so I went to the ascetic and asked him about them. What he teaches, enabling him to understand.",
        "source": "T04n0202_010:0422c27_3"
    },
    {
        "source_sentence": "彼若問我，我不能答。",
        "translation": "If they ask me questions, I can't answer them.",
        "source": "T04n0202_010:0422c28_4"
    },
    {
        "source_sentence": "以是之故，自知不如。』",
        "translation": "Because of this, he knows for himself that it's not like that.'",
        "source": "T04n0202_010:0422c29_5"
    },
    {
        "source_sentence": "母復告言：『汝何以不往學習其法？』",
        "translation": "Again, the mother told him, 'Why don't you go there to study his teaching?'",
        "source": "T04n0202_010:0422c29_6"
    },
    {
        "source_sentence": "答言：『欲學其法當作沙門，我是白衣，何緣得學？』",
        "translation": "He replied, 'If you want to learn the teaching and become an ascetic, I'm a white-robed monk; what is the reason you can learn it?'",
        "source": "T04n0202_010:0423a01_7"
    },
    {
        "source_sentence": "母復告曰：『偽作沙門，學習已達，還來在家。』",
        "translation": "Again, his mother told him, 'Fake as an ascetic, I've studied and mastered it, so I'll return home.'",
        "source": "T04n0202_010:0423a02_8"
    },
    {
        "source_sentence": "奉其母教，而作沙門。",
        "translation": "Following the instruction of his mother, he became a śramaṇa.",
        "source": "T04n0202_010:0423a03_9"
    },
    {
        "source_sentence": "經少時間，讀誦三藏，綜練義理，母問之曰：『今得勝未？』",
        "translation": "Soon after, he recited the Tripiṭaka and studied its doctrine in a comprehensive way, and his mother asked him, 'Has he won it now?'",
        "source": "T04n0202_010:0423a04_10"
    },
    {
        "source_sentence": "答言：『學問中勝不如坐禪。",
        "translation": "He replied, 'The superiority of training is not as good as sitting in meditation.",
        "source": "T04n0202_010:0423a05_11"
    },
    {
        "source_sentence": "何以知之？",
        "translation": "How do we know this?",
        "source": "T04n0202_010:0423a06_12"
    },
    {
        "source_sentence": "我問彼人，悉能分別；",
        "translation": "I questioned them, and they were all able to discern.",
        "source": "T04n0202_010:0423a06_13"
    },
    {
        "source_sentence": "彼人問我，我不能知。",
        "translation": "That person asks me, but I can't know it.",
        "source": "T04n0202_010:0423a07_14"
    },
    {
        "source_sentence": "因是事故，未與他等。』",
        "translation": "Because of these things, they haven't been given to others.'",
        "source": "T04n0202_010:0423a07_15"
    },
    {
        "source_sentence": "母復告曰：『自今已往，若共談論，儻不如時，便可罵辱。』",
        "translation": "Again, his mother told him, 'From now on, if we talk together and don't get along with each other, then we'll be humiliated.'",
        "source": "T04n0202_010:0423a08_16"
    },
    {
        "source_sentence": "迦毘梨言：『出家沙門，無復過罪。",
        "translation": "Kapilavastu said, 'There's no offense for a renunciant as a monk to leave home.",
        "source": "T04n0202_010:0423a09_17"
    },
    {
        "source_sentence": "云何罵之？』",
        "translation": "How did you scold him?'",
        "source": "T04n0202_010:0423a10_18"
    },
    {
        "source_sentence": "答言：『但罵，卿當得勝。』",
        "translation": "He replied, 'Just scold it, and you'll be victorious.'",
        "source": "T04n0202_010:0423a10_19"
    },
    {
        "source_sentence": "時迦毘梨不忍違母，後日更論，理若短屈，即便罵言：『汝等愚騃！",
        "translation": "Kapilavastu then couldn't bear to disobey his mother, and he argued again the next day, but if he was short-handed in principle, he even scolded them, saying, 'You fools!",
        "source": "T04n0202_010:0423a10_20"
    },
    {
        "source_sentence": "無所識別，劇於畜生，知曉何法？』",
        "translation": "There's nothing to distinguish, and it's like an animal that knows what to understand.'",
        "source": "T04n0202_010:0423a12_21"
    },
    {
        "source_sentence": "諸百獸頭，皆用比之，如是數數，非一非二。",
        "translation": "The heads of the hundreds of animals are all compared in this way, and they're counted like this, not one or two.",
        "source": "T04n0202_010:0423a13_22"
    },
    {
        "source_sentence": "緣是果報，今受魚身，而有百頭。」",
        "translation": "As a result of this retribution, I'll now receive the body of a fish with a hundred heads.",
        "source": "T04n0202_010:0423a14_23"
    },
    {
        "source_sentence": "阿難問佛：「何時當得脫此魚身？」",
        "translation": "Ānanda asked the Buddha, When will you be able to get rid of this fish's body?",
        "source": "T04n0202_010:0423a15_24"
    },
    {
        "source_sentence": "佛告阿難：「此賢劫中，千佛過去，猶故不脫。」",
        "translation": "The Buddha told Ānanda, In this good eon, a thousand buddhas have passed away, but they still aren't liberated.",
        "source": "T04n0202_010:0423a15_25"
    },
    {
        "source_sentence": "爾時阿難，及於眾人，聞佛所說，悵然不樂，悲傷交懷，咸共同聲，而作是言：「身口意行，",
        "translation": "At that time, having heard the Buddha’s exhortation, Ānanda and the other bhikṣus were disheartened and grieved. They all cried out in unison, saying:",
        "source": "T04n0202_010:0423a16_26"
    },
    {
        "source_sentence": "不可不慎。」",
        "translation": "You mustn't be careless.",
        "source": "T04n0202_010:0423a18_27"
    },
    {
        "source_sentence": "時捕魚人及牧牛人，一時俱共合掌向佛，求索出家，淨修梵行。",
        "translation": "The fishermen and cattle herders then joined their palms together at once to face the Buddha, begged him to leave home, and purely cultivated the religious practice.",
        "source": "T04n0202_010:0423a19_28"
    },
    {
        "source_sentence": "佛即言可。",
        "translation": "The Buddha then said, Yes.",
        "source": "T04n0202_010:0423a20_29"
    },
    {
        "source_sentence": "「善來比丘！」",
        "translation": "Well-come bhikṣus!",
        "source": "T04n0202_010:0423a20_30"
    },
    {
        "source_sentence": "鬚髮自落，法衣在體，便成沙門。",
        "translation": "The hair on his beard fell off, and while the Dharma robe remained on his body he became a śramaṇa.",
        "source": "T04n0202_010:0423a21_31"
    },
    {
        "source_sentence": "是時世尊！",
        "translation": "Bhagavān, then!",
        "source": "T04n0202_010:0423a21_32"
    },
    {
        "source_sentence": "為說妙法，種種苦切，漏盡結解，成阿羅漢，復為眾會廣說諸法，分別四諦苦集滅道。",
        "translation": "He teaches the wonderful Dharma, various kinds of suffering and cuts, ends the bonds of contamination, becomes an arhat, explains the teachings in detail for the assembly, discerns the four truths of suffering, accumulation, cessation, and the path, and becomes an arhat.",
        "source": "T04n0202_010:0423a22_33"
    },
    {
        "source_sentence": "有得初果乃至第四果，有發大道意者，其數甚多。",
        "translation": "There are those who have attained the first realization up to the fourth realization, and there are those who give rise to the intention for the path, which are quite numerous.",
        "source": "T04n0202_010:0423a24_34"
    },
    {
        "source_sentence": "爾時四眾聞佛所說，歡喜奉行。",
        "translation": "When the fourfold assembly heard what the Buddha taught, they rejoiced and remembered it well.",
        "source": "T04n0202_010:0423a25_35"
    },
    {
        "source_sentence": "賢愚經卷第十",
        "translation": "Xianyu jing, vol. 10",
        "source": "T04n0202_010:0423a27_0"
    }
]