[
    {
        "source_sentence": "賢愚經卷第八",
        "translation": "Sutra of Good and Evil, Volume 8",
        "source": "T04n0202_008:0402c02_0"
    },
    {
        "source_sentence": "元魏涼州沙門慧覺等在高昌郡譯",
        "translation": "Yuan Wei Liangzhou shaman Huijue and others translated it at Gaochang Commandery",
        "source": "T04n0202_008:0402c04_0"
    },
    {
        "source_sentence": "（三九）蓋事因緣品第三十四(丹本為三十八)",
        "translation": "(30) Chapter 34 of the chapter on the Causes and Conditions for Deeds (the Dan edition is 38)",
        "source": "T04n0202_008:0402c05_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在羅閱祇竹林精舍。",
        "translation": "Thus I have heard: One time, the Buddha was staying at the monastery in the bamboo grove of Rājagṛha.",
        "source": "T04n0202_008:0402c06_0"
    },
    {
        "source_sentence": "慧命阿難，竹林中坐，心自思惟：「如來出世，甚奇甚特！",
        "translation": "Ānanda of Wisdom and Life, seated in the bamboo grove, thought to himself: The appearance of the Tathāgata in the world is most wonderful and most remarkable.",
        "source": "T04n0202_008:0402c06_1"
    },
    {
        "source_sentence": "今諸弟子，蒙佛恩澤，於四供養，無所乏少，各獲安隱，得盡苦際；",
        "translation": "Their disciples have now been blessed by the Buddha with these four kinds of offerings. There is nothing lacking in each of them. Each has gained peace and attained the end of suffering.",
        "source": "T04n0202_008:0402c08_2"
    },
    {
        "source_sentence": "一切世間，諸王臣民，亦得大利，遭值三寶，人民安樂，悉思世尊威力所致。」",
        "translation": "All the kings, ministers, and people in all the worlds will also attain great rewards when they meet the Three Treasures, and the people will be well-being because of the Bhagavān's authoritative power.",
        "source": "T04n0202_008:0402c09_3"
    },
    {
        "source_sentence": "作是念已，從坐處起，來詣佛所。",
        "translation": "After he had this thought, he rose from his seat and came to the Buddha.",
        "source": "T04n0202_008:0402c11_4"
    },
    {
        "source_sentence": "爾時世尊，為四部眾，廣說妙法。",
        "translation": "At the time, the Bhagavān explained the marvelous teaching in detail for the four groups of people.",
        "source": "T04n0202_008:0402c12_5"
    },
    {
        "source_sentence": "慧命阿難，前整衣服，偏袒右肩，右膝著地，長跪合掌，向佛自說林中所念。",
        "translation": "Ānanda of Wisdom and Life, he straightened his clothes, bared his right shoulder, knelt with his right knee on the ground, joined his palms together, and said to the Buddha what he thought in the forest.",
        "source": "T04n0202_008:0402c12_6"
    },
    {
        "source_sentence": "佛告阿難：「如汝所言，如來出世，實復奇特！",
        "translation": "The Buddha told Ānanda, As you say, the Tathāgata appears in the world, it's really extraordinary!",
        "source": "T04n0202_008:0402c15_0"
    },
    {
        "source_sentence": "令一切眾生皆獲利益。",
        "translation": "It causes all sentient beings to attain benefit.",
        "source": "T04n0202_008:0402c16_0"
    },
    {
        "source_sentence": "復次阿難！",
        "translation": "Furthermore, Ānanda!",
        "source": "T04n0202_008:0402c16_1"
    },
    {
        "source_sentence": "如來正覺，非但今日祐利眾生，過去世時，亦復利益。」",
        "translation": "The Tathāgata Perfectly Awakened One isn't just benefiting sentient beings today, but he was also benefiting them in past lives.",
        "source": "T04n0202_008:0402c16_2"
    },
    {
        "source_sentence": "阿難白佛：「不審，世尊！",
        "translation": "Ānanda said to the Buddha, Not sure, Bhagavān!",
        "source": "T04n0202_008:0402c18_3"
    },
    {
        "source_sentence": "過去世中，饒益眾生，其事云何？」",
        "translation": "What happened in a past life that benefited sentient beings?",
        "source": "T04n0202_008:0402c18_4"
    },
    {
        "source_sentence": "佛告阿難：「過去久遠阿僧祇劫，此閻浮提有四河水、二大國王，一王名曰婆羅提婆，",
        "translation": "The Buddha said to Ānanda: Long ago, long after an incalculable number of kalpas ago, there were four rivers of water and two great kings in Jambudvfpa. One of them was named Vārāṇasī (i.e., King Mahāsudassana).",
        "source": "T04n0202_008:0402c19_5"
    },
    {
        "source_sentence": "晉言梵天，獨據三河，人民熾盛，然復儜弱；",
        "translation": "The Sanskrit: brahmadeva means “brahma-heaven” in the Jin dynasty, which is located at the foot of the Three Rivers and has a large population but weakness.",
        "source": "T04n0202_008:0402c21_6"
    },
    {
        "source_sentence": "一王名曰罰闍達提，晉言金剛聚，唯得一河，人民亦少，然其國人悉皆勇健。",
        "translation": "A king named Puṣkaradatta (known as Jingangjuju, “Heaven of Diamonds,” in Chinese) possessed only one river and a small number of inhabitants; but the people there were all brave and strong.",
        "source": "T04n0202_008:0402c22_7"
    },
    {
        "source_sentence": "時金剛聚，處于正殿，獨坐思惟：『如我今者，兵眾勇悍，而所獲水少，",
        "translation": "At that time the Vajrapāṇi assembly was in the main hall of the monastery. Sitting alone, he thought to himself: Just as I am now, my troops are so strong and brave that they can harvest little water.",
        "source": "T04n0202_008:0402c24_8"
    },
    {
        "source_sentence": "彼國儜弱獨霸三河，今當遣使和索一河。",
        "translation": "That country is weak and alone ruling over three rivers, but now I will send an envoy to pacify one of the rivers.",
        "source": "T04n0202_008:0402c25_9"
    },
    {
        "source_sentence": "若與我者，共為親厚，國有好物，更相貢贈，若有艱難，共相赴救；",
        "translation": "If you give it to me, I will be affectionate to you. You will have good things in your country and offer them to me as an offering. If you are in distress, go together to rescue each other.",
        "source": "T04n0202_008:0402c26_10"
    },
    {
        "source_sentence": "若其不得，便當力逼而奪取之。』",
        "translation": "If he doesn't get it, then he'll force and take it away.'",
        "source": "T04n0202_008:0402c28_11"
    },
    {
        "source_sentence": "作是念已，召諸大臣共議此事，諸臣咸言：『今正是時。』",
        "translation": "After he had this thought, he summoned the ministers to discuss this matter together, and the ministers all said, 'Now is the right time.'",
        "source": "T04n0202_008:0402c29_0"
    },
    {
        "source_sentence": "即遣驛使，至梵天國，具以王意，宣示梵王。",
        "translation": "He immediately dispatched a messenger to the Brahma heavenly kingdom and told him exactly what the king wished.",
        "source": "T04n0202_008:0403a01_1"
    },
    {
        "source_sentence": "梵王聞此，復自思惟：『我國豐實，人眾亦多，又此國界，父王所有，",
        "translation": "Having heard these words, the brahma king thought to himself: My country is prosperous and there are many inhabitants. Furthermore, this territory belongs to my father, the king.",
        "source": "T04n0202_008:0403a02_2"
    },
    {
        "source_sentence": "轉用授我，至於力諍，我不下彼。』",
        "translation": "He turns to give it to me, and when he reaches the point of power, I won't go down there.'",
        "source": "T04n0202_008:0403a03_3"
    },
    {
        "source_sentence": "作是念已，報彼使言：『今此國土，非我所得，乃是父王，轉用見授。",
        "translation": "After he had this thought, he reported to the messenger, saying, 'Now, this land isn't mine; it's my father who gave it to me in return.",
        "source": "T04n0202_008:0403a04_4"
    },
    {
        "source_sentence": "如我今者，力不減汝，汝欲力決，我不相畏。』",
        "translation": "As I am now, my strength doesn't diminish from yours; you want to be resolute and not fear each other.'",
        "source": "T04n0202_008:0403a06_5"
    },
    {
        "source_sentence": "使還本國，具以聞王。",
        "translation": "The envoy returned to his native land and reported the whole story to the king.",
        "source": "T04n0202_008:0403a07_6"
    },
    {
        "source_sentence": "王即合軍，攻梵天國，共戰一交，梵天軍壞，乘背追躡，經至城邊，眾人怖縮，",
        "translation": "The king then joined his troops and attacked the brahma-heaven. They fought in one battle but when the brahma-heavenly army was defeated, they rode on their backs and pursued each other until they came to the edge of the city wall. All the citizens were terrified and distressed.",
        "source": "T04n0202_008:0403a07_7"
    },
    {
        "source_sentence": "更不敢出，諸臣相將，悉共集會，詣梵王所，咸皆同心，白大王言：『他國兵強，",
        "translation": "The ministers and generals assembled together at the place where Brahmā was staying. They all said to the great king, “Other countries have a strong army.",
        "source": "T04n0202_008:0403a09_8"
    },
    {
        "source_sentence": "我國儜弱，惜一河水，今致此敗。",
        "translation": "The kingdom of our country is weak and begrudgingly cherishes one river of water, which has now caused this defeat.",
        "source": "T04n0202_008:0403a11_9"
    },
    {
        "source_sentence": "如是不久，懼恐失國。",
        "translation": "Soon after this, he was afraid of losing his kingdom.",
        "source": "T04n0202_008:0403a12_10"
    },
    {
        "source_sentence": "唯願開意，以一河水與之，共為親厚，足得安全。』",
        "translation": "I only wish to enlighten my mind and give them a river of water, so that they'll be intimate with each other and attain safety.'",
        "source": "T04n0202_008:0403a12_11"
    },
    {
        "source_sentence": "王心便開，可眾臣意。",
        "translation": "The king's mind then became open, and he agreed with the ministers.",
        "source": "T04n0202_008:0403a14_0"
    },
    {
        "source_sentence": "即時遣使，至彼軍中，白其王言：『我曹比國，用作惡為？",
        "translation": "He immediately sent an envoy to that army and said to the king, 'We're doing evil in our country.",
        "source": "T04n0202_008:0403a14_1"
    },
    {
        "source_sentence": "所索河水，今以相與，我當以女為汝夫人，國有特物，更相貢贈，急難危嶮，",
        "translation": "I will now give you the water of the river that you asked for. I will take my daughter to be your wife. There is a special property in our country, and we should again present it to each other as an offering. It is so urgent and dangerous!",
        "source": "T04n0202_008:0403a15_2"
    },
    {
        "source_sentence": "共相赴救。』",
        "translation": "Together, we'll go to rescue each other.'",
        "source": "T04n0202_008:0403a17_3"
    },
    {
        "source_sentence": "時金剛聚，從其來意，即迎其女，拜為夫人，各共和解，迴軍還國。",
        "translation": "Vajrapāṇi then followed his wishes, greeted the woman, paid homage to her as wife, reconciled with each other, and returned home.",
        "source": "T04n0202_008:0403a17_4"
    },
    {
        "source_sentence": "「經於數時，其王夫人，便覺有胎。",
        "translation": "“After a few moments, the king’s wife suddenly woke up with a fetus.",
        "source": "T04n0202_008:0403a19_5"
    },
    {
        "source_sentence": "懷妊之後，恒有自然七寶大蓋，常在身上，坐臥行立終不遠離。",
        "translation": "When she was pregnant, she always had a large seven-jeweled canopy that stood on her body and never separated from her when she sat, lay, or walked.",
        "source": "T04n0202_008:0403a20_6"
    },
    {
        "source_sentence": "至滿十月，生一男兒，身紫金色，頭髮紺青，光相昞著，世之少雙，兒以出胎，",
        "translation": "When the full tenth month had passed, a boy was born. His body was purplish-gold in color and his hair was dark blue in color. The twins were rarely seen in the world but he came out of the womb to give birth to them.",
        "source": "T04n0202_008:0403a21_7"
    },
    {
        "source_sentence": "蓋在其上。",
        "translation": "It's on top of it.",
        "source": "T04n0202_008:0403a23_8"
    },
    {
        "source_sentence": "召諸相師，令相此兒。",
        "translation": "He summoned the soothsayers and asked them to mark this child.",
        "source": "T04n0202_008:0403a23_9"
    },
    {
        "source_sentence": "相師披看，舉手唱言：『善哉善哉！』",
        "translation": "The master of characteristics opened his eyes, raised his hand, and called out, 'Good, good!'",
        "source": "T04n0202_008:0403a24_10"
    },
    {
        "source_sentence": "異口同音白大王言：『今觀太子，德力無比，人相畢足，世之希有。』",
        "translation": "He said to the great king with a different voice and same voice, 'Now, I'll observe that the prince's virtue is unsurpassed, and his people are sufficiently endowed, which is rare in the world.'",
        "source": "T04n0202_008:0403a25_0"
    },
    {
        "source_sentence": "王及群臣，喜不自勝，即告相師，為其立字。",
        "translation": "The king and his ministers were overjoyed and unable to control themselves, so they told the soothsayer to set up a word for him.",
        "source": "T04n0202_008:0403a26_1"
    },
    {
        "source_sentence": "爾時國法，依於二事，而為作字：一者瑞應，二者星宿。",
        "translation": "At the time, the country's laws depended on two things to make words for them: first, auspicious response and second, stars and constellations.",
        "source": "T04n0202_008:0403a27_2"
    },
    {
        "source_sentence": "相師白王：『今此太子，入胎已來，有何等瑞？』",
        "translation": "The soothsayer said to the king, 'Now, what kind of auspicious sign has this prince shown since he entered the womb?'",
        "source": "T04n0202_008:0403a28_3"
    },
    {
        "source_sentence": "王答之曰：『有七寶蓋，恒在其上。』",
        "translation": "The king answered, 'There are seven jeweled canopies that are always on top of it.'",
        "source": "T04n0202_008:0403a29_4"
    },
    {
        "source_sentence": "便為作字剎羅伽利，晉言蓋事，以眾妙供，隨時承奉。",
        "translation": "He then composed the Sanskrit word kṣatṛkāli, which means “to cover” in Chinese. With various kinds of exquisite offerings he received and offered them at any time.",
        "source": "T04n0202_008:0403b01_5"
    },
    {
        "source_sentence": "年至成人，父便命終。",
        "translation": "When he grew up to adulthood his father died.",
        "source": "T04n0202_008:0403b03_0"
    },
    {
        "source_sentence": "葬送畢訖，諸小王臣，共立蓋事，用為大王。",
        "translation": "When the burial service was over, the king’s ministers of the lesser kingdoms set up a common canopy to serve as the king.",
        "source": "T04n0202_008:0403b03_1"
    },
    {
        "source_sentence": "「治政數年，出外遊觀，見諸人民耕種勞苦，問左右曰：『我國人眾，",
        "translation": "“After a few years of governing, he went out on a pleasure trip and saw the people’s labor in cultivating crops. He asked those around him:",
        "source": "T04n0202_008:0403b04_2"
    },
    {
        "source_sentence": "何以作此種種役使？』",
        "translation": "Why are these various kinds of servants created?'",
        "source": "T04n0202_008:0403b06_3"
    },
    {
        "source_sentence": "臣答王言：『國以民為本，民以穀為命。",
        "translation": "The ministers answered the king, saying, 'The country takes the people as its root and the people take grain as their livelihood.",
        "source": "T04n0202_008:0403b06_4"
    },
    {
        "source_sentence": "若其不爾，民命不存；",
        "translation": "If they don’t, the lives of the people won’t survive.",
        "source": "T04n0202_008:0403b07_5"
    },
    {
        "source_sentence": "民命不存，國則滅矣。』",
        "translation": "If the lives of the people don't exist, the country will cease.'",
        "source": "T04n0202_008:0403b08_0"
    },
    {
        "source_sentence": "王便言曰：『若我福相應為王者，令我民眾獲自然穀，莫復作此。』",
        "translation": "The king then said, 'If I'm the king associated with my good fortune, let my people obtain natural grain and no longer do this.'",
        "source": "T04n0202_008:0403b08_1"
    },
    {
        "source_sentence": "發言已竟，一切人民，倉篅自滿，種種雜穀，隨意悉有。",
        "translation": "After he had finished speaking, all the people filled their storehouses with various kinds of miscellaneous grains as they wished.",
        "source": "T04n0202_008:0403b10_2"
    },
    {
        "source_sentence": "又經數時，復出外遊，見其國人，採薪汲水，舂磨作役，又問臣言：『今諸人眾，",
        "translation": "Several moments later, he went out on another excursion and saw the people of his country gathering firewood to draw water from the well-cleaned wood for irrigation. He was engaged in grinding and grinding butcher’s products as servants.",
        "source": "T04n0202_008:0403b11_3"
    },
    {
        "source_sentence": "故復勞苦？",
        "translation": "Therefore, it's also painful and troublesome?",
        "source": "T04n0202_008:0403b13_4"
    },
    {
        "source_sentence": "何以爾耶？』",
        "translation": "Why is that?'",
        "source": "T04n0202_008:0403b13_5"
    },
    {
        "source_sentence": "臣白王言：『蒙王恩澤，獲自然穀，穀叵生食，事須成熟，是以庶民，",
        "translation": "The ministers said to the king, “We have been blessed by Your Majesty’s grace with natural grain and are unable to produce any kind of food. We must ripen our crops so that they will be able to bear fruit.",
        "source": "T04n0202_008:0403b13_6"
    },
    {
        "source_sentence": "辦作食調。』",
        "translation": "He prepares food and adjusts it.'",
        "source": "T04n0202_008:0403b15_7"
    },
    {
        "source_sentence": "王復言曰：『若我福德，應為王者，令吾國內一切人民，若欲食時，有自然食，",
        "translation": "Again, the king said, “If it is by virtue of my merits that you should become king, please let all the people in my kingdom have their natural food when they wish to eat.",
        "source": "T04n0202_008:0403b15_8"
    },
    {
        "source_sentence": "恒在其前。』",
        "translation": "They'll always be in front of them.'",
        "source": "T04n0202_008:0403b17_9"
    },
    {
        "source_sentence": "發言已訖，合境皆獲自然之食。",
        "translation": "After they finish speaking, they'll all attain natural food in the conjunction of objects.",
        "source": "T04n0202_008:0403b17_10"
    },
    {
        "source_sentence": "又復經時，王更出遊觀，見眾人怱怱各執所務，紡織裁縫，辦具衣調。",
        "translation": "Again, after the night passed, the king again went out on a pleasure excursion and saw that the people were dressed in various ways to carry out their duties, such as weaving, weaving, cutting, and sewing clothes for clothing.",
        "source": "T04n0202_008:0403b18_11"
    },
    {
        "source_sentence": "王問臣言：『此諸人等！",
        "translation": "The king asked the ministers, 'These people!",
        "source": "T04n0202_008:0403b19_12"
    },
    {
        "source_sentence": "何以故爾，辛苦執作？』",
        "translation": "Why is it so painstakingly attached?'",
        "source": "T04n0202_008:0403b20_13"
    },
    {
        "source_sentence": "臣白王言：『蒙大王恩，獲自然食，今者作役，辦具衣裳。』",
        "translation": "The ministers said to the king, 'I've been blessed by the great king who gave me food naturally and now I'll serve as an official and prepare my robes and clothing.'",
        "source": "T04n0202_008:0403b20_14"
    },
    {
        "source_sentence": "王復言曰：『若我福德，應為王者，使吾國內一切樹木出自然衣。』",
        "translation": "The king then said, 'If I'm blessed, I should become the king, so that all the trees and trees in my country will produce natural clothing.'",
        "source": "T04n0202_008:0403b22_15"
    },
    {
        "source_sentence": "適發此語，國中諸樹，皆出妙衣，極為細濡，青黃赤白，隨人所好。",
        "translation": "When he spoke these words, all the trees in the kingdom produced exquisite robes that were extremely fine and soft, blue, yellow, red, and white, as people liked.",
        "source": "T04n0202_008:0403b23_16"
    },
    {
        "source_sentence": "又經數時，王復出遊，見於人民各各競共作諸樂器，王復問臣：『我國人民，",
        "translation": "Several moments later, the king returned from his excursion and found that the citizens were competing with each other in making instruments of music. The king asked his ministers again:",
        "source": "T04n0202_008:0403b25_17"
    },
    {
        "source_sentence": "何以故爾，勞煩執作？』",
        "translation": "Why is it so painful to cling to them?'",
        "source": "T04n0202_008:0403b26_18"
    },
    {
        "source_sentence": "臣白王言：『此諸人等，蒙大王恩，衣食自然，各獲安隱，事須伎樂，",
        "translation": "The ministers said to the king, “These people have been endowed by the great king with good fortune. All their food and clothing are provided naturally so that they can be at ease.",
        "source": "T04n0202_008:0403b27_19"
    },
    {
        "source_sentence": "用自娛樂，是以今者治伎樂器。』",
        "translation": "He uses it to amuse himself, so now he's curing the instrument of music and tricks.'",
        "source": "T04n0202_008:0403b28_20"
    },
    {
        "source_sentence": "王便言曰：『若我有福，應為王者，令我國中一切樹上，皆有種種樂器，",
        "translation": "The king said, “If I am blessed, I should be the king and cause all the trees in my kingdom to have various instruments of music.",
        "source": "T04n0202_008:0403b29_21"
    },
    {
        "source_sentence": "鼓具琴瑟、琵琶箜篌，一切所須，稱意悉有。』",
        "translation": "The drums, instruments, lutes, lutes, and gongs are all necessary, and they're all available according to their wishes.'",
        "source": "T04n0202_008:0403c02_22"
    },
    {
        "source_sentence": "「又經數時，諸王臣民，悉來拜賀，值王食時；",
        "translation": "Again, several moments later, the king’s ministers and subjects came to congratulate him on his arrival.",
        "source": "T04n0202_008:0403c03_23"
    },
    {
        "source_sentence": "時王即請，留與飲食。",
        "translation": "The king then invited him to stay and give him food and drink.",
        "source": "T04n0202_008:0403c04_24"
    },
    {
        "source_sentence": "爾時諸臣，得王飯食，百味具足，咸共白言：『臣等家食，其味薄少，",
        "translation": "At that time, when the ministers had obtained the king’s food of a hundred different flavors, they all said to each other, “Your majesty, we have eaten at home.",
        "source": "T04n0202_008:0403c04_25"
    },
    {
        "source_sentence": "今得王食，美味非凡。』",
        "translation": "Now that I've obtained the king's food, it's extraordinarily delicious.'",
        "source": "T04n0202_008:0403c06_26"
    },
    {
        "source_sentence": "王告之曰：『卿等臣民，若欲常得如我食者，用吾食時，食者皆得如是之食。』",
        "translation": "The king told them, 'You ministers, if you always want to get food like mine, then when you use my food, those who eat it will attain such food.'",
        "source": "T04n0202_008:0403c06_27"
    },
    {
        "source_sentence": "即勅司官：『吾食時到，恒鳴大鼓，令諸人民悉得聞知，用我時食，當得百味上妙之供。』",
        "translation": "He then instructed the officials, 'When my time comes to eat, I'll always sound a great drum so that all the people will hear it and know it; if they use my time to eat, they'll attain a wonderful offering of a hundred flavors.'",
        "source": "T04n0202_008:0403c08_28"
    },
    {
        "source_sentence": "從是已後，食便鳴鼓，一切人民，承音念食，百味上饌，自然在前，人民優樂，",
        "translation": "After that the drums sounded, and all the people ate according to their wishes. A hundred delicious foods of various flavors were naturally in front of them, accompanied by the happiness of the citizens.",
        "source": "T04n0202_008:0403c10_29"
    },
    {
        "source_sentence": "不可具陳。",
        "translation": "They can't be described in detail.",
        "source": "T04n0202_008:0403c12_30"
    },
    {
        "source_sentence": "「時王梵天，遣使來至蓋事王國，語蓋事言：『汝父在時，我以河水，",
        "translation": "The king Brahmā then sent an envoy to the kingdom of Kātyāyana and said to him, “When your father is alive, I will give you water from the river.",
        "source": "T04n0202_008:0403c12_31"
    },
    {
        "source_sentence": "用與汝父，汝父已終，宜當還我。』",
        "translation": "I'll give it to your father. Your father has died, so you should return it to me.'",
        "source": "T04n0202_008:0403c14_32"
    },
    {
        "source_sentence": "時蓋事王，報彼使曰：『我今境土，及以河水，亦非我力，強從汝得，",
        "translation": "The king then reported to the messenger, “The land and the water of the rivers that I have now possessed are not my possessions.",
        "source": "T04n0202_008:0403c15_0"
    },
    {
        "source_sentence": "然我為王，不勞民物。",
        "translation": "I am the king, however, and do not trouble the people or property.",
        "source": "T04n0202_008:0403c16_1"
    },
    {
        "source_sentence": "此蓋小事，宜停在後，須我面與汝王相見，乃當宣備國土之要。』",
        "translation": "This is a minor matter, so it's better to stay behind me; if I meet you king with my face, I'll explain the essentials of the land.'",
        "source": "T04n0202_008:0403c17_2"
    },
    {
        "source_sentence": "使還到國，一一白王，王然其意，剋日共期。",
        "translation": "The envoys returned to their countries and each told the king what they wished, but the king disagreed with his wishes and agreed to a fixed date.",
        "source": "T04n0202_008:0403c18_3"
    },
    {
        "source_sentence": "期日已滿，二王俱進，軍眾圍遶，甚多無數，各安大營，在河一邊，二王乘船，",
        "translation": "When the day was over, the two kings each advanced on one side of the river. Surrounded by an army of innumerable thousands of soldiers, they each arranged a big formation to camp on one side of the river. The two kings boarded the ship [to cross the river].",
        "source": "T04n0202_008:0403c19_4"
    },
    {
        "source_sentence": "河中相見。",
        "translation": "They saw each other in the river.",
        "source": "T04n0202_008:0403c21_5"
    },
    {
        "source_sentence": "時王梵天，初見蓋事，身色晃曜，如紫金山，頭髮奕奕，如紺琉璃，其目廣長，",
        "translation": "When the king Brahmā first saw the miraculous phenomenon, his body was shining like a mountain of purplish-gold. His hair stood on end like a violet lapis lazuli, and his eyes were wide and long.",
        "source": "T04n0202_008:0403c21_6"
    },
    {
        "source_sentence": "人中難有，敬心內發，謂是梵天。",
        "translation": "Among humans, it's rare to have a mind of reverence that arises internally, which is called the Brahma heaven.",
        "source": "T04n0202_008:0403c23_7"
    },
    {
        "source_sentence": "到相問訊，對坐一處，談兩國土，論索水事。",
        "translation": "When they arrived, they exchanged greetings and said goodbye to each other. They sat face-to-face in one place and talked among themselves about the matter of water supplies for both lands.",
        "source": "T04n0202_008:0403c23_8"
    },
    {
        "source_sentence": "蓋事報曰：『我國人民，所欲自然，亦無貲輸王役之勞。』",
        "translation": "He replied, 'The people of my country naturally want what they want, and there's no difficulty in paying the king's service.'",
        "source": "T04n0202_008:0403c24_9"
    },
    {
        "source_sentence": "所言未訖，食時已至，蓋事王軍，鳴鼓欲食。",
        "translation": "Before the meal had been served, the king’s army was already there and they were about to eat when the drum sounded.",
        "source": "T04n0202_008:0403c26_10"
    },
    {
        "source_sentence": "時梵天王，甚以惶懼，謂欲牽攝而取殺之，怖不自寧起謝己過，手足四布，",
        "translation": "The king of Brahmā was greatly frightened, thinking that he wanted to take them and kill them. Fearful, he did not feel at ease and apologized for his sins. His hands and feet spread in all directions.",
        "source": "T04n0202_008:0403c27_11"
    },
    {
        "source_sentence": "腹拍前地。",
        "translation": "His belly beats the front ground.",
        "source": "T04n0202_008:0403c28_12"
    },
    {
        "source_sentence": "蓋事自起，曉令還坐。",
        "translation": "When the matter arose on its own, he told him to return to his seat at dawn.",
        "source": "T04n0202_008:0403c29_13"
    },
    {
        "source_sentence": "復語之曰：『大王！",
        "translation": "Again, he said to him, 'Great king!",
        "source": "T04n0202_008:0403c29_14"
    },
    {
        "source_sentence": "何以恐怖如是？",
        "translation": "Why is it so terrifying?",
        "source": "T04n0202_008:0404a01_15"
    },
    {
        "source_sentence": "我軍食時，恒自鳴鼓。",
        "translation": "When our army ate, they always sounded their drums.",
        "source": "T04n0202_008:0404a01_16"
    },
    {
        "source_sentence": "所以爾者？",
        "translation": "Why is that?",
        "source": "T04n0202_008:0404a01_17"
    },
    {
        "source_sentence": "是我食時，用我時食，皆獲百味上饌之供。』",
        "translation": "When I eat, they use my food at the right time to obtain a hundred tasty and delicious offerings.'",
        "source": "T04n0202_008:0404a02_18"
    },
    {
        "source_sentence": "時王梵天復起合掌，白蓋事曰：『唯願大王！",
        "translation": "The king Brahmā again stood up with his palms joined and said to the lid, 'May it please you, great king!'",
        "source": "T04n0202_008:0404a03_19"
    },
    {
        "source_sentence": "普見臨覆我及國人，悉願降附，令諸民庶悉蒙恩澤。』",
        "translation": "They all see that they're overwhelming me and the people of my country, wishing to subdue them so that all the people will be blessed.'",
        "source": "T04n0202_008:0404a04_20"
    },
    {
        "source_sentence": "於是蓋事，典閻浮提，一切人民，盡獲安樂。",
        "translation": "Thus, they govern Jambudvīpa and all the people there will attain peace and happiness.",
        "source": "T04n0202_008:0404a05_21"
    },
    {
        "source_sentence": "「登位之後，處於正殿，群僚百官，宿衛侍立。",
        "translation": "“After ascending the throne, he was in the main hall with a group of officials and hundreds of officials standing guard over him.",
        "source": "T04n0202_008:0404a06_22"
    },
    {
        "source_sentence": "日初出時，有金輪寶從東方來，王遙見之，即下御座，右膝著地，向於輪所，",
        "translation": "When the sun began to rise, a golden wheel treasure came from the east. Seeing it from a distance, the king descended from his royal seat, knelt with his right knee on the ground, and faced the wheel.",
        "source": "T04n0202_008:0404a07_23"
    },
    {
        "source_sentence": "以手三招，輪已來至，千輻具足，光色昞著。",
        "translation": "He joined his hands three times, and the wheel came at once. Endowed with a thousand spokes, it was shiny and coarse in color.",
        "source": "T04n0202_008:0404a09_24"
    },
    {
        "source_sentence": "王告之曰：『若我應作轉輪王者，如法住處，汝便住中。』",
        "translation": "The king told him, 'If I should become a wheel-turning king, wherever I live according to the rules, you'll stay in it.'",
        "source": "T04n0202_008:0404a10_25"
    },
    {
        "source_sentence": "於是輪寶，當在王前虛空中住，其輪去地七多羅樹；",
        "translation": "Then the wheel treasure would hover in midair in front of the king, and its wheel would go to the seven palm trees on the ground.",
        "source": "T04n0202_008:0404a11_26"
    },
    {
        "source_sentence": "象寶、神珠、玉女、典兵、典藏寶，次第來至。",
        "translation": "The treasures of elephants, divine jewels, jadelike maidens, military treasures, and treasury treasures all came in order.",
        "source": "T04n0202_008:0404a12_27"
    },
    {
        "source_sentence": "時蓋事王七寶具足，典四天下，一切眾生，蒙王恩德，所欲自恣，王悉教令脩行十善，",
        "translation": "All the sentient beings of the four continents were endowed by the king’s kindness and virtue, and they performed whatever they wished to do for themselves. The king instructed them all to cultivate the ten good deeds.",
        "source": "T04n0202_008:0404a13_28"
    },
    {
        "source_sentence": "壽終之後，皆得生天。」",
        "translation": "After their lives end, they'll all be born in heaven.",
        "source": "T04n0202_008:0404a15_29"
    },
    {
        "source_sentence": "佛告阿難：「爾時剎羅伽利王者，豈異人乎？",
        "translation": "The Buddha told Ānanda, Isn't that a different person than the king of the kṣatriyas at the time?",
        "source": "T04n0202_008:0404a16_0"
    },
    {
        "source_sentence": "我身是也。",
        "translation": "This is the self-body.",
        "source": "T04n0202_008:0404a17_0"
    },
    {
        "source_sentence": "爾時父王罰闍達提，今現我父淨飯王是。",
        "translation": "It was then that my father, King Śuddhodana, punished Ajātaśatru, and now he's my father, King Jīvaka.",
        "source": "T04n0202_008:0404a17_1"
    },
    {
        "source_sentence": "爾時母者，今現我母摩訶摩耶是。",
        "translation": "The mother of that time is now my mother Mahāmaudgalyāyana.",
        "source": "T04n0202_008:0404a18_2"
    },
    {
        "source_sentence": "我因往昔慈愍眾生，恒以財法而攝取之，從是因緣，自致成佛，三界獨尊，",
        "translation": "Because of my compassion toward sentient beings in the past, I always took care of them with material goods and principles. As a result of these causes and conditions, I attained buddhahood on my own, honored only as the sole pre-eminent one in the three realms.",
        "source": "T04n0202_008:0404a19_3"
    },
    {
        "source_sentence": "無與等者。",
        "translation": "There's no equal.",
        "source": "T04n0202_008:0404a20_4"
    },
    {
        "source_sentence": "以此義故，一切眾生，皆應修習大慈潤益。」",
        "translation": "Because of this, all sentient beings should cultivate the nourishment of great compassion and benefit.",
        "source": "T04n0202_008:0404a21_5"
    },
    {
        "source_sentence": "爾時阿難復白佛言：「不審，世尊！",
        "translation": "It was then that Ānanda again said to the Buddha, Not sure, Bhagavān!",
        "source": "T04n0202_008:0404a22_6"
    },
    {
        "source_sentence": "過去世中，剎羅伽利轉輪聖王，以何因緣獲如是等無量功德，初入母胎寶蓋隨覆？」",
        "translation": "In a past life, why did the wheel-turning sage king Śāriputra attain such measureless merits for the first time when he entered his mother's womb and covered it with a jeweled lid?",
        "source": "T04n0202_008:0404a22_7"
    },
    {
        "source_sentence": "佛告阿難：「乃復過去久遠，無量阿僧祇劫，此閻浮提，波羅[木*奈]國，",
        "translation": "The Buddha said to Ānanda: How long ago did this Jambudvfpa, the country of Vārāṇasī, which had been in existence for immeasurable, incalculably long eon (i.e., one hundred and fifty thousand world ages)",
        "source": "T04n0202_008:0404a24_8"
    },
    {
        "source_sentence": "仙人山中，有辟支佛，恒於山中止住。",
        "translation": "In the mountain of sages, there's a pratyekabuddha who always stays on the mountain.",
        "source": "T04n0202_008:0404a26_9"
    },
    {
        "source_sentence": "時辟支佛，患身不調，往問藥師。",
        "translation": "The pratyekabuddha then became ill and unable to control himself, so he went to the physician.",
        "source": "T04n0202_008:0404a27_10"
    },
    {
        "source_sentence": "藥師語曰：『汝有風病，當須服乳。』",
        "translation": "The Healing Buddha said, 'You're suffering from a wind condition, so you must take milk.'",
        "source": "T04n0202_008:0404a28_11"
    },
    {
        "source_sentence": "時彼國中，有一薩薄，名曰阿利耶蜜羅，晉言聖友。",
        "translation": "In that country, there was a sattva named Āryamilā (known as Sage Friend in the Jin language).",
        "source": "T04n0202_008:0404a28_12"
    },
    {
        "source_sentence": "時辟支佛，往告其家，陳病所由，從其乞乳。",
        "translation": "The pratyekabuddha then went to his house, told the reason for his illness, and begged for milk from him.",
        "source": "T04n0202_008:0404b01_13"
    },
    {
        "source_sentence": "薩薄歡喜，便請供養，日給其乳，經於三月。",
        "translation": "Rejoicing, Sārthavāha then invited him to make offerings and gave him milk every day for three months.",
        "source": "T04n0202_008:0404b02_14"
    },
    {
        "source_sentence": "三月已竟，身病得差，感其善意，欲使主人獲大利益，踊在空中，坐臥行立，",
        "translation": "When the three months had ended, his body and mind were cured of illness. Because of his good intentions, wishing to enable the host to gain great benefit, he flew up into the air, sat, lay down, and walked [upright].",
        "source": "T04n0202_008:0404b03_15"
    },
    {
        "source_sentence": "身出水火，或現大身滿虛空中，又復現小入秋毫之裏，如是種種，現十八變。",
        "translation": "Water and fire emerge from their bodies, or they may show a large body filling space, or they may also show a small one entering the tiny part of an autumn's hair.",
        "source": "T04n0202_008:0404b05_0"
    },
    {
        "source_sentence": "於是聖友，極懷歡喜。",
        "translation": "The holy friend was greatly delighted.",
        "source": "T04n0202_008:0404b06_1"
    },
    {
        "source_sentence": "復從空下，重受其供，經於數時，乃入涅槃。",
        "translation": "Again, he descended from the sky and again accepted the offering. After a few moments, he entered nirvana.",
        "source": "T04n0202_008:0404b07_2"
    },
    {
        "source_sentence": "薩薄悲悼，追念無量，闍維其身，收取舍利，盛以寶瓶，用起鍮婆，香花伎樂，",
        "translation": "Sad and grieved, he was immeasurable in remembrance. Having cremated his body, he collected the relics, placed them in a jeweled pot, and set up a brass band to perform music with fragrant flowers and musicians’ instruments.",
        "source": "T04n0202_008:0404b08_3"
    },
    {
        "source_sentence": "種種妙物，持用供養。",
        "translation": "Various kinds of marvelous things were preserved and offered as offerings.",
        "source": "T04n0202_008:0404b10_4"
    },
    {
        "source_sentence": "所捉大蓋，以置其上，盡其形壽，供養此塔。",
        "translation": "The great canopy he captured was placed on top of the stupa and offered to it as an offering for the rest of his life.",
        "source": "T04n0202_008:0404b10_5"
    },
    {
        "source_sentence": "由其供養一辟支佛，四事供養，因此福報，無量世中，或生天上，或處人中，",
        "translation": "As a result of their offerings to one pratyekabuddha, they will be reborn in heaven or among humans for an infinite number of eons.",
        "source": "T04n0202_008:0404b11_6"
    },
    {
        "source_sentence": "尊豪挺特，世之少雙。」",
        "translation": "The venerable and powerful are extraordinary, rare in the world.",
        "source": "T04n0202_008:0404b13_7"
    },
    {
        "source_sentence": "又告阿難：「一切眾生，在家出家，皆應脩福，生生之中，獲如是利。」",
        "translation": "Again, he told Ānanda, All sentient beings who stay at home and leave home should cultivate goodness so that they'll attain such benefits in birth and birth.",
        "source": "T04n0202_008:0404b14_8"
    },
    {
        "source_sentence": "爾時阿難，及諸會眾，聞佛所說，歡喜奉行。",
        "translation": "At that time, having heard the Buddha’s discourse, Ānanda and the assembly of bhikṣus were delighted and remembered it well.",
        "source": "T04n0202_008:0404b15_9"
    },
    {
        "source_sentence": "（四〇）大施抒海品第三十五(丹本為三十九)",
        "translation": "(40.) Chapter 35 of the Great Ocean of generosity and lyricism (the Dan edition is thirty-nine)",
        "source": "T04n0202_008:0404b17_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在羅閱祇耆闍崛山中，與尊弟子千二百五十人俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Rājagṛdhrakūṭa in the mountains of Rājagṛha, accompanied by one thousand two hundred and fifty disciples.",
        "source": "T04n0202_008:0404b18_0"
    },
    {
        "source_sentence": "爾時世尊，念須侍者，諸尊弟子憍陳如等，各共觀察，知佛所念。",
        "translation": "At the time, the Bhagavān was mindful of the need for an attendant, and the venerable disciples Kauṇḍinya and so forth each observed it together to know what the Buddha thought.",
        "source": "T04n0202_008:0404b19_1"
    },
    {
        "source_sentence": "時憍陳如從坐而起，偏袒右肩，合掌長跪白佛：「貪得侍近捉衣持鉢，",
        "translation": "Kauṇḍinya then stood up from his seat, bared his right shoulder, joined his palms together, and knelt down long enough to tell the Buddha, I'm greedy to have an attendant near me who takes my robe and bowl.",
        "source": "T04n0202_008:0404b21_2"
    },
    {
        "source_sentence": "唯願垂愍！",
        "translation": "May it please you!",
        "source": "T04n0202_008:0404b22_3"
    },
    {
        "source_sentence": "賜教聽許。」",
        "translation": "I'll give you permission to teach and hear it.",
        "source": "T04n0202_008:0404b23_4"
    },
    {
        "source_sentence": "佛告之曰：「汝年老邁，自須給侍，何忍使汝復見供事？」",
        "translation": "The Buddha told him, You're so old and powerful that you need to be an attendant, so how can you tolerate it if you see the offerings again?",
        "source": "T04n0202_008:0404b23_5"
    },
    {
        "source_sentence": "時憍陳如知佛不聽，禮已還坐。",
        "translation": "Knowing that the Buddha wouldn't listen, Kauṇḍinya Tathāgata bowed and returned to his seat.",
        "source": "T04n0202_008:0404b24_6"
    },
    {
        "source_sentence": "摩訶迦葉、舍利弗、目揵連，及諸弟子五百人等，次第白佛，皆求給侍，",
        "translation": "Mahākāśyapa, Śāriputra, Maudgalyāyana, and the five hundred disciples told the Buddha in order, requesting to be served.",
        "source": "T04n0202_008:0404b25_7"
    },
    {
        "source_sentence": "佛皆不聽。",
        "translation": "None of the buddhas will listen.",
        "source": "T04n0202_008:0404b27_0"
    },
    {
        "source_sentence": "時阿那律試觀佛意，見佛志趣，心在阿難，如日在東照于舍宅，光從東牖直至西壁，",
        "translation": "When Anuruddha examined the Buddha’s thoughts, he perceived that his mind was concentrated in Ānanda’s direction and thought to himself, “It is as if the sun were shining eastward at my dwelling place; its light extended from the eastern wall of the house to the western wall.",
        "source": "T04n0202_008:0404b27_1"
    },
    {
        "source_sentence": "世尊志意亦復如是；",
        "translation": "The World-honored One’s aspiration is exactly like this.",
        "source": "T04n0202_008:0404b29_2"
    },
    {
        "source_sentence": "諸大弟子，皆亦觀知。",
        "translation": "All the great disciples also observed it.",
        "source": "T04n0202_008:0404b29_3"
    },
    {
        "source_sentence": "時舍利弗及目犍連，從坐處起，到阿難前，語阿難言：「世尊志意，欲得於仁以為侍者。",
        "translation": "Śāriputra and Maudgalyāyana then rose from their seats, went to Ānanda, and said to him, Bhagavān, I want to have you as my attendant.",
        "source": "T04n0202_008:0404c01_4"
    },
    {
        "source_sentence": "仁有善利，獨蒙稱可，宜速往白求為佛侍。」",
        "translation": "Your kindness has good benefits, so you're the only one who receives praise and approval, so it's advisable to quickly go there and ask for the Buddha to be your attendant.",
        "source": "T04n0202_008:0404c03_5"
    },
    {
        "source_sentence": "時賢者阿難，見諸上座來到其前，又聞其語，尋起合掌，白上座言：「世尊德重，",
        "translation": "Then the venerable Ānanda saw the superior monks coming before him. Hearing what they said, he stood up, joined his palms, and said to the superior monk, “O Bhagavat!",
        "source": "T04n0202_008:0404c04_6"
    },
    {
        "source_sentence": "智慧深遠，以我常近親侍奉事，懼招罪尤，自遺殃患。」",
        "translation": "His wisdom is profound, and because I'm always close to my relatives and serve them, I'm afraid they'll be especially guilty of crimes and leave me with the trouble of misfortune.",
        "source": "T04n0202_008:0404c06_7"
    },
    {
        "source_sentence": "舍利弗等復語之言：「今觀世尊，專注致意，欲得於仁以為侍者，如日初出照于室宅，",
        "translation": "Śāriputra and the others again said to him, “We now see that the World-honored One is concentrating his attention on your holiness, wishing to have you as his attendant.",
        "source": "T04n0202_008:0404c07_8"
    },
    {
        "source_sentence": "光從東牖直照西壁，世尊注心亦復如是。",
        "translation": "The light came from the east and shone straight over the western wall, just as did the World-honored One’s attention.",
        "source": "T04n0202_008:0404c09_9"
    },
    {
        "source_sentence": "又復世尊，究人情能知仁堪任，是以留意，宜時速白求為侍者。」",
        "translation": "Again, Bhagavān, the Bhagavān can investigate people's feelings and know their kindness and tolerance, so it's advisable to make an announcement as an attendant at the right time.",
        "source": "T04n0202_008:0404c10_10"
    },
    {
        "source_sentence": "賢者阿難重得是語，思惟是事，靡知所如，復更合掌，白諸上座：「若今世尊賜我三願，",
        "translation": "Having heard these words, the venerable Ānanda thought about this matter. Not knowing what he wished, he joined his palms and said to the superior monks, “If the World-honored One grants me three wishes now,",
        "source": "T04n0202_008:0404c12_0"
    },
    {
        "source_sentence": "我乃堪任為佛侍者。",
        "translation": "I'm then qualified to become the Buddha's attendant.",
        "source": "T04n0202_008:0404c14_1"
    },
    {
        "source_sentence": "何謂為三？",
        "translation": "What are these three?",
        "source": "T04n0202_008:0404c14_2"
    },
    {
        "source_sentence": "世尊故衣，勿與我著。",
        "translation": "Bhagavān, don't give me your old robe.",
        "source": "T04n0202_008:0404c14_3"
    },
    {
        "source_sentence": "世尊殘食，莫令我噉。",
        "translation": "Bhagavān, don't let me eat leftover food.",
        "source": "T04n0202_008:0404c15_4"
    },
    {
        "source_sentence": "時節進現，隨我裁量。",
        "translation": "The seasons and seasons will come and go according to my discretion.",
        "source": "T04n0202_008:0404c15_5"
    },
    {
        "source_sentence": "賜此三願，乃能侍佛。」",
        "translation": "By bestowing these three vows, they'll be able to serve the Buddha.",
        "source": "T04n0202_008:0404c16_6"
    },
    {
        "source_sentence": "舍利弗等聞是語已，具以其事，往白世尊。",
        "translation": "Having heard these words, Śāriputra and the others reported them to the World-honored One in detail.",
        "source": "T04n0202_008:0404c16_7"
    },
    {
        "source_sentence": "佛聞此已，告舍利弗：「諸弟子等！",
        "translation": "After hearing this, the Buddha told Śāriputra, Disciples!",
        "source": "T04n0202_008:0404c17_8"
    },
    {
        "source_sentence": "阿難所以求索不著我故衣者，阿難長慮恐諸弟子懷嫉妬者，而生此心：『國王臣民，",
        "translation": "Ānanda therefore begged the king not to put on my old clothes. Fearing that his disciples might harbor jealousy, Ānanda had this thought:",
        "source": "T04n0202_008:0404c18_9"
    },
    {
        "source_sentence": "諸檀越輩，施佛貴價細濡之衣；",
        "translation": "The donors offered the Buddha precious, fine and soft robes of great value.",
        "source": "T04n0202_008:0404c20_10"
    },
    {
        "source_sentence": "阿難貪此，故求給事。』",
        "translation": "Ānanda craves this, so he asks for a service.'",
        "source": "T04n0202_008:0404c21_11"
    },
    {
        "source_sentence": "復索不噉我殘食者，慮諸弟子復生此心：『如來鉢中，所食之餘，甘美百味，",
        "translation": "Again, if someone asks me not to eat what’s left over from my food, the disciples should think again: In the Tathāgata’s almsbowl, there are a hundred delicious and various flavors in addition to all the food he eats.",
        "source": "T04n0202_008:0404c21_12"
    },
    {
        "source_sentence": "世無此食；",
        "translation": "There is no such food in the world.",
        "source": "T04n0202_008:0404c23_13"
    },
    {
        "source_sentence": "阿難嗜故，而來側近。』",
        "translation": "Ānanda, it's because of his craving that he came to be nearby.'",
        "source": "T04n0202_008:0404c23_14"
    },
    {
        "source_sentence": "阿難所以索自裁量時節進現者，慮諸弟子及外道眾來求進現，有所難問，",
        "translation": "Ānanda, the reason [the Buddha] asked me to judge for myself the timing of my advancement in enlightenment was because he thought that his disciples and non-Buddhist followers might come to ask him questions.",
        "source": "T04n0202_008:0404c24_15"
    },
    {
        "source_sentence": "不知時節，儻相惱觸，又為侍者，當候時節，飲食所宜，便身益體，一一制度，",
        "translation": "They do not know the seasons and seasons; they are neither angry with each other nor displeased with each other. They serve as their attendants, attending the seasons and seasons, according to what is appropriate for eating and drinking, thereby enabling them to gain physical strength and body.",
        "source": "T04n0202_008:0404c26_16"
    },
    {
        "source_sentence": "慮過見及。",
        "translation": "He's worried about the faults and views that are present.",
        "source": "T04n0202_008:0404c28_0"
    },
    {
        "source_sentence": "是以先預索此三願。",
        "translation": "That's why he first asked for these three vows.",
        "source": "T04n0202_008:0404c28_1"
    },
    {
        "source_sentence": "又復阿難，不但今日索自知時，過去世時，奉侍於我，善知時宜。」",
        "translation": "Again, Ānanda, not only did he ask to know the time for himself today, but in a past life, he attended me and knew the proper time well.",
        "source": "T04n0202_008:0404c28_2"
    },
    {
        "source_sentence": "時舍利弗重白佛言：「不審過去奉事於佛，善知時宜，其事云何？」",
        "translation": "Śāriputra then repeatedly said to the Buddha, I don't know whether or not I served the Buddha in the past.",
        "source": "T04n0202_008:0405a01_3"
    },
    {
        "source_sentence": "佛告舍利弗：「汝欲聞者，諦聽著心！",
        "translation": "The Buddha told Śāriputra, If you want to hear it, listen closely and concentrate your mind!",
        "source": "T04n0202_008:0405a02_4"
    },
    {
        "source_sentence": "當為汝說。」",
        "translation": "I will explain it for you.",
        "source": "T04n0202_008:0405a03_5"
    },
    {
        "source_sentence": "「唯然世尊！",
        "translation": "Yes, Bhagavān!",
        "source": "T04n0202_008:0405a03_6"
    },
    {
        "source_sentence": "諾當善聽。」",
        "translation": "I promise to listen well.",
        "source": "T04n0202_008:0405a04_7"
    },
    {
        "source_sentence": "佛告舍利弗：「乃往過去無數無量阿僧祇劫，有大國王，領閻浮提八萬四千小國、八十億聚落，",
        "translation": "The Buddha said to Śāriputra: Countless, immeasurable, incalculable kalpas ago there was a great king who ruled over eighty-four thousand small countries and eighty-eight billion villages in Jambudvfpa.",
        "source": "T04n0202_008:0405a04_8"
    },
    {
        "source_sentence": "王所住城，名婆樓施舍。",
        "translation": "The city where the king lived was named Vārāṇasī.",
        "source": "T04n0202_008:0405a06_9"
    },
    {
        "source_sentence": "於是城中，有一婆羅門，號尼拘樓陀，聰明博達，天才殊邈，王甚宗戴，",
        "translation": "In the city there was a brahman named Nigrodha, an intelligent and erudite man of outstanding talent. The king esteemed him for his religious devotion.",
        "source": "T04n0202_008:0405a07_0"
    },
    {
        "source_sentence": "師而事之；",
        "translation": "He served them as his teacher.",
        "source": "T04n0202_008:0405a08_1"
    },
    {
        "source_sentence": "八萬四千諸小國王，悉遙敬慕，瞻仰所在，四遠貢獻，遣使諮承，略而言之，",
        "translation": "The kings of the eighty-four thousand small countries all admired him from afar and looked up to him in admiration. They contributed greatly to his edification by sending envoys from the four directions to consult with him.",
        "source": "T04n0202_008:0405a08_2"
    },
    {
        "source_sentence": "如奉大王。",
        "translation": "It's like serving the great king.",
        "source": "T04n0202_008:0405a10_3"
    },
    {
        "source_sentence": "於是婆羅門，富敵王家，但無子息可以紹繼，出入坐臥，每懷此愁，不知何方可以得子？",
        "translation": "The Brāhmaṇa, a wealthy and powerful king of the family, had no children to inherit. He came out, went in, sat, and lay down. With this sorrow in his mind, he did not know where they could get their children.",
        "source": "T04n0202_008:0405a10_4"
    },
    {
        "source_sentence": "即禱祀梵天、天帝四王、摩醯跋羅，及餘諸天日月星宿、山河樹神，種種禱祀，",
        "translation": "They then prayed to the Brahmadeva gods, the four heavenly kings Indra and Mahevardhana, the other gods, the sun, moon, stars, constellations, mountains, rivers, and trees, for various prayers.",
        "source": "T04n0202_008:0405a12_5"
    },
    {
        "source_sentence": "無所不遍。",
        "translation": "Nothing doesn't pervade it.",
        "source": "T04n0202_008:0405a14_6"
    },
    {
        "source_sentence": "剋誠積報經十二年，其大夫人便覺有娠，聰明女人，能得知此，自知所懷，",
        "translation": "After twelve years of earnestly accumulating rewards, the great wife suddenly became pregnant. The intelligent woman could tell where she was and knew what she was carrying.",
        "source": "T04n0202_008:0405a14_7"
    },
    {
        "source_sentence": "必是男兒，即以情事白婆羅門。",
        "translation": "It must be a boy, so he said to the Brāhmaṇa with affection.",
        "source": "T04n0202_008:0405a16_8"
    },
    {
        "source_sentence": "婆羅門歡喜，倍增怡躍，即勅家內夫人婇女，來共擁護夫人進止，飲食床薦，",
        "translation": "The brāhmaṇa was delighted and doubled in joy. He ordered the maidservants of his household to come with them to guard the queen’s house, offer her food and drink, seats, and beds.",
        "source": "T04n0202_008:0405a17_9"
    },
    {
        "source_sentence": "極令細濡，調適稱給，莫違其意。",
        "translation": "They are extremely fine and gentle, well-balanced and commended, and don't disagree with them.",
        "source": "T04n0202_008:0405a19_10"
    },
    {
        "source_sentence": "十月已滿，便生男兒，身紫金色，頭髮紺青，端正超異，人相難有。",
        "translation": "When the tenth month had passed, a boy was born. His body was purplish-gold in color and his hair was dark blue in color. He was so handsome and extraordinarily beautiful that it was difficult to find any human figures there.",
        "source": "T04n0202_008:0405a20_11"
    },
    {
        "source_sentence": "婆羅門見，喜不自勝，即召相師，來共相之。",
        "translation": "When the brahman saw this, he was overjoyed and unable to control himself. So he summoned his physiognomy teacher and came to meet him.",
        "source": "T04n0202_008:0405a21_12"
    },
    {
        "source_sentence": "相師披觀，嘆未曾有，此兒相好，福德弘廣，天下所瞻，如子賴母。",
        "translation": "The Master of physiology wore his outer robe and looked around, exclaiming that this was an unprecedented sight. This child had such good features and great virtue that people in the world looked upon him as if he were a child relying on his mother.",
        "source": "T04n0202_008:0405a22_13"
    },
    {
        "source_sentence": "其父歡喜，勅為立字。",
        "translation": "Rejoicing, his father instructed him to establish a name for him.",
        "source": "T04n0202_008:0405a24_14"
    },
    {
        "source_sentence": "天竺作字，依於二種：或依星宿，或依變異。",
        "translation": "The Sanskrit phonemes are of two kinds: sometimes according to the stars, sometimes according to the constellations; sometimes according to change.",
        "source": "T04n0202_008:0405a24_15"
    },
    {
        "source_sentence": "相師便問：『懷妊以來，有何變異？』",
        "translation": "The master of signs then asked, 'Since you were pregnant, what's changed?'",
        "source": "T04n0202_008:0405a25_16"
    },
    {
        "source_sentence": "其父答言：『此兒之母，素來忌惡，少於慈順，不脩慈慧；",
        "translation": "The father replied, “This boy’s mother had always been averse to evil. She was less compassionate and obedient; she did not cultivate kindness and wisdom.",
        "source": "T04n0202_008:0405a26_17"
    },
    {
        "source_sentence": "自懷妊來，心性改異，矜憐苦厄，如母愛子，志好布施，無有貪惜。』",
        "translation": "When he's pregnant, his mind changes and his nature is different, and he's overcome with pity for suffering and distress like a mother who loves her child and wishes to give generously without craving or stinginess.'",
        "source": "T04n0202_008:0405a27_18"
    },
    {
        "source_sentence": "相師聞之，歡喜而言：『是此兒志，故使然也。",
        "translation": "When the fortune teller heard this, he rejoiced and said, 'This is the boy's intention, so I made it happen.",
        "source": "T04n0202_008:0405a29_19"
    },
    {
        "source_sentence": "當為立字號摩訶闍迦樊，晉言大施。』",
        "translation": "He'll be given the name Mahādrikafan, which is a Sanskrit word for great gift.'",
        "source": "T04n0202_008:0405b01_20"
    },
    {
        "source_sentence": "「其兒漸大，父甚愛念，別為作宮，立三時殿，冬溫夏涼，春秋居中，",
        "translation": "When the child grew up, his father became very fond of him and built a separate palace for him. It is divided into three seasons: winter, spring, summer, and autumn.",
        "source": "T04n0202_008:0405b02_21"
    },
    {
        "source_sentence": "安諸妓侍，以娛樂之。",
        "translation": "He was accompanied by courtesans and attendants to entertain him.",
        "source": "T04n0202_008:0405b03_22"
    },
    {
        "source_sentence": "其兒聰明，好樂學問，誦持俗典，十八部書，文既通利，并善其義，學諸技術，",
        "translation": "The boy was intelligent and fond of learning. He could recite and memorize secular texts, as well as the eighteen kinds of scriptures in all eighteen languages. His grammar was comprehensive and his meaning good.",
        "source": "T04n0202_008:0405b04_23"
    },
    {
        "source_sentence": "靡所不通。",
        "translation": "Nothing is unfathomable.",
        "source": "T04n0202_008:0405b05_24"
    },
    {
        "source_sentence": "其後大施白其父言：『久在深宮，思欲出遊。』",
        "translation": "After that, the great donor said to his father, 'I've been in the deep palace for a long time and want to leave.'",
        "source": "T04n0202_008:0405b06_25"
    },
    {
        "source_sentence": "父聞此語，即勅臣吏：『我子大施，欲出遊行，掃灑街陌，除諸不淨，",
        "translation": "Hearing these words, the father said to his ministers, “My son’s gift is a great one. If you wish to go out on an excursion, sweep the streets and roads so that they are not dirty.",
        "source": "T04n0202_008:0405b07_26"
    },
    {
        "source_sentence": "竪諸幢幡，散華燒香，莊嚴道路，極令潔淨。』",
        "translation": "It's decorated with banners, streamers, flowers, burning incense, and roads that are extremely pure.'",
        "source": "T04n0202_008:0405b08_27"
    },
    {
        "source_sentence": "施設辦已，大施於是乘大白象，七寶挍飾，搥鍾鳴鼓，作倡伎樂，千乘萬騎，",
        "translation": "Having set up the chariot, Mahāsthāmaprāpta rode it on a great white elephant decorated with carriages made of the seven kinds of treasure and beating bells and chimes to sound the drums. They played music and danced in unison, accompanied by thousands of carts and myriad horses.",
        "source": "T04n0202_008:0405b09_28"
    },
    {
        "source_sentence": "導從前後，行大御道，往詣城門。",
        "translation": "They followed the Master before and after him, proceeded on the great royal road, and approached the city gates.",
        "source": "T04n0202_008:0405b11_29"
    },
    {
        "source_sentence": "於時國中人民之類，於樓閣上，挾道兩邊，競共觀看，無有厭足，皆各言曰：『甚奇甚妙！",
        "translation": "At the time, all the citizens of the country were standing on the two sides of the road in the tower, rushing to look at each other. They didn't tire of it, and each said, 'It's very rare and wonderful!'",
        "source": "T04n0202_008:0405b12_30"
    },
    {
        "source_sentence": "覩其威相，猶如梵天。』",
        "translation": "They see their authoritative appearance like the Brahma gods.'",
        "source": "T04n0202_008:0405b14_31"
    },
    {
        "source_sentence": "轉復前行，見諸乞兒，著弊壞衣，執持破器，卑言求哀：『匃我少許。』",
        "translation": "Again, he walks forward and sees the beggars wearing rags and broken robes, carrying broken bowls, and humbly saying, 'I'm sorry, I'm a little helpless.'",
        "source": "T04n0202_008:0405b14_32"
    },
    {
        "source_sentence": "大施見之，而問之曰：『汝等何以辛苦乃爾？』",
        "translation": "Seeing them, Mahāprajñāpāramitā asked them, 'Why are you so painful?'",
        "source": "T04n0202_008:0405b16_33"
    },
    {
        "source_sentence": "或有答言：『我無父母兄弟妻子，貧窮孤焭，無所恃怙。』",
        "translation": "Some people may reply, 'I have no parents, brothers, wives, or children, and I'm poor and helpless, with nothing to rely on.'",
        "source": "T04n0202_008:0405b17_34"
    },
    {
        "source_sentence": "或有答言：『我有長病，不能作役，自活無路。』",
        "translation": "Someone might reply, 'I'm seriously ill and can't serve, so there's no way to live on my own.'",
        "source": "T04n0202_008:0405b18_35"
    },
    {
        "source_sentence": "或有答言：『我之不幸，數遭破亡，債負盈集，身口所切，無方自濟，",
        "translation": "Or some people may reply, saying: Because of my misfortune, I have been repeatedly bankrupted and lost. My debts have accumulated to maturity, and there is no one who can help me by himself.",
        "source": "T04n0202_008:0405b19_36"
    },
    {
        "source_sentence": "是以行乞，以託餘命。』",
        "translation": "That's why I beg for it and entrust it to another life.'",
        "source": "T04n0202_008:0405b21_37"
    },
    {
        "source_sentence": "大施聞已，酸嘆而去。",
        "translation": "After hearing this, Mahāprajāpaṇa departed in distress.",
        "source": "T04n0202_008:0405b21_38"
    },
    {
        "source_sentence": "次復前行，見諸屠兒，[利-禾+皮]剝畜生，削割枰賣。",
        "translation": "Next, he went on and saw the butchers stripping away the animals and cutting them into pieces for sale.",
        "source": "T04n0202_008:0405b22_39"
    },
    {
        "source_sentence": "大施見問：『咄作何等？』",
        "translation": "Seeing Mahāprajñāpāramitā, he asked, 'What did you do?'",
        "source": "T04n0202_008:0405b23_40"
    },
    {
        "source_sentence": "各各言曰：『祖父已來，屠殺為業，若捨此事，無以自濟。』",
        "translation": "Each of them said, 'Since my grandfather's existence, slaughtering has been his business; if he abandons it, there's no way to help himself.'",
        "source": "T04n0202_008:0405b23_41"
    },
    {
        "source_sentence": "大施嘆息，捨之而去。",
        "translation": "The great donor ceased in admiration, abandoned it, and departed.",
        "source": "T04n0202_008:0405b25_42"
    },
    {
        "source_sentence": "次見耕者，以犁墾地，虫從土出，蝦蟇拾吞，復有蛇來，吞食蝦蟇，孔雀飛來，",
        "translation": "Next, he saw a plower plowing the land with a plow. An insect came out of the dirt and a frog swallowed it. Again, a snake came along to feed on the frogs and a peacock came flying in.",
        "source": "T04n0202_008:0405b25_43"
    },
    {
        "source_sentence": "啄食其蛇。",
        "translation": "They pecked at the snake and ate it.",
        "source": "T04n0202_008:0405b27_44"
    },
    {
        "source_sentence": "大施問之：『此作何等？』",
        "translation": "Mahāprajñāpāramitā asked him, 'What's this?'",
        "source": "T04n0202_008:0405b27_45"
    },
    {
        "source_sentence": "答言：『墾地於中下種，後當得穀以自供養，并復當得以輸王家。』",
        "translation": "He replied, 'The land will be cultivated and planted in the middle, and later you'll get grain to make your own offerings, and you'll also be able to transfer it to the king's home.'",
        "source": "T04n0202_008:0405b28_46"
    },
    {
        "source_sentence": "大施聞已，深歎而去。",
        "translation": "Having heard this, Daishi departed in deep admiration.",
        "source": "T04n0202_008:0405b29_47"
    },
    {
        "source_sentence": "次復前行，見諸獵者，張網設罝，捕諸禽獸；",
        "translation": "Next, on his way ahead he saw hunters setting up nets and arrowheads to catch birds and beasts.",
        "source": "T04n0202_008:0405c01_48"
    },
    {
        "source_sentence": "見諸禽獸，墮罝網中，自挽自頓，不能得脫，悲鳴相喚，各懷怖懼。",
        "translation": "They saw all the birds and beasts plunged into a net of abscesses, pulling themselves in their own troops but unable to get free. Each cried out in distress and was terrified when they saw this.",
        "source": "T04n0202_008:0405c02_49"
    },
    {
        "source_sentence": "大施見之，『何以作此？』",
        "translation": "When Mahāprajñāpāramitā saw him, he said, 'Why did you do this?'",
        "source": "T04n0202_008:0405c03_50"
    },
    {
        "source_sentence": "各共答言：『我等唯仰獵殺為業，若不為此，存活無路。』",
        "translation": "Each of them replied, 'We only look up to hunting and killing as our occupation; if we don't do so, there's no way to survive.'",
        "source": "T04n0202_008:0405c04_51"
    },
    {
        "source_sentence": "聞其語已，酸傷而去。",
        "translation": "Having heard these words, they departed in distress.",
        "source": "T04n0202_008:0405c05_52"
    },
    {
        "source_sentence": "次復前行，見捕魚師，張設羅網，所得甚多，積著陸地，趣能動搖。",
        "translation": "Going on, the Master saw a fisherman who had set up a net of sole. He caught a great deal of fish and accumulated it on land, which he was able to steer and shake as he approached his destination.",
        "source": "T04n0202_008:0405c06_53"
    },
    {
        "source_sentence": "復問其故：『咄何以爾？』",
        "translation": "Again, he asked them why, 'Why is that?'",
        "source": "T04n0202_008:0405c07_54"
    },
    {
        "source_sentence": "各前答言：『祖父已來，無餘生業，唯仰捕魚，賣供衣食。』",
        "translation": "Each of them had previously replied, 'Since my grandfather's birth, there's nothing left to do in life but look up to fishing and selling clothing and food.'",
        "source": "T04n0202_008:0405c08_55"
    },
    {
        "source_sentence": "大施見已，甚懷愍悼，而自思惟：『是諸眾生，皆由貧窮乏衣食故，為此惡業，",
        "translation": "Seeing this, the great donor deeply grieved and thought to himself, “All these sentient beings have done this evil deed because they are poor in food and clothing.",
        "source": "T04n0202_008:0405c09_56"
    },
    {
        "source_sentence": "殺害眾生，歡喜極意；",
        "translation": "To kill sentient beings they rejoice with extreme joy.",
        "source": "T04n0202_008:0405c11_57"
    },
    {
        "source_sentence": "壽終之後，當歸三塗，從冥入冥，何其怪哉？』",
        "translation": "After his life ends, he'll return to the three destinies and enter darkness from darkness into darkness, so why is that strange?'",
        "source": "T04n0202_008:0405c11_58"
    },
    {
        "source_sentence": "作是念已，迴駕還宮，思憶是事，愁憂不樂。",
        "translation": "After he had this thought, he returned to the palace and reflected on it, feeling disheartened and unhappy.",
        "source": "T04n0202_008:0405c12_59"
    },
    {
        "source_sentence": "往見其父，求索一願。",
        "translation": "When he went to see his father, he asked for a vow.",
        "source": "T04n0202_008:0405c13_60"
    },
    {
        "source_sentence": "父語大施：『隨汝所求，終不相違。』",
        "translation": "The father said to the great donor, 'Whatever you ask for, it's never contradictory.'",
        "source": "T04n0202_008:0405c14_61"
    },
    {
        "source_sentence": "即自說言：『先日出遊，覩彼人民，求衣求食，勞形役思，殺害欺誑，",
        "translation": "He said to himself, “ Yesterday I went out on an excursion to see the people there. Seeking food and clothing in order to feed them, I was engaged in physical and mental torture, killing, maiming, and deceiving [them].",
        "source": "T04n0202_008:0405c14_62"
    },
    {
        "source_sentence": "具諸惡業，意甚矜憐，思欲賑給。",
        "translation": "Being endowed with evil deeds, he was overcome with great affection and desired to provide for him.",
        "source": "T04n0202_008:0405c16_63"
    },
    {
        "source_sentence": "唯願垂恩，施我大藏，聽自恣施濟眾所乏。』",
        "translation": "Please be gracious, give me the great store and allow me to freely give it to help those who lack it.'",
        "source": "T04n0202_008:0405c17_64"
    },
    {
        "source_sentence": "父告之曰：『我聚財寶，盡為汝故，汝意欲爾，奈何相違？』",
        "translation": "The father told him, 'My accumulated wealth and treasures are all for your sake; what's the contradiction with you wanting them?'",
        "source": "T04n0202_008:0405c18_65"
    },
    {
        "source_sentence": "「兒得父教，即勅宣下一切人民：『摩訶闍迦樊欲設大檀，有所須者，",
        "translation": "Having received his father’s instruction, the Licchavi Vimalakīrti issued an edict to all the citizens, saying:",
        "source": "T04n0202_008:0405c19_66"
    },
    {
        "source_sentence": "皆悉來取。』",
        "translation": "They'll all come to take it.'",
        "source": "T04n0202_008:0405c21_67"
    },
    {
        "source_sentence": "唱令已訖，沙門婆羅門、貧窮負債、孤苦疾病，諸城道路前後而去。",
        "translation": "After the order had been announced, the ascetics and priests, the poor and in debt, orphaned and suffering from illness, departed at the front and behind the roads of the cities.",
        "source": "T04n0202_008:0405c21_68"
    },
    {
        "source_sentence": "諸人民輩，有從百里二三五百千里來者，復從三千五千萬里來者，皆強弱相扶，",
        "translation": "Some of the inhabitants came from a distance of one hundred li, two, three, or five hundred thousand li; some came from a distance of thirty-five thousand li.",
        "source": "T04n0202_008:0405c22_69"
    },
    {
        "source_sentence": "四方雲集，一切給與，滿其所願。",
        "translation": "They gathered in clouds in the four directions and gave everything to fulfill their wishes.",
        "source": "T04n0202_008:0405c24_70"
    },
    {
        "source_sentence": "須衣與衣，須食給食，金銀七寶，車馬輦輿，園田六畜，稱意而與。",
        "translation": "They gave food and drink to those who needed clothing, the seven treasures of gold and silver, carts, horses, carriages, mules, and six kinds of animals in the garden as they wished.",
        "source": "T04n0202_008:0405c25_71"
    },
    {
        "source_sentence": "如是布施，經數時中，諸藏之物，三分已二、時典藏吏，往白其父：『摩訶闍迦樊，",
        "translation": "Within a few moments after giving in this way, the treasury officials of the three-thirds and two-fourths portions of the collection said to his father, “O Mahāprajā kāfan!",
        "source": "T04n0202_008:0405c27_72"
    },
    {
        "source_sentence": "自布施來，藏物三分，已施其二。",
        "translation": "He gave three-thirds of his own almsgiving to the store, and he gave two.",
        "source": "T04n0202_008:0405c28_73"
    },
    {
        "source_sentence": "諸王信使，當有往返，願熟思惟，後勿見責。』",
        "translation": "The kings believe that there will be a return, and may they deliberate on it carefully so that they won't be blamed later.'",
        "source": "T04n0202_008:0405c29_74"
    },
    {
        "source_sentence": "父聞吏語，自思惟言：『吾愛此子，不能距逆，寧復空藏，何能中斷如是布施？』",
        "translation": "When the father heard the official's words, he thought to himself, 'I love this son, and I can't distance myself from him; how could I stop such generosity if I were to store it in emptiness?'",
        "source": "T04n0202_008:0406a01_75"
    },
    {
        "source_sentence": "復經數時，用殘藏物，三分復二。",
        "translation": "After a few more moments, he uses the leftover treasure, which is three-thirds and two-quarters long.",
        "source": "T04n0202_008:0406a03_76"
    },
    {
        "source_sentence": "吏復更白：『前所殘物，三分之中已更用二。",
        "translation": "The officials again said, 'Among the three parts of the property that was left behind earlier, I've already used two more.",
        "source": "T04n0202_008:0406a04_77"
    },
    {
        "source_sentence": "諸王信使，事須報知，今藏垂空，願更重思。』",
        "translation": "The kings believe that messengers need to be rewarded for their actions and know that the present treasure is hanging in the sky, so they may think again.'",
        "source": "T04n0202_008:0406a05_78"
    },
    {
        "source_sentence": "時婆羅門而語吏言：『吾愛此子，愛心隆厚未曾違失、面折其意。",
        "translation": "The Brāhmaṇa then said to the officials, 'I love this son, and his craving is so strong that I've never disobeyed him or offended his mind.",
        "source": "T04n0202_008:0406a06_79"
    },
    {
        "source_sentence": "汝可方便，假設因緣，來求物時乍稱不在，且令餘殘延引日月。』",
        "translation": "You may use skillful means to suppose the causes and conditions are present, and when you come to ask for something, you'll at first call it not present, and then cause the remaining residue to lead the sun and moon.'",
        "source": "T04n0202_008:0406a07_80"
    },
    {
        "source_sentence": "吏得語已，即閉藏戶，小復他行。",
        "translation": "After he had spoken these words, the official closed the door of the storehouse and went to another place.",
        "source": "T04n0202_008:0406a09_81"
    },
    {
        "source_sentence": "乞兒來集，至大施所，大施將來詣吏求物，其吏不在，比行推覓，經歷時節，",
        "translation": "The beggar children came and assembled at the place where the almsgiving was to be given. When the great donor approached the official who was about to go ask for some goods but the official was not there, he went in search of them by traveling through different seasons.",
        "source": "T04n0202_008:0406a09_82"
    },
    {
        "source_sentence": "困乃得之，雖復得物，不稱時要。",
        "translation": "When he was in distress, he got it, but even though he had obtained some things, they didn't seem to be the essentials at the time.",
        "source": "T04n0202_008:0406a11_83"
    },
    {
        "source_sentence": "大施自念：『今此小吏自力何敢不承受我？",
        "translation": "The great donor thought to himself, 'Now, how dare this young official not bear me with his own strength?'",
        "source": "T04n0202_008:0406a12_84"
    },
    {
        "source_sentence": "將是父意故使爾耳。",
        "translation": "It's because it's the father's intention to cause you to do so.",
        "source": "T04n0202_008:0406a13_85"
    },
    {
        "source_sentence": "又人子之法，不宜空竭父母之藏令其盡也。",
        "translation": "Furthermore, according to the law of human beings, it's not advisable to exhaust the parents' storehouse in space and make it empty.",
        "source": "T04n0202_008:0406a14_0"
    },
    {
        "source_sentence": "今此藏中，所殘無幾。』",
        "translation": "Now, there's not much left in this store.'",
        "source": "T04n0202_008:0406a15_1"
    },
    {
        "source_sentence": "作是念已，『我當云何多得財寶，用滿我意，濟給群生？』",
        "translation": "After he thought this, 'How will I obtain much wealth and treasure that fulfills my wishes and help sentient beings?'",
        "source": "T04n0202_008:0406a15_2"
    },
    {
        "source_sentence": "即問諸人：『今此世間，作何事業，可得多財用之難盡？』",
        "translation": "He asked the people, 'What kind of work can be done in this world now that's difficult to fulfill with a lot of money?'",
        "source": "T04n0202_008:0406a16_3"
    },
    {
        "source_sentence": "或有人言：『多種五穀，脩治園圃，可得多財。』",
        "translation": "Some people may say, 'There are many kinds of five grains that cultivate the garden and storehouse to obtain a lot of wealth.'",
        "source": "T04n0202_008:0406a18_4"
    },
    {
        "source_sentence": "或有人言：『多養六畜，隨時蕃息，可得多財。』",
        "translation": "Perhaps someone says, 'There are many six animals that raise a lot of money to be raised, so they can live in the country at any time.'",
        "source": "T04n0202_008:0406a19_5"
    },
    {
        "source_sentence": "或有人言：『不避劇難，遠出行估，最得多財。』",
        "translation": "Perhaps someone says, 'If you don't avoid great difficulties and travel far to appraise it, you'll most likely attain much wealth.'",
        "source": "T04n0202_008:0406a20_6"
    },
    {
        "source_sentence": "或有人言：『唯有入海，採取珍寶，最得多財。』",
        "translation": "Some people might say, 'There's only the most abundant wealth to be found by entering the ocean and collecting treasures.'",
        "source": "T04n0202_008:0406a21_7"
    },
    {
        "source_sentence": "大施聞此，而自言曰：『耕種養畜，遠出行估，既非我宜，得利無幾。",
        "translation": "Having heard these words, Mahāprajāpaṇa said to himself, “I am engaged in farming and raising livestock. If you go far away to appraise the value of my land it will not be good for me; I shall gain no little profit.” Hearing this, Mahāprajāpaṇa thought:",
        "source": "T04n0202_008:0406a22_8"
    },
    {
        "source_sentence": "唯有入海，此計可從。",
        "translation": "The only thing he can do is to enter the sea, and this is a calculation that can be followed.",
        "source": "T04n0202_008:0406a24_0"
    },
    {
        "source_sentence": "我當力勵，求辦此事。』",
        "translation": "I will exert myself and seek to accomplish this.'",
        "source": "T04n0202_008:0406a24_1"
    },
    {
        "source_sentence": "作是念已，往白父母：『今欲入海，求多珍寶，還用施給，濟民所乏，",
        "translation": "Having thought thus, he went to his parents and said: I am about to go into the sea. If you seek a great deal of rare treasures, why don’t you donate them back to help those who need them?",
        "source": "T04n0202_008:0406a25_2"
    },
    {
        "source_sentence": "唯願見聽，得遂所志。』",
        "translation": "I only wish to see and hear it, and I'll get what I want.'",
        "source": "T04n0202_008:0406a26_3"
    },
    {
        "source_sentence": "「父母聞語，驚而問言：『世人入海，窮貧無計，分棄身命，無所顧戀。",
        "translation": "When his parents heard these words, they were startled and asked, 'The people of the world entered the sea, became poor and helpless, abandoned their bodies and lives, and didn't care about anything.",
        "source": "T04n0202_008:0406a27_4"
    },
    {
        "source_sentence": "汝有何事，復欲習此？",
        "translation": "What is the matter with which you would like to be accustomed again?",
        "source": "T04n0202_008:0406a28_5"
    },
    {
        "source_sentence": "若欲布施，我家所有，一切眾物，及藏中殘，盡令汝用，莫入大海。",
        "translation": "If you want to make a gift, don't enter the ocean with all the things in my house and what's left in the storehouse for your use.",
        "source": "T04n0202_008:0406a29_6"
    },
    {
        "source_sentence": "又復海中，眾難甚多，水浪迴波，摩竭大魚，惡龍羅剎，水色之山，如是眾嶮，",
        "translation": "Again, there are many difficulties in the ocean. The water waves and eddies of the waves, the big fish maggots, evil dragons and rākṣasa demons, as well as the mountains with the color of water all make up this kind of precipitous formation.",
        "source": "T04n0202_008:0406b01_7"
    },
    {
        "source_sentence": "難可經過。",
        "translation": "It's difficult to pass through.",
        "source": "T04n0202_008:0406b03_8"
    },
    {
        "source_sentence": "汝有何急，投身此難？",
        "translation": "What's urgent for you to throw yourself into this difficulty?",
        "source": "T04n0202_008:0406b03_9"
    },
    {
        "source_sentence": "我等命存，終不相聽。",
        "translation": "We are still alive, but we won’t listen.",
        "source": "T04n0202_008:0406b04_10"
    },
    {
        "source_sentence": "宜息汝意，勿多紛紜。』",
        "translation": "It's advisable to stop your thoughts and don't be so confused.'",
        "source": "T04n0202_008:0406b05_0"
    },
    {
        "source_sentence": "大施聞此，願不從心，甚懷悒慼，而自心念：『我今所願，欲辦大事，",
        "translation": "Having heard these words, Mahāprajāpaṇi wished to do so without compulsion. With a feeling of anguish in his heart, he thought to himself, “Whatever I wish now is for the accomplishment of great work.",
        "source": "T04n0202_008:0406b05_1"
    },
    {
        "source_sentence": "設復貪身，事何由成？』",
        "translation": "If there's another craving for the body, how could it be accomplished?'",
        "source": "T04n0202_008:0406b07_2"
    },
    {
        "source_sentence": "以身布地，伏父母前，而自言曰：『若必顧留，違我志願，伏身此地，",
        "translation": "He spread his body on the ground and subdued it in front of his parents.",
        "source": "T04n0202_008:0406b07_3"
    },
    {
        "source_sentence": "終不復起。』",
        "translation": "They'll never arise again.'",
        "source": "T04n0202_008:0406b09_4"
    },
    {
        "source_sentence": "父母聞此，心懷灼然，與諸內官，前諫喻曰：『海道遼遠，險難事多，",
        "translation": "When his parents heard this, they were overcome with anguish in their minds and said to the officials of the court, “The sea is a long way off. There are many dangers and difficulties along the way.",
        "source": "T04n0202_008:0406b09_5"
    },
    {
        "source_sentence": "往者甚眾，來還者尠。",
        "translation": "There were many people coming and going, but those who came and went looked at each other.",
        "source": "T04n0202_008:0406b10_6"
    },
    {
        "source_sentence": "我念求子，禱祀諸天，精誠懇惻，靡所不遍，經十二年，困乃從願。",
        "translation": "I prayed to the gods with sincerity and earnestness, reaching everywhere for twelve years. When I was in distress, I complied with my vow.",
        "source": "T04n0202_008:0406b11_7"
    },
    {
        "source_sentence": "適汝長大，欲得捨我？",
        "translation": "When you grow up, do you want to abandon me?",
        "source": "T04n0202_008:0406b13_0"
    },
    {
        "source_sentence": "念棄此志，還起飲食。』",
        "translation": "He's mindful of abandoning this intention and returning to eating and drinking.'",
        "source": "T04n0202_008:0406b13_1"
    },
    {
        "source_sentence": "從一日二日至于六日，如是種種，諫喻求曉；",
        "translation": "From one day, two days, up to six days, they admonish in this way and so forth:",
        "source": "T04n0202_008:0406b14_0"
    },
    {
        "source_sentence": "其言如初，執志不迴。",
        "translation": "He said, As before, he clings to his intention and doesn't turn back.",
        "source": "T04n0202_008:0406b15_1"
    },
    {
        "source_sentence": "父母心懼，自共議言：『此兒前後，欲有所作，要令成辦，未曾中退，",
        "translation": "The parents were frightened and said among themselves, “This child should be able to accomplish whatever he wishes before or after him.",
        "source": "T04n0202_008:0406b15_2"
    },
    {
        "source_sentence": "就令入海，猶望還期，今必拒遮，到其七日，交見其禍，為之奈何？",
        "translation": "On the seventh day he was about to enter the sea but still wished to return home. So he would have to refuse to provide lodging for him, and on the seventh day he came back with a report of his misfortune. How could he do so?",
        "source": "T04n0202_008:0406b17_3"
    },
    {
        "source_sentence": "宜當聽去，轉憂在後。』",
        "translation": "It's advisable for you to listen and leave, and your grief will be behind.'",
        "source": "T04n0202_008:0406b18_4"
    },
    {
        "source_sentence": "言議已決，俱來兒邊，各捉一手，而語兒言：『聽隨汝意，起還就食。』",
        "translation": "After the discussion had been settled, they all came to their children's side and each grabbed one hand and said to their children, 'Listen as you wish, get up and return to your food.'",
        "source": "T04n0202_008:0406b19_5"
    },
    {
        "source_sentence": "「大施聞此，即起就飯。",
        "translation": "When Daishi heard this, he got up and ate his rice.",
        "source": "T04n0202_008:0406b20_6"
    },
    {
        "source_sentence": "飯食已訖，即起出外，廣行宣令，告語眾人：『我今躬欲入海採寶，誰欲往者？",
        "translation": "Having finished his meal, he rose from his seat and departed. He extensively instructed the people to tell him: I now wish to go into the ocean in person to collect treasures. Who would like to go?",
        "source": "T04n0202_008:0406b21_7"
    },
    {
        "source_sentence": "可共俱進。",
        "translation": "They can both advance together.",
        "source": "T04n0202_008:0406b23_0"
    },
    {
        "source_sentence": "我為薩薄，自辦行具。』",
        "translation": "I'll prepare my own implements for you, Sārthavāha.'",
        "source": "T04n0202_008:0406b23_1"
    },
    {
        "source_sentence": "於時國中，有五百人，聞是令已，僉然應命。",
        "translation": "At that time there were five hundred people in the kingdom and, having heard this decree, they all agreed to obey it.",
        "source": "T04n0202_008:0406b23_2"
    },
    {
        "source_sentence": "即辦所須，剋定發日。",
        "translation": "He then prepared what he needed and set out for the day.",
        "source": "T04n0202_008:0406b24_3"
    },
    {
        "source_sentence": "日到裝駕，辭別趣道，王與群臣并其父母、諸王太子臣民之類，數千萬人，",
        "translation": "The king, his ministers, their parents, crown princes, and other officials were accompanied by several tens of thousands of people.",
        "source": "T04n0202_008:0406b25_4"
    },
    {
        "source_sentence": "送到路次，各贈妙寶，供道所須，啼哭斷絕，於是別去。",
        "translation": "Each of them presented the wonderful treasures they needed to make offerings to the Buddha, weeping and wailing ceaselessly. So they departed.",
        "source": "T04n0202_008:0406b27_0"
    },
    {
        "source_sentence": "轉行數日，止宿曠野，值遇群賊，來欲伺盜；",
        "translation": "Several days after his journey he spent the night in the wilderness, where he met a group of thieves who came to search for him.",
        "source": "T04n0202_008:0406b28_1"
    },
    {
        "source_sentence": "菩薩憐愍，即以所齎，盡用匃與。",
        "translation": "With pity, the bodhisattva gave it to him with what he brought.",
        "source": "T04n0202_008:0406b29_2"
    },
    {
        "source_sentence": "轉前到城，城名放鉢，城中有婆羅門，名迦毘梨。",
        "translation": "He proceeded on his way to the city. The name of the city was放鉢, and there was a brahman named Kapilavastu in the city.",
        "source": "T04n0202_008:0406c01_0"
    },
    {
        "source_sentence": "於時大施，往到其所，欲從貸索三千兩金。",
        "translation": "At the time, he gave a great gift and went to him, wanting to borrow 3,000 taels of gold.",
        "source": "T04n0202_008:0406c02_1"
    },
    {
        "source_sentence": "時婆羅門，有一妙女，身紫金色，頭髮紺青，端正絕世，更無儔類，八萬四千諸小國王，",
        "translation": "The brahman saw a beautiful woman of purple color, with blue hair and gray body. She was the best-looking beauty in the world; there were no other women like her. All the eighty-four thousand kings of the small countries [of Jambudvlpa]",
        "source": "T04n0202_008:0406c03_2"
    },
    {
        "source_sentence": "皆為太子，求悉不許。",
        "translation": "They all asked for the prince, but he didn't allow them to do so.",
        "source": "T04n0202_008:0406c05_3"
    },
    {
        "source_sentence": "是時大施，到其門中，問迦毘梨：『欲共相見。』",
        "translation": "At that point, the great donor went to his door and asked Kapilavastu, 'I want to see you together.'",
        "source": "T04n0202_008:0406c05_4"
    },
    {
        "source_sentence": "其女在內，聞外語聲，歡喜驚起，語父母言：『在外之者，斯是我聟。』",
        "translation": "When the woman was inside, she heard the sounds of external words and became joyous and startled, telling her parents, 'This is my arrow that's outside.'",
        "source": "T04n0202_008:0406c06_5"
    },
    {
        "source_sentence": "時迦毘梨，即出相見，覩其色狀，知必非凡，聞其須金，一切許給。",
        "translation": "Kapilavastu then came out to meet him. Knowing that he must not be an ordinary man, he asked for the gold and gave it to him in full.",
        "source": "T04n0202_008:0406c08_6"
    },
    {
        "source_sentence": "又復左手，捉金澡罐，右手捉女，語大施言：『今我此女，容貌殊異，",
        "translation": "Again, with his left hand holding the golden pitcher for washing, he held the woman in his right hand and said to the great donor, “This woman of mine has an extraordinary appearance.",
        "source": "T04n0202_008:0406c09_7"
    },
    {
        "source_sentence": "諸王遣使，各為子求；",
        "translation": "The kings sent envoys, each seeking for the sake of his children.",
        "source": "T04n0202_008:0406c11_8"
    },
    {
        "source_sentence": "今覩薩薄，端正相似，請以此女，用相奉侍。』",
        "translation": "Now, Kauṣṭhila, who's similar in appearance and looks good-looking, asks this woman to serve him.'",
        "source": "T04n0202_008:0406c11_9"
    },
    {
        "source_sentence": "大施答言：『我今方當涉難入海，焉知能得安全還不？",
        "translation": "Mahāprajñāpāramitā replied, 'Now that I'm about to enter the ocean with difficulty, how could I know if I can return safely?'",
        "source": "T04n0202_008:0406c12_10"
    },
    {
        "source_sentence": "預受君女，此非所以。』",
        "translation": "This is not the reason for accepting a woman in advance.'",
        "source": "T04n0202_008:0406c14_11"
    },
    {
        "source_sentence": "迦毘梨言：『若令吉還，當為我受。』",
        "translation": "Kapilavastu said, 'If you cause me to return with good fortune, you'll accept it for me.'",
        "source": "T04n0202_008:0406c14_12"
    },
    {
        "source_sentence": "是時大施，即許可之。",
        "translation": "At that point, the great donor approves of it.",
        "source": "T04n0202_008:0406c15_13"
    },
    {
        "source_sentence": "「時迦毘梨歡喜，便與三千兩金及餘所須。",
        "translation": "Kapilavastu then rejoiced and gave 3,000 taels of gold and whatever else he needed.",
        "source": "T04n0202_008:0406c15_14"
    },
    {
        "source_sentence": "於是共別，轉前到海，勅語賈人牢治其船，令有七重，候風以至，推著海中，",
        "translation": "So they parted company and proceeded on their way to the sea. The captain instructed the merchants to fix the boat firmly, so that it would be seven stories high; and when the wind was about to blow he pushed her into the sea.",
        "source": "T04n0202_008:0406c16_15"
    },
    {
        "source_sentence": "以七張大索，繫於岸邊，便搖鈴唱令，告眾賈人：『汝等皆聽海中之難，",
        "translation": "He tied the great seven-pronged rope around the shore, shook the bell and called an order, telling the merchants, “Listen attentively to the difficulties of the sea.",
        "source": "T04n0202_008:0406c18_16"
    },
    {
        "source_sentence": "黑風羅剎，水浪洄澓，惡龍毒氣，水色之山，摩竭大魚，眾難甚多。",
        "translation": "Rāṣṭrapāla of black wind, the waves of water and swirling currents, bad dragons with poisonous breath, mountains with the color of water, and large fish species such as mahogaras have great difficulty in many ways.",
        "source": "T04n0202_008:0406c20_17"
    },
    {
        "source_sentence": "百伴入海，時一安還。",
        "translation": "A hundred companions entered the sea and returned at once.",
        "source": "T04n0202_008:0406c21_18"
    },
    {
        "source_sentence": "誰欲退者，可於此住；",
        "translation": "Those who want to turn back can stay here.",
        "source": "T04n0202_008:0406c22_19"
    },
    {
        "source_sentence": "索斷之後，欲悔無及。",
        "translation": "After the request is cut off, there's no limit to the number of desires and regrets.",
        "source": "T04n0202_008:0406c22_20"
    },
    {
        "source_sentence": "若能堅心，不顧身命，分捨父母兄弟妻子，際遇安隱，得七寶還者，子孫七世，",
        "translation": "If they can be steadfast, without concern for body or life, and if they part with their parents, brothers, wives, and sometimes find peace, and attain the return of the seven treasures, those who are born in the family will have seven generations.",
        "source": "T04n0202_008:0406c23_21"
    },
    {
        "source_sentence": "食用不盡。』",
        "translation": "The food and drink won't run out.'",
        "source": "T04n0202_008:0406c25_22"
    },
    {
        "source_sentence": "作是令已，便斷一索，日日如是；",
        "translation": "After making this order, the king cut off one rope and did so day after day.",
        "source": "T04n0202_008:0406c25_23"
    },
    {
        "source_sentence": "七日復唱令已斷第七索，望風舉帆，船疾如箭，普與眾賈，到於寶所。",
        "translation": "On the seventh day he again called for an order to cut off the seventh rope, raised his sail in the wind and sailed as fast as an arrow. He gave it to all the merchants and went to the treasure place.",
        "source": "T04n0202_008:0406c26_24"
    },
    {
        "source_sentence": "大施多聞明識諸寶，輕重貴賤色貌好醜，示諸賈客，如是色寶，致之不重，",
        "translation": "The great gift is well-versed in knowledge of the treasures, which are light and heavy, noble and inferior in appearance, good and ugly. He shows them to the merchants so that they will not esteem such material treasures.",
        "source": "T04n0202_008:0406c28_25"
    },
    {
        "source_sentence": "價貴可取。",
        "translation": "It's valuable and desirable to take.",
        "source": "T04n0202_008:0406c29_26"
    },
    {
        "source_sentence": "如是輩寶，致重價賤，各共莫取。",
        "translation": "Such a group of treasures are so greatly valued that they won't be given to each other.",
        "source": "T04n0202_008:0407a01_27"
    },
    {
        "source_sentence": "又復約勅，取寶多少，當令得中，多則船重，重則沈沒，少雖船輕，不補勞苦。",
        "translation": "Again, the captain instructed him to take a large amount of treasure and let it be caught in the middle. If he did so, the boat would be heavy for the most part; but if he was heavier, he would sink into the water. Even if his boat was light for the smallest part, he would not endure any additional pain or suffering.",
        "source": "T04n0202_008:0407a01_28"
    },
    {
        "source_sentence": "誡語已訖，各勤採拾，積著船上，寶足裝嚴，便欲來還。",
        "translation": "Having completed their instructions, they each diligently collected and piled up the goods on board the ship. The treasured feet were well dressed and ready to return home.",
        "source": "T04n0202_008:0407a03_29"
    },
    {
        "source_sentence": "於時大施，不欲上船，諸人悉集，問其意故，大施答言：『我欲前進至龍王宮求如意珠，",
        "translation": "At that time the great donor did not wish to board the ship. All the people assembled together and asked him what he wished. The great donor answered, “I wish to proceed on my way to the palace of the dragon king in order to search for the wish-granting jewel.",
        "source": "T04n0202_008:0407a04_30"
    },
    {
        "source_sentence": "盡我身命，不得不還。』",
        "translation": "To exhaust my body and life, I'll have to return.'",
        "source": "T04n0202_008:0407a06_31"
    },
    {
        "source_sentence": "眾賈聞此，愁慘無憀，各共白言：『我曹之等，憑賴薩薄，捐捨所重，",
        "translation": "When the merchants heard these words, they were both grieved and distressed. They all said to each other, “Our servants relied on [the treasury councilor] to give up what was valuable for charity.",
        "source": "T04n0202_008:0407a07_32"
    },
    {
        "source_sentence": "冒嶮至此，冀望相因，全濟還家。",
        "translation": "I ventured up the steep path to this place, hoping to be able to help each other and return home.",
        "source": "T04n0202_008:0407a09_0"
    },
    {
        "source_sentence": "今者云何，欲見棄捨？』",
        "translation": "What's the point of abandoning it now?'",
        "source": "T04n0202_008:0407a09_1"
    },
    {
        "source_sentence": "大施答言：『我當為汝自誓求願，令汝曹等安隱還國。』",
        "translation": "Mahāprajñāpāramitā replied, 'I will make a vow for you so that you can return to your country safely.'",
        "source": "T04n0202_008:0407a10_2"
    },
    {
        "source_sentence": "諸賈人聞，心怖乃安。",
        "translation": "When the merchants heard this, their minds were frightened and peaceful.",
        "source": "T04n0202_008:0407a11_3"
    },
    {
        "source_sentence": "大施導師，手執香鑪，向於四方，而自立誓：『我不憚勞，涉海求珍，",
        "translation": "The great charitable guide, holding an incense burner in his hand, faced the four directions and made this vow:",
        "source": "T04n0202_008:0407a12_0"
    },
    {
        "source_sentence": "用濟群生飢乏之困，合集此德，用求佛道。",
        "translation": "It's used to help sentient beings who are hungry and poor, and it combines this virtue with the pursuit of the Buddha Way.",
        "source": "T04n0202_008:0407a13_1"
    },
    {
        "source_sentence": "若我至誠，所願當就，令此眾賈及船珍寶，不逢惡難，安全還國。』",
        "translation": "If I'm sincere, what I wish will be done, so that these merchants and boat treasures won't encounter bad trouble and return safely to their country.'",
        "source": "T04n0202_008:0407a14_2"
    },
    {
        "source_sentence": "作誓已訖，眾賈前抱導師手足，涕泣愴悢，辭別還國。",
        "translation": "Having undertaken the vow, the Master was greeted by the merchants in front of him with their arms and legs joined at his feet. Tears flowing down in tears, they departed and returned home.",
        "source": "T04n0202_008:0407a16_0"
    },
    {
        "source_sentence": "斷索舉帆，還閻浮提，皆蒙安隱，得出大海。",
        "translation": "They cut off the rope and raised their sails to return to Jambudvīpa, where they were all made comfortable and allowed to leave the great sea.",
        "source": "T04n0202_008:0407a17_1"
    },
    {
        "source_sentence": "「爾時大施，與眾別後，前入於水，水可齊膝，行經七日；",
        "translation": "“At that time the great donor entered the water and, after his departure from the assembly, went into it. The water allowed him to bow with his knees [in respect] for seven days.",
        "source": "T04n0202_008:0407a18_2"
    },
    {
        "source_sentence": "轉復前行，其水漸深，可齊於岐，復經七日；",
        "translation": "Again going on, the water gradually became deeper and closer to the edge of the river. It would go on for another seven days.",
        "source": "T04n0202_008:0407a19_3"
    },
    {
        "source_sentence": "如是前進七日齊腰，七日齊項，七日恒浮，到一山邊，兩手捉木，刺山而上，",
        "translation": "In this way he proceeded for seven days at the waist and for seven days at the neck. For seven days he always floated up to the edge of a mountain. He grasped wood in both hands and climbed upward by pricking it with both hands.",
        "source": "T04n0202_008:0407a20_4"
    },
    {
        "source_sentence": "經乎七日，乃徹山頂。",
        "translation": "After seven days the image penetrated to the top of the mountain.",
        "source": "T04n0202_008:0407a22_5"
    },
    {
        "source_sentence": "於彼山上，平行七日，復還下山，七日徹下，到於水邊。",
        "translation": "On the top of that mountain, he traveled seven days at a leisurely pace and returned down the mountain. For seven days he passed under it and reached the edge of the water.",
        "source": "T04n0202_008:0407a22_6"
    },
    {
        "source_sentence": "水中皆有金色蓮花，有諸毒蛇，其毒極盛，悉以其身，纏蓮花根。",
        "translation": "In the water, there are golden lotus flowers and poisonous snakes whose poison is so great that they entangle the roots of the lotus flower with their bodies.",
        "source": "T04n0202_008:0407a24_7"
    },
    {
        "source_sentence": "菩薩見此，即自端坐繫心攝念，入慈三昧，念諸毒蛇本生之時，皆由瞋恚嫉妬倍盛，",
        "translation": "Seeing this, the bodhisattva sat cross-legged and concentrated his thoughts. He entered meditative absorption on loving kindness and was mindful that when poisonous snakes were originally born, it was due to anger and jealousy that they became even more numerous.",
        "source": "T04n0202_008:0407a25_8"
    },
    {
        "source_sentence": "故生此中，受斯惡形，極以慈心，矜憐悲念，慈心已滿，彼諸蛇毒，皆自除歇。",
        "translation": "Being born in this place, he receives these bad forms with utmost kindness and pity. Having been filled with compassion, he rids himself of the poison of those snakes.",
        "source": "T04n0202_008:0407a27_9"
    },
    {
        "source_sentence": "大施即起，躡花而行，復經七日，乃得度蛇。",
        "translation": "After seven days, he was able to cross over the snake.",
        "source": "T04n0202_008:0407a29_10"
    },
    {
        "source_sentence": "轉復前行，見諸羅剎，聞人香臭，皆來求覓。",
        "translation": "Again going on, he saw the rākṣasa demons and smelled the odor of people coming to search for him.",
        "source": "T04n0202_008:0407b01_11"
    },
    {
        "source_sentence": "大施已見，攝心慈觀，諸羅剎輩，敬心自生，濡語來問：『欲何所至？』",
        "translation": "After seeing the great gift, he collected his mind and observed it with kindness, and the rākṣatriyas respectfully produced their own minds, saying, 'Where do you want to go?'",
        "source": "T04n0202_008:0407b02_12"
    },
    {
        "source_sentence": "大施具答：『欲求如意寶珠。』",
        "translation": "The great donor answered, 'I want to ask for the wish-granting jewel.'",
        "source": "T04n0202_008:0407b04_0"
    },
    {
        "source_sentence": "羅剎歡喜，而自念言：『此福德人，去於龍宮，其道猶遠，云何使此經涉辛苦？",
        "translation": "Rejoicing, the Rāṣṭrapāla thought to himself, 'This man of merit is far away from the dragon's palace, so how could he cause this sūtra to involve suffering?'",
        "source": "T04n0202_008:0407b04_1"
    },
    {
        "source_sentence": "我當接過於諸嶮難。』",
        "translation": "I'll go beyond the difficulties of the cliffs.'",
        "source": "T04n0202_008:0407b06_2"
    },
    {
        "source_sentence": "即時接去，度四百由旬，乃還放地。",
        "translation": "Immediately they reached and departed, crossed four hundred yojanas, and then returned to the ground.",
        "source": "T04n0202_008:0407b06_3"
    },
    {
        "source_sentence": "「於是大施，轉自前行，見一銀城，白淨皦然，知是龍城，歡喜往趣。",
        "translation": "“Then the great donor, going from one place to another, saw a silver castle with white and pure railings. Knowing that it was a dragon castle, he joyfully proceeded on its way.",
        "source": "T04n0202_008:0407b07_4"
    },
    {
        "source_sentence": "見其城外，有七重塹，滿諸塹中，皆有毒蛇，其毒猛盛，視之可惡。",
        "translation": "He saw that outside the city there were seven moats, which were filled with poisonous snakes. The poison was so strong that it looked bad to be seen.",
        "source": "T04n0202_008:0407b09_5"
    },
    {
        "source_sentence": "大施導師，念諸毒蛇，皆由前身怒害多盛，故受如斯可惡之形，念慈哀愍如視赤子，",
        "translation": "The great donor and guide, thinking of the poisonous snakes, are all due to the fact that their former bodies were full of anger and harmfulness, so they're subject to such a bad form like this, and they're mindful of kindness and pity like looking at a red child.",
        "source": "T04n0202_008:0407b10_6"
    },
    {
        "source_sentence": "慈心已滿，蛇毒悉除。",
        "translation": "Once his compassionate mind is fulfilled, the poison of snakes and poisons are completely removed.",
        "source": "T04n0202_008:0407b12_7"
    },
    {
        "source_sentence": "即起蹈上，行詣龍城。",
        "translation": "He then got up and walked up to the dragon city.",
        "source": "T04n0202_008:0407b13_8"
    },
    {
        "source_sentence": "見有二龍以身繞城，交頭門閫，見於大施，仰頭愕視。",
        "translation": "He saw two dragons circling the city with their bodies, heads joined at each other’s entrances. Seeing the great offering, they looked upward in wonder.",
        "source": "T04n0202_008:0407b13_9"
    },
    {
        "source_sentence": "大施尋時，復入慈心，龍毒便除，低頭不視。",
        "translation": "When the great offering was searched, he again entered into compassion, and the dragon's poison was removed, bowed his head and didn't look around.",
        "source": "T04n0202_008:0407b15_10"
    },
    {
        "source_sentence": "大施即前，躡上而過。",
        "translation": "The great gift is the same as the prior one, but it goes upward.",
        "source": "T04n0202_008:0407b16_11"
    },
    {
        "source_sentence": "城中有龍，坐七寶殿，遙見菩薩，驚起自念：『今我城外，七重塹中，",
        "translation": "In the city there was a dragon sitting in a hall made of the seven kinds of treasure. Seeing the bodhisattva from a distance, he was startled and thought to himself:",
        "source": "T04n0202_008:0407b16_12"
    },
    {
        "source_sentence": "皆有毒蛇、餘龍、夜叉，無敢妄越。",
        "translation": "They all have poisonous snakes, other dragons, and yakṣas, and no one dares to transgress them.",
        "source": "T04n0202_008:0407b18_13"
    },
    {
        "source_sentence": "斯是何人，能來至此？』",
        "translation": "Who is this person who could come here?'",
        "source": "T04n0202_008:0407b18_14"
    },
    {
        "source_sentence": "即前迎問，作禮恭敬，請令就座，坐七寶床，種種美饍，以用供養。",
        "translation": "He greeted them, paid his respects, and invited them to take their seats on a seven-jeweled bed. All kinds of delicious food and drink were offered as an offering for their support.",
        "source": "T04n0202_008:0407b19_15"
    },
    {
        "source_sentence": "食已談語，問其來意，菩薩答言：『閻浮提人，貧窮辛苦，求於財寶供衣食故，",
        "translation": "Having eaten the food, they talked to each other and asked their wishes. The bodhisattvas answered, “The people of Jambudvfpa are poor and hard-pressed because they seek riches and treasures in order to provide them with food and clothing.",
        "source": "T04n0202_008:0407b20_16"
    },
    {
        "source_sentence": "殺害欺誑，具造眾惡，命終之後，墜三惡道。",
        "translation": "They kill, harm, deceive, and commit numerous evil deeds, and when their life ends, they fall into the three bad destinies.",
        "source": "T04n0202_008:0407b22_17"
    },
    {
        "source_sentence": "意甚憐愍，欲救濟故，涉嶮遠來，見於大王，求栴陀摩尼，往用救濟，",
        "translation": "With great compassion and pity, wishing to rescue them, they came from a long distance over the steep path. They saw that the great king was seeking the caṇḍa-maṇi jewel in order to rescue them.",
        "source": "T04n0202_008:0407b23_18"
    },
    {
        "source_sentence": "積此功德，誓求佛道。",
        "translation": "Accumulating these merits, they vow to seek the Buddha Way.",
        "source": "T04n0202_008:0407b25_19"
    },
    {
        "source_sentence": "若不距逆，唯見給與。』",
        "translation": "If they aren't separated from each other, they'll only see and give it to them.'",
        "source": "T04n0202_008:0407b25_20"
    },
    {
        "source_sentence": "龍王答言：『栴陀摩尼，難得之寶，汝故遐嶮，正來為此。",
        "translation": "The dragon king replied, 'The caṇḍa maṇi is a rare treasure that's difficult to obtain; so you've come here because you're so far from it.",
        "source": "T04n0202_008:0407b26_21"
    },
    {
        "source_sentence": "若能開意，留住一月，受少微供，因為說法；",
        "translation": "If they can enlighten their minds and remain for one month, they will receive small offerings to preach the Dharma.",
        "source": "T04n0202_008:0407b27_22"
    },
    {
        "source_sentence": "栴陀摩尼，爾乃可得。』",
        "translation": "It's possible to obtain the gandharva-maṇi, then.'",
        "source": "T04n0202_008:0407b28_23"
    },
    {
        "source_sentence": "菩薩可之。",
        "translation": "The bodhisattva approves of it.",
        "source": "T04n0202_008:0407b28_24"
    },
    {
        "source_sentence": "龍王日日，供設百味，作諸伎樂，供養菩薩，菩薩便為具足分別四念處慧。",
        "translation": "Day after day, the dragon king offered a hundred flavors of food and music to the bodhisattva. The bodhisattva then perfected the discerning wisdom of the four applications of mindfulness in order to make offerings to him.",
        "source": "T04n0202_008:0407b29_25"
    },
    {
        "source_sentence": "經一月竟，辭當還去。",
        "translation": "After one month had passed, he left and departed.",
        "source": "T04n0202_008:0407c01_26"
    },
    {
        "source_sentence": "龍王歡喜，解髻寶珠，以用奉上，因而言曰：『大士慈心，普濟難及，",
        "translation": "Rejoicing, the dragon king dismounted from his topknot of jewels and presented it to him. Then he said, “O great hero, you have a compassionate mind that cannot be outshone by anyone in terms of your universal benevolence.",
        "source": "T04n0202_008:0407c02_27"
    },
    {
        "source_sentence": "此志強猛，必至佛道，我願為作智慧弟子。』",
        "translation": "This is a resolute aspiration that will surely lead to the Buddha Way, and I wish to become a disciple of wisdom for it.'",
        "source": "T04n0202_008:0407c03_28"
    },
    {
        "source_sentence": "菩薩可之，而問之言：『今汝此珠，有何力能？』",
        "translation": "The bodhisattva approved of it and asked, 'Now, what's the power of this pearl that you have?'",
        "source": "T04n0202_008:0407c04_29"
    },
    {
        "source_sentence": "即答之言：『此珠能雨二千由旬一切所須。』",
        "translation": "He answered, 'This pearl can rain down everything it needs for 2,000 yojanas.'",
        "source": "T04n0202_008:0407c05_30"
    },
    {
        "source_sentence": "菩薩自念：『此珠雖快，故未辦我曠濟大事。』",
        "translation": "The bodhisattva thought to himself, 'Even though this pearl is pleasant, it doesn't accomplish my great task of liberation.'",
        "source": "T04n0202_008:0407c06_31"
    },
    {
        "source_sentence": "諸龍大小，送到門外，重相辭謝。",
        "translation": "The dragons, large and small, went outside the gates to express their thanks.",
        "source": "T04n0202_008:0407c07_32"
    },
    {
        "source_sentence": "「於是別去，轉復前行，遙見一城，純青琉璃，其色清潔，復前往趣。",
        "translation": "“Then they departed separately, proceeded again and again, and saw from a distance a city the color of pure blue lapis lazuli, which was clean and clean. Again they set out for that same destination.",
        "source": "T04n0202_008:0407c08_33"
    },
    {
        "source_sentence": "其城外邊，亦七重塹，諸塹之中亦滿毒蛇。",
        "translation": "On the outskirts of the city there are seven moats, which are also filled with poisonous snakes.",
        "source": "T04n0202_008:0407c10_34"
    },
    {
        "source_sentence": "菩薩見已，念此諸蛇，瞋妬所致，故來此中，受此毒形，端坐入慈，極加哀念，",
        "translation": "When the enlightening beings saw this, they thought to themselves, “These serpents are driven by anger and jealousy. So they came here to receive these poisonous forms of wickedness. Sitting cross-legged, they entered a state of great compassion and deep grief.",
        "source": "T04n0202_008:0407c11_35"
    },
    {
        "source_sentence": "慈心已盛，毒皆得除。",
        "translation": "Once his compassionate mind is strong, the poison will be removed.",
        "source": "T04n0202_008:0407c12_36"
    },
    {
        "source_sentence": "經蹈其上，往趣城門。",
        "translation": "They climbed up the steps and proceeded to the city gates.",
        "source": "T04n0202_008:0407c13_37"
    },
    {
        "source_sentence": "亦見二龍，以身纏城，交頭門閫，已見菩薩，擎頭怒視。",
        "translation": "He also saw two dragons wrapping their bodies around the city wall, with their heads facing each other at the entrance of the gate. Seeing the Bodhisattva, he looked angrily and raised his head to look at him.",
        "source": "T04n0202_008:0407c13_38"
    },
    {
        "source_sentence": "菩薩尋時，思惟慈心，慈心已滿，其毒復除，便復低頭，菩薩蹈過。",
        "translation": "When the Bodhisattva looked into it, he thought of his compassionate mind. Having perfected his compassionate mind, the poison was once again eliminated, so he bowed his head and passed by him.",
        "source": "T04n0202_008:0407c15_39"
    },
    {
        "source_sentence": "爾時城中，有一龍王，坐七寶殿，遙見菩薩，驚起自念：『計我城外，",
        "translation": "At that time there was a dragon king in the city, seated in a seven-jeweled palace. Seeing the bodhisattva from a distance, he was startled and thought to himself:",
        "source": "T04n0202_008:0407c16_40"
    },
    {
        "source_sentence": "七重蛇塹，諸龍夜叉，無能越者。",
        "translation": "There are seven moats of snakes and dragons and yakṣas that can't cross them.",
        "source": "T04n0202_008:0407c18_41"
    },
    {
        "source_sentence": "此是何人，能來至此？』",
        "translation": "Who is this person who's able to come here?'",
        "source": "T04n0202_008:0407c19_0"
    },
    {
        "source_sentence": "尋下迎問，恭敬作禮，請詣殿上，坐七寶床，辦諸百味，盛美飯食，食竟徐徐談問所由。",
        "translation": "He went down to the palace and, seated on a seven-jeweled bed, he prepared all kinds of delicious dishes and delicious food. After they had eaten, he talked slowly and quietly about his whereabouts.",
        "source": "T04n0202_008:0407c19_1"
    },
    {
        "source_sentence": "菩薩因答故來之意：『唯欲求乞旃陀摩尼。』",
        "translation": "The bodhisattva replied, 'I'm just wanting to ask for the dhāraṇī of enlightenment.'",
        "source": "T04n0202_008:0407c21_2"
    },
    {
        "source_sentence": "龍王白言：『旃陀摩尼，甚為難得！",
        "translation": "The dragon king said, 'It's very difficult to obtain a gandharva maṇi!",
        "source": "T04n0202_008:0407c22_3"
    },
    {
        "source_sentence": "苟欲得者，願受我請，二月住此，并見開示菩薩之行。』",
        "translation": "If you want to attain it, please accept my invitation to stay here for two months and show me the bodhisattva's practice.'",
        "source": "T04n0202_008:0407c23_4"
    },
    {
        "source_sentence": "龍王供設種種飲食，作諸伎樂，而以供養，菩薩具足，為其分別四神足事。",
        "translation": "The dragon king offered various kinds of food and drink, made various tricks and music to make offerings, and the bodhisattva was fully endowed with the four miraculous abilities that he discerned for them.",
        "source": "T04n0202_008:0407c24_5"
    },
    {
        "source_sentence": "經二月已，辭當還去。",
        "translation": "After two months had passed, he took his leave and returned.",
        "source": "T04n0202_008:0407c26_6"
    },
    {
        "source_sentence": "龍王即出髻中寶珠，以用奉上，因立要誓：『大士勤心，悲濟群生，其心廣大，",
        "translation": "The king of the nāga then produced the precious pearl in his topknot and presented it to him. Thereupon, he made an important vow, saying:",
        "source": "T04n0202_008:0407c26_7"
    },
    {
        "source_sentence": "必至佛道，我願為作神足弟子。』",
        "translation": "I'll surely reach the Buddha Way, and I wish to become a disciple with miraculous abilities.'",
        "source": "T04n0202_008:0407c28_8"
    },
    {
        "source_sentence": "菩薩可言：『如汝所願。』",
        "translation": "The bodhisattva can say, 'As you wish.'",
        "source": "T04n0202_008:0407c29_9"
    },
    {
        "source_sentence": "又復問：『此所與寶珠，力能云何？』",
        "translation": "Again, he asked, 'What's the power of this jeweled pearl given to me?'",
        "source": "T04n0202_008:0407c29_10"
    },
    {
        "source_sentence": "龍即答言：『此珠能雨四千由旬一切所須。』",
        "translation": "The dragon then answered, 'This pearl can rain down everything it needs for 4,000 yojanas.'",
        "source": "T04n0202_008:0408a01_11"
    },
    {
        "source_sentence": "菩薩自念：『此珠轉勝，雖復殊妙，未稱我意。』",
        "translation": "The bodhisattva thought to himself, 'This pearl becomes superior, even though it's marvelous and doesn't match my wishes.'",
        "source": "T04n0202_008:0408a02_12"
    },
    {
        "source_sentence": "諸龍大小，送出門外，各懷戀恨。",
        "translation": "The dragons, large and small, were driven out of the palace to leave the monastery but each harbored feelings of hatred.",
        "source": "T04n0202_008:0408a03_13"
    },
    {
        "source_sentence": "「於是別後，轉更前進，見一金城，其色晃晃，甚為妙好，菩薩往趣。",
        "translation": "“After the departure, they proceeded further and further to see a golden castle of shining colors that looked very beautiful. The bodhisattvas were headed for it.",
        "source": "T04n0202_008:0408a04_14"
    },
    {
        "source_sentence": "見其城外，亦七重塹，諸塹之中，亦滿毒蛇。",
        "translation": "He saw that outside the city there were also seven moats, all filled with poisonous snakes.",
        "source": "T04n0202_008:0408a05_15"
    },
    {
        "source_sentence": "菩薩自念，此諸毒蛇，亦由前身習恚憎妬怒害盛故，受此毒形，端坐入慈，",
        "translation": "The bodhisattva thought to himself, “These poisonous snakes are also due to the fact that in their previous lives they were accustomed to anger and hatred.",
        "source": "T04n0202_008:0408a06_16"
    },
    {
        "source_sentence": "極加愛念，慈心已至，蛇毒皆除，便前登躡，蹈上而過。",
        "translation": "With extreme affection and compassion, he was cured of the poison of the snake and then climbed up to the top of the mountain and passed by it.",
        "source": "T04n0202_008:0408a08_17"
    },
    {
        "source_sentence": "到於城門，亦見二龍，以身纏城，交頭門閫，已見菩薩，仰頭愕視，菩薩如法，",
        "translation": "When he arrived at the city gates, he saw two dragons tethering the city with their bodies and joining their heads at each other’s entrance. He saw the Bodhisattva there. Looking upward in wonder, he did so according to the Dharma.",
        "source": "T04n0202_008:0408a09_18"
    },
    {
        "source_sentence": "入于慈定，龍毒得除，低頭而視，即前躡上，度入城中。",
        "translation": "When he entered the meditation of benevolence, the dragon's poison was removed, and while he looked down with his head lowered, he went up to the front gate and crossed into the city.",
        "source": "T04n0202_008:0408a11_19"
    },
    {
        "source_sentence": "彼時城中，亦有龍王，處於寶殿，遙見菩薩，愕然自念：『我此城外，",
        "translation": "At that time there was also a dragon king in the city. In the jeweled pavilion he saw the bodhisattva from a distance, startled and thought to himself:",
        "source": "T04n0202_008:0408a12_20"
    },
    {
        "source_sentence": "有七重塹，滿中毒蛇，餘龍夜叉，無能越者。",
        "translation": "There are seven moats, full of poisonous snakes and no other dragons or yakṣas can cross them.",
        "source": "T04n0202_008:0408a14_21"
    },
    {
        "source_sentence": "今此何人，能來至此？』",
        "translation": "Who will be able to come here now?'",
        "source": "T04n0202_008:0408a15_22"
    },
    {
        "source_sentence": "心極奇怪，尋下迎問，致敬為禮，請令上殿，施七寶床，讓之令坐，坐已具食種種美味，",
        "translation": "His mind was greatly perplexed. He came down to greet the Master, paid his respects, and asked him to go up to the palace. He gave him a seven-jeweled couch [to sit on] and, having sat down, offered him food of various flavors.",
        "source": "T04n0202_008:0408a15_23"
    },
    {
        "source_sentence": "食已徐問所以來意。",
        "translation": "After he had eaten, he slowly asked what the reason for his arrival was.",
        "source": "T04n0202_008:0408a17_24"
    },
    {
        "source_sentence": "菩薩答言：『閻浮提人，薄德窮苦，勞身役思，殺害欺誑為衣食故，具十不善，",
        "translation": "The bodhisattva answered, 'The people of Jambudvīpa are weak in virtue and suffering from the exhaustion of suffering, with physical labor and thought, killing and deceiving for food and clothing, and possessing ten bad qualities.",
        "source": "T04n0202_008:0408a18_25"
    },
    {
        "source_sentence": "命終後，復墮三劇苦中，意甚愍傷，思欲救濟。",
        "translation": "When his life came to an end, he fell back into the three kinds of severe pain. His mind was grieved and he wished to be rescued.",
        "source": "T04n0202_008:0408a20_26"
    },
    {
        "source_sentence": "承海龍王，有如意珠，故涉遐嶮，唯望得此。』",
        "translation": "The dragon king who inherits the sea has a wish-granting pearl, so he travels far and wide to hope to get it here.'",
        "source": "T04n0202_008:0408a21_27"
    },
    {
        "source_sentence": "龍王答言：『如意寶珠，此難得物，大士故來，望當相與。",
        "translation": "The dragon king replied, 'The wish-granting jewel is difficult to obtain; the great man has come for a long time and hopes to give it to you.",
        "source": "T04n0202_008:0408a22_28"
    },
    {
        "source_sentence": "若欲得者，四月留住，受我微供，并見教誨。』",
        "translation": "If you want to get it, stay here for four months and accept my humble offerings and views and instructions.'",
        "source": "T04n0202_008:0408a23_29"
    },
    {
        "source_sentence": "菩薩尋可。",
        "translation": "The bodhisattva searched for approval.",
        "source": "T04n0202_008:0408a24_30"
    },
    {
        "source_sentence": "龍王歡喜，日日施設百味上美，躬自斟酌，奉進甘食，亦復勅作種種伎樂，",
        "translation": "Delighted, the king of nāgas prepared a hundred delicious foods every day and offered them sweet food. They also ordered various kinds of music and dances to be performed.",
        "source": "T04n0202_008:0408a24_31"
    },
    {
        "source_sentence": "菩薩恒為分別諸法名字本末，廣宣其義。",
        "translation": "Bodhisattvas always discriminate the names of dharmas and explain their meanings in detail.",
        "source": "T04n0202_008:0408a26_32"
    },
    {
        "source_sentence": "龍王敬慕，專意聽受，朝夕問訊不失時節，隨時所須龍自裁量，諸龍夜叉來欲求現，",
        "translation": "The king of the dragons was respected by them and they listened attentively. They exchanged greetings morning and evening without missing the proper time to do so. According to the needs of the dragon, he judged his own abilities; all the dragons and night-vision yakṣas came to see him.",
        "source": "T04n0202_008:0408a27_33"
    },
    {
        "source_sentence": "可進可退，自立限度，奉事四月，善知時宜。",
        "translation": "They may advance or retreat; they set their own limitations and serve for four months, knowing well the proper time.",
        "source": "T04n0202_008:0408a29_34"
    },
    {
        "source_sentence": "四月已竟，菩薩辭去。",
        "translation": "After the fourth month had ended, the bodhisattva departed.",
        "source": "T04n0202_008:0408b01_35"
    },
    {
        "source_sentence": "爾時其龍即解髻中如意之珠，用奉上之，因立誓願：『大士弘誓，慈心曠濟，",
        "translation": "Then the dragon released the wish-granting pearl from its topknot and offered it to him. Thereupon, he made the following vow:",
        "source": "T04n0202_008:0408b02_0"
    },
    {
        "source_sentence": "悲彼群生，不憚勤勞，必能成佛，拔濟荼蓼，願作侍者總持弟子。』",
        "translation": "With compassion for those sentient beings who will surely become buddhas without any difficulty or trouble, he pulls out the vajra and wishes to serve as a disciple of the abbot.'",
        "source": "T04n0202_008:0408b03_1"
    },
    {
        "source_sentence": "菩薩許之。",
        "translation": "The bodhisattva agreed with him.",
        "source": "T04n0202_008:0408b05_2"
    },
    {
        "source_sentence": "又復問言：『所可施珠，力能何如？』",
        "translation": "Again, he asked, 'What's the power of the pearl that can be given?'",
        "source": "T04n0202_008:0408b05_3"
    },
    {
        "source_sentence": "龍王答言：『此珠能雨八千由旬七寶所須。』",
        "translation": "The dragon king answered, 'This pearl can rain down 8,000 yojanas of seven treasures that are needed.'",
        "source": "T04n0202_008:0408b06_4"
    },
    {
        "source_sentence": "菩薩歡喜，而自念言：『閻浮提地，七千由旬，此珠之德，副我所望。』",
        "translation": "Rejoicing, the bodhisattva thought to himself, 'The ground of Jambudvīpa is 7,000 leagues long, and this pearl's virtue will match my expectations.'",
        "source": "T04n0202_008:0408b07_5"
    },
    {
        "source_sentence": "前後所得，凡有三珠，繫在衣角，即起出城。",
        "translation": "Whenever he had three beads, he tied them around the corners of his robe and rose out of the city.",
        "source": "T04n0202_008:0408b08_6"
    },
    {
        "source_sentence": "諸龍大小，送到城外，各懷悲戀，遂共別去。",
        "translation": "The dragons, large and small, were driven out of the city. Sentient beings grieved for each other and departed together.",
        "source": "T04n0202_008:0408b09_7"
    },
    {
        "source_sentence": "「菩薩到前，捉珠求願：『若今實是旃陀摩尼，當令我身能飛虛空。』",
        "translation": "When the bodhisattva arrived before him, he grabbed the pearl and begged, 'If this is really a sandalwood maṇi, I will be able to fly into space.'",
        "source": "T04n0202_008:0408b10_8"
    },
    {
        "source_sentence": "求願已訖，即舉其身，便能飛翔，出于海外。",
        "translation": "Having fulfilled his vow, he lifted himself up and flew out of the land.",
        "source": "T04n0202_008:0408b12_9"
    },
    {
        "source_sentence": "已度海難，小眠休息，是時海中，有諸龍輩，自共議言：『我曹海中，",
        "translation": "Having crossed the great difficulty of the sea, he slept a little and rested. At that time there were some dragons in the ocean who said among themselves:",
        "source": "T04n0202_008:0408b13_10"
    },
    {
        "source_sentence": "唯此三珠，其德甚大，難有般比，此人皆能，索得持去。",
        "translation": "Only these three jewels are so great in virtue that it is difficult to compare them with parinirvāṇa. The people of Jambudvīpa will all be able to take the gems and ask permission to carry them away.",
        "source": "T04n0202_008:0408b14_11"
    },
    {
        "source_sentence": "可惜此寶，當還攝取。』",
        "translation": "It's a pity that this treasure will be returned and collected.'",
        "source": "T04n0202_008:0408b16_0"
    },
    {
        "source_sentence": "言議已竟，密解持去。",
        "translation": "After he finished speaking, he secretly understood and carried it away.",
        "source": "T04n0202_008:0408b16_1"
    },
    {
        "source_sentence": "菩薩眠覺，看珠不在，即自思惟：『此中無人，必是海龍，持我寶去。",
        "translation": "When the bodhisattva was asleep and awake, he saw that the treasure wasn't there, and thought to himself, 'There's no one here; it must be a sea dragon who took my treasure away.",
        "source": "T04n0202_008:0408b17_0"
    },
    {
        "source_sentence": "我為此珠，經涉遐嶮，今垂還國滿我所願。",
        "translation": "Because of this pearl I have traveled a long distance and now return to my native land, fulfilling my wish.",
        "source": "T04n0202_008:0408b18_1"
    },
    {
        "source_sentence": "雖取我珠，吾終不放，會當盡力抒此海水，誓心剋志，畢命於此，若不得珠，",
        "translation": "Even if you take my pearl, I won’t let you go. You must exert all your efforts to dry up the water in this lake and make a vow to keep it here for the rest of your life. If you don’t get the pearl,",
        "source": "T04n0202_008:0408b19_2"
    },
    {
        "source_sentence": "終不空歸。』",
        "translation": "They'll never return in vain.'",
        "source": "T04n0202_008:0408b21_3"
    },
    {
        "source_sentence": "思惟已定，即行海邊，得一龜甲，兩手捉持，方欲抒海，海神知意，來問之曰：『海水深廣，",
        "translation": "When the thought was settled, he proceeded to the edge of the sea and found a turtle’s shell. He held it in both hands and wished to dry up the sea. The sea goddess, knowing his intention, came and asked him:",
        "source": "T04n0202_008:0408b21_4"
    },
    {
        "source_sentence": "三百三十六萬里，正使一切人民之類，盡來共抒，不能使減，況汝一身，",
        "translation": "Three hundred million three hundred and sixty thousand li is precisely so that all kinds of people will come together to express their feelings, and they won’t be able to cause them to diminish. How much less can you, yourself!",
        "source": "T04n0202_008:0408b23_5"
    },
    {
        "source_sentence": "而欲辦此？』",
        "translation": "Do you want to do this?'",
        "source": "T04n0202_008:0408b25_6"
    },
    {
        "source_sentence": "菩薩答言：『若人至心，欲有所作，事無不辦。",
        "translation": "The bodhisattva answered, 'If someone sincerely wishes to do anything, there's nothing that they can't do.",
        "source": "T04n0202_008:0408b25_7"
    },
    {
        "source_sentence": "我得此寶，當用饒益一切群生，以此功德，用求佛道。",
        "translation": "When I obtain this treasure, I will use it to benefit all sentient beings and use their merit to pursue the buddha path.",
        "source": "T04n0202_008:0408b26_8"
    },
    {
        "source_sentence": "我心不懈，何以不能？』",
        "translation": "My mind isn't lazy, so why can't I?'",
        "source": "T04n0202_008:0408b27_9"
    },
    {
        "source_sentence": "是時首陀會天，遙見菩薩，一身一意，獨執勤勞，欲用充濟安樂一切。",
        "translation": "The Sudarśana gods then saw from a distance that the bodhisattva, with one body and one mind, was alone in his exertion, wanting to use it to provide relief and comfort for all.",
        "source": "T04n0202_008:0408b28_10"
    },
    {
        "source_sentence": "『我曹云何不往佐助？』",
        "translation": "'Why don't we go and assist you?'",
        "source": "T04n0202_008:0408c01_0"
    },
    {
        "source_sentence": "展轉相語，來至其所。",
        "translation": "They spoke to each other in turn and came to where they were.",
        "source": "T04n0202_008:0408c01_1"
    },
    {
        "source_sentence": "菩薩下器，一切諸天，盡以天衣，同弇水中，菩薩出器，諸天舉衣，棄著餘處，",
        "translation": "The Bodhisattva descended from the vessel, and all the gods were dressed in heavenly robes as if they were bathing in water. When the Bodhisattva emerged from the vessel, the gods raised their robes and abandoned them elsewhere.",
        "source": "T04n0202_008:0408c02_0"
    },
    {
        "source_sentence": "一反抒海，減四十里；",
        "translation": "The distance to the sea is forty li in all directions.",
        "source": "T04n0202_008:0408c03_1"
    },
    {
        "source_sentence": "二反抒之，減八十里；",
        "translation": "The distance is reduced by two times by eighty li.",
        "source": "T04n0202_008:0408c04_2"
    },
    {
        "source_sentence": "三反抒之，減百二十里。",
        "translation": "Three times the distance is reduced by one hundred and twenty li.",
        "source": "T04n0202_008:0408c04_3"
    },
    {
        "source_sentence": "其龍惶怖，來到其所，語言：『止止！",
        "translation": "Fearful, the dragon came to him and said, 'Stop!",
        "source": "T04n0202_008:0408c05_4"
    },
    {
        "source_sentence": "更莫抒海！』",
        "translation": "Don't lie down in the ocean!'",
        "source": "T04n0202_008:0408c06_5"
    },
    {
        "source_sentence": "菩薩尋休。",
        "translation": "The bodhisattva sought to rest.",
        "source": "T04n0202_008:0408c06_6"
    },
    {
        "source_sentence": "龍來問言：『汝求此寶，用作何等？』",
        "translation": "The dragon came and asked, 'What's the use of seeking this treasure?'",
        "source": "T04n0202_008:0408c06_7"
    },
    {
        "source_sentence": "菩薩答言：『欲用給濟一切眾生。』",
        "translation": "The bodhisattva answered, 'I want to use it to help all sentient beings.'",
        "source": "T04n0202_008:0408c07_8"
    },
    {
        "source_sentence": "龍復問言：『如汝言者，我曹海中眾生甚多，何以不與，必欲得去？』",
        "translation": "Again, the dragon asked, 'As you say, there are so many sentient beings in my ocean of sentient beings; why don't you give them to them and they'll surely want to leave?'",
        "source": "T04n0202_008:0408c08_9"
    },
    {
        "source_sentence": "菩薩答言：『海中之類亦是眾生，然無劇苦。",
        "translation": "The bodhisattva answered, 'The types in the ocean are also sentient beings, but they don't experience great suffering.",
        "source": "T04n0202_008:0408c09_10"
    },
    {
        "source_sentence": "如閻浮提人民之類，為錢財故，殺害欺誑，作十不善，死墮三途。",
        "translation": "It's like the people of Jambudvīpa who kill and deceive others for money and possessions, commit the ten unwholesome acts, and die and fall into the three paths.",
        "source": "T04n0202_008:0408c10_11"
    },
    {
        "source_sentence": "我以人類，解於法化，故來索寶，先充所乏，後以十善，而勸誨之。』",
        "translation": "Because people understand the teaching of the Dharma and therefore come to ask for treasure, I first fill what's lacking and then encourage them with the ten good qualities.'",
        "source": "T04n0202_008:0408c12_12"
    },
    {
        "source_sentence": "龍聞其語，出珠還之。",
        "translation": "The dragon heard what he said and returned the pearl.",
        "source": "T04n0202_008:0408c13_13"
    },
    {
        "source_sentence": "爾時海神，見其精進強力所作，即作誓言：『汝今如是，精進不休，必成佛道，",
        "translation": "At that moment the sea goddess, seeing what she had undertaken with such vigor and energy, made this vow:",
        "source": "T04n0202_008:0408c14_14"
    },
    {
        "source_sentence": "我願為作精進弟子。』",
        "translation": "I wish to become an energetic disciple.'",
        "source": "T04n0202_008:0408c16_0"
    },
    {
        "source_sentence": "「菩薩得珠，復更飛去。",
        "translation": "“The bodhisattva obtained the pearl and flew away again.",
        "source": "T04n0202_008:0408c16_1"
    },
    {
        "source_sentence": "到便先問入海同伴賈客，即下在地。",
        "translation": "When he arrived, he first asked the merchants and travelers who had entered the sea, and they went down to the ground.",
        "source": "T04n0202_008:0408c17_0"
    },
    {
        "source_sentence": "同伴見之，驚喜無量，皆共歎言：『甚奇甚特！』",
        "translation": "When the companions saw him, they were so surprised and immeasurable that they all praised him, saying, 'It's extraordinary!'",
        "source": "T04n0202_008:0408c17_1"
    },
    {
        "source_sentence": "轉復前行，到放鉢城，迦毘梨婆羅門，聞於菩薩海中吉還，歡喜踊躍，",
        "translation": "Going on, the Master reached the city of Parvata. When the brahman Kapilavastu heard that it was a good omen to return among the enlightening beings in the sea of enlightening beings, he was delighted and jumped for joy.",
        "source": "T04n0202_008:0408c18_2"
    },
    {
        "source_sentence": "出迎問訊，并請同伴，為設客會，辦具種種餚饍飲食，食訖談敘行路恤耗。",
        "translation": "He came out to greet the Master and invited his companions. They prepared various foods and drinks for the assembly, and after having eaten them, they talked of the exhaustion of traveling paths.",
        "source": "T04n0202_008:0408c20_3"
    },
    {
        "source_sentence": "是時菩薩持其寶珠，指歷其家，婆羅門家內，諸藏悉滿，會者覩此，歎未曾有。",
        "translation": "The bodhisattva then took the precious pearl, pointed it to his house, and went inside the Brāhmaṇa's house, where all the stores were filled, and the assembled people admired this as unprecedented.",
        "source": "T04n0202_008:0408c22_4"
    },
    {
        "source_sentence": "時迦毘梨，莊嚴其女，若干種寶，挍飾其身，躬手自捉金寶澡罐，先自洗手，",
        "translation": "Kapilavastu then adorned the woman’s body with various kinds of jewel ornaments. With her palms joined together, she held a golden-jeweled bathing pot in her hands and washed her hands first.",
        "source": "T04n0202_008:0408c24_5"
    },
    {
        "source_sentence": "後牽女臂，授與菩薩。",
        "translation": "He then took the woman's arm and gave it to the bodhisattva.",
        "source": "T04n0202_008:0408c25_6"
    },
    {
        "source_sentence": "菩薩為受。",
        "translation": "The bodhisattva receives it.",
        "source": "T04n0202_008:0408c26_7"
    },
    {
        "source_sentence": "迦毘梨歡喜，嚴五百伎女，擇取才能工為伎者，具五百白象，眾寶莊挍，",
        "translation": "Kapilavastu was delighted, adorned with five hundred nymphlike women. Choosing the most talented among them to perform tricks, they possessed five hundred white elephants decorated with various jewel ornaments.",
        "source": "T04n0202_008:0408c26_8"
    },
    {
        "source_sentence": "極令奇異，用送其女。",
        "translation": "It was so marvelous that it was used to send her off.",
        "source": "T04n0202_008:0408c28_9"
    },
    {
        "source_sentence": "菩薩勅伴，駕乘即路，城中大小，送到道次，作眾伎樂，導從還國。",
        "translation": "The Bodhisattva ordered his companions to drive the carriage on the highway. All the people in the cities, big and small, large and small alike, were assembled at the end of the road. They performed various kinds of music and led the procession back home.",
        "source": "T04n0202_008:0408c28_10"
    },
    {
        "source_sentence": "「大施父母，自與兒別，憂結迷憒，啼哭過哀，其目俱冥，盲無所見。",
        "translation": "“Great donors and parents are separated from their own children, saddled with grief and confusion, weeping and overcome with sorrow. Their eyes are both dumb and blind, unable to see anything.",
        "source": "T04n0202_008:0409a01_11"
    },
    {
        "source_sentence": "兒還到國，禮拜問訊，父母聞聲，以手摩捫，爾時審知大施還國，悲喜交代，",
        "translation": "When the boy returned to his own country, he venerated and greeted him. The sound of his parents’ cries was so loud that they patted him with their palms pressed together. Then Sudhana knew that Mahāprajāpaṇḍika had returned to his own country.",
        "source": "T04n0202_008:0409a02_12"
    },
    {
        "source_sentence": "窮責其子：『汝實無狀，捨我入海，困苦我曹，微命趣存。",
        "translation": "You really have no characteristics. Forsake me and go into the sea, tormented by suffering; we are in a miserable state of existence with little hope of enlightenment.",
        "source": "T04n0202_008:0409a04_13"
    },
    {
        "source_sentence": "汝大海中，得何等物？』",
        "translation": "What kind of things will you get in the ocean?'",
        "source": "T04n0202_008:0409a05_14"
    },
    {
        "source_sentence": "菩薩出珠，以授父母，父母手捉，而自言曰：『今我藏中，如斯石比，",
        "translation": "The Bodhisattva produced the pearl and handed it to his parents, who grasped it in their hands. They said among themselves, “Now this treasure is as small as a stone like this.",
        "source": "T04n0202_008:0409a06_15"
    },
    {
        "source_sentence": "亦不少也。",
        "translation": "It's not many, either.",
        "source": "T04n0202_008:0409a07_16"
    },
    {
        "source_sentence": "何用辛苦，方乃得此？』",
        "translation": "What's the use of suffering to attain this?'",
        "source": "T04n0202_008:0409a08_17"
    },
    {
        "source_sentence": "菩薩取珠，指父母眼，目欻明淨，如風除雲，既還得視，心遂欣豫，感此珠德，",
        "translation": "The Bodhisattva took the gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem gem",
        "source": "T04n0202_008:0409a08_18"
    },
    {
        "source_sentence": "嘆言：『甚奇！",
        "translation": "They exclaimed, 'How marvelous!'",
        "source": "T04n0202_008:0409a10_19"
    },
    {
        "source_sentence": "汝雖辛苦，功不唐捐。』",
        "translation": "Although you're hard-pressed, your effort isn't in vain.'",
        "source": "T04n0202_008:0409a10_20"
    },
    {
        "source_sentence": "菩薩復捉其珠，而從求願：『若是旃陀摩尼者，使我父母，身下自然，",
        "translation": "The bodhisattva again grasped the pearl and begged, 'If this were a sandalwood maṇi, it would cause my parents to naturally",
        "source": "T04n0202_008:0409a11_21"
    },
    {
        "source_sentence": "當有七寶奇妙珍異床座，上有嚴淨七寶大蓋。』",
        "translation": "There will be a rare, seven-jeweled bed and seat of marvelous treasures on which there's a great canopy of pure, seven-jeweled adornment.'",
        "source": "T04n0202_008:0409a12_22"
    },
    {
        "source_sentence": "言訖尋成，一切皆喜。",
        "translation": "When he finished speaking, they all rejoiced.",
        "source": "T04n0202_008:0409a13_23"
    },
    {
        "source_sentence": "菩薩復更捉珠求願：『令我父母及王臣民，一切諸藏皆悉盈滿。』",
        "translation": "Again, the bodhisattva grasped the pearl and vowed, 'May my parents and king's ministers fill all the stores with it.'",
        "source": "T04n0202_008:0409a14_24"
    },
    {
        "source_sentence": "即以其珠，四向歷訖，如語悉滿，莫不驚喜。",
        "translation": "He then took the pearl and passed it in all four directions, filling it up as he had promised. None of them marveled at this.",
        "source": "T04n0202_008:0409a15_25"
    },
    {
        "source_sentence": "即時遣人，乘八千里象，告閻浮提一切人民：『摩訶闍迦樊，海中吉還，",
        "translation": "Immediately he sent a messenger, riding on an elephant of eight thousand li, to report to all the people in Jambudvfpa:",
        "source": "T04n0202_008:0409a16_26"
    },
    {
        "source_sentence": "得如意珠，其德殊異，却後七日，當令其珠雨於一切珍寶衣食，隨人所須，",
        "translation": "Seven days after he had obtained the wish-granting jewel with extraordinary qualities, he would cause it to rain down on all kinds of rare treasures, clothing, food, and other necessities.",
        "source": "T04n0202_008:0409a18_27"
    },
    {
        "source_sentence": "自恣而取，皆各齋戒，儲[仁-二+(亡\\/大)]以待。』",
        "translation": "They each observe the precepts for self-restraint and store [ren - two + (deceased \\/ great)] to await.'",
        "source": "T04n0202_008:0409a20_28"
    },
    {
        "source_sentence": "「告下遍已，七日頭到，大施菩薩，沐浴其身，著新淨衣，至平坦地，",
        "translation": "“After seven days had passed, the great charitable bodhisattva Mahāprajñāpāramitā bathed his body, put on fresh and clean clothes, and went to the level ground.",
        "source": "T04n0202_008:0409a20_29"
    },
    {
        "source_sentence": "即持其珠，著高幢頭，手執香鑪，四方求願：『閻浮提人，貧窮辛苦，",
        "translation": "He then took the jewel, put it on the top of a high banner, held an incense burner in his hand, and prayed in all directions:",
        "source": "T04n0202_008:0409a22_30"
    },
    {
        "source_sentence": "欲得濟給令無有乏，若當實是旃陀摩尼者，便當次第雨眾所須。』",
        "translation": "If you want to be able to help so that there's no lack, then if this is really the caṇḍa-maṇi, you'll rain down what's needed by the crowd in order.'",
        "source": "T04n0202_008:0409a24_0"
    },
    {
        "source_sentence": "求願已訖，四方陰雲，即時風起，吹諸不淨，瑕穢糞掃，皆悉除去。",
        "translation": "When the vow had been fulfilled, clouds fell in all directions. Immediately a gust of wind rose and blew that swept away all the dirt and filth and excrement from the place where the image was housed.",
        "source": "T04n0202_008:0409a25_1"
    },
    {
        "source_sentence": "次雨微水，以掩塵土，次雨飲食，百味上美，次雨五穀，次雨衣服，次雨七寶種種奇珍，",
        "translation": "Next, it rained subtle water to cover the dust and dirt. Next, food and drink of a hundred flavors and deliciousness. Next, five kinds of grains. Next, clothing. Next, various rare treasures of the seven kinds of precious substances.",
        "source": "T04n0202_008:0409a27_2"
    },
    {
        "source_sentence": "閻浮提內，眾寶積滿。",
        "translation": "Within Jambudvīpa, there are many treasures in abundance.",
        "source": "T04n0202_008:0409a29_3"
    },
    {
        "source_sentence": "人民之類，自恣而取，上妙衣食，盈溢有餘，視諸珍寶，猶如瓦石。",
        "translation": "The various kinds of people took their food and drink freely, surflowing with exquisite clothing and food. They looked at the treasures as if they were tiles or stones.",
        "source": "T04n0202_008:0409a29_4"
    },
    {
        "source_sentence": "爾時菩薩，觀民充足，即遣臣吏四遠，告下閻浮提內，咸使聞知：『汝等群民！",
        "translation": "It was then that the bodhisattva observed the sufficient number of people and sent his officials from four directions to tell them down in Jambudvīpa, 'All of you people!",
        "source": "T04n0202_008:0409b02_5"
    },
    {
        "source_sentence": "先由窮乏，求於衣食及諸財寶，更相欺誑，殺害極意自利忘義，不惟罪福，",
        "translation": "Because of their poverty, they were previously deceiving each other in seeking food and clothing as well as riches and treasures. They killed others out of desire for self-benefit or for the sake of forgetfulness, not thinking only of sin but also of merit.",
        "source": "T04n0202_008:0409b03_6"
    },
    {
        "source_sentence": "命終皆墮三塗之中，從冥入冥，受罪多劫。",
        "translation": "At the end of their lives, they'll all fall into the three destinies, go from darkness into darkness, and suffer many eons of punishment.",
        "source": "T04n0202_008:0409b05_7"
    },
    {
        "source_sentence": "常相悲憐，無由相濟，故忘形苦，涉嶮入海，得此寶珠，來用相救。",
        "translation": "They are always pitying each other, and there is no way to rescue them. For this reason they forgot their physical forms and suffered greatly. After crossing a dangerous path they entered the sea and found this precious pearl that came to save them.",
        "source": "T04n0202_008:0409b06_8"
    },
    {
        "source_sentence": "汝等既已更無乏短，念自剋勵勤脩十善，攝身口意，慈仁孝順，精進御意，",
        "translation": "Having thus perfected your faculties, you should cultivate the ten kinds of goodness with a mind free from deficiency. Being compassionate, benevolent, filial, and obedient, you should exert all yourselves in this way:",
        "source": "T04n0202_008:0409b08_9"
    },
    {
        "source_sentence": "勿懷放逸。』",
        "translation": "Don't harbor carelessness.'",
        "source": "T04n0202_008:0409b10_0"
    },
    {
        "source_sentence": "種種方便，廣勅奉善，因作文書，告諸王臣，騰其法誨，咸令聞知，更相勸督，",
        "translation": "Through various expedient means the king and his retainers were widely instructed to respectfully serve him. For this reason they wrote a letter to all the king’s officials, inviting them to listen to their exhortation on the doctrine of Buddhism so that they might learn more about it and further encourage each other in supervising its practice.",
        "source": "T04n0202_008:0409b10_1"
    },
    {
        "source_sentence": "勿妄為非。",
        "translation": "Don't mistake it for what's wrong.",
        "source": "T04n0202_008:0409b12_2"
    },
    {
        "source_sentence": "爾時一切閻浮提內，既蒙大恩慈澤霑潤，各思何方，仰酬至德？",
        "translation": "At the time, all the people in Jambudvīpa had received great kindness, kindness, grace, and moisture, and each thought where to repay their most excellent virtue.",
        "source": "T04n0202_008:0409b12_3"
    },
    {
        "source_sentence": "又蒙優教，勅使脩善，咸皆慕義，專習慈敬，制身口意，不妄犯非，命終之後，",
        "translation": "They were also instructed by the Emperor to cultivate wholesomeness and they all cherished righteousness. They exclusively practiced loving-kindness and respect, restrained themselves in body, speech, and thought, and refrained from indulging in unwholesomeness.",
        "source": "T04n0202_008:0409b13_4"
    },
    {
        "source_sentence": "皆得生天。",
        "translation": "They'll all be born in heaven.",
        "source": "T04n0202_008:0409b15_5"
    },
    {
        "source_sentence": "「如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T04n0202_008:0409b15_6"
    },
    {
        "source_sentence": "欲知爾時父婆羅門尼拘樓陀者，今現我父淨飯王是。",
        "translation": "If you want to know that my father, the Brāhmaṇa Nirgrantha Kauṇḍinya of that time, is now my father, King Śuddhodana.",
        "source": "T04n0202_008:0409b16_7"
    },
    {
        "source_sentence": "爾時母者，今現我母摩訶摩耶是。",
        "translation": "The mother of that time is now my mother Mahāmaudgalyāyana.",
        "source": "T04n0202_008:0409b17_8"
    },
    {
        "source_sentence": "時大施者，今我身是。",
        "translation": "The great donor at the time was me now.",
        "source": "T04n0202_008:0409b18_9"
    },
    {
        "source_sentence": "銀城中龍者，今舍利弗是。",
        "translation": "The dragon in the silver city was Śāriputra, who is now Śāriputra.",
        "source": "T04n0202_008:0409b18_10"
    },
    {
        "source_sentence": "琉璃城中龍者，今目犍連是。",
        "translation": "The dragon in the city of lapis lazuli is Maudgalyāyana.",
        "source": "T04n0202_008:0409b19_11"
    },
    {
        "source_sentence": "金城中龍者，今阿難是。",
        "translation": "The dragon in the golden city was Ānanda, now Ānanda.",
        "source": "T04n0202_008:0409b20_12"
    },
    {
        "source_sentence": "時海神者，今離越是。",
        "translation": "The sea god of that time is the one who's free from transmigration now.",
        "source": "T04n0202_008:0409b20_13"
    },
    {
        "source_sentence": "阿難為龍王時，奉事於我，善知時宜，乃至今日，素自知時。",
        "translation": "Ānanda served me when he was the king of the nāga kings. He knows well the season and the proper time, up to today’s [due] day.",
        "source": "T04n0202_008:0409b21_14"
    },
    {
        "source_sentence": "阿難欲得此三願者，隨從其意。」",
        "translation": "If Ānanda wants to attain these three vows, follow his wishes.",
        "source": "T04n0202_008:0409b22_15"
    },
    {
        "source_sentence": "阿難聞此，歡喜踊躍，從座處起，長跪白佛：「當盡形壽為佛侍者。」",
        "translation": "When Ānanda heard this, he jumped up from his seat and knelt down long enough to tell the Buddha, I'll be the Buddha's attendant for the rest of my life.",
        "source": "T04n0202_008:0409b23_16"
    },
    {
        "source_sentence": "時諸會者，聞佛所說，感念大恩，專心剋勵，思惟四諦諸法出要，有得須陀洹、斯陀含、阿那含、阿羅漢者，",
        "translation": "Those in the assembly, having heard the Buddha’s exhortation, felt great compassion. They concentrated their minds on enlightenment and contemplated the teachings of the Four Noble Truths so as to attain liberation. There were those who had attained stream-entry, once-returners, heretics, non-returners, and arhats.",
        "source": "T04n0202_008:0409b24_17"
    },
    {
        "source_sentence": "有種辟支佛善根因緣者，有發無上正真道意者，有得住不退地者，咸共歡喜，",
        "translation": "Those who planted the causes and conditions for the roots of goodness of the pratyekabuddhas, those who aroused the aspiration for the supreme path of enlightenment, and those who had attained the stage of nonregression were all joyful.",
        "source": "T04n0202_008:0409b27_18"
    },
    {
        "source_sentence": "頂戴奉行。",
        "translation": "I'll carry it on my head and venerate it.",
        "source": "T04n0202_008:0409b29_19"
    },
    {
        "source_sentence": "賢愚經卷第八",
        "translation": "Sutra of Good and Evil, Volume 8",
        "source": "T04n0202_008:0409c01_0"
    }
]