[
    {
        "source_sentence": "百喻經卷第一",
        "translation": "One Hundred Parables Sutra, Volume 1",
        "source": "T04n0209_001:0543a04_0"
    },
    {
        "source_sentence": "尊者僧伽斯那撰",
        "translation": "written by Venerable Saṃghâsena",
        "source": "T04n0209_001:0543a06_0"
    },
    {
        "source_sentence": "蕭齊天竺三藏求那毘地譯",
        "translation": "Xiao Qi translated by the translator of the Tripiṭaka of Tianzhus, Guanabhidhi",
        "source": "T04n0209_001:0543a07_0"
    },
    {
        "source_sentence": "愚人食鹽喻　愚人集牛乳喻　以梨打破頭喻　婦詐語稱死喻　渴見水喻　子死欲停置家中喻　認人為兄喻　山羗偷官庫喻　歎父德行喻　三重樓喻　婆羅門殺子喻　煮黑石蜜漿喻　說人喜瞋喻　殺商主祀天喻　醫與王女藥令卒長大喻　灌甘蔗喻　債半錢喻　就樓磨刀喻　乘船失釪喻　人說王縱暴喻　婦女欲更求子喻（一）◎愚人食鹽喻昔有愚人至於他家，",
        "translation": "Foolish people eat salt metaphor. Foolish people gather cow milk metaphor. They break their heads with rice metaphor. The wife speaks falsely and calls death metaphor. Thirst is seeing water metaphor. Children die and want to",
        "source": "T04n0209_001:0543a08_0"
    },
    {
        "source_sentence": "主人與食嫌淡無味，主人聞已更為益鹽。",
        "translation": "The host disliked the food and didn't taste good, but after hearing it, the host added more salt.",
        "source": "T04n0209_001:0543a17_1"
    },
    {
        "source_sentence": "既得鹽美，便自念言：「所以美者緣有鹽故，少有尚爾況復多也？」",
        "translation": "When he had obtained the flavor of salt, he thought to himself, That's why it's so delicious because there's salt, and how could there be few if there were many?",
        "source": "T04n0209_001:0543a18_2"
    },
    {
        "source_sentence": "愚人無智便空食鹽，食已口爽返為其患。",
        "translation": "The ignorant foolish man then ate the salt in vain, and after eating it, his mouth became clear and he returned home as a danger.",
        "source": "T04n0209_001:0543a20_3"
    },
    {
        "source_sentence": "譬彼外道聞節飲食可以得道，即便斷食或經七日或十五日，徒自困餓無益於道。",
        "translation": "It's like a non-Buddhist who hears the rules for eating and drinking to attain enlightenment and even stops eating for seven days or fifteen days, but he simply starves and doesn't benefit from the path.",
        "source": "T04n0209_001:0543a21_4"
    },
    {
        "source_sentence": "如彼愚人，以鹽美故而空食之，致令口爽，此亦復爾。",
        "translation": "Suppose that foolish man eats it empty because of its salty taste and causes his mouth to be refreshed, and this is likewise.",
        "source": "T04n0209_001:0543a23_5"
    },
    {
        "source_sentence": "（二）愚人集牛乳喻",
        "translation": "(2) The Foolish Man's Collection of Cow Milk Parable",
        "source": "T04n0209_001:0543a25_0"
    },
    {
        "source_sentence": "昔有愚人將會賓客，欲集牛乳以擬供設，而作是念：「我今若豫於日日中[穀-禾+牛]取牛乳，",
        "translation": "In the past, there was a foolish man who wanted to gather cow’s milk in order to prepare an offering and thought:",
        "source": "T04n0209_001:0543a26_0"
    },
    {
        "source_sentence": "牛乳漸多卒無安處，或復酢敗。",
        "translation": "The milk of the cow gradually became abundant but there was not a peaceful place for her, and eventually some of the milk lost its sweetness.",
        "source": "T04n0209_001:0543a28_1"
    },
    {
        "source_sentence": "不如即就牛腹盛之，待臨會時當頓[穀-禾+牛]取。」",
        "translation": "It's better to take it from the cow's belly and fill it up, and when you're approaching the assembly, you'll suddenly [grain - grain + cow] take it.",
        "source": "T04n0209_001:0543a28_2"
    },
    {
        "source_sentence": "作是念已，便捉牸牛母子，各繫異處。",
        "translation": "After he had this thought, he then grabbed the cowherd's mother and son, each tied them in a different place.",
        "source": "T04n0209_001:0543a29_3"
    },
    {
        "source_sentence": "却後一月，爾乃設會迎置賓客，方牽牛來欲[(殼-一)\\/牛]取乳，",
        "translation": "One month later, the king arranged an assembly to receive his guests. He brought the cow with him and wished to fetch milk.",
        "source": "T04n0209_001:0543b01_4"
    },
    {
        "source_sentence": "而此牛乳即乾無有。",
        "translation": "But this cow's milk is dry and nonexistent.",
        "source": "T04n0209_001:0543b03_5"
    },
    {
        "source_sentence": "時為眾賓或瞋或笑。",
        "translation": "At the time, he's either angry or laughing for the sake of the guests.",
        "source": "T04n0209_001:0543b03_6"
    },
    {
        "source_sentence": "愚人亦爾，欲修布施，方言待我大有之時，然後頓施。",
        "translation": "A foolish man is likewise, wanting to cultivate generosity, simply saying that he'll wait until the time when I have a great deal of existence before he suddenly gives it.",
        "source": "T04n0209_001:0543b04_7"
    },
    {
        "source_sentence": "未及聚頃，或為縣官水火盜賊之所侵奪，或卒命終不及時施，彼亦如是。",
        "translation": "Before the time is up, they may be attacked by water officials, fire thieves, or thieves and robbers, or they may die in an untimely way. They're likewise.",
        "source": "T04n0209_001:0543b05_8"
    },
    {
        "source_sentence": "（三）以梨打頭破喻",
        "translation": "(3) The parable of using a fig tree to beat the head and break it",
        "source": "T04n0209_001:0543b08_0"
    },
    {
        "source_sentence": "昔有愚人頭上無毛，時有一人以梨打頭，乃至二三悉皆傷破，時此愚人默然忍受不知避去。",
        "translation": "In the past, there was a foolish man with hairless hair on his head when a man beat his head with a fig tree and two or three of them were all injured.",
        "source": "T04n0209_001:0543b09_0"
    },
    {
        "source_sentence": "傍人見已而語之言：「何不避去，乃住受打致使頭破？」",
        "translation": "Seeing this, the bystanders said to him, Why don't you avoid it and leave, but stay and be beaten so that your head breaks open?",
        "source": "T04n0209_001:0543b11_1"
    },
    {
        "source_sentence": "愚人答言：「如彼人者憍慢恃力癡無智慧，見我頭上無有髮毛謂為是石，",
        "translation": "The foolish man replied, Suppose that person is arrogant and self-indulgent, lacking wisdom, and sees no hair on my head.",
        "source": "T04n0209_001:0543b12_2"
    },
    {
        "source_sentence": "以梨打我頭破乃爾。」",
        "translation": "It's just like striking my head with a pear and breaking it open.",
        "source": "T04n0209_001:0543b14_3"
    },
    {
        "source_sentence": "傍人語言：「汝自愚癡，云何名彼以為癡也？",
        "translation": "The people nearby said, You're foolish yourself, so why do you call them fools?",
        "source": "T04n0209_001:0543b14_4"
    },
    {
        "source_sentence": "汝若不癡，為他所打，乃至頭破不知逃避？」",
        "translation": "If you aren't deluded, won't you be beaten by others or even break your head and don't know how to escape?",
        "source": "T04n0209_001:0543b15_5"
    },
    {
        "source_sentence": "比丘亦爾，不能具修信戒聞慧，但整威儀以招利養，如彼愚人被他打頭不知避去，",
        "translation": "Likewise, a monk who is unable to cultivate the precepts of faith, morality, learning, and wisdom but simply prepares his manner in order to solicit profit. Suppose that foolish man is beaten on the head by another and doesn't",
        "source": "T04n0209_001:0543b16_6"
    },
    {
        "source_sentence": "乃至傷破反謂他癡，此比丘者亦復如是。",
        "translation": "This bhikṣu is also likewise.",
        "source": "T04n0209_001:0543b18_7"
    },
    {
        "source_sentence": "（四）婦詐稱死喻",
        "translation": "(4) The Parable of the Death of a Woman Who Deceived to Be called 'Death'",
        "source": "T04n0209_001:0543b20_0"
    },
    {
        "source_sentence": "昔有愚人，其婦端正，情甚愛重；",
        "translation": "In the past there was a foolish man whose wife was beautiful and affectionate.",
        "source": "T04n0209_001:0543b21_0"
    },
    {
        "source_sentence": "婦無直信，後於中間共他交往，邪婬心盛欲逐傍夫捨離己婿，於是密語一老母言：「我去之後，",
        "translation": "The woman had no straight faith, and later engaged in sexual misconduct with someone else in the middle. With a strong mind of sexual desire she was about to drive her stepmother away from her husband. So she secretly said to an elderly mother, “",
        "source": "T04n0209_001:0543b21_1"
    },
    {
        "source_sentence": "汝可齎一死婦女屍安著屋中，語我夫言，云我已死。」",
        "translation": "You may carry a dead woman's corpse into the house and say to my husband, 'I'm dead.'",
        "source": "T04n0209_001:0543b24_2"
    },
    {
        "source_sentence": "老母於後伺其夫主不在之時，以一死屍置其家中。",
        "translation": "Later, while the old mother was waiting for her husband to stay away, she put a dead corpse in her house.",
        "source": "T04n0209_001:0543b25_3"
    },
    {
        "source_sentence": "及其夫還，老母語言：「汝婦已死。」",
        "translation": "When their husband returned, the old mother said, Your wife has died.",
        "source": "T04n0209_001:0543b26_4"
    },
    {
        "source_sentence": "夫即往視，信是己婦，哀哭懊惱，大[卄\\/積]薪油燒取其骨，以囊盛之晝夜懷挾。",
        "translation": "The husband immediately went to see her. believing that she was his own wife, he wept in distress and burned the bones with a great deal of firewood and oil. He put them into a bag and carried them on his back day and night.",
        "source": "T04n0209_001:0543b27_5"
    },
    {
        "source_sentence": "婦於後時心厭傍夫便還歸家，語其夫言：「我是汝妻。」",
        "translation": "The woman later became disillusioned with her husband and returned home, saying to him, I'm your wife.",
        "source": "T04n0209_001:0543b29_6"
    },
    {
        "source_sentence": "夫答之言：「我婦久死，汝是阿誰妄言我婦？」",
        "translation": "The husband answered, My wife has been dead for a long time; who are you, Ānanda, lying to me and my wife?",
        "source": "T04n0209_001:0543c01_7"
    },
    {
        "source_sentence": "乃至二三猶故不信。",
        "translation": "Up to two or three, they still don't believe it.",
        "source": "T04n0209_001:0543c02_8"
    },
    {
        "source_sentence": "如彼外道聞他邪說心生惑著，謂為真實永不可改，雖聞正教不信受持。",
        "translation": "It's like that non-Buddhist who hears the wrong teachings of others and becomes confused and attached in his mind, which is to say that it's true and eternally unchanging, even though he hears the right teaching and doesn'",
        "source": "T04n0209_001:0543c02_9"
    },
    {
        "source_sentence": "（五）渴見水喻",
        "translation": "(5) The Parable of Seeing Water with Thirst",
        "source": "T04n0209_001:0543c05_0"
    },
    {
        "source_sentence": "過去有人，癡無智慧，極渴須水，見熱時炎謂為是水，即便逐走至辛頭河，",
        "translation": "In the past there was a man who, out of delusion and lacking wisdom, became extremely thirsty and needed water. Seeing that it was hot at the time of heat, he thought it was water and ran off to the Sindhu River.",
        "source": "T04n0209_001:0543c06_0"
    },
    {
        "source_sentence": "既至河所對視不飲。",
        "translation": "When he arrived at the river, he looked around and didn't drink.",
        "source": "T04n0209_001:0543c07_1"
    },
    {
        "source_sentence": "傍人語言：「汝患渴逐水，今至水所何故不飲？」",
        "translation": "The people nearby said, You're thirsty and chasing water, so why don't you drink when you reach the water now?",
        "source": "T04n0209_001:0543c08_2"
    },
    {
        "source_sentence": "愚人答言：「君可飲盡，我當飲之，此水極多俱不可盡，是故不飲。」",
        "translation": "The foolish man replied, You can drink it up; I will drink it. This water is so plentiful that it won't be able to be used up; therefore, I won't drink it.",
        "source": "T04n0209_001:0543c09_3"
    },
    {
        "source_sentence": "爾時眾人聞其此語，皆大嗤笑。",
        "translation": "When the crowd heard these words, they all laughed and laughed.",
        "source": "T04n0209_001:0543c11_0"
    },
    {
        "source_sentence": "譬如外道僻取其理，以己不能具持佛戒，遂便不受，致使將來無得道分、流轉生死，",
        "translation": "It's like a non-Buddhist who takes the principle out of hand and doesn't fully observe the Buddha's precepts, so he won't accept them, so in the future he won't attain the factors of the path and will",
        "source": "T04n0209_001:0543c11_1"
    },
    {
        "source_sentence": "若彼愚人見水不飲為時所笑，亦復如是。",
        "translation": "If that foolish man sees water and doesn't drink it as he smiles at the time, it's likewise.",
        "source": "T04n0209_001:0543c13_2"
    },
    {
        "source_sentence": "（六）子死欲停置家中喻",
        "translation": "(6) The Parable of the Son dying and wanting to stay at home",
        "source": "T04n0209_001:0543c15_0"
    },
    {
        "source_sentence": "昔有愚人養育七子，一子先死。",
        "translation": "In the past there was a foolish man raising seven children, and one of them died before the other.",
        "source": "T04n0209_001:0543c16_0"
    },
    {
        "source_sentence": "時此愚人見子既死，便欲停置於其家中，自欲棄去。",
        "translation": "Seeing that his son had died, the foolish man then wanted to stay at his house and abandoned him.",
        "source": "T04n0209_001:0543c16_1"
    },
    {
        "source_sentence": "傍人見已而語之言：「生死道異，當速莊嚴致於遠處而殯葬之，云何得留自欲棄去？」",
        "translation": "Seeing this, the bystanders said to him, The path of birth and death is different, so you must quickly adorn it and cause it to be buried in a distant place; how can you leave it for yourself and want to abandon it?",
        "source": "T04n0209_001:0543c18_0"
    },
    {
        "source_sentence": "爾時愚人聞此語已即自思念：「若不得留要當葬者，須更殺一子停擔兩頭乃可勝致。」",
        "translation": "After hearing these words, the foolish man then thought to himself, If you can't leave them behind for burial, you must kill another child and stop two loads before you can be killed.",
        "source": "T04n0209_001:0543c20_0"
    },
    {
        "source_sentence": "於是便更殺其一子，而擔負之遠葬林野。",
        "translation": "He then killed his son and carried him far away to be buried in a forest or wilderness.",
        "source": "T04n0209_001:0543c22_1"
    },
    {
        "source_sentence": "時人見之，深生嗤笑怪未曾有。",
        "translation": "When the people saw him, they laughed in wonder like never before.",
        "source": "T04n0209_001:0543c23_2"
    },
    {
        "source_sentence": "譬如比丘私犯一戒，情憚改悔，默然覆藏自說清淨，或有知者即語之言：「出家之人守持禁戒如護明珠不使缺落，",
        "translation": "It's like a monk who privately violates one precept and feels remorseful and repents, quietly hiding it and self-explanating its purity. Someone with knowledge may say to him, A renunciant observes the precept",
        "source": "T04n0209_001:0543c23_3"
    },
    {
        "source_sentence": "汝今云何違犯所受欲不懺悔？」",
        "translation": "How are you now not repenting of the desire to violate what you've received?",
        "source": "T04n0209_001:0543c26_4"
    },
    {
        "source_sentence": "犯戒者言：「苟須懺者，更就犯之然後當出。」",
        "translation": "Those who violate the precepts say, If they need to repent, they'll again violate it and then leave.",
        "source": "T04n0209_001:0543c27_5"
    },
    {
        "source_sentence": "遂便破戒多作不善，爾乃頓出。",
        "translation": "He then broke the precepts and often did unwholesome things, and he suddenly left.",
        "source": "T04n0209_001:0543c28_6"
    },
    {
        "source_sentence": "如彼愚人一子既死又殺一子，今此比丘亦復如是。",
        "translation": "Suppose that foolish man's one child died and another child was killed, and now this monk is likewise.",
        "source": "T04n0209_001:0543c29_7"
    },
    {
        "source_sentence": "（七）認人為兄喻",
        "translation": "(7) The parable of recognizing people as brothers",
        "source": "T04n0209_001:0544a02_0"
    },
    {
        "source_sentence": "昔有一人形容端正智慧具足，復多錢財，舉世人聞無不稱歎。",
        "translation": "Formerly there was a man of good appearance, well endowed with intelligence and wisdom. He also possessed large amounts of money and wealth. All the people in the world who heard him praised him.",
        "source": "T04n0209_001:0544a03_0"
    },
    {
        "source_sentence": "時有愚人見其如此，便言我兄。",
        "translation": "A foolish man then saw this and said, My brother!",
        "source": "T04n0209_001:0544a04_1"
    },
    {
        "source_sentence": "所以爾者，彼有錢財須者則用之，是故為兄；",
        "translation": "The reason for this is that if they have money and possessions, they will use them. That is why they are brothers.",
        "source": "T04n0209_001:0544a05_2"
    },
    {
        "source_sentence": "見其還債，言非我兄。",
        "translation": "Seeing him returning the debt, he said, It's not my brother.",
        "source": "T04n0209_001:0544a06_3"
    },
    {
        "source_sentence": "傍人語言：「汝是愚人！",
        "translation": "The people nearby said, You're a fool!",
        "source": "T04n0209_001:0544a06_4"
    },
    {
        "source_sentence": "云何須財名他為兄？",
        "translation": "What's the name of someone who needs possessions and calls others his brother?",
        "source": "T04n0209_001:0544a07_5"
    },
    {
        "source_sentence": "及其債時復言非兄。」",
        "translation": "When they're in debt, they also say it's not brother.",
        "source": "T04n0209_001:0544a07_6"
    },
    {
        "source_sentence": "愚人答言：「我以欲得彼之錢財認之為兄，實非是兄，若其債時則稱非兄。」",
        "translation": "The foolish man answered, I want to get that man's money and possessions so that I can recognize him as a brother, but he really isn't a brother; if he owes them at the time, then he's called not a brother.",
        "source": "T04n0209_001:0544a08_7"
    },
    {
        "source_sentence": "人聞此語無不笑之。",
        "translation": "Everyone hears these words and doesn't laugh at them.",
        "source": "T04n0209_001:0544a10_8"
    },
    {
        "source_sentence": "猶彼外道，聞佛善語貪竊而用以為己有，乃至傍人教使修行不肯修行，",
        "translation": "It's like those non-Buddhists who hear the Buddha' s good words and covet them as their own possessions, even to the point where they teach others to cultivate practice and refuse to cultivate it.",
        "source": "T04n0209_001:0544a10_9"
    },
    {
        "source_sentence": "而作是言：「為利養故，取彼佛語化道眾生，而無實事，云何修行？」",
        "translation": "He said, For the sake of profit, he takes the words of those buddhas and transforms sentient beings in the path but doesn't really do anything, so how can he cultivate them?",
        "source": "T04n0209_001:0544a12_10"
    },
    {
        "source_sentence": "猶向愚人為得財故言是我兄，及其債時復言非兄，此亦如是。",
        "translation": "It's like saying to a foolish man for the sake of gaining possessions that he's my brother, and when he's in debt, he also says it's not his brother.",
        "source": "T04n0209_001:0544a14_11"
    },
    {
        "source_sentence": "（八）山羗偷官庫喻",
        "translation": "(8) The Parable of the Mountain Thief's Treasury",
        "source": "T04n0209_001:0544a16_0"
    },
    {
        "source_sentence": "過去之世有一山羗，偷王庫物而遠逃走。",
        "translation": "In a past life, there was a mountain monk who stole from the king’s storehouse and fled far away.",
        "source": "T04n0209_001:0544a17_0"
    },
    {
        "source_sentence": "爾時國王遣人四出推尋捕得，將至王邊。",
        "translation": "The king then sent four men out to investigate and arrest him, and they were about to go to the king's side.",
        "source": "T04n0209_001:0544a18_0"
    },
    {
        "source_sentence": "王即責其所得衣處，山羗答言：「我衣乃是祖父之物。」",
        "translation": "The king then blamed him for the place where he obtained the robe, and Shanqiao answered, My robe is the property of my grandfather.",
        "source": "T04n0209_001:0544a18_1"
    },
    {
        "source_sentence": "王遣著衣，實非山羗本所有故，不知著之，應在手者著於脚上，應在腰者返著頭上。",
        "translation": "The king sent his robe, which really wasn't originally owned by the mountain and didn't know to wear it, so he puts it on his feet if it's in his hand and puts it on his head if it's in his waist",
        "source": "T04n0209_001:0544a20_2"
    },
    {
        "source_sentence": "王見賊已，集諸臣等共詳此事，而語之言：「若是汝之祖父已來所有衣者，",
        "translation": "Seeing the thief, the king gathered his ministers together to investigate the matter and said to him, “If this is your grandfather’s robe that you have owned since the distant past,",
        "source": "T04n0209_001:0544a22_3"
    },
    {
        "source_sentence": "應當解著，云何顛倒用上為下？",
        "translation": "You should understand that attachment, so why do you mistakenly use what's superior for what's inferior?",
        "source": "T04n0209_001:0544a23_4"
    },
    {
        "source_sentence": "以不解故，定知汝衣必是偷得，非汝舊物。」",
        "translation": "Because you don't understand it, you must surely know that your robe must have been stolen, not your old possessions.",
        "source": "T04n0209_001:0544a24_5"
    },
    {
        "source_sentence": "借以為譬，王者如佛，寶藏如法，愚癡羗者猶如外道，竊聽佛法著已法中以為自有，",
        "translation": "The king is like a buddha, the treasury of treasure is like the Dharma. Those ignorant and ignorant are like heretics who secretly listen to the Buddha’s teaching and cling to their own doctrine in order to take it for their own existence.",
        "source": "T04n0209_001:0544a25_6"
    },
    {
        "source_sentence": "然不解故，布置佛法迷亂上下，不知法相。",
        "translation": "However, because they don't understand it, they place the Buddha's teaching in confusion and don't know the characteristics of the teaching.",
        "source": "T04n0209_001:0544a27_7"
    },
    {
        "source_sentence": "如彼山羗得王寶衣，不識次第顛倒而著，亦復如是。",
        "translation": "It's likewise when that mountain monk attains the king's jeweled robe and doesn't recognize it, mistakenly wearing it in order.",
        "source": "T04n0209_001:0544a28_8"
    },
    {
        "source_sentence": "（九）歎父德行喻",
        "translation": "(9) The Parable of Praising the Virtuous Conduct of the Father",
        "source": "T04n0209_001:0544b01_0"
    },
    {
        "source_sentence": "昔時有人於眾人中，歎己父德而作是言：「我父慈仁不害不盜，直作實語兼行布施。」",
        "translation": "In the past, someone praised their father's virtue among many people and said, My father was kind and not harming or stealing, speaking honestly and giving alms.",
        "source": "T04n0209_001:0544b02_0"
    },
    {
        "source_sentence": "時有愚人聞其此語便作是念言：「我父德行復過汝父。」",
        "translation": "When a foolish man heard these words, he thought, My father's virtuous conduct is even greater than your father's.",
        "source": "T04n0209_001:0544b04_0"
    },
    {
        "source_sentence": "諸人問言：「有何德行請道其事？」",
        "translation": "The people asked, What virtuous practice is there to ask for the way to do it?",
        "source": "T04n0209_001:0544b05_1"
    },
    {
        "source_sentence": "愚人答曰：「我父小來斷絕婬欲初無染污。」",
        "translation": "The foolish man answered, When my father was young, he cut off sexual desire and first became undefiled.",
        "source": "T04n0209_001:0544b06_2"
    },
    {
        "source_sentence": "眾人語言：「若斷婬欲，云何生汝？」",
        "translation": "The people said, If you stop sexual desire, how will you be born?",
        "source": "T04n0209_001:0544b07_3"
    },
    {
        "source_sentence": "深為時人之所怪笑。",
        "translation": "He was deeply surprised and laughed at by the people of the time.",
        "source": "T04n0209_001:0544b07_4"
    },
    {
        "source_sentence": "猶如世間無智之流，欲讚人德不識其實，反致毀呰，如彼愚者，意好歎父言成過失，",
        "translation": "It's like that foolish man who wants to praise the virtues of others but doesn't know the truth, and instead disparages them. Like that foolish man who wishes to praise his father's words as a fault.",
        "source": "T04n0209_001:0544b08_5"
    },
    {
        "source_sentence": "此亦如是。",
        "translation": "This is likewise.",
        "source": "T04n0209_001:0544b10_6"
    },
    {
        "source_sentence": "（一〇）三重樓喻",
        "translation": "(20) The Parable of the Three Levels",
        "source": "T04n0209_001:0544b11_0"
    },
    {
        "source_sentence": "往昔之世，有富愚人癡無所知，到餘富家見三重樓，高廣嚴麗軒敞踈朗，",
        "translation": "Formerly, in ancient times, there were wealthy and ignorant people who had no knowledge of anything but ignorance. When they came to other wealthy families, they saw three story buildings that were tall, spacious, lofty, grand, and beautifully built",
        "source": "T04n0209_001:0544b12_0"
    },
    {
        "source_sentence": "心生渴仰即作是念：「我有財錢不減於彼，云何頃來而不造作如是之樓？」",
        "translation": "He became thirsty and thought, I have money that isn't less than that, so how could I not build such a tower in the future?",
        "source": "T04n0209_001:0544b13_1"
    },
    {
        "source_sentence": "即喚木匠而問言曰：「解作彼家端正舍不？」",
        "translation": "He then summoned the woodworker and asked, Do you understand how to make that house into a decent dwelling?",
        "source": "T04n0209_001:0544b15_2"
    },
    {
        "source_sentence": "木匠答言：「是我所作。」",
        "translation": "The woodworker replied, It's made by me.",
        "source": "T04n0209_001:0544b16_3"
    },
    {
        "source_sentence": "即便語言：「今可為我造樓如彼。」",
        "translation": "He then said, Now, you can build a tower for me like that.",
        "source": "T04n0209_001:0544b17_4"
    },
    {
        "source_sentence": "是時木匠即便經地壘墼作樓。",
        "translation": "The woodworker then went down the ground and built a tower out of bricks.",
        "source": "T04n0209_001:0544b17_5"
    },
    {
        "source_sentence": "愚人見其壘墼作舍，猶懷疑惑不能了知，而問之言：「欲作何等？」",
        "translation": "When the foolish man saw that he built a house out of bricks and tiles, he still had doubts and couldn't understand it, and asked, What do you want to make?",
        "source": "T04n0209_001:0544b18_6"
    },
    {
        "source_sentence": "木匠答言：「作三重屋。」",
        "translation": "The woodworker answered, Make a three-story house.",
        "source": "T04n0209_001:0544b20_7"
    },
    {
        "source_sentence": "愚人復言：「我不欲下二重之屋，先可為我作最上屋。」",
        "translation": "The foolish man again said, I don't want to descend from the two-story house; first, you can make the highest house for me.",
        "source": "T04n0209_001:0544b20_8"
    },
    {
        "source_sentence": "木匠答言：「無有是事，何有不作最下重屋而得造彼第二之屋？",
        "translation": "The carpenter replied, There's no such thing, so why wouldn't you build the lowest and most heavy house and get the second one built?",
        "source": "T04n0209_001:0544b21_9"
    },
    {
        "source_sentence": "不造第二云何得造第三重屋？」",
        "translation": "If you don't build the second, how can you build the third story?",
        "source": "T04n0209_001:0544b23_10"
    },
    {
        "source_sentence": "愚人固言：「我今不用下二重屋，必可為我作最上者。」",
        "translation": "The foolish man insisted, Now, I won't need to go down into the two-story house; I can surely become the best of them.",
        "source": "T04n0209_001:0544b24_11"
    },
    {
        "source_sentence": "時人聞已便生怪笑，咸作此言：「何有不造下第一屋而得上者？」",
        "translation": "After hearing this, the people laughed in wonder and said, How could there be someone who doesn't build the first house down and then get up?",
        "source": "T04n0209_001:0544b25_12"
    },
    {
        "source_sentence": "譬如世尊四輩弟子，不能精勤修敬三寶，懶惰懈怠欲求道果，而作是言：「我今不用餘下三果，",
        "translation": "Good man, this is analogous to a fourfold group of disciples of the World-honored One who are unable to exert themselves in venerating the Three Jewels. They are idle and lazy because they wish to pursue the fruits of the path",
        "source": "T04n0209_001:0544b27_0"
    },
    {
        "source_sentence": "唯求得彼阿羅漢果。」",
        "translation": "They only seek to attain the fruit of that arhat.",
        "source": "T04n0209_001:0544b29_1"
    },
    {
        "source_sentence": "亦為時人之所嗤笑，如彼愚者等無有異。",
        "translation": "It's also laughed at by the people of the time, just like that foolish man and so forth, with no difference.",
        "source": "T04n0209_001:0544b29_2"
    },
    {
        "source_sentence": "（一一）婆羅門殺子喻",
        "translation": "(one by one) the parable of the Brāhmaṇa killing children",
        "source": "T04n0209_001:0544c02_0"
    },
    {
        "source_sentence": "昔有婆羅門自謂多知，於諸星術種種技藝無不明達，恃己如此，欲顯其德，",
        "translation": "Formerly there was a brahman who claimed to be well versed in the arts and crafts of the stars, but he did not understand them. He relied on his knowledge so as to show his virtue.",
        "source": "T04n0209_001:0544c03_0"
    },
    {
        "source_sentence": "遂至他國，抱兒而哭。",
        "translation": "He then went to another country, took his child in his arms, and wept.",
        "source": "T04n0209_001:0544c04_1"
    },
    {
        "source_sentence": "有人問婆羅門言：「汝何故哭？」",
        "translation": "Someone asked the Brāhmaṇa, Why are you crying?",
        "source": "T04n0209_001:0544c05_2"
    },
    {
        "source_sentence": "婆羅門言：「今此小兒七日當死，愍其夭傷以是哭耳。」",
        "translation": "The Brāhmaṇa said, Now, this little boy will die in seven days, and it's because of this weeping that I pity him for his death.",
        "source": "T04n0209_001:0544c06_3"
    },
    {
        "source_sentence": "時人語言：「人命難知，計算喜錯，設七日頭或能不死，何為豫哭？」",
        "translation": "The people then said, People's lives are difficult to know, and there's a mistake in calculating joy; why would they weep if they were to do so for seven days or so?",
        "source": "T04n0209_001:0544c07_4"
    },
    {
        "source_sentence": "婆羅門言：「日月可闇星宿可落，我之所記終無違失。」",
        "translation": "The Brāhmaṇa said, The sun and moon can be dark, the stars can fall, and what I record is never wrong.",
        "source": "T04n0209_001:0544c08_5"
    },
    {
        "source_sentence": "為名利故，至七日頭自殺其子以證己說。",
        "translation": "For the sake of fame and profit, he killed his son at the beginning of the seventh day in order to prove what he said.",
        "source": "T04n0209_001:0544c10_6"
    },
    {
        "source_sentence": "時諸世人却後七日聞其兒死，咸皆歎言：「真是智者，所言不錯。」",
        "translation": "Seven days later, the people of the world heard that his child died and all praised him, saying, That's really a wise man whose words are not right.",
        "source": "T04n0209_001:0544c11_7"
    },
    {
        "source_sentence": "心生信服悉來致敬。",
        "translation": "They all became convinced and came to pay their respects.",
        "source": "T04n0209_001:0544c12_8"
    },
    {
        "source_sentence": "猶如佛之四輩弟子為利養故自稱得道，有愚人法殺善男子詐現慈德，故使將來受苦無窮，",
        "translation": "It's like the four groups of disciples of the Buddha who claim to attain the path for profit, and there are foolish people who kill good men in order to fraudulently show compassionate virtue, so they'll suffer endless suffering in",
        "source": "T04n0209_001:0544c13_9"
    },
    {
        "source_sentence": "如婆羅門為驗己言殺子惑世。",
        "translation": "It's like a Brāhmaṇa who says he killed his son in order to test himself and confuse the world.",
        "source": "T04n0209_001:0544c15_10"
    },
    {
        "source_sentence": "（一二）煮黑石蜜漿喻",
        "translation": "(12) The parable of boiling black rock honey and syrup",
        "source": "T04n0209_001:0544c17_0"
    },
    {
        "source_sentence": "昔有愚人煮黑石蜜，有一富人來至其家。",
        "translation": "In the past, there was a foolish man who cooked black rock honey. A rich man came to his house.",
        "source": "T04n0209_001:0544c18_0"
    },
    {
        "source_sentence": "時此愚人便作是念：「我今當取黑石蜜漿與此富人。」",
        "translation": "The foolish man then had this thought, Now, I will give this rich man the milk of black rock honey.",
        "source": "T04n0209_001:0544c19_0"
    },
    {
        "source_sentence": "即著少水用置火中。",
        "translation": "He then puts a little water in the fire and puts it there.",
        "source": "T04n0209_001:0544c20_1"
    },
    {
        "source_sentence": "即於火上以扇扇之望得使冷。",
        "translation": "On the fire, he puts a fan on it and hopes to make it cool.",
        "source": "T04n0209_001:0544c20_2"
    },
    {
        "source_sentence": "傍人語言：「下不止火，扇之不已云何得冷？」",
        "translation": "The people nearby said, How could it be cold if it doesn't go down without a fire and isn't fanned?",
        "source": "T04n0209_001:0544c21_3"
    },
    {
        "source_sentence": "爾時人眾悉皆嗤笑。",
        "translation": "At that point, all the people laughed.",
        "source": "T04n0209_001:0544c22_4"
    },
    {
        "source_sentence": "其猶外道不滅煩惱熾然之火，少作苦行臥蕀刺上，五熱炙身而望清涼寂靜之道，",
        "translation": "It's like a non-Buddhist who doesn't extinguish the blazing fire of affliction, engages in little asceticism, lies cross-legged and thorn-infesting, burns his body with five fever",
        "source": "T04n0209_001:0544c23_0"
    },
    {
        "source_sentence": "終無是處，徒為智者之所怪笑，受苦現在殃流來劫。",
        "translation": "In the end, there's no place for it; it's just because they're laughed at by the wise man, who suffers from suffering in the present and continues to suffer in the future.",
        "source": "T04n0209_001:0544c25_0"
    },
    {
        "source_sentence": "（一三）說人喜瞋喻",
        "translation": "(23) The Parable of Explaining the Joy and anger of People",
        "source": "T04n0209_001:0544c27_0"
    },
    {
        "source_sentence": "過去有人，共多人眾坐於屋中，歎一外人德行極好，唯有二過：一者喜瞋，",
        "translation": "In the past, someone sat in a room with many people and praised one outsider for his extraordinary virtue. There were only two faults:",
        "source": "T04n0209_001:0544c28_0"
    },
    {
        "source_sentence": "二者作事倉卒。",
        "translation": "The second is to serve the storehouse and die.",
        "source": "T04n0209_001:0544c29_1"
    },
    {
        "source_sentence": "爾時此人過在門外，聞作是語便生瞋恚，即入其屋擒彼道己愚惡之人，",
        "translation": "Hearing these words, they became angry and went into their house to capture the man who said, “I am a fool.",
        "source": "T04n0209_001:0545a01_2"
    },
    {
        "source_sentence": "以手打撲。",
        "translation": "He beats it with his hand and sucks it.",
        "source": "T04n0209_001:0545a02_3"
    },
    {
        "source_sentence": "傍人問言：「何故打也？」",
        "translation": "The attendant asked, Why did you beat him?",
        "source": "T04n0209_001:0545a03_4"
    },
    {
        "source_sentence": "其人答言：「我曾何時喜瞋、倉卒？",
        "translation": "The man answered, When did I ever have joy and anger or a store keeper?",
        "source": "T04n0209_001:0545a03_5"
    },
    {
        "source_sentence": "而此人者道：『我順喜瞋恚，作事倉卒。』",
        "translation": "That person then said, 'I'm delighted with anger and serve the storekeeper.'",
        "source": "T04n0209_001:0545a04_6"
    },
    {
        "source_sentence": "是故打之。」",
        "translation": "That's why they beat him.",
        "source": "T04n0209_001:0545a05_7"
    },
    {
        "source_sentence": "傍人語言：「汝今喜瞋倉卒之相即時現驗，云何諱之？」",
        "translation": "The people around him said, Now that you're delighted with the characteristics of the wicked guard, what do you name them?",
        "source": "T04n0209_001:0545a05_8"
    },
    {
        "source_sentence": "人說過惡而起怨責，深為眾人怪其愚惑。",
        "translation": "People speak of faults and resentment, and they deeply wonder at their folly for the sake of others.",
        "source": "T04n0209_001:0545a06_9"
    },
    {
        "source_sentence": "譬如世間飲酒之夫，躭荒沈酒作諸放逸，見人呵責返生尤疾，苦引證作用自明白，",
        "translation": "It's like when a wine drinker in the world becomes addicted to alcohol and indulges in various kinds of carelessness. Seeing someone criticized, he comes back to life with special illnesses, which are painful, induced by suffering,",
        "source": "T04n0209_001:0545a07_10"
    },
    {
        "source_sentence": "若此愚人諱聞己過，見他道說返欲打撲之。",
        "translation": "If this foolish man's name is heard about his faults, he sees someone else's teaching and wants to be beaten back.",
        "source": "T04n0209_001:0545a09_11"
    },
    {
        "source_sentence": "（一四）殺商主祀天喻",
        "translation": "(24) The Parable of the King Who killed the Merchant and sacrificed to the Gods",
        "source": "T04n0209_001:0545a11_0"
    },
    {
        "source_sentence": "昔有賈客欲入大海，入大海之法要須導師然後可去，即共求覓得一導師，",
        "translation": "Formerly there was a merchant who wished to enter the great sea. The essentials for entering the great sea required a guide before he could do so. So they went out together to search for a guide.",
        "source": "T04n0209_001:0545a12_0"
    },
    {
        "source_sentence": "既得之已相將發引至曠野中。",
        "translation": "After they had obtained it, they were about to take it to the wilderness.",
        "source": "T04n0209_001:0545a13_1"
    },
    {
        "source_sentence": "有一天祠當須人祀然後得過，於是眾賈共思量言：「我等伴黨盡是親親如何可殺？",
        "translation": "The goddess said, “Our companions and relatives are all enemies. How can we kill them?",
        "source": "T04n0209_001:0545a14_2"
    },
    {
        "source_sentence": "唯此導師中用祀天。」",
        "translation": "This is the only one among the guides who use it to worship the gods.",
        "source": "T04n0209_001:0545a16_3"
    },
    {
        "source_sentence": "即殺導師以用祭祀。",
        "translation": "That's when he killed the guide to use it for an offering.",
        "source": "T04n0209_001:0545a17_4"
    },
    {
        "source_sentence": "祀天已竟，迷失道路不知所趣，窮困死盡。",
        "translation": "When the gods had completed their rituals, they lost their way and did not know where to go. They were driven into a great distress and died.",
        "source": "T04n0209_001:0545a17_5"
    },
    {
        "source_sentence": "一切世人亦復如是，欲入法海取其珍寶，當修善法行以為導師。",
        "translation": "All people in the world are likewise, wanting to enter the ocean of the Dharma to obtain its treasures, they must cultivate good practices as their guide.",
        "source": "T04n0209_001:0545a18_6"
    },
    {
        "source_sentence": "毀破善行，生死曠路永無出期，經歷三塗受苦長遠，如彼商賈，將入大海，",
        "translation": "Like the merchants and traders who are about to enter the great sea, they will go through the three destinies of suffering for a long time.",
        "source": "T04n0209_001:0545a20_7"
    },
    {
        "source_sentence": "殺其導者，迷失津濟，終致困死。",
        "translation": "Those who killed their guides lost their way to the river and ended up in a distressed death.",
        "source": "T04n0209_001:0545a22_0"
    },
    {
        "source_sentence": "（一五）醫與王女藥令卒長大喻",
        "translation": "(15) The metaphor of the doctor and the king's daughter giving medicine to make them grow up",
        "source": "T04n0209_001:0545a23_0"
    },
    {
        "source_sentence": "昔有國王產生一女，喚醫語言：「為我與藥立使長大。」",
        "translation": "Once, there was a king who gave birth to a woman and summoned a doctor, saying, Establish an envoy for me to grow up with medicine.",
        "source": "T04n0209_001:0545a24_0"
    },
    {
        "source_sentence": "醫師答言：「我與良藥能使即大，但今卒無，方須求索。",
        "translation": "The physician replied, I'll give you good medicine to make it great, but now that it's gone, you must ask for it.",
        "source": "T04n0209_001:0545a25_1"
    },
    {
        "source_sentence": "比得藥頃，王要莫看，待與藥已然後示王。」",
        "translation": "When he had obtained the medicine, the king didn't want to see it; he waited until he gave it to him and then showed it to the king.",
        "source": "T04n0209_001:0545a26_2"
    },
    {
        "source_sentence": "於是即便遠方取藥經十二年，得藥來還與女令服，將示於王，王見歡喜即自念言：「實是良醫，",
        "translation": "Twelve years had passed since he had taken the medicine from a distant place. Having obtained the medicine, he came back and gave it to the queen for her use. The queen was about to show it to the king. Being delighted, the king",
        "source": "T04n0209_001:0545a27_3"
    },
    {
        "source_sentence": "與我女藥能令卒長。」",
        "translation": "Give me my woman's medicine to make her grow old.",
        "source": "T04n0209_001:0545a29_4"
    },
    {
        "source_sentence": "便勅左右賜以珍寶。",
        "translation": "He then ordered his men to bestow treasures on him.",
        "source": "T04n0209_001:0545b01_5"
    },
    {
        "source_sentence": "時諸人等笑王無智，不曉籌量生來年月，見其長大，謂是藥力。",
        "translation": "The people then laughed at the king's lack of wisdom and didn't know the years he was born, but they saw him grow up, saying it was because of the power of the medicine.",
        "source": "T04n0209_001:0545b01_6"
    },
    {
        "source_sentence": "世人亦爾，詣善知識而啟之言：「我欲求道願見教授，使我立得。」",
        "translation": "The people of the world are likewise, and they go to a good teacher and tell him, I want to pursue the path and wish to see the teaching so that I can establish it.",
        "source": "T04n0209_001:0545b03_7"
    },
    {
        "source_sentence": "善知識師以方便故，教令坐禪觀十二緣起，漸積眾德獲阿羅漢，倍踊躍歡喜而作是言：「快哉大師！",
        "translation": "Because of skillful means, the teacher of good friends taught him to sit in meditation and contemplate the twelve dependent arisings, gradually accumulated virtues, became an arhat, rejoiced, and said, Excellent, great master!",
        "source": "T04n0209_001:0545b04_8"
    },
    {
        "source_sentence": "速能令我證最妙法。」",
        "translation": "They'll quickly cause me to realize the most marvelous teaching.",
        "source": "T04n0209_001:0545b07_9"
    },
    {
        "source_sentence": "（一六）灌甘蔗喻",
        "translation": "(16) The Metaphor of Consecrating the sugarcane",
        "source": "T04n0209_001:0545b08_0"
    },
    {
        "source_sentence": "昔有二人共種甘蔗，而作誓言：「種好者賞，其不好者當重罰之。」",
        "translation": "In the past, there were two people planting sugarcane together and making a vow, saying, Those who plant good will be rewarded, and those who don't will be severely punished.",
        "source": "T04n0209_001:0545b09_0"
    },
    {
        "source_sentence": "時二人中，一者念言：「甘蔗極甜，若壓取汁還灌甘蔗樹，甘美必甚，",
        "translation": "One of the two men then thought, saying, “Sugarcane is extremely sweet. If you crush and return the juice to the sugarcane tree it will surely be very sweet and delicious.",
        "source": "T04n0209_001:0545b10_1"
    },
    {
        "source_sentence": "得勝於彼。」",
        "translation": "They'll be superior to them.",
        "source": "T04n0209_001:0545b12_2"
    },
    {
        "source_sentence": "即壓甘蔗取汁用溉，冀望滋味返敗種子，所有甘蔗一切都失。",
        "translation": "He crushed sugarcane and took the juice to irrigate it, hoping to taste it but then lost all the sugarcane seeds he had.",
        "source": "T04n0209_001:0545b12_3"
    },
    {
        "source_sentence": "世人亦爾，欲求善福，恃己豪貴專形俠勢，迫脅下民陵奪財物，用作福本期善果，",
        "translation": "So it is with the people of the world who want to seek good fortune, relying on their own nobility and special forms of heroic strength. They are oppressed by the villagers and plunder property in order to use it as a source of",
        "source": "T04n0209_001:0545b13_4"
    },
    {
        "source_sentence": "不知將來反獲其患殃，如壓甘蔗彼此都失。",
        "translation": "They don't know that they'll be reborn into trouble in the future, like crushing sugarcane and losing it to each other.",
        "source": "T04n0209_001:0545b15_5"
    },
    {
        "source_sentence": "（一七）債半錢喻",
        "translation": "(17) The parable of the half-calling debt",
        "source": "T04n0209_001:0545b17_0"
    },
    {
        "source_sentence": "往有商人貸他半錢久不得償，即便往債。",
        "translation": "A merchant lent half a coin to someone else who hadn't paid it back for a long time, so he went into debt.",
        "source": "T04n0209_001:0545b18_0"
    },
    {
        "source_sentence": "前有大河，雇他兩錢然後得渡，到彼往債竟不得見，來還渡河復雇兩錢。",
        "translation": "There's a large river in front of him that hired two coins and then allowed him to cross it, but when he arrived there, he couldn't see his past debt; he came back and crossed the river for another two coins.",
        "source": "T04n0209_001:0545b19_0"
    },
    {
        "source_sentence": "為半錢債而失四錢，兼有道路疲勞乏困，所債甚少所失極多，果被眾人之所怪笑。",
        "translation": "He lost four coins because of a half-calling debt, and there was also a road that was exhausted and in distress. The debt he owed was small but the losses were so great that they were laughed at by the crowd.",
        "source": "T04n0209_001:0545b20_1"
    },
    {
        "source_sentence": "世人亦爾，要少名利致毀大行，苟容己身不顧禮義，現受惡名後得苦報。",
        "translation": "So it is with the people of the world who want a little fame and profit to cause disparagement of great actions, but if they allow themselves to be self-indulgent and don't pay attention to propriety and righteousness, they'll now experience",
        "source": "T04n0209_001:0545b22_2"
    },
    {
        "source_sentence": "（一八）就樓磨刀喻",
        "translation": "108. The Parable of the Knife on the Mount Lumbinī",
        "source": "T04n0209_001:0545b25_0"
    },
    {
        "source_sentence": "昔有一人，貧窮困苦為王作事，日月經久身體羸瘦。",
        "translation": "Formerly there was a man in poverty and suffering from hunger who worked for the king. For many days and nights his body became thin and emaciated.",
        "source": "T04n0209_001:0545b26_0"
    },
    {
        "source_sentence": "王見憐愍，賜一死駝。",
        "translation": "Seeing his compassion, the king gave him a dead camels.",
        "source": "T04n0209_001:0545b27_1"
    },
    {
        "source_sentence": "貧人得已即便剝皮，嫌刀鈍故求石欲磨，乃於樓上得一磨石，磨刀令利來下而剝。",
        "translation": "When the poor man had obtained it, he skinned his skin and disliked the sword because it was so dull. So he asked the stone stones to be polished in order to make a moulding piece of stone at the top of the",
        "source": "T04n0209_001:0545b27_2"
    },
    {
        "source_sentence": "如是數數往來磨刀，後轉勞苦憚不能數上，懸駝上樓就石磨刀，深為眾人之所嗤笑。",
        "translation": "In this way he came back and forth repeatedly to polish his sword. Later, overcome with distress and unbearable discomfort, he climbed up onto the carriage and went upstairs to a stone storey",
        "source": "T04n0209_001:0545b29_3"
    },
    {
        "source_sentence": "猶如愚人毀破禁戒，多取錢財以用修福望得生天，如懸駝上樓磨刀，用功甚多所得甚少。",
        "translation": "It's like a foolish man who disparages the precepts and takes much money and possessions to cultivate goodness in order to hope to be born in heaven, or like a climbing camel on top of a building that grinds a sword with a",
        "source": "T04n0209_001:0545c02_4"
    },
    {
        "source_sentence": "（一九）乘船失釪喻",
        "translation": "(19) The Parable of the Shipwrecked Sailor",
        "source": "T04n0209_001:0545c06_0"
    },
    {
        "source_sentence": "昔有人乘船渡海，失一銀釪墮於水中，即便思念：「我今畫水作記，捨之而去後當取之。」",
        "translation": "Once, a man crossed the sea in a boat and lost a silver bowl that fell into the water, and he thought, Now, I'll draw water for assurance, abandon it, and take it after I leave.",
        "source": "T04n0209_001:0545c07_0"
    },
    {
        "source_sentence": "行經二月到師子諸國，見一河水，便入其中覓本失釪。",
        "translation": "In the second month after his journey, he arrived in Siṃhala and saw a river of water. So he went into it to search for the source of the missing fish.",
        "source": "T04n0209_001:0545c09_1"
    },
    {
        "source_sentence": "諸人問言：「欲何所作？」",
        "translation": "The people asked, What do you want to do?",
        "source": "T04n0209_001:0545c10_2"
    },
    {
        "source_sentence": "答言：「我先失釪今欲覓取。」",
        "translation": "He replied, I lost my arrowhead in the past and now I want to find it.",
        "source": "T04n0209_001:0545c11_3"
    },
    {
        "source_sentence": "問言：「於何處失？」",
        "translation": "He asked, Where's the error?",
        "source": "T04n0209_001:0545c11_4"
    },
    {
        "source_sentence": "答言：「初入海失。」",
        "translation": "He replied, The first time I entered the sea, I lost it.",
        "source": "T04n0209_001:0545c12_5"
    },
    {
        "source_sentence": "又復問言：「失經幾時？」",
        "translation": "Again, he asked, How long did you lose the sūtra?",
        "source": "T04n0209_001:0545c12_6"
    },
    {
        "source_sentence": "言：「失來二月。」",
        "translation": "He said, It's lost for two months.",
        "source": "T04n0209_001:0545c13_7"
    },
    {
        "source_sentence": "問言：「失來二月，云何此覓？」",
        "translation": "He asked, It's been two months since you lost it, so why are you looking for it here?",
        "source": "T04n0209_001:0545c13_8"
    },
    {
        "source_sentence": "答言：「我失釪時畫水作記，本所畫水與此無異，是故覓之。」",
        "translation": "He replied, When I lost my bowl, I drew water to make a note of it, and the water I originally drew is no different from this one; therefore, I'll look for it.",
        "source": "T04n0209_001:0545c14_0"
    },
    {
        "source_sentence": "又復問言：「水雖不別，汝昔失時乃在於彼，今在此覓何由可得？」",
        "translation": "Again, he asked, Although the water isn't distinct, how could you have been there when you lost it?",
        "source": "T04n0209_001:0545c15_1"
    },
    {
        "source_sentence": "爾時眾人無不大笑。",
        "translation": "At that point, the crowd didn't laugh at him.",
        "source": "T04n0209_001:0545c16_2"
    },
    {
        "source_sentence": "亦如外道不修正行，相似善中橫計苦困，以求解脫，猶如愚人失釪於彼而於此覓。",
        "translation": "It's also like a non-Buddhist who doesn't correctly practice, resembles a good person who deliberately discriminates between suffering and distress in order to seek liberation, just like a foolish man who loses his anger and looks",
        "source": "T04n0209_001:0545c17_3"
    },
    {
        "source_sentence": "（二〇）人說王縱暴喻",
        "translation": "20. The Parable of the King Who Explains the King's Treacherousness",
        "source": "T04n0209_001:0545c20_0"
    },
    {
        "source_sentence": "昔有一人說王過罪，而作是言：「王甚暴虐治政無理。」",
        "translation": "In the past, there was a man who accused the king of committing crimes and said, The king is so violent and unjust that it's irrational.",
        "source": "T04n0209_001:0545c21_0"
    },
    {
        "source_sentence": "王聞是語即大瞋恚，竟不究悉誰作此語，信傍佞人捉一賢臣，仰使剝脊取百兩肉。",
        "translation": "When the king heard these words, he became greatly angry and didn't know exactly who said them, so he believed that an eunuch caught a good minister and asked him to remove one hundred taels of flesh from his back.",
        "source": "T04n0209_001:0545c22_1"
    },
    {
        "source_sentence": "有人證明此無是語，王心便悔，索千兩肉用為補脊，夜中呻喚甚大苦惱。",
        "translation": "Someone testified that these words were not true, and the king repented. He begged for a thousand taels of flesh to make up his back; in the middle of the night he cried out in great pain and distress.",
        "source": "T04n0209_001:0545c24_2"
    },
    {
        "source_sentence": "王聞其聲，問言：「何以苦惱？",
        "translation": "When the king heard his voice, he asked, Why is it so painful?",
        "source": "T04n0209_001:0545c26_3"
    },
    {
        "source_sentence": "取汝百兩，十倍與汝，意不足耶？",
        "translation": "Wouldn't it be enough to take a hundred taels of your food and give it to you ten times?",
        "source": "T04n0209_001:0545c26_4"
    },
    {
        "source_sentence": "何故苦惱？」",
        "translation": "Why is it painful?",
        "source": "T04n0209_001:0545c27_5"
    },
    {
        "source_sentence": "傍人答言：「大王！",
        "translation": "The attendants replied, Great king!",
        "source": "T04n0209_001:0545c27_6"
    },
    {
        "source_sentence": "如截子頭，雖得千頭不免子死，雖十倍得肉，不免苦痛。」",
        "translation": "It's like cutting off a child's head, even though it gets a thousand heads that won't escape the child's death, and even though it gets ten times as much flesh, it doesn't escape pain and suffering.",
        "source": "T04n0209_001:0545c28_7"
    },
    {
        "source_sentence": "愚人亦爾，不畏後世貪渴現樂，苦切眾生，調發百姓多得財物，望得滅罪而得福報。",
        "translation": "Foolish people are likewise, who aren't afraid of the cravings and pleasures of later generations that will manifest themselves in painful sentient beings, regulate the multitude of property obtained by their people, and hope to attain the",
        "source": "T04n0209_001:0545c29_8"
    },
    {
        "source_sentence": "譬如彼王割人之脊取人之肉，以餘肉補望使不痛，無有是處。",
        "translation": "It's like that king who cuts off a person's back and takes the flesh of another person but hopes to make it not painful with the remaining flesh, which is unreasonable.",
        "source": "T04n0209_001:0546a02_9"
    },
    {
        "source_sentence": "（二一）婦女欲更求子喻",
        "translation": "(21) The Parable of the Woman Who Wishes to Search for her Children Again",
        "source": "T04n0209_001:0546a05_0"
    },
    {
        "source_sentence": "往昔世時有婦女人，始有一子更欲求子，問餘婦女：「誰有能使我重有子？」",
        "translation": "In a past life, there were women who had a child and wanted to have another child. They asked the other women, Who will allow me to have a child again?",
        "source": "T04n0209_001:0546a06_0"
    },
    {
        "source_sentence": "有一老母語此婦言：「我能使爾求子可得，當須祀天。」",
        "translation": "An elderly mother said to the woman, I can get you to ask for a child that you can obtain, so you must sacrifice him to heaven.",
        "source": "T04n0209_001:0546a07_1"
    },
    {
        "source_sentence": "問老母言：「祀須何物？」",
        "translation": "He asked the old mother, What's needed for the ritual?",
        "source": "T04n0209_001:0546a09_2"
    },
    {
        "source_sentence": "老母語言：「殺汝之子取血祀天，必得多子。」",
        "translation": "The old mother said, If you kill your child and take his blood to sacrifice it in heaven, there must be many more children.",
        "source": "T04n0209_001:0546a09_3"
    },
    {
        "source_sentence": "時此婦女便隨彼語欲殺其子。",
        "translation": "The woman then followed their words and wanted to kill her child.",
        "source": "T04n0209_001:0546a10_4"
    },
    {
        "source_sentence": "傍有智人嗤笑罵詈：「愚癡無智乃至如此。",
        "translation": "Beside him was a wise man who laughed and scoffed, saying, Foolish and ignorant, up to this point.",
        "source": "T04n0209_001:0546a11_5"
    },
    {
        "source_sentence": "未生子者竟可得不？",
        "translation": "Is it possible to obtain a child who has yet to be born?",
        "source": "T04n0209_001:0546a12_6"
    },
    {
        "source_sentence": "而殺現子。」",
        "translation": "He kills his present child.",
        "source": "T04n0209_001:0546a12_7"
    },
    {
        "source_sentence": "愚人亦爾，為未生樂自投火坑，種種害身為得生天。",
        "translation": "Foolish people are likewise, throwing themselves into a burning pit for the sake of happiness that has yet to arise and being reborn in heaven with various kinds of harmful bodies.",
        "source": "T04n0209_001:0546a13_8"
    },
    {
        "source_sentence": "◎百喻經卷第一",
        "translation": "The One Hundred Parables Sutra, Volume 1",
        "source": "T04n0209_001:0546a15_0"
    },
    {
        "source_sentence": "聞如是：一時佛在王舍城，在鵲封竹園，與諸大比丘菩薩摩訶薩及諸八部三萬六千人俱。",
        "translation": "Thus I have heard: One time the Buddha was staying at Rājagaha, in the magnolia bamboo grove, accompanied by thirty-six thousand bhikṣus, bodhisattvas, mahāsattvas, and",
        "source": "T04n0209_001:0546a16_0"
    },
    {
        "source_sentence": "是時會中有異學梵志五百人俱，從座而起白佛言：「吾聞佛道洪深，無能及者，",
        "translation": "At that time, there were five hundred heretical brahmins in the assembly. They rose from their seats and said to the Buddha: I have heard that the Buddha’s path is so profound as to be unfathomable.",
        "source": "T04n0209_001:0546a18_1"
    },
    {
        "source_sentence": "故來歸問，唯願說之。」",
        "translation": "That's why I came back to ask questions, but I'd like to explain them.",
        "source": "T04n0209_001:0546a20_2"
    },
    {
        "source_sentence": "佛言：「甚善。」",
        "translation": "The Buddha said, Very good.",
        "source": "T04n0209_001:0546a20_3"
    },
    {
        "source_sentence": "問曰：「天下為有為無？」",
        "translation": "He asked, Is the world conditioned and nonexistent?",
        "source": "T04n0209_001:0546a20_4"
    },
    {
        "source_sentence": "答曰：「亦有亦無。」",
        "translation": "He answered, It's both existent and nonexistent.",
        "source": "T04n0209_001:0546a21_5"
    },
    {
        "source_sentence": "梵志曰：「如今有者，云何言無？",
        "translation": "The priest said, Now that it exists, how can we say it doesn't?",
        "source": "T04n0209_001:0546a21_6"
    },
    {
        "source_sentence": "如今無者，云何言有？」",
        "translation": "If it doesn't exist now, how can we say it exists?",
        "source": "T04n0209_001:0546a22_7"
    },
    {
        "source_sentence": "答曰：「生者言有，死者言無，故說或有或無。」",
        "translation": "He answered, Birth is called existence, and death is called nonexistence; therefore, it's said to be either existent or nonexistent.",
        "source": "T04n0209_001:0546a23_0"
    },
    {
        "source_sentence": "問曰：「人從何生？」",
        "translation": "He asked, Where did people come from?",
        "source": "T04n0209_001:0546a24_0"
    },
    {
        "source_sentence": "答曰：「人從穀而生。」",
        "translation": "He answered, A person is born from grain.",
        "source": "T04n0209_001:0546a24_1"
    },
    {
        "source_sentence": "問曰：「五穀從何而生？」",
        "translation": "He asked, Where did the five grains come from?",
        "source": "T04n0209_001:0546a24_2"
    },
    {
        "source_sentence": "答曰：「五穀從四大火風而生。」",
        "translation": "He answered, The five grains arise from the four elements of fire and wind.",
        "source": "T04n0209_001:0546a25_3"
    },
    {
        "source_sentence": "問曰：「四大火風從何而生？」",
        "translation": "He asked, Where did the four great fires and winds arise?",
        "source": "T04n0209_001:0546a26_4"
    },
    {
        "source_sentence": "答曰：「四大火風從空而生。」",
        "translation": "He answered, The four great fires and winds arise from space.",
        "source": "T04n0209_001:0546a26_5"
    },
    {
        "source_sentence": "問曰：「空從何生？」",
        "translation": "He asked, Where did emptiness come from?",
        "source": "T04n0209_001:0546a27_6"
    },
    {
        "source_sentence": "答曰：「從無所有生。」",
        "translation": "He answered, It's produced from nothingness.",
        "source": "T04n0209_001:0546a27_7"
    },
    {
        "source_sentence": "問曰：「無所有從何而生？」",
        "translation": "He asked, Where did nothing come from?",
        "source": "T04n0209_001:0546a28_8"
    },
    {
        "source_sentence": "答曰：「從自然生。」",
        "translation": "He answered, It's produced naturally.",
        "source": "T04n0209_001:0546a28_9"
    },
    {
        "source_sentence": "問曰：「自然從何而生？」",
        "translation": "He asked, Where did it naturally come from?",
        "source": "T04n0209_001:0546a29_10"
    },
    {
        "source_sentence": "答曰：「從泥洹而生。」",
        "translation": "He answered, They arise from nirvāṇa.",
        "source": "T04n0209_001:0546a29_11"
    },
    {
        "source_sentence": "問曰：「泥洹從何而生？」",
        "translation": "He asked, Where did nirvāṇa arise?",
        "source": "T04n0209_001:0546b01_12"
    },
    {
        "source_sentence": "佛言：「汝今問事何以爾深？",
        "translation": "The Buddha said, Why are you asking so deep questions now?",
        "source": "T04n0209_001:0546b01_13"
    },
    {
        "source_sentence": "泥洹者是不生不死法。」",
        "translation": "Nirvāṇa is the Dharma of neither arising nor dying.",
        "source": "T04n0209_001:0546b02_14"
    },
    {
        "source_sentence": "問曰：「佛泥洹未？」",
        "translation": "He asked, Has the Buddha entered nirvāṇa yet?",
        "source": "T04n0209_001:0546b03_0"
    },
    {
        "source_sentence": "答曰：「我未泥洹。」",
        "translation": "He replied, I haven't yet entered nirvāṇa.",
        "source": "T04n0209_001:0546b03_1"
    },
    {
        "source_sentence": "「若未泥洹，云何得知泥洹常樂？」",
        "translation": "If you haven't yet entered nirvāṇa, how can you know that nirvāṇa is always pleasant?",
        "source": "T04n0209_001:0546b03_2"
    },
    {
        "source_sentence": "佛言：「我今問汝，天下眾生為苦為樂？」",
        "translation": "The Buddha said, Now, I'll ask you, What's painful and what's pleasant for sentient beings in the world?",
        "source": "T04n0209_001:0546b04_3"
    },
    {
        "source_sentence": "答曰：「眾生甚苦。」",
        "translation": "He answered, Sentient beings are so painful.",
        "source": "T04n0209_001:0546b05_4"
    },
    {
        "source_sentence": "佛言：「云何名苦？」",
        "translation": "The Buddha said, What's called suffering?",
        "source": "T04n0209_001:0546b05_5"
    },
    {
        "source_sentence": "答曰：「我見眾生死時苦痛難忍，故知死苦。」",
        "translation": "He answered, I've seen that the suffering and pain of sentient beings at the time of death are difficult to bear, so I know the suffering of death.",
        "source": "T04n0209_001:0546b06_6"
    },
    {
        "source_sentence": "佛言：「汝今不死亦知死苦，我見十方諸佛不生不死故知泥洹常樂。」",
        "translation": "The Buddha said, Now, you won't die and also know the suffering of death; I see that the buddhas of the ten directions don't arise or die, so I know that nirvāṇa is always pleasant.",
        "source": "T04n0209_001:0546b07_7"
    },
    {
        "source_sentence": "五百梵志心開意解，求受五戒，悟須陀洹果，復坐如故。",
        "translation": "Five hundred brahmins awakened their minds and resolved to receive the five precepts, realized the fruit of stream entry, and resumed their seats as before.",
        "source": "T04n0209_001:0546b08_8"
    },
    {
        "source_sentence": "佛言：「汝等善聽！",
        "translation": "The Buddha said, Listen well!",
        "source": "T04n0209_001:0546b10_9"
    },
    {
        "source_sentence": "今為汝廣說眾喻。」",
        "translation": "Now, I'll explain the many metaphors in detail for you.",
        "source": "T04n0209_001:0546b10_10"
    }
]