[
    {
        "source_sentence": "大般若經初會序",
        "translation": "Preface to the First Assembly of the Mahāprajñāpāramitā-sūtra",
        "source": "T05n0220_001:0001a03_0"
    },
    {
        "source_sentence": "西明寺沙門玄則製",
        "translation": "It was produced by the ascetic Xuanze of Ximing Temple.",
        "source": "T05n0220_001:0001a05_0"
    },
    {
        "source_sentence": "大般若經者，乃希代之絕唱、曠劫之遐津，光被人天、括囊真俗，誠入神之奧府、有國之靈鎮，",
        "translation": "The Mahāprajñāpāramitā-sūtra is the rarest and most exalted of all scriptures, as well as the farthest reaches of a vast eon. It illuminates both heavenly and mundane beings, encompassing both true and secular worlds. It truly enters into the mysterious realm of the gods and the spiritual states of the",
        "source": "T05n0220_001:0001a06_0"
    },
    {
        "source_sentence": "自非聖德遠覃、哲人孤出，則方音罕貿、圓教豈臻？",
        "translation": "If it weren't for the noble virtues that are distantly cultivated and the philosophers who emerge alone, then how could only sounds rarely traded and perfect teachings be accomplished?",
        "source": "T05n0220_001:0001a08_1"
    },
    {
        "source_sentence": "所以帝敘金照、皇述瓊振，事邈千古、理鏡三辰，欝矣斯文、備乎茲日，",
        "translation": "Thus, the emperor composed a narrative of the golden illumination and the imperial narrative of the Qiongzheng, which deal with the affairs of the ancient dynasty and the principles of the three eons. It is true that these stories were compiled in detail on this day.",
        "source": "T05n0220_001:0001a09_2"
    },
    {
        "source_sentence": "然則部分二四、昔徒掌其半珠，會兼十六、今乃握其全寶。",
        "translation": "However, it's divided into two or four parts. In the past, he simply held half a pearl in his hand and gathered together sixteen; now he holds all of his treasures.",
        "source": "T05n0220_001:0001a10_3"
    },
    {
        "source_sentence": "竊案諸會別起，每比一部，輒復本以殊迹，各申一序。",
        "translation": "Each of the assemblies were held separately, and each one offered a preface to the other in accordance with the different traces.",
        "source": "T05n0220_001:0001a12_4"
    },
    {
        "source_sentence": "至如靈峯始集，宏韻首馳；",
        "translation": "As soon as they had assembled at Lingfeng Monastery, the great bands of singers and musicians rushed to their feet.",
        "source": "T05n0220_001:0001a13_5"
    },
    {
        "source_sentence": "控蕩身源，敷弘心要。",
        "translation": "He controls the source of the body and spreads out the essentials of the vast mind.",
        "source": "T05n0220_001:0001a13_6"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T05n0220_001:0001a14_7"
    },
    {
        "source_sentence": "夫五蘊為有情之封，二我為有封之宅。",
        "translation": "The five āyatanas are the realms of sentient beings, and the two selves are the realms of sentient beings.",
        "source": "T05n0220_001:0001a14_8"
    },
    {
        "source_sentence": "宅我而舉，則渴焰之水方深；",
        "translation": "When one raises the self that houses it, the water of the flame of thirst becomes deeper.",
        "source": "T05n0220_001:0001a15_9"
    },
    {
        "source_sentence": "封蘊以居，則尋香之堞彌峻。",
        "translation": "When the moon resides in a lunar station, the fragrance is so great that it rises high up into the sky.",
        "source": "T05n0220_001:0001a16_10"
    },
    {
        "source_sentence": "焉識夫我之所根者想，想妄而我不存；",
        "translation": "How can we know that the self which is the root of consciousness is conceptual thought? Thought is false, yet I do not exist.",
        "source": "T05n0220_001:0001a16_11"
    },
    {
        "source_sentence": "蘊之所繫者名，名假而蘊無託。",
        "translation": "Those who are bound by the aggregates are called names, and they are called provisional while the aggregates have no entrustment.",
        "source": "T05n0220_001:0001a17_12"
    },
    {
        "source_sentence": "故即空之談啟、亡言之理暢，閱紛俗於非動、置蠢徒於不生，齊谷響於百名、儔鏡姿於萬像，",
        "translation": "Therefore, it's the principle of discussing emptiness and extinguishing words that are fluent in principle. It's the principle of discussing disputes with secular people who aren't moving and putting foolish people into non-production. The sound of the same valley echoes a hundred names and the reflective images appear in myriad forms.",
        "source": "T05n0220_001:0001a18_13"
    },
    {
        "source_sentence": "筌宰失寄而後真宰獨融、規准莫施而後沖規妙立，慮塗千泯、言術四窮，",
        "translation": "The first is the principle of selflessness, while the second is the principle of truth; the third is the principle of unity, while the fourth is the principle of conformity.",
        "source": "T05n0220_001:0001a20_14"
    },
    {
        "source_sentence": "使夫淺躁投機、拘攣解桎，媲司南之有在、同拱北以知歸。",
        "translation": "It's because he's a shallow man who rushes to the opportunity, frees himself from the fetters by being restless, and competes with the people of Sindh in order to know that he's returning.",
        "source": "T05n0220_001:0001a22_0"
    },
    {
        "source_sentence": "義既天悠、辭仍海溢，且為諸分之本，又是前古未傳，凡勒成四百卷、八十五品矣。",
        "translation": "Since the meaning is so vast and the words are still overflowing, it's the source of all the parts, which hadn't been transmitted since ancient times, and凡勒 composed four hundred fascicles and eighty-five chapters.",
        "source": "T05n0220_001:0001a23_1"
    },
    {
        "source_sentence": "或謂權之方土理宜裁譯，竊應之曰：一言可蔽而雅頌之作聯章，二字可題而涅槃之音積軸，",
        "translation": "Or they may claim that the right is to be interpreted according to the principle of expediency, but I humbly respond by saying that a single word can obscure elegant verses and two words can be titled nirvana sounds like heap shafts.",
        "source": "T05n0220_001:0001a25_2"
    },
    {
        "source_sentence": "優柔闡緩，其慈誨乎！",
        "translation": "You're so gentle and lax, what kind of admonition!",
        "source": "T05n0220_001:0001a27_3"
    },
    {
        "source_sentence": "若譯而可削，恐貽患於傷手；",
        "translation": "If the transla­ tion were to be reduced, I am afraid that it would cause injury to my hands.",
        "source": "T05n0220_001:0001a27_4"
    },
    {
        "source_sentence": "今傳而必本，庶無譏於溢言。",
        "translation": "The present biography will always be the source, so I hope there is no criticism of its overweening words.",
        "source": "T05n0220_001:0001a28_5"
    },
    {
        "source_sentence": "況搦扎之辰，慨念增損，而魂交之夕，烱戒昭彰。",
        "translation": "Moreover, on the day of the compilation of the scriptures he lamented the increase in his distress but on the evening when his spirits were crossing over to his mother’s feet the morality of discipline became clearer.",
        "source": "T05n0220_001:0001a29_6"
    },
    {
        "source_sentence": "終始感貽，具如別錄。",
        "translation": "The beginning and end of the story are as shown in a separate record.",
        "source": "T05n0220_001:0001b01_7"
    },
    {
        "source_sentence": "其有大心茂器、久聞歷奉者，自致不驚不怖，爰諮爰度矣。",
        "translation": "Those who have great aspirations and are well-versed and long-standing devotees will not be frightened or terrified in their own minds, and they will be liberated through my advice.",
        "source": "T05n0220_001:0001b01_8"
    },
    {
        "source_sentence": "初分緣起品第一之一",
        "translation": "The First Part of the Chapter on Conditioned Arising in the First Part",
        "source": "T05n0220_001:0001b05_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T05n0220_001:0001b07_0"
    },
    {
        "source_sentence": "如是我聞：一時，薄伽梵住王舍城鷲峯山頂，與大苾芻眾千二百五十人俱，",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at the summit of Vulture Peak in the city of Rājagṛha, accompanied by one thousand two hundred and fifty bhikṣus.",
        "source": "T05n0220_001:0001b08_0"
    },
    {
        "source_sentence": "皆阿羅漢，諸漏已盡無復煩惱，得真自在心善解脫、慧善解脫，如調慧馬亦如大龍，",
        "translation": "They are all arhats whose contaminants have ended and no more afflictions, who attain truly unimpeded minds that are well liberated and well liberated by wisdom, just as the taming horse of wisdom is like a great dragon.",
        "source": "T05n0220_001:0001b09_1"
    },
    {
        "source_sentence": "已作所作已辦所辦，棄諸重擔逮得己利，盡諸有結正知解脫，至心自在第一究竟。",
        "translation": "What's done, what's done, what's done, what's done, abandoning heavy burdens and attaining self-benefit, ending the bonds of existence with right knowledge and liberation, and realizing the supreme ultimate mastery of mind.",
        "source": "T05n0220_001:0001b11_2"
    },
    {
        "source_sentence": "除阿難陀獨居學地得預流果，大迦葉波而為上首。",
        "translation": "Except for Ānanda, who lived alone in the training ground and attained the fruit of stream-winner, Mahākāśyapa was the leader.",
        "source": "T05n0220_001:0001b13_3"
    },
    {
        "source_sentence": "復有五百苾芻尼眾，皆阿羅漢，大勝生主而為上首。",
        "translation": "Again, there were five hundred bhikṣuṇīs, all arhats, the great lord of superior birth and the supreme leader.",
        "source": "T05n0220_001:0001b14_4"
    },
    {
        "source_sentence": "復有無量鄔波索迦、鄔波斯迦，皆見聖諦。",
        "translation": "Again, there are measureless upāsaka and upāsikā who all see the noble truths.",
        "source": "T05n0220_001:0001b15_5"
    },
    {
        "source_sentence": "復有無量無數菩薩摩訶薩眾，一切皆得陀羅尼門、三摩地門，住空、無相、無分別願，",
        "translation": "“Furthermore, there were innumerable great enlightening beings and bodhisattvas, all of whom had attained the teaching of dhāraṇī and the teaching of concentration, dwelling in emptiness, signlessness, and nondiscriminating vows.",
        "source": "T05n0220_001:0001b16_6"
    },
    {
        "source_sentence": "已得諸法平等性忍，具足成就四無礙解，凡所演說辯才無盡，於五神通自在遊戲，",
        "translation": "Having attained tolerance of the equality of all things, they are fully endowed with the four unhindered understandings. Their explanations have inexhaustible powers of elucidation. They play freely and at will over the five spiritual powers.",
        "source": "T05n0220_001:0001b18_7"
    },
    {
        "source_sentence": "所證智斷永無退失；",
        "translation": "The knowledge they realize is annihilated, never regressing.",
        "source": "T05n0220_001:0001b20_8"
    },
    {
        "source_sentence": "言行威肅聞皆敬受，勇猛精進離諸懈怠，能捨親財不顧身命，離矯離誑無染無求，",
        "translation": "Their words and deeds are dignified, respected by all who hear them; their courageous effort is free of laziness. They can give up their wealth without concern for their own lives. They are free of compulsion, free of hatred, without defilement, and without seeking.",
        "source": "T05n0220_001:0001b21_0"
    },
    {
        "source_sentence": "等為有情而宣正法；",
        "translation": "Equally they proclaim the true teaching for sentient beings.",
        "source": "T05n0220_001:0001b22_1"
    },
    {
        "source_sentence": "契深法忍窮最極趣，得無所畏其心泰然，超眾魔境出諸業障，摧滅一切煩惱怨敵，",
        "translation": "Profound tolerance of the Teaching reaching ultimate end, they attain fearlessness. Their minds are calm and peaceful; transcending the realm of Māra, they leave all barriers of action and annihilate all enemies and afflictions.",
        "source": "T05n0220_001:0001b23_2"
    },
    {
        "source_sentence": "建正法幢伏諸邪論，聲聞、獨覺不能測量；",
        "translation": "They set up the banner of the true teaching to subdue all false doctrines, but śrāvakas and pratyekabuddhas cannot fathom it.",
        "source": "T05n0220_001:0001b25_3"
    },
    {
        "source_sentence": "得心自在、得法自在，業、惑、見障皆已解脫，擇法辯說無不善巧，入深緣起生滅法門，",
        "translation": "Attaining mastery of mind and mastery of doctrine, they have been liberated from the hindrances of action, delusion, and views. They are skilled in discriminating principles and eloquently teaching without fail. They enter deeply into the dharmas of arising and ceasing by means of conditions.",
        "source": "T05n0220_001:0001b26_4"
    },
    {
        "source_sentence": "離見、隨眠、捨諸纏結，智慧通達諸聖諦理；",
        "translation": "Being free of the bonds of views, latent dormancy, and relinquishing the bonds of bondage, their knowledge comprehended the principles of the holy truths.",
        "source": "T05n0220_001:0001b28_5"
    },
    {
        "source_sentence": "曾無數劫發弘誓願，容貌熙怡先言接引，遠離嚬蹙辭韻清和，讚頌善巧辯才無滯，",
        "translation": "For innumerable kalpas he had undertaken the great vow of enlightenment. His appearance was graceful, and his foreheaded words were directed at him. He was far removed from frowning; his speech was pure and harmonious, praised as skillful and eloquent, unimpeded.",
        "source": "T05n0220_001:0001b29_0"
    },
    {
        "source_sentence": "處無邊眾威德肅然，抑揚自在都無所畏，多俱胝劫巧說無盡；",
        "translation": "The boundless hosts of the enlightening beings were peaceful and dignified, free from fear. For many kalpas they skillfully taught endlessly.",
        "source": "T05n0220_001:0001c01_1"
    },
    {
        "source_sentence": "於諸法門勝解觀察，如幻、如陽焰、如夢、如水月、如響、如空花、如像、如光影、如變化事、如尋香城雖皆無實而現似有；",
        "translation": "They observed all aspects of the Teaching with conviction, like illusions, like mirages, like dreams, like water moons, like echoes, like flowers blooming in the sky, like images, like lights and shadows, like magic tricks, like cities of fragrance, appearing to exist even though they are not real.",
        "source": "T05n0220_001:0001c03_2"
    },
    {
        "source_sentence": "離下劣心說法無畏，能隨證入無量法門，善知有情心行所趣，以微妙慧而度脫之；",
        "translation": "“Great enlightening beings are free from lowly thoughts and teach fearlessly, able to enter infinite teachings as they experience them. They know the mental patterns of sentient beings and liberate them by means of subtle knowledge.",
        "source": "T05n0220_001:0001c05_3"
    },
    {
        "source_sentence": "於諸有情心無罣礙，成就最上無生法忍，善入諸法平等性智，甚深法性能如實知，",
        "translation": "Their minds unobstructed toward sentient beings, they develop the supreme tolerance of the nonorigination of all things. They skillfully enter knowledge of the equality of all things, and truly know the profound characteristics of things.",
        "source": "T05n0220_001:0001c07_4"
    },
    {
        "source_sentence": "隨其所應巧令悟入，能善宣說緣起法門；",
        "translation": "They can skillfully cause enlightenment and entry according to what is appropriate, being able to teach the teaching of dependent origination.",
        "source": "T05n0220_001:0001c09_5"
    },
    {
        "source_sentence": "攝受無邊佛國大願，於十方界無數諸佛，等持正念常現在前，諸佛出世皆能歷事，",
        "translation": "They receive the great vows of the boundless buddha-lands, and innumerable buddhas of the ten directions always appear before them, equally maintaining right mindfulness. The Buddhas appearing in the world can all do so.",
        "source": "T05n0220_001:0001c10_6"
    },
    {
        "source_sentence": "亦能勸請轉正法輪，不般涅槃度無量眾；",
        "translation": "They are also able to request the turning of the wheel of the true teaching and liberate immeasurable numbers of beings who have not entered nirvana.",
        "source": "T05n0220_001:0001c12_7"
    },
    {
        "source_sentence": "善能伏滅一切有情種種見纏諸煩惱焰，須臾遊戲百千等持，引發無邊殊勝功德。",
        "translation": "He can skillfully subdue the various views of all sentient beings that are tethered by the flames of afflictions, play a hundred thousand equipoises in a single moment, and produce boundless extraordinary qualities.",
        "source": "T05n0220_001:0001c13_8"
    },
    {
        "source_sentence": "此諸菩薩具如是等妙功德海，設經無量俱胝大劫歎不能盡。",
        "translation": "These bodhisattvas are endowed with such an ocean of marvelous merits, and even if they go on for measureless eons to praise them, they won't be able to do so.",
        "source": "T05n0220_001:0001c15_9"
    },
    {
        "source_sentence": "其名曰：賢守菩薩摩訶薩、寶性菩薩摩訶薩、寶藏菩薩摩訶薩、寶授菩薩摩訶薩、導師菩薩摩訶薩、仁授菩薩摩訶薩、星授菩薩摩訶薩、神授菩薩摩訶薩、帝授菩薩摩訶薩、廣慧菩薩摩訶薩、勝慧菩薩摩訶薩、上慧菩薩摩訶薩、增長慧菩薩摩訶薩、無邊慧菩薩摩訶薩、不虛見菩薩摩訶薩、無障慧菩薩摩訶薩、善發趣菩薩摩訶薩、善勇猛菩薩摩訶薩、極精進菩薩摩訶薩、常精進菩薩摩訶薩、常加行菩薩摩訶薩、不捨軛菩薩摩訶薩、日藏菩薩摩訶薩、月藏菩薩摩訶薩、無比慧菩薩摩訶薩、觀自在菩薩摩訶薩、得大勢菩薩摩訶薩、妙吉祥菩薩摩訶薩、寶印手菩薩摩訶薩、摧魔力菩薩摩訶薩、金剛慧菩薩摩訶薩、金剛藏菩薩摩訶薩、常舉手菩薩摩訶薩、大悲心菩薩摩訶薩、大莊嚴菩薩摩訶薩、莊嚴王菩薩摩訶薩、山峯菩薩摩訶薩、寶峰菩薩摩訶薩、德王菩薩摩訶薩、慈氏菩薩摩訶薩。",
        "translation": "Their names were Bhadravyūha Bodhisattva, Jewel-Nature Bodhisattva Mahāsattva, Jewel Treasury Bodhisattva Mahāsattva, Jewel Treasury Bodhisattva Mahāsattva, Jewel Grant Bodhisattva Mahāsattva, Guide Bodhisattva Mahāsattva,仁授 Bodhisattva Mahāsatt",
        "source": "T05n0220_001:0001c16_10"
    },
    {
        "source_sentence": "如是等無量百千俱胝那庾多菩薩摩訶薩，皆法王子，堪紹佛位而為上首。",
        "translation": "Countless hundreds of thousands of such bodhisattvas and mahāsattvas, all princes of the Dharma, were capable of upholding the Buddha's position and leading it.",
        "source": "T05n0220_001:0002a05_11"
    },
    {
        "source_sentence": "爾時，世尊於師子座上，自敷尼師壇結跏趺坐，端身正願住對面念，入等持王妙三摩地，",
        "translation": "At that time, the World-honored One was seated cross-legged on his lion’s seat at the self-arranged altar in the shape of a nun, with his body straightened and facing each other. He entered the subtle absorption of concentration equal to the power of enlightenment.",
        "source": "T05n0220_001:0002a08_0"
    },
    {
        "source_sentence": "諸三摩地皆攝入此三摩地中，是所流故。",
        "translation": "All the samadhis are included in these samddhis: because they are what flows.",
        "source": "T05n0220_001:0002a10_0"
    },
    {
        "source_sentence": "爾時，世尊正知正念，從等持王安庠而起，以淨天眼觀察十方殑伽沙等諸佛世界，",
        "translation": "At that time the World-honored One, knowing correctly and with right mindfulness, rose from Ābhāsvara’s resting place and, using his pure celestial eye, looked over as many buddha-realms as there are sands in the ten directions.",
        "source": "T05n0220_001:0002a10_1"
    },
    {
        "source_sentence": "舉身怡悅，從兩足下千輻輪相，各放六十百千俱胝那庾多光。",
        "translation": "He raised his body and was delighted, with a thousand-spoked wheel at the base of his feet, each emitting 60,000,000,000 koṭis of rays of light.",
        "source": "T05n0220_001:0002a12_2"
    },
    {
        "source_sentence": "從足十指、兩趺、兩跟、四踝、兩脛、兩腨、兩膝、兩髀、兩股、腰脇、腹背、臍中、心上、胸臆德字、兩乳、兩腋、兩肩、兩髆、兩肘、兩臂、兩腕、兩手、兩掌、十指、項咽、頤頷、頰額、頭頂、兩眉、兩眼、兩耳、兩鼻、口四牙、四十齒、眉間毫相，",
        "translation": "From the ten fingers, two calves, two heels, two heels, four ankles, two shins, two calves, two knees, two thighs, two legs, two waistbands, two backs, two abdomen, two navels, two chests, two breasts, two breasts, two armpits, two shoulders,",
        "source": "T05n0220_001:0002a14_3"
    },
    {
        "source_sentence": "一一身分各放六十百千俱胝那庾多光。",
        "translation": "Each of their bodies emits 60,000 billions of koṭis of light beams.",
        "source": "T05n0220_001:0002a18_4"
    },
    {
        "source_sentence": "此一一光各照三千大千世界，從此展轉遍照十方殑伽沙等諸佛世界，其中有情遇斯光者，",
        "translation": "Each of these rays of light illumined the great manifold cosmos, illuminating as many buddha-fields as there are grains of sand in the ten directions.",
        "source": "T05n0220_001:0002a19_5"
    },
    {
        "source_sentence": "必得無上正等菩提。",
        "translation": "They'll surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0002a21_6"
    },
    {
        "source_sentence": "爾時，世尊一切毛孔皆悉熙怡，各出六十百千俱胝那庾多光，是一一光各照三千大千世界，",
        "translation": "At that time, all the pores of the Buddha’s hair stood shining brightly and each pore shone sixty-thousand myriads of rays of light. Each ray of light illuminated a universe as numerous as a thousand worlds.",
        "source": "T05n0220_001:0002a22_7"
    },
    {
        "source_sentence": "從此展轉遍照十方殑伽沙等諸佛世界，其中有情遇斯光者，必得無上正等菩提。",
        "translation": "From here, he'll gradually illuminate the sands of the buddha worlds in the ten directions, and those sentient beings there who encounter this light will surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0002a24_8"
    },
    {
        "source_sentence": "爾時，世尊演身常光照此三千大千世界，從此展轉遍照十方殑伽沙等諸佛國土，",
        "translation": "At the time, the Bhagavān manifested his body as a constant ray of light to illuminate these 3,000 great one-thousand worlds, and from here he successively illuminated as many buddha-lands as there are sands in the ten directions.",
        "source": "T05n0220_001:0002a26_9"
    },
    {
        "source_sentence": "其中有情遇斯光者，必得無上正等菩提。",
        "translation": "Those sentient beings among them who encounter this light will surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0002a28_10"
    },
    {
        "source_sentence": "爾時，世尊從其面門出廣長舌相，遍覆三千大千世界，熙怡微笑。",
        "translation": "At the time, the Bhagavān emerged from the pore of his face with a broad and long tongue that covered 3,000 great one-thousand worlds and smiled joyfully.",
        "source": "T05n0220_001:0002a29_11"
    },
    {
        "source_sentence": "復從舌相流出無量百千俱胝那庾多光，其光雜色，從此雜色一一光中現寶蓮花，",
        "translation": "“Furthermore, from the characteristics of their tongues flowed countless millions of rays of light. These rays of light were multicolored, and in each ray of light produced jewel lotus blossoms.",
        "source": "T05n0220_001:0002b01_12"
    },
    {
        "source_sentence": "其花千葉皆真金色眾寶莊嚴，綺飾鮮榮甚可愛樂，香氣芬烈周流普熏，",
        "translation": "The thousand leaves of the flower were all pure gold, adorned with myriad jewels. They were beautifully decorated and brilliant, very pleasing; their fragrance was exquisite and permeating everywhere.",
        "source": "T05n0220_001:0002b03_13"
    },
    {
        "source_sentence": "細滑輕軟觸生妙樂，諸花臺中皆有化佛結跏趺坐演妙法音，一一法音皆說般若波羅蜜多相應之法，",
        "translation": "The subtle, smooth, light, and soft touches give rise to marvelous music, and in each of the flower dais there are transformed buddhas sitting cross-legged and expounding the wonderful sounds of the Dharma, each sound of which explains the teaching associated with the prajñāpāramitā.",
        "source": "T05n0220_001:0002b05_14"
    },
    {
        "source_sentence": "有情聞者必得無上正等菩提。",
        "translation": "Sentient beings who hear it will surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0002b07_15"
    },
    {
        "source_sentence": "從此展轉流遍十方殑伽沙等諸佛世界，說法利益亦復如是。",
        "translation": "From here, it flows in turn and pervades as many buddha worlds as there are sands in the ten directions, expounding the benefits of the teaching likewise.",
        "source": "T05n0220_001:0002b08_16"
    },
    {
        "source_sentence": "爾時，世尊不起本座，復入師子遊戲等持，現神通力，令此三千大千世界六種變動，",
        "translation": "At that time the World-honored One did not rise from his seat, but entered into the equanimity of the lion’s play. He manifested supernatural powers to cause this billion-world-galactic universe to quake in six ways:",
        "source": "T05n0220_001:0002b10_0"
    },
    {
        "source_sentence": "謂：動、極動、等極動，踊、極踊、等極踊，震、極震、等極震，擊、極擊、等極擊，",
        "translation": "They are: trembling, extreme trembling, such-and-such trembling; enthusiasm, extreme enthusiasm, such-and-such enthusiasm; trembling, extremely trembling, such-and-such trembling; striking, extremely striking, and equally striking.",
        "source": "T05n0220_001:0002b11_1"
    },
    {
        "source_sentence": "吼、極吼、等極吼，爆、極爆、等極爆。",
        "translation": "Roar, extreme roar, and equally great roar; blasting, extreme blasting, and equally great blasting.",
        "source": "T05n0220_001:0002b13_2"
    },
    {
        "source_sentence": "又令此界東涌西沒、西涌東沒、南涌北沒、北涌南沒、中涌邊沒、邊涌中沒。",
        "translation": "It also causes the east to rise up and fall down in the west, the west to rise up and fall down in the east, the south to rise up and fall down in the north, the north to rise up and fall down in the south, the middle to rise up and fall down at the side, and the middle to rise up and fall down at the side.",
        "source": "T05n0220_001:0002b14_3"
    },
    {
        "source_sentence": "其地清淨光澤細軟，生諸有情利益安樂。",
        "translation": "The ground is pure, shiny, subtle, and gentle, bringing benefit and comfort to sentient beings.",
        "source": "T05n0220_001:0002b15_4"
    },
    {
        "source_sentence": "時，此三千大千世界所有地獄、傍生、鬼界及餘無暇險惡趣坑，一切有情皆離苦難，",
        "translation": "At the time, all the sentient beings in these 3,000 great one-thousand worlds were freed from suffering and distress in the hells, animals, ghost realms, and other unremitting pits of bad destinies.",
        "source": "T05n0220_001:0002b16_5"
    },
    {
        "source_sentence": "從此捨命得生人中及六欲天，皆憶宿住，歡喜踊躍同詣佛所，以殷淨心頂禮佛足。",
        "translation": "From this, they abandoned their lives and were born among humans and the gods of the six desires, all remembering their past lives, rejoicing and jumping with joy as they went to the Buddha, bowed their heads at his feet with a pure heart, and venerated him.",
        "source": "T05n0220_001:0002b18_6"
    },
    {
        "source_sentence": "從此展轉周遍十方殑伽沙等諸佛世界，以佛神力六種變動。",
        "translation": "From here, in turn, he pervades the buddha worlds of the sands of the Ganges in the ten directions and uses the Buddha's miraculous power to cause six kinds of transformations.",
        "source": "T05n0220_001:0002b20_7"
    },
    {
        "source_sentence": "時，彼世界諸惡趣等一切有情皆離苦難，從彼捨命得生人中及六欲天，",
        "translation": "At that time, all sentient beings in the evil destinies of those worlds and so forth were freed from suffering and distress. They gave up their lives to be born among humans and gods of the six heavens of desire.",
        "source": "T05n0220_001:0002b21_8"
    },
    {
        "source_sentence": "皆憶宿住，歡喜踊躍各於本界同詣佛所頂禮佛足。",
        "translation": "They all remembered their past lives, rejoicing and jumping with joy. Each of them went to the Buddha in his native land together, bowed at his feet, and venerated him.",
        "source": "T05n0220_001:0002b23_9"
    },
    {
        "source_sentence": "時，此三千大千世界及餘十方殑伽沙等世界有情，盲者能視，聾者能聽，",
        "translation": "At the time, these 3,000 great one-thousand worlds and the other sands of the worlds in the ten directions were so many sentient beings that blind people could see and deaf people could hear.",
        "source": "T05n0220_001:0002b24_10"
    },
    {
        "source_sentence": "瘂者能言，狂者得念，亂者得定，貧者得富，露者得衣，飢者得食，渴者得飲，",
        "translation": "Those who are hungry can speak, those who are crazy can think, those who are disturbed can concentrate, those who are poor can be rich, those who are desolate can obtain clothing, those who are hungry can eat, and those who are thirsty can drink.",
        "source": "T05n0220_001:0002b26_11"
    },
    {
        "source_sentence": "病者得除愈，醜者得端嚴，形殘者得具足，根缺者得圓滿，迷悶者得醒悟，",
        "translation": "The sick person is cured, the ugly one attains dignity, the shaped one attains endowment, the one with missing faculties attains fulfillment, and the deluded one attains awakening.",
        "source": "T05n0220_001:0002b28_12"
    },
    {
        "source_sentence": "疲頓者得安適。",
        "translation": "Those who are weary and sudden attain well-being.",
        "source": "T05n0220_001:0002b29_13"
    },
    {
        "source_sentence": "時，諸有情等心相向，如父如母、如兄如弟、如姊如妹、如友如親，離邪語業命、修正語業命，",
        "translation": "At that time, all sentient beings are equally minded toward each other, like father and mother, brothers and sisters, sisters and sisters, friends and relatives, free of wrong speech, action and livelihood, and cultivate right speech and action.",
        "source": "T05n0220_001:0002c01_14"
    },
    {
        "source_sentence": "離十惡業道、修十善業道，離惡尋思、修善尋思，離非梵行、修正梵行，",
        "translation": "They abstain from the ten bad paths of action and cultivate the ten good paths of action; they abstain from bad discursive thought and cultivate good discursive thought; they abstain from sexual misconduct and practice celibacy.",
        "source": "T05n0220_001:0002c03_15"
    },
    {
        "source_sentence": "好淨棄穢、樂靜捨諠，身意泰然忽生妙樂，如修行者入第三定。",
        "translation": "Like a practitioner entering the third concentration, he likes purity and abandons defilement, enjoys quiescence and equanimity, and suddenly produces marvelous bliss in body and mind as if he were entering the third concentration.",
        "source": "T05n0220_001:0002c04_16"
    },
    {
        "source_sentence": "復有勝慧欻爾現前，咸作是思：「布施、調伏、安忍、勇進、寂靜、諦觀，",
        "translation": "Again, there was a man of superior wisdom named Vaiśravaṇa who appeared before him. They all thought:",
        "source": "T05n0220_001:0002c06_0"
    },
    {
        "source_sentence": "遠離放逸，修行梵行，於諸有情慈、悲、喜、捨，不相撓亂，豈不善哉！」",
        "translation": "Isn't it good that they part with carelessness, cultivate the religious practice, and are kind, compassionate, joyous, and equanimous to sentient beings without disturbing each other?",
        "source": "T05n0220_001:0002c07_1"
    },
    {
        "source_sentence": "爾時，世尊在師子座，光明殊特威德巍巍，映蔽三千大千世界并餘十方殑伽沙等諸佛國土，",
        "translation": "At that time the World-honored One was seated on a lion’s throne. His ray of light was so brilliant and majestic as to overshadow all the other buddha-lands equal in number to the sands of the Ganges River in the ten directions, as well as the great manifold cosmos with its three thousand worlds.",
        "source": "T05n0220_001:0002c09_0"
    },
    {
        "source_sentence": "蘇迷盧山、輪圍山等及餘一切龍神天宮乃至淨居皆悉不現；",
        "translation": "They do not appear at all on the mountains of Sumeru, the surrounding mountains, etc., or in the palaces of all the other dragons, gods, celestial beings, and so on, up to the pure abodes.",
        "source": "T05n0220_001:0002c11_1"
    },
    {
        "source_sentence": "如秋滿月暉暎眾星，如夏日輪光奪諸色，如四大寶妙高山王臨照諸山威光逈出。",
        "translation": "It's like the full moon in autumn that shines brightly on all the stars, like the light of the sun and moon in summer that snatches away forms, or like the four great jeweled marvelous high mountain kings shining over the mountains with their majestic radiance.",
        "source": "T05n0220_001:0002c12_2"
    },
    {
        "source_sentence": "佛以神力現本色身，令此三千大千世界一切有情皆悉覩見。",
        "translation": "The Buddha manifested his original form body by mystic powers, causing all sentient beings in this 3,000 great one-thousand worlds to see it.",
        "source": "T05n0220_001:0002c14_3"
    },
    {
        "source_sentence": "時，此三千大千世界無量無數淨居諸天，下至欲界四大王眾天，及餘一切人、非人等，",
        "translation": "At the time, these 3,000 great one-thousand worlds of measureless and countless pure abode celestial beings descended down to the four great kings of the heavens in the realm of desire and all the other humans and nonhumans.",
        "source": "T05n0220_001:0002c15_4"
    },
    {
        "source_sentence": "皆見如來處師子座，威光顯曜如大金山，歡喜踊躍歎未曾有，各持種種無量天花、香鬘、塗香、燒香、末香、衣服、瓔珞、寶幢、幡蓋、伎樂、諸珍，",
        "translation": "They all saw the Buddha seated on a lion’s seat, his majesty shining as vast as a great mountain of gold. Each rejoicing and dancing in wonderment, they each carried countless kinds of celestial flowers, perfumes, ointments, scented powders, aromatic powders, robes, jewelry, precious banners, pennants,",
        "source": "T05n0220_001:0002c17_5"
    },
    {
        "source_sentence": "及無量種天青蓮花、天赤蓮花、天白蓮花、天香蓮花、天黃蓮花、天紅蓮花、天金錢樹花及天香葉，",
        "translation": "and innumerable kinds of celestial blue lotus blossoms, celestial red lotus blossoms, celestial white lotus blossoms, celestial fragrant lotus blossoms, celestial yellow lotus blossoms, celestial red lotus blossoms, celestial golden lotus blossoms,",
        "source": "T05n0220_001:0002c20_6"
    },
    {
        "source_sentence": "并餘無量水陸生花，持詣佛所奉散佛上。",
        "translation": "And the other flowers growing in measureless water and land brought to the Buddha and scattered on top of him.",
        "source": "T05n0220_001:0002c23_7"
    },
    {
        "source_sentence": "以佛神力，諸花鬘等旋轉上踊合成花臺，量等三千大千世界，垂天花蓋、寶鐸、珠幡，",
        "translation": "By the supernatural power of the Buddha, these flower garlands and so forth rose up in reverse to form a flower terrace equal in size to the great chiliocosm with three thousand flowers hanging down heavenly canopies, jeweled pennants, and pearl banners.",
        "source": "T05n0220_001:0002c24_8"
    },
    {
        "source_sentence": "綺飾紛綸甚可愛樂。",
        "translation": "They are beautifully decorated and draped, very pleasing.",
        "source": "T05n0220_001:0002c26_0"
    },
    {
        "source_sentence": "時，此佛土微妙莊嚴。",
        "translation": "At the time, this Buddha land was marvelously adorned.",
        "source": "T05n0220_001:0002c26_1"
    },
    {
        "source_sentence": "猶如西方極樂世界，佛光暉暎三千大千物類，虛空皆同金色，十方各等殑伽河沙諸佛世界亦復如是。",
        "translation": "Just as in the Western paradise world of ultimate bliss, the Buddha’s light illumines 3,000 great one-thousand objects. The sky is all the same color as golden; so are the buddha worlds equal to the sands of Ganges River in each of the ten directions.",
        "source": "T05n0220_001:0002c26_2"
    },
    {
        "source_sentence": "時，此三千大千佛土，南贍部洲、東勝身洲、西牛貨洲、北俱盧洲，其中諸人，",
        "translation": "At that time the people of Jambudvīpa in the south, Kapilavastu in the east, Cakravāḍa in the west, and Uttarakuru in the north lived in these buddha-lands.",
        "source": "T05n0220_001:0002c29_3"
    },
    {
        "source_sentence": "佛神力故，各各見佛正坐其前，咸謂如來獨為說法。",
        "translation": "Because of the Buddha's miraculous power, each saw the Buddha sitting upright in front of him, and they all said that the Tathāgata was teaching the Dharma for them alone.",
        "source": "T05n0220_001:0003a01_4"
    },
    {
        "source_sentence": "如是四大王眾天、三十三天、夜摩天、覩史多天、樂變化天、他化自在天、梵眾天、梵輔天、梵會天、大梵天、光天、少光天、無量光天、極光淨天、淨天、少淨天、無量淨天、遍淨天、廣天、少廣天、無量廣天、廣果天、無繁天、無熱天、善現天、善見天、色究竟天，",
        "translation": "In this way the gods of the four great elements, the thirty-three guardian gods, the Trāyastriṃśa gods, the Yama gods, the Kauśinagara gods, the Nirmāṇarati gods, the Paranirmitavaśavartin gods, the Paranirmitavaśavartin gods, the Brahmadeva gods",
        "source": "T05n0220_001:0003a03_5"
    },
    {
        "source_sentence": "亦以世尊神通力故，各各見佛正坐其前，咸謂如來獨為說法。",
        "translation": "Also, because of the Bhagavān's miraculous power, each saw the Buddha sitting upright in front of him, and they all said that the Tathāgata was teaching the Dharma for them alone.",
        "source": "T05n0220_001:0003a08_6"
    },
    {
        "source_sentence": "爾時，世尊不起于座，熙怡微笑，從其面門放大光明，遍照三千大千佛土，",
        "translation": "At that moment, the World-honored One did not rise from his seat but smiled joyfully. emanating great rays of light from his forehead illumined one thousand buddha-lands in all directions.",
        "source": "T05n0220_001:0003a11_0"
    },
    {
        "source_sentence": "并餘十方殑伽沙等諸佛世界。",
        "translation": "It's the same as the other buddha worlds like the sands of the Ganges in the ten directions.",
        "source": "T05n0220_001:0003a12_1"
    },
    {
        "source_sentence": "時，此三千大千佛土一切有情，尋佛光明普見十方殑伽沙等諸佛世界一切如來、應、正等覺，",
        "translation": "At that time all the sentient beings in those great manifold thousand buddha-lands looked for the Buddha’s light and saw as many buddha-realms as there are grains of sand in the ten directions—all buddhas, enlightening beings, wise ones, perfectly enlightened ones.",
        "source": "T05n0220_001:0003a13_2"
    },
    {
        "source_sentence": "聲聞、菩薩眾會圍繞，及餘一切有情無情品類差別。",
        "translation": "They are surrounded by assemblies of śrāvakas and bodhisattvas, and there are distinctions in the categories of all other sentient beings and non-sentient beings.",
        "source": "T05n0220_001:0003a15_3"
    },
    {
        "source_sentence": "時，彼十方殑伽沙等諸佛世界一切有情，尋佛光明亦見此土釋迦牟尼如來、應、正等覺，",
        "translation": "At that time all sentient beings in those buddha-lands as numerous as the grains of sand in the Ganges River in the ten directions, looking for the Buddha’s light, also saw this land:",
        "source": "T05n0220_001:0003a16_4"
    },
    {
        "source_sentence": "聲聞、菩薩眾會圍繞，及餘一切有情無情品類差別。",
        "translation": "They are surrounded by assemblies of śrāvakas and bodhisattvas, and there are distinctions in the categories of all other sentient beings and non-sentient beings.",
        "source": "T05n0220_001:0003a18_5"
    },
    {
        "source_sentence": "爾時，東方盡殑伽沙等世界，最後世界名曰多寶，佛號寶性如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "At that time, in the east, as many worlds as there are grains of sand in the Ganges River, the last world being called Prabhūtaratna. The Buddha was named Ratnaketu Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed Worthy, Tamer of",
        "source": "T05n0220_001:0003a20_0"
    },
    {
        "source_sentence": "時現在彼安隱住持，為諸菩薩摩訶薩眾說大般若波羅蜜多。",
        "translation": "He now abides peacefully there and explains the great prajñāpāramitā to the bodhisattvas, mahāsattvas, and others.",
        "source": "T05n0220_001:0003a23_1"
    },
    {
        "source_sentence": "彼有菩薩名曰普光，見此大光、大地變動及佛身相，心懷猶豫前詣佛所，",
        "translation": "There was an enlightening being there called Universal Light. Seeing this great ray of light, the earthquake, and the features of the Buddha’s body, hesitating in thought, he approached the Buddha.",
        "source": "T05n0220_001:0003a24_2"
    },
    {
        "source_sentence": "頂禮雙足白言：「世尊！",
        "translation": "He bowed his head at their feet and said, Bhagavān!",
        "source": "T05n0220_001:0003a26_3"
    },
    {
        "source_sentence": "何因何緣而有此瑞？」",
        "translation": "What are the causes and conditions for this miraculous appearance?",
        "source": "T05n0220_001:0003a26_4"
    },
    {
        "source_sentence": "時，寶性佛告普光菩薩摩訶薩言：「善男子！",
        "translation": "The Jewel-Nature Buddha then addressed the Bodhisattva Mahāsattva Universal Light, saying, Good sons!",
        "source": "T05n0220_001:0003a27_5"
    },
    {
        "source_sentence": "從此西方盡殑伽沙等世界，最後世界名曰堪忍，佛號釋迦牟尼如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "To the west of here, in all the worlds as numerous as the grains of sand in the Ganges River as there are grains of sand in the Ganges River, is the final world called Kanyakubja. The buddhas there are named Śākyamuni Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of",
        "source": "T05n0220_001:0003a28_0"
    },
    {
        "source_sentence": "今現在彼安隱住持，將為菩薩摩訶薩眾說大般若波羅蜜多，彼佛神力故現斯瑞。」",
        "translation": "Now, that peaceful absorption is about to teach the great perfection of wisdom for the bodhisattva Mahāsattva's congregation, and it's because of the Buddha's miraculous power that this apparition appears.",
        "source": "T05n0220_001:0003b02_1"
    },
    {
        "source_sentence": "普光聞已，歡喜踊躍重白佛言：「世尊！",
        "translation": "After hearing this, Pugwang rejoiced and jumped up and said to the Buddha again, Bhagavān!",
        "source": "T05n0220_001:0003b04_0"
    },
    {
        "source_sentence": "我今請往堪忍世界，觀禮供養釋迦牟尼如來及諸菩薩摩訶薩眾，得無礙解陀羅尼門三摩地門神通自在，",
        "translation": "I now invite you to the world Patience, to pay homage to the Tathāgata Śākyamuni and all the assemblies of bodhisattvas and mahāsattvas who have attained unobstructed mastery of the dhāraṇī teachings, concentrations, and supernormal powers.",
        "source": "T05n0220_001:0003b04_1"
    },
    {
        "source_sentence": "住最後身紹尊位者。",
        "translation": "He who abides in the final body and assumes the position of honored one.",
        "source": "T05n0220_001:0003b07_2"
    },
    {
        "source_sentence": "唯願慈悲哀愍垂許！」",
        "translation": "Please have mercy, pity, and compassion for me!",
        "source": "T05n0220_001:0003b07_3"
    },
    {
        "source_sentence": "時，寶性佛告普光菩薩言：「善哉！",
        "translation": "The Jewel-Nature Buddha then addressed the Bodhisattva Universal Light, saying, Good!",
        "source": "T05n0220_001:0003b08_4"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T05n0220_001:0003b08_5"
    },
    {
        "source_sentence": "今正是時，隨汝意往。」",
        "translation": "Now is the right time, go as you wish.",
        "source": "T05n0220_001:0003b09_6"
    },
    {
        "source_sentence": "即以千莖金色蓮花，其花千葉眾寶莊嚴，授普光菩薩而誨之言：「汝持此花至釋迦牟尼佛所，",
        "translation": "He then gave the Bodhisattva Samantabhadra a thousand stalks of golden lotus flowers with a thousand petals and a thousand leaves, adorned with all kinds of jewels, and instructed him, “Take this flower to Śākyamuni Buddha.",
        "source": "T05n0220_001:0003b09_7"
    },
    {
        "source_sentence": "如我詞曰：『寶性如來致問無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "As I said, 'The Tathāgata Jewel-Nature asks an immeasurable question: Is the Tathāgata with few illnesses and few afflictions, who rises up to live lightly, whose energy is tempered, and who lives in comfort?'",
        "source": "T05n0220_001:0003b11_8"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0003b13_9"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0003b13_10"
    },
    {
        "source_sentence": "持此蓮花以寄世尊而為佛事。』",
        "translation": "Take this lotus flower and send it to the Bhagavān for the Buddha's sake.'",
        "source": "T05n0220_001:0003b13_11"
    },
    {
        "source_sentence": "汝至彼界應住正知，觀彼佛土及諸大眾，勿懷輕慢而自毀傷。",
        "translation": "When you reach that realm, you should abide in correct knowledge and observe the Buddha's land and the masses there, so don't harbor conceit and disparage yourself.",
        "source": "T05n0220_001:0003b14_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_001:0003b16_0"
    },
    {
        "source_sentence": "彼諸菩薩威德難及，悲願熏心，以大因緣而生彼土。」",
        "translation": "Those bodhisattvas' authoritative qualities are unmatched, and their minds are perfumed with compassion and vows, born in that land for great reasons.",
        "source": "T05n0220_001:0003b16_1"
    },
    {
        "source_sentence": "時，普光菩薩受花奉勅，與無量百千俱胝那庾多出家、在家菩薩摩訶薩，",
        "translation": "At that time the enlightening being Universal Light received the flower and, by imperial edict, accompanied by innumerable hundreds of thousands of myriads of koṭis of buddha-bodhisattva mahāsattvas who had renounced the householder’s life.",
        "source": "T05n0220_001:0003b17_2"
    },
    {
        "source_sentence": "及無數百千童男童女，頂禮佛足右繞奉辭，各持無量種種花香、寶幢、幡蓋、衣服、寶飾及餘供具發引而來，",
        "translation": "Countless hundreds of thousands of boys and girls came, bowed their heads at the Buddha’s feet, circumambulated him to his right, and greeted him. Each brought an infinite variety of flowers, fragrances, jewel banners, pennants, canopies, robes, ornaments, and other offerings.",
        "source": "T05n0220_001:0003b19_3"
    },
    {
        "source_sentence": "所經東方殑伽沙等諸佛世界，一一佛所供養恭敬、尊重讚歎無空過者。",
        "translation": "In the buddha worlds as numerous as the sands of Ganges in the east as there are buddhas, each buddha is offered support, venerated, honored, and praised by others without fail.",
        "source": "T05n0220_001:0003b21_4"
    },
    {
        "source_sentence": "至此佛所頂禮雙足，繞百千匝却住一面。",
        "translation": "At this buddha’s place he bowed his head at the Buddha’s feet, circumambulated him one hundred thousand times, and withdrew to one side.",
        "source": "T05n0220_001:0003b23_5"
    },
    {
        "source_sentence": "普光菩薩前白佛言：「世尊！",
        "translation": "Samantabhadra Bodhisattva went before the Buddha and said, Bhagavān!",
        "source": "T05n0220_001:0003b24_6"
    },
    {
        "source_sentence": "從此東方盡殑伽沙等世界，最後世界名曰多寶，佛號寶性如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "To the east of here, in all the worlds as numerous as the grains of sand in the Ganges River as there are grains of sand in the Ganges River, is the final world called “Many Jewels.” The buddhas there are called Ratnaketu Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Know",
        "source": "T05n0220_001:0003b24_7"
    },
    {
        "source_sentence": "致問世尊無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "The World-honored One asked immeasurable questions: Are there few illnesses and few afflictions, are they arising and abiding in ease, are their vitality tempered, and are they living in well-being?",
        "source": "T05n0220_001:0003b27_8"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0003b28_9"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0003b29_10"
    },
    {
        "source_sentence": "持此千莖金色蓮花以寄世尊而為佛事。」",
        "translation": "Take these one thousand stalks of golden lotus flowers and send them to the Bhagavān for the Buddha's service.",
        "source": "T05n0220_001:0003b29_11"
    },
    {
        "source_sentence": "時，釋迦牟尼佛受此蓮花，還散東方殑伽沙等諸佛世界。",
        "translation": "Śākyamuni Buddha then accepted this lotus flower and returned it to the buddha worlds as numerous as the sands of Ganges in the east.",
        "source": "T05n0220_001:0003c01_12"
    },
    {
        "source_sentence": "佛神力故，令此蓮花遍諸佛土，諸花臺中各有化佛結跏趺坐，為諸菩薩說大般若波羅蜜多相應之法，",
        "translation": "Because of the Buddha's miraculous power, these lotus flowers caused them to pervade all the buddha-lands, and in each of those flowered pedestals there were transformed buddhas sitting cross-legged, teaching the bodhisattvas the Dharma associated with the great prajñāpāramitā.",
        "source": "T05n0220_001:0003c02_13"
    },
    {
        "source_sentence": "有情聞者必得無上正等菩提。",
        "translation": "Sentient beings who hear it will surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0003c05_14"
    },
    {
        "source_sentence": "是時，普光及諸眷屬見此事已，歡喜踊躍歎未曾有，各隨善根供具多少，",
        "translation": "At that moment, seeing this unprecedented phenomenon, Samantanetra and the members of his retinue rejoiced and jumped for joy in admiration, each according to how many roots of goodness they had accumulated.",
        "source": "T05n0220_001:0003c05_15"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎佛菩薩已，退坐一面。",
        "translation": "After honoring and venerating the Buddha and bodhisattva, he withdrew to sit at one side.",
        "source": "T05n0220_001:0003c07_16"
    },
    {
        "source_sentence": "如是最後世界已前，所有東方一一佛土，各有如來現為大眾宣說妙法。",
        "translation": "Thus, before this final world, there were buddha-lands in each of the eastern directions, where tathāgatas appeared and taught the marvelous Dharma to the masses.",
        "source": "T05n0220_001:0003c08_17"
    },
    {
        "source_sentence": "是諸佛所亦各有一上首菩薩，見此大光、大地變動及佛身相，前詣佛所白言：「世尊！",
        "translation": "At each of these buddhas, there was also a supreme bodhisattva who saw this great ray of light, the earth's trembling, and the Buddha's physical appearance.",
        "source": "T05n0220_001:0003c10_18"
    },
    {
        "source_sentence": "何因何緣而有此瑞？」",
        "translation": "What are the causes and conditions for this miraculous appearance?",
        "source": "T05n0220_001:0003c11_19"
    },
    {
        "source_sentence": "時，彼彼佛各各報言：「於此西方有堪忍世界，佛號釋迦牟尼，將為菩薩說大般若波羅蜜多，",
        "translation": "Each of those buddhas replied, “In the western direction there is a buddha called Śākyamuni who will teach the bodhisattva Mahāprajñāpāramitā.",
        "source": "T05n0220_001:0003c12_20"
    },
    {
        "source_sentence": "彼佛神力故現斯瑞。」",
        "translation": "It's because of the Buddha's miraculous power that this auspicious sign appears.",
        "source": "T05n0220_001:0003c14_21"
    },
    {
        "source_sentence": "上首菩薩聞已歡喜，各各請往堪忍世界，觀禮供養佛及菩薩。",
        "translation": "The supreme chief bodhisattva was delighted to hear it, invited each one to the world of patience, paid homage, and offered support to the Buddha and the bodhisattvas.",
        "source": "T05n0220_001:0003c14_22"
    },
    {
        "source_sentence": "彼諸如來讚善聽往，各以金色千寶蓮花而告之言：「汝可持此至彼佛所，",
        "translation": "Each of those buddhas, having praised the bhikṣus who had gone there, said to them with golden lotus blossoms made of a thousand kinds of precious jewels, “Take this treasure and go to that buddha.",
        "source": "T05n0220_001:0003c16_23"
    },
    {
        "source_sentence": "具陳我詞：『致問無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "He told me in detail, 'I'm asking an immeasurable number of questions: Is there little illness and little affliction, rising and living lightly, maintaining well-balanced energy, and abiding comfortably?'",
        "source": "T05n0220_001:0003c18_0"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0003c19_1"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0003c19_2"
    },
    {
        "source_sentence": "持此蓮花以寄世尊而為佛事。』",
        "translation": "Take this lotus flower and send it to the Bhagavān for the Buddha's sake.'",
        "source": "T05n0220_001:0003c20_0"
    },
    {
        "source_sentence": "汝至彼界應住正知，觀彼佛土及諸菩薩，勿懷輕慢而自毀傷。",
        "translation": "When you reach that realm, you should abide in correct knowledge and observe the buddha-lands and bodhisattvas there, so don't harbor conceit and disparage yourself.",
        "source": "T05n0220_001:0003c20_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_001:0003c22_2"
    },
    {
        "source_sentence": "彼諸菩薩威德難及，悲願熏心，以大因緣而生彼土。」",
        "translation": "Those bodhisattvas' authoritative qualities are unmatched, and their minds are perfumed with compassion and vows, born in that land for great reasons.",
        "source": "T05n0220_001:0003c22_3"
    },
    {
        "source_sentence": "一一上首受花奉勅，各與無量無數菩薩、童男童女，辭佛持供發引而來，",
        "translation": "Each of the chief monks accepted the flowers and presented them to the Buddha, each accompanied by an immeasurable number of bodhisattvas, boys, and girls.",
        "source": "T05n0220_001:0003c23_4"
    },
    {
        "source_sentence": "所經佛土一一供養佛及菩薩無空過者。",
        "translation": "There's nothing wrong with making offerings to the buddhas and bodhisattvas in each of the buddha lands that are cultivated.",
        "source": "T05n0220_001:0003c25_5"
    },
    {
        "source_sentence": "到此佛所頂禮雙足，繞百千匝奉花陳事。",
        "translation": "They came to the place where the Buddha was, bowed their heads at his feet, circumambulated him one hundred thousand times, and presented offerings of flowers.",
        "source": "T05n0220_001:0003c26_6"
    },
    {
        "source_sentence": "佛受花已還散東方，佛神力故，遍諸佛土，諸花臺中各有化佛，為諸菩薩說大般若波羅蜜多，",
        "translation": "After accepting the flowers, the Buddha returned and scattered them to the east. Because of his miraculous powers, the Buddha pervaded all the buddha-lands, and in each of the flower terraces there were transformed buddhas teaching the great prajñāpāramitā for the bodhisattvas.",
        "source": "T05n0220_001:0003c27_7"
    },
    {
        "source_sentence": "令諸聞者必獲無上正等菩提。",
        "translation": "It will cause those who hear it to surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0003c29_8"
    },
    {
        "source_sentence": "上首菩薩及諸眷屬，見已歡喜歎未曾有，各隨善根供具多少，供養恭敬、尊重讚歎佛菩薩已，",
        "translation": "The supreme enlightening beings and their retinues, seeing this unprecedented phenomenon, rejoiced and praised it. Each of them, according to the amount of goodness they had accumulated, offered support, honored, revered, and venerated the buddhas and enlightening beings.",
        "source": "T05n0220_001:0003c29_9"
    },
    {
        "source_sentence": "退坐一面。",
        "translation": "He withdrew and sat to one side.",
        "source": "T05n0220_001:0004a03_0"
    },
    {
        "source_sentence": "爾時，南方盡殑伽沙等世界，最後世界名離一切憂，佛號無憂德如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "At that time in the southern direction all the worlds as numerous as the grains of sand in the Ganges River, the last world being called freedom from all sorrow. The Buddha there was named Asokadatta Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed Worthy, Tam",
        "source": "T05n0220_001:0004a04_0"
    },
    {
        "source_sentence": "時現在彼安隱住持，為諸菩薩摩訶薩眾說大般若波羅蜜多。",
        "translation": "He now abides peacefully there and explains the great prajñāpāramitā to the bodhisattvas, mahāsattvas, and others.",
        "source": "T05n0220_001:0004a07_1"
    },
    {
        "source_sentence": "彼有菩薩名曰離憂，見此大光、大地變動及佛身相，心懷猶豫前詣佛所，",
        "translation": "There was a bodhisattva there called Liou, who saw this great ray of light, the earthquake, and the buddha’s bodily features. Hesitating, he went to see the Buddha.",
        "source": "T05n0220_001:0004a08_2"
    },
    {
        "source_sentence": "頂禮雙足白言：「世尊！",
        "translation": "He bowed his head at their feet and said, Bhagavān!",
        "source": "T05n0220_001:0004a10_3"
    },
    {
        "source_sentence": "何因何緣而有此瑞？」",
        "translation": "What are the causes and conditions for this miraculous appearance?",
        "source": "T05n0220_001:0004a10_4"
    },
    {
        "source_sentence": "時，無憂德佛告離憂菩薩摩訶薩言：「善男子！",
        "translation": "The Buddha of No Sorrowful Virtue then addressed the Bodhisattva Mahāsattva freedom from sorrow, saying, Good sons!",
        "source": "T05n0220_001:0004a11_5"
    },
    {
        "source_sentence": "從此北方盡殑伽沙等世界，最後世界名曰堪忍，佛號釋迦牟尼如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "To the north of here, in all the worlds as numerous as the grains of sand in the Ganges River as there are grains of sand in the Ganges River, is the final world called Kanyakubja. The buddhas there are called the Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Un",
        "source": "T05n0220_001:0004a12_6"
    },
    {
        "source_sentence": "今現在彼安隱住持，將為菩薩摩訶薩眾說大般若波羅蜜多，彼佛神力故現斯瑞。」",
        "translation": "Now, that peaceful absorption is about to teach the great perfection of wisdom for the bodhisattva Mahāsattva's congregation, and it's because of the Buddha's miraculous power that this apparition appears.",
        "source": "T05n0220_001:0004a15_7"
    },
    {
        "source_sentence": "離憂聞已，歡喜踊躍重白佛言：「世尊！",
        "translation": "After hearing this, he was freed from sorrow and rejoicing and jumped up and down. He said to the Buddha:",
        "source": "T05n0220_001:0004a17_8"
    },
    {
        "source_sentence": "我今請往堪忍世界，觀禮供養釋迦牟尼如來及諸菩薩摩訶薩眾，得無礙解陀羅尼門三摩地門神通自在，",
        "translation": "I now invite you to the world Patience, to pay homage to the Tathāgata Śākyamuni and all the assemblies of bodhisattvas and mahāsattvas who have attained unobstructed mastery of the dhāraṇī teachings, concentrations, and supernormal powers.",
        "source": "T05n0220_001:0004a18_0"
    },
    {
        "source_sentence": "住最後身紹尊位者。",
        "translation": "He who abides in the final body and assumes the position of honored one.",
        "source": "T05n0220_001:0004a20_1"
    },
    {
        "source_sentence": "唯願慈悲哀愍垂許！」",
        "translation": "Please have mercy, pity, and compassion for me!",
        "source": "T05n0220_001:0004a20_2"
    },
    {
        "source_sentence": "時，無憂德佛告離憂菩薩言：「善哉！",
        "translation": "The Buddha of No Sorrowful Virtue then addressed the Bodhisattva Free from Sorrow, saying, Good!",
        "source": "T05n0220_001:0004a21_3"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T05n0220_001:0004a22_4"
    },
    {
        "source_sentence": "今正是時，隨汝意往。」",
        "translation": "Now is the right time, go as you wish.",
        "source": "T05n0220_001:0004a22_5"
    },
    {
        "source_sentence": "即以千莖金色蓮花，其花千葉眾寶莊嚴，授離憂菩薩而誨之言：「汝持此花至釋迦牟尼佛所，",
        "translation": "He gave the Bodhisattva Sadāparibhūta a thousand stalks of golden lotus flowers with a thousand petals, each adorned with a thousand leaves made of all kinds of jewels, and said to him, “Take this flower and bring it to Śākyamuni Buddha.",
        "source": "T05n0220_001:0004a22_6"
    },
    {
        "source_sentence": "如我詞曰：『無憂德如來致問無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "As I said, 'The Tathāgata of No Sorrowful Virtue asks an immeasurable number of questions: whether he has few illnesses and little affliction, lives with ease, maintains well-balanced energy, and abides in peace and comfort.'",
        "source": "T05n0220_001:0004a24_7"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0004a26_8"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0004a26_9"
    },
    {
        "source_sentence": "持此蓮花以寄世尊而為佛事。』",
        "translation": "Take this lotus flower and send it to the Bhagavān for the Buddha's sake.'",
        "source": "T05n0220_001:0004a27_10"
    },
    {
        "source_sentence": "汝至彼界應住正知，觀彼佛土及諸大眾，勿懷輕慢而自毀傷。",
        "translation": "When you reach that realm, you should abide in correct knowledge and observe the Buddha's land and the masses there, so don't harbor conceit and disparage yourself.",
        "source": "T05n0220_001:0004a27_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_001:0004a29_12"
    },
    {
        "source_sentence": "彼諸菩薩威德難及，悲願熏心，以大因緣而生彼土。」",
        "translation": "Those bodhisattvas' authoritative qualities are unmatched, and their minds are perfumed with compassion and vows, born in that land for great reasons.",
        "source": "T05n0220_001:0004a29_13"
    },
    {
        "source_sentence": "時，離憂菩薩受花奉勅，與無量百千俱胝那庾多出家、在家菩薩摩訶薩，",
        "translation": "At that time the enlightening being freedom from sorrow received the flower and, by imperial edict, accompanied by innumerable hundreds of thousands of myriads of koṭis of householders and bodhisattva mahāsattvas, renounced the world.",
        "source": "T05n0220_001:0004b01_14"
    },
    {
        "source_sentence": "及無數百千童男童女，頂禮佛足右繞奉辭，各持無量種種花香、寶幢、幡蓋、衣服、寶飾及餘供具發引而來，",
        "translation": "Countless hundreds of thousands of boys and girls came, bowed their heads at the Buddha’s feet, circumambulated him to his right, and greeted him. Each brought an infinite variety of flowers, fragrances, jewel banners, pennants, canopies, robes, ornaments, and other offerings.",
        "source": "T05n0220_001:0004b03_15"
    },
    {
        "source_sentence": "所經南方殑伽沙等諸佛世界，一一佛所供養恭敬、尊重讚歎無空過者。",
        "translation": "In the buddha worlds as numerous as the sands of Ganges in the south where they pass, there's nothing wrong with offering support, respect, veneration, and praise from each Buddha.",
        "source": "T05n0220_001:0004b05_16"
    },
    {
        "source_sentence": "至此佛所頂禮雙足，繞百千匝却住一面。",
        "translation": "At this buddha’s place he bowed his head at the Buddha’s feet, circumambulated him one hundred thousand times, and withdrew to one side.",
        "source": "T05n0220_001:0004b07_17"
    },
    {
        "source_sentence": "離憂菩薩前白佛言：「世尊！",
        "translation": "The Vaiśravaṇa Bodhisattva went before the Buddha and said, Bhagavān!",
        "source": "T05n0220_001:0004b08_18"
    },
    {
        "source_sentence": "從此南方盡殑伽沙等世界，最後世界名離一切憂，佛號無憂德如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "To the south of here, in all the worlds as numerous as the grains of sand in the Ganges River as there are grains of sand in the Ganges River, is the final world called freedom from all sorrow. The Buddha there is called Sadnessless Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Knower of the",
        "source": "T05n0220_001:0004b08_19"
    },
    {
        "source_sentence": "致問世尊無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "The World-honored One asked immeasurable questions: Are there few illnesses and few afflictions, are they arising and abiding in ease, are their vitality tempered, and are they living in well-being?",
        "source": "T05n0220_001:0004b12_20"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0004b13_21"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0004b13_22"
    },
    {
        "source_sentence": "持此千莖金色蓮花以寄世尊而為佛事。」",
        "translation": "Take these one thousand stalks of golden lotus flowers and send them to the Bhagavān for the Buddha's service.",
        "source": "T05n0220_001:0004b13_23"
    },
    {
        "source_sentence": "時，釋迦牟尼佛受此蓮花，還散南方殑伽沙等諸佛世界。",
        "translation": "Śākyamuni Buddha then accepted this lotus flower and returned it to the buddha worlds as numerous as the sands of Ganges in the south.",
        "source": "T05n0220_001:0004b14_24"
    },
    {
        "source_sentence": "佛神力故，令此蓮花遍諸佛土，諸花臺中各有化佛結跏趺坐，為諸菩薩說大般若波羅蜜多相應之法，",
        "translation": "Because of the Buddha's miraculous power, these lotus flowers caused them to pervade all the buddha-lands, and in each of those flowered pedestals there were transformed buddhas sitting cross-legged, teaching the bodhisattvas the Dharma associated with the great prajñāpāramitā.",
        "source": "T05n0220_001:0004b16_25"
    },
    {
        "source_sentence": "有情聞者必得無上正等菩提。",
        "translation": "Sentient beings who hear it will surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0004b18_26"
    },
    {
        "source_sentence": "是時，離憂及諸眷屬見此事已，歡喜踊躍歎未曾有，各隨善根供具多少，",
        "translation": "Having seen this, the relieved of sorrow and the members of his retinue were joyful and ecstatic. They praised such an unprecedented phenomenon, each according to the amount of merit they had accumulated.",
        "source": "T05n0220_001:0004b19_27"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎佛菩薩已，退坐一面。",
        "translation": "After honoring and venerating the Buddha and bodhisattva, he withdrew to sit at one side.",
        "source": "T05n0220_001:0004b20_28"
    },
    {
        "source_sentence": "如是最後世界已前，所有南方一一佛土，各有如來現為大眾宣說妙法。",
        "translation": "Thus, before this final world, in each of the southern buddha lands there was a Tathāgata who now taught the marvelous Dharma to the masses.",
        "source": "T05n0220_001:0004b21_29"
    },
    {
        "source_sentence": "是諸佛所亦各有一上首菩薩，見此大光、大地變動及佛身相，前詣佛所白言：「世尊！",
        "translation": "At each of these buddhas, there was also a supreme bodhisattva who saw this great ray of light, the earth's trembling, and the Buddha's physical appearance.",
        "source": "T05n0220_001:0004b23_30"
    },
    {
        "source_sentence": "何因何緣而有此瑞？」",
        "translation": "What are the causes and conditions for this miraculous appearance?",
        "source": "T05n0220_001:0004b25_31"
    },
    {
        "source_sentence": "時，彼彼佛各各報言：「於此北方有堪忍世界，佛號釋迦牟尼，將為菩薩說大般若波羅蜜多，",
        "translation": "To the north of here, there was a buddha named Śākyamuni who taught the bodhisattva Mahāprajñāpāramitā.",
        "source": "T05n0220_001:0004b25_32"
    },
    {
        "source_sentence": "彼佛神力故現斯瑞。」",
        "translation": "It's because of the Buddha's miraculous power that this auspicious sign appears.",
        "source": "T05n0220_001:0004b27_33"
    },
    {
        "source_sentence": "上首菩薩聞已歡喜，各各請往堪忍世界，觀禮供養佛及菩薩。",
        "translation": "The supreme chief bodhisattva was delighted to hear it, invited each one to the world of patience, paid homage, and offered support to the Buddha and the bodhisattvas.",
        "source": "T05n0220_001:0004b28_34"
    },
    {
        "source_sentence": "彼諸如來讚善聽往，各以金色千寶蓮花而告之言：「汝可持此至彼佛所，",
        "translation": "Each of those buddhas, having praised the bhikṣus who had gone there, said to them with golden lotus blossoms made of a thousand kinds of precious jewels, “Take this treasure and go to that buddha.",
        "source": "T05n0220_001:0004b29_35"
    },
    {
        "source_sentence": "具陳我詞：『致問無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "He told me in detail, 'I'm asking an immeasurable number of questions: Is there little illness and little affliction, rising and living lightly, maintaining well-balanced energy, and abiding comfortably?'",
        "source": "T05n0220_001:0004c02_36"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0004c03_37"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0004c04_38"
    },
    {
        "source_sentence": "持此蓮花以寄世尊而為佛事。』",
        "translation": "Take this lotus flower and send it to the Bhagavān for the Buddha's sake.'",
        "source": "T05n0220_001:0004c04_39"
    },
    {
        "source_sentence": "汝至彼界應住正知，觀彼佛土及諸菩薩，勿懷輕慢而自毀傷。",
        "translation": "When you reach that realm, you should abide in correct knowledge and observe the buddha-lands and bodhisattvas there, so don't harbor conceit and disparage yourself.",
        "source": "T05n0220_001:0004c05_40"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_001:0004c06_41"
    },
    {
        "source_sentence": "彼諸菩薩威德難及，悲願熏心，以大因緣而生彼土。」",
        "translation": "Those bodhisattvas' authoritative qualities are unmatched, and their minds are perfumed with compassion and vows, born in that land for great reasons.",
        "source": "T05n0220_001:0004c06_42"
    },
    {
        "source_sentence": "一一上首受花奉勅，各與無量無數菩薩、童男童女，辭佛持供發引而來，",
        "translation": "Each of the chief monks accepted the flowers and presented them to the Buddha, each accompanied by an immeasurable number of bodhisattvas, boys, and girls.",
        "source": "T05n0220_001:0004c07_43"
    },
    {
        "source_sentence": "所經佛土一一供養佛及菩薩無空過者。",
        "translation": "There's nothing wrong with making offerings to the buddhas and bodhisattvas in each of the buddha lands that are cultivated.",
        "source": "T05n0220_001:0004c09_44"
    },
    {
        "source_sentence": "到此佛所頂禮雙足，繞百千匝奉花陳事。",
        "translation": "They came to the place where the Buddha was, bowed their heads at his feet, circumambulated him one hundred thousand times, and presented offerings of flowers.",
        "source": "T05n0220_001:0004c10_45"
    },
    {
        "source_sentence": "佛受花已還散南方，佛神力故，遍諸佛土，諸花臺中各有化佛，為諸菩薩說大般若波羅蜜多，",
        "translation": "After accepting the flowers, the Buddha returned to the south and scattered them there. Because of his miraculous powers, the Buddha pervaded all the buddha-lands, and in each of the flower terraces were transformed buddhas teaching the great prajñāpāramitā for the bodhisattvas.",
        "source": "T05n0220_001:0004c11_46"
    },
    {
        "source_sentence": "令諸聞者必獲無上正等菩提。",
        "translation": "It will cause those who hear it to surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0004c13_47"
    },
    {
        "source_sentence": "上首菩薩及諸眷屬，見已歡喜歎未曾有，各隨善根供具多少，供養恭敬、尊重讚歎佛菩薩已退坐一面。",
        "translation": "Seeing this, the supreme bodhisattva and his retinues rejoiced and praised it as unprecedented, each according to how many offerings of good roots they had made, offered support, respected, venerated, and praised the Buddha and Bodhisattva, withdrew and sat to one side.",
        "source": "T05n0220_001:0004c14_48"
    },
    {
        "source_sentence": "爾時，西方盡殑伽沙等世界，最後世界名近寂靜，佛號寶焰如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "At the time, all the worlds in the west were as numerous as grains of sand in the Ganges River, and the last world was called proximate quiescence. The Buddha there was called Jewel Flame Tathāgata, Arhat, Completely Awakened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed Worthy, Tamer",
        "source": "T05n0220_001:0004c17_0"
    },
    {
        "source_sentence": "時現在彼安隱住持，為諸菩薩摩訶薩眾說大般若波羅蜜多。",
        "translation": "He now abides peacefully there and explains the great prajñāpāramitā to the bodhisattvas, mahāsattvas, and others.",
        "source": "T05n0220_001:0004c20_1"
    },
    {
        "source_sentence": "彼有菩薩名曰行慧，見此大光、大地變動及佛身相，心懷猶豫前詣佛所，",
        "translation": "“There was a bodhisattva there called Wisdom of Conduct. Seeing this great ray of light, the trembling of the earth and the characteristics of the Buddha’s body, hesitating in thought, he approached the Buddha.",
        "source": "T05n0220_001:0004c21_2"
    },
    {
        "source_sentence": "頂禮雙足白言：「世尊！",
        "translation": "He bowed his head at their feet and said, Bhagavān!",
        "source": "T05n0220_001:0004c23_3"
    },
    {
        "source_sentence": "何因何緣而有此瑞？」",
        "translation": "What are the causes and conditions for this miraculous appearance?",
        "source": "T05n0220_001:0004c23_4"
    },
    {
        "source_sentence": "時，寶焰佛告行慧菩薩摩訶薩言：「善男子！",
        "translation": "The Jewel-Flame Buddha then addressed the bodhisattva Mahāsattva of Practice Wisdom, saying, Good sons!",
        "source": "T05n0220_001:0004c24_5"
    },
    {
        "source_sentence": "從此東方盡殑伽沙等世界，最後世界名曰堪忍，佛號釋迦牟尼如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "To the east of here, in all the worlds as numerous as the grains of sand in the Ganges River as there are grains of sand in the Ganges River, is the final world called Kanyakubja. The buddhas there are named Śākyamuni Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower",
        "source": "T05n0220_001:0004c25_0"
    },
    {
        "source_sentence": "今現在彼安隱住持，將為菩薩摩訶薩眾說大般若波羅蜜多，彼佛神力故現斯瑞。」",
        "translation": "Now, that peaceful absorption is about to teach the great perfection of wisdom for the bodhisattva Mahāsattva's congregation, and it's because of the Buddha's miraculous power that this apparition appears.",
        "source": "T05n0220_001:0004c28_1"
    },
    {
        "source_sentence": "行慧聞已，歡喜踊躍重白佛言：「世尊！",
        "translation": "After hearing this, Huiquan rejoiced and jumped up and said to the Buddha again, Bhagavān!",
        "source": "T05n0220_001:0005a01_0"
    },
    {
        "source_sentence": "我今請往堪忍世界，觀禮供養釋迦牟尼如來及諸菩薩摩訶薩眾，得無礙解陀羅尼門三摩地門神通自在，",
        "translation": "I now invite you to the world Patience, to pay homage to the Tathāgata Śākyamuni and all the assemblies of bodhisattvas and mahāsattvas who have attained unobstructed mastery of the dhāraṇī teachings, concentrations, and supernormal powers.",
        "source": "T05n0220_001:0005a01_1"
    },
    {
        "source_sentence": "住最後身紹尊位者。",
        "translation": "He who abides in the final body and assumes the position of honored one.",
        "source": "T05n0220_001:0005a04_2"
    },
    {
        "source_sentence": "唯願慈悲哀愍垂許！」",
        "translation": "Please have mercy, pity, and compassion for me!",
        "source": "T05n0220_001:0005a04_3"
    },
    {
        "source_sentence": "時，寶焰佛告行慧菩薩言：「善哉！",
        "translation": "The Jewel-Flame Buddha then addressed the Bodhisattva of Practice Wisdom, saying, Good!",
        "source": "T05n0220_001:0005a05_4"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T05n0220_001:0005a05_5"
    },
    {
        "source_sentence": "今正是時，隨汝意往。」",
        "translation": "Now is the right time, go as you wish.",
        "source": "T05n0220_001:0005a06_6"
    },
    {
        "source_sentence": "即以千莖金色蓮花，其花千葉眾寶莊嚴，授行慧菩薩而誨之言：「汝持此花至釋迦牟尼佛所，",
        "translation": "He gave the bodhisattva Prajnaparamita Bodhisattva a thousand stalks of golden lotus flowers, each with a thousand petals adorned with all kinds of jewels, and said to him, “Take this flower and bring it to Śākyamuni Buddha.",
        "source": "T05n0220_001:0005a06_7"
    },
    {
        "source_sentence": "如我辭曰：『寶焰如來致問無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "As I said, 'The Tathāgata Jewel-Flame asks an immeasurable question: Is the Tathāgata less sick and less painful, is he living with ease, is his energy tempered, and lives in peace and comfort?'",
        "source": "T05n0220_001:0005a08_8"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0005a10_9"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0005a10_10"
    },
    {
        "source_sentence": "持此蓮花以寄世尊而為佛事。』",
        "translation": "Take this lotus flower and send it to the Bhagavān for the Buddha's sake.'",
        "source": "T05n0220_001:0005a10_11"
    },
    {
        "source_sentence": "汝至彼界應住正知，觀彼佛土及諸大眾，勿懷輕慢而自毀傷。",
        "translation": "When you reach that realm, you should abide in correct knowledge and observe the Buddha's land and the masses there, so don't harbor conceit and disparage yourself.",
        "source": "T05n0220_001:0005a11_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_001:0005a13_0"
    },
    {
        "source_sentence": "彼諸菩薩威德難及，悲願熏心，以大因緣而生彼土。」",
        "translation": "Those bodhisattvas' authoritative qualities are unmatched, and their minds are perfumed with compassion and vows, born in that land for great reasons.",
        "source": "T05n0220_001:0005a13_1"
    },
    {
        "source_sentence": "時，行慧菩薩受花奉勅，與無量百千俱胝那庾多出家、在家菩薩摩訶薩，",
        "translation": "At that time the enlightening being Practicing Wisdom received the flower and, by imperial edict, accompanied by innumerable hundreds of thousands of koṭis of buddha-bodhisattvas, renounced the householder’s life.",
        "source": "T05n0220_001:0005a14_2"
    },
    {
        "source_sentence": "及無數百千童男童女，頂禮佛足右繞奉辭，各持無量種種花香、寶幢、幡蓋、衣服、寶飾及餘供具發引而來，",
        "translation": "Countless hundreds of thousands of boys and girls came, bowed their heads at the Buddha’s feet, circumambulated him to his right, and greeted him. Each brought an infinite variety of flowers, fragrances, jewel banners, pennants, canopies, robes, ornaments, and other offerings.",
        "source": "T05n0220_001:0005a16_3"
    },
    {
        "source_sentence": "所經西方殑伽沙等諸佛世界，一一佛所供養恭敬、尊重讚歎無空過者。",
        "translation": "In the buddha worlds as numerous as the sands of the Ganges River in the west, there's nothing wrong with offering support, respect, veneration, and praise from each one of those buddhas.",
        "source": "T05n0220_001:0005a18_4"
    },
    {
        "source_sentence": "至此佛所頂禮雙足，繞百千匝却住一面。",
        "translation": "At this buddha’s place he bowed his head at the Buddha’s feet, circumambulated him one hundred thousand times, and withdrew to one side.",
        "source": "T05n0220_001:0005a20_5"
    },
    {
        "source_sentence": "行慧菩薩前白佛言：「世尊！",
        "translation": "The bodhisattva of practice and wisdom said to the Buddha, Bhagavān!",
        "source": "T05n0220_001:0005a21_6"
    },
    {
        "source_sentence": "從此西方盡殑伽沙等世界，最後世界名近寂靜，佛號寶焰如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵，",
        "translation": "To the west of here, in all the worlds as numerous as the grains of sand in the Ganges River as there are grains of sand in the Ganges River, is the final world called proximate quiescence. The Buddha is called Jewel Flame Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Knower of the",
        "source": "T05n0220_001:0005a21_7"
    },
    {
        "source_sentence": "致問世尊無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "The World-honored One asked immeasurable questions: Are there few illnesses and few afflictions, are they arising and abiding in ease, are their vitality tempered, and are they living in well-being?",
        "source": "T05n0220_001:0005a24_8"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0005a25_9"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0005a26_10"
    },
    {
        "source_sentence": "持此千莖金色蓮花以寄世尊而為佛事。」",
        "translation": "Take these one thousand stalks of golden lotus flowers and send them to the Bhagavān for the Buddha's service.",
        "source": "T05n0220_001:0005a26_11"
    },
    {
        "source_sentence": "時，釋迦牟尼佛受此蓮花，還散西方殑伽沙等諸佛世界。",
        "translation": "At the time, Śākyamuni Buddha accepted these lotus flowers and returned to scatter them among the buddha worlds like the sands of Ganges in the west.",
        "source": "T05n0220_001:0005a27_12"
    },
    {
        "source_sentence": "佛神力故，令此蓮花遍諸佛土，諸花臺中各有化佛結跏趺坐，為諸菩薩說大般若波羅蜜多相應之法，",
        "translation": "Because of the Buddha's miraculous power, these lotus flowers caused them to pervade all the buddha-lands, and in each of those flowered pedestals there were transformed buddhas sitting cross-legged, teaching the bodhisattvas the Dharma associated with the great prajñāpāramitā.",
        "source": "T05n0220_001:0005a28_13"
    },
    {
        "source_sentence": "有情聞者必得無上正等菩提。",
        "translation": "Sentient beings who hear it will surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0005b02_14"
    },
    {
        "source_sentence": "是時，行慧及諸眷屬見此事已，歡喜踊躍歎未曾有，各隨善根供具多少，",
        "translation": "At that moment, seeing this phenomenon, Prajnaparamita and the members of his retinue rejoiced and jumped for joy. They each praised it as unprecedented, according to the quantity of their roots of virtue in terms of how many they had accumulated.",
        "source": "T05n0220_001:0005b02_15"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎佛菩薩已，退坐一面。",
        "translation": "After honoring and venerating the Buddha and bodhisattva, he withdrew to sit at one side.",
        "source": "T05n0220_001:0005b04_16"
    },
    {
        "source_sentence": "如是最後世界已前，所有西方一一佛土，各有如來現為大眾宣說妙法。",
        "translation": "Thus, before this final world, each of the buddha lands in the West had a Tathāgata who now taught the marvelous Dharma to the masses.",
        "source": "T05n0220_001:0005b05_17"
    },
    {
        "source_sentence": "是諸佛所亦各有一上首菩薩，見此大光、大地變動及佛身相，前詣佛所白言：「世尊！",
        "translation": "At each of these buddhas, there was also a supreme bodhisattva who saw this great ray of light, the earth's trembling, and the Buddha's physical appearance.",
        "source": "T05n0220_001:0005b07_18"
    },
    {
        "source_sentence": "何因何緣而有此瑞？」",
        "translation": "What are the causes and conditions for this miraculous appearance?",
        "source": "T05n0220_001:0005b08_19"
    },
    {
        "source_sentence": "時，彼彼佛各各報言：「於此東方有堪忍世界，佛號釋迦牟尼，將為菩薩說大般若波羅蜜多，",
        "translation": "Each of those buddhas replied, “To the east of here in the world Patience is a buddha named Sakkamuni, who will teach the bodhisattva Mahāprajñāpāramitā.",
        "source": "T05n0220_001:0005b09_20"
    },
    {
        "source_sentence": "彼佛神力故現斯瑞。」",
        "translation": "It's because of the Buddha's miraculous power that this auspicious sign appears.",
        "source": "T05n0220_001:0005b11_21"
    },
    {
        "source_sentence": "上首菩薩聞已歡喜，各各請往堪忍世界，觀禮供養佛及菩薩。",
        "translation": "The supreme chief bodhisattva was delighted to hear it, invited each one to the world of patience, paid homage, and offered support to the Buddha and the bodhisattvas.",
        "source": "T05n0220_001:0005b11_22"
    },
    {
        "source_sentence": "彼諸如來讚善聽往，各以金色千寶蓮花而告之言：「汝可持此至彼佛所，",
        "translation": "Each of those buddhas, having praised the bhikṣus who had gone there, said to them with golden lotus blossoms made of a thousand kinds of precious jewels, “Take this treasure and go to that buddha.",
        "source": "T05n0220_001:0005b13_23"
    },
    {
        "source_sentence": "具陳我辭：『致問無量：少病少惱、起居輕利、氣力調和、安樂住不？",
        "translation": "He told me in detail, 'I'm asking an immeasurable number of questions: Is there little illness and little affliction, rising up and living lightly, maintaining well-balanced energy, and abiding comfortably?'",
        "source": "T05n0220_001:0005b15_0"
    },
    {
        "source_sentence": "世事可忍不？",
        "translation": "Can we tolerate worldly affairs?",
        "source": "T05n0220_001:0005b16_1"
    },
    {
        "source_sentence": "眾生易度不？",
        "translation": "Is it easy to save sentient beings?",
        "source": "T05n0220_001:0005b16_2"
    },
    {
        "source_sentence": "持此蓮花以寄世尊而為佛事。』",
        "translation": "Take this lotus flower and send it to the Bhagavān for the Buddha's sake.'",
        "source": "T05n0220_001:0005b17_3"
    },
    {
        "source_sentence": "汝至彼界應住正知，觀彼佛土及諸菩薩，勿懷輕慢而自毀傷。",
        "translation": "When you reach that realm, you should abide in correct knowledge and observe the buddha-lands and bodhisattvas there, so don't harbor conceit and disparage yourself.",
        "source": "T05n0220_001:0005b17_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_001:0005b19_5"
    },
    {
        "source_sentence": "彼諸菩薩威德難及，悲願熏心，以大因緣而生彼土。」",
        "translation": "Those bodhisattvas' authoritative qualities are unmatched, and their minds are perfumed with compassion and vows, born in that land for great reasons.",
        "source": "T05n0220_001:0005b19_6"
    },
    {
        "source_sentence": "一一上首受花奉勅，各與無量無數菩薩、童男童女，辭佛持供發引而來，",
        "translation": "Each of the chief monks accepted the flowers and presented them to the Buddha, each accompanied by an immeasurable number of bodhisattvas, boys, and girls.",
        "source": "T05n0220_001:0005b20_7"
    },
    {
        "source_sentence": "所經佛土一一供養佛及菩薩無空過者。",
        "translation": "There's nothing wrong with making offerings to the buddhas and bodhisattvas in each of the buddha lands that are cultivated.",
        "source": "T05n0220_001:0005b22_8"
    },
    {
        "source_sentence": "到此佛所頂禮雙足，繞百千匝奉花陳事。",
        "translation": "They came to the place where the Buddha was, bowed their heads at his feet, circumambulated him one hundred thousand times, and presented offerings of flowers.",
        "source": "T05n0220_001:0005b23_9"
    },
    {
        "source_sentence": "佛受花已還散西方，佛神力故，遍諸佛土，諸花臺中各有化佛，為諸菩薩說大般若波羅蜜多，",
        "translation": "After accepting the flowers, the Buddha returned to the west and scattered them. Because of the spiritual power of the buddhas, he pervaded all the buddha-lands, each with a magical buddha on his flower dais teaching the bodhisattvas the great prajñāpāramitā.",
        "source": "T05n0220_001:0005b24_10"
    },
    {
        "source_sentence": "令諸聞者必獲無上正等菩提。",
        "translation": "It will cause those who hear it to surely attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_001:0005b26_11"
    },
    {
        "source_sentence": "上首菩薩及諸眷屬，見已歡喜歎未曾有，各隨善根供具多少，供養恭敬、尊重讚歎佛菩薩已，",
        "translation": "The supreme enlightening beings and their retinues, seeing this unprecedented phenomenon, rejoiced and praised it. Each of them, according to the amount of goodness they had accumulated, offered support, honored, revered, and venerated the buddhas and enlightening beings.",
        "source": "T05n0220_001:0005b26_12"
    },
    {
        "source_sentence": "退坐一面。",
        "translation": "He withdrew and sat to one side.",
        "source": "T05n0220_001:0005b29_13"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1",
        "source": "T05n0220_001:0005c01_0"
    }
]