[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 108",
        "source": "T05n0220_188:1009a09_0"
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T05n0220_188:1009a10_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T05n0220_188:1009a12_0"
    },
    {
        "source_sentence": "初分難信解品第三十四之七",
        "translation": "The Thirty-fourth and Seventh Chapter of the First Part of the Discourse on the Difficulties of Belief",
        "source": "T05n0220_188:1009a13_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T05n0220_188:1009a14_0"
    },
    {
        "source_sentence": "我清淨即四念住清淨，四念住清淨即我清淨。",
        "translation": "The purity of self is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of self.",
        "source": "T05n0220_188:1009a14_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009a15_2"
    },
    {
        "source_sentence": "是我清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009a15_3"
    },
    {
        "source_sentence": "我清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，四正斷乃至八聖道支清淨即我清淨。",
        "translation": "The purity of self is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path, and",
        "source": "T05n0220_188:1009a16_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009a18_5"
    },
    {
        "source_sentence": "是我清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the fourfold correct elimination and even the eightfold noble path are not two, not separated by duality, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009a19_6"
    },
    {
        "source_sentence": "「有情清淨即四念住清淨，四念住清淨即有情清淨。",
        "translation": "The purity of sentient beings is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of sentient beings.",
        "source": "T05n0220_188:1009a20_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009a21_8"
    },
    {
        "source_sentence": "是有情清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of sentient beings and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009a22_0"
    },
    {
        "source_sentence": "有情清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of sentient beings is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the",
        "source": "T05n0220_188:1009a23_1"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即有情清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eight noble factors of the path are the purity of sentient beings.",
        "source": "T05n0220_188:1009a24_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009a25_3"
    },
    {
        "source_sentence": "是有情清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of sentient beings and the purity of the fourfold correct elimination and even the eightfold noble path are not two, not separated, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009a25_4"
    },
    {
        "source_sentence": "「命者清淨即四念住清淨，四念住清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of the living being.",
        "source": "T05n0220_188:1009a27_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009a28_6"
    },
    {
        "source_sentence": "是命者清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the person who lives and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009a28_7"
    },
    {
        "source_sentence": "命者清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of the vital principle is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the",
        "source": "T05n0220_188:1009b01_0"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即命者清淨。",
        "translation": "The fourth is the purity of correctly eliminating and up to the purity of the eightfold noble path, which is the purity of the living being.",
        "source": "T05n0220_188:1009b02_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b03_2"
    },
    {
        "source_sentence": "是命者清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of the vital principle and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated by duality, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009b03_3"
    },
    {
        "source_sentence": "「生者清淨即四念住清淨，四念住清淨即生者清淨。",
        "translation": "The purity of the living being is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of the living being.",
        "source": "T05n0220_188:1009b05_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b06_5"
    },
    {
        "source_sentence": "是生者清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the person who gives rise to it and the purity of the four abodes of mindfulness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009b06_6"
    },
    {
        "source_sentence": "生者清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of the living being is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path",
        "source": "T05n0220_188:1009b07_7"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即生者清淨。",
        "translation": "The fourth is the purity of correctly eliminating and up to the purity of the eightfold noble path, which is the purity of those who are born.",
        "source": "T05n0220_188:1009b09_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b10_9"
    },
    {
        "source_sentence": "是生者清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the arising and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated by duality, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009b10_10"
    },
    {
        "source_sentence": "「養育者清淨即四念住清淨，四念住清淨即養育者清淨。",
        "translation": "The purity of the nurturing is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of the nurturing.",
        "source": "T05n0220_188:1009b11_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b13_12"
    },
    {
        "source_sentence": "是養育者清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009b13_13"
    },
    {
        "source_sentence": "養育者清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of those who nourish means the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the",
        "source": "T05n0220_188:1009b14_14"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即養育者清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eight noble factors of the path are the purity of nurturing.",
        "source": "T05n0220_188:1009b16_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b17_16"
    },
    {
        "source_sentence": "是養育者清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated by duality, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009b17_17"
    },
    {
        "source_sentence": "「士夫清淨即四念住清淨，四念住清淨即士夫清淨。",
        "translation": "The purity of men and women is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of men and women.",
        "source": "T05n0220_188:1009b18_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b20_19"
    },
    {
        "source_sentence": "是士夫清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of these men and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009b20_20"
    },
    {
        "source_sentence": "士夫清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of men is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T05n0220_188:1009b21_21"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即士夫清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eightfold noble path are the purity of men and women.",
        "source": "T05n0220_188:1009b23_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b23_1"
    },
    {
        "source_sentence": "是士夫清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of these men and the purity of the fourfold correct elimination and even the eightfold noble path are not two, not separated, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009b24_2"
    },
    {
        "source_sentence": "「補特伽羅清淨即四念住清淨，四念住清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness are the purity of the pudgala.",
        "source": "T05n0220_188:1009b25_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009b27_4"
    },
    {
        "source_sentence": "是補特伽羅清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the four abodes of mindfulness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009b27_5"
    },
    {
        "source_sentence": "補特伽羅清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of the pudgala is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the",
        "source": "T05n0220_188:1009b28_6"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即補特伽羅清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eightfold noble path is the purity of the pudgala.",
        "source": "T05n0220_188:1009c01_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c02_8"
    },
    {
        "source_sentence": "是補特伽羅清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the fourfold correct elimination and even the eightfold noble path are not two, not separated by duality, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009c02_9"
    },
    {
        "source_sentence": "「意生清淨即四念住清淨，四念住清淨即意生清淨。",
        "translation": "The purity of mind-made is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of mind-made.",
        "source": "T05n0220_188:1009c04_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c05_11"
    },
    {
        "source_sentence": "是意生清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generating and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009c05_12"
    },
    {
        "source_sentence": "意生清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of mind-made is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path",
        "source": "T05n0220_188:1009c06_13"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即意生清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eight noble factors of the path are the purity of mind-generating.",
        "source": "T05n0220_188:1009c08_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c09_15"
    },
    {
        "source_sentence": "是意生清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009c09_16"
    },
    {
        "source_sentence": "「儒童清淨即四念住清淨，四念住清淨即儒童清淨。",
        "translation": "The purity of the youthful boy means the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness means the purity of the youthful boy.",
        "source": "T05n0220_188:1009c10_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c12_0"
    },
    {
        "source_sentence": "是儒童清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009c12_1"
    },
    {
        "source_sentence": "儒童清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of youth is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T05n0220_188:1009c13_2"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即儒童清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eightfold noble path is the purity of the youthful boy.",
        "source": "T05n0220_188:1009c14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c15_4"
    },
    {
        "source_sentence": "是儒童清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the fourfold correct elimination and even the eightfold noble path are not two, not separated, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009c16_0"
    },
    {
        "source_sentence": "「作者清淨即四念住清淨，四念住清淨即作者清淨。",
        "translation": "The purity of the author is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of the author.",
        "source": "T05n0220_188:1009c17_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c18_2"
    },
    {
        "source_sentence": "是作者清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the four abodes of mindfulness are pure, which are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009c18_3"
    },
    {
        "source_sentence": "作者清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of the author is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T05n0220_188:1009c20_4"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即作者清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eight noble factors of the path are the author's purity.",
        "source": "T05n0220_188:1009c21_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c22_6"
    },
    {
        "source_sentence": "是作者清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009c22_7"
    },
    {
        "source_sentence": "「受者清淨即四念住清淨，四念住清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of the recipient.",
        "source": "T05n0220_188:1009c24_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c25_9"
    },
    {
        "source_sentence": "是受者清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1009c25_10"
    },
    {
        "source_sentence": "受者清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of the experiencer is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path",
        "source": "T05n0220_188:1009c26_11"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即受者清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eightfold noble path is the purity of the recipient.",
        "source": "T05n0220_188:1009c28_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1009c29_13"
    },
    {
        "source_sentence": "是受者清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated, not distinct, and not eliminated.",
        "source": "T05n0220_188:1009c29_14"
    },
    {
        "source_sentence": "「知者清淨即四念住清淨，四念住清淨即知者清淨。",
        "translation": "The purity of knowing is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of knowing.",
        "source": "T05n0220_188:1010a02_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a03_16"
    },
    {
        "source_sentence": "是知者清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010a03_17"
    },
    {
        "source_sentence": "知者清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of the knower is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path",
        "source": "T05n0220_188:1010a04_18"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即知者清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eightfold noble path is the purity of knowing.",
        "source": "T05n0220_188:1010a06_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a07_0"
    },
    {
        "source_sentence": "是知者清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of the knower and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated by duality, not distinct, and not eliminated.",
        "source": "T05n0220_188:1010a07_1"
    },
    {
        "source_sentence": "「見者清淨即四念住清淨，四念住清淨即見者清淨。",
        "translation": "The purity of the seer is the purity of the four abodes of mindfulness, and the purity of the four abodes of mindfulness is the purity of the seer.",
        "source": "T05n0220_188:1010a08_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a09_3"
    },
    {
        "source_sentence": "是見者清淨與四念住清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the viewer and the purity of the four abodes of mindfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010a10_4"
    },
    {
        "source_sentence": "見者清淨即四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "The purity of those who see is the purity of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path",
        "source": "T05n0220_188:1010a11_5"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨即見者清淨。",
        "translation": "The purity of the fourfold correct elimination and even the purity of the eightfold noble path is the purity of the viewer.",
        "source": "T05n0220_188:1010a12_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a13_7"
    },
    {
        "source_sentence": "是見者清淨與四正斷乃至八聖道支清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of those who see and the purity of the fourfold correct elimination and even the purity of the eightfold noble path are not two, not separated, not distinct, and not eliminated.",
        "source": "T05n0220_188:1010a13_8"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T05n0220_188:1010a16_0"
    },
    {
        "source_sentence": "我清淨即空解脫門清淨，空解脫門清淨即我清淨。",
        "translation": "The purity of self is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of self.",
        "source": "T05n0220_188:1010a16_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a17_2"
    },
    {
        "source_sentence": "是我清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010a17_3"
    },
    {
        "source_sentence": "我清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即我清淨。",
        "translation": "The purity of self is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of self.",
        "source": "T05n0220_188:1010a18_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a20_5"
    },
    {
        "source_sentence": "是我清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010a20_6"
    },
    {
        "source_sentence": "「有情清淨即空解脫門清淨，空解脫門清淨即有情清淨。",
        "translation": "The purity of sentient beings is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of sentient beings.",
        "source": "T05n0220_188:1010a21_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a23_8"
    },
    {
        "source_sentence": "是有情清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of sentient beings and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010a23_9"
    },
    {
        "source_sentence": "有情清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即有情清淨。",
        "translation": "The purity of sentient beings is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of sentient beings.",
        "source": "T05n0220_188:1010a24_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a26_11"
    },
    {
        "source_sentence": "是有情清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of sentient beings and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010a26_12"
    },
    {
        "source_sentence": "「命者清淨即空解脫門清淨，空解脫門清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the living being.",
        "source": "T05n0220_188:1010a28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010a29_1"
    },
    {
        "source_sentence": "是命者清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the living being and the purity of the liberation gate of emptiness are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010a29_2"
    },
    {
        "source_sentence": "命者清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the living being.",
        "source": "T05n0220_188:1010b01_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b03_4"
    },
    {
        "source_sentence": "是命者清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the living being and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b03_5"
    },
    {
        "source_sentence": "「生者清淨即空解脫門清淨，空解脫門清淨即生者清淨。",
        "translation": "The purity of the living being is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the living being.",
        "source": "T05n0220_188:1010b05_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b06_7"
    },
    {
        "source_sentence": "是生者清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the birther and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b06_8"
    },
    {
        "source_sentence": "生者清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即生者清淨。",
        "translation": "The purity of the arising is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the arising.",
        "source": "T05n0220_188:1010b07_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b09_10"
    },
    {
        "source_sentence": "是生者清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the birther and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b09_11"
    },
    {
        "source_sentence": "「養育者清淨即空解脫門清淨，空解脫門清淨即養育者清淨。",
        "translation": "The purity of the nurturing is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the nurturing.",
        "source": "T05n0220_188:1010b11_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b12_13"
    },
    {
        "source_sentence": "是養育者清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b12_14"
    },
    {
        "source_sentence": "養育者清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即養育者清淨。",
        "translation": "The purity of the nurturing is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the nurturing.",
        "source": "T05n0220_188:1010b14_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b15_16"
    },
    {
        "source_sentence": "是養育者清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b16_0"
    },
    {
        "source_sentence": "「士夫清淨即空解脫門清淨，空解脫門清淨即士夫清淨。",
        "translation": "The purity of the士夫 is the purity of the gate of liberation through emptiness, and the purity of the gate of liberation through emptiness is the purity of the士夫.",
        "source": "T05n0220_188:1010b17_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b18_2"
    },
    {
        "source_sentence": "是士夫清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this man and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b19_0"
    },
    {
        "source_sentence": "士夫清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即士夫清淨。",
        "translation": "The purity of men is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of men.",
        "source": "T05n0220_188:1010b20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b21_2"
    },
    {
        "source_sentence": "是士夫清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "This man's purity and the purity of the liberation gate of marklessness and wishlessness are pure because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T05n0220_188:1010b22_3"
    },
    {
        "source_sentence": "「補特伽羅清淨即空解脫門清淨，空解脫門清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the pudgala.",
        "source": "T05n0220_188:1010b23_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b25_5"
    },
    {
        "source_sentence": "是補特伽羅清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b25_6"
    },
    {
        "source_sentence": "補特伽羅清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the pudgala.",
        "source": "T05n0220_188:1010b26_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010b28_8"
    },
    {
        "source_sentence": "是補特伽羅清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the liberation gate of marklessness and wishlessness are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010b28_9"
    },
    {
        "source_sentence": "「意生清淨即空解脫門清淨，空解脫門清淨即意生清淨。",
        "translation": "The purity of mind-generating is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of mind-generating.",
        "source": "T05n0220_188:1010c01_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c02_11"
    },
    {
        "source_sentence": "是意生清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c02_12"
    },
    {
        "source_sentence": "意生清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即意生清淨。",
        "translation": "The purity of mind-generation is the purity of the liberation gate of signlessness and wishlessness, and the purity of the liberation gate of signlessness and wishlessness is the purity of mind-generation.",
        "source": "T05n0220_188:1010c04_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c05_14"
    },
    {
        "source_sentence": "是意生清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c05_15"
    },
    {
        "source_sentence": "「儒童清淨即空解脫門清淨，空解脫門清淨即儒童清淨。",
        "translation": "The purity of the youthful boy is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the youthful boy.",
        "source": "T05n0220_188:1010c07_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c08_17"
    },
    {
        "source_sentence": "是儒童清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the youthful boy and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c08_18"
    },
    {
        "source_sentence": "儒童清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即儒童清淨。",
        "translation": "The purity of the youthful boy is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the youthful boy.",
        "source": "T05n0220_188:1010c10_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c11_20"
    },
    {
        "source_sentence": "是儒童清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c12_0"
    },
    {
        "source_sentence": "「作者清淨即空解脫門清淨，空解脫門清淨即作者清淨。",
        "translation": "The purity of the author is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the author.",
        "source": "T05n0220_188:1010c13_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c14_2"
    },
    {
        "source_sentence": "是作者清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c14_3"
    },
    {
        "source_sentence": "作者清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即作者清淨。",
        "translation": "The author's purity means the liberation gate of marklessness and wishlessness is purified, and the liberation gate of marklessness and wishlessness is purified, which means the author's purity.",
        "source": "T05n0220_188:1010c16_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c17_5"
    },
    {
        "source_sentence": "是作者清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c18_6"
    },
    {
        "source_sentence": "「受者清淨即空解脫門清淨，空解脫門清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the recipient.",
        "source": "T05n0220_188:1010c19_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c20_8"
    },
    {
        "source_sentence": "是受者清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c21_0"
    },
    {
        "source_sentence": "受者清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the recipient.",
        "source": "T05n0220_188:1010c22_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c24_0"
    },
    {
        "source_sentence": "是受者清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c24_1"
    },
    {
        "source_sentence": "「知者清淨即空解脫門清淨，空解脫門清淨即知者清淨。",
        "translation": "The purity of the knower is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the knower.",
        "source": "T05n0220_188:1010c25_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1010c26_3"
    },
    {
        "source_sentence": "是知者清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1010c27_4"
    },
    {
        "source_sentence": "知者清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即知者清淨。",
        "translation": "The purity of the knower is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the knower.",
        "source": "T05n0220_188:1010c28_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a01_6"
    },
    {
        "source_sentence": "是知者清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a01_7"
    },
    {
        "source_sentence": "「見者清淨即空解脫門清淨，空解脫門清淨即見者清淨。",
        "translation": "The purity of the viewer is the purity of the liberation gate of emptiness, and the purity of the liberation gate of emptiness is the purity of the viewer.",
        "source": "T05n0220_188:1011a02_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a04_0"
    },
    {
        "source_sentence": "是見者清淨與空解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the viewer and the purity of the liberation gate of emptiness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a04_1"
    },
    {
        "source_sentence": "見者清淨即無相、無願解脫門清淨，無相、無願解脫門清淨即見者清淨。",
        "translation": "The purity of the viewer is the purity of the liberation gate of marklessness and wishlessness, and the purity of the liberation gate of marklessness and wishlessness is the purity of the viewer.",
        "source": "T05n0220_188:1011a05_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a07_3"
    },
    {
        "source_sentence": "是見者清淨與無相、無願解脫門清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the viewer and the purity of the liberation gate of marklessness and wishlessness are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a07_4"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T05n0220_188:1011a09_0"
    },
    {
        "source_sentence": "我清淨即菩薩十地清淨，菩薩十地清淨即我清淨。",
        "translation": "The purity of self is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of self.",
        "source": "T05n0220_188:1011a09_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a10_2"
    },
    {
        "source_sentence": "是我清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a10_3"
    },
    {
        "source_sentence": "「有情清淨即菩薩十地清淨，菩薩十地清淨即有情清淨。",
        "translation": "The purity of sentient beings is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of sentient beings.",
        "source": "T05n0220_188:1011a11_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a13_5"
    },
    {
        "source_sentence": "是有情清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of sentient beings and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a13_6"
    },
    {
        "source_sentence": "「命者清淨即菩薩十地清淨，菩薩十地清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the living being.",
        "source": "T05n0220_188:1011a14_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a15_8"
    },
    {
        "source_sentence": "是命者清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the living being and the purity of the bodhisattva's ten stages are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a16_9"
    },
    {
        "source_sentence": "「生者清淨即菩薩十地清淨，菩薩十地清淨即生者清淨。",
        "translation": "The purity of the living being is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the living being.",
        "source": "T05n0220_188:1011a17_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a18_11"
    },
    {
        "source_sentence": "是生者清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the person who gives rise to it and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a18_12"
    },
    {
        "source_sentence": "「養育者清淨即菩薩十地清淨，菩薩十地清淨即養育者清淨。",
        "translation": "The purity of the nurturing is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the nurturing.",
        "source": "T05n0220_188:1011a20_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a21_14"
    },
    {
        "source_sentence": "是養育者清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a21_15"
    },
    {
        "source_sentence": "「士夫清淨即菩薩十地清淨，菩薩十地清淨即士夫清淨。",
        "translation": "The purity of men is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of men.",
        "source": "T05n0220_188:1011a23_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a24_17"
    },
    {
        "source_sentence": "是士夫清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this man and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a24_18"
    },
    {
        "source_sentence": "「補特伽羅清淨即菩薩十地清淨，菩薩十地清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the pudgala.",
        "source": "T05n0220_188:1011a25_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011a27_20"
    },
    {
        "source_sentence": "是補特伽羅清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the bodhisattva's ten stages are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011a27_21"
    },
    {
        "source_sentence": "「意生清淨即菩薩十地清淨，菩薩十地清淨即意生清淨。",
        "translation": "The purity of mind-made is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of mind-made.",
        "source": "T05n0220_188:1011a28_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b01_23"
    },
    {
        "source_sentence": "是意生清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-made and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b01_24"
    },
    {
        "source_sentence": "「儒童清淨即菩薩十地清淨，菩薩十地清淨即儒童清淨。",
        "translation": "The purity of the youthful boy is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the youthful boy.",
        "source": "T05n0220_188:1011b02_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b04_0"
    },
    {
        "source_sentence": "是儒童清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the bodhisattva's ten stages are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b04_1"
    },
    {
        "source_sentence": "「作者清淨即菩薩十地清淨，菩薩十地清淨即作者清淨。",
        "translation": "The author's purity is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the author's purity.",
        "source": "T05n0220_188:1011b05_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b06_3"
    },
    {
        "source_sentence": "是作者清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the bodhisattva's purity of the ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b06_4"
    },
    {
        "source_sentence": "「受者清淨即菩薩十地清淨，菩薩十地清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the recipient.",
        "source": "T05n0220_188:1011b08_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b09_6"
    },
    {
        "source_sentence": "是受者清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b09_7"
    },
    {
        "source_sentence": "「知者清淨即菩薩十地清淨，菩薩十地清淨即知者清淨。",
        "translation": "The purity of the knower is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the knower.",
        "source": "T05n0220_188:1011b11_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b12_1"
    },
    {
        "source_sentence": "是知者清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the knower and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b12_2"
    },
    {
        "source_sentence": "「見者清淨即菩薩十地清淨，菩薩十地清淨即見者清淨。",
        "translation": "The purity of the seer is the purity of the bodhisattva's ten stages, and the purity of the bodhisattva's ten stages is the purity of the seer.",
        "source": "T05n0220_188:1011b13_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b15_4"
    },
    {
        "source_sentence": "是見者清淨與菩薩十地清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of those who see and the purity of the bodhisattva's ten stages are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b15_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T05n0220_188:1011b17_0"
    },
    {
        "source_sentence": "我清淨即五眼清淨，五眼清淨即我清淨。",
        "translation": "The purity of self is the purity of the five eyes, and the purity of the five eyes is the purity of self.",
        "source": "T05n0220_188:1011b17_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b18_2"
    },
    {
        "source_sentence": "是我清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the five eyes are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b18_3"
    },
    {
        "source_sentence": "我清淨即六神通清淨，六神通清淨即我清淨。",
        "translation": "The purity of self is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of self.",
        "source": "T05n0220_188:1011b19_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b20_5"
    },
    {
        "source_sentence": "是我清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "Because the purity of self and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b20_6"
    },
    {
        "source_sentence": "「有情清淨即五眼清淨，五眼清淨即有情清淨。",
        "translation": "The purity of sentient beings means the purity of the five eyes, and the purity of the five eyes means the purity of sentient beings.",
        "source": "T05n0220_188:1011b22_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b23_1"
    },
    {
        "source_sentence": "是有情清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of sentient beings and the purity of the five eyes are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b23_2"
    },
    {
        "source_sentence": "有情清淨即六神通清淨，六神通清淨即有情清淨。",
        "translation": "The purity of sentient beings is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of sentient beings.",
        "source": "T05n0220_188:1011b24_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b25_4"
    },
    {
        "source_sentence": "是有情清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of sentient beings and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b25_5"
    },
    {
        "source_sentence": "「命者清淨即五眼清淨，五眼清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the five eyes, and the purity of the five eyes is the purity of the living being.",
        "source": "T05n0220_188:1011b27_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011b28_7"
    },
    {
        "source_sentence": "是命者清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the living being and the purity of the five eyes are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011b28_8"
    },
    {
        "source_sentence": "命者清淨即六神通清淨，六神通清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of the living being.",
        "source": "T05n0220_188:1011b29_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c01_10"
    },
    {
        "source_sentence": "是命者清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the living being and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c01_11"
    },
    {
        "source_sentence": "「生者清淨即五眼清淨，五眼清淨即生者清淨。",
        "translation": "The purity of the living being is the purity of the five eyes, and the purity of the five eyes is the purity of the living being.",
        "source": "T05n0220_188:1011c03_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c04_13"
    },
    {
        "source_sentence": "是生者清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the arising person and the purity of the five eyes are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c04_14"
    },
    {
        "source_sentence": "生者清淨即六神通清淨，六神通清淨即生者清淨。",
        "translation": "The purity of the living being is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of the living being.",
        "source": "T05n0220_188:1011c05_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c06_16"
    },
    {
        "source_sentence": "是生者清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the person who gives rise to it and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c06_17"
    },
    {
        "source_sentence": "「養育者清淨即五眼清淨，五眼清淨即養育者清淨。",
        "translation": "The purity of the nurturing is the purity of the five eyes, and the purity of the five eyes is the purity of the nurturing.",
        "source": "T05n0220_188:1011c08_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c09_19"
    },
    {
        "source_sentence": "是養育者清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the nurturing practitioner and the purity of the five eyes are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c09_20"
    },
    {
        "source_sentence": "養育者清淨即六神通清淨，六神通清淨即養育者清淨。",
        "translation": "The purity of the nurturing is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of the nurturing.",
        "source": "T05n0220_188:1011c10_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c12_22"
    },
    {
        "source_sentence": "是養育者清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c12_23"
    },
    {
        "source_sentence": "「士夫清淨即五眼清淨，五眼清淨即士夫清淨。",
        "translation": "The purity of the man's husband is the purity of the five eyes, and the purity of the five eyes is the purity of the man's husband.",
        "source": "T05n0220_188:1011c13_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c14_25"
    },
    {
        "source_sentence": "是士夫清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this man and the purity of the five eyes are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c14_26"
    },
    {
        "source_sentence": "士夫清淨即六神通清淨，六神通清淨即士夫清淨。",
        "translation": "The purity of men and women is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of men and women.",
        "source": "T05n0220_188:1011c16_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c17_1"
    },
    {
        "source_sentence": "是士夫清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of these men and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c17_2"
    },
    {
        "source_sentence": "「補特伽羅清淨即五眼清淨，五眼清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the five eyes, and the purity of the five eyes is the purity of the pudgala.",
        "source": "T05n0220_188:1011c18_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c19_4"
    },
    {
        "source_sentence": "是補特伽羅清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the five eyes are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c20_5"
    },
    {
        "source_sentence": "補特伽羅清淨即六神通清淨，六神通清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of the pudgala.",
        "source": "T05n0220_188:1011c21_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c22_7"
    },
    {
        "source_sentence": "是補特伽羅清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c22_8"
    },
    {
        "source_sentence": "「意生清淨即五眼清淨，五眼清淨即意生清淨。",
        "translation": "The purity of mind-made is the purity of the five eyes, and the purity of the five eyes is the purity of mind-made.",
        "source": "T05n0220_188:1011c24_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c25_10"
    },
    {
        "source_sentence": "是意生清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-made and the purity of the five eyes are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c25_11"
    },
    {
        "source_sentence": "意生清淨即六神通清淨，六神通清淨即意生清淨。",
        "translation": "The purity of mind-made is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of mind-made.",
        "source": "T05n0220_188:1011c26_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1011c27_13"
    },
    {
        "source_sentence": "是意生清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1011c28_0"
    },
    {
        "source_sentence": "「儒童清淨即五眼清淨，五眼清淨即儒童清淨。",
        "translation": "The purity of the youthful boy means the purity of the five eyes, and the purity of the five eyes means the purity of the youthful boy.",
        "source": "T05n0220_188:1011c29_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a01_2"
    },
    {
        "source_sentence": "是儒童清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the five eyes are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a01_3"
    },
    {
        "source_sentence": "儒童清淨即六神通清淨，六神通清淨即儒童清淨。",
        "translation": "The purity of the youthful boy means the purity of the six supernormal powers, and the purity of the six supernormal powers means the purity of the youthful boy.",
        "source": "T05n0220_188:1012a02_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a03_5"
    },
    {
        "source_sentence": "是儒童清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of this youthful boy and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a04_0"
    },
    {
        "source_sentence": "「作者清淨即五眼清淨，五眼清淨即作者清淨。",
        "translation": "The author's purity is the purity of the five eyes, and the purity of the five eyes is the author's purity.",
        "source": "T05n0220_188:1012a05_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a06_2"
    },
    {
        "source_sentence": "是作者清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the five eyes' purity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a06_3"
    },
    {
        "source_sentence": "作者清淨即六神通清淨，六神通清淨即作者清淨。",
        "translation": "The author's purity is the purity of the six supernormal powers, and the purity of the six supernormal powers is the author's purity.",
        "source": "T05n0220_188:1012a07_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a08_5"
    },
    {
        "source_sentence": "是作者清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a09_0"
    },
    {
        "source_sentence": "「受者清淨即五眼清淨，五眼清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the five eyes, and the purity of the five eyes is the purity of the recipient.",
        "source": "T05n0220_188:1012a10_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a11_2"
    },
    {
        "source_sentence": "是受者清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the five eyes are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a11_3"
    },
    {
        "source_sentence": "受者清淨即六神通清淨，六神通清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of the recipient.",
        "source": "T05n0220_188:1012a12_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a13_5"
    },
    {
        "source_sentence": "是受者清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a14_0"
    },
    {
        "source_sentence": "「知者清淨即五眼清淨，五眼清淨即知者清淨。",
        "translation": "The purity of the knower is the purity of the five eyes, and the purity of the five eyes is the purity of the knower.",
        "source": "T05n0220_188:1012a15_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a16_2"
    },
    {
        "source_sentence": "是知者清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the knower and the purity of the five eyes are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a16_3"
    },
    {
        "source_sentence": "知者清淨即六神通清淨，六神通清淨即知者清淨。",
        "translation": "The purity of knowing is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of knowing.",
        "source": "T05n0220_188:1012a17_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a18_5"
    },
    {
        "source_sentence": "是知者清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a19_0"
    },
    {
        "source_sentence": "「見者清淨即五眼清淨，五眼清淨即見者清淨。",
        "translation": "The purity of the seer is the purity of the five eyes, and the purity of the five eyes is the purity of the seer.",
        "source": "T05n0220_188:1012a20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a21_2"
    },
    {
        "source_sentence": "是見者清淨與五眼清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the viewer and the purity of the five eyes are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a21_3"
    },
    {
        "source_sentence": "見者清淨即六神通清淨，六神通清淨即見者清淨。",
        "translation": "The purity of the seer is the purity of the six supernormal powers, and the purity of the six supernormal powers is the purity of the seer.",
        "source": "T05n0220_188:1012a22_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a23_5"
    },
    {
        "source_sentence": "是見者清淨與六神通清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of those who see and the purity of the six supernormal powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a24_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T05n0220_188:1012a25_1"
    },
    {
        "source_sentence": "我清淨即佛十力清淨，佛十力清淨即我清淨。",
        "translation": "The purity of self is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of self.",
        "source": "T05n0220_188:1012a25_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012a26_3"
    },
    {
        "source_sentence": "是我清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the Buddha's ten powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012a26_4"
    },
    {
        "source_sentence": "我清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of self is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 unique qualities of buddhahood.",
        "source": "T05n0220_188:1012a27_5"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即我清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas is the purity of self.",
        "source": "T05n0220_188:1012a29_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b01_7"
    },
    {
        "source_sentence": "是我清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the four fearlessnesses and even the 18 Buddha-principles are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b01_8"
    },
    {
        "source_sentence": "「有情清淨即佛十力清淨，佛十力清淨即有情清淨。",
        "translation": "The purity of sentient beings is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of sentient beings.",
        "source": "T05n0220_188:1012b03_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b04_10"
    },
    {
        "source_sentence": "是有情清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of sentient beings and the purity of the Buddha's ten powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b04_11"
    },
    {
        "source_sentence": "有情清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of sentient beings is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012b06_0"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即有情清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the Buddha are the purity of sentient beings.",
        "source": "T05n0220_188:1012b07_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b08_2"
    },
    {
        "source_sentence": "是有情清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of sentient beings and the purity of the four fearlessnesses and even the 18 Buddha-principles are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b08_3"
    },
    {
        "source_sentence": "「命者清淨即佛十力清淨，佛十力清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of the living being.",
        "source": "T05n0220_188:1012b10_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b11_5"
    },
    {
        "source_sentence": "是命者清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the living being and the purity of the Buddha's ten powers are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b12_0"
    },
    {
        "source_sentence": "命者清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of the vital principle is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012b13_1"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即命者清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas, that is, the purity of the living being.",
        "source": "T05n0220_188:1012b14_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b16_3"
    },
    {
        "source_sentence": "是命者清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the person who lives and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b16_4"
    },
    {
        "source_sentence": "「生者清淨即佛十力清淨，佛十力清淨即生者清淨。",
        "translation": "The purity of the living being is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of the living being.",
        "source": "T05n0220_188:1012b18_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b19_1"
    },
    {
        "source_sentence": "是生者清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the person who gives rise to it and the purity of the Buddha's ten powers are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b19_2"
    },
    {
        "source_sentence": "生者清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of the living being is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012b20_3"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即生者清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas are the purity of those who are born.",
        "source": "T05n0220_188:1012b22_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b23_5"
    },
    {
        "source_sentence": "是生者清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of those who are born and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b23_6"
    },
    {
        "source_sentence": "「養育者清淨即佛十力清淨，佛十力清淨即養育者清淨。",
        "translation": "The purity of the nurturing is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of the nurturing.",
        "source": "T05n0220_188:1012b25_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012b26_8"
    },
    {
        "source_sentence": "是養育者清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the Buddha's ten powers are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012b26_9"
    },
    {
        "source_sentence": "養育者清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of the nurturing is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012b28_10"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即養育者清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas is the purity of nurturing.",
        "source": "T05n0220_188:1012b29_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c02_0"
    },
    {
        "source_sentence": "是養育者清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c02_1"
    },
    {
        "source_sentence": "「士夫清淨即佛十力清淨，佛十力清淨即士夫清淨。",
        "translation": "The purity of men is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of men.",
        "source": "T05n0220_188:1012c04_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c05_1"
    },
    {
        "source_sentence": "是士夫清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of these men and the purity of the Buddha's ten powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c05_2"
    },
    {
        "source_sentence": "士夫清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of men is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012c06_3"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即士夫清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas are the purity of men and women.",
        "source": "T05n0220_188:1012c08_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c09_5"
    },
    {
        "source_sentence": "是士夫清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of these men and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c09_6"
    },
    {
        "source_sentence": "「補特伽羅清淨即佛十力清淨，佛十力清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of the pudgala.",
        "source": "T05n0220_188:1012c11_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c12_8"
    },
    {
        "source_sentence": "是補特伽羅清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the Buddha's ten powers are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c12_9"
    },
    {
        "source_sentence": "補特伽羅清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of the pudgala is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012c14_10"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即補特伽羅清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas is the purity of the pudgala.",
        "source": "T05n0220_188:1012c16_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c17_12"
    },
    {
        "source_sentence": "是補特伽羅清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the four fearlessnesses up to the 18 Buddha-principles are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c17_13"
    },
    {
        "source_sentence": "「意生清淨即佛十力清淨，佛十力清淨即意生清淨。",
        "translation": "The purity of mind-made is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of mind-made.",
        "source": "T05n0220_188:1012c19_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c20_15"
    },
    {
        "source_sentence": "是意生清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of the Buddha's ten powers are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c20_16"
    },
    {
        "source_sentence": "意生清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of mind-made is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012c21_17"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即意生清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas are the purity of mind-made.",
        "source": "T05n0220_188:1012c23_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c24_19"
    },
    {
        "source_sentence": "是意生清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c24_20"
    },
    {
        "source_sentence": "「儒童清淨即佛十力清淨，佛十力清淨即儒童清淨。",
        "translation": "The purity of the youthful boy is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of the youthful boy.",
        "source": "T05n0220_188:1012c26_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1012c27_22"
    },
    {
        "source_sentence": "是儒童清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the Buddha's ten powers are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1012c28_0"
    },
    {
        "source_sentence": "儒童清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of youth is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1012c29_1"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即儒童清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the Buddha are the purity of the youthful boy.",
        "source": "T05n0220_188:1013a01_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a03_3"
    },
    {
        "source_sentence": "是儒童清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "The purity of this youthful boy and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a03_4"
    },
    {
        "source_sentence": "「作者清淨即佛十力清淨，佛十力清淨即作者清淨。",
        "translation": "The author's purity is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the author's purity.",
        "source": "T05n0220_188:1013a05_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a06_1"
    },
    {
        "source_sentence": "是作者清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the Buddha's purity of the ten powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a06_2"
    },
    {
        "source_sentence": "作者清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of the author is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1013a07_3"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即作者清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas is the author's purity.",
        "source": "T05n0220_188:1013a09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a10_5"
    },
    {
        "source_sentence": "是作者清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a10_6"
    },
    {
        "source_sentence": "「受者清淨即佛十力清淨，佛十力清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of the recipient.",
        "source": "T05n0220_188:1013a12_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a13_8"
    },
    {
        "source_sentence": "是受者清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the Buddha's ten powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a13_9"
    },
    {
        "source_sentence": "受者清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of the receiver is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1013a15_0"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即受者清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas are the purity of the recipient.",
        "source": "T05n0220_188:1013a16_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a17_2"
    },
    {
        "source_sentence": "是受者清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a18_3"
    },
    {
        "source_sentence": "「知者清淨即佛十力清淨，佛十力清淨即知者清淨。",
        "translation": "The purity of knowing is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of knowing.",
        "source": "T05n0220_188:1013a19_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a21_5"
    },
    {
        "source_sentence": "是知者清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the Buddha's ten powers are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a21_6"
    },
    {
        "source_sentence": "知者清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of the knower is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1013a22_7"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即知者清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas is the purity of knowing.",
        "source": "T05n0220_188:1013a24_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a25_9"
    },
    {
        "source_sentence": "是知者清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a25_10"
    },
    {
        "source_sentence": "「見者清淨即佛十力清淨，佛十力清淨即見者清淨。",
        "translation": "The purity of the seer is the purity of the Buddha's ten powers, and the purity of the Buddha's ten powers is the purity of the seer.",
        "source": "T05n0220_188:1013a27_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013a28_12"
    },
    {
        "source_sentence": "是見者清淨與佛十力清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of those who see and the purity of the Buddha's ten powers are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013a28_13"
    },
    {
        "source_sentence": "見者清淨即四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "The purity of those who see is the purity of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles.",
        "source": "T05n0220_188:1013a29_14"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨即見者清淨。",
        "translation": "The purity of the four fearlessnesses and even the purity of the 18 distinctive qualities of the buddhas, that is, the purity of those who see.",
        "source": "T05n0220_188:1013b02_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b03_16"
    },
    {
        "source_sentence": "是見者清淨與四無所畏乃至十八佛不共法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of those who see and the purity of the four fearlessnesses and even the purity of the 18 Buddha-principles are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b03_17"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T05n0220_188:1013b06_0"
    },
    {
        "source_sentence": "我清淨即無忘失法清淨，無忘失法清淨即我清淨。",
        "translation": "The purity of self is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the purity of self.",
        "source": "T05n0220_188:1013b06_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b07_2"
    },
    {
        "source_sentence": "是我清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of self and the purity of the principle of nonforgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b07_3"
    },
    {
        "source_sentence": "我清淨即恒住捨性清淨，恒住捨性清淨即我清淨。",
        "translation": "The purity of self is the purity of the nature of constancy and equanimity, and the purity of constancy and equanimity is the purity of self.",
        "source": "T05n0220_188:1013b08_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b10_0"
    },
    {
        "source_sentence": "是我清淨與恒住捨性清淨。",
        "translation": "This is the purity of self and the purity of the nature of constant abiding equanimity.",
        "source": "T05n0220_188:1013b10_1"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T05n0220_188:1013b10_2"
    },
    {
        "source_sentence": "「有情清淨即無忘失法清淨，無忘失法清淨即有情清淨。",
        "translation": "The purity of sentient beings means the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness means the purity of sentient beings.",
        "source": "T05n0220_188:1013b11_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b12_4"
    },
    {
        "source_sentence": "是有情清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of sentient beings and the purity of the principle of nonforgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b12_5"
    },
    {
        "source_sentence": "有情清淨即恒住捨性清淨，恒住捨性清淨即有情清淨。",
        "translation": "The purity of sentient beings is the purity of constantly abiding equanimity, and the purity of constantly abiding equanimity is the purity of sentient beings.",
        "source": "T05n0220_188:1013b14_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b15_7"
    },
    {
        "source_sentence": "是有情清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of sentient beings and the purity of the nature of constantly abiding equanimity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b15_8"
    },
    {
        "source_sentence": "「命者清淨即無忘失法清淨，無忘失法清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the purity of the living being.",
        "source": "T05n0220_188:1013b17_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b18_1"
    },
    {
        "source_sentence": "是命者清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the living being and the purity of the principle of no forgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b18_2"
    },
    {
        "source_sentence": "命者清淨即恒住捨性清淨，恒住捨性清淨即命者清淨。",
        "translation": "The purity of the living being is the purity of the constantly abiding nature of equanimity, and the purity of the constantly abiding nature of equanimity is the purity of the living being.",
        "source": "T05n0220_188:1013b19_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b21_4"
    },
    {
        "source_sentence": "是命者清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the living being and the purity of the eternally abiding equanimity are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b21_5"
    },
    {
        "source_sentence": "「生者清淨即無忘失法清淨，無忘失法清淨即生者清淨。",
        "translation": "The purity of the living being is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the purity of the living being.",
        "source": "T05n0220_188:1013b22_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b23_7"
    },
    {
        "source_sentence": "是生者清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the person who gives rise to it and the purity of the principle of no forgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b24_0"
    },
    {
        "source_sentence": "生者清淨即恒住捨性清淨，恒住捨性清淨即生者清淨。",
        "translation": "The purity of the arising is the purity of constantly abiding equanimity, and the purity of constantly abiding equanimity is the purity of the arising.",
        "source": "T05n0220_188:1013b25_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b26_2"
    },
    {
        "source_sentence": "是生者清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the arising and the purity of the eternally abiding equanimity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b26_3"
    },
    {
        "source_sentence": "「養育者清淨即無忘失法清淨，無忘失法清淨即養育者清淨。",
        "translation": "The purity of nurturing is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the purity of nurturing.",
        "source": "T05n0220_188:1013b28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013b29_1"
    },
    {
        "source_sentence": "是養育者清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of the principle of no forgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013b29_2"
    },
    {
        "source_sentence": "養育者清淨即恒住捨性清淨，恒住捨性清淨即養育者清淨。",
        "translation": "The purity of nurturing is the purity of constantly abiding equanimity, and the purity of constantly abiding equanimity is the purity of nurturing.",
        "source": "T05n0220_188:1013c01_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c03_4"
    },
    {
        "source_sentence": "是養育者清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of nurturing and the purity of constantly abiding equanimity are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c03_5"
    },
    {
        "source_sentence": "「士夫清淨即無忘失法清淨，無忘失法清淨即士夫清淨。",
        "translation": "The purity of men and women means the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness means the purity of men and women.",
        "source": "T05n0220_188:1013c04_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c06_7"
    },
    {
        "source_sentence": "是士夫清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of these men and the purity of the principle of nonforgetfulness are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c06_8"
    },
    {
        "source_sentence": "士夫清淨即恒住捨性清淨，恒住捨性清淨即士夫清淨。",
        "translation": "The purity of men and women is the purity of constantly abiding equanimity, and the purity of constantly abiding equanimity is the purity of men and women.",
        "source": "T05n0220_188:1013c07_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c08_10"
    },
    {
        "source_sentence": "是士夫清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this man and the purity of the nature of constantly abiding equanimity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c09_11"
    },
    {
        "source_sentence": "「補特伽羅清淨即無忘失法清淨，無忘失法清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the purity of the pudgala.",
        "source": "T05n0220_188:1013c10_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c11_13"
    },
    {
        "source_sentence": "是補特伽羅清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the principle of no forgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c12_14"
    },
    {
        "source_sentence": "補特伽羅清淨即恒住捨性清淨，恒住捨性清淨即補特伽羅清淨。",
        "translation": "The purity of the pudgala is the purity of the nature of constant abiding equanimity, and the purity of the nature of constant abiding equanimity is the purity of the pudgala.",
        "source": "T05n0220_188:1013c13_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c15_16"
    },
    {
        "source_sentence": "是補特伽羅清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the pudgala and the purity of the nature of constantly abiding equanimity are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c15_17"
    },
    {
        "source_sentence": "「意生清淨即無忘失法清淨，無忘失法清淨即意生清淨。",
        "translation": "The purity of mind-generating is the purity of the absence of forgetfulness, and the purity of the absence of forgetfulness is the purity of mind-generating.",
        "source": "T05n0220_188:1013c16_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c17_19"
    },
    {
        "source_sentence": "是意生清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of the principle of nonforgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c18_20"
    },
    {
        "source_sentence": "意生清淨即恒住捨性清淨，恒住捨性清淨即意生清淨。",
        "translation": "The purity of mind-generation is the purity of constantly abiding equanimity, and the purity of constantly abiding equanimity is the purity of mind-generation.",
        "source": "T05n0220_188:1013c19_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c20_22"
    },
    {
        "source_sentence": "是意生清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of mind-generation and the purity of constantly abiding equanimity are not two, not separated by duality, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c20_23"
    },
    {
        "source_sentence": "「儒童清淨即無忘失法清淨，無忘失法清淨即儒童清淨。",
        "translation": "The purity of the youthful boy means the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness means the purity of the youthful boy.",
        "source": "T05n0220_188:1013c22_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c23_25"
    },
    {
        "source_sentence": "是儒童清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the principle of nonforgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c23_26"
    },
    {
        "source_sentence": "儒童清淨即恒住捨性清淨，恒住捨性清淨即儒童清淨。",
        "translation": "The purity of the youthful boy is the purity of the nature of constancy and equanimity, and the purity of constancy and equanimity is the purity of the youthful boy.",
        "source": "T05n0220_188:1013c25_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c26_1"
    },
    {
        "source_sentence": "是儒童清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of this youthful boy and the purity of the nature of constantly abiding equanimity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c26_2"
    },
    {
        "source_sentence": "「作者清淨即無忘失法清淨，無忘失法清淨即作者清淨。",
        "translation": "The author's purity is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the author's purity.",
        "source": "T05n0220_188:1013c27_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1013c29_4"
    },
    {
        "source_sentence": "是作者清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the purity of the principle of nonforgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1013c29_5"
    },
    {
        "source_sentence": "作者清淨即恒住捨性清淨，恒住捨性清淨即作者清淨。",
        "translation": "The author's purity is the purity of constantly abiding equanimity, and the purity of constantly abiding equanimity is the author's purity.",
        "source": "T05n0220_188:1014a01_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1014a02_7"
    },
    {
        "source_sentence": "是作者清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the author's purity and the purity of constantly abiding equanimity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1014a03_0"
    },
    {
        "source_sentence": "「受者清淨即無忘失法清淨，無忘失法清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the purity of the recipient.",
        "source": "T05n0220_188:1014a04_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1014a05_2"
    },
    {
        "source_sentence": "是受者清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the principle of no forgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1014a05_3"
    },
    {
        "source_sentence": "受者清淨即恒住捨性清淨，恒住捨性清淨即受者清淨。",
        "translation": "The purity of the recipient is the purity of the constantly abiding nature of equanimity, and the purity of the constantly abiding nature of equanimity is the purity of the recipient.",
        "source": "T05n0220_188:1014a07_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1014a08_5"
    },
    {
        "source_sentence": "是受者清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of the recipient and the purity of the eternally abiding equanimity are not two, not separated, not distinct, and not interrupted.",
        "source": "T05n0220_188:1014a08_6"
    },
    {
        "source_sentence": "「知者清淨即無忘失法清淨，無忘失法清淨即知者清淨。",
        "translation": "The purity of the knower is the purity of the absence of forgetfulness, and the purity of the absence of forgetfulness is the purity of the knower.",
        "source": "T05n0220_188:1014a09_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1014a11_8"
    },
    {
        "source_sentence": "是知者清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the absence of forgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1014a11_9"
    },
    {
        "source_sentence": "知者清淨即恒住捨性清淨，恒住捨性清淨即知者清淨。",
        "translation": "The purity of knowing is the purity of constantly abiding equanimity, and the purity of constantly abiding equanimity is the purity of knowing.",
        "source": "T05n0220_188:1014a12_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1014a13_11"
    },
    {
        "source_sentence": "是知者清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of knowing and the purity of the nature of constant abiding equanimity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1014a14_12"
    },
    {
        "source_sentence": "「見者清淨即無忘失法清淨，無忘失法清淨即見者清淨。",
        "translation": "The purity of the seer is the purity of the principle of no forgetfulness, and the purity of the principle of no forgetfulness is the purity of the seer.",
        "source": "T05n0220_188:1014a15_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1014a16_14"
    },
    {
        "source_sentence": "是見者清淨與無忘失法清淨，無二、無二分、無別、無斷故。",
        "translation": "It's because the purity of those who see and the purity of the principle of no forgetfulness are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1014a16_15"
    },
    {
        "source_sentence": "見者清淨即恒住捨性清淨，恒住捨性清淨即見者清淨。",
        "translation": "The purity of the viewer is the purity of the nature of constantly abiding equanimity, and the purity of the nature of constantly abiding equanimity is the purity of the viewer.",
        "source": "T05n0220_188:1014a18_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_188:1014a19_17"
    },
    {
        "source_sentence": "是見者清淨與恒住捨性清淨，無二、無二分、無別、無斷故。",
        "translation": "This is because the purity of the viewer and the purity of the eternally abiding equanimity are not two, not dichotomous, not distinct, and not interrupted.",
        "source": "T05n0220_188:1014a19_18"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百八十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 108",
        "source": "T05n0220_188:1014a21_0"
    }
]