[
    {
        "source_sentence": "大般若波羅蜜多經卷第四十一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 41",
        "source": "T05n0220_041:0227c02_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T05n0220_041:0227c04_0"
    },
    {
        "source_sentence": "初分般若行相品第十之四",
        "translation": "The Tenth and Fourth Part of the Chapter on the Forms of the First Part of Prajñāpāramitā",
        "source": "T05n0220_041:0227c05_0"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0227c06_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩有方便善巧修行般若波羅蜜多時，不行布施波羅蜜多，不行布施波羅蜜多相，",
        "translation": "If a bodhisattva Mahāsattva has the skillful means to skillfully cultivate the perfection of wisdom, he doesn't practice the perfection of generosity and doesn't practice the characteristics of the perfection of generosity,",
        "source": "T05n0220_041:0227c06_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多；",
        "translation": "They practice the perfection of wisdom.",
        "source": "T05n0220_041:0227c08_2"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多，不行淨戒、安忍、精進、靜慮、般若波羅蜜多相，",
        "translation": "They don't practice the characteristics of pure morality, patience, effort, meditation, and the perfection of wisdom, and they don't practice the characteristics of pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T05n0220_041:0227c08_3"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0227c10_4"
    },
    {
        "source_sentence": "不行布施波羅蜜多常無常，不行布施波羅蜜多常無常相，是行般若波羅蜜多；",
        "translation": "Not practicing that the perfection of giving is eternal and impermanent, and not practicing that the perfection of giving is eternal and impermanent in characteristics, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0227c11_5"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多常無常，不行淨戒、安忍、精進、靜慮、般若波羅蜜多常無常相，",
        "translation": "They don't practice the characteristic of pure morality, patience, effort, meditation, and the perfection of wisdom being permanent and impermanent, and they don't practice the characteristic of pure morality, patience, effort, meditation, and the perfection of wisdom being permanent and impermanent.",
        "source": "T05n0220_041:0227c13_6"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0227c15_7"
    },
    {
        "source_sentence": "不行布施波羅蜜多樂苦，不行布施波羅蜜多樂苦相，是行般若波羅蜜多；",
        "translation": "If someone doesn’t practice the perfection of generosity and has many pleasant and painful characteristics, and doesn’t practice the perfection of generosity and have many pleasant and painful characteristics, this is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0227c15_8"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多樂苦，不行淨戒、安忍、精進、靜慮、般若波羅蜜多樂苦相，",
        "translation": "They don't practice the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā as pleasant and painful, and they don't practice the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā as pleasant and painful.",
        "source": "T05n0220_041:0227c17_9"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0227c19_10"
    },
    {
        "source_sentence": "不行布施波羅蜜多我無我，不行布施波羅蜜多我無我相，是行般若波羅蜜多；",
        "translation": "Not practicing the perfection of generosity and not acting on the characteristic that the self is without a self, and not practicing the perfection of generosity and not acting on the characteristic that the self is without a self, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0227c20_11"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多我無我，不行淨戒、安忍、精進、靜慮、般若波羅蜜多我無我相，",
        "translation": "They don't practice the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā as selfless, and they don't practice the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā as selfless.",
        "source": "T05n0220_041:0227c22_0"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0227c24_1"
    },
    {
        "source_sentence": "不行布施波羅蜜多淨不淨，不行布施波羅蜜多淨不淨相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristics of purity and impurity of the perfection of generosity and not practicing the characteristics of purity and impurity of the perfection of generosity is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0227c24_2"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多淨不淨，不行淨戒、安忍、精進、靜慮、般若波羅蜜多淨不淨相，",
        "translation": "They don't practice the pure forms of morality, patience, effort, meditation, and the perfection of wisdom that are pure and impure, and they don't practice the pure forms of morality, patience, effort, meditation, and the perfection of wisdom that are pure and impure.",
        "source": "T05n0220_041:0227c26_3"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0227c28_4"
    },
    {
        "source_sentence": "不行布施波羅蜜多空不空，不行布施波羅蜜多空不空相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristics of emptiness and nonemptyness of the perfection of giving and not practicing the characteristics of emptiness and nonemptyness of the perfection of giving, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0227c29_5"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多空不空，不行淨戒、安忍、精進、靜慮、般若波羅蜜多空不空相，",
        "translation": "They don't practice the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā that are empty and not empty, and they don't practice the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā that are empty and not empty.",
        "source": "T05n0220_041:0228a02_6"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228a04_7"
    },
    {
        "source_sentence": "不行布施波羅蜜多無相有相，不行布施波羅蜜多無相有相相，是行般若波羅蜜多；",
        "translation": "Not practicing the perfection of giving without marks and signs, and not practicing the perfection of giving without marks and signs with marks is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228a04_8"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多無相有相，不行淨戒、安忍、精進、靜慮、般若波羅蜜多無相有相相，",
        "translation": "They don't practice pure morality, patience, effort, meditation, and the perfection of wisdom that are signless and have marks, and they don't practice pure morality, patience, effort, meditation, and the perfection of wisdom that are signless and have marks.",
        "source": "T05n0220_041:0228a06_9"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228a09_10"
    },
    {
        "source_sentence": "不行布施波羅蜜多無願有願，不行布施波羅蜜多無願有願相，是行般若波羅蜜多；",
        "translation": "Not practicing the perfection of giving without wishes and vows, and not practicing the perfection of giving without wishes and signs of vows is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228a09_11"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多無願有願，不行淨戒、安忍、精進、靜慮、般若波羅蜜多無願有願相，",
        "translation": "They don't practice pure morality, patience, effort, meditation, and the perfection of wisdom with wishlessness and vows, and they don't practice pure morality, patience, effort, meditation, and the perfection of wisdom with wishlessness and vows.",
        "source": "T05n0220_041:0228a11_12"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228a13_13"
    },
    {
        "source_sentence": "不行布施波羅蜜多寂靜不寂靜，不行布施波羅蜜多寂靜不寂靜相，是行般若波羅蜜多；",
        "translation": "Not practicing the quiescence and non-quiescence of the perfection of generosity and not practicing the quiescence and non-quiescence of the perfection of generosity, and not practicing the quiescence and non-quiescence of the perfection of generosity is the practice of the perfection of wisdom.",
        "source": "T05n0220_041:0228a14_14"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多寂靜不寂靜，不行淨戒、安忍、精進、靜慮、般若波羅蜜多寂靜不寂靜相，",
        "translation": "They don't practice the characteristics of pure morality, patience, effort, meditation, and the quiescence and non-quiescence of the prajñāpāramitā, and they don't practice the characteristics of pure morality, patience, effort, meditation, meditative absorption, and the quiescence and non-quiescence of the prajñāpār",
        "source": "T05n0220_041:0228a16_15"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228a18_16"
    },
    {
        "source_sentence": "不行布施波羅蜜多遠離不遠離，不行布施波羅蜜多遠離不遠離相，是行般若波羅蜜多；",
        "translation": "Not practicing the transcendent ways of giving is to practice the transcendent ways of prajñāpāramitā.",
        "source": "T05n0220_041:0228a19_17"
    },
    {
        "source_sentence": "不行淨戒、安忍、精進、靜慮、般若波羅蜜多遠離不遠離，不行淨戒、安忍、精進、靜慮、般若波羅蜜多遠離不遠離相，",
        "translation": "They don't practice pure morality, patience, effort, meditation, and the perfection of wisdom that are distant and not distant, and they don't practice pure morality, patience, effort, meditation, meditation, and the perfection of wisdom that are distant and not distant from characteristics.",
        "source": "T05n0220_041:0228a21_18"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228a23_19"
    },
    {
        "source_sentence": "「舍利子當知！",
        "translation": "You should know, Śāriputra!",
        "source": "T05n0220_041:0228a24_20"
    },
    {
        "source_sentence": "是為菩薩摩訶薩有方便善巧修行般若波羅蜜多。",
        "translation": "This is the bodhisattva Mahāsattva who skillfully cultivates the perfection of wisdom with skillful means.",
        "source": "T05n0220_041:0228a24_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0228a25_22"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0228a26_23"
    },
    {
        "source_sentence": "布施波羅蜜多布施波羅蜜多性空，淨戒、安忍、精進、靜慮、般若波羅蜜多淨戒、安忍、精進、靜慮、般若波羅蜜多性空。",
        "translation": "The nature of the perfection of generosity and the perfection of generosity is empty, and the natures of pure morality, patience, effort, meditation, and prajñāpāramitā are empty of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T05n0220_041:0228a26_24"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0228a28_25"
    },
    {
        "source_sentence": "是布施波羅蜜多非布施波羅蜜多空，是布施波羅蜜多空非布施波羅蜜多，",
        "translation": "This is the emptiness of the perfection of generosity and not the emptiness of the perfection of generosity, and this is the emptiness of the perfection of generosity and not the perfection of generosity.",
        "source": "T05n0220_041:0228a28_26"
    },
    {
        "source_sentence": "布施波羅蜜多不離空，空不離布施波羅蜜多，布施波羅蜜多即是空，空即是布施波羅蜜多，",
        "translation": "The perfection of generosity doesn't part from emptiness, and emptiness doesn't part from the perfection of generosity. The perfection of generosity is emptiness, and emptiness is the perfection of generosity.",
        "source": "T05n0220_041:0228b01_27"
    },
    {
        "source_sentence": "淨戒、安忍、精進、靜慮、般若波羅蜜多亦復如是。",
        "translation": "Pure precepts, patience, effort, meditation, and the perfection of wisdom are likewise.",
        "source": "T05n0220_041:0228b03_28"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0228b05_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩有方便善巧修行般若波羅蜜多時，不行五眼，不行五眼相，",
        "translation": "“When great enlightening beings skillfully practice the transcendent wisdom of liberation, they don’t practice the five eyes and don’t practice the marks of the five eyes.",
        "source": "T05n0220_041:0228b05_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多；",
        "translation": "They practice the perfection of wisdom.",
        "source": "T05n0220_041:0228b06_2"
    },
    {
        "source_sentence": "不行六神通，不行六神通相，是行般若波羅蜜多。",
        "translation": "Not practicing the six supernormal powers and not practicing the characteristics of the six supernormal powers is practicing the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b07_3"
    },
    {
        "source_sentence": "不行五眼常無常，不行五眼常無常相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristic that the five eyes are permanent and impermanent, and not practicing the characteristic that the five eyes are permanent and impermanent, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228b08_4"
    },
    {
        "source_sentence": "不行六神通常無常，不行六神通常無常相，是行般若波羅蜜多。",
        "translation": "Not practicing the characteristic that the six divinities are always impermanent and not practicing the characteristic that the six divinities are always impermanent is to practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b09_5"
    },
    {
        "source_sentence": "不行五眼樂苦，不行五眼樂苦相，是行般若波羅蜜多；",
        "translation": "Not practicing the five eyes that are pleasant and painful and not enjoying the characteristics of the five eyes that are pleasant and painful is to practice the perfection of wisdom.",
        "source": "T05n0220_041:0228b11_6"
    },
    {
        "source_sentence": "不行六神通樂苦，不行六神通樂苦相，是行般若波羅蜜多。",
        "translation": "Not practicing the pleasant and painful aspect of the six supernormal powers and not practicing the pleasant and painful aspect of the six supernormal powers is the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b12_7"
    },
    {
        "source_sentence": "不行五眼我無我，不行五眼我無我相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristic of selflessness of the five-eyed self and not practicing selflessness of the five-eyed self is to practice the perfection of wisdom.",
        "source": "T05n0220_041:0228b14_0"
    },
    {
        "source_sentence": "不行六神通我無我，不行六神通我無我相，是行般若波羅蜜多。",
        "translation": "If someone doesn't practice the six supernormal powers and selflessness of self and doesn't practice the selflessness of self in the six supernormal powers, this is practicing the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b15_1"
    },
    {
        "source_sentence": "不行五眼淨不淨，不行五眼淨不淨相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristics of purity and impurity of the five eyes and not practicing the characteristics of purity and impurity of the five eyes is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228b16_2"
    },
    {
        "source_sentence": "不行六神通淨不淨，不行六神通淨不淨相，是行般若波羅蜜多。",
        "translation": "Not practicing the purity and impurity of the six supernormal powers and not practicing the purity and impurity of the six supernormal powers is to practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b18_3"
    },
    {
        "source_sentence": "不行五眼空不空，不行五眼空不空相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristics of emptiness and nonemptyness of the five eyes and not practicing emptiness and nonemptyness of the five eyes is to practice the perfection of wisdom.",
        "source": "T05n0220_041:0228b19_4"
    },
    {
        "source_sentence": "不行六神通空不空，不行六神通空不空相，是行般若波羅蜜多。",
        "translation": "Not practicing the characteristic of emptiness and nonemptyness of the six supernormal powers and not practicing the characteristic of emptiness and nonemptyness of the six supernormal powers is to practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b20_5"
    },
    {
        "source_sentence": "不行五眼無相有相，不行五眼無相有相相，是行般若波羅蜜多；",
        "translation": "Not practicing the formlessness of the five eyes with marks and not practicing the formlessness of the five eyes with marks and marks is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228b22_6"
    },
    {
        "source_sentence": "不行六神通無相有相，不行六神通無相有相相，是行般若波羅蜜多。",
        "translation": "Not practicing the six supernormal powers that lack marks and have marks and not practicing the six supernormal powers that lack marks and have marks, this is practicing the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b23_7"
    },
    {
        "source_sentence": "不行五眼無願有願，不行五眼無願有願相，是行般若波羅蜜多；",
        "translation": "Not practicing the five eyes with wishlessness and not practising the characteristics of wishlessness, and not practicing the five eyes with wishlessness and not practising the characteristics of wishlessness, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228b25_8"
    },
    {
        "source_sentence": "不行六神通無願有願，不行六神通無願有願相，是行般若波羅蜜多。",
        "translation": "If someone who doesn't practice the six supernormal powers without wishing and doesn't practice the six supernormal powers without wishing with the mark of wishing, this is practicing the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228b26_9"
    },
    {
        "source_sentence": "不行五眼寂靜不寂靜，不行五眼寂靜不寂靜相，是行般若波羅蜜多；",
        "translation": "Not practicing the quiescence and nonquiescence of the five eyes and not practicing the quiescence and nonquiescence of the five eyes is to practice the perfection of wisdom.",
        "source": "T05n0220_041:0228b28_10"
    },
    {
        "source_sentence": "不行六神通寂靜不寂靜，不行六神通寂靜不寂靜相，是行般若波羅蜜多。",
        "translation": "If someone doesn't practice the quiescence and non-quiescence of the six supernormal powers and doesn't practice the quiescence and non-quiescence of the six supernormal powers, this is practicing the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228c01_11"
    },
    {
        "source_sentence": "不行五眼遠離不遠離，不行五眼遠離不遠離相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristic of not being separated from the five eyes and not being separated, and not practicing the characteristic of not being separated from the five eyes and not being separated from them is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228c02_12"
    },
    {
        "source_sentence": "不行六神通遠離不遠離，不行六神通遠離不遠離相，是行般若波羅蜜多。",
        "translation": "Not practicing the six supernormal powers that are not separated and not separated, and not practicing the characteristics that are not separated and not separated by the six supernormal powers that are not separated and not separated is to practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228c04_13"
    },
    {
        "source_sentence": "「舍利子當知！",
        "translation": "You should know, Śāriputra!",
        "source": "T05n0220_041:0228c06_14"
    },
    {
        "source_sentence": "是為菩薩摩訶薩有方便善巧修行般若波羅蜜多。",
        "translation": "This is the bodhisattva Mahāsattva who skillfully cultivates the perfection of wisdom with skillful means.",
        "source": "T05n0220_041:0228c06_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0228c07_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0228c07_17"
    },
    {
        "source_sentence": "五眼五眼性空，六神通六神通性空。",
        "translation": "The nature of the five eyes and five eyes is empty, and the six supernormal powers and six supernormal powers are empty.",
        "source": "T05n0220_041:0228c07_18"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0228c08_19"
    },
    {
        "source_sentence": "是五眼非五眼空，是五眼空非五眼，五眼不離空，空不離五眼，五眼即是空，",
        "translation": "These five eyes are not emptiness of the five eyes; these five eyes are emptiness and not the five eyes. The five eyes don’t part from emptiness, emptiness doesn’t part from the five eyes: the five eyes are emptiness.",
        "source": "T05n0220_041:0228c08_20"
    },
    {
        "source_sentence": "空即是五眼，六神通亦復如是。",
        "translation": "Emptiness are the five eyes, and so are the six supernormal powers.",
        "source": "T05n0220_041:0228c10_21"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0228c12_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩有方便善巧修行般若波羅蜜多時，不行佛十力，不行佛十力相，",
        "translation": "If a bodhisattva Mahāsattva has skillful means to cultivate the perfection of wisdom, he doesn't practice the Buddha's ten powers and doesn't practice the characteristics of the Buddha's ten powers,",
        "source": "T05n0220_041:0228c12_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多；",
        "translation": "They practice the perfection of wisdom.",
        "source": "T05n0220_041:0228c14_0"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T05n0220_041:0228c14_1"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智相，是行般若波羅蜜多。",
        "translation": "Not practicing the four forms of fearlessness or even the characteristics of omniscience is to practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228c16_2"
    },
    {
        "source_sentence": "不行佛十力常無常，不行佛十力常無常相，是行般若波羅蜜多；",
        "translation": "Not practicing that the ten powers of buddhas are always impermanent and not practicing that the ten powers of buddhas are always impermanent, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228c17_3"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智常無常，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics as permanent and impermanent.",
        "source": "T05n0220_041:0228c19_4"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智常無常相，是行般若波羅蜜多。",
        "translation": "Not practicing the perfection of prajñāpāramitā without the four fearlessnesses or even the impermanent and impermanent characteristics of omniscience is to practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228c21_5"
    },
    {
        "source_sentence": "不行佛十力樂苦，不行佛十力樂苦相，是行般若波羅蜜多；",
        "translation": "Not practicing the ten powers of buddhas and not experiencing the pleasant and painful characteristics of the pleasures and pains of the ten powers of buddhas, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0228c22_6"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智樂苦，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, knowledge of all characteristics, and knowledge of all characteristics that bring happiness and suffering.",
        "source": "T05n0220_041:0228c23_7"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智樂苦相，是行般若波羅蜜多。",
        "translation": "Not practicing the four forms of fearlessness up to the mark of wisdom, bliss, and suffering for all characteristics is the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0228c26_0"
    },
    {
        "source_sentence": "不行佛十力我無我，不行佛十力我無我相，是行般若波羅蜜多；",
        "translation": "Not practicing the characteristics of selflessness and selflessness of the ten powers of buddhas and not practicing the ten powers of buddhas is to practice transcendent wisdom.",
        "source": "T05n0220_041:0228c27_1"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智我無我，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics as self and selflessness.",
        "source": "T05n0220_041:0228c28_2"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智我無我相，是行般若波羅蜜多。",
        "translation": "Not practicing the perfection of prajñāpāramitā without the four fearlessnesses or even the characteristics of omniscience and selflessness is to practice the perfection of wisdom.",
        "source": "T05n0220_041:0229a01_3"
    },
    {
        "source_sentence": "不行佛十力淨不淨，不行佛十力淨不淨相，是行般若波羅蜜多；",
        "translation": "Not practicing the pure and impure characteristics of the ten powers of buddhas and not practicing the pure and impure characteristics of the ten powers of buddhas is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0229a03_4"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智淨不淨，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics that are pure and impure.",
        "source": "T05n0220_041:0229a04_5"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智淨不淨相，是行般若波羅蜜多。",
        "translation": "Not practicing the four fearlessnesses or even the pure and impure characteristics of omniscience that don't abide, this is the practice of the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0229a06_6"
    },
    {
        "source_sentence": "不行佛十力空不空，不行佛十力空不空相，是行般若波羅蜜多；",
        "translation": "Not practicing emptiness and nonemptyness of the ten powers of buddhas and not practicing emptiness and nonemptyness of the ten powers of buddhas is to practice the transcendent prajñāpāramitā.",
        "source": "T05n0220_041:0229a08_7"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智空不空，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics as emptiness and nonemptyness.",
        "source": "T05n0220_041:0229a09_8"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智空不空相，是行般若波羅蜜多。",
        "translation": "Not practicing the four fearlessnesses or even the characteristics of emptiness and nonemptyness of omniscience is to practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0229a11_9"
    },
    {
        "source_sentence": "不行佛十力無相有相，不行佛十力無相有相相，是行般若波羅蜜多；",
        "translation": "Not practicing the formlessness of the ten powers of buddhas and not practicing the formlessness of the ten powers of buddhas, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0229a13_10"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智無相有相，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics without marks or forms.",
        "source": "T05n0220_041:0229a14_11"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智無相有相相，是行般若波羅蜜多。",
        "translation": "Not practicing the four forms of fearlessness up to the marklessness of omniscience that have marks and marks is the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0229a17_0"
    },
    {
        "source_sentence": "不行佛十力無願有願，不行佛十力無願有願相，是行般若波羅蜜多；",
        "translation": "Not practicing the ten powers of buddhas, having no wishes and no vows, and not practicing the ten powers of buddhas, having no wishes and no marks of vows, is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0229a18_1"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智無願有願，",
        "translation": "They won’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and the knowledge of all characteristics.",
        "source": "T05n0220_041:0229a20_2"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智無願有願相，是行般若波羅蜜多。",
        "translation": "Not practicing the four forms of fearlessness up to the absence of all characteristics, knowledge of all characteristics, and wishes with vows are the perfections of prajñāpāramitā.",
        "source": "T05n0220_041:0229a22_3"
    },
    {
        "source_sentence": "不行佛十力寂靜不寂靜，不行佛十力寂靜不寂靜相，是行般若波羅蜜多；",
        "translation": "Not practicing the quiescence and non-quiescence of the ten powers of buddhas and not practicing the quiescence and non-quiescence of the ten powers of buddhas is the practice of transcendent wisdom.",
        "source": "T05n0220_041:0229a23_4"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智寂靜不寂靜，",
        "translation": "They won’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and the quiescence and non-quiescence of all-inclusive knowledge.",
        "source": "T05n0220_041:0229a25_5"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智寂靜不寂靜相，是行般若波羅蜜多。",
        "translation": "Not practicing the four forms of fearlessness up to the mark of the quiescence and non-quiescence of omniscience is the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0229a27_6"
    },
    {
        "source_sentence": "不行佛十力遠離不遠離，不行佛十力遠離不遠離相，是行般若波羅蜜多；",
        "translation": "Not practicing distancing oneself from the ten powers of buddhas and not being distancing oneself from them, and not practicing distancing oneself from the ten powers of buddhas and not being distancing oneself from their characteristics is practicing the perfection of wisdom.",
        "source": "T05n0220_041:0229a29_7"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智遠離不遠離，",
        "translation": "They don’t practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics that are distant and not distant.",
        "source": "T05n0220_041:0229b01_8"
    },
    {
        "source_sentence": "不行四無所畏乃至一切相智遠離不遠離相，是行般若波羅蜜多。",
        "translation": "If someone doesn't practice the four fearlessnesses or even the cognition of all characteristics that are free of and not free of characteristics, they're practicing the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0229b04_9"
    },
    {
        "source_sentence": "「舍利子當知！",
        "translation": "You should know, Śāriputra!",
        "source": "T05n0220_041:0229b05_10"
    },
    {
        "source_sentence": "是為菩薩摩訶薩有方便善巧修行般若波羅蜜多。",
        "translation": "This is the bodhisattva Mahāsattva who skillfully cultivates the perfection of wisdom with skillful means.",
        "source": "T05n0220_041:0229b05_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0229b07_12"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0229b07_13"
    },
    {
        "source_sentence": "佛十力佛十力性空，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智四無所畏乃至一切相智性空。",
        "translation": "The nature of the Buddha's ten powers and buddha's ten powers is empty, and the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 distinctive qualities of the Buddha, omniscience, knowledge of the path, knowledge of all characteristics, and the four fear",
        "source": "T05n0220_041:0229b07_14"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0229b10_15"
    },
    {
        "source_sentence": "是佛十力非佛十力空，是佛十力空非佛十力，佛十力不離空，空不離佛十力，",
        "translation": "These ten powers of Buddha are not the ten powers of Buddha; these ten powers of Buddha are emptiness and not the ten powers of Buddha. The ten powers of Buddha do not leave emptiness, and emptiness does not leave the ten powers of Buddha.",
        "source": "T05n0220_041:0229b10_16"
    },
    {
        "source_sentence": "佛十力即是空，空即是佛十力，四無所畏乃至一切相智亦復如是。",
        "translation": "The Buddha's ten powers are emptiness, and emptiness is the Buddha's ten powers, and so are the four fearlessnesses and even the knowledge of all characteristics.",
        "source": "T05n0220_041:0229b12_17"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0229b14_18"
    },
    {
        "source_sentence": "如是菩薩摩訶薩，有方便善巧修行般若波羅蜜多，能得無上正等菩提。",
        "translation": "Thus, the bodhisattva Mahāsattva skillfully cultivates the perfection of wisdom with skillful means and can attain unsurpassed perfect enlightenment.",
        "source": "T05n0220_041:0229b14_19"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0229b15_20"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多時，於一切法不取有、不取非有、不取亦有亦非有、不取非有非非有，",
        "translation": "When this bodhisattva Mahāsattva cultivates the perfection of wisdom, he doesn’t grasp existence and nonexistence, doesn’t grasp neither existence nor nonexistence, doesn’t grasp both existence and nonexistence, and doesn’t grasp neither existence nor nonexistence.",
        "source": "T05n0220_041:0229b16_21"
    },
    {
        "source_sentence": "於不取亦不取。」",
        "translation": "What's not grasped and what's not grasped.",
        "source": "T05n0220_041:0229b18_22"
    },
    {
        "source_sentence": "時，舍利子問善現言：「何因緣故，是菩薩摩訶薩修行般若波羅蜜多時，",
        "translation": "Śāriputra then asked the good manifestation, Why is it that when the bodhisattva Mahāsattva cultivates the perfection of wisdom,",
        "source": "T05n0220_041:0229b18_23"
    },
    {
        "source_sentence": "於一切法都無所取？」",
        "translation": "Is there nothing to grasp in all dharmas?",
        "source": "T05n0220_041:0229b20_24"
    },
    {
        "source_sentence": "善現答言：「由一切法自性不可得。",
        "translation": "Sunetra replied, It's because the self-nature of all dharmas is unobtainable.",
        "source": "T05n0220_041:0229b21_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0229b21_1"
    },
    {
        "source_sentence": "一切法以無性為自性故。",
        "translation": "It's because all dharmas have the absence of nature as their own nature.",
        "source": "T05n0220_041:0229b21_2"
    },
    {
        "source_sentence": "由此因緣，若菩薩摩訶薩修行般若波羅蜜多時，於一切法若取有、若取非有、若取亦有亦非有、若取非有非非有、若取不取，",
        "translation": "Because of these causes and conditions, if a bodhisattva Mahāsattva cultivates the perfection of wisdom when he cultivates the perfection of wisdom, all things that are grasped exist, those that are grasped don’t exist, those that are grasped also exist and aren’t existent, those that are grasped neither exist nor aren’t existent, and those that are grasped but aren’t",
        "source": "T05n0220_041:0229b22_3"
    },
    {
        "source_sentence": "非行般若波羅蜜多。",
        "translation": "They don't practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0229b25_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_041:0229b25_5"
    },
    {
        "source_sentence": "以一切法都無自性不可取故。",
        "translation": "It's because all dharmas lack self-nature and are ungraspable.",
        "source": "T05n0220_041:0229b26_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0229b26_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多時，於般若波羅蜜多不取行、不取不行、不取亦行亦不行、不取非行非不行，",
        "translation": "When this bodhisattva Mahāsattva cultivates the perfection of wisdom, he doesn't practice without grasping, doesn't practice without grasping, doesn't practice without apprehending, doesn't practice without apprehending, doesn't practice without doing, doesn't practice without doing, and doesn't practice without apprehending what's neither practiced nor un",
        "source": "T05n0220_041:0229b27_8"
    },
    {
        "source_sentence": "於不取亦不取。」",
        "translation": "What's not grasped and what's not grasped.",
        "source": "T05n0220_041:0229b29_9"
    },
    {
        "source_sentence": "時，舍利子問善現言：「何因緣故，是菩薩摩訶薩修行般若波羅蜜多時，",
        "translation": "Śāriputra then asked the good manifestation, Why is it that when the bodhisattva Mahāsattva cultivates the perfection of wisdom,",
        "source": "T05n0220_041:0229c01_10"
    },
    {
        "source_sentence": "於般若波羅蜜多都無所取？」",
        "translation": "Nothing is grasped in the perfection of wisdom?",
        "source": "T05n0220_041:0229c02_11"
    },
    {
        "source_sentence": "善現答言：「由般若波羅蜜多自性不可得。",
        "translation": "Sunetra replied, It's because the self-nature of the prajñāpāramitā is unobtainable.",
        "source": "T05n0220_041:0229c03_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0229c04_13"
    },
    {
        "source_sentence": "般若波羅蜜多以無性為自性故。",
        "translation": "The prajñāpāramitā takes the absence of nature as its own nature.",
        "source": "T05n0220_041:0229c04_14"
    },
    {
        "source_sentence": "由此因緣，若菩薩摩訶薩修行般若波羅蜜多時，於般若波羅蜜多若取行、若取不行、若取亦行亦不行、若取非行非不行、若取不取，",
        "translation": "Because of these causes and conditions, if a bodhisattva-mahāsattva cultivates the perfection of wisdom when he cultivates the perfection of wisdom, then he apprehends practice, doesn't practice practice what he apprehends, doesn't practice what he apprehends, doesn't practice what he apprehends, doesn't practice what he does, doesn't practice",
        "source": "T05n0220_041:0229c05_15"
    },
    {
        "source_sentence": "非行般若波羅蜜多。",
        "translation": "They don't practice the perfection of prajñāpāramitā.",
        "source": "T05n0220_041:0229c08_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_041:0229c08_17"
    },
    {
        "source_sentence": "以般若波羅蜜多都無自性不可取故。",
        "translation": "It's because the perfection of wisdom has no self-nature and can't be grasped.",
        "source": "T05n0220_041:0229c09_18"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0229c09_19"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多時，於一切法及般若波羅蜜多都無所取、無所執著，",
        "translation": "When this bodhisattva Mahāsattva cultivates the perfection of wisdom, he doesn't grasp anything and doesn't cling to all dharmas or the perfection of wisdom.",
        "source": "T05n0220_041:0229c10_20"
    },
    {
        "source_sentence": "是名菩薩摩訶薩於一切法無所取著三摩地。",
        "translation": "This is called the bodhisattva-mahāsattva's concentration that has no attachment to anything in all things.",
        "source": "T05n0220_041:0229c12_21"
    },
    {
        "source_sentence": "此三摩地微妙殊勝廣大無量，能集無邊無礙作用，不共一切聲聞、獨覺。",
        "translation": "This concentration of absorption is subtle, remarkable, vast, and immeasurable. It can assembly without limit or obstruction; it does not belong to any śrāvakas or pratyekabuddhas.",
        "source": "T05n0220_041:0229c13_22"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0229c14_23"
    },
    {
        "source_sentence": "若菩薩摩訶薩於此三摩地恒住不捨，速證無上正等菩提。」",
        "translation": "If a bodhisattva-mahāsattva always abides in this samādhi and doesn't abandon it, he'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_041:0229c15_0"
    },
    {
        "source_sentence": "時，舍利子問善現言：「諸菩薩摩訶薩，為但於此一三摩地恒住不捨速證無上正等菩提，",
        "translation": "Śāriputra asked the good manifestation, saying, “Those bodhisattvas and mahāsattvas, do they only abide in this one concentration, not abandoning it, to quickly realize supreme awakening?",
        "source": "T05n0220_041:0229c16_1"
    },
    {
        "source_sentence": "為更有餘諸三摩地恒住不捨亦令菩薩摩訶薩速證無上正等菩提？」",
        "translation": "Why are there other samādhis that are always abiding and not abandoned, which also cause the bodhisattva-mahāsattva to quickly realize unsurpassed perfect enlightenment?",
        "source": "T05n0220_041:0229c18_2"
    },
    {
        "source_sentence": "善現答言：「非但於此一三摩地，更有所餘諸三摩地諸菩薩摩訶薩恒住不捨，",
        "translation": "Sunetra replied, Not only in this one samādhi, but there are other bodhisattvas and mahāsattvas in the samādhis that always abide and don't abandon it.",
        "source": "T05n0220_041:0229c19_3"
    },
    {
        "source_sentence": "速證無上正等菩提。」",
        "translation": "They'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_041:0229c21_4"
    },
    {
        "source_sentence": "舍利子言：「何者是耶？」",
        "translation": "Śāriputra said, What's that?",
        "source": "T05n0220_041:0229c22_5"
    },
    {
        "source_sentence": "善現答言：「所謂健行三摩地、寶印三摩地、師子遊戲三摩地、妙月三摩地、月幢相三摩地、一切法海三摩地、觀頂三摩地、法界決定三摩地、決定幢相三摩地、金剛喻三摩地、入法印三摩地、三摩地王三摩地、善安住三摩地、善立定王三摩地、放光三摩地、無忘失三摩地、放光無忘失三摩地、精進力三摩地、莊嚴力三摩地、等涌三摩地、入一切言詞決定三摩地、入一切名字決定三摩地、觀方三摩地、總持印三摩地、諸法等趣海印三摩地、王印三摩地、遍覆虛空三摩地、金剛輪三摩地、三輪清淨三摩地、無量光三摩地、無著無障三摩地、斷諸法轉三摩地、棄捨珍寶三摩地、遍照三摩地、不眴三摩地、無相住三摩地、不思惟三摩地、降伏四魔三摩地、無垢燈三摩地、無邊光三摩地、發光三摩地、普照三摩地、淨堅定三摩地、師子奮迅三摩地、師子頻申三摩地、師子欠呿三摩地、無垢光三摩地、妙樂三摩地、電燈三摩地、無盡三摩地、最勝幢相三摩地、帝相三摩地、順明正流三摩地、具威光三摩地、離盡三摩地、不可動轉三摩地、寂靜三摩地、無瑕隟三摩地、日燈三摩地、月淨三摩地、淨眼三摩地、淨光三摩地、月燈三摩地、發明三摩地、應作不應作三摩地、智相三摩地、金剛鬘三摩地、住心三摩地、普明三摩地、妙安立三摩地、寶積三摩地、妙法印三摩地、一切法性平等三摩地、棄捨塵愛三摩地、法涌圓滿三摩地、入法頂三摩地、寶性三摩地、捨喧諍三摩地、飄散三摩地、分別法句三摩地、決定三摩地、無垢行三摩地、字平等相三摩地、離文字相三摩地、斷所緣三摩地、無變異三摩地、無種類三摩地、入名相三摩地、無所作三摩地、入決定名三摩地、行無相三摩地、離翳闇三摩地、具行三摩地、不變動三摩地、度境界三摩地、集一切功德三摩地、無心住三摩地、決定住三摩地、淨妙花三摩地、具覺支三摩地、無邊辯三摩地、無邊燈三摩地、無等等三摩地、超一切法三摩地、決判諸法三摩地、散疑三摩地、無所住三摩地、一相莊嚴三摩地、引發行相三摩地、一行相三摩地、離諸行相三摩地、妙行三摩地、達諸有底遠離三摩地、入一切施設語言三摩地、堅固寶三摩地、於一切法無所取著三摩地、電焰莊嚴三摩地、除遣三摩地、無勝三摩地、法炬三摩地、慧燈三摩地、趣向不退轉神通三摩地、解脫音聲文字三摩地、炬熾然三摩地、嚴淨相三摩地、無相三摩地、無濁忍相三摩地、具一切妙相三摩地、具總持三摩地、不喜一切苦樂三摩地、無盡行相三摩地、攝伏一切正邪性三摩地、斷憎愛三摩地、離違順三摩地、無垢明三摩地、極堅固三摩地、滿月淨光三摩地、大莊嚴三摩地、無熱電光三摩地、能照一切世間三摩地、能救一切世間三摩地、定平等性三摩地、無塵有塵平等理趣三摩地、無諍有諍平等理趣三摩地、無巢穴無標幟無愛樂三摩地、決定安住真如三摩地、器中涌出三摩地、燒諸煩惱三摩地、大智慧炬三摩地、出生十力三摩地、開闡三摩地、壞身惡行三摩地、壞語惡行三摩地、壞意惡行三摩地、善觀察三摩地、如虛空三摩地、無染著如虛空三摩地。",
        "translation": "Shancheng replied, So-called健行三摩地、寶印三摩地、師子遊戲三摩地、妙月三摩地、月幢相三摩地、一切法海三摩地、觀頂三摩地、法界決定三摩地、決定幢相三摩地、金剛喻三摩地、入法印三摩地、三摩地王三",
        "source": "T05n0220_041:0229c22_6"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0230b26_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩於如是等諸三摩地恒住不捨，速證無上正等菩提。",
        "translation": "If bodhisattvas, mahāsattvas, always abide in such samādhis and don't abandon them, they will quickly realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_041:0230b26_8"
    },
    {
        "source_sentence": "復有所餘無量無數三摩地門、陀羅尼門，若菩薩摩訶薩能善修學，亦令速證阿耨多羅三藐三菩提。」",
        "translation": "Again, there are measureless and countless other approaches to samādhi and dhāraṇī teachings, and if bodhisattvas, mahāsattvas, can skillfully cultivate them, they'll also quickly realize unsurpassed, correct, and complete enlightenment.",
        "source": "T05n0220_041:0230b28_9"
    },
    {
        "source_sentence": "爾時，具壽善現承佛神力語舍利子言：「若菩薩摩訶薩住如是等三摩地者，",
        "translation": "It was then that the Buddha spoke to Śāriputra through his supernatural powers, saying, Suppose a bodhisattva Mahāsattva abides in such concentration as this:",
        "source": "T05n0220_041:0230c02_0"
    },
    {
        "source_sentence": "當知已為過去諸佛之所授記，亦為現在十方諸佛之所授記。",
        "translation": "You should know that they've been predicted by the buddhas of the past and are also predicted by the buddhas of the present in the ten directions.",
        "source": "T05n0220_041:0230c03_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0230c05_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩，雖住如是諸三摩地，而不見此諸三摩地，亦不著此諸三摩地，",
        "translation": "“Even though the bodhisattva Mahāsattva abides in these concentrations, he doesn’t see them and doesn’t cling to them.",
        "source": "T05n0220_041:0230c05_3"
    },
    {
        "source_sentence": "亦不念言：『我已入此諸三摩地，我今入此諸三摩地，我當入此諸三摩地，",
        "translation": "Nor do they think, ‘I have entered these concentrations.",
        "source": "T05n0220_041:0230c07_0"
    },
    {
        "source_sentence": "唯我能入非餘所能。』",
        "translation": "Only I can enter it, not the others.'",
        "source": "T05n0220_041:0230c08_1"
    },
    {
        "source_sentence": "彼如是等尋思分別，由斯定力皆不現行。」",
        "translation": "Such kinds of discursive thought and discrimination don't occur because of the power of this concentration.",
        "source": "T05n0220_041:0230c09_2"
    },
    {
        "source_sentence": "時，舍利子問善現言：「為別實有菩薩摩訶薩住如是等諸三摩地，已為過去現在諸佛所授記耶？」",
        "translation": "Śāriputra then asked the good manifestation, Is there really a separate bodhisattva Mahāsattva who abides in such-and-such samādhi and has been taught by the buddhas of the past and present?",
        "source": "T05n0220_041:0230c10_3"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T05n0220_041:0230c12_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0230c12_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0230c12_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0230c13_0"
    },
    {
        "source_sentence": "般若波羅蜜多不異諸三摩地，諸三摩地不異般若波羅蜜多。",
        "translation": "The prajñāpāramitā is not different from the samādhis, and the samādhis are not different from the prajñāpāramitā.",
        "source": "T05n0220_041:0230c13_1"
    },
    {
        "source_sentence": "菩薩摩訶薩不異般若波羅蜜多及三摩地，般若波羅蜜多及三摩地不異菩薩摩訶薩。",
        "translation": "The bodhisattva Mahāsattva isn't different from the prajñāpāramitā and samādhi, and the prajñāpāramitā and samādhi aren't different from the bodhisattva Mahāsattva.",
        "source": "T05n0220_041:0230c14_2"
    },
    {
        "source_sentence": "般若波羅蜜多即是諸三摩地，諸三摩地即是般若波羅蜜多。",
        "translation": "The prajñāpāramitā is the samādhis, and the samādhis are the prajñāpāramitā.",
        "source": "T05n0220_041:0230c16_3"
    },
    {
        "source_sentence": "菩薩摩訶薩即是般若波羅蜜多及三摩地，般若波羅蜜多及三摩地即是菩薩摩訶薩。",
        "translation": "The bodhisattva-mahāsattva is the prajñāpāramitā and samādhi, and the prajñāpāramitā and samādhi are the bodhisattva-mahāsattva.",
        "source": "T05n0220_041:0230c18_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T05n0220_041:0230c20_0"
    },
    {
        "source_sentence": "以一切法性平等故。」",
        "translation": "It's because the nature of all dharmas is equal.",
        "source": "T05n0220_041:0230c20_1"
    },
    {
        "source_sentence": "舍利子言：「若一切法性平等者，此三摩地可示現不？」",
        "translation": "Śāriputra said, If the nature of all dharmas is equal, can this samādhi be shown?",
        "source": "T05n0220_041:0230c20_2"
    },
    {
        "source_sentence": "善現答言：「不可示現。」",
        "translation": "The good manifestation replied, They can't be shown.",
        "source": "T05n0220_041:0230c21_3"
    },
    {
        "source_sentence": "舍利子言：「是菩薩摩訶薩於此三摩地有想解不？」",
        "translation": "Śāriputra said, Does the bodhisattva Mahāsattva have conceptual understanding of this samādhi?",
        "source": "T05n0220_041:0230c22_4"
    },
    {
        "source_sentence": "善現答言：「彼無想解。」",
        "translation": "The good manifestation replied, They have no ideation and understanding.",
        "source": "T05n0220_041:0230c23_5"
    },
    {
        "source_sentence": "舍利子言：「彼何故無想解？」",
        "translation": "Śāriputra said, Why doesn't he understand without perception?",
        "source": "T05n0220_041:0230c24_0"
    },
    {
        "source_sentence": "善現答言：「彼無分別故。」",
        "translation": "The good manifestation replied, It's because they don't discriminate.",
        "source": "T05n0220_041:0230c24_1"
    },
    {
        "source_sentence": "舍利子言：「彼何故無分別？」",
        "translation": "Śāriputra said, Why is there no distinction between them?",
        "source": "T05n0220_041:0230c25_2"
    },
    {
        "source_sentence": "善現答言：「一切法性都無所有故，彼於定不起分別。",
        "translation": "Sunetra replied, Because the nature of all dharmas has no existence, they don't discriminate in concentration.",
        "source": "T05n0220_041:0230c25_3"
    },
    {
        "source_sentence": "由此因緣，是菩薩摩訶薩於一切法及三摩地俱無想解。",
        "translation": "Because of these causes and conditions, this is the bodhisattva-mahāsattva's understanding that all dharmas and samādhi are both without ideation.",
        "source": "T05n0220_041:0230c27_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0230c28_1"
    },
    {
        "source_sentence": "以一切法及三摩地俱無所有，無所有中分別想解無由起故。」",
        "translation": "It's because all dharmas and samādhi are both nonexistent, and in the absence of existence, discriminating conceptions and understandings have no way to arise.",
        "source": "T05n0220_041:0230c28_2"
    },
    {
        "source_sentence": "時，薄伽梵讚善現言：「善哉！",
        "translation": "The Bhagavān then praised the good manifestation, saying, Good!",
        "source": "T05n0220_041:0230c29_3"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T05n0220_041:0231a01_4"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T05n0220_041:0231a01_5"
    },
    {
        "source_sentence": "故我說汝住無諍定聲聞眾中最為第一，由斯我說與義相應。",
        "translation": "Therefore, I say that you are the foremost among the śrāvakas who abide in the absence of anger. Because of this, my explanation is consistent with its meaning.",
        "source": "T05n0220_041:0231a01_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T05n0220_041:0231a03_7"
    },
    {
        "source_sentence": "菩薩摩訶薩欲學般若波羅蜜多應如是學，欲學靜慮、精進、安忍、淨戒、布施波羅蜜多應如是學。",
        "translation": "If bodhisattvas, mahāsattvas, want to train in the perfection of wisdom, they should train in this way, and if they want to train in the perfections of meditation, effort, patience, forbearance, pure morality, and generosity, they should train in this way.",
        "source": "T05n0220_041:0231a03_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T05n0220_041:0231a05_9"
    },
    {
        "source_sentence": "菩薩摩訶薩欲學四靜慮應如是學，欲學四無量、四無色定應如是學。",
        "translation": "When bodhisattvas, mahāsattvas, want to train in the four meditations, they should thus train, and when they want to train in the four immeasurable and four formless concentrations, they should thus train.",
        "source": "T05n0220_041:0231a05_10"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T05n0220_041:0231a07_11"
    },
    {
        "source_sentence": "菩薩摩訶薩欲學四念住應如是學，欲學四正斷、四神足、五根、五力、七等覺支、八聖道支應如是學。",
        "translation": "If bodhisattvas, mahāsattvas, want to train in the four abodes of mindfulness, they should train in this way, and if they want to train in the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path, they should train in this",
        "source": "T05n0220_041:0231a07_12"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T05n0220_041:0231a09_13"
    },
    {
        "source_sentence": "菩薩摩訶薩欲學五眼應如是學，欲學六神通應如是學。",
        "translation": "If bodhisattvas and mahāsattvas want to train the five eyes, they should train them in this way, and if they want to train the six supernormal powers, they should train them in this way.",
        "source": "T05n0220_041:0231a09_14"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T05n0220_041:0231a11_15"
    },
    {
        "source_sentence": "菩薩摩訶薩欲學佛十力應如是學，欲學四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智應如是學。」",
        "translation": "If bodhisattvas, mahāsattvas, want to train in the Buddha's ten powers, they should thus train, and if they want to train in the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 Buddha-uncommon dharmas, omniscience, knowledge of the path,",
        "source": "T05n0220_041:0231a11_16"
    },
    {
        "source_sentence": "時，舍利子白佛言：「世尊！",
        "translation": "Śāriputra then said to the Buddha, Bhagavān!",
        "source": "T05n0220_041:0231a14_17"
    },
    {
        "source_sentence": "菩薩摩訶薩作如是學，為正學般若波羅蜜多，乃至為正學一切相智耶？」",
        "translation": "Is the bodhisattva Mahāsattva doing such training to correctly train in the perfection of wisdom and even correctly train in all characteristics?",
        "source": "T05n0220_041:0231a14_18"
    },
    {
        "source_sentence": "佛告舍利子：「菩薩摩訶薩作如是學，為正學般若波羅蜜多，以無所得為方便故。",
        "translation": "The Buddha told Śāriputra, This is how the bodhisattva Mahāsattva does his training, which is to correctly train in the prajñāpāramitā because of the method of having nothing to attain.",
        "source": "T05n0220_041:0231a16_19"
    },
    {
        "source_sentence": "乃至為正學一切相智，以無所得為方便故。」",
        "translation": "It's because it's the method of correctly training in all characteristics and cognition with nothing to attain.",
        "source": "T05n0220_041:0231a18_20"
    },
    {
        "source_sentence": "時，舍利子復白佛言：「世尊！",
        "translation": "Śāriputra then again said to the Buddha, Bhagavān!",
        "source": "T05n0220_041:0231a19_21"
    },
    {
        "source_sentence": "菩薩摩訶薩作如是學，以無所得為方便學般若波羅蜜多，乃至以無所得為方便學一切相智耶？」",
        "translation": "Does the bodhisattva Mahāsattva thus train, training in prajñāpāramitā with nothing to gain as a method and training in all characteristics of cognition with nothing to gain as a method?",
        "source": "T05n0220_041:0231a19_22"
    },
    {
        "source_sentence": "佛告舍利子：「菩薩摩訶薩作如是學，以無所得為方便學般若波羅蜜多，",
        "translation": "The Buddha told Śāriputra, Thus do bodhisattvas and mahāsattvas train in the perfection of wisdom with ungraspable skillful means.",
        "source": "T05n0220_041:0231a22_23"
    },
    {
        "source_sentence": "乃至以無所得為方便學一切相智。」",
        "translation": "It's even the method of training in all kinds of cognition with the absence of attainment.",
        "source": "T05n0220_041:0231a23_24"
    },
    {
        "source_sentence": "舍利子言：「無所得者，為何等法不可得耶？」",
        "translation": "Śāriputra said, What's an ungraspable thing that's ungraspable?",
        "source": "T05n0220_041:0231a24_25"
    },
    {
        "source_sentence": "佛言：「我不可得，畢竟淨故；",
        "translation": "The Buddha said: I cannot obtain it, because of my ultimate purity.",
        "source": "T05n0220_041:0231a25_26"
    },
    {
        "source_sentence": "有情、命者、生者、養者、士夫、數取趣、意生、儒童、作者、使作者、起者、使起者、受者、使受者、知者、見者不可得，",
        "translation": "Sentient beings, the giver of life, the giver of birth, the giver of nourishment, the hero, the person who repeatedly apprehends destinies, the mind-made one, the youthful child, the author, the envoy author, the initiator, the messenger that arises, the initiator and the receiver, the envoy that receives, the knower and the",
        "source": "T05n0220_041:0231a26_27"
    },
    {
        "source_sentence": "畢竟淨故。",
        "translation": "It's because it's ultimately pure.",
        "source": "T05n0220_041:0231a28_28"
    },
    {
        "source_sentence": "色不可得，畢竟淨故；",
        "translation": "Form is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231a28_29"
    },
    {
        "source_sentence": "受、想、行、識不可得，畢竟淨故。",
        "translation": "Feeling, perception, volition, and consciousness are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231a29_30"
    },
    {
        "source_sentence": "眼處不可得，畢竟淨故；",
        "translation": "The sphere of the eye is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231a29_31"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處不可得，畢竟淨故。",
        "translation": "The sense-fields of ear, nose, tongue, body, and mind are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b01_32"
    },
    {
        "source_sentence": "色處不可得，畢竟淨故；",
        "translation": "The realm of form is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231b02_33"
    },
    {
        "source_sentence": "聲、香、味、觸、法處不可得，畢竟淨故。",
        "translation": "The sense-fields of sound, odor, taste, touch and dharmas are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b02_34"
    },
    {
        "source_sentence": "眼界、色界、眼識界及眼觸、眼觸為緣所生諸受不可得，畢竟淨故；",
        "translation": "The element eye, the element matter, the element eye consciousness and the sensations that arise by means of eye contact and eye contact as supporting object are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b03_35"
    },
    {
        "source_sentence": "耳界、聲界、耳識界及耳觸、耳觸為緣所生諸受不可得，畢竟淨故；",
        "translation": "The ear realm, the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as supporting object are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b04_36"
    },
    {
        "source_sentence": "鼻界、香界、鼻識界及鼻觸、鼻觸為緣所生諸受不可得，畢竟淨故；",
        "translation": "The sense element nose, the sense element odor, the sense element smell, the sense element consciousness of nose, and the sensations that arise from nasal contact and nasal contact as supporting object are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b06_37"
    },
    {
        "source_sentence": "舌界、味界、舌識界及舌觸、舌觸為緣所生諸受不可得，畢竟淨故；",
        "translation": "The element of tongue, the element of taste, the element of consciousness of tongue, and the sensations that arise from tongue contact and tongue contact as supporting object are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b07_38"
    },
    {
        "source_sentence": "身界、觸界、身識界及身觸、身觸為緣所生諸受不可得，畢竟淨故；",
        "translation": "The element body, the element of tangible things, the element bodily consciousness, and the sensations that arise from bodily contact and bodily contact as supporting object are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b09_39"
    },
    {
        "source_sentence": "意界、法界、意識界及意觸、意觸為緣所生諸受不可得，畢竟淨故。",
        "translation": "The mind realm, the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b10_40"
    },
    {
        "source_sentence": "地界不可得，畢竟淨故；",
        "translation": "The earth element is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231b12_41"
    },
    {
        "source_sentence": "水、火、風、空、識界不可得，畢竟淨故。",
        "translation": "Water, fire, wind, air, space, and the consciousness realm are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b12_42"
    },
    {
        "source_sentence": "欲界不可得，畢竟淨故；",
        "translation": "The realm of sexual passion is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231b13_43"
    },
    {
        "source_sentence": "色、無色界不可得，畢竟淨故。",
        "translation": "The form and formless realms are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b13_44"
    },
    {
        "source_sentence": "苦聖諦不可得，畢竟淨故；",
        "translation": "The noble truth of suffering is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231b14_45"
    },
    {
        "source_sentence": "集、滅、道聖諦不可得，畢竟淨故。",
        "translation": "The noble truths of arising, cessation, and the path are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b15_46"
    },
    {
        "source_sentence": "無明不可得，畢竟淨故；",
        "translation": "nescience is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231b15_47"
    },
    {
        "source_sentence": "行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱不可得，",
        "translation": "Form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, and vexation are unobtainable.",
        "source": "T05n0220_041:0231b16_48"
    },
    {
        "source_sentence": "畢竟淨故。",
        "translation": "It's because it's ultimately pure.",
        "source": "T05n0220_041:0231b17_49"
    },
    {
        "source_sentence": "四靜慮不可得，畢竟淨故；",
        "translation": "The four meditations are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b17_50"
    },
    {
        "source_sentence": "四無量、四無色定不可得，畢竟淨故。",
        "translation": "The four immeasurable and four formless concentrations are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b18_51"
    },
    {
        "source_sentence": "四念住不可得，畢竟淨故；",
        "translation": "The four abodes of mindfulness are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b19_52"
    },
    {
        "source_sentence": "四正斷、四神足、五根、五力、七等覺支、八聖道支不可得，畢竟淨故。",
        "translation": "The fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b19_53"
    },
    {
        "source_sentence": "布施波羅蜜多不可得，畢竟淨故；",
        "translation": "The perfection of giving is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231b21_54"
    },
    {
        "source_sentence": "淨戒、安忍、精進、靜慮、般若波羅蜜多不可得，畢竟淨故。",
        "translation": "The pure precepts, patience, effort, meditation, and the perfection of wisdom are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b22_55"
    },
    {
        "source_sentence": "五眼不可得，畢竟淨故；",
        "translation": "The five eyes are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b23_56"
    },
    {
        "source_sentence": "六神通不可得，畢竟淨故。",
        "translation": "The six supernormal powers are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b23_57"
    },
    {
        "source_sentence": "佛十力不可得，畢竟淨故；",
        "translation": "The ten powers of buddhas are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b24_58"
    },
    {
        "source_sentence": "四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智不可得，",
        "translation": "The four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the unique qualities of the eighteen buddhas, omniscience, knowledge of the path, and knowledge of all characteristics are ungraspable.",
        "source": "T05n0220_041:0231b25_0"
    },
    {
        "source_sentence": "畢竟淨故。",
        "translation": "It's because it's ultimately pure.",
        "source": "T05n0220_041:0231b26_1"
    },
    {
        "source_sentence": "預流不可得，畢竟淨故；",
        "translation": "Pre-flow is ungraspable because it is ultimately pure.",
        "source": "T05n0220_041:0231b27_2"
    },
    {
        "source_sentence": "一來、不還、阿羅漢不可得，畢竟淨故。",
        "translation": "The once-returner, the nonreturner, and the arhat are unobtainable because they are ultimately pure.",
        "source": "T05n0220_041:0231b27_3"
    },
    {
        "source_sentence": "獨覺不可得，畢竟淨故；",
        "translation": "The pratyekabuddhas are ungraspable because they are ultimately pure.",
        "source": "T05n0220_041:0231b28_4"
    },
    {
        "source_sentence": "菩薩不可得，畢竟淨故；",
        "translation": "Enlightening beings cannot be obtained because they are ultimately pure.",
        "source": "T05n0220_041:0231b29_5"
    },
    {
        "source_sentence": "如來不可得，畢竟淨故。」",
        "translation": "The Tathāgata is unobtainable because it's ultimately pure.",
        "source": "T05n0220_041:0231b29_6"
    },
    {
        "source_sentence": "舍利子言：「世尊！",
        "translation": "Śāriputra said, Bhagavān!",
        "source": "T05n0220_041:0231c01_7"
    },
    {
        "source_sentence": "所說畢竟淨者是何等義？」",
        "translation": "What's the meaning of what's called ultimate purity?",
        "source": "T05n0220_041:0231c01_8"
    },
    {
        "source_sentence": "佛言：「諸法不出不生、不沒不盡、無染無淨、無得無為，如是名為畢竟淨義。」",
        "translation": "The Buddha said, All dharmas that don't arise and don't arise, don't disappear and don't end, are neither defiled nor pure, and have no attainment or non-being, such is called the ultimate meaning of purity.",
        "source": "T05n0220_041:0231c02_9"
    },
    {
        "source_sentence": "爾時，舍利子白佛言：「世尊！",
        "translation": "It was then that Śāriputra said to the Buddha, Bhagavān!",
        "source": "T05n0220_041:0231c04_0"
    },
    {
        "source_sentence": "菩薩摩訶薩如是學時為學何法？」",
        "translation": "What teaching does a bodhisattva-mahāsattva train in when he thus trains?",
        "source": "T05n0220_041:0231c04_1"
    },
    {
        "source_sentence": "佛告舍利子：「菩薩摩訶薩如是學時，於一切法都無所學。",
        "translation": "The Buddha told Śāriputra, When bodhisattvas and mahāsattvas thus train, they don't train in all dharmas.",
        "source": "T05n0220_041:0231c05_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0231c06_3"
    },
    {
        "source_sentence": "非一切法如是而有如諸愚夫異生所執可於中學。」",
        "translation": "It's not that all dharmas are thus and thus existent like foolish people who cling to them in the middle way.",
        "source": "T05n0220_041:0231c06_4"
    },
    {
        "source_sentence": "舍利子言：「若爾諸法如何而有？」",
        "translation": "Śāriputra said, If that's the case, how could there be such things?",
        "source": "T05n0220_041:0231c08_5"
    },
    {
        "source_sentence": "佛言：「諸法如無所有如是而有，若於如是無所有法不能了達，說名無明。」",
        "translation": "The Buddha said, All dharmas are thus nonexistent and thus existent, and if they can't comprehend such nonexistent dharmas, they're called nescience.",
        "source": "T05n0220_041:0231c08_6"
    },
    {
        "source_sentence": "舍利子言：「何等法無所有，若不了達說名無明？」",
        "translation": "Śāriputra said, What kind of dharmas lack existence that are called ignorance if they don't understand it?",
        "source": "T05n0220_041:0231c10_7"
    },
    {
        "source_sentence": "佛言：「色無所有，受、想、行、識無所有，以內空故、外空故、內外空故、空空故、大空故、勝義空故、有為空故、無為空故、畢竟空故、無際空故、散空故、無變異空故、本性空故、自相空故、共相空故、一切法空故、不可得空故、無性空故、自性空故、無性自性空故。",
        "translation": "The Buddha said, Form has no existence, and feelings, perception, volition, and consciousness have no existence because of internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, emptiness of ultimate meaning, emptiness of becoming, emptiness of non-being, emptiness of",
        "source": "T05n0220_041:0231c11_8"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0231c17_9"
    },
    {
        "source_sentence": "眼處無所有，耳、鼻、舌、身、意處無所有，以內空故乃至無性自性空故。",
        "translation": "The sense-field of the eye has nothing, and the sense-fields of ear, nose, tongue, body, and mind have nothing, because it's empty internally or even empty of its own natureless self-nature.",
        "source": "T05n0220_041:0231c17_10"
    },
    {
        "source_sentence": "色處無所有，聲、香、味、觸、法處無所有，以內空故乃至無性自性空故。",
        "translation": "The form realm has no existence, and the sense-fields of sound, odor, taste, touch, and dharmas have no existence because they are empty internally or even empty of their own natureless self-nature.",
        "source": "T05n0220_041:0231c19_11"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0231c20_12"
    },
    {
        "source_sentence": "眼界、色界、眼識界及眼觸、眼觸為緣所生諸受無所有，以內空故乃至無性自性空故；",
        "translation": "The element of vision, the element matter, the element consciousness of vision and the sensations that arise from eye contact and eye contact as supporting object are nonexistent because of emptiness within.",
        "source": "T05n0220_041:0231c20_13"
    },
    {
        "source_sentence": "耳界、聲界、耳識界及耳觸、耳觸為緣所生諸受無所有，以內空故乃至無性自性空故；",
        "translation": "The ear realm, the sound realm, the ear realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as supporting conditions have no existence because of emptiness within.",
        "source": "T05n0220_041:0231c22_14"
    },
    {
        "source_sentence": "鼻界、香界、鼻識界及鼻觸、鼻觸為緣所生諸受無所有，以內空故乃至無性自性空故；",
        "translation": "The sense element nose, the sense element odor, the sense element smell, the sense element consciousness of nose, and the sensations that arise from nasal contact and nasal contact as supporting object have no existence because they are empty within.",
        "source": "T05n0220_041:0231c24_15"
    },
    {
        "source_sentence": "舌界、味界、舌識界及舌觸、舌觸為緣所生諸受無所有，以內空故乃至無性自性空故；",
        "translation": "The element of tongue, the element of taste, the element of tongue and consciousness, and the sensations that arise from tongue contact and tongue contact as supporting object are nonexistent because of emptiness within.",
        "source": "T05n0220_041:0231c26_16"
    },
    {
        "source_sentence": "身界、觸界、身識界及身觸、身觸為緣所生諸受無所有，以內空故乃至無性自性空故；",
        "translation": "The element of body, the element of tangible things, the element of bodily consciousness, and the sensations that arise from bodily contact and bodily contact as supporting conditions have no existence because they are inherently empty.",
        "source": "T05n0220_041:0231c28_17"
    },
    {
        "source_sentence": "意界、法界、意識界及意觸、意觸為緣所生諸受無所有，以內空故乃至無性自性空故。",
        "translation": "The mind realm, the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition have no existence because of internal emptiness or even because they are empty of their own natureless self-nature.",
        "source": "T05n0220_041:0232a01_18"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a03_19"
    },
    {
        "source_sentence": "地界無所有，水、火、風、空、識界無所有，以內空故乃至無性自性空故。",
        "translation": "The earth realm has no existence, and the water, fire, air, space, and consciousness realms have no existence because they are empty internally or even empty of their own natureless self-nature.",
        "source": "T05n0220_041:0232a03_20"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a05_21"
    },
    {
        "source_sentence": "欲界無所有，色、無色界無所有，以內空故乃至無性自性空故。",
        "translation": "The desire realm has nothing, and the form and formless realms have nothing, because it's internally empty... up to the emptiness of the natureless self-nature.",
        "source": "T05n0220_041:0232a05_22"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a06_23"
    },
    {
        "source_sentence": "苦聖諦無所有，集、滅、道聖諦無所有，以內空故乃至無性自性空故。",
        "translation": "The noble truth of suffering has no existence, and the noble truths of arising, ceasing, and the path have no existence because they are internally empty or even empty of their natureless self-nature.",
        "source": "T05n0220_041:0232a06_24"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a08_25"
    },
    {
        "source_sentence": "無明無所有，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱無所有，",
        "translation": "nescience has no existence, and conditioned phenomena, consciousness, name-and-form, the six sense-fields, touch, sensation, desire, craving, grasping, existence, birth, old age, sorrow, pain, vexation, suffering, grief, and vexation have no existence.",
        "source": "T05n0220_041:0232a08_26"
    },
    {
        "source_sentence": "以內空故乃至無性自性空故。",
        "translation": "It's because internal emptiness and even the emptiness of the natureless self-nature are empty.",
        "source": "T05n0220_041:0232a10_27"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a10_28"
    },
    {
        "source_sentence": "貪、瞋、癡無所有，諸見趣無所有，以內空故乃至無性自性空故。",
        "translation": "The craving, anger, and delusion lack existence, and the views and destinies lack existence because of internal emptiness up to the emptiness of the natureless self-nature.",
        "source": "T05n0220_041:0232a11_0"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a12_1"
    },
    {
        "source_sentence": "四靜慮無所有，四無量、四無色定無所有，以內空故乃至無性自性空故。",
        "translation": "The four meditations lack existence, and the four immeasurable and four formless concentrations lack existence because of internal emptiness up to the emptiness of the natureless self-nature.",
        "source": "T05n0220_041:0232a12_2"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a14_3"
    },
    {
        "source_sentence": "四念住無所有，四正斷、四神足、五根、五力、七等覺支、八聖道支無所有，",
        "translation": "The four abodes of mindfulness lack existence, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path lack existence.",
        "source": "T05n0220_041:0232a14_4"
    },
    {
        "source_sentence": "以內空故乃至無性自性空故。",
        "translation": "It's because internal emptiness and even the emptiness of the natureless self-nature are empty.",
        "source": "T05n0220_041:0232a16_0"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a16_1"
    },
    {
        "source_sentence": "布施波羅蜜多無所有，淨戒、安忍、精進、靜慮、般若波羅蜜多無所有，",
        "translation": "The perfection of generosity has nothing, and the perfections of pure morality, patience, effort, meditation, and wisdom have nothing.",
        "source": "T05n0220_041:0232a16_2"
    },
    {
        "source_sentence": "以內空故乃至無性自性空故。",
        "translation": "It's because internal emptiness and even the emptiness of the natureless self-nature are empty.",
        "source": "T05n0220_041:0232a18_3"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a19_4"
    },
    {
        "source_sentence": "五眼無所有，六神通無所有，以內空故乃至無性自性空故。",
        "translation": "The five eyes lack existence, and the six supernormal powers lack existence because of internal emptiness... up to the emptiness of the natureless self-nature.",
        "source": "T05n0220_041:0232a19_5"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a20_6"
    },
    {
        "source_sentence": "佛十力無所有，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智無所有，",
        "translation": "“The ten powers of buddhas have no existence: the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the eighteen unique qualities of buddhahood, omniscience, knowledge of the path, and knowledge of all characteristics have no existence.",
        "source": "T05n0220_041:0232a20_7"
    },
    {
        "source_sentence": "以內空故乃至無性自性空故。",
        "translation": "It's because internal emptiness and even the emptiness of the natureless self-nature are empty.",
        "source": "T05n0220_041:0232a23_8"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232a23_9"
    },
    {
        "source_sentence": "愚夫異生若於如是無所有法不能了達，說名無明。",
        "translation": "Foolish people say it's called ignorance if they can't understand such an existenceless thing.",
        "source": "T05n0220_041:0232a24_10"
    },
    {
        "source_sentence": "彼由無明及愛勢力，分別執著斷、常二邊，由此不知不見諸法無所有性，",
        "translation": "Because of the power of ignorance and craving, they discriminate and cling to the two extremes of cessation and permanence. As a result, they do not know or see that all things have no-essence.",
        "source": "T05n0220_041:0232a25_11"
    },
    {
        "source_sentence": "分別諸法。",
        "translation": "They discriminate the dharmas.",
        "source": "T05n0220_041:0232a26_12"
    },
    {
        "source_sentence": "由分別故，便執著色、受、想、行、識，乃至執著一切相智。",
        "translation": "Because of their discrimination, they then cling to form, feeling, perception, volition, consciousness, and even the cognition of all characteristics.",
        "source": "T05n0220_041:0232a27_13"
    },
    {
        "source_sentence": "由執著故，分別諸法無所有性，由此於法不知不見。」",
        "translation": "Because of their attachment, they discriminate qualities that lack the nature of existence and therefore don't know or see qualities.",
        "source": "T05n0220_041:0232a28_14"
    },
    {
        "source_sentence": "舍利子言：「於何等法不知不見？」",
        "translation": "Śāriputra said, What's the teaching that you don't know and don't see?",
        "source": "T05n0220_041:0232a29_15"
    },
    {
        "source_sentence": "佛言：「於色不知不見，於受、想、行、識不知不見，乃至於一切相智不知不見。",
        "translation": "The Buddha said, They don't know and don't see form, don't know and don't see sensation, perception, volition, or consciousness, and don't know and don't see all characteristics of cognition.",
        "source": "T05n0220_041:0232b01_16"
    },
    {
        "source_sentence": "由於諸法不知不見，墮在愚夫異生數中不能出離。」",
        "translation": "Because they don't know or see the teachings, they fall into the category of foolish and unenlightened people who can't escape.",
        "source": "T05n0220_041:0232b03_0"
    },
    {
        "source_sentence": "舍利子言：「彼於何處不能出離？」",
        "translation": "Śāriputra said, Where can they escape?",
        "source": "T05n0220_041:0232b04_1"
    },
    {
        "source_sentence": "佛言：「彼於欲界不能出離，於色界不能出離，於無色界不能出離。",
        "translation": "The Buddha said, They can't escape in the desire realm, they can't escape in the form realm, and they can't escape in the formless realm.",
        "source": "T05n0220_041:0232b04_2"
    },
    {
        "source_sentence": "由不能出離，於聲聞法不能成辦，於獨覺法不能成辦，於菩薩法不能成辦，",
        "translation": "Because they can’t get rid of it, they can’t accomplish the teachings of the disciples, the teachings of the solitary realizers, and the teachings of the enlightening beings.",
        "source": "T05n0220_041:0232b06_3"
    },
    {
        "source_sentence": "於如來法不能成辦，由不成辦不能信受。」",
        "translation": "They can't accomplish the Tathāgata's teaching; it's because they can't accomplish it that they can't believe in it.",
        "source": "T05n0220_041:0232b08_4"
    },
    {
        "source_sentence": "舍利子言：「彼於何法不能信受？」",
        "translation": "Śāriputra said, What teaching can they not believe and accept?",
        "source": "T05n0220_041:0232b09_5"
    },
    {
        "source_sentence": "佛言：「彼於色空不能信受，於受、想、行、識空不能信受，乃至於一切相智空不能信受，",
        "translation": "The Buddha said, They can't believe in the emptiness of form, they can't believe in the emptiness of feeling, perception, volition, or consciousness, and they can't believe in the emptiness of all characteristics and cognition.",
        "source": "T05n0220_041:0232b09_6"
    },
    {
        "source_sentence": "由不信受則不能住。」",
        "translation": "Because they don't believe and accept it, they can't abide.",
        "source": "T05n0220_041:0232b11_7"
    },
    {
        "source_sentence": "舍利子言：「於何等法彼不能住？」",
        "translation": "Śāriputra said, What's the teaching that they can't abide in?",
        "source": "T05n0220_041:0232b12_8"
    },
    {
        "source_sentence": "佛言：「謂不能住四念住，不能住四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "The Buddha said, It means they can't abide in the four abodes of mindfulness and can't abide in the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, or the eight noble factors of the path.",
        "source": "T05n0220_041:0232b12_9"
    },
    {
        "source_sentence": "不能住布施波羅蜜多，不能住淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "They can't abide in the perfection of generosity, and they can't abide in the perfections of pure morality, patience, effort, meditation, or wisdom.",
        "source": "T05n0220_041:0232b14_10"
    },
    {
        "source_sentence": "不能住不退轉地。",
        "translation": "They can't abide in the stage of nonretrogression.",
        "source": "T05n0220_041:0232b16_11"
    },
    {
        "source_sentence": "不能住五眼，不能住六神通。",
        "translation": "They can't abide in the five eyes, and they can't abide in the six supernormal powers.",
        "source": "T05n0220_041:0232b16_12"
    },
    {
        "source_sentence": "不能住佛十力，不能住四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智。",
        "translation": "They can't abide in the Buddha's ten powers, and they can't abide in the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, the 18 distinctive qualities of buddhahood, omniscience, knowledge of the path, knowledge of all characteristics, and knowledge of all characteristic",
        "source": "T05n0220_041:0232b17_13"
    },
    {
        "source_sentence": "由此故名愚夫異生，以於諸法執著有性。」",
        "translation": "That's why it's called a foolish ordinary person who clings to the existence of nature in things.",
        "source": "T05n0220_041:0232b19_14"
    },
    {
        "source_sentence": "舍利子言：「彼於何法執著有性？」",
        "translation": "Śāriputra said, What's the nature of their attachment to things?",
        "source": "T05n0220_041:0232b20_15"
    },
    {
        "source_sentence": "佛言：「舍利子！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T05n0220_041:0232b21_16"
    },
    {
        "source_sentence": "彼於色執著有性，於受、想、行、識執著有性。",
        "translation": "They cling to the existence of a nature in form, and they cling to the existence of a nature in sensation, perception, volition, and consciousness.",
        "source": "T05n0220_041:0232b21_17"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232b22_18"
    },
    {
        "source_sentence": "彼於眼處執著有性，於耳、鼻、舌、身、意處執著有性。",
        "translation": "They cling to the existence of nature in the eye, and they cling to the existence of nature in the ear, nose, tongue, body, and mind.",
        "source": "T05n0220_041:0232b22_19"
    },
    {
        "source_sentence": "於色處執著有性，於聲、香、味、觸、法處執著有性。",
        "translation": "They cling to existence in the form realm, and they cling to existence in the sound, smell, taste, touch, and dharma realms.",
        "source": "T05n0220_041:0232b23_20"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232b24_21"
    },
    {
        "source_sentence": "彼於眼界、色界、眼識界及眼觸、眼觸為緣所生諸受執著有性，於耳界、聲界、耳識界及耳觸、耳觸為緣所生諸受執著有性，",
        "translation": "They cling to the existence of sensations that arise from the eye realm, form realm, eye consciousness realm, eye contact and eye contact as perceptual objects as perceptual objects. They cling to the existence of sensations that arise from the ear realm, sound realm, ear consciousness realm, ear contact, and ear contact as perceptual objects",
        "source": "T05n0220_041:0232b24_22"
    },
    {
        "source_sentence": "於鼻界、香界、鼻識界及鼻觸、鼻觸為緣所生諸受執著有性，於舌界、味界、舌識界及舌觸、舌觸為緣所生諸受執著有性，",
        "translation": "They cling to the existence of sensations that arise from the nose realm, the sense realm of odor, the sense realm of smell, the sense realm of smell, the sense realm of taste, the sense realm of tongue consciousness, and the sensations that arise from tongue contact and tongue contact as objects.",
        "source": "T05n0220_041:0232b27_23"
    },
    {
        "source_sentence": "於身界、觸界、身識界及身觸、身觸為緣所生諸受執著有性，於意界、法界、意識界及意觸、意觸為緣所生諸受執著有性。",
        "translation": "They cling to the existence of the body realm, the touch realm, the body-consciousness realm, and the sensations that arise from bodily contact and bodily contact as a condition are attached to the existence of the mind realm, the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are attached to",
        "source": "T05n0220_041:0232c01_24"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c04_0"
    },
    {
        "source_sentence": "彼於地界執著有性，於水、火、風、空、識界執著有性。",
        "translation": "They cling to the existence of nature in the earth realm, and they cling to the existence of nature in the water, fire, wind, air, space, and consciousness realms.",
        "source": "T05n0220_041:0232c04_1"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c05_2"
    },
    {
        "source_sentence": "彼於欲界執著有性，於色、無色界執著有性。",
        "translation": "They cling to the existence of nature in the desire realm, and they cling to the existence of nature in form and formlessness.",
        "source": "T05n0220_041:0232c05_3"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c06_4"
    },
    {
        "source_sentence": "彼於苦聖諦執著有性，於集、滅、道聖諦執著有性。",
        "translation": "They cling to the existence of nature in the noble truth of suffering, and they cling to the existence of nature in the noble truths of arising, ceasing, and the path.",
        "source": "T05n0220_041:0232c06_5"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c07_6"
    },
    {
        "source_sentence": "彼於無明執著有性，於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱執著有性。",
        "translation": "They cling to the existence of nature in nescience, and they cling to the existence of nature in volition, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, attachment, existence, birth, old age, grief, pain, sorrow, pain, and vexation.",
        "source": "T05n0220_041:0232c07_7"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c09_8"
    },
    {
        "source_sentence": "彼於貪、瞋、癡執著有性，於諸見趣執著有性。",
        "translation": "They cling to the existence of craving, anger, and delusion, and they cling to the existence of views as destinies.",
        "source": "T05n0220_041:0232c10_0"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c11_0"
    },
    {
        "source_sentence": "彼於四靜慮執著有性，於四無量、四無色定執著有性。",
        "translation": "They cling to the existence of nature in the four meditations, and they cling to the existence of nature in the four immeasurable and four formless concentrations.",
        "source": "T05n0220_041:0232c11_1"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c12_2"
    },
    {
        "source_sentence": "彼於四念住執著有性，於四正斷、四神足、五根、五力、七等覺支、八聖道支執著有性。",
        "translation": "They cling to the existence of the four abodes of mindfulness, and they cling to the existence of the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T05n0220_041:0232c12_3"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c14_4"
    },
    {
        "source_sentence": "彼於布施波羅蜜多執著有性，於淨戒、安忍、精進、靜慮、般若波羅蜜多執著有性。",
        "translation": "They cling to the existence of nature in the perfection of generosity, and they cling to the existence of nature in the perfections of pure morality, patience, effort, meditation, and wisdom.",
        "source": "T05n0220_041:0232c14_5"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c16_6"
    },
    {
        "source_sentence": "彼於五眼執著有性，於六神通執著有性。",
        "translation": "They cling to the existence of nature in the five eyes, and they cling to the existence of nature in the six supernormal powers.",
        "source": "T05n0220_041:0232c16_7"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c17_8"
    },
    {
        "source_sentence": "彼於佛十力執著有性，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智執著有性。",
        "translation": "They cling to the existence of the ten powers of the Buddha, and they cling to the existence of the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, 18 distinctive qualities of the Buddha, omniscience, knowledge of the path, knowledge of all characteristics, and knowledge of",
        "source": "T05n0220_041:0232c17_9"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0232c20_10"
    },
    {
        "source_sentence": "愚夫異生以於諸法執著有性，於諸法空不能信受。",
        "translation": "Foolishly, ordinary people cling to the existence of dharmas and can't believe in the emptiness of dharmas because they cling to their nature.",
        "source": "T05n0220_041:0232c20_11"
    },
    {
        "source_sentence": "由不信故，不能成辦聲聞、獨覺、菩薩、如來所有聖法，故於聖法不能安住。",
        "translation": "Because they don't believe it, they can't accomplish the noble dharmas of śrāvakas, pratyekbuddhas, bodhisattvas, and tathāgatas, so they can't abide in the noble dharmas.",
        "source": "T05n0220_041:0232c21_12"
    },
    {
        "source_sentence": "是故，舍利子！",
        "translation": "Therefore, Sāriputta!",
        "source": "T05n0220_041:0232c23_13"
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲學般若波羅蜜多，欲成辦一切智、道相智、一切相智，",
        "translation": "“When great enlightening beings want to learn the perfection of wisdom, they want to perfect omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T05n0220_041:0232c23_14"
    },
    {
        "source_sentence": "當以無所得為方便如應而學。」",
        "translation": "You should train with the method of following what's unobtainable as appropriate.",
        "source": "T05n0220_041:0232c25_15"
    },
    {
        "source_sentence": "爾時，舍利子白佛言：「世尊！",
        "translation": "It was then that Śāriputra said to the Buddha, Bhagavān!",
        "source": "T05n0220_041:0232c26_0"
    },
    {
        "source_sentence": "為有菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智不？」",
        "translation": "Is there a bodhisattva-mahāsattva who thus trains and doesn't train in the perfection of wisdom that doesn't accomplish omniscience?",
        "source": "T05n0220_041:0232c26_1"
    },
    {
        "source_sentence": "佛告舍利子：「有菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。」",
        "translation": "The Buddha told Śāriputra, There are bodhisattvas and mahāsattvas who do such training but don't train in the perfection of wisdom that they can't attain omniscience.",
        "source": "T05n0220_041:0232c28_2"
    },
    {
        "source_sentence": "舍利子言：「世尊！",
        "translation": "Śāriputra said, Bhagavān!",
        "source": "T05n0220_041:0233a01_3"
    },
    {
        "source_sentence": "何緣有菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智？」",
        "translation": "Why is it that a bodhisattva-mahāsattva who thus trains and doesn't train in the perfection of wisdom can't attain omniscience?",
        "source": "T05n0220_041:0233a01_4"
    },
    {
        "source_sentence": "佛言：「舍利子！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T05n0220_041:0233a03_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於般若波羅蜜多分別執著，於靜慮、精進、安忍、淨戒、布施波羅蜜多分別執著，",
        "translation": "If a bodhisattva Mahāsattva lacks skillful means and discriminates attachment to the perfections of prajñāpāramitā and discriminates attachment to the perfections of meditation, effort, patience, pure morality, and generosity,",
        "source": "T05n0220_041:0233a03_6"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233a05_7"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233a07_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於色分別執著，於受、想、行、識分別執著，",
        "translation": "“If great enlightening beings lack skill in means, they discriminate and attach to form and discriminate and attach to sensation, perception, volition, and consciousness.",
        "source": "T05n0220_041:0233a07_9"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233a09_10"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233a10_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於眼處分別執著，於耳、鼻、舌、身、意處分別執著，",
        "translation": "“If great enlightening beings lack skill in liberative technique discriminate and attach to the sense-fields of the eye, they discriminate and attach to the sense-fields of ear, nose, tongue, body, and mind.",
        "source": "T05n0220_041:0233a10_12"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233a12_13"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233a14_14"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於色處分別執著，於聲、香、味、觸、法處分別執著，",
        "translation": "“If great enlightening beings have no skillful means and discriminate their attachment to form, or discriminate their attachment to sound, odor, taste, touch, or phenomena,",
        "source": "T05n0220_041:0233a14_15"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233a16_16"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233a17_17"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於眼界、色界、眼識界及眼觸、眼觸為緣所生諸受分別執著，",
        "translation": "“If great enlightening beings lack skill in means, they discriminate and cling to the eye realm, the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as perceptual objects:",
        "source": "T05n0220_041:0233a17_18"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233a19_19"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233a21_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於耳界、聲界、耳識界及耳觸、耳觸為緣所生諸受分別執著，",
        "translation": "“If great enlightening beings lack skill in means, they discriminate and cling to the ear realm, the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as perceptual objects:",
        "source": "T05n0220_041:0233a21_21"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233a23_22"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233a25_23"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於鼻界、香界、鼻識界及鼻觸、鼻觸為緣所生諸受分別執著，",
        "translation": "If the bodhisattva Mahāsattva doesn't skillfully and skillfully discriminate and attach to the nose realm, the fragrance realm, the nose consciousness realm, and the sensations that arise from nose contact and nose contact as perceptual objects without skillful means,",
        "source": "T05n0220_041:0233a25_24"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233a27_25"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b01_26"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於舌界、味界、舌識界及舌觸、舌觸為緣所生諸受分別執著，",
        "translation": "“If great enlightening beings lack skill in means and discriminate and cling to the taste realm of the tongue, the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as perceptual objects,",
        "source": "T05n0220_041:0233b01_27"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233b03_28"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b04_29"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於身界、觸界、身識界及身觸、身觸為緣所生諸受分別執著，",
        "translation": "“If great enlightening beings lack skill in means, they discriminate and cling to the body realm, touch realm, body consciousness realm, and all sensations that arise from body contact and body contact as perceptual objects.",
        "source": "T05n0220_041:0233b04_30"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233b06_31"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b08_32"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於意界、法界、意識界及意觸、意觸為緣所生諸受分別執著，",
        "translation": "“If great enlightening beings lack skill in means, they discriminate and cling to the mental realm, the realm of reality, the realm of consciousness, the realm of manas, and the sensations that arise from mental contact and mental contact as objects.",
        "source": "T05n0220_041:0233b08_33"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233b10_34"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b12_35"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於地界分別執著，於水、火、風、空、識界分別執著，",
        "translation": "“If great enlightening beings lack skill in liberative technique discriminate and attach to the earth realm, they discriminate and attach to water, fire, wind, air, space, and consciousness realms.",
        "source": "T05n0220_041:0233b12_36"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233b14_37"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b15_38"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於苦聖諦分別執著，於集、滅、道聖諦分別執著，",
        "translation": "“If great enlightening beings lack skill in means and discriminate and attach to the noble truth of suffering, and discriminate and attach to the noble truths of accumulation, cessation, and the path,",
        "source": "T05n0220_041:0233b15_39"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233b17_40"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b19_41"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於無明分別執著，於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱分別執著，",
        "translation": "If the bodhisattva Mahāsattva skillfully discriminates and attaches to nescience without skillful means, and discriminates and attaches to form, consciousness, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, vexation, suffering,",
        "source": "T05n0220_041:0233b19_42"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233b21_43"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b23_44"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於四靜慮分別執著，於四無量、四無色定分別執著，",
        "translation": "“If great enlightening beings lack skill in liberative technique discriminate and attach themselves to the four meditations, and they discriminate and attach themselves to the four immeasurable concentrations and the four formless concentrations,",
        "source": "T05n0220_041:0233b23_45"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233b25_46"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233b27_47"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於四念住分別執著，於四正斷、四神足、五根、五力、七等覺支、八聖道支分別執著，",
        "translation": "If a bodhisattva Mahāsattva lacks skillful means and discriminates and attaches to the four abodes of mindfulness, he discriminates and attaches to the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T05n0220_041:0233b27_48"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233c01_49"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233c03_50"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於五眼分別執著，於六神通分別執著，如是菩薩摩訶薩作如是學，",
        "translation": "If the bodhisattva Mahāsattva has no skillful means and discriminates attachment to the five eyes and discriminates attachment to the six supernormal powers, then this is how the bodhisattva Mahāsattva does his training.",
        "source": "T05n0220_041:0233c03_51"
    },
    {
        "source_sentence": "非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "If someone doesn't train in the perfection of prajñāpāramitā, they can't attain omniscience.",
        "source": "T05n0220_041:0233c05_52"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233c06_53"
    },
    {
        "source_sentence": "若菩薩摩訶薩無方便善巧，於佛十力分別執著，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智分別執著，",
        "translation": "If the bodhisattva Mahāsattva has no skillful means and discriminates and attaches to the Buddha's ten powers, then he discriminates and attachs to the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, 18 Buddha-uncommon dharmas, omniscience, knowledge of the",
        "source": "T05n0220_041:0233c06_54"
    },
    {
        "source_sentence": "如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。",
        "translation": "Thus, the bodhisattva Mahāsattva thus trains and doesn't train in the perfection of wisdom, and he can't attain omniscience.",
        "source": "T05n0220_041:0233c10_0"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0233c11_1"
    },
    {
        "source_sentence": "以是因緣，有菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。」",
        "translation": "It's because of these causes and conditions that there are bodhisattvas, mahāsattvas, who do this kind of training but don't train in the perfection of wisdom and can't attain omniscience.",
        "source": "T05n0220_041:0233c11_2"
    },
    {
        "source_sentence": "舍利子言：「如是菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智耶？」",
        "translation": "Śāriputra said, Thus, can a bodhisattva-mahāsattva who thus trains and doesn't train in the perfection of wisdom not attain omniscience?",
        "source": "T05n0220_041:0233c13_3"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T05n0220_041:0233c15_4"
    },
    {
        "source_sentence": "菩薩摩訶薩作如是學，非學般若波羅蜜多，不能成辦一切智智。」",
        "translation": "A bodhisattva-mahāsattva who thus trains and doesn't train in the perfection of wisdom won't attain omniscience.",
        "source": "T05n0220_041:0233c15_5"
    },
    {
        "source_sentence": "時，舍利子復白佛言：「世尊！",
        "translation": "Śāriputra then again said to the Buddha, Bhagavān!",
        "source": "T05n0220_041:0233c17_6"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修行般若波羅蜜多時，是學般若波羅蜜多，則能成辦一切智智？」",
        "translation": "How does a bodhisattva-mahāsattva who cultivates the perfection of prajñāpāramitā train in the perfection of prajñāpāramitā and then be able to attain omniscience?",
        "source": "T05n0220_041:0233c17_7"
    },
    {
        "source_sentence": "佛告舍利子：「若菩薩摩訶薩修行般若波羅蜜多時，不見般若波羅蜜多，",
        "translation": "The Buddha told Śāriputra, If a bodhisattva Mahāsattva doesn't see the perfection of wisdom when he cultivates the perfection of wisdom,",
        "source": "T05n0220_041:0233c19_8"
    },
    {
        "source_sentence": "乃至不見一切相智，是學般若波羅蜜多，則能成辦一切智智。",
        "translation": "If someone doesn't see the cognition of all characteristics, they're training in the perfection of prajñāpāramitā, and then they can accomplish the cognition of all characteristics.",
        "source": "T05n0220_041:0233c21_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_041:0233c22_10"
    },
    {
        "source_sentence": "以無所得為方便故。」",
        "translation": "It's because the ungraspable is the method.",
        "source": "T05n0220_041:0233c22_11"
    },
    {
        "source_sentence": "舍利子言：「是菩薩摩訶薩於何法無所得為方便？」",
        "translation": "Śāriputra said, What's the method for this bodhisattva Mahāsattva to attain nothing?",
        "source": "T05n0220_041:0233c23_12"
    },
    {
        "source_sentence": "佛言：「是菩薩摩訶薩於布施波羅蜜多無所得為方便，於淨戒、安忍、精進、靜慮、般若波羅蜜多無所得為方便，",
        "translation": "The Buddha said, This is the method for a bodhisattva-mahāsattva to attain nothing from the perfection of generosity and the method for attaining nothing from the perfections of pure morality, patience, effort, meditation, and wisdom.",
        "source": "T05n0220_041:0233c24_13"
    },
    {
        "source_sentence": "乃至於佛十力無所得為方便，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法、一切智、道相智、一切相智無所得為方便。」",
        "translation": "It's the method of attaining nothing to be gained from the Buddha's ten powers, and it's the method of attaining nothing to be gained from the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, the 18 distinctive qualities of the Buddha, omniscience",
        "source": "T05n0220_041:0233c26_14"
    },
    {
        "source_sentence": "舍利子言：「是菩薩摩訶薩修行般若波羅蜜多時，何故以無所得為方便？」",
        "translation": "Śāriputra said, When this bodhisattva Mahāsattva cultivates the perfection of wisdom, why does he make ungraspable as his method?",
        "source": "T05n0220_041:0234a01_15"
    },
    {
        "source_sentence": "佛言：「是菩薩摩訶薩修行般若波羅蜜多時，以內空故無所得為方便，",
        "translation": "The Buddha said, When the bodhisattva Mahāsattva cultivates the perfection of wisdom, it's because internal emptiness is ungraspable as a method.",
        "source": "T05n0220_041:0234a03_16"
    },
    {
        "source_sentence": "乃至以無性自性空故無所得為方便。",
        "translation": "It's because the self-nature of absence of nature is empty and therefore ungraspable as a method.",
        "source": "T05n0220_041:0234a05_17"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T05n0220_041:0234a05_18"
    },
    {
        "source_sentence": "如是菩薩摩訶薩修行般若波羅蜜多時，是學般若波羅蜜多，則能成辦一切智智。」",
        "translation": "Thus, when bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they're training in the perfection of prajñāpāramitā, and then they can achieve omniscience.",
        "source": "T05n0220_041:0234a06_19"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四十一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 41",
        "source": "T05n0220_041:0234a08_0"
    }
]