[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 7",
        "source": "T05n0220_174:0933c02_0"
    },
    {
        "source_sentence": "十四",
        "translation": "fourteen",
        "source": "T05n0220_174:0933c03_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T05n0220_174:0933c05_0"
    },
    {
        "source_sentence": "初分讚般若品第三十二之三",
        "translation": "The Thirty-second and Third Part of the Chapter on Prajñāpāramitā in the First Part",
        "source": "T05n0220_174:0933c06_0"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0933c07_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於眼界不作大不作小，於色界、眼識界及眼觸、眼觸為緣所生諸受亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make great and they do not make small in the eye realm. They also do not make great and they do not make small in the form realm, or in the eye consciousness realm, or in the sensations that arise from eye contact or eye contact as supporting object.",
        "source": "T05n0220_174:0933c07_1"
    },
    {
        "source_sentence": "於眼界不作集不作散，於色界乃至眼觸為緣所生諸受亦不作集不作散；",
        "translation": "In the element eye, no accumulation is made and no dispersal is made; in the realm of form up to feelings that arise from visual contact as supporting object also no accumulation is made and no dispersal is made.",
        "source": "T05n0220_174:0933c09_2"
    },
    {
        "source_sentence": "於眼界不作有量不作無量，於色界乃至眼觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense eye; they are neither finite nor infinite in the realm of form or in all sensations that arise from visual contact as supporting object.",
        "source": "T05n0220_174:0933c11_3"
    },
    {
        "source_sentence": "於眼界不作廣不作狹，於色界乃至眼觸為緣所生諸受亦不作廣不作狹；",
        "translation": "It is neither wide nor narrow in relation to the element of vision, and neither wide nor narrow in relation to matter or sensations that arise from visual contact as supporting object.",
        "source": "T05n0220_174:0933c13_4"
    },
    {
        "source_sentence": "於眼界不作有力不作無力，於色界乃至眼觸為緣所生諸受亦不作有力不作無力。",
        "translation": "In the eye realm, it's neither powerful nor powerless, and in the form realm or even sensations that arise from eye contact as a condition are neither powerful nor powerless.",
        "source": "T05n0220_174:0933c15_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0933c17_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0933c17_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0933c18_8"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於耳界不作大不作小，於聲界、耳識界及耳觸、耳觸為緣所生諸受亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make great and they do not make small in the ear realm; neither do they make great and they do not make small in the sound realm, nor in the ear consciousness realm, nor in the sensations that arise from ear contact or ear contact as supporting object. They also do not make great and they do not make small",
        "source": "T05n0220_174:0933c18_9"
    },
    {
        "source_sentence": "於耳界不作集不作散，於聲界乃至耳觸為緣所生諸受亦不作集不作散；",
        "translation": "In the ear realm, no accumulation is made and no dispersal is made; in the sound realm - up to feelings that arise from ear contact as supporting object also no accumulation is made and no dispersal is made.",
        "source": "T05n0220_174:0933c21_10"
    },
    {
        "source_sentence": "於耳界不作有量不作無量，於聲界乃至耳觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense organ of hearing; they are neither finite nor infinite in the sense organ of hearing, and neither finite nor infinite in all sensations that arise from ear contact or sound.",
        "source": "T05n0220_174:0933c23_11"
    },
    {
        "source_sentence": "於耳界不作廣不作狹，於聲界乃至耳觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They are neither wide nor narrow in the ear realm; they are neither wide nor narrow in the sound realm, and so on. The feelings that arise from ear contact as supporting object are also neither wide nor narrow.",
        "source": "T05n0220_174:0933c25_12"
    },
    {
        "source_sentence": "於耳界不作有力不作無力，於聲界乃至耳觸為緣所生諸受亦不作有力不作無力。",
        "translation": "In the ear realm, it's neither powerful nor powerless, and in the sound realm or even sensations that arise from ear contact as a condition are neither powerful nor powerless.",
        "source": "T05n0220_174:0933c26_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0933c28_14"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0933c28_15"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934a01_16"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於鼻界不作大不作小，於香界、鼻識界及鼻觸、鼻觸為緣所生諸受亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make great and they do not make small in the nasal realm. They also do not make great and they do not make small in the sense-realm of smell, or in the sense-consciousness realm of smell, or in the sensations that arise from nose contact or odor contact as supporting object.",
        "source": "T05n0220_174:0934a01_17"
    },
    {
        "source_sentence": "於鼻界不作集不作散，於香界乃至鼻觸為緣所生諸受亦不作集不作散；",
        "translation": "neither arising nor perishing in the sense-sphere of the nose; neither arising nor perishing in the sense-sphere; neither arising nor perishing in the sense-sphere of smell or sensations that arise from nasal contact as supporting object.",
        "source": "T05n0220_174:0934a04_0"
    },
    {
        "source_sentence": "於鼻界不作有量不作無量，於香界乃至鼻觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense-sphere of the nose; they are neither finite nor infinite in the sense-sphere of smell, odor, taste, and sensations that arise from nasal contact.",
        "source": "T05n0220_174:0934a05_1"
    },
    {
        "source_sentence": "於鼻界不作廣不作狹，於香界乃至鼻觸為緣所生諸受亦不作廣不作狹；",
        "translation": "The sense element nose is neither wide nor narrow; the sense element odor and all sensations that arise from nasal contact as supporting object are also neither wide nor narrow.",
        "source": "T05n0220_174:0934a07_2"
    },
    {
        "source_sentence": "於鼻界不作有力不作無力，於香界乃至鼻觸為緣所生諸受亦不作有力不作無力。",
        "translation": "It's neither powerful nor powerless in the nose realm, and it's neither powerful nor powerless in the sense realm of fragrance or sensations that arise from nasal contact as a condition.",
        "source": "T05n0220_174:0934a09_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0934a11_4"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0934a11_5"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934a12_6"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於舌界不作大不作小，於味界、舌識界及舌觸、舌觸為緣所生諸受亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make great and they do not make small in the realm of tongue. They also do not make great and they do not make small in the taste realm, the consciousness realm of tongue, or the sensations that arise by means of tongue contact or tongue contact as supporting object.",
        "source": "T05n0220_174:0934a13_0"
    },
    {
        "source_sentence": "於舌界不作集不作散，於味界乃至舌觸為緣所生諸受亦不作集不作散；",
        "translation": "neither arising nor perishing in the sense-speaking realm; neither accumulation nor perishing in the sense-speaking realm, and neither arising nor perishing in the taste realm or even in the sensations that arise from tongue contact as supporting object.",
        "source": "T05n0220_174:0934a15_1"
    },
    {
        "source_sentence": "於舌界不作有量不作無量，於味界乃至舌觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense-speaking realm, and they are neither finite nor infinite in the taste realm or even in the sensations that arise from tongue contact as an object.",
        "source": "T05n0220_174:0934a17_2"
    },
    {
        "source_sentence": "於舌界不作廣不作狹，於味界乃至舌觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They are neither wide nor narrow in the sense-tongue realm; they are neither wide nor narrow in the taste realm or even in the sensations that arise from tongue contact as supporting object.",
        "source": "T05n0220_174:0934a19_3"
    },
    {
        "source_sentence": "於舌界不作有力不作無力，於味界乃至舌觸為緣所生諸受亦不作有力不作無力。",
        "translation": "It's neither powerful nor powerless in the tongue realm, and it's neither powerful nor powerless in the taste realm or sensations that arise from tongue contact as a condition.",
        "source": "T05n0220_174:0934a20_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0934a22_5"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0934a22_6"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934a24_7"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於身界不作大不作小，於觸界、身識界及身觸、身觸為緣所生諸受亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make the body realm great and do not make it small; they also do not make the touch realm, the body-consciousness realm, or the sensations that arise from bodily contact or bodily contact as supporting objects big and do not make them small.",
        "source": "T05n0220_174:0934a24_8"
    },
    {
        "source_sentence": "於身界不作集不作散，於觸界乃至身觸為緣所生諸受亦不作集不作散；",
        "translation": "Neither accumulation nor dispersal is made in relation to the body element; neither accumulation nor dispersal is made in relation to the tangible element, and neither accumulation nor dispersal is made in relation to the sensations that arise from bodily contact as supporting object.",
        "source": "T05n0220_174:0934a27_9"
    },
    {
        "source_sentence": "於身界不作有量不作無量，於觸界乃至身觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in relation to the body realm; they are neither finite nor infinite in relation to the contact realm. The feelings that arise from bodily contact as supporting object also are neither finite nor infinite.",
        "source": "T05n0220_174:0934a28_10"
    },
    {
        "source_sentence": "於身界不作廣不作狹，於觸界乃至身觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They are neither wide nor narrow in relation to the body realm; they are neither wide nor narrow in relation to the tangible realm. The feelings that arise by reason of contact, up to those that arise by reason of bodily contact, are also neither wide nor narrow.",
        "source": "T05n0220_174:0934b01_11"
    },
    {
        "source_sentence": "於身界不作有力不作無力，於觸界乃至身觸為緣所生諸受亦不作有力不作無力。",
        "translation": "It's neither powerful nor powerless in the body realm, and it's neither powerful nor powerless in the touch realm or sensations that arise from bodily contact as a condition.",
        "source": "T05n0220_174:0934b03_12"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0934b05_13"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0934b05_14"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934b07_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於意界不作大不作小，於法界、意識界及意觸、意觸為緣所生諸受亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make the elements of mind big and they do not make the elements of mind small. They also do not make the elements of reality, the elements of thinking consciousness, or the sensations that arise from mental contact or mental contact as supporting objects in the sense realm big and they do not make the elements small.",
        "source": "T05n0220_174:0934b07_1"
    },
    {
        "source_sentence": "於意界不作集不作散，於法界乃至意觸為緣所生諸受亦不作集不作散；",
        "translation": "In the realm of thought, no accumulation is made and no dispersal is made; in the realm of factors or even feelings that arise from mental contact as supporting object are also no accumulation made and no dispersal made.",
        "source": "T05n0220_174:0934b09_2"
    },
    {
        "source_sentence": "於意界不作有量不作無量，於法界乃至意觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the realm of thought, and they are neither finite nor infinite in the realm of reality or in the sensations that arise from mental contact as supporting object.",
        "source": "T05n0220_174:0934b11_3"
    },
    {
        "source_sentence": "於意界不作廣不作狹，於法界乃至意觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They do not make the mind realm wide or narrow, and they do not make the Dharma realm wide or narrow. The feelings that arise from mental contact as supporting object also do not make them wide or narrow.",
        "source": "T05n0220_174:0934b13_4"
    },
    {
        "source_sentence": "於意界不作有力不作無力，於法界乃至意觸為緣所生諸受亦不作有力不作無力。",
        "translation": "It's neither powerful nor powerless in the mind realm, and it's neither powerful nor powerless in the Dharma realm or sensations that arise from mental contact as a condition in the mind realm.",
        "source": "T05n0220_174:0934b15_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0934b17_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0934b17_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934b18_8"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於地界不作大不作小，於水、火、風、空、識界亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom does not make the earth realm large or small, and they do not make water, fire, wind, air, space, or consciousness realms large or small.",
        "source": "T05n0220_174:0934b18_9"
    },
    {
        "source_sentence": "於地界不作集不作散，於水、火、風、空、識界亦不作集不作散；",
        "translation": "They do not make accumulation or disperse in the earth realm; they do not make accumulation or disperse in water, fire, wind, air, space, or consciousness realms.",
        "source": "T05n0220_174:0934b20_10"
    },
    {
        "source_sentence": "於地界不作有量不作無量，於水、火、風、空、識界亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the earth realm; they are neither finite nor infinite in water, fire, wind, air, space, or consciousness realms.",
        "source": "T05n0220_174:0934b22_11"
    },
    {
        "source_sentence": "於地界不作廣不作狹，於水、火、風、空、識界亦不作廣不作狹；",
        "translation": "The earth element is neither wide nor narrow, and the elements water, fire, wind, air, space, and consciousness are also neither wide nor narrow.",
        "source": "T05n0220_174:0934b23_12"
    },
    {
        "source_sentence": "於地界不作有力不作無力，於水、火、風、空、識界亦不作有力不作無力。",
        "translation": "What's not done in the earth realm is powerful and what's not done is powerless, and what's not done in the water, fire, wind, air, space, or consciousness realms is neither powerful nor powerless.",
        "source": "T05n0220_174:0934b25_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0934b26_14"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0934b26_15"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934b29_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於無明不作大不作小，於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make the great and do not make the small regarding ignorance; they do not make the great and do not make the small regarding formations, consciousness, name-and-form, the six sense-fields, contact, feeling, craving, grasping, becoming, birth, old age, sorrow, pain, vexation,",
        "source": "T05n0220_174:0934b29_1"
    },
    {
        "source_sentence": "於無明不作集不作散，於行乃至老死愁歎苦憂惱亦不作集不作散；",
        "translation": "They do not make accumulation or disperse in ignorance; they also do not make accumulation or disperse in sorrow, pain, vexation, and vexation from conditioned states of being up to old age and death.",
        "source": "T05n0220_174:0934c03_0"
    },
    {
        "source_sentence": "於無明不作有量不作無量，於行乃至老死愁歎苦憂惱亦不作有量不作無量；",
        "translation": "They do not think of ignorance as finite or infinite, and they do not think of conditioned phenomena as infinite or infinite. Nor do they think of old age, sorrow, pain, vexation, and suffering as infinite or infinite.",
        "source": "T05n0220_174:0934c04_1"
    },
    {
        "source_sentence": "於無明不作廣不作狹，於行乃至老死愁歎苦憂惱亦不作廣不作狹；",
        "translation": "They do not act broadly or narrowly in regard to ignorance. They also do not act broadly or narrowly in regard to the pain, sorrow, pain, vexation, and vexation of conditioned states up to old age and death.",
        "source": "T05n0220_174:0934c06_2"
    },
    {
        "source_sentence": "於無明不作有力不作無力，於行乃至老死愁歎苦憂惱亦不作有力不作無力。",
        "translation": "They don't do what's powerful and don't do what's powerless in ignorance, and they don't do what's powerful and don't do what's powerless in practice or even the grief, sorrow, pain, and vexation of old age and death.",
        "source": "T05n0220_174:0934c08_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0934c09_1"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0934c09_2"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934c12_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於布施波羅蜜多不作大不作小，於淨戒、安忍、精進、靜慮、般若波羅蜜多亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfections of wisdom do not make great and they do not make small with the perfections of giving. They also do not make great and they do not make small with the perfections of pure morality, patience, effort, meditation, and wisdom.",
        "source": "T05n0220_174:0934c12_1"
    },
    {
        "source_sentence": "於布施波羅蜜多不作集不作散，於淨戒乃至般若波羅蜜多亦不作集不作散；",
        "translation": "They do not make collections or scatter anything regarding the perfection of giving, and they do not make collections or scatter anything regarding pure morality or even the perfection of wisdom.",
        "source": "T05n0220_174:0934c14_2"
    },
    {
        "source_sentence": "於布施波羅蜜多不作有量不作無量，於淨戒乃至般若波羅蜜多亦不作有量不作無量；",
        "translation": "“Great enlightening beings do not think of the perfection of generosity as finite or infinite, and they do not think of it as infinite or infinite. Nor do they think of pure morality or even the perfection of wisdom as infinite or infinite.",
        "source": "T05n0220_174:0934c16_3"
    },
    {
        "source_sentence": "於布施波羅蜜多不作廣不作狹，於淨戒乃至般若波羅蜜多亦不作廣不作狹；",
        "translation": "They do not make the perfection of generosity wide or narrow, and they do not make the perfection of pure morality or even the perfection of wisdom broad or narrow.",
        "source": "T05n0220_174:0934c18_4"
    },
    {
        "source_sentence": "於布施波羅蜜多不作有力不作無力，於淨戒乃至般若波羅蜜多亦不作有力不作無力。",
        "translation": "In the perfection of generosity, it's neither powerful nor powerless, and in the perfection of pure morality or even the perfection of prajñāpāramitā, it's neither powerful nor powerless.",
        "source": "T05n0220_174:0934c20_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0934c22_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0934c22_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0934c25_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於內空不作大不作小，於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空亦不作大不作小；",
        "translation": "The perfection of enlightening beings’ prajñāpāramitā does not make internal emptiness great and does not make it small; external emptiness, internal and external emptiness, emptiness as emptiness, emptiness as great emptiness, ultimate emptiness, emptiness as infinite, emptiness as infinite, emptiness as infinite,",
        "source": "T05n0220_174:0934c25_1"
    },
    {
        "source_sentence": "於內空不作集不作散，於外空乃至無性自性空亦不作集不作散；",
        "translation": "Neither accumulation nor disintegration is made for internal emptiness; neither accumulation nor disintegration is made for external emptiness, up to emptiness of the essential nature of nonexistence.",
        "source": "T05n0220_174:0935a01_2"
    },
    {
        "source_sentence": "於內空不作有量不作無量，於外空乃至無性自性空亦不作有量不作無量；",
        "translation": "They do not think of internal emptiness as finite or infinite, and they do not think of it as finite or infinite; they do not think of it as infinite or infinite.",
        "source": "T05n0220_174:0935a02_3"
    },
    {
        "source_sentence": "於內空不作廣不作狹，於外空乃至無性自性空亦不作廣不作狹；",
        "translation": "They do not make internal emptiness wide and they do not make it narrow. The same does not make external emptiness, up to the emptiness of the essential nature of non-essence, wide or narrow.",
        "source": "T05n0220_174:0935a04_4"
    },
    {
        "source_sentence": "於內空不作有力不作無力，於外空乃至無性自性空亦不作有力不作無力。",
        "translation": "What's not done about internal emptiness is powerful and what's not done is powerless, and what's not done about external emptiness or even emptiness of the natureless self-nature is neither powerful nor powerless.",
        "source": "T05n0220_174:0935a06_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935a07_1"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935a07_2"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935a09_3"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於真如不作大不作小，於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make great and they do not make small in truth. They also do not make great and they do not make small in the realm of reality, or in the realm of reality, or in the nature of things, or in the state of non-falsity, or in the state of unchanging dissimilarity, or in equality",
        "source": "T05n0220_174:0935a09_4"
    },
    {
        "source_sentence": "於真如不作集不作散，於法界乃至不思議界亦不作集不作散；",
        "translation": "They do not make accumulation or disperse in the realm of reality; they also do not make accumulation or disperse in the realm of reality or even in the inconceivable realm.",
        "source": "T05n0220_174:0935a12_5"
    },
    {
        "source_sentence": "於真如不作有量不作無量，於法界乃至不思議界亦不作有量不作無量；",
        "translation": "They do not think of the realm of reality as finite, they do not think of it as infinite; they do not think of the realm of reality as finite, they do not think of it as infinite.",
        "source": "T05n0220_174:0935a14_6"
    },
    {
        "source_sentence": "於真如不作廣不作狹，於法界乃至不思議界亦不作廣不作狹；",
        "translation": "They do not make the realm of reality wide or narrow, and they also do not make the cosmos of reality or even the inconceivable cosmos wide or narrow.",
        "source": "T05n0220_174:0935a16_7"
    },
    {
        "source_sentence": "於真如不作有力不作無力，於法界乃至不思議界亦不作有力不作無力。",
        "translation": "They don't act powerfully and don't act powerlessly in the true nature, and they don't act powerfully or powerlessly in the Dharma realm or even the inconceivable realm.",
        "source": "T05n0220_174:0935a17_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935a19_9"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935a19_10"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935a21_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於苦聖諦不作大不作小，於集、滅、道聖諦亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom does not make great and not make small regarding the noble truth of suffering; they also do not make great and not make small regarding the noble truths of accumulation, cessation, and the path.",
        "source": "T05n0220_174:0935a21_1"
    },
    {
        "source_sentence": "於苦聖諦不作集不作散，於集、滅、道聖諦亦不作集不作散；",
        "translation": "In relation to the noble truth of suffering, neither accumulation nor scatter is done; in relation to the noble truths of accumulation, cessation and the path, neither accumulation is done nor scatter is done.",
        "source": "T05n0220_174:0935a23_2"
    },
    {
        "source_sentence": "於苦聖諦不作有量不作無量，於集、滅、道聖諦亦不作有量不作無量；",
        "translation": "The noble truth of suffering is not made to be finite or infinite; the noble truths of origin, cessation and the path are also not made to be finite or infinite.",
        "source": "T05n0220_174:0935a24_3"
    },
    {
        "source_sentence": "於苦聖諦不作廣不作狹，於集、滅、道聖諦亦不作廣不作狹；",
        "translation": "The noble truth of suffering is not made broad and not made narrow; neither is the noble truths of origin, of cessation and of the path made broad and not made narrow.",
        "source": "T05n0220_174:0935a26_4"
    },
    {
        "source_sentence": "於苦聖諦不作有力不作無力，於集、滅、道聖諦亦不作有力不作無力。",
        "translation": "In the noble truth of suffering, it's neither powerful nor powerless, and in the noble truths of arising, ceasing, and the path, it's neither powerful nor powerless.",
        "source": "T05n0220_174:0935a27_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935a29_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935a29_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935b02_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於四靜慮不作大不作小，於四無量、四無色定亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make the great and do not make the small in the four meditations; they also do not make the great and do not make the small in the four immeasurable concentrations or in the four formless concentrations.",
        "source": "T05n0220_174:0935b02_1"
    },
    {
        "source_sentence": "於四靜慮不作集不作散，於四無量、四無色定亦不作集不作散；",
        "translation": "The four forms of meditative absorption are neither accumulated nor dispersed. Nor are the four immeasurable and four formless concentrations accumulated nor dispersed.",
        "source": "T05n0220_174:0935b04_2"
    },
    {
        "source_sentence": "於四靜慮不作有量不作無量，於四無量、四無色定亦不作有量不作無量；",
        "translation": "They do not make the four forms of trance immeasurable or immeasurable, and they do not make the four immeasurable concentrations or the four formless concentrations immeasurable or immeasurable.",
        "source": "T05n0220_174:0935b05_3"
    },
    {
        "source_sentence": "於四靜慮不作廣不作狹，於四無量、四無色定亦不作廣不作狹；",
        "translation": "The four forms of meditative absorption are neither wide nor narrow. Nor are the four immeasurable concentrations nor the four formless concentrations made wide or narrow.",
        "source": "T05n0220_174:0935b07_4"
    },
    {
        "source_sentence": "於四靜慮不作有力不作無力，於四無量、四無色定亦不作有力不作無力。",
        "translation": "What's not done in the four meditations is powerful and what's not done is powerless, and what's not done in the four immeasurable and four formless concentrations is neither powerful nor powerless.",
        "source": "T05n0220_174:0935b09_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935b10_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935b10_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935b13_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於八解脫不作大不作小，於八勝處、九次第定、十遍處亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make the eight liberations large or small, and also do not make the eight spheres of mastery, nine graduated concentrations, or ten universal abodes large or small.",
        "source": "T05n0220_174:0935b13_1"
    },
    {
        "source_sentence": "於八解脫不作集不作散，於八勝處、九次第定、十遍處亦不作集不作散；",
        "translation": "The eight liberations are neither accumulated nor dispersed; the eight spheres of mastery, the nine graduated concentrations and the ten universals are also neither accumulated nor dispersed.",
        "source": "T05n0220_174:0935b15_2"
    },
    {
        "source_sentence": "於八解脫不作有量不作無量，於八勝處、九次第定、十遍處亦不作有量不作無量；",
        "translation": "They do not make the eight liberations finite or infinite; they do not make the eight spheres of mastery, the nine graduated concentrations and the ten universals finite or infinite.",
        "source": "T05n0220_174:0935b17_3"
    },
    {
        "source_sentence": "於八解脫不作廣不作狹，於八勝處、九次第定、十遍處亦不作廣不作狹；",
        "translation": "They do not make the eight liberations wide or narrow; they do not make the eight spheres of mastery, the nine graduated concentrations and the ten universals wide or narrow.",
        "source": "T05n0220_174:0935b19_4"
    },
    {
        "source_sentence": "於八解脫不作有力不作無力，於八勝處、九次第定、十遍處亦不作有力不作無力。",
        "translation": "In the eight liberations, it's neither powerful nor powerless, and in the eight abodes of excellence, nine graduated concentrations, and ten universal abodes, it's neither powerful nor powerless.",
        "source": "T05n0220_174:0935b20_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935b22_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935b22_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935b24_8"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於四念住不作大不作小，於四正斷、四神足、五根、五力、七等覺支、八聖道支亦不作大不作小；",
        "translation": "“Great enlightening beings in the perfection of wisdom don’t make great and don’t make small at the four abodes of mindfulness; they also don’t make great and don’t make small at the fourfold correct elimination, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, or the eight noble factors of",
        "source": "T05n0220_174:0935b24_9"
    },
    {
        "source_sentence": "於四念住不作集不作散，於四正斷乃至八聖道支亦不作集不作散；",
        "translation": "In the four abodes of mindfulness, neither accumulation nor dispersal is made; neither accumulation nor dispersal is made regarding the four forms of right abandoning or up to the eightfold noble path.",
        "source": "T05n0220_174:0935b27_10"
    },
    {
        "source_sentence": "於四念住不作有量不作無量，於四正斷乃至八聖道支亦不作有量不作無量；",
        "translation": "The four abodes of mindfulness are neither quantifiable nor infinite; the four forms of right abandonment up to the eightfold noble path are also neither finite nor infinite.",
        "source": "T05n0220_174:0935b28_11"
    },
    {
        "source_sentence": "於四念住不作廣不作狹，於四正斷乃至八聖道支亦不作廣不作狹；",
        "translation": "They do not make the four abodes of mindfulness wide or narrow, and they do not make the four forms of right abandonment or even the eightfold noble path broad or narrow.",
        "source": "T05n0220_174:0935c01_12"
    },
    {
        "source_sentence": "於四念住不作有力不作無力，於四正斷乃至八聖道支亦不作有力不作無力。",
        "translation": "In the four abodes of mindfulness, it's neither powerful nor powerless, and in the fourfold correct elimination or even the eight noble factors of the path, it's neither powerful nor powerless.",
        "source": "T05n0220_174:0935c03_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935c04_14"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935c05_15"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935c06_16"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於空解脫門不作大不作小，於無相、無願解脫門亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make anything big or small at the door of liberation through emptiness, and also do not make anything big or small at the door of liberation through signlessness or wishlessness.",
        "source": "T05n0220_174:0935c06_17"
    },
    {
        "source_sentence": "於空解脫門不作集不作散，於無相、無願解脫門亦不作集不作散；",
        "translation": "In the liberation gate of emptiness no accumulation or dispersal is made, and in the liberation gate of signlessness and wishlessness no accumulation or dispersal is made.",
        "source": "T05n0220_174:0935c08_18"
    },
    {
        "source_sentence": "於空解脫門不作有量不作無量，於無相、無願解脫門亦不作有量不作無量；",
        "translation": "In the liberation gate of emptiness they do not make anything finite or infinite; in the liberation gate of signlessness and wishlessness they also do not make anything finite or infinite.",
        "source": "T05n0220_174:0935c10_19"
    },
    {
        "source_sentence": "於空解脫門不作廣不作狹，於無相、無願解脫門亦不作廣不作狹；",
        "translation": "The door of liberation through emptiness is neither wide nor narrow, and the door of liberation through signlessness and wishlessness is neither wide nor narrow.",
        "source": "T05n0220_174:0935c12_20"
    },
    {
        "source_sentence": "於空解脫門不作有力不作無力，於無相、無願解脫門亦不作有力不作無力。",
        "translation": "In the liberation gate of emptiness, it's neither powerful nor powerless, and in the liberation gate of signlessness and wishlessness, it's neither powerful nor powerless.",
        "source": "T05n0220_174:0935c13_21"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935c15_22"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935c15_23"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935c17_24"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於五眼不作大不作小，於六神通亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom does not make the five eyes large or small, and they do not make the six supernormal powers big or small.",
        "source": "T05n0220_174:0935c17_25"
    },
    {
        "source_sentence": "於五眼不作集不作散，於六神通亦不作集不作散；",
        "translation": "They do not make accumulation or scatter with respect to the five eyes; they also do not make accumulation or scatter with respect to the six supernormal powers.",
        "source": "T05n0220_174:0935c19_26"
    },
    {
        "source_sentence": "於五眼不作有量不作無量，於六神通亦不作有量不作無量；",
        "translation": "They do not think of the five eyes as finite or infinite, and they do not think of the six supernormal powers as finite or infinite.",
        "source": "T05n0220_174:0935c20_27"
    },
    {
        "source_sentence": "於五眼不作廣不作狹，於六神通亦不作廣不作狹；",
        "translation": "They do not make wide or narrow the five eyes, and they also do not make wide or narrow the six supernormal powers.",
        "source": "T05n0220_174:0935c21_28"
    },
    {
        "source_sentence": "於五眼不作有力不作無力，於六神通亦不作有力不作無力。",
        "translation": "What's not done with the five eyes is powerful and what's not done is powerless, and what's not done with the six supernormal powers is neither powerful nor powerless.",
        "source": "T05n0220_174:0935c22_29"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0935c24_30"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0935c24_31"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0935c26_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於佛十力不作大不作小，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法亦不作大不作小；",
        "translation": "“The perfection of great enlightening beings’ prajñāpāramitā does not make anything big or small about the ten powers of buddhas; it does not make anything big or small about the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great equanimity, and the eighteen unique qualities of",
        "source": "T05n0220_174:0935c26_1"
    },
    {
        "source_sentence": "於佛十力不作集不作散，於四無所畏乃至十八佛不共法亦不作集不作散；",
        "translation": "They do not accumulate or disperse the ten powers of buddhas; they also do not accumulate or disperse the four fearlessnesses, up to the unique qualities of the eighteen buddhas.",
        "source": "T05n0220_174:0935c29_2"
    },
    {
        "source_sentence": "於佛十力不作有量不作無量，於四無所畏乃至十八佛不共法亦不作有量不作無量；",
        "translation": "They do not think of the ten powers of buddhas as finite or infinite; they do not think of the four forms of fearlessness, up to the unique qualities of the eighteen buddhas as finite or infinite.",
        "source": "T05n0220_174:0936a02_0"
    },
    {
        "source_sentence": "於佛十力不作廣不作狹，於四無所畏乃至十八佛不共法亦不作廣不作狹；",
        "translation": "They do not make the ten powers of buddhas wide or narrow; they do not make the four forms of fearlessness or even the eighteen unique qualities of buddhas wide or narrow.",
        "source": "T05n0220_174:0936a04_0"
    },
    {
        "source_sentence": "於佛十力不作有力不作無力，於四無所畏乃至十八佛不共法亦不作有力不作無力。",
        "translation": "In the Buddha's ten powers, they don't act powerfully and don't act without power, and in the four fearlessnesses or even the 18 uncommon dharmas of the Buddha, they don't act powerfully and don't act without power.",
        "source": "T05n0220_174:0936a05_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936a07_2"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936a07_3"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936a09_4"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於無忘失法不作大不作小，於恒住捨性亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make the great and do not make the small regarding the principle of nonforgetfulness. They also do not make the great and do not make the small regarding the eternally abiding equanimity.",
        "source": "T05n0220_174:0936a09_5"
    },
    {
        "source_sentence": "於無忘失法不作集不作散，於恒住捨性亦不作集不作散；",
        "translation": "In the state of nonforgetfulness, neither accumulation nor dispersal is done. Also in the state of eternally abiding equanimity, neither accumulation nor dispersal is done.",
        "source": "T05n0220_174:0936a11_6"
    },
    {
        "source_sentence": "於無忘失法不作有量不作無量，於恒住捨性亦不作有量不作無量；",
        "translation": "In the state of nonforgetfulness, they do not make anything finite and do not make anything infinite. They also do not make anything finite and do not make anything infinite in the nature of constant abiding equanimity.",
        "source": "T05n0220_174:0936a12_7"
    },
    {
        "source_sentence": "於無忘失法不作廣不作狹，於恒住捨性亦不作廣不作狹；",
        "translation": "They do not act broadly or narrowly regarding the principle of nonforgetfulness. They also do not act broadly or narrowly regarding the nature of eternally abiding equanimity.",
        "source": "T05n0220_174:0936a14_8"
    },
    {
        "source_sentence": "於無忘失法不作有力不作無力，於恒住捨性亦不作有力不作無力。",
        "translation": "In the absence of forgetfulness, they don't act powerfully and don't act without power, and in the constant abiding equanimity, they don't act powerfully and don't act without power.",
        "source": "T05n0220_174:0936a15_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936a17_10"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936a17_11"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936a18_12"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於一切智不作大不作小，於道相智、一切相智亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make anything big or small with omniscience, and also do not make anything big or small with knowledge of the path or with knowledge of all characteristics.",
        "source": "T05n0220_174:0936a19_13"
    },
    {
        "source_sentence": "於一切智不作集不作散，於道相智、一切相智亦不作集不作散；",
        "translation": "They do not make accumulation or disperse in omniscience; they also do not make accumulation or disperse in knowledge of the path or in knowledge of all characteristics.",
        "source": "T05n0220_174:0936a21_14"
    },
    {
        "source_sentence": "於一切智不作有量不作無量，於道相智、一切相智亦不作有量不作無量；",
        "translation": "They do not think of omniscience as finite or infinite, and they do not think of path-knowledge or omniscience as finite or infinite.",
        "source": "T05n0220_174:0936a22_15"
    },
    {
        "source_sentence": "於一切智不作廣不作狹，於道相智、一切相智亦不作廣不作狹；",
        "translation": "In omniscience they do not make it broad and do not make it narrow, and in knowledge of the path and knowledge of all characteristics they also do not make it broad and do not make it narrow.",
        "source": "T05n0220_174:0936a24_16"
    },
    {
        "source_sentence": "於一切智不作有力不作無力，於道相智、一切相智亦不作有力不作無力。",
        "translation": "What's not done with omniscience is powerful and what's not done is powerless, and what's not done with knowledge of the path and knowledge of all characteristics is also powerful and what's not done is powerless.",
        "source": "T05n0220_174:0936a25_17"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936a27_18"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936a27_19"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936a29_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於一切陀羅尼門不作大不作小，於一切三摩地門亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom is that they do not make anything big or small in all the teachings of dhāraṇī and also do not make anything big or small in all the teachings of concentration.",
        "source": "T05n0220_174:0936a29_1"
    },
    {
        "source_sentence": "於一切陀羅尼門不作集不作散，於一切三摩地門亦不作集不作散；",
        "translation": "They do not accumulate or disperse in all approaches to concentration formulae; they do not accumulate or disperse in all approaches to concentration formulae.",
        "source": "T05n0220_174:0936b02_2"
    },
    {
        "source_sentence": "於一切陀羅尼門不作有量不作無量，於一切三摩地門亦不作有量不作無量；",
        "translation": "“Great enlightening beings do not think of all aspects of concentration as finite or infinite, and they do not think of all aspects of concentration as infinite or infinite.",
        "source": "T05n0220_174:0936b04_3"
    },
    {
        "source_sentence": "於一切陀羅尼門不作廣不作狹，於一切三摩地門亦不作廣不作狹；",
        "translation": "He does not make the approaches to all dhāraṇī teachings wide or narrow, and he does not make the approaches to all concentrations broad or narrow.",
        "source": "T05n0220_174:0936b05_4"
    },
    {
        "source_sentence": "於一切陀羅尼門不作有力不作無力，於一切三摩地門亦不作有力不作無力。",
        "translation": "In all the dhāraṇī approaches, it's neither powerful nor powerless, and in all the samādhi approaches, it's neither powerful nor powerless.",
        "source": "T05n0220_174:0936b07_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936b09_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936b09_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936b10_8"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於預流不作大不作小，於一來、不還、阿羅漢亦不作大不作小；",
        "translation": "“The perfection of wisdom of great enlightening beings is that they do not make large or small with the stream-enterers, and they do not make large or small with the firstcomers, the nonreturners, or the arhats.",
        "source": "T05n0220_174:0936b11_0"
    },
    {
        "source_sentence": "於預流不作集不作散，於一來、不還、阿羅漢亦不作集不作散；",
        "translation": "neither accumulation nor scatter with respect to the one who proceeds in advance, and neither accumulation nor scatter with respect to the one who comes before. Neither accumulation nor scatter with respect to the first-comer, the one who does not return, nor the arhat.",
        "source": "T05n0220_174:0936b13_1"
    },
    {
        "source_sentence": "於預流不作有量不作無量，於一來、不還、阿羅漢亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite with respect to the stream-enterer, and they are neither finite nor infinite with respect to the one who comes before them. Nor are they finite or infinite with respect to the once-returner, the nonreturner, or the arhat.",
        "source": "T05n0220_174:0936b14_2"
    },
    {
        "source_sentence": "於預流不作廣不作狹，於一來、不還、阿羅漢亦不作廣不作狹；",
        "translation": "They do not make the stream-enterer wide or narrow, and they do not make the once-returner, the nonreturner, or the arhat wide or narrow.",
        "source": "T05n0220_174:0936b16_3"
    },
    {
        "source_sentence": "於預流不作有力不作無力，於一來、不還、阿羅漢亦不作有力不作無力。",
        "translation": "It's not powerful or powerless when it comes to pre-flow, and it's not powerful or powerless when it comes to the once-returner, nonreturner, or arhat.",
        "source": "T05n0220_174:0936b17_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936b19_5"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936b19_6"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936b20_7"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於預流向預流果不作大不作小，於一來向一來果、不還向不還果、阿羅漢向阿羅漢果亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom does not make great and not make small the fruit of pre-flow or the fruit of pre-flow; they also do not make great and not make small the fruit of one coming, the fruit of the one coming, the fruit of the one coming, the fruit of the nonreturner and the fruit of the nonreturner, or the fruit of the arhat",
        "source": "T05n0220_174:0936b20_8"
    },
    {
        "source_sentence": "於預流向預流果不作集不作散，於一來向乃至阿羅漢果亦不作集不作散；",
        "translation": "They do not accumulate or disperse in the state of stream-entry and proceed toward the state of stream-entry. They also do not accumulate or disperse in the state of arhatship up to the state of once-returning.",
        "source": "T05n0220_174:0936b23_9"
    },
    {
        "source_sentence": "於預流向預流果不作有量不作無量，於一來向乃至阿羅漢果亦不作有量不作無量；",
        "translation": "The fruit of stream-entry and the fruit of stream-entry are not made to be finite or infinite, and neither finite nor infinite when proceeding toward one destination.",
        "source": "T05n0220_174:0936b25_10"
    },
    {
        "source_sentence": "於預流向預流果不作廣不作狹，於一來向乃至阿羅漢果亦不作廣不作狹；",
        "translation": "The fruit of stream-entry is neither wide nor narrow when proceeding toward stream-entry, and the fruit of arhatship is neither wide nor narrow when proceeding in one direction.",
        "source": "T05n0220_174:0936b27_11"
    },
    {
        "source_sentence": "於預流向預流果不作有力不作無力，於一來向乃至阿羅漢果亦不作有力不作無力。",
        "translation": "It's neither powerful nor powerless when it's directed toward the fruit of pre-flow or the fruit of pre-flow, and it's neither powerful nor powerless when it's directed toward a once-returning path up to the fruit of arhatship.",
        "source": "T05n0220_174:0936b29_12"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936c02_13"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936c02_14"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936c04_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於獨覺不作大不作小，於獨覺菩提亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom is not doing great and not doing little regarding the self-enlightened, and also not doing great and not doing little regarding the enlightenment of the self-enlightened.",
        "source": "T05n0220_174:0936c04_1"
    },
    {
        "source_sentence": "於獨覺不作集不作散，於獨覺菩提亦不作集不作散；",
        "translation": "Neither accumulation nor dispersal is done regarding the self-enlightened, and neither accumulation nor dispersal is done regarding the enlightenment of the self-enlightened.",
        "source": "T05n0220_174:0936c06_2"
    },
    {
        "source_sentence": "於獨覺不作有量不作無量，於獨覺菩提亦不作有量不作無量；",
        "translation": "They do not think of self-enlightened ones as finite or infinite, and they do not think of enlightenment of self-enlightened ones as finite or infinite.",
        "source": "T05n0220_174:0936c07_3"
    },
    {
        "source_sentence": "於獨覺不作廣不作狹，於獨覺菩提亦不作廣不作狹；",
        "translation": "The enlightenment of the self-enlightened one is neither wide nor narrow, and the enlightenment of the self-enlightened one is neither wide nor narrow.",
        "source": "T05n0220_174:0936c08_4"
    },
    {
        "source_sentence": "於獨覺不作有力不作無力，於獨覺菩提亦不作有力不作無力。",
        "translation": "In the solitary realizer, it's neither powerful nor powerless, and in the solitary realizer's enlightenment, it's neither powerful nor powerless.",
        "source": "T05n0220_174:0936c10_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936c11_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936c11_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936c13_0"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於菩薩摩訶薩不作大不作小，於菩薩摩訶薩行亦不作大不作小；",
        "translation": "The prajñāpāramitā of great enlightening beings is that they do not make anything big or small in the practice of great enlightening beings, and they do not make anything big or small in the practice of great enlightening beings.",
        "source": "T05n0220_174:0936c13_1"
    },
    {
        "source_sentence": "於菩薩摩訶薩不作集不作散，於菩薩摩訶薩行亦不作集不作散；",
        "translation": "“Great enlightening beings do not accumulate or disperse in the practice of enlightening beings, and they do not accumulate or disperse in the practice of enlightening beings.",
        "source": "T05n0220_174:0936c15_2"
    },
    {
        "source_sentence": "於菩薩摩訶薩不作有量不作無量，於菩薩摩訶薩行亦不作有量不作無量；",
        "translation": "“The practice of great enlightening beings is neither finite nor infinite, and the practice of great enlightening beings is neither finite nor infinite.",
        "source": "T05n0220_174:0936c16_3"
    },
    {
        "source_sentence": "於菩薩摩訶薩不作廣不作狹，於菩薩摩訶薩行亦不作廣不作狹；",
        "translation": "“Great enlightening beings do not act broadly or narrowly in relation to great enlightening beings, and they also do not act broadly or narrowly in relation to the practice of great enlightening beings.",
        "source": "T05n0220_174:0936c18_4"
    },
    {
        "source_sentence": "於菩薩摩訶薩不作有力不作無力，於菩薩摩訶薩行亦不作有力不作無力。",
        "translation": "In the bodhisattva-mahāsattva, he doesn't act powerfully and doesn't act without power, and in the bodhisattva-mahāsattva practice, he doesn't act powerfully and doesn't act without power.",
        "source": "T05n0220_174:0936c20_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0936c22_0"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0936c22_1"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0936c23_2"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於諸如來、應、正等覺不作大不作小，於佛無上正等菩提亦不作大不作小；",
        "translation": "“Great enlightening beings’ perfection of wisdom do not make great or small deeds for buddhas, and they do not make great or small deeds for buddhas. They also do not make great or small deeds for the supreme awakening of buddhas.",
        "source": "T05n0220_174:0936c23_3"
    },
    {
        "source_sentence": "於諸如來、應、正等覺不作集不作散，於佛無上正等菩提亦不作集不作散；",
        "translation": "“Great enlightening beings do not accumulate or disperse the teachings of buddhas, they do not gather or disperse them. They also do not accumulate or disperse the supreme awakening of buddhas.",
        "source": "T05n0220_174:0936c26_4"
    },
    {
        "source_sentence": "於諸如來、應、正等覺不作有量不作無量，於佛無上正等菩提亦不作有量不作無量；",
        "translation": "“Great enlightening beings do not think of buddhas as finite, they do not think of buddhas as infinite; they do not think of buddhas as infinite, they do not think of buddhas as infinite, and they do not think of buddhas as infinite.",
        "source": "T05n0220_174:0936c27_5"
    },
    {
        "source_sentence": "於諸如來、應、正等覺不作廣不作狹，於佛無上正等菩提亦不作廣不作狹；",
        "translation": "“Great enlightening beings do not act broadly or narrowly in regard to buddhas, and they also do not act broadly or narrowly in regard to the supreme awakening of buddhas.",
        "source": "T05n0220_174:0936c29_6"
    },
    {
        "source_sentence": "於諸如來、應、正等覺不作有力不作無力，於佛無上正等菩提亦不作有力不作無力。",
        "translation": "In the Tathāgatas, Arhats, and Perfectly Enlightened Ones, it's not powerful or powerless, and in the Buddha's unsurpassed perfect enlightenment, it's not powerful or powerless.",
        "source": "T05n0220_174:0937a02_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937a04_8"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0937a04_9"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937a05_10"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜多，於一切法不作大不作小、不作集不作散、不作有量不作無量、不作廣不作狹、不作有力不作無力。",
        "translation": "The bodhisattva Mahāsattva prajñāpāramitā doesn't create greatness or smallness in all dharmas, doesn't create accumulation or dispersal, doesn't create measurement or immeasurability, doesn't create breadth or narrowness, and doesn't create strength or weakness.",
        "source": "T05n0220_174:0937a06_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937a08_12"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_174:0937a09_13"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937a10_14"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若波羅蜜多、靜慮波羅蜜多、精進波羅蜜多、安忍波羅蜜多、淨戒波羅蜜多、布施波羅蜜多，",
        "translation": "If newly trained great vehicle bodhisattvas and mahāsattvas rely on the perfection of wisdom, the perfection of meditation, the perfection of effort, the perfection of patience, the perfection of pure morality, and the perfection of generosity,",
        "source": "T05n0220_174:0937a10_15"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於色不作大不作小，於受、想、行、識亦不作大不作小；",
        "translation": "They give rise to such thoughts: Thus, the perfection of wisdom does not make material form large or small, and neither does it make sensation, perception, volition, or consciousness big or small.",
        "source": "T05n0220_174:0937a13_16"
    },
    {
        "source_sentence": "於色不作集不作散，於受、想、行、識亦不作集不作散；",
        "translation": "They do not make form a collection or disperse it; they do not make sensation, perception, volition, or consciousness a collection or disperse it.",
        "source": "T05n0220_174:0937a15_17"
    },
    {
        "source_sentence": "於色不作有量不作無量，於受、想、行、識亦不作有量不作無量；",
        "translation": "They do not think of form as finite or infinite, and they do not think of feeling, perception, volition, or consciousness as finite or infinite.",
        "source": "T05n0220_174:0937a16_18"
    },
    {
        "source_sentence": "於色不作廣不作狹，於受、想、行、識亦不作廣不作狹；",
        "translation": "They don’t make form wide and don’t make it narrow, and they don’t make feeling, perception, volition, or consciousness wide and don’t make it narrow.",
        "source": "T05n0220_174:0937a17_19"
    },
    {
        "source_sentence": "於色不作有力不作無力，於受、想、行、識亦不作有力不作無力。』",
        "translation": "What's not done with form is powerful and what's not done is powerless, and what's not done with sensation, perception, volition, or consciousness is also powerful and what's not done is powerless.'",
        "source": "T05n0220_174:0937a19_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937a20_21"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0937a20_22"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937a22_0"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0937a22_1"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於眼處不作大不作小，於耳、鼻、舌、身、意處亦不作大不作小；",
        "translation": "They give rise to this idea: Thus, the perfection of wisdom does not make anything big or small in the sense-field of the eye; it does not make anything big or small in the sense-field of the ear, nose, tongue, body, or mind.",
        "source": "T05n0220_174:0937a23_2"
    },
    {
        "source_sentence": "於眼處不作集不作散，於耳、鼻、舌、身、意處亦不作集不作散；",
        "translation": "They do not make accumulation or disperse in the sense-field of the eye; they do not make accumulation or disperse in the sense-fields of the ear, nose, tongue, body, and mind.",
        "source": "T05n0220_174:0937a25_3"
    },
    {
        "source_sentence": "於眼處不作有量不作無量，於耳、鼻、舌、身、意處亦不作有量不作無量；",
        "translation": "They do not think of the sense-field as finite or infinite, and they do not think of the sense-field as infinite or infinite. Nor do they think of the sense-fields of the ear, nose, tongue, body, and mind as finite or infinite.",
        "source": "T05n0220_174:0937a27_4"
    },
    {
        "source_sentence": "於眼處不作廣不作狹，於耳、鼻、舌、身、意處亦不作廣不作狹；",
        "translation": "The sphere of the eye is neither wide nor narrow, and the spheres of the ear, nose, tongue, body, and mind are also neither wide nor narrow.",
        "source": "T05n0220_174:0937a28_5"
    },
    {
        "source_sentence": "於眼處不作有力不作無力，於耳、鼻、舌、身、意處亦不作有力不作無力。』",
        "translation": "What's not done in the eye place is powerful and what's not done is powerless, and what's not done in the ear, nose, tongue, body, or mind place is also powerful and what's not done is powerless.'",
        "source": "T05n0220_174:0937b01_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937b02_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0937b02_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937b04_0"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0937b04_1"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於色處不作大不作小，於聲、香、味、觸、法處亦不作大不作小；",
        "translation": "They give rise to this thought: Thus, the perfection of wisdom does not create large or small objects in matter; it does not create large or small objects in sound, odor, taste, touch, or dharma.",
        "source": "T05n0220_174:0937b05_2"
    },
    {
        "source_sentence": "於色處不作集不作散，於聲、香、味、觸、法處亦不作集不作散；",
        "translation": "They are neither collected nor scattered in the realm of form; they are neither collected nor scattered in the realm of sound, smell, taste, touch, or dharma; they are neither collected nor scattered.",
        "source": "T05n0220_174:0937b07_3"
    },
    {
        "source_sentence": "於色處不作有量不作無量，於聲、香、味、觸、法處亦不作有量不作無量；",
        "translation": "They do not think of form as finite or infinite, and they do not think of sound, odor, taste, touch, or dharmas as finite or infinite.",
        "source": "T05n0220_174:0937b09_4"
    },
    {
        "source_sentence": "於色處不作廣不作狹，於聲、香、味、觸、法處亦不作廣不作狹；",
        "translation": "They do not make the sphere of form wide or narrow, and also do not make the spheres of sound, odor, taste, touch, and dharmalessness wide or narrow.",
        "source": "T05n0220_174:0937b10_5"
    },
    {
        "source_sentence": "於色處不作有力不作無力，於聲、香、味、觸、法處亦不作有力不作無力。』",
        "translation": "What's not done in the form realm is powerful and what's not done is powerless, and what's not done in the sound, smell, taste, touch, or dharma realms is neither powerful nor powerless.'",
        "source": "T05n0220_174:0937b12_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937b13_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0937b13_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937b14_9"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0937b15_10"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於眼界不作大不作小，於色界、眼識界及眼觸、眼觸為緣所生諸受亦不作大不作小；",
        "translation": "They give rise to this ideation: Thus, the perfection of wisdom does not make anything big or small regarding the eye realm; it does not make anything big or small regarding the form realm, the eye consciousness realm, or the sensations that arise from eye contact or eye contact as supporting object.",
        "source": "T05n0220_174:0937b16_11"
    },
    {
        "source_sentence": "於眼界不作集不作散，於色界乃至眼觸為緣所生諸受亦不作集不作散；",
        "translation": "In the element eye, no accumulation is made and no dispersal is made; in the realm of form up to feelings that arise from visual contact as supporting object also no accumulation is made and no dispersal is made.",
        "source": "T05n0220_174:0937b19_12"
    },
    {
        "source_sentence": "於眼界不作有量不作無量，於色界乃至眼觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense eye; they are neither finite nor infinite in the realm of form or in all sensations that arise from visual contact as supporting object.",
        "source": "T05n0220_174:0937b21_13"
    },
    {
        "source_sentence": "於眼界不作廣不作狹，於色界乃至眼觸為緣所生諸受亦不作廣不作狹；",
        "translation": "It is neither wide nor narrow in relation to the element of vision, and neither wide nor narrow in relation to matter or sensations that arise from visual contact as supporting object.",
        "source": "T05n0220_174:0937b23_14"
    },
    {
        "source_sentence": "於眼界不作有力不作無力，於色界乃至眼觸為緣所生諸受亦不作有力不作無力。』",
        "translation": "In the eye realm, it's neither powerful nor powerless, and in the form realm or even the sensations that arise from eye contact as a condition are neither powerful nor powerless.'",
        "source": "T05n0220_174:0937b24_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937b26_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0937b26_17"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937b27_18"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0937b28_19"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於耳界不作大不作小，於聲界、耳識界及耳觸、耳觸為緣所生諸受亦不作大不作小；",
        "translation": "They give rise to this ideation: Thus, the perfection of wisdom does not make anything big or small in the ear realm; it does not make anything big or small in the sound realm, in the ear consciousness realm, or in the sensations that arise from ear contact or ear contact as supporting object.",
        "source": "T05n0220_174:0937b29_20"
    },
    {
        "source_sentence": "於耳界不作集不作散，於聲界乃至耳觸為緣所生諸受亦不作集不作散；",
        "translation": "In the ear realm, no accumulation is made and no dispersal is made; in the sound realm - up to feelings that arise from ear contact as supporting object also no accumulation is made and no dispersal is made.",
        "source": "T05n0220_174:0937c03_21"
    },
    {
        "source_sentence": "於耳界不作有量不作無量，於聲界乃至耳觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense organ of hearing; they are neither finite nor infinite in the sense organ of hearing, and neither finite nor infinite in all sensations that arise from ear contact or sound.",
        "source": "T05n0220_174:0937c05_22"
    },
    {
        "source_sentence": "於耳界不作廣不作狹，於聲界乃至耳觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They are neither wide nor narrow in the ear realm; they are neither wide nor narrow in the sound realm, and so on. The feelings that arise from ear contact as supporting object are also neither wide nor narrow.",
        "source": "T05n0220_174:0937c07_0"
    },
    {
        "source_sentence": "於耳界不作有力不作無力，於聲界乃至耳觸為緣所生諸受亦不作有力不作無力。』",
        "translation": "What's done in the ear realm is neither powerful nor powerless, and what's done in the sound realm or even sensations that arise from ear contact as a condition are also neither powerful nor powerless.'",
        "source": "T05n0220_174:0937c08_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937c10_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0937c10_3"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937c11_4"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0937c12_5"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於鼻界不作大不作小，於香界、鼻識界及鼻觸、鼻觸為緣所生諸受亦不作大不作小；",
        "translation": "They give rise to this thought: Thus, the perfection of wisdom does not make the elements of smell and taste greater or lesser in relation to the nasal sense element; it does not make the elements of smell, odor, taste consciousness, nose contact, or other sensations that arise by reason of these feelings greater or lesser.",
        "source": "T05n0220_174:0937c13_6"
    },
    {
        "source_sentence": "於鼻界不作集不作散，於香界乃至鼻觸為緣所生諸受亦不作集不作散；",
        "translation": "neither arising nor perishing in the sense-sphere of the nose; neither arising nor perishing in the sense-sphere; neither arising nor perishing in the sense-sphere of smell or sensations that arise from nasal contact as supporting object.",
        "source": "T05n0220_174:0937c16_7"
    },
    {
        "source_sentence": "於鼻界不作有量不作無量，於香界乃至鼻觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense-sphere of the nose; they are neither finite nor infinite in the sense-sphere of smell, odor, taste, and sensations that arise from nasal contact.",
        "source": "T05n0220_174:0937c18_0"
    },
    {
        "source_sentence": "於鼻界不作廣不作狹，於香界乃至鼻觸為緣所生諸受亦不作廣不作狹；",
        "translation": "The sense element nose is neither wide nor narrow; the sense element odor and all sensations that arise from nasal contact as supporting object are also neither wide nor narrow.",
        "source": "T05n0220_174:0937c19_1"
    },
    {
        "source_sentence": "於鼻界不作有力不作無力，於香界乃至鼻觸為緣所生諸受亦不作有力不作無力。』",
        "translation": "In the nasal realm, it's neither powerful nor powerless, and in the fragrance realm or even the sensations that arise from nasal contact as a condition are neither powerful nor powerless.'",
        "source": "T05n0220_174:0937c21_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0937c23_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0937c23_4"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0937c24_5"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0937c25_0"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於舌界不作大不作小，於味界、舌識界及舌觸、舌觸為緣所生諸受亦不作大不作小；",
        "translation": "They give rise to this ideation: Thus, the perfection of wisdom does not make anything big or small regarding the sense-tongue realm; it does not make anything big or small regarding the taste realm, the sense-tongue consciousness realm, or the sensations that arise from tongue contact or tongue contact as supporting object.",
        "source": "T05n0220_174:0937c26_1"
    },
    {
        "source_sentence": "於舌界不作集不作散，於味界乃至舌觸為緣所生諸受亦不作集不作散；",
        "translation": "neither arising nor perishing in the sense-speaking realm; neither accumulation nor perishing in the sense-speaking realm, and neither arising nor perishing in the taste realm or even in the sensations that arise from tongue contact as supporting object.",
        "source": "T05n0220_174:0937c29_2"
    },
    {
        "source_sentence": "於舌界不作有量不作無量，於味界乃至舌觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the sense-speaking realm, and they are neither finite nor infinite in the taste realm or even in the sensations that arise from tongue contact as an object.",
        "source": "T05n0220_174:0938a01_3"
    },
    {
        "source_sentence": "於舌界不作廣不作狹，於味界乃至舌觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They are neither wide nor narrow in the sense-tongue realm; they are neither wide nor narrow in the taste realm or even in the sensations that arise from tongue contact as supporting object.",
        "source": "T05n0220_174:0938a03_4"
    },
    {
        "source_sentence": "於舌界不作有力不作無力，於味界乃至舌觸為緣所生諸受亦不作有力不作無力。』",
        "translation": "What's done in the tongue realm is neither powerful nor powerless, and what's done in the taste realm or even sensations that arise from tongue contact as a condition are neither powerful nor powerless.'",
        "source": "T05n0220_174:0938a05_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0938a07_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0938a07_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0938a09_0"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0938a09_1"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於身界不作大不作小，於觸界、身識界及身觸、身觸為緣所生諸受亦不作大不作小；",
        "translation": "They give rise to this ideation: Thus, the perfection of wisdom does not make anything big or small regarding the body realm; it does not make anything big or small regarding the touch realm, the body-consciousness realm, or the sensations that arise from bodily contact or bodily contact as supporting object.",
        "source": "T05n0220_174:0938a10_2"
    },
    {
        "source_sentence": "於身界不作集不作散，於觸界乃至身觸為緣所生諸受亦不作集不作散；",
        "translation": "Neither accumulation nor dispersal is made in relation to the body element; neither accumulation nor dispersal is made in relation to the tangible element, and neither accumulation nor dispersal is made in relation to the sensations that arise from bodily contact as supporting object.",
        "source": "T05n0220_174:0938a13_3"
    },
    {
        "source_sentence": "於身界不作有量不作無量，於觸界乃至身觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in relation to the body realm; they are neither finite nor infinite in relation to the contact realm. The feelings that arise from bodily contact as supporting object also are neither finite nor infinite.",
        "source": "T05n0220_174:0938a15_4"
    },
    {
        "source_sentence": "於身界不作廣不作狹，於觸界乃至身觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They are neither wide nor narrow in relation to the body realm; they are neither wide nor narrow in relation to the tangible realm. The feelings that arise by reason of contact, up to those that arise by reason of bodily contact, are also neither wide nor narrow.",
        "source": "T05n0220_174:0938a17_5"
    },
    {
        "source_sentence": "於身界不作有力不作無力，於觸界乃至身觸為緣所生諸受亦不作有力不作無力。』",
        "translation": "In the body realm, it's neither powerful nor powerless, and in the touch realm or even the sensations that arise from bodily contact as a condition are neither powerful nor powerless.'",
        "source": "T05n0220_174:0938a18_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0938a20_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0938a20_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0938a23_0"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0938a23_1"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於意界不作大不作小，於法界、意識界及意觸、意觸為緣所生諸受亦不作大不作小；",
        "translation": "They give rise to this ideation: Thus, the perfection of wisdom does not make the elements of mind great and does not make them small; neither does it make the elements of doctrine, the elements of mental consciousness, or the sensations that arise from mental contact or mental contact as supporting objects any large or small.",
        "source": "T05n0220_174:0938a24_2"
    },
    {
        "source_sentence": "於意界不作集不作散，於法界乃至意觸為緣所生諸受亦不作集不作散；",
        "translation": "In the realm of thought, no accumulation is made and no dispersal is made; in the realm of factors or even feelings that arise from mental contact as supporting object are also no accumulation made and no dispersal made.",
        "source": "T05n0220_174:0938a27_3"
    },
    {
        "source_sentence": "於意界不作有量不作無量，於法界乃至意觸為緣所生諸受亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the realm of thought, and they are neither finite nor infinite in the realm of reality or in the sensations that arise from mental contact as supporting object.",
        "source": "T05n0220_174:0938a29_4"
    },
    {
        "source_sentence": "於意界不作廣不作狹，於法界乃至意觸為緣所生諸受亦不作廣不作狹；",
        "translation": "They do not make the mind realm wide or narrow, and they do not make the Dharma realm wide or narrow. The feelings that arise from mental contact as supporting object also do not make them wide or narrow.",
        "source": "T05n0220_174:0938b02_5"
    },
    {
        "source_sentence": "於意界不作有力不作無力，於法界乃至意觸為緣所生諸受亦不作有力不作無力。』",
        "translation": "In the mind realm, it's neither powerful nor powerless, and in the Dharma realm or even the sensations that arise from mental contact as a condition are neither powerful nor powerless.'",
        "source": "T05n0220_174:0938b03_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0938b05_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0938b05_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0938b07_0"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0938b07_1"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於地界不作大不作小，於水、火、風、空、識界亦不作大不作小；",
        "translation": "They give rise to this idea: Thus the perfection of wisdom does not make anything big or small in the earth realm, and it does not make anything big or small in water, fire, wind, air, space, or consciousness realms.",
        "source": "T05n0220_174:0938b08_2"
    },
    {
        "source_sentence": "於地界不作集不作散，於水、火、風、空、識界亦不作集不作散；",
        "translation": "They do not make accumulation or disperse in the earth realm; they do not make accumulation or disperse in water, fire, wind, air, space, or consciousness realms.",
        "source": "T05n0220_174:0938b10_3"
    },
    {
        "source_sentence": "於地界不作有量不作無量，於水、火、風、空、識界亦不作有量不作無量；",
        "translation": "They are neither finite nor infinite in the earth realm; they are neither finite nor infinite in water, fire, wind, air, space, or consciousness realms.",
        "source": "T05n0220_174:0938b12_4"
    },
    {
        "source_sentence": "於地界不作廣不作狹，於水、火、風、空、識界亦不作廣不作狹；",
        "translation": "The earth element is neither wide nor narrow, and the elements water, fire, wind, air, space, and consciousness are also neither wide nor narrow.",
        "source": "T05n0220_174:0938b13_5"
    },
    {
        "source_sentence": "於地界不作有力不作無力，於水、火、風、空、識界亦不作有力不作無力。』",
        "translation": "What's not done in the earth realm is powerful and what's not done is powerless, and what's not done in the water, fire, wind, air, space, or consciousness realms is neither powerful nor powerless.'",
        "source": "T05n0220_174:0938b15_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0938b16_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0938b16_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0938b17_9"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0938b18_10"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於無明不作大不作小，於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱亦不作大不作小；",
        "translation": "They give rise to this idea: Thus, the perfection of wisdom does not make anything big or small regarding ignorance; it does not make anything big or small regarding formations, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, grasping, existence, birth, old age, sorrow, pain, and vexation, grief,",
        "source": "T05n0220_174:0938b19_11"
    },
    {
        "source_sentence": "於無明不作集不作散，於行乃至老死愁歎苦憂惱亦不作集不作散；",
        "translation": "They do not make accumulation or disperse in ignorance; they also do not make accumulation or disperse in sorrow, pain, vexation, and vexation from conditioned states of being up to old age and death.",
        "source": "T05n0220_174:0938b22_12"
    },
    {
        "source_sentence": "於無明不作有量不作無量，於行乃至老死愁歎苦憂惱亦不作有量不作無量；",
        "translation": "They do not think of ignorance as finite or infinite, and they do not think of conditioned phenomena as infinite or infinite. Nor do they think of old age, sorrow, pain, vexation, and suffering as infinite or infinite.",
        "source": "T05n0220_174:0938b24_13"
    },
    {
        "source_sentence": "於無明不作廣不作狹，於行乃至老死愁歎苦憂惱亦不作廣不作狹；",
        "translation": "They do not act broadly or narrowly in regard to ignorance. They also do not act broadly or narrowly in regard to the pain, sorrow, pain, vexation, and vexation of conditioned states up to old age and death.",
        "source": "T05n0220_174:0938b25_14"
    },
    {
        "source_sentence": "於無明不作有力不作無力，於行乃至老死愁歎苦憂惱亦不作有力不作無力。』",
        "translation": "In nescience, they don't do what's powerful and doesn't do what's powerless, and in practice or even old age, grief, pain, sorrow, and vexation don't do what's powerful and don't do what's powerless.'",
        "source": "T05n0220_174:0938b27_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0938b29_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0938b29_17"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_174:0938c01_18"
    },
    {
        "source_sentence": "若新學大乘菩薩摩訶薩依般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Suppose a newly trained great vehicle bodhisattva Mahāsattva relies on the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T05n0220_174:0938c01_19"
    },
    {
        "source_sentence": "起如是想：『如是般若波羅蜜多，於布施波羅蜜多不作大不作小，於淨戒、安忍、精進、靜慮、般若波羅蜜多亦不作大不作小；",
        "translation": "They give rise to such thoughts: In this way, the perfection of wisdom does not do much for the perfection of giving and does not do little for the perfection of generosity; neither does it do much for the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T05n0220_174:0938c03_20"
    },
    {
        "source_sentence": "於布施波羅蜜多不作集不作散，於淨戒乃至般若波羅蜜多亦不作集不作散；",
        "translation": "They do not make collections or scatter anything regarding the perfection of giving, and they do not make collections or scatter anything regarding pure morality or even the perfection of wisdom.",
        "source": "T05n0220_174:0938c06_21"
    },
    {
        "source_sentence": "於布施波羅蜜多不作有量不作無量，於淨戒乃至般若波羅蜜多亦不作有量不作無量；",
        "translation": "“Great enlightening beings do not think of the perfection of generosity as finite or infinite, and they do not think of it as infinite or infinite. Nor do they think of pure morality or even the perfection of wisdom as infinite or infinite.",
        "source": "T05n0220_174:0938c07_22"
    },
    {
        "source_sentence": "於布施波羅蜜多不作廣不作狹，於淨戒乃至般若波羅蜜多亦不作廣不作狹；",
        "translation": "They do not make the perfection of generosity wide or narrow, and they do not make the perfection of pure morality or even the perfection of wisdom broad or narrow.",
        "source": "T05n0220_174:0938c09_23"
    },
    {
        "source_sentence": "於布施波羅蜜多不作有力不作無力，於淨戒乃至般若波羅蜜多亦不作有力不作無力。』",
        "translation": "In the perfection of generosity, they don't make it powerful and don't make it powerless, and in the perfection of pure morality or even the perfection of wisdom, they don't make it powerful and don't make it powerless.'",
        "source": "T05n0220_174:0938c11_24"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_174:0938c13_25"
    },
    {
        "source_sentence": "是菩薩摩訶薩由起此想非行般若波羅蜜多。",
        "translation": "It's because the bodhisattva Mahāsattva gives rise to this conception that he doesn't practice the perfection of wisdom.",
        "source": "T05n0220_174:0938c14_0"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百七十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 4",
        "source": "T05n0220_174:0938c16_0"
    }
]