[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 7",
        "source": "T05n0220_179:0961c09_0"
    },
    {
        "source_sentence": "十九",
        "translation": "nineteen",
        "source": "T05n0220_179:0961c10_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T05n0220_179:0961c12_0"
    },
    {
        "source_sentence": "初分讚般若品第三十二之八",
        "translation": "The Thirty-second and Eighth Chapter of the First Part Praise of Prajñāpāramitā",
        "source": "T05n0220_179:0961c13_0"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0961c14_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於佛十力若作大小、不作大小，",
        "translation": "Suppose a bodhisattva-mahāsattva gives rise to this thought: 'Such is the greatness of the perfection of wisdom, whether it's greater or lesser in size with respect to the Buddha's ten powers.",
        "source": "T05n0220_179:0961c14_1"
    },
    {
        "source_sentence": "於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若作大小、不作大小；",
        "translation": "“Great enlightening beings practice the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great equanimity, and the eighteen unique qualities of buddhas:",
        "source": "T05n0220_179:0961c16_0"
    },
    {
        "source_sentence": "於佛十力若作集散、不作集散，於四無所畏乃至十八佛不共法若作集散、不作集散；",
        "translation": "In relation to the ten powers of buddhas, if one does accumulate and disperse them or not accumulate and disperse them, in relation to the four forms of fearlessness up to the eighteen unique qualities of buddhas, if one accumulates and disperses or not accumulate and disperse them.",
        "source": "T05n0220_179:0961c17_1"
    },
    {
        "source_sentence": "於佛十力若作有量無量、不作有量無量，於四無所畏乃至十八佛不共法若作有量無量、不作有量無量；",
        "translation": "“Great enlightening beings practice the ten powers of buddhas with measurelessness or without measure, and do not practice them with measurelessness or without measure. They practice the four forms of fearlessness up to the eighteen unique qualities of buddhas with measurelessness or without measure:",
        "source": "T05n0220_179:0961c19_2"
    },
    {
        "source_sentence": "於佛十力若作廣狹、不作廣狹，於四無所畏乃至十八佛不共法若作廣狹、不作廣狹；",
        "translation": "In relation to the ten powers of Buddha, if one makes them wide and narrow or not wide and narrow; in relation to the four forms of fearlessness up to the eighteen unique qualities of Buddha, if one makes them wide and narrow or not wide and narrow.",
        "source": "T05n0220_179:0961c22_3"
    },
    {
        "source_sentence": "於佛十力若作有力無力、不作有力無力，於四無所畏乃至十八佛不共法若作有力無力、不作有力無力。』",
        "translation": "If the Buddha's ten powers are powerful and powerless when done, powerful and powerless when not done, and powerful and powerless when not done, then the four fearlessnesses or even the 18 uncommon dharmas of the Buddha are powerful and powerless when done, and powerful and powerless when not done.'",
        "source": "T05n0220_179:0961c24_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0961c26_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0961c26_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0961c27_7"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0961c27_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0961c29_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於無忘失法若作大小、不作大小，",
        "translation": "Suppose a bodhisattva-mahāsattva gives rise to the thought, 'Such is the prajñāpāramitā that creates and doesn't create large and small with respect to the principle of nonforgetfulness.",
        "source": "T05n0220_179:0961c29_1"
    },
    {
        "source_sentence": "於恒住捨性若作大小、不作大小；",
        "translation": "In the nature of eternally abiding equanimity, one does or does not make major and minor [factors].",
        "source": "T05n0220_179:0962a02_2"
    },
    {
        "source_sentence": "於無忘失法若作集散、不作集散，於恒住捨性若作集散、不作集散；",
        "translation": "In the state of nonforgetfulness, if one makes it accumulate and disperse, or not make it accumulate and disperse; in the state of eternally abiding equanimity, if one makes it accumulate and disperse, or not make it accumulate and disperse.",
        "source": "T05n0220_179:0962a02_3"
    },
    {
        "source_sentence": "於無忘失法若作有量無量、不作有量無量，於恒住捨性若作有量無量、不作有量無量；",
        "translation": "In the state of nonforgetfulness, they do what is immeasurable, immeasurable, and immeasurable; in the state of eternally abiding equanimity, they do what is immeasurable, immeasurable, and immeasurable.",
        "source": "T05n0220_179:0962a04_4"
    },
    {
        "source_sentence": "於無忘失法若作廣狹、不作廣狹，於恒住捨性若作廣狹、不作廣狹；",
        "translation": "In the state of nonforgetfulness, if one makes it wide and narrow or does not make it wide and narrow; in the state of eternally abiding equanimity, if one makes it wide and narrow or does not make it wide and narrow.",
        "source": "T05n0220_179:0962a06_5"
    },
    {
        "source_sentence": "於無忘失法若作有力無力、不作有力無力，於恒住捨性若作有力無力、不作有力無力。』",
        "translation": "If something is powerful and powerless when it's done in the absence of forgetfulness, strong and powerless when it's done, and strong and powerless when it's not done, and strong and powerless when it's done with the constant abiding equanimity, then what's powerful and powerless when it's done, and strong and powerless when it's not",
        "source": "T05n0220_179:0962a07_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0962a09_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0962a10_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0962a11_9"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0962a11_10"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0962a13_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於一切智若作大小、不作大小，",
        "translation": "Suppose a bodhisattva-mahāsattva gives rise to the thought, 'Such is the prajñāpāramitā that creates and doesn't create large and small with respect to all cognition.",
        "source": "T05n0220_179:0962a13_1"
    },
    {
        "source_sentence": "於道相智、一切相智若作大小、不作大小；",
        "translation": "In the knowledge of the characteristics of the path and in the knowledge of all characteristics, they do or don’t make large or small.",
        "source": "T05n0220_179:0962a15_0"
    },
    {
        "source_sentence": "於一切智若作集散、不作集散，於道相智、一切相智若作集散、不作集散；",
        "translation": "In omniscience, he does not do anything to accumulate or disperse; in knowledge of the path and knowledge of all characteristics, he does not do anything to accumulate or disperse.",
        "source": "T05n0220_179:0962a15_1"
    },
    {
        "source_sentence": "於一切智若作有量無量、不作有量無量，於道相智、一切相智若作有量無量、不作有量無量；",
        "translation": "“In relation to omniscience, what is done is boundless and measureless; what is not done is boundless and measureless; in relation to knowledge of the path and knowledge of all characteristics, what is done is boundless and measureless; what is not done is boundless and measureless.",
        "source": "T05n0220_179:0962a17_2"
    },
    {
        "source_sentence": "於一切智若作廣狹、不作廣狹，於道相智、一切相智若作廣狹、不作廣狹；",
        "translation": "In omniscience, if one makes it wide and narrow or not wide and narrow; in knowledge of the path and knowledge of all characteristics, if one make it wide and narrow or not wide.",
        "source": "T05n0220_179:0962a19_3"
    },
    {
        "source_sentence": "於一切智若作有力無力、不作有力無力，於道相智、一切相智若作有力無力、不作有力無力。』",
        "translation": "If omniscience is powerful and powerless when it's done, powerful and powerless when it's not done, and powerful and powerless when it's done when it's done with knowledge of the path and omniscience, powerful and powerless when it's done, and powerful and powerless when it's not done.'",
        "source": "T05n0220_179:0962a21_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0962a23_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0962a23_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0962a24_7"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0962a25_0"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0962a26_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於一切陀羅尼門若作大小、不作大小，",
        "translation": "Suppose a bodhisattva-mahāsattva gives rise to the thought, 'Such is the prajñāpāramitā that makes all dhāraṇī teachings large or small and doesn't make them small,",
        "source": "T05n0220_179:0962a26_1"
    },
    {
        "source_sentence": "於一切三摩地門若作大小、不作大小；",
        "translation": "“Great enlightening beings practice all kinds of concentrations, whether large or small, according to their mental capacities.",
        "source": "T05n0220_179:0962a28_2"
    },
    {
        "source_sentence": "於一切陀羅尼門若作集散、不作集散，於一切三摩地門若作集散、不作集散；",
        "translation": "In all the aspects of dhāraṇī they make accumulation and do not make accumulation, and in all the aspects of concentration they make accumulation and do not make accumulation.",
        "source": "T05n0220_179:0962a29_3"
    },
    {
        "source_sentence": "於一切陀羅尼門若作有量無量、不作有量無量，於一切三摩地門若作有量無量、不作有量無量；",
        "translation": "In all the approaches to enlightening beings’ attainment of concentration, they do so with measurelessness or without measure; in all the approaches to enlightening beings’ attainment of concentration, they do so with measurelessness or without measure.",
        "source": "T05n0220_179:0962b01_4"
    },
    {
        "source_sentence": "於一切陀羅尼門若作廣狹、不作廣狹，於一切三摩地門若作廣狹、不作廣狹；",
        "translation": "“Great enlightening beings practice dedication of all kinds of teachings, whether they are broad and narrow or not. They practice dedication of all kinds of doctrines; they practice dedication of all kinds of doctrines in all ways:",
        "source": "T05n0220_179:0962b04_5"
    },
    {
        "source_sentence": "於一切陀羅尼門若作有力無力、不作有力無力，於一切三摩地門若作有力無力、不作有力無力。』",
        "translation": "If the approach of all dhāraṇī teachings is powerful and powerless, or if it's not powerful and powerless, then the approach of all samādhi teachings is powerful and powerless, or if it's not powerful and powerless.'",
        "source": "T05n0220_179:0962b05_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0962b08_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0962b08_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0962b09_9"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0962b09_10"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0962b11_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於預流若作大小、不作大小，",
        "translation": "Suppose a bodhisattva Mahāsattva gives rise to the thought, 'Such-and-such prajñāpāramitā does or doesn't do large and small in pre-flow,",
        "source": "T05n0220_179:0962b11_1"
    },
    {
        "source_sentence": "於一來、不還、阿羅漢若作大小、不作大小；",
        "translation": "“Great enlightening beings make great or small deeds for the sake of sentient beings in the past, future, and present, as well as those who have attained buddhahood.",
        "source": "T05n0220_179:0962b12_2"
    },
    {
        "source_sentence": "於預流若作集散、不作集散，於一來、不還、阿羅漢若作集散、不作集散；",
        "translation": "In the stream-enterer, one does not make accumulation and disperse; in the one who comes back, one does not go back. The arhat makes accumulation and disperses and does not make accumulation and disperse.",
        "source": "T05n0220_179:0962b13_3"
    },
    {
        "source_sentence": "於預流若作有量無量、不作有量無量，於一來、不還、阿羅漢若作有量無量、不作有量無量；",
        "translation": "If they do what is immeasurable and immeasurable in relation to the stream-entry, if they do what is immeasurable and immeasurable in relation to that which is not done, or if they do what is immeasurable and immeasurable in relation to that which is not done.",
        "source": "T05n0220_179:0962b15_4"
    },
    {
        "source_sentence": "於預流若作廣狹、不作廣狹，於一來、不還、阿羅漢若作廣狹、不作廣狹；",
        "translation": "In the stream-entry one makes it wide and narrow, but not wide and narrow; in the one who comes back or does not come back, and in the arhat one makes it wide and narrow, but not wide and narrow.",
        "source": "T05n0220_179:0962b17_5"
    },
    {
        "source_sentence": "於預流若作有力無力、不作有力無力，於一來、不還、阿羅漢若作有力無力、不作有力無力。』",
        "translation": "If the pre-flow is powerful and powerless when it's done, powerful and powerless when it's done, and powerful and powerless when it's not done, and powerful and powerless when it's done by a once-returner, a nonreturner, or an arhat who's powerful and powerless when he's done, and powerful and powerless when he doesn't",
        "source": "T05n0220_179:0962b19_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0962b21_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0962b21_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0962b22_9"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0962b22_10"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0962b24_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於預流向預流果若作大小、不作大小，",
        "translation": "Suppose a bodhisattva Mahāsattva gives rise to the thought, 'Such-and-such prajñāpāramitā is directed toward the fruit of stream-winner in terms of whether it's large or small and not large,",
        "source": "T05n0220_179:0962b24_1"
    },
    {
        "source_sentence": "於一來向一來果、不還向不還果、阿羅漢向阿羅漢果若作大小、不作大小；",
        "translation": "In the one-coming, they proceed to the fruit of the one-coming; in the nonreturner, they proceed to the fruit of the nonreturner; when the arhat goes to the fruit of the arhat, it is either big or small and when not big.",
        "source": "T05n0220_179:0962b26_2"
    },
    {
        "source_sentence": "於預流向預流果若作集散、不作集散，於一來向乃至阿羅漢果若作集散、不作集散；",
        "translation": "If the fruit of stream-entry and the one destined for stream-entry are made to be accumulated or not accumulated, then the fruit of once-returning up to enlightenment is made to be accumulated or not accumulated; if it is made to be accumulated or not accumulated.",
        "source": "T05n0220_179:0962b27_3"
    },
    {
        "source_sentence": "於預流向預流果若作有量無量、不作有量無量，於一來向乃至阿羅漢果若作有量無量、不作有量無量；",
        "translation": "The fruit of stream-entry and the fruit of stream-entry are both limited and unlimited in what they do, and also limited and unlimited in what they don’t do. The fruit of once-returning up to enlightenment is either limited and unlimited in what they do or limited and unlimited in what they don’t do.",
        "source": "T05n0220_179:0962b29_4"
    },
    {
        "source_sentence": "於預流向預流果若作廣狹、不作廣狹，於一來向乃至阿羅漢果若作廣狹、不作廣狹；",
        "translation": "If the fruit of stream-entry is made wide and narrow in relation to the one destined for stream-entry, or if it is not made wide and narrow. The fruit of once-returning up to enlightenment is made wide and narrow but not made narrow.",
        "source": "T05n0220_179:0962c03_5"
    },
    {
        "source_sentence": "於預流向預流果若作有力無力、不作有力無力，於一來向乃至阿羅漢果若作有力無力、不作有力無力。』",
        "translation": "If the fruit of pre-flow goes to pre-flow, it's powerful and powerless when it's done, and not powerful and powerless when it's done, and if the fruit of once-returning or even the fruit of arhatship goes to one place, it's powerful and powerless when it's done, and not powerful and powerless when it's done.'",
        "source": "T05n0220_179:0962c05_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0962c07_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0962c07_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0962c08_9"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0962c09_0"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0962c10_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於獨覺若作大小、不作大小，",
        "translation": "Suppose a bodhisattva-mahāsattva gives rise to the thought, 'Such and such is the prajñāpāramitā of the solitary realizer whether he does or doesn't do large or small.",
        "source": "T05n0220_179:0962c10_1"
    },
    {
        "source_sentence": "於獨覺菩提若作大小、不作大小；",
        "translation": "Regarding enlightenment of the self-enlightened one, whether it does or doesn’t make a big or small difference.",
        "source": "T05n0220_179:0962c11_2"
    },
    {
        "source_sentence": "於獨覺若作集散、不作集散，於獨覺菩提若作集散、不作集散；",
        "translation": "In the case of the self-enlightened one, it is made to be scattered and not scattered; in the case of the enlightenment of the self-enlightened one, it is made to be scattered and not scattered; in the case of the unenlightened one, it is made to be scattered.",
        "source": "T05n0220_179:0962c12_3"
    },
    {
        "source_sentence": "於獨覺若作有量無量、不作有量無量，於獨覺菩提若作有量無量、不作有量無量；",
        "translation": "“The enlightenment of the self-enlightened one is immeasurable, immeasurable, and immeasurable when it is done or not done by others.",
        "source": "T05n0220_179:0962c14_4"
    },
    {
        "source_sentence": "於獨覺若作廣狹、不作廣狹，於獨覺菩提若作廣狹、不作廣狹；",
        "translation": "In the case of the self-enlightened one, it is made wide and narrow; in the case of the enlightenment of the self-enlightened one, it is made wide and narrow; in the case of the enlightenment of the self-enlightened one, it is made broad and narrow; in the case of the unenlightened one,",
        "source": "T05n0220_179:0962c16_5"
    },
    {
        "source_sentence": "於獨覺若作有力無力、不作有力無力，於獨覺菩提若作有力無力、不作有力無力。』",
        "translation": "If the solitary realizer's enlightenment is powerful and powerless, it's powerful and powerless; if he doesn't do so, he's powerful and powerless; and if he doesn't do so, he's powerful and powerless.'",
        "source": "T05n0220_179:0962c17_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0962c19_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0962c19_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0962c20_9"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0962c20_10"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0962c22_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於諸菩薩摩訶薩若作大小、不作大小，",
        "translation": "“If a bodhisattva-mahāsattva gives rise to the thought, ‘Thus is the perfection of wisdom done by bodhisattvas and mahāsattvas whether large or small,",
        "source": "T05n0220_179:0962c22_1"
    },
    {
        "source_sentence": "於菩薩摩訶薩行若作大小、不作大小；",
        "translation": "“Great enlightening beings’ practices are large and small, but they do not make big or small.",
        "source": "T05n0220_179:0962c24_2"
    },
    {
        "source_sentence": "於諸菩薩摩訶薩若作集散、不作集散，於菩薩摩訶薩行若作集散、不作集散；",
        "translation": "“Great enlightening beings assemble and disperse what they do and don’t assemble, and the practice of great enlightening beings assembles and disperses what they do and don’t assemble.",
        "source": "T05n0220_179:0962c25_3"
    },
    {
        "source_sentence": "於諸菩薩摩訶薩若作有量無量、不作有量無量，於菩薩摩訶薩行若作有量無量、不作有量無量；",
        "translation": "“The practice of great enlightening beings is immeasurable, immeasurable, immeasurable when it is done and immeasurable when it is not done. The practice of great enlightening beings is immeasurable, immeasurable when it is done and immeasurable when it is not done.",
        "source": "T05n0220_179:0962c26_4"
    },
    {
        "source_sentence": "於諸菩薩摩訶薩若作廣狹、不作廣狹，於菩薩摩訶薩行若作廣狹、不作廣狹；",
        "translation": "“Great enlightening beings’ practices may be broad and narrow, or they may not be broad and narrow; but their practices may be broad and narrow, or they may not be broad and narrow.",
        "source": "T05n0220_179:0962c29_5"
    },
    {
        "source_sentence": "於諸菩薩摩訶薩若作有力無力、不作有力無力，於菩薩摩訶薩行若作有力無力、不作有力無力。』",
        "translation": "If the bodhisattva-mahāsattva's actions are powerful, weak, and powerless, and if he doesn't do them, they're powerful, weak, and powerless, and if he doesn't do them, they're powerful, weak, and powerless.'",
        "source": "T05n0220_179:0963a01_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0963a04_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0963a04_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0963a05_9"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0963a05_10"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0963a07_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於諸如來、應、正等覺若作大小、不作大小，",
        "translation": "Suppose a bodhisattva-mahāsattva gives rise to the thought, 'Such and such is the prajñāpāramitā that among the Tathāgatas, Arhats, and Completely Awakened Ones, whether they do size or not,",
        "source": "T05n0220_179:0963a07_1"
    },
    {
        "source_sentence": "於佛無上正等菩提若作大小、不作大小；",
        "translation": "In the Buddha’s supreme true enlightenment, whether they act large or small and do not act small.",
        "source": "T05n0220_179:0963a09_2"
    },
    {
        "source_sentence": "於諸如來、應、正等覺若作集散、不作集散，於佛無上正等菩提若作集散、不作集散；",
        "translation": "“Great enlightening beings practice accumulation and non-accumulation in the presence of buddhas, while they practice accumulation and non-accumulation in the presence of buddhas. They practice accumulation and non-accumulation in the presence of buddhas, while they practice accumulation and non-accumulation in the presence of buddhas’ supreme perfect enlightenment.",
        "source": "T05n0220_179:0963a10_3"
    },
    {
        "source_sentence": "於諸如來、應、正等覺若作有量無量、不作有量無量，於佛無上正等菩提若作有量無量、不作有量無量；",
        "translation": "“Great enlightening beings’ practice of giving to sentient beings is immeasurable, immeasurable, immeasurable and immeasurable in regard to all buddhas; they are immeasurable, immeasurable, immeasurable in regard to the supreme perfect enlightenment of buddhas.",
        "source": "T05n0220_179:0963a12_4"
    },
    {
        "source_sentence": "於諸如來、應、正等覺若作廣狹、不作廣狹，於佛無上正等菩提若作廣狹、不作廣狹；",
        "translation": "“Great enlightening beings’ practice of dedication is similar to that of the buddhas’ practice of dedication:",
        "source": "T05n0220_179:0963a14_5"
    },
    {
        "source_sentence": "於諸如來、應、正等覺若作有力無力、不作有力無力，於佛無上正等菩提若作有力無力、不作有力無力。』",
        "translation": "If the Tathāgatas, Arhats, and Perfectly Awakened Ones are powerful and powerless, or if they aren't powerful and powerless, then they're powerful and powerless and powerless when they create the Buddha's unsurpassed perfect enlightenment.'",
        "source": "T05n0220_179:0963a16_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0963a18_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0963a18_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0963a19_9"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0963a20_10"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0963a21_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於一切法若作大小、不作大小，",
        "translation": "Suppose a bodhisattva-mahāsattva gives rise to the thought, 'Such is the prajñāpāramitā that creates and doesn't create large or small size for all things.",
        "source": "T05n0220_179:0963a21_1"
    },
    {
        "source_sentence": "於一切法若作集散、不作集散，於一切法若作有量無量、不作有量無量，",
        "translation": "“In regard to all things, if they are accumulated, dispersed, or not accumulated, and if they are made finite or infinite in relation to all things, and if they are not made finite or infinite",
        "source": "T05n0220_179:0963a23_2"
    },
    {
        "source_sentence": "於一切法若作廣狹、不作廣狹，於一切法若作有力無力、不作有力無力。』",
        "translation": "If all things are made wide and narrow and not made wide and narrow, and if all things are made powerful and powerless and not made powerful and powerless, then they'll become strong and powerless.'",
        "source": "T05n0220_179:0963a24_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0963a26_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
        "translation": "This is the name given to a bodhisattva-mahāsattva who has great attainment and doesn't practice the perfection of wisdom.",
        "source": "T05n0220_179:0963a26_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T05n0220_179:0963a27_6"
    },
    {
        "source_sentence": "非有所得想能證無上正等菩提故。",
        "translation": "It's because conceptions that don't have attainment can realize unsurpassed perfect enlightenment.",
        "source": "T05n0220_179:0963a27_7"
    },
    {
        "source_sentence": "「所以者何？",
        "translation": "What is the reason for this?",
        "source": "T05n0220_179:0963a29_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0963a29_1"
    },
    {
        "source_sentence": "有情無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because sentient beings lack birth, you should know that the prajñāpāramitā also lacks birth.",
        "source": "T05n0220_179:0963a29_2"
    },
    {
        "source_sentence": "有情無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because sentient beings lack cessation, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T05n0220_179:0963b01_3"
    },
    {
        "source_sentence": "有情無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because sentient beings lack self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0963b02_4"
    },
    {
        "source_sentence": "有情無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because sentient beings lack existence, you should know that the prajñāpāramitā also lacks existence.",
        "source": "T05n0220_179:0963b03_5"
    },
    {
        "source_sentence": "有情空故，當知般若波羅蜜多亦空。",
        "translation": "Because sentient beings are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0963b04_6"
    },
    {
        "source_sentence": "有情無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because sentient beings lack marks, you should know that the prajñāpāramitā also has no marks.",
        "source": "T05n0220_179:0963b05_7"
    },
    {
        "source_sentence": "有情無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because sentient beings lack wishes, you should know that the prajñāpāramitā also lacks wishes.",
        "source": "T05n0220_179:0963b06_8"
    },
    {
        "source_sentence": "有情遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because sentient beings are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0963b07_9"
    },
    {
        "source_sentence": "有情寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because sentient beings are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0963b08_10"
    },
    {
        "source_sentence": "有情不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because sentient beings are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0963b09_0"
    },
    {
        "source_sentence": "有情不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because sentient beings are inconceivable, you should know that the perfection of wisdom is also inconceivable.",
        "source": "T05n0220_179:0963b10_1"
    },
    {
        "source_sentence": "有情無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because sentient beings lack perception, you should know that the prajñāpāramitā also lacks perception.",
        "source": "T05n0220_179:0963b11_2"
    },
    {
        "source_sentence": "有情勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of sentient beings isn't accomplished, you should know that the power of the prajñāpāramitā won't be accomplished either.",
        "source": "T05n0220_179:0963b12_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0963b13_4"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0963b13_5"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0963b16_0"
    },
    {
        "source_sentence": "色無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because form has no birth, it should be known that the perfection of wisdom also has no birth.",
        "source": "T05n0220_179:0963b16_1"
    },
    {
        "source_sentence": "受、想、行、識無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because feeling, perception, volition, and consciousness are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0963b17_2"
    },
    {
        "source_sentence": "色無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because form has no cessation, it should be known that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0963b18_3"
    },
    {
        "source_sentence": "受、想、行、識無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because feeling, perception, volition, and consciousness have no cessation, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T05n0220_179:0963b19_4"
    },
    {
        "source_sentence": "色無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because form has no self-nature, it should be known that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0963b20_5"
    },
    {
        "source_sentence": "受、想、行、識無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because feeling, perception, volition, and consciousness have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0963b21_6"
    },
    {
        "source_sentence": "色無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because form has no existence, it should be known that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0963b22_7"
    },
    {
        "source_sentence": "受、想、行、識無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because feeling, perception, volition, volition, and consciousness lack existence, you should know that the prajñāpāramitā also lack existence.",
        "source": "T05n0220_179:0963b23_8"
    },
    {
        "source_sentence": "色空故，當知般若波羅蜜多亦空；",
        "translation": "Because form is emptiness, they should know that the transcendent ways are also emptiness.",
        "source": "T05n0220_179:0963b24_9"
    },
    {
        "source_sentence": "受、想、行、識空故，當知般若波羅蜜多亦空。",
        "translation": "Because feeling, perception, volition, volition, and consciousness are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0963b25_10"
    },
    {
        "source_sentence": "色無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because form has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0963b26_11"
    },
    {
        "source_sentence": "受、想、行、識無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because feeling, perception, volition, and consciousness have no marks, you should know that the prajñāpāramitā also has no marks.",
        "source": "T05n0220_179:0963b27_12"
    },
    {
        "source_sentence": "色無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because form has no wish, it should be known that the perfection of wisdom also has no wish.",
        "source": "T05n0220_179:0963b28_13"
    },
    {
        "source_sentence": "受、想、行、識無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because feeling, perception, volition, volition, and consciousness lack wishes, you should know that the prajñāpāramitā also lacks wishes.",
        "source": "T05n0220_179:0963b29_0"
    },
    {
        "source_sentence": "色遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because form is far removed, it should be known that the perfection of wisdom is also far removed.",
        "source": "T05n0220_179:0963c01_1"
    },
    {
        "source_sentence": "受、想、行、識遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because feeling, perception, volition, and consciousness are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0963c01_2"
    },
    {
        "source_sentence": "色寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because form is quiescent, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0963c03_0"
    },
    {
        "source_sentence": "受、想、行、識寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because feeling, perception, volition, and consciousness are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0963c03_1"
    },
    {
        "source_sentence": "色不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because form is unobtainable, you should know that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0963c04_2"
    },
    {
        "source_sentence": "受、想、行、識不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because feeling, perception, volition, and consciousness are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0963c05_3"
    },
    {
        "source_sentence": "色不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because form is inconceivable, you should know that the perfection of wisdom is also inconceivable.",
        "source": "T05n0220_179:0963c07_4"
    },
    {
        "source_sentence": "受、想、行、識不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because feeling, perception, volition, volition, and consciousness are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0963c08_5"
    },
    {
        "source_sentence": "色無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because form has no perception, it should be known that the perfection of wisdom also has no perception.",
        "source": "T05n0220_179:0963c09_6"
    },
    {
        "source_sentence": "受、想、行、識無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because feeling, perception, volition, volition, and consciousness lack perception, you should know that the prajñāpāramitā also lacks perception.",
        "source": "T05n0220_179:0963c10_7"
    },
    {
        "source_sentence": "色勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the power of form is not accomplished, it should be known that the power of the perfection of wisdom is also not accomplished.",
        "source": "T05n0220_179:0963c11_8"
    },
    {
        "source_sentence": "受、想、行、識勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of feeling, perception, volition, and consciousness isn't accomplished, you should know that the power of the prajñāpāramitā won't be accomplished either.",
        "source": "T05n0220_179:0963c12_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0963c14_10"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0963c14_11"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0963c16_0"
    },
    {
        "source_sentence": "眼處無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the sphere of vision has no birth, you should know that the perfection of wisdom also has no birth.",
        "source": "T05n0220_179:0963c16_1"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields lack birth, you should know that the prajñāpāramitā also lack birth.",
        "source": "T05n0220_179:0963c17_2"
    },
    {
        "source_sentence": "眼處無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because the eye sense base has no cessation, you should know that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0963c18_3"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields don't cease, you should know that the prajñāpāramitā also doesn't cease.",
        "source": "T05n0220_179:0963c19_4"
    },
    {
        "source_sentence": "眼處無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the sphere of vision has no self-nature, it should be known that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0963c20_5"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields lack self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0963c21_6"
    },
    {
        "source_sentence": "眼處無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the eye sense base has no existence, you should know that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0963c22_7"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields lack existence, you should know that the prajñāpāramitā also lack existence.",
        "source": "T05n0220_179:0963c23_8"
    },
    {
        "source_sentence": "眼處空故，當知般若波羅蜜多亦空；",
        "translation": "Because the sphere of vision is empty, you should know that the transcendent wisdom-pāramitā is also empty.",
        "source": "T05n0220_179:0963c25_9"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處空故，當知般若波羅蜜多亦空。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0963c25_10"
    },
    {
        "source_sentence": "眼處無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the eye sense base has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0963c27_0"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields lack marks, you should know that the prajñāpāramitā also has no marks.",
        "source": "T05n0220_179:0963c27_1"
    },
    {
        "source_sentence": "眼處無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the sphere of vision has no wishes, you should know that the transcendent wisdom-pāramitā also has no wishes.",
        "source": "T05n0220_179:0963c29_2"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the ear, nose, tongue, body, and mind places have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0964a01_3"
    },
    {
        "source_sentence": "眼處遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the locus of seeing is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0964a02_4"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields are distant, you should know that the prajñāpāramitā is also distant.",
        "source": "T05n0220_179:0964a03_5"
    },
    {
        "source_sentence": "眼處寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because the sphere of vision is quiescent, it should be known that the transcendent wisdom-pāramitā is also quiescent.",
        "source": "T05n0220_179:0964a04_6"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0964a05_7"
    },
    {
        "source_sentence": "眼處不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the sphere of vision is unobtainable, you should know that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0964a06_8"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the ear, nose, tongue, body, and mind places are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0964a07_9"
    },
    {
        "source_sentence": "眼處不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the sphere of vision is inconceivable, you should know that the perfection of wisdom is also inconceivable.",
        "source": "T05n0220_179:0964a08_10"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0964a09_11"
    },
    {
        "source_sentence": "眼處無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because there is no perceptual consciousness in the sense-field of the eye, it should be known that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0964a11_12"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because there's no perception in the ear, nose, tongue, body, or mind, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0964a12_13"
    },
    {
        "source_sentence": "眼處勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the power of the sphere of vision is not accomplished, you should know that also the power of the power of the perfection of wisdom is not accomplished.",
        "source": "T05n0220_179:0964a13_14"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of the ear, nose, tongue, body, and mind places isn't accomplished, you should know that the power of the prajñāpāramitā won't be accomplished either.",
        "source": "T05n0220_179:0964a14_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0964a16_16"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0964a16_17"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0964a18_0"
    },
    {
        "source_sentence": "色處無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the realm of form has no birth, you should know that the transcendent wisdom-pāramitā also has no birth.",
        "source": "T05n0220_179:0964a18_1"
    },
    {
        "source_sentence": "聲、香、味、觸、法處無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0964a19_2"
    },
    {
        "source_sentence": "色處無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because form has no cessation, it should be known that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0964a20_3"
    },
    {
        "source_sentence": "聲、香、味、觸、法處無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas don't cease, you should know that the prajñāpāramitā also doesn't cease.",
        "source": "T05n0220_179:0964a21_4"
    },
    {
        "source_sentence": "色處無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the form realm has no self-nature, you should know that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0964a22_5"
    },
    {
        "source_sentence": "聲、香、味、觸、法處無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas lack self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0964a23_6"
    },
    {
        "source_sentence": "色處無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because form has no existence, it should be known that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0964a24_7"
    },
    {
        "source_sentence": "聲、香、味、觸、法處無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas lack existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0964a26_0"
    },
    {
        "source_sentence": "色處空故，當知般若波羅蜜多亦空；",
        "translation": "Because the realm of form is empty, you should know that the transcendent wisdom-pāramitā is also empty.",
        "source": "T05n0220_179:0964a27_1"
    },
    {
        "source_sentence": "聲、香、味、觸、法處空故，當知般若波羅蜜多亦空。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0964a28_2"
    },
    {
        "source_sentence": "色處無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the form realm has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0964a29_3"
    },
    {
        "source_sentence": "聲、香、味、觸、法處無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas lack marks, you should know that the prajñāpāramitā also has no marks.",
        "source": "T05n0220_179:0964b01_4"
    },
    {
        "source_sentence": "色處無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the form realm has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0964b02_5"
    },
    {
        "source_sentence": "聲、香、味、觸、法處無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas lack wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0964b03_6"
    },
    {
        "source_sentence": "色處遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the realm of form is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0964b04_7"
    },
    {
        "source_sentence": "聲、香、味、觸、法處遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0964b05_8"
    },
    {
        "source_sentence": "色處寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because the realm of form is quiescent, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0964b06_9"
    },
    {
        "source_sentence": "聲、香、味、觸、法處寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0964b07_10"
    },
    {
        "source_sentence": "色處不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the realm of form is unobtainable, you should know that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0964b08_11"
    },
    {
        "source_sentence": "聲、香、味、觸、法處不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0964b09_12"
    },
    {
        "source_sentence": "色處不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the realm of form is inconceivable, you should know that the perfection of wisdom is also inconceivable.",
        "source": "T05n0220_179:0964b11_0"
    },
    {
        "source_sentence": "聲、香、味、觸、法處不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0964b12_1"
    },
    {
        "source_sentence": "色處無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because there is no perceptual consciousness in the realm of form, you should know that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0964b13_2"
    },
    {
        "source_sentence": "聲、香、味、觸、法處無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the sense-fields of sound, odor, taste, touch, and dharmas lack perception, you should know that the prajñāpāramitā also lacks perception.",
        "source": "T05n0220_179:0964b14_3"
    },
    {
        "source_sentence": "色處勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the momentum of the realm of form is not accomplished, it should be known that the momentum of the perfection of wisdom is also not accomplished.",
        "source": "T05n0220_179:0964b15_4"
    },
    {
        "source_sentence": "聲、香、味、觸、法處勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of sound, odor, taste, touch, and dharma fields isn't accomplished, you should know that the power of the prajñāpāramitā won't be accomplished either.",
        "source": "T05n0220_179:0964b17_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0964b18_6"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0964b18_7"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0964b21_0"
    },
    {
        "source_sentence": "眼界無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the eye realm has no birth, it should be known that the perfection of wisdom also has no birth.",
        "source": "T05n0220_179:0964b21_1"
    },
    {
        "source_sentence": "色界、眼識界及眼觸、眼觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0964b22_2"
    },
    {
        "source_sentence": "眼界無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because the eye realm has no cessation, you should know that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0964b23_3"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition don't cease, you should know that the prajñāpāramitā also doesn't cease.",
        "source": "T05n0220_179:0964b24_4"
    },
    {
        "source_sentence": "眼界無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the eye realm has no self-nature, you should know that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0964b26_5"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0964b27_6"
    },
    {
        "source_sentence": "眼界無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the eye realm has no existence, you should know that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0964b29_7"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition have no existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0964c01_8"
    },
    {
        "source_sentence": "眼界空故，當知般若波羅蜜多亦空；",
        "translation": "Because of the emptiness of the eye realm, it should be known that also the perfection of wisdom is emptiness.",
        "source": "T05n0220_179:0964c02_9"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0964c03_10"
    },
    {
        "source_sentence": "眼界無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the eye realm has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0964c05_11"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition have no marks, you should know that the prajñāpāramitā has no marks either.",
        "source": "T05n0220_179:0964c06_0"
    },
    {
        "source_sentence": "眼界無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the eye realm has no wishes, you should know that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0964c07_1"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0964c08_2"
    },
    {
        "source_sentence": "眼界遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the eye realm is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0964c10_0"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0964c10_1"
    },
    {
        "source_sentence": "眼界寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because of the quiescence of the eye realm, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0964c12_2"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0964c13_3"
    },
    {
        "source_sentence": "眼界不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the eye realm is unobtainable, you should know that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0964c14_4"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0964c16_0"
    },
    {
        "source_sentence": "眼界不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the eye realm is inconceivable, you should know that the perfection of wisdom is also inconceivable.",
        "source": "T05n0220_179:0964c17_1"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0964c18_2"
    },
    {
        "source_sentence": "眼界無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because the eye realm has no perceptual consciousness, you should know that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0964c20_3"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the form realm and even the sensations that arise from visual contact as a condition have no perception, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0964c21_4"
    },
    {
        "source_sentence": "眼界勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the momentum of the eye realm is not accomplished, it should be known that also the momentum of the perfection of wisdom is not accomplished.",
        "source": "T05n0220_179:0964c23_5"
    },
    {
        "source_sentence": "色界乃至眼觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the momentum of feelings that arise in the form realm and even sensations that arise from visual contact as a condition aren't accomplished, you should know that the momentum of the prajñāpāramitā is also not accomplished.",
        "source": "T05n0220_179:0964c24_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0964c26_7"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0964c26_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0964c28_0"
    },
    {
        "source_sentence": "耳界無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the ear realm has no arising, you should know that the transcendent wisdom of liberation also has no arising.",
        "source": "T05n0220_179:0964c28_1"
    },
    {
        "source_sentence": "聲界、耳識界及耳觸、耳觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as a condition are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0964c29_2"
    },
    {
        "source_sentence": "耳界無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because the ear realm has no cessation, it should be known that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0965a01_3"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition for sound don't cease, you should know that the prajñāpāramitā also doesn't cease.",
        "source": "T05n0220_179:0965a02_4"
    },
    {
        "source_sentence": "耳界無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the ear realm has no self-nature, you should know that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0965a04_5"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0965a05_6"
    },
    {
        "source_sentence": "耳界無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the ear realm has no existence, you should know that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0965a07_7"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition have no existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0965a08_8"
    },
    {
        "source_sentence": "耳界空故，當知般若波羅蜜多亦空；",
        "translation": "Because of the emptiness of the ear realm, it should be known that the perfection of wisdom is also empty.",
        "source": "T05n0220_179:0965a09_9"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0965a10_10"
    },
    {
        "source_sentence": "耳界無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the ear realm has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0965a12_11"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition are without marks, you should know that the prajñāpāramitā has no marks either.",
        "source": "T05n0220_179:0965a13_0"
    },
    {
        "source_sentence": "耳界無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the ear realm has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0965a14_1"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0965a15_2"
    },
    {
        "source_sentence": "耳界遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the ear realm is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0965a17_0"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0965a17_1"
    },
    {
        "source_sentence": "耳界寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because of the quiescence of the ear realm, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0965a19_2"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0965a20_3"
    },
    {
        "source_sentence": "耳界不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the ear realm is unobtainable, you should know that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0965a21_4"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0965a23_0"
    },
    {
        "source_sentence": "耳界不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the ear realm is inconceivable, you should know that the transcendent ways of wisdom are also inconceivable.",
        "source": "T05n0220_179:0965a24_1"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0965a25_2"
    },
    {
        "source_sentence": "耳界無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because the ear realm has no perceptual consciousness, you should know that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0965a27_3"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the sound realm and even the sensations that arise from ear contact as a condition have no perception, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0965a28_4"
    },
    {
        "source_sentence": "耳界勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the power of the ear realm is not accomplished, it should be known that the power of the perfection of wisdom is also not accomplished.",
        "source": "T05n0220_179:0965b01_5"
    },
    {
        "source_sentence": "聲界乃至耳觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of the sound realm and even the sensations that arise from ear contact as a condition don't accomplish it, you should know that the power of the prajñāpāramitā doesn't accomplish it either.",
        "source": "T05n0220_179:0965b02_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0965b04_7"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0965b04_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0965b06_0"
    },
    {
        "source_sentence": "鼻界無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the nasal realm has no arising, you should know that the transcendent wisdom of liberation also has no arising.",
        "source": "T05n0220_179:0965b06_1"
    },
    {
        "source_sentence": "香界、鼻識界及鼻觸、鼻觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the sense element of fragrance, the sense element of nose consciousness, and the sensations that arise from nose contact and nose contact as a condition are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0965b07_2"
    },
    {
        "source_sentence": "鼻界無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because the nasal realm has no cessation, it should be known that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0965b08_3"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition don't cease, you should know that the prajñāpāramitā also doesn't cease.",
        "source": "T05n0220_179:0965b09_4"
    },
    {
        "source_sentence": "鼻界無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the nasal realm has no self-nature, you should know that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0965b11_5"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0965b12_6"
    },
    {
        "source_sentence": "鼻界無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the nasal realm has no existence, you should know that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0965b14_7"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition have no existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0965b15_8"
    },
    {
        "source_sentence": "鼻界空故，當知般若波羅蜜多亦空；",
        "translation": "Because the nasal realm is empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0965b16_9"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0965b17_10"
    },
    {
        "source_sentence": "鼻界無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the nasal realm has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0965b19_11"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition have no marks, you should know that the prajñāpāramitā has no marks either.",
        "source": "T05n0220_179:0965b20_0"
    },
    {
        "source_sentence": "鼻界無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the nasal realm has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0965b21_1"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0965b22_2"
    },
    {
        "source_sentence": "鼻界遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the nasal realm is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0965b24_0"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0965b24_1"
    },
    {
        "source_sentence": "鼻界寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because of the quiescence of the nasal realm, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0965b26_2"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0965b27_3"
    },
    {
        "source_sentence": "鼻界不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the nasal realm is unobtainable, you should know that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0965b28_4"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0965c01_0"
    },
    {
        "source_sentence": "鼻界不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the nasal realm is inconceivable, you should know that the transcendent ways of wisdom are also inconceivable.",
        "source": "T05n0220_179:0965c02_1"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0965c03_2"
    },
    {
        "source_sentence": "鼻界無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because the nasal realm has no perceptual consciousness, you should know that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0965c05_3"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the sense element of fragrance and even the sensations that arise from nose contact as a condition have no perception, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0965c06_4"
    },
    {
        "source_sentence": "鼻界勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the momentum of the nasal realm is not accomplished, it should be known that the momentum of the perfection of wisdom is also not accomplished.",
        "source": "T05n0220_179:0965c08_5"
    },
    {
        "source_sentence": "香界乃至鼻觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the momentum of the sensations that arise from the sense element of fragrance and even the sensations that arise from nose contact as a condition aren't accomplished, you should know that the momentum of the prajñāpāramitā is also not accomplished.",
        "source": "T05n0220_179:0965c09_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0965c11_7"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0965c11_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0965c13_0"
    },
    {
        "source_sentence": "舌界無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the realm of tongue is without birth, you should know that the transcendent wisdom-pāramitā is also without birth.",
        "source": "T05n0220_179:0965c13_1"
    },
    {
        "source_sentence": "味界、舌識界及舌觸、舌觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0965c14_2"
    },
    {
        "source_sentence": "舌界無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because there is no destruction of the element tongue, it should be known that also the perfection of wisdom has no destruction.",
        "source": "T05n0220_179:0965c15_3"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because there's no cessation of sensations that arise from the taste realm and even sensations that arise from tongue contact as a condition, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T05n0220_179:0965c16_4"
    },
    {
        "source_sentence": "舌界無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the element tongue has no self-nature, it should be known that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0965c18_5"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0965c19_6"
    },
    {
        "source_sentence": "舌界無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the realm of tongue has no existence, it should be known that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0965c21_7"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition have no existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0965c22_8"
    },
    {
        "source_sentence": "舌界空故，當知般若波羅蜜多亦空；",
        "translation": "Because the realm of tongue is empty, it should be known that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0965c23_9"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0965c24_10"
    },
    {
        "source_sentence": "舌界無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the tongue realm has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0965c26_11"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition are without marks, you should know that the prajñāpāramitā has no marks either.",
        "source": "T05n0220_179:0965c27_0"
    },
    {
        "source_sentence": "舌界無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the realm of tongue has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0965c28_1"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0965c29_2"
    },
    {
        "source_sentence": "舌界遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the realm of tongue is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0966a02_0"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0966a02_1"
    },
    {
        "source_sentence": "舌界寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because of the quiescence of the tongue realm, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0966a04_2"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0966a05_3"
    },
    {
        "source_sentence": "舌界不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the realm of tongue is unobtainable, it should be known that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0966a06_4"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0966a08_0"
    },
    {
        "source_sentence": "舌界不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the tongue realm is inconceivable, you should know that the transcendent wisdom of liberation is also inconceivable.",
        "source": "T05n0220_179:0966a09_1"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0966a10_2"
    },
    {
        "source_sentence": "舌界無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because the realm of tongue has no perceptual consciousness, it should be known that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0966a12_3"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the taste realm and even the sensations that arise from tongue contact as a condition have no perception, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0966a13_4"
    },
    {
        "source_sentence": "舌界勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the power of the tongue realm is not accomplished, it should be known that the power of the perfection of wisdom is also not accomplished.",
        "source": "T05n0220_179:0966a15_5"
    },
    {
        "source_sentence": "味界乃至舌觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of the taste realm and even the sensations that arise from tongue contact as a condition are not accomplished, you should know that the power of the prajñāpāramitā is also not accomplished.",
        "source": "T05n0220_179:0966a16_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0966a18_7"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0966a18_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0966a20_0"
    },
    {
        "source_sentence": "身界無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the body realm has no birth, it should be known that the perfection of wisdom also has no birth.",
        "source": "T05n0220_179:0966a20_1"
    },
    {
        "source_sentence": "觸界、身識界及身觸、身觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the element of touch, the element of body consciousness, and the sensations that arise from body contact and body contact as a condition are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0966a21_2"
    },
    {
        "source_sentence": "身界無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because the body realm has no cessation, it should be known that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0966a22_3"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition have no cessation, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T05n0220_179:0966a23_4"
    },
    {
        "source_sentence": "身界無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the body realm has no self-nature, it should be known that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0966a25_5"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0966a26_6"
    },
    {
        "source_sentence": "身界無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the body realm has no existence, it should be known that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0966a28_7"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition have no existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0966a29_8"
    },
    {
        "source_sentence": "身界空故，當知般若波羅蜜多亦空；",
        "translation": "Because the body realm is empty, you should know that the transcendent wisdom of liberation is also empty.",
        "source": "T05n0220_179:0966b01_9"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0966b02_10"
    },
    {
        "source_sentence": "身界無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the body realm has no marks, it should be known that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0966b04_11"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition have no marks, you should know that the prajñāpāramitā also has no marks.",
        "source": "T05n0220_179:0966b05_0"
    },
    {
        "source_sentence": "身界無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the body realm has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0966b06_1"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0966b07_2"
    },
    {
        "source_sentence": "身界遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the body realm is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0966b08_3"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0966b09_4"
    },
    {
        "source_sentence": "身界寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because of the quiescence of the body realm, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0966b11_5"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0966b12_6"
    },
    {
        "source_sentence": "身界不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the body realm is unobtainable, you should know that the transcendent wisdom of liberation is also unobtainable.",
        "source": "T05n0220_179:0966b13_7"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0966b14_8"
    },
    {
        "source_sentence": "身界不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the body realm is inconceivable, you should know that the transcendent wisdom of liberation is also inconceivable.",
        "source": "T05n0220_179:0966b16_9"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0966b17_10"
    },
    {
        "source_sentence": "身界無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because the body realm has no perceptual consciousness, you should know that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0966b19_11"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the sense element of touch and even the sensations that arise from bodily contact as a condition have no perception, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0966b20_12"
    },
    {
        "source_sentence": "身界勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the momentum of the body realm is not accomplished, it should be known that the momentum of the perfection of wisdom is also not accomplished.",
        "source": "T05n0220_179:0966b22_13"
    },
    {
        "source_sentence": "觸界乃至身觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the momentum of the sensations that arise from the sense element of touch and even the sensations that arise from bodily contact as a condition aren't accomplished, you should know that the momentum of the prajñāpāramitā is also not accomplished.",
        "source": "T05n0220_179:0966b23_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0966b25_15"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0966b25_16"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0966b27_0"
    },
    {
        "source_sentence": "意界無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the mental realm is without birth, it should be known that the perfection of wisdom also has no birth.",
        "source": "T05n0220_179:0966b27_1"
    },
    {
        "source_sentence": "法界、意識界及意觸、意觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0966b28_2"
    },
    {
        "source_sentence": "意界無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because the mental realm has no cessation, it should be known that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0966b29_3"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because there's no cessation of the Dharma realm or even the sensations that arise from mental contact as a condition, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T05n0220_179:0966c01_4"
    },
    {
        "source_sentence": "意界無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the mental realm has no self-nature, it should be known that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0966c03_5"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0966c04_6"
    },
    {
        "source_sentence": "意界無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the mental realm has no existence, it should be known that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0966c06_7"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition have no existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0966c07_8"
    },
    {
        "source_sentence": "意界空故，當知般若波羅蜜多亦空；",
        "translation": "Because the mental realm is empty, you should know that the transcendent wisdom-pāramitā is also empty.",
        "source": "T05n0220_179:0966c08_9"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0966c09_10"
    },
    {
        "source_sentence": "意界無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the mental realm has no marks, it should be known that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0966c11_11"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition have no marks, you should know that the prajñāpāramitā also has no marks.",
        "source": "T05n0220_179:0966c12_0"
    },
    {
        "source_sentence": "意界無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the mental realm has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0966c13_1"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0966c14_2"
    },
    {
        "source_sentence": "意界遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the realm of thought is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0966c16_0"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0966c16_1"
    },
    {
        "source_sentence": "意界寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because the mental realm is quiescent, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0966c18_2"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0966c19_3"
    },
    {
        "source_sentence": "意界不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the mental realm is unobtainable, it should be known that the perfection of wisdom is also unobtainable.",
        "source": "T05n0220_179:0966c20_4"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0966c22_0"
    },
    {
        "source_sentence": "意界不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the mental realm is inconceivable, you should know that the transcendent ways are also inconceivable.",
        "source": "T05n0220_179:0966c23_1"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0966c24_2"
    },
    {
        "source_sentence": "意界無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because the mental realm has no perceptual consciousness, you should know that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0966c26_3"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the Dharma realm and even the sensations that arise from mental contact as a condition have no perception, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0966c27_4"
    },
    {
        "source_sentence": "意界勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the momentum of the mental realm is not accomplished, it should be known that the momentum of the perfection of wisdom is also not accomplished.",
        "source": "T05n0220_179:0966c29_5"
    },
    {
        "source_sentence": "法界乃至意觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of the Dharma realm and even the sensations that arise from mental contact as a condition don't accomplish it, you should know that the power of the prajñāpāramitā doesn't accomplish it either.",
        "source": "T05n0220_179:0967a01_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0967a03_7"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0967a03_8"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0967a05_0"
    },
    {
        "source_sentence": "地界無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because the earth realm has no birth, it should be known that the perfection of wisdom also has no birth.",
        "source": "T05n0220_179:0967a05_1"
    },
    {
        "source_sentence": "水、火、風、空、識界無生故，當知般若波羅蜜多亦無生。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm are unarisen, you should know that the prajñāpāramitā is also unarisen.",
        "source": "T05n0220_179:0967a06_2"
    },
    {
        "source_sentence": "地界無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because the earth realm has no cessation, you should know that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0967a07_3"
    },
    {
        "source_sentence": "水、火、風、空、識界無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm have no cessation, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T05n0220_179:0967a08_4"
    },
    {
        "source_sentence": "地界無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because the earth realm has no self-nature, you should know that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0967a09_5"
    },
    {
        "source_sentence": "水、火、風、空、識界無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0967a10_6"
    },
    {
        "source_sentence": "地界無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because the earth realm has no existence, you should know that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0967a11_7"
    },
    {
        "source_sentence": "水、火、風、空、識界無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm lack existence, you should know that the prajñāpāramitā also lack existence.",
        "source": "T05n0220_179:0967a12_8"
    },
    {
        "source_sentence": "地界空故，當知般若波羅蜜多亦空；",
        "translation": "Because the earth realm is empty, you should know that the transcendent wisdom of liberation is also empty.",
        "source": "T05n0220_179:0967a14_9"
    },
    {
        "source_sentence": "水、火、風、空、識界空故，當知般若波羅蜜多亦空。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0967a15_0"
    },
    {
        "source_sentence": "地界無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because the earth realm has no marks, you should know that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0967a16_1"
    },
    {
        "source_sentence": "水、火、風、空、識界無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm have no marks, you should know that the prajñāpāramitā has no marks either.",
        "source": "T05n0220_179:0967a17_0"
    },
    {
        "source_sentence": "地界無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because the earth realm has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0967a18_1"
    },
    {
        "source_sentence": "水、火、風、空、識界無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm have no wishes, you should know that the prajñāpāramitā also has no wishes.",
        "source": "T05n0220_179:0967a19_2"
    },
    {
        "source_sentence": "地界遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because the earth realm is remote, it should be known that the perfection of wisdom is also remote.",
        "source": "T05n0220_179:0967a20_3"
    },
    {
        "source_sentence": "水、火、風、空、識界遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because the water, fire, wind, air, space, and consciousness realms are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0967a21_4"
    },
    {
        "source_sentence": "地界寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because of the quiescence of the earth realm, it should be known that the perfection of wisdom is also quiescent.",
        "source": "T05n0220_179:0967a22_5"
    },
    {
        "source_sentence": "水、火、風、空、識界寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the water, fire, wind, air, space, and consciousness realms are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0967a23_6"
    },
    {
        "source_sentence": "地界不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because the earth realm is unobtainable, you should know that the transcendent wisdom of liberation is also unobtainable.",
        "source": "T05n0220_179:0967a24_7"
    },
    {
        "source_sentence": "水、火、風、空、識界不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0967a25_8"
    },
    {
        "source_sentence": "地界不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because the earth realm is inconceivable, you should know that the transcendent wisdom of liberation is also inconceivable.",
        "source": "T05n0220_179:0967a26_9"
    },
    {
        "source_sentence": "水、火、風、空、識界不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because water, fire, wind, air, space, and the consciousness realm are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0967a28_10"
    },
    {
        "source_sentence": "地界無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because the earth realm has no perceptual consciousness, you should know that the perfection of wisdom also has no perceptual consciousness.",
        "source": "T05n0220_179:0967a29_11"
    },
    {
        "source_sentence": "水、火、風、空、識界無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because the water, fire, wind, air, space, and consciousness realms lack perception, you should know that the prajñāpāramitā also lacks perception.",
        "source": "T05n0220_179:0967b01_12"
    },
    {
        "source_sentence": "地界勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the momentum of the earth realm is not accomplished, it should be known that the momentum of the transfiguration of wisdom also is not accomplished.",
        "source": "T05n0220_179:0967b02_13"
    },
    {
        "source_sentence": "水、火、風、空、識界勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of water, fire, wind, air, space, and the consciousness realm won't be accomplished, you should know that the power of the prajñāpāramitā won't be accomplished either.",
        "source": "T05n0220_179:0967b04_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0967b05_15"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0967b05_16"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T05n0220_179:0967b08_0"
    },
    {
        "source_sentence": "無明無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because nescience has no birth, it should be known that the perfection of wisdom also has no birth.",
        "source": "T05n0220_179:0967b08_1"
    },
    {
        "source_sentence": "行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱無生故，",
        "translation": "It's because form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, grief, and vexation don't arise.",
        "source": "T05n0220_179:0967b09_2"
    },
    {
        "source_sentence": "當知般若波羅蜜多亦無生。",
        "translation": "You should know that the prajñāpāramitā also has no birth.",
        "source": "T05n0220_179:0967b10_3"
    },
    {
        "source_sentence": "無明無滅故，當知般若波羅蜜多亦無滅；",
        "translation": "Because nescience has no cessation, it should be known that the perfection of wisdom also has no cessation.",
        "source": "T05n0220_179:0967b11_4"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱無滅故，當知般若波羅蜜多亦無滅。",
        "translation": "Because there's no cessation of practice or even old age, grief, sorrow, pain, and vexation, you should know that the prajñāpāramitā also has no cessation.",
        "source": "T05n0220_179:0967b12_5"
    },
    {
        "source_sentence": "無明無自性故，當知般若波羅蜜多亦無自性；",
        "translation": "Because nescience has no self-nature, it should be known that the perfection of wisdom also has no self-nature.",
        "source": "T05n0220_179:0967b13_6"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱無自性故，當知般若波羅蜜多亦無自性。",
        "translation": "Because practice and even old age, sorrow, pain, and vexation have no self-nature, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T05n0220_179:0967b14_7"
    },
    {
        "source_sentence": "無明無所有故，當知般若波羅蜜多亦無所有；",
        "translation": "Because nescience has no existence, it should be known that the perfection of wisdom also has no existence.",
        "source": "T05n0220_179:0967b16_8"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱無所有故，當知般若波羅蜜多亦無所有。",
        "translation": "Because practice and even old age, sorrow, pain, and vexation have no existence, you should know that the prajñāpāramitā also has no existence.",
        "source": "T05n0220_179:0967b17_9"
    },
    {
        "source_sentence": "無明空故，當知般若波羅蜜多亦空；",
        "translation": "Because nescience is emptiness, you should know that the transcendent wisdom of liberation is also emptiness.",
        "source": "T05n0220_179:0967b18_10"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱空故，當知般若波羅蜜多亦空。",
        "translation": "Because practice and even old age, grief, sorrow, pain, and vexation are empty, you should know that the prajñāpāramitā is also empty.",
        "source": "T05n0220_179:0967b19_11"
    },
    {
        "source_sentence": "無明無相故，當知般若波羅蜜多亦無相；",
        "translation": "Because nescience has no marks, it should be known that the perfection of wisdom also has no marks.",
        "source": "T05n0220_179:0967b20_12"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱無相故，當知般若波羅蜜多亦無相。",
        "translation": "Because practice and even old age, sorrow, pain, grief, and vexation have no marks, you should know that the prajñāpāramitā has no marks either.",
        "source": "T05n0220_179:0967b21_13"
    },
    {
        "source_sentence": "無明無願故，當知般若波羅蜜多亦無願；",
        "translation": "Because nescience has no wishes, it should be known that the perfection of wisdom also has no wishes.",
        "source": "T05n0220_179:0967b23_14"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱無願故，當知般若波羅蜜多亦無願。",
        "translation": "Because there's no wish for practice or even old age, sorrow, pain, and vexation, you should know that the prajñāpāramitā also has no wish.",
        "source": "T05n0220_179:0967b24_15"
    },
    {
        "source_sentence": "無明遠離故，當知般若波羅蜜多亦遠離；",
        "translation": "Because ignorance is far removed, it should be known that the perfection of wisdom is also far removed.",
        "source": "T05n0220_179:0967b25_16"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱遠離故，當知般若波羅蜜多亦遠離。",
        "translation": "Because practice and even old age, sorrow, pain, and vexation are far removed, you should know that the prajñāpāramitā is also far removed.",
        "source": "T05n0220_179:0967b26_17"
    },
    {
        "source_sentence": "無明寂靜故，當知般若波羅蜜多亦寂靜；",
        "translation": "Because nescience is quiescent, it should be known that the transcendent ways are also quiescent.",
        "source": "T05n0220_179:0967b27_18"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱寂靜故，當知般若波羅蜜多亦寂靜。",
        "translation": "Because the practice and even old age, sorrow, pain, grief, and vexation are quiescent, you should know that the prajñāpāramitā is also quiescent.",
        "source": "T05n0220_179:0967b28_19"
    },
    {
        "source_sentence": "無明不可得故，當知般若波羅蜜多亦不可得；",
        "translation": "Because nescience is ungraspable, you should know that the transcendent wisdom of liberation is also ungraspable.",
        "source": "T05n0220_179:0967c01_20"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱不可得故，當知般若波羅蜜多亦不可得。",
        "translation": "Because practice and even old age, sorrow, pain, and vexation are unobtainable, you should know that the prajñāpāramitā is also unobtainable.",
        "source": "T05n0220_179:0967c02_21"
    },
    {
        "source_sentence": "無明不可思議故，當知般若波羅蜜多亦不可思議；",
        "translation": "Because ignorance is inconceivable, you should know that the transcendent ways of wisdom are also inconceivable.",
        "source": "T05n0220_179:0967c03_22"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱不可思議故，當知般若波羅蜜多亦不可思議。",
        "translation": "Because practice and even old age, sorrow, pain, and vexation are inconceivable, you should know that the prajñāpāramitā is also inconceivable.",
        "source": "T05n0220_179:0967c04_23"
    },
    {
        "source_sentence": "無明無覺知故，當知般若波羅蜜多亦無覺知；",
        "translation": "Because nescience has no perception, it should be known that the perfection of wisdom also has no perception.",
        "source": "T05n0220_179:0967c06_24"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱無覺知故，當知般若波羅蜜多亦無覺知。",
        "translation": "Because there's no perception of practice or even old age, sorrow, pain, and vexation, you should know that the prajñāpāramitā also has no perception.",
        "source": "T05n0220_179:0967c07_25"
    },
    {
        "source_sentence": "無明勢力不成就故，當知般若波羅蜜多勢力亦不成就；",
        "translation": "Because the power of nescience has not been accomplished, you should know that the power of the transcendent wisdom also has not been accomplished.",
        "source": "T05n0220_179:0967c09_26"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
        "translation": "Because the power of practice and even the power of old age, sorrow, pain, and vexation are not accomplished, you should know that the power of the prajñāpāramitā is also not accomplished.",
        "source": "T05n0220_179:0967c10_27"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T05n0220_179:0967c12_28"
    },
    {
        "source_sentence": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
        "translation": "Because of this intention, I therefore explain that the bodhisattva-mahāsattva prajñāpāramitā has many great perfections.",
        "source": "T05n0220_179:0967c12_29"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百七十九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 69",
        "source": "T05n0220_179:0967c14_0"
    }
]