[
    {
        "source_sentence": "大般若波羅蜜多經卷第一百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 4",
        "source": "T05n0220_144:0778b22_0"
    },
    {
        "source_sentence": "十四",
        "translation": "fourteen",
        "source": "T05n0220_144:0778b23_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T05n0220_144:0778b25_0"
    },
    {
        "source_sentence": "初分校量功德品第三十之四十二",
        "translation": "The thirty-second and forty-second parts of the chapter on the merits of the first part of the method of calculation",
        "source": "T05n0220_144:0778b26_0"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0778b27_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說預流向預流果若常若無常，",
        "translation": "If good men and good women give rise to the unsurpassed mind of enlightenment, they say that the fruit of stream-winnership is permanent or impermanent,",
        "source": "T05n0220_144:0778b27_1"
    },
    {
        "source_sentence": "說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若常若無常；",
        "translation": "He teaches that the one-coming leads to the one-coming fruit, the nonreturner leads to the fruit of nonreturning, and arhats lead to the fruit of arhatship, whether permanent or impermanent.",
        "source": "T05n0220_144:0778b28_2"
    },
    {
        "source_sentence": "說預流向預流果若樂若苦，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若樂若苦；",
        "translation": "It is said to be either pleasant or painful when proceeding toward the fruit of stream-entry, or when proceeding toward the fruit of stream-entry. It is said to be either pleasant or painful when proceeding from one [form of] transmigration (parinirmita-vaśavartin’s doctrine) or when proceeding toward the fruit of transmigration (parinir",
        "source": "T05n0220_144:0778c01_3"
    },
    {
        "source_sentence": "說預流向預流果若我若無我，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若我若無我；",
        "translation": "He teaches that the fruit of stream-entry is directed toward the fruit of stream-entry, whether self or without self; he teaches that one coming is directed toward the fruit of one coming, that which does not return is directed toward the fruit of nonreturning, and that what belongs to an arhat is directed toward the fruit of an arhat, whether self or without self",
        "source": "T05n0220_144:0778c03_4"
    },
    {
        "source_sentence": "說預流向預流果若淨若不淨，說一來向一來果、不還向不還果、阿羅漢向阿羅漢果若淨若不淨。",
        "translation": "It's said to be pure or impure whether the fruit of going from pre-flow to pre-flow, and it's said to be pure or impure whether the once-returner goes to the once-returner fruit, the nonreturner goes to the nonreturner fruit, and the arhat goes to the arhat fruit.",
        "source": "T05n0220_144:0778c05_5"
    },
    {
        "source_sentence": "若有能依如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can cultivate pure precepts based on such things, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0778c08_0"
    },
    {
        "source_sentence": "復作是說：行淨戒者，應求預流向預流果若常若無常，應求一來向乃至阿羅漢果若常若無常；",
        "translation": "Again, it is said that practitioners of the clean precepts should seek stream-entry and going to stream-entry. The fruit of stream-entry whether permanent or impermanent, they should seek one-coming dedication up to the fruit of arhatship whether permanent or impermanent.",
        "source": "T05n0220_144:0778c09_1"
    },
    {
        "source_sentence": "應求預流向預流果若樂若苦，應求一來向乃至阿羅漢果若樂若苦；",
        "translation": "They should seek stream-entry and proceed toward the fruit of stream-entry, whether pleasant or painful; they should seek the one-coming path up to the fruit of arhatship, whether pleasant or painful.",
        "source": "T05n0220_144:0778c11_2"
    },
    {
        "source_sentence": "應求預流向預流果若我若無我，應求一來向乃至阿羅漢果若我若無我；",
        "translation": "They should seek stream-entry and proceed toward the fruit of stream-entry, whether self or without self; they should seek the one-coming path up to the fruit of arhatship, whether self or without self.",
        "source": "T05n0220_144:0778c12_3"
    },
    {
        "source_sentence": "應求預流向預流果若淨若不淨，應求一來向乃至阿羅漢果若淨若不淨。",
        "translation": "You should seek the fruit of pre-flow directing toward pre-flow whether pure or impure, and you should seek the fruit of once-returning directing up to the arhat whether pure or impure.",
        "source": "T05n0220_144:0778c14_4"
    },
    {
        "source_sentence": "若有能求如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can seek such things and cultivate pure precepts, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0778c16_5"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0778c17_6"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求預流向預流果若常若無常，求一來向乃至阿羅漢果若常若無常；",
        "translation": "“Good sons and good daughters, if they thus seek the fruit of stream-entry or progressing toward stream-entry, whether permanent or impermanent, and seek the one-coming path up to the fruit of arhatship, whether permanent or impermanent.",
        "source": "T05n0220_144:0778c17_7"
    },
    {
        "source_sentence": "求預流向預流果若樂若苦，求一來向乃至阿羅漢果若樂若苦；",
        "translation": "They seek stream-entry and proceed toward the fruit of stream-entry, whether pleasant or painful; they seek the one-coming path up to the fruit of arhatship, whether pleasant or painful.",
        "source": "T05n0220_144:0778c19_8"
    },
    {
        "source_sentence": "求預流向預流果若我若無我，求一來向乃至阿羅漢果若我若無我；",
        "translation": "They seek stream-entry and proceed toward the fruit of stream-entry, whether self or without self; they seek the one-coming path up to the fruit of arhatship, whether self or without self.",
        "source": "T05n0220_144:0778c21_9"
    },
    {
        "source_sentence": "求預流向預流果若淨若不淨，求一來向乃至阿羅漢果若淨若不淨。",
        "translation": "Seeking pre-flow leads to the fruit of pre-flow, whether pure or impure, and seeking once-returning leads up to the fruit of arhatship, whether pure or impure.",
        "source": "T05n0220_144:0778c23_0"
    },
    {
        "source_sentence": "依此等法行淨戒者，我說名為行有所得相似淨戒波羅蜜多。",
        "translation": "Those who practice pure precepts based on these things are called practicing the perfection of purifying precepts that resemble what's attained, as I say.",
        "source": "T05n0220_144:0778c24_1"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0778c26_0"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似淨戒波羅蜜多。",
        "translation": "As explained above, you should know that they all explain the perfection of morality similar to attaining purity.",
        "source": "T05n0220_144:0778c26_1"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0778c28_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說一切獨覺菩提若常若無常，",
        "translation": "If good men and good women give rise to the mind of unsurpassed enlightenment, they teach that all solitary realizers’ enlightenment is permanent or impermanent,",
        "source": "T05n0220_144:0778c28_1"
    },
    {
        "source_sentence": "說一切獨覺菩提若樂若苦，說一切獨覺菩提若我若無我，說一切獨覺菩提若淨若不淨。",
        "translation": "He teaches that all solitary realizers' enlightenment is pleasant or painful, that all solitary realizers' enlightenment is self or selfless, and that all solitary realizers' enlightenment is pure or impure.",
        "source": "T05n0220_144:0778c29_2"
    },
    {
        "source_sentence": "若有能依如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can cultivate pure precepts based on such things, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0779a03_0"
    },
    {
        "source_sentence": "復作是說：行淨戒者，應求一切獨覺菩提若常若無常，應求一切獨覺菩提若樂若苦，",
        "translation": "Again, it's said that someone who practices pure morality should seek the enlightenment of all solitary realizers whether permanent or impermanent, and they should seek the enlightenment of all solitary realizers whether pleasant or painful.",
        "source": "T05n0220_144:0779a04_1"
    },
    {
        "source_sentence": "應求一切獨覺菩提若我若無我，應求一切獨覺菩提若淨若不淨。",
        "translation": "You should seek the enlightenment of all solitary realizers whether self or selfless, and you should seek the enlightenment of all solitary realizers whether pure or impure.",
        "source": "T05n0220_144:0779a06_2"
    },
    {
        "source_sentence": "若有能求如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can seek such things and cultivate pure precepts, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0779a07_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779a08_4"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求一切獨覺菩提若常若無常，求一切獨覺菩提若樂若苦，",
        "translation": "If good men and good women thus seek the enlightenment of all solitary realizers whether permanent or impermanent, and seek the enlightenment of all solitary realizers whether pleasant or painful,",
        "source": "T05n0220_144:0779a09_0"
    },
    {
        "source_sentence": "求一切獨覺菩提若我若無我，求一切獨覺菩提若淨若不淨。",
        "translation": "They seek the enlightenment of all solitary realizers whether self or selfless, and they seek the enlightenment of all solitary realizers whether pure or impure.",
        "source": "T05n0220_144:0779a10_1"
    },
    {
        "source_sentence": "依此等法行淨戒者，我說名為行有所得相似淨戒波羅蜜多。",
        "translation": "Those who practice pure precepts based on these things are called practicing the perfection of purifying precepts that resemble what's attained, as I say.",
        "source": "T05n0220_144:0779a12_2"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779a13_3"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似淨戒波羅蜜多。",
        "translation": "As explained above, you should know that they all explain the perfection of morality similar to attaining purity.",
        "source": "T05n0220_144:0779a13_4"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0779a16_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說一切菩薩摩訶薩行若常若無常，",
        "translation": "If good men and good women give rise to the supreme determination for enlightenment, they explain that all bodhisattva-mahāsattva practices are permanent or impermanent,",
        "source": "T05n0220_144:0779a16_1"
    },
    {
        "source_sentence": "說一切菩薩摩訶薩行若樂若苦，說一切菩薩摩訶薩行若我若無我，說一切菩薩摩訶薩行若淨若不淨。",
        "translation": "They say all bodhisattva-mahāsattva practices are pleasant or painful, all bodhisattva-mahāsattva practices are self or selfless, and all bodhisattva-mahāsattva practices are pure or impure.",
        "source": "T05n0220_144:0779a18_2"
    },
    {
        "source_sentence": "若有能依如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can cultivate pure precepts based on such things, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0779a20_3"
    },
    {
        "source_sentence": "復作是說：行淨戒者，應求一切菩薩摩訶薩行若常若無常，應求一切菩薩摩訶薩行若樂若苦，",
        "translation": "Again, he said, Those who practice the pure precepts should seek all the bodhisattva-mahāsattva practices whether permanent or impermanent, and they should seek all the bodhisattva-mahāsattva practices whether pleasant or painful.",
        "source": "T05n0220_144:0779a21_4"
    },
    {
        "source_sentence": "應求一切菩薩摩訶薩行若我若無我，應求一切菩薩摩訶薩行若淨若不淨。",
        "translation": "You should seek all the bodhisattva-mahāsattva practices whether self or selfless, and you should seek all the bodhisattva-mahāsattva practices whether pure or impure.",
        "source": "T05n0220_144:0779a23_5"
    },
    {
        "source_sentence": "若有能求如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can seek such things and cultivate pure precepts, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0779a25_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779a26_7"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求一切菩薩摩訶薩行若常若無常，求一切菩薩摩訶薩行若樂若苦，",
        "translation": "If good men and good women thus seek all the bodhisattva-mahāsattva practices, whether permanent or impermanent, and seek all the bodhisattva-mahāsattva practices, whether pleasant or painful,",
        "source": "T05n0220_144:0779a26_8"
    },
    {
        "source_sentence": "求一切菩薩摩訶薩行若我若無我，求一切菩薩摩訶薩行若淨若不淨。",
        "translation": "They seek all the bodhisattva-mahāsattva practices whether self or selfless, and they seek all the bodhisattva-mahāsattva practices whether pure or impure.",
        "source": "T05n0220_144:0779a29_9"
    },
    {
        "source_sentence": "依此等法行淨戒者，我說名為行有所得相似淨戒波羅蜜多。",
        "translation": "Those who practice pure precepts based on these things are called practicing the perfection of purifying precepts that resemble what's attained, as I say.",
        "source": "T05n0220_144:0779b01_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779b03_11"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似淨戒波羅蜜多。",
        "translation": "As explained above, you should know that they all explain the perfection of morality similar to attaining purity.",
        "source": "T05n0220_144:0779b03_12"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0779b05_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說諸佛無上正等菩提若常若無常，",
        "translation": "If good men and good women give rise to the mind of unsurpassed enlightenment, they say that the buddhas’ unsurpassed perfect enlightenment is permanent or impermanent,",
        "source": "T05n0220_144:0779b05_1"
    },
    {
        "source_sentence": "說諸佛無上正等菩提若樂若苦，說諸佛無上正等菩提若我若無我，說諸佛無上正等菩提若淨若不淨。",
        "translation": "They say that the unsurpassed correct enlightenment of the buddhas is pleasant or painful, that the unsurpassed correct enlightenment of the buddhas is self or selfless, and that the unsurpassed correct enlightenment of the buddhas is pure or impure.",
        "source": "T05n0220_144:0779b07_2"
    },
    {
        "source_sentence": "若有能依如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can cultivate pure precepts based on such things, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0779b09_3"
    },
    {
        "source_sentence": "復作是說：行淨戒者，應求諸佛無上正等菩提若常若無常，應求諸佛無上正等菩提若樂若苦，",
        "translation": "Again, it's said that someone who practices the pure precepts should seek the unsurpassed correct perfect enlightenment of the buddhas whether permanent or impermanent, and they should seek the unsurpassed correct perfect enlightenment of the buddhas whether pleasant or painful.",
        "source": "T05n0220_144:0779b10_4"
    },
    {
        "source_sentence": "應求諸佛無上正等菩提若我若無我，應求諸佛無上正等菩提若淨若不淨。",
        "translation": "You should seek the buddhas' unsurpassed perfect enlightenment whether self or selfless, and you should seek the buddhas' unsurpassed perfect enlightenment whether pure or impure.",
        "source": "T05n0220_144:0779b12_5"
    },
    {
        "source_sentence": "若有能求如是等法修行淨戒，是行淨戒波羅蜜多。",
        "translation": "If someone can seek such things and cultivate pure precepts, this is the perfection of practicing pure precepts.",
        "source": "T05n0220_144:0779b14_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779b15_7"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求諸佛無上正等菩提若常若無常，求諸佛無上正等菩提若樂若苦，",
        "translation": "If good men and good women thus seek the unsurpassed correct perfect enlightenment of the buddhas whether permanent or impermanent, and seek the unsurpassed correct perfect enlightenment of the buddhas whether pleasant or painful,",
        "source": "T05n0220_144:0779b15_8"
    },
    {
        "source_sentence": "求諸佛無上正等菩提若我若無我，求諸佛無上正等菩提若淨若不淨。",
        "translation": "They seek the buddhas' unsurpassed perfect enlightenment whether self or selfless, and they seek the buddhas' unsurpassed perfect enlightenment whether pure or impure.",
        "source": "T05n0220_144:0779b18_9"
    },
    {
        "source_sentence": "依此等法行淨戒者，我說名為行有所得相似淨戒波羅蜜多。",
        "translation": "Those who practice pure precepts based on these things are called practicing the perfection of purifying precepts that resemble what's attained, as I say.",
        "source": "T05n0220_144:0779b19_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779b21_11"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似淨戒波羅蜜多。」",
        "translation": "As explained earlier, you should know that they all explain the perfection of purifying morality similar to what's attained.",
        "source": "T05n0220_144:0779b21_12"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「世尊！",
        "translation": "Śakra then again said to the Buddha, Bhagavān!",
        "source": "T05n0220_144:0779b23_0"
    },
    {
        "source_sentence": "云何諸善男子、善女人等說有所得布施波羅蜜多名說相似布施波羅蜜多？」",
        "translation": "How do good men and good women say that the perfection of generosity that has attained is similar to the perfection of generosity in many ways?",
        "source": "T05n0220_144:0779b23_1"
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, Kauśika!",
        "source": "T05n0220_144:0779b25_2"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說色若常若無常，說受、想、行、識若常若無常；",
        "translation": "Good men and good women, in order to develop the supreme determination for enlightenment, teach that form is permanent or impermanent, and they teach that feeling, perception, volition, and consciousness are permanent or impermanent.",
        "source": "T05n0220_144:0779b25_3"
    },
    {
        "source_sentence": "說色若樂若苦，說受、想、行、識若樂若苦；",
        "translation": "It is said that form is either pleasant or painful. It is said that feeling, conceptual identification, conditioning and consciousness are either pleasant or painful.",
        "source": "T05n0220_144:0779b27_4"
    },
    {
        "source_sentence": "說色若我若無我，說受、想、行、識若我若無我；",
        "translation": "He teaches that form is self or selfless, and he teaches that feeling, perception, volition, and consciousness are self or selfless.",
        "source": "T05n0220_144:0779b28_5"
    },
    {
        "source_sentence": "說色若淨若不淨，說受、想、行、識若淨若不淨。",
        "translation": "It's said that form is pure or impure, and it's said that feeling, perception, volition, and consciousness are pure or impure.",
        "source": "T05n0220_144:0779b29_6"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0779c01_7"
    },
    {
        "source_sentence": "復作是說：行布施者，應求色若常若無常，應求受、想、行、識若常若無常；",
        "translation": "“Furthermore, it is further said: Those who practice giving should seek form whether permanent or impermanent; they should seek feeling, conceptual identification, volition, and consciousness whether permanent or impermanent.",
        "source": "T05n0220_144:0779c02_8"
    },
    {
        "source_sentence": "應求色若樂若苦，應求受、想、行、識若樂若苦；",
        "translation": "You should seek form, whether pleasant or painful; you should seek feeling, perception, conditioning, and consciousness, whether pleasant or painful.",
        "source": "T05n0220_144:0779c04_9"
    },
    {
        "source_sentence": "應求色若我若無我，應求受、想、行、識若我若無我；",
        "translation": "You should seek form whether it is self or selfless; you should seek feeling, perception, conditioning, and consciousness whether they are self or selfless.",
        "source": "T05n0220_144:0779c05_10"
    },
    {
        "source_sentence": "應求色若淨若不淨，應求受、想、行、識若淨若不淨。",
        "translation": "You should seek form whether pure or impure, and you should seek feeling, perception, volition, and consciousness whether pure or impure.",
        "source": "T05n0220_144:0779c06_11"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0779c07_12"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779c08_13"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求色若常若無常，求受、想、行、識若常若無常；",
        "translation": "Good men and good women seek form in this way, whether permanent or impermanent; they seek feeling, perception, volition, and consciousness, whether permanent or impermanent.",
        "source": "T05n0220_144:0779c08_14"
    },
    {
        "source_sentence": "求色若樂若苦，求受、想、行、識若樂若苦；",
        "translation": "They seek form, whether pleasant or painful; they seek feeling, perception, conditioning and consciousness, whether pleasant or painful.",
        "source": "T05n0220_144:0779c10_15"
    },
    {
        "source_sentence": "求色若我若無我，求受、想、行、識若我若無我；",
        "translation": "They seek form whether it is self or no-self; they seek feeling, conceptual identification, conditioning and consciousness as self or selfless.",
        "source": "T05n0220_144:0779c11_16"
    },
    {
        "source_sentence": "求色若淨若不淨，求受、想、行、識若淨若不淨。",
        "translation": "They seek form whether pure or impure, feeling, perception, volition, and consciousness whether pure or impure.",
        "source": "T05n0220_144:0779c12_17"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0779c13_18"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0779c14_19"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0779c14_20"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0779c17_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說眼處若常若無常，說耳、鼻、舌、身、意處若常若無常；",
        "translation": "Good men and good women, in order to develop the supreme determination for awakening enlightenment, explain what is permanent and what is impermanent about the sphere of the eye. They explain what is permanent and what is impermanent about the sphere of the ear, nose, tongue, body, and mind.",
        "source": "T05n0220_144:0779c17_1"
    },
    {
        "source_sentence": "說眼處若樂若苦，說耳、鼻、舌、身、意處若樂若苦；",
        "translation": "It is said that the sense-field of vision is pleasant or painful, and it is said that the sense-fields of ear, nose, tongue, body, and mind are pleasant or painful.",
        "source": "T05n0220_144:0779c19_2"
    },
    {
        "source_sentence": "說眼處若我若無我，說耳、鼻、舌、身、意處若我若無我；",
        "translation": "It is said that the sphere of vision is with self or without self; it is said that the spheres of the ear, nose, tongue, body, and mind are with self or without self.",
        "source": "T05n0220_144:0779c20_3"
    },
    {
        "source_sentence": "說眼處若淨若不淨，說耳、鼻、舌、身、意處若淨若不淨。",
        "translation": "It's said that the sense-field of the eye is pure or impure, and it's said that the sense-fields of the ear, nose, tongue, body, and mind are pure or impure.",
        "source": "T05n0220_144:0779c21_4"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0779c22_5"
    },
    {
        "source_sentence": "復作是說：行布施者，應求眼處若常若無常，應求耳、鼻、舌、身、意處若常若無常；",
        "translation": "“Also, it is further said: Those who practice giving should seek the sense eye as either permanent or impermanent. They should seek the sense ear, nose, tongue, body, and mind as either permanent or impermanent.",
        "source": "T05n0220_144:0779c24_0"
    },
    {
        "source_sentence": "應求眼處若樂若苦，應求耳、鼻、舌、身、意處若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the sense-field of the eye. They should seek what is pleasant and what is painful in the sense-fields of the ear, nose, tongue, body, and mind.",
        "source": "T05n0220_144:0779c25_1"
    },
    {
        "source_sentence": "應求眼處若我若無我，應求耳、鼻、舌、身、意處若我若無我；",
        "translation": "You should seek the sphere of vision, whether it is self or no-self; you should seek the spheres of the ear, nose, tongue, body, and mind, whether they are self or no-self.",
        "source": "T05n0220_144:0779c26_2"
    },
    {
        "source_sentence": "應求眼處若淨若不淨，應求耳、鼻、舌、身、意處若淨若不淨。",
        "translation": "You should seek the sense-field of the eye whether pure or impure, and you should seek the sense-fields of the ear, nose, tongue, body, and mind whether pure or impure.",
        "source": "T05n0220_144:0779c28_3"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0779c29_4"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780a01_5"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求眼處若常若無常，求耳、鼻、舌、身、意處若常若無常；",
        "translation": "Good men and good women, in this way they seek to know whether the sense-field of vision is permanent or impermanent. They also seek to know whether the sense-fields of ear, nose, tongue, body, and mind are permanent or impermanent.",
        "source": "T05n0220_144:0780a01_6"
    },
    {
        "source_sentence": "求眼處若樂若苦，求耳、鼻、舌、身、意處若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in the sense-field of the eye, and they seek what is pleasant and what is painful in the sense-fields of the ear, nose, tongue, body, and mind.",
        "source": "T05n0220_144:0780a03_7"
    },
    {
        "source_sentence": "求眼處若我若無我，求耳、鼻、舌、身、意處若我若無我；",
        "translation": "They seek the sphere of vision, whether it is self or no-self; they seek the spheres of ear, nose, tongue, body, and mind, whether they are self or no-self.",
        "source": "T05n0220_144:0780a04_8"
    },
    {
        "source_sentence": "求眼處若淨若不淨，求耳、鼻、舌、身、意處若淨若不淨。",
        "translation": "They seek the sense-field of the eye whether pure or impure, and they seek the sense-fields of the ear, nose, tongue, body, and mind whether pure or impure.",
        "source": "T05n0220_144:0780a05_9"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0780a07_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780a08_11"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0780a08_12"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0780a10_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說色處若常若無常，說聲、香、味、觸、法處若常若無常；",
        "translation": "“Good sons and good daughters, in order to give rise to the supreme determination for awakening enlightenment, they teach whether the form realm is permanent or impermanent. They teach whether the sound, odor, taste, touch, and doctrine realms are permanent or impermanent.",
        "source": "T05n0220_144:0780a10_1"
    },
    {
        "source_sentence": "說色處若樂若苦，說聲、香、味、觸、法處若樂若苦；",
        "translation": "It is said that the sphere of matter is pleasant or painful; it is said that the sphere of sound, odor, taste, touch and factors are pleasant or painful.",
        "source": "T05n0220_144:0780a12_2"
    },
    {
        "source_sentence": "說色處若我若無我，說聲、香、味、觸、法處若我若無我；",
        "translation": "It is said that the sphere of matter is with self or without self; it is said that the spheres of sound, smell, taste, touch and dharma are with self or without self.",
        "source": "T05n0220_144:0780a13_3"
    },
    {
        "source_sentence": "說色處若淨若不淨，說聲、香、味、觸、法處若淨若不淨。",
        "translation": "It's said whether the form realm is pure or impure, and it's said whether the sound, smell, taste, touch, and dharma realms are pure or impure.",
        "source": "T05n0220_144:0780a14_4"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0780a15_5"
    },
    {
        "source_sentence": "復作是說：行布施者，應求色處若常若無常，應求聲、香、味、觸、法處若常若無常；",
        "translation": "“Furthermore, it is further said: Those who practice giving should seek form as either permanent or impermanent; they should seek sound, odor, taste, touch and the factor sense-field as either permanent or impermanent.",
        "source": "T05n0220_144:0780a17_0"
    },
    {
        "source_sentence": "應求色處若樂若苦，應求聲、香、味、觸、法處若樂若苦；",
        "translation": "They should seek form, whether pleasant or painful; they should seek sound, odor, taste, touch, and phenomena, whether pleasant or painful.",
        "source": "T05n0220_144:0780a18_1"
    },
    {
        "source_sentence": "應求色處若我若無我，應求聲、香、味、觸、法處若我若無我；",
        "translation": "You should seek form whether it is self or selfless; you should seek sound, odor, taste, touch, and dharmas as self or selfless.",
        "source": "T05n0220_144:0780a19_2"
    },
    {
        "source_sentence": "應求色處若淨若不淨，應求聲、香、味、觸、法處若淨若不淨。",
        "translation": "You should seek whether the form realm is pure or impure, and you should seek whether the sound, odor, taste, touch, and dharma realms are pure or impure.",
        "source": "T05n0220_144:0780a21_3"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0780a22_4"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780a23_5"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求色處若常若無常，求聲、香、味、觸、法處若常若無常；",
        "translation": "“Good sons and good daughters, in this way they seek the form realm to be permanent or impermanent. They seek the sound, odor, taste, touch, and dharmas realms to be permanent or impermanent.",
        "source": "T05n0220_144:0780a23_6"
    },
    {
        "source_sentence": "求色處若樂若苦，求聲、香、味、觸、法處若樂若苦；",
        "translation": "They seek form, whether pleasant or painful; they seek sound, odor, taste, touch and phenomena, whether pleasant or painful.",
        "source": "T05n0220_144:0780a25_7"
    },
    {
        "source_sentence": "求色處若我若無我，求聲、香、味、觸、法處若我若無我；",
        "translation": "They seek form, whether it is self or selfless; sound, odor, taste, touch, and dharmas, whether they are self or selfless.",
        "source": "T05n0220_144:0780a26_8"
    },
    {
        "source_sentence": "求色處若淨若不淨，求聲、香、味、觸、法處若淨若不淨。",
        "translation": "They seek the form realm as pure or impure, and they seek the sound, smell, taste, touch, and dharma realms as pure or impure.",
        "source": "T05n0220_144:0780a27_9"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0780a29_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780b01_11"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0780b01_12"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0780b03_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說眼界若常若無常，說色界、眼識界及眼觸、眼觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in order to develop the supreme determination for enlightenment, they teach whether the eye realm is permanent or impermanent. They teach whether the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as supporting conditions are permanent or impermanent.",
        "source": "T05n0220_144:0780b03_1"
    },
    {
        "source_sentence": "說眼界若樂若苦，說色界、眼識界及眼觸、眼觸為緣所生諸受若樂若苦；",
        "translation": "It is said that the element matter of form and the element consciousness of the eye are either pleasant or painful. It is said that they are either pleasant or painful.",
        "source": "T05n0220_144:0780b06_0"
    },
    {
        "source_sentence": "說眼界若我若無我，說色界、眼識界及眼觸、眼觸為緣所生諸受若我若無我；",
        "translation": "It is said that the element matter of form, the element consciousness of the eye and the sensations that arise from eye contact and eye contact as supporting object are either self or selfless.",
        "source": "T05n0220_144:0780b07_1"
    },
    {
        "source_sentence": "說眼界若淨若不淨，說色界、眼識界及眼觸、眼觸為緣所生諸受若淨若不淨。",
        "translation": "It's said whether the eye realm is pure or impure, and it's said whether the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are pure or impure.",
        "source": "T05n0220_144:0780b09_2"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0780b11_3"
    },
    {
        "source_sentence": "復作是說：行布施者，應求眼界若常若無常，應求色界乃至眼觸為緣所生諸受若常若無常；",
        "translation": "They further make this statement: Those who practice giving should seek what is permanent and what is impermanent in the eye realm. They should seek what is permanent and what is impermanent in the form realm, up to what is impermanent in all sensations that arise from visual contact as supporting object.",
        "source": "T05n0220_144:0780b12_4"
    },
    {
        "source_sentence": "應求眼界若樂若苦，應求色界乃至眼觸為緣所生諸受若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the sense eye. They should seek what is pleasant and what is painful in the realm of form, up to what is pleasant and what is painful in the sensations that arise from visual contact as supporting object.",
        "source": "T05n0220_144:0780b14_5"
    },
    {
        "source_sentence": "應求眼界若我若無我，應求色界乃至眼觸為緣所生諸受若我若無我；",
        "translation": "They should seek whether the element eye is self or selfless; they should seek if the element matter, up to sensations that arise from visual contact as supporting object are self or selfless.",
        "source": "T05n0220_144:0780b15_6"
    },
    {
        "source_sentence": "應求眼界若淨若不淨，應求色界乃至眼觸為緣所生諸受若淨若不淨。",
        "translation": "You should seek whether the eye realm is pure or impure, and you should seek whether the form realm or even the sensations that arise from eye contact as a condition are pure or impure.",
        "source": "T05n0220_144:0780b17_7"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0780b19_8"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780b20_9"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求眼界若常若無常，求色界乃至眼觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in this way they seek to know whether the eye realm is permanent or impermanent. They seek to know whether the form realm is permanent or impermanent, as well as what sensations that arise from visual contact as supporting object are permanent or impermanent.",
        "source": "T05n0220_144:0780b20_10"
    },
    {
        "source_sentence": "求眼界若樂若苦，求色界乃至眼觸為緣所生諸受若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in the realm of vision. They seek what is pleasant and what is painful in the realm of form, up to what is pleasant and what is painful in the sensations that arise from visual contact as supporting object.",
        "source": "T05n0220_144:0780b22_11"
    },
    {
        "source_sentence": "求眼界若我若無我，求色界乃至眼觸為緣所生諸受若我若無我；",
        "translation": "They seek to see whether the element of vision is self or selfless, and they seek to see whether the elements of form are self or selfless in all sensations that arise by means of visual contact.",
        "source": "T05n0220_144:0780b24_12"
    },
    {
        "source_sentence": "求眼界若淨若不淨，求色界乃至眼觸為緣所生諸受若淨若不淨。",
        "translation": "They seek whether the eye realm is pure or impure, and they seek whether the form realm or even the sensations that arise from eye contact as a condition are pure or impure.",
        "source": "T05n0220_144:0780b25_13"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0780b27_14"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780b28_15"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0780b28_16"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0780c01_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說耳界若常若無常，說聲界、耳識界及耳觸、耳觸為緣所生諸受若常若無常；",
        "translation": "Good men and good women, in order to develop the supreme determination for awakening enlightenment, they teach whether the ear realm is permanent or impermanent. They teach whether the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as supporting conditions are permanent or impermanent.",
        "source": "T05n0220_144:0780c01_1"
    },
    {
        "source_sentence": "說耳界若樂若苦，說聲界、耳識界及耳觸、耳觸為緣所生諸受若樂若苦；",
        "translation": "It is said that the ear element is either pleasant or painful, and it is said that the sound element, the ear consciousness element and the sensations arising from ear contact and ear contact as supporting object are either pleasant or painful.",
        "source": "T05n0220_144:0780c04_0"
    },
    {
        "source_sentence": "說耳界若我若無我，說聲界、耳識界及耳觸、耳觸為緣所生諸受若我若無我；",
        "translation": "It is said that the element of sound, the element of consciousness of the ear and the sensations that arise from ear contact and ear contact as supporting object are either self or selfless.",
        "source": "T05n0220_144:0780c05_1"
    },
    {
        "source_sentence": "說耳界若淨若不淨，說聲界、耳識界及耳觸、耳觸為緣所生諸受若淨若不淨。",
        "translation": "It's said whether the ear realm is pure or impure, and it's said whether the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as a condition are pure or impure.",
        "source": "T05n0220_144:0780c07_2"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0780c09_3"
    },
    {
        "source_sentence": "復作是說：行布施者，應求耳界若常若無常，應求聲界乃至耳觸為緣所生諸受若常若無常；",
        "translation": "They further make the following statement: Those who practice giving should seek whether the element ear is permanent or impermanent, and they should seek whether the sound element or even the sensations that arise from ear contact as supporting object are permanent or impermanent.",
        "source": "T05n0220_144:0780c10_4"
    },
    {
        "source_sentence": "應求耳界若樂若苦，應求聲界乃至耳觸為緣所生諸受若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the ear realm. They should seek what is pleasant and what is painful in the sound realm, up to what is pleasant and what is painful in the sensations that arise from ear contact as supporting object.",
        "source": "T05n0220_144:0780c12_5"
    },
    {
        "source_sentence": "應求耳界若我若無我，應求聲界乃至耳觸為緣所生諸受若我若無我；",
        "translation": "They should seek out the sense element ear as self or selfless, and they should seek out the sense element sound as self or selfless in all sensations that arise from ear contact as supporting object.",
        "source": "T05n0220_144:0780c13_6"
    },
    {
        "source_sentence": "應求耳界若淨若不淨，應求聲界乃至耳觸為緣所生諸受若淨若不淨。",
        "translation": "You should seek whether the ear realm is pure or impure, and you should seek whether the sound realm or even the sensations that arise from ear contact as a condition are pure or impure.",
        "source": "T05n0220_144:0780c15_7"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0780c17_8"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780c18_9"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求耳界若常若無常，求聲界乃至耳觸為緣所生諸受若常若無常；",
        "translation": "Good men and good women seek the ear realm in this way: whether it is permanent or impermanent; they seek the sound realm, up to all sensations that arise from ear contact as supporting object, whether permanent or impermanent.",
        "source": "T05n0220_144:0780c18_10"
    },
    {
        "source_sentence": "求耳界若樂若苦，求聲界乃至耳觸為緣所生諸受若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in the ear realm, and they seek what is pleasant and what is painful in the sound realm up to all sensations that arise from ear contact as supporting object.",
        "source": "T05n0220_144:0780c20_11"
    },
    {
        "source_sentence": "求耳界若我若無我，求聲界乃至耳觸為緣所生諸受若我若無我；",
        "translation": "They seek what is self and what is without self in the ear realm, and they seek what is self and what is without self in the sound realm or in all sensations that arise from ear contact as supporting object.",
        "source": "T05n0220_144:0780c22_12"
    },
    {
        "source_sentence": "求耳界若淨若不淨，求聲界乃至耳觸為緣所生諸受若淨若不淨。",
        "translation": "They seek whether the ear realm is pure or impure, and they seek whether the sound realm or even the sensations that arise from ear contact as a condition are pure or impure.",
        "source": "T05n0220_144:0780c23_13"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0780c25_14"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0780c26_15"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0780c26_16"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0780c28_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說鼻界若常若無常，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in order to develop the supreme determination for awakening enlightenment, they teach whether the nasal sense element is permanent or impermanent. They teach whether the sense element odor, the sense element smell, the sense element consciousness of smell, and the sensations that arise from nasal contact and nasal contact are permanent or impermanent.",
        "source": "T05n0220_144:0780c28_1"
    },
    {
        "source_sentence": "說鼻界若樂若苦，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若樂若苦；",
        "translation": "It is said to be either pleasant or painful in relation to the sense element nose. It is said to be either pleasant or painful in relation to the sense element nose. It is said to be neither pleasant nor painful in relation to the sense element odor, but it is also said to be neither pleasant nor painful in relation to the sense element smelling nor in relation to the sense element",
        "source": "T05n0220_144:0781a02_0"
    },
    {
        "source_sentence": "說鼻界若我若無我，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若我若無我；",
        "translation": "It is said that the element of smell, the element consciousness of the nose and the sensations that arise from nasal contact and nasal contact as supporting object are either self or selfless.",
        "source": "T05n0220_144:0781a03_1"
    },
    {
        "source_sentence": "說鼻界若淨若不淨，說香界、鼻識界及鼻觸、鼻觸為緣所生諸受若淨若不淨。",
        "translation": "It's said that the nose realm is pure or impure, and it's said that the sense realm of fragrance, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as a condition are either pure or impure.",
        "source": "T05n0220_144:0781a05_2"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0781a07_3"
    },
    {
        "source_sentence": "復作是說：行布施者，應求鼻界若常若無常，應求香界乃至鼻觸為緣所生諸受若常若無常；",
        "translation": "Again, it is said: “Those who practise giving should seek whether the element nose is permanent or impermanent”: They should seek whether the element odor is permanent or impermanent; they should seek whether the sensations that arise by reason of smell are permanent or impermanent up to and including the sensations that arise by reason of nasal contact.",
        "source": "T05n0220_144:0781a08_4"
    },
    {
        "source_sentence": "應求鼻界若樂若苦，應求香界乃至鼻觸為緣所生諸受若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the sense-nose realm. They should seek what is pleasant and what is painful in the sense-nose realm. They should seek what is pleasant and what is painful in the sense-nose realm of fragrance up to sensations that arise from nasal contact as supporting object.",
        "source": "T05n0220_144:0781a10_5"
    },
    {
        "source_sentence": "應求鼻界若我若無我，應求香界乃至鼻觸為緣所生諸受若我若無我；",
        "translation": "You should seek the existence or nonexistence of self in the sense-consciousness of the nose. You should seek the existence or nonexistence of self in the sense-consciousness of smell, and you should seek the existence or nonexistence of self in the sense-consciousness of smell up to the sensations that arise from nasal contact as supporting object.",
        "source": "T05n0220_144:0781a11_6"
    },
    {
        "source_sentence": "應求鼻界若淨若不淨，應求香界乃至鼻觸為緣所生諸受若淨若不淨。",
        "translation": "You should seek out whether the nose realm is pure or impure, and you should seek out whether the fragrance realm or even the sensations that arise from nasal contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781a13_7"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0781a15_8"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0781a16_9"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求鼻界若常若無常，求香界乃至鼻觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in this way they seek to know whether the sense element nose is permanent or impermanent. They seek to know whether the sense element odor or even the sensations that arise from nasal contact are permanent or impermanent.",
        "source": "T05n0220_144:0781a16_10"
    },
    {
        "source_sentence": "求鼻界若樂若苦，求香界乃至鼻觸為緣所生諸受若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in the sense faculty of the nose. They seek what is pleasant and what is painful in the sense faculty of smell, and they seek what is pleasant and what is painful in the sense faculty of smell or even in the sensations that arise from nasal contact as supporting object.",
        "source": "T05n0220_144:0781a18_11"
    },
    {
        "source_sentence": "求鼻界若我若無我，求香界乃至鼻觸為緣所生諸受若我若無我；",
        "translation": "They seek the sense element nose whether it is self or selfless; they seek the sense element smell and even the sensations that arise from nasal contact as supporting object, whether they are self or selfless.",
        "source": "T05n0220_144:0781a20_12"
    },
    {
        "source_sentence": "求鼻界若淨若不淨，求香界乃至鼻觸為緣所生諸受若淨若不淨。",
        "translation": "They seek to see whether the nose realm is pure or impure, and they seek to see whether the fragrance realm or even the sensations that arise from nasal contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781a21_13"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0781a23_14"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0781a24_15"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0781a24_16"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0781a26_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說舌界若常若無常，說味界、舌識界及舌觸、舌觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in order to develop the supreme determination for awakening enlightenment, they teach whether the tongue realm is permanent or impermanent. They teach whether the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as supporting conditions are permanent or impermanent.",
        "source": "T05n0220_144:0781a26_1"
    },
    {
        "source_sentence": "說舌界若樂若苦，說味界、舌識界及舌觸、舌觸為緣所生諸受若樂若苦；",
        "translation": "It is said that the element tongue is pleasant or painful. It is said that the element relishing, the element tongue and consciousness of the tongue, and the sensations arising from tongue contact and tongue contact as supporting object are either pleasant or painful.",
        "source": "T05n0220_144:0781a29_0"
    },
    {
        "source_sentence": "說舌界若我若無我，說味界、舌識界及舌觸、舌觸為緣所生諸受若我若無我；",
        "translation": "It is said that the element tongue is whether self or selfless; it is said that the element relishing, the element tongue and consciousness of the tongue, and the feelings that arise from tongue contact and tongue contact as supporting object are either self or selfless.",
        "source": "T05n0220_144:0781b01_1"
    },
    {
        "source_sentence": "說舌界若淨若不淨，說味界、舌識界及舌觸、舌觸為緣所生諸受若淨若不淨。",
        "translation": "It's said whether the tongue realm is pure or impure, and it's said whether the taste realm, the tongue-consciousness realm, tongue contact, and the sensations that arise from tongue contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781b03_2"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0781b05_3"
    },
    {
        "source_sentence": "復作是說：行布施者，應求舌界若常若無常，應求味界乃至舌觸為緣所生諸受若常若無常；",
        "translation": "They further make the following statement: Those who practice giving should seek whether the element tongue is permanent or impermanent, and they should seek whether the element of taste is permanent or impermanent, up to all sensations that arise by means of tongue contact.",
        "source": "T05n0220_144:0781b06_4"
    },
    {
        "source_sentence": "應求舌界若樂若苦，應求味界乃至舌觸為緣所生諸受若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the sense- tongue. They should seek what is pleasant and what is painful in the sense- tongue. They should seek what is pleasant and what is painful in the taste realm, up to what is pleasant and what is painful in the sensations that arise from tongue contact as supporting object.",
        "source": "T05n0220_144:0781b08_5"
    },
    {
        "source_sentence": "應求舌界若我若無我，應求味界乃至舌觸為緣所生諸受若我若無我；",
        "translation": "They should seek the sense-tongue realm as self or selfless, and they should seek the taste realm as self or selflessness of all sensations that arise from tongue contact as supporting object.",
        "source": "T05n0220_144:0781b10_0"
    },
    {
        "source_sentence": "應求舌界若淨若不淨，應求味界乃至舌觸為緣所生諸受若淨若不淨。",
        "translation": "You should seek whether the tongue realm is pure or impure, and you should seek whether the taste realm or even the sensations that arise from tongue contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781b11_1"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0781b13_2"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0781b14_3"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求舌界若常若無常，求味界乃至舌觸為緣所生諸受若常若無常；",
        "translation": "Good men and good women seek in this way to ascertain whether the realm of tongue is permanent or impermanent. They seek if the realm of taste is permanent or impermanent, up to if the sensations that arise by means of tongue contact are permanent or impermanent.",
        "source": "T05n0220_144:0781b14_4"
    },
    {
        "source_sentence": "求舌界若樂若苦，求味界乃至舌觸為緣所生諸受若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in the sense-tongue. They seek what is pleasant and what is painful in the sense- tongue, and they seek what is pleasant and what is painful in the taste realm or even in all sensations that arise from verbal contact as supporting object.",
        "source": "T05n0220_144:0781b16_5"
    },
    {
        "source_sentence": "求舌界若我若無我，求味界乃至舌觸為緣所生諸受若我若無我；",
        "translation": "They seek what is self and what is without self in the sense- tongue. They seek what is self and what is without self in the sense- tongue realm. They seek what is self and what is without self in the taste realm, up to all sensations that arise from tongue contact as supporting object.",
        "source": "T05n0220_144:0781b18_6"
    },
    {
        "source_sentence": "求舌界若淨若不淨，求味界乃至舌觸為緣所生諸受若淨若不淨。",
        "translation": "They seek whether the tongue realm is pure or impure, and they seek whether the taste realm or even the sensations that arise from tongue contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781b19_7"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0781b21_8"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0781b22_9"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0781b22_10"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0781b25_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說身界若常若無常，說觸界、身識界及身觸、身觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in order to develop the supreme determination for awakening enlightenment, they teach whether the body realm is permanent or impermanent. They teach whether the contact realm, the body-consciousness realm, and the sensations that arise from bodily contact and bodily contact as supporting conditions are permanent or impermanent.",
        "source": "T05n0220_144:0781b25_1"
    },
    {
        "source_sentence": "說身界若樂若苦，說觸界、身識界及身觸、身觸為緣所生諸受若樂若苦；",
        "translation": "They are said to be either pleasant or painful in relation to the element body. They are said to be either pleasant or painful in relation to the element tangible, the element tangible and the element consciousness of the body; they are said to be either pleasant or painful in relation to feelings that arise from bodily contact and bodily contact as supporting object.",
        "source": "T05n0220_144:0781b28_0"
    },
    {
        "source_sentence": "說身界若我若無我，說觸界、身識界及身觸、身觸為緣所生諸受若我若無我；",
        "translation": "It is said that the element tangible and the element consciousness of the body are either self or no-self. It is said that the element tangible, the element consciousness of the body, and the sensations that arise from bodily contact and bodily contact as supporting object are either self or no-self.",
        "source": "T05n0220_144:0781b29_1"
    },
    {
        "source_sentence": "說身界若淨若不淨，說觸界、身識界及身觸、身觸為緣所生諸受若淨若不淨。",
        "translation": "It's said whether the body realm is pure or impure, and it's said whether the contact realm, the body-consciousness realm, and the sensations that arise from body contact and body contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781c02_2"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0781c04_3"
    },
    {
        "source_sentence": "復作是說：行布施者，應求身界若常若無常，應求觸界乃至身觸為緣所生諸受若常若無常；",
        "translation": "They further make this statement: Those who practice giving should seek whether the realm of body is permanent or impermanent; they should seek whether the realm of tangible things, up to all sensations that arise from bodily contact as supporting object are permanent or impermanent.",
        "source": "T05n0220_144:0781c05_4"
    },
    {
        "source_sentence": "應求身界若樂若苦，應求觸界乃至身觸為緣所生諸受若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the realm of body. They should seek what is pleasant and what is painful in the realm of tangible things. They should seek what is pleasant and what is painful in the realm of sense contact, up to all sensations that arise from bodily contact as supporting object.",
        "source": "T05n0220_144:0781c07_5"
    },
    {
        "source_sentence": "應求身界若我若無我，應求觸界乃至身觸為緣所生諸受若我若無我；",
        "translation": "You should seek the body realm as if it were self or selfless, and you should seek the sense element contact as if it were self or selfless; up to feelings that arise from bodily contact as a condition as if they were self or selfless.",
        "source": "T05n0220_144:0781c08_6"
    },
    {
        "source_sentence": "應求身界若淨若不淨，應求觸界乃至身觸為緣所生諸受若淨若不淨。",
        "translation": "You should seek whether the body realm is pure or impure, and you should seek whether the touch realm or even the sensations that arise from bodily contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781c10_7"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0781c12_8"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0781c13_9"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求身界若常若無常，求觸界乃至身觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in this way they seek to know whether the body realm is permanent or impermanent. They seek to know whether the sense element tangible is permanent or impermanent, up to all sensations that arise from bodily contact as supporting object.",
        "source": "T05n0220_144:0781c13_10"
    },
    {
        "source_sentence": "求身界若樂若苦，求觸界乃至身觸為緣所生諸受若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in relation to the body element; they seek what is pleasant and what is painful in relation to the sense element tangible. They seek what is pleasant and what is painful in relation to the sense element tangible, up to all sensations that arise from bodily contact as supporting object.",
        "source": "T05n0220_144:0781c15_11"
    },
    {
        "source_sentence": "求身界若我若無我，求觸界乃至身觸為緣所生諸受若我若無我；",
        "translation": "They seek the body realm as if it were self or selfless; they seek the sense element tangible, up to all sensations that arise from bodily contact as a condition as if they were self or selfless.",
        "source": "T05n0220_144:0781c17_12"
    },
    {
        "source_sentence": "求身界若淨若不淨，求觸界乃至身觸為緣所生諸受若淨若不淨。",
        "translation": "They seek whether the body realm is pure or impure, and they seek whether the touch realm or even the sensations that arise from body contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781c18_13"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0781c20_14"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0781c21_15"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0781c21_16"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0781c23_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說意界若常若無常，說法界、意識界及意觸、意觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, if they give rise to the supreme determination for awakening enlightenment, they will explain whether the mental realm is permanent or impermanent. They will explain how the form realm of reality, the realm of thinking consciousness, and the sensations that arise from mental contact and mental contact as supporting conditions are permanent or impermanent",
        "source": "T05n0220_144:0781c23_1"
    },
    {
        "source_sentence": "說意界若樂若苦，說法界、意識界及意觸、意觸為緣所生諸受若樂若苦；",
        "translation": "It is said that the element mind is either pleasant or painful: it is said to be the element of doctrine, the element consciousness of the mind and feelings that arise from mental contact and mental contact as supporting object are either pleasant or painful.",
        "source": "T05n0220_144:0781c26_0"
    },
    {
        "source_sentence": "說意界若我若無我，說法界、意識界及意觸、意觸為緣所生諸受若我若無我；",
        "translation": "He teaches that the realm of mind is whether self or selfless; he explains that the realm of mind, the realm of mental consciousness, and the sensations that arise from mental contact and mental contact as supporting object are either self or selfless.",
        "source": "T05n0220_144:0781c27_1"
    },
    {
        "source_sentence": "說意界若淨若不淨，說法界、意識界及意觸、意觸為緣所生諸受若淨若不淨。",
        "translation": "He explains whether the mind realm is pure or impure, and he explains whether the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are pure or impure.",
        "source": "T05n0220_144:0781c29_2"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782a02_3"
    },
    {
        "source_sentence": "復作是說：行布施者，應求意界若常若無常，應求法界乃至意觸為緣所生諸受若常若無常；",
        "translation": "Again, it is said: “Those who practice giving should seek whether the realm of mind is permanent or impermanent”: They should seek whether the realm of factors up to and including feelings that arise by means of mental contact are permanent or impermanent.",
        "source": "T05n0220_144:0782a03_4"
    },
    {
        "source_sentence": "應求意界若樂若苦，應求法界乃至意觸為緣所生諸受若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the realm of thought. They should seek what is pleasant and what is painful in the realm of reality, up to what is pleasant and what is painful in the realm of mental contact as supporting object.",
        "source": "T05n0220_144:0782a05_5"
    },
    {
        "source_sentence": "應求意界若我若無我，應求法界乃至意觸為緣所生諸受若我若無我；",
        "translation": "They should seek the realm of mind as if it were self or selfless; they should seek the realm of reality as if it were self or selfless, up to feelings that arise from mental contact as condition as if they were self or selfless.",
        "source": "T05n0220_144:0782a07_0"
    },
    {
        "source_sentence": "應求意界若淨若不淨，應求法界乃至意觸為緣所生諸受若淨若不淨。",
        "translation": "You should seek whether the mind realm is pure or impure, and you should seek whether the Dharma realm or even the sensations that arise from mental contact as a condition are pure or impure.",
        "source": "T05n0220_144:0782a08_1"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782a10_2"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0782a11_3"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求意界若常若無常，求法界乃至意觸為緣所生諸受若常若無常；",
        "translation": "“Good sons and good daughters, in this way they seek to know whether the realm of thought is permanent or impermanent. They seek to know whether the realm of reality is permanent or impermanent, up to how many sensations that arise from mental contact are permanent or impermanent.",
        "source": "T05n0220_144:0782a11_4"
    },
    {
        "source_sentence": "求意界若樂若苦，求法界乃至意觸為緣所生諸受若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in the realm of thought. They seek what is pleasant and what is painful in the realm of factors, and they seek what is pleasant and what is painful in all sensations that arise from mental contact as supporting object.",
        "source": "T05n0220_144:0782a13_5"
    },
    {
        "source_sentence": "求意界若我若無我，求法界乃至意觸為緣所生諸受若我若無我；",
        "translation": "They seek the realm of thought whether it is self or selfless; they seek the realm of factors, and so on up to feelings that arise from mental contact as supporting object are either self or selfless.",
        "source": "T05n0220_144:0782a15_6"
    },
    {
        "source_sentence": "求意界若淨若不淨，求法界乃至意觸為緣所生諸受若淨若不淨。",
        "translation": "They seek whether the mind realm is pure or impure, and they seek whether the Dharma realm or even the sensations that arise from mental contact as a condition are pure or impure.",
        "source": "T05n0220_144:0782a16_7"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0782a18_8"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0782a19_9"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0782a19_10"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0782a21_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說地界若常若無常，說水、火、風、空、識界若常若無常；",
        "translation": "“Good sons and good daughters, in order to give rise to the supreme determination for enlightenment, they explain what is permanent and what is impermanent in the earth realm. They explain what is permanent and what is impermanent in water, fire, wind, space, and consciousness realms.",
        "source": "T05n0220_144:0782a21_1"
    },
    {
        "source_sentence": "說地界若樂若苦，說水、火、風、空、識界若樂若苦；",
        "translation": "The element earth is said to be either pleasant or painful. The elements water, fire, wind, air, space and consciousness are said to be either pleasant or painful.",
        "source": "T05n0220_144:0782a23_2"
    },
    {
        "source_sentence": "說地界若我若無我，說水、火、風、空、識界若我若無我；",
        "translation": "They teach that the earth element is self or selfless, and they teach that water, fire, wind, air, space, and the consciousness element are self or selfless.",
        "source": "T05n0220_144:0782a24_3"
    },
    {
        "source_sentence": "說地界若淨若不淨，說水、火、風、空、識界若淨若不淨。",
        "translation": "It's said whether the earth realm is pure or impure, and it's said whether the water, fire, wind, air, space, and consciousness realms are pure or impure.",
        "source": "T05n0220_144:0782a25_4"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782a26_5"
    },
    {
        "source_sentence": "復作是說：行布施者，應求地界若常若無常，應求水、火、風、空、識界若常若無常；",
        "translation": "Again, it is said: “Those who practice giving should seek whether the earth realm is permanent or impermanent; they should seek whether the water, fire, wind, air, space and consciousness realms are permanent or impermanent.",
        "source": "T05n0220_144:0782a28_6"
    },
    {
        "source_sentence": "應求地界若樂若苦，應求水、火、風、空、識界若樂若苦；",
        "translation": "They should seek what is pleasant and what is painful in the earth realm. They should seek what is pleasant and what is painful in the water, fire, wind, air, space, and consciousness realms.",
        "source": "T05n0220_144:0782a29_7"
    },
    {
        "source_sentence": "應求地界若我若無我，應求水、火、風、空、識界若我若無我；",
        "translation": "They should seek the earth element as self or selfless, and they should seek water, fire, wind, air, space, and the consciousness element as self or selfless.",
        "source": "T05n0220_144:0782b02_8"
    },
    {
        "source_sentence": "應求地界若淨若不淨，應求水、火、風、空、識界若淨若不淨。",
        "translation": "You should seek whether the earth realm is pure or impure, and you should seek whether the water, fire, wind, air, space, and consciousness realms are pure or impure.",
        "source": "T05n0220_144:0782b03_9"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782b04_10"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0782b05_11"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求地界若常若無常，求水、火、風、空、識界若常若無常；",
        "translation": "Good men and good women, in this way they seek to know whether the earth realm is permanent or impermanent, and if the water, fire, wind, air, space, and consciousness realms are permanent or impermanent.",
        "source": "T05n0220_144:0782b06_12"
    },
    {
        "source_sentence": "求地界若樂若苦，求水、火、風、空、識界若樂若苦；",
        "translation": "They seek what is pleasant and what is painful in the earth realm; they seek what is pleasant and what is painful in the water, fire, wind, air, space, and consciousness realms.",
        "source": "T05n0220_144:0782b07_13"
    },
    {
        "source_sentence": "求地界若我若無我，求水、火、風、空、識界若我若無我；",
        "translation": "They seek the earth element as self or selfless, and they seek the elements water, fire, wind, air, space, and consciousness as self or selfless.",
        "source": "T05n0220_144:0782b08_14"
    },
    {
        "source_sentence": "求地界若淨若不淨，求水、火、風、空、識界若淨若不淨。",
        "translation": "They seek the earth realm as pure or impure, and they seek the water, fire, wind, air, space, and consciousness realms as pure or impure.",
        "source": "T05n0220_144:0782b10_15"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0782b11_16"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0782b12_17"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0782b12_18"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0782b14_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說無明若常若無常，說行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若常若無常；",
        "translation": "“Good sons and good daughters, in order to give rise to the supreme determination for enlightenment they teach that ignorance is permanent or impermanent. They teach that conditioned forces, consciousness, name-and-form, the six sense-fields, contact, sensation, thirst, grasping, existence, birth, old age, sorrow, pain, suffering,",
        "source": "T05n0220_144:0782b14_1"
    },
    {
        "source_sentence": "說無明若樂若苦，說行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若樂若苦；",
        "translation": "It is said that ignorance is either pleasant or painful, and it is said that formations, consciousnesses, name-and-form, the six sense-fields, contact, feeling, thirst, craving, apprehension, existence, birth, old age, sorrow, pain, vexation, grief, distress, and vexation are either pleasant or pain",
        "source": "T05n0220_144:0782b17_2"
    },
    {
        "source_sentence": "說無明若我若無我，說行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若我若無我；",
        "translation": "They teach ignorance whether it is self or selfless. They teach formations, consciousnesses, name-and-form, the six sense-fields, contact, feeling, thirst, craving, grasping, existence, birth, old age, sorrow, pain, and vexation as self or selfless.",
        "source": "T05n0220_144:0782b19_0"
    },
    {
        "source_sentence": "說無明若淨若不淨，說行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱若淨若不淨。",
        "translation": "It's said whether nescience is pure or impure, and it's said whether form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, pain, and vexation are pure or impure.",
        "source": "T05n0220_144:0782b20_1"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782b22_2"
    },
    {
        "source_sentence": "復作是說：行布施者，應求無明若常若無常，應求行乃至老死愁歎苦憂惱若常若無常；",
        "translation": "“Furthermore, it is further said: Practitioners of giving should seek either permanence or impermanence in relation to ignorance. They should seek either permanence or impermanence in relation to formations up to the sorrow, pain, and vexation of old age and death.",
        "source": "T05n0220_144:0782b24_3"
    },
    {
        "source_sentence": "應求無明若樂若苦，應求行乃至老死愁歎苦憂惱若樂若苦；",
        "translation": "They should seek ignorance, whether pleasant or painful; they should seek conditioning up to the sorrow and suffering of old age and death, whether pleasant or painful.",
        "source": "T05n0220_144:0782b26_4"
    },
    {
        "source_sentence": "應求無明若我若無我，應求行乃至老死愁歎苦憂惱若我若無我；",
        "translation": "They should seek ignorance, whether it is self or selfless; they should seek conditioning, up to old age, sorrow, pain, and vexation, whether self or selfless.",
        "source": "T05n0220_144:0782b27_5"
    },
    {
        "source_sentence": "應求無明若淨若不淨，應求行乃至老死愁歎苦憂惱若淨若不淨。",
        "translation": "They should seek ignorance whether pure or impure, and they should seek practice up to old age, sorrow, pain, grief, and vexation whether pure or impure.",
        "source": "T05n0220_144:0782b29_0"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782c01_1"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0782c02_2"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求無明若常若無常，求行乃至老死愁歎苦憂惱若常若無常；",
        "translation": "“Good sons and good daughters, if they seek what is permanent or impermanent about ignorance in this way, then they will also seek what is permanent or impermanent about conditioned phenomena up to old age, sorrow, suffering, pain, and vexation.",
        "source": "T05n0220_144:0782c02_3"
    },
    {
        "source_sentence": "求無明若樂若苦，求行乃至老死愁歎苦憂惱若樂若苦；",
        "translation": "They seek nescience, whether pleasant or painful; they seek conditioning up to old age and death, grieving and suffering, sorrow and vexation, either pleasant or painful.",
        "source": "T05n0220_144:0782c04_4"
    },
    {
        "source_sentence": "求無明若我若無我，求行乃至老死愁歎苦憂惱若我若無我；",
        "translation": "They seek ignorance, whether it is self or selfless; they seek conditioning, up to old age and death, sorrow, pain, vexation, and suffering, whether self or selfless.",
        "source": "T05n0220_144:0782c06_5"
    },
    {
        "source_sentence": "求無明若淨若不淨，求行乃至老死愁歎苦憂惱若淨若不淨。",
        "translation": "They seek ignorance whether pure or impure, and they seek actions up to old age, grief, pain, and sorrow, whether pure or impure.",
        "source": "T05n0220_144:0782c07_6"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0782c09_0"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0782c10_1"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0782c10_2"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0782c12_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說布施波羅蜜多若常若無常，",
        "translation": "If good men and good women aspire to the unsurpassed mind of enlightenment, they teach that the perfection of generosity is permanent or impermanent,",
        "source": "T05n0220_144:0782c12_1"
    },
    {
        "source_sentence": "說淨戒、安忍、精進、靜慮、般若波羅蜜多若常若無常；",
        "translation": "They teach that the precepts of purity, patience, effort, meditative absorption, and transcendent wisdom are both permanent and impermanent.",
        "source": "T05n0220_144:0782c13_2"
    },
    {
        "source_sentence": "說布施波羅蜜多若樂若苦，說淨戒、安忍、精進、靜慮、般若波羅蜜多若樂若苦；",
        "translation": "They teach the perfection of giving, whether pleasant or painful, and they teach the perfections of morality, patience, effort, meditation, and wisdom, whether pleasant or painful.",
        "source": "T05n0220_144:0782c15_3"
    },
    {
        "source_sentence": "說布施波羅蜜多若我若無我，說淨戒、安忍、精進、靜慮、般若波羅蜜多若我若無我；",
        "translation": "They teach that the perfection of giving is self or selfless, and they teach that the perfections of morality, patience, effort, meditation, and wisdom are self or selfless.",
        "source": "T05n0220_144:0782c16_4"
    },
    {
        "source_sentence": "說布施波羅蜜多若淨若不淨，說淨戒、安忍、精進、靜慮、般若波羅蜜多若淨若不淨。",
        "translation": "He teaches whether the perfection of generosity is pure or impure, and he teaches whether the perfections of morality, patience, effort, meditation, and wisdom are pure or impure.",
        "source": "T05n0220_144:0782c18_5"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782c20_6"
    },
    {
        "source_sentence": "復作是說：行布施者，應求布施波羅蜜多若常若無常，應求淨戒乃至般若波羅蜜多若常若無常；",
        "translation": "“Furthermore, it is further said: Practitioners of giving should seek the perfection of giving, whether permanent or impermanent; they should seek pure morality and up to the perfection of wisdom, whether permanent or impermanent.",
        "source": "T05n0220_144:0782c21_7"
    },
    {
        "source_sentence": "應求布施波羅蜜多若樂若苦，應求淨戒乃至般若波羅蜜多若樂若苦；",
        "translation": "They should seek the perfection of giving, whether pleasant or painful; they should seek pure morality up to the perfection of wisdom, whether pleasant or painful.",
        "source": "T05n0220_144:0782c24_0"
    },
    {
        "source_sentence": "應求布施波羅蜜多若我若無我，應求淨戒乃至般若波羅蜜多若我若無我；",
        "translation": "They should seek the perfection of generosity as self or selfless, and they should seek pure morality up to the perfection of wisdom as self or selfless.",
        "source": "T05n0220_144:0782c25_1"
    },
    {
        "source_sentence": "應求布施波羅蜜多若淨若不淨，應求淨戒乃至般若波羅蜜多若淨若不淨。",
        "translation": "You should seek the perfection of generosity whether pure or impure, and you should seek the pure precepts up to the perfection of wisdom whether pure or impure.",
        "source": "T05n0220_144:0782c27_2"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0782c29_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0783a01_4"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求布施波羅蜜多若常若無常，求淨戒乃至般若波羅蜜多若常若無常；",
        "translation": "If good men and good women seek the perfection of generosity in this way, whether permanent or impermanent, pursuing pure precepts up to the perfection of wisdom is either permanent or impermanent.",
        "source": "T05n0220_144:0783a01_5"
    },
    {
        "source_sentence": "求布施波羅蜜多若樂若苦，求淨戒乃至般若波羅蜜多若樂若苦；",
        "translation": "They seek the perfection of giving, whether pleasant or painful; they seek pure precepts and even the perfection of wisdom, whether pleasant or painful.",
        "source": "T05n0220_144:0783a03_6"
    },
    {
        "source_sentence": "求布施波羅蜜多若我若無我，求淨戒乃至般若波羅蜜多若我若無我；",
        "translation": "They seek the perfection of giving, whether self or selfless; they seek pure precepts and so on up to the perfection of wisdom, whether self or selfless.",
        "source": "T05n0220_144:0783a05_7"
    },
    {
        "source_sentence": "求布施波羅蜜多若淨若不淨，求淨戒乃至般若波羅蜜多若淨若不淨。",
        "translation": "Seeking the perfection of generosity is purified or impure, and seeking pure precepts up to the perfection of wisdom is purified or impure.",
        "source": "T05n0220_144:0783a06_8"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0783a08_9"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0783a10_0"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0783a10_1"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T05n0220_144:0783a12_0"
    },
    {
        "source_sentence": "若善男子、善女人等為發無上菩提心者，說內空若常若無常，說外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若常若無常；",
        "translation": "Good men and good women, in order to give rise to the supreme determination for enlightenment, explain internal emptiness whether permanent or impermanent; they explain external emptiness, internal emptiness, external emptiness, emptiness, emptiness of emptiness, great emptiness, ultimate emptiness, emptiness of becoming, emptiness of non",
        "source": "T05n0220_144:0783a12_1"
    },
    {
        "source_sentence": "說內空若樂若苦，說外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若樂若苦；",
        "translation": "They teach that internal emptiness is either pleasant or painful, and they teach that external emptiness, internal emptiness or external emptiness, emptiness of emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-nature, emp",
        "source": "T05n0220_144:0783a17_2"
    },
    {
        "source_sentence": "說內空若我若無我，說外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若我若無我；",
        "translation": "He teaches that internal emptiness whether self or selfless, he teaches that external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-nature, emptiness of",
        "source": "T05n0220_144:0783a21_3"
    },
    {
        "source_sentence": "說內空若淨若不淨，說外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空若淨若不淨。",
        "translation": "He teaches that internal emptiness is either pure or impure, and he teaches that external emptiness, internal emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature, emptiness of",
        "source": "T05n0220_144:0783a25_4"
    },
    {
        "source_sentence": "若有能依如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can cultivate generosity based on such things, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0783a29_5"
    },
    {
        "source_sentence": "復作是說：行布施者，應求內空若常若無常，應求外空乃至無性自性空若常若無常；",
        "translation": "They further make this statement: Those who practice giving should seek internal emptiness, whether permanent or impermanent; they should seek external emptiness up to the emptiness of a natureless self-nature, whether permanent or impermanent.",
        "source": "T05n0220_144:0783b01_6"
    },
    {
        "source_sentence": "應求內空若樂若苦，應求外空乃至無性自性空若樂若苦；",
        "translation": "They should seek internal emptiness as either pleasant or painful, and they should seek external emptiness up to the emptiness of the essential nature of nonexistence as either pleasant or painful.",
        "source": "T05n0220_144:0783b03_7"
    },
    {
        "source_sentence": "應求內空若我若無我，應求外空乃至無性自性空若我若無我；",
        "translation": "They should seek internal emptiness, whether self or selfless; they should seek external emptiness up to the emptiness of the essential nature of nonexistence, whether self or selfless.",
        "source": "T05n0220_144:0783b04_8"
    },
    {
        "source_sentence": "應求內空若淨若不淨，應求外空乃至無性自性空若淨若不淨。",
        "translation": "You should seek internal emptiness as pure or impure, and you should seek external emptiness or even the emptiness of the natureless self-nature as pure or impure.",
        "source": "T05n0220_144:0783b06_9"
    },
    {
        "source_sentence": "若有能求如是等法修行布施，是行布施波羅蜜多。",
        "translation": "If someone can seek such things and cultivate generosity, they're practicing the perfection of generosity.",
        "source": "T05n0220_144:0783b07_10"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0783b09_0"
    },
    {
        "source_sentence": "若善男子、善女人等，如是求內空若常若無常，求外空乃至無性自性空若常若無常；",
        "translation": "Good men and good women, in this way they seek internal emptiness whether permanent or impermanent; they seek external emptiness up to the emptiness of the self-natureless nature of emptiness whether permanent or impermanent.",
        "source": "T05n0220_144:0783b09_1"
    },
    {
        "source_sentence": "求內空若樂若苦，求外空乃至無性自性空若樂若苦；",
        "translation": "They seek internal emptiness as either pleasant or painful, and they seek external emptiness up to the emptiness of the essential nature of nonexistence as either pleasant or painful.",
        "source": "T05n0220_144:0783b11_2"
    },
    {
        "source_sentence": "求內空若我若無我，求外空乃至無性自性空若我若無我；",
        "translation": "They seek internal emptiness, whether self or selfless; they seek external emptiness up to the emptiness of the essential nature of nonexistence, whether self or selfless.",
        "source": "T05n0220_144:0783b12_3"
    },
    {
        "source_sentence": "求內空若淨若不淨，求外空乃至無性自性空若淨若不淨。",
        "translation": "They seek internal emptiness whether pure or impure, and they seek external emptiness or even the emptiness of the natureless self-nature as pure or impure.",
        "source": "T05n0220_144:0783b13_4"
    },
    {
        "source_sentence": "依此等法行布施者，我說名為行有所得相似布施波羅蜜多。",
        "translation": "Those who practice generosity based on these teachings are called those who practice the perfection of generosity that's similar to what they attain.",
        "source": "T05n0220_144:0783b15_5"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T05n0220_144:0783b16_6"
    },
    {
        "source_sentence": "如前所說，當知皆是說有所得相似布施波羅蜜多。",
        "translation": "As explained earlier, it should be known that they all refer to the perfection of generosity similar to what's attained.",
        "source": "T05n0220_144:0783b16_7"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第一百四十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 14",
        "source": "T05n0220_144:0783b18_0"
    }
]