[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 9",
        "source": "T06n0220_394:1036c09_0"
    },
    {
        "source_sentence": "十四",
        "translation": "fourteen",
        "source": "T06n0220_394:1036c10_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_394:1036c12_0"
    },
    {
        "source_sentence": "初分嚴淨佛土品第七十二之二",
        "translation": "Chapter Seventy-Second and Second Part of the Chapter on the First Part: The Adorned Pure Buddha Land",
        "source": "T06n0220_394:1036c13_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1036c14_0"
    },
    {
        "source_sentence": "有菩薩摩訶薩以通願力，盛滿三千大千世界上妙七寶施佛、法、僧。",
        "translation": "Suppose there's a bodhisattva-mahāsattva who, by the power of his supernormal vows, fills 3,000 great one-thousand worlds with marvelous seven treasures and gives them to the Buddha, Dharma, and S",
        "source": "T06n0220_394:1036c14_1"
    },
    {
        "source_sentence": "施已歡喜發弘誓願：『我持如是所種善根，與諸有情平等共有，迴向所求嚴淨佛土，",
        "translation": "Having given it, they rejoice and make a great vow: I preserve the roots of goodness sown in this way, equally sharing them with sentient beings, dedicating them back to the adornment and purity of the buddha-",
        "source": "T06n0220_394:1036c15_2"
    },
    {
        "source_sentence": "當令我土七寶莊嚴，一切有情隨意受用種種珍寶而無染著。』",
        "translation": "You will cause my land to be adorned with seven treasures, and all sentient beings will enjoy various treasures as they wish without defiled attachment.'",
        "source": "T06n0220_394:1036c17_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1036c19_0"
    },
    {
        "source_sentence": "有菩薩摩訶薩以通願力，擊奏無量天上、人中諸妙音樂，供養三寶及佛制多。",
        "translation": "Suppose there's a bodhisattva Mahāsattva who, with the power of his supernormal vow, beats and plays wonderful music in measureless heavens and humans to make offerings to the Three Treasures and the Buddha's restraints",
        "source": "T06n0220_394:1036c19_1"
    },
    {
        "source_sentence": "供已歡喜發弘誓願：『我持如是所種善根，與諸有情平等共有，迴向所求嚴淨佛土，",
        "translation": "Having honored the offering, they rejoiced and made a great vow: I will maintain these roots of goodness sown in this way, equally sharing them with sentient beings, and dedicating them to the adorned and pure buddha-lands",
        "source": "T06n0220_394:1036c21_0"
    },
    {
        "source_sentence": "當令我土常奏如是上妙樂音，有情聞之身心悅預而無染著。』",
        "translation": "You will cause my land to always play such a wonderfully beautiful sound of music, and sentient beings who hear it will be delighted with body and mind and won't become attached.'",
        "source": "T06n0220_394:1036c22_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1036c24_2"
    },
    {
        "source_sentence": "有菩薩摩訶薩以通願力，盛滿三千大千世界人中、天上諸妙香花，供養三寶及佛制多。",
        "translation": "There are bodhisattvas and mahāsattvas who, by the power of their supernormal vows, fill the 3,000 great one-thousand worlds with wonderful fragrant flowers among humans and gods in heaven to make offerings to the Three Treasures",
        "source": "T06n0220_394:1036c24_3"
    },
    {
        "source_sentence": "供已歡喜發弘誓願：『我持如是所種善根，與諸有情平等共有，迴向所求嚴淨佛土，",
        "translation": "Having honored the offering, they rejoiced and made a great vow: I will maintain these roots of goodness sown in this way, equally sharing them with sentient beings, and dedicating them to the adorned and pure buddha-lands",
        "source": "T06n0220_394:1036c26_4"
    },
    {
        "source_sentence": "當令我土常有如是諸妙香花，有情受用身心悅預而無染著。』",
        "translation": "You will cause my land to always have such wonderful fragrant flowers, and sentient beings who experience them will be delighted by body and mind without defiled attachment.'",
        "source": "T06n0220_394:1036c28_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1036c29_6"
    },
    {
        "source_sentence": "有菩薩摩訶薩以通願力，營辦百味上妙飲食，供養諸佛、獨覺、聲聞及諸菩薩摩訶薩眾。",
        "translation": "There are bodhisattva mahāsattvas who, by the power of their supernormal vows, prepare a hundred tasty and wonderful foods to offer to the buddhas, pratyekbuddhas, śrāvakas, and bodhisattva mahāsatt",
        "source": "T06n0220_394:1037a01_0"
    },
    {
        "source_sentence": "供已歡喜發弘誓願：『我持如是所種善根，與諸有情平等共有，迴向所求嚴淨佛土，",
        "translation": "Having honored the offering, they rejoiced and made a great vow: I will maintain these roots of goodness sown in this way, equally sharing them with sentient beings, and dedicating them to the adorned and pure buddha-lands",
        "source": "T06n0220_394:1037a03_0"
    },
    {
        "source_sentence": "當得無上正等覺時，令我土中諸有情類，皆食如是百味飲食，資悅身心而無染著。』",
        "translation": "When he attains unsurpassed perfect enlightenment, he causes all the sentient beings in my land to eat such a hundred flavors of food and drink that nourishes body and mind without defiled attachment.'",
        "source": "T06n0220_394:1037a04_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037a06_2"
    },
    {
        "source_sentence": "有菩薩摩訶薩以通願力，營辦種種天上、人中上妙塗香、細軟衣服，奉施諸佛、獨覺、聲聞及諸菩薩摩訶薩眾，",
        "translation": "“Some enlightening beings, by the power of superknowledgement and vows, prepare various heavenly and human fragrant ointments, fine and soft clothing, to be offered to buddhas, individual illuminates, disciples, and great en",
        "source": "T06n0220_394:1037a07_0"
    },
    {
        "source_sentence": "或復施法并佛制多。",
        "translation": "Or they may also give the Dharma and the Buddha's precepts as well.",
        "source": "T06n0220_394:1037a09_1"
    },
    {
        "source_sentence": "施已歡喜發弘誓願：『我持如是所種善根，與諸有情平等共有，迴向所求嚴淨佛土，",
        "translation": "Having given it, they rejoice and make a great vow: I preserve the roots of goodness sown in this way, equally sharing them with sentient beings, dedicating them back to the adornment and purity of the buddha-",
        "source": "T06n0220_394:1037a09_2"
    },
    {
        "source_sentence": "當得無上正等覺時，令我土中諸有情類，常得如是衣服、塗香，隨意受用而無染著。』",
        "translation": "When he attains unsurpassed perfect enlightenment, he causes all the sentient beings in my land to always obtain such clothing and ointments and use them as they wish without defiled attachment.'",
        "source": "T06n0220_394:1037a11_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037a13_4"
    },
    {
        "source_sentence": "有菩薩摩訶薩以通願力，嚴辦種種人中、天上隨意所生上妙色、聲、香、味、觸境，",
        "translation": "“There are great enlightening beings who, by the power of superknowledgement and vows, adorn all kinds of sentient beings and celestial beings with the most sublime forms, sounds, smells, tastes, and tang",
        "source": "T06n0220_394:1037a13_5"
    },
    {
        "source_sentence": "供養諸佛及佛制多、獨覺、聲聞并諸菩薩，施餘生類。",
        "translation": "They make offerings to buddhas, buddha-teachings, pratyekabuddhas, śrāvakas, and bodhisattvas, and give them to other sentient beings.",
        "source": "T06n0220_394:1037a15_6"
    },
    {
        "source_sentence": "歡喜踊躍發弘誓願：『我持如是所種善根，與諸有情平等共有，迴向所求嚴淨佛土，",
        "translation": "“With such roots of goodness planted in this way, I share them equally with sentient beings and dedicate them to the adornment and purity of the buddha-lands they seek.",
        "source": "T06n0220_394:1037a16_7"
    },
    {
        "source_sentence": "當得無上正等覺時，令我土中諸有情類，隨心所樂上妙色、聲、香、味、觸境應念而至，",
        "translation": "When he attains supreme perfect enlightenment, he causes all sentient beings in my land to follow their mind’s desire for the highest form, sound, odor, taste, touch, and object.",
        "source": "T06n0220_394:1037a18_8"
    },
    {
        "source_sentence": "歡喜受用而無染著。』",
        "translation": "They rejoice in sensation and enjoy it without defiled attachment.'",
        "source": "T06n0220_394:1037a20_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037a21_10"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自住內空，亦勸他住內空；",
        "translation": "“There are great enlightening beings who practice the perfection of wisdom, making great vows, diligently and courageously undertaking to do so. Abiding themselves in internal emptiness, they also encourage others to abide in internal emptiness.",
        "source": "T06n0220_394:1037a21_11"
    },
    {
        "source_sentence": "自住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They themselves abide in external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, empti",
        "source": "T06n0220_394:1037a23_12"
    },
    {
        "source_sentence": "亦勸他住外空乃至無性自性空。",
        "translation": "It also encourages others to abide in external emptiness or even the emptiness of the self-natureless self-nature.",
        "source": "T06n0220_394:1037a26_13"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離內空乃至無性自性空。』",
        "translation": "After doing this, he also made the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be separated from internal emptiness or even the emptiness of the self",
        "source": "T06n0220_394:1037a27_14"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037a29_15"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修四念住，亦勸他修四念住；",
        "translation": "“There are great enlightening beings who practice the perfection of wisdom, making great vows, diligently and courageously undertaking to do so. Cultivating themselves in the four foundations of mindfulness, they also encourage others to cultivate them.",
        "source": "T06n0220_394:1037a29_16"
    },
    {
        "source_sentence": "自修四正斷、四神足、五根、五力、七等覺支、八聖道支，亦勸他修四正斷乃至八聖道支。",
        "translation": "They themselves cultivate the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path, and they also encourage others to cultiva",
        "source": "T06n0220_394:1037b02_17"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離四念住乃至八聖道支。』",
        "translation": "After doing this, he also makes the vow, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to part with the four abodes of mindfulness or even the eight noble factors of the path.",
        "source": "T06n0220_394:1037b04_18"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037b07_0"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自住苦聖諦，亦勸他住苦聖諦；",
        "translation": "“There are great enlightening beings who practice the perfection of wisdom, making great vows, diligently and boldly undertaking to strive. Abiding themselves in the truth of suffering, they also encourage others to abide in the truth of suffering.",
        "source": "T06n0220_394:1037b07_1"
    },
    {
        "source_sentence": "自住集、滅、道聖諦，亦勸他住集、滅、道聖諦。",
        "translation": "He himself abides in the noble truths of accumulation, cessation, and the path, and he also encourages others to abide in the noble truths of accumulation, cessation, and the path.",
        "source": "T06n0220_394:1037b09_2"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離苦聖諦、集、滅、道聖諦。』",
        "translation": "After doing this, he also made the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to part with the noble truths of suffering, arising, cessation,",
        "source": "T06n0220_394:1037b10_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037b12_4"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修四靜慮，亦勸他修四靜慮；",
        "translation": "“There were great enlightening beings who practiced the perfection of wisdom, making great vows, diligently and courageously undertaking to do so. They cultivated the four meditations for themselves and also encouraged others to cultivate the four meditations.",
        "source": "T06n0220_394:1037b12_5"
    },
    {
        "source_sentence": "自修四無量、四無色定，亦勸他修四無量、四無色定。",
        "translation": "They themselves cultivate the four immeasurable and four formless concentrations, and they also encourage others to cultivate the four immeasurable and four formless concentrations.",
        "source": "T06n0220_394:1037b14_6"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離四靜慮、四無量、四無色定。』",
        "translation": "After doing this, he also makes the vow, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to part with the four meditations, four immeasurable concentrations, and four formless",
        "source": "T06n0220_394:1037b15_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037b17_8"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修八解脫，亦勸他修八解脫；",
        "translation": "“There are great enlightening beings who practice the perfection of wisdom, making great vows, diligently and boldly undertaking to cultivate the eight liberations themselves, and also encouraging others to cultivate the eight liberations.",
        "source": "T06n0220_394:1037b18_9"
    },
    {
        "source_sentence": "自修八勝處、九次第定、十遍處，亦勸他修八勝處、九次第定、十遍處。",
        "translation": "He cultivates the eight abodes of excellence, nine graduated concentrations, and ten universal abodes for himself, and he also encourages others to cultivate the eight abodes of excellence, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_394:1037b20_10"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離八解脫乃至十遍處。』",
        "translation": "After doing this, he also made the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be separated from the eight liberations or even the ten universal abodes.'",
        "source": "T06n0220_394:1037b21_11"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037b23_12"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修陀羅尼門，",
        "translation": "There were bodhisattva mahāsattvas who cultivated the perfection of wisdom, made great vows, exerted themselves with energy and courage, and cultivated the dhāraṇī teachings themselves.",
        "source": "T06n0220_394:1037b24_0"
    },
    {
        "source_sentence": "亦勸他修陀羅尼門；",
        "translation": "They also exhort others to cultivate the practice of mental commands.",
        "source": "T06n0220_394:1037b25_1"
    },
    {
        "source_sentence": "自修三摩地門，亦勸他修三摩地門。",
        "translation": "He cultivates the approach of samādhi for himself and encourages others to cultivate the approach of samādhi.",
        "source": "T06n0220_394:1037b26_2"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離陀羅尼門、三摩地門。』",
        "translation": "After doing this, he also made the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be separated from the dhāraṇī and samādhi teachings.'",
        "source": "T06n0220_394:1037b26_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037b29_4"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修空解脫門，",
        "translation": "“There are bodhisattva-mahasattvas who practice the perfection of wisdom. They make great vows, diligently and courageously apply themselves, and cultivate for themselves the liberation door of emptiness.",
        "source": "T06n0220_394:1037b29_5"
    },
    {
        "source_sentence": "亦勸他修空解脫門；",
        "translation": "They also encourage others to cultivate the liberation gate of emptiness.",
        "source": "T06n0220_394:1037c01_6"
    },
    {
        "source_sentence": "自修無相、無願解脫門，亦勸他修無相、無願解脫門。",
        "translation": "They themselves cultivate the liberation gate of marklessness and wishlessness, and they also encourage others to cultivate the liberation gate of marklessness and wishlessness.",
        "source": "T06n0220_394:1037c02_7"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離空解脫門、無相、無願解脫門。』",
        "translation": "After doing this, he also makes the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be separated from the liberation gate of emptiness, the liberation gate",
        "source": "T06n0220_394:1037c03_8"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037c05_9"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修極喜地，亦勸他修極喜地；",
        "translation": "“There are great enlightening beings who practice the perfection of wisdom, making great vows, diligently and boldly applying themselves, cultivating the state of ultimate bliss for themselves, and also encouraging others to cultivate it.",
        "source": "T06n0220_394:1037c06_10"
    },
    {
        "source_sentence": "自修離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地，",
        "translation": "He cultivates for himself the stage of freedom from defilement, the stage of emanation of light, the stage of blazing wisdom, the stage of extreme difficulty overcoming, the stage of presence, the stage of distant action, the stage of immovability,",
        "source": "T06n0220_394:1037c08_11"
    },
    {
        "source_sentence": "亦勸他修離垢地乃至法雲地。",
        "translation": "He also encourages others to cultivate the stage of freedom from defilement up to the stage of the Dharma-cloud.",
        "source": "T06n0220_394:1037c09_12"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離極喜地乃至法雲地。』",
        "translation": "After doing this, he also made the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be far from the ground of ultimate joy or even the ground of the Dharma-",
        "source": "T06n0220_394:1037c10_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037c12_14"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修五眼，亦勸他修五眼；",
        "translation": "“There are great enlightening beings who practice the perfection of wisdom, making great vows, diligently and courageously undertaking to do so. They cultivate the five kinds of eye for themselves and also encourage others to cultivate them.",
        "source": "T06n0220_394:1037c12_15"
    },
    {
        "source_sentence": "自修六神通，亦勸他修六神通。",
        "translation": "He cultivates the six supernormal powers for himself and encourages others to cultivate the six supernormal powers.",
        "source": "T06n0220_394:1037c14_16"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離五眼、六神通。』",
        "translation": "After doing this, he also made the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be separated from the five eyes and six supernormal powers.'",
        "source": "T06n0220_394:1037c15_17"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037c17_18"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修佛十力，亦勸他修佛十力；",
        "translation": "“There were great enlightening beings who practiced the perfection of wisdom, making great vows, diligently and boldly undertaking to exert themselves. They cultivated the ten powers of buddhahood for themselves and also encouraged others to cultivate",
        "source": "T06n0220_394:1037c17_19"
    },
    {
        "source_sentence": "自修四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，",
        "translation": "They themselves cultivate the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_394:1037c19_20"
    },
    {
        "source_sentence": "亦勸他修四無所畏乃至十八佛不共法。",
        "translation": "He also encourages others to cultivate the four fearlessnesses and even the 18 Buddha-principles.",
        "source": "T06n0220_394:1037c21_21"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離佛十力乃至十八佛不共法。』",
        "translation": "After doing this, he also made the vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to part with the Buddha's ten powers or even the 18 uncommon",
        "source": "T06n0220_394:1037c22_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037c24_1"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修三十二大士相，",
        "translation": "“There are bodhisattva-mahasattvas who practice the perfection of wisdom, make great vows, and diligently and boldly cultivate for themselves the thirty-two marks of a great hero.",
        "source": "T06n0220_394:1037c24_2"
    },
    {
        "source_sentence": "亦勸他修三十二大士相；",
        "translation": "They also encourage others to cultivate the thirty-two marks of greatness.",
        "source": "T06n0220_394:1037c26_3"
    },
    {
        "source_sentence": "自修八十隨好，亦勸他修八十隨好。",
        "translation": "He cultivates the eighty secondary signs for himself and encourages others to cultivate the eighty secondary signs.",
        "source": "T06n0220_394:1037c26_4"
    },
    {
        "source_sentence": "作是事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離三十二大士相、八十隨好。』",
        "translation": "After doing this, he then made another vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all the sentient beings in my land not to be separated from the thirty-two marks of a great person",
        "source": "T06n0220_394:1037c27_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1037c29_6"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修無忘失法，",
        "translation": "“There are bodhisattva-mahasattvas who practice the perfection of wisdom, undertaking great vows, diligently and courageously, cultivating themselves without forgetting the Teaching.",
        "source": "T06n0220_394:1038a01_7"
    },
    {
        "source_sentence": "亦勸他修無忘失法；",
        "translation": "They also encourage others to cultivate the principle of nonforgetfulness.",
        "source": "T06n0220_394:1038a02_8"
    },
    {
        "source_sentence": "自修恒住捨性，亦勸他修恒住捨性。",
        "translation": "He cultivates the nature of constant abiding equanimity himself, and he also encourages others to cultivate the nature of constant abiding equanimity.",
        "source": "T06n0220_394:1038a03_9"
    },
    {
        "source_sentence": "作是事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離無忘失法、恒住捨性。』",
        "translation": "After doing this, he then made another vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to part with the Dharma of no forgetfulness and always abide in equanim",
        "source": "T06n0220_394:1038a04_10"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1038a07_0"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修一切智，亦勸他修一切智；",
        "translation": "“There are great enlightening beings who practice the perfection of wisdom, making great vows, exerting themselves energetically and courageously, cultivating omniscience for themselves, and also encouraging others to cultivate omniscience.",
        "source": "T06n0220_394:1038a07_1"
    },
    {
        "source_sentence": "自修道相智、一切相智，亦勸他修道相智、一切相智。",
        "translation": "He cultivates the knowledge of the characteristics and all characteristics of the path for himself and encourages others to cultivate the knowledge of the characteristics and all characteristics of the path.",
        "source": "T06n0220_394:1038a09_2"
    },
    {
        "source_sentence": "作此事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離一切智、道相智、一切相智。』",
        "translation": "After doing this, he also makes the vow, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be separated from omniscience, knowledge of the path, and knowledge of all characteristics",
        "source": "T06n0220_394:1038a10_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1038a12_4"
    },
    {
        "source_sentence": "有菩薩摩訶薩修行般若波羅蜜多，發弘誓願精勤勇猛，自修一切菩薩摩訶薩行，",
        "translation": "“There are bodhisattva-mahasattvas who practice the perfection of wisdom and make great vows, diligently and courageously, cultivating all their own practices as bodhisattva-mahasattvas.",
        "source": "T06n0220_394:1038a12_5"
    },
    {
        "source_sentence": "亦勸他修一切菩薩摩訶薩行；",
        "translation": "They also encourage others to cultivate all the practices of enlightening beings.",
        "source": "T06n0220_394:1038a14_6"
    },
    {
        "source_sentence": "自修諸佛無上正等菩提，亦勸他修諸佛無上正等菩提。",
        "translation": "They themselves cultivate the unsurpassed correct perfect enlightenment of the buddhas and encourage others to cultivate the unsurpassed correct perfect enlightenment of the buddhas.",
        "source": "T06n0220_394:1038a15_7"
    },
    {
        "source_sentence": "作是事已復發願言：『當得無上正等覺時，令我土中諸有情類，皆不遠離一切菩薩摩訶薩行、諸佛無上正等菩提。』",
        "translation": "After doing this, he also made a vow, saying, 'When I attain unsurpassed perfect enlightenment, I will cause all sentient beings in my land not to be separated from all the bodhisattva-mahāsattva practices",
        "source": "T06n0220_394:1038a16_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038a19_9"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩修行般若波羅蜜多，由此行願便能嚴淨所求佛土。",
        "translation": "These are the bodhisattva-mahāsattvas who cultivate the perfection of prajñāpāramitā, and because of these practices and vows, they can adorn and purify the Buddha land that they seek.",
        "source": "T06n0220_394:1038a19_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038a21_11"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩隨爾所時行菩提道，應得圓滿所起行願，即爾所時精勤修學。",
        "translation": "These bodhisattvas, mahāsattvas, and bodhisattvas who follow the path of enlightenment at such a time should attain the fulfillment of the practices and vows that they give rise to, which are diligently cultivated at such",
        "source": "T06n0220_394:1038a21_12"
    },
    {
        "source_sentence": "由此因緣，自能成就一切善法，亦能令他漸次成就一切善法，自能修得殊勝相好所莊嚴身，",
        "translation": "Because of these causes and conditions, they themselves can accomplish all good qualities, also able to cause others to gradually accomplish all good qualities. They themselves can cultivate the body adorned with extraordinary marks and embellishments.",
        "source": "T06n0220_394:1038a23_0"
    },
    {
        "source_sentence": "亦能令他漸次修得殊勝相好所莊嚴身，由廣大福所攝受故。",
        "translation": "It can also cause others to gradually cultivate a body adorned with extraordinary characteristics and beauty, because it is endowed with vast merit.",
        "source": "T06n0220_394:1038a25_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038a26_2"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩各於所求嚴淨佛土證得無上正等覺時，所化有情亦生彼土共受淨土大乘法樂。",
        "translation": "When these bodhisattvas, mahāsattvas, and bodhisattvas each attain unsurpassed perfect enlightenment in the Buddha land of adornment and purity that they seek, the sentient beings they transform will also be born in that",
        "source": "T06n0220_394:1038a26_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038a28_4"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩應修如是嚴淨佛土，謂彼土中常不聞有三種惡趣，亦不聞有諸惡見趣，",
        "translation": "These are the bodhisattva-mahāsattvas who should cultivate this kind of adornment and purity in the Buddha’s buddha-lands. “In those buddha-lands they never hear that there are three bad courses of action, nor do they",
        "source": "T06n0220_394:1038a29_5"
    },
    {
        "source_sentence": "亦不聞有貪、瞋、癡毒，亦不聞有男女形相，亦不聞有聲聞、獨覺，亦不聞有苦、無常等，",
        "translation": "Nor do they hear the poisons of craving, hatred, and delusion. Nor do they hear the marks of men and women, nor do they hear that there are disciples or self-enlightened ones. Nor do they hear that there is",
        "source": "T06n0220_394:1038b02_6"
    },
    {
        "source_sentence": "亦不聞有攝受資具，亦不聞有我、我所執，亦不聞有隨眠、纏結，亦不聞有顛倒執著，",
        "translation": "Nor do they hear that there is taking in provisions, nor do they hear that there is self or what belongs to self; nor do they hear that there are proclivities and fetters, nor do they hear that there are mistaken attachments.",
        "source": "T06n0220_394:1038b04_0"
    },
    {
        "source_sentence": "亦不聞有安立諸果分位差別，但聞說空、無相、無願、無生、無滅、無性等聲。",
        "translation": "Nor do they hear distinctions in the state of establishing results, but they only hear such sounds as emptiness, signlessness, wishlessness, nonarising, noncessation, and naturelessness.",
        "source": "T06n0220_394:1038b05_1"
    },
    {
        "source_sentence": "謂隨有情所樂差別，於樹林等內外物中，常有微風互相衝擊，發起種種微妙音聲，",
        "translation": "It means that, according to the differences in the inclinations of sentient beings, there are always subtle gusts of wind blowing from trees, forests, and other internal and external objects, producing various subtle sounds.",
        "source": "T06n0220_394:1038b07_2"
    },
    {
        "source_sentence": "彼音聲中說：『一切法皆無自性，無性故空，空故無相，無相故無願，",
        "translation": "In that sound, it's said, 'All things lack self-nature, emptiness because they lack nature, signlessness because they lack characteristics, and wishlessness because they lack characteristics.",
        "source": "T06n0220_394:1038b09_3"
    },
    {
        "source_sentence": "無願故無生，無生故無滅，是故諸法本來寂靜自性涅槃，若佛出世、若不出世法相常爾。』",
        "translation": "Because there's no birth because of wishlessness, there's no arising, and because there's no arising, there's no cessation; therefore, the originally quiescent self-nature of all dharmas is nirvāṇa,",
        "source": "T06n0220_394:1038b10_4"
    },
    {
        "source_sentence": "彼佛土中諸有情類，若晝、若夜、若行、若立、若坐、若臥，常聞如是說法之聲。",
        "translation": "Sentient beings in those buddha lands, whether day or night, walking, standing, sitting, or lying down, always hear the sound of such a teaching.",
        "source": "T06n0220_394:1038b12_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038b14_6"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩各於所住嚴淨佛土證得無上正等覺時，十方如來、應、正等覺皆共稱讚彼彼佛名，",
        "translation": "“When these great enlightening beings each attain supreme perfect enlightenment in the pure buddha-lands where they dwell, the Buddhas of the ten directions praise their names.",
        "source": "T06n0220_394:1038b14_7"
    },
    {
        "source_sentence": "若諸有情得聞如是所讚佛名，定於無上正等菩提得不退轉。",
        "translation": "If sentient beings hear the names of the buddhas praised in this way, they'll surely attain unsurpassed perfect enlightenment without regressing.",
        "source": "T06n0220_394:1038b16_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038b18_9"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩各於所住嚴淨佛土證得無上正等覺時，為諸有情宣說正法，",
        "translation": "“Each of these great enlightening beings, when they attain unexcelled perfect enlightenment in the buddha-lands where they live, teaches the true teaching to sentient beings.",
        "source": "T06n0220_394:1038b18_10"
    },
    {
        "source_sentence": "有情聞已必不生疑，謂為是法、為是非法。",
        "translation": "Sentient beings who hear it will surely not give rise to doubt, saying that it's the Dharma or what's not the Dharma.",
        "source": "T06n0220_394:1038b20_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_394:1038b21_12"
    },
    {
        "source_sentence": "彼有情類了達諸法皆即真如、法界、法性、不虛妄性、不變異性，一切是法無非法者。",
        "translation": "Those sentient beings understand that all dharmas are true, the Dharma realm, the Dharma nature, non-falsity, and unchanging and dissimilar nature, which are all dharmas without anything unlawful.",
        "source": "T06n0220_394:1038b21_13"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1038b23_14"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩皆能嚴淨如是佛土。",
        "translation": "These bodhisattvas, mahāsattvas, can all adorn and purify such a buddha land.",
        "source": "T06n0220_394:1038b23_15"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1038b25_0"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩有所化生具不善根，未於諸佛、菩薩、獨覺及聲聞所種諸善根，",
        "translation": "“Those bodhisattvas, mahāsattvas, who possess the roots of unwholesomeness inherent in their magical creations have not planted the roots of goodness cultivated by buddhas, bodhisattvas, solitary realizers",
        "source": "T06n0220_394:1038b25_1"
    },
    {
        "source_sentence": "為諸惡友所攝受故，離善友故，不聞正法，常為種種我、有情見及諸見趣之所執藏，",
        "translation": "Because they are taken in by bad friends, because they are separated from good friends, they won’t hear the right teaching. They always belong to various kinds of self, views of sentient beings, and doctrines held by those who hold views.",
        "source": "T06n0220_394:1038b27_2"
    },
    {
        "source_sentence": "墮在斷、常二邊偏執。",
        "translation": "They fall into partial attachment to the two extremes of cessation and permanence.",
        "source": "T06n0220_394:1038b28_3"
    },
    {
        "source_sentence": "是諸有情自起邪執，亦常教他令起邪執，於佛起非佛想，於非佛起佛想；",
        "translation": "Sentient beings themselves give rise to erroneous notions, and they also always instruct others to give rise to erroneous notions. They give rise to conceptions of buddhahood regarding buddhas and of what is not buddhahood regarding buddh",
        "source": "T06n0220_394:1038b29_4"
    },
    {
        "source_sentence": "於法起非法想，於非法起法想；",
        "translation": "They give rise to conceptions of things as non-dharma and they give rise to conceptions of things as dharma.",
        "source": "T06n0220_394:1038c02_5"
    },
    {
        "source_sentence": "於僧起非僧想，於非僧起僧想。",
        "translation": "They give rise to conceptions of what's not a monk in the saṃgha, and they give rise to conceptions of a monk in what's not a monk in the saṃgha.",
        "source": "T06n0220_394:1038c02_6"
    },
    {
        "source_sentence": "由是因緣誹毀正法，謗正法故，身壞命終墮諸惡趣，生地獄中受諸劇苦。",
        "translation": "Because of these causes and conditions, they denigrate the right teaching and denigrate the right teaching, and because of denigrating the right teaching, they fall into bad destinies at the end of their life when their body breaks up and they're born in hell",
        "source": "T06n0220_394:1038c03_7"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩各於自土證得無上正等覺已，見彼有情沈淪生死受無量苦，",
        "translation": "“Each of these great enlightening beings, having attained unexcelled perfect enlightenment in their own land, saw those sentient beings who were tormented by the mass of suffering of mundane whirl.",
        "source": "T06n0220_394:1038c05_8"
    },
    {
        "source_sentence": "以神通力方便教化，令捨惡見住正見中，從地獄出生於人趣。",
        "translation": "He teaches and transforms them by means of supernormal powers, causing them to abandon bad views and abide in right views, and he's born from hell into the human destinies.",
        "source": "T06n0220_394:1038c07_0"
    },
    {
        "source_sentence": "生人趣已，復以種種神通方便教化令住正定聚中，由此畢竟不墮惡趣。",
        "translation": "After they're born in the human destinies, they'll again use various miraculous abilities to teach and cause them to abide in the correct concentration group, so they won't fall into bad destinies after all.",
        "source": "T06n0220_394:1038c08_1"
    },
    {
        "source_sentence": "復令修習殊勝行願，命終得生嚴淨佛土，受用淨土大乘法樂。",
        "translation": "He also causes them to cultivate the superior practice of vows, attain birth at the end of their life in the adorned and pure Buddha land, and experience the great vehicle Dharma bliss of the Pure Land.",
        "source": "T06n0220_394:1038c10_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038c11_3"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩皆能如是嚴淨佛土。",
        "translation": "These bodhisattvas, mahāsattvas, and buddhas can thus adorn and purify the Buddha land.",
        "source": "T06n0220_394:1038c11_4"
    },
    {
        "source_sentence": "由所居土極清淨故，生彼有情，於一切法不起虛妄猶豫分別，謂此是世間法，",
        "translation": "Because the land where they live is extremely pure, sentient beings are born there. They do not give rise to false hesitation or discrimination in regard to any doctrine, saying that it is a worldly doctrine.",
        "source": "T06n0220_394:1038c12_5"
    },
    {
        "source_sentence": "此是出世間法；",
        "translation": "This is transmundane dharmas.",
        "source": "T06n0220_394:1038c14_6"
    },
    {
        "source_sentence": "此是有漏法，此是無漏法；",
        "translation": "This is a factor that is tending toward the fluxes but this is an uncontaminated factor.",
        "source": "T06n0220_394:1038c14_7"
    },
    {
        "source_sentence": "此是有為法，此是無為法。",
        "translation": "These are conditioned dharmas, and these are unconditioned dharmas.",
        "source": "T06n0220_394:1038c15_8"
    },
    {
        "source_sentence": "如是種種猶豫分別畢竟不起，由此因緣彼有情類定得無上正等菩提。",
        "translation": "Such various hesitation and discrimination don't arise after all, and because of these causes and conditions, those sentient beings will surely attain unsurpassed perfect enlightenment.",
        "source": "T06n0220_394:1038c15_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1038c17_10"
    },
    {
        "source_sentence": "如是菩薩摩訶薩嚴淨佛土。」",
        "translation": "Thus, the bodhisattva Mahāsattva adorns and purifies the Buddha land.",
        "source": "T06n0220_394:1038c17_11"
    },
    {
        "source_sentence": "初分淨土方便品第七十三之一",
        "translation": "The Seventy-third and One Part of the Chapter on the First Part of the Pure Land of Skillful Means",
        "source": "T06n0220_394:1038c19_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1038c20_0"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩為住正性定聚，為住不定聚耶？」",
        "translation": "Are these bodhisattva-mahāsattvas who abide in the concentration class of righteousness or in the indeterminate class?",
        "source": "T06n0220_394:1038c20_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1038c21_2"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩皆住正性定聚，非不定聚。」",
        "translation": "These bodhisattvas, mahāsattvas, all abide in the concentration group of righteousness, not in the indeterminate group.",
        "source": "T06n0220_394:1038c22_3"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1038c23_4"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩為住何等正性定聚？",
        "translation": "“World-honored One, what are these bodhisattva mahāsattvas who abide in the concentration of righteousness?",
        "source": "T06n0220_394:1038c23_5"
    },
    {
        "source_sentence": "為聲聞乘，為獨覺乘，為佛乘耶？」",
        "translation": "Is it the śrāvaka vehicle, the pratyekabuddha vehicle, or the buddha vehicle?",
        "source": "T06n0220_394:1038c24_6"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1038c25_7"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩皆住佛乘正性定聚，非住二乘正性定聚。」",
        "translation": "These bodhisattvas, mahāsattvas, all abide in the concentration of the true nature of the Buddha vehicle, not in the concentration of the true nature of the two vehicles.",
        "source": "T06n0220_394:1038c25_8"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1038c27_9"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩為何時住正性定聚？",
        "translation": "When do these bodhisattvas, mahāsattvas, and bodhisattvas abide in the aggregate of right-nature concentration?",
        "source": "T06n0220_394:1038c27_10"
    },
    {
        "source_sentence": "初發心耶？",
        "translation": "Is the first arousal of mind?",
        "source": "T06n0220_394:1038c28_11"
    },
    {
        "source_sentence": "不退位耶？",
        "translation": "Is the stage of non-backsliding?",
        "source": "T06n0220_394:1038c28_12"
    },
    {
        "source_sentence": "最後身耶？」",
        "translation": "Is the final body?",
        "source": "T06n0220_394:1038c29_13"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1038c29_14"
    },
    {
        "source_sentence": "是菩薩摩訶薩若初發心、若不退位、若最後身，皆住菩薩正性定聚。」",
        "translation": "Whether it's the first arousal of mind, the stage of nonregression, or the final body, these bodhisattvas and mahāsattvas all abide in the bodhisattva's correctly-natured concentration aggregate.",
        "source": "T06n0220_394:1038c29_15"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1039a02_16"
    },
    {
        "source_sentence": "住正性定聚諸菩薩摩訶薩，為復墮於諸惡趣不？」",
        "translation": "Do bodhisattvas and mahāsattvas who abide in the concentration of righteousness again fall into bad destinies?",
        "source": "T06n0220_394:1039a02_17"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1039a03_18"
    },
    {
        "source_sentence": "住正性定聚諸菩薩摩訶薩，決定不復墮諸惡趣。」",
        "translation": "Those bodhisattvas and mahāsattvas who abide in the concentration of righteousness will surely no longer fall into bad destinies.",
        "source": "T06n0220_394:1039a04_19"
    },
    {
        "source_sentence": "復告善現：「於汝意云何？",
        "translation": "Again, he told Shancheng, What do you think?",
        "source": "T06n0220_394:1039a05_20"
    },
    {
        "source_sentence": "諸第八者、若預流、若一來、若不還、若阿羅漢、若獨覺，為有復墮惡趣者不？」",
        "translation": "Do the eighth, pre-flow, once-returner, nonreturner, arhat, or solitary realizer again fall into a bad destiny?",
        "source": "T06n0220_394:1039a05_21"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_394:1039a07_22"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1039a07_23"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_394:1039a07_24"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T06n0220_394:1039a08_0"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1039a08_1"
    },
    {
        "source_sentence": "住正性定聚諸菩薩摩訶薩亦復如是，決定不復墮諸惡趣。",
        "translation": "So it is with the bodhisattvas, mahāsattvas, and bodhisattvas who abide in the concentration of righteousness, who are certain they won't again fall into bad destinies.",
        "source": "T06n0220_394:1039a08_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_394:1039a09_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1039a09_4"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩從初發心，修行布施波羅蜜多，修行淨戒、安忍、精進、靜慮、般若波羅蜜多；",
        "translation": "“These great enlightening beings, from the first determination for enlightenment, cultivate the perfection of generosity and practice the perfection of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_394:1039a10_0"
    },
    {
        "source_sentence": "安住內空，安住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；",
        "translation": "They abide in internal emptiness, and they abide in external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, immutable",
        "source": "T06n0220_394:1039a12_1"
    },
    {
        "source_sentence": "修行四念住，修行四正斷、四神足、五根、五力、七等覺支、八聖道支；",
        "translation": "He practiced the four abodes of mindfulness, cultivating the fourfold right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_394:1039a15_2"
    },
    {
        "source_sentence": "安住苦聖諦，安住集、滅、道聖諦；",
        "translation": "They abide in the noble truth of suffering and in the noble truths of accumulation, cessation, and the path.",
        "source": "T06n0220_394:1039a17_3"
    },
    {
        "source_sentence": "修行四靜慮，修行四無量、四無色定；",
        "translation": "He practiced the four meditations and cultivated the four immeasurable concentrations and the four formless concentrations.",
        "source": "T06n0220_394:1039a17_4"
    },
    {
        "source_sentence": "修行八解脫，修行八勝處、九次第定、十遍處；",
        "translation": "They develop eight liberations: they develop the eight spheres of mastery, the nine graduated concentrations and the ten universal states.",
        "source": "T06n0220_394:1039a18_5"
    },
    {
        "source_sentence": "修行陀羅尼門，修行三摩地門；",
        "translation": "They cultivate the practice of the door of concentration by means of the door of mental command and the door of concentration by means of the door of concentration.",
        "source": "T06n0220_394:1039a19_6"
    },
    {
        "source_sentence": "修行空解脫門，修行無相、無願解脫門；",
        "translation": "They cultivate the liberation door of emptiness, and they cultivate the liberation door signlessness and wishlessness.",
        "source": "T06n0220_394:1039a20_7"
    },
    {
        "source_sentence": "修行極喜地，修行離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地；",
        "translation": "They cultivate the state of ultimate bliss; they cultivate the state of freedom from defilement, the state of emission of light, the state of blazing wisdom, the state of extreme difficulty overcoming enemies, the state of direct presence",
        "source": "T06n0220_394:1039a21_8"
    },
    {
        "source_sentence": "修行五眼，修行六神通；",
        "translation": "They cultivate the five eyes and practice the six transcendent powers.",
        "source": "T06n0220_394:1039a23_9"
    },
    {
        "source_sentence": "修行佛十力，修行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；",
        "translation": "He practiced the ten powers of buddhahood, practicing the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great relinquishment, and the unique qualities of",
        "source": "T06n0220_394:1039a23_10"
    },
    {
        "source_sentence": "修行無忘失法，修行恒住捨性；",
        "translation": "The practice of enlightening beings is the principle of nonforgetfulness, and their practice is always abiding in equanimity.",
        "source": "T06n0220_394:1039a25_11"
    },
    {
        "source_sentence": "修行一切智，修行道相智、一切相智；",
        "translation": "They cultivate omniscience, they cultivate knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_394:1039a26_12"
    },
    {
        "source_sentence": "修行一切菩薩摩訶薩行，修行諸佛無上正等菩提，伏斷一切惡不善法。",
        "translation": "They cultivate all the bodhisattva-mahāsattva practices, cultivate the buddhas' unsurpassed perfect enlightenment, and subdue all bad and unskillful dharmas.",
        "source": "T06n0220_394:1039a27_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1039a28_14"
    },
    {
        "source_sentence": "由此因緣，是諸菩薩摩訶薩復墮惡趣，無有是處。",
        "translation": "Because of these causes and conditions, there's no place for bodhisattvas, mahāsattvas, to again fall into a bad destiny.",
        "source": "T06n0220_394:1039a28_15"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩若生長壽天，亦無是處，謂於彼處諸勝善法不得現行。",
        "translation": "If these bodhisattvas, mahāsattvas, and gods grow in longevity, there's no place for them, meaning that the excellent good qualities of those places can't be practiced.",
        "source": "T06n0220_394:1039b01_0"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩若生邊鄙，或生達絮、篾戾車中，無有是處，謂於彼處不能修行殊勝善法，",
        "translation": "If these bodhisattvas and mahāsattvas were to be born in the extremes or in the chariots of wickedness, there would be no place for them: they would not be able to practice the supremely good Dharma.",
        "source": "T06n0220_394:1039b02_1"
    },
    {
        "source_sentence": "多起惡見不信因果，常樂習行諸穢惡業，不聞佛名、法名、僧名，亦無四眾，",
        "translation": "They often give rise to bad views and do not believe in the law of cause and effect. They always delight in engaging in impure and unwholesome behavior. They cannot hear the names of buddhas, dharma-names, or Sangha[-",
        "source": "T06n0220_394:1039b04_2"
    },
    {
        "source_sentence": "謂苾芻眾、苾芻尼眾、近事男眾、近事女眾。",
        "translation": "They are the congregation of bhikṣus, the congregation of bhikṣuṇīs, the congregation of bhikṣuṇīs, the congregation that's close to men and the congregation that's close to women.",
        "source": "T06n0220_394:1039b06_3"
    },
    {
        "source_sentence": "是諸菩薩摩訶薩若生邪見家，無有是處，謂生彼家執著種種諸惡見趣，",
        "translation": "If these bodhisattvas and mahāsattvas were to be born in the house of wrong views, there would be no place for them.",
        "source": "T06n0220_394:1039b07_4"
    },
    {
        "source_sentence": "撥無妙行、惡行及果，不修諸善樂作諸惡。",
        "translation": "They deny the absence of marvelous actions, bad actions, and results, and don't cultivate good pleasures or create bad ones.",
        "source": "T06n0220_394:1039b08_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1039b09_6"
    },
    {
        "source_sentence": "初發無上正等覺心，諸菩薩摩訶薩求趣無上正等菩提，以勝意樂受行十種不善業道，",
        "translation": "When they first aroused the mind of unexcelled perfect enlightenment, all the great enlightening beings seeking to attain unsurpassed perfect enlightenment undertook and carried out ten kinds of unwholesome paths of action",
        "source": "T06n0220_394:1039b10_0"
    },
    {
        "source_sentence": "無有是處。」",
        "translation": "There's no such place.",
        "source": "T06n0220_394:1039b12_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1039b13_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩從初發心成就如是善根功德，於諸惡處不復受生，何故世尊每為眾說自本生事若百若千，",
        "translation": "“If great enlightening beings accomplish the virtues of roots of goodness such as these from the first determination for enlightenment, they will no longer be born in evil places. Why does the Bhagavat often explain to sentient beings the things",
        "source": "T06n0220_394:1039b13_1"
    },
    {
        "source_sentence": "於中亦有生諸惡處，爾時善根為何所在？」",
        "translation": "Among them, there are also bad places where birth occurs, so where is the good root at that point?",
        "source": "T06n0220_394:1039b16_2"
    },
    {
        "source_sentence": "佛告善現：「非菩薩摩訶薩由不淨業受惡趣身，但為利樂諸有情類，由故思願而受彼身。",
        "translation": "The Buddha told Shancheng, It's not that the bodhisattva Mahāsattva receives a body in a bad destiny because of impure actions but receives it for the benefit of sentient beings because of their intentions and vows.",
        "source": "T06n0220_394:1039b17_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1039b19_4"
    },
    {
        "source_sentence": "諸阿羅漢、獨覺豈有方便善巧如菩薩摩訶薩，成就如是方便善巧受傍生身，",
        "translation": "Arhats and self-enlightened ones do not have skillful means like the bodhisattva Mahāsattva who accomplishes such skillful means to receive the bodies of unenlightened living beings.",
        "source": "T06n0220_394:1039b19_5"
    },
    {
        "source_sentence": "有獵者來欲為損害，便起無上安忍慈悲，欲令彼人得利樂故，自捨身命而不害彼。",
        "translation": "If a hunter comes and wants to harm them, he gives rise to unsurpassed patience and compassion. Because he wants to cause those people to attain profit and happiness, he abandons his own life and doesn't harm them.",
        "source": "T06n0220_394:1039b20_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1039b22_7"
    },
    {
        "source_sentence": "由是因緣，當知菩薩摩訶薩為欲饒益諸有情故，為大慈悲速圓滿故，雖現受種種傍生之身，",
        "translation": "Because of these causes and conditions, you should know that even though the bodhisattva Mahāsattva manifests to receive various forms of unenlightened sentient beings for the sake of benefiting sentient beings, his great compassion quickly fulfills",
        "source": "T06n0220_394:1039b22_8"
    },
    {
        "source_sentence": "而不為傍生過失所染。」",
        "translation": "They aren't stained by the faults of unenlightened people.",
        "source": "T06n0220_394:1039b25_9"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1039b25_10"
    },
    {
        "source_sentence": "諸菩薩摩訶薩住何善法，為欲利樂諸有情故受如是身？」",
        "translation": "What good dharma do bodhisattvas, mahāsattvas, abide in that they receive such a body for the sake of benefiting sentient beings?",
        "source": "T06n0220_394:1039b26_11"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩有何善法不應圓滿？",
        "translation": "The Buddha told Shancheng, What good qualities do bodhisattvas and mahāsattvas have that shouldn't be perfected?",
        "source": "T06n0220_394:1039b27_12"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1039b28_13"
    },
    {
        "source_sentence": "諸菩薩摩訶薩為得無上正等菩提，一切善法皆應圓滿。",
        "translation": "In order to attain unsurpassed perfect enlightenment, all good qualities should be fulfilled by bodhisattvas and mahāsattvas.",
        "source": "T06n0220_394:1039b28_14"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1039b29_15"
    },
    {
        "source_sentence": "諸菩薩摩訶薩從初發心乃至安坐妙菩提座，於其中間無有善法不應圓滿。",
        "translation": "The bodhisattvas, mahāsattvas, and bodhisattvas from the first arousal of mind up to their peaceful seat on the marvelous seat of enlightenment, have no good qualities among them that shouldn't be",
        "source": "T06n0220_394:1039c01_16"
    },
    {
        "source_sentence": "要具圓滿一切善法，方得無上正等菩提，若一善法未能圓滿，而得無上正等菩提，",
        "translation": "Only when all good qualities are fulfilled can they attain unsurpassed true and complete enlightenment. If one good quality is not fulfilled, they will attain unsurpassed true and complete enlightenment.",
        "source": "T06n0220_394:1039c02_17"
    },
    {
        "source_sentence": "無有是處。",
        "translation": "There's no such place.",
        "source": "T06n0220_394:1039c04_18"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T06n0220_394:1039c04_19"
    },
    {
        "source_sentence": "諸菩薩摩訶薩從初發心乃至安坐妙菩提座，於其中間常學圓滿一切善法，",
        "translation": "“Great enlightening beings, from their first determination for enlightenment until they sit comfortably on the seat of enlightenment, always study and fulfill all good qualities therein.",
        "source": "T06n0220_394:1039c05_20"
    },
    {
        "source_sentence": "學已當得一切相智，永斷一切習氣相續，證得無上正等菩提。」",
        "translation": "After training, he'll attain the knowledge of all characteristics, permanently eliminate all the karmic impressions that continue to arise, and realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_394:1039c06_21"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1039c09_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩成就如是一切白淨聖無漏法，而生惡趣受傍生身？」",
        "translation": "How does a bodhisattva-mahāsattva accomplish all these white, pure, noble, and uncontaminated dharmas that give rise to bad destinies and receive the body of an unenlightened person?",
        "source": "T06n0220_394:1039c09_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1039c11_2"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_394:1039c11_3"
    },
    {
        "source_sentence": "如來成就一切白淨無漏法不？」",
        "translation": "Does the Tathāgata accomplish all white pure and uncontaminated dharmas?",
        "source": "T06n0220_394:1039c11_4"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T06n0220_394:1039c12_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1039c12_6"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_394:1039c12_7"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_394:1039c12_8"
    },
    {
        "source_sentence": "如來成就一切白淨無漏之法。」",
        "translation": "The Tathāgata accomplishes all white, pure, and uncontaminated dharmas.",
        "source": "T06n0220_394:1039c13_9"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1039c13_10"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_394:1039c14_0"
    },
    {
        "source_sentence": "如來化作傍生趣身，饒益有情作佛事不？」",
        "translation": "Does the Tathāgata transform himself into an unenlightened body that serves sentient beings and does buddha-work for them?",
        "source": "T06n0220_394:1039c14_1"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T06n0220_394:1039c15_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1039c15_3"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_394:1039c15_4"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_394:1039c15_5"
    },
    {
        "source_sentence": "如來化作傍生趣身，饒益有情作諸佛事。」",
        "translation": "The Tathāgata transforms into the body of an unenlightened person and creates buddha-works for the benefit of sentient beings.",
        "source": "T06n0220_394:1039c15_6"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_394:1039c16_7"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_394:1039c17_8"
    },
    {
        "source_sentence": "如來化作傍生身時，是實傍生受彼苦不？」",
        "translation": "When the Tathāgata transforms into the body of an unenlightened person, is it really an unenlightened person who experiences that suffering?",
        "source": "T06n0220_394:1039c17_9"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_394:1039c18_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1039c18_11"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_394:1039c18_12"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_394:1039c18_13"
    },
    {
        "source_sentence": "如來化作傍生身時，非實傍生不受彼苦。」",
        "translation": "When the Tathāgata transforms into the body of an unenlightened person, it's not really an unenlightened person who doesn't experience that suffering.",
        "source": "T06n0220_394:1039c18_14"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩亦復如是，雖成就一切白淨無漏法，而為成熟諸有情故，",
        "translation": "The Buddha said to Śaṅgālī, “So it is with the great enlightening beings: even though they have perfected all pure and genuine qualities, yet for the sake of developing sentient beings they do so.",
        "source": "T06n0220_394:1039c19_15"
    },
    {
        "source_sentence": "方便善巧受傍生身，由受彼身如應成熟諸有情類。",
        "translation": "He skillfully and skillfully receives the body of an unenlightened person, and by receiving that body he ripens all sentient beings as they should be.",
        "source": "T06n0220_394:1039c21_16"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1039c22_17"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_394:1039c23_18"
    },
    {
        "source_sentence": "有阿羅漢諸漏永盡，能化作身起諸事業，由彼事業生他喜不？」",
        "translation": "Is there an arhat whose contaminants are permanently extinguished who can transform his body into a body and give rise to actions, and does that action give rise to the joy of others?",
        "source": "T06n0220_394:1039c23_19"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T06n0220_394:1039c24_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1039c25_21"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_394:1039c25_22"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_394:1039c25_23"
    },
    {
        "source_sentence": "有阿羅漢諸漏永盡，能化作身起諸事業，由彼事業令他生喜。」",
        "translation": "An arhat whose contaminants are permanently extinguished can transform his body into a body that produces actions, and because of those actions, he causes others to become joyous.",
        "source": "T06n0220_394:1039c25_24"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩亦復如是，雖成就一切白淨無漏法，而為利樂諸有情故，",
        "translation": "The Buddha told the good manifestation, So it is with the bodhisattvas and mahāsattvas: although they have perfected all pure and genuine uncontaminated dharmas, yet for the benefit of sentient beings they cultivate them.",
        "source": "T06n0220_394:1039c26_25"
    },
    {
        "source_sentence": "方便善巧受惡趣身，如應成熟諸有情類，雖受彼身而不同彼受諸苦惱，",
        "translation": "They skillfully and skillfully receive the bodies of evil destinies, just as they should be matured for all sentient beings. Although they receive those bodies, they are no different from others in terms of suffering and distress.",
        "source": "T06n0220_394:1039c28_26"
    },
    {
        "source_sentence": "亦復不為彼趣過失之所雜染。",
        "translation": "Nor will they be stained by the faults of those destinies.",
        "source": "T06n0220_394:1040a01_27"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_394:1040a02_28"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_394:1040a02_29"
    },
    {
        "source_sentence": "有巧幻師或彼弟子，幻作種種象、馬等事，令諸人見歡喜踊躍，於彼有實象、馬等不？」",
        "translation": "Are there skillful illusionists or disciples who illusorily create various things like elephants and horses that cause people to rejoice and jump for joy when they see them, and are there real elephants, horses, and so forth",
        "source": "T06n0220_394:1040a02_30"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_394:1040a04_31"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1040a04_32"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_394:1040a05_0"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_394:1040a05_1"
    },
    {
        "source_sentence": "於彼實無象、馬等事。」",
        "translation": "They really don't have elephants, horses, or other things like that.",
        "source": "T06n0220_394:1040a05_2"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩亦復如是，雖成就一切白淨無漏法，而為饒益諸有情故，",
        "translation": "The Buddha told the good manifestation, So it is with all the bodhisattva-mahāsattvas who have accomplished all pure and uncontaminated dharmas for the benefit of sentient beings.",
        "source": "T06n0220_394:1040a05_3"
    },
    {
        "source_sentence": "現受種種傍生等身，雖受彼身而實非彼，亦不為彼過所染污。」",
        "translation": "They now experience various kinds of bodies like the bodies of animals and so forth, and even though they experience those bodies, they really aren't them, and they aren't stained by their faults.",
        "source": "T06n0220_394:1040a07_4"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1040a10_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩方便善巧如是廣大，雖成就白淨無漏聖智，而為有情故受種種身，",
        "translation": "“The skillful means of enlightening beings is thus vast: although they have perfected pure, uncontaminated noble knowledge, yet they receive various bodies for the sake of sentient beings.",
        "source": "T06n0220_394:1040a10_1"
    },
    {
        "source_sentence": "隨其所宜現作饒益。",
        "translation": "According to their abilities, they'll be able to give benefit in the present.",
        "source": "T06n0220_394:1040a12_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1040a12_3"
    },
    {
        "source_sentence": "諸菩薩摩訶薩安住何等白淨勝法，能作如是方便善巧，雖受種種傍生等身，",
        "translation": "“What kind of white and pure dharmas does the great enlightening beings abide in? They are able to do so skillfully, even though they experience various forms of unenlightened living beings.",
        "source": "T06n0220_394:1040a13_4"
    },
    {
        "source_sentence": "而不為彼過失所染？」",
        "translation": "They aren't stained by their faults?",
        "source": "T06n0220_394:1040a14_5"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩安住般若波羅蜜多，能作如是方便善巧，雖往十方無量殑伽沙等世界現種種身，",
        "translation": "The Buddha told Shancheng, All bodhisattvas and mahāsattvas who abide in the perfection of wisdom can perform such skillful means to show various bodies even though they go to measureless sands worlds in the ten directions.",
        "source": "T06n0220_394:1040a15_6"
    },
    {
        "source_sentence": "利益安樂彼有情類，而於其中不生染著。",
        "translation": "He benefits and comforts those sentient beings, yet he doesn't become defiled or attached to them.",
        "source": "T06n0220_394:1040a17_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_394:1040a18_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040a18_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切法都無所得，謂都不得能染、所染及染因緣。",
        "translation": "This is a bodhisattva-mahāsattva who has nothing to attain in all dharmas, which means he can't attain the defiled, the defiled, or the causes and conditions for defilement.",
        "source": "T06n0220_394:1040a19_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_394:1040a20_1"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T06n0220_394:1040a20_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040a21_3"
    },
    {
        "source_sentence": "空不能染著空，空亦不能染著餘法，亦無餘法能染著空。",
        "translation": "Emptiness can't defile emptiness, and emptiness can't defile other things, and there are no other things that can defile emptiness.",
        "source": "T06n0220_394:1040a21_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_394:1040a22_5"
    },
    {
        "source_sentence": "空中空性尚不可得，況有餘法而可得者！",
        "translation": "The nature of emptiness in space is still unobtainable, so why wouldn't there be other things that are obtainable?",
        "source": "T06n0220_394:1040a22_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040a23_7"
    },
    {
        "source_sentence": "如是名為不可得空，諸菩薩摩訶薩安住此中，能證無上正等菩提。」",
        "translation": "Such is called unobtainable emptiness, where bodhisattvas, mahāsattvas, and bodhisattvas who abide here can realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_394:1040a23_8"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1040a25_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩為但安住如是般若波羅蜜多，能作如是方便善巧，為亦住餘法耶？」",
        "translation": "Is it because bodhisattvas, mahāsattvas, simply abide in such-and-such prajñāpāramitā and can perform such-and-such skillful means and also abide in other dharmas?",
        "source": "T06n0220_394:1040a26_10"
    },
    {
        "source_sentence": "佛告善現：「豈有餘法不入般若波羅蜜多，云何復疑為住餘法？」",
        "translation": "The Buddha told Shancheng, Is there any other dharma that doesn't enter the perfection of wisdom, so why would you doubt it and abide in other dharmas?",
        "source": "T06n0220_394:1040a27_11"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1040a29_12"
    },
    {
        "source_sentence": "如是般若波羅蜜多若自性空，云何般若波羅蜜多攝一切法？",
        "translation": "Thus, if the self-nature of the prajñāpāramitā is empty, how does the prajñāpāramitā gather all dharmas?",
        "source": "T06n0220_394:1040a29_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1040b01_14"
    },
    {
        "source_sentence": "非於空中可說有法攝與不攝。",
        "translation": "It's not that it can be said in the sky that there are things that are included and those that aren't included.",
        "source": "T06n0220_394:1040b02_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1040b02_1"
    },
    {
        "source_sentence": "豈不諸法自性皆空？」",
        "translation": "Isn't the self-nature of all dharmas empty?",
        "source": "T06n0220_394:1040b02_2"
    },
    {
        "source_sentence": "「如是！",
        "translation": "“So it is!",
        "source": "T06n0220_394:1040b03_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_394:1040b03_4"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_394:1040b03_5"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T06n0220_394:1040b03_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1040b03_7"
    },
    {
        "source_sentence": "若一切法自性皆空，豈不空中攝一切法？」",
        "translation": "If all dharmas are empty by their own nature, isn't it true that all dharmas are included in the sky?",
        "source": "T06n0220_394:1040b03_8"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_394:1040b05_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修行般若波羅蜜多時，住一切法自性空中，引發神通波羅蜜多，",
        "translation": "“How does great enlightening beings, when cultivating the perfection of wisdom, abide in the emptiness of the essential nature of all things and give rise to the perfection of mystic knowledge?",
        "source": "T06n0220_394:1040b05_1"
    },
    {
        "source_sentence": "諸菩薩摩訶薩住是神通波羅蜜多，能往十方無量殑伽沙等世界，供養諸佛聽受正法，",
        "translation": "“When great enlightening beings abide in these transcendent ways, they can go to infinite worlds as numerous as the sands of Ganges in the ten directions to honor the buddhas and hear the Teaching.",
        "source": "T06n0220_394:1040b07_2"
    },
    {
        "source_sentence": "於諸佛所種諸善根？」",
        "translation": "planted good roots in the buddhas?",
        "source": "T06n0220_394:1040b09_3"
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩修行般若波羅蜜多時，遍觀十方無量殑伽沙等世界及諸佛眾并所說法自性皆空，",
        "translation": "The Buddha told Shancheng, Suppose a bodhisattva Mahāsattva cultivates the perfection of prajñāpāramitā and pervades the infinite sands of worlds in the ten directions, the buddha- congregations, and the",
        "source": "T06n0220_394:1040b10_0"
    },
    {
        "source_sentence": "唯有世俗假說名字，如是世俗假說名字亦自性空。",
        "translation": "Only worldly names are provisionally designated, and in the same way that worldly names are provisionally designated, they are also empty by their own nature.",
        "source": "T06n0220_394:1040b12_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040b13_2"
    },
    {
        "source_sentence": "若十方界及諸佛眾并所說法假說名字自性不空，則所說空應不周遍，以所說空非不周遍故，",
        "translation": "If the realms in the ten directions and the congregations of buddhas as well as the doctrines taught are said to have names conventionally expressed that are not empty by their own nature, then what is said to be emptiness would not pervade because",
        "source": "T06n0220_394:1040b13_3"
    },
    {
        "source_sentence": "一切法自性皆空。",
        "translation": "All dharmas are empty of their own nature.",
        "source": "T06n0220_394:1040b16_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1040b16_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多時，由遍觀空方便善巧，便能引發殊勝神通波羅蜜多，",
        "translation": "“When these bodhisattvas and mahāsattvas practice the perfection of wisdom, it is by means of skillful means contemplating emptiness that they are able to give rise to the extraordinary transcendent insights.",
        "source": "T06n0220_394:1040b16_6"
    },
    {
        "source_sentence": "住此神通波羅蜜多，復能引發天眼、天耳、神境、他心、宿住隨念，及知漏盡殊勝通慧。",
        "translation": "He who abides in this perfection of supernormal abilities can also give rise to the divine eye, divine ear, divine objects, other minds, past lives and subsequent thoughts, and superior supernormal wisdom that knows the end of contaminants.",
        "source": "T06n0220_394:1040b18_7"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040b20_8"
    },
    {
        "source_sentence": "諸菩薩摩訶薩非離神通波羅蜜多，有能自在成熟有情、嚴淨佛土，證得無上正等菩提。",
        "translation": "The bodhisattvas, mahāsattvas, aren't free from the perfection of supernormal powers, and there are those who can freely ripen sentient beings and adorn and purify the Buddha land and realize unsurpassed perfect enlightenment",
        "source": "T06n0220_394:1040b20_9"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040b22_10"
    },
    {
        "source_sentence": "是故神通波羅蜜多是菩提道，諸菩薩摩訶薩皆依此道求趣無上正等菩提，",
        "translation": "Therefore, the perfection of supernormal powers is the path of enlightenment, and all great enlightening beings rely on this path to seek supreme perfect enlightenment.",
        "source": "T06n0220_394:1040b22_11"
    },
    {
        "source_sentence": "於求趣時能自圓滿一切善法，亦能令他修諸善法，雖作是事而於善法不生執著。",
        "translation": "When they seek an aim, they can themselves perfect all good qualities and cause others to cultivate good qualities, and even though they do so, they don't become attached to the good qualities.",
        "source": "T06n0220_394:1040b24_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_394:1040b26_13"
    },
    {
        "source_sentence": "是菩薩摩訶薩知諸善法自性皆空，非自性空有所執著，若有執著則有愛味，",
        "translation": "“These great enlightening beings know that the essence of all good qualities is emptiness, and they do not cling to emptiness as an essential nature. If they cling to it, there will be a craving for it.",
        "source": "T06n0220_394:1040b26_14"
    },
    {
        "source_sentence": "由無執著亦無愛味，自性空中無愛味故。",
        "translation": "Because there are no attachments and no tastes of pleasure, because the self-nature has no taste of pleasure in the air.",
        "source": "T06n0220_394:1040b28_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1040c01_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多時，住勝神通波羅蜜多，引發天眼清淨過人，",
        "translation": "When this bodhisattva Mahāsattva cultivates the perfection of prajñāpāramitā, he abides in the perfection of transcendent supernormal powers, producing the pure purity of the divine eye that surpasses humans.",
        "source": "T06n0220_394:1040c01_1"
    },
    {
        "source_sentence": "用是天眼觀一切法皆自性空。",
        "translation": "Using this divine eye, he observes that all dharmas are empty of their own nature.",
        "source": "T06n0220_394:1040c02_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040c03_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩見一切法自性空故，不依法相造作諸業，雖為有情說如是法，",
        "translation": "Because these great enlightening beings see the self-nature of all things as void, they do not create actions based on principles or characteristics. Though they teach such teachings for sentient beings, yet they practice them according to reality.",
        "source": "T06n0220_394:1040c03_4"
    },
    {
        "source_sentence": "而亦不得諸有情相及彼施設。",
        "translation": "They can't obtain the characteristics of sentient beings or their designations.",
        "source": "T06n0220_394:1040c05_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1040c06_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩以無所得而為方便，引發神通波羅蜜多，用是神通波羅蜜多能作悲願神通作事。",
        "translation": "This is the bodhisattva Mahāsattva who uses the ungraspable as a method to give rise to the perfection of supernormal abilities, and using this perfection of supernormal abilities to perform compassionate vows and supernormal deeds",
        "source": "T06n0220_394:1040c06_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1040c08_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩用極清淨過人天眼，能見十方無量殑伽沙等世界，見已引發神境智通，",
        "translation": "“These great enlightening beings use the supremely pure supernormal vision to see infinite buddha-fields as many as there are grains of sand in the ten directions, and having seen them, they give rise to mystical knowledge.",
        "source": "T06n0220_394:1040c08_9"
    },
    {
        "source_sentence": "往彼饒益諸有情類，或以布施波羅蜜多而為饒益，或以淨戒、安忍、精進、靜慮、般若波羅蜜多而為饒益；",
        "translation": "“Great enlightening beings go there to benefit sentient beings, sometimes by means of the perfection of generosity and sometimes by means of the perfection of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_394:1040c10_10"
    },
    {
        "source_sentence": "或以四念住而為饒益，或以四正斷、四神足、五根、五力、七等覺支、八聖道支而為饒益；",
        "translation": "They may be benefited by means of the four abodes of mindfulness, or they may be benefited by means of the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlight",
        "source": "T06n0220_394:1040c13_11"
    },
    {
        "source_sentence": "或以四靜慮而為饒益，或以四無量、四無色定而為饒益；",
        "translation": "They may be benefited by means of the four kinds of meditation, or they may be benefited by means of the four immeasurable concentrations and the four formless concentrations.",
        "source": "T06n0220_394:1040c15_0"
    },
    {
        "source_sentence": "或以八解脫而為饒益，或以八勝處、九次第定、十遍處而為饒益；",
        "translation": "Some I help by means of the eight liberations, and some I help by means of the eight spheres of mastery, the nine graduated concentrations, and the ten universals.",
        "source": "T06n0220_394:1040c16_1"
    },
    {
        "source_sentence": "或以聲聞法而為饒益，或以獨覺法而為饒益，或以菩薩法而為饒益，或以諸佛法而為饒益。",
        "translation": "Some are benefited by the teachings of śrāvakas, some are benefited by the teachings of solitary realizers, some are benefited by the teachings of bodhisattvas, and some are benefited by the teachings of buddhas.",
        "source": "T06n0220_394:1040c17_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1040c19_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩於十方界，若見有情多慳貪者，深生憐愍說如是法：『汝等有情當行布施，",
        "translation": "“Furthermore, the bodhisattva Mahāsattva, seeing that all sentient beings in the ten directions are greedy and stingy, spoke these verses with deep compassion:",
        "source": "T06n0220_394:1040c20_0"
    },
    {
        "source_sentence": "諸慳貪者受貧窮苦，由貧窮故無有威德，尚不自益況能益他！",
        "translation": "Those who are stingy and greedy experience the suffering of poverty, and because they're poor, they lack authoritative qualities, so why wouldn't they benefit themselves or others?",
        "source": "T06n0220_394:1040c22_0"
    },
    {
        "source_sentence": "是故汝等當勤布施，既自安樂亦安樂他，勿以貧窮互相食噉，俱不解脫諸惡趣苦。』",
        "translation": "Therefore, you should diligently give alms, both for your own well-being and for the well-being of others, so that you don't starve each other because they're poor and won't be liberated from the suffering of bad destinies",
        "source": "T06n0220_394:1040c23_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1040c25_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩於十方界，若見有情毀淨戒者，深生憐愍說如是法：『汝等有情當持淨戒，",
        "translation": "“Furthermore, reverend Śāriputra, the bodhisattva Mahāsattva deeply pitying sentient beings who have broken the pure precepts in the ten directions is like this:",
        "source": "T06n0220_394:1040c25_3"
    },
    {
        "source_sentence": "諸破戒者受惡趣苦，破戒之人無有威德，尚不自益況能益他！",
        "translation": "Those who break the precepts are subject to the suffering of bad destinies, and those who break the precepts lack authoritative qualities, so why wouldn't they benefit themselves or others?",
        "source": "T06n0220_394:1040c27_4"
    },
    {
        "source_sentence": "破戒因緣或生地獄受苦異熟，或生傍生受苦異熟，或生鬼界受苦異熟。",
        "translation": "The causes and conditions that break the precepts sometimes cause birth in hell to experience painful retribution, sometimes birth in a siderealm to experience painful retribution, or sometimes birth in the realm of ghosts to experience painful retribution.",
        "source": "T06n0220_394:1040c28_5"
    },
    {
        "source_sentence": "汝等若墮諸惡趣中受苦異熟，尚不自救況能救他！",
        "translation": "If you were to fall into bad destinies and experience the results of suffering, you wouldn't save yourself, so why would you save others?",
        "source": "T06n0220_394:1041a01_6"
    },
    {
        "source_sentence": "是故汝等當持淨戒，不應容納破戒之心經剎那頃，況經多時！",
        "translation": "That's why you should observe pure precepts and not allow the mind that breaks the precepts to go on for an instant, much less for a long time!",
        "source": "T06n0220_394:1041a02_7"
    },
    {
        "source_sentence": "勿縱自心後生憂悔。』",
        "translation": "Don't let your own mind give rise to grief and regret afterwards.'",
        "source": "T06n0220_394:1041a04_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041a04_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩於十方界，若見有情更相瞋忿，展轉結恨互相損惱，深生憐愍說如是法：『汝等有情當修安忍，",
        "translation": "“When great enlightening beings in the ten directions see sentient beings becoming angry and wrathful, harming each other with mutual resentment, they become deeply compassionate and explain this teaching:",
        "source": "T06n0220_394:1041a04_10"
    },
    {
        "source_sentence": "勿相瞋忿結恨相害，諸瞋恨心不順善法，增長惡法招現衰損。",
        "translation": "Don't harm each other with anger, the bond of anger, or the bond of enmity, and their anger and hostility don't go along with good qualities, which increase bad qualities and bring about decline in the present.",
        "source": "T06n0220_394:1041a07_11"
    },
    {
        "source_sentence": "汝等由此瞋恨心故，身壞命終當墮地獄、傍生、鬼界受諸劇苦，是故汝等不應容納瞋恨之心經剎那頃，",
        "translation": "Because of this anger, you will fall into hell, the realm of animals, and the realm of ghosts at the breaking up of the body at death. For this reason you should not allow an angry thought to arise in your minds for as long",
        "source": "T06n0220_394:1041a08_12"
    },
    {
        "source_sentence": "何況令其多時相續！",
        "translation": "How much more so when it's continuous for a long time!",
        "source": "T06n0220_394:1041a10_13"
    },
    {
        "source_sentence": "汝等今者應起慈心，展轉相緣作饒益事。』",
        "translation": "Now, you should give rise to a compassionate mind and work for the benefit of each other in turn.'",
        "source": "T06n0220_394:1041a11_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041a12_15"
    },
    {
        "source_sentence": "是菩薩摩訶薩於十方界，若見有情懶惰懈怠，深生憐愍說如是法：『汝等有情當勤精進，",
        "translation": "“Furthermore, if the bodhisattva Mahāsattva sees sentient beings in the ten directions lazy and indolent, he feels deep compassion for them and teaches them this teaching:",
        "source": "T06n0220_394:1041a12_16"
    },
    {
        "source_sentence": "勿於善法懶惰懈怠，諸懈怠者於諸善法及諸勝事皆不能成。",
        "translation": "Don't lazy and lazy about good qualities, for those who are lazy won't be able to accomplish good qualities or superior things.",
        "source": "T06n0220_394:1041a14_17"
    },
    {
        "source_sentence": "汝等由斯當墮地獄、傍生、鬼界受無量苦，是故汝等不應容納此懈怠心經剎那頃，",
        "translation": "Because of this, you will fall into hell, the realm of animals, and the realm of ghosts. For this reason you should not allow this lazy state of mind to continue for a moment.",
        "source": "T06n0220_394:1041a15_18"
    },
    {
        "source_sentence": "何況令其長時相續！』",
        "translation": "How could it be possible to cause them to continue for a long time?'",
        "source": "T06n0220_394:1041a17_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041a18_20"
    },
    {
        "source_sentence": "是菩薩摩訶薩於十方界，若見有情失念散亂心不寂靜，深生憐愍說如是法：『汝等有情當修靜慮，",
        "translation": "“Furthermore, the bodhisattva Mahāsattva, seeing sentient beings in the world in the ten directions who have lost their mindfulness and are not concentrated, has deep compassion for them and teaches them this teaching:",
        "source": "T06n0220_394:1041a18_21"
    },
    {
        "source_sentence": "勿生失念散亂之心，如是之心不順善法，增長惡法招現衰損。",
        "translation": "Don't give rise to a mind that's distracted by thoughts of loss, such a mind doesn't follow good qualities, increases bad qualities, and invites their present decay.",
        "source": "T06n0220_394:1041a20_22"
    },
    {
        "source_sentence": "汝等由此，身壞命終當墮地獄、傍生、鬼界受無量苦，是故汝等不應容納失念散亂相應之心經剎那頃，",
        "translation": "As a result, you will fall into hell, the realm of animals, and the realm of ghosts at the breaking up of the body at death. That is why you should not allow the thought conjoined with distraction to be sustained for an instant",
        "source": "T06n0220_394:1041a21_23"
    },
    {
        "source_sentence": "何況令其長時相續！』",
        "translation": "How could it be possible to cause them to continue for a long time?'",
        "source": "T06n0220_394:1041a24_24"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041a24_25"
    },
    {
        "source_sentence": "是菩薩摩訶薩於十方界，若見有情愚癡惡慧，深生憐愍說如是法：『汝等有情當修勝慧勿起惡慧，",
        "translation": "“When great enlightening beings see sentient beings in the ten directions who are ignorant of bad wisdom, deeply pitying them, they teach this teaching: ‘You sentient beings should cultivate superior wisdom and not give rise to bad wisdom.",
        "source": "T06n0220_394:1041a24_26"
    },
    {
        "source_sentence": "起惡慧者於諸善趣尚不能往況得解脫！",
        "translation": "Those who give rise to bad wisdom can't go to the good destinies, so why wouldn't they attain liberation?",
        "source": "T06n0220_394:1041a27_27"
    },
    {
        "source_sentence": "汝等由此惡慧因緣，當墮地獄、傍生、鬼界受無量苦，是故汝等不應容納愚癡惡慧相應之心經剎那頃，",
        "translation": "Because of these causes and conditions of bad wisdom, you will fall into hells, unenlightened animals, and the realms of ghosts. For this reason you should not allow a single moment of thought conjoined with ignorance and bad wisdom to pass",
        "source": "T06n0220_394:1041a28_28"
    },
    {
        "source_sentence": "何況令其長時相續！』",
        "translation": "How could it be possible to cause them to continue for a long time?'",
        "source": "T06n0220_394:1041b01_29"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041b01_30"
    },
    {
        "source_sentence": "是菩薩摩訶薩於十方界，若見有情多貪欲者，深生憐愍方便教導，令修不淨觀；",
        "translation": "“When great enlightening beings see sentient beings in the ten directions who are greedy, they develop compassion and skillful means to teach them so that they will cultivate contemplation of impurity.",
        "source": "T06n0220_394:1041b02_0"
    },
    {
        "source_sentence": "若見有情多瞋恚者，深生憐愍方便教導，令修慈悲觀；",
        "translation": "If they see sentient beings with much anger, they are deeply pitying and skillfully teaching them to cultivate the contemplation of kindness and compassion.",
        "source": "T06n0220_394:1041b03_1"
    },
    {
        "source_sentence": "若見有情愚癡多者，深生憐愍方便教導，令修緣起觀；",
        "translation": "If they see sentient beings with much ignorance, they develop deep compassion and skill in means to teach them so that they may cultivate contemplation of dependent origination.",
        "source": "T06n0220_394:1041b05_2"
    },
    {
        "source_sentence": "若見有情我慢多者，深生憐愍方便教導，令修界分別觀；",
        "translation": "If they see sentient beings with much self-conceit, they develop deep compassion and skill in means to teach them so that they may cultivate the contemplation of distinctions in all realms.",
        "source": "T06n0220_394:1041b06_3"
    },
    {
        "source_sentence": "若見有情尋伺多者，深生憐愍方便教導，令修持息念觀；",
        "translation": "If they see sentient beings with much discursive inquiry and examination, they develop deep compassion and skill in means to teach and cause them to cultivate meditation on calming thought.",
        "source": "T06n0220_394:1041b07_4"
    },
    {
        "source_sentence": "若見有情行邪道者，深生憐愍方便教導，令入正道，謂聲聞道、或獨覺道、或如來道，",
        "translation": "If they see sentient beings engaged in wrong paths, they deeply pity them and skillfully teach them to enter the right path—that is, the path of the disciples, the path of the solitary realizers, or the path of the",
        "source": "T06n0220_394:1041b08_5"
    },
    {
        "source_sentence": "方便為彼說如是法：『汝等所執自性皆空，非空法中可有所執，以無所執為空相故。』",
        "translation": "He skillfully explains this teaching for them: 'The self-nature of what you cling to is empty, not something to cling to in the principle of emptiness, because nothing is attached to as the characteristic of emptiness.'",
        "source": "T06n0220_394:1041b10_6"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_394:1041b12_7"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，要住神通波羅蜜多，方能自在宣說正法，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they must abide in the perfection of supernormal powers so that they can freely expound the right teaching.",
        "source": "T06n0220_394:1041b12_8"
    },
    {
        "source_sentence": "利益安樂諸有情類。",
        "translation": "It's for the benefit and welfare of all sentient beings.",
        "source": "T06n0220_394:1041b14_9"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1041b15_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩遠離神通波羅蜜多，不能自在宣說正法，與諸有情作饒益事。",
        "translation": "If a bodhisattva-mahāsattva is far removed from the perfection of supernormal powers, he can't freely proclaim the right teaching and work for the benefit of sentient beings.",
        "source": "T06n0220_394:1041b15_11"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1041b17_0"
    },
    {
        "source_sentence": "如鳥無翅，不能自在飛翔虛空遠有所至，諸菩薩摩訶薩亦復如是，若無神通波羅蜜多，",
        "translation": "Just as a bird has no wings and cannot fly freely through the sky to reach distant places, so also do great enlightening beings lack the transcendent ways of mystic knowledge.",
        "source": "T06n0220_394:1041b17_1"
    },
    {
        "source_sentence": "不能自在宣說正法，與諸有情作饒益事。",
        "translation": "They can't independently proclaim the right teaching and work for the benefit of sentient beings.",
        "source": "T06n0220_394:1041b19_2"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T06n0220_394:1041b20_3"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，應引發神通波羅蜜多，若引發神通波羅蜜多，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they should give rise to the perfection of supernormal powers, and if they give rise to the perfection of supernormal powers,",
        "source": "T06n0220_394:1041b20_4"
    },
    {
        "source_sentence": "則能隨意宣說正法，利益安樂諸有情類。",
        "translation": "They can then teach the right teaching as they wish, benefiting and comforting sentient beings.",
        "source": "T06n0220_394:1041b22_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041b23_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩以最清淨過人天眼，遍觀十方無量殑伽沙等世界，及觀生彼諸有情類，",
        "translation": "“Then the great enlightening being Universally Good, with his supremely pure eye that surpassed all humans and gods, looked out over innumerable worlds as numerous as the sands of the Ganges River in the ten directions and saw the",
        "source": "T06n0220_394:1041b23_7"
    },
    {
        "source_sentence": "見已引發神境智通，經須臾頃往到彼界，以他心智如實了知彼諸有情心、心所法，",
        "translation": "Having seen them, he generates the supernormal knowledge of divine objects. In a moment’s time, going to that realm, he knows in truth the minds and mental states of those sentient beings by means of the knowledge of the minds of others",
        "source": "T06n0220_394:1041b25_8"
    },
    {
        "source_sentence": "隨其所宜為說法要，謂說布施，或說淨戒，或說安忍，或說精進，或說靜慮，",
        "translation": "He teaches them the essentials of the Dharma according to their needs and capacities, teaching them generosity, morality, patience, effort, meditation, and absorption.",
        "source": "T06n0220_394:1041b27_9"
    },
    {
        "source_sentence": "或說般若；",
        "translation": "Sometimes they teach prajñā.",
        "source": "T06n0220_394:1041b28_10"
    },
    {
        "source_sentence": "或說四念住，或說四正斷、四神足、五根、五力、七等覺支、八聖道支；",
        "translation": "Some I elucidate the four abodes of mindfulness, while others explain the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment and the eight noble factors of",
        "source": "T06n0220_394:1041b29_11"
    },
    {
        "source_sentence": "或說四靜慮，或說四無量、四無色定；",
        "translation": "\\",
        "source": "T06n0220_394:1041c01_12"
    },
    {
        "source_sentence": "或說八解脫，或說八勝處、九次第定、十遍處；",
        "translation": "\\",
        "source": "T06n0220_394:1041c02_13"
    },
    {
        "source_sentence": "或說陀羅尼門，或說三摩地門；",
        "translation": "Some I elucidate by means of dhāraṇī teachings, while some elucidate by means of absorptions.",
        "source": "T06n0220_394:1041c03_14"
    },
    {
        "source_sentence": "或說空解脫門，或說無相、無願解脫門；",
        "translation": "Some I elucidate the door of liberation through emptiness, while others I elucidate the door of liberation through signlessness and wishlessness.",
        "source": "T06n0220_394:1041c04_15"
    },
    {
        "source_sentence": "或說內空，或說外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；",
        "translation": "They may teach internal emptiness, or external emptiness, or internal and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, immutable emptiness,",
        "source": "T06n0220_394:1041c05_0"
    },
    {
        "source_sentence": "或說苦聖諦，或說集、滅、道聖諦；",
        "translation": "Some they teach the noble truth of suffering; some teach the noble truths of arising, of cessation and of the path.",
        "source": "T06n0220_394:1041c08_1"
    },
    {
        "source_sentence": "或說因緣，或說等無間緣、所緣緣、增上緣；",
        "translation": "They may speak of causes and conditions, or they may speak of equal and immediately antecedent conditions, condition as object and condition as dominant condition.",
        "source": "T06n0220_394:1041c09_2"
    },
    {
        "source_sentence": "或說從緣所生諸法；",
        "translation": "Some say that all things arise from conditions.",
        "source": "T06n0220_394:1041c10_3"
    },
    {
        "source_sentence": "或說無明，或說行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱；",
        "translation": "Some say ignorance; some say formations, consciousnesses, name-and-form, the six sense-fields, contact, sensation, craving, grasping, existence, birth, old age, sorrow, pain, vexation, suffering",
        "source": "T06n0220_394:1041c10_4"
    },
    {
        "source_sentence": "或說蘊、處、界；",
        "translation": "Or they may speak of aggregates, fields, and realms.",
        "source": "T06n0220_394:1041c12_5"
    },
    {
        "source_sentence": "或說聲聞道，或說獨覺道，或說菩薩道；",
        "translation": "They may teach the path of disciples, the path of individual illuminates, or the path of enlightening beings.",
        "source": "T06n0220_394:1041c12_6"
    },
    {
        "source_sentence": "或說菩提，或說涅槃。",
        "translation": "Some say enlightenment, and some say nirvāṇa.",
        "source": "T06n0220_394:1041c13_7"
    },
    {
        "source_sentence": "令彼有情聞是法已，皆得殊勝利益安樂。",
        "translation": "It causes those sentient beings who hear this teaching to attain superior benefits and well-being.",
        "source": "T06n0220_394:1041c13_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041c14_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩以最清淨過人天耳，能聞一切人非人聲。",
        "translation": "Because this bodhisattva Mahāsattva has the ear that's most pure and transcends humans and gods, he can hear the sounds of all people and non-people.",
        "source": "T06n0220_394:1041c14_10"
    },
    {
        "source_sentence": "由此天耳能聞十方無量殑伽沙等世界諸佛說法，聞已無倒皆能受持，為諸有情如實宣說，",
        "translation": "Through their supernormal hearing they can hear the teachings of buddhas as numerous as the grains of sand in the ten directions. Having heard these teachings, without error they are able to retain them and explain them accurately to sentient beings.",
        "source": "T06n0220_394:1041c16_11"
    },
    {
        "source_sentence": "或說布施，或說淨戒，或說安忍，或說精進，或說靜慮，或說般若，如是乃至或說涅槃，",
        "translation": "They may teach generosity, or pure morality, or patience, or effort, or meditation, or wisdom, and so on, up to nirvana.",
        "source": "T06n0220_394:1041c18_12"
    },
    {
        "source_sentence": "令彼有情聞是法已，皆得殊勝利益安樂。",
        "translation": "It causes those sentient beings who hear this teaching to attain superior benefits and well-being.",
        "source": "T06n0220_394:1041c20_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041c21_14"
    },
    {
        "source_sentence": "是菩薩摩訶薩以最清淨他心智通，如實了知諸有情類心、心所法，隨其所宜為說法要，",
        "translation": "“These great enlightening beings, by means of the superknowledge of purifying others’ minds, truly know the thoughts and mental states of sentient beings and teach them the essentials of truth according to their needs.",
        "source": "T06n0220_394:1041c21_15"
    },
    {
        "source_sentence": "謂說布施，或說淨戒，或說安忍，或說精進，或說靜慮，或說般若，如是乃至或說涅槃，",
        "translation": "They may teach generosity, or they may teach pure morality, or they may teach patience, or they may teach effort, or they may teach meditation, or they may teach wisdom, and so on, up to they may teach nirvana.",
        "source": "T06n0220_394:1041c23_16"
    },
    {
        "source_sentence": "令彼有情聞是法已，皆得殊勝利益安樂。",
        "translation": "It causes those sentient beings who hear this teaching to attain superior benefits and well-being.",
        "source": "T06n0220_394:1041c25_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1041c26_18"
    },
    {
        "source_sentence": "是菩薩摩訶薩以淨宿住隨念智通，能憶自他諸本生事。",
        "translation": "This is the knowledge that the bodhisattva Mahāsattva abides in mindfulness of pure constellations and can remember the past lives of self and others.",
        "source": "T06n0220_394:1041c26_19"
    },
    {
        "source_sentence": "由此宿住隨念智通，如實念知過去諸佛及弟子眾名等差別，若諸有情樂聞過去諸宿住事而得益者，",
        "translation": "Through the supernormal knowledge of knowing past lives as they are, he knows in truth the names and distinctions of past buddhas and their disciples. If sentient beings delight in hearing the stories of past lives to gain benefit them,",
        "source": "T06n0220_394:1041c27_20"
    },
    {
        "source_sentence": "便為宣說諸宿住事，因此方便為說正法，謂說布施，或說淨戒，或說安忍，",
        "translation": "They teach the Dharma by means of skillful means, whether they teach generosity, uphold morality, or practice patience.",
        "source": "T06n0220_394:1041c29_21"
    },
    {
        "source_sentence": "或說精進，或說靜慮，或說般若，如是乃至或說涅槃，令彼有情聞是法已，",
        "translation": "They may teach effort, they may teach meditation, they may teach wisdom, and so on, up to they may teach nirvana, enabling those sentient beings who hear these teachings to do so.",
        "source": "T06n0220_394:1042a02_22"
    },
    {
        "source_sentence": "皆得殊勝利益安樂。",
        "translation": "They'll all attain superior benefits and comfort.",
        "source": "T06n0220_394:1042a04_23"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1042a04_24"
    },
    {
        "source_sentence": "是菩薩摩訶薩以極迅速神境智通，往到十方無量殑伽沙等世界，親近供養諸佛世尊，",
        "translation": "“These great enlightening beings, by means of their superknowledge of the spiritual realm of ultimate speed, go to innumerable worlds as numerous as the sands of the Ganges in the ten directions and become intimate with and honor",
        "source": "T06n0220_394:1042a04_25"
    },
    {
        "source_sentence": "於諸佛所植眾德本還歸本土，為諸有情宣說他方種種勝事，因斯方便為說正法，",
        "translation": "Having planted the roots of virtue cultivated by all buddhas, they return to their native land. For sentient beings they expound various excellent teachings for others. Because of these expedient means they teach the true Dharma.",
        "source": "T06n0220_394:1042a06_26"
    },
    {
        "source_sentence": "謂說布施，或說淨戒，或說安忍，或說精進，或說靜慮，或說般若，如是乃至或說涅槃，",
        "translation": "They may teach generosity, or they may teach pure morality, or they may teach patience, or they may teach effort, or they may teach meditation, or they may teach wisdom, and so on, up to they may teach nirvana.",
        "source": "T06n0220_394:1042a08_27"
    },
    {
        "source_sentence": "令彼有情聞是法已，皆得殊勝利益安樂。",
        "translation": "It causes those sentient beings who hear this teaching to attain superior benefits and well-being.",
        "source": "T06n0220_394:1042a10_28"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1042a11_29"
    },
    {
        "source_sentence": "是菩薩摩訶薩以隨所得漏盡智通，如實了知諸有情類漏盡未盡，亦如實知漏盡方便，",
        "translation": "“These great enlightening beings, by means of the superknowledge of extinction of contaminants that they have attained, truly know all sentient beings’ types of contaminants are extinguished and not yet extinguished, and they",
        "source": "T06n0220_394:1042a11_30"
    },
    {
        "source_sentence": "為未盡者宣說法要，謂說布施，或說淨戒，或說安忍，或說精進，或說靜慮，",
        "translation": "He teaches the essentials of the Dharma to those who have not yet mastered them, by explaining generosity, morality, patience, effort, meditation, and so forth.",
        "source": "T06n0220_394:1042a13_31"
    },
    {
        "source_sentence": "或說般若，如是乃至或說涅槃，令彼有情聞是法已，皆得殊勝利益安樂。",
        "translation": "Sometimes he teaches prajñā, and so forth, or sometimes he teaches nirvāṇa, so that those sentient beings who hear this teaching will all attain superior benefits and peace and happiness.",
        "source": "T06n0220_394:1042a15_32"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_394:1042a17_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，應引發神通波羅蜜多。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they should give rise to the perfection of supernormal abilities.",
        "source": "T06n0220_394:1042a17_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩修習神通波羅蜜多得圓滿故，隨意所樂受種種身，不為苦樂過失所染，",
        "translation": "Because these great enlightening beings cultivate the perfection of transcendent powers, they receive various bodies as they wish without being stained by suffering or pleasure.",
        "source": "T06n0220_394:1042a18_2"
    },
    {
        "source_sentence": "如佛化身雖能施作種種事業，而不為彼苦樂過失之所雜染。",
        "translation": "It's like the Buddha's transformation body that although it can perform various tasks, isn't stained by suffering and happiness or faults.",
        "source": "T06n0220_394:1042a20_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_394:1042a22_4"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，應遊戲神通波羅蜜多，若遊戲神通波羅蜜多，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they should play with the perfection of supernormal powers, and if they play with the perfection of supernormal powers,",
        "source": "T06n0220_394:1042a22_5"
    },
    {
        "source_sentence": "則能成熟有情、嚴淨佛土，速證無上正等菩提。",
        "translation": "Then they'll be able to ripen sentient beings and adorn the Buddha land, quickly realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_394:1042a24_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1042a25_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩不成熟有情、嚴淨佛土，終不能得所求無上正等菩提。",
        "translation": "If bodhisattvas and mahāsattvas don't ripen sentient beings and adorn the Buddha land, they'll never attain the unsurpassed perfect enlightenment that they seek.",
        "source": "T06n0220_394:1042a25_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_394:1042a26_9"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_394:1042a27_10"
    },
    {
        "source_sentence": "諸菩薩摩訶薩菩提資糧若未具者，必不能得所求無上正等菩提。」",
        "translation": "If bodhisattvas, mahāsattvas, and bodhisattvas don't have the accumulation for enlightenment, they won't attain the unsurpassed perfect enlightenment that they seek.",
        "source": "T06n0220_394:1042a27_11"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百九十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 34",
        "source": "T06n0220_394:1042a29_0"
    }
]