[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2, Volume 3",
        "source": "T06n0220_237:0193b09_0"
    },
    {
        "source_sentence": "十七",
        "translation": "17.",
        "source": "T06n0220_237:0193b10_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_237:0193b12_0"
    },
    {
        "source_sentence": "初分難信解品第三十四之五十六",
        "translation": "The Thirty-fourth and Fifty-sixth Chapter of the First Part of the Discourse on the Difficulties of Faith",
        "source": "T06n0220_237:0193b13_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0193b14_0"
    },
    {
        "source_sentence": "大喜清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because great joy is purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193b14_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193b15_2"
    },
    {
        "source_sentence": "若大喜清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193b15_3"
    },
    {
        "source_sentence": "大喜清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "Because great joy is purified, the six supernormal powers are purified, and because the six supernormal powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193b17_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193b18_5"
    },
    {
        "source_sentence": "若大喜清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the six supernormal powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193b18_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0193b20_7"
    },
    {
        "source_sentence": "大喜清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the great joy is purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193b20_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193b21_9"
    },
    {
        "source_sentence": "若大喜清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the Buddha's ten powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193b21_10"
    },
    {
        "source_sentence": "大喜清淨故四無所畏、四無礙解、大慈、大悲、大捨、十八佛不共法清淨，",
        "translation": "Because great joy is purified, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great compassion, great equanimity, and the 18 Buddha-principles are purified.",
        "source": "T06n0220_237:0193b23_11"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "Because the four fearlessnesses and even the 18 distinctive qualities of the buddhas are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193b25_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193b26_1"
    },
    {
        "source_sentence": "若大喜清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the four fearlessnesses and even the 18 Buddha-principles are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193b26_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0193b28_3"
    },
    {
        "source_sentence": "大喜清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because great joy is purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193b28_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c01_5"
    },
    {
        "source_sentence": "若大喜清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the absence of forgetfulness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c01_6"
    },
    {
        "source_sentence": "大喜清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "Because great joy is purified, the nature of constantly abiding equanimity is purified, and because the nature of constantly abiding equanimity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193c02_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c04_8"
    },
    {
        "source_sentence": "若大喜清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the nature of constantly abiding equanimity is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c04_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0193c06_10"
    },
    {
        "source_sentence": "大喜清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because great joy is purified, omniscience is purified, and because omniscience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193c06_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c07_12"
    },
    {
        "source_sentence": "若大喜清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if omniscience is purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c07_13"
    },
    {
        "source_sentence": "大喜清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "Because great joy is purified, knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified, knowledge of all characteristics is purified.",
        "source": "T06n0220_237:0193c09_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c11_15"
    },
    {
        "source_sentence": "若大喜清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if knowledge of the path's characteristics and knowledge of all characteristics are purified, and if knowledge of all characteristics is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c11_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0193c13_17"
    },
    {
        "source_sentence": "大喜清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the great joy is purified, all dhāraṇī aspects are purified, and because all dhāraṇī aspects are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0193c13_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c15_19"
    },
    {
        "source_sentence": "若大喜清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if all dhāraṇī aspects are purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c15_20"
    },
    {
        "source_sentence": "大喜清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "Because the great joy is purified, all the approaches to samādhi are purified, and because all the approaches to samādhi are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0193c17_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c18_22"
    },
    {
        "source_sentence": "若大喜清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if all the approaches to samādhi are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c18_23"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0193c21_0"
    },
    {
        "source_sentence": "大喜清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because the great joy is purified, the fruit of stream-winnership is purified, and because the fruit of stream-winnership is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193c21_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c22_2"
    },
    {
        "source_sentence": "若大喜清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the fruit of pre-flow is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c22_3"
    },
    {
        "source_sentence": "大喜清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "Because the great joy is purified, the once-returner, nonreturner, and arhatship fruits are purified, and because the once-returner, nonreturner, and arhatship fruits are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193c24_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c26_5"
    },
    {
        "source_sentence": "若大喜清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c26_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0193c28_7"
    },
    {
        "source_sentence": "大喜清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because great joy is purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0193c28_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0193c29_9"
    },
    {
        "source_sentence": "若大喜清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if pratyekabuddha's enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0193c29_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194a02_11"
    },
    {
        "source_sentence": "大喜清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the great joy is purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0194a02_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a04_13"
    },
    {
        "source_sentence": "若大喜清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if all bodhisattva-mahāsattva practices are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194a04_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194a06_15"
    },
    {
        "source_sentence": "大喜清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "Because great joy is purified, the buddhas' unsurpassed correct perfect enlightenment is purified, and because the buddhas' unsurpassed correct perfect enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194a06_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a08_17"
    },
    {
        "source_sentence": "若大喜清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great joy is purified, if the buddhas' unsurpassed perfect enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194a08_18"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_237:0194a11_0"
    },
    {
        "source_sentence": "大捨清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194a11_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a12_2"
    },
    {
        "source_sentence": "若大捨清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if form is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194a12_3"
    },
    {
        "source_sentence": "大捨清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0194a14_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a15_5"
    },
    {
        "source_sentence": "若大捨清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194a15_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194a17_7"
    },
    {
        "source_sentence": "大捨清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the locus of the eye is purified, and because the locus of the eye is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194a17_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a18_9"
    },
    {
        "source_sentence": "若大捨清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the sense-field of the eye is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194a19_0"
    },
    {
        "source_sentence": "大捨清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the sense-fields of ear, nose, tongue, body, and mind are purified, and because the sense-fields of ear, nose, tongue, body, and mind are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194a20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a22_2"
    },
    {
        "source_sentence": "若大捨清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great equanimity is purified, if the ear, nose, tongue, body, and mind sense-fields are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194a22_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194a24_4"
    },
    {
        "source_sentence": "大捨清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194a24_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a25_6"
    },
    {
        "source_sentence": "若大捨清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the form realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194a25_7"
    },
    {
        "source_sentence": "大捨清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that the sense-field of sound, smell, taste, touch, and dharmas are purified, and because the sense-field of sound, smell, taste, touch, touch, and dharmas are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0194a27_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194a28_9"
    },
    {
        "source_sentence": "若大捨清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the sense-field of sound, smell, taste, touch, and dharmas are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0194a29_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194b01_11"
    },
    {
        "source_sentence": "大捨清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the eye realm is purified, and because the eye realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194b02_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194b03_13"
    },
    {
        "source_sentence": "若大捨清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the eye realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194b03_14"
    },
    {
        "source_sentence": "大捨清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and because the form realm and even the sensations that arise from eye contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0194b05_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194b07_1"
    },
    {
        "source_sentence": "若大捨清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the form realm and even the sensations that arise from visual contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0194b07_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194b09_3"
    },
    {
        "source_sentence": "大捨清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the ear realm is purified, and because the ear realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194b10_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194b11_1"
    },
    {
        "source_sentence": "若大捨清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the ear realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194b11_2"
    },
    {
        "source_sentence": "大捨清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as a condition are purified, and because the sound realm and even the sensations that arise from ear contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0194b13_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194b15_1"
    },
    {
        "source_sentence": "若大捨清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the sound realm and even the sensations that arise from ear contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0194b15_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194b17_3"
    },
    {
        "source_sentence": "大捨清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the nasal realm is purified, and because the nasal realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194b18_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194b19_1"
    },
    {
        "source_sentence": "若大捨清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the nose realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194b19_2"
    },
    {
        "source_sentence": "大捨清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that the sense element of fragrance, the sense element of nasal consciousness, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and because the sense element of fragrance and even the sensations that arise from nasal contact as a condition are purified that omniscience and cognition",
        "source": "T06n0220_237:0194b20_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194b23_4"
    },
    {
        "source_sentence": "若大捨清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the sense element of fragrance and even the sensations that arise from nasal contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0194b23_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194b25_6"
    },
    {
        "source_sentence": "大捨清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194b25_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194b27_8"
    },
    {
        "source_sentence": "若大捨清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the tongue realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194b27_9"
    },
    {
        "source_sentence": "大捨清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are purified, and because the taste realm and even the sensations that arise from tongue contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0194b28_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c02_11"
    },
    {
        "source_sentence": "若大捨清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0194c02_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194c04_13"
    },
    {
        "source_sentence": "大捨清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the body realm is purified, and because the body realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194c04_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c06_15"
    },
    {
        "source_sentence": "若大捨清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194c06_16"
    },
    {
        "source_sentence": "大捨清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that the contact element, the body consciousness element, and the sensations that arise from body contact and body contact as a condition are purified, and because the contact element and even the sensations that arise from body contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0194c07_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c10_18"
    },
    {
        "source_sentence": "若大捨清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the sense element of touch and even the sensations that arise from bodily contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0194c10_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194c12_20"
    },
    {
        "source_sentence": "大捨清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the mind realm is purified, and because the mind realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194c12_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c14_0"
    },
    {
        "source_sentence": "若大捨清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194c14_1"
    },
    {
        "source_sentence": "大捨清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the great equanimity is purified that the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are purified, and because the Dharma realm and even the sensations that arise from mental contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0194c15_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c18_3"
    },
    {
        "source_sentence": "若大捨清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the Dharma realm and even the sensations that arise from mental contact as a condition are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0194c18_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194c20_5"
    },
    {
        "source_sentence": "大捨清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the earth realm is purified, and because the earth realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194c20_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c21_7"
    },
    {
        "source_sentence": "若大捨清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194c22_8"
    },
    {
        "source_sentence": "大捨清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the water, fire, air, space, and consciousness realms are purified, and because the water, fire, air, space, and consciousness realms are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194c23_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c25_10"
    },
    {
        "source_sentence": "若大捨清淨，若水、火、風、空、識界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if water, fire, air, space, and the consciousness realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194c25_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0194c27_12"
    },
    {
        "source_sentence": "大捨清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, nescience is purified, and because nescience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0194c27_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0194c28_14"
    },
    {
        "source_sentence": "若大捨清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if ignorance is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0194c28_15"
    },
    {
        "source_sentence": "大捨清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，",
        "translation": "Because the great equanimity is purified, form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, attachment, existence, birth, old age, sorrow, pain, and vexation are purified.",
        "source": "T06n0220_237:0195a01_16"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "Because the practice and even old age, sorrow, pain, and vexation are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195a02_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195a04_0"
    },
    {
        "source_sentence": "若大捨清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if practice and even old age, sorrow, pain, and vexation are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0195a04_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195a07_0"
    },
    {
        "source_sentence": "大捨清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the perfection of generosity is purified, and because the perfection of generosity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195a07_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195a08_2"
    },
    {
        "source_sentence": "若大捨清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the perfection of generosity is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195a08_3"
    },
    {
        "source_sentence": "大捨清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because pure morality and even the perfection of wisdom are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195a10_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195a13_5"
    },
    {
        "source_sentence": "若大捨清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the pure precepts and even the perfection of wisdom are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195a13_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195a15_7"
    },
    {
        "source_sentence": "大捨清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195a15_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195a16_9"
    },
    {
        "source_sentence": "若大捨清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195a16_10"
    },
    {
        "source_sentence": "大捨清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，",
        "translation": "Because great equanimity is purified, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all",
        "source": "T06n0220_237:0195a18_11"
    },
    {
        "source_sentence": "外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "Because external emptiness and even the emptiness of the self-nature of nonexistence are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195a22_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195a23_13"
    },
    {
        "source_sentence": "若大捨清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if external emptiness or even the emptiness of the natureless self-nature are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195a23_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195a25_15"
    },
    {
        "source_sentence": "大捨清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, the true nature is purified, and because the true nature is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195a25_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195a26_17"
    },
    {
        "source_sentence": "若大捨清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the true nature is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195a26_18"
    },
    {
        "source_sentence": "大捨清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，",
        "translation": "Because the great equanimity is purified, the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, space, and inconceivable realms are purified.",
        "source": "T06n0220_237:0195a28_19"
    },
    {
        "source_sentence": "法界乃至不思議界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm and even the inconceivable realm are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b01_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b02_21"
    },
    {
        "source_sentence": "若大捨清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great equanimity is purified, if the Dharma realm and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b02_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195b04_23"
    },
    {
        "source_sentence": "大捨清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b04_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b05_25"
    },
    {
        "source_sentence": "若大捨清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the noble truth of suffering is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b06_26"
    },
    {
        "source_sentence": "大捨清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the noble truths of arising, ceasing, and the path are purified, and because the noble truths of arising, ceasing, and the path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b07_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b09_28"
    },
    {
        "source_sentence": "若大捨清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the noble truths of arising, cessation, and the path are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b09_29"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195b11_30"
    },
    {
        "source_sentence": "大捨清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b11_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b12_32"
    },
    {
        "source_sentence": "若大捨清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the four meditations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b12_33"
    },
    {
        "source_sentence": "大捨清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b14_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b16_35"
    },
    {
        "source_sentence": "若大捨清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the four immeasurable and four formless concentrations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b16_36"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195b18_37"
    },
    {
        "source_sentence": "大捨清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b18_38"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b19_39"
    },
    {
        "source_sentence": "若大捨清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the eight liberations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b19_40"
    },
    {
        "source_sentence": "大捨清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b21_41"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b23_42"
    },
    {
        "source_sentence": "若大捨清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b23_43"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195b25_44"
    },
    {
        "source_sentence": "大捨清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195b25_45"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195b27_46"
    },
    {
        "source_sentence": "若大捨清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the four abodes of mindfulness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195b27_47"
    },
    {
        "source_sentence": "大捨清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "Because great relinquishment is purified, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified.",
        "source": "T06n0220_237:0195b29_48"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "Because the fourfold correct elimination and even the eightfold noble path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c01_49"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c02_50"
    },
    {
        "source_sentence": "若大捨清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the fourfold correct elimination and even the eightfold noble path are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c02_51"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195c04_52"
    },
    {
        "source_sentence": "大捨清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the gate of liberation through emptiness is purified, and because the gate of liberation through emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c05_53"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c06_54"
    },
    {
        "source_sentence": "若大捨清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great equanimity is purified, if the liberation gate of emptiness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c06_55"
    },
    {
        "source_sentence": "大捨清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the liberation gate of marklessness and wishlessness is purified, and because the liberation gate of marklessness and wishlessness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c08_56"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c10_57"
    },
    {
        "source_sentence": "若大捨清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great equanimity is purified, if the liberation gate of marklessness and wishlessness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c10_58"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195c12_59"
    },
    {
        "source_sentence": "大捨清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the bodhisattva's ten stages are purified, and because the bodhisattva's ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c12_60"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c13_61"
    },
    {
        "source_sentence": "若大捨清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the bodhisattva's ten stages are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c13_62"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195c16_0"
    },
    {
        "source_sentence": "大捨清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c16_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c17_2"
    },
    {
        "source_sentence": "若大捨清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c17_3"
    },
    {
        "source_sentence": "大捨清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the six supernormal powers are purified, and because the six supernormal powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c19_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c20_5"
    },
    {
        "source_sentence": "若大捨清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the six supernormal powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c20_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0195c22_7"
    },
    {
        "source_sentence": "大捨清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c22_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c23_9"
    },
    {
        "source_sentence": "若大捨清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the Buddha's ten powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c23_10"
    },
    {
        "source_sentence": "大捨清淨故四無所畏、四無礙解、大慈、大悲、大喜、十八佛不共法清淨，",
        "translation": "Because great equanimity is purified, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, and the 18 Buddha-principles are purified.",
        "source": "T06n0220_237:0195c25_11"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "Because the four fearlessnesses and even the 18 distinctive qualities of the buddhas are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0195c27_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0195c28_1"
    },
    {
        "source_sentence": "若大捨清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the four fearlessnesses and even the 18 Buddha-principles are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0195c28_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196a01_3"
    },
    {
        "source_sentence": "大捨清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196a01_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a03_5"
    },
    {
        "source_sentence": "若大捨清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the absence of forgetfulness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a03_6"
    },
    {
        "source_sentence": "大捨清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, the nature of constantly abiding equanimity is purified, and because the nature of constantly abiding equanimity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196a04_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a06_8"
    },
    {
        "source_sentence": "若大捨清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the nature of constantly abiding equanimity is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a06_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196a08_10"
    },
    {
        "source_sentence": "大捨清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, omniscience is purified, and because omniscience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196a08_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a09_12"
    },
    {
        "source_sentence": "若大捨清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if omniscience is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a09_13"
    },
    {
        "source_sentence": "大捨清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified, knowledge of all characteristics is purified.",
        "source": "T06n0220_237:0196a11_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a13_15"
    },
    {
        "source_sentence": "若大捨清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if knowledge of the path's characteristics and knowledge of all characteristics are purified, and if knowledge of all characteristics is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a13_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196a15_17"
    },
    {
        "source_sentence": "大捨清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, all dhāraṇī aspects are purified, and because all dhāraṇī aspects are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0196a15_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a17_0"
    },
    {
        "source_sentence": "若大捨清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if all dhāraṇī aspects are purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a17_1"
    },
    {
        "source_sentence": "大捨清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, all the approaches to samādhi are purified, and because all the approaches to samādhi are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0196a19_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a20_1"
    },
    {
        "source_sentence": "若大捨清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great equanimity is purified, if all the approaches to samādhi are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a20_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196a23_0"
    },
    {
        "source_sentence": "大捨清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the fruit of stream-winnership is purified, and because the fruit of stream-winnership is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196a23_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a24_2"
    },
    {
        "source_sentence": "若大捨清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the fruit of pre-flow is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a24_3"
    },
    {
        "source_sentence": "大捨清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, the once-returner, nonreturner, and arhatship fruits are purified, and because the once-returner, nonreturner, and arhatship fruits are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196a26_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196a28_5"
    },
    {
        "source_sentence": "若大捨清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196a28_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196b01_7"
    },
    {
        "source_sentence": "大捨清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196b01_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b02_9"
    },
    {
        "source_sentence": "若大捨清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if pratyekabuddha's enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b02_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196b04_11"
    },
    {
        "source_sentence": "大捨清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the great equanimity is purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0196b04_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b06_13"
    },
    {
        "source_sentence": "若大捨清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if all bodhisattva-mahāsattva practices are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b06_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196b08_15"
    },
    {
        "source_sentence": "大捨清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "Because great equanimity is purified, the buddhas' unsurpassed correct perfect enlightenment is purified, and because the buddhas' unsurpassed correct perfect enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196b08_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b10_17"
    },
    {
        "source_sentence": "若大捨清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great equanimity is purified, if the buddhas' unsurpassed perfect enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b10_18"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_237:0196b13_0"
    },
    {
        "source_sentence": "十八佛不共法清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196b13_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b14_2"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if form is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b14_3"
    },
    {
        "source_sentence": "十八佛不共法清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, and consciousness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196b16_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b18_5"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b18_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196b20_7"
    },
    {
        "source_sentence": "十八佛不共法清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, the locus of the eye is purified, and because the locus of the eye is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196b20_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b21_9"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the eye field is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b21_10"
    },
    {
        "source_sentence": "十八佛不共法清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "It's because the ear, nose, tongue, body, and mind sense-fields are purified because the eighteen Buddha-principles are purified that the ear, nose, tongue, body, and mind sense-fields are purified, and because the ear, nose, tongue, body, and mind sense-fields are purified that omniscience and cognition are pur",
        "source": "T06n0220_237:0196b23_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b25_12"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，",
        "translation": "If the eighteen unique qualities of buddhas are purified, if the ear, nose, tongue, body, and mind realms are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0196b25_13"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b27_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196b27_15"
    },
    {
        "source_sentence": "十八佛不共法清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196b27_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196b29_17"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the form realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196b29_18"
    },
    {
        "source_sentence": "十八佛不共法清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "It's because the eighteen Buddha-principles are purified that the sound, odor, taste, touch, and dharma fields are purified, and because the sound, odor, taste, touch, and dharma fields are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0196c02_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196c04_20"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，",
        "translation": "If the eighteen unique qualities of buddhas are purified, if their sounds, smells, tastes, touch, and dharmas are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0196c04_21"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196c05_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196c06_23"
    },
    {
        "source_sentence": "十八佛不共法清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the eye realm is purified, and because the eye realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196c06_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196c08_0"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the eye realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196c08_1"
    },
    {
        "source_sentence": "十八佛不共法清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the eighteen Buddha-uncommon dharmas are purified that the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and because the form realm and even the sensations that arise from eye contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0196c10_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196c12_3"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the form realm and even the sensations that arise from visual contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0196c13_4"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196c14_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196c15_6"
    },
    {
        "source_sentence": "十八佛不共法清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because the ear realm is purified because the eighteen Buddha-principles are purified, the ear realm is purified, and because the ear realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196c15_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196c17_0"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the ear realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196c17_1"
    },
    {
        "source_sentence": "十八佛不共法清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the eighteen Buddha-uncommon dharmas are purified that the sound element, the ear realm, the ear consciousness element, and the sensations that arise from ear contact and ear contact as a condition are purified, and because the sound element and even the sensations that arise from ear contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0196c19_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196c21_1"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the sound realm and even the sensations that arise from ear contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0196c21_2"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196c23_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0196c24_4"
    },
    {
        "source_sentence": "十八佛不共法清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the nasal realm is purified, and because the nasal realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0196c24_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0196c26_0"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the nose realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0196c26_1"
    },
    {
        "source_sentence": "十八佛不共法清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the 18 Buddha-uncommon dharmas are purified that the sense element of fragrance, the sense element of nose consciousness, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and because the sense element of fragrance and even the sensations that arise from nasal contact as a condition are purified that omni",
        "source": "T06n0220_237:0196c28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197a01_1"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the sense element of fragrance and even the sensations that arise from nasal contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0197a01_2"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197a03_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197a04_4"
    },
    {
        "source_sentence": "十八佛不共法清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197a04_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197a05_6"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the tongue realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197a06_0"
    },
    {
        "source_sentence": "十八佛不共法清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the taste realm, the tongue consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are purified because the eighteen Buddha-uncommon dharmas are purified, and it's because the taste realm and even the sensations that arise from tongue contact as a condition are purified that omniscience and cognitio",
        "source": "T06n0220_237:0197a07_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197a10_2"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0197a10_3"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197a12_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197a13_5"
    },
    {
        "source_sentence": "十八佛不共法清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the body realm is purified, and because the body realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197a13_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197a14_7"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197a14_8"
    },
    {
        "source_sentence": "十八佛不共法清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the eighteen Buddha-uncommon dharmas are purified that the sense element of touch, the body and consciousness realms, and the sensations that arise from body contact and body contact as a condition are purified, and because the sense element of touch and even the sensations that arise from body contact as a condition are purified that omniscience and cognition are purified",
        "source": "T06n0220_237:0197a16_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197a19_10"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the sense element of touch and even the sensations that arise from bodily contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0197a19_11"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197a21_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197a22_13"
    },
    {
        "source_sentence": "十八佛不共法清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the mental realm is purified, and because the mental realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197a22_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197a23_15"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197a23_16"
    },
    {
        "source_sentence": "十八佛不共法清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the Dharma realm, the realm of consciousness, and the sensations that arise from mental contact and mental contact as a condition are purified, and because the Dharma realm and even the sensations that arise from mental contact as a condition are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197a25_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197a28_18"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the Dharma realm and even the sensations that arise from mental contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0197a28_19"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b01_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197b01_21"
    },
    {
        "source_sentence": "十八佛不共法清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the earth realm is purified, and because the earth realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197b02_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197b03_1"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b03_2"
    },
    {
        "source_sentence": "十八佛不共法清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "It's because the 18 Buddha-principles are purified that the water, fire, air, space, and consciousness realms are purified, and because the water, fire, air, space, space, and consciousness realms are purified that omniscience and cognition are purified.",
        "source": "T06n0220_237:0197b05_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197b07_4"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若水、火、風、空、識界清淨，若一切智智清淨，",
        "translation": "If the eighteen unique qualities of buddhas are purified, if water, fire, wind, air, space, and the consciousness realm are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0197b07_5"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b09_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197b09_1"
    },
    {
        "source_sentence": "十八佛不共法清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, nescience is purified, and because nescience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197b09_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197b11_3"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if ignorance is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b11_4"
    },
    {
        "source_sentence": "十八佛不共法清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，",
        "translation": "Because the eighteen unique qualities of buddhas are purified, form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, vexation, and grief are purified.",
        "source": "T06n0220_237:0197b13_5"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "Because the practice and even old age, sorrow, pain, and vexation are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197b14_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197b15_7"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，",
        "translation": "If the eighteen Buddha-uncommon dharmas are purified, if practice and even old age, sorrow, pain, vexation, and vexation are purified, and if omniscience and knowledge are purified,",
        "source": "T06n0220_237:0197b16_8"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b17_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197b19_0"
    },
    {
        "source_sentence": "十八佛不共法清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the perfection of generosity is purified, and because the perfection of generosity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197b19_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197b21_0"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the perfection of generosity is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b21_1"
    },
    {
        "source_sentence": "十八佛不共法清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because pure morality and even the perfection of wisdom are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197b23_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197b25_3"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the pure precepts and even the perfection of wisdom are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0197b26_0"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b27_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197b28_2"
    },
    {
        "source_sentence": "十八佛不共法清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197b28_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197b29_4"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197b29_5"
    },
    {
        "source_sentence": "十八佛不共法清淨故外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified because external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics, emp",
        "source": "T06n0220_237:0197c02_6"
    },
    {
        "source_sentence": "外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "Because external emptiness and even the emptiness of the self-nature of nonexistence are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197c06_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197c07_8"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若外空乃至無性自性空清淨，若一切智智清淨，",
        "translation": "If the eighteen Buddha-uncommon dharmas are purified, if external emptiness or even emptiness of the natureless self-nature is purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0197c08_0"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197c09_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197c10_2"
    },
    {
        "source_sentence": "十八佛不共法清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the true nature is purified, and because the true nature is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197c10_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197c11_4"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the true nature is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197c12_5"
    },
    {
        "source_sentence": "十八佛不共法清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, space, and inconceivable realms are purified.",
        "source": "T06n0220_237:0197c13_6"
    },
    {
        "source_sentence": "法界乃至不思議界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm and even the inconceivable realm are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197c16_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197c17_8"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the Dharma realm and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197c17_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197c19_10"
    },
    {
        "source_sentence": "十八佛不共法清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197c19_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197c21_12"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the noble truth of suffering is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197c21_13"
    },
    {
        "source_sentence": "十八佛不共法清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, the noble truths of arising, ceasing, and the path are purified, and because the noble truths of arising, ceasing, and the path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197c23_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197c25_15"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the noble truths of arising, ceasing, and the path are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197c25_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0197c27_17"
    },
    {
        "source_sentence": "十八佛不共法清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0197c27_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0197c29_19"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the four meditations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0197c29_20"
    },
    {
        "source_sentence": "十八佛不共法清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198a01_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198a03_22"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the four immeasurable and four formless concentrations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198a03_23"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198a05_24"
    },
    {
        "source_sentence": "十八佛不共法清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198a05_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198a07_26"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the eight liberations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198a07_27"
    },
    {
        "source_sentence": "十八佛不共法清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198a09_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198a11_29"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，",
        "translation": "If the eighteen Buddha-uncommon dharmas are purified, if the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and if omniscience and knowledge are purified,",
        "source": "T06n0220_237:0198a11_30"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198a13_31"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198a14_32"
    },
    {
        "source_sentence": "十八佛不共法清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because the four abodes of mindfulness are purified because the eighteen Buddha-principles are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198a14_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198a15_34"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the four abodes of mindfulness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198a15_35"
    },
    {
        "source_sentence": "十八佛不共法清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "Because the eighteen Buddha unique qualities are purified, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified.",
        "source": "T06n0220_237:0198a17_36"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "Because the fourfold correct elimination and even the eightfold noble path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198a19_37"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198a20_38"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，",
        "translation": "If the eighteen Buddha-uncommon dharmas are purified, if the fourfold correct elimination or even the eightfold noble path is purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_237:0198a20_39"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198a22_40"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198a22_41"
    },
    {
        "source_sentence": "十八佛不共法清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the gate of liberation through emptiness is purified, and because the gate of liberation through emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198a23_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198a24_1"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the liberation gate of emptiness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198a24_2"
    },
    {
        "source_sentence": "十八佛不共法清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the liberation gate of marklessness and wishlessness is purified, and because the liberation gate of marklessness and wishlessness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198a26_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198a28_4"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the liberation gate of marklessness and wishlessness is purified, and if the knowledge of all things is purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_237:0198a28_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198b02_6"
    },
    {
        "source_sentence": "十八佛不共法清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the bodhisattva's ten stages are purified, and because the bodhisattva's ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198b02_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198b03_8"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the bodhisattva's ten stages are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198b04_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198b06_0"
    },
    {
        "source_sentence": "十八佛不共法清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198b06_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198b07_2"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198b07_3"
    },
    {
        "source_sentence": "十八佛不共法清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, the six supernormal powers are purified, and because the six supernormal powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198b09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198b11_5"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the six supernormal powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198b11_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198b13_7"
    },
    {
        "source_sentence": "十八佛不共法清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198b13_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198b14_9"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the Buddha's ten powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198b14_10"
    },
    {
        "source_sentence": "十八佛不共法清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨清淨，",
        "translation": "Because the eighteen Buddha unique qualities are purified, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, and great equanimity are purified.",
        "source": "T06n0220_237:0198b16_11"
    },
    {
        "source_sentence": "四無所畏乃至大捨清淨故一切智智清淨。",
        "translation": "Because the four fearlessnesses and even the great equanimity are purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198b18_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198b19_13"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若四無所畏乃至大捨清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the four fearlessnesses and even great equanimity are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198b19_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198b21_15"
    },
    {
        "source_sentence": "十八佛不共法清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198b21_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198b23_17"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-principles are purified, if the principle of nonforgetfulness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198b23_18"
    },
    {
        "source_sentence": "十八佛不共法清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-uncommon dharmas are purified, the nature of constantly abiding equanimity is purified, and because the nature of constantly abiding equanimity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_237:0198b25_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198b27_20"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if the nature of constantly abiding equanimity is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198b27_21"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198b29_22"
    },
    {
        "source_sentence": "十八佛不共法清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, omniscience is purified, and because omniscience is purified, omniscience and knowledge are purified.",
        "source": "T06n0220_237:0198b29_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198c02_24"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if omniscience is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198c02_25"
    },
    {
        "source_sentence": "十八佛不共法清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles are purified, knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified, knowledge of all characteristics is purified.",
        "source": "T06n0220_237:0198c04_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198c06_27"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if knowledge of the path's characteristics and knowledge of all characteristics are purified, and if knowledge of all characteristics is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198c06_28"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_237:0198c08_29"
    },
    {
        "source_sentence": "十八佛不共法清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the 18 Buddha-uncommon dharmas are purified, all dhāraṇī aspects are purified, and because all dhāraṇī aspects are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0198c08_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198c10_31"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if all dhāraṇī aspects are purified, and if all cognition is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198c10_32"
    },
    {
        "source_sentence": "十八佛不共法清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "Because the eighteen Buddha-principles of uncommon dharmas are purified, all samādhi aspects are purified, and because all samādhi aspects are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_237:0198c12_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_237:0198c14_34"
    },
    {
        "source_sentence": "若十八佛不共法清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the 18 Buddha-uncommon dharmas are purified, if all the approaches to samādhi are purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_237:0198c14_35"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百三十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2, Volume 37",
        "source": "T06n0220_237:0198c17_0"
    }
]