[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百二",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 2",
        "source": "T06n0220_328:0677b07_0"
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T06n0220_328:0677b08_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_328:0677b10_0"
    },
    {
        "source_sentence": "初分巧方便品第五十之一",
        "translation": "Chapter Fifty-first of the Skillful Means of the First Part",
        "source": "T06n0220_328:0677b11_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_328:0677b12_0"
    },
    {
        "source_sentence": "是不退轉位菩薩摩訶薩成就廣大勝功德聚。",
        "translation": "The bodhisattva Mahāsattva in the stage of nonretrogression accomplishes a vast stock of superior merit.",
        "source": "T06n0220_328:0677b12_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0677b13_2"
    },
    {
        "source_sentence": "是不退轉位菩薩摩訶薩成就無量勝功德聚。",
        "translation": "In the stage of nonretrogression, the bodhisattva Mahāsattva accomplishes an immeasurable stock of superior merit.",
        "source": "T06n0220_328:0677b13_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0677b14_4"
    },
    {
        "source_sentence": "是不退轉位菩薩摩訶薩成就無邊勝功德聚。",
        "translation": "The bodhisattva Mahāsattva in the stage of nonretrogression accomplishes an infinite stock of superior merit.",
        "source": "T06n0220_328:0677b15_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0677b16_1"
    },
    {
        "source_sentence": "是不退轉位菩薩摩訶薩成就無數不可思議勝功德聚。」",
        "translation": "The bodhisattva-mahāsattva in the stage of nonretrogression accomplishes an incalculable, inconceivable stock of merit.",
        "source": "T06n0220_328:0677b16_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_328:0677b17_3"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_328:0677b17_4"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_328:0677b17_5"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_328:0677b17_6"
    },
    {
        "source_sentence": "是不退轉位菩薩摩訶薩成就廣大、無量、無邊、不可數、難思議勝功德聚。",
        "translation": "In the stage of nonretrogression, the bodhisattva Mahāsattva accomplishes a vast, immeasurable, limitless, uncountable, and inconceivably superior stock of merit.",
        "source": "T06n0220_328:0677b18_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_328:0677b19_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_328:0677b20_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩已得廣大、無量、無邊、不可數、難思議不共聲聞及獨覺智，",
        "translation": "“These great enlightening beings have already attained vast, immeasurable, boundless, incalculable, inconceivable, unique knowledge of buddhas and individual illuminates.",
        "source": "T06n0220_328:0677b20_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩住此智中，引發殊勝四無礙解。",
        "translation": "These bodhisattvas, mahāsattvas, abide in this knowledge and give rise to the most excellent of the four unhindered understandings.",
        "source": "T06n0220_328:0677b21_2"
    },
    {
        "source_sentence": "由此殊勝四無礙解，世間天、人、阿素洛等無能問難，令此菩薩智慧辯才至窮盡者。」",
        "translation": "Because of these extraordinary four unhindered understandings, worldly gods, humans, asuras, and so forth can't ask questions that will cause this bodhisattva's wisdom and eloquence to reach their limit.",
        "source": "T06n0220_328:0677b22_3"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_328:0677b24_4"
    },
    {
        "source_sentence": "能如殑伽沙劫說不退轉位菩薩摩訶薩諸行、狀、相，由此所說諸行、狀、相，",
        "translation": "“The practices, forms, and characteristics of the bodhisattva mahāsattva who teaches the stage of nonretrogression for as many eons as there are grains of sand in the Ganges River. Because of these practices, form",
        "source": "T06n0220_328:0677b25_5"
    },
    {
        "source_sentence": "顯不退轉位菩薩摩訶薩成就種種殊勝功德。",
        "translation": "It shows that the bodhisattva Mahāsattva in the stage of nonretrogression has accomplished various extraordinary merits.",
        "source": "T06n0220_328:0677b26_6"
    },
    {
        "source_sentence": "唯願如來、應、正等覺，復為菩薩說甚深處，令諸菩薩安住其中，能修布施波羅蜜多令速圓滿，",
        "translation": "“O great enlightening beings! May the Buddha, the Arhat, and the Perfectly Enlightened One further expound this profound teaching to enlightening beings, so that they may abide therein and be able to practice the transcendent giving",
        "source": "T06n0220_328:0677b28_0"
    },
    {
        "source_sentence": "能修淨戒、安忍、精進、靜慮、般若波羅蜜多令速圓滿；",
        "translation": "They can cultivate pure morality, patience, effort, meditation, and the perfection of wisdom, causing them to be quickly perfected.",
        "source": "T06n0220_328:0677c01_1"
    },
    {
        "source_sentence": "能住內空令速圓滿，能住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空令速圓滿；",
        "translation": "They can abide in internal emptiness and cause it to be quickly perfected; they can abide in external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, di",
        "source": "T06n0220_328:0677c02_2"
    },
    {
        "source_sentence": "能住真如令速圓滿，能住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界令速圓滿；",
        "translation": "They can abide in the realm of reality and cause it to be quickly perfected; they can abide in the realm of reality, the nature of reality, non-falsity, unchanging and dissimilarity, equality, freedom from birth,",
        "source": "T06n0220_328:0677c06_3"
    },
    {
        "source_sentence": "能修四念住令速圓滿，能修四正斷、四神足、五根、五力、七等覺支、八聖道支令速圓滿；",
        "translation": "They can cultivate the four abodes of mindfulness in order to quickly perfect them. They can cultivate the fourfold correct elimination, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the",
        "source": "T06n0220_328:0677c08_4"
    },
    {
        "source_sentence": "能住苦聖諦令速圓滿，能住集、滅、道聖諦令速圓滿；",
        "translation": "They can abide in the noble truth of suffering and cause their swift fulfillment; they can abide in the noble truths of accumulation, cessation, and the path and cause their swift fulfillment.",
        "source": "T06n0220_328:0677c10_5"
    },
    {
        "source_sentence": "能修四靜慮令速圓滿，能修四無量、四無色定令速圓滿；",
        "translation": "They are able to cultivate four kinds of meditative absorptions so as to bring about their swift fulfillment. They are able to cultivate the four immeasurable concentrations and the four formless concentrations so as to bring about their swi",
        "source": "T06n0220_328:0677c12_6"
    },
    {
        "source_sentence": "能修八解脫令速圓滿，能修八勝處、九次第定、十遍處令速圓滿；",
        "translation": "They can cultivate eight liberations in order to quickly perfect them. They can cultivate eight spheres of mastery, nine graduated concentrations, and ten universals in order to quickly perfect them.",
        "source": "T06n0220_328:0677c13_7"
    },
    {
        "source_sentence": "能修空解脫門令速圓滿，能修無相、無願解脫門令速圓滿；",
        "translation": "They can cultivate the liberation gate of emptiness and cause it to be quickly fulfilled; they can cultivate the liberation gate of signlessness and wishlessness and cause it to be quickly fulfilled.",
        "source": "T06n0220_328:0677c14_8"
    },
    {
        "source_sentence": "能修極喜地令速圓滿，能修離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地令速圓滿；",
        "translation": "They can cultivate the state of ultimate bliss and cause it to be quickly perfected; they can cultivate the state of freedom from defilement, the state of emanating light, the state of blazing wisdom, the state of extreme difficulty, the state",
        "source": "T06n0220_328:0677c16_9"
    },
    {
        "source_sentence": "能修五眼令速圓滿，能修六神通令速圓滿；",
        "translation": "They are able to cultivate the five kinds of eye so as to quickly bring about perfect enlightenment. They are able to cultivate the six supernatural powers so as to quickly bring about perfect enlightenment.",
        "source": "T06n0220_328:0677c18_10"
    },
    {
        "source_sentence": "能修三摩地門令速圓滿，能修陀羅尼門令速圓滿；",
        "translation": "He was able to cultivate the aspects of concentration causing quick completion; he was able to cultivate the aspects of mental command causing quick completion; and he was able to cultivate the aspects of concentration enlightening beings’ practice.",
        "source": "T06n0220_328:0677c19_11"
    },
    {
        "source_sentence": "能修佛十力令速圓滿，能修四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法令速圓滿；",
        "translation": "They can cultivate the ten powers of buddhahood and quickly perfect them. They can cultivate the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great relinquishment",
        "source": "T06n0220_328:0677c20_12"
    },
    {
        "source_sentence": "能修無忘失法令速圓滿，能修恒住捨性令速圓滿；",
        "translation": "They are able to cultivate nonforgetfulness, causing speedy fulfillment. They are able to cultivate the nature of constant abiding equanimity, causing speedy fulfillment.",
        "source": "T06n0220_328:0677c22_13"
    },
    {
        "source_sentence": "能修一切智令速圓滿，能修道相智、一切相智令速圓滿。」",
        "translation": "He can cultivate omniscience so that it's quickly perfected, and he can cultivate knowledge of the path and knowledge of all characteristics so that it's quickly perfected.",
        "source": "T06n0220_328:0677c24_14"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_328:0677c25_15"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T06n0220_328:0677c25_16"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T06n0220_328:0677c25_17"
    },
    {
        "source_sentence": "汝今乃能為諸菩薩問甚深處，令諸菩薩安住其中，修住功德令速圓滿。",
        "translation": "Now, you're able to ask profound questions for the bodhisattvas, make them abide there, cultivate their merits, and quickly fulfill them.",
        "source": "T06n0220_328:0677c25_18"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_328:0677c27_19"
    },
    {
        "source_sentence": "甚深處者，謂空、無相、無願、無作、無生、無滅、寂靜、涅槃、真如、法界、法性、實際，",
        "translation": "The profound sphere consists of emptiness, signlessness, wishlessness, noncontrivance, nonorigination, noncessation, tranquility, nirvana, reality, the cosmos, the nature of things, and reality.",
        "source": "T06n0220_328:0677c27_20"
    },
    {
        "source_sentence": "如是等法名甚深處。",
        "translation": "Such things are called profound places.",
        "source": "T06n0220_328:0677c29_21"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_328:0677c29_22"
    },
    {
        "source_sentence": "如是所說甚深處名，皆顯涅槃為甚深處。」",
        "translation": "Such is the name of the profound place that's explained, which shows that nirvāṇa is a profound place.",
        "source": "T06n0220_328:0677c29_23"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_328:0678a01_24"
    },
    {
        "source_sentence": "為但涅槃名甚深處，為諸餘法亦名甚深？」",
        "translation": "Why is it that nirvāṇa alone is called a profound place and the other dharmas are also called profound?",
        "source": "T06n0220_328:0678a02_25"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_328:0678a03_26"
    },
    {
        "source_sentence": "餘一切法亦名甚深。",
        "translation": "All the other dharmas are also called profound.",
        "source": "T06n0220_328:0678a03_27"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a04_28"
    },
    {
        "source_sentence": "色亦名甚深，受、想、行、識亦名甚深。",
        "translation": "Form is also called profound, and feeling, perception, volition, and consciousness are also called profound.",
        "source": "T06n0220_328:0678a04_29"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a04_30"
    },
    {
        "source_sentence": "眼處亦名甚深，耳、鼻、舌、身、意處亦名甚深。",
        "translation": "The locus of the eye is also called profound. The locus of the ear, nose, tongue, body, and mind are also called profound.",
        "source": "T06n0220_328:0678a05_31"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a06_0"
    },
    {
        "source_sentence": "色處亦名甚深，聲、香、味、觸、法處亦名甚深。",
        "translation": "The form realm is also called profound, and the sound, smell, taste, touch, and dharma realms are also called profound.",
        "source": "T06n0220_328:0678a06_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a07_2"
    },
    {
        "source_sentence": "眼界亦名甚深，耳、鼻、舌、身、意界亦名甚深。",
        "translation": "The element eye is also called ‘ profundity’. The elements ear, nose, tongue, body, and mind are also called ‘ profundity’.",
        "source": "T06n0220_328:0678a07_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a08_4"
    },
    {
        "source_sentence": "色界亦名甚深，聲、香、味、觸、法界亦名甚深。",
        "translation": "The form realm is also called profound, and the sound, odor, taste, touch, and dharma realms are also called profound.",
        "source": "T06n0220_328:0678a08_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a09_6"
    },
    {
        "source_sentence": "眼識界亦名甚深，耳、鼻、舌、身、意識界亦名甚深。",
        "translation": "The element consciousness of the eye is also called profound. The elements ear, nose, tongue, body, and mind are also called profound.",
        "source": "T06n0220_328:0678a09_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a10_8"
    },
    {
        "source_sentence": "眼觸亦名甚深，耳、鼻、舌、身、意觸亦名甚深。",
        "translation": "The contact of the eye is also called ‘ profundity’. The contact of the ear, nose, tongue, body, and mind are also called ‘ profundity’.",
        "source": "T06n0220_328:0678a10_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a11_10"
    },
    {
        "source_sentence": "眼觸為緣所生諸受亦名甚深，耳、鼻、舌、身、意觸為緣所生諸受亦名甚深。",
        "translation": "The sensations that arise from eye contact as a condition are also called profound, and the sensations that arise from ear, nose, tongue, body, and mind contact as a condition are also called profound.",
        "source": "T06n0220_328:0678a11_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a13_12"
    },
    {
        "source_sentence": "地界亦名甚深，水、火、風、空、識界亦名甚深。",
        "translation": "The earth realm is also called profound, and the water, fire, wind, space, and consciousness realms are also called profound.",
        "source": "T06n0220_328:0678a13_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a14_14"
    },
    {
        "source_sentence": "無明亦名甚深，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱亦名甚深。",
        "translation": "nescience is also called profound, and formations, consciousnesses, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehension, existence, birth, old age, sorrow, pain",
        "source": "T06n0220_328:0678a14_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a16_16"
    },
    {
        "source_sentence": "布施波羅蜜多亦名甚深，淨戒、安忍、精進、靜慮、般若波羅蜜多亦名甚深。",
        "translation": "The perfection of generosity is also called profound, and the perfections of pure morality, patience, effort, meditation, and wisdom are also called profound.",
        "source": "T06n0220_328:0678a16_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a17_18"
    },
    {
        "source_sentence": "內空亦名甚深，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空亦名甚深。",
        "translation": "Internal emptiness is also called profound, and external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emp",
        "source": "T06n0220_328:0678a17_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a21_20"
    },
    {
        "source_sentence": "真如亦名甚深，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界亦名甚深。",
        "translation": "The realm of reality is also called profound, and the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm,",
        "source": "T06n0220_328:0678a21_21"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a24_22"
    },
    {
        "source_sentence": "四念住亦名甚深，四正斷、四神足、五根、五力、七等覺支、八聖道支亦名甚深。",
        "translation": "The four abodes of mindfulness are also called profound, and the fourfold correctly eliminated, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are also called",
        "source": "T06n0220_328:0678a24_23"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a26_24"
    },
    {
        "source_sentence": "苦聖諦亦名甚深，集、滅、道聖諦亦名甚深。",
        "translation": "The noble truth of suffering is also called profound, and the noble truths of arising, ceasing, and the path are also called profound.",
        "source": "T06n0220_328:0678a26_25"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a27_26"
    },
    {
        "source_sentence": "四靜慮亦名甚深，四無量、四無色定亦名甚深。",
        "translation": "The four meditations are also called profound. The four immeasurable and four formless concentrations are also called profound.",
        "source": "T06n0220_328:0678a27_27"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a28_28"
    },
    {
        "source_sentence": "八解脫亦名甚深，八勝處、九次第定、十遍處亦名甚深。",
        "translation": "The eight liberations are also called profound. The eight spheres of mastery, the nine graduated concentrations and the ten universals are also called profound.",
        "source": "T06n0220_328:0678a28_29"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678a29_30"
    },
    {
        "source_sentence": "空解脫門亦名甚深，無相、無願解脫門亦名甚深。",
        "translation": "The liberation gate of emptiness is also called profound, and the liberation gates of signlessness and wishlessness are also called profound.",
        "source": "T06n0220_328:0678a29_31"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b01_0"
    },
    {
        "source_sentence": "極喜地亦名甚深，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地亦名甚深。",
        "translation": "The ground of ultimate bliss is also called profound, and the ground of freedom from defilement, the ground of emission of light, the ground of blazing wisdom, the ground of extreme difficulty overcoming, the ground of direct presence, the ground",
        "source": "T06n0220_328:0678b01_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b03_2"
    },
    {
        "source_sentence": "五眼亦名甚深，六神通亦名甚深。",
        "translation": "The five eyes are also called ‘ profundity.’ The six supernormal powers are also called ‘ profundity’.",
        "source": "T06n0220_328:0678b03_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b04_4"
    },
    {
        "source_sentence": "三摩地門亦名甚深，陀羅尼門亦名甚深。",
        "translation": "The approach of samādhi is also called profound, and the approach of dhāraṇī is also called profound.",
        "source": "T06n0220_328:0678b04_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b05_6"
    },
    {
        "source_sentence": "佛十力亦名甚深，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法亦名甚深。",
        "translation": "The Buddha's ten powers are also called profound, and the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and 18 distinctive qualities of the",
        "source": "T06n0220_328:0678b05_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b07_8"
    },
    {
        "source_sentence": "無忘失法亦名甚深，恒住捨性亦名甚深。",
        "translation": "The state of no forgetfulness is also called profound, and the nature of constantly abiding equanimity is also called profound.",
        "source": "T06n0220_328:0678b07_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b08_10"
    },
    {
        "source_sentence": "預流果亦名甚深，一來、不還、阿羅漢果亦名甚深。",
        "translation": "The fruit of pre-flow is also called profound. The fruit of once-returning, nonreturning and arhatship are also called profound.",
        "source": "T06n0220_328:0678b08_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b09_12"
    },
    {
        "source_sentence": "獨覺菩提亦名甚深。",
        "translation": "The enlightenment of the solitary realizer is also called profound.",
        "source": "T06n0220_328:0678b10_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b10_14"
    },
    {
        "source_sentence": "一切智亦名甚深，道相智、一切相智亦名甚深。",
        "translation": "Omniscience is also called profound. The knowledge of the path and the knowledge of all characteristics are also called profound.",
        "source": "T06n0220_328:0678b10_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b11_16"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行亦名甚深。",
        "translation": "All the bodhisattva-mahāsattva practices are also called profound.",
        "source": "T06n0220_328:0678b11_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0678b12_18"
    },
    {
        "source_sentence": "諸佛無上正等菩提亦名甚深。」",
        "translation": "The buddhas' unsurpassed correct perfect enlightenment is also called profound.",
        "source": "T06n0220_328:0678b12_19"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_328:0678b13_20"
    },
    {
        "source_sentence": "云何色亦名甚深？",
        "translation": "What form is also called profound?",
        "source": "T06n0220_328:0678b14_0"
    },
    {
        "source_sentence": "云何受、想、行、識亦名甚深？",
        "translation": "How are feeling, perception, volition, and consciousness also called profound?",
        "source": "T06n0220_328:0678b14_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b15_0"
    },
    {
        "source_sentence": "云何眼處亦名甚深？",
        "translation": "How is the locus of the eye also called profound?",
        "source": "T06n0220_328:0678b15_1"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意處亦名甚深？",
        "translation": "How are the sense-fields of the ear, nose, tongue, body, and mind also called profound?",
        "source": "T06n0220_328:0678b15_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b16_3"
    },
    {
        "source_sentence": "云何色處亦名甚深？",
        "translation": "What's the place of form that's also called profound?",
        "source": "T06n0220_328:0678b16_4"
    },
    {
        "source_sentence": "云何聲、香、味、觸、法處亦名甚深？",
        "translation": "How are the sense-fields sound, odor, taste, touch and dharmas also called profound?",
        "source": "T06n0220_328:0678b16_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b17_6"
    },
    {
        "source_sentence": "云何眼界亦名甚深？",
        "translation": "How is the eye realm also called profound?",
        "source": "T06n0220_328:0678b17_7"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意界亦名甚深？",
        "translation": "How are the ear, nose, tongue, body, and mind realms also called profound?",
        "source": "T06n0220_328:0678b18_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b18_9"
    },
    {
        "source_sentence": "云何色界亦名甚深？",
        "translation": "How is the form realm also called profound?",
        "source": "T06n0220_328:0678b19_0"
    },
    {
        "source_sentence": "云何聲、香、味、觸、法界亦名甚深？",
        "translation": "What's the name of the sound, smell, taste, touch, and dharma realms that are also profound?",
        "source": "T06n0220_328:0678b19_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b20_2"
    },
    {
        "source_sentence": "云何眼識界亦名甚深？",
        "translation": "How is the element consciousness of the eye also called profound?",
        "source": "T06n0220_328:0678b20_3"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意識界亦名甚深？",
        "translation": "How are the ear, nose, tongue, body, and consciousness realms also called profound?",
        "source": "T06n0220_328:0678b20_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b21_5"
    },
    {
        "source_sentence": "云何眼觸亦名甚深？",
        "translation": "What's also called profound in terms of eye contact?",
        "source": "T06n0220_328:0678b21_6"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意觸亦名甚深？",
        "translation": "How are the contact of the ear, nose, tongue, body, and mind also called profound?",
        "source": "T06n0220_328:0678b22_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b22_8"
    },
    {
        "source_sentence": "云何眼觸為緣所生諸受亦名甚深？",
        "translation": "How are the sensations that arise from visual contact as a condition also called profound?",
        "source": "T06n0220_328:0678b23_0"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意觸為緣所生諸受亦名甚深？",
        "translation": "How are the sensations that arise from contact with the ear, nose, tongue, body, and mind also called profound?",
        "source": "T06n0220_328:0678b23_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b24_2"
    },
    {
        "source_sentence": "云何地界亦名甚深？",
        "translation": "How is the earth realm also called profound?",
        "source": "T06n0220_328:0678b25_0"
    },
    {
        "source_sentence": "云何水、火、風、空、識界亦名甚深？",
        "translation": "How are water, fire, wind, space, space, and the consciousness realms also called profound?",
        "source": "T06n0220_328:0678b25_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b26_2"
    },
    {
        "source_sentence": "云何無明亦名甚深？",
        "translation": "How is ignorance also called profound?",
        "source": "T06n0220_328:0678b26_3"
    },
    {
        "source_sentence": "云何行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱亦名甚深？",
        "translation": "How are form, consciousness, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, and vexation also called profound",
        "source": "T06n0220_328:0678b26_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678b28_5"
    },
    {
        "source_sentence": "云何布施波羅蜜多亦名甚深，云何淨戒、安忍、精進、靜慮、般若波羅蜜多亦名甚深？",
        "translation": "How are the perfections of generosity also called profound? How are the perfections of pure morality, patience, effort, meditation, and wisdom also called profound?",
        "source": "T06n0220_328:0678b28_6"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c01_7"
    },
    {
        "source_sentence": "云何內空亦名甚深？",
        "translation": "How is internal emptiness also called profound?",
        "source": "T06n0220_328:0678c01_8"
    },
    {
        "source_sentence": "云何外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空亦名甚深？",
        "translation": "How are external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original",
        "source": "T06n0220_328:0678c01_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c05_10"
    },
    {
        "source_sentence": "云何真如亦名甚深？",
        "translation": "How is it that the true nature is also called profound?",
        "source": "T06n0220_328:0678c05_11"
    },
    {
        "source_sentence": "云何法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界亦名甚深？",
        "translation": "How are the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and inconceivable realms also called",
        "source": "T06n0220_328:0678c05_12"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c08_0"
    },
    {
        "source_sentence": "云何四念住亦名甚深？",
        "translation": "What are the four abodes of mindfulness that are also called profound?",
        "source": "T06n0220_328:0678c08_1"
    },
    {
        "source_sentence": "云何四正斷、四神足、五根、五力、七等覺支、八聖道支亦名甚深？",
        "translation": "How are the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path also called profound?",
        "source": "T06n0220_328:0678c08_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c10_3"
    },
    {
        "source_sentence": "云何苦聖諦亦名甚深？",
        "translation": "How is the noble truth of suffering also called profound?",
        "source": "T06n0220_328:0678c10_4"
    },
    {
        "source_sentence": "云何集、滅、道聖諦亦名甚深？",
        "translation": "How are the noble truths of arising, cessation, and the path also called profound?",
        "source": "T06n0220_328:0678c10_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c11_6"
    },
    {
        "source_sentence": "云何四靜慮亦名甚深？",
        "translation": "What are the four forms of meditative absorption also called profound?",
        "source": "T06n0220_328:0678c11_7"
    },
    {
        "source_sentence": "云何四無量、四無色定亦名甚深？",
        "translation": "How are the four immeasurable concentrations and the four formless concentrations also called profound?",
        "source": "T06n0220_328:0678c12_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c12_1"
    },
    {
        "source_sentence": "云何八解脫亦名甚深？",
        "translation": "What are the eight liberations also called profound?",
        "source": "T06n0220_328:0678c12_2"
    },
    {
        "source_sentence": "云何八勝處、九次第定、十遍處亦名甚深？",
        "translation": "How are the eight spheres of mastery, the nine graduated concentrations and the ten universal abodes also called profound?",
        "source": "T06n0220_328:0678c13_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c14_4"
    },
    {
        "source_sentence": "云何空解脫門亦名甚深？",
        "translation": "How is the liberation gate of emptiness also called profound?",
        "source": "T06n0220_328:0678c14_5"
    },
    {
        "source_sentence": "云何無相、無願解脫門亦名甚深？",
        "translation": "How is the liberation gate of signlessness and wishlessness also called profound?",
        "source": "T06n0220_328:0678c15_6"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c15_7"
    },
    {
        "source_sentence": "云何極喜地亦名甚深？",
        "translation": "How is the stage of utmost bliss also called profound?",
        "source": "T06n0220_328:0678c15_8"
    },
    {
        "source_sentence": "云何離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地亦名甚深？",
        "translation": "What's the name of the ground that's free from defilement, the ground that emits light, the ground of blazing wisdom, the ground that's extremely difficult to overcome, the ground that's present, the ground that's distant, the",
        "source": "T06n0220_328:0678c16_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c18_10"
    },
    {
        "source_sentence": "云何五眼亦名甚深？",
        "translation": "What are the five eyes also called profound?",
        "source": "T06n0220_328:0678c18_11"
    },
    {
        "source_sentence": "云何六神通亦名甚深？",
        "translation": "How are the six supernormal powers also called profound?",
        "source": "T06n0220_328:0678c19_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c19_1"
    },
    {
        "source_sentence": "云何三摩地門亦名甚深？",
        "translation": "How is the approach of samādhi also called profound?",
        "source": "T06n0220_328:0678c19_2"
    },
    {
        "source_sentence": "云何陀羅尼門亦名甚深？",
        "translation": "How is the dhāraṇī teaching also called profound?",
        "source": "T06n0220_328:0678c20_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c20_4"
    },
    {
        "source_sentence": "云何佛十力亦名甚深？",
        "translation": "How are the ten powers of buddhas also called profound?",
        "source": "T06n0220_328:0678c20_5"
    },
    {
        "source_sentence": "云何四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法亦名甚深？",
        "translation": "How are the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 unique qualities of buddhas also called profound?",
        "source": "T06n0220_328:0678c21_6"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c23_7"
    },
    {
        "source_sentence": "云何無忘失法亦名甚深？",
        "translation": "How is the absence of forgetfulness also called profound?",
        "source": "T06n0220_328:0678c23_8"
    },
    {
        "source_sentence": "云何恒住捨性亦名甚深？",
        "translation": "How is the nature of constantly abiding equanimity also called profound?",
        "source": "T06n0220_328:0678c23_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c24_10"
    },
    {
        "source_sentence": "云何預流果亦名甚深？",
        "translation": "How is the fruit of stream-winner also called profound?",
        "source": "T06n0220_328:0678c24_11"
    },
    {
        "source_sentence": "云何一來、不還、阿羅漢果亦名甚深？",
        "translation": "How are the once-returner, the nonreturner, and the fruit of arhatship also called profound?",
        "source": "T06n0220_328:0678c25_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c25_1"
    },
    {
        "source_sentence": "云何獨覺菩提亦名甚深？",
        "translation": "How is the enlightenment of the self-enlightened also called profound?",
        "source": "T06n0220_328:0678c25_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c26_3"
    },
    {
        "source_sentence": "云何一切菩薩摩訶薩行亦名甚深？",
        "translation": "How are all the bodhisattva-mahāsattva practices also called profound?",
        "source": "T06n0220_328:0678c26_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0678c27_5"
    },
    {
        "source_sentence": "云何諸佛無上正等菩提亦名甚深？」",
        "translation": "How are the buddhas' unsurpassed perfect enlightenment also called profound?",
        "source": "T06n0220_328:0678c27_6"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_328:0678c28_7"
    },
    {
        "source_sentence": "色真如甚深故色亦甚深，受、想、行、識真如甚深故受、想、行、識亦甚深。",
        "translation": "Because the true nature of form is profound, form is also profound, and because the true natures of feeling, perception, volition, and consciousness are profound, feeling, perception, volition, and consciousness are also profound.",
        "source": "T06n0220_328:0678c28_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a01_9"
    },
    {
        "source_sentence": "眼處真如甚深故眼處亦甚深，耳、鼻、舌、身、意處真如甚深故耳、鼻、舌、身、意處亦甚深。",
        "translation": "Because the eye field is truly profound, the eye field is also profound, and because the ear, nose, tongue, body, and mind fields are truly profound, the ear, nose, tongue, body, and mind fields are also pro",
        "source": "T06n0220_328:0679a01_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a03_11"
    },
    {
        "source_sentence": "色處真如甚深故色處亦甚深，聲、香、味、觸、法處真如甚深故聲、香、味、觸、法處亦甚深。",
        "translation": "Because the form realm is truly profound, the form realm is also profound, and because the sound, odor, taste, touch, and dharma realms are truly profound, the sound, odor, taste, touch, touch, and dharma real",
        "source": "T06n0220_328:0679a03_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a05_13"
    },
    {
        "source_sentence": "眼界真如甚深故眼界亦甚深，耳、鼻、舌、身、意界真如甚深故耳、鼻、舌、身、意界亦甚深。",
        "translation": "Because the eye realm is truly profound, the eye realm is also profound, and because the ear, nose, tongue, body, and mind realms are truly profound, the ear, nose, tongue, body, and mind realms are",
        "source": "T06n0220_328:0679a05_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a07_0"
    },
    {
        "source_sentence": "色界真如甚深故色界亦甚深，聲、香、味、觸、法界真如甚深故聲、香、味、觸、法界亦甚深。",
        "translation": "Because the true nature of the form realm is profound, the form realm is also profound, and because the true nature of sound, smell, taste, touch, and dharmas are profound, the sound, smell, taste, touch, and dharmas",
        "source": "T06n0220_328:0679a07_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a08_2"
    },
    {
        "source_sentence": "眼識界真如甚深故眼識界亦甚深，耳、鼻、舌、身、意識界真如甚深故耳、鼻、舌、身、意識界亦甚深。",
        "translation": "Because the realm of the eye consciousness is truly profound, the realm of the eye consciousness is also profound, and because the realm of the ear, nose, tongue, body, and consciousness are truly profound, the real",
        "source": "T06n0220_328:0679a09_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a11_4"
    },
    {
        "source_sentence": "眼觸真如甚深故眼觸亦甚深，耳、鼻、舌、身、意觸真如甚深故耳、鼻、舌、身、意觸亦甚深。",
        "translation": "Because eye contact is truly profound, eye contact is also profound, and because the true nature of ear, nose, tongue, body, and mind contact is truly profound, ear, nose, tongue, body, and mind contact are also profound.",
        "source": "T06n0220_328:0679a11_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a13_6"
    },
    {
        "source_sentence": "眼觸為緣所生諸受真如甚深故眼觸為緣所生諸受亦甚深，耳、鼻、舌、身、意觸為緣所生諸受真如甚深故耳、鼻、舌、身、意觸為緣所生諸受亦甚深。",
        "translation": "Because the feelings that arise from eye contact as a condition are truly profound, the feelings that arise from eye contact as a condition are also profound, and because the feelings that arise from ear, nose, tongue, body, and mind contact",
        "source": "T06n0220_328:0679a13_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a16_8"
    },
    {
        "source_sentence": "地界真如甚深故地界亦甚深，水、火、風、空、識界真如甚深故水、火、風、空、識界亦甚深。",
        "translation": "Because the earth realm is truly profound, the earth realm is also profound, and because the water, fire, wind, air, space, and consciousness realms are truly profound, the water, fire, wind, air, space, and conscious",
        "source": "T06n0220_328:0679a16_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a18_10"
    },
    {
        "source_sentence": "無明真如甚深故無明亦甚深，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱真如甚深故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱亦甚深。",
        "translation": "Because the true nature of nescience is so profound, nescience is also profound, and because the true nature of form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension,",
        "source": "T06n0220_328:0679a18_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a21_12"
    },
    {
        "source_sentence": "布施波羅蜜多真如甚深故布施波羅蜜多亦甚深，淨戒、安忍、精進、靜慮、般若波羅蜜多真如甚深故淨戒、安忍、精進、靜慮、般若波羅蜜多亦甚深。",
        "translation": "Because the true nature of the perfection of generosity is so profound, the perfection of generosity is also profound, and because the true natures of pure morality, patience, effort, meditation, and prajñāpāramitā are so profound, the perfection",
        "source": "T06n0220_328:0679a22_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679a25_1"
    },
    {
        "source_sentence": "內空真如甚深故內空亦甚深，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空真如甚深故外空乃至無性自性空亦甚深。",
        "translation": "Because internal emptiness is truly profound, internal emptiness is also profound, and external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit,",
        "source": "T06n0220_328:0679a25_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b01_3"
    },
    {
        "source_sentence": "真如真如甚深故真如亦甚深，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界真如甚深故法界乃至不思議界亦甚深。",
        "translation": "Because the true nature of reality is profound, the true nature of reality is also profound, and the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding",
        "source": "T06n0220_328:0679b01_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b04_5"
    },
    {
        "source_sentence": "四念住真如甚深故四念住亦甚深，四正斷、四神足、五根、五力、七等覺支、八聖道支真如甚深故四正斷、四神足、五根、五力、七等覺支、八聖道支亦甚深。",
        "translation": "Because the four abodes of mindfulness are truly profound, the four abodes of mindfulness are also profound, and because the fourfold correct elimination, the four miraculous powers, five faculties, five faculties, five powers, seven factors of",
        "source": "T06n0220_328:0679b04_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b08_7"
    },
    {
        "source_sentence": "苦聖諦真如甚深故苦聖諦亦甚深，集、滅、道聖諦真如甚深故集、滅、道聖諦亦甚深。",
        "translation": "Because the true nature of the noble truth of suffering is profound, the noble truth of suffering is also profound, and because the true nature of the noble truths of arising, ceasing, and the path is profound, the noble truths of",
        "source": "T06n0220_328:0679b08_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b10_9"
    },
    {
        "source_sentence": "四靜慮真如甚深故四靜慮亦甚深，四無量、四無色定真如甚深故四無量、四無色定亦甚深。",
        "translation": "Because the four meditations are truly profound, the four meditations are also profound, and because the four immeasurable and four formless concentrations are truly profound, the four immeasurable and four formless concentrations are also profound.",
        "source": "T06n0220_328:0679b10_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b12_11"
    },
    {
        "source_sentence": "八解脫真如甚深故八解脫亦甚深，八勝處、九次第定、十遍處真如甚深故八勝處、九次第定、十遍處亦甚深。",
        "translation": "Because the true nature of the eight liberations is profound, the eight liberations are also profound, and because the true nature of the eight abodes of victory, nine graduated concentrations, and ten universal abodes is profound, the eight abodes of",
        "source": "T06n0220_328:0679b12_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b14_13"
    },
    {
        "source_sentence": "空解脫門真如甚深故空解脫門亦甚深，無相、無願解脫門真如甚深故無相、無願解脫門亦甚深。",
        "translation": "Because the gate of liberation through emptiness is truly profound, the gate of liberation through emptiness is also profound, and because the gate of liberation through signlessness and wishlessness is truly profound, the gate of liberation through signless",
        "source": "T06n0220_328:0679b14_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b17_15"
    },
    {
        "source_sentence": "極喜地真如甚深故極喜地亦甚深，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地真如甚深故離垢地乃至法雲地亦甚深。",
        "translation": "Because the ground of ultimate joy is truly profound, the ground of ultimate joy is also profound, and because the ground of freedom from defilement, the ground of arousal of light, the ground of burning wisdom, the ground of extreme difficulty,",
        "source": "T06n0220_328:0679b17_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b20_17"
    },
    {
        "source_sentence": "五眼真如甚深故五眼亦甚深，六神通真如甚深故六神通亦甚深。",
        "translation": "Because the five eyes are truly profound, the five eyes are also profound, and because the six supernormal powers are truly profound, the six supernormal powers are also profound.",
        "source": "T06n0220_328:0679b20_18"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b22_19"
    },
    {
        "source_sentence": "三摩地門真如甚深故三摩地門亦甚深，陀羅尼門真如甚深故陀羅尼門亦甚深。",
        "translation": "Because the approach of samādhi is truly profound, the approach of samādhi is also profound, and because the approach of dhāraṇī is truly profound, the approach of dhāraṇī is also profound.",
        "source": "T06n0220_328:0679b22_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b24_21"
    },
    {
        "source_sentence": "佛十力真如甚深故佛十力亦甚深，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法真如甚深故四無所畏乃至十八佛不共法亦甚深。",
        "translation": "Because the Buddha's ten powers are truly profound, the Buddha's ten powers are also profound, and because the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity",
        "source": "T06n0220_328:0679b24_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b27_23"
    },
    {
        "source_sentence": "無忘失法真如甚深故無忘失法亦甚深，恒住捨性真如甚深故恒住捨性亦甚深。",
        "translation": "Because the true nature of the absence of forgetfulness is so profound, the absence of forgetfulness is also profound, and because the true nature of constancy in equanimity is so profound, the constancy in equanimity is also",
        "source": "T06n0220_328:0679b27_24"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679b29_25"
    },
    {
        "source_sentence": "預流果真如甚深故預流果亦甚深，一來、不還、阿羅漢果真如甚深故一來、不還、阿羅漢果亦甚深。",
        "translation": "Because the true nature of the fruit of pre-flow is so profound, the fruit of pre-flow is also profound, and because the true nature of the once-returning, nonreturning, and arhatship fruits are so profound, the once-retur",
        "source": "T06n0220_328:0679b29_26"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679c02_27"
    },
    {
        "source_sentence": "獨覺菩提真如甚深故獨覺菩提亦甚深。",
        "translation": "Because the true nature of pratyekabuddha's enlightenment is so profound, pratyekabuddha's enlightenment is also profound.",
        "source": "T06n0220_328:0679c03_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679c03_1"
    },
    {
        "source_sentence": "一切智真如甚深故一切智亦甚深，道相智、一切相智真如甚深故道相智、一切相智亦甚深。",
        "translation": "Because the true nature of omniscience is profound, omniscience is also profound, and because the true nature of knowledge of paths and all characteristics and knowledge of all characteristics are profound, knowledge of paths and knowledge of all characteristics are also",
        "source": "T06n0220_328:0679c04_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679c06_3"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行真如甚深故一切菩薩摩訶薩行亦甚深。",
        "translation": "Because all bodhisattva-mahāsattva practices are truly profound, all bodhisattva-mahāsattva practices are also profound.",
        "source": "T06n0220_328:0679c06_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0679c07_5"
    },
    {
        "source_sentence": "諸佛無上正等菩提真如甚深故諸佛無上正等菩提亦甚深。」",
        "translation": "The buddhas' unsurpassed correct perfect enlightenment is truly profound, so the buddhas' unsurpassed correct perfect enlightenment is also profound.",
        "source": "T06n0220_328:0679c07_6"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_328:0679c10_0"
    },
    {
        "source_sentence": "云何色真如甚深？",
        "translation": "How profound is the true nature of form?",
        "source": "T06n0220_328:0679c10_1"
    },
    {
        "source_sentence": "云何受、想、行、識真如甚深？",
        "translation": "How profound is the true nature of feeling, perception, volition, and consciousness?",
        "source": "T06n0220_328:0679c11_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c11_1"
    },
    {
        "source_sentence": "云何眼處真如甚深？",
        "translation": "How profound is the true nature of the locus of the eye?",
        "source": "T06n0220_328:0679c11_2"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意處真如甚深？",
        "translation": "What's the true depth of the ear, nose, tongue, body, and mind sense-fields?",
        "source": "T06n0220_328:0679c12_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c12_4"
    },
    {
        "source_sentence": "云何色處真如甚深？",
        "translation": "How profound is the true nature of the form realm?",
        "source": "T06n0220_328:0679c13_0"
    },
    {
        "source_sentence": "云何聲、香、味、觸、法處真如甚深？",
        "translation": "What is the profundity of the true nature of the sense-fields sound, odor, taste, touch, and dharmas?",
        "source": "T06n0220_328:0679c13_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c14_2"
    },
    {
        "source_sentence": "云何眼界真如甚深？",
        "translation": "How profound is the true nature of the eye realm?",
        "source": "T06n0220_328:0679c14_3"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意界真如甚深？",
        "translation": "What's the true depth of the ear, nose, tongue, body, and mind realms?",
        "source": "T06n0220_328:0679c14_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c15_5"
    },
    {
        "source_sentence": "云何色界真如甚深？",
        "translation": "How profound is the true nature of the form realm?",
        "source": "T06n0220_328:0679c15_6"
    },
    {
        "source_sentence": "云何聲、香、味、觸、法界真如甚深？",
        "translation": "What's the true depth of the sound, odor, taste, touch, and dharma realms?",
        "source": "T06n0220_328:0679c16_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c16_8"
    },
    {
        "source_sentence": "云何眼識界真如甚深？",
        "translation": "How profound is the true nature of the element of consciousness of the eye?",
        "source": "T06n0220_328:0679c16_9"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意識界真如甚深？",
        "translation": "What's the true depth of the ear, nose, tongue, body, and consciousness realms?",
        "source": "T06n0220_328:0679c17_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c18_11"
    },
    {
        "source_sentence": "云何眼觸真如甚深？",
        "translation": "What's the profoundness of the true nature of eye contact?",
        "source": "T06n0220_328:0679c18_12"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意觸真如甚深？",
        "translation": "What's the depth of the true depth of touching the ear, nose, tongue, body, and mind?",
        "source": "T06n0220_328:0679c18_13"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c19_14"
    },
    {
        "source_sentence": "云何眼觸為緣所生諸受真如甚深？",
        "translation": "How are the sensations that arise from visual contact as a condition really profound?",
        "source": "T06n0220_328:0679c19_15"
    },
    {
        "source_sentence": "云何耳、鼻、舌、身、意觸為緣所生諸受真如甚深？",
        "translation": "How are the sensations that arise from contact with the ear, nose, tongue, body, and mind really profound?",
        "source": "T06n0220_328:0679c20_16"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c21_17"
    },
    {
        "source_sentence": "云何地界真如甚深？",
        "translation": "How profound is the true nature of the earth realm?",
        "source": "T06n0220_328:0679c21_18"
    },
    {
        "source_sentence": "云何水、火、風、空、識界真如甚深？",
        "translation": "What's the true depth of the water, fire, wind, air, space, and consciousness realms?",
        "source": "T06n0220_328:0679c22_19"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c22_20"
    },
    {
        "source_sentence": "云何無明真如甚深？",
        "translation": "How profound is the true nature of nescience?",
        "source": "T06n0220_328:0679c22_21"
    },
    {
        "source_sentence": "云何行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱真如甚深？",
        "translation": "How is the true nature of volition, consciousness, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, and vex",
        "source": "T06n0220_328:0679c23_22"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c24_23"
    },
    {
        "source_sentence": "云何布施波羅蜜多真如甚深？",
        "translation": "How profound is the true nature of the perfection of generosity?",
        "source": "T06n0220_328:0679c24_24"
    },
    {
        "source_sentence": "云何淨戒、安忍、精進、靜慮、般若波羅蜜多真如甚深？",
        "translation": "What is the profundity of the true nature of pure morality, patience, effort, meditation, and prajñāpāramitā?",
        "source": "T06n0220_328:0679c25_25"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0679c26_26"
    },
    {
        "source_sentence": "云何內空真如甚深？",
        "translation": "How profound is the true nature of internal emptiness?",
        "source": "T06n0220_328:0679c26_27"
    },
    {
        "source_sentence": "云何外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空真如甚深？",
        "translation": "How are external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original",
        "source": "T06n0220_328:0679c27_28"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a02_29"
    },
    {
        "source_sentence": "云何真如真如甚深？",
        "translation": "What is the profundity of true thusness and true thusness?",
        "source": "T06n0220_328:0680a02_30"
    },
    {
        "source_sentence": "云何法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界真如甚深？",
        "translation": "What's the true depth of the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the incon",
        "source": "T06n0220_328:0680a02_31"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a04_32"
    },
    {
        "source_sentence": "云何四念住真如甚深？",
        "translation": "What are the four kinds of mindfulness that abide in the profundity of true reality?",
        "source": "T06n0220_328:0680a04_33"
    },
    {
        "source_sentence": "云何四正斷、四神足、五根、五力、七等覺支、八聖道支真如甚深？",
        "translation": "What are the fourfold correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path truly profound?",
        "source": "T06n0220_328:0680a05_34"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a06_35"
    },
    {
        "source_sentence": "云何苦聖諦真如甚深？",
        "translation": "What is the profundity of the true nature of the noble truth of suffering?",
        "source": "T06n0220_328:0680a06_36"
    },
    {
        "source_sentence": "云何集、滅、道聖諦真如甚深？",
        "translation": "What is the profundity of the true nature of the noble truths of arising, ceasing, and the path?",
        "source": "T06n0220_328:0680a07_37"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a08_38"
    },
    {
        "source_sentence": "云何四靜慮真如甚深？",
        "translation": "What are the true depths of the four meditations?",
        "source": "T06n0220_328:0680a08_39"
    },
    {
        "source_sentence": "云何四無量、四無色定真如甚深？",
        "translation": "What are the true depths of the four immeasurable and four formless concentrations?",
        "source": "T06n0220_328:0680a08_40"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a09_41"
    },
    {
        "source_sentence": "云何八解脫真如甚深？",
        "translation": "What are the eight liberations that are truly profound?",
        "source": "T06n0220_328:0680a09_42"
    },
    {
        "source_sentence": "云何八勝處、九次第定、十遍處真如甚深？",
        "translation": "What are the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes truly profound?",
        "source": "T06n0220_328:0680a10_43"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a11_44"
    },
    {
        "source_sentence": "云何空解脫門真如甚深？",
        "translation": "How profound is the true nature of the liberation gate of emptiness?",
        "source": "T06n0220_328:0680a11_45"
    },
    {
        "source_sentence": "云何無相、無願解脫門真如甚深？",
        "translation": "How profound is the true nature of the liberation gate of marklessness and wishlessness?",
        "source": "T06n0220_328:0680a11_46"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a12_47"
    },
    {
        "source_sentence": "云何極喜地真如甚深？",
        "translation": "What's the profoundness of the true nature of the ground of ultimate bliss?",
        "source": "T06n0220_328:0680a12_48"
    },
    {
        "source_sentence": "云何離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地真如甚深？",
        "translation": "What's the true depth of the stage of freedom from defilement, the stage of arousing light, the stage of blazing wisdom, the extremely difficult to overcome stage, the stage that's present, the stage that's far-reaching,",
        "source": "T06n0220_328:0680a13_49"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a15_50"
    },
    {
        "source_sentence": "云何五眼真如甚深？",
        "translation": "What are the five eyes truly profound?",
        "source": "T06n0220_328:0680a15_51"
    },
    {
        "source_sentence": "云何六神通真如甚深？",
        "translation": "What are the true depths of the six supernormal powers?",
        "source": "T06n0220_328:0680a15_52"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a16_53"
    },
    {
        "source_sentence": "云何三摩地門真如甚深？",
        "translation": "What's the profoundness of the true nature of the approach of samādhi?",
        "source": "T06n0220_328:0680a16_54"
    },
    {
        "source_sentence": "云何陀羅尼門真如甚深？",
        "translation": "What is the profundity of the true nature of the dhāraṇī teachings?",
        "source": "T06n0220_328:0680a16_55"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a17_56"
    },
    {
        "source_sentence": "云何佛十力真如甚深？",
        "translation": "What are the ten powers of buddhas’ true and profound forms?",
        "source": "T06n0220_328:0680a17_57"
    },
    {
        "source_sentence": "云何四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法真如甚深？",
        "translation": "What are the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the true profundities of the 18 Buddha-principles?",
        "source": "T06n0220_328:0680a18_58"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a19_59"
    },
    {
        "source_sentence": "云何無忘失法真如甚深？",
        "translation": "How profound is the true nature of the Dharma of no forgetfulness?",
        "source": "T06n0220_328:0680a19_60"
    },
    {
        "source_sentence": "云何恒住捨性真如甚深？",
        "translation": "How profound is the true nature of eternally abiding equanimity?",
        "source": "T06n0220_328:0680a20_61"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a21_62"
    },
    {
        "source_sentence": "云何預流果真如甚深？",
        "translation": "What is the profundity of the true nature of the fruit of pre-flow?",
        "source": "T06n0220_328:0680a21_63"
    },
    {
        "source_sentence": "云何一來、不還、阿羅漢果真如甚深？",
        "translation": "How profound is the true nature of the once-returner, nonreturner, and arhatship fruits?",
        "source": "T06n0220_328:0680a21_64"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a22_65"
    },
    {
        "source_sentence": "云何獨覺菩提真如甚深？",
        "translation": "What is the profundity of the true nature of enlightenment of the pratyekabuddhas?",
        "source": "T06n0220_328:0680a22_66"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a23_67"
    },
    {
        "source_sentence": "云何一切智真如甚深？",
        "translation": "What is the profundity of the true nature of omniscience?",
        "source": "T06n0220_328:0680a23_68"
    },
    {
        "source_sentence": "云何道相智、一切相智真如甚深？",
        "translation": "What is the true depth of knowledge of the path and knowledge of all characteristics?",
        "source": "T06n0220_328:0680a23_69"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a24_70"
    },
    {
        "source_sentence": "云何一切菩薩摩訶薩行真如甚深？",
        "translation": "How profound is the practice of all bodhisattva-mahāsattvas as they really are?",
        "source": "T06n0220_328:0680a24_71"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_328:0680a25_72"
    },
    {
        "source_sentence": "云何諸佛無上正等菩提真如甚深？」",
        "translation": "How profound is the true nature of the buddhas' unsurpassed perfect enlightenment?",
        "source": "T06n0220_328:0680a25_73"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_328:0680a26_74"
    },
    {
        "source_sentence": "色真如非即色非離色，是故甚深；",
        "translation": "The reality of form is not the same as form and not separate from form; that is why it is profound.",
        "source": "T06n0220_328:0680a26_75"
    },
    {
        "source_sentence": "受、想、行、識真如非即受、想、行、識非離受、想、行、識，是故甚深。",
        "translation": "The true nature of feeling, perception, volition, and consciousness is not that feeling, perception, volition, and consciousness aren't separate from feeling, perception, volition, and consciousness; therefore, it's profound.",
        "source": "T06n0220_328:0680a27_76"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680a28_77"
    },
    {
        "source_sentence": "眼處真如非即眼處非離眼處，是故甚深；",
        "translation": "The sphere of vision is really not the same as the sphere of vision and not apart from the sphere of vision: that is why it is profound.",
        "source": "T06n0220_328:0680a29_0"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處真如非即耳、鼻、舌、身、意處非離耳、鼻、舌、身、意處，",
        "translation": "The true nature of the sense-fields of ear, nose, tongue, body, and mind are not the sense-fields of ear, nose, tongue, body, and mind, which are not separate from the sense-fields of ear, nos",
        "source": "T06n0220_328:0680a29_1"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b02_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b02_3"
    },
    {
        "source_sentence": "色處真如非即色處非離色處，是故甚深；",
        "translation": "The real nature of the sphere of form is not exactly the sphere of form and not the sphere free from form. That is why it is so profound.",
        "source": "T06n0220_328:0680b02_4"
    },
    {
        "source_sentence": "聲、香、味、觸、法處真如非即聲、香、味、觸、法處非離聲、香、味、觸、法處，",
        "translation": "The true nature of the sense-fields sound, odor, taste, touch, and dharmas are not the sense-fields sound, odor, taste, touch, touch, and dharmas, which are not separate from the sense-fields sound,",
        "source": "T06n0220_328:0680b03_5"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b05_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b05_7"
    },
    {
        "source_sentence": "眼界真如非即眼界非離眼界，是故甚深；",
        "translation": "The real nature of the element eye is not exactly the element eye and not apart from the element eye. That is why it is profound.",
        "source": "T06n0220_328:0680b05_8"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意界真如非即耳、鼻、舌、身、意界非離耳、鼻、舌、身、意界，",
        "translation": "The true nature of the ear, nose, tongue, body, and mind realms is not that the ear, nose, tongue, body, and mind realms are not separate from the ear, nose, tongue, body, and mind realms.",
        "source": "T06n0220_328:0680b06_9"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b07_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b08_11"
    },
    {
        "source_sentence": "色界真如非即色界非離色界，是故甚深；",
        "translation": "The real suchness of the realm of form is not exactly what is in the realm of form and not what is free from the realm of form. That is why it is profound.",
        "source": "T06n0220_328:0680b08_12"
    },
    {
        "source_sentence": "聲、香、味、觸、法界真如非即聲、香、味、觸、法界非離聲、香、味、觸、法界，",
        "translation": "The true nature of sound, odor, taste, touch, touch, and the Dharma realm is not that sound, odor, taste, touch, touch, and the Dharma realm are not separate from sound, odor, taste, touch, touch, or the Dharma",
        "source": "T06n0220_328:0680b09_13"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b10_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b10_15"
    },
    {
        "source_sentence": "眼識界真如非即眼識界非離眼識界，是故甚深；",
        "translation": "The reality of the element consciousness of the eye is not that which is the element consciousness of the eye; it is not apart from the element consciousness of the eye. That is why it is so profound.",
        "source": "T06n0220_328:0680b10_16"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意識界真如非即耳、鼻、舌、身、意識界非離耳、鼻、舌、身、意識界，",
        "translation": "The true nature of the ear, nose, tongue, body, and consciousness realms is not that the ear, nose, tongue, body, and consciousness realms aren't separate from the ear, nose, tongue, body,",
        "source": "T06n0220_328:0680b11_17"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b13_18"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b13_19"
    },
    {
        "source_sentence": "眼觸真如非即眼觸非離眼觸，是故甚深；",
        "translation": "The reality of eye contact is not that which is eye contact and not what is apart from eye contact. That is why it is so profound.",
        "source": "T06n0220_328:0680b13_20"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意觸真如非即耳、鼻、舌、身、意觸非離耳、鼻、舌、身、意觸，",
        "translation": "The true nature of touching the ear, nose, tongue, body, and mind isn’t that which is touched by the ear, nose, tongue, body, and mind; it’s not that which is touched by the ear, nose",
        "source": "T06n0220_328:0680b14_21"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b16_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b16_23"
    },
    {
        "source_sentence": "眼觸為緣所生諸受真如非即眼觸為緣所生諸受非離眼觸為緣所生諸受，",
        "translation": "The reality of sensations that arise from eye contact as a condition is not the same as those that arise from eye contact as a condition, which are not sensations that arise from eye contact as a condition apart from eye contact.",
        "source": "T06n0220_328:0680b16_24"
    },
    {
        "source_sentence": "是故甚深；",
        "translation": "Therefore, it is profound.",
        "source": "T06n0220_328:0680b18_25"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意觸為緣所生諸受真如非即耳、鼻、舌、身、意觸為緣所生諸受非離耳、鼻、舌、身、意觸為緣所生諸受，",
        "translation": "The true nature of sensations that arise from ear, nose, tongue, body, and thought contact as a condition is not that the sensations that arise from ear, nose, tongue, body, and thought contact as a condition are not separate from the",
        "source": "T06n0220_328:0680b18_26"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b20_27"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b21_28"
    },
    {
        "source_sentence": "地界真如非即地界非離地界，是故甚深；",
        "translation": "The real nature of earth element is not exactly the earth element; it is not separate from earth element. That is why it is profound.",
        "source": "T06n0220_328:0680b21_29"
    },
    {
        "source_sentence": "水、火、風、空、識界真如非即水、火、風、空、識界非離、水、火、風、空、識界，",
        "translation": "The true nature of water, fire, wind, air, space, and the consciousness realm is not water, fire, wind, space, space, and the consciousness realm are not separate, and water, fire, wind, space, space, and the",
        "source": "T06n0220_328:0680b22_30"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b23_31"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b23_32"
    },
    {
        "source_sentence": "無明真如非即無明非離無明，是故甚深；",
        "translation": "The true nature of nescience is not that which is nescience, and it is not separate from nescience. That is why it is profound.",
        "source": "T06n0220_328:0680b23_33"
    },
    {
        "source_sentence": "行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱真如非即行乃至老死愁歎苦憂惱非離行乃至老死愁歎苦憂惱，",
        "translation": "The true nature of volition, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, attachment, existence, birth, old age, sorrow, pain, grief, and vexation is not",
        "source": "T06n0220_328:0680b24_34"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680b27_35"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680b27_36"
    },
    {
        "source_sentence": "布施波羅蜜多真如非即布施波羅蜜多非離布施波羅蜜多，是故甚深；",
        "translation": "The true nature of the perfection of giving is not that the perfection of giving is not apart from the perfection of giving, and therefore it is profound.",
        "source": "T06n0220_328:0680b27_37"
    },
    {
        "source_sentence": "淨戒、安忍、精進、靜慮、般若波羅蜜多真如非即淨戒、安忍、精進、靜慮、般若波羅蜜多非離淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "The true nature of the pure precepts, patience, effort, meditation, and prajñāpāramitā is not that the pure precepts, patience, effort, meditation, and prajñāpāramitā are free from the pure precepts, patience",
        "source": "T06n0220_328:0680b29_38"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680c03_39"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c03_40"
    },
    {
        "source_sentence": "內空真如非即內空非離內空，是故甚深；",
        "translation": "The reality of internal emptiness is not the same as internal emptiness, which is not separate from internal emptiness; therefore, it is profound.",
        "source": "T06n0220_328:0680c03_41"
    },
    {
        "source_sentence": "外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空真如非即外空乃至無性自性空非離外空乃至無性自性空，",
        "translation": "external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature,",
        "source": "T06n0220_328:0680c04_42"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680c08_43"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c09_44"
    },
    {
        "source_sentence": "真如真如非即真如非離真如，是故甚深；",
        "translation": "Because the true suchness of reality is not the same as the true suchness and not separate from the true suchness, it is therefore profound.",
        "source": "T06n0220_328:0680c09_45"
    },
    {
        "source_sentence": "法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界真如非即法界乃至不思議界非離法界乃至不思議界，",
        "translation": "The Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the inconceivable realm are not the",
        "source": "T06n0220_328:0680c10_46"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680c13_47"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c13_48"
    },
    {
        "source_sentence": "四念住真如非即四念住非離四念住，是故甚深；",
        "translation": "The four forms of abiding in mindfulness as suchness are not exactly the four forms of abiding in mindfulness. They are not separate from the four forms of abiding in mindfulness. That is why they are so profound.",
        "source": "T06n0220_328:0680c13_49"
    },
    {
        "source_sentence": "四正斷、四神足、五根、五力、七等覺支、八聖道支真如非即四正斷乃至八聖道支非離四正斷乃至八聖道支，",
        "translation": "The fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are truly not the fourfold correct elimination or even the",
        "source": "T06n0220_328:0680c14_50"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680c17_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c17_1"
    },
    {
        "source_sentence": "苦聖諦真如非即苦聖諦非離苦聖諦，是故甚深；",
        "translation": "The true nature of the noble truth of suffering is not the noble truth of suffering, which is not apart from the noble truth of suffering. Because of this, it is profound.",
        "source": "T06n0220_328:0680c17_2"
    },
    {
        "source_sentence": "集、滅、道聖諦真如非即集、滅、道聖諦非離集、滅、道聖諦，是故甚深。",
        "translation": "The true nature of the noble truths of arising, cessation, and the path is that the noble truths of arising, cessation, and the path are not apart from the noble truths of arising, cessation, and the",
        "source": "T06n0220_328:0680c18_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c19_4"
    },
    {
        "source_sentence": "四靜慮真如非即四靜慮非離四靜慮，是故甚深；",
        "translation": "The four forms of meditative absorption are really not the same as the four forms of meditative absorption. They are not separate from the four forms of meditative absorption. Because of this, they are profound.",
        "source": "T06n0220_328:0680c20_5"
    },
    {
        "source_sentence": "四無量、四無色定真如非即四無量、四無色定非離四無量、四無色定，",
        "translation": "The four immeasurable and four formless concentrations are really not the same as the four immeasurable and four formless concentrations, which are not separate from the four immeasurable and four formless concentrations.",
        "source": "T06n0220_328:0680c21_6"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680c22_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c22_8"
    },
    {
        "source_sentence": "八解脫真如非即八解脫非離八解脫，是故甚深；",
        "translation": "The eight liberations really are not the same as the eight liberations, and they are not separate from the eight liberations. Because of this, it is profound.",
        "source": "T06n0220_328:0680c23_9"
    },
    {
        "source_sentence": "八勝處、九次第定、十遍處真如非即八勝處、九次第定、十遍處非離八勝處、九次第定、十遍處，",
        "translation": "The eight spheres of mastery, the nine graduated concentrations and ten universal abodes are truly not the eight spheres of mastery, the nine graduated concentrations and ten universal abodes that are not separate from the eight spheres of master",
        "source": "T06n0220_328:0680c24_10"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680c26_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c26_12"
    },
    {
        "source_sentence": "空解脫門真如非即空解脫門非離空解脫門，是故甚深；",
        "translation": "The gate of liberation through emptiness is really not the gate of liberation through emptiness; it is not the gate of liberation through emptiness apart from emptiness. Because of this, it is profound.",
        "source": "T06n0220_328:0680c26_13"
    },
    {
        "source_sentence": "無相、無願解脫門真如非即無相、無願解脫門非離無相、無願解脫門，",
        "translation": "The liberation gate of signlessness and wishlessness is really not the liberation gate of signlessness, but it’s not free from signlessness and wishlessness.",
        "source": "T06n0220_328:0680c27_14"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0680c29_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0680c29_16"
    },
    {
        "source_sentence": "極喜地真如非即極喜地非離極喜地，是故甚深；",
        "translation": "The real nature of the state of ultimate bliss is neither the state of ultimate bliss nor apart from the state of ultimate bliss. That is why it is so profound.",
        "source": "T06n0220_328:0680c29_17"
    },
    {
        "source_sentence": "離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地真如非即離垢地乃至法雲地非離離垢地乃至法雲地，",
        "translation": "It's the ground of freedom from defilement, the ground of emission of light, the ground of burning wisdom, the ground of extreme difficulty, the ground of presence, the ground of distant action, the ground of immovability, the ground of good wisdom",
        "source": "T06n0220_328:0681a01_18"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0681a04_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a05_0"
    },
    {
        "source_sentence": "五眼真如非即五眼非離五眼，是故甚深；",
        "translation": "The reality of the five eyes is not the same as the five eyes, which are not separate from the five eyes. That is why it is so profound.",
        "source": "T06n0220_328:0681a05_1"
    },
    {
        "source_sentence": "六神通真如非即六神通非離六神通，是故甚深。",
        "translation": "The true nature of the six supernormal powers is not that the six supernormal powers are not separate from the six supernormal powers, which is why they're so profound.",
        "source": "T06n0220_328:0681a06_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a07_3"
    },
    {
        "source_sentence": "三摩地門真如非即三摩地門非離三摩地門，是故甚深；",
        "translation": "The approach of concentration is really not the same as the approach of concentration; it is not separate from the approach of concentration. Because of this, it is profound.",
        "source": "T06n0220_328:0681a07_4"
    },
    {
        "source_sentence": "陀羅尼門真如非即陀羅尼門非離陀羅尼門，是故甚深。",
        "translation": "The dhāraṇī aspect of true thusness isn't the dhāraṇī aspect, and the dhāraṇī aspect isn't separate from the dhāraṇī aspect; therefore, it's profound.",
        "source": "T06n0220_328:0681a08_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a09_6"
    },
    {
        "source_sentence": "佛十力真如非即佛十力非離佛十力，是故甚深；",
        "translation": "The ten powers of buddhas are really not the same as the ten powers of buddhas; they are not apart from the ten powers of buddhas. That is why they are profound.",
        "source": "T06n0220_328:0681a10_0"
    },
    {
        "source_sentence": "四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法真如非即四無所畏乃至十八佛不共法非離四無所畏乃至十八佛不共法，",
        "translation": "The four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, great equanimity, and the true nature of the 18 Buddha-uncommon dharmas",
        "source": "T06n0220_328:0681a11_1"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0681a14_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a14_3"
    },
    {
        "source_sentence": "無忘失法真如非即無忘失法非離無忘失法，是故甚深；",
        "translation": "The state of absence of forgetfulness is really not the same as the state of absence of forgetfulness, which is not apart from the state of absence of forgetfulness. Because of this, it is profound.",
        "source": "T06n0220_328:0681a14_4"
    },
    {
        "source_sentence": "恒住捨性真如非即恒住捨性非離恒住捨性，是故甚深。",
        "translation": "The nature of eternally abiding equanimity is truly nonexistent, which means that the nature of eternally abiding equanimity isn't free from the nature of eternally abiding equanimity; therefore, it's profound.",
        "source": "T06n0220_328:0681a15_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a17_0"
    },
    {
        "source_sentence": "預流果真如非即預流果非離預流果，是故甚深；",
        "translation": "The true nature of the fruit of stream-winner is not that which is a fruit of stream-winner and not what is apart from the fruit of stream-winner. Because of this, it is profound.",
        "source": "T06n0220_328:0681a17_1"
    },
    {
        "source_sentence": "一來、不還、阿羅漢果真如非即一來、不還、阿羅漢果非離一來、不還、阿羅漢果，",
        "translation": "The true nature of the once-returner, nonreturner, and arhatship fruits is not the once-returner, nonreturner, and arhatship fruits that are not separate from the once-returner, nonreturner, and arhatship fruits.",
        "source": "T06n0220_328:0681a18_2"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0681a20_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a20_1"
    },
    {
        "source_sentence": "獨覺菩提真如非即獨覺菩提非離獨覺菩提，是故甚深。",
        "translation": "The true nature of solitary realizer's enlightenment isn't that which is solitary realizer's enlightenment, and it's not separate from solitary realizer's enlightenment; therefore, it's",
        "source": "T06n0220_328:0681a20_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a21_3"
    },
    {
        "source_sentence": "一切智真如非即一切智非離一切智，是故甚深；",
        "translation": "The reality of omniscience is not the same as omniscience; it is not apart from omniscience. That is why it is profound.",
        "source": "T06n0220_328:0681a21_4"
    },
    {
        "source_sentence": "道相智、一切相智真如非即道相智、一切相智非離道相智、一切相智，",
        "translation": "The true nature of knowledge of the path and knowledge of all characteristics is not knowledge of the path; knowledge of all characteristics is not apart from knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_328:0681a22_5"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0681a24_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a24_7"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行真如非即一切菩薩摩訶薩行非離一切菩薩摩訶薩行，",
        "translation": "The practice of all bodhisattva-mahāsattvas is truly not the practice of all bodhisattva-mahāsattvas, which is not free from all bodhisattva-mahāsattva practices.",
        "source": "T06n0220_328:0681a24_8"
    },
    {
        "source_sentence": "是故甚深。",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0681a26_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_328:0681a26_10"
    },
    {
        "source_sentence": "諸佛無上正等菩提真如非即諸佛無上正等菩提非離諸佛無上正等菩提，",
        "translation": "The true nature of the buddhas’ supreme perfect enlightenment is not the supreme perfect enlightenment of the buddhas, and it is not apart from the supreme perfect enlightenment of the buddhas.",
        "source": "T06n0220_328:0681a26_11"
    },
    {
        "source_sentence": "是故甚深。」",
        "translation": "Therefore, it's profound.",
        "source": "T06n0220_328:0681a28_12"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣諸色顯示涅槃，",
        "translation": "It was then that Gosshou Shancheng said to the Buddha, Bhagavān, what a marvelous and subtle skillful means is it for the bodhisattva Mahāsattva of the stage of nonretrogression to shield himself from",
        "source": "T06n0220_328:0681a29_0"
    },
    {
        "source_sentence": "遮遣受、想、行、識顯示涅槃。",
        "translation": "They reject feeling, perception, volition, and consciousness to show nirvāṇa.",
        "source": "T06n0220_328:0681b02_1"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼處顯示涅槃，遮遣耳、鼻、舌、身、意處顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to show nirvāṇa by rejecting the sense-field of the eye and by rejecting the",
        "source": "T06n0220_328:0681b02_2"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣色處顯示涅槃，遮遣聲、香、味、觸、法處顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to show nirvāṇa by rejecting the form realm and showing nirvāṇa by reject",
        "source": "T06n0220_328:0681b04_3"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼界顯示涅槃，遮遣耳、鼻、舌、身、意界顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to reject the eye realm to show nirvāṇa and reject the ear, nose, nos",
        "source": "T06n0220_328:0681b07_4"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣色界顯示涅槃，遮遣聲、香、味、觸、法界顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to shield himself from the form realm and show nirvāṇa, and he shields himself from",
        "source": "T06n0220_328:0681b09_5"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼識界顯示涅槃，遮遣耳、鼻、舌、身、意識界顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to reject the element of eye consciousness and show nirvāṇa by rejecting the element of",
        "source": "T06n0220_328:0681b11_6"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼觸顯示涅槃，遮遣耳、鼻、舌、身、意觸顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to shield himself from eye contact and show nirvāṇa by rejecting ear, nose, nos",
        "source": "T06n0220_328:0681b13_7"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼觸為緣所生諸受顯示涅槃，",
        "translation": "“World-honored One, this marvelous and subtle technique of the bodhisattva Mahāsattva who is in the stage of nonretrogression shields himself from the sensations that arise by means of visual contact to show nirvana.",
        "source": "T06n0220_328:0681b16_8"
    },
    {
        "source_sentence": "遮遣耳、鼻、舌、身、意觸為緣所生諸受顯示涅槃。",
        "translation": "They reject sensations that arise from the ear, nose, tongue, body, and mind contact as conditions to show nirvāṇa.",
        "source": "T06n0220_328:0681b17_9"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣地界顯示涅槃，遮遣水、火、風、空、識界顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva of the stage of nonretrogression to shield himself from the earth realm to show nirvāṇa and to shield himself from the water",
        "source": "T06n0220_328:0681b19_0"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣無明顯示涅槃，遮遣行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to shield himself from ignorance and show nirvāṇa by rejecting form, consciousness,",
        "source": "T06n0220_328:0681b21_1"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣布施波羅蜜多顯示涅槃，",
        "translation": "“World-honored One, it is most wonderful and subtle that the bodhisattva Mahāsattva of the stage of nonretrogression should manifest nirvana by means of the perfection of generosity.",
        "source": "T06n0220_328:0681b25_0"
    },
    {
        "source_sentence": "遮遣淨戒、安忍、精進、靜慮、般若波羅蜜多顯示涅槃。",
        "translation": "They reject the pure precepts, patience, effort, meditation, and prajñāpāramitā that show nirvāṇa.",
        "source": "T06n0220_328:0681b26_1"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣內空顯示涅槃，遮遣外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空顯示涅槃。",
        "translation": "Bhagavān, it's a very marvelous and subtle method for the bodhisattva Mahāsattva of the stage of nonretrogression to refute internal emptiness and show nirvāṇa by refuting external emptiness, internal",
        "source": "T06n0220_328:0681b27_2"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣真如顯示涅槃，遮遣法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva of the stage of nonretrogression to shield himself from the true reality and show nirvāṇa by rejecting the Dharma realm,",
        "source": "T06n0220_328:0681c04_3"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣四念住顯示涅槃，遮遣四正斷、四神足、五根、五力、七等覺支、八聖道支顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to reject the four abodes of mindfulness that show nirvāṇa and reject the fourfold correct elimina",
        "source": "T06n0220_328:0681c07_4"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣苦聖諦顯示涅槃，遮遣集、滅、道聖諦顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to show nirvāṇa by refuting the noble truth of suffering and revealing nirvāṇa by",
        "source": "T06n0220_328:0681c10_5"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣四靜慮顯示涅槃，遮遣四無量、四無色定顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to shield himself from the four meditations to show nirvāṇa and to shield himself from the four",
        "source": "T06n0220_328:0681c12_6"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣八解脫顯示涅槃，遮遣八勝處、九次第定、十遍處顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to shield himself from the eight liberations and show nirvāṇa, and he shields himself from",
        "source": "T06n0220_328:0681c15_7"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣空解脫門顯示涅槃，",
        "translation": "“World-honored One, this marvelous and subtle technique of the World-honored One reveals nirvana to the bodhisattva Mahāsattva at the stage of irreversibility through the liberation door of emptiness by refuting all",
        "source": "T06n0220_328:0681c17_8"
    },
    {
        "source_sentence": "遮遣無相、無願解脫門顯示涅槃。",
        "translation": "It's the liberation that rejects the approach of marklessness and wishlessness and shows nirvāṇa.",
        "source": "T06n0220_328:0681c19_9"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣極喜地顯示涅槃，遮遣離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva who doesn't regress from the stage of nonretrogression to show nirvāṇa by rejecting the stage of ultimate joy,",
        "source": "T06n0220_328:0681c20_10"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣五眼顯示涅槃，遮遣六神通顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to remove the five eyes that show nirvāṇa and remove the six supernormal powers that show nir",
        "source": "T06n0220_328:0681c23_11"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣三摩地門顯示涅槃，",
        "translation": "“World-honored One, it is most wonderful and subtle that the bodhisattva Mahāsattva of the stage of nonretrogression reveals nirvana through the entrance into absorption free from defilement.",
        "source": "T06n0220_328:0681c25_12"
    },
    {
        "source_sentence": "遮遣陀羅尼門顯示涅槃。",
        "translation": "They reject the dhāraṇī teachings that show nirvāṇa.",
        "source": "T06n0220_328:0681c27_13"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣佛十力顯示涅槃，遮遣四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to reject the Buddha's ten powers to show nirvāṇa and reject the four fearless",
        "source": "T06n0220_328:0681c27_14"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣無忘失法顯示涅槃，",
        "translation": "“World-honored One, it is most wonderful and subtle that the bodhisattva Mahāsattva of the stage of nonretrogression should manifest nirvana by means of such skillful means as refuting ignorance and forgetfulness.",
        "source": "T06n0220_328:0682a02_15"
    },
    {
        "source_sentence": "遮遣恒住捨性顯示涅槃。",
        "translation": "He refutes the eternally abiding nature of equanimity and shows nirvāṇa.",
        "source": "T06n0220_328:0682a03_16"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣預流果顯示涅槃，遮遣一來、不還、阿羅漢果顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva of the stage of nonretrogression to shield himself from the fruit of stream-entry to show nirvāṇa and to shield himself",
        "source": "T06n0220_328:0682a04_17"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣獨覺菩提顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva of the stage of nonretrogression to shield himself from the solitary realizer's enlightenment and show nirvāṇa",
        "source": "T06n0220_328:0682a06_18"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣一切智顯示涅槃，遮遣道相智、一切相智顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva in the stage of nonretrogression to shield himself from omniscience and show nirvāṇa and to shield himself from the cognition of",
        "source": "T06n0220_328:0682a08_19"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣一切菩薩摩訶薩行顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva of the stage of nonretrogression to shield himself from all the bodhisattva-mahāsattva practices and show nirvā",
        "source": "T06n0220_328:0682a10_20"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣諸佛無上正等菩提顯示涅槃。",
        "translation": "Bhagavān, it's a marvelous and subtle method for the nonretrogressing bodhisattva Mahāsattva to shield himself from the buddhas of unsurpassed perfect enlightenment and show nirvāṇa.",
        "source": "T06n0220_328:0682a12_21"
    },
    {
        "source_sentence": "「世尊甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣一切若世間若出世間、若共若不共、若有漏若無漏、若有為若無為法顯示涅槃。」",
        "translation": "Bhagavān, it's a marvelous and subtle method for the bodhisattva Mahāsattva of the stage of nonretrogression to shield himself from all worldly and transmundane things, whether shared or not, whether contaminated or",
        "source": "T06n0220_328:0682a14_22"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_328:0682a17_23"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_328:0682a17_24"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_328:0682a17_25"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_328:0682a18_0"
    },
    {
        "source_sentence": "佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣諸色顯示涅槃，遮遣受、想、行、識顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting form, and he shows nirvāṇa by rejecting sensation, per",
        "source": "T06n0220_328:0682a18_1"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼處顯示涅槃，遮遣耳、鼻、舌、身、意處顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the eye, and he shows nirvāṇa by rejecting the ear",
        "source": "T06n0220_328:0682a20_2"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣色處顯示涅槃，遮遣聲、香、味、觸、法處顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting form, and he shows nirvāṇa by rejecting sounds, smell",
        "source": "T06n0220_328:0682a23_0"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼界顯示涅槃，遮遣耳、鼻、舌、身、意界顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the eye realm and showing nirvāṇa for the ear, nose",
        "source": "T06n0220_328:0682a25_1"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣色界顯示涅槃，遮遣聲、香、味、觸、法界顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the form realm and refuting the sound, odor, taste, touch",
        "source": "T06n0220_328:0682a27_2"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼識界顯示涅槃，遮遣耳、鼻、舌、身、意識界顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the element of eye consciousness and the element of ear, nose,",
        "source": "T06n0220_328:0682a29_3"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼觸顯示涅槃，遮遣耳、鼻、舌、身、意觸顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting eye contact, and he shows nirvāṇa by rejecting ear,",
        "source": "T06n0220_328:0682b03_4"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣眼觸為緣所生諸受顯示涅槃，",
        "translation": "“Furthermore, by means of subtle and marvelous skillful means, the Buddha manifested nirvana for the bodhisattva Mahāsattva who was in the stage of nonretrogression, turning away all sensations that arose from visual",
        "source": "T06n0220_328:0682b05_5"
    },
    {
        "source_sentence": "遮遣耳、鼻、舌、身、意觸為緣所生諸受顯示涅槃。",
        "translation": "They reject sensations that arise from the ear, nose, tongue, body, and mind contact as conditions to show nirvāṇa.",
        "source": "T06n0220_328:0682b07_6"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣地界顯示涅槃，遮遣水、火、風、空、識界顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva of the stage of nonretrogression who shields himself from the earth realm and reveals nirvāṇa, and he",
        "source": "T06n0220_328:0682b08_7"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣無明顯示涅槃，遮遣行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting nescience and refuting form, consciousness, name-and-form",
        "source": "T06n0220_328:0682b10_8"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣布施波羅蜜多顯示涅槃，",
        "translation": "“Buddha, by means of a most wonderful and subtle technique, reveals nirvana to the bodhisattva Mahāsattva in the stage of nonregression through the perfection of generosity.",
        "source": "T06n0220_328:0682b13_9"
    },
    {
        "source_sentence": "遮遣淨戒、安忍、精進、靜慮、般若波羅蜜多顯示涅槃。",
        "translation": "They reject the pure precepts, patience, effort, meditation, and prajñāpāramitā that show nirvāṇa.",
        "source": "T06n0220_328:0682b15_10"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣內空顯示涅槃，遮遣外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by refuting internal emptiness and showing nirvāṇa, and he refutes external emp",
        "source": "T06n0220_328:0682b16_11"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣真如顯示涅槃，遮遣法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the true reality and refuting the Dharma realm, Dharma nature, non-",
        "source": "T06n0220_328:0682b21_12"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣四念住顯示涅槃，遮遣四正斷、四神足、五根、五力、七等覺支、八聖道支顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva of the stage of nonretrogression by rejecting the four abodes of mindfulness, the four correct eliminations, the four mira",
        "source": "T06n0220_328:0682b25_13"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣苦聖諦顯示涅槃，遮遣集、滅、道聖諦顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression who refutes the noble truth of suffering and refutes the noble truths of accumulation",
        "source": "T06n0220_328:0682b28_14"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣四靜慮顯示涅槃，遮遣四無量、四無色定顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by refuting the four meditations and refuting the four immeasurable and four formless",
        "source": "T06n0220_328:0682c01_15"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣八解脫顯示涅槃，遮遣八勝處、九次第定、十遍處顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by excluding the eight liberations, and he excludes the eight abodes of excellence,",
        "source": "T06n0220_328:0682c03_16"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣空解脫門顯示涅槃，",
        "translation": "“Buddha manifests nirvana for the bodhisattva mahāsattva of the stage of nonregression by means of a most wonderful and subtle technique, which is to shield himself from the liberation through emptiness.",
        "source": "T06n0220_328:0682c06_17"
    },
    {
        "source_sentence": "遮遣無相、無願解脫門顯示涅槃。",
        "translation": "It's the liberation that rejects the approach of marklessness and wishlessness and shows nirvāṇa.",
        "source": "T06n0220_328:0682c07_18"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣極喜地顯示涅槃，遮遣離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva who doesn't regress in the stage of nonretrogression by rejecting the stage of ultimate joy, the stage of",
        "source": "T06n0220_328:0682c08_19"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣五眼顯示涅槃，遮遣六神通顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the five eyes and rejecting the six supernormal powers to show ni",
        "source": "T06n0220_328:0682c12_20"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣三摩地門顯示涅槃，",
        "translation": "“Buddha, by means of a most wonderful and subtle technique, manifests nirvana for the bodhisattva Mahāsattva in the stage of nonretrogression through the door of cessation of samādhi.",
        "source": "T06n0220_328:0682c14_21"
    },
    {
        "source_sentence": "遮遣陀羅尼門顯示涅槃。",
        "translation": "They reject the dhāraṇī teachings that show nirvāṇa.",
        "source": "T06n0220_328:0682c15_22"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣佛十力顯示涅槃，遮遣四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva of the stage of nonretrogression who rejects the Buddha's ten powers and rejects the four fearlessness",
        "source": "T06n0220_328:0682c16_23"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣無忘失法顯示涅槃，",
        "translation": "“Buddha manifests nirvana for the sake of enlightening beings in the stage of nonregression by means of subtle and marvelous skillful means.",
        "source": "T06n0220_328:0682c19_24"
    },
    {
        "source_sentence": "遮遣恒住捨性顯示涅槃。",
        "translation": "He refutes the eternally abiding nature of equanimity and shows nirvāṇa.",
        "source": "T06n0220_328:0682c21_25"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣預流果顯示涅槃，遮遣一來、不還、阿羅漢果顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the fruit of pre-flow, and he shows nirvāṇa by re",
        "source": "T06n0220_328:0682c21_26"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣獨覺菩提顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to shield the bodhisattva-mahāsattva of the stage of nonretrogression from the solitary realizer's enlightenment and show nirvāṇa for the sake of",
        "source": "T06n0220_328:0682c24_27"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣一切智顯示涅槃，遮遣道相智、一切相智顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting omniscience and showing nirvāṇa, and he shows nirvāṇa",
        "source": "T06n0220_328:0682c25_28"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣一切菩薩摩訶薩行顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to shield the bodhisattva-mahāsattva of the stage of nonretrogression from all the bodhisattva-mahāsattva practices in order to show nirvāṇa.",
        "source": "T06n0220_328:0682c28_29"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣諸佛無上正等菩提顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva Mahāsattva in the stage of nonretrogression by rejecting the buddhas' unsurpassed perfect enlightenment.",
        "source": "T06n0220_328:0683a01_30"
    },
    {
        "source_sentence": "「佛以甚奇微妙方便，為不退轉地菩薩摩訶薩遮遣一切若世間若出世間、若共若不共、若有漏若無漏、若有為若無為法顯示涅槃。",
        "translation": "The Buddha uses a very marvelous and subtle method to show nirvāṇa for the bodhisattva-mahāsattva in the stage of nonretrogression, whether mundane or transmundane, shared or distinct, contaminated or uncontamina",
        "source": "T06n0220_328:0683a03_0"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百二十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 38",
        "source": "T06n0220_328:0683a06_0"
    }
]