[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 4",
        "source": "T06n0220_341:0748b14_0"
    },
    {
        "source_sentence": "十一",
        "translation": "eleven",
        "source": "T06n0220_341:0748b15_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_341:0748b17_0"
    },
    {
        "source_sentence": "初分巧便學品第五十五之五",
        "translation": "The Fifty-fifth and Fifty-fifth Part of the Chapter on Skillful Learning in the First Part",
        "source": "T06n0220_341:0748b18_0"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0748b19_0"
    },
    {
        "source_sentence": "如汝所說『若菩薩摩訶薩為如來盡故學，是學一切智智不？",
        "translation": "As you say, 'If a bodhisattva-mahāsattva trains for the sake of the Tathāgata's exhaustion, is this training in omniscience?'",
        "source": "T06n0220_341:0748b19_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩為如來離故學，是學一切智智不？",
        "translation": "If a bodhisattva-mahāsattva trains for the sake of the Tathāgata's separation, is this training in omniscience?",
        "source": "T06n0220_341:0748b20_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩為如來滅故學，是學一切智智不？",
        "translation": "If a bodhisattva-mahāsattva trains for the sake of the Tathāgata's cessation, is this training in omniscience?",
        "source": "T06n0220_341:0748b21_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩為如來無生故學，是學一切智智不？",
        "translation": "If a bodhisattva-mahāsattva trains for the sake of the Tathāgata's nonarising, is this training in omniscience?",
        "source": "T06n0220_341:0748b22_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩為如來無滅故學，是學一切智智不？",
        "translation": "If a bodhisattva-mahāsattva trains for the sake of the Tathāgata's noncessation, is this training in omniscience?",
        "source": "T06n0220_341:0748b24_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩為如來本來寂靜故學，是學一切智智不？",
        "translation": "If a bodhisattva-mahāsattva trains for the sake of the original quiescence of the Tathāgata, is this training in omniscience?",
        "source": "T06n0220_341:0748b25_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩為如來自性涅槃故學，是學一切智智不？』",
        "translation": "If a bodhisattva-mahāsattva trains for the sake of the Tathāgata's nature and nirvāṇa, is this training in omniscience?'",
        "source": "T06n0220_341:0748b26_2"
    },
    {
        "source_sentence": "者，善現！",
        "translation": "That's, well done!",
        "source": "T06n0220_341:0748b27_3"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_341:0748b27_4"
    },
    {
        "source_sentence": "如來真如盡、滅、斷不？」",
        "translation": "Is the Tathāgata's true nature exhausted, ceased, and eliminated?",
        "source": "T06n0220_341:0748b28_5"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_341:0748b28_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0748b29_0"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_341:0748b29_1"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T06n0220_341:0748b29_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0748b29_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩於真如如是學，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva thus trains in the true nature, this is training in omniscience.",
        "source": "T06n0220_341:0748b29_4"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_341:0748c01_5"
    },
    {
        "source_sentence": "真如無盡、無滅、無斷、不可作證，若菩薩摩訶薩於真如如是學，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva thus trains in the true teaching, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0748c01_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0748c04_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學布施波羅蜜多，是學淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "If a bodhisattva Mahāsattva thus trains, this is training in the perfection of generosity, which is training in the perfections of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T06n0220_341:0748c04_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩學布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in generosity, pure morality, patience, effort, meditation, and the perfection of wisdom, this is training in omniscience.",
        "source": "T06n0220_341:0748c06_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0748c08_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學內空，是學外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is training in internal emptiness, which is training in external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self",
        "source": "T06n0220_341:0748c08_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩學內空、外空乃至無性自性空，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in internal emptiness, external emptiness, or even the emptiness of the natureless self-nature of emptiness, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0748c12_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0748c14_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學真如，是學法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界。",
        "translation": "If a bodhisattva Mahāsattva thus trains, this is training in the true nature of training, which is training in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm.",
        "source": "T06n0220_341:0748c14_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩學真如、法界乃至不思議界，是學一切智智。",
        "translation": "If a bodhisattva Mahāsattva trains in the true nature, the Dharma realm or even the inconceivable realm, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0748c17_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0748c18_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學苦聖諦，是學集、滅、道聖諦。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is the noble truth of training in suffering and the noble truths of training in accumulation, cessation, and the path.",
        "source": "T06n0220_341:0748c18_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩學苦、集、滅、道聖諦，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the noble truths of suffering, arising, cessation, and the path, this is training in omniscience.",
        "source": "T06n0220_341:0748c19_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0748c21_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學四靜慮，是學四無量、四無色定。",
        "translation": "If a bodhisattva Mahāsattva thus trains, these are the four meditations that he trains in, and these are the four immeasurable and four formless concentrations that he trains in.",
        "source": "T06n0220_341:0748c21_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩學四靜慮、四無量、四無色定，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the four meditations, four immeasurable concentrations, and four formless concentrations, this is training in omniscience.",
        "source": "T06n0220_341:0748c22_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0748c24_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學八解脫，是學八勝處、九次第定、十遍處。",
        "translation": "If a bodhisattva-mahāsattva thus trains, these are the eight liberations of training, which are the eight abodes of excellence, nine graduated concentrations, and ten universal abodes of training.",
        "source": "T06n0220_341:0748c24_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩學八解脫、八勝處、九次第定、十遍處，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the eight liberations, the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes, this is training in omniscience.",
        "source": "T06n0220_341:0748c25_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0748c28_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學四念住，是學四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "If bodhisattvas and mahāsattvas thus train, they're training in the four abodes of mindfulness, which are the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_341:0748c28_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩學四念住、四正斷乃至八聖道支，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the four abodes of mindfulness, the four correct eliminations, or even the eight noble factors of the path, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0749a01_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a02_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學空解脫門，是學無相、無願解脫門。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is the liberation gate of training in emptiness, and this is the liberation gate of training in signlessness and wishlessness.",
        "source": "T06n0220_341:0749a03_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩學空、無相、無願解脫門，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the liberation gate of emptiness, signlessness, and wishlessness, this is training in omniscience.",
        "source": "T06n0220_341:0749a04_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a05_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學極喜地，是學離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地。",
        "translation": "If a bodhisattva Mahāsattva thus trains, he's training in the stage of ultimate joy, the stage of freedom from defilement, the stage of arousing light, the stage of burning wisdom, the stage of being extremely difficult to overcome, the stage of manifesting, the stage of traveling far away, the stage of not moving, the stage of good wisdom,",
        "source": "T06n0220_341:0749a05_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩學極喜地、離垢地乃至法雲地，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the ground of ultimate joy, the ground of freedom from defilement, or even the ground of the Dharma cloud, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0749a08_4"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a09_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學五眼，是學六神通。",
        "translation": "If a bodhisattva-mahāsattva thus trains, these are the five eyes of training and the six supernormal powers of training.",
        "source": "T06n0220_341:0749a10_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩學五眼、六神通，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the five eyes and six supernormal powers, he's training in omniscience.",
        "source": "T06n0220_341:0749a11_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a12_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學佛十力，是學四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法。",
        "translation": "If a bodhisattva-mahāsattva thus trains, these are the ten powers of the Buddha's training, which are the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the 18 uncommon dharmas of the Buddha.",
        "source": "T06n0220_341:0749a12_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩學佛十力、四無所畏乃至十八佛不共法，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the Buddha's ten powers, four fearlessnesses, or even 18 uncommon dharmas of the Buddha, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0749a14_10"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a16_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學無忘失法，是學恒住捨性。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is training that doesn't forget the Dharma, which is training that always abides in equanimity.",
        "source": "T06n0220_341:0749a16_12"
    },
    {
        "source_sentence": "若菩薩摩訶薩學無忘失法、恒住捨性，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the absence of forgetfulness and always abides in equanimity, this is training in omniscience.",
        "source": "T06n0220_341:0749a18_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a19_14"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學一切智，是學道相智、一切相智。",
        "translation": "If a bodhisattva-mahāsattva thus trains, it's training in omniscience, and it's training in knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_341:0749a19_15"
    },
    {
        "source_sentence": "若菩薩摩訶薩學一切智、道相智、一切相智，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in omniscience, knowledge of the path, and knowledge of all characteristics, this is training in omniscience.",
        "source": "T06n0220_341:0749a20_16"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a22_17"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學一切陀羅尼門，是學一切三摩地門。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is the method of training in all dhāraṇī teachings and the method of training in all samādhis.",
        "source": "T06n0220_341:0749a22_18"
    },
    {
        "source_sentence": "若菩薩摩訶薩學一切陀羅尼門、一切三摩地門，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in all dhāraṇī teachings and all samādhi teachings, he's training in all kinds of cognition.",
        "source": "T06n0220_341:0749a24_19"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a26_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學一切菩薩摩訶薩行。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is training in all the bodhisattva-mahāsattva practices.",
        "source": "T06n0220_341:0749a26_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩學一切菩薩摩訶薩行，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in all the bodhisattva-mahāsattva practices, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0749a27_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749a28_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學諸佛無上正等菩提。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is training for the unsurpassed correct perfect enlightenment of the buddhas.",
        "source": "T06n0220_341:0749a28_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩學諸佛無上正等菩提，是學一切智智。",
        "translation": "If a bodhisattva-mahāsattva trains in the buddhas' unsurpassed perfect enlightenment, this is training in omniscience and cognition.",
        "source": "T06n0220_341:0749b01_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749b02_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，至一切學圓滿彼岸。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll reach the other shore where all his training is complete.",
        "source": "T06n0220_341:0749b02_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，一切天魔及諸外道皆不能壞。",
        "translation": "If a bodhisattva-mahāsattva thus trains, all gods, Māra, and non-Buddhists won't be able to break it down.",
        "source": "T06n0220_341:0749b03_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，疾至菩薩不退轉地。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he quickly reaches the stage of nonretrogression for bodhisattvas.",
        "source": "T06n0220_341:0749b04_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，行自祖父一切如來、應、正等覺所應行處。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll practice the places where all tathāgatas, arhats, and perfectly enlightened ones of his own grandfather should practice.",
        "source": "T06n0220_341:0749b05_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，於能護法無倒隨轉。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll be able to protect the Dharma without error and follow it.",
        "source": "T06n0220_341:0749b07_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，能行離闇所應作法。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll be able to practice the method of freedom from darkness that should be done.",
        "source": "T06n0220_341:0749b08_12"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學嚴淨自佛土法。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he's training in the method of purifying his own Buddha land.",
        "source": "T06n0220_341:0749b09_13"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學成熟諸有情法。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is training in the ways to ripen sentient beings.",
        "source": "T06n0220_341:0749b10_14"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，便能如實嚴淨佛土。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll be able to truly adorn and purify the Buddha land.",
        "source": "T06n0220_341:0749b11_15"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，便能如實成熟有情。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll be able to truly ripen sentient beings.",
        "source": "T06n0220_341:0749b12_16"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，則能發起大慈大悲哀愍一切。",
        "translation": "If a bodhisattva-mahāsattva thus trains, then he'll be able to give rise to great kindness and compassion and pity for all.",
        "source": "T06n0220_341:0749b13_17"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學三轉十二行相微妙法輪。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is training in the subtle Dharma wheel of the three turns and twelve practices.",
        "source": "T06n0220_341:0749b15_18"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學度脫一切有情置無餘依般涅槃界。",
        "translation": "If a bodhisattva-mahāsattva thus trains, it's training to liberate all sentient beings and place them in the parinirvāṇa realm without remainder.",
        "source": "T06n0220_341:0749b16_19"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學不斷佛種妙行。",
        "translation": "If a bodhisattva-mahāsattva thus trains, this is training that doesn't stop the marvelous practice of the Buddha's seed.",
        "source": "T06n0220_341:0749b17_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學諸佛為有情類開甘露門。",
        "translation": "If a bodhisattva-mahāsattva thus trains, it's when he trains that the buddhas open the ambrosia gate for sentient beings.",
        "source": "T06n0220_341:0749b19_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學安立無量無數無邊有情住三乘法。",
        "translation": "If a bodhisattva Mahāsattva thus trains, this is the training that establishes measureless, countless, and limitless sentient beings in the three-vehicle teaching.",
        "source": "T06n0220_341:0749b20_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，是學示現一切有情究竟寂滅真無為界，是真修學一切智智，",
        "translation": "“When great enlightening beings practice in this way, they are practicing to show all sentient beings the ultimate quiescence of the realm of nonexistence—the true cultivation of omniscience.",
        "source": "T06n0220_341:0749b21_2"
    },
    {
        "source_sentence": "如是學者下劣有情所不能學。",
        "translation": "Such a learner can't be trained by inferior sentient beings who are unable to learn.",
        "source": "T06n0220_341:0749b23_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，能實拔濟一切有情生老病死，令勤修學所應學處。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he can truly rescue all sentient beings from birth, old age, illness, and death and cause them to diligently cultivate the places where they should train.",
        "source": "T06n0220_341:0749b24_4"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749b27_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，決定不復墮於地獄、傍生、鬼界。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll surely no longer fall into hell, the unenlightened, or the realm of ghosts.",
        "source": "T06n0220_341:0749b27_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，決定不生邊地、達絮、蔑隷車中。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he's certain not to be born in a marginal place, a tathāgata, or a contemptuous chariot.",
        "source": "T06n0220_341:0749b28_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，決定不生旃荼羅家、補羯娑家，及餘種種貧窮、卑賤、不律儀家。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he's certain not to be born in the house of caṇḍāla, the house of pudgala, or any other house that's poor, inferior, or undisciplined.",
        "source": "T06n0220_341:0749b29_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，終不聾盲、瘖瘂、攣躄、根支不具、背僂、癲癎，",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll never be deaf and blind, dumb, convulsed, crippled, un supplied with faculties, backsliding, or epilepsy.",
        "source": "T06n0220_341:0749c02_4"
    },
    {
        "source_sentence": "及餘種種穢惡瘡病。",
        "translation": "and the other various defilements, bad sores, and illnesses.",
        "source": "T06n0220_341:0749c04_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，生生常得眷屬圓滿，形貌端嚴，言詞威肅，眾人愛敬。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll always attain the fulfillment of his retinue in birth and birth, have a dignified appearance, speak with authority, and be loved and respected by everyone.",
        "source": "T06n0220_341:0749c04_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，生生之處離害生命，離不與取、離欲邪行、離虛誑語、離麁惡語、離離間語、離雜穢語，",
        "translation": "If a bodhisattva Mahāsattva thus trains, he’s free of harming life wherever it arises, free of taking what’s not given, free of sexual misconduct, free of false speech, free of crude speech, free of harsh speech, free of indirect speech, and free of defiled speech.",
        "source": "T06n0220_341:0749c06_7"
    },
    {
        "source_sentence": "亦離貪欲、瞋恚、邪見。",
        "translation": "They're also free of desire, anger, and wrong views.",
        "source": "T06n0220_341:0749c09_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，生生之處不以邪法而自活命，終不攝受虛妄邪法，",
        "translation": "“When great enlightening beings study in this way, they do not rely on false teachings to sustain their livelihood wherever they are born. They never accept false or false teachings.",
        "source": "T06n0220_341:0749c09_9"
    },
    {
        "source_sentence": "亦不攝受破戒、惡見、謗法有情。",
        "translation": "Nor does he take in sentient beings who break the precepts, hold bad views, and denigrate the Dharma.",
        "source": "T06n0220_341:0749c11_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，終不生於耽樂少慧長壽天處。",
        "translation": "If a bodhisattva-mahāsattva thus trains, he'll never be born in the heaven of pleasure, little wisdom, or long life.",
        "source": "T06n0220_341:0749c12_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_341:0749c13_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩成就善巧方便勢力，由此善巧方便力故，雖能數入靜慮、無量及無色定，",
        "translation": "This is the power of the skillful means by which the great enlightening beings accomplish their skillful means. Because of this power of skillful means, even though they can enter meditation, immeasurable concentration, and formless concentration repeatedly",
        "source": "T06n0220_341:0749c13_2"
    },
    {
        "source_sentence": "而不隨彼勢力受生，甚深般若波羅蜜多所攝受故，成就如是善巧方便，",
        "translation": "They don't receive birth according to their power, because it's collected in the profound prajñāpāramitā, and they accomplish such skillful means.",
        "source": "T06n0220_341:0749c15_3"
    },
    {
        "source_sentence": "於諸定中雖常獲得入出自在，而不隨彼諸定勢力生長壽天，廢修菩薩摩訶薩行。",
        "translation": "Although they always attain freedom of entry and exit in the concentrations, they don't follow the power of those concentrations to grow into the long-lived gods and abandon the bodhisattva Mahāsattva practice.",
        "source": "T06n0220_341:0749c17_4"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749c20_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，於佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨及十八佛不共法等無量、無數、無邊佛法皆得清淨，",
        "translation": "“When great enlightening beings practice in this way, they attain purity of the Buddha’s ten powers, four fearlessnesses, four unhindered understandings, great benevolence, great compassion, great compassion, great joy, great equanimity, and the immeasurable, countless, boundless buddha-teachings of the eighteen kinds",
        "source": "T06n0220_341:0749c20_1"
    },
    {
        "source_sentence": "決定不墮一切聲聞及獨覺地。」",
        "translation": "They'll surely not fall into the stages of all śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_341:0749c23_2"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_341:0749c23_3"
    },
    {
        "source_sentence": "若一切法本性清淨，云何菩薩摩訶薩於諸法中復得清淨？」",
        "translation": "If the original nature of all dharmas is pure, how does a bodhisattva-mahāsattva again attain purity in dharmas?",
        "source": "T06n0220_341:0749c24_4"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T06n0220_341:0749c25_5"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_341:0749c26_6"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_341:0749c26_7"
    },
    {
        "source_sentence": "諸法本來自性清淨，是菩薩摩訶薩於一切法本性淨中，精勤修學甚深般若波羅蜜多，",
        "translation": "The original nature of all dharmas is inherently pure, and this is the profound prajñāpāramitā that the bodhisattva Mahāsattva diligently cultivates in the purity of the original nature of all dharmas.",
        "source": "T06n0220_341:0749c26_8"
    },
    {
        "source_sentence": "如實通達，無沒無滯，遠離一切煩惱染著故，說菩薩復得清淨。",
        "translation": "Because he truly comprehends, doesn't go down and doesn't stop, and is free of all afflictive defilements and attachments, he says that the bodhisattva again attains purity.",
        "source": "T06n0220_341:0749c28_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0749c29_10"
    },
    {
        "source_sentence": "雖一切法本性清淨，而諸異生不知、見、覺，是菩薩摩訶薩為欲令彼知、見、覺故，",
        "translation": "Although the essential nature of all things is pure, yet ordinary people don’t know, see, or feel them. This is because great enlightening beings want to make them know, see, and feel:",
        "source": "T06n0220_341:0750a01_11"
    },
    {
        "source_sentence": "修行布施波羅蜜多，修行淨戒、安忍、精進、靜慮、般若波羅蜜多；",
        "translation": "They cultivate the perfection of giving, and they cultivate the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_341:0750a02_12"
    },
    {
        "source_sentence": "安住內空，安住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；",
        "translation": "They abide in internal emptiness, and they abide in external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of specific characteristics, emptiness of shared characteristic",
        "source": "T06n0220_341:0750a04_13"
    },
    {
        "source_sentence": "安住真如，安住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；",
        "translation": "They dwelled in the realm of reality, the realm of reality; they dwelt in the realm of reality, the nature of reality, non-falsity, unchanging and dissimilarity, equality, freedom from arising, law, the abode of truth, reality, space, and inconceivable realms.",
        "source": "T06n0220_341:0750a07_14"
    },
    {
        "source_sentence": "安住苦聖諦，安住集、滅、道聖諦；",
        "translation": "They abide in the noble truth of suffering and in the noble truths of accumulation, cessation, and the path.",
        "source": "T06n0220_341:0750a10_15"
    },
    {
        "source_sentence": "修行四靜慮，修行四無量、四無色定；",
        "translation": "He practiced the four meditations and cultivated the four immeasurable concentrations and the four formless concentrations.",
        "source": "T06n0220_341:0750a10_16"
    },
    {
        "source_sentence": "修行八解脫，修行八勝處、九次第定、十遍處；",
        "translation": "They develop eight liberations: they develop the eight spheres of mastery, the nine graduated concentrations and the ten universal states.",
        "source": "T06n0220_341:0750a11_17"
    },
    {
        "source_sentence": "修行四念住，修行四正斷、四神足、五根、五力、七等覺支、八聖道支；",
        "translation": "He practiced the four abodes of mindfulness, cultivating the fourfold right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_341:0750a12_18"
    },
    {
        "source_sentence": "修行空解脫門，修行無相、無願解脫門；",
        "translation": "They cultivate the liberation door of emptiness, and they cultivate the liberation door signlessness and wishlessness.",
        "source": "T06n0220_341:0750a14_19"
    },
    {
        "source_sentence": "修行極喜地，修行離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地；",
        "translation": "They cultivate the state of ultimate bliss; they cultivate the state of freedom from defilement, the state of emission of light, the state of blazing wisdom, the state of extreme difficulty overcoming enemies, the state of direct presence, the state of remote travel, the state of immovability, the state of good wisdom, and the state of cloud of doctrine.",
        "source": "T06n0220_341:0750a14_20"
    },
    {
        "source_sentence": "修行五眼，修行六神通；",
        "translation": "They cultivate the five eyes and practice the six transcendent powers.",
        "source": "T06n0220_341:0750a17_0"
    },
    {
        "source_sentence": "修行佛十力，修行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；",
        "translation": "He practiced the ten powers of buddhahood, practicing the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great relinquishment, and the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_341:0750a17_1"
    },
    {
        "source_sentence": "修行無忘失法，修行恒住捨性；",
        "translation": "The practice of enlightening beings is the principle of nonforgetfulness, and their practice is always abiding in equanimity.",
        "source": "T06n0220_341:0750a19_2"
    },
    {
        "source_sentence": "修行一切陀羅尼門，修行一切三摩地門；",
        "translation": "He practiced all the methods of mental command and all the methods of concentration.",
        "source": "T06n0220_341:0750a19_3"
    },
    {
        "source_sentence": "修行一切智，修行道相智、一切相智。",
        "translation": "They cultivate omniscience, and they cultivate the knowledge of the path and the knowledge of all characteristics.",
        "source": "T06n0220_341:0750a20_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_341:0750a21_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切法本性清淨如是學時，於佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法等無量、無數、無邊佛法皆得清淨，",
        "translation": "When this bodhisattva Mahāsattva thus trains in the purity of the original nature of all dharmas, he attains purity with respect to the Buddha's ten powers, four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, 18 Buddha-uncommon dharmas, and other",
        "source": "T06n0220_341:0750a21_6"
    },
    {
        "source_sentence": "不墮聲聞及獨覺地。",
        "translation": "They won't fall into the stages of śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_341:0750a25_7"
    },
    {
        "source_sentence": "於諸有情心行差別，皆能通達至極彼岸善巧方便，令諸有情證一切法本性清淨。",
        "translation": "Regarding the distinctions in minds and actions of sentient beings, they can all comprehend the ultimate perfection of skillful means to cause sentient beings to realize the purity of the original nature of all dharmas.",
        "source": "T06n0220_341:0750a25_8"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_341:0750a27_9"
    },
    {
        "source_sentence": "譬如大地少處出生金銀珍寶，多處出生沙石瓦礫，諸有情類亦復如是，",
        "translation": "“Just as gold, silver, and precious treasures are produced in a few places on the great earth, whereas sand, stones, and rubble are produced in many places. So it is with all sentient beings:",
        "source": "T06n0220_341:0750a27_10"
    },
    {
        "source_sentence": "少分能學甚深般若波羅蜜多，多學聲聞、獨覺地法。",
        "translation": "A small part of them can study the profound prajñāpāramitā, and most of them study the teachings of the stages of śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_341:0750a29_11"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_341:0750b01_12"
    },
    {
        "source_sentence": "譬如人趣少分能修轉輪王業，多分受行諸小王業，諸有情類亦復如是，",
        "translation": "Good man, this is analogous to the case of humans who are only partially capable of practicing the deeds of a universal ruler and who are mostly subject to the deeds of lesser kings. Sentient beings are likewise.",
        "source": "T06n0220_341:0750b01_13"
    },
    {
        "source_sentence": "少分能修一切智智道，多分受行聲聞、獨覺道。",
        "translation": "A small part can cultivate the path of omniscience and knowledge, and a large part receive and practice the paths of śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_341:0750b03_14"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_341:0750b04_15"
    },
    {
        "source_sentence": "求趣無上正等菩提諸菩薩眾，少得無上正等菩提，多墮聲聞及獨覺地。",
        "translation": "The bodhisattvas who seek to attain unsurpassed perfect enlightenment rarely attain unsurpassed perfect enlightenment, and many of them fall into the stages of śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_341:0750b04_16"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_341:0750b06_17"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，若不遠離甚深般若波羅蜜多善巧方便，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle, if they aren't far removed from the skillful means of profound prajñāpāramitā,",
        "source": "T06n0220_341:0750b06_18"
    },
    {
        "source_sentence": "定能趣入不退轉地。",
        "translation": "He's certainly able to enter the stage of nonretrogression.",
        "source": "T06n0220_341:0750b08_19"
    },
    {
        "source_sentence": "若有遠離甚深般若波羅蜜多善巧方便，定於無上正等菩提當有退轉。",
        "translation": "If someone were to part with the skillful means of the profound prajñāpāramitā, they'd surely regress from unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0750b08_20"
    },
    {
        "source_sentence": "是故菩薩摩訶薩眾欲得菩薩不退轉地，欲入菩薩不退轉數，當勤修學甚深般若波羅蜜多善巧方便。",
        "translation": "Therefore, if the bodhisattvas, mahāsattvas, and others want to attain the stage of nonretrogression for bodhisattvas and want to enter the number of bodhisattvas who don't regress, they should diligently cultivate the skillful means of the profound prajñāpāramitā.",
        "source": "T06n0220_341:0750b10_21"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0750b13_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是修學甚深般若波羅蜜多善巧方便，終不發起慳貪、破戒、瞋忿、懈怠、散亂、惡慧相應之心；",
        "translation": "“If great enlightening beings thus cultivate the skillful means of profound prajñāpāramitā, they will never give rise to minds associated with stinginess and greed, breaking precepts, anger and resentment, laziness, dissipation, or evil wisdom.",
        "source": "T06n0220_341:0750b13_1"
    },
    {
        "source_sentence": "終不發起貪欲、瞋恚、愚癡、憍慢相應之心；",
        "translation": "They do not give rise to thoughts of desire, hatred, folly, or arrogance.",
        "source": "T06n0220_341:0750b15_2"
    },
    {
        "source_sentence": "終不發起諸餘過失相應之心；",
        "translation": "They never give rise to thoughts associated with other faults.",
        "source": "T06n0220_341:0750b16_3"
    },
    {
        "source_sentence": "終不發起執取色相相應之心，亦不發起執取受、想、行、識相相應之心；",
        "translation": "They do not give rise to thoughts associated with grasping form, and they do not give rise to thoughts associated with grasping sensation, perception, volition, or consciousness.",
        "source": "T06n0220_341:0750b17_4"
    },
    {
        "source_sentence": "終不發起執取眼處相相應之心，亦不發起執取耳、鼻、舌、身、意處相相應之心；",
        "translation": "They do not give rise to thoughts that are associated with the sense-fields of sight, hearing, smell, taste, touch, and thought.",
        "source": "T06n0220_341:0750b18_5"
    },
    {
        "source_sentence": "終不發起執取色處相相應之心，亦不發起執取聲、香、味、觸、法處相相應之心；",
        "translation": "They do not give rise to thoughts that are associated with the grasping of form. Nor do they give rise to thoughts that are associated with the grasping of sound, odor, taste, touch, and dharma fields.",
        "source": "T06n0220_341:0750b20_6"
    },
    {
        "source_sentence": "終不發起執取眼界相相應之心，亦不發起執取耳、鼻、舌、身、意界相相應之心；",
        "translation": "They do not give rise to thoughts that grasp the characteristics of the eye realm. Nor do they give rise to thoughts that grasp the characteristics of the ear, nose, tongue, body, and mind realms.",
        "source": "T06n0220_341:0750b22_7"
    },
    {
        "source_sentence": "終不發起執取色界相相應之心，亦不發起執取聲、香、味、觸、法界相相應之心；",
        "translation": "They do not give rise to thoughts that grasp the characteristics of the realm of form. Nor do they give rise to thoughts that grasp sound, odor, taste, touch, and the characteristics of the realm of reality.",
        "source": "T06n0220_341:0750b24_8"
    },
    {
        "source_sentence": "終不發起執取眼識界相相應之心，亦不發起執取耳、鼻、舌、身、意識界相相應之心；",
        "translation": "They do not give rise to the thought that grasps the characteristics of the sense eye, and they do not give rise to the thought that grasps the characteristics of the ear, nose, tongue, body, or consciousness.",
        "source": "T06n0220_341:0750b26_0"
    },
    {
        "source_sentence": "終不發起執取眼觸相相應之心，亦不發起執取耳、鼻、舌、身、意觸相相應之心；",
        "translation": "They do not give rise to thoughts associated with visual contact, nor do they give rise to thoughts associated with the touch of the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_341:0750b27_1"
    },
    {
        "source_sentence": "終不發起執取眼觸為緣所生諸受相相應之心，亦不發起執取耳、鼻、舌、身、意觸為緣所生諸受相相應之心；",
        "translation": "They do not give rise to thoughts associated with sensations that arise from visual contact as a condition, nor do they give rise to thoughts associated with sensations that arise from the contact of the ear, nose, tongue, body, or mind as a condition.",
        "source": "T06n0220_341:0750b29_2"
    },
    {
        "source_sentence": "終不發起執取地界相相應之心，亦不發起執取水、火、風、空、識界相相應之心；",
        "translation": "They never give rise to thoughts associated with the earth realm, nor do they give rise to thoughts associated with water, fire, wind, air, space, or consciousness realms.",
        "source": "T06n0220_341:0750c03_3"
    },
    {
        "source_sentence": "終不發起執取無明相相應之心，亦不發起執取行、識、名色、六處、觸、受、愛、取、有、生、老死相相應之心；",
        "translation": "They do not give rise to thoughts associated with clinging to ignorance. Nor do they give rise to thoughts associated with clinging to conditioning, consciousness, name and form, the six sense-fields, touch, sensation, craving, grasping, existence, birth, old age and death.",
        "source": "T06n0220_341:0750c04_4"
    },
    {
        "source_sentence": "終不發起執取布施波羅蜜多相相應之心，亦不發起執取淨戒、安忍、精進、靜慮、般若波羅蜜多相相應之心；",
        "translation": "They never give rise to thoughts associated with the perfection of giving, nor do they give rise to thoughts associated with the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_341:0750c07_5"
    },
    {
        "source_sentence": "終不發起執取內空相相應之心，亦不發起執取外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空相相應之心；",
        "translation": "They do not give rise to thoughts of clinging to external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, unchanging emptiness, emptiness of original nature, emptiness of specific characteristics, emptiness of shared characteristics, emptiness",
        "source": "T06n0220_341:0750c09_6"
    },
    {
        "source_sentence": "終不發起執取真如相相應之心，亦不發起執取法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界相相應之心；",
        "translation": "They do not give rise to thoughts of clinging to the realm of reality. Nor do they give rise to thoughts of clinging to the characteristics of the realm of reality, the essence of reality, non-falsity, unchanging and dissimilarity, equality, freedom from birth, legality, Dharma abiding, reality, space, or inconceivability.",
        "source": "T06n0220_341:0750c14_7"
    },
    {
        "source_sentence": "終不發起執取苦聖諦相相應之心，亦不發起執取集、滅、道聖諦相相應之心；",
        "translation": "They do not give rise to thoughts associated with clinging to the noble truth of suffering. Nor do they give rise to thoughts associated with clinging to the noble truths of arising, cessation, and the path.",
        "source": "T06n0220_341:0750c17_8"
    },
    {
        "source_sentence": "終不發起執取四靜慮相相應之心，亦不發起執取四無量、四無色定相相應之心；",
        "translation": "They never give rise to thoughts associated with the four states of absorption, nor do they give rise to thoughts associated with the four immeasurable and four formless concentrations.",
        "source": "T06n0220_341:0750c19_9"
    },
    {
        "source_sentence": "終不發起執取八解脫相相應之心，亦不發起執取八勝處、九次第定、十遍處相相應之心；",
        "translation": "They never give rise to thoughts associated with the eight liberations, nor do they give rise to thoughts associated with the eight superior states, nine graduated states of absorption, or ten universal states.",
        "source": "T06n0220_341:0750c20_10"
    },
    {
        "source_sentence": "終不發起執取四念住相相應之心，亦不發起執取四正斷、四神足、五根、五力、七等覺支、八聖道支相相應之心；",
        "translation": "They do not give rise to the thought conjoined with the four abodes of mindfulness, and they do not give rise to the thought conjoined with the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, or the eightfold noble path.",
        "source": "T06n0220_341:0750c22_11"
    },
    {
        "source_sentence": "終不發起執取空解脫門相相應之心，亦不發起執取無相、無願解脫門相相應之心；",
        "translation": "They do not give rise to thoughts associated with the liberation gate of emptiness, nor do they give rise to thoughts associated with the liberation gate of signlessness or wishlessness.",
        "source": "T06n0220_341:0750c25_12"
    },
    {
        "source_sentence": "終不發起執取極喜地相相應之心，亦不發起執取離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地相相應之心；",
        "translation": "They do not give rise to thoughts associated with clinging to the stage of ultimate bliss. Nor do they give rise to thoughts associated with clinging to the stage of freedom from defilement, the stage of emission of light, the stage of blazing wisdom, the stage of extreme difficulty overcoming enemies, the stage of appearance, the stage of going far away, the stage of",
        "source": "T06n0220_341:0750c27_13"
    },
    {
        "source_sentence": "終不發起執取五眼相相應之心，亦不發起執取六神通相相應之心；",
        "translation": "They never give rise to thoughts associated with the five organs of sight, nor do they give rise to thoughts associated with the six supernormal powers.",
        "source": "T06n0220_341:0751a01_14"
    },
    {
        "source_sentence": "終不發起執取佛十力相相應之心，亦不發起執取四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法相相應之心；",
        "translation": "They do not give rise to thoughts of clinging to the ten powers of buddhas. Nor do they give rise to thoughts of clinging to the four forms of fearlessness, the four forms of unhindered understanding, great benevolence, great compassion, great joy, great equanimity, and the characteristics of the eighteen unique qualities of buddhahood.",
        "source": "T06n0220_341:0751a03_0"
    },
    {
        "source_sentence": "終不發起執取無忘失法相相應之心，亦不發起執取恒住捨性相相應之心；",
        "translation": "They do not give rise to thoughts associated with the characteristic of nonforgetfulness in clinging, nor do they give rise to thoughts associated with the characteristic of equanimity in clinging.",
        "source": "T06n0220_341:0751a05_1"
    },
    {
        "source_sentence": "終不發起執取一切智相相應之心，亦不發起執取道相智、一切相智相相應之心；",
        "translation": "They do not give rise to thoughts associated with grasping the characteristics of omniscience. Nor do they give rise to thoughts associated with grasping the characteristics of path and omniscience.",
        "source": "T06n0220_341:0751a07_2"
    },
    {
        "source_sentence": "終不發起執取一切陀羅尼門相相應之心，亦不發起執取一切三摩地門相相應之心；",
        "translation": "They do not give rise to thoughts associated with all the aspects of dhāraṇī, and they do not give rise to thoughts associated with all the aspects of concentration.",
        "source": "T06n0220_341:0751a09_3"
    },
    {
        "source_sentence": "終不發起執取預流果相相應之心，亦不發起執取一來、不還、阿羅漢果相相應之心；",
        "translation": "They never give rise to thoughts associated with the characteristics of stream-winner, nor do they give rise to thoughts associated with the characteristics of once-returner, nonreturner, and arhat.",
        "source": "T06n0220_341:0751a11_4"
    },
    {
        "source_sentence": "終不發起執取獨覺菩提相相應之心；",
        "translation": "They never give rise to thoughts associated with the enlightenment of self-enlightened ones.",
        "source": "T06n0220_341:0751a13_5"
    },
    {
        "source_sentence": "終不發起執取一切菩薩摩訶薩行相相應之心；",
        "translation": "They never give rise to the thought associated with all the practices of enlightening beings.",
        "source": "T06n0220_341:0751a14_6"
    },
    {
        "source_sentence": "終不發起執取諸佛無上正等菩提相相應之心。",
        "translation": "They never give rise to the mind associated with the characteristics of unsurpassed perfect enlightenment of the buddhas.",
        "source": "T06n0220_341:0751a15_7"
    },
    {
        "source_sentence": "「何以故？",
        "translation": "“Why is that?",
        "source": "T06n0220_341:0751a16_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_341:0751a16_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩行深般若波羅蜜多善巧方便，都不見法是可得者，無所得故，",
        "translation": "This is the skillful means of the profound prajñāpāramitā practiced by the bodhisattvas and mahāsattvas, who don’t see things as obtainable because they have no attainment.",
        "source": "T06n0220_341:0751a16_10"
    },
    {
        "source_sentence": "不起執取色等法相相應之心。",
        "translation": "They don't cling to the mind associated with form and other dharmas as characteristics.",
        "source": "T06n0220_341:0751a18_11"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751a20_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是修學甚深般若波羅蜜多善巧方便，能攝一切波羅蜜多，",
        "translation": "“If great enlightening beings thus cultivate the skillful means of profound prajñāpāramitā, they can embrace all the perfections.",
        "source": "T06n0220_341:0751a20_1"
    },
    {
        "source_sentence": "能集一切波羅蜜多，能導一切波羅蜜多。",
        "translation": "They can gather all the perfections and guide all the perfections.",
        "source": "T06n0220_341:0751a22_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_341:0751a22_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_341:0751a23_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多中，含容一切波羅蜜多故。",
        "translation": "The profound prajñāpāramitā contains all the pāramitās.",
        "source": "T06n0220_341:0751a23_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_341:0751a24_4"
    },
    {
        "source_sentence": "譬如薩迦耶見普能攝受六十二見，甚深般若波羅蜜多亦復如是，含容一切波羅蜜多。",
        "translation": "Just as the view of saṃkāya universally can embrace sixty-two views, so too does the profound prajñāpāramitā contain all the perfections.",
        "source": "T06n0220_341:0751a24_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_341:0751a26_6"
    },
    {
        "source_sentence": "譬如諸殞沒者命根滅故諸根隨滅，甚深般若波羅蜜多亦復如是，一切所學波羅蜜多悉皆隨從，",
        "translation": "Just as when the faculty life of those who die ceases, all their faculties subsequently cease, so it is with the profound prajñāpāramitā, which follows all the perfections that are cultivated.",
        "source": "T06n0220_341:0751a26_7"
    },
    {
        "source_sentence": "若無般若波羅蜜多，亦無一切波羅蜜多。",
        "translation": "If there were no prajñāpāramitā, there wouldn't be all the perfections.",
        "source": "T06n0220_341:0751a28_8"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T06n0220_341:0751a29_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲到一切波羅蜜多究竟彼岸，應勤修學甚深般若波羅蜜多。",
        "translation": "If bodhisattvas, mahāsattvas, want to reach the ultimate other shore of all the perfections, they should diligently cultivate the profound perfection of wisdom.",
        "source": "T06n0220_341:0751a29_10"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_341:0751b02_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩修學如是甚深般若波羅蜜多，於諸有情最為上首。",
        "translation": "If a bodhisattva-mahāsattva cultivates such a profound prajñāpāramitā, he's the best among all sentient beings.",
        "source": "T06n0220_341:0751b02_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_341:0751b04_13"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_341:0751b04_14"
    },
    {
        "source_sentence": "是菩薩摩訶薩已能修學無上處故。",
        "translation": "It's because the bodhisattva Mahāsattva has cultivated the unsurpassed place.",
        "source": "T06n0220_341:0751b04_15"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751b06_0"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_341:0751b06_1"
    },
    {
        "source_sentence": "於此三千大千世界諸有情類寧為多不？」",
        "translation": "How many sentient beings are there in this 3,000 great one-thousand worlds?",
        "source": "T06n0220_341:0751b06_2"
    },
    {
        "source_sentence": "善現答言：「甚多！",
        "translation": "Sunetra replied, Very much so!",
        "source": "T06n0220_341:0751b07_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0751b07_4"
    },
    {
        "source_sentence": "甚多！",
        "translation": "Very much so!",
        "source": "T06n0220_341:0751b07_5"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_341:0751b08_0"
    },
    {
        "source_sentence": "贍部洲中諸有情類尚多無數，何況三千大千世界諸有情類！」",
        "translation": "Sentient beings in Jambudvīpa are still numerous and countless, so why wouldn't sentient beings in the 3,000 great one-thousand worlds!",
        "source": "T06n0220_341:0751b08_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0751b09_2"
    },
    {
        "source_sentence": "假使三千大千世界諸有情類，非前非後皆得人身，得人身已，非前非後皆證無上正等菩提。",
        "translation": "Suppose all the sentient beings in 3,000 great one-thousand worlds don't attain a human body before or after them, and after attaining a human body, they don't realize unsurpassed perfect enlightenment before or after them.",
        "source": "T06n0220_341:0751b09_3"
    },
    {
        "source_sentence": "有善男子、善女人等住菩薩乘，盡其形壽能以上妙衣服、飲食、臥具、湯藥及餘資具，",
        "translation": "Good men and good women abide in the bodhisattva vehicle. For as long as their bodies live, they will be able to increase their beautiful clothing, food and drink, bedding, bathing water, and other necessities.",
        "source": "T06n0220_341:0751b11_4"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎此諸如來、應、正等覺。",
        "translation": "They pay homage, respect, venerate, and praise these tathāgatas, arhats, and perfectly enlightened ones.",
        "source": "T06n0220_341:0751b13_5"
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣得福多不？」",
        "translation": "Is this the reason why good men and good women attain so much merit?",
        "source": "T06n0220_341:0751b14_6"
    },
    {
        "source_sentence": "善現答言：「甚多！",
        "translation": "Sunetra replied, Very much so!",
        "source": "T06n0220_341:0751b15_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0751b16_0"
    },
    {
        "source_sentence": "甚多！",
        "translation": "Very much so!",
        "source": "T06n0220_341:0751b16_1"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T06n0220_341:0751b16_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0751b16_3"
    },
    {
        "source_sentence": "若善男子、善女人等住菩薩乘，能於如是甚深般若波羅蜜多聽聞、受持、讀誦、書寫、思惟、修習，",
        "translation": "If good men and good women who abide in the bodhisattva vehicle can hear, retain, recite, write, contemplate, and practice such profound prajñāpāramitā,",
        "source": "T06n0220_341:0751b16_4"
    },
    {
        "source_sentence": "所獲福聚甚多於前無量無數。",
        "translation": "The accumulation of merit that they attain is so great that it's immeasurable and countless compared to the previous one.",
        "source": "T06n0220_341:0751b18_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_341:0751b19_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_341:0751b19_7"
    },
    {
        "source_sentence": "甚深般若波羅蜜多具大義利，能令菩薩摩訶薩眾速引無上正等菩提，勝前所得諸善根故。",
        "translation": "The profound prajñāpāramitā possesses great meaningful benefits that can cause the bodhisattvas, mahāsattvas, and others to quickly attain unsurpassed perfect enlightenment, which is superior to the good roots they previously attained.",
        "source": "T06n0220_341:0751b19_8"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T06n0220_341:0751b21_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲居一切有情上首，當學如是甚深般若波羅蜜多。",
        "translation": "If bodhisattvas, mahāsattvas, want to be the leaders of all sentient beings, they should train in such a profound prajñāpāramitā.",
        "source": "T06n0220_341:0751b22_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲普饒益一切有情，無救護者為作救護，無歸依者為作歸依，",
        "translation": "“If great enlightening beings want to benefit all sentient beings, they do so for the rescue of those who lack protection, and those who lack refuge do so for the refuge of those who have no refuge.",
        "source": "T06n0220_341:0751b23_11"
    },
    {
        "source_sentence": "無投趣者為作投趣，無眼目者為作眼目，無光明者為作光明，失道路者示以道路，",
        "translation": "Those who don’t go forth are made to go forth, those without eyes are made eye eyes, those without light are made to make light, and those who lose the way are shown the way.",
        "source": "T06n0220_341:0751b25_12"
    },
    {
        "source_sentence": "未涅槃者令得涅槃，當學如是甚深般若波羅蜜多。",
        "translation": "Those who haven't yet entered nirvāṇa will attain nirvāṇa, and they should thus train in the profound prajñāpāramitā like this.",
        "source": "T06n0220_341:0751b27_13"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得無上正等菩提，欲行諸佛所行境界，欲遊戲佛所遊戲處，",
        "translation": "“If great enlightening beings want to attain unexcelled perfect enlightenment, want to practice the sphere of action of buddhas, and want to play in the company of buddhas,",
        "source": "T06n0220_341:0751b28_14"
    },
    {
        "source_sentence": "欲作諸佛大師子吼，欲擊諸佛無上法鼓，欲扣諸佛無上法鐘，欲吹諸佛無上法螺，",
        "translation": "They want to make the great lion’s roar of the Buddhas; they want to beat the unexcelled drums of the teachings of the Buddhas; they want to ring the unexcelled bells of the Teaching of the Buddhas; they want to blow the unexcelled conch of the Teaching of the Buddhas.",
        "source": "T06n0220_341:0751c01_15"
    },
    {
        "source_sentence": "欲昇諸佛無上法座，欲說諸佛無上法義，欲決一切有情疑網，欲入諸佛甘露法界，",
        "translation": "“Great enlightening beings want to ascend the supreme seat of teaching of buddhas, want to explain the meaning of the supreme teaching of buddhas, want to resolve the doubts of all sentient beings, and want to enter the realm of the Buddha-teachings of the ambrosia of truth.",
        "source": "T06n0220_341:0751c03_16"
    },
    {
        "source_sentence": "欲受諸佛微妙喜樂，當學如是甚深般若波羅蜜多。",
        "translation": "Those who want to receive the subtle joy and happiness of the buddhas should train in such a profound prajñāpāramitā.",
        "source": "T06n0220_341:0751c05_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751c07_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩修學如是甚深般若波羅蜜多，無有一切功德善根而不能得。」",
        "translation": "If bodhisattvas, mahāsattvas cultivate such a profound prajñāpāramitā, there won't be all the merits and good roots that they can't attain.",
        "source": "T06n0220_341:0751c07_1"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_341:0751c09_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修學如是甚深般若波羅蜜多，豈亦能得聲聞、獨覺功德善根？」",
        "translation": "How could bodhisattvas, mahāsattvas, who cultivate such profound prajñāpāramitā, also attain the good roots of the merits of śrāvakas and pratyekbuddhas?",
        "source": "T06n0220_341:0751c09_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0751c11_2"
    },
    {
        "source_sentence": "聲聞、獨覺功德善根，此諸菩薩摩訶薩眾亦皆能得，但於其中無住無著。",
        "translation": "The good roots of the merits of śrāvakas and pratyekbuddhas are also attained by these bodhisattva-mahāsattvas, but they don't abide or cling to them.",
        "source": "T06n0220_341:0751c11_3"
    },
    {
        "source_sentence": "以勝智見正觀察已，超過彼位，趣入菩薩正性離生故，此菩薩摩訶薩眾，",
        "translation": "“Furthermore, the enlightening being Universally Good’s great congregation of bodhisattvas and mahāsattvas who have gone beyond those states by insight into the excellence of knowledge and right contemplation enter an enlightening being’s true nature free from birth.",
        "source": "T06n0220_341:0751c13_4"
    },
    {
        "source_sentence": "無有一切功德善根而不能得。",
        "translation": "They lack all the merits and good roots that they can't attain.",
        "source": "T06n0220_341:0751c14_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751c15_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，則為隣近一切智智，疾證無上正等菩提。",
        "translation": "If a bodhisattva Mahāsattva thus trains, then he'll be close to omniscience and quickly realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0751c15_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751c17_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，則為一切世間天、人、阿素洛等真實福田。",
        "translation": "If a bodhisattva-mahāsattva thus trains, then all the gods, humans, and asuras of the world are truly fields of merit.",
        "source": "T06n0220_341:0751c17_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751c19_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，超諸世間沙門、梵志、聲聞、獨覺福田之上，",
        "translation": "“When great enlightening beings and bodhisattvas thus learn, they transcend the field of blessings of worldly renunciants, brahmins, disciples, and solitary realizers.",
        "source": "T06n0220_341:0751c19_11"
    },
    {
        "source_sentence": "速能證得一切智智。",
        "translation": "He's quickly able to realize the cognition of all things.",
        "source": "T06n0220_341:0751c20_12"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751c21_13"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學時，隨所生處不捨般若波羅蜜多，不離般若波羅蜜多，",
        "translation": "If a bodhisattva-mahāsattva thus trains, he doesn't abandon the perfection of wisdom wherever he's born and doesn't part with the perfection of wisdom.",
        "source": "T06n0220_341:0751c21_14"
    },
    {
        "source_sentence": "常行般若波羅蜜多。",
        "translation": "He always practices the perfection of prajñāpāramitā.",
        "source": "T06n0220_341:0751c23_15"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751c23_16"
    },
    {
        "source_sentence": "若菩薩摩訶薩修學如是甚深般若波羅蜜多，當知已於一切智智得不退轉，",
        "translation": "If a bodhisattva-mahāsattva cultivates such a profound perfection of wisdom, he should know that he has attained nonregression in the knowledge of all things.",
        "source": "T06n0220_341:0751c24_17"
    },
    {
        "source_sentence": "遠離聲聞及獨覺地，隣近無上正等菩提。",
        "translation": "They're far removed from the stages of śrāvakas and pratyekbuddhas, and they're close to unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0751c25_18"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_341:0751c27_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩行甚深般若波羅蜜多時，作如是念：『此是般若波羅蜜多，",
        "translation": "“When great enlightening beings practice the profound prajñāpāramitā, they think:",
        "source": "T06n0220_341:0751c27_1"
    },
    {
        "source_sentence": "此是修時，此是修處，我能修此甚深般若波羅蜜多，我由如是甚深般若波羅蜜多，",
        "translation": "This is the time for cultivation, and this is the place for cultivation. I am able to cultivate this profound perfection of wisdom.",
        "source": "T06n0220_341:0751c28_2"
    },
    {
        "source_sentence": "捨離如是所應捨法，必當證得一切智智。』",
        "translation": "By abandoning such a teaching that should be abandoned, he'll surely realize omniscience and cognition.'",
        "source": "T06n0220_341:0752a01_3"
    },
    {
        "source_sentence": "若作是念，非行般若波羅蜜多，亦於般若波羅蜜多不能解了甚深般若波羅蜜多。",
        "translation": "If someone thinks this, they aren't practicing the perfection of prajñāpāramitā, and they can't understand the profound perfection of prajñāpāramitā in the perfection of prajñāpāramitā.",
        "source": "T06n0220_341:0752a02_4"
    },
    {
        "source_sentence": "不作是念：『此是般若波羅蜜多，此是修時，此是修處，此是修者，此是般若波羅蜜多所應遠離煩惱障法，",
        "translation": "They don’t think, ‘This is the perfection of wisdom. This is the time for cultivation, this is the place for cultivation, and this is the practitioner; this is the way in which the perfection of wisdom should be free from the obstacle of afflictions.",
        "source": "T06n0220_341:0752a04_5"
    },
    {
        "source_sentence": "此是般若波羅蜜多所證無上正等菩提。』",
        "translation": "This is the unsurpassed perfect enlightenment realized by the perfection of wisdom.'",
        "source": "T06n0220_341:0752a06_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩行甚深般若波羅蜜多時，作如是念：『此非般若波羅蜜多，",
        "translation": "If a bodhisattva-mahāsattva practices the profound perfection of wisdom, he thinks thus:",
        "source": "T06n0220_341:0752a07_7"
    },
    {
        "source_sentence": "此非修時，此非修處，此非修者，非由般若波羅蜜多能有所離及有所得。",
        "translation": "This is not the time for cultivation, this is not the place for cultivation, and this is not cultivation because it's not because the prajñāpāramitā can be freed or attained.",
        "source": "T06n0220_341:0752a09_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_341:0752a11_9"
    },
    {
        "source_sentence": "以一切法皆住真如、法界、實際，無差別故。』",
        "translation": "It's because all dharmas all abide in the true nature, the Dharma realm, and reality without distinction.'",
        "source": "T06n0220_341:0752a11_10"
    },
    {
        "source_sentence": "若如此行，是行般若波羅蜜多。」",
        "translation": "If someone does so, they're practicing the perfection of wisdom.",
        "source": "T06n0220_341:0752a12_11"
    },
    {
        "source_sentence": "初分願喻品第五十六之一",
        "translation": "The Fifty-sixth Chapter of the Parable of the First Part of the Vow",
        "source": "T06n0220_341:0752a14_0"
    },
    {
        "source_sentence": "時，天帝釋作是念言：「若菩薩摩訶薩修行般若波羅蜜多，修行靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "Śakra Devānām-Indra then had this thought, saying, Suppose a bodhisattva Mahāsattva cultivates the perfection of prajñāpāramitā and cultivates the perfections of meditation, effort, patience, pure morality, and generosity.",
        "source": "T06n0220_341:0752a15_0"
    },
    {
        "source_sentence": "尚超一切有情之上，況得無上正等菩提！",
        "translation": "It's even more so than all sentient beings who attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752a17_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩安住內空，安住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "If the bodhisattva Mahāsattva abides in internal emptiness, he abides in external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature,",
        "source": "T06n0220_341:0752a18_2"
    },
    {
        "source_sentence": "尚超一切有情之上，況得無上正等菩提！",
        "translation": "It's even more so than all sentient beings who attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752a22_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩安住真如，安住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "Suppose a bodhisattva Mahāsattva abides in the true reality, abiding in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, space, and inconceivable realms.",
        "source": "T06n0220_341:0752a23_4"
    },
    {
        "source_sentence": "尚超一切有情之上，況得無上正等菩提！",
        "translation": "It's even more so than all sentient beings who attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752a25_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩安住苦聖諦，安住集、滅、道聖諦，尚超一切有情之上，",
        "translation": "“If great enlightening beings abide in the noble truth of suffering, and they abide in the noble truths of accumulation, cessation, and the path, they still transcend all sentient beings.",
        "source": "T06n0220_341:0752a26_6"
    },
    {
        "source_sentence": "況得無上正等菩提！",
        "translation": "How could he attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752a28_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行四靜慮，修行四無量、四無色定，尚超一切有情之上，",
        "translation": "“If great enlightening beings practice the four meditations and cultivate the four immeasurable concentrations and the four formless concentrations, they still transcend all sentient beings.",
        "source": "T06n0220_341:0752a28_8"
    },
    {
        "source_sentence": "況得無上正等菩提！",
        "translation": "How could he attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b01_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行八解脫，修行八勝處、九次第定、十遍處，尚超一切有情之上，",
        "translation": "“If great enlightening beings cultivate the eight liberations, and if they cultivate the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes, they still transcend all sentient beings.",
        "source": "T06n0220_341:0752b01_10"
    },
    {
        "source_sentence": "況得無上正等菩提！",
        "translation": "How could he attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b03_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行四念住，修行四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "Suppose a bodhisattva Mahāsattva cultivates the four abodes of mindfulness and cultivates the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_341:0752b03_12"
    },
    {
        "source_sentence": "尚超一切有情之上，況得無上正等菩提！",
        "translation": "It's even more so than all sentient beings who attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b05_13"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行空解脫門，修行無相、無願解脫門，尚超一切有情之上，",
        "translation": "“If great enlightening beings cultivate the liberation gate of emptiness, and if they cultivate the liberation gate of signlessness and wishlessness, they still transcend all sentient beings.",
        "source": "T06n0220_341:0752b06_14"
    },
    {
        "source_sentence": "況得無上正等菩提！",
        "translation": "How could he attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b08_15"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行極喜地，修行離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地，",
        "translation": "Suppose a bodhisattva Mahāsattva cultivates the ground of ultimate bliss and cultivates the ground of freedom from defilement, the ground of emission of light, the ground of blazing wisdom, the ground of supreme difficulty, the ground of direct presence, the ground of distant action, the ground of immovability, the ground of good wisdom, the ground of cloud of teaching",
        "source": "T06n0220_341:0752b08_16"
    },
    {
        "source_sentence": "尚超一切有情之上，況得無上正等菩提！",
        "translation": "It's even more so than all sentient beings who attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b11_17"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行五眼，修行六神通，尚超一切有情之上，況得無上正等菩提！",
        "translation": "If bodhisattvas and mahāsattvas cultivate the five eyes and cultivate the six supernormal powers, they still transcend all sentient beings, so how could they attain unsurpassed perfect enlightenment?",
        "source": "T06n0220_341:0752b12_18"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行佛十力，修行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，",
        "translation": "“If great enlightening beings cultivate the ten powers of buddhahood, they cultivate the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the unique qualities of the eighteen Buddhas.",
        "source": "T06n0220_341:0752b14_19"
    },
    {
        "source_sentence": "尚超一切有情之上，況得無上正等菩提！",
        "translation": "It's even more so than all sentient beings who attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b16_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行無忘失法，修行恒住捨性，尚超一切有情之上，況得無上正等菩提！",
        "translation": "If a bodhisattva-mahāsattva cultivates the principle of nonforgetfulness and always abides in equanimity, he's still above all sentient beings, so why wouldn't he attain unsurpassed perfect enlightenment?",
        "source": "T06n0220_341:0752b17_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行一切智，修行道相智、一切相智，尚超一切有情之上，",
        "translation": "If great enlightening beings cultivate omniscience, and if they cultivate knowledge of the path and knowledge of all characteristics, they still transcend all sentient beings.",
        "source": "T06n0220_341:0752b19_0"
    },
    {
        "source_sentence": "況得無上正等菩提！",
        "translation": "How could he attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b20_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行一切陀羅尼門，修行一切三摩地門，尚超一切有情之上，",
        "translation": "“If great enlightening beings cultivate all the teachings of dhāraṇī and practice all the teachings of concentration, they still transcend all sentient beings.",
        "source": "T06n0220_341:0752b21_2"
    },
    {
        "source_sentence": "況得無上正等菩提！",
        "translation": "How could he attain unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0752b22_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行菩薩摩訶薩行，尚超一切有情之上，況得無上正等菩提！",
        "translation": "If a bodhisattva-mahāsattva cultivates the practice of bodhisattva-mahāsattva, he's still above all sentient beings, so how could he attain unsurpassed perfect enlightenment?",
        "source": "T06n0220_341:0752b23_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行無上正等菩提，尚超一切有情之上，況得無上正等菩提！",
        "translation": "If a bodhisattva Mahāsattva cultivates unsurpassed perfect enlightenment, he's still above all sentient beings, so why wouldn't he attain unsurpassed perfect enlightenment?",
        "source": "T06n0220_341:0752b25_5"
    },
    {
        "source_sentence": "「若諸有情聞說一切智智名字心生信解，尚為獲得人中善利及得世間最勝壽命，",
        "translation": "“Furthermore, if sentient beings hear the name of omniscience and give rise to faith in it, they will still attain good fortune among humans and the highest life span in the world.",
        "source": "T06n0220_341:0752b26_6"
    },
    {
        "source_sentence": "況發無上正等覺心，或常聽聞如是般若波羅蜜多甚深經典！",
        "translation": "How could they give rise to the mind of unsurpassed perfect enlightenment or always hear such a profound scripture as the Prajñāpāramitā?",
        "source": "T06n0220_341:0752b28_7"
    },
    {
        "source_sentence": "若諸有情能發無上正等覺心，聽聞般若波羅蜜多甚深經典，諸餘有情皆應願樂，",
        "translation": "If sentient beings can give rise to the mind of unsurpassed perfect enlightenment and hear the profound scriptures of the prajñāpāramitā, all other sentient beings should wish for their happiness.",
        "source": "T06n0220_341:0752c01_8"
    },
    {
        "source_sentence": "所獲功德世間天、人、阿素洛等不能及故。」",
        "translation": "The merit that they attain is unmatched by worldly gods, humans, asuras, and so forth.",
        "source": "T06n0220_341:0752c03_9"
    },
    {
        "source_sentence": "爾時，世尊知天帝釋心之所念，即便告言：「憍尸迦！",
        "translation": "Knowing what the Bhagavān thought in Indra's mind, the Bhagavān then addressed him, Kauśika!",
        "source": "T06n0220_341:0752c04_0"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_341:0752c05_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_341:0752c05_2"
    },
    {
        "source_sentence": "如汝所念。」",
        "translation": "As you think.",
        "source": "T06n0220_341:0752c05_3"
    },
    {
        "source_sentence": "時，天帝釋深心歡喜，即取天上微妙香華，奉散如來、應、正等覺及諸菩薩摩訶薩眾。",
        "translation": "Deeply delighted, Indra the lord of gods then took the subtle fragrant flowers from heaven and scattered them to the Tathāgata, Arhat, Perfectly Enlightened One, and the bodhisattva-mahāsattvas.",
        "source": "T06n0220_341:0752c06_0"
    },
    {
        "source_sentence": "既散華已，作是願言：「若菩薩乘諸善男子、善女人等求趣無上正等菩提，",
        "translation": "After he had scattered the flowers, he made this vow, saying, Suppose bodhisattvas and good men and good women of the vehicle seek unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0752c07_1"
    },
    {
        "source_sentence": "以我所生善根功德，令彼所求無上佛法速得圓滿，令彼所求一切智智速得圓滿，",
        "translation": "Because of the virtue of my roots of goodness, I cause them to quickly attain fulfillment of the unsurpassed buddha-teachings they seek, and cause them to quickly attain perfect knowledge of all things they seek.",
        "source": "T06n0220_341:0752c09_2"
    },
    {
        "source_sentence": "令彼所求自然人法速得圓滿，令彼所求真無漏法速得圓滿，令彼一切所欲聞法皆速圓滿。",
        "translation": "Causing them to quickly fulfill the natural person's dharmas they seek, Causing them to quickly fulfill the true and uncontaminated dharmas they seek, Causing them to quickly fulfill all the dharmas they want to hear.",
        "source": "T06n0220_341:0752c11_3"
    },
    {
        "source_sentence": "若求聲聞、獨覺乘者，亦令所願疾得滿足。」",
        "translation": "If someone seeks the vehicle of śrāvakas and pratyekbuddhas, they'll also quickly fulfill their wishes.",
        "source": "T06n0220_341:0752c13_4"
    },
    {
        "source_sentence": "作是願已，即白佛言：「世尊！",
        "translation": "After making this vow, he said to the Buddha, Bhagavān!",
        "source": "T06n0220_341:0752c14_5"
    },
    {
        "source_sentence": "若菩薩乘諸善男子、善女人等已發無上正等覺心，我終不生一念異意，",
        "translation": "Good men and good women of the bodhisattva vehicle who have set their minds on unexcelled perfect enlightenment, I will never give rise to a thought of distaste.",
        "source": "T06n0220_341:0752c15_6"
    },
    {
        "source_sentence": "令其退轉大菩提心。",
        "translation": "It causes them to regress from the great mind of enlightenment.",
        "source": "T06n0220_341:0752c16_7"
    },
    {
        "source_sentence": "我亦不生一念異意，令諸菩薩摩訶薩眾厭離無上正等菩提，退住聲聞或獨覺地。",
        "translation": "Nor do I give rise to a single thought or idea that causes the bodhisattvas, mahāsattvas, and others to become disillusioned with unsurpassed perfect enlightenment and retreat from the stages of śrāvakas or solitary realizers.",
        "source": "T06n0220_341:0752c17_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0752c19_9"
    },
    {
        "source_sentence": "若諸菩薩摩訶薩眾，已於無上正等菩提心生樂欲，我願彼心倍復增進速證無上正等菩提，",
        "translation": "“Furthermore, if all the great enlightening beings who have set their minds on unexcelled perfect enlightenment give rise to pleasure and desire, may their minds doubly increase and quickly realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0752c19_10"
    },
    {
        "source_sentence": "願彼菩薩摩訶薩眾見生死中種種苦已，為欲利樂世間天、人、阿素洛等，",
        "translation": "May all those bodhisattvas and mahāsattvas who see various kinds of suffering in birth-and-death want to benefit the gods, humans, asuras, celestials, humans, and so forth.",
        "source": "T06n0220_341:0752c21_11"
    },
    {
        "source_sentence": "發起種種堅固大願：『我既自度生死大海，亦當精勤度未度者。",
        "translation": "They give rise to various firm and great vows, saying, 'Having liberated themselves from the ocean of birth and death, I will also diligently liberate those who haven't liberated myself.",
        "source": "T06n0220_341:0752c23_12"
    },
    {
        "source_sentence": "我既自解生死繫縛，亦當精勤解未解者。",
        "translation": "Since I have self-liberated myself from the bondage of birth and death, I will also diligently liberate those who haven't yet liberated themselves.",
        "source": "T06n0220_341:0752c24_13"
    },
    {
        "source_sentence": "我於種種生死怖畏既自安隱，亦當精勤安未安者。",
        "translation": "Since I'm self-assured by various fears of birth and death, I should also exert effort to calm those who aren't.",
        "source": "T06n0220_341:0752c25_14"
    },
    {
        "source_sentence": "我既自證究竟涅槃，亦當精勤令未證者皆同證得。』",
        "translation": "Since I myself have realized the ultimate nirvāṇa, I will also exert myself to cause those who haven't realized it to attain it.'",
        "source": "T06n0220_341:0752c26_15"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0752c27_16"
    },
    {
        "source_sentence": "若善男子、善女人等，於初發心菩薩功德，起隨喜心得幾所福？",
        "translation": "If good men and good women give rise to joyful thoughts about the merits of the first arousal of mind as bodhisattvas, how much merit will they attain?",
        "source": "T06n0220_341:0752c27_17"
    },
    {
        "source_sentence": "於久發心菩薩功德，起隨喜心得幾所福？",
        "translation": "What's the merit of a long-arisen mind that gives rise to joy in the virtue of bodhisattvas and how much merit is it?",
        "source": "T06n0220_341:0752c29_18"
    },
    {
        "source_sentence": "於不退轉地菩薩功德，起隨喜心得幾所福？",
        "translation": "How much merit is there in the virtue of the bodhisattva in the stage of nonretrogression that gives rise to a joyful mind?",
        "source": "T06n0220_341:0753a01_19"
    },
    {
        "source_sentence": "於一生所繫菩薩功德，起隨喜心得幾所福？」",
        "translation": "How much merit is there in the virtue of the bodhisattva bound to one lifetime that gives rise to a joyful mind?",
        "source": "T06n0220_341:0753a02_20"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「憍尸迦！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, Kauśika!",
        "source": "T06n0220_341:0753a03_21"
    },
    {
        "source_sentence": "四大洲界可知斤兩，是隨喜福不可稱量。",
        "translation": "The four great continents of the world can be known as a pound or two, which are immeasurable in terms of joy and merit.",
        "source": "T06n0220_341:0753a03_22"
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T06n0220_341:0753a04_23"
    },
    {
        "source_sentence": "小千世界可知斤兩，是隨喜福不可稱量。",
        "translation": "The small chiliocosm can be known as a pound or two, which is immeasurable in terms of joy and merit.",
        "source": "T06n0220_341:0753a05_24"
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T06n0220_341:0753a06_25"
    },
    {
        "source_sentence": "中千世界可知斤兩，是隨喜福不可稱量。",
        "translation": "The middle thousand worlds can be known as pounds, which are immeasurable in terms of joy and merit.",
        "source": "T06n0220_341:0753a06_26"
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T06n0220_341:0753a07_27"
    },
    {
        "source_sentence": "我此三千大千世界可知斤兩，是隨喜福不可稱量。",
        "translation": "In this world of the 3,000 great one-thousand worlds, we can be known to weigh a pound or two. The merit that follows joy is immeasurable.",
        "source": "T06n0220_341:0753a07_28"
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T06n0220_341:0753a08_29"
    },
    {
        "source_sentence": "假使三千大千世界合為一海，若復有能取一毛髮析為百分，取一分端沾彼海水可知渧數，",
        "translation": "Suppose the 3,000 great one-thousand worlds are combined into one ocean, and if there's another person who can take a hair and analyze it into a hundred parts and put a part of it in that water, you can know the number of grains.",
        "source": "T06n0220_341:0753a09_30"
    },
    {
        "source_sentence": "是隨喜福不可數知。",
        "translation": "It's the merit of following joy that can't be counted.",
        "source": "T06n0220_341:0753a11_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_341:0753a11_32"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_341:0753a11_33"
    },
    {
        "source_sentence": "是善男子、善女人等所隨喜福無邊際故。」",
        "translation": "It's because the merit of good men and good women who follow them is limitless.",
        "source": "T06n0220_341:0753a12_0"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「世尊！",
        "translation": "Śakra then again said to the Buddha, Bhagavān!",
        "source": "T06n0220_341:0753a12_1"
    },
    {
        "source_sentence": "若諸有情於諸菩薩功德善根不隨喜者，當知皆是魔所魅著。",
        "translation": "If sentient beings don't rejoice in the virtues and good roots of the bodhisattvas, they should know that they're all addicted by Māra.",
        "source": "T06n0220_341:0753a13_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753a14_3"
    },
    {
        "source_sentence": "若諸有情於諸菩薩功德善根不隨喜者，當知皆是魔之眷屬。",
        "translation": "If sentient beings don't rejoice in the virtues and good roots of the bodhisattvas, you should know that they are all members of Māra's retinue.",
        "source": "T06n0220_341:0753a15_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753a16_5"
    },
    {
        "source_sentence": "若諸有情於諸菩薩功德善根不隨喜者，當知皆從魔天界沒來生是間。",
        "translation": "If sentient beings don't rejoice in the virtuous good roots of the bodhisattvas, they should know that they all descend from the realm of Māra and are born here.",
        "source": "T06n0220_341:0753a16_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_341:0753a18_7"
    },
    {
        "source_sentence": "若諸菩薩摩訶薩眾求趣無上正等菩提，若有發心於彼功德深隨喜者，皆為破壞一切魔軍宮殿眷屬，",
        "translation": "If all the great enlightening beings seek supreme perfect enlightenment, and if they decide to deeply rejoice in their virtues, it’s because they want to destroy all the demon armies, palaces, and retinues.",
        "source": "T06n0220_341:0753a18_8"
    },
    {
        "source_sentence": "迴向無上正等菩提。",
        "translation": "He dedicates himself back to unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0753a20_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753a21_10"
    },
    {
        "source_sentence": "若諸有情深心愛敬佛、法、僧寶，於諸菩薩功德善根應生隨喜，既隨喜已，",
        "translation": "If sentient beings deeply love the treasures of buddhahood, Dharma, and Sangha, they should give rise to delight in the virtuous roots of goodness of enlightening beings. Having thus given rise to that delight,",
        "source": "T06n0220_341:0753a21_11"
    },
    {
        "source_sentence": "迴向無上正等菩提，而不應生一二多想。",
        "translation": "They dedicate themselves back to unsurpassed perfect enlightenment, but they shouldn't give rise to one, two, or many thoughts.",
        "source": "T06n0220_341:0753a23_12"
    },
    {
        "source_sentence": "若能如是，速證無上正等菩提，度脫有情破魔眷屬。」",
        "translation": "If they can do so, they'll quickly realize unsurpassed perfect enlightenment and liberate sentient beings and destroy the Māra's retinue.",
        "source": "T06n0220_341:0753a24_0"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T06n0220_341:0753a26_0"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_341:0753a26_1"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_341:0753a26_2"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_341:0753a26_3"
    },
    {
        "source_sentence": "若善男子、善女人等於諸菩薩功德善根深生隨喜，迴向無上正等菩提，",
        "translation": "“Good sons and good daughters, if they deeply rejoice in the virtues of enlightening beings’ roots of goodness and dedicate them to unsurpassed true and complete enlightenment,",
        "source": "T06n0220_341:0753a27_4"
    },
    {
        "source_sentence": "是善男子、善女人等速證無上正等菩提，速能圓滿諸菩薩行，速能供養一切如來、應、正等覺，",
        "translation": "“Furthermore, these sons and daughters of a virtuous family will quickly attain unexcelled perfect enlightenment. They will quickly fulfill the practices of enlightening beings and be able to make offerings to all buddhas, saints, and perfectly enlightened ones.",
        "source": "T06n0220_341:0753a28_5"
    },
    {
        "source_sentence": "常遇善友，恒聞般若波羅蜜多甚深經典。",
        "translation": "He always meets good friends and always hears the profound sūtras of the Prajñāpāramitā.",
        "source": "T06n0220_341:0753b01_6"
    },
    {
        "source_sentence": "是善男子、善女人等成就如是功德善根，隨所生處常為一切世間天、人、阿素洛等供養恭敬、尊重讚歎，",
        "translation": "These sons and daughters of a virtuous family who have perfected the roots of virtue such as these will always be honored, revered, venerated, and praised by all the devas, humans, and asuras of the world wherever they may be born.",
        "source": "T06n0220_341:0753b02_7"
    },
    {
        "source_sentence": "不見惡色，不聞惡聲，不嗅惡香，不嘗惡味，不覺惡觸，常不思念不如理法，",
        "translation": "They don’t see bad forms, don’t hear bad sounds, don’t smell bad odors, don’t taste bad flavors, don’t experience bad tactile sensations, and always don’t think of anything unreasonable.",
        "source": "T06n0220_341:0753b05_8"
    },
    {
        "source_sentence": "終不遠離諸佛世尊，從一佛土至一佛土，親近諸佛種諸善根，成熟有情、嚴淨佛土。",
        "translation": "They are never far from the buddhas and world-honored ones, go from one buddha-land to another, become intimate with the buddhas, plant good roots, mature sentient beings, and purify the buddha-lands.",
        "source": "T06n0220_341:0753b06_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_341:0753b08_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_341:0753b08_11"
    },
    {
        "source_sentence": "是善男子、善女人等，能於無量、無數、無邊最初發心菩薩摩訶薩功德善根深生隨喜，",
        "translation": "“Furthermore, these sons and daughters of a virtuous family are able to give rise to the joy that deeply follows the roots of virtue of enlightening beings who have first undertaken the determination for enlightenment in measureless, countless, and limitless ways.",
        "source": "T06n0220_341:0753b09_0"
    },
    {
        "source_sentence": "迴向無上正等菩提。",
        "translation": "He dedicates himself back to unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0753b10_1"
    },
    {
        "source_sentence": "能於無量、無數、無邊已住初地乃至十地菩薩摩訶薩功德善根深生隨喜，",
        "translation": "“Furthermore, great enlightening beings can give rise to profound joy in the virtues and roots of goodness of the bodhisattva-mahāsattvas of the first stage up to the tenth stage who have dwelled on immeasurable, countless, and limitless qualities.",
        "source": "T06n0220_341:0753b11_2"
    },
    {
        "source_sentence": "迴向無上正等菩提。",
        "translation": "He dedicates himself back to unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0753b13_3"
    },
    {
        "source_sentence": "能於無量、無數、無邊一生所繫菩薩摩訶薩功德善根深生隨喜，迴向無上正等菩提。",
        "translation": "They can give rise to profound joy in the virtues and good roots of the bodhisattvas, mahāsattvas, who are bound by measureless, countless, and limitless one-lifetime enlightenment, and dedicate them back to unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0753b13_4"
    },
    {
        "source_sentence": "由此因緣，是善男子、善女人等善根增進，速近無上正等菩提，證得無上大菩提已，",
        "translation": "Because of these causes and conditions, good men and good women increase their good roots, quickly approach unsurpassed perfect enlightenment, and realize unsurpassed great awakening.",
        "source": "T06n0220_341:0753b15_5"
    },
    {
        "source_sentence": "能度無量、無數、無邊諸有情類，於無餘依般涅槃界而般涅槃。",
        "translation": "He's able to save measureless, countless, and limitless kinds of sentient beings who attain parinirvāṇa in the realm of parinirvāṇa without remainder.",
        "source": "T06n0220_341:0753b17_6"
    },
    {
        "source_sentence": "「以是故，憍尸迦！",
        "translation": "That's why, Kauśika!",
        "source": "T06n0220_341:0753b18_7"
    },
    {
        "source_sentence": "諸善男子、善女人等，於初發心菩薩摩訶薩功德善根應生隨喜，迴向無上正等菩提，",
        "translation": "Good men and good women, give rise to joy in the virtuous roots of goodness of the first arousal of mind as bodhisattvas, mahāsattvas, and so forth, and dedicate them to unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0753b19_8"
    },
    {
        "source_sentence": "於迴向時，不應執著即心離心，亦不應執著即心修行離心修行。",
        "translation": "At the time of dedication, they shouldn't cling to that which is mind and what's free of mind, and they shouldn't cling to that which is mind as cultivation or free of mind as cultivation.",
        "source": "T06n0220_341:0753b21_9"
    },
    {
        "source_sentence": "諸善男子、善女人等，於久發心菩薩摩訶薩功德善根應生隨喜，迴向無上正等菩提，",
        "translation": "“Good sons and good daughters, those who have long aroused the aspiration for enlightenment should give rise to delight in the virtuous roots of goodness of great enlightening beings and dedicate them to unsurpassed true and complete enlightenment.",
        "source": "T06n0220_341:0753b22_10"
    },
    {
        "source_sentence": "於迴向時，不應執著即心離心，亦不應執著即心修行離心修行。",
        "translation": "At the time of dedication, they shouldn't cling to that which is mind and what's free of mind, and they shouldn't cling to that which is mind as cultivation or free of mind as cultivation.",
        "source": "T06n0220_341:0753b24_11"
    },
    {
        "source_sentence": "諸善男子、善女人等，於不退轉菩薩摩訶薩功德善根應生隨喜，迴向無上正等菩提，",
        "translation": "Good men and good women should give rise to delight in the virtuous roots of goodness of nonretrogressing great enlightening beings and dedicate them to unsurpassed true and complete enlightenment.",
        "source": "T06n0220_341:0753b26_0"
    },
    {
        "source_sentence": "於迴向時，不應執著即心離心，亦不應執著即心修行離心修行。",
        "translation": "At the time of dedication, they shouldn't cling to that which is mind and what's free of mind, and they shouldn't cling to that which is mind as cultivation or free of mind as cultivation.",
        "source": "T06n0220_341:0753b27_1"
    },
    {
        "source_sentence": "諸善男子、善女人等，於一生所繫菩薩摩訶薩功德善根應生隨喜，迴向無上正等菩提，",
        "translation": "Good men and good women, give rise to delight in the virtuous roots of goodness of the bodhisattva-mahāsattva who is bound for one lifetime and dedicate them to unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0753b29_2"
    },
    {
        "source_sentence": "於迴向時，不應執著即心離心，亦不應執著即心修行離心修行。",
        "translation": "At the time of dedication, they shouldn't cling to that which is mind and what's free of mind, and they shouldn't cling to that which is mind as cultivation or free of mind as cultivation.",
        "source": "T06n0220_341:0753c02_3"
    },
    {
        "source_sentence": "若能如是無所執著隨喜迴向，疾證無上正等菩提，度諸天、人、阿素洛等，",
        "translation": "If they can thus joyfully dedicate themselves without attachment, quickly realize unsurpassed perfect enlightenment and liberate gods, humans, asuras, and so forth.",
        "source": "T06n0220_341:0753c03_4"
    },
    {
        "source_sentence": "令脫生死得涅槃樂。」",
        "translation": "It causes them to be freed from birth and death and attain the bliss of nirvāṇa.",
        "source": "T06n0220_341:0753c05_5"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_341:0753c06_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩以如幻心，能證無上正等菩提？」",
        "translation": "How can a bodhisattva-mahāsattva realize unsurpassed perfect enlightenment with an illusory mind?",
        "source": "T06n0220_341:0753c06_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0753c07_2"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_341:0753c08_0"
    },
    {
        "source_sentence": "汝見菩薩摩訶薩等如幻心不？」",
        "translation": "Do you see bodhisattvas, mahāsattvas, and so forth as illusory minds?",
        "source": "T06n0220_341:0753c08_1"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_341:0753c08_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753c09_3"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_341:0753c09_4"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_341:0753c09_5"
    },
    {
        "source_sentence": "我不見幻，亦不見有如幻之心。」",
        "translation": "I don't see illusions, and I don't see minds that are illusory.",
        "source": "T06n0220_341:0753c09_6"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0753c10_7"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_341:0753c10_8"
    },
    {
        "source_sentence": "若處無幻、無如幻心，汝見有是心能證無上正等菩提不？」",
        "translation": "If there's a place where there's no illusion and no illusory mind, do you see this mind that can realize unsurpassed perfect enlightenment?",
        "source": "T06n0220_341:0753c10_9"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_341:0753c12_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753c12_11"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_341:0753c12_12"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_341:0753c12_13"
    },
    {
        "source_sentence": "我都不見有處無幻、無如幻心，更有是心能證無上正等菩提！」",
        "translation": "I don't see any place where there's a mind that's neither illusory nor illusory, and there's another mind that can realize unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0753c12_14"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_341:0753c14_15"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_341:0753c14_16"
    },
    {
        "source_sentence": "若處離幻、離如幻心，汝見有是法能證無上正等菩提不？」",
        "translation": "If you're free of illusion and free of illusory mind, do you see any such thing that will realize unsurpassed perfect enlightenment?",
        "source": "T06n0220_341:0753c14_17"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_341:0753c16_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753c16_1"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_341:0753c16_2"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_341:0753c16_3"
    },
    {
        "source_sentence": "我都不見有處離幻、離如幻心，更有是法能證無上正等菩提！",
        "translation": "I don't see any place that's free of illusion or free of illusory mind, and there's another thing that can realize unsurpassed perfect enlightenment!",
        "source": "T06n0220_341:0753c16_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753c18_5"
    },
    {
        "source_sentence": "我都不見即、離心法，說何等法是有、是無，以一切法畢竟離故。",
        "translation": "What dharmas are said to be existent and nonexistent because all dharmas are ultimately free?",
        "source": "T06n0220_341:0753c18_6"
    },
    {
        "source_sentence": "若一切法畢竟離者，不可施設此法是有、此法是無。",
        "translation": "If all things are ultimately free, it can't be said that this thing is existence or that this thing is nonexistence.",
        "source": "T06n0220_341:0753c19_7"
    },
    {
        "source_sentence": "若法不可施設有、無，則不可說能證無上正等菩提，非無所有法能證菩提故。",
        "translation": "If dharmas can't be defined as existent and nonexistent, then they can't be described as capable of realizing unsurpassed perfect enlightenment, because it's not that nothing exists that can realize enlightenment.",
        "source": "T06n0220_341:0753c20_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_341:0753c22_9"
    },
    {
        "source_sentence": "以一切法皆無所有性不可得，無染、無淨。",
        "translation": "It's because all things lack the nature of existence and are unobtainable, without defilement or purity.",
        "source": "T06n0220_341:0753c22_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_341:0753c23_11"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753c23_12"
    },
    {
        "source_sentence": "般若波羅蜜多畢竟離故，靜慮、精進、安忍、淨戒、布施波羅蜜多亦畢竟離故。",
        "translation": "Because the perfection of wisdom is ultimately free, the perfections of meditation, effort, patience, pure precepts, and generosity are also ultimately free.",
        "source": "T06n0220_341:0753c24_13"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753c25_14"
    },
    {
        "source_sentence": "內空畢竟離故，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空亦畢竟離故。",
        "translation": "Because internal emptiness is ultimately free, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature, emptiness of shared characteristics, emptiness",
        "source": "T06n0220_341:0753c25_15"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0753c29_16"
    },
    {
        "source_sentence": "真如畢竟離故，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界亦畢竟離故。",
        "translation": "Because the true nature is ultimately free, the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, and the inconceivable realm are also ultimately free.",
        "source": "T06n0220_341:0753c29_17"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a03_18"
    },
    {
        "source_sentence": "苦聖諦畢竟離故，集、滅、道聖諦亦畢竟離故。",
        "translation": "It's because the noble truth of suffering is ultimately free, and the noble truths of arising, ceasing, and the path are also ultimately free.",
        "source": "T06n0220_341:0754a03_19"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a04_20"
    },
    {
        "source_sentence": "四靜慮畢竟離故，四無量、四無色定亦畢竟離故。",
        "translation": "It is because the four forms of trance are absolutely free. The four immeasurable and four formless samdhis are also absolutely free.",
        "source": "T06n0220_341:0754a04_21"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a05_22"
    },
    {
        "source_sentence": "八解脫畢竟離故，八勝處、九次第定、十遍處亦畢竟離故。",
        "translation": "Because the eight liberations are absolutely free: because the eight spheres of mastery, the nine graduated concentrations and the ten pervasive abodes are also absolutely free.",
        "source": "T06n0220_341:0754a05_23"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a07_24"
    },
    {
        "source_sentence": "四念住畢竟離故，四正斷、四神足、五根、五力、七等覺支、八聖道支亦畢竟離故。",
        "translation": "Because the four abodes of mindfulness are ultimately free, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are also ultimately free.",
        "source": "T06n0220_341:0754a07_25"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a08_26"
    },
    {
        "source_sentence": "空解脫門畢竟離故，無相、無願解脫門亦畢竟離故。",
        "translation": "It's because the gate of liberation through emptiness is ultimately free, and the gate of liberation through signlessness and wishlessness is also ultimately free.",
        "source": "T06n0220_341:0754a09_27"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a10_28"
    },
    {
        "source_sentence": "極喜地畢竟離故，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地亦畢竟離故。",
        "translation": "It's because the ground of ultimate joy is ultimately free, and the ground of freedom from defilement, the ground of emission of light, the ground of burning wisdom, the ground of ultimate difficulty, the ground of presence, the ground of distant action, the ground of immovability, the ground of good wisdom, and the ground of the Dharma-cloud are also ultimately free.",
        "source": "T06n0220_341:0754a10_29"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a12_30"
    },
    {
        "source_sentence": "五眼畢竟離故，六神通亦畢竟離故。",
        "translation": "It is because the five eyes are absolutely free. The six supernormal powers are also absolutely free.",
        "source": "T06n0220_341:0754a12_31"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a13_32"
    },
    {
        "source_sentence": "佛十力畢竟離故，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法亦畢竟離故。",
        "translation": "Because the Buddha's ten powers are ultimately free, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 distinctive qualities of the Buddha are also ultimately free.",
        "source": "T06n0220_341:0754a13_33"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a15_34"
    },
    {
        "source_sentence": "無忘失法畢竟離故，恒住捨性亦畢竟離故。",
        "translation": "Because the dharmas of nonforgetfulness are absolutely free, and because the nature of eternally abiding equanimity is also absolutely free.",
        "source": "T06n0220_341:0754a15_35"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a16_36"
    },
    {
        "source_sentence": "一切智畢竟離故，道相智、一切相智亦畢竟離故。",
        "translation": "Because omniscience is ultimately free, knowledge of the path and knowledge of all characteristics are also ultimately free.",
        "source": "T06n0220_341:0754a16_37"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a18_38"
    },
    {
        "source_sentence": "一切陀羅尼門畢竟離故，一切三摩地門亦畢竟離故。",
        "translation": "Because all dhāraṇī teachings are ultimately free, and all samādhi teachings are also ultimately free.",
        "source": "T06n0220_341:0754a18_39"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a19_40"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行畢竟離故。",
        "translation": "It's because all bodhisattva-mahāsattva practices are ultimately free.",
        "source": "T06n0220_341:0754a19_41"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a20_42"
    },
    {
        "source_sentence": "諸佛無上正等菩提畢竟離故。",
        "translation": "It's because the buddhas' unsurpassed perfect enlightenment is ultimately free of them.",
        "source": "T06n0220_341:0754a20_43"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a21_44"
    },
    {
        "source_sentence": "一切智智亦畢竟離故。",
        "translation": "It's because omniscience and cognition are also ultimately free.",
        "source": "T06n0220_341:0754a21_45"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a21_46"
    },
    {
        "source_sentence": "若法畢竟離，是法不應修，亦不應壞，亦不應引，甚深般若波羅蜜多畢竟離故不應能引。",
        "translation": "If the teaching is ultimately abandoned, this teaching shouldn't be cultivated, broken, or induced, and because the profound prajñāpāramitā is ultimately abandoned, it shouldn't be able to be induced.",
        "source": "T06n0220_341:0754a21_47"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a23_48"
    },
    {
        "source_sentence": "甚深般若波羅蜜多既畢竟離，云何可說菩薩摩訶薩依甚深波羅蜜多證得無上正等菩提？",
        "translation": "Since the profound prajñāpāramitā is ultimately free, how can it be said that bodhisattvas and mahāsattvas rely on the profound prajñāpāramitā to attain unsurpassed perfect enlightenment?",
        "source": "T06n0220_341:0754a23_49"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_341:0754a26_50"
    },
    {
        "source_sentence": "諸佛無上正等菩提亦畢竟離，云何離法能證離法？",
        "translation": "The buddhas' unsurpassed correct perfect enlightenment is also ultimately free, so how can it be realized by being free of things that are free of things?",
        "source": "T06n0220_341:0754a26_51"
    },
    {
        "source_sentence": "是故般若波羅蜜多應不可說證得無上正等菩提。」",
        "translation": "Therefore, the perfection of wisdom shouldn't be described as the attainment of unsurpassed perfect enlightenment.",
        "source": "T06n0220_341:0754a27_52"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百四十一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 4",
        "source": "T06n0220_341:0754a29_0"
    }
]