[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 6",
        "source": "T06n0220_365:0880a17_0"
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T06n0220_365:0880a18_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_365:0880a20_0"
    },
    {
        "source_sentence": "初分實說品第六十二之三",
        "translation": "Sixty-second and Third parts of the Sixty-second Chapter of the First Part of the Real Teaching",
        "source": "T06n0220_365:0880a21_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_365:0880a22_0"
    },
    {
        "source_sentence": "一切法皆以空為自性，一切法皆以無相為自性，一切法皆以無願為自性。",
        "translation": "All dharmas have emptiness as their own nature, all dharmas have signlessness as their own nature, and all dharmas have wishlessness as their own nature.",
        "source": "T06n0220_365:0880a22_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0880a23_2"
    },
    {
        "source_sentence": "由是因緣，諸菩薩摩訶薩應知一切法皆以無性為其自性。",
        "translation": "Because of these causes and conditions, bodhisattvas, mahāsattvas, should know that all dharmas have the absence of nature as their own essence.",
        "source": "T06n0220_365:0880a24_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_365:0880a25_4"
    },
    {
        "source_sentence": "一切法皆以真如為自性，一切法皆以法界為自性，一切法皆以法性為自性，",
        "translation": "All things have reality as their intrinsic nature. All things have the cosmos of reality as their intrinsic nature. All things have the essence of reality as their intrinsic nature.",
        "source": "T06n0220_365:0880a25_5"
    },
    {
        "source_sentence": "一切法皆以不虛妄性為自性，一切法皆以不變異性為自性，一切法皆以平等性為自性，",
        "translation": "All things have non-falsity as their essential nature. All things have unchanging, dissimilar nature as their essential nature. All things have equanimity as their essential nature.",
        "source": "T06n0220_365:0880a27_6"
    },
    {
        "source_sentence": "一切法皆以離生性為自性，一切法皆以法定為自性，一切法皆以法住為自性，",
        "translation": "All things have the nature of nonorigination as their own nature. All things have the law as their own nature. All things have the abode of truth as their own nature.",
        "source": "T06n0220_365:0880a29_7"
    },
    {
        "source_sentence": "一切法皆以實際為自性，一切法皆以虛空界為自性，一切法皆以不思議界為自性。",
        "translation": "All dharmas have reality as their own nature, all dharmas have the space realm as their own nature, and all dharmas have the inconceivable realm as their own nature.",
        "source": "T06n0220_365:0880b02_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0880b04_9"
    },
    {
        "source_sentence": "由是因緣，諸菩薩摩訶薩應知一切法皆以無性為其自性。」",
        "translation": "Because of these causes and conditions, bodhisattvas, mahāsattvas, should know that all dharmas have the absence of nature as their own essence.",
        "source": "T06n0220_365:0880b04_10"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0880b06_0"
    },
    {
        "source_sentence": "若一切法皆以無性為自性者，初發無上正等覺心菩薩摩訶薩成就何等善巧方便，",
        "translation": "“If all things have non-essence as their own essence, what skillful means does the enlightening being who first generates the mind of unexcelled perfect enlightenment accomplish?",
        "source": "T06n0220_365:0880b06_1"
    },
    {
        "source_sentence": "能行布施波羅蜜多，成熟有情、嚴淨佛土？",
        "translation": "Can you practice the perfection of generosity to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880b08_2"
    },
    {
        "source_sentence": "能行淨戒、安忍、精進、靜慮、般若波羅蜜多，成熟有情、嚴淨佛土？",
        "translation": "Can they practice the pure precepts, patience, effort, meditation, and prajñāpāramitā to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880b09_3"
    },
    {
        "source_sentence": "成就何等善巧方便，能住內空，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can abide in internal emptiness, ripen sentient beings, and adorn the Buddha's land?",
        "source": "T06n0220_365:0880b10_4"
    },
    {
        "source_sentence": "能住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They can abide in external emptiness, internal emptiness, external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all dhar",
        "source": "T06n0220_365:0880b12_5"
    },
    {
        "source_sentence": "成熟有情、嚴淨佛土？",
        "translation": "To ripen sentient beings and adorn the Buddha land?",
        "source": "T06n0220_365:0880b15_6"
    },
    {
        "source_sentence": "成就何等善巧方便，能住真如，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can abide in true thusness, ripen sentient beings, and adorn the Buddha's land?",
        "source": "T06n0220_365:0880b16_7"
    },
    {
        "source_sentence": "能住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "They can abide in the realm of reality, the nature of reality, the nature of reality, non-falsity, unchanging and dissimilarness, equality, freedom from arising, legality, the abiding of things, reality, space, and the inconceivable realm.",
        "source": "T06n0220_365:0880b17_8"
    },
    {
        "source_sentence": "成熟有情、嚴淨佛土？",
        "translation": "To ripen sentient beings and adorn the Buddha land?",
        "source": "T06n0220_365:0880b19_9"
    },
    {
        "source_sentence": "成就何等善巧方便，能行四念住，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can practice the four abodes of mindfulness, ripen sentient beings, and adorn and purify the Buddha's land?",
        "source": "T06n0220_365:0880b19_10"
    },
    {
        "source_sentence": "能行四正斷、四神足、五根、五力、七等覺支、八聖道支，成熟有情、嚴淨佛土？",
        "translation": "Can you practice the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880b20_11"
    },
    {
        "source_sentence": "成就何等善巧方便，能住苦聖諦，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can abide in the noble truth of suffering, ripen sentient beings, and adorn and purify the Buddha's land?",
        "source": "T06n0220_365:0880b22_12"
    },
    {
        "source_sentence": "能住集、滅、道聖諦，成熟有情、嚴淨佛土？",
        "translation": "Can they abide in the noble truths of accumulation, cessation, and the path, ripen sentient beings, and adorn and purify the Buddha's land?",
        "source": "T06n0220_365:0880b23_13"
    },
    {
        "source_sentence": "成就何等善巧方便，能行初靜慮，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means is accomplished that can practice the first concentration, ripen sentient beings, and adorn and purify the Buddha's land?",
        "source": "T06n0220_365:0880b24_14"
    },
    {
        "source_sentence": "能行第二、第三、第四靜慮，成熟有情、嚴淨佛土？",
        "translation": "Can he practice the second, third, and fourth meditations to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880b25_15"
    },
    {
        "source_sentence": "成就何等善巧方便，能行慈無量，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can practice immeasurable kindness, ripen sentient beings, and adorn the Buddha's land?",
        "source": "T06n0220_365:0880b26_16"
    },
    {
        "source_sentence": "能行悲、喜、捨無量，成熟有情、嚴淨佛土？",
        "translation": "Can you practice immeasurable compassion, joy, and equanimity to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880b28_17"
    },
    {
        "source_sentence": "成就何等善巧方便，能行空無邊處定，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has he accomplished that enables him to practice the boundless concentration of emptiness, ripen sentient beings, and purify the Buddha's land?",
        "source": "T06n0220_365:0880b29_18"
    },
    {
        "source_sentence": "能行識無邊處、無所有處、非想非非想處定，成熟有情、嚴淨佛土？",
        "translation": "Can he practice the boundless realm of consciousness, the sphere of nothingness, and the concentration of neither perception nor non-perception to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c01_19"
    },
    {
        "source_sentence": "成就何等善巧方便，能行八解脫，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has he accomplished that enables him to practice the eight liberations, ripen sentient beings, and adorn and purify the Buddha's land?",
        "source": "T06n0220_365:0880c02_20"
    },
    {
        "source_sentence": "能行八勝處、九次第定、十遍處，成熟有情、嚴淨佛土？",
        "translation": "Can you practice the eight superior abodes, nine graduated concentrations, and ten universal abodes to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c04_21"
    },
    {
        "source_sentence": "成就何等善巧方便，能行一切三摩地門，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can practice all the approaches to samādhi, ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c05_22"
    },
    {
        "source_sentence": "能行一切陀羅尼門，成熟有情、嚴淨佛土？",
        "translation": "Can you practice all the dhāraṇī teachings to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c06_23"
    },
    {
        "source_sentence": "成就何等善巧方便，能行空解脫門，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can practice the liberation gate of emptiness and ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c07_24"
    },
    {
        "source_sentence": "能行無相、無願解脫門，成熟有情、嚴淨佛土？",
        "translation": "Can you practice the liberation gate of signlessness and wishlessness, ripen sentient beings, and adorn and purify the Buddha's land?",
        "source": "T06n0220_365:0880c09_25"
    },
    {
        "source_sentence": "成就何等善巧方便，能行五眼，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has he accomplished that enables him to practice the five eyes, ripen sentient beings, and adorn and purify the Buddha-lands?",
        "source": "T06n0220_365:0880c10_26"
    },
    {
        "source_sentence": "能行六神通，成熟有情、嚴淨佛土？",
        "translation": "Can you practice the six supernormal powers to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c11_27"
    },
    {
        "source_sentence": "成就何等善巧方便，能行佛十力，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can practice the Buddha's ten powers to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c12_28"
    },
    {
        "source_sentence": "能行四無所畏、四無礙解、十八佛不共法，成熟有情、嚴淨佛土？",
        "translation": "Can they practice the four fearlessnesses, the four unhindered understandings, and the 18 Buddha-uncommon dharmas to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c13_29"
    },
    {
        "source_sentence": "成就何等善巧方便，能行大慈，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can practice great compassion, ripen sentient beings, and adorn the Buddha's land?",
        "source": "T06n0220_365:0880c14_30"
    },
    {
        "source_sentence": "能行大悲、大喜、大捨，成熟有情、嚴淨佛土？",
        "translation": "Can you practice great compassion, great joy, and great equanimity to ripen sentient beings and purify the Buddha's land?",
        "source": "T06n0220_365:0880c16_31"
    },
    {
        "source_sentence": "成就何等善巧方便，能行無忘失法，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has he accomplished that enables him to practice the principle of nonforgetfulness, ripen sentient beings, and adorn and purify the Buddha-lands?",
        "source": "T06n0220_365:0880c17_32"
    },
    {
        "source_sentence": "能行恒住捨性，成熟有情、嚴淨佛土？",
        "translation": "Can they practice the nature of constantly abiding equanimity, ripen sentient beings, and adorn and purify the Buddha-lands?",
        "source": "T06n0220_365:0880c18_33"
    },
    {
        "source_sentence": "成就何等善巧方便，能行一切智，成熟有情、嚴淨佛土？",
        "translation": "What kind of skillful means has been accomplished that can practice omniscience, ripen sentient beings, and adorn the Buddha's land?",
        "source": "T06n0220_365:0880c19_34"
    },
    {
        "source_sentence": "能行道相智、一切相智，成熟有情、嚴淨佛土？」",
        "translation": "Can you practice the knowledge of the path's characteristics and the knowledge of all characteristics to ripen sentient beings and purify the Buddha-lands?",
        "source": "T06n0220_365:0880c20_35"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0880c22_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩成就如是善巧方便，謂雖修學知一切法皆以無性為其自性，",
        "translation": "“Thus has the great enlightening being accomplished these skillful means:",
        "source": "T06n0220_365:0880c22_1"
    },
    {
        "source_sentence": "而常精勤成熟有情、嚴淨佛土，雖常精勤成熟有情、嚴淨佛土，而勤修學知諸有情及諸佛土皆以無性為其自性。",
        "translation": "He always diligently matures sentient beings and adorns the Buddha land, and although he always diligently matures sentient beings and adorns the Buddha land, he diligently cultivates and knows that all sentient beings and buddha lands have emptiness as their own nature.",
        "source": "T06n0220_365:0880c24_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0880c26_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩雖行布施波羅蜜多學菩提道，而知菩提道無性為自性；",
        "translation": "“Although great enlightening beings practice the perfection of giving and study the path of enlightenment, yet they know that the path of enlightenment has no essence as its intrinsic nature.",
        "source": "T06n0220_365:0880c26_2"
    },
    {
        "source_sentence": "雖行淨戒、安忍、精進、靜慮、般若波羅蜜多學菩提道，而知菩提道無性為自性。",
        "translation": "Even though they practice pure morality, patience, effort, meditation, and prajñāpāramitā to cultivate the path of enlightenment, they know that the path of enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0880c28_3"
    },
    {
        "source_sentence": "雖住內空學菩提道，而知菩提道無性為自性；",
        "translation": "Though they abide in internal emptiness and study the path of enlightenment, yet they know that the path of enlightenment has no-essence as its own essence.",
        "source": "T06n0220_365:0881a01_4"
    },
    {
        "source_sentence": "雖住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空學菩提道，",
        "translation": "Even though they abide in external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all dharmas,",
        "source": "T06n0220_365:0881a02_5"
    },
    {
        "source_sentence": "而知菩提道無性為自性。",
        "translation": "They know that the path of enlightenment has no nature as its own nature.",
        "source": "T06n0220_365:0881a05_6"
    },
    {
        "source_sentence": "雖住真如學菩提道，而知菩提道無性為自性；",
        "translation": "Though they abide in true thusness and study the path of enlightenment, yet they know that the path of enlightenment has no essence as its intrinsic nature.",
        "source": "T06n0220_365:0881a06_7"
    },
    {
        "source_sentence": "雖住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界學菩提道，",
        "translation": "Though they abide in the realm of reality, the nature of reality, non-falsity, unchanging and dissimilarity, equality, freedom from arising, legality, the abiding of phenomena, reality, space, and the inconceivable realm, yet they train on the path of enlightenment.",
        "source": "T06n0220_365:0881a07_8"
    },
    {
        "source_sentence": "而知菩提道無性為自性。",
        "translation": "They know that the path of enlightenment has no nature as its own nature.",
        "source": "T06n0220_365:0881a09_9"
    },
    {
        "source_sentence": "雖行四念住學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice the four kinds of mindfulness and abide learning the path of enlightenment, yet they know that the path of enlightenment has no-essence as its own essence.",
        "source": "T06n0220_365:0881a10_10"
    },
    {
        "source_sentence": "雖行四正斷、四神足、五根、五力、七等覺支、八聖道支學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path to training on the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a11_11"
    },
    {
        "source_sentence": "雖住苦聖諦學菩提道，而知菩提道無性為自性；",
        "translation": "Though they abide in the truth of suffering, they study the path of enlightenment. Yet they know that the path of enlightenment has no-essence as its intrinsic nature.",
        "source": "T06n0220_365:0881a13_12"
    },
    {
        "source_sentence": "雖住集、滅、道聖諦學菩提道，而知菩提道無性為自性。",
        "translation": "Although they abide in the noble truths of accumulation, cessation, and the path, they train on the path to enlightenment, yet they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a14_13"
    },
    {
        "source_sentence": "雖行初靜慮學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice the first concentration and study the path of enlightenment, yet they know that the path of enlightenment has no-essence as its intrinsic nature.",
        "source": "T06n0220_365:0881a15_14"
    },
    {
        "source_sentence": "雖行第二、第三、第四靜慮學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice the second, third, and fourth meditations to train on the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a16_15"
    },
    {
        "source_sentence": "雖行慈無量學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice infinite kindness and study the path of enlightenment, yet they know that the path of enlightenment has no-essence as its own essence.",
        "source": "T06n0220_365:0881a18_16"
    },
    {
        "source_sentence": "雖行悲、喜、捨無量學菩提道，而知菩提道無性為自性。",
        "translation": "Even though they practice compassion, joy, and equanimity without measure and study the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a19_17"
    },
    {
        "source_sentence": "雖行空無邊處定學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice emptiness and the boundless realm of infinity, they always study the path of enlightenment; yet they know that the path of enlightenment has no-essence as its intrinsic nature.",
        "source": "T06n0220_365:0881a20_18"
    },
    {
        "source_sentence": "雖行識無邊處、無所有處、非想非非想處定學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice the boundless realm of consciousness, the sphere of nothingness, and the concentrations of neither perception nor non-perception cultivate the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a21_19"
    },
    {
        "source_sentence": "雖行八解脫學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice the eight liberations and study the path of enlightenment, yet they know that the path of enlightenment has no essence as its intrinsic nature.",
        "source": "T06n0220_365:0881a23_20"
    },
    {
        "source_sentence": "雖行八勝處、九次第定、十遍處學菩提道，而知菩提道無性為自性。",
        "translation": "Even though they practice the eight abodes of excellence, nine graduated concentrations, and ten universal abodes to train on the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a24_21"
    },
    {
        "source_sentence": "雖行一切三摩地門學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice all aspects of concentration and study the path of enlightenment, yet they know that the path of enlightenment has no-essence as its own essence.",
        "source": "T06n0220_365:0881a26_22"
    },
    {
        "source_sentence": "雖行一切陀羅尼門學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice all the dhāraṇī teachings and train on the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a27_23"
    },
    {
        "source_sentence": "雖行空解脫門學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice the liberation gate of emptiness and learn the path of enlightenment, yet they know that the path of enlightenment has no-essence as its own essence.",
        "source": "T06n0220_365:0881a28_24"
    },
    {
        "source_sentence": "雖行無相、無願解脫門學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice the liberation gate of marklessness and wishlessness and train on the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881a29_25"
    },
    {
        "source_sentence": "雖行五眼學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice the five eyes and study the path of enlightenment, yet they know that the path of enlightenment has no-essence as its own essence.",
        "source": "T06n0220_365:0881b02_26"
    },
    {
        "source_sentence": "雖行六神通學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice the six supernormal powers and study the path to enlightenment, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881b03_27"
    },
    {
        "source_sentence": "雖行佛十力學菩提道，而知菩提道無性為自性，雖行四無所畏、四無礙解、十八佛不共法學菩提道，",
        "translation": "Though they practice the ten powers of Buddha and study the path of enlightenment, yet they know that the path of enlightenment has no essence as its intrinsic nature. Though they practice the four fearlessnesses, the four unhindered understandings, and the unique qualities of the eighteen Buddhas, yet they still study the path of enlightenment.",
        "source": "T06n0220_365:0881b04_28"
    },
    {
        "source_sentence": "而知菩提道無性為自性。",
        "translation": "They know that the path of enlightenment has no nature as its own nature.",
        "source": "T06n0220_365:0881b06_29"
    },
    {
        "source_sentence": "雖行大慈學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice great compassion and study the path of enlightenment, yet they know that the path of enlightenment has no-essence as its own essence.",
        "source": "T06n0220_365:0881b07_30"
    },
    {
        "source_sentence": "雖行大悲、大喜、大捨學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice great compassion, great joy, and great equanimity to train in the path of enlightenment, they know that the path of enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881b08_31"
    },
    {
        "source_sentence": "雖行無忘失法學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice the path of enlightenment without forgetting things, yet they know that the path of enlightenment has no essence as its intrinsic nature.",
        "source": "T06n0220_365:0881b09_32"
    },
    {
        "source_sentence": "雖行恒住捨性學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice the path of enlightenment and always abide in equanimity, they know that the path of enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881b10_33"
    },
    {
        "source_sentence": "雖行一切智學菩提道，而知菩提道無性為自性；",
        "translation": "Though they practice omniscience and study the path of enlightenment, yet they know that the path of enlightenment has no essence as its intrinsic nature.",
        "source": "T06n0220_365:0881b12_34"
    },
    {
        "source_sentence": "雖行道相智、一切相智學菩提道，而知菩提道無性為自性。",
        "translation": "Although they practice knowledge of the path's characteristics and all characteristics and study the path to enlightenment with knowledge of all characteristics, they know that the path to enlightenment has no nature as its own essence.",
        "source": "T06n0220_365:0881b13_35"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0881b15_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩如是修行布施波羅蜜多學菩提道，如是修行淨戒、安忍、精進、靜慮、般若波羅蜜多學菩提道，",
        "translation": "“Thus does the bodhisattva Mahāsattva practice the perfection of generosity in order to follow the path of enlightenment, and so does he practice the perfection of morality, patience, effort, meditation, and wisdom in order to follow the path of enlightenment.",
        "source": "T06n0220_365:0881b15_1"
    },
    {
        "source_sentence": "如是安住內空學菩提道，如是安住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空學菩提道，",
        "translation": "They thus abide in internal emptiness and study the path of enlightenment, and thus they abide in external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature",
        "source": "T06n0220_365:0881b17_2"
    },
    {
        "source_sentence": "如是安住真如學菩提道，如是安住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界學菩提道，",
        "translation": "Thus abiding in true thusness, they train on the path of enlightenment, and thus abiding in the realm of reality, the essence of reality, the nature of reality, non-falsity, unchanging and dissimilarity, equality, freedom from birth, legality, the abode of dharmas, reality, space, and inconceivable",
        "source": "T06n0220_365:0881b21_3"
    },
    {
        "source_sentence": "如是修行四念住學菩提道，如是修行四正斷、四神足、五根、五力、七等覺支、八聖道支學菩提道，",
        "translation": "“Thus do they cultivate the four foundations of mindfulness in order to learn the path of enlightenment; thus do they cultivate the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path in order to learn the path of enlightenment.",
        "source": "T06n0220_365:0881b24_4"
    },
    {
        "source_sentence": "如是安住苦聖諦學菩提道，如是安住集、滅、道聖諦學菩提道，如是修行初靜慮學菩提道，",
        "translation": "Thus abiding in the noble truth of suffering, he trains on the path to enlightenment; thus abiding in the noble truths of accumulation, cessation, and the path, he trains on the path to enlightenment; thus cultivating the first concentration, he trains on the path to enlightenment.",
        "source": "T06n0220_365:0881b26_5"
    },
    {
        "source_sentence": "如是修行第二、第三、第四靜慮學菩提道，如是修行慈無量學菩提道，",
        "translation": "Thus cultivating the second, third, and fourth meditations of practice to learn the path to enlightenment, thus cultivating kindness without measure to learn the path to enlightenment.",
        "source": "T06n0220_365:0881c01_0"
    },
    {
        "source_sentence": "如是修行悲、喜、捨無量學菩提道，如是修行空無邊處定學菩提道，如是修行識無邊處、無所有處、非想非非想處定學菩提道，",
        "translation": "Thus cultivating compassion, joy, and equanimity without measure to study the path of enlightenment, thus cultivating concentration in the boundless space of emptiness to study the path of enlightenment, thus cultivating concentration in the boundless realm of consciousness, the sphere of nothingness, and the sphere of neither perception nor non-",
        "source": "T06n0220_365:0881c02_1"
    },
    {
        "source_sentence": "如是修行八解脫學菩提道，如是修行八勝處、九次第定、十遍處學菩提道，",
        "translation": "Thus they cultivate the eight liberations and study the path of enlightenment; thus they cultivate the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes to study the path of enlightenment.",
        "source": "T06n0220_365:0881c05_2"
    },
    {
        "source_sentence": "如是修行一切三摩地門學菩提道，如是修行一切陀羅尼門學菩提道，如是修行空解脫門學菩提道，",
        "translation": "Thus cultivating all the approaches of concentration, they train on the path to enlightenment; thus cultivating all the approaches of mental command, they train on the path to enlightenment; thus cultivating all the approaches of concentration, they train on the path to enlightenment; thus cultivating all the approaches of meditation, they train on the path to enlighten",
        "source": "T06n0220_365:0881c07_3"
    },
    {
        "source_sentence": "如是修行無相、無願解脫門學菩提道，如是修行五眼學菩提道，如是修行六神通學菩提道，",
        "translation": "Thus they cultivate the liberation of signlessness and wishlessness to learn the path of enlightenment; thus they cultivate the five eyes to learn the path of enlightenment; thus they cultivate the six supernormal powers to learn the path of enlightenment.",
        "source": "T06n0220_365:0881c09_4"
    },
    {
        "source_sentence": "如是修行佛十力學菩提道，如是修行四無所畏、四無礙解、十八佛不共法學菩提道，",
        "translation": "“Thus do they cultivate the ten powers of buddhas and study the path of enlightenment; thus do they cultivate the four fearlessnesses, the four unhindered understandings, and the eighteen unique qualities of buddhas to study the path of enlightenment.",
        "source": "T06n0220_365:0881c11_5"
    },
    {
        "source_sentence": "如是修行大慈學菩提道，如是修行大悲、大喜、大捨學菩提道，如是修行無忘失法學菩提道，",
        "translation": "In this way they cultivate great compassion, great joy, and great equanimity in order to learn the path of enlightenment; in this way they cultivate great compassion, great joy, and great equanimity in order to learn the path of enlightenment; in this way they cultivate unforgetlessness in order to learn the path of enlightenment.",
        "source": "T06n0220_365:0881c13_6"
    },
    {
        "source_sentence": "如是修行恒住捨性學菩提道，如是修行一切智學菩提道，如是修行道相智、一切相智學菩提道，",
        "translation": "Thus do they cultivate the path of enlightenment by always abiding in equanimity; thus do they cultivate omniscience and study the path of enlightenment; thus do they cultivate knowledge of all characteristics of the path and knowledge of all characteristics to study the path of enlightenment.",
        "source": "T06n0220_365:0881c15_7"
    },
    {
        "source_sentence": "乃至未得如來十力、四無所畏、四無礙解、十八佛不共法、大慈、大悲、大喜、大捨、無忘失法、恒住捨性、一切智、道相智、一切相智，",
        "translation": "They have not yet attained the ten powers, four fearlessnesses, four unhindered understandings, eighteen unique qualities of buddhahood, great kindness, great compassion, great compassion, great joy, great equanimity, the principle of no forgetfulness, constancy in equanimity, omniscience, knowledge of the path, and knowledge of all characteristics",
        "source": "T06n0220_365:0881c17_8"
    },
    {
        "source_sentence": "皆名學菩提道未得圓滿。",
        "translation": "They're all called training in the path of enlightenment that hasn't yet been perfected.",
        "source": "T06n0220_365:0881c20_9"
    },
    {
        "source_sentence": "若於此道已得圓滿，則於一切波羅蜜多亦已圓滿。",
        "translation": "If someone has fulfilled this path, then they've fulfilled all the perfections.",
        "source": "T06n0220_365:0881c21_10"
    },
    {
        "source_sentence": "波羅蜜多已圓滿故，由一剎那相應妙慧證得如來一切相智。",
        "translation": "Because the perfections have been fulfilled, it's because of the marvelous wisdom associated with a single moment that he realizes the Tathāgata's omniscience of all characteristics.",
        "source": "T06n0220_365:0881c22_11"
    },
    {
        "source_sentence": "爾時，一切微細煩惱習氣相續永不生故名無餘斷，則名如來、應、正等覺，",
        "translation": "At that moment, all subtle defilements and habit energy are successive and never produced. Therefore, it is called nirvana without remainder. The Tathagata, the Arhat, and the Completely Awakened One are named that.",
        "source": "T06n0220_365:0881c23_12"
    },
    {
        "source_sentence": "以無障礙清淨佛眼，遍觀十方三界諸法，尚不得無，況當得有！",
        "translation": "Because of the unobstructed pure Buddha eye, he observes all the dharmas in the three realms in the ten directions and doesn't yet attain nonexistence, so how could there be?",
        "source": "T06n0220_365:0881c25_13"
    },
    {
        "source_sentence": "「如是！",
        "translation": "“So it is!",
        "source": "T06n0220_365:0881c27_0"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0881c27_1"
    },
    {
        "source_sentence": "諸菩薩摩訶薩應行般若波羅蜜多，觀一切法皆以無性為其自性。",
        "translation": "All bodhisattvas, mahāsattvas, should practice the perfection of wisdom and observe that all dharmas have no nature as their own essence.",
        "source": "T06n0220_365:0881c27_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0881c28_3"
    },
    {
        "source_sentence": "是名菩薩摩訶薩最勝善巧方便，謂行般若波羅蜜多觀一切法，尚不得無，",
        "translation": "This is called the most excellent skillful means of enlightening beings, which is to practice prajñāpāramitā and contemplate all things without ever attaining nonexistence.",
        "source": "T06n0220_365:0881c28_4"
    },
    {
        "source_sentence": "況當得有！",
        "translation": "How could there be such a thing?",
        "source": "T06n0220_365:0882a01_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882a01_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行布施波羅蜜多時，於此布施施者、受者、諸所施物及菩提心，",
        "translation": "“When these bodhisattvas and mahāsattvas practice the perfection of giving, they give to those who give, to those who receive, to the things given, and to the aspiration for enlightenment.",
        "source": "T06n0220_365:0882a02_0"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882a03_1"
    },
    {
        "source_sentence": "修行淨戒波羅蜜多時，於此淨戒護淨戒處、持淨戒者、守淨戒心，尚不觀無，",
        "translation": "When he cultivates the perfection of pure morality, he doesn't even contemplate the absence of these pure precepts as a place for purifying precepts, those who uphold them, or minds that observe pure precepts.",
        "source": "T06n0220_365:0882a04_2"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882a06_0"
    },
    {
        "source_sentence": "修行安忍波羅蜜多時，於此安忍修安忍處、能安忍者、修安忍心，尚不觀無，",
        "translation": "When he cultivates the perfection of patience, he doesn’t even contemplate peace and tolerance here, where he cultivates a state of peace and tolerance, calms the ninja, or cultivates a state of peace and tolerance.",
        "source": "T06n0220_365:0882a06_1"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882a07_2"
    },
    {
        "source_sentence": "修行精進波羅蜜多時，於此精進修精進處、能精進者、修精進心，尚不觀無，",
        "translation": "When he cultivates the perfection of effort, he doesn’t even contemplate the absence of this exertion as a locus of exertion, that which is capable of exertion, or the mind that cultivates exertion.",
        "source": "T06n0220_365:0882a08_3"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882a09_4"
    },
    {
        "source_sentence": "修行靜慮波羅蜜多時，於此靜慮修靜慮處、能靜慮者、修靜慮心，尚不觀無，",
        "translation": "When he cultivates the perfection of meditation, he doesn’t even contemplate absence in these meditations and cultivates the abodes of meditation, those who are capable of meditation, or those who cultivate the mind of meditation.",
        "source": "T06n0220_365:0882a10_5"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882a11_6"
    },
    {
        "source_sentence": "修行般若波羅蜜多時，於此般若修般若處、修般若者、修般若心，尚不觀無，",
        "translation": "When he cultivates the perfection of wisdom, he cultivates the abode of prajñā in this prajñā, cultivates those who cultivate prajñā, and cultivates the mind of prajñā, yet doesn't contemplate nonexistence.",
        "source": "T06n0220_365:0882a12_7"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882a13_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882a14_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩安住內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空時，",
        "translation": "This is the time when the bodhisattva Mahāsattva abides in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature,",
        "source": "T06n0220_365:0882a14_10"
    },
    {
        "source_sentence": "於此內空乃至無性自性空能安住者、由此安住、修安住處，尚不觀無，",
        "translation": "Those who can abide in this internal emptiness or even the emptiness of the natureless self-nature of emptiness as emptiness and cultivate their peaceful abiding because of this peaceful abiding don't yet contemplate nonexistence.",
        "source": "T06n0220_365:0882a18_11"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882a19_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882a20_13"
    },
    {
        "source_sentence": "是菩薩摩訶薩安住真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界時，",
        "translation": "“This is the time when the great enlightening being abides in truth, in the realm of reality, in the realm of reality, in the nature of reality, in non-falsity, in unchangingness, in dissimilarity, in equality, in freedom from birth, in law, in the abode of things, in reality, in space, and inconceivable",
        "source": "T06n0220_365:0882a20_14"
    },
    {
        "source_sentence": "於此真如乃至不思議界能安住者、由此安住、修安住處，尚不觀無，況觀為有！",
        "translation": "Those who can abide in this true reality or even in the inconceivable realm can thus abide and cultivate the abode of peace, but they still don't contemplate nonexistence, so why would they contemplate existence?",
        "source": "T06n0220_365:0882a22_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882a24_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支時，",
        "translation": "“When these great enlightening beings practice the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path,",
        "source": "T06n0220_365:0882a24_17"
    },
    {
        "source_sentence": "於此四念住乃至八聖道支能修行者、由此修行、及修行處，尚不觀無，",
        "translation": "In these four abodes of mindfulness up to the eightfold noble path that can be cultivated by those who can cultivate it, they still don’t contemplate nonexistence from this cultivation or from the place of cultivation.",
        "source": "T06n0220_365:0882a26_18"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882a27_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882a28_20"
    },
    {
        "source_sentence": "是菩薩摩訶薩安住苦聖諦、集、滅、道聖諦時，於此苦聖諦、集、滅、道聖諦能安住者、由此安住、修安住處，",
        "translation": "“When great enlightening beings abide in the noble truth of suffering, the noble truth of arising, the noble truth of cessation, and the noble truth of the path, those who can abide in these noble truths of suffering, the noble truth of arising, the noble truth of cessation, and the noble truth of the path—and thus",
        "source": "T06n0220_365:0882a28_21"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882b01_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b02_23"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行四靜慮、四無量、四無色定時，於此四靜慮、四無量、四無色定能修行者，",
        "translation": "“When the great enlightening beings practice the four concentrations, the four immeasurable concentrations, and the four formless concentrations, they can cultivate these four meditations, the four immeasurable concentrations, and the four formless concentrations.",
        "source": "T06n0220_365:0882b02_24"
    },
    {
        "source_sentence": "由此修行、及修行處，尚不觀無，況觀為有！",
        "translation": "Because of this cultivation and the place of cultivation, they still don't contemplate nonexistence, so why would they contemplate existence?",
        "source": "T06n0220_365:0882b04_25"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b05_26"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行八解脫、八勝處、九次第定、十遍處時，於此八解脫、八勝處、九次第定、十遍處能修行者、由此修行、及修行處，",
        "translation": "“When these great enlightening beings practice the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes, they are able to cultivate these eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes.",
        "source": "T06n0220_365:0882b05_27"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882b08_28"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b08_29"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行一切三摩地門、一切陀羅尼門時，於此一切三摩地門、一切陀羅尼門能修行者、由此修行、及修行處，",
        "translation": "“When these great enlightening beings practice all the doors of concentration, all the doors of concentration, and all the doors of incantations, they are able to cultivate all those doors of concentration, all the doors of incantations, and all the doors of teaching.",
        "source": "T06n0220_365:0882b08_30"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882b11_31"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b12_32"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行空解脫門、無相、無願解脫門時，於此空解脫門、無相、無願解脫門能修行者、由此修行、及修行處，",
        "translation": "“When these great enlightening beings practice the liberation door of emptiness, the liberation door of signlessness, and the liberation door of wishlessness, they are able to cultivate in this liberation door of emptiness, the liberation door of signlessness, and the liberation door of wishlessness.",
        "source": "T06n0220_365:0882b12_33"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882b14_34"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b15_35"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行五眼、六神通時，於此五眼、六神通能修行者、由此修行、及修行處，",
        "translation": "“When these great enlightening beings practice the five eyes and six superknowledges, they are able to cultivate these five eyes and six superknowledges:",
        "source": "T06n0220_365:0882b15_36"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882b17_37"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b18_38"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法時，",
        "translation": "“When these great enlightening beings practice the ten powers of buddhahood, the four fearlessnesses, the four unhindered understandings, great benevolence, great compassion, great joy, great equanimity, and the unique qualities of the eighteen Buddhas,",
        "source": "T06n0220_365:0882b18_39"
    },
    {
        "source_sentence": "於此佛十力乃至十八佛不共法能修行者、由此修行、及修行處，尚不觀無，",
        "translation": "“Those who practice the ten powers of these buddhas, up to the unique qualities of the eighteen buddhas, and those who practice them do not even contemplate their absence.",
        "source": "T06n0220_365:0882b20_40"
    },
    {
        "source_sentence": "況觀為有！",
        "translation": "How could it be that contemplation is existence!",
        "source": "T06n0220_365:0882b21_41"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b22_42"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行無忘失法、恒住捨性時，於此無忘失法、恒住捨性能修行者、由此修行、及修行處，",
        "translation": "“When these great enlightening beings practice the principle of nonforgetfulness and always abide in equanimity, they cultivate this principle of nonforgetfulness and always abide in equanimity.",
        "source": "T06n0220_365:0882b22_43"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882b24_44"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b25_45"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行一切智、道相智、一切相智時，於此一切智、道相智、一切相智能修行者、由此修行、及修行處，",
        "translation": "“When these great enlightening beings practice omniscience, knowledge of all paths, knowledge of all characteristics, and knowledge of all characteristics, they develop the practice of omniscience, knowledge of all paths, and knowledge of all characteristics.",
        "source": "T06n0220_365:0882b25_46"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882b27_47"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0882b28_48"
    },
    {
        "source_sentence": "是菩薩摩訶薩隨證得一切智智時，於此一切智智能隨證得者、由此隨證得、及隨證得處，",
        "translation": "“When great enlightening beings have attained omniscience, they are accompanied by the realization of omniscience.",
        "source": "T06n0220_365:0882b28_49"
    },
    {
        "source_sentence": "尚不觀無，況觀為有！",
        "translation": "They don't yet contemplate nonexistence, so why would they contemplate existence!",
        "source": "T06n0220_365:0882c01_50"
    },
    {
        "source_sentence": "「何以故？",
        "translation": "“Why is that?",
        "source": "T06n0220_365:0882c02_0"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0882c02_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩常作是念：『諸法皆以無性為性，如是無性，本性自爾，",
        "translation": "“Furthermore, these great enlightening beings always think, ‘All things have the absence of essence as their nature.",
        "source": "T06n0220_365:0882c02_2"
    },
    {
        "source_sentence": "非佛所作，非獨覺作，非聲聞作，亦非餘作。",
        "translation": "They aren't created by the Buddha, aren't created by solitary realizers, aren't created by śrāvakas, and aren't created by others.",
        "source": "T06n0220_365:0882c03_3"
    },
    {
        "source_sentence": "以一切法皆無作者，離作者故。』」",
        "translation": "It's because all dharmas lack author and are free of author.'",
        "source": "T06n0220_365:0882c04_4"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0882c06_0"
    },
    {
        "source_sentence": "豈不諸法離諸法性？」",
        "translation": "Isn't it true that all dharmas are free of the nature of dharmas?",
        "source": "T06n0220_365:0882c06_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0882c07_2"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_365:0882c07_3"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_365:0882c07_4"
    },
    {
        "source_sentence": "如汝所說，諸法無不離諸法性。」",
        "translation": "As you say, there are no dharmas that aren't separate from the nature of dharmas.",
        "source": "T06n0220_365:0882c07_5"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0882c08_6"
    },
    {
        "source_sentence": "若一切法離法性者，云何離法能知離法若有若無？",
        "translation": "If all dharmas are free of the nature of dharmas, how can one who is free of dharmas know that they exist or don't exist apart from dharmas?",
        "source": "T06n0220_365:0882c09_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_365:0882c10_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0882c10_2"
    },
    {
        "source_sentence": "無法不應能知無法，有法不應能知有法，無法不應能知有法，有法不應能知無法。",
        "translation": "What's nonexistent shouldn't be able to know what's nonexistent, what's existent shouldn't be able to know what's existent, what's nonexistent shouldn't be able to know what's existent, and what's existent shouldn't be able to know what's nonexistent.",
        "source": "T06n0220_365:0882c10_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0882c12_4"
    },
    {
        "source_sentence": "如是一切法皆無知為性，云何菩薩摩訶薩修行般若波羅蜜多，顯示諸法若有若無？」",
        "translation": "Thus, all dharmas are without knowing as their nature, so how does the bodhisattva Mahāsattva cultivate the perfection of wisdom to show that all dharmas exist and don't exist?",
        "source": "T06n0220_365:0882c12_5"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0882c14_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多，隨世俗故顯示諸法若有若無，非隨勝義。」",
        "translation": "The bodhisattvas, mahāsattvas, and bodhisattvas who cultivate the perfection of prajñāpāramitā show that whether they exist or don't exist according to worldly conventions doesn't follow ultimate meaning.",
        "source": "T06n0220_365:0882c14_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0882c16_8"
    },
    {
        "source_sentence": "世俗、勝義為有異不？」",
        "translation": "Is there a difference between worldly and ultimate meaning?",
        "source": "T06n0220_365:0882c16_9"
    },
    {
        "source_sentence": "「不也！",
        "translation": "“No!",
        "source": "T06n0220_365:0882c17_10"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0882c17_11"
    },
    {
        "source_sentence": "非異世俗別有勝義。",
        "translation": "It's not different from the conventional that there's a distinct superior meaning.",
        "source": "T06n0220_365:0882c17_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_365:0882c18_0"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0882c18_1"
    },
    {
        "source_sentence": "世俗真如即是勝義，諸有情類顛倒妄執，於此真如不知不見，菩薩摩訶薩哀愍彼故，",
        "translation": "The worldly truth is ultimately ultimate meaning, and sentient beings mistakenly and deludedly cling to it, not knowing or seeing it; therefore, the great enlightening beings pity them.",
        "source": "T06n0220_365:0882c18_2"
    },
    {
        "source_sentence": "隨世俗相顯示諸法若有若無。",
        "translation": "According to worldly characteristics, they show whether the dharmas exist or don't exist.",
        "source": "T06n0220_365:0882c20_3"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0882c21_4"
    },
    {
        "source_sentence": "諸有情類於蘊等法起實有想不知非有，菩薩摩訶薩哀愍彼故，分別諸法若有若無，",
        "translation": "Sentient beings give rise to perceptions of aggregates and so forth as really existing and don’t know they aren’t. Because great enlightening beings have compassion for them, they discriminate between the existence and nonexistence of things:",
        "source": "T06n0220_365:0882c21_5"
    },
    {
        "source_sentence": "如何當令彼有情類知蘊等法皆非實有。",
        "translation": "How will they cause sentient beings to know that dharmas like the aggregates don't really exist?",
        "source": "T06n0220_365:0882c23_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0882c24_7"
    },
    {
        "source_sentence": "諸菩薩摩訶薩應行如是甚深般若波羅蜜多。」",
        "translation": "Such profound prajñāpāramitā should be practiced by bodhisattvas, mahāsattvas.",
        "source": "T06n0220_365:0882c24_8"
    },
    {
        "source_sentence": "初分巧便行品第六十三之一",
        "translation": "The Sixty-third and One Part 61 of the Chapter on Skillful Conduct in the First Part",
        "source": "T06n0220_365:0882c26_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0882c27_0"
    },
    {
        "source_sentence": "如來常說菩薩行菩薩行，何等名為菩薩行耶？」",
        "translation": "What's called the bodhisattva practice when the Tathāgata always explains the bodhisattva practice and bodhisattva practice?",
        "source": "T06n0220_365:0882c27_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0882c28_2"
    },
    {
        "source_sentence": "菩薩行者，謂為無上正等菩提故行，是名菩薩行。」",
        "translation": "A bodhisattva's practice is to practice for the sake of unsurpassed perfect enlightenment, which is called a bodhisattva practice.",
        "source": "T06n0220_365:0882c29_0"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0883a01_1"
    },
    {
        "source_sentence": "菩薩摩訶薩當於何處行菩薩行？」",
        "translation": "Where will the bodhisattva Mahāsattva perform the bodhisattva's practice?",
        "source": "T06n0220_365:0883a01_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0883a02_3"
    },
    {
        "source_sentence": "菩薩摩訶薩當於色空行菩薩行，當於受、想、行、識空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva's practice of emptiness of form, and he will perform the bodhisattva's practice of emptiness of feeling, perception, volition, and consciousness.",
        "source": "T06n0220_365:0883a02_4"
    },
    {
        "source_sentence": "菩薩摩訶薩當於眼處空行菩薩行，當於耳、鼻、舌、身、意處空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva practice of emptiness in the eye, and he should perform the bodhisattva practice of emptiness in the ear, nose, nose, tongue, body, and mind.",
        "source": "T06n0220_365:0883a04_5"
    },
    {
        "source_sentence": "菩薩摩訶薩當於色處空行菩薩行，當於聲、香、味、觸、法處空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva practice of emptiness in the form realm, and he will perform the bodhisattva practice of emptiness in the sound, smell, taste, touch, and dharma realms.",
        "source": "T06n0220_365:0883a05_6"
    },
    {
        "source_sentence": "菩薩摩訶薩當於眼界空行菩薩行，當於耳、鼻、舌、身、意界空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva practice of emptiness in the eye realm, and he should perform the bodhisattva practice of emptiness in the ear, nose, nose, tongue, body, and mind realms.",
        "source": "T06n0220_365:0883a07_7"
    },
    {
        "source_sentence": "菩薩摩訶薩當於色界空行菩薩行，當於聲、香、味、觸、法界空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva practice of emptiness in the form realm, and he will perform the bodhisattva practice of emptiness in the sound, smell, taste, touch, and dharma realms.",
        "source": "T06n0220_365:0883a09_0"
    },
    {
        "source_sentence": "菩薩摩訶薩當於眼識界空行菩薩行，當於耳、鼻、舌、身、意識界空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva practice of emptiness in the eye consciousness realm and the bodhisattva practice of emptiness in the ear, nose, nose, tongue, body, and consciousness realms.",
        "source": "T06n0220_365:0883a10_1"
    },
    {
        "source_sentence": "菩薩摩訶薩當於眼觸空行菩薩行，當於耳、鼻、舌、身、意觸空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice of touching emptiness with the eye, and he should perform the bodhisattva's practice of touching emptiness with the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_365:0883a12_2"
    },
    {
        "source_sentence": "菩薩摩訶薩當於眼觸為緣所生諸受空行菩薩行，當於耳、鼻、舌、身、意觸為緣所生諸受空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva's practice of emptiness in the sensations that arise from eye contact as a condition, and he will perform the bodhisattva's practice of emptiness in the sensations that arise from ear, nose, nose, tongue, body, and mind contact as a condition.",
        "source": "T06n0220_365:0883a13_3"
    },
    {
        "source_sentence": "菩薩摩訶薩當於地界空行菩薩行，當於水、火、風、空、識界空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva's practice of emptiness in the earth realm and the bodhisattva's practice of emptiness in the water, fire, wind, air, space, and consciousness realms.",
        "source": "T06n0220_365:0883a16_4"
    },
    {
        "source_sentence": "菩薩摩訶薩當於無明空行菩薩行，當於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will practice the bodhisattva's practice in the emptiness of nescience, and he will practice the bodhisattva's practice in the emptiness of form, consciousness, name-and-form, the six sense-fields, touch, sensation, feeling, craving, apprehension, existence, birth, birth,",
        "source": "T06n0220_365:0883a17_5"
    },
    {
        "source_sentence": "菩薩摩訶薩當於內法空行菩薩行，當於外法空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should practice the bodhisattva's practice of emptiness of internal dharmas and practice the bodhisattva's practice of emptiness of external dharmas.",
        "source": "T06n0220_365:0883a20_6"
    },
    {
        "source_sentence": "菩薩摩訶薩當於布施波羅蜜多空行菩薩行，當於淨戒、安忍、精進、靜慮、般若波羅蜜多空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice in the emptiness of the perfection of generosity, and he should perform the bodhisattva's practice in the emptiness of the perfection of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T06n0220_365:0883a21_7"
    },
    {
        "source_sentence": "菩薩摩訶薩當於內空空行菩薩行，當於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should practice the bodhisattva's practice in terms of internal emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature",
        "source": "T06n0220_365:0883a23_8"
    },
    {
        "source_sentence": "菩薩摩訶薩當於初靜慮空行菩薩行，當於第二、第三、第四靜慮空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice of emptiness in the first concentration, and he should perform the bodhisattva's practice of emptiness in the second, third, and fourth concentrations.",
        "source": "T06n0220_365:0883a28_9"
    },
    {
        "source_sentence": "菩薩摩訶薩當於慈無量空行菩薩行，當於悲、喜、捨無量空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva practice of infinite emptiness in kindness, and he should perform the bodhisattva practices of infinite emptiness in pity, joy, and equanimity.",
        "source": "T06n0220_365:0883b01_0"
    },
    {
        "source_sentence": "菩薩摩訶薩當於空無邊處定空行菩薩行，當於識無邊處定、無所有處定、非想非非想處定空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should practice the bodhisattva's practice of emptiness in the boundless realm of emptiness, and he should practice the bodhisattva's practice of emptiness in the boundless realm of consciousness, the sphere of nothingness, and the sphere of neither perception nor non-perception.",
        "source": "T06n0220_365:0883b02_1"
    },
    {
        "source_sentence": "菩薩摩訶薩當於四念住空行菩薩行，當於四正斷、四神足、五根、五力、七等覺支、八聖道支空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice of abiding in emptiness with four kinds of mindfulness, and he should perform the bodhisattva's practice of emptiness with four correct eliminations, four miraculous abilities, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the",
        "source": "T06n0220_365:0883b05_0"
    },
    {
        "source_sentence": "菩薩摩訶薩當於和合空行菩薩行，當於不和合空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva's practice of combining emptiness and the bodhisattva's practice of not combining emptiness.",
        "source": "T06n0220_365:0883b07_1"
    },
    {
        "source_sentence": "菩薩摩訶薩當於空解脫門空行菩薩行，當於無相、無願解脫門空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice of emptiness in the liberation gate of emptiness, and he should perform the bodhisattva's practice of emptiness in the liberation gate of signlessness and wishlessness in the liberation gate of emptiness.",
        "source": "T06n0220_365:0883b08_2"
    },
    {
        "source_sentence": "菩薩摩訶薩當於八解脫空行菩薩行，當於八勝處、九次第定、十遍處空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should practice the bodhisattva's practice of emptiness in the eight liberations, and he should practice the bodhisattva's practice of emptiness in the eight superior places, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_365:0883b10_3"
    },
    {
        "source_sentence": "菩薩摩訶薩當於苦聖諦空行菩薩行，當於集、滅、道聖諦空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva practice of emptiness in the noble truth of suffering, and he will perform the bodhisattva practice of emptiness in the noble truths of arising, ceasing, and the path.",
        "source": "T06n0220_365:0883b12_4"
    },
    {
        "source_sentence": "菩薩摩訶薩當於佛十力空行菩薩行，當於四無所畏、四無礙解、十八佛不共法空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva's practice of emptiness in terms of the Buddha's ten powers, and he will perform the bodhisattva's practice of emptiness in terms of the four fearlessnesses, four unhindered understandings, and 18 distinctive qualities of the Buddha.",
        "source": "T06n0220_365:0883b14_0"
    },
    {
        "source_sentence": "菩薩摩訶薩當於大慈空行菩薩行，當於大悲、大喜、大捨空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should practice the bodhisattva's practice of great kindness in emptiness, and he should practice the bodhisattva's practice of great compassion, great joy, and great equanimity in emptiness.",
        "source": "T06n0220_365:0883b16_1"
    },
    {
        "source_sentence": "菩薩摩訶薩當於五眼空行菩薩行，當於六神通空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice of emptiness in the five eyes, and he should perform the bodhisattva's practice of emptiness in the six supernormal powers.",
        "source": "T06n0220_365:0883b17_2"
    },
    {
        "source_sentence": "菩薩摩訶薩當於一切三摩地門空行菩薩行，當於一切陀羅尼門空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice of emptiness in all the samādhi approaches, and he should perform the bodhisattva's practice of emptiness in all the dhāraṇī approaches.",
        "source": "T06n0220_365:0883b19_3"
    },
    {
        "source_sentence": "菩薩摩訶薩當於嚴淨佛土空行菩薩行，當於成熟有情空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should practice the bodhisattva's practice of emptiness in the adorned and pure Buddha land, and he should practice the bodhisattva's practice of emptiness in the ripening of sentient beings.",
        "source": "T06n0220_365:0883b20_4"
    },
    {
        "source_sentence": "菩薩摩訶薩當於引發辯才陀羅尼空行菩薩行，當於引發文字陀羅尼空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva practice of inducing the emptiness of the dhāraṇī of eloquence, and he'll perform the bodhisattva practice of inducing the emptiness of the words dhāraṇī.",
        "source": "T06n0220_365:0883b22_5"
    },
    {
        "source_sentence": "菩薩摩訶薩當於悟入文字陀羅尼空行菩薩行，當於悟入無文字陀羅尼空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva should perform the bodhisattva's practice of enlightenment and enter the emptiness of words in the dhāraṇī, and he should perform the bodhisattva's practice of enlightenment and enter the emptiness of wordsless dhāraṇī.",
        "source": "T06n0220_365:0883b24_6"
    },
    {
        "source_sentence": "菩薩摩訶薩當於有為界空行菩薩行，當於無為界空行菩薩行。",
        "translation": "The bodhisattva Mahāsattva will perform the bodhisattva's practice of emptiness in the realm of existence and the bodhisattva's practice of emptiness in the realm of nonexistence.",
        "source": "T06n0220_365:0883b26_7"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行菩薩行時，如佛無上正等菩提，於諸法中不作二相。",
        "translation": "When bodhisattvas and mahāsattvas thus perform bodhisattva actions, they're like the Buddha's unsurpassed perfect enlightenment, which doesn't create two characteristics in dharmas.",
        "source": "T06n0220_365:0883b27_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0883b29_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是行般若波羅蜜多時，名為無上正等菩提行菩薩行。」",
        "translation": "If a bodhisattva-mahāsattva thus practices the perfection of wisdom, it's called the bodhisattva practice of unsurpassed perfect enlightenment.",
        "source": "T06n0220_365:0883b29_10"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0883c02_11"
    },
    {
        "source_sentence": "如來常說佛陀，佛陀以何義故名為佛陀？」",
        "translation": "The Tathāgata always teaches buddhahood, but what does it mean to call it buddha?",
        "source": "T06n0220_365:0883c03_12"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0883c04_0"
    },
    {
        "source_sentence": "隨覺實義，故名佛陀。",
        "translation": "Because it follows the true meaning of awakening, it's called a buddha.",
        "source": "T06n0220_365:0883c04_1"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c04_2"
    },
    {
        "source_sentence": "現覺實法，故名佛陀。",
        "translation": "Because they now perceive the true teaching, they're called buddhas.",
        "source": "T06n0220_365:0883c05_0"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c05_1"
    },
    {
        "source_sentence": "通達實義，故名佛陀。",
        "translation": "Because they comprehend the true meaning, they're called buddhas.",
        "source": "T06n0220_365:0883c05_2"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c06_3"
    },
    {
        "source_sentence": "於一切法如實現覺，故名佛陀。",
        "translation": "They are called buddhas because they perceive all dharmas as they really are.",
        "source": "T06n0220_365:0883c06_4"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c07_5"
    },
    {
        "source_sentence": "於一切法自相、共相、有相、無相，自然開覺，故名佛陀。",
        "translation": "Because they naturally awaken to the distinctive characteristics, shared characteristics, marks and marklessnesses of all dharmas, they're called buddhas.",
        "source": "T06n0220_365:0883c07_6"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c08_7"
    },
    {
        "source_sentence": "於三世法及無為法，一切種相無障智轉，故名佛陀。",
        "translation": "In the three worldly dharmas and unconditioned dharmas, all kinds of characteristics and nonobstructive cognition are developed, so they're called buddhas because they're called buddhas.",
        "source": "T06n0220_365:0883c08_8"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c10_9"
    },
    {
        "source_sentence": "如實開覺一切有情，令離顛倒惡業眾苦，故名佛陀。",
        "translation": "They are called buddhas because they truly awaken all sentient beings and cause them to be freed from the suffering of mistaken bad actions.",
        "source": "T06n0220_365:0883c10_10"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c11_11"
    },
    {
        "source_sentence": "能如實覺一切法相，所謂無相，故名佛陀。」",
        "translation": "They can truly perceive all the characteristics of dharmas, which are called formless, so they're called buddhas.",
        "source": "T06n0220_365:0883c11_12"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0883c13_0"
    },
    {
        "source_sentence": "如來常說菩提，菩提以何義故名為菩提？」",
        "translation": "The Tathāgata always explains enlightenment, but what is the meaning of enlightenment and why is it called enlightenment?",
        "source": "T06n0220_365:0883c13_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0883c14_2"
    },
    {
        "source_sentence": "證法空義是菩提義，證真如義是菩提義，證實際義是菩提義，證法性義是菩提義，",
        "translation": "To realize the meaning of emptiness of things is the meaning of enlightenment, to realize the meaning of true reality is the meaning of enlightenment, to realize the meaning of reality is the meaning of enlightenment, and to realize the meaning of the essence of things is the meaning of enlightenment.",
        "source": "T06n0220_365:0883c14_3"
    },
    {
        "source_sentence": "證法界義是菩提義。",
        "translation": "To realize the meaning of the Dharma realm is the meaning of enlightenment.",
        "source": "T06n0220_365:0883c16_4"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c17_5"
    },
    {
        "source_sentence": "假立名相，施設言說，能真實覺，最上勝妙，故名菩提。",
        "translation": "It is called enlightenment because it nominally establishes names and characteristics, identifies words and explanations, and can truly awaken with the utmost sublimity.",
        "source": "T06n0220_365:0883c17_6"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c18_7"
    },
    {
        "source_sentence": "不可破壞，不可分別，故名菩提。",
        "translation": "Because it cannot be broken down and cannot be discriminated, it's called enlightenment.",
        "source": "T06n0220_365:0883c18_8"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c19_9"
    },
    {
        "source_sentence": "法真如性、不虛妄性、不變異性、無顛倒性，故名菩提。",
        "translation": "The true nature of dharmas, the nature that's not false, the unchanging and dissimilar nature, and the absence of mistakenness are therefore called enlightenment.",
        "source": "T06n0220_365:0883c19_10"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c21_11"
    },
    {
        "source_sentence": "唯假名相謂為菩提，而無真實名相可得，故名菩提。",
        "translation": "Only nominal names and characteristics are called enlightenment, but there are no real names and characteristics that can be obtained, so it's called enlightenment.",
        "source": "T06n0220_365:0883c21_12"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c22_13"
    },
    {
        "source_sentence": "諸佛所有真淨妙覺，故名菩提。",
        "translation": "Because the buddhas possess true, pure, and marvelous awakening, it's called enlightenment.",
        "source": "T06n0220_365:0883c22_14"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T06n0220_365:0883c23_15"
    },
    {
        "source_sentence": "諸佛由此現覺諸法一切種相，故名菩提。」",
        "translation": "Because the buddhas now perceive all kinds of characteristics of dharmas, they're called enlightenment.",
        "source": "T06n0220_365:0883c23_16"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0883c25_0"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，行布施、淨戒、安忍、精進、靜慮、般若波羅蜜多時，",
        "translation": "“When great enlightening beings practice generosity, pure morality, patience, effort, meditation, and transcendent wisdom for the sake of enlightenment,",
        "source": "T06n0220_365:0883c25_1"
    },
    {
        "source_sentence": "於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "What are the things that benefit and harm, increase and decrease, arise and cease, and become defiled and pure?",
        "source": "T06n0220_365:0883c27_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0883c28_3"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，住內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空時，",
        "translation": "For the sake of enlightenment, the bodhisattva Mahāsattva abides in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of",
        "source": "T06n0220_365:0883c28_4"
    },
    {
        "source_sentence": "於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "What are the things that benefit and harm, increase and decrease, arise and cease, and become defiled and pure?",
        "source": "T06n0220_365:0884a03_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a04_6"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，住真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界時，",
        "translation": "“The great enlightening beings, for the sake of enlightenment, abide in suchness, in the realm of reality, in the realm of reality, in the nature of reality, in the nature of reality, in non-falsity, in unchanging and dissimilar nature, in equanimity, in freedom from birth, in legality, in the abode of",
        "source": "T06n0220_365:0884a04_7"
    },
    {
        "source_sentence": "於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "What are the things that benefit and harm, increase and decrease, arise and cease, and become defiled and pure?",
        "source": "T06n0220_365:0884a07_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a08_9"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支時，",
        "translation": "“When great enlightening beings cultivate the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path for the sake of enlightenment,",
        "source": "T06n0220_365:0884a08_10"
    },
    {
        "source_sentence": "於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "What are the things that benefit and harm, increase and decrease, arise and cease, and become defiled and pure?",
        "source": "T06n0220_365:0884a10_11"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a11_12"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，住苦聖諦、集、滅、道聖諦時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "When the bodhisattva Mahāsattva abides in the noble truth of suffering, the noble truths of arising, cessation, and the path for the sake of enlightenment, what things are gained or lost, increased or decreased, produced or ceased, defiled or pure?",
        "source": "T06n0220_365:0884a11_13"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a14_14"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修四靜慮、四無量、四無色定時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "When bodhisattvas and mahāsattvas cultivate the four meditations, the four immeasurable concentrations, and the four formless concentrations for the sake of enlightenment, what things are gained or lost, increased or decreased, produced or ceased, defiled or pure?",
        "source": "T06n0220_365:0884a14_15"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a16_16"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修八解脫、八勝處、九次第定、十遍處時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "When bodhisattvas and mahāsattvas cultivate the eight liberations, the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes for the sake of enlightenment, what things are gained or lost, increased or decreased, produced or ceased, defiled or pure?",
        "source": "T06n0220_365:0884a16_17"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a19_18"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修三摩地門、陀羅尼門時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "When the bodhisattva Mahāsattva cultivates the approach of samādhi and the approach of dhāraṇī for the sake of enlightenment, what things are gained or lost, increased or decreased, produced or ceased, defiled or pure?",
        "source": "T06n0220_365:0884a19_19"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a21_20"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修空解脫門、無相、無願解脫門時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "When the bodhisattva Mahāsattva cultivates the liberation gate of emptiness, the liberation gate of signlessness, and the liberation gate of wishlessness for the sake of enlightenment, what things are gained or lost, increased or decreased, produced or ceased, defiled or pure?",
        "source": "T06n0220_365:0884a21_21"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a24_22"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修五眼、六神通時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "When the bodhisattva Mahāsattva cultivates the five eyes and six supernormal powers for the sake of enlightenment, what things are gained or lost, increased or decreased, produced or ceased, defiled or pure?",
        "source": "T06n0220_365:0884a24_23"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a26_24"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修佛十力、四無所畏、四無礙解、十八佛不共法時，",
        "translation": "“When great enlightening beings cultivate the ten powers, four fearlessnesses, four unhindered understandings, and eighteen unique qualities of buddhas for the sake of enlightenment,",
        "source": "T06n0220_365:0884a26_25"
    },
    {
        "source_sentence": "於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "What are the things that benefit and harm, increase and decrease, arise and cease, and become defiled and pure?",
        "source": "T06n0220_365:0884a28_26"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884a29_27"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修大慈、大悲、大喜、大捨時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "“When great enlightening beings cultivate great benevolence, great compassion, great joy, great joy, and great equanimity for the sake of enlightenment, what things are gained or lost, increased or diminished, produced or destroyed, defiled or pure?",
        "source": "T06n0220_365:0884a29_28"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884b02_29"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修無忘失法、恒住捨性時，於何等法為益為損、為增為減、為生為滅、為染為淨？",
        "translation": "When bodhisattvas and mahāsattvas cultivate the principle of nonforgetfulness for the sake of enlightenment and constantly abide in the nature of equanimity, what things are gained or lost, increased or decreased, produced or ceased, defiled or pure?",
        "source": "T06n0220_365:0884b02_30"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_365:0884b05_31"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修一切智、道相智、一切相智時，於何等法為益為損、為增為減、為生為滅、為染為淨？」",
        "translation": "When bodhisattvas and mahāsattvas cultivate omniscience, knowledge of the path, knowledge of all characteristics, and knowledge of all characteristics for the sake of enlightenment, what are the things that benefit and harm, increase and decrease, arise and cease, and become defiled and pure?",
        "source": "T06n0220_365:0884b05_32"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_365:0884b07_33"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，行布施、淨戒、安忍、精進、靜慮、般若波羅蜜多時，",
        "translation": "“When great enlightening beings practice generosity, pure morality, patience, effort, meditation, and transcendent wisdom for the sake of enlightenment,",
        "source": "T06n0220_365:0884b08_34"
    },
    {
        "source_sentence": "於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "In all things, there's no gain or loss, no increase or decrease, no arising or ceasing, and no defilement or purity.",
        "source": "T06n0220_365:0884b09_35"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884b10_36"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，住內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空時，",
        "translation": "For the sake of enlightenment, the bodhisattva Mahāsattva abides in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of",
        "source": "T06n0220_365:0884b10_37"
    },
    {
        "source_sentence": "於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "In all things, there's no gain or loss, no increase or decrease, no arising or ceasing, and no defilement or purity.",
        "source": "T06n0220_365:0884b15_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884b16_1"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，住真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界時，",
        "translation": "“The great enlightening beings, for the sake of enlightenment, abide in suchness, in the realm of reality, in the realm of reality, in the nature of reality, in the nature of reality, in non-falsity, in unchanging and dissimilar nature, in equanimity, in freedom from birth, in legality, in the abode of",
        "source": "T06n0220_365:0884b16_2"
    },
    {
        "source_sentence": "於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "In all things, there's no gain or loss, no increase or decrease, no arising or ceasing, and no defilement or purity.",
        "source": "T06n0220_365:0884b18_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884b19_4"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支時，",
        "translation": "“When great enlightening beings cultivate the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path for the sake of enlightenment,",
        "source": "T06n0220_365:0884b20_5"
    },
    {
        "source_sentence": "於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "In all things, there's no gain or loss, no increase or decrease, no arising or ceasing, and no defilement or purity.",
        "source": "T06n0220_365:0884b21_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884b23_7"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，住苦聖諦、集、滅、道聖諦時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When the bodhisattva Mahāsattva abides in the noble truths of suffering, arising, cessation, and the path for the sake of enlightenment, all things are neither benefited nor harmed, neither increased nor diminished, neither produced nor ceased, and neither defiled nor pure.",
        "source": "T06n0220_365:0884b23_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884b25_9"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修四靜慮、四無量、四無色定時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the four meditations, the four immeasurable concentrations, and the four formless concentrations for the sake of enlightenment, all things are neither beneficial nor harmful, neither increase nor decrease, neither produced nor ceased, and neither defiled nor pure.",
        "source": "T06n0220_365:0884b25_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884b28_11"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修八解脫、八勝處、九次第定、十遍處時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When the bodhisattva Mahāsattva cultivates the eight liberations, the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes for the sake of enlightenment, all things are neither benefited nor harmed, neither increased nor diminished, neither produced nor ceased, and neither defiled nor pure.",
        "source": "T06n0220_365:0884b28_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884c01_13"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修三摩地門、陀羅尼門時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When the bodhisattva Mahāsattva cultivates the approach of samādhi and the approach of dhāraṇī for the sake of enlightenment, all things are neither beneficial nor harmful, neither increasing nor decreasing, neither arising nor ceasing, and neither defiled nor pure.",
        "source": "T06n0220_365:0884c01_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884c04_15"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修空解脫門、無相、無願解脫門時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When the bodhisattva Mahāsattva cultivates the liberation gate of emptiness, the liberation gate of signlessness, and the liberation gate of wishlessness for the sake of enlightenment, all things are neither benefited nor harmed, neither increased nor diminished, neither produced nor ceased, and neither defiled nor pure.",
        "source": "T06n0220_365:0884c04_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884c06_17"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修五眼、六神通時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When the bodhisattva Mahāsattva cultivates the five eyes and six supernormal powers for the sake of enlightenment, all things are neither beneficial nor harmful, neither increase nor decrease, neither produced nor ceased, and neither defiled nor pure.",
        "source": "T06n0220_365:0884c06_18"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884c09_19"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修佛十力、四無所畏、四無礙解、十八佛不共法時，",
        "translation": "“When great enlightening beings cultivate the ten powers, four fearlessnesses, four unhindered understandings, and eighteen unique qualities of buddhas for the sake of enlightenment,",
        "source": "T06n0220_365:0884c09_20"
    },
    {
        "source_sentence": "於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "In all things, there's no gain or loss, no increase or decrease, no arising or ceasing, and no defilement or purity.",
        "source": "T06n0220_365:0884c10_21"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884c12_0"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修大慈、大悲、大喜、大捨時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When the bodhisattva Mahāsattva cultivates great kindness, great compassion, great pity, great joy, and great equanimity for the sake of enlightenment, all things are neither beneficial nor harmful, neither increase nor decrease, neither produced nor ceased, and neither defiled nor pure.",
        "source": "T06n0220_365:0884c12_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884c14_2"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修無忘失法、恒住捨性時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When the bodhisattva Mahāsattva cultivates the state of no forgetfulness and constantly abides in equanimity for the sake of enlightenment, all things are neither benefited nor harmed, neither increased nor diminished, neither produced nor ceased, and neither defiled nor pure.",
        "source": "T06n0220_365:0884c14_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_365:0884c16_4"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，修一切智、道相智、一切相智時，於一切法無益無損、無增無減、無生無滅、無染無淨。",
        "translation": "When bodhisattvas, mahāsattvas, cultivate omniscience, knowledge of the path and knowledge of all characteristics for the sake of enlightenment, they don't benefit or harm anything, neither increase nor decrease, neither arising nor ceasing, and neither defiled nor pure.",
        "source": "T06n0220_365:0884c16_5"
    },
    {
        "source_sentence": "「何以故？",
        "translation": "“Why is that?",
        "source": "T06n0220_365:0884c19_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_365:0884c19_7"
    },
    {
        "source_sentence": "菩薩摩訶薩為菩提故，行深般若波羅蜜多，於一切法都無所緣而為方便，",
        "translation": "“For the sake of enlightenment great enlightening beings practice the profound prajñāpāramitā, their skill in means having no perceptual object for all things.",
        "source": "T06n0220_365:0884c19_8"
    },
    {
        "source_sentence": "不為益損、不為增減、不為生滅、不為染淨現在前故。」",
        "translation": "It's because it doesn't benefit or harm, doesn't increase or decrease, doesn't arise or cease, and doesn't manifest defilement and purity.",
        "source": "T06n0220_365:0884c21_9"
    },
    {
        "source_sentence": "具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng said to the Buddha, Bhagavān!",
        "source": "T06n0220_365:0884c23_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩為菩提故，行深般若波羅蜜多，於一切法都無所緣而為方便，",
        "translation": "If a bodhisattva-mahāsattva practices the profound prajñāpāramitā for the sake of enlightenment, he does so skillfully without any object in all dharmas.",
        "source": "T06n0220_365:0884c23_1"
    },
    {
        "source_sentence": "不為益不為損、不為增不為減、不為生不為滅、不為染不為淨故現在前者，",
        "translation": "It is neither beneficial nor detrimental, neither increasing nor decreasing, neither arising nor ceasing, neither defiled nor pure.",
        "source": "T06n0220_365:0884c25_2"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受布施波羅蜜多，攝受淨戒、安忍、精進、靜慮、般若波羅蜜多？",
        "translation": "How does a bodhisattva-mahāsattva who practices the profound perfection of wisdom take in the perfection of generosity and the perfection of pure morality, patience, effort, meditation, and prajñāpāramitā?",
        "source": "T06n0220_365:0884c27_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受內空，攝受外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空？",
        "translation": "How does the bodhisattva Mahāsattva gather internal emptiness when he practices the profound prajñāpāramitā, which collects external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, infinite emptiness, dispersed emptiness,",
        "source": "T06n0220_365:0884c29_1"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受真如，攝受法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界？",
        "translation": "How does the bodhisattva Mahāsattva gather true reality when he practices the profound prajñāpāramitā, which collects the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, space realm, and inconceivable realms?",
        "source": "T06n0220_365:0885a04_2"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受四念住，攝受四正斷、四神足、五根、五力、七等覺支、八聖道支？",
        "translation": "How does the bodhisattva Mahāsattva receive the four abodes of mindfulness when he practices the profound prajñāpāramitā, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path?",
        "source": "T06n0220_365:0885a08_3"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受苦聖諦，攝受集、滅、道聖諦？",
        "translation": "How does the bodhisattva Mahāsattva receive the noble truth of suffering and the noble truths of accumulation, cessation, and the path when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a10_4"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受四靜慮，攝受四無量、四無色定？",
        "translation": "How does the bodhisattva Mahāsattva gather the four meditations and the four immeasurable and four formless concentrations when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a12_5"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受八解脫，攝受八勝處、九次第定、十遍處？",
        "translation": "How does the bodhisattva Mahāsattva receive the eight liberations, the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a13_6"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受三摩地門，攝受陀羅尼門？",
        "translation": "How does the bodhisattva Mahāsattva gather the approach of samādhi and the approach of dhāraṇī when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a15_7"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受空解脫門，攝受無相、無願解脫門？",
        "translation": "How does the bodhisattva Mahāsattva receive the liberation gate of emptiness and the liberation gate of signlessness and wishlessness when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a17_8"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受五眼，攝受六神通？",
        "translation": "How does a bodhisattva Mahāsattva gather the five eyes and six supernormal powers when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a19_9"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受佛十力，攝受四無所畏、四無礙解、十八佛不共法？",
        "translation": "How does the bodhisattva Mahāsattva gather the Buddha's ten powers, four fearlessnesses, four unhindered understandings, and 18 unique qualities of the Buddha when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a20_10"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受大慈，攝受大悲、大喜、大捨？",
        "translation": "How does the bodhisattva Mahāsattva gather great kindness, great compassion, great joy, and great equanimity when he practices the profound prajñāpāramitā?",
        "source": "T06n0220_365:0885a23_11"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受無忘失法，攝受恒住捨性？",
        "translation": "How does the bodhisattva Mahāsattva take in the principle of no forgetfulness when he practices the profound prajñāpāramitā and takes in the nature of constantly abiding equanimity?",
        "source": "T06n0220_365:0885a24_12"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，攝受一切智，攝受道相智、一切相智？",
        "translation": "How does the bodhisattva Mahāsattva gather in omniscience when he practices the profound prajñāpāramitā, and how does he gather in knowledge of the path and knowledge of all characteristics?",
        "source": "T06n0220_365:0885a26_13"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，超諸聲聞及獨覺地，趣入菩薩正性離生，",
        "translation": "“How does great enlightening beings practice the profound prajñāpāramitā, transcending the stages of śrāvakas and pratyekbuddhas and entering the true essence of enlightening beings’ bodhisattvahood free from birth?",
        "source": "T06n0220_365:0885a28_14"
    },
    {
        "source_sentence": "修行菩薩十地正行，證得無上正等菩提？」",
        "translation": "He cultivates the bodhisattva's ten stages of correct practice and realizes unsurpassed perfect enlightenment?",
        "source": "T06n0220_365:0885b01_15"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百六十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 35",
        "source": "T06n0220_365:0885b03_0"
    }
]