[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 6",
        "source": "T06n0220_306:0557b25_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_306:0557b27_0"
    },
    {
        "source_sentence": "初分佛母品第四十一之二",
        "translation": "The Forty-first and Second Parts of the Chapter on the mother of the Buddha in the First Part",
        "source": "T06n0220_306:0557b28_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_306:0557b29_0"
    },
    {
        "source_sentence": "一切如來、應、正等覺依甚深般若波羅蜜多，如實知色，如實知受、想、行、識。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know form and truly know feeling, perception, volition, and consciousness.",
        "source": "T06n0220_306:0557b29_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0557c01_2"
    },
    {
        "source_sentence": "云何如來、應、正等覺如實知色，如實知受、想、行、識？」",
        "translation": "How do the Tathāgata, Arhat, and Completely Awakened One truly know form and truly know feeling, perception, volition, and consciousness?",
        "source": "T06n0220_306:0557c02_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0557c03_1"
    },
    {
        "source_sentence": "一切如來、應、正等覺如實知色如真如、如法界、如法性，不虛妄、不變異、無分別、無相狀、無作用、無戲論、無所得，",
        "translation": "All tathāgatas, arhats, and fully awakened ones truly know form as it really is, the Dharma realm as it is, and the essence of the Dharma as it is, without falsehood, without change, without discrimination, without marks or shapes, without effect, without conceptual elaboration, without attainment.",
        "source": "T06n0220_306:0557c03_2"
    },
    {
        "source_sentence": "如實知受、想、行、識如真如、如法界、如法性，不虛妄、不變異、無分別、無相狀、無作用、無戲論、無所得。",
        "translation": "They truly know feeling, perception, volition, and consciousness as they really are, the Dharma realm as it is, and the Dharma nature as it is, without falsehood, without change, without discrimination, without marks or shapes, without effect, without conceptual elaboration, and without attainment.",
        "source": "T06n0220_306:0557c05_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0557c07_4"
    },
    {
        "source_sentence": "如是如來、應、正等覺依甚深般若波羅蜜多，如實知他諸有情類出沒屈申心、心所法，",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the minds and mental factors of other sentient beings as they arise and cease.",
        "source": "T06n0220_306:0557c07_5"
    },
    {
        "source_sentence": "亦如真如、如法界、如法性，不虛妄、不變異、無分別、無相狀、無作用、無戲論、無所得。",
        "translation": "It's also like the true nature, like the Dharma realm, and like the Dharma nature, which isn't false, doesn't change, has no discrimination, has no marks, has no function, has no conceptual elaboration, and has no attainment.",
        "source": "T06n0220_306:0557c09_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0557c11_7"
    },
    {
        "source_sentence": "諸有情類出沒屈申心、心所法真如即五蘊真如，五蘊真如即十二處真如，",
        "translation": "The true nature of the mind and mental factors that all sentient beings produce and flex their minds are the true nature of the five aggregates, and the true nature of the five aggregates is the true nature of the twelve places.",
        "source": "T06n0220_306:0557c11_8"
    },
    {
        "source_sentence": "十二處真如即十八界真如，十八界真如即六界真如，六界真如即十二緣起真如，",
        "translation": "The twelve abodes of truth are the true nature of the eighteen realms, the true nature of the eighteen realms is the true nature of the six realms, and the true nature of the six realms is the true nature of the twelve causal conditions.",
        "source": "T06n0220_306:0557c13_9"
    },
    {
        "source_sentence": "十二緣起真如即一切法真如，一切法真如即六波羅蜜多真如，六波羅蜜多真如即內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空真如，",
        "translation": "The twelve kinds of dependently-arisen true thusness are the true thusness of all dharmas, the true thusness of all dharmas are the true thusness of the six perfections, and the true thusness of the six perfections is the true thusness of internal emptiness, external emptiness, internal and external emptiness, emptiness",
        "source": "T06n0220_306:0557c15_10"
    },
    {
        "source_sentence": "內空乃至無性自性空真如即真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界真如，",
        "translation": "The true nature of internal emptiness up to the self-natured emptiness of emptiness as emptiness without nature is the true nature of reality, the Dharma realm, the Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, space realm, inconceivable realm,",
        "source": "T06n0220_306:0557c20_11"
    },
    {
        "source_sentence": "真如乃至不思議界真如即苦、集、滅、道聖諦真如，苦、集、滅、道聖諦真如即四念住真如，",
        "translation": "The true thusness up to the inconceivable realm is the true thusness of the noble truths of suffering, arising, cessation, and the path; the true thusness of suffering, arising, cessation, and the path is the true thusness of the four abodes of mindfulness.",
        "source": "T06n0220_306:0557c23_12"
    },
    {
        "source_sentence": "四念住真如即四正斷真如，四正斷真如即四神足真如，四神足真如即五根真如，",
        "translation": "The four abodes of mindfulness are the four true forms of right ascertainment, the four true forms of right ascertainment are the four miraculous forms of concentration, and the four miraculous forms of concentration are the five faculties.",
        "source": "T06n0220_306:0557c25_13"
    },
    {
        "source_sentence": "五根真如即五力真如，五力真如即七等覺支真如，七等覺支真如即八聖道支真如，",
        "translation": "The five faculties as such are the five powers as such. The five powers as such are the seven factors of virtual enlightenment as such. The seven factors of virtual enlightenment as such are the eight noble factors of the path as such.",
        "source": "T06n0220_306:0557c27_14"
    },
    {
        "source_sentence": "八聖道支真如即四靜慮真如，四靜慮真如即四無量真如，四無量真如即四無色定真如，",
        "translation": "The eightfold noble path-支真如即四靜慮真如,四靜慮真如即四無量真如,四無量真如即四色定真如,",
        "source": "T06n0220_306:0557c29_15"
    },
    {
        "source_sentence": "四無色定真如即八解脫真如，八解脫真如即八勝處真如，八勝處真如即九次第定真如，",
        "translation": "The four formless concentrations are the true thusness of the eight liberations; the true thusness of the eight liberations is the true thusness of the eight spheres of mastery; the true thusness of the eight spheres of mastery is the true thusness of the nine graduated concentrations.",
        "source": "T06n0220_306:0558a02_16"
    },
    {
        "source_sentence": "九次第定真如即十遍處真如，十遍處真如即三解脫門真如，三解脫門真如即菩薩十地真如，",
        "translation": "The nine graduated concentrations are the ten pervasive truths, the ten pervasive truths are the three doors of liberation, and the three doors of liberation are the ten bodhisattva-stage truths.",
        "source": "T06n0220_306:0558a04_17"
    },
    {
        "source_sentence": "菩薩十地真如即五眼真如，五眼真如即六神通真如，六神通真如即一切陀羅尼門真如，",
        "translation": "“The ten stages of enlightening beings’ true thusness in the ten stages are the five-eyed true thusness; the five-eyed true thusness is the true thusness of the six supernormal powers; the six-powerful true thusness is the true thusness of all dhāraṇī teachings.",
        "source": "T06n0220_306:0558a06_18"
    },
    {
        "source_sentence": "一切陀羅尼門真如即一切三摩地門真如，一切三摩地門真如即佛十力真如，",
        "translation": "The true nature of all dhāraṇī aspects is the true nature of all samādhi aspects, and the true nature of all samādhi aspects is the true nature of the Buddha’s ten powers.",
        "source": "T06n0220_306:0558a08_19"
    },
    {
        "source_sentence": "佛十力真如即四無所畏真如，四無所畏真如即四無礙解真如，四無礙解真如即大慈、大悲、大喜、大捨真如，",
        "translation": "The ten powers of buddhas are the four fearless truths. The four fearless truths are the four unhindered understandings. The four unhindered understandings are great compassion, great compassion, great joy, and great equanimity.",
        "source": "T06n0220_306:0558a10_20"
    },
    {
        "source_sentence": "大慈、大悲、大喜、大捨真如即十八佛不共法真如，十八佛不共法真如即無忘失法真如，",
        "translation": "The true nature of great kindness, great compassion, great pity, great joy, and great equanimity is the true nature of the unique qualities of the eighteen buddhas, and the true nature of the unique qualities of the eighteen buddhas is the true nature of the Dharma without forgetfulness.",
        "source": "T06n0220_306:0558a12_21"
    },
    {
        "source_sentence": "無忘失法真如即恒住捨性真如，恒住捨性真如即一切智真如，一切智真如即道相智真如，",
        "translation": "The true nature of nonforgetfulness is the eternally abiding equanimity, the eternally abiding equanimity is the true nature of omniscience, and the true nature of omniscience is the true nature of knowledge of the path.",
        "source": "T06n0220_306:0558a14_22"
    },
    {
        "source_sentence": "道相智真如即一切相智真如，一切相智真如即善法真如，善法真如即不善法真如，",
        "translation": "The true nature of knowledge of the path is the true nature of knowledge of all characteristics, the true nature of knowledge of all characteristics is the true nature of good qualities, and the true nature of good qualities is the true nature of bad qualities.",
        "source": "T06n0220_306:0558a16_23"
    },
    {
        "source_sentence": "不善法真如即無記法真如，無記法真如即世間法真如，世間法真如即出世間法真如，",
        "translation": "The true nature of unwholesome dharmas is the true nature of indeterminate dharmas, the true nature of indeterminate dharmas is the true nature of worldly dharmas, and the true nature of worldly dharmas is the true nature of transmundane dharmas.",
        "source": "T06n0220_306:0558a18_24"
    },
    {
        "source_sentence": "出世間法真如即有漏法真如，有漏法真如即無漏法真如，無漏法真如即有罪法真如，",
        "translation": "The true nature of transmundane dharmas is the true nature of contaminated dharmas, the true nature of contaminated dharmas is the true nature of uncontaminated dharmas, and the true nature of uncontaminated dharmas is the true nature of sinful dharmas.",
        "source": "T06n0220_306:0558a20_25"
    },
    {
        "source_sentence": "有罪法真如即無罪法真如，無罪法真如即雜染法真如，雜染法真如即清淨法真如，",
        "translation": "The true nature of sinful dharmas is the true nature of sinless dharmas, the true nature of sinless dharmas is the true nature of defiled dharmas, and the true nature of defiled dharmas is the true nature of pure dharmas.",
        "source": "T06n0220_306:0558a22_26"
    },
    {
        "source_sentence": "清淨法真如即過去法真如，過去法真如即未來法真如，未來法真如即現在法真如，",
        "translation": "The true nature of pure dharmas is the true nature of past dharmas; the true nature of past dharmas is the true nature of future dharmas; the true nature of future dharmas is the true nature of present dharmas.",
        "source": "T06n0220_306:0558a24_27"
    },
    {
        "source_sentence": "現在法真如即欲界法真如，欲界法真如即色界法真如，色界法真如即無色界法真如，",
        "translation": "The true nature of dharmas in the present is the true nature of dharmas in the realm of desire. The true nature of dharmas in the realm of desire is the true nature of dharmas in the realm of form. The true nature of dharmas in the realm of form is the true nature of dharmas in the formless realm.",
        "source": "T06n0220_306:0558a26_28"
    },
    {
        "source_sentence": "無色界法真如即有為法真如，有為法真如即無為法真如，無為法真如即預流果真如，",
        "translation": "The true nature of dharmas in the formless realm is the true nature of conditioned dharmas, the true nature of conditioned dharmas is the true nature of unconditioned dharmas, and the true nature of unconditioned dharmas is the true nature of the fruit of stream-entry.",
        "source": "T06n0220_306:0558a28_29"
    },
    {
        "source_sentence": "預流果真如即一來果真如，一來果真如即不還果真如，不還果真如即阿羅漢果真如，",
        "translation": "The true thusness of the fruit of stream-entry is the true thusness of the once-returning fruit, the true thusness of the once-returning fruit is the true thusness of the nonreturning fruit, and the true thusness of the nonreturning fruit is the true thusness of the arhat’s fruit.",
        "source": "T06n0220_306:0558b01_30"
    },
    {
        "source_sentence": "阿羅漢果真如即獨覺菩提真如，獨覺菩提真如即一切菩薩摩訶薩行真如，",
        "translation": "The true nature of arhatship is the true nature of self-realized enlightenment, and the true nature of self-realized enlightenment is the true nature of all bodhisattva-mahāsattva practices.",
        "source": "T06n0220_306:0558b03_31"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行真如即諸佛無上正等菩提真如，諸佛無上正等菩提真如即一切如來、應、正等覺真如，",
        "translation": "The practice of all bodhisattvas and mahāsattvas is the unexcelled true enlightenment of all buddhas, and the unexcelled true enlightenment of all buddhas is the true enlightenment of all buddhas.",
        "source": "T06n0220_306:0558b05_32"
    },
    {
        "source_sentence": "一切如來、應、正等覺真如即一切有情真如。",
        "translation": "The true nature of all tathāgatas, arhats, and fully awakened ones is the true nature of all sentient beings.",
        "source": "T06n0220_306:0558b07_33"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0558b08_34"
    },
    {
        "source_sentence": "若一切如來、應、正等覺真如，若一切有情真如，若一切法真如，無二、無別，",
        "translation": "If all tathāgatas, arhats, and fully enlightened ones are true, if all sentient beings are true, and if all dharmas are true, there are no two and no distinctions.",
        "source": "T06n0220_306:0558b08_35"
    },
    {
        "source_sentence": "是一真如。",
        "translation": "It's one true reality.",
        "source": "T06n0220_306:0558b10_36"
    },
    {
        "source_sentence": "如是真如無別異故，無壞、無盡，不可分別。",
        "translation": "Because such true thusness has no distinctions, it doesn't break down or end, and it can't be discriminated.",
        "source": "T06n0220_306:0558b10_37"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0558b11_38"
    },
    {
        "source_sentence": "一切如來、應、正等覺，依甚深般若波羅蜜多，證一切法真如究竟乃得無上正等菩提，",
        "translation": "All tathāgatas, arhats, and fully awakened ones rely on the profound prajñāpāramitā to realize the ultimate reality of all dharmas and then attain unsurpassed perfect enlightenment.",
        "source": "T06n0220_306:0558b11_39"
    },
    {
        "source_sentence": "由此故說甚深般若波羅蜜多能生諸佛，是諸佛母，能示諸佛世間實相。",
        "translation": "Because of this, it's said that the profound prajñāpāramitā can give birth to buddhas, which are the mothers of buddhas and can show the true characteristics of the buddhas in the world.",
        "source": "T06n0220_306:0558b13_40"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0558b15_41"
    },
    {
        "source_sentence": "如是如來、應、正等覺，依甚深般若波羅蜜多，如實覺一切法真如不虛妄、不變異。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly perceive all dharmas as they really are without falsehood or change.",
        "source": "T06n0220_306:0558b15_42"
    },
    {
        "source_sentence": "由如實覺真如相故，說名如來、應、正等覺。」",
        "translation": "Because they truly perceive the true characteristics of reality, they're called the Tathāgata, Arhat, and Completely Awakened One.",
        "source": "T06n0220_306:0558b17_43"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_306:0558b18_44"
    },
    {
        "source_sentence": "甚深般若波羅蜜多所證一切法真如不虛妄、不變異，極為甚深難見難覺。",
        "translation": "The profound prajñāpāramitā that realizes the true nature of all dharmas without falsehood or change is extremely profound and difficult to see and difficult to perceive.",
        "source": "T06n0220_306:0558b18_45"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0558b20_46"
    },
    {
        "source_sentence": "一切如來、應、正等覺，皆用一切法真如不虛妄、不變異，顯示分別諸佛無上正等菩提。",
        "translation": "All tathāgatas, arhats, and perfectly enlightened ones use the true nature of all dharmas that aren't false or unchanging to discern the unsurpassed perfect enlightenment of the buddhas.",
        "source": "T06n0220_306:0558b20_47"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0558b22_48"
    },
    {
        "source_sentence": "一切法真如甚深誰能信解？",
        "translation": "Who can believe and understand the profundity of the true nature of all dharmas?",
        "source": "T06n0220_306:0558b22_49"
    },
    {
        "source_sentence": "唯有不退位菩薩摩訶薩，及具足正見漏盡阿羅漢，聞佛說此甚深真如能生信解，",
        "translation": "“Only enlightening beings in the stage of nonregression, as well as arhats who are imbued with right insight and whose contaminants have been extinguished, can give rise to faith when they hear the Buddha’s discourse on this profound truth.",
        "source": "T06n0220_306:0558b23_50"
    },
    {
        "source_sentence": "如來為彼依自所證真如之相顯示分別。」",
        "translation": "The Tathāgata shows distinctions for them based on the characteristics of the true nature that they've realized.",
        "source": "T06n0220_306:0558b25_51"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_306:0558b26_52"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_306:0558b26_53"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_306:0558b26_54"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_306:0558b26_55"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_306:0558b26_56"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0558b27_57"
    },
    {
        "source_sentence": "真如無盡是故甚深。」",
        "translation": "The true nature is inexhaustible, so it's profound.",
        "source": "T06n0220_306:0558b27_58"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0558b27_59"
    },
    {
        "source_sentence": "何故真如無盡？」",
        "translation": "Why is the true nature inexhaustible?",
        "source": "T06n0220_306:0558b27_60"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0558b28_61"
    },
    {
        "source_sentence": "以一切法皆無盡故真如無盡。",
        "translation": "Because all dharmas are inexhaustible, the true nature is inexhaustible.",
        "source": "T06n0220_306:0558b28_62"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0558b29_63"
    },
    {
        "source_sentence": "一切如來、應、正等覺，證真如故獲得無上正等菩提，為諸有情顯示分別一切法真如相，",
        "translation": "All buddhas attain unexcelled perfect enlightenment because of their realization of true suchness. They show sentient beings the characteristics of reality of all things by analyzing and discriminating them.",
        "source": "T06n0220_306:0558b29_64"
    },
    {
        "source_sentence": "由此故名真實說者。」",
        "translation": "That's why it's called a true explanation.",
        "source": "T06n0220_306:0558c02_65"
    },
    {
        "source_sentence": "◎◎爾時，三千大千世界所有欲界、色界天子，各以種種天妙華香遙散供養，",
        "translation": "At the time, all the celestial beings in the desire realm and form realm in the 3,000 great one-thousand worlds each offered various kinds of heavenly flowers and incense from afar as offerings.",
        "source": "T06n0220_306:0558c02_66"
    },
    {
        "source_sentence": "來至佛所，頂禮雙足，却住一面，合掌恭敬，俱白佛言：「世尊！",
        "translation": "They came to the Buddha, bowed their heads at his feet, withdrew to one side, joined their palms in respect, and said to him, Bhagavān!",
        "source": "T06n0220_306:0558c04_67"
    },
    {
        "source_sentence": "所說甚深般若波羅蜜多，以何為相？」",
        "translation": "What's the characteristic of the profound prajñāpāramitā that's taught?",
        "source": "T06n0220_306:0558c05_68"
    },
    {
        "source_sentence": "爾時，佛告諸天子言：「天子當知！",
        "translation": "It was then that the Buddha addressed the celestial sons, saying, Celestial sons, you should know!",
        "source": "T06n0220_306:0558c06_69"
    },
    {
        "source_sentence": "甚深般若波羅蜜多以空為相，甚深般若波羅蜜多以無相為相，甚深般若波羅蜜多以無願為相，",
        "translation": "The profound prajñāpāramitā has emptiness as its mark, the profound prajñāpāramitā has signlessness as its mark, and the profound prajñāpāramitā has wishlessness as its mark.",
        "source": "T06n0220_306:0558c07_70"
    },
    {
        "source_sentence": "甚深般若波羅蜜多以無作為相，甚深般若波羅蜜多以無生無滅為相，甚深般若波羅蜜多以無染無淨為相，",
        "translation": "The profound prajñāpāramitā has the characteristic of noncontrivance as its aspect, the profound prajñāpāramitā has the characteristic of nonarising and noncessation as its aspect, and the profound prajñāpāramitā has the characteristic of neither defilement nor purity as its aspect.",
        "source": "T06n0220_306:0558c09_71"
    },
    {
        "source_sentence": "甚深般若波羅蜜多以無性為相，甚深般若波羅蜜多以無自性為相，甚深般若波羅蜜多以無性自性為相，",
        "translation": "The profound prajñāpāramitā takes the absence of nature as its characteristic, the profound prajñāpāramitā takes the absence of self-nature as its characteristic, and the profound prajñāpāramitā takes the absence of self-nature as its characteristic.",
        "source": "T06n0220_306:0558c12_72"
    },
    {
        "source_sentence": "甚深般若波羅蜜多以無所依止為相，甚深般若波羅蜜多以非斷非常為相，",
        "translation": "The profound prajñāpāramitā has no basis as its characteristic, and the profound prajñāpāramitā has neither cessation nor non-cessation as its characteristic.",
        "source": "T06n0220_306:0558c14_73"
    },
    {
        "source_sentence": "甚深般若波羅蜜多以非一非異為相，甚深般若波羅蜜多以無來無去為相，",
        "translation": "The profound prajñāpāramitā has neither unity nor difference as its characteristic, and the profound prajñāpāramitā has neither coming nor going as its characteristic.",
        "source": "T06n0220_306:0558c16_74"
    },
    {
        "source_sentence": "甚深般若波羅蜜多以虛空為相，甚深般若波羅蜜多有如是等無量諸相。",
        "translation": "The profound prajñāpāramitā takes space as its characteristic, and the profound prajñāpāramitā has such measureless characteristics.",
        "source": "T06n0220_306:0558c18_75"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0558c19_76"
    },
    {
        "source_sentence": "如是諸相，一切如來、應、正等覺依世俗說，不依勝義。",
        "translation": "All tathāgatas, arhats, and fully awakened ones rely on worldly explanations and not on ultimate truth.",
        "source": "T06n0220_306:0558c20_77"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0558c21_78"
    },
    {
        "source_sentence": "甚深般若波羅蜜多如是諸相，世間天、人、阿素洛等皆不能壞。",
        "translation": "Such are the characteristics of the profound prajñāpāramitā, which can't be destroyed by worldly gods, humans, or asuras.",
        "source": "T06n0220_306:0558c21_79"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_306:0558c22_80"
    },
    {
        "source_sentence": "世間天、人、阿素洛等亦是相故。",
        "translation": "The worldly gods, humans, asuras, and so forth are also characteristics.",
        "source": "T06n0220_306:0558c23_81"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0558c23_82"
    },
    {
        "source_sentence": "諸相不能破壞諸相，諸相不能了知諸相。",
        "translation": "The marks can't destroy the marks, and the marks can't know the marks.",
        "source": "T06n0220_306:0558c24_0"
    },
    {
        "source_sentence": "諸相不能破壞無相，諸相不能了知無相。",
        "translation": "The characteristics can't destroy the marklessness, and the characteristics can't comprehend the marklessness.",
        "source": "T06n0220_306:0558c24_1"
    },
    {
        "source_sentence": "無相不能破壞諸相，無相不能了知諸相。",
        "translation": "The absence of marks can't destroy marks, and the absence of marks can't know marks.",
        "source": "T06n0220_306:0558c25_2"
    },
    {
        "source_sentence": "無相不能破壞無相，無相不能了知無相。",
        "translation": "The absence of marks can't destroy the absence of marks, and the absence of marks can't know the absence of marks.",
        "source": "T06n0220_306:0558c26_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_306:0558c27_4"
    },
    {
        "source_sentence": "若相、若無相、若相無相皆無所有，能破、能知、所破、所知及破、知者不可得故。",
        "translation": "If marks, marklessness, marklessness, and marklessness all lack existence, it's because the refutation, knowing, what's refuted, knowables, and those who refute and knowables are unobtainable.",
        "source": "T06n0220_306:0558c27_5"
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0559a01_0"
    },
    {
        "source_sentence": "如是諸相非色所作，非受、想、行、識所作；",
        "translation": "These characteristics are not made by matter, and they are not made by feeling, perception, volition, or consciousness.",
        "source": "T06n0220_306:0559a01_1"
    },
    {
        "source_sentence": "非眼處所作，非耳、鼻、舌、身、意處所作；",
        "translation": "They are not what is made by the sphere of vision; they are not what is made by the spheres of the ear, nose, tongue, body and mind.",
        "source": "T06n0220_306:0559a02_2"
    },
    {
        "source_sentence": "非色處所作，非聲、香、味、觸、法處所作；",
        "translation": "They are not made in the sphere of form; they are not made in the spheres of sound, smell, taste, touch and dharma.",
        "source": "T06n0220_306:0559a02_3"
    },
    {
        "source_sentence": "非眼界所作，非色界、眼識界及眼觸、眼觸為緣所生諸受所作；",
        "translation": "They are not what is done by the element eye: they are not what is done by the element matter, by the element consciousness of the eye and by visual contact or by sensations that arise from visual contact as supporting object.",
        "source": "T06n0220_306:0559a03_4"
    },
    {
        "source_sentence": "非耳界所作，非聲界、耳識界及耳觸、耳觸為緣所生諸受所作；",
        "translation": "They are not what is done by the element ear. They are not what is done by the element sound, by the element ear and consciousness of the ear, or by the sensations that arise from ear contact and ear contact as supporting object.",
        "source": "T06n0220_306:0559a05_5"
    },
    {
        "source_sentence": "非鼻界所作，非香界、鼻識界及鼻觸、鼻觸為緣所生諸受所作；",
        "translation": "They are not what is done by the element nose; they are not what is done by the element odor, by the element nasal consciousness, or by the sensations that arise from nasal contact and nasal contact as supporting object.",
        "source": "T06n0220_306:0559a06_6"
    },
    {
        "source_sentence": "非舌界所作，非味界、舌識界及舌觸、舌觸為緣所生諸受所作；",
        "translation": "They are not what is done by the element tongue; they are not what is done by the element relishing, by the element tongue and by the consciousness of tongue, or by the sensations that arise from tongue contact and tongue contact as supporting object.",
        "source": "T06n0220_306:0559a08_7"
    },
    {
        "source_sentence": "非身界所作，非觸界、身識界及身觸、身觸為緣所生諸受所作；",
        "translation": "They are not what is done by the element body. They are not what is done by the element tangible, by the element body and consciousness of the body, or by bodily contact or bodily contact as supporting object; they are not what is done by the element tangible, by the element bodily tangible, or by sensations that arise from bodily contact as supporting object.",
        "source": "T06n0220_306:0559a09_8"
    },
    {
        "source_sentence": "非意界所作，非法界、意識界及意觸、意觸為緣所生諸受所作；",
        "translation": "They are not what is done by the mental realm: they are what is unmanifest in the realm of formlessness, what is manifesting in the realm of consciousness of the mind and what is manifesting in the realm of sexual passion; they are what is manifesting in the realm of manas.",
        "source": "T06n0220_306:0559a10_9"
    },
    {
        "source_sentence": "非地界所作，非水、火、風、空、識界所作；",
        "translation": "They are not made by the earth realm; they are not made by water, fire, wind, space, or consciousness realms.",
        "source": "T06n0220_306:0559a12_10"
    },
    {
        "source_sentence": "非無明所作，非行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱所作；",
        "translation": "They are not created by ignorance; they are not created by conditioning, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, grasping, existence, birth, old age, sorrow, pain, and vexation.",
        "source": "T06n0220_306:0559a13_11"
    },
    {
        "source_sentence": "非布施波羅蜜多所作，非淨戒、安忍、精進、靜慮、般若波羅蜜多所作；",
        "translation": "They are not made by the perfection of generosity; they are not made by the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_306:0559a14_12"
    },
    {
        "source_sentence": "非內空所作，非外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空所作；",
        "translation": "They are not created by internal emptiness; they are not created by external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of specific characteristics, emptiness of shared character",
        "source": "T06n0220_306:0559a16_13"
    },
    {
        "source_sentence": "非真如所作，非法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界所作；",
        "translation": "They are not created by the realm of reality; they are not made by the realm of non-truth, by the realm of dharmas, by the nature of things, by what is not false, by what is unchanging and dissimilar, by equality, by separation from beings, by legality, by the abode of phenomena, by reality, by space,",
        "source": "T06n0220_306:0559a20_0"
    },
    {
        "source_sentence": "非苦聖諦所作，非集、滅、道聖諦所作；",
        "translation": "They are not made by the noble truth of suffering; they are not made by the noble truths of origin, cessation and the path.",
        "source": "T06n0220_306:0559a22_1"
    },
    {
        "source_sentence": "非四靜慮所作，非四無量、四無色定所作；",
        "translation": "They are not done by the four forms of meditative absorption. They are not done by the four immeasurable and four formless concentrations.",
        "source": "T06n0220_306:0559a23_2"
    },
    {
        "source_sentence": "非八解脫所作，非八勝處、九次第定、十遍處所作；",
        "translation": "They are not made by the eight liberations; they are not made by the eight spheres of mastery, by the nine graduated concentrations and by the ten universals.",
        "source": "T06n0220_306:0559a24_0"
    },
    {
        "source_sentence": "非四念住所作，非四正斷、四神足、五根、五力、七等覺支、八聖道支所作；",
        "translation": "They are not made by the four foundations of mindfulness; they are not made by the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment and the eight noble factors of the path.",
        "source": "T06n0220_306:0559a25_1"
    },
    {
        "source_sentence": "非空解脫門所作，非無相、無願解脫門所作；",
        "translation": "They are not made by the liberation gate of emptiness, they are not made by the liberation gate of signlessness or wishlessness.",
        "source": "T06n0220_306:0559a26_2"
    },
    {
        "source_sentence": "非菩薩十地所作；",
        "translation": "They are not done by enlightening beings in the ten stages.",
        "source": "T06n0220_306:0559a27_3"
    },
    {
        "source_sentence": "非五眼所作，非六神通所作；",
        "translation": "They are not done by the five eyes; they are not done by the six supernormal powers.",
        "source": "T06n0220_306:0559a28_4"
    },
    {
        "source_sentence": "非佛十力所作，非四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法所作；",
        "translation": "They are not created by the ten powers of Buddha; they are not created by the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great equanimity, or any of the eighteen unique qualities of buddhahood.",
        "source": "T06n0220_306:0559a28_5"
    },
    {
        "source_sentence": "非無忘失法所作，非恒住捨性所作；",
        "translation": "They are not made by the state of nonforgetfulness, they are not made by the nature of constancy and equanimity.",
        "source": "T06n0220_306:0559b01_6"
    },
    {
        "source_sentence": "非一切智所作，非道相智、一切相智所作；",
        "translation": "They are not made by omniscience; they are not made by knowledge of the path or by knowledge of all characteristics.",
        "source": "T06n0220_306:0559b02_7"
    },
    {
        "source_sentence": "非一切陀羅尼門所作，非一切三摩地門所作；",
        "translation": "They are not made by the methods of all dhāraṇīs; they are not made by the methods of all concentrations.",
        "source": "T06n0220_306:0559b03_8"
    },
    {
        "source_sentence": "非預流果所作，非一來、不還、阿羅漢果所作；",
        "translation": "They are not made by the fruit of stream-winner; they are not made by the first-comer, by the one who does not return or by the fruit of arhatship.",
        "source": "T06n0220_306:0559b04_9"
    },
    {
        "source_sentence": "非獨覺菩提所作；",
        "translation": "They are not created by enlightenment of the self-enlightened ones.",
        "source": "T06n0220_306:0559b05_10"
    },
    {
        "source_sentence": "非一切菩薩摩訶薩行所作，非諸佛無上正等菩提所作。",
        "translation": "They aren't created by all the bodhisattva-mahāsattva practices, and they aren't created by the buddhas of unsurpassed perfect enlightenment.",
        "source": "T06n0220_306:0559b05_11"
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0559b08_0"
    },
    {
        "source_sentence": "如是諸相非天所作，非非天所作，非人所作，非非人所作，非有漏非無漏，",
        "translation": "These marks are not made by gods, not made by non-gods, not made by humans, not made by non-humans, neither impure nor pure.",
        "source": "T06n0220_306:0559b08_1"
    },
    {
        "source_sentence": "非世間非出世間，非有為非無為，無所繫屬不可宣說。",
        "translation": "They are neither mundane nor transmundane, neither conditioned nor unconditioned, and have no binding affiliation that can be explained.",
        "source": "T06n0220_306:0559b09_2"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0559b11_3"
    },
    {
        "source_sentence": "甚深般若波羅蜜多遠離眾相，不應致問甚深般若波羅蜜多以何為相。」",
        "translation": "The profound prajñāpāramitā is far removed from all marks, so you shouldn't ask what the profound prajñāpāramitā has as its mark.",
        "source": "T06n0220_306:0559b11_4"
    },
    {
        "source_sentence": "佛告諸天子：「於汝意云何？",
        "translation": "The Buddha told the celestial beings, What do you think?",
        "source": "T06n0220_306:0559b13_0"
    },
    {
        "source_sentence": "如有問言虛空何相，如是發問為正問不？」",
        "translation": "Suppose someone asks, What's the characteristic of space, and this is the right question to ask?",
        "source": "T06n0220_306:0559b13_1"
    },
    {
        "source_sentence": "諸天子曰：「不也！",
        "translation": "The celestial beings said, No!",
        "source": "T06n0220_306:0559b14_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0559b14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_306:0559b15_0"
    },
    {
        "source_sentence": "虛空無體、無相、無為，不應問故。」",
        "translation": "Space has no essence, no marks, and nothingness, so you shouldn't ask questions.",
        "source": "T06n0220_306:0559b15_1"
    },
    {
        "source_sentence": "佛告天子：「甚深般若波羅蜜多亦復如是，不應為問。",
        "translation": "The Buddha told the celestial being, So is the profound prajñāpāramitā, which shouldn't be asked.",
        "source": "T06n0220_306:0559b15_2"
    },
    {
        "source_sentence": "然諸法相，有佛無佛法界法爾，佛於此相如實現覺，故名如來。」",
        "translation": "However, the characteristics of dharmas are such that there's a buddha and no buddha in the Dharma realm of the Dharma realm, and the Buddha is called the Tathāgata because he apprehends these characteristics as they really are.",
        "source": "T06n0220_306:0559b17_3"
    },
    {
        "source_sentence": "時，諸天子復白佛言：「如來所覺如是諸相，極為甚深，難見難覺，如來現覺如是相故，",
        "translation": "The celestial beings then said to the Buddha: Such and such characteristics as those perceived by the Tathāgata are extremely profound, difficult to see and difficult to perceive.",
        "source": "T06n0220_306:0559b18_4"
    },
    {
        "source_sentence": "於一切法無礙智轉。",
        "translation": "In all dharmas, unobstructed cognition develops.",
        "source": "T06n0220_306:0559b20_5"
    },
    {
        "source_sentence": "一切如來、應、正等覺住如是相，分別開示甚深般若波羅蜜多，為諸有情集諸法相，",
        "translation": "All tathāgatas, arhats, and fully awakened ones who abide in such characteristics analyze and reveal the profound prajñāpāramitā to gather the characteristics of all dharmas for sentient beings.",
        "source": "T06n0220_306:0559b20_6"
    },
    {
        "source_sentence": "方便開示，令於般若波羅蜜多得無礙智。",
        "translation": "He skillfully reveals and causes them to attain unhindered knowledge of the perfection of wisdom.",
        "source": "T06n0220_306:0559b22_7"
    },
    {
        "source_sentence": "「希有！",
        "translation": "Rarely!",
        "source": "T06n0220_306:0559b23_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0559b23_9"
    },
    {
        "source_sentence": "甚深般若波羅蜜多是諸如來、應、正等覺常所行處，一切如來、應、正等覺行是處故證得無上正等菩提，",
        "translation": "The profound prajñāpāramitā is a place where the Tathāgatas, Arhats, and Fully Awakened Ones always practice, and all the Tathāgatas, Arhats, and Fully Awakened Ones practice this place to realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_306:0559b23_10"
    },
    {
        "source_sentence": "為諸有情分別開示一切法相，所謂分別開示色相，分別開示受、想、行、識相；",
        "translation": "To sentient beings they discriminate and show all characteristics of things. That is to say, they discriminate and show the characteristics of form and discriminate and show the characteristics of feeling, perception, volition, and consciousness.",
        "source": "T06n0220_306:0559b26_11"
    },
    {
        "source_sentence": "分別開示眼處相，分別開示耳、鼻、舌、身、意處相；",
        "translation": "Discriminating they show the characteristics of the sphere of vision, and discriminating they show the characteristics of the spheres of hearing, smell, taste, touch, body, and thought.",
        "source": "T06n0220_306:0559b27_12"
    },
    {
        "source_sentence": "分別開示色處相，分別開示聲、香、味、觸、法處相；",
        "translation": "They discriminate and show the characteristics of the sphere of form, and they discriminate and show the characteristics of the sphere of sound, odor, taste, touch, and phenomena.",
        "source": "T06n0220_306:0559b28_13"
    },
    {
        "source_sentence": "分別開示眼界相，分別開示色界、眼識界及眼觸、眼觸為緣所生諸受相；",
        "translation": "They discriminate and show the characteristics of the eye realm. They discriminate and show the characteristics of the form realm, the eye consciousness realm, and the characteristics of sensation that arise from eye contact and eye contact as supporting conditions.",
        "source": "T06n0220_306:0559b29_14"
    },
    {
        "source_sentence": "分別開示耳界相，分別開示聲界、耳識界及耳觸、耳觸為緣所生諸受相；",
        "translation": "They discriminate and show the characteristics of the ear realm. They discriminate and show the characteristics of the sound realm, the ear consciousness realm, and the characteristics of sensation that arise from ear contact and ear contact as supporting conditions.",
        "source": "T06n0220_306:0559c02_15"
    },
    {
        "source_sentence": "分別開示鼻界相，分別開示香界、鼻識界及鼻觸、鼻觸為緣所生諸受相；",
        "translation": "They discriminate and show the characteristics of the sense element nose. They discriminate and show the characteristics of the sense element odor, the sense element nasal consciousness, and the characteristics of sensation that arise from nasal contact and nasal contact as supporting conditions.",
        "source": "T06n0220_306:0559c04_16"
    },
    {
        "source_sentence": "分別開示舌界相，分別開示味界、舌識界及舌觸、舌觸為緣所生諸受相；",
        "translation": "They discriminate and show the characteristics of the tongue realm. They discriminate and show the characteristics of the taste realm, the tongue-consciousness realm, and the characteristics of the sensations that arise from tongue contact and tongue contact as supporting conditions.",
        "source": "T06n0220_306:0559c05_17"
    },
    {
        "source_sentence": "分別開示身界相，分別開示觸界、身識界及身觸、身觸為緣所生諸受相；",
        "translation": "They analyze and show the characteristics of the body realm. They analyze and show the characteristics of the contact realm, the body-consciousness realm, and the sensations that arise from bodily contact and bodily contact as supporting conditions.",
        "source": "T06n0220_306:0559c07_18"
    },
    {
        "source_sentence": "分別開示意界相，分別開示法界、意識界及意觸、意觸為緣所生諸受相；",
        "translation": "They discriminate and show the characteristics of the mental realm. They discriminate and show the characteristics of the realm of reality, the realm of mental consciousness, and the characteristics of feeling that arise from mental contact and mental contact as supporting conditions.",
        "source": "T06n0220_306:0559c09_19"
    },
    {
        "source_sentence": "分別開示地界相，分別開示水、火、風、空、識界相；",
        "translation": "They discriminate and show the characteristics of the earth realm, and they discriminate and show the characteristics of water, fire, wind, space, and consciousness realms.",
        "source": "T06n0220_306:0559c10_20"
    },
    {
        "source_sentence": "分別開示無明相，分別開示行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱相；",
        "translation": "They discriminate and show the signs of nescience. They discriminate and show the signs of volition, consciousness, name-and-form, the six sense-fields, touch, sensation, thirst, craving, grasping, existence, birth, old age, sorrow, pain, vexation, suffering, and distress.",
        "source": "T06n0220_306:0559c11_21"
    },
    {
        "source_sentence": "分別開示布施波羅蜜多相，分別開示淨戒、安忍、精進、靜慮、般若波羅蜜多相；",
        "translation": "They discerned and revealed the many characteristics of the perfection of giving, and discerned and revealed the many characteristics of pure morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_306:0559c13_22"
    },
    {
        "source_sentence": "分別開示內空相，分別開示外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空相；",
        "translation": "They analyze and show the characteristics of internal emptiness, analyzing and showing external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature, emp",
        "source": "T06n0220_306:0559c15_23"
    },
    {
        "source_sentence": "分別開示真如相，分別開示法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界相；",
        "translation": "They analyze and show the characteristics of true reality. They analyze and show the characteristics of the realm of reality, the essence of reality, non-falsity, unchangingness, dissimilarity, equality, freedom from arising, lawfulness, the abode of truth, reality, space, and inconceivable realms.",
        "source": "T06n0220_306:0559c19_24"
    },
    {
        "source_sentence": "分別開示苦聖諦相，分別開示集、滅、道聖諦相；",
        "translation": "They discriminate and show the characteristics of the noble truth of suffering, and they discriminate and show the characteristics of the noble truths of origin, cessation, and the path.",
        "source": "T06n0220_306:0559c21_25"
    },
    {
        "source_sentence": "分別開示四靜慮相，分別開示四無量、四無色定相；",
        "translation": "They discriminate and show the characteristics of the four forms of meditation. They discriminate and show the characteristics of the four immeasurable concentrations and the four formless concentrations.",
        "source": "T06n0220_306:0559c22_26"
    },
    {
        "source_sentence": "分別開示八解脫相，分別開示八勝處、九次第定、十遍處相；",
        "translation": "They discriminate and show the characteristics of the eight liberations. They discriminate and show the characteristics of the eight spheres of mastery, the nine graduated concentrations, and the ten universals.",
        "source": "T06n0220_306:0559c23_27"
    },
    {
        "source_sentence": "分別開示四念住相，分別開示四正斷、四神足、五根、五力、七等覺支、八聖道支相；",
        "translation": "They discriminate and show the characteristics of the four abodes of mindfulness. They discriminate and show the characteristics of the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_306:0559c25_28"
    },
    {
        "source_sentence": "分別開示空解脫門相，分別開示無相、無願解脫門相；",
        "translation": "They discriminate and show the aspects of liberation through emptiness, and they discriminate and show the aspects of liberation through signlessness and wishlessness.",
        "source": "T06n0220_306:0559c27_29"
    },
    {
        "source_sentence": "分別開示菩薩十地相；",
        "translation": "They analyze and show the characteristics of the ten stages of enlightening beings.",
        "source": "T06n0220_306:0559c28_30"
    },
    {
        "source_sentence": "分別開示五眼相，分別開示六神通相；",
        "translation": "Discriminating they show the characteristics of the five eyes, and discriminating they show the characteristics of the six supernormal powers.",
        "source": "T06n0220_306:0559c28_31"
    },
    {
        "source_sentence": "分別開示佛十力相，分別開示四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法相；",
        "translation": "They discerned and showed the characteristics of the ten powers of buddhas. They discerned and showed the characteristics of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great relinquishment, and the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_306:0559c29_32"
    },
    {
        "source_sentence": "分別開示無忘失法相，分別開示恒住捨性相；",
        "translation": "They discriminate and show the characteristics of the state of nonforgetfulness, and they discriminate and show the characteristics of permanence in equanimity.",
        "source": "T06n0220_306:0560a02_33"
    },
    {
        "source_sentence": "分別開示一切智相，分別開示道相智、一切相智相；",
        "translation": "Discriminating they show the characteristics of omniscience, and discriminating they show the characteristics of knowledge of the path and all characteristics of knowledge.",
        "source": "T06n0220_306:0560a03_34"
    },
    {
        "source_sentence": "分別開示一切陀羅尼門相，分別開示一切三摩地門相；",
        "translation": "They analyze and show all aspects of the spells, and analyze and show all aspects of meditative absorption.",
        "source": "T06n0220_306:0560a04_35"
    },
    {
        "source_sentence": "分別開示預流果相，分別開示一來、不還、阿羅漢果相；",
        "translation": "They discriminate and show the characteristics of the fruits of stream-entry, and they discriminate and show the characteristics of the fruits of once-returning, nonreturning, and arhatship.",
        "source": "T06n0220_306:0560a06_36"
    },
    {
        "source_sentence": "分別開示獨覺菩提相；",
        "translation": "They analyze and show the characteristics of enlightenment of self-enlightened ones.",
        "source": "T06n0220_306:0560a07_37"
    },
    {
        "source_sentence": "分別開示一切菩薩摩訶薩行相；",
        "translation": "They analyze and reveal the practices of all great enlightening beings.",
        "source": "T06n0220_306:0560a08_0"
    },
    {
        "source_sentence": "分別開示諸佛無上正等菩提相。」",
        "translation": "He discerns and reveals the unsurpassed, correct, and enlightened characteristics of the buddhas.",
        "source": "T06n0220_306:0560a08_1"
    },
    {
        "source_sentence": "爾時，世尊告諸天子：「如是！",
        "translation": "It was then that the Bhagavān addressed the celestial beings, So it is!",
        "source": "T06n0220_306:0560a09_2"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_306:0560a10_3"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_306:0560a10_4"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0560a10_5"
    },
    {
        "source_sentence": "一切法相如來如實覺為無相，所謂變礙是色相，如來如實覺為無相；",
        "translation": "All the characteristics of all things are as they really are perceived by the Buddha. The so-called transformations and obstacles are the characteristics of form, while the real perception of Buddha is signlessness.",
        "source": "T06n0220_306:0560a10_6"
    },
    {
        "source_sentence": "領納是受相，如來如實覺為無相；",
        "translation": "Taking in is the characteristic of feeling. The Buddha’s true awakening is signlessness.",
        "source": "T06n0220_306:0560a12_7"
    },
    {
        "source_sentence": "取像是想相，如來如實覺為無相；",
        "translation": "They grasp the characteristics of images and conceptions, while the Buddha’s reality as perceived is formless.",
        "source": "T06n0220_306:0560a13_8"
    },
    {
        "source_sentence": "造作是行相，如來如實覺為無相；",
        "translation": "These are the characteristics of conditioned things. The Buddha, perceiving them as they really are, thought that they have no characteristics.",
        "source": "T06n0220_306:0560a13_9"
    },
    {
        "source_sentence": "了別是識相，如來如實覺為無相；",
        "translation": "Understanding and discriminating are the characteristics of consciousness. The Buddha, perceiving things as they really are, is without characteristics.",
        "source": "T06n0220_306:0560a14_10"
    },
    {
        "source_sentence": "苦惱聚是蘊相，如來如實覺為無相；",
        "translation": "The mass of suffering and the mass of distress are the characteristics of an aggregate. The Buddha, perceiving things as they really are, has no characteristics.",
        "source": "T06n0220_306:0560a15_11"
    },
    {
        "source_sentence": "生長門是處相，如來如實覺為無相；",
        "translation": "The aspect of growth is the characteristic of the sphere; the Buddha, who perceived things as they really are, is the signless.",
        "source": "T06n0220_306:0560a16_12"
    },
    {
        "source_sentence": "多毒害是界相，如來如實覺為無相；",
        "translation": "\\",
        "source": "T06n0220_306:0560a17_0"
    },
    {
        "source_sentence": "和合起是緣起相，如來如實覺為無相；",
        "translation": "“Combination and arising are the characteristics of conditioned arising. The Buddha, perceiving things as they really are, has no characteristics.",
        "source": "T06n0220_306:0560a17_1"
    },
    {
        "source_sentence": "能惠捨是布施波羅蜜多相，如來如實覺為無相；",
        "translation": "Being able to benefit and relinquish is the characteristic of the perfection of giving. The enlightenment of a buddha as it really is has no characteristics.",
        "source": "T06n0220_306:0560a18_2"
    },
    {
        "source_sentence": "無熱惱是淨戒波羅蜜多相，如來如實覺為無相；",
        "translation": "The absence of fever is the manifold characteristic of the perfection of pure morality, while true awakening of Buddha is signless.",
        "source": "T06n0220_306:0560a19_3"
    },
    {
        "source_sentence": "不忿恚是安忍波羅蜜多相，如來如實覺為無相；",
        "translation": "The absence of anger is the characteristic of the perfection of patience. The realization of Buddha as it really is is the characteristic of signlessness.",
        "source": "T06n0220_306:0560a20_4"
    },
    {
        "source_sentence": "不可伏是精進波羅蜜多相，如來如實覺為無相；",
        "translation": "The ungraspable is the characteristic of the many forms of the transcendent energy, while the true awakening of Buddha is formless.",
        "source": "T06n0220_306:0560a22_5"
    },
    {
        "source_sentence": "攝持心是靜慮波羅蜜多相，如來如實覺為無相；",
        "translation": "Consciousness as support is the characteristic of the transcendent meditative absorption. The Buddha’s awareness as it really is is is the characteristic of signlessness.",
        "source": "T06n0220_306:0560a23_6"
    },
    {
        "source_sentence": "無罣礙是般若波羅蜜多相，如來如實覺為無相；",
        "translation": "The absence of obstruction is the characteristic of the perfection of wisdom. The enlightenment of Buddha as it really is is the characteristic of signlessness.",
        "source": "T06n0220_306:0560a24_7"
    },
    {
        "source_sentence": "無所有是內空等相，如來如實覺為無相；",
        "translation": "The absence of existence is the characteristic of internal emptiness and so on. The Buddha, perceiving things as they really are, regards it as signless.",
        "source": "T06n0220_306:0560a25_8"
    },
    {
        "source_sentence": "不顛倒是真如等相，如來如實覺為無相；",
        "translation": "What is not mistaken are the characteristics of true thusness and so on. The Buddha, perceiving things as they really are, has no characteristics.",
        "source": "T06n0220_306:0560a26_9"
    },
    {
        "source_sentence": "不虛妄是四聖諦相，如來如實覺為無相；",
        "translation": "The absence of falsehood is the characteristic of the four noble truths. The Buddha, perceiving things as they really are, regards them as signless.",
        "source": "T06n0220_306:0560a27_10"
    },
    {
        "source_sentence": "無擾惱是四靜慮相，如來如實覺為無相；",
        "translation": "The absence of disturbance is the characteristic of these four states of meditative absorptions. The Buddha, perceiving them as they really are, has no characteristics.",
        "source": "T06n0220_306:0560a28_11"
    },
    {
        "source_sentence": "無限礙是四無量相，如來如實覺為無相；",
        "translation": "Infinite obstruction is the fourth immeasurable characteristic. The Buddha, perceiving things as they really are, regards signlessness as formlessness.",
        "source": "T06n0220_306:0560a29_12"
    },
    {
        "source_sentence": "無諠雜是四無色定相，如來如實覺為無相；",
        "translation": "The absence of confusion is the characteristic of the four formless absorptions. The Buddha, perceiving things as they really are, has formlessness as his characteristic.",
        "source": "T06n0220_306:0560b01_13"
    },
    {
        "source_sentence": "無繫縛是八解脫相，如來如實覺為無相；",
        "translation": "The absence of fetters is the characteristic of the eight liberations. The true awakening of Buddha is formlessness.",
        "source": "T06n0220_306:0560b02_14"
    },
    {
        "source_sentence": "能制伏是八勝處相，如來如實覺為無相；",
        "translation": "These are the characteristics of the eight spheres of mastery that can be subdued. The true enlightenment of Buddha is formless.",
        "source": "T06n0220_306:0560b03_15"
    },
    {
        "source_sentence": "不散亂是九次第定相，如來如實覺為無相；",
        "translation": "These are the characteristics of the nine graduated absorptions. The Buddha, perceiving them as they really are, has no characteristics.",
        "source": "T06n0220_306:0560b04_0"
    },
    {
        "source_sentence": "無邊際是十遍處相，如來如實覺為無相；",
        "translation": "Boundlessness is the characteristic of the ten universals. The Buddha, perceiving things as they really are, has marklessness.",
        "source": "T06n0220_306:0560b05_0"
    },
    {
        "source_sentence": "能出離是三十七菩提分法相，如來如實覺為無相；",
        "translation": "Being able to emancipate is the characteristic of the thirty-seven factors of enlightenment. The Buddha’s true awakening is signless.",
        "source": "T06n0220_306:0560b05_1"
    },
    {
        "source_sentence": "極遠離是空解脫門相，如來如實覺為無相；",
        "translation": "The utmost seclusion is the characteristic of the liberation gate of emptiness, while the true awakening of Buddha is formless.",
        "source": "T06n0220_306:0560b07_2"
    },
    {
        "source_sentence": "最寂靜是無相解脫門相，如來如實覺為無相；",
        "translation": "The utmost quiescence is the characteristic of the liberation gate of signlessness. The Buddha’s true awakening is signless.",
        "source": "T06n0220_306:0560b08_3"
    },
    {
        "source_sentence": "厭眾苦是無願解脫門相，如來如實覺為無相；",
        "translation": "Being disgusted with all suffering is the characteristic of the liberation gate of wishlessness. The enlightenment of Buddha as it really is has no characteristics.",
        "source": "T06n0220_306:0560b09_4"
    },
    {
        "source_sentence": "趣大覺是菩薩十地相，如來如實覺為無相；",
        "translation": "Great awakening is the characteristic of the ten stages of enlightening beings. The Buddha’s true awakening is signless.",
        "source": "T06n0220_306:0560b10_5"
    },
    {
        "source_sentence": "能觀照是五眼相，如來如實覺為無相；",
        "translation": "Those who can contemplate and illumine are the characteristics of the five eyes. The Buddha, perceiving things as they really are, has no characteristics.",
        "source": "T06n0220_306:0560b11_6"
    },
    {
        "source_sentence": "無壅滯是六神通相，如來如實覺為無相；",
        "translation": "The absence of obstruction is the characteristic of these six supernormal powers. The enlightenment of a buddha as it really is has no characteristics.",
        "source": "T06n0220_306:0560b12_7"
    },
    {
        "source_sentence": "善決定是佛十力相，如來如實覺為無相；",
        "translation": "Good certainty is the characteristic of the ten powers of buddhahood. The true awakening of Buddha is formless.",
        "source": "T06n0220_306:0560b13_8"
    },
    {
        "source_sentence": "善安立是四無所畏相，如來如實覺為無相；",
        "translation": "Well-established are the characteristics of these four forms of fearlessness. The enlightened one who perceives them as they really are has no characteristics.",
        "source": "T06n0220_306:0560b14_0"
    },
    {
        "source_sentence": "無斷絕是四無礙解相，如來如實覺為無相；",
        "translation": "Uninterruptedness is the characteristic of the four unhindered understandings. The true awakening of Buddha is signlessness.",
        "source": "T06n0220_306:0560b15_0"
    },
    {
        "source_sentence": "與利樂是大慈相，如來如實覺為無相；",
        "translation": "Benefits and satisfaction are the characteristic of great compassion. The true awakening of a buddha is formless.",
        "source": "T06n0220_306:0560b16_0"
    },
    {
        "source_sentence": "拔衰苦是大悲相，如來如實覺為無相；",
        "translation": "The suffering of uprooting and decaying is the characteristic of great compassion. The enlightenment of Buddhahood as it really is is perceived as signless.",
        "source": "T06n0220_306:0560b16_1"
    },
    {
        "source_sentence": "慶善事是大喜相，如來如實覺為無相；",
        "translation": "Rejoicing in virtuous deeds is the characteristic of great joy. The Buddha, perceiving things as they really are, regards them as signless.",
        "source": "T06n0220_306:0560b17_2"
    },
    {
        "source_sentence": "棄諠雜是大捨相，如來如實覺為無相；",
        "translation": "Dispassion is the characteristic of great relinquishment. The Buddha, perceiving things as they really are, thinks that it has no characteristics.",
        "source": "T06n0220_306:0560b18_3"
    },
    {
        "source_sentence": "不可奪是十八佛不共法相，如來如實覺為無相；",
        "translation": "These are the unique characteristics of the doctrine of the eighteen buddhas. The enlightenment of Buddha, perceived as it really is, has no characteristics.",
        "source": "T06n0220_306:0560b19_4"
    },
    {
        "source_sentence": "善憶念是無忘失法相，如來如實覺為無相；",
        "translation": "Good recollection is the characteristic of the state of nonforgetfulness. The true awakening of a buddha is signlessness.",
        "source": "T06n0220_306:0560b20_5"
    },
    {
        "source_sentence": "無取著是恒住捨性相，如來如實覺為無相；",
        "translation": "The absence of grasping and clinging is the characteristic of eternally abiding equanimity. The Buddha, perceiving things as they really are, has signlessness.",
        "source": "T06n0220_306:0560b21_6"
    },
    {
        "source_sentence": "現等覺是一切智相，如來如實覺為無相；",
        "translation": "Equanimous enlightenment is the characteristic of omniscience. The Buddha’s enlightenment as it is is is signless.",
        "source": "T06n0220_306:0560b22_7"
    },
    {
        "source_sentence": "善通達是道相智相，如來如實覺為無相；",
        "translation": "“Good understanding is the characteristic of knowledge of the path. The Buddha, perceiving things as they really are, has no characteristics.",
        "source": "T06n0220_306:0560b23_8"
    },
    {
        "source_sentence": "現別覺是一切相智相，如來如實覺為無相；",
        "translation": "Manifesting specific awakening is the characteristic of omniscience. The enlightenment of Buddha, as it really is, is signless.",
        "source": "T06n0220_306:0560b24_9"
    },
    {
        "source_sentence": "遍攝持是一切陀羅尼門相，如來如實覺為無相；",
        "translation": "Universal embracing is the characteristic of all dhāraṇī teachings, while true awakening of Buddha is formless.",
        "source": "T06n0220_306:0560b25_10"
    },
    {
        "source_sentence": "遍攝受是一切三摩地門相，如來如實覺為無相；",
        "translation": "The pervasive grasping is the characteristic of all aspects of concentration. The Buddha’s awareness as it really is has no characteristics.",
        "source": "T06n0220_306:0560b26_11"
    },
    {
        "source_sentence": "善受教是聲聞果相，如來如實覺為無相；",
        "translation": "Well-understood instruction is the characteristic of the fruit of sravaka. The true enlightenment of a buddha is signless.",
        "source": "T06n0220_306:0560b27_12"
    },
    {
        "source_sentence": "自開悟是獨覺菩提相，如來如實覺為無相；",
        "translation": "Self-enlightenment is the characteristic of enlightenment of self-enlightened ones. The actual enlightenment of Buddha is signless.",
        "source": "T06n0220_306:0560b28_13"
    },
    {
        "source_sentence": "趣大果是一切菩薩摩訶薩行相，如來如實覺為無相；",
        "translation": "The great fruit of enlightenment is the characteristic of all practices of enlightening beings, while true awakening of buddhas is signlessness.",
        "source": "T06n0220_306:0560b29_14"
    },
    {
        "source_sentence": "無與等是諸佛無上正等菩提相，如來如實覺為無相。",
        "translation": "The unsurpassed is the characteristic of the buddhas' unsurpassed correct perfect enlightenment, and the Tathāgata's true awakening is markless.",
        "source": "T06n0220_306:0560c01_15"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T06n0220_306:0560c03_16"
    },
    {
        "source_sentence": "一切如來、應、正等覺於如是等一切法相，皆能如實覺為無相，由是因緣，",
        "translation": "All buddhas, enlightening beings, and fully awakened ones can truly perceive all these characteristics of things as signless.",
        "source": "T06n0220_306:0560c03_17"
    },
    {
        "source_sentence": "我說諸佛得無礙智無與等者。」",
        "translation": "I say that the buddhas attain unhindered cognition without equal.",
        "source": "T06n0220_306:0560c05_18"
    },
    {
        "source_sentence": "爾時，佛告具壽善現言：「善現當知！",
        "translation": "It was then that the Buddha addressed Kauśinagara and said to the good manifestation, Good manifestation, you should know!",
        "source": "T06n0220_306:0560c06_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多是諸佛母，甚深般若波羅蜜多能示世間諸法實相，是故如來、應、正等覺依法而住，",
        "translation": "The profound prajñāpāramitā is the mother of all buddhas, and the profound prajñāpāramitā can show the true characteristics of worldly dharmas; therefore, the Tathāgata, Arhat, Perfectly Enlightened One abides by the Dharma.",
        "source": "T06n0220_306:0560c06_1"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎、攝受護持所依住法，此法即是甚深般若波羅蜜多。",
        "translation": "These are the profound prajñāpāramitā of making offerings, honoring, venerating, praising, and taking in and protecting the Dharma on which they rely.",
        "source": "T06n0220_306:0560c09_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_306:0560c10_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0560c10_4"
    },
    {
        "source_sentence": "甚深般若波羅蜜多能生諸佛，能與諸佛作所依處，能示世間諸法實相。",
        "translation": "The profound prajñāpāramitā can give rise to buddhas, serve as a basis for the buddhas, and show the true characteristics of worldly dharmas.",
        "source": "T06n0220_306:0560c11_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0560c12_6"
    },
    {
        "source_sentence": "一切如來、應、正等覺是知恩者、能報恩者。",
        "translation": "All tathāgatas, arhats, and perfectly enlightened ones are those who know kindness and those who can repay kindness.",
        "source": "T06n0220_306:0560c12_7"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0560c13_8"
    },
    {
        "source_sentence": "若有問言：『誰是知恩能報恩者？』",
        "translation": "If someone asks, 'Who is the one who knows kindness and can repay kindness?'",
        "source": "T06n0220_306:0560c13_9"
    },
    {
        "source_sentence": "應正答言：『佛是知恩能報恩者。』",
        "translation": "You should correctly answer, 'The Buddha is someone who knows kindness and can repay kindness.'",
        "source": "T06n0220_306:0560c14_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_306:0560c15_11"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0560c15_12"
    },
    {
        "source_sentence": "一切世間知恩報恩無過佛故。」",
        "translation": "It's because all the world knows that kindness and repayment of kindness are no different from those of the Buddha.",
        "source": "T06n0220_306:0560c15_13"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0560c16_14"
    },
    {
        "source_sentence": "云何如來、應、正等覺知恩報恩？」",
        "translation": "How do the Tathāgata, Arhat, and Completely Awakened One know kindness and repay kindness?",
        "source": "T06n0220_306:0560c16_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0560c17_16"
    },
    {
        "source_sentence": "一切如來、應、正等覺乘如是乘行如是道，來至無上正等菩提，得菩提已，",
        "translation": "“Furthermore, the enlightenment of all buddhas is like this: they come to supreme perfect enlightenment and attain it. Having attained enlightenment, they enter into the practice of unexcelled true awakening.",
        "source": "T06n0220_306:0560c17_17"
    },
    {
        "source_sentence": "於一切時供養恭敬、尊重讚歎、攝受護持是乘是道曾無暫廢，此乘此道當知即是甚深般若波羅蜜多。",
        "translation": "At all times, offering support, respect, veneration, veneration, praise, and taking in and maintaining this vehicle is the path that never stops, and this vehicle and this path should be known to be the profound perfection of wisdom.",
        "source": "T06n0220_306:0560c18_18"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0560c21_19"
    },
    {
        "source_sentence": "是名如來、應、正等覺知恩報恩。",
        "translation": "This is called the Tathāgata, Arhat, and Completely Awakened One who knows kindness and repays kindness.",
        "source": "T06n0220_306:0560c21_20"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_306:0560c22_21"
    },
    {
        "source_sentence": "一切如來、應、正等覺，無不皆依甚深般若波羅蜜多，於諸有相及無相法，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā for all marks and signless dharmas.",
        "source": "T06n0220_306:0560c22_22"
    },
    {
        "source_sentence": "皆現等覺無實作用，以能作者無所有故。",
        "translation": "They all manifest equanimity and so forth without real activity, because the agent that produces them has no existence.",
        "source": "T06n0220_306:0560c23_23"
    },
    {
        "source_sentence": "一切如來、應、正等覺，無不皆依甚深般若波羅蜜多，於諸有相及無相法，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā for all marks and signless dharmas.",
        "source": "T06n0220_306:0560c24_24"
    },
    {
        "source_sentence": "皆現等覺無所成辦，以諸形質不可得故。",
        "translation": "There is nothing to be accomplished in all the manifestations of virtual enlightenment, because form and substance are unobtainable.",
        "source": "T06n0220_306:0560c26_25"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_306:0560c27_26"
    },
    {
        "source_sentence": "以諸如來、應、正等覺知依如是甚深般若波羅蜜多，能現等覺相無相法，",
        "translation": "It's because the Tathāgatas, Arhats, and Fully Awakened Ones rely on such profound prajñāpāramitā that they can manifest signless dharmas of equal enlightenment.",
        "source": "T06n0220_306:0560c27_27"
    },
    {
        "source_sentence": "皆無作用，無所成辦，於一切時供養恭敬、尊重讚歎、攝受護持無有間斷，",
        "translation": "They all have no function and nothing to accomplish. At all times they offer support, honor, venerate, praise, receive, and uphold without interruption.",
        "source": "T06n0220_306:0560c29_28"
    },
    {
        "source_sentence": "故名真實知恩報恩。",
        "translation": "That's why it's called truly knowing kindness and repaying kindness.",
        "source": "T06n0220_306:0561a01_29"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_306:0561a02_30"
    },
    {
        "source_sentence": "一切如來、應、正等覺，無不皆依甚深般若波羅蜜多，於一切法無作、無成，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones all rely on the profound prajñāpāramitā, which is unconstructed and uncreated in all things.",
        "source": "T06n0220_306:0561a02_31"
    },
    {
        "source_sentence": "無生智轉，復能知此無轉因緣。",
        "translation": "When the cognition of nonarising is transformed, they can also know the causes and conditions for this nontransformation.",
        "source": "T06n0220_306:0561a04_32"
    },
    {
        "source_sentence": "是故，應知甚深般若波羅蜜多能生諸佛，亦能如實示世間相。」",
        "translation": "Therefore, you should know that the profound prajñāpāramitā gives rise to buddhas and can also truly show worldly appearances.",
        "source": "T06n0220_306:0561a04_33"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_306:0561a07_0"
    },
    {
        "source_sentence": "一切法性無生、無起、無知、無見，如何可說甚深般若波羅蜜多能生諸佛，",
        "translation": "If the nature of all dharmas is without birth, without arising, without knowing, and without views, how can it be said that the profound prajñāpāramitā can give rise to buddhas?",
        "source": "T06n0220_306:0561a07_1"
    },
    {
        "source_sentence": "是諸佛母，亦能如實示世間相？」",
        "translation": "Is the mother of all buddhas able to show worldly appearances as they really are?",
        "source": "T06n0220_306:0561a09_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_306:0561a10_0"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_306:0561a10_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_306:0561a10_2"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_306:0561a10_3"
    },
    {
        "source_sentence": "一切法性無生、無起、無知、無見，依世俗說甚深般若波羅蜜多能生諸佛，",
        "translation": "The nature of all dharmas has no birth, no arising, no knowing, and no seeing, and the profound prajñāpāramitā that relies on worldly explanations produces buddhas.",
        "source": "T06n0220_306:0561a10_4"
    },
    {
        "source_sentence": "是諸佛母，亦能如實示世間相。」",
        "translation": "These are the buddhas and mothers who can also truly show worldly appearances.",
        "source": "T06n0220_306:0561a12_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_306:0561a13_6"
    },
    {
        "source_sentence": "云何諸法無生、無起、無知、無見？」",
        "translation": "What are the dharmas that lack birth, lack arising, lack knowledge, and lack views?",
        "source": "T06n0220_306:0561a13_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561a13_8"
    },
    {
        "source_sentence": "以一切法空無所有，皆不自在，虛誑不堅故，一切法無生、無起、無知、無見。",
        "translation": "Because the emptiness of all things has no existence, they aren't self-contained, and because it's false and unsteady, all things lack arising, nonarising, ignorance, and views.",
        "source": "T06n0220_306:0561a14_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_306:0561a15_1"
    },
    {
        "source_sentence": "一切法性無所依止，無所繫屬，由是因緣，無生、無起、無知、無見。",
        "translation": "The essence of all dharmas has no basis and no attachment, and because of these causes and conditions, there's no arising, no arising, no knowing, and no seeing.",
        "source": "T06n0220_306:0561a15_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561a17_3"
    },
    {
        "source_sentence": "甚深般若波羅蜜多雖能生諸佛，能示世間相，而無所生亦無所示。",
        "translation": "Although the profound prajñāpāramitā can give rise to buddhas, it can show worldly appearances, but nothing is produced and nothing is shown.",
        "source": "T06n0220_306:0561a17_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561a18_5"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見色故名示色相，不見受、想、行、識故名示受、想、行、識相。",
        "translation": "The profound prajñāpāramitā is called showing form because it doesn't see form, and it's called showing the characteristics of feeling, perception, volition, and consciousness because it doesn't see feeling, perception, volition, and consciousness.",
        "source": "T06n0220_306:0561a19_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561a20_7"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見眼處故名示眼處相，不見耳、鼻、舌、身、意處故名示耳、鼻、舌、身、意處相。",
        "translation": "The profound prajñāpāramitā doesn't see the eye sense-field, so it's called showing the characteristics of the eye sense-field; it doesn't see the ear, nose, tongue, body, or mind sense-field, so it's called showing the characteristics of the ear, nose, tongue, body, tongue, and mind sense",
        "source": "T06n0220_306:0561a20_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561a23_9"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見色處故名示色處相，不見聲、香、味、觸、法處故名示聲、香、味、觸、法處相。",
        "translation": "The profound prajñāpāramitā doesn't see the form realm, so it's called showing the characteristics of the form realm and doesn't see the characteristics of the sound, odor, taste, touch, or dharma realms, so it's called showing the characteristics of the sound, odor, taste, touch, and dharma realms.",
        "source": "T06n0220_306:0561a23_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561a25_11"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見眼界故名示眼界相，不見色界、眼識界及眼觸、眼觸為緣所生諸受故名示色界乃至眼觸為緣所生諸受相。",
        "translation": "The profound prajñāpāramitā doesn't see the eye realm, so it's called showing the characteristics of the eye realm; it doesn't see the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are therefore called showing the characteristics of the form realm or even the sensations",
        "source": "T06n0220_306:0561a25_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561a28_13"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見耳界故名示耳界相，不見聲界、耳識界及耳觸、耳觸為緣所生諸受故名示聲界乃至耳觸為緣所生諸受相。",
        "translation": "The profound prajñāpāramitā doesn't see the ear realm, so it's called showing the characteristics of the ear realm; it doesn't see the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as a condition are therefore called showing the characteristics of the sound realm or even the sensations",
        "source": "T06n0220_306:0561a28_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b02_15"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見鼻界故名示鼻界相，不見香界、鼻識界及鼻觸、鼻觸為緣所生諸受故名示香界乃至鼻觸為緣所生諸受相。",
        "translation": "The profound prajñāpāramitā doesn't see the nose realm because it's called showing the characteristics of the nose realm and doesn't see the characteristics of the fragrance realm, the nose consciousness realm, or the sensations that arise from nose contact and nose contact as a condition, so it's called showing the",
        "source": "T06n0220_306:0561b02_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b05_17"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見舌界故名示舌界相，不見味界、舌識界及舌觸、舌觸為緣所生諸受故名示味界乃至舌觸為緣所生諸受相。",
        "translation": "The profound prajñāpāramitā doesn't see the tongue realm because it's called showing the characteristics of the tongue realm and doesn't see the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are therefore called showing the characteristics of the taste realm or even",
        "source": "T06n0220_306:0561b05_18"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b08_19"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見身界故名示身界相，不見觸界、身識界及身觸、身觸為緣所生諸受故名示觸界乃至身觸為緣所生諸受相。",
        "translation": "The profound prajñāpāramitā doesn't see the body realm, so it's called showing the characteristics of the body realm; it doesn't see the touch realm, the body consciousness realm, and the sensations that arise from body contact and body contact as a condition are therefore called showing the characteristics of the touch realm or even the sensations",
        "source": "T06n0220_306:0561b08_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b11_21"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見意界故名示意界相，不見法界、意識界及意觸、意觸為緣所生諸受故名示法界乃至意觸為緣所生諸受相。",
        "translation": "The profound prajñāpāramitā doesn't see the mind realm, so it's called showing the characteristics of the mind realm; it doesn't see the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are therefore called showing the characteristics of the Dharma realm or even the sensations that",
        "source": "T06n0220_306:0561b11_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b14_23"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見地界故名示地界相，不見水、火、風、空、識界故名示水、火、風、空、識界相。",
        "translation": "The profound prajñāpāramitā doesn't see the earth realm, so it's called showing the characteristics of the earth realm; it doesn't see the characteristics of water, fire, wind, air, space, and consciousness realms, so it's called showing the characteristics of water, fire, wind, air, space, and consciousness",
        "source": "T06n0220_306:0561b15_24"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b17_25"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見無明故名示無明相，不見行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱故名示行乃至老死愁歎苦憂惱相。",
        "translation": "The profound prajñāpāramitā doesn't see nescience and therefore is called showing the characteristics of nescience, and it doesn't see the characteristics of form, consciousness, name-and-form, the six sense-fields, touch, sensation, feeling, craving, apprehension, birth, old age, sorrow, pain, suffering, and",
        "source": "T06n0220_306:0561b17_26"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b20_27"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見布施波羅蜜多故名示布施波羅蜜多相，不見淨戒、安忍、精進、靜慮、般若波羅蜜多故名示淨戒乃至般若波羅蜜多相。",
        "translation": "The profound prajñāpāramitā doesn't see the perfection of generosity, so it's called showing the characteristics of the perfection of generosity, and it doesn't see the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā, so it's called showing the characteristics of pure morality or even the perfection of pra",
        "source": "T06n0220_306:0561b20_28"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b23_29"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見內空故名示內空相，不見外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空故名示外空乃至無性自性空相。",
        "translation": "The profound prajñāpāramitā doesn't see internal emptiness, so it's called showing the characteristic of internal emptiness; it doesn't see external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, existent emptiness, impermanent emptiness, infinite emptiness, dispersed",
        "source": "T06n0220_306:0561b23_30"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561b29_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見真如故名示真如相，不見法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界故名示法界乃至不思議界相。",
        "translation": "The profound prajñāpāramitā doesn't see the true nature, so it's called showing the characteristics of the true nature; it doesn't see the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, or the inconce",
        "source": "T06n0220_306:0561b29_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c03_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見苦聖諦故名示苦聖諦相，不見集、滅、道聖諦故名示集、滅、道聖諦相。",
        "translation": "The profound prajñāpāramitā doesn't see the noble truth of suffering and therefore is called showing the characteristics of the noble truth of suffering, and it doesn't see the characteristics of the noble truths of arising, ceasing, and the path and therefore is called showing the characteristics of the noble truths of arising, ceasing, and the",
        "source": "T06n0220_306:0561c03_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c06_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見四靜慮故名示四靜慮相，不見四無量、四無色定故名示四無量、四無色定相。",
        "translation": "The profound prajñāpāramitā doesn't see the four meditations and therefore is called showing the characteristics of the four meditations, and it doesn't see the characteristics of the four immeasurable and four formless concentrations and therefore is called showing the characteristics of the four immeasurable and four formless concentrations.",
        "source": "T06n0220_306:0561c06_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c08_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見八解脫故名示八解脫相，不見八勝處、九次第定、十遍處故名示八勝處、九次第定、十遍處相。",
        "translation": "The profound prajñāpāramitā doesn't see the eight liberations, so it's called showing the characteristics of the eight liberations and doesn't see the characteristics of the eight superior places, nine graduated concentrations, and ten universal abodes, so it's called showing the characteristics of the eight superior places, nine graduated concentrations, and ten",
        "source": "T06n0220_306:0561c08_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c11_4"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見四念住故名示四念住相，不見四正斷、四神足、五根、五力、七等覺支、八聖道支故名示四正斷乃至八聖道支相。",
        "translation": "The profound prajñāpāramitā doesn't see the four abodes of mindfulness, so it's called showing the characteristics of the four abodes of mindfulness. It doesn't see the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of",
        "source": "T06n0220_306:0561c11_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c14_6"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見空解脫門故名示空解脫門相，不見無相、無願解脫門故名示無相、無願解脫門相。",
        "translation": "The profound prajñāpāramitā doesn't see the liberation gate of emptiness, so it's called showing the characteristics of the liberation gate of emptiness, and it doesn't see the characteristics of the liberation gate of signlessness and wishlessness, so it's called showing the characteristics of the liberation gate of signlessness and",
        "source": "T06n0220_306:0561c14_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c17_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見菩薩十地故名示菩薩十地相。",
        "translation": "The profound prajñāpāramitā doesn't see the bodhisattva's ten stages, so it's called showing the characteristics of the bodhisattva's ten stages.",
        "source": "T06n0220_306:0561c17_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c19_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見五眼故名示五眼相，不見六神通故名示六神通相。",
        "translation": "The profound prajñāpāramitā doesn't see the five eyes, so it's called showing the characteristics of the five eyes; it doesn't see the characteristics of the six supernormal powers, so it's called showing the characteristics of the six supernormal powers.",
        "source": "T06n0220_306:0561c19_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c20_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見佛十力故名示佛十力相，不見四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法故名示四無所畏乃至十八佛不共法相。",
        "translation": "The profound prajñāpāramitā doesn't see the Buddha's ten powers, so it's called showing the characteristics of the Buddha's ten powers; it doesn't see the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 Buddha-uncommon dharmas",
        "source": "T06n0220_306:0561c21_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c24_1"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見無忘失法故名示無忘失法相，不見恒住捨性故名示恒住捨性相。",
        "translation": "The profound prajñāpāramitā doesn't see the dharmas that are without forgetfulness and therefore is called showing the characteristic of the dharmas that are without forgetfulness, and it doesn't see the characteristic of constantly abiding equanimity and so is called showing the characteristic of constantly abiding equanimity.",
        "source": "T06n0220_306:0561c24_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c26_3"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見一切智故名示一切智相，不見道相智、一切相智故名示道相智、一切相智相。",
        "translation": "The profound prajñāpāramitā doesn't see all cognition and therefore is called showing the characteristics of all cognition, and it doesn't see the characteristics of knowledge of paths and all characteristics and therefore is called showing the characteristics of knowledge of paths and all characteristics.",
        "source": "T06n0220_306:0561c26_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0561c29_5"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見一切陀羅尼門故名示一切陀羅尼門相，不見一切三摩地門故名示一切三摩地門相。",
        "translation": "The profound prajñāpāramitā doesn't see all the dhāraṇī aspects, so it's called showing all the characteristics of the dhāraṇī aspects, and it doesn't see all the characteristics of the samādhi aspects, so it's called showing all the characteristics of the samādhi aspects.",
        "source": "T06n0220_306:0561c29_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0562a02_7"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見預流果故名示預流果相，不見一來、不還、阿羅漢果故名示一來、不還、阿羅漢果相。",
        "translation": "The profound prajñāpāramitā doesn't see the fruit of stream-winner because it's called showing the characteristics of the fruit of stream-winner, and it doesn't see the characteristics of the once-returner, nonreturner, or arhat because it's called showing the characteristics of the once-returner, nonreturner, or ar",
        "source": "T06n0220_306:0562a02_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0562a05_9"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見獨覺菩提故名示獨覺菩提相。",
        "translation": "The profound prajñāpāramitā doesn't see the enlightenment of the solitary realizer, so it's called showing the characteristics of the solitary realizer's enlightenment.",
        "source": "T06n0220_306:0562a05_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0562a06_11"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見一切菩薩摩訶薩行故名示一切菩薩摩訶薩行相。",
        "translation": "The profound prajñāpāramitā doesn't see all the bodhisattva-mahāsattva practices, so it's called showing all the bodhisattva-mahāsattva practices.",
        "source": "T06n0220_306:0562a06_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0562a08_13"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見諸佛無上正等菩提故名示諸佛無上正等菩提相。",
        "translation": "The profound prajñāpāramitā doesn't see the unsurpassed correct perfect enlightenment of the buddhas, so it's called showing the characteristics of the unsurpassed correct perfect enlightenment of the buddhas.",
        "source": "T06n0220_306:0562a08_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_306:0562a10_15"
    },
    {
        "source_sentence": "由如是義，甚深般若波羅蜜多，能示諸佛世間實相，名諸佛母。」",
        "translation": "Because of this meaning, the profound prajñāpāramitā can show the true characteristics of the buddhas in the world and be called the mother of the buddhas.",
        "source": "T06n0220_306:0562a10_16"
    },
    {
        "source_sentence": "具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng said to the Buddha, Bhagavān!",
        "source": "T06n0220_306:0562a12_17"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，云何不見色故名示色相，不見受、想、行、識故名示受、想、行、識相？",
        "translation": "How can the profound prajñāpāramitā be called showing form because it doesn't see form and is called showing feeling, perception, volition, and consciousness because it doesn't see feeling, perception, volition, and consciousness?",
        "source": "T06n0220_306:0562a12_18"
    },
    {
        "source_sentence": "「云何不見眼處故名示眼處相，不見耳、鼻、舌、身、意處故名示耳、鼻、舌、身、意處相？",
        "translation": "How can it be called showing the characteristics of the eye because it doesn't see the eye, and it's called showing the characteristics of the ear, nose, tongue, body, and mind because it doesn't see the ear, nose, tongue, body, or mind?",
        "source": "T06n0220_306:0562a14_19"
    },
    {
        "source_sentence": "「云何不見色處故名示色處相，不見聲、香、味、觸、法處故名示聲、香、味、觸、法處相？",
        "translation": "How is it called showing the characteristics of the form realm because it doesn't see the form realm? It's called showing the characteristics of the sound, smell, taste, touch, and dharma realms because it doesn't see the characteristics of the sound, smell, taste, touch, touch, and dharma realms?",
        "source": "T06n0220_306:0562a16_20"
    },
    {
        "source_sentence": "「云何不見眼界故名示眼界相，不見色界、眼識界及眼觸、眼觸為緣所生諸受故名示色界乃至眼觸為緣所生諸受相？",
        "translation": "How is it that they don't see the eye realm and therefore are called showing the characteristics of the eye realm? They don't see the form realm, the eye consciousness realm, or the sensations that arise from eye contact and eye contact as a condition and therefore are called showing the characteristics of the form realm and even the sensations that arise from eye contact",
        "source": "T06n0220_306:0562a18_0"
    },
    {
        "source_sentence": "「云何不見耳界故名示耳界相，不見聲界、耳識界及耳觸、耳觸為緣所生諸受故名示聲界乃至耳觸為緣所生諸受相？",
        "translation": "How can it be called showing the characteristics of the ear realm because it doesn't see the ear realm and is called showing the characteristics of the sound realm or even the characteristics of the sensations that arise from ear contact and ear contact as a condition because it doesn't see the sound realm, ear consciousness realm, or ear contact as a condition?",
        "source": "T06n0220_306:0562a20_1"
    },
    {
        "source_sentence": "「云何不見鼻界故名示鼻界相，不見香界、鼻識界及鼻觸、鼻觸為緣所生諸受故名示香界乃至鼻觸為緣所生諸受相？",
        "translation": "How is it that they don't see the nose realm so they're called showing the characteristics of the nose realm? They don't see the fragrance realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as a condition are therefore called showing the characteristics of the feelings that arise from the",
        "source": "T06n0220_306:0562a23_2"
    },
    {
        "source_sentence": "「云何不見舌界故名示舌界相，不見味界、舌識界及舌觸、舌觸為緣所生諸受故名示味界乃至舌觸為緣所生諸受相？",
        "translation": "How is it that they don't see the tongue realm and therefore are called showing the characteristics of the tongue realm? They don't see the taste realm, the tongue-consciousness realm, or the sensations that arise from tongue contact and tongue contact as a condition and therefore are called showing the characteristics of the taste realm and even the sensations that",
        "source": "T06n0220_306:0562a25_3"
    },
    {
        "source_sentence": "「云何不見身界故名示身界相，不見觸界、身識界及身觸、身觸為緣所生諸受故名示觸界乃至身觸為緣所生諸受相？",
        "translation": "How is it that they don't see the body realm and therefore are called showing the characteristics of the body realm, and they don't see the touch realm, the body-consciousness realm, or the sensations that arise from body contact and body contact as a condition?",
        "source": "T06n0220_306:0562a28_4"
    },
    {
        "source_sentence": "「云何不見意界故名示意界相，不見法界、意識界及意觸、意觸為緣所生諸受故名示法界乃至意觸為緣所生諸受相？",
        "translation": "How is it that they don't see the mind realm and therefore are called showing the characteristics of the mind realm, and they don't see the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are called showing the characteristics of the Dharma realm and even the sensations that arise from mental contact as a",
        "source": "T06n0220_306:0562b02_5"
    },
    {
        "source_sentence": "「云何不見地界故名示地界相，不見水、火、風、空、識界故名示水、火、風、空、識界相？",
        "translation": "How is it that they don't see the earth realm and therefore are called showing the characteristics of the earth realm, and they don't see the water, fire, air, space, and consciousness realms and therefore are called showing the characteristics of the water, fire, air, space, and consciousness realms?",
        "source": "T06n0220_306:0562b04_6"
    },
    {
        "source_sentence": "「云何不見無明故名示無明相，不見行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱故名示行乃至老死愁歎苦憂惱相？",
        "translation": "How is it that they don't see nescience and therefore are called showing the marks of nescience, and they don't see the marks of form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, appropriation, existence, birth, old age, sorrow, pain, and vexation,",
        "source": "T06n0220_306:0562b06_7"
    },
    {
        "source_sentence": "「云何不見布施波羅蜜多故名示布施波羅蜜多相，不見淨戒、安忍、精進、靜慮、般若波羅蜜多故名示淨戒乃至般若波羅蜜多相？",
        "translation": "How can it be called showing the characteristics of the perfection of generosity because it doesn't see the perfection of generosity, and how can it be called showing the characteristics of the perfection of pure morality, patience, effort, meditation, and prajñāpāramitā because it doesn't see the characteristics of pure morality or even the perfection of prajñāpāramitā",
        "source": "T06n0220_306:0562b09_8"
    },
    {
        "source_sentence": "「云何不見內空故名示內空相，不見外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空故名示外空乃至無性自性空相？",
        "translation": "How is it that they don't see internal emptiness because they don't see internal emptiness, and they don't see external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature,",
        "source": "T06n0220_306:0562b12_9"
    },
    {
        "source_sentence": "「云何不見真如故名示真如相，不見法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界故名示法界乃至不思議界相？",
        "translation": "How can it be called showing the characteristics of the Dharma realm or even the characteristics of the inconceivable realm because it doesn't see the true nature, and how can it be called showing the characteristics of the Dharma realm or even the inconceivable realm because it doesn't see the characteristics of the Dharma realm, the Dharma nature, the",
        "source": "T06n0220_306:0562b17_10"
    },
    {
        "source_sentence": "「云何不見苦聖諦故名示苦聖諦相，不見集、滅、道聖諦故名示集、滅、道聖諦相？",
        "translation": "How is it called showing the characteristics of the noble truth of suffering because it doesn't see the noble truth of suffering, and it's called showing the characteristics of the noble truths of arising, ceasing, and the path because it doesn't see the noble truths of arising, ceasing, and the path?",
        "source": "T06n0220_306:0562b20_11"
    },
    {
        "source_sentence": "「云何不見四靜慮故名示四靜慮相，不見四無量、四無色定故名示四無量、四無色定相？",
        "translation": "How are the four formless concentrations called showing the characteristics of the four formless concentrations because they don't see the four formless concentrations and the four formless concentrations called showing the characteristics of the four formless concentrations because they don't see the four formless concentrations?",
        "source": "T06n0220_306:0562b22_12"
    },
    {
        "source_sentence": "「云何不見八解脫故名示八解脫相，不見八勝處、九次第定、十遍處故名示八勝處、九次第定、十遍處相？",
        "translation": "How is it that they don't see the eight liberations and therefore are called showing the characteristics of the eight liberations, and they don't see the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes and therefore are called showing the characteristics of the eight abodes of excellence, the nine graduated concentrations, and the ten universal abo",
        "source": "T06n0220_306:0562b24_0"
    },
    {
        "source_sentence": "「云何不見四念住故名示四念住相，不見四正斷、四神足、五根、五力、七等覺支、八聖道支故名示四正斷乃至八聖道支相？",
        "translation": "How do they not see the four abodes of mindfulness because they don't see the four abodes of mindfulness, and they don't see the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, or the eight noble factors of the path because they don't see the fourfold correct elimination",
        "source": "T06n0220_306:0562b26_1"
    },
    {
        "source_sentence": "「云何不見空解脫門故名示空解脫門相，不見無相、無願解脫門故名示無相、無願解脫門相？",
        "translation": "How can it be called showing the aspect of the liberation gate of emptiness because it doesn't see the aspect of the liberation gate of emptiness, and it's called showing the aspect of the liberation gate of signlessness and wishlessness because it doesn't see the aspect of the liberation gate of signlessness and wishlessness?",
        "source": "T06n0220_306:0562b29_0"
    },
    {
        "source_sentence": "「云何不見菩薩十地故名示菩薩十地相？",
        "translation": "How is it called showing the characteristics of the bodhisattva's ten stages because it doesn't see the bodhisattva's ten stages?",
        "source": "T06n0220_306:0562c02_1"
    },
    {
        "source_sentence": "「云何不見五眼故名示五眼相，不見六神通故名示六神通相？",
        "translation": "How is it called showing the characteristics of the five eyes because it doesn't see the five eyes and shown the characteristics of the six supernormal powers because it doesn't see the six supernormal powers?",
        "source": "T06n0220_306:0562c03_2"
    },
    {
        "source_sentence": "「云何不見佛十力故名示佛十力相，不見四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法故名示四無所畏乃至十八佛不共法相？",
        "translation": "How is it that they don't see the Buddha's ten powers and aren't called showing the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 distinctive characteristics of the Buddha's teachings are called showing the four fearlessnesses or even the 18 distinctive characteristics of the",
        "source": "T06n0220_306:0562c04_3"
    },
    {
        "source_sentence": "「云何不見無忘失法故名示無忘失法相，不見恒住捨性故名示恒住捨性相？",
        "translation": "How is it called showing the characteristic of the dharmas without forgetfulness because it doesn't see the dharmas without forgetfulness and shown the characteristic of the dharmas without forgetfulness because it doesn't see the nature of constantly abiding equanimity?",
        "source": "T06n0220_306:0562c07_4"
    },
    {
        "source_sentence": "「云何不見一切智故名示一切智相，不見道相智、一切相智故名示道相智、一切相智相？",
        "translation": "How can it be called showing the characteristics of omniscience because it doesn't see all cognition, and it's called showing the characteristics of knowledge of paths and omniscience because it doesn't see the characteristics of knowledge of paths and omniscience?",
        "source": "T06n0220_306:0562c09_5"
    },
    {
        "source_sentence": "「云何不見一切陀羅尼門故名示一切陀羅尼門相，不見一切三摩地門故名示一切三摩地門相？",
        "translation": "How is it called showing the characteristics of all dhāraṇī approaches because it doesn't see all dhāraṇī approaches and called showing the characteristics of all samādhi approaches because it doesn't see all samādhi approaches?",
        "source": "T06n0220_306:0562c11_6"
    },
    {
        "source_sentence": "「云何不見預流果故名示預流果相，不見一來、不還、阿羅漢果故名示一來、不還、阿羅漢果相？",
        "translation": "How is it that they don't see the fruit of pre-flow because they're called showing the characteristics of the fruit of pre-flow? They don't see the characteristics of the once-returner, nonreturner, and arhat because they're called showing the characteristics of the once-returner, nonreturner, and arhat because they don't see the",
        "source": "T06n0220_306:0562c13_7"
    },
    {
        "source_sentence": "「云何不見獨覺菩提故名示獨覺菩提相？",
        "translation": "How does it not see the enlightenment of the solitary realizer and therefore be called showing the characteristics of the enlightenment of the solitary realizer?",
        "source": "T06n0220_306:0562c15_8"
    },
    {
        "source_sentence": "「云何不見一切菩薩摩訶薩行故名示一切菩薩摩訶薩行相？",
        "translation": "How is it called showing all the bodhisattva-mahāsattva practices because it doesn't see all the bodhisattva-mahāsattva practices?",
        "source": "T06n0220_306:0562c16_9"
    },
    {
        "source_sentence": "「云何不見諸佛無上正等菩提故名示諸佛無上正等菩提相？」",
        "translation": "How does it not see the unsurpassed correct perfect enlightenment of the buddhas and therefore be called showing the characteristics of the unsurpassed correct perfect enlightenment of the buddhas?",
        "source": "T06n0220_306:0562c18_10"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 6",
        "source": "T06n0220_306:0562c20_0"
    }
]