[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 8",
        "source": "T06n0220_387:0998c08_0"
    },
    {
        "source_sentence": "十七",
        "translation": "17.",
        "source": "T06n0220_387:0998c09_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_387:0998c11_0"
    },
    {
        "source_sentence": "初分不可動品第七十之二",
        "translation": "The Seventy-second and Second Part of the First Part of the Immovable Chapter",
        "source": "T06n0220_387:0998c12_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_387:0998c13_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，依本性空教授教誡諸有情類令勤精進，",
        "translation": "These great enlightening beings practice the perfection of wisdom, teaching sentient beings according to their emptiness by relying on their own emptiness.",
        "source": "T06n0220_387:0998c13_1"
    },
    {
        "source_sentence": "作是言：『善男子！",
        "translation": "He said, 'Good man!",
        "source": "T06n0220_387:0998c15_0"
    },
    {
        "source_sentence": "汝於善法當勤精進，若修布施、淨戒、安忍、精進、靜慮、般若波羅蜜多時，",
        "translation": "When you cultivate generosity, pure morality, patience, effort, meditation, and the perfection of wisdom,",
        "source": "T06n0220_387:0998c15_1"
    },
    {
        "source_sentence": "於此諸法勿思惟二及不二相；",
        "translation": "In these things, do not contemplate dual or nondual characteristics.",
        "source": "T06n0220_387:0998c17_0"
    },
    {
        "source_sentence": "若修四靜慮、四無量、四無色定時，於此諸法勿思惟二及不二相；",
        "translation": "“When one cultivates the four meditations, the four immeasurable concentrations, and the four formless concentrations, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0998c17_1"
    },
    {
        "source_sentence": "若修四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支時，",
        "translation": "When he cultivates the four abodes of mindfulness, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path,",
        "source": "T06n0220_387:0998c19_2"
    },
    {
        "source_sentence": "於此諸法勿思惟二及不二相；",
        "translation": "In these things, do not contemplate dual or nondual characteristics.",
        "source": "T06n0220_387:0998c20_3"
    },
    {
        "source_sentence": "若修空、無相、無願解脫門時，於此諸法勿思惟二及不二相；",
        "translation": "When cultivating the liberation gate of emptiness, signlessness, and wishlessness, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0998c21_4"
    },
    {
        "source_sentence": "若住內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空時，",
        "translation": "If they abide in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all",
        "source": "T06n0220_387:0998c22_5"
    },
    {
        "source_sentence": "於此諸法勿思惟二及不二相；",
        "translation": "In these things, do not contemplate dual or nondual characteristics.",
        "source": "T06n0220_387:0998c26_6"
    },
    {
        "source_sentence": "若住真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界時，",
        "translation": "When he abides in the true nature, the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging dissimilarity, equality, freedom from arising, legality, the abiding of dharmas, reality, the space realm, and the inconceivable realm.",
        "source": "T06n0220_387:0998c26_7"
    },
    {
        "source_sentence": "於此諸法勿思惟二及不二相；",
        "translation": "In these things, do not contemplate dual or nondual characteristics.",
        "source": "T06n0220_387:0998c28_8"
    },
    {
        "source_sentence": "若住苦、集、滅、道聖諦時，於此諸法勿思惟二及不二相；",
        "translation": "When they abide in the noble truths of suffering, origination, cessation, and the path, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0998c29_9"
    },
    {
        "source_sentence": "若修八解脫、八勝處、九次第定、十遍處時，於此諸法勿思惟二及不二相；",
        "translation": "“When cultivating the eight liberations, the eight spheres of mastery, the nine graduated concentrations and the ten universal states, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0999a01_10"
    },
    {
        "source_sentence": "若修一切陀羅尼門、三摩地門時，於此諸法勿思惟二及不二相；",
        "translation": "When cultivating all the approaches of dhāraṇī and samādhi, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0999a03_11"
    },
    {
        "source_sentence": "若修極喜地、離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地時，",
        "translation": "When he cultivates the stage of ultimate bliss, the stage of freedom from defilement, the stage of emission of light, the stage of blazing wisdom, the stage of extreme difficulty overcoming, the stage of direct presence, the stage of distant action, the stage of immovability, the stage of good wisdom, and the stage of the cloud of dharmas,",
        "source": "T06n0220_387:0999a05_0"
    },
    {
        "source_sentence": "於此諸法勿思惟二及不二相；",
        "translation": "In these things, do not contemplate dual or nondual characteristics.",
        "source": "T06n0220_387:0999a06_1"
    },
    {
        "source_sentence": "若修五眼、六神通時，於此諸法勿思惟二及不二相；",
        "translation": "When cultivating the five eyes and six supernormal powers, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0999a07_2"
    },
    {
        "source_sentence": "若修佛十力、四無所畏、四無礙解、十八佛不共法時，於此諸法勿思惟二及不二相；",
        "translation": "When cultivating the ten powers of buddhas, the four fearlessnesses of buddhas, the four unhindered understandings, and the unique qualities of the eighteen buddhas, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0999a08_3"
    },
    {
        "source_sentence": "若修大慈、大悲、大喜、大捨時，於此諸法勿思惟二及不二相；",
        "translation": "“When cultivating great kindness, great compassion, great joy, and great equanimity, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0999a10_4"
    },
    {
        "source_sentence": "若修三十二大士相、八十隨好時，於此諸法勿思惟二及不二相；",
        "translation": "When cultivating the thirty-two marks and eighty secondary signs of greatness, do not contemplate dual or nondual characteristics in regard to these things.",
        "source": "T06n0220_387:0999a12_5"
    },
    {
        "source_sentence": "若修無忘失法、恒住捨性時，於此諸法勿思惟二及不二相；",
        "translation": "When cultivating the state of nonforgetfulness and always abiding in the state of equanimity, do not contemplate dual or nondual characteristics of these things.",
        "source": "T06n0220_387:0999a13_6"
    },
    {
        "source_sentence": "若修一切智、道相智、一切相智時，於此諸法勿思惟二及不二相；",
        "translation": "When cultivating omniscience, knowledge of the path and knowledge of all characteristics, do not contemplate dual or nondual aspects of these things.",
        "source": "T06n0220_387:0999a14_7"
    },
    {
        "source_sentence": "若修諸餘一切佛法時，於此諸法勿思惟二及不二相。",
        "translation": "When cultivating all the other buddha-teachings, don't contemplate two or non-two characteristics of these teachings when cultivating them.",
        "source": "T06n0220_387:0999a16_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_387:0999a17_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T06n0220_387:0999a17_10"
    },
    {
        "source_sentence": "如是諸法皆本性空，本性空理不應思惟二、不二故。』",
        "translation": "Thus, all dharmas are inherently empty, and the principle of inherent emptiness shouldn't be contemplated because they are two and not two.'",
        "source": "T06n0220_387:0999a17_11"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_387:0999a19_12"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多，方便善巧行菩薩行成熟有情，諸有情類既成熟已，",
        "translation": "The bodhisattva Mahāsattva cultivates the perfection of wisdom, skillfully practicing the bodhisattva practices to ripen sentient beings. Having matured those sentient beings,",
        "source": "T06n0220_387:0999a19_13"
    },
    {
        "source_sentence": "隨其所應漸次安立，或令住預流果，或令住一來果，或令住不還果，或令住阿羅漢果，",
        "translation": "They may cause them to abide in the state of stream-winner, or they may cause them to abide in the state of once-returner, or they may cause them to abide in the state of nonreturner, or they may cause them to abide in the state of arhat.",
        "source": "T06n0220_387:0999a21_14"
    },
    {
        "source_sentence": "或令住獨覺菩提，或令住菩薩摩訶薩位，或令住無上正等菩提。",
        "translation": "It might cause them to abide in the enlightenment of the solitary realizer, or it might cause them to abide in the bodhisattva-mahāsattva stage, or it might cause them to abide in unsurpassed perfect enlightenment.",
        "source": "T06n0220_387:0999a23_15"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_387:0999a25_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，從初發心成就如是方便善巧，由此方便善巧力故，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they accomplish such skillful means from the first arousal of their minds because of the power of this skillful means.",
        "source": "T06n0220_387:0999a25_1"
    },
    {
        "source_sentence": "見諸有情心多散動，於諸欲境不能寂靜，方便令入勝三摩地，謂作是言：『來！",
        "translation": "Seeing that the minds of sentient beings are often distracted and unable to be tranquil in the objects of desire, they skillfully cause them to enter a superior concentration, which is called saying, 'Come!'",
        "source": "T06n0220_387:0999a27_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T06n0220_387:0999a29_0"
    },
    {
        "source_sentence": "汝應修習勝三摩地，勿起散亂及等持想。",
        "translation": "You should cultivate superior samādhi and not give rise to distracting or equipoised thoughts.",
        "source": "T06n0220_387:0999a29_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_387:0999b01_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T06n0220_387:0999b01_3"
    },
    {
        "source_sentence": "是一切法皆本性空，本性空中無法可得、可名散亂或名一心。",
        "translation": "All dharmas are empty of their original nature, and there's nothing to be attained or called distracted or single-minded in the emptiness of their original nature.",
        "source": "T06n0220_387:0999b01_4"
    },
    {
        "source_sentence": "汝等若能住此勝定，所作善事皆速成滿，亦隨所欲住本性空。",
        "translation": "If you can abide in this superior concentration, all the good deeds you do will quickly become complete, and you'll also abide in emptiness by their original nature according to your desires.",
        "source": "T06n0220_387:0999b02_5"
    },
    {
        "source_sentence": "云何名為所作善事？",
        "translation": "What's called a good deed that's done?",
        "source": "T06n0220_387:0999b04_6"
    },
    {
        "source_sentence": "謂起勝淨身、語、意業，若修布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "It's the arousal of superior pure physical, verbal, and mental actions that cultivate generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T06n0220_387:0999b04_7"
    },
    {
        "source_sentence": "若修四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，若修空、無相、無願解脫門，",
        "translation": "If he cultivates the four abodes of mindfulness, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path, and if he cultivates the liberation gate of emptiness, signlessness, and wishlessness,",
        "source": "T06n0220_387:0999b06_8"
    },
    {
        "source_sentence": "若住內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "If they abide in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all",
        "source": "T06n0220_387:0999b08_9"
    },
    {
        "source_sentence": "若住真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "If they abide in the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging dissimilarity, equality, freedom from arising, legality, the abiding of dharmas, reality, space, and inconceivability,",
        "source": "T06n0220_387:0999b11_10"
    },
    {
        "source_sentence": "若住苦、集、滅、道聖諦，若修四靜慮、四無量、四無色定，若修八解脫、八勝處、九次第定、十遍處，",
        "translation": "If someone abides in the noble truths of suffering, arising, cessation, and the path, if they cultivate the four meditations, the four immeasurable concentrations, and the four formless concentrations, or if they cultivate the eight liberations, the eight superior abodes, the nine graduated concentrations, and the ten universal abodes,",
        "source": "T06n0220_387:0999b13_11"
    },
    {
        "source_sentence": "若修一切陀羅尼門、三摩地門，若趣菩薩正性離生，若修菩薩摩訶薩地，",
        "translation": "If he cultivates all the dhāraṇī teachings and samādhi teachings, if he goes to the bodhisattva's true nature of freedom from birth, and if he cultivates the bodhisattva-mahāsattva ground,",
        "source": "T06n0220_387:0999b15_12"
    },
    {
        "source_sentence": "若修五眼、六神通，若修佛十力、四無所畏、四無礙解、十八佛不共法，",
        "translation": "If you cultivate the five eyes and six supernatural powers, if you cultivate the ten powers of buddhahood, the four fearlessnesses, the four unhindered understandings, and the unique qualities of the eighteen buddhas,",
        "source": "T06n0220_387:0999b17_13"
    },
    {
        "source_sentence": "若修大慈、大悲、大喜、大捨，若修三十二大士相、八十隨好，若修無忘失法、恒住捨性，",
        "translation": "If they cultivate great kindness, great compassion, great pity, great joy, great equanimity, if they cultivate the thirty-two marks of greatness and the eighty-eight secondary signs, if they cultivate the principle of nonforgetfulness and constantly abide in the nature of equanimity,",
        "source": "T06n0220_387:0999b19_14"
    },
    {
        "source_sentence": "若修一切智、道相智、一切相智，若修聲聞道、獨覺道、菩薩道、如來道，",
        "translation": "If you cultivate omniscience, knowledge of the path and knowledge of all characteristics, if you cultivate the path of the disciples, the path of the solitary realizers, the path of enlightening beings, and the path of buddhas,",
        "source": "T06n0220_387:0999b20_15"
    },
    {
        "source_sentence": "若修預流果、一來果、不還果、阿羅漢果、獨覺菩提及佛無上正等菩提，",
        "translation": "If he cultivates the fruit of stream-entry, the fruit of once-returning, the fruit of nonreturning, the fruit of arhatship, the enlightenment of the solitary realizer, and the unsurpassed perfect enlightenment of buddhahood,",
        "source": "T06n0220_387:0999b22_16"
    },
    {
        "source_sentence": "若成熟有情，若嚴淨佛土。",
        "translation": "If they ripen sentient beings, if they adorn and purify the Buddha's land.",
        "source": "T06n0220_387:0999b24_17"
    },
    {
        "source_sentence": "如是一切勝淨善法，由勝定力皆速成辦，及隨所願住本性空。』",
        "translation": "Thus, all these excellent pure and good qualities are quickly accomplished by the power of superior concentration, and they abide in the emptiness of their original nature according to their wishes.'",
        "source": "T06n0220_387:0999b24_18"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_387:0999b26_19"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多，方便善巧為欲饒益諸有情故，從初發心乃至究竟，",
        "translation": "“When great enlightening beings practice the perfection of wisdom, they skillfully and skillfully apply themselves from the first determination for enlightenment up to the ultimate.",
        "source": "T06n0220_387:0999b26_20"
    },
    {
        "source_sentence": "求作善利常無間斷。",
        "translation": "They seek to create good benefits that are always and uninterruptedly stopped.",
        "source": "T06n0220_387:0999b28_21"
    },
    {
        "source_sentence": "為欲饒益諸有情故，從一佛土至一佛土，供養恭敬、尊重讚歎諸佛世尊，",
        "translation": "In order to benefit sentient beings, they go from one buddha-land to another, honoring and venerating the buddhas.",
        "source": "T06n0220_387:0999b28_22"
    },
    {
        "source_sentence": "於諸佛所聽受正法，捨身受身經無數劫，乃至無上正等菩提，於其中間終不忘失。",
        "translation": "He hears and accepts the right teaching from the buddhas, abandons his body and receives it for countless eons until he attains unsurpassed perfect enlightenment, never forgetting it.",
        "source": "T06n0220_387:0999c01_23"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:0999c03_24"
    },
    {
        "source_sentence": "是諸菩薩得陀羅尼，身、語、意根常無退減。",
        "translation": "These are the bodhisattvas who attain the dhāraṇī, whose body, speech, and mind faculties always don't regress.",
        "source": "T06n0220_387:0999c03_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_387:0999c04_26"
    },
    {
        "source_sentence": "是菩薩摩訶薩恒具善修一切智智，諸有所作能善思惟。",
        "translation": "This is the bodhisattva Mahāsattva who always well cultivates omniscience and knowledge and can skillfully contemplate whatever he does.",
        "source": "T06n0220_387:0999c04_27"
    },
    {
        "source_sentence": "由具善修一切智智，諸有所作能善思惟，於一切道悉能修習，謂聲聞道、若獨覺道、若菩薩道、若如來道、若勝天道、若勝人道、若諸菩薩勝神通道，",
        "translation": "Because they cultivate omniscience and knowledge, they can skillfully contemplate whatever they do. They are able to cultivate all paths: the paths of the disciples, the paths of the solitary realizers, the paths of the bodhisattvas, the paths of the buddhas, the paths leading to heaven, the paths leading to humans, and the paths leading to",
        "source": "T06n0220_387:0999c05_28"
    },
    {
        "source_sentence": "諸菩薩摩訶薩由此殊勝神通道故，常作饒益曾無退失。",
        "translation": "Because of this extraordinary spiritual path, the bodhisattvas and mahāsattvas always work to benefit others without ever retreating.",
        "source": "T06n0220_387:0999c09_29"
    },
    {
        "source_sentence": "是菩薩摩訶薩住此殊勝異熟神通，恒作有情勝利樂事，雖經諸趣生死輪迴，",
        "translation": "“Furthermore, these great enlightening beings who abide in this transcendent spiritual power of retribution always work for the benefit and welfare of sentient beings, even though they go through the courses of birth and death.",
        "source": "T06n0220_387:0999c10_30"
    },
    {
        "source_sentence": "而勝神通常無退減。",
        "translation": "But the superior spirits often don't regress.",
        "source": "T06n0220_387:0999c12_31"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T06n0220_387:0999c12_32"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多，住本性空方便善巧，能善利樂諸有情類。",
        "translation": "The bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom who abide in the emptiness of their original nature skillful means can skillfully benefit sentient beings.",
        "source": "T06n0220_387:0999c13_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_387:0999c14_1"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，從初發心成就如是方便善巧，由此方便善巧力故住本性空，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they accomplish such skillful means from the first arousal of mind that it's because of the power of skillful means that they abide in the emptiness of their original nature.",
        "source": "T06n0220_387:0999c15_0"
    },
    {
        "source_sentence": "見有情類智慧薄少，愚癡顛倒造諸惡業，方便引入勝智慧門，作是言：『善男子！",
        "translation": "Seeing sentient beings with weak wisdom and foolishly creating bad actions, they skillfully enter the gate of superior wisdom and say, 'Good man!",
        "source": "T06n0220_387:0999c17_1"
    },
    {
        "source_sentence": "應修般若波羅蜜多觀一切法本性空寂，汝等若能修此般若觀一切法本性皆空，",
        "translation": "You should cultivate the perfection of wisdom to contemplate the emptiness of the original nature of all dharmas. If you can cultivate this practice of wisdom to contemplate the emptiness of the original nature of all dharmas,",
        "source": "T06n0220_387:0999c19_2"
    },
    {
        "source_sentence": "諸所修行身、語、意業，皆趣甘露得甘露果，必以甘露而作後邊。",
        "translation": "All the bodily, verbal, and mental actions that are cultivated will all go to ambrosia and attain the fruit of ambrosia, and they'll surely make it a latter end with ambrosia.",
        "source": "T06n0220_387:0999c21_0"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T06n0220_387:0999c22_1"
    },
    {
        "source_sentence": "是一切法皆本性空，本性空中有情及法雖不可得，而所修行亦無退失。",
        "translation": "All dharmas are inherently empty, and although sentient beings and dharmas in the air of their original nature are unobtainable, there's no retrogression in what they cultivate.",
        "source": "T06n0220_387:0999c22_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_387:0999c24_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T06n0220_387:0999c24_4"
    },
    {
        "source_sentence": "本性空中無增減法、無增減者。",
        "translation": "In the original nature of emptiness, there's no increase or decrease in dharmas and no increase or decrease.",
        "source": "T06n0220_387:0999c24_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_387:0999c25_6"
    },
    {
        "source_sentence": "本性空理非有自性、非無自性，離諸分別絕諸戲論，故於此中無增無減，",
        "translation": "The principle of emptiness in its original nature is neither with an own-nature nor without an own-nature, and it's free of discrimination and cuts off conceptual elaborations; therefore, there's no increase or decrease here.",
        "source": "T06n0220_387:0999c25_7"
    },
    {
        "source_sentence": "由斯所作終無退失。",
        "translation": "Because of this, there's ultimately no retrogression in what they do.",
        "source": "T06n0220_387:0999c27_8"
    },
    {
        "source_sentence": "是故汝等應修般若波羅蜜多，觀本性空作所應作。』",
        "translation": "Therefore, you should cultivate the perfection of prajñāpāramitā and observe the emptiness of your original nature as what should be done.'",
        "source": "T06n0220_387:0999c27_9"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T06n0220_387:0999c29_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多，方便善巧教授教誡諸有情類，令修般若波羅蜜多觀本性空修諸善業。",
        "translation": "The bodhisattva Mahāsattva cultivates the perfection of wisdom, skillfully teaches and admonishes sentient beings to cultivate the perfection of wisdom, observes the emptiness of their original nature, and cultivates good actions.",
        "source": "T06n0220_387:0999c29_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1000a02_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩如是教授教誡有情修諸善業常無懈廢，所謂自常行十善業道，",
        "translation": "“Thus does the great enlightening being thus teach and instruct sentient beings to cultivate wholesome actions without laziness, which are called always practicing for themselves the ten wholesome paths of action.",
        "source": "T06n0220_387:1000a02_3"
    },
    {
        "source_sentence": "亦勸他常行十善業道；",
        "translation": "They also encourage others to always practice the ten wholesome courses of action.",
        "source": "T06n0220_387:1000a04_4"
    },
    {
        "source_sentence": "自常受持五戒，亦勸他常受持五戒；",
        "translation": "They themselves always observe the five precepts, and also encourage others to observe them.",
        "source": "T06n0220_387:1000a05_5"
    },
    {
        "source_sentence": "自常受持八戒，亦勸他常受持八戒；",
        "translation": "They themselves always observe the eight precepts, and also encourage others to observe them.",
        "source": "T06n0220_387:1000a06_0"
    },
    {
        "source_sentence": "自常受持出家戒，亦勸他常受持出家戒；",
        "translation": "They themselves always accept and keep the precepts for renunciation, and also encourage others to accept and keep them.",
        "source": "T06n0220_387:1000a06_1"
    },
    {
        "source_sentence": "自常修四靜慮，亦勸他常修四靜慮；",
        "translation": "They always cultivate the four meditations themselves, and also encourage others to always cultivate the four meditations.",
        "source": "T06n0220_387:1000a07_2"
    },
    {
        "source_sentence": "自常修四無量，亦勸他常修四無量；",
        "translation": "They always cultivate the four immeasurable ones themselves, and also encourage others to always cultivate the four immeasurable ones.",
        "source": "T06n0220_387:1000a08_3"
    },
    {
        "source_sentence": "自常修四無色定，亦勸他常修四無色定；",
        "translation": "They always cultivate the four formless concentrations themselves, and also encourage others to always cultivate the four formless concentrations.",
        "source": "T06n0220_387:1000a09_4"
    },
    {
        "source_sentence": "自常修四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "He always cultivates the four abodes of mindfulness, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_387:1000a10_5"
    },
    {
        "source_sentence": "亦勸他常修四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支；",
        "translation": "They also urge others to always cultivate the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path.",
        "source": "T06n0220_387:1000a11_6"
    },
    {
        "source_sentence": "自常修空、無相、無願解脫門，亦勸他常修空、無相、無願解脫門；",
        "translation": "He himself always cultivates the liberation door of emptiness, signlessness, and wishlessness. He also encourages others to always cultivate the liberation door of emptiness, signlessness, and wishlessness.",
        "source": "T06n0220_387:1000a13_7"
    },
    {
        "source_sentence": "自常修布施、淨戒、安忍、精進、靜慮、般若、方便善巧、妙願、力、智波羅蜜多，",
        "translation": "They themselves always cultivate generosity, pure morality, patience, patience, effort, meditation, wisdom, skillful means, skillful means, subtle vows, powers, and the perfection of knowledge.",
        "source": "T06n0220_387:1000a14_8"
    },
    {
        "source_sentence": "亦勸他常修布施、淨戒、安忍、精進、靜慮、般若、方便善巧、妙願、力、智波羅蜜多；",
        "translation": "They also exhort others to always practice generosity, pure morality, patience, patience, effort, meditation, wisdom, skill in means, skill in means, sublime vows, powers, and the transcendent knowledge.",
        "source": "T06n0220_387:1000a16_9"
    },
    {
        "source_sentence": "自常住內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They themselves always abide in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics, empti",
        "source": "T06n0220_387:1000a17_10"
    },
    {
        "source_sentence": "亦勸他常住內空乃至無性自性空；",
        "translation": "They also urge others to always abide in internal emptiness, up to the emptiness of their own natureless self-nature.",
        "source": "T06n0220_387:1000a21_11"
    },
    {
        "source_sentence": "自常住真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "They themselves always abide in the realm of truth, the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging and dissimilarity, equality, freedom from arising, legality, the abiding of phenomena, reality, space, and inconceivability.",
        "source": "T06n0220_387:1000a22_12"
    },
    {
        "source_sentence": "亦勸他常住真如乃至不思議界；",
        "translation": "They also urge others to always abide in the realm of reality, up to the inconceivable.",
        "source": "T06n0220_387:1000a24_13"
    },
    {
        "source_sentence": "自常住苦、集、滅、道聖諦，亦勸他常住苦、集、滅、道聖諦；",
        "translation": "They themselves always abide in the noble truths of suffering, arising, cessation, and the path. They also encourage others to always abide in the noble truths of suffering, arising, cessation, and the path.",
        "source": "T06n0220_387:1000a25_0"
    },
    {
        "source_sentence": "自常修八解脫、八勝處、九次第定、十遍處，亦勸他常修八解脫、八勝處、九次第定、十遍處；",
        "translation": "He himself always cultivates the eight liberations, the eight spheres of mastery, the nine graduated concentrations and ten universal states. He also encourages others to always cultivate the eight liberations, the eight spheres of mastery, the nine graduated concentrations and ten universal states.",
        "source": "T06n0220_387:1000a26_1"
    },
    {
        "source_sentence": "自常修一切陀羅尼門、三摩地門，亦勸他常修一切陀羅尼門、三摩地門；",
        "translation": "He himself always cultivates all aspects of mental command and concentration, and also encourages others to always cultivate all aspects of mental command and concentration.",
        "source": "T06n0220_387:1000a28_2"
    },
    {
        "source_sentence": "自常修諸菩薩地，亦勸他常修諸菩薩地；",
        "translation": "They always cultivate the stages of enlightening beings themselves, and also encourage others to always cultivate the stages of enlightenment.",
        "source": "T06n0220_387:1000a29_3"
    },
    {
        "source_sentence": "自常學五眼、六神通，亦勸他常學五眼、六神通；",
        "translation": "They always study the five eyes and six supernatural powers for themselves, and also encourage others to always study the five eyes and six supernatural powers.",
        "source": "T06n0220_387:1000b01_4"
    },
    {
        "source_sentence": "自常學佛十力、四無所畏、四無礙解、十八佛不共法，亦勸他常學佛十力、四無所畏、四無礙解、十八佛不共法；",
        "translation": "They themselves always study the ten powers, four fearlessnesses, four unhindered understandings, and eighteen unique qualities of buddhahood. They also encourage others to always study the ten powers, four fearlessnesses, four unhindered understandings, and eighteen unique qualities of buddhahood.",
        "source": "T06n0220_387:1000b02_5"
    },
    {
        "source_sentence": "自常學大慈、大悲、大喜、大捨，亦勸他常學大慈、大悲、大喜、大捨；",
        "translation": "They themselves always practice great benevolence, great compassion, great joy and great equanimity. They also encourage others to always practice great benevolence, great compassion, great joy and great equanimity.",
        "source": "T06n0220_387:1000b05_6"
    },
    {
        "source_sentence": "自常學三十二大士相、八十隨好，亦勸他常學三十二大士相、八十隨好；",
        "translation": "He himself always studied the thirty-two marks and eighty secondary signs of a great personage. He also encouraged others to always study the thirty-two marks and eighty secondary signs of a great personage.",
        "source": "T06n0220_387:1000b06_7"
    },
    {
        "source_sentence": "自常學無忘失法、恒住捨性，亦勸他常學無忘失法、恒住捨性；",
        "translation": "They themselves always study the principle of nonforgetfulness and always abide in equanimity. They also encourage others to always study the principle of nonforgetfulness and always abide in equanimity.",
        "source": "T06n0220_387:1000b08_8"
    },
    {
        "source_sentence": "自常學一切智、道相智、一切相智；",
        "translation": "They always study for themselves omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T06n0220_387:1000b09_9"
    },
    {
        "source_sentence": "亦勸他常學一切智、道相智、一切相智；",
        "translation": "They also encourage others to always study omniscience, knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_387:1000b10_10"
    },
    {
        "source_sentence": "自常起預流果智而不住其中，亦常勸他起預流果智或令安住；",
        "translation": "They always produce knowledge of the fruit of stream-entry themselves, but do not abide in it. They also always encourage others to produce knowledge of the fruit of stream-entry, or enable them to abide therein.",
        "source": "T06n0220_387:1000b11_11"
    },
    {
        "source_sentence": "自常起一來、不還、阿羅漢果智而不住其中，亦常勸他起一來、不還、阿羅漢果智或令安住；",
        "translation": "The enlightening beings themselves always produce the knowledge of once-returning, nonreturning, and arhatship, but do not dwell in them; they also always encourage others to produce the knowledge of once-returning, nonreturning, and arhatship, or make them abide peaceful abode.",
        "source": "T06n0220_387:1000b12_12"
    },
    {
        "source_sentence": "自常起獨覺菩提智而不住其中，亦常勸他起獨覺菩提智或令安住；",
        "translation": "They themselves always produce the knowledge of enlightenment of individually awakened ones, but do not abide in it. They also always encourage others to produce the knowledge of enlightenment of individually awakened ones and sometimes cause them to abide peacefully.",
        "source": "T06n0220_387:1000b14_13"
    },
    {
        "source_sentence": "自常起無上正等菩提行道，亦勸他常起無上正等菩提行道。",
        "translation": "They always give rise to the practice of unsurpassed correct perfect enlightenment on their own, and they also encourage others to always give rise to the practice of unsurpassed correct perfect enlightenment.",
        "source": "T06n0220_387:1000b16_14"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_387:1000b17_15"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，方便善巧自修善業常無懈廢，教授教誡諸有情類令修善業常無懈廢。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they skillfully cultivate good actions for themselves with skillful means that are always unremitting, and they teach and admonish sentient beings to cultivate good actions without laziness.",
        "source": "T06n0220_387:1000b18_16"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_387:1000b20_17"
    },
    {
        "source_sentence": "是名諸菩薩摩訶薩修行般若波羅蜜多時方便善巧。",
        "translation": "This is called the skillful means for bodhisattvas and mahāsattvas to cultivate the perfection of wisdom when they practice the perfection of wisdom.",
        "source": "T06n0220_387:1000b20_18"
    },
    {
        "source_sentence": "諸菩薩摩訶薩由此方便善巧力故，安立有情於實際中，而能不壞實際之相。」",
        "translation": "Because of the skillfulness of this method, bodhisattvas and mahāsattvas establish sentient beings in reality and are able to not destroy the characteristics of reality.",
        "source": "T06n0220_387:1000b22_19"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_387:1000b24_0"
    },
    {
        "source_sentence": "若一切法皆本性空，本性空中有情及法俱不可得，由此於中亦無非法，",
        "translation": "If all dharmas are inherently empty, neither sentient beings nor dharmas in the emptiness of their original nature can be obtained. Therefore, there is no unlawfulness in them.",
        "source": "T06n0220_387:1000b24_1"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為諸有情求證無上正等菩提常作饒益？」",
        "translation": "How does a bodhisattva-mahāsattva always work for the benefit of sentient beings who seek to realize unsurpassed perfect enlightenment?",
        "source": "T06n0220_387:1000b26_2"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T06n0220_387:1000b27_3"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_387:1000b28_0"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_387:1000b28_1"
    },
    {
        "source_sentence": "諸所有法皆本性空，本性空中有情及法俱不可得，由此於中亦無非法。",
        "translation": "All dharmas are inherently empty, and neither sentient beings nor dharmas in the emptiness of their original nature can be obtained, so there's nothing unlawful about them.",
        "source": "T06n0220_387:1000b28_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_387:1000c01_3"
    },
    {
        "source_sentence": "若一切法本性不空，諸菩薩摩訶薩修行般若波羅蜜多時，不應安住本性空理，",
        "translation": "If the original nature of all dharmas isn't empty, then when bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they shouldn't abide in the principle that the original nature is empty.",
        "source": "T06n0220_387:1000c01_4"
    },
    {
        "source_sentence": "修證無上正等菩提，為饒益有情說本性空法。",
        "translation": "Cultivating and realizing unsurpassed perfect enlightenment, he explains the teaching of emptiness in its original nature for the benefit of sentient beings.",
        "source": "T06n0220_387:1000c03_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_387:1000c04_6"
    },
    {
        "source_sentence": "以一切法皆本性空，是故菩薩摩訶薩修行般若波羅蜜多時，住一切法本性空理，",
        "translation": "Because all things are inherently empty, therefore when the bodhisattva Mahāsattva cultivates the perfection of wisdom, he abides in the principle that all things are inherently empty.",
        "source": "T06n0220_387:1000c04_7"
    },
    {
        "source_sentence": "修證無上正等菩提，為饒益有情說本性空法。",
        "translation": "Cultivating and realizing unsurpassed perfect enlightenment, he explains the teaching of emptiness in its original nature for the benefit of sentient beings.",
        "source": "T06n0220_387:1000c06_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1000c07_9"
    },
    {
        "source_sentence": "何等諸法本性皆空，菩薩摩訶薩修行般若波羅蜜多時，如實了知本性空已，",
        "translation": "“What is the emptiness of the essential nature of all things? When great enlightening beings practice the perfection of wisdom, they truly know the emptiness of their essential nature.",
        "source": "T06n0220_387:1000c07_10"
    },
    {
        "source_sentence": "住本性空為他說法？",
        "translation": "They abide in the emptiness of their original nature and teach others?",
        "source": "T06n0220_387:1000c09_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1000c09_12"
    },
    {
        "source_sentence": "色本性空，受、想、行、識本性空。",
        "translation": "The original nature of form is empty, and the original natures of feeling, perception, volition, and consciousness are empty.",
        "source": "T06n0220_387:1000c09_13"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是諸蘊本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they truly understand the emptiness of the original nature of these aggregates as they are when they abide in the emptiness of their original nature and explain to sentient beings the emptiness of such an original nature for them.",
        "source": "T06n0220_387:1000c10_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1000c12_15"
    },
    {
        "source_sentence": "眼處本性空，耳、鼻、舌、身、意處本性空；",
        "translation": "The sense-field of vision is inherently void, while the sense-fields of ear, nose, tongue, body, and mind are inherently void.",
        "source": "T06n0220_387:1000c13_16"
    },
    {
        "source_sentence": "色處本性空，聲、香、味、觸、法處本性空。",
        "translation": "The original nature of the form realm is empty, and the original natures of sound, odor, taste, touch, and dharmas are empty.",
        "source": "T06n0220_387:1000c13_17"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是諸處本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they truly understand the emptiness of the original nature of such places, and when they abide in the emptiness of their original nature, they explain to sentient beings this teaching of the emptiness of their original nature as emptiness.",
        "source": "T06n0220_387:1000c14_18"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1000c17_19"
    },
    {
        "source_sentence": "眼界本性空，耳、鼻、舌、身、意界本性空；",
        "translation": "The element eye is inherently void, while the elements ear, nose, tongue, body, and mind are inherently void.",
        "source": "T06n0220_387:1000c17_20"
    },
    {
        "source_sentence": "色界本性空，聲、香、味、觸、法界本性空；",
        "translation": "The original nature of the realm of form is empty, while the original natures of sound, smell, taste, touch and dharmas are empty.",
        "source": "T06n0220_387:1000c18_21"
    },
    {
        "source_sentence": "眼識界本性空，耳、鼻、舌、身、意識界本性空；",
        "translation": "The element consciousness of the eye is inherently void, while the elements ear, nose, tongue, body, and mind are inherently void.",
        "source": "T06n0220_387:1000c19_22"
    },
    {
        "source_sentence": "眼觸本性空，耳、鼻、舌、身、意觸本性空；",
        "translation": "The original nature of eye contact is void, while the original natures of ear, nose, tongue, body, and mind contact are void.",
        "source": "T06n0220_387:1000c20_0"
    },
    {
        "source_sentence": "眼觸為緣所生諸受本性空，耳、鼻、舌、身、意觸為緣所生諸受本性空；",
        "translation": "The original nature of all sensations that arise from visual contact as supporting object is void, while the original nature of all sensations that arise from ear, nose, tongue, body, and mind contact as supporting object is void.",
        "source": "T06n0220_387:1000c20_1"
    },
    {
        "source_sentence": "地界本性空，水、火、風、空、識界本性空。",
        "translation": "The earth realm is inherently empty, and the water, fire, wind, space, and consciousness realms are inherently empty.",
        "source": "T06n0220_387:1000c22_2"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是諸界本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When the bodhisattva Mahāsattva cultivates the perfection of wisdom, he truly understands the emptiness of the original nature of these elements as they are and explains the emptiness of this original nature to sentient beings while abiding in the emptiness of their original nature.",
        "source": "T06n0220_387:1000c23_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1000c25_4"
    },
    {
        "source_sentence": "因緣本性空，等無間緣、所緣緣、增上緣本性空；",
        "translation": "The original nature of causes and conditions is void, while the similar and immediately antecedent conditions, the condition as supporting object and the condition as dominant condition are inherently void.",
        "source": "T06n0220_387:1000c25_5"
    },
    {
        "source_sentence": "從緣所生諸法本性空；",
        "translation": "The essential nature of all dharmas that arise from conditions is void.",
        "source": "T06n0220_387:1000c26_6"
    },
    {
        "source_sentence": "無明本性空，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱本性空。",
        "translation": "The original nature of nescience is empty, and the original natures of volition, consciousness, name-and-form, the six sense-fields, touch, sensation, feeling, craving, apprehension, existence, birth, old age, grief, pain, sorrow, pain, and vexation are empty.",
        "source": "T06n0220_387:1000c27_7"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是緣起本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they truly understand the emptiness of the original nature of conditioned arising as it is and explain the emptiness of such an original nature to sentient beings who abide in the emptiness of their original nature.",
        "source": "T06n0220_387:1000c28_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001a02_9"
    },
    {
        "source_sentence": "布施波羅蜜多本性空，淨戒、安忍、精進、靜慮、般若、方便善巧、妙願、力、智波羅蜜多本性空。",
        "translation": "The original nature of the perfection of generosity is empty, and the original nature of the perfections of pure morality, patience, effort, meditation, prajñā, skillful means, marvelous aspiration, power, and wisdom are empty.",
        "source": "T06n0220_387:1001a02_10"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知諸到彼岸本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they truly understand the emptiness of the original nature of those who reach the other shore and explain such an emptiness of the original nature to sentient beings when they abide in the emptiness of the original nature.",
        "source": "T06n0220_387:1001a04_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001a07_0"
    },
    {
        "source_sentence": "四靜慮本性空，四無量、四無色定本性空。",
        "translation": "The original nature of the four meditations is empty, and the original natures of the four immeasurable and four formless concentrations are empty.",
        "source": "T06n0220_387:1001a07_1"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是靜慮、無量、無色本性空已，",
        "translation": "“When great enlightening beings practice the prajñāpāramitā, they truly know as it is the emptiness of the essence of meditation, immeasurable concentration, and formlessness.",
        "source": "T06n0220_387:1001a08_2"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001a09_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001a10_4"
    },
    {
        "source_sentence": "四念住本性空，四正斷、四神足、五根、五力、七等覺支、八聖道支本性空。",
        "translation": "The original nature of the four abodes of mindfulness is empty, and the original nature of the fourfold correctly eliminated, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are empty.",
        "source": "T06n0220_387:1001a10_5"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知四念住等菩提分法本性空已，",
        "translation": "When the bodhisattva Mahāsattva cultivates the perfection of wisdom, he truly understands the emptiness of the original nature of the four abodes of mindfulness and so forth as factors of enlightenment,",
        "source": "T06n0220_387:1001a12_6"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001a14_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001a15_8"
    },
    {
        "source_sentence": "空解脫門本性空，無相、無願解脫門本性空。",
        "translation": "The gate of liberation through emptiness is inherently empty, and the gate of liberation through signlessness and wishlessness is inherently empty.",
        "source": "T06n0220_387:1001a15_9"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知諸解脫門本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they truly understand the emptiness of the original nature of the gates of liberation and explain such an emptiness of the original nature to sentient beings when they abide in the emptiness of their original nature.",
        "source": "T06n0220_387:1001a16_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001a18_11"
    },
    {
        "source_sentence": "內空本性空，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空本性空。",
        "translation": "The original nature of internal emptiness is emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics,",
        "source": "T06n0220_387:1001a19_0"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是空性本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they truly understand that the original nature of emptiness is thus empty, and after abiding in the emptiness of their original nature, they proclaim to sentient beings the teaching of the emptiness of their original nature as emptiness.",
        "source": "T06n0220_387:1001a22_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001a25_2"
    },
    {
        "source_sentence": "苦聖諦本性空，集、滅、道聖諦本性空。",
        "translation": "The original nature of the noble truth of suffering is empty, and the original natures of the noble truths of arising, ceasing, and the path are empty.",
        "source": "T06n0220_387:1001a25_3"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是聖諦本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they truly understand the emptiness of the original nature of these noble truths as they are and explain the emptiness of their original nature to sentient beings for them.",
        "source": "T06n0220_387:1001a26_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001a29_0"
    },
    {
        "source_sentence": "八解脫本性空，八勝處、九次第定、十遍處本性空。",
        "translation": "The original nature of the eight liberations is empty, and the original natures of the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are empty.",
        "source": "T06n0220_387:1001a29_1"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知解脫、勝處、諸定、遍處本性空已，",
        "translation": "“When great enlightening beings practice the prajñāpāramitā, they truly know that liberation, the supreme state, concentration, and all-pervading states are inherently empty.",
        "source": "T06n0220_387:1001b01_2"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001b03_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001b03_1"
    },
    {
        "source_sentence": "一切陀羅尼門本性空，一切三摩地門本性空。",
        "translation": "The original nature of all dhāraṇī teachings is empty, and the original nature of all samādhi teachings is empty.",
        "source": "T06n0220_387:1001b04_2"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知陀羅尼門、三摩地門本性空已，",
        "translation": "When the bodhisattva Mahāsattva cultivates the perfection of wisdom, he truly knows that the dhāraṇī teachings and samādhi teachings are inherently empty.",
        "source": "T06n0220_387:1001b05_3"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001b06_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001b07_5"
    },
    {
        "source_sentence": "菩薩極喜地本性空，菩薩離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地本性空。",
        "translation": "The original nature of the bodhisattva's ground of ultimate bliss is empty, and the original nature of the bodhisattva's ground of freedom from defilement, ground of arousal of light, ground of burning wisdom, ground of extreme difficulty overcoming, ground of direct presence, ground of distant practice, ground of immovability, ground of good wisdom, ground of",
        "source": "T06n0220_387:1001b07_6"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知菩薩諸地本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they truly know that the original nature of the bodhisattva stages is empty, and they abide in the emptiness of their original nature and proclaim such an essential emptiness to sentient beings.",
        "source": "T06n0220_387:1001b10_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001b12_8"
    },
    {
        "source_sentence": "五眼本性空，六神通本性空。",
        "translation": "The five eyes are inherently empty, and the six psychic powers are inherently empty.",
        "source": "T06n0220_387:1001b12_9"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知諸眼、神通本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they truly understand the emptiness of the original nature of the eye and psychic powers when they abide in the emptiness of their original nature and explain such an emptiness of their original nature to sentient beings.",
        "source": "T06n0220_387:1001b13_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001b16_0"
    },
    {
        "source_sentence": "佛十力本性空，四無所畏、四無礙解、十八佛不共法本性空。",
        "translation": "The original nature of the Buddha's ten powers is empty, and the four fearlessnesses, four unhindered understandings, and 18 Buddha-uncommon dharmas are empty in their original nature.",
        "source": "T06n0220_387:1001b16_1"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知諸力、無畏、無礙解、不共法本性空已，",
        "translation": "When the bodhisattva Mahāsattva cultivates the perfection of wisdom, he truly understands the emptiness of the essence of powers, fearlessness, unhindered understanding, and unique qualities.",
        "source": "T06n0220_387:1001b17_2"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001b19_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001b20_4"
    },
    {
        "source_sentence": "大慈本性空，大悲、大喜、大捨本性空。",
        "translation": "Great compassion is inherently empty, and great compassion, great joy, and great equanimity are inherently empty.",
        "source": "T06n0220_387:1001b20_5"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知諸大無量本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they truly understand the emptiness of the great immeasurable original natures as they are when they abide in the emptiness of their original natures and explain to sentient beings this teaching of the emptiness of their original natures.",
        "source": "T06n0220_387:1001b21_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001b23_7"
    },
    {
        "source_sentence": "三十二大士相本性空，八十隨好本性空。",
        "translation": "The original nature of the thirty-two marks of greatness is empty, and the original nature of the eighty secondary signs is empty.",
        "source": "T06n0220_387:1001b23_8"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知諸相、隨好本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they truly understand the emptiness of the original nature of marks and secondary signs when they cultivate the perfection of wisdom, and they abide in the emptiness of their original nature and explain such an emptiness of their original nature to sentient beings.",
        "source": "T06n0220_387:1001b24_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001b27_10"
    },
    {
        "source_sentence": "無忘失法本性空，恒住捨性本性空。",
        "translation": "The original nature of nonforgetfulness and the original nature of dharmas are empty, and the original nature of constantly abiding equanimity is empty.",
        "source": "T06n0220_387:1001b27_11"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知無忘失法、恒住捨性本性空已，",
        "translation": "When the bodhisattva Mahāsattva cultivates the perfection of wisdom, he truly understands the emptiness of the dharmas without forgetfulness and the emptiness of the nature of equanimity that always abide in equanimity.",
        "source": "T06n0220_387:1001b28_12"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001c01_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001c01_1"
    },
    {
        "source_sentence": "一切智本性空，道相智、一切相智本性空。",
        "translation": "The original nature of omniscience is empty, and the original natures of knowledge of the path and knowledge of all characteristics are empty.",
        "source": "T06n0220_387:1001c02_2"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知如是諸智本性空已，住本性空為諸有情宣說如是本性空法。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they truly understand the emptiness of the original nature of these knowledges as they are when they abide in the emptiness of their original nature and explain to sentient beings the emptiness of such an original nature for them.",
        "source": "T06n0220_387:1001c03_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001c05_1"
    },
    {
        "source_sentence": "預流果本性空，一來、不還、阿羅漢果、獨覺菩提本性空。",
        "translation": "The original nature of the fruit of pre-flow is empty, and the original natures of once-returning, nonreturning, arhatship, and solitary realizer enlightenment are empty.",
        "source": "T06n0220_387:1001c05_2"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知聲聞乘果、獨覺菩提本性空已，",
        "translation": "“When great enlightening beings practice the prajñāpāramitā, they truly know the emptiness of the original nature of the fruit of the vehicle of śrāvakas and solitary realizers’ enlightenment.",
        "source": "T06n0220_387:1001c06_3"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001c08_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1001c09_5"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行本性空，諸佛無上正等菩提本性空，永斷一切煩惱習氣相續本性空。",
        "translation": "The original nature of all bodhisattva-mahāsattva practices is empty, the original nature of unsurpassed perfect enlightenment of the buddhas is empty, and the original nature of the continuity of all afflictive habit energy that permanently ends all afflictions is empty.",
        "source": "T06n0220_387:1001c09_6"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知諸菩薩行、菩提、涅槃本性空已，",
        "translation": "“When great enlightening beings practice the prajñāpāramitā, they truly know the emptiness of the essential nature of enlightening beings’ practices, enlightenment, and nirvana.",
        "source": "T06n0220_387:1001c11_7"
    },
    {
        "source_sentence": "住本性空為諸有情宣說如是本性空法。",
        "translation": "He abides in the emptiness of his original nature and proclaims to sentient beings such a teaching of emptiness of his original nature.",
        "source": "T06n0220_387:1001c13_8"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_387:1001c15_0"
    },
    {
        "source_sentence": "若內空性本性不空，若外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空性亦本性不空者，",
        "translation": "If internal emptiness is inherently nonempty, and if external emptiness, internal emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature, emptiness of shared characteristics, emp",
        "source": "T06n0220_387:1001c15_1"
    },
    {
        "source_sentence": "則諸菩薩摩訶薩修行般若波羅蜜多時，不應為諸有情說一切法皆本性空，",
        "translation": "Then, when bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they shouldn't teach sentient beings that all things are inherently empty.",
        "source": "T06n0220_387:1001c19_2"
    },
    {
        "source_sentence": "若作是說壞本性空。",
        "translation": "If someone does this, they'll say that the originally destroyed nature is empty.",
        "source": "T06n0220_387:1001c21_3"
    },
    {
        "source_sentence": "然本性空理不可壞，非常非斷。",
        "translation": "However, the principle of emptiness in its original nature can't be destroyed, and it's neither permanent nor eliminated.",
        "source": "T06n0220_387:1001c21_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_387:1001c22_5"
    },
    {
        "source_sentence": "本性空理無方無處，無所從來亦無所去。",
        "translation": "The principle of emptiness in its original nature has no direction, no location, no place, and no origin or departure.",
        "source": "T06n0220_387:1001c22_6"
    },
    {
        "source_sentence": "如是空理亦名法住，是中無法、無聚無散、無減無增、無生無滅、無染無淨，",
        "translation": "Thus, the principle of emptiness is also called the abode of dharmas, which are nonexistent, without accumulation or disintegration, without decrease or increase, without arising or ceasing, without defilement or purity.",
        "source": "T06n0220_387:1001c23_7"
    },
    {
        "source_sentence": "是一切法本所住性，諸菩薩摩訶薩安住其中，求趣無上正等菩提，不見諸法有所發趣、無所發趣，",
        "translation": "It is the fundamental dwelling of all things. The great enlightening beings abide in it, seeking to attain unexcelled perfect enlightenment; they do not see anything that sets out for enlightenment or anything that sets out for enlightenment.",
        "source": "T06n0220_387:1001c25_8"
    },
    {
        "source_sentence": "以一切法都無所住故名法住。",
        "translation": "It's because all dharmas lack anything to abide in, so it's called the Dharma abode.",
        "source": "T06n0220_387:1001c27_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩安住此中修行般若波羅蜜多，見一切法本性空已，定於無上正等菩提得不退轉。",
        "translation": "After seeing the emptiness of the original nature of all dharmas, bodhisattvas and mahāsattvas who abide here and cultivate the perfection of prajñāpāramitā will surely attain unsurpassed perfect enlightenment without regressing.",
        "source": "T06n0220_387:1001c28_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_387:1002a01_11"
    },
    {
        "source_sentence": "是菩薩摩訶薩不見有法能為障礙，見一切法無障礙故，便於無上正等菩提不生疑惑，",
        "translation": "Because these great enlightening beings do not see anything as an obstacle, and because they see all things as unobstructed, they do not give rise to doubt or confusion in regard to supreme perfect enlightenment.",
        "source": "T06n0220_387:1002a01_12"
    },
    {
        "source_sentence": "是故不退。",
        "translation": "Therefore, they don't regress.",
        "source": "T06n0220_387:1002a03_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_387:1002a03_14"
    },
    {
        "source_sentence": "本性空中我不可得，有情不可得，有情施設不可得，命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、使作者、起者、使起者、受者、使受者、知者、見者亦不可得。",
        "translation": "The self in the emptiness of original nature is unobtainable, sentient beings are unobtainable, and sentient beings' designations are unobtainable, and neither is the life, birth, nurturing, person, personality, pudgala, mind-made, youth, author, messenger, creator, arising, messenger, recipient, messenger, knower, and view",
        "source": "T06n0220_387:1002a04_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a07_16"
    },
    {
        "source_sentence": "本性空中色不可得，受、想、行、識亦不可得。",
        "translation": "Form in the emptiness of its original nature is unobtainable, and so are feeling, perception, volition, and consciousness.",
        "source": "T06n0220_387:1002a07_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a08_18"
    },
    {
        "source_sentence": "本性空中眼處不可得，耳、鼻、舌、身、意處亦不可得。",
        "translation": "The sense-field of the eye in the sky of the original nature is unobtainable, and so are the ear, nose, tongue, body, and mind sense-fields.",
        "source": "T06n0220_387:1002a08_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a09_20"
    },
    {
        "source_sentence": "本性空中色處不可得，聲、香、味、觸、法處亦不可得。",
        "translation": "The form realm in the original nature of space is unobtainable, and so are sounds, smells, tastes, tactile sensations, and dharmas.",
        "source": "T06n0220_387:1002a10_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a11_1"
    },
    {
        "source_sentence": "本性空中眼界不可得，耳、鼻、舌、身、意界亦不可得。",
        "translation": "The element of the eye in the sky of the original nature is unobtainable, and the ear, nose, tongue, body, and mind realms are also unobtainable.",
        "source": "T06n0220_387:1002a11_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a12_3"
    },
    {
        "source_sentence": "本性空中色界不可得，聲、香、味、觸、法界亦不可得。",
        "translation": "The form realm in the emptiness of the original nature is unobtainable, and so are sound, odor, taste, touch, and the Dharma realm.",
        "source": "T06n0220_387:1002a12_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a13_5"
    },
    {
        "source_sentence": "本性空中眼識界不可得，耳、鼻、舌、身、意識界亦不可得。",
        "translation": "The element of eye consciousness in the originally empty sky is unobtainable, and so are the elements of ear, nose, tongue, body, and consciousness.",
        "source": "T06n0220_387:1002a13_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a15_7"
    },
    {
        "source_sentence": "本性空中眼觸不可得，耳、鼻、舌、身、意觸亦不可得。",
        "translation": "Eye contact in the air of the original nature is unobtainable, and so are ear, nose, tongue, body, and mind contact.",
        "source": "T06n0220_387:1002a15_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a16_9"
    },
    {
        "source_sentence": "本性空中眼觸為緣所生諸受不可得，耳、鼻、舌、身、意觸為緣所生諸受亦不可得。",
        "translation": "The sensations that arise from eye contact as a condition in the original nature of emptiness are unobtainable, and the sensations that arise from ear, nose, tongue, body, and mind contact as a condition are also unobtainable.",
        "source": "T06n0220_387:1002a16_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a18_11"
    },
    {
        "source_sentence": "本性空中地界不可得，水、火、風、空、識界亦不可得。",
        "translation": "The earth realm in the sky of the original nature is unobtainable, and so are water, fire, wind, air, space, and consciousness realms.",
        "source": "T06n0220_387:1002a18_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a19_13"
    },
    {
        "source_sentence": "本性空中因緣不可得，等無間緣、所緣緣、增上緣亦不可得。",
        "translation": "The causes and conditions in the emptiness of the original nature are unobtainable, and so are the equal and immediately antecedent conditions, the perceptual conditions, and the dominant conditions.",
        "source": "T06n0220_387:1002a19_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a21_0"
    },
    {
        "source_sentence": "本性空中從緣所生諸法皆不可得。",
        "translation": "The dharmas that arise from conditions in the emptiness of their original nature are all unobtainable.",
        "source": "T06n0220_387:1002a21_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a21_2"
    },
    {
        "source_sentence": "本性空中無明不可得，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱亦不可得。",
        "translation": "The nescience in the emptiness of the original nature is unobtainable, and so are form, consciousness, name-and-form, the six sense-fields, touch, sensation, feeling, craving, apprehension, existence, birth, old age, sorrow, pain, and vexation.",
        "source": "T06n0220_387:1002a22_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a23_4"
    },
    {
        "source_sentence": "本性空中布施波羅蜜多不可得，淨戒、安忍、精進、靜慮、般若波羅蜜多亦不可得。",
        "translation": "The perfection of generosity in the emptiness of the original nature is unobtainable, and so are the perfections of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T06n0220_387:1002a24_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002a25_6"
    },
    {
        "source_sentence": "本性空中內空不可得，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空亦不可得。",
        "translation": "In the emptiness of the original nature, internal emptiness is unobtainable, and external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of the original nature, emptiness of self-nature,",
        "source": "T06n0220_387:1002a26_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b01_1"
    },
    {
        "source_sentence": "本性空中四念住不可得，四正斷、四神足、五根、五力、七等覺支、八聖道支亦不可得。",
        "translation": "The four abodes of mindfulness in the emptiness of the original nature are unobtainable, and the fourfold correctly eliminated, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, and eight noble factors of the path are also unobtainable.",
        "source": "T06n0220_387:1002b01_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b03_3"
    },
    {
        "source_sentence": "本性空中苦聖諦不可得，集、滅、道聖諦亦不可得。",
        "translation": "The noble truth of suffering in the emptiness of original nature is unobtainable, and so are the noble truths of arising, ceasing, and the path.",
        "source": "T06n0220_387:1002b03_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b04_5"
    },
    {
        "source_sentence": "本性空中四靜慮不可得，四無量、四無色定亦不可得。",
        "translation": "The four meditations in the emptiness of the original nature are unobtainable, and the four immeasurable and four formless concentrations are also unobtainable.",
        "source": "T06n0220_387:1002b04_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b05_7"
    },
    {
        "source_sentence": "本性空中八解脫不可得，八勝處、九次第定、十遍處亦不可得。",
        "translation": "The eight liberations in the sky of the original nature are unobtainable, and the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are also unobtainable.",
        "source": "T06n0220_387:1002b05_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b07_9"
    },
    {
        "source_sentence": "本性空中一切陀羅尼門不可得，一切三摩地門亦不可得。",
        "translation": "All the dhāraṇī teachings in the air of the original nature are unobtainable, and all the samādhi teachings are also unobtainable.",
        "source": "T06n0220_387:1002b07_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b08_11"
    },
    {
        "source_sentence": "本性空中空解脫門不可得，無相、無願解脫門亦不可得。",
        "translation": "The liberation gate of emptiness in the emptiness of the original nature is unobtainable, and the liberation gate of signlessness and wishlessness is also unobtainable.",
        "source": "T06n0220_387:1002b08_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b10_13"
    },
    {
        "source_sentence": "本性空中菩薩極喜地不可得，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地亦不可得。",
        "translation": "The ground of the bodhisattva's ultimate joy in the sky of his original nature is unobtainable, and so are the ground of freedom from defilement, the ground of arousal of light, the ground of burning wisdom, the ground of extreme difficulty, the ground of presence, the ground of distant practice, the ground of immovability, the ground of good wisdom, and the",
        "source": "T06n0220_387:1002b10_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b13_0"
    },
    {
        "source_sentence": "本性空中五眼不可得，六神通亦不可得。",
        "translation": "The five eyes of the original nature in space are unobtainable, and the six supernormal powers are also unobtainable.",
        "source": "T06n0220_387:1002b13_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b14_2"
    },
    {
        "source_sentence": "本性空中佛十力不可得，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法亦不可得。",
        "translation": "The ten powers of the Buddha's original nature in space are unobtainable, and the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and 18 distinctive qualities of the Buddha are also unobtainable.",
        "source": "T06n0220_387:1002b14_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b16_4"
    },
    {
        "source_sentence": "本性空中無忘失法不可得，恒住捨性亦不可得。",
        "translation": "The absence of forgetfulness in the emptiness of the original nature is unobtainable, and the nature of constantly abiding equanimity is also unobtainable.",
        "source": "T06n0220_387:1002b16_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b17_6"
    },
    {
        "source_sentence": "本性空中一切智不可得，道相智、一切相智亦不可得。",
        "translation": "omniscience in the emptiness of the original nature is unobtainable, and so are knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_387:1002b17_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b18_8"
    },
    {
        "source_sentence": "本性空中預流果不可得，一來、不還、阿羅漢果、獨覺菩提亦不可得。",
        "translation": "The fruit of stream-winner in the sky of the original nature is unobtainable, and the once-returner, nonreturner, arhatship, and solitary realizer bodhi are also unobtainable.",
        "source": "T06n0220_387:1002b19_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b20_10"
    },
    {
        "source_sentence": "本性空中一切菩薩摩訶薩行不可得，諸佛無上正等菩提亦不可得。",
        "translation": "All the bodhisattva-mahāsattva practices in the air of the original nature are unobtainable, and unsurpassed perfect enlightenment of the buddhas is also unobtainable.",
        "source": "T06n0220_387:1002b20_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b22_12"
    },
    {
        "source_sentence": "本性空中色非色法不可得，有見無見、有對無對、有漏無漏、有為無為法亦不可得。",
        "translation": "Form and formless dharmas in the emptiness of the original nature are unobtainable, and neither views nor views that are viewed, opposites nor opposites, contaminated nor uncontaminated, and conditioned and unconditioned dharmas are also unobtainable.",
        "source": "T06n0220_387:1002b22_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b24_14"
    },
    {
        "source_sentence": "本性空中三十二大士相不可得，八十隨好亦不可得。",
        "translation": "The thirty-two marks of a great being in the sky of his original nature are unobtainable, and the eighty secondary signs are also unobtainable.",
        "source": "T06n0220_387:1002b24_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002b25_16"
    },
    {
        "source_sentence": "如佛化作四眾，所謂苾芻、苾芻尼、鄔波索迦、鄔波斯迦，假使化佛百千俱胝那庾多劫為彼四眾宣說法要，",
        "translation": "Suppose the Buddha converts four groups of people, which are called bhikṣus, bhikṣuṇīs, upāsaka, and upāsikā: even if they were to convert a hundred thousand koṭis of koṭis of eons of time into buddhahood, they would preach the essentials of the Dharma for those four groups of people.",
        "source": "T06n0220_387:1002b25_17"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_387:1002b28_18"
    },
    {
        "source_sentence": "如是化眾頗有能得預流果，或得一來果，或得不還果，或得阿羅漢果，",
        "translation": "In this way, how many magicians are able to acquire the fruit of stream-entry? Some may acquire the fruit of once-returning, some acquire the fruit of non-returning, and some acquire the fruit of arhatship.",
        "source": "T06n0220_387:1002b28_19"
    },
    {
        "source_sentence": "或得獨覺菩提，或得無上正等菩提不？」",
        "translation": "Or will they attain the enlightenment of the solitary realizer or the unsurpassed perfect enlightenment?",
        "source": "T06n0220_387:1002c01_20"
    },
    {
        "source_sentence": "善現答言：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T06n0220_387:1002c01_21"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_387:1002c02_22"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T06n0220_387:1002c02_23"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T06n0220_387:1002c02_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_387:1002c02_25"
    },
    {
        "source_sentence": "是諸化眾都無實事，非無實法可有得果。」",
        "translation": "None of these transformations have real things, and it's not true that there are no real dharmas that can attain fruition.",
        "source": "T06n0220_387:1002c02_26"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_387:1002c04_0"
    },
    {
        "source_sentence": "諸法亦爾，皆本性空都無實事，於中何等菩薩摩訶薩為何等有情說何等法，",
        "translation": "All dharmas are inherently empty and devoid of substance, so what enlightening beings and sentient beings teach these things?",
        "source": "T06n0220_387:1002c04_1"
    },
    {
        "source_sentence": "可令得預流果、或一來果、或不還果、或阿羅漢果、或獨覺菩提、或復無上正等菩提？",
        "translation": "Can they attain the fruit of pre-flow, or the fruit of once-returning, or the fruit of nonreturning, or the fruit of arhatship, or the enlightenment of the solitary realizer, or the unsurpassed perfect enlightenment?",
        "source": "T06n0220_387:1002c06_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002c08_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩雖為有情宣說種種本性空法，而諸有情實不可得，哀愍彼墮顛倒法故，",
        "translation": "“Even though great enlightening beings teach sentient beings various doctrines of emptiness by nature, yet sentient beings are really ungraspable because they pity those who have fallen into error.",
        "source": "T06n0220_387:1002c08_1"
    },
    {
        "source_sentence": "拔濟令住無顛倒法。",
        "translation": "He rescues and causes them to abide in the Dharma that's not mistaken.",
        "source": "T06n0220_387:1002c10_2"
    },
    {
        "source_sentence": "無顛倒者謂無分別，無分別者無顛倒故，若有分別則有顛倒，彼等流故。",
        "translation": "The absence of delusion means the absence of discrimination, because the absence of discrimination is the absence of delusion. If there were discrimination, there would be delusion:",
        "source": "T06n0220_387:1002c10_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1002c12_4"
    },
    {
        "source_sentence": "諸無分別無顛倒中，無我，無有情、命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、使作者、起者、使起者、受者、使受者、知者、見者；",
        "translation": "Among the nondiscriminating and nonoverturned, there is no self. Sentient beings have no life principle, nothing to live for, nothing to be born, nothing to nourish, nothing to be mented, nothing to be human, nothing to be personal, nothing to be mentally produced, nothing to be youthful, nothing to be a creator, nothing to be an maker, nothing to",
        "source": "T06n0220_387:1002c12_5"
    },
    {
        "source_sentence": "亦無色，無受、想、行、識；",
        "translation": "Also formless, there is no sensation, perception, volition, or consciousness.",
        "source": "T06n0220_387:1002c15_6"
    },
    {
        "source_sentence": "亦無眼處，無耳、鼻、舌、身、意處；",
        "translation": "Nor is there the sphere of the eye, and neither is there the sphere of the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_387:1002c15_7"
    },
    {
        "source_sentence": "亦無色處，無聲、香、味、觸、法處；",
        "translation": "Also in the formless realm there is no sound, odor, taste, touch, or dharmas.",
        "source": "T06n0220_387:1002c16_8"
    },
    {
        "source_sentence": "亦無眼界、無耳、鼻、舌、身、意界；",
        "translation": "There is no element of the eye, and there is no element of the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_387:1002c16_9"
    },
    {
        "source_sentence": "亦無色界，無聲、香、味、觸、法界；",
        "translation": "Also in the realm of formlessness there is no sound, odor, taste, touch, or dharma realm.",
        "source": "T06n0220_387:1002c17_10"
    },
    {
        "source_sentence": "亦無眼識界，無耳、鼻、舌、身、意識界；",
        "translation": "Also there is no element of consciousness of the eye. There is no element of the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_387:1002c18_11"
    },
    {
        "source_sentence": "亦無眼觸，無耳、鼻、舌、身、意觸；",
        "translation": "Nor is there contact of the eye. There is no contact of the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_387:1002c18_12"
    },
    {
        "source_sentence": "亦無眼觸為緣所生諸受，無耳、鼻、舌、身、意觸為緣所生諸受；",
        "translation": "Nor are there sensations that arise from visual contact as a condition; nor are there sensations that arise from the contact of the ear, nose, tongue, body, or mind as a condition.",
        "source": "T06n0220_387:1002c19_13"
    },
    {
        "source_sentence": "亦無地界，無水、火、風、空、識界；",
        "translation": "There is no earth element, and there is no water element, fire element, wind element, space element, or consciousness element.",
        "source": "T06n0220_387:1002c20_14"
    },
    {
        "source_sentence": "亦無因緣，無等無間緣、所緣緣、增上緣；",
        "translation": "They also have no causal conditions: they have no equal and immediately antecedent conditions, no condition as object of consciousness, and no predominating conditions.",
        "source": "T06n0220_387:1002c21_15"
    },
    {
        "source_sentence": "亦無從緣所生諸法；",
        "translation": "Nor are there any dharmas that arise from conditions.",
        "source": "T06n0220_387:1002c22_16"
    },
    {
        "source_sentence": "亦無無明，無行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱；",
        "translation": "Also there is no ignorance: there is no volition, consciousness, name-and-form, the six sense mediums, touch, sensation, thirst, craving, grasping, existence, birth, old age, sorrow, pain, vexation, suffering, and distress.",
        "source": "T06n0220_387:1002c22_17"
    },
    {
        "source_sentence": "亦無布施波羅蜜多，無淨戒、安忍、精進、靜慮、般若波羅蜜多；",
        "translation": "Nor are there the perfections of generosity, morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_387:1002c24_18"
    },
    {
        "source_sentence": "亦無內空，無外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；",
        "translation": "There is also no internal emptiness, no external emptiness, no internal and external emptiness, emptiness of emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of specific characteristics, emptiness of shared characteristics, emp",
        "source": "T06n0220_387:1002c25_19"
    },
    {
        "source_sentence": "亦無四念住，無四正斷、四神足、五根、五力、七等覺支、八聖道支；",
        "translation": "Nor are there the four abodes of mindfulness, nor the four forms of right abandonment, nor the four spiritual powers, nor the five faculties, nor the five powers, nor the seven factors of enlightenment, nor the eightfold noble path.",
        "source": "T06n0220_387:1002c29_20"
    },
    {
        "source_sentence": "亦無苦聖諦，無集、滅、道聖諦；",
        "translation": "Neither is there the noble truth of suffering nor the noble truths of arising, cessation, and the path.",
        "source": "T06n0220_387:1003a01_21"
    },
    {
        "source_sentence": "亦無四靜慮，無四無量、四無色定；",
        "translation": "Nor are there the four kinds of meditation. There are neither the four immeasurable concentrations nor the four formless concentrations.",
        "source": "T06n0220_387:1003a02_22"
    },
    {
        "source_sentence": "亦無八解脫，無八勝處、九次第定、十遍處；",
        "translation": "Nor are there the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universals.",
        "source": "T06n0220_387:1003a03_0"
    },
    {
        "source_sentence": "亦無一切陀羅尼門，無一切三摩地門；",
        "translation": "Nor are there all the teachings of enlightening beings’ spells, and they do not have all the teachings of concentration.",
        "source": "T06n0220_387:1003a03_1"
    },
    {
        "source_sentence": "亦無空解脫門，無無相、無願解脫門；",
        "translation": "Nor is there the door of liberation through emptiness, nor are there the doors of liberation through signlessness and wishlessness.",
        "source": "T06n0220_387:1003a04_2"
    },
    {
        "source_sentence": "亦無極喜地，無離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地；",
        "translation": "There is also no ground of ultimate bliss: the ground of freedom from defilement, the ground of emission of light, the ground of blazing wisdom, the ground of extreme difficulty overcoming enemies, the ground of direct presence, the ground of remote travel, the ground of immovability, the ground of good wisdom, the ground of cloud of truth.",
        "source": "T06n0220_387:1003a05_3"
    },
    {
        "source_sentence": "亦無五眼，無六神通；",
        "translation": "Nor did he have the five eyes or the six supernatural powers.",
        "source": "T06n0220_387:1003a07_4"
    },
    {
        "source_sentence": "亦無佛十力，無四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；",
        "translation": "They also did not have the ten powers of buddhahood; they did not have the four forms of fearlessness, the four forms of unhindered understanding, great kindness, great compassion, great compassion, great joy, great equanimity, or the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_387:1003a08_5"
    },
    {
        "source_sentence": "亦無無忘失法，無恒住捨性；",
        "translation": "Nor is there a state of nonforgetfulness or forgetfulness, nor does it always abide in equanimity.",
        "source": "T06n0220_387:1003a09_6"
    },
    {
        "source_sentence": "亦無一切智，無道相智、一切相智；",
        "translation": "Nor is there omniscience. There is no knowledge of the path and no knowledge of all characteristics.",
        "source": "T06n0220_387:1003a10_7"
    },
    {
        "source_sentence": "亦無預流果，無一來、不還、阿羅漢果、獨覺菩提；",
        "translation": "Nor is there a fruit of stream-entry, and neither is there the enlightenment of the once-returner, the nonreturner, the fruit of the arhat, or the enlightenment of the self-ened.",
        "source": "T06n0220_387:1003a11_8"
    },
    {
        "source_sentence": "亦無一切菩薩摩訶薩行，無諸佛無上正等菩提；",
        "translation": "Nor are there all the practices of great enlightening beings, nor the supreme perfect enlightenment of buddhas.",
        "source": "T06n0220_387:1003a12_9"
    },
    {
        "source_sentence": "亦無色非色法，無有見無見、有對無對、有漏無漏、有為無為法；",
        "translation": "Also formless and formless dharmas are without seeing or not seeing, with opposites or not opposites, impure or pure, conditioned or unconditioned dharmas.",
        "source": "T06n0220_387:1003a13_10"
    },
    {
        "source_sentence": "亦無三十二大士相，無八十隨好。",
        "translation": "Nor does he have the thirty-two marks of a great personage or the eighty secondary signs.",
        "source": "T06n0220_387:1003a14_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_387:1003a16_0"
    },
    {
        "source_sentence": "此無所有即本性空，諸菩薩摩訶薩修行般若波羅蜜多時，安住此中見諸有情墮顛倒想，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they abide here to see that sentient beings fall into mistaken conceptions.",
        "source": "T06n0220_387:1003a16_1"
    },
    {
        "source_sentence": "方便善巧令得解脫，謂令解脫無我我想，無有情、命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、使作者、起者、使起者、受者、使受者、知者、見者有情乃至見者想；",
        "translation": "The liberation of sentient beings is to cause them to be liberated from the ideation of self and non-self. There are no sentient beings, living beings, those who are born, those who nourish, humans, personalities, personalities, mental states, children, writers, producers, creators, producers, producers, producers, receivers, recipients,",
        "source": "T06n0220_387:1003a18_2"
    },
    {
        "source_sentence": "亦令解脫無色色想，無受、想、行、識受、想、行、識想；",
        "translation": "They also become liberated from the ideation of formlessness and formlessness, without feeling, perception, volition, or consciousness sensation, perception, volition, or thought.",
        "source": "T06n0220_387:1003a21_3"
    },
    {
        "source_sentence": "亦令解脫無眼處眼處想，無耳、鼻、舌、身、意處耳、鼻、舌、身、意處想；",
        "translation": "“Furthermore, enlightening beings are liberated from the perception of the sphere of eyelessness and the perception of the sphere of eye; they do not conceive of the sense base of ear, nose, tongue, body, or mind.",
        "source": "T06n0220_387:1003a22_4"
    },
    {
        "source_sentence": "亦令解脫無色處色處想，無聲、香、味、觸、法處聲、香、味、觸、法處想；",
        "translation": "He also liberates them from the ideation of the form realm in the formless realm and the ideation of the form realm in the formless realm; he liberates them from the ideation of the sound, smell, taste, touch, odor, taste, touch, and dharma realms in the formless realm.",
        "source": "T06n0220_387:1003a24_5"
    },
    {
        "source_sentence": "亦令解脫無眼界眼界想，無耳、鼻、舌、身、意界耳、鼻、舌、身、意界想；",
        "translation": "He also caused liberation to be without perception of the eye realm as the eye realm, and without perception of the ear, nose, tongue, body, and mind realms as [something else].",
        "source": "T06n0220_387:1003a25_6"
    },
    {
        "source_sentence": "亦令解脫無色界色界想，無聲、香、味、觸、法界聲、香、味、觸、法界想；",
        "translation": "They are also liberated from the ideation of form in the realm of formlessness, and they have no ideation of sound, smell, taste, touch, odor, taste, touch, or dharmas as realms.",
        "source": "T06n0220_387:1003a26_7"
    },
    {
        "source_sentence": "亦令解脫無眼識界眼識界想，無耳、鼻、舌、身、意識界耳、鼻、舌、身、意識界想；",
        "translation": "“Furthermore, enlightening beings are liberated from the perception of the element consciousness of the eyeless realm and the perception of the element consciousness of the eyeless realm. They do not have any perception of the ear, nose, tongue, body, or mind realm of consciousness. The perception of the ear, nose, tongue",
        "source": "T06n0220_387:1003a28_8"
    },
    {
        "source_sentence": "亦令解脫無眼觸眼觸想，無耳、鼻、舌、身、意觸耳、鼻、舌、身、意觸想；",
        "translation": "It also causes liberation to be without the perception of eye contact or eye contact, and without the perception of ear, nose, tongue, body, and mind contact.",
        "source": "T06n0220_387:1003b01_0"
    },
    {
        "source_sentence": "亦令解脫無眼觸為緣所生諸受眼觸為緣所生諸受想；",
        "translation": "They also cause liberation from the sensations that arise without visual contact as supporting object and those that arise only with visual contact as supporting object.",
        "source": "T06n0220_387:1003b02_1"
    },
    {
        "source_sentence": "無耳、鼻、舌、身、意觸為緣所生諸受耳、鼻、舌、身、意觸為緣所生諸受想；",
        "translation": "They do not have sensations that arise by reason of contact with the ear, nose, tongue, body, and mind as objects.",
        "source": "T06n0220_387:1003b03_2"
    },
    {
        "source_sentence": "亦令解脫無地界地界想，無水、火、風、空、識界水、火、風、空、識界想；",
        "translation": "It also causes liberation to be without conceptions of the earth realm as earth realm, and without conceptions of water, fire, air, wind, space, or consciousness realms as water, fire, air, space, or consciousness realms.",
        "source": "T06n0220_387:1003b05_3"
    },
    {
        "source_sentence": "亦令解脫無因緣因緣想；",
        "translation": "They also cause liberation to be perceived as having no causes or conditions as causes and conditions.",
        "source": "T06n0220_387:1003b06_4"
    },
    {
        "source_sentence": "無等無間緣、所緣緣、增上緣等無間緣、所緣緣、增上緣想；",
        "translation": "Consciousnesses that have no equal and immediately antecedent conditions, conditioned by perceptual objects, conditioned by perceptual objects, conditioned by perceptual objects, and conditioned by perceptual objects.",
        "source": "T06n0220_387:1003b07_5"
    },
    {
        "source_sentence": "亦令解脫無從緣所生諸法從緣所生諸法想；",
        "translation": "They also attain liberation from the perception of things as dharmas that arise not depending on conditions, and they attain liberation from the perception of things as coming from conditions.",
        "source": "T06n0220_387:1003b08_6"
    },
    {
        "source_sentence": "亦令解脫無無明無明想，無行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱行乃至老死愁歎苦憂惱想；",
        "translation": "They also become liberated from the perception of nescience and ignorance. Their perception of formlessness, consciousness, name-and-form, the six sense mediums, touch, sensation, thirst, craving, clinging, existence, birth, old age, sorrow, pain, grief, vexation, and so on, up to the perception of old age",
        "source": "T06n0220_387:1003b09_7"
    },
    {
        "source_sentence": "亦令解脫無布施波羅蜜多布施波羅蜜多想，無淨戒、安忍、精進、靜慮、般若波羅蜜多淨戒乃至般若波羅蜜多想；",
        "translation": "He also caused liberation to be without the idea of the perfection of generosity or the perfection of giving, and without the idea of the perfection of morality, patience, effort, meditation, purity of precepts, enlightenment, up to the perfection of wisdom.",
        "source": "T06n0220_387:1003b11_8"
    },
    {
        "source_sentence": "亦令解脫無內空內空想，無外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空外空乃至無性自性空想；",
        "translation": "They also think of liberation as emptiness without internal emptiness or internal emptiness, emptiness without external emptiness, emptiness without internal and external emptiness, emptiness without emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emp",
        "source": "T06n0220_387:1003b14_9"
    },
    {
        "source_sentence": "亦令解脫無四念住四念住想，無四正斷、四神足、五根、五力、七等覺支、八聖道支四正斷乃至八聖道支想；",
        "translation": "They also cause liberation to be without the four abodes of mindfulness and the four abodes of thought. They do not conceive of the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, the eightfold noble path, the four forms of right abandonment, up to the eightfold noble",
        "source": "T06n0220_387:1003b19_0"
    },
    {
        "source_sentence": "亦令解脫無苦聖諦苦聖諦想，無集、滅、道聖諦集、滅、道聖諦想；",
        "translation": "He also caused liberation from the perception of the noble truth of suffering as non-suffering and the perception of the noble truths of origination, cessation, and the path as being free from the perception of the noble truths of origination, cessation, and the path.",
        "source": "T06n0220_387:1003b21_1"
    },
    {
        "source_sentence": "亦令解脫無四靜慮四靜慮想，無四無量、四無色定四無量、四無色定想；",
        "translation": "They also cause liberation to be without conceptions of the four meditations and the four meditations. They do not have conceptions of the four immeasurable concentrations, the four immeasurable concentrations of the four formless concentrations, or the four formless concentrations.",
        "source": "T06n0220_387:1003b22_2"
    },
    {
        "source_sentence": "亦令解脫無八解脫八解脫想，無八勝處、九次第定、十遍處八勝處、九次第定、十遍處想；",
        "translation": "Also, in liberation there is no ideation of the eight liberations and no ideation of the eight liberations. There is no ideation of the eight spheres of mastery, nine graduated concentrations, ten universals, eight spheres of mastery, nine graduated concentrations, or ten universals.",
        "source": "T06n0220_387:1003b24_3"
    },
    {
        "source_sentence": "亦令解脫無陀羅尼門陀羅尼門想，無三摩地門三摩地門想；",
        "translation": "He also caused liberation to be without conceptions of the approach of mental command, and without conceptions of the approach of concentration.",
        "source": "T06n0220_387:1003b26_4"
    },
    {
        "source_sentence": "亦令解脫無空解脫門空解脫門想，無無相、無願解脫門無相、無願解脫門想；",
        "translation": "They also conceptualize liberation as the door of liberation through the liberation gate of emptiness. They conceptualize liberation as the door of liberation through emptiness. They conceptualize liberation as signless, they conceptualize liberation as signless, they conceptualize liberation as signless, and they conceptualize liberation as wishless.",
        "source": "T06n0220_387:1003b27_5"
    },
    {
        "source_sentence": "亦令解脫無極喜地極喜地想，無離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地離垢地乃至法雲地想；",
        "translation": "They also become liberated from the perception of the state of infinite joy, the perception of the state of ultimate bliss, the perception of the state of absence of defilement, the perception of the state of emanating light, the perception of the state of burning wisdom, the perception of the state of being extremely difficult to overcome, the perception of the state of",
        "source": "T06n0220_387:1003b29_6"
    },
    {
        "source_sentence": "亦令解脫無五眼五眼想，無六神通六神通想；",
        "translation": "They also cause liberation to be without the perception of the five eyes as five eyes and without the perception of the six supernormal knowledges as six supernormal knowledges.",
        "source": "T06n0220_387:1003c04_0"
    },
    {
        "source_sentence": "亦令解脫無佛十力佛十力想，無四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法四無所畏乃至十八佛不共法想；",
        "translation": "He also caused liberation from the perception of the ten powers of buddhas and the ten powers of buddhas, without the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great equanimity, the four fearlessnesses of the eighteen unique qualities of buddhahood, up to the perception of",
        "source": "T06n0220_387:1003c05_1"
    },
    {
        "source_sentence": "亦令解脫無無忘失法無忘失法想，無恒住捨性恒住捨性想；",
        "translation": "He also caused liberation to be without perception of the principle of nonforgetfulness in regard to things and without perception of the principle of nonforgetfulness in regard to things. There was no perception of equanimity that always abided in equanimity but always abided in equanimity.",
        "source": "T06n0220_387:1003c07_2"
    },
    {
        "source_sentence": "亦令解脫無一切智一切智想，無道相智、一切相智道相智、一切相智想；",
        "translation": "“Furthermore, enlightening liberation has no ideation of omniscience or all knowledge, and no ideation of knowledge of paths, knowledge of all characteristics, knowledge of all characteristics, knowledge of paths, or perception of all characteristics.",
        "source": "T06n0220_387:1003c09_3"
    },
    {
        "source_sentence": "亦令解脫無預流果預流果想，無一來、不還、阿羅漢果、獨覺菩提一來、不還、阿羅漢果、獨覺菩提想；",
        "translation": "He also caused liberation to be without conceptions of the fruit of stream-winner or the fruit of stream-winner, and he did not conceive of enlightenment as having one coming, nonreturning, arhatship, or self-enlightenment.",
        "source": "T06n0220_387:1003c10_4"
    },
    {
        "source_sentence": "亦令解脫無一切菩薩摩訶薩行一切菩薩摩訶薩行想，無諸佛無上正等菩提諸佛無上正等菩提想；",
        "translation": "They also cause liberation to be without conceptions of all enlightening practices and all practices of enlightening beings, without conceptions of the supreme perfect enlightenment of buddhas and the supreme perfect enlightenment of buddhas.",
        "source": "T06n0220_387:1003c14_0"
    },
    {
        "source_sentence": "亦令解脫無色非色法色非色法想，無有見無見、有對無對、有漏無漏、有為無為法有見無見乃至有為無為法想；",
        "translation": "“Furthermore, enlightening beings attain liberation from the perception of formless dharmas as form and formless dharmas. They have no perception of form or formless dharmas; they have no perception of form or formless dharmas as formless things. They have no perception of form or formless dharmas that are seen or non-seen,",
        "source": "T06n0220_387:1003c16_1"
    },
    {
        "source_sentence": "亦令解脫無三十二大士相三十二大士相想，無八十隨好八十隨好想；",
        "translation": "He also caused liberation to have no ideation of the thirty-two marks of greatness and no ideation of the thirty-two marks of greatness; he did not have any ideation of the eighty secondary signs.",
        "source": "T06n0220_387:1003c18_2"
    },
    {
        "source_sentence": "亦令解脫五取蘊等諸有漏法，亦令解脫四念住等諸無漏法。",
        "translation": "It also liberates the five aggregates of grasping, and so on, from impure factors. It also liberates the four foundations of mindfulness, and so on, from pure factors.",
        "source": "T06n0220_387:1003c20_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_387:1003c21_4"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_387:1003c22_5"
    },
    {
        "source_sentence": "四念住等諸無漏法，亦非如勝義諦無生無滅、無相無為、無戲論無分別，",
        "translation": "The uncontaminated dharmas of the four abodes of mindfulness and so forth are also not like the ultimate truth that there is no arising, no ceasing, no signs, no conditioning, no conceptual elaboration, and no discrimination.",
        "source": "T06n0220_387:1003c22_6"
    },
    {
        "source_sentence": "亦應解脫，勝義諦者即本性空，此本性空即是諸佛所證無上正等菩提。",
        "translation": "The ultimate truth is emptiness of the original nature, and this emptiness of the original nature is the unsurpassed perfect enlightenment realized by the buddhas.",
        "source": "T06n0220_387:1003c23_7"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百八十七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 37",
        "source": "T06n0220_387:1003c26_0"
    }
]