[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百二",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 2",
        "source": "T06n0220_325:0659c02_0"
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T06n0220_325:0659c03_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_325:0659c05_0"
    },
    {
        "source_sentence": "初分菩薩住品第四十八之二",
        "translation": "The Forty-eighth and Second Part of the Chapter on the Abode of the Bodhisattva in the First Part",
        "source": "T06n0220_325:0659c06_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0659c07_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得無上正等菩提，應自起無忘失法，亦勸他起無忘失法，",
        "translation": "“If great enlightening beings want to attain unexcelled perfect enlightenment, they should themselves produce the principle of nonforgetfulness and encourage others to produce the principle of nonforgetfulness.",
        "source": "T06n0220_325:0659c07_1"
    },
    {
        "source_sentence": "恒正稱揚起無忘失法法，歡喜讚歎起無忘失法者；",
        "translation": "“Great enlightening beings always correctly extol the principle of nonforgetfulness in their teachings, joyfully praising those who give rise to it.",
        "source": "T06n0220_325:0659c08_2"
    },
    {
        "source_sentence": "應自起恒住捨性，亦勸他起恒住捨性，恒正稱揚起恒住捨性法，歡喜讚歎起恒住捨性者。",
        "translation": "They should themselves give rise to the nature of constantly abiding equanimity, encourage others to give rise to the nature of constantly abiding equanimity, always correctly praise the teaching that gives rise to the constant abiding equanimity, and rejoice and praise those who give rise to the constant abiding equanimity.",
        "source": "T06n0220_325:0659c10_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0659c12_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得無上正等菩提，應自攝受圓滿壽量，亦勸他攝受圓滿壽量，",
        "translation": "“If great enlightening beings want to attain unexcelled perfect enlightenment, they should themselves take in the measure of a perfect life span and also encourage others to take in the measure of a perfect life span.",
        "source": "T06n0220_325:0659c12_2"
    },
    {
        "source_sentence": "恒正稱揚攝受圓滿壽量法，歡喜讚歎攝受圓滿壽量者。",
        "translation": "He always correctly praises the method of taking in the full life span, rejoicing and praising those who take in the full life span.",
        "source": "T06n0220_325:0659c14_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0659c15_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得無上正等菩提，應自轉法輪，亦勸他轉法輪，恒正稱揚轉法輪法，",
        "translation": "“If great enlightening beings want to attain unexcelled perfect enlightenment, they should turn the wheel of teaching for themselves and encourage others to turn the wheel of teaching, always correctly extolling the teaching of turning the wheel of teaching.",
        "source": "T06n0220_325:0659c15_2"
    },
    {
        "source_sentence": "歡喜讚歎轉法輪者。",
        "translation": "They rejoice and praise those who turn the wheel of the Dharma.",
        "source": "T06n0220_325:0659c17_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0659c17_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得無上正等菩提，應自攝護正法令住，亦勸他攝護正法令住，",
        "translation": "“If great enlightening beings want to attain unexcelled perfect enlightenment, they should themselves guard the abode of right teaching and also encourage others to guard the abode of right teaching.",
        "source": "T06n0220_325:0659c17_5"
    },
    {
        "source_sentence": "恒正稱揚攝護正法令住法，歡喜讚歎攝護正法令住者。",
        "translation": "He always correctly praises the principle of guarding the right teaching and abiding in it, rejoicing and praising those who guard the right teaching and abiding in it.",
        "source": "T06n0220_325:0659c19_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0659c21_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得無上正等菩提，以無所得而為方便，應如是住。",
        "translation": "If a bodhisattva-mahāsattva wants to attain unsurpassed perfect enlightenment, he should thus abide because of the method of attaining nothing.",
        "source": "T06n0220_325:0659c21_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0659c22_9"
    },
    {
        "source_sentence": "菩薩摩訶薩應如是學甚深般若波羅蜜多方便善巧，若如是學乃能安住所安住法，",
        "translation": "“Thus should great enlightening beings train in the profound skillful means of transcendent wisdom. If they thus train, they will be able to settle and abide in truth.",
        "source": "T06n0220_325:0659c22_10"
    },
    {
        "source_sentence": "若如是學、如是安住，則於色得無障礙，於受、想、行、識得無障礙；",
        "translation": "If one thus learns and thus abides, the attainment of form is unobstructed; the attainment of feeling, perception, volition, and consciousness is unobstructed.",
        "source": "T06n0220_325:0659c24_11"
    },
    {
        "source_sentence": "於眼處得無障礙，於耳、鼻、舌、身、意處得無障礙；",
        "translation": "They attain unobstructed acquisition in the sense eye; they attain unobstructed acquisition in the sense ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0659c26_12"
    },
    {
        "source_sentence": "於色處得無障礙，於聲、香、味、觸、法處得無障礙；",
        "translation": "They attain unobstructedness in the realm of form; they attain unobstructedness in the realms of sound, smell, taste, touch, and dharmas.",
        "source": "T06n0220_325:0659c27_13"
    },
    {
        "source_sentence": "於眼界得無障礙，於耳、鼻、舌、身、意界得無障礙；",
        "translation": "They attain nonobstruction regarding the element eye; they attain it without obstruction regarding the elements ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0659c28_14"
    },
    {
        "source_sentence": "於色界得無障礙，於聲、香、味、觸、法界得無障礙；",
        "translation": "They attain nonobstruction in the realm of form, and they attain nonobstruction in the realms of sound, smell, taste, touch, and dharmas.",
        "source": "T06n0220_325:0659c29_15"
    },
    {
        "source_sentence": "於眼識界得無障礙，於耳、鼻、舌、身、意識界得無障礙；",
        "translation": "They attain unobstructed acquisition regarding the element consciousness of the eye. They attain unobstructed acquisition regarding the elements ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0660a01_16"
    },
    {
        "source_sentence": "於眼觸得無障礙，於耳、鼻、舌、身、意觸得無障礙，於眼觸為緣所生諸受得無障礙，",
        "translation": "He attains unobstructedness when touching the eye, and he attains unobstructedness when touching the ear, nose, tongue, body, or mind. He attains unobstructedness in all sensations that arise from eye contact as a condition.",
        "source": "T06n0220_325:0660a02_17"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意觸為緣所生諸受得無障礙；",
        "translation": "They attain unobstructedness in all sensations that arise from contact with the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0660a04_18"
    },
    {
        "source_sentence": "於地界得無障礙，於水、火、風、空、識界得無障礙；",
        "translation": "They attain unobstructedness in the earth realm, and they attain unobstructedness in water, fire, wind, space, and consciousness realms.",
        "source": "T06n0220_325:0660a05_19"
    },
    {
        "source_sentence": "於無明得無障礙，於行、識、名色、六處、觸、受、愛、取、有、生、老死得無障礙；",
        "translation": "They attain unobstructed acquisition regarding ignorance; they attain unobstructed acquisition regarding formations, consciousness, name and form, the six sense-fields, touch, feeling, thirst, craving, grasping, existence, birth, old age and death.",
        "source": "T06n0220_325:0660a06_20"
    },
    {
        "source_sentence": "於離害生命得無障礙，於離不與取、欲邪行、虛誑語、麁惡語、離間語、雜穢語、貪欲、瞋恚、邪見得無障礙；",
        "translation": "“Enlightening beings attain unobstructed liberation from harming sentient beings; they attain unobstructed liberation from taking what is not given, sexual misconduct based on desire, false speech, deceitful speech, slanderous speech, harsh speech, divisive speech, impure speech, covetousness, hatred, and wrong views.",
        "source": "T06n0220_325:0660a08_0"
    },
    {
        "source_sentence": "於四靜慮得無障礙，於四無量、四無色定得無障礙；",
        "translation": "They attain unobstructedness in the four concentrations, and they attain unobstructedness in the four immeasurable and four formless concentrations.",
        "source": "T06n0220_325:0660a10_1"
    },
    {
        "source_sentence": "於布施波羅蜜多得無障礙，於淨戒、安忍、精進、靜慮、般若波羅蜜多得無障礙；",
        "translation": "They attain unobstructed enlightenment by the perfection of giving, and they attain unobstructed enlightenment by the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_325:0660a11_2"
    },
    {
        "source_sentence": "於內空得無障礙，於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空得無障礙；",
        "translation": "They attain unobstructedness in regard to internal emptiness, and they attain unobstructedness in regard to external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-",
        "source": "T06n0220_325:0660a13_3"
    },
    {
        "source_sentence": "於真如得無障礙，於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界得無障礙；",
        "translation": "They attain unobstructed acquisition of true suchness; they attain unobstructed acquisition of the realm of reality, the essence of reality, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, abiding in truth, reality, space, and inconceivable realms.",
        "source": "T06n0220_325:0660a17_4"
    },
    {
        "source_sentence": "於四念住得無障礙，於四正斷、四神足、五根、五力、七等覺支、八聖道支得無障礙；",
        "translation": "They attain unobstructedness in the four abodes of mindfulness. They attain unobstructedness in the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path.",
        "source": "T06n0220_325:0660a19_5"
    },
    {
        "source_sentence": "於苦聖諦得無障礙，於集、滅、道聖諦得無障礙；",
        "translation": "They attain unhindered acquisition regarding the noble truth of suffering, and they attain unhindered acquisition regarding the noble truths of origin, cessation, and the path.",
        "source": "T06n0220_325:0660a21_6"
    },
    {
        "source_sentence": "於八解脫得無障礙，於八勝處、九次第定、十遍處得無障礙；",
        "translation": "They attain unobstructedness in the eight liberations, and attain unobstructedness in the eight spheres of mastery, in the nine graduated concentrations, and in the ten universals.",
        "source": "T06n0220_325:0660a22_7"
    },
    {
        "source_sentence": "於空解脫門得無障礙，於無相、無願解脫門得無障礙；",
        "translation": "They attain unobstructedness in the liberation door of emptiness, and they attain unobstructedness in the liberation door of signlessness and wishlessness.",
        "source": "T06n0220_325:0660a23_8"
    },
    {
        "source_sentence": "於極喜地得無障礙，於離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地得無障礙；",
        "translation": "They attain unobstructedness in the state of ultimate bliss. They attain unobstructedness in the state of freedom from defilement, in the state of emission of light, in the state of blazing wisdom, in the state of extreme difficulty, in the state of direct presence, in the state of remote travel, in the state of immovability, in the state of",
        "source": "T06n0220_325:0660a25_9"
    },
    {
        "source_sentence": "於五眼得無障礙，於六神通得無障礙；",
        "translation": "They attain unobstructedness in the five eyes; they attain unobstructedness in the six supernormal powers.",
        "source": "T06n0220_325:0660a27_10"
    },
    {
        "source_sentence": "於三摩地門得無障礙，於陀羅尼門得無障礙；",
        "translation": "They attain unobstructedness in the aspect of concentration and they attain unobstructedness in the aspect of mental command.",
        "source": "T06n0220_325:0660a28_11"
    },
    {
        "source_sentence": "於佛十力得無障礙，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法得無障礙；",
        "translation": "They attain unobstructed access to the ten powers of buddhas. They attain unobstructed access to the four fearlessnesses, the four unhindered understandings, great benevolence, great compassion, great compassion, great joy, great relinquishment, and the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_325:0660a29_12"
    },
    {
        "source_sentence": "於順逆觀十二支緣起得無障礙；",
        "translation": "They attain unobstructed contemplation of the twelve links of dependent origination in accordance with adversity.",
        "source": "T06n0220_325:0660b02_13"
    },
    {
        "source_sentence": "於知苦、斷集、證滅、修道得無障礙；",
        "translation": "They attain unhindered knowledge of suffering, its cessation, its origin, its realization, its cessation, and the path of cultivation.",
        "source": "T06n0220_325:0660b03_14"
    },
    {
        "source_sentence": "於預流果得無障礙，於一來、不還、阿羅漢果得無障礙；",
        "translation": "They attain nonobstruction in the state of stream-winner, and they attain nonobstruction in the states of once-returning, nonreturning, and arhatship.",
        "source": "T06n0220_325:0660b03_15"
    },
    {
        "source_sentence": "於獨覺菩提得無障礙；",
        "translation": "They attain unobstructed enlightenment of the self-enlightened.",
        "source": "T06n0220_325:0660b05_16"
    },
    {
        "source_sentence": "於入菩薩正性離生位得無障礙；",
        "translation": "They enter the true nature of enlightening beings and attain unobstructed freedom from birth.",
        "source": "T06n0220_325:0660b05_17"
    },
    {
        "source_sentence": "於嚴淨佛土得無障礙，於成熟有情得無障礙；",
        "translation": "They attain unobstructedness in the adornment and purity of buddha-lands, and they attain unobstructedness in the development of sentient beings.",
        "source": "T06n0220_325:0660b06_18"
    },
    {
        "source_sentence": "於起菩薩神通得無障礙；",
        "translation": "They attain unobstructed enlightening beings’ spiritual power of initiating enlightening beings.",
        "source": "T06n0220_325:0660b07_19"
    },
    {
        "source_sentence": "於一切智得無障礙，於道相智、一切相智得無障礙；",
        "translation": "They attain unobstructed omniscience, and attain unobstructed knowledge of the path and omniscience.",
        "source": "T06n0220_325:0660b08_20"
    },
    {
        "source_sentence": "於斷一切煩惱相續習氣得無障礙；",
        "translation": "They attain unobstructed mental command over the cessation of all afflictions.",
        "source": "T06n0220_325:0660b09_21"
    },
    {
        "source_sentence": "於無忘失法得無障礙，於恒住捨性得無障礙；",
        "translation": "They attain unobstructedness in the state of nonforgetfulness, and attain unobstructedness in the state of eternally abiding equanimity.",
        "source": "T06n0220_325:0660b10_22"
    },
    {
        "source_sentence": "於圓滿壽量得無障礙，於轉法輪得無障礙，於正法住得無障礙。",
        "translation": "He attains unobstructedness in the measure of perfect longevity, unobstructedness in turning the wheel of the Dharma, and unobstructedness in abiding in the right teaching.",
        "source": "T06n0220_325:0660b11_23"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_325:0660b12_24"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0660b12_25"
    },
    {
        "source_sentence": "是菩薩摩訶薩從前際來不攝受色，不攝受受、想、行、識；",
        "translation": "“These great enlightening beings did not receive form from the past, and they did not receive feeling, perception, volition, or consciousness.",
        "source": "T06n0220_325:0660b12_26"
    },
    {
        "source_sentence": "不攝受眼處，不攝受耳、鼻、舌、身、意處；",
        "translation": "They do not take in the sense-field of the eye; they do not take in the sense-fields of the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0660b14_27"
    },
    {
        "source_sentence": "不攝受色處，不攝受聲、香、味、觸、法處；",
        "translation": "They do not embrace the sphere of form; they do not embrace the sphere of sounds, smells, tastes, tangibles, and dharmas.",
        "source": "T06n0220_325:0660b15_0"
    },
    {
        "source_sentence": "不攝受眼界，不攝受耳、鼻、舌、身、意界；",
        "translation": "They do not embrace the element eye, they do not embrace the elements ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0660b15_1"
    },
    {
        "source_sentence": "不攝受色界，不攝受聲、香、味、觸、法界；",
        "translation": "They do not embrace the realm of form; they do not embrace the realm of sound, smell, taste, touch, or dharmas.",
        "source": "T06n0220_325:0660b16_2"
    },
    {
        "source_sentence": "不攝受眼識界，不攝受耳、鼻、舌、身、意識界；",
        "translation": "They do not embrace the element consciousness of the eye, they do not embrace the elements ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0660b17_3"
    },
    {
        "source_sentence": "不攝受眼觸，不攝受耳、鼻、舌、身、意觸；",
        "translation": "They do not receive the contact of the eye, and they do not receive the contact of the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_325:0660b18_4"
    },
    {
        "source_sentence": "不攝受眼觸為緣所生諸受，不攝受耳、鼻、舌、身、意觸為緣所生諸受；",
        "translation": "They do not take in the sensations that arise from visual contact as an object; they do not take in the sensations that arise from contact with the ear, nose, tongue, body, or mind as an object.",
        "source": "T06n0220_325:0660b19_5"
    },
    {
        "source_sentence": "不攝受地界，不攝受水、火、風、空、識界；",
        "translation": "They do not receive earth element, water element, fire element, wind element, space element, or consciousness element.",
        "source": "T06n0220_325:0660b20_6"
    },
    {
        "source_sentence": "不攝受無明，不攝受行、識、名色、六處、觸、受、愛、取、有、生、老死；",
        "translation": "They do not embrace ignorance; they do not embrace formations, consciousnesses, name and form, the six sense-fields, touch, sensation, craving, grasping, existence, birth, old age and death.",
        "source": "T06n0220_325:0660b21_7"
    },
    {
        "source_sentence": "不攝受離害生命，不攝受離不與取、欲邪行、虛誑語、麁惡語、離間語、雜穢語、貪欲、瞋恚、邪見；",
        "translation": "They do not accept the precept against taking life, they do not accept the precept against taking what is not given, sexual misconduct, false speech, coarse speech, harsh speech, incoherent speech, defiled speech, greed, anger, and wrong views.",
        "source": "T06n0220_325:0660b22_8"
    },
    {
        "source_sentence": "不攝受四靜慮，不攝受四無量、四無色定；",
        "translation": "They do not embrace the four forms of meditation. They do not embrace the four immeasurable concentrations or the four formless concentrations.",
        "source": "T06n0220_325:0660b24_9"
    },
    {
        "source_sentence": "不攝受布施波羅蜜多，不攝受淨戒、安忍、精進、靜慮、般若波羅蜜多；",
        "translation": "They do not embrace the perfection of giving, and they do not embrace the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_325:0660b25_10"
    },
    {
        "source_sentence": "不攝受內空，不攝受外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；",
        "translation": "They do not embrace internal emptiness; they do not embrace external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics,",
        "source": "T06n0220_325:0660b27_11"
    },
    {
        "source_sentence": "不攝受真如，不攝受法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；",
        "translation": "They do not embrace the realm of reality, they do not embrace the realm of reality; they do not embrace the realm of reality, the nature of reality, the nature of reality, non-falsity, unchangingness and dissimilarity, equality, freedom from birth, law, the abode of truth, reality, space, or inconceivable",
        "source": "T06n0220_325:0660c02_12"
    },
    {
        "source_sentence": "不攝受四念住，不攝受四正斷、四神足、五根、五力、七等覺支、八聖道支；",
        "translation": "They do not embrace the four foundations of mindfulness, they do not embrace the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment and the eight noble factors of the path.",
        "source": "T06n0220_325:0660c04_13"
    },
    {
        "source_sentence": "不攝受苦聖諦，不攝受集、滅、道聖諦；",
        "translation": "They do not embrace the noble truth of suffering, they do not embrace the noble truths of accumulation, cessation, and the path.",
        "source": "T06n0220_325:0660c05_14"
    },
    {
        "source_sentence": "不攝受八解脫，不攝受八勝處、九次第定、十遍處；",
        "translation": "They do not embrace the eight liberations, they do not embrace the eight spheres of mastery, the nine graduated concentrations, and the ten universals.",
        "source": "T06n0220_325:0660c06_15"
    },
    {
        "source_sentence": "不攝受空解脫門，不攝受無相、無願解脫門；",
        "translation": "They do not embrace the liberation gate of emptiness, and they do not embrace the liberation gate of signlessness or wishlessness.",
        "source": "T06n0220_325:0660c07_16"
    },
    {
        "source_sentence": "不攝受極喜地，不攝受離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地；",
        "translation": "They do not receive the state of ultimate bliss; they do not receive the state of freedom from defilement, the state of emission of light, the state of blazing wisdom, the state of supreme difficulty, the state of direct presence, the state of remote travel, the state of immovability, the state of good wisdom, or the state of cloud of truth.",
        "source": "T06n0220_325:0660c08_17"
    },
    {
        "source_sentence": "不攝受五眼，不攝受六神通；",
        "translation": "They do not receive the five eyes and do not receive the six supernatural powers.",
        "source": "T06n0220_325:0660c11_18"
    },
    {
        "source_sentence": "不攝受三摩地門，不攝受陀羅尼門；",
        "translation": "They do not accept the approach of concentration and they do not accept the approach of mental command.",
        "source": "T06n0220_325:0660c11_19"
    },
    {
        "source_sentence": "不攝受佛十力，不攝受四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；",
        "translation": "They do not embrace the ten powers of buddhas. They do not embrace the four forms of fearlessness, the four forms of unhindered understanding, great kindness, great compassion, great compassion, great joy, great relinquishment, or the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_325:0660c12_20"
    },
    {
        "source_sentence": "不攝受十二支緣起順逆觀；",
        "translation": "They do not embrace the contemplation of the twelve links of dependent origination as adversity.",
        "source": "T06n0220_325:0660c14_21"
    },
    {
        "source_sentence": "不攝受知苦、斷集、證滅、修道；",
        "translation": "They do not embrace knowledge of suffering, annihilation and accumulation, realization and cessation, or the path of cultivation.",
        "source": "T06n0220_325:0660c14_22"
    },
    {
        "source_sentence": "不攝受預流果，不攝受一來、不還、阿羅漢果；",
        "translation": "They do not receive the fruit of stream-entry and do not receive the fruits of once-returning, nonreturning, and arhatship.",
        "source": "T06n0220_325:0660c15_23"
    },
    {
        "source_sentence": "不攝受獨覺菩提；",
        "translation": "They do not embrace the enlightenment of self-enlightened ones.",
        "source": "T06n0220_325:0660c16_24"
    },
    {
        "source_sentence": "不攝受入菩薩正性離生位；",
        "translation": "They do not receive and enter the state of enlightening beings’ righteousness free from birth.",
        "source": "T06n0220_325:0660c17_0"
    },
    {
        "source_sentence": "不攝受嚴淨佛土，不攝受成熟有情；",
        "translation": "They do not embrace the buddha-lands of adornment and purity, they do not embrace the development of sentient beings.",
        "source": "T06n0220_325:0660c17_1"
    },
    {
        "source_sentence": "不攝受菩薩神通；",
        "translation": "They do not receive the spiritual powers of enlightening beings.",
        "source": "T06n0220_325:0660c18_2"
    },
    {
        "source_sentence": "不攝受一切智，不攝受道相智、一切相智；",
        "translation": "They do not embrace omniscience, they do not embrace knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_325:0660c18_3"
    },
    {
        "source_sentence": "不攝受斷一切煩惱相續習氣；",
        "translation": "They do not embrace the permeations that cut off the stream of all afflictions.",
        "source": "T06n0220_325:0660c19_4"
    },
    {
        "source_sentence": "不攝受無忘失法，不攝受恒住捨性；",
        "translation": "They do not embrace the principle of nonforgetfulness, and they do not embrace the nature of eternally abiding equanimity.",
        "source": "T06n0220_325:0660c20_5"
    },
    {
        "source_sentence": "不攝受圓滿壽量，不攝受轉法輪，不攝受正法住。",
        "translation": "They don't take in the full life span, don't take in the turning of the wheel of the Dharma, and don't take in the abode of the right teaching.",
        "source": "T06n0220_325:0660c21_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0660c22_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0660c22_8"
    },
    {
        "source_sentence": "色不可攝受故，若色不可攝受則非色；",
        "translation": "Because form is not to be grasped. If form were not to be grasped, it would not be form.",
        "source": "T06n0220_325:0660c22_9"
    },
    {
        "source_sentence": "受、想、行、識不可攝受故，若受、想、行、識不可攝受則非受、想、行、識。",
        "translation": "Because feeling, perception, volition, and consciousness can't be collected, if feeling, perception, volition, and consciousness can't be collected, then it's not feeling, perception, volition, or consciousness.",
        "source": "T06n0220_325:0660c23_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0660c25_11"
    },
    {
        "source_sentence": "眼處不可攝受故，若眼處不可攝受則非眼處；",
        "translation": "Because the sphere of vision is not to be grasped. If the sphere of vision were not to be grasped, it would not be the sphere of vision.",
        "source": "T06n0220_325:0660c25_12"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意處不可攝受故，若耳、鼻、舌、身、意處不可攝受則非耳、鼻、舌、身、意處。",
        "translation": "Because the ear, nose, tongue, body, and mind sense-fields can't be collected, if the ear, nose, tongue, body, and mind sense-fields can't be collected, then it's not the ear, nose, tongue, body, tongue, body, or mind sense-field.",
        "source": "T06n0220_325:0660c26_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0660c28_14"
    },
    {
        "source_sentence": "色處不可攝受故，若色處不可攝受則非色處；",
        "translation": "Because the sphere of form is not to be grasped. If the sphere of form were not to be grasped, it would not be the sphere of form.",
        "source": "T06n0220_325:0660c28_15"
    },
    {
        "source_sentence": "聲、香、味、觸、法處不可攝受故，若聲、香、味、觸、法處不可攝受則非聲、香、味、觸、法處。",
        "translation": "If sound, odor, taste, touch, touch, and dharmas are not collected, then it's not sound, odor, taste, touch, touch, or dharmas.",
        "source": "T06n0220_325:0660c29_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a02_0"
    },
    {
        "source_sentence": "眼界不可攝受故，若眼界不可攝受則非眼界；",
        "translation": "Because the element eye cannot be grasped. If the element eye could not be grasped, it would not be the element eye.",
        "source": "T06n0220_325:0661a02_1"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意界不可攝受故，若耳、鼻、舌、身、意界不可攝受則非耳、鼻、舌、身、意界。",
        "translation": "Because the ear, nose, tongue, body, and mind realms can't be collected, if the ear, nose, tongue, body, and mind realms can't be collected, then it's not the ear, nose, tongue, body, tongue, body, or mind realms.",
        "source": "T06n0220_325:0661a03_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a04_3"
    },
    {
        "source_sentence": "色界不可攝受故，若色界不可攝受則非色界；",
        "translation": "Because the realm of form cannot be grasped. If it is not grasped in the realm of form, then it is no realm of form.",
        "source": "T06n0220_325:0661a05_4"
    },
    {
        "source_sentence": "聲、香、味、觸、法界不可攝受故，若聲、香、味、觸、法界不可攝受則非聲、香、味、觸、法界。",
        "translation": "It's because sound, odor, taste, touch, touch, and the Dharma realm can't be collected, and if sound, odor, taste, touch, touch, and the Dharma realm can't be collected, then it's not sound, odor, taste, touch, touch, or the Dharma realm.",
        "source": "T06n0220_325:0661a06_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a07_6"
    },
    {
        "source_sentence": "眼識界不可攝受故，若眼識界不可攝受則非眼識界；",
        "translation": "The element consciousness of the eye cannot be grasped. If the element consciousness of the eye is not grasped, then it is no element consciousness of the eye.",
        "source": "T06n0220_325:0661a08_0"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意識界不可攝受故，若耳、鼻、舌、身、意識界不可攝受則非耳、鼻、舌、身、意識界。",
        "translation": "It's because the ear, nose, tongue, body, and consciousness realms can't be collected, and if the ear, nose, tongue, body, and consciousness realms can't be collected, then it's not the ear, nose, tongue, body, tongue, body, or consciousness realms.",
        "source": "T06n0220_325:0661a09_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a11_2"
    },
    {
        "source_sentence": "眼觸不可攝受故，若眼觸不可攝受則非眼觸；",
        "translation": "Because eye contact is not to be grasped. If eye contact were not to be grasped, it would not be eye contact.",
        "source": "T06n0220_325:0661a11_3"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意觸不可攝受故，若耳、鼻、舌、身、意觸不可攝受則非耳、鼻、舌、身、意觸。",
        "translation": "It's because the ear, nose, tongue, body, and mind touch can't be collected, and if the ear, nose, tongue, body, and mind touch can't be collected, then it's not the ear, nose, tongue, body, tongue, body, or mind touch.",
        "source": "T06n0220_325:0661a12_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a14_5"
    },
    {
        "source_sentence": "眼觸為緣所生諸受不可攝受故，若眼觸為緣所生諸受不可攝受則非眼觸為緣所生諸受；",
        "translation": "If the sensations that arise from eye contact as supporting object are not to be grasped, then they are no sensations that arise from eye contact as supporting object.",
        "source": "T06n0220_325:0661a14_6"
    },
    {
        "source_sentence": "耳、鼻、舌、身、意觸為緣所生諸受不可攝受故，若耳、鼻、舌、身、意觸為緣所生諸受不可攝受則非耳、鼻、舌、身、意觸為緣所生諸受。",
        "translation": "It's because the sensations that arise from ear, nose, tongue, body, and mind contact as a condition can't be collected, and if the sensations that arise from ear, nose, tongue, body, and mind contact as a condition can't be collected, then they aren't the sensations that arise from ear, nose, tongue, body",
        "source": "T06n0220_325:0661a16_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a19_8"
    },
    {
        "source_sentence": "地界不可攝受故，若地界不可攝受則非地界；",
        "translation": "Because the earth element cannot be grasped. If earth element is not grasped, then it is no earth element.",
        "source": "T06n0220_325:0661a19_9"
    },
    {
        "source_sentence": "水、火、風、空、識界不可攝受故，若水、火、風、空、識界不可攝受則非水、火、風、空、識界。",
        "translation": "It's because water, fire, wind, air, space, and the consciousness realm can't be collected, and if water, fire, wind, air, space, and the consciousness realm can't be collected, then it's not the element of water, fire, wind, air, space, or consciousness.",
        "source": "T06n0220_325:0661a20_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a22_0"
    },
    {
        "source_sentence": "無明不可攝受故，若無明不可攝受則非無明；",
        "translation": "Because ignorance cannot be grasped. If ignorance could not be grasped, it would not be ignorance.",
        "source": "T06n0220_325:0661a22_1"
    },
    {
        "source_sentence": "行、識、名色、六處、觸、受、愛、取、有、生、老死不可攝受故，若行乃至老死不可攝受則非行乃至老死。",
        "translation": "It's because form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, and old age can't be collected, and if form and even old age cannot be collected, then it's not form or even old age.",
        "source": "T06n0220_325:0661a23_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a26_0"
    },
    {
        "source_sentence": "離害生命不可攝受故，若離害生命不可攝受則非離害生命；",
        "translation": "Because harmless life is not to be grasped. If harmless life were not to be grasped, it would not be harmless life.",
        "source": "T06n0220_325:0661a26_1"
    },
    {
        "source_sentence": "離不與取、欲邪行不可攝受故，若離不與取、欲邪行不可攝受則非離不與取、欲邪行。",
        "translation": "It's because they're free of taking what's not given and wrong sexual behavior that can't be collected, and if they're free of taking what's not given and wrong sexual behavior that can't be collected, then they aren't free of taking what's not given and wrong sexual behavior that can't be collected.",
        "source": "T06n0220_325:0661a27_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661a29_3"
    },
    {
        "source_sentence": "離虛誑語不可攝受故，若離虛誑語不可攝受則非離虛誑語；",
        "translation": "Being free of false speech is not to be grasped. If being free of false speech were not to be grasped, then it would not be free of false speech.",
        "source": "T06n0220_325:0661a29_4"
    },
    {
        "source_sentence": "離麁惡語、離間語、雜穢語不可攝受故，若離麁惡語、離間語、雜穢語不可攝受則非離麁惡語、離間語、雜穢語。",
        "translation": "Because they are free of harsh speech, free of indirect speech, and free of defiled speech that can't be collected, if they are free of harsh speech, free of indirect speech, and free of defiled speech that can't be collected, then they aren't free of harsh speech, free of indirect speech, and free of defiled speech.",
        "source": "T06n0220_325:0661b02_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661b04_1"
    },
    {
        "source_sentence": "離貪欲不可攝受故，若離貪欲不可攝受則非離貪欲；",
        "translation": "Being free from craving cannot be grasped. If being free from craving cannot be grasped, then it is not being free from craving.",
        "source": "T06n0220_325:0661b04_2"
    },
    {
        "source_sentence": "離瞋恚、邪見不可攝受故，若離瞋恚、邪見不可攝受則非離瞋恚、邪見。",
        "translation": "Because it's free of anger and wrong views that can't be collected, if it's free of anger and wrong views that can't be collected, then it's not free of anger and wrong views.",
        "source": "T06n0220_325:0661b05_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661b07_4"
    },
    {
        "source_sentence": "初靜慮不可攝受故，若初靜慮不可攝受則非初靜慮；",
        "translation": "Because the first trance cannot be grasped. If the first trance cannot be grasped, then it is no first trance.",
        "source": "T06n0220_325:0661b07_5"
    },
    {
        "source_sentence": "第二、第三、第四靜慮不可攝受故，若第二、第三、第四靜慮不可攝受則非第二、第三、第四靜慮。",
        "translation": "It's because the second, third, and fourth concentrations can't be collected, and if the second, third, and fourth concentrations can't be collected, then it's not the second, third, and fourth meditations.",
        "source": "T06n0220_325:0661b08_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661b10_7"
    },
    {
        "source_sentence": "慈無量不可攝受故，若慈無量不可攝受則非慈無量；",
        "translation": "Because kindness is immeasurable and cannot be grasped. If kindness were immeasurable and cannot be grasped, then it would not be immeasurable.",
        "source": "T06n0220_325:0661b10_8"
    },
    {
        "source_sentence": "悲、喜、捨無量不可攝受故，若悲、喜、捨無量不可攝受則非悲、喜、捨無量。",
        "translation": "Because pity, joy, and equanimity are immeasurable and cannot be collected, if pity, joy, and equanimity are immeasurable and cannot be collected, then it's not that pity, joy, and equanimity are immeasurable.",
        "source": "T06n0220_325:0661b12_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661b13_10"
    },
    {
        "source_sentence": "空無邊處不可攝受故，若空無邊處不可攝受則非空無邊處；",
        "translation": "Because the sphere of infinity of space cannot be grasped. If the sphere of infinity of space cannot be grasped, then it is no infinity of space.",
        "source": "T06n0220_325:0661b13_11"
    },
    {
        "source_sentence": "識無邊處、無所有處、非想非非想處不可攝受故，若識無邊處、無所有處、非想非非想處不可攝受則非識無邊處、無所有處、非想非非想處。",
        "translation": "Because the boundlessness of consciousness, the absence of existence and the abode of neither perception nor non-perception can't be collected, if the boundlessness of consciousness, the absence of existence and the abode of neither perception nor non-perception can't be collected, then it's not the boundlessness of",
        "source": "T06n0220_325:0661b15_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661b19_0"
    },
    {
        "source_sentence": "布施波羅蜜多不可攝受故，若布施波羅蜜多不可攝受則非布施波羅蜜多；",
        "translation": "Because the perfection of giving cannot be grasped, if the perfection of giving cannot be grasped, then it is not the perfection of giving.",
        "source": "T06n0220_325:0661b19_1"
    },
    {
        "source_sentence": "淨戒、安忍、精進、靜慮、般若波羅蜜多不可攝受故，若淨戒、安忍、精進、靜慮、般若波羅蜜多不可攝受則非淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "If the pure precepts, patience, effort, meditation, and prajñāpāramitā are not collected, then they aren't the pure precepts, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T06n0220_325:0661b20_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661b24_0"
    },
    {
        "source_sentence": "內空不可攝受故，若內空不可攝受則非內空；",
        "translation": "Because internal emptiness cannot be grasped. If internal emptiness were not grasped, then it would not be internal emptiness.",
        "source": "T06n0220_325:0661b24_1"
    },
    {
        "source_sentence": "外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空不可攝受故，",
        "translation": "It's because external emptiness, internal and external emptiness, emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all dhar",
        "source": "T06n0220_325:0661b25_2"
    },
    {
        "source_sentence": "若外空乃至無性自性空不可攝受則非外空乃至無性自性空。",
        "translation": "If external emptiness or even the emptiness of the self-nature of nonexistence cannot be collected, then it's not external emptiness or even the emptiness of the self-nature of nonexistence.",
        "source": "T06n0220_325:0661b28_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c01_4"
    },
    {
        "source_sentence": "真如不可攝受故，若真如不可攝受則非真如；",
        "translation": "Because true thusness cannot be grasped, and if true thusness cannot be grasped, then it is not true thusness.",
        "source": "T06n0220_325:0661c01_5"
    },
    {
        "source_sentence": "法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界不可攝受故，",
        "translation": "It's because the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, the space realm, and the inconceivable realm can't be collected.",
        "source": "T06n0220_325:0661c02_6"
    },
    {
        "source_sentence": "若法界乃至不思議界不可攝受則非法界乃至不思議界。",
        "translation": "If the Dharma realm or even the inconceivable realm can't be collected, then the non-dharma realm or even the inconceivable realm.",
        "source": "T06n0220_325:0661c04_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c05_8"
    },
    {
        "source_sentence": "四念住不可攝受故，若四念住不可攝受則非四念住；",
        "translation": "Because the four abodes of mindfulness are not to be grasped. If the four abodes of mindfulness were not to be grasped, then they would not be the four abodes of mindfulness.",
        "source": "T06n0220_325:0661c05_9"
    },
    {
        "source_sentence": "四正斷、四神足、五根、五力、七等覺支、八聖道支不可攝受故，若四正斷乃至八聖道支不可攝受則非四正斷乃至八聖道支。",
        "translation": "It's because the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path can't be collected, and if the fourfold correct elimination or even the eight noble factors of the path can't be collected, then it's not the",
        "source": "T06n0220_325:0661c07_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c09_11"
    },
    {
        "source_sentence": "苦聖諦不可攝受故，若苦聖諦不可攝受則非苦聖諦；",
        "translation": "Because the noble truth of suffering cannot be grasped. If the noble truth of suffering could not be grasped, then it would not be a noble truth of suffering.",
        "source": "T06n0220_325:0661c10_12"
    },
    {
        "source_sentence": "集、滅、道聖諦不可攝受故，若集、滅、道聖諦不可攝受則非集、滅、道聖諦。",
        "translation": "Because the noble truths of arising, ceasing, and the path can't be collected, if the noble truths of arising, ceasing, and the path can't be collected, then they aren't the noble truths of arising, ceasing, and the path.",
        "source": "T06n0220_325:0661c11_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c12_14"
    },
    {
        "source_sentence": "八解脫不可攝受故，若八解脫不可攝受則非八解脫；",
        "translation": "Because the eight liberations are ungraspable. If the eight liberations were ungraspable, they would not be the eight liberations.",
        "source": "T06n0220_325:0661c13_0"
    },
    {
        "source_sentence": "八勝處、九次第定、十遍處不可攝受故，若八勝處、九次第定、十遍處不可攝受則非八勝處、九次第定、十遍處。",
        "translation": "It's because the eight abodes of excellence, nine graduated concentrations, and ten universal abodes can't be collected, and if the eight abodes of excellence, nine graduated concentrations, and ten universal abodes can't be collected, then they aren't the eight abodes of excellence, nine graduated concentrations, or ten universal abodes.",
        "source": "T06n0220_325:0661c14_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c16_2"
    },
    {
        "source_sentence": "空解脫門不可攝受故，若空解脫門不可攝受則非空解脫門；",
        "translation": "Because the door of liberation through emptiness cannot be grasped. If the door of liberation through emptiness cannot be grasped, then it is no door of liberation through emptiness.",
        "source": "T06n0220_325:0661c16_3"
    },
    {
        "source_sentence": "無相、無願解脫門不可攝受故，若無相、無願解脫門不可攝受則非無相、無願解脫門。",
        "translation": "Because the liberation gate of marklessness and wishlessness can't be collected, if the liberation gate of marklessness and wishlessness can't be collected, then it's not the liberation gate of marklessness and wishlessness.",
        "source": "T06n0220_325:0661c18_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c20_5"
    },
    {
        "source_sentence": "極喜地不可攝受故，若極喜地不可攝受則非極喜地；",
        "translation": "Because the state of ultimate bliss cannot be grasped. When the state of ultimate bliss cannot be grasped, it is no state of ultimate bliss.",
        "source": "T06n0220_325:0661c20_6"
    },
    {
        "source_sentence": "離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地不可攝受故，",
        "translation": "It's because the ground of freedom from defilement, the ground of emission of light, the ground of blazing wisdom, the ground of extreme difficulty, the ground of presence, the ground of distant action, the ground of immovability, the ground of good wisdom, and the ground of the cloud of dharmas can't be collected.",
        "source": "T06n0220_325:0661c21_7"
    },
    {
        "source_sentence": "若離垢地乃至法雲地不可攝受則非離垢地乃至法雲地。",
        "translation": "If the ground of freedom from defilement or even the ground of the Dharma-cloud can't be collected, then it's not the ground of freedom from defilement or even the ground of the Dharma-cloud.",
        "source": "T06n0220_325:0661c23_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c24_9"
    },
    {
        "source_sentence": "五眼不可攝受故，若五眼不可攝受則非五眼；",
        "translation": "Because the five eyes are not to be grasped. If the five eyes were not to be grasped, they would not be the five eyes.",
        "source": "T06n0220_325:0661c24_10"
    },
    {
        "source_sentence": "六神通不可攝受故，若六神通不可攝受則非六神通。",
        "translation": "It's because the six supernormal powers can't be collected, and if the six supernormal powers can't be collected, then they aren't the six supernormal powers.",
        "source": "T06n0220_325:0661c25_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0661c27_12"
    },
    {
        "source_sentence": "三摩地門不可攝受故，若三摩地門不可攝受則非三摩地門；",
        "translation": "If the approach of concentration were not to be grasped, it would not be the approach of concentration.",
        "source": "T06n0220_325:0661c27_13"
    },
    {
        "source_sentence": "陀羅尼門不可攝受故，若陀羅尼門不可攝受則非陀羅尼門。",
        "translation": "Because the dhāraṇī aspect can't be collected, if the dhāraṇī aspect can't be collected, then it's not the dhāraṇī aspect.",
        "source": "T06n0220_325:0661c28_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a01_15"
    },
    {
        "source_sentence": "佛十力不可攝受故，若佛十力不可攝受則非佛十力；",
        "translation": "Because the ten powers of buddhas cannot be grasped. If the ten powers of buddhas cannot be grasped, then they are not the ten powers of buddhas.",
        "source": "T06n0220_325:0662a01_16"
    },
    {
        "source_sentence": "四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法不可攝受故，",
        "translation": "Because the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 unique qualities of buddhahood cannot be grasped.",
        "source": "T06n0220_325:0662a02_17"
    },
    {
        "source_sentence": "若四無所畏乃至十八佛不共法不可攝受則非四無所畏乃至十八佛不共法。",
        "translation": "If the four fearlessnesses and even the 18 Buddha-uncommon dharmas can't be collected, then they aren't the four fearlessnesses or even the 18 Buddha-uncommon dharmas.",
        "source": "T06n0220_325:0662a04_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a05_1"
    },
    {
        "source_sentence": "十二緣起順逆觀不可攝受故，若十二緣起順逆觀不可攝受則非十二緣起順逆觀。",
        "translation": "Because the twelve contemplations that are accompanied by conditions as direct antecedent cannot be grasped. If the twelve contemplations that are accompanied by conditions as direct antecedent cannot be grasped, then they are not the twelve contemplations that are accompanied by conditions as direct antecedent.",
        "source": "T06n0220_325:0662a05_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a07_3"
    },
    {
        "source_sentence": "知苦、斷集、證滅、修道不可攝受故，若知苦、斷集、證滅、修道不可攝受則非知苦、斷集、證滅、修道。",
        "translation": "It's because knowing that suffering, cessation, arising, realization, cessation, and cultivation can't be collected, and if knowing that suffering, cessation, arising, realization, cessation, and cultivation can't be collected, then it's not knowing that suffering, cessation, arising, realization, cessation, and cultiva",
        "source": "T06n0220_325:0662a07_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a10_5"
    },
    {
        "source_sentence": "預流果不可攝受故，若預流果不可攝受則非預流果；",
        "translation": "The fruit of stream-winner cannot be grasped. If the fruit of stream-winner is not grasped, then it is no fruit of stream-winner.",
        "source": "T06n0220_325:0662a10_6"
    },
    {
        "source_sentence": "一來、不還、阿羅漢果不可攝受故，若一來、不還、阿羅漢果不可攝受則非一來、不還、阿羅漢果。",
        "translation": "Because the once-returner, nonreturner, and arhatship fruits can't be collected, if the once-returner, nonreturner, and arhatship fruits can't be collected, then they aren't the once-returner, nonreturner, or arhatship fruits.",
        "source": "T06n0220_325:0662a11_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a13_8"
    },
    {
        "source_sentence": "獨覺菩提不可攝受故，若獨覺菩提不可攝受則非獨覺菩提。",
        "translation": "Because the enlightenment of the solitary realizer can't be collected, if the enlightenment of the solitary realizer can't be collected, then it's not the enlightenment of the solitary realizer.",
        "source": "T06n0220_325:0662a13_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a15_10"
    },
    {
        "source_sentence": "入菩薩正性離生位不可攝受故，若入菩薩正性離生位不可攝受則非入菩薩正性離生位。",
        "translation": "Because entering the bodhisattva's true nature is free of the state of nonproduction and cannot be collected, if entering the bodhisattva's true nature is free of the state of nonproduction and cannot be collected, then it's not entering the bodhisattva's true nature that is free of the state of nonproduction.",
        "source": "T06n0220_325:0662a15_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a17_12"
    },
    {
        "source_sentence": "嚴淨佛土不可攝受故，若嚴淨佛土不可攝受則非嚴淨佛土。",
        "translation": "Because the Buddha land of adornment and purity can't be collected, if the Buddha land of adornment and purity can't be collected, then it's not the Buddha land of adornment and purity.",
        "source": "T06n0220_325:0662a17_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a18_14"
    },
    {
        "source_sentence": "成熟有情不可攝受故，若成熟有情不可攝受則非成熟有情。",
        "translation": "It's because ripening sentient beings can't be collected, and if ripening sentient beings can't be collected, then it's not ripening sentient beings.",
        "source": "T06n0220_325:0662a18_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a20_16"
    },
    {
        "source_sentence": "菩薩神通不可攝受故，若菩薩神通不可攝受則非菩薩神通。",
        "translation": "Because the bodhisattva's supernormal powers can't be collected, if the bodhisattva's supernormal powers can't be collected, then it's not the bodhisattva's supernormal powers.",
        "source": "T06n0220_325:0662a20_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a21_18"
    },
    {
        "source_sentence": "一切智不可攝受故，若一切智不可攝受則非一切智；",
        "translation": "Because omniscience cannot be grasped. If omniscience cannot be grasped, then it is not omniscience.",
        "source": "T06n0220_325:0662a21_19"
    },
    {
        "source_sentence": "道相智、一切相智不可攝受故，若道相智、一切相智不可攝受則非道相智、一切相智。",
        "translation": "Because knowledge of the path's characteristics and omniscience can't be collected, if knowledge of the path's characteristics and omniscience can't be collected, then it's not knowledge of the path or omniscience.",
        "source": "T06n0220_325:0662a23_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a25_21"
    },
    {
        "source_sentence": "斷一切煩惱相續習氣不可攝受故，若斷一切煩惱相續習氣不可攝受則非斷一切煩惱相續習氣。",
        "translation": "Because the permeations that cut off the stream of all defilements cannot be grasped. If the permeations that cut off the stream of all defilements cannot be grasped, then it is not the permeations that cut off the stream of all defilements.",
        "source": "T06n0220_325:0662a25_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662a27_23"
    },
    {
        "source_sentence": "無忘失法不可攝受故，若無忘失法不可攝受則非無忘失法；",
        "translation": "Because the dharmas free from forgetfulness cannot be grasped. If the dharmas free from forgetfulness cannot be grasped, then they are not the dharmas free from forgetfulness.",
        "source": "T06n0220_325:0662a27_24"
    },
    {
        "source_sentence": "恒住捨性不可攝受故，若恒住捨性不可攝受則非恒住捨性。",
        "translation": "It's because the nature of constantly abiding equanimity can't be collected, and if the nature of constantly abiding equanimity can't be collected, then it's not the nature of constantly abiding equanimity.",
        "source": "T06n0220_325:0662a28_25"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662b01_26"
    },
    {
        "source_sentence": "圓滿壽量不可攝受故，若圓滿壽量不可攝受則非圓滿壽量。",
        "translation": "It's because the measure of perfect longevity can't be collected, and if the measure of perfect longevity can't be collected, then it's not the measure of perfect longevity.",
        "source": "T06n0220_325:0662b01_27"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662b02_28"
    },
    {
        "source_sentence": "轉法輪不可攝受故，若轉法輪不可攝受則非轉法輪。",
        "translation": "Because the turning of the wheel of the Dharma is unacceptable, if the turning of the wheel of the Dharma is unacceptable, then it's not the turning of the Dharma wheel.",
        "source": "T06n0220_325:0662b03_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662b04_1"
    },
    {
        "source_sentence": "正法住不可攝受故，若正法住不可攝受則非正法住。」",
        "translation": "It's because the abiding of the right teaching is unacceptable, and if the abiding of the right teaching is unacceptable, it's not the abiding of the right teaching.",
        "source": "T06n0220_325:0662b04_2"
    },
    {
        "source_sentence": "說是菩薩住品時，萬二千菩薩摩訶薩得無生法忍。",
        "translation": "When this chapter on the bodhisattva's abode was taught, 12,000 bodhisattvas and mahāsattvas attained the tolerance of the nonarising of the Dharma.",
        "source": "T06n0220_325:0662b05_3"
    },
    {
        "source_sentence": "初分不退轉品第四十九之一",
        "translation": "The Forty-nineth Chapter of the First Part of the chapter on Non-backsliding",
        "source": "T06n0220_325:0662b07_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_325:0662b08_0"
    },
    {
        "source_sentence": "不退轉菩薩摩訶薩有何行、有何狀、有何相？",
        "translation": "What's the practice, form, and characteristics of the nonretrogressing bodhisattva-mahāsattva?",
        "source": "T06n0220_325:0662b08_1"
    },
    {
        "source_sentence": "我等云何知是不退轉菩薩摩訶薩？」",
        "translation": "How do we know that we are the nonretrogressing bodhisattvas and mahāsattvas?",
        "source": "T06n0220_325:0662b09_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_325:0662b10_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩能如實知諸異生地、諸聲聞地、諸獨覺地、諸菩薩地、諸如來地，",
        "translation": "“If great enlightening beings can truly know the stages of worldlings, śrāvakas, solitary realizers, bodhisattvas, and buddhas,",
        "source": "T06n0220_325:0662b10_4"
    },
    {
        "source_sentence": "如是諸地於諸法真如中無變異、無分別，皆無二無二分，是菩薩摩訶薩雖如實悟入諸法真如，",
        "translation": "Thus, these stages are unchanging and nondiscriminating in the true nature of all dharmas, without duality or distinction—this is how the great enlightening being enters into the true nature of all dharmas, though truly awakened to them.",
        "source": "T06n0220_325:0662b12_5"
    },
    {
        "source_sentence": "而於諸法真如無所分別，以無所得為方便故。",
        "translation": "They don't discriminate between the true nature of dharmas because they have nothing to attain as their method.",
        "source": "T06n0220_325:0662b14_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩既如實悟入諸法真如已，雖聞真如與一切法無二無別而無疑滯。",
        "translation": "After truly awakening to the true nature of all dharmas, this bodhisattva Mahāsattva hears that the true nature and all dharmas are neither the same nor different but without doubt.",
        "source": "T06n0220_325:0662b15_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662b17_8"
    },
    {
        "source_sentence": "真如與一切法不可說一異、俱不俱故。",
        "translation": "The true nature and all dharmas can't be described as one and the same or different, because they are both.",
        "source": "T06n0220_325:0662b17_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩終不輕爾而發語言，所發語言皆引義利，若無義利終不發言。",
        "translation": "This is a bodhisattva-mahāsattva who never speaks lightly, and all the words he speaks lead to meaningful benefits, and if there are meaningless benefits, he never speaks.",
        "source": "T06n0220_325:0662b18_10"
    },
    {
        "source_sentence": "是菩薩摩訶薩不觀視他好惡長短，平等憐愍而為說法。",
        "translation": "This is the bodhisattva Mahāsattva who doesn't look at the good and bad qualities of others and speaks for them with equanimity and pity without observing their length.",
        "source": "T06n0220_325:0662b20_11"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662b21_12"
    },
    {
        "source_sentence": "不退轉菩薩摩訶薩有如是等諸行、狀、相，應以如是諸行、狀、相，知是不退轉菩薩摩訶薩。」",
        "translation": "The nonretrogressing bodhisattva Mahāsattva has such-and-such forms, shapes, and characteristics, so you should know that the nonretrogressing bodhisattva Mahāsattva has such-and-such forms, shapes, and characteristics.",
        "source": "T06n0220_325:0662b21_13"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_325:0662b24_0"
    },
    {
        "source_sentence": "復以何行、何狀、何相，知是不退轉菩薩摩訶薩？」",
        "translation": "What are the practices, forms, and characteristics of the bodhisattva-mahāsattva who knows nonretrogression?",
        "source": "T06n0220_325:0662b24_1"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_325:0662b25_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩能觀一切法無行、無狀、無相，當知是為不退轉菩薩摩訶薩。」",
        "translation": "If a bodhisattva-mahāsattva can observe that all things lack form, formlessness, and marklessness, you should know that this is the nonretrogressing bodhisattva-mahāsattva.",
        "source": "T06n0220_325:0662b25_3"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_325:0662b27_4"
    },
    {
        "source_sentence": "若一切法無行、無狀、無相，是菩薩摩訶薩於何法退轉故名不退轉？」",
        "translation": "If all things lack form, formlessness, and marklessness, what is the name of the bodhisattva-mahāsattva that doesn't regress because it's called nonretrogressing?",
        "source": "T06n0220_325:0662b28_5"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_325:0662b29_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩於色退轉故名不退轉，於受、想、行、識退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in form, and it's called nonretrogression because he regresses in feeling, perception, volition, and consciousness.",
        "source": "T06n0220_325:0662b29_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662c02_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662c02_9"
    },
    {
        "source_sentence": "色自性無所有，受、想、行、識自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of form has no existence, and the self-natures of feeling, perception, volition, and consciousness also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0662c02_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662c04_11"
    },
    {
        "source_sentence": "是菩薩摩訶薩於眼處退轉故名不退轉，於耳、鼻、舌、身、意處退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in the eye, and it's called nonretrogression because he regresses in the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_325:0662c04_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662c06_13"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662c06_14"
    },
    {
        "source_sentence": "眼處自性無所有，耳、鼻、舌、身、意處自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the eye realm has no existence, and the self-natures of the ear, nose, tongue, body, and mind realms also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide there.",
        "source": "T06n0220_325:0662c06_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662c08_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩於色處退轉故名不退轉，於聲、香、味、觸、法處退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in the form realm, and it's called nonretrogression because he regresses in the sound, smell, taste, touch, and dharma realms.",
        "source": "T06n0220_325:0662c08_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662c10_18"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662c10_19"
    },
    {
        "source_sentence": "色處自性無所有，聲、香、味、觸、法處自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the form realm has no existence, and the self-natures of sound, odor, taste, touch, and dharmas also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide there.",
        "source": "T06n0220_325:0662c10_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662c12_21"
    },
    {
        "source_sentence": "是菩薩摩訶薩於眼界退轉故名不退轉，於耳、鼻、舌、身、意界退轉故名不退轉。",
        "translation": "It's called nonretrogression because the bodhisattva Mahāsattva regresses in the eye realm and it's called nonretrogression because he regresses in the ear, nose, tongue, body, and mind realms.",
        "source": "T06n0220_325:0662c13_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662c14_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662c14_2"
    },
    {
        "source_sentence": "眼界自性無所有故，耳、鼻、舌、身、意界自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "Because the self-nature of the eye realm has no existence, the self-natures of the ear, nose, tongue, body, and mind realms also have no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide in them.",
        "source": "T06n0220_325:0662c15_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662c16_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩於色界退轉故名不退轉，於聲、香、味、觸、法界退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in the form realm and it's called nonretrogression because he regresses in the sound, smell, taste, touch, and dharma realms.",
        "source": "T06n0220_325:0662c17_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662c18_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662c19_0"
    },
    {
        "source_sentence": "色界自性無所有，聲、香、味、觸、法界自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the form realm has no existence, and the self-natures of sound, odor, taste, touch, and the Dharma realm also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0662c19_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662c21_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩於眼識界退轉故名不退轉，於耳、鼻、舌、身、意識界退轉故名不退轉。",
        "translation": "It's called nonretrogression because the bodhisattva Mahāsattva regresses in the eye consciousness realm and it's called nonretrogression because he regresses in the ear, nose, nose, tongue, body, and consciousness realms.",
        "source": "T06n0220_325:0662c21_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662c23_4"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662c23_5"
    },
    {
        "source_sentence": "眼識界自性無所有，耳、鼻、舌、身、意識界自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the eye consciousness realm has no existence, and the self-natures of the ear, nose, tongue, body, body, and consciousness realms also have no existence. This is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0662c23_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662c25_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩於眼觸退轉故名不退轉，於耳、鼻、舌、身、意觸退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from eye contact, and it's called nonretrogression because he regresses from ear, nose, nose, tongue, body, and mind contact.",
        "source": "T06n0220_325:0662c25_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0662c27_9"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0662c27_10"
    },
    {
        "source_sentence": "眼觸自性無所有，耳、鼻、舌、身、意觸自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of eye contact has no existence, and the self-natures of ear, nose, tongue, body, and mind contact also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0662c27_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0662c29_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩於眼觸為緣所生諸受退轉故名不退轉，於耳、鼻、舌、身、意觸為緣所生諸受退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva's sensations that arise from eye contact as a condition are called nonretrogressing and it's called nonretrogression because the sensations that arise from ear, nose, nose, tongue, body, and mind contact as a condition are called nonretrogressing.",
        "source": "T06n0220_325:0662c29_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663a03_14"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663a03_15"
    },
    {
        "source_sentence": "眼觸為緣所生諸受自性無所有，耳、鼻、舌、身、意觸為緣所生諸受自性亦無所有，",
        "translation": "The own-natures of sensations that arise from visual contact as a condition have no existence, and the own-natures of sensations that arise from ear, nose, tongue, body, and mind contact as a condition also have no existence.",
        "source": "T06n0220_325:0663a03_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩於中不住故名退轉。",
        "translation": "This is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663a05_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663a06_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩於地界退轉故名不退轉，於水、火、風、空、識界退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in the earth realm and it's called nonretrogression because he regresses in the water, fire, wind, air, space, and consciousness realms.",
        "source": "T06n0220_325:0663a06_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663a07_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663a08_3"
    },
    {
        "source_sentence": "地界自性無所有，水、火、風、空、識界自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the earth realm has no existence, and the self-natures of water, fire, wind, air, space, and consciousness also have no existence. This is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663a08_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663a10_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩於無明退轉故名不退轉，於行、識、名色、六處、觸、受、愛、取、有、生、老死退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from ignorance, and it's called nonretrogression because he regresses from form, consciousness, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehension, existence, birth, old age, and death.",
        "source": "T06n0220_325:0663a10_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663a12_7"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663a12_8"
    },
    {
        "source_sentence": "無明自性無所有，行乃至老死自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of nescience has no existence, and the self-nature of volition or even old age and death also has no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663a12_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663a14_10"
    },
    {
        "source_sentence": "是菩薩摩訶薩於布施波羅蜜多退轉故名不退轉，於淨戒、安忍、精進、靜慮、般若波羅蜜多退轉故名不退轉。",
        "translation": "This is called nonregression because the bodhisattva Mahāsattva regresses from the perfection of generosity, and it's called nonregression because he regresses from the perfections of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T06n0220_325:0663a14_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663a17_12"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663a17_13"
    },
    {
        "source_sentence": "布施波羅蜜多自性無所有，淨戒、安忍、精進、靜慮、般若波羅蜜多自性亦無所有，",
        "translation": "The self-nature of the perfection of generosity has nothing, and the self-natures of pure morality, patience, effort, meditation, and prajñāpāramitā also have nothing.",
        "source": "T06n0220_325:0663a17_14"
    },
    {
        "source_sentence": "是菩薩摩訶薩於中不住故名退轉。",
        "translation": "This is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663a19_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663a20_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩於內空退轉故名不退轉，於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空退轉故名不退轉。",
        "translation": "This is called nonbacksliding because the bodhisattva Mahāsattva regresses from internal emptiness, and it's called nonbacksliding because he regresses from external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change,",
        "source": "T06n0220_325:0663a20_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663a24_18"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663a25_19"
    },
    {
        "source_sentence": "內空自性無所有，外空乃至無性自性空自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of internal emptiness has no existence, and the self-nature of external emptiness or even the self-nature of emptiness without nature has no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663a25_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663a27_21"
    },
    {
        "source_sentence": "是菩薩摩訶薩於真如退轉故名不退轉，於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from the true reality and is called nonretrogressing when he regresses from the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from birth, legality, Dharma abiding, reality, space realm, and inconceivable realms",
        "source": "T06n0220_325:0663a27_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663b01_23"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663b01_24"
    },
    {
        "source_sentence": "真如自性無所有，法界乃至不思議界自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of true thusness has no existence, and the self-nature of the Dharma realm or even the inconceivable realm also has no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide there.",
        "source": "T06n0220_325:0663b01_25"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663b04_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩於四念住退轉故名不退轉，於四正斷、四神足、五根、五力、七等覺支、八聖道支退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from the four abodes of mindfulness, and it's called nonretrogression because he regresses from the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_325:0663b04_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663b06_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663b06_3"
    },
    {
        "source_sentence": "四念住自性無所有，四正斷乃至八聖道支自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the four abodes of mindfulness has no existence, and the self-nature of the fourfold correct elimination and even the eightfold noble path have no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide in them.",
        "source": "T06n0220_325:0663b06_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663b09_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩於苦聖諦退轉故名不退轉，於集、滅、道聖諦退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in the noble truth of suffering, and it's called nonretrogression because he regresses in the noble truths of arising, ceasing, and the path.",
        "source": "T06n0220_325:0663b09_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663b11_0"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663b11_1"
    },
    {
        "source_sentence": "苦聖諦自性無所有，集、滅、道聖諦自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the noble truth of suffering has no existence, and the self-natures of the noble truths of arising, ceasing, and the path also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663b11_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663b13_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩於四靜慮退轉故名不退轉，於四無量、四無色定退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in the four meditations, and it's called nonretrogression because he regresses in the four immeasurable and four formless concentrations.",
        "source": "T06n0220_325:0663b13_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663b15_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663b15_6"
    },
    {
        "source_sentence": "四靜慮自性無所有，四無量、四無色定自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the four meditations has no existence, and the self-natures of the four immeasurable and four formless concentrations also have no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide in them.",
        "source": "T06n0220_325:0663b15_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663b17_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩於八解脫退轉故名不退轉，於八勝處、九次第定、十遍處退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from the eight liberations, and it's called nonretrogression because he regresses from the eight abodes of excellence, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_325:0663b17_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663b19_10"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663b19_11"
    },
    {
        "source_sentence": "八解脫自性無所有，八勝處、九次第定、十遍處自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the eight liberations has no existence, and the self-natures of the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in them.",
        "source": "T06n0220_325:0663b20_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663b22_13"
    },
    {
        "source_sentence": "是菩薩摩訶薩於空解脫門退轉故名不退轉，於無相、無願解脫門退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from the liberation gate of emptiness, and it's called nonretrogression because he regresses from the liberation gate of signlessness and wishlessness.",
        "source": "T06n0220_325:0663b22_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663b24_15"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663b24_16"
    },
    {
        "source_sentence": "空解脫門自性無所有，無相、無願解脫門自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the gate of liberation through emptiness has no existence, and the self-nature of the gate of liberation through signlessness and wishlessness also has no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663b24_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663b26_18"
    },
    {
        "source_sentence": "是菩薩摩訶薩於五眼退轉故名不退轉，於六神通退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in terms of the five eyes, and it's called nonretrogression because he regresses in terms of the six supernormal powers.",
        "source": "T06n0220_325:0663b26_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663b28_20"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663b28_21"
    },
    {
        "source_sentence": "五眼自性無所有，六神通自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the five eyes has no existence, and the self-nature of the six supernormal powers also has no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663b28_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663c01_23"
    },
    {
        "source_sentence": "是菩薩摩訶薩於三摩地門退轉故名不退轉，於陀羅尼門退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from the approach of samādhi, and it's called nonretrogression because he regresses from the approach of dhāraṇī.",
        "source": "T06n0220_325:0663c01_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663c03_25"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663c03_26"
    },
    {
        "source_sentence": "三摩地門自性無所有，陀羅尼門自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the samādhi aspect has no existence, and the self-nature of the dhāraṇī aspect also has no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663c03_27"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663c05_28"
    },
    {
        "source_sentence": "是菩薩摩訶薩於佛十力退轉故名不退轉，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from the Buddha's ten powers, and it's called nonretrogression because he regresses from the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 uncommon dharmas of the Buddha.",
        "source": "T06n0220_325:0663c05_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663c08_30"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663c08_31"
    },
    {
        "source_sentence": "佛十力自性無所有，四無所畏乃至十八佛不共法自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the Buddha's ten powers has no existence, and the self-nature of the four fearlessnesses or even the self-nature of the 18 buddha-uncommon dharmas also has no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide there.",
        "source": "T06n0220_325:0663c08_32"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663c11_33"
    },
    {
        "source_sentence": "是菩薩摩訶薩於預流果退轉故名不退轉，於一來、不還、阿羅漢果退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from the fruit of pre-flow, and it's called nonretrogression because he regresses from the once-returner, nonreturner, and arhat.",
        "source": "T06n0220_325:0663c11_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663c13_35"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663c13_36"
    },
    {
        "source_sentence": "預流果自性無所有，一來、不還、阿羅漢果自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of the fruit of pre-flow has no existence, and the self-natures of the once-returner, nonreturner, and arhatship have no existence either; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in them.",
        "source": "T06n0220_325:0663c13_37"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663c15_38"
    },
    {
        "source_sentence": "是菩薩摩訶薩於獨覺菩提退轉故名不退轉。",
        "translation": "This is called nonbacksliding because the bodhisattva Mahāsattva regresses from the solitary realizer's enlightenment.",
        "source": "T06n0220_325:0663c15_39"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663c16_40"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663c16_41"
    },
    {
        "source_sentence": "獨覺菩提自性無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of pratyekabuddha's enlightenment has no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663c17_42"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663c18_43"
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切智退轉故名不退轉，於道相智、一切相智退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in all cognition and it's called nonretrogression because he regresses in knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_325:0663c18_44"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663c20_45"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663c20_46"
    },
    {
        "source_sentence": "一切智自性無所有，道相智、一切相智自性亦無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of omniscience has no existence, and the self-natures of knowledge of the path and knowledge of all characteristics also have no existence; this is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663c20_47"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663c22_48"
    },
    {
        "source_sentence": "是菩薩摩訶薩於異生地退轉故名不退轉，於聲聞地、獨覺地、菩薩地、如來地退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses in the stage of worldlings, and it's called nonretrogression because he regresses in the stages of śrāvakas, pratyekbuddhas, bodhisattvas, and tathāgatas.",
        "source": "T06n0220_325:0663c22_49"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663c25_50"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663c25_51"
    },
    {
        "source_sentence": "異生地自性無所有，聲聞地、獨覺地、菩薩地、如來地自性亦無所有，",
        "translation": "The self-nature of the stage of worldlings has no existence, nor does the self-nature of the stages of disciples, solitary realizers, bodhisattvas, and buddhas have any existence.",
        "source": "T06n0220_325:0663c25_52"
    },
    {
        "source_sentence": "是菩薩摩訶薩於中不住故名退轉。",
        "translation": "This is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663c26_53"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_325:0663c27_54"
    },
    {
        "source_sentence": "是菩薩摩訶薩於阿耨多羅三藐三菩提退轉故名不退轉。",
        "translation": "This is called nonretrogression because the bodhisattva Mahāsattva regresses from unsurpassed, correct, and complete enlightenment.",
        "source": "T06n0220_325:0663c27_55"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_325:0663c29_56"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0663c29_57"
    },
    {
        "source_sentence": "阿耨多羅三藐三菩提自性無所有，是菩薩摩訶薩於中不住故名退轉。",
        "translation": "The self-nature of unsurpassed, correct, and complete enlightenment has no existence, which is called retrogression because the bodhisattva Mahāsattva doesn't abide in it.",
        "source": "T06n0220_325:0663c29_58"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_325:0664a02_59"
    },
    {
        "source_sentence": "若不退轉位菩薩摩訶薩終不樂觀外道沙門、婆羅門等形相言說，彼諸沙門、婆羅門等於所知法實知實見，",
        "translation": "If a bodhisattva-mahāsattva in the stage of nonretrogression never delights in observing the forms and words of non-Buddhist ascetics or priests, those ascetics and priests will really know and really see the teaching that they know.",
        "source": "T06n0220_325:0664a02_60"
    },
    {
        "source_sentence": "或能施設正見法門必無是處。",
        "translation": "Perhaps it's possible to define the teaching of right view, but there must be no place for it.",
        "source": "T06n0220_325:0664a04_61"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0664a05_62"
    },
    {
        "source_sentence": "若成就如是諸行、狀、相，當知是為不退轉菩薩摩訶薩。",
        "translation": "If someone accomplishes these kinds of practices, forms, and characteristics, they should be known to be a bodhisattva-mahāsattva who doesn't regress.",
        "source": "T06n0220_325:0664a05_63"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_325:0664a06_64"
    },
    {
        "source_sentence": "若不退轉位菩薩摩訶薩於佛善說法毘奈耶，深生信解終無疑惑，無戒禁取不墮惡見，",
        "translation": "If a bodhisattva-mahāsattva in the stage of nonretrogression well explains the Buddha’s good teaching on the Vinaya, and if he deeply believes and understands it, there will never be doubt or confusion. He will have no attachment to precepts or prohibitions and won’t fall into bad views.",
        "source": "T06n0220_325:0664a07_65"
    },
    {
        "source_sentence": "不執世俗諸吉祥事以為清淨，終不禮敬諸餘天神，如諸世間外道所事，",
        "translation": "They don't cling to worldly auspicious deeds as pure, and they never venerate other heavenly gods or goddesses, just as non-Buddhists in the world serve them.",
        "source": "T06n0220_325:0664a09_66"
    },
    {
        "source_sentence": "亦終不以種種華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、伎樂、燈明供養天神及諸外道。",
        "translation": "Nor will they offer various kinds of flower garlands, ointments, such fragrances as perfumes, clothing, jewelry, jeweled banners, canopies, music, and lamps to gods and non-Buddhists.",
        "source": "T06n0220_325:0664a10_67"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0664a12_68"
    },
    {
        "source_sentence": "若成就如是諸行、狀、相，當知是為不退轉菩薩摩訶薩。",
        "translation": "If someone accomplishes these kinds of practices, forms, and characteristics, they should be known to be a bodhisattva-mahāsattva who doesn't regress.",
        "source": "T06n0220_325:0664a12_69"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_325:0664a14_0"
    },
    {
        "source_sentence": "若不退轉位菩薩摩訶薩，不生地獄、傍生、鬼界、阿素洛中，亦不生於卑賤種族，",
        "translation": "If a bodhisattva-mahāsattva in the stage of nonretrogression doesn't grow up in hell, animals, ghosts, or asuras, and doesn't grow up into inferior races,",
        "source": "T06n0220_325:0664a14_1"
    },
    {
        "source_sentence": "謂旃荼羅、補羯娑等，亦終不受扇[打-丁+虎]、半擇、無形、二形及女人身，",
        "translation": "It means that the caṇḍāla and upāsaka are also ultimately not accepted as a fan [ding-ding+虎], a half- choice, formless, two forms, or female body.",
        "source": "T06n0220_325:0664a16_0"
    },
    {
        "source_sentence": "亦復不受盲聾、瘖瘂、攣躄、癲癎、矬陋等身，亦終不生無暇時處。",
        "translation": "Again, they won't accept a body that's blind, deaf, dumb, licentious, convulsed, or crippled, and so forth, and they'll never be born in a place where there's no leisure.",
        "source": "T06n0220_325:0664a17_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0664a18_2"
    },
    {
        "source_sentence": "若成就如是諸行、狀、相，當知是為不退轉菩薩摩訶薩。",
        "translation": "If someone accomplishes these kinds of practices, forms, and characteristics, they should be known to be a bodhisattva-mahāsattva who doesn't regress.",
        "source": "T06n0220_325:0664a18_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_325:0664a20_4"
    },
    {
        "source_sentence": "若不退轉位菩薩摩訶薩常樂受行十善業道，自離害生命，亦勸他離害生命，",
        "translation": "“If great enlightening beings in the stage of nonregression always delight in accepting and carrying out the ten paths of good action, they themselves will abstain from harming life and also encourage others to abstain from harming life.",
        "source": "T06n0220_325:0664a20_5"
    },
    {
        "source_sentence": "恒正稱揚離害生命法，歡喜讚歎離害生命者；",
        "translation": "They always correctly praised the principle of freedom from harmful life. They rejoiced and praised those who renounced harmful life.",
        "source": "T06n0220_325:0664a22_6"
    },
    {
        "source_sentence": "自離不與取，亦勸他離不與取，恒正稱揚離不與取法，歡喜讚歎離不與取者；",
        "translation": "They themselves abstain from taking what is not given, and also exhort others to abstain from taking what is not given. They always correctly praise the principle of abstinence from taking what is not given, and they delight in and praise those who abstain from taking what is not given.",
        "source": "T06n0220_325:0664a23_7"
    },
    {
        "source_sentence": "自離欲邪行，亦勸他離欲邪行，恒正稱揚離欲邪行法，歡喜讚歎離欲邪行者；",
        "translation": "They themselves abstain from sexual misconduct, and also exhort others to abstain from sexual misconduct. They always correctly praise the principle of sexual misconduct as avoiding sexual misconduct; they rejoice and praise those who practice it.",
        "source": "T06n0220_325:0664a25_0"
    },
    {
        "source_sentence": "自離虛誑語，亦勸他離虛誑語，恒正稱揚離虛誑語法，歡喜讚歎離虛誑語者；",
        "translation": "They themselves abstain from false speech; they also exhort others to abstain from false speech. They always correctly praise the principle of abstinence from false speech, and rejoice and praise those who abstain from false speech.",
        "source": "T06n0220_325:0664a26_1"
    },
    {
        "source_sentence": "自離麁惡語，亦勸他離麁惡語，恒正稱揚離麁惡語法，歡喜讚歎離麁惡語者；",
        "translation": "They themselves abstain from harsh speech, and also exhort others to abstain from harsh speech. They always correctly praise the principle of abstinence from harsh speech. They delight in and praise those who abstain from harsh speech.",
        "source": "T06n0220_325:0664a28_2"
    },
    {
        "source_sentence": "自離離間語，亦勸他離離間語，恒正稱揚離離間語法，歡喜讚歎離離間語者；",
        "translation": "They themselves abstain from divisive speech, and also exhort others to abstain from divisive speech. They always correctly praise the doctrine of divisive speech; they joyfully praise those who avoid divisive speech.",
        "source": "T06n0220_325:0664b01_3"
    },
    {
        "source_sentence": "自離雜穢語，亦勸他離雜穢語，恒正稱揚離雜穢語法，歡喜讚歎離雜穢語者；",
        "translation": "They themselves abstain from harmful speech, and also encourage others to abstain from harmful speech. They always correctly praise the principle of abstinence from harmful speech; they rejoice and praise those who abstain from harmful speech.",
        "source": "T06n0220_325:0664b03_4"
    },
    {
        "source_sentence": "自離貪欲，亦勸他離貪欲，恒正稱揚離貪欲法，歡喜讚歎離貪欲者；",
        "translation": "Being themselves free of craving, they also encourage others to be free from craving. They always correctly extol the principle of freedom from craving and joyfully praise those who are free from craving.",
        "source": "T06n0220_325:0664b04_5"
    },
    {
        "source_sentence": "自離瞋恚，亦勸他離瞋恚，恒正稱揚離瞋恚法，歡喜讚歎離瞋恚者；",
        "translation": "They themselves abstain from hatred, and also exhort others to abstain from hatred. They always correctly praise the principle of freedom from hatred. They are delighted and praise those who abstain from hatred.",
        "source": "T06n0220_325:0664b06_6"
    },
    {
        "source_sentence": "自離邪見，亦勸他離邪見，恒正稱揚離邪見法，歡喜讚歎離邪見者。",
        "translation": "Being free of wrong views themselves, they also encourage others to be free of wrong views, constantly and correctly praise the principle of freedom from wrong views, rejoicing and praising those who are free of wrong views.",
        "source": "T06n0220_325:0664b07_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩，乃至夢中亦不現起十惡業道，況在覺時！",
        "translation": "This bodhisattva Mahāsattva doesn't show the ten bad courses of action even in a dream, so why wouldn't he do so when awake?",
        "source": "T06n0220_325:0664b09_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0664b10_9"
    },
    {
        "source_sentence": "若成就如是諸行、狀、相，當知是為不退轉菩薩摩訶薩。",
        "translation": "If someone accomplishes these kinds of practices, forms, and characteristics, they should be known to be a bodhisattva-mahāsattva who doesn't regress.",
        "source": "T06n0220_325:0664b10_10"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_325:0664b12_11"
    },
    {
        "source_sentence": "若不退轉位菩薩摩訶薩，普為饒益一切有情恒修布施波羅蜜多，普為饒益一切有情恒修淨戒波羅蜜多，",
        "translation": "“If great enlightening beings in the stage of nonregression always cultivate the perfection of generosity for the benefit of all sentient beings, and always cultivate the perfection of pure morality for the benefit of all sentient beings,",
        "source": "T06n0220_325:0664b12_12"
    },
    {
        "source_sentence": "普為饒益一切有情恒修安忍波羅蜜多，普為饒益一切有情恒修精進波羅蜜多，",
        "translation": "He always cultivates the perfection of patience for the benefit of all sentient beings, and he always cultivates the perfection of effort for the benefit of all sentient beings.",
        "source": "T06n0220_325:0664b14_13"
    },
    {
        "source_sentence": "普為饒益一切有情恒修靜慮波羅蜜多，普為饒益一切有情恒修般若波羅蜜多。",
        "translation": "He always cultivates the perfection of meditation for the benefit of all sentient beings, and he always cultivates the perfection of prajñā for the benefit of all sentient beings.",
        "source": "T06n0220_325:0664b16_14"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0664b18_15"
    },
    {
        "source_sentence": "若成就如是諸行、狀、相，當知是為不退轉菩薩摩訶薩。",
        "translation": "If someone accomplishes these kinds of practices, forms, and characteristics, they should be known to be a bodhisattva-mahāsattva who doesn't regress.",
        "source": "T06n0220_325:0664b18_16"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_325:0664b19_17"
    },
    {
        "source_sentence": "若不退轉位菩薩摩訶薩諸所受持、思惟、讀誦、究竟通利清淨教法，所謂契經、應頌、記莂、諷頌、自說、緣起、本事、本生、方廣、希法、譬喻、論議，",
        "translation": "If the bodhisattva-mahāsattva in the stage of nonretrogression receives, contemplates, recites, and ultimately penetrates the pure teachings that are upheld by the bodhisattva-mahāsattva, they are called scriptures, hymns, assurances, chants, self-explanations, dependent arising, past events, past births,",
        "source": "T06n0220_325:0664b20_18"
    },
    {
        "source_sentence": "以如是法常樂布施一切有情，恒作是念：『云何當令諸有情類，求正法願皆得滿足？』",
        "translation": "Because he always delights in generosity to all sentient beings with such a teaching, he always thinks, 'How will I cause all sentient beings who seek the right teaching to fulfill their vow?'",
        "source": "T06n0220_325:0664b23_19"
    },
    {
        "source_sentence": "復持如是法施善根，與諸有情同共迴向諸佛無上正等菩提。",
        "translation": "He also maintains the good root of giving such a teaching and shares it with sentient beings to return to the unsurpassed perfect enlightenment of the buddhas.",
        "source": "T06n0220_325:0664b25_20"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0664b26_21"
    },
    {
        "source_sentence": "若成就如是諸行、狀、相，當知是為不退轉菩薩摩訶薩。",
        "translation": "If someone accomplishes these kinds of practices, forms, and characteristics, they should be known to be a bodhisattva-mahāsattva who doesn't regress.",
        "source": "T06n0220_325:0664b26_22"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_325:0664b28_0"
    },
    {
        "source_sentence": "若不退轉位菩薩摩訶薩，於佛所說甚深法門，終不生於疑惑猶豫。」",
        "translation": "If a bodhisattva-mahāsattva in the stage of nonretrogression teaches the profound approach of the Dharma taught by the Buddha, he or she will never have doubts or hesitation.",
        "source": "T06n0220_325:0664b28_1"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_325:0664b29_2"
    },
    {
        "source_sentence": "何緣不退轉菩薩摩訶薩，於佛所說甚深法門，終不生於疑惑猶豫？」",
        "translation": "Why does the nonretrogressing bodhisattva Mahāsattva never have doubts or hesitations about the profound teaching taught by the Buddha?",
        "source": "T06n0220_325:0664c01_3"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_325:0664c02_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩都不見有法可疑惑猶豫，謂不見有色，亦不見有受、想、行、識，",
        "translation": "“None of these bodhisattvas, mahāsattvas, see anything that can be doubted. That is to say, they don’t see form, and they don’t see sensation, perception, volition, or consciousness.",
        "source": "T06n0220_325:0664c03_5"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0664c04_6"
    },
    {
        "source_sentence": "不見有眼處，亦不見有耳、鼻、舌、身、意處，可於中生疑惑猶豫；",
        "translation": "If one does not see the eye realm and also does not see the ear, nose, tongue, body, or mind realms, doubt and perplexity may arise in them.",
        "source": "T06n0220_325:0664c05_7"
    },
    {
        "source_sentence": "不見有色處，亦不見有聲、香、味、觸、法處，可於中生疑惑猶豫；",
        "translation": "They do not see the realm of form, and they do not see the realms of sound, smell, taste, touch, or dharmas. Herein they may give rise to doubt and confusion.",
        "source": "T06n0220_325:0664c06_8"
    },
    {
        "source_sentence": "不見有眼界，亦不見有耳、鼻、舌、身、意界，可於中生疑惑猶豫；",
        "translation": "If one does not see the eye realm and also does not see the ear, nose, tongue, body, or mind realms, doubt and perplexity may arise in them.",
        "source": "T06n0220_325:0664c07_9"
    },
    {
        "source_sentence": "不見有色界，亦不見有聲、香、味、觸、法界，可於中生疑惑猶豫；",
        "translation": "They do not see the realm of form, and they do not see sound, odor, taste, touch, or dharmas. In this way, doubt and perplexity may arise in them.",
        "source": "T06n0220_325:0664c09_10"
    },
    {
        "source_sentence": "不見有眼識界，亦不見有耳、鼻、舌、身、意識界，可於中生疑惑猶豫；",
        "translation": "If one does not see the element consciousness of the eye, and if one does not see the ear, nose, tongue, body, and mind realms, it is possible to give rise to doubt and perplexity.",
        "source": "T06n0220_325:0664c10_11"
    },
    {
        "source_sentence": "不見有眼觸，亦不見有耳、鼻、舌、身、意觸，可於中生疑惑猶豫；",
        "translation": "They do not see eye contact, and they do not see ear, nose, tongue, body, or mind contact. Doubt and perplexity may arise in them.",
        "source": "T06n0220_325:0664c12_12"
    },
    {
        "source_sentence": "不見有眼觸為緣所生諸受，亦不見有耳、鼻、舌、身、意觸為緣所生諸受，",
        "translation": "They don’t see sensations that arise from visual contact as a condition, and they don’t see sensations that arise from contact with the ear, nose, tongue, body, or mind as a condition.",
        "source": "T06n0220_325:0664c13_13"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0664c14_14"
    },
    {
        "source_sentence": "不見有地界，亦不見有水、火、風、空、識界，可於中生疑惑猶豫；",
        "translation": "If one does not see the earth realm and also does not see water, fire, wind, space, or the realm of consciousness, doubt and confusion can arise in them.",
        "source": "T06n0220_325:0664c15_15"
    },
    {
        "source_sentence": "不見有無明，亦不見有行、識、名色、六處、觸、受、愛、取、有、生、老死，",
        "translation": "They don’t see nescience, and they don’t see form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, old age, and death.",
        "source": "T06n0220_325:0664c16_16"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0664c18_17"
    },
    {
        "source_sentence": "不見有布施波羅蜜多，亦不見有淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "They don't see the perfection of generosity, and they don't see the perfections of pure morality, patience, effort, meditation, or wisdom.",
        "source": "T06n0220_325:0664c18_18"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0664c20_19"
    },
    {
        "source_sentence": "不見有內空，亦不見有外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They don't see internal emptiness, and they don't see external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature, emptiness of shared characteristics, emp",
        "source": "T06n0220_325:0664c20_20"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0664c24_21"
    },
    {
        "source_sentence": "不見有真如，亦不見有法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "They don’t see the existence of true reality, and they don’t see the Dharma realm, the Dharma nature, the non-falsity, the unchanging and dissimilar nature, equality, freedom from arising, legality, the abiding of things, reality, space, or inconceivable realms.",
        "source": "T06n0220_325:0664c24_22"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0664c26_23"
    },
    {
        "source_sentence": "不見有四念住，亦不見有四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "They don't see the four abodes of mindfulness, nor do they see the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_325:0664c27_24"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0664c29_0"
    },
    {
        "source_sentence": "不見有苦聖諦，亦不見有集、滅、道聖諦，可於中生疑惑猶豫；",
        "translation": "If one does not see the holy truth of suffering and also does not see the holy truths of arising, cessation, and the path, it is possible to give rise to doubt and perplexity.",
        "source": "T06n0220_325:0664c29_1"
    },
    {
        "source_sentence": "不見有四靜慮，亦不見有四無量、四無色定，可於中生疑惑猶豫；",
        "translation": "If one does not see the four kinds of meditation and also does not see the four immeasurable concentrations or the four formless concentrations, doubt and perplexity may arise in them.",
        "source": "T06n0220_325:0665a01_2"
    },
    {
        "source_sentence": "不見有八解脫，亦不見有八勝處、九次第定、十遍處，可於中生疑惑猶豫；",
        "translation": "They do not see the eight liberations, and they do not see the eight spheres of mastery, the nine graduated concentrations, or the ten universals. Doubt and perplexity can arise in them.",
        "source": "T06n0220_325:0665a03_3"
    },
    {
        "source_sentence": "不見有五眼，亦不見有六神通，可於中生疑惑猶豫；",
        "translation": "They do not see the existence of the five eyes, and they do not see the existence of the six supernormal powers. Doubt and perplexity may arise in them.",
        "source": "T06n0220_325:0665a04_4"
    },
    {
        "source_sentence": "不見有三摩地門，亦不見有陀羅尼門，可於中生疑惑猶豫；",
        "translation": "If one does not see any aspect of concentration or any aspect of mental command, and if one does not see any aspect of attainment of absorption or enlightening liberation, doubts and confusions may arise in them.",
        "source": "T06n0220_325:0665a06_5"
    },
    {
        "source_sentence": "不見有佛十力，亦不見有四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，",
        "translation": "They don’t see the Buddha’s ten powers, and they don’t see the four fearlessnesses, the four unhindered understandings, great benevolence, great compassion, great joy, great equanimity, or the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_325:0665a07_6"
    },
    {
        "source_sentence": "可於中生疑惑猶豫；",
        "translation": "They may give rise to doubt and confusion in their minds.",
        "source": "T06n0220_325:0665a09_7"
    },
    {
        "source_sentence": "不見有預流果，亦不見有一來、不還、阿羅漢果，可於中生疑惑猶豫；",
        "translation": "If one does not see the fruit of stream-entry, and also does not see the fruits of enlightenment that are to come, of nonreturning, or of arhatship, it is possible to give rise to doubt and perplexity therein.",
        "source": "T06n0220_325:0665a09_8"
    },
    {
        "source_sentence": "不見有獨覺菩提，可於中生疑惑猶豫；",
        "translation": "If one does not see enlightenment of the self-enlightened ones, doubt and perplexity can arise in them.",
        "source": "T06n0220_325:0665a11_9"
    },
    {
        "source_sentence": "不見有一切智，亦不見有道相智、一切相智，可於中生疑惑猶豫；",
        "translation": "If one does not see omniscience and also does not see the knowledge of the path or the knowledge of all characteristics, it is possible to give rise to doubt and perplexity.",
        "source": "T06n0220_325:0665a12_10"
    },
    {
        "source_sentence": "不見有異生地，亦不見有聲聞地、獨覺地、菩薩地、如來地，可於中生疑惑猶豫；",
        "translation": "They do not see the stage of worldlings, and they do not see the stages of disciples, solitary enlightened ones, bodhisattvas, buddhas, or buddhas.",
        "source": "T06n0220_325:0665a13_11"
    },
    {
        "source_sentence": "不見有阿耨多羅三藐三菩提，可於中生疑惑猶豫。",
        "translation": "If someone doesn't see the existence of unsurpassed, correct, and complete enlightenment, they might have doubts and hesitations in them.",
        "source": "T06n0220_325:0665a15_12"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_325:0665a16_13"
    },
    {
        "source_sentence": "若成就如是諸行、狀、相，當知是為不退轉菩薩摩訶薩。",
        "translation": "If someone accomplishes these kinds of practices, forms, and characteristics, they should be known to be a bodhisattva-mahāsattva who doesn't regress.",
        "source": "T06n0220_325:0665a16_14"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百二十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 25",
        "source": "T06n0220_325:0665a18_0"
    }
]