[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 4",
        "source": "T06n0220_346:0775c09_0"
    },
    {
        "source_sentence": "十六",
        "translation": "sixteen",
        "source": "T06n0220_346:0775c10_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_346:0775c12_0"
    },
    {
        "source_sentence": "初分堅等讚品第五十七之五",
        "translation": "The fifty-seventh and fifty-fifth parts of the First Part of the Praise of Firmness, etc.",
        "source": "T06n0220_346:0775c13_0"
    },
    {
        "source_sentence": "爾時，佛告具壽善現言：「善現！",
        "translation": "It was then that the Buddha addressed Kauśinagara, Good manifestation, saying, Good manifestation!",
        "source": "T06n0220_346:0775c14_0"
    },
    {
        "source_sentence": "何因緣故，諸菩薩摩訶薩於深般若波羅蜜多心不沈沒？」",
        "translation": "What are the reasons why bodhisattvas and mahāsattvas don't sink their minds into the profound prajñāpāramitā?",
        "source": "T06n0220_346:0775c14_1"
    },
    {
        "source_sentence": "具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng said to the Buddha, Bhagavān!",
        "source": "T06n0220_346:0775c15_2"
    },
    {
        "source_sentence": "以一切法皆非有故，諸菩薩摩訶薩於深般若波羅蜜多心不沈沒。",
        "translation": "Because all dharmas are not existent, the minds of bodhisattvas, mahāsattvas, and buddhas don't sink into the profound prajñāpāramitā.",
        "source": "T06n0220_346:0775c16_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0775c18_0"
    },
    {
        "source_sentence": "以一切法皆遠離故，諸菩薩摩訶薩於深般若波羅蜜多心不沈沒。",
        "translation": "Because all things are far removed, the minds of bodhisattvas and mahāsattvas don't sink into the profound prajñāpāramitā.",
        "source": "T06n0220_346:0775c18_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0775c19_2"
    },
    {
        "source_sentence": "以一切法皆寂靜故，諸菩薩摩訶薩於深般若波羅蜜多心不沈沒。",
        "translation": "Because all dharmas are quiescent, the minds of bodhisattvas, mahāsattvas, and buddhas don't sink into the profound prajñāpāramitā.",
        "source": "T06n0220_346:0775c19_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0775c21_4"
    },
    {
        "source_sentence": "以一切法無所有故，諸菩薩摩訶薩於深般若波羅蜜多心不沈沒。",
        "translation": "Because all things lack existence, the minds of bodhisattvas, mahāsattvas, and buddhas don't sink into the profound prajñāpāramitā.",
        "source": "T06n0220_346:0775c21_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0775c22_6"
    },
    {
        "source_sentence": "以一切法無生滅故，諸菩薩摩訶薩於深般若波羅蜜多心不沈沒。",
        "translation": "Because all things lack arising and ceasing, the minds of bodhisattvas, mahāsattvas, and buddhas don't sink into the profound prajñāpāramitā.",
        "source": "T06n0220_346:0775c23_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0775c24_8"
    },
    {
        "source_sentence": "由如是等種種因緣，諸菩薩摩訶薩於深般若波羅蜜多心不沈沒。",
        "translation": "Because of these various causes and conditions, the bodhisattva Mahāsattva's mind doesn't sink into the profound prajñāpāramitā.",
        "source": "T06n0220_346:0775c24_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_346:0775c26_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0775c26_11"
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法，若能沈沒、若所沈沒、若沈沒時、若沈沒處、若沈沒者由此沈沒皆不可得，",
        "translation": "“When the great enlightening beings sink into all things, they are unable to do so; and if they sink into them, what they sink into, or when they sink into them, or where they sink into them, or if they sin",
        "source": "T06n0220_346:0775c26_12"
    },
    {
        "source_sentence": "以一切法不可得故。",
        "translation": "It's because all dharmas are unobtainable.",
        "source": "T06n0220_346:0775c28_13"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0775c29_14"
    },
    {
        "source_sentence": "若菩薩摩訶薩聞說是事，心不沈沒，不驚、不怖，亦不憂悔，當知是菩薩摩訶薩行深般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva hears these things and doesn't sink his mind, isn't frightened or terrified, and doesn't regret them, you should know that this is the bodhisattva-mahāsatt",
        "source": "T06n0220_346:0775c29_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_346:0776a02_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩觀一切法皆不可得、不可施設，是能沈沒、是所沈沒、是沈沒時、是沈沒處、是沈沒者由此沈沒。",
        "translation": "This is the bodhisattva Mahāsattva who observes that all dharmas are unobtainable and cannot be defined, which can sink, which sinks, which sinks when it sinks, which sinks where it sinks, and which",
        "source": "T06n0220_346:0776a02_17"
    },
    {
        "source_sentence": "由是因緣，諸菩薩摩訶薩聞如是事，心不沈沒，不驚、不怖，亦不憂悔。",
        "translation": "Because of these causes and conditions, the bodhisattvas, mahāsattvas, who hear such things, don't sink in their minds, aren't frightened or terrified, and don't grieve.",
        "source": "T06n0220_346:0776a05_18"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0776a07_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩能如是行甚深般若波羅蜜多，諸天帝釋、大梵天王、諸世界主常所禮敬。」",
        "translation": "If a bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, the god Indra, the great Brahmā king, and the lords of the worlds will always venerate him.",
        "source": "T06n0220_346:0776a07_1"
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩能如是行甚深般若波羅蜜多，非但常為諸天帝釋、大梵天王、諸世界主之所禮敬，",
        "translation": "The Buddha told Śaṅgālī, Suppose a bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā of great wisdom, not only is he always venerated by Indra, the great Brahmā, and the lor",
        "source": "T06n0220_346:0776a09_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩亦為過此極光淨天、若遍淨天、若廣果天、若淨居天及餘天眾常所禮敬。",
        "translation": "This bodhisattva Mahāsattva is also always venerated by the gods of the Pure Land, the pervasively pure gods, the extensively fruitful gods, the pure abode gods, and other gods beyond them.",
        "source": "T06n0220_346:0776a11_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776a13_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，亦為十方無量無數無邊世界一切如來、應、正等覺常所護念。",
        "translation": "Such a bodhisattva Mahāsattva can thus practice the profound perfection of wisdom, and he's always guarded by all the tathāgatas, arhats, and perfectly enlightened ones in measureless, countless, and limitless",
        "source": "T06n0220_346:0776a13_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776a16_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令般若波羅蜜多速得圓滿，",
        "translation": "If these bodhisattvas and mahāsattvas can thus practice the profound perfection of wisdom, they will cause the perfection of wisdom to quickly be perfected.",
        "source": "T06n0220_346:0776a16_7"
    },
    {
        "source_sentence": "亦令靜慮、精進、安忍、淨戒、布施波羅蜜多速得圓滿。",
        "translation": "It also causes the perfections of meditation, effort, patience, pure morality, and generosity to quickly be fulfilled.",
        "source": "T06n0220_346:0776a17_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776a19_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令內空速得圓滿，亦令外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, he'll cause internal emptiness to quickly attain its consummation and also cause external emptiness, internal and external emptiness, emp",
        "source": "T06n0220_346:0776a19_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776a24_11"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令真如速得圓滿，亦令法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, it will cause the true nature to quickly attain its completion and also cause the Dharma realm, Dharma nature, non-falsity, unchang",
        "source": "T06n0220_346:0776a24_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776a28_13"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令苦聖諦速得圓滿，亦令集、滅、道聖諦速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, it will cause the noble truth of suffering to quickly attain its completion and also cause the noble truths of arising, ceasing, and",
        "source": "T06n0220_346:0776a28_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b01_15"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令四靜慮速得圓滿，亦令四無量、四無色定速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, he'll cause the four meditations to quickly attain their completion and the four immeasurable and four formless concentrations to quickly attain",
        "source": "T06n0220_346:0776b01_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b03_17"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令八解脫速得圓滿，亦令八勝處、九次第定、十遍處速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, he'll cause the eight liberations to quickly attain their fulfillment and the eight abodes of excellence, nine graduated concentrations, and",
        "source": "T06n0220_346:0776b04_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b06_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令四念住速得圓滿，亦令四正斷、四神足、五根、五力、七等覺支、八聖道支速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, he causes the four abodes of mindfulness to quickly attain their completion and also causes the fourfold correct elimination, the four miraculous powers",
        "source": "T06n0220_346:0776b06_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b09_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令空解脫門速得圓滿，亦令無相、無願解脫門速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, he'll cause the liberation gate of emptiness to quickly attain its completion and the liberation gate of signlessness and wishlessness",
        "source": "T06n0220_346:0776b09_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b12_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令極喜地速得圓滿，亦令離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, it will cause the ground of extreme joy to quickly become complete, and it will also cause the ground of freedom from defilement, the ground of emission",
        "source": "T06n0220_346:0776b12_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b15_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令五眼速得圓滿，亦令六神通速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, he'll cause the five eyes to quickly attain their completion and the six supernormal powers to quickly attain their completion.",
        "source": "T06n0220_346:0776b16_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b18_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令佛十力速得圓滿，亦令四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, it will cause the Buddha's ten powers to quickly attain their fulfillment and also cause the four fearlessnesses, four unhindered understanding",
        "source": "T06n0220_346:0776b18_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b21_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令無忘失法速得圓滿，亦令恒住捨性速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, it will cause the Dharma of no forgetfulness to quickly attain its completion and also cause the nature of constant equanimity to quickly attain",
        "source": "T06n0220_346:0776b21_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b23_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令一切智速得圓滿，亦令道相智、一切相智速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound perfection of prajñāpāramitā, it will cause all cognitions to quickly attain their fulfillment and also cause knowledge of the path and knowledge of all characteristics to quickly at",
        "source": "T06n0220_346:0776b23_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b26_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令一切陀羅尼門速得圓滿，",
        "translation": "If these bodhisattvas and mahāsattvas can thus practice the profound prajñāpāramitā, they will cause all the dhāraṇī teachings to quickly be fulfilled.",
        "source": "T06n0220_346:0776b26_8"
    },
    {
        "source_sentence": "亦令一切三摩地門速得圓滿。",
        "translation": "It also causes all the approaches to samādhi to quickly attain their fulfillment.",
        "source": "T06n0220_346:0776b28_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776b28_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令一切菩薩摩訶薩行速得圓滿。",
        "translation": "If this bodhisattva-mahāsattva can thus practice the profound prajñāpāramitā, then all bodhisattva-mahāsattva practices will quickly be perfected.",
        "source": "T06n0220_346:0776b28_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776c01_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令諸佛無上正等菩提速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, then he'll cause the buddhas to quickly attain unsurpassed perfect enlightenment.",
        "source": "T06n0220_346:0776c01_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0776c03_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩能如是行甚深般若波羅蜜多，則令一切智智速得圓滿。",
        "translation": "If this bodhisattva Mahāsattva can thus practice the profound prajñāpāramitā, then he'll quickly attain the perfection of omniscience and cognition.",
        "source": "T06n0220_346:0776c03_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_346:0776c06_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩能如是行甚深般若波羅蜜多，常為諸佛之所護念，速能圓滿一切功德，",
        "translation": "“If great enlightening beings can thus practice the profound perfection of wisdom, they will always be protected by buddhas and quickly perfect all virtues.",
        "source": "T06n0220_346:0776c06_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩當知行佛所應行處，速證無上正等菩提。",
        "translation": "This is the place where bodhisattvas, mahāsattvas, should know that they practice what the Buddha should practice and quickly realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_346:0776c08_2"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_346:0776c09_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩其心堅固，假使十方殑伽沙等世界有情皆變為魔，是一一魔各復化作如是數魔，",
        "translation": "Suppose all the sentient beings in the sands of the Ganges in the ten directions were to become Māras, and each one of those Māras would be transformed into such-and-such a number of Māras.",
        "source": "T06n0220_346:0776c09_4"
    },
    {
        "source_sentence": "是諸惡魔皆有無量無邊神力，如是諸魔不能留難是菩薩摩訶薩，令不能行甚深般若波羅蜜多，",
        "translation": "These evil demons all have measureless and limitless supernormal powers, and these demons can't make it difficult for this bodhisattva-mahāsattva to practice the profound prajñāpāramitā.",
        "source": "T06n0220_346:0776c12_0"
    },
    {
        "source_sentence": "亦令不證所求無上正等菩提。",
        "translation": "It also causes them not to realize the unsurpassed correct perfect enlightenment that they seek.",
        "source": "T06n0220_346:0776c14_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_346:0776c14_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩成就二法，一切惡魔不能沮壞，令不能行甚深般若波羅蜜多，",
        "translation": "If a bodhisattva-mahāsattva accomplishes two things, all the bad demons won't be able to break it down and prevent him from practicing the profound prajñāpāramitā.",
        "source": "T06n0220_346:0776c15_3"
    },
    {
        "source_sentence": "亦令不證所求無上正等菩提。",
        "translation": "It also causes them not to realize the unsurpassed correct perfect enlightenment that they seek.",
        "source": "T06n0220_346:0776c16_4"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T06n0220_346:0776c17_5"
    },
    {
        "source_sentence": "一、觀諸法皆畢竟空。",
        "translation": "1. observing that all dharmas are ultimately empty.",
        "source": "T06n0220_346:0776c17_6"
    },
    {
        "source_sentence": "二、不棄捨一切有情。",
        "translation": "2. not abandoning all sentient beings.",
        "source": "T06n0220_346:0776c18_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_346:0776c18_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩成就二法，一切惡魔不能沮壞，令不能行甚深般若波羅蜜多，",
        "translation": "If a bodhisattva-mahāsattva accomplishes two things, all the bad demons won't be able to break it down and prevent him from practicing the profound prajñāpāramitā.",
        "source": "T06n0220_346:0776c19_0"
    },
    {
        "source_sentence": "亦令不證所求無上正等菩提。",
        "translation": "It also causes them not to realize the unsurpassed correct perfect enlightenment that they seek.",
        "source": "T06n0220_346:0776c20_1"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T06n0220_346:0776c21_2"
    },
    {
        "source_sentence": "一、如所言皆悉能作。",
        "translation": "1. They're all capable of doing as they say.",
        "source": "T06n0220_346:0776c21_3"
    },
    {
        "source_sentence": "二、為諸佛常所護念。",
        "translation": "2. It's always guarded by the buddhas.",
        "source": "T06n0220_346:0776c22_4"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_346:0776c22_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩能如是行甚深般若波羅蜜多，諸天子等常來禮敬，親近供養，",
        "translation": "If bodhisattvas and mahāsattvas can thus practice the profound prajñāpāramitā, gods and other celestial beings will always come to venerate it and become intimate with it as offerings.",
        "source": "T06n0220_346:0776c22_6"
    },
    {
        "source_sentence": "請問勸發，言：『善男子！",
        "translation": "He asked and encouraged them, saying, 'Good sons!",
        "source": "T06n0220_346:0776c24_7"
    },
    {
        "source_sentence": "汝欲疾證所求無上正等菩提，當勤住空、無相、無願。",
        "translation": "If you want to quickly realize the unsurpassed perfect enlightenment that you seek, you must diligently abide in emptiness, signlessness, and wishlessness.",
        "source": "T06n0220_346:0776c25_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_346:0776c26_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T06n0220_346:0776c26_10"
    },
    {
        "source_sentence": "若勤住空、無相、無願，無依怙者當作依怙，無歸依者當作歸依，無救護者當作救護，",
        "translation": "If someone diligently abides in emptiness, signlessness, and wishlessness, those who lack support will become their support, those who lack support will become their refuge, and those who lack protection will become their rescue.",
        "source": "T06n0220_346:0776c26_11"
    },
    {
        "source_sentence": "無投趣者當作投趣，無洲渚者當作洲渚，無室宅者當作室宅，為闇暝者當作光明，",
        "translation": "Those who don't enter into it will become entrants, those who don't have islands will become islands, those who don't have houses will become houses, and those who are dark and dull will become light.",
        "source": "T06n0220_346:0776c28_12"
    },
    {
        "source_sentence": "為盲瞽者當作眼目。",
        "translation": "It's for the sake of those who are blind and dumb to make eyebrows.",
        "source": "T06n0220_346:0777a01_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_346:0777a01_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T06n0220_346:0777a02_0"
    },
    {
        "source_sentence": "如是住空、無相、無願即為安住甚深般若波羅蜜多，若能安住甚深般若波羅蜜多，",
        "translation": "To thus abide in emptiness, signlessness, and wishlessness is to peacefully abide in the profound perfection of wisdom, and if you can peacefully abide in the profound perfection of wisdom,",
        "source": "T06n0220_346:0777a02_1"
    },
    {
        "source_sentence": "則能疾證所求無上正等菩提。』",
        "translation": "Then he'll quickly realize the unsurpassed correct perfect enlightenment that he seeks.'",
        "source": "T06n0220_346:0777a04_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_346:0777a04_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩能如是住甚深般若波羅蜜多，則為十方無量、無數、無邊世界現在諸佛處大眾中，",
        "translation": "If the bodhisattva Mahāsattva can thus abide in the profound perfection of wisdom, then measureless, countless, and limitless worlds in the ten directions are present in the great congregation of buddha-fields.",
        "source": "T06n0220_346:0777a05_0"
    },
    {
        "source_sentence": "自然歡喜稱揚讚歎是菩薩摩訶薩名字、種姓及諸功德，所謂安住甚深般若波羅蜜多殊勝功德。",
        "translation": "They naturally rejoice and praise this bodhisattva-mahāsattva's names, castes, and merits, which are called the extraordinary attributes of abiding in the profound prajñāpāramitā.",
        "source": "T06n0220_346:0777a07_1"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_346:0777a09_2"
    },
    {
        "source_sentence": "如我今者為眾宣說甚深般若波羅蜜多，於大眾前自然歡喜稱揚讚歎寶幢菩薩、尸棄菩薩摩訶薩等，",
        "translation": "As I now proclaim the profound prajñāpāramitā for the sake of sentient beings, naturally rejoicing before the masses and extolling it in praise of the jeweled-banner bodhisattva and Śikh",
        "source": "T06n0220_346:0777a09_3"
    },
    {
        "source_sentence": "及現在住不動佛所淨修梵行，住深般若波羅蜜多諸菩薩摩訶薩名字、種姓及諸功德，",
        "translation": "and the names, castes, and virtues of the bodhisattva-mahāsattvas who are now abiding in the profound prajñāpāramitā that are purified by the pure religious practice of the Akṣobhya Buddha.",
        "source": "T06n0220_346:0777a12_0"
    },
    {
        "source_sentence": "所謂安住甚深般若波羅蜜多殊勝功德。",
        "translation": "It's called the extraordinary merit of abiding in the profound prajñāpāramitā.",
        "source": "T06n0220_346:0777a14_0"
    },
    {
        "source_sentence": "現在東方無量、無數、無邊世界一切如來、應、正等覺，為眾宣說甚深般若波羅蜜多，",
        "translation": "To the east of this buddha-field were all the buddhas and enlightening beings of the ten directions, namely:",
        "source": "T06n0220_346:0777a14_1"
    },
    {
        "source_sentence": "於彼亦有諸菩薩摩訶薩淨修梵行，不離般若波羅蜜多。",
        "translation": "There are also bodhisattvas, mahāsattvas, who purify the religious practice and don't part from the prajñāpāramitā.",
        "source": "T06n0220_346:0777a16_2"
    },
    {
        "source_sentence": "彼諸如來、應、正等覺各於眾前，自然歡喜稱揚讚歎彼菩薩摩訶薩名字、種姓及諸功德，",
        "translation": "In the presence of those buddhas and enlightening beings, they naturally joyfully extolled and praised the names, castes, and virtues of those great enlightening beings.",
        "source": "T06n0220_346:0777a18_3"
    },
    {
        "source_sentence": "所謂不離甚深般若波羅蜜多殊勝功德。",
        "translation": "It's called the extraordinary merit that doesn't part from the profound prajñāpāramitā.",
        "source": "T06n0220_346:0777a20_4"
    },
    {
        "source_sentence": "南西北方四維上下，亦復如是。",
        "translation": "The same applies upward and downward in the four intermediate directions to the south, to the north and to the west.",
        "source": "T06n0220_346:0777a21_0"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T06n0220_346:0777a21_1"
    },
    {
        "source_sentence": "有菩薩摩訶薩從初發心修行般若波羅蜜多，漸次圓滿大菩提道，乃至證得一切智智，",
        "translation": "“There are great enlightening beings who, from the first determination for enlightenment, practice the perfection of wisdom and gradually perfect the great path of enlightenment, until they attain omniscience.",
        "source": "T06n0220_346:0777a21_2"
    },
    {
        "source_sentence": "亦為十方無量、無數、無邊世界現在諸佛說正法時，於大眾前自然歡喜稱揚讚歎是菩薩摩訶薩名字、種姓及諸功德，",
        "translation": "“Furthermore, when the buddhas of the ten directions teach the true teaching to beings in infinite, boundless, and limitless worlds, they naturally joyfully extol and praise these names, castes, and virtues of the",
        "source": "T06n0220_346:0777a23_3"
    },
    {
        "source_sentence": "所謂修行甚深般若波羅蜜多殊勝功德。",
        "translation": "It's called the extraordinary merit of cultivating the profound prajñāpāramitā.",
        "source": "T06n0220_346:0777a26_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_346:0777a27_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_346:0777a27_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩能為難事，不斷佛種，利益安樂一切有情。」",
        "translation": "This is the bodhisattva Mahāsattva who can do difficult things that don't stop the Buddha's seed and benefit and comfort all sentient beings.",
        "source": "T06n0220_346:0777a27_7"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_346:0777b01_0"
    },
    {
        "source_sentence": "何等菩薩摩訶薩蒙諸如來、應、正等覺因說正法，於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德，",
        "translation": "“Who are these great enlightening beings who, having been taught the right teaching by the buddhas and true enlightened ones, naturally rejoice and praise their names, castes, and virtues before the masses?",
        "source": "T06n0220_346:0777b01_1"
    },
    {
        "source_sentence": "為退轉位？",
        "translation": "What's the stage of retrogression?",
        "source": "T06n0220_346:0777b03_2"
    },
    {
        "source_sentence": "為不退轉？」",
        "translation": "For the sake of not regressing?",
        "source": "T06n0220_346:0777b04_3"
    },
    {
        "source_sentence": "佛告善現：「有菩薩摩訶薩住不退轉位行深般若波羅蜜多，蒙諸如來、應、正等覺因說正法，",
        "translation": "The Buddha told Shancheng, Suppose there's a bodhisattva Mahāsattva who abides in the stage of nonretrogression and practices profound prajñāpāramitā and is taught the right teaching by the Tathāgatas,",
        "source": "T06n0220_346:0777b04_4"
    },
    {
        "source_sentence": "於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德。",
        "translation": "In front of the crowd, he naturally rejoices and praises names, castes, and merits.",
        "source": "T06n0220_346:0777b06_5"
    },
    {
        "source_sentence": "復有菩薩摩訶薩雖未受記而行般若波羅蜜多，亦蒙如來、應、正等覺因說正法，",
        "translation": "Furthermore, there are bodhisattva-mahāsattvas who practice the perfection of wisdom even though they haven’t received assurance and are also taught the right teaching by the Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T06n0220_346:0777b07_6"
    },
    {
        "source_sentence": "於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德。」",
        "translation": "In front of the masses, he naturally rejoices and praises names, castes, and merits.",
        "source": "T06n0220_346:0777b09_7"
    },
    {
        "source_sentence": "具壽善現復白佛言：「此所說者是何菩薩？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's the bodhisattva that's being taught here?",
        "source": "T06n0220_346:0777b10_8"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_346:0777b11_9"
    },
    {
        "source_sentence": "有菩薩摩訶薩隨不動佛為菩薩時所行而學，已得安住不退轉位，是菩薩摩訶薩蒙諸如來、應、正等覺因說正法，",
        "translation": "“If there is a bodhisattva Mahāsattva who follows the Buddha Akṣobhya and practices what he does for the sake of enlightening beings at the time of enlightening beings, and has attained the state of nonregression",
        "source": "T06n0220_346:0777b11_10"
    },
    {
        "source_sentence": "於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德。",
        "translation": "In front of the crowd, he naturally rejoices and praises names, castes, and merits.",
        "source": "T06n0220_346:0777b14_11"
    },
    {
        "source_sentence": "復有菩薩摩訶薩隨寶幢菩薩、尸棄菩薩摩訶薩等所行而學，是菩薩摩訶薩雖未受記而行般若波羅蜜多，",
        "translation": "Furthermore, there are bodhisattva-mahāsattvas who follow the practices of the jeweled banner bodhisattvas and śikhin bodhisattva-mahāsattvas, which are bodhisattva-mahāsattvas who practice",
        "source": "T06n0220_346:0777b15_12"
    },
    {
        "source_sentence": "亦蒙如來、應、正等覺因說正法，於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德。",
        "translation": "Having also been taught the right teaching by the Tathāgata, Arhat, and Completely Awakened One, they naturally rejoice and praise names, castes, and merits in front of the masses.",
        "source": "T06n0220_346:0777b17_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_346:0777b19_14"
    },
    {
        "source_sentence": "有菩薩摩訶薩行深般若波羅蜜多，於一切法無生性中深生信解，而未證得無生法忍；",
        "translation": "“There are great enlightening beings practicing the profound perfection of wisdom who have deep faith and understanding in the nonorigination of all things, yet they do not realize the tolerance of the nonorigination of things.",
        "source": "T06n0220_346:0777b19_15"
    },
    {
        "source_sentence": "於深般若波羅蜜多深生信解，亦未證得無生法忍；",
        "translation": "They deeply believe in and understand the profound transcendent wisdom, yet they do not realize the tolerance of the nonorigination of all things.",
        "source": "T06n0220_346:0777b21_16"
    },
    {
        "source_sentence": "於一切法畢竟空性深生信解，亦未證得無生法忍；",
        "translation": "They deeply engender faith and understanding in the ultimate emptiness of all things, but they do not yet realize the tolerance of the nonorigination of things.",
        "source": "T06n0220_346:0777b23_0"
    },
    {
        "source_sentence": "於一切法皆寂靜性深生信解，亦未證得無生法忍；",
        "translation": "They deeply engender faith and understanding that all things are inherently quiescent, but they do not yet realize the tolerance of the nonorigination of things.",
        "source": "T06n0220_346:0777b24_1"
    },
    {
        "source_sentence": "於一切法皆遠離性深生信解，亦未證得無生法忍；",
        "translation": "They deeply engender faith and understanding that all things are inherently detached, but they do not yet realize the tolerance of the nonorigination of things.",
        "source": "T06n0220_346:0777b25_2"
    },
    {
        "source_sentence": "於一切法無所有性深生信解，亦未證得無生法忍；",
        "translation": "They deeply engender faith and understanding in the nonexistence of all things, but they do not yet realize the tolerance of the nonorigination of things.",
        "source": "T06n0220_346:0777b26_3"
    },
    {
        "source_sentence": "於一切法不自在性深生信解，亦未證得無生法忍；",
        "translation": "They deeply engender faith and understanding in the unindependent nature of all things, but they do not yet realize the tolerance of the nonorigination of things.",
        "source": "T06n0220_346:0777b27_4"
    },
    {
        "source_sentence": "於一切法不堅實性深生信解，亦未證得無生法忍。",
        "translation": "They deeply believe and understand that all things are not substantial, but they haven't yet realized the forbearance of the nonarising of dharmas.",
        "source": "T06n0220_346:0777b28_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0777b29_6"
    },
    {
        "source_sentence": "如是等菩薩摩訶薩蒙諸如來、應、正等覺因說正法，於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德。",
        "translation": "Such bodhisattvas and mahāsattvas who receive the right teaching from the Tathāgatas, Arhats, and Perfectly Enlightened Ones naturally rejoice and praise names, castes, and merits in front of the masses",
        "source": "T06n0220_346:0777c01_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0777c03_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩蒙諸如來、應、正等覺因說正法，於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德，",
        "translation": "“Furthermore, if great enlightening beings were to receive the teaching of the true teaching from the buddhas and so forth, they would naturally rejoice before the masses and praise their names, castes, and virtues.",
        "source": "T06n0220_346:0777c03_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩超過聲聞及獨覺地，定證無上正等菩提。",
        "translation": "This is the bodhisattva Mahāsattva who surpasses the stages of śrāvakas and pratyekbuddhas and definitely realizes unsurpassed perfect enlightenment.",
        "source": "T06n0220_346:0777c05_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0777c07_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩行深般若波羅蜜多，蒙諸如來、應、正等覺因說正法，於大眾前自然歡喜稱揚讚歎名字、種姓及諸功德，",
        "translation": "If a bodhisattva-mahāsattva practices the profound perfection of wisdom and is taught the right teaching by the Tathāgatas, Arhats, and Perfectly Enlightened Ones, he'll naturally rejoice and praise",
        "source": "T06n0220_346:0777c07_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩定當安住不退轉地，住是地已，必當證得一切智智。",
        "translation": "This bodhisattva Mahāsattva will surely abide in the stage of nonretrogression, and after abiding in that stage, he'll surely realize omniscience.",
        "source": "T06n0220_346:0777c09_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_346:0777c11_14"
    },
    {
        "source_sentence": "若菩薩摩訶薩聞說如是甚深般若波羅蜜多，心無疑惑亦不迷悶，但作是念：『如佛所說甚深般若波羅蜜多，",
        "translation": "“If great enlightening beings hear and teach such profound prajñāpāramitā, their minds without doubt or confusion, they simply think, ‘Just as the Buddha taught the profound prajñāpāramitā,",
        "source": "T06n0220_346:0777c11_15"
    },
    {
        "source_sentence": "其理必然無有顛倒。』",
        "translation": "There must be no mistake in its principle.'",
        "source": "T06n0220_346:0777c14_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩由於般若波羅蜜多深生淨信，漸次當於不動佛所及諸菩薩摩訶薩所，",
        "translation": "“Furthermore, these bodhisattvas and mahāsattvas who have deep faith in the perfection of wisdom will gradually come before the Buddha Akṣobhya and all the other bodhisattva-mahāsattvas.",
        "source": "T06n0220_346:0777c14_17"
    },
    {
        "source_sentence": "廣聞般若波羅蜜多，於其義趣深生信解。",
        "translation": "Having heard extensively about the perfection of wisdom, they deeply believe and understand its meaning.",
        "source": "T06n0220_346:0777c16_18"
    },
    {
        "source_sentence": "既信解已，當得住於不退轉地，住是地已，定當證得一切智智。",
        "translation": "Once they have faith and understanding, they'll be able to abide in the stage of nonretrogression, and after abiding there, they'll surely realize omniscience and knowledge.",
        "source": "T06n0220_346:0777c17_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_346:0777c18_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩但聞如是甚深般若波羅蜜多不生誹謗，尚多獲得殊勝善根，",
        "translation": "If bodhisattvas, mahāsattvas, simply hear such profound prajñāpāramitā and don't denigrate it, they'll still often attain extraordinary good roots.",
        "source": "T06n0220_346:0777c19_0"
    },
    {
        "source_sentence": "況能信解、受持、讀誦，依真如理繫念思惟，安住真如精勤修學！",
        "translation": "How much more so when they can believe, understand, retain, and recite it, relying on the principle of true reality, fix their thoughts and contemplations, and diligently cultivate the practice of abiding in true reality!",
        "source": "T06n0220_346:0777c20_1"
    },
    {
        "source_sentence": "是諸菩薩速當安住不退轉地，疾證無上正等菩提。」",
        "translation": "These bodhisattvas will quickly abide in the stage of nonretrogression and quickly realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_346:0777c22_2"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_346:0777c23_3"
    },
    {
        "source_sentence": "諸法實性皆不可得，云何菩薩摩訶薩安住真如精勤修學，速當安住不退轉地，",
        "translation": "How can great enlightening beings abide in suchness, who diligently cultivate it, quickly abide in the stage of nonregression?",
        "source": "T06n0220_346:0777c23_4"
    },
    {
        "source_sentence": "疾證無上正等菩提？」",
        "translation": "Will you quickly realize unsurpassed perfect enlightenment?",
        "source": "T06n0220_346:0777c25_5"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_346:0777c26_6"
    },
    {
        "source_sentence": "如佛所化安住真如，修諸菩薩摩訶薩行，速當安住不退轉地，疾證無上正等菩提，",
        "translation": "As the Buddha teaches, they abide in true thusness, cultivate the practices of enlightening beings, quickly abide in the stage of nonregression, and quickly realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_346:0777c26_7"
    },
    {
        "source_sentence": "為諸有情宣說正法。",
        "translation": "He teaches the right teaching for sentient beings.",
        "source": "T06n0220_346:0777c28_8"
    },
    {
        "source_sentence": "諸菩薩摩訶薩亦復如是，安住真如修諸菩薩摩訶薩行，速當安住不退轉地，",
        "translation": "So it is with the bodhisattva-mahāsattva: abiding in true thusness and cultivating the practices of enlightening beings, they will quickly abide in the stage of nonregression.",
        "source": "T06n0220_346:0777c28_9"
    },
    {
        "source_sentence": "疾證無上正等菩提。」",
        "translation": "They'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_346:0778a01_10"
    },
    {
        "source_sentence": "具壽善現復白佛言：「如來所化都無所有，法離真如又不可得，誰住真如修菩薩行，",
        "translation": "Guoshou Shancheng then said to the Buddha: The teachings of the Tathāgata have no existence whatsoever. Dharma apart from reality is also ungraspable. Who will abide in reality and cultivate the bodhisattva practice?",
        "source": "T06n0220_346:0778a02_0"
    },
    {
        "source_sentence": "速當安住不退轉地，疾證無上正等菩提，為諸有情宣說正法？",
        "translation": "Will you quickly abide in the stage of nonretrogression, quickly realize unsurpassed perfect enlightenment, and proclaim the right teaching for sentient beings?",
        "source": "T06n0220_346:0778a03_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0778a05_2"
    },
    {
        "source_sentence": "真如尚不可得，何況得有安住真如修菩薩行，速當安住不退轉地，疾證無上正等菩提，",
        "translation": "How much the more can one who is settled in suchness cultivate enlightening practices, swiftly dwelling in the stage of nonregression and quickly realizing supreme perfect enlightenment.",
        "source": "T06n0220_346:0778a05_3"
    },
    {
        "source_sentence": "為諸有情宣說正法！",
        "translation": "He explains the right teaching for sentient beings!",
        "source": "T06n0220_346:0778a07_4"
    },
    {
        "source_sentence": "此若實有，無有是處。」",
        "translation": "If this really exists, there's no place for it.",
        "source": "T06n0220_346:0778a08_0"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_346:0778a08_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_346:0778a08_2"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_346:0778a08_3"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_346:0778a09_0"
    },
    {
        "source_sentence": "如來所化都無所有，法離真如又不可得，誰住真如修菩薩行，速當安住不退轉地，",
        "translation": "The teachings of the Buddha have no existence and cannot be found apart from reality. Those who abide in reality and practice enlightening beings’ practices will quickly become established in the stage of nonregression.",
        "source": "T06n0220_346:0778a09_1"
    },
    {
        "source_sentence": "疾證無上正等菩提，為諸有情宣說正法？",
        "translation": "They quickly realize unsurpassed perfect enlightenment and proclaim the right teaching for sentient beings.",
        "source": "T06n0220_346:0778a11_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_346:0778a12_3"
    },
    {
        "source_sentence": "真如尚不可得，何況得有安住真如修菩薩行，速當安住不退轉地，疾證無上正等菩提，",
        "translation": "How much the more can one who is settled in suchness cultivate enlightening practices, swiftly dwelling in the stage of nonregression and quickly realizing supreme perfect enlightenment.",
        "source": "T06n0220_346:0778a12_4"
    },
    {
        "source_sentence": "為諸有情宣說正法！",
        "translation": "He explains the right teaching for sentient beings!",
        "source": "T06n0220_346:0778a14_5"
    },
    {
        "source_sentence": "此若實有，無有是處。",
        "translation": "If this really existed, there would be no place for it.",
        "source": "T06n0220_346:0778a14_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_346:0778a15_7"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_346:0778a15_8"
    },
    {
        "source_sentence": "如來出世若不出世，諸法法爾不離真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界。",
        "translation": "Whether the Tathāgata appears in the world or doesn't appear in the world, all dharmas and principles don't part from the true nature, the Dharma realm, Dharma nature, non-falsity, immutability, equality, freedom from",
        "source": "T06n0220_346:0778a15_9"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_346:0778a18_10"
    },
    {
        "source_sentence": "決定無有安住真如修菩薩行，速當安住不退轉地，疾證無上正等菩提，",
        "translation": "They are certain that there is no peace in the practice of enlightening beings who abide in true thusness. They will soon be settled in the stage of nonregression and quickly attain unexcelled, perfect enlightenment.",
        "source": "T06n0220_346:0778a18_11"
    },
    {
        "source_sentence": "為諸有情說正法者。",
        "translation": "He explains the right teaching for sentient beings.",
        "source": "T06n0220_346:0778a20_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_346:0778a20_13"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_346:0778a20_14"
    },
    {
        "source_sentence": "諸法真如無生無滅，亦無住異少分可得。",
        "translation": "The true nature of dharmas has no arising and no ceasing, and there's no abiding or dissimilarity that can be obtained in a small part.",
        "source": "T06n0220_346:0778a20_15"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_346:0778a21_16"
    },
    {
        "source_sentence": "若法無生無滅，亦無住異少分可得，誰於其中可得安住修諸菩薩摩訶薩行，",
        "translation": "If things have no arising and no perishing, and neither abiding nor dissimilarity, how can they be obtained in a small part? Who will be able to establish themselves therein and cultivate the practices of enlightening beings?",
        "source": "T06n0220_346:0778a21_17"
    },
    {
        "source_sentence": "速當安住不退轉地，疾證無上正等菩提，為諸有情宣說正法？",
        "translation": "Will you quickly abide in the stage of nonretrogression, quickly realize unsurpassed perfect enlightenment, and proclaim the right teaching for sentient beings?",
        "source": "T06n0220_346:0778a23_18"
    },
    {
        "source_sentence": "此若實有，無有是處。」",
        "translation": "If this really exists, there's no place for it.",
        "source": "T06n0220_346:0778a25_19"
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T06n0220_346:0778a26_0"
    },
    {
        "source_sentence": "如是般若波羅蜜多，微妙甚深極難信解，諸菩薩摩訶薩行深般若波羅蜜多，",
        "translation": "Thus, the perfection of wisdom is so subtle and profound that it's extremely difficult to believe in.",
        "source": "T06n0220_346:0778a26_1"
    },
    {
        "source_sentence": "雖知諸法皆不可得，而求無上正等菩提甚為難事。",
        "translation": "Even though they know that all dharmas are ungraspable, it's very difficult to seek unsurpassed perfect enlightenment.",
        "source": "T06n0220_346:0778a28_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_346:0778a29_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0778a29_4"
    },
    {
        "source_sentence": "決定無有安住真如修諸菩薩摩訶薩行，速當安住不退轉地，疾證無上正等菩提，",
        "translation": "They are certain that there is no peace in the practice of enlightening beings who abide in true thusness, and they will quickly be settled in the stage of nonregression and soon realize unexcelled perfect enlightenment.",
        "source": "T06n0220_346:0778a29_5"
    },
    {
        "source_sentence": "為諸有情說正法事。",
        "translation": "He explains the right teaching for sentient beings.",
        "source": "T06n0220_346:0778b02_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，觀一切法都無所有，於深法性心不沈沒，",
        "translation": "“When great enlightening beings practice the profound perfection of wisdom, they contemplate that all things have no existence, and their minds are not absorbed in the profound essence of things.",
        "source": "T06n0220_346:0778b03_7"
    },
    {
        "source_sentence": "不怖、不驚、無疑、無滯，如是等事甚為希有。」",
        "translation": "Such things as being fearless, not frightened, without doubt, and without obstruction are rare.",
        "source": "T06n0220_346:0778b04_8"
    },
    {
        "source_sentence": "爾時，具壽善現語天帝釋言：「憍尸迦！",
        "translation": "It was then that Kauṣṭhila Shancheonsa said to Śakra Devānām-Indra, Kauṣṭhila!",
        "source": "T06n0220_346:0778b05_9"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_346:0778b06_10"
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，觀一切法都無所有，於深法性心不沈沒，",
        "translation": "“When great enlightening beings practice the profound perfection of wisdom, they contemplate that all things have no existence, and their minds are not absorbed in the profound essence of things.",
        "source": "T06n0220_346:0778b06_11"
    },
    {
        "source_sentence": "不怖、不驚、無疑、無滯，如是等事甚希有者。",
        "translation": "Such things as being fearless, not frightened, without doubt and without obstruction are very rare.",
        "source": "T06n0220_346:0778b08_12"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_346:0778b09_13"
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，觀一切法無不皆空。",
        "translation": "The bodhisattvas, mahāsattvas, and practitioners of the profound prajñāpāramitā observe that all things are nothing but empty.",
        "source": "T06n0220_346:0778b09_14"
    },
    {
        "source_sentence": "謂觀一切有色法空，無色法亦空；",
        "translation": "It is the contemplation on the emptiness of all material dharmas, and also on the emptiness of formless dharmas.",
        "source": "T06n0220_346:0778b11_15"
    },
    {
        "source_sentence": "觀一切有見法空，無見法亦空；",
        "translation": "Observing all things as void when there are views, they become also void when there are no views.",
        "source": "T06n0220_346:0778b11_16"
    },
    {
        "source_sentence": "觀一切有對法空，無對法亦空；",
        "translation": "He observed the emptiness of all oppositional factors, and also emptiness of all non-opposing factors.",
        "source": "T06n0220_346:0778b12_17"
    },
    {
        "source_sentence": "觀一切有漏法空，無漏法亦空；",
        "translation": "Observing the emptiness of all tainted dharmas, they see that untainted dharmas are also emptiness.",
        "source": "T06n0220_346:0778b13_18"
    },
    {
        "source_sentence": "觀一切有為法空，無為法亦空；",
        "translation": "Observing all conditioned things are void, and so are unconditioned things.",
        "source": "T06n0220_346:0778b14_0"
    },
    {
        "source_sentence": "觀一切世間法空，出世間法亦空；",
        "translation": "Observing all worldly dharmas as void, they also observe the emptiness of transmundane dharmas.",
        "source": "T06n0220_346:0778b14_1"
    },
    {
        "source_sentence": "觀一切寂靜法空，不寂靜法亦空；",
        "translation": "He observed the emptiness of all peaceful dharmas, and also emptiness of un Peaceful dharmas.",
        "source": "T06n0220_346:0778b15_2"
    },
    {
        "source_sentence": "觀一切遠離法空，不遠離法亦空；",
        "translation": "Observing that all things are void apart from phenomena, but they are also void apart from phenomena.",
        "source": "T06n0220_346:0778b16_3"
    },
    {
        "source_sentence": "觀一切過去法空，未來、現在法亦空；",
        "translation": "Observing all things as void in the past, they also see emptiness of future and present things.",
        "source": "T06n0220_346:0778b17_0"
    },
    {
        "source_sentence": "觀一切善法空，不善、無記法亦空；",
        "translation": "Observing the emptiness of all good dharmas, they see also the emptiness of bad and neutral dharmas.",
        "source": "T06n0220_346:0778b17_1"
    },
    {
        "source_sentence": "觀一切欲界法空，色、無色界法亦空；",
        "translation": "Observing that all things in the realm of desire are void, and also all things in the realms of form and formlessness are void.",
        "source": "T06n0220_346:0778b18_2"
    },
    {
        "source_sentence": "觀一切學法空，無學、非學非無學法亦空；",
        "translation": "Observing all the teachings of those still learning are void, and also the teachings of those neither still having learning to do nor not having learning to do are also void.",
        "source": "T06n0220_346:0778b19_3"
    },
    {
        "source_sentence": "觀一切見所斷法空，修所斷、非所斷法亦空；",
        "translation": "Observing the emptiness of all things to be abandoned by insight, they also see emptiness of all things to be abandoned by cultivation and those not to be abandoned.",
        "source": "T06n0220_346:0778b20_4"
    },
    {
        "source_sentence": "觀一切有法空，無法、非有非無法亦空。",
        "translation": "He observes the emptiness of all existent dharmas, and what's neither existent nor nonexistent is also empty.",
        "source": "T06n0220_346:0778b21_5"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_346:0778b22_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，觀如是等一切法空，諸法空中都無所有，",
        "translation": "The great enlightening beings practice the profound perfection of wisdom, observing that all things like this are empty, and all things have no existence in space.",
        "source": "T06n0220_346:0778b22_7"
    },
    {
        "source_sentence": "誰沈、誰沒、誰怖、誰驚、誰疑、誰滯？",
        "translation": "Who sinks, who disappears, who fears, who is frightened, who doubts, and who is hindered?",
        "source": "T06n0220_346:0778b24_8"
    },
    {
        "source_sentence": "是故，憍尸迦！",
        "translation": "Therefore, Kauśika!",
        "source": "T06n0220_346:0778b24_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩行深般若波羅蜜多，於深法性心不沈沒，不怖、不驚、無疑、無滯，",
        "translation": "“When great enlightening beings practice the profound prajñāpāramitā, their minds are not absorbed in the profound essence of reality; they are not afraid, not frightened, not doubtful, and not hindered.",
        "source": "T06n0220_346:0778b25_10"
    },
    {
        "source_sentence": "未為希有。」",
        "translation": "It's not rare.",
        "source": "T06n0220_346:0778b26_11"
    },
    {
        "source_sentence": "時，天帝釋白善現言：「尊者所說一切依空，是故所言常無罣礙。",
        "translation": "Śakra Devānām-Indra then said to Sunetra, All the teachings of the Bhagavān rely on emptiness, so his words are always unobstructed.",
        "source": "T06n0220_346:0778b27_12"
    },
    {
        "source_sentence": "譬如以箭仰射虛空，若近若遠俱無罣礙，尊者所說亦復如是。」",
        "translation": "It's like shooting upward into space with an arrow, whether near or far, without obstruction, and so is what the venerable teaches.",
        "source": "T06n0220_346:0778b28_13"
    },
    {
        "source_sentence": "初分囑累品第五十八之一",
        "translation": "The Fifty-eighth Chapter of the First Part of the Entrustment",
        "source": "T06n0220_346:0778c02_0"
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T06n0220_346:0778c03_0"
    },
    {
        "source_sentence": "我如是說、如是讚、如是記，為順如來、應、正等覺法語、律語，於法隨法無顛倒記不？」",
        "translation": "Do I thus explain, praise, and record the words in ways that are consistent with the Tathāgata, Arhat, Perfectly Enlightened One's teachings and precepts so that they aren't mistakenly recorded according to the teaching",
        "source": "T06n0220_346:0778c03_1"
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, Kauśika!",
        "source": "T06n0220_346:0778c05_2"
    },
    {
        "source_sentence": "汝如是說、如是讚、如是記，誠順如來、應、正等覺法語、律語，於法隨法無顛倒記。」",
        "translation": "You truly follow the words of the Tathāgata, Arhat, Perfectly Enlightened One's teaching and the words of the vinaya, and you don't mistakenly record the teaching according to the teaching.",
        "source": "T06n0220_346:0778c05_3"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「希有！",
        "translation": "Śakra then again said to the Buddha, Rarely!",
        "source": "T06n0220_346:0778c07_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_346:0778c08_5"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依空、無相、無願。",
        "translation": "Whatever the great virtuous and well-manifest teaches, there's nothing that doesn't rely on emptiness, signlessness, and wishlessness.",
        "source": "T06n0220_346:0778c08_6"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "Whatever the great virtuous and well-manifest teaches, they all rely on the four abodes of mindfulness, the four correct eliminations, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual en",
        "source": "T06n0220_346:0778c09_7"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依四靜慮、四無量、四無色定。",
        "translation": "There's nothing that the great virtuous and well-manifest teachings don't all rely on the four meditations, four immeasurable concentrations, and four formless concentrations.",
        "source": "T06n0220_346:0778c11_8"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依八解脫、八勝處、九次第定、十遍處。",
        "translation": "Venerable Sunetra explains that none of them all rely on the eight liberations, eight abodes of excellence, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_346:0778c12_9"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依布施、淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "The great virtuous and well-manifest teachings are all based on generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T06n0220_346:0778c13_10"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空。",
        "translation": "Whatever the great virtuous and well-manifest teachings are, none of them rely on internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness",
        "source": "T06n0220_346:0778c15_11"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界。",
        "translation": "The great virtuous and well-manifest teachings all rely on the true nature, the Dharma realm, the Dharma nature, the nature of dharmas, non-falsity, unchanging and dissimilar nature, equality, freedom from birth,",
        "source": "T06n0220_346:0778c19_12"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依苦、集、滅、道聖諦。",
        "translation": "Venerable Sunetra explains that there's nothing that doesn't rely on the noble truths of suffering, arising, cessation, and the path.",
        "source": "T06n0220_346:0778c22_0"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依五眼、六神通。",
        "translation": "Whatever the great virtuous and well-manifest teaches, there's nothing that doesn't rely on the five eyes and six supernormal powers.",
        "source": "T06n0220_346:0778c23_1"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依一切陀羅尼門、一切三摩地門。",
        "translation": "The great virtuous one well shows that whatever he teaches, none of them rely on all the dhāraṇī teachings and all the samādhi teachings.",
        "source": "T06n0220_346:0778c24_2"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法。",
        "translation": "Whatever the great virtuous and well-presented teachings are taught, they all rely on the Buddha's ten powers, four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanim",
        "source": "T06n0220_346:0778c25_3"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依無忘失法、恒住捨性。",
        "translation": "Whatever the great virtuous and well-manifest teaches, they all rely on the principle of nonforgetfulness and constantly abide in equanimity.",
        "source": "T06n0220_346:0778c27_4"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依一切智、道相智、一切相智。",
        "translation": "Whatever the great virtuous and well-manifest teaches, they all rely on omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T06n0220_346:0778c28_5"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依一切菩薩摩訶薩行。",
        "translation": "Whatever the great virtuous and well-manifest teaches, none of them rely on all the bodhisattva-mahāsattva practices.",
        "source": "T06n0220_346:0779a01_0"
    },
    {
        "source_sentence": "大德善現諸有所說，無不皆依諸佛無上正等菩提。」",
        "translation": "The great virtuous and well-manifest teachings are all based on the unsurpassed correct perfect enlightenment of the buddhas.",
        "source": "T06n0220_346:0779a02_1"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「憍尸迦！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, Kauśika!",
        "source": "T06n0220_346:0779a03_2"
    },
    {
        "source_sentence": "具壽善現安住空故，觀布施波羅蜜多尚不可得，況有行布施波羅蜜多者！",
        "translation": "Because the wholesome manifestation of longevity abides in emptiness, the contemplation of the perfection of generosity is still unobtainable, so why wouldn't there be someone who practices the perfection of generosity?",
        "source": "T06n0220_346:0779a04_3"
    },
    {
        "source_sentence": "觀淨戒、安忍、精進、靜慮、般若波羅蜜多尚不可得，況有行淨戒、安忍、精進、靜慮、般若波羅蜜多者！",
        "translation": "Observing the pure precepts, patience, effort, meditation, and the perfection of wisdom are still unobtainable, so why wouldn't there be practitioners of the pure precepts, patience, effort, meditation, meditation, and the perfection of",
        "source": "T06n0220_346:0779a05_4"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀四念住尚不可得，況有修四念住者！",
        "translation": "Because the wholesome manifestation of longevity abides in emptiness, it's still unobtainable to contemplate the four abodes of mindfulness, so why wouldn't someone cultivate the four abodes of mindfulness?",
        "source": "T06n0220_346:0779a07_5"
    },
    {
        "source_sentence": "觀四正斷、四神足、五根、五力、七等覺支、八聖道支尚不可得，況有修四正斷乃至八聖道支者！",
        "translation": "Observing the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are still unobtainable, so why",
        "source": "T06n0220_346:0779a09_6"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀四靜慮尚不可得，況有修四靜慮者！",
        "translation": "It's because the wholesome manifestation of longevity abides in emptiness, and contemplating the four meditations are still unobtainable, so why wouldn't there be someone who cultivates the four meditations?",
        "source": "T06n0220_346:0779a11_7"
    },
    {
        "source_sentence": "觀四無量、四無色定尚不可得，況有修四無量、四無色定者！",
        "translation": "Observing the four immeasurable and four formless concentrations is still unobtainable, so why wouldn't someone cultivate the four immeasurable and four formless concentrations?",
        "source": "T06n0220_346:0779a12_8"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀八解脫尚不可得，況有修八解脫者！",
        "translation": "It's because the wholesome manifestation of longevity abides in emptiness, so it's still unobtainable to contemplate the eight liberations, so why wouldn't there be someone who cultivates the eight liberations?",
        "source": "T06n0220_346:0779a14_9"
    },
    {
        "source_sentence": "觀八勝處、九次第定、十遍處尚不可得，況有修八勝處、九次第定、十遍處者！",
        "translation": "Observing the eight abodes of excellence, nine graduated concentrations, and ten universal abodes is still unobtainable, so why wouldn't someone cultivate the eight abodes of excellence, nine graduated concentrations, and ten universal abo",
        "source": "T06n0220_346:0779a15_10"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀內空尚不可得，況有證內空者！",
        "translation": "Because the wholesome manifestation of longevity abides in emptiness, observing internal emptiness is still unobtainable, so why wouldn't there be someone who realize internal emptiness?",
        "source": "T06n0220_346:0779a17_11"
    },
    {
        "source_sentence": "觀外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空尚不可得，",
        "translation": "They contemplate external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of",
        "source": "T06n0220_346:0779a18_12"
    },
    {
        "source_sentence": "況有證外空乃至無性自性空者！",
        "translation": "How could there be someone who realizes that external emptiness and even the emptiness of the self-nature of nonexistence are empty?",
        "source": "T06n0220_346:0779a21_13"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀真如尚不可得，況有證真如者！",
        "translation": "It's because the whole life span is well manifested and abides in emptiness, so it's still unobtainable to contemplate the true nature, so how could there be anyone who realizes the true nature?",
        "source": "T06n0220_346:0779a22_14"
    },
    {
        "source_sentence": "觀法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界尚不可得，",
        "translation": "He observed that the realm of reality, the essence of reality, the nature of reality, non-falsity, unchangingness and dissimilarity, equality, freedom from arising, legality, the abiding of dharmas, reality",
        "source": "T06n0220_346:0779a23_15"
    },
    {
        "source_sentence": "況有證法界乃至不思議界者！",
        "translation": "How could there be someone who realizes the Dharma realm or even the inconceivable realm!",
        "source": "T06n0220_346:0779a25_16"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀苦聖諦尚不可得，況有證苦聖諦者！",
        "translation": "Because the wholesome manifestation of longevity abides in emptiness, observing the noble truth of suffering is still unobtainable, so how could there be someone who realizes the noble truth of suffering?",
        "source": "T06n0220_346:0779a26_17"
    },
    {
        "source_sentence": "觀集、滅、道聖諦尚不可得，況有證集、滅、道聖諦者！",
        "translation": "Observing the noble truths of accumulation, cessation, and the path is still unobtainable, so why wouldn't someone realize the noble truths of accumulation, cessation, and the path?",
        "source": "T06n0220_346:0779a27_18"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀空解脫門尚不可得，況有修空解脫門者！",
        "translation": "The liberation gate of contemplating emptiness is still unobtainable because the well-established practice of longevity abides in emptiness, so how could there be someone who cultivates the liberation gate of emptiness?",
        "source": "T06n0220_346:0779a29_19"
    },
    {
        "source_sentence": "觀無相、無願解脫門尚不可得，況有修無相、無願解脫門者！",
        "translation": "The liberation gate of observing signlessness and wishlessness is still unobtainable, so why wouldn't someone cultivate the liberation gate of signlessness and wishlessness?",
        "source": "T06n0220_346:0779b01_20"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀五眼尚不可得，況有修五眼者！",
        "translation": "It's because the wholesome manifestation of longevity abides in emptiness, so observing the five eyes is still unobtainable, so why wouldn't there be someone who cultivates the five eyes?",
        "source": "T06n0220_346:0779b02_21"
    },
    {
        "source_sentence": "觀六神通尚不可得，況有修六神通者！",
        "translation": "Observing the six supernormal powers is still unobtainable, so why wouldn't someone cultivate the six supernormal powers?",
        "source": "T06n0220_346:0779b04_22"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀一切陀羅尼門尚不可得，況有修一切陀羅尼門者！",
        "translation": "It's because the well-established body with longevity abides in emptiness, and observing all the dhāraṇī teachings is still unobtainable, so why wouldn't someone cultivate all the dhāraṇī teachings?",
        "source": "T06n0220_346:0779b05_0"
    },
    {
        "source_sentence": "觀一切三摩地門尚不可得，況有修一切三摩地門者！",
        "translation": "Observing all the approaches to samādhi is still unobtainable, so why wouldn't there be someone who cultivates all the approaches to samādhi?",
        "source": "T06n0220_346:0779b06_1"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀佛十力尚不可得，況有修佛十力者！",
        "translation": "Because the well-established Buddha of longevity abides in emptiness, observing the Buddha's ten powers is still unobtainable, so why wouldn't there be someone who cultivates the Buddha's ten powers?",
        "source": "T06n0220_346:0779b07_2"
    },
    {
        "source_sentence": "觀四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法尚不可得，",
        "translation": "Observing that the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 unique qualities of buddhahood are still ungraspable,",
        "source": "T06n0220_346:0779b09_3"
    },
    {
        "source_sentence": "況有修四無所畏乃至十八佛不共法者！",
        "translation": "How could there be someone who cultivates the four fearlessnesses and even the 18 Buddha-principles!",
        "source": "T06n0220_346:0779b10_4"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀無忘失法尚不可得，況有修無忘失法者！",
        "translation": "It's because the wholesome manifestation of longevity abides in emptiness, and it's still unobtainable to contemplate the principle of no forgetfulness, so how could there be someone who cultivates the principle of no forgetfulness",
        "source": "T06n0220_346:0779b11_5"
    },
    {
        "source_sentence": "觀恒住捨性尚不可得，況有修恒住捨性者！",
        "translation": "Observing the nature of constantly abiding equanimity is still unobtainable, so why wouldn't there be someone who cultivates the nature of constantly abiding equanimity?",
        "source": "T06n0220_346:0779b13_6"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀一切智尚不可得，況有修一切智者！",
        "translation": "It's because the wholesome manifestation of longevity abides in emptiness, so it's still unobtainable to contemplate omniscience, so why wouldn't there be someone who cultivates omniscience?",
        "source": "T06n0220_346:0779b14_7"
    },
    {
        "source_sentence": "觀道相智、一切相智尚不可得，況有修道相智、一切相智者！",
        "translation": "Knowledge of the path and knowledge of all characteristics are still unobtainable, so why wouldn't someone cultivate knowledge of the path and knowledge of all characteristics?",
        "source": "T06n0220_346:0779b15_8"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀一切菩薩摩訶薩行尚不可得，況有修一切菩薩摩訶薩行者！",
        "translation": "It's because the well-established Buddha of longevity abides in emptiness, observing all the bodhisattva-mahāsattva practices is still unobtainable, so why wouldn't someone cultivate all the bodhisatt",
        "source": "T06n0220_346:0779b17_9"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀諸佛無上正等菩提尚不可得，況有證諸佛無上正等菩提者！",
        "translation": "It's because the well-established body with longevity abides in emptiness, and it's because observing the unsurpassed correct perfect enlightenment of the buddhas is still unobtainable, so why wouldn't there be",
        "source": "T06n0220_346:0779b19_0"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀諸如來尚不可得，況有轉法輪者！",
        "translation": "It's because the well-established appearance of longevity abides in emptiness, so observing the tathāgatas is still unobtainable, so why wouldn't there be someone who turns the Dharma wheel?",
        "source": "T06n0220_346:0779b20_1"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀無生滅法尚不可得，況有證無生滅者！",
        "translation": "Because the wholesome manifestation of longevity abides in emptiness, it's still unobtainable to contemplate the dharmas of neither arising nor ceasing, so how could there be someone who realizes the absence of arising and cea",
        "source": "T06n0220_346:0779b22_2"
    },
    {
        "source_sentence": "「具壽善現安住空故，觀三十二相、八十隨好尚不可得，況有具此相好身者！",
        "translation": "Because the body with longevity and good appearance abides in emptiness, it's still unobtainable to contemplate the thirty-two marks and eighty secondary signs, so why wouldn't there be a body with these marks",
        "source": "T06n0220_346:0779b23_3"
    },
    {
        "source_sentence": "「何以故？",
        "translation": "“Why is that?",
        "source": "T06n0220_346:0779b26_0"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_346:0779b26_1"
    },
    {
        "source_sentence": "具壽善現於一切法，住遠離住、寂靜住、無所得住、空住、無相住、無願住。",
        "translation": "Guoshou well-manifests all dharmas, abiding in seclusion, quiescence, nonacquisition, emptiness, signlessness, and wishlessness.",
        "source": "T06n0220_346:0779b26_2"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_346:0779b27_3"
    },
    {
        "source_sentence": "具壽善現於一切法，住如是等無量勝住。",
        "translation": "He's endowed with longevity and well-manifesting all dharmas, abiding in such an immeasurable superior abode.",
        "source": "T06n0220_346:0779b28_4"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_346:0779b29_5"
    },
    {
        "source_sentence": "善現所住比諸菩薩摩訶薩眾所住般若波羅蜜多最勝行住，百分不及一，",
        "translation": "The abode of the well-manifest is one hundredth the supreme practice abode of the prajñāpāramitā where all the bodhisattvas and mahāsattvas abide,",
        "source": "T06n0220_346:0779b29_6"
    },
    {
        "source_sentence": "千分不及一，百千分不及一，俱胝分不及一，百俱胝分不及一，千俱胝分不及一，",
        "translation": "A thousand parts are not equal to one, a hundred thousand parts are not equal to one. The duration of the kalpa is not equal to one; the duration of a hundred kalpas is not equal to one; and the duration of a thousand kalpas is not",
        "source": "T06n0220_346:0779c01_7"
    },
    {
        "source_sentence": "百千俱胝分不及一，那庾多分不及一，百那庾多分不及一，千那庾多分不及一，",
        "translation": "A hundred-thousandth of koṭis of corpuscles is not equal to one; a trillion parts are not equal to one; a hundred trillion parts are not equal to one; a thousand trillion parts are not equal to one.",
        "source": "T06n0220_346:0779c03_8"
    },
    {
        "source_sentence": "百千那庾多分不及一，百千俱胝那庾多分不及一，數分、計分、算分、喻分乃至鄔波尼殺曇分亦不及一。",
        "translation": "A hundred thousand nayutas doesn't amount to one, a hundred thousand koṭis of nayutas doesn't amount to one, and neither does the number part, calculation part, calculation part, calculation part, metaphor part, or up to the up",
        "source": "T06n0220_346:0779c05_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_346:0779c07_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_346:0779c08_11"
    },
    {
        "source_sentence": "除如來住，是諸菩薩摩訶薩眾所住般若波羅蜜多最勝行住，於諸聲聞、獨覺等住，",
        "translation": "“Exception made for the abode of Buddha, this abode belongs to all bodhisattva-mahasattvas. It is the supremely practiced abode of the perfection of wisdom wherein there are disciples and solitary enlightened",
        "source": "T06n0220_346:0779c08_12"
    },
    {
        "source_sentence": "為最為勝、為長為尊、為妙為微妙、為上為無上。",
        "translation": "It's the most superior, the longest and honored, the marvelous and subtle, and the highest and unsurpassed.",
        "source": "T06n0220_346:0779c10_13"
    },
    {
        "source_sentence": "以是故，憍尸迦！",
        "translation": "That's why, Kauśika!",
        "source": "T06n0220_346:0779c11_14"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲住一切有情上者，當住般若波羅蜜多最勝行住。",
        "translation": "If bodhisattvas, mahāsattvas, want to abide above all sentient beings, they should abide in the supreme practice abode of prajñāpāramitā.",
        "source": "T06n0220_346:0779c11_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_346:0779c13_16"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_346:0779c13_17"
    },
    {
        "source_sentence": "諸菩薩摩訶薩安住般若波羅蜜多最勝行住，超諸聲聞、獨覺等地，證入菩薩正性離生，",
        "translation": "The bodhisattvas, mahāsattvas, and buddhas abide in the supreme practice abode of the perfection of wisdom, transcending the stages of śrāvakas and pratyekbuddhas, realizing that they enter the true nature of enl",
        "source": "T06n0220_346:0779c13_18"
    },
    {
        "source_sentence": "速能圓滿一切佛法，斷諸煩惱相續習氣，疾證無上正等菩提，得名如來、應、正等覺，",
        "translation": "Being able to quickly perfect all buddha-teachings, they cut off the habit energy of the afflictions, and quickly realize unexcelled true awakening. They attain enlightenment and are called “tathāgatas,” “com",
        "source": "T06n0220_346:0779c15_19"
    },
    {
        "source_sentence": "成就圓滿一切智智。」",
        "translation": "He accomplishes the perfect knowledge of all cognitions.",
        "source": "T06n0220_346:0779c17_20"
    },
    {
        "source_sentence": "爾時，會中有無量無數三十三天，歡喜踊躍各取天上微妙音華，奉散如來及苾芻眾。",
        "translation": "At the time, there were countless and immeasurable thirty-three gods in the assembly, each rejoicing and jumping with joy to take the flowers of subtle sounds from heaven and distribute them to the Tathāgata",
        "source": "T06n0220_346:0779c18_0"
    },
    {
        "source_sentence": "于時眾內六千苾芻從坐而起，偏覆左肩右膝著地向佛合掌。",
        "translation": "Six thousand monks in the assembly then rose from their seats, covered their left shoulders with their right knees touching the ground and joined their palms facing the Buddha.",
        "source": "T06n0220_346:0779c19_1"
    },
    {
        "source_sentence": "佛神力故，各於掌中微妙音華自然盈滿，是諸苾芻歡喜踊躍得未曾有，",
        "translation": "Because of the supernatural power of the Buddha, each palm naturally filled with subtle sounds and flowers. These monks were delighted and jumped for joy unprecedentedly.",
        "source": "T06n0220_346:0779c21_2"
    },
    {
        "source_sentence": "各以此華奉散如來、應、正等覺。",
        "translation": "Each of them presented this flower to the Tathāgata, Arhat, and Completely Enlightened One.",
        "source": "T06n0220_346:0779c23_3"
    },
    {
        "source_sentence": "既散佛已俱發願言：「我等用斯勝善根力，願常安住甚深般若波羅蜜多最勝行住，",
        "translation": "Having scattered the Buddha, they all made a vow, saying, “With the power of these superior roots of goodness, we wish to always live in the most excellent practice and abode of profound prajñāpāramitā.",
        "source": "T06n0220_346:0779c23_4"
    },
    {
        "source_sentence": "聲聞、獨覺所不能住，速趣無上正等菩提，超諸聲聞及獨覺地。」",
        "translation": "They can't be abided by śrāvakas or solitary realizers, quickly aspire to unsurpassed perfect enlightenment and transcend the stages of śrāvakas and solitary realizers.",
        "source": "T06n0220_346:0779c25_5"
    },
    {
        "source_sentence": "爾時，世尊知諸苾芻心行清白，即便微笑如佛常法，於微笑時種種色光從口中出，",
        "translation": "Knowing that the minds and actions of the monks were pure and white, the Bhagavān then smiled in accordance with the Buddha’s usual manner. As he smiled, a light of various colors emerged from his mouth.",
        "source": "T06n0220_346:0779c28_0"
    },
    {
        "source_sentence": "所謂青黃赤白紅縹等光，遍照此三千大千佛之世界，還遶佛身經三匝已從頂上入。",
        "translation": "The so-called blue, yellow, red, white, white, red, and blue lights pervade these 3,000 great one-thousand buddha worlds, circling the Buddha's body three times and entering from the top of his head.",
        "source": "T06n0220_346:0779c29_1"
    },
    {
        "source_sentence": "具壽慶喜即從坐起，禮佛合掌白言：「世尊！",
        "translation": "Kauṣṭhila then got up from his seat, saluted the Buddha with joined palms, and said, Bhagavān!",
        "source": "T06n0220_346:0780a02_2"
    },
    {
        "source_sentence": "何因何緣現此微笑？",
        "translation": "What's the cause and condition for showing this smile?",
        "source": "T06n0220_346:0780a03_3"
    },
    {
        "source_sentence": "諸佛現笑非無因緣，唯願如來哀愍為說。」",
        "translation": "The buddhas' present laughter isn't without a reason, but may the Tathāgata have pity and explain it for them.",
        "source": "T06n0220_346:0780a04_4"
    },
    {
        "source_sentence": "佛告慶喜：「此發勝願六千苾芻，於未來世星喻劫中，當得無上正等菩提，",
        "translation": "The Buddha told Qingxi, These six thousand monks who had given rise to the supreme vow would attain unsurpassed perfect enlightenment in the future world age of the stars and metaphors.",
        "source": "T06n0220_346:0780a05_5"
    },
    {
        "source_sentence": "皆同一號，名散花如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵。",
        "translation": "They all have the same name, which is Saṃkusumitarāja Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed Man, Trainer, Teacher",
        "source": "T06n0220_346:0780a06_6"
    },
    {
        "source_sentence": "彼諸如來、應、正等覺，苾芻弟子佛土壽量，皆悉齊等同受千歲。",
        "translation": "The Tathāgatas, Arhats, and Fully Awakened Ones, as well as the bhikṣus, disciples, buddhas, and buddha lands, all had the same life span of one thousand years.",
        "source": "T06n0220_346:0780a08_7"
    },
    {
        "source_sentence": "是諸如來、應、正等覺，初生出家及成佛已，隨所在處若晝若夜，常雨五色微妙音華。",
        "translation": "These are the tathāgatas, arhats, and fully awakened ones who first arise, leave home, and become buddhas, and wherever they are, whether day or night, it always rains five-colored subtle sound flowers of subtle",
        "source": "T06n0220_346:0780a10_8"
    },
    {
        "source_sentence": "以是因緣故我微笑。",
        "translation": "Because of these causes and conditions, I smiled.",
        "source": "T06n0220_346:0780a12_9"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780a12_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得安住最勝住者，當學般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva wants to attain the most excellent abode, he or she should train in the perfection of wisdom.",
        "source": "T06n0220_346:0780a12_11"
    },
    {
        "source_sentence": "慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780a14_12"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲得安住如來住者，當學般若波羅蜜多。",
        "translation": "If a bodhisattva-mahāsattva wants to attain peaceful abiding in the Tathāgata's abode, he or she should train in the perfection of wisdom.",
        "source": "T06n0220_346:0780a14_13"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780a15_14"
    },
    {
        "source_sentence": "若善男子、善女人等精勤修學甚深般若波羅蜜多，是善男子、善女人等先世或從人間沒已還生此處，",
        "translation": "If good men and good women diligently cultivate the profound perfection of wisdom, they're good men and good women who were born back here in a previous life or from among humans.",
        "source": "T06n0220_346:0780a16_0"
    },
    {
        "source_sentence": "或從覩史多天上沒來生人間，彼於先世或在人中或復天上，由得廣聞甚深般若波羅蜜多，",
        "translation": "Or they may have descended from the heaven of Kauśinagara and been born among humans. In a former existence, either among humans or in another heaven, they attained profound wisdom by hearing extensively about the perfection of wisdom.",
        "source": "T06n0220_346:0780a18_1"
    },
    {
        "source_sentence": "能於今生精勤修學甚深般若波羅蜜多。",
        "translation": "He's able to diligently cultivate the profound prajñāpāramitā in his present life.",
        "source": "T06n0220_346:0780a20_2"
    },
    {
        "source_sentence": "慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780a21_3"
    },
    {
        "source_sentence": "如來現見精勤修學甚深般若波羅蜜多無所顧者，彼人決定是大菩薩。",
        "translation": "If the Tathāgata now sees someone who diligently cultivates the profound prajñāpāramitā without concern, that person is definitely a great bodhisattva.",
        "source": "T06n0220_346:0780a21_4"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T06n0220_346:0780a24_0"
    },
    {
        "source_sentence": "若善男子、善女人等能於如是甚深般若波羅蜜多，愛樂聽聞、受持、讀誦、究竟通利、如理思惟，",
        "translation": "If good men and good women can delight in listening to, retaining, reciting, thoroughly penetrating, and correctly contemplating such profound prajñāpāramitā,",
        "source": "T06n0220_346:0780a24_1"
    },
    {
        "source_sentence": "為菩薩乘諸善男子、善女人等宣說開示教誡教授，當知彼人是大菩薩，",
        "translation": "He should be known as a great bodhisattva to all the good men and good women of the bodhisattva vehicle who preach, instruct, and teach him.",
        "source": "T06n0220_346:0780a26_2"
    },
    {
        "source_sentence": "曾於過去親從如來、應、正等覺聞說如是甚深般若波羅蜜多，聞已愛樂、受持、讀誦、究竟通利、如理思惟、廣為他說，",
        "translation": "Having heard such profound prajñāpāramitā from the Tathāgata, Arhat, and Completely Enlightened One in the past, they delighted in it, memorized it, recited it, thoroughly benefited from it, correctly",
        "source": "T06n0220_346:0780a28_3"
    },
    {
        "source_sentence": "故於今生能辦是事。",
        "translation": "Therefore, he's able to accomplish these things in the present life.",
        "source": "T06n0220_346:0780b01_4"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780b02_5"
    },
    {
        "source_sentence": "彼善男子、善女人等曾於過去無量佛所多種善根，故於今生能辦是事。",
        "translation": "Good sons and good women, they've cultivated many good roots in the past at the feet of measureless buddhas, so they're able to accomplish these things in their present life.",
        "source": "T06n0220_346:0780b02_6"
    },
    {
        "source_sentence": "彼善男子、善女人等應作是念：『我先不從聲聞、獨覺聞說如是甚深般若波羅蜜多，",
        "translation": "Good men and good women should think, 'First, I won't hear such profound prajñāpāramitā from śrāvakas or pratyekbuddhas.",
        "source": "T06n0220_346:0780b04_0"
    },
    {
        "source_sentence": "定從如來、應、正等覺聞說如是甚深般若波羅蜜多。",
        "translation": "They'll surely hear such profound prajñāpāramitā from the Tathāgata, Arhat, and Completely Awakened One.",
        "source": "T06n0220_346:0780b05_1"
    },
    {
        "source_sentence": "我先不於聲聞、獨覺種諸善根，定於如來、應、正等覺種諸善根。",
        "translation": "I didn't previously plant good roots in śrāvakas and pratyekbuddhas, but I certainly planted good roots in the Tathāgata, Arhat, and Completely Awakened One.",
        "source": "T06n0220_346:0780b07_2"
    },
    {
        "source_sentence": "由是因緣今得聞此甚深般若波羅蜜多，愛樂受持、讀誦、通利、如理思惟、廣為他說，",
        "translation": "Because of these causes and conditions, they can now hear this profound prajñāpāramitā, delight in retaining it, reciting it, thoroughly benefiting it, correctly contemplating it, and explaining it widely for others.",
        "source": "T06n0220_346:0780b08_3"
    },
    {
        "source_sentence": "能無厭倦。』",
        "translation": "He's able to be tireless.'",
        "source": "T06n0220_346:0780b10_4"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780b10_5"
    },
    {
        "source_sentence": "若善男子、善女人等能於如是甚深般若波羅蜜多，愛樂聽聞、受持、讀誦、究竟通利、如理思惟，",
        "translation": "If good men and good women can delight in listening to, retaining, reciting, thoroughly penetrating, and correctly contemplating such profound prajñāpāramitā,",
        "source": "T06n0220_346:0780b10_6"
    },
    {
        "source_sentence": "於義於法於深意趣隨順修行，是善男子、善女人等則為現見我等如來、應、正等覺。",
        "translation": "In terms of meaning and the profound intention to follow and cultivate the teaching, these good men and good women now see us as tathāgatas, arhats, and fully awakened ones.",
        "source": "T06n0220_346:0780b12_7"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780b14_8"
    },
    {
        "source_sentence": "若善男子、善女人等聞說如是甚深般若波羅蜜多，深心信受不毀不謗不可沮壞，",
        "translation": "If good men and good women hear such profound prajñāpāramitā, they deeply believe it, don't disparage it, don't denigrate it, and can't refute it.",
        "source": "T06n0220_346:0780b15_0"
    },
    {
        "source_sentence": "是善男子、善女人等已曾供養無量諸佛，於諸佛所多種善根，亦為無量善友攝受。",
        "translation": "Good men and good women have already offered support to measureless buddhas, and they've gathered in measureless good friends who have many good roots in the presence of those buddhas.",
        "source": "T06n0220_346:0780b16_1"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780b18_2"
    },
    {
        "source_sentence": "若善男子、善女人等能於如來、應、正等覺勝福田所種諸善根，雖定當得或聲聞果、或獨覺果、或如來果，",
        "translation": "“Furthermore, if sons and daughters of a virtuous family can plant roots of goodness in the supremely blessed field of enlightened ones, they will surely attain either the fruit of śrāvakahood, pratyekabud",
        "source": "T06n0220_346:0780b18_3"
    },
    {
        "source_sentence": "而證無上正等菩提，要於如是甚深般若波羅蜜多善解無礙，修行布施波羅蜜多，",
        "translation": "To realize unsurpassed perfect enlightenment, they must understand the profound prajñāpāramitā well without obstruction and cultivate the perfection of generosity.",
        "source": "T06n0220_346:0780b21_4"
    },
    {
        "source_sentence": "修行淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "He cultivates pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T06n0220_346:0780b23_5"
    },
    {
        "source_sentence": "安住內空，安住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空。",
        "translation": "They abide in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without",
        "source": "T06n0220_346:0780b24_6"
    },
    {
        "source_sentence": "安住真如，安住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界。",
        "translation": "He abides in true reality, abiding in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, space realm, and incon",
        "source": "T06n0220_346:0780b27_7"
    },
    {
        "source_sentence": "安住苦聖諦，安住集、滅、道聖諦。",
        "translation": "They abide in the noble truth of suffering, and they abide in the noble truths of accumulation, cessation, and the path.",
        "source": "T06n0220_346:0780b29_8"
    },
    {
        "source_sentence": "修行四念住，修行四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "He cultivates the four abodes of mindfulness, cultivates the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path",
        "source": "T06n0220_346:0780c01_9"
    },
    {
        "source_sentence": "修行四靜慮，修行四無量、四無色定。",
        "translation": "He cultivates the four meditations and cultivates the four immeasurable and four formless concentrations.",
        "source": "T06n0220_346:0780c03_10"
    },
    {
        "source_sentence": "修行八解脫，修行八勝處、九次第定、十遍處。",
        "translation": "He cultivates the eight liberations, and he cultivates the eight abodes of excellence, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_346:0780c03_11"
    },
    {
        "source_sentence": "修行空解脫門，修行無相、無願解脫門。",
        "translation": "He cultivates the liberation gate of emptiness and cultivates the liberation gate of signlessness and wishlessness.",
        "source": "T06n0220_346:0780c04_12"
    },
    {
        "source_sentence": "修行五眼，修行六神通。",
        "translation": "He cultivates the five eyes and cultivates the six supernormal powers.",
        "source": "T06n0220_346:0780c05_13"
    },
    {
        "source_sentence": "修行佛十力，修行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法。",
        "translation": "He cultivates the Buddha's ten powers, cultivates the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 unique dharmas of",
        "source": "T06n0220_346:0780c06_14"
    },
    {
        "source_sentence": "修行無忘失法，修行恒住捨性。",
        "translation": "He cultivates the principle of nonforgetfulness and cultivates the practice that always abides in equanimity.",
        "source": "T06n0220_346:0780c08_0"
    },
    {
        "source_sentence": "修行一切陀羅尼門，修行一切三摩地門。",
        "translation": "He cultivates all the dhāraṇī teachings and cultivates all the samādhi teachings.",
        "source": "T06n0220_346:0780c08_1"
    },
    {
        "source_sentence": "修行一切智，修行道相智、一切相智，令得圓滿。",
        "translation": "He cultivates omniscience, cultivates knowledge of the path and knowledge of all characteristics, and causes it to be perfected.",
        "source": "T06n0220_346:0780c09_2"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0780c10_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩能於如是甚深般若波羅蜜多善解無礙，修行布施波羅蜜多，",
        "translation": "If bodhisattvas and mahāsattvas can skillfully understand the profound perfection of wisdom like this without obstruction and cultivate the perfection of generosity,",
        "source": "T06n0220_346:0780c10_4"
    },
    {
        "source_sentence": "修行淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "He cultivates pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T06n0220_346:0780c12_5"
    },
    {
        "source_sentence": "安住內空，安住外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空。",
        "translation": "They abide in internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without",
        "source": "T06n0220_346:0780c13_6"
    },
    {
        "source_sentence": "安住真如，安住法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界。",
        "translation": "He abides in true reality, abiding in the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, space realm, and incon",
        "source": "T06n0220_346:0780c17_7"
    },
    {
        "source_sentence": "安住苦聖諦，安住集、滅、道聖諦。",
        "translation": "They abide in the noble truth of suffering, and they abide in the noble truths of accumulation, cessation, and the path.",
        "source": "T06n0220_346:0780c19_8"
    },
    {
        "source_sentence": "修行四念住，修行四正斷、四神足、五根、五力、七等覺支、八聖道支。",
        "translation": "He cultivates the four abodes of mindfulness, cultivates the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path",
        "source": "T06n0220_346:0780c20_9"
    },
    {
        "source_sentence": "修行四靜慮，修行四無量、四無色定。",
        "translation": "He cultivates the four meditations and cultivates the four immeasurable and four formless concentrations.",
        "source": "T06n0220_346:0780c21_10"
    },
    {
        "source_sentence": "修行八解脫，修行八勝處、九次第定、十遍處。",
        "translation": "He cultivates the eight liberations, and he cultivates the eight abodes of excellence, nine graduated concentrations, and ten universal abodes.",
        "source": "T06n0220_346:0780c22_11"
    },
    {
        "source_sentence": "修行空解脫門，修行無相、無願解脫門。",
        "translation": "He cultivates the liberation gate of emptiness and cultivates the liberation gate of signlessness and wishlessness.",
        "source": "T06n0220_346:0780c23_12"
    },
    {
        "source_sentence": "修行五眼，修行六神通。",
        "translation": "He cultivates the five eyes and cultivates the six supernormal powers.",
        "source": "T06n0220_346:0780c24_13"
    },
    {
        "source_sentence": "修行佛十力，修行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法。",
        "translation": "He cultivates the Buddha's ten powers, cultivates the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 unique dharmas of",
        "source": "T06n0220_346:0780c24_14"
    },
    {
        "source_sentence": "修行無忘失法，修行恒住捨性。",
        "translation": "He cultivates the principle of nonforgetfulness and cultivates the practice that always abides in equanimity.",
        "source": "T06n0220_346:0780c26_15"
    },
    {
        "source_sentence": "修行一切陀羅尼門，修行一切三摩地門。",
        "translation": "He cultivates all the dhāraṇī teachings and cultivates all the samādhi teachings.",
        "source": "T06n0220_346:0780c27_16"
    },
    {
        "source_sentence": "修行一切智，修行道相智、一切相智，令得圓滿。",
        "translation": "He cultivates omniscience, cultivates knowledge of the path and knowledge of all characteristics, and causes it to be perfected.",
        "source": "T06n0220_346:0780c28_17"
    },
    {
        "source_sentence": "是菩薩摩訶薩不得無上正等菩提，而住聲聞、獨覺地者無有是處。",
        "translation": "There's no place for bodhisattvas, mahāsattvas, who don't attain unsurpassed perfect enlightenment and abide in the stages of śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_346:0780c29_18"
    },
    {
        "source_sentence": "是故菩薩摩訶薩欲證無上正等菩提，應於如是甚深般若波羅蜜多善解無礙，",
        "translation": "Therefore, if bodhisattvas and mahāsattvas want to realize unsurpassed perfect enlightenment, they should well understand the profound prajñāpāramitā like this without obstruction.",
        "source": "T06n0220_346:0781a01_19"
    },
    {
        "source_sentence": "修行布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，乃至修行一切智、道相智、一切相智，",
        "translation": "He cultivates generosity, pure morality, patience, patience, effort, meditation, concentration, and the perfection of wisdom, up to he cultivates omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T06n0220_346:0781a03_20"
    },
    {
        "source_sentence": "令得圓滿。",
        "translation": "It causes them to attain perfection.",
        "source": "T06n0220_346:0781a05_21"
    },
    {
        "source_sentence": "「是故，慶喜！",
        "translation": "Therefore, rejoicing!",
        "source": "T06n0220_346:0781a05_22"
    },
    {
        "source_sentence": "我以般若波羅蜜多甚深經典付囑於汝，應正受持、讀誦、通利，勿令忘失！",
        "translation": "I entrust to you the profound scripture of the Prajñāpāramitā, which should be correctly memorized, recited, and made accessible, so that you won't forget it!",
        "source": "T06n0220_346:0781a05_23"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0781a07_24"
    },
    {
        "source_sentence": "除此般若波羅蜜多甚深經典，受持諸餘我所說法，設有忘失其罪猶小，",
        "translation": "Apart from this profound scripture of prajñāpāramitā, accepting and upholding the other teachings taught by me would be a minor offense if someone forgets them.",
        "source": "T06n0220_346:0781a07_25"
    },
    {
        "source_sentence": "若於般若波羅蜜多甚深經典不善受持，下至一句有忘失者，其罪甚大。",
        "translation": "If someone doesn't well memorize the profound sūtras of the Prajñāpāramitā and forget a single phrase, their sin is great.",
        "source": "T06n0220_346:0781a09_26"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T06n0220_346:0781a11_27"
    },
    {
        "source_sentence": "若於般若波羅蜜多甚深經典，下至一句能善受持不忘失者，獲福無量。",
        "translation": "If someone can skillfully memorize and retain the profound sūtras of the prajñāpāramitā down to a single phrase without forgetting them, they'll attain measureless merit.",
        "source": "T06n0220_346:0781a11_28"
    },
    {
        "source_sentence": "若有於此不善受持，下至一句有忘失者，所獲重罪同前福量。",
        "translation": "If someone doesn't well accept and uphold this, and there's forgetfulness in the next sentence, the serious offense they'll attain is the same as the measure of the previous one's merit.",
        "source": "T06n0220_346:0781a13_29"
    },
    {
        "source_sentence": "「是故，慶喜！",
        "translation": "Therefore, rejoicing!",
        "source": "T06n0220_346:0781a14_30"
    },
    {
        "source_sentence": "我以般若波羅蜜多甚深經典慇懃付汝，當正受持、讀誦、通利、如理思惟、廣為他說、分別開示，",
        "translation": "I will entrust the profound scripture Prajñāpāramitā to you, which you should correctly memorize, recite, penetrate, correctly contemplate, explain in detail for others, and discern.",
        "source": "T06n0220_346:0781a14_31"
    },
    {
        "source_sentence": "令受持者究竟解了文義意趣。",
        "translation": "It causes those who receive and uphold it to ultimately understand the meaning of the text and its intention.",
        "source": "T06n0220_346:0781a16_32"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百四十六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 4",
        "source": "T06n0220_346:0781a18_0"
    }
]