[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2, Volume 9",
        "source": "T06n0220_291:0477c04_0"
    },
    {
        "source_sentence": "十一",
        "translation": "eleven",
        "source": "T06n0220_291:0477c05_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_291:0477c07_0"
    },
    {
        "source_sentence": "初分著不著相品第三十六之五",
        "translation": "The Thirty-sixth and Fifth Chapter of the First Part, Attachment and Non-attachment to Characteristics",
        "source": "T06n0220_291:0477c08_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0477c09_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行五眼著不著相是行般若波羅蜜多，",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of prajñāpāramitā, if he doesn't practice the five eyes attached and doesn't attach to characteristics, this is practicing the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c09_1"
    },
    {
        "source_sentence": "不行六神通著不著相是行般若波羅蜜多。",
        "translation": "Not practicing the six supernormal powers and not attaching to characteristics is the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c10_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0477c11_3"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行佛十力著不著相是行般若波羅蜜多，",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of prajñāpāramitā, if he doesn't practice the Buddha's ten powers and doesn't cling to or attach to characteristics, this is practicing the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c12_0"
    },
    {
        "source_sentence": "不行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法著不著相是行般若波羅蜜多。",
        "translation": "Not practicing the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-uncommon dharmas that are attached and not attached to characteristics is the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c13_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0477c15_2"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行無忘失法著不著相是行般若波羅蜜多，",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñāpāramitā, if they don't practice the dharmas without forgetting or attaching to them, this is the perfection of practice of prajñāpāramitā.",
        "source": "T06n0220_291:0477c16_0"
    },
    {
        "source_sentence": "不行恒住捨性著不著相是行般若波羅蜜多。",
        "translation": "Not practicing the perfection of prajñāpāramitā without constantly abiding in equanimity and attaching to or not attaching to characteristics is the perfection of practice.",
        "source": "T06n0220_291:0477c17_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0477c18_2"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行一切智著不著相是行般若波羅蜜多，",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of prajñāpāramitā, if he doesn't practice omniscience and attach to or doesn't attach to characteristics, this is practicing the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c19_0"
    },
    {
        "source_sentence": "不行道相智、一切相智著不著相是行般若波羅蜜多。",
        "translation": "Not practicing the knowledge of the path's characteristics and the knowledge that all characteristics are attached and not attached to characteristics is the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c20_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0477c22_2"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行一切陀羅尼門著不著相是行般若波羅蜜多，",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of prajñāpāramitā, if he doesn't practice all the dhāraṇī aspects that are attached to and don't cling to characteristics, this is practicing the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c22_3"
    },
    {
        "source_sentence": "不行一切三摩地門著不著相是行般若波羅蜜多。",
        "translation": "Not practicing all the aspects of samādhi that are attached and not attached is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c24_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0477c26_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行預流果著不著相是行般若波羅蜜多，",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñāpāramitā, if they don't practice the fruit of pre-flow attachment and don't attach to characteristics, then they practice the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c26_1"
    },
    {
        "source_sentence": "不行一來、不還、阿羅漢果著不著相是行般若波羅蜜多。",
        "translation": "Not practicing the perfection of prajñāpāramitā without attachment to the characteristics of the once-returner, nonreturner, and arhat fruits is practicing the perfection of prajñā.",
        "source": "T06n0220_291:0477c27_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0477c29_3"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行獨覺菩提著不著相是行般若波羅蜜多。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñāpāramitā, if they don't practice the solitary realizer's enlightenment and aren't attached to characteristics, then they practice the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0477c29_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a02_5"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行一切菩薩摩訶薩行著不著相是行般若波羅蜜多。",
        "translation": "When a bodhisattva-mahāsattva practices the perfection of prajñāpāramitā, if he doesn't practice all the bodhisattva-mahāsattva practices and doesn't attach to characteristics, this is the perfection of practice of prajñāpāramitā.",
        "source": "T06n0220_291:0478a02_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a04_7"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若不行諸佛無上正等菩提著不著相是行般若波羅蜜多。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñāpāramitā, if they don't practice the unsurpassed perfect enlightenment of the buddhas and aren't attached to characteristics, this is the perfection of practicing the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a04_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a07_0"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於色不起著不著想，於受、想、行、識不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to attachment or no-attachment thoughts about form, and they don't give rise to attachment or no-attachment thoughts about feeling, perception, volition, or consciousness.",
        "source": "T06n0220_291:0478a07_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a09_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a09_3"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於眼處不起著不著想，於耳、鼻、舌、身、意處不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the eye, and they don't give rise to thoughts of attachment or non-attachment in the ear, nose, nose, tongue, body, or mind.",
        "source": "T06n0220_291:0478a09_4"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a11_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a12_6"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於色處不起著不著想，於聲、香、味、觸、法處不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in form, and they don't give rise to thoughts of attachment or non-attachment in sound, odor, taste, touch, or dharma places.",
        "source": "T06n0220_291:0478a12_7"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a14_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a15_9"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於眼界不起著不著想，於色界、眼識界及眼觸、眼觸為緣所生諸受不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the eye realm, and they don't give rise to thoughts of attachment or non-attachment in the form realm, the eye consciousness realm, or the sensations that arise from eye contact or eye contact as a condition",
        "source": "T06n0220_291:0478a15_10"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a18_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a18_12"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於耳界不起著不著想，於聲界、耳識界及耳觸、耳觸為緣所生諸受不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the ear realm, and they don't give rise to thoughts of attachment or non-attachment in the sound realm, the ear consciousness realm, or the sensations that arise from ear contact or ear contact as a condition",
        "source": "T06n0220_291:0478a18_13"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a21_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a21_15"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於鼻界不起著不著想，於香界、鼻識界及鼻觸、鼻觸為緣所生諸受不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the nose realm, and they don't give rise to thoughts of attachment or non-attachment in the sense realm of fragrance, the nasal consciousness realm, or the sensations that arise from nasal",
        "source": "T06n0220_291:0478a22_16"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a24_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a25_18"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於舌界不起著不著想，於味界、舌識界及舌觸、舌觸為緣所生諸受不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the tongue realm, and they don't give rise to thoughts of attachment or non-attachment in the taste realm, the tongue-consciousness realm, or the sensations that arise from tongue contact or tongue",
        "source": "T06n0220_291:0478a25_19"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478a28_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478a28_21"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於身界不起著不著想，於觸界、身識界及身觸、身觸為緣所生諸受不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the body realm, and they don't give rise to thoughts of attachment or non-attachment in the touch realm, body consciousness realm, or feelings that arise from body contact or body contact as a condition.",
        "source": "T06n0220_291:0478a28_22"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b02_23"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b03_0"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於意界不起著不著想，於法界、意識界及意觸、意觸為緣所生諸受不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to attachment or no-attachment thoughts in the mind realm, and they don't give rise to attachment or no-attachment thoughts in the Dharma realm, the consciousness realm, or the sensations that arise from mental contact or mental contact as a condition.",
        "source": "T06n0220_291:0478b03_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b05_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b06_3"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於地界不起著不著想，於水、火、風、空、識界不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment in the earth realm and doesn't give rise to thoughts of attachment or non-attachment in the water, fire, wind, air, space, or consciousness realms.",
        "source": "T06n0220_291:0478b06_4"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b08_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b09_6"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於無明不起著不著想，於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment to nescience and doesn't give rise to thoughts of attachment or non-attachment to form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension,",
        "source": "T06n0220_291:0478b09_7"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b12_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b13_0"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於布施波羅蜜多不起著不著想，於淨戒、安忍、精進、靜慮、般若波羅蜜多不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the perfection of generosity, and they don't give rise to thoughts of attachment or non-attachment in the perfection of pure morality, patience, effort, meditation, or the perfection of wisdom.",
        "source": "T06n0220_291:0478b13_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b16_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b16_1"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於內空不起著不著想，於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of internal emptiness and doesn't cling or attach to it, and he doesn't give rise to thoughts of external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness,",
        "source": "T06n0220_291:0478b16_2"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b21_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b22_4"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於真如不起著不著想，於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or attachment to the true nature, and doesn't give rise to thoughts of attachment or attachment to the Dharma realm, Dharma nature, non-falsity, unchangingness, equality, freedom from birth, legality, Dharma abiding",
        "source": "T06n0220_291:0478b22_5"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b25_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b26_7"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於苦聖諦不起著不著想，於集、滅、道聖諦不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment to the noble truth of suffering and don't give rise to thoughts of attachment or non-attachment to the noble truths of arising, ceasing, and the path.",
        "source": "T06n0220_291:0478b26_8"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478b28_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478b29_10"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於四靜慮不起著不著想，於四無量、四無色定不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment in the four meditations and doesn't give rise to thoughts of attachment or non-attachment in the four immeasurable and four formless concentrations.",
        "source": "T06n0220_291:0478b29_11"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c02_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c02_13"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於八解脫不起著不著想，於八勝處、九次第定、十遍處不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment in the eight liberations and doesn't give rise to thoughts of attachment or non-attachment in the eight superior places, nine graduated concentrations, or ten universal abodes.",
        "source": "T06n0220_291:0478c03_14"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c05_15"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c06_0"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於四念住不起著不著想，於四正斷、四神足、五根、五力、七等覺支、八聖道支不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment in the four abodes of mindfulness and doesn't give rise to thoughts of attachment or non-attachment in the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven",
        "source": "T06n0220_291:0478c06_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c09_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c09_3"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於空解脫門不起著不著想，於無相、無願解脫門不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment in the liberation gate of emptiness, and they don't give rise to thoughts of attachment or non-attachment in the liberation gate of signlessness or wishlessness.",
        "source": "T06n0220_291:0478c09_4"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c12_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c12_6"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於菩薩十地不起著不著想，是行般若波羅蜜多。",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of prajñāpāramitā, they don't give rise to thoughts of attachment or non-attachment in the bodhisattva's ten stages, which is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c12_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c15_0"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於五眼不起著不著想，於六神通不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment in the five eyes and doesn't give rise to thoughts of attachment or non-attachment in the six supernormal powers.",
        "source": "T06n0220_291:0478c15_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c17_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c17_3"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於佛十力不起著不著想，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment to the Buddha's ten powers and doesn't give rise to thoughts of attachment or non-attachment to the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great pity, great",
        "source": "T06n0220_291:0478c17_4"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c20_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c21_6"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於無忘失法不起著不著想，於恒住捨性不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment to the principle of nonforgetfulness, and they don't give rise to thoughts of attachment or non-attachment to the nature of constancy and equanimity.",
        "source": "T06n0220_291:0478c21_7"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c23_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c24_9"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於一切智不起著不著想，於道相智、一切相智不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment to omniscience, and they don't give rise to thoughts of attachment or non-attachment to knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_291:0478c24_10"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c26_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0478c27_12"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於一切陀羅尼門不起著不著想，於一切三摩地門不起著不著想，",
        "translation": "When the bodhisattva Mahāsattva thus practices the perfection of wisdom, he doesn't give rise to thoughts of attachment or non-attachment in all dhāraṇī teachings and doesn't give rise to thoughts of attachment or non-attachment in all samādhi teachings.",
        "source": "T06n0220_291:0478c27_13"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0478c29_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0479a02_0"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於預流果不起著不著想，於一來、不還、阿羅漢果不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or non-attachment to the fruit of pre-flow, and they don't give rise to thoughts of attachment or non-attachment to the fruit of once-returning, non-returning, or arhatship.",
        "source": "T06n0220_291:0479a02_1"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0479a04_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0479a04_3"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於獨覺菩提不起著不著想，是行般若波羅蜜多。",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of prajñāpāramitā, they don't give rise to thoughts of attachment or non-attachment to solitary realizer enlightenment, which is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0479a05_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0479a07_5"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於一切菩薩摩訶薩行不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don’t give rise to thoughts of attachment or non-attachment in all their bodhisattva practices.",
        "source": "T06n0220_291:0479a07_6"
    },
    {
        "source_sentence": "是行般若波羅蜜多。",
        "translation": "This is the practice of the perfection of prajñāpāramitā.",
        "source": "T06n0220_291:0479a08_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0479a09_8"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行般若波羅蜜多時，於諸佛無上正等菩提不起著不著想，",
        "translation": "When bodhisattvas and mahāsattvas thus practice the perfection of wisdom, they don't give rise to thoughts of attachment or attachment to the unsurpassed perfect enlightenment of the buddhas.",
        "source": "T06n0220_291:0479a09_9"
    },
    {
        "source_sentence": "是行般若波羅蜜多。」",
        "translation": "This is the practice of prajñāpāramitā.",
        "source": "T06n0220_291:0479a11_10"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「甚奇！",
        "translation": "It was then that Gosshou Shancheng said to the Buddha, Marvelous!",
        "source": "T06n0220_291:0479a12_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479a12_1"
    },
    {
        "source_sentence": "如是般若波羅蜜多甚深法性，若說若不說，俱不增不減。」",
        "translation": "Thus, the profound Dharma nature of the prajñāpāramitā is so profound that whether it's explained or not, neither increases nor decreases.",
        "source": "T06n0220_291:0479a12_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_291:0479a14_3"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_291:0479a14_4"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_291:0479a14_5"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_291:0479a14_6"
    },
    {
        "source_sentence": "如是般若波羅蜜多甚深法性，若說不說俱無增減。",
        "translation": "Thus, the profound Dharma nature of the prajñāpāramitā is so profound that if it's explained and not explained, there's neither increase nor decrease.",
        "source": "T06n0220_291:0479a14_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0479a16_0"
    },
    {
        "source_sentence": "假使如來、應、正等覺，盡其壽住讚毀虛空，而彼虛空無增無減，如是般若波羅蜜多甚深法性亦復如是，",
        "translation": "Suppose the Tathāgata, Arhat, Perfectly Enlightened One were to praise space for the rest of his lifetime and then that space neither increases nor decreases, and so would the profound Dharma nature of the profound prajñāpāramitā be likewise.",
        "source": "T06n0220_291:0479a16_1"
    },
    {
        "source_sentence": "若讚若毀不增不減。",
        "translation": "Whether praised or disparaged, it doesn't increase or decrease.",
        "source": "T06n0220_291:0479a18_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_291:0479a18_3"
    },
    {
        "source_sentence": "譬如幻士於毀讚時不減不增、無憂無喜，如是般若波羅蜜多甚深法性亦復如是，",
        "translation": "Just as when an illusionist disparages someone, he doesn't decrease or increase, has no sorrow or joy, and so is the profound Dharma nature of the prajñāpāramitā likewise.",
        "source": "T06n0220_291:0479a19_4"
    },
    {
        "source_sentence": "若說不說如本無異。」",
        "translation": "If it's explained and not explained as before, there's no difference.",
        "source": "T06n0220_291:0479a20_5"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_291:0479a21_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多甚為難事，謂此般若波羅蜜多，若修不修無增無減亦無向背，",
        "translation": "It's very difficult for bodhisattvas and mahāsattvas to cultivate the perfection of wisdom, meaning that these perfections of wisdom are cultivated or not cultivated, neither increased nor diminished, nor directed backwards.",
        "source": "T06n0220_291:0479a22_0"
    },
    {
        "source_sentence": "而勤修學如是般若波羅蜜多，乃至無上正等菩提曾無退轉。",
        "translation": "They diligently cultivate the perfection of prajñāpāramitā like this, up to unsurpassed perfect enlightenment without ever regressing.",
        "source": "T06n0220_291:0479a24_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_291:0479a25_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479a25_3"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多，如修虛空都無所有。",
        "translation": "The bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, just as they cultivate space that has no existence.",
        "source": "T06n0220_291:0479a26_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479a27_1"
    },
    {
        "source_sentence": "如虛空中，無色可施設，無受、想、行、識可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no form to define and no sensation, perception, volition, or consciousness to define, so it is with the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0479a27_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479a29_3"
    },
    {
        "source_sentence": "如虛空中，無眼處可施設，無耳、鼻、舌、身、意處可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no place for the eye to define and no place for the ear, nose, tongue, body, or mind to define, so it is with the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0479a29_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b02_5"
    },
    {
        "source_sentence": "如虛空中，無色處可施設，無聲、香、味、觸、法處可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no form that can be defined and no sound, odor, taste, touch, or dharma that can be defined, so too does the prajñāpāramitā cultivated likewise.",
        "source": "T06n0220_291:0479b02_6"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b04_7"
    },
    {
        "source_sentence": "如虛空中，無眼界可施設，無色界、眼識界及眼觸、眼觸為緣所生諸受可施設，",
        "translation": "Just as space has no eye realm to define, the formless realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as perceptual objects can be defined.",
        "source": "T06n0220_291:0479b04_8"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b06_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b06_10"
    },
    {
        "source_sentence": "如虛空中，無耳界可施設，無聲界、耳識界及耳觸、耳觸為緣所生諸受可施設，",
        "translation": "Just as space has no ear realm that can be defined, sound realm, ear consciousness realm, and sensations that arise from ear contact and ear contact as objects cannot be defined.",
        "source": "T06n0220_291:0479b07_11"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b08_12"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b09_13"
    },
    {
        "source_sentence": "如虛空中，無鼻界可施設，無香界、鼻識界及鼻觸、鼻觸為緣所生諸受可施設，",
        "translation": "Just as space has no nasal sense element that can be defined, there is no sense element of fragrance, no sense element of the consciousness of the nose, and no sensations that arise from nasal contact or nasal contact as supporting object.",
        "source": "T06n0220_291:0479b09_14"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b11_15"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b12_16"
    },
    {
        "source_sentence": "如虛空中，無舌界可施設，無味界、舌識界及舌觸、舌觸為緣所生諸受可施設，",
        "translation": "Just as space is devoid of the realm of tongue, which can be defined, but there is no taste realm, the realm of tongue consciousness, or the sensations that arise from tongue contact and tongue contact as supporting object.",
        "source": "T06n0220_291:0479b12_17"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b14_18"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b14_19"
    },
    {
        "source_sentence": "如虛空中，無身界可施設，無觸界、身識界及身觸、身觸為緣所生諸受可施設，",
        "translation": "Just as space has no body realm to define, there is no contact realm, body consciousness realm, or sensations that arise from bodily contact and bodily contact as an object.",
        "source": "T06n0220_291:0479b14_20"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b16_21"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b17_22"
    },
    {
        "source_sentence": "如虛空中，無意界可施設，無法界、意識界及意觸、意觸為緣所生諸受可施設，",
        "translation": "Just as space has no realm of thought to define, the realm of nonexistence, the realm of consciousness of the mind, and the sensations that arise from mental contact and mental contact as supporting conditions can be defined.",
        "source": "T06n0220_291:0479b17_23"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b19_24"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b20_25"
    },
    {
        "source_sentence": "如虛空中，無地界可施設，無水、火、風、空、識界可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no earth realm to define and no water, fire, wind, air, space, or consciousness realms to define, so it is with the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0479b20_26"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b22_27"
    },
    {
        "source_sentence": "如虛空中，無無明可施設，無行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱可施設，",
        "translation": "Just as space has no nescience that can be defined, and there are no conditioned phenomena, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, vexation, grief, or vexation that can be defined.",
        "source": "T06n0220_291:0479b22_28"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b24_29"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b25_0"
    },
    {
        "source_sentence": "如虛空中，無布施波羅蜜多可施設，無淨戒、安忍、精進、靜慮、般若波羅蜜多可施設，",
        "translation": "Like space, there are no perfections of generosity that can be defined, and there are no perfections of pure morality, patience, effort, meditation, or wisdom that can be defined.",
        "source": "T06n0220_291:0479b25_1"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479b27_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479b27_3"
    },
    {
        "source_sentence": "如虛空中，無內空可施設，無外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空可施設，",
        "translation": "Just as space has no internal emptiness to define, and no external emptiness, no internal or external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature, emptiness of shared characteristic",
        "source": "T06n0220_291:0479b27_4"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479c03_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c03_6"
    },
    {
        "source_sentence": "如虛空中，無真如可施設，無法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界可施設，",
        "translation": "Just as space has no true reality to define, the realm of nonexistence, the nature of dharmas, the nature of non-falsity, the unchanging and dissimilar nature, equality, freedom from birth, the law, the abiding of dharmas, the Dharma, the reality, the realm of space, or the inconceivable realm can be defined.",
        "source": "T06n0220_291:0479c03_7"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479c06_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c07_9"
    },
    {
        "source_sentence": "如虛空中，無苦聖諦可施設，無集、滅、道聖諦可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no no no noble truth of suffering to define, and no no noble truths of arising, ceasing, or the path to define, so it is with the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0479c07_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c09_11"
    },
    {
        "source_sentence": "如虛空中，無四靜慮可施設，無四無量、四無色定可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no four meditations to define and no four immeasurable and four formless concentrations to define, so it is with the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0479c09_12"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c11_13"
    },
    {
        "source_sentence": "如虛空中，無八解脫可施設，無八勝處、九次第定、十遍處可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no eight liberations to define and no eight abodes of excellence, nine graduated concentrations, or ten universal abodes to define, so too does the prajñāpāramitā cultivated likewise.",
        "source": "T06n0220_291:0479c11_14"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c13_15"
    },
    {
        "source_sentence": "如虛空中，無四念住可施設，無四正斷、四神足、五根、五力、七等覺支、八聖道支可施設，",
        "translation": "Like space, there are no four abodes of mindfulness that can be defined, and there are no four correct eliminations, four miraculous powers, five faculties, five powers, seven factors of virtual enlightenment, or eight noble factors of the path that can be defined.",
        "source": "T06n0220_291:0479c13_16"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479c15_17"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c16_18"
    },
    {
        "source_sentence": "如虛空中，無空解脫門可施設，無無相、無願解脫門可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no liberation through the gate of emptiness that can be defined, and no liberation through signlessness or wishlessness that can be defined, so too does the prajñāpāramitā cultivated likewise.",
        "source": "T06n0220_291:0479c16_19"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c18_20"
    },
    {
        "source_sentence": "如虛空中，無菩薩十地可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as in space there are no bodhisattvas whose ten stages can be defined, so too is the prajñāpāramitā cultivated.",
        "source": "T06n0220_291:0479c18_21"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c21_0"
    },
    {
        "source_sentence": "如虛空中，無五眼可施設，無六神通可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no five eyes to define and no six supernormal powers to define, so it is with the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0479c21_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c22_2"
    },
    {
        "source_sentence": "如虛空中，無佛十力可施設，無四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法可施設，",
        "translation": "Like space, there are no buddhas whose ten powers can be defined, and there are no four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, or the 18 unique qualities of buddhahood that can be defined.",
        "source": "T06n0220_291:0479c23_0"
    },
    {
        "source_sentence": "所修般若波羅蜜多亦復如是。",
        "translation": "The prajñāpāramitā that's cultivated is likewise.",
        "source": "T06n0220_291:0479c25_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c25_2"
    },
    {
        "source_sentence": "如虛空中，無無忘失法可施設，無恒住捨性可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no dharmas that are without forgetfulness to define and no eternally abiding equanimity to define, so too does the prajñāpāramitā cultivated likewise.",
        "source": "T06n0220_291:0479c26_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0479c27_1"
    },
    {
        "source_sentence": "如虛空中，無一切智可施設，無道相智、一切相智可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no omniscience that can be defined, and there's no knowledge of the path or omniscience that can be defined, so too is the prajñāpāramitā cultivated.",
        "source": "T06n0220_291:0479c28_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a01_0"
    },
    {
        "source_sentence": "如虛空中，無一切陀羅尼門可施設，無一切三摩地門可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as in space, there are no dhāraṇī approaches to be defined and no samādhi approaches to be defined, so too is the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0480a01_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a04_0"
    },
    {
        "source_sentence": "如虛空中，無預流果可施設，無一來、不還、阿羅漢果可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space has no pre-flow fruit that can be defined, and there's no single coming, nonreturning, or arhat fruit that can be defined, so too does the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0480a04_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a06_2"
    },
    {
        "source_sentence": "如虛空中，無獨覺菩提可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as in space, there's no self-realized enlightenment to be defined, so is the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0480a06_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a07_4"
    },
    {
        "source_sentence": "如虛空中，無一切菩薩摩訶薩行可施設，所修般若波羅蜜多亦復如是。",
        "translation": "Just as space is devoid of all the bodhisattva-mahāsattva practices that can be defined, so too is the prajñāpāramitā cultivated.",
        "source": "T06n0220_291:0480a08_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a09_1"
    },
    {
        "source_sentence": "如虛空中，無諸佛無上正等菩提可施設，所修般若波羅蜜多亦復如是。」",
        "translation": "Just as in space, there are no buddhas whose unsurpassed perfect enlightenment can be defined, so too is the prajñāpāramitā that's cultivated.",
        "source": "T06n0220_291:0480a09_2"
    },
    {
        "source_sentence": "爾時，具壽善現復白佛言：「世尊！",
        "translation": "It was then that Guoshou Shancheng again said to the Buddha, Bhagavān!",
        "source": "T06n0220_291:0480a12_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩能擐如是大功德鎧，我等有情皆應敬禮。",
        "translation": "Because this bodhisattva Mahāsattva can fold such a great armor of merit, we sentient beings should venerate it.",
        "source": "T06n0220_291:0480a12_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a14_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩為諸有情擐功德鎧勤精進者，如為虛空擐功德鎧發勤精進。",
        "translation": "If a bodhisattva-mahāsattva diligently exerts effort for the sake of sentient beings armed with the armor of compassion and merit, he'll give rise to diligent effort for the sake of the armor of compassion and merit armed with the armor of space.",
        "source": "T06n0220_291:0480a14_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a15_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩為欲成熟解脫有情擐功德鎧勤精進者，如為虛空成熟解脫擐功德鎧發勤精進。",
        "translation": "If a bodhisattva-mahāsattva armed with the armor of compassion for the sake of liberating sentient beings who want to ripen them, it's like arming with the armor of compassion for the merit of liberation in space and initiating diligent effort.",
        "source": "T06n0220_291:0480a16_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a18_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩為一切法擐大功德鎧勤精進者，如為虛空擐大功德鎧發勤精進。",
        "translation": "If a bodhisattva-mahāsattva diligently undertakes the armor of great merit for all dharmas, it's as if he were to undertake the armor of great merit for space.",
        "source": "T06n0220_291:0480a18_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a20_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩為拔有情令出生死擐功德鎧勤精進者，如為舉虛空置高勝處擐大功德鎧發勤精進。",
        "translation": "If a bodhisattva-mahāsattva diligently exerts the armor of great merit to remove sentient beings and cause them to escape birth and death, it's like holding up space and placing it high in a superior place to produce the armor of great merit that arouses diligence.",
        "source": "T06n0220_291:0480a20_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a22_5"
    },
    {
        "source_sentence": "菩薩摩訶薩得大精進波羅蜜多，為如虛空諸有情類速脫生死發趣無上正等菩提。",
        "translation": "The bodhisattva Mahāsattva attains the great perfection of effort because he quickly liberates sentient beings like space from birth and death and sets out for unsurpassed perfect enlightenment.",
        "source": "T06n0220_291:0480a22_6"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a24_7"
    },
    {
        "source_sentence": "菩薩摩訶薩得不思議無等神力，為如虛空諸法性海擐大功德鎧發趣無上正等菩提。",
        "translation": "The bodhisattva Mahāsattva attains inconceivable peerless supernormal powers and sets out for unsurpassed perfect enlightenment with the armor of great merit like the ocean of dharmas-natures that are like space.",
        "source": "T06n0220_291:0480a25_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a27_0"
    },
    {
        "source_sentence": "菩薩摩訶薩最極勇健，為如虛空諸佛無上正等菩提擐功德鎧發勤精進。",
        "translation": "The most courageous of the bodhisattvas and mahāsattvas is to arouse diligent effort for the sake of the unsurpassed, correct, and complete enlightenment of the buddhas as vast as space.",
        "source": "T06n0220_291:0480a27_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480a28_2"
    },
    {
        "source_sentence": "菩薩摩訶薩為如虛空諸有情類勤修苦行，欲證無上正等菩提，甚為希有。",
        "translation": "The bodhisattva Mahāsattva diligently cultivates ascetic practices for sentient beings like space and wants to realize unsurpassed perfect enlightenment, which is very rare.",
        "source": "T06n0220_291:0480a29_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_291:0480b01_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480b01_2"
    },
    {
        "source_sentence": "假使三千大千世界滿中如來、應、正等覺如竹、麻、[竺-二+韋]、甘&#;等林，",
        "translation": "Suppose 3,000 great one-thousand worlds were filled with buddhas, arhats, and fully enlightened ones like bamboo, hemp, [Zhu-ji+Wei], ambrosia, and other forests.",
        "source": "T06n0220_291:0480b02_3"
    },
    {
        "source_sentence": "若經一劫或一劫餘，為諸有情常說正法，各度無量無邊有情令入涅槃究竟安樂，",
        "translation": "In the course of one aeon or more, they always taught the true teaching to sentient beings. Each liberated measureless and boundless sentient beings so that they entered nirvana with ultimate peace and happiness.",
        "source": "T06n0220_291:0480b03_4"
    },
    {
        "source_sentence": "而有情界不增不減。",
        "translation": "The realm of sentient beings doesn't increase or decrease.",
        "source": "T06n0220_291:0480b05_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_291:0480b05_6"
    },
    {
        "source_sentence": "以諸有情皆無所有，性遠離故。",
        "translation": "It's because all sentient beings lack existence, which is inherently isolated.",
        "source": "T06n0220_291:0480b06_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480b06_8"
    },
    {
        "source_sentence": "假使十方各如殑伽沙數世界滿中如來、應、正等覺如竹、麻、[竺-二+韋]、甘&#;等林，",
        "translation": "Suppose the buddhas, arhats, and fully enlightened ones in each of the ten directions were to fill as many worlds as there are sands in the Ganges like bamboo, hemp, [Zhu-ji+Wei], ambrosia, and other forests.",
        "source": "T06n0220_291:0480b07_0"
    },
    {
        "source_sentence": "若經一劫或一劫餘為諸有情常說正法，各度無量無邊有情令入涅槃究竟安樂，",
        "translation": "In the course of one aeon or more, they always taught the true teaching to sentient beings. Each liberated measureless and boundless sentient beings so that they entered nirvana with ultimate peace and happiness.",
        "source": "T06n0220_291:0480b08_1"
    },
    {
        "source_sentence": "而有情界不增不減。",
        "translation": "The realm of sentient beings doesn't increase or decrease.",
        "source": "T06n0220_291:0480b10_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_291:0480b11_0"
    },
    {
        "source_sentence": "以諸有情皆無所有，性遠離故。",
        "translation": "It's because all sentient beings lack existence, which is inherently isolated.",
        "source": "T06n0220_291:0480b11_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480b11_2"
    },
    {
        "source_sentence": "假使十方一切世界滿中如來、應、正等覺如竹、麻、[竺-二+韋]、甘&#;等林，",
        "translation": "Suppose all the worlds in the ten directions were filled with buddhas, arhats, and fully awakened ones like bamboo, hemp, [Zhu-ji+Wei], sugarcane, and so forth.",
        "source": "T06n0220_291:0480b12_3"
    },
    {
        "source_sentence": "若經一劫或一劫餘為諸有情常說正法，各度無量無邊有情令入涅槃究竟安樂，",
        "translation": "In the course of one aeon or more, they always taught the true teaching to sentient beings. Each liberated measureless and boundless sentient beings so that they entered nirvana with ultimate peace and happiness.",
        "source": "T06n0220_291:0480b13_4"
    },
    {
        "source_sentence": "而有情界不增不減。",
        "translation": "The realm of sentient beings doesn't increase or decrease.",
        "source": "T06n0220_291:0480b15_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_291:0480b15_6"
    },
    {
        "source_sentence": "以諸有情皆無所有，性遠離故。",
        "translation": "It's because all sentient beings lack existence, which is inherently isolated.",
        "source": "T06n0220_291:0480b16_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T06n0220_291:0480b16_8"
    },
    {
        "source_sentence": "由是因緣我作是說：菩薩摩訶薩為如虛空諸有情類成熟解脫勤修苦行，",
        "translation": "Because of these causes and conditions, I make this proclamation:",
        "source": "T06n0220_291:0480b17_0"
    },
    {
        "source_sentence": "欲證無上正等菩提，甚為希有。」",
        "translation": "It's rare to want to realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_291:0480b18_1"
    },
    {
        "source_sentence": "爾時，會中有一苾芻竊作是念：「我應敬禮甚深般若波羅蜜多，此中雖無諸法生滅，",
        "translation": "At the time, there was a monk in the assembly who secretly thought, I should venerate the profound prajñāpāramitā, even though there are no dharmas that arise or cease here.",
        "source": "T06n0220_291:0480b19_2"
    },
    {
        "source_sentence": "而有戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊施設可得，亦有預流果、一來果、不還果、阿羅漢果施設可得，",
        "translation": "Instead, it is possible to define the aggregate of morality, the aggregate of meditation, the aggregate of wisdom, the aggregate of liberation, and the aggregate of knowledge and vision of liberation. It is also possible to define the fruit of stream-entry, the fruit of once-returning, the fruit of nonreturning, and the fruit of arhatship.",
        "source": "T06n0220_291:0480b21_3"
    },
    {
        "source_sentence": "亦有獨覺菩提施設可得，亦有無上正等菩提施設可得，亦有佛、法、僧寶施設可得，",
        "translation": "There are also designations that can be found for the enlightenment of the self-enlightened one, for the supreme perfect enlightenment, and for the treasures of Buddha, Dharma, and Sangha.",
        "source": "T06n0220_291:0480b23_4"
    },
    {
        "source_sentence": "亦有轉妙法輪度有情類施設可得。」",
        "translation": "There are also ways to turn the wonderful wheel of the Dharma and save sentient beings that can be defined.",
        "source": "T06n0220_291:0480b25_5"
    },
    {
        "source_sentence": "佛知其念告言：「苾芻！",
        "translation": "Knowing this thought, the Buddha told him, Monk!",
        "source": "T06n0220_291:0480b26_6"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_291:0480b26_7"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T06n0220_291:0480b27_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多微妙難測。」",
        "translation": "The profound prajñāpāramitā is subtle and difficult to fathom.",
        "source": "T06n0220_291:0480b27_1"
    },
    {
        "source_sentence": "爾時，天帝釋問具壽善現言：「大德！",
        "translation": "It was then that Śakra Devānām-Indra asked the long-lived good manifestation, saying, Mañjuśrī!",
        "source": "T06n0220_291:0480b28_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲學甚深般若波羅蜜多，當如何學？」",
        "translation": "If a bodhisattva-mahāsattva wants to train in the profound perfection of wisdom, how should he train?",
        "source": "T06n0220_291:0480b28_1"
    },
    {
        "source_sentence": "善現答言：「憍尸迦！",
        "translation": "Sunetra replied, Kauśika!",
        "source": "T06n0220_291:0480b29_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲學甚深般若波羅蜜多，當如虛空學。」",
        "translation": "If bodhisattvas, mahāsattvas, want to train in the profound perfection of wisdom, they should train like space.",
        "source": "T06n0220_291:0480c01_3"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「世尊！",
        "translation": "Śakra then again said to the Buddha, Bhagavān!",
        "source": "T06n0220_291:0480c02_4"
    },
    {
        "source_sentence": "若善男子、善女人等於此所說甚深般若波羅蜜多，受持、讀誦、如理思惟、為他演說，",
        "translation": "“Good sons and good daughters, these profound teachings of the perfection of wisdom are upheld, recited, correctly contemplated, and taught for others.",
        "source": "T06n0220_291:0480c03_5"
    },
    {
        "source_sentence": "我當云何而為守護？",
        "translation": "How should I guard it?",
        "source": "T06n0220_291:0480c05_6"
    },
    {
        "source_sentence": "唯願世尊垂哀示教！」",
        "translation": "Please, Bhagavān, have mercy on me and show me the teaching!",
        "source": "T06n0220_291:0480c05_7"
    },
    {
        "source_sentence": "爾時，具壽善現謂天帝釋言：「憍尸迦！",
        "translation": "It was then that the long-lived good manifestation said to Śakra Devānām-Indra, Kauśika!",
        "source": "T06n0220_291:0480c07_0"
    },
    {
        "source_sentence": "汝見有法可守護不？」",
        "translation": "Do you see a teaching that can be guarded?",
        "source": "T06n0220_291:0480c07_1"
    },
    {
        "source_sentence": "天帝釋言：「不也！",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T06n0220_291:0480c08_2"
    },
    {
        "source_sentence": "大德！",
        "translation": "O great virtuous one!",
        "source": "T06n0220_291:0480c08_3"
    },
    {
        "source_sentence": "我不見法是可守護。」",
        "translation": "I don't see that the Dharma is something to guard.",
        "source": "T06n0220_291:0480c08_4"
    },
    {
        "source_sentence": "善現言：「憍尸迦！",
        "translation": "The good manifestation said, Kauśika!",
        "source": "T06n0220_291:0480c09_5"
    },
    {
        "source_sentence": "若善男子、善女人等，住如所說甚深般若波羅蜜多，即為守護。",
        "translation": "If good men and good women abide in the profound prajñāpāramitā as explained, they'll be guarded.",
        "source": "T06n0220_291:0480c09_6"
    },
    {
        "source_sentence": "若善男子、善女人等，住如所說甚深般若波羅蜜多常不遠離，當知一切人非人等伺求其便欲為損害終不能得。",
        "translation": "If good men and good women abide in the profound prajñāpāramitā that's explained as it is, and they always don't part from it, you should know that all people and non-people who seek it will never attain it because they want to harm it.",
        "source": "T06n0220_291:0480c11_7"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0480c13_8"
    },
    {
        "source_sentence": "若欲守護住如所說甚深般若波羅蜜多諸菩薩者，無異為欲守護虛空。",
        "translation": "Those bodhisattvas who want to guard and abide in the profound prajñāpāramitā as explained are no different than those who want to guard space.",
        "source": "T06n0220_291:0480c13_9"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0480c15_10"
    },
    {
        "source_sentence": "若欲守護修行般若波羅蜜多諸菩薩者，唐設劬勞都無所益。",
        "translation": "If someone wants to guard and cultivate the bodhisattvas who practice the perfection of wisdom, they'll be unworthy of the trouble in the Tang.",
        "source": "T06n0220_291:0480c15_11"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0480c17_12"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_291:0480c17_13"
    },
    {
        "source_sentence": "有能守護幻、夢、響、像、陽焰、光影及變化事、尋香城不？」",
        "translation": "Is there someone who can guard the illusory, dreamlike, sound, image, miraculous, miraculous, miraculous, and fragrant cities?",
        "source": "T06n0220_291:0480c17_14"
    },
    {
        "source_sentence": "天帝釋言：「不也！",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T06n0220_291:0480c18_15"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T06n0220_291:0480c19_16"
    },
    {
        "source_sentence": "善現言：「憍尸迦！",
        "translation": "The good manifestation said, Kauśika!",
        "source": "T06n0220_291:0480c19_17"
    },
    {
        "source_sentence": "若欲守護修行般若波羅蜜多諸菩薩者亦復如是，唐設劬勞都無所益。",
        "translation": "If someone wants to guard and cultivate the bodhisattvas who practice the perfection of wisdom, they're likewise, and their effort is useless.",
        "source": "T06n0220_291:0480c19_18"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0480c21_19"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_291:0480c21_20"
    },
    {
        "source_sentence": "有能守護一切如來、應、正等覺及佛所作變化事不？」",
        "translation": "Is there anyone who can guard all the transformations that the Tathāgata, Arhat, Perfectly Enlightened One, and the Buddha do?",
        "source": "T06n0220_291:0480c21_21"
    },
    {
        "source_sentence": "天帝釋言：「不也！",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T06n0220_291:0480c22_22"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T06n0220_291:0480c23_23"
    },
    {
        "source_sentence": "善現言：「憍尸迦！",
        "translation": "The good manifestation said, Kauśika!",
        "source": "T06n0220_291:0480c23_24"
    },
    {
        "source_sentence": "若欲守護修行般若波羅蜜多諸菩薩者亦復如是，唐設劬勞都無所益。",
        "translation": "If someone wants to guard and cultivate the bodhisattvas who practice the perfection of wisdom, they're likewise, and their effort is useless.",
        "source": "T06n0220_291:0480c23_25"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0480c25_26"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T06n0220_291:0480c25_27"
    },
    {
        "source_sentence": "有能守護真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界不？」",
        "translation": "Is there someone who can guard the true nature, the Dharma realm, the Dharma nature, the non-falsity, the unchanging and dissimilar nature, the equality, the freedom from arising, the legality, the Dharma abiding, the reality, the space realm, or the inconceivable realm?",
        "source": "T06n0220_291:0480c25_28"
    },
    {
        "source_sentence": "天帝釋言：「不也！",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T06n0220_291:0480c28_0"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T06n0220_291:0480c28_1"
    },
    {
        "source_sentence": "善現言：「憍尸迦！",
        "translation": "The good manifestation said, Kauśika!",
        "source": "T06n0220_291:0480c28_2"
    },
    {
        "source_sentence": "若欲守護修行般若波羅蜜多諸菩薩者亦復如是，唐設劬勞都無所益。」",
        "translation": "If someone wants to guard and cultivate the bodhisattvas who practice the perfection of wisdom, they're likewise, and it's useless to create trouble in the Tang.",
        "source": "T06n0220_291:0480c28_3"
    },
    {
        "source_sentence": "爾時，天帝釋問具壽善現言：「大德！",
        "translation": "It was then that Śakra Devānām-Indra asked the long-lived good manifestation, saying, Mañjuśrī!",
        "source": "T06n0220_291:0481a02_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻、如夢、如響、如像、如陽焰、如光影、如變化事、如尋香城，",
        "translation": "How does the bodhisattva Mahāsattva cultivate the perfection of wisdom, knowing all things are like illusions, dreams, echoes, images, mirages, flames, lights, shadows, magic tricks, and fragrant cities?",
        "source": "T06n0220_291:0481a02_1"
    },
    {
        "source_sentence": "而是菩薩摩訶薩，不執是幻、是夢、是響、是像、是陽焰、是光影、是變化事、是尋香城，",
        "translation": "Rather, the bodhisattva Mahāsattva should not believe that it is an illusion, a dream, an echo, an image, a mirage, a flame, a reflection, a magical emanation, or a fragrant city.",
        "source": "T06n0220_291:0481a05_2"
    },
    {
        "source_sentence": "亦不執由幻、由夢、由響由像、由陽焰、由光影、由變化事、由尋香城，",
        "translation": "Nor does he believe that it is due to magical illusions, dreams, echoes, images, miraculous flames, lights and shadows, magical manifestations, or the perception of fragrant cities.",
        "source": "T06n0220_291:0481a06_3"
    },
    {
        "source_sentence": "亦不執屬幻、屬夢、屬響、屬像、屬陽焰、屬光影、屬變化事、屬尋香城，",
        "translation": "Nor does he cling to illusions, dreams, echoes, images, mirages, lights, shadows, magic tricks, or fragrant cities.",
        "source": "T06n0220_291:0481a08_4"
    },
    {
        "source_sentence": "亦不執依幻、依夢、依響、依像、依陽焰、依光影、依變化事、依尋香城？」",
        "translation": "Nor do they cling to illusions, dreams, sounds, images, mirages, miraculous manifestations, and fragrant cities?",
        "source": "T06n0220_291:0481a09_5"
    },
    {
        "source_sentence": "善現答言：「憍尸迦！",
        "translation": "Sunetra replied, Kauśika!",
        "source": "T06n0220_291:0481a11_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是色，是受、想、行、識；",
        "translation": "If great enlightening beings practice the perfection of wisdom and do not cling to form, it is sensation, perception, volition, and consciousness.",
        "source": "T06n0220_291:0481a11_7"
    },
    {
        "source_sentence": "亦不執由色，由受、想、行、識；",
        "translation": "Nor does he believe that form is the cause of sensation, perception, volition, and consciousness.",
        "source": "T06n0220_291:0481a13_8"
    },
    {
        "source_sentence": "亦不執屬色，屬受、想、行、識；",
        "translation": "Nor do they hold that form belongs to sensation, perception, volition, and consciousness.",
        "source": "T06n0220_291:0481a13_9"
    },
    {
        "source_sentence": "亦不執依色，依受、想、行、識。",
        "translation": "Nor does he cling to form as the basis, feeling, perception, volition, and consciousness as the basis.",
        "source": "T06n0220_291:0481a14_10"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481a14_11"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481a17_0"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481a18_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是眼處，是耳、鼻、舌、身、意處；",
        "translation": "“If great enlightening beings cultivate the perfection of wisdom, they do not cling to the sense base of the eye as the locus of the eye; they are in charge of the ear, nose, nose, tongue, body, and mind.",
        "source": "T06n0220_291:0481a19_2"
    },
    {
        "source_sentence": "亦不執由眼處，由耳、鼻、舌、身、意處；",
        "translation": "Nor do they hold that it is by reason of the organ of sight or by reason of the organs of hearing, smell, taste, touch, body, and thought.",
        "source": "T06n0220_291:0481a20_3"
    },
    {
        "source_sentence": "亦不執屬眼處，屬耳、鼻、舌、身、意處；",
        "translation": "Nor do they believe that it belongs to the organ of sight, but rather to the organs of hearing, smell, taste, touch, and thought.",
        "source": "T06n0220_291:0481a21_4"
    },
    {
        "source_sentence": "亦不執依眼處，依耳、鼻、舌、身、意處。",
        "translation": "Nor does he cling to the sense base of the eye, which relies on the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_291:0481a22_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481a22_6"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481a25_7"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481a27_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是色處，是聲、香、味、觸、法處；",
        "translation": "“If great enlightening beings cultivate the perfection of wisdom, they do not cling to the form realm as sound, odor, taste, touch, or dharmas.",
        "source": "T06n0220_291:0481a27_9"
    },
    {
        "source_sentence": "亦不執由色處，由聲、香、味、觸、法處；",
        "translation": "Nor do they hold that it is by reason of the sphere of form or by reason of the sphere of sound, smell, taste, touch, or dharma.",
        "source": "T06n0220_291:0481a28_10"
    },
    {
        "source_sentence": "亦不執屬色處，屬聲、香、味、觸、法處；",
        "translation": "Nor do they hold that it belongs to the sphere of form, but rather to the sphere of sound, odor, taste, touch and dharmas.",
        "source": "T06n0220_291:0481a29_11"
    },
    {
        "source_sentence": "亦不執依色處，依聲、香、味、觸、法處。",
        "translation": "Nor does he cling to the form realm as basis, or to the sound, smell, taste, touch, or dharma realms as basis.",
        "source": "T06n0220_291:0481b01_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481b02_13"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481b04_14"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481b06_15"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是眼界，是色界、眼識界及眼觸、眼觸為緣所生諸受；",
        "translation": "“If great enlightening beings practice the perfection of wisdom, they do not cling to the eye realm as the eye realm. They think it is the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as supporting conditions.",
        "source": "T06n0220_291:0481b06_16"
    },
    {
        "source_sentence": "亦不執由眼界，由色界乃至眼觸為緣所生諸受；",
        "translation": "Nor do they believe that it is because of the eye realm that sensations arise by reason of the form realm, up to and including visual contact as supporting object.",
        "source": "T06n0220_291:0481b08_17"
    },
    {
        "source_sentence": "亦不執屬眼界，屬色界乃至眼觸為緣所生諸受；",
        "translation": "They also do not believe that it belongs to the eye realm. It belongs to the material realm, up to all sensations that arise by reason of visual contact.",
        "source": "T06n0220_291:0481b09_18"
    },
    {
        "source_sentence": "亦不執依眼界，依色界乃至眼觸為緣所生諸受。",
        "translation": "Nor does he cling to sensations that arise by relying on the eye realm, form realm, or even sensations that arise by relying on visual contact as a condition.",
        "source": "T06n0220_291:0481b10_19"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481b11_20"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481b13_21"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481b15_22"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是耳界，是聲界、耳識界及耳觸、耳觸為緣所生諸受；",
        "translation": "“If great enlightening beings cultivate the perfection of wisdom, they do not cling to the ear realm as an ear: it is the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as supporting object.",
        "source": "T06n0220_291:0481b16_23"
    },
    {
        "source_sentence": "亦不執由耳界，由聲界乃至耳觸為緣所生諸受；",
        "translation": "Nor do they hold that sensation is due to the sense organ of hearing, and that it is due to the sound realm or even to the sensations produced by ear contact as a condition.",
        "source": "T06n0220_291:0481b18_24"
    },
    {
        "source_sentence": "亦不執屬耳界，屬聲界乃至耳觸為緣所生諸受；",
        "translation": "They do not believe that it belongs to the sense element of hearing. It belongs to the realm of sound, up to all sensations that arise from ear contact as supporting object.",
        "source": "T06n0220_291:0481b19_25"
    },
    {
        "source_sentence": "亦不執依耳界，依聲界乃至耳觸為緣所生諸受。",
        "translation": "Nor does it hold that sensations arise by relying on the ear realm, sound realm, or even sensations that arise by relying on ear contact as a condition.",
        "source": "T06n0220_291:0481b20_26"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481b21_27"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481b23_28"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481b25_29"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是鼻界，是香界、鼻識界及鼻觸、鼻觸為緣所生諸受；",
        "translation": "“If great enlightening beings practice the perfection of wisdom, they do not cling to the nose realm as the [realm of] the nose. They think that it is the smell realm, the nasal consciousness realm, and the sensations that arise from nasal contact and nasal contact as supporting objects.",
        "source": "T06n0220_291:0481b25_30"
    },
    {
        "source_sentence": "亦不執由鼻界，由香界乃至鼻觸為緣所生諸受；",
        "translation": "Nor do they believe that sensation is due to the odor of the organ of smell, or so forth. They do not hold that it is due to the odor of the organ of smell which gives rise to sensation; nor does their perception arise by reason of the odor of the odor associated with the odor:",
        "source": "T06n0220_291:0481b27_31"
    },
    {
        "source_sentence": "亦不執屬鼻界，屬香界乃至鼻觸為緣所生諸受；",
        "translation": "Nor do they believe that it belongs to the sense odor of the organ of smell or to the sense odor, or even to the sensations that arise by reason of nasal contact.",
        "source": "T06n0220_291:0481b29_0"
    },
    {
        "source_sentence": "亦不執依鼻界，依香界乃至鼻觸為緣所生諸受。",
        "translation": "Nor does it hold that sensations arise by relying on the odor element of the nose, or by relying on the odor element and even on nasal contact as a condition.",
        "source": "T06n0220_291:0481c01_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481c02_2"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481c04_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481c06_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是舌界，是味界、舌識界及舌觸、舌觸為緣所生諸受；",
        "translation": "“If great enlightening beings cultivate the perfection of wisdom, they do not cling to the tongue realm as the [realm of] speech. It is the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and tongue contact as supporting object.",
        "source": "T06n0220_291:0481c06_5"
    },
    {
        "source_sentence": "亦不執由舌界，由味界乃至舌觸為緣所生諸受；",
        "translation": "Nor do they believe that it is by reason of the tongue that sensations arise, from the taste realm up to the contact with the tongue as supporting object.",
        "source": "T06n0220_291:0481c08_6"
    },
    {
        "source_sentence": "亦不執屬舌界，屬味界乃至舌觸為緣所生諸受；",
        "translation": "They also do not believe that it belongs to the sense-speaking realm. It belongs to the taste realm, up to all sensations that arise from tongue contact as supporting object.",
        "source": "T06n0220_291:0481c09_7"
    },
    {
        "source_sentence": "亦不執依舌界，依味界乃至舌觸為緣所生諸受。",
        "translation": "Nor does he hold to the attachment that it depends on the tongue realm, relies on the taste realm or even on the sensations that arise from tongue contact as a condition.",
        "source": "T06n0220_291:0481c10_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481c11_9"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481c14_10"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481c16_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是身界，是觸界、身識界及身觸、身觸為緣所生諸受；",
        "translation": "“If great enlightening beings practice the perfection of wisdom, they do not cling to the body realm as a body realm. They think that it is the sense element touch, the sense element body and consciousness, bodily contact, bodily contact as supporting object, or sensations produced by bodily contact.",
        "source": "T06n0220_291:0481c16_1"
    },
    {
        "source_sentence": "亦不執由身界，由觸界乃至身觸為緣所生諸受；",
        "translation": "Nor do they hold that sensations arise by reason of the body element, or by reason of the tangible element, or even by reason of bodily contact.",
        "source": "T06n0220_291:0481c18_2"
    },
    {
        "source_sentence": "亦不執屬身界，屬觸界乃至身觸為緣所生諸受；",
        "translation": "Nor do they believe that it belongs to the body realm. It belongs to the sense element tangible and so on, up to all sensations that arise from bodily contact as supporting object.",
        "source": "T06n0220_291:0481c19_3"
    },
    {
        "source_sentence": "亦不執依身界，依觸界乃至身觸為緣所生諸受。",
        "translation": "Nor does he hold to the view that they rely on the body realm as their support, that they rely on the contact realm as their support, or even on the sensations that arise from bodily contact as their support.",
        "source": "T06n0220_291:0481c20_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0481c21_5"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0481c23_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0481c25_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是意界，是法界、意識界及意觸、意觸為緣所生諸受；",
        "translation": "“If great enlightening beings cultivate the perfection of wisdom, they do not cling to the mental realm as a mental realm. It is the realm of reality, the realm of thinking consciousness, and all sensations that arise from mental contact or mental contact as supporting object.",
        "source": "T06n0220_291:0481c25_8"
    },
    {
        "source_sentence": "亦不執由意界，由法界乃至意觸為緣所生諸受；",
        "translation": "Nor do they believe that it is by reason of the mind realm that sensations arise from the Dharma realm and so on up to mental contact as supporting object.",
        "source": "T06n0220_291:0481c27_9"
    },
    {
        "source_sentence": "亦不執屬意界，屬法界乃至意觸為緣所生諸受；",
        "translation": "Nor do they believe that it belongs to the mental realm. It belongs to the realm of dharmas and so on, up to all sensations that arise by reason of mental contact.",
        "source": "T06n0220_291:0481c29_0"
    },
    {
        "source_sentence": "亦不執依意界，依法界乃至意觸為緣所生諸受。",
        "translation": "Nor does he cling to feelings that are supported by the mental realm, which are based on the Dharma realm and even sensations that arise from mental contact as a condition.",
        "source": "T06n0220_291:0482a01_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482a02_2"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482a04_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0482a06_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是地界，是水、火、風、空、識界；",
        "translation": "“If great enlightening beings practice the perfection of wisdom, they do not cling to the earth realm as earth; they think it is water, fire, wind, space, or consciousness.",
        "source": "T06n0220_291:0482a06_5"
    },
    {
        "source_sentence": "亦不執由地界，由水、火、風、空、識界；",
        "translation": "Nor do they hold that it is by reason of the earth element, or by reason of water, fire, wind, space, or consciousness.",
        "source": "T06n0220_291:0482a08_0"
    },
    {
        "source_sentence": "亦不執屬地界，屬水、火、風、空、識界；",
        "translation": "Nor do they believe that it belongs to the earth element, but rather to water, fire, wind, space, and consciousness.",
        "source": "T06n0220_291:0482a08_1"
    },
    {
        "source_sentence": "亦不執依地界，依水、火、風、空、識界。",
        "translation": "Nor does it hold that they rely on the earth realm and rely on water, fire, wind, air, space, and consciousness realms.",
        "source": "T06n0220_291:0482a09_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482a10_3"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482a12_4"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0482a14_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是無明，是行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱；",
        "translation": "“If great enlightening beings cultivate the perfection of wisdom, they do not cling to ignorance; it is conditioned by volition, consciousness, name and form, the six sense-fields, touch, sensation, desire, grasping, existence, birth, old age, sorrow, pain, suffering, and vexation.",
        "source": "T06n0220_291:0482a14_6"
    },
    {
        "source_sentence": "亦不執由無明，由行乃至老死愁歎苦憂惱；",
        "translation": "Nor does he believe that it is due to ignorance that they experience sorrow, pain, and vexation from conditioned states of existence up to old age and death.",
        "source": "T06n0220_291:0482a16_7"
    },
    {
        "source_sentence": "亦不執屬無明，屬行乃至老死愁歎苦憂惱；",
        "translation": "They also do not cling to ignorance, which belongs to conditioned phenomena or even to the sorrow, pain, and vexation of old age and death.",
        "source": "T06n0220_291:0482a17_8"
    },
    {
        "source_sentence": "亦不執依無明，依行乃至老死愁歎苦憂惱。",
        "translation": "Nor does he cling to ignorance as the basis, which depends on conditioned phenomena up to old age, sorrow, pain, and vexation.",
        "source": "T06n0220_291:0482a18_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482a19_10"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482a22_11"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0482a24_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是布施波羅蜜多，是淨戒、安忍、精進、靜慮、般若波羅蜜多；",
        "translation": "If a bodhisattva-mahāsattva cultivates the perfection of wisdom and doesn’t cling to the perfection of generosity, this is the perfection of pure morality, patience, effort, meditative absorption, and wisdom.",
        "source": "T06n0220_291:0482a24_1"
    },
    {
        "source_sentence": "亦不執由布施波羅蜜多，由淨戒乃至般若波羅蜜多；",
        "translation": "Nor do they cling to the idea that it is because of the perfection of generosity, pure morality, up to the perfection of wisdom.",
        "source": "T06n0220_291:0482a26_2"
    },
    {
        "source_sentence": "亦不執屬布施波羅蜜多，屬淨戒乃至般若波羅蜜多；",
        "translation": "Nor do they cling to anything that belongs to the perfection of generosity, pure morality, or up to the perfection of wisdom.",
        "source": "T06n0220_291:0482a27_3"
    },
    {
        "source_sentence": "亦不執依布施波羅蜜多，依淨戒乃至般若波羅蜜多。",
        "translation": "They also don't cling to the perfection of generosity and rely on the perfection of pure morality or even the perfection of wisdom.",
        "source": "T06n0220_291:0482a28_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482b01_5"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482b03_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0482b05_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是內空，是外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空；",
        "translation": "If bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they do not cling to internal emptiness. This is external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness as conditioned, emptiness as non-conditioned, ultimate emptiness, emptiness without limit, empti",
        "source": "T06n0220_291:0482b05_8"
    },
    {
        "source_sentence": "亦不執由內空，由外空乃至無性自性空；",
        "translation": "They do not believe that it is because of internal emptiness that they perceive the emptiness of all things, or that it is because of external emptiness up to the emptiness of the essential nature of nonexistence.",
        "source": "T06n0220_291:0482b10_0"
    },
    {
        "source_sentence": "亦不執屬內空，屬外空乃至無性自性空；",
        "translation": "They also do not cling to emptiness internally or to emptiness externally, up to emptiness of the essential nature of nonexistence.",
        "source": "T06n0220_291:0482b10_1"
    },
    {
        "source_sentence": "亦不執依內空，依外空乃至無性自性空。",
        "translation": "Nor does he cling to internal emptiness that depends on external emptiness or even the emptiness of the self-natureless self-nature.",
        "source": "T06n0220_291:0482b11_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482b12_3"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482b15_4"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0482b17_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是真如，是法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；",
        "translation": "“If great enlightening beings cultivate the perfection of wisdom, they do not cling to it as true reality. It is the realm of reality, the essence of reality, the nature of reality, non-falsity, unchanging and dissimilar, equanimity, freedom from birth, legality, the abode of truth, reality, space, or inconceivable",
        "source": "T06n0220_291:0482b17_1"
    },
    {
        "source_sentence": "亦不執由真如，由法界乃至不思議界；",
        "translation": "Nor do they cling to the doctrine that it is by reason of true reality or by reason of the realm of reality up to the inconceivable realm.",
        "source": "T06n0220_291:0482b20_2"
    },
    {
        "source_sentence": "亦不執屬真如，屬法界乃至不思議界；",
        "translation": "They also do not cling to what belongs to the realm of reality, which belongs to the realm of reality and so on up to the inconceivable realm.",
        "source": "T06n0220_291:0482b20_3"
    },
    {
        "source_sentence": "亦不執依真如，依法界乃至不思議界。",
        "translation": "They also don't cling to the true reality that relies on the Dharma realm or even the inconceivable realm.",
        "source": "T06n0220_291:0482b21_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482b22_5"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482b24_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0482b26_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是苦聖諦，是集、滅、道聖諦；",
        "translation": "If great enlightening beings cultivate the perfection of wisdom and do not cling to these noble truths of suffering, they are the noble truths of accumulation, cessation, and the path.",
        "source": "T06n0220_291:0482b27_0"
    },
    {
        "source_sentence": "亦不執由苦聖諦，由集、滅、道聖諦；",
        "translation": "Nor do they hold that it is by reason of the noble truth of suffering that they attach to the noble truths of arising, cessation, and the path.",
        "source": "T06n0220_291:0482b28_1"
    },
    {
        "source_sentence": "亦不執屬苦聖諦，屬集、滅、道聖諦；",
        "translation": "Nor do they hold that it belongs to the noble truth of suffering, but rather to the noble truths of arising, cessation, and the path.",
        "source": "T06n0220_291:0482b29_2"
    },
    {
        "source_sentence": "亦不執依苦聖諦，依集、滅、道聖諦。",
        "translation": "Nor does he cling to the noble truth of suffering as the basis and the noble truths of arising, cessation, and the path as the basis.",
        "source": "T06n0220_291:0482c01_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482c01_4"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482c04_0"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_291:0482c05_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，不執是四靜慮，是四無量、四無色定；",
        "translation": "If great enlightening beings cultivate the perfection of wisdom and do not cling to these four meditations, they are in the four immeasurable concentrations or the four formless concentrations.",
        "source": "T06n0220_291:0482c06_2"
    },
    {
        "source_sentence": "亦不執由四靜慮，由四無量、四無色定；",
        "translation": "Nor do they believe that it is due to the four forms of trance, and not due to the four immeasurable states or the four formless concentrations.",
        "source": "T06n0220_291:0482c07_3"
    },
    {
        "source_sentence": "亦不執屬四靜慮，屬四無量、四無色定；",
        "translation": "Nor do they believe that it belongs to the four forms of trance, or to the four immeasurable and four formless absorptions.",
        "source": "T06n0220_291:0482c08_4"
    },
    {
        "source_sentence": "亦不執依四靜慮，依四無量、四無色定。",
        "translation": "Nor does he cling to the four meditations that rely on the four concentrations, which rely on the four immeasurable and four formless concentrations.",
        "source": "T06n0220_291:0482c09_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行般若波羅蜜多，雖知諸法如幻乃至如尋香城，而不執是幻乃至是尋香城，",
        "translation": "Although the bodhisattva Mahāsattva cultivates the perfection of wisdom, even though he knows all dharmas are illusory or even like the city of incense, he doesn't cling to what's illusory or even the city of incense.",
        "source": "T06n0220_291:0482c10_6"
    },
    {
        "source_sentence": "亦不執由幻乃至由尋香城，亦不執屬幻乃至屬尋香城，亦不執依幻乃至依尋香城。",
        "translation": "They don't cling to illusions or even the city of fragrance as a result of illusions, don't cling to illusions or even the city of fragrance as a result of illusions, and don't cling to illusions or even the city of fragrance as a result of investigation.",
        "source": "T06n0220_291:0482c12_7"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百九十一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2.1",
        "source": "T06n0220_291:0482c15_0"
    }
]