[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2, Volume 8",
        "source": "T06n0220_288:0463b14_0"
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T06n0220_288:0463b15_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_288:0463b17_0"
    },
    {
        "source_sentence": "初分著不著相品第三十六之二",
        "translation": "The Thirty-sixth and Second Part of the Chapter on the First Part, Attachment and Non-attachment to Characteristics",
        "source": "T06n0220_288:0463b18_0"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T06n0220_288:0463b19_0"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，若以有所得為方便，從初發心於布施波羅蜜多起行想著，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle, if they take attaining as their skillful means the practice of generosity from the first arousal of the aspiration for enlightenment that gives rise to conceptualization and attachment",
        "source": "T06n0220_288:0463b19_1"
    },
    {
        "source_sentence": "於淨戒、安忍、精進、靜慮、般若波羅蜜多起行想著；",
        "translation": "They develop conceptual attachment to the practices of morality, patience, effort, meditative absorption, and transcendent wisdom.",
        "source": "T06n0220_288:0463b21_2"
    },
    {
        "source_sentence": "若於內空起行想著，於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空起行想著；",
        "translation": "If one were to give rise to conceptual attachment regarding internal emptiness, they would give rise to conceptual attachment regarding external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness",
        "source": "T06n0220_288:0463b22_3"
    },
    {
        "source_sentence": "若於真如起行想著，於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界起行想著；",
        "translation": "“Great enlightening beings develop conceptual attachment with respect to the realm of reality, and develop conceptual attachment with respect to the realm of reality. They develop conceptual attachment with respect to the realm of reality, the nature of reality, non-fal",
        "source": "T06n0220_288:0463b26_4"
    },
    {
        "source_sentence": "若於苦聖諦起行想著，於集、滅、道聖諦起行想著；",
        "translation": "If one gives rise to conceptual attachment in relation to the noble truth of suffering, and if one gives rise to conceptual attachment in relation to the noble truths of accumulation, cessation, and the path, they are said to be produced.",
        "source": "T06n0220_288:0463b28_5"
    },
    {
        "source_sentence": "若於四靜慮起行想著，於四無量、四無色定起行想著；",
        "translation": "When conceptual attachment regarding the four forms of trance is produced, conceptual attachment regarding the four immeasurable concentrations and the four formless concentrations is produced.",
        "source": "T06n0220_288:0463c01_0"
    },
    {
        "source_sentence": "若於八解脫起行想著，於八勝處、九次第定、十遍處起行想著；",
        "translation": "When conceptual attachment is produced regarding the eight liberations, conceptual attachment is produced regarding the eight spheres of mastery, the nine graduated concentrations and the ten universals.",
        "source": "T06n0220_288:0463c02_1"
    },
    {
        "source_sentence": "若於四念住起行想著，於四正斷、四神足、五根、五力、七等覺支、八聖道支起行想著；",
        "translation": "If one gives rise to conceptual attachment in relation to the four abodes of mindfulness, then one gives rise to conceptual attachment in relation to the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers,",
        "source": "T06n0220_288:0463c03_2"
    },
    {
        "source_sentence": "若於空解脫門起行想著，於無相、無願解脫門起行想著；",
        "translation": "When conceptual attachment is produced regarding the aspect liberation through emptiness, conceptual attachment is produced regarding the aspect liberation through signlessness and wishlessness.",
        "source": "T06n0220_288:0463c05_3"
    },
    {
        "source_sentence": "若於菩薩十地起行想著；",
        "translation": "If one gives rise to perceptions of practice in the ten stages of enlightening beings.",
        "source": "T06n0220_288:0463c06_4"
    },
    {
        "source_sentence": "若於五眼起行想著，於六神通起行想著；",
        "translation": "When conceptual attachment regarding the five eyes, conceptual attachment regarding aspects is produced; when conceptual attachment regarding the six supernormal powers is produced, conceptual attachment regarding aspects is produced.",
        "source": "T06n0220_288:0463c07_5"
    },
    {
        "source_sentence": "若於佛十力起行想著，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法起行想著；",
        "translation": "“Great enlightening beings develop conceptual attachment to practice regarding the ten powers of buddhas, and develop conceptual attachment to practice regarding the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion",
        "source": "T06n0220_288:0463c08_6"
    },
    {
        "source_sentence": "若於無忘失法起行想著，於恒住捨性起行想著；",
        "translation": "When conceptual attachment is produced regarding the doctrine of nonforgetfulness, conceptual attachment is produced regarding the nature of eternally abiding equanimity.",
        "source": "T06n0220_288:0463c10_7"
    },
    {
        "source_sentence": "若於一切智起行想著，於道相智、一切相智起行想著；",
        "translation": "If conceptual attachment is developed regarding omniscience, conceptual attachment is developed regarding knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_288:0463c11_8"
    },
    {
        "source_sentence": "若於一切陀羅尼門起行想著；",
        "translation": "“Great enlightening beings develop conceptual attachment to all the practices of concentration formulae.",
        "source": "T06n0220_288:0463c12_9"
    },
    {
        "source_sentence": "於一切三摩地門起行想著；",
        "translation": "They develop conceptual attachment to all aspects of concentration and give rise to perceptions of practice.",
        "source": "T06n0220_288:0463c13_10"
    },
    {
        "source_sentence": "若於預流果起行想著，於一來、不還、阿羅漢果起行想著；",
        "translation": "When conceptual attachment is produced regarding the fruit of stream-entry, conceptual attachment is produced regarding the one-coming, nonreturning and arhat-fruit.",
        "source": "T06n0220_288:0463c14_0"
    },
    {
        "source_sentence": "若於獨覺菩提起行想著；",
        "translation": "If one gives rise to conceptualization of practice in the enlightenment of self-enlightened ones.",
        "source": "T06n0220_288:0463c15_1"
    },
    {
        "source_sentence": "若於一切菩薩摩訶薩行起行想著；",
        "translation": "“Great enlightening beings give rise to perceptions of practice in all the practices of great enlightening beings.",
        "source": "T06n0220_288:0463c15_2"
    },
    {
        "source_sentence": "若於諸佛無上正等菩提起行想著。",
        "translation": "If he gives rise to the perception of practice and attachment to the unsurpassed perfect enlightenment of the buddhas.",
        "source": "T06n0220_288:0463c16_3"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T06n0220_288:0463c17_4"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，若無方便善巧，以有所得為方便，起如是等種種想著名為著相。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, if they don't have skillful means, they give rise to various kinds of thoughts like this as a method that have something to attain, which are called",
        "source": "T06n0220_288:0463c17_5"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T06n0220_288:0463c19_6"
    },
    {
        "source_sentence": "先所問言『云何菩薩摩訶薩行般若波羅蜜多時不著相？』",
        "translation": "The previous question was, 'How does a bodhisattva-mahāsattva not attach to characteristics when he practices the perfection of wisdom?'",
        "source": "T06n0220_288:0463c20_7"
    },
    {
        "source_sentence": "者，舍利子！",
        "translation": "That's, Śāriputra!",
        "source": "T06n0220_288:0463c21_8"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時有方便善巧，於色不起空、不空想，於受、想、行、識亦不起空、不空想；",
        "translation": "“When great enlightening beings practice the perfection of wisdom, they have skillful means by which they do not give rise to conceptions of emptiness or nonemptyness regarding form. They also do not give rise to conceptions of emptiness or",
        "source": "T06n0220_288:0463c21_9"
    },
    {
        "source_sentence": "於眼處不起空、不空想，於耳、鼻、舌、身、意處亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in the sense-field of the eye; they do not conceive of emptiness or nonemptyness in the sense-field of the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_288:0463c23_10"
    },
    {
        "source_sentence": "於色處不起空、不空想，於聲、香、味、觸、法處亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in the realm of form. They also do not conceive of emptiness or nonemptyness in the realms of sound, smell, taste, touch, or dharmas.",
        "source": "T06n0220_288:0463c25_11"
    },
    {
        "source_sentence": "於眼界不起空、不空想，於色界、眼識界及眼觸、眼觸為緣所生諸受亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in regard to the eye realm. They also do not conceive of emptiness or nonemptyness in respect to the material realm, the eye consciousness realm, and the sensations",
        "source": "T06n0220_288:0463c26_12"
    },
    {
        "source_sentence": "於耳界不起空、不空想，於聲界、耳識界及耳觸、耳觸為緣所生諸受亦不起空、不空想，",
        "translation": "He doesn't conceptualize emptiness or nonemptyness in the ear realm, and doesn't conceptualize emptiness or nonemptyness in the sound realm, the ear consciousness realm, or the sensations that arise from ear",
        "source": "T06n0220_288:0463c28_13"
    },
    {
        "source_sentence": "於鼻界不起空、不空想，於香界、鼻識界及鼻觸、鼻觸為緣所生諸受亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or absence of emptiness in the sense-nose. They do not conceive of emptiness or absence of emptiness in the sense-nose. They do not conceive of emptiness or",
        "source": "T06n0220_288:0464a01_14"
    },
    {
        "source_sentence": "於舌界不起空、不空想，於味界、舌識界及舌觸、舌觸為緣所生諸受亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or absence of emptiness in the sense-tongue realm; they do not conceive of emptiness or absence of emptiness in the taste realm, the sense-tongue realm, the sense",
        "source": "T06n0220_288:0464a03_15"
    },
    {
        "source_sentence": "於身界不起空、不空想，於觸界、身識界及身觸、身觸為緣所生諸受亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in regard to the body realm; they do not conceive of emptiness or nonemptyness in regard to the sense-realm. Nor do they conceive of emptiness or nonemp",
        "source": "T06n0220_288:0464a05_16"
    },
    {
        "source_sentence": "於意界不起空、不空想，於法界、意識界及意觸、意觸為緣所生諸受亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in regard to the mind realm. They also do not conceive of emptiness or nonemptyness in regard to the Dharma realm, the realm of mental consciousness, or any other",
        "source": "T06n0220_288:0464a07_17"
    },
    {
        "source_sentence": "於地界不起空、不空想，於水、火、風、空、識界亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in the earth realm; they do not conceive of emptiness or nonemptyness in water, fire, wind, space, or consciousness realms.",
        "source": "T06n0220_288:0464a09_18"
    },
    {
        "source_sentence": "於無明不起空、不空想，於行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in regard to ignorance. Nor do they conceive of emptiness or nonemptyness in regard to conditioned phenomena, consciousness, name and form, the six sense mediums,",
        "source": "T06n0220_288:0464a10_19"
    },
    {
        "source_sentence": "於布施波羅蜜多不起空、不空想，於淨戒、安忍、精進、靜慮、般若波羅蜜多亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in the perfection of giving, and they also do not conceive of emptiness or nonemptyness in the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_288:0464a13_0"
    },
    {
        "source_sentence": "於內空不起空、不空想，於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in regard to internal emptiness. They also do not conceive of emptiness or nonemptyness in regard to external emptiness, internal emptiness or external emptiness, empti",
        "source": "T06n0220_288:0464a15_1"
    },
    {
        "source_sentence": "於真如不起空、不空想，於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in the realm of reality; they do not conceive of emptiness or nonemptyness in the realm of reality. Nor do they conceive of emptiness or nonemptyness in",
        "source": "T06n0220_288:0464a19_2"
    },
    {
        "source_sentence": "於苦聖諦不起空、不空想，於集、滅、道聖諦亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness regarding the noble truth of suffering. They also do not conceive of emptiness or nonemptyness regarding the noble truths of arising, cessation, and the path.",
        "source": "T06n0220_288:0464a22_3"
    },
    {
        "source_sentence": "於四靜慮不起空、不空想，於四無量、四無色定亦不起空、不空想；",
        "translation": "They do not conceive of the four meditations as emptiness or nonempty. Nor do they conceive of the four immeasurable concentrations or the four formless concentrations as emptiness or nonempty.",
        "source": "T06n0220_288:0464a23_4"
    },
    {
        "source_sentence": "於八解脫不起空、不空想，於八勝處、九次第定、十遍處亦不起空、不空想；",
        "translation": "They do not conceive of the eight liberations as empty or nonempty. Nor do they conceive of the eight spheres of mastery, the nine graduated concentrations, or the ten universals as empty or nonempty.",
        "source": "T06n0220_288:0464a24_5"
    },
    {
        "source_sentence": "於四念住不起空、不空想，於四正斷、四神足、五根、五力、七等覺支、八聖道支亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in the four abodes of mindfulness; they also do not conceive of emptiness or nonemptyness in the four forms of right abandonment, the four spiritual powers, the five facul",
        "source": "T06n0220_288:0464a26_6"
    },
    {
        "source_sentence": "於空解脫門不起空、不空想，於無相、無願解脫門亦不起空、不空想；",
        "translation": "In the liberation gate of emptiness they do not conceive of emptiness or nonemptyness; in the liberation gate of signlessness and wishlessness they also do not conceive of emptiness or nonemptyness.",
        "source": "T06n0220_288:0464a28_7"
    },
    {
        "source_sentence": "於菩薩十地不起空、不空想；",
        "translation": "In the ten stages of enlightening beings they do not conceive of emptiness or nonemptyness.",
        "source": "T06n0220_288:0464b01_8"
    },
    {
        "source_sentence": "於五眼不起空、不空想，於六神通亦不起空、不空想；",
        "translation": "They do not think of the five eyes as empty or nonempty, and also do not think of the six supernormal powers as empty or nonempty.",
        "source": "T06n0220_288:0464b02_0"
    },
    {
        "source_sentence": "於佛十力不起空、不空想，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in regard to the ten powers of buddhas. They also do not conceive of emptiness or nonemptyness in regard to the four fearlessnesses, the four unhindered understandings",
        "source": "T06n0220_288:0464b03_1"
    },
    {
        "source_sentence": "於無忘失法不起空、不空想，於恒住捨性亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in regard to the dharmas free from forgetfulness. They also do not conceive of emptiness or nonemptyness in regard to the nature of eternally abiding equanimity.",
        "source": "T06n0220_288:0464b05_2"
    },
    {
        "source_sentence": "於一切智不起空、不空想，於道相智、一切相智亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in omniscience; they do not conceive of emptiness or nonemptyness in knowledge of all characteristics, and also do not conceive of emptiness or nonemptyness in knowledge",
        "source": "T06n0220_288:0464b06_3"
    },
    {
        "source_sentence": "於一切陀羅尼門不起空、不空想，於一切三摩地門亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness in all dhāraṇī teachings, and also do not conceive of emptiness or nonemptyness in all concentrations.",
        "source": "T06n0220_288:0464b08_4"
    },
    {
        "source_sentence": "於預流果不起空、不空想，於一來、不還、阿羅漢果亦不起空、不空想；",
        "translation": "They do not conceive of emptiness or nonemptyness regarding the fruit of stream-entry. Nor do they conceive of emptiness or nonemptyness regarding the fruits of once-returning, nonreturning, and arhatship.",
        "source": "T06n0220_288:0464b10_0"
    },
    {
        "source_sentence": "於獨覺菩提不起空、不空想；",
        "translation": "They do not conceive of enlightenment of the self-enlightened as emptiness or nonempty.",
        "source": "T06n0220_288:0464b11_1"
    },
    {
        "source_sentence": "於一切菩薩摩訶薩行不起空、不空想；",
        "translation": "In all the practices of enlightening beings they do not conceive of emptiness or nonemptyness.",
        "source": "T06n0220_288:0464b12_2"
    },
    {
        "source_sentence": "於諸佛無上正等菩提不起空、不空想；",
        "translation": "They do not conceive of the buddhas’ supreme perfect enlightenment as emptiness or nonempty.",
        "source": "T06n0220_288:0464b13_3"
    },
    {
        "source_sentence": "於過去法不起空、不空想，於未來、現在法不起空、不空想。",
        "translation": "They don't give rise to conceptions of emptiness and nonemptyness in past dharmas, and they don't give rise to conceptions of emptiness and nonemptyness in future and present dharmas.",
        "source": "T06n0220_288:0464b14_0"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T06n0220_288:0464b16_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜多時，以無所得為方便，不作是念：『我能行施惠彼受者，",
        "translation": "“When great enlightening beings practice prajñāpāramitā, they do so by means of the ungraspable, without ever thinking, ‘I can give to those who receive.",
        "source": "T06n0220_288:0464b16_1"
    },
    {
        "source_sentence": "此所施物及惠施性。』",
        "translation": "These are the things they give and the nature of generosity.'",
        "source": "T06n0220_288:0464b18_2"
    },
    {
        "source_sentence": "不作是念：『我能護戒，此所護戒。』",
        "translation": "They don't think, 'I can protect the precepts, and these are the precepts I protect.'",
        "source": "T06n0220_288:0464b18_3"
    },
    {
        "source_sentence": "不作是念：『我能修忍，此所修忍。』",
        "translation": "Don't think, 'I can cultivate forbearance, and this is the forbearance I cultivate.'",
        "source": "T06n0220_288:0464b19_4"
    },
    {
        "source_sentence": "不作是念：『我能精進，此所精進。』",
        "translation": "Don't think, 'I can make effort, and this is what I'm doing.'",
        "source": "T06n0220_288:0464b20_5"
    },
    {
        "source_sentence": "不作是念：『我能入定，此所入定。』",
        "translation": "Don't think, 'I can enter concentration, and this is the concentration that I enter.'",
        "source": "T06n0220_288:0464b20_6"
    },
    {
        "source_sentence": "不作是念：『我能修慧，此所修慧。』",
        "translation": "Don't think, 'I can cultivate wisdom, and this is the wisdom I cultivate.'",
        "source": "T06n0220_288:0464b21_7"
    },
    {
        "source_sentence": "不作是念：『我能植福，此所植福及所得果。』",
        "translation": "They don't think, 'I can plant merit, this is the merit that's planted and the fruit that's obtained.'",
        "source": "T06n0220_288:0464b22_8"
    },
    {
        "source_sentence": "不作是念：『我能入菩薩正性離生。』",
        "translation": "They don't think, 'I can enter the bodhisattva's true nature and be free of birth.'",
        "source": "T06n0220_288:0464b23_9"
    },
    {
        "source_sentence": "不作是念：『我能成熟有情。』",
        "translation": "They don't think, 'I can ripen sentient beings.'",
        "source": "T06n0220_288:0464b24_10"
    },
    {
        "source_sentence": "不作是念：『我能嚴淨佛土。』",
        "translation": "They don't think, 'I can adorn and purify the Buddha land.'",
        "source": "T06n0220_288:0464b24_11"
    },
    {
        "source_sentence": "不作是念：『我能證得一切智智。』",
        "translation": "Don't think, 'I can realize the cognition of all things.'",
        "source": "T06n0220_288:0464b25_12"
    },
    {
        "source_sentence": "不作是念：『我能住空證法實性。』",
        "translation": "Don't think, 'I can abide in emptiness and realize the true nature of dharmas.'",
        "source": "T06n0220_288:0464b26_13"
    },
    {
        "source_sentence": "不作是念：『我能修習諸菩薩行。』",
        "translation": "They don't think, 'I can cultivate the bodhisattva practices.'",
        "source": "T06n0220_288:0464b26_14"
    },
    {
        "source_sentence": "不作是念：『我能具證諸佛功德。』",
        "translation": "Don't think, 'I can fully realize the merits of the buddhas.'",
        "source": "T06n0220_288:0464b27_15"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T06n0220_288:0464b28_16"
    },
    {
        "source_sentence": "若菩薩摩訶薩有方便善巧，以無所得為方便行般若波羅蜜多時，無如是等一切分別妄想執著，",
        "translation": "If bodhisattvas and mahāsattvas have skillful means to skillfully practice the perfection of wisdom with ungraspable skillful means, there's no such kind of discriminating deluded conceptual attachment when they practice the perfection of wisdom.",
        "source": "T06n0220_288:0464b28_17"
    },
    {
        "source_sentence": "由善通達內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空故。",
        "translation": "It's because they well understand internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emp",
        "source": "T06n0220_288:0464c01_18"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T06n0220_288:0464c05_19"
    },
    {
        "source_sentence": "是名菩薩摩訶薩行般若波羅蜜多時有方便善巧，無所得為方便無執著相。」",
        "translation": "This is called a bodhisattva-mahāsattva who has skillful means when he practices the perfection of prajñāpāramitā, and there's no method for attaining it that doesn't cling to characteristics.",
        "source": "T06n0220_288:0464c05_20"
    },
    {
        "source_sentence": "爾時，天帝釋問具壽善現言：「大德！",
        "translation": "It was then that Śakra Devānām-Indra asked the long-lived good manifestation, saying, Mañjuśrī!",
        "source": "T06n0220_288:0464c08_0"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等修行般若波羅蜜多時，云何著相？」",
        "translation": "When good men and good women who abide in the bodhisattva vehicle cultivate the perfection of wisdom, what are their attachments?",
        "source": "T06n0220_288:0464c08_1"
    },
    {
        "source_sentence": "善現答言：「憍尸迦！",
        "translation": "Sunetra replied, Kauśika!",
        "source": "T06n0220_288:0464c10_2"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等修行般若波羅蜜多時，無方便善巧，有所得為方便，",
        "translation": "When they abide in the bodhisattva vehicle, good men and good women cultivate the perfection of prajñāpāramitā, there's no skillful means or skillfulness, and having attained it is called skillful means.",
        "source": "T06n0220_288:0464c10_3"
    },
    {
        "source_sentence": "起心想著；",
        "translation": "They give rise to thoughts and perceptions of attachment.",
        "source": "T06n0220_288:0464c12_4"
    },
    {
        "source_sentence": "起布施波羅蜜多想著，起淨戒、安忍、精進、靜慮、般若波羅蜜多想著；",
        "translation": "They develop conceptual attachment to the perfection of giving, and they develop conceptual attachment to the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_288:0464c12_5"
    },
    {
        "source_sentence": "起內空想著，起外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空想著；",
        "translation": "They give rise to conceptions and attachments of internal emptiness, while they give rise to conceptions and attachments of external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness,",
        "source": "T06n0220_288:0464c14_6"
    },
    {
        "source_sentence": "起真如想著，起法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界想著；",
        "translation": "They give rise to perceptions of attachment to the realm of reality. They give rise to perceptions of the realm of reality, the essence of reality, non-falsity, unchanging and dissimilar nature, equality, freedom from",
        "source": "T06n0220_288:0464c18_7"
    },
    {
        "source_sentence": "起苦聖諦想著，起集、滅、道聖諦想著；",
        "translation": "They give rise to conceptual attachment to the noble truth of suffering, and they give rise to conceptual attachment to the noble truths of origin, cessation, and the path.",
        "source": "T06n0220_288:0464c20_8"
    },
    {
        "source_sentence": "起四靜慮想著，起四無量、四無色定想著；",
        "translation": "They give rise to the conceptual attachment of four forms of meditative absorption, and they give rise to the conceptual attachment of the four immeasurable and four formless concentrations.",
        "source": "T06n0220_288:0464c21_9"
    },
    {
        "source_sentence": "起八解脫想著，起八勝處、九次第定、十遍處想著；",
        "translation": "They give rise to the conceptual attachment of eight liberations. They give rise to the conceptual attachment of eight spheres of mastery, nine graduated concentrations and ten universals.",
        "source": "T06n0220_288:0464c22_10"
    },
    {
        "source_sentence": "起四念住想著，起四正斷、四神足、五根、五力、七等覺支、八聖道支想著；",
        "translation": "They give rise to the four kinds of conceptual attachment of mindfulness, and they give rise to the four forms of conceptual attachment of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual",
        "source": "T06n0220_288:0464c23_11"
    },
    {
        "source_sentence": "起空解脫門想著，起無相、無願解脫門想著；",
        "translation": "They give rise to conceptual attachment through the liberation gate of emptiness, and they give rise to conceptual attachment through the liberation gates of signlessness and wishlessness.",
        "source": "T06n0220_288:0464c24_12"
    },
    {
        "source_sentence": "起菩薩十地想著；",
        "translation": "They give rise to the conceptual attachment of enlightening beings in the ten stages.",
        "source": "T06n0220_288:0464c25_13"
    },
    {
        "source_sentence": "起五眼想著，起六神通想著；",
        "translation": "They give rise to the conceptual attachment ‘five eyes’ and give rise to the conceptual attachment ‘six higher knowledges’.",
        "source": "T06n0220_288:0464c26_14"
    },
    {
        "source_sentence": "起佛十力想著，起四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法想著；",
        "translation": "They give rise to conceptions of the ten powers of buddhahood, and they give rise to conceptions of the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great",
        "source": "T06n0220_288:0464c26_15"
    },
    {
        "source_sentence": "起無忘失法想著，起恒住捨性想著；",
        "translation": "They engender conceptions of attachment to the state of nonforgetfulness and they engender conceptions of permanence, equanimity, and equanimity.",
        "source": "T06n0220_288:0464c28_16"
    },
    {
        "source_sentence": "起一切智想著，起道相智、一切相智想著；",
        "translation": "They give rise to conceptual attachment to omniscience, and they give rise to conceptual attachment to knowledge of the path and to knowledge of all characteristics.",
        "source": "T06n0220_288:0464c29_17"
    },
    {
        "source_sentence": "起一切陀羅尼門想著，起一切三摩地門想著；",
        "translation": "They give rise to conceptions of attachment in all aspects of mental command, and they give rise to conceptions of attachment in all aspects of concentration.",
        "source": "T06n0220_288:0465a01_18"
    },
    {
        "source_sentence": "起預流果想著，起一來、不還、阿羅漢果想著；",
        "translation": "They give rise to conceptual attachment as the fruit of stream-entry, and they give rise to conceptual attachment as the fruits of once-returning, nonreturning, and arhatship.",
        "source": "T06n0220_288:0465a02_19"
    },
    {
        "source_sentence": "起獨覺菩提想著；",
        "translation": "They give rise to the conception of self-enlightenment as enlightenment.",
        "source": "T06n0220_288:0465a03_20"
    },
    {
        "source_sentence": "起一切菩薩摩訶薩行想著；",
        "translation": "They give rise to perceptions of all the practices of great enlightening beings.",
        "source": "T06n0220_288:0465a03_21"
    },
    {
        "source_sentence": "起諸佛無上正等菩提想著；",
        "translation": "They give rise to conceptions of the buddhas’ supreme perfect enlightenment.",
        "source": "T06n0220_288:0465a04_22"
    },
    {
        "source_sentence": "起諸菩薩摩訶薩想著；",
        "translation": "They give rise to the conceptions of great enlightening beings.",
        "source": "T06n0220_288:0465a05_23"
    },
    {
        "source_sentence": "起諸如來、應、正等覺想著；",
        "translation": "They give rise to the conceptions and attachments of buddhas, enlightening beings, and fully awakened ones.",
        "source": "T06n0220_288:0465a05_24"
    },
    {
        "source_sentence": "起於佛所種諸善根想著；",
        "translation": "They give rise to conceptions of attachment planting roots of goodness in buddha-places.",
        "source": "T06n0220_288:0465a06_25"
    },
    {
        "source_sentence": "起以如是所種善根和合，迴向阿耨多羅三藐三菩提想著。",
        "translation": "They give rise to the perception and attachment of unsurpassed, correct, and complete enlightenment by combining the good roots sown in this way.",
        "source": "T06n0220_288:0465a06_26"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_288:0465a08_27"
    },
    {
        "source_sentence": "是名住菩薩乘諸善男子、善女人等，無方便善巧，有所得為方便，修行般若波羅蜜多時所有著相。",
        "translation": "These are called the marks of attachment that good men and good women who abide in the bodhisattva vehicle have when they cultivate the perfection of prajñāpāramitā without skillful means, because they have attained skillful means.",
        "source": "T06n0220_288:0465a08_28"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_288:0465a11_0"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，由著想故，不能修行無著般若波羅蜜多，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle can't cultivate the perfection of unattached prajñāpāramitā because they're attached to it.",
        "source": "T06n0220_288:0465a11_1"
    },
    {
        "source_sentence": "迴向無上正等菩提。",
        "translation": "He dedicates himself back to unsurpassed perfect enlightenment.",
        "source": "T06n0220_288:0465a12_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_288:0465a13_3"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_288:0465a13_4"
    },
    {
        "source_sentence": "非色本性可能迴向，非受、想、行、識本性可能迴向故；",
        "translation": "It is not possible to dedicate them back by the nature of form, because it is not possible to dedicate them back by the nature of feeling, perception, volition, and consciousness.",
        "source": "T06n0220_288:0465a13_5"
    },
    {
        "source_sentence": "非眼處本性可能迴向，非耳、鼻、舌、身、意處本性可能迴向故；",
        "translation": "It is not possible to dedicate the root nature of the sense-field of vision, because it is not possible to dedicate the root nature of the sense-fields of ear, nose, tongue, body, and mind.",
        "source": "T06n0220_288:0465a14_6"
    },
    {
        "source_sentence": "非色處本性可能迴向，非聲、香、味、觸、法處本性可能迴向故；",
        "translation": "It is not possible to dedicate one’s root nature in the sphere of form, because it is not possible to dedicate one’s root nature in the sphere of sound, smell, taste, touch and dharma.",
        "source": "T06n0220_288:0465a16_7"
    },
    {
        "source_sentence": "非眼界本性可能迴向，非色界、眼識界及眼觸、眼觸為緣所生諸受本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the eye realm, because it is not possible to dedicate oneself back by the original nature of the form realm, the eye consciousness realm, and the sensations that arise from",
        "source": "T06n0220_288:0465a17_8"
    },
    {
        "source_sentence": "非耳界本性可能迴向，非聲界、耳識界及耳觸、耳觸為緣所生諸受本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the ear realm because it is not possible to dedicate oneself back by the original nature of the sound realm, the ear consciousness realm, and the sensations that arise from ear",
        "source": "T06n0220_288:0465a19_9"
    },
    {
        "source_sentence": "非鼻界本性可能迴向，非香界、鼻識界及鼻觸、鼻觸為緣所生諸受本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the nasal sense element, because it is not possible to dedicate oneself back by the original nature of the odor element, the nasal consciousness element, and the sensations that arise",
        "source": "T06n0220_288:0465a21_10"
    },
    {
        "source_sentence": "非舌界本性可能迴向，非味界、舌識界及舌觸、舌觸為緣所生諸受本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the element tongue, because it is not possible to dedicate oneself back by the original nature of the element of taste, the element of tongue and consciousness, or by the sensations that",
        "source": "T06n0220_288:0465a23_11"
    },
    {
        "source_sentence": "非身界本性可能迴向，非觸界、身識界及身觸、身觸為緣所生諸受本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the bodily realm, because it is not possible to dedicate oneself back by the original nature of the tangible realm, the body-consciousness realm, and the sensations that a",
        "source": "T06n0220_288:0465a25_12"
    },
    {
        "source_sentence": "非意界本性可能迴向，非法界、意識界及意觸、意觸為緣所生諸受本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the mind realm, because it is possible to dedicate oneself back by the original nature of non-mind realms, the realm of mental consciousness, and the sensations that arise",
        "source": "T06n0220_288:0465a27_13"
    },
    {
        "source_sentence": "非地界本性可能迴向，非水、火、風、空、識界本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of earth realm, because it is not possible to dedicate oneself back by the original nature of water, fire, wind, air, space, and consciousness realms.",
        "source": "T06n0220_288:0465a29_14"
    },
    {
        "source_sentence": "非無明本性可能迴向，非行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱本性可能迴向故。",
        "translation": "It's not the case that the original nature of nescience can be directed back, and it's not the case that the original nature of volition, consciousness, name-and-form, the six sense-fields, touch, sensation, cra",
        "source": "T06n0220_288:0465b01_15"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_288:0465b04_0"
    },
    {
        "source_sentence": "非布施波羅蜜多本性可能迴向，非淨戒、安忍、精進、靜慮、般若波羅蜜多本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the perfection of giving, because it is not possible to dedicate oneself back by the original nature of the perfections of morality, patience, effort, meditation, and wisdom.",
        "source": "T06n0220_288:0465b04_1"
    },
    {
        "source_sentence": "非內空本性可能迴向，非外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空本性可能迴向故；",
        "translation": "It is not that the original nature of internal emptiness can be turned back; it is not that external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit",
        "source": "T06n0220_288:0465b06_2"
    },
    {
        "source_sentence": "非真如本性可能迴向，非法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界本性可能迴向故；",
        "translation": "The original nature of true thusness is not capable of dedication, because the original nature of the realm of nonorigination, the essential nature of dharmas, the essence of nonfalsity, the essential nature of unchanging and dissimilar",
        "source": "T06n0220_288:0465b10_3"
    },
    {
        "source_sentence": "非苦聖諦本性可能迴向，非集、滅、道聖諦本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the noble truth of suffering, because it is not possible to dedicate oneself back by the original nature of the noble truths of arising, cessation, and the path.",
        "source": "T06n0220_288:0465b13_4"
    },
    {
        "source_sentence": "非四靜慮本性可能迴向，非四無量、四無色定本性可能迴向故；",
        "translation": "It is not possible to dedicate them back by the original nature of the four meditations, because it is not possible to dedicate them back by the original nature of the four immeasurable and four formless concentrations.",
        "source": "T06n0220_288:0465b14_5"
    },
    {
        "source_sentence": "非八解脫本性可能迴向，非八勝處、九次第定、十遍處本性可能迴向故；",
        "translation": "The original nature of the eight liberations is not capable of dedication, because it cannot be the original nature of the eight spheres of mastery, nine graduated concentrations, or ten universal abodes.",
        "source": "T06n0220_288:0465b15_6"
    },
    {
        "source_sentence": "非四念住本性可能迴向，非四正斷、四神足、五根、五力、七等覺支、八聖道支本性可能迴向故；",
        "translation": "It is not possible to dedicate the root nature of the four abodes of mindfulness, because it is not possible to dedicate the root nature of the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the",
        "source": "T06n0220_288:0465b17_7"
    },
    {
        "source_sentence": "非空解脫門本性可能迴向，非無相、無願解脫門本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of the liberation gate of emptiness because it is not possible to dedicate oneself back by the original nature of the liberation gates of signlessness and wishlessness.",
        "source": "T06n0220_288:0465b19_8"
    },
    {
        "source_sentence": "非菩薩十地本性可能迴向故；",
        "translation": "It is not possible for enlightening beings to dedicate the root nature of the ten stages.",
        "source": "T06n0220_288:0465b21_9"
    },
    {
        "source_sentence": "非五眼本性可能迴向，非六神通本性可能迴向故；",
        "translation": "It is not possible to dedicate them back by the original nature of the five eyes, because it is not possible to dedicate them back by the original nature of the six supernormal powers.",
        "source": "T06n0220_288:0465b21_10"
    },
    {
        "source_sentence": "非佛十力本性可能迴向，非四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法本性可能迴向故；",
        "translation": "It is not possible to dedicate the root nature of the ten powers of buddhas, because it is not possible to dedicate the root nature of the four forms of fearlessness, the four forms of unhindered understanding, great kindness, great compassion",
        "source": "T06n0220_288:0465b23_11"
    },
    {
        "source_sentence": "非無忘失法本性可能迴向，非恒住捨性本性可能迴向故；",
        "translation": "It is not possible to dedicate oneself back by the original nature of nonforgetfulness of dharmas, because it is not possible to dedicate oneself back by the original nature of eternally abiding equanimity.",
        "source": "T06n0220_288:0465b25_12"
    },
    {
        "source_sentence": "非一切智本性可能迴向，非道相智、一切相智本性可能迴向故；",
        "translation": "It is not by the nature of omniscience that they are able to turn back, because it is not by the nature of knowledge of the path or by the nature of knowledge of all characteristics that they are able to turn back.",
        "source": "T06n0220_288:0465b26_13"
    },
    {
        "source_sentence": "非一切陀羅尼門本性可能迴向，非一切三摩地門本性可能迴向故；",
        "translation": "It is not possible to dedicate the root nature of all dhāraṇī-gates, because it is not possible to dedicate the root nature of all samādhi-gates.",
        "source": "T06n0220_288:0465b28_14"
    },
    {
        "source_sentence": "非預流果本性可能迴向，非一來、不還、阿羅漢果本性可能迴向故；",
        "translation": "The original nature of the fruit of stream-entry is not capable of dedication, because the original nature of the fruit of once-returning, nonreturning, and arhatship is not capable of dedication.",
        "source": "T06n0220_288:0465c01_0"
    },
    {
        "source_sentence": "非獨覺菩提本性可能迴向故；",
        "translation": "It is not because the original nature of enlightenment of self-enlightened ones cannot be turned back.",
        "source": "T06n0220_288:0465c02_1"
    },
    {
        "source_sentence": "非一切菩薩摩訶薩行本性可能迴向故；",
        "translation": "It is not possible for all great enlightening beings to dedicate themselves back to the original nature of practice.",
        "source": "T06n0220_288:0465c03_2"
    },
    {
        "source_sentence": "非諸佛無上正等菩提本性可能迴向故。",
        "translation": "It's because the buddhas of unsurpassed correct perfect enlightenment are not capable of dedicating themselves back to their original nature.",
        "source": "T06n0220_288:0465c04_3"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T06n0220_288:0465c06_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲於無上正等菩提示現教導勸勵讚喜他有情者，應以如實相意示現教導勸勵讚喜。",
        "translation": "If a bodhisattva-mahāsattva wants to show the unsurpassed perfect enlightenment and instruct, encourage, and praise other sentient beings, he or she should use the true characteristics of their minds to show the instruction",
        "source": "T06n0220_288:0465c06_1"
    },
    {
        "source_sentence": "復應如是示現教導勸勵讚喜，謂行布施波羅蜜多時，不應分別我能惠捨；",
        "translation": "It should also be so that when one practices the perfection of giving, one does not discriminate between self and equanimity.",
        "source": "T06n0220_288:0465c08_2"
    },
    {
        "source_sentence": "若行淨戒波羅蜜多時，不應分別我能護戒；",
        "translation": "When they practice the perfection of pure morality, they should not discriminate among themselves as capable of protecting precepts.",
        "source": "T06n0220_288:0465c10_3"
    },
    {
        "source_sentence": "若行安忍波羅蜜多時，不應分別我能修忍；",
        "translation": "When practicing the perfection of patience, one should not discriminate self and be able to cultivate patience.",
        "source": "T06n0220_288:0465c11_4"
    },
    {
        "source_sentence": "若行精進波羅蜜多時，不應分別我能精進；",
        "translation": "When practicing the perfection of effort, one should not discriminate self and what I am capable of doing to make effort.",
        "source": "T06n0220_288:0465c12_5"
    },
    {
        "source_sentence": "若行靜慮波羅蜜多時，不應分別我能入定；",
        "translation": "When one practices the perfection of meditation, one should not discriminate self and be able to enter concentration.",
        "source": "T06n0220_288:0465c13_6"
    },
    {
        "source_sentence": "若行般若波羅蜜多時，不應分別我能習慧。",
        "translation": "If someone practices the perfection of prajñā, they shouldn't discriminate between self and wisdom that can be cultivated.",
        "source": "T06n0220_288:0465c14_7"
    },
    {
        "source_sentence": "若行內空時，不應分別我能住內空；",
        "translation": "If there were internal emptiness in conditioned states, one would not discriminate self and be able to abide in internal emptiness.",
        "source": "T06n0220_288:0465c15_8"
    },
    {
        "source_sentence": "若行外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空時，",
        "translation": "If there's emptiness outside the practice, emptiness inside and out, emptiness of emptiness, emptiness of emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness",
        "source": "T06n0220_288:0465c16_9"
    },
    {
        "source_sentence": "不應分別我能住外空乃至無性自性空。",
        "translation": "They shouldn't discriminate between self that can abide in external emptiness and emptiness or even the emptiness of the self-natureless self-nature.",
        "source": "T06n0220_288:0465c19_10"
    },
    {
        "source_sentence": "若行真如時，不應分別我能住真如；",
        "translation": "When they practice suchness, they should not discriminate the self that can abide in suchness.",
        "source": "T06n0220_288:0465c20_11"
    },
    {
        "source_sentence": "若行法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界時，",
        "translation": "When he practices the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, the space realm, the inconceivable realm",
        "source": "T06n0220_288:0465c21_12"
    },
    {
        "source_sentence": "不應分別我能住法界乃至不思議界。",
        "translation": "They shouldn't discriminate between the self that can abide in the Dharma realm and even the inconceivable realm.",
        "source": "T06n0220_288:0465c23_13"
    },
    {
        "source_sentence": "若行苦聖諦時，不應分別我能住苦聖諦；",
        "translation": "When they practice the noble truth of suffering, they should not discriminate self and be able to abide in the noble truth of suffering.",
        "source": "T06n0220_288:0465c24_14"
    },
    {
        "source_sentence": "若行集、滅、道聖諦時，不應分別我能住集、滅、道聖諦。",
        "translation": "If they practice the noble truths of arising, ceasing, and the path, they shouldn't discriminate between self and what can abide in the noble truths of arising, ceasing, and the path.",
        "source": "T06n0220_288:0465c25_15"
    },
    {
        "source_sentence": "若行四靜慮時，不應分別我能修四靜慮；",
        "translation": "When practicing the four forms of meditation, one should not discriminate self and be able to practice the four forms of meditation.",
        "source": "T06n0220_288:0465c26_16"
    },
    {
        "source_sentence": "若行四無量、四無色定時，不應分別我能修四無量、四無色定。",
        "translation": "If you practice the four immeasurable and four formless concentrations, you shouldn't discriminate between the four immeasurable and four formless concentrations that I can cultivate.",
        "source": "T06n0220_288:0465c27_17"
    },
    {
        "source_sentence": "若行八解脫時，不應分別我能修八解脫；",
        "translation": "When one practices the eight liberations, one should not discriminate self and be able to cultivate the eight liberations.",
        "source": "T06n0220_288:0465c28_18"
    },
    {
        "source_sentence": "若行八勝處、九次第定、十遍處時，不應分別我能修八勝處、九次第定、十遍處。",
        "translation": "If someone practices the eight abodes of excellence, nine graduated concentrations, and ten universal abodes, they shouldn't discriminate between the eight abodes of excellence, nine graduated concentrations, and ten universal abodes that I can cultiva",
        "source": "T06n0220_288:0465c29_19"
    },
    {
        "source_sentence": "若行四念住時，不應分別我能修四念住；",
        "translation": "When one practices the four foundations of mindfulness, one should not discriminate self and be able to cultivate the four foundations of mindfulness.",
        "source": "T06n0220_288:0466a02_20"
    },
    {
        "source_sentence": "若行四正斷、四神足、五根、五力、七等覺支、八聖道支時，不應分別我能修四正斷乃至八聖道支。",
        "translation": "When he practices the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path, he shouldn't discriminate",
        "source": "T06n0220_288:0466a03_21"
    },
    {
        "source_sentence": "若行空解脫門時，不應分別我能修空解脫門；",
        "translation": "When one practices the liberation gate of emptiness, one should not discriminate self and be able to cultivate the liberation gate of emptiness.",
        "source": "T06n0220_288:0466a05_22"
    },
    {
        "source_sentence": "若行無相、無願解脫門時，不應分別我能修無相、無願解脫門。",
        "translation": "If someone practices the liberation gate of marklessness and wishlessness, they shouldn't discriminate between self and the liberation gate of marklessness and wishlessness that can be cultivated.",
        "source": "T06n0220_288:0466a06_23"
    },
    {
        "source_sentence": "若行菩薩十地時，不應分別我能修菩薩十地；",
        "translation": "When practicing the ten stages of enlightening beings, one should not discriminate between self and what can be cultivated in the ten stages of enlightening beings.",
        "source": "T06n0220_288:0466a08_0"
    },
    {
        "source_sentence": "若行五眼時，不應分別我能修五眼；",
        "translation": "When they practice the five kinds of vision, they should not discriminate between self and those who can develop the five kinds of vision.",
        "source": "T06n0220_288:0466a09_1"
    },
    {
        "source_sentence": "若行六神通時，不應分別我能修六神通。",
        "translation": "If someone practices the six supernormal powers, they shouldn't discriminate between self and those who can cultivate the six supernormal powers.",
        "source": "T06n0220_288:0466a09_2"
    },
    {
        "source_sentence": "若行佛十力時，不應分別我能修佛十力；",
        "translation": "If someone were to practice the ten powers of buddhahood, they would not discriminate between self and those who can cultivate them.",
        "source": "T06n0220_288:0466a10_3"
    },
    {
        "source_sentence": "若行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法時，",
        "translation": "When he practices the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 unique qualities of buddhahood,",
        "source": "T06n0220_288:0466a11_4"
    },
    {
        "source_sentence": "不應分別我能修四無所畏乃至十八佛不共法。",
        "translation": "You shouldn't discriminate between the four fearlessnesses that I can cultivate and the 18 Buddha-uncommon dharmas.",
        "source": "T06n0220_288:0466a13_5"
    },
    {
        "source_sentence": "若行無忘失法時，不應分別我能修無忘失法；",
        "translation": "When one practices the state of no forgetfulness, one should not discriminate self and be able to cultivate the state of no forgetfulness.",
        "source": "T06n0220_288:0466a14_6"
    },
    {
        "source_sentence": "若行恒住捨性時，不應分別我能修恒住捨性。",
        "translation": "If conditioned forces always abide in the nature of equanimity, they shouldn't discriminate self and cultivate the nature of eternally abiding equanimity.",
        "source": "T06n0220_288:0466a15_7"
    },
    {
        "source_sentence": "若行一切智時，不應分別我能修一切智；",
        "translation": "When one practices omniscience, one should not discriminate the self that cultivates omniscience.",
        "source": "T06n0220_288:0466a16_8"
    },
    {
        "source_sentence": "若行道相智、一切相智時，不應分別我能修道相智、一切相智。",
        "translation": "If someone practices knowledge of the path and knowledge of all characteristics, they shouldn't discriminate between self that cultivates knowledge of the path and knowledge of all characteristics.",
        "source": "T06n0220_288:0466a17_9"
    },
    {
        "source_sentence": "若行一切陀羅尼門時，不應分別我能修一切陀羅尼門；",
        "translation": "When one practices all kinds of dhāraṇī teachings, one should not discriminate self and cultivate all kinds of dhāraṇī teachings.",
        "source": "T06n0220_288:0466a18_10"
    },
    {
        "source_sentence": "若行一切三摩地門時，不應分別我能修一切三摩地門。",
        "translation": "When he practices all the approaches to samādhi, he shouldn't discriminate between self and those who can cultivate all the approaches to samādhi.",
        "source": "T06n0220_288:0466a20_11"
    },
    {
        "source_sentence": "若行預流果相似法時，不應分別我能修預流果相似法；",
        "translation": "When one practices the similar principle of the fruit of stream-entry, one should not discriminate self and cultivate the similar principle of the fruit of stream-entry.",
        "source": "T06n0220_288:0466a21_12"
    },
    {
        "source_sentence": "若行一來、不還、阿羅漢果相似法時，不應分別我能修一來、不還、阿羅漢果相似法。",
        "translation": "If someone practices the similar qualities of the once-returner, nonreturner, and arhatship fruits, they shouldn't discriminate between the similar qualities of the once-returner, nonreturner, and arhatship fruits that I can cultiva",
        "source": "T06n0220_288:0466a22_13"
    },
    {
        "source_sentence": "若行獨覺菩提相似法時，不應分別我能修獨覺菩提相似法。",
        "translation": "If someone practices similar dharmas like the enlightenment of the solitary realizer, they shouldn't discriminate between self and those who cultivate similar dharmas like the enlightenment of the solitary realizer.",
        "source": "T06n0220_288:0466a24_14"
    },
    {
        "source_sentence": "若行一切菩薩摩訶薩行時，不應分別我能修一切菩薩摩訶薩行。",
        "translation": "When they practice all the bodhisattva-mahāsattva practices, they shouldn't discriminate between self and those who can cultivate all the bodhisattva-mahāsattva practices.",
        "source": "T06n0220_288:0466a26_0"
    },
    {
        "source_sentence": "若行諸佛無上正等菩提時，不應分別我能修諸佛無上正等菩提。",
        "translation": "If someone were to practice the unsurpassed correct perfect enlightenment of the buddhas, they wouldn't discriminate between self and those who can cultivate the unsurpassed correct perfect enlightenment of the buddhas.",
        "source": "T06n0220_288:0466a27_1"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_288:0466b01_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩於無上正等菩提應如是示現教導勸勵讚喜他有情類，若菩薩摩訶薩於無上正等菩提能如是示現教導勸勵讚喜他有情者，",
        "translation": "“Great enlightening beings should thus show and instruct, encourage, and praise other sentient beings regarding unsurpassed true and complete enlightenment:",
        "source": "T06n0220_288:0466b01_1"
    },
    {
        "source_sentence": "於自無損亦不損他，如諸如來所應許可示現教導勸勵讚喜諸有情故。",
        "translation": "It's because they don't harm themselves and don't harm others, just as the tathāgatas should allow them to show their instruction and encourage and praise sentient beings.",
        "source": "T06n0220_288:0466b04_2"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T06n0220_288:0466b06_3"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等若能如是示現教導勸勵讚喜趣菩薩乘諸有情類，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle can thus show, inspire, encourage, and delight all sentient beings who wish to enter the bodhisattva vehicle.",
        "source": "T06n0220_288:0466b06_4"
    },
    {
        "source_sentence": "便能遠離一切想著。」",
        "translation": "They'll then be able to become free of all conceptual attachments.",
        "source": "T06n0220_288:0466b08_5"
    },
    {
        "source_sentence": "爾時，世尊讚具壽善現言：「善哉！",
        "translation": "It was then that the Bhagavān praised Kauṣṭhila and said, Good!",
        "source": "T06n0220_288:0466b09_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T06n0220_288:0466b09_1"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T06n0220_288:0466b09_2"
    },
    {
        "source_sentence": "汝今善能為諸菩薩說執著相。",
        "translation": "Now, you're good at explaining the characteristic of attachment for bodhisattvas.",
        "source": "T06n0220_288:0466b10_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_288:0466b10_4"
    },
    {
        "source_sentence": "復有此餘微細著相當為汝說，汝應諦聽，極善思惟！」",
        "translation": "Again, there are these other subtle attachments that should be explained for you, so listen closely and consider them well!",
        "source": "T06n0220_288:0466b10_5"
    },
    {
        "source_sentence": "善現白言：「唯然！",
        "translation": "Sunetra said, Yes!",
        "source": "T06n0220_288:0466b12_6"
    },
    {
        "source_sentence": "願說！",
        "translation": "May it be explained!",
        "source": "T06n0220_288:0466b12_7"
    },
    {
        "source_sentence": "我等樂聞。」",
        "translation": "We're happy to hear it.",
        "source": "T06n0220_288:0466b12_8"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_288:0466b12_9"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等欲趣無上正等菩提，若於如來、應、正等覺取相憶念，",
        "translation": "Good men and good women who live in the bodhisattva vehicle want to attain unsurpassed perfect enlightenment, but if they are mindful of the characteristics of the Tathāgata, Arhat, Perfectly Enlightened One,",
        "source": "T06n0220_288:0466b13_10"
    },
    {
        "source_sentence": "皆是執著；",
        "translation": "They are all attachment.",
        "source": "T06n0220_288:0466b15_0"
    },
    {
        "source_sentence": "若於過去、未來、現在一切如來、應、正等覺無著功德，從初發心乃至法住所有善根取相憶念，",
        "translation": "“If one remembers the markless virtues of all buddhas of past, future, and present, from the first aspiration for enlightenment up to the abode of enlightenment, which are roots of goodness,",
        "source": "T06n0220_288:0466b15_1"
    },
    {
        "source_sentence": "既憶念已，迴向無上正等菩提，如是一切取相憶念皆名執著；",
        "translation": "Having thought of it, they dedicate themselves to unsurpassed true and complete enlightenment. All such thoughts of grasping characteristics are all called clinging.",
        "source": "T06n0220_288:0466b17_2"
    },
    {
        "source_sentence": "若於一切如來弟子及餘有情所修善法取相憶念迴向無上正等菩提，如是一切亦名執著。",
        "translation": "If all the Tathāgata's disciples and other sentient beings cultivate good qualities that are apprehended, remembered, and directed back to unsurpassed perfect enlightenment, such things are also called attachment.",
        "source": "T06n0220_288:0466b18_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_288:0466b20_4"
    },
    {
        "source_sentence": "一切如來、應、正等覺所有無著功德善根不應取相而憶念故，於佛弟子及餘有情所有善法不應取相而憶念故，",
        "translation": "It's because all the unattached virtues and good roots of all buddhas, arhats, and fully awakened ones shouldn't be remembered without grasping their characteristics, and they shouldn't remember the characteristics of",
        "source": "T06n0220_288:0466b21_5"
    },
    {
        "source_sentence": "諸取相者皆虛妄故。」",
        "translation": "Those who grasp characteristics are all false.",
        "source": "T06n0220_288:0466b23_6"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_288:0466b25_0"
    },
    {
        "source_sentence": "如是般若波羅蜜多最為甚深。」",
        "translation": "Thus, the perfection of wisdom is the most profound.",
        "source": "T06n0220_288:0466b25_1"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T06n0220_288:0466b26_2"
    },
    {
        "source_sentence": "以一切法本性離故。」",
        "translation": "It's because the original nature of all dharmas is free.",
        "source": "T06n0220_288:0466b26_3"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_288:0466b27_4"
    },
    {
        "source_sentence": "如是般若波羅蜜多皆應禮敬。」",
        "translation": "Such is the prajñāpāramitā that should be venerated.",
        "source": "T06n0220_288:0466b27_5"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T06n0220_288:0466b28_6"
    },
    {
        "source_sentence": "功德多故，然此般若波羅蜜多無造無作，無能覺者。」",
        "translation": "Because its merits are numerous, however, this prajñāpāramitā has no creation or non-creation, and there's no one who can awaken it.",
        "source": "T06n0220_288:0466b28_7"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_288:0466b29_8"
    },
    {
        "source_sentence": "一切法性皆難可覺。」",
        "translation": "The nature of all dharmas is difficult to perceive.",
        "source": "T06n0220_288:0466c01_9"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T06n0220_288:0466c02_0"
    },
    {
        "source_sentence": "以一切法一性非二。",
        "translation": "It's because all dharmas are one in nature and not two.",
        "source": "T06n0220_288:0466c02_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_288:0466c02_2"
    },
    {
        "source_sentence": "當知諸法一性即是無性，諸法無性即是一性，如是諸法一性無性、無造無作，",
        "translation": "You should know that the one essence of all things is non-essence, and the absence of all things is one essence. In this way, the one essence of all things is non-essence; there is neither created nor uncreated.",
        "source": "T06n0220_288:0466c02_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩能如實知諸所有法一性無性、無造無作，則能遠離一切執著。」",
        "translation": "If bodhisattvas, mahāsattvas can truly know that all dharmas are one-natured, without nature and without created or created, then they'll be able to be free of all attachments.",
        "source": "T06n0220_288:0466c04_4"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_288:0466c06_5"
    },
    {
        "source_sentence": "如是般若波羅蜜多難可覺了。」",
        "translation": "Thus, the perfection of wisdom is difficult to perceive.",
        "source": "T06n0220_288:0466c07_0"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T06n0220_288:0466c07_1"
    },
    {
        "source_sentence": "由此般若波羅蜜多無能見者、無能聞者、無能覺者、無能知者，離證相故。」",
        "translation": "As a result, the prajñāpāramitā has no one who can see, no one who can hear, no one who can awaken, and no one who can know, and it's free of the mark of realization.",
        "source": "T06n0220_288:0466c07_2"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_288:0466c09_3"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可思議。」",
        "translation": "Thus, the perfection of wisdom is unfathomable.",
        "source": "T06n0220_288:0466c10_4"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T06n0220_288:0466c10_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_288:0466c11_6"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以心知，離心相故。",
        "translation": "Thus, the prajñāpāramitā can't be known by the mind because it's free of the characteristics of the mind.",
        "source": "T06n0220_288:0466c11_7"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以色知，離色相故；",
        "translation": "The perfection of wisdom in this way cannot be known by matter: because it is free from the characteristic marks of matter.",
        "source": "T06n0220_288:0466c12_8"
    },
    {
        "source_sentence": "不可以受、想、行、識知，離受、想、行、識相故。",
        "translation": "They can't know feeling, perception, volition, and consciousness because they're free of the characteristics of feeling, perception, volition, and consciousness.",
        "source": "T06n0220_288:0466c13_9"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以眼處知，離眼處相故；",
        "translation": "The perfection of wisdom in this way cannot be known by the eye: because it is free from the characteristic marks of the sphere of vision.",
        "source": "T06n0220_288:0466c14_10"
    },
    {
        "source_sentence": "不可以耳、鼻、舌、身、意處知，離耳、鼻、舌、身、意處相故。",
        "translation": "They can't know the sense-fields of ear, nose, tongue, body, and mind because they're free of the characteristics of the sense-fields of ear, nose, tongue, body, and mind.",
        "source": "T06n0220_288:0466c15_11"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以色處知，離色處相故；",
        "translation": "The perfection of wisdom in this way cannot be known regarding the sphere of form: because it is free from the characteristic marks of the sphere of form.",
        "source": "T06n0220_288:0466c16_12"
    },
    {
        "source_sentence": "不可以聲、香、味、觸、法處知，離聲、香、味、觸、法處相故。",
        "translation": "They can't know the sense-fields of sound, odor, taste, touch, and dharmas because they're free of the characteristics of the sense-fields of sound, smell, taste, touch, and dharmas.",
        "source": "T06n0220_288:0466c17_13"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以眼界知，離眼界相故；",
        "translation": "The perfection of wisdom in this way cannot be known by the eye realm: because it is free from the characteristic marks of the eye realm.",
        "source": "T06n0220_288:0466c18_14"
    },
    {
        "source_sentence": "不可以色界、眼識界及眼觸、眼觸為緣所生諸受知，離色界乃至眼觸為緣所生諸受相故。",
        "translation": "You can't know the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition apart from the form realm or even the characteristics of sensations that arise from eye contact as a",
        "source": "T06n0220_288:0466c19_15"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以耳界知，離耳界相故；",
        "translation": "The perfection of wisdom in this way cannot be known by the ear realm: because it is free from the characteristic marks of the ear realm.",
        "source": "T06n0220_288:0466c21_16"
    },
    {
        "source_sentence": "不可以聲界、耳識界及耳觸、耳觸為緣所生諸受知，離聲界乃至耳觸為緣所生諸受相故。",
        "translation": "It's not possible to know the sound element, the ear consciousness element, and the sensations that arise from ear contact and ear contact as a condition can be known apart from the sound element or even the sensations that arise from ear contact as a condition.",
        "source": "T06n0220_288:0466c23_17"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以鼻界知，離鼻界相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the element nose, because it is free from the characteristics of the element nose.",
        "source": "T06n0220_288:0466c25_18"
    },
    {
        "source_sentence": "不可以香界、鼻識界及鼻觸、鼻觸為緣所生諸受知，離香界乃至鼻觸為緣所生諸受相故。",
        "translation": "It's not possible to know the sense element of fragrance, the sense element of nose consciousness, and the sensations that arise from nasal contact and nasal contact as a condition apart from the sense element of fragrance or even the characteristic",
        "source": "T06n0220_288:0466c26_19"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以舌界知，離舌界相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the realm of tongue: because it is free from the characteristic marks of the realm of tongue.",
        "source": "T06n0220_288:0466c28_20"
    },
    {
        "source_sentence": "不可以味界、舌識界及舌觸、舌觸為緣所生諸受知，離味界乃至舌觸為緣所生諸受相故。",
        "translation": "You cannot know the taste realm, the tongue consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition can't be known, because they are free of the taste realm and even the characteristics of",
        "source": "T06n0220_288:0466c29_21"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以身界知，離身界相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the body realm: because it is free from the characteristic marks of the body realm.",
        "source": "T06n0220_288:0467a02_22"
    },
    {
        "source_sentence": "不可以觸界、身識界及身觸、身觸為緣所生諸受知，離觸界乃至身觸為緣所生諸受相故。",
        "translation": "It's not possible to know the sense element of touch, the body consciousness element, and the sensations that arise from body contact and body contact as a condition apart from the sense element of touch or even the characteristics of sensations that arise from body",
        "source": "T06n0220_288:0467a03_23"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以意界知，離意界相故；",
        "translation": "In this way, the perfection of wisdom cannot be known in relation to the mental element: because it is free from the characteristic marks of the mental element.",
        "source": "T06n0220_288:0467a05_24"
    },
    {
        "source_sentence": "不可以法界、意識界及意觸、意觸為緣所生諸受知，離法界乃至意觸為緣所生諸受相故。",
        "translation": "You can't know the feelings that arise from the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition apart from the Dharma realm or even the characteristics of feelings that a",
        "source": "T06n0220_288:0467a06_25"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以地界知，離地界相故；",
        "translation": "The perfection of wisdom in this way cannot be known as earth element: because it is free from the characteristic marks of earth element.",
        "source": "T06n0220_288:0467a08_26"
    },
    {
        "source_sentence": "不可以水、火、風、空、識界知，離水、火、風、空、識界相故。",
        "translation": "They can't know the elements of water, fire, wind, space, and consciousness because they're free of the characteristics of the elements of water, fire, wind, space, and consciousness.",
        "source": "T06n0220_288:0467a09_27"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以無明知，離無明相故；",
        "translation": "The perfection of wisdom in this way cannot be known by ignorance: because it is free from the characteristic marks of ignorance.",
        "source": "T06n0220_288:0467a11_28"
    },
    {
        "source_sentence": "不可以行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱知，",
        "translation": "You should not know form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, grasping, existence, birth, old age, sorrow, pain, and vexation.",
        "source": "T06n0220_288:0467a12_29"
    },
    {
        "source_sentence": "離行乃至老死愁歎苦憂惱相故。",
        "translation": "It's because it's free of the characteristic of grief, pain, sorrow, and vexation from practice up to old age and death.",
        "source": "T06n0220_288:0467a13_30"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以布施波羅蜜多知，離布施波羅蜜多相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the perfection of giving, because it is free from the characteristics of the perfection of giving.",
        "source": "T06n0220_288:0467a15_0"
    },
    {
        "source_sentence": "不可以淨戒、安忍、精進、靜慮、般若波羅蜜多知，離淨戒乃至般若波羅蜜多相故。",
        "translation": "It's because they can't know the characteristics of pure morality, patience, effort, meditation, and prajñāpāramitā apart from the characteristics of pure morality or even the characteristics of the prajñāpāramitā",
        "source": "T06n0220_288:0467a16_1"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以內空知，離內空相故；",
        "translation": "In this way, the perfection of wisdom cannot be known as internal emptiness: because it is free from the characteristic marks of internal emptiness.",
        "source": "T06n0220_288:0467a18_2"
    },
    {
        "source_sentence": "不可以外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空知，",
        "translation": "They cannot know external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of",
        "source": "T06n0220_288:0467a19_3"
    },
    {
        "source_sentence": "離外空乃至無性自性空相故。",
        "translation": "It's because it's free of external emptiness or even the characteristic of emptiness that has no self-nature as emptiness.",
        "source": "T06n0220_288:0467a23_4"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以真如知，離真如相故；",
        "translation": "In this way the perfection of wisdom cannot be known as such, because it is apart from the characteristic marks of suchness.",
        "source": "T06n0220_288:0467a23_5"
    },
    {
        "source_sentence": "不可以法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界知，",
        "translation": "They cannot know the realm of reality, the essence of reality, the nature of reality, non-falsity, unchanging and dissimilarity, equality, freedom from arising, legality, the abiding of phenomena, reality, space",
        "source": "T06n0220_288:0467a24_6"
    },
    {
        "source_sentence": "離法界乃至不思議界相故。",
        "translation": "It's because they're free of the Dharma realm and even inconceivable characteristics of the realm.",
        "source": "T06n0220_288:0467a26_7"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以苦聖諦知，離苦聖諦相故；",
        "translation": "In this way, the perfection of wisdom cannot be known as the noble truth of frustration because it is free from the characteristics of the noble truth of frustration.",
        "source": "T06n0220_288:0467a27_8"
    },
    {
        "source_sentence": "不可以集、滅、道聖諦知，離集、滅、道聖諦相故。",
        "translation": "They cannot be known of the noble truths of arising, cessation, and the path because they are free of the characteristics of the noble truths of arising, cessation, and the path.",
        "source": "T06n0220_288:0467a28_9"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以四靜慮知，離四靜慮相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the four forms of meditative absorption because it is free from the characteristics of the four forms of meditative absorption.",
        "source": "T06n0220_288:0467a29_10"
    },
    {
        "source_sentence": "不可以四無量、四無色定知，離四無量、四無色定相故。",
        "translation": "They cannot be known of the four immeasurable concentrations or of the four formless concentrations, because they are separated from the characteristics of the four immeasurable and four formless concentrations.",
        "source": "T06n0220_288:0467b02_0"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以八解脫知，離八解脫相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the eight liberations: because it is free from the characteristic marks of the eight liberations.",
        "source": "T06n0220_288:0467b03_1"
    },
    {
        "source_sentence": "不可以八勝處、九次第定、十遍處知，離八勝處、九次第定、十遍處相故。",
        "translation": "They can't know the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes because they're free of the characteristics of the eight abodes of excellence, the nine graduated concentrations, and the ten",
        "source": "T06n0220_288:0467b04_2"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以四念住知，離四念住相故；",
        "translation": "In this way, the perfection of wisdom cannot be known as abiding in four moments of thought: because it is free from the characteristics of the four moments of thought.",
        "source": "T06n0220_288:0467b06_3"
    },
    {
        "source_sentence": "不可以四正斷、四神足、五根、五力、七等覺支、八聖道支知，離四正斷乃至八聖道支相故。",
        "translation": "They can't know the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path because they're free of the",
        "source": "T06n0220_288:0467b07_4"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以空解脫門知，離空解脫門相故；",
        "translation": "In this way, the perfection of wisdom cannot be known through the liberation gate of emptiness because it is free from the characteristics of the liberation gate of emptiness.",
        "source": "T06n0220_288:0467b09_5"
    },
    {
        "source_sentence": "不可以無相、無願解脫門知，離無相、無願解脫門相故。",
        "translation": "They can't know the liberation gate of marklessness and wishlessness because they're free of the markless and wishless liberation gates.",
        "source": "T06n0220_288:0467b10_6"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以菩薩十地知，離菩薩十地相故。",
        "translation": "Thus, the prajñāpāramitā can't be known as the bodhisattva's ten stages because it's free of the characteristics of the bodhisattva's ten stages.",
        "source": "T06n0220_288:0467b11_7"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以五眼知，離五眼相故；",
        "translation": "The perfection of wisdom in this way cannot be known by the five eyes: because it is free from the characteristic marks of the five eyes.",
        "source": "T06n0220_288:0467b14_0"
    },
    {
        "source_sentence": "不可以六神通知，離六神通相故。",
        "translation": "They can't be notified by the six supernormal powers because they're free of the characteristics of the six supernormal powers.",
        "source": "T06n0220_288:0467b15_1"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以佛十力知，離佛十力相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the ten powers of Buddha, because it is separate from the characteristics of the ten powers of Buddha.",
        "source": "T06n0220_288:0467b15_2"
    },
    {
        "source_sentence": "不可以四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法知，",
        "translation": "They cannot know the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_288:0467b17_3"
    },
    {
        "source_sentence": "離四無所畏乃至十八佛不共法相故。",
        "translation": "It's because they're free of the four fearlessnesses and even the distinctive characteristics of the 18 buddhas.",
        "source": "T06n0220_288:0467b18_4"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以無忘失法知，離無忘失法相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the state of nonforgetfulness, because it is free from the characteristics of the state of nonforgetfulness.",
        "source": "T06n0220_288:0467b19_5"
    },
    {
        "source_sentence": "不可以恒住捨性知，離恒住捨性相故。",
        "translation": "It is not possible to know the nature of equanimity as eternally abiding, because it is free from the characteristics of the nature and characteristics of eternally abiding equanimity.",
        "source": "T06n0220_288:0467b20_6"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以一切智知，離一切智相故；",
        "translation": "The perfection of wisdom in this way cannot be known by omniscience: because it is free from the characteristic marks of omniscience.",
        "source": "T06n0220_288:0467b21_7"
    },
    {
        "source_sentence": "不可以道相智、一切相智知，離道相智、一切相智相故。",
        "translation": "They cannot be known by knowledge of the path and by knowledge of all characteristics: because they are free from knowledge of the path and from knowledge of all characteristics.",
        "source": "T06n0220_288:0467b23_0"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以一切陀羅尼門知，離一切陀羅尼門相故；",
        "translation": "In this way, the perfection of wisdom cannot be known by means of all dhāraṇī-means: because it is free from all characteristics of all dhāraṇī-means.",
        "source": "T06n0220_288:0467b24_1"
    },
    {
        "source_sentence": "不可以一切三摩地門知，離一切三摩地門相故。",
        "translation": "They can't know all the approaches to samādhi because they're free of all the characteristics of the approaches to samādhi.",
        "source": "T06n0220_288:0467b25_2"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以預流果知，離預流果相故；",
        "translation": "The perfection of wisdom in this way cannot be known as the fruit of stream-winner, because it is free from the characteristics of the fruit of stream-winner.",
        "source": "T06n0220_288:0467b27_0"
    },
    {
        "source_sentence": "不可以一來、不還、阿羅漢果知，離一來、不還、阿羅漢果相故。",
        "translation": "You can't know the once-returner, nonreturner, or arhatship fruit because you're free of the characteristics of the once-returner, nonreturner, and arhatship fruit.",
        "source": "T06n0220_288:0467b28_1"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以獨覺菩提知，離獨覺菩提相故。",
        "translation": "Thus, the perfection of prajñāpāramitā can't be known as enlightenment by a solitary realizer because it's free of the characteristic of enlightenment of a solitary realizer.",
        "source": "T06n0220_288:0467b29_2"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以一切菩薩摩訶薩行知，離一切菩薩摩訶薩行相故。",
        "translation": "Thus, the perfection of prajñāpāramitā can't be known for all bodhisattva-mahāsattva practices because it's free of all bodhisattva-mahāsattva practices.",
        "source": "T06n0220_288:0467c01_3"
    },
    {
        "source_sentence": "如是般若波羅蜜多不可以諸佛無上正等菩提知，離諸佛無上正等菩提相故。」",
        "translation": "Thus, the perfection of prajñāpāramitā can't be known by the unsurpassed correct enlightenment of the buddhas because it's free of the mark of the unsurpassed correct enlightenment of the buddhas.",
        "source": "T06n0220_288:0467c03_4"
    },
    {
        "source_sentence": "◎◎爾時，具壽善現復白佛言：「世尊！",
        "translation": "At that point, Kauṣṭhila Shancheng again said to the Buddha, Bhagavān!",
        "source": "T06n0220_288:0467c05_5"
    },
    {
        "source_sentence": "如是般若波羅蜜多無所造作。」",
        "translation": "Thus, the perfection of wisdom has nothing to create.",
        "source": "T06n0220_288:0467c06_6"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T06n0220_288:0467c07_7"
    },
    {
        "source_sentence": "以諸作者不可得故。",
        "translation": "It's because the authors are unobtainable.",
        "source": "T06n0220_288:0467c07_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c08_9"
    },
    {
        "source_sentence": "色不可得故作者不可得，受、想、行、識不可得故作者不可得。",
        "translation": "Because form is unobtainable, the author is unobtainable, and because feeling, perception, volition, and consciousness are unobtainable, the author is unobtainable.",
        "source": "T06n0220_288:0467c08_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c09_11"
    },
    {
        "source_sentence": "眼處不可得故作者不可得，耳、鼻、舌、身、意處不可得故作者不可得。",
        "translation": "The author is unobtainable because the sense-field of the eye is unobtainable, and the author is unobtainable because the ear, nose, tongue, body, and mind sense-fields are unobtainable.",
        "source": "T06n0220_288:0467c09_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c11_13"
    },
    {
        "source_sentence": "色處不可得故作者不可得，聲、香、味、觸、法處不可得故作者不可得。",
        "translation": "Because the form realm is unobtainable, the author is unobtainable, and because the sound, smell, taste, touch, and dharma realms are unobtainable, the author is unobtainable.",
        "source": "T06n0220_288:0467c11_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c13_0"
    },
    {
        "source_sentence": "眼界不可得故作者不可得，色界、眼識界及眼觸、眼觸為緣所生諸受不可得故作者不可得。",
        "translation": "Because the eye realm is unobtainable, the author is unobtainable, and because the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are unobtainable, the",
        "source": "T06n0220_288:0467c13_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c15_2"
    },
    {
        "source_sentence": "耳界不可得故作者不可得，聲界、耳識界及耳觸、耳觸為緣所生諸受不可得故作者不可得。",
        "translation": "The author is unobtainable because the ear realm is unobtainable, and the author is unobtainable because the author of the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as",
        "source": "T06n0220_288:0467c15_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c17_4"
    },
    {
        "source_sentence": "鼻界不可得故作者不可得，香界、鼻識界及鼻觸、鼻觸為緣所生諸受不可得故作者不可得。",
        "translation": "The author is unobtainable because the nasal realm is unobtainable, and the author is unobtainable because the author of the author is unobtainable in the sense realm of fragrance, the nasal consciousness realm,",
        "source": "T06n0220_288:0467c17_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c19_6"
    },
    {
        "source_sentence": "舌界不可得故作者不可得，味界、舌識界及舌觸、舌觸為緣所生諸受不可得故作者不可得。",
        "translation": "The author is unobtainable because the tongue realm is unobtainable, and the author is unobtainable because the author of the taste realm, the tongue-consciousness realm, and the sensations that arise from tongue contact and",
        "source": "T06n0220_288:0467c19_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c21_8"
    },
    {
        "source_sentence": "身界不可得故作者不可得，觸界、身識界及身觸、身觸為緣所生諸受不可得故作者不可得。",
        "translation": "The author is unobtainable because the body realm is unobtainable, and the author is unobtainable because the author of the contact realm, the body-consciousness realm, and the sensations that arise from body contact and body contact as",
        "source": "T06n0220_288:0467c22_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c24_1"
    },
    {
        "source_sentence": "意界不可得故作者不可得，法界、意識界及意觸、意觸為緣所生諸受不可得故作者不可得。",
        "translation": "The author is unobtainable because the mind realm is unobtainable, and the author is unobtainable because the author of the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a",
        "source": "T06n0220_288:0467c24_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c26_3"
    },
    {
        "source_sentence": "地界不可得故作者不可得，水、火、風、空、識界不可得故作者不可得。",
        "translation": "The author is unobtainable because the earth realm is unobtainable, and the author is unobtainable because the water, fire, wind, air, space, and consciousness realms are unobtainable.",
        "source": "T06n0220_288:0467c26_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0467c27_5"
    },
    {
        "source_sentence": "無明不可得故作者不可得，行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱不可得故作者不可得。",
        "translation": "The author is unobtainable because nescience is unobtainable, and the author is unobtainable because form, consciousness, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehen",
        "source": "T06n0220_288:0467c28_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a02_0"
    },
    {
        "source_sentence": "布施波羅蜜多不可得故作者不可得，淨戒、安忍、精進、靜慮、般若波羅蜜多不可得故作者不可得。",
        "translation": "The author is unobtainable because the author of the perfection of generosity is unobtainable, and the author is unobtainable because the author of the perfections of pure morality, patience, effort, meditation, and wisdom are unobtainable.",
        "source": "T06n0220_288:0468a02_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a04_2"
    },
    {
        "source_sentence": "內空不可得故作者不可得，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空不可得故作者不可得。",
        "translation": "The author is unobtainable because internal emptiness is unobtainable, and the author is unobtainable because external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness",
        "source": "T06n0220_288:0468a04_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a08_4"
    },
    {
        "source_sentence": "真如不可得故作者不可得，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界不可得故作者不可得。",
        "translation": "The author is unobtainable because the true nature of reality is unobtainable, and the author is unobtainable because the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from ar",
        "source": "T06n0220_288:0468a09_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a11_1"
    },
    {
        "source_sentence": "四靜慮不可得故作者不可得，四無量、四無色定不可得故作者不可得。",
        "translation": "The author is unobtainable because the four meditations are unobtainable, and the author is unobtainable because the author of the four immeasurable and four formless concentrations are unobtainable.",
        "source": "T06n0220_288:0468a12_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a13_3"
    },
    {
        "source_sentence": "八解脫不可得故作者不可得，八勝處、九次第定、十遍處不可得故作者不可得。",
        "translation": "The author is unobtainable because the eight liberations are unobtainable, and the author is unobtainable because the author of the eight abodes of excellence, nine graduated concentrations, and ten universal abodes are unobtainable.",
        "source": "T06n0220_288:0468a13_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a15_5"
    },
    {
        "source_sentence": "四念住不可得故作者不可得，四正斷、四神足、五根、五力、七等覺支、八聖道支不可得故作者不可得。",
        "translation": "The author is unobtainable because the four abodes of mindfulness are unobtainable, and the author is unobtainable because the fourfold correctly eliminated, four miraculous powers, five faculties, five powers, seven factors of virtual",
        "source": "T06n0220_288:0468a15_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a18_7"
    },
    {
        "source_sentence": "空解脫門不可得故作者不可得，無相、無願解脫門不可得故作者不可得。",
        "translation": "The author is unobtainable because the gate of liberation through emptiness is unobtainable, and the author is unobtainable because the door of liberation through signlessness and wishlessness is unobtainable.",
        "source": "T06n0220_288:0468a18_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a19_9"
    },
    {
        "source_sentence": "菩薩十地不可得故作者不可得。",
        "translation": "Because the bodhisattva's ten stages are unobtainable, the author is unobtainable.",
        "source": "T06n0220_288:0468a20_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a21_0"
    },
    {
        "source_sentence": "五眼不可得故作者不可得，六神通不可得故作者不可得。",
        "translation": "The author is unobtainable because the five eyes are unobtainable, and the author is unobtainable because the author of the six supernormal powers is unobtainable.",
        "source": "T06n0220_288:0468a21_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a22_2"
    },
    {
        "source_sentence": "佛十力不可得故作者不可得，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法不可得故作者不可得。",
        "translation": "The author is unobtainable because the Buddha's ten powers are unobtainable, and the author is unobtainable because the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great pity, great",
        "source": "T06n0220_288:0468a22_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a25_4"
    },
    {
        "source_sentence": "無忘失法不可得故作者不可得，恒住捨性不可得故作者不可得。",
        "translation": "The author is unobtainable because the dharmas without forgetfulness are unobtainable, and the author is unobtainable because the eternally abiding nature of equanimity is unobtainable.",
        "source": "T06n0220_288:0468a25_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a26_6"
    },
    {
        "source_sentence": "一切智不可得故作者不可得，道相智、一切相智不可得故作者不可得。",
        "translation": "Because omniscience is unobtainable, authorship is unobtainable, and because knowledge of the path and knowledge of all characteristics are unobtainable, authorship is unobtainable.",
        "source": "T06n0220_288:0468a26_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468a28_8"
    },
    {
        "source_sentence": "一切陀羅尼門不可得故作者不可得，一切三摩地門不可得故作者不可得。",
        "translation": "The author is unobtainable because all dhāraṇī teachings are unobtainable, and the author is unobtainable because all samādhi teachings are unobtainable.",
        "source": "T06n0220_288:0468a28_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468b02_0"
    },
    {
        "source_sentence": "預流果不可得故作者不可得，一來、不還、阿羅漢果不可得故作者不可得。",
        "translation": "The author is unobtainable because the fruit of pre-flow is unobtainable, and the author is unobtainable because the once-returner, nonreturner, and arhatship fruits are unobtainable.",
        "source": "T06n0220_288:0468b02_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468b03_2"
    },
    {
        "source_sentence": "獨覺菩提不可得故作者不可得。",
        "translation": "Because the author of the solitary realizer's enlightenment is unobtainable, the author is unobtainable.",
        "source": "T06n0220_288:0468b03_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468b04_4"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行不可得故作者不可得。",
        "translation": "All bodhisattva-mahāsattva practices are unobtainable, so the author is unobtainable.",
        "source": "T06n0220_288:0468b04_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468b05_6"
    },
    {
        "source_sentence": "諸佛無上正等菩提不可得故作者不可得。",
        "translation": "The buddhas' unsurpassed correct perfect enlightenment is unobtainable, so the author is unobtainable.",
        "source": "T06n0220_288:0468b05_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_288:0468b06_8"
    },
    {
        "source_sentence": "由諸作者及色等法不可得故，如是般若波羅蜜多無所造作。」",
        "translation": "Because the author and form and other dharmas are unobtainable, such prajñāpāramitā doesn't create anything.",
        "source": "T06n0220_288:0468b07_9"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百八十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2, Volume 28",
        "source": "T06n0220_288:0468b09_0"
    }
]