[
    {
        "source_sentence": "大般若波羅蜜多經卷第三百七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 37",
        "source": "T06n0220_378:0950c04_0"
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T06n0220_378:0950c05_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_378:0950c07_0"
    },
    {
        "source_sentence": "初分無相無得品第六十六之六",
        "translation": "sixty-sixth and sixteenth parts of the chapter on the absence of marklessness in the first part",
        "source": "T06n0220_378:0950c08_0"
    },
    {
        "source_sentence": "「不執著無忘失法，不執著恒住捨性；",
        "translation": "“Great enlightening beings do not cling to the principle of nonforgetfulness, and they do not cling to the nature of eternally abiding equanimity.",
        "source": "T06n0220_378:0950c09_0"
    },
    {
        "source_sentence": "不執著一切智，不執著道相智、一切相智；",
        "translation": "They do not cling to omniscience; they do not cling to knowledge of the path or knowledge of all characteristics.",
        "source": "T06n0220_378:0950c09_1"
    },
    {
        "source_sentence": "不執著預流果，不執著一來、不還、阿羅漢果、獨覺菩提；",
        "translation": "They do not cling to the state of stream-winner, they do not cling to the states of once-returning, nonreturning, arhatship, or enlightenment of individual illuminates.",
        "source": "T06n0220_378:0950c10_2"
    },
    {
        "source_sentence": "不執著一切菩薩摩訶薩行，不執著諸佛無上正等菩提。",
        "translation": "They don't cling to all the bodhisattva-mahāsattva practices and don't cling to the unsurpassed perfect enlightenment of the buddhas.",
        "source": "T06n0220_378:0950c12_0"
    },
    {
        "source_sentence": "「是菩薩摩訶薩行無性為自性甚深般若波羅蜜多時，能圓滿菩薩道，謂能圓滿布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "“When this bodhisattva Mahāsattva practices the profound prajñāpāramitā of the absence of essence as its own nature, he can perfect the bodhisattva path, which is to say that he can perfect generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T06n0220_378:0950c13_1"
    },
    {
        "source_sentence": "亦能圓滿內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They can also perfect internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things",
        "source": "T06n0220_378:0950c16_2"
    },
    {
        "source_sentence": "亦能圓滿真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "They can also perfect suchness, the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging dissimilarity, equality, freedom from arising, legality, the abode of dharmas, reality, space, and inconceivable realms.",
        "source": "T06n0220_378:0950c19_3"
    },
    {
        "source_sentence": "亦能圓滿四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "They can also perfect the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_378:0950c21_4"
    },
    {
        "source_sentence": "亦能圓滿苦、集、滅、道聖諦，亦能圓滿四靜慮、四無量、四無色定，",
        "translation": "They can also perfect the noble truths of suffering, its arising, its cessation, and the path; they can also perfect the four meditations, the four immeasurable concentrations, and the four formless concentrations.",
        "source": "T06n0220_378:0950c23_5"
    },
    {
        "source_sentence": "亦能圓滿八解脫、八勝處、九次第定、十遍處，亦能圓滿一切三摩地門、陀羅尼門，",
        "translation": "He was also able to perfect the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes. He was also able to perfect all the approaches of absorption-samādhi and dhāraṇī teachings.",
        "source": "T06n0220_378:0950c24_6"
    },
    {
        "source_sentence": "亦能圓滿空、無相、無願解脫門，亦能圓滿五眼、六神通，亦能圓滿佛十力、四無所畏、四無礙解、十八佛不共法，",
        "translation": "They can also perfect the liberation gate of emptiness, signlessness, and wishlessness. They can also perfect the five eyes and six supernormal powers. They can also perfect the ten powers, four fearlessnesses, four unhindered understandings, and eighteen unique qualities of buddhas.",
        "source": "T06n0220_378:0950c26_7"
    },
    {
        "source_sentence": "亦能圓滿大慈、大悲、大喜、大捨，亦能圓滿無忘失法、恒住捨性，亦能圓滿一切智、道相智、一切相智，",
        "translation": "They can also perfect great kindness, great compassion, great joy, great equanimity; they can also perfect the state of nonforgetfulness and always abide in the nature of equanimity; they can also perfect omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T06n0220_378:0950c29_0"
    },
    {
        "source_sentence": "亦能圓滿三十二大士相、八十隨好。",
        "translation": "They can also perfect the thirty-two marks and eighty secondary signs of a great being.",
        "source": "T06n0220_378:0951a02_1"
    },
    {
        "source_sentence": "「是菩薩摩訶薩住異熟法菩提道中，復能圓滿布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "“These bodhisattvas and mahāsattvas who abide in the path of enlightenment based on the Dharma as retribution can also perfect generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T06n0220_378:0951a03_2"
    },
    {
        "source_sentence": "亦能圓滿內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They can also perfect internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all things",
        "source": "T06n0220_378:0951a05_3"
    },
    {
        "source_sentence": "亦能圓滿真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "They can also perfect suchness, the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging dissimilarity, equality, freedom from arising, legality, the abode of dharmas, reality, space, and inconceivable realms.",
        "source": "T06n0220_378:0951a08_4"
    },
    {
        "source_sentence": "亦能圓滿四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "They can also perfect the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_378:0951a10_5"
    },
    {
        "source_sentence": "亦能圓滿苦、集、滅、道聖諦，亦能圓滿四靜慮、四無量、四無色定，",
        "translation": "They can also perfect the noble truths of suffering, its arising, its cessation, and the path; they can also perfect the four meditations, the four immeasurable concentrations, and the four formless concentrations.",
        "source": "T06n0220_378:0951a12_6"
    },
    {
        "source_sentence": "亦能圓滿八解脫、八勝處、九次第定、十遍處，亦能圓滿一切三摩地門、陀羅尼門，",
        "translation": "He was also able to perfect the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes. He was also able to perfect all the approaches of absorption-samādhi and dhāraṇī teachings.",
        "source": "T06n0220_378:0951a13_7"
    },
    {
        "source_sentence": "亦能圓滿空、無相、無願解脫門，亦能圓滿五眼、六神通等無量功德。",
        "translation": "They can also perfect the liberation gate of emptiness, signlessness, and wishlessness, and they can also perfect the immeasurable merits of the five eyes, six supernormal powers, and so forth.",
        "source": "T06n0220_378:0951a15_8"
    },
    {
        "source_sentence": "「是菩薩摩訶薩圓滿如是菩提道已，離諸闇障住佛道中，由異熟生勝神通力，",
        "translation": "“Furthermore, these great enlightening beings have perfected the path of enlightenment in such a way that they are freed from all darkness and dwell on the path of buddhahood. Because of their maturation, they produce superior mystic powers:",
        "source": "T06n0220_378:0951a17_0"
    },
    {
        "source_sentence": "方便饒益諸有情類，應以布施而攝受者，即以布施而攝受之；",
        "translation": "Those who benefit sentient beings with skillful means and should be collected by means of generosity—that is to say, they are collected by means of generosity.",
        "source": "T06n0220_378:0951a18_1"
    },
    {
        "source_sentence": "應以淨戒而攝受者，即以淨戒而攝受之；",
        "translation": "Those who should be collected by means of pure precepts are collected by means of pure precepts.",
        "source": "T06n0220_378:0951a20_2"
    },
    {
        "source_sentence": "應以安忍而攝受者，即以安忍而攝受之；",
        "translation": "Those who are to be apprehended by means of patience—that is, they are to be apprehended by means of patience.",
        "source": "T06n0220_378:0951a21_3"
    },
    {
        "source_sentence": "應以精進而攝受者，即以精進而攝受之；",
        "translation": "To those who should be collected by means of energy, they are collected by means of energy.",
        "source": "T06n0220_378:0951a22_4"
    },
    {
        "source_sentence": "應以靜慮而攝受者，即以靜慮而攝受之；",
        "translation": "Those who should be collected by means of meditation are collected by means of concentration.",
        "source": "T06n0220_378:0951a23_0"
    },
    {
        "source_sentence": "應以般若而攝受者，即以般若而攝受之；",
        "translation": "Those who should be collected by means of prajñā are collected by means of prajñā.",
        "source": "T06n0220_378:0951a23_1"
    },
    {
        "source_sentence": "應以解脫而攝受者，即以解脫而攝受之；",
        "translation": "Those who should be collected by means of liberation are collected by means of liberation.",
        "source": "T06n0220_378:0951a24_2"
    },
    {
        "source_sentence": "應以解脫智見而攝受者，即以解脫智見而攝受之；",
        "translation": "Those who should be collected by means of the vision of knowledge of liberation are collected by means of the vision of knowledge of liberation.",
        "source": "T06n0220_378:0951a25_3"
    },
    {
        "source_sentence": "應令安住預流果者，方便令住預流果；",
        "translation": "Those who should be caused to abide in the state of stream-winner are caused by effort to abide in the state of stream-winner.",
        "source": "T06n0220_378:0951a27_0"
    },
    {
        "source_sentence": "應令安住一來果者，方便令住一來果；",
        "translation": "Those who should be caused to abide in the fruit of once-returning are caused by effort to abide in the fruit of once-returning.",
        "source": "T06n0220_378:0951a27_1"
    },
    {
        "source_sentence": "應令安住不還果者，方便令住不還果；",
        "translation": "Those who should be caused to abide peacefully in the fruit of nonreturning are caused by effort to abide in the fruit of nonreturning.",
        "source": "T06n0220_378:0951a28_2"
    },
    {
        "source_sentence": "應令安住阿羅漢果者，方便令住阿羅漢果；",
        "translation": "Those who should be caused to abide peacefully in the state of arhatship are caused by effort to abide in the state of arhatship.",
        "source": "T06n0220_378:0951a29_3"
    },
    {
        "source_sentence": "應令安住獨覺菩提者，方便令住獨覺菩提；",
        "translation": "To those who should be caused to abide peacefully in the enlightenment of self-enlightened ones, he skillfully causes them to abide in the enlightenment of self-enlightened ones.",
        "source": "T06n0220_378:0951b01_4"
    },
    {
        "source_sentence": "應令安住阿耨多羅三藐三菩提者，方便令住阿耨多羅三藐三菩提。",
        "translation": "Those who should be made to abide in unsurpassed, correct, and complete enlightenment will skillfully cause them to abide in unsurpassed, correct, and complete enlightenment.",
        "source": "T06n0220_378:0951b02_5"
    },
    {
        "source_sentence": "「是菩薩摩訶薩能作種種神通變現，欲往殑伽沙等世界，隨意能往；",
        "translation": "“These great enlightening beings can manifest various mystical displays, wishing to go to worlds as numerous as the grains of sand in the Ganges River; they can do so at will.",
        "source": "T06n0220_378:0951b04_6"
    },
    {
        "source_sentence": "欲現所往諸世界中種種珍寶，隨意能現；",
        "translation": "They want to show the various treasures of all worlds they go to, being able to show them as they wish.",
        "source": "T06n0220_378:0951b05_7"
    },
    {
        "source_sentence": "欲令所往諸世界中有情受用眾妙珍寶，隨其所樂皆令滿足。",
        "translation": "They want to cause sentient beings in the worlds where they go to experience all kinds of wonderful treasures, satisfying them according to their desires.",
        "source": "T06n0220_378:0951b06_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩從一世界至一世界，利益安樂無量有情，見諸世界嚴淨之相，",
        "translation": "“These great enlightening beings go from one world to another, benefiting and welcoming infinitely many sentient beings.",
        "source": "T06n0220_378:0951b08_9"
    },
    {
        "source_sentence": "能自攝受隨意所樂嚴淨佛土。",
        "translation": "They can themselves take in the Buddha's land of adornment and purity as they wish.",
        "source": "T06n0220_378:0951b09_10"
    },
    {
        "source_sentence": "譬如他化自在諸天諸有所須眾妙樂具隨心而現，如是菩薩隨意攝受種種嚴淨無量佛土。",
        "translation": "It's like when the gods of other-transformation and self-dependence manifest all the marvelous comforts they need in their minds, and thus the bodhisattva follows them as he wishes to gather various kinds of adornments and pure and immeasurable buddha lands.",
        "source": "T06n0220_378:0951b10_11"
    },
    {
        "source_sentence": "「是菩薩摩訶薩由異熟生布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "“These are the bodhisattva-mahāsattvas who, from their maturation, produce generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T06n0220_378:0951b12_12"
    },
    {
        "source_sentence": "及異熟生諸妙神通，并異熟生菩薩道故，行道相智。",
        "translation": "It's because the marvelous supernormal powers that arise from retribution and the bodhisattva path that arise from retribution give rise to the knowledge of the path.",
        "source": "T06n0220_378:0951b14_13"
    },
    {
        "source_sentence": "由道相智得成熟故，復能證得一切相智，由得此智於一切法無所攝受，",
        "translation": "Because of the maturation of knowledge of the characteristics of the path, they are also able to realize the knowledge of all characteristics. Having attained this knowledge, they do not grasp anything in all dharmas.",
        "source": "T06n0220_378:0951b15_14"
    },
    {
        "source_sentence": "謂不攝受色，不攝受受、想、行、識；",
        "translation": "It means that form is not grasped and feeling, perception, volition, and consciousness are not grasped.",
        "source": "T06n0220_378:0951b17_15"
    },
    {
        "source_sentence": "不攝受眼處，不攝受耳、鼻、舌、身、意處；",
        "translation": "They do not take in the sense-field of the eye; they do not take in the sense-fields of the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_378:0951b17_16"
    },
    {
        "source_sentence": "不攝受色處，不攝受聲、香、味、觸、法處；",
        "translation": "They do not embrace the sphere of form; they do not embrace the sphere of sounds, smells, tastes, tangibles, and dharmas.",
        "source": "T06n0220_378:0951b18_17"
    },
    {
        "source_sentence": "不攝受眼界，不攝受耳、鼻、舌、身、意界；",
        "translation": "They do not embrace the element eye, they do not embrace the elements ear, nose, tongue, body, and mind.",
        "source": "T06n0220_378:0951b19_18"
    },
    {
        "source_sentence": "不攝受色界，不攝受聲、香、味、觸、法界；",
        "translation": "They do not embrace the realm of form; they do not embrace the realm of sound, smell, taste, touch, or dharmas.",
        "source": "T06n0220_378:0951b20_19"
    },
    {
        "source_sentence": "不攝受眼識界，不攝受耳、鼻、舌、身、意識界；",
        "translation": "They do not embrace the element consciousness of the eye, they do not embrace the elements ear, nose, tongue, body, and mind.",
        "source": "T06n0220_378:0951b21_20"
    },
    {
        "source_sentence": "不攝受眼觸，不攝受耳、鼻、舌、身、意觸；",
        "translation": "They do not receive the contact of the eye, and they do not receive the contact of the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_378:0951b22_21"
    },
    {
        "source_sentence": "不攝受眼觸為緣所生諸受，不攝受耳、鼻、舌、身、意觸為緣所生諸受；",
        "translation": "They do not take in the sensations that arise from visual contact as an object; they do not take in the sensations that arise from contact with the ear, nose, tongue, body, or mind as an object.",
        "source": "T06n0220_378:0951b22_22"
    },
    {
        "source_sentence": "不攝受一切善法、非善法、世間法、出世間法、有漏法、無漏法、有為法、無為法、有罪法、無罪法，",
        "translation": "They don’t accept all good qualities, bad qualities, worldly qualities, transmundane qualities, contaminated qualities, uncontaminated qualities, conditioned qualities, unconditioned qualities, sinful qualities, and sinless qualities.",
        "source": "T06n0220_378:0951b24_23"
    },
    {
        "source_sentence": "亦不攝受所證無上正等菩提，亦不攝受一切佛土所受用物，其中有情亦無攝受。",
        "translation": "They don't take in the unsurpassed perfect enlightenment realized, and they don't take in all the things used by buddha lands, and there are no sentient beings among them who take in them.",
        "source": "T06n0220_378:0951b26_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0951b28_25"
    },
    {
        "source_sentence": "是菩薩摩訶薩先不攝受一切法故，於一切法無所得故，為諸有情無倒宣說一切法性無攝受故。",
        "translation": "Because the bodhisattva Mahāsattva didn't previously take in all dharmas, and because he had nothing to gain from all dharmas, he taught sentient beings without error that the nature of all dharmas has no taking in.",
        "source": "T06n0220_378:0951b28_26"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_378:0951c01_27"
    },
    {
        "source_sentence": "菩薩摩訶薩行深般若波羅蜜多時，由離諸相無漏心力，能於一切無相、無覺、無得、無影、無作法中，",
        "translation": "“When great enlightening beings practice the profound prajñāpāramitā, by detachment from signlessness and through the power of uncontaminated mind they are able to do so in all things without signs, without perception, without apprehension, without acquisition, without reflection, and without doing anything.",
        "source": "T06n0220_378:0951c02_0"
    },
    {
        "source_sentence": "圓滿般若波羅蜜多，亦能圓滿諸餘功德。」",
        "translation": "The perfection of the perfection of prajñāpāramitā can also perfect the other virtues.",
        "source": "T06n0220_378:0951c04_1"
    },
    {
        "source_sentence": "初分無雜法義品第六十七之一",
        "translation": "The Sixty-seventh Part of the Chapter on the Meaning of the First Part's Unadulterated Teaching",
        "source": "T06n0220_378:0951c06_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T06n0220_378:0951c07_0"
    },
    {
        "source_sentence": "云何於一切無雜無相自相空法中，能圓滿修布施、淨戒、安忍、精進、靜慮、般若波羅蜜多？",
        "translation": "How can they perfectly cultivate generosity, pure morality, patience, effort, meditation, meditation, and the perfection of wisdom in all the unadulterated formless dharmas of emptiness with their own characteristics?",
        "source": "T06n0220_378:0951c07_1"
    },
    {
        "source_sentence": "云何於一切無漏無差別法中，施設如是諸法差別及可了知？",
        "translation": "How do you posit such distinctions and knowables in all the uncontaminated, undifferentiated dharmas?",
        "source": "T06n0220_378:0951c09_2"
    },
    {
        "source_sentence": "云何於般若波羅蜜多中，攝受一切布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "How does the perfection of wisdom gather in all the perfections of generosity, pure morality, patience, effort, meditation, and prajñāpāramitā?",
        "source": "T06n0220_378:0951c11_3"
    },
    {
        "source_sentence": "攝受一切內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They embraced all internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-nature, emptiness of shared characteristics, emptiness",
        "source": "T06n0220_378:0951c12_4"
    },
    {
        "source_sentence": "攝受一切真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "They embrace all true natures, the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchangingness and dissimilarity, equality, freedom from arising, legality, the abode of dharmas, reality, space, and inconceivable realms.",
        "source": "T06n0220_378:0951c16_5"
    },
    {
        "source_sentence": "攝受一切四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "He embraces all the four abodes of mindfulness, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_378:0951c18_6"
    },
    {
        "source_sentence": "攝受一切空、無相、無願解脫門，攝受一切苦、集、滅、道聖諦，攝受一切四靜慮、四無量、四無色定，",
        "translation": "He embraced all liberations of emptiness, signlessness, and wishlessness. He embraced all noble truths of suffering, origination, cessation, and the path. He embraced all four meditations, four immeasurable concentrations, and four formless concentrations.",
        "source": "T06n0220_378:0951c20_0"
    },
    {
        "source_sentence": "攝受一切八解脫、八勝處、九次第定、十遍處，攝受一切三摩地門、陀羅尼門，",
        "translation": "He embraced all the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes.",
        "source": "T06n0220_378:0951c22_1"
    },
    {
        "source_sentence": "攝受一切五眼、六神通，攝受一切佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，",
        "translation": "They embraced all the five eyes and six supernatural powers, they embraced the ten powers of all buddhas, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and the eighteen unique qualities of buddhahood.",
        "source": "T06n0220_378:0951c23_2"
    },
    {
        "source_sentence": "攝受一切無忘失法、恒住捨性，攝受一切一切智、道相智、一切相智，",
        "translation": "They embrace all the principles of nonforgetfulness and always abide in equanimity. They embrace all omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T06n0220_378:0951c26_3"
    },
    {
        "source_sentence": "攝受一切世、出世法？",
        "translation": "To gather in all worldly and supramundane dharmas?",
        "source": "T06n0220_378:0951c27_4"
    },
    {
        "source_sentence": "云何於一切異相法中施設一相，所謂無相，及於一相、無相法中施設種種差別法相？」",
        "translation": "How can one characteristic be defined in all different characteristics, which are called formless, and various distinctive characteristics be defined in one characteristic or formless characteristic?",
        "source": "T06n0220_378:0951c28_5"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_378:0952a02_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行深般若波羅蜜多時，安住如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事五取蘊中，",
        "translation": "When the bodhisattva Mahāsattva practices the profound prajñāpāramitā, he abides in the five appropriated aggregates like dreams, sounds, images, lights and shadows, mirages, illusory phenomena, fragrant cities, and magical transformations.",
        "source": "T06n0220_378:0952a02_1"
    },
    {
        "source_sentence": "修行布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，如實了知如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事五取蘊皆無相。",
        "translation": "He cultivates the five grasping aggregates of generosity, pure morality, patience, effort, meditation, meditation, and prajñāpāramitā, truly knowing that they are like dreams, sounds, images, lights, mirages, illusory phenomena, fragrant cities, and magical transformations, all without marks.",
        "source": "T06n0220_378:0952a04_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_378:0952a07_3"
    },
    {
        "source_sentence": "諸夢、響、像、光影、陽焰、幻事、尋香城、變化事皆無自性，若法無自性是法則無相，",
        "translation": "All dreams, echoes, images, lights, shadows, mirages, illusions, fragrant cities, and magical displays have no self-nature. If phenomena had no self-nature, then phenomena would have no characteristics.",
        "source": "T06n0220_378:0952a07_4"
    },
    {
        "source_sentence": "若法無相是法一相，所謂無相。",
        "translation": "If dharmas lack characteristics, they are the single characteristic of dharmas, which is called signless.",
        "source": "T06n0220_378:0952a09_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_378:0952a10_6"
    },
    {
        "source_sentence": "由此因緣，當知一切布施無相、施者無相、受者無相、施物無相，若如是知而行布施，",
        "translation": "Because of these causes and conditions, you should know that all forms of giving have no characteristics, that the giver has no characteristics, that the recipient has no characteristics, and that things given have no characteristics.",
        "source": "T06n0220_378:0952a10_7"
    },
    {
        "source_sentence": "則能圓滿修行布施波羅蜜多。",
        "translation": "Then he'll be able to perfect the cultivation of the perfection of generosity.",
        "source": "T06n0220_378:0952a12_8"
    },
    {
        "source_sentence": "若能圓滿修行布施波羅蜜多，則不遠離淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "If someone can fully cultivate the perfection of generosity, then they won't be far removed from the perfections of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T06n0220_378:0952a13_9"
    },
    {
        "source_sentence": "安住如是布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，則能圓滿四靜慮、四無量、四無色定，",
        "translation": "Abiding peacefully in these kinds of generosity, pure morality, patience, effort, meditation, and the perfection of wisdom, they can perfect the four meditations, four immeasurable concentrations, and four formless concentrations.",
        "source": "T06n0220_378:0952a14_10"
    },
    {
        "source_sentence": "亦能圓滿四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "They can also perfect the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_378:0952a16_11"
    },
    {
        "source_sentence": "亦能圓滿空、無相、無願解脫門，亦能圓滿內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "They can also perfect the liberation gate of emptiness, signlessness, and wishlessness; they can also perfect internal emptiness, external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness",
        "source": "T06n0220_378:0952a18_12"
    },
    {
        "source_sentence": "亦能圓滿真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "They can also perfect suchness, the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging dissimilarity, equality, freedom from arising, legality, the abode of dharmas, reality, space, and inconceivable realms.",
        "source": "T06n0220_378:0952a22_13"
    },
    {
        "source_sentence": "亦能圓滿苦、集、滅、道聖諦，亦能圓滿八解脫、八勝處、九次第定、十遍處，",
        "translation": "They can also perfect the noble truths of suffering, origination, cessation, and the path; they can also perfect the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal states.",
        "source": "T06n0220_378:0952a24_14"
    },
    {
        "source_sentence": "亦能圓滿五百三摩地門、五百陀羅尼門，亦能圓滿五眼、六神通，亦能圓滿佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，",
        "translation": "They can also perfect the five eyes, the six supernormal powers, the ten powers of buddhahood, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great compassion, great joy, great equanimity, and the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_378:0952a26_15"
    },
    {
        "source_sentence": "亦能圓滿無忘失法、恒住捨性，亦能圓滿一切智、道相智、一切相智。",
        "translation": "They can also perfect the state of nonforgetfulness and constantly abide in equanimity, and they can also perfect omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T06n0220_378:0952a29_16"
    },
    {
        "source_sentence": "「是菩薩摩訶薩安住如是異熟生聖無漏諸法中，以神通力往到十方殑伽沙等諸佛世界，",
        "translation": "“These great enlightening beings abide in such noble, uncontaminated dharmas as the maturation of birth, and by spiritual power they go to buddha-fields as numerous as the grains of sand in the ten directions.",
        "source": "T06n0220_378:0952b01_17"
    },
    {
        "source_sentence": "復以種種上妙衣服、飲食、臥具、湯藥、香花、寶幢、幡蓋、燈明、伎樂及餘所須，",
        "translation": "He also offered various kinds of exquisite clothing, food and drink, bedding, bathing powder, spices, perfumed flowers, jeweled banners, canopies, lamps, lights, music, and other necessities.",
        "source": "T06n0220_378:0952b04_0"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎諸佛世尊，作諸有情利益安樂，應以布施而攝益者，",
        "translation": "Those who make offerings to the buddhas and world-honored ones with respect, honor, veneration, and praise for the benefit and well-being of sentient beings should use generosity to gather benefits.",
        "source": "T06n0220_378:0952b05_1"
    },
    {
        "source_sentence": "即以布施而攝益之；",
        "translation": "That is, they take advantage of it by means of generosity.",
        "source": "T06n0220_378:0952b07_2"
    },
    {
        "source_sentence": "應以淨戒而攝益者，即以淨戒而攝益之；",
        "translation": "To those who should be benefited by means of pure morality, they are benefited by means of pure morality.",
        "source": "T06n0220_378:0952b07_3"
    },
    {
        "source_sentence": "應以安忍而攝益者，即以安忍而攝益之；",
        "translation": "To those who should be benefited by means of patience, they are benefited by means of patience.",
        "source": "T06n0220_378:0952b08_4"
    },
    {
        "source_sentence": "應以精進而攝益者，即以精進而攝益之；",
        "translation": "Those who are to be benefited by means of effort—that is, those who are to be benefited by means of effort.",
        "source": "T06n0220_378:0952b09_5"
    },
    {
        "source_sentence": "應以靜慮而攝益者，即以靜慮而攝益之；",
        "translation": "Those who should be benefited by means of meditative absorption are benefited by means of meditative absorption.",
        "source": "T06n0220_378:0952b10_6"
    },
    {
        "source_sentence": "應以般若而攝益者，即以般若而攝益之；",
        "translation": "To those who are to be benefited by means of wisdom, they are benefited by means of wisdom.",
        "source": "T06n0220_378:0952b11_7"
    },
    {
        "source_sentence": "應以諸餘種種善法而攝益者，即以諸餘種種善法而攝益之；",
        "translation": "Those who are to be benefited by means of the other kinds of wholesome states—that is, those who are to be benefited by means of the other kinds of wholesome states.",
        "source": "T06n0220_378:0952b12_8"
    },
    {
        "source_sentence": "應以一切殊勝善法而攝益者，即以一切殊勝善法而攝益之。",
        "translation": "Those who should be benefited by all superior good qualities are those who are benefited by all superior good qualities.",
        "source": "T06n0220_378:0952b13_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩成就如是無量善法，雖受生死不為生死過失所染。",
        "translation": "This is the bodhisattva Mahāsattva who accomplishes such an immeasurable amount of good qualities, and although he experiences birth and death, he isn't stained by the faults of birth and death.",
        "source": "T06n0220_378:0952b15_10"
    },
    {
        "source_sentence": "為欲利樂諸有情故，攝受人天富貴自在，由此富貴自在威力，能作有情諸利樂事，",
        "translation": "Because they want to benefit sentient beings, they take in the wealth and sovereignty of humans and gods. Because of this wealth and sovereignty, they are able to do all kinds of benefits and pleasures for sentient beings.",
        "source": "T06n0220_378:0952b16_11"
    },
    {
        "source_sentence": "以四攝事而攝受之。",
        "translation": "He takes them in by means of the four ways to gather things.",
        "source": "T06n0220_378:0952b18_12"
    },
    {
        "source_sentence": "「是菩薩摩訶薩知一切法皆無相故，雖知預流果而不住預流果，雖知一來果而不住一來果，",
        "translation": "“Even though they know the fruit of stream-entry, they do not abide in the fruit of stream-entry. And although they know the fruit of one coming, they do not abide in the fruit of yet another.",
        "source": "T06n0220_378:0952b19_13"
    },
    {
        "source_sentence": "雖知不還果而不住不還果，雖知阿羅漢果而不住阿羅漢果，雖知獨覺菩提而不住獨覺菩提。",
        "translation": "Even though they know the fruit of nonreturning, they don't abide in the fruit of nonreturning; even though they know the fruit of arhatship, they don't abide in the fruit of arhatship; and even though they know the enlightenment of solitary realizers, they don't abide in the enlightenment of solitary realizers.",
        "source": "T06n0220_378:0952b21_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_378:0952b23_15"
    },
    {
        "source_sentence": "是菩薩摩訶薩如實了知一切法已，為欲證得一切相智，不共一切聲聞、獨覺。",
        "translation": "After truly knowing all dharmas, this bodhisattva Mahāsattva wants to realize the knowledge of all characteristics, which is not shared with all śrāvakas and solitary realizers.",
        "source": "T06n0220_378:0952b23_16"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_378:0952b25_17"
    },
    {
        "source_sentence": "菩薩摩訶薩知一切法皆無相故，如實了知布施、淨戒、安忍、精進、靜慮、般若波羅蜜多亦皆無相，",
        "translation": "Because the bodhisattva Mahāsattva knows that all things are signless, he truly knows that generosity, pure morality, patience, effort, meditation, and the perfection of wisdom are signless.",
        "source": "T06n0220_378:0952b25_18"
    },
    {
        "source_sentence": "如實了知諸餘佛法亦皆無相，由是因緣普能圓滿一切佛法。",
        "translation": "They truly know that the other Buddha-teachings are also signless, and because of these causes and conditions they are able to perfect all buddha-teachings.",
        "source": "T06n0220_378:0952b27_19"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_378:0952c02_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行深般若波羅蜜多時，安住如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事五取蘊中，",
        "translation": "When the bodhisattva Mahāsattva practices the profound prajñāpāramitā, he abides in the five appropriated aggregates like dreams, sounds, images, lights and shadows, mirages, illusory phenomena, fragrant cities, and magical transformations.",
        "source": "T06n0220_378:0952c02_1"
    },
    {
        "source_sentence": "圓滿淨戒波羅蜜多。",
        "translation": "The perfection of the perfection of pure morality is the pāramitā.",
        "source": "T06n0220_378:0952c04_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩如實了知是五取蘊如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事已，",
        "translation": "“Thus the great enlightening beings truly know that these five appropriated aggregates are like dreams, like echoes, like images, like reflections, like mirages, like magic tricks, like perfume castles of fragrance, and like magical displays.",
        "source": "T06n0220_378:0952c05_3"
    },
    {
        "source_sentence": "便能圓滿無相淨戒波羅蜜多。",
        "translation": "He'll then be able to perfect the signless perfection of pure morality.",
        "source": "T06n0220_378:0952c07_4"
    },
    {
        "source_sentence": "如是淨戒，無缺、無隙、無瑕、無穢，無所取著，應受供養，智者所讚，",
        "translation": "Thus, the pure precepts are without fail, without gaps, without blemishes, without blemishes, without defilement, without attachment, and should be offered as an offering, praised by the wise.",
        "source": "T06n0220_378:0952c08_5"
    },
    {
        "source_sentence": "妙善受持，妙善究竟，是聖無漏，是出世間道支所攝。",
        "translation": "The subtle and wonderfully well-maintained, the subtle and wonderfully well-accomplished are noble and uncontaminated, which are included in the supramundane factors of the path.",
        "source": "T06n0220_378:0952c09_6"
    },
    {
        "source_sentence": "安住此戒，能善受持受施設戒、法爾得戒、律儀戒、有表戒、無表戒、現行戒、不現行戒、威儀戒、非威儀戒。",
        "translation": "Abiding in these precepts, they can skillfully observe and uphold the established precepts, the precepts that are attained according to the rules, the precepts that are disciplined, the precepts that are expressed, the precepts that are unexpressed, the precepts that are practiced, the precepts that are not practiced, the precepts that",
        "source": "T06n0220_378:0952c10_7"
    },
    {
        "source_sentence": "「是菩薩摩訶薩雖具成就如是諸戒而無取著，不作是念：『我由此戒當生剎帝利大族富貴自在，",
        "translation": "“Even though the bodhisattva Mahāsattva has perfected these precepts, he does not cling to them. He does not think, ‘Because of these precepts I will be reborn as a kṣatriya wealthy and powerful freely abled one.",
        "source": "T06n0220_378:0952c13_8"
    },
    {
        "source_sentence": "或生婆羅門大族富貴自在，或生長者大族富貴自在，或生居士大族富貴自在。』",
        "translation": "Some may give rise to the great wealth and prosperity of a brāhmaṇa, or they may give rise to the great wealth and prosperity of a grown man, or they may give rise to the great wealth and prosperity of a householder.'",
        "source": "T06n0220_378:0952c15_9"
    },
    {
        "source_sentence": "不作是念：『我由此戒當為小王、或為大王、或為輪王富貴自在。』",
        "translation": "They don't think, 'With these precepts, I will become a minor king, or a great king, or a wheel-turning king with wealth and prosperity and sovereignty.'",
        "source": "T06n0220_378:0952c17_10"
    },
    {
        "source_sentence": "不作是念：『我由此戒當生四大王眾天、或生三十三天、或生夜摩天、或生覩史多天、或生樂變化天、或生他化自在天富貴自在。』",
        "translation": "They don't think, 'With this precept, I will be born in the heaven of the four great kings, the Trāyastriṃśa gods, the Trāyastriṃśa gods, the Yama gods, the Tuṣita gods, the Nirmāṇarati gods, the Paranirmita-vaśavartin gods, or the Paranirmi",
        "source": "T06n0220_378:0952c18_11"
    },
    {
        "source_sentence": "不作是念：『我由此戒當生梵眾天、或生梵輔天、或生梵會天、或生大梵天富貴自在。』",
        "translation": "They don't think, 'With this precept, I will be born in the Brahmakāyika gods, some of the Brahmakāyika gods, some of the Brahmakāyika gods, some of the Brahmakāyika gods, or some of the Mahābrahmā gods who are wealthy and self-possessed.'",
        "source": "T06n0220_378:0952c21_12"
    },
    {
        "source_sentence": "不作是念：『我由此戒當生光天、或生少光天、或生無量光天、或生極光淨天富貴自在。』",
        "translation": "They don't think, 'With this precept, I will be born in the Heaven of Light, the Heaven of Lesser Light, the Heaven of Immeasurable Light, or the Pure and Perfectly Luminous Heaven with Great Wealth and Freedom.'",
        "source": "T06n0220_378:0952c23_13"
    },
    {
        "source_sentence": "不作是念：『我由此戒當生淨天、或生少淨天、或生無量淨天、或生遍淨天富貴自在。』",
        "translation": "They don't think, 'With this precept, I will be born in a pure heaven, or in a lesser pure heaven, or in an immeasurable pure heaven, or in a pervasively pure heaven with wealth and sovereignty.'",
        "source": "T06n0220_378:0952c25_14"
    },
    {
        "source_sentence": "不作是念：『我由此戒當生廣天、或生少廣天、或生無量廣天、或生廣果天富貴自在。』",
        "translation": "They don't think, 'With this precept, I will be born in the vast heavens, some in the small-vast heavens, some in the infinitely vast heavens, or some in the vast fruitful heavens with wealth and freedom.'",
        "source": "T06n0220_378:0952c27_15"
    },
    {
        "source_sentence": "不作是念：『我由此戒當生無繁天、或生無熱天、或生善現天、或生善見天、或生色究竟天富貴自在。』",
        "translation": "They don't think, 'With this precept, I will be born in the Heaven of Nothingness, the Heaven of Nothingness, the Heaven of No Heat, the Heaven of Good Manifestation, the Heaven of Good Vision, or the Paranirmita-vaśavartin Heaven.'",
        "source": "T06n0220_378:0952c29_16"
    },
    {
        "source_sentence": "不作是念：『我由此戒當生空無邊處、或生識無邊處、或生無所有處、或生非想非非想處富貴自在。』",
        "translation": "They don't think, 'With these precepts, I will give rise to the limitless state of emptiness, the limitless state of consciousness, the limitless state of nothingness, or the wealth and sovereignty of the abode of neither perception nor non-perception.'",
        "source": "T06n0220_378:0953a02_17"
    },
    {
        "source_sentence": "不作是念：『我由此戒當得預流果，或得一來果，或得不還果，或得阿羅漢果，",
        "translation": "They do not think, “Through these precepts I am bound to attain the state of stream-winner, or a once-returner, or a nonreturner, or an arhat.",
        "source": "T06n0220_378:0953a04_18"
    },
    {
        "source_sentence": "或得獨覺菩提，或入菩薩正性離生，或得菩薩無生法忍，或得無上正等菩提。』",
        "translation": "Either they attain the enlightenment of the solitary realizer, or they enter the bodhisattva's true nature that's free of birth, or they attain the bodhisattva's tolerance of the principle of nonproduction, or they attain unsurpassed perfect enlightenment.'",
        "source": "T06n0220_378:0953a06_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T06n0220_378:0953a08_20"
    },
    {
        "source_sentence": "是諸法皆無相，咸同一相，所謂無相，無相之法不得無相，有相之法不得有相，",
        "translation": "These dharmas are all signless, and they all have one and the same characteristic. The so-called signless dharma is called signless. A signless dharma does not obtain signlessness; a signless dharma does not obtain signlessness.",
        "source": "T06n0220_378:0953a08_21"
    },
    {
        "source_sentence": "無相之法不得有相，有相之法不得無相，由是因緣都不可得。",
        "translation": "Formless dharmas don't attain form, and formless dharmas don't attain form; therefore, all causes and conditions are unobtainable.",
        "source": "T06n0220_378:0953a10_22"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_378:0953a11_23"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多，速能圓滿無相淨戒波羅蜜多，證入菩薩正性離生；",
        "translation": "“When great enlightening beings practice the perfection of wisdom, they can quickly perfect the perfection of signless pure morality and realize entry into the true nature of enlightening beings free from birth.",
        "source": "T06n0220_378:0953a12_0"
    },
    {
        "source_sentence": "既入菩薩正性離生，復得菩薩無生法忍；",
        "translation": "Having entered into the true nature of enlightening beings’ freedom from birth, they again attain the tolerance of the nonorigination of all phenomena.",
        "source": "T06n0220_378:0953a13_1"
    },
    {
        "source_sentence": "既得菩薩無生法忍，修行道相智，趣一切相智，得異熟五神通，復得五百三摩地門，",
        "translation": "Having attained the enlightening beings’ tolerance of the nonorigination of all things, having cultivated knowledge of the path leading to omniscience and knowledge of all characteristics, they attain the five superknowledges as retribution. They also attain the five hundred concentrations called absorptions of great compassion.",
        "source": "T06n0220_378:0953a14_2"
    },
    {
        "source_sentence": "亦得五百陀羅尼門。",
        "translation": "They'll also attain the five hundred dhāraṇī teachings.",
        "source": "T06n0220_378:0953a16_3"
    },
    {
        "source_sentence": "安住此中，復能證得四無礙解，從一佛土至一佛土，供養恭敬、尊重讚歎諸佛世尊，",
        "translation": "Abiding here, they can also realize the four kinds of unhindered understanding. They go from one buddha-land to another, honoring and venerating all buddhas as well as praising and revering them.",
        "source": "T06n0220_378:0953a17_4"
    },
    {
        "source_sentence": "成熟有情、嚴淨佛土。",
        "translation": "They ripen sentient beings and adorn the Buddha land.",
        "source": "T06n0220_378:0953a19_5"
    },
    {
        "source_sentence": "「是菩薩摩訶薩為化有情，雖現流轉諸趣生死，而不為彼煩惱業報諸障所染。",
        "translation": "“Even though these bodhisattvas, mahāsattvas, manifest transmigration in the destinies of birth and death for the sake of transforming sentient beings, they aren’t stained by the hindrances of the results of those afflictive actions.",
        "source": "T06n0220_378:0953a19_6"
    },
    {
        "source_sentence": "譬如化人雖現行住坐臥等事，而無真實往來等業，雖現種種饒益有情，",
        "translation": "Good man, it is like a magical creation that although manifesting such things as walking, standing, sitting, lying, and so on, does not really have past or future actions. Although it manifests various kinds of benefits to sentient beings, yet without any real effect whatsoever.",
        "source": "T06n0220_378:0953a21_7"
    },
    {
        "source_sentence": "而於有情及彼施設都無所得。",
        "translation": "They don't attain anything for sentient beings or their designations.",
        "source": "T06n0220_378:0953a22_8"
    },
    {
        "source_sentence": "如有如來、應、正等覺名蘇扇多，證得無上正等菩提，轉妙法輪度無量眾，",
        "translation": "“Furthermore, it is as if the Tathāgata, Arhat, Perfectly Enlightened One named Sugandha had attained unexcelled perfect enlightenment and turned the wheel of the fine dharma to liberate immeasurable sentient beings.",
        "source": "T06n0220_378:0953a23_9"
    },
    {
        "source_sentence": "令脫生死證得涅槃，而無有情堪受次得無上正等菩提記者。",
        "translation": "It causes them to be freed from birth and death and realize nirvāṇa, but there are no sentient beings who can accept it and then attain unsurpassed perfect enlightenment.",
        "source": "T06n0220_378:0953a25_10"
    },
    {
        "source_sentence": "時，彼如來化作化佛令久住世，自捨壽行入無餘依般涅槃界，彼化佛身住一劫已，",
        "translation": "At the time, that Tathāgata transformed himself into a transformation buddha and caused him to stay in the world for a long time, abandoning his life span and entering the state of parinirvāṇa without remainder.",
        "source": "T06n0220_378:0953a26_11"
    },
    {
        "source_sentence": "授一菩薩無上正等菩提記已方入涅槃。",
        "translation": "He gave a prediction of unsurpassed perfect enlightenment to one bodhisattva before he entered nirvāṇa.",
        "source": "T06n0220_378:0953a28_12"
    },
    {
        "source_sentence": "彼佛化身雖作種種益有情事而無所得，謂不得色，不得受、想、行、識；",
        "translation": "The emanation bodies of those buddhas accomplish various works for the benefit of sentient beings, but they do not attain anything. That is to say, they do not attain form, sensation, perception, volition, or consciousness.",
        "source": "T06n0220_378:0953a29_13"
    },
    {
        "source_sentence": "不得眼處，不得耳、鼻、舌、身、意處；",
        "translation": "They do not obtain the organ of sight, and they do not obtain the organs of hearing, smell, taste, touch, body, or thought.",
        "source": "T06n0220_378:0953b02_14"
    },
    {
        "source_sentence": "不得色處，不得聲、香、味、觸、法處；",
        "translation": "They do not attain the sphere of form, and they do not attain the spheres of sound, odor, taste, touch, or dharmas.",
        "source": "T06n0220_378:0953b02_15"
    },
    {
        "source_sentence": "不得眼界，不得耳、鼻、舌、身、意界；",
        "translation": "They do not obtain the element eye, they do not obtain the elements ear, nose, tongue, body, and mind.",
        "source": "T06n0220_378:0953b03_16"
    },
    {
        "source_sentence": "不得色界，不得聲、香、味、觸、法界；",
        "translation": "They do not obtain the realm of form, and they do not obtain the realms of sound, odor, taste, touch, or dharmas.",
        "source": "T06n0220_378:0953b04_17"
    },
    {
        "source_sentence": "不得眼識界，不得耳、鼻、舌、身、意識界；",
        "translation": "They do not obtain the element of consciousness of the eye. They do not obtain the elements of the ear, nose, tongue, body, and mind.",
        "source": "T06n0220_378:0953b05_0"
    },
    {
        "source_sentence": "不得眼觸，不得耳、鼻、舌、身、意觸；",
        "translation": "They cannot be touched by the eye, and they cannot be touched by the ear, nose, tongue, body, or mind.",
        "source": "T06n0220_378:0953b05_1"
    },
    {
        "source_sentence": "不得眼觸為緣所生諸受，不得耳、鼻、舌、身、意觸為緣所生諸受；",
        "translation": "They do not get the sensations that arise from visual contact as supporting object; they do not get the sensations that arise from contact with the ear, nose, tongue, body, and mind as supporting object.",
        "source": "T06n0220_378:0953b06_2"
    },
    {
        "source_sentence": "不得一切有漏無漏法及有情。",
        "translation": "They won't attain all the contaminated and uncontaminated dharmas and sentient beings.",
        "source": "T06n0220_378:0953b07_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩亦復如是，雖有所作而無所得。",
        "translation": "So it is with this bodhisattva-mahāsattva, who does something but doesn't attain anything.",
        "source": "T06n0220_378:0953b08_4"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_378:0953b09_5"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多，圓滿淨戒波羅蜜多，由此淨戒波羅蜜多得圓滿故，",
        "translation": "Because the bodhisattva Mahāsattva cultivates the perfection of prajñāpāramitā and perfects the perfection of pure morality, it's because this perfection of pure morality attains its fulfillment.",
        "source": "T06n0220_378:0953b09_6"
    },
    {
        "source_sentence": "便能攝受一切佛法。",
        "translation": "They'll then be able to gather in all the buddha-teachings.",
        "source": "T06n0220_378:0953b11_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_378:0953b13_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行深般若波羅蜜多時，安住如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事五取蘊中，",
        "translation": "When the bodhisattva Mahāsattva practices the profound prajñāpāramitā, he abides in the five appropriated aggregates like dreams, sounds, images, lights and shadows, mirages, illusory phenomena, fragrant cities, and magical transformations.",
        "source": "T06n0220_378:0953b13_1"
    },
    {
        "source_sentence": "圓滿安忍波羅蜜多。",
        "translation": "The perfection of the perfection of patience is the perfection of forbearance.",
        "source": "T06n0220_378:0953b15_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩如實了知是五取蘊如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事已，",
        "translation": "“Thus the great enlightening beings truly know that these five appropriated aggregates are like dreams, like echoes, like images, like reflections, like mirages, like magic tricks, like perfume castles of fragrance, and like magical displays.",
        "source": "T06n0220_378:0953b16_3"
    },
    {
        "source_sentence": "便能圓滿無相安忍波羅蜜多。",
        "translation": "He'll then be able to perfect the perfection of signlessness and the perfection of patience.",
        "source": "T06n0220_378:0953b18_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_378:0953b19_5"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修行般若波羅蜜多，如實了知是五取蘊如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事已，",
        "translation": "How does the bodhisattva Mahāsattva cultivate the perfection of wisdom and truly understand that these five appropriated aggregates are like dreams, sounds, images, lights, shadows, mirages, illusions, fragrant cities, and magic tricks.",
        "source": "T06n0220_378:0953b19_6"
    },
    {
        "source_sentence": "便能圓滿無相安忍波羅蜜多？",
        "translation": "How can they perfect the perfection of signlessness and the perfection of patience?",
        "source": "T06n0220_378:0953b22_0"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_378:0953b22_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩如實了知是五取蘊無實相故，修二種忍便能圓滿無相安忍波羅蜜多。",
        "translation": "Because the bodhisattva Mahāsattva truly knows that these five aggregates of grasping have no true characteristics, cultivating two kinds of forbearance will enable him to perfect the perfection of the signless and peaceful perfection of patience.",
        "source": "T06n0220_378:0953b22_2"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T06n0220_378:0953b24_3"
    },
    {
        "source_sentence": "一、安受忍。",
        "translation": "1. patience of peaceful acceptance.",
        "source": "T06n0220_378:0953b25_0"
    },
    {
        "source_sentence": "二、觀察忍。",
        "translation": "2. the tolerance of observing.",
        "source": "T06n0220_378:0953b25_1"
    },
    {
        "source_sentence": "「安受忍者，謂諸菩薩摩訶薩從初發心乃至安坐妙菩提座，於其中間，",
        "translation": "The ninja of accepting peace means that the bodhisattvas and mahāsattvas, from the first arousal of their aspiration for enlightenment until they are seated comfortably on a wonderful seat of enlightenment,",
        "source": "T06n0220_378:0953b25_2"
    },
    {
        "source_sentence": "假使一切有情之類競來呵毀，以麁惡言罵詈凌辱，復以瓦石、刀杖加害，",
        "translation": "Suppose all kinds of sentient beings come and criticize him, ridicul him with harsh words or abuse him, and then they use stones, tiles, swords, and sticks to harm him.",
        "source": "T06n0220_378:0953b27_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩為滿安忍波羅蜜多，乃至不生一念瞋恨，亦復不起加報之心，",
        "translation": "“Furthermore, in order to fulfill the perfection of patience, these great enlightening beings do not give rise to a single thought of anger or resentment, and they also do not give rise to thoughts of retribution.",
        "source": "T06n0220_378:0953b28_4"
    },
    {
        "source_sentence": "但作是念：『彼諸有情深可憐愍，增上煩惱撞擊其心不得自在，於我發起如是惡業，",
        "translation": "They simply think, ‘Those sentient beings are deeply pitiable. Their minds are struck by increased afflictions and do not have control over themselves.",
        "source": "T06n0220_378:0953c01_5"
    },
    {
        "source_sentence": "我今不應瞋恨於彼。』",
        "translation": "Now, I shouldn't be angry with them.'",
        "source": "T06n0220_378:0953c03_6"
    },
    {
        "source_sentence": "復作是念：『由我攝受怨家諸蘊，令彼有情於我發起如是惡業，但應自責不應瞋彼。』",
        "translation": "Again, he thinks, 'It's because I take in the aggregates of the enemy's house and cause those sentient beings who give rise to such bad actions against me to simply rebuke themselves and not anger them.'",
        "source": "T06n0220_378:0953c03_7"
    },
    {
        "source_sentence": "菩薩如是審觀察時，於彼有情深生慈愍，如是等類名安受忍。",
        "translation": "When bodhisattvas thus examine and observe them, they deeply become compassionate toward those sentient beings, and such kinds are called peaceful accepting tolerance.",
        "source": "T06n0220_378:0953c05_8"
    },
    {
        "source_sentence": "「觀察忍者，謂諸菩薩摩訶薩作是思惟：『諸行如幻、虛妄不實、不得自在，",
        "translation": "Vimalakīrti: The bodhisattva-mahāsattva should think thus: All conditioned states of being are like illusions, false and unreal, incapable of mastery.",
        "source": "T06n0220_378:0953c07_9"
    },
    {
        "source_sentence": "亦如虛空無我，有情、命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、受者、知者、見者皆不可得，",
        "translation": "Also, just as space is without self, so are sentient beings, the living, the born, the nurturing, the husband, the man, the pudgala, the mind-made, the youthful, the author, the experiencer, the knower, and the viewer ungraspable.",
        "source": "T06n0220_378:0953c08_10"
    },
    {
        "source_sentence": "唯是虛妄分別所起。",
        "translation": "It's only produced by false discrimination.",
        "source": "T06n0220_378:0953c10_11"
    },
    {
        "source_sentence": "誰呵毀我？",
        "translation": "Who criticizes me?",
        "source": "T06n0220_378:0953c11_12"
    },
    {
        "source_sentence": "誰罵詈我？",
        "translation": "Who scolded me?",
        "source": "T06n0220_378:0953c11_13"
    },
    {
        "source_sentence": "誰凌辱我？",
        "translation": "Who abused me?",
        "source": "T06n0220_378:0953c11_14"
    },
    {
        "source_sentence": "誰以種種瓦、石、刀、杖加害於我？",
        "translation": "Who harmed me with various tiles, stones, swords, and sticks?",
        "source": "T06n0220_378:0953c12_0"
    },
    {
        "source_sentence": "誰復受彼毀辱加害？",
        "translation": "Who else will be harmed by that disgrace?",
        "source": "T06n0220_378:0953c12_1"
    },
    {
        "source_sentence": "皆是自心虛妄分別，我今不應橫起執著，如是諸法由自性空、勝義空故都無所有。』",
        "translation": "They are all falsely discriminated by their own minds, and now I shouldn't arbitrarily cling to them; such things lack existence because they are empty of their own nature and empty of ultimate meaning.'",
        "source": "T06n0220_378:0953c13_2"
    },
    {
        "source_sentence": "菩薩如是審觀察時，如實了知諸行空寂，於一切法不生異想，如是等類名觀察忍。",
        "translation": "When bodhisattvas thus examine and observe them, they truly understand the emptiness of conditioned phenomena and don't give rise to different thoughts about all things, and such kinds are called observing forbearance.",
        "source": "T06n0220_378:0953c15_3"
    },
    {
        "source_sentence": "「是菩薩摩訶薩修習如是二種忍故，便能圓滿無相安忍波羅蜜多，由能圓滿無相安忍波羅蜜多，",
        "translation": "Because the bodhisattva Mahāsattva cultivates these two kinds of tolerance, he is able to perfect the perfection of signless patience.",
        "source": "T06n0220_378:0953c16_4"
    },
    {
        "source_sentence": "即便獲得無生法忍。」",
        "translation": "He'll then attain the forbearance of the nonarising dharma.",
        "source": "T06n0220_378:0953c19_5"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_378:0953c19_6"
    },
    {
        "source_sentence": "云何名為無生法忍？",
        "translation": "What's called the forbearance of the nonarising of dharmas?",
        "source": "T06n0220_378:0953c20_7"
    },
    {
        "source_sentence": "此何所斷？",
        "translation": "What is to be abandoned through this?",
        "source": "T06n0220_378:0953c20_8"
    },
    {
        "source_sentence": "復是何智？」",
        "translation": "What kind of cognition is it?",
        "source": "T06n0220_378:0953c21_0"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_378:0953c21_1"
    },
    {
        "source_sentence": "由此勢力乃至少分惡不善法亦不得生，是故說名無生法忍。",
        "translation": "As a result of this power, even a small part of bad and unskillful dharmas can't arise; therefore, it's called the patience of the nonarising of dharmas.",
        "source": "T06n0220_378:0953c21_2"
    },
    {
        "source_sentence": "此令一切我及我所慢等煩惱究竟寂滅，如實忍受諸法如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事，",
        "translation": "This causes all the afflictions of self and self-conceit to be ultimately extinguished, and they truly tolerate all things as dreams, sounds, images, lights, shadows, mirages, illusory phenomena, fragrant cities, and magical displays.",
        "source": "T06n0220_378:0953c22_3"
    },
    {
        "source_sentence": "此忍名智，得此智故說名獲得無生法忍。」",
        "translation": "This forbearance is called wisdom; attaining this wisdom, it's called attaining the tolerance of the nonarising of the Dharma.",
        "source": "T06n0220_378:0953c25_4"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_378:0953c26_5"
    },
    {
        "source_sentence": "聲聞、獨覺無生法忍與菩薩摩訶薩無生法忍有何差別？」",
        "translation": "What's the difference between the tolerance of the nonarising of the Dharma for śrāvakas and pratyekbuddhas and the tolerance of the nonarising of the Dharma for bodhisattvas, mahāsattvas?",
        "source": "T06n0220_378:0953c27_6"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_378:0953c28_7"
    },
    {
        "source_sentence": "諸預流者若智、若斷亦名菩薩摩訶薩忍，諸一來者若智、若斷亦名菩薩摩訶薩忍，",
        "translation": "If the pre-flows are known and stopped, they're also called bodhisattva-mahāsattva forbearance; if the one coming is known and stopped, it's also called bodhisattva-mahāsattva forbearance.",
        "source": "T06n0220_378:0953c28_8"
    },
    {
        "source_sentence": "諸不還者若智、若斷亦名菩薩摩訶薩忍，諸阿羅漢若智、若斷亦名菩薩摩訶薩忍，",
        "translation": "Those who don't return are also called bodhisattva-mahāsattva tolerance if they know and abandon them, and those arhats are also called bodhisattva-mahāsattva tolerance if they know and abandon them.",
        "source": "T06n0220_378:0954a01_9"
    },
    {
        "source_sentence": "一切獨覺若智、若斷亦名菩薩摩訶薩忍。",
        "translation": "All the solitary realizers who know and abandon them are also called bodhisattva-mahāsattva tolerance.",
        "source": "T06n0220_378:0954a03_10"
    },
    {
        "source_sentence": "復有菩薩摩訶薩忍，謂忍諸法畢竟不生，是為差別。",
        "translation": "Again, there's the distinction between bodhisattva-mahāsattva forbearance, which is to tolerate the ultimate nonarising of dharmas.",
        "source": "T06n0220_378:0954a04_11"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T06n0220_378:0954a05_12"
    },
    {
        "source_sentence": "諸菩薩摩訶薩成就如是殊勝忍故，超勝一切聲聞、獨覺。",
        "translation": "Because bodhisattvas, mahāsattvas, have accomplished such extraordinary forbearance, they surpass all śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_378:0954a05_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_378:0954a07_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩安住如是殊勝異熟無生忍中行菩薩道，能圓滿道相智。",
        "translation": "This is the bodhisattva Mahāsattva who abides in such a superior, ripened forbearance of nonarising while practicing the bodhisattva path and can perfect the knowledge of the path.",
        "source": "T06n0220_378:0954a07_1"
    },
    {
        "source_sentence": "由能圓滿道相智故，常不遠離四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "Because they can perfect the knowledge of the characteristics of the path, they are always not far removed from the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T06n0220_378:0954a08_2"
    },
    {
        "source_sentence": "亦不遠離空、無相、無願解脫門，亦不遠離異熟神通。",
        "translation": "They aren't far removed from the liberation gate of emptiness, signlessness, and wishlessness, and they aren't far removed from the miraculous powers of retribution.",
        "source": "T06n0220_378:0954a10_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩由不遠離異熟神通，從一佛土至一佛土，供養恭敬諸佛世尊，",
        "translation": "“These great enlightening beings, not far removed from the spiritual power of retribution, go from one buddha-land to another, honoring and serving the buddhas.",
        "source": "T06n0220_378:0954a11_4"
    },
    {
        "source_sentence": "成熟有情、嚴淨佛土。",
        "translation": "They ripen sentient beings and adorn the Buddha land.",
        "source": "T06n0220_378:0954a13_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩由成熟有情、嚴淨佛土得圓滿故，以一剎那相應妙慧，證得無上正等菩提。",
        "translation": "Because this bodhisattva Mahāsattva has perfected the ripening of sentient beings and the adornment of the Buddha's land, he uses the marvelous wisdom associated with a single moment to realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_378:0954a14_6"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_378:0954a16_7"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多，速能圓滿無相安忍波羅蜜多，無相安忍波羅蜜多得圓滿故，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, they can quickly perfect the perfection of signless tolerance because they attain the perfection of signless tolerance.",
        "source": "T06n0220_378:0954a16_8"
    },
    {
        "source_sentence": "便能證得一切智智，一切佛法無不圓滿。",
        "translation": "They'll then be able to realize omniscience and knowledge, and all the Buddha's teachings will be perfected without fail.",
        "source": "T06n0220_378:0954a18_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_378:0954a20_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行深般若波羅蜜多時，安住如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事五取蘊中，",
        "translation": "When the bodhisattva Mahāsattva practices the profound prajñāpāramitā, he abides in the five appropriated aggregates like dreams, sounds, images, lights and shadows, mirages, illusory phenomena, fragrant cities, and magical transformations.",
        "source": "T06n0220_378:0954a20_1"
    },
    {
        "source_sentence": "如實了知是五取蘊如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事無實相已，",
        "translation": "Having truly known that these five appropriated aggregates are like dreams, like echoes, like images, like lights and shadows, like mirages, like illusions, like fragrant cities, like magic tricks, without real characteristics,",
        "source": "T06n0220_378:0954a22_2"
    },
    {
        "source_sentence": "發起勇猛身心精進。",
        "translation": "He gives rise to courageous physical and mental exertion.",
        "source": "T06n0220_378:0954a24_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩發起勇猛身精進故，引發殊勝迅速神通，由此神通往十方界，",
        "translation": "Because of these great enlightening beings’ arousal of heroic effort in body and mind, they develop extraordinarily strong superknowledgements. Through these superknowledgements they go to all worlds in the ten directions:",
        "source": "T06n0220_378:0954a25_4"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎諸佛世尊，於諸佛所殖眾德本，利益安樂無量有情，",
        "translation": "“Great enlightening beings honor, revere, and venerate the buddhas of past, present, and future; they develop roots of goodness in the presence of all buddhas for the benefit and welfare of countless sentient beings.",
        "source": "T06n0220_378:0954a27_0"
    },
    {
        "source_sentence": "亦能嚴淨種種佛土。",
        "translation": "They can also adorn and purify various buddha lands.",
        "source": "T06n0220_378:0954a28_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩由身精進成熟有情，隨其所宜方便安立於三乘法各令究竟。",
        "translation": "This is the bodhisattva Mahāsattva who, through physical effort, matures sentient beings and establishes the teachings of the three vehicles according to their abilities and skillful means so that they will each reach their ultimate goal.",
        "source": "T06n0220_378:0954a29_2"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T06n0220_378:0954b01_3"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多，由身精進能速圓滿無相精進波羅蜜多。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of prajñāpāramitā, it's because their physical effort can quickly perfect the perfection of signless effort that they practice the perfection of prajñāpāramitā.",
        "source": "T06n0220_378:0954b02_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_378:0954b03_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩發起勇猛心精進故，引發諸聖無漏道支所攝精進，圓滿精進波羅蜜多，",
        "translation": "“These are the great enlightening beings who, because of their arousal of courageous mental energy, give rise to the energy that is collected in the noble uncontaminated factors of the path and perfect the transcendent practice of effort.",
        "source": "T06n0220_378:0954b03_6"
    },
    {
        "source_sentence": "於中具能攝諸善法，謂四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "The four abodes of mindfulness, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path can all be included in them.",
        "source": "T06n0220_378:0954b05_7"
    },
    {
        "source_sentence": "空、無相、無願解脫門，四靜慮、四無量、四無色定，八解脫、八勝處、九次第定、十遍處，",
        "translation": "The liberation gates of emptiness, signlessness, and wishlessness are the four meditations, the four immeasurable concentrations, the four formless concentrations, the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes.",
        "source": "T06n0220_378:0954b07_8"
    },
    {
        "source_sentence": "苦、集、滅、道聖諦，布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "The noble truths of suffering, arising, cessation, and the path are generosity, pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T06n0220_378:0954b09_9"
    },
    {
        "source_sentence": "五眼、六神通，三摩地門、陀羅尼門，極喜地、離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地，",
        "translation": "The five eyes, the six supernormal powers, the approach of samādhi and the approach of dhāraṇī, the ground of ultimate joy, the ground of freedom from defilement, the ground of emission of light, the ground of blazing wisdom, the ground of extreme difficulty overcoming, the ground of manifestation, the ground of distant action, the ground of immovability, the ground",
        "source": "T06n0220_378:0954b10_10"
    },
    {
        "source_sentence": "內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "The emptiness of internal emptiness, emptiness of external emptiness, emptiness of internal and external emptiness, emptiness of emptiness, emptiness of emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of",
        "source": "T06n0220_378:0954b13_11"
    },
    {
        "source_sentence": "真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "The realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging dissimilarity, equality, freedom from arising, legality, Dharma abiding, reality, space, and inconceivable realms.",
        "source": "T06n0220_378:0954b16_12"
    },
    {
        "source_sentence": "佛十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，",
        "translation": "The ten powers of the Buddha, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the unique qualities of the eighteen buddhas.",
        "source": "T06n0220_378:0954b18_13"
    },
    {
        "source_sentence": "無忘失法、恒住捨性，一切智、道相智、一切相智。",
        "translation": "They don't forget the Dharma and constantly abide in equanimity, omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T06n0220_378:0954b20_14"
    },
    {
        "source_sentence": "「是菩薩摩訶薩安住此中，能圓滿一切相智。",
        "translation": "This is the bodhisattva Mahāsattva who abides here and can perfect the knowledge of all characteristics.",
        "source": "T06n0220_378:0954b21_15"
    },
    {
        "source_sentence": "由一切相智得圓滿故，永斷一切習氣相續。",
        "translation": "Because the knowledge of all characteristics has attained perfection, it permanently eliminates the continuity of all habit energy.",
        "source": "T06n0220_378:0954b22_16"
    },
    {
        "source_sentence": "由永斷一切習氣相續故，諸相隨好成就圓滿。",
        "translation": "Because they permanently eliminate the continuity of all habit energy, their characteristics and secondary signs are perfected.",
        "source": "T06n0220_378:0954b23_17"
    },
    {
        "source_sentence": "由諸相隨好成就圓滿，證得無上正等菩提，放大光明遍照三千大千世界，",
        "translation": "Because their marks and secondary signs are perfected, they attain unsurpassed true enlightenment. They emanate great rays of light illuminating a thousand worlds throughout the universe:",
        "source": "T06n0220_378:0954b24_18"
    },
    {
        "source_sentence": "令諸世界六種變動，轉正法輪具十二相。",
        "translation": "It causes the worlds to change in six ways, turning the right wheel of the Dharma with twelve characteristics.",
        "source": "T06n0220_378:0954b25_19"
    },
    {
        "source_sentence": "由此三千大千世界諸有情類蒙光照觸，覩斯變動、聞正法音，皆於三乘得不退轉。",
        "translation": "As a result, sentient beings in the 3,000 great one-thousand worlds are illuminated and touched by this light, which causes them to change and hear the sound of the right teaching, and they all attain nonregression in the three vehicles.",
        "source": "T06n0220_378:0954b26_20"
    },
    {
        "source_sentence": "「如是，善現！",
        "translation": "“So it is, Sunetra!",
        "source": "T06n0220_378:0954b28_21"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多，圓滿精進波羅蜜多，是菩薩摩訶薩安住精進波羅蜜多，",
        "translation": "“When great enlightening beings cultivate the perfection of wisdom and perfect the perfection of effort, this is the abode of great enlightening beings in the perfection of effort.",
        "source": "T06n0220_378:0954b29_22"
    },
    {
        "source_sentence": "能辦自他多饒益事，速能圓滿一切佛法，證得無上正等菩提。",
        "translation": "They can accomplish many benefits for themselves and others, quickly fulfill all the Buddha's teachings, and realize unsurpassed perfect enlightenment.",
        "source": "T06n0220_378:0954c02_23"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_378:0954c04_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行深般若波羅蜜多時，安住如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事五取蘊中，",
        "translation": "When the bodhisattva Mahāsattva practices the profound prajñāpāramitā, he abides in the five appropriated aggregates like dreams, sounds, images, lights and shadows, mirages, illusory phenomena, fragrant cities, and magical transformations.",
        "source": "T06n0220_378:0954c04_1"
    },
    {
        "source_sentence": "圓滿靜慮波羅蜜多。",
        "translation": "It's the perfection of the pāramitā of meditation.",
        "source": "T06n0220_378:0954c06_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_378:0954c07_3"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行深般若波羅蜜多時，安住如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事五取蘊中，",
        "translation": "How does the bodhisattva Mahāsattva when he practices the profound prajñāpāramitā abide in the five appropriated aggregates like dreams, sounds, images, lights and shadows, mirages, illusory phenomena, fragrant cities, and magical transformations?",
        "source": "T06n0220_378:0954c07_4"
    },
    {
        "source_sentence": "圓滿靜慮波羅蜜多？",
        "translation": "perfection of the pāramitā of meditation?",
        "source": "T06n0220_378:0954c10_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_378:0954c10_1"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，如實了知是五取蘊如夢、如響、如像、如光影、如陽焰、如幻事、如尋香城、如變化事無實相已，",
        "translation": "When the bodhisattva Mahāsattva cultivates the perfection of wisdom, he truly knows that these five appropriated aggregates are like dreams, sounds, images, lights, flames, miraculous events, fragrant cities, and transformations without real characteristics.",
        "source": "T06n0220_378:0954c10_2"
    },
    {
        "source_sentence": "入初靜慮具足住，入第二、第三、第四靜慮具足住；",
        "translation": "Entering the first concentration, they abide in the state of being supplied with all [factors]; entering the second, third and fourth concentrations, they abide in the state of being supplied with all [factors].",
        "source": "T06n0220_378:0954c13_3"
    },
    {
        "source_sentence": "入慈無量具足住，入悲、喜、捨無量具足住；",
        "translation": "Entering into kindness, they abide boundlessly supplied; entering into compassion, joy and equanimity, they abide boundlessly supplied.",
        "source": "T06n0220_378:0954c14_4"
    },
    {
        "source_sentence": "入空無邊處定具足住，入識無邊處、無所有處、非想非非想處定具足住；",
        "translation": "Entering the sphere of infinity of space, they abide in complete concentration. Entering the sphere of infinity of consciousness, the sphere of nothingness, and the sphere of neither thought nor nonthought, they abide in complete concentration.",
        "source": "T06n0220_378:0954c15_5"
    },
    {
        "source_sentence": "修空三摩地，修無相、無願三摩地；",
        "translation": "They develop the concentration on emptiness and develop the concentrations on signlessness and wishlessness.",
        "source": "T06n0220_378:0954c17_6"
    },
    {
        "source_sentence": "修如電三摩地，修聖正三摩地、金剛喻三摩地。",
        "translation": "He cultivates the samādhi of thusness like a flash of lightning, and he cultivates the noble correct samādhi and the adamantine metaphorical samādhi.",
        "source": "T06n0220_378:0954c17_7"
    },
    {
        "source_sentence": "住金剛喻三摩地中，除如來三摩地，諸餘一切三摩地，若共聲聞三摩地，",
        "translation": "He abides in the adamantine metaphor-samādhi, except for the Tathāgata's samādhi, all the other samādhis, and if he shares the śrāvaka's samādhi,",
        "source": "T06n0220_378:0954c18_8"
    },
    {
        "source_sentence": "若共獨覺三摩地，若餘無量三摩地，如是一切皆能身證具足而住，然於如是靜慮、無量、無色定等諸三摩地，",
        "translation": "Whether it's the shared solitary realizer samādhi, or the other measureless samādhis, all of them can physically realize and abide fully, but in such samādhis as meditation, immeasurable concentration, formless concentration, and so forth,",
        "source": "T06n0220_378:0954c20_9"
    },
    {
        "source_sentence": "不生味著，亦不耽著彼所得果。",
        "translation": "They don't give rise to taste attachment, and they don't cling to the fruit they attain.",
        "source": "T06n0220_378:0954c23_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0954c23_11"
    },
    {
        "source_sentence": "是菩薩摩訶薩如實了知靜慮、無量、無色定等諸三摩地及一切法皆無實相，",
        "translation": "“Thus the great enlightening beings truly know that all concentrations, meditations, immeasurable concentrations, formless concentrations, and other concentrations as well as all things have no real characteristics.",
        "source": "T06n0220_378:0954c24_0"
    },
    {
        "source_sentence": "皆以無性而為自性，不應以無相法味著無相法，亦不應以無性為自性法味著無性為自性法。",
        "translation": "They all take the absence of nature as their own nature, and they shouldn't be attached to the absence of characteristics because of the taste of markless dharmas, nor should they be attached to the absence of characteristics because of the absence of nature as self-nature or the absence of nature as self-nature.",
        "source": "T06n0220_378:0954c25_1"
    },
    {
        "source_sentence": "由不味著三摩地故，是菩薩摩訶薩終不隨順靜慮、無量、無色定等諸三摩地勢力而生色、無色界。",
        "translation": "Because they don't taste attachment to samādhi, this is the bodhisattva Mahāsattva who never follows the power of such samādhis as meditation, immeasurable concentration, formless concentration, and formless concentration and gives rise to form and formless realms.",
        "source": "T06n0220_378:0954c27_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955a01_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切界都無所得，於入定者及所入定、由此入定亦無所得。",
        "translation": "This is a bodhisattva-mahāsattva who has nothing to attain in all realms, and there's nothing to be attained by someone who enters concentration or the concentration that they enter, or by entering concentration as a result.",
        "source": "T06n0220_378:0955a01_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切法無所得故，速能圓滿無相靜慮波羅蜜多，由此靜慮波羅蜜多超諸聲聞及獨覺地。」",
        "translation": "Because this bodhisattva Mahāsattva has nothing to attain in all dharmas, he's quickly able to perfect the signless perfection of meditation that transcends the stages of śrāvakas and pratyekbuddhas.",
        "source": "T06n0220_378:0955a03_0"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_378:0955a05_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩云何圓滿無相靜慮波羅蜜多，超諸聲聞及獨覺地？」",
        "translation": "How does this bodhisattva Mahāsattva perfect the perfection of signless meditation that transcends the stages of śrāvakas and pratyekbuddhas?",
        "source": "T06n0220_378:0955a06_2"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_378:0955a07_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩善學內空故，善學外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空故，",
        "translation": "This is because the bodhisattva Mahāsattva well trains in internal emptiness, and he well trains in external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness",
        "source": "T06n0220_378:0955a07_4"
    },
    {
        "source_sentence": "是菩薩摩訶薩於是諸空中不得一切法，安住此中不得預流果，不得一來、不還、阿羅漢果、獨覺菩提，",
        "translation": "Thus, the bodhisattva Mahāsattva could not obtain all the teachings in those heavens, and while abiding therein he could not obtain the fruit of stream-entry, the once-returner, the nonreturner, the fruit of arhatship, and the enlightenment of the solitary realizer.",
        "source": "T06n0220_378:0955a12_5"
    },
    {
        "source_sentence": "不得一切菩薩摩訶薩行，不得諸佛無上正等菩提。",
        "translation": "They won't attain all the bodhisattva-mahāsattva practices, and they won't attain the unsurpassed perfect enlightenment of the buddhas.",
        "source": "T06n0220_378:0955a14_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955a15_7"
    },
    {
        "source_sentence": "是諸空性亦皆空故。",
        "translation": "It's because the nature of emptiness is also empty.",
        "source": "T06n0220_378:0955a15_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩由住此空，超諸聲聞及獨覺地，證入菩薩正性離生。」",
        "translation": "Because they abide in this emptiness, the bodhisattvas and mahāsattvas transcend the stages of śrāvakas and pratyekbuddhas and realize that they enter the bodhisattva's true nature as free from birth.",
        "source": "T06n0220_378:0955a16_9"
    },
    {
        "source_sentence": "具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T06n0220_378:0955a17_10"
    },
    {
        "source_sentence": "菩薩摩訶薩以何為生？",
        "translation": "What is the birth of great enlightening beings?",
        "source": "T06n0220_378:0955a18_11"
    },
    {
        "source_sentence": "以何為離生？」",
        "translation": "What's the reason for being free of birth?",
        "source": "T06n0220_378:0955a18_12"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_378:0955a19_13"
    },
    {
        "source_sentence": "菩薩摩訶薩以一切有所得為生，以一切無所得為離生。」",
        "translation": "The bodhisattva Mahāsattva takes all that's attained as birth and all that's not attained as freedom from birth.",
        "source": "T06n0220_378:0955a19_14"
    },
    {
        "source_sentence": "具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng said to the Buddha, Bhagavān!",
        "source": "T06n0220_378:0955a20_15"
    },
    {
        "source_sentence": "菩薩摩訶薩以何為有所得？",
        "translation": "What is the attainment of great enlightening beings?",
        "source": "T06n0220_378:0955a21_16"
    },
    {
        "source_sentence": "以何為無所得？」",
        "translation": "What's the absence of attainment?",
        "source": "T06n0220_378:0955a22_0"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T06n0220_378:0955a22_1"
    },
    {
        "source_sentence": "菩薩摩訶薩以一切法為有所得，謂菩薩摩訶薩以色為有所得，以受、想、行、識為有所得；",
        "translation": "“Great enlightening beings regard all things as acquired: great enlightening beings regard form as acquired and feeling, perception, volition, and consciousness as acquired.",
        "source": "T06n0220_378:0955a22_2"
    },
    {
        "source_sentence": "菩薩摩訶薩以眼處為有所得，以耳、鼻、舌、身、意處為有所得；",
        "translation": "“Great enlightening beings take the sphere of the eye as having to be acquired; they take the sphere of the ear, nose, tongue, body, and mind as having to be acquired.",
        "source": "T06n0220_378:0955a24_3"
    },
    {
        "source_sentence": "菩薩摩訶薩以色處為有所得，以聲、香、味、觸、法處為有所得；",
        "translation": "“Great enlightening beings take form as their acquisition, and sound, odor, taste, touch, and phenomena as their acquisition.",
        "source": "T06n0220_378:0955a26_0"
    },
    {
        "source_sentence": "菩薩摩訶薩以眼界為有所得，以耳、鼻、舌、身、意界為有所得；",
        "translation": "“Great enlightening beings take the element eye as acquisition, and they take the elements ear, nose, tongue, body, and mind as acquisition.",
        "source": "T06n0220_378:0955a27_1"
    },
    {
        "source_sentence": "菩薩摩訶薩以色界為有所得，以聲、香、味、觸、法界為有所得；",
        "translation": "“Great enlightening beings take the realm of form as their attainment, and they take the realms of sound, odor, taste, touch, and reality as their attainment.",
        "source": "T06n0220_378:0955a28_2"
    },
    {
        "source_sentence": "菩薩摩訶薩以眼識界為有所得，以耳、鼻、舌、身、意識界為有所得；",
        "translation": "“Great enlightening beings take the element consciousness of the eye as having gained something, and they take the elements ear, nose, tongue, body, and mind as having gained something.",
        "source": "T06n0220_378:0955b01_3"
    },
    {
        "source_sentence": "菩薩摩訶薩以眼觸為有所得，以耳、鼻、舌、身、意觸為有所得；",
        "translation": "“Great enlightening beings take contact with the eye as acquisition, and they take contact with the ear, nose, tongue, body, and mind as acquisition.",
        "source": "T06n0220_378:0955b02_4"
    },
    {
        "source_sentence": "菩薩摩訶薩以眼觸為緣所生諸受為有所得，以耳、鼻、舌、身、意觸為緣所生諸受為有所得；",
        "translation": "“Great enlightening beings regard feelings that arise from eye contact as having attainment, and they regard feelings that arise from contact with the ear, nose, tongue, body, or mind as having attainment.",
        "source": "T06n0220_378:0955b03_5"
    },
    {
        "source_sentence": "菩薩摩訶薩以地界為有所得，以水、火、風、空、識界為有所得；",
        "translation": "“Great enlightening beings take the earth realm as their acquisition, while water, fire, wind, air, space, and consciousness realms as their acquisition.",
        "source": "T06n0220_378:0955b05_6"
    },
    {
        "source_sentence": "菩薩摩訶薩以因緣為有所得，以等無間緣、所緣緣、增上緣為有所得；",
        "translation": "“Great enlightening beings take causes and conditions as acquisitions, and they take equal and immediately antecedent conditions, objective conditions, and dominant conditions as acquisitions.",
        "source": "T06n0220_378:0955b07_7"
    },
    {
        "source_sentence": "菩薩摩訶薩以無明為有所得，以行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱為有所得；",
        "translation": "“Great enlightening beings take nescience as their attainment, and they take form, consciousness, name-and-form, the six sense mediums, touch, sensation, thirst, craving, grasping, existence, birth, old age, sorrow, pain, vexation, suffering, and vexation as their attainments.",
        "source": "T06n0220_378:0955b08_8"
    },
    {
        "source_sentence": "菩薩摩訶薩以布施波羅蜜多為有所得，以淨戒、安忍、精進、靜慮、般若波羅蜜多為有所得；",
        "translation": "“Great enlightening beings take the perfection of giving as their attainment, and they take the perfection of morality, patience, effort, meditation, and wisdom as their attainment.",
        "source": "T06n0220_378:0955b11_0"
    },
    {
        "source_sentence": "菩薩摩訶薩以內空為有所得，以外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空為有所得；",
        "translation": "“Great enlightening beings take internal emptiness as acquisition, while external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self-nature, emptiness of",
        "source": "T06n0220_378:0955b13_1"
    },
    {
        "source_sentence": "菩薩摩訶薩以四念住為有所得，以四正斷、四神足、五根、五力、七等覺支、八聖道支為有所得；",
        "translation": "“Great enlightening beings take the four abodes of mindfulness as their attainments, and they take the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path as their attainments.",
        "source": "T06n0220_378:0955b17_2"
    },
    {
        "source_sentence": "菩薩摩訶薩以空解脫門為有所得，以無相、無願解脫門為有所得；",
        "translation": "“Great enlightening beings take the liberation gate of emptiness as their attainment and the liberation gate of signlessness and wishlessness as their attainment.",
        "source": "T06n0220_378:0955b19_3"
    },
    {
        "source_sentence": "菩薩摩訶薩以苦聖諦為有所得，以集、滅、道聖諦為有所得；",
        "translation": "“Great enlightening beings regard the noble truth of suffering as having gained something, and regard the noble truths of accumulation, cessation, and the path as having gained something.",
        "source": "T06n0220_378:0955b20_4"
    },
    {
        "source_sentence": "菩薩摩訶薩以四靜慮為有所得，以四無量、四無色定為有所得；",
        "translation": "“Great enlightening beings take the four meditations as acquisitions, and they take the four immeasurable concentrations and the four formless concentrations as acquisitions.",
        "source": "T06n0220_378:0955b22_5"
    },
    {
        "source_sentence": "菩薩摩訶薩以八解脫為有所得，以八勝處、九次第定、十遍處為有所得；",
        "translation": "“Great enlightening beings take the eight liberations as their attainments, and they take the eight spheres of mastery, the nine graduated concentrations, and the ten universals as their attainments.",
        "source": "T06n0220_378:0955b23_6"
    },
    {
        "source_sentence": "菩薩摩訶薩以一切三摩地門為有所得，以一切陀羅尼門為有所得；",
        "translation": "“Great enlightening beings regard all aspects of concentration as having attainment and all aspects of mental command as having attainment.",
        "source": "T06n0220_378:0955b25_7"
    },
    {
        "source_sentence": "菩薩摩訶薩以極喜地為有所得，以離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地為有所得；",
        "translation": "“Great enlightening beings take the stage of ultimate bliss as their attainment, and they take the stage of freedom from defilement, the stage of emission of light, the stage of knowledge of blazing fire, the stage of supreme excellence, the stage of direct presence, the stage of far-reaching travel, the stage of unshakableness, the stage of good",
        "source": "T06n0220_378:0955b27_0"
    },
    {
        "source_sentence": "菩薩摩訶薩以五眼為有所得，以六神通為有所得；",
        "translation": "“Great enlightening beings take the five eyes as their attainments and the six transcendent powers as their attainments.",
        "source": "T06n0220_378:0955b29_1"
    },
    {
        "source_sentence": "菩薩摩訶薩以佛十力為有所得，以四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法為有所得；",
        "translation": "“Great enlightening beings take the ten powers of buddhas as their attainments, and they take the four fearlessnesses, the four unhindered understandings, great benevolence, great compassion, great joy, great equanimity, and the unique qualities of the eighteen buddhas as their attainments.",
        "source": "T06n0220_378:0955c01_2"
    },
    {
        "source_sentence": "菩薩摩訶薩以無忘失法為有所得，以恒住捨性為有所得；",
        "translation": "“Great enlightening beings regard the principle of nonforgetfulness as having attainment and the nature of constantly abiding equanimity as having attainment.",
        "source": "T06n0220_378:0955c04_3"
    },
    {
        "source_sentence": "菩薩摩訶薩以一切智為有所得，以道相智、一切相智為有所得；",
        "translation": "“Great enlightening beings take omniscience as what they attain, and knowledge of the path and knowledge of all characteristics as what they attain.",
        "source": "T06n0220_378:0955c05_4"
    },
    {
        "source_sentence": "菩薩摩訶薩以預流果為有所得，以一來、不還、阿羅漢果、獨覺菩提為有所得；",
        "translation": "“Great enlightening beings regard the fruit of stream-entry as having gained something, and they regard the first coming, nonreturning, fruit of arhatship, and enlightenment of individually awakened ones as having gained something.",
        "source": "T06n0220_378:0955c06_5"
    },
    {
        "source_sentence": "菩薩摩訶薩以一切菩薩摩訶薩行為有所得，以諸佛無上正等菩提為有所得。",
        "translation": "The bodhisattva Mahāsattva has gained something from all the bodhisattva-mahāsattva practices, and he takes the unsurpassed correct perfect enlightenment of the buddhas as having gained something.",
        "source": "T06n0220_378:0955c08_6"
    },
    {
        "source_sentence": "菩薩摩訶薩以如是等有所得為生。",
        "translation": "Bodhisattvas, mahāsattvas, and bodhisattvas give rise to such attainments.",
        "source": "T06n0220_378:0955c10_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_378:0955c11_8"
    },
    {
        "source_sentence": "無所得者，謂菩薩摩訶薩於如是一切法，無行、無得、無說、無示。",
        "translation": "The ungraspable refers to the bodhisattva-mahāsattva who has no practice, no attainment, no explanation, and no indication of all these things.",
        "source": "T06n0220_378:0955c11_9"
    },
    {
        "source_sentence": "謂菩薩摩訶薩於色，無行、無得、無說、無示；",
        "translation": "It means that great enlightening beings have no practice, no attainment, no explanation, and no indication regarding form.",
        "source": "T06n0220_378:0955c12_10"
    },
    {
        "source_sentence": "於受、想、行、識，無行、無得、無說、無示。",
        "translation": "In feeling, perception, volition, and consciousness, there's no volition, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c13_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955c14_12"
    },
    {
        "source_sentence": "色自性乃至識自性皆不可行、得、說、示故。",
        "translation": "It's because the self-nature of form and even the self-nature of consciousness are not practiced, acquired, explained, or shown.",
        "source": "T06n0220_378:0955c14_13"
    },
    {
        "source_sentence": "「菩薩摩訶薩於眼處，無行、無得、無說、無示；",
        "translation": "“In the eye, great enlightening beings have no action, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c15_14"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意處，無行、無得、無說、無示。",
        "translation": "In the ear, nose, tongue, body, and mind, there's no practice, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c16_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955c17_16"
    },
    {
        "source_sentence": "眼處自性乃至意處自性，皆不可行、得、說、示故。",
        "translation": "The own-nature of the sense-field eye and even the own-nature of the sense-field mind cannot be practised, acquired, explained or shown.",
        "source": "T06n0220_378:0955c17_17"
    },
    {
        "source_sentence": "「菩薩摩訶薩於色處，無行、無得、無說、無示；",
        "translation": "“Great enlightening beings have no practice, no attainment, no explanation, and no indication in the realm of form.",
        "source": "T06n0220_378:0955c18_18"
    },
    {
        "source_sentence": "於聲、香、味、觸、法處，無行、無得、無說、無示。",
        "translation": "In the sense-fields of sound, odor, taste, touch, and dharmas, there's no practice, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c19_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955c20_20"
    },
    {
        "source_sentence": "色處自性乃至法處自性，皆不可行、得、說、示故。",
        "translation": "The self-nature of the form realm and even the self-nature of the Dharma realm are all unmanifest, because they can't be practiced, attained, explained or shown.",
        "source": "T06n0220_378:0955c20_21"
    },
    {
        "source_sentence": "「菩薩摩訶薩於眼界，無行、無得、無說、無示；",
        "translation": "“In the eye realm great enlightening beings have no practice, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c21_22"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意界，無行、無得、無說、無示。",
        "translation": "In the ear, nose, tongue, body, and mind realms, there's no practice, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c22_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955c23_24"
    },
    {
        "source_sentence": "眼界自性乃至意界自性，皆不可行、得、說、示故。",
        "translation": "The self-nature of the eye realm and even the self-nature of the mind realm are all unmanifest, because they can't be practiced, attained, explained, or shown.",
        "source": "T06n0220_378:0955c23_25"
    },
    {
        "source_sentence": "「菩薩摩訶薩於色界，無行、無得、無說、無示；",
        "translation": "“Great enlightening beings have no practice, no attainment, no explanation, and no indication in the realm of form.",
        "source": "T06n0220_378:0955c24_26"
    },
    {
        "source_sentence": "於聲、香、味、觸、法界，無行、無得、無說、無示。",
        "translation": "In the sound, odor, taste, touch, and dharma realms, there's no practice, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c25_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955c26_28"
    },
    {
        "source_sentence": "色界自性乃至法界自性，皆不可行、得、說、示故。",
        "translation": "The self-nature of the form realm and even the self-nature of the Dharma realm can't be practiced, attained, explained, or shown.",
        "source": "T06n0220_378:0955c26_29"
    },
    {
        "source_sentence": "「菩薩摩訶薩於眼識界，無行、無得、無說、無示；",
        "translation": "“Great enlightening beings have no practice, no attainment, no explanation, and no indication in the realm of visual consciousness.",
        "source": "T06n0220_378:0955c27_30"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意識界，無行、無得、無說、無示。",
        "translation": "In the ear, nose, tongue, body, and consciousness realms, there's no practice, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0955c28_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0955c29_32"
    },
    {
        "source_sentence": "眼識界自性乃至意識界自性，皆不可行、得、說、示故。",
        "translation": "The self-nature of the element consciousness of the eye and even the self-nature of the element consciousness of the mind are not to be practiced, acquired, explained or shown.",
        "source": "T06n0220_378:0955c29_33"
    },
    {
        "source_sentence": "「菩薩摩訶薩於眼觸，無行、無得、無說、無示；",
        "translation": "“Great enlightening beings have no action, no attainment, no explanation, and no indication regarding eye contact.",
        "source": "T06n0220_378:0956a02_34"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意觸，無行、無得、無說、無示。",
        "translation": "With respect to the contact of the ear, nose, tongue, body, and mind, there's no action, no attainment, no explanation, and no indication.",
        "source": "T06n0220_378:0956a03_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_378:0956a03_1"
    },
    {
        "source_sentence": "眼觸自性乃至意觸自性，皆不可行、得、說、示故。",
        "translation": "The self-nature of visual contact and even the self-nature of mental contact are all unmanifest, because they can't be practiced, attained, explained, or shown.",
        "source": "T06n0220_378:0956a04_2"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第三百七十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 3, Volume 38",
        "source": "T06n0220_378:0956a06_0"
    }
]