[
    {
        "source_sentence": "大般若波羅蜜多經卷第二百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2.1",
        "source": "T06n0220_210:0048a19_0"
    },
    {
        "source_sentence": "十",
        "translation": "ten",
        "source": "T06n0220_210:0048a20_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T06n0220_210:0048a22_0"
    },
    {
        "source_sentence": "初分難信解品第三十四之二十九",
        "translation": "The Thirty-fourth and Twenty-nineth Chapter of the First Part of the Discourse on the Difficulties of Faith",
        "source": "T06n0220_210:0048a23_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048a24_0"
    },
    {
        "source_sentence": "大空清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the perfection of generosity is purified, and because the perfection of generosity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048a24_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048a25_2"
    },
    {
        "source_sentence": "若大空清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the perfection of generosity is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048a25_3"
    },
    {
        "source_sentence": "大空清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because pure morality and even the perfection of wisdom are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048a27_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b01_5"
    },
    {
        "source_sentence": "若大空清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the pure precepts and even the perfection of wisdom are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048b01_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048b03_7"
    },
    {
        "source_sentence": "大空清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048b03_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b04_9"
    },
    {
        "source_sentence": "若大空清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048b04_10"
    },
    {
        "source_sentence": "大空清淨故外空、內外空、空空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，",
        "translation": "Because great emptiness is purified because external emptiness, internal and external emptiness, emptiness, emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all dharmas, inaccess",
        "source": "T06n0220_210:0048b06_11"
    },
    {
        "source_sentence": "外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "Because external emptiness and even the emptiness of the self-nature of nonexistence are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048b10_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b11_1"
    },
    {
        "source_sentence": "若大空清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if external emptiness or even the emptiness of the natureless self-nature are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048b11_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048b13_3"
    },
    {
        "source_sentence": "大空清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, the true nature is purified, and because the true nature is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048b13_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b14_5"
    },
    {
        "source_sentence": "若大空清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the true nature is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048b14_6"
    },
    {
        "source_sentence": "大空清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，",
        "translation": "Because the great emptiness is purified, the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, space realm, and inconceivable realm are purified.",
        "source": "T06n0220_210:0048b16_7"
    },
    {
        "source_sentence": "法界乃至不思議界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm and even the inconceivable realm are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048b18_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b19_9"
    },
    {
        "source_sentence": "若大空清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great emptiness is purified, if the Dharma realm and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048b19_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048b21_11"
    },
    {
        "source_sentence": "大空清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048b21_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b23_13"
    },
    {
        "source_sentence": "若大空清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the noble truth of suffering is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048b23_14"
    },
    {
        "source_sentence": "大空清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the noble truths of arising, ceasing, and the path are purified, and because the noble truths of arising, ceasing, and the path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048b25_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b26_16"
    },
    {
        "source_sentence": "若大空清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the noble truths of arising, ceasing, and the path are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048b26_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048b28_18"
    },
    {
        "source_sentence": "大空清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048b28_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048b29_20"
    },
    {
        "source_sentence": "若大空清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the four meditations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c01_21"
    },
    {
        "source_sentence": "大空清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c02_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048c04_23"
    },
    {
        "source_sentence": "若大空清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the four immeasurable and four formless concentrations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c04_24"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048c06_25"
    },
    {
        "source_sentence": "大空清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c06_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048c08_27"
    },
    {
        "source_sentence": "若大空清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the eight liberations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c08_28"
    },
    {
        "source_sentence": "大空清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c10_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048c12_1"
    },
    {
        "source_sentence": "若大空清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great emptiness is purified, if the eight abodes of excellence, the nine graduated concentrations, and the ten universal abodes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c12_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048c14_3"
    },
    {
        "source_sentence": "大空清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c14_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048c15_5"
    },
    {
        "source_sentence": "若大空清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the four abodes of mindfulness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c15_6"
    },
    {
        "source_sentence": "大空清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "Because great emptiness is purified, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified.",
        "source": "T06n0220_210:0048c17_7"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "Because the fourfold correct elimination and even the eightfold noble path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c19_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048c20_9"
    },
    {
        "source_sentence": "若大空清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the fourfold correct elimination and even the eightfold noble path are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c20_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048c22_11"
    },
    {
        "source_sentence": "大空清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the great gate of liberation through emptiness is purified, the gate of liberation through emptiness is purified, and because the gate of liberation through emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c22_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048c23_13"
    },
    {
        "source_sentence": "若大空清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great emptiness is purified, if the liberation gate of emptiness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c24_14"
    },
    {
        "source_sentence": "大空清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the liberation gate of marklessness and wishlessness is purified, and because the liberation gate of marklessness and wishlessness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c25_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0048c27_16"
    },
    {
        "source_sentence": "若大空清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great emptiness is purified, if the liberation gate of marklessness and wishlessness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0048c27_17"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0048c29_18"
    },
    {
        "source_sentence": "大空清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the bodhisattva's ten stages are purified, and because the bodhisattva's ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0048c29_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a02_20"
    },
    {
        "source_sentence": "若大空清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the bodhisattva's ten stages are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a02_21"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049a05_0"
    },
    {
        "source_sentence": "大空清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049a05_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a06_2"
    },
    {
        "source_sentence": "若大空清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a06_3"
    },
    {
        "source_sentence": "大空清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, the six supernormal powers are purified, and because the six supernormal powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049a08_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a09_5"
    },
    {
        "source_sentence": "若大空清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the six supernormal powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a09_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049a11_7"
    },
    {
        "source_sentence": "大空清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049a11_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a12_9"
    },
    {
        "source_sentence": "若大空清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the Buddha's ten powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a12_10"
    },
    {
        "source_sentence": "大空清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "Because great emptiness is purified, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles are purified.",
        "source": "T06n0220_210:0049a14_11"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "Because the four fearlessnesses and even the 18 distinctive qualities of the buddhas are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049a16_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a17_13"
    },
    {
        "source_sentence": "若大空清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the four fearlessnesses and even the 18 Buddha-principles are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a17_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049a19_15"
    },
    {
        "source_sentence": "大空清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049a19_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a21_17"
    },
    {
        "source_sentence": "若大空清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the absence of forgetfulness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a21_18"
    },
    {
        "source_sentence": "大空清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the nature of constantly abiding equanimity is purified, and because the nature of constantly abiding equanimity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049a23_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a24_20"
    },
    {
        "source_sentence": "若大空清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the nature of constantly abiding equanimity is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a24_21"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049a26_22"
    },
    {
        "source_sentence": "大空清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, omniscience is purified, and because omniscience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049a26_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049a28_0"
    },
    {
        "source_sentence": "若大空清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if omniscience is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049a28_1"
    },
    {
        "source_sentence": "大空清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified, knowledge of all characteristics is purified.",
        "source": "T06n0220_210:0049a29_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b02_3"
    },
    {
        "source_sentence": "若大空清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if knowledge of the path's characteristics and knowledge of all characteristics are purified, and if knowledge of all characteristics is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049b02_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049b04_5"
    },
    {
        "source_sentence": "大空清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, all dhāraṇī aspects are purified, and because all dhāraṇī aspects are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_210:0049b04_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b06_7"
    },
    {
        "source_sentence": "若大空清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great emptiness is purified, if all dhāraṇī aspects are purified, and if all cognition and knowledge are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049b06_8"
    },
    {
        "source_sentence": "大空清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, all the approaches to samādhi are purified, and because all the approaches to samādhi are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_210:0049b08_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b10_10"
    },
    {
        "source_sentence": "若大空清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the great emptiness is purified, if all the approaches to samādhi are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049b10_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049b13_0"
    },
    {
        "source_sentence": "大空清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the fruit of stream-winnership is purified, and because the fruit of stream-winnership is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049b13_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b14_2"
    },
    {
        "source_sentence": "若大空清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the fruit of pre-flow is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049b14_3"
    },
    {
        "source_sentence": "大空清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, the once-returner, nonreturner, and arhatship fruits are purified, and because the once-returner, nonreturner, and arhatship fruits are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049b16_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b18_5"
    },
    {
        "source_sentence": "若大空清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049b18_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049b20_7"
    },
    {
        "source_sentence": "大空清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049b20_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b21_9"
    },
    {
        "source_sentence": "若大空清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if pratyekabuddha's enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049b22_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049b23_1"
    },
    {
        "source_sentence": "大空清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the great emptiness is purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_210:0049b23_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b25_3"
    },
    {
        "source_sentence": "若大空清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if all bodhisattva-mahāsattva practices are purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049b25_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049b27_5"
    },
    {
        "source_sentence": "大空清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "Because great emptiness is purified, the buddhas' unsurpassed correct perfect enlightenment is purified, and because the buddhas' unsurpassed correct perfect enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049b27_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049b29_7"
    },
    {
        "source_sentence": "若大空清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If great emptiness is purified, if the buddhas' unsurpassed perfect enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049c01_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_210:0049c03_0"
    },
    {
        "source_sentence": "勝義空清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c03_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c04_2"
    },
    {
        "source_sentence": "若勝義空清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if form is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049c04_3"
    },
    {
        "source_sentence": "勝義空清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, volition, and consciousness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c06_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c07_5"
    },
    {
        "source_sentence": "若勝義空清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049c07_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049c09_7"
    },
    {
        "source_sentence": "勝義空清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the locus of the eye is purified, and because the locus of the eye is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c09_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c10_9"
    },
    {
        "source_sentence": "若勝義空清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the sense-field of the eye is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049c11_10"
    },
    {
        "source_sentence": "勝義空清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the sense-fields of ear, nose, tongue, body, and mind are purified, and because the sense-fields of ear, nose, tongue, body, and mind are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c12_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c14_12"
    },
    {
        "source_sentence": "若勝義空清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the ear, nose, tongue, body, and mind sense-fields are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_210:0049c14_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049c16_14"
    },
    {
        "source_sentence": "勝義空清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c16_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c17_16"
    },
    {
        "source_sentence": "若勝義空清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the form realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049c18_17"
    },
    {
        "source_sentence": "勝義空清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the sense-fields of sound, smell, taste, touch, and dharmas are purified, and because the sense-fields of sound, smell, taste, touch, and dharmas are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c19_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c21_19"
    },
    {
        "source_sentence": "若勝義空清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the sense-field of sound, smell, taste, touch, and dharmas are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_210:0049c21_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0049c23_21"
    },
    {
        "source_sentence": "勝義空清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the eye realm is purified, and because the eye realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c23_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c24_23"
    },
    {
        "source_sentence": "若勝義空清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the eye realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0049c25_24"
    },
    {
        "source_sentence": "勝義空清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the ultimate emptiness is purified that the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified, and because the form realm and even the sensations that arise from eye contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0049c26_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0049c29_26"
    },
    {
        "source_sentence": "若勝義空清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if form realm and even sensations that arise from visual contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0049c29_27"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a02_28"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050a02_29"
    },
    {
        "source_sentence": "勝義空清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the ear realm is purified, and because the ear realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050a02_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050a04_31"
    },
    {
        "source_sentence": "若勝義空清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the ear realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a04_32"
    },
    {
        "source_sentence": "勝義空清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the ultimate truth of emptiness is purified, then the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as a condition are purified, and if the sound realm and even the sensations that arise from ear contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_210:0050a05_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050a08_34"
    },
    {
        "source_sentence": "若勝義空清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if the sound realm and even the sensations that arise from ear contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0050a08_35"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a10_36"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050a10_37"
    },
    {
        "source_sentence": "勝義空清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the nasal realm is purified, and because the nasal realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050a11_38"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050a12_39"
    },
    {
        "source_sentence": "若勝義空清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the nose realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a12_40"
    },
    {
        "source_sentence": "勝義空清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the ultimate truth of emptiness is purified, then the sense element of fragrance, the sense element of nose consciousness, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and if the sense element of fragrance and even the sensations that arise from nasal contact as a condition are purified, then omniscience and cognitio",
        "source": "T06n0220_210:0050a14_41"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050a16_42"
    },
    {
        "source_sentence": "若勝義空清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if the sense element of fragrance and even the sensations that arise from nasal contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0050a17_0"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a18_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050a19_2"
    },
    {
        "source_sentence": "勝義空清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050a19_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050a20_4"
    },
    {
        "source_sentence": "若勝義空清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the tongue realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a20_5"
    },
    {
        "source_sentence": "勝義空清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "If the ultimate truth of emptiness is purified, then the taste realm, the tongue consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are purified, and if the taste realm and even the sensations that arise from tongue contact as a condition are purified, then omniscience and cognition are purified.",
        "source": "T06n0220_210:0050a22_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050a25_7"
    },
    {
        "source_sentence": "若勝義空清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if the taste realm and even the sensations that arise from tongue contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0050a25_8"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a26_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050a27_10"
    },
    {
        "source_sentence": "勝義空清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the body realm is purified, and because the body realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050a27_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050a28_12"
    },
    {
        "source_sentence": "若勝義空清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050a29_0"
    },
    {
        "source_sentence": "勝義空清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the ultimate emptiness is purified that the sense element of touch, the body consciousness element, and the sensations that arise from body contact and body contact as a condition are purified, and because the sense element of touch and even the sensations that arise from body contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0050b01_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050b04_2"
    },
    {
        "source_sentence": "若勝義空清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if the sense element of touch and even sensations that arise from bodily contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0050b04_3"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050b06_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050b06_5"
    },
    {
        "source_sentence": "勝義空清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the mind realm is purified, and because the mind realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050b06_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050b08_7"
    },
    {
        "source_sentence": "若勝義空清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050b08_8"
    },
    {
        "source_sentence": "勝義空清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the ultimate emptiness is purified that the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are purified, and because the Dharma realm and even the sensations that arise from mental contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0050b09_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050b12_10"
    },
    {
        "source_sentence": "若勝義空清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if the Dharma realm and even the sensations that arise from mental contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0050b12_11"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050b14_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050b14_13"
    },
    {
        "source_sentence": "勝義空清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the earth realm is purified, and because the earth realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050b15_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050b16_1"
    },
    {
        "source_sentence": "若勝義空清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050b16_2"
    },
    {
        "source_sentence": "勝義空清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the water, fire, air, space, and consciousness realms are purified, and because the water, fire, air, space, and consciousness realms are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050b18_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050b19_4"
    },
    {
        "source_sentence": "若勝義空清淨，若水、火、風、空、識界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if water, fire, wind, space, and the consciousness realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_210:0050b19_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050b21_6"
    },
    {
        "source_sentence": "勝義空清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, nescience is purified, and because nescience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050b21_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050b23_8"
    },
    {
        "source_sentence": "若勝義空清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if ignorance is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050b23_9"
    },
    {
        "source_sentence": "勝義空清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，",
        "translation": "Because ultimate emptiness is purified, form, consciousness, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, and vexation are purified.",
        "source": "T06n0220_210:0050b25_0"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "Because the practice and even old age, sorrow, pain, and vexation are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050b26_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050b27_2"
    },
    {
        "source_sentence": "若勝義空清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if practice and even old age, sorrow, pain, and vexation are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_210:0050b27_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050c01_0"
    },
    {
        "source_sentence": "勝義空清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the perfection of generosity is purified, and because the perfection of generosity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050c01_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050c02_2"
    },
    {
        "source_sentence": "若勝義空清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the perfection of generosity is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050c03_0"
    },
    {
        "source_sentence": "勝義空清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because pure morality and even the perfection of wisdom are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050c04_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050c07_2"
    },
    {
        "source_sentence": "若勝義空清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the pure precepts and even the perfection of wisdom are purified, and if the knowledge of all things is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050c07_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050c09_4"
    },
    {
        "source_sentence": "勝義空清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050c09_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050c10_6"
    },
    {
        "source_sentence": "若勝義空清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050c11_7"
    },
    {
        "source_sentence": "勝義空清淨故外空、內外空、空空、大空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，",
        "translation": "Because ultimate emptiness is purified because external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, emptiness of becoming, emptiness of non-being, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of self",
        "source": "T06n0220_210:0050c12_8"
    },
    {
        "source_sentence": "外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "Because external emptiness and even the emptiness of the self-nature of nonexistence are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050c16_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050c17_10"
    },
    {
        "source_sentence": "若勝義空清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if external emptiness or even the emptiness of the natureless self-nature are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050c17_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050c19_12"
    },
    {
        "source_sentence": "勝義空清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, the true nature is purified, and because the true nature is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050c19_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050c21_14"
    },
    {
        "source_sentence": "若勝義空清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if true thusness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050c21_15"
    },
    {
        "source_sentence": "勝義空清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，",
        "translation": "It's because the ultimate emptiness is purified that the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, space realm, and inconceivable realm are purified.",
        "source": "T06n0220_210:0050c22_16"
    },
    {
        "source_sentence": "法界乃至不思議界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm and even the inconceivable realm are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050c25_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050c26_18"
    },
    {
        "source_sentence": "若勝義空清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the Dharma realm and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050c26_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0050c28_20"
    },
    {
        "source_sentence": "勝義空清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0050c28_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0050c29_22"
    },
    {
        "source_sentence": "若勝義空清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the noble truth of suffering is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0050c29_23"
    },
    {
        "source_sentence": "勝義空清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the noble truths of arising, ceasing, and the path are purified, and because the noble truths of arising, ceasing, and the path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a02_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051a04_25"
    },
    {
        "source_sentence": "若勝義空清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the noble truths of arising, ceasing, and the path are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051a04_26"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051a06_27"
    },
    {
        "source_sentence": "勝義空清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a06_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051a07_29"
    },
    {
        "source_sentence": "若勝義空清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the four meditations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051a07_30"
    },
    {
        "source_sentence": "勝義空清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a09_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051a11_32"
    },
    {
        "source_sentence": "若勝義空清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the four immeasurable and four formless concentrations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051a11_33"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051a13_34"
    },
    {
        "source_sentence": "勝義空清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a13_35"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051a15_36"
    },
    {
        "source_sentence": "若勝義空清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the eight liberations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051a15_37"
    },
    {
        "source_sentence": "勝義空清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "Because the ultimate emptiness is purified, the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a16_38"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051a19_39"
    },
    {
        "source_sentence": "若勝義空清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0051a19_40"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051a20_41"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051a21_42"
    },
    {
        "source_sentence": "勝義空清淨故四念住清淨，四念住清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the four abodes of mindfulness are purified, and because the four abodes of mindfulness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a21_43"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051a22_44"
    },
    {
        "source_sentence": "若勝義空清淨，若四念住清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the four abodes of mindfulness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051a23_45"
    },
    {
        "source_sentence": "勝義空清淨故四正斷、四神足、五根、五力、七等覺支、八聖道支清淨，",
        "translation": "Because ultimate emptiness is purified, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path are purified.",
        "source": "T06n0220_210:0051a24_46"
    },
    {
        "source_sentence": "四正斷乃至八聖道支清淨故一切智智清淨。",
        "translation": "Because the fourfold correct elimination and even the eightfold noble path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a26_47"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051a27_48"
    },
    {
        "source_sentence": "若勝義空清淨，若四正斷乃至八聖道支清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the fourfold correct elimination and even the eightfold noble path are purified, and if the knowledge of all things is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051a27_49"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051a29_50"
    },
    {
        "source_sentence": "勝義空清淨故空解脫門清淨，空解脫門清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the gate of liberation through emptiness is purified, and because the gate of liberation through emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051a29_51"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b02_52"
    },
    {
        "source_sentence": "若勝義空清淨，若空解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the liberation gate of emptiness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b02_53"
    },
    {
        "source_sentence": "勝義空清淨故無相、無願解脫門清淨，無相、無願解脫門清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the liberation gate of marklessness and wishlessness is purified, and because the liberation gate of marklessness and wishlessness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051b04_54"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b06_55"
    },
    {
        "source_sentence": "若勝義空清淨，若無相、無願解脫門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the liberation gate of marklessness and wishlessness is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b06_56"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051b08_57"
    },
    {
        "source_sentence": "勝義空清淨故菩薩十地清淨，菩薩十地清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the bodhisattva's ten stages are purified, and because the bodhisattva's ten stages are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051b08_58"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b09_59"
    },
    {
        "source_sentence": "若勝義空清淨，若菩薩十地清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the bodhisattva's ten stages are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b10_60"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051b12_0"
    },
    {
        "source_sentence": "勝義空清淨故五眼清淨，五眼清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the five eyes are purified, and because the five eyes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051b12_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b13_2"
    },
    {
        "source_sentence": "若勝義空清淨，若五眼清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the five eyes are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b13_3"
    },
    {
        "source_sentence": "勝義空清淨故六神通清淨，六神通清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, the six supernormal powers are purified, and because the six supernormal powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051b15_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b16_5"
    },
    {
        "source_sentence": "若勝義空清淨，若六神通清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the six supernormal powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b16_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051b18_7"
    },
    {
        "source_sentence": "勝義空清淨故佛十力清淨，佛十力清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the Buddha's ten powers are purified, and because the Buddha's ten powers are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051b18_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b20_0"
    },
    {
        "source_sentence": "若勝義空清淨，若佛十力清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the Buddha's ten powers are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b20_1"
    },
    {
        "source_sentence": "勝義空清淨故四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法清淨，",
        "translation": "Because ultimate emptiness is purified, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the 18 Buddha-principles are purified.",
        "source": "T06n0220_210:0051b21_2"
    },
    {
        "source_sentence": "四無所畏乃至十八佛不共法清淨故一切智智清淨。",
        "translation": "Because the four fearlessnesses and even the 18 distinctive qualities of the buddhas are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051b23_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b24_4"
    },
    {
        "source_sentence": "若勝義空清淨，若四無所畏乃至十八佛不共法清淨，若一切智智清淨，",
        "translation": "If ultimate emptiness is purified, if the four fearlessnesses and even the 18 unique qualities of buddhas are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0051b25_5"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b26_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051b27_7"
    },
    {
        "source_sentence": "勝義空清淨故無忘失法清淨，無忘失法清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, the principle of no forgetfulness is purified, and because the principle of no forgetfulness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051b27_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051b28_9"
    },
    {
        "source_sentence": "若勝義空清淨，若無忘失法清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the absence of forgetfulness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051b29_10"
    },
    {
        "source_sentence": "勝義空清淨故恒住捨性清淨，恒住捨性清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the nature of constantly abiding equanimity is purified, and because the nature of constantly abiding equanimity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051c01_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051c03_12"
    },
    {
        "source_sentence": "若勝義空清淨，若恒住捨性清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the nature of constantly abiding equanimity is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051c03_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051c05_14"
    },
    {
        "source_sentence": "勝義空清淨故一切智清淨，一切智清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, omniscience is purified, and because omniscience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051c05_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051c06_16"
    },
    {
        "source_sentence": "若勝義空清淨，若一切智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if omniscience is purified, and if omniscience is purified, it's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051c06_17"
    },
    {
        "source_sentence": "勝義空清淨故道相智、一切相智清淨，道相智、一切相智清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, knowledge of the path and knowledge of all characteristics are purified, and because knowledge of the path and knowledge of all characteristics are purified, knowledge of all characteristics is purified.",
        "source": "T06n0220_210:0051c08_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051c10_19"
    },
    {
        "source_sentence": "若勝義空清淨，若道相智、一切相智清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if knowledge of the path and knowledge of all characteristics are purified, and if knowledge of all characteristics is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051c10_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051c12_21"
    },
    {
        "source_sentence": "勝義空清淨故一切陀羅尼門清淨，一切陀羅尼門清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, all dhāraṇī aspects are purified, and because all dhāraṇī aspects are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_210:0051c12_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051c14_23"
    },
    {
        "source_sentence": "若勝義空清淨，若一切陀羅尼門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if all dhāraṇī aspects are purified, and if all cognition and knowledge are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051c14_24"
    },
    {
        "source_sentence": "勝義空清淨故一切三摩地門清淨，一切三摩地門清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, all samādhi aspects are purified, and because all samādhi aspects are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_210:0051c16_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051c18_26"
    },
    {
        "source_sentence": "若勝義空清淨，若一切三摩地門清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if all the aspects of samādhi are purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051c18_27"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051c21_0"
    },
    {
        "source_sentence": "勝義空清淨故預流果清淨，預流果清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, the fruit of stream-winnership is purified, and because the fruit of stream-winnership is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051c21_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051c22_2"
    },
    {
        "source_sentence": "若勝義空清淨，若預流果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the fruit of pre-flow is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051c22_3"
    },
    {
        "source_sentence": "勝義空清淨故一來、不還、阿羅漢果清淨，一來、不還、阿羅漢果清淨故一切智智清淨。",
        "translation": "Because the ultimate emptiness is purified, the once-returner, nonreturner, and arhatship fruits are purified, and because the once-returner, nonreturner, and arhatship fruits are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051c24_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0051c26_5"
    },
    {
        "source_sentence": "若勝義空清淨，若一來、不還、阿羅漢果清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if the once-returner, nonreturner, and arhatship fruits are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0051c26_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0051c28_7"
    },
    {
        "source_sentence": "勝義空清淨故獨覺菩提清淨，獨覺菩提清淨故一切智智清淨。",
        "translation": "Because ultimate emptiness is purified, pratyekabuddha's enlightenment is purified, and because pratyekabuddha's enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0051c28_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a01_9"
    },
    {
        "source_sentence": "若勝義空清淨，若獨覺菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if pratyekabuddha's enlightenment is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a01_10"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052a03_11"
    },
    {
        "source_sentence": "勝義空清淨故一切菩薩摩訶薩行清淨，一切菩薩摩訶薩行清淨故一切智智清淨。",
        "translation": "Because the ultimate truth of emptiness is purified, all bodhisattva-mahāsattva practices are purified, and because all bodhisattva-mahāsattva practices are purified, all cognition and knowledge are purified.",
        "source": "T06n0220_210:0052a03_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a05_13"
    },
    {
        "source_sentence": "若勝義空清淨，若一切菩薩摩訶薩行清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If ultimate emptiness is purified, if all bodhisattva-mahāsattva practices are purified, and if all cognition and knowledge are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a05_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052a07_15"
    },
    {
        "source_sentence": "勝義空清淨故諸佛無上正等菩提清淨，諸佛無上正等菩提清淨故一切智智清淨。",
        "translation": "Because the ultimate emptiness is purified, the buddhas' unsurpassed correct perfect enlightenment is purified, and because the buddhas' unsurpassed correct perfect enlightenment is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052a07_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a09_17"
    },
    {
        "source_sentence": "若勝義空清淨，若諸佛無上正等菩提清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If the ultimate truth of emptiness is purified, if the buddhas' unsurpassed perfect enlightenment is purified, and if the knowledge of all cognitions is purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a09_18"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T06n0220_210:0052a12_0"
    },
    {
        "source_sentence": "有為空清淨故色清淨，色清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, form is purified, and because form is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052a12_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a13_2"
    },
    {
        "source_sentence": "若有為空清淨，若色清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if form is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a13_3"
    },
    {
        "source_sentence": "有為空清淨故受、想、行、識清淨，受、想、行、識清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, feeling, perception, volition, and consciousness are purified, and because feeling, perception, volition, volition, and consciousness are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052a15_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a16_5"
    },
    {
        "source_sentence": "若有為空清淨，若受、想、行、識清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if feeling, perception, volition, and consciousness are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a16_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052a18_7"
    },
    {
        "source_sentence": "有為空清淨故眼處清淨，眼處清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the locus of the eye is purified, and because the locus of the eye is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052a18_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a19_9"
    },
    {
        "source_sentence": "若有為空清淨，若眼處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the sense-field of the eye is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a20_10"
    },
    {
        "source_sentence": "有為空清淨故耳、鼻、舌、身、意處清淨，耳、鼻、舌、身、意處清淨故一切智智清淨。",
        "translation": "It's because artificial emptiness is purified that the ear, nose, tongue, body, and mind sense-fields are purified, and because the ear, nose, tongue, body, and mind sense-fields are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0052a21_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a23_12"
    },
    {
        "source_sentence": "若有為空清淨，若耳、鼻、舌、身、意處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If conditioned emptiness is purified, if the ear, nose, tongue, body, and mind are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a23_13"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052a25_14"
    },
    {
        "source_sentence": "有為空清淨故色處清淨，色處清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the form realm is purified, and because the form realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052a25_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052a26_16"
    },
    {
        "source_sentence": "若有為空清淨，若色處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the form realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052a27_17"
    },
    {
        "source_sentence": "有為空清淨故聲、香、味、觸、法處清淨，聲、香、味、觸、法處清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the sense-fields of sound, smell, taste, touch, and dharmas are purified, and because the sense-fields of sound, smell, taste, touch, and dharmas are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052a28_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b01_19"
    },
    {
        "source_sentence": "若有為空清淨，若聲、香、味、觸、法處清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the sense-field of sound, smell, taste, touch, and dharmas are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_210:0052b01_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052b03_21"
    },
    {
        "source_sentence": "有為空清淨故眼界清淨，眼界清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the eye realm is purified, and because the eye realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052b03_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b04_23"
    },
    {
        "source_sentence": "若有為空清淨，若眼界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the eye realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052b05_24"
    },
    {
        "source_sentence": "有為空清淨故色界、眼識界及眼觸、眼觸為緣所生諸受清淨，色界乃至眼觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the form realm, the eye consciousness realm, and the sensations that arise from eye contact and eye contact as a condition are purified because the artificial emptiness is purified, and it's because the form realm and even the sensations that arise from eye contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0052b06_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b09_26"
    },
    {
        "source_sentence": "若有為空清淨，若色界乃至眼觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If conditioned emptiness is purified, if form realm and even sensations that arise from visual contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0052b09_27"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052b11_28"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052b11_29"
    },
    {
        "source_sentence": "有為空清淨故耳界清淨，耳界清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the ear realm is purified, and because the ear realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052b11_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b13_31"
    },
    {
        "source_sentence": "若有為空清淨，若耳界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the ear realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052b13_32"
    },
    {
        "source_sentence": "有為空清淨故聲界、耳識界及耳觸、耳觸為緣所生諸受清淨，聲界乃至耳觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the conditioned emptiness is purified that the sound realm, the ear consciousness realm, and the sensations that arise from ear contact and ear contact as a condition are purified, and because the sound realm and even the sensations that arise from ear contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0052b15_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b17_1"
    },
    {
        "source_sentence": "若有為空清淨，若聲界乃至耳觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If conditioned emptiness is purified if the sound realm or even sensations that arise from ear contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0052b17_2"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052b19_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052b20_0"
    },
    {
        "source_sentence": "有為空清淨故鼻界清淨，鼻界清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the nasal realm is purified, and because the nasal realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052b20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b21_2"
    },
    {
        "source_sentence": "若有為空清淨，若鼻界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the nose realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052b21_3"
    },
    {
        "source_sentence": "有為空清淨故香界、鼻識界及鼻觸、鼻觸為緣所生諸受清淨，香界乃至鼻觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the artificial emptiness is purified that the sense element of fragrance, the sense element of nasal consciousness, and the sensations that arise from nasal contact and nasal contact as a condition are purified, and because the sense element of fragrance and even the sensations that arise from nasal contact as a condition are purified that omniscience and cognition are",
        "source": "T06n0220_210:0052b23_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b25_5"
    },
    {
        "source_sentence": "若有為空清淨，若香界乃至鼻觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If conditioned emptiness is purified if the sense element of fragrance or even sensations that arise from nasal contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0052b26_6"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052b27_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052b28_8"
    },
    {
        "source_sentence": "有為空清淨故舌界清淨，舌界清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the tongue realm is purified, and because the tongue realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052b28_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052b29_10"
    },
    {
        "source_sentence": "若有為空清淨，若舌界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the tongue realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052b29_11"
    },
    {
        "source_sentence": "有為空清淨故味界、舌識界及舌觸、舌觸為緣所生諸受清淨，味界乃至舌觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the artificial emptiness is purified that the taste realm, the tongue consciousness realm, and the sensations that arise from tongue contact and tongue contact as a condition are purified, and because the taste realm and even the sensations that arise from tongue contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0052c02_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052c05_13"
    },
    {
        "source_sentence": "若有為空清淨，若味界乃至舌觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If conditioned emptiness of existence is purified, if the taste realm and even sensations that arise from tongue contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0052c05_14"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052c07_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052c07_1"
    },
    {
        "source_sentence": "有為空清淨故身界清淨，身界清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the body realm is purified, and because the body realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052c07_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052c08_3"
    },
    {
        "source_sentence": "若有為空清淨，若身界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the body realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052c09_4"
    },
    {
        "source_sentence": "有為空清淨故觸界、身識界及身觸、身觸為緣所生諸受清淨，觸界乃至身觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the artificial emptiness is purified that the sense element of touch, the body consciousness element, and the sensations that arise from body contact and body contact as a condition are purified, and because the sense element of touch and even the sensations that arise from body contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0052c10_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052c13_6"
    },
    {
        "source_sentence": "若有為空清淨，若觸界乃至身觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If conditioned emptiness is purified if the sense element of touch and even sensations that arise from bodily contact as a condition are purified, and if omniscience and cognition are purified",
        "source": "T06n0220_210:0052c13_7"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052c15_8"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052c15_9"
    },
    {
        "source_sentence": "有為空清淨故意界清淨，意界清淨故一切智智清淨。",
        "translation": "Because the realm of artificial emptiness is purified, the mental realm is purified, and because the mental realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052c15_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052c17_11"
    },
    {
        "source_sentence": "若有為空清淨，若意界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the mind realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052c17_12"
    },
    {
        "source_sentence": "有為空清淨故法界、意識界及意觸、意觸為緣所生諸受清淨，法界乃至意觸為緣所生諸受清淨故一切智智清淨。",
        "translation": "It's because the artificial emptiness is purified that the Dharma realm, the consciousness realm, and the sensations that arise from mental contact and mental contact as a condition are purified, and because the Dharma realm and even the sensations that arise from mental contact as a condition are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0052c19_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052c21_14"
    },
    {
        "source_sentence": "若有為空清淨，若法界乃至意觸為緣所生諸受清淨，若一切智智清淨，",
        "translation": "If the conditioned emptiness of existent things is purified, if the Dharma realm and even the sensations that arise from mental contact as a condition are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0052c21_15"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052c23_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0052c24_17"
    },
    {
        "source_sentence": "有為空清淨故地界清淨，地界清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the earth realm is purified, and because the earth realm is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0052c24_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052c25_19"
    },
    {
        "source_sentence": "若有為空清淨，若地界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the earth realm is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052c25_20"
    },
    {
        "source_sentence": "有為空清淨故水、火、風、空、識界清淨，水、火、風、空、識界清淨故一切智智清淨。",
        "translation": "It's because the artificial emptiness is purified that the water, fire, air, space, and consciousness realms are purified, and because the water, fire, air, space, and consciousness realms are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0052c27_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0052c29_22"
    },
    {
        "source_sentence": "若有為空清淨，若水、火、風、空、識界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if water, fire, air, space, and the consciousness realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0052c29_23"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0053a02_24"
    },
    {
        "source_sentence": "有為空清淨故無明清淨，無明清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, nescience is purified, and because nescience is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053a02_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053a03_26"
    },
    {
        "source_sentence": "若有為空清淨，若無明清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if ignorance is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053a03_27"
    },
    {
        "source_sentence": "有為空清淨故行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱清淨，",
        "translation": "Because conditioned emptiness is purified because form, consciousness, name-and-form, the six sense-fields, touch, feeling, sensation, craving, apprehension, existence, birth, old age, sorrow, pain, and vexation are purified.",
        "source": "T06n0220_210:0053a05_28"
    },
    {
        "source_sentence": "行乃至老死愁歎苦憂惱清淨故一切智智清淨。",
        "translation": "Because the practice and even old age, sorrow, pain, and vexation are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053a07_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053a08_30"
    },
    {
        "source_sentence": "若有為空清淨，若行乃至老死愁歎苦憂惱清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If conditioned emptiness is purified, if practice and even the sorrow, pain, and vexation of old age and death are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, no separations, and no eliminations.",
        "source": "T06n0220_210:0053a08_31"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0053a11_0"
    },
    {
        "source_sentence": "有為空清淨故布施波羅蜜多清淨，布施波羅蜜多清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the perfection of generosity is purified, and because the perfection of generosity is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053a11_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053a12_2"
    },
    {
        "source_sentence": "若有為空清淨，若布施波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the perfection of generosity is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053a13_0"
    },
    {
        "source_sentence": "有為空清淨故淨戒、安忍、精進、靜慮、般若波羅蜜多清淨，淨戒乃至般若波羅蜜多清淨故一切智智清淨。",
        "translation": "It's because artificial emptiness is purified that pure morality, patience, effort, meditation, and the perfection of wisdom are purified, and because pure morality and even the perfection of wisdom are purified that omniscience and cognition are purified.",
        "source": "T06n0220_210:0053a14_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053a17_2"
    },
    {
        "source_sentence": "若有為空清淨，若淨戒乃至般若波羅蜜多清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the pure precepts and even the perfection of wisdom are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053a17_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0053a19_4"
    },
    {
        "source_sentence": "有為空清淨故內空清淨，內空清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, internal emptiness is purified, and because internal emptiness is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053a19_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053a20_6"
    },
    {
        "source_sentence": "若有為空清淨，若內空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if internal emptiness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053a21_7"
    },
    {
        "source_sentence": "有為空清淨故外空、內外空、空空、大空、勝義空、無為空、畢竟空、無際空、散空、無變異空、本性空、自相空、共相空、一切法空、不可得空、無性空、自性空、無性自性空清淨，",
        "translation": "Because conditioned emptiness is purified because external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness of original nature, emptiness of own-form, emptiness of shared form, emptiness of all dharmas,",
        "source": "T06n0220_210:0053a22_8"
    },
    {
        "source_sentence": "外空乃至無性自性空清淨故一切智智清淨。",
        "translation": "Because external emptiness and even the emptiness of the self-nature of nonexistence are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053a26_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053a27_10"
    },
    {
        "source_sentence": "若有為空清淨，若外空乃至無性自性空清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if external emptiness or even the emptiness of the natureless self-nature are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053a27_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0053a29_12"
    },
    {
        "source_sentence": "有為空清淨故真如清淨，真如清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the true nature is purified, and because the true nature is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053a29_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b02_14"
    },
    {
        "source_sentence": "若有為空清淨，若真如清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if true thusness is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053b02_15"
    },
    {
        "source_sentence": "有為空清淨故法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界清淨，",
        "translation": "It's because the Dharma realm, Dharma nature, non-falsity, unchanging dissimilarity, equality, freedom from arising, legality, Dharma abiding, reality, space realm, and inconceivable realm are purified because artificial emptiness is purified.",
        "source": "T06n0220_210:0053b03_16"
    },
    {
        "source_sentence": "法界乃至不思議界清淨故一切智智清淨。",
        "translation": "Because the Dharma realm and even the inconceivable realm are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053b06_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b07_18"
    },
    {
        "source_sentence": "若有為空清淨，若法界乃至不思議界清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the Dharma realm and even the inconceivable realm are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053b07_19"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0053b09_20"
    },
    {
        "source_sentence": "有為空清淨故苦聖諦清淨，苦聖諦清淨故一切智智清淨。",
        "translation": "Because conditioned emptiness is purified, the noble truth of suffering is purified, and because the noble truth of suffering is purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053b09_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b10_22"
    },
    {
        "source_sentence": "若有為空清淨，若苦聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If conditioned emptiness is purified, if the noble truth of suffering is purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053b11_0"
    },
    {
        "source_sentence": "有為空清淨故集、滅、道聖諦清淨，集、滅、道聖諦清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the noble truths of arising, ceasing, and the path are purified, and because the noble truths of arising, ceasing, and the path are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053b12_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b14_2"
    },
    {
        "source_sentence": "若有為空清淨，若集、滅、道聖諦清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If conditioned emptiness is purified, if the noble truths of arising, ceasing, and the path are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053b14_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0053b16_4"
    },
    {
        "source_sentence": "有為空清淨故四靜慮清淨，四靜慮清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the four meditations are purified, and because the four meditations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053b16_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b17_6"
    },
    {
        "source_sentence": "若有為空清淨，若四靜慮清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the four meditations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053b18_0"
    },
    {
        "source_sentence": "有為空清淨故四無量、四無色定清淨，四無量、四無色定清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the four immeasurable and four formless concentrations are purified, and because the four immeasurable and four formless concentrations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053b19_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b21_2"
    },
    {
        "source_sentence": "若有為空清淨，若四無量、四無色定清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If conditioned emptiness is purified, if the four immeasurable and four formless concentrations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053b21_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T06n0220_210:0053b23_4"
    },
    {
        "source_sentence": "有為空清淨故八解脫清淨，八解脫清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the eight liberations are purified, and because the eight liberations are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053b23_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b25_6"
    },
    {
        "source_sentence": "若有為空清淨，若八解脫清淨，若一切智智清淨，無二、無二分、無別、無斷故。",
        "translation": "If artificial emptiness is purified, if the eight liberations are purified, and if omniscience and cognition are purified, there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053b25_7"
    },
    {
        "source_sentence": "有為空清淨故八勝處、九次第定、十遍處清淨，八勝處、九次第定、十遍處清淨故一切智智清淨。",
        "translation": "Because artificial emptiness is purified, the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and because the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, omniscience and cognition are purified.",
        "source": "T06n0220_210:0053b27_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T06n0220_210:0053b29_9"
    },
    {
        "source_sentence": "若有為空清淨，若八勝處、九次第定、十遍處清淨，若一切智智清淨，",
        "translation": "If the eight abodes of liberation, the nine graduated concentrations, and the ten universal abodes are purified, and if omniscience and cognition are purified,",
        "source": "T06n0220_210:0053b29_10"
    },
    {
        "source_sentence": "無二、無二分、無別、無斷故。",
        "translation": "It's because there are no two, no dual parts, no distinctions, and no eliminations.",
        "source": "T06n0220_210:0053c02_11"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第二百一十",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 2, Volume 10",
        "source": "T06n0220_210:0053c03_0"
    }
]