[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 8",
        "source": "T07n0220_586:1029b18_0"
    },
    {
        "source_sentence": "十六",
        "translation": "sixteen",
        "source": "T07n0220_586:1029b19_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_586:1029b21_0"
    },
    {
        "source_sentence": "第十二淨戒波羅蜜多分之三",
        "translation": "The Twelfth Perfection of the Pure Precepts, Part Three",
        "source": "T07n0220_586:1029b22_0"
    },
    {
        "source_sentence": "「云何名為緣起善巧？",
        "translation": "What's called the skillfulness of conditioned arising?",
        "source": "T07n0220_586:1029b23_0"
    },
    {
        "source_sentence": "謂諸菩薩如實了知所有因緣種種自相，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法種種自相，",
        "translation": "It means that bodhisattvas truly know the various distinctive characteristics of all kinds of causes and conditions, and they truly know the various characteristics of all kinds of proximate conditions, perceptual objects, causal conditions, contributory conditions, and",
        "source": "T07n0220_586:1029b23_1"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029b26_2"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣種種自相皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法種種自相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all kinds of distinctive characteristics of causes and conditions are ungraspable; they truly know that all kinds of indirect causal conditions, all kinds of perceptual objects, all kind",
        "source": "T07n0220_586:1029b26_3"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029b29_4"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣種種共相，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法種種共相，",
        "translation": "“Furthermore, enlightening beings truly know all kinds of common characteristics of the causes and conditions that exist, and they truly know all kinds of unremitting causal conditions, conditioned causal conditions, dominant causal conditions, and",
        "source": "T07n0220_586:1029c01_0"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c03_1"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣種種共相皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法種種共相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all kinds of common characteristics of causes and conditions are ungraspable, and they truly know that all kinds of proximate conditions, all kinds of causal conditions, all kinds of",
        "source": "T07n0220_586:1029c04_0"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c07_1"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若常若無常皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若常若無常皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all causes and conditions— whether permanent or impermanent—cannot be obtained; they truly know that all similar and immediately antecedent conditions, all perceptual objects, all causal conditions, all dominant",
        "source": "T07n0220_586:1029c07_2"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c10_3"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若樂若苦皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若樂若苦皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all causes and conditions— whether pleasant or painful—cannot be obtained; they truly know that all similar and immediately antecedent conditions, all perceptual objects, all conditioned by perceptual objects",
        "source": "T07n0220_586:1029c11_4"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c14_5"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若我若無我皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若我若無我皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all causes and conditions—both self and selflessness—cannot be obtained, and they truly know that all conditioned phenomena such as self and selflessness are ungraspable.",
        "source": "T07n0220_586:1029c14_6"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c17_7"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若淨若不淨皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若淨若不淨皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all causes and conditions—whether pure or impure—cannot be obtained; they truly know that all equal and immediately antecedent conditions, all perceptual objects, all causal conditions, all",
        "source": "T07n0220_586:1029c18_8"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c21_9"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若空若不空皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若空若不空皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know all the causes and conditions that exist, whether empty or nonempty, are ungraspable; they truly know all the similar and immediately antecedent conditions, all the perceptual objects, all the causal",
        "source": "T07n0220_586:1029c21_10"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c24_11"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若有相若無相皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若有相若無相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all forms and formlessnesses of all causes and conditions are ungraspable. They truly know that all forms and formlessnesses of all similar and immediately antecedent conditions, as well as",
        "source": "T07n0220_586:1029c25_12"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1029c28_13"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若有願若無願皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若有願若無願皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all causes and conditions—whether they have vows or no vows—cannot be obtained. They truly know that all such proximate conditions as these, all conditioned by objects, all",
        "source": "T07n0220_586:1029c29_14"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a03_15"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若寂靜若不寂靜皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若寂靜若不寂靜皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know all the causes and conditions that exist, whether quiescent or not quiescent, are ungraspable; they truly know all the similar and immediately antecedent conditions, the condition as cause, the condition as object,",
        "source": "T07n0220_586:1030a03_16"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a07_17"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有因緣若遠離若不遠離皆不可得，如實了知所有等無間緣、所緣緣、增上緣及從諸緣所生諸法若遠離若不遠離皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all causes and conditions—whether distant or not distant—cannot be obtained; they truly know that all the similar and immediately antecedent conditions, the condition as cause, the condition as object, the",
        "source": "T07n0220_586:1030a07_18"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a10_19"
    },
    {
        "source_sentence": "「又諸菩薩如實了知所有無明種種自相，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死種種自相，",
        "translation": "“Furthermore, enlightening beings truly know all the various specific characteristics of nescience, and truly know all the various specific characteristics of volition, consciousness, name-and-form, the six sense-fields, touch,",
        "source": "T07n0220_586:1030a11_20"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a13_21"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明種種自相皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死種種自相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all the various specific characteristics of ignorance are ungraspable; they truly know that all the various specific characteristics of conditioning, consciousness, name-and-form, the six",
        "source": "T07n0220_586:1030a15_0"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a17_1"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明種種共相，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死種種共相，",
        "translation": "“Furthermore, enlightening beings truly know all the various common characteristics of ignorance; they truly know all the various common characteristics of conditioning, consciousness, name-and-form, the six sense-fields, touch,",
        "source": "T07n0220_586:1030a18_2"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a20_3"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明種種共相皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死種種共相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all the various common characteristics of ignorance are ungraspable; they truly know that all the various common characteristics of conditioning, consciousness, name-and-form, the six",
        "source": "T07n0220_586:1030a21_4"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a23_5"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若常若無常皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若常若無常皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable whether permanent or impermanent; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch, sensation",
        "source": "T07n0220_586:1030a24_6"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030a27_7"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若樂若苦皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若樂若苦皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable, whether pleasant or painful; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch, sensation",
        "source": "T07n0220_586:1030a27_8"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b01_9"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若我若無我皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若我若無我皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance, whether self or selfless, is ungraspable; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch,",
        "source": "T07n0220_586:1030b02_0"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b04_1"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若淨若不淨皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若淨若不淨皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable, whether pure or impure; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch, sensation",
        "source": "T07n0220_586:1030b05_2"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b08_3"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若空若不空皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若空若不空皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable whether empty or nonempty; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch, sensation",
        "source": "T07n0220_586:1030b08_4"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b11_5"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若有相若無相皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若有相若無相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable whether it has form or formlessness; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch",
        "source": "T07n0220_586:1030b12_6"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b15_7"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若有願若無願皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若有願若無願皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable whether wished or wished-for; they truly know that all formations, consciousnesses, names and forms, the six sense mediums, touch,",
        "source": "T07n0220_586:1030b15_8"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b18_9"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若寂靜若不寂靜皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若寂靜若不寂靜皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable whether quiescent or nonquiescent; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch,",
        "source": "T07n0220_586:1030b19_10"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b22_11"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有無明若遠離若不遠離皆不可得，如實了知所有行、識、名色、六處、觸、受、愛、取、有、生、老死若遠離若不遠離皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all ignorance is ungraspable, whether distant or not distant; they truly know that all formations, consciousnesses, names and forms, the six sense-fields, touch, sensation",
        "source": "T07n0220_586:1030b23_0"
    },
    {
        "source_sentence": "如是名為緣起善巧。",
        "translation": "This is called the skillfulness of conditioned arising.",
        "source": "T07n0220_586:1030b26_1"
    },
    {
        "source_sentence": "「云何名為是處非處善巧？",
        "translation": "What's called skillfulness in what's right and wrong?",
        "source": "T07n0220_586:1030b26_2"
    },
    {
        "source_sentence": "謂諸菩薩如實了知所有是處種種自相，如實了知所有非處種種自相，如是名為是處非處善巧。",
        "translation": "It means that bodhisattvas truly know the various distinctive characteristics of what's there and what's not there, and they truly know the various distinctive characteristics of what's not there and what's not there, which is called skillful",
        "source": "T07n0220_586:1030b27_3"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處種種自相皆不可得，如實了知所有非處種種自相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that the various characteristics of all places are ungraspable, and they truly know that the various characteristics of all non-places are ungraspable.",
        "source": "T07n0220_586:1030b29_4"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c02_5"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處種種共相，如實了知所有非處種種共相，如是名為是處非處善巧。",
        "translation": "Furthermore, bodhisattvas truly know the various common characteristics of what's present and what's not present, and they truly know the various common characteristics of what's not present and what's not present, which is called skillfulness",
        "source": "T07n0220_586:1030c03_6"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處種種共相皆不可得，如實了知所有非處種種共相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all kinds of common characteristics of locations are ungraspable. They truly know that all kinds of common characteristics of what’s not a place are ungraspable.",
        "source": "T07n0220_586:1030c05_7"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c07_8"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若常若無常皆不可得，如實了知所有非處若常若無常皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that whatever is permanent or impermanent cannot be found; they truly know that whatever is not permanent or impermanent cannot be found.",
        "source": "T07n0220_586:1030c08_9"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c10_10"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若樂若苦皆不可得，如實了知所有非處若樂若苦皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that neither pleasure nor pain at all can be found. They truly know that neither pleasure nor pain at all can be found.",
        "source": "T07n0220_586:1030c11_0"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c13_1"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若我若無我皆不可得，如實了知所有非處若我若無我皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all things are ungraspable where there is a self or no-self, and they truly know that all things are ungraspable where there is neither a self nor no-self.",
        "source": "T07n0220_586:1030c13_2"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c15_3"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若淨若不淨皆不可得，如實了知所有非處若淨若不淨皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all things are ungraspable, whether pure or impure; and they truly know that all things are ungraspable, whether pure or impure.",
        "source": "T07n0220_586:1030c16_4"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c18_5"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若空若不空皆不可得，如實了知所有非處若空若不空皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all existences are ungraspable whether empty or nonempty, and they truly know that all nonexistences are ungraspable whether empty or nonempty.",
        "source": "T07n0220_586:1030c19_6"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c21_7"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若有相若無相皆不可得，如實了知所有非處若有相若無相皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all things are ungraspable whether they have marks or no marks, and they truly know that all things are ungraspable whether they have marks or no marks.",
        "source": "T07n0220_586:1030c22_8"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c24_9"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若有願若無願皆不可得，如實了知所有非處若有願若無願皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all things are ungraspable where there is a vow or no vow, and they truly know that all things are ungraspable where there is a vow or no vow.",
        "source": "T07n0220_586:1030c25_10"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1030c27_11"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若寂靜若不寂靜皆不可得，如實了知所有非處若寂靜若不寂靜皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all things are ungraspable whether they are quiescent or not. They truly know that all things are ungraspable whether they are quiescent or not.",
        "source": "T07n0220_586:1030c28_12"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1031a01_13"
    },
    {
        "source_sentence": "又諸菩薩如實了知所有是處若遠離若不遠離皆不可得，如實了知所有非處若遠離若不遠離皆不可得，",
        "translation": "“Furthermore, enlightening beings truly know that all things are ungraspable whether distant or not; they truly know that all things are ungraspable whether distant or not.",
        "source": "T07n0220_586:1031a03_0"
    },
    {
        "source_sentence": "如是名為是處非處善巧。",
        "translation": "Thus, this is called skillfulness in what's right and wrong.",
        "source": "T07n0220_586:1031a05_1"
    },
    {
        "source_sentence": "「如是菩薩於諸蘊等應修善巧，由善巧故，為諸有情如應說法，令永斷滅有情想等。",
        "translation": "Thus, a bodhisattva should cultivate skillfulness regarding the aggregates and so forth, and because of that skillfulness, he explains the Dharma to sentient beings as it should be taught so that they will permanently cease their conception",
        "source": "T07n0220_586:1031a06_0"
    },
    {
        "source_sentence": "菩薩如是起殊勝心，為利自他修諸妙慧，一切皆用大悲為首，常能發起隨順迴向一切智智相應之心，",
        "translation": "“Thus do enlightening beings develop extraordinary minds, cultivating subtle knowledge for the benefit of self and others, all led by great compassion. They are always able to develop minds conjoined with omniscience and knowledge that accord with dedication",
        "source": "T07n0220_586:1031a07_1"
    },
    {
        "source_sentence": "應知是名具戒菩薩，當知具足無上淨戒。",
        "translation": "You should know that this is called a bodhisattva who possesses the precepts, and you should know that he possesses the unsurpassed pure precepts.",
        "source": "T07n0220_586:1031a10_2"
    },
    {
        "source_sentence": "若諸菩薩欲求無上正等菩提，應勤修習布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "If bodhisattvas want to pursue unsurpassed perfect enlightenment, they should diligently cultivate generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T07n0220_586:1031a11_3"
    },
    {
        "source_sentence": "迴向趣求一切智智。",
        "translation": "He returns to the path of seeking omniscience and cognition.",
        "source": "T07n0220_586:1031a13_4"
    },
    {
        "source_sentence": "若諸菩薩以此六種波羅蜜多，迴向趣求一切智智，是諸菩薩由此淨戒，",
        "translation": "If bodhisattvas dedicate these six kinds of perfections to the search for omniscience and knowledge, it’s because of these pure precepts that bodhisattvas",
        "source": "T07n0220_586:1031a13_5"
    },
    {
        "source_sentence": "普勝一切聲聞、獨覺。",
        "translation": "They are universally superior to all śrāvakas and pratyekbuddhas.",
        "source": "T07n0220_586:1031a15_6"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031a16_0"
    },
    {
        "source_sentence": "初發無上正等覺心一菩薩戒，一切有情皆所成就十善業道，此戒於彼，",
        "translation": "The first is the one bodhisattva precept that arouses the mind of unsurpassed perfect enlightenment, which accomplishes the ten good paths of action for all sentient beings.",
        "source": "T07n0220_586:1031a16_1"
    },
    {
        "source_sentence": "百倍為勝，千倍為勝，乃至鄔波尼殺曇倍亦復為勝。",
        "translation": "A hundredfold is superior, a thousandfold is superior, and even the duration of Upanissa's dharma is also superior.",
        "source": "T07n0220_586:1031a17_2"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031a19_3"
    },
    {
        "source_sentence": "假使世間一切有情，皆具成就十善業道；",
        "translation": "Suppose all sentient beings in the world accomplished ten wholesome paths of action.",
        "source": "T07n0220_586:1031a19_4"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心，諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of those bodhisattvas aren't even a hundredth the number of bodhisattva precepts that are given when they first give rise to the mind of unsurpassed perfect enlightenment.",
        "source": "T07n0220_586:1031a20_5"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_586:1031a22_0"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031a23_0"
    },
    {
        "source_sentence": "假使世間一切有情，皆具成就前五神通；",
        "translation": "Suppose all sentient beings in the world were endowed with the first five supernatural powers.",
        "source": "T07n0220_586:1031a23_1"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of these bodhisattvas are one hundredth the number of bodhisattva precepts that don't reach a single bodhisattva when he first arouses the mind of unsurpassed perfect enlightenment among the bodhisatt",
        "source": "T07n0220_586:1031a24_2"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_586:1031a25_3"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031a26_4"
    },
    {
        "source_sentence": "假使世間一切有情，皆具安住慈、悲、喜、捨；",
        "translation": "Suppose all sentient beings in the world were to abide peacefully in kindness, compassion, joy, and equanimity.",
        "source": "T07n0220_586:1031a27_5"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of these bodhisattvas are one hundredth the number of bodhisattva precepts that don't reach a single bodhisattva when he first arouses the mind of unsurpassed perfect enlightenment among the bodhisatt",
        "source": "T07n0220_586:1031a28_6"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_586:1031a29_7"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031b01_8"
    },
    {
        "source_sentence": "假使世間一切有情，皆具成就隨順空忍；",
        "translation": "Suppose all sentient beings in the world were to perfect the forbearance of following emptiness.",
        "source": "T07n0220_586:1031b02_0"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of these bodhisattvas are one hundredth the number of bodhisattva precepts that don't reach a single bodhisattva when he first arouses the mind of unsurpassed perfect enlightenment among the bodhisatt",
        "source": "T07n0220_586:1031b02_1"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_586:1031b04_2"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031b05_3"
    },
    {
        "source_sentence": "假使世間一切有情，皆具成就順無相忍；",
        "translation": "Suppose all sentient beings in the world were to perfect patience conforming to signlessness.",
        "source": "T07n0220_586:1031b05_4"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of these bodhisattvas are one hundredth the number of bodhisattva precepts that don't reach a single bodhisattva when he first arouses the mind of unsurpassed perfect enlightenment among the bodhisatt",
        "source": "T07n0220_586:1031b06_5"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_586:1031b08_6"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031b09_7"
    },
    {
        "source_sentence": "假使世間一切有情，皆具成就順無願忍；",
        "translation": "Suppose all sentient beings in the world were to perfect patience conforming to wishlessness.",
        "source": "T07n0220_586:1031b09_8"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of these bodhisattvas are one hundredth the number of bodhisattva precepts that don't reach a single bodhisattva when he first arouses the mind of unsurpassed perfect enlightenment among the bodhisatt",
        "source": "T07n0220_586:1031b10_9"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_586:1031b12_10"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1031b13_11"
    },
    {
        "source_sentence": "假使世間一切有情，皆具成就第八者法；",
        "translation": "Suppose all sentient beings in the world were to perfect the eighth principle.",
        "source": "T07n0220_586:1031b13_12"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of these bodhisattvas are one hundredth the number of bodhisattva precepts that don't reach a single bodhisattva when he first arouses the mind of unsurpassed perfect enlightenment among the bodhisatt",
        "source": "T07n0220_586:1031b14_13"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。」",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisakṣatra doesn't amount to one.",
        "source": "T07n0220_586:1031b16_14"
    },
    {
        "source_sentence": "爾時，滿慈子白舍利子言：「我今欲問尊者第八所有義趣，頗見開許為我解釋此義趣耶？」",
        "translation": "It was then that Pūrṇa Maitrāyaniputra said to Śāriputra, Now, I want to ask the venerable eighth meaningful aim, does he see and allow me to explain this meaningful aim?",
        "source": "T07n0220_586:1031b18_0"
    },
    {
        "source_sentence": "舍利子言：「隨意發問，我既聞已當為解釋。」",
        "translation": "Śāriputra said, As you wish, I'll ask questions, and after hearing them, I'll explain them.",
        "source": "T07n0220_586:1031b20_0"
    },
    {
        "source_sentence": "滿慈子言：「為即色蘊是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the form aggregate the eighth?",
        "source": "T07n0220_586:1031b20_1"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031b21_2"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031b22_0"
    },
    {
        "source_sentence": "滿慈子言：「為離色蘊有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth consciousness apart from the form aggregate?",
        "source": "T07n0220_586:1031b22_1"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031b22_2"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031b23_3"
    },
    {
        "source_sentence": "滿慈子言：「為即受、想、行、識蘊是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is this the eighth aggregate of feeling, perception, volition, and consciousness?",
        "source": "T07n0220_586:1031b23_4"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031b24_5"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031b24_6"
    },
    {
        "source_sentence": "滿慈子言：「為離受、想、行、識蘊有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth consciousness apart from the aggregates of feeling, perception, volition, and consciousness?",
        "source": "T07n0220_586:1031b24_7"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031b25_8"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031b25_9"
    },
    {
        "source_sentence": "滿慈子言：「為即眼處是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is this the eighth eye-field?",
        "source": "T07n0220_586:1031b26_10"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031b26_11"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031b27_12"
    },
    {
        "source_sentence": "滿慈子言：「為離眼處有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth place apart from the eye?",
        "source": "T07n0220_586:1031b27_13"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031b27_14"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031b28_15"
    },
    {
        "source_sentence": "滿慈子言：「為即耳、鼻、舌、身、意處是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the ear, nose, tongue, body, and mind the eighth?",
        "source": "T07n0220_586:1031b28_16"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031b29_17"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031b29_18"
    },
    {
        "source_sentence": "滿慈子言：「為離耳、鼻、舌、身、意處有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth place apart from the ear, nose, tongue, body, and mind?",
        "source": "T07n0220_586:1031b29_19"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c01_20"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c02_21"
    },
    {
        "source_sentence": "滿慈子言：「為即色處是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the form realm the eighth?",
        "source": "T07n0220_586:1031c02_22"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c02_23"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c03_24"
    },
    {
        "source_sentence": "滿慈子言：「為離色處有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth place that's free of form?",
        "source": "T07n0220_586:1031c03_25"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c04_26"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c04_27"
    },
    {
        "source_sentence": "滿慈子言：「為即聲、香、味、觸、法處是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is this the eighth place where sound, odor, taste, touch, and dharmas are present?",
        "source": "T07n0220_586:1031c04_28"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c05_29"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c05_30"
    },
    {
        "source_sentence": "滿慈子言：「為離聲、香、味、觸、法處有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth place apart from sound, odor, taste, touch, and dharmas?",
        "source": "T07n0220_586:1031c06_0"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c06_1"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c07_2"
    },
    {
        "source_sentence": "滿慈子言：「為即眼界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the eye realm the eighth?",
        "source": "T07n0220_586:1031c07_3"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c08_4"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c08_5"
    },
    {
        "source_sentence": "滿慈子言：「為離眼界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth apart from the eye realm?",
        "source": "T07n0220_586:1031c08_6"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c09_7"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c09_8"
    },
    {
        "source_sentence": "滿慈子言：「為即耳、鼻、舌、身、意界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the ear, nose, tongue, body, and mind realms the eighth?",
        "source": "T07n0220_586:1031c10_0"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c11_0"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c11_1"
    },
    {
        "source_sentence": "滿慈子言：「為離耳、鼻、舌、身、意界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth apart from the ear, nose, tongue, body, and mind realms?",
        "source": "T07n0220_586:1031c11_2"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c12_3"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c12_4"
    },
    {
        "source_sentence": "滿慈子言：「為即色界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is this the eighth form realm?",
        "source": "T07n0220_586:1031c12_5"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c13_6"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c14_7"
    },
    {
        "source_sentence": "滿慈子言：「為離色界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth apart from the form realm?",
        "source": "T07n0220_586:1031c14_8"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c14_9"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c15_10"
    },
    {
        "source_sentence": "滿慈子言：「為即聲、香、味、觸、法界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the eighth the sound, smell, taste, touch, and dharma realms?",
        "source": "T07n0220_586:1031c15_11"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c16_12"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c16_13"
    },
    {
        "source_sentence": "滿慈子言：「為離聲、香、味、觸、法界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth apart from sound, odor, taste, touch, and the Dharma realm?",
        "source": "T07n0220_586:1031c16_14"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c17_15"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c18_16"
    },
    {
        "source_sentence": "滿慈子言：「為即眼識界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the eye consciousness realm the eighth?",
        "source": "T07n0220_586:1031c18_17"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c19_18"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c19_19"
    },
    {
        "source_sentence": "滿慈子言：「為離眼識界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth realm apart from the eye consciousness realm?",
        "source": "T07n0220_586:1031c19_20"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c20_21"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c20_22"
    },
    {
        "source_sentence": "滿慈子言：「為即耳、鼻、舌、身、意識界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the ear, nose, tongue, body, body, and consciousness realms the eighth?",
        "source": "T07n0220_586:1031c20_23"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c21_24"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c22_25"
    },
    {
        "source_sentence": "滿慈子言：「為離耳、鼻、舌、身、意識界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth apart from the ear, nose, tongue, body, body, and consciousness realms?",
        "source": "T07n0220_586:1031c22_26"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c23_27"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c23_28"
    },
    {
        "source_sentence": "滿慈子言：「為即眼觸是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is eye contact the eighth?",
        "source": "T07n0220_586:1031c23_29"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c24_30"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c24_31"
    },
    {
        "source_sentence": "滿慈子言：「為離眼觸有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth thing that's free of eye contact?",
        "source": "T07n0220_586:1031c24_32"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c25_33"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c26_0"
    },
    {
        "source_sentence": "滿慈子言：「為即耳、鼻、舌、身、意觸是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is this the eighth touch of the ear, nose, tongue, body, and mind?",
        "source": "T07n0220_586:1031c26_1"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c27_2"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c27_3"
    },
    {
        "source_sentence": "滿慈子言：「為離耳、鼻、舌、身、意觸有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth thing apart from the touch of the ear, nose, tongue, body, and mind?",
        "source": "T07n0220_586:1031c27_4"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1031c28_5"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1031c28_6"
    },
    {
        "source_sentence": "滿慈子言：「為即眼觸為緣所生諸受是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is this the eighth sensation that arises from visual contact as a condition?",
        "source": "T07n0220_586:1031c29_0"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a01_1"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a01_2"
    },
    {
        "source_sentence": "滿慈子言：「為離眼觸為緣所生諸受有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth sensation that arises apart from visual contact as a condition for sensation?",
        "source": "T07n0220_586:1032a01_3"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a02_4"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a02_5"
    },
    {
        "source_sentence": "滿慈子言：「為即耳、鼻、舌、身、意觸為緣所生諸受是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is this the eighth sensation that arises from the ear, nose, tongue, body, and mind contact as a condition?",
        "source": "T07n0220_586:1032a03_6"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a04_7"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a04_8"
    },
    {
        "source_sentence": "滿慈子言：「為離耳、鼻、舌、身、意觸為緣所生諸受有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth sensation that arises apart from the ear, nose, tongue, body, and mind contact as a condition?",
        "source": "T07n0220_586:1032a04_9"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a06_10"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a06_11"
    },
    {
        "source_sentence": "滿慈子言：「為即地界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the earth realm the eighth?",
        "source": "T07n0220_586:1032a06_12"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a07_13"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a07_14"
    },
    {
        "source_sentence": "滿慈子言：「為離地界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth apart from the earth realm?",
        "source": "T07n0220_586:1032a07_15"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a08_16"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a08_17"
    },
    {
        "source_sentence": "滿慈子言：「為即水、火、風、空、識界是第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is the water, fire, wind, space, and consciousness realms the eighth?",
        "source": "T07n0220_586:1032a09_0"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a09_1"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a10_2"
    },
    {
        "source_sentence": "滿慈子言：「為離水、火、風、空、識界有第八耶？」",
        "translation": "Pūrṇa Maitrāyaniputra said, Is there an eighth consciousness apart from water, fire, wind, space, and the consciousness realm?",
        "source": "T07n0220_586:1032a10_3"
    },
    {
        "source_sentence": "舍利子言：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T07n0220_586:1032a11_4"
    },
    {
        "source_sentence": "具壽！」",
        "translation": "Guoshou!",
        "source": "T07n0220_586:1032a11_5"
    },
    {
        "source_sentence": "滿慈子言：「若爾，尊者說何等法名為第八？",
        "translation": "Pūrṇa Maitrāyaniputra said, If that's the case, what teaching does the venerable say is called the eighth?",
        "source": "T07n0220_586:1032a11_6"
    },
    {
        "source_sentence": "云何令我了知尊者所說義趣如理受持？」",
        "translation": "How can I know the meaning of what the venerable teaches and correctly receive and uphold it?",
        "source": "T07n0220_586:1032a12_7"
    },
    {
        "source_sentence": "舍利子言：「若於諸法平等性中，以如實智知平等性、證平等性，由此智故所作已息。",
        "translation": "Śāriputra said, Suppose someone knows the equality and realizes the equality with true knowledge of the equality of all dharmas and stops what they've done because of this knowledge.",
        "source": "T07n0220_586:1032a13_8"
    },
    {
        "source_sentence": "我於此中不見第八，亦復不見知平等智，此中無我、無我所故，云何於中可相徵詰？」",
        "translation": "I don't see the eighth here, and I don't see the cognition of equality. How can I be questioned here because there's no self and nothing for self?",
        "source": "T07n0220_586:1032a15_9"
    },
    {
        "source_sentence": "滿慈子言：「云何尊者前後所說非互相違？",
        "translation": "Pūrṇa Maitrāyaniputra said, How is it that what the venerable explained before and after aren't contradictory?",
        "source": "T07n0220_586:1032a17_10"
    },
    {
        "source_sentence": "謂前說言：『一切第八所有淨戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，",
        "translation": "It means that it's said earlier, 'All the eighth set of pure precepts exists for bodhisattvas who give rise to the mind of unsurpassed perfect enlightenment. When they first give rise to their minds, one bo",
        "source": "T07n0220_586:1032a18_11"
    },
    {
        "source_sentence": "百分不及一，千分不及一，乃至鄔波尼殺曇分亦不及一。』",
        "translation": "A hundred parts won't be one, a thousand parts won't be one, and even the part of Upanisakṣatra won't be one.'",
        "source": "T07n0220_586:1032a20_12"
    },
    {
        "source_sentence": "今復說言：『我於此中都不見有第八及智。』」",
        "translation": "Now, it's also said, 'I don't see any eighth or knowledge here.'",
        "source": "T07n0220_586:1032a21_13"
    },
    {
        "source_sentence": "舍利子言：「我先所說，為初學者，不為已入平等性者；",
        "translation": "Śāriputra said: The teaching I gave earlier is for beginners and not for those who have already entered equanimity.",
        "source": "T07n0220_586:1032a22_14"
    },
    {
        "source_sentence": "我先所說，欲使有情趣入正法，不為已入平等性者；",
        "translation": "What I have said before is that I want to enable sentient beings to enter the true teaching, not those who have already entered equanimity.",
        "source": "T07n0220_586:1032a23_15"
    },
    {
        "source_sentence": "我先所說，欲使有情知大乘行出過二乘，不說諸法平等實性；",
        "translation": "I have explained it in order to enable sentient beings to know that the practice of the Great Vehicle transcends those of the two vehicles and does not explain the equality of all dharmas.",
        "source": "T07n0220_586:1032a24_16"
    },
    {
        "source_sentence": "我先所說，欲使有情如實覺了佛乘、大乘淨戒殊勝，故作是說：假使世間一切有情皆具成就第八者法，",
        "translation": "Because I want to cause sentient beings to truly awaken to the superiority of the buddha vehicle and great vehicle pure precepts. Therefore, I make this proclamation:",
        "source": "T07n0220_586:1032a26_17"
    },
    {
        "source_sentence": "彼所有戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，百分不及一，",
        "translation": "The precepts of these bodhisattvas are one hundredth the number of bodhisattva precepts that don't reach a single bodhisattva when he first arouses the mind of unsurpassed perfect enlightenment among the bodhisatt",
        "source": "T07n0220_586:1032a28_18"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_586:1032b01_19"
    },
    {
        "source_sentence": "不說諸法平等實性離我、我所，何所相違？",
        "translation": "If you don't say that all dharmas are equal in their true nature, what's the contradiction if they're free of self and self- possession?",
        "source": "T07n0220_586:1032b02_20"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032b04_0"
    },
    {
        "source_sentence": "一切預流、一來、不還及阿羅漢、獨覺淨戒，於發無上正等覺心諸菩薩眾初發心時一菩薩戒，",
        "translation": "The pure precepts for all stream-enterers, once-returners, nonreturners, arhats, and pratyekabuddhas are the bodhisattva precepts that are given when the mind of unsurpassed perfect enlightenment is",
        "source": "T07n0220_586:1032b04_1"
    },
    {
        "source_sentence": "百分不及一，千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A hundredth part doesn't reach one, a thousandth part doesn't reach one, and even the upanuponiṣaṇḍa part doesn't reach one.",
        "source": "T07n0220_586:1032b06_2"
    },
    {
        "source_sentence": "「具壽當知！",
        "translation": "You should know that the full life span!",
        "source": "T07n0220_586:1032b07_3"
    },
    {
        "source_sentence": "諸有欲令聲聞、獨覺所有淨戒勝菩薩戒，彼為欲令聲聞、獨覺所有淨戒勝如來戒，",
        "translation": "Those who want to cause the pure precepts of śrāvakas and solitary realizers to be superior to those of bodhisattvas, they want to cause the pure precepts of śrāvakas and solitary realizers to be superior to those",
        "source": "T07n0220_586:1032b08_0"
    },
    {
        "source_sentence": "當知彼類欲與如來共諍勝劣。",
        "translation": "You should know that those people want to fight with the Tathāgata about superiority and inferiority.",
        "source": "T07n0220_586:1032b09_1"
    },
    {
        "source_sentence": "譬如有人與王子諍，當知彼人欲與王諍；",
        "translation": "Good man, this is analogous to someone who has sexual intercourse with a prince. You should know that person’s desire is to have sexual intercourse with the king.",
        "source": "T07n0220_586:1032b10_2"
    },
    {
        "source_sentence": "如是若有欲令聲聞、獨覺淨戒勝菩薩戒，則為欲令聲聞、獨覺所有淨戒勝如來戒，",
        "translation": "“Furthermore, if you want to make the pure precepts of disciples and solitary realizers superior to those of enlightening beings, then you want to make the pure precepts of disciples and solitary realizers superior",
        "source": "T07n0220_586:1032b11_3"
    },
    {
        "source_sentence": "當知彼類欲與如來共諍勝劣。",
        "translation": "You should know that those people want to fight with the Tathāgata about superiority and inferiority.",
        "source": "T07n0220_586:1032b13_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_586:1032b14_5"
    },
    {
        "source_sentence": "滿慈子！",
        "translation": "Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032b14_6"
    },
    {
        "source_sentence": "諸菩薩法不可勝故，菩薩是真法王子故。",
        "translation": "Because the bodhisattva's teachings are invincible, the bodhisattva is the true prince of the Dharma.",
        "source": "T07n0220_586:1032b14_7"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032b15_8"
    },
    {
        "source_sentence": "譬如有人無手無足，而作是說：『我能渡至大海彼岸。』",
        "translation": "It's like a person with no hands or feet who says, 'I can cross to the other shore of the ocean.'",
        "source": "T07n0220_586:1032b15_9"
    },
    {
        "source_sentence": "彼有虛言而無實義，由增上慢作如是說。",
        "translation": "They speak falsely but have no real meaning, and because of their overweening pride they say so.",
        "source": "T07n0220_586:1032b16_10"
    },
    {
        "source_sentence": "如是若有聲聞、獨覺作如是言：『我所有戒勝菩薩戒。』",
        "translation": "Thus, if there are śrāvakas and pratyekbuddhas who say, 'The precepts I have are superior to the bodhisattva precepts.'",
        "source": "T07n0220_586:1032b17_11"
    },
    {
        "source_sentence": "當知彼言都無實義。",
        "translation": "You should know that their words have no real meaning.",
        "source": "T07n0220_586:1032b18_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_586:1032b19_13"
    },
    {
        "source_sentence": "滿慈子！",
        "translation": "Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032b19_14"
    },
    {
        "source_sentence": "菩薩功德如大海故。",
        "translation": "It's because the bodhisattva's merit is like the great ocean.",
        "source": "T07n0220_586:1032b19_15"
    },
    {
        "source_sentence": "如彼愚人實無手足，而言：『我能越渡大海。』",
        "translation": "Suppose that foolish man really has no hands or feet and says, 'I can cross the ocean.'",
        "source": "T07n0220_586:1032b20_16"
    },
    {
        "source_sentence": "如是有趣二乘之人，實無菩薩殊勝功德，而言：『我勝菩薩淨戒。』",
        "translation": "Such an interesting two-vehicle person really doesn't have the bodhisattva's superior qualities, saying, 'I'm superior to the bodhisattva's pure precepts.'",
        "source": "T07n0220_586:1032b21_17"
    },
    {
        "source_sentence": "無有是處。",
        "translation": "There's no such place.",
        "source": "T07n0220_586:1032b22_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_586:1032b22_19"
    },
    {
        "source_sentence": "滿慈子！",
        "translation": "Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032b23_20"
    },
    {
        "source_sentence": "菩薩淨戒無邊際故。」",
        "translation": "It's because the bodhisattva's pure precepts have no limit.",
        "source": "T07n0220_586:1032b23_21"
    },
    {
        "source_sentence": "時，滿慈子便問具壽舍利子言：「何緣故說菩薩淨戒無邊際耶？」",
        "translation": "Pūrṇa Maitrāyaniputra then asked Kauṣṭhila Śāriputra, What's the reason why you say that the bodhisattva's pure morality has no limit?",
        "source": "T07n0220_586:1032b23_22"
    },
    {
        "source_sentence": "舍利子言：「菩薩淨戒普能解脫無量有情犯戒惡故，普能安立無量有情清淨戒故。」",
        "translation": "Śāriputra said, The bodhisattva's pure precepts can universally liberate measureless sentient beings from the evil of violating the precepts because they can universally establish the pure precepts for measureless sentient beings",
        "source": "T07n0220_586:1032b25_23"
    },
    {
        "source_sentence": "時，滿慈子復問具壽舍利子言：「尊者所說犯戒惡者是何增語？」",
        "translation": "Pūrṇa Maitrāyaniputra then again asked Kauṣṭhila Śāriputra, What's the augmentation that the venerable says about violating the precepts?",
        "source": "T07n0220_586:1032b27_24"
    },
    {
        "source_sentence": "舍利子言：「我、我所執及餘煩惱名犯戒惡，謂任持想、若我想、若有情想、若命者想、若生者想、若養者想、若士夫想、若補特伽羅想、若有想、若無想，",
        "translation": "Śāriputra said, Self, self-attachment and other afflictions are called the badness of violating precepts: conceptions of dependence, conceptions of self, conceptions of sentient beings, conceptions of living beings, conceptions of",
        "source": "T07n0220_586:1032b28_25"
    },
    {
        "source_sentence": "如是諸想及餘煩惱，是犯戒惡增語。",
        "translation": "Such thoughts and other afflictions are bad verbal abuses that violate the precepts.",
        "source": "T07n0220_586:1032c02_26"
    },
    {
        "source_sentence": "所顯菩薩淨戒，普能解脫無量有情如是所說犯戒惡故，量無邊際；",
        "translation": "The pure precepts manifested by enlightening beings are able to liberate infinite numbers of sentient beings from the evil of violating precepts.",
        "source": "T07n0220_586:1032c03_27"
    },
    {
        "source_sentence": "又諸菩薩所有淨戒，普能安立無量有情令住淨戒，是故菩薩安住大乘所得淨戒量無邊際，",
        "translation": "Also, all the pure precepts of enlightening beings are able to establish measureless sentient beings and cause them to abide in these pure precepts; therefore, enlightening beings’ abiding in the great vehicle attainment of purity",
        "source": "T07n0220_586:1032c05_28"
    },
    {
        "source_sentence": "聲聞、獨覺所不能及，普勝聲聞、獨覺淨戒。",
        "translation": "It's beyond the ability of śrāvakas and solitary realizers, and it's superior to the pure precepts of all śrāvakas and solitary realizers.",
        "source": "T07n0220_586:1032c07_29"
    },
    {
        "source_sentence": "又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032c08_30"
    },
    {
        "source_sentence": "諸菩薩名普勝一切聲聞、獨覺，謂修淨戒波羅蜜多，迴向趣求一切智智。」",
        "translation": "The bodhisattvas are called universally superior to all śrāvakas and pratyekbuddhas, which are cultivating the perfection of pure morality and dedicating themselves to the pursuit of omniscience.",
        "source": "T07n0220_586:1032c08_31"
    },
    {
        "source_sentence": "爾時，滿慈子問舍利子言：「云何菩薩有漏淨戒，能勝二乘無漏淨戒？」",
        "translation": "It was then that Pūrṇa Maitrāyaniputra asked Śāriputra, How can a bodhisattva's uncontaminated pure precepts overpower the two-vehicle uncontaminated pure precepts?",
        "source": "T07n0220_586:1032c11_0"
    },
    {
        "source_sentence": "舍利子言：「聲聞、獨覺無漏淨戒，唯求自利迴向涅槃，菩薩淨戒普為度脫無量有情，",
        "translation": "Śāriputra said, The pure morality of śrāvakas and pratyekbuddhas is uncontaminated, seeking only self-benefit to return to nirvāṇa; the pure morality of bodhisattvas liberates measureless sentient being",
        "source": "T07n0220_586:1032c12_1"
    },
    {
        "source_sentence": "迴向無上正等菩提，是故菩薩所有淨戒，能勝二乘無漏淨戒。",
        "translation": "Because they dedicate themselves to unsurpassed perfect enlightenment, the pure precepts possessed by bodhisattvas can surpass the uncontaminated pure precepts of the two vehicles.",
        "source": "T07n0220_586:1032c14_2"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032c15_3"
    },
    {
        "source_sentence": "若諸菩薩心作分限饒益有情引發淨戒，是諸菩薩所起淨戒，不勝二乘無漏淨戒，",
        "translation": "If bodhisattvas create mental limitations to benefit sentient beings and give rise to pure precepts, these are the pure precepts produced by bodhisattvas that aren't superior to the two-vehicle uncontaminated pure precept",
        "source": "T07n0220_586:1032c16_4"
    },
    {
        "source_sentence": "不名淨戒波羅蜜多。",
        "translation": "It's not called the perfection of pure morality.",
        "source": "T07n0220_586:1032c18_0"
    },
    {
        "source_sentence": "然諸菩薩心無分限，普為度脫無量有情，求大菩提引發淨戒，是故菩薩所起淨戒，",
        "translation": "However, the minds of enlightening beings have no bounds. For the sake of liberating countless sentient beings everywhere, they seek great enlightenment and engender pure morality.",
        "source": "T07n0220_586:1032c18_1"
    },
    {
        "source_sentence": "能勝二乘無漏淨戒，名為淨戒波羅蜜多。",
        "translation": "Being able to overcome the uncontaminated pure precepts of the two vehicles is called the perfection of pure precepts.",
        "source": "T07n0220_586:1032c20_2"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032c21_3"
    },
    {
        "source_sentence": "如日輪出放大光明，螢火等光悉皆隱沒；",
        "translation": "It is as if the sun came out and emitted a great ray of light. All the rays of light, such as those of fireflies in the sky, disappeared.",
        "source": "T07n0220_586:1032c21_4"
    },
    {
        "source_sentence": "如是菩薩修行淨戒波羅蜜多，迴向趣求一切智智，普勝一切聲聞、獨覺迴向涅槃所有淨戒。",
        "translation": "Thus, the bodhisattva cultivates the perfection of pure morality, dedicates himself to seeking omniscience and knowledge, and universally surpasses all the pure precepts of śrāvakas and pratyekbuddhas who dedicate themselves to nir",
        "source": "T07n0220_586:1032c22_5"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032c24_6"
    },
    {
        "source_sentence": "如月輪出放大光明，一切星光皆被映奪；",
        "translation": "It is as if the moon were to emanate a great ray of light, and all the starlights would be overwhelmed.",
        "source": "T07n0220_586:1032c24_7"
    },
    {
        "source_sentence": "如是菩薩修行淨戒波羅蜜多，迴向趣求一切智智，普勝一切聲聞、獨覺迴向涅槃所有淨戒。",
        "translation": "Thus, the bodhisattva cultivates the perfection of pure morality, dedicates himself to seeking omniscience and knowledge, and universally surpasses all the pure precepts of śrāvakas and pratyekbuddhas who dedicate themselves to nir",
        "source": "T07n0220_586:1032c25_8"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1032c27_9"
    },
    {
        "source_sentence": "若時菩薩隨念如來，迴向趣求一切智智，由起殊勝相應心力，引得淨戒波羅蜜多，",
        "translation": "“Furthermore, the enlightening beings who are mindful of buddhas and dedicate themselves to omniscience in order to pursuing omniscience will attain the transcendence of pure morality by means of the power of mind associated with excellence.",
        "source": "T07n0220_586:1032c28_10"
    },
    {
        "source_sentence": "爾時名為行自行處，普勝一切聲聞、獨覺。」",
        "translation": "At that point, it's called the place where one practices self-reliance and is universally superior to all śrāvakas and pratyekbuddhas.",
        "source": "T07n0220_586:1033a01_11"
    },
    {
        "source_sentence": "時，滿慈子便問具壽舍利子言：「若時菩薩不現發起一切智心，爾時菩薩為名何等？」",
        "translation": "Pūrṇa Maitrāyaniputra then asked Kauśāriputra, If a bodhisattva doesn't presently give rise to the mind of omniscience, what's the name of that bodhisattva at that point?",
        "source": "T07n0220_586:1033a02_0"
    },
    {
        "source_sentence": "舍利子言：「若時菩薩不現發起一切智心，爾時菩薩名無記心相續而住，",
        "translation": "Śāriputra said, If a bodhisattva doesn't presently give rise to the mind of omniscience, then that bodhisattva is called an indeterminate mind and abides continuously.",
        "source": "T07n0220_586:1033a03_1"
    },
    {
        "source_sentence": "是時菩薩應知猶名具戒菩薩，於菩薩戒未名毀犯，不名棄捨菩薩淨戒。",
        "translation": "At that point, the bodhisattva should know that he's still called a bodhisattva who possesses the precepts and doesn't call violating the bodhisattva's precepts or abandoning the bodhisattva's pure",
        "source": "T07n0220_586:1033a05_2"
    },
    {
        "source_sentence": "若時菩薩不現發起一切智心，爾時菩薩迴向聲聞或獨覺地，是時菩薩捨菩薩地失自行處。",
        "translation": "If a bodhisattva doesn't manifestly give rise to the mind of omniscience, then the bodhisattva dedicates himself to the stages of śrāvakas or pratyekbuddhas, and then the bodhisattva abandons the bo",
        "source": "T07n0220_586:1033a07_3"
    },
    {
        "source_sentence": "若諸菩薩隨爾所時迴向聲聞或獨覺地，是諸菩薩即爾所時於無上乘應知名死，",
        "translation": "If bodhisattvas dedicate themselves at that point to the stages of śrāvakas or pratyekbuddhas, then those bodhisattvas should be called dead when they are in the unsurpassed vehicle.",
        "source": "T07n0220_586:1033a09_4"
    },
    {
        "source_sentence": "雖非實死而得死名。",
        "translation": "Even though it's not really death, it gets the name death.",
        "source": "T07n0220_586:1033a11_5"
    },
    {
        "source_sentence": "如工幻師或彼弟子，執小兒手引上高梯，幻解身支分分墮落；",
        "translation": "Suppose an illusionist or a disciple, holding a small child in his hand and leading him up a high ladder, magically dismembers the body limbs and parts of it and falls off.",
        "source": "T07n0220_586:1033a11_6"
    },
    {
        "source_sentence": "時彼眷屬咸謂命終，傷歎悲號生大苦惱：『如何此子倏忽滅亡，我等親族無由重見！』",
        "translation": "Those members of the family then all said that his life had ended, grieved and wailed in great pain, saying, 'How is this child suddenly gone? How can we relatives have such a heavy view?'",
        "source": "T07n0220_586:1033a13_7"
    },
    {
        "source_sentence": "菩薩亦爾，捨大菩提退住聲聞或獨覺地，失一切智應知如死，如彼小兒雖不失命，",
        "translation": "Likewise, bodhisattvas who abandon great enlightenment and regress to the stages of śrāvakas or pratyekbuddhas, losing omniscience should be known as death, like a small child that doesn't lose its life even though",
        "source": "T07n0220_586:1033a15_8"
    },
    {
        "source_sentence": "而彼親屬起於死想。",
        "translation": "Those relatives then give rise to the perception of death.",
        "source": "T07n0220_586:1033a16_9"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1033a18_0"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_586:1033a18_1"
    },
    {
        "source_sentence": "菩薩淨戒與諸異生、聲聞、獨覺所有淨戒有何差別？」",
        "translation": "What's the difference between the pure precepts of bodhisattvas and the pure precepts of ordinary people, śrāvakas, and pratyekbuddhas?",
        "source": "T07n0220_586:1033a18_2"
    },
    {
        "source_sentence": "滿慈子言：「如是諸戒真如法性實無差別。」",
        "translation": "Pūrṇa Maitrāyaniputra said, Thus, there's really no difference between the true nature of the Dharma and the true nature of the precepts.",
        "source": "T07n0220_586:1033a19_3"
    },
    {
        "source_sentence": "舍利子言：「如是諸戒真如法性雖無差別，而亦可說有差別相，此差別相應說云何？」",
        "translation": "Śāriputra said, Thus, even though the true nature of the dharma-nature of the precepts has no distinctions, it can still be said to have distinctive characteristics, so what's the explanation associated with these distinctive characteristics",
        "source": "T07n0220_586:1033a20_4"
    },
    {
        "source_sentence": "滿慈子言：「如諸菩薩求證無上正等菩提，異生、聲聞、獨覺不爾；",
        "translation": "Pūrṇa Maitrāyaniputra said: Just as all bodhisattvas seek to realize the supreme perfect enlightenment, so it is with ordinary people, śrāvakas, and solitary realizers.",
        "source": "T07n0220_586:1033a22_5"
    },
    {
        "source_sentence": "如是菩薩所有淨戒，與彼諸戒說有差別。」",
        "translation": "Thus, there's a difference between the pure precepts that are possessed by bodhisattvas and those precepts that are explained differently.",
        "source": "T07n0220_586:1033a23_6"
    },
    {
        "source_sentence": "舍利子言：「由此菩薩所有淨戒，勝諸異生、聲聞、獨覺所有淨戒，謂菩薩戒迴向趣求一切智智，",
        "translation": "Śāriputra said, Because of these pure precepts possessed by the bodhisattva, he's superior to the pure precepts possessed by ordinary people, śrāvakas, and pratyekbuddhas, meaning that the bodhisatt",
        "source": "T07n0220_586:1033a24_7"
    },
    {
        "source_sentence": "名為淨戒波羅蜜多，餘戒不爾，是謂差別。",
        "translation": "It's called the perfection of pure morality, and the other precepts aren't like that. This is called a distinction.",
        "source": "T07n0220_586:1033a27_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_586:1033a27_1"
    },
    {
        "source_sentence": "滿慈子！",
        "translation": "Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1033a28_2"
    },
    {
        "source_sentence": "菩薩淨戒普勝三千大千世界及餘無量無邊有情，除佛世尊所有淨戒，於餘淨戒最勝第一。",
        "translation": "The bodhisattva's pure precepts are universally superior to the 3,000 great one-thousand worlds and other immeasurable and limitless sentient beings, except for the pure precepts possessed by the Bhagavān,",
        "source": "T07n0220_586:1033a28_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_586:1033b01_4"
    },
    {
        "source_sentence": "菩薩淨戒能引無量無邊有情，解脫生死及諸惡趣。",
        "translation": "The bodhisattva's pure precepts can lead measureless and limitless sentient beings to be liberated from birth-and-death and bad destinies.",
        "source": "T07n0220_586:1033b01_5"
    },
    {
        "source_sentence": "由此因緣，菩薩淨戒於諸異生、聲聞、獨覺所有淨戒為最為勝、為尊為高、為妙為微妙、為上為無上。",
        "translation": "Because of these causes and conditions, the bodhisattva's pure precepts are the most superior, honored, exalted, marvelous, subtle, and unsurpassed among ordinary people, śrāvakas, and pratyekbuddhas",
        "source": "T07n0220_586:1033b02_6"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1033b05_7"
    },
    {
        "source_sentence": "如雪山王具山王德，餘山不具；",
        "translation": "It is as if the king of the Himalayas possessed the qualities of a king, while the other mountains did not.",
        "source": "T07n0220_586:1033b05_8"
    },
    {
        "source_sentence": "若具德者得山王名，若不具德不立王號。",
        "translation": "If someone is endowed with virtue, they'll get the name of king of mountains, and if they aren't endowed with virtue, they won't be called king.",
        "source": "T07n0220_586:1033b06_9"
    },
    {
        "source_sentence": "如是菩薩所有淨戒，迴向無上正等菩提，不離趣求一切智智故，名淨戒波羅蜜多；",
        "translation": "Thus, the pure morality of enlightening beings is called the perfection of pure morality because they dedicate themselves to unsurpassed true and complete enlightenment without leaving the path or seeking omniscience.",
        "source": "T07n0220_586:1033b07_0"
    },
    {
        "source_sentence": "獨覺、聲聞、異生淨戒不欲迴向無上菩提，遠離所求一切智智，不名淨戒波羅蜜多。",
        "translation": "The pure precepts of solitary realizers, śrāvakas, and ordinary people who don't want to dedicate themselves back to unsurpassed enlightenment and are far removed from the omniscience and cognition they seek aren't called",
        "source": "T07n0220_586:1033b08_1"
    },
    {
        "source_sentence": "「又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1033b10_2"
    },
    {
        "source_sentence": "諸菩薩眾所有淨戒，普勝異生、聲聞、獨覺所有淨戒。」",
        "translation": "The pure precepts possessed by the bodhisattvas are universally superior to the pure precepts possessed by ordinary people, śrāvakas, and pratyekbuddhas.",
        "source": "T07n0220_586:1033b11_0"
    },
    {
        "source_sentence": "時，滿慈子便問具壽舍利子言：「何緣菩薩摩訶薩眾所有淨戒，普勝異生、聲聞、獨覺所有淨戒？」",
        "translation": "Pūrṇa Maitrāyaniputra then asked Kauśāriputra, What's the reason why the pure precepts of the bodhisattvas, mahāsattvas, and solitary realizers are so superior to the pure precepts of ordinary",
        "source": "T07n0220_586:1033b12_1"
    },
    {
        "source_sentence": "舍利子言：「菩薩淨戒普為利樂一切有情，迴向趣求一切智智，異生、聲聞、獨覺不爾，",
        "translation": "Śāriputra said, The pure precepts of the bodhisattva universally benefit all sentient beings and dedicate themselves to the pursuit of omniscience and knowledge, but that's not the case for ordinary people, śrāvakas, or",
        "source": "T07n0220_586:1033b14_2"
    },
    {
        "source_sentence": "是故菩薩所有淨戒，普勝異生、聲聞、獨覺所有淨戒。」",
        "translation": "Therefore, the pure precepts possessed by bodhisattvas are universally superior to the pure precepts possessed by ordinary people, śrāvakas, and pratyekbuddhas.",
        "source": "T07n0220_586:1033b16_3"
    },
    {
        "source_sentence": "時，滿慈子便讚具壽舍利子言：「善哉！",
        "translation": "Pūrṇa Maitrāyaniputra then praised Kauśāriputra, saying, Good!",
        "source": "T07n0220_586:1033b17_4"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_586:1033b18_5"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_586:1033b18_6"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_586:1033b18_7"
    },
    {
        "source_sentence": "誠如所說。",
        "translation": "It's really as explained.",
        "source": "T07n0220_586:1033b18_8"
    },
    {
        "source_sentence": "如是讚說菩薩淨戒，令菩薩眾轉復精勤，受持菩薩所有淨戒。",
        "translation": "Such praise and explanation of the bodhisattva's pure precepts causes the bodhisattvas to become more diligent and accept and uphold the pure precepts that are possessed by the bodhisattva.",
        "source": "T07n0220_586:1033b18_9"
    },
    {
        "source_sentence": "尊者定應承佛神力說，諸菩薩所有淨戒，普勝異生、聲聞、獨覺所有淨戒。」",
        "translation": "Venerable, you must surely inherit the Buddha's miraculous power to explain that the pure precepts of bodhisattvas are superior to the pure precepts of ordinary people, śrāvakas, and pratyekbuddhas.",
        "source": "T07n0220_586:1033b20_10"
    },
    {
        "source_sentence": "爾時，佛告阿難陀言：「汝應受持諸菩薩眾所有淨戒波羅蜜多相應法教，",
        "translation": "It was then that the Buddha addressed Ānanda, saying: You should accept and uphold the teaching of the Dharma associated with the perfection of morality for all bodhisattvas.",
        "source": "T07n0220_586:1033b22_0"
    },
    {
        "source_sentence": "如舍利子與滿慈子共所演說，如是演說定不虛妄。",
        "translation": "Just as Śāriputra and Pūrṇa Maitrāyaniputra shared what they taught together, such teachings are definitely not false.",
        "source": "T07n0220_586:1033b23_1"
    },
    {
        "source_sentence": "假使有取妙高山王，上昇梵世投之於下；",
        "translation": "Suppose there is a man who takes the king of the sublime high mountains and ascends up into the Brahma world and casts them down.",
        "source": "T07n0220_586:1033b24_2"
    },
    {
        "source_sentence": "彼適投已，發誠諦言：『若菩薩戒普勝異生、聲聞、獨覺諸淨戒者，令此山王虛空中住。』",
        "translation": "After he joined them, he spoke with sincerity, saying, 'If the bodhisattva precepts universally overpower the pure precepts of worldlings, śrāvakas, and pratyekbuddhas, they'll cause this mountain king to",
        "source": "T07n0220_586:1033b25_3"
    },
    {
        "source_sentence": "言已便住，必不墮落。",
        "translation": "After saying this, he'll abide, and he won't fall down.",
        "source": "T07n0220_586:1033b27_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_586:1033b28_5"
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T07n0220_586:1033b28_6"
    },
    {
        "source_sentence": "諸菩薩戒，除如來戒，於餘淨戒若有漏、若無漏為最為勝、為尊為高、為妙為微妙、為上為無上。」",
        "translation": "The bodhisattva precepts, except for the Tathāgata precepts, are the most superior, honored, high, marvelous, subtle, and unsurpassed among the other pure precepts if they are contaminated or uncontaminated",
        "source": "T07n0220_586:1033b28_7"
    },
    {
        "source_sentence": "時，舍利子，佛神力故，便見東方有一佛土，去此佛土過百千界，其中如來現為無量人、天等眾宣說正法。",
        "translation": "Because of the Buddha’s supernatural power, Śāriputra saw in the east a buddha-land that extended beyond one hundred thousand worlds from that buddha-land. In this buddha-land the Tathāgata manifested himself expounding the",
        "source": "T07n0220_586:1033c01_8"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「汝見東方過百千界有一佛土，現有如來為無量眾說正法不？」",
        "translation": "It was then that the Buddha addressed Śāriputra, Do you see a buddha land beyond a hundred thousand worlds in the east that has a Tathāgata who teaches the right teaching for measureless multitudes?",
        "source": "T07n0220_586:1033c04_0"
    },
    {
        "source_sentence": "舍利子言：「唯然！",
        "translation": "Śāriputra said, Yes!",
        "source": "T07n0220_586:1033c05_1"
    },
    {
        "source_sentence": "已見！",
        "translation": "I've seen it!",
        "source": "T07n0220_586:1033c06_2"
    },
    {
        "source_sentence": "未知彼界、彼佛何名？」",
        "translation": "I don't know the names of those realms and those buddhas?",
        "source": "T07n0220_586:1033c06_3"
    },
    {
        "source_sentence": "爾時，世尊告舍利子：「彼佛世界名曰明燈，其中如來、應、正等覺現說法者，",
        "translation": "At that time the World-honored One said to Śāriputra: That buddha-realm is called the “luminous lamp.” The Tathāgatas, Arhats, Perfectly Enlightened Ones, who are present in that world and",
        "source": "T07n0220_586:1033c06_4"
    },
    {
        "source_sentence": "號為月光。",
        "translation": "It's called the moonlight.",
        "source": "T07n0220_586:1033c08_5"
    },
    {
        "source_sentence": "彼佛有一聲聞弟子，名為有頂神通第一，以神通力往餘世界，右手拔取妙高山王，",
        "translation": "In that buddha there was a śrāvaka disciple named the supreme among those with transcendent powers in the summit of existence. He went to other worlds by means of his transcendent powers and, pulling out the king of the wonderful high",
        "source": "T07n0220_586:1033c08_6"
    },
    {
        "source_sentence": "上昇梵世投之於下；",
        "translation": "He ascended up into the world of Brahma and cast it down.",
        "source": "T07n0220_586:1033c10_7"
    },
    {
        "source_sentence": "彼適投已發誠諦言：『若菩薩戒，除如來戒，於餘淨戒若有漏、若無漏為最為勝、為尊為高、為妙為微妙、為上為無上，",
        "translation": "“If the bodhisattva precepts, with the exception of the Tathāgata precepts, are foremost, most distinguished, honored, exalted, marvelous, subtle, superior, and unsurpassed among the other pure pre",
        "source": "T07n0220_586:1033c11_8"
    },
    {
        "source_sentence": "如是所說不虛妄者，令此山王虛空中住。』",
        "translation": "If what's explained like this isn't false, it will cause this king of mountains to live in space.'",
        "source": "T07n0220_586:1033c13_9"
    },
    {
        "source_sentence": "言已便住更不復下。」",
        "translation": "After he says that, he'll abide and won't descend again.",
        "source": "T07n0220_586:1033c14_10"
    },
    {
        "source_sentence": "爾時，世尊告舍利子：「汝復見彼妙高山王住虛空中更不下不？」",
        "translation": "It was then that the Bhagavān addressed Śāriputra, Do you see that marvelous high mountain king standing in space or not?",
        "source": "T07n0220_586:1033c15_11"
    },
    {
        "source_sentence": "時，舍利子白言：「已見！",
        "translation": "Śāriputra then said, Alright!",
        "source": "T07n0220_586:1033c16_12"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_586:1033c16_13"
    },
    {
        "source_sentence": "復告舍利子言：「今彼山王住虛空者，由依菩薩所有淨戒，除如來戒，",
        "translation": "Again, Śāriputra said to Śāriputra, Now that king of mountains is living in space, it's because he relies on the pure precepts of the bodhisattvas, except for the Tathāgata's precepts.",
        "source": "T07n0220_586:1033c17_14"
    },
    {
        "source_sentence": "發誠諦言普勝異生、聲聞等戒，是故我說決定不虛。",
        "translation": "They give rise to the sincere truth that they are universally superior to ordinary people and śrāvakas in terms of precepts, so therefore I say it's definitely not false.",
        "source": "T07n0220_586:1033c18_15"
    },
    {
        "source_sentence": "彼佛眾中聲聞弟子，以神通力往餘世界，右手拔取妙高山王，上昇梵世投之於下，",
        "translation": "The śrāvaka disciples among the Buddha’s assembly, by means of their supernatural powers, proceeded to other worlds. With their right hands they uprooted the wonderful high mountain range and climbed up into the brahma-heaven",
        "source": "T07n0220_586:1033c19_16"
    },
    {
        "source_sentence": "投已復發誠諦之言，言已山王住虛空者，為證我說定不虛妄。",
        "translation": "After throwing it down, he then spoke the words of sincerity again, saying, 'The king of mountains who live in space after they've been cast down are definitely not falsely explained as proof that I'm speaking.'",
        "source": "T07n0220_586:1033c21_17"
    },
    {
        "source_sentence": "時，彼如來聲聞弟子，依菩薩戒發誠諦言，令彼山王還住本處。」",
        "translation": "That śrāvaka disciple of the Tathāgata then relied on the bodhisattva precepts to arouse his sincerity and tell the king of the mountain to return to his original place.",
        "source": "T07n0220_586:1033c23_18"
    },
    {
        "source_sentence": "時，舍利子見已讚言：「甚奇！",
        "translation": "Seeing this, Śāriputra praised it, saying, Marvelous!",
        "source": "T07n0220_586:1033c24_19"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_586:1033c25_20"
    },
    {
        "source_sentence": "所言誠諦。",
        "translation": "It's called the sincere truth.",
        "source": "T07n0220_586:1033c25_21"
    },
    {
        "source_sentence": "諸菩薩戒威力難思，一切世間無能及者。」",
        "translation": "The authoritative power of the bodhisattva precepts is inconceivable, and there's no one in the world who can match them.",
        "source": "T07n0220_586:1033c25_22"
    },
    {
        "source_sentence": "時，舍利子便白佛言：「若有欲勝菩薩戒者，當知彼欲勝如來戒。",
        "translation": "Śāriputra then said to the Buddha, If someone wants to overcome the bodhisattva precepts, they should know that they want to overcome the Tathāgata precepts.",
        "source": "T07n0220_586:1033c26_23"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_586:1033c27_24"
    },
    {
        "source_sentence": "除如來戒，定無能勝菩薩戒者。",
        "translation": "Except for the Tathāgata precepts, there's definitely no one who can surpass the bodhisattva precepts.",
        "source": "T07n0220_586:1033c28_0"
    },
    {
        "source_sentence": "若修菩薩淨戒圓滿，即名如來、應、正等覺，是故菩薩戒不可勝。」",
        "translation": "If someone cultivates the pure precepts of bodhisattva perfection, they're called the Tathāgata, Arhat, and Completely Awakened One; therefore, the bodhisattva precepts are invincible.",
        "source": "T07n0220_586:1033c28_1"
    },
    {
        "source_sentence": "時，滿慈子便問具壽舍利子言：「有退菩薩所有淨戒豈難勝耶？」",
        "translation": "Pūrṇa Maitrāyaniputra then asked Kauṣṭhila Śāriputra, Is it difficult to overcome the pure precepts of a retrogressing bodhisattva?",
        "source": "T07n0220_586:1034a01_2"
    },
    {
        "source_sentence": "舍利子言：「定無菩薩住菩薩心有退轉者，若有退轉便非菩薩。",
        "translation": "Śāriputra said, There's certainly no bodhisattva who abides in the mind of a bodhisattva and has retrogression, and if he does retrogress, then he's not a bodhisattva.",
        "source": "T07n0220_586:1034a02_3"
    },
    {
        "source_sentence": "如善射師箭不中的，應知彼類非善射師；",
        "translation": "Just as the arrow of a good archer is not in the middle, you should know that these people are not good archers.",
        "source": "T07n0220_586:1034a03_4"
    },
    {
        "source_sentence": "菩薩亦爾，若不能發一切智智相應之心，雖復勤修布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "Similarly, if a bodhisattva can't give rise to the mind associated with omniscience and knowledge, even though he diligently cultivates generosity, pure morality, patience, effort, meditation, concentration, and the perfection of wisdom, then he'll",
        "source": "T07n0220_586:1034a04_5"
    },
    {
        "source_sentence": "而不迴向一切智智，當知彼非具戒菩薩。",
        "translation": "They don't return to omniscience and cognition, you should know that they aren't bodhisattvas who possess the precepts.",
        "source": "T07n0220_586:1034a07_0"
    },
    {
        "source_sentence": "又，滿慈子！",
        "translation": "Furthermore, Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1034a08_0"
    },
    {
        "source_sentence": "若有菩薩修諸功德，不解云何菩薩迴向一切智智？",
        "translation": "If there are bodhisattvas who cultivate virtues but don't understand how a bodhisattva dedicates himself to omniscience and cognition?",
        "source": "T07n0220_586:1034a08_1"
    },
    {
        "source_sentence": "而緣聲聞或獨覺地所有功德，謂是所求一切智智。",
        "translation": "The merit that's conditioned by the stages of śrāvakas or pratyekbuddhas is the omniscience and cognition that they seek.",
        "source": "T07n0220_586:1034a09_2"
    },
    {
        "source_sentence": "當知彼類猶得名為具戒菩薩。",
        "translation": "You should know that these kinds of bodhisattvas are still called bodhisattvas who possess the precepts.",
        "source": "T07n0220_586:1034a10_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_586:1034a11_4"
    },
    {
        "source_sentence": "滿慈子！",
        "translation": "Pūrṇa Maitrāyaniputra!",
        "source": "T07n0220_586:1034a11_5"
    },
    {
        "source_sentence": "彼無菩薩方便善巧，不解迴向一切智智，緣二乘地所有功德，謂是所求一切智智，",
        "translation": "They lack the skillful means of bodhisattvas, don’t understand and dedicate themselves to omniscience and knowledge, and rely on the merits of the two-vehicle state—that is, they seek omniscience and knowledge.",
        "source": "T07n0220_586:1034a11_6"
    },
    {
        "source_sentence": "意樂不壞故，亦名為具戒菩薩。",
        "translation": "Because their aspiration doesn't break down, they're also called a bodhisattva who possesses the precepts.",
        "source": "T07n0220_586:1034a13_7"
    },
    {
        "source_sentence": "持菩薩戒由有迴向一切智智故，得名為持菩薩戒，攝受淨戒波羅蜜多。",
        "translation": "It's because they have the knowledge of omniscience that they dedicate themselves back to omniscience that they're called observing the bodhisattva precepts and taking in the perfection of pure morality.",
        "source": "T07n0220_586:1034a14_8"
    },
    {
        "source_sentence": "彼於後時若遇善友，能緣真實一切智智，迴向無上正等菩提，定當證得一切智智。",
        "translation": "Later, if they meet a good friend who can focus on the cognition of all things as they really are and dedicate themselves to unsurpassed perfect enlightenment, they'll surely realize the cognition of all things.",
        "source": "T07n0220_586:1034a15_9"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百八十六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 6",
        "source": "T07n0220_586:1034a18_0"
    }
]