[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 1",
        "source": "T07n0220_510:0601c06_0"
    },
    {
        "source_sentence": "十",
        "translation": "ten",
        "source": "T07n0220_510:0601c07_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_510:0601c09_0"
    },
    {
        "source_sentence": "第三分現世間品第十五之一",
        "translation": "The Fifteenth Part of the Third Part of the Chapter on the Manifestation of the Worlds, Part I",
        "source": "T07n0220_510:0601c10_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0601c11_0"
    },
    {
        "source_sentence": "如有女人生育諸子，或五、或十、二十、三十、四十、五十、若百、若千，",
        "translation": "“Suppose a woman gives birth to five, ten, twenty, thirty, forty, forty, forty, fifty, a hundred, or a thousand children.",
        "source": "T07n0220_510:0601c11_1"
    },
    {
        "source_sentence": "其母得病，諸子各別勤求醫療，作是念言：『云何我母當得病愈，長壽安樂、身無眾苦、心離憂愁？』",
        "translation": "When his mother became ill, the children each diligently sought treatment and thought, 'How will my mother be cured of illness, have a long life that's peaceful, have no suffering in body or mind, and be free of sorrow?'",
        "source": "T07n0220_510:0601c12_2"
    },
    {
        "source_sentence": "諸子爾時競設方便，求安樂具覆護母身，勿為蚊虻、蛇蠆、風熱、飢渴等觸之所侵惱，",
        "translation": "At the time, the children competed to find a way to protect their mother's body from being attacked by mosquitoes, gadflies, snakes, vipers, wind, fever, hunger, thirst, and other tactile sensations.",
        "source": "T07n0220_510:0601c14_3"
    },
    {
        "source_sentence": "又以種種上妙樂具，恭敬供養而說是言：『我母慈悲生育我等，誨示種種世間事業，",
        "translation": "They also offered various kinds of exquisite food and drink to the gods, saying, “Our mother’s compassionate love gave birth to us. She instructed us in all worldly affairs.",
        "source": "T07n0220_510:0601c16_4"
    },
    {
        "source_sentence": "我等豈得不報母恩！』",
        "translation": "How could we not repay our mother's kindness?'",
        "source": "T07n0220_510:0601c18_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0601c19_0"
    },
    {
        "source_sentence": "如來、應、正等覺亦復如是，常以佛眼種種方便，觀察護念甚深般若波羅蜜多。",
        "translation": "The Tathāgata, Arhat, and Completely Awakened One are likewise, always observing and guarding the profound prajñāpāramitā with various skillful means with the Buddha's eye.",
        "source": "T07n0220_510:0601c19_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0601c20_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能生我等一切佛法，能示世間諸法實相。",
        "translation": "The profound prajñāpāramitā can give rise to all the buddha-dharmas of self and others, and it can show the true characteristics of worldly dharmas.",
        "source": "T07n0220_510:0601c21_3"
    },
    {
        "source_sentence": "十方世界一切如來現說法者，亦以佛眼常觀護念甚深般若波羅蜜多。",
        "translation": "All the tathāgatas in the worlds of the ten directions who presently teach the Dharma also always observe and guard the profound prajñāpāramitā with the Buddha's eye, which is the profound prajñāpāramitā.",
        "source": "T07n0220_510:0601c22_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0601c24_5"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能生如來一切功德，能示世間諸法實相。",
        "translation": "The profound prajñāpāramitā can give rise to all the Tathāgata's merits and show the true characteristics of worldly dharmas.",
        "source": "T07n0220_510:0601c24_6"
    },
    {
        "source_sentence": "由此因緣，我等諸佛常以佛眼觀察護念甚深般若波羅蜜多，為報彼恩不應暫捨。",
        "translation": "Because of these causes and conditions, we buddhas always observe the profound prajñāpāramitā with the Buddha's eye and guard it, and we shouldn't abandon it for a moment in order to repay their kindness.",
        "source": "T07n0220_510:0601c25_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_510:0601c27_8"
    },
    {
        "source_sentence": "一切如來、應、正等覺所有靜慮乃至布施波羅蜜多，廣說乃至一切相智，",
        "translation": "All the meditations of all Buddhas, enlightening beings, and fully awakened ones up to the perfection of generosity are extensively explained up to omniscience.",
        "source": "T07n0220_510:0601c27_9"
    },
    {
        "source_sentence": "皆由如是甚深般若波羅蜜多而得生故；",
        "translation": "They all arise from such profound transcendent wisdom.",
        "source": "T07n0220_510:0601c29_10"
    },
    {
        "source_sentence": "所有預流、一來、不還、阿羅漢果、獨覺菩提，亦由如是甚深般若波羅蜜多而得生故；",
        "translation": "All the stream-enterers, once-returners, nonreturners, arhats, and pratyekabuddhas are also born from such profound prajñāpāramitā.",
        "source": "T07n0220_510:0602a01_11"
    },
    {
        "source_sentence": "所有菩薩摩訶薩行、諸佛無上正等菩提，皆由如是甚深般若波羅蜜多而得生故；",
        "translation": "All the practices of great enlightening beings and the supreme perfect enlightenment of buddhas arise from such profound transcendent wisdom.",
        "source": "T07n0220_510:0602a03_12"
    },
    {
        "source_sentence": "一切預流乃至諸佛，皆由如是甚深般若波羅蜜多而得有故；",
        "translation": "All the stream-enterers and even all buddhas are found to exist by means of such profound transcendent wisdom.",
        "source": "T07n0220_510:0602a05_13"
    },
    {
        "source_sentence": "一切如來、應、正等覺已、正、當得無上菩提，皆因如是甚深般若波羅蜜多。",
        "translation": "All the Tathāgatas, Arhats, Perfectly Awakened Ones, and those who will attain unsurpassed enlightenment are all caused by such profound prajñāpāramitā.",
        "source": "T07n0220_510:0602a06_14"
    },
    {
        "source_sentence": "由此因緣，甚深般若波羅蜜多於諸如來有大恩德，是故諸佛常以佛眼種種方便觀察護念。",
        "translation": "Because of these causes and conditions, the profound prajñāpāramitā has great kindness toward the tathāgatas; therefore, the buddhas always use the Buddha's eye to observe and guard mindfulness with various skillful means.",
        "source": "T07n0220_510:0602a08_15"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0602a10_16"
    },
    {
        "source_sentence": "若善男子、善女人等有能聽問、書寫、受持、讀誦、修習、思惟、演說甚深般若波羅蜜多，",
        "translation": "If there are good men and good women who can hear, write, memorize, recite, cultivate, contemplate, and expound the profound prajñāpāramitā,",
        "source": "T07n0220_510:0602a10_17"
    },
    {
        "source_sentence": "一切如來、應、正等覺，常以佛眼觀察護念，令其身心常得安樂，所修善業皆無留難。",
        "translation": "All tathāgatas, arhats, and perfectly enlightened ones always observe with the Buddha's eye and guard mindfulness, so that their bodies and minds will always attain peace and comfort, and there won't be any difficulty in cultivating good actions.",
        "source": "T07n0220_510:0602a12_18"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0602a14_19"
    },
    {
        "source_sentence": "若善男子、善女人等，能於般若波羅蜜多聽問、書寫、受持、讀誦、修習、思惟、為他演說，",
        "translation": "If good men and good women can hear, write, memorize, recite, cultivate, contemplate, and explain the perfection of wisdom to others,",
        "source": "T07n0220_510:0602a14_20"
    },
    {
        "source_sentence": "十方世界一切如來、應、正等覺皆共護念，令於無上正等菩提得不退轉。」",
        "translation": "All the tathāgatas, arhats, and perfectly enlightened ones in the worlds of the ten directions will all be guarded together so that they attain unsurpassed perfect enlightenment without regressing.",
        "source": "T07n0220_510:0602a16_21"
    },
    {
        "source_sentence": "具壽善現便白佛言：「如世尊說：甚深般若波羅蜜多能生諸佛，能示世間諸法實相。",
        "translation": "Guoshou Shancheng then said to the Buddha, As the Bhagavān explains, the profound prajñāpāramitā can give rise to buddhas who can show the true characteristics of worldly dharmas.",
        "source": "T07n0220_510:0602a18_22"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0602a20_0"
    },
    {
        "source_sentence": "云何甚深般若波羅蜜多能生諸佛，能示世間諸法實相？",
        "translation": "How can the profound prajñāpāramitā give rise to buddhas and show the true characteristics of worldly dharmas?",
        "source": "T07n0220_510:0602a20_1"
    },
    {
        "source_sentence": "云何諸佛從般若生？",
        "translation": "How are the buddhas produced from prajñā?",
        "source": "T07n0220_510:0602a21_2"
    },
    {
        "source_sentence": "云何如來說世間相？」",
        "translation": "How does the Tathāgata explain the characteristics of the world?",
        "source": "T07n0220_510:0602a21_3"
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多能生諸佛所有十力廣說乃至一切相智，",
        "translation": "The Buddha told Shancheng, The profound prajñāpāramitā can give rise to the ten powers of the buddhas' extensive explanation up to the knowledge of all characteristics,",
        "source": "T07n0220_510:0602a22_4"
    },
    {
        "source_sentence": "此等無量無邊功德皆從般若波羅蜜多而得生長，由得如是諸佛法故說名為佛。",
        "translation": "These measureless and limitless merits all grow from the perfection of wisdom, and it's because they attain these buddha-teachings that they're called buddhas.",
        "source": "T07n0220_510:0602a24_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多能生如是諸佛功德，由此故說甚深般若波羅蜜多能生諸佛，",
        "translation": "The profound prajñāpāramitā can give rise to the merits of such buddhas, and therefore it's said that the profound prajñāpāramitā can give rise to buddhas.",
        "source": "T07n0220_510:0602a25_1"
    },
    {
        "source_sentence": "亦說諸佛從彼而生。",
        "translation": "It's also said that the buddhas are born from them.",
        "source": "T07n0220_510:0602a27_2"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0602a28_3"
    },
    {
        "source_sentence": "甚深般若波羅蜜多能示世間諸法實相者，謂能示世間五蘊實相，一切如來、應、正等覺亦說世間五蘊實相。」",
        "translation": "The profound prajñāpāramitā that can show the true characteristics of worldly dharmas means it can show the true characteristics of the five aggregates of the world, and all tathāgatas, arhats, and perfectly enlightened ones also teach the true characteristics of the five aggregates of the world.",
        "source": "T07n0220_510:0602a28_4"
    },
    {
        "source_sentence": "具壽善現復白佛言：「云何如來、應、正等覺甚深般若波羅蜜多說示世間五蘊實相？」",
        "translation": "Guoshou Shancheng then said to the Buddha, How does the Tathāgata, Arhat, and Completely Enlightened One explain the profound prajñāpāramitā that shows the true characteristics of the five aggregates in the world?",
        "source": "T07n0220_510:0602b01_5"
    },
    {
        "source_sentence": "佛告善現：「一切如來、應、正等覺甚深般若波羅蜜多，俱不說示色等五蘊，",
        "translation": "The Buddha told Shancheng, All the profound prajñāpāramitā of the Tathāgatas, Arhats, and Fully Awakened Ones don't explain the five aggregates that show form and so forth.",
        "source": "T07n0220_510:0602b03_6"
    },
    {
        "source_sentence": "有成有壞、有生有滅、有染有淨、有增有減、有入有出、有過去有未來有現在、有善有不善有無記、有欲界繫有色界繫有無色界繫。",
        "translation": "There's formation and disintegration, birth and cessation, defilement and purity, increase and decrease, entry and exit, past and future, present and future, good and unskillful and indeterminate, fetters in the desire realm, fetters in the form realm, and fetters in the formless realm.",
        "source": "T07n0220_510:0602b05_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0602b08_8"
    },
    {
        "source_sentence": "非空、無相、無願之法有成有壞、有生滅等，非無造作、無生、無滅、無性之法有成有壞、有生滅等。",
        "translation": "It's not that the dharmas of emptiness, signlessness, wishlessness have formation and disintegration, birth and cessation, and so forth, but it's not that the dharmas without creation, non-production, non-cessation, and naturelessness have formation and disintegration or birth and cessation.",
        "source": "T07n0220_510:0602b08_9"
    },
    {
        "source_sentence": "一切如來、應、正等覺甚深般若波羅蜜多如是說示五蘊實相，此五蘊相即是世間，",
        "translation": "The profound prajñāpāramitā of all the Tathāgatas, Arhats, and Fully Awakened Ones thus explains the true characteristics of the five aggregates, which are the world.",
        "source": "T07n0220_510:0602b10_10"
    },
    {
        "source_sentence": "是故世間亦無成、壞、生、滅等相。",
        "translation": "Therefore, the world also has no such characteristics as formation, disintegration, arising, and ceasing.",
        "source": "T07n0220_510:0602b12_11"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0602b13_12"
    },
    {
        "source_sentence": "一切如來、應、正等覺皆依般若波羅蜜多，能普證知無量無數無邊有情心行差別。",
        "translation": "All tathāgatas, arhats, and fully awakened ones rely on the prajñāpāramitā to universally realize the distinctions in the minds and actions of measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_510:0602b13_13"
    },
    {
        "source_sentence": "然此般若波羅蜜多甚深義中，都無有情及無有情施設可得，都無諸色亦無諸色施設可得，",
        "translation": "However, in the profound meaning of this prajñāpāramitā, there are no sentient beings and no sentient beings that can be defined, and there are no forms and no forms that can be defined.",
        "source": "T07n0220_510:0602b15_14"
    },
    {
        "source_sentence": "都無受、想、行、識亦無受、想、行、識施設可得，廣說乃至都無一切智、道相智、一切相智亦無一切智、道相智、一切相智施設可得。",
        "translation": "There's no sensation, perception, volition, or consciousness at all and no perceptions, perception, volition, or consciousness are defined to be obtainable, and it's explained in detail that there's no omniscience, knowledge of the path, or knowledge of all characteristics, and there's no omniscience, knowledge of the path, or knowledge of all character",
        "source": "T07n0220_510:0602b17_15"
    },
    {
        "source_sentence": "一切如來、應、正等覺甚深般若波羅蜜多，如是說示世間之相。",
        "translation": "All the profound prajñāpāramitā of all tathāgatas, arhats, and fully awakened ones are thus explained to show worldly characteristics.",
        "source": "T07n0220_510:0602b20_16"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0602b21_17"
    },
    {
        "source_sentence": "甚深般若波羅蜜多不示現色廣說乃至一切相智。",
        "translation": "The profound prajñāpāramitā doesn't show form and explain it in detail up to the knowledge of all characteristics.",
        "source": "T07n0220_510:0602b22_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0602b23_19"
    },
    {
        "source_sentence": "此大般若波羅蜜多甚深義中，甚深般若波羅蜜多尚無所有都不可得，況有諸色廣說乃至一切相智可得示現！",
        "translation": "In the profound meaning of this great prajñāpāramitā, the profound prajñāpāramitā has no existence and can't be obtained, so how could there be forms that are explained in detail or even all-inclusive cognition that can be shown?",
        "source": "T07n0220_510:0602b23_20"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0602b26_21"
    },
    {
        "source_sentence": "一切有情施設言說，若有色、若無色，若有想、若無想、若非有想非無想，",
        "translation": "All sentient beings define and say, 'If there's form or formlessness, if there's perception or non-perception, and if there's neither perception nor non-perception,",
        "source": "T07n0220_510:0602b26_22"
    },
    {
        "source_sentence": "若此世界、若餘十方一切世界，是諸有情若略心、若散心，一切如來、應、正等覺依深般若波羅蜜多皆如實知。」",
        "translation": "Whether this world or any other worlds in the ten directions, whether abbreviated or dispersed by sentient beings, all tathāgatas, arhats, and fully awakened ones truly know the profound prajñāpāramitā based on the profound prajñāpāramitā.",
        "source": "T07n0220_510:0602b28_23"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0602c01_24"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類略心、散心？」",
        "translation": "How do the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the abbreviated minds and dispersed minds of those sentient beings?",
        "source": "T07n0220_510:0602c01_25"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0602c03_26"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，由法性故，如實知彼諸有情類略心、散心。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā because of the Dharma nature to truly know the abbreviated minds and distracted minds of those sentient beings.",
        "source": "T07n0220_510:0602c03_27"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0602c05_28"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，由法性故，如實知彼諸有情類略心、散心？」",
        "translation": "How do the Tathāgatas, Arhats, and Fully Awakened Ones rely on the profound prajñāpāramitā to truly know the abbreviated minds and dispersed minds of those sentient beings because of their Dharma nature?",
        "source": "T07n0220_510:0602c05_29"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0602c07_30"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知法性中法性尚無所有都不可得，",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones rely on the profound prajñāpāramitā to truly know that the Dharma-nature in the Dharma-nature is still nonexistent and cannot be obtained.",
        "source": "T07n0220_510:0602c07_31"
    },
    {
        "source_sentence": "況有有情略心、散心而可得者！",
        "translation": "How much more so when there are sentient beings whose minds are abbreviated and distracted but attainable!",
        "source": "T07n0220_510:0602c09_32"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，由法性故，如實知彼諸有情類略心、散心。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā because they truly know the abbreviated minds and dispersed minds of those sentient beings because of their Dharma nature.",
        "source": "T07n0220_510:0602c10_33"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0602c12_34"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，由盡故、離染故、滅故、斷故、寂靜故、遠離故，",
        "translation": "All tathāgatas, arhats, and fully awakened ones rely on the profound prajñāpāramitā because they are exhausted, free of defilement, cessation, elimination, quiescence, and separation.",
        "source": "T07n0220_510:0602c12_35"
    },
    {
        "source_sentence": "如實知彼諸有情類略心、散心。」",
        "translation": "They truly know the abbreviated minds and distracted minds of those sentient beings.",
        "source": "T07n0220_510:0602c14_36"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0602c14_37"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，由盡故、離染故、滅故、斷故、寂靜故、遠離故，",
        "translation": "How do the Tathāgatas, Arhats, and Fully Awakened Ones rely on the profound prajñāpāramitā because they are exhausted, free of defilement, cessation, elimination, quiescence, and detachment?",
        "source": "T07n0220_510:0602c15_0"
    },
    {
        "source_sentence": "如實知彼諸有情類略心、散心？」",
        "translation": "Do you really know the abbreviated minds and distracted minds of those sentient beings?",
        "source": "T07n0220_510:0602c16_1"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0602c17_2"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知盡、離染、滅、斷、寂靜、遠離中，",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones rely on the profound prajñāpāramitā to truly know extinction, freedom from defilement, cessation, cessation, quiescence, tranquility, and separation.",
        "source": "T07n0220_510:0602c17_3"
    },
    {
        "source_sentence": "盡等性尚無所有都不可得，況有有情略心、散心而可得者！",
        "translation": "The nature of exhaustion and so forth are still nonexistent and cannot be obtained, so why wouldn't they be obtained by sentient beings with a brief mind or a distracted mind?",
        "source": "T07n0220_510:0602c19_4"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，由盡、離染、滅、斷、寂靜、遠離故，",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā because it ends, parts with defilement, ceases, stops, becomes tranquil, and is far removed.",
        "source": "T07n0220_510:0602c20_5"
    },
    {
        "source_sentence": "如實知彼諸有情類略心、散心。",
        "translation": "They truly know the abbreviated minds and distracted minds of those sentient beings.",
        "source": "T07n0220_510:0602c22_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0602c23_7"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類有貪心、離貪心，",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones rely on the profound prajñāpāramitā to truly know that all sentient beings have craving and are free of craving.",
        "source": "T07n0220_510:0602c23_8"
    },
    {
        "source_sentence": "有瞋心、離瞋心，有癡心、離癡心。」",
        "translation": "There's anger and freedom from anger, and there's delusion and freedom from delusion.",
        "source": "T07n0220_510:0602c25_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0602c25_10"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類有貪心、離貪心，",
        "translation": "How do the Tathāgatas, Arhats, and Fully Awakened Ones rely on the profound prajñāpāramitā to truly know that all sentient beings have craving and are free of craving?",
        "source": "T07n0220_510:0602c25_11"
    },
    {
        "source_sentence": "有瞋心、離瞋心，有癡心、離癡心？」",
        "translation": "Is there an angry mind and a mind free of anger, a mind free of delusion, and a mind free of delusion?",
        "source": "T07n0220_510:0602c27_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0602c28_13"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類有貪、瞋、癡心如實性，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know that all sentient beings have the true nature of craving, anger, and delusion in their minds.",
        "source": "T07n0220_510:0602c28_14"
    },
    {
        "source_sentence": "非有貪、瞋、癡心，非離貪、瞋、癡心。",
        "translation": "They don't have the minds of craving, anger, and delusion, and they aren't free of the minds of craving, anger, and delusion.",
        "source": "T07n0220_510:0603a01_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0603a02_16"
    },
    {
        "source_sentence": "如實性中，心、心所法尚無所有都不可得，況有有貪、瞋、癡心，離貪、瞋、癡心而可得者！",
        "translation": "As it really is, the mind and mental factors are still nonexistent and cannot be obtained, so why wouldn't there be craving, anger, and delusion that can be obtained apart from craving, anger, and delusion?",
        "source": "T07n0220_510:0603a02_17"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類離貪、瞋、癡心如實性非離貪、瞋、癡心，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know that those sentient beings are free of craving, anger, and delusion as they really are, not free of craving, anger, or delusion.",
        "source": "T07n0220_510:0603a04_18"
    },
    {
        "source_sentence": "非有貪、瞋、癡心。",
        "translation": "They don't have craving, anger, or delusion.",
        "source": "T07n0220_510:0603a06_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0603a06_20"
    },
    {
        "source_sentence": "如實性中，心、心所法尚無所有都不可得，況有離貪、瞋、癡心，有貪、瞋、癡心而可得者！",
        "translation": "As it really is, the mind and mental factors are still nonexistent and cannot be obtained, so how could there be someone who's free of craving, anger, and delusion and has a mind free of craving, anger, and delusion that's obtainable?",
        "source": "T07n0220_510:0603a06_21"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類有貪心、離貪心，",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know that all sentient beings have craving and are free of craving.",
        "source": "T07n0220_510:0603a08_22"
    },
    {
        "source_sentence": "有瞋心、離瞋心，有癡心、離癡心。",
        "translation": "There's anger and freedom from anger, and there's delusion and freedom from delusion.",
        "source": "T07n0220_510:0603a10_23"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0603a11_24"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類有貪、瞋、癡心非有貪、瞋、癡心，",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones rely on the profound prajñāpāramitā to truly know that all sentient beings have craving, anger, and delusion but not those who have craving, anger, and delusion.",
        "source": "T07n0220_510:0603a11_25"
    },
    {
        "source_sentence": "非離貪、瞋、癡心。",
        "translation": "They aren't free of the minds of craving, anger, and delusion.",
        "source": "T07n0220_510:0603a13_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_510:0603a13_27"
    },
    {
        "source_sentence": "如是二心不和合故。",
        "translation": "It's because these two minds aren't in harmony.",
        "source": "T07n0220_510:0603a14_0"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類離貪、瞋、癡心，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know that all sentient beings are free of craving, anger, and delusion.",
        "source": "T07n0220_510:0603a14_1"
    },
    {
        "source_sentence": "非離貪、瞋、癡心，非有貪、瞋、癡心。",
        "translation": "They aren't free of the minds of craving, anger, and delusion, and they don't have the minds of craving, anger, and delusion.",
        "source": "T07n0220_510:0603a16_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_510:0603a16_3"
    },
    {
        "source_sentence": "如是二心不和合故。",
        "translation": "It's because these two minds aren't in harmony.",
        "source": "T07n0220_510:0603a17_4"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類有貪心、離貪心，",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know that all sentient beings have craving and are free of craving.",
        "source": "T07n0220_510:0603a17_5"
    },
    {
        "source_sentence": "有瞋心、離瞋心，有癡心、離癡心。",
        "translation": "There's anger and freedom from anger, and there's delusion and freedom from delusion.",
        "source": "T07n0220_510:0603a19_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0603a20_0"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有廣心。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the vast minds of those sentient beings.",
        "source": "T07n0220_510:0603a20_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0603a21_2"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有廣心？」",
        "translation": "How do the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the vast minds of those sentient beings?",
        "source": "T07n0220_510:0603a22_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0603a23_1"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有廣心，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the vast minds of those sentient beings.",
        "source": "T07n0220_510:0603a23_2"
    },
    {
        "source_sentence": "非廣非狹、非增非減、非去非來。",
        "translation": "It's neither wide nor narrow, neither increasing nor decreasing, and neither going nor coming.",
        "source": "T07n0220_510:0603a25_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0603a26_4"
    },
    {
        "source_sentence": "心之自性畢竟離故，都無所有竟不可得，誰廣、誰狹？",
        "translation": "Because the mind's self-nature is ultimately free, it has no existence and is ultimately unobtainable, so who is broad and who is narrow?",
        "source": "T07n0220_510:0603a26_5"
    },
    {
        "source_sentence": "誰增、誰減？",
        "translation": "Who increases and who decreases?",
        "source": "T07n0220_510:0603a27_6"
    },
    {
        "source_sentence": "誰去、誰來？",
        "translation": "Who will go and who will come?",
        "source": "T07n0220_510:0603a27_7"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有廣心。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the vast minds of those sentient beings.",
        "source": "T07n0220_510:0603a27_8"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0603a29_9"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有大心。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the great minds of those sentient beings.",
        "source": "T07n0220_510:0603a29_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0603b02_11"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有大心？」",
        "translation": "How does the Tathāgata, Arhat, and Completely Awakened One truly know the great minds of those sentient beings who rely on the profound prajñāpāramitā?",
        "source": "T07n0220_510:0603b02_12"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0603b04_13"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有大心，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the great minds of all sentient beings.",
        "source": "T07n0220_510:0603b04_14"
    },
    {
        "source_sentence": "非大非小、非去非來、非生非滅、非住非異、非染非淨。",
        "translation": "It's neither large nor small, neither going nor coming, neither arising nor ceasing, neither abiding nor dissimilar, and neither defiled nor pure.",
        "source": "T07n0220_510:0603b06_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0603b07_1"
    },
    {
        "source_sentence": "心之自性畢竟離故，都無所有竟不可得，誰大、誰小？",
        "translation": "Because the self-nature of mind is ultimately free, it has no existence and can't be obtained, so who is large and who is small?",
        "source": "T07n0220_510:0603b07_2"
    },
    {
        "source_sentence": "誰去、誰來？",
        "translation": "Who will go and who will come?",
        "source": "T07n0220_510:0603b08_3"
    },
    {
        "source_sentence": "誰生、誰滅？",
        "translation": "Who arises and who ceases?",
        "source": "T07n0220_510:0603b08_4"
    },
    {
        "source_sentence": "誰住、誰異？",
        "translation": "Who abides and who differs?",
        "source": "T07n0220_510:0603b09_5"
    },
    {
        "source_sentence": "誰染、誰淨？",
        "translation": "Who is defiled and who is pure?",
        "source": "T07n0220_510:0603b09_6"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有大心。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the great minds of those sentient beings.",
        "source": "T07n0220_510:0603b09_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0603b11_8"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無量心。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the measureless minds of those sentient beings.",
        "source": "T07n0220_510:0603b11_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0603b13_10"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無量心？」",
        "translation": "How do the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the measureless minds of those sentient beings?",
        "source": "T07n0220_510:0603b13_11"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0603b14_12"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無量心，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the measureless minds of all sentient beings.",
        "source": "T07n0220_510:0603b15_13"
    },
    {
        "source_sentence": "非有量非無量、非住非不住、非去非不去。",
        "translation": "It's neither finite nor infinite, neither abiding nor non-abiding, and neither going nor not going.",
        "source": "T07n0220_510:0603b16_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0603b17_15"
    },
    {
        "source_sentence": "心之自性畢竟離故無漏無依，如何可說有量無量、有住不住、有去不去？",
        "translation": "Because the self-nature of mind is ultimately free, it's uncontaminated and has no basis, so how can we say that it's measured and immeasurable, abiding and not abiding, and going and not going?",
        "source": "T07n0220_510:0603b17_16"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無量心。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the measureless minds of those sentient beings.",
        "source": "T07n0220_510:0603b19_17"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0603b21_18"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無見、無對心。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know that all sentient beings have views and no opposing thoughts.",
        "source": "T07n0220_510:0603b21_19"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0603b23_20"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無見、無對心？」",
        "translation": "How do the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know that all those sentient beings have views and no opposing thoughts?",
        "source": "T07n0220_510:0603b23_21"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0603b25_22"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無見、無對心皆無心相。",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones rely on the profound prajñāpāramitā to truly know that all sentient beings who have no views and no opposing thoughts have no mental characteristics.",
        "source": "T07n0220_510:0603b25_23"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0603b27_24"
    },
    {
        "source_sentence": "以一切心自相空故。",
        "translation": "It's because all minds are empty of their own characteristics.",
        "source": "T07n0220_510:0603b27_25"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無見、無對心。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know that all those sentient beings have views and no opposing thoughts.",
        "source": "T07n0220_510:0603b28_26"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0603c01_0"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無色不可見心。」",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the formless and invisible minds of those sentient beings.",
        "source": "T07n0220_510:0603c01_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0603c03_2"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無色不可見心？」",
        "translation": "How do the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the formless and invisible minds of those sentient beings?",
        "source": "T07n0220_510:0603c03_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0603c05_4"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無色不可見心諸佛五眼皆不能見。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know that all those sentient beings have formlessness that's invisible to the five eyes of the buddhas and minds that can't see it.",
        "source": "T07n0220_510:0603c05_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0603c07_6"
    },
    {
        "source_sentence": "以一切心自性空故。",
        "translation": "It's because all minds are empty of their own nature.",
        "source": "T07n0220_510:0603c07_7"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類所有無色不可見心。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the formless and invisible minds of those sentient beings.",
        "source": "T07n0220_510:0603c08_8"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0603c10_9"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類心、心所法，",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know the minds and mental factors of those sentient beings.",
        "source": "T07n0220_510:0603c10_10"
    },
    {
        "source_sentence": "若出若沒、若屈若申。」",
        "translation": "Whether it comes out or doesn't, or whether it bends or says.",
        "source": "T07n0220_510:0603c12_11"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0603c12_12"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類心、心所法，",
        "translation": "How do the Tathāgatas, Arhats, and Fully Awakened Ones rely on the profound prajñāpāramitā to truly know the minds and mental factors of those sentient beings?",
        "source": "T07n0220_510:0603c12_13"
    },
    {
        "source_sentence": "若出若沒、若屈若申？」",
        "translation": "What's produced, what's lost, and what's flexed and what's expressed?",
        "source": "T07n0220_510:0603c14_14"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0603c14_15"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類出沒屈申心、心所法，",
        "translation": "All the Tathāgatas, Arhats, and Fully Awakened Ones rely on the profound prajñāpāramitā to truly know the minds and mental factors of those sentient beings as they emerge and disappear.",
        "source": "T07n0220_510:0603c14_16"
    },
    {
        "source_sentence": "皆依色、受、想、行、識生。",
        "translation": "They all arise based on form, sensation, perception, volition, and consciousness.",
        "source": "T07n0220_510:0603c16_17"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類心、心所法，",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the minds and mental factors of those sentient beings.",
        "source": "T07n0220_510:0603c17_18"
    },
    {
        "source_sentence": "若出若沒、若屈若申，謂諸如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類出沒屈申心、心所法，",
        "translation": "The profound prajñāpāramitā on which the Tathāgatas, Arhats, and Fully Awakened Ones rely is that they truly know the minds and mental factors of those sentient beings who are free from self-discipline and subject to self-discipline.",
        "source": "T07n0220_510:0603c18_19"
    },
    {
        "source_sentence": "依色乃至識執我及世間或常或無常、或亦常亦無常、或非常非無常，此是諦實餘皆愚妄；",
        "translation": "Relying on form up to consciousness, one clings that the self and the world are either permanent or impermanent, or both permanent and impermanent, or neither eternal nor impermanent. This alone is true of the truth; the rest is false.",
        "source": "T07n0220_510:0603c21_20"
    },
    {
        "source_sentence": "依色乃至識執我及世間或有邊或無邊、或亦有邊亦無邊、或非有邊非無邊，",
        "translation": "Depending on form up to consciousness, they may believe that the self and the world are either finite or infinite, or both finite and infinite, or neither finite nor infinite.",
        "source": "T07n0220_510:0603c23_21"
    },
    {
        "source_sentence": "此是諦實餘皆愚妄；",
        "translation": "This alone is true while the rest is false.",
        "source": "T07n0220_510:0603c24_22"
    },
    {
        "source_sentence": "依色乃至識執如來死後或有或非有、或亦有亦非有、或非有非非有，此是諦實餘皆愚妄；",
        "translation": "Relying on matter up to consciousness, they believe that after death the Tathågata either exists or does not exist, or neither exists nor does not exist, or neither exists nor does not exist.",
        "source": "T07n0220_510:0603c25_23"
    },
    {
        "source_sentence": "依色乃至識執命者或即身或異身，此是諦實餘皆愚妄。",
        "translation": "Depending on form up to consciousness, those who cling to life either as body or different body. These are the truths and the rest are all deluded.",
        "source": "T07n0220_510:0603c27_24"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知彼諸有情類心、心所法，",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know the minds and mental factors of those sentient beings.",
        "source": "T07n0220_510:0603c28_25"
    },
    {
        "source_sentence": "若出若沒、若屈若申。",
        "translation": "Whether it comes out or doesn't, or whether it bends or says anything.",
        "source": "T07n0220_510:0604a01_26"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0604a01_27"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知色、受、想、行、識。」",
        "translation": "All tathāgatas, arhats, and fully awakened ones rely on the profound prajñāpāramitā to truly know form, sensation, perception, perception, volition, and consciousness.",
        "source": "T07n0220_510:0604a02_28"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0604a03_29"
    },
    {
        "source_sentence": "云何如來、應、正等覺依深般若波羅蜜多，如實知色、受、想、行、識？」",
        "translation": "How does the Tathāgata, Arhat, and Completely Awakened One truly know form, sensation, perception, perception, volition, and consciousness based on the profound prajñāpāramitā?",
        "source": "T07n0220_510:0604a03_30"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0604a05_0"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，如實知色、受、想、行、識皆如真如無變異、無分別、無相狀、無驚覺、無戲論、無所得。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to truly know that form, sensation, perception, perception, volition, and consciousness are all as they really are without change, without distinction, without marks, without signs, without fear, without conceptual elaborations, without attainment.",
        "source": "T07n0220_510:0604a05_1"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，如實知色、受、想、行、識，",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly know form, sensation, perception, volition, and consciousness.",
        "source": "T07n0220_510:0604a07_2"
    },
    {
        "source_sentence": "亦如實知諸有情類出沒屈申心、心所法皆如真如無變異、無分別、無相狀、無驚覺、無戲論、無所得。",
        "translation": "They also truly know that all types of sentient beings' minds and mental factors are as they really are without change, without distinction, without marks, without signs, without fear, without conceptualization, without perception, without elaboration, and without attainment.",
        "source": "T07n0220_510:0604a09_3"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0604a11_4"
    },
    {
        "source_sentence": "諸有情類出沒屈申心、心所法真如即五蘊真如，五蘊真如即十二處真如，",
        "translation": "The true nature of the mind and mental factors that all sentient beings produce and flex their minds are the true nature of the five aggregates, and the true nature of the five aggregates is the true nature of the twelve places.",
        "source": "T07n0220_510:0604a11_5"
    },
    {
        "source_sentence": "十二處真如即十八界真如，十八界真如即一切法真如，一切法真如即六波羅蜜多真如，",
        "translation": "The twelve-fielded true thusness is the true thusness of the eighteen elements, the true thusness of the eighteen elements is the true thusness of all dharmas, and the true thusness of all dharmas is the true thusness of the six perfections.",
        "source": "T07n0220_510:0604a13_6"
    },
    {
        "source_sentence": "六波羅蜜多真如即三十七菩提分法真如，三十七菩提分法真如即十六空真如，",
        "translation": "The true nature of the six perfections is the true nature of the thirty-seven factors of enlightenment, and the true nature of the thirty-seven factors of enlightenment is the true nature of the sixteen aspects of emptiness.",
        "source": "T07n0220_510:0604a15_7"
    },
    {
        "source_sentence": "十六空真如即八解脫真如，八解脫真如即九次第定真如，九次第定真如即三解脫門真如，",
        "translation": "The sixteen truths of emptiness are the true nature of the eight liberations; the true nature of liberation is the true nature of the nine graduated concentrations; the true nature of the nine graduated concentrations is the true nature of the three gates of liberation.",
        "source": "T07n0220_510:0604a17_8"
    },
    {
        "source_sentence": "三解脫門真如即如來十力真如，如來十力真如即四無所畏真如，四無所畏真如即四無礙解真如，",
        "translation": "The three gates of liberation are the ten powers of the Buddha. The ten powers of the Buddha are the four fearlessnesses. The four fearlessnesses are the four unhindered understandings.",
        "source": "T07n0220_510:0604a19_9"
    },
    {
        "source_sentence": "四無礙解真如即大慈、大悲、大喜、大捨真如，大慈、大悲、大喜、大捨真如即十八佛不共法真如，",
        "translation": "The four unhindered understandings are great kindness, great compassion, great pity, great joy, great equanimity, and great relinquishment. Great kindness, great compassion, great pity, great joy, great relinquishment—these are the eighteen unique qualities of buddhahood.",
        "source": "T07n0220_510:0604a21_10"
    },
    {
        "source_sentence": "十八佛不共法真如即一切智真如，一切智真如即道相智真如，道相智真如即一切相智真如，",
        "translation": "The true nature of the eighteen unique qualities of buddhas is the true nature of omniscience, the true nature of omniscience is the true nature of knowledge of the path, and the true nature of knowledge of the path is the true nature of knowledge of all characteristics.",
        "source": "T07n0220_510:0604a23_11"
    },
    {
        "source_sentence": "一切相智真如即善、不善、無記法真如，善、不善、無記法真如即世間、出世間法真如，",
        "translation": "The true nature of omniscience is the true nature of good, bad, and neutral dharmas; the true nature of good, bad, and neutral dharmas is the true nature of worldly and transmundane dharmas.",
        "source": "T07n0220_510:0604a26_0"
    },
    {
        "source_sentence": "世間、出世間法真如即有漏、無漏法真如，有漏、無漏法真如即有罪、無罪法真如，",
        "translation": "The true nature of mundane and transmundane dharmas is the true nature of contaminated and uncontaminated dharmas, and the true nature of contaminated and uncontaminated dharmas is the true nature of sinful and sinless dharmas.",
        "source": "T07n0220_510:0604a27_1"
    },
    {
        "source_sentence": "有罪、無罪法真如即雜染、清淨法真如，雜染、清淨法真如即有為、無為法真如，",
        "translation": "The true nature of sinful and sinless dharmas is the true nature of defiled and pure dharmas, and the true nature of defiled and pure dharmas is the true nature of conditioned and unconditioned dharmas.",
        "source": "T07n0220_510:0604a29_2"
    },
    {
        "source_sentence": "有為、無為法真如即三世真如，三世真如即三界真如，三界真如即預流、一來、不還、阿羅漢果真如，",
        "translation": "The true nature of conditioned and unconditioned dharmas is the true nature of the three times, the true nature of the three times is the true nature of the three realms, and the true nature of the three realms is the true nature of stream-entry, once-returning, non-returning, and arhatship.",
        "source": "T07n0220_510:0604b02_3"
    },
    {
        "source_sentence": "預流、一來、不還、阿羅漢果真如即獨覺菩提真如，獨覺菩提真如即一切菩薩摩訶薩行真如，",
        "translation": "The true thusness of stream-entry, the once-returner, the nonreturner, and the fruit of arhatship is the true thusness of self-realized enlightenment, and the true thusness of self-realized enlightenment is the true thusness of all bodhisattva-mahāsattva practices.",
        "source": "T07n0220_510:0604b04_4"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行真如即諸佛無上正等菩提真如，諸佛無上正等菩提真如即一切如來、應、正等覺真如，",
        "translation": "The practice of all bodhisattvas and mahāsattvas is the unexcelled true enlightenment of all buddhas, and the unexcelled true enlightenment of all buddhas is the true enlightenment of all buddhas.",
        "source": "T07n0220_510:0604b06_5"
    },
    {
        "source_sentence": "一切如來、應、正等覺真如即一切有情真如。",
        "translation": "The true nature of all tathāgatas, arhats, and fully awakened ones is the true nature of all sentient beings.",
        "source": "T07n0220_510:0604b09_6"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0604b10_7"
    },
    {
        "source_sentence": "若一切如來、應、正等覺真如，若一切有情真如，若一切法真如，皆不相離。",
        "translation": "If all tathāgatas, arhats, and fully enlightened ones are truly true, if all sentient beings are truly, and if all dharmas are truly, they aren't separate from each other.",
        "source": "T07n0220_510:0604b10_8"
    },
    {
        "source_sentence": "不相離故，無盡、無二，不可分別。",
        "translation": "Because they aren't separate from each other, they are inexhaustible and nondual, and they can't be discriminated.",
        "source": "T07n0220_510:0604b12_9"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0604b12_10"
    },
    {
        "source_sentence": "一切如來、應、正等覺依深般若波羅蜜多，證一切法真如究竟，乃得無上正等菩提。",
        "translation": "All tathāgatas, arhats, and fully enlightened ones rely on the profound prajñāpāramitā to realize the ultimate reality of all dharmas and then attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_510:0604b13_0"
    },
    {
        "source_sentence": "由此故說甚深般若波羅蜜多能生諸佛，是諸佛母，能示諸佛世間實相。",
        "translation": "Because of this, it's said that the profound prajñāpāramitā can give birth to buddhas, which are the mothers of buddhas and can show the true characteristics of the buddhas in the world.",
        "source": "T07n0220_510:0604b14_1"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0604b16_2"
    },
    {
        "source_sentence": "如是如來、應、正等覺依深般若波羅蜜多，能如實覺諸法真如不虛妄性、不變異性。",
        "translation": "Thus, the Tathāgata, Arhat, and Completely Awakened One rely on the profound prajñāpāramitā to truly perceive the true nature of dharmas as they are without falsehood or change.",
        "source": "T07n0220_510:0604b16_3"
    },
    {
        "source_sentence": "由如實覺真如相故，說名如來、應、正等覺。」",
        "translation": "Because they truly perceive the true characteristics of reality, they're called the Tathāgata, Arhat, and Completely Awakened One.",
        "source": "T07n0220_510:0604b18_4"
    },
    {
        "source_sentence": "具壽善現即白佛言：「甚深般若波羅蜜多所證諸法真如實相，極為甚深難見難覺，",
        "translation": "Guoshou Shancheng then said to the Buddha, The true and real characteristics of all the teachings realized in the profound prajñāpāramitā are extremely profound and difficult to see and difficult to awaken.",
        "source": "T07n0220_510:0604b19_5"
    },
    {
        "source_sentence": "一切如來、應、正等覺皆用諸法真如實相，顯示分別諸佛無上正等菩提。",
        "translation": "All tathāgatas, arhats, and perfectly enlightened ones use the true characteristics of all dharmas to reveal the unsurpassed perfect enlightenment of the buddhas that discriminate them.",
        "source": "T07n0220_510:0604b21_6"
    },
    {
        "source_sentence": "如是真如甚深甚妙誰能信解？",
        "translation": "Who can believe and understand such a truly profound and marvelous reality?",
        "source": "T07n0220_510:0604b23_7"
    },
    {
        "source_sentence": "唯有不退位菩薩摩訶薩，及具正見漏盡阿羅漢，聞佛說此甚深真如能生信解，",
        "translation": "“Only enlightening beings in the stage of nonregression, as well as arhats who are completely free from all contaminants and fully awakened to right view, can give rise to faith when they hear the Buddha teach this profound truth.",
        "source": "T07n0220_510:0604b23_8"
    },
    {
        "source_sentence": "如來為彼依自所證真如之相顯示分別。」",
        "translation": "The Tathāgata shows distinctions for them based on the characteristics of the true nature that they've realized.",
        "source": "T07n0220_510:0604b25_9"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_510:0604b26_10"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_510:0604b26_11"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_510:0604b27_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0604b27_13"
    },
    {
        "source_sentence": "真如無盡是故甚深，唯有如來現等正覺無盡真如。」",
        "translation": "Because the true thusness is inexhaustible, it's profound, and only the Tathāgata appears to be perfectly enlightened as an inexhaustible true thusness.",
        "source": "T07n0220_510:0604b27_14"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0604b28_15"
    },
    {
        "source_sentence": "佛由誰證無盡真如？」",
        "translation": "Where did the Buddha come from to realize the inexhaustible truth?",
        "source": "T07n0220_510:0604b28_16"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0604b29_17"
    },
    {
        "source_sentence": "佛由真如能證如是無盡真如。」",
        "translation": "Because of their true nature, the Buddha can realize such an inexhaustible true nature.",
        "source": "T07n0220_510:0604b29_18"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0604c01_19"
    },
    {
        "source_sentence": "如來證誰無盡真如？」",
        "translation": "Who does the Tathāgata realize the inexhaustible truth?",
        "source": "T07n0220_510:0604c01_20"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0604c01_21"
    },
    {
        "source_sentence": "證一切法無盡真如。」",
        "translation": "He realizes that all dharmas are inexhaustible true reality.",
        "source": "T07n0220_510:0604c01_22"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0604c02_23"
    },
    {
        "source_sentence": "諸法真如何故無盡？」",
        "translation": "How are the dharmas really inexhaustible?",
        "source": "T07n0220_510:0604c02_24"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_510:0604c02_25"
    },
    {
        "source_sentence": "以一切法皆無盡故，一切如來、應、正等覺證得一切法無盡真如故，獲得無上正等菩提，",
        "translation": "Because all things are inexhaustible, all buddhas and enlightening beings attain supreme perfect enlightenment because they realize the inexhaustible reality of all things.",
        "source": "T07n0220_510:0604c03_0"
    },
    {
        "source_sentence": "為諸有情顯示分別一切法真如相，由此故名如實說者。」",
        "translation": "For the sake of sentient beings, he shows the true characteristics of all dharmas and therefore is called someone who explains them as they really are.",
        "source": "T07n0220_510:0604c05_0"
    },
    {
        "source_sentence": "爾時，三千大千世界所有欲界、色界天子，各以種種天妙花香，遙散世尊而為供養，",
        "translation": "At that time all the celestial beings of the realm of desire and those of the realm of form in the great manifold cosmos offered various heavenly flower fragrances to the World-honored One, scattering them from a distance.",
        "source": "T07n0220_510:0604c07_0"
    },
    {
        "source_sentence": "來詣佛所頂禮佛足，却住一面俱白佛言：「如來所說甚深般若波羅蜜多以何為相？」",
        "translation": "They came to the Buddha, bowed their heads at his feet, stood to one side, and said to him, What's the characteristic of the profound prajñāpāramitā taught by the Tathāgata?",
        "source": "T07n0220_510:0604c08_1"
    },
    {
        "source_sentence": "爾時，佛告諸天子言：「天子當知！",
        "translation": "It was then that the Buddha addressed the celestial sons, saying, Celestial sons, you should know!",
        "source": "T07n0220_510:0604c10_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多以空、無相、無願為相，甚深般若波羅蜜多以無造作、無生無滅、無染無淨、無性無相、非斷非常、非一非異、無來無去、虛空為相，",
        "translation": "The profound prajñāpāramitā has emptiness, signlessness, and wishlessness as its characteristics, and the profound prajñāpāramitā has neither creation nor non-creation, neither arising nor ceasing, neither defilement nor purity, no nature nor signlessness, neither cessation nor impermanence, neither one",
        "source": "T07n0220_510:0604c11_3"
    },
    {
        "source_sentence": "甚深般若波羅蜜多有如是等無量諸相。",
        "translation": "The profound prajñāpāramitā has these and other measureless forms.",
        "source": "T07n0220_510:0604c14_4"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0604c15_5"
    },
    {
        "source_sentence": "如是諸相，一切如來、應、正等覺依世俗說，不依勝義。",
        "translation": "All tathāgatas, arhats, and fully awakened ones rely on worldly explanations and not on ultimate truth.",
        "source": "T07n0220_510:0604c15_6"
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0604c17_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多如是諸相，世間天、人、阿素洛等皆不能壞。",
        "translation": "Such are the characteristics of the profound prajñāpāramitā, which can't be destroyed by worldly gods, humans, or asuras.",
        "source": "T07n0220_510:0604c17_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_510:0604c18_2"
    },
    {
        "source_sentence": "世間天、人、阿素洛等亦是相故。",
        "translation": "The worldly gods, humans, asuras, and so forth are also characteristics.",
        "source": "T07n0220_510:0604c18_3"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0604c19_4"
    },
    {
        "source_sentence": "諸相不能破壞諸相，諸相不能了知諸相，諸相不能破壞無相，諸相不能了知無相，",
        "translation": "The marks can’t destroy marks, the marks can’t know marks, the marks can’t destroy signlessness, and the marks can’t know signlessness.",
        "source": "T07n0220_510:0604c19_5"
    },
    {
        "source_sentence": "無相不能破壞諸相，無相不能了知諸相，無相不能破壞無相，無相不能了知無相。",
        "translation": "signlessness can't destroy signlessness, signlessness can't perceive signlessness, signlessness can't destroy signlessness, signlessness can't perceive signlessness.",
        "source": "T07n0220_510:0604c21_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_510:0604c23_7"
    },
    {
        "source_sentence": "若相、若無相、若相無相皆無所有，能破、能知、所破、所知、破者、知者皆不可得故。",
        "translation": "If marks, marklessness, marklessness, and marklessness all lack existence, what can be broken, what can be known, what's broken, what's known, what's broken, and what's known are all unobtainable.",
        "source": "T07n0220_510:0604c23_8"
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0604c25_9"
    },
    {
        "source_sentence": "如是諸相，非色所作，非受、想、行、識所作，廣說乃至非一切智所作，",
        "translation": "All these characteristics are not made by matter; they are not made by sensation, by perception, by volition, or by consciousness.",
        "source": "T07n0220_510:0604c25_10"
    },
    {
        "source_sentence": "非道相智、一切相智所作。",
        "translation": "It's not created by the knowledge of the path and the knowledge of all characteristics.",
        "source": "T07n0220_510:0604c27_11"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0604c27_12"
    },
    {
        "source_sentence": "如是諸相非天所作、非非天所作、非人所作、非非人所作、非有漏、非無漏、非世間、非出世間、非有為、非無為，",
        "translation": "They are not created by gods, they are not created by gods, they are not created by humans, they are not created by humans, they are not created by humans, they are not contaminated, they are not pure, they are not mundane, they are not transmundane, they are not conditioned or unconditioned.",
        "source": "T07n0220_510:0604c27_13"
    },
    {
        "source_sentence": "無所繫屬不可宣說。",
        "translation": "Nothing is bound to them, and they can't be explained.",
        "source": "T07n0220_510:0605a01_14"
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0605a01_15"
    },
    {
        "source_sentence": "甚深般若波羅蜜多遠離眾相，不應問言甚深般若波羅蜜多以何為相。",
        "translation": "The profound prajñāpāramitā is far removed from all marks, so you shouldn't ask what the profound prajñāpāramitā has as its mark.",
        "source": "T07n0220_510:0605a02_16"
    },
    {
        "source_sentence": "汝諸天子！",
        "translation": "You celestial beings!",
        "source": "T07n0220_510:0605a03_17"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_510:0605a03_18"
    },
    {
        "source_sentence": "設有問言虛空何相，如是發問為正問不？」",
        "translation": "Suppose someone asks, What's the characteristic of space, and this is the right question to ask?",
        "source": "T07n0220_510:0605a04_19"
    },
    {
        "source_sentence": "諸天子曰：「不也！",
        "translation": "The celestial beings said, No!",
        "source": "T07n0220_510:0605a05_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0605a05_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_510:0605a05_22"
    },
    {
        "source_sentence": "虛空無體、無相、無為，不應問故。」",
        "translation": "Space has no essence, no marks, and nothingness, so you shouldn't ask questions.",
        "source": "T07n0220_510:0605a05_23"
    },
    {
        "source_sentence": "佛告天子：「甚深般若波羅蜜多亦復如是，不應為問。",
        "translation": "The Buddha told the celestial being, So is the profound prajñāpāramitā, which shouldn't be asked.",
        "source": "T07n0220_510:0605a06_24"
    },
    {
        "source_sentence": "然諸法相有佛無佛，法界法爾，佛於此相如實覺知，故名如來、應、正等覺。」",
        "translation": "However, the characteristics of dharmas have buddhas and no buddhas, and the Dharma realm is thus; the buddhas truly perceive these characteristics, so they're called the Tathāgata, Arhat, and Completely Awakened One.",
        "source": "T07n0220_510:0605a07_25"
    },
    {
        "source_sentence": "時，諸天子復白佛言：「如來所覺如是諸相，極為甚深，難見難覺。",
        "translation": "The celestial beings then again said to the Buddha, Such are the characteristics that the Tathāgata perceives, which are so profound and difficult to see and difficult to perceive.",
        "source": "T07n0220_510:0605a09_26"
    },
    {
        "source_sentence": "如來現覺如是相故，於一切法無礙智轉。",
        "translation": "Because the Tathāgata now perceives such characteristics, he develops unhindered knowledge of all dharmas.",
        "source": "T07n0220_510:0605a10_27"
    },
    {
        "source_sentence": "一切如來、應、正等覺住如是相，分別開示甚深般若波羅蜜多，為諸有情集諸法相，",
        "translation": "All tathāgatas, arhats, and fully awakened ones who abide in such characteristics analyze and reveal the profound prajñāpāramitā to gather the characteristics of all dharmas for sentient beings.",
        "source": "T07n0220_510:0605a11_28"
    },
    {
        "source_sentence": "方便開示，令於般若波羅蜜多得無礙智。",
        "translation": "He skillfully reveals and causes them to attain unhindered knowledge of the perfection of wisdom.",
        "source": "T07n0220_510:0605a13_29"
    },
    {
        "source_sentence": "「希有！",
        "translation": "Rarely!",
        "source": "T07n0220_510:0605a14_30"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_510:0605a14_31"
    },
    {
        "source_sentence": "甚深般若波羅蜜多是諸如來、應、正等覺常所行處。",
        "translation": "The profound prajñāpāramitā is the place where the Tathāgatas, Arhats, and Completely Enlightened Ones always practice.",
        "source": "T07n0220_510:0605a14_32"
    },
    {
        "source_sentence": "一切如來、應、正等覺行是處故，證得無上正等菩提，為諸有情分別開示一切法相，",
        "translation": "Because all buddhas and enlightening beings attain unexcelled perfect enlightenment in this way, revealing the characteristics of all things to sentient beings.",
        "source": "T07n0220_510:0605a15_33"
    },
    {
        "source_sentence": "所謂分別開示色相，分別開示受、想、行、識相，廣說乃至分別開示一切智相，",
        "translation": "The so-called differentiating and revealing the characteristics of form, differentiating and revealing the characteristics of feeling, perception, volition, and consciousness, explaining in detail up to differentiating and revealing the characteristics of omniscience.",
        "source": "T07n0220_510:0605a17_34"
    },
    {
        "source_sentence": "分別開示道相智、一切相智相。」",
        "translation": "He discerns and reveals the cognition of the path and the cognition of all characteristics.",
        "source": "T07n0220_510:0605a19_35"
    },
    {
        "source_sentence": "爾時，佛告諸天子言：「如是！",
        "translation": "It was then that the Buddha addressed the celestial beings, saying, So it is!",
        "source": "T07n0220_510:0605a20_36"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_510:0605a20_37"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_510:0605a20_38"
    },
    {
        "source_sentence": "天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0605a21_39"
    },
    {
        "source_sentence": "一切法相如來如實覺為無相，所謂：變礙是色相，領納是受相，取像是想相，",
        "translation": "All the characteristics of all things are as they really are to be apprehended by the Buddha. The so-called form is that which obstructs, feeling is that which receives, and grasping is that which perceives.",
        "source": "T07n0220_510:0605a21_40"
    },
    {
        "source_sentence": "造作是行相，了別是識相，如來如實覺為無相。",
        "translation": "What's created is the characteristic of volition, discernment is the characteristic of consciousness, and the Tathāgata truly perceives it as formless.",
        "source": "T07n0220_510:0605a23_0"
    },
    {
        "source_sentence": "苦惱聚是蘊相，生長門是處相，多毒害是界相，如來如實覺為無相。",
        "translation": "The mass of suffering and the mass of anguish are the characteristics of the aggregates, the aspect of growth is the characteristic of the sense-fields, much poisonousness is the characteristic of the elements, and the Tathāgata's true awakening is the characteristic of formlessness.",
        "source": "T07n0220_510:0605a24_1"
    },
    {
        "source_sentence": "能惠捨是布施相，無熱惱是淨戒相，不忿恚是安忍相，不可伏是精進相，",
        "translation": "Being able to give generously is the characteristic of giving, being without fever is the characteristic of pure morality, being without anger or repugnance is the characteristic of patience, and being unable to overcome it is the characteristic of effort.",
        "source": "T07n0220_510:0605a25_2"
    },
    {
        "source_sentence": "無散亂是靜慮相，無執著是般若相，如來如實覺為無相。",
        "translation": "The absence of distraction is the characteristic of meditation, the absence of attachment is the characteristic of prajñā, and the Tathāgata's true awakening is signlessness.",
        "source": "T07n0220_510:0605a27_3"
    },
    {
        "source_sentence": "無所有是內空等相，不顛倒是真如等相，不虛妄是四聖諦相，如來如實覺為無相。",
        "translation": "The absence of existence is the characteristic of internal emptiness and so forth, what's not mistaken is the characteristic of true thusness and so forth, what's not false is the characteristic of the four noble truths, and the Tathāgata truly perceives it as signless.",
        "source": "T07n0220_510:0605a28_4"
    },
    {
        "source_sentence": "無擾惱是四靜慮相，無限礙是四無量相，無喧雜是四無色定相，如來如實覺為無相。",
        "translation": "The absence of disturbance is the characteristic of the four forms of meditative absorption. The absence of unlimited obstruction is the characteristic of the four immeasurables. The absence of confusion is the characteristic of the four immaterial meditative states of absorption. The true awakening of a tathagata is the signlessness.",
        "source": "T07n0220_510:0605b01_5"
    },
    {
        "source_sentence": "無繫縛是八解脫相，不散亂是九次第定相，能出離是三十七菩提分法相，",
        "translation": "\\",
        "source": "T07n0220_510:0605b03_6"
    },
    {
        "source_sentence": "如來如實覺為無相。",
        "translation": "The Tathāgata's true awakening is formlessness.",
        "source": "T07n0220_510:0605b05_7"
    },
    {
        "source_sentence": "能遠離是空解脫門相，無取著是無相解脫門相，厭眾苦是無願解脫門相，",
        "translation": "Being able to be far removed is the aspect of liberation through emptiness, nonattachment is the aspect of liberation through signlessness, and being disgusted with suffering is the aspect of liberation through wishlessness.",
        "source": "T07n0220_510:0605b05_8"
    },
    {
        "source_sentence": "如來如實覺為無相。",
        "translation": "The Tathāgata's true awakening is formlessness.",
        "source": "T07n0220_510:0605b07_9"
    },
    {
        "source_sentence": "攝淨位是三乘十地相，趣大覺是菩薩十地相，如來如實覺為無相。",
        "translation": "The stage of gathering in purity is the characteristic of the ten stages of the three vehicles, the path to great awakening is the characteristic of the bodhisattva's ten stages, and the Tathāgata's true awakening is markless.",
        "source": "T07n0220_510:0605b07_10"
    },
    {
        "source_sentence": "能觀照是五眼相，無滯礙是六神通相，如來如實覺為無相。",
        "translation": "Being able to contemplate and illuminate is the characteristic of the five eyes, nonobstruction is the characteristic of the six supernormal powers, and the Tathāgata truly perceives as signless.",
        "source": "T07n0220_510:0605b09_11"
    },
    {
        "source_sentence": "難屈伏是如來十力相，無怯懼是四無所畏相，無斷絕是四無礙解相，與利樂是大慈相，",
        "translation": "These are the characteristics of the ten powers of the Buddha. The absence of fearlessness, these are the characteristics of the four forms of fearlessness. The absence of being cut off is the characteristic of the four forms of unhindered understanding.",
        "source": "T07n0220_510:0605b10_12"
    },
    {
        "source_sentence": "拔衰苦是大悲相，慶善事是大喜相，棄喧雜是大捨相，不可奪是十八佛不共法相，",
        "translation": "Uprooting suffering of decay and suffering is the characteristic of great compassion; performing good deeds is the characteristic of great joy; discarding confusion is the characteristic of great equanimity; nongrasping is the characteristic of the unique qualities of the eighteen Buddhas.",
        "source": "T07n0220_510:0605b12_13"
    },
    {
        "source_sentence": "如來如實覺為無相。",
        "translation": "The Tathāgata's true awakening is formlessness.",
        "source": "T07n0220_510:0605b14_14"
    },
    {
        "source_sentence": "能嚴飾是相好相，能憶念是無忘失法相，無所執是恒住捨性相，如來如實覺為無相。",
        "translation": "Being able to adorn is the mark of goodness, being able to remember is the mark of the Dharma without forgetfulness, having no attachment is the mark of constantly abiding equanimity, and the Tathāgata's true awakening is marklessness.",
        "source": "T07n0220_510:0605b14_15"
    },
    {
        "source_sentence": "遍攝持是一切陀羅尼門相，遍攝受是一切三摩地門相，如來如實覺為無相。",
        "translation": "Pervasively collecting is the aspect of all dhāraṇīs, pervasively collecting is the aspect of all samādhis, and the Tathāgata's true awakening is formlessness.",
        "source": "T07n0220_510:0605b16_16"
    },
    {
        "source_sentence": "善受教是聲聞乘果相，自開悟是獨覺菩提相，趣大果是菩薩摩訶薩行相，",
        "translation": "\\",
        "source": "T07n0220_510:0605b18_17"
    },
    {
        "source_sentence": "具大用是諸佛無上正等菩提相，如來如實覺為無相。",
        "translation": "Being endowed with great function is the mark of unsurpassed perfect enlightenment of the buddhas, and the Tathāgata's true awakening is markless.",
        "source": "T07n0220_510:0605b20_18"
    },
    {
        "source_sentence": "現正等覺是一切智相，極善通達是道相智相，現等別覺是一切相智相，",
        "translation": "Manifesting correct perfect enlightenment is the characteristic of omniscience. Perfect understanding is the characteristic of knowledge regarding the path.",
        "source": "T07n0220_510:0605b21_19"
    },
    {
        "source_sentence": "如來如實覺為無相。",
        "translation": "The Tathāgata's true awakening is formlessness.",
        "source": "T07n0220_510:0605b23_20"
    },
    {
        "source_sentence": "「天子當知！",
        "translation": "You should know, celestial son!",
        "source": "T07n0220_510:0605b23_21"
    },
    {
        "source_sentence": "一切如來、應、正等覺於如是等一切法相，皆能如實覺為無相。",
        "translation": "All tathāgatas, arhats, and perfectly enlightened ones can truly perceive all the characteristics of all dharmas like this as markless.",
        "source": "T07n0220_510:0605b23_22"
    },
    {
        "source_sentence": "由此因緣，我說諸佛得無礙智無與等者。」",
        "translation": "Because of these causes and conditions, I say that the buddhas attain unhindered cognition without equal.",
        "source": "T07n0220_510:0605b25_23"
    },
    {
        "source_sentence": "爾時，佛告具壽善現：「甚深般若波羅蜜多是諸佛母，能示世間諸法實相，",
        "translation": "It was then that the Buddha addressed Kauśinagara and said to him, The profound prajñāpāramitā is the mother of buddhas, able to show the true characteristics of all dharmas in the world.",
        "source": "T07n0220_510:0605b27_0"
    },
    {
        "source_sentence": "是故如來、應、正等覺依法而住，供養恭敬、尊重讚歎、攝受護持所依住法，",
        "translation": "Therefore, the Tathāgatas, Arhats, and Fully Awakened Ones abide by the Dharma. They honor, venerate, revere, praise, receive, and preserve the Dharma on which they rely.",
        "source": "T07n0220_510:0605b28_1"
    },
    {
        "source_sentence": "此法即是甚深般若波羅蜜多。",
        "translation": "This teaching is the profound prajñāpāramitā.",
        "source": "T07n0220_510:0605c01_2"
    },
    {
        "source_sentence": "一切如來、應、正等覺無不依止甚深般若波羅蜜多，供養恭敬、尊重讚歎、攝受護持。",
        "translation": "All tathāgatas, arhats, and perfectly enlightened ones don't rely on the profound prajñāpāramitā to make offerings, honor, venerate, praise, and receive and uphold it.",
        "source": "T07n0220_510:0605c02_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0605c03_1"
    },
    {
        "source_sentence": "甚深般若波羅蜜多能生諸佛，能與諸佛作所依處，能示世間諸法實相。",
        "translation": "The profound prajñāpāramitā can give rise to buddhas, serve as a basis for the buddhas, and show the true characteristics of worldly dharmas.",
        "source": "T07n0220_510:0605c04_2"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0605c05_3"
    },
    {
        "source_sentence": "一切如來、應、正等覺是知恩者、能報恩者，若有問言：『誰是知恩能報恩者？』",
        "translation": "All tathāgatas, arhats, and perfectly enlightened ones are those who know kindness and those who can repay kindness, and if someone asks, 'Who is the one who knows kindness and can repay kindness?'",
        "source": "T07n0220_510:0605c05_4"
    },
    {
        "source_sentence": "應正答言：『佛是知恩能報恩者。』",
        "translation": "You should correctly answer, 'The Buddha is someone who knows kindness and can repay kindness.'",
        "source": "T07n0220_510:0605c07_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_510:0605c08_6"
    },
    {
        "source_sentence": "一切世間知恩報恩無過佛故。」",
        "translation": "It's because all the world knows that kindness and repayment of kindness are no different from those of the Buddha.",
        "source": "T07n0220_510:0605c08_7"
    },
    {
        "source_sentence": "具壽善現即白佛言：「云何如來、應、正等覺知恩報恩？」",
        "translation": "Guoshou Shancheng then said to the Buddha, How does the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One know kindness and repay kindness?",
        "source": "T07n0220_510:0605c09_8"
    },
    {
        "source_sentence": "佛告善現：「一切如來、應、正等覺乘如是乘行如是道，來至無上正等菩提，",
        "translation": "The Buddha said to Sudarśana: All the Tathāgatas, Arhats, Perfectly Enlightened Ones (i.e., enlightened ones), who are riding on such a vehicle and following such a path, arrive at unsurpassed true and complete enlightenment.",
        "source": "T07n0220_510:0605c10_9"
    },
    {
        "source_sentence": "得菩提已，於一切時供養恭敬、尊重讚歎、攝受護持是乘是道曾無暫廢，",
        "translation": "Having attained enlightenment, they at all times honor, venerate, revere, and praise it. They embrace and preserve this vehicle of the path without ever abandoning it.",
        "source": "T07n0220_510:0605c12_0"
    },
    {
        "source_sentence": "此乘此道當知即是甚深般若波羅蜜多，是名如來、應、正等覺知恩報恩。",
        "translation": "This path of this vehicle should be known as the profound prajñāpāramitā, which is called the Tathāgata, Arhat, and Completely Awakened One who knows kindness and repays kindness.",
        "source": "T07n0220_510:0605c13_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0605c15_2"
    },
    {
        "source_sentence": "一切如來、應、正等覺無不皆依甚深般若波羅蜜多，於諸有相及無相法，",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones all rely on the profound prajñāpāramitā, which is based on characteristics and signless dharmas.",
        "source": "T07n0220_510:0605c15_3"
    },
    {
        "source_sentence": "皆現等覺無實作用，以能作者無所有故。",
        "translation": "They all manifest equanimity and so forth without real activity, because the agent that produces them has no existence.",
        "source": "T07n0220_510:0605c17_4"
    },
    {
        "source_sentence": "一切如來、應、正等覺無不皆依甚深般若波羅蜜多，於諸有相及無相法，",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones all rely on the profound prajñāpāramitā, which is based on characteristics and signless dharmas.",
        "source": "T07n0220_510:0605c18_5"
    },
    {
        "source_sentence": "皆現等覺無所成辦，以諸形質不可得故。",
        "translation": "There is nothing to be accomplished in all the manifestations of virtual enlightenment, because form and substance are unobtainable.",
        "source": "T07n0220_510:0605c19_6"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0605c20_7"
    },
    {
        "source_sentence": "以諸如來、應、正等覺知依如是甚深般若波羅蜜多，能現等覺相、無相法皆無作用，",
        "translation": "It's because the Tathāgatas, Arhats, and Fully Awakened Ones rely on such profound prajñāpāramitā to show that the characteristics of enlightenment and signless dharmas have no effect.",
        "source": "T07n0220_510:0605c20_8"
    },
    {
        "source_sentence": "無所成辦，於一切時供養恭敬、尊重讚歎、攝受護持曾無間斷，故名真實知恩報恩。",
        "translation": "Nothing is accomplished, and it's always offered support, respected, venerated, praised, collected, and maintained without interruption, so it's called truly knowing kindness and repaying kindness.",
        "source": "T07n0220_510:0605c22_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0605c24_10"
    },
    {
        "source_sentence": "一切如來、應、正等覺無不皆依甚深般若波羅蜜多，於一切法無作、無成、無生智轉，",
        "translation": "All the Tathāgatas, Arhats, and Completely Awakened Ones all rely on the profound prajñāpāramitā to develop the unconstructed, unmanifest, and unarisen knowledge of all things.",
        "source": "T07n0220_510:0605c24_11"
    },
    {
        "source_sentence": "復能知此無轉因緣。",
        "translation": "They can also know that these are the causes and conditions for non-transformation.",
        "source": "T07n0220_510:0605c26_12"
    },
    {
        "source_sentence": "是故，應知甚深般若波羅蜜多，能生如來、應、正等覺，亦能如實示世間相。」",
        "translation": "Therefore, you should know that the profound prajñāpāramitā can give rise to the Tathāgata, Arhat, and Completely Awakened One, and it can also truly show worldly appearances.",
        "source": "T07n0220_510:0605c27_13"
    },
    {
        "source_sentence": "具壽善現便白佛言：「如來常說一切法性無生、無起、無知、無見，如何可說甚深般若波羅蜜多，",
        "translation": "Guoshou Shancheng then said to the Buddha, The Tathāgata always explains that all dharmas have no arising, no arising, no knowing, and no seeing, so how can we explain the profound prajñāpāramitā?",
        "source": "T07n0220_510:0605c28_14"
    },
    {
        "source_sentence": "能生諸佛，是諸佛母，亦能如實示世間相？」",
        "translation": "The buddhas that can give birth are the mothers of the buddhas, and they can also truly show worldly appearances?",
        "source": "T07n0220_510:0606a02_0"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_510:0606a02_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_510:0606a03_2"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_510:0606a03_3"
    },
    {
        "source_sentence": "一切法性無生、無起、無知、無見，依世俗說甚深般若波羅蜜多，能生諸佛，",
        "translation": "The nature of all dharmas has no birth, no arising, no knowing, and no seeing, and according to worldly teachings the profound prajñāpāramitā can give rise to buddhas.",
        "source": "T07n0220_510:0606a03_4"
    },
    {
        "source_sentence": "是諸佛母，亦能如實示世間相。」",
        "translation": "These are the buddhas and mothers who can also truly show worldly appearances.",
        "source": "T07n0220_510:0606a05_5"
    },
    {
        "source_sentence": "具壽善現復白佛言：「云何諸法無生、無起、無知、無見？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What are the dharmas that lack birth, lack arising, lack knowledge, and lack views?",
        "source": "T07n0220_510:0606a06_0"
    },
    {
        "source_sentence": "佛告善現：「以一切法空無所有，皆不自在、虛誑不堅故，一切法無生、無起、無知、無見。",
        "translation": "The Buddha told Shancheng, Because the emptiness of all dharmas has no existence, none of them are self-contained or unsteady, and all dharmas lack arising, nonarising, nonarising, nonknowledge, and nonvision.",
        "source": "T07n0220_510:0606a07_1"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T07n0220_510:0606a09_2"
    },
    {
        "source_sentence": "一切法性無所依止，無所繫屬，由此因緣，無生、無起、無知、無見。",
        "translation": "The essence of all dharmas has no basis and no attachment, and because of these causes and conditions, there's no arising, no arising, no knowing, and no seeing.",
        "source": "T07n0220_510:0606a09_3"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0606a10_4"
    },
    {
        "source_sentence": "甚深般若波羅蜜多雖能生佛，示世間相，而無所生亦無所示。",
        "translation": "Although the profound prajñāpāramitā can give rise to buddhas, it shows worldly appearances, yet nothing is produced and nothing is shown.",
        "source": "T07n0220_510:0606a10_5"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0606a12_6"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，不見色故名示色相，不見受、想、行、識故名示受、想、行、識相，",
        "translation": "The profound perfection of wisdom is called showing form because it doesn't see form, and it's called showing the characteristics of feeling, perception, volition, and consciousness because it doesn't see feeling, perception, volition, and consciousness.",
        "source": "T07n0220_510:0606a12_7"
    },
    {
        "source_sentence": "廣說乃至不見一切智故名示一切智相，不見道相智、一切相智故名示道相智、一切相智相。",
        "translation": "It's explained in detail up to the point where it doesn't see all kinds of cognition, so it's called showing the characteristics of all kinds of cognition, and it doesn't see the characteristics of knowledge of the path and the characteristics of all kinds of cognition, so it's called showing the characteristics of knowledge of the path and the character",
        "source": "T07n0220_510:0606a14_8"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0606a16_9"
    },
    {
        "source_sentence": "由如是義，甚深般若波羅蜜多，能示世間諸法實相，能生諸佛，名諸佛母。」",
        "translation": "Because of this meaning, the profound prajñāpāramitā can show the true characteristics of worldly dharmas and give birth to buddhas, which are called the mothers of buddhas.",
        "source": "T07n0220_510:0606a16_10"
    },
    {
        "source_sentence": "具壽善現復白佛言：「云何如是甚深般若波羅蜜多，不見色故名示色相，",
        "translation": "Guoshou Shancheng then said to the Buddha, How is such a profound prajñāpāramitā called showing form because it doesn't see form?",
        "source": "T07n0220_510:0606a18_11"
    },
    {
        "source_sentence": "不見受、想、行、識故名示受、想、行、識相，廣說乃至不見一切智故名示一切智相，",
        "translation": "It is called showing the characteristic marks of feeling, conceptual identification, volition, and consciousness because it does not see feeling, conceptual identification, volition, or consciousness. It is called showing the characteristic marks of omniscience because it does not see everything.",
        "source": "T07n0220_510:0606a20_0"
    },
    {
        "source_sentence": "不見道相智、一切相智故名示道相智、一切相智相？」",
        "translation": "They don't see the cognition of the path and the cognition of all characteristics, so they're called showing the cognition of the path and the cognition of all characteristics.",
        "source": "T07n0220_510:0606a21_1"
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多，由不緣色而生於識，是為不見色故名示色相，",
        "translation": "The Buddha told Shancheng, The profound prajñāpāramitā gives rise to consciousness because it doesn't rely on form, which is called showing form because it doesn't see form.",
        "source": "T07n0220_510:0606a22_2"
    },
    {
        "source_sentence": "廣說乃至由不緣一切相智而生於識，是為不見一切相智故名示一切相智相。",
        "translation": "It's explained in detail up to the point where consciousness arises because it doesn't rely on the cognition of all characteristics, which is called showing the characteristics of omniscience because it doesn't see the cognition of all characteristics.",
        "source": "T07n0220_510:0606a24_3"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0606a26_4"
    },
    {
        "source_sentence": "由如是義，甚深般若波羅蜜多，能示世間諸法實相，能生諸佛，名諸佛母。",
        "translation": "Because of this meaning, the profound prajñāpāramitā can show the true characteristics of worldly dharmas and give birth to buddhas, which are called the mothers of buddhas.",
        "source": "T07n0220_510:0606a26_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606a28_6"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能為諸佛顯世間空，故名佛母，能示諸佛世間實相。」",
        "translation": "The profound prajñāpāramitā can reveal worldly emptiness for the sake of the buddhas, so it's called the mother of buddhas and can show the true characteristics of the buddhas in the world.",
        "source": "T07n0220_510:0606a28_7"
    },
    {
        "source_sentence": "具壽善現即白佛言：「云何般若波羅蜜多，能為諸佛顯世間空？」",
        "translation": "Guoshou Shancheng then said to the Buddha, How can the perfection of wisdom reveal worldly emptiness for the buddhas?",
        "source": "T07n0220_510:0606b01_8"
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多，能為諸佛顯五蘊世間空，顯十二處世間空，",
        "translation": "The Buddha told Śaṅgālī, The profound prajñāpāramitā can reveal the worldly emptiness of the five aggregates for the buddhas and the worldly emptiness of the twelve places for the buddhas.",
        "source": "T07n0220_510:0606b02_9"
    },
    {
        "source_sentence": "顯十八界世間空，顯六觸世間空，顯六受世間空，顯六界世間空，顯四緣世間空，",
        "translation": "They show emptiness of the eighteen realms, emptiness of the six contacts, emptiness of the six sensations, emptiness of the six realms, and emptiness of the four conditions.",
        "source": "T07n0220_510:0606b04_10"
    },
    {
        "source_sentence": "顯十二支緣起世間空，顯我見為根本六十二見世間空，顯十善業道世間空，",
        "translation": "It shows the worldly emptiness of the twelve members of dependent origination. It shows that view of self is the root of the sixty-two views of worldly emptiness. It shows the worldly emptiness of the ten good paths of action.",
        "source": "T07n0220_510:0606b06_11"
    },
    {
        "source_sentence": "顯四靜慮、四無量、四無色定世間空，顯六波羅蜜多世間空，顯內空乃至無性自性空世間空，",
        "translation": "It shows the worldly emptiness of the four meditations, the four immeasurables, and the four formless concentrations, the worldly emptiness of the six perfections, and the worldly emptiness of internal emptiness up to the emptiness of the natureless self-nature of emptiness.",
        "source": "T07n0220_510:0606b07_12"
    },
    {
        "source_sentence": "顯苦、集、滅、道世間空，顯三十七菩提分法世間空，顯八解脫、八勝處、九次第定、十遍處世間空，",
        "translation": "It shows the worldly emptiness of suffering, arising, cessation, and the path; it shows the worldly emptiness of the thirty-seven factors of enlightenment; it shows the worldly emptiness of the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universals.",
        "source": "T07n0220_510:0606b10_0"
    },
    {
        "source_sentence": "顯空、無相、無願解脫門世間空，顯三乘十地世間空，顯菩薩十地世間空，",
        "translation": "They show emptiness, signlessness, and wishlessness in the liberation gate of worldly emptiness, they show emptiness in the ten stages of the three vehicles, and they show emptiness in the ten stages of enlightening beings.",
        "source": "T07n0220_510:0606b12_1"
    },
    {
        "source_sentence": "顯一切陀羅尼門、三摩地門世間空，顯五眼、六神通世間空，顯如來十力、四無所畏、四無礙解、十八佛不共法世間空，",
        "translation": "It reveals the worldly emptiness of all dhāraṇī teachings and samādhi teachings, the worldly emptiness of the five eyes and six supernormal powers, the worldly emptiness of the ten powers, the four fearlessnesses, the four unhindered understandings, and the worldly emptiness of the eighteen unique qualities of buddhas.",
        "source": "T07n0220_510:0606b13_2"
    },
    {
        "source_sentence": "顯大慈、大悲、大喜、大捨世間空，顯三十二大士相、八十隨好世間空，",
        "translation": "They show great kindness, great compassion, great pity, great joy, and great equanimity in the world. They show the thirty-two marks of a great personage and the eighty secondary signs of a great personality in the world.",
        "source": "T07n0220_510:0606b16_3"
    },
    {
        "source_sentence": "顯無忘失法、恒住捨性世間空，顯預流果乃至獨覺菩提世間空，顯一切菩薩摩訶薩行、諸佛無上正等菩提世間空，",
        "translation": "It shows the worldly emptiness of the absence of forgetfulness and the eternally abiding equanimity, the worldly emptiness of the fruit of stream-entry up to the enlightenment of the solitary realizer, and the worldly emptiness of the practices of all enlightening beings and the supreme perfect enlightenment of buddhas.",
        "source": "T07n0220_510:0606b17_4"
    },
    {
        "source_sentence": "顯一切智、道相智、一切相智世間空。",
        "translation": "It shows the worldly emptiness of omniscience, knowledge of the path and knowledge of all characteristics.",
        "source": "T07n0220_510:0606b20_5"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606b21_6"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能為諸佛顯世間空，故名佛母，能示諸佛世間實相。",
        "translation": "The profound prajñāpāramitā can reveal worldly emptiness for the sake of the buddhas, so it's called the mother of buddhas and can show the true characteristics of the buddhas in the world.",
        "source": "T07n0220_510:0606b21_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606b23_8"
    },
    {
        "source_sentence": "佛因般若波羅蜜多，能為世間顯色世間空，乃至顯一切相智世間空，令諸世間受世間空、想世間空、思世間空、識世間空。",
        "translation": "Because of the perfection of prajñāpāramitā, the Buddha can reveal the emptiness of form and the emptiness of form in the world for the sake of the world, up to reveal the emptiness of all characteristics and knowledge in the world, causing the worlds to experience the emptiness of the world, the emptiness of the world of perception, the emptiness",
        "source": "T07n0220_510:0606b23_9"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606b26_10"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能為諸佛顯世間空，故名佛母，能示諸佛世間實相。",
        "translation": "The profound prajñāpāramitā can reveal worldly emptiness for the sake of the buddhas, so it's called the mother of buddhas and can show the true characteristics of the buddhas in the world.",
        "source": "T07n0220_510:0606b26_11"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606b28_12"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間空相。",
        "translation": "The profound prajñāpāramitā can show the buddhas the characteristics of worldly emptiness.",
        "source": "T07n0220_510:0606b28_13"
    },
    {
        "source_sentence": "云何示諸佛世間空相？",
        "translation": "How do they show the buddhas the mark of worldly emptiness?",
        "source": "T07n0220_510:0606b29_14"
    },
    {
        "source_sentence": "謂令如來、應、正等覺見色世間空，乃至見一切相智世間空。",
        "translation": "It's causing the Tathāgata, Arhat, and Completely Awakened One to see the emptiness of the form world and even seeing the emptiness of the world of omniscience.",
        "source": "T07n0220_510:0606b29_15"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606c02_16"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間空相。",
        "translation": "The profound prajñāpāramitā can show the buddhas the characteristics of worldly emptiness.",
        "source": "T07n0220_510:0606c02_17"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606c03_18"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間不可思議相。",
        "translation": "The profound prajñāpāramitā can show the inconceivable characteristics of the buddhas of the world.",
        "source": "T07n0220_510:0606c03_19"
    },
    {
        "source_sentence": "云何示諸佛世間不可思議相？",
        "translation": "How does it show the inconceivable characteristics of the buddhas of the world?",
        "source": "T07n0220_510:0606c04_20"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間不可思議相，乃至一切相智世間不可思議相。",
        "translation": "It's showing the inconceivable characteristics of the form world of the Tathāgata, Arhat, and Completely Awakened One, up to the inconceivable characteristics of the world of omniscience.",
        "source": "T07n0220_510:0606c05_21"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606c07_22"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間不可思議相。",
        "translation": "The profound prajñāpāramitā can show the inconceivable characteristics of the buddhas of the world.",
        "source": "T07n0220_510:0606c07_23"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606c08_24"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間遠離相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world are far removed from characteristics.",
        "source": "T07n0220_510:0606c08_25"
    },
    {
        "source_sentence": "云何能示諸佛世間遠離相？",
        "translation": "How can they show that the buddhas' world is free of characteristics?",
        "source": "T07n0220_510:0606c09_26"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間遠離相，乃至一切相智世間遠離相。",
        "translation": "It shows that the form world of the Tathāgata, Arhat, and Completely Awakened One is free of characteristics, up to the world of omniscience is free of characteristics.",
        "source": "T07n0220_510:0606c10_27"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606c11_28"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間遠離相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world are far removed from characteristics.",
        "source": "T07n0220_510:0606c12_29"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606c13_30"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間寂靜相。",
        "translation": "The profound prajñāpāramitā can show the tranquil characteristics of the buddhas in the world.",
        "source": "T07n0220_510:0606c13_31"
    },
    {
        "source_sentence": "云何能示諸佛世間寂靜相？",
        "translation": "How can they show the tranquil characteristics of the buddhas of the world?",
        "source": "T07n0220_510:0606c14_32"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間寂靜相，乃至一切相智世間寂靜相。",
        "translation": "It shows the quiescent characteristics of the form world of the Tathāgata, Arhat, and Completely Awakened One, up to the quiescent characteristics of the world of omniscience.",
        "source": "T07n0220_510:0606c14_33"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606c16_34"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間寂靜相。",
        "translation": "The profound prajñāpāramitā can show the tranquil characteristics of the buddhas in the world.",
        "source": "T07n0220_510:0606c16_35"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606c17_36"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間畢竟空相。",
        "translation": "The profound prajñāpāramitā can show the ultimate emptiness of the buddhas in the world.",
        "source": "T07n0220_510:0606c17_37"
    },
    {
        "source_sentence": "云何能示諸佛世間畢竟空相？",
        "translation": "How can they show the ultimate emptiness of the buddha worlds?",
        "source": "T07n0220_510:0606c18_38"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間畢竟空相，乃至一切相智世間畢竟空相。",
        "translation": "It shows the ultimate mark of emptiness in the form world of the Tathāgata, Arhat, and Completely Awakened One, up to the ultimate mark of emptiness in the world of omniscience.",
        "source": "T07n0220_510:0606c19_39"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606c21_40"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間畢竟空相。",
        "translation": "The profound prajñāpāramitā can show the ultimate emptiness of the buddhas in the world.",
        "source": "T07n0220_510:0606c21_41"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606c22_42"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間無性空相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world have no nature or emptiness in their characteristics.",
        "source": "T07n0220_510:0606c22_43"
    },
    {
        "source_sentence": "云何能示諸佛世間無性空相？",
        "translation": "How can they show that the buddhas of the world have no nature or characteristics of emptiness?",
        "source": "T07n0220_510:0606c23_44"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間無性空相，乃至一切相智世間無性空相。",
        "translation": "It shows that the form world of the Tathāgata, Arhat, and Completely Awakened One is devoid of the mark of emptiness in nature in the form world, up to the mark of emptiness in the world of omniscience.",
        "source": "T07n0220_510:0606c24_45"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0606c26_46"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間無性空相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world have no nature or emptiness in their characteristics.",
        "source": "T07n0220_510:0606c26_47"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0606c27_48"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間自性空相。",
        "translation": "The profound prajñāpāramitā can show the self-nature of the buddhas in the world as emptiness and characteristics.",
        "source": "T07n0220_510:0606c27_49"
    },
    {
        "source_sentence": "云何能示諸佛世間自性空相？",
        "translation": "How can they show the self-nature of the buddhas' worldly emptiness?",
        "source": "T07n0220_510:0606c28_50"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間自性空相，乃至一切相智世間自性空相。",
        "translation": "It shows the self-nature of the Tathāgata, Arhat, and Completely Awakened One's form world as emptiness, up to the self-nature of the world of omniscience as emptiness.",
        "source": "T07n0220_510:0606c29_51"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0607a02_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間自性空相。",
        "translation": "The profound prajñāpāramitā can show the self-nature of the buddhas in the world as emptiness and characteristics.",
        "source": "T07n0220_510:0607a02_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0607a03_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間無性自性空相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world lack the self-nature of emptiness and marks of emptiness in their own nature.",
        "source": "T07n0220_510:0607a03_3"
    },
    {
        "source_sentence": "云何能示諸佛世間無性自性空相？",
        "translation": "How can they show that the buddhas of the world have no-essence, self-nature, emptiness, or characteristics?",
        "source": "T07n0220_510:0607a04_4"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間無性自性空相，乃至一切相智世間無性自性空相。",
        "translation": "It shows that the Tathāgata, Arhat, and Completely Awakened One's form world is devoid of the mark of emptiness in its own-natureless self-nature in the form world, up to the mark of emptiness in the absence of the self-nature of all characteristics in the world of omniscience.",
        "source": "T07n0220_510:0607a05_5"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0607a07_6"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間無性自性空相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world lack the self-nature of emptiness and marks of emptiness in their own nature.",
        "source": "T07n0220_510:0607a07_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0607a08_8"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間純空相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world are purely empty.",
        "source": "T07n0220_510:0607a09_0"
    },
    {
        "source_sentence": "云何能示諸佛世間純空相？",
        "translation": "How can they show that the world of buddhas is purely empty?",
        "source": "T07n0220_510:0607a10_0"
    },
    {
        "source_sentence": "謂示如來、應、正等覺色世間純空相，乃至一切相智世間純空相。",
        "translation": "It shows that the form world of the Tathāgata, Arhat, and Completely Awakened One is purely empty, and so forth, up to the world of all-inclusive cognition is purely empty.",
        "source": "T07n0220_510:0607a10_1"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_510:0607a12_2"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間純空相。",
        "translation": "The profound prajñāpāramitā can show that the buddhas of the world are purely empty.",
        "source": "T07n0220_510:0607a12_3"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_510:0607a13_4"
    },
    {
        "source_sentence": "由如是義，甚深般若波羅蜜多，能示諸佛世間實相。",
        "translation": "Because of this meaning, the profound prajñāpāramitā can show the true characteristics of the buddhas in the world.",
        "source": "T07n0220_510:0607a13_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_510:0607a14_6"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能示諸佛世間相者，謂令不起此世間想、他世間想。",
        "translation": "The profound prajñāpāramitā that can show the worldly characteristics of the buddhas means to cause them not to give rise to conceptions of this world and other worldly conceptions.",
        "source": "T07n0220_510:0607a15_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_510:0607a16_1"
    },
    {
        "source_sentence": "以實無法可起此世、他世想故。」",
        "translation": "It's because there really isn't a way to give rise to conceptions of this world and other worlds.",
        "source": "T07n0220_510:0607a16_2"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一十",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 10",
        "source": "T07n0220_510:0607a18_0"
    }
]