[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 6",
        "source": "T07n0220_564:0910b02_0"
    },
    {
        "source_sentence": "十四",
        "translation": "fourteen",
        "source": "T07n0220_564:0910b03_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_564:0910b05_0"
    },
    {
        "source_sentence": "第五分勝意樂品第二十",
        "translation": "The Twenty-second Chapter of the Fifth Part of the chapter on superior aspirations",
        "source": "T07n0220_564:0910b06_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_564:0910b07_0"
    },
    {
        "source_sentence": "若諸菩薩以勝意樂，欲證無上正等菩提，常應親近、供養恭敬、尊重讚歎真淨善友。」",
        "translation": "If bodhisattvas want to realize unsurpassed perfect enlightenment with superior intentions, they should always become intimate, offer support and respect, and venerate and praise the truly pure good friend.",
        "source": "T07n0220_564:0910b07_1"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「何等名為菩薩善友？」",
        "translation": "It was then that the good manifestation said to the Buddha, What's called a bodhisattva's good friend?",
        "source": "T07n0220_564:0910b09_2"
    },
    {
        "source_sentence": "佛告善現：「諸佛皆名菩薩善友。",
        "translation": "The Buddha told Shancheng, All the buddhas are called bodhisattvas and good friends.",
        "source": "T07n0220_564:0910b10_3"
    },
    {
        "source_sentence": "若能宣說甚深般若波羅蜜多，教誡教授諸菩薩眾，令於般若波羅蜜多甚深法門能悟入者，",
        "translation": "If someone can proclaim the profound prajñāpāramitā, instruct and teach the bodhisattvas so that they can awaken to and enter the profound dharma-gate of the profound prajñāpāramitā,",
        "source": "T07n0220_564:0910b10_4"
    },
    {
        "source_sentence": "亦得名為菩薩善友。",
        "translation": "They can also be called a bodhisattva's good friend.",
        "source": "T07n0220_564:0910b12_5"
    },
    {
        "source_sentence": "布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，當知亦名菩薩善友。",
        "translation": "You should know that generosity, pure morality, patience, effort, meditation, and the perfection of wisdom are also called a bodhisattva's good friend.",
        "source": "T07n0220_564:0910b13_6"
    },
    {
        "source_sentence": "如是六種波羅蜜多，與諸菩薩為師為導，為明為炬，為光為照，為舍為護，",
        "translation": "These six kinds of perfections are given to the bodhisattvas as teachers and guides, as lights and torches, as lights and illuminations, and as shelters and protectors.",
        "source": "T07n0220_564:0910b14_7"
    },
    {
        "source_sentence": "為歸為趣，為洲為渚，為父為母。",
        "translation": "It's for refuge, destiny, continent, island, father, and mother.",
        "source": "T07n0220_564:0910b16_8"
    },
    {
        "source_sentence": "過去未來現在諸佛，皆依六種波羅蜜多，而得成辦功德事業。",
        "translation": "The buddhas of the past, future, and present all rely on the six kinds of perfections to accomplish meritorious works.",
        "source": "T07n0220_564:0910b17_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0910b18_10"
    },
    {
        "source_sentence": "如是六種波羅蜜多，普能攝受一切佛法。",
        "translation": "Thus, these six kinds of perfections can universally embrace all the Buddha's teachings.",
        "source": "T07n0220_564:0910b18_11"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T07n0220_564:0910b19_12"
    },
    {
        "source_sentence": "若諸菩薩欲證無上正等菩提，應學六種波羅蜜多。",
        "translation": "If bodhisattvas want to realize unsurpassed perfect enlightenment, they should train in six kinds of perfections.",
        "source": "T07n0220_564:0910b19_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_564:0910b22_0"
    },
    {
        "source_sentence": "若諸菩薩欲學六種波羅蜜多，應於般若波羅蜜多甚深經典，至心聽聞、受持、讀誦，",
        "translation": "If bodhisattvas want to learn the six kinds of perfections, they should wholeheartedly hear, retain, and recite the profound scripture Prajñāpāramitā.",
        "source": "T07n0220_564:0910b22_1"
    },
    {
        "source_sentence": "觀察義趣請決所疑。",
        "translation": "He observes the meaning and asks to resolve his doubts.",
        "source": "T07n0220_564:0910b24_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0910b24_3"
    },
    {
        "source_sentence": "如是般若波羅蜜多甚深經典，能與六種波羅蜜多為尊為導、為生養母。",
        "translation": "Thus, this profound scripture of the prajñāpāramitā can be honored as a guide and nurturing mother to the six kinds of prajñāpāramitā.",
        "source": "T07n0220_564:0910b24_4"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_564:0910b26_5"
    },
    {
        "source_sentence": "若諸菩薩欲得不隨他教行，欲住不隨他教地，欲斷一切有情疑，欲滿一切有情願，",
        "translation": "“If enlightening beings want to attain the practice of not following others’ teachings, want to abide in the stage of not following others’ teachings, want to eliminate the doubts of all sentient beings, and want to fulfill the vows",
        "source": "T07n0220_564:0910b26_6"
    },
    {
        "source_sentence": "應學如是甚深般若波羅蜜多。」",
        "translation": "You should train in such a profound prajñāpāramitā.",
        "source": "T07n0220_564:0910b28_7"
    },
    {
        "source_sentence": "具壽善現便白佛言：「甚深般若波羅蜜多以何為相？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's the characteristic of the profound prajñāpāramitā?",
        "source": "T07n0220_564:0910b29_8"
    },
    {
        "source_sentence": "佛告善現：「甚深般若波羅蜜多無礙為相。」",
        "translation": "The Buddha told Shancheng, The profound prajñāpāramitā is unobstructed as its characteristic.",
        "source": "T07n0220_564:0910c01_9"
    },
    {
        "source_sentence": "爾時，善現復白佛言：「頗有因緣，甚深般若波羅蜜多無礙之相，餘一切法亦得有耶？」",
        "translation": "It was then that the good manifestation again said to the Buddha, Could it be that there are causes and conditions for the unobstructed characteristics of the profound prajñāpāramitā and all other dharmas to exist?",
        "source": "T07n0220_564:0910c02_10"
    },
    {
        "source_sentence": "佛告善現：「有因緣故，甚深般若波羅蜜多無礙之相，餘一切法亦可說有。",
        "translation": "The Buddha told Shancheng, There are reasons why the profound prajñāpāramitā has unobstructed characteristics, and all other dharmas can also be said to exist.",
        "source": "T07n0220_564:0910c04_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0910c05_12"
    },
    {
        "source_sentence": "以一切法無不皆如甚深般若波羅蜜多是空、遠離。」",
        "translation": "It's because all dharmas are nothing but the profound prajñāpāramitā, which is emptiness and seclusion.",
        "source": "T07n0220_564:0910c06_13"
    },
    {
        "source_sentence": "具壽善現復白佛言：「若一切法皆空、遠離，云何有情有染有淨？",
        "translation": "Guoshou Shancheng then said to the Buddha, If all things are empty and far removed, how can sentient beings have defilement and purity?",
        "source": "T07n0220_564:0910c07_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0910c08_15"
    },
    {
        "source_sentence": "非空、遠離法可說有染淨，非空、遠離能證菩提，非離空、遠離有別法可得，",
        "translation": "It's not empty or distant from things that can be described as defiled or pure, it's not empty or distant from things that can realize enlightenment, and it's not separate from emptiness or distant from distinct things that can be attained",
        "source": "T07n0220_564:0910c09_0"
    },
    {
        "source_sentence": "云何令我解如是義？」",
        "translation": "How do you make me understand such a meaning?",
        "source": "T07n0220_564:0910c10_1"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0910c11_2"
    },
    {
        "source_sentence": "有情長夜有我等心執我等不？」",
        "translation": "Do sentient beings have self and so for a long time cling to self and so forth?",
        "source": "T07n0220_564:0910c11_3"
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_564:0910c12_4"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0910c12_5"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0910c12_6"
    },
    {
        "source_sentence": "有情所執我及我所空、遠離不？」",
        "translation": "Are the self and what belongs to self that sentient beings attach to emptiness and seclusion?",
        "source": "T07n0220_564:0910c13_7"
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_564:0910c13_8"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0910c14_9"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0910c14_10"
    },
    {
        "source_sentence": "豈不有情由我、我所流轉生死？」",
        "translation": "Aren't sentient beings born and dying because of self and what belongs to self?",
        "source": "T07n0220_564:0910c14_11"
    },
    {
        "source_sentence": "善現對曰：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_564:0910c15_12"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0910c16_0"
    },
    {
        "source_sentence": "佛告善現：「如是有情流轉生死，施設雜染及清淨者。",
        "translation": "The Buddha told Shancheng, Such are sentient beings who transmigrate through birth and death and define defilement and purity.",
        "source": "T07n0220_564:0910c16_1"
    },
    {
        "source_sentence": "由諸有情虛妄執著我及我所說有雜染，而於其中無雜染者；",
        "translation": "Sentient beings falsely believe that there is defilement by clinging to self and what belongs to self, yet they are free of it.",
        "source": "T07n0220_564:0910c17_2"
    },
    {
        "source_sentence": "由諸有情不妄執著我及我所說有清淨，而於其中無清淨者。",
        "translation": "It's because sentient beings don't falsely cling to self and what's said to be self that there's purity, but there's no pure one among them.",
        "source": "T07n0220_564:0910c18_3"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T07n0220_564:0910c20_4"
    },
    {
        "source_sentence": "雖一切法皆空、遠離，而諸有情亦可施設有染有淨，若諸菩薩能如是行，",
        "translation": "Even though all things are empty and remote, yet sentient beings can also imagine that they are defiled and purified.",
        "source": "T07n0220_564:0910c20_5"
    },
    {
        "source_sentence": "名行般若波羅蜜多。」",
        "translation": "It's called practicing the perfection of prajñāpāramitā.",
        "source": "T07n0220_564:0910c22_0"
    },
    {
        "source_sentence": "具壽善現便白佛言：「希有！",
        "translation": "Guoshou Shancheng then said to the Buddha, Rarely!",
        "source": "T07n0220_564:0910c22_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0910c23_2"
    },
    {
        "source_sentence": "雖一切法皆空、遠離，而諸有情有染有淨。",
        "translation": "Although all things are empty and remote, sentient beings have defilement and purity.",
        "source": "T07n0220_564:0910c23_3"
    },
    {
        "source_sentence": "若諸菩薩能如是行，則不行色、受、想、行、識，世間天、人、阿素洛等皆不能伏，",
        "translation": "If bodhisattvas can thus practice, they won't practice form, sensation, perception, volition, or consciousness, and neither gods, humans, nor asuras in the world will be able to subdue them.",
        "source": "T07n0220_564:0910c24_4"
    },
    {
        "source_sentence": "普勝一切聲聞、獨覺所行之行至無勝處，是諸菩薩由此般若波羅蜜多相應作意，",
        "translation": "To universally surpass all the practices of śrāvakas and solitary realizers up to the unexcelled state is the contemplation associated with these prajñāpāramitā-pāramitās by enlightening beings.",
        "source": "T07n0220_564:0910c25_5"
    },
    {
        "source_sentence": "晝夜安住方便善巧，趣向無上正等菩提，疾證無上正等菩提。」",
        "translation": "Day and night, he abides in skillful means and directs his attention to unsurpassed perfect enlightenment and quickly realizes unsurpassed perfect enlightenment.",
        "source": "T07n0220_564:0910c27_6"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_564:0910c29_7"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_564:0910c29_8"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T07n0220_564:0910c29_9"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_564:0910c29_10"
    },
    {
        "source_sentence": "假使於此贍部洲中一切有情，非前非後皆得人身，發菩提心盡壽布施，",
        "translation": "Suppose all sentient beings in Jambudvfpa were to develop the aspiration for enlightenment and give alms for the rest of their lives, not before or after attaining a human body.",
        "source": "T07n0220_564:0911a01_11"
    },
    {
        "source_sentence": "持此布施迴向菩提，由此因緣得福多不？」",
        "translation": "By maintaining this generosity and dedicating it to enlightenment, will this be the cause for attaining much merit?",
        "source": "T07n0220_564:0911a02_12"
    },
    {
        "source_sentence": "善現對曰：「甚多！",
        "translation": "Shancheng replied, Very much so!",
        "source": "T07n0220_564:0911a03_13"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911a04_14"
    },
    {
        "source_sentence": "佛告善現：「若有菩薩下至一日，安住般若波羅蜜多相應作意，所獲功德甚多於前無量無數。",
        "translation": "The Buddha told Shancheng, Suppose a bodhisattva goes down to one day and abides in the contemplation associated with the perfection of prajñāpāramitā, and the merit he attains is so great that it's immeasurable",
        "source": "T07n0220_564:0911a04_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0911a06_16"
    },
    {
        "source_sentence": "如是菩薩如如安住甚深般若波羅蜜多相應作意，如是如是堪為一切有情福田，",
        "translation": "Thus the bodhisattva thus and thus abides in the profound prajñāpāramitā associated with contemplation, thus and thus able to be a field of merit for all sentient beings.",
        "source": "T07n0220_564:0911a06_17"
    },
    {
        "source_sentence": "由此菩薩所起慈心，諸有情類無能及者，唯除如來、應、正等覺。",
        "translation": "As a result, the kindness of compassion that arises from this bodhisattva is unsurpassed by all sentient beings except for the Tathāgata, Arhat, and Completely Awakened One.",
        "source": "T07n0220_564:0911a08_18"
    },
    {
        "source_sentence": "「如是菩薩具勝妙慧，由勝妙慧，見諸有情受大苦惱如被刑戮，起大悲心。",
        "translation": "Thus, the bodhisattva possesses excellent and marvelous wisdom, and because of his excellent and marvelous wisdom, he sees that sentient beings experience great suffering and distress like being tortured and killed and gives rise to great compassion.",
        "source": "T07n0220_564:0911a09_19"
    },
    {
        "source_sentence": "復以天眼，見有情類成無間業墮無暇處受諸苦惱，或為見網之所覆蔽不得正道，",
        "translation": "Again, with the divine eye, they see sentient beings who have done unremitting actions and fallen into painful states of no leisure, or are hindered by the web of views that prevent them from attaining the right path.",
        "source": "T07n0220_564:0911a11_20"
    },
    {
        "source_sentence": "見已悲愍生大厭怖，普緣一切有情世間起大慈悲相應作意：『我當普為一切有情作大導師令脫眾苦。』",
        "translation": "Seeing that compassion and pity have arisen, he becomes greatly disillusioned and gives rise to the contemplation associated with great compassion for all sentient beings in the world for the sake of all sentient beings: 'I will be a",
        "source": "T07n0220_564:0911a13_21"
    },
    {
        "source_sentence": "雖作是念而不住此想亦不住餘想，是名菩薩大慧光明。",
        "translation": "Even though they think this, they don't abide in these thoughts and don't abide in other thoughts, which is called the bodhisattva's great wisdom light.",
        "source": "T07n0220_564:0911a15_22"
    },
    {
        "source_sentence": "由住此住，能作一切世間福田，雖未證得一切智智，而於菩提已不退轉，",
        "translation": "Because they abide in this abode, they can be fields of blessings for all beings in the world. Though they have not yet attained omniscience and knowledge, yet they do not regress from enlightenment.",
        "source": "T07n0220_564:0911a17_23"
    },
    {
        "source_sentence": "堪受施主一切供養。",
        "translation": "They'll be able to receive all the offerings from the donor.",
        "source": "T07n0220_564:0911a18_24"
    },
    {
        "source_sentence": "「如是菩薩善住般若波羅蜜多，既能畢竟報施主恩，亦能親近一切智智。",
        "translation": "Thus, the bodhisattva well abides in the perfection of prajñāpāramitā, which enables him to ultimately repay the donor's kindness and can also become intimate with omniscience.",
        "source": "T07n0220_564:0911a19_25"
    },
    {
        "source_sentence": "是故菩薩欲不虛受世間信施，欲示有情真淨道路，欲為有情作大饒益，",
        "translation": "Therefore, enlightening beings want to receive the faith of worldly giving without deceit. They want to show sentient beings the true path of purity and they want to do great service for sentient beings.",
        "source": "T07n0220_564:0911a20_26"
    },
    {
        "source_sentence": "欲為世間作大明照，欲脫有情生死牢獄，欲施有情清淨法眼，應常安住甚深般若波羅蜜多相應作意。",
        "translation": "Those who want to create great illumination for the world, want to liberate sentient beings from the prison of birth-and-death, and want to give sentient beings the pure eye of the Dharma should always abide in the contemplation associated with the pro",
        "source": "T07n0220_564:0911a22_27"
    },
    {
        "source_sentence": "由此作意，所有言說皆與般若波羅蜜多理趣相應，諸餘作意無容暫起。",
        "translation": "Because of this contemplation, all the words and teachings are associated with the principle and purpose of the prajñāpāramitā, and other contemplations can't arise for a moment.",
        "source": "T07n0220_564:0911a24_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0911a26_29"
    },
    {
        "source_sentence": "如是菩薩，甚深般若波羅蜜多相應作意流注相續。",
        "translation": "Thus, the bodhisattva's contemplation associated with the profound prajñāpāramitā continues to flow continuously.",
        "source": "T07n0220_564:0911a26_30"
    },
    {
        "source_sentence": "譬如有人先未曾有末尼寶珠，後時遇得歡喜自慶，遇緣還失生大憂惱，",
        "translation": "Good man, it is analogous to someone who has never before possessed a precious maṇi jewel. At some point in time he will be delighted and rejoices at the acquisition of that j ewel; but when confronted with an",
        "source": "T07n0220_564:0911a27_31"
    },
    {
        "source_sentence": "常懷歎惜未曾離念，思當何計還得此珠？",
        "translation": "He always cherished a feeling of admiration and never forgot it, so why would he think to retrieve this pearl?",
        "source": "T07n0220_564:0911a29_32"
    },
    {
        "source_sentence": "彼人由是相應作意，緣此寶珠無時暫捨。",
        "translation": "Concomitant with this, that person's attention is directed toward this precious pearl and doesn't give it up for a moment.",
        "source": "T07n0220_564:0911b01_33"
    },
    {
        "source_sentence": "菩薩亦爾，應常安住甚深般若波羅蜜多相應作意，若不安住如是作意，",
        "translation": "Similarly, bodhisattvas should always abide in the contemplation associated with the profound prajñāpāramitā. If they don't abide in such contemplation,",
        "source": "T07n0220_564:0911b02_34"
    },
    {
        "source_sentence": "則為喪失一切智智相應作意。」",
        "translation": "That's because they lose the contemplation associated with omniscience and cognition.",
        "source": "T07n0220_564:0911b04_35"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「若一切法及諸作意皆離自性，云何菩薩不離般若一切智智相應作意？」",
        "translation": "It was then that Shancheng then said to the Buddha, If all dharmas and contemplations are free of their own nature, how does a bodhisattva not part with the contemplation associated with omniscience and knowledge of prajñā?",
        "source": "T07n0220_564:0911b04_36"
    },
    {
        "source_sentence": "佛告善現：「若諸菩薩知一切法及諸作意皆離自性，是諸菩薩不離般若一切智智。",
        "translation": "The Buddha told Shancheng, If bodhisattvas know that all dharmas and contemplations are free of their own nature, then bodhisattvas aren't free of the omniscience of prajñāpāramitā.",
        "source": "T07n0220_564:0911b06_37"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0911b08_38"
    },
    {
        "source_sentence": "甚深般若一切智智及諸作意自性皆空、無增無減。」",
        "translation": "The profound prajñāpāramitā, omniscience, cognition, and the self-nature of contemplation are all empty, without increase or decrease.",
        "source": "T07n0220_564:0911b09_39"
    },
    {
        "source_sentence": "具壽善現復白佛言：「若深般若波羅蜜多自性常空、無增無減，云何菩薩增長般若波羅蜜多能近菩提？」",
        "translation": "Guoshou Shancheng then said to the Buddha, If the profound prajñāpāramitā is inherently eternally empty and neither increasing nor decreasing, how can a bodhisattva who increases the prajñāpāramitā",
        "source": "T07n0220_564:0911b10_40"
    },
    {
        "source_sentence": "佛告善現：「若諸菩薩行深般若波羅蜜多，知一切法無增無減，於深般若波羅蜜多亦無增減。",
        "translation": "The Buddha told Shancheng, Suppose bodhisattvas practice the profound prajñāpāramitā and know that all things have neither increase nor decrease, and there's no increase or decrease in the profound prajñāpāramitā.",
        "source": "T07n0220_564:0911b12_41"
    },
    {
        "source_sentence": "若諸菩薩能如是知，聞一切法無增無減，不驚、不怖亦不沈沒。",
        "translation": "If bodhisattvas can thus know, they'll hear all the teachings without increase or decrease, and they won't be frightened, terrified, or sunken.",
        "source": "T07n0220_564:0911b14_42"
    },
    {
        "source_sentence": "是諸菩薩行深般若波羅蜜多已到究竟，安住菩薩不退轉地，疾證無上正等菩提。」",
        "translation": "These bodhisattvas who practice the profound prajñāpāramitā have reached its ultimate end, abide in the bodhisattva's stage of nonregression, and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_564:0911b16_43"
    },
    {
        "source_sentence": "具壽善現白言：「世尊！",
        "translation": "Guoshou Shancheng said, Bhagavān!",
        "source": "T07n0220_564:0911b18_44"
    },
    {
        "source_sentence": "為即般若波羅蜜多，能行般若波羅蜜多不？」",
        "translation": "Is it the prajñāpāramitā that can practice the prajñāpāramitā?",
        "source": "T07n0220_564:0911b18_45"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b19_46"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b19_47"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b19_48"
    },
    {
        "source_sentence": "為離般若波羅蜜多有法可得，能行般若波羅蜜多不？」",
        "translation": "Is there a dharma to be attained that's free of the perfection of wisdom, and can you practice the perfection of wisdom?",
        "source": "T07n0220_564:0911b19_49"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b21_50"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b21_51"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b21_52"
    },
    {
        "source_sentence": "為即般若波羅蜜多空，能行般若波羅蜜多不？」",
        "translation": "Is it because the perfection of wisdom is emptiness that you can practice the perfection of wisdom?",
        "source": "T07n0220_564:0911b21_53"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b22_54"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b22_55"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b22_56"
    },
    {
        "source_sentence": "為離般若波羅蜜多空有法可得，能行般若波羅蜜多不？」",
        "translation": "Is there a dharma to be attained that's free of the emptiness of the perfection of wisdom, so can you practice the perfection of wisdom?",
        "source": "T07n0220_564:0911b22_57"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b24_58"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b24_59"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b24_60"
    },
    {
        "source_sentence": "為即空，能行般若波羅蜜多不？」",
        "translation": "Is it because of emptiness that you can practice the perfection of wisdom?",
        "source": "T07n0220_564:0911b24_61"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b25_62"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b25_63"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b25_64"
    },
    {
        "source_sentence": "為離空有法可得，能行般若波羅蜜多不？」",
        "translation": "Is it possible to practice the perfection of wisdom apart from emptiness and dharmas that can be obtained?",
        "source": "T07n0220_564:0911b25_65"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b26_66"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b26_67"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b26_68"
    },
    {
        "source_sentence": "為即空，能行空不？」",
        "translation": "Is that emptiness, and can you practice emptiness?",
        "source": "T07n0220_564:0911b26_69"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b27_70"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b27_71"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b27_72"
    },
    {
        "source_sentence": "為離空有法可得，能行空不？」",
        "translation": "Is it possible to practice emptiness because there's a dharma that's free of emptiness and can be obtained?",
        "source": "T07n0220_564:0911b27_73"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b28_74"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b28_75"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b28_76"
    },
    {
        "source_sentence": "為即般若波羅蜜多，能行空不？」",
        "translation": "Is it the prajñāpāramitā that can practice emptiness?",
        "source": "T07n0220_564:0911b28_77"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911b29_78"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911b29_79"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911b29_80"
    },
    {
        "source_sentence": "為離般若波羅蜜多有法可得，能行空不？」",
        "translation": "Is there a dharma to be attained that's free of the perfection of wisdom, so can you practice emptiness?",
        "source": "T07n0220_564:0911b29_81"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911c01_82"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911c01_83"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c01_84"
    },
    {
        "source_sentence": "為即色、受、想、行、識等，能行般若波羅蜜多及行空不？」",
        "translation": "Is it because form, sensation, feeling, perception, volition, consciousness, and so forth can practice the perfection of wisdom and the practice of emptiness?",
        "source": "T07n0220_564:0911c02_85"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911c03_86"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911c03_87"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c03_88"
    },
    {
        "source_sentence": "為離色、受、想、行、識等有法可得，能行般若波羅蜜多及行空不？」",
        "translation": "Is it possible to practice prajñāpāramitā and practice emptiness apart from form, sensation, perception, volition, consciousness, and other things that can be obtained?",
        "source": "T07n0220_564:0911c03_89"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911c05_0"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911c05_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c05_2"
    },
    {
        "source_sentence": "為即色、受、想、行、識等空，能行般若波羅蜜多及行空不？」",
        "translation": "Is it the emptiness of form, sensation, perception, perception, volition, consciousness, and so forth that you can practice the perfection of wisdom and the emptiness of volition?",
        "source": "T07n0220_564:0911c05_3"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911c06_4"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911c06_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c06_6"
    },
    {
        "source_sentence": "為離色、受、想、行、識等空，能行般若波羅蜜多及行空不？」",
        "translation": "Is it possible to practice the prajñāpāramitā and practice emptiness without form, feeling, perception, volition, consciousness, and so forth?",
        "source": "T07n0220_564:0911c07_7"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911c08_8"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911c08_9"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「若爾，菩薩以何等法能行般若波羅蜜多及能行空？」",
        "translation": "It was then that the good manifestation said to the Buddha, If that's the case, what is the method by which a bodhisattva can practice the perfection of wisdom and the emptiness he can practice?",
        "source": "T07n0220_564:0911c08_10"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0911c10_11"
    },
    {
        "source_sentence": "汝見有法能行般若波羅蜜多及行空不？」",
        "translation": "Do you see any dharmas that can practice the perfection of wisdom and practice emptiness?",
        "source": "T07n0220_564:0911c10_12"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0911c11_13"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c12_0"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0911c12_1"
    },
    {
        "source_sentence": "汝見有般若波羅蜜多及見有空，是諸菩薩所行處不？」",
        "translation": "Do you see the existence of the perfection of wisdom and the existence of emptiness as a place where bodhisattvas practice?",
        "source": "T07n0220_564:0911c12_2"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0911c13_3"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c14_4"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0911c14_5"
    },
    {
        "source_sentence": "汝所不見法，是法可得不？」",
        "translation": "What you don't see as a teaching, is it a teaching that can be attained?",
        "source": "T07n0220_564:0911c14_6"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0911c15_7"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c15_8"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0911c15_9"
    },
    {
        "source_sentence": "不可得法頗有生不？」",
        "translation": "Is there birth in unobtainable dharmas?",
        "source": "T07n0220_564:0911c16_10"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0911c16_11"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c17_12"
    },
    {
        "source_sentence": "佛告善現：「汝所不見、所不得法所有實相，即是菩薩無生法忍。",
        "translation": "The Buddha told Shancheng, What you don't see and what you don't attain is the bodhisattva's forbearance of the nonarising dharma.",
        "source": "T07n0220_564:0911c17_13"
    },
    {
        "source_sentence": "菩薩成就如是忍者，便於無上正等菩提堪得受記，亦名如來無所畏道。",
        "translation": "A bodhisattva who accomplishes such a ninja then is able to receive assurance of unsurpassed perfect enlightenment, which is also called the fearless path of the Tathāgata.",
        "source": "T07n0220_564:0911c18_14"
    },
    {
        "source_sentence": "若諸菩薩勤行此道，不得無上正等覺智、大智、妙智、自然智、一切智智及如來智，",
        "translation": "If bodhisattvas diligently practice this path, they won’t attain the unsurpassed knowledge of perfect enlightenment, great knowledge, marvelous knowledge, spontaneous knowledge, omniscience, and the knowledge of buddhas.",
        "source": "T07n0220_564:0911c20_15"
    },
    {
        "source_sentence": "無有是處。」",
        "translation": "There's no such place.",
        "source": "T07n0220_564:0911c22_16"
    },
    {
        "source_sentence": "具壽善現復白佛言：「菩薩為以諸法無生，於佛菩提得受記不？」",
        "translation": "Guoshou Shancheng then said to the Buddha, Does a bodhisattva receive assurance of enlightenment because the dharmas are unarisen?",
        "source": "T07n0220_564:0911c22_17"
    },
    {
        "source_sentence": "「不爾！",
        "translation": "It's not like that!",
        "source": "T07n0220_564:0911c23_18"
    },
    {
        "source_sentence": "善現！」",
        "translation": "Well done!",
        "source": "T07n0220_564:0911c24_19"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c24_20"
    },
    {
        "source_sentence": "若爾，菩薩云何受菩提記？」",
        "translation": "If that's the case, how did the bodhisattva receive the assurance of enlightenment?",
        "source": "T07n0220_564:0911c24_21"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0911c24_22"
    },
    {
        "source_sentence": "汝見有法於佛菩提得受記不？」",
        "translation": "Do you see any way to receive assurance of the Buddha's enlightenment?",
        "source": "T07n0220_564:0911c25_23"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0911c26_24"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0911c26_25"
    },
    {
        "source_sentence": "我不見法於佛菩提堪得受記，亦不見法於佛菩提有能證者，證時、證處及由此證、若所證法皆亦不見。」",
        "translation": "I don't see that the teaching is capable of receiving assurance of enlightenment in the Buddha's enlightenment, and I don't see that there's anyone who realizes the teaching in the Buddha's enlightenment, neither",
        "source": "T07n0220_564:0911c26_26"
    },
    {
        "source_sentence": "佛告善現：「以一切法不可得故，不應念言於佛菩提此是能證、此是所證。」",
        "translation": "The Buddha told Shancheng, Because all dharmas are unobtainable, you shouldn't think that this is what can be realized and this is what will be realized in the Buddha's enlightenment.",
        "source": "T07n0220_564:0911c28_27"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「如是般若波羅蜜多最為甚深、難見、難覺，畢竟離故，",
        "translation": "Śakra, lord of the gods, then said to the Buddha: The perfection of wisdom is so profound and difficult to see and difficult to apprehend because it is ultimately detached.",
        "source": "T07n0220_564:0912a01_28"
    },
    {
        "source_sentence": "非少善根諸有情類，能於如是甚深般若波羅蜜多書寫、聽聞、受持、讀誦。」",
        "translation": "It's not the case that sentient beings with few good roots can write, hear, retain, and recite such a profound prajñāpāramitā.",
        "source": "T07n0220_564:0912a03_29"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_564:0912a04_30"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_564:0912a05_31"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_564:0912a05_32"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_564:0912a05_33"
    },
    {
        "source_sentence": "假使於此贍部洲中，一切有情悉皆成就十善業道，如是福聚於能書寫、聽聞、受持、讀誦般若波羅蜜多甚深經典所獲功德，",
        "translation": "Suppose all sentient beings in this Jambudvīpa had accomplished the ten good paths of action, and such a stock of merit were to write, hear, retain, recite, and recite the profound scriptures of prajñāpārami",
        "source": "T07n0220_564:0912a06_0"
    },
    {
        "source_sentence": "百分不及一，千分不及一，乃至鄔波尼殺曇分亦不及一。」",
        "translation": "A hundred parts won't be one, a thousand parts won't be one, and even the part of Upanisakṣatra won't be one.",
        "source": "T07n0220_564:0912a08_1"
    },
    {
        "source_sentence": "時，有苾芻告天帝釋：「有於般若波羅蜜多書寫、聽聞、受持、讀誦，",
        "translation": "A monk then said to Śakra, lord of gods, “There are those who write, hear, retain, and recite the Perfection of Wisdom scriptures.",
        "source": "T07n0220_564:0912a10_2"
    },
    {
        "source_sentence": "所獲功德勝於仁者？」",
        "translation": "The merit that you've attained is superior to that of a benefactor?",
        "source": "T07n0220_564:0912a11_3"
    },
    {
        "source_sentence": "天帝釋言：「彼有情類初發心時尚勝於我，況於般若波羅蜜多書寫、聽聞、受持、讀誦、精勤修學、如理思惟！",
        "translation": "Śakra Devānām-Indra said, How could those sentient beings who first arouse their minds be superior to me when they write, hear, retain, recite, diligently cultivate, and correctly contemplate the Prajñāpār",
        "source": "T07n0220_564:0912a12_0"
    },
    {
        "source_sentence": "「苾芻當知！",
        "translation": "You should know, monks!",
        "source": "T07n0220_564:0912a14_1"
    },
    {
        "source_sentence": "彼有情類即是菩薩。",
        "translation": "Those sentient beings are bodhisattvas.",
        "source": "T07n0220_564:0912a14_2"
    },
    {
        "source_sentence": "如是菩薩所獲福聚，普勝一切世間天、人、阿素洛等。",
        "translation": "Thus, the accumulation of merit obtained by this bodhisattva is superior to all the worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_564:0912a15_3"
    },
    {
        "source_sentence": "如是菩薩所獲福聚，亦勝預流、一來、不還、應果、獨覺，亦勝菩薩遠離般若波羅蜜多方便善巧，",
        "translation": "Thus, the accumulation of merit obtained by this bodhisattva is superior to that of stream-winner, once-returner, nonreturner, worthy of reward, and solitary realizer, and it's superior to the bodhisatt",
        "source": "T07n0220_564:0912a16_4"
    },
    {
        "source_sentence": "修行布施、淨戒、安忍、精進、靜慮波羅蜜多及餘功德。",
        "translation": "He cultivates generosity, pure morality, patience, effort, the perfection of meditation, and other virtues.",
        "source": "T07n0220_564:0912a18_5"
    },
    {
        "source_sentence": "苾芻當知！",
        "translation": "You should know, monks!",
        "source": "T07n0220_564:0912a19_6"
    },
    {
        "source_sentence": "若諸菩薩如說修行甚深般若波羅蜜多方便善巧，是諸菩薩普勝一切世間天、人、阿素洛等，",
        "translation": "If bodhisattvas thus explain the profound cultivation of the skillful means of the perfection of wisdom, these bodhisattvas are superior to all worldly gods, humans, asuras, and so forth.",
        "source": "T07n0220_564:0912a19_7"
    },
    {
        "source_sentence": "世間天、人、阿素洛等皆應供養。",
        "translation": "Worldly gods, humans, asuras, and so forth should all make offerings.",
        "source": "T07n0220_564:0912a21_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0912a22_9"
    },
    {
        "source_sentence": "是諸菩薩於深般若波羅蜜多，能如說行究竟隨轉。",
        "translation": "These bodhisattvas can thus explain the practice of the profound prajñāpāramitā and ultimately follow it.",
        "source": "T07n0220_564:0912a22_10"
    },
    {
        "source_sentence": "是諸菩薩能紹一切智智種性令不斷絕，常不遠離諸佛世尊，常不遠離妙菩提座，",
        "translation": "These enlightening beings are able to develop the seed nature of omniscience and knowledge so that they never perish. They are always not far from the buddhas and world-honored ones, and they are always not far from the throne of enlighten",
        "source": "T07n0220_564:0912a24_0"
    },
    {
        "source_sentence": "常能濟拔溺生死泥諸有情類。",
        "translation": "He's always able to rescue sentient beings who are submerged in the mud of birth-and-death.",
        "source": "T07n0220_564:0912a25_1"
    },
    {
        "source_sentence": "是諸菩薩如是學時，常學菩薩所應學法，不學二乘所應學法。",
        "translation": "When bodhisattvas thus train, they always study the teachings that should be studied by bodhisattvas and don't study the teachings that should be studied by the two vehicles.",
        "source": "T07n0220_564:0912a26_2"
    },
    {
        "source_sentence": "諸天神等常隨擁護，四大天王來至其所供養恭敬，咸作是言：『善哉！",
        "translation": "The gods and goddesses always follow them, and the four great celestial kings come to offer support and respect, saying, 'Good!'",
        "source": "T07n0220_564:0912a28_0"
    },
    {
        "source_sentence": "大士！",
        "translation": "Great man!",
        "source": "T07n0220_564:0912a29_1"
    },
    {
        "source_sentence": "當勤精進學菩薩眾所應學法，疾當安坐妙菩提座，速證無上正等菩提。",
        "translation": "You must diligently and energetically study the teachings that should be studied by all the bodhisattvas, quickly sit quietly on the wonderful seat of enlightenment, and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_564:0912a29_2"
    },
    {
        "source_sentence": "如昔天王所奉四鉢，我亦當奉。』",
        "translation": "Just as the four bowls offered by the king of gods in the past, I will also offer them.'",
        "source": "T07n0220_564:0912b02_3"
    },
    {
        "source_sentence": "苾芻當知！",
        "translation": "You should know, monks!",
        "source": "T07n0220_564:0912b03_0"
    },
    {
        "source_sentence": "是諸菩薩，我等天帝尚往其所供養恭敬，況餘天神！",
        "translation": "These bodhisattvas, we gods and emperors, still go to their place to offer support and respect, so why wouldn't the other gods?",
        "source": "T07n0220_564:0912b03_1"
    },
    {
        "source_sentence": "苾芻當知！",
        "translation": "You should know, monks!",
        "source": "T07n0220_564:0912b04_2"
    },
    {
        "source_sentence": "是諸菩薩如是學時，一切如來及諸菩薩、諸天龍等常隨守護，由此因緣，",
        "translation": "When these bodhisattvas thus learn, all the Tathāgatas, bodhisattvas, celestial dragons, and so forth always follow them.",
        "source": "T07n0220_564:0912b04_3"
    },
    {
        "source_sentence": "世間危厄、身心憂苦皆不侵害，所有疾病亦復不起。",
        "translation": "The world's dangers and distress in body and mind won't be attacked, and all illnesses won't arise again.",
        "source": "T07n0220_564:0912b06_4"
    },
    {
        "source_sentence": "苾芻當知！",
        "translation": "You should know, monks!",
        "source": "T07n0220_564:0912b07_5"
    },
    {
        "source_sentence": "是諸菩薩獲如是等現法勝利，後世功德無量無邊。」",
        "translation": "These bodhisattvas attain such benefits in the present life, and their merits in the afterlife are immeasurable and limitless.",
        "source": "T07n0220_564:0912b07_6"
    },
    {
        "source_sentence": "時，阿難陀竊作是念：「天主帝釋為自辯才讚說如是菩薩功德，為是如來威神加被？」",
        "translation": "Ānanda then secretly thought, Did Indra, the lord of gods, praise such a bodhisattva's merit for his own eloquence and praise it for the Tathāgata's authoritative empowerment?",
        "source": "T07n0220_564:0912b08_7"
    },
    {
        "source_sentence": "時，天帝釋承佛威神，知阿難陀心之所念，白言：「大德！",
        "translation": "Knowing what Ānanda thought in his mind, Śakra Devānām-Indra, acting on the Buddha's authority, said, Mañjuśrī!",
        "source": "T07n0220_564:0912b10_8"
    },
    {
        "source_sentence": "非我辯才，皆是如來威神加被。」",
        "translation": "It's not my eloquence, but it's all the Tathāgata's authoritative empowerment.",
        "source": "T07n0220_564:0912b12_9"
    },
    {
        "source_sentence": "爾時，佛告阿難陀言：「如是！",
        "translation": "It was then that the Buddha addressed Ānanda, saying, So it is!",
        "source": "T07n0220_564:0912b12_10"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_564:0912b13_11"
    },
    {
        "source_sentence": "今天帝釋承佛威神能如是說。",
        "translation": "Today, Indra inherits the Buddha's authoritative power and can thus explain it.",
        "source": "T07n0220_564:0912b13_12"
    },
    {
        "source_sentence": "慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T07n0220_564:0912b14_13"
    },
    {
        "source_sentence": "若時菩薩於深般若波羅蜜多思惟修學，三千世界一切惡魔皆生疑怖，咸作是念：『此諸菩薩為於中間便證實際，",
        "translation": "“When enlightening beings deeply contemplate and practice these profound teachings of prajñāpāramitā, all the evil demons in the billion-world-galactic universe become doubtful and fearful, thinking:",
        "source": "T07n0220_564:0912b14_14"
    },
    {
        "source_sentence": "墮二乘地，為趣無上正等菩提轉妙法輪，空我境界。』」",
        "translation": "They'll fall into the stage of the two-vehicle teaching and turn the wonderful wheel of the Dharma in order to attain unsurpassed perfect enlightenment, which is the sphere of emptiness and self.'",
        "source": "T07n0220_564:0912b17_0"
    },
    {
        "source_sentence": "第五分修學品第二十一",
        "translation": "The Twenty-first Chapter of the Fifth Part of Cultivation",
        "source": "T07n0220_564:0912b19_0"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912b20_0"
    },
    {
        "source_sentence": "若時菩薩修學般若波羅蜜多，晝夜精勤常不捨離。",
        "translation": "If a bodhisattva then cultivates the perfection of wisdom, he's diligent day and night and doesn't abandon it.",
        "source": "T07n0220_564:0912b20_1"
    },
    {
        "source_sentence": "時，魔眷屬如箭入心，怖戰憂惶不任自處。",
        "translation": "The members of the demon's retinue then entered their minds like an arrow and became frightened and distressed, not letting go of their own place.",
        "source": "T07n0220_564:0912b21_2"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912b22_3"
    },
    {
        "source_sentence": "若時菩薩修學般若波羅蜜多，晝夜精勤將至究竟。",
        "translation": "If a bodhisattva cultivates the perfection of prajñāpāramitā day and night, his effort will reach its end.",
        "source": "T07n0220_564:0912b22_4"
    },
    {
        "source_sentence": "時，魔眷屬來至其所，化作種種可怖畏事，欲令菩薩身心驚惶，於大菩提暫退便足。",
        "translation": "At the time, Māra's retinue came to him, created various fearsome things, wanted to frighten the bodhisattva's body and mind, and withdrew at his feet for a moment in great enlightenment.",
        "source": "T07n0220_564:0912b23_5"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912b25_6"
    },
    {
        "source_sentence": "非諸菩薩修學般若波羅蜜多，皆為惡魔之所擾亂。",
        "translation": "It's not that bodhisattvas cultivating the perfection of wisdom are all disturbed by bad demons.",
        "source": "T07n0220_564:0912b25_7"
    },
    {
        "source_sentence": "若諸菩薩先世聞此甚深般若波羅蜜多，無信解心毀訾誹謗，是諸菩薩修學般若波羅蜜多，",
        "translation": "If bodhisattvas had heard this profound prajñāpāramitā in a previous life and didn't believe it, understand it, disparage it, or denigrate it, these are bodhisattvas who cultivate the perfection of wisdom.",
        "source": "T07n0220_564:0912b27_8"
    },
    {
        "source_sentence": "便為惡魔之所擾亂。",
        "translation": "They'll then be disturbed by a bad demon.",
        "source": "T07n0220_564:0912b29_9"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912b29_10"
    },
    {
        "source_sentence": "若諸菩薩聞深般若波羅蜜多，疑惑猶豫為有為無，是諸菩薩修學般若波羅蜜多，",
        "translation": "If bodhisattvas hear the profound prajñāpāramitā and doubt it as to whether it exists or not, these are bodhisattvas who cultivate the perfection of wisdom.",
        "source": "T07n0220_564:0912b29_11"
    },
    {
        "source_sentence": "便為惡魔之所擾亂。",
        "translation": "They'll then be disturbed by a bad demon.",
        "source": "T07n0220_564:0912c02_12"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912c03_13"
    },
    {
        "source_sentence": "若諸菩薩遠離善友，惡友攝持，不聞般若波羅蜜多甚深義處，由不聞故不知不見，",
        "translation": "If bodhisattvas are far removed from good friends and held by bad friends, they don't hear the profound meaning of the prajñāpāramitā, and because they don't hear it, they don't know or see it.",
        "source": "T07n0220_564:0912c03_14"
    },
    {
        "source_sentence": "云何修學甚深般若波羅蜜多？",
        "translation": "How do they cultivate the profound prajñāpāramitā?",
        "source": "T07n0220_564:0912c05_15"
    },
    {
        "source_sentence": "是諸菩薩修學般若波羅蜜多，便為惡魔之所擾亂。",
        "translation": "These bodhisattvas cultivate the perfection of wisdom, and they'll be disturbed by bad demons.",
        "source": "T07n0220_564:0912c06_16"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912c07_17"
    },
    {
        "source_sentence": "若諸菩薩攝受邪法，爾時，惡魔便作是念：『今此菩薩與我為伴，令無量人棄捨正法滿我所願。』",
        "translation": "If bodhisattvas take in wrong dharmas, then the bad demons will think, 'Now, this bodhisattva and I are my companions, causing measureless people to abandon the right teaching and fulfill my wishes.'",
        "source": "T07n0220_564:0912c07_18"
    },
    {
        "source_sentence": "是諸菩薩修學般若波羅蜜多，便為惡魔之所擾亂。",
        "translation": "These bodhisattvas cultivate the perfection of wisdom, and they'll be disturbed by bad demons.",
        "source": "T07n0220_564:0912c09_19"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912c10_20"
    },
    {
        "source_sentence": "若諸菩薩聞說般若波羅蜜多甚深經時，告餘菩薩：『如是般若波羅蜜多理趣甚深、難信難解，",
        "translation": "If bodhisattvas hear the profound teaching of the profound sūtras of the perfection of wisdom, they tell other bodhisattvas, 'Such is the profound and difficult to believe and difficult to understand principle and meaning of the perfection of wisdom.",
        "source": "T07n0220_564:0912c11_0"
    },
    {
        "source_sentence": "何用書寫、受持、讀誦？",
        "translation": "Why is there a need to write, memorize, and recite it?",
        "source": "T07n0220_564:0912c13_1"
    },
    {
        "source_sentence": "我尚不能得其源底，況餘薄福淺智者哉！』",
        "translation": "I still can't get the bottom of its source, so why wouldn't the other people with little merit and little wisdom?'",
        "source": "T07n0220_564:0912c13_2"
    },
    {
        "source_sentence": "是諸菩薩修學般若波羅蜜多，便為惡魔之所擾亂。",
        "translation": "These bodhisattvas cultivate the perfection of wisdom, and they'll be disturbed by bad demons.",
        "source": "T07n0220_564:0912c14_3"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912c15_4"
    },
    {
        "source_sentence": "若諸菩薩輕餘菩薩，謂作是言：『我能安住真遠離行，汝等皆無。』",
        "translation": "If bodhisattvas despise other bodhisattvas, they say, 'I can abide in peace and truly practice apart from them, but you are nonexistent.'",
        "source": "T07n0220_564:0912c15_5"
    },
    {
        "source_sentence": "爾時，惡魔歡喜慶快，是諸菩薩修學般若波羅蜜多，便為惡魔之所擾亂。",
        "translation": "At that point, the evil demon rejoices and is joyous, and those bodhisattvas who cultivate the perfection of wisdom will be disturbed by the evil demon.",
        "source": "T07n0220_564:0912c17_6"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0912c19_0"
    },
    {
        "source_sentence": "若時菩薩自恃名姓及所修行杜多功德，輕蔑諸餘修勝善法諸菩薩眾，常自稱讚毀訾他人，",
        "translation": "If a bodhisattva then relies on his name and the virtue of the many virtues he cultivates, despises the other bodhisattvas who cultivate superior good qualities, and always praises himself for disparaging others.",
        "source": "T07n0220_564:0912c19_1"
    },
    {
        "source_sentence": "無不退轉諸行、狀、相而謂自有，起煩惱業。",
        "translation": "There are no forms, shapes, or characteristics of nonretrogression that are said to exist on their own, and they give rise to afflictive actions.",
        "source": "T07n0220_564:0912c21_2"
    },
    {
        "source_sentence": "爾時，惡魔便大歡喜，作如是念：『今此菩薩令我境土宮殿不空，增益地獄、傍生、鬼界。』",
        "translation": "At that point, the evil demon then rejoiced greatly and thought, 'Now, this bodhisattva will cause my land and palace not to be empty in order to increase the number of hells, animals, and ghost realms.'",
        "source": "T07n0220_564:0912c22_3"
    },
    {
        "source_sentence": "是時，惡魔助其神力，令轉增益威力辯才，由此多人信受其語，因斯勸發同彼惡見，",
        "translation": "At that time, the evil Māra assisted them by means of his supernatural powers to increase their authority and eloquence. As a result, many people believed what he said and were encouraged to hold the same bad view as those [monks]",
        "source": "T07n0220_564:0912c24_4"
    },
    {
        "source_sentence": "同惡見已隨彼邪學，隨邪學已煩惱熾盛。",
        "translation": "They are the same as those who follow wrong training after having bad views, and whose afflictions are abundant after following wrong training.",
        "source": "T07n0220_564:0912c26_5"
    },
    {
        "source_sentence": "心顛倒故，所起三業皆能感得不可愛果，由此因緣增長惡趣，令魔宮殿轉更充滿，",
        "translation": "Because the mind is overturned, the three actions it produces are all capable of producing unpleasant results. As a result, bad destinies grow in strength and cause the palaces of Māra to be filled again and again.",
        "source": "T07n0220_564:0912c27_0"
    },
    {
        "source_sentence": "由此惡魔歡喜踊躍，諸有所作隨意自在，是諸菩薩修學般若波羅蜜多，",
        "translation": "Because of this, the evil Māra rejoices and jumps for joy, doing whatever he wishes.",
        "source": "T07n0220_564:0912c28_1"
    },
    {
        "source_sentence": "便為惡魔之所擾亂。",
        "translation": "They'll then be disturbed by a bad demon.",
        "source": "T07n0220_564:0913a01_2"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0913a02_0"
    },
    {
        "source_sentence": "若時菩薩與求聲聞、獨覺乘者更相毀蔑、鬪諍、誹謗，爾時惡魔便作是念：『今此菩薩雖遠菩提而不極遠，",
        "translation": "If the bodhisattva and those who seek the śrāvaka or pratyekabuddha vehicle disparage, fight, and slander each other, then that evil demon thinks, 'Now this bodhisattva is far from enlightenment but not",
        "source": "T07n0220_564:0913a02_1"
    },
    {
        "source_sentence": "雖近惡趣而不甚近。』",
        "translation": "Even though they're close to bad destinies, they aren't very close.'",
        "source": "T07n0220_564:0913a04_2"
    },
    {
        "source_sentence": "若時菩薩與菩薩乘善男子等更相毀蔑、鬪諍、誹謗，爾時惡魔便作是念：『此二菩薩極遠菩提甚近惡趣。』",
        "translation": "If the bodhisattvas and the good men of the bodhisattva vehicle then disparage, fight, and denigrate each other, then Māra thinks, 'These two bodhisattvas are so far removed from enlightenment and so close to",
        "source": "T07n0220_564:0913a05_3"
    },
    {
        "source_sentence": "作是念已歡喜踊躍，增其威勢，令二朋黨鬪諍不息，使餘無量無邊有情皆於大乘深心厭離，",
        "translation": "Having thought thus, they rejoiced and jumped for joy. Increasing their might, they caused the two groups of followers to quarrel without cease. So that other infinite and boundless sentient beings were deeply disillusioned with",
        "source": "T07n0220_564:0913a07_4"
    },
    {
        "source_sentence": "是諸菩薩修學般若波羅蜜多，便為惡魔之所擾亂。",
        "translation": "These bodhisattvas cultivate the perfection of wisdom, and they'll be disturbed by bad demons.",
        "source": "T07n0220_564:0913a09_5"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0913a10_6"
    },
    {
        "source_sentence": "若諸菩薩未得菩提不退轉記，於得菩提不退轉記諸菩薩所起損害心，鬪諍、輕蔑、罵辱、誹謗，",
        "translation": "If bodhisattvas who haven’t yet attained enlightenment and aren’t turning away from it become harmful to the bodhisattvas who have attained enlightenment and aren’t turning away from it, they fight, despise",
        "source": "T07n0220_564:0913a10_7"
    },
    {
        "source_sentence": "是諸菩薩隨起爾所念不饒益心，還退爾所劫曾修勝行，經爾所時遠離善友，",
        "translation": "These bodhisattvas give rise to such thoughts that are unbeneficial, regress in such eons, cultivates such practices, and becomes far removed from good friends at such a time.",
        "source": "T07n0220_564:0913a13_8"
    },
    {
        "source_sentence": "還受爾所生死繫縛。",
        "translation": "They'll still be bound by these kinds of birth-and-death bonds.",
        "source": "T07n0220_564:0913a14_9"
    },
    {
        "source_sentence": "若不棄捨大菩提心，還爾所劫被弘誓鎧勤修勝行時無間斷，然後乃補爾所功德。」",
        "translation": "If someone doesn't abandon the mind of great enlightenment and returns to such an eon, they'll be disciplined by the armor of great vows and diligently cultivate superior practices without interruption, and then they'll replenish",
        "source": "T07n0220_564:0913a15_10"
    },
    {
        "source_sentence": "爾時，慶喜便白佛言：「是諸菩薩所起惡心生死罪苦，為要流轉經爾所時，",
        "translation": "At that time, the Licchavi Vimalakīrti said to the Buddha: These are the sins and pains of birth and death committed by bodhisattvas with bad intentions.",
        "source": "T07n0220_564:0913a17_11"
    },
    {
        "source_sentence": "為於中間亦得出離？",
        "translation": "Why are they also liberated in the middle?",
        "source": "T07n0220_564:0913a18_12"
    },
    {
        "source_sentence": "是諸菩薩所退勝行，為要精勤經爾所劫時無間斷然後乃補，為於中間有復本義？」",
        "translation": "Is this the superior practice of the bodhisattvas that they regress, which requires exertion for such an eon to be uninterruptedly eliminated and then repaired, or is there another original meaning in between?",
        "source": "T07n0220_564:0913a19_13"
    },
    {
        "source_sentence": "佛告慶喜：「我為菩薩、獨覺、聲聞，說有出罪還補善法。",
        "translation": "The Buddha told Qingxi, For bodhisattvas, pratyekabuddhas, and śrāvakas, I say that there's a way to remove sins and return to the good Dharma.",
        "source": "T07n0220_564:0913a21_14"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T07n0220_564:0913a22_15"
    },
    {
        "source_sentence": "若諸菩薩造此罪後，心無慚愧懷惡不捨，不能如法發露悔過。",
        "translation": "If bodhisattvas commit these sins, their minds are unashamed and harbor bad feelings that they won't abandon, and they can't reveal their repentance according to the teaching.",
        "source": "T07n0220_564:0913a22_16"
    },
    {
        "source_sentence": "我說彼類，於其中間無出罪苦還補善義。",
        "translation": "Among them, I say that there is no meaning of turning away from the suffering of transgressions and returning to what is wholesome.",
        "source": "T07n0220_564:0913a24_0"
    },
    {
        "source_sentence": "「若諸菩薩造此罪後，深生慚愧心不繫惡，尋能如法發露悔過，作如是念：『我今已得難得人身，",
        "translation": "“If enlightening beings, having committed these sins, become deeply ashamed and not clinging to evil in their minds, then they can reveal their repentance in accordance with the Dharma. They think, ‘Now that I have attained this rare",
        "source": "T07n0220_564:0913a24_1"
    },
    {
        "source_sentence": "何容復起如是過惡失大善利？",
        "translation": "How is it possible to produce such faults and lose great benefits of goodness?",
        "source": "T07n0220_564:0913a27_2"
    },
    {
        "source_sentence": "我應饒益一切有情，何乃於中反作衰損？",
        "translation": "I should give benefit to all sentient beings, so why would I again and again harm them?",
        "source": "T07n0220_564:0913a27_3"
    },
    {
        "source_sentence": "我應恭敬一切有情如僕事主，何乃於中反生憍慢、毀辱、凌蔑？",
        "translation": "I should respect all sentient beings as servants and masters, so why should I become conceited, disrespectful, and despised by them?",
        "source": "T07n0220_564:0913a28_4"
    },
    {
        "source_sentence": "我應忍受一切有情捶打訶罵，何容於彼反以暴惡身語加報？",
        "translation": "I should tolerate all sentient beings being beaten and scolded, so why should I allow them to be reprimanded with violent physical and verbal abuse?",
        "source": "T07n0220_564:0913b01_5"
    },
    {
        "source_sentence": "我應和解一切有情令相敬愛，何容復起勃惡語言與彼乖諍？",
        "translation": "I should reconcile all sentient beings and make them respect each other, so that they won't allow me to speak harshly and disagree with them.",
        "source": "T07n0220_564:0913b02_6"
    },
    {
        "source_sentence": "我應堪耐一切有情長時履踐，猶如道路亦如橋梁，何容於彼反加凌辱？",
        "translation": "I should be able to tolerate all sentient beings walking for a long time, just like a road or a bridge, so how could I allow them to repeatedly abuse me?",
        "source": "T07n0220_564:0913b03_7"
    },
    {
        "source_sentence": "我求無上正等菩提，為拔有情生死大苦，令得究竟安樂涅槃，何容反欲加之以苦？",
        "translation": "I seek unsurpassed perfect enlightenment in order to remove the great suffering of birth and death for sentient beings and cause them to attain ultimately peaceful nirvāṇa, so how can I add suffering to it with desire instead?",
        "source": "T07n0220_564:0913b05_8"
    },
    {
        "source_sentence": "我應從今盡未來際，如愚、如啞、如聾、如盲，於諸有情無所分別。",
        "translation": "From now until the end of time, I should be like a fool, like a dumb, like a deaf, and like a blind man, not discriminating among sentient beings.",
        "source": "T07n0220_564:0913b07_9"
    },
    {
        "source_sentence": "假使斬截頭足手臂、挑目、割耳、劓鼻、截舌、鋸解一切身分支體，於彼有情終不起惡。",
        "translation": "Suppose someone were to cut off their head, feet, arms, eyebrows, eyes, ears, mucus, nose, tongue, and amputate all the body parts of their identity, and they would never do evil to those sentient beings",
        "source": "T07n0220_564:0913b08_10"
    },
    {
        "source_sentence": "若我起惡，即便退壞所發無上正等覺心，障礙所求一切智智，不能利益安樂有情。』",
        "translation": "If I give rise to evil, then even the mind of unsurpassed perfect enlightenment that arises from retrogression and disintegration will obstruct the omniscience and cognition that's sought, which can't benefit and bring comfort to senti",
        "source": "T07n0220_564:0913b10_11"
    },
    {
        "source_sentence": "慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T07n0220_564:0913b12_12"
    },
    {
        "source_sentence": "是諸菩薩，我說中間有出罪苦還補善義，非要經於爾所劫數，惡魔於彼不能擾亂，",
        "translation": "These bodhisattvas, I teach that there's the meaning of liberation from sin and suffering and returning to goodness in between. It doesn't need to go through such a number of eons, for bad demons won't disturb them.",
        "source": "T07n0220_564:0913b12_13"
    },
    {
        "source_sentence": "疾證無上正等菩提。",
        "translation": "He quickly realizes unsurpassed perfect enlightenment.",
        "source": "T07n0220_564:0913b14_14"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_564:0913b15_15"
    },
    {
        "source_sentence": "諸菩薩眾與求聲聞、獨覺乘者不應交涉，設與交涉不應共住，設與共住不應與彼論義決擇，",
        "translation": "The bodhisattvas and those seeking the vehicle of śrāvakas and pratyekbuddhas shouldn't engage in disputes, and if they engage in disputes, they shouldn't live together, and if they live together, they shouldn't",
        "source": "T07n0220_564:0913b15_16"
    },
    {
        "source_sentence": "勿因此故起忿恚心，或復令生麁惡言說，便礙無上正等菩提，亦壞無邊菩薩行法。",
        "translation": "Don't give rise to angry thoughts because of this, or else cause angry words to arise, which will obstruct unsurpassed perfect enlightenment and destroy the limitless bodhisattva practices.",
        "source": "T07n0220_564:0913b17_17"
    },
    {
        "source_sentence": "若諸菩薩與菩薩乘善男子等共住相視，尊重敬事應如大師，復作是念：『彼是我等真淨善友，",
        "translation": "If bodhisattvas and the good men of the bodhisattva vehicle were to live together, look at each other with respect and reverence, they would be like a great teacher. Again, they might think, 'This is our truly pure friend!'",
        "source": "T07n0220_564:0913b19_18"
    },
    {
        "source_sentence": "同載一船、同一所趣、同行一道、同一事業，學時、學處及所學法、若由此學皆無有異。』",
        "translation": "They carry the same boat, the same destination, the same traveler, the same path of fellow practitioners, and the same undertaking, and there's no difference between when they train, where they train, and the teachings they teach, or if they",
        "source": "T07n0220_564:0913b21_19"
    },
    {
        "source_sentence": "復作是念：『若彼菩薩住雜作意，我當於中不同彼學；",
        "translation": "Again, they think: If those bodhisattvas abide in mixed attention, I should learn differently from them.",
        "source": "T07n0220_564:0913b23_20"
    },
    {
        "source_sentence": "若彼菩薩離雜作意，我當於中常同彼學。』",
        "translation": "If that bodhisattva is free of mixed contemplation, I'll always train with them in it.'",
        "source": "T07n0220_564:0913b24_21"
    },
    {
        "source_sentence": "若諸菩薩如是學時，疾證所求一切智智。」",
        "translation": "If bodhisattvas thus train, they'll quickly realize the omniscience and cognition they seek.",
        "source": "T07n0220_564:0913b25_22"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「若諸菩薩為盡故學，為不生故學，為離故學，",
        "translation": "It was then that the good manifestation said to the Buddha, Suppose bodhisattvas train for the sake of exhaustion, for the sake of nonproduction, and for the sake of separation.",
        "source": "T07n0220_564:0913b26_23"
    },
    {
        "source_sentence": "為滅故學，是學一切智智不？」",
        "translation": "Is this training for the sake of cessation, which is training in omniscience?",
        "source": "T07n0220_564:0913b28_24"
    },
    {
        "source_sentence": "佛告善現：「若諸菩薩如是學時，非學一切智智。」",
        "translation": "The Buddha told Shancheng, If bodhisattvas thus train, they aren't training in omniscience and cognition.",
        "source": "T07n0220_564:0913b28_25"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何緣菩薩如是學時，非學一切智智？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's the reason why a bodhisattva doesn't train in omniscience when he thus trains?",
        "source": "T07n0220_564:0913b29_26"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0913c02_27"
    },
    {
        "source_sentence": "佛證真如極圓滿故，說名如來、應、正等覺，如是真如可說為盡乃至滅不？」",
        "translation": "Because the Buddha realizes that the true nature is perfectly complete, he says it's called the Tathāgata, Arhat, and Completely Enlightened One, so can this true nature be described as exhaustive or even cessation?",
        "source": "T07n0220_564:0913c02_28"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0913c04_29"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0913c04_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_564:0913c04_31"
    },
    {
        "source_sentence": "真如無相，不可說盡乃至滅故。」",
        "translation": "The true nature has no marks, so it can't be described as exhausted or even ceased.",
        "source": "T07n0220_564:0913c04_32"
    },
    {
        "source_sentence": "佛告善現：「是故菩薩如是學時，非學一切智智。",
        "translation": "The Buddha told Shancheng, Therefore, when a bodhisattva thus trains, he doesn't train in omniscience.",
        "source": "T07n0220_564:0913c05_33"
    },
    {
        "source_sentence": "若諸菩薩不為盡故學，乃至不為滅故學，如是學時，是學一切智智，亦學般若波羅蜜多，",
        "translation": "If bodhisattvas don't train for the sake of exhaustion and don't train for the sake of cessation, when they train in this way, they're training in omniscience and also training in the perfection of prajñāpāramitā.",
        "source": "T07n0220_564:0913c06_34"
    },
    {
        "source_sentence": "亦學佛地、力、無畏等無邊佛法。",
        "translation": "They also train in the limitless buddha-dharmas like the Buddha's ground, power, fearlessness, and so forth.",
        "source": "T07n0220_564:0913c08_35"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_564:0913c09_36"
    },
    {
        "source_sentence": "若諸菩薩如是學時，至一切學究竟彼岸，天魔外道皆不能伏，息除諸惡眾善圓滿，",
        "translation": "If bodhisattvas thus train, they'll reach the other shore of all their training, but gods and Māra and non-Buddhists won't be able to subdue them, extinguishing evil and pursuing goodness",
        "source": "T07n0220_564:0913c09_37"
    },
    {
        "source_sentence": "少分有情能如是學，是故菩薩欲墮極少有情數者，當勤修學甚深般若波羅蜜多方便善巧。」",
        "translation": "A small number of sentient beings can thus train, so bodhisattvas who want to fall into the category of extremely few sentient beings should diligently cultivate the skillful means of the profound prajñāpāramitā.",
        "source": "T07n0220_564:0913c11_38"
    },
    {
        "source_sentence": "第五分根栽品第二十二之一",
        "translation": "The Twenty-second Part of the Chapter on Cultivating the Roots of the Fifth Part",
        "source": "T07n0220_564:0913c14_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_564:0913c15_0"
    },
    {
        "source_sentence": "若諸菩薩如是修學甚深般若波羅蜜多方便善巧，不起根栽俱行之心，不起慳悋、犯戒、瞋忿、懈怠、散動、惡慧、猶豫俱行之心。",
        "translation": "If bodhisattvas thus cultivate the profound prajñāpāramitā with skillful means, they won't give rise to the mind that acts together with roots and plants, and they won't give rise to the mind that",
        "source": "T07n0220_564:0913c15_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_564:0913c18_2"
    },
    {
        "source_sentence": "若諸菩薩如是修學甚深般若波羅蜜多方便善巧，能攝一切波羅蜜多。",
        "translation": "If bodhisattvas thus cultivate the profound prajñāpāramitā with skillful means, they'll be able to gather all the perfections.",
        "source": "T07n0220_564:0913c18_3"
    },
    {
        "source_sentence": "譬如身見能具攝受六十二見，如是般若波羅蜜多攝受一切波羅蜜多。",
        "translation": "Just as belief in a self can fully embrace the sixty-two views, so does the prajñāpāramitā embrace all the perfections.",
        "source": "T07n0220_564:0913c19_4"
    },
    {
        "source_sentence": "譬如命根遍能攝受所餘諸根，命根滅時諸根隨滅，如是般若波羅蜜多攝受一切波羅蜜多，",
        "translation": "It's like when the life root universally encompasses all the other faculties, and when the life root ceases, the faculties follow its cessation. Thus, the prajñāpāramitā embraces all the perfections",
        "source": "T07n0220_564:0913c21_5"
    },
    {
        "source_sentence": "若失般若波羅蜜多則失一切波羅蜜多。",
        "translation": "If someone loses the perfection of prajñāpāramitā, they'll lose all the perfections.",
        "source": "T07n0220_564:0913c23_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0913c24_7"
    },
    {
        "source_sentence": "甚深般若波羅蜜多能持一切殊勝善法，能滅一切惡不善法。",
        "translation": "The profound prajñāpāramitā can maintain all excellent good qualities and extinguish all bad and unskillful qualities.",
        "source": "T07n0220_564:0913c24_8"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T07n0220_564:0913c26_9"
    },
    {
        "source_sentence": "若諸菩薩欲攝一切波羅蜜多，應學般若波羅蜜多。",
        "translation": "If bodhisattvas want to gather all the perfections, they should train in the perfection of wisdom.",
        "source": "T07n0220_564:0913c26_10"
    },
    {
        "source_sentence": "若諸菩薩能學般若波羅蜜多，於諸有情最尊最勝。",
        "translation": "If bodhisattvas can train in the perfection of wisdom, they'll be the most honored and superior among sentient beings.",
        "source": "T07n0220_564:0913c27_11"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_564:0913c28_12"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_564:0913c29_13"
    },
    {
        "source_sentence": "於此三千大千世界諸有情類寧為多不？」",
        "translation": "How many sentient beings are there in this 3,000 great one-thousand worlds?",
        "source": "T07n0220_564:0913c29_14"
    },
    {
        "source_sentence": "善現對曰：「甚多！",
        "translation": "Shancheng replied, Very much so!",
        "source": "T07n0220_564:0914a01_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0914a01_16"
    },
    {
        "source_sentence": "贍部洲中諸有情類其數尚多，況三千界！」",
        "translation": "The number of sentient beings in Jambudvīpa is still numerous, so why wouldn't there be 3,000 realms?",
        "source": "T07n0220_564:0914a01_17"
    },
    {
        "source_sentence": "佛告善現：「假使三千大千世界一切有情皆成菩薩，一一皆以上妙樂具，",
        "translation": "The Buddha told the good manifestation, Suppose all sentient beings in the 3,000 great one-thousand worlds become bodhisattvas, and each of them are endowed with the marvelous comforts above.",
        "source": "T07n0220_564:0914a02_18"
    },
    {
        "source_sentence": "盡壽供養一切有情。",
        "translation": "He'll spend his whole life making offerings to all sentient beings.",
        "source": "T07n0220_564:0914a04_19"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_564:0914a04_20"
    },
    {
        "source_sentence": "是諸菩薩由此因緣得福多不？」",
        "translation": "Is it because of these causes and conditions that the bodhisattvas attain much merit?",
        "source": "T07n0220_564:0914a05_21"
    },
    {
        "source_sentence": "善現對曰：「甚多！",
        "translation": "Shancheng replied, Very much so!",
        "source": "T07n0220_564:0914a05_22"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0914a06_23"
    },
    {
        "source_sentence": "佛告善現：「若有菩薩修學般若波羅蜜多如彈指頃，其福勝彼無量無邊。",
        "translation": "The Buddha told Shancheng, If a bodhisattva cultivates the perfection of prajñāpāramitā for as long as it takes to snap his fingers, his merit will be greater than theirs without measure or limit.",
        "source": "T07n0220_564:0914a06_24"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0914a07_25"
    },
    {
        "source_sentence": "甚深般若波羅蜜多具大義用，能攝無上正等菩提。",
        "translation": "The profound prajñāpāramitā has great meaning and function, which can gather the unsurpassed perfect enlightenment.",
        "source": "T07n0220_564:0914a08_26"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T07n0220_564:0914a09_27"
    },
    {
        "source_sentence": "若諸菩薩欲證無上正等菩提，欲為一切有情上首，欲普饒益一切有情，",
        "translation": "“Furthermore, if enlightening beings want to attain unexcelled perfect enlightenment, they want to be the leaders of all sentient beings and wish to benefit all sentient beings.",
        "source": "T07n0220_564:0914a09_28"
    },
    {
        "source_sentence": "欲為一切有情依怙，欲證一切圓滿佛法，欲行諸佛所行境界，欲遊戲佛所遊戲處，",
        "translation": "They want to be relied upon by all sentient beings, want to realize all perfect buddha-teachings, want to practice the sphere of action of buddhas, want to play in the Buddha’s play-field.",
        "source": "T07n0220_564:0914a11_29"
    },
    {
        "source_sentence": "欲作諸佛大師子吼，欲以一音為三千界一切有情宣說正法普令一切獲大饒益，",
        "translation": "They want to make the great lion’s roar of the buddhas, wanting to teach the right teaching to all sentient beings in the billion-world universe with one voice, so that all may attain great benefit.",
        "source": "T07n0220_564:0914a13_30"
    },
    {
        "source_sentence": "當學般若波羅蜜多。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T07n0220_564:0914a15_0"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_564:0914a15_1"
    },
    {
        "source_sentence": "我曾不見有諸菩薩修學般若波羅蜜多，而不能得世、出世間功德勝利。」",
        "translation": "I've never seen bodhisattvas cultivate the perfection of wisdom that can't attain worldly or supramundane merits and benefits.",
        "source": "T07n0220_564:0914a15_2"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「菩薩修學甚深般若波羅蜜多，豈亦能得聲聞、獨覺功德善根？」",
        "translation": "It was then that Shancheng said to the Buddha, How could a bodhisattva cultivate the profound prajñāpāramitā and attain the good roots of the merits of śrāvakas and pratyekbuddhas?",
        "source": "T07n0220_564:0914a17_3"
    },
    {
        "source_sentence": "佛告善現：「聲聞、獨覺功德善根，此菩薩眾亦皆能得，但於其中心不樂住；",
        "translation": "The Buddha said to the good manifestation, śrāvakas and pratyekabuddhas are also able to attain roots of goodness in virtue. These enlightening beings can attain them all but do not abide delightedly in their center",
        "source": "T07n0220_564:0914a19_4"
    },
    {
        "source_sentence": "以勝智見無倒觀察，超過聲聞及獨覺地，為彼開示令皆證得。",
        "translation": "With superior wisdom, he sees without error and observes, transcending the stages of śrāvakas and pratyekbuddhas, revealing it to them so that they all realize it.",
        "source": "T07n0220_564:0914a20_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_564:0914a22_6"
    },
    {
        "source_sentence": "若諸菩薩如是學時，則為一切世間天、人、阿素洛等真淨福田，超諸世間聲聞、獨覺福田之上，",
        "translation": "If bodhisattvas thus train, they are truly pure fields of merit for all the gods, humans, and asuras of the world, surpassing the fields of merit of śrāvakas and pratyekbuddhas of the world.",
        "source": "T07n0220_564:0914a22_7"
    },
    {
        "source_sentence": "疾能證得一切智智，常不捨離甚深般若波羅蜜多。",
        "translation": "They quickly realize omniscience and knowledge, always not abandoning the profound prajñāpāramitā.",
        "source": "T07n0220_564:0914a24_8"
    },
    {
        "source_sentence": "菩薩若能修行般若波羅蜜多，當知已於一切智智得不退轉，遠離聲聞、獨覺等地，",
        "translation": "If bodhisattvas can cultivate the perfection of wisdom, they should know that they've attained nonregression in omniscience and cognition, are far removed from the stages of śrāvakas and pratyekbuddhas,",
        "source": "T07n0220_564:0914a25_9"
    },
    {
        "source_sentence": "親近無上正等菩提。",
        "translation": "They'll become intimate with unsurpassed perfect enlightenment.",
        "source": "T07n0220_564:0914a27_10"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_564:0914a28_11"
    },
    {
        "source_sentence": "若諸菩薩作如是念：『此是般若波羅蜜多，我由般若波羅蜜多，當能引發一切智智。』",
        "translation": "If bodhisattvas think, 'This is the perfection of wisdom, and it's because of the perfection of wisdom that I will be able to give rise to omniscience.'",
        "source": "T07n0220_564:0914a28_12"
    },
    {
        "source_sentence": "是諸菩薩非行般若波羅蜜多，亦於般若波羅蜜多不知不見。",
        "translation": "These bodhisattvas who aren't practicing the perfection of wisdom also don't know or see the perfection of wisdom.",
        "source": "T07n0220_564:0914b01_13"
    },
    {
        "source_sentence": "若諸菩薩不作是念：『此是般若波羅蜜多，我由般若波羅蜜多，當能引發一切智智。』",
        "translation": "If bodhisattvas don't think, 'This is the perfection of wisdom, I will be able to give rise to omniscience and cognition because of the perfection of wisdom.'",
        "source": "T07n0220_564:0914b02_14"
    },
    {
        "source_sentence": "是諸菩薩是行般若波羅蜜多，亦於般若波羅蜜多能知能見。",
        "translation": "These bodhisattvas are practitioners of the perfection of wisdom, and they can also know and see the perfection of wisdom.",
        "source": "T07n0220_564:0914b04_15"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_564:0914b05_16"
    },
    {
        "source_sentence": "若諸菩薩不見般若波羅蜜多，不聞、不覺、不知般若波羅蜜多，於不見、聞、覺、知諸法亦不分別，",
        "translation": "If bodhisattvas don't see the perfection of wisdom and don't hear, perceive, or know the perfection of wisdom, and they don't discriminate between what they don't see, hear, perceive, or know the teachings,",
        "source": "T07n0220_564:0914b06_17"
    },
    {
        "source_sentence": "是行般若波羅蜜多。」",
        "translation": "This is the practice of prajñāpāramitā.",
        "source": "T07n0220_564:0914b08_18"
    },
    {
        "source_sentence": "時，天帝釋作是念言：「若諸菩薩修行般若波羅蜜多，尚勝一切有情之類，",
        "translation": "Śakra Devānām-Indra then had this thought, saying, If bodhisattvas cultivate the perfection of wisdom, they're still superior to all types of sentient beings.",
        "source": "T07n0220_564:0914b08_19"
    },
    {
        "source_sentence": "況得無上正等菩提！",
        "translation": "How could he attain unsurpassed perfect enlightenment!",
        "source": "T07n0220_564:0914b10_20"
    },
    {
        "source_sentence": "若諸有情聞說一切智智名字深生信解，尚為獲得人中善利及得世間最勝壽命，",
        "translation": "If sentient beings hear and profoundly believe the names of omniscience and knowledge, they'll still attain good fortune among humans and the most excellent life span in the world.",
        "source": "T07n0220_564:0914b10_21"
    },
    {
        "source_sentence": "況發無上正等覺心，或能聽聞甚深般若波羅蜜多！",
        "translation": "How could they give rise to the mind of unsurpassed perfect enlightenment or hear the profound prajñāpāramitā?",
        "source": "T07n0220_564:0914b12_22"
    },
    {
        "source_sentence": "是諸有情世間敬愛，當能調御一切有情。」",
        "translation": "These are the worldly respects of sentient beings who will be able to tame all sentient beings.",
        "source": "T07n0220_564:0914b13_23"
    },
    {
        "source_sentence": "作是念已，即便化作微妙音花，捧散如來及諸菩薩。",
        "translation": "After he had this thought, he transformed himself into a flower of subtle sound and held the Tathāgata and the bodhisattvas in his arms.",
        "source": "T07n0220_564:0914b14_24"
    },
    {
        "source_sentence": "既散華已，作是願言：「若諸菩薩求趣無上正等菩提，以我所生善根功德，",
        "translation": "Having scattered the flowers, they made this vow, saying, “If enlightening beings seek supreme perfect enlightenment, by means of the virtues of the roots of goodness that I produce,",
        "source": "T07n0220_564:0914b16_0"
    },
    {
        "source_sentence": "願彼佛法速得圓滿，願彼所求一切智法及無漏法速得圓滿。」",
        "translation": "May their buddha-dharma quickly be perfected, and may all the knowledge and uncontaminated dharmas they seek quickly be perfected.",
        "source": "T07n0220_564:0914b17_1"
    },
    {
        "source_sentence": "作是願已，便白佛言：「若菩薩乘善男子等，已發無上正等覺心，我終不生一念異意，",
        "translation": "Having made this vow, they said to the Buddha: Good men and women of the bodhisattva vehicle, having set their minds on supreme perfect enlightenment, I will never give rise to a thought of distaste.",
        "source": "T07n0220_564:0914b19_2"
    },
    {
        "source_sentence": "令其退轉大菩提心；",
        "translation": "Causing them to turn away from the determination for enlightenment.",
        "source": "T07n0220_564:0914b20_3"
    },
    {
        "source_sentence": "我終不生一念異意，令諸菩薩厭大菩提，退住聲聞、獨覺等地；",
        "translation": "I do not give rise to a single thought of distastefulness in my mind that causes enlightening beings to become disillusioned with great awakening and turn away from the stages of listeners and solitary realizers.",
        "source": "T07n0220_564:0914b21_4"
    },
    {
        "source_sentence": "我終不起一念異心，令諸菩薩退失大悲相應作意。",
        "translation": "I never give rise to a single thought of dissimilar mind that causes bodhisattvas to regress from the contemplation associated with great compassion.",
        "source": "T07n0220_564:0914b22_5"
    },
    {
        "source_sentence": "若諸菩薩已發大心，我願彼心倍復增進，願彼菩薩見生死中種種苦已，",
        "translation": "If all enlightening beings have undertaken great determination, I wish their minds to be doubled and further increased. May they see the various miseries of birth and death",
        "source": "T07n0220_564:0914b24_6"
    },
    {
        "source_sentence": "為欲利樂世間天、人、阿素洛等，發起種種堅固大願：『我既自度，亦當精勤度未度者；",
        "translation": "In order to benefit the gods, humans, and asuras of the world, they undertake various firm great vows:",
        "source": "T07n0220_564:0914b25_7"
    },
    {
        "source_sentence": "我既自脫，亦當精勤脫未脫者；",
        "translation": "Since I am liberated by myself, I should also exert myself to liberate those who are not liberated.",
        "source": "T07n0220_564:0914b27_8"
    },
    {
        "source_sentence": "我既自安，亦當精勤安未安者；",
        "translation": "Since I am self-assured, I should also exert myself to bring peace to those who are not.",
        "source": "T07n0220_564:0914b28_9"
    },
    {
        "source_sentence": "我既自證究竟涅槃，亦當精勤令未證者皆同證得究竟涅槃。』",
        "translation": "Since I've realized the ultimate nirvāṇa for myself, I will also exert myself so that those who haven't realized it will all realize the ultimate nirvāṇa.'",
        "source": "T07n0220_564:0914b29_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0914c01_1"
    },
    {
        "source_sentence": "若有情類於初發心菩薩功德深心隨喜，得幾所福？",
        "translation": "If there are sentient beings who deeply rejoice in the virtues of the first arousal of mind as bodhisattvas, how much merit will they attain?",
        "source": "T07n0220_564:0914c01_2"
    },
    {
        "source_sentence": "於久發心修諸勝行菩薩功德、於不退轉地菩薩功德、於一生所繫菩薩功德深心隨喜，",
        "translation": "He was deeply delighted at the enlightening being’s virtue of long-standing determination for supreme practice, the enlightening being’s virtue of nonregressing in all directions, and the enlightening being’s virtue",
        "source": "T07n0220_564:0914c02_3"
    },
    {
        "source_sentence": "得幾所福？」",
        "translation": "How much merit will they attain?",
        "source": "T07n0220_564:0914c04_4"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「妙高山王可知兩數，此有情類隨喜俱心所生福德不可知量，",
        "translation": "It was then that the Buddha addressed Śakra, lord of the gods, saying: Marvelous high mountain king, you may know the number of these sentient beings in two ways. The virtues produced by these sentient beings who are joyful and",
        "source": "T07n0220_564:0914c04_5"
    },
    {
        "source_sentence": "乃至三千大千世界可知兩數，此有情類隨喜俱心所生福德不可知量。」",
        "translation": "Up to 3,000 great one-thousand worlds can be known in two ways, and the merits that arise from these sentient beings' minds accompanied by joy are incalculable.",
        "source": "T07n0220_564:0914c06_6"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「若諸有情於諸菩薩從初發心乃至得佛功德善根不生隨喜，",
        "translation": "Śakra, lord of the gods, then again said to the Buddha: Sentient beings who do not give rise to delight in the virtues and roots of enlightenment of the bodhisattvas from the very first moment of their aspira",
        "source": "T07n0220_564:0914c08_7"
    },
    {
        "source_sentence": "或復於彼隨喜功德不聞不知，當知皆是魔所執持、魔所魅著、魔之朋黨，",
        "translation": "They may rejoice in the virtues of those who don’t hear and don’t know, but you should know that they are all held by Māra, addicted by Māra, or belonging to Māra’s retinue.",
        "source": "T07n0220_564:0914c10_8"
    },
    {
        "source_sentence": "魔天界歿來生此間。",
        "translation": "Māra and the gods of the realm of desire come to be born here.",
        "source": "T07n0220_564:0914c11_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_564:0914c12_10"
    },
    {
        "source_sentence": "若諸菩薩發菩提心修菩薩行，得不退轉至究竟位，有能於彼起隨喜心，",
        "translation": "“Furthermore, if enlightening beings develop the determination for enlightenment and carry out the practice of enlightening beings, attaining nonbacksliding to the ultimate state, there are those who can give rise to joy",
        "source": "T07n0220_564:0914c12_11"
    },
    {
        "source_sentence": "定能破壞眾魔眷屬，疾能證得一切智智。",
        "translation": "He's certainly capable of destroying the members of Māra's retinue, and he quickly realizes omniscience.",
        "source": "T07n0220_564:0914c14_12"
    },
    {
        "source_sentence": "若諸有情深心敬愛佛、法、僧寶，隨所生處常欲見佛、聞法、遇僧，於諸菩薩功德善根，",
        "translation": "“Furthermore, if all sentient beings deeply esteem the treasures of buddha-teachings, doctrine, and Sangha, wishing to see buddhas, hear doctrines, and associate with Sangha wherever they are",
        "source": "T07n0220_564:0914c15_13"
    },
    {
        "source_sentence": "應深隨喜迴向菩提不生執著。",
        "translation": "They should deeply rejoice and dedicate themselves back to enlightenment without becoming attached.",
        "source": "T07n0220_564:0914c17_14"
    },
    {
        "source_sentence": "若能如是，疾證無上正等菩提，利樂有情破魔軍眾。」",
        "translation": "If someone can do so, they'll quickly realize unsurpassed perfect enlightenment and benefit sentient beings who break through the armies of Māra.",
        "source": "T07n0220_564:0914c17_15"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_564:0914c18_16"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_564:0914c19_17"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_564:0914c19_18"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_564:0914c19_19"
    },
    {
        "source_sentence": "若諸有情於諸菩薩功德善根，深心隨喜迴向菩提，速能圓滿諸菩薩行，",
        "translation": "“Furthermore, if sentient beings deeply rejoice in the virtues of enlightening beings’ roots of goodness and dedicate them with joy to enlightenment, they will quickly be able to perfect the practices of enl",
        "source": "T07n0220_564:0914c20_20"
    },
    {
        "source_sentence": "疾證無上正等菩提。",
        "translation": "He quickly realizes unsurpassed perfect enlightenment.",
        "source": "T07n0220_564:0914c21_21"
    },
    {
        "source_sentence": "若諸有情於諸菩薩功德善根，深心隨喜迴向菩提，是諸有情具大勢力，",
        "translation": "If all sentient beings deeply rejoice in the virtues of enlightening beings’ roots of goodness and dedicate them to enlightenment, those sentient beings will be endowed with great power.",
        "source": "T07n0220_564:0914c22_22"
    },
    {
        "source_sentence": "常能奉事諸佛世尊，於深經典善知義趣。",
        "translation": "They are always able to serve the buddhas and world-honored ones, knowing well the meaning of profound scriptures.",
        "source": "T07n0220_564:0914c23_23"
    },
    {
        "source_sentence": "隨所生處，一切世間恭敬供養，不見惡色、不聞惡聲、不嗅惡香、不嘗惡味、不覺惡觸、不思惡法、不墮惡趣，",
        "translation": "Wherever they are born, the whole world honors and venerates them. They don’t see bad forms, don’t hear bad sounds, don’t smell bad odors, don’t taste bad flavors, don’t experience bad tactile sensations",
        "source": "T07n0220_564:0914c24_24"
    },
    {
        "source_sentence": "生人天中恒受勝樂。",
        "translation": "They'll be born among humans and gods and always experience superior happiness.",
        "source": "T07n0220_564:0914c27_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_564:0914c27_26"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_564:0914c27_27"
    },
    {
        "source_sentence": "是諸有情能於無量菩薩功德，深心隨喜迴向菩提，善根增進，疾能證得一切智智，",
        "translation": "“Those sentient beings who can deeply rejoice in the virtues of enlightening beings and dedicate themselves with joy to enlightenment, their roots of goodness increasing, will quickly attain omniscience.",
        "source": "T07n0220_564:0914c28_0"
    },
    {
        "source_sentence": "饒益無量無數有情，令住無餘般涅槃界。",
        "translation": "It benefits measureless and countless sentient beings, causing them to abide in the state of parinirvāṇa without remainder.",
        "source": "T07n0220_564:0914c29_1"
    },
    {
        "source_sentence": "以是故，憍尸迦！",
        "translation": "That's why, Kauśika!",
        "source": "T07n0220_564:0915a01_2"
    },
    {
        "source_sentence": "住菩薩乘善男子等，於諸菩薩功德善根，皆應隨喜迴向菩提，利樂無邊諸有情類。」",
        "translation": "Good sons who abide in the bodhisattva vehicle and so forth, they should rely on the good roots of the bodhisattva's merits to joyfully dedicate themselves to enlightenment and benefit boundless sentient beings",
        "source": "T07n0220_564:0915a02_3"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「心既如幻，云何菩薩能證無上正等菩提？」",
        "translation": "It was then that the good manifestation said to the Buddha, Since the mind is illusory, how can a bodhisattva realize unsurpassed perfect enlightenment?",
        "source": "T07n0220_564:0915a04_4"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0915a05_5"
    },
    {
        "source_sentence": "汝為見有如幻心不？」",
        "translation": "Do you see existence as illusory mind?",
        "source": "T07n0220_564:0915a05_6"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0915a06_7"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0915a06_8"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0915a06_9"
    },
    {
        "source_sentence": "汝見幻不？」",
        "translation": "Do you see the illusion?",
        "source": "T07n0220_564:0915a07_10"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0915a07_11"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0915a08_12"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0915a08_13"
    },
    {
        "source_sentence": "若汝不見幻、不見如幻心，若處無幻、無如幻心，汝見有是心能得菩提不？」",
        "translation": "If you don't see illusions and don't see minds that are illusory, and if there's no illusion or mind that aren't illusory in places, do you see this mind that can attain enlightenment?",
        "source": "T07n0220_564:0915a08_14"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0915a10_15"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0915a10_16"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_564:0915a10_17"
    },
    {
        "source_sentence": "若處離幻、離如幻心，汝見有是法能得菩提不？」",
        "translation": "If you're free of illusion and free of illusory mind, do you see any such thing that can attain enlightenment?",
        "source": "T07n0220_564:0915a11_18"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_564:0915a12_19"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_564:0915a12_20"
    },
    {
        "source_sentence": "我都不見即、離心法，說何等法若有若無？",
        "translation": "I myself don't see that it's the same as or different from mind and dharmas, so what dharmas are said to exist or not?",
        "source": "T07n0220_564:0915a12_21"
    },
    {
        "source_sentence": "以一切法畢竟離故，不可施設是有是無。",
        "translation": "Because all things are ultimately free, they can't be defined as existence or nonexistence.",
        "source": "T07n0220_564:0915a13_22"
    },
    {
        "source_sentence": "若法不可施設有無，則不可說能得菩提，非無所有法能得菩提故。",
        "translation": "If dharmas can't be defined as existent or nonexistent, then they can't be described as capable of attaining enlightenment, because it's not the case that nothing exists that can attain enlightenment.",
        "source": "T07n0220_564:0915a14_23"
    },
    {
        "source_sentence": "由此般若波羅蜜多亦畢竟離，不應修遣，亦復不應有所引發，無上菩提亦畢竟離。",
        "translation": "Because this prajñāpāramitā is also ultimately free, it shouldn't be cultivated or abandoned, and it shouldn't give rise to anything, and unsurpassed enlightenment is also ultimately free.",
        "source": "T07n0220_564:0915a16_24"
    },
    {
        "source_sentence": "云何可說諸菩薩眾依深般若波羅蜜多能證菩提？",
        "translation": "How can it be said that bodhisattvas rely on the profound prajñāpāramitā to realize enlightenment?",
        "source": "T07n0220_564:0915a18_25"
    },
    {
        "source_sentence": "是故般若波羅蜜多應不可說能證無上正等菩提，離法不得離法故？」",
        "translation": "Therefore, the prajñāpāramitā shouldn't be described as capable of realizing unsurpassed perfect enlightenment because it's free of dharmas and doesn't attain freedom from dharmas?",
        "source": "T07n0220_564:0915a19_26"
    },
    {
        "source_sentence": "佛告善現：「善哉！",
        "translation": "The Buddha told Shancheng, Good!",
        "source": "T07n0220_564:0915a20_27"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_564:0915a21_28"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_564:0915a21_29"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_564:0915a21_30"
    },
    {
        "source_sentence": "甚深般若波羅蜜多、無上菩提俱畢竟離。",
        "translation": "The profound prajñāpāramitā and unsurpassed enlightenment are both ultimately free.",
        "source": "T07n0220_564:0915a21_31"
    },
    {
        "source_sentence": "甚深般若波羅蜜多畢竟離故，得畢竟離無上菩提，若深般若波羅蜜多非畢竟離，",
        "translation": "It's because the profound prajñāpāramitā is ultimately free that they attain unsurpassed enlightenment, and if the profound prajñāpāramitā isn't ultimately free,",
        "source": "T07n0220_564:0915a22_32"
    },
    {
        "source_sentence": "應非般若波羅蜜多。",
        "translation": "It shouldn't be the prajñāpāramitā.",
        "source": "T07n0220_564:0915a24_33"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T07n0220_564:0915a24_34"
    },
    {
        "source_sentence": "非不依止甚深般若波羅蜜多得大菩提，雖非離法能得離法，而得菩提非不依止甚深般若波羅蜜多。",
        "translation": "It's not that they don't rely on the profound prajñāpāramitā to attain great enlightenment, and although they aren't free of dharmas, they can attain freedom from dharmas, but they attain",
        "source": "T07n0220_564:0915a25_35"
    },
    {
        "source_sentence": "是故菩薩欲得無上正等菩提，應勤修學甚深般若波羅蜜多。」",
        "translation": "Therefore, if bodhisattvas want to attain unsurpassed perfect enlightenment, they should diligently cultivate the profound prajñāpāramitā.",
        "source": "T07n0220_564:0915a27_36"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百六十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 4",
        "source": "T07n0220_564:0915a29_0"
    }
]