[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百五",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 5",
        "source": "T07n0220_559:0883b06_0"
    },
    {
        "source_sentence": "十九",
        "translation": "nineteen",
        "source": "T07n0220_559:0883b07_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_559:0883b09_0"
    },
    {
        "source_sentence": "第五分地獄品第八",
        "translation": "The Eighth Chapter of the Hell of the Fifth Part",
        "source": "T07n0220_559:0883b10_0"
    },
    {
        "source_sentence": "時，舍利子便白佛言：「如是無倒隨喜迴向，皆由般若波羅蜜多威力成辦。」",
        "translation": "Śāriputra then said to the Buddha, Such unerring and joyful dedication of merit is accomplished by the authoritative power of the prajñāpāramitā.",
        "source": "T07n0220_559:0883b11_0"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「如是！",
        "translation": "It was then that the Buddha addressed Śāriputra, saying, So it is!",
        "source": "T07n0220_559:0883b12_1"
    },
    {
        "source_sentence": "如是！」",
        "translation": "So it is!",
        "source": "T07n0220_559:0883b13_2"
    },
    {
        "source_sentence": "時，舍利子復白佛言：「如是般若波羅蜜多能作照明皆應敬禮，世間諸法不能染污，",
        "translation": "Śāriputra then again said to the Buddha, Thus, the prajñāpāramitā that illuminates should all be venerated, so that worldly dharmas won't stain it.",
        "source": "T07n0220_559:0883b13_3"
    },
    {
        "source_sentence": "能除翳闇能發光明，能施利安能為導首，與諸盲者作淨眼目，與涉闇徒作明燈炬，",
        "translation": "He's able to remove the darkness of ignorance and give light that produces it, and he's able to bestow benefits that provide guidance. He makes pure eyes for the blind and a bright lamp torch for those who wade through darkness.",
        "source": "T07n0220_559:0883b15_4"
    },
    {
        "source_sentence": "引失道者令入正路，顯諸法性即薩婆若，示一切法無滅無生，是諸菩薩摩訶薩母，",
        "translation": "Causing those who have lost the path to enter the right path and revealing the nature of all dharmas is sarvajña, showing that all dharmas lack cessation and non-arising is the mother of all bodhisattva mahāsattvas.",
        "source": "T07n0220_559:0883b17_5"
    },
    {
        "source_sentence": "能令諸佛具轉三轉、十二行相無上法輪，無依護者為作依護，能除一切生死苦惱，",
        "translation": "They can cause all buddhas to turn the wheel of unexcelled teaching in its three revolutions and twelve aspects. Those who do not rely on them will become their protectors, able to remove all the miseries of birth and death.",
        "source": "T07n0220_559:0883b19_0"
    },
    {
        "source_sentence": "開示諸法無性為性。",
        "translation": "It reveals that the dharmas are without nature as nature.",
        "source": "T07n0220_559:0883b20_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0883b21_2"
    },
    {
        "source_sentence": "諸菩薩摩訶薩於深般若波羅蜜多應云何住？」",
        "translation": "How should bodhisattvas and mahāsattvas abide in the profound prajñāpāramitā?",
        "source": "T07n0220_559:0883b21_3"
    },
    {
        "source_sentence": "佛告舍利子：「諸菩薩摩訶薩於深般若波羅蜜多應如佛住，敬事般若波羅蜜多應如敬事諸佛世尊。」",
        "translation": "The Buddha told Śāriputra, All bodhisattvas, mahāsattvas, should abide in the profound prajñāpāramitā as the Buddha and venerate the prajñāpāramitā as the Bhagavān.",
        "source": "T07n0220_559:0883b22_4"
    },
    {
        "source_sentence": "時，天帝釋作是念言：「今舍利子何因何緣問佛斯事？」",
        "translation": "At the time, Śakra Devānām-Indra had this thought, Now, why did Śāriputra ask the Buddha about this matter?",
        "source": "T07n0220_559:0883b24_5"
    },
    {
        "source_sentence": "念已便問舍利子言：「以何因緣而作是問？」",
        "translation": "After he thought this, he asked Śāriputra, What's the reason for asking this question?",
        "source": "T07n0220_559:0883b26_0"
    },
    {
        "source_sentence": "時，舍利子報帝釋言：「前佛世尊說諸菩薩甚深般若波羅蜜多所攝受故，",
        "translation": "Śāriputra replied to Indra, saying, The Bhagavān said that the bodhisattvas are included in the profound prajñāpāramitā because they are taught by the buddhas and gods.",
        "source": "T07n0220_559:0883b26_1"
    },
    {
        "source_sentence": "所起隨喜迴向俱行諸福業事，疾能證得一切智智，勝有所得菩薩所修布施、淨戒、安忍、精進、靜慮、般若相應善根，",
        "translation": "The meritorious deeds that are accompanied by joyful dedication and the virtuous deeds they undertake can quickly realize omniscience and knowledge, which is superior to the good roots associated with generosity, pure morality, patience, effort, meditation, and wisdom cultivated by enlightening beings who have attained enlightenment.",
        "source": "T07n0220_559:0883b28_2"
    },
    {
        "source_sentence": "是故我今作如是問。",
        "translation": "That's why I now ask this question.",
        "source": "T07n0220_559:0883c02_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0883c02_4"
    },
    {
        "source_sentence": "如生盲眾若百若千，無淨眼者方便引導，近尚不能趣入正道，況能遠達豐樂大城！",
        "translation": "It's like a hundred or a thousand people born blind who don't have pure eyes and are skillfully guided, but they can't enter the right path even close to it, so how could they reach the great city of prosperity and happiness from afar?",
        "source": "T07n0220_559:0883c02_5"
    },
    {
        "source_sentence": "如是前五波羅蜜多諸生盲眾，若無般若波羅蜜多淨眼者導，尚不能趣菩薩正道，",
        "translation": "Thus, these first five perfections of wisdom are for those born blind, but if they don't have the pure eye of the perfection of wisdom to guide them, they still won't be able to follow the bodhisattva's right path.",
        "source": "T07n0220_559:0883c04_6"
    },
    {
        "source_sentence": "況能證入一切智城！",
        "translation": "How could he realize the entry into the city of omniscience!",
        "source": "T07n0220_559:0883c06_7"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0883c07_0"
    },
    {
        "source_sentence": "布施等五波羅蜜多，要由般若波羅蜜多，名有目者。",
        "translation": "The five perfections of generosity and so forth are called having eyes because they arise from the perfection of prajñāpāramitā.",
        "source": "T07n0220_559:0883c07_1"
    },
    {
        "source_sentence": "復由般若波羅蜜多之所攝受，名到彼岸。」",
        "translation": "It's also because it's collected by the perfection of wisdom, which is called reaching the other shore.",
        "source": "T07n0220_559:0883c08_2"
    },
    {
        "source_sentence": "時，舍利子復白佛言：「云何菩薩引發般若波羅蜜多？」",
        "translation": "Śāriputra then again said to the Buddha, How does a bodhisattva give rise to the perfection of wisdom?",
        "source": "T07n0220_559:0883c09_3"
    },
    {
        "source_sentence": "佛告舍利子：「若諸菩薩不引發色、受、想、行、識，亦不見色、受、想、行、識，",
        "translation": "The Buddha told Śāriputra: If bodhisattvas do not give rise to form, feeling, perception, ideation, volition, and consciousness, they will not see form, feeling, perception, volition, or consciousness.",
        "source": "T07n0220_559:0883c10_4"
    },
    {
        "source_sentence": "是即名為引發般若波羅蜜多。」",
        "translation": "This is called the initiation of the prajñāpāramitā.",
        "source": "T07n0220_559:0883c11_5"
    },
    {
        "source_sentence": "時，舍利子復白佛言：「若諸菩薩引發般若波羅蜜多，為成何法？」",
        "translation": "Śāriputra then again said to the Buddha, If bodhisattvas give rise to the perfection of wisdom, what teaching will they accomplish?",
        "source": "T07n0220_559:0883c12_6"
    },
    {
        "source_sentence": "佛告舍利子：「若諸菩薩引發般若波羅蜜多，於一切法都無所成，無所成故得名般若波羅蜜多。」",
        "translation": "The Buddha told Śāriputra, If bodhisattvas give rise to the perfection of prajñāpāramitā, nothing is accomplished in all dharmas and nothing is accomplished, so they can be called the perfection of prajñāpāramitā.",
        "source": "T07n0220_559:0883c14_7"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「如是般若波羅蜜多豈不能成一切智智？」",
        "translation": "Śakra Devānām-Indra then said to the Buddha, How can such prajñāpāramitā not become omniscience?",
        "source": "T07n0220_559:0883c16_8"
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, Kauśika!",
        "source": "T07n0220_559:0883c17_9"
    },
    {
        "source_sentence": "如是般若波羅蜜多亦不能成一切智智。",
        "translation": "Thus, the perfection of prajñāpāramitā also doesn't accomplish omniscience.",
        "source": "T07n0220_559:0883c17_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0883c18_11"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0883c19_12"
    },
    {
        "source_sentence": "如有所得，如有名想，如有造立，不能成故。」",
        "translation": "If there's something to be attained, if there's a name and perception, and if there's a creation, it can't be done.",
        "source": "T07n0220_559:0883c19_13"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「若爾，般若波羅蜜多云何說成一切智智？」",
        "translation": "Śakra Devānām-Indra then again said to the Buddha, If that's the case, how does the prajñāpāramitā say it accomplishes omniscience?",
        "source": "T07n0220_559:0883c20_14"
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, Kauśika!",
        "source": "T07n0220_559:0883c21_15"
    },
    {
        "source_sentence": "如是般若波羅蜜多於所引發一切智智，無所成故說名為成。」",
        "translation": "Thus, the prajñāpāramitā is called accomplished because there's nothing to be accomplished by the omniscience and cognition that it gives rise to.",
        "source": "T07n0220_559:0883c21_16"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「甚奇！",
        "translation": "Śakra Devānām-Indra then said to the Buddha, Very wonderful!",
        "source": "T07n0220_559:0883c23_17"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0883c23_18"
    },
    {
        "source_sentence": "如是般若波羅蜜多不為生滅一切法故，不為成壞一切法故出現世間，而與世間作饒益事。」",
        "translation": "Thus, the perfection of wisdom doesn't arise or cease for the sake of all dharmas and doesn't appear in the world for the sake of the formation or destruction of all dharmas, yet it creates benefits for the world.",
        "source": "T07n0220_559:0883c24_0"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「若諸菩薩起如是想，則便捨遠甚深般若波羅蜜多。」",
        "translation": "It was then that Shancheng then said to the Buddha, If bodhisattvas give rise to such thoughts, they'll abandon the profound prajñāpāramitā.",
        "source": "T07n0220_559:0883c26_1"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_559:0883c27_2"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0883c28_3"
    },
    {
        "source_sentence": "復有因緣捨遠般若波羅蜜多，謂生是想：『甚深般若波羅蜜多空無所有。』",
        "translation": "Again, there are causes and conditions for abandoning the far-reaching prajñāpāramitā, which is to say that they give rise to this perception, 'The profound prajñāpāramitā of emptiness has no existence.'",
        "source": "T07n0220_559:0883c28_4"
    },
    {
        "source_sentence": "即便捨遠甚深般若波羅蜜多。",
        "translation": "He'll even abandon the profound prajñāpāramitā that's far removed.",
        "source": "T07n0220_559:0883c29_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0884a01_6"
    },
    {
        "source_sentence": "菩薩般若波羅蜜多非空非有、無所分別。」",
        "translation": "The bodhisattva prajñāpāramitā is neither empty, nonexistent, and without discrimination.",
        "source": "T07n0220_559:0884a01_7"
    },
    {
        "source_sentence": "具壽善現復白佛言：「佛說般若波羅蜜多為顯何法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What teaching does the Buddha teach that the perfection of wisdom reveals?",
        "source": "T07n0220_559:0884a02_8"
    },
    {
        "source_sentence": "佛告善現：「我說般若波羅蜜多不為顯色，亦不為顯受、想、行、識；",
        "translation": "The Buddha told Shancheng: I teach that the perfection of wisdom does not reveal form, and neither does it reveal feeling, perception, volition, or consciousness.",
        "source": "T07n0220_559:0884a04_0"
    },
    {
        "source_sentence": "不為顯預流果，亦不為顯一來、不還、阿羅漢果、獨覺菩提。」",
        "translation": "It doesn't reveal the fruit of pre-flow, and it doesn't reveal the once-returner, nonreturner, arhatship, or solitary realizer bodhi.",
        "source": "T07n0220_559:0884a05_1"
    },
    {
        "source_sentence": "具壽善現復白佛言：「甚深般若波羅蜜多即是廣大波羅蜜多。」",
        "translation": "Guoshou Shancheng then said to the Buddha, The profound prajñāpāramitā is the vast pāramitā.",
        "source": "T07n0220_559:0884a06_2"
    },
    {
        "source_sentence": "佛告善現：「何緣汝說甚深般若波羅蜜多即是廣大波羅蜜多？」",
        "translation": "The Buddha told Shancheng, Why did you say that the profound perfection of wisdom is the vast perfection of wisdom?",
        "source": "T07n0220_559:0884a08_3"
    },
    {
        "source_sentence": "善現答言：「甚深般若波羅蜜多於色不作大、不作小、不作集、不作散，",
        "translation": "Shancheng answered, The profound prajñāpāramitā doesn't make form great, doesn't make it small, doesn't make it collected, and doesn't make it dispersed.",
        "source": "T07n0220_559:0884a09_4"
    },
    {
        "source_sentence": "於受、想、行、識亦不作大、不作小、不作集、不作散；",
        "translation": "Nor does he think of feeling, perception, volition, or consciousness as large, small, concentrated, or dispersed.",
        "source": "T07n0220_559:0884a11_5"
    },
    {
        "source_sentence": "於佛十力不作強、不作弱，於一切智不作廣、不作狹。",
        "translation": "In the Buddha's ten powers, he doesn't make them strong and doesn't make them weak, and in omniscience, he doesn't make them broad and doesn't make them narrow.",
        "source": "T07n0220_559:0884a12_6"
    },
    {
        "source_sentence": "若諸菩薩起如是想，非行般若波羅蜜多。",
        "translation": "If bodhisattvas give rise to such thoughts, they aren't practicing the perfection of wisdom.",
        "source": "T07n0220_559:0884a13_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0884a14_8"
    },
    {
        "source_sentence": "如是諸想，非深般若波羅蜜多等流果故。",
        "translation": "Such conceptions aren't the result of profound prajñāpāramitā and so forth.",
        "source": "T07n0220_559:0884a14_9"
    },
    {
        "source_sentence": "甚深般若波羅蜜多若起是想：『我當度脫若干有情入無餘依般涅槃界。』",
        "translation": "If the profound prajñāpāramitā gives rise to this idea, 'I will liberate certain sentient beings and enter the state of parinirvāṇa without remainder.'",
        "source": "T07n0220_559:0884a15_10"
    },
    {
        "source_sentence": "是則名為大有所得，非有所得能有所辦。",
        "translation": "This is called having great attainment, and it's not something to be attained that can be done.",
        "source": "T07n0220_559:0884a17_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0884a17_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0884a18_2"
    },
    {
        "source_sentence": "有情無生故，當知般若波羅蜜多亦無生；",
        "translation": "Because sentient beings lack birth, you should know that the perfection of wisdom also lacks birth.",
        "source": "T07n0220_559:0884a18_3"
    },
    {
        "source_sentence": "有情無自性故、遠離故、不可思議故、無滅壞故、無覺知故，當知般若波羅蜜多亦無自性，",
        "translation": "Because sentient beings lack self-nature, because they're far removed, because they're inconceivable, because there's no cessation and destruction, and because there's no perception, you should know that the prajñāpāramitā also has no self-nature.",
        "source": "T07n0220_559:0884a19_4"
    },
    {
        "source_sentence": "廣說乃至亦無覺知。",
        "translation": "It's explained in detail up to the point where there's also no perception.",
        "source": "T07n0220_559:0884a21_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0884a21_6"
    },
    {
        "source_sentence": "有情力積集故，當知如來力亦積集。」",
        "translation": "Because the power of sentient beings accumulates, you should know that the Tathāgata's power also accumulates.",
        "source": "T07n0220_559:0884a21_7"
    },
    {
        "source_sentence": "時，舍利子便白佛言：「若諸菩薩於深般若波羅蜜多能生信解，無疑、無惑亦不迷謬，",
        "translation": "Śāriputra then said to the Buddha, Suppose bodhisattvas can give rise to faith in the profound prajñāpāramitā without doubt or confusion and without error.",
        "source": "T07n0220_559:0884a22_8"
    },
    {
        "source_sentence": "是諸菩薩從何處沒來生此間？",
        "translation": "Where did these bodhisattvas come from to be born here?",
        "source": "T07n0220_559:0884a24_9"
    },
    {
        "source_sentence": "積行久如於深法義能隨覺了？」",
        "translation": "How long has it been since he accumulated practiced so deeply in the meaning of the teaching that he can follow and comprehend it?",
        "source": "T07n0220_559:0884a25_10"
    },
    {
        "source_sentence": "佛言：「舍利子！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T07n0220_559:0884a25_11"
    },
    {
        "source_sentence": "是諸菩薩從他方界所事諸佛法會中沒來生此間。",
        "translation": "These bodhisattvas come here from other realms to serve the buddhas and Dharma assemblies in other realms.",
        "source": "T07n0220_559:0884a26_12"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0884a27_13"
    },
    {
        "source_sentence": "是諸菩薩已多親近諸佛世尊，曾問此中甚深法義已，經無量無數大劫，",
        "translation": "These bodhisattvas had already been intimate with the buddhas and world-honored ones for many eons, having questioned them about the profound meaning of these teachings.",
        "source": "T07n0220_559:0884a27_14"
    },
    {
        "source_sentence": "修集百千難行苦行，乘大願力來生此土。",
        "translation": "They cultivate hundreds of thousands of difficult and painful practices, and are born in this land by the power of their great vow.",
        "source": "T07n0220_559:0884a29_15"
    },
    {
        "source_sentence": "於深般若波羅蜜多若見若聞生大歡喜，便作是念：『我今見佛，聞佛所說。』",
        "translation": "He becomes greatly joyful when he sees and hears the profound prajñāpāramitā, and then he thinks, 'Now that I've seen the Buddha and heard what he teaches.'",
        "source": "T07n0220_559:0884b01_16"
    },
    {
        "source_sentence": "由此因緣恭敬信受。」",
        "translation": "Because of these causes and conditions, they venerate and believe in them.",
        "source": "T07n0220_559:0884b02_17"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「甚深般若波羅蜜多可見聞耶？」",
        "translation": "It was then that the good manifestation said to the Buddha, Is the profound prajñāpāramitā visible and heard?",
        "source": "T07n0220_559:0884b03_18"
    },
    {
        "source_sentence": "佛言：「不也！」",
        "translation": "The Buddha said, No!",
        "source": "T07n0220_559:0884b04_19"
    },
    {
        "source_sentence": "具壽善現復白佛言：「若諸菩薩於深般若波羅蜜多能勤修學，是諸菩薩積行久如？」",
        "translation": "Guoshou Shancheng then said to the Buddha, If bodhisattvas can diligently cultivate profound prajñāpāramitā, how long have these bodhisattvas accumulated practices?",
        "source": "T07n0220_559:0884b04_20"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T07n0220_559:0884b06_21"
    },
    {
        "source_sentence": "此應分別。",
        "translation": "This should be discriminated.",
        "source": "T07n0220_559:0884b06_22"
    },
    {
        "source_sentence": "有諸菩薩從初發心，遇真善友方便攝受，即能修學甚深般若波羅蜜多，",
        "translation": "There are bodhisattvas who, from the first determination for enlightenment, meet true and good friends and skillfully gather them in order to cultivate profound prajñāpāramitā.",
        "source": "T07n0220_559:0884b07_0"
    },
    {
        "source_sentence": "於深法門能生信解。",
        "translation": "They can give rise to faith and understanding in the profound teaching.",
        "source": "T07n0220_559:0884b08_1"
    },
    {
        "source_sentence": "有諸菩薩雖曾值遇多百千佛，於諸佛所勤修梵行，而有所得為方便故，",
        "translation": "“There are also bodhisattvas who, though they have met hundreds of thousands of buddhas and practiced the holy life in the presence of those buddhas, still attain it through skillful means.",
        "source": "T07n0220_559:0884b09_2"
    },
    {
        "source_sentence": "於深般若波羅蜜多不能修學，聞說般若波羅蜜多不生信解即便捨去。",
        "translation": "They can't cultivate the profound prajñāpāramitā, and when they hear it taught, they don't become convinced and even abandon it.",
        "source": "T07n0220_559:0884b10_3"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_559:0884b12_4"
    },
    {
        "source_sentence": "是諸菩薩過去佛所聞說般若波羅蜜多，無信敬心捨眾而去，今聞般若波羅蜜多，",
        "translation": "Those bodhisattvas who had heard the teaching of the perfection of wisdom from buddhas in the past departed without believing or venerating them, and now they hear the teaching of the perfection of wisdom.",
        "source": "T07n0220_559:0884b12_5"
    },
    {
        "source_sentence": "無信敬心還復捨去。",
        "translation": "Without faith or respect, they'll return and abandon it.",
        "source": "T07n0220_559:0884b14_6"
    },
    {
        "source_sentence": "彼於般若波羅蜜多，若身若心皆不和合，不和合故，造作增長感惡慧業，",
        "translation": "In the perfection of wisdom, neither body nor mind are in harmony, and because they aren't in harmony, they create and grow bad karma that leads to bad wisdom.",
        "source": "T07n0220_559:0884b15_0"
    },
    {
        "source_sentence": "由此業故，聞深般若波羅蜜多毀謗厭捨。」",
        "translation": "Because of this action, they hear the profound prajñāpāramitā and disparage it.",
        "source": "T07n0220_559:0884b16_1"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_559:0884b17_2"
    },
    {
        "source_sentence": "若諸菩薩毀謗厭捨甚深般若波羅蜜多，當知則為毀謗厭捨一切智智，若毀謗厭捨一切智智，",
        "translation": "If bodhisattvas disparage and dislike the profound prajñāpāramitā, you should know that they disparage and dislike omniscience and cognition, and if they disparage and dislike omniscience and cognition,",
        "source": "T07n0220_559:0884b17_3"
    },
    {
        "source_sentence": "即毀謗厭捨三世諸佛。",
        "translation": "They denigrate and dislike the buddhas of the three times.",
        "source": "T07n0220_559:0884b20_0"
    },
    {
        "source_sentence": "由此因緣，造作增長害正法罪，由此罪故經歷多時受諸重苦，謂彼所造罪極重故，",
        "translation": "Because of these causes and conditions, sins that are committed increase and harmful to the true-dharma. Because of these sins, they experience heavy suffering for a long time:",
        "source": "T07n0220_559:0884b20_1"
    },
    {
        "source_sentence": "多百千歲墮大地獄，此界、他方往還輪轉，受諸重苦不得解脫，此界火、水、風劫起時移置他方大地獄內，",
        "translation": "For many hundreds of thousands of years they will fall into great hells, going and coming back in this realm and in other directions, enduring various kinds of pain but not being liberated. When the eon of fire, water, or wind arises in this realm, they’ll be reborn elsewhere in great hells.",
        "source": "T07n0220_559:0884b22_2"
    },
    {
        "source_sentence": "他方火、水、風劫起時移置此界大地獄中，如是輪迴經無數劫，受大地獄極難忍苦。",
        "translation": "When the eon of fire, water, and wind arise in another place, they'll be moved to this world's great hell for countless eons like this, and they'll experience the great hell that's extremely difficult to endure.",
        "source": "T07n0220_559:0884b24_3"
    },
    {
        "source_sentence": "彼害法罪業勢稍微，從地獄出墮傍生趣，如前展轉此界、他方，多劫輪迴受諸劇苦。",
        "translation": "The momentum of their sins that harm the Dharma is slight, and they emerge from hell and fall into the destinies of unenlightened sentient beings. As before, they continue to transmigrate in this realm and other directions for many eons and experience various kinds of suffering.",
        "source": "T07n0220_559:0884b26_4"
    },
    {
        "source_sentence": "彼害法罪業勢漸薄，脫傍生趣墮鬼趣中，此界、他方輪迴展轉，受諸重苦經無量劫。",
        "translation": "They gradually weaken the power of their sinful actions that harm the Dharma and fall into the realm of ghosts, free themselves from the destinies of unenlightened sentient beings and fall into the destinies of ghosts for an immeasurable number of eons.",
        "source": "T07n0220_559:0884b28_5"
    },
    {
        "source_sentence": "彼害法業餘勢將盡，免餓鬼趣來生人中，具受人間貧窮、下賤、頑愚、疾病、醜陋等苦，",
        "translation": "When the karma that harms the Dharma is about to end, they'll be freed from the destinies of hungry ghosts and be born among humans. They'll experience all the sufferings of poverty, inferiority, wickedness, illness, ugliness, and so forth in the human world.",
        "source": "T07n0220_559:0884c01_6"
    },
    {
        "source_sentence": "尚不聞有佛、法、僧名，況能精勤修諸善業！",
        "translation": "How could they diligently cultivate good actions if they hadn't heard the names of buddhas, dharmas, and saṃgha!",
        "source": "T07n0220_559:0884c03_7"
    },
    {
        "source_sentence": "以諸惡業害正法故，受如是類圓滿苦果。」",
        "translation": "Because bad actions harm the right teaching, they experience such kinds of full and painful results.",
        "source": "T07n0220_559:0884c04_8"
    },
    {
        "source_sentence": "時，舍利子便白佛言：「害正法業與五無間，此二惡行為相似不？」",
        "translation": "Śāriputra then said to the Buddha, What's the resemblance between these two bad actions that harm right teaching and the five kinds of unremitting activity?",
        "source": "T07n0220_559:0884c05_9"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「勿謂此業似五無間。",
        "translation": "It was then that the Buddha addressed Śāriputra, Don't say that this action resembles the five kinds of unremittingness.",
        "source": "T07n0220_559:0884c06_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0884c07_11"
    },
    {
        "source_sentence": "五無間業雖感重苦，而不可比毀謗正法，謂彼聞說甚深般若波羅蜜多，",
        "translation": "Although the five kinds of proximate karma bring heavy suffering, they can't be compared to disparaging the right teaching, meaning that they hear and teach profound prajñāpāramitā.",
        "source": "T07n0220_559:0884c07_12"
    },
    {
        "source_sentence": "毀謗拒逆言：『此般若波羅蜜多，非真佛語，不應修學，非法、非律、非大師教。』",
        "translation": "They disparage and reject it, saying, 'This prajñāpāramitā is not the true words of the Buddha, which shouldn't be cultivated, unlawful, undisciplined, or taught by a great teacher.'",
        "source": "T07n0220_559:0884c09_13"
    },
    {
        "source_sentence": "由此因緣其罪極重，不可以比五無間業。」",
        "translation": "Because of these causes and conditions, their sins are so serious that they can't be compared to the five kinds of unremitting actions.",
        "source": "T07n0220_559:0884c11_14"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0884c12_15"
    },
    {
        "source_sentence": "此害法人自謗正法亦教他謗，自壞其身亦令他壞，自飲毒藥亦令他飲，",
        "translation": "This harmful person denigrates the right teaching himself and teaches others to denigrate it, destroys his own body and causes others to destroy it, and drinks poisoned medicine himself and causes others to drink it.",
        "source": "T07n0220_559:0884c12_16"
    },
    {
        "source_sentence": "自失生天解脫樂果亦令他失，自持其身足地獄火亦令他足，自沈苦海亦令他溺，",
        "translation": "They themselves lose the blissful fruit of liberation that arises in heaven and lets others lose it. Holding their own bodies and feet [in hell] with fire, they let others have legs as well.",
        "source": "T07n0220_559:0884c13_17"
    },
    {
        "source_sentence": "自不信解甚深般若波羅蜜多亦教他人令不信解迷謬顛倒。",
        "translation": "They themselves don't believe and understand the profound prajñāpāramitā, and they also teach others so that they won't believe and understand the errors of delusion.",
        "source": "T07n0220_559:0884c15_18"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0884c17_19"
    },
    {
        "source_sentence": "我於般若波羅蜜多，尚不欲令害正法者聞其名字，況當為說！",
        "translation": "In the perfection of wisdom, I still don't want to cause someone who harms the right teaching to hear their name, so why wouldn't I tell them?",
        "source": "T07n0220_559:0884c17_20"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0884c18_21"
    },
    {
        "source_sentence": "害正法者，我尚不聽住菩薩乘善男子等舉目觀視，況當共住！",
        "translation": "Those who harm the right teaching, I won't even listen to the good men living in the bodhisattva vehicle as they raise their eyes and look around, so why wouldn't they live together?",
        "source": "T07n0220_559:0884c18_22"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0884c20_23"
    },
    {
        "source_sentence": "害正法者，我尚不聽被服袈裟，況受供養！",
        "translation": "If someone harms the right teaching, I won't even allow them to wear a monk's robe, so why wouldn't they accept an offering?",
        "source": "T07n0220_559:0884c20_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0884c21_25"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0884c21_26"
    },
    {
        "source_sentence": "害正法者墮黑闇類，如臭爛糞，如穢蝸螺，如癩病人，甚可厭惡。",
        "translation": "Those who harm the right teaching fall into black and dark states, like smelly dung, filthy snails, or leprosy sufferers, which are very disgusting.",
        "source": "T07n0220_559:0884c21_27"
    },
    {
        "source_sentence": "諸有信用害法者言，亦受如前所說大苦。」",
        "translation": "Those who believe in harmful dharmas say that they'll also experience great suffering as described above.",
        "source": "T07n0220_559:0884c23_28"
    },
    {
        "source_sentence": "時，舍利子復白佛言：「何緣不說害正法者當來所受惡趣身量？」",
        "translation": "Śāriputra then again said to the Buddha, What's the reason why someone who doesn't teach harm the right teaching won't receive the body size of a bad destiny in the future?",
        "source": "T07n0220_559:0884c24_29"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「止！",
        "translation": "It was then that the Buddha addressed Śāriputra, saying, Stop!",
        "source": "T07n0220_559:0884c25_30"
    },
    {
        "source_sentence": "不須說彼趣身量，勿害法者聞已驚惶，心頓憂愁如中毒箭，身漸枯顇如被截苗。",
        "translation": "Don't tell the size of their destinies, and don't harm the Dharma; those who hear it will be frightened, whose minds will suddenly become sad like poisonous arrows, and their bodies will gradually wither like cut off seedlings.",
        "source": "T07n0220_559:0884c26_31"
    },
    {
        "source_sentence": "彼或聞之當嘔熱血，喪失身命或近死苦故，我不說彼趣身量。」",
        "translation": "If someone hears that they'll vomit hot blood and lose their body, life, or the pain of near death, I won't tell them the measure of their destiny.",
        "source": "T07n0220_559:0884c28_0"
    },
    {
        "source_sentence": "時，舍利子復重請言：「唯願為說，作後明誡！」",
        "translation": "Śāriputra then repeatedly asked, Please explain it for me, and I'll give you a later explanation of the admonition!",
        "source": "T07n0220_559:0884c29_1"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「我先說彼受苦多劫，足與後人作大明誡。",
        "translation": "It was then that the Buddha addressed Śāriputra, saying, I first explained that they suffered for many eons of suffering, and it's enough to give great instruction to those who follow them.",
        "source": "T07n0220_559:0885a01_2"
    },
    {
        "source_sentence": "當來自類善男子等，聞我前說害正法報，寧捨身命終不謗法，勿我當來長時受苦。」",
        "translation": "You should come from a group of good men who hear me teach the consequences of harming the right teaching before them, preferring to abandon body and life at the end of their lives and not denigrate the teaching, so that I won't suffer for a long time in the future.",
        "source": "T07n0220_559:0885a02_3"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「諸有聰明善男子等應善守護身、語、意業。",
        "translation": "At that point, the good manifestation then said to the Buddha, Good men of intelligence should well guard their physical, verbal, and mental actions.",
        "source": "T07n0220_559:0885a04_4"
    },
    {
        "source_sentence": "彼豈不由語惡業故，惡趣人中長時受苦？」",
        "translation": "Wouldn't it be because of bad speech and bad actions that they experience suffering for a long time among people in bad destinies?",
        "source": "T07n0220_559:0885a06_5"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T07n0220_559:0885a07_0"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0885a07_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0885a07_2"
    },
    {
        "source_sentence": "於我正法毘奈耶中，當有愚癡諸出家者，彼雖稱我為其大師，而於我說甚深般若波羅蜜多毀謗、拒逆。",
        "translation": "In my true teaching, the Vinaya, there will be foolish renunciants who call me their teacher but denigrate and reject the profound prajñāpāramitā that I teach.",
        "source": "T07n0220_559:0885a07_3"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_559:0885a09_4"
    },
    {
        "source_sentence": "若有毀謗甚深般若則為毀謗無上菩提，若有毀謗無上菩提則為毀謗三世諸佛，",
        "translation": "If someone disparages profound prajñā, they disparage unsurpassed enlightenment; if someone disparages unsurpassed enlightenment, they disparage the buddhas of all times.",
        "source": "T07n0220_559:0885a10_5"
    },
    {
        "source_sentence": "若有毀謗三世諸佛則為毀謗一切智智，若有毀謗一切智智則毀謗法，若毀謗法則毀謗僧，",
        "translation": "If someone denigrates the buddhas of the three times, they denigrate omniscience and knowledge; if they denigrate omniscience and knowledge, they denigrate the Dharma; and if they denigrate the Dharma, they denigrate the Sangha.",
        "source": "T07n0220_559:0885a11_6"
    },
    {
        "source_sentence": "若毀謗僧則便造作無量罪業，若有造作無量罪業則便攝受無邊苦報。」",
        "translation": "If someone disparages the saṃgha, they'll commit measureless crimes, and if they commit measureless crimes, they'll receive limitless painful retribution.",
        "source": "T07n0220_559:0885a14_7"
    },
    {
        "source_sentence": "具壽善現復白佛言：「彼愚癡人幾因緣故，毀謗、拒逆甚深般若？」",
        "translation": "Again, Gosshou Shancheng said to the Buddha, For what reasons does that foolish man disparage and reject profound prajñā?",
        "source": "T07n0220_559:0885a15_8"
    },
    {
        "source_sentence": "佛告善現：「由二因緣。",
        "translation": "The Buddha told Shancheng, It's because of two causes and conditions.",
        "source": "T07n0220_559:0885a17_9"
    },
    {
        "source_sentence": "一、為邪魔之所扇惑。",
        "translation": "1. being tormented by an obstacle.",
        "source": "T07n0220_559:0885a17_10"
    },
    {
        "source_sentence": "二、於深法不能信解。」",
        "translation": "2. they can't believe and understand the profound teaching.",
        "source": "T07n0220_559:0885a18_11"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_559:0885a18_12"
    },
    {
        "source_sentence": "由四因緣毀謗、拒逆甚深般若。",
        "translation": "It's because of four causes and conditions that they disparage and reject profound prajñā.",
        "source": "T07n0220_559:0885a18_13"
    },
    {
        "source_sentence": "一、為惡友之所誘誑。",
        "translation": "1. Being tempted by bad friends.",
        "source": "T07n0220_559:0885a19_14"
    },
    {
        "source_sentence": "二、為不能勤修善法。",
        "translation": "2. because they can't diligently cultivate good qualities.",
        "source": "T07n0220_559:0885a19_15"
    },
    {
        "source_sentence": "三、為懷惡憙求他過。",
        "translation": "3. to harbor ill-will and seek faults from others.",
        "source": "T07n0220_559:0885a20_16"
    },
    {
        "source_sentence": "四、為嫉妬自讚毀他。",
        "translation": "4. Being jealous, he praises himself and disparages others.",
        "source": "T07n0220_559:0885a20_17"
    },
    {
        "source_sentence": "由具如是諸因緣故，彼愚癡人毀謗、拒逆甚深般若波羅蜜多，發起無邊極重惡業。」",
        "translation": "Because of these causes and conditions, those foolish people disparage and reject the profound prajñāpāramitā and give rise to limitless and extremely serious bad karma.",
        "source": "T07n0220_559:0885a21_18"
    },
    {
        "source_sentence": "爾時，善現復白佛言：「彼愚癡人不勤精進，於佛所說甚深般若波羅蜜多實難信解。」",
        "translation": "It was then that Shancheng again said to the Buddha, That foolish man doesn't diligently exert effort, and it's really difficult to believe in the profound prajñāpāramitā taught by the Buddha.",
        "source": "T07n0220_559:0885a23_19"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_559:0885a25_20"
    },
    {
        "source_sentence": "如是！」",
        "translation": "So it is!",
        "source": "T07n0220_559:0885a25_21"
    },
    {
        "source_sentence": "具壽善現復白佛言：「如是般若波羅蜜多云何甚深極難信解？」",
        "translation": "Guoshou Shancheng then said to the Buddha, Thus, how profound and extremely difficult is the perfection of wisdom to believe in?",
        "source": "T07n0220_559:0885a25_22"
    },
    {
        "source_sentence": "佛告善現：「色非縛非脫。",
        "translation": "The Buddha told Shancheng, Form is neither bound nor liberated.",
        "source": "T07n0220_559:0885a27_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0885a27_1"
    },
    {
        "source_sentence": "色以無性為自性故。",
        "translation": "It's because form takes the absence of nature as its own nature.",
        "source": "T07n0220_559:0885a27_2"
    },
    {
        "source_sentence": "受、想、行、識非縛非脫。",
        "translation": "Feeling, perception, volition, and consciousness are neither fetters nor liberations.",
        "source": "T07n0220_559:0885a28_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0885a28_4"
    },
    {
        "source_sentence": "受、想、行、識皆以無性為自性故。",
        "translation": "Feeling, perception, volition, and consciousness all have the absence of nature as their own nature.",
        "source": "T07n0220_559:0885a28_5"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T07n0220_559:0885a29_6"
    },
    {
        "source_sentence": "色前、後、中際非縛非脫。",
        "translation": "Form before, after, and in the middle of form are neither fetters nor liberations.",
        "source": "T07n0220_559:0885a29_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0885b01_8"
    },
    {
        "source_sentence": "色前、後、中際皆以無性為自性故。",
        "translation": "It's because form before, after, and in the middle of form are all without nature as their own nature.",
        "source": "T07n0220_559:0885b01_9"
    },
    {
        "source_sentence": "受、想、行、識前、後、中際非縛非脫。",
        "translation": "Feeling, perception, volition, volition, and consciousness before, after, and in the middle of it are neither fetters nor liberations.",
        "source": "T07n0220_559:0885b02_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0885b02_11"
    },
    {
        "source_sentence": "受、想、行、識前、後、中際皆以無性為自性故。」",
        "translation": "It's because feeling, perception, volition, and consciousness before, after, and in the middle are all without nature as their own nature.",
        "source": "T07n0220_559:0885b03_12"
    },
    {
        "source_sentence": "具壽善現復白佛言：「甚深般若波羅蜜多若不精勤甚難信解。」",
        "translation": "Guoshou Shancheng then said to the Buddha, The profound prajñāpāramitā is so difficult to believe and understand if it's not diligent.",
        "source": "T07n0220_559:0885b04_13"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T07n0220_559:0885b05_14"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0885b05_15"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0885b05_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0885b05_17"
    },
    {
        "source_sentence": "色清淨即果清淨，色清淨故果亦清淨；",
        "translation": "The purity of matter is the purity of the result. Because matter is purified, the result is also purified.",
        "source": "T07n0220_559:0885b06_18"
    },
    {
        "source_sentence": "受、想、行、識清淨即果清淨，受、想、行、識清淨故果亦清淨。",
        "translation": "The purity of feeling, perception, volition, and consciousness is the purity of the result, and the result is also purified because feeling, perception, volition, and consciousness are purified.",
        "source": "T07n0220_559:0885b07_19"
    },
    {
        "source_sentence": "復次，善現！",
        "translation": "Furthermore, Sunetra!",
        "source": "T07n0220_559:0885b08_20"
    },
    {
        "source_sentence": "色清淨即一切智清淨，一切智清淨故色亦清淨，是色清淨與一切智清淨，",
        "translation": "The purity of form is the purity of omniscience, and because omniscience is purified, form is also purified. This is the purity of form and the purity of omniscience.",
        "source": "T07n0220_559:0885b08_21"
    },
    {
        "source_sentence": "從本已來無二、無別、無斷、無壞；",
        "translation": "Since the distant past there has been nonduality, nonseparation, noninterruption, and nondestruction.",
        "source": "T07n0220_559:0885b10_22"
    },
    {
        "source_sentence": "受、想、行、識清淨即一切智清淨，一切智清淨故受、想、行、識亦清淨，",
        "translation": "The purity of feeling, perception, volition, and consciousness is the purity of omniscience, and because omniscience is purified, feeling, perception, volition, and consciousness are also purified.",
        "source": "T07n0220_559:0885b10_23"
    },
    {
        "source_sentence": "是受、想、行、識清淨與一切智清淨，從本已來無二、無別、無斷、無壞。」",
        "translation": "It's the purity of feeling, perception, volition, and consciousness and the purity of omniscience that are not two, not distinct, not interrupted, and not destroyed since the distant past.",
        "source": "T07n0220_559:0885b12_24"
    },
    {
        "source_sentence": "第五分清淨品第九",
        "translation": "The ninth chapter of the fifth part of the Pure Chapter",
        "source": "T07n0220_559:0885b14_0"
    },
    {
        "source_sentence": "爾時，舍利子白佛言：「世尊！",
        "translation": "It was then that Śāriputra said to the Buddha, Bhagavān!",
        "source": "T07n0220_559:0885b15_0"
    },
    {
        "source_sentence": "如是清淨最為甚深。」",
        "translation": "Such purity is the most profound.",
        "source": "T07n0220_559:0885b15_1"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b16_2"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b16_3"
    },
    {
        "source_sentence": "舍利子言：「如是清淨是大光明。」",
        "translation": "Śāriputra said, Such purity is great radiance.",
        "source": "T07n0220_559:0885b16_4"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b17_5"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b17_6"
    },
    {
        "source_sentence": "舍利子言：「如是清淨無得、無現觀。」",
        "translation": "Śāriputra said, Such purity has no attainment and no present contemplation.",
        "source": "T07n0220_559:0885b17_7"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b18_8"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b18_9"
    },
    {
        "source_sentence": "舍利子言：「如是清淨無所生起。」",
        "translation": "Śāriputra said, Such pureness doesn't arise.",
        "source": "T07n0220_559:0885b18_10"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b19_11"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b19_12"
    },
    {
        "source_sentence": "舍利子言：「如是清淨不生三界。」",
        "translation": "Śāriputra said, Such purity doesn't give rise to the three realms.",
        "source": "T07n0220_559:0885b20_13"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b20_14"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b21_15"
    },
    {
        "source_sentence": "舍利子言：「如是清淨無知無解。」",
        "translation": "Śāriputra said, Thus pure, there's no knowing or understanding.",
        "source": "T07n0220_559:0885b21_16"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b22_0"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b22_1"
    },
    {
        "source_sentence": "舍利子言：「如是清淨於色無知，於受、想、行、識亦無知。」",
        "translation": "Śāriputra said, Thus, purity has no knowledge of form and no knowledge of feeling, perception, volition, or consciousness.",
        "source": "T07n0220_559:0885b22_2"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b23_3"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b23_4"
    },
    {
        "source_sentence": "舍利子言：「甚深般若波羅蜜多極清淨故，於一切智無損無益。」",
        "translation": "Śāriputra said, Because the profound prajñāpāramitā is so pure, it doesn't harm or benefit all cognition.",
        "source": "T07n0220_559:0885b24_5"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b25_6"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b25_7"
    },
    {
        "source_sentence": "舍利子言：「甚深般若波羅蜜多極清淨故，於一切法無取無捨。」",
        "translation": "Śāriputra said, Because the profound prajñāpāramitā is so pure, there's no grasping or equanimity in all dharmas.",
        "source": "T07n0220_559:0885b26_0"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b27_1"
    },
    {
        "source_sentence": "極清淨故。」",
        "translation": "It's because it's extremely pure.",
        "source": "T07n0220_559:0885b27_2"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「我清淨故色、受、想、行、識亦清淨。」",
        "translation": "It was then that the good manifestation said to the Buddha, Because I'm pure, form, sensation, perception, volition, and consciousness are also pure.",
        "source": "T07n0220_559:0885b27_3"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885b29_4"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T07n0220_559:0885b29_5"
    },
    {
        "source_sentence": "善現復言：「我清淨故果亦清淨。」",
        "translation": "Again, Shancheng said, Because I'm pure, the result is also pure.",
        "source": "T07n0220_559:0885b29_6"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885c01_7"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T07n0220_559:0885c01_8"
    },
    {
        "source_sentence": "善現復言：「我清淨故一切智亦清淨。」",
        "translation": "Again, Shancheng said, Because I'm pure, all cognition is also pure.",
        "source": "T07n0220_559:0885c01_9"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885c02_10"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T07n0220_559:0885c02_11"
    },
    {
        "source_sentence": "善現復言：「我清淨故無得、無現觀。」",
        "translation": "Again, Sunetra said, Because I'm pure, there's no attainment and no present contemplation.",
        "source": "T07n0220_559:0885c03_0"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885c03_1"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T07n0220_559:0885c04_0"
    },
    {
        "source_sentence": "善現復言：「我無邊故色、受、想、行、識亦無邊。」",
        "translation": "Again, Shancheng said, Because the self is limitless, form, feeling, perception, volition, and consciousness are also limitless.",
        "source": "T07n0220_559:0885c04_1"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885c05_2"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T07n0220_559:0885c05_3"
    },
    {
        "source_sentence": "善現復言：「若諸菩薩能如是覺，是為般若波羅蜜多。」",
        "translation": "Again, Shancheng said, If bodhisattvas can thus awaken, this is the prajñāpāramitā.",
        "source": "T07n0220_559:0885c05_4"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885c06_5"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T07n0220_559:0885c07_6"
    },
    {
        "source_sentence": "善現復言：「如是般若波羅蜜多非此岸、非彼岸、非中間。」",
        "translation": "Again, Shancheng said, Thus, the perfection of wisdom is not on this shore, not on the other shore, and not in between.",
        "source": "T07n0220_559:0885c07_7"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0885c08_8"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T07n0220_559:0885c08_9"
    },
    {
        "source_sentence": "善現復言：「若諸菩薩起如是想，捨遠般若波羅蜜多。」",
        "translation": "Again, Shancheng said, Suppose bodhisattvas give rise to such thoughts and abandon the perfection of prajñāpāramitā.",
        "source": "T07n0220_559:0885c09_0"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T07n0220_559:0885c10_1"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_559:0885c10_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_559:0885c10_3"
    },
    {
        "source_sentence": "是諸菩薩著名著相。」",
        "translation": "These are the marks of well-known attachment for bodhisattvas.",
        "source": "T07n0220_559:0885c10_4"
    },
    {
        "source_sentence": "具壽善現便白佛言：「希有！",
        "translation": "Guoshou Shancheng then said to the Buddha, Rarely!",
        "source": "T07n0220_559:0885c11_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0885c11_6"
    },
    {
        "source_sentence": "善為菩薩於深般若波羅蜜多，開示分別究竟著相。」",
        "translation": "It's good for a bodhisattva to reveal the characteristic of discriminating and ultimately attaching to the profound prajñāpāramitā.",
        "source": "T07n0220_559:0885c11_7"
    },
    {
        "source_sentence": "時，舍利子問善現言：「云何菩薩於深般若波羅蜜多所起著相？」",
        "translation": "Śāriputra then asked the good manifestation, How does a bodhisattva become attached to the profound prajñāpāramitā?",
        "source": "T07n0220_559:0885c13_0"
    },
    {
        "source_sentence": "善現答言：「若諸菩薩於色謂空，是名為著；",
        "translation": "Sunetra replied: If bodhisattvas think of form as emptiness, this is what they call attachment.",
        "source": "T07n0220_559:0885c14_1"
    },
    {
        "source_sentence": "於受、想、行、識謂空，是名為著；",
        "translation": "To think of feeling, perception, volition, and consciousness as emptiness is called ‘attachment’.",
        "source": "T07n0220_559:0885c15_2"
    },
    {
        "source_sentence": "於三世法謂三世法，是名為著，謂諸菩薩初發心時無量福生，是名為著。」",
        "translation": "To refer to the three worldly dharmas as the three worldly dharmas is called attachment, meaning that when bodhisattvas first give rise to mind, measureless merit arises, which is called attachment.",
        "source": "T07n0220_559:0885c16_0"
    },
    {
        "source_sentence": "時，天帝釋問善現言：「何緣如是亦名為著？」",
        "translation": "Śakra then asked the good manifestation, What's the reason it's also called attachment like this?",
        "source": "T07n0220_559:0885c17_1"
    },
    {
        "source_sentence": "善現答言：「執有心故，謂執此心能正迴向無上菩提，故名為著。",
        "translation": "Sunetra replied, It's because they cling to the existence of mind, meaning they cling to this mind that they can correctly return to unsurpassed enlightenment, so they're called attached.",
        "source": "T07n0220_559:0885c18_2"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0885c20_0"
    },
    {
        "source_sentence": "心本性空不能迴向。",
        "translation": "The mind's original nature is empty, and it can't be directed back.",
        "source": "T07n0220_559:0885c20_1"
    },
    {
        "source_sentence": "若諸菩薩欲教他人趣大菩提，應隨實相示現、勸導、讚勵、慶喜，於自無損亦不損他，",
        "translation": "If bodhisattvas want to teach others to enter the great path of enlightenment, they should show, encourage, praise, and rejoice according to their true characteristics, neither harming themselves nor harming others.",
        "source": "T07n0220_559:0885c20_2"
    },
    {
        "source_sentence": "諸佛世尊同所開許，遠離一切分別執著。」",
        "translation": "The buddhas and world-honored ones all approve of it, parting with all discriminating attachments.",
        "source": "T07n0220_559:0885c22_3"
    },
    {
        "source_sentence": "爾時，世尊讚善現曰：「善哉！",
        "translation": "At that point, the Bhagavān praised Shancheng and said, Good!",
        "source": "T07n0220_559:0885c23_4"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_559:0885c24_5"
    },
    {
        "source_sentence": "汝善能為諸菩薩說分別著相，令諸菩薩覺知遠離。",
        "translation": "You can well explain the characteristic of discriminating attachment for bodhisattvas so that they'll perceive it and be freed from it.",
        "source": "T07n0220_559:0885c24_6"
    },
    {
        "source_sentence": "復有此餘微細執著當為汝說，汝應諦聽！」",
        "translation": "Again, there are these other subtle attachments that will be explained for you, so listen closely!",
        "source": "T07n0220_559:0885c25_7"
    },
    {
        "source_sentence": "善現白言：「唯然！",
        "translation": "Sunetra said, Yes!",
        "source": "T07n0220_559:0885c26_8"
    },
    {
        "source_sentence": "願說！」",
        "translation": "May it be explained!",
        "source": "T07n0220_559:0885c26_9"
    },
    {
        "source_sentence": "佛告善現：「若菩薩乘善男子等，於諸佛所取相憶念隨所取相，皆名執著；",
        "translation": "The Buddha said to Sudarśana: Good men and women of the bodhisattva vehicle, if they remember the marks that are grasped by those buddhas, then whatever they grasp will be called clinging.",
        "source": "T07n0220_559:0885c26_10"
    },
    {
        "source_sentence": "若於三世諸佛世尊無漏法中深生隨喜，既隨喜已共諸有情迴向菩提，亦名執著。",
        "translation": "If someone deeply arouses joy in the uncontaminated dharmas of the buddhas and world-honored ones of the three times, then they'll share their joy with sentient beings and return to enlightenment, which is also called attachment.",
        "source": "T07n0220_559:0885c28_11"
    },
    {
        "source_sentence": "諸法實性非三世攝，不可取相、不可攀緣，亦無見聞覺知事故，於無上覺不可迴向。」",
        "translation": "The true nature of dharmas isn't included in the three times, doesn't grasp characteristics or cling to perceptual objects, has no views, hears, perceives, and knows things, and can't be directed back to unsurpassed awakening.",
        "source": "T07n0220_559:0886a01_12"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「諸法實性最為甚深。」",
        "translation": "It was then that the good manifestation said to the Buddha, The true nature of dharmas is most profound.",
        "source": "T07n0220_559:0886a03_13"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0886a04_14"
    },
    {
        "source_sentence": "本性離故。」",
        "translation": "It's because the original nature is free of it.",
        "source": "T07n0220_559:0886a04_15"
    },
    {
        "source_sentence": "善現復言：「如是般若波羅蜜多皆應敬禮。」",
        "translation": "Again, Shancheng said, Such is the prajñāpāramitā that should be venerated.",
        "source": "T07n0220_559:0886a04_16"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0886a05_17"
    },
    {
        "source_sentence": "法性無作、無覺知故。」",
        "translation": "It's because the Dharma nature is unconstructed and unaware.",
        "source": "T07n0220_559:0886a05_18"
    },
    {
        "source_sentence": "善現復言：「諸法本性無所造作、無覺知耶？」",
        "translation": "Again, Sunetra said, Are the original natures of dharmas not created and not perceived?",
        "source": "T07n0220_559:0886a06_19"
    },
    {
        "source_sentence": "佛言：「如是諸法本性唯一，無二、無造、無作，不可覺知、不可分別。",
        "translation": "The Buddha said, Thus, the original nature of dharmas is unique, nondual, uncreated, and unconstructed, which can't be perceived or discriminated.",
        "source": "T07n0220_559:0886a07_20"
    },
    {
        "source_sentence": "若諸菩薩能如是知，即能遠離一切執著。」",
        "translation": "If bodhisattvas can thus know it, they'll be able to part with all attachments.",
        "source": "T07n0220_559:0886a08_21"
    },
    {
        "source_sentence": "善現復言：「如是般若波羅蜜多難可覺知。」",
        "translation": "Again, Shancheng said, Thus, the perfection of wisdom is difficult to perceive.",
        "source": "T07n0220_559:0886a09_22"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0886a10_23"
    },
    {
        "source_sentence": "無知者故。」",
        "translation": "It's because there's no knowing.",
        "source": "T07n0220_559:0886a10_24"
    },
    {
        "source_sentence": "善現復言：「如是般若波羅蜜多不可思議。」",
        "translation": "Again, Shancheng said, Such is the inconceivable prajñāpāramitā.",
        "source": "T07n0220_559:0886a11_25"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0886a12_0"
    },
    {
        "source_sentence": "非心、心所能了知故。」",
        "translation": "It's because it's not something that the mind and mental factors can know.",
        "source": "T07n0220_559:0886a12_1"
    },
    {
        "source_sentence": "善現復言：「如是般若波羅蜜多無所造作。」",
        "translation": "Again, Shancheng said, Thus, the prajñāpāramitā has nothing to create.",
        "source": "T07n0220_559:0886a12_2"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T07n0220_559:0886a13_3"
    },
    {
        "source_sentence": "以諸作者不可得故。」",
        "translation": "It's because the authors are unobtainable.",
        "source": "T07n0220_559:0886a13_4"
    },
    {
        "source_sentence": "善現復言：「云何菩薩應行般若波羅蜜多？」",
        "translation": "Again, Shancheng said, How should bodhisattvas practice the perfection of wisdom?",
        "source": "T07n0220_559:0886a14_5"
    },
    {
        "source_sentence": "佛言：「菩薩若不行色，亦復不行受、想、行、識，是行般若波羅蜜多；",
        "translation": "The Buddha said, If a bodhisattva doesn't practice form and doesn't practice sensation, perception, volition, or consciousness, this is practicing the perfection of wisdom.",
        "source": "T07n0220_559:0886a15_6"
    },
    {
        "source_sentence": "若不行色空，亦復不行受、想、行、識空，是行般若波羅蜜多；",
        "translation": "If someone doesn’t practice emptiness of form and also doesn’t practice emptiness of feeling, perception, volition, or consciousness, this is practicing the perfection of wisdom.",
        "source": "T07n0220_559:0886a16_7"
    },
    {
        "source_sentence": "若不行色不圓滿相，亦復不行受、想、行、識不圓滿相，是行般若波羅蜜多。",
        "translation": "If someone doesn't practice form that isn't perfect, and they don't practice sensation, perception, volition, or consciousness that aren't perfect, this is practicing the perfection of prajñāpāramitā.",
        "source": "T07n0220_559:0886a18_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0886a19_1"
    },
    {
        "source_sentence": "色不圓滿即非色，受、想、行、識不圓滿即非受、想、行、識，若不如是行，",
        "translation": "When form is incomplete, it's not form; when feeling, perception, volition, and consciousness aren't complete, it's not feeling, perception, volition, or consciousness; and if they don't practice like this, then they're not feeling, perception, volition, or consciousness.",
        "source": "T07n0220_559:0886a19_2"
    },
    {
        "source_sentence": "是行般若波羅蜜多。」",
        "translation": "This is the practice of prajñāpāramitā.",
        "source": "T07n0220_559:0886a21_3"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「甚奇！",
        "translation": "It was then that the good manifestation said to the Buddha, Very marvelous!",
        "source": "T07n0220_559:0886a21_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0886a22_5"
    },
    {
        "source_sentence": "希有！",
        "translation": "Rarely!",
        "source": "T07n0220_559:0886a22_6"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T07n0220_559:0886a22_7"
    },
    {
        "source_sentence": "能於執著說無著相。」",
        "translation": "He's able to explain the mark of no attachment in terms of attachment.",
        "source": "T07n0220_559:0886a22_8"
    },
    {
        "source_sentence": "佛告善現：「若不行色、受、想、行、識無執著相，是行般若波羅蜜多。",
        "translation": "The Buddha told Shancheng, If you don't practice form, sensation, perception, volition, and consciousness without the characteristic of attachment, this is practicing the perfection of prajñāpāramitā.",
        "source": "T07n0220_559:0886a23_9"
    },
    {
        "source_sentence": "若諸菩薩能如是行，便於諸色、受、想、行、識不生執著，於預流果乃至無上正等菩提不生執著。",
        "translation": "If bodhisattvas can thus practice, then they won't become attached to form, feeling, perception, volition, or consciousness and won't become attached to the fruit of pre-flow... unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0886a24_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0886a26_11"
    },
    {
        "source_sentence": "超一切著無障礙覺名薩婆若。",
        "translation": "To transcend all attachments and unobstructed awakening is called sarvajña.",
        "source": "T07n0220_559:0886a26_12"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_559:0886a27_13"
    },
    {
        "source_sentence": "若諸菩薩欲超諸著，應行般若波羅蜜多。」",
        "translation": "If bodhisattvas want to transcend attachment, they should practice the perfection of wisdom.",
        "source": "T07n0220_559:0886a27_14"
    },
    {
        "source_sentence": "具壽善現復白佛言：「希有！",
        "translation": "Guoshou Shancheng then said to the Buddha, Rarely!",
        "source": "T07n0220_559:0886a28_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0886a29_16"
    },
    {
        "source_sentence": "甚深法性若說不說俱無增減。」",
        "translation": "The profound Dharma nature is that there's neither increase nor decrease if it's explained or not explained.",
        "source": "T07n0220_559:0886a29_17"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_559:0886b01_18"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0886b01_19"
    },
    {
        "source_sentence": "譬如虛空，假使諸佛盡其壽量或讚或毀，而彼虛空無增無減，甚深法性亦復如是，",
        "translation": "“Furthermore, just as space is neither increased nor diminished even when the buddhas may praise or disparage it at the end of their life spans, similarly space neither increases nor decreases. The profound dharma-nature is also like this.",
        "source": "T07n0220_559:0886b01_20"
    },
    {
        "source_sentence": "若說不說俱無增減。",
        "translation": "If it's explained and not explained, there's neither increase nor decrease.",
        "source": "T07n0220_559:0886b03_21"
    },
    {
        "source_sentence": "譬如幻士，於讚毀時無喜無憂、不增不減，甚深法性亦復如是，若說不說如本無異。」",
        "translation": "It's like an illusionist who doesn't rejoice or grieve when he praises or disparages, neither increases nor decreases, and so is the profound Dharma nature; if he teaches it or doesn't teach it as before, there's no difference.",
        "source": "T07n0220_559:0886b03_22"
    },
    {
        "source_sentence": "具壽善現復白佛言：「諸菩薩眾行深般若波羅蜜多甚為難事，謂深般若波羅蜜多若修不修無增無減、無進無退。",
        "translation": "Guoshou Shancheng then said to the Buddha, The profound prajñāpāramitā of the practices of bodhisattvas is a very difficult thing, meaning that if they cultivate it or don't cultivate it, there's no increase or decrease, and there's no advancement or retreat.",
        "source": "T07n0220_559:0886b05_23"
    },
    {
        "source_sentence": "諸菩薩眾修行般若波羅蜜多，如修虛空都無所有。",
        "translation": "The bodhisattvas cultivate the perfection of prajñāpāramitā, just as they cultivate space that has no existence.",
        "source": "T07n0220_559:0886b08_24"
    },
    {
        "source_sentence": "諸菩薩眾，我等有情皆應敬禮、尊重讚歎，所以者何？",
        "translation": "All the bodhisattvas, we sentient beings, should venerate and praise them.",
        "source": "T07n0220_559:0886b09_25"
    },
    {
        "source_sentence": "諸菩薩眾為度有情被功德鎧，如有欲與虛空戰諍被堅固鎧；",
        "translation": "In order to save sentient beings the enlightening beings are armed with the armor of virtue, just as if they wanted to fight space and were to be armed with a sturdy armor.",
        "source": "T07n0220_559:0886b10_26"
    },
    {
        "source_sentence": "諸菩薩眾為度有情被功德鎧，如有健者欲拔虛空置高勝處。",
        "translation": "In order to save sentient beings who wear the armor of merit, the bodhisattvas are like a strong man who wants to pull up space and place it in a lofty place.",
        "source": "T07n0220_559:0886b12_27"
    },
    {
        "source_sentence": "諸菩薩眾為如虛空諸有情類，求趣無上正等菩提，名大勇猛，得大精進波羅蜜多。」",
        "translation": "For the sake of sentient beings like space who seek unsurpassed perfect enlightenment, the bodhisattvas are called great courageous and attain the great effort-pāramitā.",
        "source": "T07n0220_559:0886b13_28"
    },
    {
        "source_sentence": "時，有苾芻作如是念：「應禮般若波羅蜜多，此中都無諸法生滅。」",
        "translation": "A monk then had this thought, You should venerate the prajñāpāramitā, for there are no dharmas that arise or cease here.",
        "source": "T07n0220_559:0886b15_29"
    },
    {
        "source_sentence": "時，天帝釋問善現言：「菩薩欲學甚深般若波羅蜜多，當如何學？」",
        "translation": "Śakra Devānām-Indra then asked the good manifestation, How will a bodhisattva who wants to train in the profound prajñāpāramitā do so?",
        "source": "T07n0220_559:0886b16_30"
    },
    {
        "source_sentence": "善現答言：「菩薩欲學甚深般若波羅蜜多，當如虛空精勤修學。」",
        "translation": "Shancheng answered, If a bodhisattva wants to train in the profound perfection of wisdom, he should diligently cultivate it like space.",
        "source": "T07n0220_559:0886b18_31"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「若諸有情能學般若波羅蜜多，云何守護？」",
        "translation": "Śakra then said to the Buddha, If sentient beings can train in the perfection of wisdom, how will they guard it?",
        "source": "T07n0220_559:0886b19_32"
    },
    {
        "source_sentence": "爾時，善現語帝釋言：「汝見是法可守護不？」",
        "translation": "It was then that Sunetra said to Śakra, Do you see this teaching that can be guarded?",
        "source": "T07n0220_559:0886b21_33"
    },
    {
        "source_sentence": "天帝釋言：「不也！",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T07n0220_559:0886b22_34"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T07n0220_559:0886b22_35"
    },
    {
        "source_sentence": "善現語言：「若諸菩薩如大般若波羅蜜多所說而行，即為守護。",
        "translation": "Sunetra said, Suppose bodhisattvas practice as explained in the great prajñāpāramitā, which is to guard.",
        "source": "T07n0220_559:0886b22_36"
    },
    {
        "source_sentence": "若離般若波羅蜜多，人非人等皆得其便。",
        "translation": "If someone parts with the perfection of wisdom, people and non-people will all get an advantage over them.",
        "source": "T07n0220_559:0886b24_0"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0886b24_1"
    },
    {
        "source_sentence": "若欲守護行深般若波羅蜜多諸菩薩者，不異有人發勤精進守護虛空，唐設劬勞都無所益。",
        "translation": "If someone wants to guard the bodhisattvas who practice the profound prajñāpāramitā, they're no different from someone who arouses diligence and makes effort to guard space, which would be useless if they were to create trouble.",
        "source": "T07n0220_559:0886b25_2"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0886b27_3"
    },
    {
        "source_sentence": "有能守護響聲等不？」",
        "translation": "Is there someone who can guard the sound and so forth?",
        "source": "T07n0220_559:0886b27_4"
    },
    {
        "source_sentence": "天帝釋言：「不也！",
        "translation": "Śakra Devānām-Indra said, No!",
        "source": "T07n0220_559:0886b27_5"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T07n0220_559:0886b28_6"
    },
    {
        "source_sentence": "善現語言：「若欲守護行深般若波羅蜜多諸菩薩者亦復如是，唐設劬勞都無所益。」",
        "translation": "Sunetra said, So it is with those bodhisattvas who want to guard and practice the profound prajñāpāramitā of the profound prajñāpāramitā, and they don't benefit from the troubles that are created in the Tang.",
        "source": "T07n0220_559:0886b28_7"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0886c01_8"
    },
    {
        "source_sentence": "諸菩薩眾行深般若波羅蜜多，雖知諸法皆如響等，而不觀見亦不顯示能如是住，",
        "translation": "The bodhisattvas practice the profound prajñāpāramitā, knowing all dharmas are like echoes and so forth, but they don't contemplate or show that they can thus abide.",
        "source": "T07n0220_559:0886c01_9"
    },
    {
        "source_sentence": "是行般若波羅蜜多。」",
        "translation": "This is the practice of prajñāpāramitā.",
        "source": "T07n0220_559:0886c03_10"
    },
    {
        "source_sentence": "爾時，世尊威神力故，令此三千大千世界四大天王，及天帝釋、大梵王等一切天眾來詣佛所，",
        "translation": "At that time the World-honored One, imbued with supernatural powers, caused the four great celestial kings of this billion-world-galactic universe to come to see the Buddha.",
        "source": "T07n0220_559:0886c03_11"
    },
    {
        "source_sentence": "頂禮雙足，却住一面。",
        "translation": "He bowed his head at both feet and withdrew to one side.",
        "source": "T07n0220_559:0886c05_12"
    },
    {
        "source_sentence": "以佛神力，於十方界各見千佛宣說般若波羅蜜多，名字相狀皆同於此，",
        "translation": "Because of the spiritual power of the Buddha, in each of the ten directions he saw a thousand buddhas expounding the perfection of wisdom. The names and forms of those buddhas were all the same as these.",
        "source": "T07n0220_559:0886c06_13"
    },
    {
        "source_sentence": "請說般若波羅蜜多苾芻眾首皆名善現，問難般若波羅蜜多諸天眾首皆名帝釋。",
        "translation": "He asked to explain that the heads of the monks who taught the prajñāpāramitā were all called Śākyamuni, and he asked that the heads of the gods who taught the difficult prajñāpāramitā were all called Indra.",
        "source": "T07n0220_559:0886c07_14"
    },
    {
        "source_sentence": "爾時，世尊告善現曰：「慈氏菩薩當證無上正等覺時，即以此名亦於此處宣說般若波羅蜜多。」",
        "translation": "It was then that the Bhagavān addressed Shancheng, When Maitreya Bodhisattva realizes unsurpassed perfect enlightenment, this name will also be used here to proclaim the prajñāpāramitā.",
        "source": "T07n0220_559:0886c09_15"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「慈氏菩薩當證無上正等覺時，以何等名即於此處宣說般若波羅蜜多？」",
        "translation": "At that point, Shancheng then said to the Buddha, When Maitreya Bodhisattva realizes unsurpassed perfect enlightenment, what name will he proclaim the prajñāpāramitā here?",
        "source": "T07n0220_559:0886c11_16"
    },
    {
        "source_sentence": "佛告善現：「慈氏菩薩當證無上正等覺時，不說色空法，不說受、想、行、識空法；",
        "translation": "The Buddha told Kasyapa: When Maitreya Bodhisattva realizes supreme perfect enlightenment, he does not teach the doctrine of the emptiness of form; he does not teach the doctrine of the emptiness of feeling, perception, volition, or consciousness.",
        "source": "T07n0220_559:0886c14_17"
    },
    {
        "source_sentence": "不說色縛脫法，不說受、想、行、識縛脫法。」",
        "translation": "They don't talk about the method of liberation from form bonds, and they don't talk about the method of liberation from the bonds of feeling, perception, volition, and consciousness.",
        "source": "T07n0220_559:0886c15_18"
    },
    {
        "source_sentence": "具壽善現復白佛言：「甚深般若波羅蜜多最為清淨。」",
        "translation": "Guoshou Shancheng then said to the Buddha, The profound prajñāpāramitā is the most pure.",
        "source": "T07n0220_559:0886c16_19"
    },
    {
        "source_sentence": "佛告善現：「色清淨故，甚深般若波羅蜜多最為清淨；",
        "translation": "The Buddha told Shancheng, Because form is pure, the profound prajñāpāramitā is the purest.",
        "source": "T07n0220_559:0886c17_20"
    },
    {
        "source_sentence": "受、想、行、識清淨故，甚深般若波羅蜜多最為清淨；",
        "translation": "Because feeling, perception, volition, and consciousness are purified, profound transcendent wisdom is the most purified.",
        "source": "T07n0220_559:0886c19_0"
    },
    {
        "source_sentence": "虛空清淨故，甚深般若波羅蜜多最為清淨；",
        "translation": "Because space is pure, profound transcendent wisdom is the purest.",
        "source": "T07n0220_559:0886c20_1"
    },
    {
        "source_sentence": "色無染故，甚深般若波羅蜜多最為清淨；",
        "translation": "Because form is undefiled, the profound transcendent wisdom-pāramitā is most pure.",
        "source": "T07n0220_559:0886c21_2"
    },
    {
        "source_sentence": "受、想、行、識無染故，甚深般若波羅蜜多最為清淨；",
        "translation": "Because feeling, perception, volition, and consciousness are unstained, profound transcendent wisdom is the most pure.",
        "source": "T07n0220_559:0886c22_3"
    },
    {
        "source_sentence": "虛空無染故，甚深般若波羅蜜多最為清淨。」",
        "translation": "Because space is undefiled, the profound prajñāpāramitā is the most pure.",
        "source": "T07n0220_559:0886c23_4"
    },
    {
        "source_sentence": "具壽善現復白佛言：「若諸有情受持、讀誦甚深般若波羅蜜多，終不橫死亦無橫病及橫殃禍，",
        "translation": "Guoshou Shancheng then said to the Buddha, If sentient beings memorize and recite the profound prajñāpāramitā, they'll never die indiscriminately or suffer from illness or misfortune.",
        "source": "T07n0220_559:0886c24_5"
    },
    {
        "source_sentence": "常為無量百千天神恭敬圍遶隨逐守護。",
        "translation": "He's always surrounded and guarded by measureless hundreds of thousands of celestial spirits with respect.",
        "source": "T07n0220_559:0886c26_6"
    },
    {
        "source_sentence": "若善男子、善女人等於黑白月各第八日、第十四日、第十五日，在在處處讀誦講說甚深般若波羅蜜多，",
        "translation": "Good men and good women, on the eighth, fourteenth, and fifteenth days of each month in the black and white months, they read, recite, and teach the profound prajñāpāramitā everywhere.",
        "source": "T07n0220_559:0886c27_7"
    },
    {
        "source_sentence": "當獲無邊功德勝利。」",
        "translation": "You'll attain limitless merit and benefit.",
        "source": "T07n0220_559:0886c29_8"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_559:0887a01_9"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0887a01_10"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_559:0887a01_11"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_559:0887a01_12"
    },
    {
        "source_sentence": "甚深般若波羅蜜多說、聽等時多有留難。",
        "translation": "When the profound prajñāpāramitā is taught and heard, there are many difficulties that remain.",
        "source": "T07n0220_559:0887a02_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0887a03_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多是大珍寶多諸怨賊，於一切法無著無取。",
        "translation": "The profound prajñāpāramitā is a great treasure that's full of enemies and thieves, who have no attachment or grasping to all things.",
        "source": "T07n0220_559:0887a03_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0887a04_2"
    },
    {
        "source_sentence": "以一切法都無所有、不可得故。",
        "translation": "It's because all dharmas lack existence and are unobtainable.",
        "source": "T07n0220_559:0887a04_3"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_559:0887a05_4"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，於一切法無所得故，非能染污非所染污。",
        "translation": "Because the profound prajñāpāramitā has nothing to attain in all dharmas, it's neither defiled nor undefiled.",
        "source": "T07n0220_559:0887a05_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0887a07_6"
    },
    {
        "source_sentence": "無法不能染無法故。",
        "translation": "It's because there's nothing that can't be defiled and nothing that can't be defiled.",
        "source": "T07n0220_559:0887a07_7"
    },
    {
        "source_sentence": "以無染故說名無染波羅蜜多，由此般若波羅蜜多無染污故，餘一切法亦無染污。",
        "translation": "Because the prajñāpāramitā is undefiled, all other dharmas are also undefiled.",
        "source": "T07n0220_559:0887a07_8"
    },
    {
        "source_sentence": "若於如是亦不分別，是行般若波羅蜜多。",
        "translation": "If someone doesn't discriminate between such and such, they're practicing the perfection of wisdom.",
        "source": "T07n0220_559:0887a09_9"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_559:0887a10_10"
    },
    {
        "source_sentence": "甚深般若波羅蜜多無分別故，於一切法無見不見、無取無捨。」",
        "translation": "Because the profound prajñāpāramitā has no discrimination, there's no view or non-view of all dharmas and no grasping or equanimity.",
        "source": "T07n0220_559:0887a10_11"
    },
    {
        "source_sentence": "時，有無量百千天子住虛空中，歡喜踊躍互相慶慰，同聲唱言：「我等今者於贍部洲見佛第二轉妙法輪。」",
        "translation": "Measureless hundreds of thousands of celestial beings then stood in space, rejoicing and jumping joyfully to greet each other. They all shouted with one voice, We now see the Buddha's second turning of the wonderful wheel of the Dharma in Jambudvīpa.",
        "source": "T07n0220_559:0887a12_12"
    },
    {
        "source_sentence": "爾時，世尊告善現曰：「如是法輪非第一轉亦非第二，甚深般若波羅蜜多無轉還故。」",
        "translation": "It was then that the Bhagavān addressed Shancheng, Thus, the wheel of the Dharma isn't the first turning or second, and it's because the profound prajñāpāramitā has no turning back.",
        "source": "T07n0220_559:0887a14_13"
    },
    {
        "source_sentence": "爾時，善現便白佛言：「甚深般若波羅蜜多是為廣大波羅蜜多，於一切法無縛無著，",
        "translation": "It was then that the good manifestation said to the Buddha, The profound prajñāpāramitā is a vast pāramitā that's unfettered and unattached to all things.",
        "source": "T07n0220_559:0887a16_14"
    },
    {
        "source_sentence": "雖證菩提而無所證，雖轉法輪而無所轉，無法可示、無法可顯、無法可得、無法可轉、無法可還，",
        "translation": "Though they realize enlightenment, yet nothing is realized; though they turn the wheel of teaching, yet nothing is turned; there is nothing to show, nothing to show, nothing to obtain, nothing to turn, and nothing to turn back.",
        "source": "T07n0220_559:0887a18_15"
    },
    {
        "source_sentence": "以一切法畢竟不生亦復不滅，不生滅故無轉無還。」",
        "translation": "It's because all dharmas ultimately don't arise and don't cease, and because they don't arise and cease, there's no turning or returning.",
        "source": "T07n0220_559:0887a20_16"
    },
    {
        "source_sentence": "爾時，世尊告善現曰：「如是！",
        "translation": "It was then that the Bhagavān addressed Sunetra, So it is!",
        "source": "T07n0220_559:0887a21_17"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0887a22_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0887a22_19"
    },
    {
        "source_sentence": "以空、無相、無願、無作、無生、無滅、無性法中，若轉若還俱不可得。",
        "translation": "It's because emptiness, signlessness, wishlessness, noncontrivance, nonarising, noncessation, and the dharmas without nature are both unobtainable whether they arise or return.",
        "source": "T07n0220_559:0887a22_20"
    },
    {
        "source_sentence": "若能如是宣說開示，是名善淨宣說般若波羅蜜多，此中都無說者、受者，",
        "translation": "If someone can thus explain and reveal it, this is called a well-purified explanation of the prajñāpāramitā, which has no speaker or recipient here.",
        "source": "T07n0220_559:0887a24_21"
    },
    {
        "source_sentence": "亦無作證得涅槃者，亦無說法作福田者，福田無故福性亦空，表示名言皆不可得，",
        "translation": "Nor is there anyone who realizes nirvāṇa, nor does he teach the Dharma to create fields of merit. Because there are no fields of merit, the nature of merit is also empty, and it means that names and words are all ungraspable.",
        "source": "T07n0220_559:0887a25_22"
    },
    {
        "source_sentence": "故名廣大波羅蜜多。」",
        "translation": "That's why it's called the vast perfection of wisdom.",
        "source": "T07n0220_559:0887a27_23"
    },
    {
        "source_sentence": "爾時，善現復白佛言：「甚深般若波羅蜜多是為無邊波羅蜜多，如太虛空無邊際故；",
        "translation": "It was then that the good manifestation again said to the Buddha: The profound perfection of wisdom is called the boundless perfection because it is like space, which has no limit.",
        "source": "T07n0220_559:0887a28_24"
    },
    {
        "source_sentence": "是為正等波羅蜜多，以一切法性平等故；",
        "translation": "These were the perfections of righteousness and so forth, because all things are equal in their essential nature.",
        "source": "T07n0220_559:0887a29_25"
    },
    {
        "source_sentence": "是為遠離波羅蜜多，以一切法畢竟空故；",
        "translation": "This is to be far removed from the perfections, because all things are ultimately void.",
        "source": "T07n0220_559:0887b01_26"
    },
    {
        "source_sentence": "是為難伏波羅蜜多，以一切法不可得故；",
        "translation": "This is the perfection of being difficult to overcome, because all things are ungraspable.",
        "source": "T07n0220_559:0887b02_27"
    },
    {
        "source_sentence": "是為無跡波羅蜜多，以一切法無名體故；",
        "translation": "This is the perfection of signlessness, because all things have no names or essence.",
        "source": "T07n0220_559:0887b03_28"
    },
    {
        "source_sentence": "是為無行波羅蜜多，以一切法無往來故；",
        "translation": "This is the perfection of practicelessness, because all things have no going or coming.",
        "source": "T07n0220_559:0887b04_29"
    },
    {
        "source_sentence": "是為無奪波羅蜜多，以一切法不可取故；",
        "translation": "This is the perfection of nongrasping, because all things cannot be grasped.",
        "source": "T07n0220_559:0887b05_30"
    },
    {
        "source_sentence": "是為無盡波羅蜜多，以一切法不可盡故；",
        "translation": "These were the inexhaustible transcendent ways, because all things cannot be exhausted.",
        "source": "T07n0220_559:0887b06_31"
    },
    {
        "source_sentence": "是為無生波羅蜜多，以一切法不可生故；",
        "translation": "This is the perfection of nonorigination, because all things cannot be produced.",
        "source": "T07n0220_559:0887b07_32"
    },
    {
        "source_sentence": "是為無作波羅蜜多，以諸作者不可得故；",
        "translation": "These are the unmanifest transcendent ways, because their authors are ungraspable.",
        "source": "T07n0220_559:0887b08_33"
    },
    {
        "source_sentence": "是為無知波羅蜜多，以諸知者不可得故；",
        "translation": "This is the perfection of knowledgelessness, because those who have knowledge cannot attain it.",
        "source": "T07n0220_559:0887b09_34"
    },
    {
        "source_sentence": "是為無轉波羅蜜多，諸死生者不可得故；",
        "translation": "This is the unmanifesting of the transcendent ways, because those who die and are born cannot obtain them.",
        "source": "T07n0220_559:0887b10_35"
    },
    {
        "source_sentence": "是為無垢波羅蜜多，煩惱淨故；",
        "translation": "These are the perfections of immaculateness, because they purify defilement.",
        "source": "T07n0220_559:0887b11_36"
    },
    {
        "source_sentence": "是為無染波羅蜜多，以所依處不可得故；",
        "translation": "These are the perfections of immaculateness, because their support is ungraspable.",
        "source": "T07n0220_559:0887b12_0"
    },
    {
        "source_sentence": "是為無壞波羅蜜多，離前際故；",
        "translation": "This is the perfection of nondestruction, because it transcends all past states.",
        "source": "T07n0220_559:0887b12_1"
    },
    {
        "source_sentence": "是為如幻波羅蜜多，以一切法皆不生故；",
        "translation": "“Good son, this is like the illusion-pāramitā, because all things do not arise.",
        "source": "T07n0220_559:0887b13_2"
    },
    {
        "source_sentence": "是為如夢波羅蜜多，是諸意識平等性故；",
        "translation": "This is the equality of all conscious constructs, like the perfection of dreams.",
        "source": "T07n0220_559:0887b14_3"
    },
    {
        "source_sentence": "是無戲論波羅蜜多，覺諸戲論平等性故；",
        "translation": "They are the perfection of nonconceptual thought because they perceive the equality of conceptual thought.",
        "source": "T07n0220_559:0887b15_4"
    },
    {
        "source_sentence": "是無思慮波羅蜜多，諸思慮法畢竟無故；",
        "translation": "This is the perfection of nonconceptual thoughtlessness, because all principles of thought are ultimately nonexistent.",
        "source": "T07n0220_559:0887b16_5"
    },
    {
        "source_sentence": "是無動轉波羅蜜多，住法界故；",
        "translation": "They are the perfection of unshakable, because they abide in the realm of reality.",
        "source": "T07n0220_559:0887b17_6"
    },
    {
        "source_sentence": "是為離染波羅蜜多，以一切法不虛妄故；",
        "translation": "This is the perfection of freedom from defilement, because all things are not false.",
        "source": "T07n0220_559:0887b18_7"
    },
    {
        "source_sentence": "是無作用波羅蜜多，於一切法無分別故；",
        "translation": "It is the perfection of powerlessness, because it does not discriminate all things.",
        "source": "T07n0220_559:0887b19_8"
    },
    {
        "source_sentence": "是為寂靜波羅蜜多，一切法相不可得故；",
        "translation": "This is the perfection of tranquility, because all characteristics of things are ungraspable.",
        "source": "T07n0220_559:0887b20_9"
    },
    {
        "source_sentence": "是無煩惱波羅蜜多，離過失故；",
        "translation": "They are the perfection of nondefilement, because they are free from faults.",
        "source": "T07n0220_559:0887b21_0"
    },
    {
        "source_sentence": "是無有情波羅蜜多，有情實際不可得故；",
        "translation": "It is the perfection of nonexistence of sentient beings, because the reality of sentient beings cannot be grasped.",
        "source": "T07n0220_559:0887b21_1"
    },
    {
        "source_sentence": "是為無斷波羅蜜多，以一切法無等起故；",
        "translation": "This is the perfection of noninterruption, because all things have no equal arising.",
        "source": "T07n0220_559:0887b22_2"
    },
    {
        "source_sentence": "是無二邊波羅蜜多，於一切法無執著故；",
        "translation": "It is the perfection of nonduality, because it does not cling to anything.",
        "source": "T07n0220_559:0887b23_3"
    },
    {
        "source_sentence": "是無取著波羅蜜多，於二乘地無分別故；",
        "translation": "It is the perfection of nonattachment, because there is no discrimination in the states of the two vehicles.",
        "source": "T07n0220_559:0887b24_4"
    },
    {
        "source_sentence": "是無分別波羅蜜多，覺諸分別平等性故；",
        "translation": "They are the perfection of nondiscriminating, because they awaken to the equality of discrimination.",
        "source": "T07n0220_559:0887b25_5"
    },
    {
        "source_sentence": "是為無量波羅蜜多，無量法故；",
        "translation": "These are the immeasurable perfections, because they are immeasurable dharmas.",
        "source": "T07n0220_559:0887b26_6"
    },
    {
        "source_sentence": "是為無起波羅蜜多，離我法故；",
        "translation": "These are the transcendent ways of nonorigination, because they are free from self and things.",
        "source": "T07n0220_559:0887b27_7"
    },
    {
        "source_sentence": "是為虛空波羅蜜多，於一切法皆無礙故；",
        "translation": "These were the transcendent ways of space, because all things are unobstructed.",
        "source": "T07n0220_559:0887b27_8"
    },
    {
        "source_sentence": "是為不生波羅蜜多，以一切法皆不起故；",
        "translation": "This is the perfection of nonarising, because all things do not arise.",
        "source": "T07n0220_559:0887b28_9"
    },
    {
        "source_sentence": "是為無常波羅蜜多，以一切法常無性故；",
        "translation": "This is the perfection of impermanence, because all things are permanent and without essence.",
        "source": "T07n0220_559:0887b29_10"
    },
    {
        "source_sentence": "是名為苦波羅蜜多，是逼惱法平等性故；",
        "translation": "This is called the perfection of suffering because it is the equality of oppressive states.",
        "source": "T07n0220_559:0887c01_11"
    },
    {
        "source_sentence": "是為無我波羅蜜多，於一切法無執著故；",
        "translation": "These are the transcendent ways of selflessness, because they do not cling to anything.",
        "source": "T07n0220_559:0887c02_12"
    },
    {
        "source_sentence": "是名為空波羅蜜多，以一切法不可得故；",
        "translation": "This is called the perfection of emptiness because all things are ungraspable.",
        "source": "T07n0220_559:0887c03_13"
    },
    {
        "source_sentence": "是為無相波羅蜜多，以一切法離諸相故；",
        "translation": "This is the perfection of signlessness, because all things are free from signs.",
        "source": "T07n0220_559:0887c04_14"
    },
    {
        "source_sentence": "是為無願波羅蜜多，以一切法無所成故；",
        "translation": "“These are the transcendent ways of wishlessness, because all things have no basis.",
        "source": "T07n0220_559:0887c05_15"
    },
    {
        "source_sentence": "是名為力波羅蜜多，以一切法不可屈故；",
        "translation": "This is called the perfection of power, because all things cannot be overpowered.",
        "source": "T07n0220_559:0887c06_16"
    },
    {
        "source_sentence": "是無量佛法波羅蜜多，過數量故；",
        "translation": "They are the perfections of immeasurable buddha-teachings, because they are beyond number.",
        "source": "T07n0220_559:0887c07_17"
    },
    {
        "source_sentence": "是無所畏波羅蜜多，心無怯故；",
        "translation": "They are the perfections of fearlessness, because their minds are free from fear.",
        "source": "T07n0220_559:0887c08_18"
    },
    {
        "source_sentence": "是為真如波羅蜜多，以一切法不虛妄故；",
        "translation": "These were the transcendent ways of truth, because all things are not false.",
        "source": "T07n0220_559:0887c08_19"
    },
    {
        "source_sentence": "是為自然波羅蜜多，以一切法無自性故。」",
        "translation": "This is the natural perfection, because all dharmas lack self-nature.",
        "source": "T07n0220_559:0887c09_20"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_559:0887c10_21"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0887c11_0"
    },
    {
        "source_sentence": "如汝所說。」",
        "translation": "As you say.",
        "source": "T07n0220_559:0887c11_1"
    },
    {
        "source_sentence": "第五分不思議品第十之一",
        "translation": "The Fifth Part of the Inconceivable Chapter, No. 11",
        "source": "T07n0220_559:0887c12_0"
    },
    {
        "source_sentence": "時，天帝釋作是念言：「若有但聞甚深般若波羅蜜多，當知已曾供養諸佛、發弘誓願，",
        "translation": "Śakra Devānām-Indra then had this thought, saying, “If one hears only the profound prajñāpāramitā, know that they have served the buddhas and made great vows.",
        "source": "T07n0220_559:0887c13_0"
    },
    {
        "source_sentence": "況能受持、讀誦、書寫、為他演說、如教修行！",
        "translation": "How much more so when they can memorize, recite, write, explain it for others, and practice it as instructed!",
        "source": "T07n0220_559:0887c14_1"
    },
    {
        "source_sentence": "當知是人已於過去無量佛所，親近供養、多種善根，曾聞般若波羅蜜多，",
        "translation": "“Furthermore, reverend Śāriputra, you should know that these people had already been with innumerable buddhas of the past, having become intimate with them, honored them, and cultivated a great many roots of goodness. They had heard the Perfection of Wisdom",
        "source": "T07n0220_559:0887c15_2"
    },
    {
        "source_sentence": "聞已受持、讀誦、書寫、為他演說、如教修行，或於此經能問能答，由先福力今辦此事。",
        "translation": "Having heard it, they memorize it, recite it, write it, explain it for others, and practice it according to the teachings, or may be able to ask questions and answer questions about this sūtra, which is now done because of the power of their past merit.",
        "source": "T07n0220_559:0887c17_3"
    },
    {
        "source_sentence": "若諸有情已曾供養無量諸佛功德純淨，聞深般若波羅蜜多，其心不驚、不恐、不怖。」",
        "translation": "If sentient beings who have previously made offerings to measureless buddhas and whose merits are pure, when they hear the profound prajñāpāramitā, their minds aren't frightened, fearless, or terrified.",
        "source": "T07n0220_559:0887c19_4"
    },
    {
        "source_sentence": "時，舍利子知天帝釋心之所念，便白佛言：「若諸菩薩於深般若波羅蜜多能生信解，",
        "translation": "Knowing what the lord of gods thought, Śāriputra said to the Buddha: If bodhisattvas have faith in the profound prajñāpāramitā,",
        "source": "T07n0220_559:0887c21_5"
    },
    {
        "source_sentence": "當知是人如不退轉諸大菩薩。",
        "translation": "You should know that this person is like the great bodhisattvas who don't regress.",
        "source": "T07n0220_559:0887c23_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0887c23_7"
    },
    {
        "source_sentence": "如是般若波羅蜜多理趣甚深極難信解，若於前世不久修行甚深般若波羅蜜多，",
        "translation": "Thus, the principle and aim of the perfection of wisdom are so profound and extremely difficult to believe that if someone cultivates the profound perfection of wisdom in a previous life before long,",
        "source": "T07n0220_559:0887c24_8"
    },
    {
        "source_sentence": "不於佛前請問聽受，不於佛所多種善根，豈暫得聞即能信解？",
        "translation": "If someone doesn't ask questions in front of the Buddha and listen to them, and doesn't have many good roots at the Buddha's place, how can they hear them for a while and then be able to believe and understand them?",
        "source": "T07n0220_559:0887c26_0"
    },
    {
        "source_sentence": "若有聞說甚深般若波羅蜜多毀謗、拒逆，當知是人先世已於甚深般若波羅蜜多毀謗、拒逆。",
        "translation": "If someone hears the teaching of the profound prajñāpāramitā and denigrates it or rejects it, they should know that person in a previous life denigrated and rejected the profound prajñāpāramitā.",
        "source": "T07n0220_559:0887c27_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0887c29_2"
    },
    {
        "source_sentence": "如是愚人善根少故，於深般若波羅蜜多不生淨信；",
        "translation": "Because the roots of goodness of such ignorant people are few, they do not give rise to pure faith in the profound prajñāpāramitā.",
        "source": "T07n0220_559:0887c29_3"
    },
    {
        "source_sentence": "未曾請問佛及弟子甚深義故，聞說般若波羅蜜多甚深義趣毀謗、拒逆。」",
        "translation": "I've never asked the Buddha or his disciples about the profound meaning of the profound meaning and heard them teach the profound meaning of the prajñāpāramitā, which is to disparage and reject it.",
        "source": "T07n0220_559:0888a01_4"
    },
    {
        "source_sentence": "爾時，天帝釋謂舍利子言：「如是般若波羅蜜多理趣甚深極難信解，諸有未久信樂修行甚深般若波羅蜜多，",
        "translation": "At the time, Śakra Devānām-Indra said to Śāriputra, Thus, the principle and aim of the perfection of wisdom are so profound and difficult to believe and understand that some people haven't long believed and enjoyed cultivating the profound perfection of wisdom.",
        "source": "T07n0220_559:0888a03_5"
    },
    {
        "source_sentence": "聞說此中甚深義趣不生信解，未為希有。",
        "translation": "The profound meaning of these teachings is so profound that they don't give rise to faith and understanding, which is not rare.",
        "source": "T07n0220_559:0888a06_6"
    },
    {
        "source_sentence": "若人禮敬甚深般若波羅蜜多，即為禮敬一切智智。」",
        "translation": "If someone venerates the profound prajñāpāramitā, that's to venerate omniscience and cognition.",
        "source": "T07n0220_559:0888a07_0"
    },
    {
        "source_sentence": "舍利子言：「如是！",
        "translation": "Śāriputra said, So it is!",
        "source": "T07n0220_559:0888a08_1"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0888a08_2"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_559:0888a08_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0888a08_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0888a09_5"
    },
    {
        "source_sentence": "如來所得一切智智，皆從般若波羅蜜多而得生故，甚深般若波羅蜜多復由如來一切智智而得有故。",
        "translation": "It's because the omniscience and knowledge attained by the Tathāgata all arise from the perfection of wisdom, and the profound perfection of wisdom also comes from the omniscience and knowledge of the Tathāgata.",
        "source": "T07n0220_559:0888a09_6"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0888a11_7"
    },
    {
        "source_sentence": "諸菩薩眾應如是行、應如是住、應如是學甚深般若波羅蜜多。」",
        "translation": "The bodhisattvas should thus practice, thus abide, and thus train in the profound prajñāpāramitā.",
        "source": "T07n0220_559:0888a11_8"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「諸菩薩眾云何行深般若波羅蜜多，名住深般若波羅蜜多，",
        "translation": "Śakra Devānām-Indra then said to the Buddha, How do the bodhisattvas practice the profound perfection of wisdom? It's called abiding in the profound perfection of wisdom.",
        "source": "T07n0220_559:0888a13_9"
    },
    {
        "source_sentence": "名學深般若波羅蜜多？」",
        "translation": "It's called the profound prajñāpāramitā of training?",
        "source": "T07n0220_559:0888a15_0"
    },
    {
        "source_sentence": "爾時，佛讚天帝釋言：「善哉！",
        "translation": "It was then that the Buddha praised Śakra Devānām-Indra, saying, Good!",
        "source": "T07n0220_559:0888a15_1"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_559:0888a16_2"
    },
    {
        "source_sentence": "汝承佛力，能問如來如是深義。",
        "translation": "By relying on the power of the Buddha, you can question the Tathāgata about such a profound meaning.",
        "source": "T07n0220_559:0888a16_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0888a16_4"
    },
    {
        "source_sentence": "諸菩薩眾行深般若波羅蜜多，若不住色，亦不住此是色，是為學色；",
        "translation": "If enlightening beings practice the profound prajñāpāramitā, if they do not abide in form and also do not abide in these forms, this is their training in form.",
        "source": "T07n0220_559:0888a17_5"
    },
    {
        "source_sentence": "若不住受、想、行、識，亦不住此是受、想、行、識，是為學受、想、行、識。",
        "translation": "If someone doesn't abide in feeling, perception, volition, and consciousness and doesn't abide here, this is feeling, perception, volition, and consciousness, which is training in feeling, perception, volition, and consciousness.",
        "source": "T07n0220_559:0888a18_6"
    },
    {
        "source_sentence": "復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_559:0888a20_0"
    },
    {
        "source_sentence": "諸菩薩眾行深般若波羅蜜多，若不學色，亦不學此是色，是不住色；",
        "translation": "If enlightening beings practice the profound prajñāpāramitā, if they don’t study form and don’t study this form, they won’t abide in form.",
        "source": "T07n0220_559:0888a20_1"
    },
    {
        "source_sentence": "若不學受、想、行、識，亦不學此是受、想、行、識，是不住受、想、行、識。",
        "translation": "If someone doesn't train in feeling, perception, volition, and consciousness, and doesn't train in these feelings, perception, volition, and consciousness, they don't abide in feeling, perception, volition, and consciousness.",
        "source": "T07n0220_559:0888a21_2"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_559:0888a23_3"
    },
    {
        "source_sentence": "是名菩薩行深般若波羅蜜多，亦名住深般若波羅蜜多，亦名學深般若波羅蜜多。」",
        "translation": "This is called the profound prajñāpāramitā of bodhisattva practice, which is also called the profound prajñāpāramitā of abiding and the profound prajñāpāramitā of training.",
        "source": "T07n0220_559:0888a23_4"
    },
    {
        "source_sentence": "時，舍利子便白佛言：「如是般若波羅蜜多最為甚深，難可測量，難可執取，",
        "translation": "Śāriputra then said to the Buddha: Such is the profundity of the perfection of wisdom. It is difficult to fathom and difficult to grasp.",
        "source": "T07n0220_559:0888a25_5"
    },
    {
        "source_sentence": "無有限量。」",
        "translation": "There's no limit to it.",
        "source": "T07n0220_559:0888a26_6"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「如是！",
        "translation": "It was then that the Buddha addressed Śāriputra, saying, So it is!",
        "source": "T07n0220_559:0888a27_7"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0888a27_8"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_559:0888a27_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0888a28_10"
    },
    {
        "source_sentence": "諸菩薩眾行深般若波羅蜜多，若不住色甚深性，亦不住此是色甚深性，",
        "translation": "The profound prajñāpāramitā of all the bodhisattva practices is that if they don't abide in the profound nature of form and don't abide in it, this is the profound nature of form.",
        "source": "T07n0220_559:0888a28_11"
    },
    {
        "source_sentence": "是為學色甚深性；",
        "translation": "This is the profound nature of the form of training.",
        "source": "T07n0220_559:0888a29_12"
    },
    {
        "source_sentence": "若不住受、想、行、識甚深性，亦不住此是受、想、行、識甚深性，是為學受、想、行、識甚深性。",
        "translation": "If someone doesn't abide in the profound nature of feeling, perception, volition, and consciousness, and doesn't abide here, this is the profound nature of feeling, perception, volition, and consciousness, which is called training in the profound nature of feeling, perception, volition, and consciousness.",
        "source": "T07n0220_559:0888b01_13"
    },
    {
        "source_sentence": "復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T07n0220_559:0888b03_14"
    },
    {
        "source_sentence": "諸菩薩眾行深般若波羅蜜多，若不學色甚深性，亦不學此是色甚深性，",
        "translation": "If bodhisattvas practice the profound prajñāpāramitā, if they don't study the profound nature of form and don't study it, this is the profound nature of form.",
        "source": "T07n0220_559:0888b03_15"
    },
    {
        "source_sentence": "是為不住色甚深性；",
        "translation": "This is their profound nature of not dwelling on form.",
        "source": "T07n0220_559:0888b05_16"
    },
    {
        "source_sentence": "若不學受、想、行、識甚深性，亦不學此是受、想、行、識甚深性，是為不住受、想、行、識甚深性。」",
        "translation": "If someone doesn't train in the profound nature of feeling, perception, volition, and consciousness, and doesn't train in the profound nature of feeling, perception, volition, and consciousness, this is because they don't abide in the profound nature of feeling, perception, volition, and consciousness.",
        "source": "T07n0220_559:0888b05_17"
    },
    {
        "source_sentence": "時，舍利子復白佛言：「如是般若波羅蜜多既最甚深，難可測量，難可執取，",
        "translation": "Śāriputra then again said to the Buddha: Such is the profundity of the perfection of wisdom, which is difficult to fathom and difficult to grasp.",
        "source": "T07n0220_559:0888b07_18"
    },
    {
        "source_sentence": "無有限量則難信解，但應為彼不退轉位諸菩薩說，彼於此中無疑無惑不迷謬故。」",
        "translation": "If there's no limit, then it's difficult to believe and understand; but it should be explained for those bodhisattvas at the stage of nonretrogression, because they have no doubt or confusion here and aren't confused.",
        "source": "T07n0220_559:0888b09_19"
    },
    {
        "source_sentence": "時，天帝釋問舍利子言：「若為未受記諸菩薩說，當有何咎？」",
        "translation": "Śakra Devānām-Indra then asked Śāriputra, If you speak for the bodhisattvas who have yet to receive assurance, what's the blame?",
        "source": "T07n0220_559:0888b11_0"
    },
    {
        "source_sentence": "舍利子言：「彼聞驚怖或生毀謗，由此因緣久受大苦，難得無上正等菩提。」",
        "translation": "Śāriputra said, They hear that they're frightened or become disillusioned, and because of these causes and conditions, they experience great suffering for a long time, which makes it difficult to attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0888b12_1"
    },
    {
        "source_sentence": "天帝釋言：「頗有菩薩未得受記聞深般若波羅蜜多，心不驚怖，不生毀謗，",
        "translation": "Śakra Devānām-Indra said, Could it be that there are bodhisattvas who haven't yet received assurance of hearing the profound prajñāpāramitā and aren't frightened or disparaged in mind?",
        "source": "T07n0220_559:0888b14_2"
    },
    {
        "source_sentence": "深信解耶？」",
        "translation": "Is deep faith and understanding?",
        "source": "T07n0220_559:0888b15_3"
    },
    {
        "source_sentence": "舍利子言：「有！",
        "translation": "Śāriputra said, Yes!",
        "source": "T07n0220_559:0888b15_4"
    },
    {
        "source_sentence": "是菩薩久發無上正等覺心，久修菩薩摩訶薩行，雖未得受大菩提記，不過一佛或二佛所，",
        "translation": "These enlightening beings have long aroused the determination for unexcelled perfect enlightenment. They have cultivated the practice of enlightening beings for a long time, and though they have not yet received the prediction of enlightenment, yet they are in the presence of one buddha or two buddhas.",
        "source": "T07n0220_559:0888b16_5"
    },
    {
        "source_sentence": "定當得受大菩提記。」",
        "translation": "They'll surely attain the assurance of great enlightenment.",
        "source": "T07n0220_559:0888b18_6"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「如是！",
        "translation": "It was then that the Buddha addressed Śāriputra, saying, So it is!",
        "source": "T07n0220_559:0888b18_7"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_559:0888b19_8"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_559:0888b19_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_559:0888b19_10"
    },
    {
        "source_sentence": "若諸菩薩未得受記，聞深般若波羅蜜多，心不驚怖，深生信解，當知久發大菩提心，",
        "translation": "If bodhisattvas who haven’t yet received assurance hear the profound prajñāpāramitā, aren’t frightened in mind and become deeply convinced, they should know that they’ve long aroused the great aspiration for enlightenment.",
        "source": "T07n0220_559:0888b19_11"
    },
    {
        "source_sentence": "多種善根，事多善友。」",
        "translation": "There are many good roots and many good friends who serve.",
        "source": "T07n0220_559:0888b21_12"
    },
    {
        "source_sentence": "時，舍利子便白佛言：「我今樂說少分譬喻，唯願聽許！」",
        "translation": "Śāriputra then said to the Buddha, Now, I'd like to explain a little bit of metaphor, so please listen!",
        "source": "T07n0220_559:0888b22_13"
    },
    {
        "source_sentence": "爾時，佛告舍利子言：「隨汝意說。」",
        "translation": "It was then that the Buddha addressed Śāriputra, saying, Explain it as you wish.",
        "source": "T07n0220_559:0888b23_14"
    },
    {
        "source_sentence": "時，舍利子白言：「世尊！",
        "translation": "Śāriputra then said, Bhagavān!",
        "source": "T07n0220_559:0888b24_15"
    },
    {
        "source_sentence": "如菩薩乘善男子等自夢見坐妙菩提座，當知是人近證無上正等菩提。",
        "translation": "Good sons of the bodhisattva vehicle, just as they themselves dreamt that they sat on the marvelous seat of enlightenment, you should know that these people are about to realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0888b24_16"
    },
    {
        "source_sentence": "若有得聞甚深般若波羅蜜多，心不驚怖，深生信解亦復如是。",
        "translation": "If someone hears the profound prajñāpāramitā, their mind isn't frightened, and they deeply become convinced, it's likewise.",
        "source": "T07n0220_559:0888b26_17"
    },
    {
        "source_sentence": "當知是人久發無上正等覺心善根成熟，或已得受大菩提記，或近當受大菩提記，",
        "translation": "You should know that these people have long aroused the mind of unexcelled perfect enlightenment, matured their good roots, and may already receive the prediction of great enlightenment, or are about to receive it.",
        "source": "T07n0220_559:0888b27_18"
    },
    {
        "source_sentence": "疾證無上正等菩提。」",
        "translation": "They'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0888b29_19"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0888c01_20"
    },
    {
        "source_sentence": "譬如有人遊行曠野，經過險道百踰繕那或二、或三乃至五百，見諸城邑王都前相，",
        "translation": "It's like a person traveling in the wilderness and passing through dangerous paths for a hundred yojanas, or two, or three, or even five hundred, who sees the front of cities and kingdoms.",
        "source": "T07n0220_559:0888c01_21"
    },
    {
        "source_sentence": "謂放牧人園林田等，見是相已便作是念：『城邑王都去此非遠。』",
        "translation": "It means that when a herdsman's garden, forest, field, and so forth see these characteristics, he thinks, 'The cities and kingdoms aren't far from here.'",
        "source": "T07n0220_559:0888c03_22"
    },
    {
        "source_sentence": "作是念已身意泰然，不畏惡獸惡賊饑渴。",
        "translation": "After he had this thought, his body and mind were at ease, not afraid of hunger and thirst from bad animals and thieves.",
        "source": "T07n0220_559:0888c04_23"
    },
    {
        "source_sentence": "如是菩薩得聞般若波羅蜜多深心信敬，當知不久受菩提記，疾證無上正等菩提，",
        "translation": "Thus, the bodhisattva hears the prajñāpāramitā with deep faith and reverence, knowing that he'll soon receive the assurance of enlightenment and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0888c05_24"
    },
    {
        "source_sentence": "無墮聲聞、獨覺地畏。",
        "translation": "There's no fear of falling into the stages of śrāvakas and pratyekbuddhas.",
        "source": "T07n0220_559:0888c07_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0888c07_26"
    },
    {
        "source_sentence": "已得見聞恭敬信受甚深般若波羅蜜多無上菩提之前相故。」",
        "translation": "It's because they've seen, heard, respected, and faithfully accepted the prior aspect of the profound prajñāpāramitā unsurpassed enlightenment.",
        "source": "T07n0220_559:0888c07_27"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0888c09_28"
    },
    {
        "source_sentence": "譬如有人欲觀大海，漸次往趣經歷多時不見山林便作是念：『今觀此相，",
        "translation": "“Good man, it is analogous to someone who wishes to survey the great ocean and gradually proceeds along its course. After going around for a long time he does not see the mountains or forests but thinks:",
        "source": "T07n0220_559:0888c09_29"
    },
    {
        "source_sentence": "大海非遠。",
        "translation": "The great ocean isn't far away.",
        "source": "T07n0220_559:0888c11_30"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0888c11_31"
    },
    {
        "source_sentence": "近大海岸，地必漸下無諸山林。』",
        "translation": "Near the great shore, the ground will gradually sink and there won't be any mountain forests.'",
        "source": "T07n0220_559:0888c11_32"
    },
    {
        "source_sentence": "彼人爾時雖未見海，而見近相歡喜踊躍。",
        "translation": "At the time, even though they hadn't seen the ocean, they saw their nearness and rejoiced and jumped.",
        "source": "T07n0220_559:0888c12_33"
    },
    {
        "source_sentence": "如是菩薩得聞般若波羅蜜多深心信敬，當知不久受菩提記，疾證無上正等菩提。",
        "translation": "Thus, when a bodhisattva hears the prajñāpāramitā with deep faith and respect, he should know that he'll soon receive the assurance of enlightenment and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0888c13_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_559:0888c15_35"
    },
    {
        "source_sentence": "已得見聞甚深般若波羅蜜多無上菩提之前相故。」",
        "translation": "It's because they've already seen and heard the profound prajñāpāramitā of the unsurpassed enlightenment.",
        "source": "T07n0220_559:0888c15_36"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0888c16_37"
    },
    {
        "source_sentence": "譬如春時花果樹等，故葉已墮枝條滋潤，眾人見之咸作是念：『新花果葉當出非久。",
        "translation": "It's like flowers, fruits, trees, and so forth in spring, whose old leaves have fallen into branches that are nourished, and when people see them, they all think, 'There won't be a long time before new flowers and fruit leaves will emerge.",
        "source": "T07n0220_559:0888c16_38"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_559:0888c18_39"
    },
    {
        "source_sentence": "此諸樹等新花果葉先相現故。』",
        "translation": "It's because these trees and other new flowers and fruit leaves first appear to each other.'",
        "source": "T07n0220_559:0888c18_40"
    },
    {
        "source_sentence": "如是菩薩得聞般若波羅蜜多深心信敬，當知不久受菩提記，疾證無上正等菩提。",
        "translation": "Thus, when a bodhisattva hears the prajñāpāramitā with deep faith and respect, he should know that he'll soon receive the assurance of enlightenment and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0888c19_41"
    },
    {
        "source_sentence": "時，眾會中有諸天子，見已歡喜作是念言：『先諸菩薩得此相已，不久便受大菩提記，",
        "translation": "At that time, some of the celestial beings in the assembly were delighted to see him. They thought thus:",
        "source": "T07n0220_559:0888c21_42"
    },
    {
        "source_sentence": "今此菩薩亦得是相，不久當受大菩提記。』",
        "translation": "Now that this bodhisattva has also attained this mark, he'll soon receive the assurance of great enlightenment.'",
        "source": "T07n0220_559:0888c23_43"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_559:0888c24_44"
    },
    {
        "source_sentence": "譬如女人懷妊漸久，其身轉重動止不安，飲食睡眠悉皆減少，不憙多語厭常所作，",
        "translation": "Good man, this is analogous to a woman who becomes pregnant over a long period of time. Her body gradually weakens and her movements become restless. All the food she eats and sleeps diminishes, and she does not say words that are disgusting.",
        "source": "T07n0220_559:0888c24_45"
    },
    {
        "source_sentence": "受苦痛故眾事頓息，有異母人見是相已，即知此女不久產生。",
        "translation": "Because of suffering and pain, all things suddenly cease, and when a strange mother sees this sign, she knows that the woman won't be born for a long time.",
        "source": "T07n0220_559:0888c26_46"
    },
    {
        "source_sentence": "如是菩薩得聞般若波羅蜜多深心信敬，當知不久受菩提記，疾證無上正等菩提，",
        "translation": "Thus, the bodhisattva hears the prajñāpāramitā with deep faith and reverence, knowing that he'll soon receive the assurance of enlightenment and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_559:0888c27_47"
    },
    {
        "source_sentence": "能盡未來利樂一切。」",
        "translation": "They'll be able to exhaust all future benefits and pleasures.",
        "source": "T07n0220_559:0888c29_48"
    },
    {
        "source_sentence": "爾時，佛讚舍利子言：「善哉！",
        "translation": "It was then that the Buddha praised Śāriputra, saying, Good!",
        "source": "T07n0220_559:0888c29_49"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_559:0889a01_50"
    },
    {
        "source_sentence": "汝今善說菩薩譬喻，皆是如來威神之力。」",
        "translation": "Now, you well explain the bodhisattva's metaphors, which are all the Tathāgata's authoritative power.",
        "source": "T07n0220_559:0889a01_51"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百五十九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 5",
        "source": "T07n0220_559:0889a03_0"
    }
]