[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 1",
        "source": "T07n0220_501:0549a02_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_501:0549a04_0"
    },
    {
        "source_sentence": "第三分現窣堵波品第五之二",
        "translation": "The Fifth and Second Part of the Chapter on the Third Part of the Exposition of the Buddha's Commentary",
        "source": "T07n0220_501:0549a05_0"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0549a06_0"
    },
    {
        "source_sentence": "若善男子、善女人等，能於如是甚深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "If good men and good women can wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate such profound prajñāpāramitā,",
        "source": "T07n0220_501:0549a06_1"
    },
    {
        "source_sentence": "是善男子、善女人等所獲現法當來勝利，汝應諦聽，極善思惟，吾當為汝分別解說。」",
        "translation": "Good sons and good women, these are the future benefits of the present life that you'll attain, so listen closely and contemplate them well; I will explain them for you in a discriminating way.",
        "source": "T07n0220_501:0549a08_2"
    },
    {
        "source_sentence": "天帝釋言：「唯然！",
        "translation": "Indra said, Yes!",
        "source": "T07n0220_501:0549a10_3"
    },
    {
        "source_sentence": "願說！",
        "translation": "May it be explained!",
        "source": "T07n0220_501:0549a11_4"
    },
    {
        "source_sentence": "我等樂聞。」",
        "translation": "We're happy to hear it.",
        "source": "T07n0220_501:0549a11_5"
    },
    {
        "source_sentence": "佛言：「憍尸迦！",
        "translation": "The Buddha said, Kauśika!",
        "source": "T07n0220_501:0549a11_6"
    },
    {
        "source_sentence": "若有諸惡外道梵志，若諸惡魔及魔眷屬，若餘暴惡增上慢者，於是菩薩摩訶薩所，",
        "translation": "If there are evil heretics, brahmins, bad Māras, their followers, or other violent and arrogant arrogant arrogant people, then the great bodhisattva Mahāsattva will come to them.",
        "source": "T07n0220_501:0549a11_7"
    },
    {
        "source_sentence": "欲作種種不饒益事，彼適興心速自遭禍，必當殄滅不果所願。",
        "translation": "Those who want to do various kinds of unbeneficial things will quickly be harmed by their own mind, and they'll surely be disciplined and extinguished without realizing their wishes.",
        "source": "T07n0220_501:0549a13_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0549a15_9"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549a15_10"
    },
    {
        "source_sentence": "是菩薩摩訶薩以應一切智智心，用無所得為方便，常修布施波羅蜜多乃至般若波羅蜜多，",
        "translation": "“These great enlightening beings, with the mind of omniscience and knowledge appropriate to all sentient beings, always cultivate the transcendent practice of generosity by means of ungraspable skillful means, up to the transcendent practice of wisdom.",
        "source": "T07n0220_501:0549a15_11"
    },
    {
        "source_sentence": "以大悲願而為上首。",
        "translation": "With the vow of great compassion, he's the supreme leader.",
        "source": "T07n0220_501:0549a17_12"
    },
    {
        "source_sentence": "若諸有情長夜慳貪興諸鬪諍，是菩薩摩訶薩於內外法一切皆捨，方便令彼安住布施波羅蜜多。",
        "translation": "If sentient beings are long-standingly stingy and greedy and give rise to quarrels, this is the bodhisattva Mahāsattva who abandons all internal and external things and skillfully causes them to abide in the perfection of generos",
        "source": "T07n0220_501:0549a18_0"
    },
    {
        "source_sentence": "若諸有情長夜破戒作諸惡業，是菩薩摩訶薩於內外法一切皆捨，方便令彼安住淨戒波羅蜜多。",
        "translation": "If sentient beings break the precepts and do bad actions for a long time, this is the bodhisattva Mahāsattva who abandons all internal and external dharmas and skillfully causes them to abide in the perfection of pure morality.",
        "source": "T07n0220_501:0549a20_1"
    },
    {
        "source_sentence": "若諸有情長夜忿恚更相損害，是菩薩摩訶薩於內外法一切皆捨，方便令彼安住安忍波羅蜜多。",
        "translation": "If sentient beings are angry and harmful to each other for a long time, this is the bodhisattva Mahāsattva who abandons all internal and external dharmas and skillfully causes them to abide in the perfection of patience.",
        "source": "T07n0220_501:0549a22_2"
    },
    {
        "source_sentence": "若諸有情長夜懈怠捨諸善業，是菩薩摩訶薩於內外法一切皆捨，方便令彼安住精進波羅蜜多。",
        "translation": "If sentient beings lazyly abandon good actions for a long time, this is the bodhisattva Mahāsattva who abandons all internal and external dharmas and skillfully causes them to abide in the perfection of effort.",
        "source": "T07n0220_501:0549a24_3"
    },
    {
        "source_sentence": "若諸有情長夜散亂心務囂動，是菩薩摩訶薩於內外法一切皆捨，方便令彼安住靜慮波羅蜜多。",
        "translation": "If sentient beings remain distracted and agitated for a long time, this is the bodhisattva Mahāsattva who abandons all internal and external dharmas and skillfully causes them to abide peacefully in the perfection of meditation.",
        "source": "T07n0220_501:0549a26_4"
    },
    {
        "source_sentence": "若諸有情長夜愚癡不知善惡，是菩薩摩訶薩於內外法一切皆捨，方便令彼安住般若波羅蜜多。",
        "translation": "If sentient beings remain ignorant of good and evil for a long time, this is the bodhisattva Mahāsattva who abandons all internal and external dharmas and skillfully causes them to abide in the perfection of wisdom.",
        "source": "T07n0220_501:0549a29_5"
    },
    {
        "source_sentence": "若諸有情流轉生死，貪、瞋、癡等纏繞其心，造作眾多不饒益事，是菩薩摩訶薩善權方便，",
        "translation": "If all sentient beings transmigrate in birth and death, their minds are tethered by craving, anger, and delusion, and they create many unbeneficial things, this is the skillful means of the bodhisattva Mahā",
        "source": "T07n0220_501:0549b02_6"
    },
    {
        "source_sentence": "令彼伏滅貪、瞋、癡等生死因緣，或令安住四靜慮、四無量、四無色定，",
        "translation": "He causes them to subdue the causes and conditions of birth-and-death, such as craving, anger, and delusion, or he causes them to abide in the four meditations, four immeasurable concentrations, and four formless",
        "source": "T07n0220_501:0549b04_7"
    },
    {
        "source_sentence": "或令安住四念住乃至八聖道支，或令安住空、無相、無願解脫門，或令安住八解脫、九次第定，",
        "translation": "He may cause them to abide in the four abodes of mindfulness up to the eightfold noble path, or he may cause them to abide in the liberation gate of emptiness, signlessness, and wishlessness, or he may cause them to a",
        "source": "T07n0220_501:0549b05_8"
    },
    {
        "source_sentence": "或令安住諸菩薩地，或令安住內空乃至無性自性空，或令安住真如乃至不思議界，",
        "translation": "They may cause them to abide in the stages of enlightening beings, or they may cause them to abide in internal emptiness up to the emptiness of the essential nature of nonexistence, or they may cause them to abide in the realm",
        "source": "T07n0220_501:0549b08_9"
    },
    {
        "source_sentence": "或令安住斷界乃至無為界，或令安住苦、集、滅、道聖諦，或令安住淨觀地乃至如來地，",
        "translation": "He may cause them to abide in the realm of cessation and so on, up to the realm of nothingness; he may cause them to abide in the noble truths of suffering, arising, cessation, and the path; or he",
        "source": "T07n0220_501:0549b10_0"
    },
    {
        "source_sentence": "或令安住五眼、六神通，或令安住如來十力乃至十八佛不共法，或令安住無忘失法、恒住捨性，",
        "translation": "They may cause them to abide in the five eyes and six supernatural powers, or they may cause them to abide in the ten powers of buddhas up to the unique qualities of the eighteen Buddhas, or they may cause them to abide in the",
        "source": "T07n0220_501:0549b11_1"
    },
    {
        "source_sentence": "或令安住一切陀羅尼門、三摩地門，或令安住一切智、道相智、一切相智，",
        "translation": "He may cause them to abide in all the teachings of dhāraṇī and concentration, or he may cause them to abide in omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_501:0549b14_2"
    },
    {
        "source_sentence": "或令安住預流果乃至獨覺菩提，或令安住一切菩薩摩訶薩行，或令安住諸佛無上正等菩提，",
        "translation": "They may cause them to abide in the enlightenment of pre-flow, up to the enlightenment of the solitary realizers, or they may cause them to abide in all the practices of enlightening beings, or they may cause",
        "source": "T07n0220_501:0549b15_3"
    },
    {
        "source_sentence": "或令安住諸餘世間、出世善法。",
        "translation": "Or they may cause them to abide in other worldly and supramundane good dharmas.",
        "source": "T07n0220_501:0549b17_4"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549b18_5"
    },
    {
        "source_sentence": "如是名為於深般若波羅蜜多至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "Thus, these are called the profound prajñāpāramitā that they wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate.",
        "source": "T07n0220_501:0549b18_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩現法勝利。",
        "translation": "The bodhisattvas, mahāsattvas, and buddhas present the benefits of their teachings.",
        "source": "T07n0220_501:0549b20_7"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549b21_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩由此因緣，於當來世速證無上正等菩提，轉妙法輪度無量眾，",
        "translation": "Because of these causes and conditions, the great enlightening beings will quickly attain unexcelled perfect enlightenment in future ages, turning the wheel of the fine dharma to liberate immeasurable multitudes.",
        "source": "T07n0220_501:0549b21_9"
    },
    {
        "source_sentence": "隨本所願安立有情，令於三乘修學究竟，乃至證得無餘涅槃。",
        "translation": "Depending on their original vows, they establish sentient beings so that they cultivate and train in the three vehicles until they realize nirvāṇa without remainder.",
        "source": "T07n0220_501:0549b23_10"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549b24_11"
    },
    {
        "source_sentence": "如是名為於深般若波羅蜜多至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "Thus, these are called the profound prajñāpāramitā that they wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate.",
        "source": "T07n0220_501:0549b25_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩當來勝利。",
        "translation": "The bodhisattvas, mahāsattvas, and future benefits.",
        "source": "T07n0220_501:0549b27_1"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0549b27_2"
    },
    {
        "source_sentence": "若善男子、善女人等於此般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "If good men and good women wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate this prajñāpāramitā,",
        "source": "T07n0220_501:0549b27_3"
    },
    {
        "source_sentence": "其地方所，若有惡魔及魔眷屬，或有種種外道梵志及餘暴惡增上慢者，",
        "translation": "At that place, if there are evil demons and their retinues, or various non-Buddhist priests and other violent and arrogant arrogant people,",
        "source": "T07n0220_501:0549c01_4"
    },
    {
        "source_sentence": "憎嫉般若波羅蜜多，欲為障礙、詰責、違拒、令速隱沒，雖有此願終不能成。",
        "translation": "They hate the perfection of wisdom and want to obstruct, interrogate, reject, and quickly withdraw it, but even though they have this vow, they can't make it.",
        "source": "T07n0220_501:0549c02_5"
    },
    {
        "source_sentence": "彼因暫聞般若聲故，眾惡漸滅功德漸生，後依三乘得盡苦際，或脫惡趣生天、人中。",
        "translation": "As a result of hearing the sound of prajñā for a while, they gradually cease all evils and their virtue gradually arises, and later rely on the three vehicles to attain the end of suffering or be born in heaven or among humans who",
        "source": "T07n0220_501:0549c04_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549c06_7"
    },
    {
        "source_sentence": "如有妙藥名曰莫耆，是藥威勢能銷眾毒，如是妙藥隨所在處，諸毒蟲類不能逼近。",
        "translation": "There's a wonderful medicine named moqi, which is powerful enough to remove all poisons, and such a wonderful medicine follows wherever it is, so no poisonous insects can get close to it.",
        "source": "T07n0220_501:0549c06_8"
    },
    {
        "source_sentence": "有大毒蛇飢行求食，遇見生類欲螫噉之，其生怖死奔趣妙藥，蛇聞藥氣尋便退走。",
        "translation": "A large poisonous snake hungered and begged for food, and when it met a living creature with the desire to sting it, it became frightened and ran away in fear. The snake heard the smell of the medicine and withdrew.",
        "source": "T07n0220_501:0549c08_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0549c10_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549c10_11"
    },
    {
        "source_sentence": "如是妙藥具大威勢，能益身命銷伏眾毒。",
        "translation": "Such a wonderful medicine is endowed with great power, which can benefit body and life and subdue all poisons.",
        "source": "T07n0220_501:0549c10_12"
    },
    {
        "source_sentence": "當知般若波羅蜜多具大威勢亦復如是，若善男子、善女人等至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "If good men and good women wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate it,",
        "source": "T07n0220_501:0549c11_13"
    },
    {
        "source_sentence": "諸惡魔等於此菩薩摩訶薩所欲為惡事，由此般若波羅蜜多威神力故，令彼惡事於其方所自當殄滅無所能為。",
        "translation": "Because of the authoritative power of the prajñāpāramitā, bad demons and so forth want these bad things that the bodhisattva Mahāsattva wants to do, they cause those bad things to cease in their own place without doing anything",
        "source": "T07n0220_501:0549c14_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0549c17_15"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549c17_16"
    },
    {
        "source_sentence": "由此般若波羅蜜多具大威力，能摧眾惡增善法故。",
        "translation": "Because this prajñāpāramitā possesses great power, it can destroy bad and increase good dharmas.",
        "source": "T07n0220_501:0549c17_17"
    },
    {
        "source_sentence": "「云何般若波羅蜜多能摧眾惡增長諸善？",
        "translation": "How can the perfection of wisdom destroy all evil and increase goodness?",
        "source": "T07n0220_501:0549c18_18"
    },
    {
        "source_sentence": "謂此般若波羅蜜多滅貪、瞋、癡，無明乃至純大苦蘊，障蓋、隨眠、纏垢、結縛，",
        "translation": "It means that this prajñāpāramitā ceases craving, anger, and delusion, ignorance up to the pure great painful aggregate of suffering, hindrances, latencies, afflictions, defilements, and fetters",
        "source": "T07n0220_501:0549c19_19"
    },
    {
        "source_sentence": "我見、有情見乃至見者見，斷見、常見、無見、有見乃至種種諸惡見趣，",
        "translation": "view of self, view of sentient beings... view of those who see; view of annihilation, view of permanence, view of non-existence, view of existence... various bad views and destinies.",
        "source": "T07n0220_501:0549c21_20"
    },
    {
        "source_sentence": "慳貪、破戒、忿恚、懈怠、散亂、愚癡，常想、樂想、我想、淨想及餘一切貪、瞋、癡、慢、疑、見行等無不能滅，",
        "translation": "The perception of permanence, the perception of bliss, the perception of self, the perception of purity, and all other perceptions of craving, anger, delusion, pride, doubt, views, practices, etc., cannot",
        "source": "T07n0220_501:0549c22_21"
    },
    {
        "source_sentence": "亦滅色執乃至識執，乃至亦滅一切相智執、菩提涅槃執。",
        "translation": "It also extinguishes the attachment to form and even the attachment to consciousness, and it also extinguishes the attachment to knowledge of all characteristics and the attachment to enlightenment and nirvāṇa.",
        "source": "T07n0220_501:0549c24_22"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0549c26_23"
    },
    {
        "source_sentence": "如是般若波羅蜜多，能滅此等一切惡法，及能增長一切善事。",
        "translation": "Thus, the perfection of wisdom can extinguish all these bad qualities and increase all good deeds.",
        "source": "T07n0220_501:0549c26_24"
    },
    {
        "source_sentence": "是故般若波羅蜜多，有無數量大威神力。",
        "translation": "Therefore, the prajñāpāramitā has an incalculable amount of great authoritative power.",
        "source": "T07n0220_501:0549c27_25"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0549c28_26"
    },
    {
        "source_sentence": "若善男子、善女人等於此般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "If good men and good women wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate this prajñāpāramitā,",
        "source": "T07n0220_501:0549c29_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩常為三千大千世界，四大天王及天帝釋、堪忍界主、大梵天王、淨居天等并餘善神常來擁護，",
        "translation": "These great enlightening beings are always present in the billion-world-galactic universe, supported by the four great celestial kings and god Indra, the lord of the realm of tolerance, the great Brahmā, the Pure Land god",
        "source": "T07n0220_501:0550a02_1"
    },
    {
        "source_sentence": "不令一切災橫侵惱，如法所求無不滿足。",
        "translation": "They won't allow all calamities to overpower them, and whatever they seek according to the teaching will not be fulfilled.",
        "source": "T07n0220_501:0550a04_2"
    },
    {
        "source_sentence": "十方世界現在如來、應、正等覺亦常護念，令惡漸滅善法漸增，謂令增長布施波羅蜜多乃至般若波羅蜜多，",
        "translation": "In the worlds of the ten directions, the present Tathāgatas, Arhats, and Completely Awakened Ones are also always guarding their mindfulness, causing evil to gradually cease and good qualities to gradually increase, that is",
        "source": "T07n0220_501:0550a05_3"
    },
    {
        "source_sentence": "如是乃至亦令增長一切智、道相智、一切相智，以無所得為方便故，所修所住常無退減。",
        "translation": "Thus, it also causes the cultivation of omniscience, knowledge of the path's characteristics, and knowledge of all characteristics to grow, and because nothing is obtained as a method, what's cultivated and what's abiding is always without",
        "source": "T07n0220_501:0550a08_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0550a10_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩由此因緣，言詞威肅聞皆敬愛，發言稱量語不諠雜，堅事善友深知恩報，",
        "translation": "Because of these causes and conditions, the bodhisattva Mahāsattva’s words are dignified and respected by all who hear them. He speaks with a gentle voice that is neither flattering nor confusing, serving his spiritual benefactors",
        "source": "T07n0220_501:0550a10_6"
    },
    {
        "source_sentence": "不為慳嫉、忿恨、覆惱、諂誑、憍等隱蔽其心。",
        "translation": "They don't hide their minds from stinginess, jealousy, anger, resentment, hypocrisy, flattery, and deceit.",
        "source": "T07n0220_501:0550a12_7"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0550a13_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩自能離斷生命，亦勸他離斷生命，無倒稱揚離斷生命法，",
        "translation": "“These great enlightening beings themselves are able to divorce life, and they also exhort others to divorce life. They correctly praise the principle of separation from life:",
        "source": "T07n0220_501:0550a13_9"
    },
    {
        "source_sentence": "歡喜讚歎離斷生命者。",
        "translation": "They rejoice and praise those who are free of cutting off life.",
        "source": "T07n0220_501:0550a15_10"
    },
    {
        "source_sentence": "如是乃至自能離邪見，亦勸他離邪見，無倒稱揚離邪見法，歡喜讚歎離邪見者。",
        "translation": "Thus, they themselves are able to part with wrong views, encourage others to part with wrong views, correctly praise the teaching of parting with wrong views, and rejoice and praise those who part with wrong views.",
        "source": "T07n0220_501:0550a15_11"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0550a17_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩自能行布施乃至般若波羅蜜多，亦勸他行布施乃至般若波羅蜜多，",
        "translation": "These bodhisattvas and mahāsattvas can themselves practice generosity up to the perfection of wisdom, and they also encourage others to practice generosity up to the perfection of wisdom.",
        "source": "T07n0220_501:0550a17_13"
    },
    {
        "source_sentence": "無倒稱揚行布施乃至般若波羅蜜多法，歡喜讚歎行布施乃至般若波羅蜜多者。",
        "translation": "He who correctly praises the practice of generosity up to the perfection of wisdom and rejoices in and praises the practice of generosity up to the perfection of wisdom.",
        "source": "T07n0220_501:0550a19_14"
    },
    {
        "source_sentence": "如是乃至自能修一切智、道相智、一切相智，亦勸他修一切智、道相智、一切相智，",
        "translation": "In the same way, up to they themselves can develop omniscience, knowledge of the path and knowledge of all characteristics, also encouraging others to develop omniscience, knowledge of the path and knowledge of all characteristics.",
        "source": "T07n0220_501:0550a21_15"
    },
    {
        "source_sentence": "無倒稱揚修一切智、道相智、一切相智法，歡喜讚歎修一切智、道相智、一切相智者。",
        "translation": "He who correctly praises the cultivation of omniscience, knowledge of the path's characteristics, and knowledge of all characteristics, rejoices and praises those who cultivate omniscience, knowledge of the path's characteristics, and knowledge",
        "source": "T07n0220_501:0550a23_16"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0550a25_17"
    },
    {
        "source_sentence": "是菩薩摩訶薩修行布施乃至般若波羅蜜多，以無所得而為方便，與諸有情平等共有迴向無上正等菩提。",
        "translation": "This is the bodhisattva Mahāsattva who cultivates generosity and even the perfection of wisdom, makes it a skillful means to equally and simultaneously dedicate himself to unsurpassed perfect enlightenment with sentient beings by cultivating generos",
        "source": "T07n0220_501:0550a25_18"
    },
    {
        "source_sentence": "是菩薩摩訶薩常作是念：『我若不能修行布施波羅蜜多，當生貧窮下賤種類；",
        "translation": "“These great enlightening beings always think, ‘If I do not cultivate the transcendent practice of generosity, I will surely be born into a poor and inferior class.",
        "source": "T07n0220_501:0550a27_19"
    },
    {
        "source_sentence": "我若不能修行淨戒波羅蜜多，閉人、天門墮諸惡趣；",
        "translation": "If I do not practice the perfection of pure morality, I will shut my doors to humans and heavenly beings and fall into evil destinies.",
        "source": "T07n0220_501:0550a29_20"
    },
    {
        "source_sentence": "我若不能修行安忍波羅蜜多，當缺諸根形貌醜陋，不具菩薩圓滿色身；",
        "translation": "If I were unable to practice the perfection of patience, I would lack all my faculties, physical forms, and ugly features, not endowed with the bodhisattva’s moonlike body.",
        "source": "T07n0220_501:0550b01_21"
    },
    {
        "source_sentence": "我若不能修行精進波羅蜜多，便不能修菩薩勝道，常懷懈怠眾事不成；",
        "translation": "If I were unable to practice the transcendent ways of effort, I would not be able to cultivate the supreme path of enlightening beings.",
        "source": "T07n0220_501:0550b03_22"
    },
    {
        "source_sentence": "我若不能修行靜慮波羅蜜多，便不能修菩薩勝定，心恒散亂所欲不成；",
        "translation": "If I were unable to practice the transcendent ways of meditation, I would not be able to cultivate the supreme concentration of enlightening beings. My mind is always distracted, and my desires are not fulfilled.",
        "source": "T07n0220_501:0550b05_23"
    },
    {
        "source_sentence": "我若不能修行般若波羅蜜多，便不能得方便善巧超諸聲聞、獨覺等地。",
        "translation": "If I can't cultivate the perfection of prajñāpāramitā, then I won't be able to skillfully surpass śrāvakas and pratyekbuddhas in terms of skillful means.",
        "source": "T07n0220_501:0550b06_24"
    },
    {
        "source_sentence": "若有如是貧窮等事，尚無勢力成熟有情，亦復不能嚴淨佛土，況當能得一切智智！』",
        "translation": "If there are such things like poverty and so forth, they still lack the power to ripen sentient beings, and they can't adorn and purify the Buddha land, so how could they attain omniscience?'",
        "source": "T07n0220_501:0550b08_25"
    },
    {
        "source_sentence": "是菩薩摩訶薩常作是念：『我不應隨慳貪勢力，若隨彼力則我布施波羅蜜多不得圓滿；",
        "translation": "“These great enlightening beings always think, ‘Shouldn’t I follow the power of stinginess and greed?",
        "source": "T07n0220_501:0550b10_26"
    },
    {
        "source_sentence": "我不應隨破戒勢力，若隨彼力則我淨戒波羅蜜多不得圓滿；",
        "translation": "I should not follow the power of someone who breaks the precepts. If I follow their power, my perfection in morality will not be perfected.",
        "source": "T07n0220_501:0550b12_27"
    },
    {
        "source_sentence": "我不應隨忿恚勢力，若隨彼力則我安忍波羅蜜多不得圓滿；",
        "translation": "I should not follow the power of the wrathful ones. If I follow their power, my perfection of patience will not be perfected.",
        "source": "T07n0220_501:0550b13_28"
    },
    {
        "source_sentence": "我不應隨懈怠勢力，若隨彼力則我精進波羅蜜多不得圓滿；",
        "translation": "I should not follow the power of laziness. And if I follow their power, my effort would be insufficient to fulfill the perfection of enlightenment.",
        "source": "T07n0220_501:0550b15_29"
    },
    {
        "source_sentence": "我不應隨散亂勢力，若隨彼力則我靜慮波羅蜜多不得圓滿；",
        "translation": "I should not follow the power of distraction. If I follow their power, my transcendent meditations won’t be perfected.",
        "source": "T07n0220_501:0550b16_30"
    },
    {
        "source_sentence": "我不應隨愚癡勢力，若隨彼力則我般若波羅蜜多不得圓滿。",
        "translation": "I shouldn't follow the power of the power of folly, and if I follow their power, then the perfection of self-prajñāpāramitā won't be perfected.",
        "source": "T07n0220_501:0550b17_31"
    },
    {
        "source_sentence": "若我六種波羅蜜多不得圓滿，終不能得一切智智利益安樂一切有情。』",
        "translation": "If I don't attain the perfection of the six perfections, I'll never attain omniscience and knowledge for the benefit and welfare of all sentient beings.'",
        "source": "T07n0220_501:0550b19_32"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0550b21_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩不離一切智智心，以無所得為方便，於此般若波羅蜜多，",
        "translation": "“These great enlightening beings, not detached from the mind of omniscience and knowledge, use ungraspable skill in liberation as their means to attain these transcendent ways.",
        "source": "T07n0220_501:0550b21_1"
    },
    {
        "source_sentence": "至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "They wholeheartedly hear, retain, recite, diligently practice, correctly contemplate, write, explain, and disseminate it.",
        "source": "T07n0220_501:0550b22_2"
    },
    {
        "source_sentence": "得如是等現法當來世、出世間功德勝利。」",
        "translation": "They'll attain such merits in the present life, future lives, and supramundane benefits.",
        "source": "T07n0220_501:0550b24_3"
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T07n0220_501:0550b26_0"
    },
    {
        "source_sentence": "如是般若波羅蜜多甚奇希有，能調菩薩摩訶薩眾令離高心，復能迴向一切智智。」",
        "translation": "Such a prajñāpāramitā is rare and marvelous, able to tame the bodhisattvas, mahāsattvas, and sentient beings so that they'll part with their lofty minds and return to omniscience.",
        "source": "T07n0220_501:0550b26_1"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「憍尸迦！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, Kauśika!",
        "source": "T07n0220_501:0550b28_2"
    },
    {
        "source_sentence": "云何般若波羅蜜多甚奇希有，能調菩薩摩訶薩眾令離高心，復能迴向一切智智？」",
        "translation": "How is the prajñāpāramitā so rare and marvelous that it can tame the bodhisattvas, mahāsattvas, and sentient beings to part with their lofty minds and return to omniscience?",
        "source": "T07n0220_501:0550b29_3"
    },
    {
        "source_sentence": "時，天帝釋白言：「世尊！",
        "translation": "Śakra Devānām-Indra then said, Bhagavān!",
        "source": "T07n0220_501:0550c02_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩行世間布施波羅蜜多時，若於如來應正等覺及諸菩薩、獨覺、聲聞、孤窮、老病、道行、乞者而行布施，",
        "translation": "When bodhisattvas, mahāsattvas, and buddhas practice the perfection of worldly giving, if they practice giving to the Tathāgatas, Arhats, and other bodhisattvas, pratyekbuddhas, śrāvakas, orphan",
        "source": "T07n0220_501:0550c02_1"
    },
    {
        "source_sentence": "便作是念：『我能施佛乃至乞者。』",
        "translation": "He then thought, 'I can give to the Buddha or even to a beggar.'",
        "source": "T07n0220_501:0550c05_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩無方便善巧故，雖行布施波羅蜜多，而起高心不能迴向一切智智。",
        "translation": "Because this bodhisattva Mahāsattva has no skillful means, even though he practices the perfection of generosity, he gives rise to a lofty mind that can't return to omniscience.",
        "source": "T07n0220_501:0550c05_3"
    },
    {
        "source_sentence": "諸菩薩摩訶薩行世間淨戒、安忍、精進、靜慮、般若波羅蜜多時，便作是念：『我能修行淨戒乃至般若波羅蜜多。』",
        "translation": "When bodhisattvas and mahāsattvas practice worldly pure morality, patience, effort, meditation, and the perfection of wisdom, they then think, 'I can cultivate pure morality up to the perfection of wisdom.'",
        "source": "T07n0220_501:0550c07_4"
    },
    {
        "source_sentence": "亦作是念：『我能圓滿淨戒乃至般若波羅蜜多。』",
        "translation": "They also think, 'I can perfect the pure precepts up to the perfection of prajñāpāramitā.'",
        "source": "T07n0220_501:0550c10_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩無方便善巧故，雖行淨戒乃至般若波羅蜜多，而起高心不能迴向一切智智。",
        "translation": "Because this bodhisattva Mahāsattva has no skillful means, even though he practices the pure precepts or even the perfection of wisdom, he gives rise to a lofty mind that can't return to omniscience and cognition.",
        "source": "T07n0220_501:0550c11_6"
    },
    {
        "source_sentence": "如是乃至諸菩薩摩訶薩修行一切智、道相智、一切相智時，若作是念：『我能修行一切智、道相智、一切相智。』",
        "translation": "Thus, even when bodhisattvas and mahāsattvas cultivate omniscience, knowledge of the path, and knowledge of all characteristics, if they think, 'I can cultivate omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_501:0550c13_7"
    },
    {
        "source_sentence": "亦作是念：『我能圓滿一切智、道相智、一切相智。』",
        "translation": "They also think, 'I can perfect omniscience, knowledge of the path, and knowledge of all characteristics.'",
        "source": "T07n0220_501:0550c15_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩無方便善巧故，雖修行一切智、道相智、一切相智，而起高心不能迴向一切智智。",
        "translation": "Because this bodhisattva Mahāsattva has no skillful means, even though he cultivates omniscience, knowledge of the path, and knowledge of all characteristics, he gives rise to a lofty mind that can't return to omniscience.",
        "source": "T07n0220_501:0550c16_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩成熟有情、嚴淨佛土時，若作是念：『我能成熟有情、嚴淨佛土，",
        "translation": "“When great enlightening beings mature sentient beings and purify the buddha-lands, if they think, ‘I can mature sentient beings and purify the buddha-lands,",
        "source": "T07n0220_501:0550c18_10"
    },
    {
        "source_sentence": "餘無此能。』",
        "translation": "The rest lack this ability.'",
        "source": "T07n0220_501:0550c20_11"
    },
    {
        "source_sentence": "是菩薩摩訶薩無方便善巧故，雖成熟有情、嚴淨佛土，而起高心不能迴向一切智智。",
        "translation": "Because this bodhisattva Mahāsattva has no skillful means, even though he ripens sentient beings and adorns the Buddha's land, he gives rise to a lofty mind that can't turn back to omniscience.",
        "source": "T07n0220_501:0550c20_12"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_501:0550c22_13"
    },
    {
        "source_sentence": "如是菩薩摩訶薩眾，依世間心修諸善法，無方便善巧故，我、我所執擾亂心故，",
        "translation": "Thus, the great enlightening beings cultivate good qualities based on worldly minds because they lack skill in means and because their minds are disturbed by attachment to self and possession of self.",
        "source": "T07n0220_501:0550c22_14"
    },
    {
        "source_sentence": "雖修般若波羅蜜多而未得故，不能調伏高心，亦不能迴向一切智智。",
        "translation": "Even though they cultivate the perfection of wisdom, they can't subdue their high minds because they haven't yet attained it, and they can't return to omniscience.",
        "source": "T07n0220_501:0550c24_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_501:0550c26_16"
    },
    {
        "source_sentence": "若菩薩摩訶薩行出世布施波羅蜜多時，善修般若波羅蜜多故不得施者，",
        "translation": "If a bodhisattva-mahāsattva doesn't attain generosity because he well cultivates the perfection of prajñāpāramitā when he practices the perfection of supramundane generosity,",
        "source": "T07n0220_501:0550c26_17"
    },
    {
        "source_sentence": "不得受者，不得布施，是菩薩摩訶薩依止般若波羅蜜多而行布施故，能調伏高心，",
        "translation": "Those who can't receive and those who can't give because the bodhisattva Mahāsattva practices generosity relying on the prajñāpāramitā to tame their high minds.",
        "source": "T07n0220_501:0550c28_18"
    },
    {
        "source_sentence": "亦能迴向一切智智。",
        "translation": "He's also able to dedicate himself back to omniscience and cognition.",
        "source": "T07n0220_501:0551a01_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩行出世淨戒乃至般若波羅蜜多時，善修般若波羅蜜多故，",
        "translation": "If a bodhisattva-mahāsattva practices the supramundane pure precepts up to the perfection of wisdom, it's because he well cultivates the perfection of wisdom.",
        "source": "T07n0220_501:0551a01_1"
    },
    {
        "source_sentence": "不得淨戒乃至般若及一切法，是菩薩摩訶薩依止般若波羅蜜多，而行淨戒乃至般若故能調伏高心，",
        "translation": "Not attaining the pure precepts up to prajñā and all dharmas, this is the bodhisattva Mahāsattva who relies on the prajñāpāramitā and practices the pure precepts up to prajñ",
        "source": "T07n0220_501:0551a03_2"
    },
    {
        "source_sentence": "亦能迴向一切智智。",
        "translation": "He's also able to dedicate himself back to omniscience and cognition.",
        "source": "T07n0220_501:0551a05_3"
    },
    {
        "source_sentence": "如是乃至若菩薩摩訶薩修行一切智、道相智、一切相智時，善修般若波羅蜜多故，",
        "translation": "Thus, when bodhisattvas and mahāsattvas cultivate omniscience, knowledge of the path, and knowledge of all characteristics, they skillfully cultivate the perfection of prajñāpāramitā.",
        "source": "T07n0220_501:0551a06_0"
    },
    {
        "source_sentence": "不得一切智、道相智、一切相智及一切法，是菩薩摩訶薩依止般若波羅蜜多，",
        "translation": "To attain omniscience, knowledge of the path, knowledge of all characteristics, knowledge of all characteristics, and all dharmas is the bodhisattva-mahāsattva relying on the prajñāpāramitā.",
        "source": "T07n0220_501:0551a07_1"
    },
    {
        "source_sentence": "而修一切智、道相智、一切相智故能調伏高心，亦能迴向一切智智。",
        "translation": "They cultivate omniscience, knowledge of the path's characteristics, and knowledge of all characteristics so they can tame their high minds and return to omniscience.",
        "source": "T07n0220_501:0551a09_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩成熟有情、嚴淨佛土時，善修般若波羅蜜多故，不得成熟有情、嚴淨佛土及一切法，",
        "translation": "If a bodhisattva Mahāsattva ripens sentient beings and adorns the Buddha-lands, he well cultivates the perfection of prajñāpāramitā, so he can't ripen sentient beings, adorn the Buddha-lands",
        "source": "T07n0220_501:0551a11_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩依止般若波羅蜜多，而成熟有情、嚴淨佛土故能調伏高心，",
        "translation": "“These great enlightening beings rely on the perfection of wisdom to develop sentient beings and purify their buddha-lands, and therefore they are able to tame lofty minds.",
        "source": "T07n0220_501:0551a13_4"
    },
    {
        "source_sentence": "亦能迴向一切智智。",
        "translation": "He's also able to dedicate himself back to omniscience and cognition.",
        "source": "T07n0220_501:0551a15_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_501:0551a15_6"
    },
    {
        "source_sentence": "由此因緣，我作是說：如是般若波羅蜜多甚奇希有，能調菩薩摩訶薩眾令離高心，",
        "translation": "Because of these causes and conditions, I make this teaching: Such is the rare and marvelous thing about the perfection of wisdom that can tame the minds of great enlightening beings and cause them to part with lofty aspirations.",
        "source": "T07n0220_501:0551a15_7"
    },
    {
        "source_sentence": "復能迴向一切智智。」",
        "translation": "He's also able to dedicate himself back to omniscience and cognition.",
        "source": "T07n0220_501:0551a17_8"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「憍尸迦！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, Kauśika!",
        "source": "T07n0220_501:0551a18_0"
    },
    {
        "source_sentence": "若善男子、善女人等能於般若波羅蜜多甚深經典，不離一切智智心，以無所得為方便，",
        "translation": "If good men and good women can attain the profound scriptures of the prajñāpāramitā without leaving the mind of omniscience, using the method of attaining nothing as their skillful means,",
        "source": "T07n0220_501:0551a18_1"
    },
    {
        "source_sentence": "至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "They wholeheartedly hear, retain, recite, diligently practice, correctly contemplate, write, explain, and disseminate it.",
        "source": "T07n0220_501:0551a20_2"
    },
    {
        "source_sentence": "是善男子、善女人等身心安樂，不為一切災橫侵惱。",
        "translation": "Good men and good women, their bodies and minds are peaceful and they won't be harmed by all the calamities.",
        "source": "T07n0220_501:0551a22_3"
    },
    {
        "source_sentence": "若在軍旅交戰陣時，至心念誦如是般若波羅蜜多，於諸有情慈悲護念，",
        "translation": "“When they are engaged in battles, they wholeheartedly recite the transcendent wisdom of these teachings to protect sentient beings with compassion.",
        "source": "T07n0220_501:0551a23_4"
    },
    {
        "source_sentence": "不為刀杖之所傷殺，所對怨敵皆起慈心，設起惡心自然退敗，是善男子、善女人等，",
        "translation": "They won't be harmed by a sword or cane, and they'll become compassionate to enemies and enemies. If they give rise to bad thoughts, they'll naturally retreat.",
        "source": "T07n0220_501:0551a24_5"
    },
    {
        "source_sentence": "若在軍旅刀箭所傷失命喪身，終無是處。",
        "translation": "If an army soldier is wounded by a sword or arrow and loses his life and body, there's never a place for him.",
        "source": "T07n0220_501:0551a26_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0551a27_7"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551a27_8"
    },
    {
        "source_sentence": "是善男子、善女人等不離一切智智心，以無所得為方便，長夜修行甚深般若波羅蜜多，",
        "translation": "Good men and good women, who don’t part with the minds of omniscience and knowledge, cultivate profound prajñāpāramitā for a long time by using ungraspable skillful means.",
        "source": "T07n0220_501:0551a28_9"
    },
    {
        "source_sentence": "自能降伏貪、瞋、癡、慢、惡見、隨眠、纏垢、惡業種種刀杖，亦能除他貪、瞋、癡、慢、惡見、隨眠、纏垢、惡業諸刀杖故。",
        "translation": "They themselves can subdue the various swords and sticks of greed, anger, delusion, pride, bad views, latencies, tears, defilements, and bad actions, and they can also remove the swords and sticks of gre",
        "source": "T07n0220_501:0551b01_10"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0551b03_11"
    },
    {
        "source_sentence": "若善男子、善女人等，能於般若波羅蜜多甚深經典，不離一切智智心，",
        "translation": "If good men and good women can attain the profound scriptures of the perfection of wisdom without leaving the mind of omniscience,",
        "source": "T07n0220_501:0551b03_12"
    },
    {
        "source_sentence": "以無所得為方便，至心聽聞、受持、讀誦、精勤修學、如理思惟、恭敬供養、尊重讚歎、書寫、解說、廣令流布，",
        "translation": "With ungraspable skill in means they wholeheartedly hear, retain, recite, diligently practice, correctly contemplate, venerate, honor, praise, write, explain, and disseminate it.",
        "source": "T07n0220_501:0551b05_13"
    },
    {
        "source_sentence": "是善男子、善女人等，一切毒藥、蠱道、鬼魅、厭禱、呪術皆不能害，",
        "translation": "Good men and good women can't harm all the poisons, paths of delusion, ghosts, spells, prayers, or spells that are disgusting.",
        "source": "T07n0220_501:0551b07_14"
    },
    {
        "source_sentence": "水不能溺，火不能燒，刀杖、惡獸、怨賊、惡神、眾邪、魍魎不能傷害。",
        "translation": "Water won't drown them, fire won't burn them, and swords, sticks, bad animals, thieves, bad spirits, various evils, and arrows won't harm them.",
        "source": "T07n0220_501:0551b09_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0551b10_1"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551b10_2"
    },
    {
        "source_sentence": "如是般若波羅蜜多是大神呪，如是般若波羅蜜多是大明呪，如是般若波羅蜜多是無上呪，",
        "translation": "Thus is the perfection of wisdom a great spiritual spell, thus is the perfection of wisdom a great illuminating spell, and thus is the perfection of wisdom an unsurpassed spell.",
        "source": "T07n0220_501:0551b10_3"
    },
    {
        "source_sentence": "如是般若波羅蜜多是無等等呪，如是般若波羅蜜多是一切呪王，最上最妙，",
        "translation": "Such prajñāpāramitā is the peerless spell, and such prajñāpāramitā is the king of all spells, the highest and most wonderful.",
        "source": "T07n0220_501:0551b12_4"
    },
    {
        "source_sentence": "無能及者，具大威力能伏一切，不為一切之所降伏。",
        "translation": "There's no one who can surpass them, for they possess great authority that can subdue all and aren't subdued by all.",
        "source": "T07n0220_501:0551b14_5"
    },
    {
        "source_sentence": "是善男子、善女人等精勤修學如是呪王，不為自害，不為他害，不為俱害。",
        "translation": "Good men and good women who diligently cultivate such a king of spells don't harm themselves, harm others, or harm both.",
        "source": "T07n0220_501:0551b15_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0551b17_7"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551b17_8"
    },
    {
        "source_sentence": "是善男子、善女人等學此般若波羅蜜多，了自他俱不可得故。",
        "translation": "Good men and good women who study this prajñāpāramitā understand that neither self nor other is obtainable.",
        "source": "T07n0220_501:0551b17_9"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551b19_10"
    },
    {
        "source_sentence": "是善男子、善女人等學此般若波羅蜜多大呪王時，不得我乃至見者，不得色乃至識，",
        "translation": "Good men and good women, when they study this great dhāraṇī king of the perfection of wisdom, they won't attain self or even views, and they won't attain form or consciousness.",
        "source": "T07n0220_501:0551b19_11"
    },
    {
        "source_sentence": "如是乃至不得一切智、道相智、一切相智，以於我等無所得故，不為自害，",
        "translation": "In the same way, they do not attain omniscience, knowledge of the path, or knowledge of all characteristics because they have nothing to be gained from us and don’t harm themselves.",
        "source": "T07n0220_501:0551b21_12"
    },
    {
        "source_sentence": "不為他害，不為俱害。",
        "translation": "They don't harm others and don't harm both.",
        "source": "T07n0220_501:0551b23_0"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551b23_1"
    },
    {
        "source_sentence": "是善男子、善女人等學此般若波羅蜜多大呪王時，於我及法雖無所得，",
        "translation": "Good men and good women, when they study this great dhāraṇī of prajñāpāramitā, even though they don't attain it for themselves or for the Dharma,",
        "source": "T07n0220_501:0551b23_2"
    },
    {
        "source_sentence": "而證無上正等菩提，觀諸有情心行差別，隨宜為轉無上法輪，令如說行得大饒益。",
        "translation": "He then realizes unsurpassed perfect enlightenment, observes the distinctions in the minds and actions of sentient beings, turns the unsurpassed wheel of the Dharma as appropriate, and practices it as described to greatly benefit them.",
        "source": "T07n0220_501:0551b25_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0551b27_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551b27_5"
    },
    {
        "source_sentence": "過去未來現在菩薩摩訶薩眾，皆於如是甚深般若波羅蜜多大神呪王精勤修學，",
        "translation": "The great enlightening beings of past, future, and present all diligently practiced such profound prajñāpāramitā as the great dhāraṇī king.",
        "source": "T07n0220_501:0551b27_6"
    },
    {
        "source_sentence": "已、當、現證無上菩提，轉妙法輪度無量眾。",
        "translation": "Having, will, and now realize unsurpassed enlightenment, he turns the wonderful wheel of the Dharma to save measureless multitudes.",
        "source": "T07n0220_501:0551b29_7"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0551c02_0"
    },
    {
        "source_sentence": "若善男子、善女人等於此般若波羅蜜多甚深經典，不離一切智智心，以無所得為方便，",
        "translation": "Good men and good women, these profound scriptures of the prajñāpāramitā don’t part from the mind of omniscience but use the method of attaining nothing.",
        "source": "T07n0220_501:0551c02_1"
    },
    {
        "source_sentence": "至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "They wholeheartedly hear, retain, recite, diligently practice, correctly contemplate, write, explain, and disseminate it.",
        "source": "T07n0220_501:0551c04_2"
    },
    {
        "source_sentence": "是善男子、善女人等隨所居止國土城邑人及非人，不為一切災橫疾疫之所傷害。",
        "translation": "Good men and good women, wherever they live in their countries, cities, people, and non-people won't be harmed by all the calamities, illnesses, and epidemics.",
        "source": "T07n0220_501:0551c05_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0551c07_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551c07_5"
    },
    {
        "source_sentence": "是善男子、善女人等隨所住處，為此三千大千世界及餘十方無量無數無邊世界，",
        "translation": "Wherever these sons and daughters of a virtuous family live, they become buddhas in the universe Sarvagandhasugandhā.",
        "source": "T07n0220_501:0551c07_6"
    },
    {
        "source_sentence": "所有四大王眾天乃至色究竟天，并諸龍、神、阿素洛等，常來守護、恭敬供養、尊重讚歎，",
        "translation": "All the four great kings and gods, as well as the Trāyastriṃśa gods, nāgas, devas, asuras, and so forth, always came to protect, honor, serve, venerate, and praise him.",
        "source": "T07n0220_501:0551c09_7"
    },
    {
        "source_sentence": "不令般若波羅蜜多大神呪王有留難故。",
        "translation": "It's because it doesn't cause the great dhāraṇī king Prajñāpāramitā to have any difficulty.",
        "source": "T07n0220_501:0551c11_8"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0551c12_9"
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多大神呪王，置清淨處恭敬供養、尊重讚歎，",
        "translation": "If good men and good women write this great dhāraṇī king of prajñāpāramitā, they'll place it in a pure place to honor, offer support, venerate, and praise it.",
        "source": "T07n0220_501:0551c13_0"
    },
    {
        "source_sentence": "雖不聽聞、受持、讀誦、精勤修學、如理思惟，亦不為他開示分別，而此住處國邑王都，",
        "translation": "Though they do not hear, retain, recite, exert effort in training, or contemplate correctly, and yet they do not reveal or discriminate for others. Yet their abode is this:",
        "source": "T07n0220_501:0551c14_1"
    },
    {
        "source_sentence": "人非人等不為一切災橫疾疫之所傷害。",
        "translation": "People and non-people aren't harmed by all the calamities, illnesses, and epidemics.",
        "source": "T07n0220_501:0551c16_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0551c17_3"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551c17_4"
    },
    {
        "source_sentence": "如是般若波羅蜜多大神呪王隨所住處，為此三千大千世界及餘十方無量無數無邊世界，",
        "translation": "Thus, the great dhāraṇī king Prajñāpāramitā follows these 3,000 great one-thousand worlds and the other incalculable and limitless worlds in the ten directions wherever he lives.",
        "source": "T07n0220_501:0551c18_5"
    },
    {
        "source_sentence": "所有四大王眾天乃至色究竟天并諸龍神、阿素洛等，常來守護、恭敬供養、尊重讚歎，",
        "translation": "All the four great kings and gods, as well as the Trāyastriṃśa gods, nāgas, asura spirits, and so forth, always came to protect them, honor and venerate them, and revere and praise them.",
        "source": "T07n0220_501:0551c20_6"
    },
    {
        "source_sentence": "不令般若波羅蜜多大神呪王有留難故。",
        "translation": "It's because it doesn't cause the great dhāraṇī king Prajñāpāramitā to have any difficulty.",
        "source": "T07n0220_501:0551c22_7"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0551c23_8"
    },
    {
        "source_sentence": "是善男子，善女人等但書般若波羅蜜多大神呪王，置清淨處恭敬供養、尊重讚歎，",
        "translation": "Good men and good women simply write the great dhāraṇī king Prajñāpāramitā, placing it in a pure place to honor, offer support, venerate, and praise it.",
        "source": "T07n0220_501:0551c23_9"
    },
    {
        "source_sentence": "尚獲如是現法勝利，況能聽聞、受持、讀誦、精勤修學、如理思惟，及廣為他開示分別！",
        "translation": "How could they hear, retain, recite, diligently cultivate, correctly contemplate, and explain it in detail for others?",
        "source": "T07n0220_501:0551c25_10"
    },
    {
        "source_sentence": "當知是輩功德無邊，速證菩提饒益一切。",
        "translation": "You should know that the merits of these people are limitless, quickly realizing enlightenment and benefiting all.",
        "source": "T07n0220_501:0551c27_0"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0551c27_1"
    },
    {
        "source_sentence": "若善男子、善女人等怖畏怨家、惡獸、災橫、厭禱、疾疫、毒藥、呪等，",
        "translation": "Suppose good men and good women are afraid of enemies, bad animals, disasters, distasteful prayers, epidemics, poisonous medicines, spells, and so forth.",
        "source": "T07n0220_501:0551c28_2"
    },
    {
        "source_sentence": "應書般若波羅蜜多大神呪王，隨多少分香囊盛貯置寶筒中，恒隨逐身供養恭敬、尊重讚歎，",
        "translation": "You should write the great dhāraṇī king Prajñāpāramitā, and store it in a jeweled tube for as many parts of your fragrant bag as you like, always following yourself to offer support, respect, venerate, and praise it",
        "source": "T07n0220_501:0551c29_3"
    },
    {
        "source_sentence": "諸怖畏事皆自銷除，天龍、鬼神常守護故。",
        "translation": "Their fears are all self-remedied, because gods, dragons, and ghosts always guard them.",
        "source": "T07n0220_501:0552a02_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552a03_5"
    },
    {
        "source_sentence": "譬如有人或傍生類入菩提樹院，或至彼院邊，人非人等不能傷害。",
        "translation": "Suppose there's a person or an unenlightened type who enters the bodhi tree monastery or goes to the side of that monastery, and neither person nor person can harm them.",
        "source": "T07n0220_501:0552a03_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0552a05_7"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552a05_8"
    },
    {
        "source_sentence": "過去、未來、現在諸佛皆坐此處證得無上正等菩提，得菩提已，施諸有情，",
        "translation": "The buddhas of the past, future, and present all sit here to realize supreme perfect enlightenment. Having attained enlightenment, they give it to sentient beings:",
        "source": "T07n0220_501:0552a05_9"
    },
    {
        "source_sentence": "無恐、無怖、無怨、無害、身心安樂。",
        "translation": "They have no fear, no fear, no enmity, no harm, and peace of mind and body.",
        "source": "T07n0220_501:0552a07_10"
    },
    {
        "source_sentence": "安立無量無數有情，令住天人尊貴妙行；",
        "translation": "They settle infinite and countless sentient beings, enabling them to abide in the sublime practice of gods and humans.",
        "source": "T07n0220_501:0552a08_11"
    },
    {
        "source_sentence": "安立無量無數有情，令住三乘安樂妙行；",
        "translation": "They settle immeasurable, countless sentient beings and cause them to abide in the sublime practice of peace and happiness of the three vehicles.",
        "source": "T07n0220_501:0552a09_12"
    },
    {
        "source_sentence": "安立無量無數有情，令現證得或預流果、或一來果、或不還果、或阿羅漢果；",
        "translation": "They settle immeasurable, countless sentient beings and cause them to attain in the present the fruit of stream-entry, the fruit of once-returning, the fruit of nonreturning, or the fruit of the arhat.",
        "source": "T07n0220_501:0552a10_0"
    },
    {
        "source_sentence": "安立無量無數有情，令當證得獨覺菩提；",
        "translation": "They establish measureless and countless sentient beings, enabling them to realize the enlightenment of individual illumination.",
        "source": "T07n0220_501:0552a11_1"
    },
    {
        "source_sentence": "安立無量無數有情，令修菩薩摩訶薩行當得無上正等菩提。",
        "translation": "He establishes measureless and countless sentient beings so that they cultivate the practice of bodhisattva-mahāsattva who will attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_501:0552a12_2"
    },
    {
        "source_sentence": "如是勝事皆由般若波羅蜜多威神之力，是故此處一切天、龍、阿素洛等皆同守護、恭敬供養、尊重讚歎。",
        "translation": "Such excellent things are all the result of the authoritative power of the prajñāpāramitā, so all gods, dragons, asuras, and other goddesses here share the same protection, respect, veneration, offerings, and praise.",
        "source": "T07n0220_501:0552a14_0"
    },
    {
        "source_sentence": "當知般若波羅蜜多甚深經典隨所住處亦復如是，一切天、龍、阿素洛等常來守護、恭敬供養、尊重讚歎不令般若波羅蜜多有留難故。",
        "translation": "You should know that the profound scriptures of the Prajñāpāramitā are likewise, and wherever they live, all gods, dragons, asuras, and so forth will always come to guard them, honor and venerate them, and pra",
        "source": "T07n0220_501:0552a16_1"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552a19_2"
    },
    {
        "source_sentence": "如是般若波羅蜜多甚深經典隨所在處，當知是處即真制多，一切有情皆應敬禮，",
        "translation": "Thus, wherever this profound scripture of the prajñāpāramitā is found, know that it's really a制多, and all sentient beings should venerate it.",
        "source": "T07n0220_501:0552a19_3"
    },
    {
        "source_sentence": "當以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明供養恭敬、尊重讚歎。」",
        "translation": "You must offer various kinds of exquisite flower garlands, such as fragrances as coated and spread, clothing, jewelry, jeweled banners, canopies, marvelous, rare, treasured, music, lamps, offerings,",
        "source": "T07n0220_501:0552a21_4"
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T07n0220_501:0552a24_0"
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多甚深經典，種種莊嚴恭敬供養、尊重讚歎，",
        "translation": "If good men and good women write this profound scripture of the prajñāpāramitā, variously adorned, respected, offered support, venerated, and praised,",
        "source": "T07n0220_501:0552a24_1"
    },
    {
        "source_sentence": "復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "They also offer various kinds of exquisite flower garlands, such as fragrant ointments as perfumes, clothing, jewelry, jeweled banners, canopies, all kinds of marvelous and rare treasures, music, and lamp",
        "source": "T07n0220_501:0552a26_2"
    },
    {
        "source_sentence": "有善男子、善女人等佛涅槃後起窣堵波七寶嚴飾，寶函盛貯佛設利羅安置其中，",
        "translation": "Good men and good women, after the nirvana of these buddhas, built stupas adorned with the seven kinds of treasure. The precious casket was stored in a large quantity in which to place the relics of the Buddha were preserved.",
        "source": "T07n0220_501:0552a28_3"
    },
    {
        "source_sentence": "恭敬供養、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "They venerate, honor, and praise them with various kinds of exquisite flower garlands, perfumes, clothing, jewelry, jeweled banners, pennants, canopies, marvelous things, treasures, music, and lamps.",
        "source": "T07n0220_501:0552b01_4"
    },
    {
        "source_sentence": "二所獲福，何者為多？」",
        "translation": "Second, which of the merits obtained is abundant?",
        "source": "T07n0220_501:0552b03_5"
    },
    {
        "source_sentence": "佛告憍尸迦：「我還問汝，當隨意答。",
        "translation": "The Buddha told Kauśika, I'll return to ask you questions, and you will answer them as you like.",
        "source": "T07n0220_501:0552b04_0"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_501:0552b04_1"
    },
    {
        "source_sentence": "如來所得一切智智及相好身，依何等法修學而得？」",
        "translation": "What are the ways in which the Tathāgata cultivates omniscience, knowledge, and the body of characteristics that he attains?",
        "source": "T07n0220_501:0552b05_0"
    },
    {
        "source_sentence": "天帝釋言：「如來所得一切智智及相好身，依此般若波羅蜜多甚深經典修學而得。」",
        "translation": "Śakra Devānām-Indra said, The Tathāgata has attained omniscience and the body with all its characteristics based on this profound scripture of prajñāpāramitā to cultivate and attain it.",
        "source": "T07n0220_501:0552b06_1"
    },
    {
        "source_sentence": "佛告憍尸迦：「如是！",
        "translation": "The Buddha told Kauśika, So it is!",
        "source": "T07n0220_501:0552b08_2"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_501:0552b08_3"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_501:0552b08_4"
    },
    {
        "source_sentence": "我依般若波羅蜜多甚深經典修學故，得一切智智及相好身。",
        "translation": "Because I cultivate the profound scriptures of the profound prajñāpāramitā, I attain omniscience and wisdom and the body endowed with characteristics.",
        "source": "T07n0220_501:0552b08_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0552b10_6"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552b10_7"
    },
    {
        "source_sentence": "不學般若波羅蜜多甚深經典，能得無上正等菩提無有是處。",
        "translation": "There's no place for someone who doesn't study the profound scriptures of the Prajñāpāramitā to attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_501:0552b10_8"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552b12_0"
    },
    {
        "source_sentence": "非但獲得相好身故說名如來、應、正等覺，要由證得一切智智說名如來、應、正等覺。",
        "translation": "It's not just that they attain a body with good characteristics and are called called the Tathāgata, Worthy of Offerings, or Perfectly Enlightened; it's because they realize omniscience and cognition that they're called the Ta",
        "source": "T07n0220_501:0552b12_1"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552b14_2"
    },
    {
        "source_sentence": "如來所得一切智智，要由般若波羅蜜多為因故起，佛相好身但為依處，",
        "translation": "The omniscience and knowledge attained by the Tathāgata must arise from the cause of the perfection of wisdom, for which the Buddha's body with distinctive characteristics is only the basis.",
        "source": "T07n0220_501:0552b14_3"
    },
    {
        "source_sentence": "若不依止佛相好身，一切智智無由而起，是故般若波羅蜜多正為因生一切智智，",
        "translation": "If they don't rely on the Buddha's body with its distinctive characteristics, omniscience and cognition will arise without a reason. Therefore, the prajñāpāramitā is precisely the cause for the production of omniscience and cognition",
        "source": "T07n0220_501:0552b15_4"
    },
    {
        "source_sentence": "欲令此智現前相續故，復修集佛相好身。",
        "translation": "Because they want to cause this knowledge to be manifested continuously, they also cultivate the Buddha's good body of characteristics and features.",
        "source": "T07n0220_501:0552b17_5"
    },
    {
        "source_sentence": "此相好身若非遍智所依處者，一切天、龍、阿素洛等不應竭誠供養恭敬，",
        "translation": "If these beautiful bodies were not the bases of omniscience, all gods, dragons, asuras, and so forth wouldn't wholeheartedly offer support and veneration.",
        "source": "T07n0220_501:0552b18_6"
    },
    {
        "source_sentence": "以相好身與佛遍智為所依止故，諸天、龍神、阿素洛等供養恭敬。",
        "translation": "Because the body with its distinctive characteristics and the Buddha's pervasive wisdom are the bases, gods, dragons, goddesses, asuras, and asuras make offerings and venerate it.",
        "source": "T07n0220_501:0552b20_7"
    },
    {
        "source_sentence": "由此緣故，我涅槃後諸天、龍神、人非人等供養恭敬我設利羅。",
        "translation": "For this reason, after my nirvāṇa, gods, dragons, goddesses, humans, and non-humans will offer support and respect to me Śāriputra.",
        "source": "T07n0220_501:0552b21_8"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552b23_9"
    },
    {
        "source_sentence": "若善男子、善女人等，但於般若波羅蜜多甚深經典恭敬供養、尊重讚歎，",
        "translation": "If good men and good women simply venerate, offer support, honor, and praise the profound scriptures of the Prajñāpāramitā,",
        "source": "T07n0220_501:0552b23_10"
    },
    {
        "source_sentence": "則為供養一切智智及所依止佛相好身并涅槃後佛設利羅。",
        "translation": "It's to make offerings to the omniscience and wisdom of all buddhas, the Buddha's characteristic bodies that they rely on, and the Śāriputra who will become a buddha after nirvāṇa.",
        "source": "T07n0220_501:0552b25_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0552b26_12"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552b26_13"
    },
    {
        "source_sentence": "一切智智及相好身并設利羅，皆以般若波羅蜜多為根本故。",
        "translation": "The omniscience, wisdom, the body with its characteristics, and Śāriputra are all based on the prajñāpāramitā as their root.",
        "source": "T07n0220_501:0552b26_14"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552b28_15"
    },
    {
        "source_sentence": "若善男子、善女人等但於佛身及設利羅恭敬供養、尊重讚歎，非為供養一切智智及此般若波羅蜜多。",
        "translation": "Suppose good men and good women simply venerate, honor, and praise the Buddha's body and Śāriputra with respect and reverence, not in order to make offerings to omniscience and this prajñāpāramitā.",
        "source": "T07n0220_501:0552b28_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0552c01_17"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552c02_18"
    },
    {
        "source_sentence": "佛身遺體非此般若波羅蜜多、一切智智之根本故。",
        "translation": "The legacy of the Buddha's body is not the root of this prajñāpāramitā or omniscience and cognition.",
        "source": "T07n0220_501:0552c02_19"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552c03_20"
    },
    {
        "source_sentence": "由此因緣，若善男子、善女人等，欲供養佛若身若心及餘功德，先當聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說如是般若波羅蜜多甚深經典，",
        "translation": "Because of these causes and conditions, if good men and good women want to make offerings to the Buddha's body, mind, and other merits, they must first hear, retain, recite, diligently cultivate, correctly contemplate, write, and explain",
        "source": "T07n0220_501:0552c03_21"
    },
    {
        "source_sentence": "復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明、供養恭敬、尊重讚歎。",
        "translation": "They also offer various kinds of exquisite flower garlands, such as fragrances as flowers, ointments, perfumes, clothing, jewelry, jeweled banners, canopies, all kinds of marvelous things, rare treasures,",
        "source": "T07n0220_501:0552c06_22"
    },
    {
        "source_sentence": "「以是故，憍尸迦！",
        "translation": "That's why, Kauśika!",
        "source": "T07n0220_501:0552c08_23"
    },
    {
        "source_sentence": "若善男子、善女人等，書此般若波羅蜜多甚深經典，種種莊嚴恭敬供養、尊重讚歎，",
        "translation": "If good men and good women write this profound scripture of prajñāpāramitā, variously adorned, respected, offered support, venerated, and praised it,",
        "source": "T07n0220_501:0552c09_24"
    },
    {
        "source_sentence": "復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "They also offer various kinds of exquisite flower garlands, such as fragrant ointments as perfumes, clothing, jewelry, jeweled banners, canopies, all kinds of marvelous and rare treasures, music, and lamp",
        "source": "T07n0220_501:0552c11_25"
    },
    {
        "source_sentence": "有善男子、善女人等佛涅槃後起窣堵波七寶嚴飾，寶函盛貯佛設利羅安置其中，",
        "translation": "Good men and good women, after the nirvana of these buddhas, built stupas adorned with the seven kinds of treasure. The precious casket was stored in a large quantity in which to place the relics of the Buddha were preserved.",
        "source": "T07n0220_501:0552c13_26"
    },
    {
        "source_sentence": "恭敬供養、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "They venerate, honor, and praise them with various kinds of exquisite flower garlands, perfumes, clothing, jewelry, jeweled banners, pennants, canopies, marvelous things, treasures, music, and lamps.",
        "source": "T07n0220_501:0552c14_27"
    },
    {
        "source_sentence": "二所獲福，前者為多無量倍數。",
        "translation": "The second is the merit that's obtained, which is numerous and immeasurable in number.",
        "source": "T07n0220_501:0552c17_28"
    },
    {
        "source_sentence": "「何以故？",
        "translation": "“Why is that?",
        "source": "T07n0220_501:0552c17_29"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0552c18_30"
    },
    {
        "source_sentence": "如是般若波羅蜜多甚深經典，速能成辦布施波羅蜜多乃至般若波羅蜜多，",
        "translation": "Thus, this profound scripture of the perfection of wisdom quickly accomplishes the perfection of generosity and even the perfection of wisdom.",
        "source": "T07n0220_501:0552c18_31"
    },
    {
        "source_sentence": "內空乃至無性自性空，真如乃至不思議界，斷界乃至無為界，苦、集、滅、道聖諦，",
        "translation": "The internal emptiness up to the emptiness of the self-nature of nonexistence, the true nature up to the inconceivable realm, the realm of cessation up to the realm of nothingness, and the noble truths of",
        "source": "T07n0220_501:0552c20_32"
    },
    {
        "source_sentence": "四念住乃至八聖道支，四靜慮、四無量、四無色定，八解脫、九次第定，",
        "translation": "The four abodes of mindfulness up to the eightfold noble path, the four meditations, the four immeasurable concentrations, the four formless concentrations, the eight liberations, and the nine graduated concentrations.",
        "source": "T07n0220_501:0552c21_33"
    },
    {
        "source_sentence": "空、無相、無願解脫門，淨觀地乃至如來地，極喜地乃至法雲地，五眼、六神通，",
        "translation": "The liberation gate of emptiness, signlessness, and wishlessness is the stage of pure contemplation up to the stage of the Tathāgata, the stage of ultimate bliss up to the stage of the Dharma-cloud, with five eyes and six",
        "source": "T07n0220_501:0552c23_34"
    },
    {
        "source_sentence": "如來十力乃至十八佛不共法，無忘失法、恒住捨性，一切陀羅尼門、三摩地門，",
        "translation": "The Tathāgata’s ten powers up to the unique qualities of the eighteen Buddhas, the principle of nonforgetfulness and abiding in equanimity: all dhāraṇī teachings as well as samādhi teachings.",
        "source": "T07n0220_501:0552c25_35"
    },
    {
        "source_sentence": "一切智、道相智、一切相智，成熟有情、嚴淨佛土，亦能成辦諸菩薩摩訶薩族姓圓滿、色力圓滿、財寶圓滿、眷屬圓滿，",
        "translation": "By omniscience, knowledge of the path, knowledge of all characteristics, and knowledge of all characteristics they can mature sentient beings and adorn and purify buddha-lands, and they can also perfect the bodhisattva-mahāsattva’",
        "source": "T07n0220_501:0552c26_36"
    },
    {
        "source_sentence": "亦能成辦世間所有十善業道，供養沙門、父母、師長，施、戒、修等無量善法，",
        "translation": "They are also able to perfect all the ten good paths of action in the world, and they can make offerings to renunciants, their parents, teachers, and elders, giving, upholding precepts, and cultivating immeasurable virtuous qualities",
        "source": "T07n0220_501:0552c29_37"
    },
    {
        "source_sentence": "亦能成辦剎帝利大族、婆羅門大族、長者大族、居士大族、四大王眾天乃至非想非非想處天，",
        "translation": "They can also accomplish the great clans of the kṣatriyas, the great clans of the brāhmaṇas, the great clans of wealthy householders, the great clans of laymen, the great clans of merchants,",
        "source": "T07n0220_501:0553a02_0"
    },
    {
        "source_sentence": "亦能成辦預流、一來、不還、阿羅漢果、獨覺菩提、一切菩薩摩訶薩行、諸佛無上正等菩提，",
        "translation": "He was also able to perfect the practices of all enlightening beings, such as stream-enterers, once-returners, nonreturners, arhats, solitary realizers, buddhas, and bodhisattvas.",
        "source": "T07n0220_501:0553a04_1"
    },
    {
        "source_sentence": "亦能成辦聲聞、獨覺、菩薩、如來應正等覺，亦能成辦不可思量、不可宣說、無上無上上、無等無等等一切智智。」",
        "translation": "They can also accomplish the knowledge of śrāvakas, pratyekbuddhas, bodhisattvas, tathāgatas, and arhats, and they can also accomplish the knowledge of inconceivability, ineffability, unsurpassed, unsurpass",
        "source": "T07n0220_501:0553a06_2"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「贍部洲人於此般若波羅蜜多甚深經典不恭敬供養、尊重讚歎者，",
        "translation": "Śakra Devānām-Indra then again said to the Buddha, The people of Jambudvīpa don't venerate, offer support, revere, and praise this profound scripture of the Prajñāpāramitā.",
        "source": "T07n0220_501:0553a09_0"
    },
    {
        "source_sentence": "彼豈不知恭敬供養、尊重讚歎如是般若波羅蜜多甚深經典，獲得種種功德勝利？」",
        "translation": "Doesn't they know that they respect, offer support, venerate, and praise such a profound scripture as the Prajñāpāramitā-sūtra to attain various merits and benefits?",
        "source": "T07n0220_501:0553a11_0"
    },
    {
        "source_sentence": "佛告憍尸迦：「我還問汝，隨汝意答。",
        "translation": "The Buddha told Kauśika, I'll return to ask you again, and answer as you wish.",
        "source": "T07n0220_501:0553a12_1"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_501:0553a13_2"
    },
    {
        "source_sentence": "贍部洲內有幾許人成佛證淨、成法證淨、成僧證淨？",
        "translation": "How many people in Jambudvīpa realize purity as buddhas, purity as dharma-teachers, and purity as samgha-teachers?",
        "source": "T07n0220_501:0553a13_3"
    },
    {
        "source_sentence": "有幾許人於佛無疑、於法無疑、於僧無疑？",
        "translation": "How many people have no doubt about the Buddha, no doubt about the Dharma, and no doubt about the saṃgha?",
        "source": "T07n0220_501:0553a15_0"
    },
    {
        "source_sentence": "有幾許人於佛究竟、於法究竟、於僧究竟？",
        "translation": "How many people have attained the ultimate in buddhahood, the ultimate in doctrine, and the ultimate in Sangha?",
        "source": "T07n0220_501:0553a15_1"
    },
    {
        "source_sentence": "有幾許人修十善業道？",
        "translation": "How many people cultivate the ten good paths of action?",
        "source": "T07n0220_501:0553a16_2"
    },
    {
        "source_sentence": "有幾許人行施、戒、修？",
        "translation": "How many people practice generosity, observe precepts, and cultivate it?",
        "source": "T07n0220_501:0553a17_3"
    },
    {
        "source_sentence": "有幾許人得三十七菩提分法？",
        "translation": "How many people have attained the thirty-seven factors of enlightenment?",
        "source": "T07n0220_501:0553a17_4"
    },
    {
        "source_sentence": "有幾許人得三解脫門？",
        "translation": "How many people have attained the three gates of liberation?",
        "source": "T07n0220_501:0553a18_5"
    },
    {
        "source_sentence": "有幾許人得八解脫？",
        "translation": "How many people attain the eight liberations?",
        "source": "T07n0220_501:0553a19_6"
    },
    {
        "source_sentence": "有幾許人得九次第定？",
        "translation": "How many people have attained the nine graduated concentrations?",
        "source": "T07n0220_501:0553a19_7"
    },
    {
        "source_sentence": "有幾許人得四無礙解？",
        "translation": "How many people have attained the four kinds of unhindered understanding?",
        "source": "T07n0220_501:0553a20_8"
    },
    {
        "source_sentence": "有幾許人得六神通？",
        "translation": "How many people have attained the six supernormal powers?",
        "source": "T07n0220_501:0553a20_9"
    },
    {
        "source_sentence": "有幾許人永斷三結得預流果？",
        "translation": "How many people permanently end the three bonds and attain the fruit of stream-winner?",
        "source": "T07n0220_501:0553a21_10"
    },
    {
        "source_sentence": "有幾許人薄貪、瞋、癡得一來果？",
        "translation": "How many people have attained the fruit of once-returning with little craving, anger, or delusion?",
        "source": "T07n0220_501:0553a21_11"
    },
    {
        "source_sentence": "有幾許人斷五順下分結得不還果？",
        "translation": "How many people abandon the five lower bonds and attain the fruit of nonreturning?",
        "source": "T07n0220_501:0553a22_12"
    },
    {
        "source_sentence": "有幾許人斷五順上分結得阿羅漢果？",
        "translation": "How many people have cut the five higher bonds and attained the fruit of arhatship?",
        "source": "T07n0220_501:0553a23_13"
    },
    {
        "source_sentence": "有幾許人發心定趣獨覺菩提？",
        "translation": "How many people give rise to the intention to concentrate their minds and aspire to the enlightenment of solitary realizer?",
        "source": "T07n0220_501:0553a24_14"
    },
    {
        "source_sentence": "有幾許人發心定趣諸佛無上正等菩提？」",
        "translation": "How many people have aroused the intention to concentrate on the unsurpassed perfect enlightenment of the buddhas?",
        "source": "T07n0220_501:0553a24_15"
    },
    {
        "source_sentence": "天帝釋言：「贍部洲內有少分人成佛證淨、成法證淨、成僧證淨，如是乃至有少分人發心定趣諸佛無上正等菩提。」",
        "translation": "Śakra Devānām-Indra said, In Jambudvīpa, there are a few people who become buddhas and realize purity, accomplish the Dharma and realize purity, and become saṃgha and realize purity, and so forth, up to a",
        "source": "T07n0220_501:0553a25_16"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_501:0553a28_17"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_501:0553a29_18"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_501:0553a29_19"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0553a29_20"
    },
    {
        "source_sentence": "贍部洲內極少分人成佛證淨、成法證淨、成僧證淨，轉少分人於佛無疑、於法無疑、於僧無疑，",
        "translation": "In Jambudvfpa, a very small minority of people attain buddhahood, realize enlightenment, perfect the purity of doctrine, and perfect the purity of Sangha. Moreover, a small minority have no doubt in regard to",
        "source": "T07n0220_501:0553a29_21"
    },
    {
        "source_sentence": "如是乃至轉少分人發心定趣諸佛無上正等菩提，轉少分人既發心已精勤修習趣菩提行，",
        "translation": "Thus, it's up to a small part of people who have arisen the intention to concentrate on the unsurpassed correct perfect enlightenment of the buddhas. A small part of people who have arisen the intention and are diligently cultivating the practice",
        "source": "T07n0220_501:0553b02_22"
    },
    {
        "source_sentence": "轉少分人精勤修習趣菩提行能不退轉證得無上正等菩提。",
        "translation": "He transforms a small group of people who diligently cultivate the practice of enlightenment and can never regress from realizing unsurpassed perfect enlightenment.",
        "source": "T07n0220_501:0553b04_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0553b06_24"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0553b06_25"
    },
    {
        "source_sentence": "諸有情類流轉生死，無量世來多不見佛，不聞正法，不親近僧，多不修行十善業道及施、戒、修；",
        "translation": "Sentient beings transmigrate in birth and death for countless ages, often not seeing Buddha; they do not hear the true Teaching, are not intimate with the Sangha, mostly do not practice the ten good paths of action, giving, discipline, and",
        "source": "T07n0220_501:0553b06_26"
    },
    {
        "source_sentence": "不聞布施乃至般若波羅蜜多，不修布施乃至般若波羅蜜多。",
        "translation": "They won't hear about generosity or even the perfection of wisdom, and they won't cultivate generosity or even the perfection of wisdom.",
        "source": "T07n0220_501:0553b08_27"
    },
    {
        "source_sentence": "如是乃至不聞一切智、道相智、一切相智，不修一切智、道相智、一切相智。",
        "translation": "Thus, they don't hear omniscience, knowledge of the path, or knowledge of all characteristics, and they don't cultivate omniscience, knowledge of the path, or knowledge of all characteristics.",
        "source": "T07n0220_501:0553b10_28"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0553b11_29"
    },
    {
        "source_sentence": "由是因緣，當知於此贍部洲內極少分人成佛證淨、成法證淨、成僧證淨，",
        "translation": "Because of these causes and conditions, it should be known that in this Jambudvipa a very small number of people become buddhas and realize purity, the realization of the Dharma and the realization of the Sangha.",
        "source": "T07n0220_501:0553b11_30"
    },
    {
        "source_sentence": "轉少分人於佛無疑、於法無疑、於僧無疑，如是乃至轉少分人發心定趣諸佛無上正等菩提，",
        "translation": "In this way, up to a small part of those who turn toward the Buddha have no doubt in regard to buddhas, no doubt in regard to doctrines, and no doubt in regard to Sangha. And so on, up to a small part of those who turn toward",
        "source": "T07n0220_501:0553b13_31"
    },
    {
        "source_sentence": "轉少分人既發心已精勤修習趣菩提行，轉少分人精勤修習趣菩提行能不退轉證得無上正等菩提。",
        "translation": "After they have arisen the intention to do so, a small group of people will diligently cultivate the practice that leads to enlightenment, and a small group of people will diligently cultivate the practice that leads to enlightenment and be able to",
        "source": "T07n0220_501:0553b15_32"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0553b18_33"
    },
    {
        "source_sentence": "我今問汝，隨汝意答。",
        "translation": "I will now question you, and answer as you wish.",
        "source": "T07n0220_501:0553b18_34"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_501:0553b18_35"
    },
    {
        "source_sentence": "置贍部洲所有人類。",
        "translation": "Suppose he were to place all the people in Jambudvīpa.",
        "source": "T07n0220_501:0553b19_36"
    },
    {
        "source_sentence": "於此三千大千世界，幾許有情供養恭敬父母、師長？",
        "translation": "How many sentient beings in these 3,000 great one-thousand worlds make offerings to their parents, teachers, and elders?",
        "source": "T07n0220_501:0553b19_37"
    },
    {
        "source_sentence": "幾許有情供養沙門、婆羅門？",
        "translation": "How many sentient beings make offerings to ascetics and priests?",
        "source": "T07n0220_501:0553b20_38"
    },
    {
        "source_sentence": "幾許有情布施、持戒修諸福業？",
        "translation": "How many sentient beings are allowed to cultivate meritorious actions such as generosity and observance of precepts?",
        "source": "T07n0220_501:0553b21_39"
    },
    {
        "source_sentence": "幾許有情行十善業道？",
        "translation": "How many sentient beings practice the ten good paths of action?",
        "source": "T07n0220_501:0553b22_40"
    },
    {
        "source_sentence": "幾許有情於諸欲中住厭患想、無常想、苦想、無我想、不淨想、厭食想、一切世間不可樂想？",
        "translation": "How many sentient beings abide in the perception of distress, impermanence, suffering, selflessness, impurity, disgust for food, and all worldly unpleasant thoughts among desires?",
        "source": "T07n0220_501:0553b22_41"
    },
    {
        "source_sentence": "幾許有情修四靜慮、四無量、四無色定？",
        "translation": "How many sentient beings are allowed to cultivate the four meditations, the four immeasurable concentrations, and the four formless concentrations?",
        "source": "T07n0220_501:0553b24_42"
    },
    {
        "source_sentence": "幾許有情成佛證淨、成法證淨、成僧證淨？",
        "translation": "How many sentient beings attain the realization of buddhahood, the realization of doctrine, and the realization of saṃghahood?",
        "source": "T07n0220_501:0553b25_43"
    },
    {
        "source_sentence": "如是乃至幾許有情發心定趣諸佛無上正等菩提？",
        "translation": "How many sentient beings aspire to the buddhas' unsurpassed correct perfect enlightenment?",
        "source": "T07n0220_501:0553b26_44"
    },
    {
        "source_sentence": "幾許有情既發心已精勤修習趣菩提行？",
        "translation": "How many sentient beings have arisen the intention and diligently cultivated the practice of enlightenment?",
        "source": "T07n0220_501:0553b27_45"
    },
    {
        "source_sentence": "幾許有情練磨長養趣菩提心？",
        "translation": "How many sentient beings cultivate and nurture the mind of enlightenment?",
        "source": "T07n0220_501:0553b28_46"
    },
    {
        "source_sentence": "幾許有情方便善巧修行般若波羅蜜多？",
        "translation": "How many sentient beings skillfully cultivate the perfection of wisdom with skillful means?",
        "source": "T07n0220_501:0553b29_47"
    },
    {
        "source_sentence": "幾許有情得住菩薩不退轉地？",
        "translation": "How many sentient beings can abide in the bodhisattva's stage of nonretrogression?",
        "source": "T07n0220_501:0553c01_48"
    },
    {
        "source_sentence": "幾許有情疾證無上正等菩提？」",
        "translation": "How many sentient beings quickly realize unsurpassed perfect enlightenment?",
        "source": "T07n0220_501:0553c01_49"
    },
    {
        "source_sentence": "天帝釋言：「於此三千大千世界，少分有情供養恭敬父母、師長，如是乃至少分有情疾證無上正等菩提。」",
        "translation": "Śakra Devānām-Indra said, In this 3,000 great one-thousand worlds, a small part of sentient beings offer support and respect to their parents and teachers, and so forth, up to a small part of sentient beings",
        "source": "T07n0220_501:0553c02_50"
    },
    {
        "source_sentence": "佛告憍尸迦：「如是！",
        "translation": "The Buddha told Kauśika, So it is!",
        "source": "T07n0220_501:0553c04_51"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_501:0553c05_52"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_501:0553c05_53"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0553c05_54"
    },
    {
        "source_sentence": "於此三千大千世界，極少有情供養恭敬父母、師長，轉少有情供養恭敬沙門、婆羅門，",
        "translation": "In the great manifold cosmos consisting of three thousand great one-thousand worlds, there are very few sentient beings who honor and venerate their parents, teachers, and elders.",
        "source": "T07n0220_501:0553c05_55"
    },
    {
        "source_sentence": "如是乃至轉少有情得住菩薩不退轉地，轉少有情疾證無上正等菩提。",
        "translation": "Thus, it goes so far as to develop few sentient beings who can abide in the bodhisattva's stage of nonregression and develop few sentient beings who quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_501:0553c07_56"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_501:0553c10_0"
    },
    {
        "source_sentence": "我以無障清淨佛眼遍觀十方無邊世界，雖有無量無數有情發菩提心修菩薩行，",
        "translation": "With unobstructed pure Buddha-eye, I pervade the boundless worlds of the ten directions. Though there are countless sentient beings who give rise to the aspiration for enlightenment and carry out the practice of enlightening",
        "source": "T07n0220_501:0553c10_1"
    },
    {
        "source_sentence": "而由遠離甚深般若波羅蜜多方便善巧，若一、若二、若三有情得住菩薩不退轉地，",
        "translation": "Through the skillful means of detachment from profound prajñāpāramitā, if one, two, or three sentient beings can abide in the bodhisattva's stage of nonretrogression,",
        "source": "T07n0220_501:0553c12_2"
    },
    {
        "source_sentence": "多分退墮聲聞、獨覺下意、下行、下劣地中。",
        "translation": "They mostly regress and fall into the lower-minded, lower-practicing, and inferior stages of śrāvakas, pratyekbuddhas, and solitary realizers.",
        "source": "T07n0220_501:0553c14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0553c15_0"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0553c15_1"
    },
    {
        "source_sentence": "諸佛無上正等菩提功德無邊甚難可證，惡慧、懈怠、下劣精進、下劣勝解下劣有情不能得故。",
        "translation": "The merits of the buddhas' unsurpassed perfect enlightenment are limitless and difficult to realize, because bad wisdom, laziness, inferior effort, inferior resolve, and inferior sentient beings can't attain it.",
        "source": "T07n0220_501:0553c15_2"
    },
    {
        "source_sentence": "「是故，憍尸迦！",
        "translation": "Therefore, Kauśika!",
        "source": "T07n0220_501:0553c17_3"
    },
    {
        "source_sentence": "若善男子、善女人等發菩提心修菩薩行，欲住菩薩不退轉地，疾證無上正等菩提無留難者，",
        "translation": "“Good sons and good women who have set out for enlightenment and are engaged in the practice of enlightening beings, wishing to abide in the stage of nonregression of enlightening beings, will quickly attain unexcelled",
        "source": "T07n0220_501:0553c17_4"
    },
    {
        "source_sentence": "應於般若波羅蜜多甚深經典，數數聽聞、受持、讀誦、精勤修學、如理思惟、好請問師、樂為他說；",
        "translation": "They should repeatedly hear, retain, recite, diligently practice, correctly contemplate, gladly question teachers, and delight in speaking for others the profound scriptures of the perfection of wisdom.",
        "source": "T07n0220_501:0553c19_5"
    },
    {
        "source_sentence": "復應書寫，眾寶莊嚴、恭敬供養、尊重讚歎，復以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "You should also write a book that's adorned with all kinds of treasures, venerated, honored, and praised, and offered various kinds of exquisite flower garlands, such as scents as smeared and scattering, clothing,",
        "source": "T07n0220_501:0553c21_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0553c24_7"
    },
    {
        "source_sentence": "是善男子、善女人等，於餘攝入甚深般若波羅蜜多諸勝善法，亦應聽聞、受持、讀誦、精勤修學、如理思惟、好請問師、樂為他說，",
        "translation": "Good men and good women, these other excellent and good qualities that are collected into the profound prajñāpāramitā should also be heard, memorized, recited, diligently cultivated, correctly contemplated, well-versed, and delight",
        "source": "T07n0220_501:0553c24_8"
    },
    {
        "source_sentence": "復應書寫供養恭敬。",
        "translation": "You should also write it down to honor and venerate it.",
        "source": "T07n0220_501:0553c27_9"
    },
    {
        "source_sentence": "何謂攝入甚深般若波羅蜜多餘勝善法？",
        "translation": "What's meant by gathering in the other excellent good qualities of the profound prajñāpāramitā?",
        "source": "T07n0220_501:0553c28_10"
    },
    {
        "source_sentence": "所謂布施乃至靜慮波羅蜜多，內空乃至無性自性空，真如乃至不思議界，",
        "translation": "It's called generosity up to the perfection of meditation, internal emptiness up to the emptiness of the natureless self-nature, true thusness up to the inconceivable realm.",
        "source": "T07n0220_501:0553c29_11"
    },
    {
        "source_sentence": "斷界乃至無為界，苦、集、滅、道聖諦，四念住乃至八聖道支，四靜慮、四無量、四無色定，",
        "translation": "The noble truths of suffering, arising, cessation, and the path are the four abodes of mindfulness up to the eight noble factors of the path, the four meditations, the four immeasurable concentrations, and the four formless concentrations",
        "source": "T07n0220_501:0554a01_12"
    },
    {
        "source_sentence": "八解脫、九次第定，三解脫門，極喜地乃至法雲地，五眼、六神通，如來十力乃至十八佛不共法，",
        "translation": "The eight liberations, the nine graduated concentrations, the three gates of liberation, the stage of ultimate bliss up to the stage of the dharma-cloud, the five eyes and six supernormal powers, the ten powers of the Ta",
        "source": "T07n0220_501:0554a03_13"
    },
    {
        "source_sentence": "無忘失法、恒住捨性，陀羅尼門、三摩地門，一切智、道相智、一切相智，",
        "translation": "The dharma of nonforgetfulness and the nature of constantly abiding equanimity are the dhāraṇī teachings, the samādhi teachings, omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_501:0554a05_14"
    },
    {
        "source_sentence": "若餘無量無邊佛法，是謂攝入甚深般若波羅蜜多餘勝善法。",
        "translation": "If there are other measureless and limitless buddha-dharmas, this is called gathering in the remaining superior good qualities of the profound prajñāpāramitā.",
        "source": "T07n0220_501:0554a07_15"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0554a08_16"
    },
    {
        "source_sentence": "是善男子、善女人等，於餘隨順甚深般若波羅蜜多蘊、處、界等無量法門，",
        "translation": "Good men and good women, these are the other innumerable dharmas that follow the profound prajñāpāramitā-sūtras, such as the aggregates, fields, and realms,",
        "source": "T07n0220_501:0554a08_17"
    },
    {
        "source_sentence": "亦應聽聞、受持、讀誦、如理思惟，不應非毀令於無上正等菩提而作留難。",
        "translation": "They should also hear, retain, recite, and correctly contemplate it, not by criticizing or making it difficult to attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_501:0554a10_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0554a12_19"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0554a12_20"
    },
    {
        "source_sentence": "是善男子、善女人等應作是念：『如來昔住菩薩位時，常勤修學順菩提法，",
        "translation": "Good men and good women should think thus: In the past, when the Tathāgata was living in the bodhisattva state, he always diligently cultivated enlightenment practices.",
        "source": "T07n0220_501:0554a12_21"
    },
    {
        "source_sentence": "所謂般若乃至布施波羅蜜多，如是乃至一切智、道相智、一切相智，及餘無量無邊佛法，",
        "translation": "It's called prajñā or even the perfection of generosity, thus up to omniscience, knowledge of the path, knowledge of all characteristics, and other measureless and limitless buddha-teachings.",
        "source": "T07n0220_501:0554a14_22"
    },
    {
        "source_sentence": "并餘隨順甚深般若波羅蜜多蘊、處、界等無量法門，由斯證得所求無上正等菩提。",
        "translation": "They also follow the other profound prajñāpāramitā dharmas, such as the aggregates, fields, and realms, and thus realize the unsurpassed perfect enlightenment that they seek.",
        "source": "T07n0220_501:0554a16_23"
    },
    {
        "source_sentence": "我等今者為求無上正等菩提，亦應隨學。",
        "translation": "Now, in order to pursue unsurpassed perfect enlightenment, we should also follow it.",
        "source": "T07n0220_501:0554a18_24"
    },
    {
        "source_sentence": "甚深般若波羅蜜多及餘隨順諸勝善法，定是我等真實大師，我隨彼學所願當滿；",
        "translation": "The profound prajñāpāramitā and the other supremely good qualities that follow it are definitely my true teacher. I will fulfill what I wish to learn from them.",
        "source": "T07n0220_501:0554a19_25"
    },
    {
        "source_sentence": "定是諸佛真實法印，一切如來、應、正等覺隨彼學故，證得無上正等菩提；",
        "translation": "They are definitely the true mudrās of the Teaching of all buddhas. All buddhas, enlightening beings, and fully awakened ones, having studied them, attain unexcelled perfect enlightenment.",
        "source": "T07n0220_501:0554a20_26"
    },
    {
        "source_sentence": "亦是一切聲聞、獨覺真實法印，皆隨彼學得至涅槃究竟彼岸。』",
        "translation": "It's also the true dharma mudrā of all śrāvakas and pratyekbuddhas, who follow their training to attain nirvāṇa and ultimately reach the other side.'",
        "source": "T07n0220_501:0554a22_27"
    },
    {
        "source_sentence": "「是故，憍尸迦！",
        "translation": "Therefore, Kauśika!",
        "source": "T07n0220_501:0554a24_0"
    },
    {
        "source_sentence": "諸善男子、善女人等若佛住世若涅槃後，應依般若波羅蜜多，廣說乃至一切相智，",
        "translation": "Good men and good women, if the Buddha lives in the world or after nirvāṇa, they should rely on the prajñāpāramitā to explain it in detail up to the knowledge of all characteristics.",
        "source": "T07n0220_501:0554a24_1"
    },
    {
        "source_sentence": "及餘無量無邊佛法，蘊、界、處等無量法門，常勤修學。",
        "translation": "They always diligently cultivate the other immeasurable and limitless buddha-dharmas, such immeasurable dharma-gates as aggregates, realms, and fields.",
        "source": "T07n0220_501:0554a26_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_501:0554a27_3"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_501:0554a27_4"
    },
    {
        "source_sentence": "如是般若波羅蜜多，廣說乃至一切相智，及餘無量無邊佛法，蘊、界、處等無量法門，",
        "translation": "Thus, this prajñāpāramitā explains in detail the knowledge of all characteristics up to the knowledge of all characteristics, as well as other measureless and limitless buddha-teachings, such measureless teachings as aggregates",
        "source": "T07n0220_501:0554a27_5"
    },
    {
        "source_sentence": "是諸聲聞、緣覺、菩薩及餘天、人、阿素洛等利益安樂所依處故。」",
        "translation": "It's because it's the place where śrāvakas, pratyekbuddhas, bodhisattvas, other gods, humans, asuras, and so forth benefit and bring comfort to them.",
        "source": "T07n0220_501:0554a29_6"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 1",
        "source": "T07n0220_501:0554b02_0"
    }
]