[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 9",
        "source": "T07n0220_498:0532a18_0"
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T07n0220_498:0532a19_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_498:0532a21_0"
    },
    {
        "source_sentence": "第三分善現品第三之十七",
        "translation": "The Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part, the Third Part.",
        "source": "T07n0220_498:0532a22_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_498:0532a23_0"
    },
    {
        "source_sentence": "若時菩薩摩訶薩行深般若波羅蜜多如實觀察一切法相，是時菩薩摩訶薩見我乃至見者無生，",
        "translation": "If the bodhisattva Mahāsattva then practices the profound prajñāpāramitā and truly observes all the characteristics of dharmas, then the bodhisattva Mahāsattva sees self and even those who see it as",
        "source": "T07n0220_498:0532a23_1"
    },
    {
        "source_sentence": "畢竟淨故；",
        "translation": "Because they are ultimately pure.",
        "source": "T07n0220_498:0532a25_2"
    },
    {
        "source_sentence": "見色乃至識無生，畢竟淨故；",
        "translation": "They see form up to consciousness as nonarising, because it is ultimately pure.",
        "source": "T07n0220_498:0532a26_3"
    },
    {
        "source_sentence": "見眼處乃至意處無生，畢竟淨故；",
        "translation": "The sphere of vision and up to the sphere of manas are without being produced: because they are absolutely pure.",
        "source": "T07n0220_498:0532a26_4"
    },
    {
        "source_sentence": "見色處乃至法處無生，畢竟淨故；",
        "translation": "They see the sphere of form up to the sphere of factors as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532a27_5"
    },
    {
        "source_sentence": "見眼界乃至意界無生，畢竟淨故；",
        "translation": "They see the element eye and up to the element mind as uncreated, because they are ultimately pure.",
        "source": "T07n0220_498:0532a28_6"
    },
    {
        "source_sentence": "見色界乃至法界無生，畢竟淨故；",
        "translation": "They see the realm of form up to the realm of reality as uncreated, because they are ultimately pure.",
        "source": "T07n0220_498:0532a29_7"
    },
    {
        "source_sentence": "見眼識界乃至意識界無生，畢竟淨故；",
        "translation": "They see that the element consciousness of the eye and so on up to the element consciousness of the mind are unborn, because they are ultimately pure.",
        "source": "T07n0220_498:0532a29_8"
    },
    {
        "source_sentence": "見眼觸乃至意觸無生，畢竟淨故；",
        "translation": "When seeing, contact of the eye and up to contact of the mind are without being produced: because they are absolutely pure.",
        "source": "T07n0220_498:0532b01_9"
    },
    {
        "source_sentence": "見眼觸為緣所生諸受乃至意觸為緣所生諸受無生，畢竟淨故；",
        "translation": "The feelings that arise from visual contact as supporting object and those that arise from mental contact as supporting object are not produced because they are ultimately pure.",
        "source": "T07n0220_498:0532b02_10"
    },
    {
        "source_sentence": "見地界乃至識界無生，畢竟淨故；",
        "translation": "They see the realm of earth up to the realm of consciousness as birthless because it is ultimately pure.",
        "source": "T07n0220_498:0532b03_11"
    },
    {
        "source_sentence": "見因緣乃至增上緣無生，畢竟淨故；",
        "translation": "They see the causes and conditions up to the supreme conditions as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b04_12"
    },
    {
        "source_sentence": "見無明乃至老死無生，畢竟淨故；",
        "translation": "They see nescience up to the nonorigination of old age and death, because they are ultimately pure.",
        "source": "T07n0220_498:0532b05_13"
    },
    {
        "source_sentence": "見布施波羅蜜多乃至般若波羅蜜多無生，畢竟淨故；",
        "translation": "Seeing the perfection of giving and even the perfection of wisdom are unborn, because they are ultimately pure.",
        "source": "T07n0220_498:0532b06_14"
    },
    {
        "source_sentence": "見內空乃至無性自性空無生，畢竟淨故；",
        "translation": "They see internal emptiness and so on up to the emptiness of the natureless self-nature as nonorigination, because it is ultimately pure.",
        "source": "T07n0220_498:0532b07_15"
    },
    {
        "source_sentence": "見真如乃至不思議界無生，畢竟淨故；",
        "translation": "They see the realm of reality up to the inconceivable as nonarising, because it is ultimately pure.",
        "source": "T07n0220_498:0532b08_16"
    },
    {
        "source_sentence": "見斷界乃至無為界無生，畢竟淨故；",
        "translation": "They see the realm of annihilation up to the unconditioned realm as nonarising, because it is ultimately pure.",
        "source": "T07n0220_498:0532b09_17"
    },
    {
        "source_sentence": "見苦、集、滅、道聖諦無生，畢竟淨故；",
        "translation": "They see the noble truths of suffering, origination, cessation, and the path as birthless because they are ultimately pure.",
        "source": "T07n0220_498:0532b10_18"
    },
    {
        "source_sentence": "見四念住乃至八聖道支無生，畢竟淨故；",
        "translation": "They see the four abodes of mindfulness and so on, up to the eightfold noble path as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b10_19"
    },
    {
        "source_sentence": "見四靜慮、四無量、四無色定無生，畢竟淨故；",
        "translation": "They see that the four meditations, the four immeasurable concentrations and the four formless concentrations are without arising because they are ultimately pure.",
        "source": "T07n0220_498:0532b11_20"
    },
    {
        "source_sentence": "見八解脫、九次第定無生，畢竟淨故；",
        "translation": "They see the eight liberations and the nine graduated concentrations as unarisen, because they are ultimately pure.",
        "source": "T07n0220_498:0532b12_21"
    },
    {
        "source_sentence": "見空、無相、無願解脫門無生，畢竟淨故；",
        "translation": "The liberation gate of seeing emptiness, signlessness, and wishlessness is birthless because it is ultimately pure.",
        "source": "T07n0220_498:0532b13_22"
    },
    {
        "source_sentence": "見淨觀地乃至如來地無生，畢竟淨故；",
        "translation": "The stage of contemplation on the vision of purity, up to the stage of enlightenment, is without birth, because it is ultimately pure.",
        "source": "T07n0220_498:0532b14_23"
    },
    {
        "source_sentence": "見極喜地乃至法雲地無生，畢竟淨故；",
        "translation": "They see the state of ultimate bliss as birthless, up to the state of Cloud of Teaching, because they are ultimately pure.",
        "source": "T07n0220_498:0532b15_24"
    },
    {
        "source_sentence": "見五眼、六神通無生，畢竟淨故；",
        "translation": "They see that the five eyes and six supernormal powers are unborn, because they are ultimately pure.",
        "source": "T07n0220_498:0532b16_25"
    },
    {
        "source_sentence": "見如來十力乃至十八佛不共法無生，畢竟淨故；",
        "translation": "They see the nonorigination of the ten powers of buddhas, up to the unique qualities of the eighteen buddhas, because they are ultimately pure.",
        "source": "T07n0220_498:0532b16_26"
    },
    {
        "source_sentence": "見無忘失法、恒住捨性無生，畢竟淨故；",
        "translation": "They see the state of nonforgetfulness and the nature of eternally abiding equanimity as nonarising, because it is ultimately pure.",
        "source": "T07n0220_498:0532b18_0"
    },
    {
        "source_sentence": "見一切陀羅尼門、三摩地門無生，畢竟淨故；",
        "translation": "They see all aspects of mental command and all aspects of concentration as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b18_1"
    },
    {
        "source_sentence": "見一切智、道相智、一切相智無生，畢竟淨故；",
        "translation": "They see omniscience, knowledge of the path, and knowledge of all characteristics as nonarising because they are ultimately pure.",
        "source": "T07n0220_498:0532b19_2"
    },
    {
        "source_sentence": "見異生及異生法無生，畢竟淨故；",
        "translation": "They see worldlings and dharmas of worldlings as birthless, because they are ultimately pure.",
        "source": "T07n0220_498:0532b20_3"
    },
    {
        "source_sentence": "見預流及預流法無生，畢竟淨故；",
        "translation": "They see the state of stream-entry and the state of stream-entry as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b21_4"
    },
    {
        "source_sentence": "見一來及一來法無生，畢竟淨故；",
        "translation": "They see the one coming and the dharmas of the one coming as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b22_5"
    },
    {
        "source_sentence": "見不還及不還法無生，畢竟淨故；",
        "translation": "They see nonreturning and the factors of nonreturning as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b23_6"
    },
    {
        "source_sentence": "見阿羅漢及阿羅漢法無生，畢竟淨故；",
        "translation": "They see arhats and the factors of arhatship as uncreated, because they are ultimately pure.",
        "source": "T07n0220_498:0532b23_7"
    },
    {
        "source_sentence": "見獨覺及獨覺法無生，畢竟淨故；",
        "translation": "They see self-enlightened ones and the factors of self-enlightenment as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b24_8"
    },
    {
        "source_sentence": "見菩薩摩訶薩及菩薩摩訶薩法無生，畢竟淨故；",
        "translation": "They see great enlightening beings and the principles of great enlightening beings as nonarising, because they are ultimately pure.",
        "source": "T07n0220_498:0532b25_9"
    },
    {
        "source_sentence": "見諸如來、應、正等覺及諸如來、應、正等覺法無生，畢竟淨故。」",
        "translation": "Seeing the Tathāgatas, Arhats, Perfectly Enlightened Ones, and the teachings of the Tathāgatas, Arhats, Perfectly Enlightened Ones are unarisen because they are ultimately pure.",
        "source": "T07n0220_498:0532b26_10"
    },
    {
        "source_sentence": "時，舍利子謂善現言：「如我領解仁所說義，我、有情等畢竟不生，色乃至識畢竟不生，",
        "translation": "Śāriputra then said to Sudarśana: As I understand what you have explained, self, sentient beings, etc., are ultimately unarisen; form and even consciousness are ultimately unarisen.",
        "source": "T07n0220_498:0532b28_0"
    },
    {
        "source_sentence": "乃至如來、應、正等覺及如來法畢竟不生。",
        "translation": "It goes so far as to say that the Tathāgata, Arhat, Perfectly Enlightened One, and the Tathāgata's teachings are ultimately unarisen.",
        "source": "T07n0220_498:0532b29_1"
    },
    {
        "source_sentence": "若如是者，諸異生類六趣受生應無差別，不應預流得預流果，不應一來得一來果，",
        "translation": "If this were so, there would be no difference between ordinary beings who are born in one of the six destinies and those who are born in another. They would not attain the fruit of stream-winner if they proceeded onward; they would not attain",
        "source": "T07n0220_498:0532c01_2"
    },
    {
        "source_sentence": "不應不還得不還果，不應阿羅漢得阿羅漢果，不應獨覺得獨覺菩提，不應菩薩摩訶薩為得一切相智，",
        "translation": "They should not attain the fruit of nonreturning and not attain the fruit of nonreturning; they should not be arhats who attain the fruit of arhatship; they should not individually experience enlightenment as a self-enlightened",
        "source": "T07n0220_498:0532c03_3"
    },
    {
        "source_sentence": "精勤修學漸次證得五種菩提。",
        "translation": "He diligently cultivates and gradually realizes five kinds of enlightenment in order.",
        "source": "T07n0220_498:0532c06_0"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_498:0532c06_1"
    },
    {
        "source_sentence": "若一切法畢竟不生，云何預流為預流果，勤修永斷三結真道？",
        "translation": "If all dharmas ultimately don't arise, then how can stream-winner be the fruit of stream-winner and diligently cultivate the true path that permanently ends the three bonds?",
        "source": "T07n0220_498:0532c06_2"
    },
    {
        "source_sentence": "云何一來為一來果，勤修永斷貪、恚、癡道？",
        "translation": "What is the fruit of a single coming that diligently cultivates and permanently eliminates the paths of greed, anger, and delusion?",
        "source": "T07n0220_498:0532c08_3"
    },
    {
        "source_sentence": "云何不還為不還果，勤修永斷順下結道，建立五種分位差別？",
        "translation": "How does nonreturning become the fruit of nonreturning, diligently cultivating and permanently eliminating the paths that follow lower bonds, establishing five kinds of distinctions in status?",
        "source": "T07n0220_498:0532c09_4"
    },
    {
        "source_sentence": "云何阿羅漢為阿羅漢果，勤修永斷順上結道？",
        "translation": "How does an arhat become an arhat and diligently cultivate the path that permanently ends the higher bonds?",
        "source": "T07n0220_498:0532c10_5"
    },
    {
        "source_sentence": "云何獨覺為獨覺菩提，勤修獨悟緣起法道？",
        "translation": "How does the solitary realizer become the enlightenment of the solitary realizer and diligently cultivate the solitary realizer's path of dependently-arisen dharmas?",
        "source": "T07n0220_498:0532c11_6"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為度無量無數有情，修多百千難行苦行，備受無量難忍大苦？",
        "translation": "How does the bodhisattva Mahāsattva cultivate hundreds of thousands of difficult and painful practices in order to save measureless and countless sentient beings and prepare them for the immeasurable and intolerable great suffering?",
        "source": "T07n0220_498:0532c12_7"
    },
    {
        "source_sentence": "云何如來、應、正等覺證得無上正等菩提轉妙法輪度有情類？」",
        "translation": "How did the Tathāgata, Arhat, and Completely Awakened One realize unsurpassed perfect enlightenment and turn the wonderful Dharma wheel to save sentient beings?",
        "source": "T07n0220_498:0532c14_8"
    },
    {
        "source_sentence": "善現報言：「舍利子！",
        "translation": "Sunetra replied, Śāriputra!",
        "source": "T07n0220_498:0532c16_0"
    },
    {
        "source_sentence": "非我於彼無生法中，許有異生乘煩惱業往來六趣受生差別，非我於彼無生法中，",
        "translation": "In the dharmas of nonarising, I do not admit that there is an ordinary individual who rides in the [realm of] afflictions (i.e., a self), karma (karma), and rebirth (parinirvāṇa",
        "source": "T07n0220_498:0532c16_1"
    },
    {
        "source_sentence": "許有能入諦現觀者，非我於彼無生法中，許有預流得預流果乃至有獨覺得獨覺菩提，",
        "translation": "Those who admit that they can enter into the comprehension of truths do not admit that self exists in those states of nonorigination. They admit that there are stream-winners who attain the fruit of stream-winnership and so on, up to",
        "source": "T07n0220_498:0532c18_2"
    },
    {
        "source_sentence": "非我於彼無生法中，許有菩薩摩訶薩為得一切相智，精勤修學漸次證得五種菩提，",
        "translation": "I do not admit that there are bodhisattva mahāsattvas who diligently practice and gradually realize the five kinds of enlightenment in order to attain omniscience.",
        "source": "T07n0220_498:0532c20_3"
    },
    {
        "source_sentence": "非我於彼無生法中，許有預流為預流果，勤修永斷三結真道，乃至有獨覺為獨覺菩提，",
        "translation": "It is not the case that I allow stream-entry to be the fruit of stream-entry in those unproduced dharmas, diligently cultivate the true path of ending the three fetters forever, and so on, up to become a pratyekabud",
        "source": "T07n0220_498:0532c22_4"
    },
    {
        "source_sentence": "勤修獨悟緣起法道，非我於彼無生法中，許有菩薩摩訶薩為度無量無數有情，",
        "translation": "I am not the one who allows a bodhisattva-mahāsattva to save infinite sentient beings in those states of nonarising.",
        "source": "T07n0220_498:0532c24_0"
    },
    {
        "source_sentence": "修多百千難行苦行，備受無量難忍大苦。",
        "translation": "He cultivates many hundreds of thousands of difficult and painful practices, and he's prepared to experience measureless and great suffering that's difficult to endure.",
        "source": "T07n0220_498:0532c25_1"
    },
    {
        "source_sentence": "「然諸菩薩摩訶薩雖為有情修無量種難行苦行，而於其中無苦行想。",
        "translation": "Still, although bodhisattvas and mahāsattvas cultivate measureless kinds of difficult ascetic practice for sentient beings, there's no conception of ascetic practice in them.",
        "source": "T07n0220_498:0532c26_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0532c28_3"
    },
    {
        "source_sentence": "若於苦行住苦行想，終不能為無量無數無邊有情作大饒益。",
        "translation": "If they contemplate painful actions and abide in painful actions, they'll never be able to create great benefits for measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_498:0532c28_4"
    },
    {
        "source_sentence": "一切菩薩摩訶薩眾以無所得而為方便，於諸有情住如父母、兄弟、妻子及己身想，",
        "translation": "“All the great enlightening beings, because they think of all sentient beings as parents, brothers, spouses, children, and self, use ungraspable liberation as their skillful means.",
        "source": "T07n0220_498:0533a01_0"
    },
    {
        "source_sentence": "為度彼故發起無上正等覺心，乃能為彼無量無數無邊有情作大饒益。",
        "translation": "In order to save them, they give rise to the mind of unsurpassed perfect enlightenment and are able to create great benefits for measureless, countless, and limitless sentient beings.",
        "source": "T07n0220_498:0533a02_1"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0533a04_2"
    },
    {
        "source_sentence": "諸菩薩摩訶薩應作是念：『如我自性，於一切法以一切種、一切處時求不可得，",
        "translation": "“Great enlightening beings should think, ‘Just as the self-nature of self is ungraspable in all things by means of all kinds and all places,",
        "source": "T07n0220_498:0533a04_3"
    },
    {
        "source_sentence": "內外諸法亦復如是，都無所有皆不可得。』",
        "translation": "So it is with internal and external dharmas, which all lack existence and are unobtainable.'",
        "source": "T07n0220_498:0533a06_4"
    },
    {
        "source_sentence": "若住此想便不見有難行苦行，由此能為無量無數無邊有情修多百千難行苦行作大饒益。",
        "translation": "If someone abides in this perception, they won't see difficult and painful actions that are difficult to practice, which will greatly benefit them by cultivating hundreds of thousands of difficult and painful actions for measureless, countless, and limitless sentient being",
        "source": "T07n0220_498:0533a07_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533a09_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩於一切法、一切有情以一切種、一切處時求不可得故，於其中無所執著。",
        "translation": "This is because the bodhisattva Mahāsattva doesn't cling to all things and all sentient beings because they are unobtainable in all kinds and all places at the time.",
        "source": "T07n0220_498:0533a09_7"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0533a11_8"
    },
    {
        "source_sentence": "非我於彼無生法中，許有如來、應、正等覺證得無上正等菩提，轉妙法輪度有情類。",
        "translation": "It's not that I allow the Tathāgata, Arhat, and Completely Awakened One to realize unsurpassed perfect enlightenment and turn the wonderful Dharma wheel to save sentient beings in those unborn dharmas.",
        "source": "T07n0220_498:0533a11_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533a13_10"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0533a13_11"
    },
    {
        "source_sentence": "以一切法、一切有情都無所有不可得故，無證、無度及證、度者。」",
        "translation": "Because all things and all sentient beings lack existence and cannot be obtained, there's no realization, no liberation, and no one who realizes or liberates them.",
        "source": "T07n0220_498:0533a14_12"
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「於意云何？",
        "translation": "It was then that Śāriputra asked the long-lived good manifestation, What do you think?",
        "source": "T07n0220_498:0533a16_0"
    },
    {
        "source_sentence": "為許生法證生法，為許無生法證無生法耶？」",
        "translation": "Is it to allow the Dharma that arises to realize the Dharma that arises, or is it to allow the Dharma that doesn't arise to realize the Dharma that doesn't arise?",
        "source": "T07n0220_498:0533a16_1"
    },
    {
        "source_sentence": "善現答言：「我不許生法證生法，亦不許無生法證無生法。」",
        "translation": "Sunetra answered, I won't allow the Dharma that arises to realize the Dharma that arises, and I won't allow the Dharma that doesn't arise to realize the Dharma that doesn't arise.",
        "source": "T07n0220_498:0533a17_2"
    },
    {
        "source_sentence": "時，舍利子復問具壽善現言：「於意云何？",
        "translation": "Śāriputra then again asked the long-lived good manifestation, What do you think?",
        "source": "T07n0220_498:0533a19_3"
    },
    {
        "source_sentence": "為許生法證無生法，為許無生法證生法耶？」",
        "translation": "Is it because you allow the Dharma of arising to realize the Dharma of nonarising and the Dharma of nonarising to realize the Dharma of arising?",
        "source": "T07n0220_498:0533a20_4"
    },
    {
        "source_sentence": "善現答言：「我亦不許生法證無生法，亦復不許無生法證生法。」",
        "translation": "Sunetra replied, I won't allow the arising dharma to realize the nonarising dharma, and I won't allow the nonarising dharma to realize the arising dharma.",
        "source": "T07n0220_498:0533a21_5"
    },
    {
        "source_sentence": "舍利子言：「若如是者，豈都無得、無現觀耶？」",
        "translation": "Śāriputra said, If that's the case, wouldn't there be no attainment and no present contemplation?",
        "source": "T07n0220_498:0533a22_6"
    },
    {
        "source_sentence": "善現答言：「雖有得、有現觀，然不由此二法而證。",
        "translation": "Sunetra replied, Although there are attainments and present contemplations, they aren't realized by these two things.",
        "source": "T07n0220_498:0533a23_7"
    },
    {
        "source_sentence": "但隨世間言說施設有得、現觀，非勝義中有得、現觀。",
        "translation": "However, it follows the worldly explanation that there's acquisition and contemplation in terms of what's defined, but there's no acquisition and contemplation in the ultimate truth.",
        "source": "T07n0220_498:0533a24_8"
    },
    {
        "source_sentence": "但隨世間言說施設有預流、預流果，廣說乃至有諸如來、應、正等覺，",
        "translation": "But according to worldly language, there is a stream-entry and a fruit of stream-entry. It is said in detail that there are tathāgatas, arhats, and fully enlightened ones.",
        "source": "T07n0220_498:0533a25_9"
    },
    {
        "source_sentence": "有佛無上正等菩提，非勝義中有如是事。」",
        "translation": "There's a Buddha who has unsurpassed perfect enlightenment, not something like this in the ultimate truth.",
        "source": "T07n0220_498:0533a27_10"
    },
    {
        "source_sentence": "舍利子言：「若隨世間言說施設有得、現觀及預流等，非勝義中有此事者，",
        "translation": "Śāriputra said, If someone follows worldly language and defines the existence of attainment, present contemplation, pre-flow, and so forth, it's not the ultimate truth that there's such a thing.",
        "source": "T07n0220_498:0533a28_11"
    },
    {
        "source_sentence": "六趣差別亦隨世間言說施設，非勝義耶？」",
        "translation": "Isn't it the ultimate meaning that the distinctions in the six destinies are also defined according to worldly language?",
        "source": "T07n0220_498:0533a29_12"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_498:0533b01_13"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_498:0533b02_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b02_15"
    },
    {
        "source_sentence": "非勝義中有諸煩惱業果異熟若生、若滅染淨法故。」",
        "translation": "It's not the ultimate truth that there are afflictions, actions, results, and retributions that arise or cease defiled and pure dharmas.",
        "source": "T07n0220_498:0533b02_16"
    },
    {
        "source_sentence": "爾時，舍利子復問具壽善現言：「於意云何？",
        "translation": "At that point, Śāriputra again asked the long-lived good manifestation, What do you think?",
        "source": "T07n0220_498:0533b03_17"
    },
    {
        "source_sentence": "為許未生法生，為許已生法生耶？」",
        "translation": "Does it allow the arising of things that have yet to arise and the arising of things that have already arisen?",
        "source": "T07n0220_498:0533b04_18"
    },
    {
        "source_sentence": "善現答言：「我不許未生法生，亦不許已生法生。」",
        "translation": "Sunetra replied, I don't approve of the arising of things that have yet to arise, and I don't approve of the arising of things that have already arisen.",
        "source": "T07n0220_498:0533b05_19"
    },
    {
        "source_sentence": "舍利子言：「何等是未生法而不許彼生？」",
        "translation": "Śāriputra said, What's a thing that has yet to arise that doesn't allow it to arise?",
        "source": "T07n0220_498:0533b06_20"
    },
    {
        "source_sentence": "善現答言：「色乃至識是未生法，我不許彼生。",
        "translation": "Sunetra replied, Form and even consciousness are things that haven't yet arisen, and I won't allow them to arise.",
        "source": "T07n0220_498:0533b07_21"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b08_22"
    },
    {
        "source_sentence": "自性空故。",
        "translation": "It's because the self-nature is empty.",
        "source": "T07n0220_498:0533b08_23"
    },
    {
        "source_sentence": "如是乃至諸佛無上正等菩提是未生法，我不許彼生。",
        "translation": "Thus, up to the unsurpassed correct perfect enlightenment of the buddhas is a teaching that has yet to arise, and I won't allow it to arise.",
        "source": "T07n0220_498:0533b08_24"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b10_0"
    },
    {
        "source_sentence": "自性空故。」",
        "translation": "It's because the self-nature is empty.",
        "source": "T07n0220_498:0533b10_1"
    },
    {
        "source_sentence": "舍利子言：「何等是已生法而不許彼生？」",
        "translation": "Śāriputra said, What's a thing that has already arisen but doesn't allow it to arise?",
        "source": "T07n0220_498:0533b10_2"
    },
    {
        "source_sentence": "善現答言：「色乃至識是已生法，我不許彼生。",
        "translation": "Sunetra replied, Form and even consciousness are things that have already arisen, but I don't allow them to arise.",
        "source": "T07n0220_498:0533b11_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b12_4"
    },
    {
        "source_sentence": "自性空故。",
        "translation": "It's because the self-nature is empty.",
        "source": "T07n0220_498:0533b12_5"
    },
    {
        "source_sentence": "如是乃至諸佛無上正等菩提是已生法，我不許彼生。",
        "translation": "Thus, up to the unsurpassed correct perfect enlightenment of the buddhas is a dharma that has already arisen, and I won't allow it to arise.",
        "source": "T07n0220_498:0533b12_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b14_7"
    },
    {
        "source_sentence": "自性空故。」",
        "translation": "It's because the self-nature is empty.",
        "source": "T07n0220_498:0533b14_8"
    },
    {
        "source_sentence": "爾時，舍利子復問具壽善現言：「於意云何？",
        "translation": "At that point, Śāriputra again asked the long-lived good manifestation, What do you think?",
        "source": "T07n0220_498:0533b14_9"
    },
    {
        "source_sentence": "為許生生，為許不生生耶？」",
        "translation": "Does it allow birth to arise, or does it allow non-birth to arise?",
        "source": "T07n0220_498:0533b15_10"
    },
    {
        "source_sentence": "善現答言：「我不許生生，亦不許不生生。",
        "translation": "Sunetra replied, I won't allow birth to arise, and I won't allow non-birth to arise.",
        "source": "T07n0220_498:0533b16_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b17_0"
    },
    {
        "source_sentence": "生與不生，如是二法非合、非散、無色、無見、無對、一相，所謂無相。",
        "translation": "Thus, these two things are not combined, not dispersed, formless, without views, without opposites, and with one characteristic, which is called formless.",
        "source": "T07n0220_498:0533b17_1"
    },
    {
        "source_sentence": "由如是義，我不許生生，亦不許不生生。」",
        "translation": "Because of this meaning, I won't allow birth to arise, and I won't allow non-birth to arise.",
        "source": "T07n0220_498:0533b18_2"
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「仁者！",
        "translation": "It was then that Śāriputra asked the good manifestation of Kauśinagara, saying, Sir!",
        "source": "T07n0220_498:0533b19_3"
    },
    {
        "source_sentence": "於所說無生法樂辯說無生相耶？」",
        "translation": "Does he explain the characteristic of nonproduction in terms of the eloquence of the Dharma happiness that's explained as nonproduction?",
        "source": "T07n0220_498:0533b20_4"
    },
    {
        "source_sentence": "善現答言：「我於所說無生法亦不樂辯說無生相。",
        "translation": "Sunetra replied, I don't like to explain the characteristic of nonproduction in terms of what's taught about the dharmas that are unarisen.",
        "source": "T07n0220_498:0533b21_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b22_6"
    },
    {
        "source_sentence": "若無生法，若無生相，若樂若辯說，如是一切皆非合、非散、無色、無見、無對、一相，",
        "translation": "If there are non-arising dharmas, if there are non-arising characteristics, or if there are pleasures and explanations in eloquence, all of these things are not combined, not dispersed, formless, formless,",
        "source": "T07n0220_498:0533b22_7"
    },
    {
        "source_sentence": "所謂無相，不可辯說。」",
        "translation": "The so-called marklessness can't be explained eloquently.",
        "source": "T07n0220_498:0533b24_8"
    },
    {
        "source_sentence": "時，舍利子問善現言：「於無生法起無生言，此無生言亦無生不？」",
        "translation": "Śāriputra then asked the good manifestation, In the dharmas that are unarisen, he gives rise to the words that are unarisen, and does this statement of being unarisen also have no arising?",
        "source": "T07n0220_498:0533b24_9"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_498:0533b26_10"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_498:0533b26_11"
    },
    {
        "source_sentence": "於無生法起無生言，此法及言俱無生義。",
        "translation": "The word nonorigination is given rise to in relation to the dharma of nonorigination. This dharma and that expression both have the meaning of nonorigination.",
        "source": "T07n0220_498:0533b26_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533b27_13"
    },
    {
        "source_sentence": "色乃至識一切無生。",
        "translation": "All form and even consciousness are unarisen.",
        "source": "T07n0220_498:0533b27_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533b28_15"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533b28_16"
    },
    {
        "source_sentence": "眼處乃至意處一切無生。",
        "translation": "The sense-field of the eye and even the sense-field of the mind are all unarisen.",
        "source": "T07n0220_498:0533b28_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533b29_18"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533b29_19"
    },
    {
        "source_sentence": "色處乃至法處一切無生。",
        "translation": "The form realm and even the Dharma realm are all unarisen.",
        "source": "T07n0220_498:0533b29_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c01_21"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c01_22"
    },
    {
        "source_sentence": "眼界乃至意界一切無生。",
        "translation": "The eye realm and even the mind realm are all unarisen.",
        "source": "T07n0220_498:0533c01_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c02_24"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c02_25"
    },
    {
        "source_sentence": "色界乃至法界一切無生。",
        "translation": "The form realm and even the Dharma realm are all unarisen.",
        "source": "T07n0220_498:0533c02_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c03_27"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c03_28"
    },
    {
        "source_sentence": "眼識界乃至意識界一切無生。",
        "translation": "The eye consciousness realm and even the consciousness realm are all unarisen.",
        "source": "T07n0220_498:0533c03_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c04_30"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c04_31"
    },
    {
        "source_sentence": "眼觸乃至意觸一切無生。",
        "translation": "All visual contact and even mental contact are unarisen.",
        "source": "T07n0220_498:0533c04_32"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c05_33"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c05_34"
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受一切無生。",
        "translation": "All the sensations that arise from visual contact as a condition and those that arise from mental contact as a condition are unarisen.",
        "source": "T07n0220_498:0533c05_35"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c07_36"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c07_37"
    },
    {
        "source_sentence": "地界乃至識界一切無生。",
        "translation": "The earth realm and even the consciousness realm are all unarisen.",
        "source": "T07n0220_498:0533c07_38"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c08_39"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c08_40"
    },
    {
        "source_sentence": "因緣乃至增上緣一切無生。",
        "translation": "All causes and conditions up to the supreme condition are unarisen.",
        "source": "T07n0220_498:0533c08_41"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c09_42"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c09_43"
    },
    {
        "source_sentence": "無明乃至老死一切無生。",
        "translation": "nescience... and even old age and death are all nonarising.",
        "source": "T07n0220_498:0533c09_44"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c10_45"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c10_46"
    },
    {
        "source_sentence": "身、語、意行一切無生。",
        "translation": "All bodily, verbal, and mental actions are unarisen.",
        "source": "T07n0220_498:0533c10_47"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c11_48"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c11_49"
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多一切無生。",
        "translation": "The perfection of generosity and even the perfection of wisdom are all unarisen.",
        "source": "T07n0220_498:0533c11_50"
    },
    {
        "source_sentence": "何以故，本性空故。",
        "translation": "Why is it so? Because its original nature is empty.",
        "source": "T07n0220_498:0533c12_51"
    },
    {
        "source_sentence": "如是乃至一切智、道相智、一切相智一切無生。",
        "translation": "Thus, it goes so far as to say that omniscience, knowledge of the path, and knowledge of all characteristics are all unarisen.",
        "source": "T07n0220_498:0533c13_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0533c14_1"
    },
    {
        "source_sentence": "本性空故。",
        "translation": "It's because the original nature is empty.",
        "source": "T07n0220_498:0533c14_2"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0533c14_3"
    },
    {
        "source_sentence": "由如是義，於無生法起無生言，此法及言俱無生義。",
        "translation": "Because of this meaning, the word nonorigination is spoken of in relation to factors that are not arisen. These factors and words together have the meaning of nonorigination.",
        "source": "T07n0220_498:0533c14_4"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0533c15_5"
    },
    {
        "source_sentence": "若所說法、若能說言、說者、聽者皆無生義。",
        "translation": "If he teaches the Dharma, if he can explain it, the speaker and the listener are all without the meaning of arising.",
        "source": "T07n0220_498:0533c16_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c17_0"
    },
    {
        "source_sentence": "以一切法本性皆空，空中都無能所生義。」",
        "translation": "It's because the original nature of all dharmas is empty, and there's no meaning for what can or can't arise in space.",
        "source": "T07n0220_498:0533c17_1"
    },
    {
        "source_sentence": "時，舍利子讚善現言：「說法人中仁為第一，除佛世尊無能及者。",
        "translation": "Śāriputra then praised the good manifestation, saying, Among the people who teach the Dharma, the most benevolent is the best, except for the Bhagavān.",
        "source": "T07n0220_498:0533c18_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c19_3"
    },
    {
        "source_sentence": "隨所問詰種種法門皆能酬答無所滯礙。」",
        "translation": "According to the various teachings that are asked and questioned, they can answer without any obstruction.",
        "source": "T07n0220_498:0533c19_4"
    },
    {
        "source_sentence": "善現報言：「諸佛弟子於一切法無依著者，法爾皆能隨所問詰一一酬答自在無畏。",
        "translation": "Sunetra replied, The disciples of the buddhas who don't rely on all dharmas are able to follow the questions and answer them one by one with freedom and fearlessness according to the teachings.",
        "source": "T07n0220_498:0533c20_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0533c22_6"
    },
    {
        "source_sentence": "以一切法無所依故。」",
        "translation": "It's because all dharmas lack a basis.",
        "source": "T07n0220_498:0533c22_7"
    },
    {
        "source_sentence": "時，舍利子問善現言：「云何諸法都無所依？」",
        "translation": "Śāriputra then asked the good manifestation, How are all dharmas without a basis?",
        "source": "T07n0220_498:0533c23_8"
    },
    {
        "source_sentence": "善現答言：「色乃至識本性空故，不依內不依外不依兩間，如是乃至一切智、道相智、一切相智本性空故，",
        "translation": "Sunetra replied, It's because the original nature of form... even consciousness is empty, and it doesn't rely on inside or outside or between; so it's because the original nature of omniscience, knowledge of the path, and knowledge of all",
        "source": "T07n0220_498:0533c24_9"
    },
    {
        "source_sentence": "不依內不依外不依兩間。",
        "translation": "They don't rely on the internal, don't rely on the external, and don't rely on the two.",
        "source": "T07n0220_498:0533c26_10"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0533c27_11"
    },
    {
        "source_sentence": "由如是義，我說諸法都無所依。",
        "translation": "Because of this meaning, I say that all dharmas have no basis.",
        "source": "T07n0220_498:0533c27_12"
    },
    {
        "source_sentence": "「如是，舍利子！",
        "translation": "“So it is, Sāriputta!",
        "source": "T07n0220_498:0533c28_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行六種波羅蜜多時，應淨色，應淨受、想、行、識，如是乃至應淨一切智，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the six kinds of perfections, they should purify form, feeling, perception, volition, and consciousness, and so forth, up to purify all cognition.",
        "source": "T07n0220_498:0533c28_1"
    },
    {
        "source_sentence": "應淨道相智、一切相智，如是亦應淨菩提道。」",
        "translation": "You should purify the knowledge of the path's characteristics and the knowledge of all characteristics, and so you should purify the path to enlightenment.",
        "source": "T07n0220_498:0534a01_2"
    },
    {
        "source_sentence": "時，舍利子問善現言：「云何菩薩摩訶薩修行六種波羅蜜多時淨菩提道？」",
        "translation": "Śāriputra then asked the good manifestation, How does a bodhisattva-mahāsattva purify the path of enlightenment when he cultivates the six kinds of perfections?",
        "source": "T07n0220_498:0534a02_3"
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "Sunetra replied, Śāriputra!",
        "source": "T07n0220_498:0534a03_4"
    },
    {
        "source_sentence": "布施、淨戒、安忍、精進、靜慮、般若波羅蜜多各有二種，所謂世間及出世間。」",
        "translation": "There are two kinds of generosity, pure morality, patience, effort, meditation, and prajñāpāramitā, which are called mundane and transmundane.",
        "source": "T07n0220_498:0534a04_5"
    },
    {
        "source_sentence": "舍利子言：「云何世間布施波羅蜜多？",
        "translation": "Śāriputra said, What is the worldly perfection of generosity?",
        "source": "T07n0220_498:0534a06_0"
    },
    {
        "source_sentence": "云何出世間布施波羅蜜多？」",
        "translation": "What is the supramundane perfection of generosity?",
        "source": "T07n0220_498:0534a06_1"
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "Sunetra replied, Śāriputra!",
        "source": "T07n0220_498:0534a07_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩為大施主，能施一切沙門、婆羅門、貧病、孤露、道行、乞者衣服、飲食及餘資具。",
        "translation": "Suppose a bodhisattva-mahāsattva becomes a great donor who can give all the ascetics, priests, poor and sick, orphaned and solitary, religious practitioners, beggars' clothing, food and drink",
        "source": "T07n0220_498:0534a07_3"
    },
    {
        "source_sentence": "若復有來乞男與男，乞女與女，乞妻妾與妻妾，乞官位與官位，乞國土與國土，",
        "translation": "Suppose another person comes along and begs for a man to give it to a man, a woman to give it to a woman, a concubine to give it to a concubine, an official position to give him an official position, or a land to give him",
        "source": "T07n0220_498:0534a09_4"
    },
    {
        "source_sentence": "乞王位與王位，乞頭與頭，乞目與目，乞手足與手足，乞支節與支節，",
        "translation": "He begs for the king’s throne to give him his throne, asks for a head to give a head, asks for eyes to give eyes, asks for hands and feet to give hands and feet, and asks for limbs to give",
        "source": "T07n0220_498:0534a11_5"
    },
    {
        "source_sentence": "乞血肉與血肉，乞皮骨與皮骨，乞僮僕與僮僕，乞生類與生類，如是一切隨其所求，",
        "translation": "They beg for blood and flesh to give blood and flesh, skin and bones to give skin and bones, boys and girls to give boys, raw materials to give raw materials, and so on, according to their wishes.",
        "source": "T07n0220_498:0534a13_6"
    },
    {
        "source_sentence": "內外之物悉皆施與。",
        "translation": "All internal and external things are given as gifts.",
        "source": "T07n0220_498:0534a15_7"
    },
    {
        "source_sentence": "雖作是施而有所依，謂作是念：『我施彼受，我為施主，我不慳貪，我隨佛教一切能捨，",
        "translation": "Even though they make this kind of donation, there is something to rely on. They think: I give it to those who receive; I am the donor; I am not stingy or greedy; I follow Buddhism and can relinquish everything.",
        "source": "T07n0220_498:0534a15_8"
    },
    {
        "source_sentence": "我行布施波羅蜜多。』",
        "translation": "I'll practice the perfection of generosity.'",
        "source": "T07n0220_498:0534a17_9"
    },
    {
        "source_sentence": "彼行施時，以有所得而為方便，與諸有情平等共有迴向無上正等菩提。",
        "translation": "When they practice generosity, they make it a method of attaining something and equally dedicate it to unsurpassed perfect enlightenment together with sentient beings.",
        "source": "T07n0220_498:0534a17_10"
    },
    {
        "source_sentence": "復作是念：『我持此福施諸有情，令得此世後世安樂，乃至證得無餘涅槃。』",
        "translation": "Again, he thinks, 'With this merit, I'll give it to sentient beings so that they attain peace and happiness in this life and the afterlife until they realize nirvāṇa without remainder.'",
        "source": "T07n0220_498:0534a19_11"
    },
    {
        "source_sentence": "彼著三輪而行布施：一者、自想。",
        "translation": "They put on three wheels and practice generosity: one, self-conception.",
        "source": "T07n0220_498:0534a21_12"
    },
    {
        "source_sentence": "二者、他想。",
        "translation": "The second is the perception of others.",
        "source": "T07n0220_498:0534a21_13"
    },
    {
        "source_sentence": "三者、施想。",
        "translation": "3. the perception of giving...",
        "source": "T07n0220_498:0534a22_14"
    },
    {
        "source_sentence": "由著此三輪而行施，故名世間布施波羅蜜多。",
        "translation": "Because they practice giving because they are attached to these three wheels, they're called the perfection of worldly generosity.",
        "source": "T07n0220_498:0534a22_15"
    },
    {
        "source_sentence": "云何此施名為世間？",
        "translation": "How is this giving called worldly?",
        "source": "T07n0220_498:0534a23_16"
    },
    {
        "source_sentence": "以與世間同修行故，不能動出世間法故，如是名為世間布施波羅蜜多。",
        "translation": "Because it's cultivated together with the world and unable to move transmundane dharmas, this is called the perfection of worldly generosity.",
        "source": "T07n0220_498:0534a23_17"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0534a25_18"
    },
    {
        "source_sentence": "若菩薩摩訶薩行布施時三輪清淨：一者、不執我為施者。",
        "translation": "If the three wheels are purified when bodhisattvas and mahāsattvas practice generosity, one is that they don't cling to self as giving.",
        "source": "T07n0220_498:0534a25_19"
    },
    {
        "source_sentence": "二者、不執彼為受者。",
        "translation": "2. Those who don't cling to them as recipients.",
        "source": "T07n0220_498:0534a27_20"
    },
    {
        "source_sentence": "三者、不執施及施果。",
        "translation": "3. They don't cling to giving and the fruit of giving.",
        "source": "T07n0220_498:0534a27_21"
    },
    {
        "source_sentence": "是菩薩摩訶薩行布施時三輪清淨。",
        "translation": "These are the three wheels that are pure when a bodhisattva-mahāsattva practices generosity.",
        "source": "T07n0220_498:0534a28_0"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T07n0220_498:0534a28_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩以大悲心而為上首，所修施福普施有情，於諸有情都無所得，",
        "translation": "“If great enlightening beings, with great compassion as their leader, cultivate virtue and give it to sentient beings, they will attain nothing for all sentient beings.",
        "source": "T07n0220_498:0534a29_2"
    },
    {
        "source_sentence": "雖與有情平等共有迴向無上正等菩提，而於其中不見少相。",
        "translation": "Even though they share the same equality with sentient beings and commonly dedicate themselves to unsurpassed perfect enlightenment, they don't see little characteristic in them.",
        "source": "T07n0220_498:0534b01_3"
    },
    {
        "source_sentence": "由都無所執而行施，故名出世間布施波羅蜜多。",
        "translation": "Because they all practice generosity without attachment, it's called the supramundane perfection of generosity.",
        "source": "T07n0220_498:0534b03_4"
    },
    {
        "source_sentence": "云何此施名出世間？",
        "translation": "How is this giving called supramundane?",
        "source": "T07n0220_498:0534b04_5"
    },
    {
        "source_sentence": "不與世間同修行故，能永動出世間法故，如是名為出世布施波羅蜜多。」",
        "translation": "Because they don't cultivate the same practice as the world and can permanently move transmundane dharmas, this is called the supramundane perfection of generosity.",
        "source": "T07n0220_498:0534b04_6"
    },
    {
        "source_sentence": "舍利子言：「云何世間淨戒波羅蜜多乃至般若波羅蜜多？",
        "translation": "Śāriputra said, What are the worldly perfections of pure morality and even the perfections of wisdom?",
        "source": "T07n0220_498:0534b06_7"
    },
    {
        "source_sentence": "云何出世間淨戒波羅蜜多乃至般若波羅蜜多？」",
        "translation": "What are the supramundane perfections of pure morality and even the perfections of wisdom?",
        "source": "T07n0220_498:0534b07_8"
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "Sunetra replied, Śāriputra!",
        "source": "T07n0220_498:0534b08_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行淨戒乃至般若時，有所依者著三輪故，名為世間波羅蜜多，",
        "translation": "If a bodhisattva-mahāsattva cultivates pure morality or even prajñā, and if he has any basis because he's attached to the three wheels, it's called the worldly perfection.",
        "source": "T07n0220_498:0534b09_10"
    },
    {
        "source_sentence": "以與世間同修行故，不能動出世間法故。",
        "translation": "It's because they cultivate the same practice as the world, and they can't move transmundane dharmas.",
        "source": "T07n0220_498:0534b11_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行淨戒乃至般若時，無所依者三輪淨故，名出世間波羅蜜多，",
        "translation": "If a bodhisattva-mahāsattva cultivates pure morality and even prajñā, the three wheels that have no basis are purified because they're called transmundane perfections.",
        "source": "T07n0220_498:0534b12_12"
    },
    {
        "source_sentence": "不與世間同修行故，能永動出世間法故。",
        "translation": "Because they do not practice in the same way as worldly ones and are able to permanently move transmundane dharmas.",
        "source": "T07n0220_498:0534b14_0"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T07n0220_498:0534b14_1"
    },
    {
        "source_sentence": "諸菩薩摩訶薩所修般若波羅蜜多有是世間、有是出世，云何名為世間般若波羅蜜多？",
        "translation": "The prajñāpāramitā cultivated by bodhisattvas and mahāsattvas is both mundane and supramundane, so what's called the worldly prajñāpāramitā?",
        "source": "T07n0220_498:0534b15_2"
    },
    {
        "source_sentence": "云何名為出世般若波羅蜜多？",
        "translation": "What's called the supramundane prajñāpāramitā?",
        "source": "T07n0220_498:0534b17_3"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0534b17_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩修布施時，依有所得而行布施，謂作是念：『我能調伏慳貪之心而行布施。』",
        "translation": "If a bodhisattva-mahāsattva cultivates generosity based on having something to give, he or she thinks, 'I can subdue the mind of stinginess and greed by giving.'",
        "source": "T07n0220_498:0534b18_5"
    },
    {
        "source_sentence": "是菩薩摩訶薩依我、有情布施想故，雖捨一切內外所有，而不名為出世般若。",
        "translation": "Because this bodhisattva Mahāsattva relies on the perception of self and sentient beings' generosity, even though he abandons all internal and external possessions, it's not called supramundane prajñā.",
        "source": "T07n0220_498:0534b20_6"
    },
    {
        "source_sentence": "「若菩薩摩訶薩修淨戒時，依有所得而修淨戒，謂作是念：『我能安住杜多功德，",
        "translation": "“Suppose a bodhisattva-mahāsattva cultivates pure morality relying on something acquired when he cultivates pure morality, which is to say that he thinks, ‘I can dwell in the virtue of unexcelled",
        "source": "T07n0220_498:0534b21_7"
    },
    {
        "source_sentence": "我能調伏身、語及心，我能修行十善業道。』",
        "translation": "I can tame body, speech, and mind, and I can cultivate the ten good paths of action.'",
        "source": "T07n0220_498:0534b23_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩依止我見及有情見、諸善法見，雖能修行種種淨戒，亦持施與一切有情平等共有，",
        "translation": "“These great enlightening beings, relying on their views of self, views of sentient beings, and views of good qualities, though able to practice various kinds of pure morality, also uphold generosity equally and simultaneously with",
        "source": "T07n0220_498:0534b24_9"
    },
    {
        "source_sentence": "迴向無上正等菩提而於菩提謂為實有，依諸功德自讚毀他，亦不名為出世般若。",
        "translation": "He dedicates himself to unsurpassed perfect enlightenment and calls it truly existent in terms of enlightenment, praising himself for his own merits and disparaging others, which isn't called supramundane prajñā.",
        "source": "T07n0220_498:0534b26_10"
    },
    {
        "source_sentence": "「若菩薩摩訶薩修安忍時，依有所得而修安忍，謂作是念：『我能忍受一切有情於我所行種種惡事。』",
        "translation": "Suppose a bodhisattva Mahāsattva cultivates peaceful tolerance when he cultivates peaceful tolerance based on what's gained, which is to say that he thinks, 'I can endure the various bad things that all sentient beings",
        "source": "T07n0220_498:0534b28_11"
    },
    {
        "source_sentence": "是菩薩摩訶薩依我、有情安忍見故，雖能忍受他所作惡，亦能持此安忍善根，",
        "translation": "“These great enlightening beings, relying on the peaceful tolerance of self and sentient beings, are able to endure the evil deeds of others; they can also maintain this peaceful root of goodness.",
        "source": "T07n0220_498:0534c01_12"
    },
    {
        "source_sentence": "與諸有情平等共有迴向無上正等菩提，而有所得為方便故，亦不名為出世般若。",
        "translation": "It's not called supramundane prajñā because it's the method of equally and simultaneously dedicating oneself to unsurpassed perfect enlightenment with sentient beings who have attained it.",
        "source": "T07n0220_498:0534c03_13"
    },
    {
        "source_sentence": "「若菩薩摩訶薩修精進時，依有所得而修精進，謂作是念：『我能發起身心精進，",
        "translation": "“Suppose a bodhisattva-mahāsattva cultivates effort based on having gained something, which is to say that he thinks, ‘I can give rise to physical and mental effort.",
        "source": "T07n0220_498:0534c05_14"
    },
    {
        "source_sentence": "勤修福、慧二種資糧。』",
        "translation": "They diligently cultivate the two kinds of accumulations of merit and wisdom.'",
        "source": "T07n0220_498:0534c07_15"
    },
    {
        "source_sentence": "是菩薩摩訶薩雖常發起身心精進，勤修福、慧二種資糧，而得身心福、慧之相，",
        "translation": "“Although these great enlightening beings always undertake physical and mental effort, diligently cultivating the two requisites of merit and wisdom, they attain the characteristics of virtue and wisdom in body and mind.",
        "source": "T07n0220_498:0534c07_16"
    },
    {
        "source_sentence": "及得我相、諸有情相，亦得所求菩提之相，由有所得為方便故，未得名為出世般若。",
        "translation": "They attain the characteristic of self and the characteristics of sentient beings, and they also attain the characteristic of enlightenment that they seek because they have attained it for the sake of skillful means, but they haven't yet att",
        "source": "T07n0220_498:0534c09_17"
    },
    {
        "source_sentence": "「若菩薩摩訶薩修靜慮時，依有所得而修靜慮，謂作是念：『我能修行慈、悲、喜、捨、等持、等至、靜慮、神通入出自在。』",
        "translation": "If a bodhisattva-mahāsattva cultivates meditation based on having something to attain, he thinks, 'I can cultivate kindness, pity, compassion, joy, equanimity, equipoise, absorption, and the",
        "source": "T07n0220_498:0534c11_18"
    },
    {
        "source_sentence": "是菩薩摩訶薩於諸靜慮深生味著，雖持所得靜慮善根，與諸有情平等共有迴向無上正等菩提，",
        "translation": "“Furthermore, these great enlightening beings are deeply attached to the pleasures of meditation. Although they maintain the roots of goodness gained from meditation, they equally and simultaneously dedicate them with sentient beings to unexcell",
        "source": "T07n0220_498:0534c13_19"
    },
    {
        "source_sentence": "以有所得為方便故，而未名為出世般若。",
        "translation": "Because there's something to be attained as a method, it's not called supramundane prajñā.",
        "source": "T07n0220_498:0534c16_20"
    },
    {
        "source_sentence": "「若菩薩摩訶薩修般若時，依有所得而修般若，謂作是念：『我能觀察一切法空，",
        "translation": "“Suppose a bodhisattva Mahāsattva cultivates prajñā based on what he has gained while cultivating prajñā, which is to say that he thinks, ‘I can contemplate the emptiness of all dharmas",
        "source": "T07n0220_498:0534c17_0"
    },
    {
        "source_sentence": "所謂色空乃至識空，如是乃至諸佛無上正等菩提亦皆是空。』",
        "translation": "The so-called emptiness of form and even the emptiness of consciousness, such as this, up to the unsurpassed perfect enlightenment of the buddhas, are also empty.'",
        "source": "T07n0220_498:0534c18_1"
    },
    {
        "source_sentence": "是菩薩摩訶薩以有所得而為方便，雖觀一切皆畢竟空，亦持善根施有情類迴向無上正等菩提，",
        "translation": "“Even though the great enlightening beings contemplate all things as ultimately empty because they have gained something to be gained, yet they maintain roots of goodness and give them to sentient beings in order to dedicate themselves to unexcelled",
        "source": "T07n0220_498:0534c20_2"
    },
    {
        "source_sentence": "亦於自他所修善法平等發起隨喜之心，亦能悔除自所作惡，亦能勸請十方世界無量如來、應、正等覺轉妙法輪度有情眾，",
        "translation": "They can repent of their own evil deeds, and they can also request the infinite buddhas of the ten directions to turn the wonderful wheel of teaching in order to liberate sentient beings.",
        "source": "T07n0220_498:0534c22_3"
    },
    {
        "source_sentence": "亦能發願起勝神通為諸有情作大饒益，而有所得為方便故，猶未名為出世般若。",
        "translation": "They can also give rise to the vow to produce superior supernormal abilities that greatly benefit sentient beings, but they still don't call them supramundane prajñāpāramitā because they have attained it as a method.",
        "source": "T07n0220_498:0534c25_4"
    },
    {
        "source_sentence": "如是名為世間般若波羅蜜多。",
        "translation": "Thus, this is called the worldly prajñāpāramitā.",
        "source": "T07n0220_498:0534c27_5"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0534c27_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩修布施時用微妙慧，以無所得而為方便，於我、有情及布施等都無所得，",
        "translation": "“If great enlightening beings cultivate generosity by means of subtle wisdom, using ungraspable knowledge as their method, they attain nothing for themselves, nothing for sentient beings, or anything for giving.",
        "source": "T07n0220_498:0534c28_0"
    },
    {
        "source_sentence": "為趣無上正等菩提三輪清淨，而修布施波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "In order to aspire to the purity of the three wheels of unsurpassed perfect enlightenment and cultivate the pure path of enlightenment through generosity, this is called supramundane prajñā.",
        "source": "T07n0220_498:0535a01_0"
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情及淨戒等都無所得，",
        "translation": "“Suppose a bodhisattva-mahāsattva uses subtle wisdom to skillfully attain nothing for self, sentient beings, pure precepts, and so forth.",
        "source": "T07n0220_498:0535a02_1"
    },
    {
        "source_sentence": "為趣無上正等菩提三輪清淨，而修淨戒波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "In order to aspire to unsurpassed correct perfect enlightenment, the three wheels are purified, and cultivating the pure path of enlightenment with pure morality and the perfection of precepts is called supramundane prajñā.",
        "source": "T07n0220_498:0535a04_2"
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情及安忍等都無所得，",
        "translation": "“Suppose a bodhisattva-mahāsattva uses subtle wisdom and skillful means to attain nothing for himself, sentient beings, or peace and tolerance.",
        "source": "T07n0220_498:0535a06_3"
    },
    {
        "source_sentence": "為趣無上正等菩提三輪清淨，而修安忍波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "In order to aspire to the purity of the three wheels of unsurpassed perfect enlightenment and cultivate the pure path of enlightenment with the perfection of patience, this is called supramundane prajñā.",
        "source": "T07n0220_498:0535a08_4"
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情身心精進，",
        "translation": "“Suppose a bodhisattva-mahāsattva uses subtle wisdom to skillfully apply the ungraspable to self and sentient beings’ physical and mental effort.",
        "source": "T07n0220_498:0535a10_5"
    },
    {
        "source_sentence": "福慧資糧都無所得，為趣無上正等菩提三輪清淨，而修精進波羅蜜多淨菩提道，",
        "translation": "They cultivate the path of enlightenment purified by the perfection of effort in order to attain unexcelled perfect enlightenment, their accumulation of virtue and wisdom having no gain.",
        "source": "T07n0220_498:0535a11_6"
    },
    {
        "source_sentence": "是則名為出世般若。",
        "translation": "This is called supramundane prajñā.",
        "source": "T07n0220_498:0535a13_7"
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於我、有情及諸靜慮、等持、等至都無所得，",
        "translation": "“Suppose a bodhisattva-mahāsattva uses subtle wisdom and skillful means to attain nothing for himself, sentient beings, meditation, equipoise, or enlightenment.",
        "source": "T07n0220_498:0535a14_8"
    },
    {
        "source_sentence": "為趣無上正等菩提三輪清淨，而修靜慮波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "In order to attain the purity of the three wheels of unsurpassed perfect enlightenment and cultivate the pure path of enlightenment in the perfection of meditation, this is called supramundane prajñā.",
        "source": "T07n0220_498:0535a16_9"
    },
    {
        "source_sentence": "「若菩薩摩訶薩用微妙慧，以無所得而為方便，於一切法、一切有情都無所得，",
        "translation": "“Suppose a bodhisattva-mahāsattva uses subtle wisdom and skillful means to attain nothing in all things and all sentient beings,",
        "source": "T07n0220_498:0535a17_10"
    },
    {
        "source_sentence": "為趣無上正等菩提三輪清淨，而修般若波羅蜜多淨菩提道，是則名為出世般若。",
        "translation": "To aspire to the purity of the three wheels of unsurpassed perfect enlightenment and cultivate the pure path of enlightenment with the perfection of wisdom, this is called supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0535a19_11"
    },
    {
        "source_sentence": "「是菩薩摩訶薩持如是等一切善根，與諸有情平等共有迴向無上正等菩提。",
        "translation": "“This is the bodhisattva Mahāsattva who maintains all these good roots and equally dedicates them to unsurpassed perfect enlightenment together with sentient beings.",
        "source": "T07n0220_498:0535a21_12"
    },
    {
        "source_sentence": "如是迴向，當知即是無上迴向、無差別迴向、無等等迴向、不思議迴向、無對迴向、無量迴向、微妙迴向。",
        "translation": "Such dedication, you should know that it's unsurpassed dedication, undifferentiated dedication, unequalled dedication, inconceivable dedication, faceless dedication, immeasurable dedication, and subtle dedication.",
        "source": "T07n0220_498:0535a23_13"
    },
    {
        "source_sentence": "如是名為出世般若波羅蜜多。",
        "translation": "Thus, this is called the supramundane prajñāpāramitā.",
        "source": "T07n0220_498:0535a25_14"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535a26_15"
    },
    {
        "source_sentence": "如是六種波羅蜜多，何因緣故名為世間？",
        "translation": "What are these six kinds of perfections called worldly because of their causes and conditions?",
        "source": "T07n0220_498:0535a26_16"
    },
    {
        "source_sentence": "復何因緣名為出世？",
        "translation": "Again, for what causes and conditions is it called supramundane?",
        "source": "T07n0220_498:0535a27_17"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535a28_0"
    },
    {
        "source_sentence": "世間者，謂彼六種波羅蜜多，是世間故，名為世間；",
        "translation": "“Worldly”: Because these six kinds of perfections are worldly, they are called ‘worldly’.",
        "source": "T07n0220_498:0535a28_1"
    },
    {
        "source_sentence": "造世間故，名為世間；",
        "translation": "Because they create worlds, they are called worlds.",
        "source": "T07n0220_498:0535a29_2"
    },
    {
        "source_sentence": "由世間故，名為世間；",
        "translation": "Because it is worldly, it is called worldly.",
        "source": "T07n0220_498:0535a29_3"
    },
    {
        "source_sentence": "為世間故，名為世間；",
        "translation": "For worldly reasons they are called ‘worldly’.",
        "source": "T07n0220_498:0535b01_4"
    },
    {
        "source_sentence": "因世間故，名為世間；",
        "translation": "Because of the world, they are called ‘worldly’.",
        "source": "T07n0220_498:0535b01_5"
    },
    {
        "source_sentence": "屬世間故，名為世間；",
        "translation": "Because they belong to the world, they are called worlds.",
        "source": "T07n0220_498:0535b02_6"
    },
    {
        "source_sentence": "依世間故，名為世間。",
        "translation": "Because it depends on the world, it's called the world.",
        "source": "T07n0220_498:0535b02_7"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535b03_8"
    },
    {
        "source_sentence": "出世者，謂此六種波羅蜜多，是出世間故，名出世；",
        "translation": "supramundane refers to these six kinds of perfections. Because they are supramundane, they are called supramundane.",
        "source": "T07n0220_498:0535b03_9"
    },
    {
        "source_sentence": "拔出世間故，名出世；",
        "translation": "It is called supramundane because it transcends the world.",
        "source": "T07n0220_498:0535b04_10"
    },
    {
        "source_sentence": "由世間出故，名出世；",
        "translation": "It is called supramundane because it emanates from the world.",
        "source": "T07n0220_498:0535b04_11"
    },
    {
        "source_sentence": "為世間出故，名出世；",
        "translation": "It is called supramundane because it transcends the world.",
        "source": "T07n0220_498:0535b05_12"
    },
    {
        "source_sentence": "從世間出故，名出世；",
        "translation": "Because they arise from the world, they are called supramundane.",
        "source": "T07n0220_498:0535b05_13"
    },
    {
        "source_sentence": "世間之出故，名出世；",
        "translation": "It is called supramundane because it transcends the world.",
        "source": "T07n0220_498:0535b06_14"
    },
    {
        "source_sentence": "依世間出故，名出世。",
        "translation": "Because they arise in dependence upon the world, they are called supramundane.",
        "source": "T07n0220_498:0535b06_15"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535b07_16"
    },
    {
        "source_sentence": "如是菩薩摩訶薩修行六種波羅蜜多時淨菩提道。」",
        "translation": "Thus, when bodhisattvas and mahāsattvas cultivate the six kinds of perfections, they purify the path of enlightenment.",
        "source": "T07n0220_498:0535b07_17"
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「何等名為諸菩薩摩訶薩菩提道？」",
        "translation": "It was then that Śāriputra asked the long-lived good manifestation, What's called the bodhisattva-mahāsattva path of enlightenment?",
        "source": "T07n0220_498:0535b09_0"
    },
    {
        "source_sentence": "善現答言：「舍利子！",
        "translation": "Sunetra replied, Śāriputra!",
        "source": "T07n0220_498:0535b10_1"
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多是菩薩摩訶薩菩提道，內空乃至無性自性空是菩薩摩訶薩菩提道，",
        "translation": "The perfection of generosity and even the perfection of wisdom are the bodhisattva-mahāsattva's path to enlightenment, and internal emptiness up to the emptiness of the natureless self-nature is the bodhisattva-mah",
        "source": "T07n0220_498:0535b10_2"
    },
    {
        "source_sentence": "真如乃至不思議界是菩薩摩訶薩菩提道，苦、集、滅、道聖諦是菩薩摩訶薩菩提道，",
        "translation": "“True thusness up to the inconceivable realm is the path of enlightenment of the bodhisattva mahāsattva, and the noble truths of suffering, arising, cessation, and the path are the",
        "source": "T07n0220_498:0535b13_3"
    },
    {
        "source_sentence": "四念住乃至八聖道支是菩薩摩訶薩菩提道，四靜慮、四無量、四無色定是菩薩摩訶薩菩提道，",
        "translation": "The four abodes of mindfulness up to the eightfold noble path are the path of enlightenment of the bodhisattva-mahāsattva, and the four meditations, the four immeasurable concentrations, and the four formless concentrations are",
        "source": "T07n0220_498:0535b15_4"
    },
    {
        "source_sentence": "八解脫、九次第定是菩薩摩訶薩菩提道，空、無相、無願解脫門是菩薩摩訶薩菩提道，",
        "translation": "The eight liberations and nine graduated concentrations are the bodhisattva-mahāsattva path of enlightenment, and the liberations through emptiness, signlessness, and wishlessness are the bodhisattva-mahāsattva",
        "source": "T07n0220_498:0535b17_5"
    },
    {
        "source_sentence": "極喜地乃至法雲地是菩薩摩訶薩菩提道，一切陀羅尼門、三摩地門是菩薩摩訶薩菩提道，",
        "translation": "The stage of ultimate bliss up to the stage of the cloud of dharmas is the path of enlightenment of the bodhisattva-mahāsattva, and all the dhāraṇī teachings and samādhi teachings are the path",
        "source": "T07n0220_498:0535b19_6"
    },
    {
        "source_sentence": "五眼、六神通是菩薩摩訶薩菩提道，如來十力乃至十八佛不共法是菩薩摩訶薩菩提道，",
        "translation": "The five eyes and six supernormal powers are the path of enlightenment of the bodhisattva mahāsattva; the ten powers of the Buddha up to the unique qualities of the eighteen buddhas are the path of enlightenment of the",
        "source": "T07n0220_498:0535b21_7"
    },
    {
        "source_sentence": "無忘失法、恒住捨性是菩薩摩訶薩菩提道，一切智、道相智、一切相智是菩薩摩訶薩菩提道。",
        "translation": "The absence of forgetfulness and the constant abiding in equanimity is the bodhisattva-mahāsattva's path to enlightenment, and omniscience, knowledge of the path, and knowledge of all characteristics are the bodhi",
        "source": "T07n0220_498:0535b23_8"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535b25_9"
    },
    {
        "source_sentence": "如是等無量無邊大功德聚一切皆是諸菩薩摩訶薩菩提道。」",
        "translation": "All of these measureless and limitless great clusters of merit are the bodhisattvas, mahāsattvas, and bodhisattvas on the path to enlightenment.",
        "source": "T07n0220_498:0535b25_10"
    },
    {
        "source_sentence": "爾時，舍利子問具壽善現言：「如是所說大功德聚，為由何等波羅蜜多勢力所辦？」",
        "translation": "It was then that Śāriputra asked the long-lived good manifestation, Thus explained, what is the great store of merit that's accomplished by the power of the perfections?",
        "source": "T07n0220_498:0535b26_11"
    },
    {
        "source_sentence": "善現答言：「如是所說大功德聚，皆由般若波羅蜜多勢力所辦。",
        "translation": "Sunetra answered, Thus, these are the great clusters of merit that are explained, which are all accomplished by the power of the prajñāpāramitā.",
        "source": "T07n0220_498:0535b28_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0535c01_13"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535c01_14"
    },
    {
        "source_sentence": "如是般若波羅蜜多能與一切善法為母，一切聲聞、獨覺、菩薩、如來善法從此生故。",
        "translation": "Thus, the prajñāpāramitā can be the mother of all good qualities, and all the good qualities of śrāvakas, pratyekbuddhas, solitary realizers, bodhisattvas, and tathāgatas are born",
        "source": "T07n0220_498:0535c01_15"
    },
    {
        "source_sentence": "如是般若波羅蜜多普能攝受一切善法，一切聲聞、獨覺、菩薩、如來善法依此住故。",
        "translation": "Thus, the perfection of wisdom is able to universally embrace all good qualities, because all śrāvakas, pratyekbuddhas, solitary realizers, bodhisattvas, and tathāgatas' good qualities abide based on",
        "source": "T07n0220_498:0535c03_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535c05_17"
    },
    {
        "source_sentence": "過去菩薩摩訶薩眾，修學般若波羅蜜多極圓滿故，已得無上正等菩提；",
        "translation": "Because the assembly of great enlightening beings of the past cultivated and perfected the perfection of wisdom, they had already attained unexcelled true awakening.",
        "source": "T07n0220_498:0535c05_18"
    },
    {
        "source_sentence": "未來菩薩摩訶薩眾，修學般若波羅蜜多極圓滿故，當得無上正等菩提；",
        "translation": "Because future great enlightening beings cultivate the perfection of wisdom, they will attain unexcelled perfect enlightenment.",
        "source": "T07n0220_498:0535c07_19"
    },
    {
        "source_sentence": "現在十方諸佛國土無量菩薩摩訶薩眾，修學般若波羅蜜多極圓滿故，今得無上正等菩提。",
        "translation": "Now, there are measureless bodhisattva-mahāsattvas in the buddha lands of the ten directions who cultivate the perfection of prajñāpāramitā and attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_498:0535c08_20"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T07n0220_498:0535c10_21"
    },
    {
        "source_sentence": "若菩薩摩訶薩聞說般若波羅蜜多，心無疑惑亦不迷悶，當知是菩薩摩訶薩住如是住恒不捨離，",
        "translation": "If the bodhisattva Mahāsattva hears and teaches the perfection of wisdom without doubt or confusion in his mind, you should know that this is the bodhisattva Mahāsattva who abides like this and doesn’t part with it.",
        "source": "T07n0220_498:0535c11_22"
    },
    {
        "source_sentence": "謂無所得而為方便，常勤救濟一切有情。",
        "translation": "They are the skillful means of attaining nothing and always diligently rescuing all sentient beings.",
        "source": "T07n0220_498:0535c13_23"
    },
    {
        "source_sentence": "當知是菩薩摩訶薩成就如是最勝作意，所謂大悲相應作意。」",
        "translation": "You should know that this is the most excellent contemplation accomplished by a bodhisattva-mahāsattva, which is called the contemplation associated with great compassion.",
        "source": "T07n0220_498:0535c14_24"
    },
    {
        "source_sentence": "時，舍利子謂善現言：「若菩薩摩訶薩住如是住恒不捨離，成就大悲相應作意者，",
        "translation": "Śāriputra then said to the good manifestation, Suppose a bodhisattva Mahāsattva abides in this kind of abiding without ever abandoning it and accomplishes the contemplation associated with great compassion.",
        "source": "T07n0220_498:0535c15_25"
    },
    {
        "source_sentence": "則一切有情亦應成就菩薩摩訶薩。",
        "translation": "Then all sentient beings should also accomplish the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0535c17_26"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0535c18_27"
    },
    {
        "source_sentence": "以一切有情亦於此住及此作意常不捨離，則諸菩薩摩訶薩與一切有情應無差別。」",
        "translation": "Because all sentient beings also always abide here and don't abandon this contemplation, then bodhisattvas, mahāsattvas, and all sentient beings should have no distinctions.",
        "source": "T07n0220_498:0535c18_28"
    },
    {
        "source_sentence": "爾時，具壽善現報舍利子言：「善哉！",
        "translation": "At the time, Kauṣṭhila Sunetra Śāriputra said, Good!",
        "source": "T07n0220_498:0535c20_29"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_498:0535c21_30"
    },
    {
        "source_sentence": "誠如所說，能如實知我所說意，雖似難我而成我義。",
        "translation": "They truly are as they say, able to accurately know the meaning of what I teach, even though it's seeming to be difficult for self to become self.",
        "source": "T07n0220_498:0535c21_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0535c22_32"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0535c22_33"
    },
    {
        "source_sentence": "有情乃至見者非有故，當知如是住及作意亦非有；",
        "translation": "Because sentient beings up to those who see are not existent, it should be known that such abiding and attention as these also are not existent.",
        "source": "T07n0220_498:0535c22_34"
    },
    {
        "source_sentence": "有情乃至見者無實故，當知如是住及作意亦無實；",
        "translation": "Because sentient beings and even those who see are insubstantial, you should know that such states of abiding and contemplation as these are also insubstantial.",
        "source": "T07n0220_498:0535c24_35"
    },
    {
        "source_sentence": "有情乃至見者無性故，當知如是住及作意亦無性；",
        "translation": "Because sentient beings up to those who see are without nature, it should be known that abiding and attention in this way are also without nature.",
        "source": "T07n0220_498:0535c25_36"
    },
    {
        "source_sentence": "有情乃至見者空故，當知如是住及作意亦空；",
        "translation": "Because sentient beings and even those who see are empty, they should be known to abide in such an abode and contemplate emptiness as well.",
        "source": "T07n0220_498:0535c26_37"
    },
    {
        "source_sentence": "有情乃至見者遠離故，當知如是住及作意亦遠離；",
        "translation": "Because sentient beings up to those who see are far from it, they should be known that such abiding and contemplation are also far from it.",
        "source": "T07n0220_498:0535c27_38"
    },
    {
        "source_sentence": "有情乃至見者寂靜故，當知如是住及作意亦寂靜；",
        "translation": "Because sentient beings and even those who see are quiescent, they should be known to abide in this way. The same applies to attention and also to the one who acts with attention is also quiescent.",
        "source": "T07n0220_498:0535c28_39"
    },
    {
        "source_sentence": "有情乃至見者無覺知故，當知如是住及作意亦無覺知。",
        "translation": "Because sentient beings and even those who see lack perception, you should know that such abiding and contemplation also lack perception.",
        "source": "T07n0220_498:0535c29_40"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0536a02_41"
    },
    {
        "source_sentence": "色乃至識非有故、無實故、無性故、空故、遠離故、寂靜故、無覺知故，",
        "translation": "It's because form and even consciousness aren't existent, lack reality, lack nature, lack emptiness, are far removed, are quiescent, and lack perception and knowing.",
        "source": "T07n0220_498:0536a02_42"
    },
    {
        "source_sentence": "當知如是住及作意亦非有、無實、無性、空、遠離、寂靜、無覺知。",
        "translation": "You should know that such abiding and contemplation are also not existent, insubstantial, without essence, emptiness, distant, tranquil, and without perception.",
        "source": "T07n0220_498:0536a03_43"
    },
    {
        "source_sentence": "如是乃至聲聞、獨覺、無上菩提非有故、無實故、無性故、空故、遠離故、寂靜故、無覺知故，",
        "translation": "Thus, it's because śrāvakas, pratyekbuddhas, solitary realizers, and unsurpassed enlightenment aren't existent, lack reality, lack nature, are empty, are remote, are quiescent, and lack perception",
        "source": "T07n0220_498:0536a05_44"
    },
    {
        "source_sentence": "當知如是住及作意亦非有、無實、無性、空、遠離、寂靜、無覺知。",
        "translation": "You should know that such abiding and contemplation are also not existent, insubstantial, without essence, emptiness, distant, tranquil, and without perception.",
        "source": "T07n0220_498:0536a07_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_498:0536a08_1"
    },
    {
        "source_sentence": "由此因緣，諸菩薩摩訶薩於如是住及此作意常不遠離，與諸有情亦無差別，",
        "translation": "Because of these causes and conditions, the great enlightening beings are always not far from such an abode or this contemplation, and they are no different from sentient beings.",
        "source": "T07n0220_498:0536a08_2"
    },
    {
        "source_sentence": "以一切法及諸有情，皆畢竟空無差別故。」",
        "translation": "It's because all dharmas and sentient beings are ultimately empty without distinction.",
        "source": "T07n0220_498:0536a10_3"
    },
    {
        "source_sentence": "爾時，世尊讚善現曰：「善哉！",
        "translation": "At that point, the Bhagavān praised Shancheng and said, Good!",
        "source": "T07n0220_498:0536a12_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_498:0536a12_1"
    },
    {
        "source_sentence": "汝善能為諸菩薩摩訶薩宣說般若波羅蜜多，此皆如來威神之力。",
        "translation": "You can well explain the prajñāpāramitā for bodhisattvas and mahāsattvas, which are all the Tathāgata's authoritative powers.",
        "source": "T07n0220_498:0536a12_2"
    },
    {
        "source_sentence": "若有欲為諸菩薩摩訶薩宣說般若波羅蜜多，皆應如汝之所宣說。",
        "translation": "If you want to proclaim the perfection of wisdom for bodhisattvas and mahāsattvas, they should all explain it as you do.",
        "source": "T07n0220_498:0536a14_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲學般若波羅蜜多，皆應隨汝所說而學。",
        "translation": "If bodhisattvas, mahāsattvas, want to train in the perfection of wisdom, they should all follow what you teach.",
        "source": "T07n0220_498:0536a15_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩隨汝所說而學般若波羅蜜多，是菩薩摩訶薩疾得無上正等菩提轉妙法輪，",
        "translation": "If the bodhisattva Mahāsattva follows what you teach and trains in the perfection of wisdom, this is how the bodhisattva Mahāsattva quickly attains unsurpassed perfect enlightenment and turns the wonderful Dharma wheel.",
        "source": "T07n0220_498:0536a17_5"
    },
    {
        "source_sentence": "窮未來際利益安樂一切有情。」",
        "translation": "They will benefit and comfort all sentient beings at the end of the future.",
        "source": "T07n0220_498:0536a19_6"
    },
    {
        "source_sentence": "具壽善現為眾宣說甚深般若波羅蜜多時，於此三千大千世界六種變動：東踊西沒，",
        "translation": "When Guoshou Shancheng preached the profound prajñāpāramitā to sentient beings, there were six kinds of turbulence in these 3,000 great one-thousand worlds:",
        "source": "T07n0220_498:0536a19_7"
    },
    {
        "source_sentence": "西踊東沒，南踊北沒，北踊南沒，中踊邊沒，邊踊中沒。",
        "translation": "The west rises up and the east falls down; the south rises up and the north falls down; the north rises up and the south falls down; the middle rises up and the extremes fall down; the extremes rise up and the middle fall down",
        "source": "T07n0220_498:0536a21_8"
    },
    {
        "source_sentence": "爾時，世尊即便微笑，具壽善現白言：「世尊何因何緣現此微笑？」",
        "translation": "It was then that the Bhagavān smiled, and Kauśinagara said, Bhagavān, for what reason and why is the Bhagavān smiling here?",
        "source": "T07n0220_498:0536a23_9"
    },
    {
        "source_sentence": "佛告善現：「如我今者於此三千大千世界，為諸菩薩摩訶薩眾宣說般若波羅蜜多，",
        "translation": "The Buddha said to the good manifestation, Suppose I were to teach the perfection of wisdom to all the bodhisattvas and mahāsattvas in this billion-world-galactic universe.",
        "source": "T07n0220_498:0536a24_10"
    },
    {
        "source_sentence": "今於十方無量無數無邊世界，各有如來、應、正等覺，亦為菩薩摩訶薩眾宣說般若波羅蜜多。",
        "translation": "Now, in measureless, countless, and limitless worlds in the ten directions, there are tathāgatas, arhats, and perfectly enlightened ones who also proclaim the perfection of prajñāpāramitā for the bodhisatt",
        "source": "T07n0220_498:0536a26_11"
    },
    {
        "source_sentence": "如我今者於此三千大千世界，宣說般若波羅蜜多，有十二京天人等眾於一切法得無生忍；",
        "translation": "“World-honored One, just as I have now taught the transcendent wisdom in this great manifold cosmos of one thousand worlds, so many twelve million celestial beings and humans attained the tolerance of nonorigination regarding all things.",
        "source": "T07n0220_498:0536a28_12"
    },
    {
        "source_sentence": "今於十方無量無數無邊世界，各有無量無數無邊諸有情類，聞彼諸佛為諸菩薩摩訶薩眾宣說般若波羅蜜多，",
        "translation": "In the ten directions, in measureless, countless, and boundless worlds, there are measureless, countless, and boundless sentient beings each who hear those buddhas teach the perfection of wisdom to the bodhisattva-mahāsatt",
        "source": "T07n0220_498:0536b01_13"
    },
    {
        "source_sentence": "於空法中深生信解，皆發無上正等覺心，勤修菩薩摩訶薩行。」",
        "translation": "They deeply believe in the teaching of emptiness, all give rise to the mind of unsurpassed perfect enlightenment, and diligently cultivate the bodhisattva-mahāsattva practice.",
        "source": "T07n0220_498:0536b04_14"
    },
    {
        "source_sentence": "第三分天帝品第四之一",
        "translation": "The Fourth and First Part of the Chapter on the Third Part of the God Indra Chapter",
        "source": "T07n0220_498:0536b06_0"
    },
    {
        "source_sentence": "爾時，於此三千大千佛之世界，所有一切四大天王及諸天帝，展轉乃至色究竟天，",
        "translation": "At that time all the great celestial kings of the four continents and their emperors, as many as there are in this world of the three thousand great one-thousand buddha-fields, ascended up to the form-conceiving",
        "source": "T07n0220_498:0536b07_0"
    },
    {
        "source_sentence": "各與無量百千俱胝那庾多眾俱來會坐。",
        "translation": "Each of them sat in the assembly together with measureless hundreds of thousands of koṭinayutas.",
        "source": "T07n0220_498:0536b08_1"
    },
    {
        "source_sentence": "是諸天眾淨業所感異熟身光雖能照曜，而比如來所現常光，百分不及一，",
        "translation": "Although the light emanating from the bodies of retribution produced by gods’ pure deeds can illuminate, the eternal light emitted by buddhas is less than one-thousandth as bright as this.",
        "source": "T07n0220_498:0536b09_2"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisaṭṭṭha doesn't amount to one.",
        "source": "T07n0220_498:0536b11_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0536b12_4"
    },
    {
        "source_sentence": "佛身常光威德熾盛，於諸光中最尊最勝、最上最妙、無比無等、無上第一，",
        "translation": "The Buddha’s body was always shining with great majesty and splendor. It was the most brilliant of all the rays of light, the best of the best, the supreme, the incomparable, the peerless, the unsurpassed,",
        "source": "T07n0220_498:0536b12_5"
    },
    {
        "source_sentence": "蔽諸天光皆令不現，如秋滿月映奪眾星。",
        "translation": "It obscures the light of the gods and prevents them from appearing, like the full moon in autumn that reflects the stars.",
        "source": "T07n0220_498:0536b14_6"
    },
    {
        "source_sentence": "時，天帝釋白善現言：「今此三千大千世界所有一切四大天王及諸天帝，",
        "translation": "Śakra, lord of the gods, then said to Sudarśana: All the great deities in this billion-world-world-galactic universe called Sarvarūpa saṃdarśana (i.e., Indra, the king of",
        "source": "T07n0220_498:0536b15_7"
    },
    {
        "source_sentence": "展轉乃至色究竟天，各與眷屬皆來集會，欲聞大德宣說般若波羅蜜多，",
        "translation": "In succession, up to the ultimate heaven of form, they each came together with their retinues and wished to hear the great virtuous one teach the perfection of wisdom.",
        "source": "T07n0220_498:0536b17_0"
    },
    {
        "source_sentence": "唯願大德哀愍為說。",
        "translation": "Please have mercy on the great virtuous one and speak for him.",
        "source": "T07n0220_498:0536b18_1"
    },
    {
        "source_sentence": "大德！",
        "translation": "O great virtuous one!",
        "source": "T07n0220_498:0536b19_2"
    },
    {
        "source_sentence": "何謂菩薩摩訶薩甚深般若波羅蜜多？",
        "translation": "What's the profound prajñāpāramitā of the bodhisattva-mahāsattva?",
        "source": "T07n0220_498:0536b19_3"
    },
    {
        "source_sentence": "云何菩薩摩訶薩應住般若波羅蜜多？",
        "translation": "How should bodhisattvas and mahāsattvas abide in the perfection of wisdom?",
        "source": "T07n0220_498:0536b20_4"
    },
    {
        "source_sentence": "云何菩薩摩訶薩應學般若波羅蜜多？」",
        "translation": "How should bodhisattvas and mahāsattvas train in the perfection of wisdom?",
        "source": "T07n0220_498:0536b21_0"
    },
    {
        "source_sentence": "爾時，具壽善現告天帝釋言：「憍尸迦！",
        "translation": "It was then that the long-lived good manifestation told Śakra Devānām-Indra, Kauśika!",
        "source": "T07n0220_498:0536b21_1"
    },
    {
        "source_sentence": "汝等天眾皆應諦聽！",
        "translation": "All of you gods, listen attentively!",
        "source": "T07n0220_498:0536b22_2"
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Consider it well!",
        "source": "T07n0220_498:0536b23_3"
    },
    {
        "source_sentence": "吾當承佛威神之力順如來意，為諸菩薩摩訶薩眾宣說般若波羅蜜多，如菩薩摩訶薩可於其中應如是住應如是學。",
        "translation": "In response to the Buddha's authoritative power and following the Tathāgata's wishes, I will explain the perfection of wisdom to the bodhisattvas, mahāsattvas, and others, just as the bodhisattvas, mahāsattvas,",
        "source": "T07n0220_498:0536b23_4"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536b26_5"
    },
    {
        "source_sentence": "汝諸天等未發無上菩提心者今皆應發。",
        "translation": "All of you gods and others who haven't yet arisen the mind of unsurpassed enlightenment should now arise.",
        "source": "T07n0220_498:0536b26_6"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536b27_7"
    },
    {
        "source_sentence": "諸有已入聲聞、獨覺正性離生，不復能發大菩提心。",
        "translation": "Those who have entered the true nature of śrāvakas and pratyekbuddhas that are free from birth can no longer give rise to the mind of great enlightenment.",
        "source": "T07n0220_498:0536b27_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_498:0536b28_9"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536b28_10"
    },
    {
        "source_sentence": "彼於生死流已作限隔故。",
        "translation": "It's because they've created a limit to the flow of birth-and-death.",
        "source": "T07n0220_498:0536b29_0"
    },
    {
        "source_sentence": "其中若有能發無上菩提心者，我亦隨喜。",
        "translation": "If there's anyone among them who can give rise to the mind of unsurpassed enlightenment, I'll also rejoice.",
        "source": "T07n0220_498:0536b29_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_498:0536c01_2"
    },
    {
        "source_sentence": "諸有勝人應求勝法，我終不障他勝善品。",
        "translation": "Those who are superior should seek the superior teaching, and I will never obstruct others in their superior good qualities.",
        "source": "T07n0220_498:0536c01_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536c02_4"
    },
    {
        "source_sentence": "汝問『何謂菩薩摩訶薩甚深般若波羅蜜多？』",
        "translation": "You asked, 'What's meant by the profound prajñāpāramitā of the bodhisattva-mahāsattva?'",
        "source": "T07n0220_498:0536c02_5"
    },
    {
        "source_sentence": "者，諦聽！",
        "translation": "Listen attentively!",
        "source": "T07n0220_498:0536c03_6"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T07n0220_498:0536c04_7"
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T07n0220_498:0536c04_8"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536c04_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟色蘊乃至識蘊，",
        "translation": "“Furthermore, if great enlightening beings give rise to the mind of omniscience and knowledge in response to all phenomena, contemplating the form-aggregate up to the consciousness-aggregate with ungraspable skillful means,",
        "source": "T07n0220_498:0536c04_10"
    },
    {
        "source_sentence": "若無常、若苦，若無我、若不淨，若空、若無相、若無願，若寂靜、若遠離，",
        "translation": "If it’s impermanent, if it’s painful, if it’s selfless, if it’s impure, if it’s empty, if it has no marks, if it has no wishes, if it’s tranquil, or if",
        "source": "T07n0220_498:0536c06_11"
    },
    {
        "source_sentence": "若如病、若如癕，若如箭、若如瘡，若熱惱、若逼切，若敗壞、若衰朽，",
        "translation": "If it’s like illness, or abscesses, or arrows, or sores, or fever, or oppression, or disintegration, or decay,",
        "source": "T07n0220_498:0536c07_12"
    },
    {
        "source_sentence": "若變動、若速滅，若可畏、若可厭，若有災、若有橫，若有疫、若有癘，",
        "translation": "If it changes or quickly ceases, if it’s fearsome or disgusting, if there’s calamity or misfortune, epidemics or abscesses,",
        "source": "T07n0220_498:0536c09_13"
    },
    {
        "source_sentence": "若不安隱、不可保信，無生、無滅、無染、無淨、無作、無為；",
        "translation": "If one is unsettled and unable to preserve faith, there is no birth, no destruction, no defilement, no purity, no doing and no doing.",
        "source": "T07n0220_498:0536c10_14"
    },
    {
        "source_sentence": "思惟眼處乃至意處，思惟色處乃至法處，思惟眼界乃至意界，思惟色界乃至法界，",
        "translation": "He contemplates the sense-field of the eye up to the sense-field of mind, the sense-field of form up to the sense-field of dharmas, the realm of the eye up to the realm of mind, and the realm of form up",
        "source": "T07n0220_498:0536c11_15"
    },
    {
        "source_sentence": "思惟眼識界乃至意識界，思惟眼觸乃至意觸，思惟眼觸為緣所生諸受乃至意觸為緣所生諸受，",
        "translation": "They contemplate the element consciousness of the eye, up to the element consciousness of the mind. They contemplate contact with the eye and even mental contact. They contemplate feelings that arise from visual contact as supporting object and feelings that arise from",
        "source": "T07n0220_498:0536c13_16"
    },
    {
        "source_sentence": "思惟地界乃至識界，思惟無明乃至老死，亦復如是。",
        "translation": "It's likewise with contemplation of the earth realm up to the consciousness realm and contemplation of nescience up to old age and death.",
        "source": "T07n0220_498:0536c15_17"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536c17_18"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0536c17_19"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_498:0536c18_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟無明緣行，行緣識，",
        "translation": "“Furthermore, if great enlightening beings give rise to the mind of omniscience and knowledge in response to all phenomena, contemplating ignorance as conditioned by formations and formations as consciousnesses with the ungraspable as",
        "source": "T07n0220_498:0536c18_21"
    },
    {
        "source_sentence": "識緣名色，名色緣六處，六處緣觸，觸緣受，受緣愛，愛緣取，取緣有，",
        "translation": "Consciousness takes name and form as supporting object; name and form take six sense spheres as supporting object. The six sense spheres take contact as supporting object, sensation as supporting object, thirst as supporting object, grasping as supporting",
        "source": "T07n0220_498:0536c20_22"
    },
    {
        "source_sentence": "有緣生，生緣老死乃至純大苦蘊集已；",
        "translation": "Conditioned arising is the supporting cause for birth. Birth is the supporting cause for old age and death, up to having accumulated the pure mass of suffering.",
        "source": "T07n0220_498:0536c21_23"
    },
    {
        "source_sentence": "復以無所得為方便，思惟無明滅故行滅，行滅故識滅，識滅故名色滅，",
        "translation": "Again, it is with the method of nongrasping that they contemplate the cessation of conditioned forces because of the cessation of ignorance; the cessation of consciousness because of the cessation of conditioned forces; and the cess",
        "source": "T07n0220_498:0536c22_24"
    },
    {
        "source_sentence": "名色滅故六處滅，六處滅故觸滅，觸滅故受滅，受滅故愛滅，愛滅故取滅，",
        "translation": "Because of the cessation of name and form, six sense-fields cease: because of the cessation of the six sense-fields, contact ceases; because of the cessation of contact, feeling ceases; because of the cessation of",
        "source": "T07n0220_498:0536c24_25"
    },
    {
        "source_sentence": "取滅故有滅，有滅故生滅，生滅故老死乃至純大苦蘊滅，如是諸滅無我、空、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "Because grasping ceases, there's cessation; because there's cessation, birth ceases; because birth ceases, old age and death and even the pure great mass of suffering cease; thus, these cessations lack self, empti",
        "source": "T07n0220_498:0536c25_26"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0536c28_27"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0536c29_28"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_498:0536c29_29"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟內空乃至無性自性空無我我所、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "If a bodhisattva-mahāsattva gives rise to the mind of omniscience and knowledge, he contemplates internal emptiness up to the emptiness of the natureless self-nature that has no self or possessions, signlessness, wishless",
        "source": "T07n0220_498:0537a01_30"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a04_31"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0537a04_32"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a05_33"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟真如乃至不思議界無我我所、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "If a bodhisattva-mahāsattva gives rise to the mind of omniscience and knowledge, he uses the method of ungraspableness to contemplate that the true nature or even the inconceivable realm is devoid of self and",
        "source": "T07n0220_498:0537a05_34"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a09_35"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0537a09_36"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a10_37"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟斷界乃至無為界無我我所、無相、無願、寂靜、遠離、無生、無滅、無染、無淨、無作、無為。",
        "translation": "If a bodhisattva-mahāsattva gives rise to the mind of omniscience and knowledge, he uses the method of ungraspableness to contemplate that the realm of cessation or even the realm of nothingness has no self or",
        "source": "T07n0220_498:0537a10_38"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a13_39"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0537a13_40"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a14_41"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，思惟布施波羅蜜多乃至般若波羅蜜多，",
        "translation": "Suppose a bodhisattva-mahāsattva arouses the mind of omniscience and wisdom, contemplates the perfection of generosity and even the perfection of wisdom with ungraspable skillful means.",
        "source": "T07n0220_498:0537a15_42"
    },
    {
        "source_sentence": "思惟四念住乃至八聖道支，思惟四靜慮、四無量、四無色定，思惟八解脫、九次第定，",
        "translation": "He contemplates the four abodes of mindfulness up to the eightfold noble path, contemplates the four meditations, the four immeasurable concentrations, the four formless concentrations, and the eight liberations and nine graduated concentrations.",
        "source": "T07n0220_498:0537a17_43"
    },
    {
        "source_sentence": "思惟空、無相、無願解脫門，思惟淨觀地乃至如來地，思惟極喜地乃至法雲地，",
        "translation": "They contemplate the liberation door of emptiness, signlessness, and wishlessness; they contemplate the stage of pure contemplation up to the stage of enlightenment; they contemplate the stage of ultimate bliss up to the stage of cloud",
        "source": "T07n0220_498:0537a19_44"
    },
    {
        "source_sentence": "思惟五眼、六神通，思惟如來十力乃至十八佛不共法，思惟無忘失法、恒住捨性，",
        "translation": "They contemplate the five eyes and six supernatural powers, contemplate the ten powers of buddhahood up to the unique qualities of the eighteen Buddhas, contemplate the principle of non forgetfulness, and always abide in equanimity.",
        "source": "T07n0220_498:0537a20_45"
    },
    {
        "source_sentence": "思惟一切陀羅尼門、三摩地門，思惟一切智、道相智、一切相智，皆是無常、無我、空、無相、無願、寂靜、遠離、變動、速滅、不可保信、無生、無滅、無染、無淨、無作、無為。",
        "translation": "He contemplates all the dhāraṇī teachings and samādhi teachings, and he contemplates omniscience, knowledge of the path's characteristics, and knowledge of all characteristics, which are impermanent, selfless, empty, signless,",
        "source": "T07n0220_498:0537a22_46"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537a26_47"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0537a26_48"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_498:0537a27_49"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，安住內空乃至無性自性空，",
        "translation": "“If great enlightening beings give rise to the mind of knowledge of all things, they establish internal emptiness or even emptiness without essence as self-nature by means of ungraspable knowledge.",
        "source": "T07n0220_498:0537a27_50"
    },
    {
        "source_sentence": "安住真如乃至不思議界，安住斷界乃至無為界，安住苦聖諦乃至道聖諦。",
        "translation": "He abides in the realm of true reality up to the inconceivable realm, abides in the realm of cessation up to the realm of nothingness, and abides in the noble truth of suffering up to the noble truth of",
        "source": "T07n0220_498:0537a29_51"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537b02_52"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0537b02_53"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_498:0537b03_54"
    },
    {
        "source_sentence": "若菩薩摩訶薩起應一切智智心，以無所得為方便，修行布施波羅蜜多乃至般若波羅蜜多，",
        "translation": "If bodhisattvas, mahāsattvas, give rise to the mind of omniscience and wisdom that responds to all things, cultivate the perfection of generosity and even the perfection of wisdom with ungraspable skillful means.",
        "source": "T07n0220_498:0537b03_55"
    },
    {
        "source_sentence": "修行四念住乃至八聖道支，修行四靜慮、四無量、四無色定，修行八解脫、九次第定，",
        "translation": "He cultivates the four abodes of mindfulness up to the eightfold noble path; he cultivates the four meditations, the four immeasurable concentrations and the four formless concentrations; he cultivates the eight liberations and the nine graduated concentrations",
        "source": "T07n0220_498:0537b05_56"
    },
    {
        "source_sentence": "修行空、無相、無願解脫門，修行極喜地乃至法雲地，修行五眼、六神通，",
        "translation": "He cultivates the liberation gate of emptiness, signlessness, and wishlessness; he cultivates the stage of ultimate bliss up to the stage of the cloud of teachings; he cultivates the five eyes and six transcendent powers.",
        "source": "T07n0220_498:0537b07_57"
    },
    {
        "source_sentence": "修行如來十力乃至十八佛不共法，修行無忘失法、恒住捨性，修行一切陀羅尼門、三摩地門，",
        "translation": "He cultivates the ten powers of the enlightened, up to the unique qualities of the eighteen Buddhas; he cultivates the principle of nonforgetfulness and always abiding in equanimity; he cultivates all the teachings of",
        "source": "T07n0220_498:0537b09_0"
    },
    {
        "source_sentence": "修行一切智、道相智、一切相智，修行一切菩薩摩訶薩行，修行諸佛無上正等菩提。",
        "translation": "They cultivate omniscience, knowledge of the path's characteristics, and knowledge of all characteristics, cultivate all bodhisattva-mahāsattva practices, and cultivate the buddhas' unsurpassed perfect enlightenment.",
        "source": "T07n0220_498:0537b11_1"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_498:0537b13_0"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩甚深般若波羅蜜多。",
        "translation": "This is called the profound prajñāpāramitā of the bodhisattva-mahāsattva.",
        "source": "T07n0220_498:0537b13_1"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百九十八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 4, Volume 5",
        "source": "T07n0220_498:0537b15_0"
    }
]