[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 4",
        "source": "T07n0220_543:0790c15_0"
    },
    {
        "source_sentence": "十三",
        "translation": "thirteen",
        "source": "T07n0220_543:0790c16_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_543:0790c18_0"
    },
    {
        "source_sentence": "第四分隨喜迴向品第六之一",
        "translation": "The Sixth Part of the Chapter VI of the Fourth Part's dedication of Relying on Joy",
        "source": "T07n0220_543:0790c19_0"
    },
    {
        "source_sentence": "爾時，慈氏菩薩摩訶薩謂具壽善現言：「大德！",
        "translation": "It was then that the Maitreya Bodhisattva Mahāsattva addressed Kauśinagara and said, Mañjuśrī!",
        "source": "T07n0220_543:0790c20_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩所有隨喜迴向俱行諸福業事於餘有情施、戒、修等諸福業事為最為勝、為尊為高、為妙為微妙、為上為無上、無等無等等。」",
        "translation": "The meritorious actions that bodhisattvas, mahāsattvas, and other sentient beings give, observe precepts, cultivate, and so forth are the most superior, honored, exalted, marvelous, subtle, unsurpassed",
        "source": "T07n0220_543:0790c21_0"
    },
    {
        "source_sentence": "爾時，具壽善現問慈氏菩薩摩訶薩言：「諸菩薩摩訶薩所起隨喜迴向之心，",
        "translation": "It was then that the enlightening being Guoshou Shancheng asked the Bodhisattva Maitreya, saying, “The minds of the great bodhisattvas and mahāsattvas who give rise to joyful dedication are like this:",
        "source": "T07n0220_543:0790c24_1"
    },
    {
        "source_sentence": "普緣十方無量無數不可思議無邊世界，一一世界無量無數不可思議無邊如來、應、正等覺，",
        "translation": "They pervade countless, immeasurable, inconceivable, and boundless worlds in the ten directions. In each world there are countless, immeasurable, inconceivable, and boundless enlightened",
        "source": "T07n0220_543:0790c25_2"
    },
    {
        "source_sentence": "斷諸有路絕戲論道，已入無餘依般涅槃界者，從初發心乃至證得所求無上正等菩提，",
        "translation": "Those who have cut off all paths of existence, cut off the path of conceptual elaborations, and entered the state of parinirvāṇa without remainder from the first arousal of mind up to the realization of the unsurpassed perfect enlightenment",
        "source": "T07n0220_543:0790c27_3"
    },
    {
        "source_sentence": "如是乃至入無餘依般涅槃界，展轉乃至正法滅已，於其中間所有戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊，",
        "translation": "In the same way, up to when one enters the realm of parinirvana without remainder and develops until the cessation of the true-dharma, there are among them all the aggregates of morality, concentration, wisdom, liberation, and",
        "source": "T07n0220_543:0790c29_4"
    },
    {
        "source_sentence": "若六波羅蜜多相應善根，若佛圓滿功德相應善根，若力、無畏相應善根，",
        "translation": "If it's the good root associated with the six perfections, the good root associated with the Buddha's perfect qualities, and the good root associated with strength and fearlessness,",
        "source": "T07n0220_543:0791a03_5"
    },
    {
        "source_sentence": "若神通波羅蜜多相應善根，若甚深般若波羅蜜多相應善根，若大願波羅蜜多相應善根，",
        "translation": "If it's the good root associated with the perfection of supernormal powers, if it's the good root associated with the profound perfection of wisdom, and if it's the good root associated with the perfection of great vows,",
        "source": "T07n0220_543:0791a04_6"
    },
    {
        "source_sentence": "若一切智智相應善根，若為利樂一切有情大慈、大悲、大喜、大捨，若無量無數諸佛功德，",
        "translation": "If they are the roots of goodness associated with omniscience and knowledge, great kindness, great compassion, great joy, great equanimity for the benefit of all sentient beings, or measureless and countless buddha-qualities,",
        "source": "T07n0220_543:0791a07_0"
    },
    {
        "source_sentence": "若證無上正等菩提所有妙樂，若於諸法得大自在波羅蜜多，若不可伏能伏一切無量最極神通妙行，",
        "translation": "If they realize the marvelous bliss of unsurpassed perfect enlightenment, if they attain great freedom in all things, and if they can subdue all the wonderful practices of immeasurable, supremely mysterious spiritual powers,",
        "source": "T07n0220_543:0791a09_0"
    },
    {
        "source_sentence": "若無障、無礙、無對、無等、無喻、無限如來如實勇猛威力，若佛智見，",
        "translation": "If the unobstructed, unobstructed, unresisting, unequalled, immeasurable, and infinitely great enlightened one’s true boldness and might were to be seen by those of buddha-knowledge,",
        "source": "T07n0220_543:0791a11_1"
    },
    {
        "source_sentence": "若佛十力波羅蜜多，若四無畏最極圓滿所證佛法；",
        "translation": "If it is the Buddha’s perfection of the ten powers, or if it is the buddha-dharma realized by the most perfect completion of the four forms of fearlessness.",
        "source": "T07n0220_543:0791a12_2"
    },
    {
        "source_sentence": "若能引發諸法勝義所證佛法，若轉法輪，若秉法炬，若擊法鼓，若吹法螺，",
        "translation": "If you can give rise to the buddha-dharma realized by the ultimate meaning of all things, if you turn the wheel of the Dharma, if you hold the torch of the Dharma, if you beat the drum of the Dharma, and if you blow the con",
        "source": "T07n0220_543:0791a13_3"
    },
    {
        "source_sentence": "若雨法雨，若設法會，若以法味恣諸有情隨意所欣皆令充足，若於如是無上法教，",
        "translation": "If he showers the rain of the Dharma, if he sets up a religious assembly, or if he satisfies sentient beings with the flavor of the Dharma and causes them to enjoy it as they wish, then in such an unexcelled teaching of the",
        "source": "T07n0220_543:0791a15_4"
    },
    {
        "source_sentence": "謂諸佛法、若獨覺法、若聲聞法，所有調伏勝解，決定趣三菩提，若佛世尊授諸菩薩無上正等大菩提記，",
        "translation": "It means that all the buddha-teachings, self-enlightened teachings, and śrāvaka teachings have subdued their resolve and are certain to lead to the three kinds of enlightenment.",
        "source": "T07n0220_543:0791a17_5"
    },
    {
        "source_sentence": "若彼一切殊勝善根，所謂布施乃至般若波羅蜜多相應善根，若授獨覺補特伽羅獨覺乘菩提記，",
        "translation": "If they all have superior good roots, which are called the good roots associated with generosity or even the perfection of wisdom, and if they give assurance of enlightenment to the solitary realizer, the pudgala, the solitary realizer",
        "source": "T07n0220_543:0791a19_6"
    },
    {
        "source_sentence": "若彼一切殊勝善根，所謂觀察十二緣起相應善根，若授聲聞補特伽羅聲聞乘菩提記，",
        "translation": "If they give assurance of enlightenment to all the extraordinary good roots, which are called observing the good roots associated with the twelve kinds of dependent arising, and if they give assurance of enlightenment to the śrāvakas",
        "source": "T07n0220_543:0791a21_7"
    },
    {
        "source_sentence": "若彼一切殊勝善根，所謂施性、戒性、修性三福業事，若學、無學無漏善根，",
        "translation": "“All these extraordinary roots of merit are with the so-called nature of giving, with the nature of moral precepts and with the development of the three acts of merit”:",
        "source": "T07n0220_543:0791a23_8"
    },
    {
        "source_sentence": "若諸異生於彼諸法所種善根，若諸如來、應、正等覺四眾弟子，謂苾芻、苾芻尼、鄔波索迦、鄔波斯迦所有施性、戒性、修性三福業事，",
        "translation": "If ordinary people plant good roots in those things, if the Tathāgatas, Arhats, and Fully Awakened Ones of the four groups of disciples are monks, nuns, Upāsaka, or Upāsaka, they",
        "source": "T07n0220_543:0791a25_9"
    },
    {
        "source_sentence": "若於諸佛所說法教，天、龍、藥叉廣說乃至人非人等所種善根，若彼於佛般涅槃後所種善根，",
        "translation": "If someone were to teach the Dharma taught by the buddhas, gods, dragons, yakṣas, and so forth, up to humans and non-humans, they'd plant good roots. If they plant good roots after the parinirvāṇa",
        "source": "T07n0220_543:0791a28_10"
    },
    {
        "source_sentence": "若有情類於佛、法、僧及餘善士深心信樂，所起種種殊勝善根。",
        "translation": "If there are sentient beings who deeply believe in the Buddha, Dharma, Saṃgha, and other good people, they'll give rise to various extraordinary good roots.",
        "source": "T07n0220_543:0791b01_11"
    },
    {
        "source_sentence": "是諸善根及餘功德，一切合集觀察稱量，現前發起最尊最勝、最上最妙隨喜之心。",
        "translation": "These good roots and other merits are all combined, collected, observed, and measured, and they presently give rise to the most honored, most superior, and most sublime joyful mind.",
        "source": "T07n0220_543:0791b03_0"
    },
    {
        "source_sentence": "復以如是隨喜俱行諸福業事，與諸有情平等共有迴向無上正等菩提，願此善根與有情類同共引發所求無上正等菩提。",
        "translation": "Furthermore, by thus performing meritorious actions that are accompanied by joy, they equally and simultaneously dedicate them to unsurpassed correct perfect enlightenment with sentient beings, hoping that this good root will be the same as",
        "source": "T07n0220_543:0791b04_1"
    },
    {
        "source_sentence": "如是所起隨喜迴向，於餘所起諸福業事為最為勝、為尊為高、為妙為微妙、為上為無上、無等無等等。",
        "translation": "Such a joyful dedication of merit that arises is the most superior, honored, high, marvelous, subtle, superior, unsurpassed, peerless, and unequalled among the other meritorious actions that are produced.",
        "source": "T07n0220_543:0791b07_2"
    },
    {
        "source_sentence": "「於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_543:0791b10_0"
    },
    {
        "source_sentence": "彼菩薩摩訶薩緣如是事，起如是行相隨喜迴向心，為有如是所緣可得，",
        "translation": "Because of such things, the bodhisattva Mahāsattva gives rise to such an attitude of joyful dedication in terms of practice and characteristics, because there are such perceptual objects that can be obtained.",
        "source": "T07n0220_543:0791b10_1"
    },
    {
        "source_sentence": "如彼菩薩所取相不？」",
        "translation": "Is it like the marks grasped by those bodhisattvas?",
        "source": "T07n0220_543:0791b11_2"
    },
    {
        "source_sentence": "爾時，慈氏菩薩答具壽善現言：「彼菩薩摩訶薩緣如是事，起如是行相隨喜迴向心，",
        "translation": "It was then that the Maitreya Bodhisattva answered the long-lived good manifestation, saying, That bodhisattva Mahāsattva gave rise to this kind of practice and joyfully dedicated his mind to such things.",
        "source": "T07n0220_543:0791b12_3"
    },
    {
        "source_sentence": "實無如是所緣可得，如彼菩薩所取之相。」",
        "translation": "There really isn't such a perceptual object that can be obtained, just like the characteristics grasped by those bodhisattvas.",
        "source": "T07n0220_543:0791b14_4"
    },
    {
        "source_sentence": "時，具壽善現謂慈氏菩薩言：「若無如是所緣諸事，如彼菩薩所取相者，",
        "translation": "Guoshou Shancheng then said to the Maitreya Bodhisattva, saying, If there are no such perceptual objects like those bodhisattvas' grasped characteristics,",
        "source": "T07n0220_543:0791b15_5"
    },
    {
        "source_sentence": "彼諸菩薩隨喜迴向，豈不皆成想心見倒？",
        "translation": "Wouldn't those bodhisattvas who joyfully dedicate themselves back to them all become mistaken in their conceptions and views?",
        "source": "T07n0220_543:0791b16_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0791b17_7"
    },
    {
        "source_sentence": "如有貪著無所有事，無常謂常，實苦謂樂，無我謂我，不淨謂淨，即便發起想心見倒。",
        "translation": "If someone clings to things that lack existence and regards impermanence as permanence, real suffering as pleasure, selflessness as self, and impurity as purity, they'll even give rise to the error of conceptualization and mind-view.",
        "source": "T07n0220_543:0791b17_8"
    },
    {
        "source_sentence": "如所緣事實無所有，菩提及心亦復如是，一切法、一切界亦應爾。",
        "translation": "Just as the objective real thing has no existence, so too does enlightenment and mind, and so should all things and all realms be likewise.",
        "source": "T07n0220_543:0791b19_9"
    },
    {
        "source_sentence": "若一切種皆無所有、無差別者，何等是所緣事？",
        "translation": "If all kinds are without existence and without distinctions, what's the thing that's the perceptual object?",
        "source": "T07n0220_543:0791b21_10"
    },
    {
        "source_sentence": "何等是隨喜心？",
        "translation": "What's the mind that follows joy?",
        "source": "T07n0220_543:0791b22_11"
    },
    {
        "source_sentence": "何等是菩提？",
        "translation": "What's enlightenment?",
        "source": "T07n0220_543:0791b22_12"
    },
    {
        "source_sentence": "何等是迴向？",
        "translation": "What's dedication of merit?",
        "source": "T07n0220_543:0791b22_13"
    },
    {
        "source_sentence": "云何菩薩摩訶薩緣如是事，起隨喜心迴向無上正等菩提？」",
        "translation": "How does a bodhisattva-mahāsattva give rise to the joyful mind and dedicate it back to unsurpassed perfect enlightenment because of such things?",
        "source": "T07n0220_543:0791b23_14"
    },
    {
        "source_sentence": "慈氏菩薩報善現言：「如是所起隨喜迴向，不應對彼新學大乘菩薩前說。",
        "translation": "The Maitreya Bodhisattva answered Shancheng and said, Such a joyful dedication of merit that arises shouldn't be explained in front of those newly trained great vehicle bodhisattvas.",
        "source": "T07n0220_543:0791b24_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0791b26_16"
    },
    {
        "source_sentence": "彼聞如是隨喜迴向，所有信樂恭敬之心皆當隱沒。",
        "translation": "When they hear such a joyful dedication of merit, their faith and respect will all be concealed.",
        "source": "T07n0220_543:0791b26_17"
    },
    {
        "source_sentence": "如是隨喜迴向之法，應為不退轉菩薩摩訶薩，或曾供養無量諸佛，久發大願，",
        "translation": "In this way, the great vows of joyful dedication should be undertaken for the sake of enlightening beings who do not turn back. Or they may have served infinite buddhas and long aspired to great vows.",
        "source": "T07n0220_543:0791b27_18"
    },
    {
        "source_sentence": "多植善根，為多善友所攝受者，分別開示。",
        "translation": "Those who often plant good roots and are collected by many good friends will be discerned and shown.",
        "source": "T07n0220_543:0791b29_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0791c01_20"
    },
    {
        "source_sentence": "彼聞如是隨喜迴向，不驚、不怖、不退、不沒。",
        "translation": "They hear and thus joyfully dedicate themselves back, not frightened, not terrified, not retreating, and not sinking.",
        "source": "T07n0220_543:0791c01_21"
    },
    {
        "source_sentence": "「諸菩薩摩訶薩應以如是隨喜俱行諸福業事，迴向無上正等菩提，當於爾時應作是念：『所可用心隨喜迴向，",
        "translation": "“Great enlightening beings should dedicate themselves in this way to unsurpassed true and complete enlightenment by performing meritorious deeds that are accompanied by joy. At that time, they should think:",
        "source": "T07n0220_543:0791c02_22"
    },
    {
        "source_sentence": "此所用心盡、滅、離、變，此所緣事及諸善根，亦皆如心盡、滅、離、變。",
        "translation": "These mental states of exhaustion, cessation, separation, and change are the same as when the mind is exhausted, eliminated, separated, and changed. The things that take them as supporting objects and the roots of goodness are also the same",
        "source": "T07n0220_543:0791c04_23"
    },
    {
        "source_sentence": "此中何等是所用心？",
        "translation": "What's the intention here?",
        "source": "T07n0220_543:0791c06_24"
    },
    {
        "source_sentence": "復以何等為所緣事及諸善根，而說隨喜迴向無上正等菩提？",
        "translation": "Again, what are the things that are the perceptual objects and the good roots that are described as joyfully dedicating themselves back to unsurpassed perfect enlightenment?",
        "source": "T07n0220_543:0791c06_25"
    },
    {
        "source_sentence": "是心於心，理不應有隨喜迴向，以無二心俱時起故。",
        "translation": "In principle, this mind should not have joyful dedication of merit in relation to the mind because there are no two minds that arise simultaneously.",
        "source": "T07n0220_543:0791c08_26"
    },
    {
        "source_sentence": "心亦不可隨喜迴向，心自性故，是故隨喜迴向之心及所緣事皆不可得。』」",
        "translation": "Nor can the mind follow joy and dedicate itself back to joy, because it's the own-nature of the mind; therefore, the mind that follows joy and dedicates itself back to joy and the things that are its objects are unobtainable.'",
        "source": "T07n0220_543:0791c09_27"
    },
    {
        "source_sentence": "時，天帝釋白善現言：「新學大乘諸菩薩眾聞如是事，其心將無驚怖、退沒？",
        "translation": "Śakra Devānām-Indra then said to Shancheng, Newly trained great vehicle bodhisattvas who hear such things will have no fear or retreat in their minds?",
        "source": "T07n0220_543:0791c11_28"
    },
    {
        "source_sentence": "云何菩薩摩訶薩眾於所緣事起隨喜心？",
        "translation": "How do bodhisattvas, mahāsattvas, and others give rise to the mind of following joy in regard to things that are objects?",
        "source": "T07n0220_543:0791c12_29"
    },
    {
        "source_sentence": "云何攝受隨喜俱行諸福業事，迴向無上正等菩提而不違理？」",
        "translation": "How is it not inconsistent with the principle to gather merits, actions, and deeds that are accompanied by joy and practiced together and dedicate them back to unsurpassed perfect enlightenment?",
        "source": "T07n0220_543:0791c13_30"
    },
    {
        "source_sentence": "爾時，善現依承慈氏菩薩威力，告帝釋言：「諸菩薩摩訶薩普緣十方無量無數不可思議無邊世界一切如來、應、正等覺，",
        "translation": "At that point, relying on the authority of the Maitreya Bodhisattva, Sunetra addressed Indra, saying, All the great enlightening beings have for their object all the buddhas and perfectly enlightened ones in the ten directions",
        "source": "T07n0220_543:0791c15_31"
    },
    {
        "source_sentence": "斷諸有路絕戲論道，殄諸雲霧摧諸棘刺，捨諸重擔逮得己利，盡諸有結正智解脫，",
        "translation": "He cut off the paths of existence and stops discussing the paths, breaks through clouds and mist, destroys thorns and thorn roots, abandons heavy burdens to gain his own advantage, ends the bonds of existence",
        "source": "T07n0220_543:0791c17_32"
    },
    {
        "source_sentence": "到心自在第一究竟，入無餘依涅槃界者，從初發心乃至證得所求無上正等菩提，",
        "translation": "The one who reaches the first ultimate state of mastery over mind and enters the realm of nirvana without remainder, from the first development of mind up to the realization of the unsurpassed perfect enlightenment sought after.",
        "source": "T07n0220_543:0791c19_33"
    },
    {
        "source_sentence": "轉妙法輪度有情眾，般涅槃後乃至法滅，於其中間所有種種功德善根，",
        "translation": "He turned the wheel of the fine dharma to liberate sentient beings, and after parinirvāṇa until the cessation of all dharmas, he accumulated various virtuous roots of goodness among them.",
        "source": "T07n0220_543:0791c21_34"
    },
    {
        "source_sentence": "及弟子眾於諸佛法所種善根，及餘所起種種功德，一切合集觀察稱量，",
        "translation": "And the disciples, planting roots of goodness in all the buddha-teachings and various virtues produced by others, collected, observed, and measured them all.",
        "source": "T07n0220_543:0791c23_35"
    },
    {
        "source_sentence": "現前發起最尊最勝、最上最妙隨喜之心。",
        "translation": "They now give rise to the most honored, most excellent, and most sublime mind of joy.",
        "source": "T07n0220_543:0791c24_36"
    },
    {
        "source_sentence": "復持如是隨喜俱行諸福業事，與諸有情平等共有迴向無上正等菩提。",
        "translation": "They also maintain such meritorious actions that are accompanied by joy, and they share the same dedication of merit with sentient beings equally and together return to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0791c25_37"
    },
    {
        "source_sentence": "彼於爾時方便善巧，能不墜墮想心見倒。」",
        "translation": "At that point, they skillfully skillfully skillfully don't fall into the error of perception and view.",
        "source": "T07n0220_543:0791c27_38"
    },
    {
        "source_sentence": "爾時，慈氏菩薩摩訶薩謂具壽善現言：「若菩薩摩訶薩於自所起隨喜迴向俱行之心，",
        "translation": "It was then that the Maitreya Bodhisattva Mahāsattva addressed the long-lived good manifestation, saying, Suppose a bodhisattva Mahāsattva gives rise to the mind of joyful dedication of what he practices together with",
        "source": "T07n0220_543:0791c29_0"
    },
    {
        "source_sentence": "不作隨喜迴向心想，於所念佛及諸弟子所有功德，不作諸佛及諸弟子功德之想，",
        "translation": "They don’t think of the mind as joyfully dedicating itself back to enlightenment, and they don’t think of the merits of the Buddha or his disciples in that mindfulness.",
        "source": "T07n0220_543:0792a01_1"
    },
    {
        "source_sentence": "於諸天、人、阿素洛等所種善根，不作天、人、阿素洛等善根之想，而能隨喜迴向無上正等菩提，",
        "translation": "They do not conceive of celestial beings, human beings, or asuras as roots of goodness, yet they can joyfully dedicate themselves to unsurpassed true and complete enlightenment.",
        "source": "T07n0220_543:0792a03_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起隨喜迴向之心，則不墮於想心見倒。",
        "translation": "If this is the mind that follows joy and dedicates itself back to what the bodhisattva Mahāsattva gives rise to, then he won't fall into the error of perception and view.",
        "source": "T07n0220_543:0792a06_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩於自所起隨喜迴向俱行之心，要作隨喜迴向心想，於所念佛及諸弟子所有功德，",
        "translation": "“If great enlightening beings give rise to joyful dedication in their own minds, they should conceive thoughts of joyful dedication of mind and all the virtues of those buddhas and disciples whom they remember.",
        "source": "T07n0220_543:0792a07_1"
    },
    {
        "source_sentence": "作所念佛及諸弟子功德之想，於諸天、人、阿素洛等所種善根，作諸天、人、阿素洛等善根之想，",
        "translation": "They think of the merits of the Buddha and his disciples, and they think of the good roots planted by gods, humans, asuras, and so forth, and they think of the good roots of gods, humans, asuras, and",
        "source": "T07n0220_543:0792a09_2"
    },
    {
        "source_sentence": "方能隨喜迴向無上正等菩提，是菩薩摩訶薩所起隨喜迴向之心，則便墮於想心見倒。",
        "translation": "Only then can they joyfully dedicate themselves to unsurpassed perfect enlightenment, and this is the mind of joyful dedication that arises from the bodhisattva Mahāsattva's joyful dedication, which will then fall into the error of",
        "source": "T07n0220_543:0792a11_3"
    },
    {
        "source_sentence": "「諸菩薩摩訶薩以如是心，念一切佛及諸弟子功德善根，正知此心盡、滅、離、變，",
        "translation": "“With minds like these, the great enlightening beings are mindful of the virtues and roots of goodness of all buddhas and their disciples; they correctly know that this mind is extinguished, ceases, detached,",
        "source": "T07n0220_543:0792a13_4"
    },
    {
        "source_sentence": "非能隨喜，正知彼法其性亦然，非所隨喜；",
        "translation": "They are not able to follow and rejoice. The same is true of the correct knowledge of the characteristics of those factors, but they are not subject to following and rejoicing.",
        "source": "T07n0220_543:0792a15_5"
    },
    {
        "source_sentence": "又正了達能迴向心法性亦爾，非能迴向，及正了知所迴向法其性亦爾，",
        "translation": "The same is true of the mind and dharmas that are directly perceived as capable of dedication, but they are not capable of dedication. The same is true of the nature of the dharmas that are relied upon in order to be directly perceived",
        "source": "T07n0220_543:0792a16_6"
    },
    {
        "source_sentence": "非所迴向。",
        "translation": "They aren't directed back.",
        "source": "T07n0220_543:0792a18_7"
    },
    {
        "source_sentence": "若有能依如是所說隨喜迴向，是正非邪，諸菩薩摩訶薩皆應發起如是隨喜迴向無上正等菩提。",
        "translation": "If someone can rely on such explanations and joyfully dedicate themselves back to unsurpassed perfect enlightenment, this is right or wrong, and bodhisattvas, mahāsattvas, should all give rise to such joyfully dedicating themselves back to",
        "source": "T07n0220_543:0792a18_8"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0792a20_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩普於過去斷諸有路絕戲論道諸佛世尊，從初發心乃至證得所求無上正等菩提，",
        "translation": "“Furthermore, if great enlightening beings universally cut off all paths of existence in the past and abandoned conceptual elaborations about the paths of world-honored buddhas, from the first determination for enlightenment until they realize",
        "source": "T07n0220_543:0792a20_10"
    },
    {
        "source_sentence": "展轉乃至入無餘依般涅槃界，如是乃至正法滅已，於其中間所有諸佛波羅蜜多相應善根，",
        "translation": "“In succession, they enter the realm of nirvana without remainder”: In this way up to after the cessation of the true doctrine, there are all the roots of merit associated with the perfections of buddhahood among them.",
        "source": "T07n0220_543:0792a22_11"
    },
    {
        "source_sentence": "若佛世尊授菩薩記，波羅蜜多相應善根，若佛世尊授獨覺記，觀察緣起相應善根，",
        "translation": "If the Bhagavān gives assurance to bodhisattvas, it's associated with the good roots associated with the perfections, and if the Bhagavān gives assurance to pratyekabuddhas, he observes the good roots associated with",
        "source": "T07n0220_543:0792a25_12"
    },
    {
        "source_sentence": "若佛世尊授聲聞記，彼所發起施性、戒性、修性善根，若有學位一切有漏、無漏善根，",
        "translation": "“If the Buddha, the World-Honored One, were to grant assurance of enlightenment to sravakas, they would give rise to the wholesome roots of generosity, morality, and cultivation. If there are any pure or imp",
        "source": "T07n0220_543:0792a26_13"
    },
    {
        "source_sentence": "若無學位無漏善根，若佛世尊戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊，",
        "translation": "If there are pure roots of merit at the stage of having no more learning to do, and if the Buddha, the world-honored one, has the aggregate of morality, the aggregate of concentration, the aggregate of wisdom, the aggregat",
        "source": "T07n0220_543:0792a28_14"
    },
    {
        "source_sentence": "若為利樂一切有情，大慈、大悲、大喜、大捨，若餘無量無數佛法，若佛世尊宣說正法，",
        "translation": "“If great compassion, great pity, great compassion, great joy, great equanimity, and great relinquishment are for the benefit of all sentient beings, if there are other immeasurable and countless buddha-teach",
        "source": "T07n0220_543:0792b01_15"
    },
    {
        "source_sentence": "若於正法精勤修學勝解安住彼諸善根，若於正法，諸異生類所種善根，",
        "translation": "If they diligently cultivate resolute understanding of the right teaching and abide on their good roots, or if they are planted by ordinary people in the right teaching,",
        "source": "T07n0220_543:0792b03_16"
    },
    {
        "source_sentence": "若諸天、龍、阿素洛等聽聞正法，及聞法已所種善根，乃至傍生聽聞正法，",
        "translation": "If gods, dragons, asuras, and so forth listen to the true Dharma, and the good roots planted after listening to it, or even if an unenlightened person listens to the true Dharma,",
        "source": "T07n0220_543:0792b04_17"
    },
    {
        "source_sentence": "及聞法已所種善根，若佛世尊般涅槃後，諸人、天等所種善根，如是一切合集稱量，",
        "translation": "And the roots of goodness planted by those who have already heard the Dharma. If, after the parinirvana of the World-honored Buddha, humans and gods sow these roots of goodness, they are all collected together and measured in this",
        "source": "T07n0220_543:0792b06_18"
    },
    {
        "source_sentence": "現前發起最尊最勝、最上最妙隨喜之心，復持如是隨喜俱行諸福業事，",
        "translation": "He manifests the most honorable, supreme, sublime joy-following mind and also maintains such joyful acts of virtuous deeds.",
        "source": "T07n0220_543:0792b08_19"
    },
    {
        "source_sentence": "與諸有情平等共有迴向無上正等菩提。",
        "translation": "They are equally and simultaneously dedicated to unsurpassed perfect enlightenment with all sentient beings.",
        "source": "T07n0220_543:0792b10_0"
    },
    {
        "source_sentence": "「於如是時，若正解了諸能隨喜迴向之法盡、滅、離、變，諸所隨喜迴向之法自性皆空。",
        "translation": "“At that point, if someone correctly understands the end, cessation, separation, and change of the dharmas that can be joyfully directed back, the self-natures of the dharmas that are joyfully directed back are all empty",
        "source": "T07n0220_543:0792b10_1"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提，復於是時，若正解了都無有法可能隨喜迴向於法。",
        "translation": "Even though they know it this way, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment, and then again at that point, if they correctly understand it, there's no dharma that they can joyfully dedicate themselves back to the",
        "source": "T07n0220_543:0792b12_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_543:0792b14_3"
    },
    {
        "source_sentence": "以一切法自性皆空，空中都無能、所隨喜迴向法故。",
        "translation": "It's because the self-nature of all dharmas is empty, and there's no ability or joy in the sky to dedicate it back to the Dharma.",
        "source": "T07n0220_543:0792b15_4"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提，是菩薩摩訶薩便能不墮想心見倒。",
        "translation": "Even though they thus know it, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment, and this is the bodhisattva Mahāsattva who's able to avoid falling into the error of conceptualizing and seeing.",
        "source": "T07n0220_543:0792b16_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0792b18_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩於隨喜心及所隨喜功德善根不生執著，於迴向心及所迴向無上菩提亦不執著，",
        "translation": "“These great enlightening beings do not cling to the mind that is joyful or to the good roots of virtue that are joyful, and they do not cling to the mind that dedicates itself to dedication or to the unexcelled",
        "source": "T07n0220_543:0792b18_1"
    },
    {
        "source_sentence": "由無執著不墮顛倒。",
        "translation": "It's because they don't cling and don't fall into error.",
        "source": "T07n0220_543:0792b20_2"
    },
    {
        "source_sentence": "如是菩薩所起隨喜迴向之心，名正無上隨喜迴向，遠離一切虛妄分別。",
        "translation": "Such a bodhisattva's mind that gives rise to joyful dedication is called right and unsurpassed joyful dedication, which is free of all false discriminations.",
        "source": "T07n0220_543:0792b20_3"
    },
    {
        "source_sentence": "「若菩薩摩訶薩於能隨喜迴向之法，起能隨喜迴向法想，於所隨喜迴向之法，",
        "translation": "“Suppose a bodhisattva-mahāsattva gives rise to the thought that he’s able to joyfully dedicate himself back to the teaching and reverses it accordingly.",
        "source": "T07n0220_543:0792b22_4"
    },
    {
        "source_sentence": "起所隨喜迴向法想，而起隨喜迴向無上正等菩提，是菩薩摩訶薩所起隨喜迴向之心，",
        "translation": "To give rise to thoughts of dedication of principles that are joyfully relished and to give rise to joyfully relished dedication toward unsurpassed true enlightenment is the mind of joyful dedication developed by great enlightening beings.",
        "source": "T07n0220_543:0792b24_5"
    },
    {
        "source_sentence": "則便墮於想心見倒，所起隨喜迴向皆邪，菩薩應知方便遠離。",
        "translation": "Then they'll fall into the error of perception, mind, and views, and all the joyful dedication that arises is wrong, so bodhisattvas should know how to skillfully distance themselves from them.",
        "source": "T07n0220_543:0792b26_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0792b27_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩普於未來斷諸有路絕戲論道諸佛世尊，從初發心乃至證得所求無上正等菩提，",
        "translation": "“Furthermore, if great enlightening beings universally abandon all paths of existence in the future and do not engage in conceptual elaborations about their paths, then from the first determination for enlightenment until they realize the supreme perfect en",
        "source": "T07n0220_543:0792b27_8"
    },
    {
        "source_sentence": "展轉乃至入無餘依般涅槃界，如是乃至正法滅已，於其中間所有諸佛波羅蜜多相應善根；",
        "translation": "“In succession, they enter the realm of nirvana without remainder”: In this way up to when the true doctrine is extinguished, all the roots of goodness associated with the perfections of buddhas are present among them.",
        "source": "T07n0220_543:0792c01_9"
    },
    {
        "source_sentence": "若佛世尊授菩薩記，波羅蜜多相應善根；",
        "translation": "If the Buddha, the World-honored One, grants assurance of enlightenment to enlightening beings, it is associated with the roots of goodness associated with the transcendent ways.",
        "source": "T07n0220_543:0792c03_10"
    },
    {
        "source_sentence": "若佛世尊授獨覺記，觀察緣起相應善根；",
        "translation": "If the Buddha, the World-honored One, grants assurance of enlightenment to the self-enlightened one, he observes the roots of goodness associated with dependent origination.",
        "source": "T07n0220_543:0792c04_11"
    },
    {
        "source_sentence": "若佛世尊授聲聞記，彼所發起施性、戒性、修性善根，若有學位一切有漏、無漏善根；",
        "translation": "“If the Buddha, the World-Honored One, gives assurance of enlightenment to the sravakas, the roots of goodness that they develop are by nature generosity, by nature moral precepts, and by nature practice. If there is",
        "source": "T07n0220_543:0792c05_0"
    },
    {
        "source_sentence": "若無學位無漏善根；",
        "translation": "If they have pure roots of merit not tending toward defilement at the stage of having no more learning to do; and if they have pure roots of merit not tending toward defilement at a later stage.",
        "source": "T07n0220_543:0792c06_1"
    },
    {
        "source_sentence": "若佛世尊戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊；",
        "translation": "“World-honored Buddha is the aggregate of morality, the aggregate of concentration, the aggregate of wisdom, the aggregate of liberation, and the aggregate of knowledge and vision of liberation.",
        "source": "T07n0220_543:0792c07_2"
    },
    {
        "source_sentence": "若為利樂一切有情，大慈、大悲、大喜、大捨；",
        "translation": "In order to benefit all sentient beings great kindness, great compassion, great compassion, great joy, great equanimity.",
        "source": "T07n0220_543:0792c08_3"
    },
    {
        "source_sentence": "若餘無量無數佛法；",
        "translation": "The other immeasurable and countless buddha-teachings are like this:",
        "source": "T07n0220_543:0792c09_4"
    },
    {
        "source_sentence": "若佛世尊宣說正法；",
        "translation": "Suppose a buddha world-honored one expounds the true teaching.",
        "source": "T07n0220_543:0792c09_5"
    },
    {
        "source_sentence": "若於正法精勤修學、勝解安住彼諸善根；",
        "translation": "Those who diligently cultivate and master the true doctrine and abide by those roots of goodness.",
        "source": "T07n0220_543:0792c10_6"
    },
    {
        "source_sentence": "若於正法，諸異生類所種善根；",
        "translation": "In the true doctrine, they are roots of goodness planted by ordinary people.",
        "source": "T07n0220_543:0792c11_7"
    },
    {
        "source_sentence": "若諸天、龍、阿素洛等聽聞正法，及聞法已所種善根，乃至傍生聽聞正法，",
        "translation": "If gods, dragons, asuras, and so forth listen to the true Dharma, and the good roots planted after listening to it, or even if an unenlightened person listens to the true Dharma,",
        "source": "T07n0220_543:0792c11_8"
    },
    {
        "source_sentence": "及聞法已所種善根；",
        "translation": "and the roots of goodness planted by those who have heard the Teaching.",
        "source": "T07n0220_543:0792c13_9"
    },
    {
        "source_sentence": "若佛世尊般涅槃後，諸人、天等所種善根。",
        "translation": "Suppose people and gods plant good roots after the Bhagavān's parinirvāṇa, such as humans and gods.",
        "source": "T07n0220_543:0792c13_10"
    },
    {
        "source_sentence": "如是一切合集稱量，現前發起最尊最勝、最上最妙隨喜之心。",
        "translation": "Thus, these are all the combined collections of measurements that presently give rise to the most honored, most superior, and most sublime joyful mind.",
        "source": "T07n0220_543:0792c14_11"
    },
    {
        "source_sentence": "復持如是隨喜俱行諸福業事，與諸有情平等共有迴向無上正等菩提。",
        "translation": "They also maintain such meritorious actions that are accompanied by joy, and they share the same dedication of merit with sentient beings equally and together return to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0792c16_12"
    },
    {
        "source_sentence": "「於如是時，若正解了諸能隨喜迴向之法盡、滅、離、變，諸所隨喜迴向之法自性皆空，",
        "translation": "“At such a time, if he correctly understands that the principles that are conducive to joyful dedication are ended, ceased, separated, and transformed, and that the principles that are conducive to joyful dedication are empty of their own",
        "source": "T07n0220_543:0792c17_13"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提。",
        "translation": "Even though they know it this way, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0792c19_14"
    },
    {
        "source_sentence": "復於是時，若正解了都無有法可能隨喜迴向於法。",
        "translation": "Again, at that point, if someone correctly understands and understands that there's no teaching whatsoever, they can joyfully dedicate themselves back to the teaching.",
        "source": "T07n0220_543:0792c20_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_543:0792c21_16"
    },
    {
        "source_sentence": "以一切法自性皆空，空中都無能、所隨喜迴向法故。",
        "translation": "It's because the self-nature of all dharmas is empty, and there's no ability or joy in the sky to dedicate it back to the Dharma.",
        "source": "T07n0220_543:0792c22_0"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提，是菩薩摩訶薩便能不墮想心見倒。",
        "translation": "Even though they thus know it, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment, and this is the bodhisattva Mahāsattva who's able to avoid falling into the error of conceptualizing and seeing.",
        "source": "T07n0220_543:0792c23_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0792c24_2"
    },
    {
        "source_sentence": "是菩薩摩訶薩於隨喜心及所隨喜功德善根不生執著，於迴向心及所迴向無上菩提亦不執著，",
        "translation": "“These great enlightening beings do not cling to the mind that is joyful or to the good roots of virtue that are joyful, and they do not cling to the mind that dedicates itself to dedication or to the unexcelled",
        "source": "T07n0220_543:0792c25_3"
    },
    {
        "source_sentence": "由無執著不墮顛倒。",
        "translation": "It's because they don't cling and don't fall into error.",
        "source": "T07n0220_543:0792c27_4"
    },
    {
        "source_sentence": "如是菩薩所起隨喜迴向之心，名正無上隨喜迴向，遠離一切虛妄分別。",
        "translation": "Such a bodhisattva's mind that gives rise to joyful dedication is called right and unsurpassed joyful dedication, which is free of all false discriminations.",
        "source": "T07n0220_543:0792c27_5"
    },
    {
        "source_sentence": "「若菩薩摩訶薩於能隨喜迴向之法，起能隨喜迴向法想，於所隨喜迴向之法，",
        "translation": "“Suppose a bodhisattva-mahāsattva gives rise to the thought that he’s able to joyfully dedicate himself back to the teaching and reverses it accordingly.",
        "source": "T07n0220_543:0792c29_6"
    },
    {
        "source_sentence": "起所隨喜迴向法想，而起隨喜迴向無上正等菩提，是菩薩摩訶薩所起隨喜迴向之心，",
        "translation": "To give rise to thoughts of dedication of principles that are joyfully relished and to give rise to joyfully relished dedication toward unsurpassed true enlightenment is the mind of joyful dedication developed by great enlightening beings.",
        "source": "T07n0220_543:0793a02_7"
    },
    {
        "source_sentence": "則便墮於想心見倒，所起隨喜迴向皆邪，菩薩應知方便遠離。",
        "translation": "Then they'll fall into the error of perception, mind, and views, and all the joyful dedication that arises is wrong, so bodhisattvas should know how to skillfully distance themselves from them.",
        "source": "T07n0220_543:0793a04_8"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0793a05_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩普於現在斷諸有路絕戲論道諸佛世尊，從初發心乃至證得所求無上正等菩提，",
        "translation": "“Furthermore, if great enlightening beings universally cut off all paths of existence in the present and give up the world-honored buddhas’ paths of conceptual elaborations, from the first determination for enlightenment until they realize",
        "source": "T07n0220_543:0793a05_10"
    },
    {
        "source_sentence": "展轉乃至入無餘依般涅槃界，如是乃至正法滅已，於其中間所有諸佛波羅蜜多相應善根；",
        "translation": "“In succession, they enter the realm of nirvana without remainder”: In this way up to when the true doctrine is extinguished, all the roots of goodness associated with the perfections of buddhas are present among them.",
        "source": "T07n0220_543:0793a08_11"
    },
    {
        "source_sentence": "若佛世尊授菩薩記，波羅蜜多相應善根；",
        "translation": "If the Buddha, the World-honored One, grants assurance of enlightenment to enlightening beings, it is associated with the roots of goodness associated with the transcendent ways.",
        "source": "T07n0220_543:0793a10_12"
    },
    {
        "source_sentence": "若佛世尊授獨覺記，觀察緣起相應善根；",
        "translation": "If the Buddha, the World-honored One, grants assurance of enlightenment to the self-enlightened one, he observes the roots of goodness associated with dependent origination.",
        "source": "T07n0220_543:0793a11_13"
    },
    {
        "source_sentence": "若佛世尊授聲聞記，彼所發起施性、戒性、修性善根；",
        "translation": "“If the Buddha, the World-Honored One, grants assurance of enlightenment to the sravakas, it is with the nature of giving, with the nature of moral precepts, and with the development of the roots of goodness that",
        "source": "T07n0220_543:0793a12_14"
    },
    {
        "source_sentence": "若有學位一切有漏、無漏善根；",
        "translation": "Suppose there are all the impure and pure roots of wholesomeness at the stage of learning.",
        "source": "T07n0220_543:0793a13_15"
    },
    {
        "source_sentence": "若無學位無漏善根；",
        "translation": "If they have pure roots of merit not tending toward defilement at the stage of having no more learning to do; and if they have pure roots of merit not tending toward defilement at a later stage.",
        "source": "T07n0220_543:0793a13_16"
    },
    {
        "source_sentence": "若佛世尊戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊；",
        "translation": "“World-honored Buddha is the aggregate of morality, the aggregate of concentration, the aggregate of wisdom, the aggregate of liberation, and the aggregate of knowledge and vision of liberation.",
        "source": "T07n0220_543:0793a14_17"
    },
    {
        "source_sentence": "若為利樂一切有情，大慈、大悲、大喜、大捨；",
        "translation": "In order to benefit all sentient beings great kindness, great compassion, great compassion, great joy, great equanimity.",
        "source": "T07n0220_543:0793a15_18"
    },
    {
        "source_sentence": "若餘無量無數佛法；",
        "translation": "The other immeasurable and countless buddha-teachings are like this:",
        "source": "T07n0220_543:0793a16_19"
    },
    {
        "source_sentence": "若佛世尊宣說正法；",
        "translation": "Suppose a buddha world-honored one expounds the true teaching.",
        "source": "T07n0220_543:0793a16_20"
    },
    {
        "source_sentence": "若於正法精勤修學勝解安住彼諸善根；",
        "translation": "Those who diligently cultivate devotion to the true teaching and abide on their roots of goodness.",
        "source": "T07n0220_543:0793a17_21"
    },
    {
        "source_sentence": "若於正法，諸異生類所種善根；",
        "translation": "In the true doctrine, they are roots of goodness planted by ordinary people.",
        "source": "T07n0220_543:0793a18_22"
    },
    {
        "source_sentence": "若諸天、龍、阿素洛等聽聞正法，及聞法已所種善根，乃至傍生聽聞正法，",
        "translation": "If gods, dragons, asuras, and so forth listen to the true Dharma, and the good roots planted after listening to it, or even if an unenlightened person listens to the true Dharma,",
        "source": "T07n0220_543:0793a19_0"
    },
    {
        "source_sentence": "及聞法已所種善根；",
        "translation": "and the roots of goodness planted by those who have heard the Teaching.",
        "source": "T07n0220_543:0793a20_1"
    },
    {
        "source_sentence": "若佛世尊般涅槃後，諸人、天等所種善根。",
        "translation": "Suppose people and gods plant good roots after the Bhagavān's parinirvāṇa, such as humans and gods.",
        "source": "T07n0220_543:0793a21_2"
    },
    {
        "source_sentence": "如是一切合集稱量，現前發起最尊最勝、最上最妙隨喜之心。",
        "translation": "Thus, these are all the combined collections of measurements that presently give rise to the most honored, most superior, and most sublime joyful mind.",
        "source": "T07n0220_543:0793a22_0"
    },
    {
        "source_sentence": "復持如是隨喜俱行諸福業事，與諸有情平等共有迴向無上正等菩提。",
        "translation": "They also maintain such meritorious actions that are accompanied by joy, and they share the same dedication of merit with sentient beings equally and together return to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0793a23_1"
    },
    {
        "source_sentence": "「於如是時，若正解了諸能隨喜迴向之法盡、滅、離、變，諸所隨喜迴向之法自性皆空。",
        "translation": "“At that point, if someone correctly understands the end, cessation, separation, and change of the dharmas that can be joyfully directed back, the self-natures of the dharmas that are joyfully directed back are all empty",
        "source": "T07n0220_543:0793a25_0"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提。",
        "translation": "Even though they know it this way, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0793a26_1"
    },
    {
        "source_sentence": "復於是時，若正解了都無有法可能隨喜迴向於法。",
        "translation": "Again, at that point, if someone correctly understands and understands that there's no teaching whatsoever, they can joyfully dedicate themselves back to the teaching.",
        "source": "T07n0220_543:0793a27_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_543:0793a28_3"
    },
    {
        "source_sentence": "以一切法自性皆空，空中都無能、所隨喜迴向法故。",
        "translation": "It's because the self-nature of all dharmas is empty, and there's no ability or joy in the sky to dedicate it back to the Dharma.",
        "source": "T07n0220_543:0793a29_4"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提，是菩薩摩訶薩便能不墮想心見倒。",
        "translation": "Even though they thus know it, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment, and this is the bodhisattva Mahāsattva who's able to avoid falling into the error of conceptualizing and seeing.",
        "source": "T07n0220_543:0793b01_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0793b03_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩於隨喜心及所隨喜功德善根不生執著，於迴向心及所迴向無上菩提亦不執著，",
        "translation": "“These great enlightening beings do not cling to the mind that is joyful or to the good roots of virtue that are joyful, and they do not cling to the mind that dedicates itself to dedication or to the unexcelled",
        "source": "T07n0220_543:0793b03_7"
    },
    {
        "source_sentence": "由無執著不墮顛倒。",
        "translation": "It's because they don't cling and don't fall into error.",
        "source": "T07n0220_543:0793b05_8"
    },
    {
        "source_sentence": "如是菩薩所起隨喜迴向之心，名正無上隨喜迴向，遠離一切虛妄分別。",
        "translation": "Such a bodhisattva's mind that gives rise to joyful dedication is called right and unsurpassed joyful dedication, which is free of all false discriminations.",
        "source": "T07n0220_543:0793b06_0"
    },
    {
        "source_sentence": "「若菩薩摩訶薩於能隨喜迴向之法，起能隨喜迴向法想，於所隨喜迴向之法，",
        "translation": "“Suppose a bodhisattva-mahāsattva gives rise to the thought that he’s able to joyfully dedicate himself back to the teaching and reverses it accordingly.",
        "source": "T07n0220_543:0793b07_1"
    },
    {
        "source_sentence": "起所隨喜迴向法想，而起隨喜迴向無上正等菩提，是菩薩摩訶薩所起隨喜迴向之心，",
        "translation": "To give rise to thoughts of dedication of principles that are joyfully relished and to give rise to joyfully relished dedication toward unsurpassed true enlightenment is the mind of joyful dedication developed by great enlightening beings.",
        "source": "T07n0220_543:0793b09_2"
    },
    {
        "source_sentence": "則便墮於想心見倒，所起隨喜迴向皆邪，菩薩應知方便遠離。",
        "translation": "Then they'll fall into the error of perception, mind, and views, and all the joyful dedication that arises is wrong, so bodhisattvas should know how to skillfully distance themselves from them.",
        "source": "T07n0220_543:0793b11_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0793b12_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩普於過去、未來、現在斷諸有路絕戲論道諸佛世尊，從初發心乃至證得所求無上正等菩提，",
        "translation": "“Furthermore, if great enlightening beings universally cut off all paths of existence in the past, future, and present, stopping conceptual elaborations about paths, then from the first arousal of their aspiration for enlightenment",
        "source": "T07n0220_543:0793b13_5"
    },
    {
        "source_sentence": "展轉乃至入無餘依般涅槃界，如是乃至正法滅已，於其中間所有諸佛波羅蜜多相應善根；",
        "translation": "“In succession, they enter the realm of nirvana without remainder”: In this way up to when the true doctrine is extinguished, all the roots of goodness associated with the perfections of buddhas are present among them.",
        "source": "T07n0220_543:0793b15_6"
    },
    {
        "source_sentence": "若佛世尊授菩薩記，波羅蜜多相應善根；",
        "translation": "If the Buddha, the World-honored One, grants assurance of enlightenment to enlightening beings, it is associated with the roots of goodness associated with the transcendent ways.",
        "source": "T07n0220_543:0793b17_7"
    },
    {
        "source_sentence": "若佛世尊授獨覺記，觀察緣起相應善根；",
        "translation": "If the Buddha, the World-honored One, grants assurance of enlightenment to the self-enlightened one, he observes the roots of goodness associated with dependent origination.",
        "source": "T07n0220_543:0793b18_8"
    },
    {
        "source_sentence": "若佛世尊授聲聞記，彼所發起施性、戒性、修性善根；",
        "translation": "“If the Buddha, the World-Honored One, grants assurance of enlightenment to the sravakas, it is with the nature of giving, with the nature of moral precepts, and with the development of the roots of goodness that",
        "source": "T07n0220_543:0793b19_9"
    },
    {
        "source_sentence": "若有學位一切有漏、無漏善根；",
        "translation": "Suppose there are all the impure and pure roots of wholesomeness at the stage of learning.",
        "source": "T07n0220_543:0793b20_10"
    },
    {
        "source_sentence": "若無學位無漏善根；",
        "translation": "If they have pure roots of merit not tending toward defilement at the stage of having no more learning to do; and if they have pure roots of merit not tending toward defilement at a later stage.",
        "source": "T07n0220_543:0793b21_11"
    },
    {
        "source_sentence": "若佛世尊戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊；",
        "translation": "“World-honored Buddha is the aggregate of morality, the aggregate of concentration, the aggregate of wisdom, the aggregate of liberation, and the aggregate of knowledge and vision of liberation.",
        "source": "T07n0220_543:0793b21_12"
    },
    {
        "source_sentence": "若為利樂一切有情，大慈、大悲、大喜、大捨；",
        "translation": "In order to benefit all sentient beings great kindness, great compassion, great compassion, great joy, great equanimity.",
        "source": "T07n0220_543:0793b22_13"
    },
    {
        "source_sentence": "若餘無量無數佛法；",
        "translation": "The other immeasurable and countless buddha-teachings are like this:",
        "source": "T07n0220_543:0793b23_14"
    },
    {
        "source_sentence": "若佛世尊宣說正法；",
        "translation": "Suppose a buddha world-honored one expounds the true teaching.",
        "source": "T07n0220_543:0793b24_15"
    },
    {
        "source_sentence": "若於正法精勤修學勝解安住彼諸善根；",
        "translation": "Those who diligently cultivate devotion to the true teaching and abide on their roots of goodness.",
        "source": "T07n0220_543:0793b24_16"
    },
    {
        "source_sentence": "若於正法，諸異生類所種善根；",
        "translation": "In the true doctrine, they are roots of goodness planted by ordinary people.",
        "source": "T07n0220_543:0793b25_17"
    },
    {
        "source_sentence": "若諸天、龍、阿素洛等聽聞正法，及聞法已所種善根，乃至傍生聽聞正法，",
        "translation": "If gods, dragons, asuras, and so forth listen to the true Dharma, and the good roots planted after listening to it, or even if an unenlightened person listens to the true Dharma,",
        "source": "T07n0220_543:0793b26_18"
    },
    {
        "source_sentence": "及聞法已所種善根；",
        "translation": "and the roots of goodness planted by those who have heard the Teaching.",
        "source": "T07n0220_543:0793b28_19"
    },
    {
        "source_sentence": "若佛世尊般涅槃後，諸人、天等所種善根。",
        "translation": "Suppose people and gods plant good roots after the Bhagavān's parinirvāṇa, such as humans and gods.",
        "source": "T07n0220_543:0793b28_20"
    },
    {
        "source_sentence": "如是一切合集稱量，現前發起最尊最勝、最上最妙隨喜之心。",
        "translation": "Thus, these are all the combined collections of measurements that presently give rise to the most honored, most superior, and most sublime joyful mind.",
        "source": "T07n0220_543:0793b29_21"
    },
    {
        "source_sentence": "復持如是隨喜俱行諸福業事，與諸有情平等共有迴向無上正等菩提。",
        "translation": "They also maintain such meritorious actions that are accompanied by joy, and they share the same dedication of merit with sentient beings equally and together return to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0793c01_22"
    },
    {
        "source_sentence": "「於如是時，若正解了諸能隨喜迴向之法盡、滅、離、變，諸所隨喜迴向之法自性皆空。",
        "translation": "“At that point, if someone correctly understands the end, cessation, separation, and change of the dharmas that can be joyfully directed back, the self-natures of the dharmas that are joyfully directed back are all empty",
        "source": "T07n0220_543:0793c03_23"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提。",
        "translation": "Even though they know it this way, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0793c05_24"
    },
    {
        "source_sentence": "復於是時，若正解了都無有法可能隨喜迴向於法。",
        "translation": "Again, at that point, if someone correctly understands and understands that there's no teaching whatsoever, they can joyfully dedicate themselves back to the teaching.",
        "source": "T07n0220_543:0793c06_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_543:0793c07_26"
    },
    {
        "source_sentence": "以一切法自性皆空，空中都無能、所隨喜迴向法故。",
        "translation": "It's because the self-nature of all dharmas is empty, and there's no ability or joy in the sky to dedicate it back to the Dharma.",
        "source": "T07n0220_543:0793c07_27"
    },
    {
        "source_sentence": "雖如是知而能隨喜迴向無上正等菩提，是菩薩摩訶薩便能不墮想心見倒。",
        "translation": "Even though they thus know it, they can joyfully dedicate themselves back to unsurpassed perfect enlightenment, and this is the bodhisattva Mahāsattva who's able to avoid falling into the error of conceptualizing and seeing.",
        "source": "T07n0220_543:0793c08_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0793c10_29"
    },
    {
        "source_sentence": "是菩薩摩訶薩於隨喜心及所隨喜功德善根不生執著，於迴向心及所迴向無上菩提亦不執著，",
        "translation": "“These great enlightening beings do not cling to the mind that is joyful or to the good roots of virtue that are joyful, and they do not cling to the mind that dedicates itself to dedication or to the unexcelled",
        "source": "T07n0220_543:0793c10_30"
    },
    {
        "source_sentence": "由不執著不墮顛倒。",
        "translation": "It's because they don't cling and don't fall into error.",
        "source": "T07n0220_543:0793c13_0"
    },
    {
        "source_sentence": "如是菩薩所起隨喜迴向之心，名正無上隨喜迴向，遠離一切虛妄分別。",
        "translation": "Such a bodhisattva's mind that gives rise to joyful dedication is called right and unsurpassed joyful dedication, which is free of all false discriminations.",
        "source": "T07n0220_543:0793c13_1"
    },
    {
        "source_sentence": "「若菩薩摩訶薩於能隨喜迴向之法，起能隨喜迴向法想，於所隨喜迴向之法，",
        "translation": "“Suppose a bodhisattva-mahāsattva gives rise to the thought that he’s able to joyfully dedicate himself back to the teaching and reverses it accordingly.",
        "source": "T07n0220_543:0793c15_0"
    },
    {
        "source_sentence": "起所隨喜迴向法想，而起隨喜迴向無上正等菩提，是菩薩摩訶薩所起隨喜迴向之心，",
        "translation": "To give rise to thoughts of dedication of principles that are joyfully relished and to give rise to joyfully relished dedication toward unsurpassed true enlightenment is the mind of joyful dedication developed by great enlightening beings.",
        "source": "T07n0220_543:0793c16_1"
    },
    {
        "source_sentence": "則便墮於想心見倒，所起隨喜迴向皆邪，菩薩應知方便遠離。",
        "translation": "Then they'll fall into the error of perception, mind, and views, and all the joyful dedication that arises is wrong, so bodhisattvas should know how to skillfully distance themselves from them.",
        "source": "T07n0220_543:0793c18_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0793c20_3"
    },
    {
        "source_sentence": "若菩薩摩訶薩於所修作諸福業事，如實了知遠離寂靜，於能隨喜迴向之心，",
        "translation": "“If great enlightening beings truly understand the works of virtuous deeds cultivated, they are far removed from quiescence and can joyfully dedicate their minds to them.",
        "source": "T07n0220_543:0793c20_4"
    },
    {
        "source_sentence": "亦如實知遠離寂靜。",
        "translation": "They also truly know that they're far removed from quiescence.",
        "source": "T07n0220_543:0793c22_5"
    },
    {
        "source_sentence": "如是知已，行深般若波羅蜜多，於諸法中都無取著，而起隨喜迴向無上正等菩提，",
        "translation": "Having thus known, they practice the profound prajñāpāramitā, have no attachment to anything, and give rise to joyfully dedicate themselves back to unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0793c22_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起隨喜迴向之心，則不墮於想心見倒。",
        "translation": "If this is the mind that follows joy and dedicates itself back to what the bodhisattva Mahāsattva gives rise to, then he won't fall into the error of perception and view.",
        "source": "T07n0220_543:0793c24_7"
    },
    {
        "source_sentence": "若菩薩摩訶薩於所修作諸福業事，不如實知遠離寂靜，於能隨喜迴向之心，",
        "translation": "“If great enlightening beings do not truly know the works of virtuous deeds cultivated, they are far removed from quiescence and joyfully dedicate their minds to them.",
        "source": "T07n0220_543:0793c25_8"
    },
    {
        "source_sentence": "亦不能知遠離寂靜，於一切法執著諸相，而起隨喜迴向無上正等菩提，",
        "translation": "They also cannot know that they are far removed from quiescence, clinging to all things and marks, yet they give rise to joyfully dedicating themselves back to unsurpassed true enlightenment.",
        "source": "T07n0220_543:0793c27_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起隨喜迴向之心，則便墮於想心見倒。",
        "translation": "If this is the mind that follows joy and dedicates itself back to what the bodhisattva Mahāsattva gives rise to, then he'll fall into the error of perception and view.",
        "source": "T07n0220_543:0793c29_10"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0794a01_11"
    },
    {
        "source_sentence": "若菩薩摩訶薩於已滅度諸佛世尊及諸弟子功德善根，若欲發起隨喜迴向無上正等菩提心者，",
        "translation": "“If great enlightening beings want to give rise to the aspiration for unexcelled perfect enlightenment by joyfully dedicating themselves back to the buddhas, world-honored ones and disciples who have already entered parinirvāṇa",
        "source": "T07n0220_543:0794a01_12"
    },
    {
        "source_sentence": "應作是念：『如佛世尊及諸弟子皆已滅度自性非有，功德善根亦復如是。",
        "translation": "You should think, 'Just as the Bhagavān Buddha and his disciples have all ceased their own natures that aren't existent, so too are the good roots of merit.",
        "source": "T07n0220_543:0794a03_13"
    },
    {
        "source_sentence": "我所發起隨喜迴向無上正等菩提之心，及所迴向無上菩提，性相亦爾都不可得。』",
        "translation": "The mind that I give rise to and joyfully dedicate myself to unsurpassed correct perfect enlightenment and the unsurpassed enlightenment that I dedicate myself to are also unobtainable in their nature and characteristics.'",
        "source": "T07n0220_543:0794a05_14"
    },
    {
        "source_sentence": "如是知已，於諸善根發生隨喜迴向無上正等菩提，便能不生想心見倒，",
        "translation": "Knowing in this way, they develop the roots of goodness and joyfully dedicate them toward unsurpassed true and complete enlightenment, so that they will not give rise to thoughts or mistaken conceptions.",
        "source": "T07n0220_543:0794a07_15"
    },
    {
        "source_sentence": "名正隨喜迴向菩提。",
        "translation": "It's called rightly following joy and dedicating it back to enlightenment.",
        "source": "T07n0220_543:0794a09_16"
    },
    {
        "source_sentence": "若菩薩摩訶薩以取相為方便，行深般若波羅蜜多，於已滅度佛及弟子功德善根，",
        "translation": "Suppose a bodhisattva Mahāsattva practices the profound prajñāpāramitā with grasping characteristics as his method and cultivates the virtuous good roots of buddhas and disciples who have been liberated,",
        "source": "T07n0220_543:0794a09_17"
    },
    {
        "source_sentence": "取相隨喜迴向菩提，是為非善隨喜迴向，由斯便墮想心見倒。",
        "translation": "Attaching to characteristics and following them with joy and dedicating them back to enlightenment is not a good dedication that follows joy, and because of this, they'll fall into the error of conceptualization and mind-view.",
        "source": "T07n0220_543:0794a11_18"
    },
    {
        "source_sentence": "若菩薩摩訶薩不取相為方便，行深般若波羅蜜多，於已滅度佛及弟子功德善根，",
        "translation": "If a bodhisattva-mahāsattva practices the profound prajñāpāramitā without grasping characteristics as a method, he'll cultivate the virtuous good roots of the Buddha and his disciples who have been liberated",
        "source": "T07n0220_543:0794a12_19"
    },
    {
        "source_sentence": "離相隨喜迴向無上正等菩提，是名為善隨喜迴向，由斯不墮想心見倒。」",
        "translation": "Being free of signs and following joy and dedicating oneself back to unsurpassed correct perfect enlightenment is called the dedication of relying on goodness, which prevents one from falling into the error of conceptualizing and seeing.",
        "source": "T07n0220_543:0794a14_20"
    },
    {
        "source_sentence": "爾時，慈氏菩薩摩訶薩問具壽善現言：「大德！",
        "translation": "It was then that the Maitreya Bodhisattva Mahāsattva asked Kauśinagara, saying, Great virtuous one!",
        "source": "T07n0220_543:0794a17_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩於諸如來、應、正等覺及弟子眾功德善根、隨喜俱行福業事等皆不取相，",
        "translation": "“How is it that the great enlightening beings do not grasp characteristics of the virtues, roots of goodness, and meritorious deeds of all buddhas, Buddhas, Arhats, Perfectly Enlightened Ones,",
        "source": "T07n0220_543:0794a18_0"
    },
    {
        "source_sentence": "而能隨喜迴向無上正等菩提？」",
        "translation": "How can they joyfully return to unsurpassed perfect enlightenment?",
        "source": "T07n0220_543:0794a20_0"
    },
    {
        "source_sentence": "善現答言：「應知菩薩摩訶薩所學般若波羅蜜多，有如是等方便善巧，",
        "translation": "Sunetra replied, You should know that the prajñāpāramitā taught by the bodhisattvas and mahāsattvas has such skillful means.",
        "source": "T07n0220_543:0794a20_1"
    },
    {
        "source_sentence": "雖不取相而所作成，非離般若波羅蜜多，有能正起隨喜迴向。",
        "translation": "Even though they don't grasp characteristics, they aren't created apart from the perfection of wisdom, and there are those who can correctly give rise to joyful dedication.",
        "source": "T07n0220_543:0794a22_2"
    },
    {
        "source_sentence": "是故菩薩摩訶薩眾欲成所作，應學般若波羅蜜多。」",
        "translation": "Therefore, if the bodhisattvas, mahāsattvas, and others want to accomplish what they do, they should train in the perfection of wisdom.",
        "source": "T07n0220_543:0794a23_3"
    },
    {
        "source_sentence": "慈氏菩薩摩訶薩言：「大德善現！",
        "translation": "The Maitreya Bodhisattva Mahāsattva said, Well done, great virtuous one!",
        "source": "T07n0220_543:0794a24_4"
    },
    {
        "source_sentence": "莫作是說。",
        "translation": "Don't say that.",
        "source": "T07n0220_543:0794a25_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0794a25_6"
    },
    {
        "source_sentence": "以甚深般若波羅蜜多中，諸佛世尊并弟子眾及所成就功德善根，皆無所有都不可得，",
        "translation": "In the profound prajñāpāramitā, the buddhas, world-honored ones, disciples, and the good roots of merit they attain are all nonexistent and cannot be obtained.",
        "source": "T07n0220_543:0794a26_7"
    },
    {
        "source_sentence": "所作隨喜諸福業事、發心迴向無上菩提，亦無所有都不可得。",
        "translation": "The meritorious deeds they perform, the merits they rejoice in, and the intention to dedicate themselves back to unsurpassed enlightenment also have no existence and are unobtainable.",
        "source": "T07n0220_543:0794a28_8"
    },
    {
        "source_sentence": "「此中菩薩摩訶薩行深般若波羅蜜多時，應作是觀：過去諸佛及弟子眾功德善根性皆已滅，",
        "translation": "“When these great enlightening beings practice the profound prajñāpāramitā, they should observe as follows:",
        "source": "T07n0220_543:0794a29_9"
    },
    {
        "source_sentence": "所作隨喜諸福業事、發心迴向無上菩提性皆寂滅。",
        "translation": "The meritorious deeds that they perform and the acts of joy that arouse their minds and dedicate them back to unsurpassed enlightenment are all tranquil.",
        "source": "T07n0220_543:0794b02_10"
    },
    {
        "source_sentence": "我若於彼諸佛世尊及弟子眾功德善根取相分別，及於所作隨喜俱行諸福業事、發心迴向無上菩提取相分別，",
        "translation": "“World-honored One, if I discriminate among the marks of those buddhas and their disciples’ virtuous roots of goodness by taking what belongs to them, as well as among the marks of deeds that are accompani",
        "source": "T07n0220_543:0794b03_11"
    },
    {
        "source_sentence": "以是取相分別方便，發生隨喜迴向無上正等菩提，諸佛世尊皆所不許。",
        "translation": "Because of this discriminating method of grasping characteristics, they develop the joyful dedication of rebirth to unsurpassed perfect enlightenment, which all the buddhas and world-honored ones don't approve of.",
        "source": "T07n0220_543:0794b06_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0794b08_13"
    },
    {
        "source_sentence": "於已滅度諸佛世尊及弟子等取相分別，隨喜迴向無上菩提，是則名為大有所得。",
        "translation": "To discriminate among the buddhas, world-honored ones and disciples who have extinguished distinctions in their grasping characteristics and joyfully dedicating themselves to unsurpassed enlightenment is called greatly acquired.",
        "source": "T07n0220_543:0794b08_14"
    },
    {
        "source_sentence": "過去已滅，無所有故，未來、現在佛弟子等未至、不住，亦不可得。",
        "translation": "Because it has ceased in the past and doesn't exist, future and present buddha disciples who haven't arrived or won't abide will also be unobtainable.",
        "source": "T07n0220_543:0794b10_15"
    },
    {
        "source_sentence": "若不可得非取相境，若取其相發生隨喜迴向菩提便墮顛倒。",
        "translation": "If they can't attain the object that doesn't grasp characteristics, and if they grasp their characteristics and give rise to joyful dedication of themselves back to enlightenment, they'll fall into error.",
        "source": "T07n0220_543:0794b11_16"
    },
    {
        "source_sentence": "若有失念而取相者，當知非善隨喜迴向，要不取相無所分別，乃名為善隨喜迴向。",
        "translation": "If someone has lost mindfulness and grasps characteristics, they should know that it's not a good joyful dedication of faith. It's called a good joyful dedication of faith if they don't grasp characteristics without discriminating anything.",
        "source": "T07n0220_543:0794b12_17"
    },
    {
        "source_sentence": "「是故菩薩摩訶薩眾應學般若波羅蜜多方便善巧，由此方便善巧勢力，",
        "translation": "Therefore, the bodhisattvas, mahāsattvas, should all study the skillful means of the perfection of wisdom.",
        "source": "T07n0220_543:0794b14_18"
    },
    {
        "source_sentence": "能正發生隨喜迴向。",
        "translation": "He's able to correctly give rise to the joyful dedication of merit.",
        "source": "T07n0220_543:0794b16_19"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲學如是方便善巧，應於般若波羅蜜多數數聽聞、受持、讀誦，",
        "translation": "If bodhisattvas and mahāsattvas want to train in such skillful means, they should repeatedly hear, retain, and recite the perfection of wisdom.",
        "source": "T07n0220_543:0794b16_20"
    },
    {
        "source_sentence": "令善通利、如理思惟，勤請問師甚深義趣。",
        "translation": "He causes them to well penetrate, correctly contemplate, and diligently question the teacher about his profound meaning.",
        "source": "T07n0220_543:0794b18_21"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0794b19_22"
    },
    {
        "source_sentence": "若不依止甚深般若波羅蜜多，終不能得方便善巧。",
        "translation": "If someone doesn't rely on the profound prajñāpāramitā, they'll never attain skillful means.",
        "source": "T07n0220_543:0794b19_23"
    },
    {
        "source_sentence": "若無如是方便善巧，能正發生隨喜迴向，無有是處。",
        "translation": "If someone doesn't have such skillful means to correctly develop joyful dedication of merit, there's no place for it.",
        "source": "T07n0220_543:0794b21_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_543:0794b22_25"
    },
    {
        "source_sentence": "於過去佛及弟子眾諸功德等取相分別隨喜迴向，諸佛世尊皆不隨喜。",
        "translation": "In the past, buddhas and disciples who discriminated merits and so forth in terms of their grasping characteristics and rejoiced and returned to them, but the world-honored buddhas didn't rejoice.",
        "source": "T07n0220_543:0794b22_26"
    },
    {
        "source_sentence": "「是故菩薩摩訶薩眾欲於諸佛及諸弟子功德善根，正發隨喜迴向無上正等菩提，",
        "translation": "“Therefore, the great enlightening beings want to give rise to joy and dedicate themselves back to unsurpassed true and complete enlightenment by focusing on the virtues of the buddhas and their disciples’ roots of goodness.",
        "source": "T07n0220_543:0794b24_27"
    },
    {
        "source_sentence": "不應於中起有所得取相分別隨喜迴向。",
        "translation": "They shouldn't give rise to the discriminating and joyful dedication of grasping characteristics that have been attained in them.",
        "source": "T07n0220_543:0794b25_28"
    },
    {
        "source_sentence": "若於其中起有所得取相分別隨喜迴向，佛不說彼有大義利。",
        "translation": "If someone gives rise to the discriminating and joyful dedication of grasping characteristics that are acquired in them, the Buddha doesn't say that they have great meaning.",
        "source": "T07n0220_543:0794b26_29"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0794b28_30"
    },
    {
        "source_sentence": "如是隨喜迴向之心妄想分別，名雜毒故。",
        "translation": "Thus, the mind that follows joy and dedicates it back to deluded conceptual discrimination is called mixed because of its poison.",
        "source": "T07n0220_543:0794b28_31"
    },
    {
        "source_sentence": "如有飲食，雖具上妙色香美味而雜毒藥，愚夫淺識貪取噉之，初雖適意歡喜快樂，",
        "translation": "Suppose there is a food and drink that, although endowed with exquisite colors, aromas, tastes, and flavors, mixes poison and medicine. Foolish people of shallow consciousness covet it and eat it. At first they find",
        "source": "T07n0220_543:0794b29_32"
    },
    {
        "source_sentence": "而後食消備受眾苦，或便致死若近失命。",
        "translation": "Later, he eats and prepares food to endure all kinds of suffering, whether it causes death or loses his life nearby.",
        "source": "T07n0220_543:0794c02_33"
    },
    {
        "source_sentence": "「如是一類補特伽羅，不善受持，不善觀察甚深般若波羅蜜多文句義理，",
        "translation": "“Such is one kind of person who doesn’t well memorize and observe the profound meaning of the words, phrases, and principles of the prajñāpāramitā",
        "source": "T07n0220_543:0794c03_34"
    },
    {
        "source_sentence": "不善讀誦，不善通達甚深義趣，而告大乘種性者曰：『來！",
        "translation": "They don't well recite it, don't well understand its profound meaning, and tell the great vehicle seed natures, 'Come!",
        "source": "T07n0220_543:0794c04_35"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_543:0794c06_36"
    },
    {
        "source_sentence": "汝於過去未來現在諸佛世尊戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊，",
        "translation": "In the past, future, and present buddhas of the world-honored ones, the aggregate of morality, the aggregate of concentration, the aggregate of wisdom, the aggregate of liberation, and the aggregate of knowledge and vision",
        "source": "T07n0220_543:0794c06_37"
    },
    {
        "source_sentence": "及餘無量無邊功德；",
        "translation": "and the other immeasurable, limitless virtues.",
        "source": "T07n0220_543:0794c07_38"
    },
    {
        "source_sentence": "若佛弟子於諸佛所種諸善根；",
        "translation": "Suppose a disciple of Buddha plants roots of goodness in buddha-places.",
        "source": "T07n0220_543:0794c08_39"
    },
    {
        "source_sentence": "若佛世尊授諸菩薩無上正等大菩提記，彼諸菩薩所種善根；",
        "translation": "If the Buddha, the World-honored One, grants enlightening beings the assurance of unsurpassed true great awakening, those enlightening beings will plant roots of goodness.",
        "source": "T07n0220_543:0794c09_40"
    },
    {
        "source_sentence": "若佛世尊授諸獨覺及聲聞記，彼有情類所種善根；",
        "translation": "If the Buddha, the World-Honored One, grants assurance of enlightenment to self-ened ones and sravakas, these sentient beings will plant roots of goodness.",
        "source": "T07n0220_543:0794c10_41"
    },
    {
        "source_sentence": "若諸天人、阿素洛等於諸佛所乃至正法未滅盡來所種善根；",
        "translation": "Suppose gods, humans, asuras, and so on, plant roots of goodness in the presence of Buddhas, up to when the true-dharma has not been destroyed.",
        "source": "T07n0220_543:0794c11_42"
    },
    {
        "source_sentence": "若善男子、善女人等所種善根，及有於他所成功德發生隨喜迴向善根。",
        "translation": "Suppose good men and good women plant good roots, and they develop the good root of joyful dedication based on the accomplished virtues of others.",
        "source": "T07n0220_543:0794c13_43"
    },
    {
        "source_sentence": "如是一切合集稱量，現前隨喜，與諸有情平等共有迴向無上正等菩提。』",
        "translation": "Thus, all of these are combined into a single collection that's weighed and measured, which is shared with joy in the present and equally dedicated to unsurpassed perfect enlightenment with sentient beings.'",
        "source": "T07n0220_543:0794c14_44"
    },
    {
        "source_sentence": "如是所說隨喜迴向，以有所得取相分別而為方便。",
        "translation": "Thus, it's explained that the joyful dedication of relying on what's attained is made up of grasping characteristics and discriminating them as skillful means.",
        "source": "T07n0220_543:0794c16_45"
    },
    {
        "source_sentence": "譬如世間雜毒飲食初益後損故，此非善隨喜迴向。",
        "translation": "It's like the worldly mixture of poisonous food and drink that first benefits and then loses, which isn't a good joyful dedication of merit.",
        "source": "T07n0220_543:0794c17_46"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0794c18_47"
    },
    {
        "source_sentence": "以有所得取相分別，發起隨喜迴向之心，皆雜毒故。",
        "translation": "Because there's a discernment of grasping characteristics that have been attained, they give rise to the mind of joyful dedication of merit, which is because it's mixed with poison.",
        "source": "T07n0220_543:0794c18_48"
    },
    {
        "source_sentence": "菩薩種性補特伽羅，不應隨彼所說而學。",
        "translation": "A bodhisattva of the seed nature, a pudgala, shouldn't follow what they teach and train.",
        "source": "T07n0220_543:0794c20_49"
    },
    {
        "source_sentence": "「是故，大德！",
        "translation": "Therefore, Mañjuśrī!",
        "source": "T07n0220_543:0794c21_50"
    },
    {
        "source_sentence": "應說云何住菩薩乘善男子等，應於三世十方諸佛及弟子等功德善根隨喜迴向，",
        "translation": "You should explain how to abide in the bodhisattva vehicle. Good sons, you should joyfully dedicate the roots of virtue and goodness of all buddhas and disciples of the ten directions of the three times to enlightening beings",
        "source": "T07n0220_543:0794c21_51"
    },
    {
        "source_sentence": "可說名為無毒妙善隨喜迴向？」",
        "translation": "Can we say that it's called the absence of poison and the wonderfully good joyful dedication of merit?",
        "source": "T07n0220_543:0794c23_52"
    },
    {
        "source_sentence": "具壽善現答慈氏言：「住菩薩乘善男子等行深般若波羅蜜多，欲不謗佛而發隨喜迴向心者，",
        "translation": "Guoshou Shancheng answered Maitreya, saying, Abiding in the bodhisattva vehicle, good men and women who practice profound prajñāpāramitā want to not denigrate the Buddha but give rise to the joyful dedication of",
        "source": "T07n0220_543:0794c23_53"
    },
    {
        "source_sentence": "應作是念：『如諸如來、應、正等覺無障佛眼，通達遍知功德善根有如是性、有如是相、有如是法而可隨喜，",
        "translation": "You should think thus: Just as the unobstructed buddha-eye of all buddhas has such a nature, such a characteristic mark, and such a teaching that it can be relished by those who have attained omniscience, virtue, and good root",
        "source": "T07n0220_543:0794c26_0"
    },
    {
        "source_sentence": "我今亦應如是隨喜；",
        "translation": "I should now likewise follow this joy.",
        "source": "T07n0220_543:0794c28_1"
    },
    {
        "source_sentence": "如諸如來、應、正等覺無障佛眼，通達遍知應以如是諸福業事，迴向無上正等菩提，",
        "translation": "Like the unobstructed eye of all buddhas, they comprehend and know that by means of such meritorious deeds they should dedicate themselves to unsurpassed true enlightenment.",
        "source": "T07n0220_543:0794c28_2"
    },
    {
        "source_sentence": "我今亦應如是迴向。』",
        "translation": "Now, I should also thus dedicate myself back to them.'",
        "source": "T07n0220_543:0795a01_3"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，於諸如來、應、正等覺及弟子等功德善根，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle have virtuous good roots like those of the buddhas, arhats, true enlightened ones, and their disciples.",
        "source": "T07n0220_543:0795a02_4"
    },
    {
        "source_sentence": "應作如是隨喜迴向。",
        "translation": "You should thus follow the joyful dedication of merit.",
        "source": "T07n0220_543:0795a03_5"
    },
    {
        "source_sentence": "若作如是隨喜迴向則不謗佛，諸佛世尊同所隨喜。",
        "translation": "If someone makes such a joyful dedication of merit, they won't denigrate the Buddha, and the buddhas and world-honored ones are the same as those who follow it.",
        "source": "T07n0220_543:0795a04_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩如是隨喜迴向之心，不雜眾毒離諸過咎，名正名善隨喜迴向，",
        "translation": "“This is the dedication of great enlightening beings who are thus joyfully dedicating their minds, not mixing in all poisons or blameworthiness.",
        "source": "T07n0220_543:0795a05_7"
    },
    {
        "source_sentence": "稱真法界，意樂勝解俱善圓滿。",
        "translation": "It's called the true Dharma realm, which is well-completed by both aspiration and resolve and resolve.",
        "source": "T07n0220_543:0795a07_8"
    },
    {
        "source_sentence": "「復次，大士！",
        "translation": "Furthermore, great man!",
        "source": "T07n0220_543:0795a07_9"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等行深般若波羅蜜多，於諸如來、應、正等覺及弟子等功德善根，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle and practice profound prajñāpāramitā have good roots of virtue like the Tathāgata, Arhat, Perfectly Enlightened One, and their disciples.",
        "source": "T07n0220_543:0795a08_10"
    },
    {
        "source_sentence": "應作如是隨喜迴向：『如佛戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊及諸餘法，",
        "translation": "“Furthermore, reverence should be given in this way: just as to the Buddha’s aggregates of morality, concentration, wisdom, liberation, knowledge and vision of liberation, and other factors.",
        "source": "T07n0220_543:0795a10_11"
    },
    {
        "source_sentence": "不墮三界非三世攝，隨喜迴向亦應如是。",
        "translation": "Not falling into the three realms is not included in the three time periods. The same applies to joyful dedication of merit.",
        "source": "T07n0220_543:0795a11_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0795a12_13"
    },
    {
        "source_sentence": "如彼諸法自性空故，不墮三界非三世攝，隨喜迴向亦復如是。",
        "translation": "Just as the self-nature of these dharmas is empty, they don't fall into the three realms and aren't included in the three times, so it's likewise with joyful dedication.",
        "source": "T07n0220_543:0795a13_14"
    },
    {
        "source_sentence": "謂諸如來自性空故，不墮三界非三世攝；",
        "translation": "It means that because the nature of all buddhas is empty, they do not fall into the three realms and are not included in the three time periods.",
        "source": "T07n0220_543:0795a14_15"
    },
    {
        "source_sentence": "諸佛功德自性空故，不墮三界非三世攝；",
        "translation": "Because buddhas’ virtues are inherently empty, they do not fall into the three realms or belong to the three time periods.",
        "source": "T07n0220_543:0795a15_16"
    },
    {
        "source_sentence": "聲聞、獨覺及人、天等自性空故，不墮三界非三世攝；",
        "translation": "Because the self-natures of śrāvakas, pratyekabuddhas, pratyekabuddhas, humans and gods are empty, they do not fall into the three realms. They are not included in the three time periods.",
        "source": "T07n0220_543:0795a16_17"
    },
    {
        "source_sentence": "彼諸善根自性空故，不墮三界非三世攝；",
        "translation": "Because their roots of goodness are inherently empty, they do not fall into the three realms or belong to the three time periods.",
        "source": "T07n0220_543:0795a17_18"
    },
    {
        "source_sentence": "於彼隨喜自性空故，不墮三界非三世攝；",
        "translation": "Because the self-nature of these satisfactions is emptiness, they do not fall into the three realms or belong to the three time periods.",
        "source": "T07n0220_543:0795a18_19"
    },
    {
        "source_sentence": "所迴向法自性空故，不墮三界非三世攝；",
        "translation": "Because the self-nature of the dharmas they dedicate is void, they do not fall into the three realms and are not included in the three time periods.",
        "source": "T07n0220_543:0795a19_20"
    },
    {
        "source_sentence": "能迴向者自性空故，不墮三界非三世攝。』",
        "translation": "Those who can dedicate themselves back to it because their own nature is empty, so they don't fall into the three realms and aren't included in the three worlds.'",
        "source": "T07n0220_543:0795a20_21"
    },
    {
        "source_sentence": "若菩薩摩訶薩行深般若波羅蜜多時，如實了知諸法性相，不墮三界非三世攝。",
        "translation": "If a bodhisattva-mahāsattva practices the profound prajñāpāramitā, he truly knows the nature and characteristics of dharmas and doesn't fall into the three realms that aren't included in the three times.",
        "source": "T07n0220_543:0795a21_22"
    },
    {
        "source_sentence": "若不墮三界非三世攝，即不可以彼有相為方便、有所得為方便，發生隨喜迴向無上正等菩提。",
        "translation": "If someone doesn't fall into the three realms and aren't included in the three times, that means they can't make it possible for those who have characteristics and those who have attainments to give rise to joyful dedication of themselves back to",
        "source": "T07n0220_543:0795a23_23"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0795a25_24"
    },
    {
        "source_sentence": "以一切法自性不生，若法不生則無所有，不可以彼無所有法隨喜迴向，",
        "translation": "It’s because the self-nature of all things doesn’t arise, and if they don’t arise, then they have no existence. They can’t be joyfully dedicated back to those nonexistent things.",
        "source": "T07n0220_543:0795a25_25"
    },
    {
        "source_sentence": "無所有故，是菩薩摩訶薩如是隨喜迴向無上正等菩提，不雜眾毒無所失壞名大迴向，",
        "translation": "Because it has no existence, this is called great dedication because the bodhisattva Mahāsattva thus joyfully dedicates himself to unsurpassed perfect enlightenment without mixing with poison or losing anything.",
        "source": "T07n0220_543:0795a27_26"
    },
    {
        "source_sentence": "無墮無攝，稱真法界，究竟圓滿。",
        "translation": "The absence of falling and non-acquisition is called the true Dharma realm, which is ultimately perfected.",
        "source": "T07n0220_543:0795a29_27"
    },
    {
        "source_sentence": "「住菩薩乘諸善男子、善女人等，若以有相而為方便，或有所得而為方便，",
        "translation": "“Good men and good women who abide in the bodhisattva vehicle—whether they do so on the basis of marks or on the basis of attainments,",
        "source": "T07n0220_543:0795a29_28"
    },
    {
        "source_sentence": "於諸如來及弟子等功德善根，發生隨喜迴向之心，當知是邪隨喜迴向。",
        "translation": "You should know that the mind that develops joyful dedication of merit and good roots such as those of the Tathāgatas and disciples is wrong joyful dedication.",
        "source": "T07n0220_543:0795b02_29"
    },
    {
        "source_sentence": "此邪隨喜迴向之心，諸佛世尊所不稱讚。",
        "translation": "This mistaken mind of joyful dedication of merit is not praised by the buddhas and world-honored ones.",
        "source": "T07n0220_543:0795b04_30"
    },
    {
        "source_sentence": "若菩薩摩訶薩行深般若波羅蜜多時，作如是念：『如十方界一切如來、應、正等覺如實通達功德善根有如是法，",
        "translation": "“When great enlightening beings practice the profound prajñāpāramitā, they think thus:",
        "source": "T07n0220_543:0795b05_31"
    },
    {
        "source_sentence": "可依此法發生無倒隨喜迴向。",
        "translation": "They can rely on this teaching to give rise to faultless joyful dedication of merit.",
        "source": "T07n0220_543:0795b07_32"
    },
    {
        "source_sentence": "我今亦應依如是法發生隨喜，迴向無上正等菩提，是為正發隨喜迴向。』",
        "translation": "Now, I should also rely on such a teaching to give rise to joy and dedicate myself to unsurpassed correct perfect enlightenment, which is the right way to give rise to joyful dedication.'",
        "source": "T07n0220_543:0795b08_33"
    },
    {
        "source_sentence": "由斯定證無上菩提，轉妙法輪饒益一切。」",
        "translation": "Because of this, they'll surely realize unsurpassed enlightenment and turn the wonderful Dharma wheel to benefit all.",
        "source": "T07n0220_543:0795b10_0"
    },
    {
        "source_sentence": "爾時，世尊讚善現曰：「善哉！",
        "translation": "At that point, the Bhagavān praised Shancheng and said, Good!",
        "source": "T07n0220_543:0795b11_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_543:0795b11_1"
    },
    {
        "source_sentence": "汝今乃能為諸菩薩摩訶薩等作大佛事。",
        "translation": "Now, you're able to perform great buddha-works for bodhisattvas, mahāsattvas, and so forth.",
        "source": "T07n0220_543:0795b11_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0795b12_3"
    },
    {
        "source_sentence": "汝為菩薩摩訶薩等宣說無倒隨喜迴向，如諸如來、應、正等覺通達遍知諸善根等有如是性、有如是相、有如是法，",
        "translation": "“Furthermore, just as the Tathāgatas, Arhats, Perfectly Enlightened Ones have such-and-such natures, such-and-such characteristics, and such-and-such dharmas of",
        "source": "T07n0220_543:0795b12_4"
    },
    {
        "source_sentence": "發生無倒隨喜迴向。",
        "translation": "He gives rise to the unerring joyful dedication of rebirth.",
        "source": "T07n0220_543:0795b15_5"
    },
    {
        "source_sentence": "如是隨喜迴向之心，稱真法界，究竟圓滿，汝今乃能如實宣說。",
        "translation": "Thus, with a mind that joyfully dedicates itself back to the Dharma realm, it's called the true Dharma realm, which is ultimately complete, and now you can truly explain it.",
        "source": "T07n0220_543:0795b15_6"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_543:0795b17_7"
    },
    {
        "source_sentence": "若善男子、善女人等，方便教化殑伽沙數三千大千世界有情，皆令安住十善業道所獲功德，",
        "translation": "“Furthermore, if good men and good women skillfully teach sentient beings in as many great one-thousand worlds as there are sands in the Ganges River so that they will all abide in the virtues attained by the ten path",
        "source": "T07n0220_543:0795b17_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起無倒隨喜迴向，於彼功德為最為勝、為尊為高、為妙為微妙、為上為無上、無等無等等。",
        "translation": "This is the unerring joyful dedication of the bodhisattva-mahāsattva that arises, which is the most superior, honored, high, marvelous, subtle, superior, unsurpassed, unequalled, and peerless",
        "source": "T07n0220_543:0795b19_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0795b22_10"
    },
    {
        "source_sentence": "且置令住十善業道。",
        "translation": "Let's leave them to abide in the ten good paths of action.",
        "source": "T07n0220_543:0795b22_11"
    },
    {
        "source_sentence": "若善男子、善女人等，方便教化殑伽沙數三千大千世界有情，皆令安住四靜慮、四無量、四無色定、五神通所獲功德，",
        "translation": "If good men and good women skillfully teach sentient beings in as many great one-thousand worlds as there are sands in the Ganges, they'll all be made to abide in the four meditations, four immeasurable, four form",
        "source": "T07n0220_543:0795b22_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起無倒隨喜迴向，於彼功德為最為勝、為尊為高、為妙為微妙、為上為無上、無等無等等。",
        "translation": "This is the unerring joyful dedication of the bodhisattva-mahāsattva that arises, which is the most superior, honored, high, marvelous, subtle, superior, unsurpassed, unequalled, and peerless",
        "source": "T07n0220_543:0795b25_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0795b27_14"
    },
    {
        "source_sentence": "且置令住四靜慮等。",
        "translation": "It's also a place where the four meditations are made to abide.",
        "source": "T07n0220_543:0795b27_15"
    },
    {
        "source_sentence": "若善男子、善女人等，方便教化殑伽沙數三千大千世界有情，皆令安住預流果、或一來果、或不還果、或阿羅漢果、或獨覺菩提所獲功德，",
        "translation": "If good men and good women skillfully teach sentient beings in as many great one-thousand worlds as there are sands in the Ganges, they'll all be made to abide in the merit attained by the fruit of stream-winner,",
        "source": "T07n0220_543:0795b28_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起無倒隨喜迴向，於彼功德，為最為勝、為尊為高、為妙為微妙、為上為無上、無等無等等。",
        "translation": "This is the unerring joyful dedication of the bodhisattva-mahāsattva that arises, which is unsurpassed, honored, high, marvelous, subtle, superior, unsurpassed, unequalled, and peerless",
        "source": "T07n0220_543:0795c02_17"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0795c04_18"
    },
    {
        "source_sentence": "且置令住預流果等。",
        "translation": "It's like the fruit of causing someone to abide in pre-flow and so forth.",
        "source": "T07n0220_543:0795c05_19"
    },
    {
        "source_sentence": "假使如是殑伽沙數三千大千世界有情，皆成預流、一來、不還、阿羅漢果、獨覺菩提所有功德，",
        "translation": "Suppose all these sentient beings in the great manifold cosmos, numbering as many as grains of sand in the Ganges River, were to attain the qualities of stream-enterer, once-returner, irreversibility, arhatship,",
        "source": "T07n0220_543:0795c05_20"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起無倒隨喜迴向，於彼功德為最為勝、為尊為高、為妙為微妙、為上為無上、無等無等等。",
        "translation": "This is the unerring joyful dedication of the bodhisattva-mahāsattva that arises, which is the most superior, honored, high, marvelous, subtle, superior, unsurpassed, unequalled, and peerless",
        "source": "T07n0220_543:0795c07_21"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_543:0795c10_22"
    },
    {
        "source_sentence": "且置如是預流果等所有功德。",
        "translation": "It's also the merit of such qualities as the fruit of pre-flow and so forth.",
        "source": "T07n0220_543:0795c10_23"
    },
    {
        "source_sentence": "假使十方殑伽沙數三千大千世界有情，皆發無上正等覺心。",
        "translation": "Suppose there are sentient beings in 3,000 great one-thousand worlds of sands in the ten directions who all give rise to the mind of unsurpassed perfect enlightenment.",
        "source": "T07n0220_543:0795c11_24"
    },
    {
        "source_sentence": "設有十方殑伽沙數三千大千世界有情，一一於彼諸菩薩所，皆以上妙衣服、飲食、臥具、醫藥及無量種上妙樂具，",
        "translation": "Suppose there were sentient beings in the great manifold cosmos, as numerous as the grains of sand in the Ganges River in the ten directions, and each of them came to those enlightening beings with such beautiful clothing, food and drink, be",
        "source": "T07n0220_543:0795c12_25"
    },
    {
        "source_sentence": "經如殑伽沙數大劫，以有所得而為方便，供養恭敬、尊重讚歎，於意云何？",
        "translation": "What do you think it is like when, for eons as numerous as grains of sand in the Ganges River, you make offerings to those who have attained enlightenment with skillful means, honoring and venerating them and praising them?",
        "source": "T07n0220_543:0795c15_0"
    },
    {
        "source_sentence": "是諸有情由此因緣得福多不？」",
        "translation": "Is this the cause by which sentient beings attain much merit?",
        "source": "T07n0220_543:0795c16_1"
    },
    {
        "source_sentence": "善現答言：「甚多！",
        "translation": "Sunetra replied, Very much so!",
        "source": "T07n0220_543:0795c17_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_543:0795c17_3"
    },
    {
        "source_sentence": "甚多！",
        "translation": "Very much so!",
        "source": "T07n0220_543:0795c17_4"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T07n0220_543:0795c17_5"
    },
    {
        "source_sentence": "如是福聚若有形色，十方各如殑伽沙界不能容受。」",
        "translation": "Thus, if such a cluster of merit has form and form, each of the ten directions is like the sands of the Ganges that can't be contained.",
        "source": "T07n0220_543:0795c18_6"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_543:0795c19_7"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_543:0795c19_8"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_543:0795c19_9"
    },
    {
        "source_sentence": "若菩薩乘諸善男子、善女人等，於諸如來、應、正等覺及弟子等功德善根，",
        "translation": "“Good men and good women of the enlightening beings’ vehicle, if they have roots of goodness such as the virtues of buddhas, truly enlightened ones, and disciples,",
        "source": "T07n0220_543:0795c19_10"
    },
    {
        "source_sentence": "發起無倒隨喜迴向，所獲功德甚多於前無量無數算數譬喻所不能及。",
        "translation": "The merit gained from the unerring joyful dedication of arousal is so great that it's beyond measureless, countless, and calculated metaphors like the previous one.",
        "source": "T07n0220_543:0795c21_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_543:0795c23_12"
    },
    {
        "source_sentence": "此菩薩乘善男子等所起無倒隨喜迴向，以無所得而為方便，甚深般若波羅蜜多方便善巧所攝受故，",
        "translation": "This is the unerring joyful dedication of these bodhisattva-vehicle good men and so forth that they give rise to, which is based on skillful means without obtaining anything, because it's subsumed by the skillful means",
        "source": "T07n0220_543:0795c23_13"
    },
    {
        "source_sentence": "稱法界故，最勝無比。",
        "translation": "It's called the Dharma realm because it's the most superior and peerless.",
        "source": "T07n0220_543:0795c25_14"
    },
    {
        "source_sentence": "彼諸有情所獲福聚，以有所得為方便故，於此所起隨喜迴向，百分不及一，",
        "translation": "Because the accumulation of merit obtained by those sentient beings is a method for attaining something to be gained, they give it back with joy, but less than one-thousandth of it.",
        "source": "T07n0220_543:0795c26_15"
    },
    {
        "source_sentence": "千分不及一，乃至鄔波尼殺曇分亦不及一。」",
        "translation": "A thousand parts doesn't amount to one, and even the part of Upanisakṣatra doesn't amount to one.",
        "source": "T07n0220_543:0795c28_0"
    },
    {
        "source_sentence": "爾時，四大天王各與眷屬二萬天子俱，頂禮佛足，合掌恭敬白言：「世尊！",
        "translation": "At that point, the four great celestial kings of heaven and their retinues, accompanied by 20,000 celestial beings, bowed at the Buddha's feet, joined their palms in respect, and said, Bhagavān!",
        "source": "T07n0220_543:0795c29_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起無倒隨喜迴向，以無所得而為方便，甚深般若波羅蜜多方便善巧所攝受故，",
        "translation": "This is the unerring joyful dedication of the bodhisattva-mahāsattva's initiation, which is based on skillful means that has nothing to gain, because it's taken in by the skillful means of the profound prajñ",
        "source": "T07n0220_543:0796a01_1"
    },
    {
        "source_sentence": "威力廣大稱真法界，疾能證得一切智智，勝前所說有所得施，無量倍數不可為比。」",
        "translation": "His authoritative power is so vast as to be called the true Dharma realm, and he's quickly able to realize omniscience and cognition, surpassing the previously explained gift of having attained it in measureless ways that can't be compared.",
        "source": "T07n0220_543:0796a03_2"
    },
    {
        "source_sentence": "時，天帝釋乃至他化自在天王，各與眷屬十萬天子俱，皆持種種天妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇，",
        "translation": "At that time the lord of gods, Indra and so on, up to the king of the Paranirmitavaśavartin gods, each accompanied by one hundred thousand celestial beings from their retinues, all carried heavenly garlands",
        "source": "T07n0220_543:0796a05_3"
    },
    {
        "source_sentence": "奏天樂音以奉施佛，供養恭敬、尊重讚歎，頂禮佛足，合掌白言：「是菩薩摩訶薩所起無倒隨喜迴向，",
        "translation": "They played heavenly music to present it to the Buddha, paid homage, honored and venerated him, bowed their heads at his feet, joined their palms, and said, This is the irreproachable dedication of joy that the enlightening",
        "source": "T07n0220_543:0796a08_4"
    },
    {
        "source_sentence": "以無所得而為方便，甚深般若波羅蜜多方便善巧所攝受故，威力廣大稱真法界，",
        "translation": "Because it's skillfully grasped by the profound prajñāpāramitā of skillful means, its authoritative power is so vast that it's called the true Dharma realm.",
        "source": "T07n0220_543:0796a10_5"
    },
    {
        "source_sentence": "疾能證得一切智智，勝前所說有所得施，無量倍數不可為比。」",
        "translation": "They can quickly realize omniscience and cognition, which is superior to the previously explained attainable gifts that are immeasurable and cannot be compared.",
        "source": "T07n0220_543:0796a12_6"
    },
    {
        "source_sentence": "時，大梵天廣說乃至色究竟天各與無量百千天眾，前詣佛所，頂禮佛足，",
        "translation": "The great brahma gods then explained in detail, up to the ultimate form gods, each accompanied by an immeasurable hundred thousand celestial beings, came before the Buddha and bowed at his feet.",
        "source": "T07n0220_543:0796a13_7"
    },
    {
        "source_sentence": "合掌恭敬俱發聲言：「希有！",
        "translation": "They joined their palms in respect and said, Rarely!",
        "source": "T07n0220_543:0796a15_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_543:0796a16_9"
    },
    {
        "source_sentence": "甚奇！",
        "translation": "How marvelous!",
        "source": "T07n0220_543:0796a16_10"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T07n0220_543:0796a16_11"
    },
    {
        "source_sentence": "是菩薩摩訶薩所起無倒隨喜迴向，以無所得而為方便，甚深般若波羅蜜多方便善巧所攝受故，",
        "translation": "This is the unerring joyful dedication of the bodhisattva-mahāsattva's initiation, which is based on skillful means that has nothing to gain, because it's taken in by the skillful means of the profound prajñ",
        "source": "T07n0220_543:0796a16_12"
    },
    {
        "source_sentence": "威力廣大稱真法界，疾能證得一切智智，勝前所說有所得施，無量倍數不可為比。」",
        "translation": "His authoritative power is so vast as to be called the true Dharma realm, and he's quickly able to realize omniscience and cognition, surpassing the previously explained gift of having attained it in measureless ways that can't be compared.",
        "source": "T07n0220_543:0796a18_13"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百四十三",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 3",
        "source": "T07n0220_543:0796a21_0"
    }
]