[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 1",
        "source": "T07n0220_411:0057b06_0"
    },
    {
        "source_sentence": "十一",
        "translation": "eleven",
        "source": "T07n0220_411:0057b07_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_411:0057b09_0"
    },
    {
        "source_sentence": "第二分譬喻品第十一",
        "translation": "Chapter Eleven of the Parable of the Second Part",
        "source": "T07n0220_411:0057b10_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_411:0057b11_0"
    },
    {
        "source_sentence": "言菩薩者是何句義？」",
        "translation": "What's the meaning of this phrase that says bodhisattva?",
        "source": "T07n0220_411:0057b11_1"
    },
    {
        "source_sentence": "佛告善現：「無句義是菩薩句義。",
        "translation": "The Buddha told Shancheng, The meaning of the absence of words is the meaning of the bodhisattva's words.",
        "source": "T07n0220_411:0057b12_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_411:0057b12_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0057b13_4"
    },
    {
        "source_sentence": "菩提、薩埵二既不生，句於其中理亦非有故，無句義是菩薩句義。",
        "translation": "Since the two bodhi and sattva don't arise, the meaning of words doesn't exist in principle, and the absence of words is the meaning of the bodhisattva's words.",
        "source": "T07n0220_411:0057b13_5"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057b14_6"
    },
    {
        "source_sentence": "譬如空中鳥跡句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “footprints of birds in the sky” really has no existence, similarly does the meaning of the phrase “bodhisattva” really have no existence.",
        "source": "T07n0220_411:0057b14_7"
    },
    {
        "source_sentence": "譬如夢境、幻事、陽焰、光影、水月、響聲、空花、變化句義實無所有，",
        "translation": "It's like a dream object, an illusory thing, a mirage, a sunbeam, a light, a shadow, the moon in water, sounds, flowers in space, and phrases and meanings of transformation really have no existence.",
        "source": "T07n0220_411:0057b16_8"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0057b17_9"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057b18_10"
    },
    {
        "source_sentence": "如一切法真如句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the words and meanings of all truths of all things really have no existence, so also do the words and meanings of enlightening beings really have no existence.",
        "source": "T07n0220_411:0057b18_11"
    },
    {
        "source_sentence": "如一切法法界、法性、不虛妄性、不變異性、法定、法住、實際句義實無所有，",
        "translation": "“Just as all things have no existence in the reality realm of reality, in the nature of reality, in non-falsity, in unchangingness, in dissimilarity, in legality, in the abiding of phenomena, and in",
        "source": "T07n0220_411:0057b20_12"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0057b21_13"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057b22_14"
    },
    {
        "source_sentence": "如幻士色句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “form of illusionist” really has no existence, so too does the meaning of the phrase “bodhisattva” really have no existence.",
        "source": "T07n0220_411:0057b22_15"
    },
    {
        "source_sentence": "如幻士受、想、行、識句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the words sensation, perception, volition, and consciousness really don't exist in an illusory person, so does the meaning of the bodhisattva's words really have no existence.",
        "source": "T07n0220_411:0057b24_0"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057b25_1"
    },
    {
        "source_sentence": "如幻士眼處句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase at the locus of an illusionist’s eye really has no existence, so too does the meaning of a phrase by an enlightening being really have no existence.",
        "source": "T07n0220_411:0057b25_2"
    },
    {
        "source_sentence": "如幻士耳、鼻、舌、身、意處句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the words and meanings of an illusionist's ear, nose, tongue, body, and mind are truly nonexistent, so is the meaning of a bodhisattva's words and meaning really nonexistent.",
        "source": "T07n0220_411:0057b27_3"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057b28_4"
    },
    {
        "source_sentence": "如幻士色處句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase in the realm of illusionist form has no existence, so too does the meaning of an enlightening being’s phrase really have no existence.",
        "source": "T07n0220_411:0057b28_5"
    },
    {
        "source_sentence": "如幻士聲、香、味、觸、法處句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the words and meanings of an illusionist's sounds, odors, tastes, tactile sensations, and dharmas really don't exist, so too do the words and meanings of a bodhisattva's words and meanings",
        "source": "T07n0220_411:0057c01_6"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c02_7"
    },
    {
        "source_sentence": "如幻士眼界句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase in the eye realm of an illusionist really has no existence, so too does the meaning of a phrase in the enlightening being’s words really have no existence.",
        "source": "T07n0220_411:0057c03_8"
    },
    {
        "source_sentence": "如幻士耳、鼻、舌、身、意界句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the phrases in the illusionist's ear, nose, tongue, body, and mind realms really have no existence, so too does the meaning of the bodhisattva's words really have no existence.",
        "source": "T07n0220_411:0057c04_9"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c06_0"
    },
    {
        "source_sentence": "如幻士色界句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a magician’s phrase in the realm of form really has no existence, so also does the meaning of an enlightening being’s phrase really have no existence.",
        "source": "T07n0220_411:0057c06_1"
    },
    {
        "source_sentence": "如幻士聲、香、味、觸、法界句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the illusionist's words for sound, odor, taste, touch, and the Dharma realm really lack existence, so too does the meaning of the bodhisattva's words really lack existence.",
        "source": "T07n0220_411:0057c07_2"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c09_3"
    },
    {
        "source_sentence": "如幻士眼識界句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase in the realm of illusionist vision and consciousness really has no existence, so too does the meaning of a phrase in enlightening beings’ bodhisattvas’ words really have no existence.",
        "source": "T07n0220_411:0057c09_4"
    },
    {
        "source_sentence": "如幻士耳、鼻、舌、身、意識界句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the phrases in the illusionist's ear, nose, tongue, body, and consciousness realms really have no existence, so too does the meaning of the bodhisattva's phrase truly have no existence.",
        "source": "T07n0220_411:0057c10_5"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c12_6"
    },
    {
        "source_sentence": "如幻士眼觸句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “illusionist eye contact” really has no existence, so also does the meaning of the phrase “bodhisattva” really have no existence.",
        "source": "T07n0220_411:0057c12_7"
    },
    {
        "source_sentence": "如幻士耳、鼻、舌、身、意觸句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the words and meanings of an illusionist's ear, nose, tongue, body, and mind touch really don't exist, so too do the words and meanings of a bodhisattva's phrase really don't exist.",
        "source": "T07n0220_411:0057c14_8"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c15_9"
    },
    {
        "source_sentence": "如幻士眼觸為緣所生諸受句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the words “illusionist” and “sensation” that arise from visual contact as supporting object really has no existence, so too does the meaning of the words “enlightening being” and “bodhisattva” really have no",
        "source": "T07n0220_411:0057c15_10"
    },
    {
        "source_sentence": "如幻士耳、鼻、舌、身、意觸為緣所生諸受句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the words and meanings of the illusionist's ear, nose, tongue, body, and mind sensations that arise from contact as a condition really have no existence, so too does the meaning of the bodhisattva's words and",
        "source": "T07n0220_411:0057c17_11"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c19_12"
    },
    {
        "source_sentence": "如幻士無明句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “illusionist ignorance” really has no existence, so also does the meaning of the phrase “bodhisattva” really have no existence.",
        "source": "T07n0220_411:0057c19_13"
    },
    {
        "source_sentence": "如幻士行、識、名色、六處、觸、受、愛、取、有、生、老死句義實無所有，",
        "translation": "“Just as the words ‘form,’ ‘consciousness,’ ‘forming consciousness,’ ‘form of name and form,’ ‘six sense-fields,’ ‘contact,’ ‘sensation,’ ‘craving,’ ‘grasping",
        "source": "T07n0220_411:0057c21_14"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0057c22_15"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c23_16"
    },
    {
        "source_sentence": "如幻士行內空句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “emptiness” within the action of an illusionist really has no existence, so too does the meaning of the enlightening being’s phrase ‘emptiness’ also really have no existence.",
        "source": "T07n0220_411:0057c23_17"
    },
    {
        "source_sentence": "如幻士行外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散空、無變異空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空句義實無所有，",
        "translation": "Just as the illusionist practices external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness without change, emptiness",
        "source": "T07n0220_411:0057c24_18"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0057c28_19"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0057c29_20"
    },
    {
        "source_sentence": "如幻士行四念住句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of words and phrases practiced by magicians in the four abodes of mindfulness really have no existence, so too does the meaning of words and phrases practiced by enlightening beings really have no existence.",
        "source": "T07n0220_411:0057c29_21"
    },
    {
        "source_sentence": "如幻士行四正斷、四神足、五根、五力、七等覺支、八聖道支句義實無所有，",
        "translation": "“Just as the magician practices the four kinds of right abandonment, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path have no real meaning",
        "source": "T07n0220_411:0058a01_22"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058a03_23"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_411:0058a04_24"
    },
    {
        "source_sentence": "如幻士乃至行佛十力句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the words and meanings of magicians or even buddhas’ ten powers really have no existence, so also do the words and meanings of enlightening beings truly have no existence.",
        "source": "T07n0220_411:0058a04_25"
    },
    {
        "source_sentence": "如幻士行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法句義實無所有，",
        "translation": "Like an illusionist who practices the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the meaning of the eighteen unique qualities of buddha",
        "source": "T07n0220_411:0058a06_0"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058a07_1"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0058a09_0"
    },
    {
        "source_sentence": "如佛色句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of buddha-form really has no existence, so also does the meaning of enlightening beings’ words really have no existence.",
        "source": "T07n0220_411:0058a09_1"
    },
    {
        "source_sentence": "如佛受、想、行、識句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the Buddha's phrase for feeling, perception, volition, and consciousness really has no existence, so too does the meaning of the bodhisattva's phrase have no existence in reality.",
        "source": "T07n0220_411:0058a10_2"
    },
    {
        "source_sentence": "如佛眼處句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase at the point of the Buddha’s eye really has no existence, so too does the meaning of an enlightening being’s phrase really have no existence.",
        "source": "T07n0220_411:0058a11_3"
    },
    {
        "source_sentence": "如佛耳、鼻、舌、身、意處句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the phrases in the Buddha's ear, nose, tongue, body, and mind really have no existence, so too does the meaning of the bodhisattva's phrase also really have no existence.",
        "source": "T07n0220_411:0058a13_4"
    },
    {
        "source_sentence": "如佛色處句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of phrases in buddha-form really has no existence, so too does the meaning of phrases in enlightening beings’ discourses really have no existence.",
        "source": "T07n0220_411:0058a14_5"
    },
    {
        "source_sentence": "如佛聲、香、味、觸、法處句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the words and meanings of the Buddha's sounds, odors, tastes, tactile sensations, and dharmas really have no existence, so too does the meaning of the bodhisattva's words and meanings really have no existence",
        "source": "T07n0220_411:0058a16_0"
    },
    {
        "source_sentence": "如佛眼界句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase in the Buddha’s eye realm really has no existence, so too does the meaning of a phrase in an enlightening being’s mind really have no existence.",
        "source": "T07n0220_411:0058a17_1"
    },
    {
        "source_sentence": "如佛耳、鼻、舌、身、意界句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the phrases in the Buddha's ear, nose, tongue, body, and mind realms really has no existence, so does the meaning of the bodhisattva phrase also really have no existence.",
        "source": "T07n0220_411:0058a18_2"
    },
    {
        "source_sentence": "如佛色界句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase in buddha-form really has no existence, so too does the meaning of a phrase in enlightening beings’ practice have no existence.",
        "source": "T07n0220_411:0058a20_3"
    },
    {
        "source_sentence": "如佛聲、香、味、觸、法界句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the Buddha's words for sound, odor, taste, touch, and the Dharma realm really have no existence, so too does the meaning of the bodhisattva's words really have no existence.",
        "source": "T07n0220_411:0058a21_4"
    },
    {
        "source_sentence": "如佛眼識界句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase in the Buddha’s eye, consciousness, and sense element really has no existence, so too does the meaning of a phrase in enlightening beings’ mind have no existence.",
        "source": "T07n0220_411:0058a23_5"
    },
    {
        "source_sentence": "如佛耳、鼻、舌、身、意識界句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the phrases in the Buddha's ear, nose, tongue, body, and consciousness realms really has no existence, so does the meaning of the bodhisattva phrase also really have no existence.",
        "source": "T07n0220_411:0058a24_6"
    },
    {
        "source_sentence": "如佛眼觸句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “Buddha’s eye contact” really has no existence, so also does the meaning of the phrase “enlightening being” really have no existence.",
        "source": "T07n0220_411:0058a26_7"
    },
    {
        "source_sentence": "如佛耳、鼻、舌、身、意觸句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the words that touch the Buddha's ear, nose, tongue, body, and mind really has no existence, so too does the meaning of the bodhisattva's words really have no existence.",
        "source": "T07n0220_411:0058a27_8"
    },
    {
        "source_sentence": "如佛眼觸為緣所生諸受句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of words and phrases that are received by Buddha’s eye contact as supporting object really has no existence, so too does the meaning of words and phrases used by enlightening beings really have no existence.",
        "source": "T07n0220_411:0058a28_9"
    },
    {
        "source_sentence": "如佛耳、鼻、舌、身、意觸為緣所生諸受句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the meaning of the Buddha's words for feelings that arise from contact with the ear, nose, tongue, body, and mind really have no existence, so too does the meaning of the bodhisattva's words really have no existence",
        "source": "T07n0220_411:0058b01_10"
    },
    {
        "source_sentence": "如佛無明句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the Buddha’s phrase “ignorance” really has no existence, so too does the meaning of the enlightening being’s phrase “emptiness” really have no existence.",
        "source": "T07n0220_411:0058b03_11"
    },
    {
        "source_sentence": "如佛行、識、名色、六處、觸、受、愛、取、有、生、老死句義實無所有，",
        "translation": "Just as the meaning of buddha-action, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, old age, and death really have no existence.",
        "source": "T07n0220_411:0058b04_12"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058b06_13"
    },
    {
        "source_sentence": "如佛行內空句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “emptiness within buddha-practice” really has no existence, so too does the meaning of the phrase “bodhisattva practice” really have no existence.",
        "source": "T07n0220_411:0058b06_14"
    },
    {
        "source_sentence": "如佛行外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空句義實無所有，",
        "translation": "Just as the Buddha’s practice is emptiness outside, emptiness inside and out, emptiness of emptiness, great emptiness, ultimate emptiness, emptiness without limit, emptiness dispersed or dispersed, emp",
        "source": "T07n0220_411:0058b08_15"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058b11_16"
    },
    {
        "source_sentence": "如佛行四念住句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase in the Buddha’s practice of the four foundations of mindfulness really has no existence, so too does the meaning of an enlightening being’s phrase really have no existence.",
        "source": "T07n0220_411:0058b12_17"
    },
    {
        "source_sentence": "如佛行四正斷、四神足、五根、五力、七等覺支、八聖道支句義實無所有，",
        "translation": "Just as the Buddha’s practice of the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path really have no meaning",
        "source": "T07n0220_411:0058b13_18"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058b15_19"
    },
    {
        "source_sentence": "乃至如佛行佛十力句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of a phrase “Buddhist practice” or “Buddhist ten powers” really has no existence, so also does the meaning of an enlightening being’s phrase really have no existence.",
        "source": "T07n0220_411:0058b16_20"
    },
    {
        "source_sentence": "如佛行四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法句義實無所有，",
        "translation": "Just as the Buddha practices the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the meaning of the eighteen unique qualities of buddhahood have",
        "source": "T07n0220_411:0058b17_21"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058b19_22"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0058b21_0"
    },
    {
        "source_sentence": "如有為界中無為界句義實無所有，無為界中有為界句義亦實無所有，菩薩句義亦復如是實無所有；",
        "translation": "In the realm of conditioned things, there really is nothing whatsoever to be possessed; in the realm of formlessness, there really is nothing whatsoever to be possessed; in the realm of formlessness, there really is nothing whatso",
        "source": "T07n0220_411:0058b21_1"
    },
    {
        "source_sentence": "如無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "It is like the absence of arising, cessation, non-creation, non-contrivance, non-formation, non-perishing, non-acquisition, non-equanimity, non-defilement, and non-purity",
        "source": "T07n0220_411:0058b23_2"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。」",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058b25_3"
    },
    {
        "source_sentence": "時，具壽善現白佛言：「世尊！",
        "translation": "Guoshou Shancheng then said to the Buddha, Bhagavān!",
        "source": "T07n0220_411:0058b25_4"
    },
    {
        "source_sentence": "如何法無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "What is the true nonexistence of things that are neither produced, nor destroyed, neither created, nor conditioned, neither formed, nor disintegrated, neither acquired, nor abandoned, neither defiled, nor pure?",
        "source": "T07n0220_411:0058b26_5"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有耶？」",
        "translation": "Is the meaning of the bodhisattva's words also truly nonexistent like this?",
        "source": "T07n0220_411:0058b28_6"
    },
    {
        "source_sentence": "佛告善現：「如色乃至識無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "The Buddha said to the good manifestation: Just as form and even consciousness have no arising or ceasing, are neither created nor created, are neither formed nor disintegrated, are neither acquired nor lost, are neither defiled nor pur",
        "source": "T07n0220_411:0058b28_7"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c01_8"
    },
    {
        "source_sentence": "如眼處乃至意處無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Just as the sense-field of the eye or even the sense-field of the mind has no arising and no ceasing, no doing and no doing, no formation and no disintegration, no attainment and no equanimity, no defilement and",
        "source": "T07n0220_411:0058c02_9"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c04_10"
    },
    {
        "source_sentence": "如色處乃至法處無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Just as the form realm and even the Dharma realm have no arising and no ceasing, no creation and no conditioning, no formation and no disintegration, no attainment and no equanimity, no defilement and no purity, and",
        "source": "T07n0220_411:0058c05_11"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c07_12"
    },
    {
        "source_sentence": "如眼界乃至意界無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Just as the meaning of the words “unborn,” “uncreated,” “unconditioned,” “uncompounded,” “unmanifest,” “unchanging,” “ungraspable,” “unobstructed,” “",
        "source": "T07n0220_411:0058c07_13"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c09_14"
    },
    {
        "source_sentence": "如色界乃至法界無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Just as the form realm or even the realm of dharmas has no arising and no ceasing, no creation and no conditioning, no formation and no disintegration, no attainment and no equanimity, no defilement and no pur",
        "source": "T07n0220_411:0058c10_15"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c12_16"
    },
    {
        "source_sentence": "如眼識界乃至意識界無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Just as the element of consciousness of the eye and even the element of consciousness of the mind have no arising and no perishing, no creation and no doing, no formation and no disintegration, no attainment and no equanimity,",
        "source": "T07n0220_411:0058c12_17"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c14_18"
    },
    {
        "source_sentence": "如眼觸乃至意觸無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "“So it is with visual contact and all mental contact that there is neither arising nor ceasing, neither doing nor doing, neither becoming nor disintegrating, neither gaining nor losing, neither attaining nor giving up, neither defile",
        "source": "T07n0220_411:0058c15_19"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c17_20"
    },
    {
        "source_sentence": "如眼觸為緣所生諸受乃至意觸為緣所生諸受無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "“So it is with all the sensations that arise from visual contact as their condition and all the sensations that arise from mental contact as their condition: there is no arising, no passing away, no doing, no doing, no becoming, no becoming, no",
        "source": "T07n0220_411:0058c18_21"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c20_22"
    },
    {
        "source_sentence": "如無明乃至老死無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Just as ignorance and even old age and death have no birth or cessation, are without creation or non-creation, are without formation or destruction, are without attainment or abandonment, are without defilement or purity, the meaning of words really has",
        "source": "T07n0220_411:0058c21_23"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c23_24"
    },
    {
        "source_sentence": "如四念住乃至八聖道支無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Thus, the meaning of the four abodes of mindfulness up to the eightfold noble path that are neither produced nor ceased, unconstructed and unconditioned, without formation and disintegration, without attainment and equanimity, without de",
        "source": "T07n0220_411:0058c24_25"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有；",
        "translation": "Enlightening beings’ phrases and meanings are also truly nonexistent in this way.",
        "source": "T07n0220_411:0058c26_26"
    },
    {
        "source_sentence": "如是乃至如佛十力乃至十八佛不共法無生無滅、無作無為、無成無壞、無得無捨、無染無淨句義實無所有，",
        "translation": "Thus it is, so it is, so it is. The ten powers of buddhas and the eighteen unique qualities of buddhas really have no arising or ceasing, no action or non-action, no becoming or decaying, no attainment",
        "source": "T07n0220_411:0058c26_27"
    },
    {
        "source_sentence": "菩薩句義亦復如是實無所有。",
        "translation": "The meaning of the bodhisattva's words is likewise truly nonexistent.",
        "source": "T07n0220_411:0058c29_28"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0059a01_0"
    },
    {
        "source_sentence": "如四念住乃至八聖道支畢竟淨句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "“Just as the meaning of the phrase ‘utterly pure’ does not really exist in relation to the four foundations of mindfulness or even in relation to the eightfold noble path, so too does the meaning of the phrase ‘bodhisattva’ do not really exist",
        "source": "T07n0220_411:0059a01_1"
    },
    {
        "source_sentence": "如是乃至如佛十力乃至十八佛不共法畢竟淨句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "“The meaning of the phrase ‘utterly pure’ really has no existence, and so does the meaning of the phrase ‘bodhisattva’.",
        "source": "T07n0220_411:0059a03_2"
    },
    {
        "source_sentence": "如我乃至見者句義實無所有，無容有故，菩薩句義亦復如是實無所有；",
        "translation": "“Just as the meaning of ‘I am’ and so on, up to ‘I see,’ really has no existence, because there is no room for it. So too does the meaning of enlightening beings’ words really have no existence.",
        "source": "T07n0220_411:0059a05_3"
    },
    {
        "source_sentence": "如日出時闇冥句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the phrase “dark and dark” at sunrise really has no existence, so too does the meaning of the enlightening being’s phrase mean that it really has no existence.",
        "source": "T07n0220_411:0059a06_4"
    },
    {
        "source_sentence": "如劫盡時諸行句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the phrases and meanings of conditioned forces really have no existence at the end of an eon, so too do the phrases and meanings of enlightening beings really have no existence.",
        "source": "T07n0220_411:0059a08_5"
    },
    {
        "source_sentence": "如諸如來、應、正等覺淨戒蘊中惡戒句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of bad morality is really nonexistent in all the phrases and meanings of the pure precepts within the aggregate of buddhas, enlightening beings, and fully awakened ones, so too is the meaning of enlightening",
        "source": "T07n0220_411:0059a09_6"
    },
    {
        "source_sentence": "如諸如來、應、正等覺靜定蘊中亂心句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of mental states disturbed in the concentration aggregate of buddhas, enlightening beings, and fully awakened ones really do not exist, so also does the meaning of bodhisattvas’ words really have no existence.",
        "source": "T07n0220_411:0059a11_7"
    },
    {
        "source_sentence": "如諸如來、應、正等覺明慧蘊中惡慧句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of bad wisdom phrases really does not exist in the aggregate of enlightened ones, buddhas, arhats, and true enlightening beings, so also does the meaning of bodhisattva phrases really do not exist.",
        "source": "T07n0220_411:0059a13_8"
    },
    {
        "source_sentence": "如諸如來、應、正等覺解脫蘊中繫縛句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of phrases and expressions bound to the liberation aggregates of Buddha, Worthy of Offerings, and Perfectly Enlightened really have no existence, so too does the meaning of phrases and expressions of enlightening being",
        "source": "T07n0220_411:0059a15_9"
    },
    {
        "source_sentence": "如諸如來、應、正等覺解脫智見蘊中非解脫智見句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as in the aggregate vision of knowledge of liberation that is not vision of knowledge of liberation, words and meanings that are not seen by buddhas really have no existence, so also do enlightening beings’ words and meanings really have no",
        "source": "T07n0220_411:0059a17_10"
    },
    {
        "source_sentence": "如日月等大光明中諸闇句義實無所有，菩薩句義亦復如是實無所有；",
        "translation": "Just as the meaning of the words “dark” and “moon,” etc., does not really exist in such great light as the sun or moon, similarly the meanings of the words “dark” and “moon” do not really exist in enl",
        "source": "T07n0220_411:0059a19_11"
    },
    {
        "source_sentence": "如佛光中一切日月星寶火藥及諸天等光明句義實無所有，菩薩句義亦復如是實無所有。",
        "translation": "Just as the words and meanings of all the sun, moons, stars, jewels, fire, medicine, and gods in the Buddha's light really have no existence, so too does the meaning of the bodhisattva's words and meaning",
        "source": "T07n0220_411:0059a21_12"
    },
    {
        "source_sentence": "「何以故？",
        "translation": "“Why is that?",
        "source": "T07n0220_411:0059a23_13"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059a23_14"
    },
    {
        "source_sentence": "若菩提、若薩埵、若菩薩句義，如是一切皆非相應非不相應，無色、無見、無對、一相，",
        "translation": "“None of these things are conjoined or not conjoined with enlightenment, buddhahood, omniscience, or the meaning of an enlightening being; they are formless, formless, formless, formless, formless,",
        "source": "T07n0220_411:0059a23_15"
    },
    {
        "source_sentence": "所謂無相。",
        "translation": "It's called signlessness.",
        "source": "T07n0220_411:0059a25_16"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059a25_17"
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法，皆非實有，無著無礙，當勤修學，應正覺知。」",
        "translation": "Bodhisattvas, mahāsattvas, and bodhisattvas who don't really exist in all dharmas and are unattached and unobstructed should diligently cultivate them and correctly perceive them.",
        "source": "T07n0220_411:0059a25_18"
    },
    {
        "source_sentence": "具壽善現即白佛言：「諸菩薩摩訶薩於何等一切法，皆非實有，無著無礙，",
        "translation": "Guoshou Shancheng then said to the Buddha, “O great enlightening beings! What are all the teachings that do not really exist, which are unattached and unobstructed?",
        "source": "T07n0220_411:0059a27_19"
    },
    {
        "source_sentence": "當勤修學？",
        "translation": "Should you diligently cultivate it?",
        "source": "T07n0220_411:0059a28_20"
    },
    {
        "source_sentence": "諸菩薩摩訶薩云何於一切法應正覺知？」",
        "translation": "How should bodhisattvas and mahāsattvas correctly perceive all dharmas?",
        "source": "T07n0220_411:0059a29_21"
    },
    {
        "source_sentence": "佛告善現：「一切法者，謂善法非善法、有記法無記法、世間法出世間法、有漏法無漏法、有為法無為法、共法不共法。",
        "translation": "The Buddha told Shancheng, All dharmas are good qualities that are not good qualities, indeterminate qualities and indeterminate qualities, worldly qualities that transcend the world, contaminated qualities that are uncontaminated qualities, condition",
        "source": "T07n0220_411:0059b01_22"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059b03_23"
    },
    {
        "source_sentence": "諸菩薩摩訶薩於如是等一切法性無著無礙，當勤修學；",
        "translation": "“Great enlightening beings should diligently cultivate and study the unattached and unobstructed nature of all things as such.",
        "source": "T07n0220_411:0059b03_24"
    },
    {
        "source_sentence": "諸菩薩摩訶薩於一切法實無所有，應正覺知。」",
        "translation": "All bodhisattvas, mahāsattvas, really have nothing in all dharmas, and they should correctly perceive it.",
        "source": "T07n0220_411:0059b05_25"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為世間善法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called a good worldly dharma?",
        "source": "T07n0220_411:0059b06_26"
    },
    {
        "source_sentence": "佛告善現：「世間善法者，謂孝順父母、供養沙門婆羅門、敬事師長，",
        "translation": "The Buddha told Śaṅgālī, Good qualities in the world are filial piety to one’s parents, offering support to śramaṇas and brāhmaṇas, and honoring teachers and elders.",
        "source": "T07n0220_411:0059b07_27"
    },
    {
        "source_sentence": "施性福業事、戒性福業事、修性福業事，供侍病者俱行福、方便善巧俱行福，",
        "translation": "They perform meritorious deeds of generosity, virtuous deeds of morality, and virtuous deeds of cultivation; they perform meritorious deeds to provide for the sick and their care; they perform meritorious deeds of skillful means",
        "source": "T07n0220_411:0059b08_28"
    },
    {
        "source_sentence": "世間十善業道，若膖脹想、膿爛想、青瘀想、異赤想、破壞想、啄噉想、離散想、骸骨想、焚燒想，",
        "translation": "These are the ten good paths of worldly action: perception of swelling, perception of pus, perception of bruises, perception of different colors, perception of disintegration, perception of pecking, perception of dispersal, perception",
        "source": "T07n0220_411:0059b10_29"
    },
    {
        "source_sentence": "若世間四靜慮、四無量、四無色定，若佛隨念、法隨念、僧隨念、戒隨念、捨隨念、天隨念、寂靜隨念、入出息隨念、身隨念、死隨念。",
        "translation": "Suppose the four worldly meditations, the four immeasurable concentrations, and the four formless concentrations are followed by mindfulness of the Buddha, mindfulness of the Dharma, mindfulness of the saṃgha, mindfulness of precepts, mindfulness of equanimity",
        "source": "T07n0220_411:0059b12_30"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059b15_31"
    },
    {
        "source_sentence": "此等名為世間善法。」",
        "translation": "These are called worldly good qualities.",
        "source": "T07n0220_411:0059b15_32"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為不善法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called an unwholesome dharma?",
        "source": "T07n0220_411:0059b16_33"
    },
    {
        "source_sentence": "佛告善現：「不善法者，謂害生命、不與取、欲邪行，虛誑語、離間語、麁惡語、雜穢語，",
        "translation": "The Buddha told Śaṅgālī, An unwholesome dharma is harming life, taking what’s not given, sexual misconduct, false speech, divisive speech, harsh speech, foul speech, and defiled speech.",
        "source": "T07n0220_411:0059b17_0"
    },
    {
        "source_sentence": "貪欲、瞋恚、邪見及忿恨、覆惱、諂誑、矯害、嫉、慳、慢等。",
        "translation": "Desire, anger, wrong views, and anger, obstruction, hypocrisy, deceit, harmfulness, jealousy, stinginess, pride, and so forth.",
        "source": "T07n0220_411:0059b18_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059b20_0"
    },
    {
        "source_sentence": "此等名為不善法。」",
        "translation": "These are called unwholesome dharmas.",
        "source": "T07n0220_411:0059b20_1"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等有記法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's the indeterminate dharma?",
        "source": "T07n0220_411:0059b20_2"
    },
    {
        "source_sentence": "佛告善現：「即諸善法及不善法，名有記法。」",
        "translation": "The Buddha told Shancheng, That is, good qualities and unskillful qualities are called indeterminate qualities.",
        "source": "T07n0220_411:0059b21_3"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為無記法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called an indeterminate dharma?",
        "source": "T07n0220_411:0059b22_4"
    },
    {
        "source_sentence": "佛告善現：「謂無記身業、無記語業、無記意業、無記四大種、無記五根、無記五蘊、無記十二處、無記十八界、無記異熟法。",
        "translation": "The Buddha told Shancheng, They are indeterminate bodily actions, indeterminate verbal actions, indeterminate mental actions, indeterminate four major forms, indeterminate five faculties, indeterminate five aggregates, indeterminate twelve",
        "source": "T07n0220_411:0059b23_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059b25_6"
    },
    {
        "source_sentence": "此等名為無記法。」",
        "translation": "These are called indeterminate dharmas.",
        "source": "T07n0220_411:0059b26_7"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為世間法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called a worldly dharma?",
        "source": "T07n0220_411:0059b26_8"
    },
    {
        "source_sentence": "佛告善現：「謂世間五蘊、十二處、十八界，十業道，四靜慮、四無量、四無色定，",
        "translation": "The Buddha told Śaṅgālī, These are the five aggregates of the world, the twelve abodes and eighteen realms, the ten paths of action, the four meditations, the four immeasurable concentrations, and the four formless",
        "source": "T07n0220_411:0059b27_9"
    },
    {
        "source_sentence": "十二支緣起法。",
        "translation": "The twelve limbs are dependently-arisen dharmas.",
        "source": "T07n0220_411:0059b29_0"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059b29_1"
    },
    {
        "source_sentence": "此等名為世間法。」",
        "translation": "These are called worldly dharmas.",
        "source": "T07n0220_411:0059b29_2"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為出世間法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called an supramundane dharma?",
        "source": "T07n0220_411:0059b29_3"
    },
    {
        "source_sentence": "佛告善現：「謂出世間四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "The Buddha told the good manifestation, These are the four supramundane abodes of mindfulness, the fourfold correct elimination, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the",
        "source": "T07n0220_411:0059c01_4"
    },
    {
        "source_sentence": "空、無相、無願解脫門，未知當知根、已知根、具知根，有尋有伺三摩地、無尋唯伺三摩地、無尋無伺三摩地，",
        "translation": "The liberation gates of emptiness, signlessness, and wishlessness are the faculty of not knowing what should be known, the faculty of knowing what has been known, and the faculty of having full knowledge. There is samādhi",
        "source": "T07n0220_411:0059c03_5"
    },
    {
        "source_sentence": "若明、若解脫，若念、若正知、若如理作意，若八解脫、若九次第定，",
        "translation": "If it's insight, if it's liberation, if it's mindfulness, if it's right knowledge, if it's correctly contemplated, if it's the eight liberations, or if it's the nine graduated concentrations,",
        "source": "T07n0220_411:0059c06_0"
    },
    {
        "source_sentence": "若內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "If internal emptiness, external emptiness, internal and external emptiness, emptiness of emptiness, emptiness of emptiness, great emptiness, ultimate emptiness, emptiness without limit, emptiness dispersed",
        "source": "T07n0220_411:0059c07_1"
    },
    {
        "source_sentence": "若佛十力、四無所畏、四無礙解、十八佛不共法。",
        "translation": "Suppose a buddha has the ten powers, four fearlessnesses, four unhindered understandings, and 18 Buddha-uncommon dharmas.",
        "source": "T07n0220_411:0059c10_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059c11_3"
    },
    {
        "source_sentence": "此等名為出世間法。」",
        "translation": "These are called supramundane dharmas.",
        "source": "T07n0220_411:0059c11_4"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為有漏法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called a contaminated dharma?",
        "source": "T07n0220_411:0059c12_5"
    },
    {
        "source_sentence": "佛告善現：「謂墮三界，若五蘊、十二處、十八界，若四靜慮、四無量、四無色定。",
        "translation": "The Buddha told Shancheng, Suppose he falls into the three realms, which are the five aggregates, 12 places, 18 realms, and the four meditations, 4 immeasurable concentrations, and 4 formless concentrations.",
        "source": "T07n0220_411:0059c13_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059c14_7"
    },
    {
        "source_sentence": "此等名為有漏法。」",
        "translation": "These are called contaminated dharmas.",
        "source": "T07n0220_411:0059c15_0"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為無漏法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called an uncontaminated dharma?",
        "source": "T07n0220_411:0059c15_1"
    },
    {
        "source_sentence": "佛告善現：「謂四念住乃至十八佛不共法。",
        "translation": "The Buddha told Shancheng, These are the four abodes of mindfulness up to the 18 uncommon dharmas of the Buddha.",
        "source": "T07n0220_411:0059c16_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059c17_3"
    },
    {
        "source_sentence": "此等名為無漏法。」",
        "translation": "These are called uncontaminated dharmas.",
        "source": "T07n0220_411:0059c17_4"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為有為法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called a conditioned dharma?",
        "source": "T07n0220_411:0059c17_5"
    },
    {
        "source_sentence": "佛告善現：「謂三界繫法，若五蘊，若四靜慮、四無量、四無色定，若四念住乃至十八佛不共法。",
        "translation": "The Buddha told Shancheng, These are the three bound dharmas of the three realms, whether they are the five aggregates, the four meditations, the four immeasurables, the four formless concentrations, the four abodes of mindfulness,",
        "source": "T07n0220_411:0059c18_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059c20_7"
    },
    {
        "source_sentence": "此等名為有為法。」",
        "translation": "These are called conditioned dharmas.",
        "source": "T07n0220_411:0059c20_8"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為無為法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called the unconditioned dharma?",
        "source": "T07n0220_411:0059c21_9"
    },
    {
        "source_sentence": "佛告善現：「若法無生、無滅、無住、無異，若貪盡、瞋盡、癡盡，若真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際。",
        "translation": "The Buddha told Shancheng, Suppose dharmas are without arising, without ceasing, without abiding, and without change, and if they have ended craving, ended anger, ended delusion, and ended delusion, or if they truly are true",
        "source": "T07n0220_411:0059c22_10"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059c25_11"
    },
    {
        "source_sentence": "此等名為無為法。」",
        "translation": "These are called the unconditioned dharmas.",
        "source": "T07n0220_411:0059c25_12"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為共法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called the common dharma?",
        "source": "T07n0220_411:0059c25_13"
    },
    {
        "source_sentence": "佛告善現：「謂世間四靜慮、四無量、四無色定、五神通。",
        "translation": "The Buddha told Shancheng, These are the four mundane meditations, the four immeasurable concentrations, the four formless concentrations, and the five supernormal powers.",
        "source": "T07n0220_411:0059c26_14"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0059c27_15"
    },
    {
        "source_sentence": "此等名為共法，共異生故。」",
        "translation": "These are called common dharmas because they're shared with different beings.",
        "source": "T07n0220_411:0059c27_16"
    },
    {
        "source_sentence": "具壽善現復白佛言：「何等名為不共法？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's called an uncommon dharma?",
        "source": "T07n0220_411:0059c28_17"
    },
    {
        "source_sentence": "佛告善現：「謂四念住乃至十八佛不共法。",
        "translation": "The Buddha told Shancheng, These are the four abodes of mindfulness up to the 18 uncommon dharmas of the Buddha.",
        "source": "T07n0220_411:0059c29_18"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060a01_19"
    },
    {
        "source_sentence": "此等名為不共法，不共異生故。",
        "translation": "These are called ‘uncommon factors’: because they are not common to the worldlings.",
        "source": "T07n0220_411:0060a01_20"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060a02_21"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，於如是等自相空法不應執著，以一切法無分別故。",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they shouldn't cling to such distinctive characteristics as emptiness because all dharmas lack discrimination.",
        "source": "T07n0220_411:0060a02_22"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060a04_23"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，於一切法以無二為方便，應正覺知，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they should correctly perceive that nonduality is the method for all things.",
        "source": "T07n0220_411:0060a04_24"
    },
    {
        "source_sentence": "以一切法皆無動故。",
        "translation": "It's because all dharmas are motionless.",
        "source": "T07n0220_411:0060a06_25"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060a06_26"
    },
    {
        "source_sentence": "於一切法無二、無動是菩薩句義，無分別、無執著是菩薩句義。",
        "translation": "The absence of duality and motion in all things is the meaning of the bodhisattva's phrase, and the absence of discrimination and attachment is the meaning of the bodhisattva's phrase.",
        "source": "T07n0220_411:0060a06_27"
    },
    {
        "source_sentence": "以是故，無句義是菩薩句義。」",
        "translation": "Because of this, the absence of a phrase is the meaning of the bodhisattva's phrase.",
        "source": "T07n0220_411:0060a08_28"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_411:0060a09_0"
    },
    {
        "source_sentence": "何緣菩薩復名摩訶薩？」",
        "translation": "Why is the bodhisattva again called Mahāsattva?",
        "source": "T07n0220_411:0060a09_1"
    },
    {
        "source_sentence": "佛告善現：「由是菩薩於大有情眾中當為上首故，復名摩訶薩。」",
        "translation": "The Buddha told Shancheng, Because this bodhisattva will be the supreme leader among the great multitude of sentient beings, he's again called a mahāsattva.",
        "source": "T07n0220_411:0060a10_2"
    },
    {
        "source_sentence": "善現白言：「何等名為大有情眾，菩薩於中當為上首？」",
        "translation": "Sunetra said, What's called a great multitude of sentient beings in which the bodhisattva will be the leader?",
        "source": "T07n0220_411:0060a11_3"
    },
    {
        "source_sentence": "佛告善現：「謂住種姓、第八、預流、一來、不還、阿羅漢、獨覺，及從初發心乃至不退轉地菩薩摩訶薩，",
        "translation": "The Buddha told Shancheng, Suppose there are bodhisattvas and mahāsattvas who abide in the eighth, stream-winner, first-comer, nonreturner, arhat, pratyekabuddha, and bodhisattvas and",
        "source": "T07n0220_411:0060a12_4"
    },
    {
        "source_sentence": "如是皆名大有情眾。",
        "translation": "These are all called the great sentient beings.",
        "source": "T07n0220_411:0060a14_5"
    },
    {
        "source_sentence": "菩薩於此大有情眾中當為上首故，復名摩訶薩。」",
        "translation": "Because the bodhisattva will be the supreme leader among these great sentient beings, he's also called mahāsattva.",
        "source": "T07n0220_411:0060a15_6"
    },
    {
        "source_sentence": "具壽善現復白佛言：「如是菩薩何緣能於大有情眾當為上首？」",
        "translation": "Guoshou Shancheng then said to the Buddha, What's the reason a bodhisattva like this is able to be the leader of large groups of sentient beings?",
        "source": "T07n0220_411:0060a16_7"
    },
    {
        "source_sentence": "佛告善現：「由是菩薩已發堅固金剛喻心定不退壞，是故能於大有情眾當為上首。」",
        "translation": "The Buddha told Shancheng, Because this bodhisattva has aroused the adamantine adamantine metaphor of mind that doesn't retreat and breaks down, he's able to be the leader among the great multitude of sentient being",
        "source": "T07n0220_411:0060a17_8"
    },
    {
        "source_sentence": "善現復言：「何謂菩薩金剛喻心？」",
        "translation": "Again, Shancheng said, What's the bodhisattva's adamantine metaphorical mind?",
        "source": "T07n0220_411:0060a19_9"
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩發如是心：『我今當被大功德鎧，無邊生死大曠野中，",
        "translation": "The Buddha told Shancheng, Suppose a bodhisattva Mahāsattva gives rise to the thought, 'Now that I'm wearing the great armor of virtue, I'll be born in the great wilderness of infinite birth and death",
        "source": "T07n0220_411:0060a20_10"
    },
    {
        "source_sentence": "為諸有情破壞一切煩惱怨敵。",
        "translation": "For the sake of sentient beings, he destroys all the afflictions and enemies.",
        "source": "T07n0220_411:0060a22_11"
    },
    {
        "source_sentence": "我當普為一切有情枯竭無邊生死大海。",
        "translation": "I will universally dry up the limitless ocean of birth and death for all sentient beings.",
        "source": "T07n0220_411:0060a23_12"
    },
    {
        "source_sentence": "我當棄捨一切身財為諸有情作大饒益。",
        "translation": "I will abandon all my physical possessions and work for the benefit of sentient beings.",
        "source": "T07n0220_411:0060a24_0"
    },
    {
        "source_sentence": "我當等心利益安樂一切有情。",
        "translation": "I will wholeheartedly benefit and bring comfort to all sentient beings.",
        "source": "T07n0220_411:0060a24_1"
    },
    {
        "source_sentence": "我當普令諸有情類遊三乘道趣般涅槃。",
        "translation": "I will cause all sentient beings to travel the path of the three vehicles and attain parinirvāṇa.",
        "source": "T07n0220_411:0060a25_2"
    },
    {
        "source_sentence": "我當雖以三乘濟度一切有情，而都不見有一有情得滅度者。",
        "translation": "Although I will save all sentient beings with the three vehicles, I won't see any sentient being attain liberation.",
        "source": "T07n0220_411:0060a26_3"
    },
    {
        "source_sentence": "我當覺了一切法性無生無滅、無淨無染。",
        "translation": "I will perceive that the nature of all dharmas is without arising and without ceasing, pure and without stain.",
        "source": "T07n0220_411:0060a28_0"
    },
    {
        "source_sentence": "我當純以一切智智相應作意修行六種波羅蜜多。",
        "translation": "I will simply cultivate the six kinds of perfections with the contemplation associated with omniscience and cognition.",
        "source": "T07n0220_411:0060a28_1"
    },
    {
        "source_sentence": "我當修學於一切法，通達究竟遍入妙智。",
        "translation": "I will cultivate and study all dharmas, comprehending their ultimate pervasiveness and marvelous knowledge.",
        "source": "T07n0220_411:0060b01_2"
    },
    {
        "source_sentence": "我當通達一切法相一理趣門。",
        "translation": "I will comprehend all the characteristics of dharmas as one principle and a path.",
        "source": "T07n0220_411:0060b02_0"
    },
    {
        "source_sentence": "我當通達一切法相二理趣門。",
        "translation": "I will comprehend the two principles and destinies of all dharmas.",
        "source": "T07n0220_411:0060b02_1"
    },
    {
        "source_sentence": "我當通達一切法相多理趣門。",
        "translation": "I will comprehend the many principles and destinies of all dharmas.",
        "source": "T07n0220_411:0060b03_2"
    },
    {
        "source_sentence": "我當修學種種妙智，達諸法性引勝功德。』",
        "translation": "I will cultivate various kinds of marvelous cognition, comprehend the essence of dharmas that lead to superior merit.'",
        "source": "T07n0220_411:0060b04_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060b05_4"
    },
    {
        "source_sentence": "是謂菩薩金剛喻心。",
        "translation": "This is called the bodhisattva's adamantine metaphorical mind.",
        "source": "T07n0220_411:0060b05_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩以無所得而為方便安住此心，決定能於大有情眾當為上首。",
        "translation": "If a bodhisattva Mahāsattva skillfully abides in this mind because he has nothing to gain, he'll surely be the leader among the great multitude of sentient beings.",
        "source": "T07n0220_411:0060b05_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0060b07_7"
    },
    {
        "source_sentence": "諸菩薩摩訶薩發如是心：『一切地獄、傍生、鬼界及人、天中，諸有情類所受苦惱，",
        "translation": "“The great enlightening beings have this thought: All sentient beings in the hells, the animals, the realms of ghosts, humans, and goddesses suffer pain and suffering.",
        "source": "T07n0220_411:0060b07_8"
    },
    {
        "source_sentence": "我當代受令彼安樂。』",
        "translation": "I'll contemporarily accept it and make them comfortable.'",
        "source": "T07n0220_411:0060b09_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩發如是心：『我為饒益一有情故，經於無量百千俱胝那庾多劫，",
        "translation": "“Those bodhisattvas and mahāsattvas had this thought: For the sake of benefiting one sentient being, I spent countless millions of koṭis of eons",
        "source": "T07n0220_411:0060b09_10"
    },
    {
        "source_sentence": "受諸地獄種種重苦，無數方便教化令得無餘涅槃。",
        "translation": "They experience various kinds of heavy suffering in the hells, and they are taught with countless skillful means to attain nirvāṇa without remainder.",
        "source": "T07n0220_411:0060b11_11"
    },
    {
        "source_sentence": "如是次第普為饒益一切有情，為彼一一各經無量百千俱胝那庾多劫，受諸地獄種種重苦，",
        "translation": "In this order, for the benefit of all sentient beings, they spend countless millions of eons in each one of those hells enduring various kinds of pain and suffering.",
        "source": "T07n0220_411:0060b12_12"
    },
    {
        "source_sentence": "一一各以無數方便教化令得無餘涅槃。",
        "translation": "Each one of them teaches and transforms with countless skillful means to attain nirvāṇa without remainder.",
        "source": "T07n0220_411:0060b15_0"
    },
    {
        "source_sentence": "作是事已，自種善根，復經無量百千俱胝那庾多劫，圓滿修集菩提資糧，",
        "translation": "Having done so, they will plant their own roots of goodness for immeasurable hundreds of thousands of koṭis of nayutas of kalpas, perfecting and accumulating the requisites for enlightenment.",
        "source": "T07n0220_411:0060b15_1"
    },
    {
        "source_sentence": "然後方證所求無上正等菩提。』",
        "translation": "Only then will they realize the unsurpassed perfect enlightenment that they seek.'",
        "source": "T07n0220_411:0060b17_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060b18_3"
    },
    {
        "source_sentence": "如是誓願亦名菩薩金剛喻心。",
        "translation": "Such a vow is also called the bodhisattva's adamantine metaphorical mind.",
        "source": "T07n0220_411:0060b18_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩以無所得而為方便安住此心，決定能於大有情眾當為上首。",
        "translation": "If a bodhisattva Mahāsattva skillfully abides in this mind because he has nothing to gain, he'll surely be the leader among the great multitude of sentient beings.",
        "source": "T07n0220_411:0060b19_5"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0060b21_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩恒常發起勝心大心，由此心故，決定能於大有情眾當為上首。」",
        "translation": "The bodhisattvas, mahāsattvas, always and constantly give rise to the great mind of superiority, and because of this mind, they're certain to be the leaders among the great multitude of sentient beings.",
        "source": "T07n0220_411:0060b21_1"
    },
    {
        "source_sentence": "具壽善現白言：「世尊！",
        "translation": "Guoshou Shancheng said, Bhagavān!",
        "source": "T07n0220_411:0060b23_0"
    },
    {
        "source_sentence": "何謂菩薩勝心大心？」",
        "translation": "What's meant by the great mind of the bodhisattva's superior mind?",
        "source": "T07n0220_411:0060b23_1"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩發如是心：『我應從初發心乃至證得一切智智，",
        "translation": "The Buddha told the good manifestation, All bodhisattvas and mahāsattvas give rise to this thought: 'Should I attain omniscience from the first arousal of mind up to the realization of omniscience?'",
        "source": "T07n0220_411:0060b23_2"
    },
    {
        "source_sentence": "定當不起貪欲、瞋恚、愚癡、忿恨、覆惱、諂誑、嫉慳、矯害、見慢等心，",
        "translation": "They must not give rise to thoughts of desire, anger, hatred, ignorance, wrath, malice, hypocrisy, covetousness, jealousy, deceitfulness, harmfulness, and pride.",
        "source": "T07n0220_411:0060b25_3"
    },
    {
        "source_sentence": "亦定不起趣求聲聞、獨覺地心。』",
        "translation": "Nor does he necessarily give rise to the mind that doesn't aspire to the stage of śrāvakas and pratyekbuddhas.'",
        "source": "T07n0220_411:0060b27_0"
    },
    {
        "source_sentence": "是為菩薩勝心大心。",
        "translation": "This is the great mind of the bodhisattva's superior mind.",
        "source": "T07n0220_411:0060b27_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩以無所得而為方便安住此心，決定能於大有情眾當為上首。",
        "translation": "If a bodhisattva Mahāsattva skillfully abides in this mind because he has nothing to gain, he'll surely be the leader among the great multitude of sentient beings.",
        "source": "T07n0220_411:0060b28_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0060b29_3"
    },
    {
        "source_sentence": "諸菩薩摩訶薩發起決定不傾動心，由此心故，決定能於大有情眾當為上首。」",
        "translation": "The bodhisattvas, mahāsattvas, give rise to a mind that's certain and not tilted, and because of this mind, they're certain to be the leaders of the great multitude of sentient beings.",
        "source": "T07n0220_411:0060c01_4"
    },
    {
        "source_sentence": "具壽善現白言：「世尊！",
        "translation": "Guoshou Shancheng said, Bhagavān!",
        "source": "T07n0220_411:0060c03_0"
    },
    {
        "source_sentence": "何謂菩薩不傾動心？」",
        "translation": "What does it mean for a bodhisattva not to tilt his mind?",
        "source": "T07n0220_411:0060c03_1"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩發如是心：『我應常依一切智智相應作意，",
        "translation": "The Buddha told the good manifestation, All bodhisattvas and mahāsattvas give rise to this thought:",
        "source": "T07n0220_411:0060c03_2"
    },
    {
        "source_sentence": "修習發起一切所修、所作事業而無憍逸。』",
        "translation": "He cultivates and initiates all the works he cultivates and does without stinginess.'",
        "source": "T07n0220_411:0060c05_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060c06_4"
    },
    {
        "source_sentence": "是謂菩薩不傾動心。",
        "translation": "This is called a bodhisattva's mind that doesn't incline.",
        "source": "T07n0220_411:0060c06_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩以無所得而為方便安住此心，決定能於大有情眾當為上首。",
        "translation": "If a bodhisattva Mahāsattva skillfully abides in this mind because he has nothing to gain, he'll surely be the leader among the great multitude of sentient beings.",
        "source": "T07n0220_411:0060c07_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0060c08_7"
    },
    {
        "source_sentence": "諸菩薩摩訶薩普於一切諸有情類，平等發起真利樂心，由此心故，決定能於大有情眾當為上首。」",
        "translation": "All bodhisattvas, mahāsattvas, and all kinds of sentient beings equally give rise to the mind of true benefit and happiness, and because of this mind, they're certain to be the leaders of the great multitude of sentient being",
        "source": "T07n0220_411:0060c09_8"
    },
    {
        "source_sentence": "具壽善現白言：「世尊！",
        "translation": "Guoshou Shancheng said, Bhagavān!",
        "source": "T07n0220_411:0060c11_9"
    },
    {
        "source_sentence": "何謂菩薩真利樂心？」",
        "translation": "What's meant by a bodhisattva's mind of true benefit and happiness?",
        "source": "T07n0220_411:0060c11_10"
    },
    {
        "source_sentence": "佛告善現：「諸菩薩摩訶薩發如是心：『我當決定窮未來際，利益安樂一切有情，",
        "translation": "The Buddha told the good manifestation, All bodhisattvas and mahāsattvas give rise to this thought:",
        "source": "T07n0220_411:0060c12_11"
    },
    {
        "source_sentence": "為作歸依、洲渚、舍宅，常不捨離。』",
        "translation": "In order to make refuge, islands, and dwellings, they always don't abandon them.'",
        "source": "T07n0220_411:0060c14_12"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060c14_13"
    },
    {
        "source_sentence": "是謂菩薩真利樂心。",
        "translation": "This is called a bodhisattva's mind of true benefit and happiness.",
        "source": "T07n0220_411:0060c14_14"
    },
    {
        "source_sentence": "若菩薩摩訶薩以無所得而為方便安住此心，決定能於大有情眾當為上首。",
        "translation": "If a bodhisattva Mahāsattva skillfully abides in this mind because he has nothing to gain, he'll surely be the leader among the great multitude of sentient beings.",
        "source": "T07n0220_411:0060c15_15"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0060c17_16"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多，常勤精進愛法、樂法、欣法、憙法，",
        "translation": "“When great enlightening beings practice the perfection of wisdom, they always diligently apply themselves with love for truth, joy in truth, delight in truth, delight in truth, and hatred for truth.",
        "source": "T07n0220_411:0060c17_17"
    },
    {
        "source_sentence": "由此因緣，決定能於大有情眾當為上首。」",
        "translation": "Because of these causes and conditions, they'll surely be the leaders among the great multitude of sentient beings.",
        "source": "T07n0220_411:0060c18_18"
    },
    {
        "source_sentence": "具壽善現白言：「世尊！",
        "translation": "Guoshou Shancheng said, Bhagavān!",
        "source": "T07n0220_411:0060c19_19"
    },
    {
        "source_sentence": "何等為法？",
        "translation": "What are their dharmas?",
        "source": "T07n0220_411:0060c20_20"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修行般若波羅蜜多時，常於此法愛樂欣喜？」",
        "translation": "How does a bodhisattva-mahāsattva always delight and rejoice in this teaching when he cultivates the perfection of wisdom?",
        "source": "T07n0220_411:0060c20_21"
    },
    {
        "source_sentence": "佛告善現：「所言法者，謂色非色皆無自性，都不可得，不可破壞，不可分別，",
        "translation": "The Buddha said to Kalyāṇa-jātika: What I call “dharma” means that form and formlessness have no self-nature. They are ungraspable, indestructible, and indistinguishable.",
        "source": "T07n0220_411:0060c22_22"
    },
    {
        "source_sentence": "是名為法。",
        "translation": "This is called a teaching.",
        "source": "T07n0220_411:0060c23_23"
    },
    {
        "source_sentence": "言愛法者，謂於此法起欲希求；",
        "translation": "The expression “one who loves the doctrine” means to give rise to desire and longing for this doctrine.",
        "source": "T07n0220_411:0060c24_24"
    },
    {
        "source_sentence": "言樂法者，謂於此法稱讚功德；",
        "translation": "The expression happiness in the doctrine means to praise the virtues of this doctrine.",
        "source": "T07n0220_411:0060c24_25"
    },
    {
        "source_sentence": "言欣法者，謂於此法歡喜信受；",
        "translation": "The expression to delight in the doctrine means to be joyful and accept it with faith.",
        "source": "T07n0220_411:0060c25_26"
    },
    {
        "source_sentence": "言憙法者，謂於此法慕多修習親近愛重。",
        "translation": "The expression 'lust for the Dharma' means to admire this teaching and cultivate intimacy and affection for it.",
        "source": "T07n0220_411:0060c26_27"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_411:0060c27_28"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多時，以無所得而為方便，常能如是愛法、樂法、欣法、憙法而不憍舉，",
        "translation": "If a bodhisattva Mahāsattva cultivates the perfection of wisdom with ungraspable skillful means, he can always thus love the Dharma, enjoy the Dharma, delight in the Dharma, delight in the Dharma, and rejoice in the Dharma",
        "source": "T07n0220_411:0060c27_29"
    },
    {
        "source_sentence": "決定能於大有情眾當為上首。",
        "translation": "He's certain that he'll be the leader of a large group of sentient beings.",
        "source": "T07n0220_411:0060c29_30"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0061a01_31"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，以無所得而為方便，安住內空乃至無性自性空，",
        "translation": "Suppose a bodhisattva Mahāsattva cultivates the perfection of wisdom and makes it a method for attaining nothing, abiding in internal emptiness up to the emptiness of the own-natureless self-nature of emptiness.",
        "source": "T07n0220_411:0061a01_32"
    },
    {
        "source_sentence": "修四念住乃至十八佛不共法，是菩薩摩訶薩決定能於大有情眾當為上首。",
        "translation": "Cultivating the four abodes of mindfulness up to the 18 Buddha-uncommon dharmas is the bodhisattva Mahāsattva's certainty that he can be the leader among the great multitude of sentient beings.",
        "source": "T07n0220_411:0061a03_33"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_411:0061a05_34"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多，以無所得而為方便，住金剛喻三摩地，",
        "translation": "Suppose a bodhisattva Mahāsattva cultivates the perfection of wisdom and abides in the adamantine absorption with ungraspable skillful means.",
        "source": "T07n0220_411:0061a05_35"
    },
    {
        "source_sentence": "乃至住無著無為無染解脫如虛空三摩地，是菩薩摩訶薩由此因緣，決定能於大有情眾當為上首。",
        "translation": "It's because of these causes and conditions that the bodhisattva Mahāsattva is certain to be the leader of the great multitude of sentient beings who abide in the unattached, unconditioned, undefiled liberation like space.",
        "source": "T07n0220_411:0061a07_36"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_411:0061a09_37"
    },
    {
        "source_sentence": "由如是等種種因緣，諸菩薩摩訶薩決定能於大有情眾當為上首，是故菩薩復名摩訶薩。」",
        "translation": "Because of these various causes and conditions, the bodhisattvas, mahāsattvas, are certain to be the foremost among the great multitude of sentient beings; therefore, the bodhisattvas are again called mahāsattvas.",
        "source": "T07n0220_411:0061a09_38"
    },
    {
        "source_sentence": "第二分斷諸見品第十二",
        "translation": "The Twelfth Chapter of the Second Part: Cessation of Views",
        "source": "T07n0220_411:0061a12_0"
    },
    {
        "source_sentence": "爾時，舍利子白佛言：「世尊！",
        "translation": "It was then that Śāriputra said to the Buddha, Bhagavān!",
        "source": "T07n0220_411:0061a13_0"
    },
    {
        "source_sentence": "我亦樂以智慧辯才，說諸菩薩由此義故名摩訶薩。」",
        "translation": "I'm also happy to use my wisdom and eloquence to explain that the bodhisattvas are called mahāsattvas because of this meaning.",
        "source": "T07n0220_411:0061a13_1"
    },
    {
        "source_sentence": "佛告舍利子：「隨汝意說。」",
        "translation": "The Buddha told Śāriputra, Explain it as you wish.",
        "source": "T07n0220_411:0061a14_2"
    },
    {
        "source_sentence": "舍利子言：「世尊！",
        "translation": "Śāriputra said, Bhagavān!",
        "source": "T07n0220_411:0061a15_3"
    },
    {
        "source_sentence": "以諸菩薩方便善巧，能為有情宣說法要，令斷我見、有情見、命者見、生者見、養者見、士夫見、補特伽羅見、意生見、儒童見、作者見、受者見、知者見、見者見，",
        "translation": "“Enlightening beings, by means of skill in liberative technique, can expound the Teaching to sentient beings and cause them to abandon the view of self, the view of sentient beings, the view of existence, the view of birth, the",
        "source": "T07n0220_411:0061a15_4"
    },
    {
        "source_sentence": "由此義故名摩訶薩。",
        "translation": "Because of this meaning, it's called mahāsattva.",
        "source": "T07n0220_411:0061a19_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_411:0061a19_6"
    },
    {
        "source_sentence": "以諸菩薩方便善巧，能為有情宣說法要，令斷常見、斷見、有見、無見，",
        "translation": "By means of skillful means enlightening beings can expound the essentials of truth to sentient beings, causing them to abandon common sense, views, views and non-views.",
        "source": "T07n0220_411:0061a19_7"
    },
    {
        "source_sentence": "由此義故名摩訶薩。",
        "translation": "Because of this meaning, it's called mahāsattva.",
        "source": "T07n0220_411:0061a21_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_411:0061a21_9"
    },
    {
        "source_sentence": "以諸菩薩方便善巧，能為有情宣說法要，令斷蘊見、處見、界見、諦見、緣起見，",
        "translation": "By means of skillful means enlightening beings can expound truth for sentient beings, causing them to abandon the view of aggregates, the view of places, the view of realms, the view of truths, and the view of dependent origination.",
        "source": "T07n0220_411:0061a21_10"
    },
    {
        "source_sentence": "由此義故名摩訶薩。",
        "translation": "Because of this meaning, it's called mahāsattva.",
        "source": "T07n0220_411:0061a23_11"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_411:0061a24_12"
    },
    {
        "source_sentence": "以諸菩薩方便善巧，能為有情宣說法要，令斷四念住見乃至十八佛不共法見，",
        "translation": "By means of skillful means enlightening beings can expound the Teaching to sentient beings, causing them to abandon the four abodes of mindfulness and so on up to the eighteen unique qualities of buddhahood.",
        "source": "T07n0220_411:0061a24_13"
    },
    {
        "source_sentence": "由此義故名摩訶薩。",
        "translation": "Because of this meaning, it's called mahāsattva.",
        "source": "T07n0220_411:0061a26_14"
    },
    {
        "source_sentence": "以諸菩薩方便善巧，能為有情宣說法要，令斷成熟有情見、嚴淨佛土見、菩薩見、如來見、菩提見、涅槃見、轉法輪見，",
        "translation": "By means of skillful means enlightening beings can expound truth for sentient beings, causing them to abandon the views of ripening sentient beings, the views of adorning buddha-lands, the views of enlightening beings, the views",
        "source": "T07n0220_411:0061a26_15"
    },
    {
        "source_sentence": "由此義故名摩訶薩。",
        "translation": "Because of this meaning, it's called mahāsattva.",
        "source": "T07n0220_411:0061a29_16"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_411:0061a29_17"
    },
    {
        "source_sentence": "以諸菩薩方便善巧，能為有情以無所得而為方便，宣說永斷一切見法，",
        "translation": "By means of skillful means enlightening beings can, for the sake of sentient beings, use ungraspable things as means to proclaim the eternally annihilation of all views.",
        "source": "T07n0220_411:0061a29_18"
    },
    {
        "source_sentence": "由此義故名摩訶薩。」",
        "translation": "Because of this meaning, it's called mahāsattva.",
        "source": "T07n0220_411:0061b02_19"
    },
    {
        "source_sentence": "時，具壽善現問舍利子言：「若菩薩摩訶薩能為有情，以無所得而為方便，",
        "translation": "Guoshou Shancheng then asked Śāriputra, Suppose a bodhisattva Mahāsattva can skillfully liberate sentient beings from the state of nongrasping by means of ungraspableness.",
        "source": "T07n0220_411:0061b02_20"
    },
    {
        "source_sentence": "宣說永斷諸見法要，何因何緣有諸菩薩，自有所得而為方便，起蘊見、處見、界見、諦見、緣起見、四念住見乃至十八佛不共法見，",
        "translation": "“World-honored One, why and for what reasons do enlightening beings who have attained these insights give rise to such views as ‘aggregates,’ ‘places,’ ‘realms,’ ‘truths,’ ‘backgrounds",
        "source": "T07n0220_411:0061b04_21"
    },
    {
        "source_sentence": "及成熟有情見、嚴淨佛土見、菩薩見、如來見、菩提見、涅槃見、轉法輪見耶？」",
        "translation": "and the view of ripening sentient beings, the view of adorning the Buddha land, the view of bodhisattvas, the view of the Tathāgata, the view of enlightenment, the view of nirvāṇa, and the view of",
        "source": "T07n0220_411:0061b07_22"
    },
    {
        "source_sentence": "舍利子言：「若菩薩摩訶薩修行般若波羅蜜多時，無方便善巧者，以有所得而為方便，",
        "translation": "Śāriputra said, Suppose a bodhisattva Mahāsattva cultivates the perfection of wisdom and there's no skillful means when he cultivates the perfection of wisdom, using gain as his method.",
        "source": "T07n0220_411:0061b08_23"
    },
    {
        "source_sentence": "發起蘊見乃至轉法輪見，是菩薩摩訶薩無方便善巧故，決定不能以無所得而為方便，",
        "translation": "To give rise to the vision of the aggregates up to the vision of the turning of the wheel of the teaching is because the great enlightening beings lack skill in means and are certainly unable to make use of nongrasping as their means.",
        "source": "T07n0220_411:0061b10_24"
    },
    {
        "source_sentence": "為諸有情宣說永斷諸見法要。",
        "translation": "He teaches the essentials of the Dharma that permanently ends views for sentient beings.",
        "source": "T07n0220_411:0061b12_25"
    },
    {
        "source_sentence": "若菩薩摩訶薩修行般若波羅蜜多時，有方便善巧者，能為有情以無所得而為方便，",
        "translation": "“When great enlightening beings practice the perfection of wisdom, if they have skill in means, they can make it possible for sentient beings to attain nothing.",
        "source": "T07n0220_411:0061b13_26"
    },
    {
        "source_sentence": "宣說永斷諸見法要，是菩薩摩訶薩決定不起蘊等諸見。」",
        "translation": "He declares that the essentials of permanently eliminating views are the bodhisattva-mahāsattva's certainty that he won't give rise to such views as the aggregates.",
        "source": "T07n0220_411:0061b15_27"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_411:0061b17_0"
    },
    {
        "source_sentence": "我亦樂以智慧辯才，說諸菩薩由此義故名摩訶薩。」",
        "translation": "I'm also happy to use my wisdom and eloquence to explain that the bodhisattvas are called mahāsattvas because of this meaning.",
        "source": "T07n0220_411:0061b17_1"
    },
    {
        "source_sentence": "佛告善現：「隨汝意說。」",
        "translation": "The Buddha told Shancheng, Explain it as you wish.",
        "source": "T07n0220_411:0061b18_2"
    },
    {
        "source_sentence": "善現白言：「世尊！",
        "translation": "Sunetra said, Bhagavān!",
        "source": "T07n0220_411:0061b19_3"
    },
    {
        "source_sentence": "以諸菩薩為欲證得一切智智，發菩提心、無等等心、不共聲聞獨覺等心，",
        "translation": "“Great enlightening beings, wanting to attain omniscience and knowledge, develop the determination for enlightenment, the unequalled determination, the unique determination of listeners and solitary realizers.",
        "source": "T07n0220_411:0061b19_4"
    },
    {
        "source_sentence": "於如是心亦不取著，由此義故名摩訶薩。",
        "translation": "Nor does he cling to such a mind, which is called mahāsattva because of its meaning.",
        "source": "T07n0220_411:0061b21_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_411:0061b22_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_411:0061b22_7"
    },
    {
        "source_sentence": "以一切智智心是真無漏不墮三界，求一切智智心亦是無漏不墮三界，於如是心不應取著，",
        "translation": "It's because the mind of omniscience and cognition is truly uncontaminated and doesn't fall into the three realms, and the mind that seeks omniscience and cognition is also uncontaminated and doesn't fall into the three realms,",
        "source": "T07n0220_411:0061b22_8"
    },
    {
        "source_sentence": "是故菩薩名摩訶薩。」",
        "translation": "That's why the bodhisattva is called mahāsattva.",
        "source": "T07n0220_411:0061b24_9"
    },
    {
        "source_sentence": "時，舍利子問善現言：「云何菩薩摩訶薩無等等心、不共聲聞獨覺等心？」",
        "translation": "Śāriputra then asked the good manifestation, What are the peerless minds of bodhisattvas, mahāsattvas, śrāvakas, solitary realizers, and so forth?",
        "source": "T07n0220_411:0061b25_10"
    },
    {
        "source_sentence": "善現答言：「諸菩薩摩訶薩從初發心，不見少法有生有滅、有減有增、有染有淨。",
        "translation": "Sunetra answered, From the first arousal of mind, bodhisattvas and mahāsattvas don't see few things that arise and cease, decrease and increase, and are defiled and pure.",
        "source": "T07n0220_411:0061b26_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_411:0061b28_12"
    },
    {
        "source_sentence": "若不見少法有生有滅、有減有增、有染有淨，亦不見有聲聞心、獨覺心、菩薩心、如來心。",
        "translation": "If someone doesn't see few things that arise and cease, decrease and increase, defilement and purity, they don't see the minds of śrāvakas, pratyekbuddhas, bodhisattvas, or tathāgatas.",
        "source": "T07n0220_411:0061b28_13"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_411:0061c01_14"
    },
    {
        "source_sentence": "是名菩薩摩訶薩無等等心、不共聲聞獨覺等心，諸菩薩摩訶薩於如是心亦不取著。」",
        "translation": "This is called the peerless mind of a bodhisattva-mahāsattva and the mind that's not shared with śrāvakas, pratyekbuddhas, and so forth, and bodhisattvas, mahāsattvas, don'",
        "source": "T07n0220_411:0061c01_15"
    },
    {
        "source_sentence": "時，舍利子問善現言：「若菩薩摩訶薩於如是心不應取著，則於一切聲聞、獨覺、異生等心亦不應取著，",
        "translation": "Śāriputra then asked the good manifestation, If bodhisattvas and mahāsattvas shouldn't cling to minds like this, then they shouldn't cling to the minds of all śrāvakas, pratyekbuddhas,",
        "source": "T07n0220_411:0061c03_16"
    },
    {
        "source_sentence": "及於色、受、想、行、識心乃至十八佛不共法心亦不應取著。",
        "translation": "Nor should they cling to the minds of form, sensation, perception, perception, volition, consciousness, or even the 18 Buddha-uncommon dharmas.",
        "source": "T07n0220_411:0061c06_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_411:0061c07_18"
    },
    {
        "source_sentence": "如是諸心無心性故。」",
        "translation": "Thus, these minds lack the nature of mind.",
        "source": "T07n0220_411:0061c07_19"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_411:0061c08_20"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_411:0061c08_21"
    },
    {
        "source_sentence": "誠如所說。」",
        "translation": "It's really as explained.",
        "source": "T07n0220_411:0061c08_22"
    },
    {
        "source_sentence": "時，舍利子問善現言：「若一切心無心性故不應取著，則色、受、想、行、識亦無色、受、想、行、識性不應取著，",
        "translation": "Śāriputra asked the good manifestation, saying, If all minds lack mental nature and therefore shouldn't be attached, then form, feeling, perception, perception, volition, and consciousness also lack form, feeling, perception, volition,",
        "source": "T07n0220_411:0061c08_23"
    },
    {
        "source_sentence": "乃至十八佛不共法亦無十八佛不共法性不應取著。」",
        "translation": "Even the 18 Buddha-uncommon dharmas are also without the 18 Buddha-uncommon dharmas that shouldn't be grasped.",
        "source": "T07n0220_411:0061c11_24"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_411:0061c12_25"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_411:0061c12_26"
    },
    {
        "source_sentence": "誠如所說。」",
        "translation": "It's really as explained.",
        "source": "T07n0220_411:0061c12_27"
    },
    {
        "source_sentence": "舍利子言：「若一切智智心是真無漏不墮三界，則一切愚夫異生、聲聞、獨覺等心，",
        "translation": "Śāriputra said, If the mind of omniscience and cognition is truly uncontaminated and doesn't fall into the three realms, then all foolish people, ordinary people, śrāvakas, pratyekbuddhas, and so forth",
        "source": "T07n0220_411:0061c13_28"
    },
    {
        "source_sentence": "亦應是真無漏不墮三界。",
        "translation": "They should also be truly uncontaminated and not fall into the three realms.",
        "source": "T07n0220_411:0061c14_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_411:0061c15_30"
    },
    {
        "source_sentence": "如是諸心皆本性空故。」",
        "translation": "Thus, all these minds are inherently empty.",
        "source": "T07n0220_411:0061c15_31"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_411:0061c16_32"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_411:0061c16_33"
    },
    {
        "source_sentence": "誠如所說。」",
        "translation": "It's really as explained.",
        "source": "T07n0220_411:0061c16_34"
    },
    {
        "source_sentence": "舍利子言：「若如是心本性空故，是真無漏不墮三界，則色、受、想、行、識乃至十八佛不共法，",
        "translation": "Śāriputra said, If this mind is truly uncontaminated because its original nature is empty and doesn't fall into the three realms, then form, sensation, perception, perception, volition, consciousness, and even the 18 Buddha-princip",
        "source": "T07n0220_411:0061c16_35"
    },
    {
        "source_sentence": "亦應是真無漏不墮三界。",
        "translation": "They should also be truly uncontaminated and not fall into the three realms.",
        "source": "T07n0220_411:0061c18_36"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_411:0061c19_37"
    },
    {
        "source_sentence": "如是諸法皆本性空故。」",
        "translation": "Such things are all inherently empty in nature.",
        "source": "T07n0220_411:0061c19_38"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_411:0061c20_39"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_411:0061c20_40"
    },
    {
        "source_sentence": "誠如所說。」",
        "translation": "It's really as explained.",
        "source": "T07n0220_411:0061c20_41"
    },
    {
        "source_sentence": "舍利子言：「若心色等法無心色等性故不應取著，則一切法皆應平等都無差別。」",
        "translation": "Śāriputra said, If such things as mind and form lack the nature of mind and form and so forth, they shouldn't be attached, then all things should be equal and without distinctions.",
        "source": "T07n0220_411:0061c20_42"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_411:0061c22_43"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_411:0061c23_44"
    },
    {
        "source_sentence": "誠如所說。」",
        "translation": "It's really as explained.",
        "source": "T07n0220_411:0061c23_45"
    },
    {
        "source_sentence": "舍利子言：「若一切法等無差別，云何如來說心色等有種種異？」",
        "translation": "Śāriputra said, If all dharmas and so forth are without distinctions, how does the Tathāgata explain that there are various distinctions in mind, form, and so forth?",
        "source": "T07n0220_411:0061c23_46"
    },
    {
        "source_sentence": "善現答言：「此是如來隨世俗說，非隨勝義。」",
        "translation": "Sunetra answered, This is the Tathāgata who follows worldly explanations and doesn't follow ultimate meaning.",
        "source": "T07n0220_411:0061c24_47"
    },
    {
        "source_sentence": "舍利子言：「若諸異生、聲聞、獨覺、菩薩、如來心色等法，皆是無漏不墮三界，",
        "translation": "Śāriputra said, If ordinary people, śrāvakas, pratyekbuddhas, bodhisattvas, and tathāgatas are all uncontaminated and don't fall into the three realms,",
        "source": "T07n0220_411:0061c25_48"
    },
    {
        "source_sentence": "則諸異生及諸聖者、菩薩、如來應無差別。」",
        "translation": "Then there should be no distinction between ordinary people, sages, bodhisattvas, and tathāgatas.",
        "source": "T07n0220_411:0061c27_49"
    },
    {
        "source_sentence": "善現答言：「如是！",
        "translation": "Sunetra replied, So it is!",
        "source": "T07n0220_411:0061c28_50"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_411:0061c28_51"
    },
    {
        "source_sentence": "誠如所說。」",
        "translation": "It's really as explained.",
        "source": "T07n0220_411:0061c28_52"
    },
    {
        "source_sentence": "舍利子言：「若諸凡聖、菩薩、如來無差別者，云何佛說凡聖大小有種種異？」",
        "translation": "Śāriputra said, If worldlings, sages, bodhisattvas, and tathāgatas are without distinctions, how did the Buddha explain that there are various differences between the sizes of worldlings and sages?",
        "source": "T07n0220_411:0061c29_53"
    },
    {
        "source_sentence": "善現答言：「此亦如來依世俗說不依勝義。",
        "translation": "Sunetra replied, Here, too, the Tathāgata relies on worldly teachings and doesn't rely on ultimate meaning.",
        "source": "T07n0220_411:0062a01_54"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_411:0062a02_55"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，以無所得為方便故，於所發起大菩提心、無等等心、不共聲聞獨覺等心不恃不執，",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they don't rely or cling to the minds that give rise to great aspirations for enlightenment, unequalled aspirations, or distinct",
        "source": "T07n0220_411:0062a02_56"
    },
    {
        "source_sentence": "於色非色乃至十八佛不共法無取無著，由此義故名摩訶薩。」",
        "translation": "It's called mahāsattva because it doesn't grasp or attach to form or formlessness and even the 18 Buddha-principles that are not shared by the Buddha, which is why it's called mahāsattva.",
        "source": "T07n0220_411:0062a05_57"
    },
    {
        "source_sentence": "第二分六到彼岸品第十三之一",
        "translation": "The Thirteenth and One Part of the Chapter Thirteen of the Two Part Six perfections",
        "source": "T07n0220_411:0062a08_0"
    },
    {
        "source_sentence": "爾時，滿慈子白佛言：「世尊！",
        "translation": "It was then that Pūrṇa Maitrāyaniputra said to the Buddha, Bhagavān!",
        "source": "T07n0220_411:0062a09_0"
    },
    {
        "source_sentence": "我亦樂以智慧辯才，說諸菩薩由此義故名摩訶薩。」",
        "translation": "I'm also happy to use my wisdom and eloquence to explain that the bodhisattvas are called mahāsattvas because of this meaning.",
        "source": "T07n0220_411:0062a09_1"
    },
    {
        "source_sentence": "佛告滿慈子：「隨汝意說。」",
        "translation": "The Buddha told Pūrṇa Maitrāyaniputra, Explain it as you wish.",
        "source": "T07n0220_411:0062a10_2"
    },
    {
        "source_sentence": "滿慈子言：「世尊！",
        "translation": "Pūrṇa Maitrāyaniputra said, Bhagavān!",
        "source": "T07n0220_411:0062a11_3"
    },
    {
        "source_sentence": "以諸菩薩普為利樂一切有情，被大功德鎧故，發趣大乘故，乘大乘故，",
        "translation": "Because enlightening beings universally benefit all sentient beings because they are armed with the armor of great virtue, because they set out for the Great Vehicle, and because they ride the Great Vehicle.",
        "source": "T07n0220_411:0062a11_4"
    },
    {
        "source_sentence": "名摩訶薩。」",
        "translation": "It's called mahāsattva.",
        "source": "T07n0220_411:0062a13_5"
    },
    {
        "source_sentence": "時，舍利子問滿慈子言：「云何菩薩摩訶薩普為利樂一切有情被大功德鎧？」",
        "translation": "Śāriputra then asked Pūrṇa Maitrāyaniputra, How does the bodhisattva Mahāsattva receive the great armor of merit for the benefit of all sentient beings?",
        "source": "T07n0220_411:0062a13_6"
    },
    {
        "source_sentence": "滿慈子言：「舍利子！",
        "translation": "Pūrṇa Maitrāyaniputra said, Śāriputra!",
        "source": "T07n0220_411:0062a15_7"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行布施波羅蜜多時，不為利樂少分有情修行布施波羅蜜多，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of generosity, they don't cultivate the perfection of generosity for the benefit of a small number of sentient beings.",
        "source": "T07n0220_411:0062a15_8"
    },
    {
        "source_sentence": "普為利樂一切有情修行布施波羅蜜多。",
        "translation": "He cultivates the perfection of generosity for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062a17_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行淨戒波羅蜜多時，不為利樂少分有情修行淨戒波羅蜜多，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of pure morality, they don't cultivate the perfection of pure morality for the benefit of a small number of sentient beings.",
        "source": "T07n0220_411:0062a18_10"
    },
    {
        "source_sentence": "普為利樂一切有情修行淨戒波羅蜜多。",
        "translation": "He cultivates the perfection of pure morality for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062a20_11"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行安忍波羅蜜多時，不為利樂少分有情修行安忍波羅蜜多，",
        "translation": "“When great enlightening beings practice the perfection of tolerance, they don’t cultivate the perfection of tolerance for the benefit of a small number of sentient beings.",
        "source": "T07n0220_411:0062a21_12"
    },
    {
        "source_sentence": "普為利樂一切有情修行安忍波羅蜜多。",
        "translation": "He cultivates the perfection of patience for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062a23_13"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行精進波羅蜜多時，不為利樂少分有情修行精進波羅蜜多，",
        "translation": "“When great enlightening beings practice the transcendent ways of effort, they don’t cultivate the transcendent ways of effort for the benefit of a small number of sentient beings.",
        "source": "T07n0220_411:0062a24_14"
    },
    {
        "source_sentence": "普為利樂一切有情修行精進波羅蜜多。",
        "translation": "He cultivates the perfection of effort for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062a25_15"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行靜慮波羅蜜多時，不為利樂少分有情修行靜慮波羅蜜多，",
        "translation": "“When great enlightening beings practice the transcendent ways of meditation, they don’t cultivate the transcendent ways of meditation for the benefit of a small number of sentient beings.",
        "source": "T07n0220_411:0062a26_16"
    },
    {
        "source_sentence": "普為利樂一切有情修行靜慮波羅蜜多。",
        "translation": "He cultivates the perfection of meditation for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062a28_17"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，不為利樂少分有情修行般若波羅蜜多，",
        "translation": "When bodhisattvas and mahāsattvas cultivate the perfection of wisdom, they don't cultivate the perfection of wisdom for the benefit of a small number of sentient beings.",
        "source": "T07n0220_411:0062a29_18"
    },
    {
        "source_sentence": "普為利樂一切有情修行般若波羅蜜多。",
        "translation": "He cultivates the perfection of wisdom for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062b02_19"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_411:0062b03_20"
    },
    {
        "source_sentence": "是為菩薩摩訶薩普為利樂一切有情被大功德鎧。",
        "translation": "This is the bodhisattva Mahāsattva's great merit armor for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062b03_21"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T07n0220_411:0062b04_22"
    },
    {
        "source_sentence": "諸菩薩摩訶薩被大功德鎧，利樂有情不為分限，不作是念：『我當拔濟爾所有情令入無餘般涅槃界，",
        "translation": "“Great enlightening beings, wearing the armor of great virtue, benefit sentient beings without limitation and do not think, ‘I will rescue those who have all these feelings and cause them to enter nirvana without remainder.",
        "source": "T07n0220_411:0062b05_0"
    },
    {
        "source_sentence": "爾所有情不令其入；",
        "translation": "All your emotions won’t allow them to enter.",
        "source": "T07n0220_411:0062b07_1"
    },
    {
        "source_sentence": "我當拔濟爾所有情令住無上正等菩提，爾所有情不令其住。』",
        "translation": "I will remove all your feelings and cause them to abide in unsurpassed perfect enlightenment, and you won't allow them to abide because of all your feelings.'",
        "source": "T07n0220_411:0062b07_2"
    },
    {
        "source_sentence": "然諸菩薩摩訶薩普為拔濟一切有情，令入無餘般涅槃界及住無上正等菩提。",
        "translation": "Still, the bodhisattvas, mahāsattvas, and bodhisattvas all want to rescue all sentient beings so that they enter the state of parinirvāṇa without remainder and abide in unsurpassed perfect enlightenment.",
        "source": "T07n0220_411:0062b09_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_411:0062b10_4"
    },
    {
        "source_sentence": "是為菩薩摩訶薩普為利樂一切有情被大功德鎧。",
        "translation": "This is the bodhisattva Mahāsattva's great merit armor for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062b11_5"
    },
    {
        "source_sentence": "「復次，舍利子！",
        "translation": "Furthermore, Sāriputta!",
        "source": "T07n0220_411:0062b12_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩作如是念：『我當自圓滿布施波羅蜜多，亦令一切有情圓滿布施波羅蜜多。",
        "translation": "The bodhisattvas, mahāsattvas, think, 'I will fulfill the perfection of generosity for myself and cause all sentient beings to fulfill the perfection of generosity.'",
        "source": "T07n0220_411:0062b12_7"
    },
    {
        "source_sentence": "我當自圓滿淨戒波羅蜜多，亦令一切有情圓滿淨戒波羅蜜多。",
        "translation": "I will perfect the perfection of pure morality for myself, and I will also perfect the perfection of pure morality for all sentient beings.",
        "source": "T07n0220_411:0062b14_8"
    },
    {
        "source_sentence": "我當自圓滿安忍波羅蜜多，亦令一切有情圓滿安忍波羅蜜多。",
        "translation": "I will myself perfect the perfection of the perfection of patience and cause all sentient beings to perfect the perfection of the perfection of patience.",
        "source": "T07n0220_411:0062b16_9"
    },
    {
        "source_sentence": "我當自圓滿精進波羅蜜多，亦令一切有情圓滿精進波羅蜜多。",
        "translation": "I will myself perfect the perfection of effort and cause all sentient beings to perfect the perfection of effort.",
        "source": "T07n0220_411:0062b17_10"
    },
    {
        "source_sentence": "我當自圓滿靜慮波羅蜜多，亦令一切有情圓滿靜慮波羅蜜多。",
        "translation": "I will myself perfect the perfection of the perfection of meditation and cause all sentient beings to perfect the perfection of meditation.",
        "source": "T07n0220_411:0062b19_11"
    },
    {
        "source_sentence": "我當自圓滿般若波羅蜜多，亦令一切有情圓滿般若波羅蜜多。』",
        "translation": "I will myself perfect the perfection of prajñāpāramitā and cause all sentient beings to perfect the perfection of prajñāpāramitā.'",
        "source": "T07n0220_411:0062b20_12"
    },
    {
        "source_sentence": "諸菩薩摩訶薩作如是念：『我當自依如是六種波羅蜜多，安住內空乃至無性自性空，",
        "translation": "“Great enlightening beings think, ‘Should I rely on these six kinds of transcendent ways for my own sake to abide in internal emptiness or even the emptiness of the essential natureless self-nature?",
        "source": "T07n0220_411:0062b22_0"
    },
    {
        "source_sentence": "修行四念住乃至十八佛不共法。",
        "translation": "He cultivates the four abodes of mindfulness up to the 18 Buddha-uncommon dharmas.",
        "source": "T07n0220_411:0062b23_1"
    },
    {
        "source_sentence": "亦令一切有情依此六種波羅蜜多，安住內空乃至無性自性空，修行四念住乃至十八佛不共法。』",
        "translation": "It also causes all sentient beings to rely on these six kinds of perfections to abide in internal emptiness up to the emptiness of the natureless self-nature and cultivate the four abodes of mindfulness up to the 18 Buddha-principles",
        "source": "T07n0220_411:0062b24_2"
    },
    {
        "source_sentence": "諸菩薩摩訶薩作如是念：『我當自依如是六種波羅蜜多，速證無上正等菩提，",
        "translation": "“The great enlightening beings think, ‘Should I rely on these six transcendent ways to attain unexcelled perfect enlightenment?",
        "source": "T07n0220_411:0062b26_3"
    },
    {
        "source_sentence": "入無餘依般涅槃界。",
        "translation": "He enters the state of parinirvāṇa without remainder.",
        "source": "T07n0220_411:0062b28_4"
    },
    {
        "source_sentence": "亦令一切有情，依此六種波羅蜜多，速證無上正等菩提，入無餘依般涅槃界。』",
        "translation": "It also causes all sentient beings to rely on these six kinds of perfections to quickly realize unsurpassed perfect enlightenment and enter the state of parinirvāṇa without remainder.'",
        "source": "T07n0220_411:0062b29_5"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_411:0062c01_6"
    },
    {
        "source_sentence": "是為菩薩摩訶薩普為利樂一切有情被大功德鎧。",
        "translation": "This is the bodhisattva Mahāsattva's great merit armor for the benefit and welfare of all sentient beings.",
        "source": "T07n0220_411:0062c02_7"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百一十一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 11",
        "source": "T07n0220_411:0062c04_0"
    }
]