[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 4",
        "source": "T07n0220_444:0237b02_0"
    },
    {
        "source_sentence": "十四",
        "translation": "fourteen",
        "source": "T07n0220_444:0237b03_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_444:0237b05_0"
    },
    {
        "source_sentence": "第二分成辦品第四十八",
        "translation": "The Forty-eighth Chapter of the Second Part of the Teaching",
        "source": "T07n0220_444:0237b06_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_444:0237b07_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，為大事故出現世間，為不可思議事故出現世間，為不可稱量事故出現世間，",
        "translation": "The profound prajñāpāramitā appears in the world for great events, for inconceivable events, and for immeasurable events.",
        "source": "T07n0220_444:0237b07_1"
    },
    {
        "source_sentence": "為無數量事故出現世間，為無等等事故出現世間。」",
        "translation": "They appear in the world for measureless reasons, and they appear in the world for measureless reasons.",
        "source": "T07n0220_444:0237b09_2"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_444:0237b11_3"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_444:0237b11_4"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_444:0237b11_5"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，為大事故出現世間，乃至為無等等事故出現世間。",
        "translation": "The profound prajñāpāramitā appears in the world for great reasons, and it appears in the world for peerless reasons.",
        "source": "T07n0220_444:0237b11_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0237b13_7"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_444:0237b13_8"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，能成辦布施波羅蜜多，亦能成辦淨戒、安忍、精進、靜慮、般若波羅蜜多；",
        "translation": "The profound perfection of wisdom is able to accomplish the perfection of giving, and can also accomplish the perfections of pure morality, patience, effort, meditation, and wisdom.",
        "source": "T07n0220_444:0237b13_9"
    },
    {
        "source_sentence": "能成辦內空，亦能成辦外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空；",
        "translation": "They can produce internal emptiness, and they can also produce external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness, emptiness of original nature, emptiness of self-emptiness, emptiness of characteristics, emptiness of all",
        "source": "T07n0220_444:0237b15_10"
    },
    {
        "source_sentence": "能成辦真如，亦能成辦法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界；",
        "translation": "They are able to perfect suchness, and they can also perfect the realm of equanimity, the nature of things, the nature that is not false, the nature that is unchanging and dissimilar, the nature that is equal, the nature that is free from birth, the law, the abode of things, reality, space, inconceivable.",
        "source": "T07n0220_444:0237b19_11"
    },
    {
        "source_sentence": "能成辦苦聖諦，亦能成辦集、滅、道聖諦；",
        "translation": "They can settle the noble truth of suffering, and they can also settle the noble truths of accumulation, cessation, and the path.",
        "source": "T07n0220_444:0237b21_12"
    },
    {
        "source_sentence": "能成辦四靜慮，亦能成辦四無量、四無色定；",
        "translation": "They are able to accomplish four forms of meditative absorption. They are also able to accomplish the four immeasurable concentrations and the four formless concentrations.",
        "source": "T07n0220_444:0237b22_13"
    },
    {
        "source_sentence": "能成辦八解脫，亦能成辦八勝處、九次第定、十遍處；",
        "translation": "They are able to accomplish eight liberations, and can also accomplish eight spheres of mastery, nine graduated concentrations, and ten universals.",
        "source": "T07n0220_444:0237b23_14"
    },
    {
        "source_sentence": "能成辦四念住，亦能成辦四正斷、四神足、五根、五力、七等覺支、八聖道支；",
        "translation": "They can perfect the four abodes of mindfulness, and they can also perfect the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eightfold noble path.",
        "source": "T07n0220_444:0237b24_15"
    },
    {
        "source_sentence": "能成辦空解脫門，亦能成辦無相、無願解脫門；",
        "translation": "He was able to develop the liberation door of emptiness, and he was also able to develop the liberation door of signlessness and wishlessness.",
        "source": "T07n0220_444:0237b26_16"
    },
    {
        "source_sentence": "能成辦三乘十地，亦能成辦菩薩十地；",
        "translation": "They can accomplish the ten stages of the three vehicles and also can accomplish the ten stages of enlightening beings.",
        "source": "T07n0220_444:0237b27_17"
    },
    {
        "source_sentence": "能成辦五眼，亦能成辦六神通；",
        "translation": "They are able to perfect the five eyes and can also perfect the six supernatural powers.",
        "source": "T07n0220_444:0237b28_18"
    },
    {
        "source_sentence": "能成辦如來十力，亦能成辦四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法；",
        "translation": "They were able to perfect the ten powers of buddhahood. They were also able to perfect the four fearlessnesses, the four unhindered understandings, great benevolence, great compassion, great joy, great relinquishment, and the unique qualities of the eighteen buddhas.",
        "source": "T07n0220_444:0237b29_0"
    },
    {
        "source_sentence": "能成辦三十二大士相，亦能成辦八十隨好；",
        "translation": "He was able to embellish the thirty-two marks of greatness and also embellished the eighty secondary signs.",
        "source": "T07n0220_444:0237c01_1"
    },
    {
        "source_sentence": "能成辦無忘失法，亦能成辦恒住捨性；",
        "translation": "They are able to perfect the state of nonforgetfulness, and they can also perfect the state of eternally abiding equanimity.",
        "source": "T07n0220_444:0237c02_2"
    },
    {
        "source_sentence": "能成辦一切陀羅尼門，亦能成辦一切三摩地門；",
        "translation": "He was able to develop all the aspects of mental command and also developed all the aspects of concentration.",
        "source": "T07n0220_444:0237c03_3"
    },
    {
        "source_sentence": "能成辦預流果，亦能成辦一來、不還、阿羅漢果、獨覺菩提。",
        "translation": "They can accomplish the fruit of pre-flow, and they can also accomplish the once-returner, nonreturner, arhatship, and solitary realizer enlightenment.",
        "source": "T07n0220_444:0237c04_4"
    },
    {
        "source_sentence": "能成辦一切菩薩摩訶薩行，亦能成辦諸佛無上正等菩提；",
        "translation": "They can perfect all the practices of great enlightening beings, and they can also perfect the buddhas’ supreme perfect enlightenment.",
        "source": "T07n0220_444:0237c06_5"
    },
    {
        "source_sentence": "能成辦一切智，亦能成辦道相智、一切相智。",
        "translation": "He's able to accomplish omniscience, and he's also able to accomplish the knowledge of the path and the knowledge of all characteristics.",
        "source": "T07n0220_444:0237c07_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_444:0237c08_7"
    },
    {
        "source_sentence": "如剎帝利灌頂大王，威德自在降伏一切，以諸國事付囑大臣，端拱無為，",
        "translation": "Like the kṣatriya, the great king consecrated with power and sovereignty, he subdues all. He entrusts all affairs of state affairs to his ministers, obeying them without doing anything.",
        "source": "T07n0220_444:0237c08_8"
    },
    {
        "source_sentence": "安隱快樂。",
        "translation": "He's peaceful and happy.",
        "source": "T07n0220_444:0237c10_9"
    },
    {
        "source_sentence": "如來亦爾，為大法王，威德自在降伏一切，以聲聞法、若獨覺法、若菩薩法、若諸佛法，",
        "translation": "The Tathāgata is also like this: he is the great king of the Dharma. His majestic virtue freely subdues all people with the teachings of śrāvakas, pratyekabuddhas, bodhisattvas, and buddhas.",
        "source": "T07n0220_444:0237c10_10"
    },
    {
        "source_sentence": "皆悉付囑甚深般若波羅蜜多，由此般若波羅蜜多，皆能成辦一切事業。",
        "translation": "They all entrust the profound prajñāpāramitā to them, and because of this prajñāpāramitā, they can accomplish all tasks.",
        "source": "T07n0220_444:0237c12_11"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T07n0220_444:0237c14_12"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，為大事故出現世間，乃至為無等等事故出現世間。",
        "translation": "The profound prajñāpāramitā appears in the world for great reasons, and it appears in the world for peerless reasons.",
        "source": "T07n0220_444:0237c14_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0237c16_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多，於色無取無執故，出現世間能成辦事；",
        "translation": "The profound prajñāpāramitā, because it has no grasping or clinging to form, can accomplish all tasks by appearing in the world.",
        "source": "T07n0220_444:0237c16_1"
    },
    {
        "source_sentence": "於受、想、行、識無取無執故，出現世間能成辦事。",
        "translation": "Because feeling, perception, volition, and consciousness lack grasping and no attachment, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0237c17_2"
    },
    {
        "source_sentence": "於眼處無取無執故，出現世間能成辦事；",
        "translation": "Because there is neither grasping nor clinging in the sense-field of the eye, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0237c18_3"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意處無取無執故，出現世間能成辦事。",
        "translation": "Because there's no apprehension or attachment in the ear, nose, tongue, body, and mind sense-fields, it appears in the world to accomplish tasks.",
        "source": "T07n0220_444:0237c19_4"
    },
    {
        "source_sentence": "於色處無取無執故，出現世間能成辦事；",
        "translation": "Because there is neither grasping nor clinging in the realm of form, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0237c20_5"
    },
    {
        "source_sentence": "於聲、香、味、觸、法處無取無執故，出現世間能成辦事。",
        "translation": "Because there's no apprehension or attachment in the sense-fields of sound, odor, taste, touch, and dharmas, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0237c21_6"
    },
    {
        "source_sentence": "於眼界無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to the eye realm, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0237c22_7"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意界無取無執故，出現世間能成辦事。",
        "translation": "Because there's no grasping or attachment in the ear, nose, tongue, body, and mind realms, it appears in the world to accomplish tasks.",
        "source": "T07n0220_444:0237c23_8"
    },
    {
        "source_sentence": "於色界無取無執故，出現世間能成辦事；",
        "translation": "Being without grasping or clinging in the realm of form, they are able to accomplish all tasks by appearing in the world.",
        "source": "T07n0220_444:0237c25_9"
    },
    {
        "source_sentence": "於聲、香、味、觸、法界無取無執故，出現世間能成辦事。",
        "translation": "Because they have no attachment or attachment to sound, odor, taste, touch, or the Dharma realm, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0237c26_10"
    },
    {
        "source_sentence": "於眼識界無取無執故，出現世間能成辦事；",
        "translation": "Because there is neither grasping nor clinging to the element consciousness of the eye, it can accomplish all tasks by appearing in the world.",
        "source": "T07n0220_444:0237c27_11"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意識界無取無執故，出現世間能成辦事。",
        "translation": "Because there's no grasping or attachment in the ear, nose, tongue, body, and consciousness realms, it appears in the world to accomplish tasks.",
        "source": "T07n0220_444:0237c28_12"
    },
    {
        "source_sentence": "於眼觸無取無執故，出現世間能成辦事；",
        "translation": "Because there is neither grasping nor clinging to visual contact, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0237c29_13"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意觸無取無執故，出現世間能成辦事。",
        "translation": "Because there's no apprehension or attachment to the ear, nose, tongue, body, or mind contact, it appears in the world and can accomplish tasks.",
        "source": "T07n0220_444:0238a01_14"
    },
    {
        "source_sentence": "於眼觸為緣所生諸受無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to sensations that arise from visual contact as supporting object, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a02_15"
    },
    {
        "source_sentence": "於耳、鼻、舌、身、意觸為緣所生諸受無取無執故，出現世間能成辦事。",
        "translation": "Because sensations that arise from contact with the ear, nose, tongue, body, and mind have no grasping or attachment as their condition, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a03_16"
    },
    {
        "source_sentence": "於地界無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to the earth realm, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a05_17"
    },
    {
        "source_sentence": "於水、火、風、空、識界無取無執故，出現世間能成辦事。",
        "translation": "Because there's no grasping or attachment to the element of water, fire, wind, air, space, or consciousness, it appears in the world and can accomplish tasks.",
        "source": "T07n0220_444:0238a06_18"
    },
    {
        "source_sentence": "於無明無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to ignorance, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a07_19"
    },
    {
        "source_sentence": "於行、識、名色、六處、觸、受、愛、取、有、生、老死無取無執故，",
        "translation": "It's because there's no attachment or attachment to form, consciousness, name-and-form, the six sense-fields, touch, sensation, craving, apprehension, existence, birth, and old age and death.",
        "source": "T07n0220_444:0238a08_20"
    },
    {
        "source_sentence": "出現世間能成辦事。",
        "translation": "They appear in the world and can accomplish tasks.",
        "source": "T07n0220_444:0238a09_21"
    },
    {
        "source_sentence": "於布施波羅蜜多無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to the perfection of generosity, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a10_22"
    },
    {
        "source_sentence": "乃至於般若波羅蜜多無取無執故，出現世間能成辦事。",
        "translation": "It's because there's no grasping or attachment to the prajñāpāramitā that it appears in the world and accomplishes tasks.",
        "source": "T07n0220_444:0238a11_23"
    },
    {
        "source_sentence": "於內空無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to internal emptiness, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a12_24"
    },
    {
        "source_sentence": "乃至於無性自性空無取無執故，出現世間能成辦事。",
        "translation": "It's because there's no grasping or attachment to the emptiness of the self-nature of nonexistence that it appears in the world and can accomplish tasks.",
        "source": "T07n0220_444:0238a13_25"
    },
    {
        "source_sentence": "於真如無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to reality, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a14_26"
    },
    {
        "source_sentence": "乃至於不思議界無取無執故，出現世間能成辦事。",
        "translation": "It's because there's no grasping and no attachment in the inconceivable realm that they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a15_27"
    },
    {
        "source_sentence": "於苦聖諦無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to the noble truth of suffering, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238a16_28"
    },
    {
        "source_sentence": "於集、滅、道聖諦無取無執故，出現世間能成辦事。",
        "translation": "Because the noble truths of arising, cessation, and the path are neither grasped nor attached, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a17_29"
    },
    {
        "source_sentence": "於四靜慮無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to the four states of absorption, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238a19_0"
    },
    {
        "source_sentence": "於四無量、四無色定無取無執故，出現世間能成辦事。",
        "translation": "Because the four immeasurable and four formless concentrations have no attachment or attachment, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a20_0"
    },
    {
        "source_sentence": "於八解脫無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to the eight liberations, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a21_1"
    },
    {
        "source_sentence": "於八勝處、九次第定、十遍處無取無執故，出現世間能成辦事。",
        "translation": "Because the eight superior abodes, nine graduated concentrations, and ten universal abodes have no attachment or attachment, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a22_2"
    },
    {
        "source_sentence": "於四念住無取無執故，出現世間能成辦事；",
        "translation": "Because they abide in the four abodes of mindfulness without grasping or clinging, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238a23_3"
    },
    {
        "source_sentence": "乃至於八聖道支無取無執故，出現世間能成辦事。",
        "translation": "It's because the eight noble factors of the path have no grasping and no attachment that they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a24_4"
    },
    {
        "source_sentence": "於空解脫門無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to the liberation gate of emptiness, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a25_5"
    },
    {
        "source_sentence": "於無相、無願解脫門無取無執故，出現世間能成辦事。",
        "translation": "Because there's no attachment or attachment to the liberation gate of marklessness and wishlessness, he appears in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a26_6"
    },
    {
        "source_sentence": "於三乘十地無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging in the ten stages of the three vehicles, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238a28_7"
    },
    {
        "source_sentence": "於菩薩十地無取無執故，出現世間能成辦事。",
        "translation": "Because there's no grasping or attachment in the bodhisattva's ten stages, he appears in the world to accomplish tasks.",
        "source": "T07n0220_444:0238a29_8"
    },
    {
        "source_sentence": "於五眼無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to the five eyes, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238b01_9"
    },
    {
        "source_sentence": "於六神通無取無執故，出現世間能成辦事。",
        "translation": "Because the six supernormal powers have no grasping and no attachment, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238b02_10"
    },
    {
        "source_sentence": "於如來十力無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to the ten powers of buddhas, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238b03_11"
    },
    {
        "source_sentence": "乃至於十八佛不共法無取無執故，出現世間能成辦事。",
        "translation": "It's because there's no grasping or attachment to the 18 Buddha-uncommon dharmas that appear in the world and can accomplish tasks.",
        "source": "T07n0220_444:0238b04_12"
    },
    {
        "source_sentence": "於三十二大士相無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to the characteristics of the thirty-two great beings, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238b05_13"
    },
    {
        "source_sentence": "於八十隨好無取無執故，出現世間能成辦事。",
        "translation": "Because he has no grasping or attachment to the eighty secondary signs, he appears in the world and is able to accomplish tasks.",
        "source": "T07n0220_444:0238b06_14"
    },
    {
        "source_sentence": "於無忘失法無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to things without forgetfulness, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238b07_15"
    },
    {
        "source_sentence": "於恒住捨性無取無執故，出現世間能成辦事。",
        "translation": "Because the nature of eternally abiding equanimity has no grasping and no attachment, it appears in the world to accomplish tasks.",
        "source": "T07n0220_444:0238b08_16"
    },
    {
        "source_sentence": "於一切陀羅尼門無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to the teachings of all dhāraṇī teachings, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238b09_17"
    },
    {
        "source_sentence": "於一切三摩地門無取無執故，出現世間能成辦事。",
        "translation": "Because there's no grasping or attachment in all the approaches to samādhi, they appear in the world and can accomplish tasks.",
        "source": "T07n0220_444:0238b11_18"
    },
    {
        "source_sentence": "於預流果無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to the state of stream-winner, they appear in the world and are able to accomplish all tasks.",
        "source": "T07n0220_444:0238b12_19"
    },
    {
        "source_sentence": "乃至於獨覺菩提無取無執故，出現世間能成辦事。",
        "translation": "It's because there's no grasping or attachment to the enlightenment of self-enlightened bodhisattvas that they appear in the world and can accomplish tasks.",
        "source": "T07n0220_444:0238b13_20"
    },
    {
        "source_sentence": "於一切菩薩摩訶薩行無取無執故，出現世間能成辦事；",
        "translation": "Because they do not grasp or cling to the practices of all great enlightening beings, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238b14_21"
    },
    {
        "source_sentence": "於諸佛無上正等菩提無取無執故，出現世間能成辦事。",
        "translation": "Because the buddhas of unsurpassed perfect enlightenment have no grasping or attachment, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238b15_22"
    },
    {
        "source_sentence": "於一切智無取無執故，出現世間能成辦事；",
        "translation": "Because they have no grasping or clinging to omniscience, they appear in the world and are able to accomplish tasks.",
        "source": "T07n0220_444:0238b17_0"
    },
    {
        "source_sentence": "於道相智、一切相智無取無執故，出現世間能成辦事。」",
        "translation": "Because knowledge of the path's characteristics and knowledge of all characteristics have no attachment and no attachment, they appear in the world to accomplish tasks.",
        "source": "T07n0220_444:0238b18_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_444:0238b20_0"
    },
    {
        "source_sentence": "云何如是甚深般若波羅蜜多，於色無取無執，於受、想、行、識亦無取無執，",
        "translation": "How is it that such a profound prajñāpāramitā has no grasping or attachment to form and no grasping or attachment to sensation, perception, volition, or consciousness?",
        "source": "T07n0220_444:0238b20_1"
    },
    {
        "source_sentence": "乃至於一切智無取無執，於道相智、一切相智亦無取無執故，出現世間能成辦事？」",
        "translation": "It's because there's no grasping or attachment to omniscience and no grasping or attachment to cognition of the path and omniscience, and it's because there's no grasping or attachment to cognition of all characteristics that it can accomplish tasks in the world when it appears?",
        "source": "T07n0220_444:0238b22_2"
    },
    {
        "source_sentence": "佛告善現：「於意云何？",
        "translation": "The Buddha told Shancheng, What do you think?",
        "source": "T07n0220_444:0238b24_3"
    },
    {
        "source_sentence": "汝頗見色可取可執不？",
        "translation": "Do you see form that is desirable and appropriated?",
        "source": "T07n0220_444:0238b24_4"
    },
    {
        "source_sentence": "頗見受、想、行、識可取可執不？",
        "translation": "Can you see that feeling, perception, volition, and consciousness are desirable or appropriated?",
        "source": "T07n0220_444:0238b25_5"
    },
    {
        "source_sentence": "乃至頗見一切智可取可執不？",
        "translation": "Or is it possible to see that all cognition is desirable and appropriated?",
        "source": "T07n0220_444:0238b25_6"
    },
    {
        "source_sentence": "頗見道相智、一切相智可取可執不？」",
        "translation": "Could it be that the cognition of the path and the cognition of all characteristics can be grasped or attained?",
        "source": "T07n0220_444:0238b26_7"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_444:0238b27_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_444:0238b27_9"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T07n0220_444:0238b27_10"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T07n0220_444:0238b28_11"
    },
    {
        "source_sentence": "佛言：「善現！",
        "translation": "The Buddha said, Good manifestation!",
        "source": "T07n0220_444:0238b28_12"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_444:0238b28_13"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_444:0238b28_14"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_444:0238b28_15"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_444:0238b28_16"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_444:0238b28_17"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_444:0238b29_18"
    },
    {
        "source_sentence": "我亦不見色可取可執，不見受、想、行、識可取可執，乃至不見一切智可取可執，",
        "translation": "Nor does the self see form as desirable or appropriatable, nor does it see feeling, perception, volition, or consciousness as desirable or appropriatable, and so on, not seeing all cognitions as desirable or appropriatable.",
        "source": "T07n0220_444:0238b29_19"
    },
    {
        "source_sentence": "不見道相智、一切相智可取可執，由不見故不取，由不取故不執。",
        "translation": "Knowledge of the path and knowledge of all characteristics that are not seen is apprehensible and can be grasped, but because it is not seen, it is not apprehended; because it is not apprehended, it is not grasped.",
        "source": "T07n0220_444:0238c02_20"
    },
    {
        "source_sentence": "由此因緣，甚深般若波羅蜜多，於色無取無執，於受、想、行、識無取無執，",
        "translation": "Because of these causes and conditions, the profound prajñāpāramitā has no grasping or attachment to form and no grasping or attachment to sensation, perception, volition, or consciousness.",
        "source": "T07n0220_444:0238c03_21"
    },
    {
        "source_sentence": "如是乃至於一切智無取無執，於道相智、一切相智亦無取無執。",
        "translation": "Thus, it goes so far as to say that there's no grasping and no attachment in all cognition, and there's no grasping or attachment in knowledge of the path and knowledge of all characteristics.",
        "source": "T07n0220_444:0238c05_22"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_444:0238c06_23"
    },
    {
        "source_sentence": "我亦不見一切如來、應、正等覺所有正等覺法、如來法、自然覺法、一切智法可取可執，",
        "translation": "I do not see any dharma of enlightenment that is the dharmas of all buddhas, which are naturally enlightened, which are fully awakened, which can be grasped or attached to.",
        "source": "T07n0220_444:0238c06_24"
    },
    {
        "source_sentence": "由不見故不取，由不取故不執。",
        "translation": "Because of not seeing, it is not grasped; because of not grasping, it is not attached.",
        "source": "T07n0220_444:0238c08_25"
    },
    {
        "source_sentence": "甚深般若波羅蜜多亦復如是，都不見有一切如來、應、正等覺所有正等覺法、如來法、自然覺法、一切智法可取可執，",
        "translation": "The profound prajñāpāramitā is likewise, because it doesn't see that all tathāgatas, arhats, and perfectly enlightened ones have the qualities of perfect enlightenment, the qualities of the Tathāgata, the qualities of naturally enlightenedness, or the qualities of omniscience that can be grasped or apprehended",
        "source": "T07n0220_444:0238c09_26"
    },
    {
        "source_sentence": "由此因緣無取無執。",
        "translation": "Because of these causes and conditions, there's no grasping and no attachment.",
        "source": "T07n0220_444:0238c12_27"
    },
    {
        "source_sentence": "是故，善現！",
        "translation": "Therefore, Sunetra!",
        "source": "T07n0220_444:0238c12_28"
    },
    {
        "source_sentence": "諸菩薩摩訶薩修行般若波羅蜜多時，不應於色若取若執，不應於受、想、行、識若取若執，",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they shouldn't grasp or cling to form, and they shouldn't grasp or cling to sensation, perception, volition, or consciousness.",
        "source": "T07n0220_444:0238c12_29"
    },
    {
        "source_sentence": "如是乃至不應於一切智若取若執，不應於道相智、一切相智若取若執，",
        "translation": "In this way, up to no one should grasp or cling to omniscience. One should not grasp or cling to the knowledge of the path or the knowledge of all characteristics.",
        "source": "T07n0220_444:0238c14_30"
    },
    {
        "source_sentence": "亦不應於一切如來、應、正等覺所有正等覺法、如來法、自然覺法、一切智法若取若執。」",
        "translation": "Nor should all the tathāgatas, arhats, and perfectly enlightened ones grasp or attach to the teachings of perfectly enlightenedness, the teachings of the Tathāgata, the teachings of naturally enlightened dharmas, or the teachings of omniscience.",
        "source": "T07n0220_444:0238c16_31"
    },
    {
        "source_sentence": "爾時，欲色界諸天眾俱白佛言：「世尊！",
        "translation": "It was then that the gods of the desire realm all said to the Buddha, Bhagavān!",
        "source": "T07n0220_444:0238c19_0"
    },
    {
        "source_sentence": "如是般若波羅蜜多最為甚深，難見難覺，不可尋思超尋思境，寂靜微妙審諦沈密，",
        "translation": "Thus the prajñāpāramitā is the most profound, difficult to see and difficult to perceive. Inconceivable, transcending the realm of discursive thought, it is tranquil, subtle, deliberate, and mysterious.",
        "source": "T07n0220_444:0238c19_1"
    },
    {
        "source_sentence": "極聰慧者乃能了知。",
        "translation": "Only someone of great intelligence can understand it.",
        "source": "T07n0220_444:0238c21_2"
    },
    {
        "source_sentence": "若諸有情能深信解如是般若波羅蜜多，當知彼曾供養過去無量諸佛，於諸佛所發弘誓願多種善根，",
        "translation": "If sentient beings can deeply believe and understand the perfection of wisdom like this, they should know that they've honored measureless buddhas in the past and made great vows to cultivate many good roots in the presence of those buddhas.",
        "source": "T07n0220_444:0238c22_3"
    },
    {
        "source_sentence": "事多善友，已為無量善友攝受，乃能信解如是般若波羅蜜多。",
        "translation": "After serving many good friends and being collected by measureless good friends, they'll be able to believe and understand the perfection of prajñāpāramitā like this.",
        "source": "T07n0220_444:0238c24_4"
    },
    {
        "source_sentence": "若有得聞如是般若波羅蜜多深生信解，當知彼類即是菩薩，定得無上正等菩提。",
        "translation": "If someone hears such a profound faith and understanding of the perfection of prajñāpāramitā, they should know that those people are bodhisattvas who will surely attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0238c25_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_444:0238c27_6"
    },
    {
        "source_sentence": "假使三千大千世界諸有情類，一切皆成隨信行、隨法行、第八、預流、一來、不還、阿羅漢、獨覺，",
        "translation": "Suppose all the sentient beings of the 3,000 great one-thousand worlds were to become faithful, doctrine-followers, eighth, stream-enterers, once-returners, nonreturners, arhats, and solitary realizers.",
        "source": "T07n0220_444:0238c27_7"
    },
    {
        "source_sentence": "彼所成就若智若斷，不如有人一日於此甚深般若波羅蜜多忍樂思惟，稱量觀察。",
        "translation": "It's not as good as someone who for a day contemplates this profound prajñāpāramitā with patience and joy and weighs and observes it whether they have accomplished it with knowledge or stopped it.",
        "source": "T07n0220_444:0238c29_8"
    },
    {
        "source_sentence": "是人於此甚深般若波羅蜜多所成就忍，勝彼智斷無量無邊。",
        "translation": "That person's forbearance accomplished in this profound prajñāpāramitā is superior to their knowledge that stops measurelessly and limitlessly.",
        "source": "T07n0220_444:0239a02_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0239a04_10"
    },
    {
        "source_sentence": "諸隨信行若智若斷，乃至獨覺若智若斷，皆是已得無生法忍諸菩薩摩訶薩忍少分故。」",
        "translation": "Whether the practice of following faith is stopped by knowledge or cognition, or whether it's stopped by knowledge or cognition for pratyekabuddhas, it's because they've attained a small part of the bodhisattva-mahāsattva's tolerance of the nonarising of phenomena.",
        "source": "T07n0220_444:0239a04_11"
    },
    {
        "source_sentence": "爾時，佛告諸天眾言：「善哉！",
        "translation": "It was then that the Buddha addressed the gods, saying, Good!",
        "source": "T07n0220_444:0239a07_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_444:0239a07_1"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_444:0239a07_2"
    },
    {
        "source_sentence": "諸隨信行、若隨法行、第八、預流、一來、不還、阿羅漢、獨覺所有智斷，",
        "translation": "The practice of faith-followers, the practice of doctrine-followers, the eighth, stream-enterers, once-returners, nonreturners, arhats, and pratyekabuddhas are all eliminated by the knowledge that they possess.",
        "source": "T07n0220_444:0239a07_3"
    },
    {
        "source_sentence": "皆是已得無生法忍諸菩薩摩訶薩忍之少分。",
        "translation": "They are all a small part of the bodhisattva-mahāsattva's forbearance that has attained the tolerance of the nonarising of phenomena.",
        "source": "T07n0220_444:0239a09_4"
    },
    {
        "source_sentence": "天眾當知！",
        "translation": "You should know, gods!",
        "source": "T07n0220_444:0239a10_5"
    },
    {
        "source_sentence": "若善男子、善女人等，暫聽如是甚深般若波羅蜜多，聞已信解、書寫、受持、讀誦、修習、思惟、演說，",
        "translation": "“Good sons and good daughters, if they listen momentarily to this profound discourse on the transcendent wisdom that is thus taught, they will believe it, write it down, memorize it, recite it, practice it, contemplate it, and expound it.",
        "source": "T07n0220_444:0239a10_6"
    },
    {
        "source_sentence": "是善男子、善女人等速出生死證得涅槃，成就如來正等覺智，勝求二乘諸善男子、善女人等遠離般若波羅蜜多，",
        "translation": "Good men and good women who quickly leave birth and death and realize nirvāṇa, accomplish the Tathāgata's right awakening wisdom, and overcome the two-vehicle aspirations of good men and good women who are far removed from the perfection of prajñāpāramitā.",
        "source": "T07n0220_444:0239a12_7"
    },
    {
        "source_sentence": "學餘經典若經一劫若一劫餘。",
        "translation": "If he trains in the remaining sūtras for an eon or more than one eon, then he'll attain nirvāṇa.",
        "source": "T07n0220_444:0239a15_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_444:0239a16_9"
    },
    {
        "source_sentence": "於此般若波羅蜜多甚深經中，廣說一切微妙勝法，諸隨信行、若隨法行、第八、預流、一來、不還、阿羅漢、獨覺、菩薩摩訶薩皆應於此精勤修學，",
        "translation": "In this profound scripture of prajñāpāramitā, he extensively explains all the subtle and supreme teachings, which should be diligently cultivated by faith-followers, doctrine-followers, eighth, stream-enterers, firstcomers, nonreturners, arhats, solitary realizers, and bodhisattvas and mahāsatt",
        "source": "T07n0220_444:0239a16_10"
    },
    {
        "source_sentence": "隨所願求皆速究竟所作事業，一切如來、應、正等覺皆依此學，已證、正證、當證無上正等菩提。」",
        "translation": "All the Tathāgatas, Arhats, and Perfectly Enlightened Ones who quickly and completely accomplish all their tasks according to their wishes rely on this training, which they've realized, will realize, and will realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0239a19_11"
    },
    {
        "source_sentence": "時，諸天眾俱發聲言：「如是般若波羅蜜多是大波羅蜜多，是不可思議波羅蜜多，",
        "translation": "The gods then all spoke out in unison, saying, Thus is the perfection of wisdom a great perfection, an inconceivable perfection.",
        "source": "T07n0220_444:0239a21_12"
    },
    {
        "source_sentence": "是不可稱量波羅蜜多，是無數量波羅蜜多，是無等等波羅蜜多。",
        "translation": "These are the incalculable perfections, the incalculable perfections, and the peerless perfections.",
        "source": "T07n0220_444:0239a23_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_444:0239a24_14"
    },
    {
        "source_sentence": "諸隨信行、若隨法行、第八、預流、一來、不還、阿羅漢、獨覺皆於如是甚深般若波羅蜜多，",
        "translation": "The faith-follower, the doctrine-follower, the eighth, the stream-enterer, the once-returner, the one who doesn't return, the arhat, and the solitary realizer are all engaged in such profound prajñāpāramitā.",
        "source": "T07n0220_444:0239a24_15"
    },
    {
        "source_sentence": "精勤修學，速出生死，證無餘依般涅槃界。",
        "translation": "He diligently cultivates and quickly escapes birth and death, realizing the state of parinirvāṇa without remainder.",
        "source": "T07n0220_444:0239a26_16"
    },
    {
        "source_sentence": "一切菩薩摩訶薩眾皆於如是甚深般若波羅蜜多，精勤修學，速證無上正等菩提，",
        "translation": "All the great enlightening beings and bodhisattvas thus diligently cultivate such profound prajñāpāramitā, quickly realizing unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0239a27_17"
    },
    {
        "source_sentence": "入無餘依般涅槃界。",
        "translation": "He enters the state of parinirvāṇa without remainder.",
        "source": "T07n0220_444:0239a29_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_444:0239b01_19"
    },
    {
        "source_sentence": "雖諸聲聞、獨覺、菩薩皆依如是甚深般若波羅蜜多，精勤修學，各得究竟所作事業，",
        "translation": "Even though all the śrāvakas, pratyekbuddhas, and bodhisattvas relied on such profound prajñāpāramitā to diligently cultivate it, each attaining the ultimate accomplishment of their works.",
        "source": "T07n0220_444:0239b01_20"
    },
    {
        "source_sentence": "而是般若波羅蜜多無增無減。」",
        "translation": "Instead, the perfection of wisdom has no increase or decrease.",
        "source": "T07n0220_444:0239b03_21"
    },
    {
        "source_sentence": "爾時，欲界、色界天眾說是語已歡喜踊躍，於此般若波羅蜜多深生信樂，",
        "translation": "At that point, the gods of the desire realm and form realm rejoiced and jumped for joy when they spoke those words, and deeply believed in this prajñāpāramitā.",
        "source": "T07n0220_444:0239b03_22"
    },
    {
        "source_sentence": "頂禮佛足右遶三匝辭佛還宮，去會未遠俱時不現。",
        "translation": "They bowed their heads at the Buddha’s feet, circumambulated him three times to his right, and withdrew back to the palace. Not long after leaving the assembly, they all disappeared.",
        "source": "T07n0220_444:0239b05_23"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_444:0239b07_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩聞說如是甚深般若波羅蜜多深生信解，書寫、受持、讀誦、修習、思惟、演說，",
        "translation": "“If great enlightening beings hear and teach such profound prajñāpāramitā, they will give rise to deep faith and understanding, write, memorize, recite, practice, contemplate, and expound it.",
        "source": "T07n0220_444:0239b07_1"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎，是菩薩摩訶薩從何處沒來生此間？」",
        "translation": "Where did this bodhisattva-mahāsattva who makes offerings, respects, venerates, and praises him come from to be born here?",
        "source": "T07n0220_444:0239b09_2"
    },
    {
        "source_sentence": "佛告善現：「若菩薩摩訶薩聞說如是甚深般若波羅蜜多深生信解，書寫、受持、讀誦、修習、如理思惟、供養恭敬、尊重讚歎，",
        "translation": "The Buddha told Shancheng, Suppose a bodhisattva Mahāsattva hears and explains the profound prajñāpāramitā of such profound prajñāpāramitā with deep faith and understanding, writes, retains, recites, cultivates, correctly contemplates, makes offerings, respects, venerates, and venerates it.",
        "source": "T07n0220_444:0239b10_3"
    },
    {
        "source_sentence": "常隨法師諮問義趣，若行、若立、若坐、若臥無時暫捨，如新生犢不離其母，",
        "translation": "He always follows the teacher of the Dharma to inquire about his meaning, whether he walks, stands, sits, or lies down, and doesn't give up for a moment at any time, like a newborn calf that doesn't leave its mother.",
        "source": "T07n0220_444:0239b13_4"
    },
    {
        "source_sentence": "乃至未得甚深般若波羅蜜多所有義趣，究竟通利，能為他說，終不捨離如是般若波羅蜜多甚深經典及說法師。",
        "translation": "Even if someone hasn't yet attained the profound meaning of the profound prajñāpāramitā, they'll ultimately penetrate its benefits and be able to teach it for others, and they'll never abandon such a profound scripture or Dharma teacher who teaches the profound prajñāpāramitā.",
        "source": "T07n0220_444:0239b15_5"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0239b17_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩從人中沒來生此間。",
        "translation": "This is the bodhisattva Mahāsattva who came here from among humans and was born here.",
        "source": "T07n0220_444:0239b18_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0239b18_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_444:0239b19_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩先世已聞甚深般若波羅蜜多，聞已受持、讀誦、修習、如理思惟，",
        "translation": "Having heard the profound prajñāpāramitā in a previous life, the bodhisattva Mahāsattva retains, recites, practices, and correctly contemplates it after hearing it.",
        "source": "T07n0220_444:0239b19_10"
    },
    {
        "source_sentence": "復能書寫眾寶嚴飾，又以種種上妙花鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、伎樂、燈明，",
        "translation": "They were also able to write scriptures adorned with various jewels and embellished with exquisitely beautiful flower garlands, perfumes such as ointments, clothes, jewelry, precious banners, pennants, canopies, music, and lamps.",
        "source": "T07n0220_444:0239b21_0"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_444:0239b22_1"
    },
    {
        "source_sentence": "由此善根離八無暇，從人趣沒還生人中，聞說如是甚深般若波羅蜜多，",
        "translation": "Because of these good roots, they're free of the eight kinds of leisure and are reborn among humans from their human destinies when they hear and teach such profound prajñāpāramitā.",
        "source": "T07n0220_444:0239b23_2"
    },
    {
        "source_sentence": "深生信解，書寫、受持、讀誦、修習、思惟、演說，供養恭敬、尊重讚歎。」",
        "translation": "They give rise to profound faith and understanding, write, memorize, recite, cultivate, contemplate, and expound it, offering support, respect, veneration, and praise.",
        "source": "T07n0220_444:0239b25_0"
    },
    {
        "source_sentence": "時，具壽善現復白佛言：「世尊！",
        "translation": "Guoshou Shancheng then again said to the Buddha, Bhagavān!",
        "source": "T07n0220_444:0239b26_1"
    },
    {
        "source_sentence": "頗有菩薩摩訶薩成就如是殊勝功德，供養承事他方如來、應、正等覺，",
        "translation": "“World-honored One, how many bodhisattva mahāsattvas have perfected such extraordinary qualities as these, honoring and serving the buddhas of other directions?",
        "source": "T07n0220_444:0239b27_2"
    },
    {
        "source_sentence": "從彼處沒來生此間，聞說如是甚深般若波羅蜜多深生信解，書寫、受持、讀誦、修習、思惟、演說，",
        "translation": "“Furthermore, reverend Śāriputra, having emerged from that place and been born here, they will hear this profound discourse on the perfection of wisdom called absorption. They will write, retain, recite, practice, contemplate, and expound it.",
        "source": "T07n0220_444:0239b28_3"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎，無懈倦不？」",
        "translation": "Are you not lazy in making offerings, respecting, honoring, and praising them?",
        "source": "T07n0220_444:0239c01_4"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_444:0239c02_5"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_444:0239c02_6"
    },
    {
        "source_sentence": "有菩薩摩訶薩成就如是殊勝功德，供養承事他方如來、應、正等覺，從彼處沒來生此間，",
        "translation": "“There are great enlightening beings who have perfected such extraordinary qualities, honoring and serving the Buddhas of other buddha-fields. Having emerged from that world, they will be born here.",
        "source": "T07n0220_444:0239c02_7"
    },
    {
        "source_sentence": "聞說如是甚深般若波羅蜜多深生信解，書寫、受持、讀誦、修習、思惟、演說，",
        "translation": "When they hear and teach such profound prajñāpāramitā, they become deeply convinced, write, memorize, recite, practice, contemplate, and expound it.",
        "source": "T07n0220_444:0239c04_8"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎，無懈倦心。",
        "translation": "They offer offerings of respect, veneration, honor, and praise without laziness.",
        "source": "T07n0220_444:0239c06_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_444:0239c07_10"
    },
    {
        "source_sentence": "是菩薩摩訶薩先從他方無量佛所，聞說如是甚深般若波羅蜜多，深生信解，",
        "translation": "“Then the great enlightening being Universally Good, having first heard these profound teachings of the transcendent wisdom from the infinite buddhas of the ten directions, deeply believed and understood them.",
        "source": "T07n0220_444:0239c07_11"
    },
    {
        "source_sentence": "書寫、受持、讀誦、修習、思惟、演說，供養恭敬、尊重讚歎，無懈倦心，",
        "translation": "They write, memorize, retain, recite, practice, contemplate, and expound, offering support, respect, veneration, honor, and praise without laziness.",
        "source": "T07n0220_444:0239c09_12"
    },
    {
        "source_sentence": "彼乘如是善根力故，從彼處沒來生此間。",
        "translation": "Because of the power of such roots of goodness, they are born here from that place and are reborn there.",
        "source": "T07n0220_444:0239c10_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0239c11_14"
    },
    {
        "source_sentence": "有菩薩摩訶薩從覩史多天眾同分沒來生人中，彼亦成就如是功德。",
        "translation": "Suppose there's a bodhisattva Mahāsattva who descends from the same part of the Tuṣita Heaven and is born among humans, and he also accomplishes such merit.",
        "source": "T07n0220_444:0239c11_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_444:0239c13_16"
    },
    {
        "source_sentence": "是菩薩摩訶薩先世已於覩史多天慈氏菩薩摩訶薩所，請問般若波羅蜜多甚深義趣，",
        "translation": "In a previous life, the bodhisattva Mahāsattva questioned the profound meaning of the perfection of wisdom to the bodhisattva Mahāsattva Maitreya at the feet of the Bodhisattva Maitreya of Tuṣita.",
        "source": "T07n0220_444:0239c13_17"
    },
    {
        "source_sentence": "彼乘如是善根力故，從彼處沒來生人中，聞說如是甚深般若波羅蜜多深生信解，",
        "translation": "Because of the power of such roots of goodness, they descend from that place and are born among humans. When they hear this profound prajñāpāramitā taught, they deeply believe and understand it.",
        "source": "T07n0220_444:0239c15_18"
    },
    {
        "source_sentence": "書寫、受持、讀誦、修習、思惟、演說，供養恭敬、尊重讚歎，無懈倦心。",
        "translation": "They write, memorize, retain, recite, practice, contemplate, and expound it, offering support, honoring, venerating, respecting, and praising it without laziness.",
        "source": "T07n0220_444:0239c17_19"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0239c19_0"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，雖於先世得聞般若波羅蜜多乃至布施波羅蜜多，",
        "translation": "Good men and good women of the bodhisattva vehicle, even though in a prior life they had heard the perfection of wisdom or even the perfection of generosity,",
        "source": "T07n0220_444:0239c19_1"
    },
    {
        "source_sentence": "而不請問甚深義趣，今生人中聞說如是甚深般若波羅蜜多，其心迷悶、猶豫、怯弱，",
        "translation": "They don't ask about the profound meaning of the profound teaching, and now they're born among people who hear such profound prajñāpāramitā taught, their minds are confused, hesitant, and faint-hearted.",
        "source": "T07n0220_444:0239c21_2"
    },
    {
        "source_sentence": "或生異解，難可開悟。",
        "translation": "Or they may give rise to divergent understandings that are difficult to understand.",
        "source": "T07n0220_444:0239c22_3"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0239c23_4"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，雖於先世得聞內空乃至無性自性空，而不請問甚深義趣；",
        "translation": "Good men and good women of the bodhisattva vehicle, even if they had heard about internal emptiness up to the emptiness of a natureless self-nature in their previous lives, did not ask questions about its profound meaning.",
        "source": "T07n0220_444:0239c23_5"
    },
    {
        "source_sentence": "雖於先世得聞真如乃至不思議界，而不請問甚深義趣；",
        "translation": "Even though they had heard of the Teaching from their ancestors up to the inconceivable realm, they did not ask questions about its profound meaning.",
        "source": "T07n0220_444:0239c25_6"
    },
    {
        "source_sentence": "雖於先世得聞苦、集、滅、道聖諦，而不請問甚深義趣。",
        "translation": "Even though they had heard of the noble truths of suffering, arising, cessation, and the path in a prior life, they didn't ask about their profound meaning.",
        "source": "T07n0220_444:0239c27_0"
    },
    {
        "source_sentence": "今生人中聞說如是甚深般若波羅蜜多，其心迷悶、猶豫、怯弱，或生異解，",
        "translation": "Among those who are now born among humans, when they hear the profound prajñāpāramitā taught in this way, their minds may become confused, hesitant, doubtful, and faint-hearted, or give rise to divergent understanding.",
        "source": "T07n0220_444:0239c28_1"
    },
    {
        "source_sentence": "難可開悟。",
        "translation": "It's difficult to enlighten.",
        "source": "T07n0220_444:0239c29_2"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0240a01_3"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，雖於先世得聞四靜慮、四無量、四無色定，",
        "translation": "Good men and good women of the bodhisattva vehicle, even if they had heard in a prior life the four meditations, the four immeasurable concentrations, and the four formless concentrations",
        "source": "T07n0220_444:0240a01_4"
    },
    {
        "source_sentence": "而不請問甚深義趣；",
        "translation": "They do not ask questions about profound meanings.",
        "source": "T07n0220_444:0240a02_5"
    },
    {
        "source_sentence": "雖於先世得聞八解脫、八勝處、九次第定、十遍處，而不請問甚深義趣；",
        "translation": "Even though they had heard of the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes in prior lifetimes, they did not ask about their profound meaning.",
        "source": "T07n0220_444:0240a03_6"
    },
    {
        "source_sentence": "雖於先世得聞四念住乃至八聖道支，而不請問甚深義趣；",
        "translation": "Even though they had heard of the four abodes of mindfulness up to the eightfold noble path in a prior life, they did not ask about its profound meaning.",
        "source": "T07n0220_444:0240a05_0"
    },
    {
        "source_sentence": "雖於先世得聞空、無相、無願解脫門，而不請問甚深義趣；",
        "translation": "Though they had in a prior life heard of the liberation doors of emptiness, signlessness, and wishlessness, yet they did not ask about their profound meaning.",
        "source": "T07n0220_444:0240a06_1"
    },
    {
        "source_sentence": "雖於先世得聞三乘、菩薩十地，而不請問甚深義趣。",
        "translation": "Even though they had heard of the ten stages of the three vehicles and bodhisattvas in previous lives, they didn't ask about their profound meaning.",
        "source": "T07n0220_444:0240a07_2"
    },
    {
        "source_sentence": "今生人中聞說如是甚深般若波羅蜜多，其心迷悶、猶豫、怯弱，或生異解，",
        "translation": "Among those who are now born among humans, when they hear the profound prajñāpāramitā taught in this way, their minds may become confused, hesitant, doubtful, and faint-hearted, or give rise to divergent understanding.",
        "source": "T07n0220_444:0240a08_3"
    },
    {
        "source_sentence": "難可開悟。",
        "translation": "It's difficult to enlighten.",
        "source": "T07n0220_444:0240a10_4"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0240a10_5"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，雖於先世得聞五眼、六神通，而不請問甚深義趣；",
        "translation": "Good men and good women of the enlightening beings’ vehicle, though they had heard of the five eyes and the six supernatural powers in a past life, did not ask questions about their profound meaning.",
        "source": "T07n0220_444:0240a10_6"
    },
    {
        "source_sentence": "雖於先世得聞佛十力乃至十八佛不共法，而不請問甚深義趣；",
        "translation": "Even though they had heard of the ten powers of buddhas in former ages, up to the unique qualities of the eighteen buddhas, they did not ask questions about their profound meaning.",
        "source": "T07n0220_444:0240a12_7"
    },
    {
        "source_sentence": "雖於先世得聞三十二大士相、八十隨好，而不請問甚深義趣；",
        "translation": "Even though they had heard of the thirty-two marks and eighty secondary signs of great beings in a previous life, they did not ask about their profound meaning.",
        "source": "T07n0220_444:0240a14_8"
    },
    {
        "source_sentence": "雖於先世得聞無忘失法、恒住捨性，而不請問甚深義趣；",
        "translation": "Even though they had heard the Teaching of nonforgetfulness in former existences and always adhered to equanimity, they did not ask questions about its profound meaning.",
        "source": "T07n0220_444:0240a15_9"
    },
    {
        "source_sentence": "雖於先世得聞陀羅尼門、三摩地門，而不請問甚深義趣；",
        "translation": "Even though they had heard the teachings of enlightening beings’ incantations and concentration formulae from their predecessors, they did not ask questions about profound meanings.",
        "source": "T07n0220_444:0240a16_10"
    },
    {
        "source_sentence": "雖於先世得聞菩薩摩訶薩行、諸佛無上正等菩提，而不請問甚深義趣；",
        "translation": "Though they had heard of the practices of great enlightening beings and the supreme perfect enlightenment of buddhas in former ages, they did not ask about their profound meaning.",
        "source": "T07n0220_444:0240a18_11"
    },
    {
        "source_sentence": "雖於先世得聞一切智、道相智、一切相智，而不請問甚深義趣，今生人中聞說如是甚深般若波羅蜜多，",
        "translation": "Even though in a previous life he had heard of omniscience, knowledge of the path, and knowledge of all characteristics, he didn't ask about the profound meaning or goal, but now he's born among humans and hears such a profound prajñāpāramitā.",
        "source": "T07n0220_444:0240a19_12"
    },
    {
        "source_sentence": "其心迷悶、猶豫、怯弱，或生異解，難可開悟。",
        "translation": "Their minds are confused, hesitant, and faint-hearted, or they may give rise to divergent understanding that's difficult to enlighten.",
        "source": "T07n0220_444:0240a22_13"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0240a24_0"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，雖於先世得聞般若波羅蜜多，亦曾請問甚深義趣，",
        "translation": "Good men and good women of the bodhisattva vehicle, even if they had heard the prajñāpāramitā in a previous life, were also asked about its profound meaning.",
        "source": "T07n0220_444:0240a24_1"
    },
    {
        "source_sentence": "或經一日、二日、三日、四日、五日，而不如說精進修行。",
        "translation": "Or it might take a day, two days, three days, four days, or five days, but it's not as good as saying that they're cultivating effort.",
        "source": "T07n0220_444:0240a26_2"
    },
    {
        "source_sentence": "今生人中聞說如是甚深般若波羅蜜多，設經一日、二日、三日、四日、五日，",
        "translation": "Suppose he were to be born among humans and hear the profound prajñāpāramitā taught for one day, two days, three days, four days, or five days.",
        "source": "T07n0220_444:0240a27_3"
    },
    {
        "source_sentence": "其心堅固無能壞者，若離所聞甚深般若波羅蜜多，尋便退失心生猶豫。",
        "translation": "If someone's mind is resolute and indestructible, then they'll become hesitant if they part with the profound prajñāpāramitā that they've heard and regress from it.",
        "source": "T07n0220_444:0240a28_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0240b01_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_444:0240b01_6"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等由於先世得聞般若波羅蜜多，雖亦請問甚深義趣，",
        "translation": "Good men and good women of the bodhisattva vehicle, having heard the perfection of wisdom from their predecessors in a previous life, even though they may ask about its profound meaning,",
        "source": "T07n0220_444:0240b01_7"
    },
    {
        "source_sentence": "而不如說精進修行故，於今生若遇善友慇懃勸勵，便樂聽受甚深般若波羅蜜多，",
        "translation": "He doesn't explain that it's because of the cultivation of effort, and if he meets a good friend in his present life who encourages him, then he'll be happy to hear and accept the profound prajñāpāramitā.",
        "source": "T07n0220_444:0240b03_8"
    },
    {
        "source_sentence": "若無善友慇懃勸勵，便於此經不樂聽受。",
        "translation": "If they don't have good friends to encourage them, then they won't be happy to hear or accept this sūtra.",
        "source": "T07n0220_444:0240b05_9"
    },
    {
        "source_sentence": "彼於般若波羅蜜多，或時樂聞、或時不樂、或時堅固、或時退失，其心輕動進退非恒，",
        "translation": "When they hear the perfection of wisdom sometimes with pleasure, sometimes without pleasure, sometimes steadfast, sometimes regressing, their minds may be disheartened, but progress and retreat aren’t constant.",
        "source": "T07n0220_444:0240b06_10"
    },
    {
        "source_sentence": "猶如輕毛隨風飄轉。",
        "translation": "It's like a light hair that floats in the wind.",
        "source": "T07n0220_444:0240b08_11"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等，發趣大乘經時未久，未多親近真善知識，",
        "translation": "Good men and good women who thus abide in the bodhisattva vehicle have not long since set out for the great vehicle scriptures, nor have they become intimate with true spiritual benefactors.",
        "source": "T07n0220_444:0240b08_12"
    },
    {
        "source_sentence": "未多供養諸佛世尊，未曾受持、讀誦、書寫、思惟、演說甚深般若波羅蜜多。",
        "translation": "They haven't made many offerings to the buddhas and world-honored ones, and they haven't memorized, recited, written, contemplated, or taught the profound prajñāpāramitā.",
        "source": "T07n0220_444:0240b10_13"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0240b12_14"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等，未學般若波羅蜜多乃至布施波羅蜜多，",
        "translation": "Good men and good women of the bodhisattva vehicle who haven't studied the perfection of wisdom or even the perfection of generosity,",
        "source": "T07n0220_444:0240b12_15"
    },
    {
        "source_sentence": "未學內空乃至無性自性空，未學真如乃至不思議界，未學苦、集、滅、道聖諦，",
        "translation": "They haven’t studied internal emptiness or even the emptiness of the natureless self-nature; they haven’t studied true suchness or even the inconceivable realm; they haven’t studied the noble truths of suffering, arising, cessation, and the path.",
        "source": "T07n0220_444:0240b14_16"
    },
    {
        "source_sentence": "未學四靜慮、四無量、四無色定，未學八解脫、八勝處、九次第定、十遍處，",
        "translation": "Those who haven’t studied the four meditations, the four immeasurable concentrations, or the four formless concentrations; those who haven’t studied the eight liberations, the eight spheres of mastery, the nine graduated concentrations, or the ten universal abodes.",
        "source": "T07n0220_444:0240b16_17"
    },
    {
        "source_sentence": "未學四念住乃至八聖道支，未學空、無相、無願解脫門，未學三乘、菩薩十地，",
        "translation": "They haven’t studied the liberation gate of emptiness, signlessness, and wishlessness; they haven’t studied the three vehicles or the ten stages of enlightening beings.",
        "source": "T07n0220_444:0240b17_18"
    },
    {
        "source_sentence": "未學五眼、六神通，未學如來十力乃至十八佛不共法，未學三十二大士相、八十隨好，",
        "translation": "They had not studied the five eyes, the six supernatural powers, the ten powers of buddhahood, up to the unique qualities of the eighteen buddhas. They had not studied the thirty-two marks and the eighty secondary signs of greatness of a great person.",
        "source": "T07n0220_444:0240b19_19"
    },
    {
        "source_sentence": "未學無忘失法、恒住捨性，未學一切陀羅尼門、三摩地門，未學一切菩薩摩訶薩行、諸佛無上正等菩提，",
        "translation": "They haven’t studied the Dharma of no forgetfulness and always abide in equanimity; they haven’t studied all the teachings of dhāraṇī and samādhi; they haven’t studied all the practices of enlightening beings and the unsurpassed perfect enlightenment of buddhas.",
        "source": "T07n0220_444:0240b21_20"
    },
    {
        "source_sentence": "未學一切智、道相智、一切相智。",
        "translation": "They haven't studied omniscience, knowledge of the path, or knowledge of all characteristics.",
        "source": "T07n0220_444:0240b23_21"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0240b24_22"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等新趣大乘，於大乘法成就少分信敬愛樂，",
        "translation": "Good men and good women of the bodhisattva vehicle who are newly engaged in the great vehicle have little faith, respect, veneration, or delight in the teachings of the great vehicle.",
        "source": "T07n0220_444:0240b24_23"
    },
    {
        "source_sentence": "未能書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多。",
        "translation": "They can't write, memorize, recite, cultivate, contemplate, or explain the profound prajñāpāramitā for others.",
        "source": "T07n0220_444:0240b26_24"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0240b27_25"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，若不書寫、受持、讀誦、修習、思惟、為他演說甚深般若波羅蜜多，",
        "translation": "If the good men and good women who live in the bodhisattva vehicle don't write, memorize, recite, cultivate, contemplate, and explain the profound prajñāpāramitā for others,",
        "source": "T07n0220_444:0240b27_26"
    },
    {
        "source_sentence": "若不以般若波羅蜜多乃至布施波羅蜜多攝受有情，乃至若不以一切智、道相智、一切相智攝受有情，",
        "translation": "If someone doesn't take in sentient beings with the perfection of wisdom or even the perfection of generosity, or if they don't take in sentient beings with omniscience, knowledge of the path, and knowledge of all characteristics,",
        "source": "T07n0220_444:0240c01_0"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等，不為般若波羅蜜多乃至布施波羅蜜多之所守護，",
        "translation": "These are the good men and good women of the bodhisattva vehicle who aren't guarded by the perfection of wisdom or even the perfection of generosity.",
        "source": "T07n0220_444:0240c03_1"
    },
    {
        "source_sentence": "乃至不為一切智、道相智、一切相智之所守護。",
        "translation": "They won't be guarded by omniscience, knowledge of the path, or knowledge of all characteristics.",
        "source": "T07n0220_444:0240c05_2"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等，不能隨順修行般若波羅蜜多乃至布施波羅蜜多，",
        "translation": "Good men and good women of the bodhisattva vehicle can't follow the cultivation of the perfection of wisdom or even the perfection of generosity,",
        "source": "T07n0220_444:0240c06_3"
    },
    {
        "source_sentence": "乃至不能隨順修行一切智、道相智、一切相智，由此因緣墮聲聞地、或獨覺地。",
        "translation": "They can't follow the cultivation of omniscience, knowledge of the path, or knowledge of all characteristics, and because of these causes and conditions they fall into the stage of śrāvakas or solitary realizers.",
        "source": "T07n0220_444:0240c08_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0240c09_5"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等於深般若波羅蜜多，不能書寫、受持、讀誦、修習、思惟、為他演說，",
        "translation": "Good men and good women of the bodhisattva vehicle can't write, memorize, recite, cultivate, contemplate, or explain the profound prajñāpāramitā to others.",
        "source": "T07n0220_444:0240c10_0"
    },
    {
        "source_sentence": "亦不能以甚深般若波羅蜜多，廣說乃至一切相智攝受有情，不能隨順修行般若波羅蜜多，",
        "translation": "Nor can they take in sentient beings with the profound prajñāpāramitā and extensively explain it up to the knowledge of all characteristics, and they can't follow and cultivate the practice of the prajñāpāramitā.",
        "source": "T07n0220_444:0240c12_1"
    },
    {
        "source_sentence": "廣說乃至一切相智，不為般若波羅蜜多之所守護，乃至不為一切相智之所守護，",
        "translation": "It's explained in detail up to the knowledge of all characteristics that isn't guarded by the perfection of wisdom, and it's not guarded by the knowledge of all characteristics.",
        "source": "T07n0220_444:0240c14_2"
    },
    {
        "source_sentence": "由此因緣墮聲聞地、或獨覺地。」",
        "translation": "As a result, they'll fall into the stage of śrāvakas or the stage of pratyekabuddhas.",
        "source": "T07n0220_444:0240c16_3"
    },
    {
        "source_sentence": "第二分船等喻品第四十九之一",
        "translation": "Chapter 49 of the Second Part: The Parable of the Boat, etc.",
        "source": "T07n0220_444:0240c17_0"
    },
    {
        "source_sentence": "佛告善現：「譬如泛海所乘船破，其中諸人若不取木、器物、浮囊、板片、死屍為依附者，",
        "translation": "The Buddha told Śaṅgālī, Suppose a boat on the high seas breaks down and people in it don't take wood, vessels, floating bags, planks, or dead corpses as their support.",
        "source": "T07n0220_444:0240c18_0"
    },
    {
        "source_sentence": "定知溺死不至彼岸。",
        "translation": "They'll surely know they're drowning and won't reach the other side.",
        "source": "T07n0220_444:0240c19_1"
    },
    {
        "source_sentence": "若能取木、器物、浮囊、板片、死屍為所依附，當知是類終不沒死，得至安隱大海彼岸，",
        "translation": "If they can take wood, vessels, floating cases, planks, and corpses as their supports, you should know that these things will never sink or die until they reach the other shore of the peaceful ocean.",
        "source": "T07n0220_444:0240c20_2"
    },
    {
        "source_sentence": "無損無害受諸快樂。",
        "translation": "It's neither harmful nor harmful to the pleasures that are experienced.",
        "source": "T07n0220_444:0240c22_3"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0240c22_4"
    },
    {
        "source_sentence": "若菩薩乘諸善男子、善女人等，雖於大乘成就少分信敬愛樂，若不書寫、受持、讀誦、思惟、修習、為他演說甚深般若波羅蜜多為所依附，",
        "translation": "If bodhisattva-vehicle good men and good women, even though they have little faith in the accomplishment of the great vehicle with respect and affection, don't write, memorize, recite, contemplate, cultivate, and explain the profound prajñāpāramitā for others as their attachment,",
        "source": "T07n0220_444:0240c22_5"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等，中道衰敗不證無上正等菩提，",
        "translation": "Good men and good women who thus abide in the bodhisattva vehicle will fail to realize unsurpassed true and complete enlightenment,",
        "source": "T07n0220_444:0240c26_0"
    },
    {
        "source_sentence": "退入聲聞或獨覺地。",
        "translation": "They regress into the stages of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_444:0240c27_1"
    },
    {
        "source_sentence": "若菩薩乘諸善男子、善女人等，有於大乘成就圓滿信敬愛樂，若能書寫、受持、讀誦、思惟、修習、為他演說甚深般若波羅蜜多為所依附，",
        "translation": "Suppose there are good men and good women of the bodhisattva vehicle who have perfect faith, respect, veneration, and joy in the accomplishment of the great vehicle, and if they can write, memorize, recite, contemplate, cultivate, and explain the profound prajñāpāramitā for others as their attachment,",
        "source": "T07n0220_444:0240c28_2"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等，終不中道退入聲聞或獨覺地，",
        "translation": "Good men and good women who thus abide in the bodhisattva vehicle never regress from the middle way into the stages of śrāvakahood or pratyekabuddhahood.",
        "source": "T07n0220_444:0241a02_3"
    },
    {
        "source_sentence": "定證無上正等菩提。",
        "translation": "He'll surely realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0241a03_4"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0241a04_5"
    },
    {
        "source_sentence": "如人欲度險惡曠野，若不攝受資糧器具，不能達到安樂國土，於其中道遭苦失命。",
        "translation": "Suppose a person wants to cross the dangerous wilderness, but if they don't gather provisions and necessities, they can't reach the land of peace and happiness, and their path will be painful and lose their life.",
        "source": "T07n0220_444:0241a04_6"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0241a06_7"
    },
    {
        "source_sentence": "若菩薩乘諸善男子、善女人等，設於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "Suppose there are good men and good women of the bodhisattva vehicle who have faith in unsurpassed perfect enlightenment, patience, a pure mind, superior aspiration, desire, resolve, equanimity, and effort.",
        "source": "T07n0220_444:0241a06_8"
    },
    {
        "source_sentence": "若不攝受甚深般若波羅蜜多及餘功德，當知如是住菩薩乘諸善男子、善女人等，",
        "translation": "If they don't embrace the profound prajñāpāramitā and other virtues, you should know that such good men and good women who abide in the bodhisattva vehicle are like this.",
        "source": "T07n0220_444:0241a09_0"
    },
    {
        "source_sentence": "中道衰敗不證無上正等菩提，退入聲聞或獨覺地。",
        "translation": "The middle way is declining, doesn't realize unsurpassed perfect enlightenment, and regresses into the stages of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_444:0241a10_1"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0241a12_2"
    },
    {
        "source_sentence": "如人欲度險惡曠野，若能攝受資糧器具，必當達到安樂國土，終不中道遭苦捨命。",
        "translation": "Suppose a person wants to cross the dangerous wilderness, and if they can gather provisions and necessities, they'll surely reach a land of peace and happiness, but they won't end up suffering in the middle way or giving up their life.",
        "source": "T07n0220_444:0241a12_3"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0241a14_4"
    },
    {
        "source_sentence": "若菩薩乘諸善男子、善女人等，已於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "“Good men and good women of the bodhisattva vehicle, if they have faith in unsurpassed true and complete enlightenment, patience, a pure mind, superior aspiration, desire, resolve, and equanimity,",
        "source": "T07n0220_444:0241a14_5"
    },
    {
        "source_sentence": "復能攝受甚深般若波羅蜜多及餘功德，當知如是住菩薩乘諸善男子、善女人等，",
        "translation": "Furthermore, they can embrace the profound prajñāpāramitā and other virtues, knowing that such good men and good women who abide in the bodhisattva vehicle are likewise.",
        "source": "T07n0220_444:0241a16_6"
    },
    {
        "source_sentence": "終不中道損耗退敗，超聲聞地及獨覺地，成熟有情、嚴淨佛土，疾證無上正等菩提。",
        "translation": "They'll never fall into the middle way, lose or regress, transcend the stages of śrāvakas and pratyekbuddhas, mature sentient beings and adorn and purify the Buddha land, and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0241a18_7"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0241a21_0"
    },
    {
        "source_sentence": "譬如男子及諸女人，執持坏瓶詣河取水，若池、若井、若泉、若渠，當知此瓶不久爛壞。",
        "translation": "It's like when a man or woman takes a broken vase and goes to a river to get water, whether it's a pool, a well, a spring, or a canal, you should know that this vase won't soon rot.",
        "source": "T07n0220_444:0241a21_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0241a23_2"
    },
    {
        "source_sentence": "是瓶未熟不堪盛水，終歸地故。",
        "translation": "It's because the pot hasn't yet matured and can't contain water, so it ultimately returns to the ground.",
        "source": "T07n0220_444:0241a23_3"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0241a24_0"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，設於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "Good men and good women of the bodhisattva vehicle, suppose there's faith, forbearance, purity of mind, superior aspiration, desire, resolve, and equanimity in unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0241a24_1"
    },
    {
        "source_sentence": "若不攝受甚深般若波羅蜜多方便善巧，則便遠離般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "If someone doesn't gather the skillful means of the profound perfection of wisdom, then they'll be far removed from the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T07n0220_444:0241a26_2"
    },
    {
        "source_sentence": "亦復遠離內空、外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空，",
        "translation": "“Furthermore, they are also far removed from internal emptiness, external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, infinite emptiness, dispersed emptiness, nondispersed emptiness, emptiness of original nature, emptiness of own-nature, emptiness",
        "source": "T07n0220_444:0241a28_3"
    },
    {
        "source_sentence": "亦復遠離真如、法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界，",
        "translation": "“Furthermore, they are also far removed from the realm of reality, the realm of dharmas, the nature of dharmas, non-falsity, unchanging and dissimilarity, equality, freedom from arising, legality, the abode of dharmas, reality, space, and inconceivability.",
        "source": "T07n0220_444:0241b03_4"
    },
    {
        "source_sentence": "亦復遠離苦、集、滅、道聖諦，亦復遠離四靜慮、四無量、四無色定，",
        "translation": "“Furthermore, they are also far removed from the noble truths of suffering, arising, cessation, and the path. They are also far removed from the four meditations, the four immeasurable concentrations, and the four formless concentrations.",
        "source": "T07n0220_444:0241b05_5"
    },
    {
        "source_sentence": "亦復遠離八解脫、八勝處、九次第定、十遍處，亦復遠離四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "“Furthermore, they are also far removed from the eight liberations, the eight spheres of mastery, the nine graduated concentrations, and the ten universal abodes. They are also far removed from the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlighten",
        "source": "T07n0220_444:0241b06_6"
    },
    {
        "source_sentence": "亦復遠離空、無相、無願解脫門，亦復遠離菩薩十地，亦復遠離五眼、六神通，",
        "translation": "They are also far removed from the liberation gate of emptiness, signlessness, and wishlessness. They are also far removed from the ten stages of enlightening beings’ bodhisattvahood; they are also far removed from the five eyes and six transcendent powers.",
        "source": "T07n0220_444:0241b09_7"
    },
    {
        "source_sentence": "亦復遠離如來十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法，",
        "translation": "He was also far removed from the ten powers of the Buddha, the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, and the unique qualities of the eighteen buddhas.",
        "source": "T07n0220_444:0241b10_8"
    },
    {
        "source_sentence": "亦復遠離無忘失法、恒住捨性，亦復遠離陀羅尼門、三摩地門，亦復遠離成熟有情、嚴淨佛土，",
        "translation": "They are also far removed from the principle of nonforgetfulness and constantly abiding in equanimity. They are also far removed from the teachings of dhāraṇī and samādhi. They are also far removed from developing sentient beings and purifying buddha-lands.",
        "source": "T07n0220_444:0241b12_9"
    },
    {
        "source_sentence": "亦復遠離一切智、道相智、一切相智。",
        "translation": "Again, he's far removed from omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_444:0241b14_10"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等，中道衰敗不證無上正等菩提，",
        "translation": "Good men and good women who thus abide in the bodhisattva vehicle will fail to realize unsurpassed true and complete enlightenment,",
        "source": "T07n0220_444:0241b15_11"
    },
    {
        "source_sentence": "退入聲聞或獨覺地。",
        "translation": "They regress into the stages of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_444:0241b17_12"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0241b17_13"
    },
    {
        "source_sentence": "譬如男子或諸女人，持燒熟瓶詣河取水，若池、若井、若泉、若渠，當知此瓶終不爛壞。",
        "translation": "It's like a man or woman who takes a cooked pot and goes to a river to fetch water, whether it's a pool, a well, a spring, or a canal, you should know that this pot will never rot.",
        "source": "T07n0220_444:0241b17_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0241b19_15"
    },
    {
        "source_sentence": "是瓶善熟堪任盛水，極堅牢故。",
        "translation": "It's because the vial is well-ripe and capable of filling water, which makes it extremely hard and strong.",
        "source": "T07n0220_444:0241b20_0"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0241b20_1"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，若於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "Good men and good women of the bodhisattva vehicle, if they have faith in unsurpassed true and complete enlightenment, patience, a pure mind, superior aspiration, desire, resolve, and equanimity,",
        "source": "T07n0220_444:0241b20_2"
    },
    {
        "source_sentence": "復能攝受甚深般若波羅蜜多方便善巧，便不遠離般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "They can also skillfully collect the profound perfection of wisdom, and they aren’t far removed from the perfections of wisdom, meditation, effort, patience, morality, and generosity.",
        "source": "T07n0220_444:0241b23_3"
    },
    {
        "source_sentence": "如是乃至不遠離一切智、道相智、一切相智，由是因緣常為諸佛及諸菩薩摩訶薩眾攝受護念。",
        "translation": "Thus, up to the point where they aren't separate from omniscience, knowledge of the path, and knowledge of all characteristics, it's because of these causes and conditions that they are always collected and guarded by the buddhas and bodhisattva-mahāsattvas.",
        "source": "T07n0220_444:0241b25_4"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等，終不中道衰耗退敗，超聲聞地及獨覺地，",
        "translation": "Good men and good women who thus abide in the bodhisattva vehicle will never fall into the middle way or regress, transcending the stages of śrāvakas and pratyekbuddhas.",
        "source": "T07n0220_444:0241b27_5"
    },
    {
        "source_sentence": "成熟有情、嚴淨佛土，疾證無上正等菩提。",
        "translation": "They ripen sentient beings and adorn the Buddha land, quickly realizing unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0241b29_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0241c02_0"
    },
    {
        "source_sentence": "譬如商人無巧便智，船在海岸未具裝治，即持財物安置其上，牽著水中速便進發。",
        "translation": "It's like a merchant who lacks the knowledge of skillful means and doesn't have the knowledge of skillful means when his boat is on the shore, so he puts his possessions on top of it and pulls them into the water to quickly advance.",
        "source": "T07n0220_444:0241c02_1"
    },
    {
        "source_sentence": "當知是船中道壞沒，人船財物各散異處，如是商人無巧便智，喪失身命及大財寶。",
        "translation": "You should know that this is a boat that's on the way and breaks down, with people and their possessions scattered in different places, and thus the merchant has no skillful knowledge, losing his body, life, or great wealth.",
        "source": "T07n0220_444:0241c04_2"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0241c06_0"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，設於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "Good men and good women of the bodhisattva vehicle, suppose there's faith, forbearance, purity of mind, superior aspiration, desire, resolve, and equanimity in unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0241c06_1"
    },
    {
        "source_sentence": "若不攝受甚深般若波羅蜜多方便善巧，則便遠離般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "If someone doesn't gather the skillful means of the profound perfection of wisdom, then they'll be far removed from the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T07n0220_444:0241c08_2"
    },
    {
        "source_sentence": "如是乃至遠離一切智、道相智、一切相智，當知如是住菩薩乘諸善男子、善女人等中道衰敗，",
        "translation": "Thus, up to the point where they're far removed from omniscience, knowledge of the path, and knowledge of all characteristics, you should know that such-and-such abiding bodhisattva vehicle good men and good women in the middle way are declining.",
        "source": "T07n0220_444:0241c10_3"
    },
    {
        "source_sentence": "喪失身命及大財寶，喪身命者謂墮聲聞或獨覺地，失財寶者謂失無上正等菩提。",
        "translation": "Losing one's body, life, and great possessions means falling into the stages of śrāvakas or pratyekbuddhas; losing their possessions means losing unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0241c12_4"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0241c14_5"
    },
    {
        "source_sentence": "譬如商人有巧便智，先在海岸裝治船已，方牽入水知無穿穴，後持財物置上而去，",
        "translation": "It's like a merchant with skillful means and wisdom who first prepares his boat at the shore, pulls it into the water, knows there's no hole to penetrate, puts his possessions on board, and departs.",
        "source": "T07n0220_444:0241c15_6"
    },
    {
        "source_sentence": "當知是船必不壞沒，人物安隱達所至處。",
        "translation": "You should know that this boat will surely not break down, and the people will be at peace wherever they go.",
        "source": "T07n0220_444:0241c17_0"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0241c17_1"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，若於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "Good men and good women of the bodhisattva vehicle, if they have faith in unsurpassed true and complete enlightenment, patience, a pure mind, superior aspiration, desire, resolve, and equanimity,",
        "source": "T07n0220_444:0241c18_2"
    },
    {
        "source_sentence": "復能攝受甚深般若波羅蜜多方便善巧，便不遠離般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "They can also skillfully collect the profound perfection of wisdom, and they aren’t far removed from the perfections of wisdom, meditation, effort, patience, morality, and generosity.",
        "source": "T07n0220_444:0241c20_3"
    },
    {
        "source_sentence": "乃至不遠離一切智、道相智、一切相智，由是因緣常為諸佛及諸菩薩摩訶薩眾攝受護念。",
        "translation": "It's not separate from omniscience, knowledge of the path and knowledge of all characteristics, and therefore it's always guarded by the buddhas and bodhisattva-mahāsattvas for these reasons.",
        "source": "T07n0220_444:0241c22_4"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等，終不中道衰耗退敗，超聲聞地及獨覺地，",
        "translation": "Good men and good women who thus abide in the bodhisattva vehicle will never fall into the middle way or regress, transcending the stages of śrāvakas and pratyekbuddhas.",
        "source": "T07n0220_444:0241c24_5"
    },
    {
        "source_sentence": "成熟有情、嚴淨佛土，疾證無上正等菩提。",
        "translation": "They ripen sentient beings and adorn the Buddha land, quickly realizing unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0241c26_6"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0241c28_0"
    },
    {
        "source_sentence": "譬如有人年百二十，老耄衰朽復加眾病，所謂風病、熱病、淡病或三雜病，",
        "translation": "Good man, this is analogous to someone aged one hundred and twenty years of age who becomes old and decrepit and suffers from various illnesses such as wind, fever, heat, hypothermia, or any of the three kinds of disorders.",
        "source": "T07n0220_444:0241c28_1"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_444:0241c29_2"
    },
    {
        "source_sentence": "是老病人頗從床座能自起不？」",
        "translation": "Is this old sick man able to get up on his own from his seat?",
        "source": "T07n0220_444:0242a01_3"
    },
    {
        "source_sentence": "善現對曰：「不也！",
        "translation": "Sunetra replied, No!",
        "source": "T07n0220_444:0242a01_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_444:0242a02_5"
    },
    {
        "source_sentence": "不也！",
        "translation": "No, it is not.",
        "source": "T07n0220_444:0242a02_6"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T07n0220_444:0242a02_7"
    },
    {
        "source_sentence": "佛告善現：「是人設有扶令起立，亦無力行一俱盧舍、二俱盧舍、三俱盧舍。",
        "translation": "The Buddha told Shancheng, Suppose that person has the power to help them get up and establish themselves, but they don't have the power to practice one krośa, two krośas, or three krośas.",
        "source": "T07n0220_444:0242a02_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_444:0242a04_9"
    },
    {
        "source_sentence": "老病甚故。",
        "translation": "It's because old age and illness are so serious.",
        "source": "T07n0220_444:0242a04_10"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0242a04_11"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，設於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "Good men and good women of the bodhisattva vehicle, suppose there's faith, forbearance, purity of mind, superior aspiration, desire, resolve, and equanimity in unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0242a04_12"
    },
    {
        "source_sentence": "若不攝受甚深般若波羅蜜多方便善巧，則便遠離般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "If someone doesn't gather the skillful means of the profound perfection of wisdom, then they'll be far removed from the perfections of prajñā, meditation, effort, patience, pure morality, and generosity.",
        "source": "T07n0220_444:0242a07_13"
    },
    {
        "source_sentence": "如是乃至遠離一切智、道相智、一切相智。",
        "translation": "Thus, it goes so far as to be free of omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_444:0242a09_14"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等中道衰敗，不證無上正等菩提，",
        "translation": "“Furthermore, it should be known that those who abide in the bodhisattva vehicle like this—good men and good women whose middle way has declined do not realize supreme awakening.",
        "source": "T07n0220_444:0242a10_15"
    },
    {
        "source_sentence": "退入聲聞或獨覺地。",
        "translation": "They regress into the stages of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_444:0242a12_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0242a12_17"
    },
    {
        "source_sentence": "以不攝受甚深般若波羅蜜多方便善巧，離諸功德，諸佛菩薩不護念故。",
        "translation": "Because they don't take in the profound prajñāpāramitā and skillful means of skillful means that are free of merit, the buddhas and bodhisattvas don't guard it.",
        "source": "T07n0220_444:0242a12_18"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0242a14_19"
    },
    {
        "source_sentence": "譬如有人年百二十，老耄衰朽，復加眾病，謂風、熱、淡或三雜病，是老病人欲從床座起往他處而自不能，",
        "translation": "Good man, this is analogous to someone as old and feeble as one hundred and twenty years of age who suffers from a combination of illnesses such as wind, heat, fever, thirst, or any of the three kinds of debilitating conditions. This is an elderly man who wishes to get up from his seat in order to go somewhere else but cannot do so himself.",
        "source": "T07n0220_444:0242a14_20"
    },
    {
        "source_sentence": "有二健人各扶一腋，徐策令起而告之言：『莫有所難，隨意欲往，我等二人終不相棄，",
        "translation": "There were two strong men, each supported by one armpit, who climbed slowly up to get up and told them, “There is no difficulty. Go where you wish.",
        "source": "T07n0220_444:0242a17_21"
    },
    {
        "source_sentence": "必達所趣安隱無損。』",
        "translation": "They'll surely reach the place where they're headed in peace and harmlessness.'",
        "source": "T07n0220_444:0242a18_22"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_444:0242a19_23"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，若於無上正等菩提有信、有忍、有清淨心、有勝意樂、有欲勝解、有捨精進，",
        "translation": "Good men and good women of the bodhisattva vehicle, if they have faith in unsurpassed true and complete enlightenment, patience, a pure mind, superior aspiration, desire, resolve, and equanimity,",
        "source": "T07n0220_444:0242a19_24"
    },
    {
        "source_sentence": "復能攝受甚深般若波羅蜜多方便善巧，便不遠離般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "They can also skillfully collect the profound perfection of wisdom, and they aren’t far removed from the perfections of wisdom, meditation, effort, patience, morality, and generosity.",
        "source": "T07n0220_444:0242a22_25"
    },
    {
        "source_sentence": "如是乃至不遠離一切智、道相智、一切相智。",
        "translation": "Thus, it's not separate from omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_444:0242a24_26"
    },
    {
        "source_sentence": "當知如是住菩薩乘諸善男子、善女人等，終不中道衰耗退敗，超聲聞地及獨覺地，",
        "translation": "Good men and good women who thus abide in the bodhisattva vehicle will never fall into the middle way or regress, transcending the stages of śrāvakas and pratyekbuddhas.",
        "source": "T07n0220_444:0242a25_27"
    },
    {
        "source_sentence": "成熟有情、嚴淨佛土，疾證無上正等菩提。",
        "translation": "They ripen sentient beings and adorn the Buddha land, quickly realizing unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0242a27_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0242a28_29"
    },
    {
        "source_sentence": "以能攝受甚深般若波羅蜜多方便善巧，具諸功德，諸佛菩薩共護念故。」",
        "translation": "Because they can take in the profound prajñāpāramitā with skillful means and virtue, the buddhas and bodhisattvas will guard it together.",
        "source": "T07n0220_444:0242a28_30"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_444:0242b01_0"
    },
    {
        "source_sentence": "云何住菩薩乘諸善男子、善女人等，由不攝受甚深般若波羅蜜多方便善巧，",
        "translation": "What are the good men and good women who abide in the bodhisattva vehicle because they don't take in the skillful means of the profound prajñāpāramitā?",
        "source": "T07n0220_444:0242b01_1"
    },
    {
        "source_sentence": "離諸功德，退墮聲聞及獨覺地，不證無上正等菩提？」",
        "translation": "Being free of merit, they regress to the stages of śrāvakas and pratyekbuddhas and don't realize unsurpassed perfect enlightenment?",
        "source": "T07n0220_444:0242b03_2"
    },
    {
        "source_sentence": "佛告善現：「善哉！",
        "translation": "The Buddha told Shancheng, Good!",
        "source": "T07n0220_444:0242b04_3"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T07n0220_444:0242b05_0"
    },
    {
        "source_sentence": "汝為利樂住菩薩乘諸善男子、善女人等問如是事，汝今諦聽，當為汝說。",
        "translation": "Good men and good women who abide in the bodhisattva vehicle for profit and pleasure ask about such things, listen closely and I will explain them to you.",
        "source": "T07n0220_444:0242b05_1"
    },
    {
        "source_sentence": "善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0242b06_2"
    },
    {
        "source_sentence": "有菩薩乘諸善男子、善女人等，從初發心執我、我所修行布施乃至般若波羅蜜多，",
        "translation": "Good men and good women of the bodhisattva vehicle, from the first arousal of their minds to cling to self and cultivate generosity based on self up to the perfection of wisdom,",
        "source": "T07n0220_444:0242b07_3"
    },
    {
        "source_sentence": "此善男子、善女人等修布施時作如是念：『我能行施，我施此物，彼受我施。』",
        "translation": "When these good men and good women cultivate generosity, they think, 'I can practice generosity, give this thing to me, and they'll accept my gift.'",
        "source": "T07n0220_444:0242b08_4"
    },
    {
        "source_sentence": "修淨戒時作如是念：『我能持戒，我持此戒，我具是戒。』",
        "translation": "When he cultivates pure precepts, he thinks, 'I can observe the precepts, I observe these precepts, and I have all these precepts.'",
        "source": "T07n0220_444:0242b10_5"
    },
    {
        "source_sentence": "修安忍時作如是念：『我能修忍，我於彼忍，我具是忍。』",
        "translation": "When he cultivates patience, he thinks, 'I can cultivate forbearance, and I'll tolerate them, and I'll have this kind of forbearance.'",
        "source": "T07n0220_444:0242b11_6"
    },
    {
        "source_sentence": "修精進時作如是念：『我能精進，我為此精進，我具是精進。』",
        "translation": "When he cultivates effort, he thinks, 'I can make effort, and I'll make this effort for myself, and I'll have all this effort.'",
        "source": "T07n0220_444:0242b13_7"
    },
    {
        "source_sentence": "修靜慮時作如是念：『我能修定，我為此修定，我具是定。』",
        "translation": "When he cultivates meditation, he thinks, 'I can cultivate concentration, and I cultivate concentration for this reason, and I'm fully concentrated.'",
        "source": "T07n0220_444:0242b14_8"
    },
    {
        "source_sentence": "修般若時作如是念：『我能修慧，我為此修慧，我具是慧。』",
        "translation": "When he cultivates prajñā, he thinks, 'I can cultivate wisdom, and I cultivate wisdom for this reason, and I'm fully endowed with wisdom.'",
        "source": "T07n0220_444:0242b15_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_444:0242b17_10"
    },
    {
        "source_sentence": "此善男子、善女人等修布施時執有是布施，執由此布施，執布施為我所；",
        "translation": "“Good sons and good daughters, when they practice giving, they hold to this kind of giving. They cling to that kind of giving, thinking it belongs to me.",
        "source": "T07n0220_444:0242b17_11"
    },
    {
        "source_sentence": "修淨戒時執有是淨戒，執由此淨戒，執淨戒為我所；",
        "translation": "When they practice pure precepts, they cling to the existence of such pure precepts. They cling to these pure precepts and believe that pure precepts belong to self.",
        "source": "T07n0220_444:0242b19_12"
    },
    {
        "source_sentence": "修安忍時執有是安忍，執由此安忍，執安忍為我所；",
        "translation": "When cultivating patience of peace, one clings to the existence of patience. One clings to this patience of peace and grasps patience as a self.",
        "source": "T07n0220_444:0242b20_13"
    },
    {
        "source_sentence": "修精進時執有是精進，執由此精進，執精進為我所；",
        "translation": "When they cultivate zeal, they think there is such zeal. They hold to this kind of zeal and believe that zeal belongs to me.",
        "source": "T07n0220_444:0242b21_14"
    },
    {
        "source_sentence": "修靜慮時執有是靜慮，執由此靜慮，執靜慮為我所；",
        "translation": "When one cultivates meditative absorption, one clings to the existence of that which is meditative absorption.",
        "source": "T07n0220_444:0242b22_15"
    },
    {
        "source_sentence": "修般若時執有是般若，執由此般若，執般若為我所。",
        "translation": "When he cultivates prajñā, he clings to the existence of this prajñā, clings to this prajñā, and clings to prajñā as self.",
        "source": "T07n0220_444:0242b23_16"
    },
    {
        "source_sentence": "是善男子、善女人等，我、我所執恒隨逐故，所行布施乃至般若波羅蜜多，",
        "translation": "Because these sons and daughters of a virtuous family always follow their attachment to self and what belongs to self, they practice generosity up to the perfection of wisdom.",
        "source": "T07n0220_444:0242b25_17"
    },
    {
        "source_sentence": "增長生死不能解脫生等眾苦。",
        "translation": "They grow in birth and death and can't be liberated from the many sufferings of birth and so forth.",
        "source": "T07n0220_444:0242b26_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_444:0242b27_19"
    },
    {
        "source_sentence": "布施波羅蜜多中無如是分別可起此執，乃至般若波羅蜜多中亦無如是分別可起此執。",
        "translation": "There's no such discrimination in the perfection of generosity that can give rise to this attachment, and there's no such discrimination in the perfection of wisdom that can give rise to this attachment.",
        "source": "T07n0220_444:0242b27_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_444:0242b29_21"
    },
    {
        "source_sentence": "遠離此彼岸是布施波羅蜜多相，乃至是般若波羅蜜多相故。",
        "translation": "Being far removed from this and that shore is the characteristic of the perfection of generosity, up to the characteristic of the perfection of wisdom.",
        "source": "T07n0220_444:0242b29_22"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_444:0242c01_23"
    },
    {
        "source_sentence": "此菩薩乘諸善男子、善女人等不知此岸彼岸相故，不能攝受布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "Because these good men and good women of the bodhisattva vehicle don't know this shore or the other shore, they can't gather in generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T07n0220_444:0242c01_24"
    },
    {
        "source_sentence": "乃至不能攝受一切智、道相智、一切相智，由是因緣，此菩薩乘諸善男子、善女人等，",
        "translation": "It's because these good men and good women of the bodhisattva vehicle can't embrace omniscience, knowledge of the path, or knowledge of all characteristics.",
        "source": "T07n0220_444:0242c03_25"
    },
    {
        "source_sentence": "墮聲聞地或獨覺地，不證無上正等菩提。」",
        "translation": "They'll fall into the stage of śrāvakas or the stage of pratyekbuddhas and won't realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_444:0242c05_26"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百四十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 14",
        "source": "T07n0220_444:0242c07_0"
    }
]