[
    {
        "source_sentence": "大般若波羅蜜多經卷第五百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 4",
        "source": "T07n0220_540:0774a02_0"
    },
    {
        "source_sentence": "十",
        "translation": "ten",
        "source": "T07n0220_540:0774a03_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_540:0774a05_0"
    },
    {
        "source_sentence": "第四分供養窣堵波品第三之二",
        "translation": "The Third and Second Parts of the Third Chapter of the Fourth Part: Making Offerings to the Stūpa",
        "source": "T07n0220_540:0774a06_0"
    },
    {
        "source_sentence": "爾時，天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T07n0220_540:0774a07_0"
    },
    {
        "source_sentence": "如是般若波羅蜜多甚奇希有，能調菩薩摩訶薩眾令離高心，迴向所求一切智智。」",
        "translation": "Such a prajñāpāramitā is rare and marvelous, able to tame the bodhisattvas, mahāsattvas, and sentient beings so that they part with their lofty minds and return to all the wisdom and knowledge they seek",
        "source": "T07n0220_540:0774a07_1"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「云何般若波羅蜜多甚奇希有，能調菩薩摩訶薩眾令離高心，",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, How marvelous is the prajñāpāramitā that can tame the bodhisattvas and mahāsattvas so that they're free of lofty mind",
        "source": "T07n0220_540:0774a09_2"
    },
    {
        "source_sentence": "迴向所求一切智智？」",
        "translation": "What's the omniscience and cognition that they seek in return?",
        "source": "T07n0220_540:0774a11_3"
    },
    {
        "source_sentence": "時，天帝釋白言：「世尊！",
        "translation": "Śakra Devānām-Indra then said, Bhagavān!",
        "source": "T07n0220_540:0774a11_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩不依般若波羅蜜多，修行布施乃至般若及餘種種諸佛法時，",
        "translation": "Suppose a bodhisattva-mahāsattva doesn't rely on the perfection of wisdom when he cultivates generosity or even prajñā and other various buddha-teachings,",
        "source": "T07n0220_540:0774a12_5"
    },
    {
        "source_sentence": "無方便善巧故，雖修諸善而起高心，不能迴向一切智智；",
        "translation": "Because of the absence of skill in means, they develop lofty aspirations even though cultivating goodness; they cannot dedicate themselves back to omniscience and knowledge.",
        "source": "T07n0220_540:0774a14_6"
    },
    {
        "source_sentence": "若菩薩摩訶薩依止般若波羅蜜多，修行布施乃至般若及餘種種諸佛法時，",
        "translation": "Suppose a bodhisattva Mahāsattva relies on the prajñāpāramitā to cultivate generosity up to the point where he practices prajñā and other various buddha-teachings.",
        "source": "T07n0220_540:0774a15_7"
    },
    {
        "source_sentence": "有方便善巧故，所修諸善調伏高心，迴向所求一切智智。」",
        "translation": "Because there are skillful means, they cultivate well-adjusted and lofty minds that dedicate themselves back to the omniscience and knowledge that they seek.",
        "source": "T07n0220_540:0774a17_8"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_540:0774a18_9"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0774a19_0"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_540:0774a19_1"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774a19_2"
    },
    {
        "source_sentence": "若善男子、善女人等能於般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "If good men and good women can wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate the perfection of wisdom,",
        "source": "T07n0220_540:0774a19_3"
    },
    {
        "source_sentence": "是善男子、善女人等身心安樂，不為一切災橫侵惱。",
        "translation": "Good men and good women, their bodies and minds are peaceful and they won't be harmed by all the calamities.",
        "source": "T07n0220_540:0774a21_4"
    },
    {
        "source_sentence": "若在軍旅交戰陣時，至心念誦如是般若波羅蜜多，於諸有情慈悲護念，",
        "translation": "“When they are engaged in battles, they wholeheartedly recite the transcendent wisdom of these teachings to protect sentient beings with compassion.",
        "source": "T07n0220_540:0774a23_5"
    },
    {
        "source_sentence": "不為刀杖之所傷殺，所對怨敵皆起慈心，設起惡心自然退敗。",
        "translation": "They won't be harmed by a sword or cane, become compassionate to enemies and opponents, and naturally retreat if they give rise to bad thoughts.",
        "source": "T07n0220_540:0774a24_6"
    },
    {
        "source_sentence": "是善男子、善女人等，若在軍旅刀箭所傷失命喪身，終無是處。",
        "translation": "Good men and good women, if they are injured by an army, a sword, or an arrow, there's no place for them to die or lose their bodies.",
        "source": "T07n0220_540:0774a26_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0774a27_8"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774a27_9"
    },
    {
        "source_sentence": "是善男子、善女人等修行般若波羅蜜多，自能降伏煩惱、惡業、種種刀杖，",
        "translation": "Good men and good women who cultivate the perfection of wisdom can themselves subdue afflictions, bad actions, and various weapons.",
        "source": "T07n0220_540:0774a27_10"
    },
    {
        "source_sentence": "亦能除他煩惱、惡業、諸刀杖故。",
        "translation": "It's also able to remove the afflictions, bad actions, and swords and sticks of others.",
        "source": "T07n0220_540:0774a29_11"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0774b01_12"
    },
    {
        "source_sentence": "若善男子、善女人等能於般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、供養恭敬、尊重讚歎、書寫、解說、廣令流布，",
        "translation": "If good men and good women can wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, offer support and respect, venerate and praise, write, explain, and disseminate the perfection of wisdom,",
        "source": "T07n0220_540:0774b01_13"
    },
    {
        "source_sentence": "是善男子、善女人等，一切毒藥、蠱道、鬼魅、厭禱、呪術皆不能害，",
        "translation": "Good men and good women can't harm all the poisons, paths of delusion, ghosts, spells, prayers, or spells that are disgusting.",
        "source": "T07n0220_540:0774b04_14"
    },
    {
        "source_sentence": "水不能溺，火不能燒、刀杖、惡獸、怨賊、惡神、眾邪、魍魎不能傷害。",
        "translation": "The water won't drown them, and the fire won't burn them, nor can swords, sticks, bad animals, thieves, bad spirits, various evils, or anger harm them.",
        "source": "T07n0220_540:0774b05_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0774b07_16"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774b07_17"
    },
    {
        "source_sentence": "如是般若波羅蜜多是大神呪，是大明呪，是無上呪，是無等等呪；",
        "translation": "Thus the perfection of wisdom is a great spiritual spell, a great luminosity spell, an unsurpassed spell, and an unequalled spell.",
        "source": "T07n0220_540:0774b07_18"
    },
    {
        "source_sentence": "如是般若波羅蜜多是諸呪王，最上、最妙、無能及者，具大威力，能伏一切，",
        "translation": "Thus, the perfection of wisdom is the king of all dhāraṇīs, supreme, most sublime, unsurpassable, endowed with great power and able to subdue all.",
        "source": "T07n0220_540:0774b08_19"
    },
    {
        "source_sentence": "不為一切之所降伏。",
        "translation": "They won't be subdued by all of them.",
        "source": "T07n0220_540:0774b10_20"
    },
    {
        "source_sentence": "是善男子、善女人等精勤修學如是呪王，不為自害，不為他害，不為俱害。",
        "translation": "Good men and good women who diligently cultivate such a king of spells don't harm themselves, harm others, or harm both.",
        "source": "T07n0220_540:0774b11_21"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774b12_22"
    },
    {
        "source_sentence": "是善男子、善女人等，學此般若波羅蜜多大呪王時，於我及法雖無所得，",
        "translation": "Good men and good women, when they study this great dhāraṇī of prajñāpāramitā, even though they don't attain self or dharmas,",
        "source": "T07n0220_540:0774b12_23"
    },
    {
        "source_sentence": "而證無上正等菩提，由斯獲得一切智智，觀有情類心行差別，隨宜為轉無上法輪，",
        "translation": "They attain unexcelled perfect enlightenment, thereby attaining omniscience. Observing the distinctions in mental patterns of sentient beings, they turn the wheel of the Teaching according to their needs and capacities.",
        "source": "T07n0220_540:0774b14_24"
    },
    {
        "source_sentence": "令如說行得大饒益。",
        "translation": "He causes them to practice as he teaches and attain great benefit.",
        "source": "T07n0220_540:0774b16_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0774b16_26"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774b17_27"
    },
    {
        "source_sentence": "過去未來現在菩薩，皆學如是甚深般若波羅蜜多大神呪王，無所不得、無所不證，",
        "translation": "“Furthermore, enlightening beings of past, future, and present have all studied this profound dhāraṇī of the great spell of prajñāpāramitā. There is nothing that they cannot attain or realize.",
        "source": "T07n0220_540:0774b17_28"
    },
    {
        "source_sentence": "是故說名一切智智。",
        "translation": "Therefore, it's called omniscience and cognition.",
        "source": "T07n0220_540:0774b19_29"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774b19_30"
    },
    {
        "source_sentence": "若善男子、善女人等於此般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、供養恭敬、尊重讚歎、書寫、解說、廣令流布，",
        "translation": "If good men and good women wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, venerate, respectfully praise, write, explain, and disseminate this perfection of wisdom,",
        "source": "T07n0220_540:0774b19_31"
    },
    {
        "source_sentence": "得如是等現法當來種種功德。",
        "translation": "They attain various merits such as these in the present life and future lives.",
        "source": "T07n0220_540:0774b22_32"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0774b23_33"
    },
    {
        "source_sentence": "若善男子、善女人等，書此般若波羅蜜多大神呪王，置清淨處供養恭敬、尊重讚歎，",
        "translation": "If good men and good women write this great dhāraṇī king of prajñāpāramitā, they'll place it in a pure place to offer support, venerate, honor, and praise it.",
        "source": "T07n0220_540:0774b23_34"
    },
    {
        "source_sentence": "雖不聽聞、受持、讀誦、精勤修學、如理思惟，亦不為他開示分別，而此住處國邑王都人非人等不為一切災橫疾疫之所傷害。",
        "translation": "Even though they don't hear, retain, recite, diligently cultivate, and correctly contemplate, and don't reveal or discriminate for others, the people in this dwelling place, cities, kingdoms, humans, non-humans",
        "source": "T07n0220_540:0774b25_35"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0774b28_36"
    },
    {
        "source_sentence": "若善男子、善女人等，怖畏怨家、惡獸、災橫、厭禱、疾疫、毒藥、呪等，",
        "translation": "Suppose good men and good women are afraid of enemies, bad animals, disasters, disillusioned prayers, epidemics, poisonous medicines, spells, and so forth.",
        "source": "T07n0220_540:0774b28_37"
    },
    {
        "source_sentence": "應書般若波羅蜜多大神呪王，隨多少分香囊盛貯置寶筒中，恒隨自身供養恭敬，",
        "translation": "You should write the great dhāraṇī king Prajñāpāramitā, store it in a precious tube with as many parts of your fragrant bag as you like, and always follow yourself to offer support and honor it.",
        "source": "T07n0220_540:0774b29_38"
    },
    {
        "source_sentence": "諸怖畏事皆悉銷除，天、龍、鬼神常來守護，唯除宿世惡業應受。",
        "translation": "Gods, dragons, and ghosts always come to protect them, except for the bad actions of past lives that should be experienced.",
        "source": "T07n0220_540:0774c02_39"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774c04_40"
    },
    {
        "source_sentence": "譬如有人或傍生類，入菩提樹院或至彼院邊，人非人等不能傷害。",
        "translation": "Suppose there's a person or an unenlightened type who enters the bodhi tree monastery or goes to the side of that monastery, and neither person nor person can harm them.",
        "source": "T07n0220_540:0774c04_41"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0774c05_42"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774c06_43"
    },
    {
        "source_sentence": "過去未來現在諸佛皆坐此處，證得無上正等菩提，得菩提已施諸有情無恐、無怖、無怨、無害身心安樂。",
        "translation": "The buddhas of the past, future, and present all sit here to realize unsurpassed perfect enlightenment, and after attaining enlightenment, they give it to sentient beings without fear, without fear, without resentment, without harming",
        "source": "T07n0220_540:0774c06_44"
    },
    {
        "source_sentence": "當知般若波羅蜜多隨所住處亦復如是，一切天、龍、阿素洛等常來守護。",
        "translation": "You should know that the prajñāpāramitā is likewise wherever it lives, and all gods, dragons, asuras, and so forth always come to guard it.",
        "source": "T07n0220_540:0774c08_45"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0774c10_46"
    },
    {
        "source_sentence": "如是般若波羅蜜多隨所住處，當知是處即真制多，一切有情皆應敬禮，",
        "translation": "Thus, wherever the perfection of wisdom abides, you should know that this is the true制多, and all sentient beings should venerate it.",
        "source": "T07n0220_540:0774c10_47"
    },
    {
        "source_sentence": "當以種種上妙供具，供養恭敬、尊重讚歎。",
        "translation": "They should offer various kinds of excellent offerings to honor, venerate, and praise them.",
        "source": "T07n0220_540:0774c12_48"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0774c13_49"
    },
    {
        "source_sentence": "是諸有情歸依處故。」",
        "translation": "It's because sentient beings take refuge in it.",
        "source": "T07n0220_540:0774c13_50"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「若善男子、善女人等書此般若波羅蜜多，種種莊嚴供養恭敬、尊重讚歎，",
        "translation": "Śakra Devānām-Indra then again said to the Buddha, Good men and good women write this prajñāpāramitā with various adornments, offerings, respect, veneration, and praise.",
        "source": "T07n0220_540:0774c14_0"
    },
    {
        "source_sentence": "復以種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養；",
        "translation": "They also offered various kinds of exquisite flower garlands, such as fragrant ointments and perfumes, clothing, necklaces, jeweled banners, canopies, all kinds of exquisite things, rare treasures, music, and",
        "source": "T07n0220_540:0774c16_1"
    },
    {
        "source_sentence": "有善男子、善女人等，佛涅槃後起窣堵波七寶嚴飾，寶函盛貯佛設利羅安置其中，",
        "translation": "Good men and good women, after the nirvana of the Buddha, built stupas adorned with the seven kinds of treasure. The precious casket was stored in a large quantity in which to place the relics of the Buddha were preserved.",
        "source": "T07n0220_540:0774c18_0"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎，復以種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明而為供養。",
        "translation": "They also offer various kinds of exquisite flower garlands, perfumes such as ointments and other fragrances, clothing, jewelry, jeweled banners, pennants, canopies, marvels, rare treasures, music, and lamp",
        "source": "T07n0220_540:0774c19_1"
    },
    {
        "source_sentence": "二所獲福，何者為多？」",
        "translation": "Second, which of the merits obtained is abundant?",
        "source": "T07n0220_540:0774c22_2"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「我還問汝，當隨意答。",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, I'll return to ask you questions, and you will answer them as you like.",
        "source": "T07n0220_540:0774c22_3"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0774c23_4"
    },
    {
        "source_sentence": "如來所得一切智智，所證無上正等菩提及所依身，依何等道修學而得？」",
        "translation": "What path does the Tathāgata cultivate to attain the omniscience and knowledge of all things that are attained by the realization of unsurpassed perfect enlightenment and the body on which they rely?",
        "source": "T07n0220_540:0774c23_5"
    },
    {
        "source_sentence": "天帝釋言：「如來所得一切智智，所證無上正等菩提及所依身，皆依般若波羅蜜多修學而得。」",
        "translation": "Śakra Devānām-Indra said, The Tathāgata has attained omniscience and the knowledge of all things that are realized by the Tathāgata, the unsurpassed correct perfect enlightenment, and the body on which he relies, all based",
        "source": "T07n0220_540:0774c25_6"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_540:0774c27_7"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0774c28_8"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_540:0774c28_9"
    },
    {
        "source_sentence": "我依般若波羅蜜多修學故，得一切智智、所證無上正等菩提及所依身。",
        "translation": "Because I cultivate the perfection of prajñāpāramitā, I attain omniscience and cognition, realize unsurpassed perfect enlightenment, and the body on which I rely.",
        "source": "T07n0220_540:0774c28_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0775a01_11"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a01_12"
    },
    {
        "source_sentence": "不學般若波羅蜜多，有能獲得一切智智、所證無上正等菩提及所依身，",
        "translation": "Those who don’t study the perfection of wisdom can attain omniscience, realize unsurpassed perfect enlightenment, and have the body on which they rely.",
        "source": "T07n0220_540:0775a01_13"
    },
    {
        "source_sentence": "無有是處。",
        "translation": "There's no such place.",
        "source": "T07n0220_540:0775a03_14"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a03_15"
    },
    {
        "source_sentence": "非但獲得相好身故說名如來、應、正等覺，要由證得一切智智乃名如來、應、正等覺。",
        "translation": "It's not just that it's called the Tathāgata, Worthy of Offerings, and Perfectly Enlightened because they've attained a body with good features, but it's called the Tathāgata, Worthy of Offerings, and",
        "source": "T07n0220_540:0775a03_16"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a05_17"
    },
    {
        "source_sentence": "如來所得一切智智，要由般若波羅蜜多為因故起，佛相好身但為依處，",
        "translation": "The omniscience and knowledge attained by the Tathāgata must arise from the cause of the perfection of wisdom, for which the Buddha's body with distinctive characteristics is only the basis.",
        "source": "T07n0220_540:0775a05_18"
    },
    {
        "source_sentence": "若不依止佛相好身無由而起，是故般若波羅蜜多，正為因生一切智智，",
        "translation": "If it doesn't arise based on the Buddha's body with characteristics and good qualities, there's no way to do so; therefore, the prajñāpāramitā is precisely the cause that produces omniscience and cognition.",
        "source": "T07n0220_540:0775a07_19"
    },
    {
        "source_sentence": "欲令此智現前相續故，復修集佛相好身。",
        "translation": "Because they want to cause this knowledge to be manifested continuously, they also cultivate the Buddha's good body of characteristics and features.",
        "source": "T07n0220_540:0775a08_20"
    },
    {
        "source_sentence": "此相好身若非遍智所依處者，一切天、龍、人非人等不應竭誠供養恭敬。",
        "translation": "If this body of good appearance isn't the basis for pervasive wisdom, all gods, dragons, humans, and non-humans shouldn't wholeheartedly offer support and venerate it.",
        "source": "T07n0220_540:0775a09_21"
    },
    {
        "source_sentence": "以相好身與佛遍智為所依止故，諸天、龍、人非人等供養恭敬。",
        "translation": "Because the body with its distinctive characteristics and the Buddha's pervasive wisdom are the basis, gods, dragons, humans, and non-humans make offerings and venerate it.",
        "source": "T07n0220_540:0775a11_22"
    },
    {
        "source_sentence": "由此緣故，我涅槃後，諸天、龍神、人非人等供養恭敬我設利羅。",
        "translation": "Because of this, after my nirvāṇa, gods, dragons, goddesses, humans, and non-humans will offer support and venerate me Śāriputra.",
        "source": "T07n0220_540:0775a12_23"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a14_24"
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多，供養恭敬、尊重讚歎，則為供養一切智智及所依止佛相好身并涅槃後佛設利羅。",
        "translation": "If good men and good women write this prajñāpāramitā, offer support, respect, venerate, and praise it, then they'll make offerings to omniscience, the Buddha's wisdom, the body of the characteristics and beauty of the",
        "source": "T07n0220_540:0775a14_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0775a17_26"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a17_27"
    },
    {
        "source_sentence": "一切智智及相好身并設利羅，皆以般若波羅蜜多為根本故。",
        "translation": "The omniscience, wisdom, the body with its characteristics, and Śāriputra are all based on the prajñāpāramitā as their root.",
        "source": "T07n0220_540:0775a17_28"
    },
    {
        "source_sentence": "以是故，憍尸迦！",
        "translation": "That's why, Kauśika!",
        "source": "T07n0220_540:0775a18_29"
    },
    {
        "source_sentence": "若善男子、善女人等書此般若波羅蜜多，種種莊嚴供養恭敬、尊重讚歎，",
        "translation": "If good men and good women write this prajñāpāramitā, they are variously adorned, offered support, respected, honored, and praised.",
        "source": "T07n0220_540:0775a19_30"
    },
    {
        "source_sentence": "復以種種上妙華鬘乃至燈明而為供養。",
        "translation": "He also makes offerings with various kinds of marvelous flower garlands and even lamps.",
        "source": "T07n0220_540:0775a20_31"
    },
    {
        "source_sentence": "有善男子、善女人等，佛涅槃後起窣堵波七寶嚴飾，寶函盛貯佛設利羅安置其中，",
        "translation": "Good men and good women, after the nirvana of the Buddha, built stupas adorned with the seven kinds of treasure. The precious casket was stored in a large quantity in which to place the relics of the Buddha were preserved.",
        "source": "T07n0220_540:0775a21_32"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎，復以種種上妙華鬘乃至燈明而為供養。",
        "translation": "They are honored, respected, venerated, and praised, and offered various kinds of exquisite flower garlands or even lamps as offerings.",
        "source": "T07n0220_540:0775a23_33"
    },
    {
        "source_sentence": "二所獲福，前者為多無量倍數。",
        "translation": "The second is the merit that's obtained, which is numerous and immeasurable in number.",
        "source": "T07n0220_540:0775a25_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0775a25_35"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775a26_36"
    },
    {
        "source_sentence": "若善男子、善女人等供養般若波羅蜜多，即為供養一切智智佛相好身設利羅故。」",
        "translation": "If good men and good women make offerings to the perfection of prajñāpāramitā, that's because they make offerings to the markless body of the Buddha of omniscience and wisdom for the sake of making offerings to Śāriputra.",
        "source": "T07n0220_540:0775a26_37"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「贍部洲人於此般若波羅蜜多，不能書寫眾寶莊嚴、供養恭敬、尊重讚歎，",
        "translation": "Śakra Devānām-Indra then said to the Buddha: The people of Jambudvīpa are unable to write this prajñāpāramitā, which is adorned with all kinds of jewels and cannot be offered support, venerated,",
        "source": "T07n0220_540:0775a28_38"
    },
    {
        "source_sentence": "不能聽聞、受持、讀誦、精勤修學、如理思惟，彼豈不知書此般若波羅蜜多，",
        "translation": "If they can’t hear, retain, recite, diligently cultivate, and correctly contemplate, wouldn’t they know that they write this prajñāpāramitā?",
        "source": "T07n0220_540:0775b01_39"
    },
    {
        "source_sentence": "眾寶莊嚴、供養恭敬、尊重讚歎、至心聽聞、受持、讀誦、精勤修學、如理思惟，",
        "translation": "They are adorned with all kinds of treasures, offered support and respect, honored and praised, wholeheartedly heard, memorized, recited, diligently cultivated, and correctly contemplated.",
        "source": "T07n0220_540:0775b02_40"
    },
    {
        "source_sentence": "獲得種種功德勝利？」",
        "translation": "Attaining various merits and benefits?",
        "source": "T07n0220_540:0775b04_41"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「我還問汝，當隨意答。",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, I'll return to ask you questions, and you will answer them as you like.",
        "source": "T07n0220_540:0775b04_42"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0775b05_43"
    },
    {
        "source_sentence": "贍部洲內有幾許人成佛證淨、成法證淨、成僧證淨？",
        "translation": "How many people in Jambudvīpa realize purity as buddhas, purity as dharma-teachers, and purity as samgha-teachers?",
        "source": "T07n0220_540:0775b06_44"
    },
    {
        "source_sentence": "有幾許人得預流果、或一來果、或不還果、或阿羅漢果？",
        "translation": "How many people attain the fruit of stream-winner, or the fruit of once-returning, or the fruit of nonreturner, or the fruit of arhatship?",
        "source": "T07n0220_540:0775b07_45"
    },
    {
        "source_sentence": "有幾許人發心定趣獨覺菩提？",
        "translation": "How many people give rise to the intention to concentrate their minds and aspire to the enlightenment of solitary realizer?",
        "source": "T07n0220_540:0775b08_46"
    },
    {
        "source_sentence": "有幾許人發心定趣諸佛無上正等菩提？」",
        "translation": "How many people have aroused the intention to concentrate on the unsurpassed perfect enlightenment of the buddhas?",
        "source": "T07n0220_540:0775b09_47"
    },
    {
        "source_sentence": "天帝釋言：「贍部洲內有少許人成佛證淨、成法證淨、成僧證淨，轉少許人得預流果、或一來果、或不還果、或阿羅漢果，",
        "translation": "Śakra Devānām-Indra said, There are a few people in Jambudvīpa who become buddhas and realize purity, Dharma and saṃghahoods and realize purity, and a few who attain the fruit of stream-winner, or",
        "source": "T07n0220_540:0775b10_48"
    },
    {
        "source_sentence": "轉少許人發心定趣獨覺菩提，轉少許人發心定趣諸佛無上正等菩提。」",
        "translation": "A few people who turn to the concentration of arousal of mind aspire to solitary realizer enlightenment and a few people who turn to the concentration of arousal of mind aspire to the unsurpassed perfect enlightenment of the buddhas",
        "source": "T07n0220_540:0775b12_49"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_540:0775b14_50"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0775b15_51"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_540:0775b15_52"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775b15_53"
    },
    {
        "source_sentence": "贍部洲內極少分人成佛證淨、成法證淨、成僧證淨，轉少分人得預流果、或一來果、或不還果、或阿羅漢果，",
        "translation": "In Jambudvfpa, a very small minority of people attain buddhahood, doctrine-attainment, and Sanghahood. A small minority will attain the fruit of stream-entry (parinirmita-vaśavartin",
        "source": "T07n0220_540:0775b15_54"
    },
    {
        "source_sentence": "轉少分人發心定趣獨覺菩提，轉少分人發心定趣諸佛無上正等菩提，轉少分人既發心已，",
        "translation": "A small part of those who develop the intention to concentrate their minds on enlightenment will go to the solitary realizer, and a small part of those who develop the intention to concentrate their minds on the supreme perfect enlightenment of buddh",
        "source": "T07n0220_540:0775b18_0"
    },
    {
        "source_sentence": "精勤修學趣菩提行，轉少分人精勤修學菩提行時，於此般若波羅蜜多深心信受，",
        "translation": "When they diligently cultivate the practice of enlightenment and develop a small part of their minds to diligently cultivate the practice of enlightenment, they deeply believe in this prajñāpāramitā.",
        "source": "T07n0220_540:0775b20_1"
    },
    {
        "source_sentence": "轉少分人深信受已，修行般若波羅蜜多，轉少分人既修行已，漸次安住不退轉地，",
        "translation": "After they had deeply believed and accepted it, the surviving ones cultivated the perfection of wisdom. After having cultivated it, the surviving ones gradually settled in the stage of nonregression.",
        "source": "T07n0220_540:0775b21_2"
    },
    {
        "source_sentence": "轉少分人，住此地已，疾證無上正等菩提。",
        "translation": "A small part of the people who turn there will quickly realize unsurpassed perfect enlightenment after staying here.",
        "source": "T07n0220_540:0775b23_3"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775b24_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩已得安住不退轉地，求證無上正等菩提，乃能深心恭敬信受甚深般若波羅蜜多，",
        "translation": "If a bodhisattva-mahāsattva has attained the stage of nonregression and seeks to realize unsurpassed perfect enlightenment, then he can deeply venerate and believe in the profound prajñāpāramitā.",
        "source": "T07n0220_540:0775b24_5"
    },
    {
        "source_sentence": "至心聽聞、受持、讀誦、精勤修學、如理思惟，亦能為他無倒宣說，復以種種上妙華鬘乃至燈明供養恭敬、尊重讚歎。",
        "translation": "He wholeheartedly hears, retains, recites, diligently cultivates, and correctly contemplates it, and can also correctly explain it for others, offering various kinds of exquisite flowers, garlands, lamps, offerings, respect, venera",
        "source": "T07n0220_540:0775b27_6"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775b29_7"
    },
    {
        "source_sentence": "我以無障清淨佛眼遍觀十方無邊世界，雖有無量無數有情發菩提心修菩薩行，",
        "translation": "With unobstructed pure Buddha-eye, I pervade the boundless worlds of the ten directions. Though there are countless sentient beings who give rise to the aspiration for enlightenment and carry out the practice of enlightening",
        "source": "T07n0220_540:0775b29_8"
    },
    {
        "source_sentence": "而由遠離甚深般若波羅蜜多方便善巧，若一、若二、若三有情得住菩薩不退轉地，",
        "translation": "Through the skillful means of detachment from profound prajñāpāramitā, if one, two, or three sentient beings can abide in the bodhisattva's stage of nonretrogression,",
        "source": "T07n0220_540:0775c02_9"
    },
    {
        "source_sentence": "多分退墮聲聞、獨覺下意、下行、下劣地中。",
        "translation": "They mostly regress and fall into the lower-minded, lower-practicing, and inferior stages of śrāvakas, pratyekbuddhas, and solitary realizers.",
        "source": "T07n0220_540:0775c04_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0775c05_11"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775c05_12"
    },
    {
        "source_sentence": "諸佛無上正等菩提功德無邊甚難可證，惡慧懈怠下劣、精進下劣、勝解下劣有情不能證得。",
        "translation": "The merits of the buddhas' unsurpassed correct perfect enlightenment are limitless and difficult to realize, and it's not realized by those with bad wisdom who are lazy, weak in effort, or inferior in resolve.",
        "source": "T07n0220_540:0775c06_0"
    },
    {
        "source_sentence": "「是故，憍尸迦！",
        "translation": "Therefore, Kauśika!",
        "source": "T07n0220_540:0775c08_1"
    },
    {
        "source_sentence": "若善男子、善女人等發菩提心修菩薩行，欲住菩薩不退轉地，疾證無上正等菩提無留難者，",
        "translation": "“Good sons and good women who have set out for enlightenment and are engaged in the practice of enlightening beings, wishing to abide in the stage of nonregression of enlightening beings, will quickly attain unexcelled",
        "source": "T07n0220_540:0775c08_2"
    },
    {
        "source_sentence": "應於般若波羅蜜多數數聽聞、受持、讀誦、精勤修學、如理思惟，好請問師，",
        "translation": "They should repeatedly hear, retain, recite, diligently cultivate, and correctly contemplate the perfection of wisdom, and they should likewise question their teachers.",
        "source": "T07n0220_540:0775c10_3"
    },
    {
        "source_sentence": "樂為他說，復應書寫、眾寶莊嚴、供養恭敬、尊重讚歎。",
        "translation": "Those who delight in teaching others should also write, adorn themselves with various treasures, offer support and respect, and venerate and praise them.",
        "source": "T07n0220_540:0775c12_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0775c13_5"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775c13_6"
    },
    {
        "source_sentence": "是善男子、善女人等應作是念：『如來昔住菩薩地時，常勤修學如是般若波羅蜜多甚深義趣，",
        "translation": "Good men and good women should think thus: In the past, when the Tathāgata was living in the bodhisattva stage, he always diligently cultivated such profound meaningful aspects of the perfection of wisdom.",
        "source": "T07n0220_540:0775c13_7"
    },
    {
        "source_sentence": "證得無上正等菩提，我等亦應精勤修學如是般若波羅蜜多。",
        "translation": "To realize unsurpassed perfect enlightenment, we should also diligently cultivate the perfection of wisdom like this.",
        "source": "T07n0220_540:0775c15_8"
    },
    {
        "source_sentence": "是我大師，我隨彼學所願當滿。』",
        "translation": "This is my great teacher, and I will follow their training and fulfill what they wish.'",
        "source": "T07n0220_540:0775c17_9"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0775c17_10"
    },
    {
        "source_sentence": "諸菩薩摩訶薩若佛住世、若涅槃後，常應依止甚深般若波羅蜜多精勤修學。」",
        "translation": "If the bodhisattva Mahāsattva lives in the world or after nirvāṇa, he should always rely on the profound prajñāpāramitā to diligently cultivate it.",
        "source": "T07n0220_540:0775c18_11"
    },
    {
        "source_sentence": "時，天帝釋復白佛言：「若善男子、善女人等於深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟，",
        "translation": "Śakra Devānām-Indra then again said to the Buddha, Suppose good men and good women wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate the profound prajñāpāramitā.",
        "source": "T07n0220_540:0775c20_0"
    },
    {
        "source_sentence": "廣為有情宣說流布，或有書寫、眾寶嚴飾，復持種種上妙華鬘乃至燈明，",
        "translation": "They teach widely to sentient beings, sometimes with writings or adorned with jewels, and also carry various kinds of exquisite flower garlands and even lamps.",
        "source": "T07n0220_540:0775c22_1"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_540:0775c24_0"
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣得幾許福？」",
        "translation": "How much merit will these good men and good women attain by this cause and condition?",
        "source": "T07n0220_540:0775c24_1"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「是善男子、善女人等所獲福聚，無量無邊、不可思議、不可稱計，",
        "translation": "It was then that the Buddha addressed Śakra, lord of gods, saying: “The accumulation of merit gained by these sons and daughters of a virtuous family is immeasurable, boundless, unfathomable, incal",
        "source": "T07n0220_540:0775c25_2"
    },
    {
        "source_sentence": "算數、譬喻所不能及。",
        "translation": "It's beyond calculation and metaphor.",
        "source": "T07n0220_540:0775c27_3"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0775c27_4"
    },
    {
        "source_sentence": "若善男子、善女人等於諸如來般涅槃後，為供養佛設利羅故，以妙七寶起窣堵波，",
        "translation": "Good men and good women, after the parinirvāṇa of the Tathāgatas, build stupas made of the finest seven treasures for the sake of offerings to the Buddha Śāriputra.",
        "source": "T07n0220_540:0775c28_5"
    },
    {
        "source_sentence": "種種珍奇間雜嚴飾，復持種種天妙華鬘乃至燈明，盡其形壽供養恭敬、尊重讚歎。",
        "translation": "Various kinds of rare treasures are mixed and adorned, and they also carry various beautiful celestial flower garlands or lamps up to the end of their life, offering support, veneration, respect, and praise.",
        "source": "T07n0220_540:0775c29_6"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776a02_7"
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Is this the reason why good men and good women attain so much merit?",
        "source": "T07n0220_540:0776a03_8"
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "Indra said, Very much so!",
        "source": "T07n0220_540:0776a04_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776a04_1"
    },
    {
        "source_sentence": "甚多！",
        "translation": "Very much so!",
        "source": "T07n0220_540:0776a04_2"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T07n0220_540:0776a04_3"
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，",
        "translation": "The Buddha told Kauśika, Good men and good women who have the profound meaning of this prajñāpāramitā with a pure mind respectfully believe in it.",
        "source": "T07n0220_540:0776a04_4"
    },
    {
        "source_sentence": "為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，",
        "translation": "In order to seek unexcelled perfect enlightenment, they wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate. They extensively teach and reveal it to sentient beings.",
        "source": "T07n0220_540:0776a06_5"
    },
    {
        "source_sentence": "以增上慧審諦觀察。",
        "translation": "He observes it with superior wisdom and scrutinizes it with deliberation.",
        "source": "T07n0220_540:0776a08_6"
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，",
        "translation": "In order to cause the true teaching to remain in the world for a long time, so that the Buddha’s eye of enlightenment will not perish; in order to prevent the true teaching from being concealed, they embrace enlightening beings and",
        "source": "T07n0220_540:0776a09_0"
    },
    {
        "source_sentence": "為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙。",
        "translation": "In order to make the world's pure eye of the Dharma eye uninterrupted, he wrote such a profound prajñāpāramitā that was adorned with all kinds of treasures and also carried various kinds of exquisite flower garlands,",
        "source": "T07n0220_540:0776a10_1"
    },
    {
        "source_sentence": "珍奇、伎樂、燈明，供養恭敬、尊重讚歎。",
        "translation": "They are endowed with rare treasures, musical instruments, music, and lamps. They are offered support, venerated, and praised.",
        "source": "T07n0220_540:0776a13_2"
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。",
        "translation": "Good men and good women, the merit they attain is so great that it's immeasurable and countless compared to the previous one.",
        "source": "T07n0220_540:0776a14_3"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0776a15_4"
    },
    {
        "source_sentence": "置此一事。",
        "translation": "Let's leave this one thing here.",
        "source": "T07n0220_540:0776a16_5"
    },
    {
        "source_sentence": "若善男子、善女人等於諸如來般涅槃後，為供養佛設利羅故，以妙七寶起窣堵波，",
        "translation": "Good men and good women, after the parinirvāṇa of the Tathāgatas, build stupas made of the finest seven treasures for the sake of offerings to the Buddha Śāriputra.",
        "source": "T07n0220_540:0776a16_6"
    },
    {
        "source_sentence": "種種珍奇間雜嚴飾，如是充滿一贍部洲、或四大洲、或小千界、或中千界、或復三千大千世界，",
        "translation": "They fill a single Jambudvipa continent, or all the other continents of the four continents, some small chiliocosms, some medium chiliocosms, and some great chiliocosms.",
        "source": "T07n0220_540:0776a18_7"
    },
    {
        "source_sentence": "皆持種種天妙華鬘乃至燈明，盡其形壽供養恭敬、尊重讚歎。",
        "translation": "They all held various kinds of heavenly flower garlands and even lamps, offering support, veneration, respect, and praise for the rest of their lives.",
        "source": "T07n0220_540:0776a20_8"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776a21_9"
    },
    {
        "source_sentence": "是善男子、善女人等由此因緣獲福多不？」",
        "translation": "Is this the reason why good men and good women attain so much merit?",
        "source": "T07n0220_540:0776a22_0"
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "Indra said, Very much so!",
        "source": "T07n0220_540:0776a22_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776a23_2"
    },
    {
        "source_sentence": "甚多！",
        "translation": "Very much so!",
        "source": "T07n0220_540:0776a23_3"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T07n0220_540:0776a23_4"
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，",
        "translation": "The Buddha told Kauśika, Good men and good women who have the profound meaning of this prajñāpāramitā with a pure mind respectfully believe in it.",
        "source": "T07n0220_540:0776a23_5"
    },
    {
        "source_sentence": "為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，",
        "translation": "In order to seek unexcelled perfect enlightenment, they wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate. They extensively teach and reveal it to sentient beings.",
        "source": "T07n0220_540:0776a25_6"
    },
    {
        "source_sentence": "以增上慧審諦觀察。",
        "translation": "He observes it with superior wisdom and scrutinizes it with deliberation.",
        "source": "T07n0220_540:0776a27_7"
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，",
        "translation": "In order to cause the true teaching to remain in the world for a long time, so that the Buddha’s eye of enlightenment will not perish; in order to prevent the true teaching from being concealed, they embrace enlightening beings and",
        "source": "T07n0220_540:0776a27_8"
    },
    {
        "source_sentence": "為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，",
        "translation": "In order to cause the pure eye of the Dharma in the world not to be cut off, he wrote and composed such a profound prajñāpāramitā adorned with many jewels, carrying various kinds of exquisite flower garlands, perfume",
        "source": "T07n0220_540:0776a29_9"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_540:0776b04_10"
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。",
        "translation": "Good men and good women, the merit they attain is so great that it's immeasurable and countless compared to the previous one.",
        "source": "T07n0220_540:0776b04_11"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0776b06_0"
    },
    {
        "source_sentence": "置如是事。",
        "translation": "It's like this.",
        "source": "T07n0220_540:0776b06_1"
    },
    {
        "source_sentence": "假使於此贍部洲中一切有情，或四大洲一切有情，或小千界一切有情，",
        "translation": "Suppose all sentient beings in Jambudvfpa, or all sentient beings in the four continents, or all sentient beings in the small chiliocosm.",
        "source": "T07n0220_540:0776b06_2"
    },
    {
        "source_sentence": "或中千界一切有情，或復三千大千世界一切有情，各於如來般涅槃後，",
        "translation": "Or all sentient beings in the middle chiliocosm, or all sentient beings in the great chiliocosm, or all sentient beings in the trichiliocosm, each after the parinirvana of the Enlightened One.",
        "source": "T07n0220_540:0776b08_3"
    },
    {
        "source_sentence": "為供養佛設利羅故，以妙七寶各各起一大窣堵波，種種珍奇間雜嚴飾，",
        "translation": "In order to pay homage to the Buddha Śāriputra, they produced one great stupa of each of the seven kinds of exquisite jewels, adorned with a variety of rare treasures.",
        "source": "T07n0220_540:0776b09_4"
    },
    {
        "source_sentence": "皆持種種天妙華鬘乃至燈明，盡其形壽各各於自窣堵波所供養恭敬、尊重讚歎。",
        "translation": "They all held various heavenly flower garlands of marvelous flowers and even lamps, and each spent their lifetimes in their own stupa to offer support, venerate, respect, and praise them.",
        "source": "T07n0220_540:0776b11_5"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776b13_6"
    },
    {
        "source_sentence": "此贍部洲、或四大洲、或小千界、或中千界、或大千界諸有情類，由是因緣獲福多不？」",
        "translation": "Is this Jambudvīpa, the four major continents, the small thousand realms, the middle thousand realms, or the great thousand realms of sentient beings who obtain much merit because of these causes and conditions?",
        "source": "T07n0220_540:0776b13_7"
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "Indra said, Very much so!",
        "source": "T07n0220_540:0776b15_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776b15_9"
    },
    {
        "source_sentence": "甚多！",
        "translation": "Very much so!",
        "source": "T07n0220_540:0776b16_0"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T07n0220_540:0776b16_1"
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，",
        "translation": "The Buddha told Kauśika, Good men and good women who have the profound meaning of this prajñāpāramitā with a pure mind respectfully believe in it.",
        "source": "T07n0220_540:0776b16_2"
    },
    {
        "source_sentence": "為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，",
        "translation": "In order to seek unexcelled perfect enlightenment, they wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate. They extensively teach and reveal it to sentient beings.",
        "source": "T07n0220_540:0776b18_3"
    },
    {
        "source_sentence": "以增上慧審諦觀察。",
        "translation": "He observes it with superior wisdom and scrutinizes it with deliberation.",
        "source": "T07n0220_540:0776b20_4"
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，",
        "translation": "In order to cause the true teaching to remain in the world for a long time, so that the Buddha’s eye of enlightenment will not perish; in order to prevent the true teaching from being concealed, they embrace enlightening beings and",
        "source": "T07n0220_540:0776b20_5"
    },
    {
        "source_sentence": "為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，",
        "translation": "In order to cause the pure eye of the Dharma in the world not to be cut off, he wrote and composed such a profound prajñāpāramitā adorned with many jewels, carrying various kinds of exquisite flower garlands, perfume",
        "source": "T07n0220_540:0776b22_6"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_540:0776b25_7"
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。",
        "translation": "Good men and good women, the merit they attain is so great that it's immeasurable and countless compared to the previous one.",
        "source": "T07n0220_540:0776b26_8"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0776b27_9"
    },
    {
        "source_sentence": "置如是事。",
        "translation": "It's like this.",
        "source": "T07n0220_540:0776b27_10"
    },
    {
        "source_sentence": "假使於此贍部洲中諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，",
        "translation": "Suppose all the sentient beings in Jambudvīpa were to become human beings, neither before nor after, because each one of them would be an offering to the Buddha Śāriputra.",
        "source": "T07n0220_540:0776b27_11"
    },
    {
        "source_sentence": "於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿贍部洲；",
        "translation": "After the parinirvana of the buddhas, they built stupas made of the finest seven kinds of jewels and adorned them with a variety of rare treasures, one by one filling Jambudvipa.",
        "source": "T07n0220_540:0776b29_12"
    },
    {
        "source_sentence": "或四大洲諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，",
        "translation": "Or all the sentient beings of the four continents may become human beings, neither before nor after, because each and every one of them are offerings to the Buddha Śāriputra.",
        "source": "T07n0220_540:0776c02_13"
    },
    {
        "source_sentence": "於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿四大洲；",
        "translation": "“After the parinirvana of those buddhas, they built stupas made of the finest seven kinds of jewels and adorned them with a variety of rare treasures, one by one filling the four continents.",
        "source": "T07n0220_540:0776c04_14"
    },
    {
        "source_sentence": "或小千界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，",
        "translation": "Or all the sentient beings of the small chiliocosm may become human beings, neither before nor after, because each one of them will make offerings to the Buddha Śāriputra.",
        "source": "T07n0220_540:0776c06_0"
    },
    {
        "source_sentence": "於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿小千界；",
        "translation": "“After the parinirvana of those buddhas, they built stupas made of the finest seven kinds of jewels and adorned them with a variety of rare treasures, one by one filling the small chiliocosm.",
        "source": "T07n0220_540:0776c07_1"
    },
    {
        "source_sentence": "或中千界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，",
        "translation": "Or all the sentient beings in the middle chiliocosm may become human beings, neither before nor after, because each of them will be an offering to the Buddha Śāriputra.",
        "source": "T07n0220_540:0776c09_2"
    },
    {
        "source_sentence": "於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿中千界；",
        "translation": "“After the parinirvana of those buddhas, they built stupas made of the finest seven kinds of jewels and adorned them with various rare treasures, one by one filling a thousand worlds.",
        "source": "T07n0220_540:0776c11_3"
    },
    {
        "source_sentence": "或復三千大千世界諸有情類，非前非後皆得為人，此一一人為供養佛設利羅故，",
        "translation": "Or all the other sentient beings in the great manifold cosmos, not before or after them, may become human beings, because each of these beings is an offering to the Buddha Śāriputra.",
        "source": "T07n0220_540:0776c13_4"
    },
    {
        "source_sentence": "於諸如來般涅槃後，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一滿大千界。",
        "translation": "After the parinirvāṇa of the Tathāgatas, they produced stupas made of the finest seven treasures and decorated them with various kinds of rare treasures, one by one filling the great chiliocosm.",
        "source": "T07n0220_540:0776c14_5"
    },
    {
        "source_sentence": "如是諸人，各持種種天妙華鬘乃至燈明，或經一劫或一劫餘，各各於自窣堵波所，",
        "translation": "Each of these people carried various kinds of celestial flower garlands and lamps, some for an eon or more than an eon, each in their own stupa.",
        "source": "T07n0220_540:0776c16_6"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_540:0776c18_7"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0776c19_8"
    },
    {
        "source_sentence": "此贍部洲、或四大洲、或小千界、或中千界、或大千界諸有情類，由是因緣獲福多不？」",
        "translation": "Is this Jambudvīpa, the four major continents, the small thousand realms, the middle thousand realms, or the great thousand realms of sentient beings who obtain much merit because of these causes and conditions?",
        "source": "T07n0220_540:0776c19_9"
    },
    {
        "source_sentence": "天帝釋言：「甚多！",
        "translation": "Indra said, Very much so!",
        "source": "T07n0220_540:0776c21_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0776c21_11"
    },
    {
        "source_sentence": "甚多！",
        "translation": "Very much so!",
        "source": "T07n0220_540:0776c21_12"
    },
    {
        "source_sentence": "善逝！」",
        "translation": "Sugata!",
        "source": "T07n0220_540:0776c21_13"
    },
    {
        "source_sentence": "佛告憍尸迦：「有善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，",
        "translation": "The Buddha told Kauśika, Good men and good women who have the profound meaning of this prajñāpāramitā with a pure mind respectfully believe in it.",
        "source": "T07n0220_540:0776c21_14"
    },
    {
        "source_sentence": "為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，",
        "translation": "In order to seek unexcelled perfect enlightenment, they wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate. They extensively teach and reveal it to sentient beings.",
        "source": "T07n0220_540:0776c23_15"
    },
    {
        "source_sentence": "以增上慧審諦觀察。",
        "translation": "He observes it with superior wisdom and scrutinizes it with deliberation.",
        "source": "T07n0220_540:0776c25_16"
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，",
        "translation": "In order to cause the true teaching to remain in the world for a long time, so that the Buddha’s eye of enlightenment will not perish; in order to prevent the true teaching from being concealed, they embrace enlightening beings and",
        "source": "T07n0220_540:0776c26_17"
    },
    {
        "source_sentence": "為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，",
        "translation": "In order to cause the pure eye of the Dharma in the world not to be cut off, he wrote and composed such a profound prajñāpāramitā adorned with many jewels, carrying various kinds of exquisite flower garlands, perfume",
        "source": "T07n0220_540:0776c28_0"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_540:0777a02_1"
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於前無量無數。」",
        "translation": "Good men and good women, the merit they attain is so great that it's immeasurable and countless.",
        "source": "T07n0220_540:0777a02_2"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「如是！",
        "translation": "Śakra then said to the Buddha, So it is!",
        "source": "T07n0220_540:0777a03_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0777a04_4"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0777a04_5"
    },
    {
        "source_sentence": "善逝！",
        "translation": "Well done, Sugata!",
        "source": "T07n0220_540:0777a04_6"
    },
    {
        "source_sentence": "若善男子、善女人等供養恭敬、尊重讚歎甚深般若波羅蜜多，當知則為供養恭敬、尊重讚歎過去、未來、現在諸佛一切智智。",
        "translation": "If good men and good women offer support, respect, venerate, and praise the profound prajñāpāramitā, you should know that they offer support, respect, venerate, and praise the omniscience and wisdom of past, future, and present buddh",
        "source": "T07n0220_540:0777a04_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0777a07_8"
    },
    {
        "source_sentence": "且置所說三千大千世界一切有情，為供養佛設利羅故，各於如來般涅槃後，",
        "translation": "And let us suppose that all the sentient beings of this billion-world-galactic universe were to make offerings to the Buddha Śāriputra, so that each would attain parinirvāṇa after the Tathāgata had attained it.",
        "source": "T07n0220_540:0777a07_9"
    },
    {
        "source_sentence": "以妙七寶起窣堵波。",
        "translation": "He built a stūpa of the seven wonderful treasures.",
        "source": "T07n0220_540:0777a09_10"
    },
    {
        "source_sentence": "假使十方各如殑伽沙等世界一切有情，非前非後皆得為人，此一一人各於如來般涅槃後，",
        "translation": "Suppose all sentient beings in each of the ten directions, like grains of sand in the Ganges River, were to become human beings, neither before nor after, and each one of them would attain buddhahood after the parinirvāṇa of",
        "source": "T07n0220_540:0777a09_11"
    },
    {
        "source_sentence": "為供養佛設利羅故，以妙七寶起窣堵波，種種珍奇間雜嚴飾，如是一一各滿十方殑伽沙等諸佛世界，",
        "translation": "In order to honor the Buddha Śāriputra, they built stupas made of the finest seven kinds of treasure and adorned them with various jewels, one by one filling as many buddha-worlds as there are sands in the ten directions",
        "source": "T07n0220_540:0777a11_12"
    },
    {
        "source_sentence": "各持種種天妙華鬘乃至燈明，或經一劫或一劫餘，供養恭敬、尊重讚歎。",
        "translation": "Each of them held various kinds of heavenly flower garlands and even lamps, or for an eon or more than an eon, offered support, venerated, honored, and praised them.",
        "source": "T07n0220_540:0777a14_13"
    },
    {
        "source_sentence": "是諸有情由此因緣所獲福聚，雖復無量而復有餘。",
        "translation": "Even though the stock of merit obtained by sentient beings as a result of these causes and conditions is immeasurable, there are still others.",
        "source": "T07n0220_540:0777a15_14"
    },
    {
        "source_sentence": "諸善男子、善女人等，於此般若波羅蜜多甚深義趣，以清淨心恭敬信解，",
        "translation": "Good men and good women, with pure minds honoring and believing in this profound meaning of the perfection of wisdom,",
        "source": "T07n0220_540:0777a17_15"
    },
    {
        "source_sentence": "為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，",
        "translation": "In order to seek unexcelled perfect enlightenment, they wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate. They extensively teach and reveal it to sentient beings.",
        "source": "T07n0220_540:0777a18_16"
    },
    {
        "source_sentence": "以增上慧審諦觀察。",
        "translation": "He observes it with superior wisdom and scrutinizes it with deliberation.",
        "source": "T07n0220_540:0777a20_17"
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，",
        "translation": "In order to cause the true teaching to remain in the world for a long time, so that the Buddha’s eye of enlightenment will not perish; in order to prevent the true teaching from being concealed, they embrace enlightening beings and",
        "source": "T07n0220_540:0777a21_18"
    },
    {
        "source_sentence": "為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，",
        "translation": "In order to cause the pure eye of the Dharma in the world not to be cut off, he wrote and composed such a profound prajñāpāramitā adorned with many jewels, carrying various kinds of exquisite flower garlands, perfume",
        "source": "T07n0220_540:0777a22_19"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_540:0777a26_20"
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德甚多於彼無量無邊不可思議、不可稱計，",
        "translation": "“The merit gained by these sons and daughters of a virtuous family is greater than theirs, immeasurable, limitless, inconceivable, and incalculable.",
        "source": "T07n0220_540:0777a26_21"
    },
    {
        "source_sentence": "算數、譬喻所不能及。」",
        "translation": "It's beyond calculation and metaphor.",
        "source": "T07n0220_540:0777a28_22"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_540:0777a28_23"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0777a29_24"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_540:0777a29_25"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777a29_26"
    },
    {
        "source_sentence": "是善男子、善女人等，於深般若波羅蜜多所獲福聚無量無邊不可思議、不可稱計，",
        "translation": "Good men and good women, the accumulation of merit gained from profound prajñāpāramitā is immeasurable, boundless, inconceivable, and incalculable.",
        "source": "T07n0220_540:0777a29_27"
    },
    {
        "source_sentence": "算數、譬喻所不能及。",
        "translation": "It's beyond calculation and metaphor.",
        "source": "T07n0220_540:0777b02_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0777b03_29"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777b03_30"
    },
    {
        "source_sentence": "甚深般若波羅蜜多能生如來一切智智，一切如來一切智智，能生諸佛設利羅故。",
        "translation": "The profound prajñāpāramitā can give rise to the Tathāgata's omniscience and knowledge, and all tathāgatas' omniscience and knowledge can give rise to the buddhas' śarīla.",
        "source": "T07n0220_540:0777b03_31"
    },
    {
        "source_sentence": "「以是故，憍尸迦！",
        "translation": "That's why, Kauśika!",
        "source": "T07n0220_540:0777b05_32"
    },
    {
        "source_sentence": "若善男子、善女人等，能於般若波羅蜜多甚深義趣，以清淨心恭敬信解，",
        "translation": "If good men and good women can follow the profound meaning of the perfection of wisdom with a pure mind, honoring and believing in it,",
        "source": "T07n0220_540:0777b05_33"
    },
    {
        "source_sentence": "為求無上正等菩提，至心聽聞、受持、讀誦、精勤修學、如理思惟，廣為有情宣說開示，",
        "translation": "In order to seek unexcelled perfect enlightenment, they wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate. They extensively teach and reveal it to sentient beings.",
        "source": "T07n0220_540:0777b07_34"
    },
    {
        "source_sentence": "以增上慧審諦觀察。",
        "translation": "He observes it with superior wisdom and scrutinizes it with deliberation.",
        "source": "T07n0220_540:0777b09_35"
    },
    {
        "source_sentence": "為令正法久住世故，為令佛眼無斷壞故，為令正法不隱沒故，攝受菩薩令增長故，",
        "translation": "In order to cause the true teaching to remain in the world for a long time, so that the Buddha’s eye of enlightenment will not perish; in order to prevent the true teaching from being concealed, they embrace enlightening beings and",
        "source": "T07n0220_540:0777b09_36"
    },
    {
        "source_sentence": "為令世間清淨法眼無斷壞故，書寫如是甚深般若波羅蜜多眾寶嚴飾，復持種種上妙華鬘、塗散等香、衣服、瓔珞、寶幢、幡蓋、眾妙、珍奇、伎樂、燈明，",
        "translation": "In order to cause the pure eye of the Dharma in the world not to be cut off, he wrote and composed such a profound prajñāpāramitā adorned with many jewels, carrying various kinds of exquisite flower garlands, perfume",
        "source": "T07n0220_540:0777b11_37"
    },
    {
        "source_sentence": "供養恭敬、尊重讚歎。",
        "translation": "They are offered support, respected, venerated, and praised.",
        "source": "T07n0220_540:0777b14_38"
    },
    {
        "source_sentence": "是善男子、善女人等，所獲功德於前所造諸窣堵波及供養福，百倍為勝，",
        "translation": "The merit gained by these sons and daughters of a virtuous family is one hundred times greater than the merit gained from the stupas they built earlier.",
        "source": "T07n0220_540:0777b15_39"
    },
    {
        "source_sentence": "千倍為勝，乃至鄔波尼殺曇倍亦復為勝。」",
        "translation": "A thousandfold is superior, and even a thousandfold in Upāsaka's death is also superior.",
        "source": "T07n0220_540:0777b17_40"
    },
    {
        "source_sentence": "爾時，會中四萬天子，同聲共白天帝釋言：「大仙！",
        "translation": "At the time, 40,000 celestial beings in the assembly all said with one voice to Śakra Devānām-Indra, Great sage!",
        "source": "T07n0220_540:0777b19_0"
    },
    {
        "source_sentence": "於此甚深般若波羅蜜多，應當聽聞、受持、讀誦、精勤修學、如理思惟，",
        "translation": "In this profound prajñāpāramitā, you should hear, retain, recite, diligently cultivate, and correctly contemplate it.",
        "source": "T07n0220_540:0777b20_1"
    },
    {
        "source_sentence": "及廣為他分別解說，供養恭敬、尊重讚歎。",
        "translation": "and explains it extensively for others, offering support, respect, veneration, and praise.",
        "source": "T07n0220_540:0777b21_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777b22_3"
    },
    {
        "source_sentence": "若能於此甚深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟，",
        "translation": "If they can wholeheartedly hear, retain, recite, diligently cultivate, and correctly contemplate these profound perfections of wisdom,",
        "source": "T07n0220_540:0777b22_4"
    },
    {
        "source_sentence": "及廣為他分別解說，供養恭敬、尊重讚歎，則令一切惡法損減、善法增益。」",
        "translation": "And by explaining it in detail for others and offering support, respect, veneration, and praise, they will cause all bad qualities to decrease and good qualities to increase.",
        "source": "T07n0220_540:0777b24_5"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「汝應於此甚深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟，",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying: You should wholeheartedly hear, retain, recite, diligently practice, and correctly contemplate this profound prajñāpāramitā.",
        "source": "T07n0220_540:0777b26_6"
    },
    {
        "source_sentence": "及廣為他分別解說，供養恭敬、尊重讚歎。",
        "translation": "and explains it extensively for others, offering support, respect, veneration, and praise.",
        "source": "T07n0220_540:0777b28_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777b29_8"
    },
    {
        "source_sentence": "若阿素洛及惡朋黨起如是念：『我等當與三十三天共興戰諍。』",
        "translation": "Suppose an asuras or a group of bad friends think, 'We'll fight with the Trāyastriṃśa gods.'",
        "source": "T07n0220_540:0777b29_9"
    },
    {
        "source_sentence": "爾時，汝等諸天眷屬，應各至誠誦念如是甚深般若波羅蜜多，供養恭敬、尊重讚歎。",
        "translation": "At that point, each of your celestial retinues should sincerely recite this profound prajñāpāramitā with respect and veneration and praise.",
        "source": "T07n0220_540:0777c01_10"
    },
    {
        "source_sentence": "時，阿素洛及彼朋黨所起惡心即皆息滅。」",
        "translation": "When they do so, the bad thoughts that asura and their friends give rise to will all cease.",
        "source": "T07n0220_540:0777c03_11"
    },
    {
        "source_sentence": "時，天帝釋即白佛言：「甚深般若波羅蜜多是大神呪，是大明呪，是無上呪，",
        "translation": "Śakra Devānām-Indra then said to the Buddha: The profound prajñāpāramitā is a great supernatural spell, a great luminous spell, and an unsurpassed spell.",
        "source": "T07n0220_540:0777c04_12"
    },
    {
        "source_sentence": "是無等等呪，是一切呪王，最尊最勝、最上最妙，能伏一切，不為一切之所降伏。",
        "translation": "This peerless spell is the king of all spells, the most honored, superior, supreme, and most marvelous, which can subdue all and not be subdued by all.",
        "source": "T07n0220_540:0777c06_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0777c08_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多能滅一切惡不善法，能滿一切殊勝善法。」",
        "translation": "The profound prajñāpāramitā can extinguish all bad and unskillful dharmas and fulfill all excellent good dharmas.",
        "source": "T07n0220_540:0777c08_1"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_540:0777c09_2"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0777c10_3"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_540:0777c10_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0777c10_5"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c10_6"
    },
    {
        "source_sentence": "過去未來現在諸佛，皆依如是甚深般若波羅蜜多大神呪王，證得無上正等菩提，",
        "translation": "The buddhas of the past, future, and present all relied upon such a great mystical spell-king of profound prajñāpāramitā to attain unsurpassed perfect enlightenment.",
        "source": "T07n0220_540:0777c11_0"
    },
    {
        "source_sentence": "轉妙法輪度有情眾。",
        "translation": "He turns the wonderful wheel of the Dharma to save sentient beings.",
        "source": "T07n0220_540:0777c12_1"
    },
    {
        "source_sentence": "我亦依此甚深般若波羅蜜多大神呪王，證得無上正等菩提，為諸天、人說無上法。",
        "translation": "Also, based on this profound prajñāpāramitā-pāramitā great dhāraṇī king, I've realized unsurpassed perfect enlightenment and taught the unsurpassed Dharma to gods and humans.",
        "source": "T07n0220_540:0777c13_2"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c15_3"
    },
    {
        "source_sentence": "依深般若波羅蜜多大神呪王，世間便有覺支相應十善業道、若四靜慮、若四無量、若四無色定、若三十七菩提分法、若六神通、若餘無量無邊佛法。",
        "translation": "Relying on the profound prajñāpāramitā-pāramitā great dhāraṇī king, the world then has the ten good courses of action associated with the awakening factor, the four meditations, the four immeasurables, the four",
        "source": "T07n0220_540:0777c15_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c18_5"
    },
    {
        "source_sentence": "以要言之，八萬四千諸善法蘊，無不皆依甚深般若波羅蜜多大神呪王出現於世。",
        "translation": "To sum up, there are 84,000 good dharmas that all rely on the profound prajñāpāramitā great dhāraṇī king to appear in the world.",
        "source": "T07n0220_540:0777c18_6"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c20_7"
    },
    {
        "source_sentence": "一切佛智、自然起智、不思議智，皆依般若波羅蜜多大神呪王出現於世。",
        "translation": "All buddha cognition, naturally arisen cognition, and inconceivable cognition all appear in the world based on the great dhāraṇī king Prajñāpāramitā.",
        "source": "T07n0220_540:0777c20_8"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0777c22_9"
    },
    {
        "source_sentence": "依深般若波羅蜜多大神呪王，世間便有菩薩出現；",
        "translation": "Depending on the great spiritual spell king of profound prajñāpāramitā, an enlightening being appeared in the world.",
        "source": "T07n0220_540:0777c22_10"
    },
    {
        "source_sentence": "依菩薩故，世間便有覺支相應十善業道、若四靜慮、若四無量、若四無色定、若三十七菩提分法、若六神通、若餘無量無邊佛法皆得出現。",
        "translation": "It's because of the bodhisattva that the ten good paths of action associated with the awakening factor in the world, the four meditations, the four immeasurables, the four formless concentrations, the thirty-seven factors of",
        "source": "T07n0220_540:0777c23_11"
    },
    {
        "source_sentence": "若諸如來、應、正等覺不出世時，唯有菩薩由先所聞甚深般若波羅蜜多等流勢力，",
        "translation": "“When the Buddhas do not appear in the world, it is only through the power of those who have heard the profound prajñāpāramitā that enlightening beings are able to enter deeply into all buddha-teachings.",
        "source": "T07n0220_540:0777c27_12"
    },
    {
        "source_sentence": "成就殊勝方便善巧，哀愍世間諸有情故，施設建立覺支相應十善業道、若四靜慮、若四無量、若四無色定、若三十七菩提分法、若六神通、若餘無量無邊佛法。",
        "translation": "Accomplishing extraordinary skillful means and pitying worldly sentient beings, he establishes the ten good paths of action associated with the awakening factor, whether four meditations, four immeasurables, four formless concentrations, thirty",
        "source": "T07n0220_540:0777c28_13"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a03_14"
    },
    {
        "source_sentence": "譬如夜分因滿月輪光明照觸，星宿、藥等隨其勢力皆得增盛。",
        "translation": "It's like when the night watch causes the full moon wheel to shine brightly, stars, constellations, and medicines all grow in strength according to their power.",
        "source": "T07n0220_540:0778a03_15"
    },
    {
        "source_sentence": "如是如來、應、正等覺，前已滅度，正法隱沒，後未出時，世間所有法行、妙行，",
        "translation": "Thus, the Tathāgata, Arhat, Perfectly Enlightened One had already entered nirvana. The true-dharma was concealed; but when he had not yet emerged, all the practices and marvelous deeds of",
        "source": "T07n0220_540:0778a05_16"
    },
    {
        "source_sentence": "一切皆依菩薩出現。",
        "translation": "All of them are based on the bodhisattva's appearance.",
        "source": "T07n0220_540:0778a06_17"
    },
    {
        "source_sentence": "菩薩所有方便善巧，皆依般若波羅蜜多而得成辦。",
        "translation": "All the skillful means of the bodhisattva relies on the perfection of prajñāpāramitā to accomplish it.",
        "source": "T07n0220_540:0778a07_18"
    },
    {
        "source_sentence": "是故般若波羅蜜多是諸殊勝善法根本。",
        "translation": "Therefore, the prajñāpāramitā is the root of superior good qualities.",
        "source": "T07n0220_540:0778a08_19"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T07n0220_540:0778a09_20"
    },
    {
        "source_sentence": "若善男子、善女人等於深般若波羅蜜多，至心聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布，",
        "translation": "If good men and good women wholeheartedly hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, and disseminate the profound prajñāpāramitā,",
        "source": "T07n0220_540:0778a09_21"
    },
    {
        "source_sentence": "當得成就現在、未來世、出世間功德勝利。」",
        "translation": "They'll attain the merit and benefit of accomplishing present, future, and supramundane virtues.",
        "source": "T07n0220_540:0778a12_0"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「是善男子、善女人等，云何成就現在未來世、出世間功德勝利？」",
        "translation": "Śakra Devānām-Indra then said to the Buddha, Good men and good women, how have you accomplished the merits and benefits of present and future worldly and supramundane qualities?",
        "source": "T07n0220_540:0778a12_1"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「是善男子、善女人等，現在不為一切毒藥、厭禱、呪術之所傷害，",
        "translation": "It was then that the Buddha addressed Śakra, lord of gods, saying: Good men and good women, you will not be harmed by all kinds of poisonous medicines, disgusting prayers, or incantations.",
        "source": "T07n0220_540:0778a14_2"
    },
    {
        "source_sentence": "火不能燒，水不能溺，諸刀杖等亦不能害，乃至不為四百四病之所殀歿，",
        "translation": "A fire can't burn it, water can't drown it, and swords and sticks can't harm it, even to the point where it won't be attacked by four hundred and four illnesses.",
        "source": "T07n0220_540:0778a16_3"
    },
    {
        "source_sentence": "唯除先世定業異熟現世應受。",
        "translation": "It's only except for the karmic retribution of past lives that should be experienced in the present life.",
        "source": "T07n0220_540:0778a18_4"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a19_5"
    },
    {
        "source_sentence": "是善男子、善女人等若遭官事、怨賊逼迫，至心誦念甚深般若波羅蜜多，",
        "translation": "Good men and good women, if they're subject to official duties or oppressed by enemies and thieves, wholeheartedly recite the profound prajñāpāramitā.",
        "source": "T07n0220_540:0778a19_6"
    },
    {
        "source_sentence": "若至其所終不為彼譴罰加害，欲求其短皆不能得。",
        "translation": "If they go there, they'll never be condemned or harmed by them, and if they want to ask for their faults, they won't get them.",
        "source": "T07n0220_540:0778a20_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0778a22_8"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a22_9"
    },
    {
        "source_sentence": "甚深般若波羅蜜多威神勢力法令爾故。",
        "translation": "It's because the authoritative power of the profound prajñāpāramitā is so powerful that it causes them to do so.",
        "source": "T07n0220_540:0778a22_10"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a23_11"
    },
    {
        "source_sentence": "是善男子、善女人等，若有欲至國王、王子、大臣等處，至心誦念甚深般若波羅蜜多，",
        "translation": "Good men and good women, if they want to go to kings, princes, ministers, and so forth, wholeheartedly recite the profound prajñāpāramitā,",
        "source": "T07n0220_540:0778a23_12"
    },
    {
        "source_sentence": "定為王等歡喜問訊、供養恭敬、尊重讚歎。",
        "translation": "They'll surely be greeted by the king and others with joy, offered support, venerated, respected, and praised.",
        "source": "T07n0220_540:0778a25_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0778a26_14"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a26_15"
    },
    {
        "source_sentence": "是善男子、善女人等所誦般若波羅蜜多，常於有情引發種種慈悲事故，",
        "translation": "Good men and good women recite the prajñāpāramitā, which always generates various kinds of compassion for sentient beings.",
        "source": "T07n0220_540:0778a26_16"
    },
    {
        "source_sentence": "由此因緣，曠野、險難、人非人等，諸求短者皆不得便。",
        "translation": "Because of these causes and conditions, the wilderness, danger, humans, non-humans, and so forth won't be able to get an advantage over those who seek shortness.",
        "source": "T07n0220_540:0778a28_17"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778a29_18"
    },
    {
        "source_sentence": "是善男子、善女人等，當得成就諸如是等所有現在功德勝利。",
        "translation": "Good men and good women will attain the present merits and benefits of accomplishing such things.",
        "source": "T07n0220_540:0778a29_19"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778b02_20"
    },
    {
        "source_sentence": "是善男子、善女人等隨所生處，常不遠離諸勝善法，不墮惡趣，饒益有情，",
        "translation": "Good men and good women, wherever they may be born, are always not far removed from the supremely good qualities, don’t fall into bad destinies, and give benefit to sentient beings.",
        "source": "T07n0220_540:0778b02_21"
    },
    {
        "source_sentence": "漸能證得一切智智。",
        "translation": "Gradually, they'll be able to realize the cognition of all things.",
        "source": "T07n0220_540:0778b03_22"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T07n0220_540:0778b04_23"
    },
    {
        "source_sentence": "是善男子、善女人等，當得成就諸如是等所有未來功德勝利。」",
        "translation": "Good men and good women will attain the merits and benefits of accomplishing such things in the future.",
        "source": "T07n0220_540:0778b04_24"
    },
    {
        "source_sentence": "爾時，眾多外道梵志，欲求佛過來詣佛所。",
        "translation": "At the time, a large group of non-Buddhist priests wanted to seek the Buddha and came to him.",
        "source": "T07n0220_540:0778b05_25"
    },
    {
        "source_sentence": "時，天帝釋見已，念言：「今此眾多外道梵志，來趣法會伺求佛短，將非般若留難事耶？",
        "translation": "Seeing this, Śakra Devānām-Indra thought, Now, are these many non-Buddhist priests and brāhmaṇas coming to the Dharma assembly to seek the Buddha's shortcomings, or isn't",
        "source": "T07n0220_540:0778b06_26"
    },
    {
        "source_sentence": "我當誦念從佛所受甚深般若波羅蜜多，令彼邪徒復道而去。」",
        "translation": "I will recite the profound prajñāpāramitā that's received from the Buddha and cause those wrongdoers to go on their way again.",
        "source": "T07n0220_540:0778b08_27"
    },
    {
        "source_sentence": "念已便誦甚深般若波羅蜜多。",
        "translation": "After he recites it, he then recites the profound prajñāpāramitā.",
        "source": "T07n0220_540:0778b10_28"
    },
    {
        "source_sentence": "於是眾多外道梵志遙申敬禮、右遶世尊復道而去。",
        "translation": "Many non-Buddhist priests and brahmins then paid their respects from a distance, circled the Bhagavān to his right, and departed.",
        "source": "T07n0220_540:0778b10_29"
    },
    {
        "source_sentence": "時，舍利子見已念言：「彼有何緣適來還去？」",
        "translation": "Seeing them, Śāriputra thought, What's the reason they came back and left?",
        "source": "T07n0220_540:0778b12_30"
    },
    {
        "source_sentence": "佛知其意，告舍利子：「彼諸外道來求我失，由天帝釋誦念般若波羅蜜多令彼還去。",
        "translation": "Knowing what he meant, the Buddha told Śāriputra, Those non-Buddhists who came to ask for my faults because Indra recited the prajñāpāramitā and caused them to return.",
        "source": "T07n0220_540:0778b13_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_540:0778b14_1"
    },
    {
        "source_sentence": "我都不見彼諸外道有少白法，唯懷惡心為求我過來至我所。",
        "translation": "I don't see any of those non-Buddhists who have little white dharmas but harbor bad intentions to ask me to come back to me.",
        "source": "T07n0220_540:0778b15_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T07n0220_540:0778b16_3"
    },
    {
        "source_sentence": "我都不見一切世間有諸天魔及外道等，有情之類說般若時懷勃惡心來求得便，",
        "translation": "I don't see any gods, Māras, or non-Buddhists in all the worlds, and when sentient beings teach prajñā, they harbor bad intentions to come and seek an advantage.",
        "source": "T07n0220_540:0778b16_4"
    },
    {
        "source_sentence": "般若威力無能壞故。」",
        "translation": "It's because the authoritative power of prajñā has no ability to destroy it.",
        "source": "T07n0220_540:0778b18_5"
    },
    {
        "source_sentence": "爾時，惡魔竊作是念：「今佛四眾前後圍遶，欲、色界天皆來集會，宣說般若波羅蜜多。",
        "translation": "It was then that the evil demon secretly thought, Now, surrounded by the fourfold assembly of buddhas, the gods of the desire and form realms all came to assemble and taught the perfection of wisdom.",
        "source": "T07n0220_540:0778b19_0"
    },
    {
        "source_sentence": "此中必有諸大菩薩，親於佛前受菩提記，當得無上正等菩提，轉妙法輪空我境界。",
        "translation": "Here, there must be great bodhisattvas who personally receive the assurance of enlightenment in front of the Buddha, attain unsurpassed perfect enlightenment, and turn the wonderful Dharma wheel into the realm of emptiness and self.",
        "source": "T07n0220_540:0778b20_1"
    },
    {
        "source_sentence": "我當往至破壞其眼。」",
        "translation": "I will go there and destroy their eyes.",
        "source": "T07n0220_540:0778b22_2"
    },
    {
        "source_sentence": "作是念已，化作四軍，奮威勇銳來詣佛所。",
        "translation": "After he had this thought, he transformed his four armies into an army of men of great strength and courage and came to the Buddha.",
        "source": "T07n0220_540:0778b23_3"
    },
    {
        "source_sentence": "時，天帝釋見已念言：「將非惡魔化作斯事，欲來惱佛并與般若波羅蜜多而作留難。",
        "translation": "Seeing this, Śakra Devānām-Indra thought, It won't be a bad demon who does such a thing and wants to harm the Buddha and make it difficult for him to stay with the Prajñāpāramitā.",
        "source": "T07n0220_540:0778b24_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_540:0778b26_5"
    },
    {
        "source_sentence": "如是四軍嚴飾殊麗，諸王軍眾皆不能及，定是惡魔之所化作。",
        "translation": "Thus, these four armies are so beautifully decorated that none of the king's armies can match them, and they must have been created by a bad demon.",
        "source": "T07n0220_540:0778b26_6"
    },
    {
        "source_sentence": "惡魔長夜伺求佛短，壞諸有情所修勝事，我當誦念從佛所受甚深般若波羅蜜多，",
        "translation": "I will recite the profound prajñāpāramitā that evil Māra longs for, seeking the Buddha’s weaknesses and destroying the superior qualities cultivated by sentient beings.",
        "source": "T07n0220_540:0778b27_7"
    },
    {
        "source_sentence": "令彼惡魔復道而去。」",
        "translation": "I'll cause that bad demon to return and leave again.",
        "source": "T07n0220_540:0778b29_8"
    },
    {
        "source_sentence": "時，天帝釋念已，便誦甚深般若波羅蜜多，於是惡魔漸退而去，甚深般若波羅蜜多大神呪王威力逼故。",
        "translation": "After he thought this, Indra the lord of gods recited the profound prajñāpāramitā, and then the Evil One gradually withdrew and departed, being overcome by the power of the great supernatural spell king of the profound pra",
        "source": "T07n0220_540:0778c01_0"
    },
    {
        "source_sentence": "時，有無量三十三天俱時化作天妙音華，踊身空中而散佛上，合掌恭敬同白佛言：「願此般若波羅蜜多在贍部洲人中久住，",
        "translation": "Measureless gods of the thirty-three-fold heavens at that time manifested magical emanations, producing celestial garlands of beautiful sound. They flew up into the sky and scattered them over the Buddha.",
        "source": "T07n0220_540:0778c03_1"
    },
    {
        "source_sentence": "乃至般若波羅蜜多在贍部洲人間流布。",
        "translation": "It goes so far as to spread the prajñāpāramitā among the people of Jambudvīpa.",
        "source": "T07n0220_540:0778c06_2"
    },
    {
        "source_sentence": "當知是處佛、法、僧寶常不滅沒，饒益世間令獲殊勝利益安樂。」",
        "translation": "You should know that this is a place where the treasures of buddhas, dharmas, and saṃgha always remain unceasingly, benefiting the world so that they attain superior benefits and well-being.",
        "source": "T07n0220_540:0778c07_3"
    },
    {
        "source_sentence": "時，彼諸天復各化作天妙音華而散佛上，重白佛言：「若諸有情修行般若波羅蜜多，",
        "translation": "The gods then each magically produced a flower of heavenly wondrous sound and scattered it over the Buddha, repeating to him, saying, Suppose sentient beings practice the perfection of wisdom.",
        "source": "T07n0220_540:0778c08_4"
    },
    {
        "source_sentence": "一切惡魔及彼眷屬伺求其短不能得便。」",
        "translation": "All the bad demons and their retinues who look for their shortcomings can't get an advantage.",
        "source": "T07n0220_540:0778c10_5"
    },
    {
        "source_sentence": "時，天帝釋便白佛言：「若諸有情但聞般若波羅蜜多功德名字，當知如是諸有情類，",
        "translation": "Śakra Devānām-Indra then said to the Buddha, If all sentient beings simply hear the names of the merits of the prajñāpāramitā, you should know that these kinds of sentient beings are likewise.",
        "source": "T07n0220_540:0778c11_6"
    },
    {
        "source_sentence": "已曾供養無量諸佛，於諸佛所發弘誓願，多集善根能成是事，非從少小善根中來，",
        "translation": "Having served innumerable buddhas, they have undertaken great vows toward those buddhas and accumulated roots of goodness to accomplish these things. They do not come from a small number of roots of goodness.",
        "source": "T07n0220_540:0778c13_7"
    },
    {
        "source_sentence": "況能聽聞、受持、讀誦、精勤修學、如理思惟、書寫、解說、廣令流布、供養恭敬、尊重讚歎！",
        "translation": "How could they hear, retain, recite, diligently cultivate, correctly contemplate, write, explain, disseminate, offer support, venerate, and praise it!",
        "source": "T07n0220_540:0778c15_8"
    },
    {
        "source_sentence": "當知如是諸有情類，功德智慧不可思議。",
        "translation": "You should know that the merit and wisdom of these kinds of sentient beings are inconceivable.",
        "source": "T07n0220_540:0778c17_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_540:0778c17_1"
    },
    {
        "source_sentence": "欲求諸佛一切智智，應於般若波羅蜜多理趣中求，如有情類欲求大寶，",
        "translation": "Those who want to pursue the omniscience of all buddhas should seek it in the principle and purpose of the perfection of wisdom, just like sentient beings who want to pursue great treasures.",
        "source": "T07n0220_540:0778c18_2"
    },
    {
        "source_sentence": "應於大海方便勤求，如是欲求一切智智，應於般若波羅蜜多理趣中求。」",
        "translation": "You should diligently pursue it in the ocean of skillful means, and thus want to pursue omniscience and cognition, you should pursue it in the principle and aim of the prajñāpāramitā.",
        "source": "T07n0220_540:0778c19_3"
    },
    {
        "source_sentence": "爾時，佛告天帝釋言：「如是！",
        "translation": "It was then that the Buddha addressed Śakra Devānām-Indra, saying, So it is!",
        "source": "T07n0220_540:0778c21_4"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_540:0778c22_5"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_540:0778c22_6"
    },
    {
        "source_sentence": "諸佛所得一切智智，皆依般若波羅蜜多而得成辦。",
        "translation": "The omniscience and knowledge attained by the buddhas are all accomplished based on the perfection of prajñāpāramitā.",
        "source": "T07n0220_540:0778c22_7"
    },
    {
        "source_sentence": "是故般若波羅蜜多，是諸佛法最勝根本。」",
        "translation": "Therefore, the perfection of wisdom is the most superior root of all the buddha-teachings.",
        "source": "T07n0220_540:0778c23_8"
    },
    {
        "source_sentence": "爾時，慶喜便白佛言：「世尊！",
        "translation": "At that point, Qing joy then said to the Buddha, Bhagavān!",
        "source": "T07n0220_540:0778c24_9"
    },
    {
        "source_sentence": "何緣不讚布施、淨戒、安忍、精進、靜慮、波羅蜜多及餘功德，唯讚般若波羅蜜多？」",
        "translation": "Why doesn't he praise generosity, pure morality, patience, effort, meditation, the perfections, and other virtues but praise the perfections of wisdom?",
        "source": "T07n0220_540:0778c25_10"
    },
    {
        "source_sentence": "佛告慶喜：「由此般若波羅蜜多能與前五波羅蜜多及餘功德為尊為導，",
        "translation": "The Buddha told Qingxi, Because this prajñāpāramitā can be honored and guided by the first five perfections and other merits,",
        "source": "T07n0220_540:0778c26_11"
    },
    {
        "source_sentence": "故我偏讚。",
        "translation": "That's why I praised it partially.",
        "source": "T07n0220_540:0778c28_12"
    },
    {
        "source_sentence": "「復次，慶喜！",
        "translation": "“Furthermore,慶喜!",
        "source": "T07n0220_540:0778c28_13"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T07n0220_540:0778c29_0"
    },
    {
        "source_sentence": "若不迴向一切智智，而修布施乃至般若，此可名為真修布施乃至般若波羅蜜多不？」",
        "translation": "If someone doesn't return to omniscience and cultivates generosity or even prajñā, can this be called truly cultivating generosity or even the perfection of prajñāpāramitā?",
        "source": "T07n0220_540:0778c29_1"
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "Qingxi replied, No!",
        "source": "T07n0220_540:0779a02_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a02_3"
    },
    {
        "source_sentence": "要由迴向一切智智，而修布施乃至般若，乃可名為真修布施乃至般若波羅蜜多。」",
        "translation": "If someone cultivates generosity and even prajñā through dedicating themselves to omniscience and wisdom, then they can be called truly cultivating generosity and even the perfection of prajñāpāramitā.",
        "source": "T07n0220_540:0779a02_4"
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Qingxi, What do you think?",
        "source": "T07n0220_540:0779a04_5"
    },
    {
        "source_sentence": "若不迴向一切智智，而修布施乃至般若，如是所修得名布施等波羅蜜多不？」",
        "translation": "If someone cultivates generosity or even prajñā without dedicating themselves to omniscience and wisdom and cultivates generosity up to prajñā, is this cultivation called the perfection of generosity and so forth?",
        "source": "T07n0220_540:0779a05_0"
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "Qingxi replied, No!",
        "source": "T07n0220_540:0779a06_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a07_2"
    },
    {
        "source_sentence": "要由迴向一切智智，而修布施乃至般若，如是所修乃得布施等波羅蜜多名。」",
        "translation": "If someone cultivates generosity or even prajñā through dedicating themselves to omniscience and wisdom, then they'll attain the many perfections of generosity and so forth.",
        "source": "T07n0220_540:0779a07_3"
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Qingxi, What do you think?",
        "source": "T07n0220_540:0779a09_0"
    },
    {
        "source_sentence": "若不迴向一切智智，而修善根，如是善根得究竟不？」",
        "translation": "If someone doesn't dedicate themselves to omniscience and cultivate good roots, will such good roots attain their ultimate goal?",
        "source": "T07n0220_540:0779a09_1"
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "Qingxi replied, No!",
        "source": "T07n0220_540:0779a10_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a11_0"
    },
    {
        "source_sentence": "要由迴向一切智智，而修善根，如是善根乃得究竟。」",
        "translation": "It's only by dedicating themselves to omniscience and knowledge that they cultivate good roots, and such good roots will attain their end.",
        "source": "T07n0220_540:0779a11_1"
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Qingxi, What do you think?",
        "source": "T07n0220_540:0779a12_2"
    },
    {
        "source_sentence": "若離般若波羅蜜多為能真迴向一切智智不？」",
        "translation": "If you part with the perfection of wisdom, is it true that you can truly return to omniscience and cognition?",
        "source": "T07n0220_540:0779a12_3"
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "Qingxi replied, No!",
        "source": "T07n0220_540:0779a13_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a14_5"
    },
    {
        "source_sentence": "要有般若波羅蜜多乃真迴向一切智智。」",
        "translation": "If you have the perfection of wisdom, then you truly return to omniscience and cognition.",
        "source": "T07n0220_540:0779a14_6"
    },
    {
        "source_sentence": "佛告慶喜：「於意云何？",
        "translation": "The Buddha told Qingxi, What do you think?",
        "source": "T07n0220_540:0779a15_7"
    },
    {
        "source_sentence": "甚深般若波羅蜜多威神功德可思議不？」",
        "translation": "Is the authoritative merit of the profound prajñāpāramitā's authoritative power inconceivable?",
        "source": "T07n0220_540:0779a15_8"
    },
    {
        "source_sentence": "慶喜對曰：「不也！",
        "translation": "Qingxi replied, No!",
        "source": "T07n0220_540:0779a16_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_540:0779a17_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多威神功德不可思議，諸餘善根皆不能及。」",
        "translation": "The authoritative merit of the profound prajñāpāramitā is inconceivable, and no other good roots can match it.",
        "source": "T07n0220_540:0779a17_1"
    },
    {
        "source_sentence": "佛告慶喜：「由此因緣，我說般若波羅蜜多能與前五波羅蜜多及餘功德為尊為導，",
        "translation": "The Buddha told Qingxi, For this reason, I say that the prajñāpāramitā can be honored and guided by the first five perfections and other merits.",
        "source": "T07n0220_540:0779a18_2"
    },
    {
        "source_sentence": "能令前五波羅蜜多及餘功德究竟圓滿，故我偏讚。",
        "translation": "Because they can cause the first five perfections and the other virtues to be completely perfected, I partially praise them.",
        "source": "T07n0220_540:0779a20_3"
    },
    {
        "source_sentence": "若讚般若波羅蜜多，亦讚前五波羅蜜多及餘功德。」",
        "translation": "If you praise the perfection of wisdom, you'll also praise the first five perfections and other merits.",
        "source": "T07n0220_540:0779a21_4"
    },
    {
        "source_sentence": "爾時，慶喜復白佛言：「云何迴向一切智智，而修布施乃至般若波羅蜜多及餘功德？」",
        "translation": "At that point, Qing joy again said to the Buddha, How do you cultivate generosity up to the perfection of wisdom and other virtues by dedicating yourself to omniscience?",
        "source": "T07n0220_540:0779a22_5"
    },
    {
        "source_sentence": "佛告慶喜：「以無二為方便、無生為方便、無所得為方便，迴向一切智智，",
        "translation": "The Buddha said to the Licchavi Vimalakīrti, “With nonduality as their expedient, nonorigination as their expedient, and nongrasping as their expedient, they dedicate themselves to omniscience.",
        "source": "T07n0220_540:0779a24_6"
    },
    {
        "source_sentence": "應修布施乃至般若波羅蜜多及餘功德。」",
        "translation": "You should cultivate generosity up to the perfection of wisdom and other merits.",
        "source": "T07n0220_540:0779a26_7"
    },
    {
        "source_sentence": "具壽慶喜復白佛言：「以何無二為方便、無生為方便、無所得為方便，",
        "translation": "Guoshou Qingqi then said to the Buddha: What makes nonduality so expedient, nonproduction so expedient, and nongrasping so expedient?",
        "source": "T07n0220_540:0779a27_8"
    },
    {
        "source_sentence": "迴向一切智智，應修布施乃至般若波羅蜜多及餘功德？」",
        "translation": "To return to omniscience and cognition, should you cultivate generosity up to the perfection of wisdom and other virtues?",
        "source": "T07n0220_540:0779a28_9"
    },
    {
        "source_sentence": "佛告慶喜：「以色乃至識無二為方便、無生為方便、無所得為方便，迴向一切智智，",
        "translation": "The Buddha told Qingxi, It's because form and even consciousness are not two as a method, nonarising as a method, and nonacquisition as a method to dedicate themselves back to omniscience and cognition.",
        "source": "T07n0220_540:0779b01_0"
    },
    {
        "source_sentence": "應修布施乃至般若波羅蜜多及餘功德。",
        "translation": "You should cultivate generosity up to the perfection of wisdom and other merits.",
        "source": "T07n0220_540:0779b02_1"
    },
    {
        "source_sentence": "以色等法皆性空故，色等性空與布施等皆無二故。",
        "translation": "It's because form and so forth are all empty in nature, and the emptiness of form and so forth is nondual to generosity and so forth.",
        "source": "T07n0220_540:0779b03_2"
    },
    {
        "source_sentence": "慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T07n0220_540:0779b04_3"
    },
    {
        "source_sentence": "由深般若波羅蜜多，乃能迴向一切智智，由能迴向一切智智，令布施等無邊功德究竟圓滿。",
        "translation": "Because of the profound prajñāpāramitā, they can dedicate themselves to omniscience and cognition, and because they can dedicate themselves to omniscience and cognition, they cause limitless merits like generosity to be ultimately perfected.",
        "source": "T07n0220_540:0779b05_4"
    },
    {
        "source_sentence": "是故般若波羅蜜多，與布施等一切功德為尊為導。",
        "translation": "Therefore, the prajñāpāramitā is honored and guided by all the merits of generosity and so forth.",
        "source": "T07n0220_540:0779b07_5"
    },
    {
        "source_sentence": "「慶喜當知！",
        "translation": "Joy, you should know!",
        "source": "T07n0220_540:0779b08_6"
    },
    {
        "source_sentence": "譬如大地以種散中，眾緣和合便得生長，應知大地與種生長為所依止、為能建立。",
        "translation": "It should be known that the factors arising with seeds are the support and the one who is able to make them arise.",
        "source": "T07n0220_540:0779b08_7"
    },
    {
        "source_sentence": "如是般若波羅蜜多及所迴向一切智智，與布施等一切功德為所依止、為能建立，",
        "translation": "Thus, the prajñāpāramitā and the omniscience that they dedicate are all based on and can be established together with all merits like generosity.",
        "source": "T07n0220_540:0779b10_8"
    },
    {
        "source_sentence": "令得生長故，說般若波羅蜜多與布施等一切功德為尊為導故，我偏讚甚深般若波羅蜜多非餘功德，",
        "translation": "Because it causes them to grow, and because it's said that the prajñāpāramitā and all other merits like generosity are honored and guided, I partially praise the profound prajñāpāramitā without any other merit.",
        "source": "T07n0220_540:0779b12_9"
    },
    {
        "source_sentence": "若讚般若即讚餘故。」",
        "translation": "If someone praises prajñā, that's because they praise the others.",
        "source": "T07n0220_540:0779b14_10"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第五百四十",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 5, Volume 40",
        "source": "T07n0220_540:0779b16_0"
    }
]