[
    {
        "source_sentence": "大般若波羅蜜多經卷第四百四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 4",
        "source": "T07n0220_445:0242c10_0"
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T07n0220_445:0242c11_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T07n0220_445:0242c13_0"
    },
    {
        "source_sentence": "第二分船等喻品第四十九之二",
        "translation": "The Forty-nineth and Two Second Parts of the Chapter on the Parables of the Second Part: Ships, etc.",
        "source": "T07n0220_445:0242c14_0"
    },
    {
        "source_sentence": "爾時，具壽善現復白佛言：「世尊！",
        "translation": "It was then that Guoshou Shancheng again said to the Buddha, Bhagavān!",
        "source": "T07n0220_445:0242c15_0"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，云何無方便善巧修行六波羅蜜多，墮於聲聞或獨覺地，",
        "translation": "Good men and good women who live in the bodhisattva vehicle, how can they skillfully cultivate the six perfections without skillful means to fall into the stages of śrāvakas or pratyekbuddhas?",
        "source": "T07n0220_445:0242c15_1"
    },
    {
        "source_sentence": "不證無上正等菩提？」",
        "translation": "They won't realize unsurpassed perfect enlightenment?",
        "source": "T07n0220_445:0242c17_2"
    },
    {
        "source_sentence": "佛告善現：「有菩薩乘諸善男子、善女人等，從初發心無方便善巧故，",
        "translation": "The Buddha told Śaṅgālī, Good men and good women of the bodhisattva vehicle, since the first arousal of their aspiration for enlightenment have had no skillful means to do so.",
        "source": "T07n0220_445:0242c18_3"
    },
    {
        "source_sentence": "修布施時作如是念：『我能行施，我施此物，彼受我施。』",
        "translation": "When he cultivates generosity, he thinks, 'I can practice generosity, give this thing to me, and they'll accept my gift.'",
        "source": "T07n0220_445:0242c19_4"
    },
    {
        "source_sentence": "修淨戒時作如是念：『我能持戒，我持此戒，我成此戒。』",
        "translation": "When he cultivates pure precepts, he thinks, 'I can observe the precepts, I observe these precepts, and I form these precepts.'",
        "source": "T07n0220_445:0242c20_5"
    },
    {
        "source_sentence": "修安忍時作如是念：『我能修忍，我於彼忍，我成此忍。』",
        "translation": "When he cultivates patience, he thinks, 'I can cultivate forbearance, and I'll forbear them, and I'll achieve this forbearance.'",
        "source": "T07n0220_445:0242c22_6"
    },
    {
        "source_sentence": "修精進時作如是念：『我能精進，我為此精進，我成此精進。』",
        "translation": "When he cultivates his effort, he thinks, 'I can make this effort, I will make this effort, and I will accomplish this effort.'",
        "source": "T07n0220_445:0242c23_7"
    },
    {
        "source_sentence": "修靜慮時作如是念：『我能修定，我為此修定，我成此定。』",
        "translation": "When he cultivates meditation, he thinks, 'I can cultivate concentration, and I cultivate concentration for this reason, and I accomplish this concentration.'",
        "source": "T07n0220_445:0242c24_8"
    },
    {
        "source_sentence": "修般若時作如是念：『我能修慧，我為此修慧，我成此慧。』",
        "translation": "When he cultivates prajñā, he thinks, 'I can cultivate wisdom, and I cultivate wisdom for this reason, and I accomplish this wisdom.'",
        "source": "T07n0220_445:0242c25_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_445:0242c27_10"
    },
    {
        "source_sentence": "此菩薩乘諸善男子、善女人等，修布施時執有是布施，執由此布施，執布施為我所而生憍慢；",
        "translation": "“Good men and good women of the enlightening beings’ vehicle, when practicing giving, cling to this kind of giving. They cling to that kind of giving as self and become conceited because they think it belongs to me.",
        "source": "T07n0220_445:0242c27_11"
    },
    {
        "source_sentence": "修淨戒時執有是淨戒，執由此淨戒，執淨戒為我所而生憍慢；",
        "translation": "When they practice pure precepts, they cling to the existence of such pure precepts. They cling to these pure precepts and believe that the pure precepts belong to self, yet become conceited with pride.",
        "source": "T07n0220_445:0242c29_12"
    },
    {
        "source_sentence": "修安忍時執有是安忍，執由此安忍，執安忍為我所而生憍慢；",
        "translation": "When cultivating patience of peace, one clings to the existence of patience. By clinging to patience as peace, one clings to what belongs to self and becomes conceited.",
        "source": "T07n0220_445:0243a01_13"
    },
    {
        "source_sentence": "修精進時執有是精進，執由此精進，執精進為我所而生憍慢；",
        "translation": "When they cultivate zeal, they think there is such zeal. They hold to this kind of zeal as the basis for their practice and believe that it belongs to me. They conceive arrogance in clinging to energy as self.",
        "source": "T07n0220_445:0243a03_14"
    },
    {
        "source_sentence": "修靜慮時執有是靜慮，執由此靜慮，執靜慮為我所而生憍慢；",
        "translation": "At the moment of cultivating trance, they think there is this trance. They hold to this trance and believe that it belongs to me. They become conceited by clinging to it as self.",
        "source": "T07n0220_445:0243a04_15"
    },
    {
        "source_sentence": "修般若時執有是般若，執由此般若，執般若為我所而生憍慢。",
        "translation": "When he cultivates prajñā, he clings to the existence of this prajñā, clings to this prajñā, clings to prajñā as self and becomes conceited.",
        "source": "T07n0220_445:0243a06_16"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等，我、我所執恒隨逐故，所修布施乃至般若波羅蜜多，",
        "translation": "Good men and good women of the bodhisattva vehicle are constantly following self and what belongs to self, so they cultivate generosity up to the perfection of wisdom.",
        "source": "T07n0220_445:0243a07_17"
    },
    {
        "source_sentence": "增長生死不能解脫生等眾苦。",
        "translation": "They grow in birth and death and can't be liberated from the many sufferings of birth and so forth.",
        "source": "T07n0220_445:0243a09_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0243a10_19"
    },
    {
        "source_sentence": "布施波羅蜜多中無如是分別，亦不如彼所分別。",
        "translation": "In the perfection of generosity, there's no such discrimination, and it's not like that discrimination.",
        "source": "T07n0220_445:0243a10_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0243a11_21"
    },
    {
        "source_sentence": "非至此彼岸是布施波羅蜜多相故，乃至般若波羅蜜多中無如是分別，亦不如彼所分別。",
        "translation": "It's because it doesn't reach this other shore because it's the characteristic of the perfection of generosity, and even if there's no such discrimination in the perfection of prajñāpāramitā, it's not like that discrimination.",
        "source": "T07n0220_445:0243a11_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0243a13_23"
    },
    {
        "source_sentence": "非至此彼岸是般若波羅蜜多相故。",
        "translation": "It doesn't reach this other side because it's the characteristic of the prajñāpāramitā.",
        "source": "T07n0220_445:0243a13_24"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_445:0243a14_25"
    },
    {
        "source_sentence": "此菩薩乘諸善男子、善女人等，不知此岸彼岸相故，不能攝受布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "Because these good men and good women of the bodhisattva vehicle don't know this shore or the other shore, they can't gather in generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T07n0220_445:0243a15_0"
    },
    {
        "source_sentence": "如是乃至不能攝受一切智、道相智、一切相智。",
        "translation": "It's like this up to the point where they can't take in omniscience, knowledge of the path, or knowledge of all characteristics.",
        "source": "T07n0220_445:0243a17_1"
    },
    {
        "source_sentence": "由此因緣，是菩薩乘諸善男子、善女人等，墮聲聞地或獨覺地，不證無上正等菩提。",
        "translation": "Because of these causes and conditions, good men and good women in the bodhisattva vehicle fall into the stages of śrāvakas or pratyekbuddhas and don't realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0243a18_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0243a20_3"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，如是無方便善巧修行六波羅蜜多，墮於聲聞或獨覺地，",
        "translation": "Good men and good women in the bodhisattva vehicle who thus skillfully cultivate the six perfections without skillful means will fall into the stage of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_445:0243a20_4"
    },
    {
        "source_sentence": "不證無上正等菩提。」",
        "translation": "They won't realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0243a22_5"
    },
    {
        "source_sentence": "爾時，具壽善現復白佛言：「世尊！",
        "translation": "It was then that Guoshou Shancheng again said to the Buddha, Bhagavān!",
        "source": "T07n0220_445:0243a23_0"
    },
    {
        "source_sentence": "云何住菩薩乘諸善男子、善女人等，由能攝受甚深般若波羅蜜多，方便善巧具諸功德，",
        "translation": "How can the good men and good women who abide in the bodhisattva vehicle gather the profound prajñāpāramitā by skillfully combining merits with skillful means?",
        "source": "T07n0220_445:0243a23_1"
    },
    {
        "source_sentence": "不墮聲聞及獨覺地，疾證無上正等菩提？」",
        "translation": "They won't fall into the stages of śrāvakas and pratyekbuddhas and quickly realize unsurpassed perfect enlightenment?",
        "source": "T07n0220_445:0243a25_2"
    },
    {
        "source_sentence": "佛告善現：「有菩薩乘諸善男子、善女人等，從初發心離我、我所執修行布施乃至般若波羅蜜多，",
        "translation": "The Buddha told Shancheng, There are bodhisattva-vehicle good men and good women who cultivate generosity from the first arousal of mind free of self and attachment to self up to the perfection of prajñāpāramitā.",
        "source": "T07n0220_445:0243a26_3"
    },
    {
        "source_sentence": "此善男子、善女人等，修布施時不作是念：『我能行施，我施此物，彼受我施。』",
        "translation": "When these good men and good women cultivate generosity, they don't think, 'I can practice generosity, give this thing to me, and they receive it from me.'",
        "source": "T07n0220_445:0243a28_4"
    },
    {
        "source_sentence": "修淨戒時不作是念：『我能持戒，我持此戒，我具是戒。』",
        "translation": "When he cultivates pure precepts, he doesn't think, 'I can observe the precepts, I observe these precepts, and I have all these precepts.'",
        "source": "T07n0220_445:0243b01_5"
    },
    {
        "source_sentence": "修安忍時不作是念：『我能修忍，我於彼忍，我具是忍。』",
        "translation": "When he cultivates patience, he doesn't think, 'I can cultivate forbearance, and when I cultivate forbearance in that place, I have this kind of forbearance.'",
        "source": "T07n0220_445:0243b02_6"
    },
    {
        "source_sentence": "修精進時不作是念：『我能精進，我為此精進，我具是精進。』",
        "translation": "When he cultivates effort, he doesn't think, 'I can make effort, and I do this effort for myself, and I am fully capable of making effort.'",
        "source": "T07n0220_445:0243b03_7"
    },
    {
        "source_sentence": "修靜慮時不作是念：『我能修定，我為此修定，我具是定。』",
        "translation": "When he cultivates meditation, he doesn't think, 'I can cultivate concentration, and I cultivate concentration for this reason, and I have all these concentrations.'",
        "source": "T07n0220_445:0243b05_8"
    },
    {
        "source_sentence": "修般若時不作是念：『我能修慧，我為此修慧，我具是慧。』",
        "translation": "When he cultivates prajñā, he doesn't think, 'I can cultivate wisdom, and I cultivate wisdom for this reason, and I have all the wisdom.'",
        "source": "T07n0220_445:0243b06_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_445:0243b07_10"
    },
    {
        "source_sentence": "此善男子、善女人等，修布施時不執有布施，不執由此布施，不執布施為我所；",
        "translation": "These sons and daughters of a virtuous family, when practicing charity, do not cling to generosity; they do not cling to that which is given. They do not cling to that which is given, and they do not cling to what belongs to them.",
        "source": "T07n0220_445:0243b08_0"
    },
    {
        "source_sentence": "修淨戒時不執有淨戒，不執由此淨戒，不執淨戒為我所；",
        "translation": "When they practice pure precepts, they do not cling to the existence of pure precepts. They do not cling to these pure precepts and do not regard pure precepts as belonging to self.",
        "source": "T07n0220_445:0243b09_1"
    },
    {
        "source_sentence": "修安忍時不執有安忍，不執由此安忍，不執安忍為我所；",
        "translation": "When cultivating patience, they do not cling to patience as peacefulness. They do not cling to this peacefulness of tolerance and do not believe that peacefulness belongs to the self.",
        "source": "T07n0220_445:0243b11_2"
    },
    {
        "source_sentence": "修精進時不執有精進，不執由此精進，不執精進為我所；",
        "translation": "When they cultivate zeal, they do not cling to the existence of zeal. They do not cling to this kind of zeal; they do not cling to what belongs to self.",
        "source": "T07n0220_445:0243b12_3"
    },
    {
        "source_sentence": "修靜慮時不執有靜慮，不執由此靜慮，不執靜慮為我所；",
        "translation": "When they practice meditation, they do not cling to the existence of meditative absorption. They do not cling to this meditative absorption and do not believe that it belongs to me.",
        "source": "T07n0220_445:0243b13_4"
    },
    {
        "source_sentence": "修般若時不執有般若，不執由此般若，不執般若為我所。",
        "translation": "When cultivating prajñā, they don't cling to the existence of prajñā, don't cling to this prajñā, and don't cling to prajñā as self.",
        "source": "T07n0220_445:0243b14_5"
    },
    {
        "source_sentence": "是善男子、善女人等，我、我所執不隨逐故，所行布施乃至般若波羅蜜多，",
        "translation": "Good men and good women, because they don't cling to self or what belongs to self, the generosity they practice up to the perfection of wisdom.",
        "source": "T07n0220_445:0243b16_6"
    },
    {
        "source_sentence": "損減生死速能解脫生等眾苦。",
        "translation": "He's able to quickly liberate himself from the suffering of birth and so forth by reducing birth and death.",
        "source": "T07n0220_445:0243b17_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0243b18_8"
    },
    {
        "source_sentence": "布施波羅蜜多中無如是分別可起此執，乃至般若波羅蜜多中亦無如是分別可起此執。",
        "translation": "There's no such discrimination in the perfection of generosity that can give rise to this attachment, and there's no such discrimination in the perfection of wisdom that can give rise to this attachment.",
        "source": "T07n0220_445:0243b18_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0243b20_10"
    },
    {
        "source_sentence": "遠離此彼岸，是布施波羅蜜多相，乃至是般若波羅蜜多相故。",
        "translation": "Being far removed from this and that shore is the characteristic of the perfection of generosity, up to the characteristic of the perfection of wisdom.",
        "source": "T07n0220_445:0243b21_11"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_445:0243b22_12"
    },
    {
        "source_sentence": "此菩薩乘諸善男子、善女人等，善知此岸彼岸相故，便能攝受布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "Because these good men and good women of the bodhisattva vehicle well know the characteristics of this shore and the other shore, they're able to gather in generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T07n0220_445:0243b22_13"
    },
    {
        "source_sentence": "如是乃至能攝受一切智、道相智、一切相智。",
        "translation": "Thus, it's up to the point where they can gather in omniscience, knowledge of the path, and knowledge of all characteristics.",
        "source": "T07n0220_445:0243b25_14"
    },
    {
        "source_sentence": "由是因緣，此菩薩乘諸善男子、善女人等，不墮聲聞及獨覺地，速證無上正等菩提。」",
        "translation": "Because of these causes and conditions, these good men and good women of the bodhisattva vehicle won't fall into the stages of śrāvakas and pratyekbuddhas and quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0243b26_15"
    },
    {
        "source_sentence": "爾時，具壽善現復白佛言：「世尊！",
        "translation": "It was then that Guoshou Shancheng again said to the Buddha, Bhagavān!",
        "source": "T07n0220_445:0243b28_0"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等云何有方便善巧，修行六波羅蜜多，不墮聲聞及獨覺地，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle, how can they have skillful means to cultivate the six transcendent ways without falling into the stages of śrāvakas or pratyekbuddhas?",
        "source": "T07n0220_445:0243b28_1"
    },
    {
        "source_sentence": "疾證無上正等菩提？」",
        "translation": "Will you quickly realize unsurpassed perfect enlightenment?",
        "source": "T07n0220_445:0243c01_2"
    },
    {
        "source_sentence": "佛告善現：「有菩薩乘諸善男子、善女人等，從初發心有方便善巧故，",
        "translation": "The Buddha told Śaṅgālī, Good men and good women of the bodhisattva vehicle have had skillful means since the very first arousal of their minds.",
        "source": "T07n0220_445:0243c02_3"
    },
    {
        "source_sentence": "修布施時不作是念：『我能行施，我施此物，彼受我施。』",
        "translation": "When he cultivates generosity, he doesn't think, 'I can give, I give this thing, and they receive my gift.'",
        "source": "T07n0220_445:0243c03_4"
    },
    {
        "source_sentence": "修淨戒時不作是念：『我能持戒，我持此戒，我成此戒。』",
        "translation": "When he cultivates pure precepts, he doesn't think, 'I can observe the precepts, I observe these precepts, and I accomplish these precepts.'",
        "source": "T07n0220_445:0243c04_5"
    },
    {
        "source_sentence": "修安忍時不作是念：『我能修忍，我於彼忍，我成此忍。』",
        "translation": "When he cultivates patience, he doesn't think, 'I can cultivate forbearance, and I tolerate them, and I accomplish this forbearance.'",
        "source": "T07n0220_445:0243c06_6"
    },
    {
        "source_sentence": "修精進時不作是念：『我能精進，我為此精進，我成此精進。』",
        "translation": "When he cultivates effort, he doesn't think, 'I can make effort, and I do this effort for myself, and I accomplish this effort.'",
        "source": "T07n0220_445:0243c07_7"
    },
    {
        "source_sentence": "修靜慮時不作是念：『我能修定，我為此修定，我成此定。』",
        "translation": "When he cultivates meditation, he doesn't think, 'I can cultivate concentration, I cultivate concentration for this reason, and I accomplish this concentration.'",
        "source": "T07n0220_445:0243c08_8"
    },
    {
        "source_sentence": "修般若時不作是念：『我能修慧，我為此修慧，我成此慧。』",
        "translation": "When he cultivates prajñā, he doesn't think, 'I can cultivate wisdom, and I cultivate wisdom for this reason, and I accomplish this wisdom.'",
        "source": "T07n0220_445:0243c10_9"
    },
    {
        "source_sentence": "「復次，善現！",
        "translation": "“Furthermore, Sunetra!",
        "source": "T07n0220_445:0243c11_10"
    },
    {
        "source_sentence": "此菩薩乘諸善男子、善女人等，修布施時不執有布施，不執由此布施，",
        "translation": "Good men and good women of the bodhisattva vehicle don't cling to generosity when they cultivate generosity, and they don't cling to it.",
        "source": "T07n0220_445:0243c11_11"
    },
    {
        "source_sentence": "不執布施為我所亦不憍慢；",
        "translation": "They do not think that generosity is a thing of self, nor are they arrogant.",
        "source": "T07n0220_445:0243c13_12"
    },
    {
        "source_sentence": "修淨戒時不執有淨戒，不執由此淨戒，不執淨戒為我所亦不憍慢；",
        "translation": "When they practice pure precepts, they do not cling to the existence of impure precepts. They do not cling to such pure precepts. They do not regard impure precepts as belonging to self and are not conceited.",
        "source": "T07n0220_445:0243c13_13"
    },
    {
        "source_sentence": "修安忍時不執有安忍，不執由此安忍，不執安忍為我所亦不憍慢；",
        "translation": "When cultivating patience, they do not cling to peaceful tolerance. They do not cling to this peaceful tolerance. They do not cling to peaceful tolerance as a self or conceit.",
        "source": "T07n0220_445:0243c15_14"
    },
    {
        "source_sentence": "修精進時不執有精進，不執由此精進，不執精進為我所亦不憍慢；",
        "translation": "When they cultivate effort, they do not cling to the existence of effort. They do not cling to this effort. They do not cling to what belongs to self and are neither arrogant nor conceited.",
        "source": "T07n0220_445:0243c17_15"
    },
    {
        "source_sentence": "修靜慮時不執有靜慮，不執由此靜慮，不執靜慮為我所亦不憍慢；",
        "translation": "When they practice meditation, they do not cling to the existence of meditation. They do not cling to it; they do not cling to what belongs to them. They do not cling to self or pride.",
        "source": "T07n0220_445:0243c18_16"
    },
    {
        "source_sentence": "修般若時不執有般若，不執由此般若，不執般若為我所亦不憍慢。",
        "translation": "When cultivating prajñā, they don't cling to the existence of prajñā, don't cling to this prajñā, don't cling to prajñā as self, and don't become conceited.",
        "source": "T07n0220_445:0243c20_17"
    },
    {
        "source_sentence": "是菩薩乘諸善男子、善女人等，我、我所執不隨逐故，所修布施乃至般若波羅蜜多，",
        "translation": "Good men and good women of the bodhisattva vehicle cultivate generosity up to the perfection of wisdom because they don't follow self or what belongs to self.",
        "source": "T07n0220_445:0243c21_18"
    },
    {
        "source_sentence": "損減生死速能解脫生等眾苦。",
        "translation": "He's able to quickly liberate himself from the suffering of birth and so forth by reducing birth and death.",
        "source": "T07n0220_445:0243c23_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0243c24_20"
    },
    {
        "source_sentence": "布施波羅蜜多相中，無如是分別亦不如彼所分別。",
        "translation": "In the characteristics of the perfection of generosity, there's no such discrimination, and it's not as discriminated as they are.",
        "source": "T07n0220_445:0243c24_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0243c25_22"
    },
    {
        "source_sentence": "非至此岸彼岸，是布施波羅蜜多相故，乃至般若波羅蜜多相中，無如是分別亦不如彼所分別。",
        "translation": "It doesn't reach this shore or the other shore because it's the characteristic of the perfection of generosity, and even in the characteristic of the perfection of prajñāpāramitā, there's no such discrimination that isn't like what they discriminate.",
        "source": "T07n0220_445:0243c25_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0243c28_0"
    },
    {
        "source_sentence": "非至此岸彼岸是般若波羅蜜多相故。",
        "translation": "It's because it doesn't reach this shore or the other shore because it's the characteristic of the prajñāpāramitā.",
        "source": "T07n0220_445:0243c28_1"
    },
    {
        "source_sentence": "「善現當知！",
        "translation": "Good manifestation, you should know!",
        "source": "T07n0220_445:0243c29_2"
    },
    {
        "source_sentence": "此菩薩乘諸善男子、善女人等，善知此岸彼岸相故，便能攝受布施、淨戒、安忍、精進、靜慮、般若波羅蜜多，",
        "translation": "Because these good men and good women of the bodhisattva vehicle well know the characteristics of this shore and the other shore, they're able to gather in generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T07n0220_445:0243c29_3"
    },
    {
        "source_sentence": "乃至能攝受一切智、道相智、一切相智，由此因緣，是菩薩乘諸善男子、善女人等不墮聲聞及獨覺地，",
        "translation": "Because of these causes and conditions, good men and good women of the bodhisattva vehicle don't fall into the stages of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_445:0244a02_4"
    },
    {
        "source_sentence": "疾證無上正等菩提。",
        "translation": "He quickly realizes unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0244a04_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0244a05_6"
    },
    {
        "source_sentence": "住菩薩乘諸善男子、善女人等，如是有方便善巧修行六波羅蜜多，不墮聲聞及獨覺地，",
        "translation": "Good men and good women who abide in the bodhisattva vehicle thus skillfully cultivate these six perfections with skillful means, not falling into the stages of śrāvakas or pratyekbuddhas.",
        "source": "T07n0220_445:0244a05_7"
    },
    {
        "source_sentence": "速證無上正等菩提。」",
        "translation": "They'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0244a07_8"
    },
    {
        "source_sentence": "第二分初業品第五十之一",
        "translation": "The Fifty-first Chapter of the Second Part of the First Chapter of Karma",
        "source": "T07n0220_445:0244a08_0"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_445:0244a09_0"
    },
    {
        "source_sentence": "初業菩薩摩訶薩，應云何學般若、靜慮、精進、安忍、淨戒、布施波羅蜜多？」",
        "translation": "How should a bodhisattva-mahāsattva in the first stage of karma train in prajñā, meditation, effort, patience, pure morality, and the perfection of generosity?",
        "source": "T07n0220_445:0244a09_1"
    },
    {
        "source_sentence": "佛告善現：「初業菩薩摩訶薩，若欲修學般若、靜慮、精進、安忍、淨戒、布施波羅蜜多，",
        "translation": "The Buddha told Shancheng, If a bodhisattva-mahāsattva of the first karma wants to cultivate prajñā, meditation, effort, patience, pure morality, and the perfection of generosity,",
        "source": "T07n0220_445:0244a11_2"
    },
    {
        "source_sentence": "應先親近、承事、供養能善宣說般若、靜慮、精進、安忍、淨戒、布施波羅蜜多真淨善友，",
        "translation": "You should first become intimate with, serve, and make offerings to someone who can skillfully explain the true and pure good friends of prajñā, meditation, effort, patience, forbearance, morality, and generosity.",
        "source": "T07n0220_445:0244a12_3"
    },
    {
        "source_sentence": "謂說般若波羅蜜多甚深經時，教授教誡初業菩薩摩訶薩言：『來！",
        "translation": "It means that when he teaches the profound sūtras of the Prajñāpāramitā, he teaches and admonishes the first-practic bodhisattva Mahāsattva, saying, 'Come!'",
        "source": "T07n0220_445:0244a14_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T07n0220_445:0244a16_5"
    },
    {
        "source_sentence": "汝應勤修布施、淨戒、安忍、精進、靜慮、般若波羅蜜多。",
        "translation": "You should diligently cultivate generosity, pure morality, patience, effort, meditation, and the perfection of wisdom.",
        "source": "T07n0220_445:0244a16_6"
    },
    {
        "source_sentence": "汝勤修時應以無所得而為方便，與一切有情平等共有迴向無上正等菩提。",
        "translation": "When you diligently cultivate it, you should make the ungraspable as your method, equally dedicating yourself to unsurpassed perfect enlightenment together with all sentient beings.",
        "source": "T07n0220_445:0244a17_7"
    },
    {
        "source_sentence": "汝勿以色而取無上正等菩提，亦勿以受、想、行、識而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment with form, and don't take unsurpassed correct perfect enlightenment with sensation, perception, volition, or consciousness.",
        "source": "T07n0220_445:0244a19_8"
    },
    {
        "source_sentence": "汝勿以眼處而取無上正等菩提，亦勿以耳、鼻、舌、身、意處而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment from the eye, and don't take unsurpassed correct perfect enlightenment from the ear, nose, tongue, body, or mind.",
        "source": "T07n0220_445:0244a20_9"
    },
    {
        "source_sentence": "汝勿以色處而取無上正等菩提，亦勿以聲、香、味、觸、法處而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment from the form realm and don't take unsurpassed correct perfect enlightenment from the sound, smell, taste, touch, or dharma realms.",
        "source": "T07n0220_445:0244a22_10"
    },
    {
        "source_sentence": "汝勿以眼界而取無上正等菩提，亦勿以耳、鼻、舌、身、意界而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment from the eye realm and don't take unsurpassed correct perfect enlightenment from the ear, nose, tongue, body, or mind realms.",
        "source": "T07n0220_445:0244a24_11"
    },
    {
        "source_sentence": "汝勿以色界而取無上正等菩提，亦勿以聲、香、味、觸、法界而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment from the form realm and don't take unsurpassed correct perfect enlightenment from the sound, smell, taste, touch, or dharma realms.",
        "source": "T07n0220_445:0244a26_12"
    },
    {
        "source_sentence": "汝勿以眼識界而取無上正等菩提，亦勿以耳、鼻、舌、身、意識界而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment with the element of eye consciousness, and don't take unsurpassed correct perfect enlightenment with the elements of ear, nose, tongue, body, and consciousness.",
        "source": "T07n0220_445:0244a27_13"
    },
    {
        "source_sentence": "汝勿以眼觸而取無上正等菩提，亦勿以耳、鼻、舌、身、意觸而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment by touching it with the eye, and don't take unsurpassed correct perfect enlightenment by touching it with the ear, nose, tongue, body, or mind.",
        "source": "T07n0220_445:0244a29_14"
    },
    {
        "source_sentence": "汝勿以眼觸為緣所生諸受而取無上正等菩提，亦勿以耳、鼻、舌、身、意觸為緣所生諸受而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment from the sensations that arise from eye contact as a condition and don't take unsurpassed correct perfect enlightenment from the sensations that arise from ear, nose, nose, tongue, body, or mind contact as a condition.",
        "source": "T07n0220_445:0244b02_15"
    },
    {
        "source_sentence": "汝勿以布施波羅蜜多而取無上正等菩提，亦勿以淨戒、安忍、精進、靜慮、般若波羅蜜多而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment with the perfection of generosity, and don't take unsurpassed correct perfect enlightenment with the perfections of pure morality, patience, effort, meditation, and prajñāpāramitā.",
        "source": "T07n0220_445:0244b04_16"
    },
    {
        "source_sentence": "汝勿以內空而取無上正等菩提，亦勿以外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment because of internal emptiness, and don't take unsurpassed correct perfect enlightenment because of external emptiness, internal and external emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, emptiness that disperses and doesn't disperse, emptiness",
        "source": "T07n0220_445:0244b07_17"
    },
    {
        "source_sentence": "汝勿以真如而取無上正等菩提，亦勿以法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment by means of true reality, and don't take unsurpassed correct perfect enlightenment by means of the Dharma realm, Dharma nature, non-falsity, immutability, equality, freedom from birth, legality, Dharma abiding, reality, space, or inconceivable realms.",
        "source": "T07n0220_445:0244b11_18"
    },
    {
        "source_sentence": "汝勿以苦聖諦而取無上正等菩提，亦勿以集、滅、道聖諦而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment from the noble truth of suffering, and don't take unsurpassed correct perfect enlightenment from the noble truths of arising, ceasing, and the path.",
        "source": "T07n0220_445:0244b15_19"
    },
    {
        "source_sentence": "汝勿以四靜慮而取無上正等菩提，亦勿以四無量、四無色定而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment with the four meditations, and don't take unsurpassed correct perfect enlightenment with the four immeasurable and four formless concentrations.",
        "source": "T07n0220_445:0244b16_20"
    },
    {
        "source_sentence": "汝勿以八解脫而取無上正等菩提，亦勿以八勝處、九次第定、十遍處而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment with the eight liberations, and don't take unsurpassed correct perfect enlightenment with the eight superior abodes, nine graduated concentrations, and ten universal abodes.",
        "source": "T07n0220_445:0244b18_21"
    },
    {
        "source_sentence": "汝勿以四念住而取無上正等菩提，亦勿以四正斷、四神足、五根、五力、七等覺支、八聖道支而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment with the four abodes of mindfulness, and don't take unsurpassed correct perfect enlightenment with the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, or the eight noble factors of the path.",
        "source": "T07n0220_445:0244b20_22"
    },
    {
        "source_sentence": "汝勿以空解脫門而取無上正等菩提，亦勿以無相、無願解脫門而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment by the liberation gate of emptiness, and don't take unsurpassed correct perfect enlightenment by the liberation gate of signlessness and wishlessness.",
        "source": "T07n0220_445:0244b23_23"
    },
    {
        "source_sentence": "汝勿以五眼而取無上正等菩提，亦勿以六神通而取無上正等菩提。",
        "translation": "Don't take unsurpassed perfect enlightenment with the five eyes, and don't take unsurpassed perfect enlightenment with the six supernormal powers.",
        "source": "T07n0220_445:0244b25_24"
    },
    {
        "source_sentence": "汝勿以佛十力而取無上正等菩提，亦勿以四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法而取無上正等菩提。",
        "translation": "Don't take the unsurpassed correct perfect enlightenment with the Buddha's ten powers, and don't take the unsurpassed correct perfect enlightenment with the four fearlessnesses, four unhindered understandings, great kindness, great compassion, great joy, great equanimity, and 18 uncommon dharmas of the Buddha.",
        "source": "T07n0220_445:0244b26_25"
    },
    {
        "source_sentence": "汝勿以三十二大士相而取無上正等菩提，亦勿以八十隨好而取無上正等菩提。",
        "translation": "Don't take unsurpassed perfect enlightenment with the thirty-two marks of a great person, and don't take unsurpassed perfect enlightenment with the eighty-eight secondary signs.",
        "source": "T07n0220_445:0244b29_26"
    },
    {
        "source_sentence": "汝勿以無忘失法而取無上正等菩提，亦勿以恒住捨性而取無上正等菩提。",
        "translation": "Don't take unsurpassed perfect enlightenment with the absence of forgetfulness, and don't take unsurpassed perfect enlightenment with the constant abiding equanimity.",
        "source": "T07n0220_445:0244c02_27"
    },
    {
        "source_sentence": "汝勿以陀羅尼門而取無上正等菩提，亦勿以三摩地門而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment by means of the dhāraṇī approach, and don't take unsurpassed correct perfect enlightenment by means of the samādhi approach.",
        "source": "T07n0220_445:0244c04_28"
    },
    {
        "source_sentence": "汝勿以一切智而取無上正等菩提，亦勿以道相智、一切相智而取無上正等菩提。",
        "translation": "Don't take unsurpassed correct perfect enlightenment with omniscience, and don't take unsurpassed correct perfect enlightenment with knowledge of the path and omniscience.",
        "source": "T07n0220_445:0244c05_29"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c07_30"
    },
    {
        "source_sentence": "若不取色便得無上正等菩提，不取受、想、行、識便得無上正等菩提，",
        "translation": "If they don’t grasp form, they’ll attain unsurpassed true and complete enlightenment; if they don’t grasp sensation, perception, volition, and consciousness, they’ll attain unsurpassed true and complete enlightenment.",
        "source": "T07n0220_445:0244c08_0"
    },
    {
        "source_sentence": "如是乃至若不取一切智便得無上正等菩提，不取道相智、一切相智便得無上正等菩提。",
        "translation": "If someone doesn't grasp omniscience, they'll attain unsurpassed correct perfect enlightenment, and if they don't grasp knowledge of the path and knowledge of all characteristics, they'll attain unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_445:0244c09_1"
    },
    {
        "source_sentence": "「『汝善男子！",
        "translation": "'You good sons!",
        "source": "T07n0220_445:0244c11_2"
    },
    {
        "source_sentence": "修行甚深般若波羅蜜多時，勿於色生貪愛，勿於受、想、行、識生貪愛。",
        "translation": "When cultivating the profound prajñāpāramitā, don't give rise to craving for form and don't give rise to craving for sensation, perception, volition, or consciousness.",
        "source": "T07n0220_445:0244c11_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c13_4"
    },
    {
        "source_sentence": "色乃至識非可貪愛。",
        "translation": "Form and even consciousness are not desirable.",
        "source": "T07n0220_445:0244c13_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0244c14_6"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0244c14_7"
    },
    {
        "source_sentence": "勿於眼處生貪愛，勿於耳、鼻、舌、身、意處生貪愛。",
        "translation": "Don't give rise to craving for the eye, and don't give rise to craving for the ear, nose, tongue, body, or mind.",
        "source": "T07n0220_445:0244c14_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c15_9"
    },
    {
        "source_sentence": "眼處乃至意處非可貪愛。",
        "translation": "The sense-field of the eye or even the sense-field of the mind are not desirable.",
        "source": "T07n0220_445:0244c16_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0244c16_11"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0244c16_12"
    },
    {
        "source_sentence": "勿於色處生貪愛，勿於聲、香、味、觸、法處生貪愛。",
        "translation": "Don't give rise to craving in the form realm, and don't give rise to craving in the sound, smell, taste, touch, or dharma realms.",
        "source": "T07n0220_445:0244c17_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c18_14"
    },
    {
        "source_sentence": "色處乃至法處非可貪愛。",
        "translation": "The form realm and even the Dharma realm are not desirable.",
        "source": "T07n0220_445:0244c18_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0244c19_16"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0244c19_17"
    },
    {
        "source_sentence": "勿於眼界生貪愛，勿於耳、鼻、舌、身、意界生貪愛。",
        "translation": "Don't give rise to craving in the eye realm, and don't give rise to craving in the ear, nose, tongue, body, and mind realms.",
        "source": "T07n0220_445:0244c19_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c21_0"
    },
    {
        "source_sentence": "眼界乃至意界非可貪愛。",
        "translation": "The eye realm and even the mind realm are not desirable.",
        "source": "T07n0220_445:0244c21_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0244c21_2"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0244c22_0"
    },
    {
        "source_sentence": "勿於色界生貪愛，勿於聲、香、味、觸、法界生貪愛。",
        "translation": "Don't give rise to craving in the form realm, and don't give rise to craving in the sound, smell, taste, touch, or dharma realms.",
        "source": "T07n0220_445:0244c22_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c23_2"
    },
    {
        "source_sentence": "色界乃至法界非可貪愛。",
        "translation": "The form realm and even the Dharma realm are not desirable.",
        "source": "T07n0220_445:0244c23_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0244c24_4"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0244c24_5"
    },
    {
        "source_sentence": "勿於眼識界生貪愛，勿於耳、鼻、舌、身、意識界生貪愛。",
        "translation": "Don't give rise to craving in the eye and consciousness realms, and don't give rise to craving in the ear, nose, tongue, body, and consciousness realms.",
        "source": "T07n0220_445:0244c25_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c26_1"
    },
    {
        "source_sentence": "眼識界乃至意識界非可貪愛。",
        "translation": "The element of the eye, consciousness, and even the element of consciousness are not desirable.",
        "source": "T07n0220_445:0244c26_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0244c27_3"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0244c27_4"
    },
    {
        "source_sentence": "勿於眼觸生貪愛，勿於耳、鼻、舌、身、意觸生貪愛。",
        "translation": "Don't give rise to craving for eye contact, and don't give rise to craving for ear, nose, tongue, body, or mind contact.",
        "source": "T07n0220_445:0244c27_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0244c28_6"
    },
    {
        "source_sentence": "眼觸乃至意觸非可貪愛。",
        "translation": "Eye contact and even mental contact are not desirable.",
        "source": "T07n0220_445:0244c29_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0244c29_8"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0244c29_9"
    },
    {
        "source_sentence": "勿於眼觸為緣所生諸受生貪愛，勿於耳、鼻、舌、身、意觸為緣所生諸受生貪愛。",
        "translation": "Don't give rise to craving for sensations that arise from eye contact as a condition, and don't give rise to craving for sensations that arise from ear, nose, nose, tongue, body, or mind contact as a condition.",
        "source": "T07n0220_445:0245a01_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a03_11"
    },
    {
        "source_sentence": "眼觸為緣所生諸受乃至意觸為緣所生諸受非可貪愛。",
        "translation": "The sensations that arise from visual contact as a condition and the sensations that arise from mental contact as a condition are not desirable.",
        "source": "T07n0220_445:0245a03_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a04_13"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a04_14"
    },
    {
        "source_sentence": "勿於布施波羅蜜多生貪愛，勿於淨戒、安忍、精進、靜慮、般若波羅蜜多生貪愛。",
        "translation": "Don't give rise to craving for the perfection of generosity, and don't give rise to craving for the perfections of pure morality, patience, effort, meditation, and wisdom.",
        "source": "T07n0220_445:0245a05_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a07_0"
    },
    {
        "source_sentence": "布施波羅蜜多乃至般若波羅蜜多非可貪愛。",
        "translation": "The perfection of generosity and even the perfection of wisdom are not desirable.",
        "source": "T07n0220_445:0245a07_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a08_2"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a08_3"
    },
    {
        "source_sentence": "勿於內空生貪愛，勿於外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空生貪愛。",
        "translation": "Don't give rise to craving for internal emptiness, and don't give rise to craving for external emptiness, internal and external emptiness, emptiness, emptiness, great emptiness, ultimate emptiness, emptiness without limit, dispersed emptiness or dispersed emptiness, emptiness of original nature, emp",
        "source": "T07n0220_445:0245a08_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a12_5"
    },
    {
        "source_sentence": "內空乃至無性自性空非可貪愛。",
        "translation": "The emptiness of internal emptiness or even the emptiness of the self-nature of absence of nature is not desirable.",
        "source": "T07n0220_445:0245a12_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a13_7"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a13_8"
    },
    {
        "source_sentence": "勿於真如生貪愛，勿於法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界生貪愛。",
        "translation": "Don't give rise to craving for the true nature, and don't give rise to craving for the Dharma realm, Dharma nature, non-falsity, unchanging and dissimilar nature, equality, freedom from arising, legality, Dharma abiding, reality, space, or inconceivable realms.",
        "source": "T07n0220_445:0245a14_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a16_10"
    },
    {
        "source_sentence": "真如乃至不思議界非可貪愛。",
        "translation": "The true nature and even the inconceivable realm are not desirable.",
        "source": "T07n0220_445:0245a17_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a17_12"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a17_13"
    },
    {
        "source_sentence": "勿於苦聖諦生貪愛，勿於集、滅、道聖諦生貪愛。",
        "translation": "Don't give rise to craving for the noble truth of suffering, and don't give rise to craving for the noble truths of arising, ceasing, and the path.",
        "source": "T07n0220_445:0245a18_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a19_15"
    },
    {
        "source_sentence": "苦聖諦乃至道聖諦非可貪愛。",
        "translation": "The noble truth of suffering and even the noble truth of the path are not desirable.",
        "source": "T07n0220_445:0245a19_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a20_17"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a20_18"
    },
    {
        "source_sentence": "勿於四靜慮生貪愛，勿於四無量、四無色定生貪愛。",
        "translation": "Don't give rise to craving in the four meditations, and don't give rise to craving in the four immeasurable and four formless concentrations.",
        "source": "T07n0220_445:0245a21_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a22_20"
    },
    {
        "source_sentence": "四靜慮、四無量、四無色定非可貪愛。",
        "translation": "The four meditations, four immeasurable and four formless concentrations are not desirable.",
        "source": "T07n0220_445:0245a22_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a23_22"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a23_23"
    },
    {
        "source_sentence": "勿於八解脫生貪愛，勿於八勝處、九次第定、十遍處生貪愛。",
        "translation": "Don't give rise to craving for the eight liberations, and don't give rise to craving for the eight abodes of excellence, the nine graduated concentrations, or the ten universal abodes.",
        "source": "T07n0220_445:0245a24_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a25_1"
    },
    {
        "source_sentence": "八解脫乃至十遍處非可貪愛。",
        "translation": "The eight liberations up to the ten universal abodes are not desirable.",
        "source": "T07n0220_445:0245a25_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a26_3"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a26_4"
    },
    {
        "source_sentence": "勿於四念住生貪愛，勿於四正斷、四神足、五根、五力、七等覺支、八聖道支生貪愛。",
        "translation": "Don't give rise to craving for the four abodes of mindfulness, and don't give rise to craving for the fourfold correct elimination, the four miraculous abilities, the five faculties, the five powers, the seven factors of virtual enlightenment, or the eight noble factors of the path.",
        "source": "T07n0220_445:0245a26_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245a28_6"
    },
    {
        "source_sentence": "四念住乃至八聖道支非可貪愛。",
        "translation": "The four abodes of mindfulness up to the eightfold noble path are not desirable.",
        "source": "T07n0220_445:0245a29_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245a29_1"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245a29_2"
    },
    {
        "source_sentence": "勿於空解脫門生貪愛，勿於無相、無願解脫門生貪愛。",
        "translation": "Don't give rise to craving for the liberation gate of emptiness, and don't give rise to craving for the liberation gate of signlessness and wishlessness.",
        "source": "T07n0220_445:0245b01_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b02_4"
    },
    {
        "source_sentence": "空、無相、無願解脫門非可貪愛。",
        "translation": "The liberation gate of emptiness, signlessness, and wishlessness is not desirable.",
        "source": "T07n0220_445:0245b02_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b03_6"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b03_7"
    },
    {
        "source_sentence": "勿於五眼生貪愛，勿於六神通生貪愛。",
        "translation": "Don't give rise to craving for the five eyes and don't give rise to craving for the six supernormal powers.",
        "source": "T07n0220_445:0245b04_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b05_9"
    },
    {
        "source_sentence": "五眼、六神通非可貪愛。",
        "translation": "The five eyes and six supernormal powers are not desirable.",
        "source": "T07n0220_445:0245b05_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b05_11"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b06_12"
    },
    {
        "source_sentence": "勿於佛十力生貪愛，勿於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法生貪愛。",
        "translation": "Don't give rise to craving for the Buddha's ten powers, and don't give rise to craving for the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great pity, great joy, great equanimity, or the 18 distinctive qualities of the Buddha.",
        "source": "T07n0220_445:0245b06_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b08_14"
    },
    {
        "source_sentence": "佛十力乃至十八佛不共法非可貪愛。",
        "translation": "The Buddha's ten powers up to the 18 uncommon dharmas of the buddhas are not desirable.",
        "source": "T07n0220_445:0245b08_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b09_16"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b10_0"
    },
    {
        "source_sentence": "勿於三十二大士相生貪愛，勿於八十隨好生貪愛。",
        "translation": "Don't give rise to craving for the thirty-two marks of greatness, and don't give rise to craving for the eighty secondary signs.",
        "source": "T07n0220_445:0245b10_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b11_2"
    },
    {
        "source_sentence": "三十二大士相、八十隨好非可貪愛。",
        "translation": "The thirty-two marks of a great person and the eighty secondary signs are not desirable.",
        "source": "T07n0220_445:0245b11_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b12_4"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b12_5"
    },
    {
        "source_sentence": "勿於無忘失法生貪愛，勿於恒住捨性生貪愛。",
        "translation": "Don't give rise to craving for the Dharma of no forgetfulness, and don't give rise to craving for the nature of constantly abiding equanimity.",
        "source": "T07n0220_445:0245b13_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b14_7"
    },
    {
        "source_sentence": "無忘失法、恒住捨性非可貪愛。",
        "translation": "The absence of forgetfulness and the constantly abiding nature of equanimity are not desirable.",
        "source": "T07n0220_445:0245b14_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b15_9"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b15_10"
    },
    {
        "source_sentence": "勿於陀羅尼門生貪愛，勿於三摩地門生貪愛。",
        "translation": "Don't give rise to craving for the dhāraṇī aspect, and don't give rise to craving for the samādhi aspect.",
        "source": "T07n0220_445:0245b16_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b17_12"
    },
    {
        "source_sentence": "陀羅尼門、三摩地門非可貪愛。",
        "translation": "The dhāraṇī aspect and the samādhi aspect are not desirable.",
        "source": "T07n0220_445:0245b17_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b18_14"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b18_15"
    },
    {
        "source_sentence": "勿於一切智生貪愛，勿於道相智、一切相智生貪愛。",
        "translation": "Don't give rise to craving for all kinds of cognition, and don't give rise to craving for knowledge of the path and knowledge of all characteristics.",
        "source": "T07n0220_445:0245b18_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b19_17"
    },
    {
        "source_sentence": "一切智、道相智、一切相智非可貪愛。",
        "translation": "omniscience, knowledge of the path's characteristics, and knowledge of all characteristics are not desirable.",
        "source": "T07n0220_445:0245b20_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b21_0"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b21_1"
    },
    {
        "source_sentence": "勿於預流果生貪愛，勿於一來、不還、阿羅漢果、獨覺菩提生貪愛。",
        "translation": "Don't give rise to craving for the fruit of pre-flow, and don't give rise to craving for the once-returner, nonreturner, arhatship, or solitary realizer enlightenment.",
        "source": "T07n0220_445:0245b21_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b23_3"
    },
    {
        "source_sentence": "預流果乃至獨覺菩提非可貪愛。",
        "translation": "The fruit of pre-flow and even the solitary realizer's enlightenment are not desirable.",
        "source": "T07n0220_445:0245b23_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b24_5"
    },
    {
        "source_sentence": "以一切法自性空故。",
        "translation": "It's because the self-nature of all dharmas is empty.",
        "source": "T07n0220_445:0245b24_6"
    },
    {
        "source_sentence": "勿於一切菩薩摩訶薩行生貪愛，勿於諸佛無上正等菩提生貪愛。",
        "translation": "Don't give rise to craving for all the bodhisattva-mahāsattva practices, and don't give rise to craving for the unsurpassed perfect enlightenment of the buddhas.",
        "source": "T07n0220_445:0245b24_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0245b26_8"
    },
    {
        "source_sentence": "一切菩薩摩訶薩行、諸佛無上正等菩提非可貪愛。",
        "translation": "All bodhisattva-mahāsattva practices and the buddhas' unsurpassed perfect enlightenment are not desirable.",
        "source": "T07n0220_445:0245b26_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0245b27_10"
    },
    {
        "source_sentence": "以一切法自性空故。』」",
        "translation": "It's because all dharmas are empty of their own nature.'",
        "source": "T07n0220_445:0245b27_11"
    },
    {
        "source_sentence": "爾時，具壽善現白佛言：「世尊！",
        "translation": "It was then that Kauṣṭhila Sunetra said to the Buddha, Bhagavān!",
        "source": "T07n0220_445:0245b29_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩能為難事，於一切法自性空中，希求無上正等菩提，欲證無上正等菩提。」",
        "translation": "It's difficult for bodhisattvas, mahāsattvas, to seek unsurpassed correct perfect enlightenment in the air of the self-nature of all dharmas and want to realize unsurpassed correct perfect enlightenment.",
        "source": "T07n0220_445:0245b29_1"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_445:0245c02_2"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_445:0245c03_3"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_445:0245c03_4"
    },
    {
        "source_sentence": "諸菩薩摩訶薩能為難事，於一切法自性空中，希求無上正等菩提，欲證無上正等菩提。",
        "translation": "It's difficult for bodhisattvas, mahāsattvas, to seek unsurpassed correct perfect enlightenment and want to realize unsurpassed correct perfect enlightenment in the emptiness of the self-nature of all things.",
        "source": "T07n0220_445:0245c03_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0245c05_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩雖達一切法如幻、如夢、如響、如像、如光影、如陽焰、如變化事、如尋香城自性皆空，",
        "translation": "“Although the great enlightening beings understand all things as illusions, dreams, echoes, images, lights, flames, miraculous displays, and fragrant cities are all empty by their own nature,",
        "source": "T07n0220_445:0245c05_7"
    },
    {
        "source_sentence": "而為世間得義利故，發趣無上正等菩提；",
        "translation": "They set out for supreme perfect enlightenment in order to attain worldly meanings and benefits.",
        "source": "T07n0220_445:0245c07_8"
    },
    {
        "source_sentence": "為令世間得饒益故，發趣無上正等菩提；",
        "translation": "In order to enable the world to gain benefit, they set out for supreme perfect enlightenment.",
        "source": "T07n0220_445:0245c08_9"
    },
    {
        "source_sentence": "為令世間得安樂故，發趣無上正等菩提；",
        "translation": "In order to cause the world to attain peace and happiness they set out for supreme perfect enlightenment.",
        "source": "T07n0220_445:0245c09_10"
    },
    {
        "source_sentence": "為欲濟拔諸世間故，發趣無上正等菩提；",
        "translation": "In order to save all beings, they set out for supreme perfect enlightenment.",
        "source": "T07n0220_445:0245c10_11"
    },
    {
        "source_sentence": "為與世間作歸依故，發趣無上正等菩提；",
        "translation": "In order to be a refuge for the world, they set out for supreme perfect enlightenment.",
        "source": "T07n0220_445:0245c11_12"
    },
    {
        "source_sentence": "為與世間作舍宅故，發趣無上正等菩提；",
        "translation": "They set out for supreme perfect enlightenment in order to be their dwelling place with the world.",
        "source": "T07n0220_445:0245c12_13"
    },
    {
        "source_sentence": "欲示世間究竟道故，發趣無上正等菩提；",
        "translation": "Because they want to show the ultimate path of worldly enlightenment, they set out for supreme awakening.",
        "source": "T07n0220_445:0245c13_14"
    },
    {
        "source_sentence": "為與世間作洲渚故，發趣無上正等菩提；",
        "translation": "In order to be a continent with the world, they set out for supreme awakening.",
        "source": "T07n0220_445:0245c14_15"
    },
    {
        "source_sentence": "為與世間作日月故，發趣無上正等菩提；",
        "translation": "In order to be the sun and moon of the world, they set out for supreme perfect enlightenment.",
        "source": "T07n0220_445:0245c15_16"
    },
    {
        "source_sentence": "為與世間作燈燭故，發趣無上正等菩提；",
        "translation": "In order to be a lamp for the world, they set out for supreme perfect enlightenment.",
        "source": "T07n0220_445:0245c16_17"
    },
    {
        "source_sentence": "為與世間作導師故，發趣無上正等菩提；",
        "translation": "They set out for supreme perfect enlightenment in order to be leaders of the world.",
        "source": "T07n0220_445:0245c17_18"
    },
    {
        "source_sentence": "為與世間作將帥故，發趣無上正等菩提；",
        "translation": "In order to be leaders of the world, they set out for supreme perfect enlightenment.",
        "source": "T07n0220_445:0245c18_0"
    },
    {
        "source_sentence": "為與世間作所趣故，發趣無上正等菩提；",
        "translation": "They set out for supreme perfect enlightenment because it is the same as worldly existence.",
        "source": "T07n0220_445:0245c18_1"
    },
    {
        "source_sentence": "哀愍世間生死苦故，發趣無上正等菩提。",
        "translation": "Because they pity the suffering of birth-and-death in the world, they set out for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0245c19_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0245c20_3"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為諸世間得義利故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva aspire to unsurpassed perfect enlightenment for the sake of worldly gain?",
        "source": "T07n0220_445:0245c20_4"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0245c22_5"
    },
    {
        "source_sentence": "諸菩薩摩訶薩為欲解脫一切有情諸苦惱事，方便修行布施、淨戒、安忍、精進、靜慮、般若波羅蜜多故，",
        "translation": "“Great enlightening beings, wanting to liberate all sentient beings from the afflictions of suffering and distress, skillfully cultivate generosity, pure morality, patience, endurance, effort, meditation, and transcendent wisdom for the sake of liberation.",
        "source": "T07n0220_445:0245c22_6"
    },
    {
        "source_sentence": "發趣無上正等菩提。",
        "translation": "He gives rise to the aspiration for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0245c24_7"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0245c25_8"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為諸世間得義利故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment for the sake of the worldly attainments.",
        "source": "T07n0220_445:0245c25_9"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0245c26_10"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為令世間得饒益故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment in order to make the world attain benefit?",
        "source": "T07n0220_445:0245c26_11"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0245c28_0"
    },
    {
        "source_sentence": "諸菩薩摩訶薩為欲自住六波羅蜜多，方便勸發諸有情類，亦令安住六波羅蜜多故，",
        "translation": "“Great enlightening beings, wanting to abide by the six transcendent ways for themselves, skillfully encourage sentient beings and also cause them to abide in the six transcendent ways.",
        "source": "T07n0220_445:0245c28_1"
    },
    {
        "source_sentence": "發趣無上正等菩提。",
        "translation": "He gives rise to the aspiration for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246a01_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a01_3"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為令世間得饒益故，發趣無上正等菩提。",
        "translation": "This is the bodhisattva Mahāsattva who sets out for unsurpassed perfect enlightenment in order to make the world attain benefit.",
        "source": "T07n0220_445:0246a01_4"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246a03_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為令世間得安樂故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment in order to make the world attain peace and happiness?",
        "source": "T07n0220_445:0246a03_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a04_2"
    },
    {
        "source_sentence": "諸菩薩摩訶薩為欲自住十善業道，方便勸發諸有情類，亦令安住十善業道故，",
        "translation": "“Great enlightening beings, wanting to establish themselves in the ten paths of good action, skillfully encourage sentient beings and also cause them to establish themselves in the ten paths of good action.",
        "source": "T07n0220_445:0246a04_3"
    },
    {
        "source_sentence": "發趣無上正等菩提。",
        "translation": "He gives rise to the aspiration for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246a06_4"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a06_5"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為令世間得安樂故，發趣無上正等菩提。",
        "translation": "This is the bodhisattva Mahāsattva who sets out for unsurpassed perfect enlightenment in order to make the world attain peace and happiness.",
        "source": "T07n0220_445:0246a07_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246a08_7"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為欲濟拔諸世間故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment in order to rescue the worlds?",
        "source": "T07n0220_445:0246a08_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a09_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩見諸有情墮三惡趣，為欲濟拔令修善業，得住安隱極清涼處故，",
        "translation": "“Great enlightening beings see sentient beings fall into the three evil destinies, wanting to rescue them and causing them to cultivate good deeds, so that they may live in peace and be utterly liberated.",
        "source": "T07n0220_445:0246a10_0"
    },
    {
        "source_sentence": "發趣無上正等菩提。",
        "translation": "He gives rise to the aspiration for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246a11_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a12_2"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為欲濟拔諸世間故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment in order to rescue the world.",
        "source": "T07n0220_445:0246a12_3"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246a13_4"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為與世間作歸依故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment because he takes refuge in the world?",
        "source": "T07n0220_445:0246a13_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a15_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲為有情說無依法，謂色無依，受、想、行、識無依，如是乃至一切智無依，",
        "translation": "“Great enlightening beings want to teach sentient beings the absence of principle, meaning that form has no basis, sensation, perception, volition, or consciousness have no basis, and so on, up to omniscience has no basis.",
        "source": "T07n0220_445:0246a15_7"
    },
    {
        "source_sentence": "道相智、一切相智無依，令諸有情聞已，解脫一切生老病死及愁歎苦憂惱，",
        "translation": "Knowledge of the path and knowledge of all characteristics have no basis, enabling sentient beings who hear them to be liberated from all birth, old age, illness, death, sorrow, pain, and vexation.",
        "source": "T07n0220_445:0246a17_8"
    },
    {
        "source_sentence": "由此因緣發趣無上正等菩提。",
        "translation": "Because of these causes and conditions, they'll give rise to unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246a19_9"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a19_10"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作歸依故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment in order to make a refuge for the world.",
        "source": "T07n0220_445:0246a20_0"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246a21_1"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為與世間作舍宅故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment because he creates a dwelling place for the world?",
        "source": "T07n0220_445:0246a21_2"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a22_3"
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲為有情作依止處，及令至得無怖無畏大涅槃宮故，發趣無上正等菩提。",
        "translation": "It's because bodhisattvas, mahāsattvas, want to serve as bases for sentient beings and cause them to attain the great palace of fearlessness and great nirvāṇa that they aspire to unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246a22_4"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a24_5"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作舍宅故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment in order to make a dwelling place for the world.",
        "source": "T07n0220_445:0246a25_6"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246a26_7"
    },
    {
        "source_sentence": "云何菩薩摩訶薩欲示世間究竟道故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva aspire to unsurpassed perfect enlightenment because he wants to show the world the ultimate path?",
        "source": "T07n0220_445:0246a26_8"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246a27_9"
    },
    {
        "source_sentence": "諸菩薩摩訶薩見諸有情不善通達道非道相，遊諸欲路，欲為方便宣說法要，",
        "translation": "“When great enlightening beings see sentient beings who don’t well understand the path and what’s not the mark of the path, traveling along the roads of desire, wanting to skillfully explain the essentials of the Teaching,",
        "source": "T07n0220_445:0246a28_0"
    },
    {
        "source_sentence": "令其了知究竟道相，發趣無上正等菩提。",
        "translation": "They cause them to understand the ultimate characteristics of the path and give rise to unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246a29_1"
    },
    {
        "source_sentence": "欲為有情說何法要？",
        "translation": "What do you want to teach the essentials of the Dharma for sentient beings?",
        "source": "T07n0220_445:0246b01_2"
    },
    {
        "source_sentence": "所謂說色究竟常無怖畏，說受、想、行、識究竟常無怖畏，如是乃至說一切智究竟常無怖畏，",
        "translation": "It's called saying that form is ultimately eternal and fearless, feeling, perception, volition, and consciousness are ultimately eternal and fearless, and so forth, up to saying that omniscience is ultimately eternal and fearless.",
        "source": "T07n0220_445:0246b02_3"
    },
    {
        "source_sentence": "說道相智、一切相智究竟常無怖畏。",
        "translation": "He teaches that knowledge of the path's characteristics and knowledge of all characteristics are ultimately permanent and fearless.",
        "source": "T07n0220_445:0246b04_4"
    },
    {
        "source_sentence": "說色究竟即非色，說受、想、行、識究竟即非受、想、行、識，如是乃至說一切智究竟即非一切智，",
        "translation": "It is said that the end of matter exactly is what is formless. It is said that the end of feeling, perception, volition and consciousness exactly is what is not feeling, perception, volition and consciousness. In this way, up to it is said that the end of omniscience exactly is what is not omniscience.",
        "source": "T07n0220_445:0246b05_5"
    },
    {
        "source_sentence": "說道相智、一切相智究竟即非道相智、一切相智。",
        "translation": "It's said that the cognition of the path and the cognition of all characteristics are ultimately not the cognition of the path and the cognition of all characteristics.",
        "source": "T07n0220_445:0246b07_6"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246b08_7"
    },
    {
        "source_sentence": "如此諸法究竟相，一切法相亦如是。」",
        "translation": "Such are the ultimate characteristics of dharmas, and so are all the characteristics of dharmas.",
        "source": "T07n0220_445:0246b08_8"
    },
    {
        "source_sentence": "具壽善現白言：「世尊！",
        "translation": "Guoshou Shancheng said, Bhagavān!",
        "source": "T07n0220_445:0246b09_9"
    },
    {
        "source_sentence": "若一切法相如究竟相者，云何菩薩摩訶薩於一切法應現等覺？",
        "translation": "If all the characteristics of all dharmas are as ultimate characteristics, how should bodhisattvas, mahāsattvas, and buddhas be equally enlightened in all dharmas?",
        "source": "T07n0220_445:0246b09_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T07n0220_445:0246b11_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T07n0220_445:0246b11_12"
    },
    {
        "source_sentence": "非色究竟中有如是分別，謂此是色；",
        "translation": "In the ultimate state that is not form, there is such a discrimination:",
        "source": "T07n0220_445:0246b11_13"
    },
    {
        "source_sentence": "亦非受、想、行、識究竟中有如是分別，謂此是受、想、行、識。",
        "translation": "Nor is there such a discrimination in the ultimate state of feeling, perception, volition, and consciousness, meaning that these are feeling, perception, volition, and consciousness.",
        "source": "T07n0220_445:0246b12_14"
    },
    {
        "source_sentence": "如是乃至非一切智究竟中有如是分別，謂此是一切智；",
        "translation": "In the ultimate state of omniscience, there is such-and-such discrimination: this is omniscience.",
        "source": "T07n0220_445:0246b13_15"
    },
    {
        "source_sentence": "亦非道相智、一切相智究竟中有如是分別，謂此是道相智、一切相智。」",
        "translation": "Nor is there such a discrimination in the ultimate between knowledge of the path and knowledge of all characteristics, meaning that this is knowledge of the path and knowledge of all characteristics.",
        "source": "T07n0220_445:0246b15_16"
    },
    {
        "source_sentence": "佛告善現：「如是！",
        "translation": "The Buddha told Shancheng, So it is!",
        "source": "T07n0220_445:0246b16_17"
    },
    {
        "source_sentence": "如是！",
        "translation": "So it is!",
        "source": "T07n0220_445:0246b17_18"
    },
    {
        "source_sentence": "如汝所說。",
        "translation": "It's as you say.",
        "source": "T07n0220_445:0246b17_19"
    },
    {
        "source_sentence": "色究竟中無如是分別，謂此是色；",
        "translation": "In the ultimate state of form, there is no such discrimination:",
        "source": "T07n0220_445:0246b17_20"
    },
    {
        "source_sentence": "受、想、行、識究竟中亦無如是分別，謂此是受、想、行、識。",
        "translation": "Nor is there such a discrimination in the ultimate state of feeling, perception, volition, and consciousness, meaning that these are feeling, perception, volition, and consciousness.",
        "source": "T07n0220_445:0246b18_21"
    },
    {
        "source_sentence": "如是乃至一切智究竟中無如是分別，謂此是一切智；",
        "translation": "Thus, up to the ultimate state of omniscience, there is no such discrimination: this is omniscience.",
        "source": "T07n0220_445:0246b19_22"
    },
    {
        "source_sentence": "道相智、一切相智究竟中無如是分別，謂此是道相智、一切相智，以一切法本性空故。",
        "translation": "In the ultimate state of knowledge of the path and knowledge of all characteristics, there is no such discrimination: this is knowledge of the path and knowledge of all characteristics because all factors are inherently empty.",
        "source": "T07n0220_445:0246b20_23"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246b22_24"
    },
    {
        "source_sentence": "是為菩薩摩訶薩最極難事，謂雖觀一切法皆寂滅相甚深微妙而心不沈沒，",
        "translation": "This is the supremely difficult thing for great enlightening beings, which is to say that even though they contemplate all things as tranquil and subtle, their minds don’t sink into them.",
        "source": "T07n0220_445:0246b22_25"
    },
    {
        "source_sentence": "作是念言：『我於是法現等覺已，證得無上正等菩提，為諸有情宣說開示如是寂滅深妙之法。』",
        "translation": "They think, 'After I've realized unsurpassed perfect enlightenment in this way, I'll explain to sentient beings the profound and marvelous teaching of such tranquility and cessation.'",
        "source": "T07n0220_445:0246b24_26"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246b26_27"
    },
    {
        "source_sentence": "是為菩薩摩訶薩欲示世間究竟道故，發趣無上正等菩提。",
        "translation": "This is because the bodhisattva Mahāsattva wants to show the ultimate path in the world and sets out for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246b26_28"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246b28_29"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為與世間作洲渚故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment because he creates a continent with the world?",
        "source": "T07n0220_445:0246b28_30"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246b29_31"
    },
    {
        "source_sentence": "譬如大小海河池中，高地可居周迴水斷說為洲渚。",
        "translation": "It's like a high ground that can be surrounded by water in large and small oceans, rivers, and ponds, and when the water is cut off, it's called a island.",
        "source": "T07n0220_445:0246b29_32"
    },
    {
        "source_sentence": "如是，善現！",
        "translation": "So it is, Sunetra!",
        "source": "T07n0220_445:0246c01_33"
    },
    {
        "source_sentence": "色前後際斷，受、想、行、識前後際斷，如是乃至一切智前後際斷，道相智、一切相智前後際斷，",
        "translation": "Form is to be abandoned before and after, feeling, conceptual identification, conditioning factors and consciousness are to be abandoned before and after. In this way, up to all knowledge is to be abandoned before and after; knowledge of the path and knowledge of all characteristic marks are to be abandoned before and after.",
        "source": "T07n0220_445:0246c02_34"
    },
    {
        "source_sentence": "由此前際後際斷故，一切法斷。",
        "translation": "All dharmas are abandoned because they have been abandoned before and after.",
        "source": "T07n0220_445:0246c04_35"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246c04_36"
    },
    {
        "source_sentence": "此一切法前後際斷，即是寂滅，即是微妙，即是如實，謂空無所得道斷愛盡無餘，",
        "translation": "The cessation of all these dharmas at the former and latter ends is nirvana, that is to say, they are subtle. That is to say, they are as they really are: the ungraspable path of emptiness abandoning craving without remainder.",
        "source": "T07n0220_445:0246c05_0"
    },
    {
        "source_sentence": "雜染永滅究竟涅槃。",
        "translation": "The defilements are permanently extinguished and ultimately liberated.",
        "source": "T07n0220_445:0246c06_1"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246c07_2"
    },
    {
        "source_sentence": "諸菩薩摩訶薩求證無上正等菩提，欲為有情宣說開示如是寂滅甚深微妙如實之法。",
        "translation": "The bodhisattvas, mahāsattvas, seeking to realize unsurpassed perfect enlightenment, want to teach sentient beings the profound and subtle true teaching of such cessation.",
        "source": "T07n0220_445:0246c07_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246c09_4"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作洲渚故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment in order to create a continent with the world.",
        "source": "T07n0220_445:0246c09_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246c10_6"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為與世間作日月燈燭故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment because he makes a candle of the sun and moon for the sake of the world?",
        "source": "T07n0220_445:0246c11_0"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246c12_1"
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲為有情宣說六波羅蜜多，及四依攝事相應經典真實義趣，",
        "translation": "“Great enlightening beings want to teach sentient beings the true meaning of the six transcendent ways and scriptures associated with the four supports,",
        "source": "T07n0220_445:0246c12_2"
    },
    {
        "source_sentence": "方便教導令勤修學，破一切種無明黑闇，發趣無上正等菩提。",
        "translation": "He skillfully teaches and diligently cultivates, breaks through the darkness of all kinds of ignorance, and sets out for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246c14_3"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246c15_4"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作日月燈燭故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment in order to make a candle of the sun and moon as lamps for the world.",
        "source": "T07n0220_445:0246c15_5"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246c17_6"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為與世間作導師、將帥故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment because he serves as a guide and general to the world?",
        "source": "T07n0220_445:0246c17_7"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0246c18_8"
    },
    {
        "source_sentence": "諸菩薩摩訶薩欲令趣向邪道有情離行四種不應行處，為說一道令歸正故，",
        "translation": "“Great enlightening beings want to cause sentient beings who are on the wrong path to turn away from the four kinds of unwholesome courses of action, so they teach one path and lead them rightly.",
        "source": "T07n0220_445:0246c19_0"
    },
    {
        "source_sentence": "為雜染者得清淨故，為愁惱者得歡悅故，為憂苦者得喜樂故，為非理有情證如理法故，",
        "translation": "Because those who are defiled attain purity, those who are disheartened attain joy, those who are grieved attain happiness, and those who are overcome with sorrow attain joy because they realize the truth for unreasonable sentient beings.",
        "source": "T07n0220_445:0246c20_1"
    },
    {
        "source_sentence": "為流轉有情得般涅槃故，發趣無上正等菩提。",
        "translation": "In order to enable sentient beings in the stream to attain parinirvāṇa, they set out for unsurpassed perfect enlightenment.",
        "source": "T07n0220_445:0246c22_2"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0246c23_3"
    },
    {
        "source_sentence": "諸菩薩摩訶薩發趣無上正等菩提，欲為有情宣說開示色無生無滅、無染無淨，",
        "translation": "“Great enlightening beings develop the aspiration for unexcelled perfect enlightenment, wanting to teach sentient beings that form is without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0246c23_4"
    },
    {
        "source_sentence": "受、想、行、識無生無滅、無染無淨；",
        "translation": "Feeling, perception, volition, and consciousness are neither arising nor ceasing; they are neither defiled nor pure.",
        "source": "T07n0220_445:0246c25_5"
    },
    {
        "source_sentence": "眼處無生無滅、無染無淨，耳、鼻、舌、身、意處無生無滅、無染無淨；",
        "translation": "The sense-field of the eye is without arising or ceasing, without defilement or purity; the sense-fields of ear, nose, tongue, body, and mind are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0246c26_6"
    },
    {
        "source_sentence": "色處無生無滅、無染無淨，聲、香、味、觸、法處無生無滅、無染無淨；",
        "translation": "The sphere of form is without arising or ceasing, without defilement or purity; the spheres of sound, odor, taste, touch, and dharma are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0246c27_7"
    },
    {
        "source_sentence": "眼界無生無滅、無染無淨，耳、鼻、舌、身、意界無生無滅、無染無淨；",
        "translation": "The element eye is without arising or ceasing, without defilement or purity; the elements ear, nose, tongue, body, and mind are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0246c29_8"
    },
    {
        "source_sentence": "色界無生無滅、無染無淨，聲、香、味、觸、法界無生無滅、無染無淨；",
        "translation": "The realm of form is without arising or ceasing, without defilement or purity; sound, odor, taste, touch, and the realm of reality are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247a01_9"
    },
    {
        "source_sentence": "眼識界無生無滅、無染無淨，耳、鼻、舌、身、意識界無生無滅、無染無淨；",
        "translation": "The element consciousness of the eye is without arising or ceasing, without defilement or purity. The elements of the ear, nose, tongue, body, and mind are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247a03_10"
    },
    {
        "source_sentence": "眼觸無生無滅、無染無淨，耳、鼻、舌、身、意觸無生無滅、無染無淨；",
        "translation": "The sense eye contact is without arising or ceasing, without defilement or purity; the sense ear, nose, tongue, body, and mind contact are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247a04_11"
    },
    {
        "source_sentence": "眼觸為緣所生諸受無生無滅、無染無淨，耳、鼻、舌、身、意觸為緣所生諸受無生無滅、無染無淨；",
        "translation": "The sensations that arise from visual contact as supporting object are without arising, without perishing, without defilement and without purity. The sensations that arise from ear, nose, tongue, body, and mind contact as supporting object are without arising, without perishing, without defilement and without purity.",
        "source": "T07n0220_445:0247a06_12"
    },
    {
        "source_sentence": "布施波羅蜜多無生無滅、無染無淨，淨戒、安忍、精進、靜慮、般若波羅蜜多無生無滅、無染無淨；",
        "translation": "The perfection of giving is without arising or ceasing, without defilement or purity; the perfections of morality, patience, effort, meditation, and wisdom are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247a08_13"
    },
    {
        "source_sentence": "內空無生無滅、無染無淨，外空、內外空、空空、大空、勝義空、有為空、無為空、畢竟空、無際空、散無散空、本性空、自共相空、一切法空、不可得空、無性空、自性空、無性自性空無生無滅、無染無淨；",
        "translation": "Emptiness of internal emptiness is without arising or ceasing, without defilement or purity; emptiness of the outer, emptiness of both inner and outer, emptiness of emptiness, emptiness of emptiness, great emptiness, ultimate emptiness, ultimate emptiness, emptiness without limit, emptiness dispersed",
        "source": "T07n0220_445:0247a10_14"
    },
    {
        "source_sentence": "真如無生無滅、無染無淨，法界、法性、不虛妄性、不變異性、平等性、離生性、法定、法住、實際、虛空界、不思議界無生無滅、無染無淨；",
        "translation": "The realm of reality, the essence of reality, the nature of reality, non-falsity, unchanging and dissimilarness, equanimity, freedom from birth, lawfulness, the abiding of things, reality, space, inconceivable realm, neither arising nor perishing, undefiled nor pure.",
        "source": "T07n0220_445:0247a14_15"
    },
    {
        "source_sentence": "苦聖諦無生無滅、無染無淨，集、滅、道聖諦無生無滅、無染無淨；",
        "translation": "The noble truth of suffering is neither arising nor ceasing, and neither defiled nor pure; the noble truths of origination, cessation, and the path are neither arising nor ceasing, and neither defiled nor pure.",
        "source": "T07n0220_445:0247a17_16"
    },
    {
        "source_sentence": "四靜慮無生無滅、無染無淨，四無量、四無色定無生無滅、無染無淨；",
        "translation": "The fourfold meditative absorption is without arising or ceasing, without defilement or purity. The four immeasurable and four formless concentrations are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247a18_17"
    },
    {
        "source_sentence": "八解脫無生無滅、無染無淨，八勝處、九次第定、十遍處無生無滅、無染無淨；",
        "translation": "The eight liberations are without arising or ceasing, without defilement or purity; the eight spheres of mastery, the nine graduated concentrations, and the ten universals are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247a20_0"
    },
    {
        "source_sentence": "四念住無生無滅、無染無淨，四正斷、四神足、五根、五力、七等覺支、八聖道支無生無滅、無染無淨；",
        "translation": "The fourth is the abode of mindfulness without arising or ceasing, without defilement or purity; the fourth is right abandoning, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, the eight noble factors of the path, are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247a21_1"
    },
    {
        "source_sentence": "空解脫門無生無滅、無染無淨，無相、無願解脫門無生無滅、無染無淨；",
        "translation": "The liberation gate of emptiness is without origination, without destruction, without defilement or purity; the liberation gate of signlessness and wishlessness is without origination, without destruction, without defilement or purity.",
        "source": "T07n0220_445:0247a23_2"
    },
    {
        "source_sentence": "淨觀地無生無滅、無染無淨，種性地、第八地、具見地、薄地、離欲地、已辦地、獨覺地、菩薩地、如來地無生無滅、無染無淨；",
        "translation": "The stage of pure contemplation is without arising or ceasing, without defilement or purity: the stage of lineage, the eighth stage, the stage of full vision, the stage of thinness, the stage of nonattachment, the stage of preparation, the stage of self-enlightenment, the stage of enlightening beings, the stage of enlightening beings, the stage",
        "source": "T07n0220_445:0247a25_3"
    },
    {
        "source_sentence": "極喜地無生無滅、無染無淨，離垢地、發光地、焰慧地、極難勝地、現前地、遠行地、不動地、善慧地、法雲地無生無滅、無染無淨；",
        "translation": "In the stage of ultimate bliss there is neither arising nor ceasing, neither defiled nor pure: in the stage of freedom from defilement, the stage of emission of light, the stage of knowledge with blazing fire, the stage of extreme difficulty overcoming, the stage of direct presence, the stage of remote movement, the stage of unshakableness, the stage of",
        "source": "T07n0220_445:0247a28_4"
    },
    {
        "source_sentence": "五眼無生無滅、無染無淨，六神通無生無滅、無染無淨；",
        "translation": "The five eyes are without arising or ceasing and without defilement or purity; the six supernormal powers are without arising or ceasing and without defilement or purity.",
        "source": "T07n0220_445:0247b01_5"
    },
    {
        "source_sentence": "預流果無生無滅、無染無淨，一來、不還、阿羅漢果、獨覺菩提無生無滅、無染無淨；",
        "translation": "The fruit of stream-entry is without arising or ceasing, without defilement or purity; the fruit of the once-returner, the one who does not return, the fruit of the arhat, and the enlightenment of the pratyekabuddha are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247b03_0"
    },
    {
        "source_sentence": "如來十力無生無滅、無染無淨，四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法無生無滅、無染無淨；",
        "translation": "The ten powers of Buddha are neither produced nor perishing, undefiled nor pure; the four fearlessnesses, the four unhindered understandings, great kindness, great compassion, great joy, great relinquishment, and the unique qualities of the eighteen buddhas are neither produced nor perishing, undefiled nor pure.",
        "source": "T07n0220_445:0247b04_1"
    },
    {
        "source_sentence": "三十二大士相無生無滅、無染無淨，八十隨好無生無滅、無染無淨；",
        "translation": "The thirty-two marks of greatness are neither produced nor extinguished, undefiled nor pure; the eighty secondary signs are neither produced nor extinguished, undefiled nor pure.",
        "source": "T07n0220_445:0247b07_2"
    },
    {
        "source_sentence": "無忘失法無生無滅、無染無淨，恒住捨性無生無滅、無染無淨；",
        "translation": "The state of nonforgetfulness has no arising or ceasing, and is neither defiled nor pure. They always abide in the equanimity of equanimity having no arising or ceasing, and are neither defiled nor pure.",
        "source": "T07n0220_445:0247b08_3"
    },
    {
        "source_sentence": "一切陀羅尼門無生無滅、無染無淨，一切三摩地門無生無滅、無染無淨；",
        "translation": "All the aspects of dhāraṇī are without arising or ceasing, without defilement or purity; all the aspects of samādhi are without arising or ceasing, without defilement or purity.",
        "source": "T07n0220_445:0247b10_4"
    },
    {
        "source_sentence": "一切智無生無滅、無染無淨，道相智、一切相智無生無滅、無染無淨。",
        "translation": "omniscience is without arising and ceasing, without defilement and without purity, knowledge of the path and knowledge of all characteristics are without arising and ceasing, without defilement and without purity.",
        "source": "T07n0220_445:0247b11_5"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0247b13_6"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作導師、將帥故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment because he serves as a guide and general to the world.",
        "source": "T07n0220_445:0247b13_7"
    },
    {
        "source_sentence": "「善現！",
        "translation": "“O Sunetra!",
        "source": "T07n0220_445:0247b14_8"
    },
    {
        "source_sentence": "云何菩薩摩訶薩為與世間作所趣故，發趣無上正等菩提？",
        "translation": "How does the bodhisattva Mahāsattva set out for unsurpassed perfect enlightenment because he creates a destination for the world?",
        "source": "T07n0220_445:0247b15_9"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0247b16_10"
    },
    {
        "source_sentence": "諸菩薩摩訶薩希求無上正等菩提，修諸菩薩摩訶薩行，欲以四攝事攝一切有情，",
        "translation": "“Great enlightening beings, longing for unexcelled perfect enlightenment, cultivate the practices of enlightening beings, wanting to gather all sentient beings by means of four methods of salvation:",
        "source": "T07n0220_445:0247b16_11"
    },
    {
        "source_sentence": "所謂布施、愛語、利行、同事。",
        "translation": "It's called generosity, loving words, beneficial actions, and coworkers.",
        "source": "T07n0220_445:0247b18_12"
    },
    {
        "source_sentence": "欲為有情宣說開示色以虛空為所趣，受、想、行、識亦以虛空為所趣，",
        "translation": "Desiring to expound and reveal form for sentient beings, they take space as their destination, and feeling, perception, volition, and consciousness also take space as their destination.",
        "source": "T07n0220_445:0247b19_0"
    },
    {
        "source_sentence": "如是乃至一切智以虛空為所趣，道相智、一切相智亦以虛空為所趣。",
        "translation": "Thus, even all cognition has space as its destination, and so do knowledge of the path and knowledge of all characteristics have space as their destination.",
        "source": "T07n0220_445:0247b20_1"
    },
    {
        "source_sentence": "欲為有情宣說開示未來色趣空故無所從來，過去色趣空故無所至去，現在色趣空故亦無所住；",
        "translation": "Because they want to expound and show for sentient beings the emptiness of future realms of form, there is nowhere from which they come; because past realms of form are empty, there is no going or coming; because present realms of form are empty, there is no dwelling.",
        "source": "T07n0220_445:0247b22_2"
    },
    {
        "source_sentence": "未來受、想、行、識趣空故無所從來，過去受、想、行、識趣空故無所至去，",
        "translation": "Because the destinies of feeling, perception, volition, and consciousness in the future are empty, there's nowhere to come from; because the destinies of feeling, perception, volition, and consciousness in the past are empty, there's no place to go or leave.",
        "source": "T07n0220_445:0247b24_3"
    },
    {
        "source_sentence": "現在受、想、行、識趣空故亦無所住。",
        "translation": "Because the present state of feeling, perception, volition, and consciousness are empty, there's nothing to abide in.",
        "source": "T07n0220_445:0247b25_4"
    },
    {
        "source_sentence": "如是乃至未來一切智趣空故無所從來，過去一切智趣空故無所至去，現在一切智趣空故亦無所住；",
        "translation": "In the same way, because of the emptiness of all paths of omniscience in the future there is nowhere to come from; because of the emptiness of all paths of omniscience in the past there is no place to go; because of the emptiness of all paths of omniscience in the present there is also no abode.",
        "source": "T07n0220_445:0247b26_5"
    },
    {
        "source_sentence": "未來道相智、一切相智趣空故無所從來，過去道相智、一切相智趣空故無所至去，",
        "translation": "Because knowledge of the path and knowledge of all characteristics in the future have emptiness as their destination, there's nowhere to come from; because knowledge of the path and knowledge of all characteristics in the past have emptiness as their destination, there's no place to go or leave.",
        "source": "T07n0220_445:0247b29_0"
    },
    {
        "source_sentence": "現在道相智、一切相智趣空故亦無所住。",
        "translation": "In the present, there's cognition of the path and omniscience of all characteristics that aim emptiness, so there's nothing to abide in.",
        "source": "T07n0220_445:0247c01_1"
    },
    {
        "source_sentence": "欲為有情宣說開示色非趣非不趣。",
        "translation": "He wants to teach for sentient beings that form is neither an aim nor a non-aim.",
        "source": "T07n0220_445:0247c02_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0247c03_3"
    },
    {
        "source_sentence": "以色性空，空中無趣無不趣故。",
        "translation": "It's because the nature of form is empty, and there's no destination or non- destination in space.",
        "source": "T07n0220_445:0247c03_4"
    },
    {
        "source_sentence": "受、想、行、識亦非趣非不趣。",
        "translation": "Feeling, perception, volition, and consciousness are also neither an object nor a non-object.",
        "source": "T07n0220_445:0247c04_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0247c05_6"
    },
    {
        "source_sentence": "以受、想、行、識性空，空中無趣無不趣故。",
        "translation": "It's because the nature of feeling, perception, volition, and consciousness are empty, and there's no destination or non- destination in space.",
        "source": "T07n0220_445:0247c05_7"
    },
    {
        "source_sentence": "如是乃至一切智非趣非不趣。",
        "translation": "Thus, it goes so far as to say that all cognition is neither an aim nor a non-aim.",
        "source": "T07n0220_445:0247c06_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0247c06_9"
    },
    {
        "source_sentence": "以一切智性空，空中無趣無不趣故。",
        "translation": "It's because the nature of omniscience is empty, and there's no destination or non- destination in space.",
        "source": "T07n0220_445:0247c07_10"
    },
    {
        "source_sentence": "道相智、一切相智亦非趣非不趣。",
        "translation": "The cognition of the path and the cognition of all characteristics are neither an aim nor a non-aim.",
        "source": "T07n0220_445:0247c07_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T07n0220_445:0247c08_12"
    },
    {
        "source_sentence": "以道相智、一切相智性空，空中無趣無不趣故。",
        "translation": "Because the knowledge of the path and the knowledge of all characteristics are empty in their nature, there's no destination or non- destination in space.",
        "source": "T07n0220_445:0247c08_13"
    },
    {
        "source_sentence": "善現！",
        "translation": "O Sunetra!",
        "source": "T07n0220_445:0247c09_14"
    },
    {
        "source_sentence": "是為菩薩摩訶薩為與世間作所趣故，發趣無上正等菩提。",
        "translation": "This is why the bodhisattva Mahāsattva sets out for unsurpassed perfect enlightenment in order to work with the world.",
        "source": "T07n0220_445:0247c10_15"
    },
    {
        "source_sentence": "大般若波羅蜜多經卷第四百四十五",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 4, Volume 4",
        "source": "T07n0220_445:0247c12_0"
    }
]