[
    {
        "source_sentence": "摩訶般若波羅蜜經卷第七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 7",
        "source": "T08n0223_007:0266c02_0"
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, a translator of the Tripiṭaka of the country of Kucha in the Later Qin",
        "source": "T08n0223_007:0266c04_0"
    },
    {
        "source_sentence": "◎會宗品第二十四",
        "translation": "*Assembly of the Axiom Chapter No. 24",
        "source": "T08n0223_007:0266c05_0"
    },
    {
        "source_sentence": "爾時慧命富樓那彌多羅尼子白佛言：「世尊！",
        "translation": "It was then that Pūrṇa Maitrāyaṇīputra said to the Buddha, Bhagavān!",
        "source": "T08n0223_007:0266c06_0"
    },
    {
        "source_sentence": "佛使須菩提為諸菩薩摩訶薩說般若波羅蜜，今乃說摩訶衍為？」",
        "translation": "The Buddha instructed Subhūti to teach the perfection of prajñā for the bodhisattvas and mahāsattvas, but now he's teaching Mahāyāna.",
        "source": "T08n0223_007:0266c07_0"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0223_007:0266c08_1"
    },
    {
        "source_sentence": "我說摩訶衍，將無離般若波羅蜜耶？」",
        "translation": "When I teach Mahāyāna, will there be no separation from the perfection of wisdom?",
        "source": "T08n0223_007:0266c09_0"
    },
    {
        "source_sentence": "佛言：「不也，須菩提！",
        "translation": "The Buddha said, No, Subhūti!",
        "source": "T08n0223_007:0266c09_1"
    },
    {
        "source_sentence": "汝說摩訶衍，隨般若波羅蜜不離。",
        "translation": "You say that Mahāyāna follows the perfection of wisdom and doesn't part from it.",
        "source": "T08n0223_007:0266c10_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0266c11_3"
    },
    {
        "source_sentence": "一切所有善法、助道法，若聲聞法、若辟支佛法、若菩薩法、若佛法，",
        "translation": "“Great enlightening beings practice all the good teachings and aids to enlightenment—the teachings of the disciples, the teachings of the solitary realizers, the teachings of the buddhas, the teachings of the bodhisattvas, and the teachings of the buddhas.",
        "source": "T08n0223_007:0266c11_4"
    },
    {
        "source_sentence": "是一切法皆攝入般若波羅蜜中。」",
        "translation": "These are all things that are included in the perfection of wisdom.",
        "source": "T08n0223_007:0266c12_5"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0223_007:0266c13_6"
    },
    {
        "source_sentence": "何等諸善法、助道法、聲聞法、辟支佛法、菩薩法、佛法，皆攝入般若波羅蜜中？」",
        "translation": "What good qualities, factors that aid in the path, śrāvaka qualities, pratyekabuddha qualities, bodhisattva qualities, and buddha qualities are all included in the perfection of wisdom?",
        "source": "T08n0223_007:0266c14_7"
    },
    {
        "source_sentence": "佛告須菩提：「所謂檀那波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜，",
        "translation": "The Buddha told Subhūti, So it's called the perfection of giving, the perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of wisdom.",
        "source": "T08n0223_007:0266c15_8"
    },
    {
        "source_sentence": "四念處、四正懃、四如意足、五根、五力、七覺分、八聖道分，空、無相、無作解脫門，",
        "translation": "The four abodes of mindfulness, the four right paths, the four supernormal powers, the five faculties, the five powers, the seven factors of enlightenment, the eight noble factors of the path, the liberation gate of emptiness, signlessness, and non-manifesting.",
        "source": "T08n0223_007:0266c18_9"
    },
    {
        "source_sentence": "佛十力、四無所畏、四無閡智、大慈大悲、十八不共法，無錯謬相常捨行。",
        "translation": "The Buddha's ten powers, four fearlessnesses, four unhindered cognitions, great kindness and compassion, and 18 distinctive qualities have no mistaken characteristics that always abandon practice.",
        "source": "T08n0223_007:0266c19_10"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0266c21_11"
    },
    {
        "source_sentence": "是諸餘善法、助道法，若聲聞法、若辟支佛法、若菩薩法、若佛法，皆攝入般若波羅蜜中。",
        "translation": "These other good qualities and factors that aid in the path, whether śrāvaka qualities, pratyekabuddha qualities, bodhisattva qualities, or buddha qualities, are all included in the perfection of wisdom.",
        "source": "T08n0223_007:0266c21_12"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0266c23_13"
    },
    {
        "source_sentence": "若菩薩摩訶薩摩訶衍，若般若波羅蜜、禪那波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀那波羅蜜，",
        "translation": "Suppose a bodhisattva Mahāsattva Mahāyāna, suppose the perfection of wisdom, the perfection of meditation, the perfection of vīrya, the perfection of caṇḍi, the perfection of śīla, and the perfection of sandalwood.",
        "source": "T08n0223_007:0266c23_14"
    },
    {
        "source_sentence": "若色受想行識，眼色眼識、眼觸眼觸因緣生諸受，乃至意法意識、意觸意觸因緣生諸受，",
        "translation": "If form, feeling, perception, ideation, volition, and consciousness arise from the causes and conditions of eye form, eye consciousness, eye contact, eye contact, eye contact causes and conditions to give rise to sensations, up to mental factors, mental consciousness, mental contact, mental contact, and mental contact causes and conditions to give rise to sensations,",
        "source": "T08n0223_007:0266c26_15"
    },
    {
        "source_sentence": "地種乃至識種，四念處乃至八聖道分，空、無相、無作解脫門，及諸善法，",
        "translation": "The seeds of earth up to the seeds of consciousness, the four abodes of mindfulness up to the parts of the eightfold noble path, the liberation through emptiness, signlessness, and non-manifesting, and all good qualities.",
        "source": "T08n0223_007:0266c28_16"
    },
    {
        "source_sentence": "若有漏若無漏、若有為若無為，若苦諦、集諦、滅諦、道諦，若欲界、若色界、若無色界，",
        "translation": "If there are contaminants, if there are pure, if there are conditioned, and if there are unconditioned, if there is the truth of suffering, the truth of accumulation, the truth of cessation, and the truth of the path, if they are in the desire realm, form realm, or formless realm,",
        "source": "T08n0223_007:0267a01_17"
    },
    {
        "source_sentence": "若內空乃至無法有法空，諸三昧門、諸陀羅尼門，佛十力乃至十八不共法，",
        "translation": "If there's internal emptiness or even the emptiness of dharmas that don't exist, the samādhi approaches and dhāraṇī approaches, the Buddha's ten powers up to 18 unique qualities,",
        "source": "T08n0223_007:0267a02_18"
    },
    {
        "source_sentence": "若佛法、佛法性、如、實際、不可思議性、涅槃，是一切諸法皆不合不散、無色無形無對無閡無等，",
        "translation": "If the Buddha-dharma, buddha-dharma-nature, thusness, reality, inconceivability, and nirvana are all dharmas that don’t fit together or disperse, formless, formless, formless, opposed, unobstructed, and unequal.",
        "source": "T08n0223_007:0267a04_19"
    },
    {
        "source_sentence": "一相所謂無相。",
        "translation": "One characteristic is called marklessness.",
        "source": "T08n0223_007:0267a06_20"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267a07_21"
    },
    {
        "source_sentence": "以是因緣故，汝所說摩訶衍隨順般若波羅蜜。",
        "translation": "Because of these causes and conditions, your explanation of Mahāyāna follows the perfection of prajñāpāramitā.",
        "source": "T08n0223_007:0267a07_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0267a08_23"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267a08_24"
    },
    {
        "source_sentence": "摩訶衍不異般若波羅蜜，般若波羅蜜不異摩訶衍，般若波羅蜜、摩訶衍無二無別。",
        "translation": "Mahāyāna doesn't differ from the perfection of prajñā, the perfection of prajñā doesn't differ from Mahāyāna, and the perfections of prajñā and mahāyāna are not two or different.",
        "source": "T08n0223_007:0267a08_25"
    },
    {
        "source_sentence": "檀那波羅蜜不異摩訶衍，摩訶衍不異檀那波羅蜜，檀那波羅蜜、摩訶衍無二無別。",
        "translation": "The perfection of giving doesn't differ from the Mahāyāna, and the Mahāyāna doesn't differ from the perfection of giving, and the perfection of giving and the Mahāyāna are not two or different.",
        "source": "T08n0223_007:0267a11_0"
    },
    {
        "source_sentence": "乃至禪那波羅蜜亦如是。",
        "translation": "It's likewise with the perfection of meditation.",
        "source": "T08n0223_007:0267a13_1"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267a13_2"
    },
    {
        "source_sentence": "四念處不異摩訶衍，摩訶衍不異四念處，四念處、摩訶衍無二無別。",
        "translation": "The four abodes of mindfulness don't differ from Mahāyāna, and Mahāyāna doesn't differ from the four abodes of mindfulness, and the four abodes of mindfulness and Mahāyāna are not two or different.",
        "source": "T08n0223_007:0267a13_3"
    },
    {
        "source_sentence": "乃至十八不共法不異摩訶衍，摩訶衍不異十八不共法，十八不共法、摩訶衍無二無別。",
        "translation": "The 18 distinctive qualities don't differ from Mahāyāna, the Mahāyāna doesn't differ from the 18 distinctive qualities, and the 18 distinctive qualities and Mahāyāna are not two or different.",
        "source": "T08n0223_007:0267a15_4"
    },
    {
        "source_sentence": "以是因緣故，須菩提！",
        "translation": "Because of these causes and conditions, Subhūti!",
        "source": "T08n0223_007:0267a17_5"
    },
    {
        "source_sentence": "汝說摩訶衍即是說般若波羅蜜。」",
        "translation": "You say that Mahāyāna is the teaching of the perfection of wisdom.",
        "source": "T08n0223_007:0267a18_6"
    },
    {
        "source_sentence": "◎摩訶般若波羅蜜經十無品第二十五慧命須菩提白佛言：「世尊！",
        "translation": "*Mahāprajñāpāramitā-sūtra, the twenty-fifth chapter of the ten unsurpassables of the twenty-fifth chapter of the Sutra of Wisdom and Life, said Subhūti to the Buddha, Bhagavān!",
        "source": "T08n0223_007:0267a18_7"
    },
    {
        "source_sentence": "菩薩摩訶薩前際不可得，後際不可得，中際不可得，色無邊故，當知菩薩摩訶薩亦無邊。",
        "translation": "Because the bodhisattva-mahāsattva's prior end is unobtainable, the subsequent end is unobtainable, and the middle end is unobtainable, and because form has no limit, you should know that the bodhisattva-mahāsattva also has no limit.",
        "source": "T08n0223_007:0267a20_8"
    },
    {
        "source_sentence": "受想行識無邊故，當知菩薩摩訶薩亦無邊。",
        "translation": "Because feeling, perception, volition, and consciousness are limitless, you should know that the bodhisattva Mahāsattva is also limitless.",
        "source": "T08n0223_007:0267a22_9"
    },
    {
        "source_sentence": "色是菩薩摩訶薩，是亦不可得。",
        "translation": "Form is the bodhisattva-mahāsattva, which is also unobtainable.",
        "source": "T08n0223_007:0267a23_10"
    },
    {
        "source_sentence": "受想行識是菩薩摩訶薩，是亦不可得。",
        "translation": "Feeling, perception, volition, and consciousness are bodhisattva-mahāsattvas, which are also unobtainable.",
        "source": "T08n0223_007:0267a24_11"
    },
    {
        "source_sentence": "如是，世尊！",
        "translation": "So it is, Bhagavān!",
        "source": "T08n0223_007:0267a25_12"
    },
    {
        "source_sentence": "於一切種、一切處求菩薩不可得。",
        "translation": "Seeking bodhisattvas in all kinds and places is unobtainable.",
        "source": "T08n0223_007:0267a25_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0267a26_14"
    },
    {
        "source_sentence": "我當教何等菩薩摩訶薩般若波羅蜜？",
        "translation": "What kind of bodhisattva-mahāsattva prajñāpāramit will I teach?",
        "source": "T08n0223_007:0267a26_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0267a27_16"
    },
    {
        "source_sentence": "菩薩摩訶薩但有名字。",
        "translation": "The bodhisattva Mahāsattva only has names.",
        "source": "T08n0223_007:0267a27_17"
    },
    {
        "source_sentence": "如說我名字，我畢竟不生。",
        "translation": "Just as you say my name, I won't arise after all.",
        "source": "T08n0223_007:0267a28_18"
    },
    {
        "source_sentence": "如我諸法亦如是無自性。",
        "translation": "Just as self and dharmas are thus without an own-nature, so are they without an own-nature.",
        "source": "T08n0223_007:0267a28_19"
    },
    {
        "source_sentence": "何等色畢竟不生？",
        "translation": "What form doesn't arise after all?",
        "source": "T08n0223_007:0267a29_20"
    },
    {
        "source_sentence": "何等受想行識畢竟不生？",
        "translation": "What is the ultimate nonarising of feeling, perception, volition, and consciousness?",
        "source": "T08n0223_007:0267b01_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0267b01_1"
    },
    {
        "source_sentence": "是畢竟不生不名為色，是畢竟不生不名為受想行識。",
        "translation": "It's ultimately unarisen and not called form, and it's ultimately unarisen and not called feeling, perception, volition, and consciousness.",
        "source": "T08n0223_007:0267b01_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0267b03_0"
    },
    {
        "source_sentence": "若畢竟不生法，當教是般若波羅蜜耶？",
        "translation": "If they ultimately don't give rise to dharmas, will they teach them the perfection of wisdom?",
        "source": "T08n0223_007:0267b03_1"
    },
    {
        "source_sentence": "離畢竟不生亦無菩薩行阿耨多羅三藐三菩提。",
        "translation": "Being free of ultimate nonarising, there's also no bodhisattva who practices unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0267b04_2"
    },
    {
        "source_sentence": "若菩薩聞作是說，心不沒不悔不驚不怖不畏，當知是菩薩摩訶薩能行般若波羅蜜。」",
        "translation": "If a bodhisattva hears this teaching and doesn't desist, doesn't repent, isn't frightened, isn't terrified, and isn't afraid, you should know that this is the bodhisattva Mahāsattva who can practice the perfection of wisdom.",
        "source": "T08n0223_007:0267b05_3"
    },
    {
        "source_sentence": "舍利弗問須菩提：「何因緣故，言菩薩摩訶薩前際不可得，後際不可得，",
        "translation": "Śāriputra asked Subhūti, What are the reasons why it's said that the bodhisattva Mahāsattva can't attain the former end and can't attain the latter end?",
        "source": "T08n0223_007:0267b07_4"
    },
    {
        "source_sentence": "中際不可得？",
        "translation": "The middle and the extremes are unobtainable?",
        "source": "T08n0223_007:0267b08_5"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b09_6"
    },
    {
        "source_sentence": "何因緣故，言色無邊故，當知菩薩亦無邊。",
        "translation": "What's the reason why it's said that form is limitless, and you should know that bodhisattvas are also limitless.",
        "source": "T08n0223_007:0267b09_7"
    },
    {
        "source_sentence": "受想行識無邊故，當知菩薩亦無邊。",
        "translation": "Because feeling, perception, volition, and consciousness are limitless, you should know that the bodhisattva is also limitless.",
        "source": "T08n0223_007:0267b10_8"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b11_9"
    },
    {
        "source_sentence": "何因緣故，言色是菩薩，是亦不可得，受想行識是菩薩，是亦不可得？",
        "translation": "What are the reasons why it's said that form is bodhisattva, which is also unobtainable, and feeling, perception, volition, and consciousness are bodhisattvas, which is also unobtainable?",
        "source": "T08n0223_007:0267b11_10"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b13_11"
    },
    {
        "source_sentence": "何因緣故，言於一切種、一切處菩薩不可得，當教何等菩薩般若波羅蜜？",
        "translation": "What is the reason why it's said that all kinds and all places of bodhisattvas are unobtainable, and what should be taught as the bodhisattva's prajñāpāramitā?",
        "source": "T08n0223_007:0267b13_12"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b15_13"
    },
    {
        "source_sentence": "何因緣故，言菩薩摩訶薩但有名字？",
        "translation": "What is the reason it's said that bodhisattvas, mahāsattvas, only have names?",
        "source": "T08n0223_007:0267b15_14"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b16_15"
    },
    {
        "source_sentence": "何因緣故，言如說我名字，我畢竟不生？",
        "translation": "What is the reason for saying that, just as you give my name, I will not arise after all?",
        "source": "T08n0223_007:0267b16_16"
    },
    {
        "source_sentence": "如我諸法亦如是無自性。",
        "translation": "Just as self and dharmas are thus without an own-nature, so are they without an own-nature.",
        "source": "T08n0223_007:0267b17_17"
    },
    {
        "source_sentence": "何等色畢竟不生？",
        "translation": "What form doesn't arise after all?",
        "source": "T08n0223_007:0267b17_18"
    },
    {
        "source_sentence": "何等受想行識畢竟不生？",
        "translation": "What is the ultimate nonarising of feeling, perception, volition, and consciousness?",
        "source": "T08n0223_007:0267b18_19"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b18_20"
    },
    {
        "source_sentence": "何因緣故，言畢竟不生不名為色，畢竟不生不名為受想行識？",
        "translation": "What are the reasons why they say that it absolutely does not arise and is not called form? It absolutely does not arise and is not called feeling, conceptual identification, volition, or consciousness?",
        "source": "T08n0223_007:0267b19_21"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b20_22"
    },
    {
        "source_sentence": "何因緣故，言若畢竟不生法，當教是般若波羅蜜耶？",
        "translation": "What are the reasons why it's said that if there are ultimately unarisen dharmas, should they be taught to be the prajñāpāramitā?",
        "source": "T08n0223_007:0267b20_23"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b22_24"
    },
    {
        "source_sentence": "何因緣故，言離畢竟不生亦無菩薩行阿耨多羅三藐三菩提？",
        "translation": "What are the reasons why it's said that there's no bodhisattva who practices unsurpassed, correct, and complete enlightenment apart from ultimate nonarising?",
        "source": "T08n0223_007:0267b22_25"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0267b23_26"
    },
    {
        "source_sentence": "何因緣故，言若菩薩聞作是說，心不沒不悔不驚不怖不畏，若能如是行，",
        "translation": "“World-honored One, why do you say that if a bodhisattva listens to such a discourse, his mind isn’t disturbed, doesn’t repent, isn’t frightened, isn’t terrified, and isn’t afraid? If he can do so,",
        "source": "T08n0223_007:0267b23_27"
    },
    {
        "source_sentence": "是名菩薩摩訶薩行般若波羅蜜？」",
        "translation": "Is this called a bodhisattva-mahāsattva practicing the perfection of prajñāpāramitā?",
        "source": "T08n0223_007:0267b25_28"
    },
    {
        "source_sentence": "爾時須菩提報舍利弗言：「眾生無所有故，菩薩前際不可得。",
        "translation": "It was then that Subhūti reported to Śāriputra, Because sentient beings lack existence, the bodhisattva's prior limit is unobtainable.",
        "source": "T08n0223_007:0267b26_29"
    },
    {
        "source_sentence": "眾生空故，菩薩前際不可得。",
        "translation": "Because sentient beings are empty, the bodhisattva's prior limit is unobtainable.",
        "source": "T08n0223_007:0267b27_30"
    },
    {
        "source_sentence": "眾生離故，菩薩前際不可得。",
        "translation": "Because sentient beings are separated, the bodhisattva's prior limit is unobtainable.",
        "source": "T08n0223_007:0267b28_31"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267b29_32"
    },
    {
        "source_sentence": "色無有故，菩薩前際不可得；",
        "translation": "Because form does not exist, the former limits of enlightening beings cannot be found.",
        "source": "T08n0223_007:0267b29_33"
    },
    {
        "source_sentence": "受想行識無有故，菩薩前際不可得。",
        "translation": "Because feeling, perception, volition, and consciousness are nonexistent, the bodhisattva's prior state is unobtainable.",
        "source": "T08n0223_007:0267c01_34"
    },
    {
        "source_sentence": "色空故，菩薩前際不可得；",
        "translation": "Because form is empty, the former limits of enlightening beings cannot be found.",
        "source": "T08n0223_007:0267c01_35"
    },
    {
        "source_sentence": "受想行識空故，菩薩前際不可得。",
        "translation": "Because feeling, perception, volition, and consciousness are empty, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0267c02_36"
    },
    {
        "source_sentence": "色離故，菩薩前際不可得；",
        "translation": "Because form is free from form, the former end of enlightening beings cannot be found.",
        "source": "T08n0223_007:0267c03_37"
    },
    {
        "source_sentence": "受想行識離故，菩薩前際不可得。",
        "translation": "Because feeling, perception, volition, and consciousness are free, the bodhisattva's prior state is unobtainable.",
        "source": "T08n0223_007:0267c03_38"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267c04_39"
    },
    {
        "source_sentence": "色性無故，菩薩前際不可得；",
        "translation": "Because the nature of form is nonexistent, the past lives of enlightening beings cannot be obtained.",
        "source": "T08n0223_007:0267c04_40"
    },
    {
        "source_sentence": "受想行識性無故，菩薩前際不可得。",
        "translation": "Because the nature of feeling, perception, volition, and consciousness are absent, the bodhisattva's prior state is unobtainable.",
        "source": "T08n0223_007:0267c05_41"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267c06_42"
    },
    {
        "source_sentence": "檀那波羅蜜無有故，菩薩前際不可得；",
        "translation": "Because there is no transcendent giving, the enlightening beings cannot attain it.",
        "source": "T08n0223_007:0267c06_43"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜無有故，",
        "translation": "It's because the pāramitā of śīla, the pāramitā of kṣatriya, the pāramitā of vīrya, the pāramitā of meditation, and the pāramitā of prajñā are nonexistent.",
        "source": "T08n0223_007:0267c07_44"
    },
    {
        "source_sentence": "菩薩前際不可得。",
        "translation": "The bodhisattva's prior state is unobtainable.",
        "source": "T08n0223_007:0267c09_45"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0267c09_46"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267c09_47"
    },
    {
        "source_sentence": "空中前際不可得，後際不可得，中際不可得。",
        "translation": "The front end of the sky is unobtainable, the back end is unobtainable, and the middle end is unobtainable.",
        "source": "T08n0223_007:0267c09_48"
    },
    {
        "source_sentence": "空不異菩薩，菩薩不異前際。",
        "translation": "Emptiness doesn't differ from bodhisattvas, and bodhisattvas don't differ from the prior.",
        "source": "T08n0223_007:0267c11_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267c11_1"
    },
    {
        "source_sentence": "空、菩薩、前際是諸法無二無別。",
        "translation": "Emptiness, bodhisattvas, and the prior realms are dharmas that are neither two nor distinct.",
        "source": "T08n0223_007:0267c11_2"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0267c12_3"
    },
    {
        "source_sentence": "菩薩前際不可得。",
        "translation": "The bodhisattva's prior state is unobtainable.",
        "source": "T08n0223_007:0267c13_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267c13_5"
    },
    {
        "source_sentence": "檀那波羅蜜空故，檀那波羅蜜離故，檀那波羅蜜性無故，菩薩前際不可得；",
        "translation": "Because the transcendent energy of giving is empty, because the transcendent energy of giving is detached, and because the nature of transcendence of giving is nonexistent, the former limits of enlightening beings cannot be found.",
        "source": "T08n0223_007:0267c13_6"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜空故，",
        "translation": "Because the perfection of śīla-pāramitā, the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of prajñā are empty,",
        "source": "T08n0223_007:0267c15_7"
    },
    {
        "source_sentence": "般若波羅蜜離故，般若波羅蜜性無故，菩薩前際不可得。",
        "translation": "Because the prajñāpāramitā is free, and because the nature of the prajñāpāramitā is absent, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0267c17_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0267c18_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267c18_10"
    },
    {
        "source_sentence": "空中前際不可得，後際不可得，中際不可得。",
        "translation": "The front end of the sky is unobtainable, the back end is unobtainable, and the middle end is unobtainable.",
        "source": "T08n0223_007:0267c18_11"
    },
    {
        "source_sentence": "空不異菩薩亦不異前際。",
        "translation": "The bodhisattva who doesn't differ from emptiness and doesn't differ from the previous one.",
        "source": "T08n0223_007:0267c20_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0267c20_1"
    },
    {
        "source_sentence": "空、菩薩、前際無二無別。",
        "translation": "Emptiness, bodhisattvas, and the prior realm are not two and not distinct.",
        "source": "T08n0223_007:0267c20_2"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0267c21_3"
    },
    {
        "source_sentence": "菩薩、前際不可得。",
        "translation": "Bodhisattva, the prior limit is unobtainable.",
        "source": "T08n0223_007:0267c22_4"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0267c22_5"
    },
    {
        "source_sentence": "內空無所有故，菩薩前際不可得，乃至無法有法空無所有故，菩薩前際不可得；",
        "translation": "Because internal emptiness has no existence, the bodhisattva’s prior state is ungraspable; and because there is nonexistence of emptiness of things at all, the bodhisattva’s prior state is ungraspable.",
        "source": "T08n0223_007:0267c22_6"
    },
    {
        "source_sentence": "內空空故，內空離故，內空性無故，乃至無法有法空空故、離故、性無故，",
        "translation": "It's because internal emptiness is empty, internal emptiness is free of emptiness, and the nature of internal emptiness is nonexistent, up to the point where there can't be emptiness of dharmas because it's empty, separation because it's free, or absence of nature because it's nonexistent.",
        "source": "T08n0223_007:0267c24_7"
    },
    {
        "source_sentence": "菩薩前際不可得。",
        "translation": "The bodhisattva's prior state is unobtainable.",
        "source": "T08n0223_007:0267c26_8"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T08n0223_007:0267c27_0"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0267c27_1"
    },
    {
        "source_sentence": "四念處無所有故，菩薩前際不可得；",
        "translation": "Because the four abodes of mindfulness have no existence, enlightening beings cannot go before them.",
        "source": "T08n0223_007:0267c27_2"
    },
    {
        "source_sentence": "四念處空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the fourth abode of mindfulness is empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0267c28_3"
    },
    {
        "source_sentence": "乃至十八不共法無所有故，菩薩前際不可得；",
        "translation": "Because the eighteen unique qualities of enlightening beings have no existence, the former part of enlightening beings cannot be found.",
        "source": "T08n0223_007:0267c29_4"
    },
    {
        "source_sentence": "十八不共法空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the eighteen distinctive qualities are empty, separate, and nonexistent in nature, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0267c30_5"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T08n0223_007:0268a01_6"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0268a02_7"
    },
    {
        "source_sentence": "菩薩前際不可得。",
        "translation": "The bodhisattva's prior state is unobtainable.",
        "source": "T08n0223_007:0268a02_8"
    },
    {
        "source_sentence": "◎「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0268a03_9"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門無有故，菩薩前際不可得；",
        "translation": "Because all approaches to concentration and all approaches to enlightening beings’ spells are nonexistent, the former part of enlightening beings cannot be found.",
        "source": "T08n0223_007:0268a03_10"
    },
    {
        "source_sentence": "三昧門、陀羅尼門空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the approach of samādhi and the approach of dhāraṇī are empty, because they're free, and because their natures are nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a04_11"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T08n0223_007:0268a06_12"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0268a06_13"
    },
    {
        "source_sentence": "法性無有故，菩薩前際不可得；",
        "translation": "Because the essence of dharmas does not exist, enlightening beings cannot attain a prior state.",
        "source": "T08n0223_007:0268a06_14"
    },
    {
        "source_sentence": "法性空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the Dharma nature is empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a07_15"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T08n0223_007:0268a08_16"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0268a08_17"
    },
    {
        "source_sentence": "如無有故、空故、離故、性無故，實際無有故、空故、離故、性無故，",
        "translation": "Just as there is no existence because of emptiness, nonexistence because of separation, and nonexistence because of its nature, so it is because the actuality does not exist, because of emptiness, nonexistence because of separation, and nonexistence because of its nature.",
        "source": "T08n0223_007:0268a09_0"
    },
    {
        "source_sentence": "不可思議性無有故、空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the inconceivable nature is nonexistent, because it's empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a10_1"
    },
    {
        "source_sentence": "餘如上說。",
        "translation": "The rest are as explained above.",
        "source": "T08n0223_007:0268a11_2"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0268a11_3"
    },
    {
        "source_sentence": "聲聞無有故，菩薩前際不可得；",
        "translation": "Because śrāvakas do not exist, the past lives of enlightening beings cannot be obtained.",
        "source": "T08n0223_007:0268a12_4"
    },
    {
        "source_sentence": "聲聞空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because śrāvakas are empty, secluded, and nonexistent in nature, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a13_0"
    },
    {
        "source_sentence": "辟支佛無有故、空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the pratyekabuddha has no existence, because it's empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a13_1"
    },
    {
        "source_sentence": "佛無有故、空故、離故、性無故，菩薩前際不可得。",
        "translation": "Because the Buddha doesn't exist, because it's empty, because it's free, and because its nature is nonexistent, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a15_2"
    },
    {
        "source_sentence": "阿耨多羅三藐三菩提無有故乃至性無故，菩薩前際不可得。",
        "translation": "Because the unsurpassed, correct, and complete enlightenment doesn't exist or even because its nature doesn't exist, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a16_3"
    },
    {
        "source_sentence": "復次，一切種智無有故乃至性無故，菩薩前際不可得。",
        "translation": "Furthermore, because all kinds of cognition lack existence and even the nature lack existence, the bodhisattva's prior end is unobtainable.",
        "source": "T08n0223_007:0268a17_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0268a18_5"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268a19_0"
    },
    {
        "source_sentence": "空，前際不可得，後際不可得，中際不可得，菩薩不可得。",
        "translation": "Emptiness is unobtainable at the front end, unobtainable at the back end, unobtainable at the middle end, and unobtainable at the bodhisattva's end.",
        "source": "T08n0223_007:0268a19_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268a20_2"
    },
    {
        "source_sentence": "空不異菩薩亦不異前際。",
        "translation": "The bodhisattva who doesn't differ from emptiness and doesn't differ from the previous one.",
        "source": "T08n0223_007:0268a20_3"
    },
    {
        "source_sentence": "空、菩薩、前際，是諸法無二無別。",
        "translation": "Emptiness, bodhisattvas, and the prior realms are dharmas that are neither two nor distinct.",
        "source": "T08n0223_007:0268a21_4"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0268a22_5"
    },
    {
        "source_sentence": "菩薩前際不可得，後際、中際亦如是。",
        "translation": "The bodhisattva's prior period is unobtainable, and so are the subsequent and middle periods.",
        "source": "T08n0223_007:0268a22_6"
    },
    {
        "source_sentence": "「如舍利弗言，色無邊故，當知菩薩亦無邊，受想行識無邊故，當知菩薩亦無邊。",
        "translation": "Just as Śāriputra said, Because form has no limit, you should know that the bodhisattva also has no limit, and because feeling, perception, volition, and consciousness have no limit, you should know that the bodhisattva also has no limit.",
        "source": "T08n0223_007:0268a23_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268a25_8"
    },
    {
        "source_sentence": "色如虛空，受想行識如虛空。",
        "translation": "Form is like space, and feeling, perception, volition, and consciousness are like space.",
        "source": "T08n0223_007:0268a25_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0268a26_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268a26_11"
    },
    {
        "source_sentence": "如虛空，邊不可得、中不可得。",
        "translation": "It's like space, which is unobtainable in the extremes and unobtainable in the middle.",
        "source": "T08n0223_007:0268a26_12"
    },
    {
        "source_sentence": "無邊無中故，但說名虛空。",
        "translation": "Because it has no limit and no middle, it's simply called space.",
        "source": "T08n0223_007:0268a27_13"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0223_007:0268a28_0"
    },
    {
        "source_sentence": "色，邊不可得、中不可得，是色空故，空中亦無邊亦無中。",
        "translation": "Because form is unobtainable in the extremes and unobtainable in the middle, it's because form is empty, and there's neither limit nor middle in space.",
        "source": "T08n0223_007:0268a28_1"
    },
    {
        "source_sentence": "受想行識，邊不可得、中不可得，識空故，空中亦無邊亦無中。",
        "translation": "Because feeling, perception, volition, and consciousness are unobtainable in the extremes and unobtainable in the middle, and because consciousness is empty, space has no limit and no middle.",
        "source": "T08n0223_007:0268a29_2"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0268b02_3"
    },
    {
        "source_sentence": "色無邊故，當知菩薩亦無邊；",
        "translation": "Because form has no limit, you should know that enlightening beings also have no limit.",
        "source": "T08n0223_007:0268b02_4"
    },
    {
        "source_sentence": "受想行識無邊故，當知菩薩亦無邊。",
        "translation": "Because feeling, perception, volition, and consciousness are limitless, you should know that the bodhisattva is also limitless.",
        "source": "T08n0223_007:0268b03_5"
    },
    {
        "source_sentence": "乃至十八不共法亦如是。",
        "translation": "It's likewise with the 18 distinctive qualities.",
        "source": "T08n0223_007:0268b04_6"
    },
    {
        "source_sentence": "「如舍利弗言，色是菩薩，是亦不可得；",
        "translation": "Just as Śāriputra said, “Form is a bodhisattva. This also cannot be obtained.",
        "source": "T08n0223_007:0268b04_7"
    },
    {
        "source_sentence": "受想行識是菩薩，是亦不可得。",
        "translation": "Feeling, perception, volition, and consciousness are bodhisattvas, which are also unobtainable.",
        "source": "T08n0223_007:0268b05_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268b06_9"
    },
    {
        "source_sentence": "色色相空，受想行識識相空。",
        "translation": "Form and form are empty of marks, feeling, perception, volition, consciousness, and marks of consciousness are empty.",
        "source": "T08n0223_007:0268b06_10"
    },
    {
        "source_sentence": "檀那波羅蜜檀那波羅蜜相空，乃至般若波羅蜜亦如是。",
        "translation": "The characteristic of the perfection of giving is emptiness, and so is the perfection of prajñāpāramitā.",
        "source": "T08n0223_007:0268b07_11"
    },
    {
        "source_sentence": "內空內空相空，乃至無法有法空無法有法空相空。",
        "translation": "Internal emptiness and internal emptiness are empty of characteristics, up to the emptiness of dharmas that lack existence and the emptiness of characteristics of dharmas that lack existence are empty.",
        "source": "T08n0223_007:0268b08_12"
    },
    {
        "source_sentence": "四念處四念處相空，乃至十八不共法十八不共法相空。",
        "translation": "The four abodes of mindfulness are empty of the characteristics of the four abodes of mindfulness, up to the emptiness of the characteristics of 18 distinctive qualities and 18 distinctive qualities.",
        "source": "T08n0223_007:0268b09_13"
    },
    {
        "source_sentence": "如、法性、實際、不可思議性不可思議性相空。",
        "translation": "Thus, the nature of dharmas, reality, and inconceivability are inconceivable in their emptiness.",
        "source": "T08n0223_007:0268b10_14"
    },
    {
        "source_sentence": "三昧門三昧門相空，陀羅尼門陀羅尼門相空，一切智一切智相空，道智道智相空，",
        "translation": "The aspect of samādhi and the aspect of samādhi are emptiness, the aspect of dhāraṇī is emptiness, the aspect of dhāraṇī is emptiness, the aspect of omniscience is emptiness, the aspect of omniscience is emptiness, and the aspect of knowledge of the path is emptiness.",
        "source": "T08n0223_007:0268b11_15"
    },
    {
        "source_sentence": "一切種智一切種智相空。",
        "translation": "All kinds of cognition and all kinds of cognition are characterized by emptiness.",
        "source": "T08n0223_007:0268b13_16"
    },
    {
        "source_sentence": "聲聞乘聲聞乘相空，辟支佛乘辟支佛乘相空，佛乘佛乘相空。",
        "translation": "The śrāvaka vehicle is empty of the characteristics of the śrāvaka vehicle and the characteristics of the pratyekabuddha vehicle are empty of the characteristics of the pratyekabuddha vehicle and the characteristics of the pratyekabuddha vehicle, and the characteristics of the buddha vehicle and the characteristics of the buddha vehicle are empty of the characteristics",
        "source": "T08n0223_007:0268b14_17"
    },
    {
        "source_sentence": "聲聞人聲聞人相空，辟支佛人辟支佛人相空，佛佛相空。",
        "translation": "The characteristics of śrāvakas and śrāvakas are empty, the characteristics of pratyekabuddhas and pratyekabuddhas are empty, and the characteristics of buddhas and buddhas are empty.",
        "source": "T08n0223_007:0268b15_18"
    },
    {
        "source_sentence": "空中色不可得，受想行識不可得。",
        "translation": "Form in space is unobtainable, and feeling, perception, volition, and consciousness are unobtainable.",
        "source": "T08n0223_007:0268b17_19"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0268b18_20"
    },
    {
        "source_sentence": "色是菩薩，是亦不可得；",
        "translation": "Form is the enlightening being, and form is also ungraspable.",
        "source": "T08n0223_007:0268b18_21"
    },
    {
        "source_sentence": "受想行識是菩薩，是亦不可得。",
        "translation": "Feeling, perception, volition, and consciousness are bodhisattvas, which are also unobtainable.",
        "source": "T08n0223_007:0268b19_22"
    },
    {
        "source_sentence": "「如舍利弗言，何因緣故，於一切種、一切處菩薩不可得，當教何等菩薩般若波羅蜜？",
        "translation": "Just as Śāriputra said, What are the reasons why all kinds and all places of bodhisattvas can't be obtained, and what is the bodhisattva's prajñāpāramitā that should be taught?",
        "source": "T08n0223_007:0268b20_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268b22_0"
    },
    {
        "source_sentence": "色色中不可得，色受中不可得；",
        "translation": "They are ungraspable in matter and formless in matter; they are ungraspable in matter and sensation.",
        "source": "T08n0223_007:0268b22_1"
    },
    {
        "source_sentence": "受受中不可得，受色中不可得，受想中不可得；",
        "translation": "They are ungraspable in feeling, ungraspable in form, and ungraspable in ideation.",
        "source": "T08n0223_007:0268b22_2"
    },
    {
        "source_sentence": "想想中不可得，想色受中不可得，想行中不可得；",
        "translation": "They are ungraspable in conceptual thought, ungraspable in ideation, ungraspable in conscious construction, ungraspable in ideas, ungraspable in form, ungraspable in sensation, and ungraspable in volition.",
        "source": "T08n0223_007:0268b24_3"
    },
    {
        "source_sentence": "行行中不可得，行色受想中不可得，行識中不可得；",
        "translation": "They are ungraspable in conditioned states; they are ungraspable in conditioned form, in sensation and perception; they are ungraspable in conditioned consciousness.",
        "source": "T08n0223_007:0268b25_4"
    },
    {
        "source_sentence": "識識中不可得，識色受想行中不可得。",
        "translation": "Consciousness is unobtainable in consciousness, and it's unobtainable in consciousness, form, feeling, perception, and volition.",
        "source": "T08n0223_007:0268b26_5"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268b27_6"
    },
    {
        "source_sentence": "眼眼中不可得，眼耳中不可得；",
        "translation": "What is ungraspable in the eye and what is ungraspable within the eye and ear cannot be grasped.",
        "source": "T08n0223_007:0268b27_7"
    },
    {
        "source_sentence": "耳耳中不可得，耳眼中不可得，耳鼻中不可得；",
        "translation": "They cannot be found in the ears, they cannot be found in the eyes, they cannot be found in the ears, and they cannot be found in the nose.",
        "source": "T08n0223_007:0268b28_8"
    },
    {
        "source_sentence": "鼻鼻中不可得，鼻眼耳中不可得，鼻舌中不可得；",
        "translation": "What is unobtainable in the nose, what is unobtainable in the nose, what is unobtainable in the nose eye, what is unobtainable in the ear, and what is unobtainable in the nose and tongue.",
        "source": "T08n0223_007:0268b29_9"
    },
    {
        "source_sentence": "舌舌中不可得，舌眼耳鼻中不可得，舌身中不可得；",
        "translation": "What is not to be found in the tongue and in the tongue; what is not to be found in the tongue, eye, ear, nose, or within the body of the tongue.",
        "source": "T08n0223_007:0268c01_10"
    },
    {
        "source_sentence": "身身中不可得，身眼耳鼻舌中不可得，身意中不可得；",
        "translation": "They are ungraspable in body and body; they are ungraspable in body, eyes, ears, nose, tongue, and body and thought.",
        "source": "T08n0223_007:0268c03_0"
    },
    {
        "source_sentence": "意意中不可得，意眼耳鼻舌身中不可得。",
        "translation": "It's unobtainable in the mind and mind, and it's unobtainable in the mind, eye, ear, nose, tongue, and body.",
        "source": "T08n0223_007:0268c04_1"
    },
    {
        "source_sentence": "六入、六識、六觸，六觸因緣生受亦如是。",
        "translation": "The same applies to the six sense-fields, six consciousnesses and six tangibles. The six tangibles make feeling arise by reason of the sixfold supporting object:",
        "source": "T08n0223_007:0268c05_2"
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，",
        "translation": "The perfection of giving and so forth up to the perfection of wisdom, internal emptiness up to the emptiness of dharmas that don't exist, the four abodes of mindfulness up to the 18 unique qualities,",
        "source": "T08n0223_007:0268c06_3"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門，性法乃至辟支佛法，初地乃至十地，一切智、道種智、一切種智亦如是。",
        "translation": "All samādhi-gates, all dhāraṇī-gates, the nature of dharmas up to the teachings of pratyekabuddhas, and the first ground up to the tenth ground are likewise for omniscience, knowledge of the path, knowledge of all kinds, and knowledge of all kinds.",
        "source": "T08n0223_007:0268c08_4"
    },
    {
        "source_sentence": "須陀洹乃至阿羅漢、辟支佛、菩薩、佛亦如是。",
        "translation": "So it is with stream-winner and even arhats, pratyekabuddhas, bodhisattvas, and buddhas.",
        "source": "T08n0223_007:0268c10_5"
    },
    {
        "source_sentence": "菩薩菩薩中不可得，菩薩般若波羅蜜中不可得；",
        "translation": "They cannot be found among enlightening beings and cannot be found in the transcendent wisdom of enlightening beings.",
        "source": "T08n0223_007:0268c11_6"
    },
    {
        "source_sentence": "般若波羅蜜般若波羅蜜中不可得，般若波羅蜜菩薩中不可得，般若波羅蜜中教化無所有不可得；",
        "translation": "The perfection of wisdom is ungraspable in the perfection of wisdom, ungraspable by enlightening beings in the perfection of wisdom, and ungraspable by all buddhas in the perfection of wisdom.",
        "source": "T08n0223_007:0268c12_7"
    },
    {
        "source_sentence": "教化中教化無所有不可得，教化中菩薩及般若波羅蜜無所有不可得。",
        "translation": "In teaching, there's nothing to be obtained from teaching, and in teaching, there's nothing to be obtained from bodhisattvas and the perfection of prajñāpāramitā.",
        "source": "T08n0223_007:0268c14_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268c16_9"
    },
    {
        "source_sentence": "如是一切法無所有不可得。",
        "translation": "Thus, all dharmas lack existence and are unobtainable.",
        "source": "T08n0223_007:0268c16_10"
    },
    {
        "source_sentence": "以是因緣故，於一切種、一切處菩薩不可得，當教何等菩薩般若波羅蜜？",
        "translation": "Because of these causes and conditions, the bodhisattva is unobtainable in all kinds and all places, so what should be taught as the bodhisattva's prajñāpāramitā?",
        "source": "T08n0223_007:0268c17_11"
    },
    {
        "source_sentence": "「如舍利弗言，何因緣故，說菩薩摩訶薩但有假名？",
        "translation": "As Śāriputra said, why does the bodhisattva Mahāsattva only have a nominal name?",
        "source": "T08n0223_007:0268c19_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0268c20_13"
    },
    {
        "source_sentence": "色是假名，受想行識是假名。",
        "translation": "Form is a provisional name, feeling, perception, volition, and consciousness are provisional names.",
        "source": "T08n0223_007:0268c20_14"
    },
    {
        "source_sentence": "色名非色，受想行識名非識。",
        "translation": "Form is called form and not form; feeling, conceptual identification, volition, and consciousness are called what is not consciousness.",
        "source": "T08n0223_007:0268c21_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0268c22_16"
    },
    {
        "source_sentence": "名名相空，若空則非菩薩。",
        "translation": "Names are empty of names and marks, and if they are empty, they aren't bodhisattvas.",
        "source": "T08n0223_007:0268c22_17"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0268c22_18"
    },
    {
        "source_sentence": "菩薩但有假名。",
        "translation": "A bodhisattva simply has a nominal name.",
        "source": "T08n0223_007:0268c23_19"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0268c23_20"
    },
    {
        "source_sentence": "檀那波羅蜜但有名字，名字中非有檀那波羅蜜，檀那波羅蜜中非有名字。",
        "translation": "The perfection of giving only has names, and there's no perfection of giving in names, and the perfection of giving doesn't have names in the perfection of giving.",
        "source": "T08n0223_007:0268c24_21"
    },
    {
        "source_sentence": "以是因緣故，菩薩但有假名。",
        "translation": "Because of these causes and conditions, the bodhisattva simply has a nominal name.",
        "source": "T08n0223_007:0268c25_22"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜但有名字，",
        "translation": "The pāramitā of śīla, the pāramitā of caṇḍi, the pāramitā of vīrya, the pāramitā of meditation, and the pāramitā of prajñā simply have names.",
        "source": "T08n0223_007:0268c26_23"
    },
    {
        "source_sentence": "名字中無有般若波羅蜜，般若波羅蜜中無有名字。",
        "translation": "In names, there's no prajñā-pāramitā, and in prajñā-pāramitā, there's no name.",
        "source": "T08n0223_007:0268c28_24"
    },
    {
        "source_sentence": "以是因緣故，菩薩但有假名。",
        "translation": "Because of these causes and conditions, the bodhisattva simply has a nominal name.",
        "source": "T08n0223_007:0268c29_25"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269a01_26"
    },
    {
        "source_sentence": "內空但有名字，乃至無法有法空但有名字。",
        "translation": "The internal emptiness only has names, and even the emptiness of dharmas that don't exist doesn't have names.",
        "source": "T08n0223_007:0269a01_27"
    },
    {
        "source_sentence": "名字中無內空，內空中無名字。",
        "translation": "There's no internal emptiness in names, and there's no name in the internal sky.",
        "source": "T08n0223_007:0269a02_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269a03_29"
    },
    {
        "source_sentence": "名字、內空俱不可得。",
        "translation": "Names and internal emptiness are both unobtainable.",
        "source": "T08n0223_007:0269a03_30"
    },
    {
        "source_sentence": "乃至無法有法空亦如是。",
        "translation": "It's likewise with the emptiness of nonexistence and dharmas.",
        "source": "T08n0223_007:0269a03_31"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269a04_32"
    },
    {
        "source_sentence": "菩薩但有假名。",
        "translation": "A bodhisattva simply has a nominal name.",
        "source": "T08n0223_007:0269a05_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269a05_1"
    },
    {
        "source_sentence": "四念處但有名字，乃至十八不共法但有名字。",
        "translation": "The four abodes of mindfulness have names only, and even the 18 distinctive qualities have names only.",
        "source": "T08n0223_007:0269a05_2"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門，乃至一切種智亦如是。",
        "translation": "It's likewise with all the samādhi approaches, all the dhāraṇī approaches, and even all kinds of cognition.",
        "source": "T08n0223_007:0269a06_3"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269a07_4"
    },
    {
        "source_sentence": "我說菩薩但有假名。",
        "translation": "I say that bodhisattvas only have nominal names.",
        "source": "T08n0223_007:0269a08_5"
    },
    {
        "source_sentence": "「如舍利弗言，何因緣故，說我名字畢竟不生？",
        "translation": "“Suppose Śāriputra asked, What are the reasons why you say my name doesn’t arise after all?",
        "source": "T08n0223_007:0269a08_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269a09_7"
    },
    {
        "source_sentence": "我畢竟不可得，云何當有生？",
        "translation": "After all, the self is ungraspable, so how could there be birth?",
        "source": "T08n0223_007:0269a10_8"
    },
    {
        "source_sentence": "乃至知者、見者畢竟不可得，云何當有生？",
        "translation": "How could there be birth when the knower and the viewer are ultimately unobtainable?",
        "source": "T08n0223_007:0269a10_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269a11_10"
    },
    {
        "source_sentence": "色畢竟不可得，云何當有生？",
        "translation": "Form is ultimately unobtainable, so how could there be birth?",
        "source": "T08n0223_007:0269a12_0"
    },
    {
        "source_sentence": "受想行識畢竟不可得，云何當有生？",
        "translation": "After all, feeling, perception, volition, and consciousness are ungraspable, so how could there be birth?",
        "source": "T08n0223_007:0269a12_1"
    },
    {
        "source_sentence": "眼畢竟不可得，乃至意觸因緣生受畢竟不可得，云何當有生？",
        "translation": "How could there be birth when the eye is ultimately unobtainable, or even when sensation arises from the causes and conditions of mental contact is ultimately unobtainable?",
        "source": "T08n0223_007:0269a13_2"
    },
    {
        "source_sentence": "檀那波羅蜜畢竟不可得，乃至般若波羅蜜畢竟不可得，云何當有生！",
        "translation": "The perfection of giving is ultimately unobtainable, and even the perfection of wisdom is ultimately unobtainable, so how could there be birth?",
        "source": "T08n0223_007:0269a15_3"
    },
    {
        "source_sentence": "內空畢竟不可得，乃至無法有法空畢竟不可得，云何當有生？",
        "translation": "How could there be birth when internal emptiness is ultimately unobtainable and even the emptiness of nonexistent dharmas is ultimately unobtainable?",
        "source": "T08n0223_007:0269a16_4"
    },
    {
        "source_sentence": "四念處畢竟不可得，乃至十八不共法畢竟不可得，云何當有生？",
        "translation": "The four abodes of mindfulness are ultimately unobtainable, and even the 18 distinctive qualities are ultimately unobtainable, so how could there be birth?",
        "source": "T08n0223_007:0269a18_5"
    },
    {
        "source_sentence": "諸三昧門、諸陀羅尼門畢竟不可得，云何當有生？",
        "translation": "The approaches of samādhi and dhāraṇī are ultimately unobtainable, so how could there be birth?",
        "source": "T08n0223_007:0269a19_6"
    },
    {
        "source_sentence": "聲聞乃至佛畢竟不可得，云何當有生？",
        "translation": "śrāvakas and even buddhas are ultimately unobtainable, so how could there be birth?",
        "source": "T08n0223_007:0269a21_0"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269a21_1"
    },
    {
        "source_sentence": "我說如我名字，我亦畢竟不生。",
        "translation": "I say it's like my name, and the self doesn't arise after all.",
        "source": "T08n0223_007:0269a22_2"
    },
    {
        "source_sentence": "「如舍利弗所言，如我諸法亦如是無自性。",
        "translation": "“Just as Śāriputra said, just as self and dharmas are thus without an own-nature, so are they without an own-nature.",
        "source": "T08n0223_007:0269a23_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269a24_4"
    },
    {
        "source_sentence": "諸法和合生故無自性。",
        "translation": "Because the dharmas are combined and produced, there's no self-nature.",
        "source": "T08n0223_007:0269a24_5"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269a24_6"
    },
    {
        "source_sentence": "何等和合生無自性？",
        "translation": "What is the absence of an essential nature in the arising of a conjunction?",
        "source": "T08n0223_007:0269a25_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269a25_8"
    },
    {
        "source_sentence": "色和合生無自性，受想行識和合生無自性。",
        "translation": "The combination of form and arising has no self-nature, and the combination of feeling, perception, volition, and consciousness produces no self-nature.",
        "source": "T08n0223_007:0269a25_9"
    },
    {
        "source_sentence": "眼和合生無自性，乃至意和合生無自性。",
        "translation": "The conjunction of the eye produces no self-nature, and the conjunction of the mind produces no self-nature.",
        "source": "T08n0223_007:0269a26_10"
    },
    {
        "source_sentence": "色乃至法，眼界乃至法界，地種乃至識種，眼觸乃至意觸，眼觸因緣生受乃至意觸因緣生受，",
        "translation": "form up to dharmas, the element of vision up to the element of factors, the seeds of earth up to the seeds of consciousness, eye contact up to mental contact, sensation arising from the causes and conditions of eye contact up to sensation arising from the causes and conditions of mental contact.",
        "source": "T08n0223_007:0269a27_11"
    },
    {
        "source_sentence": "和合生無自性。",
        "translation": "'Concomitance arises without an own-nature.'",
        "source": "T08n0223_007:0269b01_0"
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，和合生無自性。",
        "translation": "The perfection of giving and so forth up to the perfection of prajñāpāramitā are combined into one that has no self-nature.",
        "source": "T08n0223_007:0269b01_1"
    },
    {
        "source_sentence": "四念處乃至十八不共法，和合生無自性。",
        "translation": "The four abodes of mindfulness up to the 18 distinctive qualities are combined and produced without self-nature.",
        "source": "T08n0223_007:0269b02_2"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0269b03_3"
    },
    {
        "source_sentence": "一切法無常亦不失。」",
        "translation": "All things are impermanent and not lost, either.",
        "source": "T08n0223_007:0269b03_4"
    },
    {
        "source_sentence": "舍利弗問須菩提：「何等法無常亦不失？」",
        "translation": "Śāriputra asked Subhūti, What things are impermanent and not lost?",
        "source": "T08n0223_007:0269b04_5"
    },
    {
        "source_sentence": "須菩提言：「色無常亦不失，受想行識無常亦不失。",
        "translation": "Suppository of enlightenment said, Form is impermanent and not lost, and feeling, perception, volition, and consciousness are impermanent and not lost.",
        "source": "T08n0223_007:0269b05_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b06_7"
    },
    {
        "source_sentence": "法若無常，即是動相、即是空相。",
        "translation": "If a dharma is impermanent, it's the characteristic of movement and the characteristic of emptiness.",
        "source": "T08n0223_007:0269b06_8"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269b07_9"
    },
    {
        "source_sentence": "一切有為法無常亦不失。",
        "translation": "All conditioned dharmas are impermanent and not lost, either.",
        "source": "T08n0223_007:0269b07_10"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0269b08_11"
    },
    {
        "source_sentence": "若有漏法、若無漏法，若有記法、若無記法。",
        "translation": "If there are contaminated dharmas, if there are uncontaminated dharmas, and if there are indeterminate dharmas or indeterminate dharmas.",
        "source": "T08n0223_007:0269b08_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b09_13"
    },
    {
        "source_sentence": "若法無常，即是動相、即是空相。",
        "translation": "If a thing is impermanent, it's the characteristic of movement and the characteristic of emptiness.",
        "source": "T08n0223_007:0269b09_14"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269b10_15"
    },
    {
        "source_sentence": "一切作法無常亦不失。",
        "translation": "All the created dharmas are impermanent and not lost.",
        "source": "T08n0223_007:0269b11_16"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0269b11_17"
    },
    {
        "source_sentence": "一切法非常非滅。」",
        "translation": "All dharmas are neither eternal nor cessation.",
        "source": "T08n0223_007:0269b11_18"
    },
    {
        "source_sentence": "舍利弗言：「何等法非常非滅？」",
        "translation": "Śāriputra said, What are the things that are neither permanent nor impermanent?",
        "source": "T08n0223_007:0269b12_19"
    },
    {
        "source_sentence": "須菩提言：「色非常非滅。",
        "translation": "Suppository of enlightenment said, Form is neither eternal nor cessation.",
        "source": "T08n0223_007:0269b13_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b13_21"
    },
    {
        "source_sentence": "性自爾。",
        "translation": "It's natural by nature.",
        "source": "T08n0223_007:0269b13_22"
    },
    {
        "source_sentence": "受想行識非常非滅。",
        "translation": "feeling, perception, volition, and consciousness are neither permanent nor cessation.",
        "source": "T08n0223_007:0269b14_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b14_24"
    },
    {
        "source_sentence": "性自爾。",
        "translation": "It's natural by nature.",
        "source": "T08n0223_007:0269b14_25"
    },
    {
        "source_sentence": "乃至意觸因緣生受非常非滅。",
        "translation": "It's even when the causes and conditions of mental contact give rise to sensation that's neither eternal nor cessation.",
        "source": "T08n0223_007:0269b14_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b15_27"
    },
    {
        "source_sentence": "性自爾。",
        "translation": "It's natural by nature.",
        "source": "T08n0223_007:0269b15_28"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269b16_29"
    },
    {
        "source_sentence": "諸法和合生無自性。",
        "translation": "When the dharmas are combined, they give rise to no self-nature.",
        "source": "T08n0223_007:0269b16_30"
    },
    {
        "source_sentence": "「如舍利弗所言，何因緣故，色畢竟不生？",
        "translation": "As Śāriputra said, what are the reasons why form doesn't arise after all?",
        "source": "T08n0223_007:0269b17_31"
    },
    {
        "source_sentence": "受想行識畢竟不生？」",
        "translation": "After all, feeling, perception, volition, and consciousness don't arise?",
        "source": "T08n0223_007:0269b18_0"
    },
    {
        "source_sentence": "須菩提言：「色非作法，受想行識非作法。",
        "translation": "Suppository of enlightenment said, Form is not a done thing, and feeling, perception, volition, and consciousness are not done things.",
        "source": "T08n0223_007:0269b18_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b19_2"
    },
    {
        "source_sentence": "作者不可得故。",
        "translation": "It's because the author is unobtainable.",
        "source": "T08n0223_007:0269b19_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269b20_0"
    },
    {
        "source_sentence": "眼非作法。",
        "translation": "The eye doesn't create dharmas.",
        "source": "T08n0223_007:0269b20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b20_2"
    },
    {
        "source_sentence": "作者不可得故。",
        "translation": "It's because the author is unobtainable.",
        "source": "T08n0223_007:0269b20_3"
    },
    {
        "source_sentence": "乃至意亦如是。",
        "translation": "It's likewise with the mind and so forth.",
        "source": "T08n0223_007:0269b21_0"
    },
    {
        "source_sentence": "眼界乃至意觸因緣生受亦如是。",
        "translation": "It's likewise with the eye realm and even sensation that arises from the causes and conditions of mental contact.",
        "source": "T08n0223_007:0269b21_1"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0269b22_2"
    },
    {
        "source_sentence": "一切諸法皆非起非作。",
        "translation": "All dharmas are neither produced nor created.",
        "source": "T08n0223_007:0269b22_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269b23_0"
    },
    {
        "source_sentence": "作者不可得故。",
        "translation": "It's because the author is unobtainable.",
        "source": "T08n0223_007:0269b23_1"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269b23_2"
    },
    {
        "source_sentence": "色畢竟不生，受想行識畢竟不生。",
        "translation": "Form doesn't arise after all, and feeling, perception, volition, and consciousness don't arise after all.",
        "source": "T08n0223_007:0269b24_3"
    },
    {
        "source_sentence": "「如舍利弗所言，何因緣故，畢竟不生是不名為色，畢竟不生是不名受想行識？」",
        "translation": "As Śāriputra said, what are the reasons why it's not called form after all that it doesn't arise and isn't called feeling, perception, volition, or consciousness after all that it doesn't arise?",
        "source": "T08n0223_007:0269b24_4"
    },
    {
        "source_sentence": "須菩提言：「色性空，是空無生無滅無住異。",
        "translation": "Suppository of enlightenment said, The nature of form is emptiness, which is emptiness without arising or ceasing and without abiding.",
        "source": "T08n0223_007:0269b26_5"
    },
    {
        "source_sentence": "受想行識性空，是空無生無滅無住異。",
        "translation": "The nature of feeling, perception, volition, and consciousness is emptiness, which has no arising, no cessation, and no abiding or changing.",
        "source": "T08n0223_007:0269b27_6"
    },
    {
        "source_sentence": "眼乃至一切有為法性空，是空無生無滅無住異。",
        "translation": "The eye or even the emptiness of all conditioned dharmas is emptiness that has no arising, no cessation, and no abiding difference.",
        "source": "T08n0223_007:0269b28_7"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269c01_0"
    },
    {
        "source_sentence": "畢竟不生不名色，畢竟不生不名受想行識。",
        "translation": "After all, it doesn't arise and isn't called form, and after all, it doesn't arise and isn't called feeling, perception, volition, or consciousness.",
        "source": "T08n0223_007:0269c01_1"
    },
    {
        "source_sentence": "「如舍利弗所言，何因緣故，畢竟不生法當教是般若波羅蜜耶？」",
        "translation": "As Śāriputra said, what are the causes and conditions for ultimately unarisen dharmas that should be taught as the prajñāpāramitā?",
        "source": "T08n0223_007:0269c02_2"
    },
    {
        "source_sentence": "須菩提言：「畢竟不生即是般若波羅蜜，般若波羅蜜即是畢竟不生。",
        "translation": "Suppository said, What's ultimately unarisen is the perfection of wisdom, and what's ultimately unarisen is the perfection of wisdom.",
        "source": "T08n0223_007:0269c04_3"
    },
    {
        "source_sentence": "般若波羅蜜、畢竟不生無二無別。",
        "translation": "The prajñāpāramitā and ultimately unarisen are not two or different.",
        "source": "T08n0223_007:0269c05_4"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269c06_5"
    },
    {
        "source_sentence": "我說畢竟不生當教是般若波羅蜜耶？",
        "translation": "Do I say that the ultimate nonarising of future teachings is the perfection of wisdom?",
        "source": "T08n0223_007:0269c07_0"
    },
    {
        "source_sentence": "「如舍利弗所言，何因緣故，離畢竟不生無菩薩行阿耨多羅三藐三菩提？」",
        "translation": "As Śāriputra said, what are the causes and conditions that make it possible to part with the practice of unsurpassed, correct, and complete enlightenment without bodhisattvahood?",
        "source": "T08n0223_007:0269c07_1"
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩行般若波羅蜜時，不見畢竟不生異般若波羅蜜，",
        "translation": "Suppository said, When bodhisattvas and mahāsattvas practice the perfection of prajñāpāramitā, they don't see that it ultimately doesn't give rise to different perfections of prajñāpāramitā.",
        "source": "T08n0223_007:0269c09_2"
    },
    {
        "source_sentence": "亦不見畢竟不生異菩薩。",
        "translation": "They also don't see the bodhisattva who ultimately doesn't give rise to differences.",
        "source": "T08n0223_007:0269c11_3"
    },
    {
        "source_sentence": "畢竟不生及菩薩無二無別。",
        "translation": "After all, nonarising and bodhisattvas are not two and not distinct.",
        "source": "T08n0223_007:0269c12_0"
    },
    {
        "source_sentence": "不見畢竟不生異色。",
        "translation": "They don't see that they ultimately don't give rise to different forms.",
        "source": "T08n0223_007:0269c12_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269c13_2"
    },
    {
        "source_sentence": "是畢竟不生及色無二無別。",
        "translation": "It's the ultimate nonarising and form that are not two and not distinct.",
        "source": "T08n0223_007:0269c13_3"
    },
    {
        "source_sentence": "不見畢竟不生異受想行識。",
        "translation": "They don't see that they ultimately don't give rise to different feelings, perceptions, volitions, and consciousnesses.",
        "source": "T08n0223_007:0269c14_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0269c14_5"
    },
    {
        "source_sentence": "畢竟不生、受想行識無二無別。",
        "translation": "After all, feeling, perception, volition, and consciousness that don't arise and sensation, perception, volition, and consciousness are not two or different.",
        "source": "T08n0223_007:0269c14_6"
    },
    {
        "source_sentence": "乃至一切種智亦如是。",
        "translation": "It's likewise with all kinds of cognition.",
        "source": "T08n0223_007:0269c15_7"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0269c16_8"
    },
    {
        "source_sentence": "離畢竟不生無菩薩行阿耨多羅三藐三菩提。",
        "translation": "Being free of ultimate nonarising, there's no bodhisattva who practices unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0269c16_9"
    },
    {
        "source_sentence": "「如舍利弗所言，何因緣故，菩薩聞作是說，心不沒不悔不驚不怖不畏，",
        "translation": "“O Śāriputra! What is the reason why, hearing these words of the enlightening being, the bodhisattva’s mind isn’t troubled, doesn’t regret, isn’t frightened, isn’t terrified, and isn’t afraid?",
        "source": "T08n0223_007:0269c17_10"
    },
    {
        "source_sentence": "是名菩薩行般若波羅蜜？」",
        "translation": "Is this called the bodhisattva's practice of prajñā-pāramitā?",
        "source": "T08n0223_007:0269c19_11"
    },
    {
        "source_sentence": "須菩提言：「菩薩摩訶薩不見諸法有覺知想，見一切諸法如夢、如響、如幻、如焰、如影、如化。",
        "translation": "Suppository of enlightenment said, The bodhisattva Mahāsattva doesn't see all dharmas with perception and perception, and he sees all dharmas as dreams, sounds, illusions, flames, shadows, and transformations.",
        "source": "T08n0223_007:0269c20_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0269c22_13"
    },
    {
        "source_sentence": "以是因緣故，菩薩聞作是說，心不沒不悔不驚不怖不畏。」",
        "translation": "Because of these causes and conditions, when the bodhisattva hears this teaching, his mind doesn't sink or repent, isn't frightened, isn't terrified, and isn't afraid.",
        "source": "T08n0223_007:0269c22_14"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0223_007:0269c24_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜如是觀諸法，是時菩薩摩訶薩不受色、不示色、不住色、不著色，",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of wisdom and thus observes all dharmas, then the bodhisattva Mahāsattva doesn't accept form, doesn't show form, doesn't abide in form, and doesn't cling to form.",
        "source": "T08n0223_007:0269c24_1"
    },
    {
        "source_sentence": "亦不言是色。",
        "translation": "It doesn't say it's form.",
        "source": "T08n0223_007:0269c26_2"
    },
    {
        "source_sentence": "受想行識亦不受、不示、不住、不著，亦不言是受想行識。",
        "translation": "Feeling, perception, volition, and consciousness also don't experience, don't show, don't abide, and don't cling, and they don't say it's feeling, perception, volition, and consciousness.",
        "source": "T08n0223_007:0269c27_3"
    },
    {
        "source_sentence": "眼不受、不示、不住、不著、亦不言是眼。",
        "translation": "The eye doesn't receive, doesn't show, doesn't abide, doesn't cling, and doesn't say it's the eye.",
        "source": "T08n0223_007:0269c28_4"
    },
    {
        "source_sentence": "耳鼻舌身意不受、不示、不住、不著，亦不言是意。",
        "translation": "Their ears, nose, tongue, body, and mind don't accept, don't show, don't abide, and don't cling, and they don't say it's intention.",
        "source": "T08n0223_007:0269c29_5"
    },
    {
        "source_sentence": "檀那波羅蜜不受，不示，不住，不著，亦不言是檀那波羅蜜。",
        "translation": "The perfection of giving doesn't accept, doesn't show, doesn't abide, doesn't cling, and doesn't say it's the perfection of giving.",
        "source": "T08n0223_007:0270a01_6"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜，",
        "translation": "The perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of prajñā.",
        "source": "T08n0223_007:0270a02_7"
    },
    {
        "source_sentence": "不受、不示、不住、不著，亦不言是般若波羅蜜。",
        "translation": "He doesn't accept, doesn't show, doesn't abide, and doesn't cling, and doesn't say it's the perfection of prajñā.",
        "source": "T08n0223_007:0270a04_8"
    },
    {
        "source_sentence": "內空不受、不示、不住、不著，亦不言是內空。",
        "translation": "Internal emptiness doesn't receive, doesn't show, doesn't abide, and doesn't cling, and it doesn't say that it's internal emptiness.",
        "source": "T08n0223_007:0270a05_9"
    },
    {
        "source_sentence": "乃至無法有法空亦如是。",
        "translation": "It's likewise with the emptiness of nonexistence and dharmas.",
        "source": "T08n0223_007:0270a06_10"
    },
    {
        "source_sentence": "復次，世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T08n0223_007:0270a07_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，四念處不受、不示、不住、不著，亦不言是四念處。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, the four abodes of mindfulness don't accept, don't show, don't abide, and don't cling to them, and they don't say these are the four abodes of mindfulness.",
        "source": "T08n0223_007:0270a07_1"
    },
    {
        "source_sentence": "乃至十八不共法不受、不示、不住、不著，亦不言是十八不共法。",
        "translation": "It doesn't even say that these 18 distinctive qualities are the 18 distinctive qualities that are neither received, shown, not abiding, nor attached to.",
        "source": "T08n0223_007:0270a09_2"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門乃至一切種智，不受、不示、不住、不著，",
        "translation": "All the teachings of all concentrations, all the teachings of all dhāraṇīs, and even all kinds of knowledge are not received, shown, adhered to, or attached.",
        "source": "T08n0223_007:0270a10_3"
    },
    {
        "source_sentence": "亦不言是一切種智。",
        "translation": "It doesn't say that it's all kinds of cognition.",
        "source": "T08n0223_007:0270a12_4"
    },
    {
        "source_sentence": "復次，世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T08n0223_007:0270a12_5"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，不見色乃至不見一切種智。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñā, they don't see form or even all kinds of cognition.",
        "source": "T08n0223_007:0270a12_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270a14_7"
    },
    {
        "source_sentence": "色不生是非色，受想行識不生是非識。",
        "translation": "Form doesn't give rise to what's right and wrong form, and feeling, perception, volition, and consciousness don't give rise to what's right and wrong consciousness.",
        "source": "T08n0223_007:0270a14_8"
    },
    {
        "source_sentence": "眼不生是非眼，耳鼻舌身意不生是非意。",
        "translation": "The eye doesn't give rise to what's right and wrong, and the ear, nose, tongue, body, and mind don't give rise to what's right and wrong.",
        "source": "T08n0223_007:0270a15_9"
    },
    {
        "source_sentence": "檀那波羅蜜不生是非檀那波羅蜜，乃至般若波羅蜜不生是非般若波羅蜜。",
        "translation": "The perfection of giving doesn't give rise to what's not the perfection of giving, and even the perfection of prajñā doesn't give rise to what's not the perfection of prajñā.",
        "source": "T08n0223_007:0270a16_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270a18_11"
    },
    {
        "source_sentence": "色、不生不二不別。",
        "translation": "Form and non-arising are neither two nor distinct.",
        "source": "T08n0223_007:0270a18_12"
    },
    {
        "source_sentence": "乃至般若波羅蜜、不生不二不別。",
        "translation": "It goes so far as to say that the perfection of wisdom and nonarising are neither two nor distinct.",
        "source": "T08n0223_007:0270a18_13"
    },
    {
        "source_sentence": "內空、不生是非內空，乃至無法有法空不生是非無法有法空。",
        "translation": "What's internal emptiness and what doesn't arise is right and wrong internal emptiness, up to the emptiness of dharmas that lack existence and what doesn't arise is not the emptiness of dharmas that lack existence.",
        "source": "T08n0223_007:0270a19_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270a21_0"
    },
    {
        "source_sentence": "內空乃至無法有法空、不生不二不別。",
        "translation": "It's internal emptiness up to the emptiness of dharmas that lack existence and don't arise, which are neither two nor distinct.",
        "source": "T08n0223_007:0270a21_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270a22_2"
    },
    {
        "source_sentence": "四念處不生非四念處。",
        "translation": "The four abodes of mindfulness don't give rise to what aren't the four abodes of mindfulness.",
        "source": "T08n0223_007:0270a22_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270a22_4"
    },
    {
        "source_sentence": "四念處、不生不二不別。",
        "translation": "The fourth is the abode of mindfulness, which doesn't arise and isn't two or different.",
        "source": "T08n0223_007:0270a22_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270a23_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270a23_7"
    },
    {
        "source_sentence": "是不生法非一非二非三非異。",
        "translation": "What's unarisen is not one, not two, not three, and not different.",
        "source": "T08n0223_007:0270a23_8"
    },
    {
        "source_sentence": "以是故，四念處、不生不二不別。",
        "translation": "Because of this, the four abodes of mindfulness and nonarising are neither two nor distinct.",
        "source": "T08n0223_007:0270a24_9"
    },
    {
        "source_sentence": "乃至十八不共法不生非十八不共法。",
        "translation": "Up to the 18 distinctive qualities that don't arise and aren't the 18 distinctive qualities that don't arise.",
        "source": "T08n0223_007:0270a25_10"
    },
    {
        "source_sentence": "何以故。",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270a26_11"
    },
    {
        "source_sentence": "十八不共法、不生不二不別。",
        "translation": "The eighteen distinctive qualities are not produced, not two, and not distinct.",
        "source": "T08n0223_007:0270a26_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270a27_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270a27_14"
    },
    {
        "source_sentence": "是不生法非一非二非三非異。",
        "translation": "What's unarisen is not one, not two, not three, and not different.",
        "source": "T08n0223_007:0270a27_15"
    },
    {
        "source_sentence": "以是故，十八不共法不生非十八不共法。",
        "translation": "Because of this, the 18 distinctive qualities that don't arise are not the 18 distinctive qualities.",
        "source": "T08n0223_007:0270a28_16"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270a29_17"
    },
    {
        "source_sentence": "如不生是非如，乃至不可思議性不生是非不可思議性。",
        "translation": "Suchness doesn't give rise to what's right and wrong, and so forth, up to the inconceivable nature doesn't give rise to what's right and wrong and inconceivable.",
        "source": "T08n0223_007:0270a29_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270b01_19"
    },
    {
        "source_sentence": "是阿耨多羅三藐三菩提不生，一切智、一切種智不生是非一切種智。",
        "translation": "This is the unsurpassed, correct, and complete enlightenment that doesn't arise, and omniscience and omniscience of all kinds don't arise, and right and wrong omniscience are not produced.",
        "source": "T08n0223_007:0270b01_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270b03_21"
    },
    {
        "source_sentence": "是阿耨多羅三藐三菩提乃至一切種智、不生不二不別。",
        "translation": "It's unsurpassed, correct, and complete enlightenment up to all kinds of cognition that don't arise, aren't two, aren't separate, and aren't distinct.",
        "source": "T08n0223_007:0270b03_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270b04_23"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270b04_24"
    },
    {
        "source_sentence": "是不生非一非二非三非異。",
        "translation": "They aren't produced, aren't one, aren't two, aren't three, and aren't different.",
        "source": "T08n0223_007:0270b05_25"
    },
    {
        "source_sentence": "以是故，乃至一切種智不生非一切種智。",
        "translation": "That's why all kinds of cognition don't give rise to what's not all kinds of cognition.",
        "source": "T08n0223_007:0270b05_26"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270b06_27"
    },
    {
        "source_sentence": "色不滅相是非色。",
        "translation": "Form doesn't cease, and form is neither form nor form.",
        "source": "T08n0223_007:0270b06_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270b07_29"
    },
    {
        "source_sentence": "色及不滅相不二不別。",
        "translation": "Form and form that doesn't cease are not two and not distinct.",
        "source": "T08n0223_007:0270b07_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270b08_31"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270b08_32"
    },
    {
        "source_sentence": "是不滅法非一非二非三非異。",
        "translation": "What's not cessation is neither one, nor two, nor three, nor different.",
        "source": "T08n0223_007:0270b08_33"
    },
    {
        "source_sentence": "以是故，色不滅相是非色，受想行識不滅相是非識。",
        "translation": "Because of this, the characteristic that form doesn't cease is not form, and the characteristic that sensation, perception, volition, and consciousness don't cease is not consciousness.",
        "source": "T08n0223_007:0270b09_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270b10_35"
    },
    {
        "source_sentence": "識及不滅不二不別。",
        "translation": "Consciousness and non-cessation are neither two nor distinct.",
        "source": "T08n0223_007:0270b10_36"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0270b11_37"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270b11_38"
    },
    {
        "source_sentence": "是不滅法非一非二非三非異。",
        "translation": "What's not cessation is neither one, nor two, nor three, nor different.",
        "source": "T08n0223_007:0270b11_39"
    },
    {
        "source_sentence": "以是故，識不滅是非識。",
        "translation": "Because of this, consciousness doesn't cease, which is right and wrong consciousness.",
        "source": "T08n0223_007:0270b12_40"
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法亦如是。",
        "translation": "The perfection of giving and so forth up to the perfection of prajñāpāramitā, internal emptiness up to the emptiness of dharmas that don't exist, and the four abodes of mindfulness up to the 18 distinctive qualities are likewise.",
        "source": "T08n0223_007:0270b12_41"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0223_007:0270b14_42"
    },
    {
        "source_sentence": "以是故，色入無二法數，受想行識入無二法數，乃至一切種智入無二法數。」",
        "translation": "Because of this, form enters into the number of nondual dharmas, sensation, perception, volition, and consciousness enter into the number of nondual dharmas, and so forth, up to all kinds of cognition enter into the number of nondual dharmas.",
        "source": "T08n0223_007:0270b14_43"
    },
    {
        "source_sentence": "◎摩訶般若波羅蜜經◎無生品第二十六爾時慧命舍利弗語須菩提：「菩薩摩訶薩行般若波羅蜜觀諸法。",
        "translation": "Mahāprajñāpāramitā-sūtra ◎ The Chapter on Nonproduction At that point, Wisdom Life Śāriputra said to Subhūti, A bodhisattva Mahāsattva practices the perfection of prajñāpāramitā and observes all dharmas.",
        "source": "T08n0223_007:0270b16_44"
    },
    {
        "source_sentence": "何等是菩薩？",
        "translation": "What's a bodhisattva?",
        "source": "T08n0223_007:0270b19_45"
    },
    {
        "source_sentence": "何等是般若波羅蜜？",
        "translation": "What's the perfection of wisdom?",
        "source": "T08n0223_007:0270b19_46"
    },
    {
        "source_sentence": "何等是觀？」",
        "translation": "What's contemplation?",
        "source": "T08n0223_007:0270b20_47"
    },
    {
        "source_sentence": "須菩提語舍利弗：「汝所問何等是菩薩？",
        "translation": "Suppository said to Śāriputra, What's the bodhisattva you're asking?",
        "source": "T08n0223_007:0270b20_48"
    },
    {
        "source_sentence": "為阿耨多羅三藐三菩提，是人發大心，以是故名為菩薩。",
        "translation": "For the sake of unsurpassed, correct, and complete enlightenment, this person arouses great aspirations, which is why they're called bodhisattvas.",
        "source": "T08n0223_007:0270b21_49"
    },
    {
        "source_sentence": "亦知一切法、一切種相，是中亦不著。",
        "translation": "They also know all things and all kinds of characteristics, and they don't cling to them.",
        "source": "T08n0223_007:0270b22_50"
    },
    {
        "source_sentence": "知色相亦不著，乃至知十八不共法相亦不著。」",
        "translation": "He knows the characteristics of form and doesn't cling to them, and he knows the characteristics of 18 distinctive qualities and doesn't cling to them.",
        "source": "T08n0223_007:0270b23_51"
    },
    {
        "source_sentence": "舍利弗問須菩提：「何等為一切法相？」",
        "translation": "Śāriputra asked Subhūti, What are the characteristics of all dharmas?",
        "source": "T08n0223_007:0270b24_52"
    },
    {
        "source_sentence": "須菩提言：「若以名字因緣和合等知諸法，是色是聲香味觸法、是內是外、是有為法是無為法，",
        "translation": "Subhūti said, If you know all things by names, causes, conditions, conjunctions, and so forth, form is sound, odor, taste, touch, dharmas that are internal and external, and conditioned dharmas are unconditioned dharmas.",
        "source": "T08n0223_007:0270b25_53"
    },
    {
        "source_sentence": "以是名字相語言知諸法，是名知諸法相。",
        "translation": "Knowing the characteristics of dharmas by these names and words, this is called knowing the characteristics of dharmas.",
        "source": "T08n0223_007:0270b27_54"
    },
    {
        "source_sentence": "如舍利弗所問，何等是般若波羅蜜？",
        "translation": "As Śāriputra asked, what's the perfection of wisdom?",
        "source": "T08n0223_007:0270b28_55"
    },
    {
        "source_sentence": "遠離故是名般若波羅蜜。",
        "translation": "Because they're far removed, this is called the prajñāpāramitā.",
        "source": "T08n0223_007:0270b29_56"
    },
    {
        "source_sentence": "何等法遠離？",
        "translation": "What are the dharmas that are far removed?",
        "source": "T08n0223_007:0270c01_57"
    },
    {
        "source_sentence": "遠離陰、界、入，遠離檀那波羅蜜乃至禪那波羅蜜，遠離內空乃至無法有法空。",
        "translation": "They're far removed from the aggregates, elements, and sense-fields, far removed from the perfection of giving and so forth up to the perfection of meditation, and far removed from internal emptiness or even the emptiness of nonexistent dharmas.",
        "source": "T08n0223_007:0270c01_58"
    },
    {
        "source_sentence": "以是故，遠離名般若波羅蜜。",
        "translation": "Because of this, they're far removed from the name prajñāpāramitā.",
        "source": "T08n0223_007:0270c03_59"
    },
    {
        "source_sentence": "復次，遠離四念處，乃至遠離十八不共法，遠離一切智。",
        "translation": "Furthermore, he's far removed from the four abodes of mindfulness, far removed from the 18 distinctive qualities, and far removed from omniscience.",
        "source": "T08n0223_007:0270c04_60"
    },
    {
        "source_sentence": "以是因緣故，遠離名般若波羅蜜。",
        "translation": "Because of these causes and conditions, they're far removed from the name prajñāpāramitā.",
        "source": "T08n0223_007:0270c05_61"
    },
    {
        "source_sentence": "如舍利弗所問，何等是觀？",
        "translation": "As Śāriputra asked, what's contemplation?",
        "source": "T08n0223_007:0270c06_62"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0270c06_63"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，觀色非常非無常、非樂非苦、非我非無我、非空非不空、非相非無相、非作非無作、非寂滅非不寂滅、非離非不離，",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of prajñā, he observes form that's neither eternal nor impermanent, neither pleasant nor painful, neither self nor selfless, neither empty nor nonempty, neither characteristic nor signless, neither created nor uncreated, neither quiescent nor not-quiescent, neither separate",
        "source": "T08n0223_007:0270c07_0"
    },
    {
        "source_sentence": "受想行識亦如是。",
        "translation": "So it is with feeling, perception, volition, and consciousness.",
        "source": "T08n0223_007:0270c10_1"
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，",
        "translation": "The perfection of giving and so forth up to the perfection of wisdom, internal emptiness up to the emptiness of dharmas that don't exist, the four abodes of mindfulness up to the 18 unique qualities,",
        "source": "T08n0223_007:0270c11_0"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門乃至一切種智，觀非常非無常、非樂非苦、非我非無我、非空非不空、非相非無相、非作非無作、非寂滅非不寂滅、非離非不離。",
        "translation": "All the samādhi approaches, all the dhāraṇī approaches, and even all kinds of cognition observe what's neither eternal nor impermanent, what's neither pleasant nor painful, what's neither self nor selfless, what's neither empty nor nonempty, what's neither characterized nor formless, what's neither done nor",
        "source": "T08n0223_007:0270c12_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0270c16_2"
    },
    {
        "source_sentence": "是名菩薩摩訶薩行般若波羅蜜時觀諸法。」",
        "translation": "This is called observing the dharmas when a bodhisattva-mahāsattva practices the perfection of wisdom.",
        "source": "T08n0223_007:0270c16_3"
    },
    {
        "source_sentence": "舍利弗問須菩提：「何因緣故，色不生是非色，受想行識不生是非識，",
        "translation": "Śāriputra asked Subhūti, What are the reasons why form doesn't give rise to what's right and wrong with form, and why feeling, perception, volition, and consciousness don't give rise to what's right and wrong with consciousness?",
        "source": "T08n0223_007:0270c17_4"
    },
    {
        "source_sentence": "乃至一切種智不生是非一切種智？」",
        "translation": "Up to the point where all kinds of cognition don't give rise to all kinds of cognition that are right and wrong?",
        "source": "T08n0223_007:0270c19_5"
    },
    {
        "source_sentence": "須菩提言：「色色相空，色空中無色無生。",
        "translation": "Suppository of enlightenment said, Form and form are emptiness, and form in space has no form and no arising.",
        "source": "T08n0223_007:0270c20_6"
    },
    {
        "source_sentence": "以是因緣故，色不生是非色；",
        "translation": "Because of these causes and conditions, form does not give rise to neither form nor nonform.",
        "source": "T08n0223_007:0270c21_7"
    },
    {
        "source_sentence": "受想行識識相空，識空中無識無生。",
        "translation": "Feeling, perception, volition, consciousness, and the characteristics of consciousness are empty, and there's no consciousness or arising in the air of consciousness.",
        "source": "T08n0223_007:0270c21_8"
    },
    {
        "source_sentence": "以是因緣故，受想行識不生是非受想行識。",
        "translation": "Because of these causes and conditions, feelings, perceptions, volitions, and consciousnesses don't arise, and neither feelings, perceptions, thoughts, volitions, and consciousnesses that are right or wrong don't arise.",
        "source": "T08n0223_007:0270c22_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0270c23_10"
    },
    {
        "source_sentence": "檀那波羅蜜檀那波羅蜜相空，檀那波羅蜜空中無檀那波羅蜜無生；",
        "translation": "The characteristic of the perfection of giving is emptiness, while the characteristic of the perfection of giving is void; in the sky of the perfection of giving there is no giving.",
        "source": "T08n0223_007:0270c24_11"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜般若波羅蜜相空，",
        "translation": "The characteristics of the śīla-pāramitā, the kṣatriya-pāramitā, the vīrya-pāramitā, the meditation-pāramitā, and the prajñāpāramitā are empty.",
        "source": "T08n0223_007:0270c25_12"
    },
    {
        "source_sentence": "般若波羅蜜空中無般若波羅蜜無生。",
        "translation": "There's no prajñā-pāramitā in the sky, and there's no prajñā-pāramitā that arises.",
        "source": "T08n0223_007:0270c27_13"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0270c28_14"
    },
    {
        "source_sentence": "般若波羅蜜不生是非般若波羅蜜。",
        "translation": "The prajñāpāramitā doesn't give rise to the right and wrong prajñāpāramitā.",
        "source": "T08n0223_007:0270c28_15"
    },
    {
        "source_sentence": "內空乃至無法有法空，四念處乃至十八不共法、一切種智亦如是。",
        "translation": "The emptiness of internal emptiness up to the emptiness of nonexistent dharmas, the four abodes of mindfulness up to the 18 distinctive qualities and all kinds of cognition are likewise.",
        "source": "T08n0223_007:0270c29_16"
    },
    {
        "source_sentence": "以是因緣故，內空不生是非內空，乃至一切種智不生是非一切種智。」",
        "translation": "Because of these causes and conditions, internal emptiness doesn't give rise to right and wrong internal emptiness, and even all kinds of cognition don't give rise to right and wrong all kinds of cognition.",
        "source": "T08n0223_007:0271a02_17"
    },
    {
        "source_sentence": "舍利弗問須菩提：「汝何因緣故，言色不二是非色，受想行識不二是非識，",
        "translation": "Śāriputra asked Subhūti, What are the reasons why you say form is not two things as form and feeling, perception, volition, and consciousness are not two things as consciousness?",
        "source": "T08n0223_007:0271a03_18"
    },
    {
        "source_sentence": "乃至一切種智不二是非一切種智？」",
        "translation": "Up to the point where all kinds of cognition are not two, and all kinds of cognition are right and wrong?",
        "source": "T08n0223_007:0271a05_19"
    },
    {
        "source_sentence": "須菩提答言：「所有色所有不二，所有受想行識所有不二，是一切法皆不合不散、無色無形無對，",
        "translation": "Suppository of enlightenment replied, All forms are nondual, and all feelings, perceptions, volitions, and consciousnesses are nondual. These are all things that don't fit together or disperse, formless, formless, and formless,",
        "source": "T08n0223_007:0271a06_20"
    },
    {
        "source_sentence": "一相所謂無相。",
        "translation": "One characteristic is called marklessness.",
        "source": "T08n0223_007:0271a08_21"
    },
    {
        "source_sentence": "眼乃至一切種智亦如是。",
        "translation": "So it is with the eye and even all kinds of cognition.",
        "source": "T08n0223_007:0271a09_22"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0271a09_23"
    },
    {
        "source_sentence": "色不二是非色，受想行識不二是非識，乃至一切種智不二是非一切種智。」",
        "translation": "Form is not two and right from form, feeling, perception, volition, and consciousness are not two and right from consciousness, and all kinds of cognition are not two and right from all kinds of cognition.",
        "source": "T08n0223_007:0271a10_24"
    },
    {
        "source_sentence": "舍利弗問須菩提：「何因緣故，言是色入無二法數，受想行識入無二法數，",
        "translation": "Śāriputra asked Subhūti, What are the reasons why it's said that form enters into the number of nondual dharmas and feeling, perception, volition, and consciousness enter into the number of nondual dharmas?",
        "source": "T08n0223_007:0271a12_25"
    },
    {
        "source_sentence": "乃至一切種智入無二法數？」",
        "translation": "Up to the point where all kinds of cognition enter into the number of nondual dharmas?",
        "source": "T08n0223_007:0271a13_26"
    },
    {
        "source_sentence": "須菩提答言：「色不異無生、無生不異色，色即是無生、無生即是色。",
        "translation": "Suppository replied, Form doesn't differ from nonarising and nonarising doesn't differ from form; form is nonarising, and nonarising is form.",
        "source": "T08n0223_007:0271a14_27"
    },
    {
        "source_sentence": "受想行識不異無生、無生不異識，識即是無生、無生即是識。",
        "translation": "Feeling, perception, volition, and consciousness aren't different from nonarising and nonarising isn't different from consciousness, and consciousness is nonarising, and nonarising is consciousness.",
        "source": "T08n0223_007:0271a16_28"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0271a17_29"
    },
    {
        "source_sentence": "色入無二法數，受想行識入無二法數，乃至一切種智亦如是。」",
        "translation": "Form and form enter into the number of nondual dharmas, sensation, perception, volition, and consciousness enter into the number of nondual dharmas, and so does all kinds of cognition.",
        "source": "T08n0223_007:0271a18_0"
    },
    {
        "source_sentence": "爾時須菩提白佛言：「世尊！",
        "translation": "It was then that Subhūti said to the Buddha, Bhagavān!",
        "source": "T08n0223_007:0271a19_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜如是觀諸法，是時見色無生，畢竟淨故；",
        "translation": "If great enlightening beings practice the perfection of wisdom and thus contemplate all things, then they see form as uncreated because it is ultimately pure.",
        "source": "T08n0223_007:0271a20_2"
    },
    {
        "source_sentence": "見受想行識無生，畢竟淨故。",
        "translation": "views, feelings, perceptions, conceptualizations, volitions, and consciousnesses are unarisen because they are ultimately pure.",
        "source": "T08n0223_007:0271a21_3"
    },
    {
        "source_sentence": "見我無生乃至知者、見者無生，畢竟淨故。",
        "translation": "Seeing self as non-arising... even knowing and seeing is non-arising because it's ultimately pure.",
        "source": "T08n0223_007:0271a22_4"
    },
    {
        "source_sentence": "見檀那波羅蜜無生乃至般若波羅蜜無生，畢竟淨故。",
        "translation": "Seeing the nonarising of the perfection of giving and the nonarising of the perfection of prajñāpāramitā is ultimately pure because it's purified.",
        "source": "T08n0223_007:0271a23_5"
    },
    {
        "source_sentence": "見內空無生乃至無法有法空無生，畢竟淨故。",
        "translation": "Seeing internal emptiness as nonarising and even the emptiness of dharmas that lack existence as nonarising is ultimately pure.",
        "source": "T08n0223_007:0271a24_6"
    },
    {
        "source_sentence": "見四念處無生乃至十八不共法無生，畢竟淨故。",
        "translation": "It's because the four abodes of mindfulness are unarisen and even the 18 distinctive qualities are unarisen, which are ultimately pure.",
        "source": "T08n0223_007:0271a25_7"
    },
    {
        "source_sentence": "見一切三昧、一切陀羅尼無生，畢竟淨故。",
        "translation": "Seeing that all samādhis and all dhāraṇīs are unarisen, it's ultimately pure.",
        "source": "T08n0223_007:0271a26_8"
    },
    {
        "source_sentence": "乃至見一切種智無生，畢竟淨故。",
        "translation": "It's because they see that all kinds of cognition are unarisen and ultimately pure.",
        "source": "T08n0223_007:0271a27_9"
    },
    {
        "source_sentence": "見凡人凡人法無生，畢竟淨故。",
        "translation": "It's because they see that ordinary people and ordinary dharmas are unarisen, which are ultimately pure.",
        "source": "T08n0223_007:0271a28_10"
    },
    {
        "source_sentence": "見須陀洹須陀洹法、斯陀含斯陀含法、阿那含阿那含法、阿羅漢阿羅漢法、辟支佛辟支佛法、菩薩菩薩法、佛佛法無生，",
        "translation": "They see the teaching of stream-winner, the teaching of stream-winner, the teaching of once-returner, the teaching of once-returner, the teaching of non-returner, the teaching of non-returner, the teaching of arhat, the teaching of arhat, the teaching of pratyekabuddha, the teaching of pratyekabuddha, the teaching of bodhisattva",
        "source": "T08n0223_007:0271a29_11"
    },
    {
        "source_sentence": "畢竟淨故。」",
        "translation": "It's because they are ultimately pure.",
        "source": "T08n0223_007:0271b02_12"
    },
    {
        "source_sentence": "舍利弗語須菩提：「如我聞須菩提所說義，色是不生，受想行識是不生，",
        "translation": "Śāriputra said to Subhūti, As I've heard what Subhūti taught, form doesn't arise, sensation, perception, volition, and consciousness don't arise.",
        "source": "T08n0223_007:0271b03_13"
    },
    {
        "source_sentence": "乃至佛佛法是不生。",
        "translation": "It goes so far as to say that the Buddha's buddha-dharma isn't produced.",
        "source": "T08n0223_007:0271b04_14"
    },
    {
        "source_sentence": "若爾者，今不應得須陀洹須陀洹果、斯陀含斯陀含果、阿那含阿那含果、阿羅漢阿羅漢果、辟支佛辟支佛道，",
        "translation": "If that's the case, they shouldn't now attain the fruit of stream entry and stream entry, the fruit of once-returning and once-returning, the fruit of non-returning and non-returning, the fruit of arhatship and arhatship, or the path of pratyekabuddha and pratyekabuddha.",
        "source": "T08n0223_007:0271b05_15"
    },
    {
        "source_sentence": "不應得菩薩摩訶薩一切種智，亦無六道別異，亦不得菩薩摩訶薩五種菩提。",
        "translation": "They shouldn't attain the bodhisattva-mahāsattva's omniscience, nor should there be distinctions in the six paths, nor should they attain the five kinds of bodhisattva-mahāsattva enlightenment.",
        "source": "T08n0223_007:0271b07_16"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0271b09_17"
    },
    {
        "source_sentence": "若一切法不生相，何以故須陀洹為斷三結故修道？",
        "translation": "If all things don't give rise to characteristics, why is stream entry cultivated because it ends the three bonds?",
        "source": "T08n0223_007:0271b09_18"
    },
    {
        "source_sentence": "斯陀含為薄婬恚癡故修道？",
        "translation": "Does the once-returner cultivate it because he's weak in anger and delusion?",
        "source": "T08n0223_007:0271b10_19"
    },
    {
        "source_sentence": "阿那含為斷五下分結故修道？",
        "translation": "Does the anagamin cultivate enlightenment because he ends the five lower bonds?",
        "source": "T08n0223_007:0271b11_20"
    },
    {
        "source_sentence": "阿羅漢為斷五上分結故修道？",
        "translation": "Does an arhat cultivate the path because he stops the five higher bonds?",
        "source": "T08n0223_007:0271b12_21"
    },
    {
        "source_sentence": "辟支佛為辟支佛法故修道？",
        "translation": "Is a pratyekabuddha cultivates the path for the sake of the teachings of a pratyekabuddha?",
        "source": "T08n0223_007:0271b13_22"
    },
    {
        "source_sentence": "何以故菩薩摩訶薩作難行為眾生受種種苦？",
        "translation": "Why is it that the bodhisattva Mahāsattva creates difficult practices for sentient beings to undergo various kinds of suffering?",
        "source": "T08n0223_007:0271b13_23"
    },
    {
        "source_sentence": "何以故佛得阿耨多羅三藐三菩提？",
        "translation": "Why did the Buddha attain supreme perfect enlightenment?",
        "source": "T08n0223_007:0271b14_24"
    },
    {
        "source_sentence": "何以故佛轉法輪？」",
        "translation": "Why is it that the Buddha turns the wheel of the Dharma?",
        "source": "T08n0223_007:0271b15_25"
    },
    {
        "source_sentence": "須菩提語舍利弗：「我不欲令無生法有所得，我亦不欲令無生法中得須陀洹須陀洹果，",
        "translation": "Suppository of enlightenment said to Śāriputra, I don't want to cause the dharmas that are unarisen to attain anything, and I don't want to cause the dharmas that are unarisen to attain the fruit of stream-winner or stream-winner.",
        "source": "T08n0223_007:0271b16_26"
    },
    {
        "source_sentence": "乃至不欲令無生法中得阿羅漢阿羅漢果、辟支佛辟支佛道。",
        "translation": "They don't want to cause them to attain the arhatship of arhatship and the fruit of arhatship in the unborn Dharma or the path of pratyekabuddhas and pratyekabuddhas.",
        "source": "T08n0223_007:0271b18_27"
    },
    {
        "source_sentence": "我亦不欲令菩薩作難行為眾生受種種苦，菩薩亦不以難行心行道。",
        "translation": "Nor do I want to cause the bodhisattva to make difficult practices and sentient beings to experience various kinds of suffering, and the bodhisattva doesn't follow the path with a difficult-practicing mind.",
        "source": "T08n0223_007:0271b19_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0271b21_29"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0271b21_30"
    },
    {
        "source_sentence": "生難心苦心不能利益無量阿僧祇眾生。",
        "translation": "They give rise to difficult thoughts and painful thoughts that can't benefit measureless, incalculable sentient beings.",
        "source": "T08n0223_007:0271b22_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0271b23_0"
    },
    {
        "source_sentence": "今菩薩憐愍眾生，於眾生如父母兄弟想，如兒子及己身想。",
        "translation": "Now, the bodhisattva pitys sentient beings and thinks of sentient beings as parents and brothers or sons and himself.",
        "source": "T08n0223_007:0271b23_1"
    },
    {
        "source_sentence": "如是能利益無量阿僧祇眾生，用無所得故。",
        "translation": "Thus, they can benefit measureless and incalculable sentient beings because their use is ungraspable.",
        "source": "T08n0223_007:0271b24_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0223_007:0271b25_3"
    },
    {
        "source_sentence": "菩薩摩訶薩應生如是心：『如我一切處、一切種不可得，內外法亦如是。』",
        "translation": "The bodhisattva Mahāsattva should give rise to the mind that says, 'Suppose all places and all kinds of things like mine are unobtainable, and so are internal and external dharmas.'",
        "source": "T08n0223_007:0271b26_0"
    },
    {
        "source_sentence": "若生如是想則無難心苦心。",
        "translation": "If someone gives rise to such an idea, then there's no difficulty or painful thought.",
        "source": "T08n0223_007:0271b27_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0271b28_2"
    },
    {
        "source_sentence": "是菩薩於一切種、一切處、一切法不受故。",
        "translation": "It's because the bodhisattva doesn't accept all kinds, all places, and all dharmas.",
        "source": "T08n0223_007:0271b28_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0271b29_4"
    },
    {
        "source_sentence": "我亦不欲令無生中佛得阿耨多羅三藐三菩提，亦不欲令無生中轉法輪，",
        "translation": "Nor do I want to cause the Buddha to attain uncreated perfect enlightenment, nor do I want to cause the Dharma wheel to turn in the uncreated.",
        "source": "T08n0223_007:0271b29_5"
    },
    {
        "source_sentence": "亦不欲令以無生法得道。」",
        "translation": "Nor does he want to cause them to attain the path based on the principle of nonproduction.",
        "source": "T08n0223_007:0271c02_6"
    },
    {
        "source_sentence": "舍利弗語須菩提：「今欲令以生法得道、以無生法得道？」",
        "translation": "Śāriputra said to Subhūti, Now, do you want to cause the path to be attained by the Dharma that arises and the path to be attained by the Dharma that doesn't arise?",
        "source": "T08n0223_007:0271c03_7"
    },
    {
        "source_sentence": "須菩提語舍利弗：「我不欲令以生法得道。」",
        "translation": "Suppository said to Śāriputra, I don't want to cause the path to be attained by means of the Dharma that arises.",
        "source": "T08n0223_007:0271c04_8"
    },
    {
        "source_sentence": "舍利弗言：「今須菩提欲令以無生法得道？」",
        "translation": "Śāriputra said, Now, it's necessary for enlightenment to cause the path to be attained with the Dharma of nonarising?",
        "source": "T08n0223_007:0271c05_9"
    },
    {
        "source_sentence": "須菩提言：「我亦不欲令以無生法得道。」",
        "translation": "Suppository said, I don't want to cause them to attain the path based on the principle of nonproduction either.",
        "source": "T08n0223_007:0271c06_10"
    },
    {
        "source_sentence": "舍利弗言：「如須菩提所說，無知無得。」",
        "translation": "Śāriputra said, As Suppository of enlightenment teaches, there's no knowing and no attainment.",
        "source": "T08n0223_007:0271c07_11"
    },
    {
        "source_sentence": "須菩提言：「有知有得不以二法。",
        "translation": "Suppository of enlightenment said, There are people who know that there are attainments that aren't based on two things.",
        "source": "T08n0223_007:0271c08_12"
    },
    {
        "source_sentence": "今以世間名字故有知有得，世間名字故，有須陀洹乃至阿羅漢、辟支佛、諸佛。",
        "translation": "Now, because of worldly names, there's knowing and attaining, and because of worldly names, there are stream-winners up to arhats, pratyekabuddhas, and buddhas.",
        "source": "T08n0223_007:0271c09_13"
    },
    {
        "source_sentence": "第一實義中無知無得，無須陀洹乃至無佛。」",
        "translation": "In the first true meaning, there's no knowing and no attainment, and there's no stream entry or even no Buddha.",
        "source": "T08n0223_007:0271c11_14"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0271c12_15"
    },
    {
        "source_sentence": "若世間名字故有知有得，六道別異亦世間名字故有；",
        "translation": "If there is knowledge and acquisition because of worldly names, the six paths also exist because of worldly names.",
        "source": "T08n0223_007:0271c12_16"
    },
    {
        "source_sentence": "非以第一實義耶？」",
        "translation": "Isn't it because of the ultimate truth?",
        "source": "T08n0223_007:0271c13_17"
    },
    {
        "source_sentence": "須菩提言：「如是，如是！",
        "translation": "Suppository said, So it is, so it is!",
        "source": "T08n0223_007:0271c14_18"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0271c14_19"
    },
    {
        "source_sentence": "如世間名字故有知有得，六道別異亦世間名字故有；",
        "translation": "Just as there is knowledge and acquisition because of worldly names, so also the six paths that are different from one another exist because of worldly names.",
        "source": "T08n0223_007:0271c14_20"
    },
    {
        "source_sentence": "非以第一實義。",
        "translation": "It's not because of the ultimate truth.",
        "source": "T08n0223_007:0271c16_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0271c16_22"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0271c16_23"
    },
    {
        "source_sentence": "第一實義中無業無報、無生無滅、無淨無垢。」",
        "translation": "In the ultimate truth, there's no action, no retribution, no arising and no cessation, and no purity and no stain.",
        "source": "T08n0223_007:0271c16_24"
    },
    {
        "source_sentence": "舍利弗語須菩提：「不生法生？",
        "translation": "Śāriputra said to Subhūti, Doesn't the Dharma arise?",
        "source": "T08n0223_007:0271c17_25"
    },
    {
        "source_sentence": "生法生？」",
        "translation": "What is the arising of dharmas that arise?",
        "source": "T08n0223_007:0271c18_26"
    },
    {
        "source_sentence": "須菩提言：「我不欲令不生法生，亦不欲令生法生。」",
        "translation": "Suppository said, I don't want to cause things that don't arise to arise, and I don't want to cause things to arise to arise.",
        "source": "T08n0223_007:0271c18_27"
    },
    {
        "source_sentence": "舍利弗言：「何等不生法不欲令生？」",
        "translation": "Śāriputra said, What's an unproduced dharma that doesn't want to be produced?",
        "source": "T08n0223_007:0271c19_28"
    },
    {
        "source_sentence": "須菩提言：「色是不生法，自性空不欲令生；",
        "translation": "Suppository of enlightenment said: Form is an ungenerated dharma whose essential nature is emptiness and which one does not wish to be produced.",
        "source": "T08n0223_007:0271c20_29"
    },
    {
        "source_sentence": "受想行識是不生法，自性空不欲令生。",
        "translation": "Feeling, perception, volition, and consciousness are unarisen dharmas that are self-natured as emptiness and don't want to be produced.",
        "source": "T08n0223_007:0271c21_30"
    },
    {
        "source_sentence": "乃至阿耨多羅三藐三菩提是不生法，自性空不欲令生。」",
        "translation": "It goes so far as to say that unsurpassed, correct, and complete enlightenment is an unproduced dharma that doesn't want to be produced by emptiness of its own nature.",
        "source": "T08n0223_007:0271c22_31"
    },
    {
        "source_sentence": "舍利弗語須菩提：「生生？",
        "translation": "Śāriputra said to Subhūti, Birth and birth?",
        "source": "T08n0223_007:0271c24_32"
    },
    {
        "source_sentence": "不生生？」",
        "translation": "What's produced and what's not produced?",
        "source": "T08n0223_007:0271c24_33"
    },
    {
        "source_sentence": "須菩提言：「非生生亦非不生生。",
        "translation": "Suppository of enlightenment said, It's neither produced nor unarisen.",
        "source": "T08n0223_007:0271c24_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0271c25_35"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0271c25_36"
    },
    {
        "source_sentence": "生、不生是二法不合不散、無色無形無對，一相所謂無相。",
        "translation": "What arises and what doesn't arise are two things that don't fit together and don't disperse, which are formless, formless, and formless without opposites, and one characteristic is called formless.",
        "source": "T08n0223_007:0271c26_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0271c27_1"
    },
    {
        "source_sentence": "以是因緣故，非生生亦非不生生。」",
        "translation": "Because of these causes and conditions, it's neither produced nor unarisen.",
        "source": "T08n0223_007:0271c27_2"
    },
    {
        "source_sentence": "爾時舍利弗語須菩提：「須菩提樂說無生法及無生相。」",
        "translation": "It was then that Śāriputra said to Suppository, Suppository delights in speaking about the nonarising of dharmas and the characteristics of nonarising.",
        "source": "T08n0223_007:0271c28_3"
    },
    {
        "source_sentence": "須菩提語舍利弗：「我樂說無生法亦樂說無生相。",
        "translation": "Suppository said to Śāriputra, I delight in explaining the principle of nonproduction and also delight in explaining the characteristic of nonproduction.",
        "source": "T08n0223_007:0271c29_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0272a01_5"
    },
    {
        "source_sentence": "諸無生法、無生相及樂說語言，是一切法皆不合不散、無色無形無對，",
        "translation": "The nonoriginated dharmas, the marks of nonorigination and enjoyable speech are all things that don't fit together or disperse, have formless form and formless form and no opposites.",
        "source": "T08n0223_007:0272a02_6"
    },
    {
        "source_sentence": "一相所謂無相。」",
        "translation": "One characteristic is called marklessness.",
        "source": "T08n0223_007:0272a03_7"
    },
    {
        "source_sentence": "舍利弗語須菩提：「汝樂說不生法亦樂說不生相，是樂說語言亦不生？」",
        "translation": "Śāriputra said to Subhūti, Do you delight in speaking the Dharma that doesn't arise and also delight in speaking the characteristics that don't arise, or do you delight in speaking words that don't arise?",
        "source": "T08n0223_007:0272a04_8"
    },
    {
        "source_sentence": "須菩提言：「如是，如是！",
        "translation": "Suppository said, So it is, so it is!",
        "source": "T08n0223_007:0272a05_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272a06_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0272a06_11"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272a06_12"
    },
    {
        "source_sentence": "色不生，受想行識不生。",
        "translation": "Form doesn't arise, and feelings, perceptions, volitions, and consciousness don't arise.",
        "source": "T08n0223_007:0272a07_0"
    },
    {
        "source_sentence": "眼不生乃至意不生，地種不生乃至識種不生，身行不生、口行不生、意行不生，",
        "translation": "The eye doesn’t arise, up to mind doesn’t arise; the earth element doesn’t arise, up to the consciousness element doesn’t arise; bodily action doesn’t arise, verbal action doesn’t arise, and mental action doesn’t arise.",
        "source": "T08n0223_007:0272a07_1"
    },
    {
        "source_sentence": "檀那波羅蜜不生乃至一切種智不生。",
        "translation": "The perfection of giving doesn't arise, and even all kinds of cognition don't arise.",
        "source": "T08n0223_007:0272a09_2"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0272a10_3"
    },
    {
        "source_sentence": "我樂說不生法亦樂說不生相，是樂說語言亦不生。」",
        "translation": "I delight in speaking of things that don't arise and also delight in speaking of characteristics that don't arise, which is to say that pleasant speech doesn't arise either.",
        "source": "T08n0223_007:0272a10_4"
    },
    {
        "source_sentence": "爾時舍利弗語須菩提：「須菩提於說法人中應最在上。",
        "translation": "It was then that Śāriputra said to Subhūti, Subhūti should be the highest among those who teach the Dharma.",
        "source": "T08n0223_007:0272a12_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0272a13_6"
    },
    {
        "source_sentence": "須菩提隨所問皆能答。」",
        "translation": "Suppositories of enlightenment can answer whatever they ask.",
        "source": "T08n0223_007:0272a13_7"
    },
    {
        "source_sentence": "須菩提言：「諸法無所依故。」",
        "translation": "Suppository of enlightenment said, It's because all dharmas lack support.",
        "source": "T08n0223_007:0272a14_8"
    },
    {
        "source_sentence": "舍利弗語須菩提：「云何諸法無所依？」",
        "translation": "Śāriputra said to Subhūti, What are the dharmas that have no basis?",
        "source": "T08n0223_007:0272a14_9"
    },
    {
        "source_sentence": "須菩提言：「色性常空，不依內、不依外、不依兩中間；",
        "translation": "Suppository of enlightenment said: The nature of matter is eternally empty, not relying on anything internal, external, or intermediate.",
        "source": "T08n0223_007:0272a15_10"
    },
    {
        "source_sentence": "受想行識性常空，不依內、不依外、不依兩中間。",
        "translation": "The nature of feeling, perception, volition, and consciousness are always empty, not relying on internal, external, or between the two.",
        "source": "T08n0223_007:0272a17_0"
    },
    {
        "source_sentence": "眼耳鼻舌身意性常空，不依內、不依外、不依兩中間；",
        "translation": "The nature of eyes, ears, nose, tongue, body, and thought are always empty: they do not depend on the inside, on the outside, or on anything in between.",
        "source": "T08n0223_007:0272a18_1"
    },
    {
        "source_sentence": "色性常空乃至法性常空，不依內、不依外、不依兩中間。",
        "translation": "The nature of form is always empty, even the nature of dharmas is always empty, and it doesn't rely on internal, external, or between them.",
        "source": "T08n0223_007:0272a19_2"
    },
    {
        "source_sentence": "檀那波羅蜜性常空乃至般若波羅蜜性常空，不依內、不依外、不依兩中間。",
        "translation": "The nature of the perfection of giving is always empty, up to the nature of the perfection of prajñāpāramitā is always empty, and it doesn't rely on internal, external, or between them.",
        "source": "T08n0223_007:0272a20_3"
    },
    {
        "source_sentence": "內空性常空乃至無法有法空性常空，不依內、不依外、不依兩中間。",
        "translation": "The emptiness of internal emptiness is always empty, even the emptiness of nonexistent dharmas is always empty, and it doesn't rely on what's inside, what's outside, or what's between.",
        "source": "T08n0223_007:0272a22_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272a24_5"
    },
    {
        "source_sentence": "四念處性常空乃至一切種智性常空，不依內、不依外、不依兩中間。",
        "translation": "The nature of the four abodes of mindfulness is always empty, up to the eternal emptiness of the nature of all kinds of cognition, which doesn't rely on internal, external, or between them.",
        "source": "T08n0223_007:0272a24_6"
    },
    {
        "source_sentence": "以是因緣故，舍利弗！",
        "translation": "Because of these causes and conditions, Śāriputra!",
        "source": "T08n0223_007:0272a25_7"
    },
    {
        "source_sentence": "一切諸法無所依，性常空故。",
        "translation": "All dharmas have no basis, because their nature is always empty.",
        "source": "T08n0223_007:0272a26_8"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0223_007:0272a27_9"
    },
    {
        "source_sentence": "菩薩摩訶薩行六波羅蜜時，應淨色受想行識，乃至應淨一切種智。」",
        "translation": "When bodhisattvas and mahāsattvas practice the six perfections, they should purify form, feeling, perception, volition, consciousness, and even all kinds of cognition.",
        "source": "T08n0223_007:0272a27_10"
    },
    {
        "source_sentence": "舍利弗問須菩提：「菩薩摩訶薩云何行六波羅蜜時淨菩薩道？」",
        "translation": "Śāriputra asked Subhūti, How does a bodhisattva-mahāsattva purify the bodhisattva path when he practices the six perfections?",
        "source": "T08n0223_007:0272a29_0"
    },
    {
        "source_sentence": "須菩提言：「有世間檀那波羅蜜，有出世間檀那波羅蜜。",
        "translation": "Suppository said, There's the worldly perfection of giving and there's the supramundane perfection of giving.",
        "source": "T08n0223_007:0272b01_1"
    },
    {
        "source_sentence": "尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜，",
        "translation": "The perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of prajñā.",
        "source": "T08n0223_007:0272b02_2"
    },
    {
        "source_sentence": "有世間、有出世間。」",
        "translation": "There's worldly and there's transmundane.",
        "source": "T08n0223_007:0272b04_3"
    },
    {
        "source_sentence": "舍利弗問須菩提：「云何世間檀那波羅蜜？",
        "translation": "Śāriputra asked Subhūti, What's the worldly perfection of giving?",
        "source": "T08n0223_007:0272b04_4"
    },
    {
        "source_sentence": "云何出世間檀那波羅蜜？」",
        "translation": "What is the supramundane perfection of giving?",
        "source": "T08n0223_007:0272b05_5"
    },
    {
        "source_sentence": "須菩提言：「若菩薩摩訶薩作施主，能施沙門、婆羅門、貧窮乞人，須食與食，",
        "translation": "Suppository of enlightenment said, Suppose a bodhisattva-mahāsattva becomes a donor and can give food to ascetics, priests, or poor beggars who need food and food.",
        "source": "T08n0223_007:0272b06_6"
    },
    {
        "source_sentence": "須飲與飲，須衣與衣，臥具床榻房舍、香華瓔珞醫藥，種種所須資生之物，",
        "translation": "They need food and drink, clothing and bedding, bedding, beds, seats, dwellings, fragrant flowers, necklaces, medicines, and various necessities.",
        "source": "T08n0223_007:0272b08_7"
    },
    {
        "source_sentence": "若妻子國土、頭目手足支節等內外之物，盡以給施。",
        "translation": "If his wife, land, head, eyes, hands, feet, limbs, and other internal and external things are given to him, he gives them up in full.",
        "source": "T08n0223_007:0272b09_8"
    },
    {
        "source_sentence": "施時作是念：『我與彼取，我不慳貪。",
        "translation": "At the time of giving, he thinks, 'I give it to them and take it from them, not stingy or greedy.'",
        "source": "T08n0223_007:0272b11_9"
    },
    {
        "source_sentence": "我為施主，我能捨一切。",
        "translation": "I'm the donor, and I can abandon all of them.",
        "source": "T08n0223_007:0272b11_10"
    },
    {
        "source_sentence": "我隨佛教施，我行檀那波羅蜜。』",
        "translation": "I follow Buddhist generosity, and I practice the perfection of giving.'",
        "source": "T08n0223_007:0272b12_11"
    },
    {
        "source_sentence": "作是施已，用得法與一切眾生共之，迴向阿耨多羅三藐三菩提，念言：『是布施因緣，",
        "translation": "Having made this offering, they share the acquired teaching with all sentient beings and dedicate it back to unexcelled complete perfect enlightenment. They think, ‘This is the cause and condition for generosity.",
        "source": "T08n0223_007:0272b13_12"
    },
    {
        "source_sentence": "令眾生得今世樂，後當令得入涅槃樂。』",
        "translation": "It will cause sentient beings to attain the happiness of the present life, and later it will cause them to enter the happiness of nirvāṇa.'",
        "source": "T08n0223_007:0272b15_13"
    },
    {
        "source_sentence": "是人布施有三礙。",
        "translation": "That person's generosity has three hindrances.",
        "source": "T08n0223_007:0272b16_14"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T08n0223_007:0272b16_15"
    },
    {
        "source_sentence": "我相、他相、施相。",
        "translation": "The characteristic of self, the characteristic of others, and the characteristic of generosity.",
        "source": "T08n0223_007:0272b16_16"
    },
    {
        "source_sentence": "著是三相布施，是名世間檀那波羅蜜。",
        "translation": "To be attached to these three characteristics and give generosity is called the worldly perfection of giving.",
        "source": "T08n0223_007:0272b17_17"
    },
    {
        "source_sentence": "何因緣故名世間？",
        "translation": "What is the reason it is called worldly?",
        "source": "T08n0223_007:0272b18_18"
    },
    {
        "source_sentence": "於世間中不動不出，是名世間檀那波羅蜜。",
        "translation": "Not moving or not moving in the world is called the worldly perfection of giving.",
        "source": "T08n0223_007:0272b18_19"
    },
    {
        "source_sentence": "云何名出世間檀那波羅蜜？",
        "translation": "What's called the transmundane perfection of giving?",
        "source": "T08n0223_007:0272b19_20"
    },
    {
        "source_sentence": "所謂三分清淨。",
        "translation": "The so-called three parts are pure.",
        "source": "T08n0223_007:0272b20_21"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T08n0223_007:0272b20_22"
    },
    {
        "source_sentence": "菩薩摩訶薩布施時，我不可得、不見受者、施物不可得亦不望報，是名菩薩摩訶薩三分清淨檀那波羅蜜。",
        "translation": "When a bodhisattva-mahāsattva gives alms, I can't get it, don't see the recipient, give things that are given, and don't expect rewards, which is called the bodhisattva-mahāsattva's perfection of the three parts of the pure sandalwood perfection of giving.",
        "source": "T08n0223_007:0272b21_0"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0223_007:0272b23_1"
    },
    {
        "source_sentence": "菩薩摩訶薩布施時，施與一切眾生，眾生亦不可得。",
        "translation": "When bodhisattvas and mahāsattvas give alms, they give it to all sentient beings, and sentient beings can't get it either.",
        "source": "T08n0223_007:0272b23_2"
    },
    {
        "source_sentence": "以此布施迴向阿耨多羅三藐三菩提，乃至不見微細法相。",
        "translation": "Because of this generosity, they dedicate themselves back to unsurpassed, correct enlightenment and don't even see the subtle dharmas.",
        "source": "T08n0223_007:0272b25_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272b26_4"
    },
    {
        "source_sentence": "是名出世間檀那波羅蜜。",
        "translation": "This is called the supramundane perfection of giving.",
        "source": "T08n0223_007:0272b26_5"
    },
    {
        "source_sentence": "何以故名為出世間？",
        "translation": "Why is it called supramundane?",
        "source": "T08n0223_007:0272b27_6"
    },
    {
        "source_sentence": "於世間中能動能出，是故名出世間檀那波羅蜜。",
        "translation": "In the world, he's able to move and escape, which is why it's called the supramundane perfection of giving.",
        "source": "T08n0223_007:0272b27_7"
    },
    {
        "source_sentence": "尸羅波羅蜜有所依是名世間尸羅波羅蜜，無所依是為出世間尸羅波羅蜜。",
        "translation": "If the śīla-pāramitā has a basis, this is called the worldly śīla-pāramitā, and if there's no basis, this is the supramundane śīla-pāramitā.",
        "source": "T08n0223_007:0272b29_8"
    },
    {
        "source_sentence": "餘如檀那波羅蜜說。",
        "translation": "The rest are as explained in the perfection of giving.",
        "source": "T08n0223_007:0272c01_9"
    },
    {
        "source_sentence": "羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜、般若波羅蜜有所依是名世間，",
        "translation": "When the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of wisdom are supported, this is called the world.",
        "source": "T08n0223_007:0272c02_10"
    },
    {
        "source_sentence": "無所依是名出世間。",
        "translation": "The absence of a basis is called supramundane.",
        "source": "T08n0223_007:0272c04_11"
    },
    {
        "source_sentence": "餘亦如檀那波羅蜜中說。",
        "translation": "The rest are also as explained in the perfection of giving.",
        "source": "T08n0223_007:0272c04_12"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0223_007:0272c05_13"
    },
    {
        "source_sentence": "菩薩摩訶薩行六波羅蜜時淨菩薩道。」",
        "translation": "When bodhisattvas and mahāsattvas practice the six perfections, they purify the bodhisattva path.",
        "source": "T08n0223_007:0272c05_14"
    },
    {
        "source_sentence": "舍利弗問須菩提：「云何菩薩摩訶薩為阿耨多羅三藐三菩提道？」",
        "translation": "Śāriputra asked Subhūti, How does the bodhisattva Mahāsattva follow the path of unsurpassed, correct, and complete enlightenment?",
        "source": "T08n0223_007:0272c06_15"
    },
    {
        "source_sentence": "須菩提言：「四念處是菩薩摩訶薩為阿耨多羅三藐三菩提道，乃至八聖道分，",
        "translation": "Suppository of enlightenment said, The four abodes of mindfulness are the bodhisattva-mahāsattva's path to unsurpassed, correct, and complete enlightenment, up to the eightfold noble path.",
        "source": "T08n0223_007:0272c08_0"
    },
    {
        "source_sentence": "空解脫門、無相解脫門、無作解脫門，內空乃至無法有法空，一切三昧門、一切陀羅尼門，",
        "translation": "The door of liberation through emptiness, the door of liberation through signlessness, the door of liberation through nonconduct, the door of liberation through internal emptiness up to the emptiness of dharmas that have no characteristics, all the doors of concentration and all the doors of dhāraṇī teachings.",
        "source": "T08n0223_007:0272c09_1"
    },
    {
        "source_sentence": "佛十力、四無所畏、四無礙智、十八不共法、大慈大悲。",
        "translation": "The Buddha's ten powers, four fearlessnesses, four unhindered knowledges, 18 unique qualities, great kindness and compassion.",
        "source": "T08n0223_007:0272c11_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272c12_3"
    },
    {
        "source_sentence": "是名菩薩摩訶薩為阿耨多羅三藐三菩提道。」",
        "translation": "This is called the bodhisattva-mahāsattva's path of unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0272c13_4"
    },
    {
        "source_sentence": "爾時舍利弗讚須菩提言：「善哉，善哉！",
        "translation": "It was then that Śāriputra praised Subhūti, saying, Good, good!",
        "source": "T08n0223_007:0272c14_5"
    },
    {
        "source_sentence": "何等波羅蜜力？」",
        "translation": "What's the power of the perfection?",
        "source": "T08n0223_007:0272c15_6"
    },
    {
        "source_sentence": "須菩提言：「是般若波羅蜜力。",
        "translation": "Suppository said, This is the power of prajñā-pāramitā.",
        "source": "T08n0223_007:0272c15_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0223_007:0272c16_8"
    },
    {
        "source_sentence": "般若波羅蜜能生一切諸善法，若聲聞法、辟支佛法、菩薩法、佛法。",
        "translation": "The perfection of wisdom can give rise to all good qualities, whether they are the śrāvaka teachings, pratyekabuddha teachings, bodhisattva teachings, or buddha teachings.",
        "source": "T08n0223_007:0272c16_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272c17_10"
    },
    {
        "source_sentence": "般若波羅蜜能受一切諸善法，聲聞法、辟支佛法、菩薩法、佛法。",
        "translation": "The perfection of wisdom can receive all good qualities, the śrāvaka teachings, the pratyekabuddha teachings, the bodhisattva teachings, and the buddha teachings.",
        "source": "T08n0223_007:0272c17_11"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272c19_12"
    },
    {
        "source_sentence": "過去諸佛行般若波羅蜜得阿耨多羅三藐三菩提，未來諸佛亦行般若波羅蜜當得阿耨多羅三藐三菩提。",
        "translation": "In the past, the buddhas practiced prajñāpāramitā to attain unsurpassed, correct, and complete enlightenment, and in the future buddhas will also practice prajñāpāramitā to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0272c19_13"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272c22_14"
    },
    {
        "source_sentence": "今現在十方諸國土中諸佛亦行是般若波羅蜜得阿耨多羅三藐三菩提。",
        "translation": "Now, the buddhas in the lands of the ten directions also practice this prajñāpāramitā to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0272c22_15"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0272c24_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩聞說般若波羅蜜時不疑不難，當知是菩薩摩訶薩行菩薩道。",
        "translation": "If a bodhisattva-mahāsattva doesn't doubt or difficulty when he hears the teaching of the perfection of wisdom, you should know that this is the bodhisattva-mahāsattva who practices the bodhisattva path.",
        "source": "T08n0223_007:0272c24_1"
    },
    {
        "source_sentence": "行菩薩道者救一切眾生故，心不捨一切眾生。",
        "translation": "Because someone who practices the bodhisattva path saves all sentient beings, their mind doesn't abandon all sentient beings.",
        "source": "T08n0223_007:0272c26_0"
    },
    {
        "source_sentence": "以無所得故，是菩薩常應不離是念，所謂大悲念。」",
        "translation": "Because there's nothing to be gained, this bodhisattva should always not part with this thought, which is called great compassionate thought.",
        "source": "T08n0223_007:0272c27_1"
    },
    {
        "source_sentence": "舍利弗復問：「欲使菩薩摩訶薩常不離是念，所謂大悲念。",
        "translation": "Śāriputra again asked, I want to make sure that the bodhisattva Mahāsattva always doesn't part from this thought, which is called great compassionate thought.",
        "source": "T08n0223_007:0272c28_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩常不離大悲念，今一切眾生皆當作菩薩。",
        "translation": "If the bodhisattva Mahāsattva always doesn't part with great compassion, now all sentient beings will become bodhisattvas.",
        "source": "T08n0223_007:0272c29_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0273a02_4"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0273a02_5"
    },
    {
        "source_sentence": "一切眾生亦不離諸念故。」",
        "translation": "All sentient beings are also not free from thoughts.",
        "source": "T08n0223_007:0273a02_6"
    },
    {
        "source_sentence": "須菩提言：「善哉，善哉！",
        "translation": "Suppository said, Good, good!",
        "source": "T08n0223_007:0273a03_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0273a03_8"
    },
    {
        "source_sentence": "汝欲難我而成我義。",
        "translation": "You want to make it difficult for the self to become the meaning of self.",
        "source": "T08n0223_007:0273a03_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0273a04_10"
    },
    {
        "source_sentence": "眾生無故念亦無，眾生性無故念性亦無，眾生法無故念法亦無，眾生離故念亦離，",
        "translation": "Because sentient beings are nonexistent, thought also is nonexistent; because the nature of sentient beings is nonexistent, the nature of thought also is nonexistent; because sentient beings’ dharmas are nonexistent, thoughts and dharmas are also nonexistent; because sentient beings are free from them, thoughts are also free from them.",
        "source": "T08n0223_007:0273a04_11"
    },
    {
        "source_sentence": "眾生空故念亦空，眾生不可知故念亦不可知。",
        "translation": "Because sentient beings are empty, mindfulness is also empty, and because sentient beings are unknowable, mindfulness is also unknowable.",
        "source": "T08n0223_007:0273a06_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0273a07_13"
    },
    {
        "source_sentence": "色無故念亦無，色性無故念性亦無，色法無故念法亦無，色離故念亦離，",
        "translation": "Because matter is absent, thought also does not arise; because the nature of matter is absent, the nature of mindfulness also does not arise; because matter and factors are absent, thought also does not arise; because matter is absent, thought also is absent.",
        "source": "T08n0223_007:0273a07_14"
    },
    {
        "source_sentence": "色空故念亦空，色不可知故念亦不可知；",
        "translation": "Because matter is void, thought is also void; because matter is unknowable, thought is also unknowable.",
        "source": "T08n0223_007:0273a09_15"
    },
    {
        "source_sentence": "受想行識亦如是。",
        "translation": "So it is with feeling, perception, volition, and consciousness.",
        "source": "T08n0223_007:0273a10_16"
    },
    {
        "source_sentence": "眼乃至意，色乃至法，地種乃至識種，檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，",
        "translation": "The eye up to mind, form up to dharmas, the earth element up to the consciousness element, the perfection of mindfulness up to the perfection of prajñāpāramitā, internal emptiness up to the emptiness of nonexistent dharmas,",
        "source": "T08n0223_007:0273a10_17"
    },
    {
        "source_sentence": "四念處乃至十八不共法，一切三昧門、一切陀羅尼門，一切智、一切種智乃至阿耨多羅三藐三菩提無故念亦無，",
        "translation": "The four abodes of mindfulness up to the 18 unique qualities, all the approaches to samādhi and all the approaches to dhāraṇī, and all cognition, all kinds of cognition, and even unsurpassed, correct enlightenment are absent, so neither is mindfulness.",
        "source": "T08n0223_007:0273a13_18"
    },
    {
        "source_sentence": "乃至阿耨多羅三藐三菩提不可知故念亦不可知。",
        "translation": "Even when the unsurpassed, correct, and complete enlightenment is unknown, that mindfulness is also unknown.",
        "source": "T08n0223_007:0273a15_19"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0273a16_20"
    },
    {
        "source_sentence": "菩薩摩訶薩行是道，我欲使不離是念，所謂大悲念。」",
        "translation": "When bodhisattvas, mahāsattvas, and bodhisattvas practice this path, I want to make them not part from this thought, which is called great compassionate thought.",
        "source": "T08n0223_007:0273a17_21"
    },
    {
        "source_sentence": "爾時佛讚須菩提言：「善哉，善哉！",
        "translation": "It was then that the Buddha praised Subhūti, saying, Good, good!",
        "source": "T08n0223_007:0273a18_22"
    },
    {
        "source_sentence": "是菩薩摩訶薩般若波羅蜜，其有說者亦當如是說。",
        "translation": "This is the bodhisattva Mahāsattva's prajñāpāramitā, and anyone who teaches it will also teach it likewise.",
        "source": "T08n0223_007:0273a19_23"
    },
    {
        "source_sentence": "汝所說般若波羅蜜，皆是承佛意故。",
        "translation": "All of the prajñāpāramitā you teach is because it's in response to the Buddha's intention.",
        "source": "T08n0223_007:0273a20_24"
    },
    {
        "source_sentence": "菩薩摩訶薩學般若波羅蜜，應如汝所說學。」",
        "translation": "A bodhisattva-mahāsattva who trains in the perfection of wisdom should train as you've taught.",
        "source": "T08n0223_007:0273a21_25"
    },
    {
        "source_sentence": "須菩提說是般若波羅蜜品時，三千大千國土六種震動：東踊西沒，西踊東沒，",
        "translation": "When Subhūti taught this chapter of the Perfection of Wisdom, 3,000 great one-thousand lands shook in six ways:",
        "source": "T08n0223_007:0273a22_26"
    },
    {
        "source_sentence": "南踊北沒，北踊南沒，中踊邊沒，邊踊中沒。",
        "translation": "The south rises up and goes down to the north, the north rises up and goes down to the south, the middle rises up and goes down to the side, and the middle rises up and goes down to the side.",
        "source": "T08n0223_007:0273a24_27"
    },
    {
        "source_sentence": "爾時佛微笑。",
        "translation": "It was then that the Buddha smiled.",
        "source": "T08n0223_007:0273a25_28"
    },
    {
        "source_sentence": "須菩提白佛：「何因緣故笑？」",
        "translation": "Suppository said to the Buddha, What's the reason for laughing?",
        "source": "T08n0223_007:0273a25_29"
    },
    {
        "source_sentence": "佛告須菩提：「如我於此國土說般若波羅蜜，東方無量阿僧祇國土中諸佛亦為諸菩薩摩訶薩說般若波羅蜜，",
        "translation": "The Buddha told Subhūti, Suppose I were to teach the perfection of prajñāpāramitā in this land, and the buddhas in measureless incalculable lands in the east were to teach the perfection of prajñāpāramitā for the bodhisattvas and mahāsattvas.",
        "source": "T08n0223_007:0273a26_30"
    },
    {
        "source_sentence": "南西北方四維上下亦說是般若波羅蜜。",
        "translation": "The south, west, north, four directions, and up and down are also said to be the prajñāpāramitā.",
        "source": "T08n0223_007:0273a28_31"
    },
    {
        "source_sentence": "說是般若波羅蜜品時，十二那由他諸天人得無生法忍。",
        "translation": "When this chapter of the Perfection of Wisdom was taught, twelve nayutas attained the forbearance of the nonarising of the Dharma by gods and humans.",
        "source": "T08n0223_007:0273a29_32"
    },
    {
        "source_sentence": "十方諸佛說是般若波羅蜜時，無量阿僧祇眾生亦發阿耨多羅三藐三菩提心。」",
        "translation": "When the buddhas of the ten directions teach this prajñāpāramitā, measureless and incalculable sentient beings also give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0273b02_33"
    },
    {
        "source_sentence": "摩訶般若波羅蜜經問住品第二十七",
        "translation": "Mahāprajñāpāramitā-sūtra Questions and Answers on the Questions and Abode Chapter xxviii",
        "source": "T08n0223_007:0273b04_0"
    },
    {
        "source_sentence": "(丹本作天主品)",
        "translation": "(丹本作天主品)",
        "source": "T08n0223_007:0273b05_0"
    },
    {
        "source_sentence": "爾時三千大千世界諸四天王天等，各與無數百千億諸天俱來在會中。",
        "translation": "It was then that the four heavenly kings of the 3,000 great one-thousand worlds and so forth, each accompanied by innumerable hundreds of thousands of millions of gods, came to the assembly.",
        "source": "T08n0223_007:0273b06_0"
    },
    {
        "source_sentence": "三千大千世界諸釋提桓因等，諸忉利天、須夜摩天王等，諸夜摩天、兜率陀天王等，",
        "translation": "The 3,000 great one-thousand worlds of the Śakra Devānām-Indra gods, the Trāyastriṃśa gods, the Suyama heavenly kings, the Yama gods, the Tuṣita heavenly kings, and so forth",
        "source": "T08n0223_007:0273b07_1"
    },
    {
        "source_sentence": "諸兜率陀天、須涅蜜陀天王等，諸妙化天、婆舍跋提天王等，諸自在行天各與無數百千億諸天俱來在會中。",
        "translation": "The Tuṣita gods, the king of the Sunirmita Heaven and so forth, the marvelous transformation gods, the king of the Vaiśravaṇa heavens, and so forth, each of the self-manifesting gods came to the assembly with innumerable hundreds of thousands of millions of gods.",
        "source": "T08n0223_007:0273b09_2"
    },
    {
        "source_sentence": "三千大千世界諸梵天王等，乃至首陀婆諸天等，各與無數百千億諸天俱來在會中。",
        "translation": "The Brahma gods of the 3,000 great one-thousand worlds and so forth, as well as the gods of Sudarśana and so forth, each came to the assembly together with countless hundreds of thousands of millions of gods.",
        "source": "T08n0223_007:0273b12_3"
    },
    {
        "source_sentence": "是諸四天王天乃至首陀婆諸天，業報生身光明，於佛常光百分千分千萬億分不能及一，",
        "translation": "These bodies of the four heavenly kings and gods, as well as those of the Sudarśana gods, which are born by karmic retribution from their deeds cannot equal a hundredth, a thousandth, a millionth, or even one-thousandth [percent] of the Buddha’s eternal light.",
        "source": "T08n0223_007:0273b14_4"
    },
    {
        "source_sentence": "乃至不可以算數譬喻為比。",
        "translation": "It can't even be compared by calculating metaphors or metaphors.",
        "source": "T08n0223_007:0273b16_5"
    },
    {
        "source_sentence": "世尊光明最勝最妙最上第一，諸天業報光明在佛光邊不照不現，譬如燋柱比閻浮檀金。",
        "translation": "The Bhagavān's light is the most superior, marvelous, and supremely brilliant, and the gods' karmic retribution of light doesn't shine or show up when they're at the Buddha's side of their light, like a coarse pillar compared to the gold of Jambudvīpa.",
        "source": "T08n0223_007:0273b17_6"
    },
    {
        "source_sentence": "爾時釋提桓因白大德須菩提：「是三千大千世界諸四天王天乃至首陀婆諸天，",
        "translation": "It was then that Śakra Devānām-Indra said to the great virtuous Subhūti, These are the four heavenly kings of the 3,000 great one-thousand worlds and even the gods of Sudarśana Heaven.",
        "source": "T08n0223_007:0273b19_7"
    },
    {
        "source_sentence": "一切和合欲聽須菩提說般若波羅蜜義。",
        "translation": "All the people in the assembly want to hear Subhūti teach the meaning of the perfection of wisdom.",
        "source": "T08n0223_007:0273b21_8"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0273b22_9"
    },
    {
        "source_sentence": "菩薩摩訶薩云何應住般若波羅蜜中？",
        "translation": "How should bodhisattvas, mahāsattvas, abide in the perfection of wisdom?",
        "source": "T08n0223_007:0273b22_10"
    },
    {
        "source_sentence": "何等是菩薩摩訶薩般若波羅蜜？",
        "translation": "What's the prajñāpāramitā of the bodhisattva-mahāsattva?",
        "source": "T08n0223_007:0273b23_11"
    },
    {
        "source_sentence": "云何菩薩摩訶薩應行般若波羅蜜？」",
        "translation": "How should bodhisattvas and mahāsattvas practice the perfection of wisdom?",
        "source": "T08n0223_007:0273b24_12"
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「憍尸迦！",
        "translation": "Suppository said to Śakra Devānām-Indra, Kauśika!",
        "source": "T08n0223_007:0273b25_0"
    },
    {
        "source_sentence": "我今當承順佛意、承佛神力，為諸菩薩摩訶薩說般若波羅蜜。",
        "translation": "Now, I will follow the Buddha's wishes and inherit the Buddha's supernormal powers to explain the perfection of prajñā for the bodhisattvas, mahāsattvas, and buddhas.",
        "source": "T08n0223_007:0273b25_1"
    },
    {
        "source_sentence": "如菩薩摩訶薩所應住般若波羅蜜中，諸天子！",
        "translation": "Just as the bodhisattva Mahāsattva should abide in the perfection of wisdom, gods!",
        "source": "T08n0223_007:0273b27_2"
    },
    {
        "source_sentence": "今未發阿耨多羅三藐三菩提心者應當發心。",
        "translation": "Those who haven't yet aroused the mind of unsurpassed, correct, and complete enlightenment should now aroused it.",
        "source": "T08n0223_007:0273b28_3"
    },
    {
        "source_sentence": "諸天子若入聲聞正位，是人不能發阿耨多羅三藐三菩提心。",
        "translation": "If gods enter the rightful position of śrāvaka, that person can't give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0273b29_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0273c02_5"
    },
    {
        "source_sentence": "與生死作障隔故。",
        "translation": "It's because it's separated from birth and death as hindrances.",
        "source": "T08n0223_007:0273c02_6"
    },
    {
        "source_sentence": "是人若發阿耨多羅三藐三菩提心者，我亦隨喜。",
        "translation": "If that person gives rise to the mind of unsurpassed, correct, and complete enlightenment, I'll also rejoice.",
        "source": "T08n0223_007:0273c02_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0223_007:0273c03_8"
    },
    {
        "source_sentence": "上人應更求上法，我終不斷其功德。",
        "translation": "A superior person should also seek the higher Dharma, and I will never stop its merit.",
        "source": "T08n0223_007:0273c04_9"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0273c05_10"
    },
    {
        "source_sentence": "何等是般若波羅蜜？",
        "translation": "What's the perfection of wisdom?",
        "source": "T08n0223_007:0273c05_11"
    },
    {
        "source_sentence": "菩薩摩訶薩應薩婆若心，念色無常、念色苦、念色空、念色無我，念色如病、如敗癰瘡、如箭入身，",
        "translation": "“Great enlightening beings should think of form as impermanent, painful, empty, selfless, and like illnesses, or to think of form as the arrow that enters their bodies.",
        "source": "T08n0223_007:0273c05_12"
    },
    {
        "source_sentence": "痛惱衰壞憂畏不安，以無所得故。",
        "translation": "pain and distress, decay and disintegration, sorrow and fear are unsettled because there is nothing to be gained.",
        "source": "T08n0223_007:0273c08_0"
    },
    {
        "source_sentence": "受想行識亦如是。",
        "translation": "So it is with feeling, perception, volition, and consciousness.",
        "source": "T08n0223_007:0273c08_1"
    },
    {
        "source_sentence": "眼耳鼻舌身意，地種水火風空識種，觀無常乃至憂畏不安，是亦無所得故。",
        "translation": "The eye, ear, nose, tongue, body, and mind are the seeds of earth, water, fire, wind, air, space, and consciousness, observing impermanence and even grief and fear is also unobtainable.",
        "source": "T08n0223_007:0273c09_2"
    },
    {
        "source_sentence": "觀色寂滅離、不生不滅、不垢不淨，受想行識亦如是。",
        "translation": "Observing form that's quiescent and free, unarisen and unceasing, undefiled and impure, feeling, perception, volition, and consciousness are likewise.",
        "source": "T08n0223_007:0273c11_0"
    },
    {
        "source_sentence": "觀地種乃至識種寂滅離、不生不滅、不垢不淨，亦無所得故。",
        "translation": "It's because observing the seeds of earth and even the seeds of consciousness are extinguished, not arisen or ceased, and neither defiled nor pure, and there's nothing to be gained.",
        "source": "T08n0223_007:0273c12_1"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_007:0273c13_2"
    },
    {
        "source_sentence": "菩薩摩訶薩應薩婆若心，觀無明緣諸行，乃至老死因緣大苦聚集，亦無所得故。",
        "translation": "It's because the bodhisattva Mahāsattva observes the conditioned formations of nescience in response to the mind of sarvajña and observes that the causes and conditions of old age and death are greatly painful, and there's nothing to be gained.",
        "source": "T08n0223_007:0273c13_3"
    },
    {
        "source_sentence": "觀無明滅故諸行滅，乃至生滅故老死滅，老死滅故憂悲苦惱大苦聚滅，",
        "translation": "He observes the cessation of conditioned forces because ignorance ceases,... the cessation of old age and death because birth ceases,... the cessation of sorrow and misery because old age and death cease, and the extinction of great mass of suffering because old age and death cease.",
        "source": "T08n0223_007:0273c15_4"
    },
    {
        "source_sentence": "以無所得故。",
        "translation": "It's because there's nothing to be attained.",
        "source": "T08n0223_007:0273c17_5"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_007:0273c17_6"
    },
    {
        "source_sentence": "菩薩摩訶薩應薩婆若心，修四念處，以無所得故。",
        "translation": "The bodhisattva Mahāsattva should cultivate the four abodes of mindfulness with the mind of sarvajña because it's ungraspable.",
        "source": "T08n0223_007:0273c18_7"
    },
    {
        "source_sentence": "乃至修佛十力、十八不共法，以無所得故。",
        "translation": "It's because they cultivate the Buddha's ten powers and 18 distinctive qualities because they lack attainment.",
        "source": "T08n0223_007:0273c19_8"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_007:0273c20_9"
    },
    {
        "source_sentence": "菩薩摩訶薩應薩婆若心，行檀那波羅蜜，以無所得故。",
        "translation": "The bodhisattva Mahāsattva should practice the perfection of giving with the mind of sarvajña because he has nothing to attain.",
        "source": "T08n0223_007:0273c20_10"
    },
    {
        "source_sentence": "行尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪那波羅蜜，以無所得故。",
        "translation": "He practices the perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, and the perfection of meditation because he has nothing to attain.",
        "source": "T08n0223_007:0273c22_11"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_007:0273c23_12"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，作是觀：『但諸法諸法共相因緣潤益增長分別校計，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they contemplate thus:",
        "source": "T08n0223_007:0273c24_0"
    },
    {
        "source_sentence": "是中無我無我所，菩薩迴向心不在阿耨多羅三藐三菩提心中，阿耨多羅三藐三菩提心不在迴向心中，",
        "translation": "The mind of dedication of enlightening beings is not in the mind of unexcelled complete perfect enlightenment, and the mind of unexcelled complete perfect enlightenment is not in the mind of dedication.",
        "source": "T08n0223_007:0273c25_1"
    },
    {
        "source_sentence": "迴向心於阿耨多羅三藐三菩提心中不可得，阿耨多羅三藐三菩提心於迴向心中不可得。』",
        "translation": "The mind of dedication of merit is unobtainable in the mind of unsurpassed, correct enlightenment, and the mind of unsurpassed, correct enlightenment is unobtainable in the mind of dedication of merit.'",
        "source": "T08n0223_007:0273c28_2"
    },
    {
        "source_sentence": "菩薩雖觀一切法，亦無法可得，是名菩薩摩訶薩般若波羅蜜。」",
        "translation": "Although a bodhisattva observes all dharmas, they can't be obtained, and this is called the bodhisattva-mahāsattva prajñāpāramitā.",
        "source": "T08n0223_007:0274a01_3"
    },
    {
        "source_sentence": "釋提桓因問大德須菩提：「云何菩薩迴向心不在阿耨多羅三藐三菩提心中？",
        "translation": "Śakra Devānām-Indra asked the great virtuous Subhūti, How is the bodhisattva's dedication of mind not in the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T08n0223_007:0274a03_4"
    },
    {
        "source_sentence": "云何阿耨多羅三藐三菩提心不在迴向心中？",
        "translation": "How is it that the mind of unsurpassed, correct, and complete enlightenment isn't in the mind of dedication?",
        "source": "T08n0223_007:0274a04_5"
    },
    {
        "source_sentence": "云何迴向心於阿耨多羅三藐三菩提心中不可得？",
        "translation": "How is the mind of dedication of merit unobtainable in the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T08n0223_007:0274a06_0"
    },
    {
        "source_sentence": "云何阿耨多羅三藐三菩提心於迴向心中不可得？」",
        "translation": "How is the mind of unsurpassed, correct, and complete enlightenment unobtainable in the mind of dedication?",
        "source": "T08n0223_007:0274a07_1"
    },
    {
        "source_sentence": "須菩提語釋提桓因言：「憍尸迦！",
        "translation": "Suppository said to Śakra Devānām-Indra, Kauśika!",
        "source": "T08n0223_007:0274a08_2"
    },
    {
        "source_sentence": "迴向心、阿耨多羅三藐三菩提心非心是非心相，非心相中不可迴向。",
        "translation": "The mind that's directed back to the mind and the mind of unsurpassed, correct, and complete enlightenment are neither mind nor what's characterized as mind nor what's not mind, and they can't be directed back in what's not mind.",
        "source": "T08n0223_007:0274a09_3"
    },
    {
        "source_sentence": "是非心相常非心相，不可思議相常不可思議相，是名菩薩摩訶薩般若波羅蜜。」",
        "translation": "What's not the mark of mind is always what's not the mark of mind, and what's inconceivable is always what's inconceivable, which is called the bodhisattva-mahāsattva prajñāpāramitā.",
        "source": "T08n0223_007:0274a10_4"
    },
    {
        "source_sentence": "爾時佛讚須菩提言：「善哉，善哉！",
        "translation": "It was then that the Buddha praised Subhūti, saying, Good, good!",
        "source": "T08n0223_007:0274a12_5"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0223_007:0274a13_6"
    },
    {
        "source_sentence": "汝為諸菩薩摩訶薩說般若波羅蜜，安慰諸菩薩摩訶薩心。」",
        "translation": "Teach the prajñāpāramitā to the bodhisattvas and mahāsattvas, comforting the minds of the bodhisattvas and mahāsattvas.",
        "source": "T08n0223_007:0274a13_7"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0223_007:0274a15_8"
    },
    {
        "source_sentence": "我應報恩，不應不報恩。",
        "translation": "I should repay kindness, and I shouldn't fail to repay kindness.",
        "source": "T08n0223_007:0274a15_9"
    },
    {
        "source_sentence": "過去諸佛及諸弟子，為諸菩薩說六波羅蜜示教利喜，世尊爾時亦在中學得阿耨多羅三藐三菩提。",
        "translation": "In the past, the buddhas and their disciples taught the bodhisattvas the six perfections and showed them benefit and joy, and the Bhagavān then also attained unsurpassed, correct, and complete enlightenment in the middle school.",
        "source": "T08n0223_007:0274a16_10"
    },
    {
        "source_sentence": "我今亦當為諸菩薩說六波羅蜜示教利喜，令得阿耨多羅三藐三菩提。」",
        "translation": "Now, I will also explain the six perfections for the bodhisattvas and show them benefit and joy so that they attain supreme perfect enlightenment.",
        "source": "T08n0223_007:0274a18_11"
    },
    {
        "source_sentence": "爾時須菩提語釋提桓因言：「憍尸迦！",
        "translation": "It was then that Suppository said to Śakra Devānām-Indra, Kauśika!",
        "source": "T08n0223_007:0274a20_12"
    },
    {
        "source_sentence": "汝今當聽菩薩摩訶薩般若波羅蜜中，如所應住、所不應住。",
        "translation": "Now, you must listen to the bodhisattva Mahāsattva's prajñāpāramitā as it should or shouldn't be abiding.",
        "source": "T08n0223_007:0274a21_13"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0274a22_14"
    },
    {
        "source_sentence": "色色空，受想行識受想行識空。",
        "translation": "Form and form are empty, and feeling, perception, volition, consciousness, feeling, perception, volition, and consciousness are empty.",
        "source": "T08n0223_007:0274a22_15"
    },
    {
        "source_sentence": "菩薩菩薩空。",
        "translation": "The bodhisattvas and bodhisattvas are empty.",
        "source": "T08n0223_007:0274a23_16"
    },
    {
        "source_sentence": "是色空、菩薩空不二不別，受想行識空、菩薩空不二不別。",
        "translation": "These are form emptiness and bodhisattva emptiness that are neither two nor distinct, feeling, perception, volition, consciousness emptiness, and bodhisattva emptiness that are neither two nor distinct.",
        "source": "T08n0223_007:0274a23_17"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0274a25_18"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜中應如是住。",
        "translation": "The bodhisattva Mahāsattva should thus abide in the perfection of prajñāpāramitā.",
        "source": "T08n0223_007:0274a25_19"
    },
    {
        "source_sentence": "復次，眼眼空乃至意意空，菩薩菩薩空。",
        "translation": "Furthermore, the emptiness of the eye and eyelessness of the eye and even the emptiness of mind and thought are bodhisattva-bodhisattva emptiness.",
        "source": "T08n0223_007:0274a26_20"
    },
    {
        "source_sentence": "眼空乃至菩薩空不二不別。",
        "translation": "The emptiness of the eye and even the emptiness of bodhisattvas are not two and not distinct.",
        "source": "T08n0223_007:0274a27_21"
    },
    {
        "source_sentence": "六塵亦如是。",
        "translation": "So it is with the six dust motes.",
        "source": "T08n0223_007:0274a27_22"
    },
    {
        "source_sentence": "地種地種空，乃至識種識種空。",
        "translation": "The seeds of earth and the seeds of earth are emptiness, up to the seeds of consciousness and the seeds of consciousness are emptiness.",
        "source": "T08n0223_007:0274a28_23"
    },
    {
        "source_sentence": "菩薩菩薩空。",
        "translation": "The bodhisattvas and bodhisattvas are empty.",
        "source": "T08n0223_007:0274a28_24"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0274a29_25"
    },
    {
        "source_sentence": "地種空乃至識種空、菩薩空不二不別。",
        "translation": "The emptiness of the earth element and even the emptiness of the consciousness element are not two or different, and the emptiness of the bodhisattva is not two or different.",
        "source": "T08n0223_007:0274a29_26"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0274b01_27"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜中應如是住。",
        "translation": "The bodhisattva Mahāsattva should thus abide in the perfection of prajñāpāramitā.",
        "source": "T08n0223_007:0274b01_28"
    },
    {
        "source_sentence": "無明無明空，乃至老死老死空。",
        "translation": "The emptiness of nescience and nescience, up to the emptiness of old age, death, old age, and death.",
        "source": "T08n0223_007:0274b02_29"
    },
    {
        "source_sentence": "無明滅無明滅空，乃至老死滅老死滅空。",
        "translation": "The cessation of nescience ceases, the cessation of nescience ceases emptiness, and the cessation of old age and death ceases old age and death ceases emptiness.",
        "source": "T08n0223_007:0274b03_30"
    },
    {
        "source_sentence": "菩薩菩薩空。",
        "translation": "The bodhisattvas and bodhisattvas are empty.",
        "source": "T08n0223_007:0274b04_31"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0274b04_32"
    },
    {
        "source_sentence": "無明空乃至老死空，無明滅空乃至老死滅空，菩薩空不二不別。",
        "translation": "The emptiness of nescience up to the emptiness of old age and death, the emptiness of the cessation of nescience up to the emptiness of the cessation of old age and death, and the emptiness of bodhisattvas are not two and not distinct.",
        "source": "T08n0223_007:0274b04_33"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0274b06_34"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜中應如是住。",
        "translation": "The bodhisattva Mahāsattva should thus abide in the perfection of prajñāpāramitā.",
        "source": "T08n0223_007:0274b06_35"
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，",
        "translation": "The perfection of giving and so forth up to the perfection of wisdom, internal emptiness up to the emptiness of dharmas that don't exist, the four abodes of mindfulness up to the 18 unique qualities,",
        "source": "T08n0223_007:0274b07_36"
    },
    {
        "source_sentence": "一切三昧門、一切陀羅尼門，聲聞乘、辟支佛乘、佛乘，聲聞、辟支佛、菩薩、佛亦如是，",
        "translation": "So it is with all the teachings of concentration and all the teachings of dhāraṇī, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, the vehicle of the buddhas, and the vehicle of the buddhas; so it is with the vehicles of the śrāvakas, the pratyekabuddhas, the bodhisattvas, and the buddhas",
        "source": "T08n0223_007:0274b09_37"
    },
    {
        "source_sentence": "一切種智一切種智空。",
        "translation": "All kinds of cognition and all kinds of cognition are empty.",
        "source": "T08n0223_007:0274b10_38"
    },
    {
        "source_sentence": "菩薩菩薩空。",
        "translation": "The bodhisattvas and bodhisattvas are empty.",
        "source": "T08n0223_007:0274b11_39"
    },
    {
        "source_sentence": "一切種智空、菩薩空不二不別。",
        "translation": "The emptiness of all kinds of cognition and the emptiness of bodhisattvas are not two or different.",
        "source": "T08n0223_007:0274b11_40"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0223_007:0274b12_41"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜中應如是住。」",
        "translation": "A bodhisattva-mahāsattva should thus abide in the perfection of wisdom.",
        "source": "T08n0223_007:0274b12_42"
    },
    {
        "source_sentence": "爾時釋提桓因問須菩提：「云何般若波羅蜜中所不應住？」",
        "translation": "It was then that Śakra Devānām-Indra asked Subhūti, What shouldn't he abide in the perfection of wisdom?",
        "source": "T08n0223_007:0274b13_43"
    },
    {
        "source_sentence": "須菩提言：「憍尸迦！",
        "translation": "Suppository said, Kauśika!",
        "source": "T08n0223_007:0274b14_44"
    },
    {
        "source_sentence": "菩薩摩訶薩不應色中住。",
        "translation": "A bodhisattva-mahāsattva shouldn't abide in form.",
        "source": "T08n0223_007:0274b15_45"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274b15_46"
    },
    {
        "source_sentence": "不應受想行識中住。",
        "translation": "They shouldn't abide in feeling, perception, volition, and consciousness.",
        "source": "T08n0223_007:0274b16_47"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274b16_48"
    },
    {
        "source_sentence": "不應眼中住乃至不應意中住，不應色中住乃至不應法中住。",
        "translation": "They shouldn't abide in the eye or even in the mind, and they shouldn't abide in form or even in dharmas.",
        "source": "T08n0223_007:0274b17_49"
    },
    {
        "source_sentence": "眼識乃至意識，眼觸乃至意觸，眼觸因緣生受乃至意觸因緣生受中不應住。",
        "translation": "Consciousness of the eye and up to consciousness of the mind, visual contact and even mental contact, sensation that arises from the causes and conditions of visual contact or sensation that arise from the causes and conditions of mental contact shouldn't abide in.",
        "source": "T08n0223_007:0274b18_50"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274b20_51"
    },
    {
        "source_sentence": "地種乃至識種中不應住。",
        "translation": "They shouldn't abide in the earth-seed or even the consciousness-seed.",
        "source": "T08n0223_007:0274b20_52"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274b21_53"
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，四念處乃至十八不共法中不應住。",
        "translation": "The perfection of giving and the perfection of wisdom up to the perfection of prajñā, the four abodes of mindfulness up to the 18 distinctive qualities shouldn't abide.",
        "source": "T08n0223_007:0274b21_54"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274b23_55"
    },
    {
        "source_sentence": "須陀洹果中不應住。",
        "translation": "They shouldn't abide in the fruit of stream entry.",
        "source": "T08n0223_007:0274b23_56"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274b24_57"
    },
    {
        "source_sentence": "乃至阿羅漢果、辟支佛道、菩薩道、佛道、一切種智中不應住。",
        "translation": "It doesn't even abide in the fruit of the arhat, the path of the pratyekabuddha, the bodhisattva path, the Buddha path, or all kinds of cognition.",
        "source": "T08n0223_007:0274b24_58"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274b25_59"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_007:0274b26_60"
    },
    {
        "source_sentence": "菩薩摩訶薩，色是常不應住，色是無常不應住，受想行識亦如是。",
        "translation": "Bodhisattvas, mahāsattvas, form is permanent and shouldn't abide, form is impermanent and shouldn't abide, and so are feelings, perception, volition, and consciousness.",
        "source": "T08n0223_007:0274b26_61"
    },
    {
        "source_sentence": "色若樂若苦、若淨若不淨、若我若無我、若空若不空、若寂滅若不寂滅、若離若不離不應住。",
        "translation": "Whether form is pleasant or painful, pure or impure, self or selfless, empty or nonempty, tranquil or not, and neither separated nor not separated, it shouldn't abide.",
        "source": "T08n0223_007:0274b28_62"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274c01_63"
    },
    {
        "source_sentence": "受想行識亦如是。",
        "translation": "So it is with feeling, perception, volition, and consciousness.",
        "source": "T08n0223_007:0274c01_64"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_007:0274c01_65"
    },
    {
        "source_sentence": "菩薩摩訶薩，須陀洹果無為相、斯陀含果無為相、阿那含果無為相、阿羅漢果無為相不應住。",
        "translation": "The bodhisattva Mahāsattva should not abide in the unconditioned characteristics of the fruit of stream entry, the unconditioned characteristics of the fruit of once-returning, the unconditioned characteristics of the fruit of non-existence, the unconditioned characteristics of the fruit of non-existence, the unconditioned characteristics of the fruit of non-",
        "source": "T08n0223_007:0274c02_66"
    },
    {
        "source_sentence": "辟支佛道無為相、佛道無為相不應住。",
        "translation": "The pratyekabuddha's path has no marks, and the Buddha's path has no marks that shouldn't abide.",
        "source": "T08n0223_007:0274c04_67"
    },
    {
        "source_sentence": "須陀洹福田不應住，斯陀含、阿那含、阿羅漢、辟支佛、佛福田不應住。",
        "translation": "The field of merit of stream entry shouldn't abide, and the field of merit of once-returners, non-returners, arhats, pratyekabuddhas, and buddhas shouldn't abide.",
        "source": "T08n0223_007:0274c05_68"
    },
    {
        "source_sentence": "「復次，憍尸迦！",
        "translation": "Furthermore, Kauśika!",
        "source": "T08n0223_007:0274c06_69"
    },
    {
        "source_sentence": "菩薩摩訶薩初地中不應住。",
        "translation": "The bodhisattva Mahāsattva shouldn't abide in the first ground.",
        "source": "T08n0223_007:0274c07_70"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274c07_71"
    },
    {
        "source_sentence": "乃至十地中不應住，以有所得故。",
        "translation": "It should not abide up to in ten stages: because there is what is acquired.",
        "source": "T08n0223_007:0274c08_72"
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩住初發心中，我當具足檀那波羅蜜不應住。",
        "translation": "Furthermore, when the bodhisattva Mahāsattva abides in the first arousal of mind, I will be fully endowed with the perfection of the perfection of the perfection of giving and not abide there.",
        "source": "T08n0223_007:0274c09_0"
    },
    {
        "source_sentence": "乃至我當具足般若波羅蜜不應住。",
        "translation": "Even if I were to perfect the perfection of prajñā-pāramitā, I wouldn't abide.",
        "source": "T08n0223_007:0274c10_1"
    },
    {
        "source_sentence": "具足六波羅蜜當入菩薩位不應住。",
        "translation": "He who possesses the six perfections should enter the bodhisattva stage and not abide there.",
        "source": "T08n0223_007:0274c11_2"
    },
    {
        "source_sentence": "入菩薩位已當住阿惟越致地不應住。",
        "translation": "After entering the bodhisattva stage, he'll be abiding in the stage of abhidharma and won't abide there.",
        "source": "T08n0223_007:0274c12_3"
    },
    {
        "source_sentence": "菩薩當具足五神通不應住。",
        "translation": "A bodhisattva who possesses the five supernormal powers shouldn't abide.",
        "source": "T08n0223_007:0274c13_4"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274c14_0"
    },
    {
        "source_sentence": "菩薩住五神通已，我當遊無量阿僧祇佛國土，禮敬供養諸佛聽法，聽法已為他人說。",
        "translation": "After the bodhisattva abides in the five supernormal powers, I'll travel to measureless incalculable buddha-lands, venerate and make offerings to the buddhas who hear the teaching, and after listening to the teaching, I'll explain it to others.",
        "source": "T08n0223_007:0274c14_1"
    },
    {
        "source_sentence": "菩薩摩訶薩如是不應住，以有所得故。",
        "translation": "Thus, the bodhisattva Mahāsattva shouldn't abide because he has attained it.",
        "source": "T08n0223_007:0274c16_2"
    },
    {
        "source_sentence": "如諸佛國土嚴淨，我亦當莊嚴國土不應住。",
        "translation": "Just as the buddha-lands are adorned and pure, so too should I adorn my lands without dwelling in them.",
        "source": "T08n0223_007:0274c17_3"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274c18_4"
    },
    {
        "source_sentence": "成就眾生令入佛道不應住。",
        "translation": "They accomplish sentient beings so that they enter the Buddha Way and shouldn't abide.",
        "source": "T08n0223_007:0274c18_5"
    },
    {
        "source_sentence": "到無量阿僧祇國土諸佛所，尊重愛敬供養，以香華瓔珞澤香搗香、幢幡華蓋、百千億種寶衣供養諸佛不應住。",
        "translation": "They went to the buddhas of innumerable incalculable lands, honored and respected them, offered incense, flowers, necklaces, fragrant powders, banners, streamers, canopies, hundreds of thousands of millions of kinds of precious robes, and made offerings to the buddhas that they shouldn't stay.",
        "source": "T08n0223_007:0274c19_6"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0274c22_7"
    },
    {
        "source_sentence": "我當令無量阿僧祇眾生發阿耨多羅三藐三菩提心，如是菩薩不應住。",
        "translation": "I will cause measureless and incalculable sentient beings to give rise to the mind of unsurpassed, correct, and complete enlightenment, and such a bodhisattva shouldn't abide.",
        "source": "T08n0223_007:0274c22_8"
    },
    {
        "source_sentence": "我當生五眼——肉眼、天眼、慧眼、法眼、佛眼——不應住。",
        "translation": "I will give rise to five eyes - the physical eye, divine eye, wisdom eye, Dharma eye, and Buddha eye - which shouldn't abide.",
        "source": "T08n0223_007:0274c24_9"
    },
    {
        "source_sentence": "我當生一切三昧門不應住。",
        "translation": "I will give rise to all the samādhi-gates that shouldn't abide.",
        "source": "T08n0223_007:0274c25_10"
    },
    {
        "source_sentence": "隨所欲遊戲諸三昧不應住。",
        "translation": "He doesn't abide in any of the samādhis that he wants to play with.",
        "source": "T08n0223_007:0274c26_11"
    },
    {
        "source_sentence": "我當生一切陀羅尼門不應住。",
        "translation": "I will give rise to all the dhāraṇī teachings that shouldn't abide.",
        "source": "T08n0223_007:0274c26_12"
    },
    {
        "source_sentence": "我當得佛十力不應住。",
        "translation": "I will attain the Buddha's ten powers and won't abide.",
        "source": "T08n0223_007:0274c27_13"
    },
    {
        "source_sentence": "我當得四無所畏、四無礙智、十八不共法不應住。",
        "translation": "I will attain the four fearlessnesses, the four unhindered cognitions, and 18 distinctive qualities that shouldn't abide.",
        "source": "T08n0223_007:0274c28_14"
    },
    {
        "source_sentence": "我當具足大慈大悲不應住。",
        "translation": "I will be endowed with great kindness and compassion that shouldn't abide.",
        "source": "T08n0223_007:0274c29_15"
    },
    {
        "source_sentence": "我當具足三十二相不應住。",
        "translation": "I will be fully endowed with the thirty-two marks and won't abide.",
        "source": "T08n0223_007:0275a01_16"
    },
    {
        "source_sentence": "我當具足八十隨形好不應住。",
        "translation": "'I will be fully endowed with the eighty secondary forms and won't abide.'",
        "source": "T08n0223_007:0275a01_17"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0275a02_18"
    },
    {
        "source_sentence": "是八人是信行人、是法行人，如是不應住。",
        "translation": "These eight people are believers and Dharma practitioners, so they shouldn't abide like this.",
        "source": "T08n0223_007:0275a02_19"
    },
    {
        "source_sentence": "須陀洹極七世生不應住。",
        "translation": "The stream-winner at the end of seven worlds shouldn't abide in birth.",
        "source": "T08n0223_007:0275a03_20"
    },
    {
        "source_sentence": "家家不應住。",
        "translation": "A householder shouldn't live at home.",
        "source": "T08n0223_007:0275a04_21"
    },
    {
        "source_sentence": "須陀洹命終垢盡不應住。",
        "translation": "At the end of his life, Sudarśana's defilement is over and he shouldn't stay.",
        "source": "T08n0223_007:0275a04_22"
    },
    {
        "source_sentence": "須陀洹中間入涅槃不應住。",
        "translation": "He enters nirvāṇa in the midst of stream entry and shouldn't stay there.",
        "source": "T08n0223_007:0275a05_23"
    },
    {
        "source_sentence": "是人向斯陀含果證不應住。",
        "translation": "That person shouldn't abide until they realize the fruit of once-returning.",
        "source": "T08n0223_007:0275a06_24"
    },
    {
        "source_sentence": "是人斯陀含一來入涅槃不應住。",
        "translation": "That person's once-returner should enter nirvāṇa and not abide there.",
        "source": "T08n0223_007:0275a06_25"
    },
    {
        "source_sentence": "是人向阿那含果證不應住。",
        "translation": "That person shouldn't abide until they realize the fruit of non-returning.",
        "source": "T08n0223_007:0275a07_26"
    },
    {
        "source_sentence": "斯陀含一種不應住。",
        "translation": "There's one kind of once-returner who shouldn't abide.",
        "source": "T08n0223_007:0275a08_27"
    },
    {
        "source_sentence": "是人阿那含彼間入涅槃不應住。",
        "translation": "That person, non-returner, enters nirvāṇa elsewhere and shouldn't stay there.",
        "source": "T08n0223_007:0275a08_28"
    },
    {
        "source_sentence": "是人向阿羅漢果證不應住。",
        "translation": "That person is headed toward the realization of arhatship and shouldn't abide.",
        "source": "T08n0223_007:0275a09_29"
    },
    {
        "source_sentence": "是人阿羅漢今世入無餘涅槃不應住。",
        "translation": "That person or arhat enters nirvāṇa without remainder in the present life and shouldn't abide.",
        "source": "T08n0223_007:0275a10_30"
    },
    {
        "source_sentence": "是辟支佛不應住。",
        "translation": "This is a pratyekabuddha who shouldn't live.",
        "source": "T08n0223_007:0275a11_31"
    },
    {
        "source_sentence": "過聲聞、辟支佛地，我當住菩薩地不應住。",
        "translation": "If I go beyond the stages of śrāvakas and pratyekbuddhas, I'll abide in the bodhisattva stage and shouldn't.",
        "source": "T08n0223_007:0275a11_32"
    },
    {
        "source_sentence": "道種智中不應住。",
        "translation": "They shouldn't abide in the knowledge of the path.",
        "source": "T08n0223_007:0275a12_33"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0275a13_34"
    },
    {
        "source_sentence": "一切種、一切法知已，斷諸煩惱及習不應住。",
        "translation": "Having known all kinds and all dharmas, he stops the afflictions and accumulations that shouldn't abide.",
        "source": "T08n0223_007:0275a13_35"
    },
    {
        "source_sentence": "佛得阿耨多羅三藐三菩提當轉法輪不應住。",
        "translation": "When the Buddha attains supreme perfect enlightenment, he'll turn the wheel of the Dharma and won't abide.",
        "source": "T08n0223_007:0275a14_36"
    },
    {
        "source_sentence": "作佛事度無量阿僧祇眾生入涅槃不應住。",
        "translation": "They perform buddha-works to save measureless incalculable sentient beings who enter nirvāṇa and shouldn't abide.",
        "source": "T08n0223_007:0275a15_37"
    },
    {
        "source_sentence": "四如意足中不應住。",
        "translation": "Fourth, he shouldn't abide in the supernormal abilities.",
        "source": "T08n0223_007:0275a16_38"
    },
    {
        "source_sentence": "入是三昧住如恒河沙等劫壽不應住。",
        "translation": "He enters this samādhi and abides for an eon like the sands of the Ganges River, which shouldn't abide.",
        "source": "T08n0223_007:0275a17_39"
    },
    {
        "source_sentence": "我當得壽命無央數劫不應住。",
        "translation": "I will attain an immeasurable life span and won't abide for an incalculable number of eons.",
        "source": "T08n0223_007:0275a18_40"
    },
    {
        "source_sentence": "三十二相一一相百福莊嚴不應住。",
        "translation": "Each of the thirty-two marks shouldn't abide in the adornment of one hundred merits.",
        "source": "T08n0223_007:0275a19_41"
    },
    {
        "source_sentence": "我一世界如十方恒河沙等世界不應住。",
        "translation": "'My one world is like the sands of the Ganges River in the ten directions, and I shouldn't live there.'",
        "source": "T08n0223_007:0275a19_42"
    },
    {
        "source_sentence": "我三千大千世界純是金剛不應住。",
        "translation": "'The self of the 3,000 great one-thousand worlds is purely adamantine and shouldn't abide.'",
        "source": "T08n0223_007:0275a21_0"
    },
    {
        "source_sentence": "我菩提樹當出如是香，眾生聞者無有婬欲瞋恚愚癡，亦無聲聞、辟支佛心，",
        "translation": "My tree of enlightenment will produce such fragrance that when sentient beings hear it, they won’t have lust, anger, hatred, or folly, and they won’t have the minds of śrāvakas or pratyekbuddhas.",
        "source": "T08n0223_007:0275a21_1"
    },
    {
        "source_sentence": "是一切人必當得阿耨多羅三藐三菩提。",
        "translation": "All these people will surely attain supreme perfect enlightenment.",
        "source": "T08n0223_007:0275a23_2"
    },
    {
        "source_sentence": "若眾生聞是香者，身病意病皆悉除盡不應住。",
        "translation": "If sentient beings hear this fragrance, their physical and mental illnesses will all be completely removed and they won't abide.",
        "source": "T08n0223_007:0275a24_3"
    },
    {
        "source_sentence": "當使我世界中無有色受想行識名字不應住。",
        "translation": "'Should it be that there's no form, feeling, perception, volition, consciousness, or names in my world that shouldn't abide?'",
        "source": "T08n0223_007:0275a25_4"
    },
    {
        "source_sentence": "當使我世界中無有檀那波羅蜜名字乃至無有般若波羅蜜名字，當使我世界中無有四念處名字乃至無有十八不共法名字，",
        "translation": "You will cause my world to have no names for the transcendent name of giving or even for the transcendent name of wisdom, and you will cause my world to have no names for the four abodes of mindfulness or even for the eighteen unique qualities.",
        "source": "T08n0223_007:0275a26_5"
    },
    {
        "source_sentence": "亦無須陀洹名字乃至無有佛名字不應住。",
        "translation": "Nor are there the names of stream-winners or even the names of buddhas that shouldn't abide.",
        "source": "T08n0223_007:0275b01_6"
    },
    {
        "source_sentence": "以有所得故。",
        "translation": "It's because there's something to be attained.",
        "source": "T08n0223_007:0275b02_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0275b02_8"
    },
    {
        "source_sentence": "諸佛得阿耨多羅三藐三菩提時，一切諸法無所得故。",
        "translation": "When the buddhas attain supreme perfect enlightenment, all dharmas are ungraspable.",
        "source": "T08n0223_007:0275b02_9"
    },
    {
        "source_sentence": "如是，憍尸迦！",
        "translation": "So it is, Kauśika!",
        "source": "T08n0223_007:0275b04_0"
    },
    {
        "source_sentence": "菩薩於般若波羅蜜中不應住，以有所得故。」",
        "translation": "A bodhisattva shouldn't abide in the perfection of wisdom because there's something to attain.",
        "source": "T08n0223_007:0275b04_1"
    },
    {
        "source_sentence": "爾時舍利弗心念：「菩薩今云何應住般若波羅蜜中？」",
        "translation": "It was then that Śāriputra thought to himself, How should a bodhisattva now abide in the perfection of wisdom?",
        "source": "T08n0223_007:0275b05_2"
    },
    {
        "source_sentence": "須菩提知舍利弗心所念，語舍利弗言：「於汝意云何，諸佛何所住？」",
        "translation": "Knowing what Śāriputra thought, Suppository said to Śāriputra, What do you think, and where are the buddhas staying?",
        "source": "T08n0223_007:0275b06_3"
    },
    {
        "source_sentence": "舍利弗語須菩提：「諸佛法無有住處。",
        "translation": "Śāriputra said to Subhūti, There's no abiding place for the Buddha's teachings.",
        "source": "T08n0223_007:0275b08_4"
    },
    {
        "source_sentence": "諸佛不色中住，不受想行識中住，不有為性中住，不無為性中住，不四念處中住，",
        "translation": "“Buddhas abide in formlessness, they do not abide in feeling, perception, volition, or consciousness; they abide in the nature of non-conditioning; they don’t abide in the nature of non-conditioning; they don’t abide in the four abodes of mindfulness.",
        "source": "T08n0223_007:0275b09_5"
    },
    {
        "source_sentence": "乃至不十八不共法中住，不一切種智中住。」",
        "translation": "It doesn't abide in the 18 distinctive qualities and doesn't abide in all kinds of cognition.",
        "source": "T08n0223_007:0275b11_6"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T08n0223_007:0275b12_7"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜中應如是住。",
        "translation": "The bodhisattva Mahāsattva should thus abide in the perfection of prajñāpāramitā.",
        "source": "T08n0223_007:0275b12_8"
    },
    {
        "source_sentence": "如諸佛住，於諸法中非住非不住。",
        "translation": "Just as the buddhas abide, they don't abide or don't abide in dharmas.",
        "source": "T08n0223_007:0275b13_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0223_007:0275b14_10"
    },
    {
        "source_sentence": "菩薩摩訶薩般若波羅蜜中應如是學！",
        "translation": "Bodhisattvas, mahāsattvas, and bodhisattvas should thus train in the perfection of wisdom!",
        "source": "T08n0223_007:0275b14_11"
    },
    {
        "source_sentence": "我當住不住法故。」",
        "translation": "I will abide because I don't abide in the Dharma.",
        "source": "T08n0223_007:0275b15_12"
    },
    {
        "source_sentence": "爾時會中有諸天子作是念：「諸夜叉語言字句所說尚可了知，須菩提所說語言論議解釋般若波羅蜜了不可知。」",
        "translation": "It was then that the celestial beings in the assembly thought, The words and phrases of the yakṣas can still be understood, but the words and discussions explained by Subhūti explaining the prajñāpāramitā are unknown.",
        "source": "T08n0223_007:0275b15_13"
    },
    {
        "source_sentence": "須菩提知諸天子心所念，語諸天子：「不解不知耶？」",
        "translation": "Knowing what the gods thought in their minds, Suppository said to the gods, Don't you understand and know?",
        "source": "T08n0223_007:0275b18_14"
    },
    {
        "source_sentence": "諸天子言：「大德！",
        "translation": "The celestials said, Mañjuśrī!",
        "source": "T08n0223_007:0275b19_15"
    },
    {
        "source_sentence": "不解不知。」",
        "translation": "They don't understand and don't know.",
        "source": "T08n0223_007:0275b19_16"
    },
    {
        "source_sentence": "須菩提語諸天子：「汝等法應不知我無所論說，乃至我不說一字亦無聽者。",
        "translation": "Suppository said to the celestial beings, You shouldn't know that I don't discuss or explain anything, even if I don't say a single word, and there's no listener.",
        "source": "T08n0223_007:0275b20_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0223_007:0275b22_18"
    },
    {
        "source_sentence": "諸字非般若波羅蜜，般若波羅蜜中無聽者，諸佛阿耨多羅三藐三菩提無字無說。",
        "translation": "The words aren't the perfection of prajñā, and there's no listener in the perfection of prajñā, and the buddhas' unsurpassed, correct, and complete enlightenment has no words and no explanation.",
        "source": "T08n0223_007:0275b22_19"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T08n0223_007:0275b24_20"
    },
    {
        "source_sentence": "如佛化作化人，是化人復化作四部眾——比丘、比丘尼、優婆塞、優婆夷——化人於四部眾中說法。",
        "translation": "Just as the Buddha transforms people into transformed people, this transformation person further transforms four groups of people - monks, bhikṣuṇīs, upāsaka, and upāsikā - to transform people into teaching the Dharma among the four groups of people.",
        "source": "T08n0223_007:0275b24_21"
    },
    {
        "source_sentence": "於汝意云何，是中有說者、有聽者、有知者不？」",
        "translation": "What do you think, is there someone who teaches, someone who hears, and someone who knows?",
        "source": "T08n0223_007:0275b26_22"
    },
    {
        "source_sentence": "諸天子言：「不也，大德！」",
        "translation": "The celestial beings said, No, great virtuous one!",
        "source": "T08n0223_007:0275b27_23"
    },
    {
        "source_sentence": "須菩提言：「一切法皆如化，此中無說者、無聽者、無知者。",
        "translation": "Suppository of enlightenment said, All things are like apparitions, and here there's no speaker, no listener, and no knower.",
        "source": "T08n0223_007:0275b28_24"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T08n0223_007:0275b29_25"
    },
    {
        "source_sentence": "譬如人夢中見佛說法，於汝意云何，是中有說者、有聽者、有知者不？」",
        "translation": "It's like a person who sees the Buddha teaching in a dream and what do you think, 'Is there someone who teaches, someone who hears, or someone who knows?'",
        "source": "T08n0223_007:0275b29_26"
    },
    {
        "source_sentence": "諸天子言：「不也，大德！」",
        "translation": "The celestial beings said, No, great virtuous one!",
        "source": "T08n0223_007:0275c02_27"
    },
    {
        "source_sentence": "須菩提語諸天子：「一切諸法皆如夢，無說、無聽、無知者。",
        "translation": "Suppository said to the celestial beings, All dharmas are like dreams, which have no speaker, no listener, and no knower.",
        "source": "T08n0223_007:0275c02_28"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T08n0223_007:0275c04_29"
    },
    {
        "source_sentence": "譬如二人在大深澗，各住一面讚佛法眾，有二響出。",
        "translation": "It's like two people in a great deep valley, each standing to one side and praising the Buddha's teachings, with two sounds coming out.",
        "source": "T08n0223_007:0275c04_30"
    },
    {
        "source_sentence": "於諸天子意云何，是二響展轉相解不？」",
        "translation": "What do the gods think, are these two sounds mutually exclusive?",
        "source": "T08n0223_007:0275c05_31"
    },
    {
        "source_sentence": "諸天子言：「不也，大德！」",
        "translation": "The celestial beings said, No, great virtuous one!",
        "source": "T08n0223_007:0275c06_32"
    },
    {
        "source_sentence": "須菩提語諸天子：「一切法亦如是，無說、無聽、無知者。",
        "translation": "Suppository said to the celestials, So it is with all dharmas, which are not explained, not heard, and not known.",
        "source": "T08n0223_007:0275c07_33"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T08n0223_007:0275c08_34"
    },
    {
        "source_sentence": "譬如工幻師於四衢道中化作佛及四部眾，於中說法。",
        "translation": "It's like when a skilled illusionist transforms himself into a buddha and four groups of people in four paths to teach the Dharma there.",
        "source": "T08n0223_007:0275c08_35"
    },
    {
        "source_sentence": "於諸天子意云何，是中有說者、有聽者、有知者不？」",
        "translation": "What do the gods think, are there speakers, listeners, and knowers here?",
        "source": "T08n0223_007:0275c10_36"
    },
    {
        "source_sentence": "諸天子言：「不也，大德！」",
        "translation": "The celestial beings said, No, great virtuous one!",
        "source": "T08n0223_007:0275c11_37"
    },
    {
        "source_sentence": "須菩提語諸天子：「一切諸法如幻，無說者、無聽者、無知者。」",
        "translation": "Suppository said to the celestials, All dharmas are illusory, and there's no speaker, no listener, and no knower.",
        "source": "T08n0223_007:0275c11_38"
    },
    {
        "source_sentence": "爾時諸天子心念：「須菩提所說欲令易解，轉深轉妙。」",
        "translation": "It was then that the celestial beings thought to themselves, Suppose Subhūti explains what he teaches in order to make it easy to understand and become more profound and subtle.",
        "source": "T08n0223_007:0275c13_39"
    },
    {
        "source_sentence": "須菩提知諸天子心所念，語諸天子言：「色非深非妙，受想行識非深非妙。",
        "translation": "Knowing what the gods thought, Subhūti said to the gods, Form is neither profound nor marvelous, and feeling, perception, volition, and consciousness are neither profound nor marvelous.",
        "source": "T08n0223_007:0275c14_40"
    },
    {
        "source_sentence": "色性非深非妙，受想行識性非深非妙。",
        "translation": "The nature of form is neither profound nor subtle, and the nature of feeling, perception, volition, and consciousness is neither profound nor subtle.",
        "source": "T08n0223_007:0275c16_41"
    },
    {
        "source_sentence": "眼性乃至意性，色性乃至法性，眼界性乃至意界性，眼識乃至意識，眼觸乃至意觸，",
        "translation": "The nature of eye up to the nature of mind, the nature of matter up to the nature of dharmas, the nature of the eye realm up to the nature of the mind realm, the eye consciousness up to the mental consciousness, and the eye contact up to the touch of mind.",
        "source": "T08n0223_007:0275c17_42"
    },
    {
        "source_sentence": "眼觸因緣生受乃至意觸因緣生受。",
        "translation": "sensation that arises from the causes and conditions of visual contact... sensation that arises from the causes and conditions of mental contact...",
        "source": "T08n0223_007:0275c19_43"
    },
    {
        "source_sentence": "檀那波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，",
        "translation": "The perfection of giving and so forth up to the perfection of wisdom, internal emptiness up to the emptiness of dharmas that don't exist, the four abodes of mindfulness up to the 18 unique qualities,",
        "source": "T08n0223_007:0275c19_44"
    },
    {
        "source_sentence": "一切諸三昧門、一切諸陀羅尼門，乃至一切種智、一切種智性，非深非妙。」",
        "translation": "All the samādhi approaches, all the dhāraṇī approaches, and all the natures of all kinds of cognition and all kinds of cognition are neither profound nor subtle.",
        "source": "T08n0223_007:0275c21_45"
    },
    {
        "source_sentence": "諸天子復作是念：「是所說法中不說色，不說受想行識，不說眼乃至意觸因緣生受，",
        "translation": "Again, the celestial beings had this thought: These teachings do not speak of form. They do not speak of feeling, perception, volition, and consciousness. They do not speak of sensation that arises from the causes and conditions of eye contact or mental contact.",
        "source": "T08n0223_007:0275c23_46"
    },
    {
        "source_sentence": "不說檀那波羅蜜乃至般若波羅蜜，不說內空乃至無法有法空，不說四念處乃至十八不共法，",
        "translation": "They don't teach the perfection of giving and so forth up to the perfection of wisdom, don't teach internal emptiness up to the emptiness of dharmas that lack existence, and don't teach the four abodes of mindfulness up to the 18 distinctive qualities.",
        "source": "T08n0223_007:0275c25_47"
    },
    {
        "source_sentence": "不說陀羅尼門三昧門乃至一切種智，不說須陀洹果乃至阿羅漢果，不說辟支佛道，",
        "translation": "They don't teach the dhāraṇī teachings, the samādhi teachings, or all kinds of cognition; they don't teach the fruit of stream entry or even the fruit of arhatship; and they don't teach the path of the solitary realizers.",
        "source": "T08n0223_007:0275c27_48"
    },
    {
        "source_sentence": "不說阿耨多羅三藐三菩提道。",
        "translation": "They don't teach the path of unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0223_007:0275c29_49"
    },
    {
        "source_sentence": "是法中不說名字語言。」",
        "translation": "This is the teaching that doesn't speak names and words.",
        "source": "T08n0223_007:0276a01_50"
    },
    {
        "source_sentence": "須菩提知諸天子心所念，語諸天子言：「如是，如是！",
        "translation": "Knowing what the gods thought, Suppository said to the gods, So it is, so it is!",
        "source": "T08n0223_007:0276a02_0"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T08n0223_007:0276a03_1"
    },
    {
        "source_sentence": "是法中諸佛阿耨多羅三藐三菩提不可說相，是中無說者、無聽者、無知者。",
        "translation": "This is the ineffable characteristic of the buddhas' unsurpassed, correct, and complete enlightenment, which has no speaker, no listener, and no knower.",
        "source": "T08n0223_007:0276a03_2"
    },
    {
        "source_sentence": "以是故，諸天子！",
        "translation": "For this reason, celestial beings!",
        "source": "T08n0223_007:0276a05_3"
    },
    {
        "source_sentence": "善男子、善女人欲住須陀洹果欲證須陀洹果者，是人不離是忍。",
        "translation": "Good men and good women who want to abide in the fruit of stream entry and want to realize the fruit of stream entry, this person doesn't part from this forbearance.",
        "source": "T08n0223_007:0276a05_4"
    },
    {
        "source_sentence": "斯陀含、阿那含、阿羅漢果、辟支佛道、佛道，欲住欲證不離是忍。",
        "translation": "It's forbearance that the once-returner, nonreturner, arhatship, pratyekabuddha path, and buddha path want to abide, desire to realize, and don't part from it.",
        "source": "T08n0223_007:0276a07_5"
    },
    {
        "source_sentence": "如是，諸天子！",
        "translation": "So it is, my lords!",
        "source": "T08n0223_007:0276a08_6"
    },
    {
        "source_sentence": "菩薩摩訶薩從初發心般若波羅蜜中應作如是住，以無說無聽故。」",
        "translation": "From the first arousal of mind, bodhisattvas and mahāsattvas should thus abide in the perfection of wisdom because there's nothing to say and nothing to hear.",
        "source": "T08n0223_007:0276a08_7"
    },
    {
        "source_sentence": "◎摩訶般若經卷第七",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 7",
        "source": "T08n0223_007:0276a10_8"
    }
]