[
    {
        "source_sentence": "大明度經卷第五",
        "translation": "Daimingduo jing, vol. 5",
        "source": "T08n0225_005:0498a15_0"
    },
    {
        "source_sentence": "南吳月支國居士支謙譯",
        "translation": "Translated by Zhi Qian, a layman of Yuezhi state in the southern Wu",
        "source": "T08n0225_005:0498a17_0"
    },
    {
        "source_sentence": "遠離品善友品天帝釋品",
        "translation": "The Chapter on Divorcing, the Chapter on Good Friendship, the Chapter on Indra and the Chapter on Sakra",
        "source": "T08n0225_005:0498a18_0"
    },
    {
        "source_sentence": "貢高品學品守行品強弱",
        "translation": "weakness of the high-ranking class, the training class, and the strongness of the guarding class",
        "source": "T08n0225_005:0498a19_0"
    },
    {
        "source_sentence": "品累教品不盡品隨品",
        "translation": "class by class, teaching by class, inexhaustible by class, and following by class",
        "source": "T08n0225_005:0498a20_0"
    },
    {
        "source_sentence": "◎遠離品第十八",
        "translation": "The Eighteenth Chapter of Seclusion",
        "source": "T08n0225_005:0498a21_0"
    },
    {
        "source_sentence": "佛告善業：「夢中闓士大士不入應儀、緣一覺地，亦不教人入中。",
        "translation": "The Buddha told Shanye, In a dream, the bodhisattva Mahāprajñāpāramitā didn't enter the stage of response and conditioned single-eyedness, nor did he teach people to enter it.",
        "source": "T08n0225_005:0498a22_0"
    },
    {
        "source_sentence": "諸法夢中視，心志常在佛，當知是不退轉相。",
        "translation": "Seeing the teachings in a dream, his mind always focuses on the Buddha, and you should know that he doesn't turn away from them.",
        "source": "T08n0225_005:0498a23_1"
    },
    {
        "source_sentence": "夢中與若干百千弟子共會坐說經，與除饉眾相隨最在前，如來說經悉見，",
        "translation": "In the middle of the dream he sat together with several hundreds of thousands of his disciples and preached the scriptures. He was at the front of the assembly accompanied by the Licchavi Vimalakīrti, who all saw him expounding the doctrine.",
        "source": "T08n0225_005:0498a24_2"
    },
    {
        "source_sentence": "是不退轉闓士相。",
        "translation": "He doesn't retrogress from the characteristic of a gandharva.",
        "source": "T08n0225_005:0498a26_3"
    },
    {
        "source_sentence": "夢中在虛空中坐，為諸除饉說經，還自見七尺光，自在變化於餘處所作為，",
        "translation": "In a dream, he sat in space and taught the scripture to the gods. Then he saw for himself a ray of light seven feet in diameter, manifesting freely wherever he wished.",
        "source": "T08n0225_005:0498a26_4"
    },
    {
        "source_sentence": "如佛說經。",
        "translation": "It's like the Buddha who teaches the sūtras.",
        "source": "T08n0225_005:0498a28_5"
    },
    {
        "source_sentence": "夢中不恐不怖不畏難。",
        "translation": "In a dream, they aren't afraid, aren't frightened, and don't fear difficulties.",
        "source": "T08n0225_005:0498a28_6"
    },
    {
        "source_sentence": "若見郡縣其中兵起展轉相攻，水火之災，虎狼師子毒虫之害，見斬人首者，",
        "translation": "If they see soldiers coming and going to attack each other in the prefectures, or if they are struck by water or fire, or by tigers, wolves, lions, poisonous insects, or poisonous insects, or if they see someone beheaded.",
        "source": "T08n0225_005:0498b01_0"
    },
    {
        "source_sentence": "如是餘變，勤苦困窮飢渴者，視諸厄難悉作是見，其心不恐。",
        "translation": "Such are the other transformations, and those who are hungry and thirsty because of hardship and distress see all their difficulties and don't fear them in their minds.",
        "source": "T08n0225_005:0498b02_1"
    },
    {
        "source_sentence": "寤即起坐，念：『如夢中所見覩是三處，我作佛時，說經遍教。』",
        "translation": "He then rose from his seat and thought, 'It's like the three places that I saw in a dream. When I became a buddha, I taught the sūtras and universal teachings.'",
        "source": "T08n0225_005:0498b04_2"
    },
    {
        "source_sentence": "當知是不退轉相。",
        "translation": "You should know that it's the characteristic of nonretrogression.",
        "source": "T08n0225_005:0498b05_3"
    },
    {
        "source_sentence": "從何知是？",
        "translation": "How do we know this?",
        "source": "T08n0225_005:0498b05_4"
    },
    {
        "source_sentence": "闓士大士成作佛時，其境內一切無惡。",
        "translation": "When a bodhisattva becomes a buddha, there's nothing bad in his realm when he becomes a buddha.",
        "source": "T08n0225_005:0498b06_0"
    },
    {
        "source_sentence": "正是時，夢中若見畜生相食、人民疾疫。",
        "translation": "It's the right time, if he sees animals feeding each other and people suffering from epidemics in a dream.",
        "source": "T08n0225_005:0498b06_1"
    },
    {
        "source_sentence": "其心稍稍生念：『使我界中一切無惡。』",
        "translation": "That mind slightly gives rise to the thought, 'May all the things in my realm be without evil.'",
        "source": "T08n0225_005:0498b07_2"
    },
    {
        "source_sentence": "用是故知。",
        "translation": "Because of this, it's known.",
        "source": "T08n0225_005:0498b08_3"
    },
    {
        "source_sentence": "於夢中寤已，若見城郭火起時便作是念：『可於夢中可見是相。』",
        "translation": "After waking in a dream, if he sees a city that's on fire and thinks, 'This is the characteristic that can be seen in a dream.'",
        "source": "T08n0225_005:0498b08_4"
    },
    {
        "source_sentence": "見之不怖，用是相行具足，是為不退轉闓士。",
        "translation": "Seeing them without fear and being fully endowed with these characteristics and practices is called a man who doesn't turn away from it.",
        "source": "T08n0225_005:0498b10_5"
    },
    {
        "source_sentence": "今我審應是所向者，當無是異變。",
        "translation": "Now, I'll examine whether this should be the destination, and there won't be such a change.",
        "source": "T08n0225_005:0498b11_6"
    },
    {
        "source_sentence": "火起當滅，悉消去不復見。」",
        "translation": "When the fire arises, it will cease, and they'll all disappear and no longer be seen.",
        "source": "T08n0225_005:0498b12_0"
    },
    {
        "source_sentence": "佛言：「假令火即滅，知已於往佛受尊決矣。",
        "translation": "The Buddha said, Suppose he were to cause the fire to cease immediately, knowing that he's already accepted the honored decision from the past buddhas.",
        "source": "T08n0225_005:0498b12_1"
    },
    {
        "source_sentence": "假令火不滅，知未受決。",
        "translation": "Suppose the fire doesn't go out, knowing it hasn't yet been decided.",
        "source": "T08n0225_005:0498b13_2"
    },
    {
        "source_sentence": "設火神燒一舍，置一舍。",
        "translation": "Suppose the fire deity burns one dwelling and puts it in another.",
        "source": "T08n0225_005:0498b14_3"
    },
    {
        "source_sentence": "復起燒一里，置一里。",
        "translation": "Again, he rose up and burned one li and set it aside for one li.",
        "source": "T08n0225_005:0498b14_4"
    },
    {
        "source_sentence": "知其家人前世時斷經所致。",
        "translation": "Knowing what happened to his family in a previous life, he cut off the sūtras.",
        "source": "T08n0225_005:0498b15_5"
    },
    {
        "source_sentence": "斯人之等，所作悉自見，宿所作惡，於是悉除。",
        "translation": "All of these people saw for themselves what they had done, and whatever evil they had done in the past was then removed.",
        "source": "T08n0225_005:0498b15_6"
    },
    {
        "source_sentence": "從是來，斷經餘殃悉盡，知是未得不退轉。",
        "translation": "From then on, they'll stop the sūtras and all the other evils will be ended, knowing that they haven't yet attained nonretrogression.",
        "source": "T08n0225_005:0498b16_7"
    },
    {
        "source_sentence": "用是視，持是相，當為說令知之。",
        "translation": "Using this view and maintaining this characteristic, he'll explain it to them so they know it.",
        "source": "T08n0225_005:0498b17_8"
    },
    {
        "source_sentence": "或時男女為鬼神所取，作是念：『或我受決已，過去如來授我無上正真道，",
        "translation": "Sometimes a man or woman, seized by a spirit, thinks to herself, “Suppose I were to receive the prediction that in the past the Tathāgata taught me the supreme true path.",
        "source": "T08n0225_005:0498b18_9"
    },
    {
        "source_sentence": "所念悉淨，却應儀、緣一覺心，會當作佛。",
        "translation": "Their thoughts are all pure, but their responses and perceptions of the mind of one awakening arise in order to become buddhas.",
        "source": "T08n0225_005:0498b20_10"
    },
    {
        "source_sentence": "十方現在諸佛，無不知見證者。",
        "translation": "There are no buddhas in the ten directions who don't know and witness them.",
        "source": "T08n0225_005:0498b20_11"
    },
    {
        "source_sentence": "今如來悉知我所議念，鬼神當用我故去。",
        "translation": "Now, the Tathāgata knows exactly what I'm thinking, and the ghosts and spirits will use me to leave.",
        "source": "T08n0225_005:0498b21_12"
    },
    {
        "source_sentence": "不去者，未受決。』」",
        "translation": "Those who don't go there haven't received the ruling.'",
        "source": "T08n0225_005:0498b22_13"
    },
    {
        "source_sentence": "佛言：「其人審至誠者，弊邪往到前曰：『若本作是住，本字某，以受決。』",
        "translation": "The Buddha said, That person examines the sincerity of those who go before him, saying, 'If someone originally created this abode, their original name is so-and-so, and they'll accept the ruling.'",
        "source": "T08n0225_005:0498b22_14"
    },
    {
        "source_sentence": "欲以是語亂之。",
        "translation": "I want to disturb them with these words.",
        "source": "T08n0225_005:0498b24_15"
    },
    {
        "source_sentence": "闓士言：『我真已受決者，鬼神即當去。』",
        "translation": "The monk said, 'If I really have received the ruling, the ghosts and spirits will go.'",
        "source": "T08n0225_005:0498b24_16"
    },
    {
        "source_sentence": "邪神念曰：『我當使鬼去。』",
        "translation": "The evil spirits thought, 'I will send the ghost away.'",
        "source": "T08n0225_005:0498b25_17"
    },
    {
        "source_sentence": "鬼即去。",
        "translation": "The ghost then departed.",
        "source": "T08n0225_005:0498b26_18"
    },
    {
        "source_sentence": "所以然者，天邪極尊，有威靈力，鬼不敢當。",
        "translation": "The reason is that the gods are so greatly evil and extremely powerful that ghosts would not dare to obey them.",
        "source": "T08n0225_005:0498b26_19"
    },
    {
        "source_sentence": "闓士反念：『用我威神故去耳。』",
        "translation": "The monk then thought, 'With my authority, I'll go away.'",
        "source": "T08n0225_005:0498b27_20"
    },
    {
        "source_sentence": "便自貢高，輕易賢人，無所敬錄。",
        "translation": "He then prided himself in his loftiness and despised the wise man, who had no respect for him.",
        "source": "T08n0225_005:0498b28_21"
    },
    {
        "source_sentence": "言：『我於過去如來所受決已。』",
        "translation": "He said, 'I've accepted the ruling I received from the Tathāgata in the past.'",
        "source": "T08n0225_005:0498b28_22"
    },
    {
        "source_sentence": "自可貢高，反起瞋恚，更生罪念，當墮兩道。",
        "translation": "You may be arrogant and arrogant, but if you instead become angry and give rise to thoughts of guilt, you'll fall into two destinies.",
        "source": "T08n0225_005:0498b29_23"
    },
    {
        "source_sentence": "以不成為成，當覺邪為。",
        "translation": "If they don't become formed, they'll perceive what's wrong.",
        "source": "T08n0225_005:0498c01_24"
    },
    {
        "source_sentence": "捨善友去，為邪所困，當覺是事。",
        "translation": "When you abandon good friends and leave them, you'll be trapped by evil, and you'll realize this.",
        "source": "T08n0225_005:0498c01_25"
    },
    {
        "source_sentence": "邪反覆往說昔受決事，并七世父母中外示家姓子。",
        "translation": "Yiqiao repeatedly explained the past events that had been decided in the past, along with the seven worldly parents who showed their family name outside of their home.",
        "source": "T08n0225_005:0498c02_26"
    },
    {
        "source_sentence": "若在某國縣鄉生，今作是語，前世亦作是軟語。",
        "translation": "If someone is born in a certain country or prefecture and now says this, they'll also say soft words in a previous life.",
        "source": "T08n0225_005:0498c03_27"
    },
    {
        "source_sentence": "隨其人性行聰闇，吉凶窮達貴賤貧富，因扶獎跗言：『若前世亦爾。』",
        "translation": "According to their human nature and conduct, they're clever and dull-witted, hungry and poor in good fortune and bad fortune, and say, 'Suppose it were the same in a previous life.'",
        "source": "T08n0225_005:0498c04_28"
    },
    {
        "source_sentence": "闓士心念：『想我將爾。』",
        "translation": "The monk thought to himself, 'I'll think of you as me.'",
        "source": "T08n0225_005:0498c06_29"
    },
    {
        "source_sentence": "邪復言：『若已受決得不退轉。』",
        "translation": "Again, Vaiśravaṇa said, 'If you've received the decision to attain nonretrogression.'",
        "source": "T08n0225_005:0498c06_30"
    },
    {
        "source_sentence": "其人聞之，心大歡喜，自謂審然，便行形調輕易同學。",
        "translation": "When they heard this, their hearts rejoiced greatly. They thought to themselves, “This is a good omen.” So they dis­ patched their bodies and made it easy for the other students to do so.",
        "source": "T08n0225_005:0498c07_31"
    },
    {
        "source_sentence": "用是字故，便失其本行，墮邪網，用受是字，故不覺邪為，自謂得無上正真道。",
        "translation": "Because they use this word, they'll lose their original practice and fall into the web of error, and because they use it to receive this word, they won't perceive what's wrong and claim to have attained the unsurpassed true path.",
        "source": "T08n0225_005:0498c08_32"
    },
    {
        "source_sentence": "邪復言：『若作佛時，當字某。』",
        "translation": "Again, Yiqiao said, 'When you become a buddha, you'll be called'someone.'",
        "source": "T08n0225_005:0498c10_33"
    },
    {
        "source_sentence": "聞是名，心念言：『我得無然？",
        "translation": "When he heard this name, he thought to himself, 'Is it true that I attained it?'",
        "source": "T08n0225_005:0498c11_34"
    },
    {
        "source_sentence": "我生本有斯志。』」",
        "translation": "I was born with this intention in the past.'",
        "source": "T08n0225_005:0498c11_35"
    },
    {
        "source_sentence": "佛言：「是闓士於智中，少無變謀智慧，反作是念：『若邪天共作，是除饉為之所迷。』」",
        "translation": "The Buddha said, This is the kind of person who thinks, 'If wrong gods do it together, they'll be deluded by riding themselves of anger.'",
        "source": "T08n0225_005:0498c12_36"
    },
    {
        "source_sentence": "佛言：「我所署闓士，不教令作是念，遠離一切智，亡權德、遠大明，",
        "translation": "The Buddha said: I have instructed the Licchavi Vimalakīrti not to allow him to think like this. He is far removed from omniscience, has lost his power and virtue, and is far removed from great insight.",
        "source": "T08n0225_005:0498c14_37"
    },
    {
        "source_sentence": "釋賢友、信凶愚。",
        "translation": "Śākyamuni's good friend and faith is fierce and foolish.",
        "source": "T08n0225_005:0498c15_38"
    },
    {
        "source_sentence": "斯輩會墮兩道，若後久遠勤苦，乃復求佛耳。",
        "translation": "These people will fall into two paths in assembly, and if they go on to suffer for a long time, then they'll again seek the Buddha.",
        "source": "T08n0225_005:0498c15_39"
    },
    {
        "source_sentence": "用明度恩故，當自致作佛。」",
        "translation": "It's because of the kindness of using insight to save others that you will become a buddha yourself.",
        "source": "T08n0225_005:0498c16_40"
    },
    {
        "source_sentence": "佛言：「是時發意受是字時，不即覺悔，如是當墮兩道。",
        "translation": "The Buddha said, When he gives rise to the intention to receive this word, he doesn't immediately feel remorse, and thus he'll fall into two paths.",
        "source": "T08n0225_005:0498c17_41"
    },
    {
        "source_sentence": "若有除饉教重禁四事法，若復他事所犯、毀是禁，不成沙門、不為佛子。",
        "translation": "If someone were to remove the four grave prohibitions of sexual misconduct from the teaching, and if they violate them in other ways or disparage these prohibitions, they wouldn't become a monk or a son of the Buddha.",
        "source": "T08n0225_005:0498c18_42"
    },
    {
        "source_sentence": "是闓士言：『我於某國郡縣鄉生。』",
        "translation": "That monk said, 'I'm born in a certain country, prefecture, or township.'",
        "source": "T08n0225_005:0498c20_43"
    },
    {
        "source_sentence": "作是生念時，於除饉四事法，其罪最重。",
        "translation": "When he gives rise to this thought, the most serious offense is removing the four things that are debilitating.",
        "source": "T08n0225_005:0498c21_44"
    },
    {
        "source_sentence": "置是四事重法，是為五逆。",
        "translation": "These are the five heinous acts that constitute the four grave offenses.",
        "source": "T08n0225_005:0498c22_0"
    },
    {
        "source_sentence": "當意生念，受其字意信之，其罪太重。",
        "translation": "When he had this thought in his mind, he accepted the words and believed them, which was too serious a sin.",
        "source": "T08n0225_005:0498c22_1"
    },
    {
        "source_sentence": "當作是知。",
        "translation": "You should know it this way.",
        "source": "T08n0225_005:0498c23_2"
    },
    {
        "source_sentence": "用是字故，為邪入深罪。",
        "translation": "Because it uses this word, it's a profound sin to enter wrongly.",
        "source": "T08n0225_005:0498c23_3"
    },
    {
        "source_sentence": "邪復往作是語：『遠離法，正當爾，如來正覺所稱。』」",
        "translation": "Yiqi then went on to say, 'I'm far removed from the teaching, which is precisely what the Tathāgata, the perfectly enlightened one, calls it.'",
        "source": "T08n0225_005:0498c24_4"
    },
    {
        "source_sentence": "佛語善業：「我不作是說遠離，教闓士大士於樹間閑處止。」",
        "translation": "The Buddha said to Shanye, I won't explain this as seclusion by teaching the bodhisattva Mahāprajñāpāramitā to stay in a quiet place among trees.",
        "source": "T08n0225_005:0498c25_5"
    },
    {
        "source_sentence": "善業白言：「云何，天中天！",
        "translation": "Sunetra said, What's the god of gods!",
        "source": "T08n0225_005:0498c26_6"
    },
    {
        "source_sentence": "何所復有異遠離？」",
        "translation": "What else is there that's different and far removed?",
        "source": "T08n0225_005:0499a01_7"
    },
    {
        "source_sentence": "佛言：「正使各有應儀隨是行念，緣一覺隨是行念，各有闓士大士於城外行遠離，",
        "translation": "The Buddha said, Suppose each has the mindfulness of what's practiced in accordance with this practice and the mindfulness of what's practiced by a solitary realizer according to this practice, and each has a bodhisattva or great man outside the city who's walking away from it.",
        "source": "T08n0225_005:0499a01_8"
    },
    {
        "source_sentence": "一切惡不得犯。",
        "translation": "All evils mustn't be violated.",
        "source": "T08n0225_005:0499a03_9"
    },
    {
        "source_sentence": "若當於獨處樹間閑止，了行闓士大士法。",
        "translation": "Suppose you were to stay in a secluded place among trees and understand the practice of the bodhisattva's great man's teaching.",
        "source": "T08n0225_005:0499a03_10"
    },
    {
        "source_sentence": "我樂使作是行，不使遠行到絕無人處於中止。",
        "translation": "I'm happy to cause you to do so, but I won't allow you to travel far away from me and stop at nothing.",
        "source": "T08n0225_005:0499a04_11"
    },
    {
        "source_sentence": "持是遠離，當晝夜勤行，是故言：『行遠離當於城傍。』",
        "translation": "He maintains this seclusion and should diligently practice day and night, so he says, 'Should you practice seclusion by the side of the city?'",
        "source": "T08n0225_005:0499a05_12"
    },
    {
        "source_sentence": "我所說法如是。",
        "translation": "The teaching I teach is like this.",
        "source": "T08n0225_005:0499a06_13"
    },
    {
        "source_sentence": "爾時弊邪當往教行遠離法，語之：『若當於獨處樹間止，當作是行。』",
        "translation": "It's then that the bad man goes there to teach and practice, distances himself from the teaching, and says, 'If he stops at a tree by himself, he'll do so.'",
        "source": "T08n0225_005:0499a07_14"
    },
    {
        "source_sentence": "隨邪教，便亡遠離法。",
        "translation": "Following wrong teachings, they'll then lose their seclusion from the Dharma.",
        "source": "T08n0225_005:0499a08_15"
    },
    {
        "source_sentence": "邪語之言，道等耳，應儀、緣一覺等無異。」",
        "translation": "The words of wrong speech are called paths and so forth, and there's no difference between what's associated with the one awakening and what's conditioned by the same awakening.",
        "source": "T08n0225_005:0499a09_16"
    },
    {
        "source_sentence": "佛言：「是闓士所願未得，反隨其行。",
        "translation": "The Buddha said, That's because the Tathāgata hasn't yet attained what he wishes, so he follows his actions instead.",
        "source": "T08n0225_005:0499a10_17"
    },
    {
        "source_sentence": "於法中未了，反自用輕餘闓士，自貢高誰能過我者。",
        "translation": "He doesn't understand the teaching, but instead he despises himself as a crude person and blames himself for who can surpass me.",
        "source": "T08n0225_005:0499a10_18"
    },
    {
        "source_sentence": "輕城傍，明淨心所念，不入應儀、緣一覺法中住，所有惡不受，禪脫棄定，",
        "translation": "Being at the side of a light city, he clarifies what’s thought in his pure mind, doesn’t enter into the principles of response and relying on the teachings of the One Enlightened One, doesn’t accept evil that belongs to one enlightened person, and abandons concentration by meditating.",
        "source": "T08n0225_005:0499a12_19"
    },
    {
        "source_sentence": "於定中還得，所願悉具足度。」",
        "translation": "In the midst of meditation, he'll again attain what he wishes and be completely liberated.",
        "source": "T08n0225_005:0499a13_20"
    },
    {
        "source_sentence": "佛言：「其無變謀明慧闓士，正使在空澤中禽獸羅剎所不至處，百千万歲復過是，",
        "translation": "The Buddha said, That man of unchanging intellect and wisdom is exactly the same as if he were in an empty swamp where no birds or animals or rāṣṭrapālas would go for a hundred million years.",
        "source": "T08n0225_005:0499a14_21"
    },
    {
        "source_sentence": "不知遠離法，會無所益。",
        "translation": "They don't know that they're far removed from the Dharma, and their assembly is useless.",
        "source": "T08n0225_005:0499a16_22"
    },
    {
        "source_sentence": "邪便飛在虛空中立言：『善哉，善哉，是真遠離法，如來所說。",
        "translation": "The wicked one flew up into the sky and said: Good, good! This is indeed a teaching apart from reality that the Tathagata teaches.",
        "source": "T08n0225_005:0499a16_23"
    },
    {
        "source_sentence": "正當隨是遠離行，疾得無上正真道。』",
        "translation": "They should correctly follow this practice of seclusion and quickly attain the unsurpassed true path.'",
        "source": "T08n0225_005:0499a18_24"
    },
    {
        "source_sentence": "是人聞喜，便起到城傍，遠離成就有德高行，反輕言：『若所行法非。』」",
        "translation": "That person hears and rejoices, goes up to the city's side, becomes far removed from accomplishing virtuous and lofty actions, and instead despises them by saying, 'If what I'm doing is wrong.'",
        "source": "T08n0225_005:0499a18_25"
    },
    {
        "source_sentence": "佛言：「如是諸行者中，有正行呼非，反行呼是，不當敬者而敬之，當所敬者而恚慢之。",
        "translation": "The Buddha said, Thus, among these practitioners, there are those who correctly criticize what's wrong and reject what's right. Those who don't venerate them should venerate them, and those who should venerate them should be conceited.",
        "source": "T08n0225_005:0499a20_26"
    },
    {
        "source_sentence": "邪語是闓士言：『我行遠離。",
        "translation": "False speech is a deceitful person who says, 'I'm walking far away.",
        "source": "T08n0225_005:0499a22_27"
    },
    {
        "source_sentence": "有飛人來語我言：「善哉，善哉！」",
        "translation": "A flying man came and said to me, Good, good!",
        "source": "T08n0225_005:0499a22_28"
    },
    {
        "source_sentence": "審是遠離法，正當隨是行，我故來相語。",
        "translation": "I'm sure it's a practice that's far removed from the teaching, and I'll correctly follow it.",
        "source": "T08n0225_005:0499a23_29"
    },
    {
        "source_sentence": "若在城傍行，誰當來語若？』」",
        "translation": "If you're walking beside the city, who will come and tell you?'",
        "source": "T08n0225_005:0499a24_30"
    },
    {
        "source_sentence": "佛言：「闓士有德人而反輕之如是，當作是知。",
        "translation": "The Buddha said, This is how you should know that a wicked man of virtue despises someone like this.",
        "source": "T08n0225_005:0499a25_31"
    },
    {
        "source_sentence": "如擔死人種，無所中直，反呼是闓士有短，是為闓士怨家。",
        "translation": "It's like the kind of person who carries a dead burden and doesn't have anything straight in it, but instead calls out to this angry man with shortcomings, which is called a angry man's enemy.",
        "source": "T08n0225_005:0499a26_32"
    },
    {
        "source_sentence": "厭闓士高行，為天人大賊。",
        "translation": "They are disgusted with the arrogant practices of greedy men and become great thieves in heaven.",
        "source": "T08n0225_005:0499a27_33"
    },
    {
        "source_sentence": "正使如沙門被服處闓士之中，由亦是賊，無與從事交接言笑。",
        "translation": "It's just like when an ascetic is dressed and placed among the thieves, which are also thieves who don't exchange words or laughter with their servants.",
        "source": "T08n0225_005:0499a28_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0499a29_1"
    },
    {
        "source_sentence": "多瞋恚怒越，敗人好心。",
        "translation": "They are often angry and wicked, defeating people’s good intentions.",
        "source": "T08n0225_005:0499a29_2"
    },
    {
        "source_sentence": "當作是知。",
        "translation": "You should know it this way.",
        "source": "T08n0225_005:0499b01_3"
    },
    {
        "source_sentence": "所當護法，常自堅持，當淨其心，立心所狎，習當諦持，常當正心，畏怖勤苦處。",
        "translation": "The Dharma should be guarded, always insisting on self-control, purifying their minds, establishing what's detested in their minds, maintaining it with practice, always keeping it correctly, being fearful of the painful place of exertion.",
        "source": "T08n0225_005:0499b01_4"
    },
    {
        "source_sentence": "無得入彼壞器輩所在三處止。",
        "translation": "They won't be allowed to enter the three places where the broken container group is located.",
        "source": "T08n0225_005:0499b03_5"
    },
    {
        "source_sentence": "常當持慈心哀念，令安隱，愍傷之，自護所念：『使吾無生穢濁惡心，",
        "translation": "They should always maintain a compassionate attitude of pity and sympathy, enabling them to be peaceful and at ease. They should grieve for those who have been harmed by others and protect their own thoughts so that they will not give rise to foul-smelling bad thoughts.",
        "source": "T08n0225_005:0499b03_6"
    },
    {
        "source_sentence": "我設有不善，疾使棄之。』",
        "translation": "If there's unwholesomeness in me, I'll quickly abandon it.'",
        "source": "T08n0225_005:0499b05_7"
    },
    {
        "source_sentence": "是闓士大士所行極上。",
        "translation": "It's the supreme practice of a bodhisattva-mahāviṃśavartin.",
        "source": "T08n0225_005:0499b05_8"
    },
    {
        "source_sentence": "當作如是知。",
        "translation": "You should know it this way.",
        "source": "T08n0225_005:0499b06_9"
    },
    {
        "source_sentence": "善友品第十九",
        "translation": "Chapter 19 of the Good Friendship Sutra",
        "source": "T08n0225_005:0499b07_0"
    },
    {
        "source_sentence": "「復次，善業！",
        "translation": "Furthermore, good karma!",
        "source": "T08n0225_005:0499b08_0"
    },
    {
        "source_sentence": "闓士大士盛志，欲得無上正真道最正覺，當與善友從事，恭敬三尊。」",
        "translation": "A bodhisattva-mahāsattva with great aspiration wants to attain the unsurpassed true path and the most correct awakening, so he'll work with good friends and venerate the three honored ones.",
        "source": "T08n0225_005:0499b08_1"
    },
    {
        "source_sentence": "善業問：「善友當何以知？」",
        "translation": "Shanye asked, What should a good friend know?",
        "source": "T08n0225_005:0499b09_2"
    },
    {
        "source_sentence": "佛言：「有為人說明度無極者，教人入是定，是闓士大士善友。",
        "translation": "The Buddha said, A person who teaches the perfection of liberation to someone who teaches people to enter this concentration and teaches them to enter it is a good friend of the bodhisattva or great man.",
        "source": "T08n0225_005:0499b10_3"
    },
    {
        "source_sentence": "六度無極是善友，是善德，是護，是將，是去，如來最正覺，當來今現在十方無稱數佛剎如來，",
        "translation": "Good friend, good virtue, protection, general, and departure are the supremely enlightened buddhas of the ten directions. The buddhas of the ten directions will now become buddhas of incalculably many buddha-lands.",
        "source": "T08n0225_005:0499b11_4"
    },
    {
        "source_sentence": "皆從明成一切智道，用四事護眾生。",
        "translation": "They all follow the path of omniscience from insight and use four things to protect sentient beings.",
        "source": "T08n0225_005:0499b13_5"
    },
    {
        "source_sentence": "何等四？",
        "translation": "What are these four?",
        "source": "T08n0225_005:0499b14_6"
    },
    {
        "source_sentence": "一者布施，二者勸樂，三者饒益，四者等與。",
        "translation": "One is generosity, two are encouragement, three are benefits, and four are equally given.",
        "source": "T08n0225_005:0499b14_7"
    },
    {
        "source_sentence": "是為四德。",
        "translation": "These are the four virtues.",
        "source": "T08n0225_005:0499b15_8"
    },
    {
        "source_sentence": "為父母、為舍、為臺、為度、為自歸、為導，是故六度為眾生之度。",
        "translation": "For the sake of parents, for the sake of shelter, for the sake of a terrace, for the sake of salvation, for the sake of self-reliance, and for the sake of guidance, these six perfections are the salvations for sentient beings.",
        "source": "T08n0225_005:0499b15_9"
    },
    {
        "source_sentence": "闓士大士學六度，用眾生故，都欲斷其根，學明度相。",
        "translation": "Because they use sentient beings, they all want to cut off their faculties and train in the characteristics of liberation.",
        "source": "T08n0225_005:0499b17_10"
    },
    {
        "source_sentence": "何所是明度相？",
        "translation": "What is the characteristic of insight and liberation?",
        "source": "T08n0225_005:0499b18_11"
    },
    {
        "source_sentence": "無罣礙明度相，是相為得諸法。」",
        "translation": "The mark of unobstructed insight and liberation is the mark that obtains the dharmas.",
        "source": "T08n0225_005:0499b18_12"
    },
    {
        "source_sentence": "佛言：「如是無有相得明度，是所相得諸法。",
        "translation": "The Buddha said, Thus, there are no characteristics that attain insight and liberation, and these are the characteristics that attain dharmas.",
        "source": "T08n0225_005:0499b19_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0499b20_14"
    },
    {
        "source_sentence": "諸法各空，是相亦空，是為明度。」",
        "translation": "Each of the dharmas is empty, and these are characteristics that are also empty, which is called insight.",
        "source": "T08n0225_005:0499b20_15"
    },
    {
        "source_sentence": "善業問佛：「正使，天中天！",
        "translation": "Sunetra asked the Buddha, Exactly so, god of gods!",
        "source": "T08n0225_005:0499b21_16"
    },
    {
        "source_sentence": "諸法各空，何緣人民欲生無滅盡時？",
        "translation": "Each of the dharmas is empty, so why do people want to be born when they don't cease?",
        "source": "T08n0225_005:0499b21_17"
    },
    {
        "source_sentence": "空無增時亦無休息，各虛空無形。",
        "translation": "When emptiness doesn't increase, there's no resting, and each space has no form.",
        "source": "T08n0225_005:0499b22_18"
    },
    {
        "source_sentence": "無上正真道最正覺，不從是中。",
        "translation": "The unsurpassed true path of right awakening, the most correct awakening, doesn't follow this.",
        "source": "T08n0225_005:0499b23_19"
    },
    {
        "source_sentence": "各各虛空，不得無上正真道最正覺。",
        "translation": "Each of them is empty, and they won't attain the unsurpassed true path of the most perfect awakening.",
        "source": "T08n0225_005:0499b24_20"
    },
    {
        "source_sentence": "云何，天中天！",
        "translation": "How, god of gods!",
        "source": "T08n0225_005:0499b25_21"
    },
    {
        "source_sentence": "是法當何以知決？」",
        "translation": "How will this teaching be known and decided?",
        "source": "T08n0225_005:0499b25_22"
    },
    {
        "source_sentence": "佛言：「爾群生勤苦望，欲得是因致是，作是求。",
        "translation": "The Buddha said, All these sentient beings diligently and painstakingly hope that this is the cause for their desire to attain it, and they make this kind of request.",
        "source": "T08n0225_005:0499b25_23"
    },
    {
        "source_sentence": "爾見我得空不乎？」",
        "translation": "Do you see that I'll attain emptiness?",
        "source": "T08n0225_005:0499b26_24"
    },
    {
        "source_sentence": "善業言：「不，天中天！」",
        "translation": "Sunetra said, No, god of gods!",
        "source": "T08n0225_005:0499b27_25"
    },
    {
        "source_sentence": "佛言：「自作是得是，是空不？」",
        "translation": "The Buddha said, Is this self-manifesting what you get, or is it emptiness?",
        "source": "T08n0225_005:0499b27_26"
    },
    {
        "source_sentence": "對曰：「如空，天中天！」",
        "translation": "He replied, Like space, god of gods!",
        "source": "T08n0225_005:0499b28_27"
    },
    {
        "source_sentence": "佛言：「但用是故，若無解時？」",
        "translation": "The Buddha said, It's only for this reason that there's a time when there's no understanding?",
        "source": "T08n0225_005:0499b28_28"
    },
    {
        "source_sentence": "對曰：「如是，天中天！",
        "translation": "He replied, So it is, god of gods!",
        "source": "T08n0225_005:0499b29_29"
    },
    {
        "source_sentence": "極安隱人民欲得是、因致是，勤苦無休。」",
        "translation": "The people of utmost peace want to attain this, and the cause is this, and there's no rest for their pain and suffering.",
        "source": "T08n0225_005:0499b29_30"
    },
    {
        "source_sentence": "佛言：「人民所欲故便著。",
        "translation": "The Buddha said, People are attached because they want it.",
        "source": "T08n0225_005:0499c01_31"
    },
    {
        "source_sentence": "當作是知。",
        "translation": "You should know it this way.",
        "source": "T08n0225_005:0499c02_32"
    },
    {
        "source_sentence": "人民所生，本從是中無所取，無所取者不作是無，是無滅盡時無生增益者。",
        "translation": "What's produced by people who originally grasp nothing from this, and what's not grasped is nonexistent when they don't grasp anything, which means there's no arising or gaining when it ceases.",
        "source": "T08n0225_005:0499c02_33"
    },
    {
        "source_sentence": "作是曉知，是闓士大士求明度。」",
        "translation": "Doing so clearly knows that this is the kind of bodhisattva who seeks insight and liberation.",
        "source": "T08n0225_005:0499c04_34"
    },
    {
        "source_sentence": "善業白佛言：「闓士為不求五陰，作是知曉？",
        "translation": "Sunetra said to the Buddha, Suppose a monk doesn't seek the five aggregates, so he knows and awakens?",
        "source": "T08n0225_005:0499c04_35"
    },
    {
        "source_sentence": "為求明度？",
        "translation": "In order to seek liberation by insight?",
        "source": "T08n0225_005:0499c05_36"
    },
    {
        "source_sentence": "為悉等求？",
        "translation": "Why are they all equally sought after?",
        "source": "T08n0225_005:0499c06_0"
    },
    {
        "source_sentence": "諸應儀、緣一覺所不及。",
        "translation": "It's unmatched by the rituals and conditions for a single awakening.",
        "source": "T08n0225_005:0499c06_1"
    },
    {
        "source_sentence": "有德之人求巍巍之道，無能逮者，當作是行，晝夜疾近無上正真道最正覺。」",
        "translation": "A virtuous person seeks the majestic path, but there's no one who can grasp it; they should do so, and day and night they quickly approach the unsurpassed true path of perfect enlightenment.",
        "source": "T08n0225_005:0499c06_2"
    },
    {
        "source_sentence": "佛言：「云何，四天下群生都獲為人，當求無上正真，發意索佛道，各盡壽布施與無上正真道。",
        "translation": "The Buddha said, How is it that all the sentient beings in the four realms under heaven have become human beings who should seek the unsurpassed true path and arouse the intention to seek the Buddha's path, each giving alms for their whole lives and the unsurpassed true path?",
        "source": "T08n0225_005:0499c08_3"
    },
    {
        "source_sentence": "於善業意云何，其福寧多不？」",
        "translation": "What's the intention of good actions, and are their merits abundant?",
        "source": "T08n0225_005:0499c10_4"
    },
    {
        "source_sentence": "對曰：「甚多，天中天！」",
        "translation": "He replied, Very much so, god of gods!",
        "source": "T08n0225_005:0499c11_5"
    },
    {
        "source_sentence": "佛言：「得明度淨定守一日，如中教，作是念行，是福過彼。",
        "translation": "The Buddha said, If someone attains the purity of luminosity and liberation and observes it for one day, as instructed in the teaching, and does this kind of mindfulness and practice is more meritorious than that.",
        "source": "T08n0225_005:0499c11_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0499c12_7"
    },
    {
        "source_sentence": "眾生行無能及是慈者。",
        "translation": "The practice of sentient beings can't match this kind of kindness.",
        "source": "T08n0225_005:0499c13_0"
    },
    {
        "source_sentence": "斯高士深入智中，曉了是智悉具足，是世間勤苦，即興普慈，愍傷一切，",
        "translation": "This noble man, who had entered deeply into knowledge, understood that this knowledge was complete. Because of the world’s hardships and sufferings, he instantly aroused universal compassion to pity all living beings.",
        "source": "T08n0225_005:0499c13_1"
    },
    {
        "source_sentence": "道眼徹視見群生，成就具足高志，行無懈怠。",
        "translation": "The eye of enlightenment penetrates and sees all sentient beings, perfecting the fulfillment of high aspirations without laziness in their practice.",
        "source": "T08n0225_005:0499c15_2"
    },
    {
        "source_sentence": "以其不懈得是。",
        "translation": "It's because they don't tirelessly attain it.",
        "source": "T08n0225_005:0499c16_3"
    },
    {
        "source_sentence": "彼闓士弘慈普至，不以斯相住，亦不用餘住，其智大明，雖未住無上正真道，",
        "translation": "That brahman extends great compassion and universally arrives, doesn’t dwelling because of these characteristics, and doesn’t dwell in anything else. Although he hasn’t yet entered the supreme path of enlightenment, his knowledge and insight are so great that they cannot abide in any other abode.",
        "source": "T08n0225_005:0499c16_4"
    },
    {
        "source_sentence": "一切剎土皆共尊，舉正上真道終不還。",
        "translation": "All the buddha-lands are commonly honored, and they'll never return to the true path that's right upward.",
        "source": "T08n0225_005:0499c18_5"
    },
    {
        "source_sentence": "若受供養衣服、飯食、床臥、醫藥，是明度心其中立，所受施除去近一切智，",
        "translation": "If someone receives an offering of clothing, food and drink, a bed and bedding, or medicine, this is to explain the mind's liberation as they stand therein, and the gift that they receive removes them from their approach to omniscience.",
        "source": "T08n0225_005:0499c19_6"
    },
    {
        "source_sentence": "所食無罪，益於眾生悉示道住，無邊極處悉照明之，諸在牢獄中者悉度脫之，",
        "translation": "The food he eats is blameless, benefiting sentient beings and showing them the path to abide. He illumines all living beings in infinite boundless realms, liberating those who are imprisoned.",
        "source": "T08n0225_005:0499c20_7"
    },
    {
        "source_sentence": "示其道眼——隨是行、莫念相，莫作異念持短，入明度中高行莫懈。",
        "translation": "Show them the eye of enlightenment - follow this practice, don't think about characteristics, don't make different thoughts and maintain shortness, enter the middle of the path of insight, and don't lazy in high actions.",
        "source": "T08n0225_005:0499c22_8"
    },
    {
        "source_sentence": "譬如得明月珠已，復亡之。",
        "translation": "It's like the case where a bright moon pearl is obtained and then dies again.",
        "source": "T08n0225_005:0499c24_9"
    },
    {
        "source_sentence": "大愁毒坐，起憂念想。",
        "translation": "Sitting in great sorrow, he gave rise to thoughts of grief.",
        "source": "T08n0225_005:0499c24_10"
    },
    {
        "source_sentence": "如亡七寶，作是念：『云何我亡是寶？』",
        "translation": "Suppose someone loses seven treasures and thinks, 'How did I lose these treasures?'",
        "source": "T08n0225_005:0499c25_11"
    },
    {
        "source_sentence": "欲索珍寶者，常堅持心，無得失一切智。",
        "translation": "Those who want to search for treasure always hold fast to their minds, not losing omniscience.",
        "source": "T08n0225_005:0499c25_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0499c26_13"
    },
    {
        "source_sentence": "明度虛空亦不增減。」",
        "translation": "It's clear that liberating space doesn't increase or decrease, either.",
        "source": "T08n0225_005:0499c26_14"
    },
    {
        "source_sentence": "善業言：「虛空，云何闓士大士成就其行，近無上正真道？」",
        "translation": "Sunetra said, Space, how did the bodhisattva Mahāprajñāpāramitā accomplish his practice and approach the unsurpassed true path?",
        "source": "T08n0225_005:0499c27_15"
    },
    {
        "source_sentence": "佛言：「闓士大士亦不增不減。",
        "translation": "The Buddha said, Neither does the bodhisattva-mahāsattva increase nor decrease.",
        "source": "T08n0225_005:0499c28_16"
    },
    {
        "source_sentence": "經中說時，聞之不恐不怖。",
        "translation": "When the sūtras say this, they hear it and aren't afraid or frightened.",
        "source": "T08n0225_005:0499c29_17"
    },
    {
        "source_sentence": "當知是高士即為求明度矣。」",
        "translation": "You should know that this is a noble person who's seeking insight and liberation.",
        "source": "T08n0225_005:0499c29_18"
    },
    {
        "source_sentence": "善業言：「如是明度為空求乎？」",
        "translation": "Sunetra said, Is this the pursuit of luminosity and liberation for emptiness?",
        "source": "T08n0225_005:0500a01_19"
    },
    {
        "source_sentence": "佛言：「不也。」",
        "translation": "The Buddha said, No.",
        "source": "T08n0225_005:0500a02_20"
    },
    {
        "source_sentence": "「有離明度得耶？」",
        "translation": "Is there a way to attain freedom from insight?",
        "source": "T08n0225_005:0500a02_21"
    },
    {
        "source_sentence": "佛言：「不也。」",
        "translation": "The Buddha said, No.",
        "source": "T08n0225_005:0500a02_22"
    },
    {
        "source_sentence": "善業言：「以五陰求？」",
        "translation": "Sunetra said, Seeking with the five aggregates?",
        "source": "T08n0225_005:0500a03_23"
    },
    {
        "source_sentence": "佛言：「不也。」",
        "translation": "The Buddha said, No.",
        "source": "T08n0225_005:0500a03_24"
    },
    {
        "source_sentence": "又問：「離五陰頗有所求？」",
        "translation": "Again, he asked, Is there something to be sought apart from the five aggregates?",
        "source": "T08n0225_005:0500a03_25"
    },
    {
        "source_sentence": "佛言：「不也。」",
        "translation": "The Buddha said, No.",
        "source": "T08n0225_005:0500a04_26"
    },
    {
        "source_sentence": "善業言：「云何求大明？」",
        "translation": "Shanye said, How do you seek great insight?",
        "source": "T08n0225_005:0500a04_27"
    },
    {
        "source_sentence": "佛言：「若見是法，何所法求明度？」",
        "translation": "The Buddha said, If you see this teaching, what teaching does you seek to clarify?",
        "source": "T08n0225_005:0500a05_0"
    },
    {
        "source_sentence": "對曰：「不見，天中天！」",
        "translation": "He replied, Don't see it, god of gods!",
        "source": "T08n0225_005:0500a05_1"
    },
    {
        "source_sentence": "佛言：「云何，遍見是明度，何所闓士求之？」",
        "translation": "The Buddha said, What's the pervasive view that this is insight and liberation, and why would a wicked person seek it?",
        "source": "T08n0225_005:0500a06_2"
    },
    {
        "source_sentence": "對曰：「不見。」",
        "translation": "He replied, I don't see it.",
        "source": "T08n0225_005:0500a07_3"
    },
    {
        "source_sentence": "佛言：「設使遍見，法有所生處不？」",
        "translation": "The Buddha said, Suppose someone pervasively sees a place where dharmas are produced?",
        "source": "T08n0225_005:0500a07_4"
    },
    {
        "source_sentence": "對曰：「不見。」",
        "translation": "He replied, I don't see it.",
        "source": "T08n0225_005:0500a08_0"
    },
    {
        "source_sentence": "佛言：「是所闓士大士還得無所從生法樂，悉具足無所受決無上正真道最正覺，",
        "translation": "\\",
        "source": "T08n0225_005:0500a08_1"
    },
    {
        "source_sentence": "所至處無所復畏，悉作是護、是求、是行、是力，為還佛慧、極大慧、自在慧、一切智慧、如來慧。",
        "translation": "Wherever they go, they no longer fear anything, and they all do this as protection, this as seeking, this as practice, and this as power in order to return the Buddha's wisdom, great wisdom, unimpeded wisdom, omniscience, and the Tathāgata's wisdom.",
        "source": "T08n0225_005:0500a10_2"
    },
    {
        "source_sentence": "設作是，不得佛。」",
        "translation": "If you do so, you won't attain Buddhahood.",
        "source": "T08n0225_005:0500a12_3"
    },
    {
        "source_sentence": "佛言：「為有異。」",
        "translation": "The Buddha said, There's a difference.",
        "source": "T08n0225_005:0500a12_4"
    },
    {
        "source_sentence": "善業言：「設使諸法無所生，受決無上正真道？」",
        "translation": "Sunetra said, Suppose all dharmas don't arise, and they are subject to the unsurpassed true path of enlightenment?",
        "source": "T08n0225_005:0500a12_5"
    },
    {
        "source_sentence": "佛言：「不。」",
        "translation": "The Buddha said, No.",
        "source": "T08n0225_005:0500a13_6"
    },
    {
        "source_sentence": "善業言：「云何闓士大士得無上正真道？」",
        "translation": "Shanye said, How did the bodhisattva Mahāsthāmaprāpta attain the unsurpassed true path?",
        "source": "T08n0225_005:0500a14_7"
    },
    {
        "source_sentence": "佛言：「見所當受決者乎？」",
        "translation": "The Buddha said, Do you see the person who will receive the ruling?",
        "source": "T08n0225_005:0500a15_0"
    },
    {
        "source_sentence": "對曰：「不見法當作無上正真道。」",
        "translation": "He replied, They don't see the teaching and will cultivate the unsurpassed true path.",
        "source": "T08n0225_005:0500a15_1"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T08n0225_005:0500a16_2"
    },
    {
        "source_sentence": "諸法無從中得。",
        "translation": "The dharmas don't come from the middle.",
        "source": "T08n0225_005:0500a16_3"
    },
    {
        "source_sentence": "闓士不作是念：『持是法，當受決、不受決。』」",
        "translation": "A monk who doesn't think, 'If he maintains this teaching, he'll accept the decision or not accept the decision.'",
        "source": "T08n0225_005:0500a16_4"
    },
    {
        "source_sentence": "天帝釋品第二十",
        "translation": "Twenty-second Chapter of the Śakra Devānām-Indra",
        "source": "T08n0225_005:0500a18_0"
    },
    {
        "source_sentence": "釋於眾中白佛言：「甚深明度無極，難了難知。",
        "translation": "Śākyamuni said to the Buddha in the assembly, Profoundly insightful and infinite, it's difficult to understand and difficult to know.",
        "source": "T08n0225_005:0500a19_0"
    },
    {
        "source_sentence": "天人德大，值說斯定。",
        "translation": "The gods and humans are great in virtue, so they explain this concentration.",
        "source": "T08n0225_005:0500a20_0"
    },
    {
        "source_sentence": "聞之，書持學者，其福甚大。」",
        "translation": "When he hears it, the scholar who writes and retains it will have great merit.",
        "source": "T08n0225_005:0500a20_1"
    },
    {
        "source_sentence": "佛語釋：「閻浮提人民皆持十戒，悉具足持，是功德百千萬億倍，不如是善人聞明度書持學者。」",
        "translation": "The Buddha said in explanation, All the people of Jambudvīpa observe the ten precepts and fully uphold them, which is a hundred thousand times greater than the merit of a good person who hears wisdom and saves scholars who write and retain it.",
        "source": "T08n0225_005:0500a21_2"
    },
    {
        "source_sentence": "時，座中有一除饉語釋：「出卿上去已。」",
        "translation": "At the time, there was a monk in his seat who said, Go up after you leave.",
        "source": "T08n0225_005:0500a23_3"
    },
    {
        "source_sentence": "報言：「持心一念出我上，何況書持學，隨是法教，作是立者。",
        "translation": "He replied, With a single thought in his mind, he puts it above me, so why wouldn't he write and retain the teaching that follows this teaching of the Dharma and create such a establishment?",
        "source": "T08n0225_005:0500a24_0"
    },
    {
        "source_sentence": "明德踰三界群生之上，及至溝港、頻來、不還、應儀、緣一覺，復過是上。",
        "translation": "The virtue of insight surpasses the three realms above all sentient beings and goes up to the ditch, frequently comes, doesn't return, responds appropriately, and takes the single awakening as its condition, which is even higher than that.",
        "source": "T08n0225_005:0500a25_1"
    },
    {
        "source_sentence": "至闓士行布施、戒、忍、精進、禪度無極，若失明度及變謀明慧，亦復過其上。",
        "translation": "Even if a monk who practices generosity, precepts, forbearance, effort, and meditation without limit were to lose his insight and wisdom of transformation, he'd be even greater than that.",
        "source": "T08n0225_005:0500a26_2"
    },
    {
        "source_sentence": "闓士大士求明度狎習中行，天人鬼龍含毒凶[卄\\/(阿-可+辛)\\/女]終不能勝。",
        "translation": "The gandharvas and mahāsattvas seek insight to liberate themselves from the habituation of sexual misconduct, but gods, humans, ghosts, and dragons with poisonous [tan\\/(a-ka+sin)\\/women] can't overcome it.",
        "source": "T08n0225_005:0500a28_3"
    },
    {
        "source_sentence": "作是堅持，疾近一切智，不離如來，名佛坐不遠。",
        "translation": "Because of this insistence, he quickly approached omniscience and didn't part from the Tathāgata, which is called not far from where the Buddha was sitting.",
        "source": "T08n0225_005:0500a29_4"
    },
    {
        "source_sentence": "懈怠不生，為學佛，不學應儀、緣一覺法。",
        "translation": "Laziness doesn't arise because they want to train in the Buddha, and they don't train in the teachings of the One Vehicle or the principles of one enlightenment.",
        "source": "T08n0225_005:0500b02_0"
    },
    {
        "source_sentence": "四天王當往問訊。",
        "translation": "The four heavenly kings will go and greet him.",
        "source": "T08n0225_005:0500b02_1"
    },
    {
        "source_sentence": "疾學四部弟子，當於佛座作無上正真道，當作是學。",
        "translation": "A fast-moving disciple of the fourfold assembly should practice the unsurpassed true path at the Buddha's seat, and he should do so as a trainee.",
        "source": "T08n0225_005:0500b03_2"
    },
    {
        "source_sentence": "四天王常自往問訊，何況餘天子。」",
        "translation": "The four heavenly kings always go there to greet each other, so why wouldn't the other gods?",
        "source": "T08n0225_005:0500b04_3"
    },
    {
        "source_sentence": "阿難作是念：「是釋自持智說耶？",
        "translation": "Ānanda thought, Is this the explanation explained by Śākyamuni's own wisdom?",
        "source": "T08n0225_005:0500b05_4"
    },
    {
        "source_sentence": "持佛威神乎？」",
        "translation": "Is Does he maintain the Buddha's authoritative power?",
        "source": "T08n0225_005:0500b06_0"
    },
    {
        "source_sentence": "釋知阿難心所念，語阿難言：「持佛威神。」",
        "translation": "Knowing what Ānanda thought in his mind, Śākyamuni said to Ānanda, Uphold the Buddha's authoritative power.",
        "source": "T08n0225_005:0500b06_1"
    },
    {
        "source_sentence": "佛言：「是中，阿難！",
        "translation": "The Buddha said, Yes, Ānanda!",
        "source": "T08n0225_005:0500b07_2"
    },
    {
        "source_sentence": "或時闓士大士深念求學明度，三千國土中邪，一切皆悉愁毒，欲共壞亂，",
        "translation": "At other times the Licchavi ministers and laymen were deeply mindful of their pursuit of learning in order to achieve liberation through insight. In 3,000 different countries there were various evil deeds, but all of them were grieved and saddened, wishing to cause disorder together.",
        "source": "T08n0225_005:0500b07_3"
    },
    {
        "source_sentence": "使中道取證。」",
        "translation": "It causes the middle way to attain realization.",
        "source": "T08n0225_005:0500b09_4"
    },
    {
        "source_sentence": "貢高品第二十一",
        "translation": "The Twenty-first Chapter of the Sutra on the Cultivation of generosity",
        "source": "T08n0225_005:0500b10_0"
    },
    {
        "source_sentence": "佛告阿難：「闓士隨時各學明度無極，隨法行之。",
        "translation": "The Buddha told Ānanda, Each scholar of the Way always trains in the infinity of insight and liberation, practicing it according to the teaching.",
        "source": "T08n0225_005:0500b11_0"
    },
    {
        "source_sentence": "是時一佛界邪，各驚念言：『我使闓士中道得應儀，莫使得無上正真。』",
        "translation": "Each of them were frightened and said, 'I'll cause the middle way to attain proper conduct for the monks, so that they won't make themselves unsurpassed true.'",
        "source": "T08n0225_005:0500b12_1"
    },
    {
        "source_sentence": "弊邪見闓士習行明度，深為愁毒，四面放火，怖諸闓士念心一轉。」",
        "translation": "The harmful and mistaken views of the cowherd are cultivated with insight and liberation, deeply grieved, set on fire in all directions, and frightened by the cowherd's thoughts one by one.",
        "source": "T08n0225_005:0500b13_2"
    },
    {
        "source_sentence": "佛言：「邪不身遍行亂。",
        "translation": "The Buddha said, What's wrong is not the pervasive confusion of body and mind.",
        "source": "T08n0225_005:0500b15_0"
    },
    {
        "source_sentence": "闓士若遠離善師，為邪所亂愁毒。",
        "translation": "If a licentious person is far removed from good teachers, they'll be disturbed by wrongdoing and grieved.",
        "source": "T08n0225_005:0500b15_1"
    },
    {
        "source_sentence": "以不深解明度，心狐疑念：『有之？",
        "translation": "Because they don't deeply understand the luminous liberation, their minds doubt and think, 'Is there it?'",
        "source": "T08n0225_005:0500b16_2"
    },
    {
        "source_sentence": "無乎？",
        "translation": "Is it not?",
        "source": "T08n0225_005:0500b17_0"
    },
    {
        "source_sentence": "昔所翫習而今惡聞，或結不知，將以何緣守明度乎？』",
        "translation": "What's the reason for guarding insight and liberation that you used to practice in the past but now badly hear, or maybe you didn't know it?'",
        "source": "T08n0225_005:0500b17_1"
    },
    {
        "source_sentence": "疑網自蔽，邪得其便，教餘闓士言：『若用是為寫學，我尚不了其事，",
        "translation": "Having been hindered by the web of doubt, he got an advantage over others and said to the brahmans, “If you use this as a way of learning, I will not understand.",
        "source": "T08n0225_005:0500b18_2"
    },
    {
        "source_sentence": "若能了乎？』",
        "translation": "If you can understand it?'",
        "source": "T08n0225_005:0500b19_3"
    },
    {
        "source_sentence": "自言所行是，若所行非，所為顛倒。",
        "translation": "If what he does is not what he does, then what he does is mistaken.",
        "source": "T08n0225_005:0500b20_4"
    },
    {
        "source_sentence": "用是故，其人在地獄、禽獸、餓鬼中，其罪日增。",
        "translation": "Because of this, that person's sin increases day by day among hells, animals, and hungry ghosts.",
        "source": "T08n0225_005:0500b20_5"
    },
    {
        "source_sentence": "如是邪大歡喜。",
        "translation": "Thus, they're wrong and greatly joyful.",
        "source": "T08n0225_005:0500b21_6"
    },
    {
        "source_sentence": "若闓士與行應儀道諍，又與闓士共諍，時邪言兩，離佛遠矣。",
        "translation": "If a tathāgata and practitioner engage in sexual misconduct, or if they engage in sexual misconduct together with a tathāgata, then there are two kinds of wrong speech, which are far removed from the Buddha.",
        "source": "T08n0225_005:0500b22_7"
    },
    {
        "source_sentence": "若未得不退轉闓士與不退轉諍，隨念恚恨，心一轉念，轉却一劫，雖有是惡，",
        "translation": "If someone who hasn’t yet attained non-backsliding lust and non-backsliding anger arouses resentment with each other, and one thought is turned away from it for an eon, even though this is bad.",
        "source": "T08n0225_005:0500b23_8"
    },
    {
        "source_sentence": "不捨一切智。",
        "translation": "They don't abandon all cognition.",
        "source": "T08n0225_005:0500b25_9"
    },
    {
        "source_sentence": "劫數無極，始當從初發意起。」",
        "translation": "The number of eons is limitless, and it will begin to arise from the first arousal of mind.",
        "source": "T08n0225_005:0500b25_10"
    },
    {
        "source_sentence": "阿難白佛言：「心所念惡，寧可悔不？",
        "translation": "Ānanda said to the Buddha: Whatever evil thoughts I have in my mind, how can I repent?",
        "source": "T08n0225_005:0500b26_11"
    },
    {
        "source_sentence": "乃當却就爾所劫？」",
        "translation": "Will you go on to such an eon?",
        "source": "T08n0225_005:0500b26_12"
    },
    {
        "source_sentence": "佛言：「我法廣大，可得悔。",
        "translation": "The Buddha said, My teaching is so vast that I can repent.",
        "source": "T08n0225_005:0500b27_13"
    },
    {
        "source_sentence": "若闓士念惡有恨，又喜以教彼，斯人不可使悔也。",
        "translation": "If a greedy person is mindful of evil and hates it and delights in teaching it to others, that person can't be made to repent.",
        "source": "T08n0225_005:0500b27_14"
    },
    {
        "source_sentence": "誤有恚罵，即慚悔過：『我當為十方人作橋梁，令得泥洹。",
        "translation": "Having been wrongly abused, he felt ashamed and repented, saying, 'I will build a bridge for the people of the ten directions so that they can attain nirvāṇa.",
        "source": "T08n0225_005:0500b29_15"
    },
    {
        "source_sentence": "寧可有惡意與人諍耶？",
        "translation": "How could there be a dispute with someone with bad intentions?",
        "source": "T08n0225_005:0500c01_16"
    },
    {
        "source_sentence": "當如啞羊諸惡忍之。』",
        "translation": "You must be like a dumb sheep that tolerates bad things.'",
        "source": "T08n0225_005:0500c01_17"
    },
    {
        "source_sentence": "心不當起恚為應儀道者。」",
        "translation": "The mind shouldn't give rise to anger as a follower of the path.",
        "source": "T08n0225_005:0500c02_18"
    },
    {
        "source_sentence": "阿難白佛言：「闓士大士與相共止，法當云何？」",
        "translation": "Ānanda said to the Buddha, What's the teaching for a bodhisattva and a great man to stop together?",
        "source": "T08n0225_005:0500c03_0"
    },
    {
        "source_sentence": "佛言：「相視當如視佛。",
        "translation": "The Buddha said, You should look at each other as you look at the Buddha.",
        "source": "T08n0225_005:0500c04_0"
    },
    {
        "source_sentence": "心念，當言：『共一師、一船、一道，彼所學，我亦當學。』",
        "translation": "Mindful, you should say, 'Together with one teacher, one boat, and one path, I will also train what they teach.'",
        "source": "T08n0225_005:0500c04_1"
    },
    {
        "source_sentence": "欲喜應儀、緣一覺道者，不與同願；",
        "translation": "Those who wish to delight in the path of one form of enlightenment but do not share the same vow.",
        "source": "T08n0225_005:0500c05_2"
    },
    {
        "source_sentence": "其有忍苦欲求佛者，當與相隨。",
        "translation": "Those who tolerate suffering and want to seek the Buddha will be accompanied by them.",
        "source": "T08n0225_005:0500c06_3"
    },
    {
        "source_sentence": "若此為一法學也。」",
        "translation": "If this is a single dharma-learning, then...",
        "source": "T08n0225_005:0500c07_4"
    },
    {
        "source_sentence": "學品第二十二",
        "translation": "The Twenty-second Chapter of the Teaching",
        "source": "T08n0225_005:0500c08_0"
    },
    {
        "source_sentence": "善業白佛言：「闓士學無常，為學一切智？",
        "translation": "Sunetra said to the Buddha, You're training in impermanence, so why would you train in omniscience?",
        "source": "T08n0225_005:0500c09_0"
    },
    {
        "source_sentence": "學無所生、學去婬妷、學滅度，為學一切智？」",
        "translation": "Do you train in the absence of anything that arises, train in the removal of anger, and train in cessation for the sake of training in omniscience?",
        "source": "T08n0225_005:0500c09_1"
    },
    {
        "source_sentence": "佛告善業：「若所問：『學無常，為學一切智？』",
        "translation": "The Buddha told Shanye, Suppose someone asks, 'Are you training in impermanence or are you training in omniscience?'",
        "source": "T08n0225_005:0500c10_2"
    },
    {
        "source_sentence": "者，云何是如來本無隨因緣得？",
        "translation": "How is it that the Tathāgata's originally nonexistent acquisition follows causes and conditions?",
        "source": "T08n0225_005:0500c11_3"
    },
    {
        "source_sentence": "如來本無字，寧有盡時不？」",
        "translation": "The Tathāgata originally has no words, so how could there be an end?",
        "source": "T08n0225_005:0500c12_4"
    },
    {
        "source_sentence": "對曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T08n0225_005:0500c12_5"
    },
    {
        "source_sentence": "「如此為學一切智明度無極。",
        "translation": "“Thus, it’s for the sake of training in omniscience that insight and liberation are infinite.",
        "source": "T08n0225_005:0500c13_6"
    },
    {
        "source_sentence": "如來地十種力、四無所畏，為悉學諸佛法。",
        "translation": "The ten kinds of powers and four fearlessnesses of the Tathāgata's stage are to fully train in the Buddha's teachings.",
        "source": "T08n0225_005:0500c13_7"
    },
    {
        "source_sentence": "闓士大士作是學，邪及官屬不能中壞，疾得不退轉，為近佛樹下坐。",
        "translation": "The Licchavi ministers and bodhisattvas thus studied, but wrongdoers and officials couldn't break it down, quickly attained irreversibility, and sat down under the Buddha's tree to approach him.",
        "source": "T08n0225_005:0500c14_8"
    },
    {
        "source_sentence": "為學佛道，為學習法。",
        "translation": "In order to study the Buddha Way and in order to study the Dharma.",
        "source": "T08n0225_005:0500c16_9"
    },
    {
        "source_sentence": "慈悲喜護普濟群生，學三合十二法輪為轉，學滅度十方人，為稍稍上至佛道，",
        "translation": "He had compassion, pity, joy, and protection for all living beings. His training was the turning of the thirty-two wheels of the Teaching in order to save sentient beings; his cultivation of extinction saved those in the ten directions who were still a little bit on the path of enlightenment.",
        "source": "T08n0225_005:0500c16_10"
    },
    {
        "source_sentence": "學入甘露法門。",
        "translation": "He trains to enter the nectar-like dharma-gate.",
        "source": "T08n0225_005:0500c18_11"
    },
    {
        "source_sentence": "不懈怠之人乃能學是。",
        "translation": "Only someone who isn't lazy can study it.",
        "source": "T08n0225_005:0500c18_12"
    },
    {
        "source_sentence": "作是學者，為學十方人導，死不入地獄、禽獸、餓鬼，終不生邊地愚癡貧窮中，",
        "translation": "In order to train, they're led by people in the ten directions, and when they die they won't enter hell, animals, or hungry ghosts, and they'll never be born in a marginal land of folly and poverty.",
        "source": "T08n0225_005:0500c19_13"
    },
    {
        "source_sentence": "不受眾痛之疾，不毀十戒，不從流俗婬祠，遠不持十戒人，不願生不想天上。",
        "translation": "They won't be subject to the pain of all kinds of pain, don't disparage the ten precepts, don't follow laymen's shrines, don't stay far from those who uphold the ten precepts, and don't wish to be born or reborn in heaven.",
        "source": "T08n0225_005:0500c21_14"
    },
    {
        "source_sentence": "從明度中出變謀明慧威神，入禪不隨禪、不隨禪法。",
        "translation": "In the midst of insight and liberation, he produces the authoritative spirit of transforming wisdom and insight, enters meditation without following meditation or the teachings of meditation.",
        "source": "T08n0225_005:0500c22_15"
    },
    {
        "source_sentence": "闓士學如是，為得淨力、無所畏力、佛法淨力。」",
        "translation": "A bodhisattva trains like this in order to attain the power of purity, the power of fearlessness, and the pure power of the Buddha's teachings.",
        "source": "T08n0225_005:0500c24_0"
    },
    {
        "source_sentence": "善業白佛言：「諸法本皆淨，何等闓士為得法淨？」",
        "translation": "Sunetra said to the Buddha, All dharmas are inherently pure, so what kind of monk would attain the purity of dharmas?",
        "source": "T08n0225_005:0500c25_0"
    },
    {
        "source_sentence": "佛言：「闓士學如斯，為學無所得淨法諸法淨。",
        "translation": "The Buddha said, Such is the purity of the ungraspable pure dharmas and dharmas that a bodhisattva trains in.",
        "source": "T08n0225_005:0500c26_1"
    },
    {
        "source_sentence": "如是闓士行明度時，不悔不厭是為行。",
        "translation": "Thus, when a monk's practice is luminous and liberating, he doesn't repent or grow weary of it as practice.",
        "source": "T08n0225_005:0500c27_2"
    },
    {
        "source_sentence": "未得道者愚癡，不曉是法、不見其事。",
        "translation": "Those who haven't yet attained the path are foolish, don't understand this teaching and don't see its things.",
        "source": "T08n0225_005:0500c27_3"
    },
    {
        "source_sentence": "闓士用人故，常精進，人當効我，用是得力、精進、無所畏。",
        "translation": "Because it's because they use people, they always make effort, and people will treat me with their strength, effort, and fearlessness.",
        "source": "T08n0225_005:0500c28_4"
    },
    {
        "source_sentence": "作是學一切智者，若出金之地，其地少耳。",
        "translation": "If someone who thus trains in omniscience leaves the land of gold, that land will be small.",
        "source": "T08n0225_005:0501a01_5"
    },
    {
        "source_sentence": "又如索轉輪聖王之人少耳，小王者多。",
        "translation": "It's also like the case of the noble king索轉輪聖王之人少少耳,小王者多.",
        "source": "T08n0225_005:0501a02_0"
    },
    {
        "source_sentence": "從是中多索應儀、緣一覺者，既有初發意者，闓士少有隨明度教得不退轉者。",
        "translation": "From here, there are many people who ask for the first arousal of mind in response to the teaching and conditioned by a single awakening because there are those who have the first arousal of mind, but few monks who follow the explanation and save the teaching and attain nonretrogression.",
        "source": "T08n0225_005:0501a02_1"
    },
    {
        "source_sentence": "闓士當力學及不退轉。",
        "translation": "A bodhisattva should train with effort and not regress.",
        "source": "T08n0225_005:0501a04_2"
    },
    {
        "source_sentence": "闓士行明度，不以恚意向人，不求人短，心無慳貪，不毀戒、懷恨、懈怠、迷亂，",
        "translation": "A greedy person’s practice is insightful and liberating. He doesn’t harm others, doesn’t seek advantage or disadvantage, has no stinginess or greed in his mind, doesn’t violate the precepts, harbor hatred, laziness, or confusion.",
        "source": "T08n0225_005:0501a05_3"
    },
    {
        "source_sentence": "心無癡冥。",
        "translation": "The mind is free of delusion.",
        "source": "T08n0225_005:0501a06_4"
    },
    {
        "source_sentence": "學明度，為照明諸度，悉入其門，道德備足。",
        "translation": "In order to illuminate the paths of liberation, they all entered their gates and were endowed with moral virtue.",
        "source": "T08n0225_005:0501a07_5"
    },
    {
        "source_sentence": "如人言：『是我所。』",
        "translation": "Suppose someone says, 'This is mine.'",
        "source": "T08n0225_005:0501a08_6"
    },
    {
        "source_sentence": "便外著十二品。",
        "translation": "He then wrote twelve chapters externally.",
        "source": "T08n0225_005:0501a08_7"
    },
    {
        "source_sentence": "悉供養一佛界中人盡壽命，不如守明度淨定彈指頃。",
        "translation": "It's better to make offerings to someone in a single Buddha realm for the rest of their life than to guard luminosity and purify concentration for the time it takes to snap your fingers.",
        "source": "T08n0225_005:0501a08_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501a10_9"
    },
    {
        "source_sentence": "從是疾得無上正真道，能給視十方窮孤，求佛之境界，佛之智慧，如師子獨步。",
        "translation": "From this he quickly attained the unsurpassed true path, which allowed him to look over the ten directions and be completely orphaned, seeking the Buddha's sphere, and the Buddha's wisdom was like a lion walking alone.",
        "source": "T08n0225_005:0501a10_10"
    },
    {
        "source_sentence": "欲得佛處，當學明度。",
        "translation": "If you want to attain the Buddha's place, you must train in insight and liberation.",
        "source": "T08n0225_005:0501a12_11"
    },
    {
        "source_sentence": "學明度者，為學諸法。」",
        "translation": "Those who study luminosity and liberation are training in the teachings.",
        "source": "T08n0225_005:0501a12_12"
    },
    {
        "source_sentence": "善業言：「闓士復學應儀法耶？」",
        "translation": "Sunetra said, Is the monk still training in the rules of conduct?",
        "source": "T08n0225_005:0501a13_0"
    },
    {
        "source_sentence": "佛言：「闓士學一切智，應儀功德不於中住。",
        "translation": "The Buddha said, A bodhisattva trains in omniscience, but he doesn't abide there because of the merit of his manner.",
        "source": "T08n0225_005:0501a13_1"
    },
    {
        "source_sentence": "闓士學，十方人無能過者，於一切智中不壞不滅。",
        "translation": "There's no one in the ten directions who can surpass it, and there's no one who doesn't perish or cease in omniscience.",
        "source": "T08n0225_005:0501a14_2"
    },
    {
        "source_sentence": "若念持是明度當得一切智，為不行。",
        "translation": "If mindfulness is the luminous liberation that will attain omniscience, it's not practiced.",
        "source": "T08n0225_005:0501a15_3"
    },
    {
        "source_sentence": "明度無極，無相之行也。」",
        "translation": "It explains that liberation has no limit, which is the practice of signlessness.",
        "source": "T08n0225_005:0501a16_4"
    },
    {
        "source_sentence": "守行品第二十三",
        "translation": "Chapter Twenty-third of the chapter on guarding practices",
        "source": "T08n0225_005:0501a18_0"
    },
    {
        "source_sentence": "是時天帝釋在會中坐，作是念：「闓士行，十方人無能過者，豈況佛乎？",
        "translation": "Śakra, lord of the gods, then sat in the assembly and had this thought, How could anyone in the ten directions surpass the Buddha?",
        "source": "T08n0225_005:0501a19_0"
    },
    {
        "source_sentence": "人身難得，壽安又難，有一發意求佛者甚難，何況至心求佛道、欲為十方作明度導者乎？」",
        "translation": "It's difficult to find a human body, and it's difficult to have a peaceful life span. If there's someone who arouses the intention to seek Buddhahood, then it's very difficult, so why wouldn't they wholeheartedly seek the Buddha Way and want to create a guide of insight for the ten directions?",
        "source": "T08n0225_005:0501a20_1"
    },
    {
        "source_sentence": "是時，釋化作甘香華以散佛上，作是說：「行闓士道者乃及於佛，所願悉成，",
        "translation": "Śākyamuni then transformed himself into a sweet fragrant flower and scattered it over the Buddha, saying, A practitioner of the Way is only as good as a Buddhist who accomplishes all his vows.",
        "source": "T08n0225_005:0501a22_2"
    },
    {
        "source_sentence": "為護成佛諸經一切智，如來經法悉具足不退，轉法示人。",
        "translation": "In order to protect the omniscience of all the sūtras that become buddhas, the Tathāgata's sūtras and teachings are fully endowed with nonretrogression, and he teaches people by transforming the teaching.",
        "source": "T08n0225_005:0501a24_3"
    },
    {
        "source_sentence": "有至心索佛，於是法一存念終不還：『我欲使人於法中益念，不厭生死之苦，",
        "translation": "Someone earnestly requested the Buddha, but he would not turn back even for a moment of thought in regard to this teaching: I wish to enable people to become ever more mindful of the Dharma and not give up the suffering of birth and death.",
        "source": "T08n0225_005:0501a25_4"
    },
    {
        "source_sentence": "以一切眾生苦故，當忍勤苦之行。』",
        "translation": "Because all sentient beings are suffering, they should tolerate the practice of diligence and suffering.'",
        "source": "T08n0225_005:0501a27_5"
    },
    {
        "source_sentence": "心作是念：『諸未度者吾當度之，恐怖者吾當安隱之，諸未滅度者吾當滅度之。』」",
        "translation": "My mind thinks, 'I will save those who haven't been liberated, I will bring peace to those who are afraid, and I will extinguish those who haven't been liberated.'",
        "source": "T08n0225_005:0501a28_0"
    },
    {
        "source_sentence": "復問佛：「新發意闓士隨次第上至不退轉，至一生補處。",
        "translation": "Again, he asked the Buddha, A newly awakened bodhisattva follows the order up to the point of nonretrogression up to the place where he'll be reborn.",
        "source": "T08n0225_005:0501a29_1"
    },
    {
        "source_sentence": "人勸助其喜，得何等福？」",
        "translation": "What kind of merit does it obtain when someone encourages and helps them to rejoice?",
        "source": "T08n0225_005:0501b02_0"
    },
    {
        "source_sentence": "佛言：「須彌山尚可稱知；",
        "translation": "The Buddha said: Mount Sumeru is still to be known.",
        "source": "T08n0225_005:0501b02_1"
    },
    {
        "source_sentence": "阿闍浮闓士行人，勸助歡喜，其福無極。",
        "translation": "When the practitioner Ajātaśatru encourages and encourages people to rejoice, their merit will be limitless.",
        "source": "T08n0225_005:0501b03_2"
    },
    {
        "source_sentence": "一佛界中海水，取一髮破為百分，從中取一分以取水，水盡可知幾渧；",
        "translation": "In one buddha-realm, the water in the ocean is taken to be one hundredth of a fathom; and from within it one part is taken to obtain water.",
        "source": "T08n0225_005:0501b03_3"
    },
    {
        "source_sentence": "不退轉闓士行，勸助歡喜，其福不可量稱數。",
        "translation": "He doesn't turn away from the practice of a gandharva, encourages and rejoices, and his merit can't be measured or counted.",
        "source": "T08n0225_005:0501b05_4"
    },
    {
        "source_sentence": "一佛剎虛空，持一斛半斛一斗半斗一升半升，可量知幾所；",
        "translation": "The space of a buddha-stage contains one sheng, half a sheng, one heap, one sheng, or one and the other sheng; how many are there?",
        "source": "T08n0225_005:0501b06_5"
    },
    {
        "source_sentence": "此勸助福，不可極。」",
        "translation": "This encourages merit that can't be extreme.",
        "source": "T08n0225_005:0501b07_6"
    },
    {
        "source_sentence": "釋白佛言：「邪及官屬從邪天來，聞斯定不助勸，將有緣乎？」",
        "translation": "Śākyamuni said to the Buddha, Are there any reasons why wrong officials and officials who come from the wrong heaven would not be encouraged by hearing this concentration?",
        "source": "T08n0225_005:0501b08_7"
    },
    {
        "source_sentence": "佛言：「發意索佛者，為壞邪界。",
        "translation": "The Buddha said, A person who arouses the intention to ask for a Buddha destroys the wrong realm.",
        "source": "T08n0225_005:0501b09_8"
    },
    {
        "source_sentence": "心不離佛法，除饉眾如是，其助喜者為近佛。",
        "translation": "The mind doesn't part from the Buddha's teaching, and it's like this with the exception of the angry crowd. Those who help rejoice are those who approach the Buddha.",
        "source": "T08n0225_005:0501b10_9"
    },
    {
        "source_sentence": "用是功德，世世所生，為人所敬養，未嘗有惡聲，不恐入三惡道，當生天上，",
        "translation": "Because of these virtues, they are produced throughout the world and honored by people. They never utter a bad voice and won’t be afraid to enter the three evil destinies or be reborn in heaven.",
        "source": "T08n0225_005:0501b11_10"
    },
    {
        "source_sentence": "在十方常尊。",
        "translation": "He's always honored in the ten directions.",
        "source": "T08n0225_005:0501b12_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501b13_12"
    },
    {
        "source_sentence": "此勸助之德為等施群生矣。",
        "translation": "The virtue of this exhortation is to give equally to all sentient beings.",
        "source": "T08n0225_005:0501b13_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501b14_0"
    },
    {
        "source_sentence": "初發意人稍稍增多，自致作佛，滅度群生故。」",
        "translation": "The first person who arouses the intention slightly increases in number and becomes a buddha on his own, extinguishing sentient beings.",
        "source": "T08n0225_005:0501b14_1"
    },
    {
        "source_sentence": "善業白佛言：「心譬如幻，何因得佛？」",
        "translation": "Sunetra said to the Buddha, The mind is like an illusion, so why did you attain Buddhahood?",
        "source": "T08n0225_005:0501b15_2"
    },
    {
        "source_sentence": "佛言：「云何，若學見幻不？」",
        "translation": "The Buddha said, What's the point of training in seeing illusions?",
        "source": "T08n0225_005:0501b16_0"
    },
    {
        "source_sentence": "對曰：「不見化幻，亦不見幻心也。」",
        "translation": "He replied, I don't see the illusion of transformation, and I don't see the illusion of mind.",
        "source": "T08n0225_005:0501b16_1"
    },
    {
        "source_sentence": "佛言：「不見化幻、幻心，見有異法，當得佛道不？」",
        "translation": "The Buddha said, Don't you see illusions and illusory minds that are transformed or illusory, and if you see different things, will you attain the Buddha Way?",
        "source": "T08n0225_005:0501b17_2"
    },
    {
        "source_sentence": "對曰：「離化幻心、不離幻心，不見當來佛。",
        "translation": "He replied, Being free of the illusory mind of transformation and not free of the illusory mind, they won't see the future Buddha.",
        "source": "T08n0225_005:0501b18_3"
    },
    {
        "source_sentence": "無法無見，當說何等法得耶不得也。",
        "translation": "If there's no dharma and no views, what teaching should be explained as attained or not attained?",
        "source": "T08n0225_005:0501b19_4"
    },
    {
        "source_sentence": "是法本無遠離，亦無若得不得也。",
        "translation": "This is a teaching that's originally nonexistent, and there's nothing if it's attained or not attained.",
        "source": "T08n0225_005:0501b19_5"
    },
    {
        "source_sentence": "本無所生，亦無作佛者。",
        "translation": "There's nothing that arises in the first place, and there's no buddha who creates it.",
        "source": "T08n0225_005:0501b20_6"
    },
    {
        "source_sentence": "設不有是法，亦不得作佛。」",
        "translation": "If they don't have this teaching, they won't be allowed to become buddhas either.",
        "source": "T08n0225_005:0501b21_7"
    },
    {
        "source_sentence": "善業白佛言：「設爾明度離本無。」",
        "translation": "Sunetra said to the Buddha, Suppose you explain that liberation is free of the original nonexistence.",
        "source": "T08n0225_005:0501b21_8"
    },
    {
        "source_sentence": "對曰：「法本無對無證、無守無行。",
        "translation": "He replied, The Dharma is originally without opposition, without realization, without guarding, and without practice.",
        "source": "T08n0225_005:0501b22_9"
    },
    {
        "source_sentence": "無法當有所得。",
        "translation": "There's no dharma that will be attained.",
        "source": "T08n0225_005:0501b23_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501b23_11"
    },
    {
        "source_sentence": "離明度本無形故。",
        "translation": "It's because the liberation from insight is originally formless.",
        "source": "T08n0225_005:0501b23_12"
    },
    {
        "source_sentence": "本無遠離，何因當於明度中得佛？",
        "translation": "If there's no separation in the first place, what will be the cause for attaining Buddhahood in luminosity and liberation?",
        "source": "T08n0225_005:0501b24_13"
    },
    {
        "source_sentence": "佛者離本無所有，何所離本無無所有當得佛者？」",
        "translation": "A buddha is free of the originally nonexistent, so what is it that's free of the originally nonexistent and will attain buddhahood?",
        "source": "T08n0225_005:0501b25_0"
    },
    {
        "source_sentence": "佛言：「如爾所言，離本明度、離本一切智，俱無所有。",
        "translation": "The Buddha said, As you say, there's no existence of all cognition apart from the original luminous liberation and all omniscience apart from the original.",
        "source": "T08n0225_005:0501b26_1"
    },
    {
        "source_sentence": "雖離本，本亦無所從生。",
        "translation": "Even though it's free of the source, there's nothing from which the source arises.",
        "source": "T08n0225_005:0501b27_2"
    },
    {
        "source_sentence": "闓士當作是惟，深入守定，是故離本無所有得作佛。",
        "translation": "That's why it's free of the originally nonexistent and becomes a buddha.",
        "source": "T08n0225_005:0501b27_3"
    },
    {
        "source_sentence": "雖知離本明度無所有，是為不守明度、不具足行者，不得作佛。",
        "translation": "Even though they know that there's nothing apart from the original clarity and liberation, this is because someone who doesn't observe clarity and liberation and doesn't fully practice it won't be allowed to become a buddha.",
        "source": "T08n0225_005:0501b29_0"
    },
    {
        "source_sentence": "如善業所言：『不用明故得佛。』",
        "translation": "As good karma says, 'It's because they don't need insight that they attain Buddhahood.'",
        "source": "T08n0225_005:0501c01_1"
    },
    {
        "source_sentence": "雖爾，不可離明度得作佛。",
        "translation": "Even so, it's not possible to become a buddha apart from luminosity and liberation.",
        "source": "T08n0225_005:0501c02_2"
    },
    {
        "source_sentence": "闓士所行勤苦深奧之法，不可取泥洹。",
        "translation": "The profound and mysterious teaching of diligence and suffering practiced by the monks is not to be taken as nirvāṇa.",
        "source": "T08n0225_005:0501c02_3"
    },
    {
        "source_sentence": "如是所說事，闓士不為勤苦行。",
        "translation": "These are the things that are explained in this way, because a greedy person doesn't practice diligently and painstakingly.",
        "source": "T08n0225_005:0501c03_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501c04_5"
    },
    {
        "source_sentence": "無作證者，無明度得證者，亦無經法得證者。",
        "translation": "The unmanifest realization is the realization of the liberation from nescience that's realized, and there's no sūtra or teaching that's realized.",
        "source": "T08n0225_005:0501c04_6"
    },
    {
        "source_sentence": "闓士聞是，不恐不殆，是為行明度。",
        "translation": "When the brahman heard this, he wasn't afraid or frightened, and this was his practice of practicing insight.",
        "source": "T08n0225_005:0501c05_7"
    },
    {
        "source_sentence": "雖作是行，亦不見行，是為行明度，近作佛。",
        "translation": "Even though he does this practice, he doesn't see it; this is the practice of insight and liberation that makes him approach buddhahood.",
        "source": "T08n0225_005:0501c06_8"
    },
    {
        "source_sentence": "遠離應儀、緣一覺，不見不念，譬如虛空中無念有近遠者也。",
        "translation": "They're far removed from the response and conditioned by a single awakening, and they don't see or think about it, just like there's no thought in space that's near or distant.",
        "source": "T08n0225_005:0501c07_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501c08_10"
    },
    {
        "source_sentence": "明度無形類。",
        "translation": "It explains the formless type of liberation.",
        "source": "T08n0225_005:0501c08_11"
    },
    {
        "source_sentence": "譬如幻所作人不作是念：『師離近，觀人離我遠。』",
        "translation": "It's like an illusion created by someone who doesn't think, 'The teacher is far from me and observing people far from me.'",
        "source": "T08n0225_005:0501c09_12"
    },
    {
        "source_sentence": "譬如影現於水中或近或遠，不念近遠。",
        "translation": "It's like when a shadow appears in water that's either near or far, but isn't mindful of nearness and far.",
        "source": "T08n0225_005:0501c10_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501c11_14"
    },
    {
        "source_sentence": "影無形。",
        "translation": "The shadow has no form.",
        "source": "T08n0225_005:0501c11_15"
    },
    {
        "source_sentence": "明度如是，無是念：『應儀、緣一覺道為遠、佛道為近。』",
        "translation": "Mañjuśrī thus, there's no such thought: 'Should the path of one enlightened person be distant and the Buddha-Path be near?'",
        "source": "T08n0225_005:0501c11_16"
    },
    {
        "source_sentence": "適無憎愛，無著無生。",
        "translation": "It's appropriate without hatred or craving, without attachment or arising.",
        "source": "T08n0225_005:0501c12_17"
    },
    {
        "source_sentence": "譬如匠工黠師刻作機關人，若作雜畜，不能自起居，因對搖。",
        "translation": "It's like a skillful craftsman who carves a mechanical person, or if he makes mixed animals, he can't get up and live on his own, so he shakes them.",
        "source": "T08n0225_005:0501c13_0"
    },
    {
        "source_sentence": "木人本不念言：『我當動搖屈申低仰，令觀者喜。』",
        "translation": "The wooden man originally didn't think, 'Should I move, flex, and lower myself so that those who observe it will rejoice?'",
        "source": "T08n0225_005:0501c14_1"
    },
    {
        "source_sentence": "如海中大船作者欲度賈客，船不念言：『當度人。』",
        "translation": "Suppose the author of a large ship in the ocean wants to save a merchant, and the boat doesn't think, 'I will save people.'",
        "source": "T08n0225_005:0501c15_2"
    },
    {
        "source_sentence": "如曠野之地萬物百穀草木皆生，其中地不念言：『我當生、不生也。』",
        "translation": "Suppose there's a place in the wilderness where all kinds of things and hundreds of grains, grass, and trees all grow, and the ground there doesn't think, 'I will grow or won't grow.'",
        "source": "T08n0225_005:0501c16_3"
    },
    {
        "source_sentence": "如明珠悉出諸寶，如日照於四天下，其明不言：『我當悉照。』",
        "translation": "Like a bright pearl that fully produces all the treasures, like the sun shining over the four continents, its light doesn't say, 'I will completely illuminate it.'",
        "source": "T08n0225_005:0501c17_4"
    },
    {
        "source_sentence": "如水如風無所不至，不念：『當有所至。』",
        "translation": "Like water and wind, there's nothing that doesn't reach them, and they don't think, 'There'll be something that will reach them.'",
        "source": "T08n0225_005:0501c19_5"
    },
    {
        "source_sentence": "如須彌山上忉利天為莊嚴，山不念：『我以忉利天為莊嚴。』",
        "translation": "Suppose Sumeru's mountain is adorned by the Trāyastriṃśa gods, and the mountain doesn't think, 'I adorn myself with the Trāyastriṃśa gods.'",
        "source": "T08n0225_005:0501c20_6"
    },
    {
        "source_sentence": "若大海悉出諸寶琦物，海不念：『當從中出珍寶。』",
        "translation": "If the ocean produces all kinds of precious things, the ocean doesn't think, 'Should treasures come out from within?'",
        "source": "T08n0225_005:0501c21_7"
    },
    {
        "source_sentence": "明度無極出生諸經法，如是雖爾無形無念。",
        "translation": "It explains that the sūtras and dharmas that are liberated without limit give rise to such formlessness and thoughtlessness even though it's like this.",
        "source": "T08n0225_005:0501c22_8"
    },
    {
        "source_sentence": "譬如佛出生諸功德，慈悲喜護加諸群生，明度成諸淨法，其義亦然。」",
        "translation": "It's like the meaning of the Buddha producing virtues, compassion and joy that protect all sentient beings, and explaining the accomplishment of pure dharmas in order to save them.",
        "source": "T08n0225_005:0501c23_9"
    },
    {
        "source_sentence": "強弱品第二十四",
        "translation": "The Twenty-fourth Chapter of the Weaknesses",
        "source": "T08n0225_005:0501c25_0"
    },
    {
        "source_sentence": "秋露子問善業：「闓士大士行明度無極，為高行耶？」",
        "translation": "Qiu Luzi asked Shanye, Is the practice of a bodhisattva-mahāsattva to explain that liberation is infinite, or is it high practice?",
        "source": "T08n0225_005:0501c26_0"
    },
    {
        "source_sentence": "報言：「我從佛聞，行明度為無高行。」",
        "translation": "He replied, I've heard from the Buddha that practicing insight and liberation is not a high practice.",
        "source": "T08n0225_005:0501c27_1"
    },
    {
        "source_sentence": "諸愛欲天念：「當為十方發意為闓士道者作禮。",
        "translation": "The craving gods thought, You must pay homage to those in the ten directions who give rise to the intention to serve the Way as monks and nuns.",
        "source": "T08n0225_005:0501c27_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0501c28_3"
    },
    {
        "source_sentence": "行深明度闓士誓忍眾苦究竟佛業，不中取證寂滅度矣。」",
        "translation": "His practice is profound and explains that he's liberated from the afflictions, vowing to tolerate all suffering as the ultimate buddha-action, and doesn't take it in order to realize the liberation of cessation.",
        "source": "T08n0225_005:0501c29_4"
    },
    {
        "source_sentence": "善業語諸天：「雖不墮落中道取證，是不為難也；",
        "translation": "Good karma said to the gods: Even if you do not fall into the middle way and attain enlightenment, it will not be difficult.",
        "source": "T08n0225_005:0502a01_5"
    },
    {
        "source_sentence": "為十方眾生被法鎧，令得滅度，斯乃為難。",
        "translation": "It is difficult to cause sentient beings in the ten directions to receive the armor of the Dharma and attain nirvāṇa.",
        "source": "T08n0225_005:0502a02_6"
    },
    {
        "source_sentence": "斯人本無索不可得，作是念：『為欲度十方，欲度空。",
        "translation": "That person had no claim to be unobtainable and thought, 'I want to save the ten directions, and I want to save emptiness.'",
        "source": "T08n0225_005:0502a03_7"
    },
    {
        "source_sentence": "何以故。",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0502a04_8"
    },
    {
        "source_sentence": "虛空無近無遠。",
        "translation": "Space is neither near nor distant.",
        "source": "T08n0225_005:0502a04_9"
    },
    {
        "source_sentence": "人本亦爾。",
        "translation": "So it is with the human root.",
        "source": "T08n0225_005:0502a05_10"
    },
    {
        "source_sentence": "欲度人，為度空，為被法鎧。』",
        "translation": "To save people, to save emptiness, and to wear the Dharma armor.'",
        "source": "T08n0225_005:0502a05_11"
    },
    {
        "source_sentence": "如佛所說：『人本無其知，人本無所有，是為度人。』",
        "translation": "As the Buddha said, 'A person originally has no knowledge, and a person originally has nothing, this is to save people.'",
        "source": "T08n0225_005:0502a05_12"
    },
    {
        "source_sentence": "闓士聞斯不恐怖，斯為行明度。",
        "translation": "When the monks heard this, they weren't frightened, and this was their practice of liberation.",
        "source": "T08n0225_005:0502a07_0"
    },
    {
        "source_sentence": "離人本無人，離五陰，離諸法，本無五陰及諸經法。",
        "translation": "Being free of person, there's originally no person, being free of the five aggregates, and being free of all dharmas, there are originally no five aggregates or sūtras or dharmas.",
        "source": "T08n0225_005:0502a07_1"
    },
    {
        "source_sentence": "闓士聞是不恐不懈。」",
        "translation": "A monk who hears it isn't afraid and doesn't tire of it.",
        "source": "T08n0225_005:0502a08_2"
    },
    {
        "source_sentence": "佛言：「何因不恐不懈？」",
        "translation": "The Buddha said, Why isn't he afraid and not negligent?",
        "source": "T08n0225_005:0502a09_3"
    },
    {
        "source_sentence": "對曰：「本無故不恐，本淨故不懈。",
        "translation": "He replied, Because it's originally nonexistent, I won't fear it; because it's originally pure, I won't tire of it.",
        "source": "T08n0225_005:0502a09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0502a10_5"
    },
    {
        "source_sentence": "索懈怠本，本無有也。",
        "translation": "It asks for the root of laziness, which is originally nonexistent.",
        "source": "T08n0225_005:0502a10_6"
    },
    {
        "source_sentence": "所因懈怠，亦復無有也。",
        "translation": "The causes of laziness are also absent.",
        "source": "T08n0225_005:0502a11_7"
    },
    {
        "source_sentence": "諸天釋梵皆為作禮。」",
        "translation": "The gods, Śākyamuni, and Brahmā all paid homage to him.",
        "source": "T08n0225_005:0502a11_8"
    },
    {
        "source_sentence": "佛言：「不但諸釋梵，上至約淨天、遍淨天、無結愛諸天，皆為作禮。",
        "translation": "The Buddha said, Not only did the Śākyamunis and Brahmās, but also the pure gods, the universally pure gods, and the gods with no bonds of craving all pay homage to them.",
        "source": "T08n0225_005:0502a12_9"
    },
    {
        "source_sentence": "十方不可計現在諸佛，悉念擁護知是行明度闓士不退轉。",
        "translation": "In the ten directions, incalculable buddhas of the present are all mindfully embracing and knowing this practice to liberate unenlightened people without turning back.",
        "source": "T08n0225_005:0502a13_10"
    },
    {
        "source_sentence": "恒沙佛剎中人悉使為邪，一邪者化作如恒沙官屬欲共害，不能中道壞得其便。",
        "translation": "All the people in the buddha bases of the Ganges are made to be wrong, and one wrong person is transformed into like the officials of the Ganges who want to harm each other but can't get an advantage over the middle way by destroying it.",
        "source": "T08n0225_005:0502a14_11"
    },
    {
        "source_sentence": "有二事法行明度，邪不能中道得其便。",
        "translation": "There are two things that clarify the path of practice and doctrine, but wrongdoers can't get an advantage over the middle way.",
        "source": "T08n0225_005:0502a16_12"
    },
    {
        "source_sentence": "何謂二事？",
        "translation": "By what are these two things meant?",
        "source": "T08n0225_005:0502a17_13"
    },
    {
        "source_sentence": "一者視諸法皆空，不失本願。",
        "translation": "One, he observes that all dharmas are empty and doesn't lose his original vow.",
        "source": "T08n0225_005:0502a17_14"
    },
    {
        "source_sentence": "二者不捨十方人，諸佛悉護視。",
        "translation": "Two, they won't abandon people in the ten directions, and all the buddhas will guard them.",
        "source": "T08n0225_005:0502a18_15"
    },
    {
        "source_sentence": "諸天往至闓士所，問深經，讚歎善之，今作佛不久。",
        "translation": "The gods went to the brahman, asked about the profound sūtras, praised their goodness, and said that it wouldn't be long before they become buddhas.",
        "source": "T08n0225_005:0502a19_16"
    },
    {
        "source_sentence": "當隨是教法立，諸困苦者皆得護，未得自歸者為得自歸，為人故作法舍，",
        "translation": "They should be established according to the teachings of this doctrine. Those in distress and suffering will all be protected. Those who have not yet found their own refuge should find their own refuge, and they should make a religious home for the sake of others.",
        "source": "T08n0225_005:0502a20_17"
    },
    {
        "source_sentence": "無目者得慧眼。」",
        "translation": "A person without eyes will attain the eye of wisdom.",
        "source": "T08n0225_005:0502a21_18"
    },
    {
        "source_sentence": "佛語善業：「譬如我讚說羅蘭那枝頭佛，十方諸佛亦讚歎行明度闓士如是。」",
        "translation": "The Buddha said to Shanye, Suppose I praise Rāṇasīputra Buddha, and the buddhas of the ten directions also praise the practice of luminous liberation like this.",
        "source": "T08n0225_005:0502a22_19"
    },
    {
        "source_sentence": "佛言：「有行闓士道未得不退轉者，亦復讚歎。」",
        "translation": "The Buddha said, Someone who practices the Way of Buddhist monks who haven't yet attained nonretrogression will also praise it.",
        "source": "T08n0225_005:0502a24_0"
    },
    {
        "source_sentence": "善業白佛：「行闓士何道，為佛所歎？」",
        "translation": "Sunetra said to the Buddha, What path does a practitioner of Buddhism follow that is praised by the Buddha?",
        "source": "T08n0225_005:0502a25_0"
    },
    {
        "source_sentence": "佛言：「闓士隨無怒佛前世為闓士時，及羅蘭那枝頭佛前世為闓士時，",
        "translation": "The Buddha said: When the Tathāgata Aṅgulikāśyapa was a tathāgata in a previous life, he followed the example of the buddhas Ānanda and Samantabhadra.",
        "source": "T08n0225_005:0502a25_1"
    },
    {
        "source_sentence": "所行隨是教。",
        "translation": "What's practiced follows this teaching.",
        "source": "T08n0225_005:0502a27_2"
    },
    {
        "source_sentence": "用是故，十方諸佛讚歎之。",
        "translation": "Because of this, the buddhas of the ten directions praised it.",
        "source": "T08n0225_005:0502a27_3"
    },
    {
        "source_sentence": "闓士大士行明度諸經法，信本無所從生，尚未得無所從生法樂於中立，",
        "translation": "The Licchavi Vimalakīrti practiced the teachings of the scriptures, believing that there was originally nowhere to be born and yet he had not yet attained the bliss of the Dharma which arises from nothing.",
        "source": "T08n0225_005:0502a28_4"
    },
    {
        "source_sentence": "信諸法本空如滅度，尚未獲不退轉。",
        "translation": "They believe that the original emptiness of all dharmas is like cessation and haven't yet attained nonretrogression.",
        "source": "T08n0225_005:0502a29_5"
    },
    {
        "source_sentence": "隨是法教立者，疾得不退轉，有應是行者，諸佛讚歎之。",
        "translation": "Those who follow this teaching of the Dharma and establish it will quickly attain nonretrogression, and those who should be practitioners will be praised by the buddhas.",
        "source": "T08n0225_005:0502b01_6"
    },
    {
        "source_sentence": "是闓士為度應儀道，正向佛道地。",
        "translation": "This is the stage of the Buddhist path for the sake of liberation, which is directed toward the Buddha's path.",
        "source": "T08n0225_005:0502b03_0"
    },
    {
        "source_sentence": "闓士聞深明度，信不狐疑，念：『如佛說諦無異也。』",
        "translation": "When the monk heard this profound explanation of liberation, he believed it without doubt and thought, 'It's no different from what the Buddha teaches about the truth.'",
        "source": "T08n0225_005:0502b03_1"
    },
    {
        "source_sentence": "却後當於無怒佛所聞是法，為在不退轉地立。",
        "translation": "After that, he'll hear this teaching from the Buddha of no anger and establish it in the stage of nonretrogression.",
        "source": "T08n0225_005:0502b04_2"
    },
    {
        "source_sentence": "若聞者，其德甚大，何況隨法教立者，為疾入一切智。」",
        "translation": "If someone hears it, their virtue is so great, so why wouldn't they establish it according to the teaching of the Dharma and quickly enter omniscience?",
        "source": "T08n0225_005:0502b05_3"
    },
    {
        "source_sentence": "善業白佛言：「設離本本無法無所得，亦何所法有作佛者、有說經者？」",
        "translation": "Sunetra said to the Buddha, If there's nothing to be gained apart from the originally nonexistent and nothing to be gained, what teaching does anyone who becomes a buddha or teaches the sūtras have?",
        "source": "T08n0225_005:0502b07_4"
    },
    {
        "source_sentence": "佛言：「如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T08n0225_005:0502b08_5"
    },
    {
        "source_sentence": "設離本無法無所得，何所法有作佛者，亦無說法者。",
        "translation": "If there's nothing to be attained apart from the originally nonexistent, what dharma has someone who becomes a buddha and no one who teaches the Dharma?",
        "source": "T08n0225_005:0502b08_6"
    },
    {
        "source_sentence": "是本無無本，何所有於本無中立者。」",
        "translation": "This is the absence of the original and the absence of the original, so how could there be anything that's established in the absence of the original?",
        "source": "T08n0225_005:0502b10_0"
    },
    {
        "source_sentence": "釋白佛言：「明度甚深，闓士勤苦行乃自致成作佛。",
        "translation": "Śākyamuni said to the Buddha, The insight is so profound that it's only when a monk diligently and painstakingly practices that he becomes a buddha.",
        "source": "T08n0225_005:0502b10_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0502b11_2"
    },
    {
        "source_sentence": "無字法，無所得。",
        "translation": "There are no words or dharmas, and nothing is attained.",
        "source": "T08n0225_005:0502b12_3"
    },
    {
        "source_sentence": "在本無中立者，亦無作佛者，無說經者。",
        "translation": "Those who are established in the middle of nonexistence in the original, and those who don't become buddhas, have no explanation of the sūtras.",
        "source": "T08n0225_005:0502b12_4"
    },
    {
        "source_sentence": "聞是不恐怖、不疑不厭。」",
        "translation": "When they hear it, they aren't frightened or doubtful or disillusioned.",
        "source": "T08n0225_005:0502b13_5"
    },
    {
        "source_sentence": "善業言：「如是，帝釋！",
        "translation": "Sunetra said, So it is, Indra!",
        "source": "T08n0225_005:0502b13_6"
    },
    {
        "source_sentence": "闓士勤苦，聞是深法不疑不厭。",
        "translation": "The monks were diligent and pained, and when they heard this profound teaching they didn't doubt or tire of it.",
        "source": "T08n0225_005:0502b14_7"
    },
    {
        "source_sentence": "諸經法皆空，何所有疑厭者。」",
        "translation": "The teachings of the sūtras are all empty, so why would anyone doubt and dislike them?",
        "source": "T08n0225_005:0502b15_0"
    },
    {
        "source_sentence": "釋言：「如所說！",
        "translation": "The explanation says, As explained!",
        "source": "T08n0225_005:0502b15_1"
    },
    {
        "source_sentence": "一切為談空事、為無著，譬如射空也。",
        "translation": "They all talk about emptiness and lack attachment, which is like shooting into the sky.",
        "source": "T08n0225_005:0502b15_2"
    },
    {
        "source_sentence": "善業所說經猶亦然矣。」",
        "translation": "So it is with the sūtras taught by Shanye.",
        "source": "T08n0225_005:0502b16_3"
    },
    {
        "source_sentence": "釋白佛：「如我所說，為隨佛法教耶？",
        "translation": "Śākyamuni said to the Buddha, As I've explained, is it following the Buddha's teaching of the Dharma?",
        "source": "T08n0225_005:0502b17_4"
    },
    {
        "source_sentence": "有增減也？」",
        "translation": "Is there increase and decrease?",
        "source": "T08n0225_005:0502b18_5"
    },
    {
        "source_sentence": "佛言：「與佛說無異。",
        "translation": "The Buddha said, It's no different from what the Buddha teaches.",
        "source": "T08n0225_005:0502b18_6"
    },
    {
        "source_sentence": "如善業所說但說空事，善業亦不見明度、不見行者行，不見佛、不見得佛者。",
        "translation": "Just as what's taught by good karma only explains the matter of emptiness, good karma doesn't see insight and liberation, doesn't see practitioners who practice, doesn't see buddhas, and doesn't see those who attain buddhahood.",
        "source": "T08n0225_005:0502b18_7"
    },
    {
        "source_sentence": "一切智如來，無所從生法，十種力、四無所畏，上尊諸淨法，都不覩有索得之者。",
        "translation": "The Tathāgata of omniscience, the Dharma that arises from nothing, has ten kinds of powers and four fearlessnesses, and the most honored pure dharmas are not to be seen by anyone who asks for them.",
        "source": "T08n0225_005:0502b20_8"
    },
    {
        "source_sentence": "所以然者，諸法本淨故為無得。",
        "translation": "The reason for this is that the dharmas are inherently pure and therefore have no attainment.",
        "source": "T08n0225_005:0502b22_9"
    },
    {
        "source_sentence": "斯為行明度也。",
        "translation": "This is the practice of insight and liberation.",
        "source": "T08n0225_005:0502b22_10"
    },
    {
        "source_sentence": "眾應儀、緣一覺地所不及。",
        "translation": "The multitude of responses and conditions are unmatched by those in the single stage of awakening.",
        "source": "T08n0225_005:0502b23_11"
    },
    {
        "source_sentence": "欲為十方人特尊，當隨佛法教立。」",
        "translation": "If you want to be especially honored by people in the ten directions, you must follow the teachings of the Buddha's teachings.",
        "source": "T08n0225_005:0502b23_12"
    },
    {
        "source_sentence": "是時忉利天上數千萬天，化作甘香花散佛上，作是說言：「我曹亦隨法教。」",
        "translation": "Thousands of thousands of gods in the Trāyastriṃśa gods then transformed themselves into sweet-smelling flowers and scattered them over the Buddha, saying, I also follow the teaching of the Dharma.",
        "source": "T08n0225_005:0502b24_13"
    },
    {
        "source_sentence": "時，座中百六十比丘起，正衣服，為佛作禮已，手中各有化甘香花，持散佛上，",
        "translation": "At that time, one hundred and sixty bhikṣus stood up from their seats, correctly dressed, and having venerated the Buddha by bowing to his feet, they each held a magical flower of sweet fragrance in their hands and scattered it over the Buddha.",
        "source": "T08n0225_005:0502b26_14"
    },
    {
        "source_sentence": "言：「我曹亦當隨法教立。」",
        "translation": "He said, I will also establish it according to the teachings of the Dharma.",
        "source": "T08n0225_005:0502b28_0"
    },
    {
        "source_sentence": "時，佛笑，口中出若干色，其明至十方佛國悉為其明，還遶佛三匝，從頂上入。",
        "translation": "The Buddha then smiled, and a certain color emerged from his mouth. His light reached the buddha-lands in the ten directions to make them all shine for him. After circumambulating the Buddha three times, he entered through the top of his head.",
        "source": "T08n0225_005:0502b28_1"
    },
    {
        "source_sentence": "阿難從坐起，正衣服，為佛作禮，長跪問佛：「佛不妄笑，願說笑意。」",
        "translation": "Ānanda rose from his seat, straightened his clothes, paid homage to the Buddha, knelt down long enough to ask him, The Buddha doesn't laugh falsely; please explain what he means by laughing.",
        "source": "T08n0225_005:0502c01_2"
    },
    {
        "source_sentence": "佛言：「是百六十比丘及諸天，甫當來世有劫名導，是比丘及諸天當於導劫作佛，",
        "translation": "The Buddha said: These one hundred and sixty bhikṣus and the gods will become buddhas in the future aeons called Tuṣita. This bhikṣu and these gods will be buddhas during the eon of Tuṣita.",
        "source": "T08n0225_005:0502c02_3"
    },
    {
        "source_sentence": "皆同一字，字優那拘泥摩。",
        "translation": "They're all the same word, which is called Uṇuṇakuṇema.",
        "source": "T08n0225_005:0502c04_4"
    },
    {
        "source_sentence": "作佛時，比丘僧數各等，其壽二萬歲。",
        "translation": "When he becomes a buddha, the number of monks and nuns will be equal in number, with a life span of 20,000 years.",
        "source": "T08n0225_005:0502c05_5"
    },
    {
        "source_sentence": "隨次作佛，壽各等。",
        "translation": "They become buddhas one after another, each with an equal length of life.",
        "source": "T08n0225_005:0502c05_6"
    },
    {
        "source_sentence": "盡世雨五色花如是。」",
        "translation": "The five-colored flowers that rain down throughout the world are like this.",
        "source": "T08n0225_005:0502c06_7"
    },
    {
        "source_sentence": "累教品第二十五",
        "translation": "The Twenty-fifth Chapter of the Collection of Teachings",
        "source": "T08n0225_005:0502c07_0"
    },
    {
        "source_sentence": "佛告阿難：「作是立者，為如佛立。",
        "translation": "The Buddha told Ānanda, To establish it like this is to establish it just as the Buddha did.",
        "source": "T08n0225_005:0502c08_0"
    },
    {
        "source_sentence": "欲如一切智立，當隨明度教。",
        "translation": "If you want to establish it as omniscience, you should follow the teaching of luminosity and liberation.",
        "source": "T08n0225_005:0502c08_1"
    },
    {
        "source_sentence": "應是行者，當知從人道或從兜術天上來，久聞明度或行。",
        "translation": "Those who should be practitioners should know that they come from the human path or from the Tuṣita Heaven and have long heard of luminosity and liberation or practice.",
        "source": "T08n0225_005:0502c09_2"
    },
    {
        "source_sentence": "所以然者，佛滅度後，法於世間現，或於兜術天上現，有行若書者復轉教人，",
        "translation": "The reason for this is that after the parinirvāṇa of the Buddha, some teachings will appear in the world and some in the Tuṣita Heaven. Those who practice or write [these teachings] will again teach others.",
        "source": "T08n0225_005:0502c10_3"
    },
    {
        "source_sentence": "歡樂合福。",
        "translation": "It's a combination of happiness and merit.",
        "source": "T08n0225_005:0502c12_4"
    },
    {
        "source_sentence": "知供養若干佛以來，不於應儀、緣一覺品中作功德。",
        "translation": "Knowing that they've made offerings to a number of buddhas, they don't create merit in the category of response and conditioned single-eyed enlightenment.",
        "source": "T08n0225_005:0502c12_5"
    },
    {
        "source_sentence": "有受明度學之，若解中惠，是闓士如面見佛無異。",
        "translation": "If there's someone who receives the knowledge of liberation and trains it, and if they understand the middle wisdom, that monk is like seeing the Buddha face-to-face without any difference.",
        "source": "T08n0225_005:0502c13_6"
    },
    {
        "source_sentence": "其有斯德，用求應儀、緣一覺，會必得佛矣。",
        "translation": "If someone has this virtue, they'll surely attain Buddhahood in the assembly if they seek to follow one enlightened person's manner and condition.",
        "source": "T08n0225_005:0502c15_0"
    },
    {
        "source_sentence": "行法常當遠離此二道。」",
        "translation": "The practice of the Dharma will always be free of these two paths.",
        "source": "T08n0225_005:0502c15_1"
    },
    {
        "source_sentence": "佛語阿難：「持是明度囑累若。",
        "translation": "The Buddha said to Ānanda, Uphold this as an entrustment of insight and liberation.",
        "source": "T08n0225_005:0502c16_2"
    },
    {
        "source_sentence": "我所說餘經，若所受悉捨忘之，其過少耳。",
        "translation": "If I forget all the other sūtras that I teach, there's nothing wrong with abandoning whatever I receive.",
        "source": "T08n0225_005:0502c17_3"
    },
    {
        "source_sentence": "所從佛受明度，若忘捨之，其過甚多。",
        "translation": "If someone forgets the Buddha's enlightenment and receives it from the Buddha, they'll have many faults.",
        "source": "T08n0225_005:0502c18_4"
    },
    {
        "source_sentence": "諦學悉具足受，書字莫令缺減，往古來今佛經等無異。",
        "translation": "He studied and fully accepted it, keeping the Sanskrit phonemes neither missing nor diminishing, no different from the buddha scriptures of past, present, and future.",
        "source": "T08n0225_005:0502c19_5"
    },
    {
        "source_sentence": "若有慈心於佛者，當受此法，敬禮供養，為供養三世佛，報佛恩備矣。",
        "translation": "If someone has a compassionate mind toward the Buddha, they should accept this teaching, venerate and make offerings to him, and offer support to the buddhas of the three times in order to repay the Buddha's kindness.",
        "source": "T08n0225_005:0502c20_6"
    },
    {
        "source_sentence": "若慈孝於佛，不如恭敬明度，慎莫忘失一句。",
        "translation": "If you're compassionate and filial to the Buddha, it's not as good as respecting and understanding liberation, so be careful not to forget a single phrase.",
        "source": "T08n0225_005:0502c21_7"
    },
    {
        "source_sentence": "囑累若，麤捔說耳。",
        "translation": "If I'm instructed, I'll explain it in detail.",
        "source": "T08n0225_005:0502c22_8"
    },
    {
        "source_sentence": "若有不欲離於經法、比丘僧、三世佛者，不當遠此法。",
        "translation": "If someone doesn't want to part with the sūtras, dharmas, monks, and the three worldly buddhas, they shouldn't distance themselves from this teaching.",
        "source": "T08n0225_005:0502c23_9"
    },
    {
        "source_sentence": "三世諸佛皆由斯生。",
        "translation": "The buddhas of the three times all arise from this.",
        "source": "T08n0225_005:0502c24_10"
    },
    {
        "source_sentence": "所以然？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0502c25_0"
    },
    {
        "source_sentence": "夫六度者乃諸闓士大士之母，佛不可盡經法之藏，若曰教人盡佛界中令得應儀道，",
        "translation": "The six perfections are the mother of all the gandharvas and mahāyis, for buddhas cannot exhaust the treasury of scriptures and teachings. If they say they teach people to exhaust the buddha-realm so that they may attain the path of proper conduct,",
        "source": "T08n0225_005:0502c25_1"
    },
    {
        "source_sentence": "雖有是教，尚未報佛恩。",
        "translation": "Even though there's this teaching, it doesn't yet repay the Buddha's kindness.",
        "source": "T08n0225_005:0502c27_2"
    },
    {
        "source_sentence": "不如具足為闓士說明度，雖不能多一日可，不能一日食時可，若頃間，",
        "translation": "Even if you can't explain it fully for the sake of the miller, even though you can't approve it for a full day, and you can't approve it when you eat for a day, then if you do so for a short time,",
        "source": "T08n0225_005:0502c27_3"
    },
    {
        "source_sentence": "其福勝度爾所應儀。",
        "translation": "Their merits are superior, and they'll be liberated according to their proper manner.",
        "source": "T08n0225_005:0502c29_4"
    },
    {
        "source_sentence": "闓士大士思惟中慧得功德，出應儀、緣一覺上，會當復不退轉，不中道墮落。」",
        "translation": "A bodhisattva or great man who contemplates the merit of middling wisdom and attains it out of response and conditioned by a single awakening will no longer regress in the assembly, and he won't fall into the middle way.",
        "source": "T08n0225_005:0502c29_5"
    },
    {
        "source_sentence": "說是明度時，四部弟子及諸天至誠鬼神王，一佛界中持釋迦文威神，一切悉見無怒佛及比丘、應儀、諸闓士亦無央數，",
        "translation": "When this liberation was spoken of, the fourfold assembly of disciples and gods were sincerely kings of ghostly spirits. In one buddha-realm they held the great supernatural being Śākyamuni in their arms; all saw the Buddha Aṅgulimālīya, the bhikṣus, the monks, the charioteers, and the brahman",
        "source": "T08n0225_005:0503a02_6"
    },
    {
        "source_sentence": "忽不復現。",
        "translation": "Suddenly, it doesn't appear again.",
        "source": "T08n0225_005:0503a05_7"
    },
    {
        "source_sentence": "佛語阿難：「譬如見國中人已不復見，無怒佛及諸闓士、應儀士，諸經索不見亦如是。",
        "translation": "The Buddha said to Ānanda, Suppose he sees that the people of his country don't see it again, and there's no angry Buddha, or any other monk or practitioner who doesn't see it, and so do the sūtras ask him not to see it.",
        "source": "T08n0225_005:0503a05_8"
    },
    {
        "source_sentence": "法不見法，法不念法。",
        "translation": "The Dharma doesn't see the Dharma, and the Dharma doesn't think of the Dharma.",
        "source": "T08n0225_005:0503a07_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0503a07_10"
    },
    {
        "source_sentence": "諸經法無念無見亦無所益。」",
        "translation": "The teachings of the sūtras lack mindfulness, views, and nothing to be gained.",
        "source": "T08n0225_005:0503a07_11"
    },
    {
        "source_sentence": "佛語阿難：「諸經法皆空、無所持、不可念。",
        "translation": "The Buddha said to Ānanda, All the sūtras and dharmas are empty, have nothing to hold, and cannot be thought of.",
        "source": "T08n0225_005:0503a08_12"
    },
    {
        "source_sentence": "譬如幻師化作人。",
        "translation": "It's like an illusionist who transforms himself into a human being.",
        "source": "T08n0225_005:0503a09_13"
    },
    {
        "source_sentence": "諸經法亦然，無念無痛。",
        "translation": "The teachings of the scriptures are likewise, with no thought and no pain.",
        "source": "T08n0225_005:0503a09_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0503a10_15"
    },
    {
        "source_sentence": "無形故。",
        "translation": "It's because it has no form.",
        "source": "T08n0225_005:0503a10_16"
    },
    {
        "source_sentence": "闓士作是行、作是學，為行學明度。",
        "translation": "A monk who does this practice and does this training is to practice and train in order to clarify liberation.",
        "source": "T08n0225_005:0503a10_17"
    },
    {
        "source_sentence": "在學中最尊百千萬倍，是為安十方群生困厄者，為隨佛法學也。",
        "translation": "He's the most honored among students a hundred million times over, which is to pacify the afflictions of sentient beings in the ten directions and follow the Buddha's teaching.",
        "source": "T08n0225_005:0503a11_18"
    },
    {
        "source_sentence": "有應是學者，以手舉一佛剎，又復著故處，人無覺者。",
        "translation": "Suppose there's a scholar who lifts up a buddha-stage with his hand and puts it in an old place where people don't perceive it.",
        "source": "T08n0225_005:0503a13_0"
    },
    {
        "source_sentence": "從是學成無礙惠法，十方三世無數諸佛悉從明度成佛，亦不增不減，是故不可盡，",
        "translation": "Innumerable buddhas of the ten directions and three times attain buddhahood from knowledge, neither increasing nor decreasing. Because of this, they cannot be exhausted.",
        "source": "T08n0225_005:0503a14_1"
    },
    {
        "source_sentence": "虛空亦不可盡。」",
        "translation": "Space is also inexhaustible.",
        "source": "T08n0225_005:0503a16_2"
    },
    {
        "source_sentence": "◎◎不盡品第二十六是時善業念：「佛所說明度無極，義甚深，不可盡。",
        "translation": "The inexhaustible chapter twenty-six This is the time when Shanye thought, The Buddha's explanation of liberation has no limit, and its meaning is so profound that it can't be exhausted.",
        "source": "T08n0225_005:0503a16_3"
    },
    {
        "source_sentence": "譬如虛空。",
        "translation": "It's like space.",
        "source": "T08n0225_005:0503a19_4"
    },
    {
        "source_sentence": "闓士當何緣思惟之？」",
        "translation": "What's the reason why you should contemplate it?",
        "source": "T08n0225_005:0503a19_5"
    },
    {
        "source_sentence": "佛言：「五陰、十二因緣不可盡，當作是惟：『十二因緣適得其中。』",
        "translation": "The Buddha said, The five aggregates and the twelve causes and conditions can't be exhausted, so you should simply say, 'The twelve causes and conditions are appropriate for attaining them.'",
        "source": "T08n0225_005:0503a19_6"
    },
    {
        "source_sentence": "闓士初坐樹下時，以不共法惟十二因緣，是時一切智智慧具足。",
        "translation": "When the cowherd first sat under a tree, he uses twelve causes and conditions that are not common to him for 12 reasons, then he's fully endowed with omniscience and wisdom.",
        "source": "T08n0225_005:0503a21_7"
    },
    {
        "source_sentence": "闓士行明度時，惟十二因緣不盡者，出應儀、緣一覺道，正住佛道。",
        "translation": "When the monk's practice is luminous and liberating, there are only twelve causes and conditions that aren't exhaustive, so he exits the path of one enlightenment in terms of its rituals and conditions and correctly abides in the Buddha Way.",
        "source": "T08n0225_005:0503a22_8"
    },
    {
        "source_sentence": "不作是惟者，便中道得應儀、緣一覺道。",
        "translation": "If someone doesn't do this contemplation, they'll attain the path of response in the middle way and conditioned by the single path of awakening.",
        "source": "T08n0225_005:0503a24_9"
    },
    {
        "source_sentence": "不中還者，用惟行明度變謀明慧故，視十二因緣不可盡。",
        "translation": "The one who doesn't return in the middle uses only practice and wisdom to clarify liberation, so he examines the twelve causes and conditions that can't be exhausted.",
        "source": "T08n0225_005:0503a24_10"
    },
    {
        "source_sentence": "所視法生滅者皆有因緣，法無作者。",
        "translation": "Those who contemplate the arising and ceasing of dharmas all have causes and conditions, and dharmas lack authorship.",
        "source": "T08n0225_005:0503a26_11"
    },
    {
        "source_sentence": "作是思惟十二因緣。",
        "translation": "He thinks about these twelve causes and conditions.",
        "source": "T08n0225_005:0503a27_12"
    },
    {
        "source_sentence": "不見五陰、不見佛界。",
        "translation": "They don't see the five aggregates and don't see the Buddha realm.",
        "source": "T08n0225_005:0503a27_13"
    },
    {
        "source_sentence": "無所因法當見佛界，是為闓士行明度。",
        "translation": "The dharmas that have no cause will be seen in the Buddha realm, which is the luminous liberation of the monk's practice.",
        "source": "T08n0225_005:0503a28_0"
    },
    {
        "source_sentence": "當爾時，邪大愁毒，譬如喪親矣。」",
        "translation": "At that point, they'll be greatly grieved by wrongdoing, like losing their relatives.",
        "source": "T08n0225_005:0503a28_1"
    },
    {
        "source_sentence": "善業白佛言：「一邪愁，餘邪復然乎？」",
        "translation": "Sunetra said to the Buddha, One is sad, but are the other wrongs likewise?",
        "source": "T08n0225_005:0503a29_2"
    },
    {
        "source_sentence": "佛言：「一佛界邪，各於所止不安。",
        "translation": "The Buddha said, One is wrong in the Buddha realm, and each is restless where they're staying.",
        "source": "T08n0225_005:0503b01_3"
    },
    {
        "source_sentence": "闓士隨教時，應行如是者，諸天世凶群生猛毒不能害之。",
        "translation": "When the wicked man follows his instructions, he should do so because gods and fierce sentient beings can't harm him with ferocious poison.",
        "source": "T08n0225_005:0503b02_4"
    },
    {
        "source_sentence": "欲求佛者當行明度，行明度者為具布施、持戒、忍辱、精進、一心、變謀明慧。",
        "translation": "Those who want to seek Buddhahood should practice insight and liberation, and those who practice insight and liberation are endowed with generosity, observance of precepts, forbearance, patience, effort, unity of mind, and the insight of transformation.",
        "source": "T08n0225_005:0503b03_5"
    },
    {
        "source_sentence": "若邪事起，覺滅之。",
        "translation": "If wrong things arise, perception ceases them.",
        "source": "T08n0225_005:0503b05_6"
    },
    {
        "source_sentence": "悉欲得變謀明慧諸度無極者，當守明度，思惟十方現在諸佛悉從明度出生。",
        "translation": "Those who all want to attain the infinity of the perfections of transformation, wisdom, and insight should guard their insight and contemplate that the present buddhas in the ten directions are all born from insight.",
        "source": "T08n0225_005:0503b05_7"
    },
    {
        "source_sentence": "闓士作是念：『如諸佛悉得經法。』",
        "translation": "The monk thought, 'Such are the buddhas who have fully attained the sūtras and teachings.'",
        "source": "T08n0225_005:0503b07_8"
    },
    {
        "source_sentence": "作是念如彈指頃，若有布施具足如恒沙劫。",
        "translation": "He thinks, 'It's as if he were to snap his fingers for an eon like the sands of the Ganges if he had a full set of offerings.",
        "source": "T08n0225_005:0503b08_0"
    },
    {
        "source_sentence": "不如是行者，為住不退轉地，為諸佛所念。",
        "translation": "Those who don't practice like this abide in the stage of nonretrogression and are mindful of the buddhas.",
        "source": "T08n0225_005:0503b09_1"
    },
    {
        "source_sentence": "終不還餘道，會當得佛，不歸三惡道。",
        "translation": "They will never return to other paths, and they'll attain buddhahood in the assembly and won't return to the three bad destinies.",
        "source": "T08n0225_005:0503b10_0"
    },
    {
        "source_sentence": "闓士未嘗離佛時行，當如揵陀呵盡闓士。",
        "translation": "If a monk never leaves the Buddha, he'll practice it at the time, and he'll be like Gandhāra who reprimands a monk for his actions.",
        "source": "T08n0225_005:0503b10_1"
    },
    {
        "source_sentence": "揵陀呵盡闓士在無怒佛國為第一。」",
        "translation": "The gandharva-kṣānti monk is the best among them in the land of the Buddha of No anger.",
        "source": "T08n0225_005:0503b11_2"
    },
    {
        "source_sentence": "隨品第二十七",
        "translation": "twenty-seventh chapter of the Vinaya",
        "source": "T08n0225_005:0503b13_0"
    },
    {
        "source_sentence": "善業白佛言：「闓士何因隨明度無極教？」",
        "translation": "Shanye said to the Buddha, What's the cause for a monk to follow insight and save the infinite teaching?",
        "source": "T08n0225_005:0503b14_0"
    },
    {
        "source_sentence": "佛言：「諸經法無能壞者，闓士隨教當然。",
        "translation": "The Buddha said, There are no scriptures or dharmas that can be destroyed, but the monks follow their teachings.",
        "source": "T08n0225_005:0503b14_1"
    },
    {
        "source_sentence": "虛空不可盡，五陰四大無形。",
        "translation": "Space is inexhaustible, and the five aggregates and four elements are formless.",
        "source": "T08n0225_005:0503b15_2"
    },
    {
        "source_sentence": "沙羅伊擅六事本空無形，闓士隨教當然，發心求佛願濟群生，其願弘普，",
        "translation": "Śāriputra mastered the six matters of emptiness and formlessness in their original sense. The brahman, following his instruction, naturally aroused the aspiration to seek enlightenment and wished to save all living beings. His aspiration spread everywhere.",
        "source": "T08n0225_005:0503b16_3"
    },
    {
        "source_sentence": "莫與為倫。",
        "translation": "Don't give it to him as a friend.",
        "source": "T08n0225_005:0503b18_4"
    },
    {
        "source_sentence": "佛有四事不護，各自異端德尊無極。",
        "translation": "There are four things that the Buddha doesn't guard, each of which has a different kind of virtue that's unsurpassed.",
        "source": "T08n0225_005:0503b18_5"
    },
    {
        "source_sentence": "闓士隨教當然，為眾生作慈護，是我所、非我所悉斷之。",
        "translation": "The wicked man follows the teaching and protects sentient beings with kindness, which is mine and not mine, and stops them all.",
        "source": "T08n0225_005:0503b19_6"
    },
    {
        "source_sentence": "虛空之中音響無形。",
        "translation": "In space, sound and echo are formless.",
        "source": "T08n0225_005:0503b20_7"
    },
    {
        "source_sentence": "隨教當然，譬如大海不可斛量，如須彌巔琦寶各異，如釋梵各自有教，",
        "translation": "Just as the great ocean is immeasurable, just as the polar mountain’s jewels are different from each other, just as the Sakyans and Brahmās have their own teachings.",
        "source": "T08n0225_005:0503b20_8"
    },
    {
        "source_sentence": "如月滿、如日明遍至。",
        "translation": "It's like when the moon is full and like when the sunlight reaches everywhere.",
        "source": "T08n0225_005:0503b22_9"
    },
    {
        "source_sentence": "人本無形但字耳，本無所生與滅度等。",
        "translation": "People originally have no form but only words, and they originally have nothing that arises or ceases, etc.",
        "source": "T08n0225_005:0503b23_10"
    },
    {
        "source_sentence": "闓士隨明度，當如幻化及野馬，有名無形。",
        "translation": "According to the explanation, it's like an illusory transformation or a wild horse that has form and no form.",
        "source": "T08n0225_005:0503b23_11"
    },
    {
        "source_sentence": "如地水火風是四事無極，佛身相本無色，佛界本無界，佛諸經法本無無說無教。",
        "translation": "Just as earth, water, fire, and wind are the four things that have no limit, the Buddha's body and characteristics are originally formless, the Buddha realm is originally formless, the sutras and dharmas of the Buddha are originally nonexistent, and there's nothing to teach or teach.",
        "source": "T08n0225_005:0503b24_12"
    },
    {
        "source_sentence": "譬如眾鳥飛行空中，無足迹矣。",
        "translation": "It's like a multitude of birds flying in the sky with no footprints.",
        "source": "T08n0225_005:0503b26_13"
    },
    {
        "source_sentence": "五根、五力、七覺意、棄脫定，悉度諸欲，臨作佛時乃得行是。",
        "translation": "The five faculties, five powers, seven factors of awakening, and the concentration of renunciation are all liberated from desires, and they'll attain practice when they're about to become buddhas.",
        "source": "T08n0225_005:0503b27_14"
    },
    {
        "source_sentence": "闓士隨教當然，經法無極量，無從生、無因出，臨作佛時諸經法悉具足，",
        "translation": "The brahman taught the Dharma according to his instructions, and the teachings of the scriptures were immeasurable. They did not arise from any source or come forth from any cause. When he was about to become a buddha, all the teachings of the scriptures would be complete.",
        "source": "T08n0225_005:0503b28_15"
    },
    {
        "source_sentence": "成滅度。",
        "translation": "It's the accomplishment of cessation.",
        "source": "T08n0225_005:0503c01_16"
    },
    {
        "source_sentence": "虛空無所有，諸經法淨適無所因，佛所作為變化無極。",
        "translation": "Space has no existence, the sūtras and dharmas are pure and appropriate without any cause, and the transformations created by the Buddha have no limit.",
        "source": "T08n0225_005:0503c01_17"
    },
    {
        "source_sentence": "一切無索闓士者，無得佛者，爾乃能度無央數人。",
        "translation": "All those who don't claim to be a monk, and those who don't attain Buddhahood, then they can save measureless people.",
        "source": "T08n0225_005:0503c02_18"
    },
    {
        "source_sentence": "闓士隨明度教當然，去離諛諂貢高強梁非法自用財富僥倖世事眾穢。",
        "translation": "The brahman follows the teaching of liberation from ignorance and avoids deceit, flattery, hypocrisy, high-handedness, and unlawfulness, using his own wealth and good fortune to do worldly things that are defiled.",
        "source": "T08n0225_005:0503c03_19"
    },
    {
        "source_sentence": "棄身不惜壽命，適無所募，但念佛業安慰群生。",
        "translation": "He renounced his body and didn't spare his life, preferring nothing but mindfulness of the Buddha's actions to comfort all sentient beings.",
        "source": "T08n0225_005:0503c05_20"
    },
    {
        "source_sentence": "闓士行能然者，得佛不久，悉得一切智功德，當字為佛。",
        "translation": "A monk who practices and can do so will soon attain Buddhahood, and he'll attain the merit of omniscience, which is called Buddha.",
        "source": "T08n0225_005:0503c06_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0225_005:0503c07_22"
    },
    {
        "source_sentence": "今得佛不久。",
        "translation": "Now, it won't be long before he attains Buddhahood.",
        "source": "T08n0225_005:0503c08_23"
    },
    {
        "source_sentence": "若有闓士以是教，甫當來世為得佛字。",
        "translation": "If there's a bodhisattva who teaches this, he'll attain the word buddha in a future life.",
        "source": "T08n0225_005:0503c08_24"
    },
    {
        "source_sentence": "佛在世、若滅度後，亦當隨明度無極如是。」",
        "translation": "When the Buddha is in the world and after his passing away, he'll also follow that explanation to save them without limit like this.",
        "source": "T08n0225_005:0503c09_25"
    },
    {
        "source_sentence": "◎明度經卷第五",
        "translation": "*Mingdao jing, vol. 5",
        "source": "T08n0225_005:0503c10_26"
    }
]