[
    {
        "source_sentence": "光讚經卷第一",
        "translation": "Guangzan jing, vol. 1",
        "source": "T08n0222_001:0147a03_0"
    },
    {
        "source_sentence": "西晉三藏竺法護譯",
        "translation": "Translated by the Western Jin Tripiṭaka Zhu Fahou",
        "source": "T08n0222_001:0147a05_0"
    },
    {
        "source_sentence": "摩訶般若波羅蜜光讚品第一",
        "translation": "Mohe bore boloumi pāramitā fongguangzan pin 1",
        "source": "T08n0222_001:0147a06_0"
    },
    {
        "source_sentence": "聞如是：一時佛遊羅閱祇耆闍崛山中，與摩訶比丘僧五千俱，皆阿羅漢也——諸漏已盡，",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Rājagṛha in the mountains, accompanied by five thousand bhikṣus and monks, all of whom were arhats-their contaminants had been extinguished.",
        "source": "T08n0222_001:0147a07_0"
    },
    {
        "source_sentence": "無有塵垢，而得自在；",
        "translation": "They have no defilement and yet attain freedom.",
        "source": "T08n0222_001:0147a08_1"
    },
    {
        "source_sentence": "心安解脫，智慧善度，逮得仁和，為大開導；",
        "translation": "Their minds are peacefully liberated, their knowledge and wisdom well liberated. They attain benevolence and harmony as great enlightenment guides.",
        "source": "T08n0222_001:0147a09_2"
    },
    {
        "source_sentence": "所作已辦，所設究竟，棄捐重擔，逮得己利，除終始患；",
        "translation": "Having accomplished what should be done, they abandon the heavy burden of their responsibilities and attain self-benefiting, getting rid of the troubles that arise from beginning to end.",
        "source": "T08n0222_001:0147a10_3"
    },
    {
        "source_sentence": "平等解脫，濟一切想，得度無極——唯除一人賢者阿難，學須陀洹。",
        "translation": "Equanimous liberation, freed from all conceptions, and the attainment of liberation without limit - except for one person, the good man Ānanda, who trains in stream entry.",
        "source": "T08n0222_001:0147a11_4"
    },
    {
        "source_sentence": "復與五百比丘俱，及比丘尼、優婆塞、優婆夷皆悉現在；",
        "translation": "Again, he was accompanied by five hundred bhikṣus. All the bhikṣus, bhikṣuṇīs, laymen, and laywomen were present.",
        "source": "T08n0222_001:0147a13_0"
    },
    {
        "source_sentence": "并諸菩薩摩訶薩——得諸總持逮成三昧，修于空行尊於無想，不念眾願以得等忍，",
        "translation": "And the bodhisattva Mahāsattva attained the samādhi of total absorption, cultivating the practice of emptiness and honoring the absence of ideation without mindfulness of all vows in order to attain equanimity.",
        "source": "T08n0222_001:0147a14_1"
    },
    {
        "source_sentence": "制覽無數皆得五通；",
        "translation": "Incalculable numbers of enlightening beings gained the five supernatural knowledges.",
        "source": "T08n0222_001:0147a16_2"
    },
    {
        "source_sentence": "所言聰捷無有懈怠，蠲捨家利所慕之心，所說經法不僥供養，致深妙法度於無極，",
        "translation": "They are wise and quick-witted, without laziness. They give up their home for the benefit of all living beings with a mind attached to what they cherish. The scriptures and doctrines taught by them they do not make offerings in an unworthy manner, so as to bring about the transcendence of the profound and sublime truth.",
        "source": "T08n0222_001:0147a16_3"
    },
    {
        "source_sentence": "得無所畏超越魔事，脫於一切陰蓋之礙，講諸因緣心志所趣；",
        "translation": "They attain fearlessness, transcend demonic acts, are freed from all hindrances of the aggregates, and expound causes and conditions as their destination.",
        "source": "T08n0222_001:0147a18_4"
    },
    {
        "source_sentence": "從無數劫精進行願，其意所向，喜悅問訊常先於人，離於結恨；",
        "translation": "He had undertaken these vows for countless eons, and his mind was directed toward them. Delighted to greet him with joy, he always preceded others and divorced all enmity.",
        "source": "T08n0222_001:0147a19_5"
    },
    {
        "source_sentence": "入於無數眾會之中，威勢巍巍無所畏難，憶念無量姟劫之事；",
        "translation": "He entered countless assemblies, majestic and mighty, without fear or difficulty. He remembered the events of innumerable past eons.",
        "source": "T08n0222_001:0147a21_6"
    },
    {
        "source_sentence": "若說經法曉練眾義，猶如幻、化、野馬、水月、夢與影、響，若鏡中像，",
        "translation": "If he teaches the teachings of the scriptures and explains their meanings, it's like an illusion, a transformation, a wild horse, the moon in water, a dream with its shadow or sound, or an image in a mirror.",
        "source": "T08n0222_001:0147a22_7"
    },
    {
        "source_sentence": "勇猛無侶；",
        "translation": "They were courageous and without companions.",
        "source": "T08n0222_001:0147a24_8"
    },
    {
        "source_sentence": "以微妙慧，知眾生心所起所行，超度分別，意不懷害，慇懃忍辱具足所行，",
        "translation": "By subtle wisdom they know the thoughts and actions of sentient beings, transcend discrimination, don’t harm in their minds, practice with tolerance and forbearance.",
        "source": "T08n0222_001:0147a24_9"
    },
    {
        "source_sentence": "曉了審諦所當度者，攝取佛土無限之願，常三昧定，目覩無數諸佛世界，",
        "translation": "Those who clearly understand and thoroughly examine what should be liberated, taking in the infinite vows of all buddha-lands, always concentrating in concentration, their eyes pervading countless buddha-realms.",
        "source": "T08n0222_001:0147a26_10"
    },
    {
        "source_sentence": "暢達宜便，啟請無量諸佛世尊；",
        "translation": "At Changda’s convenience he invited innumerable buddhas and world-honored ones.",
        "source": "T08n0222_001:0147a27_11"
    },
    {
        "source_sentence": "進退能決若干種見所著之處，定意自娛解百千行，諸菩薩者德皆如是——其名曰颰陀和菩薩、羅隣那竭菩薩、摩訶須菩和菩薩、那羅達菩薩、嬌日兜菩薩、和輪調菩薩、因坻菩薩、賢守菩薩、妙意菩薩、持意菩薩、增意菩薩、不虛見菩薩、立願菩薩、周旋菩薩、常精進應菩薩、不置遠菩薩、日盛菩薩、無吾我菩薩、光世音菩薩、漸首菩薩、寶印首菩薩、常舉手菩薩、常下手菩薩、慈氏菩薩。",
        "translation": "The enlightening beings’ virtues are all like this-they are called Gandhamādana Bodhisattva, Rāmaṅga Bodhisattva, Mahāsubha Bodhisattva, Nārada Bodhisattva, Kauṇḍinya Bodhisattva, harmonizing with the sun and the moon bodhisattva, tamed by the wind of harmony,",
        "source": "T08n0222_001:0147a28_12"
    },
    {
        "source_sentence": "諸菩薩眾如是難限，不可計數億百千姟一切妙德清淨同真。",
        "translation": "The congregation of bodhisattvas is so difficult to limit that it can't be counted by millions or hundreds of millions, and all their marvelous qualities are pure and the same as true.",
        "source": "T08n0222_001:0147b08_13"
    },
    {
        "source_sentence": "爾時世尊，坐於自然師子床座而結加趺正身而處，心有所向、制立其意。",
        "translation": "At the time, the Bhagavān was sitting on a natural lion's seat with his body straightened and facing toward him, directing his mind and regulating his thoughts.",
        "source": "T08n0222_001:0147b09_14"
    },
    {
        "source_sentence": "有三昧名定意王，以時三昧自然正受，則皆普入一切定意，救攝平等，",
        "translation": "There is a samādhi called the king of mental concentration. When one enters it spontaneously and naturally, they enter all states of mental concentration to save and embrace equanimity.",
        "source": "T08n0222_001:0147b11_15"
    },
    {
        "source_sentence": "御而趣之。",
        "translation": "He controls it and goes to it.",
        "source": "T08n0222_001:0147b12_16"
    },
    {
        "source_sentence": "佛適三昧其心安寂，而以道眼觀斯世界，其身湛然而笑，從其足心放六萬億百千光明，",
        "translation": "When the Buddha entered samādhi his mind was at ease, and while observing this world with the eye of enlightenment, his body smiled calmly. From his feet sixty-thousand myriads of koṭis of rays of light emanated from his mind.",
        "source": "T08n0222_001:0147b13_17"
    },
    {
        "source_sentence": "十足指放十億百千光明，兩脇放二億百千光明，兩膝放二億百千光明，",
        "translation": "His perfect fingers radiated billions of hundreds of millions of rays of light; his two shoulders radiated billions of rays of light, and his knees radiated billions of rays of light.",
        "source": "T08n0222_001:0147b15_18"
    },
    {
        "source_sentence": "兩腳放二億百千光明，兩肩放二億百千光明，兩肘放二億百千光明，臍放二億百千光明，",
        "translation": "Two hundred million and one hundred thousand rays of light emanated from each leg, two hundred million and one hundred thousand rays of light emanated from each shoulder, two hundred million and one hundred thousand rays of light emanated from each elbow, and two hundred million and one hundred thousand rays of light emanated from each navel.",
        "source": "T08n0222_001:0147b16_19"
    },
    {
        "source_sentence": "頭放億百千光明，兩手指放十億百千光明，兩臂放二億百千光明，兩眉放二億百千光明，",
        "translation": "His head radiated billions of hundreds of thousands of rays of light; his two fingers radiated billions of rays of light; his two arms radiated millions of rays of light; and his two eyebrows radiated millions of rays of light.",
        "source": "T08n0222_001:0147b18_20"
    },
    {
        "source_sentence": "項放億百千光明，兩眼放二億百千光明，兩耳放二億百千光明，鼻放億百千光明，",
        "translation": "The neck emitted billions of hundreds of thousands of rays of light; the two eyes emitted billions of rays of light; the two ears emitted millions of rays of light; and the nose emitted billions of rays of light.",
        "source": "T08n0222_001:0147b20_21"
    },
    {
        "source_sentence": "四面放四百億百千光明，四十齒放四十億百千光明，眉間相放億百千光明，",
        "translation": "On each of the four sides he radiated four quadrillion hundred million rays of light. The forty-fourth tooth showed four quadrillion hundred million rays of light. Between his eyebrows were shining ten million rays of light.",
        "source": "T08n0222_001:0147b22_22"
    },
    {
        "source_sentence": "頂結相放六萬億百千光明，照此三千大千世界無所不周，普曜東方江河沙等諸佛國土，",
        "translation": "The topknot of the enlightening being emanated sixty-thousand myriadstical koṭis of rays of light from each other, illumining these great manifold cosmos with a thousand worlds. They shone on all buddha-lands as numerous as the sands of rivers in the east.",
        "source": "T08n0222_001:0147b24_23"
    },
    {
        "source_sentence": "南方西方北方四隅上下皆亦如是。",
        "translation": "It's likewise in the south, west, north, four corners, and up and down.",
        "source": "T08n0222_001:0147b26_24"
    },
    {
        "source_sentence": "其有眾生蒙值光明，心皆恬怕，悉發無上正真之道。",
        "translation": "Those sentient beings who saw the light were all tranquil and fearful, and they all aroused the unsurpassed true path.",
        "source": "T08n0222_001:0147b27_25"
    },
    {
        "source_sentence": "於是世尊即時欣笑，從諸毛孔放眾光明，照此三千大千世界，普遍十方無不周接。",
        "translation": "The World-honored One then smiled with delight, emanating rays of light from all his pores that illumined the great manifold cosmos and extended everywhere in the ten directions.",
        "source": "T08n0222_001:0147b28_26"
    },
    {
        "source_sentence": "江河沙等諸佛世界，其有群萌，為光所照悉皆寂然，存于無上正真之道。",
        "translation": "All the buddha worlds as numerous as the grains of sand in rivers and streams, with their myriad sprouts illumined by that light, all remained silent, preserving the unsurpassed true path.",
        "source": "T08n0222_001:0147b30_27"
    },
    {
        "source_sentence": "是時世尊則演如來清淨真妙志性光明，照此三千大千世界，普及十方各江河沙等諸佛國土，",
        "translation": "Then the Bhagavat manifested the light of the pure, true, sublime determination of the buddhas. Illumining this billion-world-galactic universe, he extended it to all the buddha-lands as numerous as the grains of sand in the ten directions.",
        "source": "T08n0222_001:0147c02_28"
    },
    {
        "source_sentence": "假令人民逮斯光者，則皆究竟至於無上正真之道。",
        "translation": "If someone were to allow the people to acquire this light, they would all ultimately reach the unsurpassed true path.",
        "source": "T08n0222_001:0147c04_29"
    },
    {
        "source_sentence": "於是世尊從其舌本悉覆佛土，而出無數億百千光明，照此三千大千世界，",
        "translation": "Then the World-honored One emanated countless millions of hundreds of millions of rays of light from his tongue, covering all the buddha-lands. They illumined this billion-world-galactic universe.",
        "source": "T08n0222_001:0147c05_30"
    },
    {
        "source_sentence": "周遍十方各江河沙等諸佛國土。",
        "translation": "It pervades all the buddha lands in the ten directions, such as the rivers and sands of the rivers in each of the buddha lands.",
        "source": "T08n0222_001:0147c07_31"
    },
    {
        "source_sentence": "其光明中，自然而殖金寶蓮華，其蓮華上各有諸佛，結加趺坐寶蓮華，",
        "translation": "In that ray of light there were golden lotus blossoms growing spontaneously. On each of those lotus blossoms were buddhas sitting cross-legged on jeweled lotus blossoms.",
        "source": "T08n0222_001:0147c08_0"
    },
    {
        "source_sentence": "講說經法，演於六波羅蜜；",
        "translation": "They expound the teachings of scriptures and expound the six transcendent ways.",
        "source": "T08n0222_001:0147c09_1"
    },
    {
        "source_sentence": "十方一切亦復如是。",
        "translation": "So it is with everything in the ten directions.",
        "source": "T08n0222_001:0147c10_2"
    },
    {
        "source_sentence": "若有眾生聞斯法講，一切究竟皆得堅住阿耨多羅三耶三菩。",
        "translation": "If there are sentient beings who hear this teaching, they'll all ultimately attain resolute abiding in unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0222_001:0147c10_3"
    },
    {
        "source_sentence": "於是世尊坐師子床，有三昧名師子娛樂，以斯定意自然正受，如其色像，",
        "translation": "The World-honored One then sat on the lion’s seat, having entered concentration called lion-entertainment. Because of this concentration, he received it naturally and correctly, according to its color and shape:",
        "source": "T08n0222_001:0147c12_4"
    },
    {
        "source_sentence": "咸演威曜示現神足。",
        "translation": "They all spoke with authoritative radiance and showed their miraculous abilities.",
        "source": "T08n0222_001:0147c13_5"
    },
    {
        "source_sentence": "三千大千世界六反震動，邊際亦搖，中順至邊，安和柔軟，愍傷一切眾生之類，",
        "translation": "The great manifold cosmos shakes in six ways; its limits also tremble, going from one end to the other. Being peaceful and gentle, it pities all living beings.",
        "source": "T08n0222_001:0147c14_6"
    },
    {
        "source_sentence": "令獲安隱快樂無患。",
        "translation": "He causes them to attain peace and happiness without suffering.",
        "source": "T08n0222_001:0147c16_0"
    },
    {
        "source_sentence": "爾時三千大千世界地獄、餓鬼、畜生，諸不閑者、恐懅厄者，自然為斷三塗，",
        "translation": "It was then that the hells, hungry ghosts, and animals of the 3,000 great one-thousand worlds were naturally cut off from the three destinies for those who were not at leisure and fearful.",
        "source": "T08n0222_001:0147c16_1"
    },
    {
        "source_sentence": "除已悉自致來，得生為人、四天王、忉利天、鹽天、兜術天、尼摩羅天、波羅尼蜜天。",
        "translation": "In addition, they are all self-caused and can be born as humans, the four heavenly kings, the Trāyastriṃśa gods, the salt gods, the Tuṣita gods, the Nirmāṇarati gods, and the Paranirmita-vaśavartin gods.",
        "source": "T08n0222_001:0147c18_2"
    },
    {
        "source_sentence": "於時諸天適生彼間人中天上，即識宿命，歡喜悅豫，往詣佛所，稽首足下叉手歸命，",
        "translation": "When the gods were about to be born among humans in heaven, they knew their past lives and rejoiced joyfully. They approached the Buddha, bowed their heads at his feet, saluted him with palms joined together, and passed away.",
        "source": "T08n0222_001:0147c19_3"
    },
    {
        "source_sentence": "十方一切亦復如是，等無差特。",
        "translation": "So it is with everything in the ten directions, equal and without distinction.",
        "source": "T08n0222_001:0147c21_4"
    },
    {
        "source_sentence": "爾時此三千世界眾生之類，盲者得目而覩色像，聾者徹聽聞諸音聲，志亂意惑還復其心，",
        "translation": "At the time, all these sentient beings in 3,000 worlds were blind and dumb-eyed. The deaf could hear sounds everywhere, but their minds were distracted by thought and returned to their own minds.",
        "source": "T08n0222_001:0147c22_5"
    },
    {
        "source_sentence": "迷憤者則時得定；",
        "translation": "Those who are deluded and angry will attain equipoise at the right time.",
        "source": "T08n0222_001:0147c24_6"
    },
    {
        "source_sentence": "其裸形者自然衣服，其飢虛者自然飽滿，其消渴者無所思僥，其疾病者而得除愈，",
        "translation": "Those who are naked naturally dressed, those who are hungry naturally satisfied, those who are free from thirst have no thoughts of happiness, and those who are sick are cured.",
        "source": "T08n0222_001:0147c24_7"
    },
    {
        "source_sentence": "身瑕玼者諸根具足；",
        "translation": "Those with flaws in the body are endowed with all faculties.",
        "source": "T08n0222_001:0147c26_8"
    },
    {
        "source_sentence": "其疲極者自然得解，久猗身者則無所猗。",
        "translation": "Those who are extremely exhausted will naturally attain liberation, and those who remain in the body for a long time will have no place to rest.",
        "source": "T08n0222_001:0147c27_9"
    },
    {
        "source_sentence": "一切眾生得平等心，展轉相瞻，如父如母、如兄如弟、如姊如妹，各各同心等無偏邪、皆行慈心；",
        "translation": "All sentient beings attain impartial minds and, in turn, look out for each other like fathers, mothers, brothers, younger brothers, sisters, or sisters—every one of them are the same-minded, without partiality or difference, all acting with kindness.",
        "source": "T08n0222_001:0147c28_10"
    },
    {
        "source_sentence": "一切群萌悉修十善，清淨梵行無有塵埃；",
        "translation": "All sentient beings cultivate the ten wholesome practices, pursuing pure religious practice without dust.",
        "source": "T08n0222_001:0148a01_11"
    },
    {
        "source_sentence": "一切黎庶悉獲安隱，所得安隱猶如比丘得第三禪。",
        "translation": "All the common people will attain peace, and they'll attain peace like a monk attaining the third dhyāna.",
        "source": "T08n0222_001:0148a02_12"
    },
    {
        "source_sentence": "于時眾生而致智慧，而悉具足善快調定，離於卑劣、逮得和雅。",
        "translation": "The sentient beings then attain wisdom, are fully endowed with goodness and well-adjusted concentration, are free of inferiority, and attain harmony.",
        "source": "T08n0222_001:0148a03_13"
    },
    {
        "source_sentence": "於是世尊在師子床，處於三千大千世界，而最超異威神巍巍，光燿煌煌無有畏懼，",
        "translation": "At that time the World-honored One was seated on a lion’s seat in the great chiliocosm of the universe called trichiliocosm, surpassing all the other buddhas and endowed with transcendent majesty. His light shone brilliantly without fear or fright.",
        "source": "T08n0222_001:0148a04_14"
    },
    {
        "source_sentence": "聖明輝赫尊顏具足，無不周普照于東方江河沙等諸佛世界，八維上下各江河沙等世尊國土，",
        "translation": "His holy light shines brilliantly, and his glorious countenance is complete. He illumines all buddha-lands as numerous as the grains of sand in rivers in the eastern direction with a ray of light equal to the number of world-honored ones’ oceans of fragrant streams in each of the eight directions.",
        "source": "T08n0222_001:0148a06_15"
    },
    {
        "source_sentence": "如須彌山超踰一切諸山之上，明在所通。",
        "translation": "It's like Mount Sumeru, which surpasses all the other mountains and explains what it penetrates.",
        "source": "T08n0222_001:0148a09_0"
    },
    {
        "source_sentence": "於是世尊承如來旨已，自然聖令三千大千世界眾生悉共瞻覩。",
        "translation": "The Bhagavān then accepted the Tathāgata's teaching, naturally and noblely causing sentient beings in 3,000 great one-thousand worlds to look out for him.",
        "source": "T08n0222_001:0148a09_1"
    },
    {
        "source_sentence": "時此世界，首陀衛淨居諸天，梵天、波羅尼蜜天、尼摩羅天、兜術天、鹽天、忉利天、四天王天及三千大千世界所居人民，",
        "translation": "In this world, the gods of Sudarśana, Brahmadeva, Paranirmita-vaśavartin, Nirmāṇarati, Tuṣita, Yama, Trāyastriṃśa gods, the four guardian gods of heaven, and the inhabitants of the great chiliocosm lived.",
        "source": "T08n0222_001:0148a11_2"
    },
    {
        "source_sentence": "自然見身親近如來，皆得自然天華傅餝、天香天雜香天搗香、天青蓮芙蓉鮮華，",
        "translation": "They naturally see their bodies and become intimate with the Buddha, and they all attain spontaneous celestial flowers, heavenly fragrances, heavenly mixed fragrances, heavenly pounded fragrances, and heavenly blue lotus blossoms, red lotus blossoms, and fresh flowers.",
        "source": "T08n0222_001:0148a13_3"
    },
    {
        "source_sentence": "諸妙天華莖葉具足，各各發行齎詣如來，稽首佛足各散佛上，及於人間水陸諸花，",
        "translation": "The stems and leaves of the exquisite celestial flowers were all plentiful, each bringing them to the Enlightened One. They bowed their heads at the Buddha’s feet and scattered them over him, as well as the flowers growing in the water and on land among the people.",
        "source": "T08n0222_001:0148a15_4"
    },
    {
        "source_sentence": "各各手執，往詣世尊而為供養。",
        "translation": "Each of them took it in their hands and went to the Bhagavān to make offerings.",
        "source": "T08n0222_001:0148a17_5"
    },
    {
        "source_sentence": "諸天人民所散供養諸華之具，上在虛空，三千大千世界化為宮殿自然樓觀，",
        "translation": "The heavenly beings and goddesses scattered offerings of flowers in the sky above, transforming a thousand worlds into palaces, natural towers, and mansions.",
        "source": "T08n0222_001:0148a18_6"
    },
    {
        "source_sentence": "從其宮殿垂諸天華繒蓋幢幡，紛葩飄颺顯灼普現，其諸花香莊嚴三千大千佛國，",
        "translation": "From the palace hung celestial flowers, canopies, banners, and pennants. The fragrance of these flowers adorned the great chiliocosm of buddhahood.",
        "source": "T08n0222_001:0148a20_7"
    },
    {
        "source_sentence": "自然巍巍，形像眾色如紫磨金，八維上下芬馥晃昱亦復如是。",
        "translation": "It was naturally majestic, its form and colors like purple polished gold, and so was the fragrance and splendor of the eight-by-eight squares above and below.",
        "source": "T08n0222_001:0148a22_8"
    },
    {
        "source_sentence": "於是閻浮提城所有人民，瞻覩如來現身威變不可稱計，各心念言：「今日如來坐於我前。」",
        "translation": "The people in the city of Jambudvīpa then looked at the Tathāgata's manifest body with unfathomable authority, and each thought, Today, the Tathāgata is sitting here in front of me.",
        "source": "T08n0222_001:0148a23_9"
    },
    {
        "source_sentence": "普佛國土亦復如是，各各心念：「今日如來在我前坐而說經法。」",
        "translation": "So it is with all the buddha lands, each thinking, Today, the Tathāgata is sitting here in front of me and explaining the sūtras and teachings.",
        "source": "T08n0222_001:0148a25_10"
    },
    {
        "source_sentence": "於時世尊在師子床更復欣笑，加復重照三千大千世界，弘光赫弈。",
        "translation": "At the time, the Bhagavān was again smiling joyfully on the lion's seat, and he illuminated the 3,000 great one-thousand worlds again and again, shining brilliantly and playing happily.",
        "source": "T08n0222_001:0148a27_0"
    },
    {
        "source_sentence": "此土人民悉共覩見東方江河沙等諸佛國土，現在如來、至真、等正覺與諸菩薩聲聞之眾；",
        "translation": "The people of this land all saw the buddha-lands as numerous as the grains of sand in rivers in the east, and now the enlightened ones, those who had attained unexcelled, perfect enlightenment, were together with the assembly of bodhisattvas, disciples, and śrāvakas.",
        "source": "T08n0222_001:0148a28_1"
    },
    {
        "source_sentence": "又復東方江河沙等諸佛世界所有眾生，悉亦遙見此佛國土釋迦文佛與比丘僧及諸菩薩而坐說經；",
        "translation": "“Furthermore, all the sentient beings in buddha-lands as numerous as the grains of sand in rivers in the eastern east also saw from afar the Buddha Śākyamuni and his disciples, enlightening beings, monks, and other enlightening beings sitting there expounding the Teaching.",
        "source": "T08n0222_001:0148b01_2"
    },
    {
        "source_sentence": "八維上下亦復如是，悉遙見此，等無差特。",
        "translation": "The same applies upward and downward in the eightfold dimension. All see this from a distance, equal and without distinction.",
        "source": "T08n0222_001:0148b03_3"
    },
    {
        "source_sentence": "於是過東方江河沙等諸佛世界，最邊國土名寶迹，其佛號寶事如來、至真、等正覺，",
        "translation": "In the east, past as many buddha-fields as there are grains of sand in rivers and streams in the eastern direction, the most distant land is called Jeweled Site. The buddhas there are called Jewel-Deeding Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T08n0222_001:0148b04_4"
    },
    {
        "source_sentence": "今現在為諸眾生，亦復講說《摩訶般若波羅蜜經》。",
        "translation": "Now, for the sake of sentient beings, he's also taught the Mahāprajñāpāramitā-sūtra.",
        "source": "T08n0222_001:0148b06_5"
    },
    {
        "source_sentence": "彼時其佛世界，而有菩薩號曰普明，覩大光明及地大動，即便往詣寶事如來，",
        "translation": "In that buddha-realm there was a bodhisattva named Samantabhadra, who manifested great light and the earth shook with trembling trembling trembling thunder. Then he went to see the Tathāgata Prakaraṇabuddha.",
        "source": "T08n0222_001:0148b07_6"
    },
    {
        "source_sentence": "稽首問曰：「唯然，世尊！",
        "translation": "He bowed his head and asked, Yes, Bhagavān!",
        "source": "T08n0222_001:0148b09_7"
    },
    {
        "source_sentence": "以何因緣，其大光明照此佛土、地大震動？",
        "translation": "For what reason did that great ray of light illuminate this buddha-land and the earth tremble?",
        "source": "T08n0222_001:0148b10_8"
    },
    {
        "source_sentence": "諸如來身自然為見，會當有意。」",
        "translation": "The bodies of the tathāgatas are naturally seen, and they will arise with intention.",
        "source": "T08n0222_001:0148b11_9"
    },
    {
        "source_sentence": "彼佛告於普明菩薩曰：「族姓子！",
        "translation": "The Buddha told Samantabhadra Bodhisattva, Clansman!",
        "source": "T08n0222_001:0148b11_10"
    },
    {
        "source_sentence": "欲知西方極遠有忍世界，其佛號曰釋迦文如來，今現在為諸菩薩說般若波羅蜜。",
        "translation": "Wishing to know that there's a world of forbearance in the West that's extremely distant, the Buddha named Śākyamuni Tathāgata is now teaching the prajñāpāramitā for bodhisattvas.",
        "source": "T08n0222_001:0148b12_11"
    },
    {
        "source_sentence": "是其威神光也。」",
        "translation": "This is their authoritative and miraculous radiance.",
        "source": "T08n0222_001:0148b14_12"
    },
    {
        "source_sentence": "普明菩薩白寶事如來：「唯然，世尊！",
        "translation": "Samantabhadra Bodhisattva said to the Tathāgata Prabhūtaratna, Yes, Bhagavān!",
        "source": "T08n0222_001:0148b14_13"
    },
    {
        "source_sentence": "我欲詣彼見釋迦牟尼如來，稽首作禮；",
        "translation": "I wished to go there to see the Buddha Śākyamuni, bowed my head in respect, and made obeisance.",
        "source": "T08n0222_001:0148b15_14"
    },
    {
        "source_sentence": "及諸菩薩摩訶薩眾童真等，得總持究竟三昧，定意自在，得度無極，釋迦牟多阿竭、阿羅訶、三耶三佛。」",
        "translation": "And the bodhisattvas, mahāsattvas, children, and so forth attain the ultimate absorption of total maintenance, concentrate their minds freely, and attain liberation without limit, such as Śākyamuni, Arhat, and Samyak-saṃbuddha.",
        "source": "T08n0222_001:0148b16_15"
    },
    {
        "source_sentence": "寶事如來阿羅呵、三耶三佛告普明菩薩曰：「往，善男子！",
        "translation": "The Jeweled Tathāgata Ārāha and the three samaya buddhas told Samantabhadra Bodhisattva, Go there, good man!",
        "source": "T08n0222_001:0148b19_0"
    },
    {
        "source_sentence": "汝知是時。」",
        "translation": "You know it's the right time.",
        "source": "T08n0222_001:0148b20_1"
    },
    {
        "source_sentence": "寶事如來賜普明菩薩金色蓮華而有千葉：「取，善男子！",
        "translation": "The Jeweled Tathāgata bestows a golden lotus flower of the bodhisattva Samantabhadra with a thousand leaves and one thousand leaves, Take it, good man!",
        "source": "T08n0222_001:0148b20_2"
    },
    {
        "source_sentence": "此寶蓮華以用供散釋迦牟如來。",
        "translation": "These jeweled lotus flowers are used as an offering to the Śākyamuni Tathāgata.",
        "source": "T08n0222_001:0148b21_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T08n0222_001:0148b22_4"
    },
    {
        "source_sentence": "欲往修寂然行，忍界菩薩生彼土者，甚有患難亦難值遇。」",
        "translation": "Those who want to cultivate tranquil practices in the forbearance realm and bodhisattvas born in that land will have great difficulties and hardships, and it's difficult to meet them.",
        "source": "T08n0222_001:0148b22_5"
    },
    {
        "source_sentence": "普明菩薩即受其金色蓮華，與無央數億百千姟諸菩薩眾男女、大小、居家、出家，",
        "translation": "The bodhisattva Samantabhadra then accepted the golden lotus and gave it to measureless millions of hundreds of millions of enlightening beings, male and female, large and small, householders and renunciants.",
        "source": "T08n0222_001:0148b23_6"
    },
    {
        "source_sentence": "則以供養東方諸佛天中天，承事歸命，上諸華香雜香搗香。",
        "translation": "They then made offerings to the buddhas of the gods in the heavens in the eastern direction, honored them and returned to their lives, and offered flowers, incense, mixed incense, pounded incense, and fragrant.",
        "source": "T08n0222_001:0148b25_7"
    },
    {
        "source_sentence": "次復詣釋迦牟如來，稽首足下，却住一面，普明菩薩白世尊曰：「唯然，",
        "translation": "Then he approached the Buddha Śākyamuni, bowed his head at his feet, and withdrew to one side. The enlightening being Universal Illumination said to the World-honored One:",
        "source": "T08n0222_001:0148b27_8"
    },
    {
        "source_sentence": "大聖！",
        "translation": "Great sage!",
        "source": "T08n0222_001:0148b28_9"
    },
    {
        "source_sentence": "寶事如來敬問無量，乞求輕便，力行安乎？",
        "translation": "The Tathāgata Prabhūtaratna respectfully asked immeasurable questions, begging for a lighter ride, and doing so with ease. Is it possible to do so?",
        "source": "T08n0222_001:0148b28_10"
    },
    {
        "source_sentence": "又復遣進金色蓮華。」",
        "translation": "Again, he sends out a golden lotus flower.",
        "source": "T08n0222_001:0148b29_11"
    },
    {
        "source_sentence": "佛受蓮華，尋以遙散東方江河沙諸佛國土。",
        "translation": "When the Buddha received the lotus flowers, he found them scattered far and wide over the buddha lands of the rivers and sands of the east.",
        "source": "T08n0222_001:0148c01_12"
    },
    {
        "source_sentence": "其華即時周遍東方諸佛世界，有佛坐於自然金色蓮華，講說經法，亦復演斯六波羅蜜。",
        "translation": "The flowers immediately pervaded all the buddha worlds in the east, and there was a buddha sitting on a naturally golden lotus flower that taught the sūtras and teachings, also expounding these six perfections.",
        "source": "T08n0222_001:0148c02_13"
    },
    {
        "source_sentence": "其有眾生聞此說者，一切究竟即時堅住於阿耨多羅三耶三菩。",
        "translation": "If there are sentient beings who hear this teaching, they'll all ultimately and immediately abide resolutely in unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0222_001:0148c04_14"
    },
    {
        "source_sentence": "男女大小悉禮佛足，各以功德，供養多阿竭、阿羅呵、三耶三菩。",
        "translation": "Both men and women, large and small, bowed at the Buddha's feet, each making offerings of their merits to Tathāgata, Arhat, and Samyak-saṃbuddha.",
        "source": "T08n0222_001:0148c05_15"
    },
    {
        "source_sentence": "南方去此江河沙等最極邊際，有佛世界，名曰離一切憂，其佛號無憂首多阿竭、阿羅呵、三耶三佛。",
        "translation": "At the south, at the most extreme limitless of these rivers and sands, is a buddha world called freedom from all sorrow. The Buddha there is called Aśoka; his name is Shouta-āga, Ārāha, and Samyak-saṃbuddha.",
        "source": "T08n0222_001:0148c07_16"
    },
    {
        "source_sentence": "彼有菩薩名離戚，啟辭其佛，佛賜蓮華，與無數菩薩俱，經諸國土供養諸佛，",
        "translation": "There was a bodhisattva there named Liqi, who said goodbye to the Buddha. The Buddha bestowed upon him a lotus flower and accompanied by innumerable other bodhisattvas came from various lands to make offerings to the buddhas.",
        "source": "T08n0222_001:0148c09_17"
    },
    {
        "source_sentence": "來詣釋迦牟尼如來，稽首供養，却坐聽經。",
        "translation": "They came to the Tathāgata Śākyamuni, bowed their heads in homage, and withdrew to listen to the sūtras.",
        "source": "T08n0222_001:0148c11_18"
    },
    {
        "source_sentence": "西方去此江河沙等，有世界名曰寂然，其佛號寶龍多阿竭、阿羅呵、三耶三佛。",
        "translation": "In the west, there's a world named quiescence that's far removed from these rivers and sands, and its buddhas are called the jeweled dragon-tathāgata, arāha, and samyak-saṃbuddha.",
        "source": "T08n0222_001:0148c12_19"
    },
    {
        "source_sentence": "彼有菩薩名曰意行，啟辭其佛，佛賜蓮華，與無數菩薩俱，經諸國土供養諸佛，",
        "translation": "There was an enlightening being there named Mind Acting, who said goodbye to the Buddha. The Buddha bestowed upon him a lotus flower and accompanied by innumerable enlightening beings came from various lands to make offerings to the buddhas.",
        "source": "T08n0222_001:0148c14_20"
    },
    {
        "source_sentence": "來詣釋迦牟尼如來，稽首供養，却坐聽經。",
        "translation": "They came to the Tathāgata Śākyamuni, bowed their heads in homage, and withdrew to listen to the sūtras.",
        "source": "T08n0222_001:0148c15_21"
    },
    {
        "source_sentence": "北方去此江河沙等，有世界名曰致勝，其佛號勝諸根多阿竭、阿羅訶、三耶三佛。",
        "translation": "In the north, there's a world named Vaiśeṣika that's far removed from these rivers and sands, and its buddhas are called Vaiśravaṇa, the Tathāgata, Arhat, and Samyak-saṃbuddha of the faculties.",
        "source": "T08n0222_001:0148c17_0"
    },
    {
        "source_sentence": "彼有菩薩名曰施勝，啟辭其佛，佛賜蓮華，與無數菩薩俱，經諸國土供養諸佛，",
        "translation": "There was an enlightening being there named Supremely generous, who said goodbye to the Buddha. The Buddha bestowed upon him a lotus flower and accompanied by innumerable enlightening beings traveled through many lands to make offerings to the buddhas.",
        "source": "T08n0222_001:0148c18_1"
    },
    {
        "source_sentence": "詣釋迦牟如來，稽首供養，却坐聽經。",
        "translation": "He approached the Tathāgata Śākyamuni, bowed his head in homage, and withdrew to listen to the sutra.",
        "source": "T08n0222_001:0148c20_2"
    },
    {
        "source_sentence": "下方去此江河沙等，有世界名曰仁賢，其佛號賢首多阿竭、阿羅呵、三耶三佛。",
        "translation": "At the bottom, beyond these rivers and sands, there's a world named仁賢, whose buddhas are called Xianshoudagata, Ārāha, and Samyak-saṃbuddha.",
        "source": "T08n0222_001:0148c21_3"
    },
    {
        "source_sentence": "彼土有菩薩名曰蓮華上，啟辭其佛，佛賜蓮華，與無數菩薩俱，經諸國土供養諸佛，",
        "translation": "In that land there was a bodhisattva named Padmavyūha, who said goodbye to the Buddha. The Buddha bestowed upon him a lotus flower and accompanied by innumerable other bodhisattvas from all the buddha-fields of the ten directions as offerings to those buddhas.",
        "source": "T08n0222_001:0148c23_4"
    },
    {
        "source_sentence": "詣釋迦牟如來，稽首供養，却坐聽經。",
        "translation": "He approached the Tathāgata Śākyamuni, bowed his head in homage, and withdrew to listen to the sutra.",
        "source": "T08n0222_001:0148c25_5"
    },
    {
        "source_sentence": "上方去此江河沙等，有世界名曰欣樂，其佛號樂首多阿竭、阿羅呵、三耶三佛。",
        "translation": "Above them, beyond these rivers and sands, there's a world named Delightful, whose buddhas are called the blissful srota-āga, arhat, and samyak-saṃbuddha.",
        "source": "T08n0222_001:0148c26_6"
    },
    {
        "source_sentence": "彼有菩薩名施樂，啟辭其佛，佛賜蓮華，與無數菩薩俱，經諸國土供養諸佛，",
        "translation": "There was an enlightening being there named Blissful Giving, who said goodbye to the Buddha. The Buddha bestowed upon him a lotus flower and accompanied by innumerable enlightening beings came from various lands to offer support to the buddhas.",
        "source": "T08n0222_001:0148c27_7"
    },
    {
        "source_sentence": "詣釋迦牟如來，稽首供養，却坐聽經。",
        "translation": "He approached the Tathāgata Śākyamuni, bowed his head in homage, and withdrew to listen to the sutra.",
        "source": "T08n0222_001:0148c29_8"
    },
    {
        "source_sentence": "其四維者，亦復如是，等無差特。",
        "translation": "The four intermediate directions are likewise, without distinction.",
        "source": "T08n0222_001:0149a01_9"
    },
    {
        "source_sentence": "爾時於此三千大千世界，尋即而雨諸寶華香幡蓋，自然莊嚴香樹花樹，",
        "translation": "At that time, in the great manifold cosmos of the 3,000 great one-thousand worlds, it rained jewel flowers, fragrant banners, canopies, and naturally adorned fragrant trees.",
        "source": "T08n0222_001:0149a02_10"
    },
    {
        "source_sentence": "譬如蓮華跡世界普華多阿竭、阿羅訶、三耶三佛佛土，溥首菩薩所遊居處。",
        "translation": "It's like the lotus flower trace world, the buddha land of Samantabhadra, arhatship, and samyak-saṃbuddha, where Puṣya Bodhisattva travels and lives.",
        "source": "T08n0222_001:0149a03_11"
    },
    {
        "source_sentence": "善住意諸天子及餘大神尊勢無極菩薩之眾，世尊所與，及餘諸天、世間人民皆來聚會。",
        "translation": "The well-abiding celestial beings and other great deities, gods, and bodhisattvas of great spiritual power and infinite enlightenment, the Bhagavān, the other gods, and the people of the world all came to assemble.",
        "source": "T08n0222_001:0149a05_12"
    },
    {
        "source_sentence": "諸魔、梵天并聲聞眾，揵沓惒、阿須倫神人民悉普來會。",
        "translation": "Māra, the Brahma gods, the Brahmā gods, the śrāvakas, the gandharvas, and the asuras all came to the assembly.",
        "source": "T08n0222_001:0149a07_13"
    },
    {
        "source_sentence": "此諸菩薩摩訶薩為童子時，所服飲食功德自然。",
        "translation": "When these bodhisattvas and mahāsattvas were children, the merit of food and drink they drank naturally.",
        "source": "T08n0222_001:0149a08_14"
    },
    {
        "source_sentence": "爾時世尊告賢者舍利弗：「於斯若有菩薩摩訶薩，便當精修學般若波羅蜜。」",
        "translation": "It was then that the Bhagavān addressed the good man Śāriputra, If there are bodhisattvas and mahāsattvas here, they will diligently cultivate the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0149a10_0"
    },
    {
        "source_sentence": "舍利弗白佛：「唯然，世尊！",
        "translation": "Śāriputra said to the Buddha, Yes, Bhagavān!",
        "source": "T08n0222_001:0149a11_1"
    },
    {
        "source_sentence": "云何菩薩摩訶薩一切具足、曉解諸法，學般若波羅蜜乎？」",
        "translation": "How does a bodhisattva-mahāsattva who is fully endowed with all the dharmas and understands them learn the perfection of prajñā?",
        "source": "T08n0222_001:0149a12_2"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩摩訶薩住於般若波羅蜜已修無處所，即便具足檀波羅蜜；",
        "translation": "The Buddha said to Śāriputra: “When great enlightening beings abide in the transcendent wisdom, there is no place for them to cultivate it and yet they are fully endowed with the transcendent giving.",
        "source": "T08n0222_001:0149a13_3"
    },
    {
        "source_sentence": "令不缺減，有所施與、無所愛逆，尸波羅蜜當令具足。",
        "translation": "He causes them not to lack, gives whatever he wishes and doesn't hate anything, and he will cause the perfection of morality to be complete.",
        "source": "T08n0222_001:0149a15_4"
    },
    {
        "source_sentence": "從是因緣，未曾住於罪不罪；",
        "translation": "Because of these causes and conditions, they have never abided in blameworthiness or blamelessness.",
        "source": "T08n0222_001:0149a16_5"
    },
    {
        "source_sentence": "亦當具足羼波羅蜜，興無瞋恚；",
        "translation": "They should also be endowed with the transcendent compassion and give rise to no anger.",
        "source": "T08n0222_001:0149a17_6"
    },
    {
        "source_sentence": "當學惟逮波羅蜜，便得受決；",
        "translation": "You should study the transcendent ways and attain enlightenment, and you will be able to receive your predictions.",
        "source": "T08n0222_001:0149a17_7"
    },
    {
        "source_sentence": "從其身意興諸精進，不起諸漏，當具足禪波羅蜜。",
        "translation": "From their body and mind, they give rise to the effort that doesn't give rise to the contaminants, and they will be fully endowed with the perfection of meditation.",
        "source": "T08n0222_001:0149a18_8"
    },
    {
        "source_sentence": "由是之故，無所求慕。」",
        "translation": "Because of this, there's nothing to be desired.",
        "source": "T08n0222_001:0149a19_9"
    },
    {
        "source_sentence": "佛言：「舍利弗！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T08n0222_001:0149a20_10"
    },
    {
        "source_sentence": "若菩薩摩訶薩住般若波羅蜜，則自具足於四意止，發無所發；",
        "translation": "If great enlightening beings abide in the transcendent wisdom, they are self-contained in the four mental states of cessation and give rise to nothing.",
        "source": "T08n0222_001:0149a20_11"
    },
    {
        "source_sentence": "又當具足得四意斷、四神足、五根、五力、七覺、八由行；",
        "translation": "They will also attain the four kinds of mental annihilation, the four spiritual powers, the five faculties, the five powers, the seven forms of enlightenment, and the eight practices.",
        "source": "T08n0222_001:0149a21_12"
    },
    {
        "source_sentence": "悉令具足空無三昧、無想三昧、無願三昧；",
        "translation": "They all become fully endowed with the concentration of emptiness and absence of thought, the concentration of nonconception, and the concentration of wishlessness.",
        "source": "T08n0222_001:0149a23_0"
    },
    {
        "source_sentence": "而決具足四禪、四等、四無色三昧、及八脫門漸漸具足，而以正受，以此為脫，",
        "translation": "Instead, they are certain to be endowed gradually with the four meditations, the four higher knowledges, the four immaterial concentrations, and the eight gates of liberation. And yet through meditative attainment they regard this as liberation.",
        "source": "T08n0222_001:0149a23_1"
    },
    {
        "source_sentence": "無所思想，無有內想，若供養想、若光明想，無絳赤想，無腐敗想，無有青想，",
        "translation": "They have no ideation of anything, no ideation of inside, and no ideation of offerings or light. They have no ideation of redness, no ideation of decay, and no ideation of greenness.",
        "source": "T08n0222_001:0149a25_2"
    },
    {
        "source_sentence": "無食齧創爛想；",
        "translation": "They think of foodlessness as the creation of decay and rottenness.",
        "source": "T08n0222_001:0149a27_3"
    },
    {
        "source_sentence": "亦無亂想，無枯骨想，無星散想，無處所想。",
        "translation": "They also have no thoughts of disturbance, no thoughts of withered bones, no thoughts of starry dispersal, and no thoughts of location.",
        "source": "T08n0222_001:0149a27_4"
    },
    {
        "source_sentence": "悉離諸想，常志於佛，念於經典，念於眾僧，念於戒禁。",
        "translation": "They are completely free of all thoughts and always focus on the Buddha, remembering the sūtras, the saṃgha, and the precepts.",
        "source": "T08n0222_001:0149a28_5"
    },
    {
        "source_sentence": "意在惠施，志前諸天，出入之意、死亡之意，無常之想、苦樂之想，無非身之想、終始之想，",
        "translation": "Their intention is to give alms, thinking of the gods who came before them as enemies with thoughts of going out and coming in, death and immortality, impermanence and suffering and happiness, neither non-body thoughts nor beginning and end thoughts.",
        "source": "T08n0222_001:0149a29_6"
    },
    {
        "source_sentence": "一切世界無可樂想，諸習之想、滅盡之想，道慧、盡慧、無熱諸慧、無所起慧、法慧，",
        "translation": "In all worlds there is no ideation of enjoyment, no ideation of accumulation or cessation, no ideation of enlightenment, no ideation of extinction, no ideation of the path, no ideation of extinction, no ideation of extinction, no ideation of heatlessness, no ideation of nonorigination, and no ideation of princip",
        "source": "T08n0222_001:0149b02_7"
    },
    {
        "source_sentence": "於諸經法亦無所慧、亦無我慧，無有內慧、微妙意慧，曉了諸慧，如所謂慧，",
        "translation": "In all the teachings of the scriptures there is neither wisdom nor self-wisdom. There is neither internal wisdom nor subtle mental wisdom. He understands and comprehends all kinds of wisdom, just as they are called “knowledge”:",
        "source": "T08n0222_001:0149b04_8"
    },
    {
        "source_sentence": "悉以思念所行三昧，無想、無念、無行定者而無有異；",
        "translation": "They all abide in concentration carried out by reflection, without ideation, without thought, and without conditioned states of concentration. There is no difference between them.",
        "source": "T08n0222_001:0149b06_9"
    },
    {
        "source_sentence": "諸根為異，異根異行。",
        "translation": "The faculties are dissimilar: dissimilar faculties and dissimilar formations.",
        "source": "T08n0222_001:0149b07_10"
    },
    {
        "source_sentence": "又復有行，難所獲致如來十力、四無所畏、四分別辯、佛十八法不共之事、大慈大悲。",
        "translation": "Again, there are practices that make it difficult to attain the ten powers of the Tathāgata, the four fearlessnesses, the four discriminating explanations, the 18 unique qualities of the Buddha's teachings, and great kindness and compassion.",
        "source": "T08n0222_001:0149b07_11"
    },
    {
        "source_sentence": "欲得曉了此一切緣，菩薩摩訶薩當行般若波羅蜜；",
        "translation": "To attain understanding of all these conditions, great enlightening beings should practice transcendent wisdom.",
        "source": "T08n0222_001:0149b09_12"
    },
    {
        "source_sentence": "若有具足諸道慧者，菩薩摩訶薩當行般若波羅蜜；",
        "translation": "If there are those who are endowed with the knowledge of the paths, great enlightening beings will practice transcendent wisdom.",
        "source": "T08n0222_001:0149b10_13"
    },
    {
        "source_sentence": "欲曉了慧具足、充備諸通慧者，當行般若波羅蜜；",
        "translation": "Those who want to understand that wisdom is replete with knowledge and fully endowed with transcendent insight should practice the transcendent wisdom of prajñā.",
        "source": "T08n0222_001:0149b12_14"
    },
    {
        "source_sentence": "菩薩摩訶薩若欲明了一切，得近蠲除塵勞，菩薩摩訶薩當行般若波羅蜜。",
        "translation": "If the bodhisattva Mahāsattva wants to clarify everything and get close to getting rid of the dust, the bodhisattva Mahāsattva will practice the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0149b13_15"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0222_001:0149b15_0"
    },
    {
        "source_sentence": "菩薩摩訶薩則為修學般若波羅蜜。」",
        "translation": "The bodhisattva Mahāsattva then cultivates the perfection of wisdom.",
        "source": "T08n0222_001:0149b15_1"
    },
    {
        "source_sentence": "佛復告舍利弗：「若有菩薩摩訶薩欲入寂然，當學般若波羅蜜；",
        "translation": "Again, the Buddha said to Śāriputra: If there are bodhisattva mahāsattvas who wish to enter nirvana, they should train in the transcendent wisdom.",
        "source": "T08n0222_001:0149b16_2"
    },
    {
        "source_sentence": "菩薩摩訶薩欲度聲聞、辟支佛地，住阿惟越地者，當學般若波羅蜜；",
        "translation": "“Great enlightening beings who want to liberate themselves from the stages of śrāvakas and pratyekabuddhas and abide in the stage of nonretrogression should train in the transcendent wisdom.",
        "source": "T08n0222_001:0149b17_3"
    },
    {
        "source_sentence": "菩薩摩訶薩欲處六通，學般若波羅蜜；",
        "translation": "“Great enlightening beings abide in the six superknowledgements of the realm of desire and study transcendent wisdom.",
        "source": "T08n0222_001:0149b19_4"
    },
    {
        "source_sentence": "菩薩摩訶薩欲知一切眾生薩惒薩心根所行者，當學般若波羅蜜；",
        "translation": "“Great enlightening beings want to know what all sentient beings do with the mental faculty of consciousness, they should study transcendent wisdom.",
        "source": "T08n0222_001:0149b20_5"
    },
    {
        "source_sentence": "菩薩摩訶薩欲過諸聲聞、辟支佛慧者，當學般若波羅蜜；",
        "translation": "“Great enlightening beings want to surpass the wisdom of śrāvakas and pratyekabuddhas, they should study transcendent wisdom.",
        "source": "T08n0222_001:0149b21_6"
    },
    {
        "source_sentence": "菩薩摩訶薩欲逮總持門，若男子勸助布施聲聞、辟支佛，超越彼等，當學般若波羅蜜；",
        "translation": "“Great enlightening beings want to acquire the gate of mastery, and if men encourage and assist giving to hearers and pratyekabuddhas, transcending them, they should study the transcendent wisdom.",
        "source": "T08n0222_001:0149b22_7"
    },
    {
        "source_sentence": "菩薩摩訶薩欲過一切聲聞、辟支佛戒禁，勸助心意，當學般若波羅蜜；",
        "translation": "“Great enlightening beings who want to transcend the precepts of all śrāvakas and pratyekabuddhas, exhorting and assisting their minds, should learn the transcendent wisdom.",
        "source": "T08n0222_001:0149b24_8"
    },
    {
        "source_sentence": "若欲具足三昧、智慧、解脫、度知見慧，菩薩摩訶薩當學般若波羅蜜；",
        "translation": "“If great enlightening beings want to perfect concentration, knowledge, liberation, and the wisdom of transcendent insight, they should learn the transcendent wisdom of prajñā.",
        "source": "T08n0222_001:0149b26_9"
    },
    {
        "source_sentence": "菩薩摩訶薩欲成顯於禪定、三昧、三摩越，勸助合集，解心之念所，當學般若波羅蜜；",
        "translation": "“Great enlightening beings who want to perfect and reveal meditation, concentration, and concentration-samādhi should train in the transcendent wisdom of liberation if they want to accomplish it.",
        "source": "T08n0222_001:0149b28_10"
    },
    {
        "source_sentence": "菩薩摩訶薩若欲勸助布施，分別無限無量成就功德，當學般若波羅蜜；",
        "translation": "“If great enlightening beings want to encourage generosity and discern the infinite and immeasurable merit of accomplishment, they should study transcendent wisdom.",
        "source": "T08n0222_001:0149b29_11"
    },
    {
        "source_sentence": "菩薩摩訶薩若欲具足成就無限無量持戒、忍辱、精進、一心、智慧，當學般若波羅蜜。」",
        "translation": "If bodhisattvas, mahāsattvas, want to fully accomplish the infinite and immeasurable observance of precepts, forbearance, effort, concentration, and wisdom, they should train in the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0149c02_12"
    },
    {
        "source_sentence": "佛復語舍利弗：「若有菩薩摩訶薩欲具足立檀波羅蜜、尸波羅蜜、羼波羅蜜、惟逮波羅蜜、禪波羅蜜、般若波羅蜜行，",
        "translation": "Again, the Buddha said to Śāriputra, Suppose a bodhisattva-mahāsattva wants to fully establish the practice of the perfection of the perfection of giving, the perfection of morality, the perfection of abstention, the perfection of purity, the perfection of meditation, and the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0149c04_13"
    },
    {
        "source_sentence": "一切所生得見諸佛自致成佛，當學般若波羅蜜；",
        "translation": "All those who attain buddhahood by seeing all the buddhas and become buddhas themselves should study transcendent wisdom.",
        "source": "T08n0222_001:0149c06_14"
    },
    {
        "source_sentence": "欲成三十二相、八十種好，具足菩薩性，若為真童，欲立此地不離諸佛世尊，",
        "translation": "If they want to perfect the thirty-two marks and eighty-eight kinds of embellishments that are endowed with the bodhisattva-nature, if they become true children and want to establish this place without leaving the buddhas and world-honored ones,",
        "source": "T08n0222_001:0149c08_15"
    },
    {
        "source_sentence": "所欲志念諸善德本，供養如來奉持順命，其願輙成；",
        "translation": "Desiring to remember the roots of goodness and make offerings to the enlightened, upholding them in accordance with life, their vows are fulfilled.",
        "source": "T08n0222_001:0149c09_16"
    },
    {
        "source_sentence": "若欲具足一切眾生心之所僥，飲食衣服車乘、香華雜香塗香、床臥燈火手巾履襪，",
        "translation": "If you want to fulfill the wishes of all sentient beings, food, drink, clothing, carriages, incense, flowers, perfumes, ointments, beds, lamps, lights, hand cloths, footwear, and so forth.",
        "source": "T08n0222_001:0149c10_17"
    },
    {
        "source_sentence": "所當得者充滿諸財，當學般若波羅蜜。",
        "translation": "Those who will attain it will fill their possessions, and they'll train in the perfection of wisdom.",
        "source": "T08n0222_001:0149c12_18"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0149c13_19"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲具足江河沙等眾生，勸立於檀波羅蜜、尸波羅蜜、羼波羅蜜、惟逮波羅蜜、禪波羅蜜，",
        "translation": "If the bodhisattva Mahāsattva wants to fulfill the perfections of rivers, sands, and other sentient beings, he encourages them to establish the perfection of giving, the perfection of śīla-pāramitā, the perfection of anger, the perfection of vibhāramit, and the perfection of meditation.",
        "source": "T08n0222_001:0149c14_0"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0149c16_1"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0149c16_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩以一善本順如來德，無有盡耗亦不缺減，乃至成阿耨多羅三耶三菩者，",
        "translation": "If a bodhisattva Mahāsattva follows the Tathāgata's virtues with one good root, there's no exhaustion or diminution, even up to the point where he becomes an unsurpassed, correct, and complete bodhisattva.",
        "source": "T08n0222_001:0149c17_0"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0149c19_1"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0149c19_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩學般若波羅蜜，八維上下諸佛天中天，皆共歌誦其人功德。",
        "translation": "If a bodhisattva-mahāsattva trains in the perfection of prajñāpāramitā, the gods above and below the buddhas in the eighth dimension and the gods in the middle heaven will all sing and recite the merits of that person together.",
        "source": "T08n0222_001:0149c19_3"
    },
    {
        "source_sentence": "發意之頃，東方江河沙等諸佛國土，欲遊此界及至十方，當學般若波羅蜜。",
        "translation": "When he arouses his intention, he wants to travel to these buddha-lands and the ten directions in the east, such as rivers, rivers, sands, and other buddha lands, and he'll train in the perfection of prajñā.",
        "source": "T08n0222_001:0149c21_4"
    },
    {
        "source_sentence": "以一切音聲，欲告江河沙諸佛國土，東西南北四維上下，當學般若波羅蜜。",
        "translation": "With all their sounds, they want to tell the buddha-lands of the rivers and sands of the buddhas' lands, which are east, west, south, north, four directions, and up and down, that they should train in the perfection of prajñā.",
        "source": "T08n0222_001:0149c23_5"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0149c25_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩欲建立諸佛國土令不斷絕，欲住內空，若處外空、若內外空，",
        "translation": "“If great enlightening beings want to establish the buddha-lands so that they will not be cut off, and want to abide in internal emptiness, or in external emptiness where there is no space, or in internal emptiness where there is no space,",
        "source": "T08n0222_001:0149c25_1"
    },
    {
        "source_sentence": "若於空空，若於大空、究竟之空、所有空、無有空、有為空、無為空，",
        "translation": "If it’s emptiness in emptiness, if it’s great emptiness, ultimate emptiness, emptiness of existence, emptiness without existence, emptiness of becoming, and emptiness of non-being,",
        "source": "T08n0222_001:0149c27_0"
    },
    {
        "source_sentence": "若真空者、無祠祀空、無因緣空、因緣空、自然相空、一切法空、不可得空、無所有空，",
        "translation": "If there's emptiness without sacrifice, emptiness without causes and conditions, emptiness without causes and conditions, emptiness with natural characteristics, emptiness of all dharmas, emptiness that can't be obtained, emptiness that has nothing,",
        "source": "T08n0222_001:0149c28_1"
    },
    {
        "source_sentence": "若自然空、無形自然空、因緣威神空諸行相，欲至此者，當學般若波羅蜜。",
        "translation": "If someone wants to reach this point, they should train in the perfection of prajñāpāramitā if they are naturally empty, formless and naturally empty, and the karmic characteristics of causation and authoritative emptiness.",
        "source": "T08n0222_001:0150a01_2"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a03_3"
    },
    {
        "source_sentence": "菩薩摩訶薩欲得親近一切如來，欲得觀解一切諸法，欲了諸法在於本際，",
        "translation": "“Great enlightening beings want to associate with all buddhas, want to comprehend all teachings, and want to understand that all teachings are at the origin.",
        "source": "T08n0222_001:0150a03_4"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150a05_5"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0222_001:0150a05_6"
    },
    {
        "source_sentence": "菩薩摩訶薩欲成般若波羅蜜，當如是住。",
        "translation": "A bodhisattva-mahāsattva who wants to achieve the perfection of prajñāpāramitā should thus abide.",
        "source": "T08n0222_001:0150a06_7"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a07_8"
    },
    {
        "source_sentence": "菩薩摩訶薩欲計數知三千大千世界沙石樹花、一切諸塵、眾疑不決，當學般若波羅蜜。",
        "translation": "If bodhisattvas, mahāsattvas, want to calculate the number of 3,000 great one-thousand worlds with sand, rocks, trees, flowers, all dust, and doubts that are unresolved, they should train in the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0150a07_9"
    },
    {
        "source_sentence": "三千大千世界有如大海江河、川流泉原，欲知有幾渧多少之數，無所傷害度海蟲類，",
        "translation": "The 3,000 great one-thousand worlds are like oceans, rivers, streams, rivers, streams, springs, and plains—if you want to know how numerous they are, how many of them there are? There will be no harmful sea creatures.",
        "source": "T08n0222_001:0150a09_10"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150a11_11"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a11_12"
    },
    {
        "source_sentence": "假使三千大千世界所有火者一時普然，猶如劫燒，一面一時悉欲滅者，",
        "translation": "“Even if all the fires in a billion worlds were to be extinguished simultaneously, it would be like an eon being burned at one and the same time.",
        "source": "T08n0222_001:0150a12_13"
    },
    {
        "source_sentence": "令無所然，當學般若波羅蜜。",
        "translation": "So that nothing will happen, they'll train in the perfection of wisdom.",
        "source": "T08n0222_001:0150a13_14"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a14_15"
    },
    {
        "source_sentence": "菩薩摩訶薩，三千大千世界所有諸風，有時國土吹拔，崩碎諸須彌山令無有餘，",
        "translation": "“Great enlightening beings, the winds of all the great one-thousand worlds in the universe sometimes blow and uproot their lands, shattering the polar mountains without exception.",
        "source": "T08n0222_001:0150a14_16"
    },
    {
        "source_sentence": "譬如灰塵淨滅，有如然藎如然蒿草，若以一指——手指、足指——欲令滅盡三界火者，",
        "translation": "It's like when the dust of ashes is purified and extinguished, there's such-and-such-and-such-and-such-and-such-and-such-and-such-and-such-and-such-and-such-and-such-and-such-and-such-and-",
        "source": "T08n0222_001:0150a16_17"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150a18_18"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a18_19"
    },
    {
        "source_sentence": "菩薩摩訶薩，三千大千世界所有虛空，欲以普身一加趺坐周遍虛空者，",
        "translation": "“Great enlightening beings, all the space in the great manifold cosmos of the 3,000 great one-thousand worlds want to sit pervading space with a universal body.",
        "source": "T08n0222_001:0150a19_20"
    },
    {
        "source_sentence": "當學般若波羅蜜；",
        "translation": "You should study the transcendent wisdom.",
        "source": "T08n0222_001:0150a20_21"
    },
    {
        "source_sentence": "自在變化，無近無遠、無大無小，當學般若波羅蜜。",
        "translation": "With unimpeded transformation, which is neither near nor distant, neither large nor small, you should train in the perfection of prajñā.",
        "source": "T08n0222_001:0150a21_22"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a22_23"
    },
    {
        "source_sentence": "菩薩摩訶薩欲取三千大千世界諸須彌山，以一手舉諸須彌山，置於殊異無量諸佛世界，",
        "translation": "“When great enlightening beings want to take the mountains of the polar mountains of the billion-world-galactic universe, they can pick up the mountains with one hand and place them in infinitely different buddha-fields.",
        "source": "T08n0222_001:0150a22_24"
    },
    {
        "source_sentence": "無往反想，不增不減，當學般若波羅蜜。",
        "translation": "Without thoughts of going back and forth, neither increasing nor decreasing, you should train in the perfection of prajñā.",
        "source": "T08n0222_001:0150a24_25"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a25_26"
    },
    {
        "source_sentence": "菩薩摩訶薩，東方江河沙等諸佛世界，佛天中天、聲聞、辟支佛，皆欲一時同時合集以供養者，",
        "translation": "“Great enlightening beings, the buddha worlds as numerous as the grains of sand in rivers and streams in the east as there are buddha-lands, wishing to simultaneously gather heavenly gods, śrāvakas, and pratyekabuddhas in the buddha-lands together at one and the same time to honor them.",
        "source": "T08n0222_001:0150a26_0"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150a28_1"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150a28_2"
    },
    {
        "source_sentence": "菩薩摩訶薩，若一衣服、香花搗香塗香、繒蓋幢幡以持供養多阿竭、阿羅呵、三耶三佛及聲聞眾，",
        "translation": "“Great enlightening beings, if they offer a single piece of clothing, fragrant flowers, powdered incense, scented ointments, canopies, banners, pennants, and banners to the multitude of buddhas as well as śrāvakas.",
        "source": "T08n0222_001:0150a28_3"
    },
    {
        "source_sentence": "奉事歸命一時應集，當學般若波羅蜜。",
        "translation": "They should assemble at one time to serve and return to their lives, and they should train in the perfection of prajñā.",
        "source": "T08n0222_001:0150b02_4"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150b02_5"
    },
    {
        "source_sentence": "菩薩摩訶薩，三千大千世界所有眾生，皆欲建立於尸波羅蜜、三昧、智慧、解脫見慧，",
        "translation": "“Great enlightening beings, all the sentient beings in the great manifold cosmos of the 3,000 great one-thousand worlds want to establish morality, concentration, wisdom, liberation, and insight.",
        "source": "T08n0222_001:0150b03_6"
    },
    {
        "source_sentence": "須陀洹果、斯陀含果、阿那含果，至於無餘住泥洹果而般泥洹，當學般若波羅蜜。",
        "translation": "In the fruit of stream entry, the fruit of once-returning, and the fruit of non-returning, up to the fruit of abiding in nirvāṇa without remainder and parinirvāṇa, you should train in the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0150b05_7"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150b06_8"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，若布施者波羅蜜，當作是學，如此施者獲大果報，",
        "translation": "If a bodhisattva-mahāsattva practices the perfection of prajñā, and if he gives the perfection of generosity, he'll train in this way, and such a donor will attain great rewards.",
        "source": "T08n0222_001:0150b07_9"
    },
    {
        "source_sentence": "如是施者生於君子傲姓家、梵志、大族姓長者；",
        "translation": "Such a donor is born in the family of gentlemen, brahmins, brahmins, and great clanspeople.",
        "source": "T08n0222_001:0150b09_0"
    },
    {
        "source_sentence": "如此施者生於四天王上忉利天、兜術天、尼摩天、波羅尼蜜天；",
        "translation": "Such a donor is born in the uppermost of the four heavenly kings: the Trāyastriṃśa gods, the Tuṣita gods, the Nirmāṇarati gods, and the Paranirmita-vaśavartin gods.",
        "source": "T08n0222_001:0150b10_1"
    },
    {
        "source_sentence": "如是施者依於斯施，思第一禪第二第三至第四禪，無量虛空定意正受，",
        "translation": "Such a donor relies on this giving to contemplate the second, third, and fourth meditations in the first dhyāna, which are immeasurable space concentrations of mind and right sensation.",
        "source": "T08n0222_001:0150b11_2"
    },
    {
        "source_sentence": "無量空慧、無量不用慧天、無想有想三昧禪；",
        "translation": "Innumerable wisdoms of emptiness, innumerable gods of nonutility and wisdom, and inconceivable meditative absorptions.",
        "source": "T08n0222_001:0150b13_3"
    },
    {
        "source_sentence": "如此施者興八聖路，得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛果。",
        "translation": "Such a donor produces the eight noble paths to attain the fruit of stream entry, the fruit of once-returning, the fruit of non-returning, the fruit of arhatship, and the fruit of pratyekabuddhahood.",
        "source": "T08n0222_001:0150b14_4"
    },
    {
        "source_sentence": "若曉了此，當於是學般若波羅蜜。",
        "translation": "If someone understands this, they'll then train in the perfection of wisdom.",
        "source": "T08n0222_001:0150b16_0"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150b16_1"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，常以權慧有所施與，為具檀波羅蜜、尸波羅蜜、羼波羅蜜、惟逮波羅蜜、禪波羅蜜、般若波羅蜜。」",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of prajñāpāramitā, they always give something with their righteous wisdom to someone who possesses the perfection of generosity, the perfection of śīla-pāramitā, the perfection of anger, the perfection of惟逮波羅蜜, the perfection of meditation, and the perfection of prajñ",
        "source": "T08n0222_001:0150b17_2"
    },
    {
        "source_sentence": "舍利弗白佛言：「云何菩薩摩訶薩具足六波羅蜜？」",
        "translation": "Śāriputra said to the Buddha, How does a bodhisattva-mahāsattva possess the six perfections?",
        "source": "T08n0222_001:0150b19_3"
    },
    {
        "source_sentence": "答曰：「其布施主無所著念，所施受者亦不忘恩，是為檀波羅蜜。",
        "translation": "He answered, The donor doesn't cling to anything, and the recipient of the donation doesn't forget kindness; this is the perfection of giving.",
        "source": "T08n0222_001:0150b21_0"
    },
    {
        "source_sentence": "無所犯負，不以禁戒而自綺餝，是為尸波羅蜜。",
        "translation": "Not violating anything and not indulging in self-conceit because of the precepts is the perfection of morality.",
        "source": "T08n0222_001:0150b22_1"
    },
    {
        "source_sentence": "常懷忍辱，無瞋恚恨心向於眾生，是為羼波羅蜜。",
        "translation": "To always harbor forbearance and be without anger or resentment toward sentient beings is the perfection of tolerance.",
        "source": "T08n0222_001:0150b23_2"
    },
    {
        "source_sentence": "精進不怠欲度一切，是為惟逮波羅蜜。",
        "translation": "Being diligent and not lazy in wanting to save all people is the perfection of nonretrogression.",
        "source": "T08n0222_001:0150b24_3"
    },
    {
        "source_sentence": "一心寂然而無憒亂，是為禪波羅蜜。",
        "translation": "This is the perfection of meditation when one mind is quiescent and without disturbance.",
        "source": "T08n0222_001:0150b25_4"
    },
    {
        "source_sentence": "智慧解空不計吾我，是為般若波羅蜜。",
        "translation": "Wise in understanding emptiness and not discriminating self is the perfection of prajñā.",
        "source": "T08n0222_001:0150b26_5"
    },
    {
        "source_sentence": "取要言之，復重解議，於罪無罪亦無無罪，是尸波羅蜜。",
        "translation": "To summarize, this is the śīla-pāramitā, which further explains again that there's no blame for sin and no blame for sin.",
        "source": "T08n0222_001:0150b27_6"
    },
    {
        "source_sentence": "無有瞋恨，是羼波羅蜜。",
        "translation": "The absence of anger is the perfection of hatred.",
        "source": "T08n0222_001:0150b28_7"
    },
    {
        "source_sentence": "身心精進不以疲倦，是惟逮波羅蜜。",
        "translation": "Their physical and mental exertion aren't exhausted, but they attain the perfection of enlightenment.",
        "source": "T08n0222_001:0150b29_8"
    },
    {
        "source_sentence": "興於不亂無所想念，是禪波羅蜜。",
        "translation": "To give rise to unconfused, uncontaminated thoughts is the perfection of meditation.",
        "source": "T08n0222_001:0150c01_9"
    },
    {
        "source_sentence": "解一切法而無所著，是般若波羅蜜。",
        "translation": "Understanding all dharmas without attachment is the perfection of wisdom.",
        "source": "T08n0222_001:0150c01_10"
    },
    {
        "source_sentence": "「復次，舍利弗菩！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150c02_11"
    },
    {
        "source_sentence": "薩摩訶薩欲得成就過去當來今現在諸佛世尊功德之誼，當學般若波羅蜜。",
        "translation": "If a samādhisattva wants to achieve the merits of past, future, and present buddhas and world-honored ones, he should train in the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0150c03_12"
    },
    {
        "source_sentence": "欲得超度有為、無為諸法行者，去來今法至於無本，諸法所興不起本際，",
        "translation": "Those who want to transcend the practices of conditioned and unconditioned dharmas should understand that past, present, and future dharmas have no basis, and that the origination of all dharmas does not occur at the original time.",
        "source": "T08n0222_001:0150c04_13"
    },
    {
        "source_sentence": "欲逮此者，一切聲聞、辟支佛、諸菩薩法，欲行諸佛世尊而供養者，欲得具足諸佛眷屬無量群從，",
        "translation": "Those who want to attain this are all the śrāvakas, pratyekabuddhas, and bodhisattvas who want to practice the teachings of the buddhas and world-honored ones and make offerings to them. They want to be fully endowed with the retinues of the Buddhas’ immeasurable groups of followers.",
        "source": "T08n0222_001:0150c06_14"
    },
    {
        "source_sentence": "欲得獲致菩薩枝黨，欲得淨畢眾祐之德，欲致布施心無所受，不起犯戒想，",
        "translation": "They want to attain the bodhisattva's branch party, want to attain the virtue of purifying all blessings, want to attain generosity without accepting anything, and don't give up the idea of violating the precepts.",
        "source": "T08n0222_001:0150c08_15"
    },
    {
        "source_sentence": "無瞋恚心、無懈怠心，不欲發起於亂心者，又不欲起愚癡心者，當學般若波羅蜜。",
        "translation": "Those who aren't angry or lazy, don't want to give rise to a disturbed mind, and don't want to give rise to a foolish mind should train in the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0150c10_16"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150c12_17"
    },
    {
        "source_sentence": "菩薩摩訶薩欲立眾生於布施德，持戒、智慧勸令修治，所受福德當所興者，",
        "translation": "“When great enlightening beings want to establish the virtue of generosity in sentient beings, they observe precepts and wisdom and encourage them to cultivate it.",
        "source": "T08n0222_001:0150c12_18"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150c14_19"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150c14_20"
    },
    {
        "source_sentence": "菩薩摩訶薩欲興五眼，當學般若波羅蜜。",
        "translation": "If bodhisattvas, mahāsattvas, want to give rise to the five eyes, they should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150c15_21"
    },
    {
        "source_sentence": "何謂五眼？",
        "translation": "What are the five eyes?",
        "source": "T08n0222_001:0150c16_22"
    },
    {
        "source_sentence": "肉眼、天眼、慧眼、法眼、佛眼。",
        "translation": "The physical eye, divine eye, wisdom eye, dharma eye, and buddha eye.",
        "source": "T08n0222_001:0150c16_23"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150c16_24"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150c17_25"
    },
    {
        "source_sentence": "菩薩摩訶薩欲見東方江河沙國土八維上下諸佛世尊，所說經法皆以天耳欲得聞者，",
        "translation": "“When great enlightening beings want to see the buddhas of the world-honored ones in the eight directions, up and down as numerous as the grains of sand in the Ganges River in the east, they wish to hear with their divine ears all the teachings of the scriptures taught by these buddhas.",
        "source": "T08n0222_001:0150c17_26"
    },
    {
        "source_sentence": "又欲得知諸佛世尊心之所念，當學般若波羅蜜。",
        "translation": "Also, if you want to know what the buddhas and world-honored ones think in their minds, you should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150c19_27"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150c20_28"
    },
    {
        "source_sentence": "菩薩摩訶薩，諸佛世尊普在十方說經法者，欲得聽聞而不斷絕至阿耨多羅三耶三菩者，",
        "translation": "“Great enlightening beings, the buddhas and world-honored ones who teach the teachings of scriptures everywhere in the ten directions want to hear them without ceasing until they reach unexcelled complete perfect enlightenment.",
        "source": "T08n0222_001:0150c21_29"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0150c23_30"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150c23_31"
    },
    {
        "source_sentence": "菩薩摩訶薩若欲得見過去多阿竭、阿羅訶、三耶三佛，欲得見於諸佛國土者，",
        "translation": "“Furthermore, if great enlightening beings want to see the past buddhas Tathāgata, Arhat, and Samyak-saṃbuddha, and want to see their buddha-lands,",
        "source": "T08n0222_001:0150c23_32"
    },
    {
        "source_sentence": "當來現在十方世界今現在佛欲得追見國土所有，當學般若波羅蜜。",
        "translation": "In the future, if the present buddhas of the worlds in the ten directions want to pursue what's possessed in their land, they should train in the perfection of prajñā.",
        "source": "T08n0222_001:0150c25_33"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0150c27_34"
    },
    {
        "source_sentence": "菩薩摩訶薩欲得解知如來所說十二部經——聞經、分別經、頌經、詩歌經、初經、此應經、生經、受經、方等經、未曾有法經、譬喻經、注解章句經——諸聲聞所不聞者，",
        "translation": "“Great enlightening beings want to be able to understand the twelve kinds of scriptures taught by the Enlightened: the scriptures of hearing, the scriptures of discernment, the scriptures of verse, the scriptures of poetry and song, the first scriptures, the scriptures of response, the scriptures of birth, the scriptures of receiving, the scriptures of equality",
        "source": "T08n0222_001:0150c27_35"
    },
    {
        "source_sentence": "皆欲得玩習誦者，當學般若波羅蜜。",
        "translation": "Those who want to attain playful recitation should train in the perfection of prajñā.",
        "source": "T08n0222_001:0151a02_36"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a03_37"
    },
    {
        "source_sentence": "菩薩摩訶薩欲得聽聞八維上下如來所說經法皆念不失，欲得執持已得執持而為眾會他人說者，",
        "translation": "“Great enlightening beings want to be able to hear the teachings of the buddhas of the eight-vehicle assembly, up and down, without forgetting or losing mindfulness of what they teach. If they want to preserve them, they preserve them and teach them to others in congregations.",
        "source": "T08n0222_001:0151a03_38"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0151a05_39"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a06_40"
    },
    {
        "source_sentence": "菩薩摩訶薩欲得啟問過去當來如所說誼者，已得聞者為他人說，當學般若波羅蜜。",
        "translation": "If a bodhisattva-mahāsattva wants to ask questions about past and future meanings as they've been taught, and someone who has heard them taught them for others should train in the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0151a06_41"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a08_42"
    },
    {
        "source_sentence": "菩薩摩訶薩欲得照明東方江河沙等諸佛世界，窈窈冥冥不見日月光明之耀，",
        "translation": "“When great enlightening beings wish to illumine buddha-lands as numerous as the grains of sand in rivers in the eastern direction, they do not see the sun and moon shining brightly.",
        "source": "T08n0222_001:0151a08_43"
    },
    {
        "source_sentence": "欲得照斯及十方界，當學般若波羅蜜。",
        "translation": "If you want to illuminate these and the ten directional realms, you must train in the perfection of prajñā.",
        "source": "T08n0222_001:0151a10_44"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a11_45"
    },
    {
        "source_sentence": "菩薩摩訶薩欲得開化東方江河沙等諸佛國土，及十方界愚癡闇冥——不聞佛名、不得聽經、不覩眾僧——欲得開化眾生類立於正見，",
        "translation": "“Enlightening beings want to enlighten the buddha-lands as numerous as the grains of sand in rivers in the eastern direction, and also the worlds in the ten directions—they don’t hear the names of buddhas, do not listen to scriptures, and do not pay respect to the Sangha. They want to enlighten sentient beings and establish right views",
        "source": "T08n0222_001:0151a11_46"
    },
    {
        "source_sentence": "令得覩佛、逮聞經法及與聖眾，當學般若波羅蜜。",
        "translation": "They will attain the perfection of wisdom so that they'll see the Buddha, acquire the teachings of the sūtras and the noble congregation, and study the perfection of wisdom.",
        "source": "T08n0222_001:0151a14_47"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a16_0"
    },
    {
        "source_sentence": "菩薩摩訶薩欲令東方江河沙等諸佛世界及十方佛土所有眾生，其生盲者得目覩形，",
        "translation": "“Great enlightening beings want to cause all the sentient beings in the buddha-fields of the ten directions, as many buddha-lands as there are rivers and sands in the east, and all the buddha-lands in the ten directions, who are born blind, to attain the form of a dumb eye.",
        "source": "T08n0222_001:0151a16_1"
    },
    {
        "source_sentence": "聾者逮聽，狂者復意，裸者獲衣，飢者致食，渴得水漿，吾願得力皆蒙斯恩，",
        "translation": "Those who are deaf can hear and those who are crazy can regain their minds. Those who are naked obtain their robes, those who are hungry get food, and those who thirst get water and juice. I pray that all those who attain enlightenment will be blessed by this.",
        "source": "T08n0222_001:0151a18_2"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0151a20_3"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a20_4"
    },
    {
        "source_sentence": "菩薩摩訶薩其有於斯三千大千世界在惡趣者，地獄餓、鬼、畜生群萌之類，",
        "translation": "“Great enlightening beings, if there are in these 3,000 great one-thousand worlds in the evil destinies of hell, hunger, ghosthood, animals, and other living beings,",
        "source": "T08n0222_001:0151a20_5"
    },
    {
        "source_sentence": "吾欲加恩使此黎庶逮得其所，八維上下各江河沙亦復如是，當學般若波羅蜜。",
        "translation": "I want to bestow kindness on this common people so that they'll obtain their places, and so will the sands of the rivers in each of the eight directions up and down likewise, so they'll study the perfection of prajñā.",
        "source": "T08n0222_001:0151a22_6"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a24_7"
    },
    {
        "source_sentence": "菩薩摩訶薩，江河沙等諸佛世界所有眾生，欲得建立于禁戒者，三昧、智慧、解脫、度知見慧，",
        "translation": "“Great enlightening beings, all the sentient beings in buddha-lands as numerous as the grains of sand in rivers and streams who want to establish the precepts—samādhi, wisdom, liberation, and the insight that transcends knowledge and vision—",
        "source": "T08n0222_001:0151a24_8"
    },
    {
        "source_sentence": "須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛證，至成阿耨多羅三耶三菩；",
        "translation": "The fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, the fruit of arhatship and the realization of pratyekabuddhahood all lead to the attainment of anuttarii samyaksarrzbodhi.",
        "source": "T08n0222_001:0151a26_9"
    },
    {
        "source_sentence": "又欲修多訶竭威儀禮節，菩薩摩訶薩當學般若波羅蜜。",
        "translation": "Also, if you want to cultivate the Tathāgata's manner and manner, the bodhisattva Mahāsattva should train in the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0151a28_10"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151a29_11"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，當作是觀：『假令我身所不得覩而欲察之，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they should contemplate thus:",
        "source": "T08n0222_001:0151b01_12"
    },
    {
        "source_sentence": "當學般若波羅蜜。』",
        "translation": "You should train in the perfection of wisdom.'",
        "source": "T08n0222_001:0151b02_13"
    },
    {
        "source_sentence": "設使我身四寸之地，而以足指靡不周遍，從四天王天，欲界、色界阿迦膩吒天，",
        "translation": "“Suppose my body were to reach as far as four inches on the ground and pervade all of it with my toes, from the heaven of the four guardian gods of the realm of desire up to the Akaniṣṭha Heaven.",
        "source": "T08n0222_001:0151b03_14"
    },
    {
        "source_sentence": "無央數億百千姟眷屬周匝，往詣佛樹處于道場，當學般若波羅蜜。",
        "translation": "They'll be surrounded by measureless millions of hundreds of millions of myriadstical retinues and go to the Buddha's tree at the site of enlightenment, where they'll study the perfection of prajñā.",
        "source": "T08n0222_001:0151b04_15"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151b06_16"
    },
    {
        "source_sentence": "菩薩摩訶薩或坐佛樹，四天王天上諸天人上乃至于淨居諸天等無差特，",
        "translation": "“Even if great enlightening beings were to sit on buddha-trees, there would be no difference between the four heavenly kings, gods, goddesses, humans, celestial beings, and even the gods of the Pure Land.",
        "source": "T08n0222_001:0151b06_17"
    },
    {
        "source_sentence": "皆來具足布施，或當成就阿耨多羅三耶三菩阿惟三佛，往來住立坐臥，",
        "translation": "They all come to be fully endowed with generosity, or they may attain the unexcelled, perfect enlightenment.",
        "source": "T08n0222_001:0151b08_18"
    },
    {
        "source_sentence": "則於其地自為金剛。",
        "translation": "Then he'll become a vajra on his own at that place.",
        "source": "T08n0222_001:0151b10_19"
    },
    {
        "source_sentence": "欲得獲斯，當學般若波羅蜜。",
        "translation": "If you want to attain this, you must train in the perfection of wisdom.",
        "source": "T08n0222_001:0151b10_20"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151b11_21"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，當作斯觀：『吾當何日出去棄國捨家，即日當成阿耨多羅三耶三菩，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they should think thus: On what day will I leave my country and renounce the householder’s life? And on that very day will I attain highest, complete enlightenment.",
        "source": "T08n0222_001:0151b11_22"
    },
    {
        "source_sentence": "得至阿惟三佛；",
        "translation": "They attain the state of unexcelled buddhahood.",
        "source": "T08n0222_001:0151b13_23"
    },
    {
        "source_sentence": "以至阿惟三佛即日轉法輪，以轉法輪令無央數不可稱計眾生之類，遠塵離垢，",
        "translation": "To the extent that the abhisaṃbuddhas instantly turn the wheel of the Dharma on the same day, and by turning the wheel of the Dharma they cause untold numbers of living beings to be far removed from their dust and dirt.",
        "source": "T08n0222_001:0151b14_24"
    },
    {
        "source_sentence": "諸法法眼淨，無量無限群萌之黨，得無起餘漏盡意解，無量無限眾生含血得阿惟越致、阿耨多羅三耶三菩。』",
        "translation": "The Dharma eye of the Dharma of all dharmas is purified, measureless and limitless are the groups of sentient beings who attain liberation from the remaining contaminants without arising, and measureless and limitless sentient beings containing blood attain supreme awakening and unsurpassed, anuttara-saṃya-saṃbodhi.'",
        "source": "T08n0222_001:0151b16_25"
    },
    {
        "source_sentence": "是菩薩摩訶薩當學般若波羅蜜。",
        "translation": "This is the bodhisattva Mahāsattva who will train in the perfection of wisdom.",
        "source": "T08n0222_001:0151b18_26"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151b19_27"
    },
    {
        "source_sentence": "菩薩摩訶薩心念欲得：『我成阿耨多羅三耶三菩，得至阿惟三佛，有無央數比丘聖眾聲聞學者，",
        "translation": "“The great enlightening beings thought to themselves, ‘I have attained unexcelled complete perfect enlightenment, having reached the state of abhisaṃbuddha.",
        "source": "T08n0222_001:0151b19_28"
    },
    {
        "source_sentence": "或以一反演說經法，於一坐上得阿羅漢；",
        "translation": "Or, if they expound the teaching of a scripture in one repetition, they may attain arhatship while sitting on one seat.",
        "source": "T08n0222_001:0151b21_29"
    },
    {
        "source_sentence": "諸菩薩摩訶薩皆逮阿惟越致、阿耨多羅三耶三菩；",
        "translation": "“Great enlightening beings all attain unexcelled, perfect enlightenment.",
        "source": "T08n0222_001:0151b22_30"
    },
    {
        "source_sentence": "有無央數、不可稱限、不可計量諸菩薩眾，其壽無量，光明照遠無有邊際。』",
        "translation": "There are measureless, incalculable, and immeasurable numbers of bodhisattvas whose lifespans are immeasurable, and their light shines far and wide without limit.'",
        "source": "T08n0222_001:0151b23_31"
    },
    {
        "source_sentence": "當學般若波羅蜜。",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0151b25_32"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151b26_0"
    },
    {
        "source_sentence": "菩薩摩訶薩或欲得致阿耨多羅三耶三菩，逮成阿惟三佛，欲令其佛國土無有婬怒癡音響之名，",
        "translation": "“Even if great enlightening beings want to attain unexcelled complete perfect enlightenment, they may acquire the name of unexcelled perfect enlightenment and wish to cause that buddha-land to be free of the sounds of anger, hatred, and delusion.",
        "source": "T08n0222_001:0151b26_1"
    },
    {
        "source_sentence": "使一切眾生皆獲如是色像，如般若波羅蜜具足成就，所施善哉、調順快哉，",
        "translation": "Enabling all sentient beings to attain such forms and images, like the perfection of prajñāpāramitā, fully accomplished, what they give is good and harmonious.",
        "source": "T08n0222_001:0151b28_2"
    },
    {
        "source_sentence": "妙哉智慧、善修梵行，而順遊不居眾生則為快哉，當學般若波羅蜜。",
        "translation": "It's wonderful that wisdom and the well-cultivated religious practice are cultivated, and it's pleasant for sentient beings who travel and don't reside to study the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0151c01_3"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0151c02_4"
    },
    {
        "source_sentence": "菩薩摩訶薩，願我當獲具足聖達，而以正法則富之定無有音聲，當學般若波羅蜜。",
        "translation": "Bodhisattva Mahāsattva, may I attain perfect noble awakening, and with the right teaching, I'll become rich in concentration without sound, and I'll train in the perfection of prajñā.",
        "source": "T08n0222_001:0151c03_5"
    },
    {
        "source_sentence": "心自願言：『吾清聲聞，令江河沙等世界眾生之類，逮得阿耨多羅三耶三菩。』",
        "translation": "He wishes for himself to say, 'I'm a pure śrāvaka who will cause the types of sentient beings in rivers and sands worlds to attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T08n0222_001:0151c05_6"
    },
    {
        "source_sentence": "當學般若波羅蜜。」",
        "translation": "You should train in the perfection of wisdom.",
        "source": "T08n0222_001:0151c06_7"
    },
    {
        "source_sentence": "摩訶般若波羅蜜順空品第二",
        "translation": "Second Chapter of the Mahāprajñāpāramitā-sūtra that accords with emptiness",
        "source": "T08n0222_001:0151c08_0"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩摩訶薩行般若波羅蜜時，興斯之德，四天王即時歡喜：『我等當立四枚之鉢，",
        "translation": "The Buddha told Śāriputra, When the bodhisattva Mahāsattva practiced prajñā-pāramitā, this virtue arose and the four heavenly kings rejoiced, saying, 'We will set up these four bowls.",
        "source": "T08n0222_001:0151c09_0"
    },
    {
        "source_sentence": "四天王前以所奉進過去怛薩阿竭、阿羅訶、三耶三佛，亦當貢上學道法者。』",
        "translation": "In front of the four heavenly kings, he'll present the Tathāgata, Arhat, and Samyak-saṃbuddha buddhas of the past that he consecrated, and he'll also pay homage to those who have studied the path.'",
        "source": "T08n0222_001:0151c11_1"
    },
    {
        "source_sentence": "時忉利天亦復踊躍，焰天、兜率天、尼摩羅天、波羅尼蜜天：『吾等悉當奉事供養此善男子，",
        "translation": "Then the Trāyastriṃśa gods also jumped up and down. The Yama gods, the Tuṣita gods, the Nirmāṇarati gods, and the Paranirmita-vaśavartin gods said:",
        "source": "T08n0222_001:0151c12_2"
    },
    {
        "source_sentence": "阿須倫身則為減損，長益諸天身。』",
        "translation": "The body of the asuras will then be reduced, and the bodies of gods will grow in strength.'",
        "source": "T08n0222_001:0151c14_3"
    },
    {
        "source_sentence": "三千大千世界，上至阿迦膩吒天，莫不踊躍：『吾等請勸使轉法輪。』",
        "translation": "In the 3,000 great one-thousand worlds up to the Akaniṣṭha Heaven, none of them jumped for joy and said, 'We're asking you to encourage us to turn the Dharma wheel.'",
        "source": "T08n0222_001:0151c15_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0222_001:0151c17_5"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，則為長益，具六波羅蜜。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñā, it's for their long benefit that they possess the six perfections.",
        "source": "T08n0222_001:0151c17_6"
    },
    {
        "source_sentence": "善男子、善女人歡喜悅豫：『吾等當為父母之慈、妻子親屬朋友親厚之慈，",
        "translation": "Good men and good women, rejoicing joyfully and joyfully, said, 'We should be compassionate to our parents, wives, relatives, friends, and kindnesses.",
        "source": "T08n0222_001:0151c18_7"
    },
    {
        "source_sentence": "父母兄弟妻子親厚知友愛，敬喜見之。』",
        "translation": "Their parents, brothers, wives, relatives, friends, and loved ones respect and delight in seeing them.'",
        "source": "T08n0222_001:0151c20_8"
    },
    {
        "source_sentence": "四天王、忉利天、焰天、兜率天、尼摩羅天、波羅尼蜜天，上至阿迦膩吒天，",
        "translation": "The four guardian gods of heaven, the Trāyastriṃśa gods, the Trāyastriṃśa gods, the Yama gods, the Tuṣita gods, the Nirmāṇarati gods, and the Paranirmita-vaśavartin gods all ascended to the Akaniṣṭha Heaven.",
        "source": "T08n0222_001:0151c21_9"
    },
    {
        "source_sentence": "不令菩薩與塵欲相值，發心往詣承事作禮：『吾等亦當使得清淨梵天行、離穢濁行，",
        "translation": "The enlightening beings, not wishing to associate with the defiled world, undertake this practice of going and coming, honoring and serving buddhas:",
        "source": "T08n0222_001:0151c22_10"
    },
    {
        "source_sentence": "無習婬欲，致生于梵天。』",
        "translation": "Without cultivating sexual desire, they'll be born in the Brahma heavens.'",
        "source": "T08n0222_001:0151c24_11"
    },
    {
        "source_sentence": "無有放逸而績放逸，諸有色者，不能進至阿耨多羅三耶三菩，是故菩薩以淨梵行棄捐家業，",
        "translation": "There's no carelessness that produces carelessness, and those with form can't advance to unsurpassed, correct, and complete enlightenment; therefore, bodhisattvas abandon their family business because of their pure religious practice.",
        "source": "T08n0222_001:0151c25_12"
    },
    {
        "source_sentence": "乃逮阿耨多羅三耶三菩阿惟三佛，不以穢濁而得佛道。」",
        "translation": "He then attained the unsurpassed, perfect enlightenment of the three bodhisattvas and didn't attain the Buddha Way because of defilement.",
        "source": "T08n0222_001:0151c27_13"
    },
    {
        "source_sentence": "賢者舍利弗白世尊曰：「菩薩之法，必當有父母妻子、親厚知友耶？」",
        "translation": "Good man Śāriputra said to the Bhagavān, Does a bodhisattva's teaching necessarily have parents, wives, wife, relatives, and friends?",
        "source": "T08n0222_001:0151c28_14"
    },
    {
        "source_sentence": "佛告舍利弗：「若有菩薩，必當有父母，不應有妻子，或初發意淨修梵行成為童真，",
        "translation": "The Buddha said to Śāriputra: If there is a bodhisattva, he must have parents and no wives. Or if he has just undertaken the practice of austerity with pure intentions in order to become a religious devotee,",
        "source": "T08n0222_001:0152a01_15"
    },
    {
        "source_sentence": "至成阿耨多羅三耶三菩阿惟三佛。",
        "translation": "Up to the point where he becomes an unsurpassed, correct, and complete buddha.",
        "source": "T08n0222_001:0152a03_16"
    },
    {
        "source_sentence": "或有菩薩，以漚惒拘舍羅習於五欲，然後捨家逮得阿耨多羅三耶三菩阿惟三佛。",
        "translation": "Perhaps there's a bodhisattva who cultivates the five desires with skillful means and then leaves home and attains unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0222_001:0152a03_17"
    },
    {
        "source_sentence": "譬如巧黠幻師及與弟子，善學幻術化造五欲，以此五樂而用自娛戲笑為行。",
        "translation": "It's like a skillful illusionist or a disciple who well trains in illusory magic to create five desires and uses these five pleasures for their own entertainment, play, and laughter as their practice.",
        "source": "T08n0222_001:0152a05_18"
    },
    {
        "source_sentence": "於舍利弗意云何，其幻師者寧為服習於五欲乎？」",
        "translation": "What does Śāriputra think, wouldn't that illusory teacher want to cultivate the five desires?",
        "source": "T08n0222_001:0152a07_19"
    },
    {
        "source_sentence": "舍利弗白：「不也，天中天！」",
        "translation": "Śāriputra said, No, god of gods!",
        "source": "T08n0222_001:0152a08_20"
    },
    {
        "source_sentence": "佛言：「如是，舍利弗！",
        "translation": "The Buddha said, So it is, Śāriputra!",
        "source": "T08n0222_001:0152a09_21"
    },
    {
        "source_sentence": "菩薩摩訶薩以漚惒拘舍羅習於五欲勸化眾生，其菩薩摩訶薩不為五欲之所沾污。",
        "translation": "When the bodhisattva Mahāsattva cultivates the five desires with skillful means and encourages sentient beings to cultivate them, that bodhisattva Mahāsattva isn't stained by the five desires.",
        "source": "T08n0222_001:0152a09_22"
    },
    {
        "source_sentence": "菩薩摩訶薩以無央數事嗟歎愛欲，或有毀呰欲為然熾、愛欲瑕穢、欲為仇怨、欲為怨敵。",
        "translation": "The bodhisattva Mahāsattva denigrates craving with measureless things, or he may disparage desire as blazing, the stain of craving as defilement, the enemy of desire as enemies, and the enemy of desire as enemies.",
        "source": "T08n0222_001:0152a11_23"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0222_001:0152a13_24"
    },
    {
        "source_sentence": "菩薩摩訶薩度眾生故，而為分別此五欲事。」",
        "translation": "Because the bodhisattva Mahāsattva saves sentient beings, he discerns these five things of desire.",
        "source": "T08n0222_001:0152a14_0"
    },
    {
        "source_sentence": "舍利弗白佛：「唯，天中天！",
        "translation": "Śāriputra said to the Buddha, Yes, god of gods!",
        "source": "T08n0222_001:0152a15_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行般若波羅蜜？」",
        "translation": "How does a bodhisattva-mahāsattva practice the perfection of wisdom?",
        "source": "T08n0222_001:0152a15_1"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩摩訶薩行般若波羅蜜，不見菩薩亦不見菩薩字，亦不見般若波羅蜜，",
        "translation": "The Buddha told Śāriputra, When the bodhisattva Mahāsattva practices the perfection of wisdom, he doesn't see the bodhisattva and doesn't see the word bodhisattva, and he doesn't see the perfection of wisdom.",
        "source": "T08n0222_001:0152a16_2"
    },
    {
        "source_sentence": "亦不見行般若波羅蜜字，亦不見非行。",
        "translation": "They don't see the word prajñā-pāramitā for practice, and they don't see what's not practiced.",
        "source": "T08n0222_001:0152a18_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0152a19_4"
    },
    {
        "source_sentence": "菩薩之字自然空。",
        "translation": "The word bodhisattva is naturally empty.",
        "source": "T08n0222_001:0152a19_5"
    },
    {
        "source_sentence": "其為空者，無色、無痛痒思想生死識，不復異色空，不復異痛痒思想生死識空。",
        "translation": "It's emptiness because formless and formless painless thoughts of birth-and-death consciousness are no longer different from form and no longer different from painful thoughts of birth-and-death consciousness as emptiness.",
        "source": "T08n0222_001:0152a19_6"
    },
    {
        "source_sentence": "如色空、痛痒思想生死識亦空。",
        "translation": "It's like the emptiness of form and the emptiness of pain and itch, which are thought that the consciousness of birth-and-death is also empty.",
        "source": "T08n0222_001:0152a21_7"
    },
    {
        "source_sentence": "所謂空者，色則為空，痛痒思想生死識亦自然。",
        "translation": "The so-called emptiness refers to form as emptiness, and the consciousnesses of pain, itch, thought, birth, and death are also naturally present.",
        "source": "T08n0222_001:0152a22_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0152a23_9"
    },
    {
        "source_sentence": "所謂菩薩但假號耳，所謂道者則亦假號，所謂空者則亦假號。",
        "translation": "The so-called bodhisattva only nominally calls, the so-called path is also nominally called, and the so-called emptiness is also nominally called.",
        "source": "T08n0222_001:0152a23_10"
    },
    {
        "source_sentence": "其法自然，不起不滅亦無塵勞，無所依倚、無所諍訟。",
        "translation": "That teaching naturally arises, doesn't arise or cease, has no defilement, has no support, and has no disputes.",
        "source": "T08n0222_001:0152a25_11"
    },
    {
        "source_sentence": "若有菩薩所行如是，不見所起亦不見所滅，不見所猗、不見所訟。",
        "translation": "If there's a bodhisattva who acts like this, he doesn't see what arises and doesn't see what ceases, doesn't see what's peaceful and doesn't see what's disputed.",
        "source": "T08n0222_001:0152a26_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0152a27_13"
    },
    {
        "source_sentence": "誑詐立字因遊客想，或想念故而致此法。",
        "translation": "The word deceptively established is the cause of guest perception, or it may be the cause of this dharma because of perception and thought.",
        "source": "T08n0222_001:0152a27_14"
    },
    {
        "source_sentence": "從何立字？",
        "translation": "Where did the Sanskrit letter ā comes from?",
        "source": "T08n0222_001:0152a28_15"
    },
    {
        "source_sentence": "但託虛言。",
        "translation": "They simply rely on false words.",
        "source": "T08n0222_001:0152a29_16"
    },
    {
        "source_sentence": "曉了如是，菩薩摩訶薩則為行般若波羅蜜，一切不見有名號也，已無所見亦非不見，",
        "translation": "To understand it like this, the bodhisattva Mahāsattva then practices the perfection of prajñāpāramitā, not seeing names or names at all, and having seen nothing, he doesn’t see anything.",
        "source": "T08n0222_001:0152a29_17"
    },
    {
        "source_sentence": "則無所猗，則為行般若波羅蜜。」",
        "translation": "Then there's nothing to be done, and it's the practice of prajñāpāramitā.",
        "source": "T08n0222_001:0152b02_18"
    },
    {
        "source_sentence": "◎◎摩訶般若波羅蜜行空品第三之一佛復告舍利弗：「菩薩摩訶薩行般若波羅蜜時，",
        "translation": "The third and final chapter of the Mahāprajñāpāramitā-sūtra's practice of emptiness Again, the Buddha told Śāriputra, When bodhisattvas and mahāsattvas practice the perfection of wisdom,",
        "source": "T08n0222_001:0152b02_19"
    },
    {
        "source_sentence": "當作斯觀：『所號菩薩、所謂佛者，亦假號耳；",
        "translation": "You should think thus: The bodhisattvas and so-called buddhas are also nominally called.",
        "source": "T08n0222_001:0152b05_20"
    },
    {
        "source_sentence": "所謂名色痛痒思想生死識亦假號耳；",
        "translation": "The so-called consciousnesses of name, form, pain, itch, thought, birth and death are also metaphors.",
        "source": "T08n0222_001:0152b06_0"
    },
    {
        "source_sentence": "皆由吾我。",
        "translation": "It's all because of self.",
        "source": "T08n0222_001:0152b06_1"
    },
    {
        "source_sentence": "所謂我者，適無所有，無我、無人、無命、無壽及含血蠕動，無心、無意。",
        "translation": "The so-called self refers to absence of existence, absence of self, absence of person, absence of life, absence of longevity, absence of wriggling with blood, absence of mind, and absence of mind.",
        "source": "T08n0222_001:0152b07_2"
    },
    {
        "source_sentence": "若作所造，自然所習所更所見知見之事，如此輩類，皆不可得、空無所著。",
        "translation": "If they do things that are created, naturally cultivated, and changed, such a group of people can't obtain them, and emptiness has no attachments.",
        "source": "T08n0222_001:0152b08_3"
    },
    {
        "source_sentence": "悉由假號，但有虛言。』",
        "translation": "It's all because of the nominal names, but there are false words.'",
        "source": "T08n0222_001:0152b10_4"
    },
    {
        "source_sentence": "如是菩薩摩訶薩為行般若波羅蜜，不見眾生，設無所見亦不有見，亦復不見所託言也。",
        "translation": "Thus, the bodhisattva Mahāsattva doesn't see sentient beings for the sake of practicing the perfection of prajñāpāramitā, and if there's nothing to see or nothing to see, he also doesn't see the words entrusted to him.",
        "source": "T08n0222_001:0152b10_5"
    },
    {
        "source_sentence": "菩薩摩訶薩所行如是，為隨怛薩阿竭所教行般若波羅蜜。",
        "translation": "Thus does the bodhisattva Mahāsattva practice, following what he teaches in the Tathāgata's teaching to practice prajñāpāramitā.",
        "source": "T08n0222_001:0152b12_6"
    },
    {
        "source_sentence": "捨怛薩阿竭已，其智慧過諸聲聞、辟支佛，所興空行而不迷惑。",
        "translation": "After abandoning the tathāgata, his wisdom surpasses that of śrāvakas and pratyekbuddhas, and he doesn't become confused by the practice of emptiness that they give rise to.",
        "source": "T08n0222_001:0152b14_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0152b15_8"
    },
    {
        "source_sentence": "其人所修，不見於字所當猗者。",
        "translation": "That person cultivates it, but they don't see the words that should be placed there.",
        "source": "T08n0222_001:0152b16_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行如是者，為行般若波羅蜜。」",
        "translation": "When a bodhisattva-mahāsattva does so, he's practicing the perfection of wisdom.",
        "source": "T08n0222_001:0152b16_1"
    },
    {
        "source_sentence": "佛言：「譬如舍利弗、摩訶目揵連諸比丘等，使滿閻浮提，猶如竹蘆甘蔗稻麻叢林，",
        "translation": "The Buddha said, Suppose the monks Śāriputra and Mahāmaudgalyāyana were to fill Jambudvīpa like bamboo, reeds, sugarcane, rice, and hemp jungles.",
        "source": "T08n0222_001:0152b17_2"
    },
    {
        "source_sentence": "智慧具足，終不能及行般若波羅蜜菩薩，百倍千倍萬倍億倍，不任以前。",
        "translation": "Their depth of wisdom is so great that they can't match the bodhisattva who practices the perfection of prajñāpāramitā, which is a hundredfold, a thousandfold, a thousandfold, ten thousandfold, or a millionfold, and doesn't allow them to do so.",
        "source": "T08n0222_001:0152b19_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0152b21_4"
    },
    {
        "source_sentence": "菩薩智慧欲度一切眾生之類之所致也。",
        "translation": "It's the result of the bodhisattva's wisdom wanting to save all kinds of sentient beings.",
        "source": "T08n0222_001:0152b21_5"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0152b22_6"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，一日行智，皆過聲聞、辟支佛所立之上，置是滿閻浮提舍利弗、摩訶目揵連等比丘空。",
        "translation": "When the bodhisattva Mahāsattva practices prajñā-pāramitā and one day he practices wisdom, they're all superior to those established by śrāvakas and pratyekbuddhas, placing them above the emptiness of Śāriputra and Mahāmaudgalyāyana and other monks who fill Jambudvīpa.",
        "source": "T08n0222_001:0152b22_7"
    },
    {
        "source_sentence": "正使三千大千世界滿中舍利弗摩、訶目揵連諸比丘等所有智慧，不及行菩薩摩訶薩。",
        "translation": "It's precisely because the wisdom of the 3,000 great one-thousand worlds filled with Śāriputra, Mahāmaudgalyāyana, and other monks like them is inferior to that of the bodhisattva Mahāsattva who practices it.",
        "source": "T08n0222_001:0152b25_8"
    },
    {
        "source_sentence": "置是三千大千世界舍利弗、摩訶目揵連諸比丘等。",
        "translation": "Suppose there are 3,000 great one-thousand worlds of Śāriputra, Mahāmaudgalyāyana, and other monks.",
        "source": "T08n0222_001:0152b27_9"
    },
    {
        "source_sentence": "譬如東方江河沙等諸佛國土，悉滿其中舍利弗、摩訶目揵連諸比丘等普及十方，",
        "translation": "Suppose there were buddha-lands as numerous as the grains of sand in rivers in the eastern direction, all filled with the monks Śāriputra and Mahāmaudgalyāyana who spread throughout the ten directions.",
        "source": "T08n0222_001:0152b28_10"
    },
    {
        "source_sentence": "斯等不及行般若波羅蜜菩薩智慧一日，過一切聲聞、辟支佛智慧，百倍千倍巨億萬倍不相屬逮。」",
        "translation": "These aren't as great as the one day of wisdom of the bodhisattva who practices the perfection of wisdom of prajñāpāramitā, which surpasses the wisdom of all śrāvakas and pratyekbuddhas a hundredfold, a thousandfold, or a trillion times greater than their own.",
        "source": "T08n0222_001:0152c01_11"
    },
    {
        "source_sentence": "於是賢者舍利弗白世尊曰：「唯然，其聲聞智慧，須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、菩薩、怛薩阿竭、阿羅訶、三耶三佛智慧，",
        "translation": "Then the venerable Śāriputra said to the World-honored One: Yes, it is so. The wisdom of the śrāvakas consists of the wisdom of the srotadpannas, sakṛdāgāmins, anagamins, arhats, pratyekabuddhas, bodhisattvas, bodhisattvas, kṣatriyas, agadas,",
        "source": "T08n0222_001:0152c03_12"
    },
    {
        "source_sentence": "計此一切所有智慧，無所破壞、無所諍訟，而無所起，自然為空。",
        "translation": "All this wisdom that exists in all of them is not destroyed or disputed, and nothing arises, which naturally becomes emptiness.",
        "source": "T08n0222_001:0152c06_13"
    },
    {
        "source_sentence": "唯，天中天！",
        "translation": "Yes, god of gods!",
        "source": "T08n0222_001:0152c07_14"
    },
    {
        "source_sentence": "其無所壞、無所諍訟、無起、自然空者，寧可獲致若干差特不乎？",
        "translation": "If there's nothing to break down, nothing to dispute, nothing to give rise to, and natural emptiness, how could it be possible to cause certain distinctions?",
        "source": "T08n0222_001:0152c08_15"
    },
    {
        "source_sentence": "云何菩薩一日行智，而復於此過一切聲聞、辟支佛乎？」",
        "translation": "How is it that a bodhisattva's knowledge of one day's practice surpasses all śrāvakas and pratyekbuddhas here?",
        "source": "T08n0222_001:0152c09_16"
    },
    {
        "source_sentence": "佛告舍利弗：「於舍利弗意云何，菩薩所以行般若波羅蜜者何？",
        "translation": "The Buddha told Śāriputra, What did Śāriputra think, and why did the bodhisattva practice prajñā-pāramitā?",
        "source": "T08n0222_001:0152c10_17"
    },
    {
        "source_sentence": "一日之中所行智慧、所建立願，修於幻術而行愍哀，皆為一切眾生之類，",
        "translation": "In the course of a single day he practiced wisdom and vows, cultivated magic tricks, and carried out compassion for all sentient beings.",
        "source": "T08n0222_001:0152c12_18"
    },
    {
        "source_sentence": "悉了諸法以化群萌，欲令滅度。",
        "translation": "He fully understands all dharmas to transform sentient beings and wants to cause them to be liberated.",
        "source": "T08n0222_001:0152c14_0"
    },
    {
        "source_sentence": "諸聲聞、辟支佛，寧為興立如是之緣智慧不乎？」",
        "translation": "Would śrāvakas and pratyekbuddhas establish such kinds of cognition for the sake of these kinds of conditions?",
        "source": "T08n0222_001:0152c14_1"
    },
    {
        "source_sentence": "答曰：「不也，天中天！」",
        "translation": "He replied, No, god of gods!",
        "source": "T08n0222_001:0152c15_2"
    },
    {
        "source_sentence": "佛言：「於舍利弗意云何，諸聲聞、辟支佛豈有此念：『我等當逮阿耨多羅三耶三菩阿惟三佛，",
        "translation": "The Buddha said: What do you think, reverend Śāriputra? Do śrāvakas and pratyekabuddhas not have this thought:",
        "source": "T08n0222_001:0152c16_3"
    },
    {
        "source_sentence": "教化眾生至泥洹界，令滅度耶？』」",
        "translation": "Will you teach sentient beings to reach the nirvāṇa realm and cause them to be liberated?'",
        "source": "T08n0222_001:0152c18_4"
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T08n0222_001:0152c19_5"
    },
    {
        "source_sentence": "佛言：「以是故，當復知此一切聲聞、辟支佛所有智慧，百倍千倍智慧、百千倍巨億萬倍終不相及。",
        "translation": "The Buddha said, For this reason, you should also know that the wisdom of all these śrāvakas and pratyekbuddhas is a hundredfold, a thousandfold, a hundred thousandfold, a hundred thousandfold, or a hundred million times greater than each other.",
        "source": "T08n0222_001:0152c19_6"
    },
    {
        "source_sentence": "於意云何，聲聞、辟支佛寧有此念：『吾等當行六波羅蜜，教化眾生嚴淨佛土，",
        "translation": "“What do you think? śrāvakas and pratyekabuddhas should have this thought:",
        "source": "T08n0222_001:0152c21_7"
    },
    {
        "source_sentence": "具足怛薩阿竭十種力、四無所畏、四分別辯、十八不共諸佛之法，得成阿耨多羅三耶三菩阿惟三佛，",
        "translation": "They are endowed with the ten powers of the kṣatriya, the four fearlessnesses, the four kinds of discriminating eloquence, and the eighteen unique qualities of buddhahood, and they attain unexcelled, perfect enlightenment.",
        "source": "T08n0222_001:0152c23_8"
    },
    {
        "source_sentence": "度脫滅度無量無限不可計數眾生之類不乎？』」",
        "translation": "Isn't it the kind of sentient beings who are liberated, liberated, and liberated by measureless, infinite, and incalculable sentient beings?'",
        "source": "T08n0222_001:0152c25_9"
    },
    {
        "source_sentence": "答曰：「不也，天中天！」",
        "translation": "He replied, No, god of gods!",
        "source": "T08n0222_001:0152c26_10"
    },
    {
        "source_sentence": "佛言：「菩薩摩訶薩發心念言：『吾當奉行六波羅蜜，具一切法，成阿耨多羅三耶三菩，",
        "translation": "The Buddha said, “The great enlightening beings have set their minds on the six transcendent ways, saying, ‘I should practice them in order to fulfill all truths and attain highest, complete enlightenment.",
        "source": "T08n0222_001:0152c27_11"
    },
    {
        "source_sentence": "度脫不可計數眾生之類。』」",
        "translation": "He liberates an incalculable number of sentient beings.'",
        "source": "T08n0222_001:0152c29_12"
    },
    {
        "source_sentence": "佛言：「譬如日之宮殿奮其光明，一時普照閻浮提地無不周遍。",
        "translation": "The Buddha said, Suppose the sun's palace arouses its light and shines universally throughout Jambudvīpa at once.",
        "source": "T08n0222_001:0152c29_13"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0222_001:0153a02_14"
    },
    {
        "source_sentence": "菩薩摩訶薩行六波羅蜜，具十種力、四無所畏、四分別辯、十八不共諸佛之法，",
        "translation": "“Great enlightening beings practice the six transcendent ways, imbued with ten kinds of powers, four fearlessnesses, four discriminations, and eighteen unique qualities of buddhas:",
        "source": "T08n0222_001:0153a02_15"
    },
    {
        "source_sentence": "逮成阿耨多羅三耶三菩，開化度脫無量無限不可計數眾生之類。」",
        "translation": "They attain the unsurpassed, correct, and complete enlightenment, which enlightens and liberates measureless, limitless, and incalculable numbers of sentient beings.",
        "source": "T08n0222_001:0153a04_16"
    },
    {
        "source_sentence": "賢者舍利弗白佛言：「云何菩薩摩訶薩越於聲聞、辟支佛地，而便逮及阿惟越致地淨修佛道？」",
        "translation": "Good man Śāriputra said to the Buddha, How does a bodhisattva-mahāsattva go beyond the stages of śrāvakas and pratyekbuddhas and then attains the pure cultivation of the Buddha Way in the stages of śrāvakas and pratyekbuddhas?",
        "source": "T08n0222_001:0153a05_17"
    },
    {
        "source_sentence": "佛告舍利弗：「於是菩薩摩訶薩，從初發意行六波羅蜜，過於空法、無想、無願，",
        "translation": "The Buddha told Śāriputra, Thus, the bodhisattva Mahāsattva practiced the six transcendent ways from the first arousal of his mind, going beyond the teaching of emptiness, the absence of ideation, and the absence of wish.",
        "source": "T08n0222_001:0153a07_18"
    },
    {
        "source_sentence": "則為超越聲聞、辟支佛地，住阿惟越致地。」",
        "translation": "Then they'll transcend the stages of śrāvakas and pratyekbuddhas and abide in the stage of abhidharma.",
        "source": "T08n0222_001:0153a09_19"
    },
    {
        "source_sentence": "賢者舍利弗復白佛言：「云何菩薩摩訶薩，於一切聲聞、辟支佛為最眾祐？」",
        "translation": "Again, the good man Śāriputra said to the Buddha, How is the bodhisattva Mahāsattva the most blessed of all śrāvakas and pratyekbuddhas?",
        "source": "T08n0222_001:0153a10_20"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩摩訶薩從初發意行六波羅蜜，至坐佛樹，常於一切聲聞、辟支佛為最眾祐。",
        "translation": "The Buddha told Śāriputra, From the first arousal of the intention to practice the six perfections, the bodhisattva Mahāsattva goes to sit at the Buddha's tree and always becomes the most blessed among all śrāvakas and pratyekbuddhas.",
        "source": "T08n0222_001:0153a12_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0153a14_1"
    },
    {
        "source_sentence": "菩薩摩訶薩若來現者，則自然興真妙之法，具足十善、又成五戒，立八等事及八關齋，",
        "translation": "“When great enlightening beings come to manifest themselves, they naturally produce true and sublime teachings, perfecting the ten good deeds and also upholding the five precepts, establishing the eight kinds of service and the eight precepts.",
        "source": "T08n0222_001:0153a14_2"
    },
    {
        "source_sentence": "四禪、四等心、四無色三昧、四意止、四意斷、五根、五力、七覺意、八由行現於世間，",
        "translation": "The fourth meditation, the four equal states of mind, the four formless concentrations, the four mental states, the four mental states of cessation, the four mental states of elimination, the five faculties, the five powers, the seven mental states of enlightenment, and the eight mental states of practice are manifested in the world.",
        "source": "T08n0222_001:0153a16_3"
    },
    {
        "source_sentence": "如來十力、四無所畏、四分別辯、十八不共諸佛之法，如是輩類眾善之德興現于世，",
        "translation": "The ten powers of the Buddha, the four fearlessnesses, the four discriminating explanations, and the eighteen unique qualities of buddhas—the virtues of such a class of many good qualities are manifest in the world.",
        "source": "T08n0222_001:0153a18_0"
    },
    {
        "source_sentence": "則分別君子族姓、梵志長者、傲族大姓及忉利天上至三十三處、想無想天，",
        "translation": "They then discern the clans of gentlemen, brahmins, wealthy householders, arrogant great householders, and the Trāyastriṃśa gods up to the thirty-three heavens in the realm of neither thought nor nonthought.",
        "source": "T08n0222_001:0153a19_1"
    },
    {
        "source_sentence": "須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、怛薩阿竭、阿羅呵、三耶三菩，",
        "translation": "The stream-winner, the once-returner, the anāgāmin, the arhat, the pratyekabuddha, the kṣatriya, the tatthāgata, the Ārāha, and the samyak-saṃbhūmi.",
        "source": "T08n0222_001:0153a21_2"
    },
    {
        "source_sentence": "緣此別知有此事耳。」",
        "translation": "It's because of this that they know separately that there's this thing.",
        "source": "T08n0222_001:0153a23_3"
    },
    {
        "source_sentence": "舍利弗白佛言：「云何菩薩摩訶薩淨畢眾祐？」",
        "translation": "Śāriputra said to the Buddha, How does the bodhisattva Mahāsattva purify and fulfill all blessings?",
        "source": "T08n0222_001:0153a23_4"
    },
    {
        "source_sentence": "世尊告曰：「菩薩摩訶薩於眾祐中無所淨畢。",
        "translation": "The Bhagavān told them, There's nothing that the bodhisattva Mahāsattva can purify in the midst of all blessings.",
        "source": "T08n0222_001:0153a24_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0153a25_6"
    },
    {
        "source_sentence": "究竟於空則為菩薩摩訶薩成眾祐也。",
        "translation": "When he reaches the ultimate point of emptiness, then he becomes a bodhisattva-mahāsattva who accomplishes many blessings.",
        "source": "T08n0222_001:0153a25_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0153a26_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0222_001:0153a27_9"
    },
    {
        "source_sentence": "菩薩摩訶薩為布施士。",
        "translation": "The bodhisattva Mahāsattva is a donor.",
        "source": "T08n0222_001:0153a27_10"
    },
    {
        "source_sentence": "何所施者？",
        "translation": "What's the donor?",
        "source": "T08n0222_001:0153a27_11"
    },
    {
        "source_sentence": "以善法施，開化眾生。",
        "translation": "By bestowing the good Dharma, he enlightened sentient beings.",
        "source": "T08n0222_001:0153a28_12"
    },
    {
        "source_sentence": "何謂善法？",
        "translation": "By what is the wholesome dharma meant?",
        "source": "T08n0222_001:0153a28_13"
    },
    {
        "source_sentence": "十善之事，五戒、六波羅蜜，十力、四無所畏、四分別辯、十八不共諸佛之法，",
        "translation": "The ten virtuous deeds are the five precepts, the six transcendent ways, the ten powers, the four fearlessnesses, the four kinds of discrimination and elucidation, and the eighteen unique qualities of buddhas.",
        "source": "T08n0222_001:0153a28_14"
    },
    {
        "source_sentence": "開化須陀洹、斯陀含、阿那含、阿羅漢、辟支佛，怛薩阿竭、阿羅呵、三耶三佛布施之士。」",
        "translation": "They enlighten stream-winner, sakṛdāgāmin, non-returner, arhat, pratyekabuddha, tathāgata, arhat, and samyak-saṃbuddha donors.",
        "source": "T08n0222_001:0153b01_15"
    },
    {
        "source_sentence": "舍利弗復白佛言：「唯然，世尊！",
        "translation": "Śāriputra again said to the Buddha, Yes, Bhagavān!",
        "source": "T08n0222_001:0153b03_16"
    },
    {
        "source_sentence": "菩薩摩訶薩遵修何行，為行般若波羅蜜？」",
        "translation": "What practice does the bodhisattva Mahāsattva follow in order to practice the perfection of wisdom?",
        "source": "T08n0222_001:0153b04_0"
    },
    {
        "source_sentence": "佛告舍利弗：「於是菩薩設行色空者，則為行般若波羅蜜，設行痛痒思想生死識空者，",
        "translation": "The Buddha told Śāriputra, Thus, if a bodhisattva sets out to practice form as emptiness, then he's practicing prajñāpāramitā. If he sets out to practice painful and itchy thoughts of birth-and-death consciousness as emptiness,",
        "source": "T08n0222_001:0153b04_1"
    },
    {
        "source_sentence": "是則為行。",
        "translation": "This is practice.",
        "source": "T08n0222_001:0153b06_2"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0153b07_3"
    },
    {
        "source_sentence": "菩薩摩訶薩解知眼空、耳鼻舌身意空者，此則為行。",
        "translation": "When the bodhisattva Mahāsattva understands that the eye is empty and the ear, nose, tongue, body, and mind are empty, this is practice.",
        "source": "T08n0222_001:0153b07_4"
    },
    {
        "source_sentence": "解色空、聲香味觸法空者，此則為行。",
        "translation": "Understanding the emptiness of form and the emptiness of sound, smell, taste, touch, and dharmas is practice.",
        "source": "T08n0222_001:0153b08_5"
    },
    {
        "source_sentence": "解眼界空者，此則為行。",
        "translation": "Understanding the emptiness of the eye realm, this is practice.",
        "source": "T08n0222_001:0153b09_6"
    },
    {
        "source_sentence": "解色界、眼識界，解耳鼻舌身意界空者，此則為行。",
        "translation": "If someone understands the form realm and the eye consciousness realm and understands the emptiness of the ear, nose, tongue, body, and mind realms, this is practice.",
        "source": "T08n0222_001:0153b10_7"
    },
    {
        "source_sentence": "解耳聲耳識、鼻香鼻識、舌味舌識、身細滑身識、意所欲意識空者，此則為行。",
        "translation": "Understanding the emptiness of the ear, sound, ear consciousness, nose, fragrance, nose consciousness, tongue, taste, tongue consciousness, body, subtle and slippery body consciousness, and mentally desired consciousness are practiced.",
        "source": "T08n0222_001:0153b11_8"
    },
    {
        "source_sentence": "解苦空者，習亦復空，盡亦復空，八由亦空，此則為行。",
        "translation": "Understanding the emptiness of suffering means that its accumulation is also emptiness, its exhaustion is also emptiness, and the eightfold path is also emptiness, which is practice.",
        "source": "T08n0222_001:0153b13_9"
    },
    {
        "source_sentence": "解無黠亦空、行亦空、識亦空、名色亦空、六入亦空、所更亦空、痛痒亦空、思愛亦空、所受亦空、所有亦空、生老死亦空，",
        "translation": "Also emptiness of understanding and non-cognisance, emptiness of volition, emptiness of consciousness, emptiness of name and form, emptiness of the six sense bases, emptiness of what’s changed, emptiness of pain and itch, emptiness of thoughts and emotions, emptiness of sensation, emptiness of possessions, empti",
        "source": "T08n0222_001:0153b14_10"
    },
    {
        "source_sentence": "此則為行。",
        "translation": "This is practice.",
        "source": "T08n0222_001:0153b17_11"
    },
    {
        "source_sentence": "解一切法空，此則為行。",
        "translation": "Understanding the emptiness of all dharmas is practice.",
        "source": "T08n0222_001:0153b17_12"
    },
    {
        "source_sentence": "諸所自然有為無為悉能解空，此則為行。",
        "translation": "All naturally conditioned and unconditioned things can understand emptiness, which is practice.",
        "source": "T08n0222_001:0153b17_13"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，解本淨空志性亦然，此則為行。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of prajñāpāramitā understand that the originally pure nature of emptiness and aspiration is likewise, this is practice.",
        "source": "T08n0222_001:0153b18_14"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0222_001:0153b20_15"
    },
    {
        "source_sentence": "是為菩薩摩訶薩行般若波羅蜜，當解是七空，此乃為行。",
        "translation": "These are the seven kinds of emptiness that bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom should understand, and these are the practices.",
        "source": "T08n0222_001:0153b20_16"
    },
    {
        "source_sentence": "以此七空行般若波羅蜜，色無應不應、無行不行，不作此觀，不見痛痒思想生死識應不應、行不行，",
        "translation": "Because these seven kinds of emptiness practice prajñā-pāramitā, form shouldn't and shouldn't be associated with form and practiced without form; if they don't do so, they won't see pain, itch, thought, birth-and-death consciousnesses that should or shouldn't be associated with form and practice without form.",
        "source": "T08n0222_001:0153b21_17"
    },
    {
        "source_sentence": "不見色法有所起有所滅、不見痛痒思想生死識法有所起法有所滅，不見色法有所依著法有所諍訟、不見痛痒思想生死識法有所著法有所諍，",
        "translation": "They don't see form dharmas that arise and cease, don't see pain, itch, thought, birth-and-death consciousness dharmas that arise and cease, don't see form dharmas that depend on dharmas that are disputed, and don't see pain, itch, thought, birth-and-death consciousness",
        "source": "T08n0222_001:0153b23_18"
    },
    {
        "source_sentence": "不見與色而俱遊居、不見與痛痒思想生死識而俱遊居，不見與生死而俱遊，",
        "translation": "They don’t see form, and they don’t see pain, itch, thought, birth, and death as consciousnesses; they don’t see birth and death as consciousness.",
        "source": "T08n0222_001:0153b27_19"
    },
    {
        "source_sentence": "亦不見不與生死而遊居也。",
        "translation": "They also don't see that they don't travel and live with birth and death.",
        "source": "T08n0222_001:0153b29_20"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0153c01_21"
    },
    {
        "source_sentence": "永無有法而與俱，緣起諸事本淨為空。",
        "translation": "There are no dharmas at all and they are associated with them, and the conditioned arising of things that are inherently pure is emptiness.",
        "source": "T08n0222_001:0153c01_22"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0222_001:0153c02_23"
    },
    {
        "source_sentence": "色則為空則無有色，痛痒思想生死識空則無有識。」",
        "translation": "When form is emptiness, there's no form; when pain and itch are thought of birth-and-death consciousness as emptiness, there's no consciousness.",
        "source": "T08n0222_001:0153c02_24"
    },
    {
        "source_sentence": "佛語舍利弗：「其為空者，無有起者、無有滅者。",
        "translation": "The Buddha said to Śāriputra, This is emptiness, which has no arising and no ceasing.",
        "source": "T08n0222_001:0153c03_25"
    },
    {
        "source_sentence": "假使色空則無有色，假使痛痒思想生死識空則無有識。",
        "translation": "If form were empty, there wouldn't be form, and if pain, itch, thought, birth-and-death consciousness were empty, there wouldn't be consciousness.",
        "source": "T08n0222_001:0153c04_26"
    },
    {
        "source_sentence": "設使色空則不有見，設痛痒空則無所患，設思想空則無所念，設使行空則無所造，",
        "translation": "If form were empty, there wouldn’t be views; if pain and itch were empty, there wouldn’t be anything to fear; if thought were empty, there wouldn’t be thoughts; and if volition were empty, there wouldn’t be anything to create.",
        "source": "T08n0222_001:0153c06_27"
    },
    {
        "source_sentence": "設識空者無所分別。",
        "translation": "Suppose someone who posits that consciousness is empty has nothing to discriminate.",
        "source": "T08n0222_001:0153c08_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0153c08_29"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T08n0222_001:0153c08_30"
    },
    {
        "source_sentence": "色者則異，不與空同；",
        "translation": "Form is different, not the same as space.",
        "source": "T08n0222_001:0153c09_31"
    },
    {
        "source_sentence": "空不為異，色不為分別。",
        "translation": "Emptiness is not different, and form is not discriminated.",
        "source": "T08n0222_001:0153c09_32"
    },
    {
        "source_sentence": "色自然空，色則為空，痛痒思想生死識不為別異，空亦不異。",
        "translation": "Form is naturally empty, and form is emptiness; pain, itch, thought, birth-and-death, and consciousness aren't distinct or different, and emptiness isn't different.",
        "source": "T08n0222_001:0153c10_33"
    },
    {
        "source_sentence": "設空不異，識亦不異，識自然空，識則為空。」",
        "translation": "Suppose emptiness isn't different, and consciousness isn't different; consciousness is naturally empty, and consciousness is emptiness.",
        "source": "T08n0222_001:0153c11_34"
    },
    {
        "source_sentence": "佛語舍利弗：「其為空者，不起不滅、無所依著、無所諍訟，無所增、無所損，",
        "translation": "The Buddha said to Śāriputra: This is emptiness because it neither arises nor perishes, has no support or attachment, is not contentious, does not increase and does not decrease.",
        "source": "T08n0222_001:0153c12_35"
    },
    {
        "source_sentence": "無過去無當來無現在。",
        "translation": "There's no past, no future, and no present.",
        "source": "T08n0222_001:0153c14_36"
    },
    {
        "source_sentence": "彼亦無色痛痒思想生死識，亦無眼耳鼻舌身心，亦無色聲香味細滑，所欲法彼則無。",
        "translation": "They also have no form, pain, itch, thought, birth-and-death consciousness, eyes, ears, nose, nose, tongue, body, or mind, and they don't have form, sound, odor, taste, subtlety, or slipperiness, and they don't have the desired qualities.",
        "source": "T08n0222_001:0153c14_37"
    },
    {
        "source_sentence": "無黠不滅、無黠不行，不識、不名色、不六入、不細滑、不痛、不愛、不受、不有、不生、不老不病不死，",
        "translation": "Without intelligence, they do not cease; without intelligence, they do not act; without consciousness, they do not know names and forms; without the six sense-fields; without subtlety and smoothness; without pain; without craving; without sensation; without being; without existence; without birth; without old age; without illness; without death.",
        "source": "T08n0222_001:0153c16_38"
    },
    {
        "source_sentence": "亦不滅除生老病死。",
        "translation": "Nor does it remove birth, old age, illness, and death.",
        "source": "T08n0222_001:0153c18_39"
    },
    {
        "source_sentence": "彼亦不苦，亦無習，亦無所盡，亦無所由。",
        "translation": "They are neither painful, nor conditioned, nor inexhaustible, and have no cause.",
        "source": "T08n0222_001:0153c19_40"
    },
    {
        "source_sentence": "彼亦無得，亦無有時。",
        "translation": "They also have no acquisition, and there's no time for them.",
        "source": "T08n0222_001:0153c20_41"
    },
    {
        "source_sentence": "彼無須陀洹果，無斯陀含果，無阿那含果，無阿羅漢果，無辟支佛覺，",
        "translation": "They lack the fruit of stream entry, the fruit of once-returning, the fruit of non-returning, the fruit of non-returning, the fruit of arhatship, and the awakening of the solitary realizer.",
        "source": "T08n0222_001:0153c20_42"
    },
    {
        "source_sentence": "亦無得道，亦無佛道。",
        "translation": "Nor is there the attainment of the path, nor is there the Buddha Way.",
        "source": "T08n0222_001:0153c22_43"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜如是者，則為菩薩摩訶薩行般若波羅蜜，不見般若波羅蜜應不應、行不行，",
        "translation": "If a bodhisattva-mahāsattva thus practices the perfection of prajñāpāramitā, then he's a bodhisattva-mahāsattva who practices the perfection of prajñāpāramitā and doesn't see that the perfection of prajñāpāramitā should or shouldn't be practiced or practiced.",
        "source": "T08n0222_001:0153c22_44"
    },
    {
        "source_sentence": "不見施，不戒、不忍、不進、不禪、不智，不見是六波羅蜜。",
        "translation": "They don't see generosity, don't observe precepts, don't tolerate, don't advance, don't meditate, and don't know, and don't see these six perfections.",
        "source": "T08n0222_001:0153c25_45"
    },
    {
        "source_sentence": "不見色痛痒思想生死識應不應、行不行；",
        "translation": "They do not see form, pain, itch, thought, birth-and-death consciousnesses that should not arise or act.",
        "source": "T08n0222_001:0153c26_46"
    },
    {
        "source_sentence": "不見眼應不應、行不行，不見耳鼻舌身心應不應、行不行；",
        "translation": "They do not see that the organ of sight should not be; they do not see that the organs of hearing, smell, taste, touch, and body should not be; they do not see that the organs of hearing, smell, taste, and touch are not; they do not see that the functioning is not.",
        "source": "T08n0222_001:0153c27_47"
    },
    {
        "source_sentence": "不見色聲香味細滑所欲法應不應、行不行；",
        "translation": "They do not perceive form, sound, odor, taste, fineness, subtlety, or slipperiness. The things they desire should not be perceived and their actions should not be perceived.",
        "source": "T08n0222_001:0153c28_48"
    },
    {
        "source_sentence": "不見四意止應不應、行不行；",
        "translation": "They do not see the four kinds of mental cessation: what should be stopped, what should not be stopped, and what should not be done.",
        "source": "T08n0222_001:0153c29_49"
    },
    {
        "source_sentence": "不見四意斷、四神足、五根、五力、七覺、八由應不應、行不行；",
        "translation": "They do not see the four kinds of annihilation of thought, the four spiritual powers, the five faculties, the five powers, the seven forms of enlightenment, the eight reasons why it should not be done, and the non-practicing.",
        "source": "T08n0222_001:0154a01_50"
    },
    {
        "source_sentence": "不見十種力、四無所畏、四分別辯、十八不共諸佛之法應不應、行不行；",
        "translation": "They do not see the ten kinds of powers, the four fearlessnesses, the four discriminating explanations, the eighteen unique qualities of buddhas, what should be done and what should not be done.",
        "source": "T08n0222_001:0154a02_51"
    },
    {
        "source_sentence": "不見怛薩阿竭薩云然慧應不應、行不行。",
        "translation": "They don't see the Tathāgata as a tathāgata who says, Still, wisdom shouldn't be associated with what's appropriate and practiced.",
        "source": "T08n0222_001:0154a04_52"
    },
    {
        "source_sentence": "是為，舍利弗！",
        "translation": "This is so, Śāriputra!",
        "source": "T08n0222_001:0154a05_53"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，此乃應行。」",
        "translation": "Here is what the bodhisattva Mahāsattva should do when he practices the perfection of wisdom.",
        "source": "T08n0222_001:0154a05_54"
    },
    {
        "source_sentence": "佛語舍利弗：「菩薩摩訶薩行般若波羅蜜，空不與空鬪，空不與空行；",
        "translation": "The Buddha said to Śāriputra, When the bodhisattva Mahāsattva practices the perfection of wisdom, emptiness doesn't fight with emptiness, and emptiness doesn't practice with emptiness.",
        "source": "T08n0222_001:0154a06_55"
    },
    {
        "source_sentence": "無相不與無相鬪，無想不與無想行；",
        "translation": "The formless one does not fight with the formless, and the formless one does not fight with the formless.",
        "source": "T08n0222_001:0154a07_56"
    },
    {
        "source_sentence": "無願不與無願鬪，無願不與無願行。",
        "translation": "The absence of wishes doesn't fight with the absence of wishes, and the absence of wishes doesn't practice with the absence of wishes.",
        "source": "T08n0222_001:0154a08_57"
    },
    {
        "source_sentence": "空不與空相應，無相不與無相相應，無願不與無願相應。",
        "translation": "Emptiness isn't associated with emptiness, signlessness isn't associated with signlessness, and wishlessness isn't associated with wishlessness.",
        "source": "T08n0222_001:0154a09_58"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0154a10_59"
    },
    {
        "source_sentence": "空者無行不行，無相者亦無行不行，無願者亦無行不行，菩薩摩訶薩行般若波羅蜜能如斯者，",
        "translation": "What's empty is without practice and not practiced, what's signless is also without practice and not practiced, and what's wishless is also without practice and not practiced, and the bodhisattva Mahāsattva who practices prajñā-pāramitā can do so.",
        "source": "T08n0222_001:0154a11_60"
    },
    {
        "source_sentence": "此乃為行。」",
        "translation": "This is practice.",
        "source": "T08n0222_001:0154a13_61"
    },
    {
        "source_sentence": "佛復語舍利弗：「菩薩摩訶薩行般若波羅蜜，諸法自然相則得度空。",
        "translation": "Again, the Buddha said to Śāriputra, When a bodhisattva Mahāsattva practices the perfection of prajñāpāramitā, the natural characteristics of dharmas will then be liberated from emptiness.",
        "source": "T08n0222_001:0154a13_62"
    },
    {
        "source_sentence": "已得度空，不與色諍亦無所行；",
        "translation": "Having liberated themselves from emptiness, they do not coexist with form and have no activity whatsoever.",
        "source": "T08n0222_001:0154a15_63"
    },
    {
        "source_sentence": "不與痛痒思想生死識諍亦無所行；",
        "translation": "They do not associate with pain, itch, thought of birth and death as consciousnesses, and they have no activity.",
        "source": "T08n0222_001:0154a15_64"
    },
    {
        "source_sentence": "不與過去色諍，亦不見過去色；",
        "translation": "They do not argue with past forms, nor do they see past forms.",
        "source": "T08n0222_001:0154a16_65"
    },
    {
        "source_sentence": "不與過去色諍，亦不見當來色；",
        "translation": "They do not dispute past forms and do not see future forms.",
        "source": "T08n0222_001:0154a17_66"
    },
    {
        "source_sentence": "不與當來色諍，亦不見現在色；",
        "translation": "They do not coexist with form in the future and do not see form in the present.",
        "source": "T08n0222_001:0154a18_67"
    },
    {
        "source_sentence": "不與現在色諍，亦不與過去痛痒思想生死識諍，亦不與當來現在痛痒思想生死識諍，",
        "translation": "He doesn’t argue with the consciousness of form in the present and doesn’t argue with the consciousness of pain, itch, thought, and birth-and-death in the past. Nor does he argue with the consciousness of pain, itch, thought, and birth-and-death in the future.",
        "source": "T08n0222_001:0154a19_68"
    },
    {
        "source_sentence": "亦不見過去當來現在痛痒思想生死識。",
        "translation": "They also don't see the consciousness of pain, itch, thought, birth-and-death in the past, future, and present.",
        "source": "T08n0222_001:0154a21_69"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154a22_70"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不與過去當來諍，不與當來過去諍，不與現在過去當來諍，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they don’t argue with the past and future; they don’t argue with the past and future; they don’t argue with the present and future.",
        "source": "T08n0222_001:0154a22_71"
    },
    {
        "source_sentence": "不與過去當來現在諍，不見三世與於空行般若波羅蜜，如是行者此乃為行。",
        "translation": "He doesn't see the three times and practices prajñā-pāramitā with emptiness in the past, future, and present, and thus practices this as practice.",
        "source": "T08n0222_001:0154a24_72"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154a26_73"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，所行如是，如所應行，不與過去薩芸若訟行，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they do so as should be done; they don’t engage in disputes or controversies with the practitioners of the past.",
        "source": "T08n0222_001:0154a26_74"
    },
    {
        "source_sentence": "亦不見過去何所薩芸若，過去安有薩芸若及行訟行？",
        "translation": "They also don't see what saṃjñāyas were in the past, and how could there be saṃjñāyas and practices and disputes in the past?",
        "source": "T08n0222_001:0154a28_75"
    },
    {
        "source_sentence": "不與當來薩芸若訟行，亦無所行，亦不見當來安有薩芸若與行訟行乎？",
        "translation": "They won't engage in arguments with the future saṃyuktâgama, and they won't engage in anything, so don't they see that there will be a debate between the saṃyuktâgama and the practitioner in the future?",
        "source": "T08n0222_001:0154a29_76"
    },
    {
        "source_sentence": "亦不與現在薩芸若訟行，亦不見現在薩芸若，安有薩芸若訟行乎？",
        "translation": "Nor does he argue with the present saṃyuktâgama, nor doesn't he see the present saṃyuktâgama, so how could there be a saṃyuktâgama to argue with?",
        "source": "T08n0222_001:0154b02_77"
    },
    {
        "source_sentence": "行般若波羅蜜如是者，此乃為行。",
        "translation": "If someone practices the perfection of wisdom like this, this is their practice.",
        "source": "T08n0222_001:0154b03_78"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154b04_79"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不行薩芸若色，亦不見薩芸若色，亦不見行薩芸若色痛痒思想生死識，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they don’t practice the form of saṃyuktâgama; they don’t see the form of saṃyuktâgama; they don’t see the form of saṃyuktâgama; they don’t see the form of saṃyuktâgama; they don’t see the form of saṃyuktâgama",
        "source": "T08n0222_001:0154b04_80"
    },
    {
        "source_sentence": "亦不見薩芸若痛痒思想生死識。",
        "translation": "They also don't see the consciousness of birth-and-death in the formless realm as painful and itchy thoughts.",
        "source": "T08n0222_001:0154b07_0"
    },
    {
        "source_sentence": "不行薩芸若眼，亦不見眼，亦不行薩芸若耳鼻舌身心，亦不見耳鼻舌身心。",
        "translation": "They don't practice the eye of the saṃyuktâgama, and they don't see the eye; they don't practice the ear, nose, nose, tongue, body, and mind of the saṃyuktâgama, and they don't see the ear, nose, nose, tongue, or body.",
        "source": "T08n0222_001:0154b07_1"
    },
    {
        "source_sentence": "不行薩芸若色，亦不見色。",
        "translation": "They don't practice the form of sarvajña, and they don't see form.",
        "source": "T08n0222_001:0154b09_2"
    },
    {
        "source_sentence": "不見色，不行薩芸若聲香味細滑所欲法，亦無所現。」",
        "translation": "They don't see form and don't practice the sounds, smells, tastes, subtleties, and desires of the saṃyuktâgama, nor do they show anything.",
        "source": "T08n0222_001:0154b10_3"
    },
    {
        "source_sentence": "佛語舍利弗：「行般若波羅蜜能如是者，此乃應行。",
        "translation": "The Buddha said to Śāriputra, If someone can practice the perfection of prajñāpāramitā like this, they should do so.",
        "source": "T08n0222_001:0154b11_4"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154b12_5"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，亦不遵薩芸若檀波羅蜜，亦不見檀波羅蜜，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they don’t follow the perfection of generosity or the perfection of giving, and they don’t see the perfection of giving.",
        "source": "T08n0222_001:0154b13_6"
    },
    {
        "source_sentence": "尸波羅蜜、羼波羅蜜、惟逮波羅蜜、禪波羅蜜、般若波羅蜜，亦復如是，",
        "translation": "So it is with the perfection of morality, the perfection of patience, the perfection of self-control, the perfection of meditation, and the perfection of wisdom.",
        "source": "T08n0222_001:0154b14_7"
    },
    {
        "source_sentence": "亦不行薩芸若般若波羅蜜，亦不見薩芸若般若波羅蜜；",
        "translation": "Nor do they practice the transcendent ways of knowledge and wisdom, nor do they see the transcendent ways of knowledge and wisdom.",
        "source": "T08n0222_001:0154b16_8"
    },
    {
        "source_sentence": "亦不遵薩芸若四意止，亦不見薩芸若四意止，亦不遵薩芸若四意斷、四神足、五根、五力、七覺意、八由行，",
        "translation": "Nor does he rely on the four mental commands of the saṃyuktâgama, nor do he see the four mental commands of the saṃyuktâgama. Nor does he rely on the four mental commands of the saṃyuktâgama to stop it. Nor does he rely on the four mental commands of the saṃyuktâgama to stop it. Nor does he rely on the",
        "source": "T08n0222_001:0154b17_9"
    },
    {
        "source_sentence": "亦不見薩芸若意止、意斷、神足、根、力、覺意、由行；",
        "translation": "They also do not see the essence of all enlightening beings, or their mental states; they do not see the cessation of thought, or the discontinuity of thought, or the spiritual legs, or the faculties, or the powers, or the thoughts and actions of enlightenment.",
        "source": "T08n0222_001:0154b19_10"
    },
    {
        "source_sentence": "亦不遵薩芸若十種力、四無所畏、四分別辯、十八不共諸佛之法，亦無所見，",
        "translation": "Nor does he follow the ten powers of the saṃyuktâgama, the four fearlessnesses, the four kinds of discriminating eloquence, or the eighteen unique qualities of buddhas, nor does he see anything.",
        "source": "T08n0222_001:0154b20_11"
    },
    {
        "source_sentence": "亦不見薩芸若怛薩阿竭諸力法。",
        "translation": "They also don't see the powers of the saṃyuktâgama-kṣāgata.",
        "source": "T08n0222_001:0154b22_12"
    },
    {
        "source_sentence": "行般若波羅蜜如是，此乃為行。",
        "translation": "To practice the perfection of prajñāpāramitā like this is to practice it.",
        "source": "T08n0222_001:0154b23_13"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154b24_14"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不行薩芸若、佛，佛亦不行薩芸若，不行薩芸若、道，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they don’t practice saṃyuktâgama or buddha; neither do buddhas practice saṃyuktâgama or the path.",
        "source": "T08n0222_001:0154b24_15"
    },
    {
        "source_sentence": "道亦不行薩芸若。",
        "translation": "The path doesn't practice the saṃjñāpāramitā either.",
        "source": "T08n0222_001:0154b26_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0154b26_17"
    },
    {
        "source_sentence": "佛則薩芸若，薩芸若則佛；",
        "translation": "A buddha is a saṃyuktâgama, and a saṃyuktâgama is a buddha.",
        "source": "T08n0222_001:0154b26_18"
    },
    {
        "source_sentence": "道則薩芸若，薩芸若則道。",
        "translation": "The path is the saṃyuktâgama, and the saṃyuktâgama is the path.",
        "source": "T08n0222_001:0154b27_19"
    },
    {
        "source_sentence": "十種力、四無所畏、四分別辯、十八不共諸佛之法，亦復如是。」",
        "translation": "So it is with the ten kinds of powers, four fearlessnesses, four distinctive abilities, and 18 unique qualities of the buddhas.",
        "source": "T08n0222_001:0154b28_20"
    },
    {
        "source_sentence": "佛語舍利弗：「行般若波羅蜜能如是者，此乃為行。",
        "translation": "The Buddha said to Śāriputra, If someone who practices prajñā-pāramitā can do so, this is their practice.",
        "source": "T08n0222_001:0154b29_21"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154c01_22"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不行色有、不行色無有，不行痛痒思想生死識有、不行痛痒思想生死識無有，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they don’t accept the existence or nonexistence of form and don’t accept the existence of formlessness; they don’t accept the existence of birth and death as consciousness in thoughts of pain and itch and don’t accept the existence of birth and death as consciousness in thoughts of pain",
        "source": "T08n0222_001:0154c02_0"
    },
    {
        "source_sentence": "不計色有常、亦不計色無常，不計色苦、不計色樂，不計色有我、不計色無我，",
        "translation": "They don’t think form is permanent, and they don’t think form is impermanent; they don’t think form is painful or pleasant; they don’t think form has self or form is without self.",
        "source": "T08n0222_001:0154c04_1"
    },
    {
        "source_sentence": "五陰六衰亦復如是。",
        "translation": "The five aggregates and six decays are likewise.",
        "source": "T08n0222_001:0154c06_2"
    },
    {
        "source_sentence": "不計五陰空、無空，不計五陰有相、無相，不計五陰有願、無願，行般若波羅蜜。",
        "translation": "They don't conceptualize the five aggregates as empty and nonempty, don't conceptualize the five aggregates as having marks or no marks, and don't conceptualize the five aggregates as having vows or wishlessness, and practice the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0154c06_3"
    },
    {
        "source_sentence": "今我所行亦無所受，亦無所行亦無所取，不有所行亦不不行，不有所受亦不不受，",
        "translation": "Whatever the self does now, there’s nothing to receive, and whatever it does, and nothing to grasp. It has neither action nor non-action, and neither feeling nor non-acting.",
        "source": "T08n0222_001:0154c08_4"
    },
    {
        "source_sentence": "不有所取亦不不取。」",
        "translation": "What's not grasped and what's not grasped.",
        "source": "T08n0222_001:0154c10_5"
    },
    {
        "source_sentence": "佛語舍利弗：「菩薩摩訶薩行般若波羅蜜能如是者，此乃為行。",
        "translation": "The Buddha said to Śāriputra, This is the practice of a bodhisattva Mahāsattva who practices prajñāpāramitā and can do so.",
        "source": "T08n0222_001:0154c10_6"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154c12_7"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不用檀波羅蜜、尸波羅蜜、羼提波羅蜜、惟逮波羅蜜、禪波羅蜜故，",
        "translation": "It's because the bodhisattva Mahāsattva practices the perfection of prajñā and doesn't use the perfection of giving, the perfection of śīla-pāramitā, the perfection of kṣatriya, the perfection of vibhāramit, the perfection of pāramitā, or the perfection of meditation.",
        "source": "T08n0222_001:0154c12_8"
    },
    {
        "source_sentence": "行般若波羅蜜。",
        "translation": "He practices the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0154c14_9"
    },
    {
        "source_sentence": "不用阿惟越致地，教化眾生故，行般若波羅蜜。",
        "translation": "He doesn't practice the perfection of prajñāpāramitā because he doesn't use the stage of abhidharma to teach sentient beings.",
        "source": "T08n0222_001:0154c15_10"
    },
    {
        "source_sentence": "不用淨佛國土故，行般若波羅蜜。",
        "translation": "They don't practice the perfection of prajñā because they don't need to purify the Buddha's land.",
        "source": "T08n0222_001:0154c16_11"
    },
    {
        "source_sentence": "不用怛薩阿竭十力故，行般若波羅蜜。",
        "translation": "Because they don't use the ten powers of the tathāgata, they practice prajñāpāramitā.",
        "source": "T08n0222_001:0154c17_0"
    },
    {
        "source_sentence": "不用四無所畏、四分別辯、十八不共諸佛之法，行般若波羅蜜。",
        "translation": "They don't need the four fearlessnesses, four discriminating eloquence, and 18 distinctive qualities of the buddhas to practice the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0154c17_1"
    },
    {
        "source_sentence": "不究竟空、不用內空、不用外空、不用內外空、不用空空故，不用大空故，",
        "translation": "It's because they don't ultimately use emptiness, don't use internal emptiness, don't use external emptiness, don't use internal and external emptiness, and don't use emptiness or emptiness because they don't use great emptiness.",
        "source": "T08n0222_001:0154c19_2"
    },
    {
        "source_sentence": "不用真空故，不用有為空故，不用無為空故，不用究竟空故，不用無品空故，",
        "translation": "Because they do not rely on the emptiness of voidness, because they do not rely on the emptiness of conditioned things, because they do not rely on the emptiness of unconditioned things, because they do not rely on the ultimate emptiness, and because they do not rely on the emptiness of qualities.",
        "source": "T08n0222_001:0154c21_0"
    },
    {
        "source_sentence": "不用本淨空故，不用自然相空故，不以一切法空故，不以無起空故，不以無滅空故，",
        "translation": "They don’t rely on the emptiness of original purity because they don’t rely on the emptiness of natural characteristics, because they don’t rely on the emptiness of all things, because they don’t rely on the emptiness of nonarising, and because they don’t rely on the emptiness of noncess.",
        "source": "T08n0222_001:0154c22_1"
    },
    {
        "source_sentence": "不以無形空故，不以自然空故，不以有形無形空故，不無本故，不以法界故，",
        "translation": "It’s not because formlessness is emptiness, it’s not because spontaneous emptiness is emptiness, it’s not because form and formlessness are emptiness, it’s not because of the absence of a basis, it’s not because of the realm of reality.",
        "source": "T08n0222_001:0154c24_2"
    },
    {
        "source_sentence": "不以本際故，行般若波羅蜜。",
        "translation": "They don't practice the perfection of prajñā because of their original limits.",
        "source": "T08n0222_001:0154c26_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0154c27_4"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，於諸法無所破壞亦無所見。」",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñā, they don't break anything in the Dharma and don't see anything.",
        "source": "T08n0222_001:0154c27_5"
    },
    {
        "source_sentence": "復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0154c28_6"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不用神足故，行般若波羅蜜；",
        "translation": "“Great enlightening beings practice the transcendent wisdom because they don’t need spiritual feet to do so.",
        "source": "T08n0222_001:0154c29_7"
    },
    {
        "source_sentence": "不用天眼故，不用天耳故，不用觀他人心故，不用念過去事故。",
        "translation": "It's because they don't use the divine eye, don't use the divine ear, don't observe the minds of others, and don't need to remember past events.",
        "source": "T08n0222_001:0155a01_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155a03_0"
    },
    {
        "source_sentence": "行般若波羅蜜時，亦不見般若波羅蜜，何況當覩菩薩諸神通乎？",
        "translation": "When he practices the perfection of prajñā, he doesn't see the perfection of prajñā, so why wouldn't he see the bodhisattvas' supernormal abilities?",
        "source": "T08n0222_001:0155a03_1"
    },
    {
        "source_sentence": "行般若波羅蜜能如是者，此乃應行。",
        "translation": "If someone who practices the prajñāpāramitā can do so, this should be done.",
        "source": "T08n0222_001:0155a04_2"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155a05_3"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，心不念言：『我當以神足往詣東方江河沙等見諸如來稽首禮。』",
        "translation": "When the bodhisattva Mahāsattva practices the perfection of prajñā, his mind isn't mindful, saying, 'With my spiritual feet, I will go east to see the Tathāgatas with rivers and sands in the east and pay homage to them.'",
        "source": "T08n0222_001:0155a05_4"
    },
    {
        "source_sentence": "亦不自念：『到八方上下。』",
        "translation": "Nor does he think to himself, 'Up and down in the eight directions.'",
        "source": "T08n0222_001:0155a08_0"
    },
    {
        "source_sentence": "亦復如是，等無有異。",
        "translation": "The same applies equally, without difference.",
        "source": "T08n0222_001:0155a08_1"
    },
    {
        "source_sentence": "行般若波羅蜜能如是者，此乃應行。",
        "translation": "If someone who practices the prajñāpāramitā can do so, this should be done.",
        "source": "T08n0222_001:0155a09_0"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155a09_1"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不自念言：『諸佛世尊所可暢說，吾則當以天耳皆聽，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they do not think to themselves, ‘If the buddhas and world-honored ones were to speak eloquently, I would listen with my divine ears.",
        "source": "T08n0222_001:0155a10_2"
    },
    {
        "source_sentence": "吾當察見眾生之心所可念者，當念過去所遊居處，我以天眼見諸群萌在所之處。』」",
        "translation": "I will examine what sentient beings can think of in their minds and remember where they've traveled and lived in the past, and with my divine eye, I'll see where all the groups are growing up.'",
        "source": "T08n0222_001:0155a11_3"
    },
    {
        "source_sentence": "佛言：「行般若波羅蜜能如是者，此乃應行。",
        "translation": "The Buddha said, If someone who practices prajñā-pāramitā can do so, this should be done.",
        "source": "T08n0222_001:0155a13_4"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0222_001:0155a14_5"
    },
    {
        "source_sentence": "行如是者，則為度脫無央數不可計會眾生之類。",
        "translation": "Those who practice like this are liberated from measureless and incalculable numbers of sentient beings.",
        "source": "T08n0222_001:0155a15_6"
    },
    {
        "source_sentence": "菩薩摩訶薩能如是者，魔及官屬不能得便。",
        "translation": "If the bodhisattva Mahāsattva can do so, Māra and his officials won't be able to get an advantage.",
        "source": "T08n0222_001:0155a16_7"
    },
    {
        "source_sentence": "又復見及他方世界，諸人民遙聞其德皆為作禮。",
        "translation": "They also saw other worlds as well, and the people who heard their virtues from afar paid homage to them.",
        "source": "T08n0222_001:0155a17_8"
    },
    {
        "source_sentence": "復次，東方江河沙等諸佛世界，八方上下諸佛世尊，皆共擁護於是菩薩，",
        "translation": "“Furthermore, to the east were buddha-fields as numerous as the grains of sand in rivers and streams in the eastern directions. The buddhas of the eight directions and the world-honored ones above and below them all protected these enlightening beings.",
        "source": "T08n0222_001:0155a18_9"
    },
    {
        "source_sentence": "終不墮墜於聲聞、辟支佛地。",
        "translation": "They'll never fall into the stages of śrāvakas and pratyekbuddhas.",
        "source": "T08n0222_001:0155a20_10"
    },
    {
        "source_sentence": "四天王上至阿迦膩吒天，悉共擁護是菩薩摩訶薩，將無伺求得其便者，",
        "translation": "From the four heavenly kings up to the Akaniṣṭha gods, they all embraced this bodhisattva Mahāsattva, and there was no one who would ask for an advantage.",
        "source": "T08n0222_001:0155a20_11"
    },
    {
        "source_sentence": "所可興發、所當作者，得現在福。",
        "translation": "What's produced and what's created will attain present merit.",
        "source": "T08n0222_001:0155a22_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155a23_13"
    },
    {
        "source_sentence": "而以慈心向諸眾生。",
        "translation": "Instead, he directs his compassion toward sentient beings.",
        "source": "T08n0222_001:0155a23_14"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0222_001:0155a24_0"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜能如是者，乃為應行。",
        "translation": "If bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom can do so, then they should practice it.",
        "source": "T08n0222_001:0155a24_1"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155a25_2"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，而以微勞得總持門、三昧門，速疾近此怛薩阿竭、阿羅呵、三耶三菩，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they attain the mastery of concentration through effortlessly attaining the state of absorption called ‘samyak-saṃbodhi’ and quickly approach this buddha-samyak-saṃbodhi.",
        "source": "T08n0222_001:0155a25_3"
    },
    {
        "source_sentence": "一切所生常值見佛、不離諸佛，至逮成阿耨多羅三耶三佛。」",
        "translation": "All sentient beings always see buddhas and don't part from the buddhas until they become unsurpassed, correct, and complete buddhas.",
        "source": "T08n0222_001:0155a27_4"
    },
    {
        "source_sentence": "佛言：「行般若波羅蜜能如是者，乃為應行。",
        "translation": "The Buddha said, If someone who practices the perfection of wisdom can do so, then they should practice it.",
        "source": "T08n0222_001:0155a29_5"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155b01_6"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不自念言：『寧有諸法？",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of prajñā, they don't think to themselves, 'How could there be dharmas?'",
        "source": "T08n0222_001:0155b01_7"
    },
    {
        "source_sentence": "所謂法者一切為應、若不應乎？",
        "translation": "What's called a dharma that responds to all things and doesn't respond to them?",
        "source": "T08n0222_001:0155b02_8"
    },
    {
        "source_sentence": "為平等、不平等乎？』",
        "translation": "Is it equal or unequal?'",
        "source": "T08n0222_001:0155b03_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155b03_10"
    },
    {
        "source_sentence": "於時行者，不見諸法應若不應、行若不行、等與不等。」",
        "translation": "Those who practice at the time don't see what should or shouldn't be done, what doesn't practice and what doesn't practice, and what's equal and unequal.",
        "source": "T08n0222_001:0155b04_11"
    },
    {
        "source_sentence": "佛言：「行般若波羅蜜能如是者，乃為應行。",
        "translation": "The Buddha said, If someone who practices the perfection of wisdom can do so, then they should practice it.",
        "source": "T08n0222_001:0155b05_12"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155b06_13"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不自念言：『我當速解諸法之界至阿惟三佛，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they do not think to themselves, ‘I should quickly liberate myself from the realm of dharmas and attain unexcelled buddhahood.",
        "source": "T08n0222_001:0155b06_14"
    },
    {
        "source_sentence": "亦無阿惟三佛。』",
        "translation": "Nor are there the abhisaṃbuddhas.'",
        "source": "T08n0222_001:0155b08_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155b08_16"
    },
    {
        "source_sentence": "逮法界者亦無所覺。",
        "translation": "Those who have attained the Dharma realm also don't perceive anything.",
        "source": "T08n0222_001:0155b08_17"
    },
    {
        "source_sentence": "行般若波羅蜜能如是者，乃為應行。",
        "translation": "If someone who practices the perfection of prajñā can do so, then they should practice it.",
        "source": "T08n0222_001:0155b09_18"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155b10_19"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不見諸法及與法界有諸疾病及與空寂。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of prajñāpāramitā, they don't see that there are illnesses and emptiness in the Dharma realm and the Dharma realm as sickness or quiescence.",
        "source": "T08n0222_001:0155b10_20"
    },
    {
        "source_sentence": "行般若波羅蜜能如是者，乃為應行。",
        "translation": "If someone who practices the perfection of prajñā can do so, then they should practice it.",
        "source": "T08n0222_001:0155b11_21"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155b12_22"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不自念言：『諸法法界有若干種不計別異。』",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they don't think to themselves, 'There are certain kinds of dharmas in the Dharma realm that aren't discriminated.'",
        "source": "T08n0222_001:0155b13_23"
    },
    {
        "source_sentence": "行般若波羅蜜能如是者，此能應行。",
        "translation": "If someone who practices the perfection of prajñā can do so, this is what they should practice.",
        "source": "T08n0222_001:0155b14_24"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155b15_25"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不自念言：『於是諸法及與法界，觀與不觀、見與不見。』",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom, they don't think to themselves, 'Thus, these things and the Dharma realm are observed and not observed, seen and not seen.'",
        "source": "T08n0222_001:0155b15_26"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155b17_27"
    },
    {
        "source_sentence": "彼則不見諸法所有、可持諸法分別觀也。",
        "translation": "They then don't see the distinctive contemplation of all dharmas that exist and can be maintained as dharmas.",
        "source": "T08n0222_001:0155b17_28"
    },
    {
        "source_sentence": "行般若波羅蜜能如是，乃為應行。",
        "translation": "If someone who practices the perfection of wisdom can do so, then they should practice it.",
        "source": "T08n0222_001:0155b18_29"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155b19_30"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不念法界憂行空事，其空事者不憂法界。",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners of the perfection of prajñā, they don't think about the Dharma realm and grieve for emptiness when they practice it, and those who practice emptiness don't grieve for the Dharma realm.",
        "source": "T08n0222_001:0155b20_0"
    },
    {
        "source_sentence": "行般若波羅蜜能如是者，乃為應行。",
        "translation": "If someone who practices the perfection of prajñā can do so, then they should practice it.",
        "source": "T08n0222_001:0155b21_1"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155b22_2"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，不念眼界為空空乎，亦不憂眼界；",
        "translation": "“When great enlightening beings practice the transcendent wisdom they do not think of the eye realm as emptiness or voidness, nor do they grieve for the eye realm.",
        "source": "T08n0222_001:0155b22_3"
    },
    {
        "source_sentence": "色不憂空，空不憂色；",
        "translation": "Form doesn’t grieve over emptiness, and emptiness doesn’t grieve over form.",
        "source": "T08n0222_001:0155b24_4"
    },
    {
        "source_sentence": "色界不憂空，空界不憂色；",
        "translation": "The realm of form is without sorrow regarding emptiness; the realm of emptiness is without sorrow regarding matter.",
        "source": "T08n0222_001:0155b24_5"
    },
    {
        "source_sentence": "眼識界不憂空，識界不憂眼識空；",
        "translation": "The element consciousness of the eye is not concerned about emptiness, while the element consciousness is not concerned about the emptiness of the eye and consciousness.",
        "source": "T08n0222_001:0155b25_6"
    },
    {
        "source_sentence": "耳鼻舌身心聲香味細滑所欲法亦如是。",
        "translation": "It's likewise with the desired dharmas of ear, nose, tongue, body, body, sound, odor, taste, subtlety, and smoothness.",
        "source": "T08n0222_001:0155b26_7"
    },
    {
        "source_sentence": "心界不憂空，空界不憂心；",
        "translation": "The element mind is not concerned with emptiness; the element emptiness is not concerned with awarenesses.",
        "source": "T08n0222_001:0155b27_8"
    },
    {
        "source_sentence": "法界不憂空，空界不憂法；",
        "translation": "The realm of dharmas does not grieve over emptiness; the realm of emptiness does not grieve over dharma.",
        "source": "T08n0222_001:0155b27_9"
    },
    {
        "source_sentence": "識界不憂空，空界不憂識。」",
        "translation": "The consciousness realm doesn't worry about emptiness, and the emptiness realm doesn't worry about consciousness.",
        "source": "T08n0222_001:0155b28_10"
    },
    {
        "source_sentence": "佛言：「舍利弗！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T08n0222_001:0155b29_0"
    },
    {
        "source_sentence": "是為第一行，所謂空行。",
        "translation": "This is the first practice, which is called the practice of emptiness.",
        "source": "T08n0222_001:0155b29_1"
    },
    {
        "source_sentence": "菩薩摩訶薩能行空者，則不墮落聲聞、辟支佛地，能淨佛國、開化眾生，",
        "translation": "“When great enlightening beings can practice emptiness, they won’t fall into the stages of śrāvakas or pratyekabuddhas but can purify the buddha-lands and enlighten sentient beings.",
        "source": "T08n0222_001:0155b29_2"
    },
    {
        "source_sentence": "疾逮阿耨多羅三耶三菩，成阿惟三佛。",
        "translation": "He quickly attained the unsurpassed, correct enlightenment and became an abhisaṃbuddha.",
        "source": "T08n0222_001:0155c02_3"
    },
    {
        "source_sentence": "計諸所行般若波羅蜜行，般若波羅蜜行為最極尊、為長為上、無底無比。",
        "translation": "They conceptualize the practice of prajñā-pāramitā that's practiced, saying that the practice of prajñā-pāramitā is the most supreme, longest, highest, and peerless.",
        "source": "T08n0222_001:0155c03_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155c05_5"
    },
    {
        "source_sentence": "般若波羅蜜行為無上行，空、無相、無願行。",
        "translation": "The practice of prajñāpāramitā is the unsurpassed practice, which is the practice of emptiness, signlessness, and wishlessness.",
        "source": "T08n0222_001:0155c05_6"
    },
    {
        "source_sentence": "菩薩摩訶薩應行如是，當作斯持，速得近於受莂之地。",
        "translation": "Such is how the bodhisattva Mahāsattva should conduct himself, thus maintaining it so quickly that he can get close to the place where he's being tormented.",
        "source": "T08n0222_001:0155c06_7"
    },
    {
        "source_sentence": "菩薩摩訶薩應此行者，為無數不可計眾生開度利誼。",
        "translation": "The bodhisattva Mahāsattva who responds to this practice opens up benefits for countless and incalculable sentient beings.",
        "source": "T08n0222_001:0155c07_8"
    },
    {
        "source_sentence": "若不念言：『我行般若波羅蜜，諸佛世尊當受決也。』",
        "translation": "If they don't think, 'I'll practice the perfection of wisdom, and the Bhagavān will be judged by the buddhas.'",
        "source": "T08n0222_001:0155c08_9"
    },
    {
        "source_sentence": "亦不念言：『我得親近也；",
        "translation": "Nor do they think, “I am able to become intimate with them.",
        "source": "T08n0222_001:0155c10_0"
    },
    {
        "source_sentence": "於受決也；",
        "translation": "In receiving a ruling, it is likewise.",
        "source": "T08n0222_001:0155c10_1"
    },
    {
        "source_sentence": "我當清淨於佛國土，得至阿耨多羅三耶三菩阿惟三佛，當轉法輪。』",
        "translation": "I will purify the Buddha's land and attain the unsurpassed, correct, and complete enlightenment, and I will turn the Dharma wheel.'",
        "source": "T08n0222_001:0155c10_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155c12_3"
    },
    {
        "source_sentence": "彼其行者，不著法界，亦不虛寂、不見異法，當行般若波羅蜜，諸佛天中天受我決及逮阿耨多羅三耶三菩阿惟三佛。",
        "translation": "Those who practice it won't be attached to the Dharma realm, won't be falsely silent, won't see different dharmas, and will practice the perfection of prajñāpāramitā, where the gods in the buddha-heaven receive self-determination and acquire the unsurpassed, correct, and perfect enlightenment.",
        "source": "T08n0222_001:0155c12_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155c15_5"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜者，不起人想，不起我想，不起壽想，不起命想，",
        "translation": "“When great enlightening beings practice prajñā-pāramitā, they don’t give rise to thoughts of person, self, life, or life.",
        "source": "T08n0222_001:0155c15_6"
    },
    {
        "source_sentence": "不起眾諸想，不起見知想。",
        "translation": "They don't give rise to all kinds of perceptions and don't give rise to perceptions of views and knowing.",
        "source": "T08n0222_001:0155c17_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T08n0222_001:0155c17_8"
    },
    {
        "source_sentence": "計於吾我眾生不起不滅，又計人本不起不滅。",
        "translation": "They impute that self and sentient beings don't arise and don't cease, and they impute that people originally don't arise and don't cease.",
        "source": "T08n0222_001:0155c18_9"
    },
    {
        "source_sentence": "其不起不滅者，何所行般若波羅蜜？",
        "translation": "If they don't arise and don't cease, what is the prajñāpāramitā that they practice?",
        "source": "T08n0222_001:0155c19_10"
    },
    {
        "source_sentence": "菩薩摩訶薩行能如是，人無所起屬行般若波羅蜜，眾生為空、眾生不得、眾生寂寞，",
        "translation": "When bodhisattvas, mahāsattvas, and practitioners can do so, nothing is produced by people who practice the perfection of wisdom, sentient beings become empty, sentient beings don't attain it, and sentient beings are lonely.",
        "source": "T08n0222_001:0155c20_11"
    },
    {
        "source_sentence": "為行般若波羅蜜。",
        "translation": "It's to practice the perfection of prajñāpāramitā.",
        "source": "T08n0222_001:0155c22_12"
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "So it is, Śāriputra!",
        "source": "T08n0222_001:0155c22_13"
    },
    {
        "source_sentence": "菩薩摩訶薩遵修於空為第一行。",
        "translation": "The bodhisattva Mahāsattva follows and cultivates emptiness as the first practice.",
        "source": "T08n0222_001:0155c22_14"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T08n0222_001:0155c23_15"
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜能如是者，則皆超踰一切諸行。",
        "translation": "If bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom can do so, they'll all transcend all practices.",
        "source": "T08n0222_001:0155c23_16"
    },
    {
        "source_sentence": "置是所可遵行，為大慈行、為大悲行。",
        "translation": "It's a great act of kindness and great compassion that can be practiced.",
        "source": "T08n0222_001:0155c25_17"
    },
    {
        "source_sentence": "菩薩摩訶薩行於此者，終不起貪嫉之心，無毀戒心、無瞋恚心、無懈怠心、無亂意心、無邪智心。」",
        "translation": "When bodhisattvas and mahāsattvas practice this, they never become greedy or jealous, have no thoughts of disparaging precepts, no thoughts of anger, no thoughts of laziness, no thoughts of confusion, and no thoughts of wrong wisdom.",
        "source": "T08n0222_001:0155c26_18"
    },
    {
        "source_sentence": "◎光讚經卷第一",
        "translation": "Guangzan jing, vol. 1",
        "source": "T08n0222_001:0155c28_19"
    }
]