[
    {
        "source_sentence": "金剛頂瑜伽理趣般若經",
        "translation": "Vajraśekhara-sūtra",
        "source": "T08n0241_001:0778b19_0"
    },
    {
        "source_sentence": "唐南天竺三藏金剛智依梵本於中天譯如是我聞：一時薄伽梵妙善成就如來金剛住持平等性智、種種希有殊勝功德，",
        "translation": "Thus have I heard. “Thus have I heard.” At one time the Buddha was staying at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s Park, intending to see the buddha-field of the enlightened:",
        "source": "T08n0241_001:0778b21_0"
    },
    {
        "source_sentence": "已能善護一切如來無上法王灌頂寶冠，過三界；",
        "translation": "They had already been able to skillfully protect the jeweled crown of coronation of all buddhas, the supreme spiritual sovereigns of enlightened ones.",
        "source": "T08n0241_001:0778b23_1"
    },
    {
        "source_sentence": "已能善得一切如來遍金剛智，摩訶瑜伽自在無礙，決定清淨一切如來妙法智；",
        "translation": "“Great enlightening beings have already well attained the adamantine knowledge pervading all buddhas, their great yoga unimpeded and unobstructed, certain to purify the mystic knowledge of principles of all buddhas.",
        "source": "T08n0241_001:0778b24_2"
    },
    {
        "source_sentence": "已善圓證一切如來畢竟空寂平等性印，所作事業皆得善巧成辦，餘一切有情種種希願，",
        "translation": "Having well perfected the sign of the equality of all buddhas’ ultimate emptiness and quiescence, they attain skillful accomplishment of all their undertakings. All the other sentient beings have various wishes:",
        "source": "T08n0241_001:0778b26_3"
    },
    {
        "source_sentence": "隨其無罪皆能滿足；",
        "translation": "They are able to fulfill them according to their faultlessness.",
        "source": "T08n0241_001:0778b28_4"
    },
    {
        "source_sentence": "已善安住三世平等，常無斷盡廣大周遍身語心性，猶若金剛等諸如來無動無壞。",
        "translation": "They've well settled in the equality of the three times, always without interruption and vastly pervading the nature of body, speech, and mind, just like the adamantine and other tathāgatas are unmoving and indestructible.",
        "source": "T08n0241_001:0778b29_5"
    },
    {
        "source_sentence": "是薄伽梵住欲界頂他化自在天王宮中，一切如來常所遊處，咸共稱美大寶藏殿。",
        "translation": "The Bhagavān lives in the palace of the heavenly king Paranirmita-vaśavartin at the top of the realm of desire, where all the Tathāgatas always travel and praise the great jeweled treasury hall.",
        "source": "T08n0241_001:0778c02_6"
    },
    {
        "source_sentence": "其殿無價摩尼所成，種種珍奇間雜嚴飾，眾生交映放大光明，寶鐸金鈴處處懸列，",
        "translation": "The hall was made of priceless jewels, adorned with various rare and precious treasures. All the sentient beings reflected together to produce great rays of light. Jewel chimes and golden bells hung in rows everywhere.",
        "source": "T08n0241_001:0778c03_7"
    },
    {
        "source_sentence": "微風吹動出和雅音，綺蓋繒幡花幢綵拂，寶珠瓔珞半滿月等，種種雜飾而用莊嚴，",
        "translation": "A gentle breeze blows and produces a harmonious sound, draped with exquisite canopies, pennants, flower banners, jewel pearls, half-moon necklaces, and so on, variously embellished and adorned.",
        "source": "T08n0241_001:0778c05_8"
    },
    {
        "source_sentence": "賢聖天仙之所愛樂。",
        "translation": "It's loved by the good and noble gods and sages.",
        "source": "T08n0241_001:0778c07_9"
    },
    {
        "source_sentence": "與八十億大菩薩俱，一切皆具陀羅尼門、三摩地門、無礙妙辯，如是等類無量功德，",
        "translation": "He was accompanied by eighty billion great enlightening beings, all endowed with dhāraṇī teachings, samādhi teachings, unhindered marvelous eloquence, such kinds of immeasurable virtues.",
        "source": "T08n0241_001:0778c08_10"
    },
    {
        "source_sentence": "設經多劫讚不能盡。",
        "translation": "Even if they go through many eons, they won't be able to praise them all.",
        "source": "T08n0241_001:0778c10_11"
    },
    {
        "source_sentence": "其名曰：金剛手菩薩摩訶薩、觀自在菩薩摩訶薩、虛空庫菩薩摩訶薩、金剛拳菩薩摩訶薩、文殊師利菩薩摩訶薩、發心即轉法輪菩薩摩訶薩、虛空藏菩薩摩訶薩、降伏一切魔怨菩薩摩訶薩。",
        "translation": "They were called the Vajrapāṇi Bodhisattva Mahāsattva, the Avalokitêśvara Bodhisattva Mahāsattva, the Space Treasury Bodhisattva Mahāsattva, the Vajrapāṇi Bodhisattva Mahāsattva, the Mañjuśrī Bodhisattva Mahāsattva, the Dharma wheel-turning bodhisattva",
        "source": "T08n0241_001:0778c10_12"
    },
    {
        "source_sentence": "如是上首，有八十億大菩薩眾前後圍遶。",
        "translation": "Thus, the top of the mountain was surrounded by eighty billion great bodhisattvas in front and behind him.",
        "source": "T08n0241_001:0778c15_13"
    },
    {
        "source_sentence": "宣說正法，初中後善，文義巧妙，純一圓滿清白梵行。",
        "translation": "He preached the true teaching, which was good in the beginning, good in the middle, and good in the end, with subtle words and meanings, purely perfected in the pure religious practice of purity.",
        "source": "T08n0241_001:0778c16_14"
    },
    {
        "source_sentence": "爾時世尊，為諸菩薩說一切法自性清淨般若波羅蜜多理趣法門。",
        "translation": "It was then that the Bhagavān taught the bodhisattvas the Dharma aspect of the principle and destinies of the self-nature of all dharmas as pure prajñāpāramitā.",
        "source": "T08n0241_001:0778c18_0"
    },
    {
        "source_sentence": "此門即是菩薩句義。",
        "translation": "This approach is the meaning of the bodhisattva's phrase.",
        "source": "T08n0241_001:0778c19_1"
    },
    {
        "source_sentence": "云何名為菩薩句義？",
        "translation": "What's called the meaning of the bodhisattva's words?",
        "source": "T08n0241_001:0778c20_0"
    },
    {
        "source_sentence": "所謂：「極妙清淨句義是菩薩句義；",
        "translation": "The meaning of words that are extremely subtle and pure is the meaning of words for enlightening beings.",
        "source": "T08n0241_001:0778c20_1"
    },
    {
        "source_sentence": "諸見永寂清淨句義是菩薩句義；",
        "translation": "The meaning of the phrase that all views are eternally tranquil and pure is the meaning of the phrase enlightening being.",
        "source": "T08n0241_001:0778c21_2"
    },
    {
        "source_sentence": "微妙適悅清淨句義是菩薩句義；",
        "translation": "The meaning of subtle, pleasing, pure phrases is the meaning of enlightening beings’ phrases.",
        "source": "T08n0241_001:0778c22_3"
    },
    {
        "source_sentence": "渴愛永息清淨句義是菩薩句義；",
        "translation": "The meaning of the phrase purifying the eternal cessation of thirst and craving is the meaning of the phrase enlightening being.",
        "source": "T08n0241_001:0778c22_4"
    },
    {
        "source_sentence": "胎藏超越清淨句義是菩薩句義；",
        "translation": "The meaning of the phrase “the womb-store transcends purity” is the meaning of the bodhisattva’s phrase.",
        "source": "T08n0241_001:0778c23_5"
    },
    {
        "source_sentence": "眾德莊嚴清淨句義是菩薩句義；",
        "translation": "The meaning of the phrase “manifest arrays of myriad virtues are pure” is the meaning of the bodhisattva’s phrase.",
        "source": "T08n0241_001:0778c24_6"
    },
    {
        "source_sentence": "意極適悅清淨句義是菩薩句義；",
        "translation": "The meaning of words that are extremely pleasing to the mind and pure is the meaning of words for enlightening beings.",
        "source": "T08n0241_001:0778c25_7"
    },
    {
        "source_sentence": "意清淨句義是菩薩句義；",
        "translation": "The meaning of words that purify the mind is the meaning of words for enlightening beings.",
        "source": "T08n0241_001:0778c26_0"
    },
    {
        "source_sentence": "色清淨句義是菩薩句義；",
        "translation": "The meaning of the phrase “form is pure” is the meaning of the bodhisattva’s phrase.",
        "source": "T08n0241_001:0778c26_1"
    },
    {
        "source_sentence": "聲清淨句義是菩薩句義；",
        "translation": "The meaning of sound as pure is the meaning of a bodhisattva’s phrase.",
        "source": "T08n0241_001:0778c27_2"
    },
    {
        "source_sentence": "香清淨句義是菩薩句義；",
        "translation": "The meaning of ‘purity of fragrance’ is the meaning of ‘bodhisattva’.",
        "source": "T08n0241_001:0778c27_3"
    },
    {
        "source_sentence": "味清淨句義是菩薩句義；",
        "translation": "The meaning of the phrase “purity of flavor” is the meaning of the bodhisattva’s phrase.",
        "source": "T08n0241_001:0778c28_4"
    },
    {
        "source_sentence": "觸清淨句義是菩薩句義。",
        "translation": "The meaning of touching the pure phrase is the meaning of the bodhisattva's phrase.",
        "source": "T08n0241_001:0778c29_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0241_001:0778c29_6"
    },
    {
        "source_sentence": "乃至一切法自性清淨故。",
        "translation": "It's because the self-nature of all dharmas is pure.",
        "source": "T08n0241_001:0778c29_7"
    },
    {
        "source_sentence": "一切法自性清淨，即般若波羅蜜多最勝清淨。」",
        "translation": "The self-nature of all dharmas is pure, which is the most excellent purity of the prajñāpāramitā.",
        "source": "T08n0241_001:0779a01_8"
    },
    {
        "source_sentence": "佛說如是菩薩句義般若理趣清淨法已，告金剛手菩薩等言：「金剛手菩薩！",
        "translation": "After the Buddha taught such a bodhisattva the pure teaching of the principle and meaning of prajñā, he addressed the Vajrapāṇi Bodhisattva and others, saying, Vajrapāṇi Bodhisattva!",
        "source": "T08n0241_001:0779a02_9"
    },
    {
        "source_sentence": "若有得聞此一切法自性清淨般若波羅蜜多理趣法門，一經於耳，所有煩惱障業極重諸罪皆自消滅，",
        "translation": "If someone were to hear this teaching of the essential nature of all dharmas, the purity of prajñāpāramitā and the principles and destinies of these teachings, one scripture in their ear would extinguish for themselves all the afflictions, hindrances, karma, and extremely serious sins that are accompanied by defilements.",
        "source": "T08n0241_001:0779a04_10"
    },
    {
        "source_sentence": "乃至菩提，不生惡道。",
        "translation": "Up to enlightenment, they won't be born in a bad path.",
        "source": "T08n0241_001:0779a06_11"
    },
    {
        "source_sentence": "若能日日受持讀誦正念思惟，即於此生定得一切法平等性金剛三摩地。",
        "translation": "If someone can receive, recite, correctly recite, and contemplate it day after day, they'll attain the adamantine absorption of the equality of all dharmas in this concentration.",
        "source": "T08n0241_001:0779a07_12"
    },
    {
        "source_sentence": "經十六大菩薩生，定得如來執金剛性，疾證無上正等菩提。」",
        "translation": "When sixteen great bodhisattvas arise, they'll surely attain the adamantine nature of the Tathāgata's attachment and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0779a08_13"
    },
    {
        "source_sentence": "即說密語：「吽」爾時世尊，復依毘盧遮那如來之相，為諸菩薩說一切如來寂靜法性般若波羅蜜多甚深理趣現等覺門。",
        "translation": "He then spoke the esoteric saying, Om! At that point, the Bhagavān again relied on the Tathāgata's characteristics of Vairocana to teach all the bodhisattvas about the profound principles and destinies of the tranquil Dharma-nature prajñāpāramitā of all tathāgatas and the manifestation of the gate of virtual enlightenment based on",
        "source": "T08n0241_001:0779a10_14"
    },
    {
        "source_sentence": "所謂：「金剛平等成正覺，大菩提堅固性如金剛故；",
        "translation": "They are the equality of diamond in perfect enlightenment, because great enlightenment is as hard and strong as diamond.",
        "source": "T08n0241_001:0779a14_15"
    },
    {
        "source_sentence": "義平等成正覺，大菩提一義性故；",
        "translation": "They attain true awakening equal in meaning, because great enlightenment is one and the same in meaning.",
        "source": "T08n0241_001:0779a15_16"
    },
    {
        "source_sentence": "法平等成正覺，大菩提自性清淨故；",
        "translation": "The equality of all things leads to perfect enlightenment, because great enlightenment is inherently pure.",
        "source": "T08n0241_001:0779a16_17"
    },
    {
        "source_sentence": "一切業平等成正覺，大菩提離一切分別故。」",
        "translation": "All actions equally become perfectly enlightened, and great enlightenment is free of all distinctions.",
        "source": "T08n0241_001:0779a17_18"
    },
    {
        "source_sentence": "佛說如是法性門已，告金剛手菩薩言：「金剛手！",
        "translation": "After the Buddha had explained this teaching of the Dharma-nature aspect, he addressed the Vajrapāṇi Bodhisattva, saying, Vajrapāṇi!",
        "source": "T08n0241_001:0779a18_19"
    },
    {
        "source_sentence": "若有得聞此四種寂靜性成正覺般若波羅蜜多理趣現等覺門，信解受持讀誦正念思惟，",
        "translation": "If someone hears these four kinds of quiescence, becomes perfectly enlightened with the principle and aim of the prajñāpāramitā, they'll believe, understand, retain, recite, recite, correctly remember, and contemplate.",
        "source": "T08n0241_001:0779a19_20"
    },
    {
        "source_sentence": "則能超越一切惡道，疾證無上正等菩提。」",
        "translation": "Then they'll be able to transcend all bad destinies and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0779a21_21"
    },
    {
        "source_sentence": "復說密語：「闇(引)」爾時世尊，復依一切如來能調伏難調有情釋迦牟尼之相，",
        "translation": "Again, he spoke the esoteric saying, Darkness (citation needed.) At that point, the Bhagavān again relied on the characteristics of all the Tathāgatas who can subdue the unruly sentient beings in the form of Śākyamuni,",
        "source": "T08n0241_001:0779a22_22"
    },
    {
        "source_sentence": "為諸菩薩說一切法普勝平等般若波羅蜜多理趣法門。",
        "translation": "He teaches the Dharma aspect of the principle and destinies of the prajñāpāramitā of universal superiority and equality of all dharmas for bodhisattvas.",
        "source": "T08n0241_001:0779a25_23"
    },
    {
        "source_sentence": "所謂：「貪無戲論性；",
        "translation": "They are called craving without conceptual elaborations.",
        "source": "T08n0241_001:0779a26_24"
    },
    {
        "source_sentence": "瞋無戲論性；",
        "translation": "Anger is without conceptual elaborations.",
        "source": "T08n0241_001:0779a27_0"
    },
    {
        "source_sentence": "愛無戲論性。",
        "translation": "They love the absence of conceptual elaborations.",
        "source": "T08n0241_001:0779a27_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0241_001:0779a27_2"
    },
    {
        "source_sentence": "乃至一切無戲論性故。",
        "translation": "It's because all things lack the nature of conceptual elaboration.",
        "source": "T08n0241_001:0779a27_3"
    },
    {
        "source_sentence": "一切無戲論性，即般若波羅蜜多無戲論性。」",
        "translation": "All things lack the nature of conceptual elaboration, which means that the prajñāpāramitā has no conceptual elaboration.",
        "source": "T08n0241_001:0779a28_4"
    },
    {
        "source_sentence": "佛說如是調伏眾惡般若理趣普勝法已，告金剛手菩薩等言：「金剛手！",
        "translation": "After the Buddha taught this way to tame the principle and destinies of bad prajñāpāramitā, he addressed the Vajrapāṇi Bodhisattva and others, saying, Vajrapāṇi!",
        "source": "T08n0241_001:0779a29_5"
    },
    {
        "source_sentence": "若有得聞一切法普勝平等般若波羅蜜多理趣法門，信解受持讀誦正念思惟，",
        "translation": "If there's someone who hears the teaching of the principle and aim of the universally superior, impartial prajñāpāramitā of all things, believes, understands, retains, recites, correctly remembers, and contemplates it,",
        "source": "T08n0241_001:0779b01_6"
    },
    {
        "source_sentence": "假使殺害三界一切有情，終不因斯墮於惡道。",
        "translation": "Even if someone kills all sentient beings in the three realms, they'll never fall into a bad destiny because of it.",
        "source": "T08n0241_001:0779b03_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0241_001:0779b04_8"
    },
    {
        "source_sentence": "已受調伏心律儀故。",
        "translation": "It's because they've already received the discipline for taming the mind and observing the precepts.",
        "source": "T08n0241_001:0779b04_9"
    },
    {
        "source_sentence": "常生善趣，修菩提行，疾證無上正等菩提。」",
        "translation": "They'll always be born in a good destiny, cultivate the practice of enlightenment, and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0779b05_10"
    },
    {
        "source_sentence": "復說密語：「吽」爾時世尊，復依一切如來自性清淨相，為諸菩薩說一切法平等性觀自在智印般若波羅蜜多理趣法門。",
        "translation": "Again, he spoke the esoteric saying, Om! At that point, the Bhagavān again relied on the pure and pure characteristics of all the Tathāgatas to teach the bodhisattvas the equality of all dharmas for the sake of observing the principle-routing dharma-gate of the self-contained wisdom mudrā prajñāpāramitā",
        "source": "T08n0241_001:0779b06_11"
    },
    {
        "source_sentence": "所謂：「一切貪性清淨、瞋性清淨；",
        "translation": "The nature of all desires is purified, the nature of hatred is purified.",
        "source": "T08n0241_001:0779b10_12"
    },
    {
        "source_sentence": "一切貪性清淨故，一切垢性清淨、罪性清淨；",
        "translation": "Because the nature of all desires is purified, the nature of all defilements and the nature of sins are purified.",
        "source": "T08n0241_001:0779b11_13"
    },
    {
        "source_sentence": "一切垢性清淨、罪性清淨故，一切法性清淨、有情性清淨；",
        "translation": "Because the nature of all defilements is pure and the nature of sins is pure, the nature of all things is pure and the nature of sentient beings is pure.",
        "source": "T08n0241_001:0779b12_14"
    },
    {
        "source_sentence": "一切法性清淨、有情性清淨故，一切智性清淨；",
        "translation": "Because the essential nature of all things is pure and the essential nature of sentient beings is pure, the essential nature of omniscience is pure.",
        "source": "T08n0241_001:0779b13_15"
    },
    {
        "source_sentence": "一切智性清淨故，即般若波羅蜜多最勝清淨。」",
        "translation": "Because the nature of omniscience is purified, that's the most excellent purity of the prajñāpāramitā.",
        "source": "T08n0241_001:0779b14_16"
    },
    {
        "source_sentence": "佛說如是平等智印般若理趣清淨法已，告金剛手菩薩等言：「金剛手！",
        "translation": "After the Buddha taught this pure teaching of the principle and aim of the seal of equanimous wisdom, he addressed the Vajrapāṇi Bodhisattva and others, saying, Vajrapāṇi!",
        "source": "T08n0241_001:0779b15_17"
    },
    {
        "source_sentence": "若有聞此一切法平等觀自在智印般若波羅蜜多理趣法門，信解受持讀誦正念思惟，",
        "translation": "If there are those who hear this teaching of the principle and path of the equality of all dharmas, the self-contained wisdom mudrā prajñāpāramitā, which is to believe, understand, retain, recite, read, recite, correctly remember, and contemplate,",
        "source": "T08n0241_001:0779b17_18"
    },
    {
        "source_sentence": "雖在五欲塵中，不為客塵煩惱諸過所染，譬如蓮華雖在淤泥終不染著，",
        "translation": "Even though they are in the realm of desire, they aren’t stained by the defilements and passions of the objective world. It’s like a lotus flower that even though it’s in the mud, never becomes dirty or attached.",
        "source": "T08n0241_001:0779b19_19"
    },
    {
        "source_sentence": "乃至疾證無上正等菩提。」",
        "translation": "They'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0779b20_20"
    },
    {
        "source_sentence": "復說密語：「頡唎(二合、長聲)」爾時世尊，復依一切如來為三界之相，",
        "translation": "Again, he spoke the esoteric saying, Jīvaka (two combinations and long sounds). At that point, the Bhagavān again relied on all the tathāgatas as the characteristics of the three realms,",
        "source": "T08n0241_001:0779b21_21"
    },
    {
        "source_sentence": "為諸菩薩說一切如來灌頂出現智藏般若波羅蜜多理趣法門。",
        "translation": "For the sake of all bodhisattvas, he explains the principle and destinies of the Prajñāpāramitā of the manifestation of the wisdom store of all tathāgatas' consecrations.",
        "source": "T08n0241_001:0779b23_22"
    },
    {
        "source_sentence": "所謂：「灌頂施，令得一切三界法王位故；",
        "translation": "Their consecration is called giving, because it enables them to attain the throne of king of all truths in the three worlds.",
        "source": "T08n0241_001:0779b25_23"
    },
    {
        "source_sentence": "財寶施，令得一切所願滿足故；",
        "translation": "Giving of material goods and treasures enables them to attain the fulfillment of all their wishes.",
        "source": "T08n0241_001:0779b26_24"
    },
    {
        "source_sentence": "淨法施，令得一切法寶性故；",
        "translation": "Giving of the pure dharma, enabling one to attain the nature of all treasures of the Dharma.",
        "source": "T08n0241_001:0779b26_25"
    },
    {
        "source_sentence": "飲食施，令得一切身口意獲安樂故。」",
        "translation": "Giving food and drink causes them to attain peace of body, speech, and thought.",
        "source": "T08n0241_001:0779b27_26"
    },
    {
        "source_sentence": "佛說如是灌頂般若理趣智藏已，告金剛手菩薩等言：「若有得聞如是灌頂甚深理趣智藏法門，",
        "translation": "After the Buddha had taught this consecration of the store of knowledge of principle and path of wisdom, he addressed the Vajrapāṇi Bodhisattva and others, saying, If you can hear such a consecration of the Dharma teaching of the store of knowledge of principle and path of profound principle,",
        "source": "T08n0241_001:0779b28_27"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，速能滿足菩薩行，疾證無上正等菩提。」",
        "translation": "By believing, understanding, retaining, reciting, correctly remembering, and contemplating, they'll quickly fulfill the bodhisattva's practice and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0779c01_28"
    },
    {
        "source_sentence": "復說密語：「怛[口*藍](二合)」爾時世尊，復依一切如來常住智印密藏相，",
        "translation": "Again, he spoke the esoteric saying, Om [mouth*lam] (two combinations). At that point, the Bhagavān again relied on the characteristic of the mysterious store sign of the eternally abiding wisdom seal of all tathāgatas,",
        "source": "T08n0241_001:0779c03_29"
    },
    {
        "source_sentence": "為諸菩薩宣說一切如來金剛智印甚深般若波羅蜜多理趣法門。",
        "translation": "He teaches the profound principle and approach of the profound prajñāpāramitā, the vajra wisdom mudrā of all tathāgatas, for the sake of bodhisattvas.",
        "source": "T08n0241_001:0779c06_0"
    },
    {
        "source_sentence": "所謂：「執持一切如來金剛身印，得一切如來真實體性故；",
        "translation": "They hold the sign of the adamantine body of all buddhas, because they attain the true essence of reality of all buddhas.",
        "source": "T08n0241_001:0779c07_1"
    },
    {
        "source_sentence": "執持一切如來金剛語印，得一切門自在故；",
        "translation": "They hold the sign of the adamantine speech of all buddhas, because they attain mastery over all aspects.",
        "source": "T08n0241_001:0779c08_2"
    },
    {
        "source_sentence": "執持一切如來金剛心印，得一切三摩地具足故；",
        "translation": "They hold the sign of the adamantine mind of all buddhas, because they attain the fulfillment of all concentrations.",
        "source": "T08n0241_001:0779c09_3"
    },
    {
        "source_sentence": "執金剛持一切如來金剛智印，得最上身語心如金剛故。」",
        "translation": "Holding the adamantine mudrā of all tathāgatas' adamantine wisdom, he attains the supreme body, speech, and mind like a vajra.",
        "source": "T08n0241_001:0779c11_0"
    },
    {
        "source_sentence": "佛說如是智印法已，告金剛手等言：「金剛手！",
        "translation": "After the Buddha taught this teaching, he addressed Vajrapāṇi and others, saying, Vajrapāṇi!",
        "source": "T08n0241_001:0779c12_1"
    },
    {
        "source_sentence": "若有得聞此一切如來金剛智甚深般若波羅蜜多理趣法門，信解受持讀誦正念思惟，",
        "translation": "If there are those who can hear this profound teaching of the principles and destinies of the adamantine wisdom of all buddhas, believe, understand, retain, recite, correctly recite, and contemplate it,",
        "source": "T08n0241_001:0779c13_2"
    },
    {
        "source_sentence": "即得成就最上金剛智印，於一切智及眾事業皆得圓滿，身語心性猶若金剛不可破壞，",
        "translation": "He then attained the supreme sign of adamantine knowledge, perfected in all knowledges and undertakings, his body, speech, and mind as indestructible as diamond.",
        "source": "T08n0241_001:0779c15_3"
    },
    {
        "source_sentence": "疾證無上正等菩提。」",
        "translation": "They'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0779c17_4"
    },
    {
        "source_sentence": "復說密語：「惡」爾時世尊，復依一切無戲論法如來之相；",
        "translation": "Again, he spoke this esoteric saying, Evil! At that time the World-honored One again relied upon all the characteristics of a buddha who was free from conceptual elaborations.",
        "source": "T08n0241_001:0779c17_5"
    },
    {
        "source_sentence": "為諸菩薩說文字轉輪品般若波羅蜜多理趣法門。",
        "translation": "He teaches the Dharma teaching of the principle and destinies of the Prajñāpāramitā, which is the turning of the wheel of words for bodhisattvas.",
        "source": "T08n0241_001:0779c19_6"
    },
    {
        "source_sentence": "所謂：「一切法空，無自性故；",
        "translation": "All things are void because they have no self-nature.",
        "source": "T08n0241_001:0779c21_7"
    },
    {
        "source_sentence": "一切法無相，離眾相故；",
        "translation": "All things have no signs, because they are free from signs.",
        "source": "T08n0241_001:0779c21_8"
    },
    {
        "source_sentence": "一切法無願，離諸願故；",
        "translation": "All things have no wishes, because they are free from wishes.",
        "source": "T08n0241_001:0779c22_9"
    },
    {
        "source_sentence": "乃至一切法自性清淨，即般若波羅蜜多自性清淨。」",
        "translation": "It's the purity of the self-nature of all dharmas, which is the purity of the self-nature of the prajñāpāramitā.",
        "source": "T08n0241_001:0779c22_10"
    },
    {
        "source_sentence": "佛說如是離諸戲論文字法已，告金剛手菩薩等言：「若有得聞此無戲論般若理趣輪字法門，",
        "translation": "After the Buddha had taught this way, free of conceptual elaborations about words and dharmas, he addressed the Vajrapāṇi Bodhisattva and others, saying, If you can hear this teaching of the principle of non-conceptual prajñāpāramitā that leads to the wheel-syllable dharma-gate,",
        "source": "T08n0241_001:0779c24_0"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，於此一切法得無礙智，疾證無上正等菩提。」",
        "translation": "By believing, understanding, retaining, reciting, correctly remembering, and contemplating these all things, they attain unhindered knowledge and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0779c26_1"
    },
    {
        "source_sentence": "復說密語：「暗(上聲、引)」爾時世尊，復依一切如來入廣大轉輪相，",
        "translation": "Again, he spoke the esoteric saying, Darkness (上聲、引). At that point, the Bhagavān again relied on all the Tathāgatas to enter into the vast wheel-turning aspect of transmigration,",
        "source": "T08n0241_001:0779c27_2"
    },
    {
        "source_sentence": "為諸菩薩說入廣大轉輪般若波羅蜜多甚深理趣平等性門。",
        "translation": "He teaches the bodhisattvas to enter the profound equality of principles and destinies of the vast wheel-turning prajñāpāramitā.",
        "source": "T08n0241_001:0779c29_3"
    },
    {
        "source_sentence": "所謂：「入金剛平等性，得入一切如來轉輪故；",
        "translation": "They enter the equanimity of adamantine, because they enter all buddha-turning wheels.",
        "source": "T08n0241_001:0780a02_4"
    },
    {
        "source_sentence": "入義平等性，得入一切菩薩法轉輪故；",
        "translation": "The equality of sense-entry is that it enables one to enter all the teachings of enlightening beings.",
        "source": "T08n0241_001:0780a03_5"
    },
    {
        "source_sentence": "入法平等性，得入妙法轉輪故；",
        "translation": "They enter the equality of all things because they attain entry into the turning wheel of the sublime Teaching.",
        "source": "T08n0241_001:0780a04_6"
    },
    {
        "source_sentence": "乃至入一切法平等性，得入一切法平等性，得入一切法輪轉故。」",
        "translation": "It's because they enter into the equality of all dharmas, enter into the equality of all dharmas, and enter into the equality of all dharmas.",
        "source": "T08n0241_001:0780a05_0"
    },
    {
        "source_sentence": "佛說如是入廣大轉輪般若理趣平等性已，告金剛手菩薩等言：「若有得聞如是輪性甚深理趣平等性門，",
        "translation": "After the Buddha had thus explained the equality of principle and destiny of entering into the vast wheel-turning prajñāpāramitā, he addressed the Vajrapāṇi Bodhisattva and others, saying, If you can hear such a wheel-turning nature as profound as the equality of principle and destiny of principle,",
        "source": "T08n0241_001:0780a06_1"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，善能悟入諸平等性，疾證無上正等菩提。」",
        "translation": "Believing, understanding, retaining, reciting, correctly remembering, and contemplating, they can skillfully awaken into the equality of all things and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0780a08_2"
    },
    {
        "source_sentence": "復說密語：「吽」爾時世尊，復依一切如來廣大供養種種供具，為諸菩薩宣說最勝第一廣大供養種種供具般若波羅蜜多甚深理趣無上法門。",
        "translation": "Again, he spoke the esoteric saying, Om! At that point, the Bhagavān also relied on the vast offerings and various offerings of all the tathāgatas to make vast offerings to the bodhisattvas and taught them the most profound principle and unsurpassed dharma-gate of the Prajñāpāramitā, which is the supreme extensive offering",
        "source": "T08n0241_001:0780a10_3"
    },
    {
        "source_sentence": "所謂：「發菩提心即成廣大供養一切如來；",
        "translation": "To give rise to the determination for enlightenment is to make vast offerings to all buddhas.",
        "source": "T08n0241_001:0780a14_4"
    },
    {
        "source_sentence": "救護一切有情即成廣大供養一切如來；",
        "translation": "To save all sentient beings is to accomplish vast offerings to all buddhas.",
        "source": "T08n0241_001:0780a15_5"
    },
    {
        "source_sentence": "住持妙法即成廣大供養一切如來；",
        "translation": "To abide in and preserve the sublime Teaching is to make vast offerings to all buddhas.",
        "source": "T08n0241_001:0780a16_6"
    },
    {
        "source_sentence": "乃至書寫受持讀誦正念思惟供養般若波羅蜜多，即成廣大供養一切如來。」",
        "translation": "Up to the point where they write, memorize, recite, correctly remember, contemplate, and make offerings to the prajñāpāramitā, that's when they become a vast offering to all the tathāgatas.",
        "source": "T08n0241_001:0780a17_7"
    },
    {
        "source_sentence": "佛說如是真淨供養甚深理趣無上法已，告金剛手等言：「若有得聞如是供養般若理趣無上法門，",
        "translation": "After the Buddha had taught such a truly pure offering of profound principles and unsurpassed dharmas, he addressed Vajrapāṇi and others, saying, Suppose someone were to hear such an offering of prajñāpāramitā that leads to the principle and path of the unsurpassed dharma-gate.",
        "source": "T08n0241_001:0780a19_8"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，速能圓滿諸菩薩行，疾證無上正等菩提。」",
        "translation": "By believing, understanding, retaining, reciting, correctly remembering, and contemplating, they'll quickly perfect the bodhisattva practices and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0780a21_9"
    },
    {
        "source_sentence": "復說密語：「唵」爾時世尊，復依一切如來能調伏一切有情相，為諸菩薩宣說能伏一切有情祕密智藏般若波羅蜜多理趣法門。",
        "translation": "Again, he spoke the esoteric saying, Om! At that point, the Bhagavān again relied on all the tathāgatas who were able to tame the characteristics of all sentient beings and taught the principle and destinies of the prajñāpāramitā of the secret store of wisdom that can subdue all sentient beings for bodhisattvas.",
        "source": "T08n0241_001:0780a23_10"
    },
    {
        "source_sentence": "所謂：「一切有情平等性，即忿怒平等性；",
        "translation": "The equality of all sentient beings is the equality of anger.",
        "source": "T08n0241_001:0780a27_11"
    },
    {
        "source_sentence": "一切有情調伏性，即忿怒調伏性；",
        "translation": "The nature of being disciplined by all sentient beings is the nature of being disciplined by anger.",
        "source": "T08n0241_001:0780a28_12"
    },
    {
        "source_sentence": "一切有情真法性，即忿怒真法性；",
        "translation": "The true Dharma nature of all sentient beings is the true Dharma nature of anger.",
        "source": "T08n0241_001:0780a29_13"
    },
    {
        "source_sentence": "一切有情如金剛性，即忿怒如金剛性。",
        "translation": "All sentient beings are like the adamantine nature, which means anger is like the adamantine nature.",
        "source": "T08n0241_001:0780a29_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0241_001:0780b01_15"
    },
    {
        "source_sentence": "調伏一切有情令得菩提故。」",
        "translation": "It's because they tame all sentient beings so that they attain enlightenment.",
        "source": "T08n0241_001:0780b02_0"
    },
    {
        "source_sentence": "佛說如是能善調伏甚深理趣智藏已，告金剛手菩薩等言：「若有得聞如是調伏般若理趣智藏法門，",
        "translation": "Having thus explained the profound store of wisdom that can skillfully subdue, the Buddha addressed the bodhisattvas Vajrapāṇi and others, saying, Suppose you were to hear the Dharma teaching of the store of wisdom that subdues the principles and destinies of prajñāpāramitā in this way.",
        "source": "T08n0241_001:0780b02_1"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，能自調伏忿怒等過，亦能調伏一切有情常生善趣受諸妙樂，",
        "translation": "They believe, understand, memorize, recite, correctly contemplate, and are able to subdue their own faults of anger and so forth. They can also subdue all sentient beings by enabling them to always be born in a good destiny and experience sublime bliss.",
        "source": "T08n0241_001:0780b04_2"
    },
    {
        "source_sentence": "現世怨敵皆起慈心，善能修行諸菩薩行，疾證無上正等菩提。」",
        "translation": "All the enemies in the world now become compassionate, skillfully cultivate the bodhisattva practices, and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0780b06_3"
    },
    {
        "source_sentence": "復說密語：「郝」爾時世尊，復依一切如來住平等相，為諸菩薩說一切法最勝平等性甚深般若波羅蜜多理趣法門。",
        "translation": "Again, he spoke the esoteric saying, Hao! At that point, the Bhagavān again relied on the equal characteristics of all the tathāgatas who abide in equality and taught the bodhisattvas the profound principle-way dharma-gate of the supreme equality of all dharmas for the sake of the profundity of prajñāpārami",
        "source": "T08n0241_001:0780b08_4"
    },
    {
        "source_sentence": "所謂：「一切法即平等性故，甚深般若波羅蜜多亦即平等性；",
        "translation": "Because all things are equal, profound transcendent wisdom is also equal.",
        "source": "T08n0241_001:0780b12_5"
    },
    {
        "source_sentence": "一切法即第一義性故，甚深般若波羅蜜多亦即第一義性；",
        "translation": "Because all things are the ultimate truth, profound transcendent wisdom is also the ultimate truth.",
        "source": "T08n0241_001:0780b13_6"
    },
    {
        "source_sentence": "一切法即法性故，甚深般若波羅蜜多亦即法性；",
        "translation": "Because all things are the essence of things, profound transcendent wisdom is also the essence of things.",
        "source": "T08n0241_001:0780b15_7"
    },
    {
        "source_sentence": "乃至一切有業用性故，當知甚深般若波羅蜜多亦有業用性。」",
        "translation": "Even if everything has the nature of karma and function, you should know that the profound prajñāpāramitā also has the nature of karma and function.",
        "source": "T08n0241_001:0780b16_8"
    },
    {
        "source_sentence": "佛說如是性平等性甚深理趣最勝法已，告金剛手菩薩等言：「若有得聞如是平等甚深般若理趣最勝法門，",
        "translation": "After the Buddha had taught this profound principle of equality of suchness, he addressed the Vajrapāṇi Bodhisattva and others, saying, Suppose someone hears this profound principle of equality of suchness.",
        "source": "T08n0241_001:0780b17_9"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，則能通達平等法性甚深般若波羅蜜多，於諸有情心無罣礙，",
        "translation": "By believing, understanding, memorizing, reciting, correctly remembering, and contemplating, they are able to comprehend the profound prajñāpāramitā of equality in all dharmas. Their minds are unobstructed toward sentient beings.",
        "source": "T08n0241_001:0780b20_0"
    },
    {
        "source_sentence": "疾證無上正等菩提。」",
        "translation": "They'll quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0780b22_0"
    },
    {
        "source_sentence": "復說密語：「頡唎(二合、引)」爾時世尊，復依一切如來為諸有情作加持相，",
        "translation": "Again, he spoke the esoteric saying, Jīvaka (both combined and cited). At that point, the Bhagavān again relied on all the Tathāgatas to create an empowering characteristic for sentient beings,",
        "source": "T08n0241_001:0780b22_1"
    },
    {
        "source_sentence": "為諸菩薩說一切有情加持故般若波羅蜜多理趣法門。",
        "translation": "For the sake of all bodhisattvas, he explains the principle-directed dharma-gate of the prajñāpāramitā because it's supported by all sentient beings.",
        "source": "T08n0241_001:0780b25_2"
    },
    {
        "source_sentence": "所謂：「一切有情即是如來藏，普賢菩薩性遍故；",
        "translation": "All sentient beings are the treasury of Buddha, because the enlightening being Universally Good universally pervades it.",
        "source": "T08n0241_001:0780b26_3"
    },
    {
        "source_sentence": "一切有情即是金剛，灌頂圓滿性故；",
        "translation": "All sentient beings are thus diamond, because they are endowed with the nature of perfect completion.",
        "source": "T08n0241_001:0780b27_4"
    },
    {
        "source_sentence": "一切有情即正法藏性，能轉一切正法語輪故；",
        "translation": "All sentient beings are the essence of the treasury of true teaching, because they can turn the wheel of speech of all true teachings.",
        "source": "T08n0241_001:0780b28_5"
    },
    {
        "source_sentence": "一切有情即是事業藏性，能作一切事業相應故。」",
        "translation": "All sentient beings are the store of undertakings, which are capable of performing all undertakings that are associated with them.",
        "source": "T08n0241_001:0780b29_6"
    },
    {
        "source_sentence": "佛說如是加持有情甚深理趣勝藏法已，告金剛手菩薩等言：「若有得聞如是遍滿般若理趣勝藏法門，",
        "translation": "After he had taught the profound principle of the superior store teaching thus, the Buddha addressed the Vajrapāṇi Bodhisattva and others, saying, Suppose someone hears this pervasively perfected prajñāpāramitā that leads to the superior store teaching.",
        "source": "T08n0241_001:0780c01_7"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，則能通達勝藏法性，疾證無上正等菩提。」",
        "translation": "By believing, understanding, retaining, reciting, correctly remembering, and contemplating, they'll be able to comprehend the Dharma nature of the superior store and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0780c03_8"
    },
    {
        "source_sentence": "復說密語：「底利(二合、引)」爾時世尊，復依一切如來無量無邊際究竟盡相，",
        "translation": "Again, he spoke this esoteric saying, Tīri (both combined and cited). At that point, the Bhagavān again relied on the ultimate exhaustive characteristics of all the Tathāgatas' immeasurables and limitlessnesses,",
        "source": "T08n0241_001:0780c05_9"
    },
    {
        "source_sentence": "為諸菩薩宣說一切法無量無邊際究竟盡平等般若波羅蜜多理趣法門。",
        "translation": "He teaches all dharmas that are immeasurable, limitless, and ultimately equal to the principle and destinies of the prajñāpāramitā for bodhisattvas.",
        "source": "T08n0241_001:0780c08_10"
    },
    {
        "source_sentence": "所謂：「甚深般若波羅蜜多無量故，一切如來亦無量；",
        "translation": "Because the profound perfection of wisdom is immeasurable, all buddhas are also immeasurable.",
        "source": "T08n0241_001:0780c09_11"
    },
    {
        "source_sentence": "甚深般若波羅蜜多無邊故，一切如來亦無邊；",
        "translation": "Because the profound perfection of wisdom has no limit, all buddhas also have no limit.",
        "source": "T08n0241_001:0780c10_12"
    },
    {
        "source_sentence": "甚深般若波羅蜜多一性故，一切諸法亦一性；",
        "translation": "Because the profound perfection of wisdom is one and the same in nature, all things are also one and the same in nature.",
        "source": "T08n0241_001:0780c12_0"
    },
    {
        "source_sentence": "甚深般若波羅蜜多究竟盡故，一切諸法亦究竟盡。」",
        "translation": "Because the profound prajñāpāramitā is completely exhausted, all dharmas are also completely exhausted.",
        "source": "T08n0241_001:0780c13_1"
    },
    {
        "source_sentence": "佛說如是無邊無際究竟理趣金剛已，告金剛手菩薩等言：「金剛手！",
        "translation": "After the Buddha explained thus the ultimate principle and destiny of the Vajra, he addressed the Vajrapāṇi Bodhisattva and others, saying, Vajrapāṇi!",
        "source": "T08n0241_001:0780c14_2"
    },
    {
        "source_sentence": "若有得聞如是究竟般若波羅蜜多理趣金剛法門，信解受持讀誦正念思惟，",
        "translation": "If there are those who can hear this ultimate teaching of the principle and aim of the perfection of wisdom called thus the adamantine dharma-gate, believe it, understand it, retain it, recite it, correctly recite it, and correctly contemplate it,",
        "source": "T08n0241_001:0780c15_3"
    },
    {
        "source_sentence": "所有一切障礙皆得消滅究竟無餘，定得如來執金剛性，疾證無上正等菩提。」",
        "translation": "All the obstacles that exist can be completely extinguished without remainder, and they'll surely attain the adamantine nature of the Tathāgata's attachment and quickly realize unsurpassed perfect enlightenment.",
        "source": "T08n0241_001:0780c17_4"
    },
    {
        "source_sentence": "復說密語：「毘藥(二合)」爾時世尊，復依一切如來離戲論祕密法性毘盧遮那相，",
        "translation": "Again, he spoke the esoteric saying, Vaiśravaṇa. At that point, the Bhagavān again relied on the mark of Vairocana, the characteristic of all the Tathāgatas who are free of conceptual elaborations about the secret dharma-nature of Vaiśravaṇa,",
        "source": "T08n0241_001:0780c19_5"
    },
    {
        "source_sentence": "為諸菩薩宣說普賢大樂金剛不空神呪，無量決定入諸法性，無初中後最勝第一，",
        "translation": "He expounded to the enlightening beings the spell of Universally Good Great bliss, the diamond-like adamantine spell of nonemptyness, boundless and certain to enter all natures of reality, supremely superior from beginning to end.",
        "source": "T08n0241_001:0780c22_6"
    },
    {
        "source_sentence": "甚深般若波羅蜜多理趣法門。",
        "translation": "It's the profound prajñāpāramitā, the principle-way dharma-gate.",
        "source": "T08n0241_001:0780c24_7"
    },
    {
        "source_sentence": "所謂：「諸菩薩能廣大承事供養故，得最上大樂；",
        "translation": "Enlightening beings attain the supreme bliss because they are able to serve and support them extensively.",
        "source": "T08n0241_001:0780c24_8"
    },
    {
        "source_sentence": "能得最上大樂故，能得諸佛無上大菩提；",
        "translation": "Because they can attain the supreme bliss, they can attain the unexcelled great enlightenment of all buddhas.",
        "source": "T08n0241_001:0780c25_9"
    },
    {
        "source_sentence": "得諸佛無上大菩提故，悉能降伏一切魔軍；",
        "translation": "They attain the unexcelled great enlightenment of all buddhas and are able to subdue all armies of demons.",
        "source": "T08n0241_001:0780c26_10"
    },
    {
        "source_sentence": "降伏一切魔軍故，得於三界自在最勝成就；",
        "translation": "Because they subdue all armies of demons, they attain supreme freedom in the three realms.",
        "source": "T08n0241_001:0780c27_11"
    },
    {
        "source_sentence": "於三界自在最勝成就故，能遍饒益一切有情，悉與究竟最上安樂。」",
        "translation": "Because he has the most excellent accomplishment of self-dependence in the three realms, he's able to universally benefit all sentient beings and give them ultimately the highest level of comfort.",
        "source": "T08n0241_001:0780c28_12"
    },
    {
        "source_sentence": "「有最勝者智，　　常在生死中，",
        "translation": "“There’s the supreme knowledge, which is always present in birth and death.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　廣度諸眾生，　　而不入涅槃。",
        "translation": "He liberates all sentient beings extensively but doesn't enter nirvāṇa.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　般若波羅蜜，　　究竟方便智，",
        "translation": "The perfection of wisdom, the ultimate knowledge of skillful means,",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　能成清淨業，　　普淨於諸有。",
        "translation": "Being able to accomplish pure actions, they universally purify existence.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　又以於貪等，　　調伏諸世間，",
        "translation": "Furthermore, because of craving and so forth, they tame the worlds.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　乃至有頂天，　　清淨無為果。",
        "translation": "It's the pure and unconditioned fruit of the highest heaven.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　在於生死中，　　世法不能染，",
        "translation": "In the midst of birth and death, worldly dharmas can’t stain them.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　如蓮華妙色，　　塵垢所不污。",
        "translation": "It's like the marvelous color of a lotus flower that's undefiled by dirt.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　大欲清淨人，　　大施安樂人，",
        "translation": "The great desire is for someone who’s pure, and the great giving is for someone who’s at peace.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "　於三界自在，　　作堅固利益。」",
        "translation": "In the three realms of unimpededness, he creates a firm benefit.",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "復說密語：「薩梵復說密語：「訶「唵娜麼薩婆沒馱母地薩埵喃「唵步地質多跋折嚟(二合)「唵三曼多跋陀羅(二合)者利耶「唵真多麼抳(埵)「唵過儞嚧提(陀)「唵　若(引)底尾[竺-二+戍]帝(空)「唵麼訶囉伽達[繼-糸+言]「唵寐(引)哩耶迦嚩制(王)「唵薩婆伽弭儞「唵跋折羅(二合)儞哩茶迦嚩折坻吽「唵薩婆怛他孽帝(藏)「唵婆嚩婆(去聲、引)嚩秫提(光)「唵達麼多孃娜尾秫提(幢)「唵羯麼尾戌(引)達(你)唵(笑)「唵儞蘇皤跋折哩抳吽泮「唵羯麼邏霓(利)「唵惹呼跋折囇(因)「唵薩婆娜(一引)以儞「唵　頓唎(二合)羯「唵　阿迦羅目契護「唵　鉢利若波羅帝(叉)郝(拳)鑁(去聲)吽(剛)「唵([土*缶])闇(磨)「唵薩婆怛他孽多麼(引)祇尾戍(引)達儞(語)「唵薩婆怛他孽多迦孽囇(佛)「唵薩婆怛他孽多質多跋折囇(心)「唵跋折囉薩埵微塞普吒耶薩婆播耶滿馱娜儞鉢囉慕乞叉耶薩婆播耶孽底弊薩嚩薩怛晚薩嚩怛他孽多三昧耶跋囉吽怛囉吒」佛說如是祕密語已，",
        "translation": "復說密語:「薩梵復說密語:「訶「娜麼薩婆沒馱母地薩喃「步地質多跋折髮(二合)「三曼多跋陀羅(二合)者利耶「真多麼()「過提(陀)「 若若(引)底尾[竺-二+",
        "source": "T08n0241_001:0781a01_13"
    },
    {
        "source_sentence": "告金剛手菩薩祕密主言：「若諸有情得聞此二十五甚深般若波羅蜜多理趣祕密法門，",
        "translation": "He said to the lord of the Vajrapāṇisattva's esoteric master, Suppose sentient beings hear these twenty-five profound principles and destinies of the esoteric teachings of prajñāpāramitā,",
        "source": "T08n0241_001:0781b14_14"
    },
    {
        "source_sentence": "信解受持讀誦正念思惟，現世即得一切如來金剛祕密最勝成就，不久當得一切如來大執金剛法性之身。」",
        "translation": "By believing, understanding, retaining, reciting, correctly remembering, and contemplating, they'll attain the most excellent accomplishment of the vajra secrets of all tathāgatas in the present life, and soon they'll attain the great adamantine Dharma-nature body of all tathāgatas.",
        "source": "T08n0241_001:0781b16_15"
    },
    {
        "source_sentence": "爾時世尊謂諸菩薩，宣說如上諸法門已，復告金剛手菩薩言：「金剛手！",
        "translation": "After the Bhagavān addressed the bodhisattvas and explained the above teachings, he again addressed the Vajrapāṇi Bodhisattva, saying, Vajrapāṇi!",
        "source": "T08n0241_001:0781b18_16"
    },
    {
        "source_sentence": "我此經典難可得聞，乃至極少至於一字，應知是人過去已曾供養諸佛，",
        "translation": "You should know that these people had in the past offered their support to all the buddhas.",
        "source": "T08n0241_001:0781b20_17"
    },
    {
        "source_sentence": "於諸佛所種諸善根。",
        "translation": "He plants good roots in the buddhas.",
        "source": "T08n0241_001:0781b22_18"
    },
    {
        "source_sentence": "何況具足聽聞受持讀誦正念思惟，當知是人決定已曾供養恭敬尊重讚歎八十億那庾多恒河沙等諸佛。",
        "translation": "How much more so when they're fully listening, retaining, reciting, chanting, correctly remembering, and contemplating, knowing that person will surely have offered support, respected, honored, venerated, and praised the buddhas equal to the number of grains of sands in the Ganges River of eighty billion nayutas.",
        "source": "T08n0241_001:0781b22_19"
    },
    {
        "source_sentence": "若是經典所在之處，此地則為有諸佛塔。",
        "translation": "If this is the place where the sūtras are located, then there are buddha-tathānas here.",
        "source": "T08n0241_001:0781b25_20"
    },
    {
        "source_sentence": "若諸有情愛重此經，常隨守護不離身者，是人應受一切世間恭敬供養；",
        "translation": "If sentient beings esteem this scripture and always follow and protect it without leaving their bodies, such people should be honored and offered support by all worldly beings.",
        "source": "T08n0241_001:0781b26_21"
    },
    {
        "source_sentence": "是人當得宿命智通，能知過去無量劫事；",
        "translation": "That person will attain supernormal knowledge of past lives and be able to know the events of innumerable past ages.",
        "source": "T08n0241_001:0781b27_22"
    },
    {
        "source_sentence": "不為一切諸天魔波旬之所擾亂，四天大王及諸餘天常隨衛護；",
        "translation": "They won’t be disturbed by all the devils of heaven. The great kings of the four quarters and other celestial beings will always follow and protect them.",
        "source": "T08n0241_001:0781b28_23"
    },
    {
        "source_sentence": "一切諸佛及諸菩薩恒常供養攝受，十方淨土隨願往生。",
        "translation": "All the buddhas and bodhisattvas always offer support and receive them, and they are reborn in the pure lands of the ten directions as they wish.",
        "source": "T08n0241_001:0781c01_24"
    },
    {
        "source_sentence": "金剛手！",
        "translation": "Vajrapāṇi!",
        "source": "T08n0241_001:0781c02_25"
    },
    {
        "source_sentence": "我今略說般若波羅蜜多理趣法門功德如是，若廣說者窮劫不盡。」",
        "translation": "Now, I'll briefly explain the merit of the Dharma aspect of the principle and destinies of the prajñāpāramitā as such, and if I explain it in detail, it won't be exhausted for an entire eon.",
        "source": "T08n0241_001:0781c02_26"
    },
    {
        "source_sentence": "佛說此經已，金剛手等諸菩薩，天、龍、夜叉、乾闥婆、阿素羅、孽嚕拏、緊那羅、摩護囉伽、人非人等，",
        "translation": "After the Buddha had taught this sūtra, Vajrapāṇi and other bodhisattvas, gods, dragons, yakṣas, gandharvas, asuras, asuras, āmarūpas, kiṃnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T08n0241_001:0781c04_27"
    },
    {
        "source_sentence": "一切眾會，皆大歡喜，信受奉行。",
        "translation": "All the members of the assembly were greatly delighted and believed it, accepted it, and carried it out.",
        "source": "T08n0241_001:0781c06_28"
    },
    {
        "source_sentence": "金剛頂瑜伽理趣般若經",
        "translation": "Vajraśekhara-sūtra",
        "source": "T08n0241_001:0781c08_0"
    }
]