[
    {
        "source_sentence": "佛說佛母出生三法藏般若",
        "translation": "Prajñāpāramitā of the Three Sources of the Dharma Treasury Spoken by the Buddha to the Buddha's Mother",
        "source": "T08n0228_021:0658b10_0"
    },
    {
        "source_sentence": "波羅蜜多經卷第二十一",
        "translation": "Perfection of Wisdom Sutra, Volume 21",
        "source": "T08n0228_021:0658b11_0"
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Xitian zhuan jing sanzang朝奉大夫試光祿卿",
        "source": "T08n0228_021:0658b13_0"
    },
    {
        "source_sentence": "傳法大師賜紫臣施護奉　詔譯",
        "translation": "Translated by imperial edict of the Master Zhuanfa, who bestowed a purple minister named Shi Hufeng",
        "source": "T08n0228_021:0658b14_0"
    },
    {
        "source_sentence": "學品第二十五",
        "translation": "Twenty-fifth Chapter of the Teaching",
        "source": "T08n0228_021:0658b15_0"
    },
    {
        "source_sentence": "爾時，尊者須菩提白佛言：「世尊！",
        "translation": "At that point, Venerable Subhūti said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0658b16_0"
    },
    {
        "source_sentence": "菩薩摩訶薩欲學一切智，當云何學？」",
        "translation": "When bodhisattvas, mahāsattvas, want to train in omniscience, how should they train?",
        "source": "T08n0228_021:0658b16_1"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0658b17_2"
    },
    {
        "source_sentence": "菩薩摩訶薩若盡學則學一切智，若離學則學一切智。",
        "translation": "If the bodhisattva Mahāsattva finishes training, then he'll train in omniscience, and if he leaves training, then he'll train in omniscience.",
        "source": "T08n0228_021:0658b17_3"
    },
    {
        "source_sentence": "若無生無滅無起無染無性，如虛空法界寂靜等學，則學一切智。」",
        "translation": "If there's no arising, no cessation, no arising, no defilement, and no nature, it's like training in space, the Dharma realm, quiescence, and so forth, then you'll train in omniscience.",
        "source": "T08n0228_021:0658b19_4"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0658b21_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩盡學離學乃至法界寂靜等學，則學一切智者，是等當云何作？」",
        "translation": "If a bodhisattva-mahāsattva completely trains, parts with training and goes on to the quiescence of the Dharma realm as well as other trainings, then he trains in all kinds of cognition, how will this be done?",
        "source": "T08n0228_021:0658b21_1"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0658b23_2"
    },
    {
        "source_sentence": "汝若如是說，是等云何作者。",
        "translation": "If you say it this way, then what is the author?",
        "source": "T08n0228_021:0658b23_3"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0658b24_4"
    },
    {
        "source_sentence": "於汝意云何，如來證如如故得名如來，是如有盡、有所作不？」",
        "translation": "What do you think, Tathāgata, that the Tathāgata realizes thusness and thus attains the name as a tathāgata, which is like having done something or not?",
        "source": "T08n0228_021:0658b24_5"
    },
    {
        "source_sentence": "須菩提言：「不也，世尊！",
        "translation": "Suppository said, No, Bhagavān!",
        "source": "T08n0228_021:0658b25_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0658b26_7"
    },
    {
        "source_sentence": "如無盡相亦無所作。」",
        "translation": "As it has inexhaustible characteristics, there's nothing to do.",
        "source": "T08n0228_021:0658b26_8"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0658b26_9"
    },
    {
        "source_sentence": "於汝意云何，如來證如如故得名如來，是如有生有滅有起有染有得有證不？」",
        "translation": "What do you think, does the Tathāgata realize thusness as thus and thus get the name tathāgata? Is it like birth, cessation, arising, defilement, attainment, and realization?",
        "source": "T08n0228_021:0658b27_10"
    },
    {
        "source_sentence": "須菩提言：「不也，世尊！」",
        "translation": "Suppository said, No, Bhagavān!",
        "source": "T08n0228_021:0658b28_11"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0658b29_12"
    },
    {
        "source_sentence": "菩薩摩訶薩學一切智亦復如是。",
        "translation": "So it is with the bodhisattva Mahāsattva's training in omniscience.",
        "source": "T08n0228_021:0658b29_13"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0658c01_14"
    },
    {
        "source_sentence": "是故菩薩摩訶薩若如是學者不盡如相，如是學者是學一切智，如是學者是學般若波羅蜜多，",
        "translation": "Therefore, if the bodhisattva Mahāsattva thus learns and doesn't exhaust such characteristics, then such a learner is training in omniscience, and such a learner is training in the perfection of wisdom.",
        "source": "T08n0228_021:0658c01_15"
    },
    {
        "source_sentence": "如是學者是學佛地，如是學者是學佛十力、四無所畏等一切佛法乃至一切智智，",
        "translation": "Such a learner is training in the Buddha-stage, and such a learner is training in the ten powers of buddhahood, the four fearlessnesses, all the qualities of buddhahood, up to the knowledge of omniscience.",
        "source": "T08n0228_021:0658c03_16"
    },
    {
        "source_sentence": "如是學者能到諸學彼岸，如是學者普能降伏魔及魔眾，如是學者速得不退轉法，",
        "translation": "Such a learner can reach the other shore of all learners, and such a learner can universally subdue Māra and his hosts of Māras; such a learner quickly attains the principle of nonregression.",
        "source": "T08n0228_021:0658c05_17"
    },
    {
        "source_sentence": "如是學者速坐道場，如是學者是學三轉十二行相法輪，如是學者學自所行，",
        "translation": "Such a learner quickly sits at the seat of enlightenment. Such a learner is training in the threefold or twelvefold wheel of the teaching, and such a learner trains in his own practice.",
        "source": "T08n0228_021:0658c07_18"
    },
    {
        "source_sentence": "如是學者學為他作所依怙法，如是學者是學大慈大悲大喜大捨，如是學者學度眾生界，",
        "translation": "Such a learner trains in the Dharma that serves as a refuge for others, such a learner is training in great kindness, great compassion, great pity, great joy, and great equanimity, and such a learner trains to save sentient beings.",
        "source": "T08n0228_021:0658c09_19"
    },
    {
        "source_sentence": "如是學者是學不斷佛種，如是學者學開甘露門。",
        "translation": "Such a learner is training that doesn't stop the Buddha's seed, and such a learner who trains opens the gate of ambrosia.",
        "source": "T08n0228_021:0658c11_20"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0658c12_21"
    },
    {
        "source_sentence": "此廣大學是最上學，凡夫下劣人不能如是學。",
        "translation": "This vast and extensive higher learning is the highest learning, which ordinary people and inferior people can't study in this way.",
        "source": "T08n0228_021:0658c12_22"
    },
    {
        "source_sentence": "若有能調御一切眾生，欲與一切眾生為依怙者，欲出過一切眾生界者，",
        "translation": "If someone can tame all sentient beings and want to be a refuge for all sentient beings, or if they want to transcend the realm of all sentient beings,",
        "source": "T08n0228_021:0658c13_23"
    },
    {
        "source_sentence": "彼能如是學。",
        "translation": "They can thus train.",
        "source": "T08n0228_021:0658c15_24"
    },
    {
        "source_sentence": "若如是學者，不墮地獄、餓鬼、畜生等趣，不生阿修羅界，不生邊地，",
        "translation": "If someone thus learns, they won't fall into hell, hungry ghosts, animals, and other destinies, won't be born in the asura realm, and won't be born in the borderlands.",
        "source": "T08n0228_021:0658c15_25"
    },
    {
        "source_sentence": "不生旃陀羅族，不生下姓種族，不生種種卑賤巧業等族。",
        "translation": "They won't be born in the caṇḍāla family, the lower castes and clans, or various kinds of inferior skillful activities.",
        "source": "T08n0228_021:0658c17_26"
    },
    {
        "source_sentence": "如是學者，不失一目不盲兩目，亦不角睞，不聾不啞，不傴僂，不攣躄。",
        "translation": "Such a learner doesn't lose one eye, don't blind two eyes, don't fight with horns, don't deaf and dumb, don't bend and bow, and don't twitch.",
        "source": "T08n0228_021:0658c18_27"
    },
    {
        "source_sentence": "不醜陋，不麁惡，不形殘，不異相，亦無疥癩癰疽乾痟等病，不壞諸根人相圓滿，",
        "translation": "They are not ugly, not coarse, not disfigured, not shapeless, not different in appearance, not afflicted by abscesses, scabies, leprosy, abscesses, abscesses, abscesses, abscesses, abscesses, and dry ailments. Their faculties don’t break down, and their human forms are complete.",
        "source": "T08n0228_021:0658c19_28"
    },
    {
        "source_sentence": "音聲清巧眾所愛樂。",
        "translation": "The sound is pure and skillful, beloved by the multitude.",
        "source": "T08n0228_021:0658c21_29"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0658c22_30"
    },
    {
        "source_sentence": "又菩薩摩訶薩如是學者，不害他命，不盜他物，不行邪染，不虛妄言亦不兩舌復不惡口，",
        "translation": "“Furthermore, the bodhisattva Mahāsattva thus learns so that he doesn’t harm other people’s lives, doesn’t steal others’ property, doesn’t engage in sexual misconduct, doesn’t speak falsehoods, doesn’t speak divisively, and doesn’t speak harshly.",
        "source": "T08n0228_021:0658c22_31"
    },
    {
        "source_sentence": "不無義語，不生貪著，不起瞋惱，不住邪見，不邪命活，不修邪命法，",
        "translation": "They are not without meaningful words, do not become attached, do not give rise to anger or resentment, do not abide in wrong views, live by right livelihood, and do not cultivate wrong livelihood.",
        "source": "T08n0228_021:0658c24_32"
    },
    {
        "source_sentence": "不畜破戒眷屬，不近非法者，不生長壽天，雖入諸禪而不隨禪生。",
        "translation": "Those who don't keep followers who break the precepts and don't go near what's not forbidden won't grow up in the long-lived gods, even though they enter meditations and aren't born according to meditation.",
        "source": "T08n0228_021:0658c25_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0658c27_34"
    },
    {
        "source_sentence": "菩薩以能成就善巧方便故。",
        "translation": "It's because the bodhisattva can accomplish skillful means.",
        "source": "T08n0228_021:0658c27_35"
    },
    {
        "source_sentence": "而菩薩成就何等善巧方便？",
        "translation": "What skillful means has the bodhisattva accomplished?",
        "source": "T08n0228_021:0658c28_36"
    },
    {
        "source_sentence": "所謂從般若波羅蜜多相應出生善巧方便，是故菩薩雖入諸禪而不隨禪生。",
        "translation": "It's called the skillful means of producing skillful means associated with the perfection of prajñāpāramitā, so even though a bodhisattva enters meditations, they don't arise according to meditation.",
        "source": "T08n0228_021:0658c28_37"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a01_38"
    },
    {
        "source_sentence": "菩薩摩訶薩能如是學者，即得清淨十力、清淨四無所畏乃至清淨一切佛法。」",
        "translation": "If bodhisattvas and mahāsattvas can thus learn, they'll attain the purity of the ten powers, the purity of the four fearlessnesses, and the purity of all the Buddha's teachings.",
        "source": "T08n0228_021:0659a01_39"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0659a04_0"
    },
    {
        "source_sentence": "一切法自性本來清淨，菩薩摩訶薩云何復得清淨十力、清淨四無所畏乃至清淨一切佛法耶？」",
        "translation": "The self-nature of all dharmas is inherently pure, so how can the bodhisattva Mahāsattva again attain the purity of the ten powers, the purity of the four fearlessnesses, and the purity of all the Buddha's teachings?",
        "source": "T08n0228_021:0659a04_1"
    },
    {
        "source_sentence": "佛告須菩提言：「如是，如是！",
        "translation": "The Buddha told Subhūti, So it is, so it is!",
        "source": "T08n0228_021:0659a06_2"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a07_3"
    },
    {
        "source_sentence": "一切法自性本來清淨，菩薩摩訶薩於是一切法自性本來清淨中，如理修學般若波羅蜜多，",
        "translation": "The essential nature of all dharmas is inherently pure, and the bodhisattva Mahāsattva thus observes that the essential nature of all dharmas is inherently pure, cultivating the perfection of wisdom in accordance with principle.",
        "source": "T08n0228_021:0659a07_4"
    },
    {
        "source_sentence": "不驚不怖不退不沒。",
        "translation": "They aren't frightened, aren't terrified, don't retreat, and don't disappear.",
        "source": "T08n0228_021:0659a09_5"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a09_6"
    },
    {
        "source_sentence": "彼諸愚異生等於如是法不知不見，以不知不見故無所覺了。",
        "translation": "Those foolish, unenlightened sentient beings and so forth don't know or see such things, and because they don't know or don't see them, there's nothing to perceive.",
        "source": "T08n0228_021:0659a10_7"
    },
    {
        "source_sentence": "是故菩薩摩訶薩發勤精進於中修學，自所學已，令諸異生等於是法中如理修學、實知實見。",
        "translation": "Therefore, the bodhisattva Mahāsattva arouses diligence and exertes himself to cultivate it, and after he has cultivated what he's training, he causes ordinary people and so forth to correctly cultivate and truly know the true view in this teaching.",
        "source": "T08n0228_021:0659a11_8"
    },
    {
        "source_sentence": "菩薩摩訶薩由如是學故，即得清淨十力、清淨四無所畏乃至清淨一切佛法。",
        "translation": "Because of such training, the bodhisattva Mahāsattva attains the purity of the ten powers, the purity of the four fearlessnesses, and the purity of all the Buddha's teachings.",
        "source": "T08n0228_021:0659a13_9"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a15_10"
    },
    {
        "source_sentence": "菩薩摩訶薩如是學者，悉能了知一切眾生心心所行。",
        "translation": "Such a learner of the bodhisattva Mahāsattva can fully understand the minds and mental activities of all sentient beings.",
        "source": "T08n0228_021:0659a15_11"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a16_12"
    },
    {
        "source_sentence": "譬如大地少出閻浮檀金，多諸荊棘砂礫草木等類。",
        "translation": "It's like the great earth that rarely produces Jambudvīpa gold and has plenty of thorns, thorny sand, gravel, grass, trees, and so forth.",
        "source": "T08n0228_021:0659a17_0"
    },
    {
        "source_sentence": "一切眾生亦復如是，於眾生聚中少能愛樂修學般若波羅蜜多者，多有愛樂修學聲聞、緣覺法門。",
        "translation": "All sentient beings are likewise, with few people in the aggregate of sentient beings who can delight in cultivating the perfection of wisdom and many who delight in cultivating the teachings of śrāvakas and pratyekbuddhas.",
        "source": "T08n0228_021:0659a18_1"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a20_2"
    },
    {
        "source_sentence": "又如眾生聚中少有修彼輪王業者，但多修彼諸小王業。",
        "translation": "Also, it's like when there are few people in a group of sentient beings who cultivate the wheel-turning king's karma but mostly cultivate the small king's karma.",
        "source": "T08n0228_021:0659a20_3"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a21_4"
    },
    {
        "source_sentence": "當知眾生聚中少有行於般若波羅蜜多道者，多有行於聲聞、緣覺道者，",
        "translation": "You should know that there are few people in the assembly of sentient beings who practice the path of the perfection of wisdom, and many who practice the paths of śrāvakas and pratyekbuddhas.",
        "source": "T08n0228_021:0659a22_0"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T08n0228_021:0659a23_1"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a24_0"
    },
    {
        "source_sentence": "又如眾生聚中少有修彼帝釋福業，但多修彼諸天子業。",
        "translation": "It's also like when there are few people in the aggregate of sentient beings who cultivate the good actions of Indra but often cultivate the actions of those celestial sons.",
        "source": "T08n0228_021:0659a24_1"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a25_2"
    },
    {
        "source_sentence": "當知眾生聚中少有修習般若波羅蜜多行者，多有修習聲聞、緣覺行者，",
        "translation": "You should know that there are few people in the assembly of sentient beings who cultivate the practice of the perfection of wisdom, and many who cultivate the practices of śrāvakas and pratyekbuddhas.",
        "source": "T08n0228_021:0659a25_3"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T08n0228_021:0659a27_4"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a27_5"
    },
    {
        "source_sentence": "又如眾生聚中少有修彼梵王福業，但多修彼諸梵眾業。",
        "translation": "Also, it's like when there are few people in the aggregate of sentient beings who cultivate the meritorious actions of that Brahmā king but often cultivate the actions of those Brahmā groups.",
        "source": "T08n0228_021:0659a27_6"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659a29_0"
    },
    {
        "source_sentence": "當知眾生聚中少有不退轉於阿耨多羅三藐三菩提者，多有退轉於阿耨多羅三藐三菩提者，",
        "translation": "You should know that there are few people in the assembly of sentient beings who don’t regress from unexcelled complete perfect enlightenment, and many who regress from unexcelled complete perfect enlightenment.",
        "source": "T08n0228_021:0659a29_1"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T08n0228_021:0659b02_2"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659b02_3"
    },
    {
        "source_sentence": "以是義故，當知眾生聚中少有能發阿耨多羅三藐三菩提心者，於少能發心中又復少能如理修行者，",
        "translation": "Because of this meaning, you should know that there are few people in the assembly of sentient beings who can give rise to the determination for unexcelled, complete perfect enlightenment.",
        "source": "T08n0228_021:0659b02_4"
    },
    {
        "source_sentence": "於少能修行中又復少能修習般若波羅蜜多相應行者，於少能修習相應行中又復少能於阿耨多羅三藐三菩提住不退轉者。",
        "translation": "Among the few who can cultivate it, there are those who can cultivate the practice associated with the perfection of prajñāpāramitā, and among the few who can cultivate it, there are those who can abide in unsurpassed, correct, and irreversible enlightenment.",
        "source": "T08n0228_021:0659b05_5"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659b08_6"
    },
    {
        "source_sentence": "是故諸菩薩摩訶薩若欲在少中少者，應當修習般若波羅蜜多。",
        "translation": "Therefore, if bodhisattvas and mahāsattvas want to be few in the few, they should cultivate the perfection of prajñāpāramitā.",
        "source": "T08n0228_021:0659b08_7"
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "Furthermore, Subhūti!",
        "source": "T08n0228_021:0659b10_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩修學是般若波羅蜜多者，不生雜染心、不生疑惑心、不生憎嫉心、不生慳悋心、不生破戒心、不生瞋惱心、不生懈怠心、不生散亂心、不生愚癡心。",
        "translation": "If a bodhisattva Mahāsattva cultivates this prajñāpāramitā, he doesn't give rise to defiled minds, doubtful minds, hatred and jealousy, stinginess, breaking the precepts, anger, laziness, dispersed minds, or delusion.",
        "source": "T08n0228_021:0659b10_1"
    },
    {
        "source_sentence": "又，須菩提！",
        "translation": "Furthermore, Subhūti!",
        "source": "T08n0228_021:0659b13_2"
    },
    {
        "source_sentence": "菩薩摩訶薩應修學是般若波羅蜜多。",
        "translation": "The bodhisattva Mahāsattva should cultivate this prajñāpāramitā.",
        "source": "T08n0228_021:0659b14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0659b15_0"
    },
    {
        "source_sentence": "此般若波羅蜜多能護諸波羅蜜多、能受諸波羅蜜多、能取諸波羅蜜多、能集諸波羅蜜多、能攝諸波羅蜜多。",
        "translation": "These perfections of wisdom can protect the perfections, receive the perfections, grasp the perfections, gather the perfections, and collect the perfections.",
        "source": "T08n0228_021:0659b15_1"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659b17_2"
    },
    {
        "source_sentence": "譬如六十二見，身見中攝，諸波羅蜜多於般若波羅蜜多中攝，亦復如是。",
        "translation": "It's likewise with the sixty-two views that are included in the view of body and the perfections that are included in the prajñāpāramitā.",
        "source": "T08n0228_021:0659b17_3"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659b19_4"
    },
    {
        "source_sentence": "又如士夫所有諸根，皆悉於其命根中攝，一切善法皆於般若波羅蜜多中攝，",
        "translation": "Also, just as all the faculties of a man are collected in his life root, all good qualities are collected in the perfection of wisdom.",
        "source": "T08n0228_021:0659b19_5"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T08n0228_021:0659b21_6"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659b21_7"
    },
    {
        "source_sentence": "又如士夫命根滅時諸根皆滅，菩薩摩訶薩亦復如是，若智慧滅時一切善法而亦隨滅。",
        "translation": "Also, just as all the faculties cease when the vital faculty ceases, so do the bodhisattvas and mahāsattvas also cease all good qualities when their wisdom ceases.",
        "source": "T08n0228_021:0659b21_8"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659b23_9"
    },
    {
        "source_sentence": "是故菩薩摩訶薩若欲護諸波羅蜜多，若欲攝諸波羅蜜多者，應當修學是般若波羅蜜多。",
        "translation": "Therefore, if bodhisattvas, mahāsattvas, want to protect the perfections and those who want to gather the perfections, they should cultivate this perfection of wisdom.",
        "source": "T08n0228_021:0659b24_10"
    },
    {
        "source_sentence": "又，菩薩摩訶薩若欲於一切眾生中福德最勝為上首者，應當修學是般若波羅蜜多。」",
        "translation": "Furthermore, if the bodhisattva Mahāsattva wants to be the most superior among all sentient beings in terms of merit and virtue, he should cultivate this prajñāpāramitā.",
        "source": "T08n0228_021:0659b26_11"
    },
    {
        "source_sentence": "復次，佛言：「須菩提！",
        "translation": "Furthermore, the Buddha said, Subhūti!",
        "source": "T08n0228_021:0659b29_0"
    },
    {
        "source_sentence": "於汝意云何，三千大千世界一切眾生是為多不？」",
        "translation": "What do you think, are all the sentient beings in the 3,000 great one-thousand worlds numerous?",
        "source": "T08n0228_021:0659b29_1"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0659c01_2"
    },
    {
        "source_sentence": "但此閻浮提中所有眾生尚多無數，何況三千大千世界一切眾生。」",
        "translation": "But there are so many sentient beings in this Jambudvīpa, not to mention all the sentient beings in the 3,000 great one-thousand worlds.",
        "source": "T08n0228_021:0659c02_0"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0659c03_1"
    },
    {
        "source_sentence": "假使如是三千大千世界一切眾生，一一修行皆住菩薩地，或有一人盡其壽命，",
        "translation": "“Even if all the sentient beings in a billion-world universe were to live as enlightening beings, some of them would die at the stage of enlightening beings.",
        "source": "T08n0228_021:0659c03_2"
    },
    {
        "source_sentence": "以諸飲食、衣服、臥具、醫藥及餘樂具，供養如是三千大千世界諸菩薩眾。",
        "translation": "They offered food, drink, clothing, bedding, medicine, and other necessities of pleasure to the bodhisattvas in these 3,000 great one-thousand worlds.",
        "source": "T08n0228_021:0659c05_3"
    },
    {
        "source_sentence": "此人以是因緣得福多不？」",
        "translation": "Does this person attain much merit because of these causes and conditions?",
        "source": "T08n0228_021:0659c07_4"
    },
    {
        "source_sentence": "須菩提言：「甚多，世尊！",
        "translation": "Suppository said, Very much so, Bhagavān!",
        "source": "T08n0228_021:0659c07_5"
    },
    {
        "source_sentence": "甚多，善逝！」",
        "translation": "Very much so, Sugata!",
        "source": "T08n0228_021:0659c08_6"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0659c08_7"
    },
    {
        "source_sentence": "若復有人於一彈指頃能修行是般若波羅蜜多者，其所得福倍勝於前。",
        "translation": "If another person can cultivate this prajñāpāramitā in the time it takes to snap their fingers, the merit they attain is twice as great as the previous one.",
        "source": "T08n0228_021:0659c08_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0659c10_9"
    },
    {
        "source_sentence": "般若波羅蜜多廣大利益諸菩薩摩訶薩，復能護助阿耨多羅三藐三菩提故。",
        "translation": "The vast benefits of the prajñāpāramitā are also for the benefit of bodhisattvas and mahāsattvas, because they can also protect and assist unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0228_021:0659c10_10"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659c12_11"
    },
    {
        "source_sentence": "是故諸菩薩摩訶薩若欲於一切眾生中最勝無上，若欲與一切眾生為所依怙，",
        "translation": "Therefore, if great enlightening beings want to be the best of all sentient beings, and if they want to be their refuge for all sentient beings,",
        "source": "T08n0228_021:0659c12_12"
    },
    {
        "source_sentence": "若欲偏入諸佛境界，若欲具足佛功德法，若欲得佛遊戲神通，若欲作佛大師子吼，",
        "translation": "If they want to enter partially into the realm of buddhas, if they want to perfect the qualities of buddhahood, if they want to attain the playful spiritual powers of buddhas, and if they want to make the great lion’s roar of enlightenment,",
        "source": "T08n0228_021:0659c14_13"
    },
    {
        "source_sentence": "若欲得佛諸所行處，若欲普以三千大千世界大會說法。",
        "translation": "If they want to attain the places where buddhas practice, or if they want to teach the Dharma in a great assembly of 3,000 great one-thousand worlds.",
        "source": "T08n0228_021:0659c16_14"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659c17_15"
    },
    {
        "source_sentence": "菩薩摩訶薩若欲成就如是等功德利者，應學是般若波羅蜜多。",
        "translation": "If bodhisattvas, mahāsattvas, want to achieve such merits and benefits, they should train in this prajñāpāramitā.",
        "source": "T08n0228_021:0659c17_16"
    },
    {
        "source_sentence": "學是般若波羅蜜多，不能圓滿諸功德利者，無有是處。」",
        "translation": "There's no place for someone who trains in the perfection of prajñāpāramitā and doesn't perfect the benefits of merit.",
        "source": "T08n0228_021:0659c19_17"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0659c20_18"
    },
    {
        "source_sentence": "菩薩摩訶薩亦具足聲聞功德利耶？」",
        "translation": "Is the bodhisattva Mahāsattva also endowed with the merits and benefits of śrāvakas?",
        "source": "T08n0228_021:0659c21_19"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0659c21_20"
    },
    {
        "source_sentence": "菩薩摩訶薩亦學是聲聞法，亦具足聲聞功德之利。",
        "translation": "The bodhisattva Mahāsattva also trains in these śrāvaka teachings, and he's fully endowed with the benefits of the merits of śrāvakas.",
        "source": "T08n0228_021:0659c22_21"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659c23_22"
    },
    {
        "source_sentence": "菩薩摩訶薩雖如是學、如是知、得如是利，而不於中生住著心。",
        "translation": "Although bodhisattvas and mahāsattvas thus train, thus know, and thus attain such benefits, they don't become attached to them.",
        "source": "T08n0228_021:0659c23_23"
    },
    {
        "source_sentence": "菩薩摩訶薩亦說彼聲聞法，而不取是法。",
        "translation": "The bodhisattva Mahāsattva also teaches the śrāvaka teachings, but he doesn't grasp them.",
        "source": "T08n0228_021:0659c24_24"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659c25_25"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是學者，能為一切世間天、人、阿修羅等作大福田，而菩薩所作福田最上最勝，",
        "translation": "If a bodhisattva Mahāsattva thus learns, he can create great fields of merit for all the gods, humans, and asuras of the world, while the bodhisattva's created fields of merit are the highest and most excellent.",
        "source": "T08n0228_021:0659c26_26"
    },
    {
        "source_sentence": "過餘聲聞、緣覺所有福田。",
        "translation": "They surpass the other fields of merit possessed by śrāvakas and pratyekbuddhas.",
        "source": "T08n0228_021:0659c28_27"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0659c28_28"
    },
    {
        "source_sentence": "如是學者是行般若波羅蜜多，得近一切智，不捨般若波羅蜜多，不離般若波羅蜜多。",
        "translation": "Thus, this scholar practices the perfection of prajñāpāramitā and attains omniscience, doesn't abandon the perfection of prajñāpāramitā, and doesn't part from the perfection of prajñāpāramitā.",
        "source": "T08n0228_021:0659c29_29"
    },
    {
        "source_sentence": "如是學者不退失一切智，遠離聲聞、緣覺心，得近阿耨多羅三藐三菩提。",
        "translation": "Such a learner doesn't regress from omniscience, parts with the minds of śrāvakas and pratyekbuddhas, and attains near unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0228_021:0660a02_0"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0660a03_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩作是念：『此是般若波羅蜜多，此名般若波羅蜜多，學是般若波羅蜜多故當得一切智。』",
        "translation": "Suppose a bodhisattva-mahāsattva thinks, 'This is the perfection of wisdom, which is called the perfection of wisdom, and if he trains in this perfection of wisdom, he'll attain omniscience.'",
        "source": "T08n0228_021:0660a03_2"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0660a06_3"
    },
    {
        "source_sentence": "若如是分別者，不名修學般若波羅蜜多。",
        "translation": "If someone thus discriminates, they aren't called cultivating the perfection of wisdom.",
        "source": "T08n0228_021:0660a06_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩於般若波羅蜜多不生分別，無知無見亦無所得，以如是不分別、無知見、無所得故，",
        "translation": "If the bodhisattva Mahāsattva doesn't discriminate between the perfection of wisdom and the absence of knowledge, views, and attainments, it's because he thus doesn't discriminate, has no knowing or seeing, and has no attainment.",
        "source": "T08n0228_021:0660a07_5"
    },
    {
        "source_sentence": "是名修學般若波羅蜜多。」",
        "translation": "This is called cultivating the perfection of wisdom.",
        "source": "T08n0228_021:0660a09_6"
    },
    {
        "source_sentence": "幻喻品第二十六",
        "translation": "Chapter 26 of the Parable of the Illusory Metaphor",
        "source": "T08n0228_021:0660a11_0"
    },
    {
        "source_sentence": "爾時，帝釋天主即起是念：「若菩薩摩訶薩修學是般若波羅蜜多者，尚能勝過一切眾生，",
        "translation": "At that point, Indra the lord of the gods had this thought, If a bodhisattva Mahāsattva cultivates this perfection of wisdom, he'll still be able to surpass all sentient beings.",
        "source": "T08n0228_021:0660a12_0"
    },
    {
        "source_sentence": "何況成就阿耨多羅三藐三菩提者。",
        "translation": "How could it be that someone who has accomplished unsurpassed, correct, and complete enlightenment?",
        "source": "T08n0228_021:0660a14_0"
    },
    {
        "source_sentence": "是故當知，若有人愛樂一切智者，彼人得大善利善自活命，何況能發阿耨多羅三藐三菩提心者，",
        "translation": "Therefore, you should know that if someone loves omniscience, they'll attain great benefit and good livelihood, so why wouldn't they be able to give rise to the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T08n0228_021:0660a14_1"
    },
    {
        "source_sentence": "當知是人為一切眾生共所敬愛，普能調御一切眾生。」",
        "translation": "You should know that this person is respected and loved by all sentient beings and can universally tame all sentient beings.",
        "source": "T08n0228_021:0660a17_2"
    },
    {
        "source_sentence": "帝釋天主作是念已，即時化諸曼陀羅華，滿自掌中散於佛上。",
        "translation": "After he had this thought, Indra the lord of the gods immediately transformed the maṇḍala flowers and scattered them over the Buddha in his own palm.",
        "source": "T08n0228_021:0660a18_3"
    },
    {
        "source_sentence": "華散佛已，合掌向佛作如是言：「世尊！",
        "translation": "After the Flower Scattering Buddha had scattered it, he joined his palms and said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0660a19_4"
    },
    {
        "source_sentence": "若有發阿耨多羅三藐三菩提心者，普願得成阿耨多羅三藐三菩提，普願圓滿一切佛法，",
        "translation": "Those who have set their minds on unexcelled complete perfect enlightenment universally wish to attain unexcelled complete perfect enlightenment, and universally wish to fulfill all the buddha-teachings.",
        "source": "T08n0228_021:0660a20_5"
    },
    {
        "source_sentence": "圓滿一切智相應之法，圓滿自然智法，圓滿無漏法，普願一切眾生度生死岸證涅槃道，",
        "translation": "Fulfilling the principle associated with omniscience, fulfilling the principle of natural knowledge, perfecting the uncontaminated principle, wishing all sentient beings to cross the shore of birth and death and realize the path of nirvana.",
        "source": "T08n0228_021:0660a22_6"
    },
    {
        "source_sentence": "攝眾生心普令圓滿。",
        "translation": "He collects the minds of sentient beings and makes them all perfect.",
        "source": "T08n0228_021:0660a24_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0228_021:0660a25_8"
    },
    {
        "source_sentence": "我見生死中有種種苦，我不欲令初發阿耨多羅三藐三菩提心者，於一念中有所退轉，",
        "translation": "I see various kinds of suffering in birth and death, but I don't want to cause those who first give rise to the mind of unsurpassed, correct, and complete enlightenment to regress in a single thought.",
        "source": "T08n0228_021:0660a25_9"
    },
    {
        "source_sentence": "又不欲令已得安住阿耨多羅三藐三菩提者，於一念中或生退轉，是故我欲普令成就阿耨多羅三藐三菩提。",
        "translation": "Also, I don't want to cause someone who has attained and abided in unsurpassed perfect enlightenment to sometimes regress in a single thought; therefore, I want to cause them to attain unsurpassed perfect enlightenment.",
        "source": "T08n0228_021:0660a27_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0660a29_11"
    },
    {
        "source_sentence": "能發心者，廣大利益悲愍一切世間天、人、阿修羅等。",
        "translation": "Those who can give rise to the mind are vastly benefiting and pitying all the gods, humans, asuras, and asuras of the world.",
        "source": "T08n0228_021:0660a29_12"
    },
    {
        "source_sentence": "自得度已，復於一切眾生起如是心，未解脫者普令解脫，未得度者普令得度，",
        "translation": "Having liberated themselves, they also develop this kind of mind toward all sentient beings. Causing those who are not liberated to be liberated, they cause those who are not liberated to be liberated; causing those who have not yet liberated to be liberated to attain liberation.",
        "source": "T08n0228_021:0660b02_13"
    },
    {
        "source_sentence": "未涅槃者普令涅槃。",
        "translation": "Those who haven't yet attained nirvāṇa will universally attain nirvāṇa.",
        "source": "T08n0228_021:0660b03_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0228_021:0660b04_15"
    },
    {
        "source_sentence": "若有善男子、善女人，於初發心菩薩所，以彼所有諸功德法生隨喜心，",
        "translation": "“Furthermore, if there are sons and daughters of a virtuous family who give rise to the aspiration for enlightenment in the presence of an enlightening being or bodhisattva who has set out for enlightenment, they will be delighted with all their virtues.",
        "source": "T08n0228_021:0660b04_16"
    },
    {
        "source_sentence": "若於久修習菩薩所生隨喜心，若於住不退轉菩薩所生隨喜心，若於一生補處菩薩所生隨喜心，",
        "translation": "“Great enlightening beings give rise to feelings of joy at the accomplishment of long-practicing enlightening beings; they give rise to feelings of joy at the accomplishment of enlightening beings who abide in nonregression; and they give rise to feelings of joy at the accomplishment of enlightening beings’ one-pointed concentration.",
        "source": "T08n0228_021:0660b06_0"
    },
    {
        "source_sentence": "於如是等能生隨喜心善男子、善女人，當說何者得福德多？」",
        "translation": "Good men and good women who can give rise to the mind of following joy in such things, which one should be described as having much merit?",
        "source": "T08n0228_021:0660b08_1"
    },
    {
        "source_sentence": "佛告帝釋天主言：「憍尸迦！",
        "translation": "The Buddha told Śakra Devānām-Indra, Kauśika!",
        "source": "T08n0228_021:0660b10_0"
    },
    {
        "source_sentence": "妙高山王尚可稱量知其限數，彼善男子、善女人以是諸隨喜心所獲福德，",
        "translation": "The king of the wonderful high mountains can still be measured and known by measuring his number, but those good men and good women attain merit with joyful thoughts like this.",
        "source": "T08n0228_021:0660b10_1"
    },
    {
        "source_sentence": "不可稱量知其限數。",
        "translation": "They can't be measured and known to be limited.",
        "source": "T08n0228_021:0660b12_2"
    },
    {
        "source_sentence": "「憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0228_021:0660b13_0"
    },
    {
        "source_sentence": "又如四大洲界亦可稱量知其限數，彼善男子、善女人以是諸隨喜心所獲福德，",
        "translation": "Good men and good women, just as the four continents of the great eon can be measured by measuring their number, so those sons and daughters of a virtuous family will attain that virtue through joyful thought.",
        "source": "T08n0228_021:0660b13_1"
    },
    {
        "source_sentence": "不可稱量知其限數。",
        "translation": "They can't be measured and known to be limited.",
        "source": "T08n0228_021:0660b15_0"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0228_021:0660b15_1"
    },
    {
        "source_sentence": "又如小千世界亦可稱量知其限數，彼善男子、善女人，以是諸隨喜心所獲福德，",
        "translation": "“Furthermore, just as a small chiliocosm can be measured and known in terms of its limits, so those sons and daughters of a virtuous family will attain the virtues attained by joyfulness.",
        "source": "T08n0228_021:0660b15_2"
    },
    {
        "source_sentence": "不可稱量知其限數。",
        "translation": "They can't be measured and known to be limited.",
        "source": "T08n0228_021:0660b17_3"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0228_021:0660b17_4"
    },
    {
        "source_sentence": "又如中千世界亦可稱量知其限數，彼善男子、善女人以是諸隨喜心所獲福德，",
        "translation": "Good men and good women, by means of these merits gained through joyful thought they may know the number of worlds in the universe Abhirati.",
        "source": "T08n0228_021:0660b18_5"
    },
    {
        "source_sentence": "不可稱量知其限數。",
        "translation": "They can't be measured and known to be limited.",
        "source": "T08n0228_021:0660b19_6"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0228_021:0660b20_7"
    },
    {
        "source_sentence": "又如三千大千世界亦可稱量知其限數，彼善男子、善女人以是諸隨喜心所獲福德，",
        "translation": "“Furthermore, just as the great manifold cosmos consists of a trichiliocosm and can be measured in terms of its extent, so too those sons and daughters of virtuous families will attain virtue by means of joyful thoughts.",
        "source": "T08n0228_021:0660b20_8"
    },
    {
        "source_sentence": "不可稱量知其限數。」",
        "translation": "They can't be measured and known to be limited.",
        "source": "T08n0228_021:0660b22_9"
    },
    {
        "source_sentence": "帝釋天主白佛言：「世尊！",
        "translation": "Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0660b23_0"
    },
    {
        "source_sentence": "若有人不能於初發心菩薩所，乃至不能於一生補處菩薩所，生隨喜心者，",
        "translation": "“Furthermore, if someone is unable to give rise to a feeling of joy at the enlightening being’s initial determination for enlightenment, or even at the enlightening being’s place of one-pointed concentration.",
        "source": "T08n0228_021:0660b23_1"
    },
    {
        "source_sentence": "當知是人惡魔所著、為魔眷屬，從彼魔天命終而來生此。",
        "translation": "You should know that this person is attached to bad demons and belongs to their retinues, and they're born here from the Māra gods at the end of their life.",
        "source": "T08n0228_021:0660b25_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0660b26_3"
    },
    {
        "source_sentence": "是諸隨喜心而能破壞諸惡魔故。",
        "translation": "It's because they follow the mind of joy and are able to destroy bad demons.",
        "source": "T08n0228_021:0660b26_4"
    },
    {
        "source_sentence": "又復，若人能生諸隨喜心者，是人應以隨喜功德迴向阿耨多羅三藐三菩提，",
        "translation": "Furthermore, if someone can give rise to thoughts of delight, they should dedicate the merit of delight back to unexcelled complete perfect enlightenment.",
        "source": "T08n0228_021:0660b27_5"
    },
    {
        "source_sentence": "以是迴向故而能增長阿耨多羅三藐三菩提。",
        "translation": "Because of this dedication, he's able to increase unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0228_021:0660b29_6"
    },
    {
        "source_sentence": "是故當知，能生如是諸隨喜心者，是人不離佛、不離法、不離僧，增長一切最勝功德。」",
        "translation": "Therefore, you should know that someone who can give rise to such a mind of subsequent joy doesn't part from the Buddha, the Dharma, or the saṃgha, and increases all their most excellent qualities.",
        "source": "T08n0228_021:0660c01_7"
    },
    {
        "source_sentence": "佛告帝釋天主言：「如是，如是！",
        "translation": "The Buddha told Śakra Devānām-Indra, So it is, so it is!",
        "source": "T08n0228_021:0660c04_0"
    },
    {
        "source_sentence": "憍尸迦！",
        "translation": "Kauśika!",
        "source": "T08n0228_021:0660c04_1"
    },
    {
        "source_sentence": "若有人能生如是諸隨喜心者，是人不離佛、不離法、不離僧，增長一切最勝功德。",
        "translation": "If someone can give rise to such a mind of joy, that person doesn't part from the Buddha, the Dharma, or the saṃgha, and increases all their most excellent qualities.",
        "source": "T08n0228_021:0660c04_2"
    },
    {
        "source_sentence": "又，憍尸迦！",
        "translation": "Also, Kauśika!",
        "source": "T08n0228_021:0660c06_3"
    },
    {
        "source_sentence": "若善男子、善女人能生如是諸隨喜心者，當知是善男子、善女人速得值佛。」",
        "translation": "If good men and good women can give rise to such joyful thoughts, you should know that these good men and good women will quickly meet the Buddha.",
        "source": "T08n0228_021:0660c06_4"
    },
    {
        "source_sentence": "帝釋天主白佛言：「如是，世尊！",
        "translation": "Śakra Devānām-Indra said to the Buddha, So it is, Bhagavān!",
        "source": "T08n0228_021:0660c09_0"
    },
    {
        "source_sentence": "如是，善逝！",
        "translation": "So it is, Sugata!",
        "source": "T08n0228_021:0660c09_1"
    },
    {
        "source_sentence": "善男子、善女人能生如是諸隨喜心者，是善男子、善女人速得值佛。",
        "translation": "Good men and good women who can give rise to such joyful thoughts are good men and good women who will quickly meet the Buddha.",
        "source": "T08n0228_021:0660c09_2"
    },
    {
        "source_sentence": "又復，以是隨喜善根力故，在在所生人所尊重恭敬讚歎。",
        "translation": "Again, it's because of the power of the good root of following joy that they are honored, respected, venerated, and praised by people everywhere who are born.",
        "source": "T08n0228_021:0660c11_3"
    },
    {
        "source_sentence": "是善男子、善女人，眼根清淨不觀惡色，耳根清淨不聞惡聲，鼻根清淨不嗅惡香，",
        "translation": "Good men and good women, the eye faculty is pure, not observing bad forms; the ear faculty is pure, not hearing bad sounds; and the nose faculty is pure, not smelling bad odors.",
        "source": "T08n0228_021:0660c12_4"
    },
    {
        "source_sentence": "舌根清淨不了惡味，身根清淨不染非觸。",
        "translation": "The tongue faculty is pure and doesn't taste bad, and the body faculty is pure and undefiled by what's not touched.",
        "source": "T08n0228_021:0660c14_5"
    },
    {
        "source_sentence": "又復，不墮惡趣，生人、天道。",
        "translation": "Again, they won't fall into bad destinies and be born in the human or heavenly realms.",
        "source": "T08n0228_021:0660c15_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0660c16_7"
    },
    {
        "source_sentence": "是善男子、善女人成就無量無數隨喜善根故，常樂利樂一切眾生，以能生是隨喜心故，",
        "translation": "Because these sons and daughters of a virtuous family have accumulated immeasurable, countless roots of goodness that are accompanied by joy. They always delight in benefiting all sentient beings because they can give rise to such thoughts of joy.",
        "source": "T08n0228_021:0660c16_8"
    },
    {
        "source_sentence": "而能增長阿耨多羅三藐三菩提行，漸漸得成阿耨多羅三藐三菩提。",
        "translation": "They can then increase the practice of unsurpassed, correct, and complete enlightenment and gradually attain unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0228_021:0660c18_9"
    },
    {
        "source_sentence": "是善男子、善女人得菩提已，廣度無量無數眾生普令涅槃。」",
        "translation": "After attaining enlightenment, these good men and good women will extensively liberate measureless and countless sentient beings and cause them to enter nirvāṇa.",
        "source": "T08n0228_021:0660c19_10"
    },
    {
        "source_sentence": "佛告帝釋天主言：「憍尸迦！",
        "translation": "The Buddha told Śakra Devānām-Indra, Kauśika!",
        "source": "T08n0228_021:0660c22_0"
    },
    {
        "source_sentence": "如汝所說，皆是如來威神護念。",
        "translation": "As you say, it's all the Tathāgata's authoritative and protective mindfulness.",
        "source": "T08n0228_021:0660c22_1"
    },
    {
        "source_sentence": "若善男子、善女人能生如是諸隨喜心者，是善男子、善女人深種善根，",
        "translation": "If good men and good women can give rise to such thoughts of joy, they are good men and good women who deeply cultivate good roots.",
        "source": "T08n0228_021:0660c23_2"
    },
    {
        "source_sentence": "以是善根廣為無量無數眾生作大利益。",
        "translation": "Because these good roots are so vast, they create great benefits for measureless and countless sentient beings.",
        "source": "T08n0228_021:0660c24_3"
    },
    {
        "source_sentence": "此因緣故，而能增長一切善法，漸漸得成阿耨多羅三藐三菩提。」",
        "translation": "Because of these causes and conditions, they can grow all good qualities and gradually attain unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0228_021:0660c25_4"
    },
    {
        "source_sentence": "爾時，尊者須菩提白佛言：「世尊！",
        "translation": "At that point, Venerable Subhūti said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0660c28_0"
    },
    {
        "source_sentence": "心如幻故，云何以是心得阿耨多羅三藐三菩提耶？」",
        "translation": "Because the mind is illusory, how can we attain unsurpassed, correct, and complete enlightenment with this mind?",
        "source": "T08n0228_021:0660c28_1"
    },
    {
        "source_sentence": "佛告尊者須菩提言：「於意云何，汝見有心如幻耶？」",
        "translation": "The Buddha told Venerable Subhūti, What do you think, do you see mind as illusory?",
        "source": "T08n0228_021:0660c29_2"
    },
    {
        "source_sentence": "須菩提言：「不也，世尊！」",
        "translation": "Suppository said, No, Bhagavān!",
        "source": "T08n0228_021:0661a02_0"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0661a02_1"
    },
    {
        "source_sentence": "汝見幻相可得耶？」",
        "translation": "Do you see illusory characteristics that can be obtained?",
        "source": "T08n0228_021:0661a02_2"
    },
    {
        "source_sentence": "須菩提言：「不也，世尊！",
        "translation": "Suppository said, No, Bhagavān!",
        "source": "T08n0228_021:0661a03_3"
    },
    {
        "source_sentence": "我不見有心如幻，亦不見幻相可得。」",
        "translation": "I don't see mind as illusory, and I don't see illusory characteristics that can be obtained.",
        "source": "T08n0228_021:0661a03_4"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0661a04_5"
    },
    {
        "source_sentence": "汝以是心是相可得阿耨多羅三藐三菩提耶？」",
        "translation": "Is it because of this mind that you can attain supreme perfect enlightenment?",
        "source": "T08n0228_021:0661a04_6"
    },
    {
        "source_sentence": "須菩提言：「不也，世尊！」",
        "translation": "Suppository said, No, Bhagavān!",
        "source": "T08n0228_021:0661a05_7"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0661a06_8"
    },
    {
        "source_sentence": "於意云何，若不見有心如幻及幻相者，離是心是相，汝見有法可得阿耨多羅三藐三菩提耶？」",
        "translation": "What do you think, if you don't see that mind has illusory and illusory characteristics like illusions and that it's free of these mental characteristics, do you see any way to attain unsurpassed, correct, and complete enlightenment?",
        "source": "T08n0228_021:0661a06_9"
    },
    {
        "source_sentence": "須菩提言：「不也，世尊！",
        "translation": "Suppository said, No, Bhagavān!",
        "source": "T08n0228_021:0661a08_10"
    },
    {
        "source_sentence": "離如幻心及彼幻相，亦不見有法可得阿耨多羅三藐三菩提。",
        "translation": "Being free of illusory minds and their illusory characteristics, they don't see any dharma that can attain unsurpassed, correct, or complete enlightenment.",
        "source": "T08n0228_021:0661a09_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0228_021:0661a10_12"
    },
    {
        "source_sentence": "若離如幻心及離幻相有法可見者，是法亦不可說是有是無，是故一切法畢竟離中，",
        "translation": "If there are dharmas that can be seen apart from illusory minds like these and apart from the characteristics of illusions, then this dharma also cannot be said to exist or not. That is why all dharmas are ultimately free:",
        "source": "T08n0228_021:0661a10_13"
    },
    {
        "source_sentence": "不可說有不可說無。",
        "translation": "It can't be described as existence and can't be described as nonexistence.",
        "source": "T08n0228_021:0661a12_14"
    },
    {
        "source_sentence": "若一切法畢竟離故，阿耨多羅三藐三菩提亦畢竟離，般若波羅蜜多亦畢竟離。",
        "translation": "If all things are ultimately free, then unsurpassed, correct, and complete enlightenment is also ultimately free, and the prajñāpāramitā is also ultimately free.",
        "source": "T08n0228_021:0661a13_15"
    },
    {
        "source_sentence": "以一切法畢竟離故，即無法可修亦無法可得，以一切法無所得故，阿耨多羅三藐三菩提亦不可得。",
        "translation": "Because all things are ultimately free, there's nothing to cultivate and nothing to attain, and because all things lack attainment, unsurpassed, correct, and complete enlightenment is also unobtainable.",
        "source": "T08n0228_021:0661a15_16"
    },
    {
        "source_sentence": "以是畢竟離故菩薩摩訶薩亦畢竟離。",
        "translation": "Because it's ultimately free, the bodhisattva Mahāsattva is also ultimately free.",
        "source": "T08n0228_021:0661a17_17"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0228_021:0661a18_18"
    },
    {
        "source_sentence": "菩薩摩訶薩因般若波羅蜜多故，得阿耨多羅三藐三菩提。",
        "translation": "Because of the perfection of wisdom, the bodhisattva Mahāsattva attains unsurpassed, correct, and complete enlightenment.",
        "source": "T08n0228_021:0661a18_19"
    },
    {
        "source_sentence": "而菩薩摩訶薩畢竟離，阿耨多羅三藐三菩提亦畢竟離。",
        "translation": "The bodhisattva Mahāsattva is ultimately free, and unsurpassed, correct, and complete enlightenment is also ultimately free.",
        "source": "T08n0228_021:0661a19_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩得阿耨多羅三藐三菩提者，云何以離得離耶？」",
        "translation": "If a bodhisattva-mahāsattva attains unsurpassed, correct, and complete enlightenment, how can he attain it by being free of it?",
        "source": "T08n0228_021:0661a21_21"
    },
    {
        "source_sentence": "佛讚須菩提言：「善哉，善哉！",
        "translation": "The Buddha praised Suppository, saying, Good, good!",
        "source": "T08n0228_021:0661a23_0"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0661a23_1"
    },
    {
        "source_sentence": "如是，如是！",
        "translation": "So it is, so it is!",
        "source": "T08n0228_021:0661a23_2"
    },
    {
        "source_sentence": "一切法畢竟離，般若波羅蜜多亦畢竟離，阿耨多羅三藐三菩提亦畢竟離，",
        "translation": "All things are ultimately free, the prajñāpāramitā is also ultimately free, and unsurpassed, correct enlightenment is also ultimately free.",
        "source": "T08n0228_021:0661a24_0"
    },
    {
        "source_sentence": "菩薩摩訶薩亦畢竟離。",
        "translation": "The bodhisattva Mahāsattva is also ultimately free of it.",
        "source": "T08n0228_021:0661a25_1"
    },
    {
        "source_sentence": "而諸菩薩摩訶薩於是法中，如實了知般若波羅蜜多畢竟離故，即非般若波羅蜜多。",
        "translation": "In this teaching, the bodhisattvas, mahāsattvas, and bodhisattvas truly understand that the perfection of wisdom is ultimately free, which is not the perfection of wisdom.",
        "source": "T08n0228_021:0661a26_2"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0661a28_3"
    },
    {
        "source_sentence": "是故諸菩薩摩訶薩，雖因般若波羅蜜多故得阿耨多羅三藐三菩提，而於是中無法可取、無法可得。",
        "translation": "Therefore, even though bodhisattvas and mahāsattvas attain unsurpassed, correct, and complete enlightenment because of the perfection of wisdom, there's nothing to grasp and nothing to attain in them.",
        "source": "T08n0228_021:0661a28_4"
    },
    {
        "source_sentence": "以無取無得故，菩薩摩訶薩雖得阿耨多羅三藐三菩提，而非以離得離。」",
        "translation": "Because there's no grasping and no attainment, even though the bodhisattva Mahāsattva attains unsurpassed, correct, and complete enlightenment, it's not because of separation that he attains separation.",
        "source": "T08n0228_021:0661b01_5"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0661b04_0"
    },
    {
        "source_sentence": "如我解佛所說義，此甚深義菩薩摩訶薩行者是為甚難。」",
        "translation": "As I understand the meaning of what the Buddha teaches, it's very difficult for a bodhisattva-mahāsattva to practice this profound meaning.",
        "source": "T08n0228_021:0661b04_1"
    },
    {
        "source_sentence": "佛言：「須菩提！",
        "translation": "The Buddha said, Subhūti!",
        "source": "T08n0228_021:0661b05_2"
    },
    {
        "source_sentence": "如是，如是！",
        "translation": "So it is, so it is!",
        "source": "T08n0228_021:0661b06_3"
    },
    {
        "source_sentence": "此甚深義菩薩摩訶薩行者是為甚難。",
        "translation": "This profound meaning of the bodhisattva-mahāsattva's practice is very difficult.",
        "source": "T08n0228_021:0661b06_4"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T08n0228_021:0661b07_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩行此甚深義者，不於中道取證聲聞、緣覺之果，斯為甚難。」",
        "translation": "If bodhisattvas, mahāsattvas, and practitioners of this profound meaning don't attain the fruit of śrāvakas and pratyekbuddhas in the middle way, it would be very difficult.",
        "source": "T08n0228_021:0661b07_6"
    },
    {
        "source_sentence": "須菩提白佛言：「世尊！",
        "translation": "Suppository said to the Buddha, Bhagavān!",
        "source": "T08n0228_021:0661b09_0"
    },
    {
        "source_sentence": "如我解佛所說義，菩薩摩訶薩所為非難。",
        "translation": "As I understand the meaning of what the Buddha teaches, it's not difficult for a bodhisattva-mahāsattva to do so.",
        "source": "T08n0228_021:0661b09_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661b10_2"
    },
    {
        "source_sentence": "一切法無所得無所證。",
        "translation": "All dharmas lack attainment and nothing is realized.",
        "source": "T08n0228_021:0661b10_3"
    },
    {
        "source_sentence": "以無得無證故，是中無證者、無所證、無所用證法，是故菩薩摩訶薩所為非難。",
        "translation": "Because there's no attainment and no realization, this is the absence of realization, nothing to realize, and nothing to use to realize the teaching; therefore, what the bodhisattva Mahāsattva does is not difficult.",
        "source": "T08n0228_021:0661b11_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0228_021:0661b12_5"
    },
    {
        "source_sentence": "若菩薩摩訶薩聞作是說，不驚不怖不退不沒者，當知彼菩薩摩訶薩是為行般若波羅蜜多。",
        "translation": "If a bodhisattva Mahāsattva hears this teaching and isn't frightened, doesn't fear it, doesn't retreat, and doesn't fall back, you should know that the bodhisattva Mahāsattva is practicing the perfection of prajñāpāramitā.",
        "source": "T08n0228_021:0661b13_0"
    },
    {
        "source_sentence": "雖如是行，亦不見我行般若波羅蜜多。",
        "translation": "Even though they practice in this way, they don't see me practicing the perfection of wisdom.",
        "source": "T08n0228_021:0661b15_1"
    },
    {
        "source_sentence": "若如是不見所行般若波羅蜜多相故，是菩薩摩訶薩得近阿耨多羅三藐三菩提，",
        "translation": "If someone doesn't thus see the mark of the prajñāpāramitā practiced, this is the bodhisattva-mahāsattva who attains near unexcelled complete perfect enlightenment.",
        "source": "T08n0228_021:0661b16_0"
    },
    {
        "source_sentence": "即能遠離聲聞、緣覺之地，是行般若波羅蜜多。",
        "translation": "Being able to be far removed from the land of śrāvakas and pratyekbuddhas is practicing the perfection of prajñāpāramitā.",
        "source": "T08n0228_021:0661b17_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0228_021:0661b18_2"
    },
    {
        "source_sentence": "譬如虛空不作是念：『是遠是近？』",
        "translation": "It's like space that doesn't think, 'Is it distant or near?'",
        "source": "T08n0228_021:0661b19_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661b19_4"
    },
    {
        "source_sentence": "虛空無分別故。",
        "translation": "It's because space has no discrimination.",
        "source": "T08n0228_021:0661b19_5"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，不作是念：『阿耨多羅三藐三菩提去我近，聲聞、緣覺地去我遠。』",
        "translation": "The prajñāpāramitā is likewise, and they don't think, 'Anuttara samyak-saṃbodhicitta is far from me, and the stages of śrāvakas and pratyekbuddhas are far from me.'",
        "source": "T08n0228_021:0661b20_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661b22_7"
    },
    {
        "source_sentence": "般若波羅蜜多無分別故。",
        "translation": "It's because the prajñāpāramitā has no discrimination.",
        "source": "T08n0228_021:0661b22_8"
    },
    {
        "source_sentence": "又如幻所化人不作是念：『彼幻師去我近，餘觀者去我遠。』",
        "translation": "It's also like a person transformed by an illusion who doesn't think, 'That illusionist is far removed from me, and the other contemplators are far removed from me.'",
        "source": "T08n0228_021:0661b23_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661b24_10"
    },
    {
        "source_sentence": "幻所化人無分別故。",
        "translation": "It's because the people transformed by illusion have no discrimination.",
        "source": "T08n0228_021:0661b24_11"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，不作是念：『阿耨多羅三藐三菩提去我近，聲聞、緣覺地去我遠。』",
        "translation": "The prajñāpāramitā is likewise, and they don't think, 'Anuttara samyak-saṃbodhicitta is far from me, and the stages of śrāvakas and pratyekbuddhas are far from me.'",
        "source": "T08n0228_021:0661b25_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661b27_13"
    },
    {
        "source_sentence": "般若波羅蜜多無分別故。",
        "translation": "It's because the prajñāpāramitā has no discrimination.",
        "source": "T08n0228_021:0661b27_14"
    },
    {
        "source_sentence": "又如諸影不作是念：『影所因者去我近，非所因者去我遠。』",
        "translation": "It's also like when the shadows don't think, 'The shadow that is the cause of the shadow goes far away from me, and what's not the cause is far away from me.'",
        "source": "T08n0228_021:0661b27_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661b29_16"
    },
    {
        "source_sentence": "影無分別故。",
        "translation": "It's because the shadow has no discrimination.",
        "source": "T08n0228_021:0661b29_17"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，不作是念：『阿耨多羅三藐三菩提去我近，聲聞、緣覺地去我遠。』",
        "translation": "The prajñāpāramitā is likewise, and they don't think, 'Anuttara samyak-saṃbodhicitta is far from me, and the stages of śrāvakas and pratyekbuddhas are far from me.'",
        "source": "T08n0228_021:0661b29_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c02_19"
    },
    {
        "source_sentence": "般若波羅蜜多無分別故。",
        "translation": "It's because the prajñāpāramitā has no discrimination.",
        "source": "T08n0228_021:0661c02_20"
    },
    {
        "source_sentence": "又如如來於一切眾生無憎無愛。",
        "translation": "It's also like the Tathāgata who has no hatred or craving for all sentient beings.",
        "source": "T08n0228_021:0661c03_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c04_22"
    },
    {
        "source_sentence": "如來一切憎愛斷故。",
        "translation": "It's because all the Tathāgata's hatred and craving are stopped.",
        "source": "T08n0228_021:0661c04_23"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，無憎無愛。",
        "translation": "The prajñāpāramitā is likewise, with neither hatred nor craving.",
        "source": "T08n0228_021:0661c04_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c05_25"
    },
    {
        "source_sentence": "般若波羅蜜多非憎愛法。",
        "translation": "The prajñāpāramitā is not a hateful dharma.",
        "source": "T08n0228_021:0661c05_26"
    },
    {
        "source_sentence": "又如如來離諸分別。",
        "translation": "It's also like when the Tathāgata is free of discrimination.",
        "source": "T08n0228_021:0661c06_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c06_28"
    },
    {
        "source_sentence": "如來一切分別斷故。",
        "translation": "It's because all the Tathāgata's discriminations are stopped.",
        "source": "T08n0228_021:0661c07_0"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，離諸分別。",
        "translation": "The prajñāpāramitā is likewise, free of discrimination.",
        "source": "T08n0228_021:0661c07_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c08_2"
    },
    {
        "source_sentence": "般若波羅蜜多無分別故。",
        "translation": "It's because the prajñāpāramitā has no discrimination.",
        "source": "T08n0228_021:0661c08_3"
    },
    {
        "source_sentence": "又如佛所化人不作是念：『阿耨多羅三藐三菩提去我近，聲聞、緣覺地去我遠。』",
        "translation": "Also, just as the Buddha's transformed people don't think, 'Anuttara samyaksarrzbodhi is far removed from me, and the stages of śrāvakas and pratyekbuddhas are far removed from me.'",
        "source": "T08n0228_021:0661c09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c10_5"
    },
    {
        "source_sentence": "化人無分別故。",
        "translation": "It's because the transformation of people has no discrimination.",
        "source": "T08n0228_021:0661c11_0"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，不作是念：『阿耨多羅三藐三菩提去我近，聲聞、緣覺地去我遠。』",
        "translation": "The prajñāpāramitā is likewise, and they don't think, 'Anuttara samyak-saṃbodhicitta is far from me, and the stages of śrāvakas and pratyekbuddhas are far from me.'",
        "source": "T08n0228_021:0661c11_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c13_2"
    },
    {
        "source_sentence": "般若波羅蜜多無分別故。",
        "translation": "It's because the prajñāpāramitā has no discrimination.",
        "source": "T08n0228_021:0661c13_3"
    },
    {
        "source_sentence": "又如佛所化人隨所作事悉能成辦，雖所成辦而無分別。",
        "translation": "Also, just as the person transformed by the Buddha can accomplish whatever he does, even though he accomplishes it, there's no discrimination.",
        "source": "T08n0228_021:0661c14_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c15_5"
    },
    {
        "source_sentence": "化人無分別故。",
        "translation": "It's because the transformation of people has no discrimination.",
        "source": "T08n0228_021:0661c15_6"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，若一切法隨所修習悉能成辦。",
        "translation": "The prajñāpāramitā is likewise, and if all the teachings are cultivated accordingly, they can be accomplished.",
        "source": "T08n0228_021:0661c15_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c17_8"
    },
    {
        "source_sentence": "般若波羅蜜多無分別故。",
        "translation": "It's because the prajñāpāramitā has no discrimination.",
        "source": "T08n0228_021:0661c17_9"
    },
    {
        "source_sentence": "又如工巧師，以其方便用機關木作男女相，隨所作事悉能成辦，雖所成辦而無分別。",
        "translation": "It's also like a skilled master of the arts who uses his skillful means to create male and female characteristics with mechanical wood, and he can accomplish whatever he does without discrimination even though he accomplishes it.",
        "source": "T08n0228_021:0661c18_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c19_1"
    },
    {
        "source_sentence": "巧幻所作故。",
        "translation": "It's because it's created by skillful illusion.",
        "source": "T08n0228_021:0661c20_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T08n0228_021:0661c20_3"
    },
    {
        "source_sentence": "般若波羅蜜多亦復如是，若一切法隨所修習悉能成辦，雖有所成而無分別。",
        "translation": "The prajñāpāramitā is likewise, for if all things can be accomplished according to what they cultivate, there's no discrimination even though they are accomplished.",
        "source": "T08n0228_021:0661c20_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T08n0228_021:0661c22_5"
    },
    {
        "source_sentence": "般若波羅蜜多無分別故。」",
        "translation": "It's because the prajñāpāramitā has no discrimination.",
        "source": "T08n0228_021:0661c22_6"
    },
    {
        "source_sentence": "佛說佛母出生三法藏般若波羅蜜多經卷第二十一",
        "translation": "Foshuo fomu give birth to the three collections of teachings, prajñāpāramitā jing, vol. 21",
        "source": "T08n0228_021:0661c24_0"
    }
]