[
    {
        "source_sentence": "大方廣佛華嚴經卷第三十一",
        "translation": "Dafangguang fo huayan jing, vol. 31",
        "source": "T09n0278_031:0595b02_0"
    },
    {
        "source_sentence": "東晉天竺三藏佛馱跋陀羅譯",
        "translation": "Translated by the Tripiṭaka Master Buddhabhadra of India in the Eastern Jin Dynasty",
        "source": "T09n0278_031:0595b04_0"
    },
    {
        "source_sentence": "佛不思議法品第二十八之二",
        "translation": "The Twenty-eighth and Second Part of the Inconceivable Dharma Chapter of the Buddha",
        "source": "T09n0278_031:0595b05_0"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0595b06_0"
    },
    {
        "source_sentence": "一切諸佛，有十種佛事，無量無邊不可思議，一切天人，不能稱量，三世一切聲聞、緣覺所不能說，",
        "translation": "All buddhas have ten kinds of Buddha-works, which are immeasurable, limitless, and inconceivable. All gods and humans cannot measure them; they cannot be described by any śrāvakas or pratyekabuddhas of",
        "source": "T09n0278_031:0595b06_1"
    },
    {
        "source_sentence": "除佛神力。",
        "translation": "It's except for the Buddha's miraculous power.",
        "source": "T09n0278_031:0595b08_2"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0595b08_3"
    },
    {
        "source_sentence": "一切諸佛，於無量無邊虛空、法界等一切世界兜率天上，修菩薩行而作佛事。",
        "translation": "All the buddhas cultivate the bodhisattva practices and perform buddha-works in measureless, limitless space, the Dharma realm, and all the other worlds in Tuṣita Heaven.",
        "source": "T09n0278_031:0595b08_4"
    },
    {
        "source_sentence": "無量妙色、無量功德、無量光明、無量音聲、無量清淨音聲、無量三昧、無量智慧境界，",
        "translation": "boundless form, boundless virtue, boundless light, boundless sound, boundless pure sound, boundless concentration, and boundless sphere of knowledge.",
        "source": "T09n0278_031:0595b10_5"
    },
    {
        "source_sentence": "攝取天人、魔、梵、沙門、婆羅門、阿修羅等，一切世間，大慈境界，",
        "translation": "To embrace gods, humans, Māras, Brahmās, renunciants, brahmans, asuras, and so forth in all worlds is the sphere of great compassion.",
        "source": "T09n0278_031:0595b12_6"
    },
    {
        "source_sentence": "無礙大悲，安樂攝取眾生；",
        "translation": "Unhindered great compassion, they take care of sentient beings with peace and ease.",
        "source": "T09n0278_031:0595b13_7"
    },
    {
        "source_sentence": "或令生天，或令長養諸功德力，或令諸根清淨，或調伏其心，攝取眾生；",
        "translation": "Sometimes they cause sentient beings to be born in heaven, sometimes they develop the power of virtue, sometimes their faculties are purified, sometimes they tame their minds and take care of sentient beings.",
        "source": "T09n0278_031:0595b14_8"
    },
    {
        "source_sentence": "或以清淨諸乘，攝取眾生；",
        "translation": "Or they may take care of sentient beings by means of pure vehicles.",
        "source": "T09n0278_031:0595b16_9"
    },
    {
        "source_sentence": "或以滿足大乘，攝取眾生；",
        "translation": "Or they may take care of sentient beings by fulfilling the Great Vehicle.",
        "source": "T09n0278_031:0595b16_10"
    },
    {
        "source_sentence": "或離生死，攝取眾生。",
        "translation": "Or they may part with birth and death and take care of sentient beings.",
        "source": "T09n0278_031:0595b17_11"
    },
    {
        "source_sentence": "是為一切諸佛第一佛事。",
        "translation": "This is the first buddha-work of all buddhas.",
        "source": "T09n0278_031:0595b18_12"
    },
    {
        "source_sentence": "「一切諸佛，從兜率天降神母胎，修菩薩行；",
        "translation": "All buddhas descended from the Tushita heaven to their mother’s womb and cultivated enlightening practice.",
        "source": "T09n0278_031:0595b18_13"
    },
    {
        "source_sentence": "觀諸有生如幻、如化、如電、如夢、如虛空、如焰，離一切諍，修真實智，",
        "translation": "Observing all things as illusory, like illusions, like magic tricks, like lightning, like dreams, like space, like flames, they become free of all confusion and develop true knowledge.",
        "source": "T09n0278_031:0595b19_14"
    },
    {
        "source_sentence": "離欲清淨，具足大莊嚴藏，於最後生而作佛事；",
        "translation": "They are free from desire and pure, fully endowed with great stores of adornment; in their last birth they do buddha-work.",
        "source": "T09n0278_031:0595b21_15"
    },
    {
        "source_sentence": "安處妙寶莊嚴樓閣而作佛事：或以神力而作佛事、或以正念而作佛事、或以示現大自在藏而作佛事、或以圓滿慧日而作佛事、或以具足如來廣大境界而作佛事、或以化滿無量無邊世界諸佛而作佛事、或入無量無邊諸大三昧正受而作佛事、或復從彼諸三昧起而作佛事、或從初發心而作佛事、乃至無餘涅槃而作佛事。",
        "translation": "They may do buddha-work by means of spiritual powers, or they may do buddha-work by means of right mindfulness, or they may do buddha-work by means of showing great stores of freedom, or they may do buddha-work by means of",
        "source": "T09n0278_031:0595b22_16"
    },
    {
        "source_sentence": "此第二地，究竟示現一切世間；",
        "translation": "This second stage ultimately manifests all worlds.",
        "source": "T09n0278_031:0595c01_17"
    },
    {
        "source_sentence": "或初生時，一切世間而作佛事；",
        "translation": "Or they may do buddha-work in all worlds at the time of their first birth.",
        "source": "T09n0278_031:0595c02_18"
    },
    {
        "source_sentence": "或童子時，一切世間而作佛事；",
        "translation": "Sometimes, when they are children, they do buddha-work in all worlds.",
        "source": "T09n0278_031:0595c02_19"
    },
    {
        "source_sentence": "或菩薩時，一切世間而作佛事；",
        "translation": "Sometimes, at the time of enlightening beings, they do buddha-work in all worlds.",
        "source": "T09n0278_031:0595c03_20"
    },
    {
        "source_sentence": "或出家時、或成佛時、或轉法輪時，一切世間而作佛事。",
        "translation": "When they leave home, become buddhas, or turn the wheel of the Dharma, all the worlds do buddha-work.",
        "source": "T09n0278_031:0595c04_21"
    },
    {
        "source_sentence": "種種方便，於一切無餘世界而作佛事、一切方網而作佛事、一切佛剎而作佛事、一切業報而作佛事，",
        "translation": "By various means they do buddha-work in all worlds without remainder; they do buddha-work in all networks of directions; they do buddha-work in all buddha-lands; they do buddha-work according to the results of all their",
        "source": "T09n0278_031:0595c05_22"
    },
    {
        "source_sentence": "或於一切無餘眾生而作佛事，或於一切生死中，變化正念法門而作佛事。",
        "translation": "They may perform buddha-works for all sentient beings without remainder, or they may perform buddha-works in all births and deaths that transform the Dharma teaching of right mindfulness.",
        "source": "T09n0278_031:0595c08_0"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0595c09_1"
    },
    {
        "source_sentence": "是為一切諸佛第二佛事。",
        "translation": "This is the second buddha-work of all the buddhas.",
        "source": "T09n0278_031:0595c09_2"
    },
    {
        "source_sentence": "「一切諸佛為菩薩時，於王宮中，成就一切清淨勝業，善能分別知一切生；",
        "translation": "“When all buddhas are enlightening beings, they perform all pure supreme deeds in the palace of kings, able to distinguish and know all births.",
        "source": "T09n0278_031:0595c10_3"
    },
    {
        "source_sentence": "隨順眾生，現處王宮，欲令一切善根具足，而不著一切色，離一切聲，",
        "translation": "In accord with sentient beings, they appear to be in the royal palace, wanting to enable all roots of goodness to be fulfilled, not clinging to any form or sound.",
        "source": "T09n0278_031:0595c12_4"
    },
    {
        "source_sentence": "觀一切有，皆悉寂滅；",
        "translation": "Observing all existences, they are completely extinguished.",
        "source": "T09n0278_031:0595c13_5"
    },
    {
        "source_sentence": "甚深智慧，入一切境界，持一切戒，清淨滿足。",
        "translation": "Their profound wisdom enters all realms and observes all precepts, purely fulfilling them.",
        "source": "T09n0278_031:0595c14_6"
    },
    {
        "source_sentence": "大悲觀察內諸眷屬，大慈觀察眾生空寂，大喜觀察世無可樂，大捨觀察心得自在；",
        "translation": "Great compassion observes all the members of his inner circle; great kindness observes the emptiness and quiescence of sentient beings; great joy observes that there is nothing to be enjoyed in the world; great equanimity observes freely",
        "source": "T09n0278_031:0595c15_7"
    },
    {
        "source_sentence": "隨意能轉，究竟一切智，諸妙功德，出生法身，與法界等，清淨滿足而無染著。",
        "translation": "He can develop it as he wishes, perfecting omniscience and all its marvelous virtues, producing the Dharma body that's equal to the Dharma realm, purely fulfilled without defiled attachment.",
        "source": "T09n0278_031:0595c17_8"
    },
    {
        "source_sentence": "令一切眷屬，皆悉清淨，廣能為彼，如應說法，令厭世間；",
        "translation": "They cause all their followers to be completely pure, able to extensively teach them the Dharma as they should be taught, causing them to become disillusioned with the world.",
        "source": "T09n0278_031:0595c19_9"
    },
    {
        "source_sentence": "能說一切世間音聲，隨彼所行，示現果報；",
        "translation": "They can utter all the sounds of all worlds, manifesting their results according to what they do.",
        "source": "T09n0278_031:0595c20_10"
    },
    {
        "source_sentence": "出生無量種種方便，隨其所應，調伏教化；",
        "translation": "Innumerable various methods of liberation arose, being tamed and taught according to their needs.",
        "source": "T09n0278_031:0595c21_11"
    },
    {
        "source_sentence": "善根未熟，悉令成熟；",
        "translation": "They develop the roots of goodness that have not yet matured, causing them all to mature.",
        "source": "T09n0278_031:0595c22_12"
    },
    {
        "source_sentence": "已成熟者，令得解脫；",
        "translation": "Those who are mature I lead to attain liberation.",
        "source": "T09n0278_031:0595c22_13"
    },
    {
        "source_sentence": "示現無量不退佛事，廣說種種法門，令無量眾生，心得清淨；",
        "translation": "They manifest infinite buddha-works of nonregression, extensively expounding various teachings, causing infinite sentient beings to attain purity of mind.",
        "source": "T09n0278_031:0595c23_14"
    },
    {
        "source_sentence": "興大悲重雲，普雨無量甘露法雨；",
        "translation": "They produced great clouds of compassion and showered the rain of the Teaching with immeasurable ambrosia.",
        "source": "T09n0278_031:0595c24_15"
    },
    {
        "source_sentence": "大慈平等，三輪示現，教化眾生。",
        "translation": "Great compassion is equal, manifested in the three wheels, teaching and transforming sentient beings.",
        "source": "T09n0278_031:0595c25_16"
    },
    {
        "source_sentence": "雖處王宮，而普示現一切佛事；",
        "translation": "Though they live in royal palaces, yet they show all the works of buddhahood.",
        "source": "T09n0278_031:0595c26_17"
    },
    {
        "source_sentence": "於一切世界，示現佛事，出生無礙諸佛神通，具足三種巧方便業，身、口二業究竟清淨，",
        "translation": "In all worlds they manifest buddha-work, producing unobstructed buddhas’ spiritual powers. They are endowed with the three kinds of skill in means and their physical and verbal actions are ultimately pure.",
        "source": "T09n0278_031:0595c27_18"
    },
    {
        "source_sentence": "意業甚深究竟無礙，得巧方便，饒益眾生。",
        "translation": "Their mental actions are profound and ultimately unobstructed, and they attain skillful means to benefit sentient beings.",
        "source": "T09n0278_031:0595c29_19"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0596a01_20"
    },
    {
        "source_sentence": "是為一切諸佛第三佛事。",
        "translation": "This is the third buddha-work of all the buddhas.",
        "source": "T09n0278_031:0596a01_21"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0596a01_22"
    },
    {
        "source_sentence": "一切諸佛，世間珍玩，種種寶物，悉能眩惑動轉人心；",
        "translation": "All buddhas, worldly treasures and toys, various jewels, can dazzle and stir the minds of people.",
        "source": "T09n0278_031:0596a02_0"
    },
    {
        "source_sentence": "菩薩悉棄，捨家出家，示現世間；",
        "translation": "The enlightening beings abandon them all, leaving home and leaving home, manifesting in the world.",
        "source": "T09n0278_031:0596a03_1"
    },
    {
        "source_sentence": "欲令眾生，不著世間；",
        "translation": "They want to cause sentient beings not to cling to worldly things.",
        "source": "T09n0278_031:0596a04_0"
    },
    {
        "source_sentence": "解知磨滅，皆悉非常。",
        "translation": "Understanding and knowing that they are all subject to grinding and ceasing, they are all impermanent.",
        "source": "T09n0278_031:0596a04_1"
    },
    {
        "source_sentence": "捨離貪愛，行清淨法，饒益眾生，得出家利。",
        "translation": "He abandons craving and practices the pure Dharma, benefits sentient beings, and leaves home for their benefit.",
        "source": "T09n0278_031:0596a05_0"
    },
    {
        "source_sentence": "示現世間，捨離俗服，修無諍法，滿足本願，無量功德，皆悉圓滿。",
        "translation": "He manifested in the world, leaving secular clothes and cultivating the principle of noncontention, fulfilling his original vow, with measureless virtue, all perfected.",
        "source": "T09n0278_031:0596a06_0"
    },
    {
        "source_sentence": "智慧具足，除世愚癡，示現眾生，無上福田；",
        "translation": "They are endowed with knowledge and wisdom, getting rid of worldly ignorance; they show sentient beings the supreme field of blessedness.",
        "source": "T09n0278_031:0596a07_1"
    },
    {
        "source_sentence": "若有眾生，於佛福田種善根者，讚歎其人，悉已具足一切功德，甚深智慧，",
        "translation": "If there are any sentient beings who have planted roots of goodness in the Buddha’s field of blessings, they should praise those people. All of them will be endowed with all merits and profound wisdom.",
        "source": "T09n0278_031:0596a08_2"
    },
    {
        "source_sentence": "了真實義。",
        "translation": "They understand the true meaning of reality.",
        "source": "T09n0278_031:0596a10_3"
    },
    {
        "source_sentence": "悉令眾生，得清淨樂，永離諸惡，清淨法門；",
        "translation": "They all cause sentient beings to attain pure bliss, forever getting rid of evil: the pure dharma-gate of enlightenment.",
        "source": "T09n0278_031:0596a10_4"
    },
    {
        "source_sentence": "廣為眾生說正法門，超出生死；",
        "translation": "They extensively expound the true teaching for sentient beings, transcending birth and death.",
        "source": "T09n0278_031:0596a11_5"
    },
    {
        "source_sentence": "為欲建立一切智幢故，捨家出家。",
        "translation": "Because they want to establish the banner of omniscience, they abandon home and leave home.",
        "source": "T09n0278_031:0596a12_6"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0596a13_7"
    },
    {
        "source_sentence": "是為一切諸佛第四佛事。",
        "translation": "This is the fourth buddha-work of all the buddhas.",
        "source": "T09n0278_031:0596a13_8"
    },
    {
        "source_sentence": "「一切諸佛，修無量行，一向專求薩婆若；",
        "translation": "All buddhas cultivate infinite practices, singlemindedly seeking omniscience.",
        "source": "T09n0278_031:0596a13_9"
    },
    {
        "source_sentence": "坐於道場菩提樹下，成等正覺，達一切法，壞散眾魔，不可破壞法身之藏；",
        "translation": "Sitting under the tree of enlightenment at the site of enlightenment, he attained perfect enlightenment, comprehended all things, destroyed and dispersed all demons; this was the indestructible treasure house of the body of truth.",
        "source": "T09n0278_031:0596a14_10"
    },
    {
        "source_sentence": "悉能充滿一切法界，離一切相，究竟無盡，具足成就無量法門。",
        "translation": "They are able to fill all realms of reality, apart from all characteristics, ultimately inexhaustible. They are fully endowed with the accomplishment of infinite teachings.",
        "source": "T09n0278_031:0596a16_11"
    },
    {
        "source_sentence": "於一切智境界，自在隨順其義，積集成滿一切種智功德，莊嚴一切寶座，",
        "translation": "In the sphere of omniscience, freely adapting to their meanings, they accumulate all kinds of knowledge and virtues, adorning seats of all jewels.",
        "source": "T09n0278_031:0596a18_0"
    },
    {
        "source_sentence": "遍一切剎，諸大菩薩，悉處其座；",
        "translation": "All the great enlightening beings of all buddha-lands sat on their seats.",
        "source": "T09n0278_031:0596a19_1"
    },
    {
        "source_sentence": "成就菩薩無上眾行，具足菩薩殊勝大願；",
        "translation": "They accomplish the unexcelled practices of enlightening beings and fulfill the supreme great vows of enlightening beings.",
        "source": "T09n0278_031:0596a20_2"
    },
    {
        "source_sentence": "一切菩薩，常所敬念。",
        "translation": "All the bodhisattvas always venerate him.",
        "source": "T09n0278_031:0596a21_3"
    },
    {
        "source_sentence": "為諸菩薩，轉深法輪；",
        "translation": "For the sake of enlightening beings they turn the profound wheel of teaching.",
        "source": "T09n0278_031:0596a22_0"
    },
    {
        "source_sentence": "無量佛境界，攝取諸菩薩，修習莊嚴諸菩薩行；",
        "translation": "Countless buddha-realms embraced enlightening beings and cultivated the practice of adornment of enlightening beings.",
        "source": "T09n0278_031:0596a22_1"
    },
    {
        "source_sentence": "令菩薩眾，皆悉清淨一切世間諸佛境界；",
        "translation": "He caused the assembly of enlightening beings to all purify the realms of all buddhas of all worlds.",
        "source": "T09n0278_031:0596a23_2"
    },
    {
        "source_sentence": "令一切眾生，修習善根，不可破壞一切善根；",
        "translation": "They cause all sentient beings to cultivate roots of goodness, not destroying any roots of goodness.",
        "source": "T09n0278_031:0596a24_3"
    },
    {
        "source_sentence": "出真實地，安住無量菩薩行地，具足一切勝妙功德；",
        "translation": "They emerge from the ground of reality and abide in the sphere of immeasurable enlightening practice, imbued with all sublime virtues.",
        "source": "T09n0278_031:0596a25_4"
    },
    {
        "source_sentence": "悉分別知一切世界、一切眾生、一切佛剎、一切諸法、一切菩薩、一切成熟、一切三世、一切教化、一切佛自在覺、一切眾生性，",
        "translation": "They know all worlds, all sentient beings, all buddha-lands, all phenomena, all enlightening beings, all maturations, all pasts, presents, and futures, all teachings, all Buddhas’ unimpeded",
        "source": "T09n0278_031:0596a26_5"
    },
    {
        "source_sentence": "而作佛事。",
        "translation": "They do buddha-works.",
        "source": "T09n0278_031:0596a29_6"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0596b01_0"
    },
    {
        "source_sentence": "是為一切諸佛第五佛事。",
        "translation": "This is the fifth buddha-work of all buddhas.",
        "source": "T09n0278_031:0596b01_1"
    },
    {
        "source_sentence": "「一切諸佛轉妙法輪，不退轉故；",
        "translation": "All buddhas turn the wonderful wheel of teaching, because they do not turn back.",
        "source": "T09n0278_031:0596b01_2"
    },
    {
        "source_sentence": "無量法輪，一切世間知故；",
        "translation": "Countless wheels of teaching, known by all beings in all worlds.",
        "source": "T09n0278_031:0596b02_3"
    },
    {
        "source_sentence": "一切覺法輪，無畏大師子吼故；",
        "translation": "The wheel of teaching of all enlightened ones is the lion’s roar of fearlessness.",
        "source": "T09n0278_031:0596b03_4"
    },
    {
        "source_sentence": "知一切法藏法輪，開示顯現明淨法門，滅癡闇故；",
        "translation": "They know all the wheels of teaching of the treasury of truth, revealing and manifesting enlightening doctrines that clarify purity, annihilating the darkness of ignorance.",
        "source": "T09n0278_031:0596b03_5"
    },
    {
        "source_sentence": "無著法輪，智慧等虛空故；",
        "translation": "They do not cling to the wheel of teaching, because their knowledge and wisdom are like space.",
        "source": "T09n0278_031:0596b05_0"
    },
    {
        "source_sentence": "無礙法輪，觀一切法，非有無故；",
        "translation": "Unobstructed wheel of teaching observes all things, neither existent nor nonexistent.",
        "source": "T09n0278_031:0596b05_1"
    },
    {
        "source_sentence": "一切世間燈法輪，淨一切眾生法眼故；",
        "translation": "The wheel of teaching as lamp of all worlds is to purify the eye of truth of all sentient beings.",
        "source": "T09n0278_031:0596b06_2"
    },
    {
        "source_sentence": "示現一切智法輪，充滿三世一切世間故；",
        "translation": "They manifest the wheel of teaching of omniscience, filling all worlds in all times.",
        "source": "T09n0278_031:0596b07_3"
    },
    {
        "source_sentence": "一切諸佛同一法輪，一切佛法不相違故。",
        "translation": "All buddhas are one and the same wheel of the Dharma, because all buddha-teachings aren't at odds with each other.",
        "source": "T09n0278_031:0596b08_4"
    },
    {
        "source_sentence": "如是等無量阿僧祇法輪，隨所應轉，施作佛事，不可思議。",
        "translation": "Innumerable, incalculable cycles of teaching such as these are given to perform buddha-works wherever they should be done—unfathomable.",
        "source": "T09n0278_031:0596b09_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0596b10_6"
    },
    {
        "source_sentence": "是為一切諸佛第六佛事。",
        "translation": "This is the sixth buddha-work of all the buddhas.",
        "source": "T09n0278_031:0596b10_7"
    },
    {
        "source_sentence": "「一切諸佛，若入聚落、城邑、大王都城，能為眾生施作佛事；",
        "translation": "“All buddhas can perform buddha-work for sentient beings by entering villages, cities, and great kingdoms.",
        "source": "T09n0278_031:0596b11_8"
    },
    {
        "source_sentence": "或入人王都城；",
        "translation": "Or they may enter the human capital city.",
        "source": "T09n0278_031:0596b12_9"
    },
    {
        "source_sentence": "或入天王、龍王、夜叉、乾闥婆、阿脩羅、迦樓羅、緊那羅、摩睺羅伽、羅剎、毘舍遮王；",
        "translation": "Or they may enter heavenly kings, dragon kings, yaksha kings, gandharvas, asuras, garuḍas, kinnaras, mahoragas, rājas, and viśeṣika kings.",
        "source": "T09n0278_031:0596b12_10"
    },
    {
        "source_sentence": "入如是等一切諸王都城時，能為眾生而作佛事，所謂：入城門時，一切大地，",
        "translation": "When entering all these great cities, they can do buddha-work for sentient beings:",
        "source": "T09n0278_031:0596b14_11"
    },
    {
        "source_sentence": "六種震動，光明普照，盲者得視，聾者得聽，狂者得止，裸者得衣，苦者得樂；",
        "translation": "There were six kinds of trembling and the light shone everywhere. The blind could see, the deaf heard, the crazy stopped, the naked attained their robes, and the pained gained happiness.",
        "source": "T09n0278_031:0596b16_12"
    },
    {
        "source_sentence": "一切樂器，不鼓自鳴，諸莊嚴具，自然演出微妙音聲；",
        "translation": "All the instruments of music spontaneously sounded without drumming, and all the adornments naturally produced subtle sounds.",
        "source": "T09n0278_031:0596b18_13"
    },
    {
        "source_sentence": "如是等物，亦自然出微妙音聲。",
        "translation": "Such things as these also naturally produce subtle sounds.",
        "source": "T09n0278_031:0596b19_14"
    },
    {
        "source_sentence": "一切諸佛，色身清淨，見者無厭，普為眾生而作佛事；",
        "translation": "All buddhas’ physical forms and bodies are pure; those who see them never tire of doing buddha-work for sentient beings everywhere.",
        "source": "T09n0278_031:0596b20_15"
    },
    {
        "source_sentence": "一切諸佛，相好莊嚴，普為眾生而作佛事；",
        "translation": "All buddhas, adorned with their marks and embellishments, do buddha-work for sentient beings everywhere.",
        "source": "T09n0278_031:0596b21_16"
    },
    {
        "source_sentence": "一切諸佛，視瞻安詳，未曾卒疾，觀察諸方，不失威儀，於一切境界，",
        "translation": "All the buddhas looked peacefully without any sudden illness. Observing all directions, they did not lose their comportment; and in all realms everywhere they manifested great signs of enlightenment.",
        "source": "T09n0278_031:0596b22_17"
    },
    {
        "source_sentence": "諸根寂定，攝心不亂，直趣涅槃，普為眾生而作佛事；",
        "translation": "Their faculties were tranquil and concentrated, their minds unconfused. They proceeded straight forth toward nirvana, doing buddha-work for sentient beings everywhere.",
        "source": "T09n0278_031:0596b24_18"
    },
    {
        "source_sentence": "一切諸佛，行四威儀，普為眾生而作佛事；",
        "translation": "All buddhas do buddha-work for sentient beings by means of the four modes of deportment.",
        "source": "T09n0278_031:0596b25_19"
    },
    {
        "source_sentence": "一切諸佛，或以說法，或以默然，普為眾生而作佛事；",
        "translation": "All buddhas do buddha-work for sentient beings either by teaching the truth or by remaining silent.",
        "source": "T09n0278_031:0596b26_20"
    },
    {
        "source_sentence": "一切諸佛，或以神足，說法教誡，普為眾生而作佛事；",
        "translation": "All buddhas sometimes do buddha-work for sentient beings by expounding the Teaching and admonishing with spiritual feet.",
        "source": "T09n0278_031:0596b27_21"
    },
    {
        "source_sentence": "一切諸佛，為一切世界海中，種種眾生海，修大善根，念佛三昧，行菩薩行，",
        "translation": "All buddhas cultivate great roots of goodness for the sake of all kinds of sentient beings in all oceans of worlds, mentally concentrating on Buddha and carrying out enlightening practice.",
        "source": "T09n0278_031:0596b28_22"
    },
    {
        "source_sentence": "觀察諸佛，無有厭足；",
        "translation": "Observing the buddhas, they never tire of them.",
        "source": "T09n0278_031:0596c01_23"
    },
    {
        "source_sentence": "或說佛興，難可值遇；",
        "translation": "Some say that it is difficult to meet buddhas when they arise.",
        "source": "T09n0278_031:0596c02_24"
    },
    {
        "source_sentence": "見如來已，出生無量一切善法，修習功德，行諸佛行，佛出世間，令眾生淨，",
        "translation": "Having seen the enlightened, he produces measureless good qualities, cultivates virtue, and practices the deeds of buddhas. The buddhas appear in the world to purify sentient beings.",
        "source": "T09n0278_031:0596c02_25"
    },
    {
        "source_sentence": "讚歎諸佛無量功德，長養未來諸佛種姓，修一切善根，令諸佛歡喜，解知如來無量妙色，",
        "translation": "They praised the infinite virtues of all buddhas, nurturing the lineages of future buddhas. Cultivating all roots of goodness, they caused the buddhas to rejoice and comprehended the immeasurable subtle forms of buddhas",
        "source": "T09n0278_031:0596c04_26"
    },
    {
        "source_sentence": "隨所應化，普能現前，令不可思議眾生，於諸佛剎，得見如來；",
        "translation": "Inconceivable numbers of sentient beings were able to appear in all buddha-lands, according to their capacities.",
        "source": "T09n0278_031:0596c06_27"
    },
    {
        "source_sentence": "一切諸佛，以如是等無量善根，普為眾生而作佛事；",
        "translation": "All buddhas do buddha-work for sentient beings by means of such immeasurable roots of goodness.",
        "source": "T09n0278_031:0596c07_28"
    },
    {
        "source_sentence": "彼諸眾生，或有見佛歡喜、或有禮拜、或有合掌、或有讚歎、或有請佛、或有受施、或見佛微笑、或有念佛、或見佛悅樂，",
        "translation": "Those sentient beings may see the Buddha joyfully, or they may venerate him, or they may join their palms together, or they may praise him, or they may invoke him, or they may receive his charity, or they may see him smile",
        "source": "T09n0278_031:0596c09_29"
    },
    {
        "source_sentence": "普為眾生而作佛事。",
        "translation": "They perform buddha-works for all sentient beings.",
        "source": "T09n0278_031:0596c12_30"
    },
    {
        "source_sentence": "一切諸佛，能以無量種種色身，示現眾生而作佛事；",
        "translation": "All buddhas can perform buddha-work by showing sentient beings infinite various form bodies.",
        "source": "T09n0278_031:0596c12_31"
    },
    {
        "source_sentence": "一切諸佛，以妙音聲，普為眾生而作佛事；",
        "translation": "All buddhas do buddha-work for sentient beings by means of their wondrous sound.",
        "source": "T09n0278_031:0596c13_32"
    },
    {
        "source_sentence": "一切諸佛，以如是等無量無數不思議事，普為眾生而作佛事。",
        "translation": "All buddhas perform buddha-work for sentient beings by means of such measureless, countless, inconceivable deeds.",
        "source": "T09n0278_031:0596c14_33"
    },
    {
        "source_sentence": "於一切世界中，一切眾生，悉教化之，令不退轉；",
        "translation": "In all worlds, they lead and inspire all sentient beings, causing them not to regress.",
        "source": "T09n0278_031:0596c16_34"
    },
    {
        "source_sentence": "大悲充滿，不捨本願，具足成就一切智力，隨所應化，悉令調伏。",
        "translation": "Filled with great compassion, they don't abandon their original vow, are fully endowed with the power of omniscience, and cause them to be disciplined according to what they need to be taught.",
        "source": "T09n0278_031:0596c17_35"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0596c19_0"
    },
    {
        "source_sentence": "是為一切諸佛第七佛事。",
        "translation": "This is the seventh buddha-work of all the buddhas.",
        "source": "T09n0278_031:0596c19_1"
    },
    {
        "source_sentence": "「一切諸佛，或住阿練若處、或寂靜處、或離欲處而作佛事，或住佛住而作佛事，",
        "translation": "“All buddhas sometimes do buddha-work in a forested abode, sometimes in a peaceful place, sometimes in a place free from desire, and sometimes they do buddha-work while abiding in the abode of buddhahood.",
        "source": "T09n0278_031:0596c19_2"
    },
    {
        "source_sentence": "或住大三昧而作佛事，或住獨處而作佛事，或不現身而作佛事，或住深智而作佛事，",
        "translation": "They may do buddha-work while abiding in great concentration; they may do buddha-work while staying alone; they may do buddha-work while not manifesting their bodies; they may do buddha-work while dwelling in profound knowledge;",
        "source": "T09n0278_031:0596c21_3"
    },
    {
        "source_sentence": "或住不可稱量諸佛境界而作佛事，或隨所應而作佛事，或以天身境界而作佛事，",
        "translation": "They may do buddha-work in the sphere of infinite buddhas, or they may do buddha-work according to what is appropriate, or they may do buddha-work in the sphere of celestial bodies.",
        "source": "T09n0278_031:0596c23_4"
    },
    {
        "source_sentence": "或以天、龍、迦樓羅、緊那羅、摩睺羅伽、羅剎、人、非人等一切境界而作佛事，",
        "translation": "Or they may perform buddha-works in all realms, such as gods, dragons, garuḍas, kiṃnaras, mahoragas, rājas, humans, nonhumans, and so forth.",
        "source": "T09n0278_031:0596c25_5"
    },
    {
        "source_sentence": "或以聲聞、緣覺、菩薩境界而作佛事，或以說法而作佛事，或以默然而作佛事，",
        "translation": "They may do buddha-work in the spheres of śrāvakas, pratyekabuddhas, and bodhisattvas, or they may do buddha-work by expounding doctrine, or they may do buddha-work by remain",
        "source": "T09n0278_031:0596c27_6"
    },
    {
        "source_sentence": "或說世間有一佛而作佛事，或說世間有一切諸佛而作佛事，或說一切菩薩無量願、無量行為一而作佛事，",
        "translation": "“Some do buddha-work saying there is one buddha in the world; some do buddha-work saying there are all buddhas in the world; some do buddha-work saying all enlightening beings’ infinite vows and infinite practices",
        "source": "T09n0278_031:0596c29_7"
    },
    {
        "source_sentence": "或說一行一願為無量而作佛事，或說世間境界為如來境界，或說如來境界為世間境界，",
        "translation": "“Some say one practice and one vow accomplish buddha-work for the sake of infinity; some say worldly spheres do buddha-work for the sake of enlightenment; some say mundane spheres do buddha-work for the",
        "source": "T09n0278_031:0597a02_8"
    },
    {
        "source_sentence": "或說非境界為如來境界而作佛事；",
        "translation": "Some do buddha-work saying that what is not an objective realm is the Buddha’s objective realm.",
        "source": "T09n0278_031:0597a04_9"
    },
    {
        "source_sentence": "或住一日、或住一夜、或住半月、一月、一歲，乃至住無量無數阿僧祇劫而作佛事。",
        "translation": "They may live for a day, a night, a fortnight, a month, a month, a year, up to an infinite number of incalculable eons and do buddha-works.",
        "source": "T09n0278_031:0597a05_10"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0597a07_11"
    },
    {
        "source_sentence": "是為一切諸佛第八佛事。",
        "translation": "This is the eighth buddha-work of all the buddhas.",
        "source": "T09n0278_031:0597a07_12"
    },
    {
        "source_sentence": "「一切諸佛即是無盡功德之藏，能令眾生發深信心，具足清淨，隨其所應，",
        "translation": "All buddhas are inexhaustible treasuries of virtue, able to cause sentient beings to give rise to deep faith and perfect purity according to their needs.",
        "source": "T09n0278_031:0597a08_13"
    },
    {
        "source_sentence": "悉能化度，諸根具足，調伏眾生，悉令歡喜；",
        "translation": "They are all able to teach and liberate, endowed with all faculties. They tame sentient beings and make them all rejoice.",
        "source": "T09n0278_031:0597a09_14"
    },
    {
        "source_sentence": "化一切眾生，以真實道，覺悟一切諸菩薩眾；",
        "translation": "To edify all sentient beings they use the true path to awaken all the hosts of enlightening beings.",
        "source": "T09n0278_031:0597a10_15"
    },
    {
        "source_sentence": "未發菩提心者，皆令發心；",
        "translation": "Those who have not yet developed the will for enlightenment they cause to do so.",
        "source": "T09n0278_031:0597a12_0"
    },
    {
        "source_sentence": "已發心者，令具智慧，悟不由他；",
        "translation": "Those who have already set their minds on enlightenment, they cause them to be endowed with wisdom and awaken without relying on others.",
        "source": "T09n0278_031:0597a12_1"
    },
    {
        "source_sentence": "或現涅槃而作佛事、或現世間無常而作佛事、或讚歎法身清淨而作佛事、或說所作已辦而作佛事、或說壞一切有而作佛事、或說三有根本永盡而作佛事，",
        "translation": "Sometimes they do buddha-work manifesting nirvana, sometimes they do buddha-work manifesting the impermanence of the world, sometimes they do buddha-work praising the purity of the body of reality, sometimes they do buddha-work explaining",
        "source": "T09n0278_031:0597a13_2"
    },
    {
        "source_sentence": "或教眾生厭離世間隨順佛心，或為眾生說壽命短促，或為眾生說一切世間無可樂者，",
        "translation": "They may teach sentient beings to be disillusioned with the world and follow the buddha-mind, or they may tell sentient beings that life is short, or they may tell sentient beings that all worlds have no enjoyment.",
        "source": "T09n0278_031:0597a17_3"
    },
    {
        "source_sentence": "或為眾生說值未來一切諸佛，或為眾生說諸如來轉妙法輪，或發眾生佛境界心，",
        "translation": "“Great enlightening beings may teach sentient beings the way to meet all buddhas of the future, or they may teach sentient beings the turning of the wheel of teaching of the Buddhas, or they may develop the minds of sentient beings",
        "source": "T09n0278_031:0597a19_4"
    },
    {
        "source_sentence": "或說隨時清淨念佛，得見如來。",
        "translation": "Some people say that they can see the Tathāgata when they're purified in mindfulness of the Buddha at any time.",
        "source": "T09n0278_031:0597a21_5"
    },
    {
        "source_sentence": "滅除眾苦，皆令清淨，專求佛道。",
        "translation": "He extinguishes all suffering and makes them all pure, focusing on the Buddha Way.",
        "source": "T09n0278_031:0597a22_6"
    },
    {
        "source_sentence": "於一切世界，攝取眾生，令入如來甚深境界。",
        "translation": "In all worlds, they take care of sentient beings and cause them to enter the profound realm of the enlightened.",
        "source": "T09n0278_031:0597a22_7"
    },
    {
        "source_sentence": "以如來身為一切身，攝取眾生，放逸眾生，悉令具足三種淨戒。",
        "translation": "Because the Tathāgata's body is all body, it takes in sentient beings and carelessly enables them to fully possess the three kinds of pure precepts.",
        "source": "T09n0278_031:0597a23_8"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0597a25_9"
    },
    {
        "source_sentence": "是為一切諸佛第九佛事。",
        "translation": "This is the ninth buddha-work of all the buddhas.",
        "source": "T09n0278_031:0597a25_10"
    },
    {
        "source_sentence": "「一切諸佛，般涅槃時，一切眾生，悲泣雨淚，憂惱愁毒。",
        "translation": "“When all the buddhas pass into nirvana, all sentient beings weep and rain tears of sorrow and grief.",
        "source": "T09n0278_031:0597a26_11"
    },
    {
        "source_sentence": "嗚呼痛哉！",
        "translation": "Whoops, what a pain!",
        "source": "T09n0278_031:0597a27_12"
    },
    {
        "source_sentence": "如來、應供、等正覺，常以大悲，等念眾生；",
        "translation": "The Buddhas, Worthy of Offerings and Fully Awakened, always think of sentient beings equally with great compassion.",
        "source": "T09n0278_031:0597a27_13"
    },
    {
        "source_sentence": "為大導師，哀愍饒益一切眾生，救護世間；",
        "translation": "They become great leaders, compassionate to all sentient beings and rescue the world.",
        "source": "T09n0278_031:0597a28_14"
    },
    {
        "source_sentence": "天人所歸，難可值遇，無上福田，於今永滅；",
        "translation": "Gods and human beings have come to this land but it is difficult to meet them. The unsurpassed field of blessings will now perish forever.",
        "source": "T09n0278_031:0597a29_15"
    },
    {
        "source_sentence": "諸佛即以此等眾生，憂苦悲惱，感慕諸佛而作佛事。",
        "translation": "The buddhas do buddha-work for these sentient beings because they are grieved, saddened, and distressed, yearning for the buddhas.",
        "source": "T09n0278_031:0597b01_16"
    },
    {
        "source_sentence": "隨應化彼，一切天人、龍神、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽等故，",
        "translation": "It's because all gods, humans, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, and so forth.",
        "source": "T09n0278_031:0597b02_17"
    },
    {
        "source_sentence": "碎末全身，示現舍利，欲令眾生，歡喜供養，淨正直心，調伏教化，清淨眾生；",
        "translation": "He crushed the powder whole body and manifested the relics, wishing to cause sentient beings to rejoice in offerings, purifying righteous minds, taming and teaching, and purifiing sentient beings.",
        "source": "T09n0278_031:0597b04_18"
    },
    {
        "source_sentence": "欲令眾生，功德滿足；",
        "translation": "They want to cause sentient beings to fulfill their virtues.",
        "source": "T09n0278_031:0597b06_19"
    },
    {
        "source_sentence": "欲令眾生，起如來塔，種種供養。",
        "translation": "They want to cause sentient beings to erect the Tathāgata's stūpa and make various offerings.",
        "source": "T09n0278_031:0597b06_20"
    },
    {
        "source_sentence": "一切世間，天宮、龍宮、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人、非人宮，",
        "translation": "In all worlds there are celestial palaces, dragon palaces, yakṣa palaces, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and nonhuman palaces.",
        "source": "T09n0278_031:0597b07_21"
    },
    {
        "source_sentence": "起塔供養；",
        "translation": "They built stupas and offered them to the Buddha.",
        "source": "T09n0278_031:0597b09_22"
    },
    {
        "source_sentence": "又以爪牙頭髮，起塔供養。",
        "translation": "He also built a stūpa to honor him with his nails and teeth.",
        "source": "T09n0278_031:0597b09_23"
    },
    {
        "source_sentence": "眾生見已，念佛、法、僧，發起恭敬供養之心，或行布施，或修功德。",
        "translation": "When sentient beings see them, they're mindful of the Buddha, Dharma, and Saṃgha, arouse respect and offer support, either by practicing generosity or cultivating virtue.",
        "source": "T09n0278_031:0597b10_24"
    },
    {
        "source_sentence": "具功德已，或生天上，或生人中，尊貴富樂，除滅惡趣，直向正道，得見諸佛；",
        "translation": "Having perfected their virtues, some will be born in heaven or among humans. They will be noble and prosperous, getting rid of the evil destinies, heading straight for the right path, and gaining insight into all buddhas.",
        "source": "T09n0278_031:0597b11_25"
    },
    {
        "source_sentence": "具白淨法，成就正道，超出三界，隨彼所願，皆悉滿足。",
        "translation": "They are endowed with pure and genuine dharmas, have perfected the right path, transcend the three realms, and fulfill all their wishes.",
        "source": "T09n0278_031:0597b13_26"
    },
    {
        "source_sentence": "常念如來，知恩、報恩；",
        "translation": "They always think of the Enlightened, knowing kindness and repaying kindness.",
        "source": "T09n0278_031:0597b14_27"
    },
    {
        "source_sentence": "以諸如來，常為眾生作救護，歸依如來；",
        "translation": "The enlightened ones always rescue sentient beings and take refuge in the enlightened ones.",
        "source": "T09n0278_031:0597b15_28"
    },
    {
        "source_sentence": "雖復入於涅槃，猶為眾生作無上福田，無盡福田；",
        "translation": "Even if one were to enter nirvana, he would still be an unexcelled field of blessings and an inexhaustible field of blessings for sentient beings.",
        "source": "T09n0278_031:0597b16_29"
    },
    {
        "source_sentence": "令一切眾生，長養善根，具足成就一切功德。",
        "translation": "It causes all sentient beings to nurture good roots, fully developing all merits.",
        "source": "T09n0278_031:0597b17_30"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0597b18_31"
    },
    {
        "source_sentence": "是為一切諸佛第十佛事。",
        "translation": "This is the tenth buddha-work of all the buddhas.",
        "source": "T09n0278_031:0597b18_32"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0597b19_33"
    },
    {
        "source_sentence": "此十種佛事，無量無邊不可思議，一切天人，莫能知者，三世一切聲聞、緣覺所不能說，",
        "translation": "These ten buddha-works are immeasurable, boundless, and inconceivable. No god or human being can know them; they cannot be explained by any śrāvaka or pratyekabuddha of the three times.",
        "source": "T09n0278_031:0597b19_34"
    },
    {
        "source_sentence": "除佛神力。",
        "translation": "It's except for the Buddha's miraculous power.",
        "source": "T09n0278_031:0597b21_35"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0597b21_36"
    },
    {
        "source_sentence": "一切諸佛，有十種法王無異之法。",
        "translation": "All buddhas have ten kinds of Dharma kings that are not different from each other.",
        "source": "T09n0278_031:0597b21_37"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0597b22_38"
    },
    {
        "source_sentence": "一切諸佛，與授記者，言無有異；",
        "translation": "All buddhas and enlightening beings are no different in their words from the prediction of enlightenment.",
        "source": "T09n0278_031:0597b22_39"
    },
    {
        "source_sentence": "一切諸佛，若有眾生，修念佛者，皆令意滿，悉無有異；",
        "translation": "All buddhas, if any sentient beings cultivate mindfulness of buddhas, cause their minds to be filled, all without distinction.",
        "source": "T09n0278_031:0597b23_40"
    },
    {
        "source_sentence": "一切諸佛，皆無異身，覺諸法義，悉無有異；",
        "translation": "All buddhas have no different bodies, perceiving the meaning of all teachings without any difference.",
        "source": "T09n0278_031:0597b24_41"
    },
    {
        "source_sentence": "一切諸佛，於三世如來，智慧無異；",
        "translation": "All buddhas’ knowledge and wisdom are no different from those of the Buddhas of all times.",
        "source": "T09n0278_031:0597b25_42"
    },
    {
        "source_sentence": "一切諸佛，念念普知三世諸法，悉無有異；",
        "translation": "All buddhas instantly know the teachings of past, present, and future without distinction.",
        "source": "T09n0278_031:0597b26_43"
    },
    {
        "source_sentence": "一切諸佛，了知分別三世佛剎，悉無有異；",
        "translation": "All buddhas know and discriminate the buddha-lands of past, present, and future without distinction.",
        "source": "T09n0278_031:0597b27_44"
    },
    {
        "source_sentence": "一切諸佛，一切佛語，悉無有異；",
        "translation": "All buddhas, all Buddha’s words, are no different from each other.",
        "source": "T09n0278_031:0597b28_45"
    },
    {
        "source_sentence": "一切諸佛，教化眾生，悉無有異；",
        "translation": "All buddhas teach sentient beings without distinction.",
        "source": "T09n0278_031:0597b29_46"
    },
    {
        "source_sentence": "一切諸佛，解一切世間法與佛法無異；",
        "translation": "All buddhas’ understanding of all worldly principles is no different from buddha-teachings.",
        "source": "T09n0278_031:0597c01_47"
    },
    {
        "source_sentence": "三世諸佛，一切善根同一善根，悉無有異。",
        "translation": "All the buddhas of the three times all have the same roots of goodness as one root of goodness, without any difference.",
        "source": "T09n0278_031:0597c02_0"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0597c02_1"
    },
    {
        "source_sentence": "是為一切諸佛十種法王無異之法。",
        "translation": "These are the ten kinds of Dharma kings of all buddhas that are not different from each other.",
        "source": "T09n0278_031:0597c03_2"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0597c03_3"
    },
    {
        "source_sentence": "一切諸佛，有向十種住法。",
        "translation": "All buddhas have ten kinds of abiding dharmas that are directed toward.",
        "source": "T09n0278_031:0597c04_0"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0597c04_1"
    },
    {
        "source_sentence": "一切諸佛，悉住覺一切法界；",
        "translation": "All buddhas all abide in awakening to all realms of reality.",
        "source": "T09n0278_031:0597c04_2"
    },
    {
        "source_sentence": "一切諸佛，悉住大悲；",
        "translation": "All buddhas all abide in great compassion.",
        "source": "T09n0278_031:0597c05_3"
    },
    {
        "source_sentence": "一切諸佛，悉住本願；",
        "translation": "All buddhas all abide in the original vow.",
        "source": "T09n0278_031:0597c06_4"
    },
    {
        "source_sentence": "一切諸佛，悉住不捨教化眾生；",
        "translation": "All buddhas all abide in nonabandonment and teach sentient beings.",
        "source": "T09n0278_031:0597c06_5"
    },
    {
        "source_sentence": "一切諸佛，悉住無所依法；",
        "translation": "All buddhas all abide by the principle of nonexistence.",
        "source": "T09n0278_031:0597c07_6"
    },
    {
        "source_sentence": "一切諸佛，悉住無虛妄法；",
        "translation": "All buddhas all abide in the absence of falsehood.",
        "source": "T09n0278_031:0597c07_7"
    },
    {
        "source_sentence": "一切諸佛，悉住念無失法；",
        "translation": "All buddhas abide in mindfulness of the principle of nonfailing.",
        "source": "T09n0278_031:0597c08_8"
    },
    {
        "source_sentence": "一切諸佛，悉住無障礙心；",
        "translation": "All buddhas all abide in unobstructed minds.",
        "source": "T09n0278_031:0597c09_9"
    },
    {
        "source_sentence": "一切諸佛，悉住定心，未曾散亂；",
        "translation": "All buddhas all abide in mental concentration, never being distracted.",
        "source": "T09n0278_031:0597c09_10"
    },
    {
        "source_sentence": "一切諸佛，悉住一切諸法平等，不壞實際。",
        "translation": "All buddhas all abide in the equality of all dharmas, not destroying reality.",
        "source": "T09n0278_031:0597c10_11"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0597c11_12"
    },
    {
        "source_sentence": "是為一切諸佛向十種住法。",
        "translation": "These are the ten kinds of abiding dharmas that all buddhas aspire to.",
        "source": "T09n0278_031:0597c11_13"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0597c12_14"
    },
    {
        "source_sentence": "一切諸佛，知十種法，悉無有餘。",
        "translation": "All buddhas know ten kinds of dharmas without exception.",
        "source": "T09n0278_031:0597c12_15"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0597c13_16"
    },
    {
        "source_sentence": "一切諸佛，知過去一切法界，悉無有餘；",
        "translation": "All buddhas know all past realms of reality, without exception.",
        "source": "T09n0278_031:0597c13_17"
    },
    {
        "source_sentence": "一切諸佛，知未來一切法界，悉無有餘；",
        "translation": "All buddhas know all future realms of reality, without exception.",
        "source": "T09n0278_031:0597c14_18"
    },
    {
        "source_sentence": "一切諸佛，知現在一切法界，悉無有餘；",
        "translation": "All buddhas know all realms of reality in the present, without exception.",
        "source": "T09n0278_031:0597c15_19"
    },
    {
        "source_sentence": "一切諸佛，知一切語言道，悉無有餘；",
        "translation": "All buddhas know the paths of all languages, without exception.",
        "source": "T09n0278_031:0597c16_20"
    },
    {
        "source_sentence": "一切諸佛，知一切世間成壞，悉無有餘；",
        "translation": "All buddhas know the formation and disintegration of all worlds, without exception.",
        "source": "T09n0278_031:0597c17_21"
    },
    {
        "source_sentence": "一切諸佛，知一切眾生及其智慧，悉無有餘；",
        "translation": "All buddhas know all sentient beings and their knowledge without exception.",
        "source": "T09n0278_031:0597c18_22"
    },
    {
        "source_sentence": "一切諸佛，知一切菩薩善根上、中、下相，悉無有餘；",
        "translation": "All buddhas know all the characteristics of the roots of goodness of enlightening beings, whether they are superior, inferior, or middling.",
        "source": "T09n0278_031:0597c19_23"
    },
    {
        "source_sentence": "一切諸佛，知一切佛滿足智慧，悉無有餘；",
        "translation": "All buddhas know all buddhas’ fulfillment of knowledge and wisdom, without exception.",
        "source": "T09n0278_031:0597c20_24"
    },
    {
        "source_sentence": "一切諸佛，知一切法皆從緣起，悉無有餘；",
        "translation": "All buddhas know all things arise from conditions, without exception.",
        "source": "T09n0278_031:0597c21_25"
    },
    {
        "source_sentence": "一切諸佛，分別了知一切世界，悉無有餘；",
        "translation": "All buddhas know all worlds distinctly, without exception.",
        "source": "T09n0278_031:0597c22_26"
    },
    {
        "source_sentence": "一切諸佛，智慧分別一切法界如因陀羅網，悉無有餘。",
        "translation": "All buddhas have the wisdom to discern all realms of reality like the causal net of Indra, with no remainder.",
        "source": "T09n0278_031:0597c23_27"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0597c24_28"
    },
    {
        "source_sentence": "是為一切諸佛知十種法，悉無有餘。",
        "translation": "These are the ten kinds of dharmas that all buddhas know without exception.",
        "source": "T09n0278_031:0597c24_29"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0597c26_0"
    },
    {
        "source_sentence": "一切諸佛，有十種最勝力：大力、無量力、大功德力、尊重力、不退轉力、堅固力、不可壞力、一切世間不能思議力、一切眾生不能壞力、大力。",
        "translation": "All buddhas have ten kinds of supreme power: great power, immeasurable power, power of great virtue, power of reverence, power of nonregression, power of steadfastness, power of indestructibility, inconceivable",
        "source": "T09n0278_031:0597c26_1"
    },
    {
        "source_sentence": "「那羅延幢佛所住法。",
        "translation": "It's the Dharma where Nārayaṇa Banner Buddha lives.",
        "source": "T09n0278_031:0597c29_2"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0597c29_3"
    },
    {
        "source_sentence": "一切佛身，舉世災橫，所不能壞；",
        "translation": "The bodies of all buddhas cannot be destroyed by worldly calamities.",
        "source": "T09n0278_031:0598a01_4"
    },
    {
        "source_sentence": "諸佛命根，世間諸毒，所不能害；",
        "translation": "The vitality of buddhas cannot be harmed by worldly poisons.",
        "source": "T09n0278_031:0598a01_5"
    },
    {
        "source_sentence": "一切世界，火劫起時，不能燒熱；",
        "translation": "All worlds cannot be burnt by fire when the conflagration occurs.",
        "source": "T09n0278_031:0598a02_6"
    },
    {
        "source_sentence": "水劫起時，不能浸溺；",
        "translation": "When the water kalpa arose, they could not submerge themselves in it.",
        "source": "T09n0278_031:0598a03_7"
    },
    {
        "source_sentence": "風劫起時，不能散壞。",
        "translation": "When an eon of wind arises, it can't disintegrate.",
        "source": "T09n0278_031:0598a03_8"
    },
    {
        "source_sentence": "一切魔軍、天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、羅剎、毘舍遮、人、非人等，",
        "translation": "All the armies of Māra, gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, rāṣas, piśācīs, humans, nonhumans, and so",
        "source": "T09n0278_031:0598a04_9"
    },
    {
        "source_sentence": "一切眾生，悉雨金剛，如須彌山金剛圍山，三千大千世界，爾所等雨，",
        "translation": "All sentient beings showered rain of thunder like mountains on the polar mountain, like mountains on the periphery of the vajra mountains.",
        "source": "T09n0278_031:0598a06_10"
    },
    {
        "source_sentence": "雨於佛上，不能令佛生怖畏心，一毛不豎，行、住、坐、臥，威儀不改；",
        "translation": "It rained upon the Buddha but could not frighten him. His hair did not stand on end even for a hair, and he walked, stood, sat, or lay down without changing his manner.",
        "source": "T09n0278_031:0598a07_11"
    },
    {
        "source_sentence": "隨諸如來，所住方面，金剛雨渧，終不得下，欲雨不雨，隨如來意。",
        "translation": "According to the direction in which the Tathāgatas live, the Vajra raining thunder never goes down; it rains or doesn't rain according to what the Tathāgata wishes.",
        "source": "T09n0278_031:0598a09_12"
    },
    {
        "source_sentence": "佛所住持眾生及佛使命，尚不可害，何況如來？",
        "translation": "The sentient beings and the Buddha's mission that the Buddha abides in maintaining are still not harmless, so why wouldn't the Tathāgata?",
        "source": "T09n0278_031:0598a10_13"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0598a12_0"
    },
    {
        "source_sentence": "是為一切諸佛第一大力那羅延幢佛所住法。",
        "translation": "This is the first great power of all buddhas, the abode of Nārāyaṇa-pāda Buddha.",
        "source": "T09n0278_031:0598a12_1"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0598a13_2"
    },
    {
        "source_sentence": "一切諸佛，一切法界等世界中，須彌山王、金剛圍山、大金剛圍山，一切大海，",
        "translation": "All buddhas, in all worlds as numerous as the cosmos of all principles—the polar mountain, the diamond- surrounding mountain, the great diamond- surrounding mountain, all oceans.",
        "source": "T09n0278_031:0598a13_3"
    },
    {
        "source_sentence": "一切諸山，及一切眾生，於一毛孔，悉能容持；",
        "translation": "All the mountains and all sentient beings they can contain in a single pore.",
        "source": "T09n0278_031:0598a15_0"
    },
    {
        "source_sentence": "盡未來際劫，一切眾生，悉不自知我住何所，除佛神力，一毛悉持一切眾生；",
        "translation": "All sentient beings throughout the ages to come did not know where I dwelled.",
        "source": "T09n0278_031:0598a16_0"
    },
    {
        "source_sentence": "遍遊十方無量世界，行、住、坐、臥，而諸如來不生苦惱厭倦之心，威儀無異。",
        "translation": "They traveled to infinite worlds in the ten directions, walking, standing, sitting, and reclining, yet the enlightened ones did not give rise to pain or distress or weariness; their manners were no different.",
        "source": "T09n0278_031:0598a17_1"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0598a19_2"
    },
    {
        "source_sentence": "譬如虛空，容持一切法界等世界，不生苦惱厭倦之心；",
        "translation": "“Furthermore, it is like space that holds all the worlds of the cosmos and so forth. It does not give rise to thoughts of pain or suffering or weariness.",
        "source": "T09n0278_031:0598a19_3"
    },
    {
        "source_sentence": "一切諸佛亦復如是，於一毛孔，容持無餘世界一切眾生，不生苦惱厭倦之心。",
        "translation": "All buddhas are also like this: in a single pore they hold all sentient beings in the world without remainder. They do not give rise to thoughts of suffering, vexation, or weariness.",
        "source": "T09n0278_031:0598a21_0"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0598a22_1"
    },
    {
        "source_sentence": "是為一切諸佛第二大力那羅延幢佛所住法。",
        "translation": "This is the second great abode of all buddhas, the great Nārāyaṇa-pāda Buddha.",
        "source": "T09n0278_031:0598a23_0"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0598a24_1"
    },
    {
        "source_sentence": "一切諸佛，一步能過不可說不可說世界微塵等佛剎；",
        "translation": "All buddhas can, in a single step, pass as many buddha-lands as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598a24_2"
    },
    {
        "source_sentence": "於一念中，能行不可說不可說世界微塵等步。",
        "translation": "In a single thought, he can walk as many steps as there are atoms in an untold number of worlds.",
        "source": "T09n0278_031:0598a25_3"
    },
    {
        "source_sentence": "以如是步，經一切世界微塵等劫，於念念中，能經一切世界微塵等劫。",
        "translation": "With such a step, he can pass through all worlds for as many eons as there are grains of dust and so forth, and in each moment of thought he can pass through all worlds for as many eons as there are grains of dust and",
        "source": "T09n0278_031:0598a26_4"
    },
    {
        "source_sentence": "一金剛圍山，與上諸劫所經世界微塵佛剎等；",
        "translation": "A mountain of diamond surrounded by mountains, equal to the number of buddha-lands as numerous as atoms in all the worlds they pass through during the ages mentioned above.",
        "source": "T09n0278_031:0598a28_5"
    },
    {
        "source_sentence": "如是等不可說不可說世界微塵數，諸金剛圍山內一毛孔，一切毛孔，亦復如是。",
        "translation": "And so it is with these, as many as atoms in untold numbers of buddha-fields: the same applies to all the pores within one hair on a mountain surrounded by diamond.",
        "source": "T09n0278_031:0598a29_6"
    },
    {
        "source_sentence": "如來毛孔，悉與一切眾生毛孔數等；",
        "translation": "The Buddha’s pores were as numerous as the pores of all sentient beings.",
        "source": "T09n0278_031:0598b02_7"
    },
    {
        "source_sentence": "以如是毛孔，如是遠步，如是速疾，遊行十方一切世界，一切虛空界，",
        "translation": "Because of such hair pores, such distances, and such speed, they traveled to all worlds in the ten directions, throughout all space.",
        "source": "T09n0278_031:0598b02_8"
    },
    {
        "source_sentence": "盡過去、未來際一切諸劫；",
        "translation": "To the end of all past and future ages.",
        "source": "T09n0278_031:0598b04_9"
    },
    {
        "source_sentence": "如是諸劫，猶可窮盡，而諸如來身無羸弊，心不退沒，不捨三昧一切佛事。",
        "translation": "These eons could still be exhausted, yet the bodies of the enlightened ones were not weakened, their minds did not regress, and they did not relinquish all the buddha-works of concentration.",
        "source": "T09n0278_031:0598b05_10"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0598b06_11"
    },
    {
        "source_sentence": "是為一切諸佛第三大力那羅延幢佛所住法。",
        "translation": "This is the third great power of all buddhas, Nārāyaṇa-kāśyapa Buddha.",
        "source": "T09n0278_031:0598b07_0"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0598b08_1"
    },
    {
        "source_sentence": "一切諸佛，一食，結跏趺坐，盡過去、未來際不可說不可說一切劫，身不傾動，",
        "translation": "All buddhas, for untold eons past, future, and present, sat cross-legged without moving their bodies.",
        "source": "T09n0278_031:0598b08_2"
    },
    {
        "source_sentence": "住不思議佛住，受寂滅樂，乃至不失化一眾生。",
        "translation": "He abides in the inconceivable Buddha's abode, experiences the bliss of extinction, and doesn't lose the opportunity to transform a single sentient being.",
        "source": "T09n0278_031:0598b09_3"
    },
    {
        "source_sentence": "以一切世界，及一切眾生，安置如來一指端上，盡未來際劫；",
        "translation": "All worlds and all sentient beings were placed on the tip of a finger of the enlightened one, for an endless eon.",
        "source": "T09n0278_031:0598b11_4"
    },
    {
        "source_sentence": "彼一一眾生，其身悉如不可說不可說佛剎微塵等世界；",
        "translation": "Each of those sentient beings’ bodies were like worlds as numerous as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598b12_5"
    },
    {
        "source_sentence": "彼一一眾生，其身重如一切世界，而諸如來，身無疲倦，心無苦惱。",
        "translation": "Each of those sentient beings weighed as heavily as all the worlds, yet the Tathāgatas had no fatigue in body or mind and no suffering or distress in mind.",
        "source": "T09n0278_031:0598b13_6"
    },
    {
        "source_sentence": "如一指端，一切指端，亦復如是；",
        "translation": "So it is with the tip of one finger, and so it is with all the fingers.",
        "source": "T09n0278_031:0598b15_7"
    },
    {
        "source_sentence": "入一一世界，入虛空界，入一切方網，如是一切處虛空界，悉無有餘，",
        "translation": "He enters each world, entering the space realm, entering networks of all directions, and so on, in all places throughout space—all without exception.",
        "source": "T09n0278_031:0598b16_8"
    },
    {
        "source_sentence": "究竟法界；",
        "translation": "They reach the ultimate realm of reality.",
        "source": "T09n0278_031:0598b17_9"
    },
    {
        "source_sentence": "以一毛端，量一切世界；",
        "translation": "He measured all worlds with a hairtip.",
        "source": "T09n0278_031:0598b17_10"
    },
    {
        "source_sentence": "一一毛端處，結跏趺坐，盡過去、未來際劫。",
        "translation": "At each hairtip he sat cross-legged for past and future kalpas.",
        "source": "T09n0278_031:0598b18_11"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0598b19_12"
    },
    {
        "source_sentence": "是為一切諸佛第四大力那羅延幢佛所住法。",
        "translation": "This is the fourth great dwelling of all buddhas.",
        "source": "T09n0278_031:0598b19_13"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0598b20_14"
    },
    {
        "source_sentence": "一切諸佛，於一身化不可說不可說佛剎微塵等頭；",
        "translation": "All buddhas manifested in one body magical emanation of tiny hairs as numerous as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598b20_15"
    },
    {
        "source_sentence": "一一頭，化不可說不可說佛剎微塵等舌；",
        "translation": "Each head had magical tongues as numerous as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598b21_16"
    },
    {
        "source_sentence": "一一舌，出不可說不可說佛剎微塵等音聲，一切法界眾生，無不聞者；",
        "translation": "Each tongue uttered sounds as numerous as atoms in untold buddha-lands, and all sentient beings in the cosmos heard them.",
        "source": "T09n0278_031:0598b22_17"
    },
    {
        "source_sentence": "一一音聲，說不可說不可說佛剎微塵等修多羅；",
        "translation": "Each sound spoke of untold numbers of scriptures, as many as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598b24_18"
    },
    {
        "source_sentence": "一一修多羅，說不可說不可說佛剎微塵等法；",
        "translation": "Each one of these scriptures expounded such teachings as untold numbers of tiny particles of buddha-lands.",
        "source": "T09n0278_031:0598b25_19"
    },
    {
        "source_sentence": "一一法中，說不可說不可說佛剎微塵等句身、味身。",
        "translation": "In each dharma, it's said that there's an ineffable, ineffable buddha-body like a tiny particle of dust in a buddha-field, such as the phrase body and taste body.",
        "source": "T09n0278_031:0598b26_20"
    },
    {
        "source_sentence": "如是說法，乃至盡不可說不可說佛剎微塵等劫，復不可說不可說佛剎微塵等劫，",
        "translation": "He taught in this way for as many eons as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598b27_21"
    },
    {
        "source_sentence": "說異句身、味身，盡一切世界微塵等劫，一切眾生念等劫，盡未來際一切劫，",
        "translation": "It is said that the body of dissimilar syllables and the body of relishing last for as many kalpas as atoms in all worlds. All sentient beings have a duration of thought, which lasts for as many eons as atoms in",
        "source": "T09n0278_031:0598b29_22"
    },
    {
        "source_sentence": "此諸劫數，猶可得盡。",
        "translation": "The number of these kalpas can still be exhausted.",
        "source": "T09n0278_031:0598c02_23"
    },
    {
        "source_sentence": "如來化身說法，轉一切法，猶如火輪，自在智慧，說一切法；",
        "translation": "The Tathāgata’s apparitional body expounds the Teaching and develops all doctrines, just as a fire-wheel does. With unimpeded wisdom he teaches all doctrines.",
        "source": "T09n0278_031:0598c02_24"
    },
    {
        "source_sentence": "轉正法輪，除滅一切眾生疑惑；",
        "translation": "Turning the wheel of the right teaching, they dispel the doubts and confusions of all sentient beings.",
        "source": "T09n0278_031:0598c04_25"
    },
    {
        "source_sentence": "轉正法輪，照一切法；",
        "translation": "Turning the wheel of the right teaching, they illumine all things.",
        "source": "T09n0278_031:0598c05_0"
    },
    {
        "source_sentence": "轉正法輪，皆悉開發一切法藏；",
        "translation": "To turn the wheel of the true Teaching they develop all treasuries of teaching.",
        "source": "T09n0278_031:0598c05_1"
    },
    {
        "source_sentence": "轉正法輪，歡喜調伏，莊嚴一切眾生；",
        "translation": "Turning the wheel of the right teaching, they joyfully subdue and adorn all sentient beings.",
        "source": "T09n0278_031:0598c06_2"
    },
    {
        "source_sentence": "轉正法輪，說諸菩薩莊嚴法行；",
        "translation": "Turning the wheel of the right teaching, they teach enlightening beings the practice of adorning the Teaching.",
        "source": "T09n0278_031:0598c07_3"
    },
    {
        "source_sentence": "轉正法輪，令大乘智日，圓滿莊嚴；",
        "translation": "Turning the wheel of the right teaching, they cause the sun of knowledge of the Great Vehicle to be perfectly adorned.",
        "source": "T09n0278_031:0598c07_4"
    },
    {
        "source_sentence": "轉正法輪，令一切無餘眾生，以大乘智而自莊嚴；",
        "translation": "Turning the wheel of the right teaching, they cause all sentient beings without remainder to adorn themselves with great vehicle knowledge.",
        "source": "T09n0278_031:0598c08_5"
    },
    {
        "source_sentence": "轉正法輪，一切諸辯無畏而自莊嚴。",
        "translation": "He turns the wheel of the right teaching, adorned himself with all his eloquence and fearlessness.",
        "source": "T09n0278_031:0598c09_6"
    },
    {
        "source_sentence": "如一如來一化身，轉如是等不可譬諭法輪雲，一切法界、虛空界等世界，",
        "translation": "“Furthermore, just as a single buddha-body of one enlightenment emanates an inconceivable cloud of the wheel of teaching like this, so do all worlds such as space and the cosmos also emanate thus.",
        "source": "T09n0278_031:0598c10_7"
    },
    {
        "source_sentence": "悉以毛端周遍度量；",
        "translation": "They were all measured by the pervasiveness of their hairtip.",
        "source": "T09n0278_031:0598c12_8"
    },
    {
        "source_sentence": "一一毛端處，於念念中，化不可說不可說佛剎微塵等身，乃至盡未來際劫，",
        "translation": "In each hairtip, in each moment of thought, he emanated untold buddha-bodies as numerous as atoms in untold buddha-lands, until the end of all time.",
        "source": "T09n0278_031:0598c13_0"
    },
    {
        "source_sentence": "一一化佛身，有不可說不可說佛剎微塵等頭；",
        "translation": "In each buddha-body there were as many enlightening beings as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598c14_1"
    },
    {
        "source_sentence": "一一頭，有不可說不可說佛剎微塵等舌；",
        "translation": "Each head had as many tongues as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598c15_2"
    },
    {
        "source_sentence": "一一舌，出不可說不可說佛剎微塵等音聲；",
        "translation": "Each tongue uttered sounds as numerous as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598c16_3"
    },
    {
        "source_sentence": "一一音聲，說不可說不可說佛剎微塵等修多羅；",
        "translation": "Each sound spoke of untold numbers of scriptures, as many as atoms in untold buddha-lands.",
        "source": "T09n0278_031:0598c17_4"
    },
    {
        "source_sentence": "一一修多羅，說不可說不可說佛剎微塵等法；",
        "translation": "Each one of these scriptures expounded such teachings as untold numbers of tiny particles of buddha-lands.",
        "source": "T09n0278_031:0598c18_5"
    },
    {
        "source_sentence": "一一法中，說不可說不可說佛剎微塵等句身、味身；",
        "translation": "In each doctrine they teach untold buddha-lands, as numerous as atoms in untold buddha-lands, with phrase sets and taste sets.",
        "source": "T09n0278_031:0598c19_6"
    },
    {
        "source_sentence": "復不可說不可說佛剎微塵等劫，說異句身、味身，音聲充滿法界，一切眾生，",
        "translation": "“Furthermore, it cannot be said that in as many eons as atoms in untold buddha-lands they are said to have different sets of syllables and tastes, sounds filling the cosmos, all sentient beings.",
        "source": "T09n0278_031:0598c21_7"
    },
    {
        "source_sentence": "無不聞者；",
        "translation": "There is no one who does not hear it.",
        "source": "T09n0278_031:0598c22_8"
    },
    {
        "source_sentence": "盡一切未來際劫，常轉法輪，如來音聲，無異無斷，不可窮盡。",
        "translation": "Throughout all future ages they always turn the wheel of teaching, and the voice of Buddha is unchanging, uninterrupted, inexhaustible.",
        "source": "T09n0278_031:0598c23_9"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0598c24_10"
    },
    {
        "source_sentence": "是為一切諸佛第五大力那羅延幢佛所住法。",
        "translation": "This is the fifth great power of all buddhas, the abode of Nārāyaṇa-pāda Buddha.",
        "source": "T09n0278_031:0598c24_11"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0598c25_12"
    },
    {
        "source_sentence": "一切諸佛，成就勝妙大莊嚴，胸德字相，猶如金剛，不可破壞。",
        "translation": "All the buddhas have accomplished a most sublime great adornment, with their chests of virtue and characteristics like adamantine, indestructible.",
        "source": "T09n0278_031:0598c25_13"
    },
    {
        "source_sentence": "如來坐彼菩提樹下，有無量化魔王軍眾，悉與一切眾生數等，雜惡形色，",
        "translation": "The Buddha was seated at the foot of that tree of enlightenment, accompanied by innumerable armies of magical Māra kings, all equal in number to all sentient beings, with various bad forms and colors.",
        "source": "T09n0278_031:0598c27_14"
    },
    {
        "source_sentence": "甚可怖畏，能發狂亂，悉能恐怖一切世間；",
        "translation": "They are terrifying and fearsome, able to cause all kinds of disturbances, able to frighten all worlds.",
        "source": "T09n0278_031:0598c28_15"
    },
    {
        "source_sentence": "如是等眾，充滿虛空、法界等一切世界，雜惡形色，甚可怖畏，能發狂亂，",
        "translation": "Such a multitude fills all the worlds of space and the cosmos, with mixed bad forms that are terrifying and can cause confusion.",
        "source": "T09n0278_031:0599a01_0"
    },
    {
        "source_sentence": "能令一切眾生怖畏，能壞一切世間，能害一切眾生。",
        "translation": "They can cause all sentient beings to fear, destroy all worlds, and harm all sentient beings.",
        "source": "T09n0278_031:0599a02_1"
    },
    {
        "source_sentence": "如來見已心無恐怖，一毛不豎，顏無異容，乃至不生一念微畏之相，心安不動，",
        "translation": "Having seen him, the Tathāgata was not frightened in his mind. Not even a hair on his body stood on end; his countenance did not show any sign of dissimilarity, and he did not give rise to a single thought of fear.",
        "source": "T09n0278_031:0599a03_2"
    },
    {
        "source_sentence": "形色無異，遠離覺觀，心常寂靜，究竟遠離一切恐怖，除滅一切愛恚煩惱；",
        "translation": "Their forms and forms are no different, they are far removed from perception and contemplation. Their minds are always quiescent; ultimately free of all fears, they extinguish all afflictions of craving and hatred.",
        "source": "T09n0278_031:0599a05_3"
    },
    {
        "source_sentence": "安住佛住，具足無礙大慈之力，住大悲住，諸根寂靜，永離恐怖；",
        "translation": "They dwell in the abode of buddhahood, imbued with the power of unhindered great compassion; they dwell in the abode of great compassion. Their faculties are quiescent, forever free from fear.",
        "source": "T09n0278_031:0599a07_4"
    },
    {
        "source_sentence": "胸德字相，不可破壞，堅固真實。",
        "translation": "The characteristic mark of virtue in the chest is indestructible, resolute, and true.",
        "source": "T09n0278_031:0599a09_0"
    },
    {
        "source_sentence": "一切諸魔、魔天眷屬，見如來已，皆悉歸依。",
        "translation": "All the Māras and their retinues saw the Tathāgata, and they all relied on him.",
        "source": "T09n0278_031:0599a09_1"
    },
    {
        "source_sentence": "如來於彼三輪教化，皆令調伏，發菩提心，悉不退轉，乃至令得無上菩提。",
        "translation": "The Tathāgata teaches and transforms those three wheels so that they are all disciplined, give rise to the mind of enlightenment, don't regress, and attain unsurpassed enlightenment.",
        "source": "T09n0278_031:0599a10_2"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0599a12_3"
    },
    {
        "source_sentence": "是為一切諸佛第六大力那羅延幢佛所住法。",
        "translation": "This is the sixth great dwelling of all buddhas.",
        "source": "T09n0278_031:0599a12_4"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0599a13_5"
    },
    {
        "source_sentence": "一切諸佛，出無障礙微妙音聲，皆悉充滿一切世界，隨所應度，無不聞者。",
        "translation": "All buddhas utter unobstructed subtle sounds filling all worlds, and there is no one who fails to hear them, according to where they should be liberated.",
        "source": "T09n0278_031:0599a13_6"
    },
    {
        "source_sentence": "彼諸如來所出音聲，一切眾山，所不能障；",
        "translation": "The sounds produced by those buddhas cannot be obstructed by any of the mountains.",
        "source": "T09n0278_031:0599a15_7"
    },
    {
        "source_sentence": "須彌山王、寶山、小金剛圍山、大金剛圍山，所不能障；",
        "translation": "They cannot be obstructed by the mountains of the polar mountain, the mountains of jewels, the small diamond mountain ranges, or the great diamond ranges.",
        "source": "T09n0278_031:0599a16_8"
    },
    {
        "source_sentence": "天宮、龍宮，夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人、非人等，",
        "translation": "The heavenly palaces, the dragon palaces, the yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T09n0278_031:0599a17_9"
    },
    {
        "source_sentence": "一切宮殿，所不能障；",
        "translation": "All the palaces were not to be obstructed.",
        "source": "T09n0278_031:0599a19_10"
    },
    {
        "source_sentence": "一切世界高大音聲，亦不能障；",
        "translation": "All the great sounds in all worlds cannot be obstructed by them.",
        "source": "T09n0278_031:0599a19_11"
    },
    {
        "source_sentence": "隨其所應，皆悉聞之，無所障礙。",
        "translation": "They hear whatever they should, without any hindrance or obstruction.",
        "source": "T09n0278_031:0599a20_12"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0599a21_13"
    },
    {
        "source_sentence": "是為一切諸佛第七大力那羅延幢佛所住法。",
        "translation": "This is the seventh great dwelling of all buddhas.",
        "source": "T09n0278_031:0599a21_14"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0599a22_15"
    },
    {
        "source_sentence": "一切諸佛，心無障礙，於不可說不可說億那由他劫，心常清淨。",
        "translation": "The minds of all buddhas are unobstructed, and for incalculable millions of eons their minds are always pure.",
        "source": "T09n0278_031:0599a22_16"
    },
    {
        "source_sentence": "三世諸佛，離垢清淨，同一莊嚴，離我、我所，於一切法，亦無所依，",
        "translation": "The buddhas of all times, free from defilement and purity, are the same adornment. Free from self and what belongs to self, they do not rely on anything.",
        "source": "T09n0278_031:0599a24_17"
    },
    {
        "source_sentence": "非內、非外，非生、非不生；",
        "translation": "Neither internal nor external, neither produced nor unproduced.",
        "source": "T09n0278_031:0599a25_18"
    },
    {
        "source_sentence": "離一切境界，寂滅無處，無所造作；",
        "translation": "Being free of all objects, they are silent and have no place to be. They do not create anything.",
        "source": "T09n0278_031:0599a26_19"
    },
    {
        "source_sentence": "離種種相，除滅一切虛妄取相，自然清淨；",
        "translation": "Being free of various marks, they annihilate all falsely grasped marks and are naturally pure.",
        "source": "T09n0278_031:0599a27_0"
    },
    {
        "source_sentence": "離諸境界，無所憶念，隨順境界無諍之法；",
        "translation": "Being free of objects, they do not think of anything. They accord with objects and have no angry thoughts.",
        "source": "T09n0278_031:0599a28_0"
    },
    {
        "source_sentence": "離欲清淨，住真實際，說法界際，法界平等而無有盡，一切眾生，莫能知者。",
        "translation": "They are free from desire and purified, abide in true reality, teach the Dharma realm without distinction, equanimity in the Dharma realm without end, which no sentient beings can know.",
        "source": "T09n0278_031:0599a29_0"
    },
    {
        "source_sentence": "永離一切有為、無為，捨離一切言語道境界，究竟無礙無盡法界；",
        "translation": "“Great enlightening beings are forever free of all conditioned and all unconditioned, abandoning the realm of all paths of verbal expression. They ultimately arrive at the inexhaustible realm of reality which is unobstructed.",
        "source": "T09n0278_031:0599b01_1"
    },
    {
        "source_sentence": "隨智慧轉十力莊嚴，淨一切法，行巧方便；",
        "translation": "In accord with knowledge they develop the embellishments of the ten powers, purifying all things, practicing skill in means.",
        "source": "T09n0278_031:0599b03_2"
    },
    {
        "source_sentence": "說種種法相即一法相，一切法相，不相違背；",
        "translation": "He teaches that the various characteristics of dharmas are one characteristic of dharmas, and all characteristics of dharmas are not contradictory.",
        "source": "T09n0278_031:0599b04_3"
    },
    {
        "source_sentence": "不壞三世於一切法界，究竟自在，到於彼岸；",
        "translation": "They do not destroy the three worlds in all realms of reality. Ultimately free, they reach the other shore.",
        "source": "T09n0278_031:0599b05_4"
    },
    {
        "source_sentence": "具足甚深自在法藏，一切方便；",
        "translation": "They are endowed with the profound, self-contained treasury of truth and all skillful means.",
        "source": "T09n0278_031:0599b06_5"
    },
    {
        "source_sentence": "離癡正念，安住十方一切佛剎而無動轉；",
        "translation": "Being free of delusion and right mindfulness, they abide in all buddha-lands in the ten directions without moving.",
        "source": "T09n0278_031:0599b07_6"
    },
    {
        "source_sentence": "具不死智，盡一切漏，究竟諸法，證於無漏；",
        "translation": "They are endowed with immortal knowledge, extinguishing all contaminants. Having perfected all the teachings, they realize the uncontaminated.",
        "source": "T09n0278_031:0599b08_7"
    },
    {
        "source_sentence": "心慧解脫，究竟實際，住無礙住，常定無亂；",
        "translation": "The liberation of mind, intellect, and wisdom is ultimately real. Abiding in unobstructed abiding, it is always concentrated without confusion.",
        "source": "T09n0278_031:0599b09_8"
    },
    {
        "source_sentence": "於三世法，無有障礙；",
        "translation": "There is no obstruction in the teachings of the three time periods.",
        "source": "T09n0278_031:0599b10_9"
    },
    {
        "source_sentence": "於一念中，悉了三世一切眾生心心所行。",
        "translation": "In a single thought, he fully understands the minds and mental activities of all sentient beings in the three times.",
        "source": "T09n0278_031:0599b10_10"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0599b11_11"
    },
    {
        "source_sentence": "是為一切諸佛第八大力那羅延幢佛所住法。",
        "translation": "This is the eighth great power of all buddhas, the abode of Nārāyaṇa-pāda Buddha.",
        "source": "T09n0278_031:0599b11_12"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0599b12_13"
    },
    {
        "source_sentence": "一切諸佛，具足成就細密法身，諸佛法身，境界無量。",
        "translation": "All buddhas are fully endowed with the subtle and mysterious Dharma body, and the Dharma body of all buddhas has an infinite sphere.",
        "source": "T09n0278_031:0599b12_14"
    },
    {
        "source_sentence": "一切世間，所不能知，於三界中，無所染污，隨因緣應，一切普現。",
        "translation": "All worlds are unknowable, and there's nothing defiled in the three realms that appears universally according to causes and conditions.",
        "source": "T09n0278_031:0599b14_15"
    },
    {
        "source_sentence": "非實、非虛，平等清淨，非去、非來，無為、無壞，清淨常住；",
        "translation": "They are neither real nor false, impartial and pure; they do not go or come. They are unconditioned and indestructible, pure and eternally abiding.",
        "source": "T09n0278_031:0599b15_16"
    },
    {
        "source_sentence": "一相、無相，是法身相，非處、非方，一切身身，自在無量，妙色無量，",
        "translation": "The single characteristic mark and signlessness are the characteristics of the Dharma body, which is neither in a place nor in a direction. All bodily bodies have unrestricted unlimited freedom and infinite subtle form.",
        "source": "T09n0278_031:0599b17_0"
    },
    {
        "source_sentence": "攝一切身，作種種身，隨方便身，普照一切，具足智藏，而無種種分別。",
        "translation": "He embraces all bodies, creates various bodies, follows the body of skillful means, illuminates all, possesses the store of knowledge, and doesn't have various distinctions.",
        "source": "T09n0278_031:0599b18_1"
    },
    {
        "source_sentence": "其身充滿無餘世界，說一切法界，雖動非動，清淨法身，非有、非無，",
        "translation": "His body fills all worlds without remainder, explaining all realms of reality. Though it moves and doesn’t move, the pure body of reality is neither existent nor nonexistent.",
        "source": "T09n0278_031:0599b20_2"
    },
    {
        "source_sentence": "非方便、非不方便，隨眾生所應，悉能示現；",
        "translation": "Whatever sentient beings may need, they can show it.",
        "source": "T09n0278_031:0599b21_3"
    },
    {
        "source_sentence": "非滅、非不滅，亦非不現，而化眾生；",
        "translation": "He does not perish, does not do not perish, and neither does he manifest; yet he develops sentient beings.",
        "source": "T09n0278_031:0599b22_4"
    },
    {
        "source_sentence": "一切功德寶所起之身，一切法佛法起，如如法身自然寂靜。",
        "translation": "The body produced by all the jewels of merit, all the teachings and buddha-teachings arise, and the Dharma body is naturally quiescent as it is.",
        "source": "T09n0278_031:0599b23_5"
    },
    {
        "source_sentence": "於一切法，無所障礙，隨順一切法界，清淨一切世間，分別一切世間，",
        "translation": "They have no obstruction in all things, follow all realms of reality, purify all worlds, and analyze all worlds.",
        "source": "T09n0278_031:0599b24_6"
    },
    {
        "source_sentence": "無有動轉，無有境界，如來解脫，攝一切智，隨順一切身。",
        "translation": "The liberation of the enlightened one embraces omniscience and follows all bodies.",
        "source": "T09n0278_031:0599b26_7"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0599b27_8"
    },
    {
        "source_sentence": "是為一切諸佛第九大力那羅延幢佛所住法。",
        "translation": "This is the ninth great dwelling of all buddhas, the great Nārāyaṇa-pāda Buddha.",
        "source": "T09n0278_031:0599b27_9"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0599b29_0"
    },
    {
        "source_sentence": "一切諸佛，正覺悉等，出生一切諸菩薩行，所行不虛，滿足深願，淨菩薩行，",
        "translation": "All buddhas, all true enlightened ones, and so on, produce all the practices of enlightening beings. Their practices are not false; fulfilling their profound vows, they purify the practices of enlightening beings.",
        "source": "T09n0278_031:0599b29_1"
    },
    {
        "source_sentence": "具足一切菩薩行智。",
        "translation": "They are endowed with all the bodhisattva's knowledge of practice.",
        "source": "T09n0278_031:0599c01_2"
    },
    {
        "source_sentence": "一切諸佛，修菩薩行，悉無有異，善分別知一切菩薩行，滿足菩薩諸大願海，",
        "translation": "All buddhas practice the deeds of enlightening beings, without any difference. They know the practices of all enlightening beings and fulfill the ocean of great vows of enlightening beings.",
        "source": "T09n0278_031:0599c02_3"
    },
    {
        "source_sentence": "離一切惡，生諸善行，修菩薩行，皆悉清淨。",
        "translation": "Being free of all evil, they give rise to good actions and cultivate the practices of enlightening beings, all pure.",
        "source": "T09n0278_031:0599c04_4"
    },
    {
        "source_sentence": "隨順一切佛，寂然不放逸，住一切三昧無量境界，能教一切勝道，遠離一切惡道；",
        "translation": "They follow all buddhas, remain silent and uninvolved; they abide in all concentrations with immeasurable spheres. They can teach all the supreme paths and be far removed from all states of woe.",
        "source": "T09n0278_031:0599c05_5"
    },
    {
        "source_sentence": "究竟彼岸，具足成就第一智力；",
        "translation": "They reach the farthest shore, fully developing the supreme power of knowledge.",
        "source": "T09n0278_031:0599c07_6"
    },
    {
        "source_sentence": "雨無畏法雨，隨其所問，悉能善答，方便說法，智慧平等，周遍清淨，",
        "translation": "They shower the rain of fearless doctrine, able to answer questions as they are asked. They teach the Dharma skillfully and expediently, impartial in knowledge and wisdom, all pure everywhere.",
        "source": "T09n0278_031:0599c07_7"
    },
    {
        "source_sentence": "身、口、意業，皆悉清淨。",
        "translation": "bodily, verbal, and mental actions are all pure.",
        "source": "T09n0278_031:0599c09_8"
    },
    {
        "source_sentence": "住諸佛住，諸佛種姓，佛智所作，悉不退轉，一切種智，分別無量無邊諸住，",
        "translation": "They abide in the abode of buddhas, the abodes of buddhas, the castes of buddhas, what buddha-knowledge does, they don’t regress at all. All kinds of knowledge discriminates measureless and boundless abodes",
        "source": "T09n0278_031:0599c09_9"
    },
    {
        "source_sentence": "一切智明，隨順智慧，不可思議，一切世間所不能解。",
        "translation": "The knowledge of all things is clear, and following that knowledge is inconceivable, unfathomable to all the worlds.",
        "source": "T09n0278_031:0599c11_10"
    },
    {
        "source_sentence": "智慧明淨，知一切法，微細智慧，無量無邊，善能分別一切三世；",
        "translation": "“Great enlightening beings’ knowledge and insight are clear and pure, knowing all things; their subtle knowledge and insight are immeasurable and boundless, able to analyze all times.",
        "source": "T09n0278_031:0599c12_11"
    },
    {
        "source_sentence": "智慧微妙，覺悟一切世界，具足了知無上道義，於一切世間，作不可說佛事；",
        "translation": "Their knowledge and wisdom subtle, enlightening all worlds, fully comprehending the meaning of the supreme path. In all worlds they do untold buddha-works.",
        "source": "T09n0278_031:0599c14_12"
    },
    {
        "source_sentence": "智慧不退，成就一切諸如來身，入算數智，決定了知一切諸法，捨離文字，",
        "translation": "Their knowledge and wisdom do not regress, they develop the bodies of all enlightened ones. Entering mathematical knowledge, they are certain to know all things with certainty, leaving words behind.",
        "source": "T09n0278_031:0599c16_13"
    },
    {
        "source_sentence": "言語道斷，而善能說一切文字，行淨善法，滿普賢智。",
        "translation": "The path of language is cut off, yet they can skillfully explain all words, practice pure good qualities, and fulfill the knowledge of Samantabhadra.",
        "source": "T09n0278_031:0599c17_14"
    },
    {
        "source_sentence": "於一念中，悉能覺了一切諸法，隨淨眾生，隨所應乘，悉能法施；",
        "translation": "In a single thought they were able to perceive all things; in accord with the purity of sentient beings, according to their capacities, they were able to give teachings.",
        "source": "T09n0278_031:0599c19_15"
    },
    {
        "source_sentence": "以明淨智，解一切法境界，一切世界境界，一切眾生境界。",
        "translation": "By clarifying pure cognition, they understand the sphere of all dharmas, the spheres of all worlds, and the spheres of all sentient beings.",
        "source": "T09n0278_031:0599c20_16"
    },
    {
        "source_sentence": "於一念中，悉能知見三世法界，一切如來出世境界，一切教化境界，未曾失時，",
        "translation": "In a single thought they were able to know and see the realm of reality in all times, the transcendent sphere of all enlightened ones, the sphere of all teachings, without ever losing time.",
        "source": "T09n0278_031:0599c21_17"
    },
    {
        "source_sentence": "至於一切清淨境界，覺一切境界，皆悉究竟。",
        "translation": "As for all pure realms, he perceives all realms and completely perfects them.",
        "source": "T09n0278_031:0599c23_18"
    },
    {
        "source_sentence": "於一念中，覺悟三世眾生，心、意、識、行，諸佛平等；",
        "translation": "In a single thought they awaken the minds, thoughts, consciousnesses, and volitions of sentient beings of all times. The buddhas are equal in their equality.",
        "source": "T09n0278_031:0599c24_19"
    },
    {
        "source_sentence": "眾生無邊、世界無邊、法界無邊、三世無邊、一切諸佛自在無邊，覺如是等，",
        "translation": "Sentient beings are boundless, worlds are boundless, realms of reality are boundless, past, present, and future are boundless, all buddhas’ freedom is boundless.",
        "source": "T09n0278_031:0599c25_20"
    },
    {
        "source_sentence": "無有障礙。",
        "translation": "There's no obstruction.",
        "source": "T09n0278_031:0599c27_21"
    },
    {
        "source_sentence": "諸佛智慧，諸佛自在，轉無量無邊諸佛所住，住無礙住，無礙心住，住大悲住，",
        "translation": "“The buddhas’ knowledge and wisdom, the unimpededness of all buddhas, develops innumerable, boundless buddhas. They abide in unhindered abiding, unobstructed mind abiding, great compassion abiding.",
        "source": "T09n0278_031:0599c27_22"
    },
    {
        "source_sentence": "廣說深法，教化眾生，心無休息。",
        "translation": "He extensively taught the profound Dharma, teaching and transforming sentient beings without resting his mind.",
        "source": "T09n0278_031:0599c29_23"
    },
    {
        "source_sentence": "是為一切諸佛第十大力那羅延幢佛所住法。",
        "translation": "This is the tenth great power of all buddhas, the abode of Nārāyaṇa-buddha.",
        "source": "T09n0278_031:0600a01_24"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0600a02_25"
    },
    {
        "source_sentence": "是為一切諸佛十種大力那羅延幢佛所住法，無量無邊，不可思議，三世一切眾生，",
        "translation": "These are the ten great principles by which all buddhas abide. They are immeasurable, boundless, and inconceivable to all sentient beings of all times.",
        "source": "T09n0278_031:0600a02_26"
    },
    {
        "source_sentence": "聲聞、緣覺，皆不能知，除佛神力。",
        "translation": "Neither śrāvakas nor pratyekbuddhas can know it, except by the Buddha's supernormal power.",
        "source": "T09n0278_031:0600a04_27"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0600a06_0"
    },
    {
        "source_sentence": "一切諸佛，有十種定法。",
        "translation": "All buddhas have ten kinds of determined factors:",
        "source": "T09n0278_031:0600a06_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0600a06_2"
    },
    {
        "source_sentence": "一切諸佛，定於兜率天，盡其壽命；",
        "translation": "All buddhas were fixed in Tuṣita Heaven for the rest of their lives.",
        "source": "T09n0278_031:0600a06_3"
    },
    {
        "source_sentence": "一切諸佛，定示現處胎，滿十月生；",
        "translation": "All buddhas are certain to appear in the womb for ten full months.",
        "source": "T09n0278_031:0600a07_4"
    },
    {
        "source_sentence": "一切諸佛，定捨宮館，樂行出家；",
        "translation": "All buddhas definitely abandon their palaces and abodes, delight in practice, and leave home.",
        "source": "T09n0278_031:0600a08_5"
    },
    {
        "source_sentence": "一切諸佛，定坐菩提樹下，覺一切法；",
        "translation": "All buddhas sat quietly under the tree of enlightenment, perceiving all truths.",
        "source": "T09n0278_031:0600a09_6"
    },
    {
        "source_sentence": "一切諸佛，定一念中，覺一切佛法，於一切世界，普現如來神力自在；",
        "translation": "All buddhas, awakening to the teachings of all buddhas in a single instant of concentration, manifest Buddha’s mystic power and mastery in all worlds.",
        "source": "T09n0278_031:0600a10_7"
    },
    {
        "source_sentence": "一切諸佛，定隨時教化，轉正法輪；",
        "translation": "All buddhas always teach and inspire at appropriate times, turning the wheel of teaching.",
        "source": "T09n0278_031:0600a11_8"
    },
    {
        "source_sentence": "一切諸佛，定知隨時種諸善根，為彼授記；",
        "translation": "All buddhas definitely know the timely planting of roots of goodness, and they predict them for them.",
        "source": "T09n0278_031:0600a12_9"
    },
    {
        "source_sentence": "一切諸佛，定隨應時，不失佛事；",
        "translation": "All buddhas do not lose the deeds of buddhahood at any time.",
        "source": "T09n0278_031:0600a13_10"
    },
    {
        "source_sentence": "一切諸佛，定知菩薩功德具足，而為授記；",
        "translation": "All buddhas definitely know the enlightening being’s excellence of virtue, and they predict it to them.",
        "source": "T09n0278_031:0600a14_11"
    },
    {
        "source_sentence": "一切諸佛，定隨眾生一切問難，於一念中，悉能善答。",
        "translation": "All buddhas can answer all the questions and difficulties of sentient beings with certainty in a single thought.",
        "source": "T09n0278_031:0600a15_12"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0600a16_13"
    },
    {
        "source_sentence": "是為一切諸佛十種定法。",
        "translation": "These are the ten kinds of determined dharmas of all buddhas.",
        "source": "T09n0278_031:0600a16_14"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0600a17_15"
    },
    {
        "source_sentence": "一切諸佛，有十種法，若有眾生，見如來者，皆悉疾得十種果報。",
        "translation": "All buddhas have ten kinds of dharmas, and if sentient beings see the Tathāgata, they'll all quickly attain ten kinds of fruitful rewards.",
        "source": "T09n0278_031:0600a17_16"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0600a19_17"
    },
    {
        "source_sentence": "若有眾生，見如來者，疾得遠離一切惡道；",
        "translation": "If there are any sentient beings who see the Buddha, they will quickly be freed from all evil states.",
        "source": "T09n0278_031:0600a19_18"
    },
    {
        "source_sentence": "若有眾生，見如來者，疾得長養一切善根；",
        "translation": "If there are any sentient beings who see the Buddha, they will quickly grow and nourish all roots of goodness.",
        "source": "T09n0278_031:0600a20_19"
    },
    {
        "source_sentence": "若有眾生，見如來者，疾得滿足一切善根；",
        "translation": "If there are any sentient beings who see the Buddha, they will quickly be able to fulfill all roots of goodness.",
        "source": "T09n0278_031:0600a21_20"
    },
    {
        "source_sentence": "若有眾生，見如來者，疾得往生淨妙天上；",
        "translation": "If there are any sentient beings who see the Buddha, they will quickly be reborn in a pure and wonderful heaven.",
        "source": "T09n0278_031:0600a22_21"
    },
    {
        "source_sentence": "若有眾生，見如來者，疾得除滅一切疑惑；",
        "translation": "If there are any sentient beings who see the Buddha, they will quickly be freed from all doubt and confusion.",
        "source": "T09n0278_031:0600a23_22"
    },
    {
        "source_sentence": "若有眾生，見如來者，已發菩提心者疾得不退轉，未發心者速發阿耨多羅三藐三菩提心；",
        "translation": "If there are any sentient beings who see the Buddha, those who have set their minds on enlightenment will quickly attain nonregression; those who have not set their minds on enlightenment will quickly set their minds on unexcelled",
        "source": "T09n0278_031:0600a24_23"
    },
    {
        "source_sentence": "若有眾生，見如來者，未得離生聖道，除滅有見，速令正取離生聖道；",
        "translation": "If there are any sentient beings who see the enlightened ones, they do not attain the noble path of separation from birth. Removing views that arise in order to extinguish craving, they quickly cause them to correctly gras",
        "source": "T09n0278_031:0600a26_24"
    },
    {
        "source_sentence": "若有眾生，見如來者，速令清淨世間、離世間一切諸根；",
        "translation": "If there are any sentient beings who see the Buddha, they will speedily purify all worldly and transmundane faculties.",
        "source": "T09n0278_031:0600a28_25"
    },
    {
        "source_sentence": "若有眾生，見如來者，疾得除滅一切障礙；",
        "translation": "If there are any sentient beings who see the Buddha, they will be speedily able to remove all obstructions.",
        "source": "T09n0278_031:0600a29_26"
    },
    {
        "source_sentence": "若有眾生，見如來者，疾得無畏不斷辯才。",
        "translation": "If there are sentient beings who see the Tathāgata, they'll quickly attain fearlessness and not stop their eloquence.",
        "source": "T09n0278_031:0600b01_27"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0600b02_28"
    },
    {
        "source_sentence": "是為一切諸佛，眾生見者，皆悉疾得十種果報。",
        "translation": "These are the ten kinds of rewards that all buddhas and sentient beings who see them will quickly attain.",
        "source": "T09n0278_031:0600b02_29"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0600b03_30"
    },
    {
        "source_sentence": "一切諸佛，有十種清淨法，一切菩薩，應常正念。",
        "translation": "All buddhas have ten kinds of pure dharmas, which all bodhisattvas should always correctly remember.",
        "source": "T09n0278_031:0600b03_31"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0600b05_0"
    },
    {
        "source_sentence": "一切諸佛，過去方便，一切菩薩應常正念；",
        "translation": "All buddhas, past techniques, should always be correctly remembered by enlightening beings.",
        "source": "T09n0278_031:0600b05_1"
    },
    {
        "source_sentence": "一切諸佛，清淨妙行，一切菩薩應常正念；",
        "translation": "All buddhas’ pure and subtle practices should always be correctly remembered by enlightening beings.",
        "source": "T09n0278_031:0600b06_2"
    },
    {
        "source_sentence": "一切諸佛，滿足波羅蜜，一切菩薩應常正念；",
        "translation": "All buddhas’ fulfillment of the transcendent ways should always be correctly remembered by enlightening beings.",
        "source": "T09n0278_031:0600b07_3"
    },
    {
        "source_sentence": "一切諸佛，滿足大願，一切菩薩應常正念；",
        "translation": "All buddhas fulfill great vows, and all enlightening beings should always be correctly mindful.",
        "source": "T09n0278_031:0600b08_4"
    },
    {
        "source_sentence": "一切諸佛，功德積聚，一切菩薩應常正念；",
        "translation": "All buddhas, the accumulation of virtues, should always be correctly remembered by enlightening beings.",
        "source": "T09n0278_031:0600b09_5"
    },
    {
        "source_sentence": "一切諸佛，過去梵行，一切菩薩應常正念；",
        "translation": "All buddhas’ religious practices of the past should always be correctly remembered by enlightening beings.",
        "source": "T09n0278_031:0600b10_0"
    },
    {
        "source_sentence": "一切諸佛，成等正覺，一切菩薩應常正念；",
        "translation": "All buddhas attain perfect enlightenment, and all enlightening beings should always be correctly mindful.",
        "source": "T09n0278_031:0600b10_1"
    },
    {
        "source_sentence": "一切諸佛，色身無量無邊，一切菩薩應常正念；",
        "translation": "All buddhas’ physical forms are immeasurable and boundless, all enlightening beings should always be correctly mindful.",
        "source": "T09n0278_031:0600b11_2"
    },
    {
        "source_sentence": "一切諸佛，無量無邊神力境界，一切菩薩應常正念；",
        "translation": "All buddhas’ infinite, boundless realms of mystic powers should always be correctly remembered by all enlightening beings.",
        "source": "T09n0278_031:0600b12_3"
    },
    {
        "source_sentence": "一切諸佛，十力無畏，一切菩薩應常正念。",
        "translation": "All buddhas have the ten powers and fearlessnesses, and all bodhisattvas should always be correctly mindful of them.",
        "source": "T09n0278_031:0600b14_4"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0600b15_5"
    },
    {
        "source_sentence": "是為一切諸佛十種清淨法，一切菩薩應常正念。",
        "translation": "These are the ten kinds of pure dharmas of all buddhas, which all bodhisattvas should always correctly remember.",
        "source": "T09n0278_031:0600b15_6"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0600b17_0"
    },
    {
        "source_sentence": "一切諸佛，有十種一切智住。",
        "translation": "All buddhas have ten kinds of the abode of omniscience.",
        "source": "T09n0278_031:0600b17_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0600b17_2"
    },
    {
        "source_sentence": "一切諸佛，於一念中，悉知一切法界三世一切眾生心心所行；",
        "translation": "All buddhas instantly know the minds and actions of all sentient beings in all universes, past, present, and future.",
        "source": "T09n0278_031:0600b18_3"
    },
    {
        "source_sentence": "一切諸佛，於一念中，悉善分別三世一切眾生種種業報；",
        "translation": "All buddhas can instantly distinguish the various consequences of actions of all sentient beings of past, present, and future in a single thought.",
        "source": "T09n0278_031:0600b19_4"
    },
    {
        "source_sentence": "一切諸佛，於一念中，隨一切眾生所應度者，或以神足，或以教誡，或以說法，",
        "translation": "All buddhas, in a single thought, do as all sentient beings need to be liberated, sometimes by spiritual feet, sometimes by instruction, sometimes by teaching.",
        "source": "T09n0278_031:0600b20_5"
    },
    {
        "source_sentence": "而教化之；",
        "translation": "They lead and inspire them.",
        "source": "T09n0278_031:0600b22_6"
    },
    {
        "source_sentence": "一切諸佛，於一念中，悉能善取一切法界十方眾生諸心心相，示現一切世間如來出世；",
        "translation": "All buddhas can, in a single thought, skillfully grasp the minds and mental patterns of all sentient beings in the ten directions throughout the cosmos of reality and manifest all worldly enlightening beings appearing in the world.",
        "source": "T09n0278_031:0600b22_7"
    },
    {
        "source_sentence": "一切諸佛，於一念中，隨一切法界中一切眾生，希望欲性，所應化度，",
        "translation": "All buddhas, in a single thought, follow all sentient beings in all the realms of reality according to their aspirations and desires for enlightenment.",
        "source": "T09n0278_031:0600b24_8"
    },
    {
        "source_sentence": "令見如來；",
        "translation": "I cause them to see the enlightened ones.",
        "source": "T09n0278_031:0600b26_9"
    },
    {
        "source_sentence": "一切諸佛，於一念中，示現一切法界中一切眾生，如來住持神力自在；",
        "translation": "All buddhas, in a single thought, show all sentient beings in all realms of reality—the enlightened one abiding and maintaining spiritual power freely.",
        "source": "T09n0278_031:0600b26_10"
    },
    {
        "source_sentence": "一切諸佛，為一切法界中一切眾生，說一切佛，離諸熾然，隨其所應，",
        "translation": "All buddhas teach all buddhas to all sentient beings in all realms of reality. Free from the blazing fire, they do as they should:",
        "source": "T09n0278_031:0600b28_11"
    },
    {
        "source_sentence": "化度眾生；",
        "translation": "I elucidate and liberate sentient beings.",
        "source": "T09n0278_031:0600c01_0"
    },
    {
        "source_sentence": "一切諸佛，於一念中，以一切至處道，悉知一切法界中一切眾生彼彼諸趣；",
        "translation": "All buddhas instantly know all sentient beings in all realms of reality, wherever they may be, in a single thought.",
        "source": "T09n0278_031:0600c01_1"
    },
    {
        "source_sentence": "一切諸佛，於一念中，一切法界中，一切方處，一切眾生，念如來者，",
        "translation": "All buddhas, in a single thought, all realms of reality, all directions, and all sentient beings are mindful of the Enlightened One.",
        "source": "T09n0278_031:0600c03_0"
    },
    {
        "source_sentence": "悉令得見；",
        "translation": "They cause all to see.",
        "source": "T09n0278_031:0600c04_1"
    },
    {
        "source_sentence": "一切諸佛，於一念中，隨一切法界中眾生心之所樂，如來形色，悉令得見。",
        "translation": "All buddhas, in a single thought, cause the forms and forms of Buddhas to be seen according to the mental pleasures of sentient beings in all realms of reality.",
        "source": "T09n0278_031:0600c04_2"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0600c06_3"
    },
    {
        "source_sentence": "是為一切諸佛十種一切智住。",
        "translation": "These are the ten kinds of omniscience abodes of all buddhas.",
        "source": "T09n0278_031:0600c06_4"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0600c07_5"
    },
    {
        "source_sentence": "一切諸佛，有十種無量不可思議三昧。",
        "translation": "All buddhas have ten kinds of immeasurable and inconceivable concentration.",
        "source": "T09n0278_031:0600c07_6"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0600c08_7"
    },
    {
        "source_sentence": "一切諸佛，於一切法，常定不亂，於一念中，為一切眾生，說一切法；",
        "translation": "All buddhas always concentrate on all truths without confusion. In a single thought they teach all truths to all sentient beings.",
        "source": "T09n0278_031:0600c08_8"
    },
    {
        "source_sentence": "一切諸佛，於一切法界、一切眾生，常定不亂，於一念中，悉為眾生分別演說無我實際；",
        "translation": "All buddhas are always concentrated on all realms of reality and all sentient beings, never disturbing them. In a single thought they explain to sentient beings the principle of selflessness in various ways.",
        "source": "T09n0278_031:0600c10_9"
    },
    {
        "source_sentence": "一切諸佛，於一切法界、三世諸法，常定不亂，於一念中，入億三昧；",
        "translation": "All buddhas are always concentrated on all realms of reality and all phenomena of the three times, without confusion. In a single thought they enter concentration of one hundred million awarenesses.",
        "source": "T09n0278_031:0600c12_10"
    },
    {
        "source_sentence": "一切諸佛，於一切法界，十方佛剎，常定不亂，於一念中，悉遍遊行一切佛剎；",
        "translation": "All buddhas, in all realms of reality, the buddha-lands of the ten directions, always concentrated and unconfused; in a single thought they traveled throughout all buddha-lands.",
        "source": "T09n0278_031:0600c13_11"
    },
    {
        "source_sentence": "一切諸佛，於一切法界，普現無量無邊佛種種身，常定不亂，於一念中，",
        "translation": "All buddhas manifest, in all realms of reality, the various bodies of infinite buddhas, always concentrated and unconfused, in a single thought:",
        "source": "T09n0278_031:0600c15_12"
    },
    {
        "source_sentence": "一切世界，無不遍現；",
        "translation": "They appear everywhere in all worlds.",
        "source": "T09n0278_031:0600c17_13"
    },
    {
        "source_sentence": "一切諸佛，身、口、意業，充滿一切法界，常定不亂，於一念中，分別演說一切眾生，",
        "translation": "All buddhas’ physical, verbal, and mental actions fill all realms of reality. They are always concentrated, never disturbed; in a single thought they teach distinctly to all sentient beings.",
        "source": "T09n0278_031:0600c17_14"
    },
    {
        "source_sentence": "心藏欲性；",
        "translation": "It is the nature of desire as the store of mind.",
        "source": "T09n0278_031:0600c19_15"
    },
    {
        "source_sentence": "一切諸佛，於一切法界，一切法性，常定不亂，於一念中，悉能究竟離欲實際；",
        "translation": "All buddhas, in all realms of reality, the essence of all things, always concentrated and unconfused, can in a single thought perfect the practice of freedom from desire.",
        "source": "T09n0278_031:0600c19_16"
    },
    {
        "source_sentence": "一切諸佛，於一切法界，一切世界緣起，常定不亂，於一念中，分別演說一切因緣；",
        "translation": "All buddhas, in all realms of reality, conditioned by all worlds, always concentrated and unconfused, in a single thought analyze and explain all causes and conditions.",
        "source": "T09n0278_031:0600c21_17"
    },
    {
        "source_sentence": "一切諸佛，於一切法界，一切世間、離世間法，常定不亂，於一念中，",
        "translation": "All buddhas, in all realms of reality, in all worlds, and apart from all worldly phenomena, are always concentrated without confusion. In a single thought,",
        "source": "T09n0278_031:0600c23_18"
    },
    {
        "source_sentence": "無量莊嚴，為一切眾生普現諸佛，無有窮盡；",
        "translation": "Innumerable adornments manifest buddhas everywhere for the sake of all sentient beings, without any limit.",
        "source": "T09n0278_031:0600c25_19"
    },
    {
        "source_sentence": "一切諸佛，於一切眾生，一切法界，正受無礙，常定不亂，於一念中，",
        "translation": "All buddhas receive all sentient beings, all realms of reality, without obstruction, always concentrated and unconfused.",
        "source": "T09n0278_031:0600c26_20"
    },
    {
        "source_sentence": "至諸佛趣，無量解脫，究竟彼岸。",
        "translation": "They reach the destinies of buddhas, immeasurable liberation, and ultimately reach the other shore.",
        "source": "T09n0278_031:0600c27_21"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0600c28_22"
    },
    {
        "source_sentence": "是為一切諸佛十種無量無邊不可思議三昧。",
        "translation": "These are the ten kinds of immeasurable, limitless, and inconceivable samādhis of all buddhas.",
        "source": "T09n0278_031:0600c28_23"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T09n0278_031:0600c29_24"
    },
    {
        "source_sentence": "一切諸佛，有十種無礙解脫。",
        "translation": "All buddhas have ten kinds of unobstructed liberation:",
        "source": "T09n0278_031:0600c29_25"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T09n0278_031:0601a01_26"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，悉能普現不可說不可說諸佛出世；",
        "translation": "All buddhas can, in a speck of dust, manifest untold buddhas appearing in the world.",
        "source": "T09n0278_031:0601a01_27"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，悉能普現不可說不可說諸佛轉淨法輪；",
        "translation": "All buddhas can, in a speck of dust, show untold buddhas turning the pure wheel of teaching.",
        "source": "T09n0278_031:0601a03_0"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，教化調伏不可說不可說眾生；",
        "translation": "All buddhas, in a speck of dust, teach and tame untold numbers of sentient beings.",
        "source": "T09n0278_031:0601a04_1"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，普現不可說不可說佛剎；",
        "translation": "All buddhas manifest untold buddha-lands in a single atom.",
        "source": "T09n0278_031:0601a05_2"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，授不可說不可說菩薩記；",
        "translation": "All buddhas give instruction to untold numbers of enlightening beings in a single atom.",
        "source": "T09n0278_031:0601a07_0"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，普現三世諸佛出世；",
        "translation": "All buddhas, in a speck of dust, manifested the emergence into the world of the Buddhas of past, present, and future.",
        "source": "T09n0278_031:0601a08_1"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，普現三世一切佛剎；",
        "translation": "All buddhas manifested all buddha-lands of past, present, and future in a speck of dust.",
        "source": "T09n0278_031:0601a09_2"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，普現三世諸佛自在神力；",
        "translation": "All buddhas manifested in a speck of dust the unimpeded spiritual powers of all buddhas of past, present, and future.",
        "source": "T09n0278_031:0601a10_3"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，普現三世一切眾生；",
        "translation": "All buddhas, in a speck of dust, show all sentient beings of the past, present, and future.",
        "source": "T09n0278_031:0601a11_4"
    },
    {
        "source_sentence": "一切諸佛，於一微塵中，普現三世一切諸佛佛事。",
        "translation": "All buddhas manifest, in a single atom, the buddha-works of all buddhas of past, present, and future.",
        "source": "T09n0278_031:0601a12_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T09n0278_031:0601a13_6"
    },
    {
        "source_sentence": "是為一切諸佛十種無礙解脫。」",
        "translation": "These are the ten kinds of unobstructed liberation of all buddhas.",
        "source": "T09n0278_031:0601a13_7"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第三十一",
        "translation": "Dafangguang fo huayan jing, vol. 31",
        "source": "T09n0278_031:0601a15_0"
    }
]