[
    {
        "source_sentence": "正法華經卷第一",
        "translation": "True Lotus Sutra, Volume 1",
        "source": "T09n0263_001:0063a03_0"
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, a translator of the Tripiṭaka of the Western Jin state of Yuezhi",
        "source": "T09n0263_001:0063a05_0"
    },
    {
        "source_sentence": "光瑞品第一",
        "translation": "The First Chapter of the Chapter on Illumination and瑞品第一",
        "source": "T09n0263_001:0063a06_0"
    },
    {
        "source_sentence": "聞如是：一時佛遊王舍城靈鷲山，與大比丘眾俱，比丘千二百，一切無著，",
        "translation": "Thus I have heard: One time the Buddha was staying at Rājagaha, on Vulture Peak in the city of Vaiśālī, accompanied by a great assembly of bhikṣus. There were one thousand two hundred bhikṣ",
        "source": "T09n0263_001:0063a07_0"
    },
    {
        "source_sentence": "諸漏已盡無復欲塵，已得自在逮得己利，生死已索眾結即斷，一切由已獲度無極，",
        "translation": "Once the contaminants have ended, there are no more objects of desire, they've attained mastery and acquired their own benefits, and after birth and death, they cut off the bonds that are sought, all because they've been liberated without limit",
        "source": "T09n0263_001:0063a08_1"
    },
    {
        "source_sentence": "已脫於慧心解得度、名曰：賢者知本際、賢者大迦葉、上時迦葉、象迦葉、江迦葉、舍利弗、大目揵連、迦旃延、阿那律、劫賓[少\\/兔]、牛呞、離越、譬利斯、薄拘盧、拘絺、難陀、善意、滿願子、須菩提、阿難、羅云；",
        "translation": "He had already been liberated from the mind of wisdom and understanding and attained enlightenment. His name was Good One Who Knows the Origin, Good One Mahākāśyapa; the good one Mahākāśyapa; the superior Mahākāśyapa;",
        "source": "T09n0263_001:0063a10_2"
    },
    {
        "source_sentence": "菩薩八萬，皆不退轉，堅住無上正真之道，逮總持法得大辯才，常讚歎不退轉法輪，",
        "translation": "The enlightening beings, eighty thousand in number, never regressing, firmly abide on the path of unexcelled true and perfect enlightenment. They attain mastery of the Teaching, acquire great eloquence, and always pra",
        "source": "T09n0263_001:0063a15_3"
    },
    {
        "source_sentence": "供養無數百千諸佛，於無量佛殖眾德本，諸佛世尊所見諮嗟，身常行慈入如來慧，",
        "translation": "They honored innumerable hundreds of thousands of buddhas, planted roots of virtue in countless buddhas, looked up to and admired by world-honored buddhas. Their bodies always practiced loving-kindness and entered",
        "source": "T09n0263_001:0063a17_4"
    },
    {
        "source_sentence": "善權普至大知度無極，從無數劫多所博聞，名達十方，救護無量百千眾生，",
        "translation": "He was well versed in the teachings for countless eons, his name reaching all quarters to save and protect immeasurable hundreds of thousands of living beings.",
        "source": "T09n0263_001:0063a19_5"
    },
    {
        "source_sentence": "遊於三界猶如日明，解一切法如幻如化野馬影響，悉無所有住無所住，",
        "translation": "They dwell in the three worlds like the sun, understanding all things are like illusions, like magic tricks, like wild horses. All have no existence and nothing to abide in.",
        "source": "T09n0263_001:0063a20_6"
    },
    {
        "source_sentence": "雖見終始亦無去來，既見色像本無形貌，現諸所生永無起滅，導利群黎不著三處，",
        "translation": "Even though they see beginning and end, they also see neither past nor future. Having seen form and shape having no form in the first place, they show that what is produced never comes into being or goes out of being. They guide all living beings without clinging to any",
        "source": "T09n0263_001:0063a22_7"
    },
    {
        "source_sentence": "分別空慧無想無願，起三脫門至三達智，無去來今現在之想，開化黎庶使了本無。",
        "translation": "Discriminating wisdom of emptiness without conceptions and wishes, he gives rise to the three liberations up to the three comprehensions, has no past, future, or present conceptions, and enlightens the common people so that they understand their original non",
        "source": "T09n0263_001:0063a24_8"
    },
    {
        "source_sentence": "其名曰：溥首菩薩、光世音菩薩、大勢至菩薩、常精進菩薩、不置遠菩薩、寶掌菩薩、印手菩薩、藥王菩薩、妙勇菩薩、寶月菩薩、月光菩薩、月滿菩薩、大度菩薩、超無量菩薩、越世菩薩、解縛菩薩、寶事菩薩、恩施菩薩、雄施菩薩、水天菩薩、帝天菩薩、大導師菩薩、妙意菩薩、慈氏菩薩，",
        "translation": "Their names were Puṣya Bodhisattva, Guṇamati Bodhisattva, Vaiśravaṇa Bodhisattva, Maheśvara Bodhisattva, Mahāsthāmaprāpta Bodhisattva, eternally energetic Bodhisattva,",
        "source": "T09n0263_001:0063a27_0"
    },
    {
        "source_sentence": "如是大士八萬上首。",
        "translation": "Thus, these are the 80,000 heads of great men.",
        "source": "T09n0263_001:0063b04_1"
    },
    {
        "source_sentence": "爾時天帝釋與二萬天子俱，日天子與無數眷屬俱，月天子以寶光明普有所炤，",
        "translation": "At that time Indra the ruler of the gods was accompanied by twenty thousand celestial beings. The sun deities were accompanied by innumerable members of their retinues, and the moon deities shone a ray of light",
        "source": "T09n0263_001:0063b04_2"
    },
    {
        "source_sentence": "寶光天子、光燿天子俱，四大天王與萬天子俱，[火*僉]明大梵自在天子與三萬天子俱，",
        "translation": "He was accompanied by the celestial being Jewel Light and the celestial being Luminosity; the four great deva kings were accompanied by ten thousand celestial beings; the Great Brahmakāyika gods were accom",
        "source": "T09n0263_001:0063b06_3"
    },
    {
        "source_sentence": "梵忍跡天子與三萬二千天子俱，飾乾大梵與無數天子，又梵名[火*僉]光與無數大眾俱，",
        "translation": "The Brahmakāyika gods were accompanied by thirty-two thousand deities, the Mahāprajñāpāramitā brahmā with innumerable deities, and the Brahmakāyika [Fireless] Light was accom",
        "source": "T09n0263_001:0063b08_4"
    },
    {
        "source_sentence": "來詣佛所，稽首畢退坐一面。",
        "translation": "They came to the Buddha, bowed their heads, and withdrew to sit at one side.",
        "source": "T09n0263_001:0063b10_5"
    },
    {
        "source_sentence": "有八龍王，與無央數千諸龍眷屬俱；",
        "translation": "There were eight great dragon kings, accompanied by countless thousands of their retinues.",
        "source": "T09n0263_001:0063b11_6"
    },
    {
        "source_sentence": "四真陀羅王——慎法真陀羅王，大法真陀羅王，仁和真陀羅王，持法真陀羅王；",
        "translation": "The fourth was the maṇḍala king, the maṇḍala king Mindful Dharma, the maṇḍala king Great Dharma, the maṇḍala king Humane Peace, and the maṇḍala king Dharma Steward.",
        "source": "T09n0263_001:0063b12_7"
    },
    {
        "source_sentence": "香音神，各與營從來詣佛所，稽首畢退住一面。",
        "translation": "The spirit of fragrance and sound came with their retinues to the Buddha, bowed their heads at his feet, withdrew, and remained off to one side.",
        "source": "T09n0263_001:0063b13_8"
    },
    {
        "source_sentence": "淨身四天子——柔軟天子，和音天子，美軟天子，悅響天子——俱來詣佛所，",
        "translation": "The four deities with pure bodies, namely the soft-bodied ones, the harmonious ones, the fine-bodied ones, and the sweet-bodied ones, all came to the Buddha.",
        "source": "T09n0263_001:0063b15_0"
    },
    {
        "source_sentence": "前稽首畢退坐一面。",
        "translation": "He bowed his head in front and withdrew to sit at one side.",
        "source": "T09n0263_001:0063b16_1"
    },
    {
        "source_sentence": "四阿須倫王——最勝阿須倫，欲錦阿須倫，燕居阿須倫，吸氣阿須倫——與無央數百千阿須倫人民俱，",
        "translation": "The fourth asura king, the Supreme Asura, the asuras, the asuras of the realm of sexual passion, the asuras of the realm of desire, the asuras of the realm of Sdyāna, and the asuras of the inhal",
        "source": "T09n0263_001:0063b17_2"
    },
    {
        "source_sentence": "來詣佛所，前稽首畢退坐一面。",
        "translation": "They came to the Buddha, bowed their heads in front of him, and withdrew to sit at one side.",
        "source": "T09n0263_001:0063b19_3"
    },
    {
        "source_sentence": "四金翅鳥王——大身王，大具足王，得神足王，不可動王——俱來詣佛所，",
        "translation": "The four garuḍa kings, the great body king, the great fully endowed king, the king who had attained supernormal powers, and the immovable king came to the Buddha.",
        "source": "T09n0263_001:0063b20_0"
    },
    {
        "source_sentence": "稽首畢退住一面。",
        "translation": "After bowing his head, he withdrew and stayed to one side.",
        "source": "T09n0263_001:0063b21_1"
    },
    {
        "source_sentence": "摩竭國王阿闍世，與十子并諸營從，來詣佛所，稽首畢退坐一面。",
        "translation": "The king Ajātaśatru of Magadha, accompanied by his ten sons and their retinues, came to the Buddha. After paying homage [to him], they withdrew and sat to one side.",
        "source": "T09n0263_001:0063b21_2"
    },
    {
        "source_sentence": "諸天、龍神、世人，莫不歸命奉敬侍坐。",
        "translation": "All the gods, dragons, goddesses, and people of the world all relied on him to venerate and attend them.",
        "source": "T09n0263_001:0063b23_3"
    },
    {
        "source_sentence": "爾時世尊與四部眾眷屬圍繞而為說經，講演菩薩方等大頌一切諸佛嚴淨之業。",
        "translation": "It was then that the Bhagavān and his four groups of followers surrounded him, preached the sūtras for him, and taught the bodhisattva Mahāprajñāpāramitā a great verse on all the Buddha's pure and noble activities",
        "source": "T09n0263_001:0063b24_4"
    },
    {
        "source_sentence": "說斯經已，昇于自然師子之床加趺而坐，三昧正受定意，名曰立無量頌。",
        "translation": "After he had taught this sūtra, he ascended to the lion's seat and sat cross-legged on a natural lion's seat, concentrating himself in samādhi and meditating with concentration, which is called the immeasurable verse",
        "source": "T09n0263_001:0063b26_5"
    },
    {
        "source_sentence": "尋應所宜，不見身貌、不得心意，所坐立處則有瑞應，天雨、意華、大意華、柔軟音華、大柔軟音華，",
        "translation": "When they looked for a suitable place, they did not see the monk’s physical appearance and could not find his thoughts. Wherever he sat or stood, there appeared to be an auspicious sign:",
        "source": "T09n0263_001:0063b27_6"
    },
    {
        "source_sentence": "散世尊上及於大會四部之眾，普佛國土六反震動。",
        "translation": "When the Bhagavān and the four groups of people in the assembly scattered, the whole Buddha's land shook six times.",
        "source": "T09n0263_001:0063c01_7"
    },
    {
        "source_sentence": "時大眾會比丘、比丘尼、清信士、清信女，天、龍、神鬼、揵沓惒、阿須倫、迦留羅、真陀羅、摩休勒、人與非人，",
        "translation": "The great assembly then gathered the monks, bhikṣus, bhikṣuṇīs, pure faithful men and women, pure faithful women, gods, dragons, spirits, gandharvas, asuras, garuḍas",
        "source": "T09n0263_001:0063c02_8"
    },
    {
        "source_sentence": "國王君主大力轉輪聖王，各與營從，咸悉一心瞻戴世尊，意皆愕然怪未曾有。",
        "translation": "The kings and sovereigns, the great wheel-turning sage kings, each accompanied by their attendants, all looked at the Bhagavān with one mind and wondered in wonder.",
        "source": "T09n0263_001:0063c04_9"
    },
    {
        "source_sentence": "於時佛放面口結光明，普炤東方萬八千佛土，其大光明照諸佛國，靡不周遍，",
        "translation": "The Buddha then emanated a ray of light from his face and mouth, illumining the eighteen thousand buddha-lands in the east. That great ray of light illuminated all the buddha-lands everywhere.",
        "source": "T09n0263_001:0063c06_10"
    },
    {
        "source_sentence": "至於無擇大地獄中，上徹三十三天，彼此世界六趣周旋，所有蒸民一切皆現，",
        "translation": "In the great hell of non-selection, which penetrates upward to the thirty-three heavens and traverses the six realms in each other’s worlds, all the living beings therein are manifest.",
        "source": "T09n0263_001:0063c08_11"
    },
    {
        "source_sentence": "其界諸佛現在所由，此土眾會悉遙見之；",
        "translation": "Where the buddhas of that world are now, all the congregations in this land see them from a distance.",
        "source": "T09n0263_001:0063c10_0"
    },
    {
        "source_sentence": "彼土覩斯亦復如是，十方諸佛所說經法，普遍聞焉。",
        "translation": "So it was in the land of Kauśinagara, where the teachings of the scriptures taught by the buddhas of the ten directions were widely heard.",
        "source": "T09n0263_001:0063c11_0"
    },
    {
        "source_sentence": "諸比丘、比丘尼、清信士、清信女，修行獨處者逮得德果一切表露，又諸菩薩意寂解脫，",
        "translation": "The bhikṣus, bhikṣuṇīs, pure faithful men and women, and purely believing women who cultivate solitude attain all the manifestations of virtue and result. Furthermore, bodhisattvas are liberated by",
        "source": "T09n0263_001:0063c12_1"
    },
    {
        "source_sentence": "其出家者求報應行，皆亦悉現；",
        "translation": "Those who had renounced the householder’s life, seeking reward and retribution, also manifested them all.",
        "source": "T09n0263_001:0063c14_2"
    },
    {
        "source_sentence": "諸佛世界滅度眾聖，所建寶廟自然為現。",
        "translation": "The buddha worlds cease and the sages are liberated, and the jeweled shrines built naturally appear.",
        "source": "T09n0263_001:0063c14_3"
    },
    {
        "source_sentence": "於是彌勒菩薩心自念言：「今者世尊，如來、至真、等正覺，三昧正受，",
        "translation": "Then Maitreya thought to himself: “O Bhagavat! The Tathāgata, the Arhat, the Perfectly Enlightened One, is now abiding in concentration and meditating.",
        "source": "T09n0263_001:0063c15_4"
    },
    {
        "source_sentence": "現大感變，多所降伏，覩未曾有，天上世間諸佛廟寺，恢闊彰顯，將何所興而有此瑞？",
        "translation": "This was an unprecedented sight. The buddhas and shrines of the worlds in heaven and earth are so vast and magnificent that it cannot be seen anywhere else. Where could this apparition have occurred?",
        "source": "T09n0263_001:0063c17_5"
    },
    {
        "source_sentence": "從昔暨今未曾見也。",
        "translation": "They've never seen it since the distant past and haven't seen it now.",
        "source": "T09n0263_001:0063c19_6"
    },
    {
        "source_sentence": "欲問其歸，孰堪發遣解斯誼乎？」",
        "translation": "If you want to ask about their return, who will be able to dismiss and understand this meaning?",
        "source": "T09n0263_001:0063c19_7"
    },
    {
        "source_sentence": "尋改思曰：「今者大士溥首童真，所作已辦靡所不達，供養過去無數諸佛，",
        "translation": "He changed his ways and thought, “Now the great hero Puṣkarasārin has accomplished what he had to do. There is nothing he did not understand that makes offerings to innumerable past buddhas.",
        "source": "T09n0263_001:0063c20_8"
    },
    {
        "source_sentence": "曾當瞻覲如來、至真、等正覺，如此瑞應欲請問之。」",
        "translation": "I'll once see the Tathāgata, the supreme truth, and the perfectly enlightened one, and I should want to ask him about such an auspicious sign.",
        "source": "T09n0263_001:0063c22_9"
    },
    {
        "source_sentence": "時四部眾比丘、比丘尼、清信士、清信女，諸天、龍、神、揵沓惒、阿須倫、迦留羅、真陀羅、摩休勒，",
        "translation": "The fourfold assembly of bhikṣus, bhikṣuṇīs, śramaṇas and brāhmaṇas, as well as the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas,",
        "source": "T09n0263_001:0063c23_10"
    },
    {
        "source_sentence": "志懷猶豫得未曾有，見斯大聖無極威曜神足變化，各各發意，欲問世尊決散疑網。",
        "translation": "When they saw the miraculous transformations of this great sage's infinitely majestic miraculous abilities, each of them had an intention to ask the Bhagavān to resolve the web of doubt.",
        "source": "T09n0263_001:0064a01_11"
    },
    {
        "source_sentence": "慈氏大士見眾會心，便問溥首曰：「仁者惟說，今何因緣有此瑞應，大聖神足放大光明，",
        "translation": "Seeing the minds of the assembly, Maitreya asked Puṣkarasārin, “Dear friend, please tell me how this omen came about. The great sage’s supernormal power is able to emanate such a ray of light.",
        "source": "T09n0263_001:0064a03_12"
    },
    {
        "source_sentence": "照于東方萬八千土，諸佛世界自然為現，所說經法皆遙聞之？」",
        "translation": "To illuminate 18,000 lands in the east, the buddha worlds will naturally appear, and all the sūtras and teachings they teach will be heard from afar?",
        "source": "T09n0263_001:0064a05_13"
    },
    {
        "source_sentence": "「文殊師利！　　今何以故，　　導利眾庶，",
        "translation": "“O Mañjuśrī! What is the reason we are here now To guide and benefit all living beings?",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　放演光明？　　甚大威曜，　　出于面門，",
        "translation": "It emits a great ray of light, very powerful and brilliant, Which emerges from its face.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　神變遍照，　　十方[火*霍]然；　　天雨眾華，",
        "translation": "The miraculous powers pervade the ten directions, shining brightly; Heaven rains down flowers everywhere.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　紛紛如降，　　意華大意，　　柔軟音華，",
        "translation": "The flowers of mind and thought are like great thoughts, And the flowers of gentle sound are like flower garlands.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　種種若干，　　其色殊妙，　　栴檀馨香，",
        "translation": "Various kinds of various colors, exquisite in color, With the fragrance of sandalwood.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　悅可眾心，　　嚴淨巍巍，　　皆悉周遍。",
        "translation": "Delightful to the minds of all beings, Pure and lofty, They pervade everywhere.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　今日四輩，　　欣然踊躍，　　於此佛土，",
        "translation": "Today, the four groups of people are joyful and jumping for joy. In this buddha-land,",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　十方世界，　　六反震動，　　莫不傾搖。",
        "translation": "The worlds of the ten directions shake in six ways, all tilting and trembling.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　于彼光明，　　則照東方，　　萬八千土，",
        "translation": "In that light, Ten thousand eighty-eight thousand lands in the east shine.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　其暉普徹，　　諸佛境土，　　紫磨金色，",
        "translation": "Its brilliance penetrates everywhere, The realm of the Buddhas’ lands, With purple and polished golden colors.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　煌煌灼灼，　　[火*僉]無不接。　　國邑群萌，",
        "translation": "The city walls are shining brilliantly, and there is no one who fails to reach them.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　莫不蒙賴，　　達盡上界，　　入無擇獄。",
        "translation": "None of them will fail to rely on it, reach the upper realm, and enter the hell of no choice.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　眾庶受生，　　用無明故，　　滅沒墮落，",
        "translation": "Sentient beings are subject to birth Because they use ignorance, Extinguishing and falling because of it.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　歸此諸趣。　　斯等黎民，　　覩見因緣，",
        "translation": "To return to these realms of rebirth, The people of this land Will see the causes and conditions With compassion.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　若干之趣，　　今現嚴淨，　　賢明不肖，",
        "translation": "Certain destinies are now manifested as adornment and purity, while wise and unworthy people.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　中間品類，　　吾於此住，　　皆遙見之。",
        "translation": "The intermediate beings, of various species, I dwell here; All see them from a distance.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　又覩諸佛，　　而師子吼，　　演說經典，",
        "translation": "Again, I see the buddhas With the lion’s roar And teach the scriptures.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　開闡法門，　　消除眾生，　　無數之穢。",
        "translation": "He opens the gate of the Dharma and removes the countless defilements of sentient beings.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　歌頌聖教，　　出柔軟音，　　其響深妙，",
        "translation": "They sing praises of the holy teachings, Producing gentle sounds that are profound and subtle.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　令人欣踊。　　各各自捨，　　境界所有，",
        "translation": "Each one relinquishs What belongs to his own sphere.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　講說譬喻，　　億載報應，　　分別敷演，",
        "translation": "He teaches and explains metaphors, billions of years of retribution, Discriminating and expounding them.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　於此佛法。　　一切眾生，　　所造苦患，",
        "translation": "Regarding this buddha-dharma, all sentient beings create suffering and distress.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　以無巧便，　　治老病死，　　猶斯等類，",
        "translation": "Because of the absence of skillful means, they treat old age, illness, death, and so forth.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　說寂滅度。　　比丘當知，　　貧劇困惱，",
        "translation": "You should know, monks, That the poor and afflicted are in distress.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　眾人則處，　　安雅快樂，　　積累功德，",
        "translation": "The people there will be peaceful and happy, Accumulating virtue.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　乃見聖尊，　　又得逮至，　　緣一覺乘，",
        "translation": "He then saw that the holy honored one had also attained enlightenment, which is based on the single-eyed vehicle.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　一切令入，　　於此道業，　　見佛殊異，",
        "translation": "All the enlightening beings cause all to enter this path, And in their deeds they see buddhas as extraordinary.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　諸所經籍，　　或有志求，　　無上之慧。",
        "translation": "In all the scriptures and books, some of them have aspirations for the unsurpassed wisdom.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　一切世間，　　見若干形，　　斯等眾類，",
        "translation": "All the worlds They see various forms, Such beings as these.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　歌詠佛德。　　仁者溥首！　　彼所言說，",
        "translation": "They sing praises of the virtues of buddhas, saying, “Friend Puṣkarasārin, whatever they teach,",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　我立住此，　　今悉見聞，　　及餘無數，",
        "translation": "I established my abode here. Now I have seen, heard, and countless others.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　諸億千眾，　　在此遊居，　　吾悉覩眄。",
        "translation": "Hundreds of myriads of koṭis of sentient beings have traveled here, and I see them all.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　又見佛土，　　不可計數，　　諸菩薩等，",
        "translation": "They also see innumerable buddha-lands, Bodhisattvas, and so forth.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　如江河沙，　　億百千數，　　而不減少，",
        "translation": "They are like rivers, streams, and grains of sand, Hundreds of millions in number, Yet not diminishing.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　建志精進，　　興發道意。　　或有放捨，",
        "translation": "Those who have set their minds on enlightenment and are diligent, And give rise to the aspiration for enlightenment.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　諸所財業，　　而行布施。　　金銀珍寶，",
        "translation": "They give gifts of gold, silver, precious treasures, and various kinds of goods.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　明月真珠，　　車璩馬腦，　　奴婢車乘，",
        "translation": "The bright moon is a true pearl, the carriages are covered with horse heads, and the slaves and maidservants ride in carts.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　床臥机榻，　　諸所珍異，　　環珮瓔珞，",
        "translation": "Their beds, tables, chairs, and couches are all rare treasures, With rings, jewels, necklaces, and jewelry.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　於是具足，　　皆用惠賜，　　悉以勸助，",
        "translation": "They were then fully endowed, And gave them all kinds of blessings, All to encourage and help.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　上尊佛道。　　今我等類，　　聞斯音聲，",
        "translation": "It is the supreme path of the buddhas. Now we hear this sound,",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　安住所歎，　　正覺大乘，　　遊於三界，",
        "translation": "An abode of praise, the great vehicle of right awakening, wanders through the three realms.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　而無所猗，　　其人速逮，　　得獲斯願。",
        "translation": "But there's nothing to rely on, so he quickly apprehends it and attains this vow.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　或以諸乘，　　則而施與，　　諸華伎樂，",
        "translation": "Or they may bestow the teachings of the various vehicles, such as flowers and music.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　欄楯莊嚴，　　簫成鼓吹，　　音節所娛，",
        "translation": "They are adorned with railings and shields, And played the drums formed by the sound of their flutes.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　四事如應，　　惠與奉授，　　以此布施，",
        "translation": "These four things are given as they should be, given with kindness and dedication, and this is their giving.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　心不悋惜。　　妻妾子孫，　　所重輦輿，",
        "translation": "Their hearts are not stingy and they cherish their wives, concubines, children, and grandchildren.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　或慮非常，　　手足與人，　　志不矜愛，",
        "translation": "Or they may think it’s impermanent, Give their hands and feet to others, or don’t cherish it with aspiration.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　皆用惠施，　　欲以慕求，　　此尊佛道。",
        "translation": "They all use kindness and generosity, wanting to pursue it with craving, this is the honored Buddha Way.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　復有捨身，　　給諸所有，　　頭眼支體，",
        "translation": "Again, there are those who abandon their bodies And give away all that they have: Their heads, eyes, limbs, and body.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　無所遺愛，　　所以布施，　　用成佛道，",
        "translation": "Because they have no craving for anything, They give gifts And use them to attain enlightenment.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　志願逮獲，　　如來聖慧。　　溥首童真！",
        "translation": "Their aspiration is to acquire the holy wisdom of the enlightened.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　吾瞻國王，　　與眷屬俱，　　而出遊立，",
        "translation": "The king of my country, accompanied by his retinue, Were to go out and stay there.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　中宮后妃，　　婇女貴人，　　族姓娛樂，",
        "translation": "The middle palace queen and consorts, court ladies and noble people, clans and castes are entertained.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　俱禮佛身。　　眾庶朋黨，　　悉詣導師，",
        "translation": "They all bowed to the Buddha’s body, and All the common people And their friends and companions went to see the Guide.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　而於法王，　　啟問經典，　　則除俗服，",
        "translation": "Instead, when the king of the Dharma Inquires into the scriptures, He removes his secular clothes.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　下其鬚髮，　　而被袈裟，　　以為法式。",
        "translation": "Putting down his hair and beard, he wears a monk's robe in accordance with the Dharma.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　我覩若干，　　諸菩薩眾，　　比丘知友，",
        "translation": "I'm deceiving a certain number of bodhisattvas, and the monks know their friends.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　頓止山巖，　　獨處閑居，　　解暢空無，",
        "translation": "He suddenly stopped at a mountain cliff, lived alone in seclusion, and understood that emptiness is nonexistent.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　或有受經，　　而讀誦讚。　　吾復瞻見，",
        "translation": "And if there are those who have received scriptures And recited and praised them, I also see them.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　開士之黨，　　英雄儔疋，　　出入山谷，",
        "translation": "The enlightened one's party, heroic and brave, leaves the mountains and enters the valleys.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　專精思惟，　　歷察眾相，　　分別講說，",
        "translation": "He concentrates his mind on contemplation, investigates all characteristics, and explains them separately.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　演諸佛乘，　　捐棄愛欲，　　永使無餘。",
        "translation": "He teaches the buddha vehicle, abandons craving and desire, and always keeps it without remainder.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　常自纂修，　　悕仰正行，　　安住諸子，",
        "translation": "They always compiled and cultivated themselves, respectfully practiced righteousness, And settled the children.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　不離閑居，　　則便逮得，　　成五神通。",
        "translation": "If they don't leave their seclusion, then they'll attain the five supernormal powers that are accomplished.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　高妙之士，　　志平等句，　　向諸導師，",
        "translation": "A noble and wonderful man Whose aspiration is equanimous, He addresses the Guides with these words:",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　恭敬叉手，　　心懷踊躍，　　歌詠佛德，",
        "translation": "They saluted the Buddha with their palms joined, danced and leaping in joy, And sang praises of his virtue.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　以數千偈，　　歎人中王。　　覩無所畏，",
        "translation": "Thousands of verses praise the king among men, Who is compassionate and fearless.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　志踊調和，　　曉了分別，　　出家之業，",
        "translation": "Their aspiration is vigorous and harmonious, They understand distinctions And the deeds of renunciant practitioners.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　諮稟經典，　　於兩足尊，　　所聞頻數，",
        "translation": "I've consulted the scriptures, which are frequently heard by the two-legged honored one.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　尋即執翫，　　安住眾子，　　先自修已。",
        "translation": "He then grasps the arrow and places it safely in the children, who first cultivate it themselves.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　我又遙見，　　諸佛孫息，　　為無數億，",
        "translation": "From a distance I also see The heirs of the Buddhas, Who are countless billions in number.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　人民講法，　　而現報應，　　兆載難計，",
        "translation": "The people teach the Dharma, Yet their present rewards are incalculable.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　志懷欣喜，　　自歸正法，　　勸助開化。",
        "translation": "Their aspiration is joyous, they take refuge in the right teaching and encourage it to help enlightenment.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　無數菩薩，　　降伏眾魔，　　秉勢官屬，",
        "translation": "Countless bodhisattvas Overthrew the Māras, Holding their powers and officials.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　而雷擊扣，　　於此法鼓，　　善逝典誥。",
        "translation": "Yet thunder strikes the bell, and here at the Dharma drum is the scripture of Sugata.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　我又覽歷，　　諸天人神，　　所共宗奉，",
        "translation": "I have also visited all the gods, humans, and deities Together with whom I venerate.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　安住諸子，　　不以奇雅，　　益用寂然，",
        "translation": "Those living beings who are settled there don’t think of it as marvelous or elegant, but instead become more and more tranquil.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　履行定隱，　　無所猗著，　　猶如師子，",
        "translation": "Fulfilling concentration, they're hidden, unattached, just like a lion.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　開化度眾，　　令發道意。　　眾生在居，",
        "translation": "He enlightened and liberated sentient beings, Causing them to give rise to the aspiration for enlightenment.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　手執所供，　　心懷悅豫，　　僉然俱詣。",
        "translation": "Holding the offering in their hands, they were delighted with hearts and minds, and they all went to see him.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　又諸佛子，　　立於精進，　　棄捐欲塵，",
        "translation": "Furthermore, the heirs of the Buddha Rely on exertion And abandon all objects of desire.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　常得自在，　　建志經行，　　遊諸樹間，",
        "translation": "They always attain freedom, set their minds on the path and walk up and down, roaming among the trees.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　心願勤修，　　根求佛道。　　而護身口，",
        "translation": "Their minds and vows they diligently practice, With their faculties seeking the path of enlightenment, And protect their bodies and mouths.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　常行清淨，　　禁戒安隱，　　不畏生死，",
        "translation": "He always conducts himself purely, keeps the precepts safely, and is not afraid of birth and death.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　於彼秉心，　　具足諸行，　　以斯禁戒，",
        "translation": "They hold their minds and are fully endowed with practices, and because of these precepts, they're disciplined.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　寤諸不覺。　　最勝之子，　　據忍辱力，",
        "translation": "The most excellent son, relying on the power of forbearance and humility,",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　為諸貢高，　　卑下謙順，　　輕毀罵詈，",
        "translation": "For the sake of those who are arrogant, inferior and humble, They despise and disparage others.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　若撾捶者，　　其求佛道，　　默然不校。",
        "translation": "If someone is given a beating, they'll seek the Buddha Way and remain silent without commenting.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　吾或復觀，　　菩薩之眾，　　一切棄離，",
        "translation": "I might also observe the congregation of enlightening beings, Who have abandoned everything.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　調戲伎樂，　　與諸力勢，　　親友等俱，",
        "translation": "He plays and plays music, Is accompanied by all powers, His friends and companions.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　其心堅固，　　平如虛空。　　蠲除諸穢，",
        "translation": "Their minds are firm and stable, Like space. They rid themselves of all defilements And become free from wickedness.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　憒亂之意，　　建立一心，　　消滅陰蓋，",
        "translation": "Disturbance is the intention to establish one mind, extinguishing the aggregates and hindrances.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　禪思思惟，　　億百千歲，　　布施立意，",
        "translation": "He meditates and contemplates for billions of years, Giving alms to establish his mind.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　求尊佛道。　　或自割損，　　多所惠潤，",
        "translation": "They may seek the path of the honored buddhas, Or they may cut themselves off and harm others. Many are nourished by virtue.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　刈除貪嫉，　　閑不懷懅，　　飲食供具，",
        "translation": "He removes craving and jealousy, doesn’t harbor anger in leisurely moments, and provides food, drink, and other necessities.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　所當得者，　　及無數人，　　諸病醫藥。",
        "translation": "Those who will attain it, as well as countless people and the medicines for illness.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　又復施與，　　衣被服飾，　　檀已濟裸，",
        "translation": "Furthermore, they give clothes, bedding, and clothing to those who have bared their nakedness after giving donations.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　無所藏積。　　與營從俱，　　面見最勝，",
        "translation": "There is nothing to store, and they are accompanied by their armies. Their faces are the most superior.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　在上化立，　　億百千供。　　所造珍寶，",
        "translation": "The apparitional beings at the top offered billions and hundreds of thousands of offerings, Produced from rare treasures.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　及栴檀香，　　多有床座，　　明珠諸藏。",
        "translation": "And sandalwood incense, there are many beds and seats, as well as stores of bright pearls.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　現在目前，　　奉上安住，　　其寶之價，",
        "translation": "In the present, they're offered a place to live, and their treasures are valued.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　直億百千。　　所覩園觀，　　樹葉華實，",
        "translation": "Hundreds of millions and hundreds of thousands of trees, leaves, flowers, and fruits are planted in the grove.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　具足鮮淨，　　悅可人意。　　夙夜修行，",
        "translation": "They are endowed with purity, Pleasant and pleasing to people’s hearts.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　兼加進獻，　　上人正士，　　諸聲聞等，",
        "translation": "At the same time, they'll make offerings to superior people, righteous men, śrāvakas, and so forth.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　所可慧益，　　品列如斯，　　雜種若干，",
        "translation": "The benefits of wisdom that can be gained are listed in this order, and there are various kinds.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　歡喜濟乏，　　深自欣慶，　　而建道行，",
        "translation": "Being delighted to help those in need, They deeply rejoice for themselves And establish the practice of enlightenment.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　以此所施，　　願求尊覺。　　或有得人，",
        "translation": "With this gift, I wish to seek the supreme enlightenment.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　寂然法誼，　　察諸報應，　　眾億兆載，",
        "translation": "For hundreds of myriads of koṭis of koṭis of kalpas I investigated the karmic consequences Of the teaching in silence.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　發起民庶，　　使其悔過，　　令捨億寶，",
        "translation": "They arouse the people And cause them to repent, Forcing them to give up billions of treasures.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　志願佛道。　　曉了觀察，　　不祕悋法，",
        "translation": "They aspire to the path of buddhahood, Understanding and observing without concealting things.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　滅除三事，　　寂等如空，　　安住之子，",
        "translation": "The cessation of the three things, such as quiescence and so forth like emptiness, is the abiding child.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　悉無所著，　　斯等智慧，　　求尊佛道。",
        "translation": "They have no attachments at all, and their wisdom is such that they seek the honored Buddha Way.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　溥柔軟音，　　吾復覩見，　　諸滅度佛，",
        "translation": "The voice of Puṣya is soft and gentle, And I see the buddhas Who have entered nirvana.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　安住開化。　　諸所現在，　　大菩薩眾，",
        "translation": "The great assemblies of enlightening beings are present in the ten directions.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　咸共奉敬，　　最勝舍利。　　吾覲佛廟，",
        "translation": "Together we venerate the supreme relics, The Buddha’s relic bones.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　億千之數，　　凡難限計，　　如江河沙。",
        "translation": "The number of myriads of koṭis is hard to calculate, Like the number of grains of sand in a river.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　在于億土，　　常見尊戴，　　諸所化現，",
        "translation": "In billions of lands, they're always seen and honored, and all the transformations are manifested.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　最勝由已。　　七寶自然，　　清淨而現，",
        "translation": "The supreme cause is that the seven treasures are naturally pure and manifest.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　具足里數，　　二十五萬。　　諸蓋幢幡，",
        "translation": "The monastery was endowed with twenty-five million streets, which were decorated with canopies, banners, and streamers.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　各有數千，　　廣長周匝，　　各二千里，",
        "translation": "Each is several thousand li in circumference, Two thousand li long and two thousand li wide.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　其蓋妙好，　　殊異嚴淨。　　所在眾香，",
        "translation": "The canopies are exquisitely beautiful, Exquisite and resplendent. All the fragrances found therein are pure and genuine.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　珍寶自然，　　諸果芬馥，　　伎樂和雅。",
        "translation": "The treasures are naturally fragrant, the fruits are fragrant, and the music is harmonious.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　鬼神羅剎，　　肅恭人尊，　　安住諸子，",
        "translation": "The ghosts, spirits, and rākṣasa demons Are revered by the people. They live in peace with their children.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　所興感動，　　以用供養，　　舍利若斯。",
        "translation": "They were moved to make offerings with such relics as these.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　今此佛廟，　　昱鑠璨麗，　　普布香華，",
        "translation": "This buddha’s shrine is now glorious and beautiful, Covered with fragrant flowers.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　如晝度樹。　　於斯人眾，　　無數億千，",
        "translation": "They are like the coral tree, And countless millions of those who live there.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　悉遙覩見，　　煒曄斒斕，　　衣毛為竪，",
        "translation": "They are all seen from a distance, gracefully shining and singing, with hair on their bodies.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　眷屬馳造，　　欲見最勝，　　顯發光明。",
        "translation": "Their retinues chase after them, wanting to see the most superior, and they show their light.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　人中之上，　　演大光燿，　　妙哉明哲，",
        "translation": "Among humans, he bestows a great ray of light that shines brightly. Marvelous, brilliant, and wise!",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　離垢無漏，　　乃能闡現，　　如斯弘暉，",
        "translation": "Only when they are free of defilement and uncontaminated can they be revealed. Such great splendors,",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　示諸佛土，　　無央數千。　　見此瑞應，",
        "translation": "He manifested innumerable thousands of buddha-lands. Seeing these signs, the god Brahmā said:",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　得未曾有。　　如是疇類，　　諸大變化，",
        "translation": "They attain unprecedented levels of enlightenment. Such are the great miraculous signs that appear in all these fields.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　唯願溥首，　　具說斯誼。　　吾今欽羨，",
        "translation": "I only wish that Puṣkarasārin Will explain the meaning of these words.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　及諸佛子，　　於四部眾，　　心懷悅豫。",
        "translation": "The fourfold assembly of the Buddha’s disciples and enlightening beings was delighted.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　渴仰仁者，　　兼見瞻察，　　今日安住，",
        "translation": "Those who long for kindness Will also see and look out for it. Today they are living in peace.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　何所因由，　　奮大光明，　　而從口出，",
        "translation": "What is the cause for this great ray of light that emerges from your mouth?",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　解散狐疑，　　勸發欣躍。　　何故佛現，",
        "translation": "Why does the Buddha appear, Removing all doubt and confusion And exhorting joy?",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　無極大光？　　如斯所變，　　當有所感。",
        "translation": "The boundless great ray of light That is thus transformed Will have some effect.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　安住之子，　　願用時說。　　大聖所成，",
        "translation": "Children of the well-abiding, please explain it at the proper time.” The Great Sage has accomplished this.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　此微妙法，　　在于道場，　　正士敷演。",
        "translation": "These subtle teachings are taught on the terrace of enlightenment, Prefaced by the wise.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　世雄導師，　　所由方面，　　願為分別。",
        "translation": "World-Honored Guide, let us distinguish the direction from which we are going.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　此諸菩薩，　　欲見佛土，　　無央數千，",
        "translation": "These enlightening beings want to see the buddha-lands, Innumerable thousands of them.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　群生倫品，　　眾寶嚴淨，　　諸佛自現，",
        "translation": "All sentient beings are of the same class, And all jewels adorn and purify them; The Buddhas themselves appear.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　無量明目。　　凡新學者，　　得無猶豫，",
        "translation": "Immeasurable is the eye of insight, which enables new learners to attain it without hesitation.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　諸最勝子，　　普共啟問。　　悅諸人民，",
        "translation": "The supreme beings All asked questions together, Delighted with the people.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　天神羅剎，　　四部之眾，　　一切戴仰。",
        "translation": "All the gods, devas, rākṣasa demons, and the fourfold assembly held it in reverence.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "　今者溥首，　　惟具分別。」",
        "translation": "Now, this is Puṣyamuni, who only explains it separately.",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "於是慈氏以頌而問溥首曰：於是溥首告慈氏、諸大士眾會者族姓子女：「吾心惟忖，",
        "translation": "Maitreya then asked Puṣkarasārin in verse:",
        "source": "T09n0263_001:0064a06_14"
    },
    {
        "source_sentence": "今者如來，當敷大法演無極典，散大法雨、擊大法鼓、吹大法螺，講無量法。",
        "translation": "Now, the Tathāgata will lay out the great teaching and expound the infinite scriptures, scatter the great dharma rain, beat the great dharma drum, blow the great dharma conch, and preach the immeasurable Dharma.",
        "source": "T09n0263_001:0065c11_15"
    },
    {
        "source_sentence": "又自追憶，乃從過去諸佛世尊見斯像瑞，彼如來等所放光明亦復若茲，",
        "translation": "The buddhas and world-honored ones of the past saw this miraculous sight from their own recollections. The light emanated by those buddhas and so forth is also like this:",
        "source": "T09n0263_001:0065c12_16"
    },
    {
        "source_sentence": "猶斯識察知講大法。",
        "translation": "It's like this consciousness that discerns and knows the teaching of the great Dharma.",
        "source": "T09n0263_001:0065c14_17"
    },
    {
        "source_sentence": "諸如來、至真、等正覺，欲令眾生聽無極典，故現斯應。",
        "translation": "The Tathāgatas, Arhats, Perfectly Enlightened Ones want to cause sentient beings to hear the infinite scriptures, so they should do so now.",
        "source": "T09n0263_001:0065c15_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_001:0065c16_19"
    },
    {
        "source_sentence": "世尊欲令群生洗除俗穢，聞服佛法，現弘大變光明神化。",
        "translation": "The Bhagavān wanted to cause all sentient beings to wash away worldly defilements, hear and accept the Buddha's teaching, and now he's spreading great transformative light and miraculous transformation.",
        "source": "T09n0263_001:0065c16_20"
    },
    {
        "source_sentence": "又念往故無央數劫不可思議無能度量，時有如來，號日月燈明至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "I also remember the inconceivable and immeasurable eons of past buddhas. At that time there was a buddha named Candrasaṃkusumitābhijña (“Moonlight of the Sun and Moon,” abbreviated as sun",
        "source": "T09n0263_001:0065c18_0"
    },
    {
        "source_sentence": "為佛、世尊，演說經典，初語亦善、中語亦善、竟語亦善，分別其誼微妙具足，",
        "translation": "For the sake of the buddhas and world-honored ones they expound scriptures that are good at the beginning, good in the middle, and good at the end. Their meanings are distinguished and subtly endowed.",
        "source": "T09n0263_001:0065c20_1"
    },
    {
        "source_sentence": "究竟清淨修梵行，為聲聞乘講陳聖諦，則令眾庶度生老死憂惱眾患入近無為。",
        "translation": "He cultivates the ultimate purity of religious practice and explains the noble truths for the śrāvaka vehicle, so that all people will be liberated from the sufferings of birth, old age, death, grief, and sorrow and enter into the near",
        "source": "T09n0263_001:0065c22_2"
    },
    {
        "source_sentence": "為諸菩薩大士之眾，顯揚部分分別六度無極無上正真。",
        "translation": "To the assembly of bodhisattvas and great men, he reveals partial discernment of the six perfections that are unsurpassed and unsurpassed true.",
        "source": "T09n0263_001:0065c24_3"
    },
    {
        "source_sentence": "「又族姓子，其日月燈明如來滅度之後，次復有佛，亦號日月燈明。",
        "translation": "“Furthermore, clansmen, after the Tathāgata's nirvāṇa, there was another buddha named Candrasaṃkusumitāṇerī, also called Candrasaṃkusumitāṇerī.",
        "source": "T09n0263_001:0065c25_4"
    },
    {
        "source_sentence": "滅度之後，次復有佛，亦號日月燈明。",
        "translation": "After the parinirvāṇa, there was another buddha, also called Candrasaṃkusumitarāja.",
        "source": "T09n0263_001:0065c27_5"
    },
    {
        "source_sentence": "滅度之後，復次有佛，亦號日月燈明。",
        "translation": "After his parinirvāṇa, there was another buddha, also named Candrasaṃkusumitarāja.",
        "source": "T09n0263_001:0065c28_6"
    },
    {
        "source_sentence": "如是等倫八十如來，皆同一號日月燈明，胄紹一姓。",
        "translation": "Thus, the eighty tathāgatas of Samantabhadra are all the same name as Sun and Moon Lamplight, with one family name.",
        "source": "T09n0263_001:0065c29_7"
    },
    {
        "source_sentence": "若斯之比二萬如來，佛語莫能勝。",
        "translation": "If there were 20,000 such tathāgatas, the Buddha's words wouldn't be able to overpower them.",
        "source": "T09n0263_001:0066a01_8"
    },
    {
        "source_sentence": "彼二萬如來最前興者，號日月燈明，最後起者，故復名曰日月燈明如來、至真、等正覺，",
        "translation": "The foremost of those twenty thousand buddhas was named Candrasūryapradīpa, the sun and moon shining brightly. Because he emerged last, he is also called Candrasūryapradīpa Tathāgata, Arhat, Completely",
        "source": "T09n0263_001:0066a02_9"
    },
    {
        "source_sentence": "其佛說經，初語、中語、竟語皆善，分別其誼微妙具足淨修梵行，為諸聲聞講說四諦、十二因緣，",
        "translation": "When the Buddha taught the sutras, the first, middle, and final words were all good, discerning their meanings subtly, perfecting pure cultivation of religious practice for the sake of śrāvakas by expounding the four truths and twelve reasons",
        "source": "T09n0263_001:0066a04_10"
    },
    {
        "source_sentence": "生老病死愁慼諸患，皆令滅度究竟無為。",
        "translation": "The afflictions of birth, old age, illness, death, sorrow, and suffering all cause cessation and liberation that are ultimately nonexistent.",
        "source": "T09n0263_001:0066a06_11"
    },
    {
        "source_sentence": "為諸菩薩講六度無極，使逮無上正真道，至諸通慧。",
        "translation": "He teaches the bodhisattvas the six perfections without limit, enabling them to attain the unsurpassed true path up to the level of supernormal cognition.",
        "source": "T09n0263_001:0066a07_12"
    },
    {
        "source_sentence": "「其日月燈明如來未出家時有八子：一名有志，二曰善意，三曰加勸，",
        "translation": "“When the sun and moon shining brightly, the Tathāgata Candracchattra had eight sons before he renounced household life: one was a man of aspiration, two were men of good intentions, and three were encouraging.",
        "source": "T09n0263_001:0066a08_13"
    },
    {
        "source_sentence": "四曰寶志，五曰持意，六曰除慢，七曰響意，八曰法意，是八太子則如來子，",
        "translation": "These eight princes are the sons of the Tathāgata.",
        "source": "T09n0263_001:0066a10_0"
    },
    {
        "source_sentence": "神足弘普。",
        "translation": "His miraculous powers are vast and universal.",
        "source": "T09n0263_001:0066a11_1"
    },
    {
        "source_sentence": "時一一子各各典主四域天下，其土豐殖治以正法無所侵枉，而見世尊棄國修道逮最正覺適聞得佛，",
        "translation": "Each of these princes, lords of the four continents, prosperous and well populated, ruled by the right Dharma without injustice, saw the World-honored One leaving his kingdom to cultivate enlightenment and attain buddhahood.",
        "source": "T09n0263_001:0066a11_2"
    },
    {
        "source_sentence": "尋皆離俗不顧重位，詣世尊所悉為沙門，皆志無上正真之道，盡為法師，",
        "translation": "They all went to the places where the World-honored One was staying in order to become śramaṇas. They all wished to follow the path of unexcelled, true enlightenment and were all teachers of the Dharma.",
        "source": "T09n0263_001:0066a14_3"
    },
    {
        "source_sentence": "常修梵行，於無央數百千諸佛殖眾德本。」",
        "translation": "He always cultivates the religious practice and plants roots of virtue in measureless hundreds of thousands of buddhas.",
        "source": "T09n0263_001:0066a15_4"
    },
    {
        "source_sentence": "又曰：「阿逸！",
        "translation": "Again, he said, Ay!",
        "source": "T09n0263_001:0066a16_5"
    },
    {
        "source_sentence": "時日月燈明，勸發菩薩護諸佛法，而為眾會講演大頌方等正經。",
        "translation": "When the sun and moonlight were shining, he encouraged the bodhisattva to protect the buddha-dharmas and taught the great verses of the Mahāprajñāpāramitā sūtra for the congregation.",
        "source": "T09n0263_001:0066a17_6"
    },
    {
        "source_sentence": "時彼世尊於座寂然，以無量頌三昧正受即不復現，無身無意都不可得心無所立。",
        "translation": "The Bhagavān then remained silent in his seat, and with an immeasurable verse, he recited the samādhi of right feeling that doesn't arise again, has no body or mind, can't be grasped, and has no",
        "source": "T09n0263_001:0066a18_7"
    },
    {
        "source_sentence": "世尊適三昧已，天雨意華、大意華、柔軟音華、大軟音華，而散佛上及於大會四部之眾，",
        "translation": "“Furthermore, as soon as the World-honored One had entered absorption, rain fell from the sky and scattered flowers of intention, great intention, softness, and gentleness over the Buddha and the fourfold assembly",
        "source": "T09n0263_001:0066a20_8"
    },
    {
        "source_sentence": "應時其地六反震動，國中人民各取天華復散佛上，四部弟子諸天世人愕然疑怪。",
        "translation": "When the ground shook six times, the people of the country each took heavenly flowers and scattered them on top of the Buddha, and the four groups of disciples and gods were startled and wondered.",
        "source": "T09n0263_001:0066a22_9"
    },
    {
        "source_sentence": "其佛三昧未久威神德本，面出一光，其光普照東方萬八千佛土，靡不周遍，",
        "translation": "Not long after this buddha had entered concentration, a ray of light emanating from his face illumined one million eighty-eight thousand buddha-lands in the east, reaching everywhere.",
        "source": "T09n0263_001:0066a24_10"
    },
    {
        "source_sentence": "諸佛國土所可造作悉自然現，亦如今日諸佛土現。",
        "translation": "All the buddha-lands that can be created naturally appear, and so do the buddha-lands appear today.",
        "source": "T09n0263_001:0066a26_11"
    },
    {
        "source_sentence": "彼時世尊與二十億諸菩薩俱，於眾會中講說經法。",
        "translation": "The Bhagavān and 2 billion other bodhisattvas then taught the sūtras and teachings in the assembly.",
        "source": "T09n0263_001:0066a27_12"
    },
    {
        "source_sentence": "諸菩薩大士覩大光明普照世間，而其佛世有菩薩，名曰超光，侍者十八人，",
        "translation": "“Furthermore, in the buddha world there was an enlightening being named Supreme Light, accompanied by eighteen attendants:",
        "source": "T09n0263_001:0066a28_13"
    },
    {
        "source_sentence": "有一菩薩而獨勞懈，名曰名聞，佛三昧正受，從三昧起，為超光菩薩講正法華方等之業，",
        "translation": "“There was an enlightening being who was lazy and unable to work alone, namely a bodhisattva called Maitreya. The buddha-samādhi of meditative absorption came into being because he had entered it. He taught",
        "source": "T09n0263_001:0066b01_14"
    },
    {
        "source_sentence": "諸菩薩行皆說佛法，一處安坐具足六十劫說斯經典，眾會亦然，身不傾動心無因緣。",
        "translation": "The bodhisattvas' practices all explain the Buddha's teaching, and they sit comfortably in one place for 60 eons to preach this sūtra, so do the congregations, whose bodies don't tilt and whose minds have no cause or",
        "source": "T09n0263_001:0066b03_15"
    },
    {
        "source_sentence": "又彼世尊六十中劫，因為諸會說法，聽者一無疲厭心不勞擾。",
        "translation": "For another sixty intermediate kalpas, the Bhagavān taught the Dharma in various assemblies, and the listeners were never tired or troubled at all.",
        "source": "T09n0263_001:0066b05_16"
    },
    {
        "source_sentence": "「日月燈明六十劫中，為諸菩薩講演《法華》方等正經，便自說言，當般泥洹。",
        "translation": "During the sixty eons when the sun and moon are shining bright, he teaches the Lotus Sutra to the bodhisattvas for them, and then he explains it himself, saying, 'I will enter parinirvāṇa.'",
        "source": "T09n0263_001:0066b06_17"
    },
    {
        "source_sentence": "告天世人、諸梵魔眾、沙門梵志、阿須倫、鬼神、諸比丘等：『察於其時，",
        "translation": "He told the gods, humans, Brahmas, Brahmās, renunciants, brahmins, asuras, ghosts, spirits, and monks:",
        "source": "T09n0263_001:0066b08_18"
    },
    {
        "source_sentence": "如來夜半至無餘界當般泥洹。』",
        "translation": "The Tathāgata will attain parinirvāṇa at midnight when he reaches the remaining realm.'",
        "source": "T09n0263_001:0066b10_0"
    },
    {
        "source_sentence": "授其菩薩首藏之決，告諸比丘：『吾滅度後，首藏開士當逮無上正真道成最正覺，",
        "translation": "He instructed the bodhisattva Shouzan to make a resolution, telling the monks, 'After my parinirvāṇa, the enlightened one Shouzan will attain the unsurpassed true path and become the most perfectly enlightened",
        "source": "T09n0263_001:0066b10_1"
    },
    {
        "source_sentence": "號離垢體如來、至真、等正覺。』",
        "translation": "They're called the Tathāgata, the Supreme Truth, and the Completely Enlightened One who are free of defiled essence.'",
        "source": "T09n0263_001:0066b12_2"
    },
    {
        "source_sentence": "佛授決已，尋於夜半而取滅度。",
        "translation": "After the Buddha had given his ruling, he sought to enter nirvāṇa at midnight.",
        "source": "T09n0263_001:0066b13_3"
    },
    {
        "source_sentence": "彼世尊子等類八人，皆歸超光菩薩大士而順教勅，咸志無上正真之道，",
        "translation": "Those eight people, Bhagavān, sons of the World-honored One, and so forth, all turned to the great bodhisattva Vimalakīrti and obeyed his instructions, all aspiring to the unsurpassed true path.",
        "source": "T09n0263_001:0066b13_4"
    },
    {
        "source_sentence": "見無央數億載諸佛，供養奉侍悉逮正覺，最後興者號曰法事。",
        "translation": "He saw innumerable hundreds of millions of years of buddhas, honored and attended them, fully enlightened, and the last to arise was called Dharma service.",
        "source": "T09n0263_001:0066b15_5"
    },
    {
        "source_sentence": "十八人中有一菩薩，於利無節慇懃求供，尊己貪穢多於三病，分別句誼中而忽忘，",
        "translation": "Among the eighteen bodhisattvas, there was a bodhisattva who sought to make offerings for profit without restraint. He honored his own greed and defilement but often suffered from three kinds of illness; he discriminated words",
        "source": "T09n0263_001:0066b17_6"
    },
    {
        "source_sentence": "便得於閑不復懅務。",
        "translation": "He'll then be able to stay in a quiet place and no longer engage in duties.",
        "source": "T09n0263_001:0066b18_7"
    },
    {
        "source_sentence": "時族姓子得名聞定，以斯德本從不可計億百千佛，求願得見悉奉眾聖。」",
        "translation": "The clansmen then attained the concentration of fame and hearing, and because of this virtue, they were originally from incalculable billions of hundreds of millions of buddhas who sought to attain their views and all offered them to the sages.",
        "source": "T09n0263_001:0066b19_8"
    },
    {
        "source_sentence": "溥首謂莫能勝：「欲知爾時比丘法師號超光者，則吾是也。",
        "translation": "Puṣkarasvādi said, If you want to know the name of the monk and Dharma teacher who was called超光 at that time, then I am him.",
        "source": "T09n0263_001:0066b21_9"
    },
    {
        "source_sentence": "其名聞菩薩大士而懈怠者，則莫能勝是。",
        "translation": "Those well-versed bodhisattvas and great men who are lazy can't be superior to them.",
        "source": "T09n0263_001:0066b22_10"
    },
    {
        "source_sentence": "是故當知，見此世尊所見瑞應放其光明，吾觀察之，今日大聖當為我等講《正法華》方等典籍。」",
        "translation": "Therefore, you should know that when you see the Bhagavān's vision of this world-honored one, his light should be emitted, and I'll examine it; today, the great sage will teach us the correct Lotus Sutra for our sake.",
        "source": "T09n0263_001:0066b23_11"
    },
    {
        "source_sentence": "「吾自憶念，　　往古過去，　　不可思議，",
        "translation": "“I myself remember the inconceivable, Inconceivable past and future:",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　無央數劫。　　最勝造誼，　　智慧無上，",
        "translation": "For immeasurable kalpas they are the best in building enemies, Their knowledge and wisdom unsurpassed.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　其號名曰，　　日月燈明。　　彼講說法，",
        "translation": "The name of the buddha was Sun and Moon Lamp.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　聖達無極，　　開化眾生，　　不可計億。",
        "translation": "Their noble attainments are limitless, and their enlightenment to sentient beings is incalculable.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　勸助發起，　　無數菩薩，　　不可思議，",
        "translation": "Countless bodhisattvas are encouraged to initiate it, Inconceivably many.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　億百千人。　　於時如來，　　尊者諸子，",
        "translation": "Hundreds of koṭis of myriads of koṭis of people At that time the Tathāgata, The venerable sons,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　皆為幼童，　　見佛導師，　　則從所尊，",
        "translation": "They're all young children who see the Buddha as a guide, and then they follow the honored one.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　悉作沙門，　　棄捐愛欲，　　一切所有。",
        "translation": "They all become ascetics, abandoning their cravings and all possessions.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　導利世者，　　為講說法，　　所演經典，",
        "translation": "Those who guide and benefit the world Teach the Dharma for their sake, The scriptures they teach.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　名無量頌，　　而號最上，　　厥誼如此，",
        "translation": "His name is immeasurable verse And his title is supreme. This is the meaning of his words.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　開化黎庶，　　億千之數。　　大聖適說，",
        "translation": "He enlightened millions of people, And the Great Sage taught them appropriately.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　斯經典已，　　能仁至尊，　　處於法床，",
        "translation": "Having recited these sutras, the most honorable and benevolent One remained on the Dharma seat.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　加趺而坐，　　尋有瑞應，　　三昧正受，",
        "translation": "Sitting cross-legged, he found an auspicious sign. He entered concentration and meditated correctly.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　名無量頌。　　於時即雨，　　大意音華，",
        "translation": "It is called Immeasurable Verses.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　又現電[火*僉]，　　大雷音聲，　　諸天鬼神，",
        "translation": "They also manifest the sound of lightning and thunder, The sounds of great thunder.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　住於虛空，　　一心奉敬，　　人中之尊。",
        "translation": "Abiding in space, they wholeheartedly venerate him, the most honored among men.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　尋則感動，　　諸佛國土，　　從其眉間，",
        "translation": "When he searches, he's moved. All the buddha-lands From between his eyebrows,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　顯出妙[火*僉]，　　放斯光明，　　無量難限，",
        "translation": "He manifests a wondrous ray of light, Emission of which is immeasurable and limitless.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　不可計人，　　怪未曾有。　　其明遍照，",
        "translation": "The innumerable people wondered at this unprecedented occurrence.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　東方佛土，　　周萬八千，　　億數世界。",
        "translation": "The buddha-lands in the east, Eighty-eight thousand yojanas in circuit, Are a billion worlds in number.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　常以應時，　　多所分別，　　示于眾生，",
        "translation": "He always shows sentient beings the many things he discerns at the appropriate time.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　終始根原。　　或有佛土，　　立諸寶蓋，",
        "translation": "In some buddha-lands the canopies of various jewels are suspended.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　光如琉璃，　　及若水精，　　以導師光，",
        "translation": "The light is like lapis lazuli, Or like water spirits. Because the Guide’s light Is like this:",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　威神之曜，　　現若干種，　　瑰異雅麗。",
        "translation": "The majesty of the gods’ auras Appears in various forms, Brilliant and sublime.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　諸天人民，　　并鬼神龍，　　揵沓惒等，",
        "translation": "The gods, humans, ghosts, spirits, dragons, gandharvas, and so forth.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　驚喜希有。　　其有專精，　　奉事安住，",
        "translation": "He was delighted and marveled at this rare phenomenon, for which he devoted himself To the practice of peaceful abiding.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　彼諸世界，　　皆自然現。　　又見諸佛，",
        "translation": "All those worlds Will appear spontaneously.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　各各自由，　　端正姝妙，　　紫磨金色，",
        "translation": "Each is free, handsome and beautiful, Of purplish-gold color.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　如琉璃中，　　而有眾寶，　　在於會中，",
        "translation": "Just as there are many treasures In the lapis lazuli, Yet they are found in the assembly.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　為雨法教。　　其諸聲聞，　　不可稱計，",
        "translation": "In order to rain down the teaching of the Dharma, The śrāvakas There are innumerable śrāvakas.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　嗟歎無量，　　安住弟子。　　一切導師，",
        "translation": "They are immeasurable in admiration, Abiding as disciples.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　一一世界，　　又光明曜，　　皆悉巍巍。",
        "translation": "Each world Is Also shines with a shining light; All are lofty and majestic.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　常行精進，　　戒無所犯，　　忍辱之力，",
        "translation": "He always practices with energy, keeps the precepts without violating them. Through his power of patience and humility,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　猶明月珠。　　世尊諸子，　　現無央數，",
        "translation": "It is like the light of a moon-pearl.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　遊於閑居，　　山林曠野，　　一切禪定，",
        "translation": "They wander in the mountains, forests, and wilderness In all their meditations.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　不起因緣，　　若有加害，　　不興瞋恨。",
        "translation": "They don't give rise to causes and conditions, and if they harm others, they don't become angry.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　諸菩薩眾，　　如恒沙數，　　安住光明，",
        "translation": "The congregations of enlightening beings Are as numerous as the sands of the Ganges River, Abiding in light.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　感動若斯，　　心念無常，　　不為放逸，",
        "translation": "Thus moved, his mind is impermanent, and he doesn’t indulge in carelessness.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　忍辱樂禪，　　不捨一心。　　有安住子，",
        "translation": "Forbearance and blissful meditation, they don’t give up one mind.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　普悉來現，　　自伏其志，　　慕尊佛道，",
        "translation": "They all come and show themselves, Subduing their own aspirations, Desiring the path of the honored Buddha.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　立審諦住，　　其心寂然，　　各以緣便，",
        "translation": "Established in the abode of deliberation, their minds are quiescent, Each with perceptual objects as an advantage.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　多所開化。　　無數佛界，　　廣說經法，",
        "translation": "Countless buddha-realms have been enlightened, Teaching extensive discourse on scriptures and teachings.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　世尊所為，　　感應如此。　　又覩大聖，",
        "translation": "The action of the Blessed One is like this.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　猶如船師，　　所出光明，　　蔽日月暉。",
        "translation": "It's like a boat captain who produces a ray of light that obscures the sun and moon.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　一切眾生，　　所立歡喜，　　各各問言，",
        "translation": "All sentient beings are established in joy, Each asking questions.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　此何感變？　　天人所奉，　　從三昧起，",
        "translation": "What is this magical transformation that the gods and humans worship?",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　未久之頃，　　導師便坐。　　其菩薩者，",
        "translation": "Soon thereafter, the Guide sat down.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　名曰超光，　　而作法師，　　佛為解說，",
        "translation": "His name was Chao Guang, And he became a teacher of the Dharma. The Buddha expounded it for him.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　世間之眼，　　蠲除眾趣，　　唯安悅我，",
        "translation": "The eyes of the worldly realm Are unable to see all states of existence; They only delight in self.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　示諸種大，　　為我分別。　　於斯經法，",
        "translation": "They show various kinds of greatness For the sake of self-differentiation.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　吾愍眾生，　　以是教化，　　建立勸助。",
        "translation": "Because I pity sentient beings, I teach them with this teaching and establish an encouragement.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　諸菩薩眾，　　聞佛教詔，　　欣然嗟歎。",
        "translation": "The bodhisattvas, hearing the Buddha’s edict, Were delighted and wondered.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　於時世尊，　　說大經法，　　所演具足，",
        "translation": "At the time, the Bhagavān taught the great sūtras and teachings, fully presenting them.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　六十中劫，　　於一床上，　　結加趺坐。",
        "translation": "For sixty medium kalpas, he sat cross-legged on a single bed.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　導師化世，　　說殊特教，　　彼諸佛等，",
        "translation": "The Guide leads the world and teaches special teachings. These buddhas, etc.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　皆已滅度。　　其法師者，　　超光仁人，",
        "translation": "They have all been liberated. The teacher of the Dharma is a compassionate and benevolent man Who surpasses light.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　最勝所演，　　講說經典。　　無央數人，",
        "translation": "The best of the expositions taught the scriptures, And innumerable people recited them.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　皆悉歡喜，　　惟願大聖，　　分別解之。",
        "translation": "They all rejoice, wishing for the great sage to discern and understand them.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　在諸天上，　　及與世間，　　講說經典，",
        "translation": "In the heavens and in the realms of humans, They teach the Dharma.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　自然之誼，　　顯示眾庶，　　此《正法華》。",
        "translation": "This is the True Lotus of the Dharma, which shows the natural characteristics of sentient beings.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　告諸比丘，　　吾已時到，　　當於夜半，",
        "translation": "He said to the bhikṣus, “I am now approaching the right time.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　而取滅度，　　修無放逸，　　堅固其心。",
        "translation": "They attain nirvāṇa, cultivate nonfrivolity, and firmly establish their minds.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　吾已解說，　　諸經法教。　　大聖神通，",
        "translation": "I have explained the teachings of all the scriptures, The teachings of the Dharma.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　難得值遇，　　於無央數，　　億那術劫，",
        "translation": "It's difficult to meet, and it's immeasurable, for billions of eons.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　常當供養。　　無量佛子，　　憂惱諸患，",
        "translation": "Innumerable buddha-children, grieved and distressed by various afflictions, Will always receive offerings.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　甚亦苦劇。　　時聞世尊，　　所現章句，",
        "translation": "At that time I heard the words uttered by the World-honored One.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　觀於無為，　　採習言教。　　值覩人尊，",
        "translation": "Observing the unconditioned, they cultivate verbal expressions and teachings.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　所見安慰，　　會無數人，　　不可思憶。",
        "translation": "He was seen to be comforted, and countless people gathered there, inconceivable.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　比丘莫懼，　　吾當泥曰，　　我去然後，",
        "translation": "Don’t be afraid, monk. I will tell you the truth.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　已不復現。　　第二菩薩，　　號曰首藏，",
        "translation": "The second bodhisattva, Shouzan, will not appear again.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　無有諸漏，　　無所不入，　　當究竟逮，",
        "translation": "There are no contaminants, and nothing they don’t enter. They will ultimately be apprehended.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　尊上佛道，　　所號名曰，　　離垢之體。",
        "translation": "The supreme buddha path, which is called the undefiled body, Is its name.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　即尋於此，　　夜半之時，　　便取滅度，",
        "translation": "At midnight the god entered nirvana.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　盡執光耀。　　其佛舍利，　　而廣分布，",
        "translation": "The relics of those buddhas They distribute widely.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　即起塔廟，　　無量億載。　　諸比丘等，",
        "translation": "For immeasurable millions of koṭis of years the stupas and shrines were built.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　及比丘尼，　　志悉慕求，　　上尊佛道，",
        "translation": "And the bhikṣus and nuns all aspire To the supreme path of buddhahood.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　不可稱限，　　如江河沙，　　常修精進，",
        "translation": "They can’t be measured, Like the sands of rivers and streams. They always cultivate effort.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　尊安住教。　　爾時比丘，　　為法師者，",
        "translation": "At that time the bhikṣu, who had become a teacher of the Dharma and was well versed in all Buddhist teachings,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　超光大人，　　執持經典，　　一坐之頃，",
        "translation": "The great lord Prabhākaramitra held the scriptures, and in the space of a single seat there were many buddhas.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　演說尊法，　　則具足滿，　　八十中劫。",
        "translation": "If someone expounds the honored teaching, they'll be fully endowed with eighty medium eons.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　彼時侍從，　　有十八人，　　教化度之，",
        "translation": "At that time the attendants, Eighteen in number, taught and liberated them.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　皆蒙安隱。　　此等值見，　　無數億佛，",
        "translation": "They will all attain peace, And they will meet countless buddhas.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　至心供養，　　諸大聖尊，　　常尊奉教，",
        "translation": "They wholeheartedly make offerings to the great sages and honored ones, Always honoring and following their instructions.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　柔順之法，　　於諸世界，　　皆各成佛。",
        "translation": "The Dharma of gentleness Is In all the worlds They each become buddhas.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　尊得自在，　　受持無量，　　各各授決，",
        "translation": "The honored one attains mastery, receives and upholds it without measure, and each is given a ruling.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　使逮正覺。　　於時諸佛，　　皆悉究竟，",
        "translation": "At that time the buddhas had all attained perfect enlightenment.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　定光世尊，　　最後得佛，　　大仙日月，",
        "translation": "Bhagavān Dīpaṅkara finally attained buddhahood. The great sage, the sun and moon,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　開化聖眾，　　導師所化，　　巨億百千，",
        "translation": "The enlightened and holy beings are taught by the Guide, billions of koṭis of hundreds of thousands of them.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　安住所興，　　諸大威化。　　法師超光，",
        "translation": "An abode of peace flourishes, And the great and mighty teachings arise. The Master’s transcendent light",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　則吾身是。　　爾時侍從，　　志懈怠者，",
        "translation": "I am the one who served you at that time.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　求索利養，　　親屬交友，　　志所願求，",
        "translation": "They seek gain and profit, their relatives and friends, and their aspirations are sought.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　但慕名聞。　　周旋行來，　　詣諸族姓，",
        "translation": "They simply desire fame and reputation, traveling everywhere, visiting the various clans.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　捨置所學，　　不諷誦讀。　　彼時不肯，",
        "translation": "They abandoned what they had studied And abstained from reciting the scriptures.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　分別而說，　　以故其人，　　唐載此名。",
        "translation": "He explained it in a discriminating way, Because that person's name was given to him by the Tang.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　於佛法教，　　欲使稱譽，　　其人由此，",
        "translation": "Those who want to praise the teaching of the Buddha’s doctrine Will be able to do so because of this.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　所造德本，　　在住世尊，　　而有瑕疵，",
        "translation": "The root of virtue created is abiding, Bhagavān, but there are flaws.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　值見諸佛，　　億千之數。　　積累功德，",
        "translation": "They saw hundreds of thousands of koṭis of buddhas, And accumulated merit.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　廣普大聖，　　專修正行，　　得最順忍，",
        "translation": "The great sage Universal and extensive, Whose practice is exclusively cultivated, Attains the most compliant tolerance.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　又覩世尊，　　於斯能行。　　然於將來，",
        "translation": "Again, the World-honored One is able to do this; but in the future...",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　最後世時，　　當得無上，　　尊佛正道，",
        "translation": "In the final age They will attain the supreme, honored buddha-way.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　成至世尊，　　號曰慈氏。　　教化眾生，",
        "translation": "The supreme World-honored One, named Maitreya, Teaches and transforms sentient beings.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　無數億千，　　逮得勇猛，　　所在自由。",
        "translation": "Countless hundreds of millions of people have attained courage and freedom wherever they are.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　安住滅度，　　仁順其教，　　於彼世時，",
        "translation": "Abiding peacefully in extinction, kindly following their teachings, At the time of that world,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　比像如是。　　我身爾時，　　則為法師，",
        "translation": "At that time I was the teacher of the Dharma in my own right.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　是以之故，　　行哀如此。　　過世覩見，",
        "translation": "Because of this, His compassionate deeds are like this.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　如是之類，　　安住之仁，　　變動若茲。",
        "translation": "Such are the kinds of people who live peacefully, and their movements change like this.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　本第一察，　　如斯瑞應，　　彼時世尊，",
        "translation": "At that time the World-Honored One observed, And thus did these omens appear.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　無量明目，　　諸釋中王，　　現第一誼，",
        "translation": "Innumerable eyes of insight, the kings of the Śākyas, manifest their supreme compassion.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　今者欲說，　　《正法華》典。　　吾過世時，",
        "translation": "I now want to teach you the Lotus Sutra. When I pass away,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　所聞道業，　　今日變化，　　而得具足。",
        "translation": "The practice of the path that I've heard is replete with today's transformation.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　諸導師尊，　　行權方便，　　大釋師子，",
        "translation": "Venerable Guides, who practice righteousness and skillful means, the great Śākya lion,",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　建立興發，　　講說經法，　　自然之教，",
        "translation": "He establishes and produces, teaches the scriptures and teachings, naturally teaching.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　諸懷道意，　　悉叉手歸。　　導利世者，",
        "translation": "Those who cherish the aspiration for enlightenment All return with palms joined, To guide and benefit the world.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　今者分別，　　當雨法雨，　　柔軟法教，",
        "translation": "Now, it's time to make a distinction, Shower the rain of the Dharma, Teach the Dharma with gentleness, And teach the Dharma with compassion.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　普潤飽滿，　　履道意者。　　其有諸天，",
        "translation": "Those who follow the path, Who are universally nourished and satisfied, And whose intentions are based on enlightenment, There will be gods.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　入於無為，　　志懷狐疑，　　而有猶豫。",
        "translation": "Entering into the unconditioned, they harbor doubt in their minds but have hesitation.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "　若有菩薩，　　求斯道意，　　今當蠲除，",
        "translation": "If there are bodhisattvas Who seek this intention for enlightenment, They will now remove it.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "於是溥首菩薩，欲重現誼，說此頌曰：　吾我之想。」",
        "translation": "That's when the Bodhisattva Puṣya, wanting to show his affection, spoke this verse, The conception of self and self.",
        "source": "T09n0263_001:0066b25_12"
    },
    {
        "source_sentence": "正法華經善權品第二",
        "translation": "Second Chapter of the Good Authority Section of the True Lotus Sutra",
        "source": "T09n0263_001:0067c29_0"
    },
    {
        "source_sentence": "於是世尊從三昧覺，告賢者舍利弗：「佛道甚深，如來、至真、等正覺，",
        "translation": "Then the World-honored One awakened from his samādhi and said to the venerable Śāriputra: The buddha path is so profound as to encompass the Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T09n0263_001:0068a01_0"
    },
    {
        "source_sentence": "所入之慧難曉難了不可及知。",
        "translation": "The wisdom that's entered is difficult to understand and difficult to comprehend, and it can't be known.",
        "source": "T09n0263_001:0068a02_1"
    },
    {
        "source_sentence": "雖聲聞、緣覺，從本億載所事歸命，無央數劫造立德本，奉遵佛法慇懃勞苦精進修行，",
        "translation": "Even though śrāvakas and pratyekabuddhas return to their lives from the deeds they did in the past one hundred million years, for countless eons they create foundations of virtue. They follow the buddha-dharma and practice diligently",
        "source": "T09n0263_001:0068a03_2"
    },
    {
        "source_sentence": "尚不能了道品之化。",
        "translation": "They still can't understand the teaching of the factors of the path.",
        "source": "T09n0263_001:0068a05_3"
    },
    {
        "source_sentence": "又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T09n0263_001:0068a05_4"
    },
    {
        "source_sentence": "如來觀察人所緣起，善權方便隨誼順導，猗靡現慧各為分別，而散法誼用度群生，",
        "translation": "The Tathāgata observes the dependent origination of human beings, skillfully and expediently guiding them according to their capacities. They are freed by present wisdom in order to discriminate among themselves, yet they disperse it for the benefit of sentient",
        "source": "T09n0263_001:0068a05_5"
    },
    {
        "source_sentence": "以大智慧力無所畏，一心脫門三昧正受，不可限量，所說經典不可及逮，",
        "translation": "Because of the power of great wisdom and fearlessness, he singlemindedly liberated himself from all obstacles with concentration. His meditative absorption could not be measured or comprehended in detail, and his extensive discourse was unfathom",
        "source": "T09n0263_001:0068a07_6"
    },
    {
        "source_sentence": "而如來尊較略說耳。",
        "translation": "The Tathāgata is the honored one who compares and briefly explains it.",
        "source": "T09n0263_001:0068a09_7"
    },
    {
        "source_sentence": "大聖所說得未曾有巍巍難量，如來皆了諸法所由，從何所來，諸法自然，",
        "translation": "The attainments taught by the Great Sage are unprecedented, majestic, and immeasurable. The Tathāgata understands the causes of all things; where do they come from? All things arise spontaneously:",
        "source": "T09n0263_001:0068a09_8"
    },
    {
        "source_sentence": "分別法貌眾相根本，知法自然。」",
        "translation": "Discriminating the appearance of dharmas is the root of all marks, knowing the dharmas naturally.",
        "source": "T09n0263_001:0068a11_9"
    },
    {
        "source_sentence": "「世雄不可量，　　諸天世間人，",
        "translation": "The world’s heroes cannot be measured; All the gods and humans of the earth,",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　一切眾生類，　　焉能知導師。",
        "translation": "How could all sentient beings know the Guide?",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　離垢解脫門，　　寂然無所畏，",
        "translation": "The door of liberation from defilement Is silent and fearless.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　如諸佛法貌，　　莫有逮及者。",
        "translation": "As is the appearance of all buddhas’ teachings, No one can surpass them.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　本從億諸佛，　　依因而造行，",
        "translation": "Originally, they were created by hundreds of millions of buddhas Depending on causes and conditions.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　入於深妙誼，　　所現不可及。",
        "translation": "He enters into a profound, subtle meaning that's unmatched by what he shows.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　於無央數劫，　　而學佛道業，",
        "translation": "For countless eons They have cultivated the practice of enlightenment.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　果應至道場，　　猶如行慈慜。",
        "translation": "They should go to the site of enlightenment, just like practicing kindness and pity.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　使我獲斯慧，　　如十方諸佛，",
        "translation": "Enable me to attain this wisdom, just like the buddhas of the ten directions.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　諸相普具足，　　眾好亦如是。",
        "translation": "Their marks are universally complete, And so are their various embellishments.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　其身不可見，　　亦無有言說，",
        "translation": "Their bodies are invisible, And there is nothing to say about them.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　察諸群黎類，　　世間無與等。",
        "translation": "Observing all the various kinds of people, there's no equal in the world.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　若說經法時，　　有能分別解，",
        "translation": "When one teaches the doctrine of the scriptures, Someone is able to discriminate and understand.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　其惟有菩薩，　　常履懷信樂。",
        "translation": "Only the bodhisattva always practices faith and happiness.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　假使諸佛，　　弟子之眾，　　所作已辦，",
        "translation": "Suppose the buddhas and their disciples Have accomplished what they should do.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　如安住教，　　盡除疾病，　　執御其心，",
        "translation": "As he teaches the peaceful abode, he rids himself of illness and controls his mind.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　不能達彼，　　若干種慧。　　設令於斯，",
        "translation": "They can't understand the various kinds of wisdom that are there.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　佛之境界，　　皆以七寶，　　充滿其中，",
        "translation": "The spheres of buddhahood Are all filled with the seven treasures.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　以獻安住，　　神明至尊，　　欲解此慧，",
        "translation": "To offer it to the supreme honored One, who abides peacefully, He wishes to understand this wisdom.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　終無能了。　　正使十方，　　諸佛剎土，",
        "translation": "No one will be able to comprehend them; Indeed, all buddha-lands in the ten directions",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　諸明哲者，　　悉滿其中，　　及吾現在，",
        "translation": "The wise and saintly Ones Are all filled with them, As well as I am in the present.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　諸聲聞眾，　　一切具足，　　亦復如是。",
        "translation": "The śrāvakas are all fully endowed, and so it is likewise.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　一時普會，　　共思惟之，　　計安住慧，",
        "translation": "At one time they assemble, reflecting on it together, imagining the wisdom of abiding in peace.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　無能及知。　　佛之智慧，　　無量若斯，",
        "translation": "The Buddha’s wisdom is immeasurable, like this.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　欲知其限，　　莫能逮者。　　諸緣一覺，",
        "translation": "If you want to know the limit, No one will be able to grasp it.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　無有眾漏，　　諸根通達，　　總攝其心。",
        "translation": "Without all the contaminants, his faculties are penetrated, and he collects his mind.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　假使十方，　　悉滿中人，　　譬如甘蔗，",
        "translation": "Even if the people of the ten directions were to fill them all, It would be like sugarcane.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　若竹蘆葦，　　悉俱合會，　　而共思惟，",
        "translation": "Whether bamboo, reeds, or reeds, They all come together And think together:",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　欲察知佛，　　所說解法，　　於億那術，",
        "translation": "Those who want to examine and know the Buddha’s Teaching of the Dharma of Understanding Will be able to do so in hundreds of thousands of ways.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　劫載計念，　　未曾能知，　　及法利誼。",
        "translation": "Even in the course of an eon I have never been able to know anything about this matter, Or about the benefits and advantages of the Dharma.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　新學發意，　　諸菩薩等，　　假使供養，",
        "translation": "The newly awakened minds of the bodhisattvas and so forth, even if they were to make offerings,",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　無數億佛，　　講說經法，　　分別其誼，",
        "translation": "Countless hundreds of millions of buddhas Teach the teachings of the scriptures, Discriminating their meanings.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　復令是等，　　周滿十方，　　其數譬如，",
        "translation": "Furthermore, it causes these things To pervade the ten directions. Their number is like this:",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　稻麻叢林，　　在諸世界，　　滋茂不損，",
        "translation": "The fields of rice and hemp In all the worlds flourish and do not decline.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　悉俱合會，　　而共思惟，　　世尊所明，",
        "translation": "They all come together And think together: What the World-honored One has taught,",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　覩諸法本，　　不可思議，　　無數億劫，",
        "translation": "The root of all the teachings is inconceivable, Countless billions of eons.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　如江河沙，　　不可限量，　　心無變異，",
        "translation": "Like the sands of rivers, they cannot be measured; Their minds are unchanging.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　超越智慧，　　欲得知者，　　非其境界。",
        "translation": "Transcending wisdom, those who want to know aren't their objective realm.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　無數菩薩，　　皆不退轉，　　無崖底劫，",
        "translation": "Countless enlightening beings Have never regressed, For as many eons as there are boulders in the sky.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　如恒邊沙，　　一心專精，　　悉共思惟，",
        "translation": "Like the sand at the edge of the Ganges River, They concentrate their minds on contemplation Together.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　此之等類，　　亦不堪任。　　諸佛聖明，",
        "translation": "These kinds of beings are also unable to bear them.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　不可及逮，　　一切漏盡，　　非心所念。",
        "translation": "They can't be apprehended, and all the contaminants are ended that aren't thought of by the mind.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　獨佛世尊，　　能解了知，　　分別十方，",
        "translation": "The Buddha alone, the World-Honored One, Is able to understand and know. He distinguishes the ten directions:",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　諸佛世界。　　告舍利弗，　　安住所說，",
        "translation": "The buddha worlds addressed Śāriputra, saying:",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　唯佛具足，　　解達知彼，　　最勝導利，",
        "translation": "Only the Buddha is fully endowed with Understanding and knowing them, The supreme guiding benefit.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　悉暢了識，　　說無上誼，　　以來久遠。",
        "translation": "It's been a long time since he fully comprehended consciousness and explained the unsurpassed meaning.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　佛今日告，　　諸聲聞眾，　　緣覺之乘，",
        "translation": "Today, the Buddha has told the śrāvakas and pratyekabuddhas The vehicle of enlightenment:",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　如所立處，　　捨置已逝，　　入泥曰者，",
        "translation": "Just as the place where it stands has already passed away, he entered the mud and said,",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　所可開化，　　各各得度。　　佛有尊法，",
        "translation": "Each can be enlightened and liberated, And each will attain salvation.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　善權方便，　　猶以講說，　　法化世間，",
        "translation": "The skillful means of liberation Is like teaching, Teaching the Dharma for the edification of the world.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "　常如獨步，　　多所度脫，　　以斯示現，",
        "translation": "Always like a lonely walker, They are often liberated. Because of this they manifest.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "於時世尊欲重解誼，更說頌曰：　真諦經法。」",
        "translation": "At the time, the Bhagavān wanted to reinterpret his meaning and spoke another verse, saying, The teaching of the true truth of the sūtras.",
        "source": "T09n0263_001:0068a12_10"
    },
    {
        "source_sentence": "爾時大眾會中，一切聲聞阿羅漢等，諸漏已盡知本際黨，千二百眾及弟子學，",
        "translation": "At the time, all the śrāvakas and arhats in the great assembly had extinguished their contaminants and knew the original party of twelve hundred disciples, one thousand two hundred people, and their disciples.",
        "source": "T09n0263_001:0068c08_0"
    },
    {
        "source_sentence": "比丘、比丘尼、清信士、清信女諸聲聞乘，各各興心念：「世尊何故慇懃諮嗟善權方便，",
        "translation": "The monks, bhikṣuṇīs, women of pure faith, men of pure faith, and women of pure faith in the śrāvaka vehicle each had a thought in their minds, Why did the Bhagavān criticize the skillful means of consulting",
        "source": "T09n0263_001:0068c09_1"
    },
    {
        "source_sentence": "宣暢如來深妙經業，致最正覺慧不可及，聲聞、緣覺莫能知者？",
        "translation": "He proclaims the profound and marvelous sūtras of the Tathāgata, which lead to the supremely perfect enlightened wisdom that's unfathomable for śrāvakas and pratyekbuddhas to know?",
        "source": "T09n0263_001:0068c11_2"
    },
    {
        "source_sentence": "如今世尊乃演斯教，於是佛法無逮泥洹，雖說此經，吾等不解誼之所趣。」",
        "translation": "Now, the Bhagavān teaches this teaching, so the Buddha's teaching doesn't acquire nirvāṇa, and even though he teaches this sūtra, we don't understand its meaning.",
        "source": "T09n0263_001:0068c13_3"
    },
    {
        "source_sentence": "賢者舍利弗，見四部眾心懷猶豫，欲為發問決其疑網，冀并被蒙，前白佛言：「唯然世尊！",
        "translation": "When Venerable Śāriputra saw that the four groups of people had doubts in their minds and wanted to ask questions to resolve their web of doubt, hoping to get rid of it, he went forward and said to the Buddha, Yes, Bhagavān!",
        "source": "T09n0263_001:0068c14_4"
    },
    {
        "source_sentence": "今日如來何故獨宣善權方便，以深妙法逮最正覺，道德巍巍不可稱限？」",
        "translation": "Why is the Tathāgata alone proclaiming the skillful means of good authority today to acquire the most correct awakening with the profound and marvelous teaching, whose morality is so lofty that it can't be measured?",
        "source": "T09n0263_001:0068c16_5"
    },
    {
        "source_sentence": "「樂慧聖大尊，　　久宣如是教，",
        "translation": "Venerable Ānanda, the holy one blissful wisdom Has long taught such a doctrine:",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　力脫門禪定，　　所奉無央數。",
        "translation": "The power of liberation is infinite, and the meditations he practices are incalculable.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　讚揚佛道場，　　無敢發問者，",
        "translation": "Praise the Buddha’s site of enlightenment, No one daring to ask questions.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　獨諮嗟真法，　　無能啟微妙。",
        "translation": "They alone can inquire into the true teaching, but no one can reveal its subtlety.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　顯現大聖法，　　自歎譽其行，",
        "translation": "Manifesting the great sacred teaching, They praise their deeds.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　智慧不可限，　　欲分別深法。",
        "translation": "Their knowledge and wisdom cannot be limited; They want to distinguish the profound truth.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　今鄙等懷疑，　　說道諸漏盡，",
        "translation": "Now, with the slightest doubt and so forth, I'll explain the end of contaminants in the path.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　其求無為者，　　皆聞佛所讚。",
        "translation": "Those who seek nonexistence All hear the Buddha’s praise.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　其求緣覺者，　　比丘比丘尼，",
        "translation": "Those who seek pratyekabuddhahood, monks and nuns,",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　諸天龍鬼神，　　揵沓摩休勒，",
        "translation": "The gods, dragons, ghosts, and spirits, such as Gandhamāhoulī,",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　及餘諸等類，　　心各懷猶豫，",
        "translation": "And the other beings, etc., Each harbored doubt in their minds.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　請問兩足尊，　　大德願解說。",
        "translation": "He asks the two-legged honored one, the great virtuous one, to explain it.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　一切諸聲聞，　　安住所教化，",
        "translation": "All the śrāvakas Will live in peace and teach.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　大聖見歎譽，　　我獨度無極，",
        "translation": "The great sage sees and praises me, saying, “I alone have liberated the infinite.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　鄙意在沈吟，　　不能自決了，",
        "translation": "I can't make up my mind to decide for myself, even though I'm thinking of it in a sleepy voice.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　究竟至泥洹。　　今復聞此說，",
        "translation": "Having finally entered nirvana, I now hear this teaching:",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　唯願演分別，　　雷震音現說。",
        "translation": "I entreat you, O goddess, to explain this distinction And thunder and lightning show it in my presence.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　如今所發教，　　猶若師子吼，",
        "translation": "The teaching given now is like the lion’s roar.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　最勝諸子等，　　歸命皆叉手，",
        "translation": "The most distinguished children, and so forth, saluted each other with their palms joined.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　欲聞正是時，　　願為分別說。",
        "translation": "Wishing to hear it at the right time, I wish to explain it for you with discernment.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　諸天龍眾，　　鬼神真陀，　　無數百千，",
        "translation": "Countless hundreds of thousands of gods, dragons, ghosts, spirits, and true enlightening beings.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　如江河沙，　　而悉僉曰，　　供養世尊。",
        "translation": "Like the sands of rivers and streams, they all say, Making offerings to the Bhagavān.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　咸欲發問，　　於尊佛道。　　國主帝王，",
        "translation": "They all want to ask questions about the Way of the honored Buddha.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　轉輪聖王，　　悉共同心，　　億百千姟，",
        "translation": "The wheel-turning sage kings Are all in the same mind, Hundreds of millions of myriads of bodhisattvas.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "　一切恭敬，　　叉手而立，　　德何因盛，",
        "translation": "What is the reason all respects stand with palms joined, Why are virtues so abundant?",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "時舍利弗以偈頌曰：　眾行具足。」",
        "translation": "Śāriputra then spoke a verse in verse, saying, All the practices are complete.",
        "source": "T09n0263_001:0068c18_6"
    },
    {
        "source_sentence": "爾時世尊，告舍利弗：「且止且止用問此誼。",
        "translation": "It was then that the Bhagavān addressed Śāriputra, Please stop and ask about this meaning.",
        "source": "T09n0263_001:0069a17_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_001:0069a18_0"
    },
    {
        "source_sentence": "諸天世人聞斯說者，悉當恐怖。」",
        "translation": "Those gods and humans who hear this teaching will all be frightened.",
        "source": "T09n0263_001:0069a18_1"
    },
    {
        "source_sentence": "時舍利弗，復重啟曰：「唯願大聖，如是誼者，加哀說之。",
        "translation": "Śāriputra then again asked, Please, great sage, please tell me this kindness.",
        "source": "T09n0263_001:0069a19_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_001:0069a20_1"
    },
    {
        "source_sentence": "於此眾會有無央數億百千載蚑行喘息、蜎蜚蠕動群生之類，曾見過佛知殖眾德，",
        "translation": "In these assemblies there were countless millions of hundreds of millions of sentient beings who had been agitated and panting for uncountable millions of years, screaming and wriggling in anger. They had never seen anyone surpass the",
        "source": "T09n0263_001:0069a20_2"
    },
    {
        "source_sentence": "聞佛所說，悉當信樂受持奉行。」",
        "translation": "When you hear what the Buddha teaches, you'll all believe and happily accept it, uphold it, and practice it.",
        "source": "T09n0263_001:0069a22_3"
    },
    {
        "source_sentence": "「願人中王，　　哀恣意說。　　此出家者，",
        "translation": "“May the king among men speak with compassion, saying, ‘This renunciant has renounced the householder’s life.",
        "source": "T09n0263_001:0069a23_4"
    },
    {
        "source_sentence": "　眾庶億千，　　恭肅安住，　　欽信慧誼，",
        "translation": "Hundreds of myriads of koṭis of people lived in peace and reverence. They esteemed Buddhism, respected wisdom, and cherished virtue.",
        "source": "T09n0263_001:0069a23_4"
    },
    {
        "source_sentence": "　斯之等類，　　必皆欣樂。」",
        "translation": "Such kinds of people will surely all rejoice.",
        "source": "T09n0263_001:0069a23_4"
    },
    {
        "source_sentence": "時舍利弗以偈頌曰：於時世尊歎舍利弗，如是至三，告曰勿重，諸天世人悉懷慢恣，",
        "translation": "Śāriputra then composed the following verse: At that time the World-honored One praised Śāriputra in this way three times, admonishing him: “Do not be arrogant! All the gods and all the worldly beings are concei",
        "source": "T09n0263_001:0069a23_4"
    },
    {
        "source_sentence": "比丘、比丘尼墜大艱難。",
        "translation": "Monks and nuns fall into great difficulties.",
        "source": "T09n0263_001:0069a28_5"
    },
    {
        "source_sentence": "「且止且止，　　用此為問，　　斯慧微妙，",
        "translation": "“Enough, enough! Enough. Use this as a question. This wisdom is subtle,",
        "source": "T09n0263_001:0069a29_0"
    },
    {
        "source_sentence": "　眾所不了。　　假使吾說，　　易得之誼，",
        "translation": "Even if I were to explain it, It would be easy to get an advantage over anyone.",
        "source": "T09n0263_001:0069a29_0"
    },
    {
        "source_sentence": "　愚癡闇塞，　　至懷慢恣。」",
        "translation": "The darkness of ignorance and delusion is so great that they harbor conceit.",
        "source": "T09n0263_001:0069a29_0"
    },
    {
        "source_sentence": "世尊以偈告舍利弗：賢者舍利弗復白佛言：「唯願大聖以時哀說，無央數眾，",
        "translation": "The World-honored One said to Śāriputra in verse: Good man, the venerable Śāriputra again said to the Buddha: All we ask, O great sage, is that you take pity on us at this ungodly hour and tell us",
        "source": "T09n0263_001:0069a29_0"
    },
    {
        "source_sentence": "昔過世時曾受佛教，以故今者思聞聖音，聞者則信多所安隱，冀不疑慢。」",
        "translation": "In a past life, I once received Buddhism, so now I'll contemplate and hear the noble sounds, and those who hear them will believe that they're often at ease, hoping not to doubt their conceit.",
        "source": "T09n0263_001:0069b05_1"
    },
    {
        "source_sentence": "「我佛長子，　　今故啟勸，　　願兩足尊，",
        "translation": "Eldest son of the Buddha, I now therefore exhort you, O Two-Footed Honorable One.",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "　哀為解說。　　今有眾生，　　無數億千，",
        "translation": "I pity you for explaining this. There are now innumerable sentient beings, Countless hundreds of millions,",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "　悉當信樂，　　聖尊所詔，　　會致本德，",
        "translation": "They should all believe and rejoice, As instructed by the holy ones. Assembling their original virtue, They’ll attain it.",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "　決諸疑網。　　往古長夜，　　曾被訓誨，",
        "translation": "To resolve the web of doubt, I’ve been instructed for a long time.",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "　是等叉手，　　恭肅側立，　　必當欽樂，",
        "translation": "These palms joined together, standing sideways in reverence, They will surely be delighted.",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "　於斯法誼。　　我之等類，　　千二百人，",
        "translation": "Among these Dharma friends, there were twelve hundred of us, including myself.",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "　及餘眾黨，　　求尊佛道。　　假令見聞，",
        "translation": "And all the other groups of followers Will seek the path of the supreme buddha.",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "　安住言教，　　尋當歡喜，　　興發大意。」",
        "translation": "Abiding calmly in words and teachings, he'll be delighted to find them and give rise to great intentions.",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "時舍利弗以偈頌曰：于時世尊見舍利弗三反勸助，而告之曰：「爾今慇懃所啟至三，",
        "translation": "Śāriputra then spoke these verses: At that time the World-honored One, having seen Śāriputra exhorting him on three occasions, said to him:",
        "source": "T09n0263_001:0069b06_2"
    },
    {
        "source_sentence": "安得不說？",
        "translation": "How could it not be explained?",
        "source": "T09n0263_001:0069b17_3"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T09n0263_001:0069b17_4"
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Consider it well!",
        "source": "T09n0263_001:0069b17_5"
    },
    {
        "source_sentence": "吾當解說。」",
        "translation": "I will explain it.",
        "source": "T09n0263_001:0069b18_6"
    },
    {
        "source_sentence": "世尊適發此言，比丘、比丘尼、清信士、清信女五千人等，至懷甚慢，",
        "translation": "When the World-honored One said these words, 5,000 monks, nuns, men of pure faith, and women of pure faith became very conceited.",
        "source": "T09n0263_001:0069b18_7"
    },
    {
        "source_sentence": "即從坐起，稽首佛足捨眾而退。",
        "translation": "He rose from his seat, bowed his head at the Buddha’s feet, and withdrew.",
        "source": "T09n0263_001:0069b19_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_001:0069b20_9"
    },
    {
        "source_sentence": "慢無巧便，未得想得、未成謂成，收屏蓋藏衣服臥具摩何而去。",
        "translation": "Being conceited and lacking skillful means, he says it's accomplished when he hasn't attained conception or accomplished what he hasn't accomplished, puts away his curtain, hides his clothes, bedding, and mo",
        "source": "T09n0263_001:0069b20_10"
    },
    {
        "source_sentence": "世尊默然，亦不制止。",
        "translation": "The Bhagavān remained silent and didn't restrain him.",
        "source": "T09n0263_001:0069b22_11"
    },
    {
        "source_sentence": "「又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T09n0263_001:0069b22_12"
    },
    {
        "source_sentence": "眾會辟易有竊去者，離廣大誼聲味所拘。",
        "translation": "Those who secretly leave the assembly and leave it are freed from the vast bonds of affection, sounds, and flavors.",
        "source": "T09n0263_001:0069b23_0"
    },
    {
        "source_sentence": "又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T09n0263_001:0069b24_0"
    },
    {
        "source_sentence": "斯甚慢者退亦佳矣。",
        "translation": "It's good for someone who's very conceited to retreat.",
        "source": "T09n0263_001:0069b24_1"
    },
    {
        "source_sentence": "如來云何說此法乎？",
        "translation": "How did the Tathāgata explain this teaching?",
        "source": "T09n0263_001:0069b24_2"
    },
    {
        "source_sentence": "譬靈瑞華時時可見，佛歎斯法久久希有，爾等當信如來誠諦所說深經，",
        "translation": "It is like the miraculous flower of spirituality that can be seen from time to time. The Buddha praised this teaching as rare and long-lasting. All of you should believe in the profound doctrine taught by the Tathāgata with sincerity.",
        "source": "T09n0263_001:0069b25_3"
    },
    {
        "source_sentence": "誼甚微妙言輒無虛，若干音聲現諸章句，各各殊別人所不念，本所未思如來悉知。",
        "translation": "Their words are so subtle that they aren't false, and their sounds show different chapters and phrases, each distinct from the other people who don't think of them, which the Tathāgata fully knows.",
        "source": "T09n0263_001:0069b26_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_001:0069b28_5"
    },
    {
        "source_sentence": "正覺所興世嗟歎一事，為大示現皆出一原，以用眾生望想果應，勸助此類出現于世，",
        "translation": "In order to use sentient beings’ hope for the fruit of enlightenment, he encourages and assists these kinds of living beings to appear in the world.",
        "source": "T09n0263_001:0069b29_6"
    },
    {
        "source_sentence": "黎元望想希求佛慧出現于世，蒸庶望想如來寶決出現于世，以如來慧覺群生想出現于世，",
        "translation": "Li Yuan's perception of wishing to seek the Buddha's wisdom appears in the world, and Daosun's perception of the Tathāgata's jeweled resolve appears in the world. Because the Tathāgata's wisdom enlight",
        "source": "T09n0263_001:0069c02_0"
    },
    {
        "source_sentence": "示寤民庶八正由路使除望想出現于世。",
        "translation": "He shows the eightfold correct path of the common people, so that they'll be freed from their hopes and conceptions and appear in the world.",
        "source": "T09n0263_001:0069c04_1"
    },
    {
        "source_sentence": "以故當知，正覺所興悉為一誼，以無極慧而造大業，猶一空慧，以無蓋哀興出于世，",
        "translation": "Because of this, it should be known that what is produced by the true awakening is all one and the same. Great action is created with the wisdom of the sphere of infinity, just as a single wisdom of emptiness comes into being in the world because of",
        "source": "T09n0263_001:0069c05_2"
    },
    {
        "source_sentence": "如佛所行，所化利誼亦復如是。",
        "translation": "Just as the Buddha practices, so are the benefits he transforms.",
        "source": "T09n0263_001:0069c07_3"
    },
    {
        "source_sentence": "而為說法，教諸菩薩現真諦慧，以佛聖明而分別之。",
        "translation": "He teaches the Dharma for them, instructs bodhisattvas to manifest the wisdom of the true truth, and discerns it with the Buddha's noble insight.",
        "source": "T09n0263_001:0069c07_4"
    },
    {
        "source_sentence": "轉使增進唯大覺乘，無有二乘況三乘乎！",
        "translation": "It turns out that the only thing that advances is the great awakening vehicle, and there are no two-vehicle or three-vehicle!",
        "source": "T09n0263_001:0069c09_5"
    },
    {
        "source_sentence": "十方世界諸佛世尊，去來現在亦復如是。",
        "translation": "So it is with the buddhas and world-honored ones of the worlds in the ten directions, past, future, and present.",
        "source": "T09n0263_001:0069c10_0"
    },
    {
        "source_sentence": "以權方便若干種教，各各異音開化一切，而為說法皆興大乘，佛正覺乘諸通慧乘。",
        "translation": "With various kinds of teachings of right and skillful means, each with different sounds to enlighten all, they teach the great vehicle and the Buddha's correctly enlightened vehicle as the vehicle of penetrating wisdom.",
        "source": "T09n0263_001:0069c10_1"
    },
    {
        "source_sentence": "「又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T09n0263_001:0069c12_2"
    },
    {
        "source_sentence": "斯眾生等悉更供養諸過去佛，亦曾聞法，隨其本行獲示現誼。",
        "translation": "These sentient beings and so forth all made offerings to the buddhas of the past, heard the Dharma from them, and showed their support according to their past actions.",
        "source": "T09n0263_001:0069c13_3"
    },
    {
        "source_sentence": "吾見群生本行不同，佛觀其心所樂若干，善權方便造立報應，而講法誼，",
        "translation": "I see that all sentient beings’ original practices are not the same. The Buddha, observing their mentalities and inclinations in various ways, skillfully creates appropriate rewards for them by means of expedient means, yet he expounds the Teaching to",
        "source": "T09n0263_001:0069c14_4"
    },
    {
        "source_sentence": "皆為平等正覺大乘，至諸通慧道德一定，無有二也，十方世界等無差特，",
        "translation": "They all aspire to the great vehicle of equanimity, right awakening, and perfect enlightenment, up to the certainty of transcendent wisdom and morality, without duality. The worlds of the ten directions have no distinctions or special",
        "source": "T09n0263_001:0069c16_5"
    },
    {
        "source_sentence": "安得三乘？",
        "translation": "How can they attain the three vehicles?",
        "source": "T09n0263_001:0069c17_6"
    },
    {
        "source_sentence": "「又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T09n0263_001:0069c18_7"
    },
    {
        "source_sentence": "設如來說眾生瑕穢一劫不竟。",
        "translation": "Suppose the Tathāgata teaches that the defilement of sentient beings doesn't end for an eon.",
        "source": "T09n0263_001:0069c18_8"
    },
    {
        "source_sentence": "今吾興出於五濁世：一曰塵勞，二曰凶暴，三曰邪見，四曰壽命短，五曰劫穢濁。",
        "translation": "Now, I'll emerge from five turbid worlds: 1. the world of dust and trouble, 2. the world of violence, 3. the world of wrong views, 4. the world of short life, and 5. the world of eons that are defiled.",
        "source": "T09n0263_001:0069c19_9"
    },
    {
        "source_sentence": "為此之黨本德淺薄慳貪多垢故，以善權現三乘教，勸化聲聞及緣覺者；",
        "translation": "Because their intrinsic virtue was shallow and they were stingy, greedy, and full of defilement, they manifested the teachings of the three vehicles by means of good authority to edify śrāvakas and pratyekabuddhas.",
        "source": "T09n0263_001:0069c21_0"
    },
    {
        "source_sentence": "若說佛乘，終不聽受、不入不解，無謂如來法有聲聞及緣覺道深遠諸難。",
        "translation": "If someone teaches the Buddha vehicle, they'll never hear it, enter it, or understand it, which doesn't mean that the Tathāgata's teaching has profound difficulties for śrāvakas and pratyekbuddhas in the path of śrā",
        "source": "T09n0263_001:0069c22_1"
    },
    {
        "source_sentence": "若比丘、比丘尼，已得羅漢自已達足，而不肯受無上正真道教，定為誹謗於佛乘矣！",
        "translation": "If a monk or nun who has attained arhatship and has accomplished their own feet but doesn't accept the teaching of the unsurpassed true path, he or she will surely denigrate the Buddha vehicle!",
        "source": "T09n0263_001:0069c24_2"
    },
    {
        "source_sentence": "雖有是意，佛平等訓，然後至于般泥洹時，諸甚慢者乃知之耳。",
        "translation": "Even though they have this intention, the Buddha teaches them equally, and then when they reach parinirvāṇa, those who are very conceited will only know it.",
        "source": "T09n0263_001:0069c26_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_001:0069c27_4"
    },
    {
        "source_sentence": "又諸比丘為羅漢者，無所志求，諸漏已盡，聞斯經典而不信樂。",
        "translation": "Furthermore, the monks who are arhats have no intention to seek anything, and once their contaminants have ended, they hear this sūtra but don't believe it.",
        "source": "T09n0263_001:0069c27_5"
    },
    {
        "source_sentence": "若滅度時，如來面現諸聲聞前，大聖滅度不以斯行，令受持說方等頌經，",
        "translation": "When he enters parinirvāṇa, the Tathāgata appears face-to-face before all the śrāvakas. The Great Sage who enters parinirvāṇa does not cause them to memorize and preserve this well-balanced sutra by means of",
        "source": "T09n0263_001:0069c29_6"
    },
    {
        "source_sentence": "尋於異佛、至真、等正覺決其狐疑，然後於彼乃當篤信，如來言誠正有一乘，",
        "translation": "You should seek other buddhas, arhats, true enlightened ones, and fully awakened ones to resolve your doubts. Only then should you earnestly believe that the Tathāgata speaks sincerely about the One Vehicle.",
        "source": "T09n0263_001:0070a02_0"
    },
    {
        "source_sentence": "無有二也。」",
        "translation": "There are no two.",
        "source": "T09n0263_001:0070a03_1"
    },
    {
        "source_sentence": "「比丘比丘尼，　　心懷甚慢恣，",
        "translation": "“Monks and nuns, They harbor great conceit in their minds.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸清信士女，　　五千人不信。",
        "translation": "The pure believers, men and women, Five thousand of them did not believe.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　不自見瑕穢，　　奉誡有缺漏，",
        "translation": "They don’t see themselves as defiled, And admonish those who are flawed.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　多獲傾危事，　　而起愚騃意，",
        "translation": "They are often subject to misfortune and give rise to foolish thoughts.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　反行求雜糅，　　悉無巧方便。",
        "translation": "They go against each other and seek mixture, Yet they have no skillful means to do so.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸佛最勝禪，　　緣此得聞法，",
        "translation": "The buddhas’ supreme meditation Is the condition by which they hear the Teaching.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　供養清淨慧，　　眾會儼然住，",
        "translation": "Their offerings are pure wisdom, And the congregations of the assembly live in reverence.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　一切受恩教，　　逮志立見要。",
        "translation": "All those who receive the teaching of kindness acquire the essentials of views and establish their intentions.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　舍利弗聽此，　　佛為人中上，",
        "translation": "Śāriputra listened to this, and the Buddha was the best among men.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諦覺了諸法，　　為說若干教。",
        "translation": "He perceives the truths and explains various teachings for their sake.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　善權方便，　　億百千姟，　　隨人心行，",
        "translation": "Their skillful means are billions and hundreds of thousands of deeds, Acting according to people’s mentalities.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　而為說法。　　罪福之事，　　若干不同，",
        "translation": "He teaches the Dharma for them, And various sins and evil deeds are different.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　從其宿世，　　各得報應。　　此諸眾生，",
        "translation": "Each of these sentient beings Will receive its retribution from their past lives.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　心各各異，　　所造眾多，　　纏綿結縛。",
        "translation": "Each mind is different from the other; Their creations are manifold, Forming numerous fetters and shackles.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　因緣諸見，　　億百千姟，　　一切品類，",
        "translation": "Hundreds of millions of views, hundreds of millions of views, and all kinds of views.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　瑕穢如是。　　如來大聖，　　說此經典，",
        "translation": "The Tathāgata, the Great Sage, teaches this sutra:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　所言至誠，　　終無虛欺。　　從始引喻，",
        "translation": "The words uttered are spoken with utmost sincerity, Without falsehood in the end.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若干無數，　　如有所說，　　尋為分別。",
        "translation": "Various and countless, just as something is said, it's discriminated by discursive thought.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　其有不樂，　　正覺明者，　　於無數佛，",
        "translation": "Those who are unhappy, correctly enlightened and insightful Are innumerable buddhas.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　不造立行。　　愚癡生死，　　甚多苦患，",
        "translation": "They don’t create and establish practices, are ignorant of birth and death, and suffer greatly.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　故為斯等，　　現說泥洹。　　大聖所興，",
        "translation": "For this reason we now teach that nirvana is produced by the Great Sage.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　行權方便，　　因勸化之，　　使入佛慧。",
        "translation": "Practicing expedient means, he encourages and transforms them so they enter the Buddha's wisdom.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　如佛道教，　　興顯于世，　　吾始未曾，",
        "translation": "Just as the Buddha’s teaching of enlightenment Is revealed in the world, Never before has I done so.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　為若等現。　　何故愚冥，　　覩於導師，",
        "translation": "Why are you so ignorant and stupid as to deceive the Guide?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　見自患厭，　　乃為分別。　　今乃得聞，",
        "translation": "Seeing one’s own distress and disillusionment, One thinks of it as discrimination.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　演于平等，　　以故得說，　　佛所決了。",
        "translation": "It's explained in terms of equality, so it can be explained because it's decided by the Buddha.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　於我法教，　　諸新學者，　　佛以聖慧，",
        "translation": "In my teaching of the Dharma, there are new scholars. The Buddha uses holy wisdom to teach that all sentient beings who have entered nirvana Will attain buddhahood.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　行權方便，　　所可分別，　　為眾生故，",
        "translation": "They practice righteousness and skillful means, Which can be discriminated For the sake of sentient beings.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　欲開化之，　　故示此誼。　　欲知佛道，",
        "translation": "I want to enlighten them, And therefore show them this teaching.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　常調清淨，　　仁樂聖典，　　實為要妙，",
        "translation": "Their constant discipline and purity, benevolence and happiness, and holy scriptures Are really essential and marvelous.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　在諸佛所，　　所作已辦，　　故為斯類，",
        "translation": "They are in the presence of the Buddhas, And their deeds have been done; Therefore they are like this.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　說方等經。　　志性和順，　　行能具足，",
        "translation": "He teaches the well-balanced scriptures, which are endowed with aspiration and obedience.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　是等勇猛，　　親近聖教，　　則為彼說，",
        "translation": "To those who are brave and courageous And draw near to the holy teachings They teach.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　德最弘衍，　　於當來世，　　慈愍哀傷。",
        "translation": "Their virtue is most vast and pervasive, and in future lives they'll be compassionate and sympathetic.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　一切聞之，　　欣然諮嗟，　　我等成佛，",
        "translation": "All who hear it Are delighted to consult and admire. We will become buddhas,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　亦當如是。　　緣是行故，　　世世端正，",
        "translation": "Conditioned by these practices, the world will be handsome in all ways.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　而當翫習，　　是方等經。　　其有逮聞，",
        "translation": "You should thoroughly study this well-balanced scripture, And those who have acquired the knowledge of it Will be able to recite it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　無極聖教，　　斯等乃為，　　佛之弟子。",
        "translation": "The supremely noble teachings are the disciples of the Buddha.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　假使得聽，　　佛一偈者，　　皆成正覺，",
        "translation": "Even if someone were to allow them to hear a single verse of the Buddha, They would all become perfectly enlightened.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　終無有疑。　　佛道有一，　　未曾有二，",
        "translation": "Ultimately there is no doubt. The Buddha-Path has one, but never two:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　何況一世，　　而當有三？　　除人中上，",
        "translation": "How much more so in the case of a single period of time, when there are three?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　行權方便，　　以用乘故，　　開化說法，",
        "translation": "Practicing expedient means, He teaches the Dharma by using the vehicle of enlightenment.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　欲得講說，　　佛之深慧。　　善權方便，",
        "translation": "If you want to teach the profound wisdom of the Buddha, You should skillfully use expedient means.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　導師光明，　　唯有一乘，　　豈寧有二？",
        "translation": "The Guide's light is only one vehicle, so how could there be two?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　下劣乘者，　　當求殊特，　　諸佛所覺，",
        "translation": "Those of the inferior vehicle Should seek to be special. Enlightened by the buddhas,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　常皆如應。　　至尊所在，　　莫敢能當，",
        "translation": "They are always as they should be. Wherever the supreme One is, No one dares to attack him.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　其力一心，　　若順脫門。　　皆立眾生，",
        "translation": "Their power is one-pointed, And if they follow the door of liberation, They will establish sentient beings everywhere.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　於此道教，　　諸佛最勝，　　無有瑕疵。",
        "translation": "In this teaching of the path, the buddhas are the most superior, with no flaws.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　尊無等倫，　　現平等覺，　　如是示以，",
        "translation": "The Honored One has no equal, He manifests equanimous enlightenment.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　眾生善法。　　世尊因而，　　勸立是乘，",
        "translation": "The good Dharma of sentient beings is the reason the World-honored One Encouraged them to establish this vehicle.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　所在安和，　　誘進稽首。　　諸境界名，",
        "translation": "The spheres of the realms where there is peace and harmony, Entice others to make obeisance.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　於此當行，　　斷除一切，　　諸兇暴法。",
        "translation": "Here, you'll practice it to remove all the fierce and violent things.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　是故號佛，　　則大勇猛，　　今已造立，",
        "translation": "For this reason it is called the Buddha. Because of his great courageousness, It has now been established.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若干種相，　　眷屬圍繞，　　演出法光，",
        "translation": "With various forms, Surrounded by their followers, They manifest the light of truth.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　無數眾生，　　億百千姟，　　為講說法，",
        "translation": "Countless sentient beings, billions and hundreds of thousands in number, Teach the Dharma for them.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　自然之印。　　告舍利弗，　　我見如是，",
        "translation": "The Buddha said to the venerable Śāriputra, “This is what I see.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　今當奈此，　　群生類何？　　三十二相，",
        "translation": "What are the thirty-two characteristics of sentient beings?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　顏容殊妙，　　猶得自在，　　無所拘礙。",
        "translation": "Their countenance is marvelous, yet they are free and unobstructed.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　而吾所觀，　　若所思念，　　如往古時，",
        "translation": "Whatever I contemplate, And whatever thoughts I have, As from ancient times",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　有可志願，　　皆具足成，　　深微妙事，",
        "translation": "There’s something to be wished for, All fully accomplished, Profound and subtle things.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　分別講說，　　得至佛位。　　語舍利弗，",
        "translation": "He spoke eloquently And attained the state of buddhahood.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　佛言至誠，　　以何等事，　　寤覺眾生，",
        "translation": "The words of the Buddha are uttered with utmost sincerity. For what purpose does he feel pity for sentient beings?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　假使為說，　　不能解了，　　不肯啟受。",
        "translation": "Even if someone explains it for them, they can't understand it and won't reveal it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　善言至誠，　　即時心念，　　如是之誼，",
        "translation": "With good words spoken with utmost sincerity, he instantly thinks of it in his mind. Such is his meaning.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　前往古世，　　行不可議，　　今日乃逮，",
        "translation": "My journey from ancient times is inconceivable, but today I’ve captured it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　得本所願，　　已斷愛欲，　　除大陰雨。",
        "translation": "Attaining their original vow, they've cut off craving and desire and removed the rain of the great aggregate.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　眾庶坐欲，　　墜于惡趣，　　安住穢厭，",
        "translation": "Ordinary people, seated in the realm of desire, Will fall into evil rebirths. Abiding therein, they will become defiled and disgusted.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　眾諸穢垢，　　黑冥之法，　　數數增長。",
        "translation": "All the defilements, black and dark dharmas, Will increase again and again.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　薄德之夫，　　患苦所惱，　　為諸邪見，",
        "translation": "A man of little virtue Is tormented by suffering and pain. For the sake of wrong views,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　之所羈繫。　　有此無異，　　不有不無，",
        "translation": "Being and nonbeing are not different, neither existent nor nonexistent.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　具足依倚，　　六十二見。　　當住於斯，",
        "translation": "The sixty-two views that are endowed with relied upon, They should abide in these.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　根著所有，　　勢力薄少，　　而懷恐懼。",
        "translation": "Their faculties are attached to what they have, and their powers are weak, yet they harbor fear.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　未曾得聞，　　佛之音聲，　　恒當墮落，",
        "translation": "I've never heard the sound of the Buddha's voice, and I'll always fall into it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　不離三處，　　億百千生，　　不能解法。",
        "translation": "They don't part from the three places, and hundreds of millions of sentient beings can't understand the teaching.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　佛了善權，　　卓然難及，　　為說勤苦，",
        "translation": "The Buddha understands well the right, but it's difficult to overcome. He explains suffering and striving for its sake.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　斷其根原。　　眾生之類，　　諸見所惱，",
        "translation": "Their faculties are cut off, and sentient beings of all kinds Are tormented by views.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　佛故導示，　　便至泥洹。　　吾所以故，",
        "translation": "Because of the Buddha’s instruction, I attained nirvana.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　常解滅度，　　令一切法，　　皆至寂然。",
        "translation": "He always understands cessation and liberation, enabling all dharmas to reach quiescence.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　又復過去，　　諸佛之子，　　當來之世，",
        "translation": "Furthermore, in the past, The heirs of the buddhas, In the future world,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　得成最勝。　　今我如是，　　行權方便，",
        "translation": "I am now practicing righteousness and skillful means.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　各令休息，　　說三乘教。　　其乘有一，",
        "translation": "Each of them were told to rest and taught the teachings of the three vehicles.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　亦不非一，　　大聖世尊，　　故復說一。",
        "translation": "Nor are they not one and the same: Great Sage, World-Honored One. Therefore it is further said to be one.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸有蒸民，　　興發沈吟，　　意慮憒亂，",
        "translation": "The steaming masses Were to scream and wail in distress, And their thoughts were disturbed.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　狐疑猶豫。　　如來所說，　　終無有異，",
        "translation": "I doubt and hesitate. Whatever the Tathāgata teaches, Ultimately there is no difference.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　慧乘有一，　　未曾有二。　　其有往古，",
        "translation": "The wisdom-vehicle has one, but there are never two.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　世雄導師，　　億百千佛，　　諸滅度者。",
        "translation": "The heroic guides of the world, billions of hundreds of thousands of buddhas, and those who have entered nirvāṇa.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　或有過去，　　無央數劫，　　計其限量，",
        "translation": "Or there are infinite eons in the past, calculated to be a limited number.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　不可稱度。　　謂此一切，　　人中之上，",
        "translation": "They cannot be called liberated, for all of them are the highest among humans.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　講說經法，　　無數清淨，　　所可作為，",
        "translation": "To preach the teachings of the sutras, Countless and pure, What can be done?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　報應譬喻，　　行權方便，　　億百千姟，",
        "translation": "Retribution should be likened to the practice of righteousness and skillful means, with billions of millions of hundreds of thousands of arguments.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　普為眾生，　　示現一乘，　　是故說道，",
        "translation": "For the sake of all sentient beings He manifests the single vehicle; Therefore he teaches the path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　度未度者。　　常為人說，　　平等道慧，",
        "translation": "Those who have been liberated and those who have not yet liberated are always taught the wisdom of the path of equanimity for others.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　開化眾庶，　　億百千姟。　　又復見異，",
        "translation": "Hundreds of myriads of koṭis of bodhisattvas enlightened and transformed the common people.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若干大聖，　　為講分別，　　是大尊法。",
        "translation": "Certain great sages teach distinctions for the sake of discernment, which is the great honored teaching.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　本性清淨，　　乃信解之。　　若在天上，",
        "translation": "Their original nature is pure, So they believe and understand it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　世間亦然，　　其有聞經，　　若聽省者，",
        "translation": "So it is in the world: Those who hear the scriptures, And those who listen and reflect on them.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　彼諸眾生，　　所獲安隱，　　常行布施，",
        "translation": "Those sentient beings attain peace, and they always practice generosity.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　其戒具足，　　忍辱無乏，　　斯行平等，",
        "translation": "Their precepts are complete, There’s no lack of forbearance or humility. These practices are equal:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　精進一心，　　修善勇猛。　　於此經典，",
        "translation": "With energy and one mind, they cultivate wholesomeness and boldness.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　遵奉智慧，　　或有建立，　　若干種德，",
        "translation": "Depending on wisdom and knowledge, Some establish certain kinds of virtues.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　斯等皆當，　　成得佛道。　　其有滅度，",
        "translation": "All of them will attain the buddha path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸所如來，　　彼時所有，　　一切眾生，",
        "translation": "All the enlightened ones At that time existed, All sentient beings.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　忍辱調意，　　得至大安，　　斯等皆當，",
        "translation": "With patience and gentleness of mind, they'll attain great peace, and all of them will do so.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　成得佛道。　　假使供養，　　諸佛舍利，",
        "translation": "They will attain the buddha path And even if they make offerings To the relics of those buddhas,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　大聖最勝，　　及滅度者。　　興立佛廟，",
        "translation": "The great sages are the most superior, And those who enter nirvana build buddha-fields.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　眾億百千，　　黃金白銀，　　水精琉璃，",
        "translation": "Hundreds of koṭis of hundreds of koṭis of gold, white silver, crystal, and lapis lazuli.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若以馬瑙，　　造作塔寺，　　車璩異寶，",
        "translation": "If you build a stūpa or monastery with horse agate, A cartriage of extraordinary jewels.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　及明月珠，　　若以墼泥，　　立作形像，",
        "translation": "And the bright moon-pearl, Or if he were to make an image of it with mud and dirt,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　斯等皆當，　　成得佛道。　　假使以石，",
        "translation": "All of them will attain the buddha path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　用作佛廟，　　或以栴檀，　　若木蜜香，",
        "translation": "It's used to make a buddha shrine, Or made of sandalwood or wood with the scent of honey.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　設令塔寺，　　立天尊像，　　材木刻鏤，",
        "translation": "He ordered the stupas and temples to erect statues of the deva-honored one, carved out of wooden planks.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　彩畫眾飾，　　或有奉戒，　　口言至誠，",
        "translation": "Some are decorated with various colors and patterns, Some observe the precepts, And speak sincerely.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若復竪立，　　最勝廟寺，　　在於居室，",
        "translation": "Again, if you were to build the most excellent shrine and temple in your living quarters,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諷誦經典，　　處于曠野，　　深谷中立，",
        "translation": "He recites the scriptures, and he lives in the wilderness, standing deep in a valley.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　為數億人，　　而師子吼。　　現有十方，",
        "translation": "For hundreds of millions The lion’s roar appears in the ten directions.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸佛廟寺，　　中有舍利，　　童子對舞。",
        "translation": "There are relics preserved in the shrines of the buddhas, and the children dance with each other.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　斯等皆當，　　成得佛道。　　若為如來，",
        "translation": "All of them will attain the buddha path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　作寶模像，　　三十二相，　　執持殊最。",
        "translation": "He made a jeweled image, with thirty-two marks, The most distinguished in holding it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　假使復有，　　誦經說誼，　　斯等皆當，",
        "translation": "Even if there are those who recite scriptures and teach meanings, They should all do so.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　成得佛道。　　設為安住，　　興立彩像，",
        "translation": "They will attain the path of buddhahood, And even if they wish to live there, They will produce and post colorful images.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　後致七寶，　　覺意道路，　　其光遍照，",
        "translation": "The latter brings about the seven treasures, the path of enlightenment, whose light shines everywhere.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　通徹眾行，　　斯等皆當，　　成得佛道。",
        "translation": "They penetrate all practices, and they'll all attain the Buddha Way.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若復以銅，　　刻鏤碧玉，　　為大聖尊，",
        "translation": "If he were to carve it out of copper And carve it into blue jade, He would be a great sage and honored one.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　立殊特形，　　設以經字，　　載妙素帛，",
        "translation": "It stands in an extraordinary shape, Carrying the Sanskrit phonemes of scriptures With exquisite silk and cotton cloth.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　斯等皆當，　　成得佛道。　　若繕壞寺，",
        "translation": "All of them will attain the buddha path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　修立形像，　　功德志性，　　有百福相，",
        "translation": "Cultivating and erecting images, Their virtues and aspirations have the characteristics of a hundred merits.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　出家學法，　　書佛經卷，　　斯等皆當，",
        "translation": "They should renounce the householder’s life, study the Dharma, and write Buddhist scriptures in fascicles.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　成得佛道。　　設使各各，　　作奇異行，",
        "translation": "They will attain the path of buddhahood, And even if they each Do extraordinary deeds.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　除棄一切，　　所樂調戲，　　正士童子，",
        "translation": "Rejecting all the pleasures and playfulnesses, the righteous one, the boy,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　聰達解誼，　　而不謿話，　　言不虛誕，",
        "translation": "Their intellect is wise and understanding, And they don’t speak harsh words or falsehoods.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　悉亦自致，　　為大慈哀，　　一切皆當，",
        "translation": "For the sake of great compassion, And for the sake of all sentient beings’ well-being, All should be saved.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　逮得佛道。　　即使得度，　　億千群萌，",
        "translation": "Having attained the path of enlightenment, Even if one were to attain salvation, Hundreds of millions of sentient beings would be born.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　無數菩薩，　　神通三昧。　　設為是等，",
        "translation": "Countless bodhisattvas Have entered the concentration of mystic powers.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　安住舍利，　　興立塔寺，　　彩畫形像，",
        "translation": "They placed the relics there, erected stūpas and temples, painted with colorful images.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　塗治堊飾，　　書經著壁，　　供上華香，",
        "translation": "They are decorated with whitewash, written scriptures on walls, and offered flowers and incense.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　勳散塔像，　　假令伎樂，　　歌誦佛德，",
        "translation": "They mix and scatter stūpas and images, pretending to cause music and dance, singing and reciting the Buddha’s virtues.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　簫成鼓舞，　　節奏哀和，　　讚美嬉笑，",
        "translation": "The sound is composed to inspire, the drums beat with pity and harmony, praising and laughing.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　又加肅敬，　　以若干事，　　遵修供奉，",
        "translation": "They also pay their respects with reverence, honoring and paying homage to the Buddha Through various means of worship.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　彈琴箜篌，　　鐃鏡應弦，　　箏笛吹笙，",
        "translation": "They play the lute, The bells are ringing in accord with strings; The zither and flutes sound like a phoenix.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　激發妙音，　　皆以一心，　　不為眾吏，",
        "translation": "They make a wondrous sound, All with one mind, Without being servants or officials.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　緣是悉致，　　寂然悅豫。　　若以挹灑，",
        "translation": "Because of this accomplishment, they are tranquil and happy.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　淨掃塔寺，　　用柔軟水，　　蜜漿飲施，",
        "translation": "He cleans out the stūpa and temple, provides soft water, drinks honey and syrup, and makes offerings.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　雜香堊塗，　　理作樂器，　　歸命安住，",
        "translation": "A mixed ointment of fragrance and whitewash, a musical instrument made out of principle, returns to life and abides peacefully.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　供養最勝，　　以若干物，　　供上舍利，",
        "translation": "The most excellent offering is to offer certain things as an offering for the highest relics.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　如來滅度，　　少多肅敬，　　假使一反，",
        "translation": "The Tathāgata enters nirvana With little veneration and a great deal of reverence. Even if one were to recite it once,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　鼓伎拊弄，　　一切皆當，　　得成佛道。",
        "translation": "All the drums, tricks, and jugglers Will all attain buddhahood.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　設令得見，　　安住畫像，　　執持一華，",
        "translation": "Suppose he causes them to see a peacefully abiding painted image, holding a single flower.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　進上靈模，　　以恭敬意，　　篤信無疑，",
        "translation": "He advances to the supreme spiritual form with respect and faith, devoting his faith without doubt.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　當稍稍見，　　無數億佛。　　其有人眾，",
        "translation": "Suddenly you will see Innumerable hundreds of millions of buddhas, With many beings and multitudes.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　叉手佛廟，　　具足一反，　　繞旋自歸，",
        "translation": "The palms joined at the Buddha’s shrine, Reaching each other one bow in all directions.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　禮拜大聖，　　嗟歎稽首，　　所行如是，",
        "translation": "They venerate the Great Sage And bowed their heads in admiration.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　身無垢染，　　當漸漸覲，　　無數億佛。",
        "translation": "Their bodies are undefiled, and they'll gradually see innumerable billions of buddhas.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　於諸導師，　　多造利誼，　　假使有持，",
        "translation": "They often create profits for their guides, even if they have support.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　舍利供養，　　口宣音言，　　南摸佛尊，",
        "translation": "The relics were offered to the Buddha, who uttered the sounds of his words. He was venerated by people in the southern direction.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　其亂心者，　　若說此言，　　斯等皆當，",
        "translation": "If someone with a disturbed mind says these words, they should all say...",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　逮尊佛道。　　滅度因緣，　　盡除毒火，",
        "translation": "He has attained the path of the supreme Buddha, The cause and condition for enlightenment, Extinguishing poisonous fire.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　此等皆當，　　逮成佛道。　　於眾會中，",
        "translation": "All of them will attain the buddha path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　建立信者，　　爾時安住，　　當濟此倫，",
        "translation": "Those who establish faith will at that point abide in peace, and they'll help this world.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　假使有人，　　聞此法名，　　斯等皆當，",
        "translation": "Suppose someone hears the name of this teaching, and they all should...",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　逮成佛道。　　若復當來，　　無數億佛，",
        "translation": "In the future, Countless millions of buddhas Will become buddhas.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　不可思議，　　無能限量，　　是等上勝，",
        "translation": "Unfathomable, unfathomable, incapable of limitation, this is their supreme excellence.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　世雄導師，　　當為講說，　　善權慧事，",
        "translation": "World-Honored Guide, you should expound for him the practice of skillful authority and wisdom.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　是等大人，　　行權方便，　　當得成佛。",
        "translation": "Such great men, practicing righteousness and skillful means, Will become buddhas.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　導世聖雄，　　所以開化，　　億數眾生，",
        "translation": "The Guide of the world, the holy hero, Is the reason for enlightenment; Hundreds of millions of sentient beings are inspired by it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　禪定智慧，　　以消諸漏，　　得聞此法，",
        "translation": "By the power of meditation and wisdom They eliminate the defilements And hear this doctrine.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　未有一人，　　群萌品類，　　豈弘了覺。",
        "translation": "How could there be a single person Who doesn't understand the various kinds of sentient beings and how could he fully awaken them?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸大聖法，　　皆本所願，　　行佛道時，",
        "translation": "The great sacred teachings are all originally wished for, and when they practice the Buddha Way,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　最後究竟，　　無量法門，　　億千姟數，",
        "translation": "The last and the ultimate are boundless teachings, Hundreds of millions of eons in number.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　當來最勝，　　之所講說。　　諸如來尊，",
        "translation": "The Tathāgatas, the supreme in the future, Will teach what they teach.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　常宣布法，　　是則得見，　　諸佛正教。",
        "translation": "Always proclaiming the teaching, they'll attain insight, which is the right teaching of the buddhas.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸佛本淨，　　常行自然，　　此諸誼者，",
        "translation": "The buddhas are inherently pure, Always acting naturally.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　佛所開化，　　如兩足尊，　　乃分別道，",
        "translation": "The enlightenment of the Buddha is like a two-legged honored one Who distinguishes paths.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　故暢斯教，　　一乘之誼。　　諸法定意，",
        "translation": "Therefore, this teaching spreads the meaning of the One Vehicle (i.e., Mahayana).",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　志懷律防，　　常處于世，　　演斯讚頌，",
        "translation": "Their aspiration is to keep the precepts, And they always remain in the world. They recite these verses of praise:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　每同讚說，　　善權方便，　　諸最勝尊，",
        "translation": "Every time they all praised the skillful means of liberation, The supreme honored ones.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　志意弘大。　　其有供養，　　天人所歸，",
        "translation": "Their aspiration is great, and their offerings are offered to them by gods and humans.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　今現在佛，　　如江河沙，　　欲利安隱，",
        "translation": "The buddhas of the present are like rivers, rivers, and streams. They want to benefit sentient beings and bring them peace.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　一切群黎，　　斯等正覺，　　亦說佛尊，",
        "translation": "All the groups of people, Such as the perfectly enlightened ones, Are also said to be the Buddha’s honored ones.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　所可演說，　　善權方便。　　以若干教，",
        "translation": "The doctrine that can be expounded Is based upon skillful means.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　開化令入，　　皆共諮嗟，　　是一乘道，",
        "translation": "Enlightenment and enlightenment cause all to enter, and they all share the admiration for the One Vehicle path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　寂然之地，　　無有二上。　　欲知眾生，",
        "translation": "In the land of tranquility There is none higher than this.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　本際之行，　　從其過去，　　志性所猗，",
        "translation": "The practices of the past and future are derived from their past; Their determination is based on them.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　料簡精進，　　而觀本原，　　諸未脫者，",
        "translation": "He investigates the essence with effort And observes the origin. Those who are not liberated,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　為分別說。　　眾導師力，　　若干因緣，",
        "translation": "The power of the Guides is explained in order to distinguish.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　攀喻引譬，　　而為示現，　　探覩群生，",
        "translation": "They cling to metaphors, cite metaphors, And show them for the sake of sentient beings.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　種種所樂，　　若干部音，　　而開化之。",
        "translation": "Various kinds of music, Various groups of voices, Teaching and edifying them.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　今我如是，　　為人中王，　　興發黎庶，",
        "translation": "I am now like this, For the sake of being king among men, Awakening all living beings.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　安隱利誼，　　種種音聲，　　億百千姟，",
        "translation": "Their peaceful and beneficial meanings are various sounds, billions of hundreds of millions of voices.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　故為示現，　　斯佛大道。　　吾所說法，",
        "translation": "Therefore, in order to show this buddha-way of enlightenment I teach the Dharma.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若干種變，　　知諸萌類，　　心所好樂，",
        "translation": "Knowing various kinds of changes, they know the types of sentient beings and their mental pleasures.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　若干色像，　　尋令悅豫，　　緣其智慧，",
        "translation": "Certain forms and images please the seeker. Conditioned by his wisdom, The enlightening being’s consciousness is like this:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　訓以道力。　　吾為法王，　　而遍觀見，",
        "translation": "I am the king of the Dharma, Yet pervade everywhere.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸愚冥者，　　離智慧德，　　崩墜生死，",
        "translation": "The ignorant are free of wisdom and virtue, falling into birth and death.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　坑壙險谷，　　不得解脫，　　來世艱難，",
        "translation": "Their pits and valleys are dangerous, they won’t be liberated, and in the next life they’ll experience hardship.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　愛欲所繫，　　馳如流沙，　　諸塵勞垢，",
        "translation": "Being tethered by craving and desire, they run like a stream of dust and dirt.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　今日自在。　　大聖威神，　　覺無所來，",
        "translation": "Today the great sage, who is free and powerful, Realizes that there is no place to come.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸法未曾，　　致眾患苦，　　群萌之類，",
        "translation": "All dharmas are unprecedented, Causing all kinds of suffering and distress.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　默在六塹，　　堅住邪見，　　不可動轉，",
        "translation": "They are silent in the six moats, firmly abiding in wrong views, unmoving.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　在於苦惱，　　處危嶮徑。　　吾發大哀，",
        "translation": "In the midst of suffering and distress, On dangerous paths in dangerous places, I feel great sorrow.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　愍此愚癡，　　安隱求至，　　處于道場，",
        "translation": "I pity this foolish man, Who lives in peace and seeks supreme bliss. On the terrace of enlightenment",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　具足七日，　　坐於草蓐，　　即思惟誼，",
        "translation": "For seven days he sat cross-legged on a blade of grass, Thinking and reflecting:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　當何所興？　　尋時即斷，　　彼世慢恣，",
        "translation": "Where will they be produced? They are immediately abandoned at the right time.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　觀察尊樹，　　目未曾眴。　　吾又經行，",
        "translation": "Observing the venerable tree, my eyes have never seen anything like it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　於斯樹下，　　因奇特慧，　　得未曾有，",
        "translation": "At the foot of this tree, Because of his extraordinary wisdom, He attained an unprecedented experience.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　眾生輪轉，　　於大無明。　　於時梵天，",
        "translation": "Sentient beings transmigrate in great ignorance.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　則知佛意，　　帝釋四天，　　諸護世者，",
        "translation": "Then you’ll know the Buddha’s intention. Indra and the four heavenly gods, World-protectors,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　大神妙天，　　及善天子，　　無數億千，",
        "translation": "The great deities, the marvelous celestials, and the good celestial beings Are countless hundreds of millions.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　皆共覺知，　　一切叉手，　　儼然恭肅。",
        "translation": "They all perceive it together, saluted with their palms joined, and venerated it with reverence.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　我時自念，　　當奈之何？　　假令吾歎，",
        "translation": "At that moment, I thought to myself, “What should be done for him?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　佛之道德，　　群黎品類，　　莫肯受化，",
        "translation": "The Buddha’s virtue is such that All beings of all classes Will not accept his edification.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸闇冥者，　　便當謗毀，　　適毀此已，",
        "translation": "Those in darkness and obscurity will denigrate it, and after denigrating it, they'll reject it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　趣非法地。　　吾初未曾，　　說奇妙法，",
        "translation": "I have never taught such a wonderful Dharma before.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　常樂餘事，　　當何興立？　　等觀往古，",
        "translation": "How can the eternal bliss and other things be established? Observing from ancient times,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸佛所為，　　彼時聖眾，　　行權方便。",
        "translation": "The buddhas do what they want, and the noble people at that time practice expedient means.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　吾今寧可，　　以此佛道，　　分為三乘，",
        "translation": "Let me now divide this buddha path into the three vehicles.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　而開化之。　　初成佛時，　　作此思惟，",
        "translation": "When he first attained buddhahood, He had this thought:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　又有十方，　　諸佛世尊，　　其大聖眾，",
        "translation": "And also in the ten directions, The buddhas, the world-honored ones, The great holy congregations,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　悉各自現，　　音讚善哉，　　我等欣豫。",
        "translation": "Each of them appeared, praising the sound as good, and we rejoiced.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　快哉能仁，　　世雄導師，　　斯為正法，",
        "translation": "How wonderful it is that you can be such a benefactor, the heroic guide of the world! This is the true Dharma.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　執御當然，　　乃能思惟，　　善權方便。",
        "translation": "Only when they grasp and control it can they contemplate the skillful means of skillful means.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸大聖典，　　亦學救世，　　吾等為佛，",
        "translation": "All the great sacred scriptures Are also training in salvation. We are buddhas.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　履上跡時，　　分為三乘，　　而開化之。",
        "translation": "When they walk up the path, They are divided into the three vehicles And lead and inspire them.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　下劣不肖，　　志懷羸弱，　　觀諸佛興，",
        "translation": "They are inferior and unworthy, Weak-willed and weak-minded, Observing the buddhas as they arise.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　卒不肯信，　　吾等猶此，　　興立攝濟，",
        "translation": "But the king refused to believe it. We are like this: we stand up to take refuge in you.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　以權方便，　　而為示現。　　嗟歎稱美，",
        "translation": "Through expedient means they show it, extolling and praising it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　獲果之證，　　又復勸助，　　無數菩薩。",
        "translation": "The realization of their fruit is also encouraged and assisted by countless bodhisattvas.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　爾時佛身，　　聽諸尊歎，　　尋則解了，",
        "translation": "At that time the Buddha’s body Heard the venerable ones exclaim, And when they looked into it, They understood.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸大聖音。　　弘妙之士，　　心欣悅豫，",
        "translation": "The great holy voices of the Great Sage, vast and marvelous, Are heard with joy in the hearts of the heroes.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　今大神通，　　分別名色。　　於時余等，",
        "translation": "Now the great supernatural power is to distinguish name and form.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　當遵其行，　　如諸導師，　　之所言說。",
        "translation": "You should follow their practice, just as the guides say.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　我時比丘，　　亦持斯法，　　出生於人，",
        "translation": "I, the monk of that time, Upheld this teaching as well, Have been born among humans.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　黎庶之間。　　告舍利弗，　　吾聽省彼，",
        "translation": "In the middle of the assembly, he said to Śāriputra, “I will listen and examine him.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　尋時往詣，　　波羅奈國，　　便即合集，",
        "translation": "At the right time, they traveled to the country of Vārāṇasī and assembled there.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　諸比丘眾。　　身子欲知，　　佛善權法，",
        "translation": "The assembly of monks, the body-son, wishing to know that the Buddha is skilled in the law of righteousness,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　大聖應時，　　便轉法輪，　　興發宣暢，",
        "translation": "At the right time, the great sage then turned the wheel of the Dharma and promoted its teaching.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　滅度寂然，　　歎羅漢音，",
        "translation": "The Buddha entered nirvana and remained silent, extolling the voice of the arhat.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　讚譽法聲。　　於是歌頌，　　聖眾之德，",
        "translation": "They praised the sound of the Dharma and sang hymns in praise of the virtues of the holy ones.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　其聞最勝，　　說彼經典。　　一切皆來，",
        "translation": "The best of those who heard this teaching taught the scriptures, And all came to hear it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　歸於世尊，　　僉共叉手，　　恭肅而住。",
        "translation": "Returning to the Bhagavat, he saluted him with his palms joined and stood there in reverence.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　善權方便，　　為若干種。　　爾時世尊，",
        "translation": "There are several kinds of skillful means.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　復更思惟，　　吾說尊法，　　今正是時。",
        "translation": "Again, I'll think again, 'I taught the venerable teaching, and now is the right time.'",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　我所以故，　　於世最勝，　　應當講說，",
        "translation": "For this reason I am the foremost [in being] in the world. I should explain it to you.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　斯尊佛道。　　志懷愚癡，　　起於妄想，",
        "translation": "This is the path of the honored buddha. He cherishes folly and gives rise to deluded thoughts.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　設吾說法，　　少有信者，　　憍慢自大，",
        "translation": "Even if I teach the Dharma, There will be few who believe in it. They will be arrogant and conceited,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　不肯啟受。　　如斯法者，　　菩薩乃聽。",
        "translation": "They won’t reveal the teaching, and if they follow it, The bodhisattvas will listen.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　佛時悅豫，　　秉修勇猛，　　應時解斷，",
        "translation": "The Buddha is delighted at the time, maintains vigor and courageousness, Understands and stops them accordingly.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　一切諸結。　　今日當說，　　最勝自由，",
        "translation": "All the fetters, Today I will explain The supreme freedom.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　或以勸助，　　使入佛道。　　諸佛之子，",
        "translation": "Or by encouraging and assisting them, They may cause them to enter the buddha path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　得觀覩此，　　因從獲信，　　順行法律。",
        "translation": "Observing this, they attain faith and follow the practice of the Dharma.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　時千二百，　　諸漏盡者，　　皆當於世，",
        "translation": "At that time one thousand two hundred, all the contaminants will be extinguished, All in the world.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　成為佛道。　　亦如往古，　　諸佛大聖，",
        "translation": "They become buddhas and paths, just as they were in the past.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　亦如當來，　　最勝之法。　　吾復如是，",
        "translation": "In the same way, in the future, I will practice the supreme Dharma.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　蠲棄眾想，　　然後爾乃，　　講天尊法。",
        "translation": "He abandons all conceptions and then teaches the teaching of the goddess.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　久久時時，　　世間有佛，　　大仙慧士，",
        "translation": "For a long time, for a long time, There will be buddhas in the world. Great sages and wise men,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　興發聖道，　　無極明目，　　既現於世，",
        "translation": "The supremely luminous eye of the noble path that arouses enlightenment, Having appeared in the world,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　選擇希有，　　時講斯法。　　於億百千，",
        "translation": "Choosing rare and precious teachings, he taught these teachings at the right time for hundreds of millions.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　無量劫數，　　乃得值遇，　　如此像法。",
        "translation": "Innumerable kalpas have passed since then, And yet we've been able to meet such an image.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　假使菩薩，　　獲斯比經，　　若復逮聞，",
        "translation": "Suppose a bodhisattva obtains this kind of scripture, and if he were to acquire it again,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　是尊佛道。　　若靈瑞華，　　時時可見，",
        "translation": "This is the path of the honored buddha. If there are spiritual and miraculous flowers, They can be seen at all times.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　欲見慕值，　　莫能覩者。　　最勝容貌，",
        "translation": "Whoever wishes to see and desires to meet, No one can cheat him. The most distinguished appearance is like this:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　和悅難遭，　　天上世間，　　無上聖賢，",
        "translation": "It’s difficult to find a harmonious happiness, and the gods of the heavenly realm are unsurpassed by noble beings.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　今此大尊，　　乃謂琦珍。　　假使有人，",
        "translation": "This great venerable one is now called a rare treasure.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　而說斯經，　　一反舉聲，　　歡喜勸助，",
        "translation": "He recites this sutra, raising his voice once and for all, Rejoicing and encouraging.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　則為供養，　　一切佛已。　　其去亂心，",
        "translation": "Then, in order to honor all the buddhas, Having served them, They leave their troubled minds and go forth.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　不懷狐疑。　　吾為法王，　　悉普告勅，",
        "translation": "I, the king of the Dharma, Have not harbored doubts or doubts.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　吾之法中，　　一切聲聞，　　則便勸助，",
        "translation": "In my teaching, all the śrāvakas Will be encouraged.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　以尊佛道。　　卿舍利弗，　　及諸聲聞，",
        "translation": "You, Śāriputra, and all the śrāvakas Followed the path of the supreme buddha.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　今現在者，　　且皆默然。　　其諸菩薩，",
        "translation": "All the bodhisattvas who are now there Will remain silent.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　意勇智慧，　　密持斯法，　　勿得忘宣。",
        "translation": "Their minds are courageous and wise, They secretly uphold this teaching; Do not forget to proclaim it.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　何故說世，　　而有五事？　　或有眾生，",
        "translation": "Why is it said that there are five things in the world?",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　懷毒求短，　　貪欲愚聵，　　而好誹謗，",
        "translation": "They harbor poison and seek shortcomings, Are greedy and stupid, And like to denigrate.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　如是倫品，　　不尚至道。　　若當來人，",
        "translation": "Thus, these kinds of people aren't well versed in the ultimate path.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　而說此法，　　聽察如來，　　一乘之教，",
        "translation": "He teaches this teaching and listens to the Tathāgata’s Teaching of the One Vehicle.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　設復覩見，　　諸最勝名，　　誹謗斯經，",
        "translation": "Even if they hold a crude view, the most excellent names will denigrate this sūtra.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　便墮地獄。　　假使有人，　　慚愧清淨，",
        "translation": "Suppose there is a man whose shame and scruples are pure, Who will fall into hell.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　發心志願，　　求尊佛道，　　聞大覺乘，",
        "translation": "They arouse the aspiration for enlightenment, seek the path of honored buddhahood, and hear the great vehicle of enlightenment.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　無量之德，　　諸佛聖明，　　則現目前，",
        "translation": "Immeasurable virtues, the Buddhas’ noble insights, Will appear before them.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　眾猛尊導，　　講法如是，　　善權方便，",
        "translation": "The teaching of the Dharma is like this, skillful in expedient means.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　億百千姟，　　分別無數，　　無復想念，",
        "translation": "Hundreds of myriads of koṭis of fetters Are countless, Distinctly discriminated, Without further thought or thought:",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　其不學者，　　不能曉了。　　由是之故，",
        "translation": "Those who do not study the Dharma Will not be able to understand.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　了正真言，　　正覺出世，　　順修明哲，",
        "translation": "Understanding the true words of truth, Perfectly enlightened Ones appear in the world. Following and cultivating insight,",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "　斷諸狐疑，　　蠲除猶豫，　　能仁欣勇，",
        "translation": "Cutting off doubt and doubt, removing uncertainty, he’s benevolent and joyous.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "世尊頌曰：　咸至佛道。」",
        "translation": "The Bhagavān said in verse, They all arrived at the Buddha Way.",
        "source": "T09n0263_001:0070a03_2"
    },
    {
        "source_sentence": "正法華經卷第一",
        "translation": "True Lotus Sutra, Volume 1",
        "source": "T09n0263_001:0073a27_0"
    }
]