[
    {
        "source_sentence": "大方廣佛華嚴經卷第十三",
        "translation": "Dafangguang fo huayan jing, Volume 13",
        "source": "T09n0278_013:0478c17_0"
    },
    {
        "source_sentence": "東晉天竺三藏佛馱跋陀羅譯",
        "translation": "Translated by the Tripiṭaka Master Buddhabhadra of India in the Eastern Jin Dynasty",
        "source": "T09n0278_013:0478c19_0"
    },
    {
        "source_sentence": "◎如來昇兜率天宮一切寶殿品第十九爾時，佛威神力故，十方一切世界、諸四天下、一一閻浮提，",
        "translation": "The Tathāgata Ascending to the Palace of All Jewels in Tuṣita At that time, because of the great spiritual power of the Buddha, all worlds in the ten directions, the four continents, and each Jambudvīpa.",
        "source": "T09n0278_013:0478c20_0"
    },
    {
        "source_sentence": "皆有如來坐菩提樹，無不顯現。",
        "translation": "All of them had buddhas sitting on the tree of enlightenment, and none of them did not appear.",
        "source": "T09n0278_013:0478c22_1"
    },
    {
        "source_sentence": "彼諸菩薩承佛神力，說種種法，皆悉自謂在於佛所。",
        "translation": "Those bodhisattvas, imbued with the Buddha's miraculous powers, explained various teachings, all claiming to be in the Buddha's presence.",
        "source": "T09n0278_013:0478c23_2"
    },
    {
        "source_sentence": "爾時，如來以自在神力，不離菩提樹座及須彌頂妙勝殿，上夜摩天宮寶莊嚴殿，",
        "translation": "At that time the Buddha, by means of his independent supernatural powers, did not leave the seat of enlightenment tree or the wonderful palace at the top of the polar mountain. He ascended to the jewel-adorned hall of the celestial palace of Yama’s heavenly abode.",
        "source": "T09n0278_013:0478c24_3"
    },
    {
        "source_sentence": "趣兜率天宮一切寶莊嚴殿。",
        "translation": "He'll go to the hall of all the jewels adorning the palace of the Tuṣita Heaven.",
        "source": "T09n0278_013:0478c26_4"
    },
    {
        "source_sentence": "時，彼天王遙見佛來，即於殿上，敷如意寶藏師子之座，以種種天寶而莊嚴之。",
        "translation": "Seeing the Buddha coming from a distance, that celestial king spread out a wish-granting jeweled store lion seat in the palace and adorned it with various heavenly treasures.",
        "source": "T09n0278_013:0478c26_5"
    },
    {
        "source_sentence": "過去修習善根所得，一切如來威神護持，不可數那由他阿僧祇善根所生，",
        "translation": "They had cultivated roots of goodness in the past and were sustained by the spiritual protection of all buddhas. Innumerable thousands of myriads of koṭis of such roots of goodness produced them.",
        "source": "T09n0278_013:0478c28_6"
    },
    {
        "source_sentence": "一切諸佛淨法所起，一切眾生所共莊嚴，無量功德之所成就。",
        "translation": "All buddhas are produced by the pure teachings of all buddhas, commonly adorned by all sentient beings, accomplished by measureless virtue.",
        "source": "T09n0278_013:0479a01_7"
    },
    {
        "source_sentence": "離一切惡，清淨業報，一切樂觀，無有厭足，出離世間諸法所起，清淨無污，",
        "translation": "Being free of all evils, they are pure in the results of action. Observing all pleasures, they have no weariness or dissatisfaction. Free from worldly things that arise, they are pure and undefiled.",
        "source": "T09n0278_013:0479a02_8"
    },
    {
        "source_sentence": "一切世間因緣所起，一切眾生見不能盡。",
        "translation": "All worlds are produced by causes and conditions, and all sentient beings can't see them all.",
        "source": "T09n0278_013:0479a04_9"
    },
    {
        "source_sentence": "以無量莊嚴具而莊嚴之，所謂：百萬億欄楯，百萬億寶網羅覆其上，百萬億華帳以張其上，",
        "translation": "They were adorned with innumerable ornaments, such as a hundred trillion railings, covered with a hundred trillion jewel nets, and draped with a hundred trillion flower curtains.",
        "source": "T09n0278_013:0479a05_10"
    },
    {
        "source_sentence": "百萬億華鬘以垂四邊；",
        "translation": "A hundred trillion flower garlands hung over the four sides.",
        "source": "T09n0278_013:0479a07_11"
    },
    {
        "source_sentence": "百萬億香帳普熏十方，百萬億寶帳以張其上；",
        "translation": "A hundred trillion drapes of fragrant curtains permeated the ten directions, and a hundred trillion drapes of jeweled curtains spread over them.",
        "source": "T09n0278_013:0479a08_12"
    },
    {
        "source_sentence": "百萬億華蓋，諸天執持；",
        "translation": "A hundred trillion canopies of flowers were held by the celestial beings.",
        "source": "T09n0278_013:0479a09_13"
    },
    {
        "source_sentence": "百萬億華鬘蓋、百萬億寶蓋以蓋其上；",
        "translation": "A hundred trillion canopies of flower garlands and a hundred trillion canopies of jewels covered the top.",
        "source": "T09n0278_013:0479a09_14"
    },
    {
        "source_sentence": "百萬億寶衣以敷其上；",
        "translation": "A hundred trillion jeweled robes were spread on top of it.",
        "source": "T09n0278_013:0479a10_15"
    },
    {
        "source_sentence": "百萬億妙寶樓閣，百萬億如意寶王網羅覆其上；",
        "translation": "A hundred trillion towers of exquisite jewels and a hundred trillion wish-granting jewel king nets covered them.",
        "source": "T09n0278_013:0479a11_16"
    },
    {
        "source_sentence": "百萬億勝妙雜網，百萬億眾寶瓔珞間錯垂下；",
        "translation": "A hundred trillion webs of exquisitely mixed jewels, a hundred trillion jewelry necklaces of various jewels hung down from each other.",
        "source": "T09n0278_013:0479a12_17"
    },
    {
        "source_sentence": "百萬億眾妙雜寶，百萬億網蓋以覆其上；",
        "translation": "A hundred trillion jewels of various exquisite mixed treasures covered it with a hundred trillion nets and canopies.",
        "source": "T09n0278_013:0479a13_18"
    },
    {
        "source_sentence": "百萬億雜寶網衣，百萬億妙寶蓮華開敷光曜；",
        "translation": "A hundred trillion robes of webs of various jewels, a hundred trillion beautiful jewel lotus blossoms in full bloom shining brightly.",
        "source": "T09n0278_013:0479a14_19"
    },
    {
        "source_sentence": "百萬億無厭香網普熏十方；",
        "translation": "A hundred trillion webs of unadulterated fragrance permeated the ten directions.",
        "source": "T09n0278_013:0479a15_20"
    },
    {
        "source_sentence": "百萬億大寶帳網以覆其上；",
        "translation": "A hundred trillion great jewel curtains and nets covered it.",
        "source": "T09n0278_013:0479a16_21"
    },
    {
        "source_sentence": "百萬億寶鈴微動出和雅音；",
        "translation": "A hundred trillion jeweled bells sounded harmoniously as they slighted.",
        "source": "T09n0278_013:0479a16_22"
    },
    {
        "source_sentence": "百萬億栴檀、寶帳普熏十方；",
        "translation": "A hundred trillion myriads of koṭis of sandalwood and jeweled curtains perfumed the ten directions.",
        "source": "T09n0278_013:0479a17_23"
    },
    {
        "source_sentence": "百萬億雜寶妙華以散其上；",
        "translation": "A hundred trillion beautiful flowers of mixed jewels scattered above it.",
        "source": "T09n0278_013:0479a18_24"
    },
    {
        "source_sentence": "百萬億雜色寶衣以覆其上；",
        "translation": "A hundred trillion multicolored jewel robes covered it.",
        "source": "T09n0278_013:0479a18_25"
    },
    {
        "source_sentence": "百萬億菩薩大帳、百萬億雜寶蓋帳、百萬億清淨金帳、百萬億淨瑠璃帳、百萬億雜寶藏帳、百萬億一切寶帳，",
        "translation": "A hundred trillion great canopies of enlightening beings, a hundred trillion canopies of mixed jewels, a hundred trillion pure gold canopies, a hundred trillion pure lapis lazuli canopies, a hundred trillion canopies of mixed jewel treasury canopies, and a hundred trillion canopies of all kinds of jewel",
        "source": "T09n0278_013:0479a19_26"
    },
    {
        "source_sentence": "以覆其上；",
        "translation": "to cover the top of it.",
        "source": "T09n0278_013:0479a21_27"
    },
    {
        "source_sentence": "百萬億雜寶妙華，周匝圍遶；",
        "translation": "It was surrounded by a hundred trillion beautiful flowers of all kinds of jewels.",
        "source": "T09n0278_013:0479a22_28"
    },
    {
        "source_sentence": "百萬億寶形像帳、百萬億眾妙寶鬘、百萬億香鬘普熏十方；",
        "translation": "A hundred trillion canopies of jewel shapes and images, a hundred trillion drapes of all kinds of beautiful jewel ornaments, and a hundred trillion fragrant garlands permeated the ten directions.",
        "source": "T09n0278_013:0479a22_29"
    },
    {
        "source_sentence": "百萬億天曼陀羅栴檀色香具足，普熏十方；",
        "translation": "A hundred trillion celestial maṇḍalas, endowed with the color and fragrance of sandalwood, permeated the ten directions.",
        "source": "T09n0278_013:0479a24_30"
    },
    {
        "source_sentence": "百萬億天莊嚴具、百萬億妙寶華鬘、百萬億勝妙寶藏、百萬億勝寶藏鬘、百萬億清淨寶鬘、百萬億海寶藏鬘、百萬億因陀羅金剛妙寶、百萬億妙寶繒綵，",
        "translation": "A hundred trillion ornaments of celestial adornments, a hundred trillion garlands of exquisite jewel flowers, a hundred trillion stores of exquisite jewel treasures, a hundred trillion garlands of exquisite jewel treasuries, a hundred trillion garlands of pure jewel robes, a hundred trillion garlands of oceanic jewel treasuries, a hundred tr",
        "source": "T09n0278_013:0479a25_31"
    },
    {
        "source_sentence": "以為垂帶；",
        "translation": "He thought of it as a hanging belt.",
        "source": "T09n0278_013:0479a28_32"
    },
    {
        "source_sentence": "百萬億無量自在妙寶、百萬億真金寶藏，清淨微妙；",
        "translation": "A hundred trillion immeasurable, self-contained jewels and a hundred trillion treasure treasuries of pure gold were pure and subtle.",
        "source": "T09n0278_013:0479a28_33"
    },
    {
        "source_sentence": "百萬億毘樓那寶，以為照耀；",
        "translation": "A hundred trillion vaiḍūrya jewels were shining brightly.",
        "source": "T09n0278_013:0479b01_34"
    },
    {
        "source_sentence": "百萬億因尼羅寶雜寶校飾；",
        "translation": "A hundred trillion jewels of all kinds of jewels adorned the embellishments.",
        "source": "T09n0278_013:0479b01_35"
    },
    {
        "source_sentence": "百萬億首羅幢寶光曜明淨；",
        "translation": "A hundred trillion jeweled pennants were shining brightly and purely.",
        "source": "T09n0278_013:0479b02_36"
    },
    {
        "source_sentence": "百萬億火珠寶出大光明，普照十方；",
        "translation": "A hundred trillion jewels of fire produced great rays of light that shone everywhere in the ten directions.",
        "source": "T09n0278_013:0479b03_37"
    },
    {
        "source_sentence": "百萬億天堅固寶，以為窓牖；",
        "translation": "A hundred trillion jewels of celestial hardness were used as windows and windows.",
        "source": "T09n0278_013:0479b04_0"
    },
    {
        "source_sentence": "百萬億淨功德寶，無量妙色；",
        "translation": "A hundred trillion jewels of pure virtue, immeasurable and beautiful colors.",
        "source": "T09n0278_013:0479b04_1"
    },
    {
        "source_sentence": "百萬億雜寶偏閣，清淨妙藏；",
        "translation": "A hundred trillion partial pavilions of mixed jewels were pure and wonderful mines.",
        "source": "T09n0278_013:0479b05_2"
    },
    {
        "source_sentence": "百萬億大海月寶、百萬億離垢藏寶、百萬億心王寶，無量歡喜；",
        "translation": "A hundred trillion jewels of the moon treasure of the great ocean, a hundred trillion jewels of the undefiled treasury and a hundred trillion jewels of the king of mind were infinitely joyful.",
        "source": "T09n0278_013:0479b06_0"
    },
    {
        "source_sentence": "百萬億師子面寶、百萬億閻浮檀寶、百萬億一切世間清淨藏寶、百萬億一切世間因陀羅幢寶、百萬億羅闍藏寶、百萬億須彌山王殊勝幢寶、百萬億解脫妙寶、百萬億瑠璃鬘網，",
        "translation": "A hundred trillion jewels of the lion-face, a hundred trillion jewels of Jambudvīpa, a hundred trillion jewels of the pure treasury of all worlds, a hundred trillion jewels of the Indra-banner of all worlds, a hundred trillion jewels of the Rājagarbha treasure house, a hundred trillion jewels of",
        "source": "T09n0278_013:0479b07_1"
    },
    {
        "source_sentence": "周匝垂下；",
        "translation": "It hangs down from the perimeter all around.",
        "source": "T09n0278_013:0479b11_2"
    },
    {
        "source_sentence": "百萬億赤色寶鬘、百萬億樂摩尼寶、百萬億清淨樂寶、百萬億眾雜寶藏、百萬億赤色解脫樂見妙寶、百萬億無量色寶鬘、百萬億無比寶鬘、百萬億淨光明寶，",
        "translation": "A hundred trillion jewels of red color, a hundred trillion jewels of wish-granting jewels, a hundred trillion jewels of pure wish-granting jewels, a hundred trillion jewels of wish-granting jewels, a hundred trillion jewels of wish-granting jewels of various colors, a hundred trillion jewels of",
        "source": "T09n0278_013:0479b11_3"
    },
    {
        "source_sentence": "普照殊勝；",
        "translation": "Their universal illumination is supreme.",
        "source": "T09n0278_013:0479b15_4"
    },
    {
        "source_sentence": "百萬億摩尼寶像、百萬億因陀羅寶、百萬億黑沈水香普熏十方；",
        "translation": "A hundred trillion jewel images, a hundred trillion sapphires of Indra, and a hundred trillion incenses from the fragrance of black pouring water permeated the ten directions.",
        "source": "T09n0278_013:0479b15_5"
    },
    {
        "source_sentence": "百萬億不可思議眾雜妙香普熏十方一切佛剎；",
        "translation": "A hundred trillion inconceivable myriads of various subtle fragrances permeated all buddha-lands in the ten directions.",
        "source": "T09n0278_013:0479b17_0"
    },
    {
        "source_sentence": "百萬億十方妙香普熏世界；",
        "translation": "A hundred trillion wonderful fragrances pervaded the worlds of the ten directions.",
        "source": "T09n0278_013:0479b18_1"
    },
    {
        "source_sentence": "百萬億最殊勝香普熏十方；",
        "translation": "A hundred trillion most exquisite fragrances permeated the ten directions.",
        "source": "T09n0278_013:0479b18_2"
    },
    {
        "source_sentence": "百萬億香像香徹十方；",
        "translation": "A hundred trillion incenses, images and fragrances pervaded the ten directions.",
        "source": "T09n0278_013:0479b19_3"
    },
    {
        "source_sentence": "百萬億隨所樂香普熏十方；",
        "translation": "A hundred trillion kinds of fragrances permeated the ten directions, each according to their pleasure.",
        "source": "T09n0278_013:0479b20_0"
    },
    {
        "source_sentence": "百萬億淨光明香普熏眾生；",
        "translation": "A hundred trillion fragrances of pure light permeated sentient beings everywhere.",
        "source": "T09n0278_013:0479b20_1"
    },
    {
        "source_sentence": "百萬億種種色香普熏佛剎：不退轉香、百萬億塗香、百萬億栴檀塗香、百萬億香熏香、百萬億蓮華藏黑沈香雲充滿十方；",
        "translation": "A hundred trillion various fragrances perfumed all buddha-lands: the fragrance of nonregression, a hundred trillion coated incenses, a hundred trillion coated incenses of sandalwood, a hundred trillion fragrant fragrances, and a hundred trillion clouds of black shented incense from the store of lotus blossoms filled the ten direction",
        "source": "T09n0278_013:0479b21_2"
    },
    {
        "source_sentence": "百萬億丸香煙雲充滿十方；",
        "translation": "A hundred trillion clouds of powdered incense filled the ten directions.",
        "source": "T09n0278_013:0479b24_3"
    },
    {
        "source_sentence": "百萬億妙光明香常熏不絕；",
        "translation": "A hundred trillion fragrances of subtle light never cease to be perfumed.",
        "source": "T09n0278_013:0479b24_4"
    },
    {
        "source_sentence": "百萬億妙音聲香能轉眾心；",
        "translation": "A hundred trillion myriads of subtle sounds and fragrances could transform the minds of all beings.",
        "source": "T09n0278_013:0479b25_5"
    },
    {
        "source_sentence": "百萬億明相香普熏眾味；",
        "translation": "A hundred trillion myriads of koṭis of fragrances permeated all the flavors.",
        "source": "T09n0278_013:0479b26_6"
    },
    {
        "source_sentence": "百萬億能開悟香遠離瞋恚，寂靜諸根，充滿十方；",
        "translation": "A hundred trillion myriads of koṭis of enlightening fragrances, free from anger and hatred, filled the ten directions with tranquil faculties.",
        "source": "T09n0278_013:0479b26_7"
    },
    {
        "source_sentence": "百萬億香王香普熏十方。",
        "translation": "A hundred million billion fragrances, the king of fragrances, permeate the ten directions.",
        "source": "T09n0278_013:0479b28_0"
    },
    {
        "source_sentence": "雨百萬億天華雲雨、百萬億天香雲雨、百萬億天末香雲雨、百萬億天妙蓮華雲雨、百萬億天種種寶華雲雨、百萬億天青蓮華不斷雲雨、百萬億天寶華雲雨、百萬億天分陀利華雲雨、百萬億天曼陀羅華雲雨、百萬億天一切雜華雲雨、百萬億天種種衣雲雨、百萬億天雜寶普照十方雲雨、百萬億天種種蓋雲雨、百萬億天無量色幡雲雨、百萬億天冠雲雨、百萬億天種種莊嚴天冠雲雨、百萬億天莊嚴具雲雨、百萬億雜色天鬘雲雨、百萬億種種大莊嚴天鬘雲雨、百萬億種種色天栴檀雲雨、百萬億天沈水香雲雨，",
        "translation": "It rained a hundred trillion clouds of heavenly flowers, a hundred trillion clouds of heavenly fragrances, a hundred trillion clouds of heavenly powdered perfumes, a hundred trillion clouds of heavenly exquisite lotus blossoms, a hundred trillion clouds of various precious flowers, a hundred trillion clouds of heavenly blue lotus blossoms",
        "source": "T09n0278_013:0479b28_1"
    },
    {
        "source_sentence": "百萬億天寶幢、百萬億天雜幡、百萬億天帶垂下；",
        "translation": "A hundred trillion celestial jewel banners, a hundred trillion mixed celestial pennants, and a hundred trillion celestial belt streamers hung down.",
        "source": "T09n0278_013:0479c11_2"
    },
    {
        "source_sentence": "百萬億天和香普熏十方；",
        "translation": "A hundred trillion fragrances of celestial harmony perfumed the ten directions.",
        "source": "T09n0278_013:0479c12_3"
    },
    {
        "source_sentence": "百萬億天妙功德寶鬘垂下；",
        "translation": "Hundreds of myriads of koṭis of celestial jewels of sublime virtue descended from the sky.",
        "source": "T09n0278_013:0479c13_4"
    },
    {
        "source_sentence": "百萬億天多羅寶懸布光耀；",
        "translation": "A hundred trillion celestial jewels were draped and shining brightly.",
        "source": "T09n0278_013:0479c13_5"
    },
    {
        "source_sentence": "百萬億天拂，執持侍立；",
        "translation": "A hundred trillion celestial whisks stood there, holding and attending them.",
        "source": "T09n0278_013:0479c14_6"
    },
    {
        "source_sentence": "百萬億天金鈴網，微風吹動出妙音聲；",
        "translation": "A hundred trillion millions of celestial nets of golden bells, blown by subtle breezes, produced exquisite sounds.",
        "source": "T09n0278_013:0479c15_0"
    },
    {
        "source_sentence": "百萬億天寶欄楯周匝圍遶，百萬億天多羅寶牆周迴四遶；",
        "translation": "A hundred trillion railings of celestial jewels surrounded it, and a hundred trillion walls of celestial jewels surrounded it in all directions.",
        "source": "T09n0278_013:0479c15_1"
    },
    {
        "source_sentence": "百萬億天雜寶樹圍遶覆蔭；",
        "translation": "A hundred trillion celestial trees of various jewels surrounded it and covered its shade.",
        "source": "T09n0278_013:0479c17_2"
    },
    {
        "source_sentence": "百萬億天雜寶樓閣，莊嚴其內百萬億天勝寶門；",
        "translation": "A hundred trillion towers of celestial mixed jewels adorned a hundred trillion gates of celestial best treasures within.",
        "source": "T09n0278_013:0479c17_3"
    },
    {
        "source_sentence": "百萬億天真金鈴，微風吹動出和雅音；",
        "translation": "A hundred trillion celestial bells of pure gold sounded with gentle breezes blowing and producing harmonious sounds.",
        "source": "T09n0278_013:0479c19_4"
    },
    {
        "source_sentence": "百萬億清淨天鬘布列垂下；",
        "translation": "A hundred trillion pure celestial garlands were draped and flowed downward.",
        "source": "T09n0278_013:0479c19_5"
    },
    {
        "source_sentence": "百萬億天蘇婆提寶雜相解脫。",
        "translation": "A hundred million billion gods are liberated from the mixed characteristics of the jeweled form of Sūvatī.",
        "source": "T09n0278_013:0479c20_6"
    },
    {
        "source_sentence": "百萬億天金剛藏眾妙瓔珞、百萬億天雜寶蓋，諸天執持；",
        "translation": "A hundred trillion celestial diamond mines of all kinds of beautiful jewelry and a hundred trillion heavenly canopies of various jewels were held by the celestial beings.",
        "source": "T09n0278_013:0479c21_7"
    },
    {
        "source_sentence": "百萬億天雜寶網、百萬億天雜寶藏，光耀殊特；",
        "translation": "A hundred trillion heavenly webs of mixed jewels and a hundred trillion celestial mines of mixed jewels shone with special splendors.",
        "source": "T09n0278_013:0479c22_8"
    },
    {
        "source_sentence": "百萬億天淨光明普照十方；",
        "translation": "A hundred trillion celestial rays of pure light shone everywhere in the ten directions.",
        "source": "T09n0278_013:0479c23_9"
    },
    {
        "source_sentence": "百萬億大光普耀；",
        "translation": "A hundred trillion great rays of light shone everywhere.",
        "source": "T09n0278_013:0479c24_10"
    },
    {
        "source_sentence": "百萬億日藏光明普照一切；",
        "translation": "A hundred trillion rays of light from the sun-treasury illumined all.",
        "source": "T09n0278_013:0479c24_11"
    },
    {
        "source_sentence": "百萬億雜色月光、百萬億離癡淨香；",
        "translation": "A hundred trillion moonlights of various colors, a hundred trillion pure fragrances of freedom from delusion.",
        "source": "T09n0278_013:0479c25_12"
    },
    {
        "source_sentence": "百萬億天妙華藏開敷鮮茂；",
        "translation": "A hundred trillion celestial treasuries of exquisite flowers bloomed and flourished.",
        "source": "T09n0278_013:0479c26_13"
    },
    {
        "source_sentence": "百萬億寶網藏、百萬億華網、百萬億香網以覆其上；",
        "translation": "A hundred trillion treasuries of webs of jewels, a hundred trillion webs of flowers, and a hundred trillion webs of fragrance covered their surfaces.",
        "source": "T09n0278_013:0479c26_14"
    },
    {
        "source_sentence": "百萬億天雜寶衣以敷其上，百萬億天諸寶衣處處敷置；",
        "translation": "A hundred trillion celestial robes of various jewels were spread on top of it, and a hundred trillion celestial robes of various jewels were spread everywhere.",
        "source": "T09n0278_013:0479c28_15"
    },
    {
        "source_sentence": "百萬億天青色衣、百萬億天雜黃衣、百萬億天雜朱衣、百萬億天雜色衣、百萬億天雜寶衣、百萬億種種熏衣、百萬億殊勝寶衣，",
        "translation": "A hundred trillion celestial blue robes, a hundred trillion celestial mixed yellow robes, a hundred trillion celestial mixed red robes, a hundred trillion celestial mixed color robes, a hundred trillion celestial mixed jewel robes, a hundred trillion various perfumed robes, and a hundred trillion superior jewel robes.",
        "source": "T09n0278_013:0479c29_16"
    },
    {
        "source_sentence": "能令眾生發歡喜心，如是等衣以敷其上；",
        "translation": "They can cause sentient beings to give rise to joy, spreading such robes over them.",
        "source": "T09n0278_013:0480a03_17"
    },
    {
        "source_sentence": "百萬億白淨妙衣以覆其上；",
        "translation": "A hundred trillion white, pure, beautiful robes covered the top of their heads.",
        "source": "T09n0278_013:0480a04_18"
    },
    {
        "source_sentence": "百萬億天幢寶鈴出微妙音；",
        "translation": "A hundred trillion celestial pennants and jewel bells produced subtle sounds.",
        "source": "T09n0278_013:0480a04_19"
    },
    {
        "source_sentence": "百萬億白淨寶幢，微風吹動出妙音聲；",
        "translation": "A hundred trillion white pure jewel banners, blown by subtle breezes, produced sublime sounds.",
        "source": "T09n0278_013:0480a05_20"
    },
    {
        "source_sentence": "百萬億天繒綵幢、百萬億香幢出眾香網；",
        "translation": "A hundred trillion celestial silk banners and a hundred trillion fragrant banners emanated networks of fragrances.",
        "source": "T09n0278_013:0480a06_21"
    },
    {
        "source_sentence": "百萬億華幢雨一切華；",
        "translation": "A hundred trillion Flower Banners rained all kinds of flowers.",
        "source": "T09n0278_013:0480a07_22"
    },
    {
        "source_sentence": "百萬億天妙衣幢、百萬億摩尼寶幢、百萬億天一切莊嚴具幢、百萬億天鬘幢，",
        "translation": "A hundred trillion celestial banners of fine raiment, a hundred trillion jewel banners, a hundred trillion celestial banners of all adornments, and a hundred trillion celestial banners.",
        "source": "T09n0278_013:0480a08_0"
    },
    {
        "source_sentence": "四面行列百萬億天蓋幢。",
        "translation": "The four sides of the row are lined with a million billion celestial canopies and banners.",
        "source": "T09n0278_013:0480a09_1"
    },
    {
        "source_sentence": "一切寶鈴出妙音聲，百萬億天螺出妙音聲，百萬億天鼓出大音聲，百萬億天琴出微妙音，",
        "translation": "All the jeweled bells produced exquisite sounds, millions of celestial conches produced exquisite sounds, millions of celestial drums produced great sounds, millions of celestial lusters produced subtle sounds.",
        "source": "T09n0278_013:0480a10_2"
    },
    {
        "source_sentence": "百萬億天牟陀羅出大音聲，百萬億天娛樂具、百萬億天樂音聲充滿十方一切佛剎，",
        "translation": "A hundred trillion celestial sages produced great sounds, a hundred trillion celestial instruments and a hundred trillion celestial music sounds filling all buddha-lands in the ten directions.",
        "source": "T09n0278_013:0480a12_3"
    },
    {
        "source_sentence": "百萬億化音聲聲徹十方，眾生聞者，悉解如響。",
        "translation": "A hundred trillion sounds of myriad transformations pervade the ten directions, and when sentient beings hear them, they all understand them like echoes.",
        "source": "T09n0278_013:0480a14_4"
    },
    {
        "source_sentence": "百萬億天妓樂音同時俱作，百萬億天神力妓樂出相和音，百萬億一切諸天娛樂之具出妙音聲。",
        "translation": "A hundred trillion celestial musics played simultaneously, a hundred trillion celestial musics of divine power produced harmonious sounds, and a hundred trillion all the heavenly pleasures produced sublime sounds.",
        "source": "T09n0278_013:0480a15_5"
    },
    {
        "source_sentence": "百萬億妙音讚歎如來，百萬億勝妙喜音讚歎如來，百萬億甚深音聲讚歎如來，",
        "translation": "A hundred trillion sublime sounds praised the Buddha, a hundred trillion sublime sounds of joy praised the Buddha, and a hundred trillion profound sounds praised the Buddha.",
        "source": "T09n0278_013:0480a17_6"
    },
    {
        "source_sentence": "百萬億種種音聲歎佛果報，百萬億細微音聲稱揚、讚歎出三界法，百萬億寂靜音聲讚歎如來本所修行，",
        "translation": "A hundred trillion various sounds praised the fruits of buddhahood, a hundred trillion subtle sounds extolled and praised the teachings of the three worlds, a hundred trillion silent sounds praised the practices of the Buddha in the past.",
        "source": "T09n0278_013:0480a19_7"
    },
    {
        "source_sentence": "百萬億音讚歎如來百萬億劫永離瞋恚，讚歎百萬億供養供養過去諸佛，",
        "translation": "A hundred trillion sounds praised the enlightened for a hundred trillion eons, forever free from anger, and they praised a hundred trillion offerings to all the Buddhas of the past.",
        "source": "T09n0278_013:0480a22_8"
    },
    {
        "source_sentence": "百萬億法門讚歎如來，百萬億音讚歎一切菩薩功德不可窮盡，百萬億音讚歎菩薩一切諸地功德具足，",
        "translation": "A hundred trillion ways of teaching praised the Buddha; a hundred trillion ways of speaking praised all the virtues of enlightening beings without end; a hundred trillion ways of speaking praised enlightening beings’ excellence in all stages.",
        "source": "T09n0278_013:0480a24_9"
    },
    {
        "source_sentence": "百萬億音讚歎諸佛，無有厭足，百萬億音稱揚、讚歎見佛之行，百萬億音讚歎深法，",
        "translation": "A hundred trillion voices praised the buddhas, never tiring of them. A hundred trillion voices extolled and praised the deeds of seeing buddhas; a hundred trillion voices praised the profound Teaching.",
        "source": "T09n0278_013:0480a26_10"
    },
    {
        "source_sentence": "其聞音者，得深智慧，無有障礙。",
        "translation": "Those who hear the sound will attain profound wisdom without any hindrance.",
        "source": "T09n0278_013:0480a28_11"
    },
    {
        "source_sentence": "百萬億妙音充滿十方一切世界；",
        "translation": "A hundred trillion subtle sounds filled all worlds in the ten directions.",
        "source": "T09n0278_013:0480a29_12"
    },
    {
        "source_sentence": "百萬億妙音歎諸眾生，隨其志願，皆令歡喜；",
        "translation": "A hundred trillion wondrous sounds praised sentient beings, causing them to rejoice according to their aspirations.",
        "source": "T09n0278_013:0480b01_13"
    },
    {
        "source_sentence": "百萬億音歎一切世間，其聞音者，解一切法真實之性；",
        "translation": "A hundred trillion voices praised all worlds, and those who heard them understood the true nature of all things.",
        "source": "T09n0278_013:0480b02_14"
    },
    {
        "source_sentence": "百萬億音讚歎如來，其聞音者，悉能恭敬一切如來；",
        "translation": "A hundred trillion voices praised the Buddha, and those who heard them were able to venerate all buddhas.",
        "source": "T09n0278_013:0480b03_15"
    },
    {
        "source_sentence": "百萬億音歎佛境界一切功德；",
        "translation": "A hundred trillion voices praised all the virtues of the Buddha’s realm.",
        "source": "T09n0278_013:0480b04_16"
    },
    {
        "source_sentence": "百萬億音歎諸總持善妙方便，善知分別一切諸法，聞持一切諸如來法；",
        "translation": "A hundred trillion voices praised the good and marvelous methods of unification, knowing well all things; they heard and remembered all the teachings of buddhas.",
        "source": "T09n0278_013:0480b05_17"
    },
    {
        "source_sentence": "百萬億音讚歎甚深具足諸法。",
        "translation": "A hundred million billion sounds praise the profound and fully endowed dharmas.",
        "source": "T09n0278_013:0480b07_18"
    },
    {
        "source_sentence": "百萬億音歎發心菩薩，修習長養一切種智；",
        "translation": "A hundred trillion great enlightening beings cultivated and developed all kinds of knowledge.",
        "source": "T09n0278_013:0480b07_19"
    },
    {
        "source_sentence": "百萬億音歎治地菩薩，其心歡喜；",
        "translation": "A hundred trillion myriads of koṭis of enlightening beings in the stage of Sound Treating the Earth, their hearts rejoicing.",
        "source": "T09n0278_013:0480b08_20"
    },
    {
        "source_sentence": "百萬億音歎修行地菩薩，清淨解脫；",
        "translation": "A hundred trillion myriads of koṭis of voices praised the enlightening being in the stage of practice, pure liberation.",
        "source": "T09n0278_013:0480b09_21"
    },
    {
        "source_sentence": "百萬億音歎生貴菩薩，心得安住；",
        "translation": "A hundred trillion myriads of great enlightening beings, with voices singing in praise of sentient beings, dwelled peacefully in their minds.",
        "source": "T09n0278_013:0480b10_22"
    },
    {
        "source_sentence": "百萬億音讚歎方便具足菩薩，於摩訶衍究竟決定；",
        "translation": "A hundred myriad of koṭis of voices praised the enlightening being Endowed with Skill in Liberative Techniques, who was ultimately certain of Mahāyāna.",
        "source": "T09n0278_013:0480b11_23"
    },
    {
        "source_sentence": "百萬億音歎善現菩薩，具足一切菩薩所行；",
        "translation": "A hundred trillion myriads of koṭis of voices praised the enlightening being Beautifully Manifesting, fulfilling all the practices of enlightening beings.",
        "source": "T09n0278_013:0480b12_24"
    },
    {
        "source_sentence": "百萬億音讚歎不退菩薩，所行一切諸地皆悉清淨；",
        "translation": "A hundred trillion voices praised the nonregressing enlightening being, all the stages he practiced were pure.",
        "source": "T09n0278_013:0480b13_25"
    },
    {
        "source_sentence": "百萬億音歎童真菩薩，光明普照一切十方；",
        "translation": "A hundred trillion myriads of koṭis of enlightening beings, voices singing praises of the truth of youth, illumined all directions with their light.",
        "source": "T09n0278_013:0480b14_26"
    },
    {
        "source_sentence": "百萬億音歎王子菩薩，善入甚深不可思議諸佛境界；",
        "translation": "A hundred trillion billion sounds of praise to princes and enlightening beings entered the sphere of inconceivably profound buddhas.",
        "source": "T09n0278_013:0480b15_27"
    },
    {
        "source_sentence": "百萬億音歎灌頂菩薩，能現一切諸如來力。",
        "translation": "The millions of billions of bodhisattvas who praise the consecration can manifest the powers of all the buddhas.",
        "source": "T09n0278_013:0480b17_28"
    },
    {
        "source_sentence": "百萬億神力自在、百萬億清淨解脫，出生百萬億清淨解脫、百萬億長養大歡喜法、百萬億住不壞信、百萬億長養勇猛之力、百萬億長養名聞法；",
        "translation": "A hundred trillion myriads of pure liberations arose, a hundred trillion cultivated great joy; a hundred trillion lived in unshakable faith; a hundred trillion nurturned the power of courage; a hundred trillion nurturned fame and learning.",
        "source": "T09n0278_013:0480b18_29"
    },
    {
        "source_sentence": "百萬億分別法義，廣說定慧；",
        "translation": "A hundred trillion different meanings of doctrine were expounded, extensively expounding concentration and wisdom.",
        "source": "T09n0278_013:0480b21_30"
    },
    {
        "source_sentence": "百萬億正念清淨不亂出生百萬億定慧、百萬億陀羅尼。",
        "translation": "A hundred trillion correct thoughts that are pure and unconfused give rise to a hundred trillion concentrations, a hundred trillion wisdoms, and a hundred trillion dhāraṇīs.",
        "source": "T09n0278_013:0480b22_31"
    },
    {
        "source_sentence": "悉能受持一切佛法，出生百萬億廣大智慧；",
        "translation": "They were able to receive and uphold all the teachings of buddhahood, producing a hundred trillion great knowledges.",
        "source": "T09n0278_013:0480b23_32"
    },
    {
        "source_sentence": "出生百萬億深心，信佛信根堅固；",
        "translation": "A hundred trillion profound minds arose, their faculty of faith in the Buddha firmly planted.",
        "source": "T09n0278_013:0480b24_33"
    },
    {
        "source_sentence": "出生百萬億清淨檀波羅蜜；",
        "translation": "A hundred trillion pure transcendent ways of giving came into being.",
        "source": "T09n0278_013:0480b25_34"
    },
    {
        "source_sentence": "出生百萬億尸波羅蜜；",
        "translation": "A hundred trillion bodhisattva-teachings arose.",
        "source": "T09n0278_013:0480b26_0"
    },
    {
        "source_sentence": "出生百萬億羼提波羅蜜，不生恚心，具足諸佛羼提波羅蜜；",
        "translation": "A hundred trillion transcendent ways of enlightening beings arose, without anger or hatred, fulfilling the transcendent ways of enlightening beings.",
        "source": "T09n0278_013:0480b26_1"
    },
    {
        "source_sentence": "出生百萬億毘梨耶波羅蜜，究竟具足無量毘梨耶波羅蜜；",
        "translation": "A hundred trillion vīrya-pāramitās arose, ultimately endowed with measureless vīrya-pāramitā.",
        "source": "T09n0278_013:0480b27_2"
    },
    {
        "source_sentence": "出生百萬億禪波羅蜜，無量諸禪寂靜照明；",
        "translation": "A hundred trillion transcendent ways of meditation arose, illuminating the tranquility and quiescence of infinite meditations.",
        "source": "T09n0278_013:0480b29_3"
    },
    {
        "source_sentence": "出生百萬億般若波羅蜜，照一切法；",
        "translation": "A hundred trillion perfections of wisdom arose, illumining all things.",
        "source": "T09n0278_013:0480c01_4"
    },
    {
        "source_sentence": "出生百萬億清淨大願；",
        "translation": "A hundred trillion pure great vows arose.",
        "source": "T09n0278_013:0480c02_5"
    },
    {
        "source_sentence": "出生百萬億諸深法門智慧燈明；",
        "translation": "A hundred trillion lamps of knowledge and wisdom of the profound teachings arose.",
        "source": "T09n0278_013:0480c02_6"
    },
    {
        "source_sentence": "出生十方諸佛百萬億深妙法門；",
        "translation": "A hundred trillion profound and wondrous teachings of the buddhas of the ten directions arose.",
        "source": "T09n0278_013:0480c03_7"
    },
    {
        "source_sentence": "出生百萬億離癡，示現善妙方便；",
        "translation": "A hundred trillion states of freedom from delusion arose, manifesting good and subtle techniques.",
        "source": "T09n0278_013:0480c04_8"
    },
    {
        "source_sentence": "出生百萬億諸法之行，普入百萬億諸佛之剎，百萬億清淨法身往詣十方一切佛剎；",
        "translation": "A hundred trillion practices of teachings arose, entered into a hundred trillion buddha-lands, and a hundred trillion pure reality bodies went to all buddha-lands in the ten directions.",
        "source": "T09n0278_013:0480c04_9"
    },
    {
        "source_sentence": "出生百萬億如來微妙音聲；",
        "translation": "A hundred trillion subtle sounds of buddhas emerged.",
        "source": "T09n0278_013:0480c06_10"
    },
    {
        "source_sentence": "出生百萬億一切種智善妙方便；",
        "translation": "A hundred trillion myriads of all kinds of knowledge and good and subtle techniques arose.",
        "source": "T09n0278_013:0480c07_11"
    },
    {
        "source_sentence": "出生百萬億具足法門；",
        "translation": "A hundred trillion aspects of the Teaching of Enlightenment were produced.",
        "source": "T09n0278_013:0480c08_12"
    },
    {
        "source_sentence": "出生百萬億正法知見，悉見一切諸佛實法，猶如寶幢；",
        "translation": "A hundred trillion knowledges and visions of the true teaching arose, seeing all the buddhas’ true teachings as if they were jeweled banners.",
        "source": "T09n0278_013:0480c08_13"
    },
    {
        "source_sentence": "出生百萬億智慧，示現如來境界，無所障礙。",
        "translation": "A hundred trillion knowledges arose, revealing the realm of enlightenment without obstruction.",
        "source": "T09n0278_013:0480c10_14"
    },
    {
        "source_sentence": "百萬億諸天神王恭敬禮拜；",
        "translation": "A hundred trillion celestial kings honored and venerated him.",
        "source": "T09n0278_013:0480c11_15"
    },
    {
        "source_sentence": "百萬億龍王一心諦觀而無厭足；",
        "translation": "A hundred trillion great dragon kings observed with one mind, never getting tired of it.",
        "source": "T09n0278_013:0480c11_16"
    },
    {
        "source_sentence": "百萬億夜叉王合掌敬立；",
        "translation": "A hundred trillion great yaksha kings stood with joined palms in reverence.",
        "source": "T09n0278_013:0480c12_17"
    },
    {
        "source_sentence": "百萬億乾闥婆王一心恭敬，目不暫捨；",
        "translation": "Hundreds of myriads of koṭis of gandharva kings paid their respects with one-pointed veneration and did not for a moment turn away from them.",
        "source": "T09n0278_013:0480c13_18"
    },
    {
        "source_sentence": "百萬億阿修羅王斷除憍慢，敬心侍立；",
        "translation": "Hundreds of myriads of koṭis of great asura kings were freed from their arrogance and stood there in reverence.",
        "source": "T09n0278_013:0480c13_19"
    },
    {
        "source_sentence": "百萬億寶金翅鳥王口銜繒帶；",
        "translation": "A hundred trillion jeweled-winged garuḍa kings uttered the sound of their voices carrying sashbands.",
        "source": "T09n0278_013:0480c14_20"
    },
    {
        "source_sentence": "百萬億緊那羅王歡喜立侍；",
        "translation": "Hundreds of trillions of kings of the kinnaras joyfully stood there to attend them.",
        "source": "T09n0278_013:0480c15_21"
    },
    {
        "source_sentence": "百萬億摩睺羅王踊躍歡喜，一心諦觀；",
        "translation": "Hundreds of trillions of myriads of koṭis of mātṛkā kings jumped and rejoiced, observing with one unified mind.",
        "source": "T09n0278_013:0480c16_22"
    },
    {
        "source_sentence": "百萬億婆羅門王恭敬禮拜；",
        "translation": "A hundred trillion brahman kings honored and venerated him.",
        "source": "T09n0278_013:0480c17_23"
    },
    {
        "source_sentence": "百萬億一切世間諸王恭敬頂禮；",
        "translation": "Hundreds of trillions of myriads of koṭis of all the worldly kings bowed respectfully.",
        "source": "T09n0278_013:0480c17_24"
    },
    {
        "source_sentence": "百萬億諸釋天王恭敬尊重，一心觀察；",
        "translation": "Hundreds of myriads of koṭis of śakra celestial kings respected and venerated him, observing him with one-pointed concentration.",
        "source": "T09n0278_013:0480c18_25"
    },
    {
        "source_sentence": "百萬億夜摩天王踊躍歡喜，高聲讚歎；",
        "translation": "Hundreds of millions of myriads of koṭis of celestial kings of the realm of night blazed and rejoiced, shouting in praise.",
        "source": "T09n0278_013:0480c19_26"
    },
    {
        "source_sentence": "百萬億兜率陀天王恭敬禮拜；",
        "translation": "A hundred trillion celestial kings of the Tushita heaven honored and venerated him.",
        "source": "T09n0278_013:0480c20_27"
    },
    {
        "source_sentence": "百萬億化樂天王恭敬讚歎；",
        "translation": "A hundred trillion celestial kings of the Nirmāṇaratideva heaven revered and praised him.",
        "source": "T09n0278_013:0480c21_0"
    },
    {
        "source_sentence": "百萬億他化自在天王合掌恭敬，一心侍立；",
        "translation": "Hundreds of myriads of koṭis of other apparitional celestial kings joined their palms in respect and stood with one-pointed attention.",
        "source": "T09n0278_013:0480c21_1"
    },
    {
        "source_sentence": "百萬億梵天王一心觀察；",
        "translation": "Hundreds of myriads of koṭis of Brahma heavenly kings observed it with one mind.",
        "source": "T09n0278_013:0480c22_2"
    },
    {
        "source_sentence": "百萬億摩醯首羅天王恭敬讚歎；",
        "translation": "A hundred trillion celestial kings of the Mahesvara heavens honored and praised him.",
        "source": "T09n0278_013:0480c23_3"
    },
    {
        "source_sentence": "百萬億菩薩恭敬讚歎；",
        "translation": "A hundred trillion enlightening beings honored and praised him.",
        "source": "T09n0278_013:0480c24_0"
    },
    {
        "source_sentence": "百萬億天女恭敬供養；",
        "translation": "A hundred trillion celestial maidens honored and offered support to him.",
        "source": "T09n0278_013:0480c24_1"
    },
    {
        "source_sentence": "百萬億願天敬心頂禮；",
        "translation": "Hundreds of trillions of myriads of koṭis of wish-granting celestial beings bowed respectfully.",
        "source": "T09n0278_013:0480c25_2"
    },
    {
        "source_sentence": "百萬億宿命親近善知識天，妙聲讚歎；",
        "translation": "Hundreds of trillions of myriads of koṭis of sentient beings in the past were drawn to the celestial realm of spiritual benefactors and praised with sublime voices.",
        "source": "T09n0278_013:0480c25_3"
    },
    {
        "source_sentence": "百萬億梵身天布身敬禮；",
        "translation": "Hundreds of trillions of myriads of koṭis of Brahmakāyika deities spread their bodies and venerated him.",
        "source": "T09n0278_013:0480c26_4"
    },
    {
        "source_sentence": "百萬億梵輔天恭敬頂禮；",
        "translation": "Hundreds of trillions of myriads of koṭis of Brahmā ministers bowed in reverence.",
        "source": "T09n0278_013:0480c27_5"
    },
    {
        "source_sentence": "百萬億梵眷屬天圍遶侍衛；",
        "translation": "Hundreds of trillions of myriads of koṭis of Brahmā attendants surrounded me.",
        "source": "T09n0278_013:0480c27_6"
    },
    {
        "source_sentence": "百萬億大梵王讚歎稱揚無量功德；",
        "translation": "A hundred trillion great Brahma kings praised and extolled immeasurable virtues.",
        "source": "T09n0278_013:0480c28_7"
    },
    {
        "source_sentence": "百萬億光天五體投地；",
        "translation": "Hundreds of myriads of koṭis of rays of light fell to the ground in five bodies.",
        "source": "T09n0278_013:0480c29_8"
    },
    {
        "source_sentence": "百萬億少光天宣揚、讚歎佛世難值；",
        "translation": "A hundred trillion myriads of koṭis of rare rays of light were proclaimed and praised by the celestial beings.",
        "source": "T09n0278_013:0480c29_9"
    },
    {
        "source_sentence": "百萬億無量光天讚歎禮拜；",
        "translation": "Hundreds of myriads of koṭis of bodhisattvas were praised and venerated by the gods of Immeasurable Light.",
        "source": "T09n0278_013:0481a01_10"
    },
    {
        "source_sentence": "百萬億光音天讚歎如來難遇、難見；",
        "translation": "A hundred trillion myriads of koṭis of Ābhāsvara celestial beings praised the buddhas as rare and difficult to meet.",
        "source": "T09n0278_013:0481a02_11"
    },
    {
        "source_sentence": "百萬億淨天恭敬禮拜；",
        "translation": "A hundred trillion pure celestial beings honored and venerated him.",
        "source": "T09n0278_013:0481a03_12"
    },
    {
        "source_sentence": "百萬億少淨天恭敬禮拜；",
        "translation": "Hundreds of trillions of myriads of koṭis of lesser pure deities honored and venerated him.",
        "source": "T09n0278_013:0481a03_13"
    },
    {
        "source_sentence": "百萬億無量淨天樂見佛故，於虛空中，自投來下；",
        "translation": "Hundreds of myriads of koṭis of immeasurable pure celestial beings, delighted to see the Buddha, rose up into the sky and came down.",
        "source": "T09n0278_013:0481a04_14"
    },
    {
        "source_sentence": "百萬億遍淨天合掌敬住；",
        "translation": "A hundred trillion universally pure celestial beings stood with joined palms in reverence.",
        "source": "T09n0278_013:0481a05_15"
    },
    {
        "source_sentence": "百萬億密身天憶本功德，稱揚讚歎；",
        "translation": "A hundred trillion celestial beings of the mysterious body, remembering their past virtues, extolled and praised them.",
        "source": "T09n0278_013:0481a06_16"
    },
    {
        "source_sentence": "百萬億少密身天生如來想，一心求見；",
        "translation": "A hundred trillion celestial beings of small mysterious bodies conceived the ideation of buddhahood, singlemindedly seeking to see.",
        "source": "T09n0278_013:0481a06_17"
    },
    {
        "source_sentence": "百萬億無量密身天清淨善業，恭敬禮拜；",
        "translation": "A hundred trillion great and immeasurable celestial beings of the mysterious body, pure and virtuous in all good deeds, honored and venerated him.",
        "source": "T09n0278_013:0481a07_18"
    },
    {
        "source_sentence": "百萬億密果天布身敬禮，百萬億無煩天得堅固信，恭敬禮拜；",
        "translation": "Hundreds of trillions of myriadstical celestial beings spread out their bodies and venerated him. Hundreds of trillions of non troubled celestial beings gained firm faith and reverently worshipped him.",
        "source": "T09n0278_013:0481a08_19"
    },
    {
        "source_sentence": "百萬億無熱天合掌觀察，心無厭足；",
        "translation": "Hundreds of myriads of koṭis of bodhisattvas in the Heaven of No Heat joined their palms and looked around, never getting tired of it.",
        "source": "T09n0278_013:0481a10_20"
    },
    {
        "source_sentence": "百萬億善現天恭敬禮拜；",
        "translation": "Hundreds of myriads of koṭis of celestial beings in the Sudarśana heaven venerated and worshiped him.",
        "source": "T09n0278_013:0481a11_21"
    },
    {
        "source_sentence": "百萬億善見天憶念無量佛所，恭敬供養，心無厭足；",
        "translation": "Hundreds of myriads of koṭis of celestial beings of the Sudarśana heaven remembered the places where innumerable buddhas had been enshrined, venerating and honoring them without wearying their hearts.",
        "source": "T09n0278_013:0481a11_22"
    },
    {
        "source_sentence": "百萬億阿迦尼吒天恭敬禮拜；",
        "translation": "Hundreds of trillions of myriads of koṭis of Akaniṣṭhas venerated him with reverence.",
        "source": "T09n0278_013:0481a12_23"
    },
    {
        "source_sentence": "百萬億種種天皆大歡喜，恭敬讚歎；",
        "translation": "Hundreds of myriads of koṭis of various celestial beings all greatly rejoiced, respected and praised.",
        "source": "T09n0278_013:0481a13_24"
    },
    {
        "source_sentence": "百萬億諸天以種種善慧而莊嚴之◎；",
        "translation": "A hundred trillion celestial beings adorned them with various kinds of good wisdom.",
        "source": "T09n0278_013:0481a14_25"
    },
    {
        "source_sentence": "◎百萬億諸大菩薩頂戴護持；",
        "translation": "A hundred trillion great enlightening beings stood on the top of their heads to protect them.",
        "source": "T09n0278_013:0481a16_0"
    },
    {
        "source_sentence": "百萬億華手菩薩雨一切華；",
        "translation": "Hundreds of trillions of myriads of koṭis of flower-handed enlightening beings showered all kinds of flowers.",
        "source": "T09n0278_013:0481a16_1"
    },
    {
        "source_sentence": "百萬億香手菩薩雨一切香；",
        "translation": "A hundred trillion myriad of fragrant hand enlightening beings showered all kinds of fragrances.",
        "source": "T09n0278_013:0481a17_2"
    },
    {
        "source_sentence": "百萬億鬘手菩薩雨一切鬘；",
        "translation": "A hundred trillion hand-holding enlightening beings showered rain on all the garlands.",
        "source": "T09n0278_013:0481a18_3"
    },
    {
        "source_sentence": "百萬億末香手菩薩雨一切末香；",
        "translation": "A hundred trillion enlightening beings showered all kinds of powdered incense to the enlightening being.",
        "source": "T09n0278_013:0481a18_4"
    },
    {
        "source_sentence": "百萬億衣手菩薩雨一切寶衣；",
        "translation": "A hundred trillion billion hand-clad enlightening beings showered rain of all precious robes.",
        "source": "T09n0278_013:0481a19_5"
    },
    {
        "source_sentence": "百萬億幢手菩薩雨一切幢；",
        "translation": "Hundreds of trillions of myriads of koṭis of banners rained all the banners by the hand of enlightening beings.",
        "source": "T09n0278_013:0481a20_6"
    },
    {
        "source_sentence": "百萬億幡手菩薩雨一切幡；",
        "translation": "Hundreds of trillions of myriads of koṭis of pennants rained all the pennants from the enlightening being Universally Good.",
        "source": "T09n0278_013:0481a20_7"
    },
    {
        "source_sentence": "百萬億寶手菩薩雨一切寶；",
        "translation": "A hundred trillion jeweled-handed enlightening beings showered all the treasures.",
        "source": "T09n0278_013:0481a21_8"
    },
    {
        "source_sentence": "百萬億莊嚴手菩薩普雨一切諸莊嚴具；",
        "translation": "A hundred trillion hand-adorned enlightening beings showered rain on all the adornments.",
        "source": "T09n0278_013:0481a22_9"
    },
    {
        "source_sentence": "百萬億諸天以天種種莊嚴宮殿而以莊嚴；",
        "translation": "Hundreds of myriads of koṭis of celestial beings adorned their palaces with various ornaments from heaven.",
        "source": "T09n0278_013:0481a23_10"
    },
    {
        "source_sentence": "歡喜天子以百萬億諸天莊嚴宮殿而莊嚴之；",
        "translation": "The celestial being Joy adorned it with a hundred trillion heavenly arrays of palaces.",
        "source": "T09n0278_013:0481a24_11"
    },
    {
        "source_sentence": "百萬億生貴天子法身普覆；",
        "translation": "A hundred trillion noble celestial beings were born, the Dharma body of which was universally covered.",
        "source": "T09n0278_013:0481a25_12"
    },
    {
        "source_sentence": "百萬億灌頂天子舉身持座，出生百萬億菩薩清淨大願，出生百萬億菩薩初清淨心，",
        "translation": "A hundred trillion consecrated celestial beings raised their bodies and held their seats, produced a hundred trillion pure great vows of enlightening beings, and produced a hundred trillion pure minds of enlightening beings.",
        "source": "T09n0278_013:0481a25_13"
    },
    {
        "source_sentence": "出生菩薩百萬億柔軟利根，百萬億禪藏皆悉清淨；",
        "translation": "Producing enlightening beings with millions of myriads of koṭis of soft and sharp faculties were purified by millions of myriads of koṭis of stores of meditation.",
        "source": "T09n0278_013:0481a27_14"
    },
    {
        "source_sentence": "菩薩百萬億清淨解脫，嚴治菩薩百萬億諸清淨業，出生菩薩百萬億安住生貴地，",
        "translation": "A hundred trillion pure liberations of enlightening beings, purifying a hundred trillion pure deeds of enlightening beings, producing a hundred trillion peaceful abodes of enlightening beings, were born in the noble land.",
        "source": "T09n0278_013:0481a29_15"
    },
    {
        "source_sentence": "出生菩薩百萬億法門，普照一切，成就百萬億菩薩諸地，教化調伏百萬億大眾，",
        "translation": "A hundred trillion dharmas of enlightening beings were born, illumining all. They perfected a hundred trillion bodhisattva stages and taught and disciplined a hundred trillion masses.",
        "source": "T09n0278_013:0481b01_16"
    },
    {
        "source_sentence": "百萬億諸善根所起、百萬億諸佛護持、百萬億功德所成、百萬億直心莊嚴清淨、百萬億大願莊嚴清淨、百萬億善行所起、百萬億諸法充滿、百萬億自在神力之所成就，",
        "translation": "A hundred trillion roots of goodness are produced, a hundred trillion buddhas protect them, a hundred trillion virtues are cultivated, a hundred trillion adornments of pure minds are purified, a hundred trillion adornments of great vows are purified, a hundred trillion good deeds are produced, a hundred trillion dharmas are fulfilled, and a hundred tr",
        "source": "T09n0278_013:0481b03_17"
    },
    {
        "source_sentence": "百萬億諸功德所起，以百萬億讚法而讚歎之。",
        "translation": "A hundred trillion merits arise, and they are praised with a hundred trillion ways to praise the Dharma.",
        "source": "T09n0278_013:0481b07_18"
    },
    {
        "source_sentence": "如此世界、四天下、兜率陀天宮、一切寶莊嚴殿為如來敷摩尼寶藏師子之座；",
        "translation": "In this world, in the four continents, in the celestial palaces of the Tushita heavens, and in the halls adorned with all kinds of jewels, he sat on a lion seat made of precious diamond treasure mine for the Buddha.",
        "source": "T09n0278_013:0481b08_19"
    },
    {
        "source_sentence": "十方一切諸佛世界、諸四天下、兜率陀天宮、一切寶莊嚴殿為如來敷摩尼寶藏師子之座亦復如是。",
        "translation": "So it is with all the buddha worlds in the ten directions, the four continents, the palaces of the Tuṣita gods, and the halls adorned with all jewels that provide lion seats for the Tathāgata's maṇi-jeweled treasure treasury.",
        "source": "T09n0278_013:0481b10_20"
    },
    {
        "source_sentence": "爾時，兜率陀天王為如來敷高座竟，與不可計阿僧祇兜率陀天子俱，奉迎如來，",
        "translation": "At that time, when the celestial king Tuṣita had prepared a high seat for the Buddha, accompanied by innumerable thousands of myriadstical celestial beings, he greeted the Buddha.",
        "source": "T09n0278_013:0481b13_0"
    },
    {
        "source_sentence": "雨阿僧祇色，上妙諸華，供養如來；",
        "translation": "They showered rain of incalculable colors and supremely beautiful flowers to honor the Buddha.",
        "source": "T09n0278_013:0481b14_1"
    },
    {
        "source_sentence": "雨不可思議香，雨無量色鬘，雨上妙栴檀，雨無量種種寶蓋，雨細妙天衣，",
        "translation": "It rained inconceivable fragrances, infinite colors and forms, sublime sandalwood, infinite various kinds of precious canopies, and exquisitely fine celestial raiment.",
        "source": "T09n0278_013:0481b15_2"
    },
    {
        "source_sentence": "雨無量雜寶，供養如來；",
        "translation": "They showered innumerable various treasures as offerings to the Buddha.",
        "source": "T09n0278_013:0481b17_3"
    },
    {
        "source_sentence": "以歡喜心，雨天上妙諸莊嚴具；",
        "translation": "With joy, they showered heavenly adornments of great splendor.",
        "source": "T09n0278_013:0481b18_0"
    },
    {
        "source_sentence": "燒種種香，香氣普熏十方世界；",
        "translation": "They burned various kinds of incense, the fragrance pervading all worlds in the ten directions.",
        "source": "T09n0278_013:0481b18_1"
    },
    {
        "source_sentence": "雨栴檀末香、沈水末香、堅固末香供養如來。",
        "translation": "It rained sandalwood powder, sunken water powder, and firmness powder to make offerings to the Tathāgata.",
        "source": "T09n0278_013:0481b19_2"
    },
    {
        "source_sentence": "無量天子各從其身出無量無數諸天子身；",
        "translation": "Innumerable celestial beings each emerged from their bodies innumerable numbers of celestial beings’ bodies.",
        "source": "T09n0278_013:0481b20_3"
    },
    {
        "source_sentence": "阿僧祇兜率陀天子及他方來諸天子眾皆大歡喜，恭敬作禮；",
        "translation": "Incalculable numbers of the celestial beings in Tuṣita Heaven and other heavenly beings from other directions all rejoiced greatly and venerated and bowed respectfully.",
        "source": "T09n0278_013:0481b21_4"
    },
    {
        "source_sentence": "阿僧祇天女眾歡喜無量，一心寂然諦觀如來；",
        "translation": "The assembly of incalculable celestial maidens was infinitely joyful, singlemindedly contemplating the Enlightened One calmly and quietly.",
        "source": "T09n0278_013:0481b23_0"
    },
    {
        "source_sentence": "不可數、不可說諸大菩薩悉從他方兜率天來，住於虛空，以不可思議諸供養具供養如來，",
        "translation": "Countless and ineffable great enlightening beings all came from other directions to the heaven of satisfaction, dwelling in space, honoring the Buddha with inconceivable offerings.",
        "source": "T09n0278_013:0481b24_1"
    },
    {
        "source_sentence": "出過一切諸天供養，以阿僧祇勝妙音聲讚歎如來佛神力故、過去諸佛所修善根故、如來不可思議自在神力故。",
        "translation": "It surpasses all the offerings of all the gods because it praises the Tathāgata's miraculous powers with an incalculable number of wonderful sounds, cultivates the good roots cultivated by past buddhas, and has the unfathomable miraculous powers of the Tathāgata.",
        "source": "T09n0278_013:0481b26_2"
    },
    {
        "source_sentence": "一切兜率陀天子及諸天女一心恭敬，靜默觀佛，咸作是念：「如來出世，",
        "translation": "All the deities in Tuṣita Heaven and other heavenly maidens paid their respects to the Buddha by remaining silent, contemplating him. They all thought:",
        "source": "T09n0278_013:0481b28_3"
    },
    {
        "source_sentence": "甚難值遇，功德具足，智慧無礙，平等正覺，我今得見。」",
        "translation": "It's very difficult to meet, replete with virtue, unhindered by wisdom, and equally enlightened, so now I've been able to see it.",
        "source": "T09n0278_013:0481c01_4"
    },
    {
        "source_sentence": "作是念已，皆大歡喜。",
        "translation": "Having thought thus, they all rejoiced greatly.",
        "source": "T09n0278_013:0481c02_5"
    },
    {
        "source_sentence": "阿僧祇那由他兜率陀天子來詣佛所，各以身上天衣盛種種寶，又以身上天衣盛種種香、一切寶衣、諸莊嚴具：栴檀末香、沈水末香、天妙寶末、諸天香華、天曼陀羅華普散十方，",
        "translation": "The celestial beings of the incalculable number of yojanas came to the Buddha, each wearing celestial garments made of heavenly cloths and covered with various jewels. They also wore celestial garments filled with various fragrances, all kinds of precious robes, and various adornments, such as sandalwood powder, soaking water powder,",
        "source": "T09n0278_013:0481c03_6"
    },
    {
        "source_sentence": "供養如來。",
        "translation": "They make offerings to the Tathāgata.",
        "source": "T09n0278_013:0481c07_7"
    },
    {
        "source_sentence": "億那由他無數天子以種種上妙供具，莊嚴虛空；",
        "translation": "Countless millions of celestial beings adorned the sky with various kinds of exquisite offerings.",
        "source": "T09n0278_013:0481c07_8"
    },
    {
        "source_sentence": "燒眾名香，香氣成雲，充滿十方、一切虛空，智境界心故；",
        "translation": "It burns a great fragrance called “incense” whose odor is cloudlike and fills all space in the ten directions, because of its sphere of knowledge.",
        "source": "T09n0278_013:0481c08_9"
    },
    {
        "source_sentence": "雨天華雲，莊嚴虛空，於如來所起歡喜心故；",
        "translation": "It rained clouds of celestial flowers, adorning the sky because they became joyful at the presence of the Buddha.",
        "source": "T09n0278_013:0481c10_0"
    },
    {
        "source_sentence": "雨一切天蓋雲，莊嚴虛空，充滿十方，得敬佛心故；",
        "translation": "It showered clouds of all kinds of celestial canopies, adorning the sky and filling the ten directions, because they honored the Buddha’s mind.",
        "source": "T09n0278_013:0481c11_1"
    },
    {
        "source_sentence": "雨一切天鬘雲，莊嚴虛空，充滿十方，供養佛故；",
        "translation": "It showered clouds of all kinds of celestial garlands, adorning the sky, filling the ten directions to honor buddhas.",
        "source": "T09n0278_013:0481c12_2"
    },
    {
        "source_sentence": "以阿僧祇白淨寶網遍滿虛空以為莊嚴，懸眾金鈴而間錯之，自然微動出妙音聲，",
        "translation": "They are adorned with countless white nets of pure jewels filling the sky, interspersed with golden bells hanging from them, producing exquisite sounds as they naturally whirl.",
        "source": "T09n0278_013:0481c13_3"
    },
    {
        "source_sentence": "悟三乘者，令得解脫；",
        "translation": "Those who awaken to the teachings of the three vehicles I lead to liberation.",
        "source": "T09n0278_013:0481c15_4"
    },
    {
        "source_sentence": "無數寶帳莊嚴虛空，彌覆十方，於如來所得深信故；",
        "translation": "Countless jeweled drapes adorned the sky, covering all quarters, because they had deep faith in the enlightened ones.",
        "source": "T09n0278_013:0481c15_5"
    },
    {
        "source_sentence": "普雨一切妙寶鬘雲，未曾斷絕。",
        "translation": "It rained all kinds of clouds of exquisite jewel ornaments without cease.",
        "source": "T09n0278_013:0481c17_6"
    },
    {
        "source_sentence": "以阿僧祇諸天宮殿莊嚴虛空，一切天樂出微妙音，充滿十方，至心踊悅，",
        "translation": "The sky was adorned with innumerable celestial palaces, and all the celestial music produced subtle sounds filling the ten directions.",
        "source": "T09n0278_013:0481c17_7"
    },
    {
        "source_sentence": "尊敬佛故；",
        "translation": "Because they revere buddhas.",
        "source": "T09n0278_013:0481c19_8"
    },
    {
        "source_sentence": "以阿僧祇種種妙衣莊嚴虛空，得佛出世，難遇心故；",
        "translation": "They adorned space with countless kinds of exquisite raiment, attained buddhas appearing in the world because it is difficult to meet their minds.",
        "source": "T09n0278_013:0481c19_9"
    },
    {
        "source_sentence": "雨阿僧祇諸天寶冠，莊嚴虛空，於如來所得欣敬心故；",
        "translation": "They showered incalculable clouds of celestial jewel crowns, adorning the sky because they delighted and respected the enlightened ones.",
        "source": "T09n0278_013:0481c21_10"
    },
    {
        "source_sentence": "雨阿僧祇上妙眾寶及天寶鬘莊嚴虛空，無數億那由他天子各從身出阿僧祇種種色華，",
        "translation": "Countless millions of celestial beings each produced countless kinds of flowers of various colors from their bodies.",
        "source": "T09n0278_013:0481c22_11"
    },
    {
        "source_sentence": "供養如來無有窮盡，於如來所歡喜恭敬故；",
        "translation": "Their offerings to buddhas have no end, because they are joyful and honored by buddhas.",
        "source": "T09n0278_013:0481c24_12"
    },
    {
        "source_sentence": "以無數種種隨所樂香供養如來，於如來所歡喜恭敬故；",
        "translation": "Countless kinds of incense were offered to the Buddha as offerings, according to his wishes, because they delighted in and honored him.",
        "source": "T09n0278_013:0481c25_13"
    },
    {
        "source_sentence": "以阿僧祇栴檀末香供養如來，於如來所得無比歡喜故；",
        "translation": "They honored the Buddha with innumerable offerings of sandalwood powder, because they were unparalleledly joyful at what they had attained.",
        "source": "T09n0278_013:0481c27_0"
    },
    {
        "source_sentence": "以種種寶蓋供養如來，長養念佛三昧故；",
        "translation": "They honored the Buddha with various kinds of jeweled canopies, nurturing concentration in recollection of buddhas.",
        "source": "T09n0278_013:0481c28_1"
    },
    {
        "source_sentence": "以無數種種上妙寶衣以布道路，供養如來，於如來所得歡喜恭敬故；",
        "translation": "They offered innumerable various kinds of exquisite jeweled robes to the Buddha and spread them on the roads, honoring him because they rejoiced over the joy and respect they received from him.",
        "source": "T09n0278_013:0481c29_2"
    },
    {
        "source_sentence": "以無量無數雜色寶幢供養如來，於如來所得無量歡喜心故；",
        "translation": "They honored the Buddha by means of countless, immeasurable banners of jewels of various colors, because they had attained an immeasurable heart of joy over the enlightenment.",
        "source": "T09n0278_013:0482a02_3"
    },
    {
        "source_sentence": "以阿僧祇雜色寶幡供養如來，於如來所得歡喜恭敬故；",
        "translation": "They honored the Buddha by means of countless multicolored jewel pennants, because they rejoiced in the joy and respect they received from him.",
        "source": "T09n0278_013:0482a03_4"
    },
    {
        "source_sentence": "以無數天樂出微妙音供養如來，其心常定，未曾散亂。",
        "translation": "With countless celestial music they produced subtle sounds to honor the Buddha. Their minds were always concentrated, never distracted.",
        "source": "T09n0278_013:0482a05_0"
    },
    {
        "source_sentence": "不可說億那由他菩薩於兜率陀天宮，以離三界一切供具，從真實法生離諸煩惱大慈之心，",
        "translation": "“Many hundreds of millions of enlightening beings at the celestial palace of the Tushita heaven, free from all offerings in the three worlds, give rise to great compassion free of afflictions and liberated from affliction by means of truth.",
        "source": "T09n0278_013:0482a06_1"
    },
    {
        "source_sentence": "充滿十方無有障礙，具足方便諸甚深法，唯有諸佛乃能測量，餘無能及；",
        "translation": "They fill the ten directions without obstruction and are endowed with profound teachings of skillful means. Only buddhas can survey them, and no others can do so.",
        "source": "T09n0278_013:0482a08_2"
    },
    {
        "source_sentence": "堅固淨信之所長養，不可思議善根所生，無數變化因力所起，從諸如來真法化生無行法印。",
        "translation": "It's nurtured by firm pure faith, produced by the inconceivable good roots, produced by the causes and power of countless transformations, and produced from the true teachings of the Tathāgatas that are transformed into practiceless Dharma mudrās.",
        "source": "T09n0278_013:0482a10_3"
    },
    {
        "source_sentence": "一切寶蓋普覆法界，供養如來，出過諸天一切所供；",
        "translation": "All the canopies of myriad jewels covered the cosmos, honoring buddhas as offerings to them, surpassing all the offerings of celestial beings.",
        "source": "T09n0278_013:0482a12_4"
    },
    {
        "source_sentence": "一切波羅蜜所起一切華帳普覆法界，出過諸天所供養上，供養如來，清淨解脫，",
        "translation": "All the flower drapes produced by all the transcendent ways cover the cosmos of reality, surpassing those offered by heavenly beings and honoring buddhas.",
        "source": "T09n0278_013:0482a13_5"
    },
    {
        "source_sentence": "充滿一切諸佛境界；",
        "translation": "They fill the spheres of all buddhas.",
        "source": "T09n0278_013:0482a15_6"
    },
    {
        "source_sentence": "一切寶衣普覆莊嚴一切法界，出過諸天所供養上，供養如來；",
        "translation": "All their jeweled robes covered the entire cosmos, adorning all realms of reality. They surpassed those offered by celestial beings and honored buddhas.",
        "source": "T09n0278_013:0482a16_7"
    },
    {
        "source_sentence": "無生法忍所起雜寶鈴網普覆莊嚴一切法界，出過諸天所供養上，供養如來，",
        "translation": "The network of myriad jewel bells produced by the tolerance of the truth of nonorigination adorned all universes, surpassing those offered by celestial beings and honoring buddhas.",
        "source": "T09n0278_013:0482a17_8"
    },
    {
        "source_sentence": "入無礙智慧；",
        "translation": "They enter unhindered knowledge.",
        "source": "T09n0278_013:0482a19_9"
    },
    {
        "source_sentence": "以一切堅固香莊嚴法界，出過諸天所供養上，供養如來，解一切法猶如幻化；",
        "translation": "They adorned the cosmos of reality with all kinds of indestructible fragrances, surpassing those offered by celestial beings and honoring buddhas.",
        "source": "T09n0278_013:0482a19_10"
    },
    {
        "source_sentence": "敷置一切妙寶高座莊嚴法界，出過諸天所供養上，供養如來；",
        "translation": "They laid out high seats of all the finest jewels adorning the cosmos of reality and went beyond those offered by celestial beings to the enlightened.",
        "source": "T09n0278_013:0482a21_11"
    },
    {
        "source_sentence": "其心境界與如來等，座處境界亦同如來；",
        "translation": "The sphere of thought is the same as that of a buddha, while the sphere of the seat is the same as that of a buddha.",
        "source": "T09n0278_013:0482a23_12"
    },
    {
        "source_sentence": "建一切寶幢莊嚴法界，出過諸天所供養上，供養如來，善解應時，供養如來；",
        "translation": "He built all the jeweled banners adorning the cosmos of reality, surpassing those offered by celestial beings and honoring buddhas.",
        "source": "T09n0278_013:0482a24_13"
    },
    {
        "source_sentence": "以一切寶殿莊嚴法界，出過諸天所供養上，供養如來，解一切法如夢；",
        "translation": "He adorned the cosmos of reality with halls of all jewels, surpassing those offered by celestial beings above.",
        "source": "T09n0278_013:0482a25_14"
    },
    {
        "source_sentence": "以種種寶華莊嚴法界，出過諸天所供養上，供養如來，無著善根所生，",
        "translation": "They adorned the cosmos of reality with various jeweled flowers, surpassing those offered by celestial beings.",
        "source": "T09n0278_013:0482a27_15"
    },
    {
        "source_sentence": "充滿一切法界。",
        "translation": "It fills all the Dharma realm.",
        "source": "T09n0278_013:0482a29_16"
    },
    {
        "source_sentence": "此等無量菩薩皆從身出一切堅固香雲、一切雜色華雲、一切雜色衣雲、一切栴檀香雲、一切莊嚴寶蓋雲、一切種種香雲、一切華鬘雲、一切清淨莊嚴具雲，",
        "translation": "These innumerable enlightening beings all emanated from their bodies clouds of all kinds of fragrances, clouds of all kinds of flowers, clouds of all kinds of garments, clouds of all kinds of sandalwood perfumes, clouds of all kinds of ornamented jewel canopies, clouds of all kinds of fragrances, clouds",
        "source": "T09n0278_013:0482a29_17"
    },
    {
        "source_sentence": "出過諸天所供養上，供養如來。",
        "translation": "They go beyond the offerings made by gods and offer them to the Tathāgata.",
        "source": "T09n0278_013:0482b04_18"
    },
    {
        "source_sentence": "無量菩薩稱歎如來真實功德，永離顛倒，安住正法，具一切力，能令眾生離諸惡難，",
        "translation": "Countless enlightening beings praised the true virtues of buddhas. Forever free from error, they dwelled in the right teaching. Endowed with all powers, they were able to cause sentient beings to be rid of evil and distress.",
        "source": "T09n0278_013:0482b05_0"
    },
    {
        "source_sentence": "開示善道，於一音中演無量法，從一切陀羅尼生辯才之藏，不可窮盡，",
        "translation": "They reveal the good path, teaching infinite teachings in a single voice, producing from all dhāraṇī collections an inexhaustible store of eloquence.",
        "source": "T09n0278_013:0482b07_0"
    },
    {
        "source_sentence": "具足無畏，心常歡喜。",
        "translation": "They are endowed with fearlessness and always delighted.",
        "source": "T09n0278_013:0482b08_1"
    },
    {
        "source_sentence": "菩薩以如是等無量妙法讚歎如來，法身充滿虛空法界，心與三世諸如來等。",
        "translation": "Bodhisattvas praise the Tathāgata with such measureless marvelous teachings, filling space and the Dharma realm with the Dharma body, and their minds are like the tathāgatas of the three times.",
        "source": "T09n0278_013:0482b09_2"
    },
    {
        "source_sentence": "爾時，一切諸天眾及他方來諸天子眾、并不可數諸佛剎一切菩薩，見如來等正覺不可思議，",
        "translation": "At the time, all the celestial beings and other celestial beings from other directions, as well as innumerable buddha-lands and all enlightening beings, saw the unfathomability of the true enlightenment of Buddha.",
        "source": "T09n0278_013:0482b12_0"
    },
    {
        "source_sentence": "人中之雄；",
        "translation": "He was the most heroic among men.",
        "source": "T09n0278_013:0482b14_1"
    },
    {
        "source_sentence": "其身無量不可稱數，示現不可思議神足，令一切眾生皆大歡喜，周遍充滿一切虛空；",
        "translation": "His body was immeasurable and incalculable, manifesting inconceivable mystical powers. Causing all sentient beings to greatly rejoice, he filled space everywhere.",
        "source": "T09n0278_013:0482b14_2"
    },
    {
        "source_sentence": "諸佛功德莊嚴一切法界，令一切眾生安住一切善根；",
        "translation": "All buddhas’ virtues adorn all realms of reality, enabling all sentient beings to abide in all roots of goodness.",
        "source": "T09n0278_013:0482b16_3"
    },
    {
        "source_sentence": "成就神力，出過一切諸語言道；",
        "translation": "He perfected mystic powers, surpassing all the paths of speech.",
        "source": "T09n0278_013:0482b17_4"
    },
    {
        "source_sentence": "一切菩薩恭敬供養，隨所應化，現身救度；",
        "translation": "All enlightening beings venerate and honor them, manifesting their bodies to save and liberate according to the instruction they need.",
        "source": "T09n0278_013:0482b18_5"
    },
    {
        "source_sentence": "具足一切清淨善根，顯現如來無上功德，智慧境界不可窮盡；",
        "translation": "They are endowed with all pure roots of goodness, manifesting the unexcelled virtues of buddhas. The sphere of knowledge is inexhaustible.",
        "source": "T09n0278_013:0482b19_6"
    },
    {
        "source_sentence": "無比三昧之所出生，法身普至一切眾生，無有分際，令一切眾生皆大歡喜，",
        "translation": "Produced by incomparable concentration, the body of teaching reaches all sentient beings everywhere; without any bounds it causes all sentient beings to greatly rejoice.",
        "source": "T09n0278_013:0482b20_7"
    },
    {
        "source_sentence": "不斷一切智種；",
        "translation": "They do not cut off the seeds of omniscience.",
        "source": "T09n0278_013:0482b22_8"
    },
    {
        "source_sentence": "住佛所住，於三世諸佛家生，無盡眾生，皆令清淨，悉能出生一切菩薩清淨智慧，",
        "translation": "Abiding in the abode of buddhahood, they are born in the houses of the Buddhas of past, present, and future; purifying endless sentient beings, they can all produce the pure knowledge of all enlightening beings.",
        "source": "T09n0278_013:0482b23_0"
    },
    {
        "source_sentence": "發起一切菩薩諸根，一切法雲，普覆法界；",
        "translation": "They give rise to all the faculties of enlightening beings, clouds of all teachings covering the cosmos.",
        "source": "T09n0278_013:0482b24_1"
    },
    {
        "source_sentence": "如來教化，究竟無餘，隨其所願，悉令滿足。",
        "translation": "The Tathāgata teaches and transforms, ultimately without remainder, fulfilling whatever he wishes.",
        "source": "T09n0278_013:0482b25_2"
    },
    {
        "source_sentence": "安立清淨平等正智，出過一切眾生之上，得一切智；",
        "translation": "They establish pure impartial right knowledge, transcending all sentient beings, and attain omniscience.",
        "source": "T09n0278_013:0482b26_3"
    },
    {
        "source_sentence": "以正覺眼普觀世間，隨其先世所修善根，悉能示現。",
        "translation": "He observes all worlds with the eye of right awakening, able to show and show according to the roots of goodness cultivated in past lives.",
        "source": "T09n0278_013:0482b28_4"
    },
    {
        "source_sentence": "普發大心，眾生愛樂，智慧安住無能壞者。",
        "translation": "He universally arouses great aspiration, which sentient beings love and delight in, and his wisdom is peaceful and indestructible.",
        "source": "T09n0278_013:0482b29_5"
    },
    {
        "source_sentence": "善知眾生，分別諸剎，於不退轉善法中生不壞法性，分別法界，現如來身無量無數，",
        "translation": "Knowing sentient beings well, they discriminate the buddha-lands and give rise to unshakable essence of reality in nonregressing good principles. Discriminating the realm of reality, they show the body of Buddha without measure or number.",
        "source": "T09n0278_013:0482c01_6"
    },
    {
        "source_sentence": "遠離癡妄，安住真實，一切眾生歎無能盡，教化一切修念佛三昧，充滿法界，",
        "translation": "Being free of delusion and delusion, they abide in reality. All sentient beings praise them with incomparable wonder. Teaching and edifying all to cultivate buddha-samādhi, they fill the cosmos of reality.",
        "source": "T09n0278_013:0482c03_7"
    },
    {
        "source_sentence": "度脫眾生；",
        "translation": "They liberate sentient beings.",
        "source": "T09n0278_013:0482c05_8"
    },
    {
        "source_sentence": "無量無邊，本之所請，悉能化度，隨其所應，以法惠施，種種方便，調伏眾生，",
        "translation": "They are infinite and boundless, able to teach and liberate all the beings they originally invited. According to their needs and capacities, they bestow spiritual benevolence on sentient beings, using various methods to tame them.",
        "source": "T09n0278_013:0482c05_9"
    },
    {
        "source_sentence": "隨彼欲性，悉令清淨，示現色身，不可思議；",
        "translation": "They manifested physical bodies inconceivable, purifying them according to their desires.",
        "source": "T09n0278_013:0482c07_10"
    },
    {
        "source_sentence": "等觀眾生，心無所著，住無礙住，所見無障；",
        "translation": "They observe sentient beings equally, their minds without attachment. Abiding in unobstructed abiding, they have no obstruction in what they see.",
        "source": "T09n0278_013:0482c08_11"
    },
    {
        "source_sentence": "善解如來一切諸力，心常寂定，未曾散亂；",
        "translation": "They understand well all the powers of buddhas, their minds always quiescent and concentrated, never in disarray.",
        "source": "T09n0278_013:0482c09_12"
    },
    {
        "source_sentence": "住一切智，善能演說句身、味身真實之義，悉能深入無量智海，出生無量功德慧藏；",
        "translation": "Abiding in omniscience, they can skillfully explain the true meaning of the body of expressions and the body of taste. They are able to enter deeply into the ocean of infinite knowledge and produce an immeasurable store of virtue and wisdom.",
        "source": "T09n0278_013:0482c10_13"
    },
    {
        "source_sentence": "如來日出，普照法界，眾生願力，常住不沒；",
        "translation": "The rising of the sun of Buddha illumines the cosmos of reality. By the power of the vows of sentient beings, he abides and does not fade.",
        "source": "T09n0278_013:0482c11_14"
    },
    {
        "source_sentence": "住佛所住，堅固不壞，於我、我所心無所著，所行諸法，永離世間，於一切世無所染污，",
        "translation": "They abide in the abode of buddhahood, steadfast and unshakable; their minds have no attachment to self or anything pertaining to self. The things they practice are forever detached from the world, without any defilement in all worlds.",
        "source": "T09n0278_013:0482c12_15"
    },
    {
        "source_sentence": "在大眾會建智慧幢，智慧超出一切世間，無所染著。",
        "translation": "In the great assembly, he erects the banner of wisdom, and his wisdom transcends all worlds without any attachment.",
        "source": "T09n0278_013:0482c14_16"
    },
    {
        "source_sentence": "以大悲心拯拔眾苦，安立眾生於深妙智，饒益眾生功德無盡，悉善分別菩薩智慧，",
        "translation": "With great compassion they rescue all beings from suffering, and establish sentient beings in profound knowledge. Beneficent to sentient beings their virtues are inexhaustible; they skillfully analyze enlightening beings’ knowledge.",
        "source": "T09n0278_013:0482c16_17"
    },
    {
        "source_sentence": "信向佛道，成最正覺；",
        "translation": "They believe in the path of enlightenment and attain supreme perfect enlightenment.",
        "source": "T09n0278_013:0482c18_18"
    },
    {
        "source_sentence": "出于大慈，顯現大悲，佛身無量諸法莊嚴，種種音聲演無量法，隨其所應，",
        "translation": "Out of great compassion they manifest great compassion. The buddha-bodies are adorned with infinite arrays of teachings, and in various tones they teach infinite teachings according to their needs.",
        "source": "T09n0278_013:0482c18_19"
    },
    {
        "source_sentence": "充滿其願。",
        "translation": "It fulfills their vow.",
        "source": "T09n0278_013:0482c20_20"
    },
    {
        "source_sentence": "於去、來、今心常清淨，悉令群生不著境界；",
        "translation": "Their minds are always pure in the past, future, and present, enabling all sentient beings not to cling to objects.",
        "source": "T09n0278_013:0482c20_21"
    },
    {
        "source_sentence": "能與一切諸菩薩記，生於三世諸如來家，普於十方智慧無礙，一切悉至而無所著；",
        "translation": "They can give assurance to all enlightening beings that they will be born in the house of the buddhas of past, present, and future. Their knowledge and wisdom extending throughout the ten directions are unhindered, reaching everywhere without attachment.",
        "source": "T09n0278_013:0482c21_22"
    },
    {
        "source_sentence": "於諸佛世界了達真實，善能分別一切眾生，出世功德，普為一切世間燈明，",
        "translation": "Understanding reality in all buddha-worlds, they can skillfully discriminate all sentient beings; their transcendent virtues become lamps of light for all worlds.",
        "source": "T09n0278_013:0482c23_23"
    },
    {
        "source_sentence": "生死垢惱無能染著；",
        "translation": "They are not stained by the defilements of birth and death.",
        "source": "T09n0278_013:0482c25_24"
    },
    {
        "source_sentence": "佛智慧月普照法界，了達諸法無真實性，無量深智觀察平等，慧心明淨，",
        "translation": "The moon of Buddha’s knowledge and wisdom illumines the cosmos, comprehending that all things have no true nature; immeasurable profound knowledge observes equality—the mind of knowledge is clear and pure.",
        "source": "T09n0278_013:0482c25_25"
    },
    {
        "source_sentence": "普照十方；",
        "translation": "They illumine the ten directions everywhere.",
        "source": "T09n0278_013:0482c27_26"
    },
    {
        "source_sentence": "解了諸法如夢如化，一切世間心、諸佛心及諸業報隨其所應，顯現真實；",
        "translation": "Understanding all things are like dreams and illusions, the minds of all worldly beings, the minds of buddhas, and the results of actions manifest reality according to their needs.",
        "source": "T09n0278_013:0482c27_27"
    },
    {
        "source_sentence": "順眾生根，為現佛身，如來境界悉能容受一切眾生；",
        "translation": "In accord with the faculties of sentient beings, they manifest buddha-bodies to them. The realm of enlightened ones can contain all sentient beings.",
        "source": "T09n0278_013:0482c29_28"
    },
    {
        "source_sentence": "普知眾生所行諸法，解了其相無有自性，知一切世間一性非性，隨順眾生示現有性；",
        "translation": "“Great enlightening beings know that all things practiced by sentient beings have no self-nature. They know that all worlds are of one essence and not of another, and they follow sentient beings to show the existence of their own essence.",
        "source": "T09n0278_013:0483a01_29"
    },
    {
        "source_sentence": "欲令眾生超出三界，一向正趣無上菩提，救護拯濟一切眾生，未曾妄取世間之相，",
        "translation": "They want to cause sentient beings to transcend the three realms, always and exclusively heading for supreme enlightenment. They rescue and save all sentient beings without ever mistakenly grasping the characteristics of the world.",
        "source": "T09n0278_013:0483a03_30"
    },
    {
        "source_sentence": "滅諸煩惱，正觀世間，大乘轡勒所行不亂。",
        "translation": "He extinguishes the afflictions, correctly observes the world, and practices what's practiced by Mahāyāna Vaiśravaṇa without confusion.",
        "source": "T09n0278_013:0483a05_31"
    },
    {
        "source_sentence": "成就一切諸法善利，悉能分別眾生善根，業報清淨，智慧明了，等入三世，",
        "translation": "Accomplishing the good benefits of all teachings, they are able to discern the roots of goodness of sentient beings. The results of their deeds are pure; their knowledge is clear and comprehensible. They enter all times equally.",
        "source": "T09n0278_013:0483a06_32"
    },
    {
        "source_sentence": "永離世間一切虛妄；",
        "translation": "They are forever free of all falsehoods in the world.",
        "source": "T09n0278_013:0483a08_33"
    },
    {
        "source_sentence": "放光明網，普照十方，令一切眾普見如來，分別一切十方佛剎，相好具足，",
        "translation": "They emanate networks of light beams that illumine the ten directions, causing all beings to see the enlightened ones everywhere. Discriminating all buddha-lands in the ten directions, they are endowed with characteristics and embellishments.",
        "source": "T09n0278_013:0483a08_34"
    },
    {
        "source_sentence": "樂觀無厭；",
        "translation": "They delight in contemplation without weariness.",
        "source": "T09n0278_013:0483a10_35"
    },
    {
        "source_sentence": "菩薩所行功德智慧之所興起，善能分別諸根境界，所行佛事不失其時。",
        "translation": "It's produced by the merit and wisdom of the bodhisattva's practice, which can skillfully discern the spheres of his faculties and the buddha-works he does at the right time.",
        "source": "T09n0278_013:0483a10_36"
    },
    {
        "source_sentence": "成就三世諸佛無量方便，慈悲普覆一切眾生，周遍普降陀羅尼雨，皆令成就諸佛功德，",
        "translation": "Accomplishing the innumerable skillful means of the Buddhas of all times, their compassion covering all sentient beings with kindness and compassion, they rained down the rain of dhāraṇī spells everywhere to enable them to perfect the virtues of buddhas.",
        "source": "T09n0278_013:0483a12_37"
    },
    {
        "source_sentence": "無量妙色莊嚴佛身，十方眾生靡不瞻覩；",
        "translation": "The buddha-body adorned with infinite beautiful forms was looked upon by all sentient beings in the ten directions.",
        "source": "T09n0278_013:0483a14_38"
    },
    {
        "source_sentence": "除滅一切世間障礙，分別諸法，解真實義，成就功德自在法王。",
        "translation": "He removes all worldly hindrances, discerns dharmas, understands their true meaning, and accomplishes the unimpeded Dharma king of merit.",
        "source": "T09n0278_013:0483a15_39"
    },
    {
        "source_sentence": "功德日王普能照曜一切世間，最上福田，依因一切智慧緣生，化身充滿一切世間，",
        "translation": "Sun King of Virtue, able to illumine all worlds, is the supreme field of blessings. Produced on the basis of all causes and conditions of knowledge, his apparitional body fills all worlds.",
        "source": "T09n0278_013:0483a17_40"
    },
    {
        "source_sentence": "一一化身普放無量智慧光明，無礙天繒冠頂法王，功德無量，悉能隨順分別世間，",
        "translation": "In each magic body he emanated infinite lights of knowledge and wisdom. The unobstructed celestial crown prince, the King of Truth, whose virtues were immeasurable, was able to discriminate all worlds accordingly.",
        "source": "T09n0278_013:0483a19_41"
    },
    {
        "source_sentence": "無上導師開化群生如來智慧、一切世間無畏之乘。",
        "translation": "The unsurpassed guide enlightened all sentient beings with the Tathāgata's wisdom and the fearless vehicle of all worlds.",
        "source": "T09n0278_013:0483a21_0"
    },
    {
        "source_sentence": "一切世間無上醫王，了知眾生所病輕重，永離癡冥，堅固不退，淨慧眼藏；",
        "translation": "The unexcelled king of healing physicians in all worlds, knowing the seriousness and severity of sentient beings’ illnesses, they are forever freed from ignorance and delusion. Steadfast and not regressing, they are the mine of pure eye of knowledge.",
        "source": "T09n0278_013:0483a22_1"
    },
    {
        "source_sentence": "善能分別一切世間，開示眾生一切業報，眾生病苦悉能除滅，無量方便而度脫之，",
        "translation": "He was able to analyze all worlds and reveal the consequences of all actions of sentient beings. He was able to extinguish the sicknesses and pains of all living beings and liberate them by means of innumerable skillful means.",
        "source": "T09n0278_013:0483a23_2"
    },
    {
        "source_sentence": "隨其所應，常不失時。",
        "translation": "Whatever it should be, it's always there when it's not lost.",
        "source": "T09n0278_013:0483a25_3"
    },
    {
        "source_sentence": "等觀眾生，遠離諸惡，示現業報，猶如幻化，隨其所應，為現佛身，普令眾生悉見導師，",
        "translation": "Likewise, seeing sentient beings are far removed from evil, they show the results of their deeds, just as magical illusions do. According to their needs and capacities, they manifest buddha-bodies in order to cause all sentient beings to see their Guide.",
        "source": "T09n0278_013:0483a26_4"
    },
    {
        "source_sentence": "分別世間一切諸法，歡喜敬佛，長養善根，得不退轉，隨彼所業，皆分別知。",
        "translation": "They discriminate all worldly dharmas, rejoice in respect for buddhas, nourish good roots, attain nonregression, and discern them according to their actions.",
        "source": "T09n0278_013:0483a28_5"
    },
    {
        "source_sentence": "一切眾生長眠生死，如來出世能覺悟之，安慰世間，令無怖畏，心無所著，",
        "translation": "All sentient beings grow drowsy in birth and death; the Enlightened One, appearing in the world to awaken them, comforts the world, so that they have no fear and no attachment in their minds.",
        "source": "T09n0278_013:0483b01_6"
    },
    {
        "source_sentence": "無能壞者，安住智慧方便具足，如來最勝嚴淨眾生。",
        "translation": "Those who can't break it are those who abide in wisdom and are fully equipped with skillful means, and the Tathāgata most excellently adorns and purifies sentient beings.",
        "source": "T09n0278_013:0483b02_7"
    },
    {
        "source_sentence": "智慧山王開淨法門，或現佛身，或現菩薩，開導眾生，遠離眾惡，安置善地，",
        "translation": "The king of mountains of knowledge and wisdom opens the door of the pure teaching, sometimes manifesting buddha-bodies, sometimes manifesting enlightening beings. They lead sentient beings away from all evil and establish them in the state of goodness.",
        "source": "T09n0278_013:0483b04_8"
    },
    {
        "source_sentence": "無量功德莊嚴佛身，業行所成，示現世間一切智慧，得到彼岸；",
        "translation": "Buddha’s body adorned with infinite virtues, developed by deeds, manifesting all worldly knowledge and wisdom, they reach the other shore.",
        "source": "T09n0278_013:0483b05_9"
    },
    {
        "source_sentence": "成佛道時，悉令清淨，能滿世間一切所願，開示世間堅固善友，光明清淨，",
        "translation": "At the time of their attainment of enlightenment, they all become pure, able to fulfill all the wishes of the world. They show the world firm and steadfast benefactors, whose light is pure.",
        "source": "T09n0278_013:0483b07_10"
    },
    {
        "source_sentence": "遍照十方，普為眾生示現其身，滅除無量眾生慳垢，悉令眾生善根清淨，",
        "translation": "Universally illumining the ten directions, they show their bodies to sentient beings everywhere. Extinguishing the stain of greed and wickedness in infinite numbers of sentient beings, they purify all sentient beings’ roots of goodness.",
        "source": "T09n0278_013:0483b09_11"
    },
    {
        "source_sentence": "隨其所願，皆得滿足。",
        "translation": "According to their wishes, they'll all be fulfilled.",
        "source": "T09n0278_013:0483b10_12"
    },
    {
        "source_sentence": "等觀眾生無上、中、下，攝取善根，起清淨業，降伏眾魔，除滅煩惱，",
        "translation": "They are equal to all sentient beings, the highest, middle, and lowest. They take care of their roots of goodness, undertake pure deeds, subdue demons, and extinguish afflictions.",
        "source": "T09n0278_013:0483b11_13"
    },
    {
        "source_sentence": "出生無量無礙之力。",
        "translation": "They give rise to measureless and unobstructed power.",
        "source": "T09n0278_013:0483b12_14"
    },
    {
        "source_sentence": "一切世間淨光明王，無礙慧日，照除癡冥，常以法施一切眾生，無量無邊如來智藏光明清淨，",
        "translation": "The king of pure light of all worlds, the unobstructed sun of knowledge, illumines and dispels the darkness of ignorance; he always bestows the Teaching on all sentient beings.",
        "source": "T09n0278_013:0483b13_15"
    },
    {
        "source_sentence": "普照十方，令一切眾生遠離怨仇，隨其所願，皆悉充滿，最勝福田靡不歸依，",
        "translation": "They illumine the ten directions, causing all sentient beings to be far removed from enemies and enemies. Fulfilling all their wishes, they take refuge in the supreme field of blessedness.",
        "source": "T09n0278_013:0483b15_16"
    },
    {
        "source_sentence": "果報無量具足清淨，少修善根獲大功德，安置眾生無盡智地，一切善根皆由心起，",
        "translation": "Their rewards are immeasurable, replete with purity. They cultivate the roots of goodness with little effort and attain great virtue; they establish sentient beings in the state of inexhaustible knowledge. All roots of goodness arise from their minds.",
        "source": "T09n0278_013:0483b17_17"
    },
    {
        "source_sentence": "無量歡喜清淨功德，能除眾生惡道諸難。",
        "translation": "The pure virtue of immeasurable joy and joy can remove the difficulties of sentient beings in bad destinies.",
        "source": "T09n0278_013:0483b19_18"
    },
    {
        "source_sentence": "如是正念如來，如是觀察正覺，如是入智慧淵，如是入功德海，如是至虛空智慧，",
        "translation": "Thus is the Buddha of Right Mindfulness, thus does he observe right awakening, thus does he enter the depths of wisdom, thus does he enter the ocean of virtues, and thus does he reach spacelike wisdom.",
        "source": "T09n0278_013:0483b20_19"
    },
    {
        "source_sentence": "如是知眾生福田，如是正知如來，如是觀察淨業相好，如是正知法身普照十方，",
        "translation": "Thus he knows the field of blessings of sentient beings, thus he correctly knows the enlightened one, thus observes the marks and embellishments of pure deeds, and thus he correctly knows the body of reality that illumines all directions.",
        "source": "T09n0278_013:0483b22_20"
    },
    {
        "source_sentence": "如是知佛示現一切不可思議自在神力。",
        "translation": "Thus, he knows that the Buddha shows all his inconceivable miraculous powers.",
        "source": "T09n0278_013:0483b24_0"
    },
    {
        "source_sentence": "爾時，諸天見如來身，一一毛孔出阿僧祇億那由他光明，一一光明有阿僧祇妙色、阿僧祇清淨照明、阿僧祇佛剎、阿僧祇眾生、阿僧祇歡喜長養、阿僧祇佛勇猛精進淨、阿僧祇寂滅三昧、阿僧祇諸根清涼柔軟、阿僧祇恭敬如來。",
        "translation": "At the time, the gods saw an incalculable number of billions of rays of light emanate from each pore of the Tathāgata's body, and each ray of light had an incalculable number of subtle colors, an incalculable number of pure illuminations, an incalculable number of buddha bases, an incalculable number of sentient beings",
        "source": "T09n0278_013:0483b24_1"
    },
    {
        "source_sentence": "爾時，諸天復見佛身出不可思議雜色光明輪，一一光明輪有不可思議色、不可思議照明，",
        "translation": "At that time, the gods also saw inconceivable spheres of light emanating from the Buddha’s body. Each ray of light had inconceivable colors and unfathomable illumination.",
        "source": "T09n0278_013:0483c01_2"
    },
    {
        "source_sentence": "普照十方無量無邊一切法界，示現如來無量無數自在神力。",
        "translation": "They illumine the infinity and boundlessness of all realms of reality in the ten directions, manifesting the Buddha’s immeasurable, countless, unimpeded spiritual power.",
        "source": "T09n0278_013:0483c03_3"
    },
    {
        "source_sentence": "眾生皆聞清淨妙音，又自然出不可思議偈，宣揚演說出世間法，具足成就離世善根，",
        "translation": "All sentient beings hear the pure, subtle sound and also spontaneously utter inconceivable verses, proclaiming and expounding transcendent teachings, fully developing worldly roots of goodness.",
        "source": "T09n0278_013:0483c04_4"
    },
    {
        "source_sentence": "顯現阿僧祇億那由他不可思議上妙莊嚴、不可思議劫讚歎光明，不能窮盡。",
        "translation": "He manifested incalculable millions of myriads of trillions of unfathomable sublime adornments and praised light for innumerable eons, which could not be exhausted.",
        "source": "T09n0278_013:0483c06_5"
    },
    {
        "source_sentence": "從如來無盡自在中生，悉普照現不思議剎，諸佛出世，安立眾生於智慧門，",
        "translation": "They arise from the inexhaustible unimpededness of buddhas, all illumining and manifesting inconceivably many buddha-lands. The Buddhas appear in the world to establish sentient beings in the sphere of knowledge.",
        "source": "T09n0278_013:0483c08_6"
    },
    {
        "source_sentence": "入真實義，顯現不可思議如來化身，普照無量無數、不可思議諸佛世界及諸法界、十方一切世界、究竟法界、虛空界，",
        "translation": "Entering into the true meaning of reality, they manifested the inconceivable emanation bodies of buddhas, illumining countless, immeasurable, inconceivable numbers of buddha-realms and all universes throughout the cosmos.",
        "source": "T09n0278_013:0483c10_7"
    },
    {
        "source_sentence": "持一切世界故起；",
        "translation": "They arise because they hold all worlds.",
        "source": "T09n0278_013:0483c13_0"
    },
    {
        "source_sentence": "普令眾生清淨平等，從如來無礙一切智佛所住生；",
        "translation": "Causing all sentient beings to be pure and equal, they arise from the abode of buddhas of unobstructed omniscience of the enlightened.",
        "source": "T09n0278_013:0483c13_1"
    },
    {
        "source_sentence": "又佛身中出無量無數、不可思議妙寶光明，本於無量無數、不可思議諸如來所修功德故，",
        "translation": "“Furthermore, from the body of the Buddha emanates countless rays of light beams of inconceivable arrays of jewels, born of the virtues cultivated by those buddhas.",
        "source": "T09n0278_013:0483c14_2"
    },
    {
        "source_sentence": "得是光明；",
        "translation": "They attain this light.",
        "source": "T09n0278_013:0483c16_3"
    },
    {
        "source_sentence": "清淨大願，善根所起，無量佛所修習清淨不放逸行，一向專求無上菩提。",
        "translation": "The pure great vow, produced by the roots of goodness, cultivated by measureless buddhas, is a pure practice that doesn't become lax, and it's always focused on seeking unsurpassed enlightenment.",
        "source": "T09n0278_013:0483c17_0"
    },
    {
        "source_sentence": "得是光明，出生無量無礙善根，普令眾生於如來所，除滅疑惑，得見如來；",
        "translation": "Attaining this light, they produce measureless roots of unhindered goodness, causing all sentient beings to be in the presence of the enlightened, getting rid of doubt and confusion and seeing the enlightened.",
        "source": "T09n0278_013:0483c18_1"
    },
    {
        "source_sentence": "又覩自在神力，安立無量眾生勝善根門，度眾生海，於一切佛剎為諸菩薩演說諸佛不思議法。",
        "translation": "Also, by the mystic power of self-dependence, he establishes the gate of superior good roots for measureless sentient beings and saves the ocean of sentient beings, expounding the inconceivable teachings of the buddhas to enlightening beings in all buddha-lands.",
        "source": "T09n0278_013:0483c20_2"
    },
    {
        "source_sentence": "爾時，如來以大慈悲普覆一切，示現一切智慧莊嚴，欲令無量無邊、不可思議諸佛世界一切眾生未信者信，",
        "translation": "At that time the Enlightened One, covering all with great compassion, showed them all the adornments of knowledge and wisdom, wanting to cause all sentient beings who did not believe in the infinite, boundless, inconceivable buddha-lands to believe.",
        "source": "T09n0278_013:0483c22_3"
    },
    {
        "source_sentence": "已信者增長善根；",
        "translation": "Those who have already believed will increase their roots of goodness.",
        "source": "T09n0278_013:0483c25_4"
    },
    {
        "source_sentence": "已增長者，令其清淨；",
        "translation": "Those who have already grown will be made pure.",
        "source": "T09n0278_013:0483c25_5"
    },
    {
        "source_sentence": "已清淨者，令其成熟；",
        "translation": "Those who are already pure I lead to maturity.",
        "source": "T09n0278_013:0483c26_6"
    },
    {
        "source_sentence": "已成熟者，令其解脫；",
        "translation": "Those who are mature I lead to liberation.",
        "source": "T09n0278_013:0483c26_7"
    },
    {
        "source_sentence": "得甚深法，具足無量智慧光明，滿足誓願，一切智心堅固不轉，不壞法性，",
        "translation": "They attain profound knowledge, imbued with the light of immeasurable knowledge and wisdom. Fulfilling their vows, their minds of omniscience are firm and unshakable; they do not destroy the essence of things.",
        "source": "T09n0278_013:0483c27_8"
    },
    {
        "source_sentence": "聞真實際而不驚怖，具足解達如來實法，滿足一切諸波羅蜜，成就清淨出世善根，",
        "translation": "They hear the truth and practice without fear, fully comprehending the true teachings of buddhas. Fulfilling all transcendent ways, they develop pure, transmundane roots of goodness.",
        "source": "T09n0278_013:0483c29_0"
    },
    {
        "source_sentence": "具足修習普賢所行，成就如來無量自在，遠離魔界入佛境界，解甚深法得不思議智，",
        "translation": "They are endowed with the practice of Universally Good, perfecting the immeasurable freedoms of buddhas. Free from the realm of demons and entering the sphere of buddhahood, they understand profound principles and attain inconceivable knowledge.",
        "source": "T09n0278_013:0484a02_0"
    },
    {
        "source_sentence": "大乘弘願堅固不轉，常見諸佛得無量智、無量無邊功德藏力，發勝妙心離疑網地，",
        "translation": "“Great enlightening beings’ vast vows of the Great Vehicle are firm and unshakable; they see buddhas attain immeasurable knowledge, immeasurable boundless stores of virtue, and develop a supremely wondrous mind free from the web of doubt.",
        "source": "T09n0278_013:0484a04_1"
    },
    {
        "source_sentence": "滅惡清淨常依如來，於真實法堅固不轉，得入一切諸菩薩眾，常在三世諸如來家。",
        "translation": "The cessation of evil and purity always relying on the Tathāgata, which is resolute and unchanging in regard to the true teaching, they can enter all the bodhisattva congregations that are always at the homes of the tathāgatas of the three times.",
        "source": "T09n0278_013:0484a06_2"
    },
    {
        "source_sentence": "如來顯現如是等類無量無數清淨善根，調伏眾生，悉欲令彼知佛功德，",
        "translation": "The Buddha manifests these kinds of immeasurable, countless pure roots of goodness, taming sentient beings, wanting to cause them all to know the Buddha’s virtues.",
        "source": "T09n0278_013:0484a08_3"
    },
    {
        "source_sentence": "照明一切無礙慧藏。",
        "translation": "It illuminates all the store of unobstructed wisdom.",
        "source": "T09n0278_013:0484a09_4"
    },
    {
        "source_sentence": "如來不可思議大神通力，於一切趣普現自在，本所志願，皆悉滿足，具足淨慧，",
        "translation": "The Buddha’s inconceivable great spiritual power is manifest everywhere in all states of existence, fulfilling all his original vows and endowed with pure knowledge.",
        "source": "T09n0278_013:0484a10_5"
    },
    {
        "source_sentence": "究竟諸佛最勝善逝，成就法王一切自在，具足出生一切智門，成就最勝清淨法身。",
        "translation": "The ultimate buddhas are the most excellent well-versed, accomplishing all the masteries of the king of the Dharma, fully producing all the gates of omniscience, and perfecting the most excellent and pure Dharma body.",
        "source": "T09n0278_013:0484a12_6"
    },
    {
        "source_sentence": "三世諸佛功德平等，一切世間無能為諭；",
        "translation": "The virtues of the Buddhas of all times are equal, and there is no one in any world who can teach them.",
        "source": "T09n0278_013:0484a14_0"
    },
    {
        "source_sentence": "相好嚴身具足諸力，見無厭足；",
        "translation": "Their features and embellishments adorned their bodies, endowed with the powers, they never tire of seeing.",
        "source": "T09n0278_013:0484a15_0"
    },
    {
        "source_sentence": "於一切劫稱說如來智慧功德，自在示現，不可窮盡。",
        "translation": "In all ages they praised the virtues of knowledge and wisdom of buddhas, freely displaying them inexhaustibly.",
        "source": "T09n0278_013:0484a15_1"
    },
    {
        "source_sentence": "一切菩薩不能究竟，普為眾生圓滿慧日，滅三世闇，逮得法王神力自在，",
        "translation": "All enlightening beings are unable to reach the ultimate, and for the sake of sentient beings everywhere they perfect the sun of knowledge. Extinguishing the darkness of the three worlds, they attain the mastery of the spiritual power of the King of Truth.",
        "source": "T09n0278_013:0484a17_0"
    },
    {
        "source_sentence": "出生無量清淨功德。",
        "translation": "They give rise to measureless pure merit.",
        "source": "T09n0278_013:0484a18_1"
    },
    {
        "source_sentence": "爾時，兜率天王為如來設如是等諸供具已，與無量無數阿僧祇兜率陀天子俱，",
        "translation": "At that time the celestial king of Tuṣita, having prepared these offerings for the Buddha, was accompanied by innumerable, countless, and incalculable numbers of deva princes of Tuṣita.",
        "source": "T09n0278_013:0484a19_2"
    },
    {
        "source_sentence": "恭敬合掌，白佛言：「善來世尊！",
        "translation": "With respect, he joined his palms and said to the Buddha, Good, Bhagavān!",
        "source": "T09n0278_013:0484a21_3"
    },
    {
        "source_sentence": "善來正覺！",
        "translation": "Well come, right awakening!",
        "source": "T09n0278_013:0484a21_4"
    },
    {
        "source_sentence": "唯願哀愍處此宮殿。」",
        "translation": "Please have mercy on me and stay in this palace.",
        "source": "T09n0278_013:0484a22_5"
    },
    {
        "source_sentence": "爾時，世尊以佛莊嚴而自莊嚴，眾生見者無不敬樂，一切菩薩之所願求，",
        "translation": "At that time the World-honored One adorned himself with the adornments of buddhahood, and all sentient beings who saw him did not fail to venerate him. All enlightening beings sought after him.",
        "source": "T09n0278_013:0484a22_6"
    },
    {
        "source_sentence": "令兜率諸天皆大歡喜，普令眾生修佛境界，種佛善根，功德無盡，逮得清淨不可壞信，",
        "translation": "He caused the gods of Tuṣita to greatly rejoice, causing all sentient beings to cultivate the sphere of buddhahood; planting Buddha’s roots of goodness with inexhaustible virtue, he acquired pure and indestructible faith.",
        "source": "T09n0278_013:0484a24_7"
    },
    {
        "source_sentence": "常供養佛，心無厭倦。",
        "translation": "They always make offerings to the Buddha without weariness of mind.",
        "source": "T09n0278_013:0484a26_8"
    },
    {
        "source_sentence": "正心清淨，發起眾生求一切智故，受兜率天王請，即昇一切寶莊嚴殿，",
        "translation": "Because the correct mind was pure, and because sentient beings were inspired to seek omniscience, they accepted the invitation of the king of the Tushita heavens and ascended to the palace adorned with all treasures.",
        "source": "T09n0278_013:0484a26_9"
    },
    {
        "source_sentence": "如意寶藏師子之座；",
        "translation": "A lion seat of wish-granting jewel treasury.",
        "source": "T09n0278_013:0484a28_10"
    },
    {
        "source_sentence": "如此世界、四天下、兜率天宮，如來受請昇一切寶莊嚴殿如意寶藏師子之座；",
        "translation": "In this world, in the four quarters of the earth, and in the celestial palace of Tuṣita Heaven, the Enlightened One ascended to the wish-granting jewel mine lion seat in the hall adorned with all kinds of jewels.",
        "source": "T09n0278_013:0484a29_0"
    },
    {
        "source_sentence": "一切十方、諸四天下、兜率天宮，一切寶莊嚴殿如意寶藏師子之座亦復如是。",
        "translation": "So it is with the lion seat of the store of wish-granting jewels in all the ten directions, the four continents, and the palaces of the Tuṣita heavens, adorned with all their treasures.",
        "source": "T09n0278_013:0484b01_1"
    },
    {
        "source_sentence": "爾時，一切寶莊嚴殿自然殊特，妙寶莊嚴，出過諸天莊嚴之上，一切寶網彌覆其上，",
        "translation": "At that time the hall Adorned with All Jewels was naturally extraordinary, adorned with exquisite jewels, surpassing the adornments of all the celestial beings, covered by networks of all kinds of jewels.",
        "source": "T09n0278_013:0484b03_2"
    },
    {
        "source_sentence": "普雨一切妙寶雲雨、一切寶莊嚴雲雨、一切寶衣雲雨、一切栴檀雲雨、一切堅固香雲雨、一切雜寶莊嚴雲雨、不可思議眾華雲雨；",
        "translation": "They showered rain from clouds of all kinds of jewels, clouds of all kinds of adornments, clouds of all kinds of robes, clouds of sandalwood, clouds of all kinds of fragrances, clouds of all kinds of adornments of various jewels, and clouds of inconceivable arrays of flowers.",
        "source": "T09n0278_013:0484b05_3"
    },
    {
        "source_sentence": "自然演出不可思議妓樂音聲，宣揚如來一切種智、微妙法言。",
        "translation": "It naturally produces inconceivable sounds of music, proclaiming the Tathāgata's all-inclusive wisdom and subtle teachings.",
        "source": "T09n0278_013:0484b08_4"
    },
    {
        "source_sentence": "如是一切諸供養具，悉過諸天所供養上。",
        "translation": "Thus, all these offerings are more than those offered by the gods.",
        "source": "T09n0278_013:0484b09_5"
    },
    {
        "source_sentence": "爾時，佛威神力，為兜率天王故，一切音樂寂然無聲，不復擾亂；",
        "translation": "At that time the Buddha’s mighty spiritual power caused all the music to cease for the sake of the celestial king Tuṣita, causing no sound and no disturbance.",
        "source": "T09n0278_013:0484b10_6"
    },
    {
        "source_sentence": "天王正念，長養善根，增益大心，勇猛精進，甚大歡喜；",
        "translation": "The king of gods, being correctly mindful, nourishes his roots of goodness and increases his great determination. Being brave and vigorous, he is overjoyed.",
        "source": "T09n0278_013:0484b12_7"
    },
    {
        "source_sentence": "正心清淨，即發無上菩提之心，於諸法門總持不忘。",
        "translation": "The correct mind is purified, which is the arousal of the mind of unsurpassed enlightenment and the general maintenance of the teachings without forgetting them.",
        "source": "T09n0278_013:0484b13_8"
    },
    {
        "source_sentence": "「無礙如來猶滿月，　　諸吉祥中最第一，",
        "translation": "Unobstructed Buddha is like a full moon, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入眾寶莊嚴殿，　　是故此處最吉祥。",
        "translation": "Come and enter the hall adorned with myriad jewels; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　無邊如來智甚深，　　諸吉祥中最第一，",
        "translation": "Boundless Buddha’s knowledge is profound, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入清淨金色殿，　　是故此處最吉祥。",
        "translation": "Come and enter the pure golden hall; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　普眼如來甚明淨，　　諸吉祥中最第一，",
        "translation": "The Universal Eye Buddha is extremely clear and pure, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入寶藏蓮華殿，　　是故此處最吉祥。",
        "translation": "They have come to enter the lotus hall of the jeweled treasury; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　珊瑚如來色鮮潔，　　諸吉祥中最第一，",
        "translation": "The color of the coral Buddha is pure and clean, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入清淨寶藏殿，　　是故此處最吉祥。",
        "translation": "They come to enter the pure jewel mine hall; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　最勝如來論師子，　　諸吉祥中最第一，",
        "translation": "The supreme Buddha is the lion of treatises, Supreme among all auspicious beings.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入因陀寶山殿，　　是故此處最吉祥。",
        "translation": "They come and enter the jeweled mountain hall of Indra; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　滿月如來德無量，　　諸吉祥中最第一，",
        "translation": "The Buddha Candracchattra has immeasurable virtues, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入妙寶華藏殿，　　是故此處最吉祥。",
        "translation": "They come and enter the flower-treasury hall of myriad jewels; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　無量如來光無際，　　諸吉祥中最第一，",
        "translation": "Amitâbha Buddha’s light has no limit, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入寶樹莊嚴殿，　　是故此處最吉祥。",
        "translation": "They come and enter the hall adorned with jeweled trees; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　寶幢如來離疑惑，　　諸吉祥中最第一，",
        "translation": "Jewel Banner Buddha, free from doubt and confusion, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入妙寶莊嚴殿，　　是故此處最吉祥。",
        "translation": "They come and enter the hall adorned with exquisite jewels; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　無量慧佛人師子，　　諸吉祥中最第一，",
        "translation": "The Buddha of Immeasurable Wisdom, a human lion, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入香山莊嚴殿，　　是故此處最吉祥。",
        "translation": "They come and enter the palace adorned with mountains of fragrance; Therefore this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　功德如來光普照，　　諸吉祥中最第一，",
        "translation": "Buddha of Virtue, illumined by the light of universal illumination, Supreme among the auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "　來入勝寶莊嚴殿，　　是故此處最吉祥。」",
        "translation": "They've come to enter the hall of superlative treasure adornment, so this place is most auspicious.",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "爾時，兜率天王承佛神力，即自憶念過去佛所所種善根，以偈頌曰：如此間兜率天王承佛神力，",
        "translation": "At that time the king of the Tushita heaven, imbued with the spiritual power of the Buddha, remembered to himself the roots of virtue he had planted in the past under buddhas and composed these verses:",
        "source": "T09n0278_013:0484b14_9"
    },
    {
        "source_sentence": "憶念過去諸等正覺，以偈讚歎；",
        "translation": "They remembered the true enlightened ones of the past and praised them in verse.",
        "source": "T09n0278_013:0484c08_10"
    },
    {
        "source_sentence": "如是十方一切世界兜率天王，各自憶念過去佛所所種善根，以偈讚歎，",
        "translation": "Thus, the celestial kings of Tuṣita Heaven in all worlds in the ten directions each remembered the roots of goodness planted by past buddhas and praised them in verse:",
        "source": "T09n0278_013:0484c09_11"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T09n0278_013:0484c11_12"
    },
    {
        "source_sentence": "爾時，世尊昇一切寶莊嚴殿如意寶藏師子之座，結跏趺坐，清淨法身，",
        "translation": "At that time, the World-honored One ascended to the lion seat of the wish-granting jewel treasury in the palace adorned with all kinds of jewels and sat cross-legged on it, thus purifying his Dharma body.",
        "source": "T09n0278_013:0484c11_13"
    },
    {
        "source_sentence": "三世諸佛境界自在皆悉平等，一向寂靜，以一切諸佛莊嚴而自莊嚴，無量無數、不可思議清淨大菩薩眾悉從他方世界來集。",
        "translation": "They adorned themselves with the adornments of all buddhas, and assembled from other worlds in countless, immeasurable, inconceivably pure great assemblies of enlightening beings.",
        "source": "T09n0278_013:0484c12_14"
    },
    {
        "source_sentence": "如來知時而為說法，法身不二，無所染著，諸佛所起，如來法身離諸所行。",
        "translation": "Knowing the time, the Tathāgata teaches the Dharma body at the appropriate time. The Dharma body is nondual in essence and has no attachment whatsoever. Produced by the buddhas, the Dharma body of the Tathāgata is apart from all conditioned phenomena.",
        "source": "T09n0278_013:0484c15_15"
    },
    {
        "source_sentence": "爾時，一切寶莊嚴殿自然無量無數、不可思議阿僧祇諸供養具，殊特奇妙，",
        "translation": "At that time, all the jewel-adorned halls were naturally immeasurable, countless, inconceivable, and of incalculable numbers of offerings, extraordinarily wonderful.",
        "source": "T09n0278_013:0484c17_16"
    },
    {
        "source_sentence": "出過諸天所供養上，所謂：華鬘、塗香、末香、寶衣、幢蓋、繒幡、種種眾寶、妓樂，",
        "translation": "They surpassed those offered by the gods: garlands of flowers, unguents, perfumes, powdered incense, precious robes, canopies, silhouetted banners, various treasures, and music.",
        "source": "T09n0278_013:0484c19_17"
    },
    {
        "source_sentence": "恭敬供養，讚歎如來；",
        "translation": "They honored and offered support to the Buddha and praised him.",
        "source": "T09n0278_013:0484c20_18"
    },
    {
        "source_sentence": "如是等不可思議一切供養諸莊嚴具，如此世界四天下兜率天宮，一切寶莊嚴殿如意寶藏師子之座，",
        "translation": "All these inconceivable offerings and adornments were like the wish-granting jewel mine lion seat of the palace decorated with all kinds of jewels at the celestial palace of Tuṣita Heaven in the four quarters of the world.",
        "source": "T09n0278_013:0484c21_19"
    },
    {
        "source_sentence": "一切十方諸佛世界亦復如是。",
        "translation": "So it is with all the buddha worlds in the ten directions.",
        "source": "T09n0278_013:0484c23_20"
    },
    {
        "source_sentence": "◎大方廣佛華嚴經卷第十三",
        "translation": "Dafangguang fo huayan jing, vol. 13",
        "source": "T09n0278_013:0484c24_21"
    }
]