[
    {
        "source_sentence": "正法華經卷第四",
        "translation": "True Lotus Sutra, Volume 4",
        "source": "T09n0263_004:0088b19_0"
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, a translator of the Tripiṭaka of the Western Jin state of Yuezhi",
        "source": "T09n0263_004:0088b21_0"
    },
    {
        "source_sentence": "往古品第七",
        "translation": "The Seventh Chapter of the Ancients",
        "source": "T09n0263_004:0088b22_0"
    },
    {
        "source_sentence": "佛告諸比丘：「乃去往古久遠世時，不可計會無央數劫，有佛號大通眾慧如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "The Buddha said to the bhikṣus: Once long ago, in an immeasurable number of kalpas ago, there was a buddha named Mahāprajñāpāramitā-paripṛcchā(sūtra) called Mahāprajñ",
        "source": "T09n0263_004:0088b23_0"
    },
    {
        "source_sentence": "為佛、眾祐，世界曰大殖稼，劫名所在形色。",
        "translation": "For the sake of the Buddha and the multitude of blessings, the world is called Great Crops, and the eon is named where it's located in form.",
        "source": "T09n0263_004:0088b26_1"
    },
    {
        "source_sentence": "其佛說經不可稱限，譬如於是三千大千世界所有土地，有一士夫皆悉破碎此一佛國悉令如塵，",
        "translation": "It is as if all the lands in a great chiliocosm were to be completely destroyed by one individual and that single buddha-land were to become like dust.",
        "source": "T09n0263_004:0088b27_2"
    },
    {
        "source_sentence": "則取一塵，過東方如千佛界中塵之數國，乃著一塵。",
        "translation": "He then takes a speck of dust and goes east like the number of dust motes in a thousand buddha-realms, and he puts a speck of dust there.",
        "source": "T09n0263_004:0088b29_3"
    },
    {
        "source_sentence": "如是比類，復取一塵，越東如前佛界塵數，乃著一塵，悉使塵盡三千大千世界中塵，",
        "translation": "In the same way, a similar species takes another speck of dust and goes eastward as many times as there are atoms in the buddha-realm. Then it puts a speck of dust together to let all the atoms be extinguis",
        "source": "T09n0263_004:0088c01_4"
    },
    {
        "source_sentence": "令無有餘遍於東方，如是比類無量佛國。",
        "translation": "It causes it to pervade the east without remainder, thus resembling measureless buddha-lands like this.",
        "source": "T09n0263_004:0088c03_5"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T09n0263_004:0088c04_6"
    },
    {
        "source_sentence": "寧可稱限得諸佛界邊際不乎？」",
        "translation": "Wouldn't it be possible to praise the limits of the buddha-realm?",
        "source": "T09n0263_004:0088c04_7"
    },
    {
        "source_sentence": "比丘答曰：「不也。",
        "translation": "The monk answered, No.",
        "source": "T09n0263_004:0088c05_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T09n0263_004:0088c05_9"
    },
    {
        "source_sentence": "不也。",
        "translation": "No, it's not.",
        "source": "T09n0263_004:0088c05_10"
    },
    {
        "source_sentence": "安住！」",
        "translation": "Abiding calmly!",
        "source": "T09n0263_004:0088c05_11"
    },
    {
        "source_sentence": "佛言比丘：「如是等倫佛土諸數悠邈，猶如有人一一取塵著諸佛土，若干之限，",
        "translation": "The Buddha said to the bhikṣus: It is just as if a man were to take one piece of dust and put it in each of the buddha-lands, with certain limitations.",
        "source": "T09n0263_004:0088c06_0"
    },
    {
        "source_sentence": "諸佛國塵不可稱量，億百千姟兆載諸劫，欲知其佛滅度以來劫數長久，",
        "translation": "The dust of the buddha-lands cannot be measured, for hundreds of millions of trillions of eons. I want to know how many eons have passed since the parinirvāṇa of those buddhas.",
        "source": "T09n0263_004:0088c07_1"
    },
    {
        "source_sentence": "不可思議無量難測，大通眾慧道力示現，滅度以後法住劫數，亦復如是。」",
        "translation": "It's inconceivable, immeasurable, and difficult to fathom, manifested by the power of the path of great supernormal knowledge and wisdom, and so it will be likewise for eons when the Dharma abides after its cessation.",
        "source": "T09n0263_004:0088c09_2"
    },
    {
        "source_sentence": "「我念過去，　　無數億劫，　　時有如來，",
        "translation": "I remember that in the past, Countless millions of eons ago, There was a buddha there.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　兩足之尊，　　名大通慧，　　無極慈仁。",
        "translation": "The two-legged honored one is called Mahāprajñāpāramitā and has the utmost kindness.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　於時世尊，　　黎庶之上，　　比如皆取，",
        "translation": "Bhagavān, the Bhagavān, then, surpassed the common people, just like they all grasped it.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　此佛世界，　　悉破碎之，　　盡令如塵。",
        "translation": "These buddha worlds They completely shatter, Making all of them like dust.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　假使有人，　　一一取塵，　　過千佛界，",
        "translation": "Suppose someone were to take one particle of dust And go beyond a thousand buddha-realms.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　乃著一塵，　　如是次第，　　聖尊國土。",
        "translation": "They then touched a single particle of dust, which is thus arranged in order as the noble land.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　其人著塵，　　皆令悉遍，　　若干之數，",
        "translation": "That person's attachment to dust causes it to pervade them all, several times.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　悉令周普，　　世界眾限，　　有不可數。",
        "translation": "They cause them all to pervade many worlds, and there are limitless numbers of them.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　一切所有，　　大聖國土，　　諸所有塵，",
        "translation": "All that exists, the great sacred land, All the dust that exists",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　不可限量，　　皆悉破碎，　　令無有餘。",
        "translation": "They can't be limited, but all are completely destroyed, so that there's nothing left.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　大聖至尊，　　逝來如斯，　　其佛安住，",
        "translation": "The great sage, the supremely honored One, Has passed away like this. That buddha dwells peacefully.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　滅度已竟。　　劫數如是，　　無量億千，",
        "translation": "The number of kalpas after the parinirvāṇa has been completed Is as many as this, With immeasurable millions of koṭis.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　若欲料限，　　無能思議。　　滅度已來，",
        "translation": "If one wishes to calculate the limits, One cannot think of them.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　若干劫數，　　彼時導師，　　過久乃爾。",
        "translation": "After several eons, the Guide did so for a long time.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　諸弟子眾，　　及菩薩行，　　如來之慧，",
        "translation": "The disciples and bodhisattvas, As well as the practices of enlightening beings And the wisdom of buddhas,",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　巍巍如斯。　　今佛悉念，　　聖滅度來，",
        "translation": "The Buddha now remembers that the holy One has entered parinirvāṇa, And all sentient beings are like this.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　比丘欲知，　　佛之智慧，　　聖明普達，",
        "translation": "Monks, if you want to know The Buddha’s knowledge and wisdom, Your holy insight will penetrate everywhere.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　等無有異。　　佛皆覺了，　　過無數劫，",
        "translation": "They are the same, without any difference. The Buddhas all perceive them for countless eons.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "　不計微妙，　　無漏之誼。」",
        "translation": "They don't discriminate subtle, uncontaminated meanings.",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "世尊頌曰：佛告諸比丘：「其大通眾慧如來、正覺，壽四十四億百千劫，",
        "translation": "The World-honored One continued in verse: The Buddha said to the monks: The Tathāgata Mahāprajñāpāramitābhijñānābhibhū and the perfectly enlightened one have a life span of four, four, four, or",
        "source": "T09n0263_004:0088c11_3"
    },
    {
        "source_sentence": "以無上正真道，初昇道場坐于樹下一劫默然，至于二劫不得正覺，乃至十劫，",
        "translation": "Because of the unsurpassed true path, he first ascended to the site of enlightenment and sat quietly under a tree for an eon, remaining silent for two eons until he attained perfect enlightenment in ten eons.",
        "source": "T09n0263_004:0089a03_4"
    },
    {
        "source_sentence": "而不興起身不動搖，體不傾倚亦不自念，都無思想而向諸法，遂坐佛樹降魔官屬，",
        "translation": "Without rising or rising, his body didn't budge, his body didn't incline or lean, and he didn't think for himself. He directed his attention to all dharmas without thought, so he sat down at the Buddha's tree",
        "source": "T09n0263_004:0089a05_5"
    },
    {
        "source_sentence": "當成正覺。",
        "translation": "He'll become perfectly enlightened.",
        "source": "T09n0263_004:0089a07_0"
    },
    {
        "source_sentence": "忉利諸天子，化作大師子座，面四十里，佛坐其上。",
        "translation": "The Trāyastriṃśa gods transformed themselves into the lion seat of the great master, forty li in front, on which the Buddha sat.",
        "source": "T09n0263_004:0089a07_1"
    },
    {
        "source_sentence": "世尊坐定，諸梵天子普雨天華周四千里，自然風起吹放眾華，散于佛上。",
        "translation": "When the Bhagavān was sitting in meditation, the Brahma gods rained heavenly flowers 4,000 miles around, and a natural wind rose up and blew down all the flowers that swirled over the Buddha.",
        "source": "T09n0263_004:0089a08_2"
    },
    {
        "source_sentence": "佛在樹下滿十中劫，天華紛紛盡劫不絕。",
        "translation": "The Buddha stayed under a tree for the duration of ten intermediate kalpas, and the heavenly flowers continued to grow without cease throughout all those kalpas.",
        "source": "T09n0263_004:0089a10_3"
    },
    {
        "source_sentence": "又四天王及諸天子，作眾伎樂音如雷震，常以華香伎樂供養大聖，未曾休懈。」",
        "translation": "Also, the four heavenly kings and their celestial sons make all kinds of music like thunder and always offer flowers, incense, and music to the great sages without ever stopping.",
        "source": "T09n0263_004:0089a11_0"
    },
    {
        "source_sentence": "佛告比丘：「時世尊大通眾慧乃至十劫，逮成無上正真之道，為最正覺至于滅度，",
        "translation": "The Buddha said to the bhikṣus: At that time, the World-honored One possessed great supernormal knowledge and wisdom. For ten kalpas he mastered the supremely true path of enlightenment and became the foremost among those who awaken",
        "source": "T09n0263_004:0089a12_1"
    },
    {
        "source_sentence": "供養不懈。",
        "translation": "He doesn't make offerings without relying on them.",
        "source": "T09n0263_004:0089a14_2"
    },
    {
        "source_sentence": "其佛在家未捨國去，為太子時有十六子，端正殊好智慧難及，色像第一儒雅仁和。",
        "translation": "At home, the Buddha didn't leave his country and had sixteen sons when he was a prince, who were so beautiful and difficult to match in terms of their appearance and wisdom that they looked like the most Confucian and benevolent people.",
        "source": "T09n0263_004:0089a14_3"
    },
    {
        "source_sentence": "時十六國王子者，各各自有若干種樂，所居遊觀快不可言，種種顯現，",
        "translation": "Each of the princes of the sixteen kingdoms had various kinds of happiness. Their abodes, excursions, and pleasures were unspeakably many.",
        "source": "T09n0263_004:0089a16_4"
    },
    {
        "source_sentence": "琴瑟伎樂亦不可量。",
        "translation": "Their lute and music are also immeasurable.",
        "source": "T09n0263_004:0089a18_5"
    },
    {
        "source_sentence": "見佛世尊成最正覺，時有自然大法音聲，尋則棄國，捨轉輪王位、萬民、伎樂、諸欲之娛，",
        "translation": "When he saw that the Buddha, the World-honored One, had attained supreme perfect enlightenment, there was spontaneously a great voice of the Teaching. Then he abandoned his kingdom and renounced the throne of universal sovereignty",
        "source": "T09n0263_004:0089a18_6"
    },
    {
        "source_sentence": "眷屬圍繞，及諸聖賢大響帝王百千之數，并不可計億百千姟群萌之類營從集會，",
        "translation": "They were surrounded by their retinues, as well as hundreds of thousands of saints and wise great reverberating kings. It was not possible to count the millions or hundreds of thousands of living beings who had gathered in this assembly",
        "source": "T09n0263_004:0089a20_7"
    },
    {
        "source_sentence": "往詣世尊所處道場，欲得稽首奉受佛教。",
        "translation": "He went to the place where the Bhagavān was staying at the site of enlightenment, wanted to pay homage and accept the Buddha's teaching.",
        "source": "T09n0263_004:0089a22_8"
    },
    {
        "source_sentence": "「『大通眾慧，　　極尊無上，　　積累平等，",
        "translation": "Greatly endowed with all kinds of wisdom, supremely honored and unsurpassed, he accumulates it equally.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　無量億數，　　以上妙誼，　　愍傷一切，",
        "translation": "Countless millions of myriadstical koṭis Of the above-mentioned sublime virtues, Whose compassion hurts all.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　所願具足，　　於是賢聖。　　修勤苦行，",
        "translation": "Their aspirations are fulfilled, so the wise and saintly practice diligently and painstakingly.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　竟十中劫，　　專精一心，　　處在一座，",
        "translation": "Throughout the whole of the ten intermediate kalpas, he concentrated his mind on concentration and remained in one place.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　其身清淨，　　而不動搖，　　燒諸苦患，",
        "translation": "Their bodies are pure, unmoving, burning with pain and suffering.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　如拔樹根。　　分別于心，　　而志湛泊，",
        "translation": "It’s like pulling out the roots of a tree, Distinctly discriminating in one’s mind And with lofty aspiration.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　未曾進退，　　亦不傾倚，　　無有增減，",
        "translation": "They never advance or retreat, Nor do they incline or lean. There is no increase or decrease.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　默然而應，　　究竟寂定，　　無有諸漏。",
        "translation": "He remained silent and replied, In the ultimate stillness of concentration, Without any contaminants.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　現在吉祥，　　常獲大安，　　無想著故，",
        "translation": "Auspicious in the present, he always attains great peace Because he has no attachment.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　得尊佛道。　　我等見之，　　增智無畏，",
        "translation": "They will attain the supreme buddha path. We see them, Increase our knowledge and fearlessness,",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　如是比類，　　長益德義。　　不計身命，",
        "translation": "Such is the meaning of accumulating virtue, without calculating body or life.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　皆斷苦患，　　積累忍辱，　　不貪安樂。",
        "translation": "They all stop suffering and distress, accumulate forbearance, and don't crave comfort.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　分別道慧，　　不處惱痛，　　號在閑居，",
        "translation": "Discriminating wisdom of the path, he doesn’t experience pain or distress, wailing in a quiet retreat.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　興發精進。　　其不篤信，　　諸佛音聲，",
        "translation": "They give rise to the aspiration for enlightenment, But they do not believe in it. The voices of the Buddhas are heard everywhere.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　長夜增益，　　惡道之罪，　　則失人身，",
        "translation": "For a long time the blameworthiness of evil deeds increases, And then they lose their bodies.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　墮落惡趣，　　為一切世，　　所見謗毀。",
        "translation": "They'll fall into bad destinies, and all the worlds will see them and disparage them.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　今以逮見，　　世之聖父，　　其道最上，",
        "translation": "Now that you have attained insight, You are the holy father of the world. The path leading to enlightenment is supreme.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　無有眾漏。　　於此世間，　　而見救護，",
        "translation": "In this world They see salvation, And they do not think of it as anything but the obstacles.",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "　　及諸過去，　　大聖導師。』」",
        "translation": "And the great sages and guides of the past.'",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "群從僉然雍雍肅肅，稽首佛足繞佛三匝却住一面，以偈頌曰：佛告比丘：「斯諸帝王及諸太子，",
        "translation": "They bowed their heads at the Buddha’s feet, circumambulated him three times, and withdrew to one side. The Buddha said in verse:",
        "source": "T09n0263_004:0089a23_9"
    },
    {
        "source_sentence": "太子兄弟年既幼少，嗟歎稱譽大通眾慧如來、至尊、等正覺，以此雅頌宣揚已竟，",
        "translation": "As the prince and his brothers were young, they admired and praised the Tathāgata Mahābhijñānābhibhū Samantabhadra, the supreme sage, and the perfectly enlightened one. Having uttered these elegant verses",
        "source": "T09n0263_004:0089b16_10"
    },
    {
        "source_sentence": "啟勸世尊，願說經法安住分別，多所安隱多所愍傷，饒益眾生安諸天人。",
        "translation": "Encouraging the Bhagavān, he wishes to explain the sūtras and teachings so that they can be well-maintained and discerned, where there's much peace and much sorrow, benefiting sentient beings and bringing peace to gods",
        "source": "T09n0263_004:0089b18_11"
    },
    {
        "source_sentence": "「『惟願大聖，　　讚說經典，　　開化眾生，",
        "translation": "'May the great sage praise the sūtras and enlighten sentient beings.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　發起黎庶。　　三界群萌，　　悉共渴仰，",
        "translation": "All the sentient beings of the three realms shared the same aspiration and reverence.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　使建道意，　　皆令蒙度。",
        "translation": "I want to establish the intention for enlightenment, and I'll make them all be liberated.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　諸佛普大聖，　　百福法莊嚴，",
        "translation": "All buddhas are universally great sages, Adorned with a hundred blessings and teachings.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　無極仙逮獲，　　慧則最尊妙。",
        "translation": "The supreme sage apprehends it, and his wisdom is the most honored and marvelous.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　為諸天講法，　　及世間人民，",
        "translation": "He teaches the Dharma for gods and the people of the world.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　度脫我等類，　　普及諸群萌。",
        "translation": "The liberation of self and so forth universally pervades all sentient beings.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　應時彰現露，　　如來之慧誼，",
        "translation": "It should be revealed at the right time, Revealing the wisdom of the enlightened.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　猶如今於此，　　顯導上尊道。",
        "translation": "It's like presently manifesting the path of the most honored one here.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　令諸群品類，　　予等獲此法，",
        "translation": "I will cause all kinds of beings To attain this teaching.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　悉解於一切，　　諸行慧本末。",
        "translation": "They completely understand all The essence and derivative parts of conditioned wisdom.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　皆為分別說，　　前世所行德，",
        "translation": "They are all explained in a discriminating way as virtues practiced in the past.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　普見知黎庶，　　心本所好樂。",
        "translation": "They see and know all the common people, Their original inclinations and pleasures in their minds.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　則為轉法輪，　　最勝無等倫，",
        "translation": "Then, in order to turn the wheel of the Dharma, he's the most superior and peerless.",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "　　勉脫眾生厄，　　悉令至大道。』」",
        "translation": "They strive to liberate all sentient beings from their misery and cause them to reach the great path.'",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "復以此偈，而讚頌曰：佛告諸比丘：「於時世尊大通眾慧如來變化十方世界，",
        "translation": "Again, he composed these verses in praise: The Buddha said to the monks: At that time the Bhagavat, the Tathāgata Mahābhijñānāprasthāna, manifested his magical emanations throughout all the worlds of the ten direction",
        "source": "T09n0263_004:0089b20_12"
    },
    {
        "source_sentence": "各各五百億百千佛土六反震動，光明普照無所不周，皆於一切諸佛境界，",
        "translation": "Each of these buddha-lands, five hundred myriads of koṭis of buddha-lands, shook in six ways; their light illumined everywhere without exception, reaching as far as the realm of all buddhas.",
        "source": "T09n0263_004:0089c08_13"
    },
    {
        "source_sentence": "虛空大神若干種明，日月光耀遠照無極，尊無等倫，諸天宮殿館宇之明，",
        "translation": "The great space deities have various kinds of luminosity: the sun and moon shining far and wide, illumining infinitely. They are honored without peer. The palaces and buildings of the heavenly gods are as brilliant as those of all the",
        "source": "T09n0263_004:0089c09_14"
    },
    {
        "source_sentence": "梵天往返自然威曜，其佛變現瑞應光明，皆覆蔽之悉令不現。",
        "translation": "When the Brahmadeva gods come and go, they naturally shine with majestic majesty, and their buddhas manifest miraculous signs and light beams that cover them all and prevent them from appearing.",
        "source": "T09n0263_004:0089c11_15"
    },
    {
        "source_sentence": "天上世間晃昱暉曜，眾生品類若生彼界，皆相見知各自說言：『此間今日卒有人生，",
        "translation": "The celestial beings in the heavenly realm shine brightly, and if any sentient being were to be born in that realm, they would all see each other and tell each other, saying, 'Today there's a sudden birth here.",
        "source": "T09n0263_004:0089c13_16"
    },
    {
        "source_sentence": "時於天上震動所現，靡不周遍。』",
        "translation": "It's then manifested by the earthquake in heaven, and it doesn't reach anywhere.'",
        "source": "T09n0263_004:0089c15_17"
    },
    {
        "source_sentence": "「爾時東方佛土邊無限億百千梵天宮殿，自然為明威曜巍巍。",
        "translation": "At the time, there were countless billions of hundreds of thousands of Brahma heavenly palaces at the edge of the Buddha's land in the east, which naturally illuminated the majestic and majestic for its majesty.",
        "source": "T09n0263_004:0089c16_0"
    },
    {
        "source_sentence": "諸梵自念：『無數梵宮宮殿館宇[火*霍]明，無所不接，有何瑞應而現斯變？』",
        "translation": "The Brahmas thought to themselves, 'There are countless Brahma palaces, palaces, buildings, and [fire*ho] lights that don't touch anything, so what is the miraculous response that produces these transformations?'",
        "source": "T09n0263_004:0089c17_1"
    },
    {
        "source_sentence": "於時五百世界諸億百千大梵天眾，各從宮殿雲集而會。",
        "translation": "At the time, there were hundreds of millions of hundreds of thousands of great Brahma gods in the five hundred worlds, each gathered from their palaces and clouds to assemble.",
        "source": "T09n0263_004:0089c19_0"
    },
    {
        "source_sentence": "「『今日我等，　　宮殿室宅，　　諸賢當知，",
        "translation": "'Today we are in our palaces and houses. You should know, venerable friends,",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "　　此大光明，　　諸天最勝，　　志所樂喜。",
        "translation": "This great ray of light is supreme among the gods, Delighted and delighted by all.",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "　　以何因緣，　　現此瑞應？　　善哉當往，",
        "translation": "What is the reason for this miraculous appearance?",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "　　趣求斯誼。』　　時諸天子，　　今日自興：",
        "translation": "I wish to seek this opportunity.” The celestial beings then arose today, saying:",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "　『承何聖旨，　　現神如是，　　今所覩見，",
        "translation": "'Inherent is the noble teaching that the manifesting spirits are like this, which we see now.",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "　　本未曾有，　　親近諸天，　　為人中王，",
        "translation": "Formerly unprecedented, he was intimate with the gods and became the king among men.",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "　　將無大聖，　　興出于世，　　最妙光明，",
        "translation": "There will be no great sage Who emerges in the world, The most sublime light.",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "　　照于十方，　　所變感動，　　乃如是乎？』」",
        "translation": "Is this the kind of transformation that illuminates the ten directions and moves them?'",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "時於眾中有大梵天號護群生，為諸梵天，而歎頌曰：佛告諸比丘：「時五百世界億百千姟梵天，",
        "translation": "In the midst of the assembly, there were great Brahma gods crying out to protect sentient beings. For the sake of the Brahma gods, they praised and sang these verses: The Buddha addressed the monks, At that time five hundred",
        "source": "T09n0263_004:0089c20_1"
    },
    {
        "source_sentence": "悉共相和從東方來，遙見西方大通眾慧如來、正覺，處於道場在菩提樹下坐師子床。",
        "translation": "They all came from the east together in harmony, and from a distance they saw Mahāprajñāpāramitā-saṃjñānôttara Tathāgata and Right Enlightenment of the West sitting on a lion seat at the",
        "source": "T09n0263_004:0090a01_2"
    },
    {
        "source_sentence": "諸天、龍、神、阿須倫、迦留羅、真陀羅、摩休勒，人與非人，及十六子，",
        "translation": "The gods, dragons, spirits, asuras, garuḍas, nāgas, mahūrtas, humans, nonhumans, and the sixteen sons.",
        "source": "T09n0263_004:0090a03_3"
    },
    {
        "source_sentence": "眷屬圍繞，適覩是已，悉共啟勸欲令說經。",
        "translation": "Surrounded by their retinues, they were all encouraged to explain the sūtras.",
        "source": "T09n0263_004:0090a05_4"
    },
    {
        "source_sentence": "即詣如來稽首于地，繞佛無數匝，執其蓮華如大須彌，及散佛樹，樹高四十里，",
        "translation": "He then approached the Buddha, bowed his head at the ground, circumambulated him innumerable times, held the lotus blossoms as high as a great polar mountain, and scattered the buddha-trees, forty li",
        "source": "T09n0263_004:0090a06_5"
    },
    {
        "source_sentence": "普已本土梵天宮殿，奉進世尊，惟願哀愍納受宮殿華土之供。",
        "translation": "All the palaces of the Brahma gods in my native land were offered to the Bhagavān, wishing to take pity on him and accept the offerings of flowers and earth from his palace.",
        "source": "T09n0263_004:0090a08_6"
    },
    {
        "source_sentence": "「『見佛無量，　　得未曾有，　　多所愍傷，",
        "translation": "'Seeing the Buddha's immeasurability is unprecedented, and many people are saddened by it.",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "　　興出于世。　　世尊所演，　　如師子吼，",
        "translation": "What the World-honored One teaches is like the roar of a lion’s lion.",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "　　則已將護，　　十方黎庶。　　我等經歷，",
        "translation": "Then we will protect the common people of the ten directions.",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "　　所從來處，　　去此五百，　　億百千界。",
        "translation": "The place where they came from Is five hundred myriads of koṭis of worlds Beyond this.",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "　　計諸世界，　　若干之類，　　皆棄宮殿，",
        "translation": "All the various kinds of worlds, Various in number, They abandoned their palaces.",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "　　咸詣聖尊，　　一切皆是，　　宿命淨德，",
        "translation": "They all went to the holy honored One, All of them pure virtues of past lives.",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "　　若干麗妙，　　諸寶宮殿。　　惟加臨眄，",
        "translation": "There are various beautiful and marvelous buildings, All adorned with the finest jewels.",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "　　而居其中，　　願發大哀，　　愍傷受之。』」",
        "translation": "He stayed there, wishing to give rise to great compassion and feeling pity for them.'",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "以偈頌讚曰：佛告諸比丘：「時大梵天眾面讚歎佛，五百人俱白世尊曰：『願轉法輪演大聖典，",
        "translation": "The Buddha then said to the monks: At that time the great Brahmadeva gods praised the Buddha on all their faces. All five hundred bhikṣus asked the World-honored One:",
        "source": "T09n0263_004:0090a09_7"
    },
    {
        "source_sentence": "勉濟群黎使獲滅度。』",
        "translation": "I'll strive to help the masses so that they attain liberation.'",
        "source": "T09n0263_004:0090a20_8"
    },
    {
        "source_sentence": "「『世尊願說經，　　兩足上分別，",
        "translation": "'The Bhagavān wishes to teach the sūtras, distinguishing them by two feet.",
        "source": "T09n0263_004:0090a21_9"
    },
    {
        "source_sentence": "　　當現慈心力，　　度眾勤苦患。』」",
        "translation": "You will show the power of your compassionate mind to save all suffering and distress.'",
        "source": "T09n0263_004:0090a21_9"
    },
    {
        "source_sentence": "時五百梵天億百千眾，合一音聲，而歎頌曰：佛告諸比丘：「于時世尊，",
        "translation": "Hundreds of millions of people in the five hundred great Brahma heavens sang these verses in unison: The Buddha said to the monks, “O Bhagavat!",
        "source": "T09n0263_004:0090a21_9"
    },
    {
        "source_sentence": "見諸梵天所上宮殿，默然受之。",
        "translation": "Seeing the palaces of the Brahma gods, he accepted them in silence.",
        "source": "T09n0263_004:0090a25_10"
    },
    {
        "source_sentence": "爾時東南方去是五百億百千世界諸梵天眾，各各自從宮殿皆見光明，晃晃鑠鑠無不周接，",
        "translation": "At that time in the southeast, five hundred myriads of koṭis of Brahmā heavenly beings from as many worlds as atoms in fifty buddha-fields each saw a ray of light emanating from their respective celestial",
        "source": "T09n0263_004:0090a26_11"
    },
    {
        "source_sentence": "怪未曾有。",
        "translation": "That's strange and unprecedented.",
        "source": "T09n0263_004:0090a28_12"
    },
    {
        "source_sentence": "「『諸大天當知，　　此則本瑞應，",
        "translation": "'O great gods, you should know that this is the original auspicious sign.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　宮殿悉感動，　　最有大名聞。",
        "translation": "The palace is all moved, and the most renowned one has great fame.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　有德諸天子，　　人人雲集此，",
        "translation": "Virtuous celestial beings and gods, All gathered here like clouds of people.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　則是其威神，　　令宮殿巍巍。",
        "translation": "This is the mighty spirit that makes the palace so lofty and majestic.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　今佛興于世，　　兩足之中尊，",
        "translation": "Now the Buddha has arisen in the world, honored among two-legged buddhas.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　所以令館宇，　　現光明如是。",
        "translation": "That's why it causes the hall to show its light like this.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　吾等當往質，　　斯事不可妄，",
        "translation": "We should go there to investigate this matter. This cannot be falsely done.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　從昔至于今，　　覩瑞無若茲。",
        "translation": "From the past up to the present, there's nothing like this in terms of debilitating auspiciousness.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　四方有光明，　　至于億國土，",
        "translation": "In all directions there is light, reaching as far as billions of lands.",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "　　今有定至誠，　　佛當成於世。』」",
        "translation": "Now that there's a certainty of sincerity, the Buddha will become a buddha in the world.'",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "悉俱集會，於眾會中有大梵天，號最慈哀，為諸梵天而歎頌曰：佛告諸比丘，",
        "translation": "At that assembly, the great brahma gods called most compassionate and sympathetic were present. For the sake of the brahma gods they composed these verses: The Buddha said to the monks:",
        "source": "T09n0263_004:0090a28_13"
    },
    {
        "source_sentence": "時五百億百千梵天，各從宮殿駱驛四出，以諸天華如須彌山，詣西北角，",
        "translation": "At that time five hundred myriads of koṭis of brahma celestial beings each came out in four directions from their palaces on a cakravartin’s carriage and, bringing heavenly flowers like the polar mountain with them,",
        "source": "T09n0263_004:0090b12_14"
    },
    {
        "source_sentence": "遙見如來大通聖慧處于道場，於佛樹下坐師子座。",
        "translation": "From a distance, he saw the Tathāgata Mahāprajñāpāramitā and his holy wisdom at the site of enlightenment, seated on a lion's seat under a buddha tree.",
        "source": "T09n0263_004:0090b14_0"
    },
    {
        "source_sentence": "諸天、龍、神、阿須倫、迦留羅、真陀羅、摩休勒眷屬圍繞，而為說經法。",
        "translation": "Surrounded by gods, dragons, spirits, asuras, garuḍas, mahoras, and mahūrya retinues, they explain the teachings of the sūtras for them.",
        "source": "T09n0263_004:0090b15_1"
    },
    {
        "source_sentence": "適見佛已尋時即往，稽首于地繞無數匝，手執大華而散佛上。",
        "translation": "When he saw the Buddha, he looked for him and departed. He bowed his head at the ground, circumambulated him countless times, and scattered a great flower in his hand over the Buddha.",
        "source": "T09n0263_004:0090b16_2"
    },
    {
        "source_sentence": "「『禮無等倫，　　則為大仙，　　天中之天。",
        "translation": "Rituals are unequaled, and they become great sages or gods among gods.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　聲如哀鸞，　　唱導普護，　　諸天人民，",
        "translation": "Their voices are like the sound of a lamenting luan, Teaching and guiding all beings everywhere.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　願稽首禮。　　愍傷世俗，　　得未曾有，",
        "translation": "May I bow my head in homage, pitiing the world for this unprecedented sorrow.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　在在難值，　　久思光顏，　　今日乃見。",
        "translation": "While it's hard to meet him, I've long thought of his radiant countenance, and today I'll see him.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　本於百劫，　　積德解空，　　八十億佛，",
        "translation": "Originally, over a hundred eons They accumulated virtue and liberation from emptiness. Eighty koṭis of buddhas A Forest of Pearls from the Dharma Garden, Volume I",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　壽如塵劫。　　又人中尊，　　分別空慧，",
        "translation": "The duration of life is as long as the cosmic age.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　而常講說，　　善權方便。　　諸天群臣，",
        "translation": "He always taught the Dharma using skillful means. The celestial beings and ministers,",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　人民得覲，　　具足億姟，　　八十之數。",
        "translation": "The people will be able to see and pay their respects, Eighty-eight hundred koṭis in number.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　其眼徹見，　　在所救濟，　　多所擁護，",
        "translation": "Their eyes penetrate and see everywhere. They rescue those who need to be rescued, And many of them are protected.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　於佛道法。　　故出于世，　　愍傷眾庶，",
        "translation": "In the Buddha’s path of enlightenment He appeared in the world out of compassion for all living beings.",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "　　我等福會，　　甚難值遇。』」",
        "translation": "It's very difficult for us to meet in a blessed assembly.'",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "時大梵天及諸眷屬，以頌讚曰：佛告諸比丘：「無數億千梵天之眾，勸發世尊願轉法輪，",
        "translation": "The great Brahmā gods and their retinues then praised him in verse, saying, The Buddha addressed the monks, Countless millions of billions of Brahmā gods urged the Bhagavān to wish to turn the wheel of the Dharma",
        "source": "T09n0263_004:0090b18_3"
    },
    {
        "source_sentence": "演出典誼散告群生，救脫三界令獲安隱。",
        "translation": "He manifested his heroic spirit and scattered the message to sentient beings, liberating them from the three realms and enabling them to attain peace.",
        "source": "T09n0263_004:0090c02_4"
    },
    {
        "source_sentence": "「『最上大人，　　願轉法輪，　　惟講經典，",
        "translation": "'The supreme great man wishes to turn the wheel of the Dharma, but he only teaches the sūtras.",
        "source": "T09n0263_004:0090c04_0"
    },
    {
        "source_sentence": "　　為十方人。　　度脫羣萌，　　苦惱之患，",
        "translation": "For the sake of sentient beings in the ten directions, he liberates them from the afflictions of suffering and anguish.",
        "source": "T09n0263_004:0090c04_0"
    },
    {
        "source_sentence": "　　令一切人，　　喜踊亘然。　　其有聞者，",
        "translation": "It causes all people To be overwhelmed with joy. Any who hear it,",
        "source": "T09n0263_004:0090c04_0"
    },
    {
        "source_sentence": "　　得成佛道，　　諸天人民，　　咸蒙安隱。",
        "translation": "Attaining the buddha path, gods and people will all attain peace.",
        "source": "T09n0263_004:0090c04_0"
    },
    {
        "source_sentence": "　　阿須倫身，　　當復減損，　　施于忍辱，",
        "translation": "The body of the asuras will again be reduced, and they'll bestow forbearance.",
        "source": "T09n0263_004:0090c04_0"
    },
    {
        "source_sentence": "　　安隱之事。』」",
        "translation": "It's a peaceful thing.'",
        "source": "T09n0263_004:0090c04_0"
    },
    {
        "source_sentence": "「爾時諸梵天悉俱等心，同聲讚曰：佛告諸比丘：「大通眾慧如來默然可之。",
        "translation": "At that point, the Brahma gods were all equally mindful and praised it with one voice, saying, The Buddha told the monks, The Tathāgata of Mahāprajñāpāramitā's wisdom is silent and allows them to do so.",
        "source": "T09n0263_004:0090c04_0"
    },
    {
        "source_sentence": "南方、西方億百千姟諸佛世界，諸大梵天宮殿館宇悉為普明，弈弈煌煌靡不周達。",
        "translation": "To the south and to the west of the billions of hundreds of thousands of buddha worlds in the ten directions, the palaces and buildings of the great Brahma heavens are all universally shining, as well as the blazing glory of play and",
        "source": "T09n0263_004:0090c11_1"
    },
    {
        "source_sentence": "時諸梵天，自見宮殿威變煜爚，怪未曾有。",
        "translation": "The Brahma gods then saw for themselves the palace's majestic and marvelous appearance, which was unprecedented.",
        "source": "T09n0263_004:0090c13_2"
    },
    {
        "source_sentence": "悉俱集會，各自念言：『我等宮殿何乃如之？』",
        "translation": "They all gathered together and each thought, 'How could our palaces be like this?'",
        "source": "T09n0263_004:0090c14_3"
    },
    {
        "source_sentence": "「『大聖而興，　　所舉不妄，　　一切宮殿，",
        "translation": "'The great sage arises and what he raises isn't false, and all the palaces",
        "source": "T09n0263_004:0090c15_4"
    },
    {
        "source_sentence": "　　威光重照。　　有此瑞應，　　現于世間，",
        "translation": "The majestic light shines brightly, and this divine sign appears in the world.",
        "source": "T09n0263_004:0090c15_4"
    },
    {
        "source_sentence": "　　善哉行求，　　如斯奧誼。　　過去無數，",
        "translation": "Good is the practice and pursuit of such mysterious meanings, which are countless in the past.",
        "source": "T09n0263_004:0090c15_4"
    },
    {
        "source_sentence": "　　億千諸劫，　　未曾覩見，　　如是感動。",
        "translation": "For billions of koṭis of kalpas I have never seen anything like this.",
        "source": "T09n0263_004:0090c15_4"
    },
    {
        "source_sentence": "　　將以如來，　　出現于世，　　令諸天子，",
        "translation": "It will be because the Tathāgata Will appear in the world, Causing the celestial beings to",
        "source": "T09n0263_004:0090c15_4"
    },
    {
        "source_sentence": "　　自然來會。』」",
        "translation": "They'll naturally come together.'",
        "source": "T09n0263_004:0090c15_4"
    },
    {
        "source_sentence": "於其眾中有大梵天，名曰善法，獨歎頌曰：佛告諸比丘：「時五百百千億諸梵天人，",
        "translation": "Among those in the assembly, there was a great brahma god named Sunetra. He alone praised and composed these verses: The Buddha addressed the monks, “At that time five hundred thousand myriads of koṭis of",
        "source": "T09n0263_004:0090c15_4"
    },
    {
        "source_sentence": "從其所處，遙見大華如須彌山，各手執持眾供養具行詣北方，瞻覲如來大通眾慧佛處于道場，",
        "translation": "From that place they saw from afar great flowers as high as the polar mountain. Each of them carried their offerings in their hands and proceeded toward the north, where they gazed at the buddha-field of enlightenment to see the Buddha Mahāprajā",
        "source": "T09n0263_004:0090c23_5"
    },
    {
        "source_sentence": "坐樹下師子座上，與無央數諸天、龍、神、阿須倫、迦留羅、真陀羅、摩休勒眷屬圍繞，",
        "translation": "He sat on the lion seat at the foot of a tree, surrounded by innumerable gods, dragons, devas, asuras, garuḍas, mahoragas, and mahinīputras.",
        "source": "T09n0263_004:0090c26_6"
    },
    {
        "source_sentence": "講說經法。",
        "translation": "He taught the sūtras and teachings.",
        "source": "T09n0263_004:0090c27_7"
    },
    {
        "source_sentence": "即詣佛所，稽首于地繞無數匝，手執大華如須彌山，供養散佛。",
        "translation": "He then approached the Buddha, bowed his head at the ground, circumambulated him countless times, held a large flower like Mount Sumeru in his hand, and offered support to Saṃbuddha.",
        "source": "T09n0263_004:0090c28_8"
    },
    {
        "source_sentence": "尋以宮殿奉上世尊，惟願愍傷受而處之。",
        "translation": "He then presented the palace to the Bhagavān, wishing to take pity on him and place him there.",
        "source": "T09n0263_004:0090c29_9"
    },
    {
        "source_sentence": "「『諸佛現世，　　甚難得值，　　久不瞻覩，",
        "translation": "'The buddhas are so rare to meet in the world that they won't be seen for a long time.",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　今日乃覲。　　僥倖來至，　　蠲除愛欲，",
        "translation": "Today I am going to see you. By good fortune I have come and seen you, Having abandoned cravings and desires.",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　具足充滿，　　於三千剎。　　諸大導師，",
        "translation": "In 3,000 buddha-lands the great Guides are endowed with knowledge.",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　飽滿饑虛，",
        "translation": "They are filled with hunger and thirst,",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　古來至今，　　未曾見聞。　　如靈瑞華，",
        "translation": "Since ancient times I have never seen or heard such a sight, Just like the miraculous flower.",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　尠可遭值，　　道慧難遇，　　時時乃有。",
        "translation": "It's rare to meet a monk, and it's difficult to meet the path and wisdom, so it happens from time to time.",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　我等宮殿，　　雅麗無量，　　承佛威神，",
        "translation": "Our palaces are immeasurable in their splendors, Influenced by the power of buddhahood.",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　而得獲此。　　唯垂大哀，　　納受所進，",
        "translation": "I am greatly saddened to have received this gift, accepting it.",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "　　願處其中，　　顯現道因。』",
        "translation": "Wherever he wishes to be, he reveals the causes of the path.'",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "時諸梵天等心同聲，而歎頌曰：「時諸梵天勸請世尊，惟轉法輪分別經典，",
        "translation": "The Brahmā gods then spoke these verses in unison, exhorting the World-honored One:",
        "source": "T09n0263_004:0091a01_10"
    },
    {
        "source_sentence": "令諸天神沙門梵志，多所愍傷普安一切，天上世間悉當蒙恩。",
        "translation": "That will cause the gods, goddesses, ascetics, and priests to be saddened by their many sorrows and bring peace to all of them, and the gods and goddesses in the heavenly realm will all be blessed",
        "source": "T09n0263_004:0091a13_0"
    },
    {
        "source_sentence": "「『倖願世尊，　　廣演經典，　　加哀當轉，",
        "translation": "'May the Bhagavān explain the sūtras in detail, and his compassion will turn.",
        "source": "T09n0263_004:0091a14_1"
    },
    {
        "source_sentence": "　　大聖法輪。　　講若干法，　　聲若雷震，",
        "translation": "The great holy wheel of the Dharma teaches various teachings, With sounds like thunder and lightning.",
        "source": "T09n0263_004:0091a14_1"
    },
    {
        "source_sentence": "　　惟願愍傷，　　吹大法螺。　　以大經典，",
        "translation": "I entreat you, O goddess, to blow the great conch of the Dharma With compassion and pity.",
        "source": "T09n0263_004:0091a14_1"
    },
    {
        "source_sentence": "　　雨於世界，　　分別善教，　　微妙之誨。",
        "translation": "It rains down on the world, discerning good teachings and subtle instructions.",
        "source": "T09n0263_004:0091a14_1"
    },
    {
        "source_sentence": "　　我等勸助，　　願講道慧，　　開度眾生，",
        "translation": "We are encouraged, wishing to teach the path and wisdom, To enlighten sentient beings.",
        "source": "T09n0263_004:0091a14_1"
    },
    {
        "source_sentence": "　　億百千姟。』",
        "translation": "billions of hundreds of thousands of arrows.'",
        "source": "T09n0263_004:0091a14_1"
    },
    {
        "source_sentence": "於是梵天與群侍俱，等心同聲，而歎頌曰：「西南方、西北方、東北方，",
        "translation": "The Brahmadeva gods and their attendants, all in unison, then composed the following hymns of praise: To the southwest, to the northwest, and to the northeast.",
        "source": "T09n0263_004:0091a14_1"
    },
    {
        "source_sentence": "各各如是，無數梵天不可計限。",
        "translation": "Each one is like this, and there are countless Brahmā gods that can't be counted.",
        "source": "T09n0263_004:0091a22_2"
    },
    {
        "source_sentence": "上方下方各各如是，自在宮殿，覩見光明靡不周接，怪之未有。",
        "translation": "Each of the above and below is like this, with their own independent palace, which has an unobstructed shining light that reaches everywhere in all directions, but there's no wonder it doesn't exist.",
        "source": "T09n0263_004:0091a23_3"
    },
    {
        "source_sentence": "各從斯去五百億百千世界諸梵天眾，各捨宮殿來詣佛所。",
        "translation": "From here, the Brahma gods of five hundred myriads of koṭis of worlds each left their palaces and came to the Buddha.",
        "source": "T09n0263_004:0091a24_4"
    },
    {
        "source_sentence": "「『善哉願諸佛，　　世吼獲聖明，",
        "translation": "'Good, may the buddhas of the world roar and attain holy insight!",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　為三界眾生，　　開示正覺乘。",
        "translation": "For the sake of sentient beings in the three realms, he teaches the vehicle of right awakening.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　普為世間眼，　　達見於十方，",
        "translation": "They are the universal eye of the world, Seeing in all directions.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　開通甘露門，　　度脫無數人。",
        "translation": "He opens the gate of ambrosia and liberates countless people.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　乃昔往古世，　　人中尊變現，",
        "translation": "Formerly, from ancient times long ago, The most honored among men manifested his transformations.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　空無思想念，　　使現於十方。",
        "translation": "Emptiness, without thought or thought, Is manifest in the ten directions.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　長益樂地獄，　　好憙畜生處，",
        "translation": "They live in the hell of bliss for a long time, Pleasantly clinging to the animal kingdom.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　後生墮餓鬼，　　億數難思議。",
        "translation": "Subsequent beings will fall into the realm of hungry ghosts, Inconceivable millions in number.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　亡失於天身，　　壽終墮惡趣，",
        "translation": "They die in the heavenly body, and at the end of their life they fall into a bad destiny.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　若得聽佛法，　　進獲平等道。",
        "translation": "If someone hears the Buddha's teaching, they'll advance to the equal path.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　志行趣佛慧，　　將護眾黎庶，",
        "translation": "They are determined to practice the Buddha’s wisdom And will protect all living beings.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　皆得歸安隱，　　不失快樂想。",
        "translation": "They'll all attain peace and don't lose their thoughts of happiness.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　常不行佛道，　　不處於正法，",
        "translation": "They always do not practice the path of enlightenment And do not abide in the true teaching.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　違無量聖教，　　即墮於惡趣。",
        "translation": "To disobey measureless noble teachings, they'll fall into a bad destiny.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　覩見世光明，　　以善故來至，",
        "translation": "Seeing the light of the world, Sudhana came there because he thought it was good.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　發一切眾生，　　而行於慈哀。",
        "translation": "They give rise to all sentient beings And practice compassion.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　逮見於世尊，　　解空慧無漏，",
        "translation": "Having seen the World-honored One, Understanding emptiness and wisdom uncontaminated,",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　諸天及世間，　　于斯悉勸助。",
        "translation": "The gods and the world are all encouraged to help them.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　宮殿妙無量，　　猶如威神德，",
        "translation": "The palace is marvelous and immeasurable, Like the might of mystic virtue.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　普施明月珠，　　大導師願受。",
        "translation": "Give them all the bright moon pearl, and the great guide wishes to accept it.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　人尊願受供，　　愍傷幸宮殿，",
        "translation": "Venerable human beings wish to receive offerings, and they're pityingly honored in the palace.",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "　　令此群品類，　　逮得無上道。』」",
        "translation": "I'll cause these kinds of people to attain the unsurpassed path.'",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "有大梵天名曰妙識，即歎偈曰：佛告諸比丘：「於時五百百千億大梵天眾，",
        "translation": "There was a great brahma god named Marvelous Consciousness. He exclaimed in verse: The Buddha said to the monks, “At that time five hundred thousand myriads of koṭis of great Brahmā gods were gathering together",
        "source": "T09n0263_004:0091a26_5"
    },
    {
        "source_sentence": "讚歎佛已，啟勸令佛轉大法輪，開度十方安隱世人。",
        "translation": "After praising the Buddha, he encouraged him to turn the great wheel of the Dharma and liberated the peaceful people in the ten directions.",
        "source": "T09n0263_004:0091b20_6"
    },
    {
        "source_sentence": "「『思願講說，　　無上法輪，　　惟雷法鼓，",
        "translation": "「『思願講說, 無上法輪, 惟雷法鼓,",
        "source": "T09n0263_004:0091b22_7"
    },
    {
        "source_sentence": "　　尊妙法音。　　度脫眾生，　　勤苦之患，",
        "translation": "The voice of the supremely sublime Teaching liberates sentient beings from the pain and suffering of worldly existence.",
        "source": "T09n0263_004:0091b22_7"
    },
    {
        "source_sentence": "　　加哀示現，　　無為大道。　　我等勸助，",
        "translation": "With compassion we show the uncreated great path, And we encourage and assist them.",
        "source": "T09n0263_004:0091b22_7"
    },
    {
        "source_sentence": "　　唯聖說法，　　救護餘類，　　及世間人。",
        "translation": "Only the Āryan teaches the Dharma, rescuing and protecting others and worldly beings.",
        "source": "T09n0263_004:0091b22_7"
    },
    {
        "source_sentence": "　　音聲柔軟，　　敷揚美響，　　億百千劫，",
        "translation": "The sound is soft and gentle, And the sound spreads out beautifully. For billions of eons it has been like this:",
        "source": "T09n0263_004:0091b22_7"
    },
    {
        "source_sentence": "　　積累德行。』」",
        "translation": "They accumulate virtuous actions.'",
        "source": "T09n0263_004:0091b22_7"
    },
    {
        "source_sentence": "復歎頌曰：佛告諸比丘：「大通眾慧如來，爾時見十方無央數百千億眾生勸請說法，",
        "translation": "Again, he composed the following verse in praise: The Buddha said to the monks: When the Tathāgata Mahāprajñāpāramitābhijñānābhibhū was teaching the Dharma to immeasurable hundreds of thousands of myriads",
        "source": "T09n0263_004:0091b22_7"
    },
    {
        "source_sentence": "及十六子國王太子，轉大法輪三轉十二事，開化發起沙門梵志、諸天龍神、眾魔梵天及世人民，",
        "translation": "And the sixteenth prince, the king of the sixteen sons, turned the great wheel of the Dharma in three revolutions and twelve ways, enlightening renunciants and brahmins, gods, dragons, Māras, Brahmā gods",
        "source": "T09n0263_004:0091c01_8"
    },
    {
        "source_sentence": "為說苦本是為苦諦，至習盡道由是盡苦，苦盡至道，十二緣起具足分別，",
        "translation": "Why do you say that the root of suffering is the truth of suffering? Up to the arising of suffering and the path leading to its cessation are the reasons for the extinction of suffering. The extinction of suffering up to the path leading to its cess",
        "source": "T09n0263_004:0091c03_9"
    },
    {
        "source_sentence": "從癡致行，從行致識，從識致名色，從名色致六入，從六入致習，從習致痛，",
        "translation": "From delusion proceed volition; from volition proceed consciousness; from consciousness proceed name and form; from name and form proceed the six sense operations; from the six sense operations proceed perception; and from perception proceed pain.",
        "source": "T09n0263_004:0091c05_10"
    },
    {
        "source_sentence": "從痛致愛，從愛致受，從受致有，從有致生，從生致老病死憂苦大患。」",
        "translation": "From pain comes craving, from craving comes feeling, from feeling comes existence, from existence comes birth, and from birth comes old age, illness, death, sorrow, pain, and great suffering.",
        "source": "T09n0263_004:0091c07_11"
    },
    {
        "source_sentence": "又告比丘：「大通眾慧如來三說經法，須臾之頃分別此誼，令十六億百千姟眾漏盡意解，",
        "translation": "Again, the Buddha said to the bhikṣus: The Tathāgata Mahāprajāpatīyasamuccayani taught the Dharma of the threefold doctrine of the scriptures. In a single moment of thought he discerned these meanings so as to",
        "source": "T09n0263_004:0091c08_12"
    },
    {
        "source_sentence": "逮得六通三達之智，無央數人皆得度脫。",
        "translation": "He attained the knowledge of the six supernormal powers and three comprehensions, and countless people were liberated.",
        "source": "T09n0263_004:0091c10_13"
    },
    {
        "source_sentence": "如是至三，第四說經，江河沙等億百千姟群生聽經，一一皆獲漏盡意解，",
        "translation": "Thus, up to three times, the fourth teaches the sūtra, and hundreds of millions of sentient beings like rivers and sands listen to the sūtras, each attaining the understanding that their contaminants have ended.",
        "source": "T09n0263_004:0091c11_14"
    },
    {
        "source_sentence": "諸聲聞眾不可稱計。",
        "translation": "The śrāvakas can't be counted.",
        "source": "T09n0263_004:0091c13_15"
    },
    {
        "source_sentence": "「爾時十六國王太子，以家之信出家為道，皆為沙彌，聰明智慧多有方便，",
        "translation": "“At that time the princes of the sixteen kingdoms all renounced the householder’s life because they believed in renunciation and became śrāmaṇeras ( mendicants). Their intelligence and wisdom were endowed with skillful means",
        "source": "T09n0263_004:0091c14_0"
    },
    {
        "source_sentence": "以曾供養億百千佛，造立眾行，求無上正真道，俱白佛言：『今大會聲聞眾，",
        "translation": "Hundreds of thousands of myriads of koṭis of buddha-fields were formerly offered to them, and they established various practices in order to seek the supreme path of enlightenment. They all said to the Buddha:",
        "source": "T09n0263_004:0091c15_1"
    },
    {
        "source_sentence": "無央數億百千人，有大神足已具成就。",
        "translation": "There were countless millions of hundreds of millions of people with great miraculous abilities who had accomplished them.",
        "source": "T09n0263_004:0091c17_2"
    },
    {
        "source_sentence": "惟為我等，講演無上正真道誼，願弘慧見指示其處，當從如來學大聖教，",
        "translation": "May you, Great Wise One, show us where we should follow the Tathāgata and study the teachings of the Great Sage.",
        "source": "T09n0263_004:0091c18_3"
    },
    {
        "source_sentence": "以共勸進觀察其本。』",
        "translation": "They'll be encouraged together to examine their source.'",
        "source": "T09n0263_004:0091c19_4"
    },
    {
        "source_sentence": "於時世尊，悉見幼童國王太子心之所念，則為國王及諸眷屬講說經法，",
        "translation": "Then the World-honored One perceived that the princely prince Candracchattra had this thought in his mind and preached the Dharma for the sake of all the kings and their retinues.",
        "source": "T09n0263_004:0091c20_5"
    },
    {
        "source_sentence": "八十億百千姟人皆作沙門，於時彼佛觀諸沙門心之本原，為二萬劫說《正法華》方等經典，",
        "translation": "Eighty-eight koṭis of śramaṇas and hundreds of thousands of brāhmaṇas all became śramaṇas. At that time the Buddha observed the foundational principles of the minds of those śramaṇas and taught",
        "source": "T09n0263_004:0091c22_6"
    },
    {
        "source_sentence": "菩薩所行一切佛護，皆已周遍。",
        "translation": "All the buddhas and protectors practiced by enlightening beings have pervaded them.",
        "source": "T09n0263_004:0091c24_7"
    },
    {
        "source_sentence": "四部眾會普等無異，十六幼童沙彌兄弟，聞佛所說悉共受持，諷誦講讚。",
        "translation": "The fourfold assembly was universally equal, and the sixteen young boys and śrāmaṇer brothers heard what the Buddha taught, they all accepted it, chanted it, and recited it in praise.",
        "source": "T09n0263_004:0091c24_8"
    },
    {
        "source_sentence": "其佛授決，當得無上正真之道。",
        "translation": "That Buddha's teaching will lead to the attainment of the unsurpassed true path.",
        "source": "T09n0263_004:0091c26_9"
    },
    {
        "source_sentence": "說是經已聲聞歡喜，十六沙彌、無數億百千姟諸菩薩眾皆得本志。",
        "translation": "Having taught this sūtra, the śrāvakas rejoiced, and the sixteen śrāmaṇeras and countless millions of hundreds of thousands of bodhisattvas attained their original aspirations.",
        "source": "T09n0263_004:0091c27_10"
    },
    {
        "source_sentence": "彼佛說是，於八萬劫未曾休懈。",
        "translation": "That Buddha said this, and for 80,000 eons he never lasted.",
        "source": "T09n0263_004:0091c28_11"
    },
    {
        "source_sentence": "說斯經已，即入靜室精思閑定，四十萬劫三昧正受。",
        "translation": "After he taught this sūtra, he entered a quiet room to concentrate his mind in concentration for 40,000 eons of samādhi and meditative absorption.",
        "source": "T09n0263_004:0091c29_12"
    },
    {
        "source_sentence": "「爾時十六王子為沙彌者，行菩薩道本是佛子，覩見世尊獨處閑居，各各豫嚴法座，",
        "translation": "“At that time the sixteen princes were novices, all practicing the bodhisattva path originally for the sake of the Buddha’s disciples. Seeing the World-honored One living alone in seclusion, they each prepared their thro",
        "source": "T09n0263_004:0092a02_0"
    },
    {
        "source_sentence": "欲用敷演廣彼法誼。",
        "translation": "They want to use it to spread out the meaning of that teaching and expand its meaning.",
        "source": "T09n0263_004:0092a03_1"
    },
    {
        "source_sentence": "於時都會八萬四千劫分別說經，一一菩薩化度六十萬江河沙億百千姟，",
        "translation": "During the eighty-four thousand kalpas of that time, each bodhisattva taught and liberated six hundred million billions of myriads of koṭis of buddha-bodhisattvas.",
        "source": "T09n0263_004:0092a04_2"
    },
    {
        "source_sentence": "處於無上正真道，皆立大乘。",
        "translation": "In the unsurpassed true path, they all establish the great vehicle.",
        "source": "T09n0263_004:0092a06_3"
    },
    {
        "source_sentence": "其大通眾慧如來八十四萬劫，乃從三昧興，就法座，普告一切諸比丘眾：『十六王子所建功德難及無量，",
        "translation": "For eighty-four thousand world ages the buddha Mahāprajāpatīyasamukhabuddha emerged from samādhi and took his seat on the Dharma seat. He said to all the bhikṣus, “The merit created by these six",
        "source": "T09n0263_004:0092a06_4"
    },
    {
        "source_sentence": "至未曾有智慧巍巍，則以供養無數億百千諸佛，眾行具足普受聖慧，入于道明合集佛智，",
        "translation": "To the utmost unprecedented wisdom and majestic, they honor countless billions of hundreds of millions of buddhas by means of offerings. Their practices are replete with universal acceptance of holy wisdom; entering into the path",
        "source": "T09n0263_004:0092a09_5"
    },
    {
        "source_sentence": "諸比丘眾皆當稽首，恭敬自歸十六仁賢，數數莫懈，其志聲聞、緣覺乘，",
        "translation": "The assembly of monks should all bow their heads in respect and reverence to the sixteen kinds of benevolent and virtuous people, without laziness. Those who are interested in the vehicle of śrāvakas and pratyekbuddhas",
        "source": "T09n0263_004:0092a11_6"
    },
    {
        "source_sentence": "已得聲聞、緣覺之路，若行菩薩及成就者，其新發意皆當付此。",
        "translation": "Those who have already attained the path of śrāvakas and pratyekbuddhas, those who practice bodhisattvas and those who are accomplished, and those who newly arouse their minds will all be entrusted with this.",
        "source": "T09n0263_004:0092a12_7"
    },
    {
        "source_sentence": "諸族姓子，聽所說經不拒逆者，皆當逮得無上正真之道，成佛聖慧。",
        "translation": "Those clansmen who listen to the sūtras taught and don't reject them will all attain the unsurpassed true path and become buddhas of noble wisdom.",
        "source": "T09n0263_004:0092a14_8"
    },
    {
        "source_sentence": "諸族姓子順世尊教，以是正法數數分別為一切說，其十六子具菩薩乘，",
        "translation": "The clansmen, following the teaching of the World-honored One, taught this true doctrine repeatedly and discriminated it for all. Those sixteen sons were endowed with the bodhisattva vehicle.",
        "source": "T09n0263_004:0092a15_9"
    },
    {
        "source_sentence": "一一開化六十江河沙等人，所生之處常共俱會，亦復普說聽正法誼，各各值見四十億百千諸佛世尊，",
        "translation": "Each one of them enlightened sixty-thousand buddhas as numerous as the grains of sand in sixty Ganges Rivers, and wherever they were born they always assembled together. They also expounded on the meaning of the Teaching to",
        "source": "T09n0263_004:0092a17_10"
    },
    {
        "source_sentence": "或當復更見諸佛者，今我班宣四輩。』」",
        "translation": "Perhaps I'll see the buddhas again, and now I'll declare the four groups of people in my class.'",
        "source": "T09n0263_004:0092a19_11"
    },
    {
        "source_sentence": "佛言：「欲知爾時十六國王子乎？」",
        "translation": "The Buddha said, Do you want to know the princes of the sixteen kingdoms at that time?",
        "source": "T09n0263_004:0092a21_0"
    },
    {
        "source_sentence": "答曰：「不及也。」",
        "translation": "He replied, It's not enough.",
        "source": "T09n0263_004:0092a21_1"
    },
    {
        "source_sentence": "佛言：「今皆成無上正真之道，今悉現在，處于十方說法救護，無數億百千姟兆載聲聞眾，",
        "translation": "The Buddha said: All of them have now perfected the supreme path of truth. They are all present in the ten directions, expounding the Teaching and protecting it, carrying hundreds of millions of myriads of koṭis of trillions",
        "source": "T09n0263_004:0092a22_2"
    },
    {
        "source_sentence": "不可稱計菩薩東方現在甚樂世界，有二佛號無怒、山崗如來、至真、等正覺；",
        "translation": "To the east of this inconceivable enlightening being were two buddhas, namely, Vimalanirmita-vaśavartin and Samantabhadra Tathāgata. In the world Great Bliss presently manifested in the east",
        "source": "T09n0263_004:0092a24_3"
    },
    {
        "source_sentence": "東南方現在二佛，號師子響、師子幢如來；",
        "translation": "In the southeast there are two present buddhas named Siṃhala and Sthirabhadra.",
        "source": "T09n0263_004:0092a25_4"
    },
    {
        "source_sentence": "南方現在二佛，號一住、常滅度如來；",
        "translation": "In the southern direction there are two present buddhas, named One-abiding and Ever Extinct Buddha.",
        "source": "T09n0263_004:0092a26_5"
    },
    {
        "source_sentence": "西南方現在二佛，號帝幢、梵幢如來；",
        "translation": "To the southwest were two present buddhas named Indra Banner and Brahma Banner Tathāgata.",
        "source": "T09n0263_004:0092a27_6"
    },
    {
        "source_sentence": "西方現在二佛，號無量壽、超度因緣如來；",
        "translation": "In the western direction there are two present buddhas, named Immeasurable Life and Transcending Causes and Conditions Tathāgata.",
        "source": "T09n0263_004:0092a28_7"
    },
    {
        "source_sentence": "西北方現在二佛，號栴檀神通山、藏念如來；",
        "translation": "To the northwest there are two present buddhas, named Sandalwood Mountain of Mystic Powers and Tripiṭaka of Mindfulness.",
        "source": "T09n0263_004:0092a29_8"
    },
    {
        "source_sentence": "北方現在二佛，號樂雨、雨音王如來；",
        "translation": "In the northern direction there are two present buddhas, namely, the Tathāgata Raining with Music and the Sound of Rain King and the enlightened one.",
        "source": "T09n0263_004:0092b01_9"
    },
    {
        "source_sentence": "東北方現在二佛，號除世懼。",
        "translation": "To the northeast, there are two buddhas in the present worldly fearlessness.",
        "source": "T09n0263_004:0092b02_10"
    },
    {
        "source_sentence": "今吾能仁，於忍世界，得成如來至真等正覺，合十六尊。」",
        "translation": "Now, I'm able to benevolently attain the accomplishment of the Tathāgata's supreme perfect enlightenment in the world of forbearance, which consists of 16 honored ones.",
        "source": "T09n0263_004:0092b03_11"
    },
    {
        "source_sentence": "又告比丘：「吾等十六為沙彌時，在彼佛世講說經法，眾生聽受，一一菩薩開化無量諸江河沙億百千姟，",
        "translation": "Again, the Buddha said to the bhikṣus: When we were śrāmaṇeras at the age of sixteen, when we were living in that buddha-field, we taught the Dharma through discourse on the scriptures and teachings to sentient beings",
        "source": "T09n0263_004:0092b05_0"
    },
    {
        "source_sentence": "發無上正真道者，今得成就為菩薩道。",
        "translation": "Those who give rise to the unsurpassed true path will now attain its accomplishment as bodhisattvas.",
        "source": "T09n0263_004:0092b07_1"
    },
    {
        "source_sentence": "住聲聞地者，漸當誘進無上大道，稍稍當成最正覺。",
        "translation": "Those who abide in the stage of śrāvaka will gradually be induced to advance on the unsurpassed path, and they'll attain supreme perfect enlightenment a little bit.",
        "source": "T09n0263_004:0092b08_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T09n0263_004:0092b09_3"
    },
    {
        "source_sentence": "如來之慧難限難計，不可逮及為若此也。」",
        "translation": "The Tathāgata's wisdom is difficult to limit and difficult to calculate, and it can't be apprehended like this.",
        "source": "T09n0263_004:0092b09_4"
    },
    {
        "source_sentence": "又告比丘：「何所是乎？",
        "translation": "Again, he told the monk, What's that?",
        "source": "T09n0263_004:0092b10_5"
    },
    {
        "source_sentence": "吾為菩薩時，開化無量億百千姟江河沙等，聽聞諮受諸通慧者，當來末世，",
        "translation": "When I was a bodhisattva, I enlightened immeasurable hundreds of millions of myriads of koṭis of buddha-bodhisattvas as numerous as the grains of sand in countless rivers and streams. Those who",
        "source": "T09n0263_004:0092b11_6"
    },
    {
        "source_sentence": "或有發意，學弟子乘，成為聲聞，後不肯聽受菩薩之教，不解佛慧不行菩薩，",
        "translation": "“Some people have the intention to follow the vehicle of disciples and become śrāvakas, but later they won’t listen to or accept the instruction of enlightening beings; they don’t understand buddha-knowledge and don’t practice",
        "source": "T09n0263_004:0092b13_0"
    },
    {
        "source_sentence": "一切志在無為之想，謂當滅度。",
        "translation": "All of them aspire to the conception of nonproductivity, which is to say that they will be liberated.",
        "source": "T09n0263_004:0092b14_1"
    },
    {
        "source_sentence": "甫當往至他佛世界，順殊異行生異佛國，當求道慧志聽啟受，爾乃解知如來之法，",
        "translation": "They will soon go to other buddha-fields, be born in different buddha-lands according to their differences in practice, seek enlightenment and wisdom, and listen with determination. Only then will they understand the teaching of buddhas.",
        "source": "T09n0263_004:0092b15_2"
    },
    {
        "source_sentence": "有一滅度無有二乘也。",
        "translation": "There's one kind of cessation, and there are no two vehicles.",
        "source": "T09n0263_004:0092b17_3"
    },
    {
        "source_sentence": "皆是如來善權方便說三乘耳。",
        "translation": "They are all the Tathāgata's skillful means of teaching the three vehicles.",
        "source": "T09n0263_004:0092b17_4"
    },
    {
        "source_sentence": "如來正覺滅度之時，若有供養以清淨行，信樂妙言趣于經典，一心定意為大禪思，",
        "translation": "At the time of the parinirvāṇa of the enlightened ones, if one makes offerings with pure practices, believes in sublime words and dedicates himself to scriptures, singlemindedly concentrating his mind on great meditative absorption",
        "source": "T09n0263_004:0092b18_5"
    },
    {
        "source_sentence": "當知爾時觀於如來，皆普合會諸菩薩眾，會諸聲聞聽受此法，爾乃覩見世間佛道，",
        "translation": "You should know that at that time, observing the Buddha, they assembled all the assemblies of enlightening beings and listened to these teachings from the assembly of śrāvakas. Then Sudhana saw the buddha-way of",
        "source": "T09n0263_004:0092b20_6"
    },
    {
        "source_sentence": "無二滅度也。",
        "translation": "There are no two kinds of cessation.",
        "source": "T09n0263_004:0092b22_7"
    },
    {
        "source_sentence": "如來正覺善權說耳，其樂下劣小乘行者，則自亡失遠乎人種，不解人本為欲所縛，",
        "translation": "The Tathāgata is correctly awakened and well-justified. Those who take delight in the practice of the inferior lesser vehicle will then lose their own way, being far removed from the human race and not understanding that humans are originally bound by desire",
        "source": "T09n0263_004:0092b22_8"
    },
    {
        "source_sentence": "如來滅度時，若有聞說歡喜信者，佛恩所護。",
        "translation": "At the time of the parinirvāṇa of the Tathāgata, if anyone hears it and rejoices in faith, they'll be protected by the Buddha's kindness.",
        "source": "T09n0263_004:0092b24_9"
    },
    {
        "source_sentence": "「假喻曠野五百里路，逈絕無人亦無國君，有一導師聰慧明達，方策密謀隱知遠近，",
        "translation": "Suppose it's a metaphor for the path of five hundred li in the wilderness, where there's no country and no sovereign, and there's a guide who's wise and insightful, so he can formulate secret strategies that are",
        "source": "T09n0263_004:0092b26_0"
    },
    {
        "source_sentence": "將眾賈人欲度懸逈，皆俱疲怠不能自前，各思戀曰：『予等安處聖興之土，",
        "translation": "When the merchants and others were about to cross over the hanging rope, they all became exhausted and unable to go forward. Each thought:",
        "source": "T09n0263_004:0092b27_1"
    },
    {
        "source_sentence": "本國平雅有君長師父，今來遠涉極不任進，寧可共還免離苦難。』",
        "translation": "My native land is peaceful and elegant, and there's a ruler and a teacher and father; now that I've come from such a great distance and won't be able to advance, let's return together and escape suffering and distress.'",
        "source": "T09n0263_004:0092b29_2"
    },
    {
        "source_sentence": "導師愍之，發來求寶中路而悔，設權方便於大曠野，度四千里若八千里，",
        "translation": "The guide pityed him and came out to seek the treasure. On the way he repented, setting up an expedition to cross a great wilderness for four thousand li or eight thousand li.",
        "source": "T09n0263_004:0092c02_3"
    },
    {
        "source_sentence": "以神足力化作大城，告眾商人無懷廢退，大國已至可住休息，隨意所欲飯食自恣，",
        "translation": "He transformed it into a great city by the power of his supernormal powers and told the merchants not to harbor any thoughts of indifference. When the great kingdom had arrived, they could live and rest at their own will, eating and drinking as",
        "source": "T09n0263_004:0092c03_4"
    },
    {
        "source_sentence": "欲得大寶於此索之。」",
        "translation": "I want to obtain the great treasure here and ask for it.",
        "source": "T09n0263_004:0092c05_5"
    },
    {
        "source_sentence": "又告比丘：「商人見城人民興盛，快樂無極怪未曾有，離苦獲安喜用自慰，",
        "translation": "Again, he said to the bhikṣus: When merchants saw the prosperity of the city and its citizens, they were delighted beyond measureless wonder. Freed from suffering, they found peace and happiness in comforting themselves.",
        "source": "T09n0263_004:0092c06_6"
    },
    {
        "source_sentence": "無復憂恐饑乏之患，自謂無為如得滅度。",
        "translation": "They no longer worry and fear the danger of hunger and poverty, claiming to be uncreated as if they had attained cessation.",
        "source": "T09n0263_004:0092c07_7"
    },
    {
        "source_sentence": "停止有日隱知欲厭，即沒化城令無處所，告眾賈曰：『速當轉進到大寶地，",
        "translation": "Knowing that he was disgusted, the king disappeared from the magical castle and made no place to stay. He said to the merchants, “Let us quickly proceed on our way to the great precious site.",
        "source": "T09n0263_004:0092c08_8"
    },
    {
        "source_sentence": "吾見汝等行疲心懼，故現此城。』」",
        "translation": "I see that you're so exhausted and frightened by your actions that I'm presenting this city.'",
        "source": "T09n0263_004:0092c10_9"
    },
    {
        "source_sentence": "又告比丘：「如來如是，為人等倫唱道經誼，覩見生死長久艱難虛乏之患，",
        "translation": "Again, the Buddha said to the bhikṣus: The Tathāgata thus preached the path of religion for the sake of all living beings and so forth in order to eliminate the afflictions of destitution that would cause them to see birth and",
        "source": "T09n0263_004:0092c12_0"
    },
    {
        "source_sentence": "現于三乘，禪定一心使得滅度。",
        "translation": "It's manifested in the three vehicles, where meditation singlemindedly liberates them from cessation.",
        "source": "T09n0263_004:0092c13_1"
    },
    {
        "source_sentence": "又佛從本說有一乘，聞佛講法不受道慧，若患厭者謂當積行甚為勤苦。",
        "translation": "Furthermore, the Buddha teaches that there's a single vehicle from the source that hears the Buddha's teaching and doesn't accept the path and wisdom, and if someone becomes sick and disillusioned, it means they'll accumulate practices that",
        "source": "T09n0263_004:0092c14_2"
    },
    {
        "source_sentence": "如來悉見其心所念、志疲懈想，為現聲聞、緣覺易得，猶如無導化作大城，",
        "translation": "The Tathāgata sees all the thoughts and lazy thoughts in their minds and makes it easy for them to manifest themselves as śrāvakas and pratyekbuddhas, just as a great city is made without guidance.",
        "source": "T09n0263_004:0092c16_3"
    },
    {
        "source_sentence": "人民饒裕商者晏息。",
        "translation": "The people are generous, and the merchant Yan Shi.",
        "source": "T09n0263_004:0092c17_4"
    },
    {
        "source_sentence": "視如厭翫沒之不現，為眾商人說幻化城，其導師者謂如來也。",
        "translation": "He looked as if he was disillusioned and didn't show up, and explained the illusory city of transformation to the merchants, whose guide was called the Tathāgata.",
        "source": "T09n0263_004:0092c18_5"
    },
    {
        "source_sentence": "大曠野者謂五道生死；",
        "translation": "The great wilderness refers to the five realms of birth and death.",
        "source": "T09n0263_004:0092c19_6"
    },
    {
        "source_sentence": "眾商賈人謂諸學者；",
        "translation": "The merchants and traders called themselves scholars.",
        "source": "T09n0263_004:0092c20_7"
    },
    {
        "source_sentence": "將行求寶謂說道慧菩薩行法；",
        "translation": "To practice and seek the treasures is to expound the practical methods of enlightening beings who are on the path of knowledge.",
        "source": "T09n0263_004:0092c20_8"
    },
    {
        "source_sentence": "中路厭翫不肯進者，謂佛難得累劫積功不可卒成，誘以聲聞、緣覺易辦；",
        "translation": "“The middle way is disgusted and not willing to proceed”: Because buddhas are difficult to attain, the accumulation of merit over many kalpas cannot be accomplished suddenly. They induce śrāvakas and pratyekabuddhas to make it easy",
        "source": "T09n0263_004:0092c21_9"
    },
    {
        "source_sentence": "化作城者謂羅漢泥洹；",
        "translation": "Conversion into a city is called arhat-parinirvāṇa.",
        "source": "T09n0263_004:0092c23_0"
    },
    {
        "source_sentence": "沒城不現謂臨滅度，佛在前立勸發無上正真道意。",
        "translation": "When the city disappears and doesn't appear, it's called approaching nirvāṇa, and the Buddha stands in front of him to encourage the mind of the unsurpassed true path.",
        "source": "T09n0263_004:0092c23_1"
    },
    {
        "source_sentence": "其羅漢事，限礙非真不至大道，若至他方與佛相見，得不退轉無所從生，",
        "translation": "The deeds of the arhat are limited, unreal, and they don’t reach the great path. If they go to see the Buddha in another place, they attain non-backsliding, which is produced from nowhere.",
        "source": "T09n0263_004:0092c24_2"
    },
    {
        "source_sentence": "乃為大寶究竟之事。」",
        "translation": "That's the ultimate thing of the great treasure.",
        "source": "T09n0263_004:0092c26_3"
    },
    {
        "source_sentence": "佛語諸比丘：「如來說法爾等聞之，謂悉備足，不知所作尚未成辦。",
        "translation": "The Buddha said to the monks, The Tathāgata teaches that those who hear the Dharma are fully endowed, meaning they don't know what they've done and haven't accomplished it yet.",
        "source": "T09n0263_004:0092c26_4"
    },
    {
        "source_sentence": "又如來慧，普見世間一切人心，示現泥洹，如來、至真、等正覺，善權方便說有三乘。」",
        "translation": "Also, the Tathāgata's wisdom universally sees all the minds in the world and shows nirvāṇa, and the Tathāgata, Arhat, Perfectly Enlightened One, skillfully and expediently explains that there are three vehicles",
        "source": "T09n0263_004:0092c28_5"
    },
    {
        "source_sentence": "「昔有大通，　　眾慧導師，　　適坐道場，",
        "translation": "Formerly there was a great supernatural being, the Guide of Wisdom, Whose seat was on the terrace of enlightenment.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　於佛樹下。　　其佛定處，　　具十中劫，",
        "translation": "At the foot of a buddha-treat, The Buddha’s sphere of concentration lasts for ten intermediate kalpas.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　尚未得成，　　究竟道誼。　　諸天龍神，",
        "translation": "They haven’t yet accomplished the ultimate path of enlightenment, and gods, dragons, and spirits are likewise.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　阿須倫等，　　普發精進，　　供養最勝。",
        "translation": "The asuras and so forth universally aroused the energy to make offerings, best of all.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　雨諸天華，　　紛紛如降，　　用散等覺，",
        "translation": "The heavenly flowers rain down like rain and scatter with equal awareness.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　人中之導。　　於虛空中，　　暢發雷震，",
        "translation": "Among the guides among men, they can cause thunder and lightning to shake in the sky.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　而以進貢，　　上尊大聖。　　最勝在彼，",
        "translation": "Instead, the supreme honored and great sage is bestowed with superiority.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　行甚勤苦，　　所行久長，　　成無上道。",
        "translation": "Their practice is so intense and painful that it lasts for a long time. They attain the highest path.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　專精思惟，　　於十中劫，　　乃成正覺，",
        "translation": "In ten intermediate kalpas they will become perfectly enlightened.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　大通眾慧。　　諸天人民，　　億百千姟，",
        "translation": "The great superknowledges are the wisdom of all beings; All the gods and humans, Hundreds of millions of koṭis of myriads of bodhisattvas.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　一切眾生，　　歡喜踊躍。　　彼佛本有，",
        "translation": "All sentient beings Rejoice and dance with joy.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　諸子十六，　　皆順稟受，　　人中道化。",
        "translation": "All the children, sixteen in number, Followed and accepted it; They were all taught by the middle way.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　眾庶之類，　　億百千姟，　　眷屬圍繞，",
        "translation": "Hundreds of myriads of koṭis of common people Surrounded by their retinues.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　造兩足尊。　　前稽首禮，　　師長聖尊，",
        "translation": "The two-legged honored one prostrating, bowed his head in respect and greeted the venerable teacher.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　慇懃啟諫，　　願說經典。　　勇猛師子，",
        "translation": "I beg to make an announcement, wishing to teach the sutras.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　講未聞者，　　飽滿我等，　　及世人民。",
        "translation": "Those who haven't heard it yet will satisfy us and the people of the world.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　十六荒域，　　及此世界，　　久遠空墟，",
        "translation": "The sixteen wilderness fields and this world Have been in the sky for a long time.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　大聖乃興。　　梵天宮殿，　　亘然大明，",
        "translation": "The great sage then arose, and the palace of Brahmā Heaven extended its great luminosity.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　現眾瑞應，　　悉分別說。　　東方世界，",
        "translation": "The manifestation of all the auspicious signs Is explained clearly and distinctly.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　億百千姟，　　五百國土，　　自然震動。",
        "translation": "Hundreds of myriads of koṭis of lands, Five hundred million lands, spontaneously quaked.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　彼有大梵，　　自處其宮，　　威神功德，",
        "translation": "That great Brahmā resides in his own palace, Endowed with majestic power and virtue.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　巍巍最上。　　於時覩見，　　此本瑞應，",
        "translation": "It is the most lofty and majestic of all, visible even at the time.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　尋即造詣，　　愍傷俗者。　　則以天華，",
        "translation": "He immediately went to the place where he was staying, To show compassion toward the laity.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　供散大仁，　　皆用宮殿，　　奉上世尊。",
        "translation": "They scattered offerings to great benefactors, all using the palace and presenting it to the Bhagavān.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　鼓樂絃歌，　　讚佛功德，　　勸諫正導，",
        "translation": "With drums, music, stringed instruments, and singing, They praise the virtues of buddhas And exhort, admonish, and guide them.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　令轉法輪。　　時人中尊，　　默然受之，",
        "translation": "I will cause you to turn the wheel of the Dharma.” The venerable among humans at that time accepted this teaching in silence.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　尋為如應，　　解說經法。　　南方西方，",
        "translation": "He explained the teaching of the scriptures as they should have been taught. To the south and west,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　北方世界，　　上方下方，　　四隅境域，",
        "translation": "The worlds of the north, Upward and downward, Four-cornered in all directions,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　億千姟眾，　　梵天悉來，　　各獻所珍，",
        "translation": "Hundreds of myriads of koṭis of eunuchs All came from the Brahma heavens, Each presenting their treasures.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　以為供養。　　又復下方，　　諸界梵天，",
        "translation": "And further down, the gods and Brahmā goddesses of the worlds in the realms below are likewise.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　普亦如是，　　等無有異。　　皆以宮殿，",
        "translation": "So it is with all, Equal and the same, without distinction; All of them are endowed with palaces.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　奉上大聖，　　嗟歎如來，　　悉共勸助。",
        "translation": "They venerate the supreme great sage and praise the Tathāgata, all of whom are encouraged together.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　願轉法輪，　　光闡心目，　　無數億劫，",
        "translation": "I pray to turn the wheel of the Dharma, Illumining my mind and eyes for countless koṭis of kalpas.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　難得值遇，　　惟垂示現，　　往古根力，",
        "translation": "It is difficult to meet, but please show it. From ancient times the power of your faculties has been like this:",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　加哀開[門@為]，　　甘露法門，　　普等法眼，",
        "translation": "With compassion, he opens the [gate@for] nectar-like dharma-gate, Equal in all ways to the eye of truth.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　分別慧誼，　　宣揚群典，　　若干品類。",
        "translation": "He discerns the meaning of wisdom, proclaims various texts, and has several kinds of categories.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　時佛為說，　　遍示四諦，　　一切具解，",
        "translation": "The Buddha then explained for them the universal teaching of the four truths, explaining them all.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　十二因緣。　　為顯無黠，　　令得眼目，",
        "translation": "For twelve reasons, in order to show that they are not clever, They cause them to attain the eye.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　講說生死，　　憂苦空患。　　一切世間，",
        "translation": "He teaches that birth and death, sorrow, pain, and emptiness are afflictions of all worlds.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　悉從生有，　　當知因是，　　致于終沒。",
        "translation": "They all arise from birth, and you should know that this is the cause that leads to their ultimate disappearance.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　如來適說，　　是法欲竟，　　若干種類，",
        "translation": "The Tathāgata explains appropriately that this is the end of desire for the Dharma. There are several kinds:",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　無央數人，　　八十億姟，　　眾生之儔，",
        "translation": "Incalculable numbers of people, Eighty koṭis of anger, and the anger of sentient beings.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　於時聽者，　　住聲聞乘，　　何況餘方，",
        "translation": "Those who hear it then Will abide in the vehicle of the śrāvakas, How much less in other directions.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　立第一地。　　彼時最勝，　　所說經法，",
        "translation": "The first stage is the supreme at that time, namely the dharmas of the Sūtra.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　如江河沙，　　黎庶清淨，　　都盧志于，",
        "translation": "Like the sands of rivers and streams, The common people are pure. The capital city is situated in this place.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　聲聞之行。　　導師聖眾，　　計數若茲，",
        "translation": "The practices of the śrāvakas, Guided by teachers and holy beings, Are counted in the same way.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　一切共算，　　不能稱限。　　眾等品類，",
        "translation": "All of them can be calculated in general, but they cannot be limited.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　一一如是，　　皆悉若斯，　　立大上慧。",
        "translation": "Each one of them is like this, and they all thus establish great superior wisdom.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　於時至尊，　　十六聖子，　　等俱學者，",
        "translation": "At the time, the supreme honored one, Sixteen noble sons, Equal in number to all scholars,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　齊共同心，　　一切出家，　　咸為沙彌，",
        "translation": "All the renunciants Are all śrāmaṇeras, Whose minds are unified.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　而悉分別，　　佛方等經。　　吾等當成，",
        "translation": "And we will all discern The Buddha’s sutras, such as these.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　世之明父，　　汝黨如是，　　皆得上慧。",
        "translation": "The wise fathers of the world are like this, and all of you have attained superior wisdom.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　斯諸眾生，　　悉令如此。",
        "translation": "All these sentient beings They cause to be like this.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　又如世尊，　　為法之眼，　　最勝至誠，",
        "translation": "Furthermore, just as the Bhagavān Is the eye of the Dharma, Most excellent and most sincere,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　見人心本。　　幼少為童，　　常行平等，",
        "translation": "He sees the mind as the root of all sentient beings, Always acting with equanimity As children.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　而為眾生，　　說上尊道。　　億百千姟，",
        "translation": "For the sake of sentient beings He teaches the supreme path.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　無底譬喻，　　示現因緣，　　尋獲報應。",
        "translation": "The bottomless metaphor shows the causes and conditions for attaining rewards.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　分別所興，　　諸通敏慧，　　如諸菩薩，",
        "translation": "The powers of discernment, intellect, and wisdom are like the bodhisattvas.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　所當造行。　　於時大聖，　　為現真諦，",
        "translation": "At that time the Great Sage manifested the Truths for the sake of all beings.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　顯揚宣布，　　斯《正法華》。　　普雨講說，",
        "translation": "To express and proclaim, This is the Lotus Sutra of the True Dharma.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　大方等經，　　若干千頌，　　不可思念。",
        "translation": "The great and wide scriptures, several thousand verses long, Are inconceivable.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　無能限量，　　如江河沙，　　於時適說，",
        "translation": "They cannot be limited, Like rivers and streams of sand. When they are spoken appropriately,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　斯之經典。　　則入靜室，　　三昧等觀，",
        "translation": "These scriptures then entered a quiet room, such as Samādhi and other contemplations.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　八十四萬，　　劫中澹然。　　世雄尊師，",
        "translation": "In eighty-four thousand kalpas it will be calm and peaceful.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　定意如斯，　　時諸沙彌，　　覲瞻大聖，",
        "translation": "The mind of concentration is like this. At that time the śrāmaṇeras Were to see the Great Sage,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　在於靜室，　　而不出遊，　　開化人民，",
        "translation": "He stayed in a secluded room, Yet didn’t go out to excursions To enlighten and transform the people.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　無數億千。　　覺了禪定，　　清淨無漏，",
        "translation": "Countless billions of them perceived meditative absorptions Pure and uncontaminated.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　第一始設，　　於大法座，　　宣揚說此，",
        "translation": "The first one, setting it up for the first time, Expounds this teaching on the great seat of the Dharma.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　仁賢經典，　　於安住教，　　流布佛化。",
        "translation": "The scriptures of benevolence and Goodness Teach the peaceful abode, And spread the buddha-transformation.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　如是比像，　　所造弘廣，　　於江河沙，",
        "translation": "Thus, the statue of this kind is so vast that it's built on the sand in rivers and rivers.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　不可稱限，　　億百千數，　　皆聽啟受，",
        "translation": "They can’t be measured or counted; There are billions and hundreds of thousands of them— All they hear and receive.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　安住之子，　　一一開導，　　算諸黎庶，",
        "translation": "The son of Anzhusita, Each one enlightened and guided,calculating the common people.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　無能限量。　　於時最勝，　　滅度之後，",
        "translation": "Their power is infinite, and they are supreme at the time. After their parinirvāṇa,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　悉得覲于，　　四十億佛。　　彼諸學士，",
        "translation": "They will all be able to see and pay their respects To four billion buddhas.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　適聞斯名，　　便即供養，　　兩足之尊。",
        "translation": "As soon as he heard this name, he made offerings to the two-legged honored one.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　有四事行，　　離垢為貴，　　悉得佛道，",
        "translation": "There are four deeds that are practiced, which are free of dirt as the most valuable. They all attain the buddha path.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　現在十方。　　斯十六童，　　皆是佛子，",
        "translation": "In the ten directions these sixteen youths are all Buddha’s children.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　普在八方，　　敷弘道誼。　　於彼所說，",
        "translation": "They are everywhere in the eight directions, Developing great awareness of enlightenment.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　及聽受者，　　是諸聲聞，　　悉佛弟子。",
        "translation": "And those who hear and accept it are śrāvakas, all disciples of the Buddha.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　步步各各，　　若干色像，　　今當親近，",
        "translation": "Each step is distinct, With different colors and forms; Now let us get close to them.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　發大道意。　　吾身爾時，　　寤不覺者，",
        "translation": "At the time of my body’s birth, I did not feel any anger toward anyone.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　皆令一切，　　咸得聽受。　　爾諸賢者，",
        "translation": "They cause all to be heard and accepted.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　號聲聞子，　　善權方便，　　示諸人道。",
        "translation": "He called out to the śrāvakas, skillfully and expediently, Showing the path to all people.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　吾前世時，　　報應如斯，　　應所說法，",
        "translation": "In a previous life, my rewards were like this. The Dharma that I taught should have been thus:",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　是其因緣。　　假使不忍，　　修尊佛道，",
        "translation": "Even if one does not tolerate this, He will cultivate the path of the supreme buddha.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　比丘當知，　　魔所嬈因。　　隨其本性，",
        "translation": "Monks, you should know The causes of the troubles caused by Māra.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　兇弊縱恣，　　志不奉行，　　不樂空慧。",
        "translation": "They are wicked and unrestrained, their aspirations not honoring practice, and they don't delight in emptiness or wisdom.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　無數百世，　　渴不值水，　　又當愚騃，",
        "translation": "Countless hundreds of eons ago, I'll be thirsty and won't find water, and I'll be stupid.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　常處恐懼。　　無數丈夫，　　百千之眾，",
        "translation": "Hundreds of thousands of sentient beings, countless in number, Always fearful and terrified.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　發跡而行，　　欲度曠野。　　又覩曠野，",
        "translation": "They set out to cross over into the wilderness, just as they wished.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　殊逈艱難，　　其里計數，　　五百踰旬。",
        "translation": "The distance between the roads is five hundred yojanas.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　有一大人，　　賢聖明哲，　　導師開化，",
        "translation": "There was a great man, Good and noble, bright and wise, Who guided the teacher in enlightenment.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　心無所畏。　　為彼賈人，　　導示徑路，",
        "translation": "Their minds are free from fear, And they show the way For the sake of those merchants.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　曠野懸邈，　　多有艱恐。　　無數億人，",
        "translation": "Hundreds of millions of people lived in the wilderness, mostly fearful and distressed.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　創礙羸憊，　　各對導師，　　而自訴訟。",
        "translation": "Each created an obstruction and was weakened, each facing the guide and defending themselves against him.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　吾等疲弊，　　不能進前，　　徒類今日，",
        "translation": "We're so exhausted that we can't advance, and we're just like today.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　欲退還歸。　　導師聰明，　　為方便父，",
        "translation": "He wished to retreat and return home, but the guide was so clever as to be a father of skillful means.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　諄諄宣喻，　　誘誨委曲，　　矜憐闇塞，",
        "translation": "I'm eager to proclaim metaphors, tempt and entrust them with instruction, and pity the darkness of ignorance.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　欲棄寶退，　　壞敗本計，　　中路規還。",
        "translation": "Wishing to abandon the treasure, he retreated, destroyed his original plan, and returned by the middle of the road.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　吾今寧可，　　設神足力，　　化造立作，",
        "translation": "I now wish to use my supernormal powers To create and create.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　廣大城郭，　　嚴莊若干，　　億千人民，",
        "translation": "Vast and vast is the city, Adorned with various adornments; Hundreds of millions of people live there.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　而立房室，　　令微妙好。　　又當復化，",
        "translation": "He will build dwellings And make them subtle and beautiful, And he will also be transformed.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　大江流河，　　苑園浴池，　　華實滋茂，",
        "translation": "The great rivers flow, and the gardens and bathing ponds are full of flowers and fruits.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　臺館殿宇，　　牆垣綺[女*(替-曰+貝)]，　　男女若干，",
        "translation": "Their terraces, halls, and buildings were beautifully decorated with walls. There were many men and women there.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　巨億百千。　　誘恤勉勵，　　使不恐懼，",
        "translation": "Hundreds of myriads of koṭis and hundreds of thousands of enlightening beings are encouraged, induced, and inspired, so that they do not fear.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　各自僥慶，　　歡喜悅豫。　　今日得至，",
        "translation": "Each of them were delighted and rejoicing, Rejoicing and joyful. Today we are able to reach you.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　於此大城，　　入市所娛，　　所欲之具。",
        "translation": "In this great city, he enters the marketplace and enjoys all the goods he wants.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　心懷忻然，　　如得滅度，　　爾等及吾，",
        "translation": "With joy in my heart, As soon as I attain nirvana, All of you and I will be liberated.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　諸難以除。　　以親親故，　　歡悅所安，",
        "translation": "It is difficult to get rid of them, for the sake of one’s relatives. They are delighted and at ease.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　今日一切，　　恣所施為，　　從己所樂，",
        "translation": "Today, all of them are given freely for the sake of their own happiness.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　周遍觀採。　　與卿同心，　　故鄭重說，",
        "translation": "The whole pervading contemplation is collected, and it's the same as your mind. That's why Zheng said again,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　悉來聚集，　　聽聞所說。　　吾以神足，",
        "translation": "They all came together and listened to what I taught.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　化作大城。　　吾時觀察，　　枯燥荊棘，",
        "translation": "I then observed the withered, dried-up thorns and shrubs.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　每懼仁等，　　創楚悔還。　　即設善權，",
        "translation": "Every time I feared you and others, I felt remorse and repented. So I set up a well-arisen right to return home.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　化現眾諸，　　且宜精志，　　順路進前。",
        "translation": "It's appropriate for all the people who are transformed to follow the path and advance with zeal.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　佛告比丘，　　吾亦如是，　　見無央數，",
        "translation": "The Buddha said to the bhikṣus: So it is with me. I see innumerable buddha-fields,",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　億千眾生，　　患厭勤苦，　　周旋迷惑，",
        "translation": "Hundreds of thousands of myriads of koṭis of sentient beings suffer from disenchantment and hardship, revolving in confusion.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　以方便教，　　而開導之。　　故佛念斯，",
        "translation": "Because the Buddha teaches them by means of skillful means And leads them to enlightenment.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　如是利誼，　　厭於佛道，　　不得滅度。",
        "translation": "Thus, for profit and benefit, they're disillusioned with the Buddha Way and won't attain cessation.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　一切道父，　　而覺了之，　　賢等事辦，",
        "translation": "All the fathers of enlightenment Yet perceive them. Such things as wisdom and so forth are accomplished.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　今得羅漢。　　故勸助立，　　住斯德報，",
        "translation": "Now that you have attained arhatship, I encourage you to assist me in establishing it.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　偶察諸賢，　　得至羅漢。　　汝等一切，",
        "translation": "On rare occasions you wise men Have attained the state of arhat.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　皆棄眾苦，　　一切眾會，　　乃演斯法。",
        "translation": "They all abandon all suffering, and all the assemblies explain this teaching.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　諸佛大聖，　　善權方便，　　講說佛教，",
        "translation": "The buddhas and great sages skillfully expediently teach Buddhism.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　大仙救護。　　其乘有一，　　未曾有二。",
        "translation": "The Great Sage saves and protects. There is one vehicle, but there are never two.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　休息爾等，　　故分別說。　　由是教化，",
        "translation": "This is why the Sūtra teaches in this way.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　此諸比丘，　　當興精進，　　第一英妙。",
        "translation": "These bhikṣus should exert the utmost effort, The foremost virtue.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　諸仁當志，　　一切敏慧，　　菩薩典法，",
        "translation": "All kinds of people should concentrate on all the wise, The bodhisattvas’ scriptures and teachings.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　無有滅度。　　我常發求，　　成諸通慧，",
        "translation": "There is no extinction, and I always seek to perfect my supernormal knowledge.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　得達十方，　　最勝之法。　　顏貌殊妙，",
        "translation": "They will attain the supreme Dharma of the ten directions, With sublime countenance and appearance.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　相三十二，　　當得佛道，　　乃應滅度。",
        "translation": "The thirty-two marks will attain the buddha path, and then they'll be liberated.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　諸大導師，　　說法如是，　　且令休息，",
        "translation": "The great leaders teach the Dharma in this way, And let them rest.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　自謂滅度。　　適得休息，　　言獲無為，",
        "translation": "He declares that he has entered nirvana.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "　緣是之故，　　暢諸通慧。」",
        "translation": "Because of this, he spreads his supernormal wisdom.",
        "source": "T09n0263_004:0093a01_6"
    },
    {
        "source_sentence": "爾時世尊欲重解誼說斯頌曰：正法華經卷第四",
        "translation": "At that time the World-honored One, wishing to elaborate on the meaning of this verse further, spoke these verses:",
        "source": "T09n0263_004:0093a01_6"
    }
]