[
    {
        "source_sentence": "大方廣佛華嚴經卷第八",
        "translation": "Dafangguang fo huayan jing, vol. 8",
        "source": "T10n0279_008:0039a12_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_008:0039a14_0"
    },
    {
        "source_sentence": "華藏世界品第五之一",
        "translation": "Chapter Five of the Flower Treasury World",
        "source": "T10n0279_008:0039a15_0"
    },
    {
        "source_sentence": "爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "It was then that the enlightening being Universally Good again addressed the crowd, saying, Children of Buddha!",
        "source": "T10n0279_008:0039a16_0"
    },
    {
        "source_sentence": "此華藏莊嚴世界海，是毘盧遮那如來往昔於世界海微塵數劫修菩薩行時，",
        "translation": "This Flower Treasury Array ocean of worlds is the place where the Tathāgata Vairocana practiced enlightening beinghood for as many eons as there are atoms in an ocean of worlds.",
        "source": "T10n0279_008:0039a16_1"
    },
    {
        "source_sentence": "一一劫中親近世界海微塵數佛，一一佛所淨修世界海微塵數大願之所嚴淨。",
        "translation": "In each eon, they'll become intimate with as many buddhas as there are atoms in an ocean of worlds, purified by each buddha and cultivated by as many great vows as there are atoms in an ocean of worlds.",
        "source": "T10n0279_008:0039a18_2"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_008:0039a20_3"
    },
    {
        "source_sentence": "此華藏莊嚴世界海，有須彌山微塵數風輪所持。",
        "translation": "This Flower Treasury Array ocean of worlds is supported by as many atmospheres as there are atoms in the polar mountain.",
        "source": "T10n0279_008:0039a20_4"
    },
    {
        "source_sentence": "其最下風輪，名：平等住，能持其上一切寶焰熾然莊嚴。",
        "translation": "The bottommost atmosphere of wind is called Equanimous Abode, which holds arrays of blazing flames of all jewels above it.",
        "source": "T10n0279_008:0039a21_5"
    },
    {
        "source_sentence": "次上風輪，名：出生種種寶莊嚴，能持其上淨光照耀摩尼王幢。",
        "translation": "The next higher atmosphere is called Producing Adornments of Various Jewels, which holds the crystal sovereign banner of pure shining radiance above it.",
        "source": "T10n0279_008:0039a22_6"
    },
    {
        "source_sentence": "次上風輪，名：寶威德，能持其上一切寶鈴。",
        "translation": "The next higher atmosphere is called Precious Virtue, which holds bells of all jewels above it.",
        "source": "T10n0279_008:0039a24_7"
    },
    {
        "source_sentence": "次上風輪，名：平等焰，能持其上日光明相摩尼王輪。",
        "translation": "The next higher atmosphere of wind is called Equanimous Flame, which holds the diamond-wheel of the light of the sun above it.",
        "source": "T10n0279_008:0039a25_8"
    },
    {
        "source_sentence": "次上風輪，名：種種普莊嚴，能持其上光明輪華。",
        "translation": "The next higher atmosphere is called Various Adornments; it holds a flower of the circle of light above it.",
        "source": "T10n0279_008:0039a26_9"
    },
    {
        "source_sentence": "次上風輪，名：普清淨，能持其上一切華焰師子座。",
        "translation": "The next higher atmosphere is called universal purity, able to hold the lion throne of all flowers and flames above it.",
        "source": "T10n0279_008:0039a27_10"
    },
    {
        "source_sentence": "次上風輪，名：聲遍十方，能持其上一切珠王幢。",
        "translation": "The next higher atmosphere is called Sound Pervading All Directions; it holds banners of all pearls above it.",
        "source": "T10n0279_008:0039a28_11"
    },
    {
        "source_sentence": "次上風輪，名：一切寶光明，能持其上一切摩尼王樹華。",
        "translation": "The next higher atmosphere is called Light of All Jewels, which holds all the diamond tree flowers above it.",
        "source": "T10n0279_008:0039a29_12"
    },
    {
        "source_sentence": "次上風輪，名：速疾普持，能持其上一切香摩尼須彌雲。",
        "translation": "The next higher atmosphere is called quick universal support, which holds all kinds of fragrant crystal mountain clouds above it.",
        "source": "T10n0279_008:0039b02_13"
    },
    {
        "source_sentence": "次上風輪，名：種種宮殿遊行，能持其上一切寶色香臺雲。",
        "translation": "The next higher atmosphere is called traveling in various palaces; it holds clouds of fragrant terraces of the colors of all jewels above.",
        "source": "T10n0279_008:0039b03_14"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_008:0039b04_15"
    },
    {
        "source_sentence": "彼須彌山微塵數風輪，最在上者，名：殊勝威光藏，能持普光摩尼莊嚴香水海；",
        "translation": "The highest of those atmospheres, as numerous as atoms in a mountain, is called Repository of Supreme Majestic Light; it holds an ocean of fragrant water adorned with radiant jewels.",
        "source": "T10n0279_008:0039b05_0"
    },
    {
        "source_sentence": "此香水海有大蓮華，名：種種光明蘂香幢。",
        "translation": "“In this ocean of fragrant water is a great lotus blossom, called Banner of Fragrance Emitting Various Lights.",
        "source": "T10n0279_008:0039b06_1"
    },
    {
        "source_sentence": "華藏莊嚴世界海，住在其中，四方均平，清淨堅固；",
        "translation": "Flower Treasury Array ocean of worlds dwelled therein, evenly spaced in all four directions, pure and strong.",
        "source": "T10n0279_008:0039b07_2"
    },
    {
        "source_sentence": "金剛輪山，周匝圍遶；",
        "translation": "It is surrounded by mountains of diamond wheels.",
        "source": "T10n0279_008:0039b08_3"
    },
    {
        "source_sentence": "地海眾樹，各有區別。」",
        "translation": "The earth, the ocean, and the trees are each distinct.",
        "source": "T10n0279_008:0039b09_4"
    },
    {
        "source_sentence": "「世尊往昔於諸有，　　微塵佛所修淨業，",
        "translation": "“O Bhagavat! In the past, in all existences, The pure deeds practiced by the Buddha Śubhavyūha Became like this:",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　故獲種種寶光明，　　華藏莊嚴世界海。",
        "translation": "That's why they attain various kinds of precious light that adorn the ocean of worlds in the Flower Treasury.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　廣大悲雲遍一切，　　捨身無量等剎塵，",
        "translation": "Vast clouds of compassion pervade all, Rejecting bodies as numerous as atoms in countless lands.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　以昔劫海修行力，　　今此世界無諸垢。",
        "translation": "Due to the power of cultivating practice over oceans of eons in the past, this world is now without defilement.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　放大光明遍住空，　　風力所持無動搖，",
        "translation": "It emanates great rays of light pervading space, held by the power of wind without stirring.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　佛藏摩尼普嚴飾，　　如來願力令清淨。",
        "translation": "Buddha’s treasury of jewels is universally adorned; The power of the Buddha’s vows makes it pure.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　普散摩尼妙藏華，　　以昔願力空中住，",
        "translation": "They scattered jewel-treasury flowers, Abiding in space by the power of past vows.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　種種堅固莊嚴海，　　光雲垂布滿十方。",
        "translation": "The ocean of various firm adornments Is draped with clouds of light, filling the ten directions.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　諸摩尼中菩薩雲，　　普詣十方光熾然，",
        "translation": "In the jewels are clouds of enlightening beings Traveling to all quarters, blazing with light.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　光焰成輪妙華飾，　　法界周流靡不遍。",
        "translation": "Light and flame forming wheels, beautifully decorated with flowers, Circulate throughout the cosmos, pervading everywhere.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　一切寶中放淨光，　　其光普照眾生海，",
        "translation": "All the jewels emanate pure light, That light illumining the ocean of sentient beings everywhere.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　十方國土皆周遍，　　咸令出苦向菩提。",
        "translation": "They pervade all lands in the ten directions, Causing all to leave suffering and turn toward enlightenment.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　寶中佛數等眾生，　　從其毛孔出化形，",
        "translation": "The buddhas in the jewels, equal in number of buddhas, emerge from their pores like sentient beings.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　梵主帝釋輪王等，　　一切眾生及諸佛。",
        "translation": "The Brahma lord Indra, the wheel king and so forth, All sentient beings and buddhas.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　化現光明等法界，　　光中演說諸佛名，",
        "translation": "Manifesting emanations of lights equal to all realms of reality, Teaching the names of buddhas in their light.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　種種方便示調伏，　　普應群心無不盡。",
        "translation": "Various kinds of skillful means show how to subdue them, adapting to all minds without fail.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　華藏世界所有塵，　　一一塵中見法界，",
        "translation": "In each and every atom of the Flower Treasury world Is seen the realm of reality.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　寶光現佛如雲集，　　此是如來剎自在。",
        "translation": "Jeweled light manifests buddhas like clouds gathering, This is the Tathāgata’s mastery of the buddha-lands.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　廣大願雲周法界，　　於一切劫化群生，",
        "translation": "The vast cloud of great vows pervades the cosmos, Teaching sentient beings in all ages.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "　普賢智地行悉成，　　所有莊嚴從此出。」",
        "translation": "All the practices of the ground of Samantabhadra's wisdom are accomplished, and all the adornments that they have come from here.",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "是時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "Wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses: Then the enlightening being Universally Good again addressed the great assembly, saying:",
        "source": "T10n0279_008:0039b09_5"
    },
    {
        "source_sentence": "此華藏莊嚴世界海大輪圍山，住日珠王蓮華之上，栴檀摩尼以為其身，",
        "translation": "This Flower Treasury adorned the great circular mountain of the ocean of worlds, standing on top of the lotus blossoms of the sun-jewel king, with sandalwood crystal as its body.",
        "source": "T10n0279_008:0039c03_6"
    },
    {
        "source_sentence": "威德寶王以為其峯，妙香摩尼而作其輪，焰藏金剛所共成立，一切香水流注其間；",
        "translation": "The majestic jewel-king of mighty virtue is the mountain’s peak, its rings are made of exquisitely fragrant jewels; they are established together by the Diamond Matrix of Flames. All kinds of fragrant water flows into the space between them.",
        "source": "T10n0279_008:0039c05_7"
    },
    {
        "source_sentence": "眾寶為林，妙華開敷，香草布地，明珠間飾，種種香華處處盈滿；",
        "translation": "The forest was made of various precious substances, with exquisite flowers blooming and the ground covered with fragrant grass and decorated with bright pearls. All kinds of fragrant flowers filled it everywhere.",
        "source": "T10n0279_008:0039c07_8"
    },
    {
        "source_sentence": "摩尼為網，周匝垂覆……。",
        "translation": "A net of jewels covered all around it.",
        "source": "T10n0279_008:0039c08_9"
    },
    {
        "source_sentence": "如是等，有世界海微塵數眾妙莊嚴。」",
        "translation": "Such and so forth, there are as many wonderful adornments as there are atoms in an ocean of worlds.",
        "source": "T10n0279_008:0039c09_10"
    },
    {
        "source_sentence": "「世界大海無有邊，　　寶輪清淨種種色，",
        "translation": "“The great ocean of worlds has no bounds; The jewel discs are pure and various colors.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　所有莊嚴盡奇妙，　　此由如來神力起。",
        "translation": "All the adornments they have are all marvelous, Produced by the Buddha’s spiritual power.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　摩尼寶輪妙香輪，　　及以真珠燈焰輪，",
        "translation": "The rings of jewels, the rings of exquisite fragrance, and the rings of flames of lamps made of pure pearls.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　種種妙寶為嚴飾，　　清淨輪圍所安住。",
        "translation": "Various kinds of exquisite jewels are adorned, Abiding in pure rings.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　堅固摩尼以為藏，　　閻浮檀金作嚴飾，",
        "translation": "Steadfast jewels are preserved in the treasury, Embellished with jambu-gold ornaments.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　舒光發焰遍十方，　　內外映徹皆清淨。",
        "translation": "Shedding light and blazing flames pervade the ten directions, Both internally and externally reflected, all pure.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　金剛摩尼所集成，　　復雨摩尼諸妙寶，",
        "translation": "It’s made of diamond jewels, Also raining precious jewel treasures.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　其寶精奇非一種，　　放淨光明普嚴麗。",
        "translation": "Their jewels are rare and unique, not one and the same; They radiate pure light adorning everywhere.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　香水分流無量色，　　散諸華寶及栴檀，",
        "translation": "The fragrance of the water is infinitely variegated, Scattering flowers, jewels, and sandalwood.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　眾蓮競發如衣布，　　珍草羅生悉芬馥。",
        "translation": "The various lotus flowers rise up in competition like cloth for clothing, With rare plants growing luxuriantly fragrant.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　無量寶樹普莊嚴，　　開華發蘂色熾然，",
        "translation": "Countless jeweled trees adorn everywhere, With blooming flowers of coarse colors shining brightly.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　種種名衣在其內，　　光雲四照常圓滿。",
        "translation": "Various kinds of famous robes are inside, With clouds of light shining everywhere and always complete.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　無量無邊大菩薩，　　執蓋焚香充法界，",
        "translation": "Measureless and boundless great enlightening beings Carry canopies, burning incense, filling the cosmos.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　悉發一切妙音聲，　　普轉如來正法輪。",
        "translation": "They all give forth all kinds of beautiful sounds To universally turn the wheel of teaching of buddhahood.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　諸摩尼樹寶末成，　　一一寶末現光明，",
        "translation": "All the jewel trees are made of precious powder, And each jewel manifests a ray of light.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　毘盧遮那清淨身，　　悉入其中普令見。",
        "translation": "Vairocana's pure body enters them all and makes them see it.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　諸莊嚴中現佛身，　　無邊色相無央數，",
        "translation": "In the adornments are manifest buddha-bodies With boundless forms and signs, countless in number.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　悉往十方無不遍，　　所化眾生亦無限。",
        "translation": "They go everywhere in the ten directions, reaching everywhere; The beings they teach also have no limit.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　一切莊嚴出妙音，　　演說如來本願輪，",
        "translation": "All the adornments produce subtle sounds Expounding the wheel of the Buddha’s past vows.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "　十方所有淨剎海，　　佛自在力咸令遍。」",
        "translation": "All the pure oceans of buddha-lands in the ten directions are pervaded by the Buddha's unimpeded power.",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "爾時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "At that point, wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses:",
        "source": "T10n0279_008:0039c10_11"
    },
    {
        "source_sentence": "此世界海大輪圍山內所有大地，一切皆以金剛所成，堅固莊嚴，不可沮壞；",
        "translation": "All the continents within this ocean of worlds and great circular mountain ranges are all made of diamond, adorned with firmness that cannot be broken down.",
        "source": "T10n0279_008:0040a03_12"
    },
    {
        "source_sentence": "清淨平坦，無有高下；",
        "translation": "It was pure and level, with no high or low rises.",
        "source": "T10n0279_008:0040a05_13"
    },
    {
        "source_sentence": "摩尼為輪，眾寶為藏；",
        "translation": "Maṇi is the wheel, and all treasures are the storehouse.",
        "source": "T10n0279_008:0040a06_14"
    },
    {
        "source_sentence": "一切眾生，種種形狀；",
        "translation": "All sentient beings had various forms.",
        "source": "T10n0279_008:0040a06_15"
    },
    {
        "source_sentence": "諸摩尼寶，以為間錯；",
        "translation": "The treasures of the maṇi jewels were mixed up in order to make a mistake.",
        "source": "T10n0279_008:0040a07_16"
    },
    {
        "source_sentence": "散眾寶末，布以蓮華；",
        "translation": "He scattered the powder of various precious substances and spread them on lotus blossoms.",
        "source": "T10n0279_008:0040a07_17"
    },
    {
        "source_sentence": "香藏摩尼，分置其間；",
        "translation": "The jewels of the treasury of fragrance were placed separately between them.",
        "source": "T10n0279_008:0040a08_18"
    },
    {
        "source_sentence": "諸莊嚴具，充遍如雲，三世一切諸佛國土所有莊嚴而為校飾；",
        "translation": "All the adornments pervaded them like clouds, adorned with all the adornments of all buddha-lands of past, present, and future.",
        "source": "T10n0279_008:0040a08_19"
    },
    {
        "source_sentence": "摩尼妙寶以為其網，普現如來所有境界，如天帝網於中布列。",
        "translation": "The net is made of jewels and wonderful treasures, revealing all the spheres of the enlightened ones, arrayed therein like Indra’s net.",
        "source": "T10n0279_008:0040a10_20"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_008:0040a11_21"
    },
    {
        "source_sentence": "此世界海地，有如是等世界海微塵數莊嚴。」",
        "translation": "In this world-ocean ground, there are as many such adornments as there are atoms in an ocean of worlds.",
        "source": "T10n0279_008:0040a11_22"
    },
    {
        "source_sentence": "「其地平坦極清淨，　　安住堅固無能壞，",
        "translation": "The ground is level and perfectly pure, Abiding firmly and unbreakable.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　摩尼處處以為嚴，　　眾寶於中相間錯。",
        "translation": "Everywhere the jewels are adorned, With various treasures interspersed with each other.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　金剛為地甚可悅，　　寶輪寶網具莊嚴，",
        "translation": "The ground is made of diamond and very pleasing, Adorned with jewel-wheels and nets.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　蓮華布上皆圓滿，　　妙衣彌覆悉周遍。",
        "translation": "The lotus blossoms spread all over it, Filled with exquisite raiment covering everywhere.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　菩薩天冠寶瓔珞，　　悉布其地為嚴好，",
        "translation": "Enlightening beings’ celestial crowns and jewel necklaces Are spread all over the ground as adornments.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　栴檀摩尼普散中，　　咸舒離垢妙光明。",
        "translation": "Sandalwood jewels are scattered everywhere, All emanating pure, subtle light.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　寶華發焰出妙光，　　光焰如雲照一切，",
        "translation": "Jewel-flowers give forth their flames producing subtle light, Flames of light like clouds shining everywhere.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　散此妙華及眾寶，　　普覆於地為嚴飾。",
        "translation": "Scattering these wonderful flowers and various treasures, they cover the ground with their adornments.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　密雲興布滿十方，　　廣大光明無有盡，",
        "translation": "Dense clouds rise and fill the ten directions, The vast light of which has no end.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　普至十方一切土，　　演說如來甘露法。",
        "translation": "To all lands in the ten directions They teach the Buddha’s teaching of immortality.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　一切佛願摩尼內，　　普現無邊廣大劫，",
        "translation": "Within the wish-granting jewels of all buddhas They manifest boundless, vast eons.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　最勝智者昔所行，　　於此寶中無不見。",
        "translation": "The supreme wise one who practiced in the past Has never seen anything like this treasure.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　其地所有摩尼寶，　　一切佛剎咸來入，",
        "translation": "The jewel treasures of that land All come and go in all buddha-lands.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　彼諸佛剎一一塵，　　一切國土亦入中。",
        "translation": "Each atom of those buddha-lands Encompasses all lands.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　妙寶莊嚴華藏界，　　菩薩遊行遍十方，",
        "translation": "The Flower Treasury realm, adorned with exquisite jewels, Enlightening beings travel everywhere in the ten directions.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　演說大士諸弘願，　　此是道場自在力。",
        "translation": "To expound the vast vows of the great heroes is the unimpeded power of the site of enlightenment.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　摩尼妙寶莊嚴地，　　放淨光明備眾飾，",
        "translation": "The ground is beautifully adorned with jewels, Emitting pure light that completes all decorations.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　充滿法界等虛空，　　佛力自然如是現。",
        "translation": "Filling space like the cosmos, such as the cosmos, Buddha’s power naturally appears in this way.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　諸有修治普賢願，　　入佛境界大智人，",
        "translation": "Those who cultivate the vows of universal goodness And enter the realm of buddhahood, Great wise people.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "　能知於此剎海中，　　如是一切諸神變。」",
        "translation": "They can know all these miraculous transformations in this ocean of worlds.",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "爾時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "At that point, wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses:",
        "source": "T10n0279_008:0040a12_23"
    },
    {
        "source_sentence": "此世界海大地中，有不可說佛剎微塵數香水海，一切妙寶莊嚴其底，妙香摩尼莊嚴其岸，",
        "translation": "In the great ground of this ocean of worlds there is a sea of fragrant water as numerous as atoms in untold buddha-lands, its bottom adorned with all kinds of exquisite jewels, its shore adorned with exquisitely fragrant diamond.",
        "source": "T10n0279_008:0040b06_24"
    },
    {
        "source_sentence": "毘盧遮那摩尼寶王以為其網；",
        "translation": "The net consists of the jewel king Vairocana maṇi.",
        "source": "T10n0279_008:0040b08_25"
    },
    {
        "source_sentence": "香水映徹，具眾寶色，充滿其中；",
        "translation": "The fragrant water was so clear and permeated with the colors of all kinds of jewels.",
        "source": "T10n0279_008:0040b09_26"
    },
    {
        "source_sentence": "種種寶華，旋布其上；",
        "translation": "Various kinds of precious flowers were draped over it.",
        "source": "T10n0279_008:0040b10_27"
    },
    {
        "source_sentence": "栴檀細末，澄垽其下；",
        "translation": "It is covered with fine powder of sandalwood and placed beneath it.",
        "source": "T10n0279_008:0040b10_28"
    },
    {
        "source_sentence": "演佛言音，放寶光明；",
        "translation": "They uttered the Buddha’s words and sounds, radiating jewel light.",
        "source": "T10n0279_008:0040b11_29"
    },
    {
        "source_sentence": "無邊菩薩，持種種蓋，現神通力。",
        "translation": "Boundless bodhisattvas, holding various kinds of canopies, manifested their supernormal powers.",
        "source": "T10n0279_008:0040b11_30"
    },
    {
        "source_sentence": "一切世界所有莊嚴，悉於中現。",
        "translation": "All the adornments of all worlds appear there.",
        "source": "T10n0279_008:0040b12_31"
    },
    {
        "source_sentence": "十寶階陛，行列分布；",
        "translation": "The staircases decorated with the ten kinds of jewels were arranged in rows.",
        "source": "T10n0279_008:0040b13_32"
    },
    {
        "source_sentence": "十寶欄楯，周匝圍遶；",
        "translation": "It was surrounded by railings made of the ten kinds of treasure.",
        "source": "T10n0279_008:0040b13_33"
    },
    {
        "source_sentence": "四天下微塵數一切寶莊嚴芬陀利華，敷榮水中；",
        "translation": "The four continents were adorned with lotus blossoms of all jewels, as numerous as atoms in the four continents, spreading themselves out in glorious water.",
        "source": "T10n0279_008:0040b14_34"
    },
    {
        "source_sentence": "不可說百千億那由他數十寶尸羅幢，恒河沙數一切寶衣鈴網幢，恒河沙數無邊色相寶華樓閣，",
        "translation": "There were ineffable hundreds of thousands of myriads of koṭis of nayutas of ten-thousand jeweled śīla banners, as numerous as the sands of the Ganges River as draped with nets of raiment and bells made of all kinds of jewels, as many as the towers of boundless colors and characteristics of jewel flowers",
        "source": "T10n0279_008:0040b15_35"
    },
    {
        "source_sentence": "百千億那由他數十寶蓮華城，四天下微塵數眾寶樹林——寶焰摩尼以為其網，",
        "translation": "Hundreds of thousands of myriads of koṭis of nayutas of jewel lotuses, as many as atoms in the four quarters of the earth, were cast into a network of jewel flames and maṇi jewels.",
        "source": "T10n0279_008:0040b17_36"
    },
    {
        "source_sentence": "恒河沙數栴檀香，諸佛言音光焰摩尼，不可說百千億那由他數眾寶垣牆，",
        "translation": "The fragrance of sandalwood as numerous as the grains of sand in the Ganges River, the jewel of the flame of the light of the words spoken by the Buddhas, untold hundreds of thousands of myriads of koṭis of nayutas of precious walls and walls.",
        "source": "T10n0279_008:0040b19_37"
    },
    {
        "source_sentence": "悉共圍遶，周遍嚴飾。」",
        "translation": "They are all together surrounded and adorned everywhere.",
        "source": "T10n0279_008:0040b21_38"
    },
    {
        "source_sentence": "「此世界中大地上，　　有香水海摩尼嚴，",
        "translation": "On the great ground in this world Is a sea of fragrant water adorned with jewel ornaments.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　清淨妙寶布其底，　　安住金剛不可壞。",
        "translation": "The floor is covered with pure, wonderful jewels, Abiding firmly in the indestructible diamond.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　香藏摩尼積成岸，　　日焰珠輪布若雲，",
        "translation": "The treasury of fragrant jewels is piled up to the shore, With a circle of sun-light beads spreading like clouds.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　蓮華妙寶為瓔珞，　　處處莊嚴淨無垢。",
        "translation": "The exquisite jewel of lotus blossoms is a necklace, Adorned everywhere pure and spotless.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　香水澄渟具眾色，　　寶華旋布放光明，",
        "translation": "The fragrant water of the fountain is pure and full of various colors, With jewel flowers draped around it shining brightly.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　普震音聲聞遠近，　　以佛威神演妙法。",
        "translation": "Shaking all the hearers, distant and near, By the Buddha’s mystic power they expound the sublime teaching.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　階陛莊嚴具眾寶，　　復以摩尼為間飾，",
        "translation": "The staircases were adorned with various jewels, Also decorated intermittently with precious stones.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　周迴欄楯悉寶成，　　蓮華珠網如雲布。",
        "translation": "The railings around it are all made of jewels, With nets of lotus blossoms and pearls draped like clouds.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　摩尼寶樹列成行，　　華蘂敷榮光赫奕，",
        "translation": "Jewel-bearing trees are arrayed in rows, Flower garlands spread and glorious light shines brilliantly.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　種種樂音恒競奏，　　佛神通力令如是。",
        "translation": "Various kinds of music always playing, By the spiritual power of Buddha they cause it to be so.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　種種妙寶芬陀利，　　敷布莊嚴香水海，",
        "translation": "A sea of fragrant water, draped with various exquisite jewels, like a lotus blossom, Is adorned with all kinds of flowers.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　香焰光明無暫停，　　廣大圓滿皆充遍。",
        "translation": "The fragrance, flame, and light are unceasing; Vast and full, they all fill it.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　明珠寶幢恒熾盛，　　妙衣垂布為嚴飾，",
        "translation": "The bright jeweled banners always flourish, With sublime robes draped with draped cloth adorning them.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　摩尼鈴網演法音，　　令其聞者趣佛智。",
        "translation": "Net of jewel bells playing the sound of the Teaching, They cause those who hear to enter buddhahood and knowledge.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　妙寶蓮華作城廓，　　眾彩摩尼所嚴瑩，",
        "translation": "The city is made of exquisitely jeweled lotus blossoms, Adorned with all colors and jewels.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　真珠雲影布四隅，　　如是莊嚴香水海。",
        "translation": "The shadow of clouds of pearls covering the four corners Is like this adorned ocean of fragrant water.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　垣牆繚繞皆周匝，　　樓閣相望布其上，",
        "translation": "Surrounded by walls and enclosures, The towers face one another and are spread on top of each other.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　無量光明恒熾然，　　種種莊嚴清淨海。",
        "translation": "Countless rays of light are always blazing, A pure ocean of various adornments.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　毘盧遮那於往昔，　　種種剎海皆嚴淨，",
        "translation": "Vairocana, from the distant past, Has purified various oceans of worlds:",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "　如是廣大無有邊，　　悉是如來自在力。」",
        "translation": "Such vastness has no limit, and it's all the Tathāgata's sovereign power.",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "爾時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "At that point, wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses:",
        "source": "T10n0279_008:0040b21_39"
    },
    {
        "source_sentence": "一一香水海，各有四天下微塵數香水河，右旋圍遶，一切皆以金剛為岸，",
        "translation": "Each of these seas of fragrant waters was surrounded by rivers of fragrant water as numerous as atoms in four continents, all curving to the right and all their banks were made of diamond.",
        "source": "T10n0279_008:0040c14_40"
    },
    {
        "source_sentence": "淨光摩尼以為嚴飾，常現諸佛寶色光雲，及諸眾生所有言音；",
        "translation": "They were adorned with jewels of pure light, constantly manifesting clouds of light of the colors and forms of the Buddhas, as well as all the words and sounds spoken by sentient beings.",
        "source": "T10n0279_008:0040c16_41"
    },
    {
        "source_sentence": "其河所有漩澓之處，一切諸佛所修因行種種形相皆從中出；",
        "translation": "The various forms and characteristics of the causes and practices cultivated by all buddhas that are found in the whirlpools of those rivers all emerge from them.",
        "source": "T10n0279_008:0040c17_42"
    },
    {
        "source_sentence": "摩尼為網，眾寶鈴鐸，諸世界海所有莊嚴悉於中現；",
        "translation": "All the adornments of all the worlds and oceans of worlds are reflected therein.",
        "source": "T10n0279_008:0040c19_43"
    },
    {
        "source_sentence": "摩尼寶雲以覆其上，其雲普現華藏世界毘盧遮那十方化佛，及一切佛神通之事；",
        "translation": "It was covered by clouds of jewel clouds, those clouds revealing the emanating buddhas of Vairocana in the ten directions of the Flower Treasury world and the miracles of all the buddhas’ spiritual powers.",
        "source": "T10n0279_008:0040c20_44"
    },
    {
        "source_sentence": "復出妙音，稱揚三世佛菩薩名；",
        "translation": "“Furthermore, a wondrous sound emerged extolling the names of buddhas and enlightening beings of past, present, and future.",
        "source": "T10n0279_008:0040c22_45"
    },
    {
        "source_sentence": "其香水中，常出一切寶焰光雲，相續不絕。",
        "translation": "In the fragrance of that perfume, clouds of all kinds of jewel flames always emerged, continuing uninterruptedly.",
        "source": "T10n0279_008:0040c23_46"
    },
    {
        "source_sentence": "若廣說者，一一河各有世界海微塵數莊嚴。」",
        "translation": "If we explain it in detail, each river has as many adornments as there are grains of dust in an ocean of worlds.",
        "source": "T10n0279_008:0040c24_47"
    },
    {
        "source_sentence": "「清淨香流滿大河，　　金剛妙寶為其岸，",
        "translation": "Pure fragrance fills the great river, With its banks adorned with diamond jewels.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　寶末為輪布其地，　　種種嚴飾皆珍好。",
        "translation": "The ground is covered with jeweled powder as a circle, Variously adorned and beautifully decorated.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　寶階行列妙莊嚴，　　欄楯周迴悉殊麗，",
        "translation": "The rows of jewel staircases are beautifully arrayed, With railings surrounded by embellishments.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　真珠為藏眾華飾，　　種種纓鬘共垂下。",
        "translation": "True pearls are the store of all kinds of flower decorations, draped with various ornaments.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　香水寶光清淨色，　　恒吐摩尼競疾流，",
        "translation": "The fragrant jeweled light of the fragrant water is pure and pure, Always emitting crystals rushing in a fast flow.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　眾華隨浪皆搖動，　　悉奏樂音宣妙法。",
        "translation": "All the flowers waved along with the waves, All playing music to proclaim the wondrous teaching.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　細末栴檀作泥垽，　　一切妙寶同洄澓，",
        "translation": "The finest sandalwood is made into nirvāṇa, And all the fine jewels are mixed together like a river.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　香藏氛氳布在中，　　發焰流芬普周遍。",
        "translation": "The fragrance of the store of incense fills it, Producing flames and streams pervading everywhere.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　河中出生諸妙寶，　　悉放光明色熾然，",
        "translation": "In the river all kinds of wondrous jewels are produced, All shining bright and blazing with color.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　其光布影成臺座，　　華蓋珠瓔皆具足。",
        "translation": "The light spread its shade to form the terrace and seat, With flowers, canopies, jewels, and necklaces all endowed.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　摩尼王中現佛身，　　光明普照十方剎，",
        "translation": "Buddha’s body manifested in the jewel-king, A ray of light illumining all lands in the ten directions.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　以此為輪嚴飾地，　　香水映徹常盈滿。",
        "translation": "Because of this they adorned the ground with wheels, Always filling it with fragrant water.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　摩尼為網金為鐸，　　遍覆香河演佛音，",
        "translation": "Nets of jewels and golden bells; Covering fragrant rivers, they utter the sounds of buddhahood.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　克宣一切菩提道，　　及以普賢之妙行。",
        "translation": "He proclaims all the paths of enlightenment and the wonderful practices of Samantabhadra.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　寶岸摩尼極清淨，　　恒出如來本願音，",
        "translation": "The jewel of the jeweled shore is extremely pure, Always producing the voice of the Buddha’s original vow.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　一切諸佛曩所行，　　其音普演皆令見。",
        "translation": "All the buddhas’ gross deeds Their voices speak everywhere, causing all to see.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　其河所有漩流處，　　菩薩如雲常踊出，",
        "translation": "Wherever the river whirls, Enlightening beings emerge like clouds.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　悉往廣大剎土中，　　乃至法界咸充滿。",
        "translation": "They all go to vast buddha-lands, Filling the entire cosmos.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　清淨珠王布若雲，　　一切香河悉彌覆，",
        "translation": "The pure jewel king is spread like clouds, Covering all the fragrant rivers.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "　其珠等佛眉間相，　　炳然顯現諸佛影。」",
        "translation": "The pearls and other marks of the Buddha between his eyebrows clearly show the shadows of the buddhas.",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "爾時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "At that point, wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses:",
        "source": "T10n0279_008:0040c25_48"
    },
    {
        "source_sentence": "此諸香水河，兩間之地，悉以妙寶種種莊嚴，一一各有四天下微塵數眾寶莊嚴；",
        "translation": "Each of these rivers of fragrant water and the earth between them all had various adornments of exquisite jewels, each with arrays of as many jewels as atoms in four continents.",
        "source": "T10n0279_008:0041a18_49"
    },
    {
        "source_sentence": "芬陀利華周匝遍滿，各有四天下微塵數；",
        "translation": "It was surrounded by lotus blossoms, each as numerous as the atoms in four continents.",
        "source": "T10n0279_008:0041a20_50"
    },
    {
        "source_sentence": "眾寶樹林次第行列，一一樹中恒出一切諸莊嚴雲，摩尼寶王照耀其間，",
        "translation": "In the forests of various jewels stood in rows, one by one producing clouds of all kinds of adornments from each tree. Between them shone diamond-jewel kings.",
        "source": "T10n0279_008:0041a21_51"
    },
    {
        "source_sentence": "種種華香處處盈滿；",
        "translation": "Everywhere it was filled with various flowers and fragrances.",
        "source": "T10n0279_008:0041a23_52"
    },
    {
        "source_sentence": "其樹復出微妙音聲，說諸如來一切劫中所修大願；",
        "translation": "The tree also produced a subtle sound, saying the great vows cultivated by all buddhas in all world ages.",
        "source": "T10n0279_008:0041a23_53"
    },
    {
        "source_sentence": "復散種種摩尼寶王，充遍其地，所謂：蓮華輪摩尼寶王、香焰光雲摩尼寶王、種種嚴飾摩尼寶王、現不可思議莊嚴色摩尼寶王、日光明衣藏摩尼寶王、周遍十方普垂布光網雲摩尼寶王、現一切諸佛神變摩尼寶王、現一切眾生業報海摩尼寶王……如是等，",
        "translation": "They also scattered various kinds of maṇi jewel kings pervading the ground, called lotus-wheel maṇi jewel kings, fragrant clouds of light from fragrant flames, various adornments maṇi jewel kings, maṇi jewel kings displaying inconceivable arrays of colors, maṇi jewel",
        "source": "T10n0279_008:0041a24_54"
    },
    {
        "source_sentence": "有世界海微塵數。",
        "translation": "There are as many worlds as there are atoms in an ocean of worlds.",
        "source": "T10n0279_008:0041b01_55"
    },
    {
        "source_sentence": "其香水河，兩間之地，一一悉具如是莊嚴。」",
        "translation": "Each of those fragrant rivers and the two grounds between them are all adorned like this.",
        "source": "T10n0279_008:0041b02_56"
    },
    {
        "source_sentence": "「其地平坦極清淨，　　真金摩尼共嚴飾，",
        "translation": "The ground is level and perfectly pure, Adorned with jewels made of gold.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　諸樹行列蔭其中，　　聳幹垂條華若雲。",
        "translation": "The rows of trees lined up to shade the ground, With lofty trunks hanging down like clouds.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　枝條妙寶所莊嚴，　　華焰成輪光四照，",
        "translation": "Its branches are adorned with exquisite jewels; Flowery flames form a circle of light shining in all directions.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　摩尼為果如雲布，　　普使十方常現覩。",
        "translation": "The fruit of jewels is like clouds spread, Causing all to always appear in the ten directions.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　摩尼布地皆充滿，　　眾華寶末共莊嚴，",
        "translation": "The ground was covered with jewels, Filled with various flowers and jewels, Adorned together.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　復以摩尼作宮殿，　　悉現眾生諸影像。",
        "translation": "Again, they make a palace of jewels, All showing the images of sentient beings.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　諸佛影像摩尼王，　　普散其地靡不周，",
        "translation": "The jewel king reflecting the images of Buddhas Is scattered everywhere, reaching everywhere.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　如是赫奕遍十方，　　一一塵中咸見佛。",
        "translation": "Thus he pervaded the ten directions, Seeing all buddhas in each and every atom.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　妙寶莊嚴善分布，　　真珠燈網相間錯，",
        "translation": "The arrays of the finest jewels are well distributed, With networks of pearl lamps interspersed.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　處處悉有摩尼輪，　　一一皆現佛神通。",
        "translation": "Everywhere there are jewel discs, Each one manifesting Buddha’s mystic powers.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　眾寶莊嚴放大光，　　光中普現諸化佛，",
        "translation": "The arrays of myriad jewels emanate great rays of light, In which are manifested the phantom buddhas.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　一一周行靡不遍，　　悉以十力廣開演。",
        "translation": "Every day and week they travel everywhere, All expounded with the ten powers.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　摩尼妙寶芬陀利，　　一切水中咸遍滿，",
        "translation": "All the waters are filled with jewels, beautiful jewels, and finest treasures, Filling them all over.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　其華種種各不同，　　悉現光明無盡歇。",
        "translation": "The various kinds of flowers are each different, All manifesting infinite rays of light.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　三世所有諸莊嚴，　　摩尼果中皆顯現，",
        "translation": "All the adornments of all times Are manifested in the crystal fruits.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　體性無生不可取，　　此是如來自在力。",
        "translation": "The essential nature of nonorigination cannot be grasped: This is the unimpeded power of Buddha.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　此地一切莊嚴中，　　悉現如來廣大身，",
        "translation": "In all the adornments of this earth They show the Buddha’s vast body.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　彼亦不來亦不去，　　佛昔願力皆令見。",
        "translation": "They neither come nor go, Yet by the power of Buddha’s past vows they show them all.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　此地一一微塵中，　　一切佛子修行道，",
        "translation": "In each speck of dust on this earth All the Buddha-children practice enlightenment:",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "　各見所記當來剎，　　隨其意樂悉清淨。」",
        "translation": "Each sees the future buddha that's recorded, and it's completely pure according to their intentions.",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "爾時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "At that point, wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses:",
        "source": "T10n0279_008:0041b03_57"
    },
    {
        "source_sentence": "諸佛世尊世界海，莊嚴不可思議。",
        "translation": "The ocean of worlds of buddhas and world-honored ones is inconceivably adorned.",
        "source": "T10n0279_008:0041b25_58"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_008:0041b26_59"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_008:0041b26_60"
    },
    {
        "source_sentence": "此華藏莊嚴世界海一切境界，一一皆以世界海微塵數清淨功德之所莊嚴。」",
        "translation": "This Flower Treasury adorns all the realms in the ocean of worlds, each one adorned by pure virtues as numerous as atoms in an ocean of worlds.",
        "source": "T10n0279_008:0041b26_61"
    },
    {
        "source_sentence": "「此剎海中一切處，　　悉以眾寶為嚴飾，",
        "translation": "All the places in this ocean of worlds Are beautifully adorned with various jewels.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　發焰騰空布若雲，　　光明洞徹常彌覆。",
        "translation": "The blazing rising sky is spread like a cloud, and its light penetrates and always covers it.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　摩尼吐雲無有盡，　　十方佛影於中現，",
        "translation": "Jewels emanate clouds without end, The reflection of Buddhas appearing in the ten directions.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　神通變化靡暫停，　　一切菩薩咸來集。",
        "translation": "All the enlightening beings, with miraculous powers and mystic displays, do not cease; All the enlightening beings are assembled.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　一切摩尼演佛音，　　其音美妙不思議，",
        "translation": "All the jewels produce Buddha’s voice, The sound of which is beautiful and inconceivable.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　毘盧遮那昔所行，　　於此寶內恒聞見。",
        "translation": "What Vairocana did in the past, he always heard and saw within this treasure.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　清淨光明遍照尊，　　莊嚴具中皆現影，",
        "translation": "Venerable Universal Illumination of Pure Light, All-Illumining Honored One, Shows his reflection in the adornments.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　變化分身眾圍遶，　　一切剎海咸周遍。",
        "translation": "Surrounded by mystical manifestation bodies, They pervade all oceans of worlds.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　所有化佛皆如幻，　　求其來處不可得，",
        "translation": "All the apparitional buddhas there are like illusions, Unable to find where they come from.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　以佛境界威神力，　　一切剎中如是現。",
        "translation": "By the mystic power of the Buddha’s sphere, They appear like this in all lands.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　如來自在神通事，　　悉遍十方諸國土，",
        "translation": "The deeds of the Buddha’s supernatural powers Pervade all lands in the ten directions.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　以此剎海淨莊嚴，　　一切皆於寶中見。",
        "translation": "Because these oceans of worlds are purely adorned, All are seen in the jewels.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　十方所有諸變化，　　一切皆如鏡中像，",
        "translation": "All the manifestations in the ten directions Are like reflections in a mirror.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　但由如來昔所行，　　神通願力而出生。",
        "translation": "It's simply the result of what the Tathāgata did in the past, and it's produced by the power of his supernormal abilities and vows.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　若有能修普賢行，　　入於菩薩勝智海，",
        "translation": "If any can cultivate the practice of universal goodness, They’ll enter the ocean of enlightening beings’ supreme knowledge.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　能於一切微塵中，　　普現其身淨眾剎。",
        "translation": "In all the tiny atoms, They can manifest their bodies everywhere And purify many lands.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　不可思議億大劫，　　親近一切諸如來，",
        "translation": "For inconceivable billions of eons They associate with all the Buddhas.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　如其一切之所行，　　一剎那中悉能現。",
        "translation": "Whatever they do, They can manifest it in a single instant.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　諸佛國土如虛空，　　無等無生無有相，",
        "translation": "The buddha-lands are like space, Equal to nothing, formless, and signless.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "　為利眾生普嚴淨，　　本願力故住其中。」",
        "translation": "In order to benefit sentient beings, they are universally adorned and pure, and they abide there because of the power of their original vow.",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "爾時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "At that point, wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses:",
        "source": "T10n0279_008:0041b28_62"
    },
    {
        "source_sentence": "此中有何等世界住？",
        "translation": "What world does it live in?",
        "source": "T10n0279_008:0041c22_63"
    },
    {
        "source_sentence": "我今當說。",
        "translation": "I will now explain it.",
        "source": "T10n0279_008:0041c23_64"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_008:0041c23_65"
    },
    {
        "source_sentence": "此不可說佛剎微塵數香水海中，有不可說佛剎微塵數世界種安住；",
        "translation": "In these seas of fragrant waters, as many as atoms in untold buddha-lands, were as many world systems dwelling there.",
        "source": "T10n0279_008:0041c23_66"
    },
    {
        "source_sentence": "一一世界種，復有不可說佛剎微塵數世界。",
        "translation": "In each world system there are as many worlds as atoms in untold buddha-lands.",
        "source": "T10n0279_008:0041c25_67"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_008:0041c26_68"
    },
    {
        "source_sentence": "彼諸世界種，於世界海中，各各依住，各各形狀，各各體性，各各方所，",
        "translation": "In the ocean of worlds there are various world systems, each based on its own abode, shaped according to its form, essence according to its nature, and location in different directions.",
        "source": "T10n0279_008:0041c26_69"
    },
    {
        "source_sentence": "各各趣入，各各莊嚴，各各分齊，各各行列，各各無差別，各各力加持。",
        "translation": "Each has its own entry and exit, its own adornment, its own differentiation, its own alignment, its own array, its own distinction, and its own empowerment.",
        "source": "T10n0279_008:0041c28_70"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_008:0041c29_71"
    },
    {
        "source_sentence": "此世界種，或有依大蓮華海住，或有依無邊色寶華海住，或有依一切真珠藏寶瓔珞海住，",
        "translation": "“Some of these world systems rest on great oceans of lotus blossoms, some on oceans of jewel flowers of boundless colors, and some on oceans of necklaces made of all kinds of precious pearls.",
        "source": "T10n0279_008:0041c29_72"
    },
    {
        "source_sentence": "或有依香水海住，或有依一切華海住，或有依摩尼寶網海住，或有依漩流光海住，",
        "translation": "Some abide on the basis of an ocean of fragrant water; some abide on the basis of an ocean of all flowers; some abide on the basis of an ocean of networks of jewels; some abide on the basis of an ocean of swirling light.",
        "source": "T10n0279_008:0042a03_0"
    },
    {
        "source_sentence": "或有依菩薩寶莊嚴冠海住，或有依種種眾生身海住，或有依一切佛音聲摩尼王海住……。",
        "translation": "Some abide on the basis of an ocean of jeweled crowns adorned by enlightening beings; some abide on the basis of an ocean of bodies of various sentient beings; some abide on the basis of an ocean of myriad jewels, sounds and voices of all buddhas.",
        "source": "T10n0279_008:0042a04_1"
    },
    {
        "source_sentence": "如是等，若廣說者，有世界海微塵數。",
        "translation": "Such and so on, if explained in detail, are as numerous as atoms in an ocean of worlds.",
        "source": "T10n0279_008:0042a07_0"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_008:0042a07_1"
    },
    {
        "source_sentence": "彼一切世界種，或有作須彌山形，或作江河形，或作迴轉形，或作漩流形，",
        "translation": "In all those world systems some are shaped like mountains, some like rivers, some like whirlpools, and some like mountains.",
        "source": "T10n0279_008:0042a08_0"
    },
    {
        "source_sentence": "或作輪輞形，或作壇墠形，或作樹林形，或作樓閣形，或作山幢形，或作普方形，",
        "translation": "They may be shaped like a circle, or like an altar posture, or like a forest, or like a tower, or like a mountain banner, or like a square.",
        "source": "T10n0279_008:0042a09_1"
    },
    {
        "source_sentence": "或作胎藏形，或作蓮華形，或作佉勒迦形，或作眾生身形，或作雲形，",
        "translation": "Some are shaped like womb, some like lotus blossoms, some like garlands, some like the bodies of sentient beings, some like clouds.",
        "source": "T10n0279_008:0042a11_2"
    },
    {
        "source_sentence": "或作諸佛相好形，或作圓滿光明形，或作種種珠網形，或作一切門闥形，",
        "translation": "They may take the forms of the marks and embellishments of buddhas, or they may take the forms of their full glory, or they may take the forms of various pearl nets, or they may take the forms of all kinds of doors.",
        "source": "T10n0279_008:0042a13_3"
    },
    {
        "source_sentence": "或作諸莊嚴具形……。",
        "translation": "Or they may make the form of adornments...",
        "source": "T10n0279_008:0042a14_4"
    },
    {
        "source_sentence": "如是等，若廣說者，有世界海微塵數。",
        "translation": "Such and so on, if explained in detail, are as numerous as atoms in an ocean of worlds.",
        "source": "T10n0279_008:0042a15_5"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_008:0042a16_0"
    },
    {
        "source_sentence": "彼一切世界種，或有以十方摩尼雲為體，或有以眾色焰為體，或有以諸光明為體，",
        "translation": "In all those world systems some of them have clouds of jewels as their essence; some have flames of various colors as their essence; some have lights as their essence.",
        "source": "T10n0279_008:0042a16_1"
    },
    {
        "source_sentence": "或有以寶香焰為體，或有以一切寶莊嚴多羅華為體，或有以菩薩影像為體，",
        "translation": "Some have jewel fragrant flames as their essence, some with arrays of all kinds of jewel flowers as their essence, and some with images of enlightening beings as their essence.",
        "source": "T10n0279_008:0042a18_2"
    },
    {
        "source_sentence": "或有以諸佛光明為體，或有以佛色相為體，或有以一寶光為體，或有以眾寶光為體，",
        "translation": "Some have the light of buddhas as their essence; some have the form and characteristics of buddhas as their essence; some have the light of a single jewel as their essence; some have the light of myriad jewels as their essence.",
        "source": "T10n0279_008:0042a19_3"
    },
    {
        "source_sentence": "或有以一切眾生福德海音聲為體，或有以一切眾生諸業海音聲為體，或有以一切佛境界清淨音聲為體，",
        "translation": "Some are embodied in the sound of the ocean of virtues of all sentient beings; some are embodied in the sound of the ocean of actions of all sentient beings; some are embodied in the sound of the pure realm of buddhahood of all buddhas.",
        "source": "T10n0279_008:0042a21_4"
    },
    {
        "source_sentence": "或有以一切菩薩大願海音聲為體，或有以一切佛方便音聲為體，或有以一切剎莊嚴具成壞音聲為體，",
        "translation": "Some are embodied in the sounds of the oceans of vows of all enlightening beings; some are embodied in the sounds of the means of liberation of all buddhas; some are embodied in the sounds of the adornments of all buddha-lands.",
        "source": "T10n0279_008:0042a24_5"
    },
    {
        "source_sentence": "或有以無邊佛音聲為體，或有以一切佛變化音聲為體，或有以一切眾生善音聲為體，",
        "translation": "Some have the voice of infinite Buddha as their essence; some have the voices of all buddhas’ emanations as their essence; some have the sounds of all sentient beings’ goodness as their essence.",
        "source": "T10n0279_008:0042a26_6"
    },
    {
        "source_sentence": "或有以一切佛功德海清淨音聲為體……。",
        "translation": "Perhaps there are those whose essence is the pure sounds of the ocean of the merits of all buddhas...",
        "source": "T10n0279_008:0042a28_7"
    },
    {
        "source_sentence": "如是等，若廣說者，有世界海微塵數。」",
        "translation": "If we explain this extensively, there are as many such things as there are atoms in an ocean of worlds.",
        "source": "T10n0279_008:0042a29_8"
    },
    {
        "source_sentence": "「剎種堅固妙莊嚴，　　廣大清淨光明藏，",
        "translation": "The world systems are firm and beautifully arrayed, A vast store of pure light.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　依止蓮華寶海住，　　或有住於香海等。",
        "translation": "Some dwell in oceans of lotus blossom jewels; Some dwell in oceans of fragrance, etc.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　須彌城樹壇墠形，　　一切剎種遍十方，",
        "translation": "In the shape of a mountain-citation tree or an altar, All kinds of worlds pervade the ten directions.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　種種莊嚴形相別，　　各各布列而安住。",
        "translation": "The various adornments and forms are distinct, Each arranged in a row and settled there.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　或有體是淨光明，　　或是華藏及寶雲，",
        "translation": "Some have the essence of pure light; Some are stores of flowers or clouds of jewels.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　或有剎種焰所成，　　安住摩尼不壞藏。",
        "translation": "Some lands, planted by the seeds of blazing flames, Rest in an indestructible mine of jewels.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　燈雲焰彩光明等，　　種種無邊清淨色，",
        "translation": "The clouds of lamps, flames, colors, lights, and so on, Various various boundless pure forms:",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　或有言音以為體，　　是佛所演不思議。",
        "translation": "Some have words and sounds as their essence; The Buddha teaches inconceivably.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　或是願力所出音，　　神變音聲為體性，",
        "translation": "Or it may be the voice emanating from the power of vows, The essence of which is the voice of mystical displays.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　一切眾生大福業，　　佛功德音亦如是。",
        "translation": "The great meritorious deeds of all sentient beings are likewise the Buddha’s virtuous voice.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　剎種一一差別門，　　不可思議無有盡，",
        "translation": "Each distinctive aspect of the world systems Is inconceivable, without end.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　如是十方皆遍滿，　　廣大莊嚴現神力。",
        "translation": "In the ten directions like this they all pervade, Extensively adorned, manifesting spiritual powers.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　十方所有廣大剎，　　悉來入此世界種，",
        "translation": "All the vast lands in the ten directions Have all come into this world system.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　雖見十方普入中，　　而實無來無所入。",
        "translation": "Even though they see everywhere in the ten directions, Yet there really is no coming and nothing to enter.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　以一剎種入一切，　　一切入一亦無餘，",
        "translation": "Entering all with one kind of world, All enter into one, without exception.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　體相如本無差別，　　無等無量悉周遍。",
        "translation": "Their essence and characteristics are as before, without distinction, Equal or unequal or infinite, they all pervade.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　一切國土微塵中，　　普見如來在其所，",
        "translation": "In a speck of dust in all lands They see the enlightened beings everywhere.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　願海言音若雷震，　　一切眾生悉調伏。",
        "translation": "The ocean of vows’ words and sounds like thunder shakes All sentient beings are completely subdued.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　佛身周遍一切剎，　　無數菩薩亦充滿，",
        "translation": "Buddha’s body pervades all lands, Filled with countless enlightening beings.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "　如來自在無等倫，　　普化一切諸含識。」",
        "translation": "The Tathāgata has no equal, and he universally transforms all the contained consciousnesses.",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "爾時，普賢菩薩欲重宣其義，承佛神力，觀察十方而說頌言：爾時，普賢菩薩復告大眾言：「諸佛子！",
        "translation": "At that point, wanting to reiterate its meaning, the enlightening being Universally Good, imbued with the spiritual power of Buddha, looked over the ten directions and spoke these verses:",
        "source": "T10n0279_008:0042b01_9"
    },
    {
        "source_sentence": "此不可說佛剎微塵數香水海，在華藏莊嚴世界海中，如天帝網分布而住。",
        "translation": "These seas of fragrant waters, as numerous as atoms in untold buddha-lands, rest in the ocean of worlds adorned with lotus treasuries, distributing and dwelling like Indra’s net.",
        "source": "T10n0279_008:0042b23_10"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_008:0042b25_11"
    },
    {
        "source_sentence": "此最中央香水海，名：無邊妙華光，以現一切菩薩形摩尼王幢為底；",
        "translation": "At the center of this ocean of fragrant water, called Boundless Light of Sublime Flowers, is a jewel-king banner reflecting the forms of all enlightening beings.",
        "source": "T10n0279_008:0042b25_12"
    },
    {
        "source_sentence": "出大蓮華，名：一切香摩尼王莊嚴；",
        "translation": "A great lotus blossom emerged, called Array of all kinds of fragrant diamonds.",
        "source": "T10n0279_008:0042b27_13"
    },
    {
        "source_sentence": "有世界種而住其上，名：普照十方熾然寶光明，以一切莊嚴具為體，有不可說佛剎微塵數世界於中布列。",
        "translation": "Above them was a world system called blazing jewel light shining everywhere in the ten directions, composed of all adornments, with as many worlds therein as atoms in untold buddha-lands.",
        "source": "T10n0279_008:0042b28_14"
    },
    {
        "source_sentence": "其最下方有世界，名：最勝光遍照，以一切金剛莊嚴光耀輪為際，依眾寶摩尼華而住；",
        "translation": "At the bottom of that system is a world called Supreme Light Illumining Everywhere, bounded by spheres of radiance adorned with all diamonds, resting on jewel flowers of myriad jewels.",
        "source": "T10n0279_008:0042c01_15"
    },
    {
        "source_sentence": "其狀猶如摩尼寶形，一切寶華莊嚴雲彌覆其上，佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a jewel, covered by clouds of arrays of all kinds of jewel flowers, surrounded by worlds as numerous as atoms in buddha-lands.",
        "source": "T10n0279_008:0042c03_16"
    },
    {
        "source_sentence": "種種安住，種種莊嚴，佛號：淨眼離垢燈。",
        "translation": "Various abodes, various adornments: The Buddha is called Undefiled Lamp of the Pure Eye.",
        "source": "T10n0279_008:0042c05_17"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：種種香蓮華妙莊嚴，以一切莊嚴具為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Array of Exquisite Adornments of Various Fragrant Lotuses, bounded by all adornments.",
        "source": "T10n0279_008:0042c06_18"
    },
    {
        "source_sentence": "依寶蓮華網而住；",
        "translation": "They live on the network of jewel lotus blossoms.",
        "source": "T10n0279_008:0042c07_19"
    },
    {
        "source_sentence": "其狀猶如師子之座，一切寶色珠帳雲彌覆其上，二佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a lion seat, covered with clouds of drapes of jeweled curtains of all precious colors, surrounded by as many worlds as atoms in two buddha-fields.",
        "source": "T10n0279_008:0042c08_20"
    },
    {
        "source_sentence": "佛號：師子光勝照。",
        "translation": "The Buddha's name was Shizi Guangshengzhao.",
        "source": "T10n0279_008:0042c10_21"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：一切寶莊嚴普照光，以香風輪為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Universal Illumination Adorned with All Jewels, bounded by atmospheres of fragrance and wind.",
        "source": "T10n0279_008:0042c10_22"
    },
    {
        "source_sentence": "依種種寶華瓔珞住；",
        "translation": "They dwelled in various kinds of precious jewelry, adorned with jewel flowers.",
        "source": "T10n0279_008:0042c12_23"
    },
    {
        "source_sentence": "其形八隅，妙光摩尼日輪雲而覆其上，三佛剎微塵數世界周匝圍遶，佛號：淨光智勝幢。",
        "translation": "It was eight-cornered in shape, covered by clouds of jewel sun-wheels of exquisite light; it was surrounded by worlds as numerous as atoms in three buddha-lands. The Buddha there was called Supreme Banner of Pure Light and Knowledge.",
        "source": "T10n0279_008:0042c12_24"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：種種光明華莊嚴，以一切寶王為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Array of flowers of various lights, bounded by kings of all jewels.",
        "source": "T10n0279_008:0042c14_25"
    },
    {
        "source_sentence": "依眾色金剛尸羅幢海住；",
        "translation": "They dwelled in the ocean of buddha-lands of various colors, adorned with all kinds of embellishments.",
        "source": "T10n0279_008:0042c16_26"
    },
    {
        "source_sentence": "其狀猶如摩尼蓮華，以金剛摩尼寶光雲而覆其上，四佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a maṇi lotus flower, covered with clouds of light emanating from diamond jewels, surrounded by as many worlds as atoms in four buddha-fields.",
        "source": "T10n0279_008:0042c16_27"
    },
    {
        "source_sentence": "純一清淨，佛號：金剛光明無量精進力善出現。",
        "translation": "Pure and unadulterated, the Buddha is called Good manifestation of the Vajra Radiance of Immeasurable Energy.",
        "source": "T10n0279_008:0042c18_28"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：普放妙華光，以一切寶鈴莊嚴網為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Producing Sublime Flower Light Beams, bounded by networks adorned with bells of all jewels.",
        "source": "T10n0279_008:0042c19_29"
    },
    {
        "source_sentence": "依一切樹林莊嚴寶輪網海住；",
        "translation": "They live in the ocean of networks of jewel spheres adorned with all kinds of trees and forests.",
        "source": "T10n0279_008:0042c21_30"
    },
    {
        "source_sentence": "其形普方而多有隅角，梵音摩尼王雲以覆其上，五佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a square, with many corners and horns. Covered by clouds of the jewel king Brahma sound, it was surrounded by as many worlds as atoms in five buddha-fields.",
        "source": "T10n0279_008:0042c22_31"
    },
    {
        "source_sentence": "佛號：香光喜力海。",
        "translation": "The Buddha is called Ocean of the Joyful Power of Fragrance and Light.",
        "source": "T10n0279_008:0042c24_32"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：淨妙光明，以寶王莊嚴幢為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Pure Sublime Light, bounded by Banner Adorned by King of Jewels.",
        "source": "T10n0279_008:0042c24_33"
    },
    {
        "source_sentence": "依金剛宮殿海住；",
        "translation": "They dwelled in the ocean of abodes of the diamond palace.",
        "source": "T10n0279_008:0042c26_0"
    },
    {
        "source_sentence": "其形四方，摩尼輪髻帳雲而覆其上，六佛剎微塵數世界周匝圍遶，佛號：普光自在幢。",
        "translation": "Its form is fourfold in all directions, covered by clouds of jewel-tufted drapes, surrounded by worlds as numerous as atoms in six buddha-lands. The Buddha there is called Independent Banner of Universal Light.",
        "source": "T10n0279_008:0042c26_1"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：眾華焰莊嚴，以種種華莊嚴為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Array of Flames of Myriad Flowers, bounded by arrays of various flowers.",
        "source": "T10n0279_008:0042c28_2"
    },
    {
        "source_sentence": "依一切寶色焰海住；",
        "translation": "Based on the ocean of flames of all jewel forms, they abide.",
        "source": "T10n0279_008:0042c29_3"
    },
    {
        "source_sentence": "其狀猶如樓閣之形，一切寶色衣真珠欄楯雲而覆其上，七佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a tower, covered with clouds of railings and shields of all jewel colors, draped by as many worlds surrounding it as atoms in seven buddha-lands.",
        "source": "T10n0279_008:0043a01_4"
    },
    {
        "source_sentence": "純一清淨，佛號：歡喜海功德名稱自在光。",
        "translation": "Pure and unadulterated pure, the Buddha is called Rejoicing in the Ocean of Virtue.",
        "source": "T10n0279_008:0043a03_5"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：出生威力地，以出一切聲摩尼王莊嚴為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Producing Ground of Majestic Power, bounded by arrays of diamonds producing all sounds.",
        "source": "T10n0279_008:0043a04_6"
    },
    {
        "source_sentence": "依種種寶色蓮華座虛空海住；",
        "translation": "They rest on various jewel-colored lotus thrones in the sky and oceans of space.",
        "source": "T10n0279_008:0043a06_7"
    },
    {
        "source_sentence": "其狀猶如因陀羅網，以無邊色華網雲而覆其上，八佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like the net of Indra, covered with clouds of webs of flowers of boundless colors, surrounded by as many worlds as atoms in eight buddha-fields.",
        "source": "T10n0279_008:0043a06_8"
    },
    {
        "source_sentence": "佛號：廣大名稱智海幢。",
        "translation": "The Buddha is called vastly renowned as the great banner of the ocean of knowledge.",
        "source": "T10n0279_008:0043a08_9"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：出妙音聲，以心王摩尼莊嚴輪為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Producing Sublime Sound, bounded by Orbs Adorned with Mind King Jewels.",
        "source": "T10n0279_008:0043a09_10"
    },
    {
        "source_sentence": "依恒出一切妙音聲莊嚴雲摩尼王海住；",
        "translation": "“Great enlightening beings of the ten directions abide in oceans of jewel mines, arrayed with clouds of all kinds of beautiful sounds emanating constantly.",
        "source": "T10n0279_008:0043a10_11"
    },
    {
        "source_sentence": "其狀猶如梵天身形，無量寶莊嚴師子座雲而覆其上，九佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like the bodies of the Brahma gods, covered with clouds of lion seats adorned with infinite jewels, surrounded by as many worlds as atoms in nine buddha-lands.",
        "source": "T10n0279_008:0043a11_12"
    },
    {
        "source_sentence": "佛號：清淨月光明相無能摧伏。",
        "translation": "The Buddha's name is Pure Moonlight, which has no ability to subdue the characteristic of light.",
        "source": "T10n0279_008:0043a13_13"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：金剛幢，以無邊莊嚴真珠藏寶瓔珞為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Diamond Banner, bounded by diamond necklaces adorned with boundless jewel mines of pearls.",
        "source": "T10n0279_008:0043a14_14"
    },
    {
        "source_sentence": "依一切莊嚴寶師子座摩尼海住；",
        "translation": "They dwelled on the sea of jewels of all kinds of adornments, such as lion seats.",
        "source": "T10n0279_008:0043a16_15"
    },
    {
        "source_sentence": "其狀周圓，十須彌山微塵數一切香摩尼華須彌雲彌覆其上，十佛剎微塵數世界周匝圍遶，",
        "translation": "Its shape was circular, covered with clouds of all kinds of fragrant jewel flowers as numerous as atoms in ten mountains, surrounded by worlds as numerous as atoms in ten buddha-lands.",
        "source": "T10n0279_008:0043a17_16"
    },
    {
        "source_sentence": "純一清淨，佛號：一切法海最勝王。",
        "translation": "Pure and unadulterated, the Buddha is called Supreme King of All Oceans of Truth.",
        "source": "T10n0279_008:0043a19_17"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：恒出現帝青寶光明，以極堅牢不可壞金剛莊嚴為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Constantly Manifesting sapphire light, bounded by indestructible adamantine adornments.",
        "source": "T10n0279_008:0043a20_0"
    },
    {
        "source_sentence": "依種種殊異華海住；",
        "translation": "They abide on the basis of various different oceans of flowers.",
        "source": "T10n0279_008:0043a22_1"
    },
    {
        "source_sentence": "其狀猶如半月之形，諸天寶帳雲而覆其上，十一佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a crescent moon, covered by clouds of heavenly jewel drapes, surrounded by as many worlds as atoms in eleven buddha-lands.",
        "source": "T10n0279_008:0043a22_2"
    },
    {
        "source_sentence": "佛號：無量功德法。",
        "translation": "The Buddha is called Dharma of Immeasurable Merit.",
        "source": "T10n0279_008:0043a24_3"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：光明照耀，以普光莊嚴為際，依華旋香水海住；",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Light Beams Illumining; bounded by arrays of universal light, it rests on the sea of fragrant water Whirling with Flowers.",
        "source": "T10n0279_008:0043a24_4"
    },
    {
        "source_sentence": "狀如華旋，種種衣雲而覆其上，十二佛剎微塵數世界周匝圍遶，佛號：超釋梵。",
        "translation": "It was shaped like a flower whirling, covered by clouds of various raiments, surrounded by as many worlds as atoms in twelve buddha-lands. The Buddha there was called Transcending the God Brahma.",
        "source": "T10n0279_008:0043a26_5"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，至此世界，名：娑婆，以金剛莊嚴為際，依種種色風輪所持蓮華網住；",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Sarva, bounded by diamond adornments, resting on lotus nets of various colors supported by wind whirlwinds.",
        "source": "T10n0279_008:0043a28_6"
    },
    {
        "source_sentence": "狀如虛空，以普圓滿天宮殿莊嚴虛空雲而覆其上，十三佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like space, covered with clouds of celestial palaces adorning the sky, surrounded by as many worlds as atoms in thirteen buddha-lands.",
        "source": "T10n0279_008:0043b01_7"
    },
    {
        "source_sentence": "其佛即是毘盧遮那如來世尊。",
        "translation": "That Buddha is the Bhagavān Vairocana, the Tathāgata of Vairocana.",
        "source": "T10n0279_008:0043b03_8"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：寂靜離塵光，以一切寶莊嚴為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Dustless Light of Tranquility, bounded by arrays of all jewels.",
        "source": "T10n0279_008:0043b04_9"
    },
    {
        "source_sentence": "依種種寶衣海住；",
        "translation": "They live on the basis of a sea of various jeweled raiment.",
        "source": "T10n0279_008:0043b06_10"
    },
    {
        "source_sentence": "其狀猶如執金剛形，無邊色金剛雲而覆其上，十四佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a holding vajra, covered by clouds of boundless-colored adamantine clouds, surrounded by as many worlds as atoms in fourteen buddha-lands.",
        "source": "T10n0279_008:0043b06_11"
    },
    {
        "source_sentence": "佛號：遍法界勝音。",
        "translation": "The Buddha is called Supreme Sound Pervading the Realm of Reality.",
        "source": "T10n0279_008:0043b08_12"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：眾妙光明燈，以一切莊嚴帳為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Lamp of Myriad Subtle Lights, bounded by drapes of all adornments.",
        "source": "T10n0279_008:0043b08_13"
    },
    {
        "source_sentence": "依淨華網海住；",
        "translation": "They dwelled on the ocean of pure lotus nets.",
        "source": "T10n0279_008:0043b10_14"
    },
    {
        "source_sentence": "其狀猶如卐字之形，摩尼樹香水海雲而覆其上，十五佛剎微塵數世界周匝圍遶，",
        "translation": "Its shape was like the shape of a nymph, covered by clouds of fragrant oceans of jewel trees and perfumed seas, surrounded by as many worlds as atoms in fifteen buddha-lands.",
        "source": "T10n0279_008:0043b10_15"
    },
    {
        "source_sentence": "純一清淨，佛號：不可摧伏力普照幢。",
        "translation": "Purely one pure, the Buddha is called Universal Illumination Banner of Invincible Power.",
        "source": "T10n0279_008:0043b12_16"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：清淨光遍照，以無盡寶雲摩尼王為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Pure Light Shining Everywhere, bounded by diamond kings of inexhaustible clouds of jewels.",
        "source": "T10n0279_008:0043b13_17"
    },
    {
        "source_sentence": "依種種香焰蓮華海住；",
        "translation": "They abide in the ocean of lotus blossoms with various fragrant flames.",
        "source": "T10n0279_008:0043b15_18"
    },
    {
        "source_sentence": "其狀猶如龜甲之形，圓光摩尼輪栴檀雲而覆其上，十六佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a tortoise shell, covered with clouds of sandalwood from the circle of radiant jewels, surrounded by as many worlds as atoms in sixteen buddha-lands.",
        "source": "T10n0279_008:0043b15_19"
    },
    {
        "source_sentence": "佛號：清淨日功德眼。",
        "translation": "The Buddha's name was Pure Sunlight of the Eye of Virtue.",
        "source": "T10n0279_008:0043b17_20"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：寶莊嚴藏，以一切眾生形摩尼王為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Jewel Ornament Treasury, bounded by diamond kings shaped like all sentient beings.",
        "source": "T10n0279_008:0043b18_21"
    },
    {
        "source_sentence": "依光明藏摩尼王海住；",
        "translation": "They dwelled in the ocean of jewels from the treasury of light.",
        "source": "T10n0279_008:0043b19_22"
    },
    {
        "source_sentence": "其形八隅，以一切輪圍山寶莊嚴華樹網彌覆其上，十七佛剎微塵數世界周匝圍遶，",
        "translation": "It was eight-cornered in shape, covered with networks of flowery trees adorned with the jewels of all the surrounding mountains, surrounded by as many worlds as atoms in seventeen buddha-lands.",
        "source": "T10n0279_008:0043b20_23"
    },
    {
        "source_sentence": "佛號：無礙智光明遍照十方。",
        "translation": "The Buddha is called Unobstructed Light of Knowledge Illumining All Directions.",
        "source": "T10n0279_008:0043b22_24"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：離塵，以一切殊妙相莊嚴為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Undefiled, bounded by arrays of all exquisite forms.",
        "source": "T10n0279_008:0043b23_25"
    },
    {
        "source_sentence": "依眾妙華師子座海住；",
        "translation": "They dwelled on the ocean of lion seats of myriad exquisite flowers.",
        "source": "T10n0279_008:0043b24_26"
    },
    {
        "source_sentence": "狀如珠瓔，以一切寶香摩尼王圓光雲而覆其上，十八佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a pearl necklace, covered with clouds of all kinds of precious fragrances and jewels, surrounded by as many worlds as atoms in eighteen buddha-lands.",
        "source": "T10n0279_008:0043b25_27"
    },
    {
        "source_sentence": "純一清淨，佛號：無量方便最勝幢。",
        "translation": "Purely one pure, the Buddha is called Supreme Banner of Immeasurable Skill in Measurelessness.",
        "source": "T10n0279_008:0043b27_28"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：清淨光普照，以出無盡寶雲摩尼王為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Pure Light Shining All Around, bounded by diamonds producing inexhaustible clouds of jewels.",
        "source": "T10n0279_008:0043b27_29"
    },
    {
        "source_sentence": "依無量色香焰須彌山海住；",
        "translation": "They abide on the shore of the ocean of mountains called Sumeru, with fragrant flames of infinite form.",
        "source": "T10n0279_008:0043b29_30"
    },
    {
        "source_sentence": "其狀猶如寶華旋布，以無邊色光明摩尼王帝青雲而覆其上，十九佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like a circle of jewel flowers, draped with blue clouds of pearls of boundless colors and lights, surrounded by as many worlds as atoms in nineteen buddha-lands.",
        "source": "T10n0279_008:0043c01_31"
    },
    {
        "source_sentence": "佛號：普照法界虛空光。",
        "translation": "The Buddha is called Space Light Illumining the All-Pervading Dharma Realm.",
        "source": "T10n0279_008:0043c03_32"
    },
    {
        "source_sentence": "此上過佛剎微塵數世界，有世界，名：妙寶焰，以普光明日月寶為際，",
        "translation": "“Above this, past as many worlds as atoms in a buddha-field, is a world called Sublime Jewel Flame, bounded by the jewel sun and moon of universal light.",
        "source": "T10n0279_008:0043c04_33"
    },
    {
        "source_sentence": "依一切諸天形摩尼王海住；",
        "translation": "They dwelled in the ocean of all celestial forms and maṇi-kingships.",
        "source": "T10n0279_008:0043c05_34"
    },
    {
        "source_sentence": "其狀猶如寶莊嚴具，以一切寶衣幢雲及摩尼燈藏網而覆其上，二十佛剎微塵數世界周匝圍遶，",
        "translation": "It was shaped like an array of jewel ornaments, covered with clouds of all kinds of jewel robes, banners, and networks of crystal lamps, surrounded by as many worlds as atoms in twenty buddha-fields.",
        "source": "T10n0279_008:0043c06_35"
    },
    {
        "source_sentence": "純一清淨，佛號：福德相光明。",
        "translation": "Pure and pure, the Buddha is called Light of Virtuous Characteristics.",
        "source": "T10n0279_008:0043c08_36"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_008:0043c09_37"
    },
    {
        "source_sentence": "此遍照十方熾然寶光明世界種，有如是等不可說佛剎微塵數廣大世界，",
        "translation": "This world system of blazing jewel light shining everywhere in the ten directions has as many such vast worlds as there are atoms in untold buddha-lands.",
        "source": "T10n0279_008:0043c09_38"
    },
    {
        "source_sentence": "各各所依住，各各形狀，各各體性，各各方面，各各趣入，各各莊嚴，",
        "translation": "Each has its own support, its own shape, its own essence, its own characteristics, its own aspects, its own entryways, and its own adornments.",
        "source": "T10n0279_008:0043c11_39"
    },
    {
        "source_sentence": "各各分齊，各各行列，各各無差別，各各力加持，周匝圍遶。",
        "translation": "Each is separated, row after row, arranged in a row, without distinction, encircled by the power of each one.",
        "source": "T10n0279_008:0043c12_40"
    },
    {
        "source_sentence": "所謂：十佛剎微塵數迴轉形世界、十佛剎微塵數江河形世界、十佛剎微塵數漩流形世界、十佛剎微塵數輪輞形世界、十佛剎微塵數壇墠形世界、十佛剎微塵數樹林形世界、十佛剎微塵數樓觀形世界、十佛剎微塵數尸羅幢形世界、十佛剎微塵數普方形世界、十佛剎微塵數胎藏形世界、十佛剎微塵數蓮華形世界、十佛剎微塵數佉勒迦形世界、十佛剎微塵數種種眾生形世界、十佛剎微塵數佛相形世界、十佛剎微塵數圓光形世界、十佛剎微塵數雲形世界、十佛剎微塵數網形世界、十佛剎微塵數門闥形世界……。",
        "translation": "They are as numerous evolving worlds as atoms in ten buddha-fields as atoms in ten buddha-fields, as many river-shaped worlds as atoms in ten buddha-fields, as many whirl-shaped worlds as atoms in ten buddha-fields, as many wheel-shaped worlds as atoms in ten buddha-field",
        "source": "T10n0279_008:0043c14_41"
    },
    {
        "source_sentence": "如是等，有不可說佛剎微塵數。",
        "translation": "There are as many such buddha-lands as atoms in untold buddha-lands.",
        "source": "T10n0279_008:0043c26_42"
    },
    {
        "source_sentence": "此一一世界，各有十佛剎微塵數廣大世界周匝圍遶。",
        "translation": "Each of these worlds is surrounded by as many vast worlds as atoms in ten buddha-lands.",
        "source": "T10n0279_008:0043c26_43"
    },
    {
        "source_sentence": "此諸世界，一一復有如上所說微塵數世界而為眷屬。",
        "translation": "Each of these worlds has as many worlds as the number of dusty particles mentioned above, and they are their followers.",
        "source": "T10n0279_008:0043c28_44"
    },
    {
        "source_sentence": "如是所說一切世界，皆在此無邊妙華光香水海及圍遶此海香水河中。」",
        "translation": "All the worlds explained in this way are here in an ocean of fragrant water with boundless beautiful flowers shining like light and surrounded by a river of fragrant water.",
        "source": "T10n0279_008:0043c29_45"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第八",
        "translation": "Dafangguang fo huayan jing, vol. 8",
        "source": "T10n0279_008:0044a02_0"
    }
]