[
    {
        "source_sentence": "佛說十地經卷第一",
        "translation": "Foshuo shidi jing, vol. 1",
        "source": "T10n0287_001:0535a23_0"
    },
    {
        "source_sentence": "大唐國僧法界從中印度持此",
        "translation": "The great Tang monks of the Dharma realm from Central India hold it here.",
        "source": "T10n0287_001:0535a25_0"
    },
    {
        "source_sentence": "梵本請于闐三藏沙門尸羅達",
        "translation": "The Sanskrit text invites the śramaṇa Śīlabhadra, a monk of the Tripiṭaka of Udyāna",
        "source": "T10n0287_001:0535a26_0"
    },
    {
        "source_sentence": "摩於北庭龍興寺譯",
        "translation": "Māra translated it at the northern court of Longxing Temple",
        "source": "T10n0287_001:0535a27_0"
    },
    {
        "source_sentence": "菩薩極喜地第一之一",
        "translation": "the first of the bodhisattva stages of ultimate bliss",
        "source": "T10n0287_001:0535a28_0"
    },
    {
        "source_sentence": "如是我聞：一時，薄伽梵成道未久，第二七日，住於他化自在天中，自在天王宮摩尼寶藏殿，",
        "translation": "Thus I have heard. One time, on the twenty-seventh day, not long after the enlightenment of the Bhagavān had been accomplished, the brāhmaṇa Brahma was staying in Paranirmitavaśavartin Heaven at the jewel mine store house of the palace of the lord of the heavenly king Sthavira:",
        "source": "T10n0287_001:0535a29_0"
    },
    {
        "source_sentence": "與大菩薩無量眾俱。",
        "translation": "He's accompanied by an immeasurable multitude of great bodhisattvas.",
        "source": "T10n0287_001:0535b02_1"
    },
    {
        "source_sentence": "其諸菩薩悉從異佛剎來集，皆於無上正等菩提，得不退轉，一生所繫，",
        "translation": "The enlightening beings all came from different buddha-lands and assembled at the site of unexcelled perfect enlightenment, attaining nonregression in one lifetime.",
        "source": "T10n0287_001:0535b02_2"
    },
    {
        "source_sentence": "當證正覺。",
        "translation": "He'll realize right awakening.",
        "source": "T10n0287_001:0535b04_3"
    },
    {
        "source_sentence": "所謂：已得安住一切菩薩智所行境，皆能趣入一切如來智所行處，無有休息；",
        "translation": "Having settled themselves in all the spheres of action of knowledge of enlightening beings, they can enter into all the spheres of action of knowledge of buddhas without cease.",
        "source": "T10n0287_001:0535b04_4"
    },
    {
        "source_sentence": "善能示現，種種神通諸所作事，應時無滯，成熟調伏一切有情；",
        "translation": "The enlightening beings are able to show all kinds of mystical deeds, at the appropriate time and without hindrance, developing and taming all sentient beings.",
        "source": "T10n0287_001:0535b06_5"
    },
    {
        "source_sentence": "利樂他事皆不虛棄，引發一切菩薩願，劫世剎土量等修行，暫無休息；",
        "translation": "They do not waste anything for the benefit or welfare of others. They give rise to all vows of enlightening beings, cultivating practice equal in extent to eons and worlds, never ceasing even for a moment.",
        "source": "T10n0287_001:0535b07_6"
    },
    {
        "source_sentence": "一切菩薩，福智資糧，善備無盡，令諸世間，共所受用；",
        "translation": "All enlightening beings’ accumulations of virtue and knowledge are well prepared, inexhaustible, causing all worlds to share them.",
        "source": "T10n0287_001:0535b09_7"
    },
    {
        "source_sentence": "已到一切菩薩智慧方便彼岸，示入生死及涅槃門，而不廢捨修菩薩行；",
        "translation": "Having reached the other shore of knowledge and skill in means of all enlightening beings, they show entry into the doors of birth-and-death and nirvana without ever abandoning the practice of enlightening beings.",
        "source": "T10n0287_001:0535b10_8"
    },
    {
        "source_sentence": "善能遊戲解了，趣入一切菩薩靜慮、解脫、等持、等至、神通、明智，",
        "translation": "He was able to play and understand well, entering into the meditations, liberations, equipoises, attainments, superknowledges, and insights of all enlightening beings.",
        "source": "T10n0287_001:0535b11_9"
    },
    {
        "source_sentence": "於是一切諸所作事，皆得善巧；",
        "translation": "All the deeds they did therein became skillful.",
        "source": "T10n0287_001:0535b13_10"
    },
    {
        "source_sentence": "由獲一切菩薩神通威力自在，以無功用隨心剎那，悉能往詣一切如來道場眾會，",
        "translation": "Because they have attained the freedom of all enlightening beings’ spiritual powers, they can go to all the congregations at the sites of enlightenment of buddhas without effort for as long as any mental moment.",
        "source": "T10n0287_001:0535b14_11"
    },
    {
        "source_sentence": "而為上首請佛說法；",
        "translation": "He invited the Buddha to teach the Dharma for the supreme leader.",
        "source": "T10n0287_001:0535b15_12"
    },
    {
        "source_sentence": "受持一切如來法輪，廣能供養、承事諸佛；",
        "translation": "They receive and hold the teachings of all buddhas, able to extensively honor and serve them.",
        "source": "T10n0287_001:0535b16_13"
    },
    {
        "source_sentence": "常勤修習，一切菩薩所行事業；",
        "translation": "They always diligently practice all the undertakings carried out by enlightening beings.",
        "source": "T10n0287_001:0535b17_14"
    },
    {
        "source_sentence": "其身普現一切世間，言音無礙，清徹法界心智無滯，普見三世一切境界。",
        "translation": "His body manifested everywhere in all worlds, his speech and voice unhindered; he clearly penetrated the cosmos of reality, his mind and knowledge unobstructed. He saw all realms of past, present, and future.",
        "source": "T10n0287_001:0535b18_15"
    },
    {
        "source_sentence": "一切菩薩所有祕藏功德正行悉已圓滿，設加無量不可說劫讚其功德亦不能盡。",
        "translation": "All the esoteric virtues and right practices of all the bodhisattvas have been perfected, and even if they were to praise their virtues for an incalculable number of eons, they wouldn't be able to exhaust them.",
        "source": "T10n0287_001:0535b19_16"
    },
    {
        "source_sentence": "其名曰：金剛藏菩薩、寶藏菩薩、蓮華藏菩薩、德藏菩薩、蓮花德藏菩薩、日藏菩薩、曜藏菩薩、地藏菩薩、無垢月藏菩薩、示一切莊嚴光明藏菩薩、智慧普照明藏菩薩、旃檀德藏菩薩、妙吉祥藏菩薩、花德藏菩薩、拘蘇摩德藏菩薩、優鉢羅德藏菩薩、天德藏菩薩、福德藏菩薩、無礙淨智藏菩薩、功德勝藏菩薩、那羅延德藏菩薩、無垢藏菩薩、離垢藏菩薩、種種辯才莊嚴藏菩薩、大光明網照藏菩薩、離垢威德光明王藏菩薩、無礙妙音美響藏菩薩、總持功德能度一切有情願藏菩薩、大海莊嚴藏菩薩、蘇迷盧德藏菩薩、示現一切功德清淨藏菩薩、如來德藏菩薩、佛德藏菩薩、淳金微妙大威德王光明藏菩薩、一切相莊嚴淨藏菩薩、金剛焰胸萬字相莊嚴菩薩、星宿王光照藏菩薩、虛空庫無礙智藏菩薩、解脫月菩薩，",
        "translation": "Their names were Diamond Treasury Bodhisattva, Jewel Treasury Bodhisattva, Lotus Treasury Bodhisattva, Virtue Treasury Bodhisattva, Virtue Treasury Bodhisattva, Lotus Flower Treasury Bodhisattva, Sun Treasury Bodhisattva, Ying Treasury Bodhisattva, Earth Treasury Bodhi",
        "source": "T10n0287_001:0535b21_17"
    },
    {
        "source_sentence": "如是等菩薩摩訶薩無量無數，不可思議、不可量、不可稱、無邊無際、無有分齊、不可說不可說，",
        "translation": "“Such great enlightening beings are immeasurable, countless, inconceivable, immeasurable, indescribable, boundless, limitless, undifferentiated, inexpressible, ineffable.",
        "source": "T10n0287_001:0535c08_18"
    },
    {
        "source_sentence": "皆從異異佛剎來集，金剛藏菩薩而為上首。",
        "translation": "They all gathered from different buddha bases, led by Vajragarbha Bodhisattva.",
        "source": "T10n0287_001:0535c10_19"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩，承佛神力，入於菩薩妙三摩地，名大乘光明。",
        "translation": "At the time, the Vajragarbha Bodhisattva, imbued with the Buddha's miraculous powers, entered the bodhisattva's marvelous samādhi called the great vehicle light.",
        "source": "T10n0287_001:0535c12_0"
    },
    {
        "source_sentence": "入此定已，即時十方各過十俱胝佛剎微塵數世界之外，各有十俱胝佛剎微塵數諸佛如來，",
        "translation": "And as soon as he had entered this concentration, as many buddha-tathāgatas in each of the ten directions as atoms in ten buddha-lands appeared beyond as many worlds as atoms in ten continents.",
        "source": "T10n0287_001:0535c13_1"
    },
    {
        "source_sentence": "同名金剛藏；",
        "translation": "They are all the same in name as the Diamond Matrix.",
        "source": "T10n0287_001:0535c15_2"
    },
    {
        "source_sentence": "皆現其面，俱作是言：「善哉，善哉！",
        "translation": "They all showed their faces and said, Good, good!",
        "source": "T10n0287_001:0535c15_3"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_001:0535c16_4"
    },
    {
        "source_sentence": "汝今乃能入是大乘光明菩薩等持。",
        "translation": "Now, you're able to enter this great vehicle bodhisattva of light and so forth.",
        "source": "T10n0287_001:0535c16_5"
    },
    {
        "source_sentence": "然善男子！",
        "translation": "Still, good man!",
        "source": "T10n0287_001:0535c17_6"
    },
    {
        "source_sentence": "今彼十方各十俱胝佛剎微塵數諸佛如來共加持汝，以此世尊毘盧遮那本願威神力所持故，",
        "translation": "The buddha-tathāgatas of the ten directions, as numerous as atoms in ten corpuscles of buddha-lands in each of the ten directions, are supporting you. Because they are sustained by the supernatural power of the original vow of the World-honored One Vairocana.",
        "source": "T10n0287_001:0535c17_7"
    },
    {
        "source_sentence": "為一切菩薩趣入，能顯不可思議佛法光明。",
        "translation": "For the sake of all bodhisattvas who enter, they can reveal the inconceivable light of the Buddha's teaching.",
        "source": "T10n0287_001:0535c19_8"
    },
    {
        "source_sentence": "諸智地中為令攝受一切善根，為擇一切佛法善巧，為廣知法，為正演說善成立法，",
        "translation": "In the stages of knowledge, in order to cause all roots of goodness to be collected, in order to discern and skillfully analyze all buddha-teachings, in order to know the Teaching extensively, in order to explain it correctly, and in order to establish the Teaching.",
        "source": "T10n0287_001:0535c20_9"
    },
    {
        "source_sentence": "為無分別智得清淨，為一切魔法不染，為出世法善根得淨，為證不思議智所行境，",
        "translation": "In order to attain nondiscriminating knowledge they attain purity, so as not to be stained by all magical spells. To attain purity of the roots of goodness of transcendent ways they realize the sphere of inconceivable knowledge.",
        "source": "T10n0287_001:0535c22_10"
    },
    {
        "source_sentence": "乃至為證佛智境界；",
        "translation": "It is to realize the sphere of buddha-knowledge.",
        "source": "T10n0287_001:0535c24_11"
    },
    {
        "source_sentence": "又為一切菩薩十地發趣及得，為如實說諸菩薩地安立善巧，為正緣慮諸佛妙法，",
        "translation": "“Furthermore, to all the enlightening beings of the ten stages who have set out for enlightenment and attain it, they explain in truth the skillful means established in the state of enlightening beings. They meditate on the wondrous qualities of buddhas as their proper conditions.",
        "source": "T10n0287_001:0535c25_12"
    },
    {
        "source_sentence": "為修無漏法之差別，為善選擇決定大慧光明善巧，為趣入於決定智門，",
        "translation": "In order to cultivate the distinctions of pure dharmas, to skillfully discriminate and determine the light of great wisdom, in order to enter the door of certain knowledge.",
        "source": "T10n0287_001:0535c27_13"
    },
    {
        "source_sentence": "為獲顯示如所應處無畏辯說，為證廣大無礙解地，為菩提心念不遺失，",
        "translation": "In order to show them where they should be taught with fearlessness and eloquence, to realize the vast state of unhindered understanding, in order to attain enlightenment, their minds are not lost.",
        "source": "T10n0287_001:0535c28_14"
    },
    {
        "source_sentence": "為善成熟諸有情界，為一切處通達決定選擇辯才。",
        "translation": "In order to skillfully mature sentient beings in the realm, he has the power of discernment and eloquence that penetrates everywhere.",
        "source": "T10n0287_001:0536a01_15"
    },
    {
        "source_sentence": "然善男子！",
        "translation": "Still, good man!",
        "source": "T10n0287_001:0536a02_16"
    },
    {
        "source_sentence": "汝當辯說此法差別善巧法門。",
        "translation": "You must eloquently explain the method of skillful means that distinguishes these qualities.",
        "source": "T10n0287_001:0536a02_17"
    },
    {
        "source_sentence": "所謂：由承諸佛威神力故，已諸如來智慧光明所加持故，已善圓淨自善根故，",
        "translation": "Because of the spiritual empowerment of buddhas, because they have already been supported by the light of knowledge of buddhas, and because they have perfected their own roots of goodness.",
        "source": "T10n0287_001:0536a03_18"
    },
    {
        "source_sentence": "已善瑩飾真法界故，已普攝益諸有情故，已證法身智所依故，已從諸佛受灌頂故，",
        "translation": "Because they have adorned the real cosmos of reality, because they have benefited all sentient beings, because they have realized the support of knowledge of the essence of reality, and because they have received their coronation from the Buddhas.",
        "source": "T10n0287_001:0536a05_19"
    },
    {
        "source_sentence": "已現超過一切世間最大身故，已越一切世間趣故，已淨出世正法趣故，",
        "translation": "Because they have already manifested the greatest body in all worlds, because they have transcended all mundane courses of existence, and because they have purified the transmundane course of true doctrine.",
        "source": "T10n0287_001:0536a07_20"
    },
    {
        "source_sentence": "已能圓滿一切智智故。」",
        "translation": "It's because they've been able to perfect omniscience and cognition.",
        "source": "T10n0287_001:0536a08_21"
    },
    {
        "source_sentence": "爾時十方彼諸如來，與金剛藏菩提薩埵無映奪身，與無罣礙演說辯才，",
        "translation": "It was then that those buddhas of the ten directions gave their bodies to the enlightening being Vajragarbha Bodhisattva without reflection and unhindered eloquence.",
        "source": "T10n0287_001:0536a09_22"
    },
    {
        "source_sentence": "與入微妙清淨智辯，與無忘失念所加持，與善決定慧之善巧，與不棄捨周遍行智，",
        "translation": "They are endowed with knowledge of entry into subtlety and purity, with the power of nonforgetfulness and mindfulness, with skill in well-determined wisdom, and with omniscience that does not give up.",
        "source": "T10n0287_001:0536a11_0"
    },
    {
        "source_sentence": "與正等覺力無有能摧伏，與如來無所畏令無怯弱，與以一切智智所攝大無礙解辯法理趣決定安立，",
        "translation": "No one can overcome it with the power of perfect enlightenment; no one can overcome it with the fearlessness of buddhas or cause them to be free from fear; and they are established by means of the great unhindered understanding, elucidation, exposition, doctrine, principle, and aim of all knowledges.",
        "source": "T10n0287_001:0536a12_1"
    },
    {
        "source_sentence": "賜與引發一切如來善分別身、語、意莊嚴。",
        "translation": "He bestows and gives rise to the adornment of the well-discriminated body, speech, and mind of all tathāgatas.",
        "source": "T10n0287_001:0536a15_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0287_001:0536a16_3"
    },
    {
        "source_sentence": "由此菩薩獲彼大乘光明等持，法爾如故，以本誓願所引發故，善淨增上妙意樂故，",
        "translation": "As a result, the enlightening beings attain the equanimity of the light of the Great Vehicle, which is thus as it was when they were born. It is due to the undertaking given by their original vow that they purify themselves with superior aspiration.",
        "source": "T10n0287_001:0536a16_4"
    },
    {
        "source_sentence": "已善瑩飾淨智輪故，已善積集諸資糧故，已善鍊治所作事故，以無量念而為器故，",
        "translation": "Because they have well adorned the wheel of pure knowledge, because they have well accumulated their provisions, and because they have well cultivated what they do, being vessels for measureless thought.",
        "source": "T10n0287_001:0536a18_5"
    },
    {
        "source_sentence": "明朗勝解得清淨故，善達無雜總持門故，法界智印之所印故。",
        "translation": "It's because Minglang's resolute resolve attains purity, because he well understands the unadulterated dhāraṇī of the Dharma realm and is sealed by the wisdom mudrā of the Dharma realm.",
        "source": "T10n0287_001:0536a20_6"
    },
    {
        "source_sentence": "爾時，十方彼佛世尊，不起于座，以神通力，各申右手摩金剛藏大菩薩頂。",
        "translation": "At the time, the buddhas and world-honored ones in the ten directions didn't arise from their seats, and each with miraculous powers, they spread their right hand over the top of the Vajragarbha great bodhisattva's head.",
        "source": "T10n0287_001:0536a22_0"
    },
    {
        "source_sentence": "時金剛藏菩提薩埵，蒙彼十方佛摩頂已，即從定起，普告一切菩薩眾言：「唯諸佛子！",
        "translation": "Vajragarbha Bodhisattva then, having been touched by the buddhas of the ten directions, rose from concentration and addressed all the bodhisattvas, saying, Just so, children of the Buddha!",
        "source": "T10n0287_001:0536a23_1"
    },
    {
        "source_sentence": "是菩薩願，決定無雜不可照了廣大法界盡虛空性，窮未來際能救一切諸有情類。",
        "translation": "This is the bodhisattva's vow to be certain that it's unadulterated, can't illuminate the vast cosmos of the Dharma realm and end the nature of space, and will save all sentient beings throughout the future.",
        "source": "T10n0287_001:0536a25_2"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0536a27_3"
    },
    {
        "source_sentence": "菩薩安處於此願中，方能入於過去諸佛世尊智地，乃能入於未來諸佛世尊智地，",
        "translation": "Enlightening beings, resting on these vows, can enter the stage of knowledge of past buddhas and world-honored ones; they can enter the stage of knowledge of future buddhas.",
        "source": "T10n0287_001:0536a27_4"
    },
    {
        "source_sentence": "亦能入於現在諸佛世尊智地。",
        "translation": "He's also able to enter the stage of knowledge of the present buddhas and world-honored ones.",
        "source": "T10n0287_001:0536a29_5"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0536b01_6"
    },
    {
        "source_sentence": "一切菩薩有十智地，是以過去、未來、現在諸佛，已說、當說、今說，",
        "translation": "“All enlightening beings have ten stages of knowledge. That is why past, future, and present buddhas have taught, will teach, and are teaching now.",
        "source": "T10n0287_001:0536b01_7"
    },
    {
        "source_sentence": "由此密意我作是言。",
        "translation": "Because of this mysterious intention, I say this.",
        "source": "T10n0287_001:0536b02_8"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0287_001:0536b03_9"
    },
    {
        "source_sentence": "一名極喜地，二名離垢，三名發光，四名焰慧，五名難勝，六名現前，",
        "translation": "The first is called the stage of supreme bliss. The second is called freedom from defilement. The third is called emission of light. The fourth is called blazing wisdom. The fifth is called invincibility.",
        "source": "T10n0287_001:0536b03_10"
    },
    {
        "source_sentence": "七名遠行，八名不動，九名善慧，十名法雲。",
        "translation": "The seventh name is far-reaching practice, the eighth name is immovable, the ninth name is good wisdom, and the tenth name is Dharma cloud.",
        "source": "T10n0287_001:0536b05_11"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0536b06_12"
    },
    {
        "source_sentence": "此名一切菩薩十地。",
        "translation": "These are called the ten stages of all bodhisattvas.",
        "source": "T10n0287_001:0536b06_13"
    },
    {
        "source_sentence": "是以過去、未來、現在諸佛，已說、當說、今說。",
        "translation": "That's why the buddhas of the past, future, and present have been taught, will be taught, and are being taught.",
        "source": "T10n0287_001:0536b07_0"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0536b07_1"
    },
    {
        "source_sentence": "我不見有諸佛國界，彼中如來不歎說此菩薩十地者。",
        "translation": "I don't see any buddha-lands where the Tathāgata doesn't praise those who teach this bodhisattva's ten stages.",
        "source": "T10n0287_001:0536b08_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0287_001:0536b09_3"
    },
    {
        "source_sentence": "是諸菩薩增上勝妙，能淨一切諸菩薩道法門光明，謂即十地安立解釋。",
        "translation": "These bodhisattvas are superior and marvelous, able to purify the light of the Dharma aspect of the paths of all bodhisattvas, which is defined as the explanation of the ten stages.",
        "source": "T10n0287_001:0536b09_4"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0536b11_5"
    },
    {
        "source_sentence": "當知此處不可思議，謂於諸地安立法中自所證智。」",
        "translation": "You should know that this place is inconceivable, which is the knowledge realized by oneself in the peaceful establishment of the stages.",
        "source": "T10n0287_001:0536b11_6"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩，標斯十地名已默然而住，不復分別而解釋之。",
        "translation": "After naming these ten stages, the Vajragarbha Bodhisattva remained silent and didn't explain them separately.",
        "source": "T10n0287_001:0536b13_0"
    },
    {
        "source_sentence": "是時一切諸菩薩眾，聞說菩薩十地名已，不聞解釋，咸生渴仰作如是念：「何因何緣是金剛藏菩提薩埵，",
        "translation": "All the bodhisattvas then heard the names of the ten stages of enlightening beings, but they did not hear their explanations. They all became thirsty and thought to themselves, “Through what cause and condition is this buddha-parinirmita-vaśavartin called Vajragarbha?",
        "source": "T10n0287_001:0536b14_1"
    },
    {
        "source_sentence": "唯說菩薩十地名已，默然而住更不解釋？」",
        "translation": "Only after he explains the names of the ten bodhisattva stages, does he remain silent and not explain them?",
        "source": "T10n0287_001:0536b16_2"
    },
    {
        "source_sentence": "「何故正覺者，　　念智功德具；",
        "translation": "Why is it that the Perfectly Awakened One Is endowed with the virtue of mindfulness and knowledge?",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　標諸上妙地，　　自在不解釋？",
        "translation": "Do you label the most sublime stages without explaining them freely?",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　一切咸決定，　　菩薩大名稱；",
        "translation": "All of them are certain, The great name of enlightening beings.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　何故說地名，　　而不演其義？",
        "translation": "Why are the names of the stages given but their meanings not explained?",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　一切諸佛子，　　無畏皆樂聞；",
        "translation": "All the offspring of Buddha Are fearless and glad to hear.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　願為正分別，　　說諸地義趣。",
        "translation": "I pray that you will correctly discriminate and explain the meaning of these stages.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　眾會悉清淨，　　離懈怠嚴整，",
        "translation": "The assemblies are all pure, Free from laziness and strictly ordered.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　鮮潔住堅實，　　具足功德智；",
        "translation": "They are pure and firm, Endowed with virtuous knowledge.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　相視咸恭敬，　　一切悉專仰；",
        "translation": "They looked at each other with respect, And all honored each other.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　唯望法甘露，　　如蜂念淨蜜。」",
        "translation": "They only hope for the ambrosia of the Dharma, like a bee mindful of pure honey.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　大智無畏者，　　金剛藏聞是，",
        "translation": "The great wise and fearless One is the Vajragarbha who hears this.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　欲令大眾悅，　　以頌詶佛子：",
        "translation": "Wishing to please the masses, They praised the Buddha-child with these verses:",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "「雖作最勝甚希有，　　此能顯示菩薩行；",
        "translation": "“Although it is most excellent and rare, It can show the practice of enlightening beings.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　辯地能作最微妙，　　由此佛地有修證。",
        "translation": "The stage of eloquence is able to do the most subtle things; Because of this, there is cultivation and realization in the Buddha-stage.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　微細難見離分別，　　遠離心地難證悟；",
        "translation": "The subtle and difficult to see are free from discrimination; Beyond mind, it is hard to realize enlightenment.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　智者境界純無漏，　　世間聞者悉迷惑。",
        "translation": "The sphere of the wise is pure and uncontaminated; All those who hear it in the world are deluded.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　安心不動如金剛，　　信解佛智最殊勝；",
        "translation": "Their peace of mind unshakable like diamond, They believe and understand buddhas’ knowledge supremely superior.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　了知無我唯心地，　　此能聞斯微細智。",
        "translation": "Knowing that selflessness is only mind and mind alone, this subtle knowledge can hear it.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　如以眾彩畫虛空，　　如風依於鳥路行；",
        "translation": "They are like the sky painted with myriad colors, Like the wind traveling on a bird’s path.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　無漏佛智亦如是，　　雖為分別而難見。",
        "translation": "Pure Buddha-knowledge is also like this, hard to see even though it's discriminated.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　故今吾興如是智，　　世間難有知此者；",
        "translation": "That is why I now produce this kind of knowledge. There is hardly anyone in the world who knows it.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "　及能信此最勝法，　　是故不任廣解釋。」",
        "translation": "They can believe in this most excellent teaching, so they won't be allowed to explain it in detail.",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "爾時，於此菩薩眾中有一菩薩名解脫月，知諸大眾心之所念，即以頌問金剛藏菩薩曰：爾時，",
        "translation": "At that time, there was an enlightening being in the assembly of these enlightening beings named Moon of Liberation. Knowing what the great multitude of enlightening beings thought, he asked the enlightening being Diamond Matrix in verse:",
        "source": "T10n0287_001:0536b17_3"
    },
    {
        "source_sentence": "解脫月菩薩聞是語已，白金剛藏菩薩言：「佛子！",
        "translation": "After hearing these words, the Moon of Liberation Bodhisattva said to the Vajragarbha Bodhisattva, Son of Buddha!",
        "source": "T10n0287_001:0536c13_4"
    },
    {
        "source_sentence": "今此眾會皆悉清淨，其諸菩薩善淨意樂、善潔思念、善修諸行，已善承事無量百千俱胝諸佛，",
        "translation": "These assemblies are now all pure. The enlightening beings have purified their aspirations, they have purified their thoughts, they have cultivated their practices, and they have already served countless hundreds of thousands of buddhas.",
        "source": "T10n0287_001:0536c14_5"
    },
    {
        "source_sentence": "善集資糧，成就無量種種功德，永離疑惑無諸垢亹，善住增上意樂勝解，",
        "translation": "“Great enlightening beings, having well accumulated provisions, develop measureless virtues of various kinds. Forever free from doubt and confusion, they have no defiled ill-will. They are well established in the supreme determination for enlightenment.",
        "source": "T10n0287_001:0536c16_6"
    },
    {
        "source_sentence": "於佛法中不隨他教。",
        "translation": "In the Buddha's teaching, they don't follow other teachings.",
        "source": "T10n0287_001:0536c17_7"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T10n0287_001:0536c18_8"
    },
    {
        "source_sentence": "佛子演說此義，是諸菩薩於如是處現證而住。」",
        "translation": "The Buddha-son explains this meaning, which is that bodhisattvas abide in such a place to show their realization.",
        "source": "T10n0287_001:0536c18_9"
    },
    {
        "source_sentence": "「願說最安隱，　　菩薩無上行；",
        "translation": "“May you teach the supreme peace, The supreme practice of enlightening beings.",
        "source": "T10n0287_001:0536c19_10"
    },
    {
        "source_sentence": "　分別於諸地，　　智淨成正覺。",
        "translation": "Discriminating the stages, knowledge and purity become perfect enlightenment.",
        "source": "T10n0287_001:0536c19_10"
    },
    {
        "source_sentence": "　此眾無諸亹，　　志解悉明潔；",
        "translation": "These beings have no ill-will, And their resolve is clear and pure.",
        "source": "T10n0287_001:0536c19_10"
    },
    {
        "source_sentence": "　承事無量佛，　　能知此地義。」",
        "translation": "By serving measureless buddhas, they can know the meaning of this place.",
        "source": "T10n0287_001:0536c19_10"
    },
    {
        "source_sentence": "爾時解脫月菩薩，欲重宣此義而說頌曰：時金剛藏菩薩言：「佛子！",
        "translation": "It was then that the Moon of Liberation Bodhisattva wanted to reiterate this meaning and spoke a verse, saying, The Vajragarbha Bodhisattva said, Son of the Buddha!",
        "source": "T10n0287_001:0536c19_10"
    },
    {
        "source_sentence": "雖此眾會皆悉清淨，其諸菩薩善淨意樂、善潔思念、善修諸行，已善能承事無量百千俱胝諸佛，",
        "translation": "“Although these assemblies were all pure, those enlightening beings’ pure aspirations, purified thoughts, and well cultivated practices had already served countless hundreds of thousands of buddhas.",
        "source": "T10n0287_001:0536c25_11"
    },
    {
        "source_sentence": "善集資糧，成就無量種種功德，永離疑惑無諸垢釁，善住增上意樂勝解，",
        "translation": "“Great enlightening beings, having well accumulated provisions, develop measureless virtues of various kinds. Forever free from doubt and confusion, they have no defiled states of confusion. They are able to abide in the supreme determination for enlightenment.",
        "source": "T10n0287_001:0536c27_12"
    },
    {
        "source_sentence": "於佛法中不隨他教。",
        "translation": "In the Buddha's teaching, they don't follow other teachings.",
        "source": "T10n0287_001:0536c29_13"
    },
    {
        "source_sentence": "然有其餘劣解有情，聞此甚深難思議處忽生疑惑，是彼長夜能引無義無利眾苦。",
        "translation": "Still, if there are other people with weak understanding who suddenly have doubts and confusions when they hear this profound and inconceivable place, it's because for a long time they've been able to cause the suffering of meaningless and useless suffering.",
        "source": "T10n0287_001:0536c29_14"
    },
    {
        "source_sentence": "我愍此等，故樂默然。」",
        "translation": "Because I pity these people, I'm happy to be silent.",
        "source": "T10n0287_001:0537a02_15"
    },
    {
        "source_sentence": "「雖此眾淨廣智慧，　　甚深明利能決擇；",
        "translation": "“Although these sentient beings have pure, extensive knowledge and wisdom, They are profoundly insightful and able to discriminate.",
        "source": "T10n0287_001:0537a03_16"
    },
    {
        "source_sentence": "　其心不動如山王，　　不可傾覆猶大海。",
        "translation": "His mind doesn't budge like a mountain king, and he can't be overwhelmed like the ocean.",
        "source": "T10n0287_001:0537a03_16"
    },
    {
        "source_sentence": "　有行未久解未得，　　隨識而行不隨智；",
        "translation": "Some practice is not long-standing, yet they understand and don’t attain it; Practice according to consciousness but not according to knowledge.",
        "source": "T10n0287_001:0537a03_16"
    },
    {
        "source_sentence": "　聞此生疑墮惡道，　　我愍是等故不說。」",
        "translation": "When I hear that this sentient being doubts and falls into a bad path, I don't explain it because I pity them.",
        "source": "T10n0287_001:0537a03_16"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩，欲重宣此義而說頌曰：爾時，解脫月菩薩，復白金剛藏菩薩言：「善哉！",
        "translation": "At that point, the Vajragarbha Bodhisattva wanted to reiterate this meaning and spoke these verses, saying, At that point, the Moon of Liberation Bodhisattva again said to the Vajragarbha Bodhisattva, Good!",
        "source": "T10n0287_001:0537a03_16"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_001:0537a10_0"
    },
    {
        "source_sentence": "願說勿疑。",
        "translation": "May it be explained, don't doubt it.",
        "source": "T10n0287_001:0537a10_1"
    },
    {
        "source_sentence": "由佛神力佛所護念，此如是等不思議處皆得可信。",
        "translation": "Because of the Buddha's miraculous power and the Buddha's protection, these inconceivable places like this will all become believable.",
        "source": "T10n0287_001:0537a10_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0287_001:0537a11_3"
    },
    {
        "source_sentence": "唯佛子！",
        "translation": "Only the Buddha-child!",
        "source": "T10n0287_001:0537a11_4"
    },
    {
        "source_sentence": "說此十地解釋之時，法爾如是，謂一切佛皆悉護念，一切菩薩為欲衛護此智地故皆發勇悍。",
        "translation": "When explaining these ten stages, it's explained in this way, meaning that all buddhas are fully guarded by mindfulness, and all bodhisattvas become courageous because they want to protect this stage of wisdom.",
        "source": "T10n0287_001:0537a11_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0287_001:0537a14_6"
    },
    {
        "source_sentence": "此是菩薩最初正行，亦是一切佛法修證。",
        "translation": "This is the first correct practice of a bodhisattva, and it's also the cultivation and realization of all the Buddha's teachings.",
        "source": "T10n0287_001:0537a14_7"
    },
    {
        "source_sentence": "唯佛子！",
        "translation": "Only the Buddha-child!",
        "source": "T10n0287_001:0537a15_8"
    },
    {
        "source_sentence": "譬如一切書字數說，字母為始、字母為終，無有少分書字數說離字母者。",
        "translation": "Good man, this is analogous to the case where all phonemes are spoken of repeatedly inscribed syllables as beginnings and endings. There is no one who says that a small number of phonemes does not exist apart from letters.",
        "source": "T10n0287_001:0537a15_9"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_001:0537a17_10"
    },
    {
        "source_sentence": "一切佛法亦復如是，以地為始發修行故，以地為終證佛智故。",
        "translation": "So it is with all the Buddha's teachings: because earth is the beginning to give rise to practice, and earth is the end to realize buddha-cognition.",
        "source": "T10n0287_001:0537a17_11"
    },
    {
        "source_sentence": "是故佛子！",
        "translation": "Therefore, offspring of Buddha!",
        "source": "T10n0287_001:0537a18_12"
    },
    {
        "source_sentence": "願為演說，諸佛、應供、正遍等覺加持護念。」",
        "translation": "May I explain for you how the buddhas, Worthy of Offerings, and Perfectly Enlightened Ones support and protect them.",
        "source": "T10n0287_001:0537a18_13"
    },
    {
        "source_sentence": "「善哉佛子願演說，　　趣入菩提諸地行；",
        "translation": "“Good, offspring of Buddha, may you expound the practices leading to enlightenment.",
        "source": "T10n0287_001:0537a19_14"
    },
    {
        "source_sentence": "　十方一切自在尊，　　無不護念智根本。",
        "translation": "All the independent honored ones of the ten directions There is nothing that doesn’t protect the root of mindfulness and knowledge.",
        "source": "T10n0287_001:0537a19_14"
    },
    {
        "source_sentence": "　此正行始此智終，　　一切佛法從此起；",
        "translation": "This right practice begins and this knowledge ends; All the Buddha teachings arise from this.",
        "source": "T10n0287_001:0537a19_14"
    },
    {
        "source_sentence": "　如諸書等字母攝，　　佛法依地亦如是。」",
        "translation": "Just as the letters in books and so forth are collected, so is the Buddha's teaching based on the ground.",
        "source": "T10n0287_001:0537a19_14"
    },
    {
        "source_sentence": "爾時，解脫月菩薩，欲重宣此義而說頌言：爾時，此諸大菩薩眾，亦為此義一時同聲，",
        "translation": "At that time the enlightening being Moon of Deliverance, wanting to elaborate on this meaning further, spoke these verses:",
        "source": "T10n0287_001:0537a19_14"
    },
    {
        "source_sentence": "「上妙無垢智，　　善說無邊辯；",
        "translation": "The supremely sublime, undefiled knowledge Skillfully expounds boundless discourse.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　宣揚美妙言，　　勝義相應理。",
        "translation": "He proclaims beautiful words that are concomitant with the ultimate truth.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　念持清淨慧，　　為十力意樂；",
        "translation": "Their mindfulness and pure wisdom Is the aspiration of the ten powers.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　無礙解決擇，　　說殊勝十地。",
        "translation": "Unhindered resolve and discrimination are said to be the superior ten stages.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　此眾離憍慢，　　及見疑雜染；",
        "translation": "These beings are free from the defilement of arrogance and views and doubt.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　戒定審悅意，　　唯願聞善說。",
        "translation": "The precepts are firm and attentive. All we ask is that you explain them well.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　如渴思冷水，　　如飢念美食，",
        "translation": "It's like thirst and thought of cool water, like hunger and food.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　如病憶良藥，　　如眾蜂嗜蜜，",
        "translation": "It's like a sick person remembering good medicine, like bees eating honey.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　此眾亦如是，　　願聞甘露法。",
        "translation": "This assembly is likewise, wishing to hear the teaching of ambrosia.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　善哉清淨智，　　說無垢地位；",
        "translation": "Excellent, pure knowledge, Explaining the state of immaculate.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "　顯十力相應，　　無礙善逝道。」",
        "translation": "It shows that the ten powers are associated with the unobstructed, well-gone path.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "而以頌請金剛藏菩薩曰：爾時，世尊釋迦牟尼，從白毫相放無數光，名照菩薩力，",
        "translation": "He then addressed the bodhisattva Vajragarbha in verse: At that time, the World-honored One, the Buddha Śākyamuni, emanated countless rays of light from each white hair called “illuminating” the enlightening being’s power.",
        "source": "T10n0287_001:0537a25_15"
    },
    {
        "source_sentence": "無數光明以為眷屬，其光普照十方世界靡不周遍，諸惡趣苦皆令休息，",
        "translation": "Countless rays of light belonged to the enlightening being; those rays of light illumined all worlds in the ten directions, reaching everywhere. The pain and suffering of evil states was brought to an end.",
        "source": "T10n0287_001:0537b10_16"
    },
    {
        "source_sentence": "映蔽一切諸魔宮殿，悉照無量諸佛眾會，顯示諸佛不可思議境界行相威力遊戲。",
        "translation": "It eclipses all the demonic palaces, illumines the assemblies of innumerable buddhas, and shows the majestic play of the buddhas' unfathomable spheres, practices, and powers.",
        "source": "T10n0287_001:0537b11_17"
    },
    {
        "source_sentence": "照於十方諸世界中，及於一切諸佛眾會，以佛神力所加說法菩薩身已，",
        "translation": "Having illumined the worlds of the ten directions and all the assemblies of the Buddhas, he taught the Dharma in the bodies of enlightening beings by means of the spiritual power of buddhas.",
        "source": "T10n0287_001:0537b13_18"
    },
    {
        "source_sentence": "於上空中成大光雲網臺而住。",
        "translation": "In the upper sky, he forms a great cloud-net dais of light and lives there.",
        "source": "T10n0287_001:0537b15_19"
    },
    {
        "source_sentence": "彼諸世尊亦復如是，從白毫相放無數光，無數光明以為眷屬，其光普照十方世界靡不周遍，",
        "translation": "In the same way those buddhas emanated countless rays of light from their white hair, accompanied by countless rays of light. Those rays of light illumined all worlds in the ten directions and pervaded everywhere.",
        "source": "T10n0287_001:0537b16_0"
    },
    {
        "source_sentence": "諸惡趣苦皆令休息，映蔽一切諸魔宮殿，悉照無量諸佛眾會，顯示諸佛不可思議境界行相威力遊戲。",
        "translation": "The suffering of all the bad destinies and afflictions causes them to cease, reflecting all the demonic palaces, illuminating the assemblies of measureless buddhas, showing the buddhas' inconceivable spheres, practices, and majestic play.",
        "source": "T10n0287_001:0537b18_1"
    },
    {
        "source_sentence": "照於十方諸世界中及於一切諸佛眾會，以佛神力所加說法菩薩之身，顯不思議諸佛遊戲，",
        "translation": "He illumined all the worlds of the ten directions, as well as all the congregations of the Buddhas. By means of his spiritual power he expounded the Teaching and enlightening being’s body, revealing the inconceivable play of buddhas.",
        "source": "T10n0287_001:0537b20_2"
    },
    {
        "source_sentence": "并照世尊釋迦牟尼大會之眾及金剛藏菩薩身已，於上空中亦復成就大光明雲網臺而住。",
        "translation": "They also illuminated the bodies of the Bhagavān, Śākyamuni, the great assembly of buddhas, as well as Vajragarbha Bodhisattva. In the sky above them they also produced clouds of great rays of light and remained there on their seats.",
        "source": "T10n0287_001:0537b22_3"
    },
    {
        "source_sentence": "由是世尊釋迦牟尼，從白毫相所流光明，彼彼世界彼佛眾會，及彼菩薩身與法座，",
        "translation": "Because of this, the World-honored One Śākyamuni emanated a ray of light from the white hair between his eyebrows. In all those worlds and buddha-ssemblies, as well as in the bodies of enlightening beings and their seats of teaching,",
        "source": "T10n0287_001:0537b24_4"
    },
    {
        "source_sentence": "皆現了然於此得見。",
        "translation": "They are all clearly visible, yet they can be seen here.",
        "source": "T10n0287_001:0537b26_5"
    },
    {
        "source_sentence": "由彼無量佛剎土中，諸佛世尊從白毫相所流光明，此之三千大千世界，",
        "translation": "In those infinite buddha-lands the buddhas and world-honored ones emanated their white hairlike rays of light, which illumined a billion-world universe like this.",
        "source": "T10n0287_001:0537b27_0"
    },
    {
        "source_sentence": "及此世尊釋迦牟尼大會之眾，并金剛藏菩提薩埵身及法座，皆現了然於彼得見。",
        "translation": "And this world-honored Śākyamuni, the great assembly of the Bhagavān, the Vajragarbha Bodhisattva's body and Dharma seat, are all clearly visible to Peter.",
        "source": "T10n0287_001:0537b28_1"
    },
    {
        "source_sentence": "「佛無等等如虛空，　　十力自在無邊眾；",
        "translation": "The Buddha is unequaled as space, With the ten powers of unimpededness and boundless multitude.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　於釋師子妙法中，　　天人最上今加汝。",
        "translation": "Among the wonderful teachings of the Śākya lion, gods and humans are the best, and now I'll add you to them.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　佛子當承佛神力，　　開此法王妙法藏；",
        "translation": "The offspring of Buddha should, by the spiritual power of Buddha, Reveal this wonderful storehouse of teaching of the King of Truth.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　顯示微妙廣大行，　　分別建立諸智地。",
        "translation": "It shows subtle and vast practices, Discriminatingly establishing the stages of knowledge.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　若有聞此勝法門，　　亦蒙善逝所加護；",
        "translation": "If there is anyone who hears this excellent teaching, They will also be protected by the Buddha.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　十方一切諸菩薩，　　悉皆攝持及護念。",
        "translation": "All the enlightening beings of the ten directions They embrace and protect.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　當能修集諸正行，　　次第成滿無垢地；",
        "translation": "They should be able to cultivate and accumulate right practices, Successively fulfilling the stage of undefiledness.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　能證十力等功德，　　契悟無上正等覺。",
        "translation": "Being able to realize the virtues of the ten powers and so forth, they awaken to unsurpassed perfect enlightenment.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　雖住海水劫火中，　　無疑堪聞此法門；",
        "translation": "Even if one were to stay in the ocean water, In the midst of a great conflagration, One could hear this teaching without perplexity.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　其有疑惑不信者，　　永復不聞如是義。",
        "translation": "Those who doubt and don't believe in it will never hear such a teaching again.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　當說最勝地智道，　　證入安住及昇進；",
        "translation": "You should explain the path of knowledge of the supreme state, Realizing entering, abiding, and ascending.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　修行境界如次說，　　利樂一切有情故。」",
        "translation": "The sphere of cultivation is explained in order for the benefit and welfare of all sentient beings.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "「微細難知大仙道，　　不可分別離分別；",
        "translation": "The path of great sages is subtle and difficult to know; They cannot discriminate or distinguish.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　難證無濁慧者境，　　性常寂靜無生滅。",
        "translation": "It's difficult to realize the object of someone with unsullied wisdom whose nature is always quiescent and without arising or ceasing.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　性空能寂無二盡，　　離趣平等至涅槃；",
        "translation": "The essence of emptiness can be quiescent, without duality or exhaustion; Being free from destinies and equal, it reaches nirvana.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　無邊中緣無所證，　　出過三世等虛空。",
        "translation": "Conditioned by boundlessness and nothing realized, it transcends the three worlds and space like space.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　寂靜寂滅佛所證，　　以諸言趣難宣說；",
        "translation": "The realization of the Buddha of Silent Tranquility and Extinction is difficult to proclaim because it’s hard to express in words.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　此地及行亦如是，　　說猶甚難何況聽！",
        "translation": "So it is with this stage and the practice: How difficult it is to teach, much less to hear!",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　遠離思惟及心道，　　此智所引牟尼境；",
        "translation": "Seclusion from thought and the path of thought Is the sphere of the sages projected by this knowledge.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　非蘊、界、處所顯了，　　非心所測、意所思。",
        "translation": "They are not revealed by the aggregates, realms, or locations, and they aren't conceived by mind or contemplated by mind.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　譬如空中諸鳥跡，　　智者叵宣難可示；",
        "translation": "It is like the traces of birds in the sky: The wise cannot tell, and it is difficult to show.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　諸佛子地亦如是，　　說尚極難何況聽！",
        "translation": "So it is with the Buddha-children: How difficult it is to teach, let alone hear!",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　今當但說此一分，　　由大慈悲及願力；",
        "translation": "I will now explain only one part of it, Because of the great compassion and the power of my vow.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　如其漸次非心境，　　以智能滿如意樂。",
        "translation": "As they gradually go along with what's not the object of mind, he fills them with wisdom and fulfills their wishes.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　如是此境極難見，　　叵說唯住自意樂；",
        "translation": "Thus these objects are extremely difficult to see; It cannot be said that they abide only in one’s own will.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　然承佛力我今說，　　汝等一心恭敬聽。",
        "translation": "Still, by the power of the Buddha I will now explain: Listen with one unified mind and respectfully.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　如是智門及正行，　　億劫宣說猶難盡；",
        "translation": "In this way the gates of knowledge and right practice are inexhaustible for billions of eons to teach.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　我今略說汝等聽，　　真實法義盡如理。",
        "translation": "Now, I'll briefly explain for you the true meaning of the teaching as it is.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　仁者專心恭敬待，　　我承佛力當善說；",
        "translation": "Gentlemen, concentrate your minds and respectfully receive. By the power of Buddha I will explain well.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　宣揚微妙正法音，　　譬喻相應協倫字。",
        "translation": "He proclaims the subtle sound of the true teaching, which is associated with the metaphorical word for cooperation.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　此以言詞難顯了，　　而蒙無量佛神力；",
        "translation": "Because words are difficult to express, They receive the spiritual powers of infinite buddhas.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "　光形聚入於我身，　　由是我今能演說。",
        "translation": "The lump of light and the lump of form enters into my body, Because I am now able to expound it.",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "爾時，從此光雲網臺出是頌曰：爾時，金剛藏菩薩觀察十方，欲令大眾增淨信故而說頌言：「唯諸佛子！",
        "translation": "At that point, this verse emerged from the cloud of webs of light from this dais, saying, At that point, the Vajragarbha Bodhisattva looked over the ten directions, wanted to cause the masses to increase their pure faith, and spoke these verses, saying, Just so, children of the Buddha!",
        "source": "T10n0287_001:0537c01_2"
    },
    {
        "source_sentence": "若有有情，善積善根，善集資糧，善修諸行，善事諸佛，善聚白法，善友所攝，",
        "translation": "“If there are sentient beings who well accumulate roots of goodness, who well gather provisions, who well cultivate their practices, who well serve buddhas, who well collect the white dharmas, and who are included by spiritual benefactors,",
        "source": "T10n0287_001:0538a08_3"
    },
    {
        "source_sentence": "善淨意樂，隨順廣大增上意樂；",
        "translation": "The aspiration for goodness and purity is to follow the vast and extensive aspiration for enlightenment.",
        "source": "T10n0287_001:0538a10_0"
    },
    {
        "source_sentence": "具妙勝解悲愍現前，為求佛智，為欲證悟十力之力，為獲如來大無所畏，",
        "translation": "They are endowed with sublime understanding and compassion, manifesting it in order to seek buddha-knowledge, in order to realize the power of the ten powers, in order to attain the great fearlessness of Buddhahood.",
        "source": "T10n0287_001:0538a10_1"
    },
    {
        "source_sentence": "為得平等佛不共法，為欲救拔一切世間，為淨大悲愍，為悟十方無所餘智，",
        "translation": "In order to attain equality, the Buddha’s unique qualities, in order to save all beings, in order to purify compassion and pity, in order to realize omniscience everywhere.",
        "source": "T10n0287_001:0538a12_2"
    },
    {
        "source_sentence": "為以無礙淨諸佛剎，為一剎那能知三世，為無所畏轉大法輪，發如是心。",
        "translation": "In order to unobstructedly purify the buddha-lands, to be able to know the three worlds in a single moment, and to fearlessly turn the great wheel of the Dharma, they give rise to this kind of mind.",
        "source": "T10n0287_001:0538a14_3"
    },
    {
        "source_sentence": "菩薩發心大悲為先導，慧智增上方便善巧之所攝受，意樂及與增上意樂常所輔持，",
        "translation": "“Enlightening beings’ determination for enlightenment and great compassion are the first to be guided. They are collected by knowledge, wisdom, and superior skill in means; their aspirations and superior aspirations are always supported by them.",
        "source": "T10n0287_001:0538a15_4"
    },
    {
        "source_sentence": "佛力無量以堅持力及以智力，善擇決定無礙智現前，隨順無師自然妙智，",
        "translation": "The Buddha’s power is immeasurable by means of the power of firmness, as well as by means of the power of knowledge. Skillful in discrimination, certainty, and unhindered knowledge are manifested to them; naturally marvelous knowledge adapting to teacherlessness:",
        "source": "T10n0287_001:0538a17_5"
    },
    {
        "source_sentence": "能受一切佛法慧智，教授誨示，極於法界盡虛空性，窮未來際。",
        "translation": "They are able to receive the wisdom and knowledge of all buddhas’ doctrines, teaching and instructing them. Their power extends beyond the space of the realm of reality as far as the infinity of space, reaching as far into the future.",
        "source": "T10n0287_001:0538a19_6"
    },
    {
        "source_sentence": "始發此心，即是菩薩超異生地，證入菩薩正性離生，生如來家，種族尊貴無可譏嫌，",
        "translation": "When he first aroused this aspiration, that was when the bodhisattva transcended the stage of unenlightened sentient beings and realized entering the true nature of enlightening beings. Freed from birth, he was reborn in the house of buddhahood with noble family members who could criticize him.",
        "source": "T10n0287_001:0538a20_7"
    },
    {
        "source_sentence": "已離世趣入出世道，住於菩薩本法性中，已善安住於菩薩處，隨順三世平等之法，",
        "translation": "Having abandoned worldly paths and entered the path of transcendence, they dwell in the essence of enlightening beings’ reality; having settled therein, they follow the equality of all things in all times.",
        "source": "T10n0287_001:0538a22_8"
    },
    {
        "source_sentence": "紹如來種，決定趣向正等菩提。",
        "translation": "The Tathāgata's seed will surely lead them to perfect enlightenment.",
        "source": "T10n0287_001:0538a24_9"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0538a25_10"
    },
    {
        "source_sentence": "菩薩住於如是等法，名已善住極喜地中，以不動故。",
        "translation": "When bodhisattvas abide in such things, they're called well-abiding in the stage of great joy because they don't move.",
        "source": "T10n0287_001:0538a25_11"
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "“O Children of Buddha!",
        "source": "T10n0287_001:0538a27_0"
    },
    {
        "source_sentence": "菩薩住於極喜地時，極多歡喜，多淨信，多愛樂，多適悅，多忻慶，多踊躍，",
        "translation": "“When enlightening beings abide in the stage of ultimate bliss, they are overwhelmed with joy. They have many pure faiths, many aspirations, many pleasures, many delights, many joys, many amazements, many joys, and many dances.",
        "source": "T10n0287_001:0538a27_1"
    },
    {
        "source_sentence": "多勇悍，多無鬪諍，多無惱害，多無瞋恨。",
        "translation": "They are often brave and valiant but rarely engage in fighting. They are not harmful to others or angry.",
        "source": "T10n0287_001:0538a28_2"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0538a29_3"
    },
    {
        "source_sentence": "菩薩住於極喜地中，念諸佛時，發生極喜；",
        "translation": "“When enlightening beings abide in the stage of ultimate bliss, they become overjoyed when they are mindful of the buddhas.",
        "source": "T10n0287_001:0538b01_4"
    },
    {
        "source_sentence": "念佛法時，念菩薩時，念菩薩行時，念到彼岸清淨之時，念諸菩薩地殊勝時，",
        "translation": "When he’s mindful of the Buddha’s teaching, when he’s mindful of enlightening beings, and when he’s mindful of enlightening beings’ practices, and when he’s mindful of reaching the other shore of purity, and when he’s mindful of the excellence of the stages of enlightening beings,",
        "source": "T10n0287_001:0538b02_0"
    },
    {
        "source_sentence": "念餘菩薩不映奪時，念佛教授教誡之時，念令有情得利益時，念當趣入一切如來智加行時，",
        "translation": "When he's mindful of other bodhisattvas not being overwhelmed, when he's mindful of the Buddha's teaching and instructions, when he's mindful of enabling sentient beings to attain benefit, and when he's mindful that he's about to enter all the Tathāgata's applied practices of wisdom,",
        "source": "T10n0287_001:0538b03_1"
    },
    {
        "source_sentence": "皆生歡喜。",
        "translation": "They all become joyous.",
        "source": "T10n0287_001:0538b05_2"
    },
    {
        "source_sentence": "又此菩薩了知，我今轉離一切世間境界，親近諸佛遠異生地，近至智地，",
        "translation": "“Furthermore, this enlightening being knows that I am now leaving all worldly realms and becoming intimate with buddhas.",
        "source": "T10n0287_001:0538b06_3"
    },
    {
        "source_sentence": "永斷一切墮險惡趣，與諸有情為依止處。",
        "translation": "They permanently eliminate all those who fall into dangerous and evil destinies, and they serve sentient beings as their refuge.",
        "source": "T10n0287_001:0538b07_4"
    },
    {
        "source_sentence": "近見諸佛住佛境界，入諸菩薩平等性中，捨離一切怖畏毛竪，故生極喜。",
        "translation": "They are close to seeing buddhas living in the realm of buddhahood, entering into the equanimity of enlightening beings, abandoning all fears and hair stand on end; thus they give rise to great joy.",
        "source": "T10n0287_001:0538b08_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0287_001:0538b10_6"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0538b10_7"
    },
    {
        "source_sentence": "菩薩纔證極喜地已，所有怖畏，謂：不活畏、惡名畏、死畏、惡趣畏、處眾怯畏，",
        "translation": "“Enlightening beings, having attained the stage of ultimate bliss, have these fears:",
        "source": "T10n0287_001:0538b10_8"
    },
    {
        "source_sentence": "悉皆遠離。",
        "translation": "They're all far removed.",
        "source": "T10n0287_001:0538b12_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0287_001:0538b12_10"
    },
    {
        "source_sentence": "由是菩薩離我想故，尚無我愛，況復生於諸資具愛；",
        "translation": "Because of this, the enlightening beings are still devoid of craving for self because they are not attached to self. How much less will they be attached to their means of subsistence.",
        "source": "T10n0287_001:0538b12_11"
    },
    {
        "source_sentence": "由是因緣，無不活畏。",
        "translation": "Because of these causes and conditions, there's no fear of not being able to live.",
        "source": "T10n0287_001:0538b14_12"
    },
    {
        "source_sentence": "由於他所無所希望，唯自起欲，我應給施一切有情諸資生具；",
        "translation": "Because there is nothing to be desired by others but self-desire, I should provide all sentient beings with means of subsistence.",
        "source": "T10n0287_001:0538b14_13"
    },
    {
        "source_sentence": "由是因緣，無惡名畏。",
        "translation": "Because of these causes and conditions, there's no fear of bad reputation.",
        "source": "T10n0287_001:0538b15_14"
    },
    {
        "source_sentence": "由離我見，於我無有失壞之想，故無死畏。",
        "translation": "Because they are free from the view of self and have no thoughts of loss or destruction in regard to self, they have no fear of death.",
        "source": "T10n0287_001:0538b16_15"
    },
    {
        "source_sentence": "自知死後，於當來世決定不離諸佛菩薩；",
        "translation": "They know for themselves that after death they will surely not leave the buddhas and enlightening beings of the future.",
        "source": "T10n0287_001:0538b17_16"
    },
    {
        "source_sentence": "由是因緣，無惡趣畏。",
        "translation": "Because of these causes and conditions, there's no fear of bad destinies.",
        "source": "T10n0287_001:0538b18_17"
    },
    {
        "source_sentence": "由意樂見一切世間尚無有一與我齊等何況殊勝，是故無有處眾怯畏。",
        "translation": "Because there is an intention to see that all worlds are not even one and the same as a self, let alone superior. That is why there is no place for such fearlessness.",
        "source": "T10n0287_001:0538b18_18"
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "“O Children of Buddha!",
        "source": "T10n0287_001:0538b20_19"
    },
    {
        "source_sentence": "菩薩如是，已離怖畏憍傲毛竪，以大悲愍而為先導，以無憎背無俗意樂，",
        "translation": "“Thus do enlightening beings become free of fear, their hair stands on end in shame and conceit, guided first by great compassion and pity, with no hatred or resentment and no worldly aspiration.",
        "source": "T10n0287_001:0538b20_20"
    },
    {
        "source_sentence": "為欲修證一切善根勤修加行。",
        "translation": "In order to cultivate and realize all good roots, he diligently cultivates applied practices.",
        "source": "T10n0287_001:0538b22_21"
    },
    {
        "source_sentence": "以信增上，以多證淨，以潔勝解，以多信解，以引發悲愍，以具足大慈，",
        "translation": "Because faith increases, because they often realize purity, because they purify superior understanding, because they have much faith and understanding, because they give rise to compassion, and because they are endowed with great kindness.",
        "source": "T10n0287_001:0538b23_0"
    },
    {
        "source_sentence": "以無厭倦心，以慚愧莊嚴，以常忍辱柔和相應，以深敬順信重尊貴如來聖教，",
        "translation": "With a mind free from weariness, adorned with shame and shame, always accompanied by forbearance and gentleness, they deeply venerate and believe in the noble teachings of the buddhas.",
        "source": "T10n0287_001:0538b24_1"
    },
    {
        "source_sentence": "以無厭足日夜積集一切善根，以奉事善友，以樂於法苑，以無厭足訪求多聞，",
        "translation": "He accumulates all his roots of goodness day and night by means of tirelessly accumulating them; serving spiritual benefactors, he takes delight in the exposition of the Teaching. By tirelessly accumulating these roots of goodness, he seeks enlightenment.",
        "source": "T10n0287_001:0538b26_2"
    },
    {
        "source_sentence": "以所聞法如理觀察，以無依著心，以不耽嗜名利恭敬，以不希戀資生之具，",
        "translation": "They observe the teachings they hear correctly, with a mind free of attachment, not indulging in fame or profit, respecting and honoring them, not longing for means of subsistence.",
        "source": "T10n0287_001:0538b28_3"
    },
    {
        "source_sentence": "以無厭足引平等心猶若寶珠，以專希求一切智地，以緣如來力、無所畏、不共佛法，",
        "translation": "By means of the power of enlightenment they attain equanimity; by means of nondesire and absence of weariness they develop impartiality, like jewels. They concentrate on seeking the state of omniscience through relying upon the power of buddhas, without fear or any fear, in common with the teachings of buddhas.",
        "source": "T10n0287_001:0538b29_4"
    },
    {
        "source_sentence": "以求無著波羅蜜多，以離諂誑，以如說行，以常護實語，以不污佛家而勸於他，",
        "translation": "Because they seek the perfection of nonattachment, because they are free from hypocrisy and deceit, because they practice what they preach in accordance with truth, because they always guard their true words, and because they don’t stain the Buddha’s homeland yet encourage others.",
        "source": "T10n0287_001:0538c02_5"
    },
    {
        "source_sentence": "以不捨離諸菩薩學，以不傾動薩波若心如大山王，以不離諸世間事而能成就出世間道，",
        "translation": "Because they don’t abandon the training of enlightening beings, because they don’t incline their minds toward saṃjñāpāramitā like great mountains, and because they don’t part with worldly affairs, they can attain the transcendent path.",
        "source": "T10n0287_001:0538c04_6"
    },
    {
        "source_sentence": "以無厭修覺分資糧，以常希求後後勝法。",
        "translation": "Because they don't tire of cultivating the accumulation of the factors of awakening, they always long for the superior teachings that follow.",
        "source": "T10n0287_001:0538c06_7"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_001:0538c07_8"
    },
    {
        "source_sentence": "以如是等諸淨地法相應，菩薩名住安住極喜地中。",
        "translation": "Because such things are associated with these pure dharmas, the bodhisattva is called abiding peacefully in the ground of ultimate bliss.",
        "source": "T10n0287_001:0538c07_9"
    },
    {
        "source_sentence": "「復次，菩薩住於極喜地時，引發如是諸大誓願、諸大勇決、諸大出離，",
        "translation": "“Furthermore, when the bodhisattva abides in the stage of ultimate bliss, he gives rise to these great vows, such great commitments, such courageous resolves, and such liberations:",
        "source": "T10n0287_001:0538c09_0"
    },
    {
        "source_sentence": "為以無餘供養之具，及以周備承事品類，普遍供養一切如來。",
        "translation": "He universally offered support to all the enlightened ones by means of offerings without remainder, as well as by fully equipping them with various kinds of service.",
        "source": "T10n0287_001:0538c10_1"
    },
    {
        "source_sentence": "一切行相勝妙成就，而以最上勝解，清淨廣大法界盡虛空性窮未來際，",
        "translation": "All the characteristics of all conditioned things are supremely beautifully accomplished, yet by means of their supreme resolve they purify the vast cosmos of reality and exhaust space forever.",
        "source": "T10n0287_001:0538c11_2"
    },
    {
        "source_sentence": "一切劫數佛出世數無有休息，為大供事發初大願。",
        "translation": "He gives rise to the first great vow as a great offering for all the buddhas that have emerged in all the eons without resting, and then he gives rise to the second great vow.",
        "source": "T10n0287_001:0538c13_3"
    },
    {
        "source_sentence": "為欲受持一切如來所說法眼，為欲攝受諸佛菩提，為護一切正等覺教，",
        "translation": "“Great enlightening beings want to receive and uphold the eye of all teachings of buddhas, to embrace the enlightenment of buddhas, and to preserve all teachings of perfect enlightenment.",
        "source": "T10n0287_001:0538c14_4"
    },
    {
        "source_sentence": "廣大法界盡虛空性窮未來際，一切劫數無有休息，為攝受妙法發第二大願。",
        "translation": "The vast space of the cosmos of reality is exhausted, and there's no limit to the number of eons in the future, so he gives rise to the second great vow for the sake of taking in the wonderful Dharma.",
        "source": "T10n0287_001:0538c16_5"
    },
    {
        "source_sentence": "為一切佛出現於世，無餘一切諸世界中，住覩史多天宮為首，降下、入胎、住胎、生長、出家、成道、受梵王請、轉大法輪、示大涅槃，",
        "translation": "“Furthermore, in all the buddha-fields of the ten directions there is a great enlightening being named Vaiśravaṇa; he enters into the world for the sake of all sentient beings. In all the buddha-fields throughout the ten directions he manifests himself as an enlightening being and thus becomes supremely enlightened. He enter",
        "source": "T10n0287_001:0538c18_6"
    },
    {
        "source_sentence": "為悉往詣供養受法加行為先，為一切處同時而轉，廣大法界盡虛空性窮未來際，",
        "translation": "They go to all places at the same time in order to make offerings, receive instructions, and practice. The vast cosmos of reality extends as far as space:",
        "source": "T10n0287_001:0538c21_0"
    },
    {
        "source_sentence": "一切劫數佛出世數無有休息，為悉往詣發第三大願。",
        "translation": "The third great vow is to visit all the buddhas who have appeared in the world as many eons without cease and make offerings to them.",
        "source": "T10n0287_001:0538c22_1"
    },
    {
        "source_sentence": "為欲引發諸菩薩行，廣大無量及無分別波羅蜜多之所攝受，淨治諸地總相、別相、同相、異相、成相、壞相，",
        "translation": "In order to give rise to the practices of enlightening beings, embraced by the vast, immeasurable, and nondiscriminating perfections, they purify the general characteristics, specific characteristics, similarities, dissimilarities, formations, and disintegrations of all stages.",
        "source": "T10n0287_001:0538c24_2"
    },
    {
        "source_sentence": "諸菩薩行如實無倒，顯示菩薩智地之道，悉能瑩飾諸到彼岸，授與教授，",
        "translation": "The practices of enlightening beings are genuine and without error, revealing the path to the state of knowledge of enlightening beings. They can adorn those who have reached the other shore and teach them.",
        "source": "T10n0287_001:0538c26_3"
    },
    {
        "source_sentence": "教誡所持資助發心，廣大法界盡虛空性窮未來際，一切劫數及正行數無有休息，",
        "translation": "Their instruction is to support the determination for enlightenment, which extends throughout the cosmos of reality and ends up in space forever. They do not rest for any number of eons or practices.",
        "source": "T10n0287_001:0538c28_4"
    },
    {
        "source_sentence": "為是引發第四大願。",
        "translation": "This is the fourth great vow to give rise to it.",
        "source": "T10n0287_001:0539a01_5"
    },
    {
        "source_sentence": "為欲成就無餘一切諸有情界，有色、無色、有想、無想、非有想、非無想、卵生、胎生、濕生、化生，",
        "translation": "In order to perfect all the other realms of sentient beings, which are form and formless, with perception and non-perception, without perception or non-perception, birth from an egg, a womb, moisture, and apparitional birth.",
        "source": "T10n0287_001:0539a01_6"
    },
    {
        "source_sentence": "三界所繫入於六趣，繫屬一切受生之處名色所攝，為令趣入於佛法中，",
        "translation": "They are bound to the three realms and enter into the six destinies. They are bound to all places where they are born, included in name-and-form. In order to cause them to enter the buddha-dharma,",
        "source": "T10n0287_001:0539a03_7"
    },
    {
        "source_sentence": "為令永斷一切趣數，為令安處一切智智，廣大法界盡虛空性窮未來際，",
        "translation": "In order to cause the number of all destinies to be permanently eliminated, in order to make them abide in omniscience and knowledge, he extends the great cosmos with the nature of space at the end of time.",
        "source": "T10n0287_001:0539a05_8"
    },
    {
        "source_sentence": "一切劫數有情界數無有休息，為欲成熟諸有情界發第五大願。",
        "translation": "In all eons, there are countless sentient beings and realms without rest, and they give rise to the fifth great vow for the sake of ripening the realm of sentient beings.",
        "source": "T10n0287_001:0539a06_9"
    },
    {
        "source_sentence": "為欲無餘一切世界廣大無量麁細亂住覆住仰住帝網差別，入於十方種種異相，",
        "translation": "They want all worlds without remainder to be vast, immeasurable, crude, subtle, distraction, obscuration, uprightness, and the distinctions of the emperor’s network. They enter into various different forms in the ten directions.",
        "source": "T10n0287_001:0539a08_10"
    },
    {
        "source_sentence": "皆以隨行現前知見，廣大法界盡虛空性窮未來際，一切劫數及世界數無有休息，",
        "translation": "They all manifest knowledge and vision of the vast cosmos of reality in accordance with their practice, pervading space throughout the cosmos to the end of time without cease for all eons and worlds.",
        "source": "T10n0287_001:0539a10_11"
    },
    {
        "source_sentence": "為欲往趣發第六大願。",
        "translation": "In order to go there, he gives rise to the sixth great vow.",
        "source": "T10n0287_001:0539a11_12"
    },
    {
        "source_sentence": "為令一切諸佛剎土，復一剎土入於一切諸佛剎土普皆清淨，無量佛剎光明嚴具以為莊飾，",
        "translation": "In order to cause all buddha-lands to enter into the purity of all buddha-lands, one more buddha-land adorned with arrays of lights from countless buddha-lands.",
        "source": "T10n0287_001:0539a12_13"
    },
    {
        "source_sentence": "離諸煩惱成清淨道，無量智性有情充滿，普入廣大諸佛境界，隨諸有情意樂示現皆令歡喜，",
        "translation": "Being free of afflictions, they become pure paths, filled with sentient beings who have the nature of infinite knowledge, entering into the vast realm of buddhahood everywhere, showing and gladdening all sentient beings according to their inclinations.",
        "source": "T10n0287_001:0539a14_14"
    },
    {
        "source_sentence": "廣大法界盡虛空性窮未來際，一切劫數及佛剎數無有休息，為飾一切諸佛剎土發第七大願。",
        "translation": "The vast space of the cosmos of reality is exhausted, and its nature as space extends into the future; for all eons and buddha-lands there is no resting, and to adorn all buddha-lands I make the seventh great vow.",
        "source": "T10n0287_001:0539a16_15"
    },
    {
        "source_sentence": "為與一切菩薩同一意樂加行，為無怨敵積集善根，為一所緣與諸菩薩得平等性，",
        "translation": "In order to associate with all enlightening beings in the same effort of dedication, to accumulate roots of goodness without enemies, for one and the same purpose, they become equal to all enlightening beings.",
        "source": "T10n0287_001:0539a18_16"
    },
    {
        "source_sentence": "為常逢遇諸佛菩薩不相捨離，為隨自欲示佛出世，為隨心念解佛威力，",
        "translation": "In order to always encounter the Buddhas and enlightening beings, they do not abandon each other; in order to show their appearance in the world according to their own wishes, and in order to mentally comprehend the power of buddhas’ authority, they associate with them.",
        "source": "T10n0287_001:0539a20_17"
    },
    {
        "source_sentence": "為獲圓滿一切生中常不退轉隨行神通，為遍遊歷一切世界，為於一切眾會影現，",
        "translation": "In order to perfect all sentient beings’ superknowledge of permanence and nonregression in all births, to travel throughout all worlds, to manifest their reflections in all assemblies.",
        "source": "T10n0287_001:0539a22_18"
    },
    {
        "source_sentence": "為隨一切受生之處同類而行，為恒成就不可思議大乘理趣，為欲修行菩薩正行，",
        "translation": "“Great enlightening beings practice in accord with the conditions of all sentient beings, according to their similarities and differences; they always develop the principles and teachings of the inconceivable great vehicle, wanting to cultivate the practice of enlightening practice.",
        "source": "T10n0287_001:0539a24_19"
    },
    {
        "source_sentence": "廣大法界盡虛空性窮未來際，一切劫數及正行數無有休息，為大智神通發第八大願。",
        "translation": "The vast space of the cosmos of reality is exhausted, and its nature as space extends to the limitless future, with all the eons and right practices without resting, he gives rise to the eighth great vow for great knowledge and supernormal abilities.",
        "source": "T10n0287_001:0539a26_20"
    },
    {
        "source_sentence": "為行乘御不退轉輪諸菩薩行，為身、語、意業不唐捐，為暫見者便得決定諸佛法性，",
        "translation": "In order to practice the vehicle of enlightening beings and not turn away from it, they do not neglect physical, verbal, or mental action. Those who see them for a short while will attain certainty about the buddha-dharma-nature.",
        "source": "T10n0287_001:0539a28_21"
    },
    {
        "source_sentence": "暫聞言音便隨智證，纔生淨信永斷煩惱，為身得成如大藥王，為得身心如如意寶，",
        "translation": "Having heard these words and sounds for a moment, he follows their knowledge and realizes them. He gives rise to pure faith and permanently eliminates all afflictions. In order to attain the state of great Healing King in body and mind, he attains the wish-granting jewel of supernormal power in body and mind.",
        "source": "T10n0287_001:0539b01_22"
    },
    {
        "source_sentence": "為當修行大菩薩行，廣大法界盡虛空性窮未來際，一切劫數及正行數無有休息，",
        "translation": "In order to cultivate the practice of great enlightening beings, their vast spacelike nature throughout the cosmos extending as far as all space in the cosmos will never cease. Throughout all ages and righteous deeds they do so without cease.",
        "source": "T10n0287_001:0539b02_23"
    },
    {
        "source_sentence": "為不唐捐發第九大願。",
        "translation": "It's because they don't give up the ninth great vow.",
        "source": "T10n0287_001:0539b04_24"
    },
    {
        "source_sentence": "為於一切諸世界中，當證無上正等菩提為不殊異，於一毛道遍於一切諸毛道中，",
        "translation": "In order to realize unsurpassed perfect enlightenment in all worlds without distinction, he pervades a single hair pore with all hair pores.",
        "source": "T10n0287_001:0539b05_25"
    },
    {
        "source_sentence": "示生、出家、道場、正覺、轉大法輪、歸大寂滅，為當現證弘佛境界威力智慧，",
        "translation": "They show birth, leaving home, the site of enlightenment, perfect enlightenment, turning the great wheel of teaching, returning to great extinction, so that they may now realize the vast sphere of buddhahood.",
        "source": "T10n0287_001:0539b07_26"
    },
    {
        "source_sentence": "隨於一切有情意樂示佛出世，令其所化剎那剎那覺寂證修，為剎那頃以一正覺普遍一切法寂滅性，",
        "translation": "“Depending on the mentalities of all sentient beings, they show buddhas appearing in the world according to their wishes, causing moment-to-moment enlightenment that they teach to be realized and cultivated. In a single instant, with one true awakening, they manifest the tranquillity of all things.",
        "source": "T10n0287_001:0539b08_27"
    },
    {
        "source_sentence": "為以一音演說法要，令諸有情心皆悅豫，為示大涅槃而行力不絕，為示大智地建立一切法，",
        "translation": "In order to expound the essentials of the Teaching in one voice, to gladden all sentient beings’ minds, to show great nirvana their practical power without cease, and to show how all things are established in the state of great knowledge.",
        "source": "T10n0287_001:0539b11_28"
    },
    {
        "source_sentence": "為以法智神變幻通，悉能充遍一切世界，廣大法界盡虛空性窮未來際，",
        "translation": "Because of the magical power of knowledge of truth they are able to pervade all worlds. The vast cosmos of reality extends as far as space, reaching everywhere in the future.",
        "source": "T10n0287_001:0539b13_29"
    },
    {
        "source_sentence": "一切劫數及正覺數無有休息，為引發大乘菩薩發起第十大願。",
        "translation": "All the eons and number of perfectly enlightened ones without cease, he gives rise to the tenth great vow for the sake of inducing great vehicle bodhisattvas to give rise to the tenth great vow.",
        "source": "T10n0287_001:0539b15_0"
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "“O Children of Buddha!",
        "source": "T10n0287_001:0539b16_1"
    },
    {
        "source_sentence": "初地菩薩，發如是等諸大誓願、諸大勇決、諸大出離。",
        "translation": "A bodhisattva in the first ground gives rise to such great vows, great courageous resolves, and great liberations.",
        "source": "T10n0287_001:0539b16_2"
    },
    {
        "source_sentence": "菩薩住此極喜地中，十大願門以為上首，引發圓滿百千阿僧企耶諸餘正願，",
        "translation": "Enlightening beings in this stage of ultimate bliss have the ten great vows foremost at their head, producing hundreds of thousands of myriads of other true vows.",
        "source": "T10n0287_001:0539b17_3"
    },
    {
        "source_sentence": "是諸大願以十盡句而引發之。",
        "translation": "These are the ten exhaustive phrases of the great vows that give rise to them.",
        "source": "T10n0287_001:0539b19_4"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0287_001:0539b20_5"
    },
    {
        "source_sentence": "所謂：以有情界盡，以世界盡，以虛空界盡，以法界盡，以涅槃界盡，",
        "translation": "Because the realm of sentient beings is exhausted, because worlds are exhausted, because space is exhausted, because the realm of reality is exhausted, and because the realm of nirvana is exhausted.",
        "source": "T10n0287_001:0539b20_6"
    },
    {
        "source_sentence": "以佛興界盡，以入如來智慧界盡，以心所緣界盡，以智入佛所行界盡，",
        "translation": "Because of the exhaustion of the realm of Buddha-generation, because of the exhaustion of the realm of entering buddhas’ wisdom, because of the exhaustion of the realm of mind as supporting object, and because of the exhaustion of the realm of knowledge entering buddha-practices.",
        "source": "T10n0287_001:0539b22_7"
    },
    {
        "source_sentence": "以世間轉法輪智轉界盡；",
        "translation": "By worldly knowledge of the turning of the wheel of the Teaching they have completely exhausted the realm of transmutation.",
        "source": "T10n0287_001:0539b23_8"
    },
    {
        "source_sentence": "若有情界有斷盡者，是大誓願乃有斷盡；",
        "translation": "If there is annihilation in the realm of sentient beings, then this great undertaking has annihilation.",
        "source": "T10n0287_001:0539b24_9"
    },
    {
        "source_sentence": "乃至若智轉界有斷盡者，是大誓願乃有斷盡。",
        "translation": "Even if there's cessation in the realm of knowledge that transforms, this is the great vow that there's cessation.",
        "source": "T10n0287_001:0539b25_10"
    },
    {
        "source_sentence": "然有情界終無斷盡，此諸善根願無斷盡，乃至智轉界終無斷盡，此諸善根亦無斷盡。",
        "translation": "Still, there's no ending of these good roots and vows in the realm of sentient beings, and there's no end of these good roots and vows in the realm of cognition, and there's no ending of those good roots and vows in the realm of knowledge.",
        "source": "T10n0287_001:0539b26_11"
    },
    {
        "source_sentence": "佛說十地經卷第一",
        "translation": "Foshuo shidi jing, vol. 1",
        "source": "T10n0287_001:0539b29_0"
    }
]