[
    {
        "source_sentence": "大方廣佛華嚴經卷第十五",
        "translation": "Dafangguang fo huayan jing, vol. 15",
        "source": "T10n0293_015:0727b10_0"
    },
    {
        "source_sentence": "罽賓國三藏般若奉　詔譯",
        "translation": "translated by imperial edict of the Tripiṭaka Master Prajñāpāramitā of Kāśmīra",
        "source": "T10n0293_015:0727b12_0"
    },
    {
        "source_sentence": "入不思議解脫境界普賢行願品",
        "translation": "Chapter on the Vows and Practices of Samantabhadra who Enters the Realm of Inconceivable Liberation",
        "source": "T10n0293_015:0727b13_0"
    },
    {
        "source_sentence": "爾時，善財童子於諸眾生，起大慈普遍心，起大悲潤澤心，思惟相續曾無間斷，",
        "translation": "At that time, the enlightening being Universally Good had great compassion for all sentient beings and developed a mind imbued with great compassion; his thoughts were continuous without interruption.",
        "source": "T10n0293_015:0727b14_0"
    },
    {
        "source_sentence": "福德智慧具足莊嚴，正見圓滿離諸塵垢，證法平等心無高下，隨順悟入一切智道，",
        "translation": "Their virtues and knowledge are fully adorned, their right view perfected, free from all defilement. They realize the equality of all things; their minds have no superiority or inferiority. They follow enlightenment and enter the path of omniscience.",
        "source": "T10n0293_015:0727b15_1"
    },
    {
        "source_sentence": "拔不善刺滅一切障，了達甚深覺法自性，堅固精進以為牆塹，不思議三昧而為園苑，",
        "translation": "He pulls out all unwholesome thorns and eliminates all hindrances, comprehends the self-nature of profoundly awakened dharmas, makes steadfast effort into a moat, and makes inconceivable concentration into a park.",
        "source": "T10n0293_015:0727b17_2"
    },
    {
        "source_sentence": "以慧日光破無明闇，以方便風開智慧華，以廣大願充滿法界，心常現入一切智城；",
        "translation": "By the light of the sun of wisdom they dispel the darkness of ignorance; by means of expedient winds they open the flowers of knowledge and wisdom, filling the cosmos with vast vows. Their minds always appear entering the city of omniscience.",
        "source": "T10n0293_015:0727b19_3"
    },
    {
        "source_sentence": "如是勤求菩薩之道，漸次往詣樂瓔珞城，到彼詢求最勝長者。",
        "translation": "Thus diligently seeking the bodhisattva path, he gradually went to the pleasant city of Yingluo and asked for the most excellent elder.",
        "source": "T10n0293_015:0727b21_4"
    },
    {
        "source_sentence": "見在城東大莊嚴幢無憂林中，無量商人百千長者眾所圍遶，理斷人間種種事務，",
        "translation": "To the east of the city he was surrounded by innumerable merchants and hundreds of thousands of wealthy householders who were engaged in all kinds of business.",
        "source": "T10n0293_015:0727b22_5"
    },
    {
        "source_sentence": "因為宣揚出世之法，令離見慢及我、我所，捨所積聚眷屬珍財，滅除慳嫉一切疑執，",
        "translation": "In order to preach the transcendent ways, they become free of pride in views of self and what belongs to self, forsake the treasures accumulated by their followers, and abandon all doubts and attachments that are based on stinginess and envy.",
        "source": "T10n0293_015:0727b24_6"
    },
    {
        "source_sentence": "心得清淨無諸穢濁，獲淨信力，常樂見佛，受持佛法，生菩薩力，起菩薩行，",
        "translation": "Their minds are pure and without defilement; they attain the power of pure faith. They always delight in seeing buddhas, upholding the teachings of buddhas. They develop the enlightening practice of enlightening beings by the power of enlightening beings.",
        "source": "T10n0293_015:0727b26_7"
    },
    {
        "source_sentence": "入菩薩三昧，得菩薩智慧，住菩薩正念，增菩薩樂欲，發起無上菩提之心。",
        "translation": "Entering the bodhisattva's concentration, he attains the bodhisattva's wisdom, abides in the bodhisattva's right mindfulness, increases the bodhisattva's pleasure and desire, and arouses the mind of unsurpassed enlightenment.",
        "source": "T10n0293_015:0727b28_8"
    },
    {
        "source_sentence": "爾時，善財即至其所，以身投地，頂禮其足，良久乃起，以尊重心白言：「聖者！",
        "translation": "At that point, Shanzai went to him, prostrated himself on the ground with his body, bowed his head at his feet, stood up for a long time, and said respectfully, Sage!",
        "source": "T10n0293_015:0727b29_9"
    },
    {
        "source_sentence": "我是善財！",
        "translation": "I am Shanzai!",
        "source": "T10n0293_015:0727c02_10"
    },
    {
        "source_sentence": "我是善財！",
        "translation": "I am Shanzai!",
        "source": "T10n0293_015:0727c02_11"
    },
    {
        "source_sentence": "我專尋求菩薩勝行。",
        "translation": "I'm focusing on seeking the bodhisattva's superior practice.",
        "source": "T10n0293_015:0727c03_12"
    },
    {
        "source_sentence": "菩薩云何學菩薩行？",
        "translation": "How do enlightening beings study the practice of enlightening beings?",
        "source": "T10n0293_015:0727c03_13"
    },
    {
        "source_sentence": "菩薩云何修菩薩道？",
        "translation": "How do enlightening beings cultivate the path of enlightening beings?",
        "source": "T10n0293_015:0727c04_0"
    },
    {
        "source_sentence": "隨修學時，常能化度一切眾生，常能現見一切諸佛，常得聽聞一切佛法，",
        "translation": "Whenever they practice and study, they can always save all sentient beings. They can always see all buddhas in the world and always hear the Teaching of all buddhas.",
        "source": "T10n0293_015:0727c04_1"
    },
    {
        "source_sentence": "常能住持一切佛法，常能趣入一切法門，入一切剎學菩薩行，常能久住一切大劫，",
        "translation": "They are always able to uphold all Buddha teachings, always able to enter all aspects of the Teaching. Entering into all lands to learn enlightening practices, they can always abide forever in all great eons.",
        "source": "T10n0293_015:0727c06_2"
    },
    {
        "source_sentence": "修菩薩道心無厭足，能知一切如來神力，能得一切如來護念，能入一切如來智慧。」",
        "translation": "Cultivating the mind of the path of enlightenment without tire, they can know the miraculous powers of all tathāgatas, attain the protection of all tathāgatas, and enter the wisdom of all tathāgatas.",
        "source": "T10n0293_015:0727c08_3"
    },
    {
        "source_sentence": "時，彼長者告善財言：「善哉！",
        "translation": "That elder then addressed Sun Cai, saying, Good!",
        "source": "T10n0293_015:0727c10_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T10n0293_015:0727c10_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0727c10_2"
    },
    {
        "source_sentence": "汝已能發阿耨多羅三藐三菩提心。",
        "translation": "You've already arisen the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0293_015:0727c10_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0727c11_4"
    },
    {
        "source_sentence": "我已成就至一切處淨菩薩行法門，無體、無依、無作、無住神通之力。",
        "translation": "I've accomplished the method of purifying bodhisattva practice up to all places, which has no essence, no basis, no action, and no abiding supernormal powers.",
        "source": "T10n0293_015:0727c11_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0727c14_0"
    },
    {
        "source_sentence": "云何名為至一切處淨菩薩行法門？",
        "translation": "What's called the method of purifying the bodhisattva's practice up to all places?",
        "source": "T10n0293_015:0727c14_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0727c15_0"
    },
    {
        "source_sentence": "我於此三千大千世界欲界一切諸眾生中；",
        "translation": "Among all sentient beings in the realm of desire in this billion-world-world universe, I am a buddha.",
        "source": "T10n0293_015:0727c15_1"
    },
    {
        "source_sentence": "所謂：一切三十三天、一切須夜摩天、一切兜率陀天、一切樂變化天、一切他化自在天、一切魔天及餘一切欲界所居部類眷屬、一切天、龍、夜叉、羅剎、鳩槃茶、乾闥婆、阿脩羅、迦樓羅、緊那羅、摩睺羅伽、人與非人、村營城邑一切住處，",
        "translation": "All the thirty-three gods, all the Sudarśana gods, all the Tuṣita gods, all the Nirmāṇarati gods, all the Paranirmitavaśavartin gods, all the Māra gods and all the other members of their retinues living in the realm of desire, all the gods, dragons, yakṣas,",
        "source": "T10n0293_015:0727c16_2"
    },
    {
        "source_sentence": "諸眾生中，隨其所應而為說法。",
        "translation": "Among sentient beings, he teaches the Dharma according to their needs.",
        "source": "T10n0293_015:0727c21_3"
    },
    {
        "source_sentence": "令捨非法，令息諍論，令除鬪戰，令止忿競，令破怨結，令解繫縛，令出牢獄，",
        "translation": "He causes them to abandon what is not lawful, to put an end to disputes, to get rid of fighting, to stop anger and strife, to break the bonds of enmity, to be freed from bondage, and to be released from prison.",
        "source": "T10n0293_015:0727c22_4"
    },
    {
        "source_sentence": "令免怖畏，令斷殺生，乃至邪見一切惡業不可作事皆令禁止；",
        "translation": "They cause them to be freed from fear, and cause them to abandon killing. All bad deeds of wrong views and all bad actions that should not be done—all they cause to be forbidden.",
        "source": "T10n0293_015:0727c23_5"
    },
    {
        "source_sentence": "令其順行一切善法，諸可作事皆使正修；",
        "translation": "They cause them to follow and practice all good principles, causing whatever they can do to be correctly cultivated.",
        "source": "T10n0293_015:0727c25_6"
    },
    {
        "source_sentence": "令其遍學一切技藝，於諸世間而作利益；",
        "translation": "I cause them to study all arts and sciences, benefiting all beings.",
        "source": "T10n0293_015:0727c26_7"
    },
    {
        "source_sentence": "為其分別種種諸論，隨其所應令生歡喜；",
        "translation": "I elucidate various theories for them, causing them to rejoice according to their needs.",
        "source": "T10n0293_015:0727c27_8"
    },
    {
        "source_sentence": "令漸成熟，隨順一切諸外道眾，為說勝慧；",
        "translation": "He caused them to gradually mature and follow all the heretics, teaching them superior wisdom.",
        "source": "T10n0293_015:0727c28_9"
    },
    {
        "source_sentence": "令斷諸見、令入佛法；",
        "translation": "They cause all views to be cut off and lead into the buddha-teachings.",
        "source": "T10n0293_015:0727c29_10"
    },
    {
        "source_sentence": "乃至色界一切梵天，我亦為其說如是法。",
        "translation": "To all the Brahma gods of the form realm, I'll also explain this teaching for them.",
        "source": "T10n0293_015:0727c29_11"
    },
    {
        "source_sentence": "如於此三千大千世界乃至十方十不可說百千億那由他佛剎極微塵數世界之中，",
        "translation": "And so it is in as many worlds as atoms in all the buddha-fields of the ten directions, from this universe called Sarvagandhasugandhā to the universe Abhirati.",
        "source": "T10n0293_015:0728a01_12"
    },
    {
        "source_sentence": "我皆為其廣說正法；",
        "translation": "I will explain the true teaching in detail for them.",
        "source": "T10n0293_015:0728a03_13"
    },
    {
        "source_sentence": "所謂：佛法、菩薩法、聲聞法、獨覺法；",
        "translation": "The teachings of buddhas, the teachings of enlightening beings, the teachings of enlightening beings, the teachings of disciples, and the teachings of individual illuminates.",
        "source": "T10n0293_015:0728a03_14"
    },
    {
        "source_sentence": "說地獄趣，說地獄眾生受苦差別，說向地獄道；",
        "translation": "They are said to be rebirth in hell; they are said to be the difference between beings who experience frustration in hell and those who proceed to hell.",
        "source": "T10n0293_015:0728a04_15"
    },
    {
        "source_sentence": "說畜生趣，說畜生眾生受苦差別，說向畜生道；",
        "translation": "They teach about the courses of rebirth as an animal. They teach about the differences in suffering experienced by animals and sentient beings, and they teach about going to the courses of rebirth as an animal.",
        "source": "T10n0293_015:0728a05_16"
    },
    {
        "source_sentence": "說閻羅王界，說閻羅王界受苦差別，說向閻羅王界道；",
        "translation": "It is said to be the realm of the king of hells; it is said to be the differentiation in suffering experienced by the realm of the king of hells; it is said to be the path leading to the realm of the king of hells.",
        "source": "T10n0293_015:0728a06_17"
    },
    {
        "source_sentence": "說天世間，說天世間受樂差別，說向天世間道；",
        "translation": "They speak of the celestial world, they speak of the differences in enjoyment of bliss in the celestial world, and they speak of the path leading to heavenly realms.",
        "source": "T10n0293_015:0728a08_18"
    },
    {
        "source_sentence": "說人世間，說人世間受苦受樂，說向人世間道。",
        "translation": "It's called the human world, it's called the human world that receives pain and experiences pleasure in the human world, and it's called the path leading to the human world.",
        "source": "T10n0293_015:0728a09_19"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0728a10_20"
    },
    {
        "source_sentence": "我說如是種種世間，若集、若壞、若染、若淨；",
        "translation": "“World-honored One, I teach in this way about the various worlds:",
        "source": "T10n0293_015:0728a10_21"
    },
    {
        "source_sentence": "為欲開顯菩薩功德，為令捨離生死過患，為令知見諸佛功德，為令知見諸有趣生，",
        "translation": "In order to show enlightening beings the virtues of enlightening beings, in order to cause them to abandon the afflictions of birth and death, so that they may know and see the qualities of buddhas, and so that they may know and see the various forms of living beings.",
        "source": "T10n0293_015:0728a11_22"
    },
    {
        "source_sentence": "為令知見無障礙法，為令開發智慧光明，為欲顯示苦樂因起，為欲顯示入無相門，",
        "translation": "I elucidate the unobstructed dharmas so that they may be known and seen, develop the light of wisdom so that they may be developed, show the causes of suffering and pleasure so that they may arise, and show signlessness so that they may enter.",
        "source": "T10n0293_015:0728a13_23"
    },
    {
        "source_sentence": "為令眾生捨諸想著，為令證得佛無依法，為令永滅煩惱業輪，為令能轉佛淨法輪，",
        "translation": "In order to cause sentient beings to abandon all conceptual attachments, in order to enable them to realize buddhahood without doctrine, in order to cause the wheel of action of afflictions to be forever extinguished, and in order to enable them to turn the wheel of the pure teaching of Buddhahood.",
        "source": "T10n0293_015:0728a15_24"
    },
    {
        "source_sentence": "我為眾生說如是法。",
        "translation": "I teach such a teaching for sentient beings.",
        "source": "T10n0293_015:0728a17_25"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0728a17_26"
    },
    {
        "source_sentence": "我唯知此至一切處淨菩薩行莊嚴法門，無依、無作、無性、無住神通之力。",
        "translation": "I only know this approach of the practice of pure bodhisattva adornment in all places, which has no basis, no effort, no essence, and no abiding supernormal powers.",
        "source": "T10n0293_015:0728a17_27"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩具足一切自在神通，悉能遍往一切佛剎，得普眼地，住淨耳根，",
        "translation": "“Furthermore, just as the great enlightening beings who are endowed with all independent spiritual powers can go to all buddha-lands and attain the state of universal vision while dwelling in the pure faculty of hearing,",
        "source": "T10n0293_015:0728a19_28"
    },
    {
        "source_sentence": "悉聞一切音聲言說，普入諸法智慧自在，勇健無比，離諸乖諍，以廣長舌出平等音，",
        "translation": "They can hear all sounds and utterances, enter all truths with unimpeded knowledge and wisdom. Their courageous strength is beyond compare. Free from any disharmony, they utter the voice of equanimity with a broad and long tongue.",
        "source": "T10n0293_015:0728a21_29"
    },
    {
        "source_sentence": "其身妙好同諸菩薩，與諸如來究竟無二，智身廣大普入三世，境界無際同於虛空，",
        "translation": "Their bodies were as beautiful as those of enlightening beings, ultimately nondual to the Buddhas. The body of knowledge was vast and entered into all times; its boundless realm was like space.",
        "source": "T10n0293_015:0728a23_30"
    },
    {
        "source_sentence": "而我云何能知、能說彼功德行？",
        "translation": "How can I know and explain their meritorious actions?",
        "source": "T10n0293_015:0728a25_31"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0728a25_32"
    },
    {
        "source_sentence": "於此南方有一國土，名無邊際河，其國有城名羯陵迦林，有比丘尼名師子頻申，",
        "translation": "To the south of here is a land called Boundless River. In that land there is a city called Kaliṅga-forest, where there lives a monk and nun named Siṃhala Bimbisāra.",
        "source": "T10n0293_015:0728a26_0"
    },
    {
        "source_sentence": "汝詣彼問菩薩云何學菩薩行，修菩薩道。」",
        "translation": "Go there and ask the bodhisattva how to train in the bodhisattva practice and cultivate the bodhisattva path.",
        "source": "T10n0293_015:0728a28_0"
    },
    {
        "source_sentence": "時，善財童子禮最勝足，遶無數匝，慇懃瞻仰，一心戀慕，辭退而去。",
        "translation": "Then Sudhana paid his respects to the brahman and departed. The brahman’s feet touched the ground, and the brahman’s footsteps touched the ground; then Sudhana paid his respects to the brahman and departed.",
        "source": "T10n0293_015:0728a28_1"
    },
    {
        "source_sentence": "爾時，善財童子漸漸前行，至無邊際河羯陵迦林，周遍尋訪師子頻申比丘尼；",
        "translation": "It was then that Sudhana gradually proceeded to Kapilavastu, the forest of boundless rivers and streams.",
        "source": "T10n0293_015:0728b02_0"
    },
    {
        "source_sentence": "時，無量人咸告之言：「善男子！",
        "translation": "Measureless people then all told him, Good man!",
        "source": "T10n0293_015:0728b03_1"
    },
    {
        "source_sentence": "此比丘尼在勝光王之所，捨施日光園中說法，利益無量眾生。」",
        "translation": "This bhikṣuṇī was at the place of King Vaiśravaṇa and gave up her teaching in the Sunlight Park to benefit measureless sentient beings.",
        "source": "T10n0293_015:0728b04_2"
    },
    {
        "source_sentence": "善財聞已，歡喜踊躍，即詣彼園，周遍觀察，見其園中有一大樹，名過滿月，",
        "translation": "Having heard these words, Sudhana was delighted and jumped for joy. Hearing them, Sudhana went to the monastery and saw a large tree in the middle of the garden, called Mahāprajāpatīṇasaṃkusumitābhijña (“Further Going Beyond the Full Moon”) [in the sky].",
        "source": "T10n0293_015:0728b05_3"
    },
    {
        "source_sentence": "形如樓閣，高廣嚴好，放大光明，照一由旬；",
        "translation": "It was shaped like a tower, one yojana high and wide and beautifully adorned, emanating great rays of light.",
        "source": "T10n0293_015:0728b07_4"
    },
    {
        "source_sentence": "復見葉樹名曰普覆，其形如蓋，紺青光明，周遍照耀；",
        "translation": "He also saw a tree of leaves called universal covering, shaped like a canopy with a deep blue light shining everywhere.",
        "source": "T10n0293_015:0728b08_5"
    },
    {
        "source_sentence": "復見華樹，名曰華藏，形色高潔，猶如雪山，雨眾妙華，如流香水，周遍普熏，",
        "translation": "He also saw a flowering tree called “treasury of flowers,” which was as tall and lofty in color like the snowy mountains and showered down all kinds of exquisite flowers like running fragrance pervading everywhere.",
        "source": "T10n0293_015:0728b09_6"
    },
    {
        "source_sentence": "無有窮盡，猶忉利天歡喜園中波利質多羅樹；",
        "translation": "There is no limit to their number, just like the pārijātaka tree in the joyful grove of the Trāyastriṃśa gods.",
        "source": "T10n0293_015:0728b11_7"
    },
    {
        "source_sentence": "復有果樹，名為常熟，形如金山，味如甘露，柔軟香美，常放光明，種種眾果，",
        "translation": "There is another kind of fruit called eternally ripe, shaped like a golden mountain with the taste of sweet ambrosia, soft and fragrant, which always emits light and produces various fruits.",
        "source": "T10n0293_015:0728b12_8"
    },
    {
        "source_sentence": "悉皆具足；",
        "translation": "They are all fully endowed.",
        "source": "T10n0293_015:0728b14_9"
    },
    {
        "source_sentence": "其中復有摩尼寶樹，名毘盧遮那藏，其形無比，如妙高山，心王摩尼寶最在其上，",
        "translation": "Among them was another jewel tree, called the Vairocana treasury, incomparably shaped like a sublime high mountain. Above it was the maṇi-jewel of the king of mind.",
        "source": "T10n0293_015:0728b14_10"
    },
    {
        "source_sentence": "阿僧祇色相摩尼寶周遍莊嚴，栴檀摩尼以為樹果，眾雜珠網羅覆其上；",
        "translation": "They were all adorned with jewels of countless colors and characteristics. The fruit of the sandalwood tree was covered with a network of various pearls.",
        "source": "T10n0293_015:0728b16_11"
    },
    {
        "source_sentence": "復有鬘樹，名為天寶，恒出妙寶瓔珞華鬘，如意寶王敷榮光耀，摩尼寶藏蘊伏其下，",
        "translation": "There was also a palm tree called celestial treasure, which always produced exquisitely beautiful jeweled necklaces and flower garlands. The king of wish-granting jewels spread their blossoms shining brilliantly, while the store aggregate of maṇi treasure subdued it.",
        "source": "T10n0293_015:0728b18_12"
    },
    {
        "source_sentence": "以為樹根；",
        "translation": "They think of it as the roots of a tree.",
        "source": "T10n0293_015:0728b20_13"
    },
    {
        "source_sentence": "復有衣樹，名能清淨，常出眾色諸妙寶衣，垂布樹枝以為嚴飾；",
        "translation": "There was also a tree of cloth called Pure, which always wore beautiful jeweled robes of various colors and adorned themselves with hanging silk-covered branches.",
        "source": "T10n0293_015:0728b20_14"
    },
    {
        "source_sentence": "有音樂樹，名為歡喜，其音美妙過諸天樂；",
        "translation": "There is a tree of music called joy, whose sound surpasses that of the gods’ music.",
        "source": "T10n0293_015:0728b21_15"
    },
    {
        "source_sentence": "復有香樹，名遍莊嚴，恒出妙香普熏一切。",
        "translation": "There's another fragrant tree named pervasively adorned, which always produces a wonderful fragrance that perfumes all.",
        "source": "T10n0293_015:0728b22_16"
    },
    {
        "source_sentence": "園中復有種種陂池，一切皆以七寶莊嚴，其池入處，眾寶莊嚴；",
        "translation": "In the park there are various ponds, all adorned with the seven kinds of treasure. Each pond has a place where it enters, arrayed with many kinds of treasures.",
        "source": "T10n0293_015:0728b23_17"
    },
    {
        "source_sentence": "眾色摩尼而為欄楯，栴檀香末凝積其中，上妙金沙彌布其底，八功德水清淨盈滿，",
        "translation": "The railings were made of jewels of various colors, the fragrance of sandalwood concentrated in them, the bottom was covered with the finest gold sands, and the water of the eight kinds of virtuous qualities filled it.",
        "source": "T10n0293_015:0728b25_18"
    },
    {
        "source_sentence": "優鉢羅華、波頭摩華、拘物頭華、芬陀利華遍覆其上；",
        "translation": "It was covered with blue lotus blossoms, pink lotus blossoms, red lotus blossoms, and white lotus blossoms.",
        "source": "T10n0293_015:0728b27_0"
    },
    {
        "source_sentence": "瞻博迦華、阿提目多迦華、婆利師迦華、曼陀羅華、摩訶曼陀羅華，如是等華，",
        "translation": "The campaka flower, the atimokṣa flower, the pāriṣṭika flower, the māndārava flower, and the mahāmandārava flower are like these flowers.",
        "source": "T10n0293_015:0728b28_1"
    },
    {
        "source_sentence": "列植其岸，眾鳥和鳴，其聲清雅。",
        "translation": "The shore was lined with plants and the birds sang harmoniously in harmony, their voices clear and elegant.",
        "source": "T10n0293_015:0728b29_2"
    },
    {
        "source_sentence": "種種天寶，妙莊嚴樹，行列園中；",
        "translation": "Various kinds of celestial treasures, exquisitely adorned trees, and rows of trees lined up in the park.",
        "source": "T10n0293_015:0728c01_3"
    },
    {
        "source_sentence": "諸寶樹下，各各敷置寶師子座，以不思議種種妙寶而為莊嚴；",
        "translation": "Under each of the jeweled trees was a jeweled lion seat, adorned with inconceivably many kinds of exquisite jewels.",
        "source": "T10n0293_015:0728c02_4"
    },
    {
        "source_sentence": "布以天衣，熏以妙香；",
        "translation": "He wore heavenly clothes and perfumed himself with a wonderful fragrance.",
        "source": "T10n0293_015:0728c03_5"
    },
    {
        "source_sentence": "垂諸寶繒，施諸寶帳，閻浮金網彌覆其上；",
        "translation": "They were draped with jewel railings, covered with jewel curtains, and covered with golden nets of jade.",
        "source": "T10n0293_015:0728c04_6"
    },
    {
        "source_sentence": "寶鐸徐搖，出妙音聲；",
        "translation": "The jeweled chimes gently swayed and produced subtle sounds.",
        "source": "T10n0293_015:0728c05_7"
    },
    {
        "source_sentence": "或有樹下敷蓮華藏師子之座；",
        "translation": "Some had lotus-treasury lion seats arranged under trees.",
        "source": "T10n0293_015:0728c05_8"
    },
    {
        "source_sentence": "或有樹下敷香王摩尼藏師子之座；",
        "translation": "Sometimes there was a lion seat of the jewel mine of the king of fragrances arranged under trees.",
        "source": "T10n0293_015:0728c06_9"
    },
    {
        "source_sentence": "或有樹下敷龍象莊嚴摩尼王藏師子之座；",
        "translation": "Sometimes there was a lion seat of jewel treasures, adorned with dragons and elephants spread under trees.",
        "source": "T10n0293_015:0728c07_10"
    },
    {
        "source_sentence": "或有樹下敷寶師子聚摩尼王藏師子之座；",
        "translation": "Sometimes there was a lion seat of jewel treasures, such as the store of all kinds of jewels, arranged under trees.",
        "source": "T10n0293_015:0728c08_11"
    },
    {
        "source_sentence": "或有樹下敷毘盧遮那摩尼王藏師子之座；",
        "translation": "Perhaps there was a lion seat of the jewel treasure house of Vairocana, which was spread out under a tree.",
        "source": "T10n0293_015:0728c09_12"
    },
    {
        "source_sentence": "或有樹下敷十方毘盧遮那摩尼王藏師子之座；",
        "translation": "Or there were lion seats arranged under trees in the ten directions of the great storehouse of all kinds of jewels, such as sapphires and diamonds.",
        "source": "T10n0293_015:0728c10_13"
    },
    {
        "source_sentence": "或有樹下敷因陀羅摩尼金剛王藏師子之座；",
        "translation": "Sometimes there was a lion seat of the adamantine treasury of Indra maṇi jewels arranged under a tree.",
        "source": "T10n0293_015:0728c11_14"
    },
    {
        "source_sentence": "或有樹下敷眾生形相毘盧遮那摩尼王藏師子之座；",
        "translation": "Sometimes there was a lion seat of the forms of sentient beings arranged under trees in the great storehouse of all kinds of jewels, called Vairocana.",
        "source": "T10n0293_015:0728c12_15"
    },
    {
        "source_sentence": "或有樹下敷如意摩尼王藏師子之座；",
        "translation": "Some had lion seats of wish-granting jewel treasures arranged under trees.",
        "source": "T10n0293_015:0728c13_16"
    },
    {
        "source_sentence": "或有樹下敷白色光明摩尼王藏師子之座；",
        "translation": "Sometimes there was a lion seat of white radiant jewel mines under trees, adorned with various kinds of ornaments.",
        "source": "T10n0293_015:0728c14_17"
    },
    {
        "source_sentence": "其一一座各有百千寶師子座周匝圍遶，一一皆具無量莊嚴。",
        "translation": "Each of those pavilions was surrounded by hundreds of thousands of jeweled lion seats, each adorned with an infinite variety of adornments.",
        "source": "T10n0293_015:0728c15_18"
    },
    {
        "source_sentence": "此大園中眾寶充滿，如海寶洲，寶衣布地，敷設莊嚴，柔軟妙好；",
        "translation": "The great park was filled with all kinds of treasures, like an ocean or a jeweled continent. Precious robes spread on the ground and decorated with exquisite softness and suppleness.",
        "source": "T10n0293_015:0728c16_19"
    },
    {
        "source_sentence": "如迦隣迦衣，能生樂觸，蹈之沒足，舉即還復；",
        "translation": "It is like a garland of khadiraka cloth, which can give rise to pleasant sensations. When one steps on it without touching its feet, and when one lifts it, the sensation returns.",
        "source": "T10n0293_015:0728c18_20"
    },
    {
        "source_sentence": "異類眾鳥，鳧鴈、鴛鴦、白鶴、孔雀、拘枳羅等飛翔自在，顧影和鳴；",
        "translation": "Various kinds of birds such as hawks, ducks, mandarin ducks, white cranes, peacocks, and koṭalas flew freely, singing harmoniously in accord with their shadows.",
        "source": "T10n0293_015:0728c19_21"
    },
    {
        "source_sentence": "寶栴檀林，列植門側，密葉葱翠，聳幹枎疏，布影垂陰，莊嚴妙好；",
        "translation": "The jeweled sandalwood grove was planted beside the gate in rows, with dense leaves and luxuriant greenery; its lofty trunks were embellished with silhouetted shadows draping shade.",
        "source": "T10n0293_015:0728c20_22"
    },
    {
        "source_sentence": "種種華樹，常雨妙華，逾天帝釋雜華之園；",
        "translation": "Various kinds of flowering trees always showered exquisite flowers, surpassing Indra’s park with a mixture of flowers.",
        "source": "T10n0293_015:0728c22_23"
    },
    {
        "source_sentence": "無比香王普熏一切，香風四布，流及天人；",
        "translation": "The king of incomparable fragrance permeated them all, with a four-pronged fragrant wind blowing in all directions, reaching as far as heaven and earth.",
        "source": "T10n0293_015:0728c23_24"
    },
    {
        "source_sentence": "一切樓閣眾寶莊嚴，上妙香華珍奇校飾，過天帝釋善法之堂；",
        "translation": "All the towers were adorned with all kinds of jewels, beautifully decorated with exquisitely fragrant flowers and rare treasures, surpassing the hall of the Good Dharma of Sakka, ruler of the gods.",
        "source": "T10n0293_015:0728c24_25"
    },
    {
        "source_sentence": "諸音樂樹奏天音樂，種種樂器懸布樹枝，所謂：箏、笛、箜篌、琵琶、簫、瑟如是等樂，",
        "translation": "The trees played celestial music, and various instruments of music hung over the branches of the trees, such as lutes, flutes, gongras, lutes, pipes, bells, chimes, and so forth.",
        "source": "T10n0293_015:0728c25_26"
    },
    {
        "source_sentence": "不鼓自鳴，聞皆可意，離諸染著；",
        "translation": "They do not beat their drums or make their announcements, and whatever they hear is agreeable. They are free of all defiled attachments.",
        "source": "T10n0293_015:0728c27_27"
    },
    {
        "source_sentence": "寶多羅樹覆寶鈴網，微風吹動，出微妙音，如自在天善口天女；",
        "translation": "The jeweled palm trees covered a network of jeweled bells, and the gentle breeze produced subtle sounds like those of the celestial maidens of the good-mouthed goddesses of the independent heaven.",
        "source": "T10n0293_015:0728c28_28"
    },
    {
        "source_sentence": "諸如意樹，出眾寶衣，如天劫波服，垂布嚴飾，有無量色，猶如大海；",
        "translation": "The wish-granting trees produced robes of various precious treasures, like celestial garlands draped with draped cloth and adorned with an infinite variety of colors, like the ocean.",
        "source": "T10n0293_015:0728c29_29"
    },
    {
        "source_sentence": "百千樓閣眾寶莊嚴，如忉利天帝釋宮殿，寶蓋彌覆，如妙高峯，如梵王宮光明普照。",
        "translation": "A hundred thousand towers were adorned with various treasures, like the palace of Trāyastriṃśa god Indra, covered with jeweled canopies, like a sublime high peak, like the radiance of the Brahma king's palace shining everywhere.",
        "source": "T10n0293_015:0729a02_30"
    },
    {
        "source_sentence": "爾時，善財童子見此園林無量功德種種莊嚴，皆是菩薩不思議業之所成就，",
        "translation": "Then Sudhana saw the infinite arrays of these parks and groves, adorned by the inconceivable virtues of enlightening beings.",
        "source": "T10n0293_015:0729a04_31"
    },
    {
        "source_sentence": "出世善根之所生起，供養一切諸佛功德，廣修淨業無能壞者，一切世間無能與等；",
        "translation": "They are born of transmundane roots of goodness, honoring the virtues of all buddhas and extensively cultivating pure deeds that cannot be broken down by anyone in any world.",
        "source": "T10n0293_015:0729a05_32"
    },
    {
        "source_sentence": "如是皆從師子頻申比丘尼了法如幻，不捨有為，積集廣大善業所成，不與聲聞、辟支佛共，",
        "translation": "They all understand the teaching as illusory from Siṃhala Bimbisāra, who doesn't abandon conditioned things, accumulates extensive good actions that are formed by accumulating them, and doesn't share them with śrāvakas or pratyekbuddhas.",
        "source": "T10n0293_015:0729a07_33"
    },
    {
        "source_sentence": "異道邪論不能傾動，一切魔軍無能與敵，凡夫淺智不能思惟。",
        "translation": "A heretic's mistaken theory can't be tilted, and all the armies of Māra can't oppose it, which ordinary people with shallow wisdom can't contemplate.",
        "source": "T10n0293_015:0729a09_34"
    },
    {
        "source_sentence": "三千大千世界天龍八部無量眾生，隨自善根，如應度者，皆入此園而不迫窄。",
        "translation": "The 3,000 great one-thousand worlds, gods, dragons, and the eight groups of immeasurable sentient beings, follow their own good roots as they should be liberated, and all enter this park without crowding it.",
        "source": "T10n0293_015:0729a11_35"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0293_015:0729a12_36"
    },
    {
        "source_sentence": "此比丘尼不可思議威神力故。",
        "translation": "This bhikṣuṇī is inconceivable because of her supernatural powers.",
        "source": "T10n0293_015:0729a13_37"
    },
    {
        "source_sentence": "爾時，善財見比丘尼遍坐一切諸寶樹下大師子座，身相端嚴，威儀寂靜，",
        "translation": "At that time Sudhana saw the bhikṣuṇī Supratishthita sitting cross-legged on a lion seat arranged at the foot of all kinds of jeweled trees. Her body was beautiful, her hair stood on end like a lotus blossom, and she looked as if she had attained buddhahood.",
        "source": "T10n0293_015:0729a14_0"
    },
    {
        "source_sentence": "住法平等，動止安詳；",
        "translation": "They abide in the equality of all things, and their movements are peaceful.",
        "source": "T10n0293_015:0729a15_1"
    },
    {
        "source_sentence": "諸根調順，如大象王；",
        "translation": "Their faculties are disciplined like a great elephant king.",
        "source": "T10n0293_015:0729a16_2"
    },
    {
        "source_sentence": "心無垢濁，如清淨池；",
        "translation": "The mind is pure and unstained, like a pure pond.",
        "source": "T10n0293_015:0729a16_3"
    },
    {
        "source_sentence": "普濟所求，如如意寶；",
        "translation": "Whatever they sought was like wish-granting treasure.",
        "source": "T10n0293_015:0729a17_4"
    },
    {
        "source_sentence": "不染世法，猶如蓮華；",
        "translation": "They are not tainted with worldly dharmas, like lotus blossoms.",
        "source": "T10n0293_015:0729a17_5"
    },
    {
        "source_sentence": "心無所畏，如師子王；",
        "translation": "Their minds have no fear like a lion king.",
        "source": "T10n0293_015:0729a18_6"
    },
    {
        "source_sentence": "護持淨戒不可傾動，如須彌山；",
        "translation": "He observed pure precepts and remained steadfast, like the polar mountain.",
        "source": "T10n0293_015:0729a18_7"
    },
    {
        "source_sentence": "能令見者心得清涼，如妙香山；",
        "translation": "They can cause those who see them to become as clear and cool as a mountain of exquisite fragrance.",
        "source": "T10n0293_015:0729a19_8"
    },
    {
        "source_sentence": "能除眾生諸煩惱熱，如雪山中妙栴檀香；",
        "translation": "They can remove the heat of sentient beings’ afflictions, like the fragrance of sandalwood in the Himalayan Mountains.",
        "source": "T10n0293_015:0729a20_0"
    },
    {
        "source_sentence": "眾生見者諸苦銷滅，如妙見藥王；",
        "translation": "Sentient beings who see it will all their suffering be extinguished, like the medicine king Wonderful Vision.",
        "source": "T10n0293_015:0729a20_1"
    },
    {
        "source_sentence": "能令見者所願不空，如婆樓那天；",
        "translation": "They can cause the wishes of those who see to be nonempty, as if they were on a celestial palace.",
        "source": "T10n0293_015:0729a21_2"
    },
    {
        "source_sentence": "永離欲染，如大梵王；",
        "translation": "They are forever freed from the defilement of desire, like great Brahma kings.",
        "source": "T10n0293_015:0729a22_3"
    },
    {
        "source_sentence": "淨眾生心，如水清寶；",
        "translation": "They purify the minds of sentient beings like water and pure jewels.",
        "source": "T10n0293_015:0729a22_4"
    },
    {
        "source_sentence": "能長眾善，如良沃田；",
        "translation": "They are able to develop all goodness, like fertile fields.",
        "source": "T10n0293_015:0729a23_5"
    },
    {
        "source_sentence": "三業自在，猶如如來；",
        "translation": "The three activities are free, just like the Tathāgata’s.",
        "source": "T10n0293_015:0729a23_6"
    },
    {
        "source_sentence": "在一一座眾會不同，所說法門亦各差別。",
        "translation": "Each of the assemblies in one hall is different, and the teachings they teach are also different.",
        "source": "T10n0293_015:0729a24_7"
    },
    {
        "source_sentence": "或見處座淨居天眾所共圍遶，摩醯首羅天王而為上首，此比丘尼為說法門，",
        "translation": "Or they may see that their seat is surrounded by a host of celestial beings from the Pure Land, led by King Mahesvara. This bhikṣuṇī teaches the Dharma to them:",
        "source": "T10n0293_015:0729a25_8"
    },
    {
        "source_sentence": "名無盡法相解脫；",
        "translation": "It is called the liberation of inexhaustible dharmas and characteristics.",
        "source": "T10n0293_015:0729a27_9"
    },
    {
        "source_sentence": "或見處座諸梵天眾所共圍遶，妙光明梵王而為上首，此比丘尼為說法門，",
        "translation": "“Furthermore, some of the bhikṣus and nuns may see that their seats are surrounded by hosts of Brahmā gods, led by Brahma King Sadāparibhūta.",
        "source": "T10n0293_015:0729a27_10"
    },
    {
        "source_sentence": "名普門差別清淨言音輪；",
        "translation": "They are called the universal sphere of pure speech and sound distinguished by various aspects.",
        "source": "T10n0293_015:0729a29_11"
    },
    {
        "source_sentence": "或見處座他化自在天，天子天女所共圍遶，自在轉天王而為上首，此比丘尼為說法門，",
        "translation": "“Furthermore, some of the bhikṣus and nuns may see other apparitional celestial beings in their respective seats, surrounded by heavenly gods and goddesses, led by a heavenly ruler who is free to teach the Dharma for them.",
        "source": "T10n0293_015:0729b01_0"
    },
    {
        "source_sentence": "名菩薩清淨心自在莊嚴；",
        "translation": "They are called the enlightening beings’ pure adornments of unimpeded mind.",
        "source": "T10n0293_015:0729b03_0"
    },
    {
        "source_sentence": "或見處座妙變化天，天子天女所共圍遶，樂變化天王而為上首，此比丘尼為說法門，",
        "translation": "“Furthermore, some of the bhikṣus and nuns were seated in the heaven of marvelous magical emanations, surrounded by celestial beings and goddesses, led by the deity Delighted with Magical Displays. This bhikṣuṇī was teaching the Dharma to them.",
        "source": "T10n0293_015:0729b03_1"
    },
    {
        "source_sentence": "名妙法清淨莊嚴門；",
        "translation": "It was called the gate of the pure adornment of the sublime Teaching.",
        "source": "T10n0293_015:0729b05_2"
    },
    {
        "source_sentence": "或見處座兜率陀天，天子天女所共圍遶，兜率天王而為上首，此比丘尼為說法門，",
        "translation": "Or they may see the Tuṣita gods seated on their seats, surrounded by celestial beings and goddesses, with the king of the Tuṣita gods at the head. These bhikṣuṇīs teach the Dharma to them.",
        "source": "T10n0293_015:0729b06_3"
    },
    {
        "source_sentence": "名自心藏旋轉；",
        "translation": "They are called revolving in the store of one’s own mind.",
        "source": "T10n0293_015:0729b07_4"
    },
    {
        "source_sentence": "或見處座須夜摩天，天子天女所共圍遶，須夜摩天王而為上首，此比丘尼為說法門，",
        "translation": "Or they may see the goddess Sudarśana sitting there, surrounded by celestial beings and goddesses, led by King Sudarśana. This bhikṣuṇī is expounding the Dharma for them.",
        "source": "T10n0293_015:0729b08_5"
    },
    {
        "source_sentence": "名普遍莊嚴；",
        "translation": "It is called Universal Adornment.",
        "source": "T10n0293_015:0729b10_6"
    },
    {
        "source_sentence": "或見處座三十三天，天子天女所共圍遶，釋提桓因而為上首，此比丘尼為說法門，",
        "translation": "Or they may see the thirty-three gods seated on their seats, surrounded by celestial beings and goddesses, with Śakra the lord of gods at the head. This bhikṣuṇī teaches the Dharma for them.",
        "source": "T10n0293_015:0729b10_7"
    },
    {
        "source_sentence": "名厭離門；",
        "translation": "It is called the gate of disenchantment.",
        "source": "T10n0293_015:0729b12_8"
    },
    {
        "source_sentence": "或見處座百光明龍王、難陀龍王、優波難陀龍王、摩那斯龍王、伊羅跋陀龍王、阿那婆達多龍王等，",
        "translation": "Or they may see the seated dragon king Hundred Lights, the dragon king Nanda, the dragon king Upananda, the dragon king Manas, the dragon king Airāvarta, the dragon king Anavatapta, and so on.",
        "source": "T10n0293_015:0729b12_9"
    },
    {
        "source_sentence": "龍子龍女所共圍遶，娑伽羅龍王而為上首，此比丘尼為說法門，名佛境界光明莊嚴；",
        "translation": "They were surrounded by dragons, sons of dragons, and daughters of dragons. The chief among them was the nāga king Sāgara. This bhikṣuṇī expounded the Dharma for them, called Array of Light Beams of the Buddha’s Realm.",
        "source": "T10n0293_015:0729b15_0"
    },
    {
        "source_sentence": "或見處座諸夜叉眾，童男童女所共圍遶，毘沙門天王而為上首，此比丘尼為說法門，",
        "translation": "Or they may see the throne-holding yakṣas, surrounded by boys and girls, led by heavenly king Vaiśravaṇa. These bhikṣuṇīs teach the Dharma to them.",
        "source": "T10n0293_015:0729b17_0"
    },
    {
        "source_sentence": "名救護眾生藏；",
        "translation": "It is called the treasury of salvation for sentient beings.",
        "source": "T10n0293_015:0729b19_0"
    },
    {
        "source_sentence": "或見處座乾闥婆眾，男女眷屬所共圍遶，持國乾闥婆王而為上首，此比丘尼為說法門，",
        "translation": "Or they may see a host of gandharvas seated there, surrounded by male and female members of their retinues, led by the king of gandharvas who holds sovereignty over the country. This bhikṣuṇī teaches the Dharma to them.",
        "source": "T10n0293_015:0729b19_1"
    },
    {
        "source_sentence": "名雨無盡大歡喜法雨；",
        "translation": "It is called the inexhaustible rain of great joy, the rain of truth.",
        "source": "T10n0293_015:0729b21_2"
    },
    {
        "source_sentence": "或見處座阿脩羅眾，男女眷屬所共圍遶，羅睺阿脩羅王而為上首，此比丘尼為說法門，",
        "translation": "Or they may see the assembly of seated titans surrounded by male and female attendants, led by King Rāhu as their leader. This bhikṣuṇī teaches the Dharma to them.",
        "source": "T10n0293_015:0729b22_0"
    },
    {
        "source_sentence": "名速疾莊嚴法界智門；",
        "translation": "It was called the gate of knowledge quickly adorning the cosmos of reality.",
        "source": "T10n0293_015:0729b24_1"
    },
    {
        "source_sentence": "或見處座迦樓羅眾，男女眷屬所共圍遶，大力勇持迦樓羅王而為上首，",
        "translation": "Or they may see a multitude of garuḍas seated on the throne, surrounded by male and female attendants, led by King Mahāprajāpatī Gautamī, holding the great garuḍa king.",
        "source": "T10n0293_015:0729b24_2"
    },
    {
        "source_sentence": "此比丘尼為說法門，名怖動諸有海；",
        "translation": "This bhikṣuṇī expounded the doctrine for her. The name of this bhikṣuṇī is called ‘sea of fear that disturbs all beings’.",
        "source": "T10n0293_015:0729b26_3"
    },
    {
        "source_sentence": "或見處座緊那羅眾，男女眷屬所共圍遶，大樹緊那羅王而為上首；",
        "translation": "Or they may see the whole assembly of kinnaras seated there, surrounded by male and female attendants, led by King Mahākauṣṭhila Kinnara.",
        "source": "T10n0293_015:0729b27_4"
    },
    {
        "source_sentence": "此比丘尼為說法門，名佛行光明門；",
        "translation": "This bhikṣuṇī expounded the doctrine for her. The name of this doctrine is called the light of buddha-practice.",
        "source": "T10n0293_015:0729b28_5"
    },
    {
        "source_sentence": "或見處座摩睺羅伽眾，男女眷屬所共圍遶，菴羅林忿怒摩睺羅伽王而為上首，",
        "translation": "Or he might see a multitude of mahoragas seated on their seats, surrounded by male and female retinues, led by the mahoraga kings of the hell-forest wrathful ones.",
        "source": "T10n0293_015:0729b29_6"
    },
    {
        "source_sentence": "此比丘尼為說法門，名出生見佛歡喜心；",
        "translation": "This bhikṣuṇī expounded the doctrine for her. The name of this bhikṣuṇī is Producing a Joyful Mind born from Seeing Buddha.",
        "source": "T10n0293_015:0729c02_7"
    },
    {
        "source_sentence": "或見處座無數百千男子、女人、童男、童女所共圍遶，此比丘尼為說法門，",
        "translation": "Or they may see hundreds of thousands of men, women, boys, and girls surrounding their seats. These bhikṣus and nuns teach the Dharma to them.",
        "source": "T10n0293_015:0729c03_8"
    },
    {
        "source_sentence": "名殊勝行；",
        "translation": "They are called superior practices.",
        "source": "T10n0293_015:0729c05_9"
    },
    {
        "source_sentence": "或見處座諸羅剎眾，男女眷屬所共圍遶，常吸精氣大樹羅剎王而為上首，",
        "translation": "Or he might see the rāṣasasas, seated on their seats, surrounded by male and female retinues, always sucking energy from the great tree of energy, led by the kings of the rāṣas.",
        "source": "T10n0293_015:0729c05_10"
    },
    {
        "source_sentence": "此比丘尼為說法門，名發生慈悲心；",
        "translation": "This bhikṣuṇī who teaches the Dharma to them is called one who develops a compassionate mind.",
        "source": "T10n0293_015:0729c07_0"
    },
    {
        "source_sentence": "或見處座信樂聲聞乘眾生所共圍遶，此比丘尼為說法門，名勝智威力大光明；",
        "translation": "“Furthermore, if a bhikṣuṇī is seated and surrounded by sentient beings who believe in the vehicle of the śrāvakas, she teaches the Dharma to them. The name of that bhikṣuṇī is Great Light of Supreme Knowledge.",
        "source": "T10n0293_015:0729c07_1"
    },
    {
        "source_sentence": "或見處座信樂獨覺乘眾生所共圍遶，此比丘尼為說法門，名佛功德廣大光明；",
        "translation": "“Furthermore, if a bhikṣuṇī is seated and surrounded by sentient beings who believe in the self-enlightened vehicle of individual illumination, this bhikṣuṇī teaches the Dharma to them.",
        "source": "T10n0293_015:0729c09_2"
    },
    {
        "source_sentence": "或見處座信樂大乘眾生所共圍遶，此比丘尼為說法門，名普門三昧智光明；",
        "translation": "“Furthermore, if a bhikṣuṇī is seated and surrounded by sentient beings who believe in the Great Vehicle of universal enlightenment, that bhikṣuṇī teaches the Dharma for them. The name given to her is Light of Knowledge of Universal Concentration Samādhi.",
        "source": "T10n0293_015:0729c11_3"
    },
    {
        "source_sentence": "或見處座初地菩薩所共圍遶，此比丘尼為說法門，名一切諸佛大願聚三昧；",
        "translation": "Or they may see the throne seated in the first stage surrounded by enlightening beings, who teach the Dharma to them. This practice is called ‘samādhi of the great vows of all buddhas’.",
        "source": "T10n0293_015:0729c13_4"
    },
    {
        "source_sentence": "或見處座二地菩薩所共圍遶，此比丘尼為說法門，名無垢輪三昧；",
        "translation": "Or they may see that the seat is surrounded by two-legged enlightening beings. The bhikṣuṇīs and nuns expound the doctrine for them, which is called “unstained wheel concentration”.",
        "source": "T10n0293_015:0729c15_5"
    },
    {
        "source_sentence": "或見處座三地菩薩所共圍遶，此比丘尼為說法門，名大寂靜莊嚴三昧；",
        "translation": "Or they may see that the seat is surrounded by enlightening beings of the three stages. The bhikṣuṇīs and nuns there expound the Teaching for them, called mahiiparinirmitavaśavartinsamādhi.",
        "source": "T10n0293_015:0729c16_6"
    },
    {
        "source_sentence": "或見處座四地菩薩所共圍遶，此比丘尼為說法門，名速疾出生一切智境界三昧；",
        "translation": "Or they may see that the seat is surrounded by enlightening beings of the fourth stage, who teach the Dharma to those nuns and bhikṣus. This is called the absorption on the production of omniscience.",
        "source": "T10n0293_015:0729c18_7"
    },
    {
        "source_sentence": "或見處座五地菩薩所共圍遶，此比丘尼為說法門，名妙華藏三昧；",
        "translation": "“Furthermore, if a bhikṣuṇī is seated and surrounded by enlightening beings of the fifth stage, that bhikṣuṇī will be able to expound the doctrine for him or her. The concentration called ‘samādhi of the flowery lotus-treasury’:",
        "source": "T10n0293_015:0729c20_8"
    },
    {
        "source_sentence": "或見處座六地菩薩所共圍遶，此比丘尼為說法門，名毘盧遮那藏三昧；",
        "translation": "Or they may see that the seat is surrounded by enlightening beings of the sixth stage. The bhikṣuṇīs and nuns expound the doctrine for them, which is called the prātimokṣatriyasamādhi (known as Vairocana-samādhi).",
        "source": "T10n0293_015:0729c22_9"
    },
    {
        "source_sentence": "或見處座七地菩薩所共圍遶，此比丘尼為說法門，名普遍莊嚴地三昧；",
        "translation": "Or they may see that their seats are surrounded by enlightening beings of the seventh stage, who teach the Dharma to them. The name of this concentration is Adorned with All-Pervading Space Samādhi.",
        "source": "T10n0293_015:0729c23_10"
    },
    {
        "source_sentence": "或見處座八地菩薩所共圍遶，此比丘尼為說法門，名普遍法界境界化現身三昧；",
        "translation": "Or they may see that their seats are surrounded by enlightening beings of the eighth stage, where these nuns and bhikṣuṇīs expound the Teaching for them. The name of this concentration pervading everywhere in the cosmos is apparitional manifestation body.",
        "source": "T10n0293_015:0729c25_11"
    },
    {
        "source_sentence": "或見處座九地菩薩所共圍遶，此比丘尼為說法門，名無所得力智莊嚴三昧；",
        "translation": "Or they may see that their seats are surrounded by enlightening beings of the ninth stage, who teach the Dharma to them. This is called ‘samādhi of ungraspable power and knowledge adorning themselves’.",
        "source": "T10n0293_015:0729c27_12"
    },
    {
        "source_sentence": "或見處座十地菩薩所共圍遶，此比丘尼為說法門，名無障礙輪三昧；",
        "translation": "Or they may see that their seats are surrounded by enlightening beings of the ten stages, and these bhikṣus and nuns expound the Teaching for them. This is called unobstructed wheel samādhi.",
        "source": "T10n0293_015:0729c29_13"
    },
    {
        "source_sentence": "或見處座執金剛菩薩所共圍遶，此比丘尼為說法門，名金剛智那羅延莊嚴三昧。",
        "translation": "Or they may see that the seat is surrounded by Vajrapāṇi Bodhisattva, who holds the vajra seat and is accompanied by this bhikṣuṇī, who teaches the Dharma for them, which is called the Vajrasaṃjñārayana-samādhi.",
        "source": "T10n0293_015:0730a01_14"
    },
    {
        "source_sentence": "爾時，善財童子見如是等一切大眾，種種出生、種種住處、種種身相、種種眷屬，",
        "translation": "“At that time, Sudhana saw the multitude of such beings born in various ways, with various bodies, different forms, according to their capacities and characteristics.",
        "source": "T10n0293_015:0730a04_0"
    },
    {
        "source_sentence": "已成熟者、已調伏者，堪為法器，皆入此園，各於樹下圍遶而坐，師子頻申比丘尼如其所應，",
        "translation": "Those who had matured and disciplined themselves were able to become vessels of the Dharma. They all entered this park, each surrounded by a tree, and sat there. The bhikṣuṇīs and nuns Sīha Bimbisāra did as they should.",
        "source": "T10n0293_015:0730a05_1"
    },
    {
        "source_sentence": "種種心性、種種欲樂、種種信解，隨彼所宜勝劣差別，而為演說相應法門，",
        "translation": "“Great enlightening beings develop various mental states, various inclinations, and various faiths; according to the differences of superiority and inferiority of those faculties, they expound teachings conjoined with them.",
        "source": "T10n0293_015:0730a07_2"
    },
    {
        "source_sentence": "令於阿耨多羅三藐三菩提得不退轉。",
        "translation": "He causes them to attain unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T10n0293_015:0730a09_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0293_015:0730a10_4"
    },
    {
        "source_sentence": "此比丘尼得普眼捨得般若波羅蜜門、演說一切佛法般若波羅蜜門、法界差別際般若波羅蜜門、散壞一切障礙輪般若波羅蜜門、生長一切眾生善心般若波羅蜜門、最勝莊嚴般若波羅蜜門、無礙真實藏般若波羅蜜門、法界圓滿般若波羅蜜門、清淨心藏般若波羅蜜門、普遍出生種種語言神通藏般若波羅蜜門；",
        "translation": "These bhikṣus and nuns attain the perfection of wisdom through the acquisition of universal eye equanimity, the perfection of wisdom through expounding all Buddha teachings, the perfection of wisdom through the differentiation of the realm of reality, the perfection of wisdom through disintegrating all obstructive wheels of wisdom, the perfection of wisdom through developing the good minds of all sentient beings",
        "source": "T10n0293_015:0730a10_5"
    },
    {
        "source_sentence": "此十般若波羅蜜門而為上首，入如是等無數百萬阿僧祇般若波羅蜜門。",
        "translation": "These ten prajñāpāramitā-gates are the first, and they enter these incalculable millions of such prajñāpāramitā-gates.",
        "source": "T10n0293_015:0730a17_6"
    },
    {
        "source_sentence": "此日光園中一切菩薩及諸眾生所見境界，所聞妙法，各各差別，悟解不同，",
        "translation": "In this park of sunlight all the enlightening beings and sentient beings see and hear the wondrous Teaching, each different from the other, with different understandings.",
        "source": "T10n0293_015:0730a19_7"
    },
    {
        "source_sentence": "皆是師子頻申比丘尼初勸發心說法教化，令於阿耨多羅三藐三菩提得不退轉。",
        "translation": "They are all the first exhortation of the lion's bhikṣuṇīs to arouse their minds and teach, so that they attain unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T10n0293_015:0730a21_8"
    },
    {
        "source_sentence": "時，善財童子見師子頻申比丘尼如是園林、如是床座、如是經行、如是眾會、如是威儀、如是自在、如是普身、如是無畏、如是神力、如是辯才、如是莊嚴，",
        "translation": "Then Sudhana saw that the nun Sinhavijurmbhita had such a garden, such a couch, such a seat, such a discourse, such an assembly, such manner, such freedom, such a body, such fearlessness, such mystic powers, such eloquence, such adornment.",
        "source": "T10n0293_015:0730a23_9"
    },
    {
        "source_sentence": "復聞如是不可思議廣大法門，身心柔軟，五體投地，恭敬頂禮，合掌念言：「我當右遶此比丘尼經於無數百千萬匝。」",
        "translation": "Again, he heard such an inconceivably vast teaching of the Dharma that his body and mind were supple, prostrated with five bodies on the ground, paid homage, joined his palms, and thought, I will circumambulate this monk and nun to their right for countless hundreds of millions of times.",
        "source": "T10n0293_015:0730a26_10"
    },
    {
        "source_sentence": "作是念時，此比丘尼即放光明，遍照其園，普及眾會，善財童子即自見身遍一切處，",
        "translation": "When he thought thus, the bhikṣuṇī Sudarśana saw a ray of light emanating from that buddha’s body reaching everywhere in the forest.",
        "source": "T10n0293_015:0730a29_11"
    },
    {
        "source_sentence": "一一座上比丘尼所，皆悉右遶百千萬匝，圍遶畢已，合掌而立，白言：「聖者！",
        "translation": "Each of the monks and nuns in the assembly circumambulated them one hundred million times to their right. Having circumambulated them, they stood with joined palms and said:",
        "source": "T10n0293_015:0730b02_12"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行、云何修菩薩道，",
        "translation": "I have set my mind on unexcelled complete perfect enlightenment, but I do not know how an enlightening being is to learn and carry out the practice of enlightening beings.",
        "source": "T10n0293_015:0730b04_13"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說。」",
        "translation": "I've heard that the noble one is good at encouraging, so please tell me about it.",
        "source": "T10n0293_015:0730b05_14"
    },
    {
        "source_sentence": "比丘尼言：「善男子！",
        "translation": "The monks and nuns said, Good man!",
        "source": "T10n0293_015:0730b06_15"
    },
    {
        "source_sentence": "我得菩薩解脫，名滅除一切微細分別門。」",
        "translation": "I attain the bodhisattva's liberation, which is called the gate of extinguishing all subtle discriminations.",
        "source": "T10n0293_015:0730b07_16"
    },
    {
        "source_sentence": "善財白言：「聖者！",
        "translation": "Shanzai said, Sage!",
        "source": "T10n0293_015:0730b09_0"
    },
    {
        "source_sentence": "何故名為滅除一切微細分別？」",
        "translation": "Why is it called the cessation of all subtle distinctions?",
        "source": "T10n0293_015:0730b09_1"
    },
    {
        "source_sentence": "比丘尼言：「善男子！",
        "translation": "The monks and nuns said, Good man!",
        "source": "T10n0293_015:0730b10_2"
    },
    {
        "source_sentence": "此解脫門於一念中普照三世一切諸法，顯示本性智慧光明。」",
        "translation": "This liberation gate of liberation universally illuminates all the dharmas of the three times in a single thought, revealing the light of original wisdom and wisdom.",
        "source": "T10n0293_015:0730b10_3"
    },
    {
        "source_sentence": "善財白言：「聖者！",
        "translation": "Shanzai said, Sage!",
        "source": "T10n0293_015:0730b12_0"
    },
    {
        "source_sentence": "此智光明境界云何？」",
        "translation": "What's the sphere of this light of wisdom?",
        "source": "T10n0293_015:0730b12_1"
    },
    {
        "source_sentence": "比丘尼言：「善男子！",
        "translation": "The monks and nuns said, Good man!",
        "source": "T10n0293_015:0730b12_2"
    },
    {
        "source_sentence": "我入此智光明門時，得自在出生一切法三昧王，以得如是三昧王故，現意生身，",
        "translation": "When I entered this door of the light of knowledge, I attained the state of concentration producing all teachings freely. Because I had attained such a state of concentration, I manifested mind-made body.",
        "source": "T10n0293_015:0730b13_3"
    },
    {
        "source_sentence": "普遍十方一切世界兜率天宮一生所繫諸菩薩所；",
        "translation": "They pervade all worlds in the ten directions and are bound to the abode of enlightening beings forever in the celestial palace of Tuṣita Heaven in all worlds.",
        "source": "T10n0293_015:0730b15_4"
    },
    {
        "source_sentence": "於一一菩薩前，現不可說佛剎極微數身；",
        "translation": "In front of each enlightening being he manifested as many bodies as atoms in untold buddha-lands.",
        "source": "T10n0293_015:0730b16_5"
    },
    {
        "source_sentence": "於一一身，作不可說佛剎極微數最勝供養。",
        "translation": "In one body, they make the most excellent offerings of ineffable buddha-lands that are extremely subtle.",
        "source": "T10n0293_015:0730b17_6"
    },
    {
        "source_sentence": "所謂：或現天王身、龍王身、夜叉王身，乃至人王身，各各執持種種華雲、種種鬘雲、燒香、塗香及以末香，",
        "translation": "They may show the forms of celestial kings, nāga kings, yakṣa kings, or human kings, each holding clouds of various flowers, clouds of various garlands, burning incense, ointments, and powdered incense.",
        "source": "T10n0293_015:0730b18_7"
    },
    {
        "source_sentence": "衣服、瓔珞、幢幡、繒蓋、寶網、寶帳、寶藏、寶燈，乃至一切莊嚴具雲，",
        "translation": "They were adorned with clouds of clothing, jewelry, banners, pennants, canopies, jewel nets, jewel curtains, storehouses, jewel lamps, and all kinds of ornaments.",
        "source": "T10n0293_015:0730b20_8"
    },
    {
        "source_sentence": "我皆執持而以供養，如於住兜率宮一生所繫菩薩所，親近承事，種種供養，",
        "translation": "I hold them all and offer them as offerings, like an enlightening being bound to the world for one lifetime in the palace of a buddha-land who lives in the abode of satisfaction.",
        "source": "T10n0293_015:0730b22_0"
    },
    {
        "source_sentence": "如是降神入胎，住胎出胎，在家出家，往詣道場，成等正覺，轉正法輪，",
        "translation": "Thus, they descended into the womb, stayed in the womb, left the womb, renounced domestic life, went to the terrace of enlightenment, attained perfect enlightenment, and turned the wheel of the true Dharma.",
        "source": "T10n0293_015:0730b23_1"
    },
    {
        "source_sentence": "入於涅槃；",
        "translation": "They enter nirvana.",
        "source": "T10n0293_015:0730b25_2"
    },
    {
        "source_sentence": "如是中間，或住天宮，或住龍宮，乃至或住人、非人宮，於彼一切諸如來所，",
        "translation": "In the middle of all these, some live in celestial palaces, some in the palaces of dragons, some in human palaces, some in nonhuman palaces.",
        "source": "T10n0293_015:0730b25_3"
    },
    {
        "source_sentence": "我皆如是而為供養；",
        "translation": "I make offerings in this way.",
        "source": "T10n0293_015:0730b27_4"
    },
    {
        "source_sentence": "若有眾生知我如是見聞、親近、供養佛者，一切皆於阿耨多羅三藐三菩提得不退轉，",
        "translation": "If there are any sentient beings who know that I see, hear, associate with, and make offerings to buddhas in this way, all will attain unregressing enlightenment.",
        "source": "T10n0293_015:0730b27_5"
    },
    {
        "source_sentence": "若有眾生來詣我所，我皆誘誨為其宣說般若波羅蜜門。",
        "translation": "If there are sentient beings who come to me, I'll guide them and explain the prajñāpāramitā teaching for them.",
        "source": "T10n0293_015:0730b29_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0730c02_7"
    },
    {
        "source_sentence": "我見一切眾生，不分別眾生相，智眼明見故；",
        "translation": "I see all sentient beings without discriminating characteristics of sentient beings, because the eye of knowledge clearly sees.",
        "source": "T10n0293_015:0730c02_8"
    },
    {
        "source_sentence": "聽一切語言，不分別語言相，心無所著故；",
        "translation": "They hear all words without discriminating the characteristics of words, because their minds are not attached to anything.",
        "source": "T10n0293_015:0730c03_9"
    },
    {
        "source_sentence": "見一切如來，不分別如來相，智了法身故；",
        "translation": "They see all buddhas without discriminating the characteristics of buddhas, because their knowledge comprehends the body of reality.",
        "source": "T10n0293_015:0730c04_10"
    },
    {
        "source_sentence": "住持一切如來法輪，不分別法輪相，悟法自性故；",
        "translation": "They abide in holding the wheel of teaching of all buddhas, not discriminating the characteristics of the wheel of teaching, because they awaken to the essential essence of truth.",
        "source": "T10n0293_015:0730c05_11"
    },
    {
        "source_sentence": "一念遍知一切法，不分別諸法相，知法如幻故。",
        "translation": "In a single thought, he pervades all dharmas and doesn't discriminate the characteristics of dharmas, knowing that dharmas are illusory.",
        "source": "T10n0293_015:0730c06_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0730c07_13"
    },
    {
        "source_sentence": "我唯知此滅除一切微細分別，成就一切智菩薩解脫門；",
        "translation": "“Great enlightening beings say, ‘I know this liberation of the practice of universal knowledge by eliminating all subtle distinctions.",
        "source": "T10n0293_015:0730c07_14"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩心無分別，普知諸法，一身端坐充滿法界，於自身中示現攝持一切佛剎，",
        "translation": "“Just as the minds of great enlightening beings are nondiscriminating, they know all things; sitting with their bodies filling the cosmos, they manifest within themselves the embracing of all buddha-lands.",
        "source": "T10n0293_015:0730c08_15"
    },
    {
        "source_sentence": "悉能往詣一切佛所，於自身內普現一切諸佛神力，一毛遍舉不可說不可說諸佛世界，",
        "translation": "They can go to all buddhas, manifesting the spiritual powers of all buddhas within themselves; one hair extends throughout untold numbers of buddha-lands.",
        "source": "T10n0293_015:0730c11_0"
    },
    {
        "source_sentence": "於其自身一毛孔中現不可說不可說世界成壞，於一念中與不可說不可說眾生同住，",
        "translation": "In a single pore of his own body untold buddha-fields appear, and in a single thought he dwells with untold numbers of sentient beings.",
        "source": "T10n0293_015:0730c13_0"
    },
    {
        "source_sentence": "於一念中入不可說不可說一切諸劫，而我云何能知、能說彼功德行？",
        "translation": "In a single thought, I enter into all the ineffable and ineffable eons, but how can I know or tell of their meritorious actions?",
        "source": "T10n0293_015:0730c15_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0730c16_2"
    },
    {
        "source_sentence": "於此南方有一聚落，名為險難，其中有城，名寶莊嚴，彼有女人，名伐蘇蜜多，",
        "translation": "To the south of here is a village called danger. There is a city there called Jewel Adornment, where there is a woman named Vasumitra.",
        "source": "T10n0293_015:0730c16_3"
    },
    {
        "source_sentence": "汝詣彼問菩薩云何學菩薩行、修菩薩道。」",
        "translation": "Go there and ask the bodhisattva how to train in the bodhisattva practice and cultivate the bodhisattva path.",
        "source": "T10n0293_015:0730c18_4"
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "Then Sudhana went up to him, paid his respects, and departed. Thereupon, Bodhisattva Sadāparibhūta bowed his head at the Buddha’s feet and circumambulated him countless times.",
        "source": "T10n0293_015:0730c19_5"
    },
    {
        "source_sentence": "爾時，善財童子大慧光明照啟其心，思惟觀察一切智智，一心隨順諸法實性堅固，",
        "translation": "At that time, the great light of wisdom of Sudhana illumined their minds and they reflected on the excellence of omniscience. They singlemindedly adhered to all truths with unshakable faith in them.",
        "source": "T10n0293_015:0730c22_0"
    },
    {
        "source_sentence": "了知一切眾生言音陀羅尼門，得受持一切如來法輪陀羅尼門，得與一切眾生作所歸依大悲力，",
        "translation": "“Great enlightening beings attain the power of great compassion which is able to give all sentient beings forms of refuge by means of the spell called ‘wheel of teaching’; they attain knowledge of the spell called ‘manifest speech’ of all sentient beings; they attain mastery of the spell called ‘wheel of teaching’ of all buddhas; they attain the",
        "source": "T10n0293_015:0730c23_1"
    },
    {
        "source_sentence": "得觀察一切法義理光明門，得速疾圓滿法界輪，得轉彼清淨大願輪，得普照十方一切法智光明，",
        "translation": "They attain the light of contemplation on the meaning and principle of all teachings; they attain the speedy fulfillment of the sphere of the cosmos of reality; they attain the turning of the sphere of pure great vows; they attain the light of knowledge of all truths illumining the ten directions.",
        "source": "T10n0293_015:0730c26_2"
    },
    {
        "source_sentence": "得遍莊嚴一切世界自在力，得普攝取一切菩薩神通智，得普發起一切菩薩圓滿願。",
        "translation": "They attain the unimpeded power of pervasive adornment of all worlds, attain the miraculous knowledge of universally taking in all enlightening beings, and attain the perfect vows of all enlightening beings everywhere.",
        "source": "T10n0293_015:0730c28_3"
    },
    {
        "source_sentence": "漸漸前行，至險難國寶莊嚴城，處處尋訪伐蘇蜜多女。",
        "translation": "He gradually proceeded on his way to the city of Jewel Adornments in the country of danger and difficulty, where he searched for and conquered Sumitra everywhere.",
        "source": "T10n0293_015:0731a01_4"
    },
    {
        "source_sentence": "城中有人不知此女功德智慧方便善巧所住境界微密甚深，作如是念：「今此童子諸根寂靜，",
        "translation": "Someone in the city who did not know the depth and profundity of the woman’s virtue, wisdom, skillful means, and subtlety of the realm where she lived thought:",
        "source": "T10n0293_015:0731a02_5"
    },
    {
        "source_sentence": "諸根調順，智慧明了，已離放逸，心不迷亂，諦視一尋，無有疲懈，無所取著，",
        "translation": "Their faculties are disciplined, their intellects well endowed with knowledge and insight. They have abandoned heedlessness; their minds are not confused or disturbed. They pay close attention to a single question without weariness or laziness, having no attachment whatsoever.",
        "source": "T10n0293_015:0731a04_6"
    },
    {
        "source_sentence": "目視不瞬，心無所動，甚深寬廣猶如大海，不應於此伐蘇蜜多女有貪愛心、有顛倒心，",
        "translation": "Their eyes did not blink, and their minds were unmoved. They were as deep and wide as the great ocean. You should not have desire for or deluded thoughts of craving toward the maidens who cut down the sugarcane in this place.",
        "source": "T10n0293_015:0731a06_7"
    },
    {
        "source_sentence": "生於淨想，生於欲想，不應為此女色所攝。",
        "translation": "They give rise to perceptions of purity and perceptions of desire, which shouldn't be included in this woman's form.",
        "source": "T10n0293_015:0731a08_8"
    },
    {
        "source_sentence": "此童子者不行魔行，不入魔境，不沒欲泥，不被魔縛，不應作處，已能不作，",
        "translation": "They won’t engage in demonic activity, won’t enter the realm of demons, won’t submerge themselves in the water of desire, won’t be bound by demons, won’t work where they shouldn’t.",
        "source": "T10n0293_015:0731a09_9"
    },
    {
        "source_sentence": "有何等意而求此女？」",
        "translation": "What's the intention to ask for this woman?",
        "source": "T10n0293_015:0731a10_10"
    },
    {
        "source_sentence": "其中有人先知此女有勝功德，具深智慧，告善財言：「善哉！",
        "translation": "Someone among them, knowing that the woman had superior virtue and possessed profound wisdom, told Shanzai, Good!",
        "source": "T10n0293_015:0731a11_11"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T10n0293_015:0731a12_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0731a12_13"
    },
    {
        "source_sentence": "汝今乃能推求尋覓伐蘇蜜多女，汝已獲得廣大善利。",
        "translation": "Now that you've been able to search for and find a woman named Sumita, you've already attained vast good rewards.",
        "source": "T10n0293_015:0731a13_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0731a14_15"
    },
    {
        "source_sentence": "汝應決定求佛妙果，決定欲為一切眾生作所依怙，決定欲拔一切眾生貪愛毒箭，",
        "translation": "You should definitely seek the wondrous fruit of buddhahood, determined to be a refuge for all sentient beings and determined to remove the poisonous arrow of craving from all sentient beings.",
        "source": "T10n0293_015:0731a14_16"
    },
    {
        "source_sentence": "決定欲破一切眾生於女色中所有淨想，決定欲雨一切如來普遍法界大功德雨。",
        "translation": "He's determined to destroy all the pure conceptions of all sentient beings in women's form, and he's determined to rain down a great rain of merit from all the Tathāgatas throughout the Dharma realm.",
        "source": "T10n0293_015:0731a16_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0731a18_18"
    },
    {
        "source_sentence": "伐蘇蜜多女於此城內市鄽之北，自宅中住。」",
        "translation": "Vasumitra's daughter stayed at her house north of the marketplace in this city.",
        "source": "T10n0293_015:0731a18_19"
    },
    {
        "source_sentence": "時，善財童子聞是語已，歡喜踊躍，心願圓滿，一心正念往詣其門。",
        "translation": "Having heard these words, Sudhana was delighted and jumped up and down in joy. Having fulfilled his vow, he went to the door of the monastery.",
        "source": "T10n0293_015:0731a19_20"
    },
    {
        "source_sentence": "見其住宅，廣博嚴麗，寶牆、寶樹及以寶塹，一一皆有十重圍遶；",
        "translation": "He saw that the house was large and spacious, beautifully adorned, surrounded by walls of jewels, jeweled trees, and moats with ten moats.",
        "source": "T10n0293_015:0731a21_21"
    },
    {
        "source_sentence": "其寶塹中香水盈滿，底布金沙，諸天寶華、優鉢羅華、波頭摩華、拘物頭華、芬陀利華遍覆水上，",
        "translation": "The jeweled moats were filled with fragrant water, covered with golden sand on the bottom and covered with heavenly jewel flowers such as blue lotus blossoms, blue lotus blossoms, red lotus blossoms, pink lotus blossoms, white lotus blossoms, and white lotus blossoms.",
        "source": "T10n0293_015:0731a22_22"
    },
    {
        "source_sentence": "異香芬馥，悅暢眾心，妙寶殊珍，莊嚴其岸；",
        "translation": "The shore was adorned with exquisite jewels and precious treasures.",
        "source": "T10n0293_015:0731a24_23"
    },
    {
        "source_sentence": "階陛欄楯，眾寶合成，宮殿樓閣，處處分布，門闥窓牖，相望間列，咸施網鐸，",
        "translation": "The staircases and railings are made of all kinds of precious substances. The palaces and towers are arranged in various places, with doors and windows facing each other one after the other, arrayed in rows, all decorated with nets and chimes.",
        "source": "T10n0293_015:0731a25_24"
    },
    {
        "source_sentence": "悉建幢幡，無量珍奇，以為嚴飾；",
        "translation": "They all erected banners and pennants, adorned with measureless treasures.",
        "source": "T10n0293_015:0731a27_25"
    },
    {
        "source_sentence": "瑠璃為地，眾寶間錯，燒諸沈水，塗以栴檀，懸眾寶鈴，風動成音，散諸天華，",
        "translation": "The earth is of lapis lapis lazuli, interspersed with various precious substances. It burns the sunken water and rubs it on sandalwood. A bell made of various precious substances is suspended in the air to make a sound, scattering heavenly flowers.",
        "source": "T10n0293_015:0731a28_26"
    },
    {
        "source_sentence": "周遍其地；",
        "translation": "They pervaded the land.",
        "source": "T10n0293_015:0731a29_27"
    },
    {
        "source_sentence": "摩尼燈燭，光明普照，諸珍寶藏，其數百千，十大園林，以為莊嚴；",
        "translation": "Jewel lamp candles shone brightly, shining everywhere. Hundreds of thousands of jewel mines were adorned with ten great parks and forests.",
        "source": "T10n0293_015:0731b01_28"
    },
    {
        "source_sentence": "寶樹枝條，騰芳發耀；",
        "translation": "The jeweled trees, with their branches and leaves blooming fragrantly, shine brightly.",
        "source": "T10n0293_015:0731b02_29"
    },
    {
        "source_sentence": "種種殊麗，不可稱說。",
        "translation": "Various kinds of beauty cannot be described in words.",
        "source": "T10n0293_015:0731b03_30"
    },
    {
        "source_sentence": "爾時，善財見此女人顏貌端嚴，色相圓滿，皮膚金色，目髮紺青，不長、不短、不麁、不細，",
        "translation": "“Then Sudhana saw that the woman’s hair stood on end like a circle of hair, and she looked as if her hair had grown into a circle of hair.",
        "source": "T10n0293_015:0731b03_31"
    },
    {
        "source_sentence": "欲界人天無能與比；",
        "translation": "In the realm of desire humans and gods cannot be compared with it.",
        "source": "T10n0293_015:0731b05_32"
    },
    {
        "source_sentence": "音聲美妙超諸梵世，一切眾生差別言音，悉皆具足，無不解了，深達字義，",
        "translation": "Their voices were beautiful and sublime, surpassing all the Brahma worlds. All sentient beings’ distinctive sounds and expressions were fully endowed, and none could not understand them. They profoundly comprehended words and meanings.",
        "source": "T10n0293_015:0731b06_33"
    },
    {
        "source_sentence": "善巧談說；",
        "translation": "They skillfully explain the teachings.",
        "source": "T10n0293_015:0731b07_34"
    },
    {
        "source_sentence": "得如幻智，入方便門；",
        "translation": "Attaining illusion-like knowledge, they entered the door of expedient means.",
        "source": "T10n0293_015:0731b08_35"
    },
    {
        "source_sentence": "眾寶瓔珞莊嚴其身，一切寶網周覆其上，首冠如意摩尼寶冠；",
        "translation": "Their bodies were adorned with jewelry of various jewels, covered with webs of all kinds of jewels, their heads crowned with wish-granting jewel crowns.",
        "source": "T10n0293_015:0731b08_36"
    },
    {
        "source_sentence": "無量眷屬恭敬圍遶，皆共善根，同一行願，福德大藏具足無盡。",
        "translation": "They were surrounded by countless retinues, all respectfully surrounding them, sharing the same good roots and vows of practice, and endowed with an inexhaustible treasury of merit.",
        "source": "T10n0293_015:0731b10_0"
    },
    {
        "source_sentence": "時，彼女人從其身出廣大光明，普照宅中一切堂宇及寶宮殿，遇斯光者身得清涼，",
        "translation": "Then a great ray of light emerged from the woman’s body, illuminating all the halls and jeweled palaces in her house.",
        "source": "T10n0293_015:0731b11_1"
    },
    {
        "source_sentence": "心除惑熱。",
        "translation": "The mind is free of the fever of affliction.",
        "source": "T10n0293_015:0731b13_2"
    },
    {
        "source_sentence": "爾時，善財前詣其所，頂禮其足，合掌而立，白言：「聖者！",
        "translation": "At that point, Sun Cai went to him, bowed his head at his feet, joined his palms, and stood there, saying, Sage!",
        "source": "T10n0293_015:0731b14_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行、云何修菩薩道，",
        "translation": "I have set my mind on unexcelled complete perfect enlightenment, but I do not know how an enlightening being is to learn and carry out the practice of enlightening beings.",
        "source": "T10n0293_015:0731b15_1"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說。」",
        "translation": "I've heard that the noble one is good at encouraging, so please tell me about it.",
        "source": "T10n0293_015:0731b17_0"
    },
    {
        "source_sentence": "彼即告言：「善男子！",
        "translation": "They then told him, Good man!",
        "source": "T10n0293_015:0731b17_1"
    },
    {
        "source_sentence": "我得菩薩解脫，名離貪欲際；",
        "translation": "I attain liberation of enlightening beings called freedom from the realm of desire.",
        "source": "T10n0293_015:0731b18_2"
    },
    {
        "source_sentence": "我能隨順一切眾生諸所樂欲而為現身，若天見我，我為天女，形貌光明，",
        "translation": "I can manifest my body in accord with the pleasures and desires of all sentient beings. If gods see me, they will think that I am a heavenly maiden whose appearance shines brightly.",
        "source": "T10n0293_015:0731b18_3"
    },
    {
        "source_sentence": "殊勝無比；",
        "translation": "Their excellence is peerless.",
        "source": "T10n0293_015:0731b20_4"
    },
    {
        "source_sentence": "如是乃至人、非人等而見我者，我即為現人、非人女，隨其形相，各各殊勝，",
        "translation": "In the same way, when someone sees a self as either a man or not a man, I am that which appears to be a man and not a woman. According to their physical forms, each is different:",
        "source": "T10n0293_015:0731b20_5"
    },
    {
        "source_sentence": "隨其樂欲，皆令得見。",
        "translation": "According to their desires and pleasures, they'll all be allowed to see them.",
        "source": "T10n0293_015:0731b22_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0731b22_7"
    },
    {
        "source_sentence": "若有眾生欲意所纏，來詣我所，而於我身生極愛染，心如昏醉，我為說法，",
        "translation": "If there are any sentient beings who come to me obsessed with craving, yet give rise to strong feelings of attachment and confusion in their minds toward me, I teach them the Dharma.",
        "source": "T10n0293_015:0731b23_0"
    },
    {
        "source_sentence": "彼聞法已則離貪欲，得菩薩無著境界三昧；",
        "translation": "Having heard the Teaching, they become free from craving and attain the concentration of enlightening beings’ unattached state.",
        "source": "T10n0293_015:0731b24_1"
    },
    {
        "source_sentence": "若有眾生暫見於我，則離貪欲，得菩薩歡喜三昧；",
        "translation": "If there are any sentient beings who momentarily see me, they will be freed from craving and attain enlightening beings’ concentration of joy.",
        "source": "T10n0293_015:0731b25_2"
    },
    {
        "source_sentence": "若有眾生暫與我語，則離貪欲，得菩薩無礙妙音聲藏三昧；",
        "translation": "If there are any sentient beings who temporarily give my words, they will be freed from craving and attain the concentration of enlightening beings’ unobstructed store of wondrous sounds.",
        "source": "T10n0293_015:0731b26_3"
    },
    {
        "source_sentence": "若有眾生暫執我手，則離貪欲，得菩薩隨順遍往一切佛剎三昧；",
        "translation": "If there are any sentient beings who momentarily grasp my hand, they will be freed from craving and attain enlightening beings’ concentration of going to all buddha-lands in accord with their inclinations.",
        "source": "T10n0293_015:0731b28_4"
    },
    {
        "source_sentence": "若有眾生暫昇我座，則離貪欲，得菩薩離一切世間光明三昧；",
        "translation": "If there are any sentient beings who momentarily ascend my seat, they will be freed from craving and attain enlightening beings’ concentration of freedom from all worldly light.",
        "source": "T10n0293_015:0731b29_5"
    },
    {
        "source_sentence": "若有眾生暫觀於我，則離貪欲，得菩薩寂靜莊嚴三昧；",
        "translation": "If there are any sentient beings who momentarily contemplate self, they will be freed from craving and attain the enlightening being’s tranquil adornment concentration.",
        "source": "T10n0293_015:0731c02_6"
    },
    {
        "source_sentence": "若有眾生見我頻申，則離貪欲，得菩薩摧伏一切外道三昧；",
        "translation": "If there are any sentient beings who see self frequently expressed, they will be freed from craving and attain enlightening beings’ concentration of overcoming all heretics.",
        "source": "T10n0293_015:0731c03_7"
    },
    {
        "source_sentence": "若有眾生見我目瞬，則離貪欲，得菩薩住佛境界光明三昧；",
        "translation": "If there are any sentient beings who see my eyes twinkling, they will be freed from craving and attain concentration of the light of enlightening beings’ abode in the buddha-realm.",
        "source": "T10n0293_015:0731c04_8"
    },
    {
        "source_sentence": "若有眾生抱持於我，則離貪欲，得菩薩攝一切眾生恒不捨離三昧；",
        "translation": "If there are any sentient beings who embrace self, they will be freed from craving and attain enlightening beings’ concentration of taking care of all sentient beings without ever giving up.",
        "source": "T10n0293_015:0731c06_0"
    },
    {
        "source_sentence": "若有眾生咂我脣吻，則離貪欲，得菩薩增長一切眾生福德藏三昧；",
        "translation": "If there are any sentient beings who offer my lips and kisses, they will be freed from craving and attain the concentration of enlightening beings’ accumulation of all sentient beings’ treasury of virtue.",
        "source": "T10n0293_015:0731c07_1"
    },
    {
        "source_sentence": "如是一切所有眾生，來詣我所親近於我，一切皆得住離貪際，入於菩薩一切智地最勝解脫。」",
        "translation": "All these sentient beings who come to me and become intimate with me will all attain freedom from craving and enter the most excellent liberation of the bodhisattva's stage of omniscience.",
        "source": "T10n0293_015:0731c09_2"
    },
    {
        "source_sentence": "爾時，善財童子白伐蘇蜜多女言：「聖者！",
        "translation": "It was then that the boy of good fortune said to the woman Vasanti, Sage!",
        "source": "T10n0293_015:0731c12_0"
    },
    {
        "source_sentence": "云何此解脫門得名最勝？」",
        "translation": "How can this gate of liberation be called the most superior?",
        "source": "T10n0293_015:0731c12_1"
    },
    {
        "source_sentence": "時，女告言：「善男子！",
        "translation": "The woman then told him, Good man!",
        "source": "T10n0293_015:0731c13_2"
    },
    {
        "source_sentence": "一切菩薩發阿耨多羅三藐三菩提心，由為女人不得速成無上佛道，亦不疾得辟支佛乘、阿羅漢果、五通仙人；",
        "translation": "All enlightening beings give rise to the determination for unexcelled complete perfect enlightenment. Because they are women, they do not quickly attain the supreme path of buddhahood; they do not quickly attain the vehicle of the pratyekabuddhas, the fruit of arhatship, or the sages of the five supernatural powers.",
        "source": "T10n0293_015:0731c14_0"
    },
    {
        "source_sentence": "由女色故，退失神通，為荷負者，天、阿脩羅常興戰伐；",
        "translation": "Because of their female appearance, the gods and titans will lose their supernatural powers.",
        "source": "T10n0293_015:0731c16_1"
    },
    {
        "source_sentence": "十頭羅剎焚燒南海楞伽大城；",
        "translation": "Ten great rāṣasasas burned the great city of Laṅkâvatāra in the South Sea.",
        "source": "T10n0293_015:0731c17_2"
    },
    {
        "source_sentence": "或有諸王喪失國土，乃至兄弟自相殺害，造惡趣因，現世貧窮，甘為奴僕，",
        "translation": "Or there may be kings who have lost their lands, or even brothers and sisters who kill each other, creating the causes of bad destinies.",
        "source": "T10n0293_015:0731c18_3"
    },
    {
        "source_sentence": "不順師長，違背君親，如是一切皆由女人；",
        "translation": "Disobedient to teachers and elders, disobedient to rulers and relatives, all of this is due to women.",
        "source": "T10n0293_015:0731c20_4"
    },
    {
        "source_sentence": "我觀無數百千世界貪欲眾生，生死曠野輪轉無窮，苦業之中女為上首。",
        "translation": "I've observed countless hundreds of thousands of sentient beings in the world who are addicted to desire, transmigrating through birth and death in the wilderness without limit, with a woman as the leader among those who suffer from painful actions.",
        "source": "T10n0293_015:0731c21_5"
    },
    {
        "source_sentence": "是故，菩薩若離女色，即得親近諸善知識，復令眾生因此離欲，皆住最勝解脫法門。」",
        "translation": "Therefore, if a bodhisattva parts with female form, he'll be able to become intimate with good friends and also cause sentient beings to part with their desires and all abide in the most excellent liberation dharma-gate.",
        "source": "T10n0293_015:0731c22_6"
    },
    {
        "source_sentence": "善財童子白言：「聖者！",
        "translation": "The boy of good fortune said, Sage!",
        "source": "T10n0293_015:0731c25_0"
    },
    {
        "source_sentence": "種何善根、修何福業，而得增長如是種種殊勝功德？」",
        "translation": "What good roots are planted and what meritorious actions are cultivated that produce such extraordinary qualities?",
        "source": "T10n0293_015:0731c25_1"
    },
    {
        "source_sentence": "時，女答言：「善男子！",
        "translation": "The woman then replied, Good man!",
        "source": "T10n0293_015:0731c26_2"
    },
    {
        "source_sentence": "我念過去有佛出世，名為高行，如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "I'm mindful that in the past there was a Buddha who appeared in the world named Vaiśravaṇa, the Tathāgata, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of Gods and People, Buddha, Bhagavān.",
        "source": "T10n0293_015:0731c27_3"
    },
    {
        "source_sentence": "時，王都城名曰妙門。",
        "translation": "At the time, the king's capital city was named Marvelous Gate.",
        "source": "T10n0293_015:0731c29_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0732a01_0"
    },
    {
        "source_sentence": "時，彼如來為欲利樂諸眾生故，來入王城，蹈彼門閫；",
        "translation": "At that time the World-honored One, wishing to benefit and gladden all sentient beings, entered the royal city.",
        "source": "T10n0293_015:0732a01_1"
    },
    {
        "source_sentence": "其城一切六種震動，忽然廣博眾寶莊嚴，無量光明遞相映徹，種種寶華散布其地，",
        "translation": "The city shook in six ways and suddenly became vast, adorned with all kinds of jewels. Immeasurable rays of light illumined each other, and various kinds of jewel flowers covered the ground.",
        "source": "T10n0293_015:0732a02_2"
    },
    {
        "source_sentence": "諸天音樂同時俱奏，一切諸天充滿虛空，恭敬禮拜尊重讚歎。",
        "translation": "All the heavenly gods filled the sky with respect, venerated, honored, and praised it.",
        "source": "T10n0293_015:0732a04_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0732a05_4"
    },
    {
        "source_sentence": "我於彼時為長者妻，名曰妙智，見佛神通，心生覺悟，則與其夫疾詣佛所，",
        "translation": "At that time I was the wife of an elderly man named Miaojicchai. Seeing the Buddha’s supernatural powers and my mind enlightened, I went with her husband to see him.",
        "source": "T10n0293_015:0732a05_5"
    },
    {
        "source_sentence": "發廣大心，以一寶錢奉施於佛；",
        "translation": "Aroused with great determination, they presented the one-jeweled coin to the Buddha.",
        "source": "T10n0293_015:0732a07_6"
    },
    {
        "source_sentence": "是時，文殊師利童子為佛侍者，為我說法，令發阿耨多羅三藐三菩提心。",
        "translation": "At the time, young Mañjuśrī was the Buddha's attendant, teaching me the Dharma and causing me to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0293_015:0732a08_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0732a10_0"
    },
    {
        "source_sentence": "我唯知此菩薩離貪欲際解脫法門，如諸菩薩摩訶薩成就無邊巧方便智，",
        "translation": "“I only know this liberation of enlightening beings from the realm of craving, just as all great enlightening beings attain boundless knowledge of skill in means.",
        "source": "T10n0293_015:0732a10_1"
    },
    {
        "source_sentence": "福德廣大猶如虛空，而我云何能知、能說彼功德行？",
        "translation": "Their merits are as vast as space, but how can I know and explain their meritorious actions?",
        "source": "T10n0293_015:0732a11_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_015:0732a13_3"
    },
    {
        "source_sentence": "南方有城，名淨達彼岸；",
        "translation": "To the south is a city called Jīvaka pervading the other shore.",
        "source": "T10n0293_015:0732a13_4"
    },
    {
        "source_sentence": "中有居士，名毘瑟底羅，彼常供養栴檀座佛塔，汝詣彼問菩薩云何學菩薩行、修菩薩道。」",
        "translation": "There's a householder named Vaiśravaṇa in there who always makes offerings to the sandalwood seat Buddha's stūpa, so go there and ask the bodhisattva how he trains in the bodhisattva practice and cultivates the bodhisattva path.",
        "source": "T10n0293_015:0732a13_5"
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "Then Sudhana went up to him, paid his respects, and departed. Thereupon, Bodhisattva Sadāparibhūta bowed his head at the Buddha’s feet and circumambulated him countless times.",
        "source": "T10n0293_015:0732a15_6"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第十五",
        "translation": "Dafangguang fo huayan jing, vol. 15",
        "source": "T10n0293_015:0732a18_0"
    }
]