[
    {
        "source_sentence": "大方廣佛華嚴經卷第七十三",
        "translation": "Dafangguang fo huayan jing, vol. 73",
        "source": "T10n0279_073:0396b09_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_073:0396b11_0"
    },
    {
        "source_sentence": "入法界品第三十九之十四",
        "translation": "Chapter Thirty-nine and No. 14 of the Entry into the Dharma Realm",
        "source": "T10n0279_073:0396b12_0"
    },
    {
        "source_sentence": "爾時，善財童子往大願精進力救護一切眾生夜神所，見彼夜神在大眾中，",
        "translation": "Then Sudhana went to the house of the night goddess Sarvarūpasaṃdarśana, saw her in the midst of the assembly, and remembered that she was there.",
        "source": "T10n0279_073:0396b13_0"
    },
    {
        "source_sentence": "坐普現一切宮殿摩尼王藏師子之座，普現法界國土摩尼寶網彌覆其上，",
        "translation": "He sat on the lion throne of the jewel-treasury king seat displaying all the palaces of all buddha-fields, covered with networks of webs of jewels manifesting everywhere throughout the cosmos.",
        "source": "T10n0279_073:0396b14_1"
    },
    {
        "source_sentence": "現日、月、星宿影像身，現隨眾生心普令得見身，現等一切眾生形相身，",
        "translation": "He manifests the reflected bodies of the sun, moon, and stars. He manifests his reflected bodies to sentient beings according to their mentalities, causing them to be able to see him. He appears equal in form to all sentient beings.",
        "source": "T10n0279_073:0396b16_2"
    },
    {
        "source_sentence": "現無邊廣大色相海身，現普現一切威儀身，現普於十方示現身，現普調一切眾生身，",
        "translation": "He manifested bodies of boundless vast oceans of form and characteristics; he manifested bodies showing all manner of deportment. He manifested bodies appearing everywhere in the ten directions to show, and he manifested bodies adapting to all living beings.",
        "source": "T10n0279_073:0396b18_0"
    },
    {
        "source_sentence": "現廣運速疾神通身，現利益眾生不絕身，現常遊虛空利益身，現一切佛所頂禮身，",
        "translation": "He manifested the body of mystic powers of vast expansion and swiftness, the body of benefiting sentient beings without cease, the body of benefiting all living beings, the body of always traveling in space, the body of venerating all buddhas.",
        "source": "T10n0279_073:0396b19_1"
    },
    {
        "source_sentence": "現修習一切善根身，現受持佛法不忘身，現成滿菩薩大願身，現光明充滿十方身，",
        "translation": "He manifested the body of cultivating all roots of goodness, the body of upholding the Buddha teachings without forgetting them, the body of fulfilling great vows of enlightening beings, the body of light filling the ten directions.",
        "source": "T10n0279_073:0396b21_2"
    },
    {
        "source_sentence": "現法燈普滅世暗身，現了法如幻淨智身，現遠離塵暗法性身，現普智照法明了身，",
        "translation": "He manifested the body of knowledge that perceives things as illusory and pure; he manifested the body of reality-nature body far removed from the darkness of dust; he manifested the body of knowledge illumining all things clearly.",
        "source": "T10n0279_073:0396b23_3"
    },
    {
        "source_sentence": "現究竟無患無熱身，現不可沮壞堅固身，現無所住佛力身，現無分別離染身，",
        "translation": "He manifests a body free from pain and heat, a body unshakably strong, a body of the power of buddha-power wherein there is no abode, a body free from defilement by nonimagination.",
        "source": "T10n0279_073:0396b25_4"
    },
    {
        "source_sentence": "現本清淨法性身。",
        "translation": "The present is the originally pure Dharma-nature body.",
        "source": "T10n0279_073:0396b27_5"
    },
    {
        "source_sentence": "時，善財童子見如是等佛剎微塵數差別身，一心頂禮，舉體投地，良久乃起，",
        "translation": "Then Sudhana, seeing as many different bodies as atoms in buddha-lands like this one, paid his respects to the enlightening being Universally Good and stood up.",
        "source": "T10n0279_073:0396b27_6"
    },
    {
        "source_sentence": "合掌瞻仰，於善知識生十種心。",
        "translation": "They joined their palms and looked up, producing ten kinds of thoughts of respect for the good teacher.",
        "source": "T10n0279_073:0396b29_7"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_073:0396c01_8"
    },
    {
        "source_sentence": "所謂：「於善知識生同己心，令我精勤辦一切智助道法故；",
        "translation": "They think of spiritual benefactors as their own minds, enabling me to diligently undertake the practice of omniscience that aids in the path.",
        "source": "T10n0279_073:0396c01_9"
    },
    {
        "source_sentence": "於善知識生清淨自業果心，親近供養生善根故；",
        "translation": "They develop pure awarenesses of the fruits of their own deeds regarding spiritual benefactors, because they become intimate with them and nourish their roots of goodness.",
        "source": "T10n0279_073:0396c02_10"
    },
    {
        "source_sentence": "於善知識生莊嚴菩薩行心，令我速能莊嚴一切菩薩行故；",
        "translation": "He thought of spiritual benefactors as the adornment of enlightening practice, causing me to quickly be able to adorn all practices of enlightening beings.",
        "source": "T10n0279_073:0396c03_11"
    },
    {
        "source_sentence": "於善知識生成就一切佛法心，誘誨於我令修道故；",
        "translation": "In spiritual benefactors they develop the determination to attain all buddha-teachings, encouraging and guiding them.",
        "source": "T10n0279_073:0396c05_12"
    },
    {
        "source_sentence": "於善知識生能生心，能生於我無上法故；",
        "translation": "They think of spiritual benefactors as producers, because they produce the highest dharmas for themselves.",
        "source": "T10n0279_073:0396c06_13"
    },
    {
        "source_sentence": "於善知識生出離心，令我修行普賢菩薩所有行願而出離故；",
        "translation": "They think of spiritual benefactors as enlightening beings and give rise to minds of emancipation, causing me to be liberated from all the practices and vows of Universally Good enlightening beings.",
        "source": "T10n0279_073:0396c07_14"
    },
    {
        "source_sentence": "於善知識生具一切福智海心，令我積集諸白法故；",
        "translation": "They think of spiritual benefactors as the ocean of all virtues and knowledge, enabling me to accumulate white dharmas.",
        "source": "T10n0279_073:0396c08_15"
    },
    {
        "source_sentence": "於善知識生增長心，令我增長一切智故；",
        "translation": "They think of spiritual benefactors as growth, enabling me to develop omniscience.",
        "source": "T10n0279_073:0396c09_16"
    },
    {
        "source_sentence": "於善知識生具一切善根心，令我志願得圓滿故；",
        "translation": "They give rise to minds endowed with all roots of goodness in the presence of spiritual benefactors, causing my aspirations to be fulfilled.",
        "source": "T10n0279_073:0396c10_17"
    },
    {
        "source_sentence": "於善知識生能成辦大利益心，令我自在安住一切菩薩法故，成一切智道故，",
        "translation": "They think of spiritual benefactors as greatly beneficial, enabling them to freely establish themselves in all the ways of enlightening beings and develop the path of omniscience.",
        "source": "T10n0279_073:0396c12_0"
    },
    {
        "source_sentence": "得一切佛法故。」",
        "translation": "It's because they've attained all the buddha-teachings.",
        "source": "T10n0279_073:0396c13_1"
    },
    {
        "source_sentence": "是為十。",
        "translation": "These are the ten.",
        "source": "T10n0279_073:0396c14_2"
    },
    {
        "source_sentence": "發是心已，得彼夜神與諸菩薩佛剎微塵數同行。",
        "translation": "Having aroused this intention, he attained that night goddess and the other bodhisattvas were accompanied by as many fellow practitioners as there are atoms in a buddha-land.",
        "source": "T10n0279_073:0396c14_3"
    },
    {
        "source_sentence": "所謂：同念，心常憶念十方三世一切佛故；",
        "translation": "They are the same in mindfulness, their minds always remembering all buddhas of past, present, and future.",
        "source": "T10n0279_073:0396c15_4"
    },
    {
        "source_sentence": "同慧，分別決了一切法海差別門故；",
        "translation": "The same wisdom, because it discriminates and discerns the differentiating aspects of all oceans of teachings.",
        "source": "T10n0279_073:0396c16_5"
    },
    {
        "source_sentence": "同趣，能轉一切諸佛如來妙法輪故；",
        "translation": "They share the same destiny, being able to turn the wonderful wheel of teaching of all buddha-tathāgatas.",
        "source": "T10n0279_073:0396c17_6"
    },
    {
        "source_sentence": "同覺，以等空智普入一切三世間故；",
        "translation": "They are the same in enlightenment, because by knowledge of emptiness they enter into all three worlds.",
        "source": "T10n0279_073:0396c18_7"
    },
    {
        "source_sentence": "同根，成就菩薩清淨光明智慧根故；",
        "translation": "They are the same root because they develop the faculty of enlightening beings’ pure light and knowledge.",
        "source": "T10n0279_073:0396c18_8"
    },
    {
        "source_sentence": "同心，善能修習無礙功德，莊嚴一切菩薩道故；",
        "translation": "They are the same mind, able to cultivate unhindered virtue, adorning all paths of enlightening beings.",
        "source": "T10n0279_073:0396c19_9"
    },
    {
        "source_sentence": "同境，普照諸佛所行境故；",
        "translation": "They have the same object, because they universally illumine the sphere of all buddhas’ action.",
        "source": "T10n0279_073:0396c20_10"
    },
    {
        "source_sentence": "同證，得一切智照實相海淨光明故；",
        "translation": "They all attain the same realization, because they attain the pure light of omniscience illumining the ocean of reality.",
        "source": "T10n0279_073:0396c21_11"
    },
    {
        "source_sentence": "同義，能以智慧了一切法真實性故；",
        "translation": "They are the same in meaning because they can, by means of knowledge and wisdom, comprehend the true nature of all things.",
        "source": "T10n0279_073:0396c22_12"
    },
    {
        "source_sentence": "同勇猛，能壞一切障礙山故；",
        "translation": "They are the same in courageousness, being able to break down all the mountains of obstacles.",
        "source": "T10n0279_073:0396c23_13"
    },
    {
        "source_sentence": "同色身，隨眾生心示現身故；",
        "translation": "They are similar in color to the physical body, because they manifest their bodies according to beings’ mentalities.",
        "source": "T10n0279_073:0396c23_14"
    },
    {
        "source_sentence": "同力，求一切智不退轉故；",
        "translation": "They have the same power, because they seek omniscience without regressing.",
        "source": "T10n0279_073:0396c24_15"
    },
    {
        "source_sentence": "同無畏，其心清淨如虛空故；",
        "translation": "They are the same as fearless because their minds are pure like space.",
        "source": "T10n0279_073:0396c25_0"
    },
    {
        "source_sentence": "同精進，於無量劫行菩薩行無懈倦故；",
        "translation": "They are the same in energy, because over countless eons they carry out the practices of enlightening beings without laziness.",
        "source": "T10n0279_073:0396c25_1"
    },
    {
        "source_sentence": "同辯才，得法無礙智光明故；",
        "translation": "They all had the same power of elucidation, because they had attained the light of unhindered knowledge of doctrine.",
        "source": "T10n0279_073:0396c26_2"
    },
    {
        "source_sentence": "同無等，身相清淨超世間故；",
        "translation": "They are the same as none, because their bodily characteristics are pure and transcend worldly.",
        "source": "T10n0279_073:0396c27_3"
    },
    {
        "source_sentence": "同愛語，令一切眾生皆歡喜故；",
        "translation": "They are the same in loving words, because they cause all sentient beings to rejoice.",
        "source": "T10n0279_073:0396c27_4"
    },
    {
        "source_sentence": "同妙音，普演一切法門海故；",
        "translation": "They all spoke the same subtle voice, expounding the ocean of all teachings.",
        "source": "T10n0279_073:0396c28_5"
    },
    {
        "source_sentence": "同滿音，一切眾生隨類解故；",
        "translation": "They are the same in their complete voice, because all sentient beings understand according to type.",
        "source": "T10n0279_073:0396c29_6"
    },
    {
        "source_sentence": "同淨德，修習如來淨功德故；",
        "translation": "They are the same as pure virtue because they cultivate the pure virtues of buddhas.",
        "source": "T10n0279_073:0396c29_7"
    },
    {
        "source_sentence": "同智地，一切佛所受法輪故；",
        "translation": "It is the same as the stage of knowledge, because all buddhas receive the wheel of teaching.",
        "source": "T10n0279_073:0397a01_8"
    },
    {
        "source_sentence": "同梵行，安住一切佛境界故；",
        "translation": "They practice the same celibacy, because they abide in the sphere of all buddhas.",
        "source": "T10n0279_073:0397a02_9"
    },
    {
        "source_sentence": "同大慈，念念普覆一切國土眾生海故；",
        "translation": "They all share the same great compassion, covering the ocean of sentient beings of all lands in every moment of thought.",
        "source": "T10n0279_073:0397a02_10"
    },
    {
        "source_sentence": "同大悲，普雨法雨潤澤一切諸眾生故；",
        "translation": "They are the same as great compassion, showering the rain of truth everywhere to moisten all sentient beings.",
        "source": "T10n0279_073:0397a03_11"
    },
    {
        "source_sentence": "同身業，以方便行教化一切諸眾生故；",
        "translation": "The same bodily action is to edify all sentient beings by means of skillful means.",
        "source": "T10n0279_073:0397a04_12"
    },
    {
        "source_sentence": "同語業，以隨類音演說一切諸法門故；",
        "translation": "The action of same-mouthing is that they expound all aspects of the Teaching in different voices according to their differences.",
        "source": "T10n0279_073:0397a05_13"
    },
    {
        "source_sentence": "同意業，普攝眾生置一切智境界中故；",
        "translation": "Consensual action is to gather all sentient beings into the sphere of omniscience.",
        "source": "T10n0279_073:0397a06_14"
    },
    {
        "source_sentence": "同莊嚴，嚴淨一切諸佛剎故；",
        "translation": "They are the same adornment, purifying all buddha-lands.",
        "source": "T10n0279_073:0397a07_15"
    },
    {
        "source_sentence": "同親近，有佛出世皆親近故；",
        "translation": "They all become intimate because when a buddha appears in the world they become intimate.",
        "source": "T10n0279_073:0397a07_16"
    },
    {
        "source_sentence": "同勸請，請一切佛轉法輪故；",
        "translation": "Together they invite, inviting all buddhas to turn the wheel of teaching.",
        "source": "T10n0279_073:0397a08_17"
    },
    {
        "source_sentence": "同供養，常樂供養一切佛故；",
        "translation": "They make the same offerings, always gladly honoring and serving all buddhas.",
        "source": "T10n0279_073:0397a09_18"
    },
    {
        "source_sentence": "同教化，調伏一切諸眾生故；",
        "translation": "They share the same instruction, because they tame all sentient beings.",
        "source": "T10n0279_073:0397a09_19"
    },
    {
        "source_sentence": "同光明，照了一切諸法門故；",
        "translation": "It is the same light because it illumines all aspects of reality.",
        "source": "T10n0279_073:0397a10_20"
    },
    {
        "source_sentence": "同三昧，普知一切眾生心故；",
        "translation": "They are the same concentration, because they know the minds of all sentient beings.",
        "source": "T10n0279_073:0397a11_21"
    },
    {
        "source_sentence": "同充遍，以自在力充滿一切諸佛剎海修諸行故；",
        "translation": "They are similarly pervasive, because they fill the oceans of all buddha-lands with their independent power and cultivate practices.",
        "source": "T10n0279_073:0397a11_22"
    },
    {
        "source_sentence": "同住處，住諸菩薩大神通故；",
        "translation": "They live together in the same dwelling place because they abide in the great spiritual powers of enlightening beings.",
        "source": "T10n0279_073:0397a13_23"
    },
    {
        "source_sentence": "同眷屬，一切菩薩共止住故；",
        "translation": "They are the same as their followers, because all enlightening beings live together.",
        "source": "T10n0279_073:0397a13_24"
    },
    {
        "source_sentence": "同入處，普入世界微細處故；",
        "translation": "They are the same sphere of enlightenment, because they enter into all subtle states of worlds.",
        "source": "T10n0279_073:0397a14_25"
    },
    {
        "source_sentence": "同心慮，普知一切諸佛剎故；",
        "translation": "They think with the same mind, because they know all buddha-lands.",
        "source": "T10n0279_073:0397a15_26"
    },
    {
        "source_sentence": "同往詣，普入一切佛剎海故；",
        "translation": "Together they travel together, entering into the ocean of all buddha-lands.",
        "source": "T10n0279_073:0397a15_27"
    },
    {
        "source_sentence": "同方便，悉現一切諸佛剎故；",
        "translation": "All buddha-lands are manifested by the same means:",
        "source": "T10n0279_073:0397a16_28"
    },
    {
        "source_sentence": "同超勝，於諸佛剎皆無比故；",
        "translation": "They are equally superior, because they are unequaled in all buddha-lands.",
        "source": "T10n0279_073:0397a17_0"
    },
    {
        "source_sentence": "同不退，普入十方無障礙故；",
        "translation": "They are the same as nonbacksliding, entering everywhere in all quarters without hindrance.",
        "source": "T10n0279_073:0397a17_1"
    },
    {
        "source_sentence": "同破闇，得一切佛成菩提智大光明故；",
        "translation": "They are likewise destroying darkness, because they attain the great light of the knowledge of enlightenment of all buddhas.",
        "source": "T10n0279_073:0397a18_2"
    },
    {
        "source_sentence": "同無生忍，入一切佛眾會海故；",
        "translation": "They are the same as the tolerance of nonorigination, because they enter the ocean of congregations of all buddhas.",
        "source": "T10n0279_073:0397a19_3"
    },
    {
        "source_sentence": "同遍一切諸佛剎網，恭敬供養不可說剎諸如來故；",
        "translation": "They universally pervade the network of all buddha-lands, honoring and serving untold numbers of buddhas.",
        "source": "T10n0279_073:0397a19_4"
    },
    {
        "source_sentence": "同智證，了知彼彼法門海故；",
        "translation": "They realize the same knowledge, because they know each other’s ocean of teachings.",
        "source": "T10n0279_073:0397a21_5"
    },
    {
        "source_sentence": "同修行，順行一切諸法門故；",
        "translation": "They practice together, following all aspects of the Teaching.",
        "source": "T10n0279_073:0397a21_6"
    },
    {
        "source_sentence": "同希求，於清淨法深樂欲故；",
        "translation": "They all shared the same aspiration, because they deeply delighted in and longed for the pure teachings.",
        "source": "T10n0279_073:0397a22_7"
    },
    {
        "source_sentence": "同清淨，集佛功德而以莊嚴身、口、意故；",
        "translation": "They are all equally pure, accumulating the virtues of buddhas because they adorn their bodies, speech, and thought.",
        "source": "T10n0279_073:0397a23_8"
    },
    {
        "source_sentence": "同妙意，於一切法智明了故；",
        "translation": "They had the same sublime intention, because they clearly comprehended all knowledges of things.",
        "source": "T10n0279_073:0397a23_9"
    },
    {
        "source_sentence": "同精進，普集一切諸善根故；",
        "translation": "They all share the same effort, because they universally accumulate all roots of goodness.",
        "source": "T10n0279_073:0397a24_10"
    },
    {
        "source_sentence": "同淨行，成滿一切菩薩行故；",
        "translation": "They practice the same purity, perfecting all enlightening practices.",
        "source": "T10n0279_073:0397a25_11"
    },
    {
        "source_sentence": "同無礙，了一切法皆無相故；",
        "translation": "They are the same as nonobstruction because they understand all things are signless.",
        "source": "T10n0279_073:0397a25_12"
    },
    {
        "source_sentence": "同善巧，於諸法中智自在故；",
        "translation": "They are the same as skillful, because they have mastery of knowledge regarding all things.",
        "source": "T10n0279_073:0397a26_13"
    },
    {
        "source_sentence": "同隨樂，隨眾生心現境界故；",
        "translation": "They are similar in enjoyment because they manifest objects according to the mentalities of sentient beings.",
        "source": "T10n0279_073:0397a27_14"
    },
    {
        "source_sentence": "同方便，善習一切所應習故；",
        "translation": "They are the same in terms of skillful means, being well accustomed to all that should be accustomed.",
        "source": "T10n0279_073:0397a27_15"
    },
    {
        "source_sentence": "同護念，得一切佛所護念故；",
        "translation": "They all share the same protective awareness, because they attain the protection of all buddhas.",
        "source": "T10n0279_073:0397a28_16"
    },
    {
        "source_sentence": "同入地，得入一切菩薩地故；",
        "translation": "They enter all the stages of enlightening beings in the same way, because they enter all the stages of enlightening beings.",
        "source": "T10n0279_073:0397a29_17"
    },
    {
        "source_sentence": "同所住，安住一切菩薩位故；",
        "translation": "They all dwell in the same abode, because they abide in the state of enlightening beings.",
        "source": "T10n0279_073:0397a29_18"
    },
    {
        "source_sentence": "同記別，一切諸佛授其記故；",
        "translation": "They are the same in their prediction, because all buddhas give them predictions.",
        "source": "T10n0279_073:0397b01_19"
    },
    {
        "source_sentence": "同三昧，一剎那中普入一切三昧門故；",
        "translation": "They are the same concentration, because in a single instant they enter all aspects of concentration.",
        "source": "T10n0279_073:0397b02_20"
    },
    {
        "source_sentence": "同建立，示現種種諸佛事故；",
        "translation": "Together they establish and show all kinds of buddha-works.",
        "source": "T10n0279_073:0397b02_21"
    },
    {
        "source_sentence": "同正念，正念一切境界門故；",
        "translation": "They are the same as right mindfulness, because right mindfulness encompasses all objects.",
        "source": "T10n0279_073:0397b03_22"
    },
    {
        "source_sentence": "同修行，盡未來劫修行一切菩薩行故；",
        "translation": "They practice together, cultivating all the practices of enlightening beings throughout all future ages.",
        "source": "T10n0279_073:0397b04_23"
    },
    {
        "source_sentence": "同淨信，於諸如來無量智慧極欣樂故；",
        "translation": "They all had the same pure faith, because they greatly delighted in the infinite knowledge of buddhas.",
        "source": "T10n0279_073:0397b05_24"
    },
    {
        "source_sentence": "同捨離，滅除一切諸障礙故；",
        "translation": "They are the same in relinquishment, because they extinguish all obstacles.",
        "source": "T10n0279_073:0397b06_0"
    },
    {
        "source_sentence": "同不退智，與諸如來智慧等故；",
        "translation": "They are the same as nonregressing knowledge, because they are equal to the knowledges of all buddhas.",
        "source": "T10n0279_073:0397b06_1"
    },
    {
        "source_sentence": "同受生，應現成熟諸眾生故；",
        "translation": "They are born in the same way, because they should manifest and mature sentient beings.",
        "source": "T10n0279_073:0397b07_2"
    },
    {
        "source_sentence": "同所住，住一切智方便門故；",
        "translation": "They all abide in the same way, because they abide in the method of omniscience.",
        "source": "T10n0279_073:0397b08_3"
    },
    {
        "source_sentence": "同境界，於法界境得自在故；",
        "translation": "They have the same object, because they attain mastery over the object of the realm of reality.",
        "source": "T10n0279_073:0397b08_4"
    },
    {
        "source_sentence": "同無依，永斷一切所依心故；",
        "translation": "They are the same as having no support, because they permanently eliminate all bases of thought.",
        "source": "T10n0279_073:0397b09_5"
    },
    {
        "source_sentence": "同說法，已入諸法平等智故；",
        "translation": "They teach the same doctrine, because they have entered the equanimous knowledge of all things.",
        "source": "T10n0279_073:0397b10_0"
    },
    {
        "source_sentence": "同勤修，常蒙諸佛所護念故；",
        "translation": "They all practice with the same zeal, always protected by the Buddhas.",
        "source": "T10n0279_073:0397b10_1"
    },
    {
        "source_sentence": "同神通，開悟眾生令修一切菩薩行故；",
        "translation": "They share the same spiritual powers, enlightening sentient beings and causing them to cultivate all practices of enlightening beings.",
        "source": "T10n0279_073:0397b11_2"
    },
    {
        "source_sentence": "同神力，能入十方世界海故；",
        "translation": "They had the same spiritual powers, being able to enter all oceans of worlds in the ten directions.",
        "source": "T10n0279_073:0397b12_3"
    },
    {
        "source_sentence": "同陀羅尼，普照一切總持海故；",
        "translation": "It is the same as dhāraṇī, because it illumines all oceans of universal support.",
        "source": "T10n0279_073:0397b12_4"
    },
    {
        "source_sentence": "同祕密法，了知一切修多羅中妙法門故；",
        "translation": "They are the same as the esoteric teachings, because they comprehend all the sublime teachings of the scriptures.",
        "source": "T10n0279_073:0397b13_5"
    },
    {
        "source_sentence": "同甚深法，解一切法如虛空故；",
        "translation": "They all share the same profound teaching, because they understand all things are like space.",
        "source": "T10n0279_073:0397b14_6"
    },
    {
        "source_sentence": "同光明，普照一切諸世界故；",
        "translation": "They all share the same light, illumining all worlds.",
        "source": "T10n0279_073:0397b15_7"
    },
    {
        "source_sentence": "同欣樂，隨眾生心而為開示令歡喜故；",
        "translation": "They all share the same joy and delight, teaching and enlightening beings according to the mentalities of sentient beings and causing them to rejoice.",
        "source": "T10n0279_073:0397b15_8"
    },
    {
        "source_sentence": "同震動，為諸眾生現神通力普動十方一切剎故；",
        "translation": "They shook the earth in the same way, manifesting mystic powers to sentient beings and causing all the worlds of the ten directions to shake.",
        "source": "T10n0279_073:0397b16_9"
    },
    {
        "source_sentence": "同不虛，見聞憶念皆悉令其心調伏故；",
        "translation": "They are the same as non-falsity, because they all cause their minds to be tempered by seeing, hearing, and remembering.",
        "source": "T10n0279_073:0397b17_10"
    },
    {
        "source_sentence": "同出離，滿足一切諸大願海，成就如來十力智故。",
        "translation": "They all share the same liberation, fulfilling all the great vows and accomplishing the Tathāgata's ten powers of knowledge.",
        "source": "T10n0279_073:0397b18_11"
    },
    {
        "source_sentence": "時，善財童子觀察大願精進力救護一切眾生夜神，起十種清淨心，獲如是等佛剎微塵數同菩薩行；",
        "translation": "Then Sudhana, observing the night goddess Sarvarūpasaṃdarśana’s great undertaking to save all sentient beings by the power of her vows, developed ten kinds of pure aspiration and attained as many such practices as there are atoms in buddha-lands.",
        "source": "T10n0279_073:0397b19_12"
    },
    {
        "source_sentence": "「我發堅固意，　　志求無上覺；",
        "translation": "I arouse a firm intention To seek the supreme awakening.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　今於善知識，　　而起自己心。",
        "translation": "Now, I'll give rise to my own mind in the presence of a good teacher.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　以見善知識，　　集無盡白法，",
        "translation": "Seeing a good teacher, he collects inexhaustible white dharmas.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　滅除眾罪垢，　　成就菩提果。",
        "translation": "Extinguishing the stain of all sins, he accomplishes the fruit of enlightenment.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　我見善知識，　　功德莊嚴心，",
        "translation": "I see spiritual benefactors, Whose minds are adorned with virtue.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　盡未來剎劫，　　勤修所行道。",
        "translation": "Throughout the ages to come, They will diligently cultivate the path they practice.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　我念善知識，　　攝受饒益我，",
        "translation": "I am mindful of the spiritual benefactors, Who provide for and benefit me.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　為我悉示現，　　正教真實法，",
        "translation": "For my sake I show them all The true teaching of the Teaching.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　關閉諸惡趣，　　顯示人天路，",
        "translation": "They shut off the evil destinies and show the paths of humans and gods.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　亦示諸如來，　　成一切智道。",
        "translation": "They also show the enlightened Ones The path of omniscience.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　我念善知識，　　是佛功德藏，",
        "translation": "I am mindful of spiritual benefactors, Who are treasuries of virtue for the buddhas.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　念念能出生，　　虛空功德海。",
        "translation": "Mindfulness can give rise to an ocean of merit like space.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　與我波羅蜜，　　增我難思福，",
        "translation": "Give me the perfection of self, Increasing my inconceivable merit.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　長我淨功德，　　令我冠佛繒。",
        "translation": "I'll cultivate my pure virtue so that I'll be crowned as a buddha.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　我念善知識，　　能滿佛智道；",
        "translation": "I am mindful of the spiritual benefactor Who can fulfill the path of buddhahood.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　誓願常依止，　　圓滿白淨法。",
        "translation": "I vow to always rely on the perfect white and pure Dharma.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　我以此等故，　　功德悉具足，",
        "translation": "Because of these, I am endowed with all virtues.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　普為諸眾生，　　說一切智道。",
        "translation": "He teaches the path of omniscience for all sentient beings.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　聖者為我師，　　與我無上法，",
        "translation": "The holy one is my teacher, bestowing on me the highest dharma.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "　無量無數劫，　　不能報其恩。」",
        "translation": "For measureless and countless eons, they won't be able to repay their kindness.",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "既獲此已，心轉清淨，偏袒右肩，頂禮其足，一心合掌，以偈讚曰：爾時，",
        "translation": "Having obtained this, his mind became clear and pure. He bared his right shoulder, bowed his forehead at [Daosun’s] feet, joined his palms with one-pointed concentration, and praised him in verse:",
        "source": "T10n0279_073:0397b22_13"
    },
    {
        "source_sentence": "善財說此偈已，白言：「大聖！",
        "translation": "After speaking this verse, Sun Cai said, Great sage!",
        "source": "T10n0279_073:0397c15_14"
    },
    {
        "source_sentence": "願為我說，此解脫門名為何等？",
        "translation": "What is the name of this liberation?",
        "source": "T10n0279_073:0397c15_15"
    },
    {
        "source_sentence": "發心已來為幾時耶？",
        "translation": "How long has it been since the thought of enlightenment?",
        "source": "T10n0279_073:0397c16_16"
    },
    {
        "source_sentence": "久如當得阿耨多羅三藐三菩提？」",
        "translation": "How long will it be before he attains supreme perfect enlightenment?",
        "source": "T10n0279_073:0397c16_17"
    },
    {
        "source_sentence": "夜神告言：「善男子！",
        "translation": "The night goddess told him, Good man!",
        "source": "T10n0279_073:0397c17_18"
    },
    {
        "source_sentence": "此解脫門，名：教化眾生令生善根。",
        "translation": "This door of liberation is called teaching sentient beings and causing them to give rise to good roots.",
        "source": "T10n0279_073:0397c18_19"
    },
    {
        "source_sentence": "我以成就此解脫故，悟一切法自性平等，入於諸法真實之性，證無依法，",
        "translation": "Because of the accomplishment of this liberation, I realize the equality of all things in their essential natures. Entering into the true nature of all things, I realize the absence of any doctrine.",
        "source": "T10n0279_073:0397c18_20"
    },
    {
        "source_sentence": "捨離世間，悉知諸法色相差別，亦能了達青、黃、赤、白，性皆不實，",
        "translation": "Being free of world, they know all distinctions in the forms and characteristics of things. They can also comprehend that blue, yellow, red, and white are not real by nature.",
        "source": "T10n0279_073:0397c20_21"
    },
    {
        "source_sentence": "無有差別，而恒示現無量色身。",
        "translation": "They have no distinctions, yet they always show immeasurable form bodies.",
        "source": "T10n0279_073:0397c21_22"
    },
    {
        "source_sentence": "所謂：種種色身、非一色身、無邊色身、清淨色身、一切莊嚴色身、普見色身、等一切眾生色身、普現一切眾生前色身、光明普照色身、見無厭足色身、相好清淨色身、離眾惡光明色身、示現大勇猛色身、甚難得色身、一切世間無能映蔽色身、一切世間共稱歎無盡色身、念念常觀察色身、示現種種雲色身、種種形顯色色身、現無量自在力色身、妙光明色身、一切淨妙莊嚴色身、隨順成熟一切眾生色身、隨其心樂現前調伏色身、無障礙普光明色身、清淨無濁穢色身、具足莊嚴不可壞色身、不思議法方便光明色身、無能映奪一切色身、無諸闇破一切闇色身、集一切白淨法色身、大勢力功德海色身、從過去恭敬因所生色身、如虛空清淨心所生色身、最勝廣大色身、無斷無盡色身、光明海色身、於一切世間無所依平等色身、遍十方無所礙色身、念念現種種色相海色身、增長一切眾生歡喜心色身、攝取一切眾生海色身、一一毛孔中說一切佛功德海色身、淨一切眾生欲解海色身、決了一切法義色身、無障礙普照耀色身、等虛空淨光明色身、放廣大淨光明色身、照現無垢法色身、無比色身、差別莊嚴色身、普照十方色身、隨時示現應眾生色身、寂靜色身、滅一切煩惱色身、一切眾生福田色身、一切眾生見不虛色身、大智慧勇猛力色身、無障礙普周遍色身、妙身雲普現世間皆蒙益色身、具足大慈海色身、大福德寶山王色身、放光明普照世間一切趣色身、大智慧清淨色身、生眾生正念心色身、一切寶光明色身、普光藏色身、現世間種種清淨相色身、求一切智處色身、現微笑令眾生生淨信色身、一切寶莊嚴光明色身、不取不捨一切眾生色身、無決定無究竟色身、現自在加持力色身、現一切神通變化色身、生如來家色身、遠離眾惡遍法界海色身、普現一切如來道場眾會色身、具種種眾色海色身、從善行所流色身、隨所應化示現色身、一切世間見無厭足色身、種種淨光明色身、現一切三世海色身、放一切光明海色身、現無量差別光明海色身、超諸世間一切香光明色身、現不可說日輪雲色身、現廣大月輪雲色身、放無量須彌山妙華雲色身、出種種鬘雲色身、現一切寶蓮華雲色身、興一切燒香雲遍法界色身、散一切末香藏雲色身、現一切如來大願身色身、現一切語言音聲演法海色身、現普賢菩薩像色身。",
        "translation": "They are various form bodies, not one form body, boundless form bodies, pure form bodies, all adorned form bodies, form bodies seen everywhere, form bodies equal to all sentient beings, form bodies that appear before all sentient beings, form bodies illumined by the light of all beings, form bodies seeing without weariness, form bodies with",
        "source": "T10n0279_073:0397c22_23"
    },
    {
        "source_sentence": "「念念中，現如是等色相身充滿十方，令諸眾生或見、或念、或聞說法、或因親近、或得開悟、或見神通、或覩變化，",
        "translation": "“In each thought, such physical forms and bodies as these appear to fill the ten directions, causing sentient beings either to see, or to think, or to hear the Teaching, or to become intimate with them, or to attain enlightenment, or to see mystic powers, or to see miraculous manifestations.",
        "source": "T10n0279_073:0398b10_24"
    },
    {
        "source_sentence": "悉隨心樂，應時調伏，捨不善業，住於善行。",
        "translation": "They all follow the mind's pleasure, are appropriately disciplined at the right time, abandon unwholesome actions, and abide in wholesome behavior.",
        "source": "T10n0279_073:0398b13_25"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398b14_26"
    },
    {
        "source_sentence": "當知此由大願力故，一切智力故，菩薩解脫力故，大悲力故，大慈力故，",
        "translation": "You should know that this is due to the power of great vows, because of the power of omniscience, because of the power of liberation of enlightening beings, because of the power of great compassion, and because of the power of great love.",
        "source": "T10n0279_073:0398b14_27"
    },
    {
        "source_sentence": "作如是事。",
        "translation": "He did such a thing.",
        "source": "T10n0279_073:0398b16_28"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398b16_29"
    },
    {
        "source_sentence": "我入此解脫，了知法性無有差別，而能示現無量色身，一一身現無量色相海，",
        "translation": "“I enter this liberation, knowing the essence of things has no distinctions, yet able to manifest infinite physical forms. In one body I manifest infinite oceans of forms and characteristics.",
        "source": "T10n0279_073:0398b16_30"
    },
    {
        "source_sentence": "一一相放無量光明雲，一一光現無量佛國土，一一土現無量佛興世，一一佛現無量神通力，",
        "translation": "Each of them emanated clouds of infinite rays of light, each ray of light revealing infinite buddha-lands; each land manifested infinite Buddhas appearing in all worlds, each Buddha showing infinite mystic powers.",
        "source": "T10n0279_073:0398b18_31"
    },
    {
        "source_sentence": "開發眾生宿世善根，未種者令種，已種者令增長，已增長者令成熟；",
        "translation": "He develops the roots of goodness of sentient beings of former ages, causing those who have not planted them to do so; those who have planted them to grow and those who have already grown to maturity.",
        "source": "T10n0279_073:0398b20_32"
    },
    {
        "source_sentence": "念念中，令無量眾生，於阿耨多羅三藐三菩提得不退轉。",
        "translation": "In each thought, they cause measureless sentient beings to attain unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T10n0279_073:0398b22_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398b23_1"
    },
    {
        "source_sentence": "如汝所問：『從幾時來，發菩提心，修菩薩行？』",
        "translation": "As you asked, 'How long ago did you give rise to the mind of enlightenment and cultivate the bodhisattva practice?'",
        "source": "T10n0279_073:0398b23_2"
    },
    {
        "source_sentence": "如是之義，承佛神力，當為汝說。",
        "translation": "Such is the meaning of what I will explain to you through the Buddha’s supernatural power.",
        "source": "T10n0279_073:0398b24_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398b25_4"
    },
    {
        "source_sentence": "菩薩智輪遠離一切分別境界，不可以生死中長短、染淨、廣狹、多少，",
        "translation": "“Furthermore, the wheel of knowledge of enlightening beings is free of all discriminating objects and cannot distinguish length, defilement, purity, breadth, width, or measure.",
        "source": "T10n0279_073:0398b25_5"
    },
    {
        "source_sentence": "如是諸劫分別顯示。",
        "translation": "Thus, these eons are discriminated and shown.",
        "source": "T10n0279_073:0398b26_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_073:0398b27_7"
    },
    {
        "source_sentence": "菩薩智輪本性清淨，離一切分別網，超一切障礙山，隨所應化而普照故。",
        "translation": "The original nature of the wheel of knowledge of enlightening beings is pure, free from all webs of discrimination and transcending all mountains of obstacles: because it illuminates everywhere according to what needs to be taught.",
        "source": "T10n0279_073:0398b27_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398b29_9"
    },
    {
        "source_sentence": "譬如日輪，無有晝夜；",
        "translation": "It is as if the sun were to rise without a day and night.",
        "source": "T10n0279_073:0398b29_10"
    },
    {
        "source_sentence": "但出時名：晝，沒時名：夜。",
        "translation": "The only time when it comes out is called day; the time when it goes down is called night.",
        "source": "T10n0279_073:0398b29_11"
    },
    {
        "source_sentence": "菩薩智輪亦復如是，無有分別，亦無三世；",
        "translation": "So it is with the sphere of knowledge of enlightening beings, which has no discrimination and no past, present, or future.",
        "source": "T10n0279_073:0398c01_12"
    },
    {
        "source_sentence": "但隨心現，教化眾生，言其止住前劫、後劫。",
        "translation": "He simply follows the manifestation of his mind and teaches sentient beings, saying that he abides in the previous eon or the subsequent eon.",
        "source": "T10n0279_073:0398c02_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398c03_14"
    },
    {
        "source_sentence": "譬如日輪，住閻浮空，其影悉現一切寶物及以河海諸淨水中，一切眾生莫不目見，",
        "translation": "It is as if the sun were to rise in the sky above Jambudvfpa, and all its rays of light would be reflected there. All kinds of jewels and pure water from the great rivers and seas could be seen by all living beings.",
        "source": "T10n0279_073:0398c03_15"
    },
    {
        "source_sentence": "而彼淨日不來至此。",
        "translation": "They won't come here on the day of purity.",
        "source": "T10n0279_073:0398c05_16"
    },
    {
        "source_sentence": "菩薩智輪亦復如是，出諸有海，住佛實法，寂靜空中無有所依，為欲化度諸眾生故，",
        "translation": "“Furthermore, the sphere of knowledge of enlightening beings is also like this: they emerge from all oceans of existence and abide in buddha-teachings. They have no support in the space of tranquility because they want to liberate sentient beings.",
        "source": "T10n0279_073:0398c05_17"
    },
    {
        "source_sentence": "而於諸趣隨類受生；",
        "translation": "They are born in all states of existence according to their type.",
        "source": "T10n0279_073:0398c07_18"
    },
    {
        "source_sentence": "實不生死，無所染著，無長短劫諸想分別。",
        "translation": "They really aren't subject to birth and death, are not stained by anything, and don't discriminate between long and short eons of conceptions.",
        "source": "T10n0279_073:0398c08_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_073:0398c09_20"
    },
    {
        "source_sentence": "菩薩究竟離心想，見一切顛倒，得真實見，見法實性，知一切世間如夢、如幻；",
        "translation": "Enlightening beings are ultimately free from thought and ideation, seeing all errors. They attain true vision, see the reality of things, know all worlds are like dreams or illusions.",
        "source": "T10n0279_073:0398c09_21"
    },
    {
        "source_sentence": "無有眾生，但以大悲大願力故，現眾生前教化調伏。",
        "translation": "There are no sentient beings, but it's because of the power of great compassion and great vows that they appear before sentient beings to teach and tame them.",
        "source": "T10n0279_073:0398c11_22"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0398c12_23"
    },
    {
        "source_sentence": "譬如船師，常以大船，於河流中不依此岸、不著彼岸、不住中流，而度眾生無有休息。",
        "translation": "It's like a boat captain who always uses a large boat to cross the river without relying on this shore, doesn't cling to the other shore, and doesn't stay in the middle of the river, but he saves sentient beings without resting.",
        "source": "T10n0279_073:0398c12_24"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，以波羅蜜船，於生死流中不依此岸、不著彼岸、不住中流，",
        "translation": "“Just so, the great enlightening beings use the ship of the transcendent ways to rise up in the midst of the flow of birth and death, not relying on this shore, not clinging to the other shore, not dwelling in the middle of the flow.",
        "source": "T10n0279_073:0398c14_25"
    },
    {
        "source_sentence": "而度眾生無有休息；",
        "translation": "He liberates sentient beings without cease.",
        "source": "T10n0279_073:0398c16_26"
    },
    {
        "source_sentence": "雖無量劫修菩薩行，未曾分別劫數長短。",
        "translation": "Even though they cultivated the bodhisattva practice for measureless eons, they never discriminated between long and short eons.",
        "source": "T10n0279_073:0398c16_27"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0398c17_28"
    },
    {
        "source_sentence": "如大虛空，一切世界於中成壞而無分別，本性清淨，無染無亂，無礙無厭，",
        "translation": "Like space, all worlds form and disintegrate therein without discrimination, inherently pure, undefiled, unconfused, unobstructed, undaunted.",
        "source": "T10n0279_073:0398c17_29"
    },
    {
        "source_sentence": "非長非短，盡未來劫持一切剎。",
        "translation": "It's neither long nor short, and it will support all the buddhas for an entire eon in the future.",
        "source": "T10n0279_073:0398c19_30"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，以等虛空界廣大深心，起大願風輪，攝諸眾生，",
        "translation": "“Furthermore, similarly great enlightening beings produce the atmosphere of great vows with vast and profound minds equal to space, collecting all sentient beings.",
        "source": "T10n0279_073:0398c20_31"
    },
    {
        "source_sentence": "令離惡道，生諸善趣，悉令安住一切智地，滅諸煩惱生死苦縛，而無憂喜、疲厭之心。",
        "translation": "He causes them to part with bad destinies and give rise to good destinies, makes them all abide in the stage of omniscience, extinguishes the afflictive bonds of birth-and-death and suffering, and has no sorrow, joy, or weariness.",
        "source": "T10n0279_073:0398c21_32"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0398c23_33"
    },
    {
        "source_sentence": "如幻化人，肢體雖具，而無入息及以出息、寒、熱、飢、渴、憂、喜、生、死十種之事。",
        "translation": "It's like an illusory transformation person whose limbs are complete but who doesn't inhale or exhale, cold, heat, hunger, thirst, thirst, thirst, sorrow, joy, birth, and death ten kinds of things.",
        "source": "T10n0279_073:0398c24_34"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，以如幻智平等法身現眾色相，於諸有趣住無量劫教化眾生，",
        "translation": "“Furthermore, great enlightening beings manifest all forms and manifestations by means of the equanimous reality body of illusory knowledge. They abide for infinite eons in various ways to teach sentient beings.",
        "source": "T10n0279_073:0398c25_35"
    },
    {
        "source_sentence": "於生死中一切境界，無欣無厭，無愛無恚，無苦無樂，無取無捨，無安無怖。",
        "translation": "In all the realms of birth and death, there's no joy or displeasure, no craving or anger, no pain or pleasure, no grasping or equanimity, and no peace or fear.",
        "source": "T10n0279_073:0398c27_36"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0398c29_37"
    },
    {
        "source_sentence": "菩薩智慧雖復如是甚深難測，我當承佛威神之力為汝解說，令未來世諸菩薩等滿足大願、成就諸力。",
        "translation": "Although the bodhisattva's wisdom is as profound and difficult to fathom as this, I will use the Buddha's authoritative power to explain it for you so that future bodhisattvas will fulfill their great vows and accomplish their powers.",
        "source": "T10n0279_073:0398c29_38"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0399a02_39"
    },
    {
        "source_sentence": "乃往古世，過世界海微塵數劫，有劫名：善光，世界名：寶光。",
        "translation": "“World-honored One, from ancient times as many eons ago as atoms in an ocean of worlds, there was an eon called Light of Virtue, with a world called Jewel Light.",
        "source": "T10n0279_073:0399a03_0"
    },
    {
        "source_sentence": "於其劫中，有一萬佛出興于世。",
        "translation": "In that age ten thousand buddhas emerged in the world.",
        "source": "T10n0279_073:0399a04_1"
    },
    {
        "source_sentence": "其最初佛，號：法輪音虛空燈王如來、應、正等覺，十號圓滿。",
        "translation": "The first buddha there was named King of the Space-Further Sound of the Wheel of the Dharma, Tathāgata, Arhat, Perfectly Enlightened One. His ten epithets were complete.",
        "source": "T10n0279_073:0399a05_0"
    },
    {
        "source_sentence": "彼閻浮提，有一王都，名：寶莊嚴；",
        "translation": "In that continent there was a capital city called Array of Jewels.",
        "source": "T10n0279_073:0399a06_1"
    },
    {
        "source_sentence": "其東不遠，有一大林，名曰：妙光；",
        "translation": "Not far to the east was a great forest called Marvelous Light.",
        "source": "T10n0279_073:0399a07_0"
    },
    {
        "source_sentence": "中有道場，名為：寶華。",
        "translation": "In the middle was a site of enlightenment called Jewel Flower.",
        "source": "T10n0279_073:0399a07_1"
    },
    {
        "source_sentence": "彼道場中，有普光明摩尼蓮華藏師子之座。",
        "translation": "In that site of enlightenment, there's a lion seat of the lotus-treasury store of universal light and maṇi jewels.",
        "source": "T10n0279_073:0399a08_2"
    },
    {
        "source_sentence": "時，彼如來於此座上，成阿耨多羅三藐三菩提，滿一百年坐於道場，為諸菩薩、諸天、世人及閻浮提宿植善根已成熟者演說正法。",
        "translation": "On this seat, the Tathāgata then attained supreme perfect enlightenment and sat on the terrace of enlightenment for a hundred years, expounding the right teaching to those bodhisattvas, gods, worldlings, and people in Jambudvīpa who had planted good roots overnight and had matured them.",
        "source": "T10n0279_073:0399a09_3"
    },
    {
        "source_sentence": "「是時，國王名曰：勝光。",
        "translation": "“At the time, the king was named Supreme Light.",
        "source": "T10n0279_073:0399a12_4"
    },
    {
        "source_sentence": "時世人民壽一萬歲，其中多有殺、盜、婬佚、妄語、綺語、兩舌、惡口、貪、瞋、邪見、不孝父母、不敬沙門婆羅門等。",
        "translation": "At the time, the life span of the people in the world was 10,000 years, and among them were many who committed acts of killing, stealing, immoral sexual misconduct, speaking falsehoods, engaging in fancy speech, divisive speech, harsh words, greed, anger, wrong views, disobedient to their parents, disrespectful to ascetics and priest",
        "source": "T10n0279_073:0399a12_5"
    },
    {
        "source_sentence": "時，王為欲調伏彼故，造立囹圄，枷鎖禁閉，無量眾生於中受苦。",
        "translation": "Because the king wanted to subdue them, he created a prison and imprisoned measureless sentient beings in it.",
        "source": "T10n0279_073:0399a15_6"
    },
    {
        "source_sentence": "「王有太子，名為：善伏，端正殊特，人所喜見，具二十八大人之相。",
        "translation": "“The king had a prince named Sunetra, who was outstanding in appearance and good-looking. He possessed the twenty-eight eminent marks of a great man.",
        "source": "T10n0279_073:0399a16_7"
    },
    {
        "source_sentence": "在宮殿中，遙聞獄囚楚毒音聲，心懷傷愍。",
        "translation": "When he was inside the palace, he heard the painful sound of the prisoners’ cries from a distance and felt distressed in his heart.",
        "source": "T10n0279_073:0399a17_8"
    },
    {
        "source_sentence": "從宮殿出，入牢獄中，見諸罪人杻械、枷鎖遞相連繫，置幽闇處，或以火炙，",
        "translation": "He came out of the palace and entered the prison. Seeing the malefactors chained together in fetters, shackles, and cudgellocks, he placed them in a dark place or burned them in a fiery furnace.",
        "source": "T10n0279_073:0399a18_9"
    },
    {
        "source_sentence": "或以煙熏，或被榜笞，或遭臏割，裸形亂髮，飢渴羸瘦，筋斷骨現，號叫苦劇。",
        "translation": "They may be perfumed with smoke, or they may be beaten on a tray or cut into pieces. Their naked forms are disfigured, hungry and thin, their tendons are severed and their bones appear, wailing in distress.",
        "source": "T10n0279_073:0399a20_10"
    },
    {
        "source_sentence": "太子見已，心生悲愍，以無畏聲安慰之言：『汝莫憂惱！",
        "translation": "Seeing this, the prince became compassionate and comforted him with a voice of fearlessness, saying, 'Don't worry!'",
        "source": "T10n0279_073:0399a22_11"
    },
    {
        "source_sentence": "汝勿愁怖！",
        "translation": "Don't be sad and fearful!",
        "source": "T10n0279_073:0399a23_12"
    },
    {
        "source_sentence": "我當令汝悉得解脫。』",
        "translation": "I will cause you to attain liberation.'",
        "source": "T10n0279_073:0399a23_13"
    },
    {
        "source_sentence": "便詣王所而白王言：『獄中罪人苦毒難處，願垂寬宥，施以無畏。』",
        "translation": "He went to the king and said to him, 'The sinners in prison are in painful and difficult places, so please have mercy on them and give them fearlessness.'",
        "source": "T10n0279_073:0399a24_14"
    },
    {
        "source_sentence": "「時，王即集五百大臣而問之言：『是事云何？』",
        "translation": "The king then gathered the five hundred ministers and asked them, 'What's the matter?'",
        "source": "T10n0279_073:0399a25_15"
    },
    {
        "source_sentence": "諸臣答言：『彼罪人者，私竊官物，謀奪王位，盜入宮闈，罪應刑戮。",
        "translation": "The ministers replied, 'That criminal is a man who stole the king's property and stole into the palace to commit capital punishment.",
        "source": "T10n0279_073:0399a26_16"
    },
    {
        "source_sentence": "有哀救者，罪亦至死。』",
        "translation": "If someone grieves and saves them, their sin will also lead to death.'",
        "source": "T10n0279_073:0399a27_17"
    },
    {
        "source_sentence": "「時，彼太子悲心轉切，語大臣言：『如汝所說，但放此人；",
        "translation": "The prince, overcome with sorrow and grief, said to his ministers: Just as you have said, let this man go.",
        "source": "T10n0279_073:0399a28_18"
    },
    {
        "source_sentence": "隨其所應，可以治我。",
        "translation": "Whatever they should be, they can treat themselves.",
        "source": "T10n0279_073:0399a29_19"
    },
    {
        "source_sentence": "我為彼故，一切苦事悉皆能受，粉身沒命，無所顧惜，要令罪人皆得免苦。",
        "translation": "For their sake I am able to endure all kinds of pain. My body is crushed into powder and my life is destroyed, and I have nothing to cherish in order to enable the sinners to escape punishment.",
        "source": "T10n0279_073:0399b01_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_073:0399b02_21"
    },
    {
        "source_sentence": "我若不救此眾生者，云何能救三界牢獄諸苦眾生？",
        "translation": "If I don't save these sentient beings, how can I save the suffering sentient beings in the three realms who are imprisoned?",
        "source": "T10n0279_073:0399b02_22"
    },
    {
        "source_sentence": "一切眾生在三界中，貪愛所縛，愚癡所蔽，貧無功德，墮諸惡趣，身形鄙陋，",
        "translation": "All sentient beings in the three realms are bound by craving, blinded by ignorance, poor and lacking virtue, falling into evil destinies, their bodies and forms coarse and ugly.",
        "source": "T10n0279_073:0399b04_23"
    },
    {
        "source_sentence": "諸根放逸，其心迷惑，不求出道，失智慧光，樂著三有，斷諸福德，滅諸智慧，",
        "translation": "Their faculties are lazy, their minds confused, they don’t seek the path of liberation, lose the light of wisdom, delight in the three existences, cut off all virtues, and cease all knowledge.",
        "source": "T10n0279_073:0399b05_24"
    },
    {
        "source_sentence": "種種煩惱濁亂其心，住苦牢獄，入魔罥網，生老病死憂悲惱害，如是諸苦常所逼迫。",
        "translation": "Their minds are stained by various afflictions, staying in painful prisons and entering the web of Māra's wickedness, suffering from birth, old age, illness, death, grief, sorrow, and vexation, and being constantly oppressed by these kinds of suffering.",
        "source": "T10n0279_073:0399b07_25"
    },
    {
        "source_sentence": "我當云何令彼解脫？",
        "translation": "How will I cause them to be liberated?",
        "source": "T10n0279_073:0399b09_26"
    },
    {
        "source_sentence": "應捨身命而拔濟之！』",
        "translation": "You should abandon body and life and rescue them!'",
        "source": "T10n0279_073:0399b09_27"
    },
    {
        "source_sentence": "「時，諸大臣共詣王所，悉舉其手高聲唱言：『大王當知，如太子意，",
        "translation": "The ministers then came to the king and said in unison, “O great king, as Your Majesty wishes, let me tell you something:",
        "source": "T10n0279_073:0399b10_28"
    },
    {
        "source_sentence": "毀壞王法，禍及萬人。",
        "translation": "It destroyed the king’s law and caused many thousands of misfortunes.",
        "source": "T10n0279_073:0399b11_29"
    },
    {
        "source_sentence": "若王愛念不責治者，王之寶祚亦不久立。』",
        "translation": "If the king loves and doesn't rebuke someone who governs, the king's jeweled throne won't be established for a long time.'",
        "source": "T10n0279_073:0399b12_30"
    },
    {
        "source_sentence": "王聞此言，赫然大怒，令誅太子及諸罪人。",
        "translation": "When the king heard these words, he became furious and ordered the prince and the sinners to be executed.",
        "source": "T10n0279_073:0399b13_31"
    },
    {
        "source_sentence": "「王后聞之，愁憂號哭，毀形降服，與千采女馳詣王所，舉身投地頂禮王足，",
        "translation": "When the queen heard this, she was overcome with sorrow and cried aloud in distress. Her body disfigured and her clothes fell on the ground. She fled to where the king was staying, accompanied by one thousand court ladies.",
        "source": "T10n0279_073:0399b14_0"
    },
    {
        "source_sentence": "俱作是言：『唯願大王，赦太子命！』",
        "translation": "They both said, 'Please, great king, forgive the prince's life!'",
        "source": "T10n0279_073:0399b15_1"
    },
    {
        "source_sentence": "王即迴顧，語太子言：『莫救罪人；",
        "translation": "The king looked around and said to the prince, “Do not rescue these sinners.",
        "source": "T10n0279_073:0399b16_2"
    },
    {
        "source_sentence": "若救罪人，必當殺汝！』",
        "translation": "If you save the sinners, they'll surely kill you!'",
        "source": "T10n0279_073:0399b17_3"
    },
    {
        "source_sentence": "爾時，太子為欲專求一切智故，為欲利益諸眾生故，為以大悲普救攝故，",
        "translation": "It was then that the prince, wanting to pursue omniscience exclusively, wanting to benefit sentient beings, and wanting to rescue them all with great compassion.",
        "source": "T10n0279_073:0399b17_4"
    },
    {
        "source_sentence": "其心堅固無有退怯，復白王言：『願恕彼罪，身當受戮！』",
        "translation": "His mind was resolute and unshakable, and he again said to the king, 'May I forgive that sin; my body will be slain!'",
        "source": "T10n0279_073:0399b19_5"
    },
    {
        "source_sentence": "王言：『隨意！』",
        "translation": "The king said, 'As you wish!'",
        "source": "T10n0279_073:0399b20_6"
    },
    {
        "source_sentence": "爾時，王后白言：『大王！",
        "translation": "It was then that the queen said, 'Great king!",
        "source": "T10n0279_073:0399b20_7"
    },
    {
        "source_sentence": "願聽太子，半月行施，恣意修福，然後治罪。』",
        "translation": "May I hear the prince give alms for half a month to cultivate merit as freely as he wishes, and then he'll be cured of his sins.'",
        "source": "T10n0279_073:0399b21_8"
    },
    {
        "source_sentence": "王即聽許。",
        "translation": "The king then listened and gave his permission.",
        "source": "T10n0279_073:0399b22_9"
    },
    {
        "source_sentence": "「時，都城北有一大園，名曰：日光，是昔施場。",
        "translation": "“North of the capital city there was a large park called Sunlight, which had been an almsgiving site in olden times.",
        "source": "T10n0279_073:0399b22_10"
    },
    {
        "source_sentence": "太子往彼，設大施會；",
        "translation": "The prince went there and offered a great almsgiving.",
        "source": "T10n0279_073:0399b23_11"
    },
    {
        "source_sentence": "飲食、衣服、華鬘、瓔珞、塗香、末香、幢幡、寶蓋，諸莊嚴具，隨有所求，",
        "translation": "They offered food, drink, clothing, flower garlands, necklaces, perfumes, powdered incense, banners, pennants, jeweled canopies, and other adornments as they wished.",
        "source": "T10n0279_073:0399b23_12"
    },
    {
        "source_sentence": "靡不周給。",
        "translation": "None of them were given to him.",
        "source": "T10n0279_073:0399b25_13"
    },
    {
        "source_sentence": "經半月已，於最後日，國王、大臣、長者、居士、城邑人民及諸外道，",
        "translation": "On the last day after half a month had passed, the king, his ministers, elders, householders, laymen, cities, towns, and non-Buddhist practitioners were all present.",
        "source": "T10n0279_073:0399b25_14"
    },
    {
        "source_sentence": "悉來集會。",
        "translation": "They all came to the assembly.",
        "source": "T10n0279_073:0399b26_15"
    },
    {
        "source_sentence": "「時，法輪音虛空燈王如來，知諸眾生調伏時至，與大眾俱，天王圍遶，",
        "translation": "“At that time, the Tathāgata Dharma-wheel-Sound Space-Door King of the Light of the Universal Sound of the Teaching, knowing that the time had come for the sentient beings to be disciplined, was accompanied by a great assembly, surrounded by heavenly kings.",
        "source": "T10n0279_073:0399b27_16"
    },
    {
        "source_sentence": "龍王供養，夜叉王守護，乾闥婆王讚歎，阿脩羅王曲躬頂禮，迦樓羅王以清淨心散諸寶華，",
        "translation": "The king of the nāga kings offered support, while the king of yakṣas guarded it. The king of gandharva praised it. The king of asuras bowed his head in respect and greeted him. The king of garuḍas scattered jeweled flowers with a pure heart.",
        "source": "T10n0279_073:0399b28_17"
    },
    {
        "source_sentence": "緊那羅王歡喜勸請，摩睺羅伽王一心瞻仰，來入彼會。",
        "translation": "The king of kiṃnara was delighted and encouraged, and King Mātṛkā singlemindedly gazed at him as he came into the assembly.",
        "source": "T10n0279_073:0399c01_18"
    },
    {
        "source_sentence": "「爾時，太子及諸大眾，遙見佛來，端嚴殊特，諸根寂定如調順象，心無垢濁如清淨池，",
        "translation": "At that time the prince and the members of the assembly saw the Buddha approaching them from a distance. Their features were extraordinarily beautiful, their faculties as calm and tranquil as those of a tamed elephant, and their minds as pure and clear as a pool of pure water.",
        "source": "T10n0279_073:0399c02_19"
    },
    {
        "source_sentence": "現大神通，示大自在，顯大威德，種種相好莊嚴其身，放大光明普照世界，",
        "translation": "He manifested great mystic powers, showed great freedom, displayed great majestic virtue, adorned his body with various features and embellishments, emanating great light illumining all worlds.",
        "source": "T10n0279_073:0399c04_20"
    },
    {
        "source_sentence": "一切毛孔出香焰雲，震動十方無量佛剎，隨所至處普雨一切諸莊嚴具；",
        "translation": "All the pores of his hair produced clouds of fragrant flames that shook innumerable buddha-lands in the ten directions, showering rain on all adornments wherever they went.",
        "source": "T10n0279_073:0399c06_21"
    },
    {
        "source_sentence": "以佛威儀，以佛功德，眾生見者，心淨歡喜，煩惱銷滅。",
        "translation": "Because of the Buddha’s comportment and because of the Buddha’s virtues, all sentient beings who saw them were purely joyful and their defilements vanished.",
        "source": "T10n0279_073:0399c08_22"
    },
    {
        "source_sentence": "「爾時，太子及諸大眾五體投地，頂禮其足，安施床座，合掌白言：『善來世尊！",
        "translation": "At that point, the prince and the other members of the assembly prostrated themselves on the ground five-legged, bowed their heads at their feet, arranged their seats, joined their palms, and said, 'Well come, Bhagavān!",
        "source": "T10n0279_073:0399c09_23"
    },
    {
        "source_sentence": "善來善逝！",
        "translation": "Well come, well gone!",
        "source": "T10n0279_073:0399c11_24"
    },
    {
        "source_sentence": "唯願哀愍，攝受於我，處于此座！』",
        "translation": "Please take pity on me and put me here at your seat!'",
        "source": "T10n0279_073:0399c11_25"
    },
    {
        "source_sentence": "以佛神力，淨居諸天即變此座為香摩尼蓮華之座。",
        "translation": "By the Buddha's miraculous power, the gods of the Pure Land transformed this throne into a lotus seat of fragrant maṇi lotus flowers.",
        "source": "T10n0279_073:0399c12_26"
    },
    {
        "source_sentence": "佛坐其上，諸菩薩眾亦皆就座周匝圍遶。",
        "translation": "When the Buddha was seated on it, all the bodhisattvas also took their seats and circumambulated him.",
        "source": "T10n0279_073:0399c13_27"
    },
    {
        "source_sentence": "時，彼會中一切眾生，因見如來，苦滅障除，堪受聖法。",
        "translation": "At the time, all the sentient beings in that assembly had seen the Tathāgata, extinguished their hindrances of suffering, and were capable of receiving the noble teaching.",
        "source": "T10n0279_073:0399c14_28"
    },
    {
        "source_sentence": "「爾時，如來知其可化，以圓滿音，說修多羅，名：普照因輪，令諸眾生隨類各解。",
        "translation": "“At that time the Buddha, knowing what he could teach, spoke in perfect tones a discourse called Universal Illumination of Causes and Circles, enabling sentient beings to understand each one according to their type.",
        "source": "T10n0279_073:0399c15_29"
    },
    {
        "source_sentence": "時，彼會中有八十那由他眾生，遠塵離垢，得法眼淨；",
        "translation": "In that assembly, there were eighty billion sentient beings who had attained purity of the eye of truth through detachment from defilement.",
        "source": "T10n0279_073:0399c17_30"
    },
    {
        "source_sentence": "無量那由他眾生，得無學地；",
        "translation": "Countless millions of sentient beings attain the state of post learners.",
        "source": "T10n0279_073:0399c18_31"
    },
    {
        "source_sentence": "十千眾生，住大乘道，入普賢行，成滿大願。",
        "translation": "Ten thousand sentient beings abide in the great vehicle path, enter the practice of Samantabhadra, and fulfill the great vow.",
        "source": "T10n0279_073:0399c18_32"
    },
    {
        "source_sentence": "當爾之時，十方各百佛剎微塵數眾生，於大乘中，心得調伏；",
        "translation": "At that time sentient beings, as numerous as atoms in a hundred buddha-lands in each of the ten directions, were mentally disciplined in the Great Vehicle.",
        "source": "T10n0279_073:0399c19_33"
    },
    {
        "source_sentence": "無量世界一切眾生，免離惡趣，生於天上。",
        "translation": "All sentient beings in measureless worlds are freed from bad destinies and are born in heaven.",
        "source": "T10n0279_073:0399c21_34"
    },
    {
        "source_sentence": "善伏太子即於此時，得菩薩教化眾生令生善根解脫門。",
        "translation": "At that point, Prince Sunetra attained the liberation gate of the bodhisattva's ability to teach sentient beings and cause them to give rise to good roots.",
        "source": "T10n0279_073:0399c22_35"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0399c23_36"
    },
    {
        "source_sentence": "爾時太子豈異人乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T10n0279_073:0399c23_37"
    },
    {
        "source_sentence": "我身是也。",
        "translation": "This is the self-body.",
        "source": "T10n0279_073:0399c24_38"
    },
    {
        "source_sentence": "我因往昔起大悲心，捨身命財救苦眾生，開門大施供養於佛，得此解脫。",
        "translation": "Because of my great compassion in the past, I gave up my body, life, wealth, and property to save suffering sentient beings, opened my doors, made a great gift, and offered them to the Buddha, and attained this liberation.",
        "source": "T10n0279_073:0399c24_39"
    },
    {
        "source_sentence": "佛子當知，我於爾時，但為利益一切眾生，不著三界，不求果報，不貪名稱，",
        "translation": "“Buddha-child, you should know that at that time I served all sentient beings for my own sake without attachment to the three realms, without seeking reward or reward, and without craving fame.",
        "source": "T10n0279_073:0399c26_40"
    },
    {
        "source_sentence": "不欲自讚輕毀於他，於諸境界無所貪染、無所怖畏，但莊嚴大乘出要之道，",
        "translation": "They do not wish to praise themselves or disparage others; they have no craving or fear for objects, but adorn the transcendent ways of the Great Vehicle.",
        "source": "T10n0279_073:0399c27_41"
    },
    {
        "source_sentence": "常樂觀察一切智門，修行苦行，得此解脫。",
        "translation": "He always delights in observing the gate of omniscience, cultivates austerities, and attains this liberation.",
        "source": "T10n0279_073:0399c29_42"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0400a01_43"
    },
    {
        "source_sentence": "於汝意云何，彼時五百大臣，欲害我者，豈異人乎？",
        "translation": "What do you think? Are the five hundred ministers there who wanted to harm me, or are they different people?",
        "source": "T10n0279_073:0400a01_44"
    },
    {
        "source_sentence": "今提婆達多等五百徒黨是也。",
        "translation": "These were the five hundred disciples of Devadatta and others.",
        "source": "T10n0279_073:0400a02_45"
    },
    {
        "source_sentence": "是諸人等，蒙佛教化，皆當得阿耨多羅三藐三菩提，於未來世，過須彌山微塵數劫，",
        "translation": "These people will all attain highest, complete enlightenment through the edification of Buddhahood. In the future it will be as many eons as there are grains of dust in the polar mountain.",
        "source": "T10n0279_073:0400a03_46"
    },
    {
        "source_sentence": "爾時有劫，名：善光，世界名：寶光，於中成佛。",
        "translation": "At that time there was an eon called Light of Virtue, in which a world called Jewel Light became buddha.",
        "source": "T10n0279_073:0400a05_47"
    },
    {
        "source_sentence": "其五百佛次第興世，最初如來，名曰：大悲；",
        "translation": "Among those five hundred buddhas, the first was a buddha named Great Compassion.",
        "source": "T10n0279_073:0400a06_48"
    },
    {
        "source_sentence": "第二，名：饒益世間；",
        "translation": "The second is called benefiting the world.",
        "source": "T10n0279_073:0400a07_49"
    },
    {
        "source_sentence": "第三，名：大悲師子；",
        "translation": "The third is called Great Compassionate Lion.",
        "source": "T10n0279_073:0400a07_50"
    },
    {
        "source_sentence": "第四，名：救護眾生；",
        "translation": "The fourth is called rescuing sentient beings.",
        "source": "T10n0279_073:0400a07_51"
    },
    {
        "source_sentence": "乃至最後，名曰：醫王。",
        "translation": "At the end, he's called King of Healing.",
        "source": "T10n0279_073:0400a08_52"
    },
    {
        "source_sentence": "雖彼諸佛大悲平等，然其國土、種族、父母、受生、誕生、出家、學道、往詣道場、轉正法輪、說修多羅、語言、音聲、光明、眾會、壽命、法住及其名號，",
        "translation": "Although the great compassion of those buddhas is equal, their lands, clans, parents, births, births at birth, leaving home, training in the path, going to the site of enlightenment, turning the wheel of the right teaching, preaching sutras, speech, sound, light, congregations, life spans, Dharma abodes, and names.",
        "source": "T10n0279_073:0400a08_53"
    },
    {
        "source_sentence": "各各差別。",
        "translation": "Each is distinct.",
        "source": "T10n0279_073:0400a11_54"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0400a12_55"
    },
    {
        "source_sentence": "彼諸罪人，我所救者，即拘留孫等賢劫千佛，及百萬阿僧祇諸大菩薩——於無量精進力名稱功德慧如來所，",
        "translation": "Those sinners, whom I rescue, are the Krakucchanda and other thousand buddhas of the good eon, as well as millions of incalculable great bodhisattvas-at the Tathāgata of Immeasurable Energy, Renown, Virtue, and Wisdom.",
        "source": "T10n0279_073:0400a12_56"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心，今於十方國土，行菩薩道，修習增長此菩提，",
        "translation": "Having set their minds on unexcelled complete perfect enlightenment, they now practice the path of enlightening beings in the lands of the ten directions, cultivating and increasing this enlightenment.",
        "source": "T10n0279_073:0400a14_57"
    },
    {
        "source_sentence": "教化眾生，令生善根解脫者是。",
        "translation": "He who teaches sentient beings and causes them to give rise to the liberation of good roots.",
        "source": "T10n0279_073:0400a16_58"
    },
    {
        "source_sentence": "時勝光王，今薩遮尼乾子大論師是。",
        "translation": "At the time, King Vaiśravaṇa was the present-day Mahāprajñāpāramitā master Sthavira Nirgrantha.",
        "source": "T10n0279_073:0400a17_59"
    },
    {
        "source_sentence": "時王宮人及諸眷屬，即彼尼乾六萬弟子——與師俱來，建大論幢，共佛論議，",
        "translation": "The king’s palace officials and their retinues, that is, the sixty thousand disciples of the Nirgrantha who had come with his teacher, erected a great debating banner to debate with the Buddha.",
        "source": "T10n0279_073:0400a17_60"
    },
    {
        "source_sentence": "悉降伏之，授阿耨多羅三藐三菩提記者是。",
        "translation": "They all subdued them and gave them the assurance of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_073:0400a19_61"
    },
    {
        "source_sentence": "此諸人等，皆當作佛，國土莊嚴、劫數、名號，各各有異。",
        "translation": "These people will all become buddhas, and the adornments of their lands, eons, and names will each differ.",
        "source": "T10n0279_073:0400a20_62"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0400a21_63"
    },
    {
        "source_sentence": "我於爾時救罪人已，父母聽我捨離國土、妻子、財寶，於法輪音虛空燈王佛所出家學道。",
        "translation": "After I rescued the sinners at that point, my parents heard me abandon their land, wife, property, and treasures to leave home and train in the path at the Dharma wheel-sounding space-shining king buddha's place.",
        "source": "T10n0279_073:0400a21_64"
    },
    {
        "source_sentence": "五百歲中，淨修梵行，即得成就百萬陀羅尼、百萬神通、百萬法藏、百萬求一切智勇猛精進，",
        "translation": "At the age of five hundred he cultivated pure religious practices, perfecting a million dhāraṇīs, a million supernormal powers, a million stores of doctrine, and a million vigorous efforts for omniscience.",
        "source": "T10n0279_073:0400a23_65"
    },
    {
        "source_sentence": "淨治百萬堪忍門，增長百萬思惟心，成就百萬菩薩力，入百萬菩薩智門，",
        "translation": "He purified a million doors of tolerance, developed a million thoughts, perfected a million powers of enlightening beings, and entered a million doors of knowledge of enlightening beings.",
        "source": "T10n0279_073:0400a26_66"
    },
    {
        "source_sentence": "得百萬般若波羅蜜門，見十方百萬諸佛，生百萬菩薩大願；",
        "translation": "Attaining one million doors of transcendent wisdom, they saw millions of buddhas in the ten directions and gave rise to millions of great vows of enlightening beings.",
        "source": "T10n0279_073:0400a27_67"
    },
    {
        "source_sentence": "念念中，十方各照百萬佛剎；",
        "translation": "Each moment of thought illumined a million buddha-lands in each of the ten directions.",
        "source": "T10n0279_073:0400a29_68"
    },
    {
        "source_sentence": "念念中，憶念十方世界前後際劫百萬諸佛；",
        "translation": "In each thought, they remembered the millions of buddhas of past, present, and future ages in the worlds of the ten directions.",
        "source": "T10n0279_073:0400a29_69"
    },
    {
        "source_sentence": "念念中，知十方世界百萬諸佛變化海；",
        "translation": "In each thought he knew the ocean of myriads of buddha-manifestations in the worlds of the ten directions.",
        "source": "T10n0279_073:0400b01_70"
    },
    {
        "source_sentence": "念念中，見十方百萬世界所有眾生種種諸趣，隨業所受生時、死時、善趣、惡趣、好色、惡色，",
        "translation": "In each mental moment of thought he saw the various states of beings in all the millions of worlds in the ten directions, born and dying according to their deeds, with good or bad destinies, happy or utterly happy.",
        "source": "T10n0279_073:0400b02_71"
    },
    {
        "source_sentence": "其諸眾生種種心行、種種欲樂、種種根性、種種業習、種種成就，皆悉明了。",
        "translation": "The various mental actions of those sentient beings, various desires and pleasures, various faculties and natures, various karmic habits, and various accomplishments are all clearly understood.",
        "source": "T10n0279_073:0400b04_72"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0400b06_73"
    },
    {
        "source_sentence": "我於爾時命終之後，還復於彼王家受生，作轉輪王，彼法輪音虛空燈王如來滅後，",
        "translation": "At that time, when my life came to an end, I was again reborn in the house of that king and became wheel-turning king. After the parinirvāṇa of the Tathāgata Dharma Cakravartin, Ākāśagarbha King,",
        "source": "T10n0279_073:0400b06_74"
    },
    {
        "source_sentence": "次即於此值法空王如來，承事供養；",
        "translation": "“Then the enlightening being Diamond Matrix said, “At that buddha-field I propitiated a buddha named Spacelike King of Truth.",
        "source": "T10n0279_073:0400b08_75"
    },
    {
        "source_sentence": "次為帝釋，即此道場值天王藏如來，親近供養；",
        "translation": "Next, as Indra, he propitiated this enlightenment site with the company of a buddha named Mahaparinirmita-vacana.",
        "source": "T10n0279_073:0400b09_76"
    },
    {
        "source_sentence": "次為夜摩天王，即於此世界值大地威力山如來，親近供養；",
        "translation": "Next, as the celestial king Yama, he propitiated a buddha named Mahāprajñāpāramitāmukhasamyak-saṃbuddha in this world.",
        "source": "T10n0279_073:0400b10_77"
    },
    {
        "source_sentence": "次為兜率天王，即於此世界值法輪光音聲王如來，親近供養；",
        "translation": "Next, as the celestial king Tuṣita, he propitiated a buddha named King Sound of the Light of the Wheel of the Teaching in this world.",
        "source": "T10n0279_073:0400b11_78"
    },
    {
        "source_sentence": "次為化樂天王，即於此世界值虛空智王如來，親近供養；",
        "translation": "Next, as a celestial king of enjoyment of emanation, he propitiated an enlightening being named Spacelike King of Knowledge in this world.",
        "source": "T10n0279_073:0400b13_0"
    },
    {
        "source_sentence": "次為他化自在天王，即於此世界值無能壞幢如來，親近供養；",
        "translation": "Next, as the celestial king Paranirmitavaśavartin, he propitiated a buddha named Unbreakable Banner in this world.",
        "source": "T10n0279_073:0400b14_1"
    },
    {
        "source_sentence": "次為阿脩羅王，即於此世界值一切法雷音王如來，親近供養；",
        "translation": "Next, as king of titans, he propitiated a buddha named King Thunder of All Truths in this world.",
        "source": "T10n0279_073:0400b15_2"
    },
    {
        "source_sentence": "次為梵王，即於此世界值普現化演法音如來，親近供養。",
        "translation": "Next, as the king of Brahmā, he meets the Tathāgata Universally Manifesting Teaching Dharma Sound in this world and makes offerings to him.",
        "source": "T10n0279_073:0400b17_3"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_073:0400b18_4"
    },
    {
        "source_sentence": "此寶光世界善光劫中，有一萬佛出興于世，我皆親近承事供養。",
        "translation": "In this world Jewel Light, in the eon of Good Light, ten thousand buddhas emerged in the world; I propitiated them by attending and serving them.",
        "source": "T10n0279_073:0400b18_5"
    },
    {
        "source_sentence": "次復有劫，名曰：日光，有六十億佛出興於世，最初如來，名：妙相山，",
        "translation": "“Next there is another eon called Sunlight, in which sixty billion buddhas emerged.",
        "source": "T10n0279_073:0400b20_6"
    },
    {
        "source_sentence": "我時為王，名曰：大慧，於彼佛所承事供養；",
        "translation": "At that time I was a king named Great Wisdom, serving and honoring those buddhas.",
        "source": "T10n0279_073:0400b21_7"
    },
    {
        "source_sentence": "次有佛出，名：圓滿肩，我為居士，親近供養；",
        "translation": "Next there was a buddha named Shoulder-Folding Buddha, whom I, householder, propitiated by becoming intimate with.",
        "source": "T10n0279_073:0400b22_8"
    },
    {
        "source_sentence": "次有佛出，名：離垢童子，我為大臣，親近供養；",
        "translation": "“Next there is a buddha named Undefiled Child, who emerges from the ten directions. As his ministers I draw near to him and offer my support.",
        "source": "T10n0279_073:0400b23_9"
    },
    {
        "source_sentence": "次有佛出，名：勇猛持，我為阿脩羅王，親近供養；",
        "translation": "“Next there is a buddha named Courageous Guide, from whom I, the king of titans, become intimate and honored.",
        "source": "T10n0279_073:0400b24_10"
    },
    {
        "source_sentence": "次有佛出，名：須彌相，我為樹神，親近供養；",
        "translation": "“Next there is a buddha named Form of the Polar Mountain, from which I, being a tree spirit, become intimate with and honoring him.",
        "source": "T10n0279_073:0400b25_11"
    },
    {
        "source_sentence": "次有佛出，名：離垢臂，我為商主，親近供養；",
        "translation": "“Next there is a buddha named Undefiled Arm, from which I, the chief merchant, become intimate with and honor him.",
        "source": "T10n0279_073:0400b26_12"
    },
    {
        "source_sentence": "次有佛出，名：師子遊步，我為城神，親近供養；",
        "translation": "“Next there was a buddha named Lion Walking Tour, from which I, the guardian goddess of the city, became intimate with and honored him.",
        "source": "T10n0279_073:0400b27_13"
    },
    {
        "source_sentence": "次有佛出，名為：寶髻，我為毘沙門天王，親近供養；",
        "translation": "“Next there was a buddha named Jewel Topknot, whom I propitiated as the celestial king Vaiśravaṇa.",
        "source": "T10n0279_073:0400b28_14"
    },
    {
        "source_sentence": "次有佛出，名：最上法稱，我為乾闥婆王，親近供養；",
        "translation": "“Next there is a buddha named Supreme Truth Banner, from which I, as king of the celestial palace, become intimate with and honor him.",
        "source": "T10n0279_073:0400b29_15"
    },
    {
        "source_sentence": "次有佛出，名：光明冠，我為鳩槃荼王，親近供養。",
        "translation": "Next there was a buddha named Crown of Light, from which I, king of the kumbhāṇḍas, propitiated him.",
        "source": "T10n0279_073:0400c01_16"
    },
    {
        "source_sentence": "「於彼劫中，如是次第有六十億如來出興於世。",
        "translation": "“In that eon, sixty billion tathāgatas emerged in the world in this order.",
        "source": "T10n0279_073:0400c02_17"
    },
    {
        "source_sentence": "我常於此受種種身，一一佛所親近供養，教化成就無量眾生；",
        "translation": "Here I always receive various bodies, becoming intimate with each buddha and honoring him. Teaching and developing innumerable sentient beings to attain enlightenment, I enter into the company of all buddhas.",
        "source": "T10n0279_073:0400c04_0"
    },
    {
        "source_sentence": "於一一佛所，得種種三昧門、種種陀羅尼門、種種神通門、種種辯才門、種種一切智門、種種法明門、種種智慧門，",
        "translation": "In the presence of each buddha, they attain various approaches to concentration, various approaches to spells, various approaches to mystic powers, various approaches to eloquence, various approaches to omniscience, various approaches to knowledge of all things, and various approaches to wisdom.",
        "source": "T10n0279_073:0400c05_1"
    },
    {
        "source_sentence": "照種種十方海，入種種佛剎海，見種種諸佛海，清淨成就，增長廣大。",
        "translation": "They illumine the various oceans of the ten directions, enter the various oceans of buddha-lands, and see the various oceans of buddhas, purely accomplished and growing in vastness.",
        "source": "T10n0279_073:0400c08_0"
    },
    {
        "source_sentence": "如於此劫中親近供養爾所諸佛，於一切處、一切世界海微塵數劫，所有諸佛出興于世，",
        "translation": "“Furthermore, just as in this world age they attended and honored buddhas of the ten directions for as many world ages as atoms in all the continents of the ten directions.",
        "source": "T10n0279_073:0400c09_1"
    },
    {
        "source_sentence": "親近供養，聽聞說法，信受護持，亦復如是。",
        "translation": "So it is with those who become intimate, make offerings, listen to the teaching, believe in and accept it, and preserve it.",
        "source": "T10n0279_073:0400c11_2"
    },
    {
        "source_sentence": "如是，一切諸如來所，皆悉修習此解脫門，復得無量解脫方便。」",
        "translation": "Thus, all the tathāgatas at their places cultivate this approach of liberation and also attain measureless liberation.",
        "source": "T10n0279_073:0400c12_3"
    },
    {
        "source_sentence": "「汝以歡喜信樂心，　　問此難思解脫法；",
        "translation": "“With joy and faith you ask about this inconceivable liberation.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　我承如來護念力，　　為汝宣說應聽受。",
        "translation": "Inherent is the power of the Buddha’s protective memory, By which I expound it for your sake.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　過去無邊廣大劫，　　過於剎海微塵數，",
        "translation": "The boundless, vast eon of the past Is as numerous as atoms in an ocean of worlds.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　時有世界名寶光，　　其中有劫號善光。",
        "translation": "At the time, there was a world named Jewel Light, in which there was an eon called Good Light.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　於此善光大劫中，　　一萬如來出興世，",
        "translation": "In this great eon of good light ten thousand buddhas emerged:",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　我皆親近而供養，　　從其修學此解脫。",
        "translation": "I become intimate with them and offer my support. From them I cultivate this liberation.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　時有王都名喜嚴，　　縱廣寬平極殊麗，",
        "translation": "At that time there was a capital city called Joyous Adornment, Exalted in width and depth but extremely beautiful.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　雜業眾生所居住，　　或心清淨或作惡。",
        "translation": "Where sentient beings with mixed karma live, Either their minds are pure or they do evil.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　爾時有王名勝光，　　恒以正法御群生；",
        "translation": "At that time there was a king named Supreme Light, Who ruled the sentient beings with the right teaching.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　其王太子名善伏，　　形體端正備眾相。",
        "translation": "The king's prince named Shanfu, whose body was shaped correctly and fully endowed with all characteristics.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　時有無量諸罪人，　　繫身牢獄當受戮；",
        "translation": "Measureless sinners of that time Will be tortured and slaughtered in the hell of bondage.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　太子見已生悲愍，　　上啟於王請寬宥。",
        "translation": "Seeing this, the prince became compassionate and asked the king to be pardoned.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　爾時諸臣共白王：　　『今此太子危王國，",
        "translation": "It was then that the ministers said to the king, “The prince is now in danger of encroaching upon the kingdom.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　如是罪人應受戮，　　如何悉救令除免？』",
        "translation": "Thus, these sinners should be slain, so how can they all be rescued and freed?'",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　時勝光王語太子：　　『汝救彼罪自當受！』",
        "translation": "King Vaiśravaṇa then said to the prince,'Save them and they'll be punished for their sins!'",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　太子哀念情轉深，　　誓救眾生無退怯。",
        "translation": "The prince's compassionate thoughts become deeper, and he vows to save sentient beings without retreating or shrinking.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　時王夫人采女等，　　俱來王所白王言：",
        "translation": "The king's wife, the nymphlike maidens, and others then came to the king's presence and said,",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "『願放太子半月中，　　布施眾生作功德。』",
        "translation": "'May the prince be released for half a month, and he bestows merit on sentient beings.'",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　時王聞已即聽許，　　設大施會濟貧乏，",
        "translation": "When the king heard this, he agreed to allow it and offered a great sacrifice to help the poor.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　一切眾生靡不臻，　　隨有所求咸給與。",
        "translation": "All sentient beings can't fail to reach them, and they give whatever they want.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　如是半月日云滿，　　太子就戮時將至，",
        "translation": "In the same way, on the day of the half-moon it is said to be full. When the prince has taken his deathbed he is about to arrive.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　大眾百千萬億人，　　同時瞻仰俱號泣。",
        "translation": "Hundreds of thousands of myriads of koṭis of people in the great assembly All looked up and wept.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　彼佛知眾根將熟，　　而來此會化群生，",
        "translation": "Knowing that all sentient beings’ faculties were maturing, the Buddha came to this assembly to enlighten sentient beings.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　顯現神變大莊嚴，　　靡不親近而恭敬。",
        "translation": "Manifesting great adornments of mystical displays, They all become intimate and respectful.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　佛以一音方便說，　　法燈普照修多羅，",
        "translation": "The Buddha teaches with skillful means in one voice: The lamp of truth illumines the sutras everywhere.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　無量眾生意柔軟，　　悉蒙與授菩提記。",
        "translation": "Innumerable beings’ business is flexible, And they are all given the prediction of enlightenment.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　善伏太子生歡喜，　　發興無上正覺心，",
        "translation": "The prince Sudarśana was delighted and aroused the mind of unsurpassed true enlightenment.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　誓願承事於如來，　　普為眾生作依處。",
        "translation": "I vow to serve the enlightened, Being a refuge for all sentient beings.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　便即出家依佛住，　　修行一切種智道，",
        "translation": "He then renounced the householder’s life and relied on the Buddha, Practicing all kinds of paths of knowledge.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　爾時便得此解脫，　　大悲廣濟諸群生。",
        "translation": "At that point, they'll attain this liberation, and their great compassion will save all sentient beings.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　於中止住經劫海，　　諦觀諸法真實性，",
        "translation": "In the ocean of eons of abiding, past, present, and future, They contemplate truthfully the reality of all things.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　常於苦海救眾生，　　如是修習菩提道。",
        "translation": "Always rescuing sentient beings in the sea of suffering, they thus cultivate the path of enlightenment.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　劫中所有諸佛現，　　悉皆承事無有餘，",
        "translation": "All the Buddhas that appear in all ages serve them, without exception.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　咸以清淨信解心，　　聽聞持護所說法。",
        "translation": "They all, with pure faith and understanding, Listened to the Teaching preached by hearing, retaining, and protecting.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　次於佛剎微塵數，　　無量無邊諸劫海，",
        "translation": "Next, as many eons as atoms in a buddha-land, Measureless and boundless:",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　所有諸佛現世間，　　一一供養皆如是。",
        "translation": "All the buddhas that appear in the worlds They present as offerings, each one like this.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　我念往昔為太子，　　見諸眾生在牢獄，",
        "translation": "I remember that in the past, as a prince, I saw all sentient beings in prison.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　誓願捨身而救護，　　因其證此解脫門。",
        "translation": "They vow to relinquish their bodies and rescue them, and because of that they realize this liberation.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　經於佛剎微塵數，　　廣大劫海常修習，",
        "translation": "Throughout as many eons as atoms in all buddha-lands They cultivate practice for as many eons.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　念念令其得增長，　　復獲無邊巧方便。",
        "translation": "Each thought causes them to grow, and they also attain boundless skillful means.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　彼中所有諸如來，　　我悉得見蒙開悟，",
        "translation": "All the buddhas there are I see and enlightened.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　令我增明此解脫，　　及以種種方便力。",
        "translation": "Let me increase this liberation and explain it to myself, as well as the various powers of skillful means.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　我於無量千億劫，　　學此難思解脫門；",
        "translation": "For immeasurable thousands of koṭis of kalpas I have studied this inconceivable liberation.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　諸佛法海無有邊，　　我悉一時能普飲。",
        "translation": "The ocean of the Buddhas’ teachings has no bounds: I can drink them all at once.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　十方所有一切剎，　　其身普入無所礙；",
        "translation": "All the lands in the ten directions His body enters everywhere without obstruction.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　三世種種國土名，　　念念了知皆悉盡。",
        "translation": "The names of the various lands of all times They instantly know.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　三世所有諸佛海，　　一一明見盡無餘；",
        "translation": "All the oceans of buddhas of all times They clearly see one by one, without exception.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　亦能示現其身相，　　普詣於彼如來所。",
        "translation": "They can also show their bodily features And go to the Buddha everywhere.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　又於十方一切剎，　　一切諸佛導師前，",
        "translation": "Furthermore, in all the buddha-lands of the ten directions, In front of all the Buddha Guides,",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　普雨一切莊嚴雲，　　供養一切無上覺。",
        "translation": "It rains all kinds of clouds of adornments everywhere, Making offerings to all the supremely enlightened.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　又以無邊大問海，　　啟請一切諸世尊；",
        "translation": "Also, by means of the boundless ocean of great questions They invoke all the world-honored ones.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　彼佛所雨妙法雲，　　皆悉受持無忘失。",
        "translation": "The cloud of the fine teaching rained by those buddhas They all receive and uphold without forgetting.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　又於十方無量剎，　　一切如來眾會前，",
        "translation": "Furthermore, in the infinite lands of the ten directions In front of the congregations of all enlightened ones",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　坐於眾妙莊嚴座，　　示現種種神通力。",
        "translation": "Sitting on a throne of myriad beautiful adornments, They show various spiritual powers.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　又於十方無量剎，　　示現種種諸神變，",
        "translation": "In countless lands in the ten directions They show various mystical displays.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　一身示現無量身，　　無量身中現一身。",
        "translation": "In one body he manifests infinite bodies; In infinite bodies he manifests one body.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　又於一一毛孔中，　　悉放無數大光明，",
        "translation": "In each pore They all radiate countless rays of light.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　各以種種巧方便，　　除滅眾生煩惱火。",
        "translation": "Each uses various skillful means to extinguish the fire of sentient beings' afflictions.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　又於一一毛孔中，　　出現無量化身雲，",
        "translation": "In each pore They show infinite clouds of emanation bodies:",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　充滿十方諸世界，　　普雨法雨濟群品。",
        "translation": "Filling all worlds in the ten directions, They rain down the rain of truth to save all beings.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　十方一切諸佛子，　　入此難思解脫門，",
        "translation": "All the Buddha-children of the ten directions Enter this inconceivable door of liberation.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　悉盡未來無量劫，　　安住修行菩薩行。",
        "translation": "To the end of innumerable eons in the future They will abide and practice enlightening beings’ practice.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　隨其心樂為說法，　　令彼皆除邪見網，",
        "translation": "Teaching the Dharma according to their mentalities and inclinations, Causing them all to be rid of the web of wrong views.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　示以天道及二乘，　　乃至如來一切智。",
        "translation": "It shows that it's because of the heavenly path and the two vehicles, up to the Tathāgata's omniscience.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　一切眾生受生處，　　示現無邊種種身，",
        "translation": "All sentient beings, wherever they are born, Manifest boundless various bodies:",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　悉同其類現眾像，　　普應其心而說法。",
        "translation": "They are all the same as each other, manifesting various forms; Teaching in accord with their mentalities, they teach.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　若有得此解脫門，　　則住無邊功德海，",
        "translation": "If there is anyone who has attained this door of liberation, They will abide in the boundless ocean of virtue.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "　譬如剎海微塵數，　　不可思議無有量。",
        "translation": "It's like the number of dust motes in an ocean of bases that are inconceivable and immeasurable.",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "爾時，救護一切眾生主夜神，欲重宣此解脫義，即為善財而說頌言：「善男子！",
        "translation": "At the time, the lord of the night goddess of salvation for all sentient beings wanted to reiterate the meaning of this liberation, so he spoke a verse for Sudhana, saying, Good man!",
        "source": "T10n0279_073:0400c13_4"
    },
    {
        "source_sentence": "我唯知此教化眾生令生善根解脫門。",
        "translation": "I only know this gate of liberation that teaches sentient beings and causes them to give rise to good roots.",
        "source": "T10n0279_073:0401b26_5"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，超諸世間，現諸趣身，不住攀緣，無有障礙，了達一切諸法自性，",
        "translation": "“Just as the great enlightening beings transcend all worlds, manifesting bodies in various states of existence, do not abide in clinging to objects, without obstruction, comprehending the essence of all things.",
        "source": "T10n0279_073:0401b27_6"
    },
    {
        "source_sentence": "善能觀察一切諸法，得無我智，證無我法，教化調伏一切眾生恒無休息，",
        "translation": "They are able to observe all phenomena, attain selfless knowledge, realize the principle of selflessness, and teach and tame all sentient beings without cease.",
        "source": "T10n0279_073:0401b28_7"
    },
    {
        "source_sentence": "心常安住無二法門，普入一切諸言辭海；",
        "translation": "Their minds always abide in the door of nonduality of truth, entering into all oceans of words.",
        "source": "T10n0279_073:0401c01_8"
    },
    {
        "source_sentence": "我今云何能知能說彼功德海、彼勇猛智、彼心行處、彼三昧境、彼解脫力？",
        "translation": "How can I now know and explain that ocean of virtue, that courageous knowledge, that mind's activity, that state of concentration, or the power of liberation?",
        "source": "T10n0279_073:0401c02_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_073:0401c04_10"
    },
    {
        "source_sentence": "此閻浮提，有一園林，名：嵐毘尼；",
        "translation": "In this continent there is a pleasure grove called Lumbinī.",
        "source": "T10n0279_073:0401c04_11"
    },
    {
        "source_sentence": "彼園有神，名：妙德圓滿。",
        "translation": "In that park there was a spirit named Splendor of Marvelous Virtue.",
        "source": "T10n0279_073:0401c05_0"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何修菩薩行、生如來家、為世光明，盡未來劫而無厭倦？」",
        "translation": "Go to them and ask, How do bodhisattvas cultivate the bodhisattva practices, are born in the Tathāgata's house, and become worldly illumination for all future eons without weariness?",
        "source": "T10n0279_073:0401c05_1"
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無量匝，合掌瞻仰，辭退而去。",
        "translation": "Then Sudhana went up to him, paid his respects, and departed. Thereupon, Bodhisattva Sadāparibhūta bowed his head at the Buddha’s feet and circumambulated him countless times.",
        "source": "T10n0279_073:0401c07_2"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第七十三",
        "translation": "Dafangguang fo huayan jing, vol. 73",
        "source": "T10n0279_073:0401c09_0"
    }
]