[
    {
        "source_sentence": "大方廣佛花嚴經修慈分一卷",
        "translation": "Dafangguang fo huayan jing xiuci fen 1 roll",
        "source": "T10n0306_001:0959a10_0"
    },
    {
        "source_sentence": "唐于闐三藏提雲般若等奉　制譯",
        "translation": "translated into Chinese by the Tang dynasty of the Tripitaka Master Tiyun Prajñāpāramitā and others",
        "source": "T10n0306_001:0959a12_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在王舍城鷲峯山中，與無量大菩薩眾俱，彌勒菩薩摩訶薩而為上首。",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Vulture Peak in the city of Rājagṛha, accompanied by an immeasurable great assembly of bodhisattvas, Maitreya Bodhisattva Mah",
        "source": "T10n0306_001:0959a13_0"
    },
    {
        "source_sentence": "爾時東方，有十億梵天，皆住慈心，來詣佛所，頂禮佛足，以眾妙供供養於佛。",
        "translation": "At the time, there were billions of Brahma gods in the east, all abiding in compassion, who came to the Buddha, bowed their heads at his feet, and offered various wonderful offerings to him.",
        "source": "T10n0306_001:0959a15_0"
    },
    {
        "source_sentence": "供養畢已，各自坐於眾福所生蓮華之座，恭敬尊重，瞻仰如來；",
        "translation": "Having completed their offerings, they each sat on the lotus seat of blessedness produced by various blessings, venerated and honored it, and gazed upon the Buddha.",
        "source": "T10n0306_001:0959a16_1"
    },
    {
        "source_sentence": "南西北方，四維上下，諸來梵天，皆亦如是。",
        "translation": "The same applies to the gods who have come from the brahma-heavens of the four intermediate directions, south, west, north, and upward.",
        "source": "T10n0306_001:0959a18_2"
    },
    {
        "source_sentence": "爾時諸梵天眾，在於佛所，各以慈目，遞相瞻顧；",
        "translation": "At that time the great multitude of Brahmā gods were in the presence of the Buddha, each looking out for the other with their compassionate eyes.",
        "source": "T10n0306_001:0959a20_0"
    },
    {
        "source_sentence": "復共同時，舒顏諦視，彌勒菩薩。",
        "translation": "When they were together again, they spread their faces and looked at Maitreya Bodhisattva.",
        "source": "T10n0306_001:0959a21_1"
    },
    {
        "source_sentence": "時彌勒菩薩摩訶薩，即從座起，偏袒右肩，長跪合掌，白佛言：「大德世尊，",
        "translation": "Maitreya then stood up from his seat, bared his right shoulder, knelt with joined palms, and said to the Buddha, Bhagavān,",
        "source": "T10n0306_001:0959a21_2"
    },
    {
        "source_sentence": "一切智者，於諸法性，能正覺了；",
        "translation": "“ Omniscience is the ability to perceive and comprehend the essence of all things.",
        "source": "T10n0306_001:0959a23_3"
    },
    {
        "source_sentence": "遍知眾生善惡之業，凡愚由此，生死往來；",
        "translation": "They know all the good and bad actions of sentient beings. As a result, ordinary ignorant people go from birth and death to and fro.",
        "source": "T10n0306_001:0959a24_4"
    },
    {
        "source_sentence": "善能開悟三乘之道，及以三乘，同歸一乘。",
        "translation": "He's well able to enlighten the path of the three vehicles and use the three vehicles to return to the same single vehicle.",
        "source": "T10n0306_001:0959a25_5"
    },
    {
        "source_sentence": "一切眾生，根性差別，及於煩惱纏蓋之中，有如來種，普皆明見，無有謬失。",
        "translation": "All sentient beings, with distinctions in their faculties and natures, as well as the tathāgata lineage within the afflictive fetters and hindrances, all clearly see without error.",
        "source": "T10n0306_001:0959a26_6"
    },
    {
        "source_sentence": "又知諸法皆悉是空，如夢如幻，如陽焰等，無有堅實；",
        "translation": "They also know all things are empty, like dreams, illusions, mirages, flames, and so forth, without any solidity.",
        "source": "T10n0306_001:0959a27_7"
    },
    {
        "source_sentence": "而大悲無盡，以善方便，令諸凡夫，見佛色身微妙之相；",
        "translation": "But great compassion is inexhaustible. By means of skillful means he causes worldlings to see the subtle and subtle features of the buddha’s physical body.",
        "source": "T10n0306_001:0959a28_8"
    },
    {
        "source_sentence": "佛身者，般若波羅蜜之所成就，自然真實，常住不變，猶如虛空。",
        "translation": "The buddha body is the accomplishment of the perfection of wisdom, which is naturally real and always abiding and unchanging like space.",
        "source": "T10n0306_001:0959b01_9"
    },
    {
        "source_sentence": "若有眾生，勤修福慧，不隨心識，馳騖於境，非如渴鹿於曠野中，追求陽焰以之為水；",
        "translation": "If there are any sentient beings who diligently practice virtue and wisdom but do not follow the mind or consciousness, they will run about in all directions like a thirsty lion in the wilderness, chasing its sunlight and using water as",
        "source": "T10n0306_001:0959b02_10"
    },
    {
        "source_sentence": "如是之人，則得見佛，恒聞說法，亦能依教，如理修行。",
        "translation": "Such people will then be able to see the Buddha. They will always hear and teach the Dharma, and they will also be able to rely on his instruction and practice it according to truth.",
        "source": "T10n0306_001:0959b04_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T10n0306_001:0959b05_12"
    },
    {
        "source_sentence": "我今欲於如來、應、正等覺少有所問，唯願慈哀，為我宣說。",
        "translation": "I now want to ask a few questions of the Tathāgata, Arhat, Perfectly Enlightened One. All I ask is that you have mercy and compassion and explain them to me.",
        "source": "T10n0306_001:0959b05_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T10n0306_001:0959b07_14"
    },
    {
        "source_sentence": "菩薩云何，於阿耨多羅三藐三菩提，少用功力，安樂無倦，而能速證廣大佛法？",
        "translation": "How can enlightening beings, having attained unexcelled complete perfect enlightenment, quickly realize the vast buddha-dharma without exerting effort or effort, with ease and without weariness?",
        "source": "T10n0306_001:0959b07_15"
    },
    {
        "source_sentence": "菩薩云何，在生死中，不受無量眾苦逼迫，於諸佛法速得圓滿？」",
        "translation": "How does a bodhisattva who is in birth and death and doesn't undergo measureless suffering and oppression quickly attain the fulfillment of the Buddha's teachings?",
        "source": "T10n0306_001:0959b08_16"
    },
    {
        "source_sentence": "爾時世尊，告彌勒菩薩摩訶薩言：「善哉彌勒！",
        "translation": "It was then that the Bhagavān addressed Maitreya Bodhisattva Mahāsattva, saying, Good, Maitreya!",
        "source": "T10n0306_001:0959b11_0"
    },
    {
        "source_sentence": "汝於我所，常有所問；",
        "translation": "You always asked me questions.",
        "source": "T10n0306_001:0959b12_0"
    },
    {
        "source_sentence": "今所問義，最順我心。",
        "translation": "The meaning of the question we're asking now is most consistent with self and mind.",
        "source": "T10n0306_001:0959b12_1"
    },
    {
        "source_sentence": "汝今哀愍諸天及人一切世間，無量眾生，多所利益，多所安樂，故能問我如是之義；",
        "translation": "Because you now have compassion for all the gods and humans in all worlds, for the benefit of countless sentient beings and their well-being, so ask me about such matters.",
        "source": "T10n0306_001:0959b12_2"
    },
    {
        "source_sentence": "吾當為汝，分別演說，令諸菩薩，不經勤苦，而能速疾證佛菩提。",
        "translation": "I will explain it in detail for you, so that all enlightening beings can quickly attain buddhahood without suffering or exerting themselves.",
        "source": "T10n0306_001:0959b14_3"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0306_001:0959b16_4"
    },
    {
        "source_sentence": "若有眾生，為求菩提，而修諸行，願常安樂者，應修慈心以自調伏。",
        "translation": "If there are sentient beings who cultivate practices in order to seek enlightenment and wish to always be comfortable, they should cultivate the mind of kindness to tame themselves.",
        "source": "T10n0306_001:0959b16_5"
    },
    {
        "source_sentence": "如是修習，於念念中，常具修行六波羅蜜，速能逮及諸忍之地，速得圓滿無上正覺，",
        "translation": "In every moment of thought they always practice the six transcendent ways, quickly attaining the state of patience and quickly realizing perfect enlightenment.",
        "source": "T10n0306_001:0959b17_6"
    },
    {
        "source_sentence": "具足十力、四無所畏、十八不共法、三十二相、八十種好，最上功德，",
        "translation": "They are endowed with the ten powers, the four fearlessnesses, the eighteen unique qualities, the thirty-two eminent marks, and the eighty-eight kinds of beauty.",
        "source": "T10n0306_001:0959b19_7"
    },
    {
        "source_sentence": "莊嚴其身；",
        "translation": "They adorned their bodies.",
        "source": "T10n0306_001:0959b21_8"
    },
    {
        "source_sentence": "盡於未來，常住安樂；",
        "translation": "In the future they will always abide in peace and happiness.",
        "source": "T10n0306_001:0959b21_9"
    },
    {
        "source_sentence": "亦能除滅，一切眾生無始已來諸業重障。",
        "translation": "It can also remove the heavy hindrances of all sentient beings' actions since beginningless time.",
        "source": "T10n0306_001:0959b22_0"
    },
    {
        "source_sentence": "「佛子，若諸菩薩，修習慈心，應在空閑寂靜之處，以清淨信，攝諸心法，",
        "translation": "“Furthermore, if enlightening beings cultivate the practice of benevolence, they should be in an empty place of peace and quietude, embracing all mental states with pure faith.",
        "source": "T10n0306_001:0959b22_1"
    },
    {
        "source_sentence": "觀察其身上下支節，皆微塵聚，地水火風和合所成；",
        "translation": "He observed that the lower limbs of his body were all clusters of dust motes, formed by the confluence of earth, water, fire, and wind.",
        "source": "T10n0306_001:0959b24_2"
    },
    {
        "source_sentence": "復應思惟，即彼一一微塵之內，皆有虛空；",
        "translation": "You should also think that within each atom there is space.",
        "source": "T10n0306_001:0959b25_3"
    },
    {
        "source_sentence": "是諸虛空，莫不悉以容受為相。",
        "translation": "All of these spaces are characterized by their containment.",
        "source": "T10n0306_001:0959b26_4"
    },
    {
        "source_sentence": "又應想念，彼諸微塵，清淨明徹外如瑠璃，內如紫金，莊嚴妙好，柔軟芬馥。",
        "translation": "You should also think of those tiny dust motes as pure, clear, penetrating externally like lapis lazuli and internally like purple gold, adorned with marvelous beauty and softness and fragrance.",
        "source": "T10n0306_001:0959b27_5"
    },
    {
        "source_sentence": "復應觀察一切世界所有眾生，一一眾生所有支節，一一支節所有微塵，",
        "translation": "You should also observe all the sentient beings in all worlds—all the limbs of each sentient being, and all the specks of dust that are found in each limb.",
        "source": "T10n0306_001:0959b28_6"
    },
    {
        "source_sentence": "皆亦如是。",
        "translation": "They're all likewise.",
        "source": "T10n0306_001:0959c01_7"
    },
    {
        "source_sentence": "若諸菩薩，於自他身一切眾生，作於如是決定解已，復應想念自身微塵，",
        "translation": "“Furthermore, if enlightening beings have such a certain understanding of all sentient beings in their own bodies and others’ bodies, they should also think of the tiny particles of themselves:",
        "source": "T10n0306_001:0959c01_8"
    },
    {
        "source_sentence": "一一塵中皆有佛國；",
        "translation": "In each atom there is a buddha-land.",
        "source": "T10n0306_001:0959c03_9"
    },
    {
        "source_sentence": "其中宮殿，瑠璃所成，白銀為門，黃金為柱，廣博崇麗，光影洞徹，寶堂間列，",
        "translation": "The palace there is made of lapis lazuli, with white silver gates and pillars in the shape of gold. Extensive and lofty, its light and shadow are so deep and penetrating that it has jeweled halls arranged between them.",
        "source": "T10n0306_001:0959c03_10"
    },
    {
        "source_sentence": "寶牆圍繞，寶閣寶樓，處處分布；",
        "translation": "Surrounded by walls of jewels, they are surrounded by jeweled pavilions and jeweled towers that are distributed from place to place.",
        "source": "T10n0306_001:0959c05_11"
    },
    {
        "source_sentence": "其中各有諸天寶床，重茵綺褥，敷置其上；",
        "translation": "Each of them had divine jeweled beds, richly draped and beautifully cushioned, arranged on which to sit.",
        "source": "T10n0306_001:0959c06_12"
    },
    {
        "source_sentence": "復有無量上好園苑，圍繞莊嚴；",
        "translation": "There were also innumerable other beautiful parks, surrounded and adorned.",
        "source": "T10n0306_001:0959c07_13"
    },
    {
        "source_sentence": "其園苑中，皆有浴池，悉以七寶而為提岸，黃金欄楯四面周匝，清泉長流引注其中，",
        "translation": "In each of the parks and gardens there are bathing ponds, all made of the seven kinds of treasure. The golden railings surrounded them on all four sides and the pure fountains flowed into them in a long stream.",
        "source": "T10n0306_001:0959c07_14"
    },
    {
        "source_sentence": "香末為泥，金沙間錯，八功德水，彌滿澄淨；",
        "translation": "The powder of fragrance is mud, mixed together like a patch of golden sand. The water of the eight kinds of virtue fills it with purity.",
        "source": "T10n0306_001:0959c09_15"
    },
    {
        "source_sentence": "波頭摩花、優鉢羅花、拘物頭花、分陀利花、菡萏開敷，周布其上；",
        "translation": "Padma flower, utpala flower, kumuda flower, puṇḍarīka flower, puṇḍarīka flower, and khaṭṭika flower bloomed all over it.",
        "source": "T10n0306_001:0959c10_16"
    },
    {
        "source_sentence": "其池四邊，多諸寶樹，真珠為花，光色滋榮；",
        "translation": "On the four sides of the pond there are many jeweled trees, with flowers made of genuine pearls shining brightly and prospering.",
        "source": "T10n0306_001:0959c12_17"
    },
    {
        "source_sentence": "其果成熟，香味具足，於諸樹下，置天寶座；",
        "translation": "The fruit ripened, endowed with fragrance and good odor, and was placed on a celestial jewel seat under the trees.",
        "source": "T10n0306_001:0959c13_18"
    },
    {
        "source_sentence": "一一座前，寶器行列，甘露美食，莫不充滿。",
        "translation": "In front of one pavilion was a row of jeweled vessels filled with delicious foods.",
        "source": "T10n0306_001:0959c14_19"
    },
    {
        "source_sentence": "復應想念，如是一切諸佛國土，青紺琉璃，以為其地，眾妙七寶，綺錯莊嚴；",
        "translation": "“Furthermore, all buddha-lands like these are made of blue, purple, and lapis lazuli; they are beautifully adorned with the seven kinds of treasure.",
        "source": "T10n0306_001:0959c15_0"
    },
    {
        "source_sentence": "是諸土中，所有微塵，清淨細妙，如天上寶，其光晃曜，如盛明日，其色美好如閻浮檀金，",
        "translation": "All the atoms in those continents were as pure and subtle as heavenly jewels, shining brightly like a glorious sun; their color was as beautiful as the gold of Jambudvīpa.",
        "source": "T10n0306_001:0959c16_1"
    },
    {
        "source_sentence": "香氣氛氳如烏羅伽栴檀，質性柔軟如迦旃延衣，觸著於身能生悅樂。",
        "translation": "Its fragrance and odor are like the smell of uroga sandalwood, its quality and softness are like kaṭiyāyana robes, and touching it to the body can give rise to pleasure.",
        "source": "T10n0306_001:0959c18_2"
    },
    {
        "source_sentence": "「作是觀已，即應想念，從此東方，一切世界，所有眾生，皆來入我諸佛國土宮殿之中；",
        "translation": "“After observing this, one should immediately think: All the sentient beings in all the worlds to the east of here have come to enter my palaces and halls of buddha-lands.",
        "source": "T10n0306_001:0959c20_3"
    },
    {
        "source_sentence": "南西北方，四維上下，彼諸世界，所有眾生，皆亦如是。",
        "translation": "The same applies to all beings in the worlds of the four intermediate directions: south, west, north, and upward.",
        "source": "T10n0306_001:0959c22_4"
    },
    {
        "source_sentence": "又應想念，如是六道一切眾生，皆同威儀，色相相似，其身柔軟常有香氣，",
        "translation": "“Furthermore, it should be known that all sentient beings in the six realms of rebirth are similar in appearance to each other. Their bodies are soft and supple but always fragrant.",
        "source": "T10n0306_001:0959c23_5"
    },
    {
        "source_sentence": "丈夫之相，具足莊嚴，離諸苦惱，受天快樂。",
        "translation": "The characteristics of a man are fully adorned, free from suffering and distress, and he experiences heavenly bliss.",
        "source": "T10n0306_001:0959c24_6"
    },
    {
        "source_sentence": "是諸眾生，若須衣服莊嚴之具，即時往詣劫波樹下，隨其所須，應念而得，",
        "translation": "If those sentient beings needed clothing and adornments, they immediately went to the foot of the ka\\/pa tree and obtained whatever they needed.",
        "source": "T10n0306_001:0959c25_7"
    },
    {
        "source_sentence": "種種眾具以為嚴好；",
        "translation": "They adorned themselves with various implements.",
        "source": "T10n0306_001:0959c27_8"
    },
    {
        "source_sentence": "譬如他化自在之天，復有香風從八方來，其風觸身，令心適悅，有諸樂器，",
        "translation": "Good man, this is analogous to the case with the god Paranirmitavaśavartin. Again, there is another wind of fragrance that blows from the eight directions in all directions. When it touches one’s body, the mind is",
        "source": "T10n0306_001:0959c28_9"
    },
    {
        "source_sentence": "無人撫擊，隨風迴動，出妙音聲。",
        "translation": "There was no one to stroke or strike it, but the wind moved in response to the sound and produced a subtle sound.",
        "source": "T10n0306_001:0959c29_10"
    },
    {
        "source_sentence": "是諸眾生或在宮殿、或遊園苑、或有食於諸天美食、或執寶器而飲甘露，",
        "translation": "These sentient beings may be in a palace, or they may travel to a park, or they may eat the delicious food of the gods, or they may hold precious vessels and drink sweet dew.",
        "source": "T10n0306_001:0960a01_11"
    },
    {
        "source_sentence": "或有坐於蓮花之臺，身佩瓔珞，兩邊垂下，財寶充滿，眾具備足，隨其所好，",
        "translation": "Some were seated on a lotus-flower dais, wearing jewelry and bedding, draped with jewels hanging down from both sides. All the bhikṣus had their feet provided for them according to their desires.",
        "source": "T10n0306_001:0960a03_12"
    },
    {
        "source_sentence": "種種歡娛，面目熙怡，身心悅懌，體常無病，盛年好色，不老不死，功德勢力，",
        "translation": "Their bodies are always free from ailments, and in full bloom they have good complexions. They neither grow old nor die; their virtues and powers empower them.",
        "source": "T10n0306_001:0960a04_13"
    },
    {
        "source_sentence": "皆同一類；",
        "translation": "They are all of one and the same type.",
        "source": "T10n0306_001:0960a06_14"
    },
    {
        "source_sentence": "無有為人之所使者，悉能摧滅婬怒愚癡，當證菩提，究竟安樂。",
        "translation": "The messengers of the uncreated can all destroy lust, anger, and folly, realize enlightenment, and ultimately become comfortable.",
        "source": "T10n0306_001:0960a06_15"
    },
    {
        "source_sentence": "「佛子，是修慈者，若在如是眾生之中，見一眾生於已有違，心緣於此，",
        "translation": "“Buddha-son, this is the cultivation of kindness. If one were to be among such sentient beings and see that a certain sentient being already has disobedience, his mind would think:",
        "source": "T10n0306_001:0960a08_0"
    },
    {
        "source_sentence": "不生愛念，則應以智慧，深自觀察，我往世中，定於此人，作重業障；",
        "translation": "If you don’t give rise to thoughts of desire, you should use your wisdom to profoundly examine for yourself. In a past life I always concentrated on this person as an obstacle created by heavy karma.",
        "source": "T10n0306_001:0960a09_1"
    },
    {
        "source_sentence": "以是因故，還於今日，障我菩提；",
        "translation": "Because of this cause, he returned today to prevent me from attaining enlightenment.",
        "source": "T10n0306_001:0960a11_2"
    },
    {
        "source_sentence": "我若於此人，不生歡喜，則於餘一切眾生之處，皆亦不應而作饒益。",
        "translation": "If I don't rejoice at this person, then I shouldn't give benefit to all the other sentient beings anywhere else.",
        "source": "T10n0306_001:0960a11_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0306_001:0960a13_4"
    },
    {
        "source_sentence": "以無始時來在生死中，無一眾生非於過去曾害我者；",
        "translation": "Since beginningless time there has not been a single sentient being in birth and death who did not harm me in the past.",
        "source": "T10n0306_001:0960a13_5"
    },
    {
        "source_sentence": "若於此眾生，不生憐愍，於餘一切，當亦復然。",
        "translation": "If he doesn't have pity for these sentient beings, it will be the same with all the others.",
        "source": "T10n0306_001:0960a14_6"
    },
    {
        "source_sentence": "我今普於一切眾生，皆行饒益，是故於此，決當慈念。",
        "translation": "I now act to benefit all sentient beings; therefore, you must definitely have compassion for me here.",
        "source": "T10n0306_001:0960a15_7"
    },
    {
        "source_sentence": "復應思惟，瞋恚因緣，能令眾生，墮於地獄，若懷怨結，後必生在毒蛇之中；",
        "translation": "Again, one should think: The causal condition of hatred can cause sentient beings to fall into hell. If they harbor the bond of enmity, they will surely be born among vipers and serpents in the future.",
        "source": "T10n0306_001:0960a16_8"
    },
    {
        "source_sentence": "若我來世，受斯報者，當令彼人，深快其意。",
        "translation": "If I were to receive this retribution in a future life, I would cause that person to deeply appreciate it.",
        "source": "T10n0306_001:0960a18_9"
    },
    {
        "source_sentence": "故應捨離所有瞋恚怨結之心。",
        "translation": "Therefore, they should abandon the mind that's free of all the bonds of anger and resentment.",
        "source": "T10n0306_001:0960a19_10"
    },
    {
        "source_sentence": "我若多瞋，及怨結者，十方現在諸佛世尊，皆應見我當作是念：『云何此人欲求菩提，",
        "translation": "World-Honored One, if I were to become angry and resentful, the buddhas and world-honored ones in the ten directions would all see me. They would think:",
        "source": "T10n0306_001:0960a20_11"
    },
    {
        "source_sentence": "而生瞋恚及以怨結？",
        "translation": "Instead, they give rise to anger and the bond of enmity?",
        "source": "T10n0306_001:0960a22_12"
    },
    {
        "source_sentence": "此愚癡人，以瞋恨故，於自諸苦不能解脫，何由能救一切眾生？』",
        "translation": "This foolish man, because of his anger and resentment, can't be liberated from his own sufferings; how could he save all sentient beings?'",
        "source": "T10n0306_001:0960a22_13"
    },
    {
        "source_sentence": "多瞋眾生，在在生中，所受之身，惡毒充滿；",
        "translation": "Many angry sentient beings are born in the world. The bodies they receive are filled with evil and poisonous poison.",
        "source": "T10n0306_001:0960a24_0"
    },
    {
        "source_sentence": "故應修習慈愍之心，永遠離於瞋恚怨結；",
        "translation": "Therefore, they should cultivate the mind of kindness and pity, forever getting rid of the bond of hatred and resentment.",
        "source": "T10n0306_001:0960a24_1"
    },
    {
        "source_sentence": "平等平等，利益安樂一切眾生。",
        "translation": "Equanimous and equal, it benefits and comforts all sentient beings.",
        "source": "T10n0306_001:0960a25_2"
    },
    {
        "source_sentence": "「若如是思惟，離瞋結已；",
        "translation": "“If someone thus reflects, they’ll be free of the bond of anger.",
        "source": "T10n0306_001:0960a26_3"
    },
    {
        "source_sentence": "次應想念，十方諸佛，與諸菩薩聲聞大眾，俱來入我諸佛國土宮殿之中。",
        "translation": "Next, you should think and remember that the buddhas of the ten directions, bodhisattvas, śrāvakas, and great assemblies have all come to enter the palace of my buddha-lands.",
        "source": "T10n0306_001:0960a27_4"
    },
    {
        "source_sentence": "是諸如來身量大小，過人一倍，具諸相好，端正香潔，以天衣服，莊嚴其身，",
        "translation": "The bodies of these buddhas were one and the same size as those of human beings. Endowed with all the marks and embellishments, they were handsome, fragrant, and beautiful, adorned with heavenly raiment.",
        "source": "T10n0306_001:0960a28_5"
    },
    {
        "source_sentence": "各各坐於千葉蓮花師子之座，一一無量眾所圍繞，覆以寶蓋，懸眾寶幡，",
        "translation": "Each of them sat on a lion seat of one thousand petals of lotus flowers, each surrounded by an immeasurable number of people. They covered themselves with jeweled canopies and hung various kinds of precious pennants.",
        "source": "T10n0306_001:0960b01_6"
    },
    {
        "source_sentence": "種種瓔珞，周匝垂布，有天樂器，不鼓自鳴，其音和雅，聞者喜悅，香風徐動，",
        "translation": "Various kinds of jewelry were draped all around it. There were celestial music instruments that sounded without drums, their voices harmonious and graceful, pleasing to the hearers as the fragrant breeze moved.",
        "source": "T10n0306_001:0960b03_7"
    },
    {
        "source_sentence": "吹諸寶樹，幢幡蓋網，瓔珞等物，出妙音聲歌讚如來種種功德；",
        "translation": "They blew jeweled trees, banners, pennants, canopies, nets, necklaces, and other things, producing sublime sounds singing praises of the Buddha’s various virtues.",
        "source": "T10n0306_001:0960b04_8"
    },
    {
        "source_sentence": "黃金為器，七寶莊嚴，其器光明，猶如日月，所有香氣，如堅黑栴檀，",
        "translation": "The vessel is made of gold and adorned with the seven kinds of treasure. The light emitted from the vessel is like the light of the sun and moon, and its fragrance resembles hard black sandalwood.",
        "source": "T10n0306_001:0960b06_9"
    },
    {
        "source_sentence": "甘露滿中，而以供養諸佛菩薩及聲聞眾，其諸菩薩阿羅漢等，皆於如來最上法中，",
        "translation": "In the midst of that ambrosia of immortality, he offered them to the buddhas, bodhisattvas, and śrāvakas. Those bodhisattvas and arhats were all devoted to the supreme dharma of the enlightened",
        "source": "T10n0306_001:0960b07_10"
    },
    {
        "source_sentence": "遊戲快樂。",
        "translation": "They're playing and happy.",
        "source": "T10n0306_001:0960b09_11"
    },
    {
        "source_sentence": "復應想念，一切眾生，皆於諸佛座前而坐，佛為演說修慈之行，如我今時之所修習，",
        "translation": "“Furthermore, all sentient beings should also think: All sentient beings are seated in front of the buddhas’ thrones. The Buddha expounded to them the practice of loving kindness, just as I am cultivating it now.",
        "source": "T10n0306_001:0960b09_12"
    },
    {
        "source_sentence": "言音美妙，悅可其心，令諸眾生，獲最上樂。",
        "translation": "Their words and sounds are beautiful and pleasing to the minds of sentient beings, enabling them to attain the supreme bliss.",
        "source": "T10n0306_001:0960b11_13"
    },
    {
        "source_sentence": "譬如有人，得甘露漿，而以洗沐，息除勞苦，形神休暢；",
        "translation": "Good man, this is analogous to someone who obtains the ambrosia of immortality and washes his body and soul with it. They are relieved of their fatigue and distress but their physical and mental well-being remains unchanged.",
        "source": "T10n0306_001:0960b12_14"
    },
    {
        "source_sentence": "此亦如是，以法霑心，滅諸煩惱，身心寂靜，永得安樂。",
        "translation": "In much the same way, with a mind imbued with attachment to doctrine, he extinguished all defilements and his body and mind were at ease, attaining peace and comfort.",
        "source": "T10n0306_001:0960b13_15"
    },
    {
        "source_sentence": "「復應想念，如是一切寶幢幡蓋，衣服等物，所有微塵，光明朗曜，出過於日，",
        "translation": "“Furthermore, you should also think: All these jeweled banners, pennants, canopies, robes, and so forth, as well as the tiny dust motes that shine brightly beyond the light of the sun,",
        "source": "T10n0306_001:0960b15_16"
    },
    {
        "source_sentence": "柔軟細滑，如觸天身，所出之香，如牛頭栴檀，其色清淨，如毘琉璃寶，",
        "translation": "It is as soft and fine as touching the body of a celestial being. The fragrance it produces is like ox-head sandalwood, pure in color like the vaiḍūrya jewel.",
        "source": "T10n0306_001:0960b16_17"
    },
    {
        "source_sentence": "一切物像，皆於中現。",
        "translation": "All things and images appear there.",
        "source": "T10n0306_001:0960b18_18"
    },
    {
        "source_sentence": "又應想念，彼諸如來，一一如來身之微塵，柔軟光色，轉加殊勝，比前微塵，",
        "translation": "“Furthermore, you should think: Each of these buddhas’ subtle particles in the body of each buddha has a soft, shining color that increases and becomes even more superior than the previous ones.",
        "source": "T10n0306_001:0960b18_19"
    },
    {
        "source_sentence": "踰百千倍。",
        "translation": "It's a hundred thousand times greater than that.",
        "source": "T10n0306_001:0960b20_20"
    },
    {
        "source_sentence": "復應觀察，我所思念，一切眾生，性空無我，如夢如幻，如陽焰如眩瞖，",
        "translation": "Again, you should observe that all sentient beings who think of self are inherently empty and without self, like dreams and illusions, like mirages and mirages.",
        "source": "T10n0306_001:0960b20_21"
    },
    {
        "source_sentence": "一切諸佛亦復如是，自性皆空本無有我。",
        "translation": "All buddhas are likewise, because their own natures are all empty and inherently without self.",
        "source": "T10n0306_001:0960b22_22"
    },
    {
        "source_sentence": "凡夫無智，於彼妄執，有我自性，是故不能解脫生死。",
        "translation": "Ordinary people lack knowledge and falsely believe that they have the self-nature of self. Because of this, they are unable to liberate themselves from birth and death.",
        "source": "T10n0306_001:0960b23_23"
    },
    {
        "source_sentence": "復應觀察，一切諸法，體相微細，皆悉空寂，凡夫之人，以自分別，生諸境界，",
        "translation": "Again, you should observe that all things, subtle and subtle in their essence, are all empty and void. Ordinary people give rise to perceptual objects by discriminating for themselves.",
        "source": "T10n0306_001:0960b24_24"
    },
    {
        "source_sentence": "自分別中，還自繫縛，乃至未了心之自性，齊爾許時，如在夢中，妄著諸境。",
        "translation": "In self-discriminating, they're still bound by themselves, even to the point where they don't understand the mind's own essence, just like when they're in a dream and are deludedly attached to objects.",
        "source": "T10n0306_001:0960b25_25"
    },
    {
        "source_sentence": "復應觀察，一切三界皆悉是空，空不礙空，我今慈心，猶為狹小。",
        "translation": "Again, you should observe that all three realms are all empty, and emptiness doesn't obstruct emptiness. Now, my compassionate mind is still narrow and small.",
        "source": "T10n0306_001:0960b27_26"
    },
    {
        "source_sentence": "又應思念，如一切眾生及以諸佛，性空無我，當知我身亦復如是，一切國土亦唯想念。",
        "translation": "Also, you should think that just as all sentient beings and buddhas are inherently empty and without self, know that my body is likewise, and all lands are only perceptions and thoughts.",
        "source": "T10n0306_001:0960b29_27"
    },
    {
        "source_sentence": "「作是解已，復應觀察，彼諸所有一切微塵，一一塵中，皆有三世諸佛國土，",
        "translation": "Having made this understanding, they should also observe that in each and every atom there are all the buddha-lands of past, present, and future.",
        "source": "T10n0306_001:0960c02_0"
    },
    {
        "source_sentence": "是諸國土，最極清淨，超過於前所有佛國，三世諸佛三世眾生，及以三世莊嚴之事，",
        "translation": "These lands were the most pure, surpassing all the buddha-lands of the past. The Buddhas and sentient beings of past, present, and future, as well as the adornments of the three worlds,",
        "source": "T10n0306_001:0960c03_1"
    },
    {
        "source_sentence": "皆悉具足。",
        "translation": "They are all fully endowed.",
        "source": "T10n0306_001:0960c05_2"
    },
    {
        "source_sentence": "三世劫數入於一念，一一念中，三世諸佛坐一切處，普現一切眾生之前，",
        "translation": "In each moment of thought the Buddhas of past, present, and future sat in all places, appearing before all sentient beings.",
        "source": "T10n0306_001:0960c05_3"
    },
    {
        "source_sentence": "或入禪定、或說妙法、或飡美食、或飲甘露，一一佛前，三世菩薩及阿羅漢，",
        "translation": "They may enter meditation, or teach the wondrous Dharma, or eat delicious foods, or drink sweet dew. In front of each buddha are bodhisattvas and arhats of all times.",
        "source": "T10n0306_001:0960c07_4"
    },
    {
        "source_sentence": "圍繞而坐，三世快樂，充滿其身；",
        "translation": "They were surrounded and seated, their bodies filled with the bliss of all times.",
        "source": "T10n0306_001:0960c09_5"
    },
    {
        "source_sentence": "亦自見身，在諸佛所，受於如是三世安樂。",
        "translation": "They also see their own bodies in the presence of buddhas and experience these kinds of peace and happiness in the three worlds.",
        "source": "T10n0306_001:0960c09_6"
    },
    {
        "source_sentence": "復應想念，一一念中，我三世身，各持無量上好供具，而以供養一切諸佛、菩薩聲聞，",
        "translation": "“Furthermore, you should think: In each and every thought of my body in the three time periods I have offered immeasurable offerings to all buddhas, enlightening beings, bodhisattvas, and disciples.",
        "source": "T10n0306_001:0960c10_7"
    },
    {
        "source_sentence": "及以施與眾生之類。",
        "translation": "It's because they give to sentient beings.",
        "source": "T10n0306_001:0960c12_8"
    },
    {
        "source_sentence": "於一一念，從其身出種種香雲，雲中復有無量寶蓋，莊嚴綺飾，彌覆一切諸佛如來菩薩聲聞，",
        "translation": "In each thought, clouds of various fragrances emerged from their bodies, and within those clouds were also infinitely many jeweled canopies, adorned and beautifully arrayed, covering all the buddhas, enlightening beings,",
        "source": "T10n0306_001:0960c13_9"
    },
    {
        "source_sentence": "及以六趣眾生之上。",
        "translation": "It's because it's above the sentient beings in the six destinies.",
        "source": "T10n0306_001:0960c15_10"
    },
    {
        "source_sentence": "其雲復雨天之甘露，及堅黑牛頭栴檀香末、曼陀羅花、摩訶曼陀羅花、波頭摩花、拘物頭花、芬陀利花、妙香花、妙意花，",
        "translation": "The clouds also rained heavenly ambrosia, as well as the firm black oxhead sandalwood powder, the maṇḍala flower, the mahāmandārava flower, the padma flower, the kumuda flower, the puṇ",
        "source": "T10n0306_001:0960c15_11"
    },
    {
        "source_sentence": "皆從空中，繽紛而墜；",
        "translation": "They all emerged from the sky and flew down in full bloom.",
        "source": "T10n0306_001:0960c18_12"
    },
    {
        "source_sentence": "電光烈曜，如日舒景，雷音震動，聞者悅豫；",
        "translation": "The sound of thunder shook the earth, and those who heard it were delighted.",
        "source": "T10n0306_001:0960c18_13"
    },
    {
        "source_sentence": "一切諸佛菩薩聲聞、及諸眾生，若行若住、若坐若臥，四威儀中，其身恒受最上安樂。",
        "translation": "All buddhas, bodhisattvas, śrāvakas, and sentient beings, whether walking, standing, sitting, or lying down, always experience the highest peace and comfort in their bodies among the four comportments.",
        "source": "T10n0306_001:0960c19_14"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0306_001:0960c21_15"
    },
    {
        "source_sentence": "譬如比丘，入遍處定，於一切物，皆作地解、水火風解，以如是解，攝持其心；",
        "translation": "“Good man, it is analogous to a bhikṣu who enters pervasive absorption and creates an understanding of earth in relation to all things as well as an understanding of water, fire, and wind. Through this understanding he maintains his mind",
        "source": "T10n0306_001:0960c21_16"
    },
    {
        "source_sentence": "修慈之人，亦復如是，以慈勝解，莊嚴攝持。",
        "translation": "A person who cultivates kindness is likewise, adorned and collected with the superior understanding of kindness.",
        "source": "T10n0306_001:0960c23_17"
    },
    {
        "source_sentence": "復應思惟，我今所與眾生安樂，但唯是想，如幻如化，譬如幻師作所幻事，",
        "translation": "Again, you should think: The comfort that I am now bestowing on sentient beings is nothing but perception, like magic or illusion, just as a magician creates illusory things.",
        "source": "T10n0306_001:0960c24_18"
    },
    {
        "source_sentence": "我亦如是，與諸眾生種種安樂。",
        "translation": "So it is with me, who brings various peace and happiness to sentient beings.",
        "source": "T10n0306_001:0960c26_19"
    },
    {
        "source_sentence": "又如幻物無有自性，一切眾生，亦復如是，本來無有我我所性。",
        "translation": "Also, just as illusory things have no self-nature, so all sentient beings are likewise, which originally had no self or what belonged to self.",
        "source": "T10n0306_001:0960c26_20"
    },
    {
        "source_sentence": "又如渴鹿，於陽焰中，妄生水想，勤苦奔逐，我心行慈，當知亦爾。",
        "translation": "You should know that it is like a thirsty deer in the midst of a mirage, which deludedly produces the thought of water and runs away in pain. My mind acts with kindness, just as I do.",
        "source": "T10n0306_001:0960c28_21"
    },
    {
        "source_sentence": "又如陽焰，水不可得，一切諸法，亦復如是，無有我性。",
        "translation": "Just as the water of a mirage is unobtainable, so are all dharmas likewise; they do not have self.",
        "source": "T10n0306_001:0960c29_22"
    },
    {
        "source_sentence": "又如夢中見種種物，夢心分別，謂為實事，及至覺時，了無所在，應知諸法皆亦復然。",
        "translation": "Also, just as when you see various things in a dream and the mind discerns them with a dream, which is to say that they are real things and don't exist at the time of awakening, it should be known that all dharmas are likewise.",
        "source": "T10n0306_001:0961a01_23"
    },
    {
        "source_sentence": "如瞖目者，於淨空中，見種種物，謂之為有，其人後得阿伽陀藥，治眼瞖盡，",
        "translation": "Suppose someone with cataracts sees various things in the clear sky and calls them existence. That person later obtains an agada medicine that will cure their cataracts, which are all gone.",
        "source": "T10n0306_001:0961a03_24"
    },
    {
        "source_sentence": "所見之物，悉皆隨滅；",
        "translation": "All the things he saw were destroyed accordingly.",
        "source": "T10n0306_001:0961a05_25"
    },
    {
        "source_sentence": "如是眾生，以有身見及邊見故，而有我想，若得智慧藥，滅除此見，所有我想，",
        "translation": "Thus, because sentient beings have belief in a self because of their belief in a self and extreme views, if they attain the medicine of wisdom to eradicate this view, all those beliefs will be destroyed.",
        "source": "T10n0306_001:0961a05_26"
    },
    {
        "source_sentence": "亦隨止息。",
        "translation": "It also follows the cessation of stopping.",
        "source": "T10n0306_001:0961a07_27"
    },
    {
        "source_sentence": "是故我應如是修慈，如從夢覺，離我我所。",
        "translation": "Therefore, I should thus cultivate kindness like awakening from a dream and be free of self and possessions.",
        "source": "T10n0306_001:0961a07_28"
    },
    {
        "source_sentence": "「佛子當知，此修慈者，乃至未能離於分別，未能不起我我所見，常得六種梵天之福；",
        "translation": "“Buddhist children, you should know that this kind of cultivation of benevolence does not lead to freedom from discrimination; it does not give rise to self or what belongs to self. They always attain the blessings of the six kinds of",
        "source": "T10n0306_001:0961a08_29"
    },
    {
        "source_sentence": "若捨分別，離我我所，此則名為廣大之慈，先世已來，所有罪障，皆得除滅，",
        "translation": "If one abandons discrimination and becomes free of self and what belongs to self, this is called great kindness. All the sins that have been committed since ancient times can be eradicated.",
        "source": "T10n0306_001:0961a10_30"
    },
    {
        "source_sentence": "不久當證無上菩提。",
        "translation": "Soon, he'll realize unsurpassed enlightenment.",
        "source": "T10n0306_001:0961a12_31"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0306_001:0961a12_32"
    },
    {
        "source_sentence": "一切菩薩，皆應如是修習慈心，汝以修慈，名為慈者。",
        "translation": "All bodhisattvas should thus cultivate the mind of kindness, and by cultivating kindness, you're called a benefactor of kindness.",
        "source": "T10n0306_001:0961a12_33"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0306_001:0961a14_34"
    },
    {
        "source_sentence": "若善男子、善女人，有得聞此修慈經者，則能銷滅無始時來諸惡業障，",
        "translation": "If there are sons and daughters of a virtuous family who hear this sutra on the cultivation of loving-kindness, they will be able to remove the hindrances caused by evil deeds from beginningless time.",
        "source": "T10n0306_001:0961a14_35"
    },
    {
        "source_sentence": "離眾病厄，為一切人之所愛敬，於其中間、或至臨終，必得奉見十方諸佛，",
        "translation": "Being free of all illnesses and afflictions, he is beloved by everyone. He will surely see the buddhas of the ten directions at some point in his life or when he reaches their end.",
        "source": "T10n0306_001:0961a15_36"
    },
    {
        "source_sentence": "及與授阿耨多羅三藐三菩提記，或得三昧、或得法忍、或得入於陀羅尼門，",
        "translation": "They may attain concentration, or they may attain tolerance of the Dharma, or they may enter the dhāraṇī teachings.",
        "source": "T10n0306_001:0961a17_37"
    },
    {
        "source_sentence": "其心安隱，無有死畏；",
        "translation": "Their minds are peaceful and they have no fear of dying.",
        "source": "T10n0306_001:0961a19_38"
    },
    {
        "source_sentence": "永離一切諸惡道苦，必生清淨極樂佛國。",
        "translation": "Being permanently free of all the sufferings of bad destinies, they'll surely be born in the pure and ultimately blissful Buddha land.",
        "source": "T10n0306_001:0961a19_39"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0306_001:0961a20_40"
    },
    {
        "source_sentence": "譬如有人，於三界中，盛滿七寶，日以三時，奉施如來，盡於一劫，其人功德，",
        "translation": "Good man, this is analogous to someone in the triple world who possesses all the seven kinds of treasure and presents it to the Tathāgata at three times a day for an entire kalpa.",
        "source": "T10n0306_001:0961a20_41"
    },
    {
        "source_sentence": "應知亦爾；",
        "translation": "So it should be known.",
        "source": "T10n0306_001:0961a22_42"
    },
    {
        "source_sentence": "何況有能修習之者，假使無量諸佛如來於一劫中，說其功德，猶不能盡。」",
        "translation": "How much more so if there are those who can cultivate it, even if measureless buddha-tathāgatas were to explain their merits for an eon in a single eon, they wouldn't be able to exhaust them.",
        "source": "T10n0306_001:0961a22_43"
    },
    {
        "source_sentence": "佛說此經已，彌勒菩薩摩訶薩，及十方國土諸來梵眾，皆大歡喜，信受奉行。",
        "translation": "After the Buddha taught this sūtra, Maitreya, the bodhisattva Mahāsattva, and the Brahmas from the lands in the ten directions were all greatly delighted and believed it and carried it out.",
        "source": "T10n0306_001:0961a24_44"
    },
    {
        "source_sentence": "大方廣佛花嚴經修慈分",
        "translation": "Dafangguang fo huayan jing xiuxiu qie",
        "source": "T10n0306_001:0961a26_0"
    }
]