[
    {
        "source_sentence": "大方廣佛華嚴經卷第十二",
        "translation": "Dafangguang fo huayan jing, vol. 12",
        "source": "T10n0279_012:0057c19_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_012:0057c21_0"
    },
    {
        "source_sentence": "如來名號品第七",
        "translation": "The Tathāgata's Name Chapter Seven",
        "source": "T10n0279_012:0057c22_0"
    },
    {
        "source_sentence": "爾時，世尊在摩竭提國阿蘭若法菩提場中，始成正覺，於普光明殿坐蓮華藏師子之座，",
        "translation": "At that time, the World-honored One was seated on a lotus bank lion throne in the palace of universal illumination at the site of enlightenment of the Teaching of the Dharma in the forest of the country of Magadha.",
        "source": "T10n0279_012:0057c23_0"
    },
    {
        "source_sentence": "妙悟皆滿，二行永絕；",
        "translation": "Marvelous enlightenment is all complete, and the two practices are forever extinguished.",
        "source": "T10n0279_012:0057c25_0"
    },
    {
        "source_sentence": "達無相法，住於佛住；",
        "translation": "They attain signlessness and abide in the abode of buddhahood.",
        "source": "T10n0279_012:0057c25_1"
    },
    {
        "source_sentence": "得佛平等，到無障處；",
        "translation": "They attain the equality of buddhas and arrive at the state of nonobstruction.",
        "source": "T10n0279_012:0057c26_0"
    },
    {
        "source_sentence": "不可轉法，所行無礙；",
        "translation": "The unmanifest dharmas are unobstructed in their action.",
        "source": "T10n0279_012:0057c26_1"
    },
    {
        "source_sentence": "立不思議，普見三世。",
        "translation": "He establishes the inconceivable and universal vision of the three worlds.",
        "source": "T10n0279_012:0057c27_0"
    },
    {
        "source_sentence": "與十佛剎微塵數諸菩薩俱，莫不皆是一生補處，悉從他方而共來集，普善觀察諸眾生界、法界、世界、涅槃界，",
        "translation": "He was accompanied by enlightening beings as numerous as atoms in ten buddha-lands, all of whom were remedial abodes for one lifetime. All came from other places and assembled together to observe the realm of sentient being",
        "source": "T10n0279_012:0057c27_1"
    },
    {
        "source_sentence": "諸業果報、心行次第、一切文義，世、出世間，有為、無為，過、現、未來。",
        "translation": "The results of actions, the order of mental functioning, and all texts and meanings are worldly and transmundane, conditioned and unconditioned, past, present, and future.",
        "source": "T10n0279_012:0058a01_0"
    },
    {
        "source_sentence": "時，諸菩薩作是思惟：「若世尊見愍我等，願隨所樂，開示佛剎、佛住、佛剎莊嚴、佛法性、佛剎清淨、佛所說法、佛剎體性、佛威德、佛剎成就、佛大菩提。",
        "translation": "The bodhisattvas then had this thought, Suppose the Bhagavān saw us and pityed us, wishing to reveal the buddha-stage, the Buddha's abode, the adornment of the buddha-stage, the Dharma",
        "source": "T10n0279_012:0058a02_1"
    },
    {
        "source_sentence": "如十方一切世界諸佛世尊，為成就一切菩薩故，令如來種性不斷故，救護一切眾生故，",
        "translation": "“Furthermore, just as the buddhas of all worlds in the ten directions develop all enlightening beings to attain enlightenment, so do they cause the lineage of buddhas not to be cut off and save all sentient beings",
        "source": "T10n0279_012:0058a05_2"
    },
    {
        "source_sentence": "令諸眾生永離一切煩惱故，了知一切諸行故，演說一切諸法故，淨除一切雜染故，",
        "translation": "Because they cause sentient beings to be forever free from all afflictions, because they know all actions, because they expound all teachings, because they purify and remove all defilements.",
        "source": "T10n0279_012:0058a07_3"
    },
    {
        "source_sentence": "永斷一切疑網故，拔除一切希望故，滅壞一切愛著處故，說諸菩薩十住、十行、十迴向、十藏、十地、十願、十定、十通、十頂，",
        "translation": "Because they permanently eliminate all webs of doubt, because they remove all hopes, and because they destroy all bases of attachment, they explain the ten abodes, ten practices, ten dedications, ten stores, ten stages, ten vows, ten",
        "source": "T10n0279_012:0058a09_4"
    },
    {
        "source_sentence": "及說如來地、如來境界、如來神力、如來所行、如來力、如來無畏、如來三昧、如來神通、如來自在、如來無礙、如來眼、如來耳、如來鼻、如來舌、如來身、如來意、如來辯才、如來智慧、如來最勝。",
        "translation": "It also explains the Tathāgata's ground, the Tathāgata's sphere, the Tathāgata's supernormal powers, the Tathāgata's actions, the Tathāgata's powers, the Tathāgata's fearless",
        "source": "T10n0279_012:0058a12_5"
    },
    {
        "source_sentence": "願佛世尊，亦為我說！」",
        "translation": "May the Bhagavān also explain it for me!",
        "source": "T10n0279_012:0058a16_6"
    },
    {
        "source_sentence": "爾時，世尊知諸菩薩心之所念，各隨其類，為現神通。",
        "translation": "At the time, the Bhagavān knew what the minds of the bodhisattvas were thinking, and each one manifested their supernormal abilities according to their type.",
        "source": "T10n0279_012:0058a18_0"
    },
    {
        "source_sentence": "現神通已，東方過十佛剎微塵數世界，有世界，名：金色，佛號：不動智。",
        "translation": "In the east, beyond as many worlds as atoms in ten buddha-lands after manifesting mystic powers, was a world called Golden Color, with a Buddha called Immutable Knowledge.",
        "source": "T10n0279_012:0058a19_1"
    },
    {
        "source_sentence": "彼世界中，有菩薩，名：文殊師利，與十佛剎微塵數諸菩薩俱，來詣佛所，",
        "translation": "In that world there was an enlightening being named Manjushri, accompanied by as many enlightening beings as atoms in ten buddha-lands, who came to the Buddha.",
        "source": "T10n0279_012:0058a20_2"
    },
    {
        "source_sentence": "到已作禮，即於東方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "When he arrived, he paid homage, transformed himself into a lotus-treasury lion's seat in the east, sat crosslegged, and sat crosslegged.",
        "source": "T10n0279_012:0058a22_3"
    },
    {
        "source_sentence": "南方過十佛剎微塵數世界，有世界，名：妙色，佛號：無礙智。",
        "translation": "In the south, past as many worlds as atoms in ten buddha-lands, was a world called Sublime Form, with a Buddha called Unhindered Knowledge.",
        "source": "T10n0279_012:0058a23_4"
    },
    {
        "source_sentence": "彼有菩薩，名曰：覺首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "There was an enlightening being there named Chief in Enlightenment, together with as many enlightening beings there as atoms in ten buddha-lands, approaching the Buddha and bowing to him.",
        "source": "T10n0279_012:0058a24_5"
    },
    {
        "source_sentence": "即於南方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "To the south, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058a26_6"
    },
    {
        "source_sentence": "西方過十佛剎微塵數世界，有世界，名：蓮華色，佛號：滅暗智。",
        "translation": "In the west, past as many worlds as atoms in ten buddha-lands, was a world called Lotus Blossom Color, with a Buddha called Darkness-cessating Knowledge.",
        "source": "T10n0279_012:0058a27_7"
    },
    {
        "source_sentence": "彼有菩薩，名曰：財首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "“There was an enlightening being there, named Chief in Goods, together with as many enlightening beings there as atoms in ten buddha-lands, who came to the Buddha and bowed at his feet.",
        "source": "T10n0279_012:0058a28_8"
    },
    {
        "source_sentence": "即於西方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "In the West, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058b01_9"
    },
    {
        "source_sentence": "北方過十佛剎微塵數世界，有世界，名：薝蔔華色，佛號：威儀智。",
        "translation": "In the north, past as many worlds as atoms in ten buddha-lands, was a world called campaka Flower Color, with a Buddha called Dignified Knowledge of Conduct.",
        "source": "T10n0279_012:0058b02_10"
    },
    {
        "source_sentence": "彼有菩薩，名曰：寶首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "There was an enlightening being there named Chief of the Jewel, accompanied by as many enlightening beings as atoms in ten buddha-lands, who came to the Buddha and bowed at his feet.",
        "source": "T10n0279_012:0058b04_11"
    },
    {
        "source_sentence": "即於北方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "To the north, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058b05_12"
    },
    {
        "source_sentence": "東北方過十佛剎微塵數世界，有世界，名：優鉢羅華色，佛號：明相智。",
        "translation": "To the northeast, past as many worlds as atoms in ten buddha-lands, was a world called utpala flower color. The Buddha there was called Knowledge of Characteristics.",
        "source": "T10n0279_012:0058b06_13"
    },
    {
        "source_sentence": "彼有菩薩，名：功德首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "There was an enlightening being there named Chief of Virtue, together with as many enlightening beings there as atoms in ten buddha-lands, approaching the Buddha and bowing to him.",
        "source": "T10n0279_012:0058b08_14"
    },
    {
        "source_sentence": "即於東北方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "To the northeast, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058b09_15"
    },
    {
        "source_sentence": "東南方過十佛剎微塵數世界，有世界，名：金色，佛號：究竟智。",
        "translation": "In the southeast, past as many worlds as atoms in ten buddha-lands, was a world called Golden Color, with a Buddha called Ultimate Knowledge.",
        "source": "T10n0279_012:0058b11_0"
    },
    {
        "source_sentence": "彼有菩薩，名：目首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "“There was an enlightening being there named Chief of Eyes, together with as many enlightening beings there as atoms in ten buddha-lands, approaching the Buddha and bowing to him.",
        "source": "T10n0279_012:0058b12_1"
    },
    {
        "source_sentence": "即於東南方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "To the southeast, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058b13_2"
    },
    {
        "source_sentence": "西南方過十佛剎微塵數世界，有世界，名：寶色，佛號：最勝智。",
        "translation": "In the southwest, past as many worlds as atoms in ten buddha-lands, was a world called Jewel Color, with a Buddha called Supreme Knowledge.",
        "source": "T10n0279_012:0058b15_0"
    },
    {
        "source_sentence": "彼有菩薩，名：精進首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "There was an enlightening being there named Chief in Energy, together with as many enlightening beings there as atoms in ten buddha-lands, approaching the Buddha and bowing to him.",
        "source": "T10n0279_012:0058b16_1"
    },
    {
        "source_sentence": "即於西南方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "To the southwest, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058b17_2"
    },
    {
        "source_sentence": "西北方過十佛剎微塵數世界，有世界，名：金剛色，佛號：自在智。",
        "translation": "In the northwest, past as many worlds as atoms in ten buddha-lands, was a world called Diamond Color, with a Buddha called Independent Knowledge.",
        "source": "T10n0279_012:0058b19_0"
    },
    {
        "source_sentence": "彼有菩薩，名：法首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "There was an enlightening being there named Chief of the Teaching, together with as many enlightening beings there as atoms in ten buddha-lands, approaching the Buddha and bowing to him.",
        "source": "T10n0279_012:0058b20_1"
    },
    {
        "source_sentence": "即於西北方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "To the northwest, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058b22_0"
    },
    {
        "source_sentence": "下方過十佛剎微塵數世界，有世界，名：玻瓈色，佛號：梵智。",
        "translation": "In the nadir, past as many worlds as atoms in ten buddha-lands, was a world called Crystal Color, with a Buddha called Pure Knowledge.",
        "source": "T10n0279_012:0058b23_1"
    },
    {
        "source_sentence": "彼有菩薩，名：智首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "There was an enlightening being there named Chief of Knowledge, together with as many enlightening beings there as atoms in ten buddha-lands, approaching the Buddha and bowing to him.",
        "source": "T10n0279_012:0058b24_2"
    },
    {
        "source_sentence": "即於下方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "At the bottom, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058b26_3"
    },
    {
        "source_sentence": "上方過十佛剎微塵數世界，有世界，名：平等色，佛號：觀察智。",
        "translation": "Above them, past as many worlds as atoms in ten buddha-lands, was a world called Equanimous Form; the Buddha there was called Observing Knowledge.",
        "source": "T10n0279_012:0058b27_4"
    },
    {
        "source_sentence": "彼有菩薩，名：賢首，與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，",
        "translation": "There was an enlightening being there named Chief of Goodness, together with as many enlightening beings there as atoms in ten buddha-lands, approaching the Buddha and bowing to him.",
        "source": "T10n0279_012:0058b28_5"
    },
    {
        "source_sentence": "即於上方化作蓮華藏師子之座，結跏趺坐。",
        "translation": "At the top, he transformed himself into a lotus-treasury lion seat and sat cross-legged.",
        "source": "T10n0279_012:0058c01_0"
    },
    {
        "source_sentence": "爾時，文殊師利菩薩摩訶薩，承佛威力，普觀一切菩薩眾會而作是言：「此諸菩薩甚為希有！",
        "translation": "At the time, Mañjuśrī Bodhisattva Mahāsattva, imbued with the Buddha's authority, surveyed all the assemblies of enlightening beings and said, These enlightening beings are extremely rare!",
        "source": "T10n0279_012:0058c03_0"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0058c05_1"
    },
    {
        "source_sentence": "佛國土不可思議，佛住、佛剎莊嚴、佛法性、佛剎清淨、佛說法、佛出現、佛剎成就、佛阿耨多羅三藐三菩提皆不可思議。",
        "translation": "The Buddha's land is inconceivable, the Buddha's abode, the adornment of his buddha-stage, the Buddha's Dharma nature, the purity of his buddha-stage, the Buddha's teaching, the Buddha",
        "source": "T10n0279_012:0058c05_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_012:0058c08_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0058c08_4"
    },
    {
        "source_sentence": "十方世界一切諸佛，知諸眾生樂欲不同，隨其所應，說法調伏，如是乃至等法界、虛空界。",
        "translation": "All the buddhas of the worlds in the ten directions know that the pleasures and desires of sentient beings are different, and they teach and tame them according to their needs, thus equal to the Dharma realm and the space realm.",
        "source": "T10n0279_012:0058c08_5"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0058c10_6"
    },
    {
        "source_sentence": "如來於此娑婆世界諸四天下，種種身、種種名、種種色相、種種修短、種種壽量、種種處所、種種諸根、種種生處、種種語業、種種觀察，",
        "translation": "In the four continents of this sahā world there are various bodies, various names, various forms and characteristics, various developments, various lifespans, various locations, various faculties, various birth places, various verbal actions, and various observations",
        "source": "T10n0279_012:0058c10_7"
    },
    {
        "source_sentence": "令諸眾生各別知見。",
        "translation": "It causes sentient beings to each know and see distinctly.",
        "source": "T10n0279_012:0058c13_8"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0058c14_9"
    },
    {
        "source_sentence": "如來於此四天下中，或名：一切義成，或名：圓滿月，或名：師子吼，",
        "translation": "In these four continents the Buddha may be called Completely Awakened in All Truths, or Full Moon, or Lion Roar.",
        "source": "T10n0279_012:0058c14_10"
    },
    {
        "source_sentence": "或名：釋迦牟尼，或名：第七仙，或名：毘盧遮那，或名：瞿曇氏，或名：大沙門，",
        "translation": "They may be called Sakyani, or Seventh Sage, or Vairocana, or Gautama, or Great Ascetic.",
        "source": "T10n0279_012:0058c15_11"
    },
    {
        "source_sentence": "或名：最勝，或名：導師……。",
        "translation": "Some are called Supreme; some are called Guides.",
        "source": "T10n0279_012:0058c17_12"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0058c17_13"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0058c18_14"
    },
    {
        "source_sentence": "此四天下東，次有世界，名為：善護。",
        "translation": "“East of these four continents is a world called Good Protection:",
        "source": "T10n0279_012:0058c18_15"
    },
    {
        "source_sentence": "如來於彼，或名：金剛，或名：自在，或名：有智慧，或名：難勝，或名：雲王，",
        "translation": "there the Buddha may be called Adamantine, or Independent, or Wise, or Unsurpassable, or King of Clouds.",
        "source": "T10n0279_012:0058c19_16"
    },
    {
        "source_sentence": "或名：無諍，或名：能為主，或名：心歡喜，或名：無與等，或名：斷言論……。",
        "translation": "It may be called noncontention, or the leader of enlightenment, or heart joy, or unequalled, or cutting off speech.",
        "source": "T10n0279_012:0058c21_17"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0058c22_18"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0058c23_19"
    },
    {
        "source_sentence": "此四天下南，次有世界，名為：難忍。",
        "translation": "“South of these four continents is a world called Unbearable:",
        "source": "T10n0279_012:0058c23_20"
    },
    {
        "source_sentence": "如來於彼，或名：帝釋，或名：寶稱，或名：離垢，或名：實語，或名：能調伏，",
        "translation": "there the Buddha may be called Indra, or Jewel Name, or Undefiled, or Truth Teller, or Able to Conquer.",
        "source": "T10n0279_012:0058c24_21"
    },
    {
        "source_sentence": "或名：具足喜，或名：大名稱，或名：能利益，或名：無邊，或名：最勝……。",
        "translation": "It may be called fulfilling joy, or great name, or able to benefit, or boundless, or supreme.",
        "source": "T10n0279_012:0058c26_22"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見「諸佛子！",
        "translation": "Tens of thousands of such things cause sentient beings to know and see each separately, saying, Children of Buddha!",
        "source": "T10n0279_012:0058c27_23"
    },
    {
        "source_sentence": "此四天下西，次有世界，名為：親慧。",
        "translation": "To the west of these four continents is a world called Proximate Wisdom:",
        "source": "T10n0279_012:0058c28_24"
    },
    {
        "source_sentence": "如來於彼，或名：水天，或名：喜見，或名：最勝王，或名：調伏天，",
        "translation": "“Then the Buddha there may be called Water God, or Joyful Vision, or Supreme King, or Self-controlling God.",
        "source": "T10n0279_012:0058c29_25"
    },
    {
        "source_sentence": "或名：真實慧，或名：到究竟，或名：歡喜，或名：法慧，或名：所作已辦，",
        "translation": "It may be called true wisdom, or ultimate attainment, or joy, or knowledge of principles, or having done what should be done.",
        "source": "T10n0279_012:0059a01_26"
    },
    {
        "source_sentence": "或名：善住。",
        "translation": "Or it may be called good abode.",
        "source": "T10n0279_012:0059a03_27"
    },
    {
        "source_sentence": "……如是等，其數十千，令諸眾生各別知見。",
        "translation": "Such are the tens of thousands of such things, which cause sentient beings to know and see separately.",
        "source": "T10n0279_012:0059a03_28"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059a04_29"
    },
    {
        "source_sentence": "此四天下北，次有世界，名：有師子。",
        "translation": "“North of these four continents is a world called Lion-like:",
        "source": "T10n0279_012:0059a04_30"
    },
    {
        "source_sentence": "如來於彼，或名：大牟尼，或名：苦行，或名：世所尊，或名：最勝田，",
        "translation": "there the Buddha may be called Great Sage, or Ascetic, or Honored One, or Supreme Field.",
        "source": "T10n0279_012:0059a05_31"
    },
    {
        "source_sentence": "或名：一切智，或名：善意，或名：清淨，或名：瑿羅跋那，或名：最上施，",
        "translation": "It may be called omniscience, or good intentions, or purity, or relinquishment, or supreme giving.",
        "source": "T10n0279_012:0059a06_32"
    },
    {
        "source_sentence": "或名：苦行得……。",
        "translation": "Or it may be called attainment by ascetic practices.",
        "source": "T10n0279_012:0059a08_0"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0059a08_1"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059a09_2"
    },
    {
        "source_sentence": "此四天下東北方，次有世界，名：妙觀察。",
        "translation": "“North of these four continents is a world called Marvelous Observing:",
        "source": "T10n0279_012:0059a09_3"
    },
    {
        "source_sentence": "如來於彼，或名：調伏魔，或名：成就，或名：息滅，或名：賢天，或名：離貪，",
        "translation": "there the Buddha may be called Taming Māra, or Accomplishment, or Extinction of Cessation, or Celestial Virtue, or freedom from craving.",
        "source": "T10n0279_012:0059a10_4"
    },
    {
        "source_sentence": "或名：勝慧，或名：心平等，或名：無能勝，或名：智慧音，或名：難出現……。",
        "translation": "It may be called superior wisdom, or equality of mind, or invincibility, or sound of knowledge, or difficult to appear.",
        "source": "T10n0279_012:0059a11_5"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0059a13_6"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059a14_7"
    },
    {
        "source_sentence": "此四天下東南方，次有世界，名為：喜樂。",
        "translation": "“Southeast of these four continents is a world called Joy and Bliss:",
        "source": "T10n0279_012:0059a14_8"
    },
    {
        "source_sentence": "如來於彼，或名：極威嚴，或名：光焰聚，或名：遍知，或名：祕密，",
        "translation": "there the Buddha may be called Supreme Majesty, or Mass of Flames of Light, or Universal Knower, or esoteric.",
        "source": "T10n0279_012:0059a15_9"
    },
    {
        "source_sentence": "或名：解脫，或名：性安住，或名：如法行，或名：淨眼王，或名：大勇健，",
        "translation": "Some are called liberation, some called peaceful abiding by nature, some called practicing according to the teachings, some called King of Pure Eyes, or Great Courageous One.",
        "source": "T10n0279_012:0059a16_10"
    },
    {
        "source_sentence": "或名：精進力……。",
        "translation": "Or it may be called the power of effort.",
        "source": "T10n0279_012:0059a17_11"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0059a18_12"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059a19_13"
    },
    {
        "source_sentence": "此四天下西南方，次有世界，名：甚堅牢。",
        "translation": "To the southwest of these four continents is a world called Very Firm.",
        "source": "T10n0279_012:0059a19_14"
    },
    {
        "source_sentence": "如來於彼，或名：安住，或名：智王，或名：圓滿，或名：不動，或名：妙眼，",
        "translation": "there the Buddha may be called peaceful abode, or king of knowledge, or fulfillment, or unshakable, or marvelous eye.",
        "source": "T10n0279_012:0059a20_15"
    },
    {
        "source_sentence": "或名：頂王，或名：自在音，或名：一切施，或名：持眾仙，或名：勝須彌……。",
        "translation": "It may be called king of the top, or independent voice, or all giving, or keeping sages, or Supreme Mountain.",
        "source": "T10n0279_012:0059a21_16"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0059a23_0"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059a24_0"
    },
    {
        "source_sentence": "此四天下西北方，次有世界，名為：妙地。",
        "translation": "To the northwest of these four continents is a world called Wonderful Earth:",
        "source": "T10n0279_012:0059a24_1"
    },
    {
        "source_sentence": "如來於彼，或名：普遍，或名：光焰，或名：摩尼髻，或名：可憶念，",
        "translation": "there the Buddha may be called Universal, or Flame of Light, or Jewel Topknot, or Rememberable.",
        "source": "T10n0279_012:0059a25_2"
    },
    {
        "source_sentence": "或名：無上義，或名：常喜樂，或名：性清淨，或名：圓滿光，或名：脩臂，",
        "translation": "It may be called Unexcelled Meaning, or constancy of joy and happiness, or inherent purity, or perfect light, or stretching out one’s arm.",
        "source": "T10n0279_012:0059a26_3"
    },
    {
        "source_sentence": "或名：住本……。",
        "translation": "Or it may be called Abiding in the source.",
        "source": "T10n0279_012:0059a27_4"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0059a28_0"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059a29_0"
    },
    {
        "source_sentence": "此四天下次下方，有世界，名為：焰慧。",
        "translation": "Next to these four celestials is a world called Blazing Wisdom:",
        "source": "T10n0279_012:0059a29_1"
    },
    {
        "source_sentence": "如來於彼，或名：集善根，或名：師子相，或名：猛利慧，或名：金色焰，",
        "translation": "there the Buddha may be called accumulating roots of goodness, or lionlike, or vigorous intellect, or golden flame.",
        "source": "T10n0279_012:0059b01_0"
    },
    {
        "source_sentence": "或名：一切知識，或名：究竟音，或名：作利益，或名：到究竟，或名：真實天，",
        "translation": "It may be called All-knower, or Ultimate Sound, or Beneficent, or Reaching Ultimate, or Realm of Truth.",
        "source": "T10n0279_012:0059b02_1"
    },
    {
        "source_sentence": "或名：普遍勝……。",
        "translation": "Or it may be called universally superior.",
        "source": "T10n0279_012:0059b04_0"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0059b04_1"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059b05_2"
    },
    {
        "source_sentence": "此四天下次上方，有世界，名曰：持地。",
        "translation": "“Beyond these four celestials is a world called Earth-holding World:",
        "source": "T10n0279_012:0059b05_3"
    },
    {
        "source_sentence": "如來於彼，或名：有智慧，或名：清淨面，或名：覺慧，或名：上首，",
        "translation": "“Buddha there may be called wise, or pure face, or enlightened wisdom, or supreme leader.",
        "source": "T10n0279_012:0059b06_4"
    },
    {
        "source_sentence": "或名：行莊嚴，或名：發歡喜，或名：意成滿，或名：如盛火，或名：持戒，",
        "translation": "It may be called array of practices, or arousal of joy, or fulfillment of mind, or like a blazing fire, or observance of precepts.",
        "source": "T10n0279_012:0059b07_5"
    },
    {
        "source_sentence": "或名：一道……。",
        "translation": "Or it may be called one path.",
        "source": "T10n0279_012:0059b08_6"
    },
    {
        "source_sentence": "如是等，其數十千，令諸眾生各別知見。",
        "translation": "Dozens of thousands of such things cause sentient beings to each know and see separately.",
        "source": "T10n0279_012:0059b09_7"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059b10_8"
    },
    {
        "source_sentence": "此娑婆世界有百億四天下，如來於中，有百億萬種種名號，令諸眾生各別知見。",
        "translation": "In this sahā world there are ten billion four continents, where the Tathāgata has 10 billion various names and names that cause sentient beings to know and see them separately.",
        "source": "T10n0279_012:0059b10_9"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059b12_10"
    },
    {
        "source_sentence": "此娑婆世界東，次有世界，名為：密訓。",
        "translation": "“East of this world Endurance is a world called Secret Teaching:",
        "source": "T10n0279_012:0059b12_11"
    },
    {
        "source_sentence": "如來於彼，或名：平等，或名：殊勝，或名：安慰，或名：開曉意，或名：聞慧，",
        "translation": "there the Buddha may be called impartiality, or superior, or comfort, or enlightenment, or knowledge of hearing.",
        "source": "T10n0279_012:0059b13_12"
    },
    {
        "source_sentence": "或名：真實語，或名：得自在，或名：最勝身，或名：大勇猛，或名：無等智……。",
        "translation": "It may be called true speech, or attainment of freedom, or supreme body, or great courage, or peerless knowledge.",
        "source": "T10n0279_012:0059b14_13"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059b15_14"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059b17_0"
    },
    {
        "source_sentence": "此娑婆世界南，次有世界，名曰：豐溢。",
        "translation": "“South of this world Endurance is another world, called Overflowing with plenty:",
        "source": "T10n0279_012:0059b17_1"
    },
    {
        "source_sentence": "如來於彼，或名：本性，或名：勤意，或名：無上尊，或名：大智炬，",
        "translation": "there the Buddha may be called Original Nature, or Diligent Mind, or Unexcelled Honorable One, or Great Torch of Knowledge.",
        "source": "T10n0279_012:0059b18_0"
    },
    {
        "source_sentence": "或名：無所依，或名：光明藏，或名：智慧藏，或名：福德藏，或名：天中天，",
        "translation": "It may be called baseless, or treasury of light, or treasury of knowledge, or treasury of virtue, or celestial among celestials.",
        "source": "T10n0279_012:0059b18_1"
    },
    {
        "source_sentence": "或名：大自在……。",
        "translation": "Or it may be called Great Freedom.",
        "source": "T10n0279_012:0059b18_2"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059b18_3"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059b19_4"
    },
    {
        "source_sentence": "此娑婆世界西，次有世界，名為：離垢。",
        "translation": "To the west of this world Endurance is a world called Undefiled:",
        "source": "T10n0279_012:0059b20_5"
    },
    {
        "source_sentence": "如來於彼，或名：意成，或名：知道，或名：安住本，或名：能解縛，",
        "translation": "“Then the Buddha there may be called Consciousness of Mind, or Knower, or Abiding at source, or Able to bind,",
        "source": "T10n0279_012:0059b20_6"
    },
    {
        "source_sentence": "或名：通達義，或名：樂分別，或名：最勝見，或名：調伏行，或名：眾苦行，",
        "translation": "It may be called comprehending meaning, or enjoying discrimination, or supreme views, or practices of discipline, or various ascetic practices.",
        "source": "T10n0279_012:0059b22_7"
    },
    {
        "source_sentence": "或名：具足力……。",
        "translation": "Or it may be called Replete with Power.",
        "source": "T10n0279_012:0059b23_8"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059b24_0"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059b25_1"
    },
    {
        "source_sentence": "此娑婆世界北，次有世界，名曰：豐樂。",
        "translation": "“North of this world Endurance is another world, called Pleasant:",
        "source": "T10n0279_012:0059b25_2"
    },
    {
        "source_sentence": "如來於彼，或名：薝蔔華色，或名：日藏，或名：善住，或名：現神通，",
        "translation": "“Then the Buddha there may be called discolored by the colors of campaka flowers, or sun-store, or good abode, or manifestation of spiritual powers.",
        "source": "T10n0279_012:0059b26_3"
    },
    {
        "source_sentence": "或名：性超邁，或名：慧日，或名：無礙，或名：如月現，或名：迅疾風，",
        "translation": "It may be called transcendent by nature, or the sun of knowledge, or unobstructed, or like the moon appearing, or swift wind.",
        "source": "T10n0279_012:0059b27_4"
    },
    {
        "source_sentence": "或名：清淨身……。",
        "translation": "Some are called pure bodies...",
        "source": "T10n0279_012:0059b28_5"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059b29_6"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059c01_7"
    },
    {
        "source_sentence": "此娑婆世界東北方，次有世界，名為：攝取。",
        "translation": "“North of this world Endurance is a world called Inclusion:",
        "source": "T10n0279_012:0059c01_8"
    },
    {
        "source_sentence": "如來於彼，或名：永離苦，或名：普解脫，或名：大伏藏，或名：解脫智，",
        "translation": "there the Buddha may be called Forever Free From Suffering, or Universal Liberation, or Great Treasury of Conquering, or Knowledge of Deliverance.",
        "source": "T10n0279_012:0059c02_9"
    },
    {
        "source_sentence": "或名：過去藏，或名：寶光明，或名：離世間，或名：無礙地，或名：淨信藏，",
        "translation": "It may be called past treasury, or light of jewels, or apart from the world, or unobstructed ground, or pure store of faith.",
        "source": "T10n0279_012:0059c03_10"
    },
    {
        "source_sentence": "或名：心不動……。",
        "translation": "Or it may be called Immovable Mind...",
        "source": "T10n0279_012:0059c05_11"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059c05_12"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059c06_13"
    },
    {
        "source_sentence": "此娑婆世界東南方，次有世界，名為：饒益。",
        "translation": "“Southeast of this world Endurance is a world called Beneficent:",
        "source": "T10n0279_012:0059c06_14"
    },
    {
        "source_sentence": "如來於彼，或名：現光明，或名：盡智，或名：美音，或名：勝根，或名：莊嚴蓋，",
        "translation": "there the Buddha may be called Manifesting Light, or Knowledge of Destruction, or Beautiful Sound, or Supreme Roots, or Adorned Canopy.",
        "source": "T10n0279_012:0059c07_15"
    },
    {
        "source_sentence": "或名：精進根，或名：到分別彼岸，或名：勝定，或名：簡言辭，或名：智慧海……。",
        "translation": "It may be called root of energy, or reaching the other shore of discrimination, or superior concentration, or plain speech, or ocean of wisdom.",
        "source": "T10n0279_012:0059c09_16"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059c11_0"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059c12_1"
    },
    {
        "source_sentence": "此娑婆世界西南方，次有世界，名為：鮮少。",
        "translation": "“Southwest of this world Endurance is a world called Rarefied:",
        "source": "T10n0279_012:0059c12_2"
    },
    {
        "source_sentence": "如來於彼，或名：牟尼主，或名：具眾寶，或名：世解脫，或名：遍知根，",
        "translation": "there the Buddha may be called Master of Sages, or Possessor of Myriad Jewels, or World Liberated One, or Root of Universal Knowledge.",
        "source": "T10n0279_012:0059c13_3"
    },
    {
        "source_sentence": "或名：勝言辭，或名：明了見，或名：根自在，或名：大仙師，或名：開導業，",
        "translation": "It may be called superior speech, or insight, or mastery of faculties, or teacher of great sages, or initiating and guiding action.",
        "source": "T10n0279_012:0059c14_4"
    },
    {
        "source_sentence": "或名：金剛師子……。",
        "translation": "Some are called Diamond Lions.",
        "source": "T10n0279_012:0059c16_5"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059c16_6"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059c17_7"
    },
    {
        "source_sentence": "此娑婆世界西北方，次有世界，名為：歡喜。",
        "translation": "“North of this world Endurance is a world called Joy:",
        "source": "T10n0279_012:0059c17_8"
    },
    {
        "source_sentence": "如來於彼，或名：妙華聚，或名：栴檀蓋，或名：蓮華藏，或名：超越諸法，",
        "translation": "there the Buddha may be called Beautiful Flower Mass, or Sandalwood Canopy, or Lotus Treasury, or Transcending All Truths.",
        "source": "T10n0279_012:0059c18_9"
    },
    {
        "source_sentence": "或名：法寶，或名：復出生，或名：淨妙蓋，或名：廣大眼，或名：有善法，",
        "translation": "It may be called Jewel of the Teaching, or Rebirth, or Pure Sublime Canopy, or Vast Eye, or Someone with Good Qualities.",
        "source": "T10n0279_012:0059c20_10"
    },
    {
        "source_sentence": "或名：專念法，或名：網藏……。",
        "translation": "It may be called concentrating on the teachings, or network storehouse.",
        "source": "T10n0279_012:0059c21_11"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059c22_12"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059c23_13"
    },
    {
        "source_sentence": "此娑婆世界次下方，有世界，名為：關[門@龠]。",
        "translation": "“Second to this world Endurance is a world called Gateless:",
        "source": "T10n0279_012:0059c23_14"
    },
    {
        "source_sentence": "如來於彼，或名：發起焰，或名：調伏毒，或名：帝釋弓，或名：無常所，",
        "translation": "there the Buddha may be called Producing Flames, or Subduing Poison, or Indra’s Bow, or something impermanent.",
        "source": "T10n0279_012:0059c24_15"
    },
    {
        "source_sentence": "或名：覺悟本，或名：斷增長，或名：大速疾，或名：常樂施，或名：分別道，",
        "translation": "It may be called the source of enlightenment, or annihilation and growth, or great speed, or constant joy in giving, or the path of differentiation.",
        "source": "T10n0279_012:0059c25_16"
    },
    {
        "source_sentence": "或名：摧伏幢……。",
        "translation": "Some may be called Banner of Destruction.",
        "source": "T10n0279_012:0059c27_17"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0059c27_18"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0059c28_19"
    },
    {
        "source_sentence": "此娑婆世界次上方，有世界，名曰：振音。",
        "translation": "“Above this world Endurance is a world called Shaking Sound:",
        "source": "T10n0279_012:0059c28_20"
    },
    {
        "source_sentence": "如來於彼，或名：勇猛幢，或名：無量寶，或名：樂大施，或名：天光，",
        "translation": "there the Buddha may be called Banner of Courage, or Infinite Jewels, or Delight in Great Giving, or Celestial Light.",
        "source": "T10n0279_012:0059c29_21"
    },
    {
        "source_sentence": "或名：吉興，或名：超境界，或名：一切主，或名：不退輪，或名：離眾惡，",
        "translation": "“Some are called Auspicious Arising, some transcendent spheres, some lords of all beings, some irreversible wheel-turners, or freedom from all evils.",
        "source": "T10n0279_012:0060a02_22"
    },
    {
        "source_sentence": "或名：一切智……。",
        "translation": "Some are called omniscience.",
        "source": "T10n0279_012:0060a03_23"
    },
    {
        "source_sentence": "如是等百億萬種種名號，令諸眾生各別知見。",
        "translation": "Such are the ten billion million various names that cause sentient beings to know and see each other separately.",
        "source": "T10n0279_012:0060a04_0"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0060a05_1"
    },
    {
        "source_sentence": "如娑婆世界，如是東方百千億無數無量，無邊無等，不可數、不可稱、不可思、不可量、不可說，",
        "translation": "“Furthermore, just as in the world Endurance there are hundreds of thousands of myriadstical koṭis of such east directions, which are countless and immeasurable, boundless and unequaled, incalculable",
        "source": "T10n0279_012:0060a05_2"
    },
    {
        "source_sentence": "盡法界、虛空界、諸世界中，如來名號，種種不同；",
        "translation": "The names of the buddhas in all the worlds throughout the cosmos, as well as space and earth, were variously different.",
        "source": "T10n0279_012:0060a07_3"
    },
    {
        "source_sentence": "南、西、北方，四維、上、下，亦復如是。",
        "translation": "The same applies to the south, to the west and to the north. The same applies to the four intermediate directions, upward and downward.",
        "source": "T10n0279_012:0060a08_4"
    },
    {
        "source_sentence": "如世尊昔為菩薩時，以種種談論、種種語言、種種音聲，種種業，種種報，",
        "translation": "“Furthermore, reverend Śāriputra, just as in the past when the World-honored One was an enlightening being, various discourses, various sayings, various sounds, various actions, and various rewards were performed by those bodhi",
        "source": "T10n0279_012:0060a09_5"
    },
    {
        "source_sentence": "種種處，種種方便、種種根，種種信解、種種地位而得成熟，亦令眾生如是知見而為說法。」",
        "translation": "Various places, various methods, various faculties, various beliefs, and various positions that attain maturation also cause sentient beings to thus know and see and teach the Dharma for them.",
        "source": "T10n0279_012:0060a10_6"
    },
    {
        "source_sentence": "四聖諦品第八",
        "translation": "Chapter Eight of the Four Noble Truths",
        "source": "T10n0279_012:0060a13_0"
    },
    {
        "source_sentence": "爾時，文殊師利菩薩摩訶薩告諸菩薩言：「諸佛子！",
        "translation": "It was then that Mañjuśrī Bodhisattva Mahāsattva addressed the bodhisattvas, saying, Children of the Buddha!",
        "source": "T10n0279_012:0060a14_0"
    },
    {
        "source_sentence": "苦聖諦，此娑婆世界中，或名：罪，或名：逼迫，或名：變異，或名：攀緣，",
        "translation": "The holy truth of suffering, in this world Endurance, may be called sin, or oppression, or change, or clinging,",
        "source": "T10n0279_012:0060a15_1"
    },
    {
        "source_sentence": "或名：聚，或名：刺，或名：依根，或名：虛誑，或名：癰瘡處，或名：愚夫行。",
        "translation": "They may be called clusters, or thorns, or roots, or lies, or places of abscesses and sores, or the ways of foolish men.",
        "source": "T10n0279_012:0060a16_2"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060a18_0"
    },
    {
        "source_sentence": "苦集聖諦，此娑婆世界中，或名：繫縛，或名：滅壞，或名：愛著義，",
        "translation": "The holy truth of the accumulation of suffering is, in this world Endurance, called bondage, or cessation and disintegration, or meaning of attachment.",
        "source": "T10n0279_012:0060a18_1"
    },
    {
        "source_sentence": "或名：妄覺念，或名：趣入，或名：決定，或名：網，或名：戲論，或名：隨行，",
        "translation": "“Some are called deluded thoughts, some called entryways, some called certainties, some called networks, some called arguments, or derivative practices.",
        "source": "T10n0279_012:0060a19_2"
    },
    {
        "source_sentence": "或名：顛倒根。",
        "translation": "Some are called perverted faculties.",
        "source": "T10n0279_012:0060a21_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060a21_4"
    },
    {
        "source_sentence": "苦滅聖諦，此娑婆世界中，或名：無諍，或名：離塵，或名：寂靜，或名：無相，",
        "translation": "The holy truth of the extinction of suffering is, in this world Endurance, called noncontention, or freedom from dust, or quiescence, or signlessness.",
        "source": "T10n0279_012:0060a21_5"
    },
    {
        "source_sentence": "或名：無沒，或名：無自性，或名：無障礙，或名：滅，或名：體真實，",
        "translation": "It may be called non vanishing, or selflessness, or unobstructed, or cessation, or reality in essence,",
        "source": "T10n0279_012:0060a23_6"
    },
    {
        "source_sentence": "或名：住自性。",
        "translation": "Or it may be called abiding in self-nature.",
        "source": "T10n0279_012:0060a24_7"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060a24_8"
    },
    {
        "source_sentence": "苦滅道聖諦，此娑婆世界中，或名：一乘，或名：趣寂，或名：導引，",
        "translation": "The holy truth of the path to suffering’s cessation, in this world Endurance, may be called one vehicle, or destinies of peace, or guidance.",
        "source": "T10n0279_012:0060a24_9"
    },
    {
        "source_sentence": "或名：究竟無分別，或名：平等，或名：捨擔，或名：無所趣，或名：隨聖意，",
        "translation": "Or they may be called ultimate nonimagination, or equanimity, or relinquishment of burdens, or going nowhere, or following the will of the enlightened,",
        "source": "T10n0279_012:0060a26_10"
    },
    {
        "source_sentence": "或名：仙人行，或名：十藏。",
        "translation": "It may be called Sage Actions, or Treasury of the Ten.",
        "source": "T10n0279_012:0060a27_11"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060a28_12"
    },
    {
        "source_sentence": "此娑婆世界說四聖諦，有如是等四百億十千名；",
        "translation": "“This world Endurance teaches the four holy truths, and there are four quadrillion such names.",
        "source": "T10n0279_012:0060a28_13"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0060a29_14"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0060b02_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼密訓世界中，或名：營求根，或名：不出離，",
        "translation": "“What is said to be the holy truth of suffering in this world Endurance is, in that world Secret Teaching, sometimes called seeking faculties or not getting rid of them.",
        "source": "T10n0279_012:0060b02_1"
    },
    {
        "source_sentence": "或名：繫縛本，或名：作所不應作，或名：普鬪諍，或名：分析悉無力，",
        "translation": "Or it may be called root of bondage, or doing what should not be done, or universal fighting, or powerless analyzing.",
        "source": "T10n0279_012:0060b03_2"
    },
    {
        "source_sentence": "或名：作所依，或名：極苦，或名：躁動，或名：形狀物。",
        "translation": "It may be called doing what is relied on, or extreme pain, or agitation, or shaped things.",
        "source": "T10n0279_012:0060b05_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060b06_4"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼密訓世界中，或名：順生死，或名：染著，或名：燒然，",
        "translation": "What is called the holy truth of suffering’s accumulation is, in that world Secret Teaching, sometimes called following birth and death, sometimes called defiled attachment, or burning flame.",
        "source": "T10n0279_012:0060b06_5"
    },
    {
        "source_sentence": "或名：流轉，或名：敗壞根，或名：續諸有，或名：惡行，或名：愛著，",
        "translation": "It may be called transmigration, or roots of decay, or continuity of existence, or bad action, or attachment,",
        "source": "T10n0279_012:0060b08_0"
    },
    {
        "source_sentence": "或名：病源，或名：分數。",
        "translation": "Or it may be called source of sickness, or partial number.",
        "source": "T10n0279_012:0060b09_1"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060b09_2"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼密訓世界中，或名：第一義，或名：出離，或名：可讚歎，",
        "translation": "What is called the holy truth of the extinction of suffering is, in that world Secret Teaching, called ultimate truth, or emancipation, or praiseworthy.",
        "source": "T10n0279_012:0060b10_0"
    },
    {
        "source_sentence": "或名：安隱，或名：善入處，或名：調伏，或名：一分，或名：無罪，",
        "translation": "Some are called peaceful, some called a place of good entry, some called subduing, some called partial, or blameless.",
        "source": "T10n0279_012:0060b11_1"
    },
    {
        "source_sentence": "或名：離貪，或名：決定。",
        "translation": "Some are called freedom from craving, or certainty.",
        "source": "T10n0279_012:0060b12_2"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060b13_3"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼密訓世界中，或名：猛將，或名：上行，或名：超出，",
        "translation": "What is called the holy truth of the path leading to the extinction of suffering is, in that world Secret Teaching, sometimes called intense generalship, sometimes superior practice, or transcendence.",
        "source": "T10n0279_012:0060b13_4"
    },
    {
        "source_sentence": "或名：有方便，或名：平等眼，或名：離邊，或名：了悟，或名：攝取，",
        "translation": "Or it may be called having skillful means, or impartial eye, or detached from extremes, or comprehending enlightenment, or taking in.",
        "source": "T10n0279_012:0060b15_5"
    },
    {
        "source_sentence": "或名：最勝眼，或名：觀方。",
        "translation": "Or it may be called Supreme Eye or Observing Directions.",
        "source": "T10n0279_012:0060b16_6"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060b17_0"
    },
    {
        "source_sentence": "密訓世界說四聖諦，有如是等四百億十千名；",
        "translation": "In the world Secret Teaching there are said to be four holy truths, with such names as these numbering four quadrillion or ten thousand.",
        "source": "T10n0279_012:0060b17_1"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0060b18_2"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0060b19_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼最勝世界中，或名：恐怖，或名：分段，",
        "translation": "“What is called the holy truth of suffering in this world Endurance is, in that world Supreme, sometimes called fear or fragmentation.",
        "source": "T10n0279_012:0060b19_1"
    },
    {
        "source_sentence": "或名：可厭惡，或名：須承事，或名：變異，或名：招引怨，或名：能欺奪，",
        "translation": "“Some are called disgusting, some called having to be served, some called change, some called summoning enemies, some called being able to deceive.",
        "source": "T10n0279_012:0060b20_2"
    },
    {
        "source_sentence": "或名：難共事，或名：妄分別，或名：有勢力。",
        "translation": "Or they may be called difficult to work with, or deluded discrimination, or having power.",
        "source": "T10n0279_012:0060b22_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060b23_0"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼最勝世界中，或名：敗壞，或名：癡根，或名：大怨，",
        "translation": "What is called the holy truth of suffering’s accumulation is, in that world Supreme, sometimes called decay, sometimes faculty of delusion, or great enemy.",
        "source": "T10n0279_012:0060b23_1"
    },
    {
        "source_sentence": "或名：利刃，或名：滅味，或名：仇對，或名：非己物，或名：惡導引，",
        "translation": "It may be called sharp sword, or taste of extinction, or enemies, or not one’s own property, or bad leaders.",
        "source": "T10n0279_012:0060b24_2"
    },
    {
        "source_sentence": "或名：增黑闇，或名：壞善利。",
        "translation": "It may be called increasing darkness, or destroying good benefits.",
        "source": "T10n0279_012:0060b26_0"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060b26_1"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼最勝世界中，或名：大義，或名：饒益，或名：義中義，",
        "translation": "What is called the holy truth of the extinction of suffering is, in that world Supreme, some called great meaning, or benefit, or middle meaning.",
        "source": "T10n0279_012:0060b26_2"
    },
    {
        "source_sentence": "或名：無量，或名：所應見，或名：離分別，或名：最上調伏，或名：常平等，",
        "translation": "“Some are called Immeasurable, some called What Should Be perceived, some called freedom from discrimination, some called supremely subdued, or equality of permanence.",
        "source": "T10n0279_012:0060b28_3"
    },
    {
        "source_sentence": "或名：可同住，或名：無為。",
        "translation": "It may be called possible to live together, or unconditioned.",
        "source": "T10n0279_012:0060b29_4"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060c01_5"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼最勝世界中，或名：能燒然，或名：最上品，或名：決定，",
        "translation": "What is called the holy truth of the path to the extinction of suffering is, in the world Supreme, sometimes called that which burns, sometimes called supreme state, or certainty.",
        "source": "T10n0279_012:0060c01_6"
    },
    {
        "source_sentence": "或名：無能破，或名：深方便，或名：出離，或名：不下劣，或名：通達，",
        "translation": "“Some are called Invincible; some are called Profound Skill in Practice; some are called Deliverance; some are called Not inferior; some are called Understanding.",
        "source": "T10n0279_012:0060c03_7"
    },
    {
        "source_sentence": "或名：解脫性，或名：能度脫。",
        "translation": "Some are called nature of liberation, or able to liberate.",
        "source": "T10n0279_012:0060c04_8"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060c05_9"
    },
    {
        "source_sentence": "最勝世界說四聖諦，有如是等四百億十千名；",
        "translation": "In the supreme world Teaching the Four Noble Truths, there are four quadrillion such names.",
        "source": "T10n0279_012:0060c05_10"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0060c06_11"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0060c07_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼離垢世界中，或名：悔恨，或名：資待，",
        "translation": "“What is called the holy truth of suffering in this world Endurance is, in that world Undefiled, sometimes called remorse and hatred, or dependency.",
        "source": "T10n0279_012:0060c07_1"
    },
    {
        "source_sentence": "或名：展轉，或名：住城，或名：一味，或名：非法，或名：居宅，或名：妄著處，",
        "translation": "It may be called development, or city dwelling, or one flavor, or unlawfulness, or house of abode, or place of deluded attachment.",
        "source": "T10n0279_012:0060c08_2"
    },
    {
        "source_sentence": "或名：虛妄見，或名：無有數。",
        "translation": "Some are called false views, or countless.",
        "source": "T10n0279_012:0060c10_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060c10_4"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼離垢世界中，或名：無實物，或名：但有語，或名：非潔白，",
        "translation": "What is called the holy truth of the accumulation of suffering is, in that world Undefiled, sometimes called unreal things, or simply words, or not pure and white.",
        "source": "T10n0279_012:0060c11_0"
    },
    {
        "source_sentence": "或名：生地，或名：執取，或名：鄙賤，或名：增長，或名：重擔，或名：能生，",
        "translation": "It may be called the land of birth, or attachment, or baseness, or growth, or heavy burden, or producer.",
        "source": "T10n0279_012:0060c12_1"
    },
    {
        "source_sentence": "或名：麁獷。",
        "translation": "Or it may be called rough and rustic.",
        "source": "T10n0279_012:0060c14_2"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060c14_3"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼離垢世界中，或名：無等等，或名：普除盡，或名：離垢，",
        "translation": "What is called the holy truth of the extinction of suffering is, in that world Undefiled, sometimes called peerless, sometimes called universal annihilation, or undefiled.",
        "source": "T10n0279_012:0060c14_4"
    },
    {
        "source_sentence": "或名：最勝根，或名：稱會，或名：無資待，或名：滅惑，或名：最上，",
        "translation": "“Some are called most excellent faculties, some called assemblies, or lack of supplies, or extinguishing afflictions, or supreme.",
        "source": "T10n0279_012:0060c16_5"
    },
    {
        "source_sentence": "或名：畢竟，或名：破印。",
        "translation": "It may be called ultimate, or broken mudrā.",
        "source": "T10n0279_012:0060c17_6"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060c18_0"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼離垢世界中，或名：堅固物，或名：方便分，或名：解脫本，",
        "translation": "What is called the holy truth of the path leading to the extinction of suffering is, in that world Undefiled, sometimes called something hard, sometimes part of skillful means, or source of liberation.",
        "source": "T10n0279_012:0060c18_1"
    },
    {
        "source_sentence": "或名：本性實，或名：不可毀，或名：最清淨，或名：諸有邊，或名：受寄全，",
        "translation": "Or they may be called intrinsic reality, or indestructible, or supremely pure, or finite beings, or entrusted to all,",
        "source": "T10n0279_012:0060c19_2"
    },
    {
        "source_sentence": "或名：作究竟，或名：淨分別。",
        "translation": "Some are called doing the ultimate, or pure discrimination.",
        "source": "T10n0279_012:0060c21_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060c22_4"
    },
    {
        "source_sentence": "離垢世界說四聖諦，有如是等四百億十千名；",
        "translation": "“In the world Undefiled, there are said to be four holy truths. In this way there are four quadrillion such names:",
        "source": "T10n0279_012:0060c22_5"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0060c23_6"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0060c24_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼豐溢世界中，或名：愛染處，或名：險害根，",
        "translation": "“What is called the holy truth of suffering in this world Endurance is, in that world Rich Pleasure, sometimes called the abode of craving and defilement, sometimes called the root of danger and harm.",
        "source": "T10n0279_012:0060c24_1"
    },
    {
        "source_sentence": "或名：有海分，或名：積集成，或名：差別根，或名：增長，或名：生滅，",
        "translation": "It may be called ocean of existence, or accumulation, or differentiating faculties, or growth, or arising and ceasing,",
        "source": "T10n0279_012:0060c25_2"
    },
    {
        "source_sentence": "或名：障礙，或名：刀劍本，或名：數所成。",
        "translation": "It may be called obstruction, or source of swords and swords, or formed by numbers.",
        "source": "T10n0279_012:0060c27_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0060c28_0"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼豐溢世界中，或名：可惡，或名：名字，或名：無盡，",
        "translation": "What is called the holy truth of the accumulation of suffering is, in that world Rich Pleasure, sometimes called detestable, sometimes called name, or inexhaustible.",
        "source": "T10n0279_012:0060c28_1"
    },
    {
        "source_sentence": "或名：分數，或名：不可愛，或名：能攫噬，或名：麁鄙物，或名：愛著，",
        "translation": "They may be called parts, or numbers, or undesirables, or able to grab and bite, or coarse things, or craving and clinging,",
        "source": "T10n0279_012:0060c29_2"
    },
    {
        "source_sentence": "或名：器，或名：動。",
        "translation": "It may be called Container, or else agitation.",
        "source": "T10n0279_012:0061a02_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061a02_4"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼豐溢世界中，或名：相續斷，或名：開顯，或名：無文字，",
        "translation": "What is called the holy truth of the extinction of suffering is, in the world Rich Pleasure, sometimes called continuous annihilation, sometimes called revealing, or wordless.",
        "source": "T10n0279_012:0061a02_5"
    },
    {
        "source_sentence": "或名：無所修，或名：無所見，或名：無所作，或名：寂滅，或名：已燒盡，",
        "translation": "It may be called doing nothing, or not seeing anything, or doing nothing, or being silent and extinguished, or having burned up everything.",
        "source": "T10n0279_012:0061a04_6"
    },
    {
        "source_sentence": "或名：捨重擔，或名：已除壞。",
        "translation": "Some may be called relinquishing heavy burdens, or they may be called having removed decay.",
        "source": "T10n0279_012:0061a05_7"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061a06_8"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼豐溢世界中，或名：寂滅行，或名：出離行，或名：勤修證，",
        "translation": "What is called the holy truth of the path leading to the extinction of suffering is, in the world Rich Pleasure, sometimes called the practice of tranquility, sometimes called the practice of emancipation, or called diligent cultivation and realization.",
        "source": "T10n0279_012:0061a06_9"
    },
    {
        "source_sentence": "或名：安隱去，或名：無量壽，或名：善了知，或名：究竟道，或名：難修習，",
        "translation": "It may be called peaceful going, or immeasurable life, or well knowing, or ultimate path, or difficult to cultivate.",
        "source": "T10n0279_012:0061a08_10"
    },
    {
        "source_sentence": "或名：至彼岸，或名：無能勝。",
        "translation": "Or it may be called reaching the other shore, or invincible.",
        "source": "T10n0279_012:0061a09_11"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061a10_12"
    },
    {
        "source_sentence": "豐溢世界說四聖諦，有如是等四百億十千名；",
        "translation": "In the world Richly Overflowing, he taught the four holy truths. There were four quadrillion such names.",
        "source": "T10n0279_012:0061a10_13"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0061a11_14"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0061a13_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼攝取世界中，或名：能劫奪，或名：非善友，",
        "translation": "“What is said to be the holy truth of suffering in this world Endurance is, in the world Inclusion, sometimes called able to plunder or not good friends.",
        "source": "T10n0279_012:0061a13_1"
    },
    {
        "source_sentence": "或名：多恐怖，或名：種種戲論，或名：地獄性，或名：非實義，或名：貪欲擔，",
        "translation": "It may be called much fear, or various conceptual elaborations, or the nature of hell, or unreal meaning, or the burden of craving.",
        "source": "T10n0279_012:0061a14_2"
    },
    {
        "source_sentence": "或名：深重根，或名：隨心轉，或名：根本空。",
        "translation": "Some are called profound faculties, some called acting according to mind, or fundamental emptiness.",
        "source": "T10n0279_012:0061a16_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061a17_4"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼攝取世界中，或名：貪著，或名：惡成辦，或名：過惡，",
        "translation": "What is called the holy truth of the accumulation of suffering is, in the world Inclusion, sometimes called attachment, sometimes bad accomplishment, or excessive evil.",
        "source": "T10n0279_012:0061a17_5"
    },
    {
        "source_sentence": "或名：速疾，或名：能執取，或名：想，或名：有果，或名：無可說，",
        "translation": "Or they may be called speedy, or able to appropriate, or perception, or having fruit, or inexpressible.",
        "source": "T10n0279_012:0061a19_0"
    },
    {
        "source_sentence": "或名：無可取，或名：流轉。",
        "translation": "Some are called ungraspable, or transmigration.",
        "source": "T10n0279_012:0061a20_1"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061a20_2"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼攝取世界中，或名：不退轉，或名：離言說，或名：無相狀，",
        "translation": "What is called the holy truth of the extinction of suffering is, in the world Inclusion, sometimes called nonbacksliding, sometimes free from language, or formless.",
        "source": "T10n0279_012:0061a20_3"
    },
    {
        "source_sentence": "或名：可欣樂，或名：堅固，或名：上妙，或名：離癡，或名：滅盡，",
        "translation": "It may be called delightful, or firmness, or supreme wonder, or freedom from delusion, or extinction.",
        "source": "T10n0279_012:0061a22_4"
    },
    {
        "source_sentence": "或名：遠惡，或名：出離。",
        "translation": "Some are called far away from evil, or getting rid of evil.",
        "source": "T10n0279_012:0061a23_5"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061a24_6"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼攝取世界中，或名：離言，或名：無諍，或名：教導，",
        "translation": "What is called the holy truth of the path to the extinction of suffering is, in the world Inclusion, sometimes called freedom from language, sometimes called no quarrel, or teaching.",
        "source": "T10n0279_012:0061a24_7"
    },
    {
        "source_sentence": "或名：善迴向，或名：大善巧，或名：差別方便，或名：如虛空，或名：寂靜行，",
        "translation": "Or they may be called dedication of merit, or great skillfulness, or differentiating means, or spacelike, or tranquil practice.",
        "source": "T10n0279_012:0061a26_0"
    },
    {
        "source_sentence": "或名：勝智，或名：能了義。",
        "translation": "Some are called superior knowledge, or can comprehend meanings.",
        "source": "T10n0279_012:0061a27_1"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061a28_2"
    },
    {
        "source_sentence": "攝取世界說四聖諦，有如是等四百億十千名；",
        "translation": "“In the world Inclusion there are said to be four noble truths, with such names as these there are four quadrillions of names.",
        "source": "T10n0279_012:0061a28_3"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0061a29_4"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0061b01_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼饒益世界中，或名：重擔，或名：不堅，",
        "translation": "“This world Endurance speaks of the holy truth of suffering: In the world Beneficial, it may be called heavy burden or not hard.",
        "source": "T10n0279_012:0061b01_1"
    },
    {
        "source_sentence": "或名：如賊，或名：老死，或名：愛所成，或名：流轉，或名：疲勞，",
        "translation": "It may be called like thieves, or old age and death, or formed by craving, or transmigration, or weariness,",
        "source": "T10n0279_012:0061b02_2"
    },
    {
        "source_sentence": "或名：惡相狀，或名：生長，或名：利刃。",
        "translation": "It may be called bad shape, or growth, or sharp sword.",
        "source": "T10n0279_012:0061b03_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061b04_4"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼饒益世界中，或名：敗壞，或名：渾濁，或名：退失，",
        "translation": "What is called the holy truth of the accumulation of suffering is, in that world Beneficial, sometimes called decay, sometimes confusion, or retrogression.",
        "source": "T10n0279_012:0061b04_5"
    },
    {
        "source_sentence": "或名：無力，或名：喪失，或名：乖違，或名：不和合，或名：所作，",
        "translation": "It may be called powerless, or loss, or opposition, or disharmony, or doing,",
        "source": "T10n0279_012:0061b06_6"
    },
    {
        "source_sentence": "或名：取，或名：意欲。",
        "translation": "It may be called grasping, or it may be called wishing.",
        "source": "T10n0279_012:0061b07_7"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061b08_8"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼饒益世界中，或名：出獄，或名：真實，或名：離難，",
        "translation": "What is called the holy truth of the extinction of suffering is, in that world Beneficial, sometimes called getting out of prison, or reality, or freedom from hardship.",
        "source": "T10n0279_012:0061b08_9"
    },
    {
        "source_sentence": "或名：覆護，或名：離惡，或名：隨順，或名：根本，或名：捨因，或名：無為，",
        "translation": "It may be called obstruction, or freedom from evil, or following, or fundamental, or the cause of relinquishment, or nonproductivity,",
        "source": "T10n0279_012:0061b09_10"
    },
    {
        "source_sentence": "或名：無相續。",
        "translation": "Or it may be called absence of continuity.",
        "source": "T10n0279_012:0061b11_11"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061b11_12"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼饒益世界中，或名：達無所有，或名：一切印，",
        "translation": "What is called the holy truth of the path leading to the extinction of suffering is, in that world Beneficial, sometimes called comprehending nonexistence or all seals.",
        "source": "T10n0279_012:0061b11_13"
    },
    {
        "source_sentence": "或名：三昧藏，或名：得光明，或名：不退法，或名：能盡有，或名：廣大路，",
        "translation": "It may be called store of concentration, or attainment of light, or nonbacksliding principle, or able to extinguish existence, or vast path,",
        "source": "T10n0279_012:0061b13_14"
    },
    {
        "source_sentence": "或名：能調伏，或名：有安隱，或名：不流轉根。",
        "translation": "Some are called able to tame, some called having peace, or not transmitting faculties.",
        "source": "T10n0279_012:0061b14_15"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061b15_16"
    },
    {
        "source_sentence": "饒益世界說四聖諦，有如是等四百億十千名；",
        "translation": "In the world Beneficial there are four quadrillion such names to explain the four holy truths.",
        "source": "T10n0279_012:0061b15_17"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0061b16_18"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0061b18_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼鮮少世界中，或名：險樂欲，或名：繫縛處，",
        "translation": "“What is said to be the holy truth of suffering in this world Endurance is, in that world Rarefied, sometimes called dangerous desire or binding state.",
        "source": "T10n0279_012:0061b18_1"
    },
    {
        "source_sentence": "或名：邪行，或名：隨受，或名：無慚恥，或名：貪欲根，或名：恒河流，",
        "translation": "It may be called wrong action, or sensation, or shamelessness, or roots of desire, or the Ganges River;",
        "source": "T10n0279_012:0061b19_2"
    },
    {
        "source_sentence": "或名：常破壞，或名：炬火性，或名：多憂惱。",
        "translation": "Or it may be called perpetually broken, or the nature of torch-fire, or many sorrows and vexations.",
        "source": "T10n0279_012:0061b21_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061b22_0"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼鮮少世界中，或名：廣地，或名：能趣，或名：遠慧，",
        "translation": "What is called the holy truth of the accumulation of suffering is, in that world Rarefied, sometimes called wide ground, sometimes destination, or far-reaching wisdom.",
        "source": "T10n0279_012:0061b22_1"
    },
    {
        "source_sentence": "或名：留難，或名：恐怖，或名：放逸，或名：攝取，或名：著處，或名：宅主，",
        "translation": "It may be called dependence, or fear, or carelessness, or taking in, or place of attachment, or owner of the house,",
        "source": "T10n0279_012:0061b23_2"
    },
    {
        "source_sentence": "或名：連縛。",
        "translation": "Or it may be called continuous bondage.",
        "source": "T10n0279_012:0061b25_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061b25_4"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼鮮少世界中，或名：充滿，或名：不死，或名：無我，",
        "translation": "What is called the holy truth of the extinction of suffering is, in that world Rarefied, sometimes called fulfillment, sometimes immortality, or selflessness.",
        "source": "T10n0279_012:0061b25_5"
    },
    {
        "source_sentence": "或名：無自性，或名：分別盡，或名：安樂住，或名：無限量，或名：斷流轉，",
        "translation": "It may be called selfless, or exhaustion of discrimination, or abode of peace and comfort, or infinity, or cutting off the flow,",
        "source": "T10n0279_012:0061b26_6"
    },
    {
        "source_sentence": "或名：絕行處，或名：不二。",
        "translation": "Or it may be called the abode of cutting off action, or called nonduality.",
        "source": "T10n0279_012:0061b28_7"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061b29_8"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼鮮少世界中，或名：大光明，或名：演說海，或名：揀擇義，",
        "translation": "What is called the holy truth of the path leading to the extinction of suffering is, in that world Rarely, sometimes called great light, sometimes ocean of explanation, or meaning of selection.",
        "source": "T10n0279_012:0061b29_9"
    },
    {
        "source_sentence": "或名：和合法，或名：離取著，或名：斷相續，或名：廣大路，或名：平等因，",
        "translation": "Some are called harmonious, some called freedom from attachment, some called cutting off continuity, some called vast path, or equal cause,",
        "source": "T10n0279_012:0061c02_0"
    },
    {
        "source_sentence": "或名：淨方便，或名：最勝見。",
        "translation": "Or they may be called pure methods, or supreme views.",
        "source": "T10n0279_012:0061c03_1"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061c04_2"
    },
    {
        "source_sentence": "鮮少世界說四聖諦，有如是等四百億十千名；",
        "translation": "In the world Rarely enough to Teach the Four Noble Truths there are four quadrillion such names.",
        "source": "T10n0279_012:0061c04_3"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0061c05_4"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0061c06_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼歡喜世界中，或名：流轉，或名：出生，",
        "translation": "“What is called the holy truth of suffering in this world Endurance is, in the world Joy, sometimes called transmigration or birth.",
        "source": "T10n0279_012:0061c06_1"
    },
    {
        "source_sentence": "或名：失利，或名：染著，或名：重擔，或名：差別，或名：內險，或名：集會，",
        "translation": "It may be called gain or loss, or defiled attachment, or heavy burden, or distinction, or internal danger, or assembly,",
        "source": "T10n0279_012:0061c07_2"
    },
    {
        "source_sentence": "或名：惡舍宅，或名：苦惱性。",
        "translation": "Or it may be called bad dwelling abode, or the nature of suffering and distress.",
        "source": "T10n0279_012:0061c08_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061c09_4"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼歡喜世界中，或名：地，或名：方便，或名：非時，",
        "translation": "“What is called the holy truth of the accumulation of suffering is, in that world Rejoicing, sometimes called earth, sometimes called skillful means, sometimes called not the right time.",
        "source": "T10n0279_012:0061c09_5"
    },
    {
        "source_sentence": "或名：非實法，或名：無底，或名：攝取，或名：離戒，或名：煩惱法，",
        "translation": "Or they may be called unreal dharmas, or bottomless, or taking in, or apart from precepts, or afflictive dharmas,",
        "source": "T10n0279_012:0061c11_6"
    },
    {
        "source_sentence": "或名：狹劣見，或名：垢聚。",
        "translation": "Or they may be called narrow views or clusters of defilement.",
        "source": "T10n0279_012:0061c12_7"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061c12_8"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼歡喜世界中，或名：破依止，或名：不放逸，或名：真實，",
        "translation": "What is called the holy truth of the extinction of suffering is, in that world Rejoicing, sometimes called destroying support, sometimes called nonfrivolity, or reality.",
        "source": "T10n0279_012:0061c13_9"
    },
    {
        "source_sentence": "或名：平等，或名：善淨，或名：無病，或名：無曲，或名：無相，或名：自在，",
        "translation": "Or it may be called equality, or good and pure, or freedom from illness, or freedom from distortion, or signlessness, or self-dependence,",
        "source": "T10n0279_012:0061c14_10"
    },
    {
        "source_sentence": "或名：無生。",
        "translation": "Or it may be called nonproduction.",
        "source": "T10n0279_012:0061c16_11"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061c16_12"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼歡喜世界中，或名：入勝界，或名：斷集，或名：超等類，",
        "translation": "What is called the holy truth of the path to the extinction of suffering is, in that world Rejoicing, sometimes called entering the superior realm, sometimes called cutting off accumulation, or transcending all kinds.",
        "source": "T10n0279_012:0061c16_13"
    },
    {
        "source_sentence": "或名：廣大性，或名：分別盡，或名：神力道，或名：眾方便，或名：正念行，",
        "translation": "It may be called vastness, or exhaustion of discrimination, or the path of spiritual powers, or myriad means, or practice of right mindfulness.",
        "source": "T10n0279_012:0061c18_14"
    },
    {
        "source_sentence": "或名：常寂路，或名：攝解脫。",
        "translation": "Or it may be called the path of eternal quiescence, or collecting liberation.",
        "source": "T10n0279_012:0061c19_15"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061c20_16"
    },
    {
        "source_sentence": "歡喜世界說四聖諦，有如是等四百億十千名；",
        "translation": "“World Joy teaches the four holy truths”: In this way, there are four quadrillion such names in the world Rejoicing.",
        "source": "T10n0279_012:0061c20_17"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0061c21_18"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0061c22_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼關[門@龠]世界中，或名：敗壞相，或名：如坏器，",
        "translation": "“What is in this world Endurance called the holy truth of suffering is, in that world Containing [Faces], sometimes called decaying characteristics, or like a broken pot.",
        "source": "T10n0279_012:0061c22_1"
    },
    {
        "source_sentence": "或名：我所成，或名：諸趣身，或名：數流轉，或名：眾惡門，或名：性苦，",
        "translation": "Or it may be called self-created, or body of all destinies, or repeated cycles, or various bad approaches, or inherent suffering,",
        "source": "T10n0279_012:0061c23_2"
    },
    {
        "source_sentence": "或名：可棄捨，或名：無味，或名：來去。",
        "translation": "Some are called abandonable, some called tasteless, or coming and going.",
        "source": "T10n0279_012:0061c25_3"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061c25_4"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼關[門@龠]世界中，或名：行，或名：憤毒，或名：和合，",
        "translation": "What is called the holy truth of suffering’s accumulation is, in those worlds, either called practice, or poison of anger, or conjunction.",
        "source": "T10n0279_012:0061c26_5"
    },
    {
        "source_sentence": "或名：受支，或名：我心，或名：雜毒，或名：虛稱，或名：乖違，或名：熱惱，",
        "translation": "It may be called the branch of sensation, or self-mind, or mixed poison, or false praise, or disobedience, or feverish anguish.",
        "source": "T10n0279_012:0061c27_6"
    },
    {
        "source_sentence": "或名：驚駭。",
        "translation": "Some are called startled.",
        "source": "T10n0279_012:0061c29_7"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0061c29_8"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼關[門@龠]世界中，或名：無積集，或名：不可得，",
        "translation": "What is called the holy truth of the extinction of suffering is, in those worlds, sometimes called accumulationless, or ungraspable.",
        "source": "T10n0279_012:0061c29_9"
    },
    {
        "source_sentence": "或名：妙藥，或名：不可壞，或名：無著，或名：無量，或名：廣大，",
        "translation": "It may be called Wonderful Herbs, or indestructible, or Nonattachment, or Immeasurable, or Vast,",
        "source": "T10n0279_012:0062a02_0"
    },
    {
        "source_sentence": "或名：覺分，或名：離染，或名：無障礙。",
        "translation": "It may be called the awakening factor, or freedom from defilement, or unobstructed.",
        "source": "T10n0279_012:0062a03_1"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0062a04_2"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼關[門@龠]世界中，或名：安隱行，或名：離欲，",
        "translation": "What is called the holy truth of the path leading to the extinction of suffering is, in those worlds, sometimes called peaceful action, or freedom from desire.",
        "source": "T10n0279_012:0062a04_3"
    },
    {
        "source_sentence": "或名：究竟實，或名：入義，或名：性究竟，或名：淨現，或名：攝念，",
        "translation": "It may be called ultimate reality, or sense entry, or ultimate essence, or ultimate nature, or pure manifestation, or collected thought.",
        "source": "T10n0279_012:0062a05_4"
    },
    {
        "source_sentence": "或名：趣解脫，或名：救濟，或名：勝行。",
        "translation": "Or it may be called proceeding to liberation, or salvation, or superior practice.",
        "source": "T10n0279_012:0062a06_5"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0062a07_6"
    },
    {
        "source_sentence": "關[門@龠]世界說四聖諦，有如是等四百億十千名；",
        "translation": "In the world Teaching the Truths of the Four Noble Truths, there are four quadrillion such names.",
        "source": "T10n0279_012:0062a07_7"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0062a08_8"
    },
    {
        "source_sentence": "「諸佛子；",
        "translation": "“Children of Buddha:",
        "source": "T10n0279_012:0062a10_0"
    },
    {
        "source_sentence": "此娑婆世界所言苦聖諦者，彼振音世界中，或名：匿疵，或名：世間，",
        "translation": "“What is said to be the holy truth of suffering in this world Endurance is, in that world Shaking Sound, sometimes called concealment or world.",
        "source": "T10n0279_012:0062a10_1"
    },
    {
        "source_sentence": "或名：所依，或名：傲慢，或名：染著性，或名：駛流，或名：不可樂，",
        "translation": "Some are called relied upon, some called pride, some called defiled attachment, some called fast flowing, or unpleasant.",
        "source": "T10n0279_012:0062a11_2"
    },
    {
        "source_sentence": "或名：覆藏，或名：速滅，或名：難調。",
        "translation": "It may be called obscurity, or speedy extinction, or difficult to tame.",
        "source": "T10n0279_012:0062a13_0"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0062a13_1"
    },
    {
        "source_sentence": "所言苦集聖諦者，彼振音世界中，或名：須制伏，或名：心趣，或名：能縛，",
        "translation": "What is called the holy truth of the accumulation of suffering is, in that world Shaking Sound, sometimes called having to be subdued, sometimes called mental course, or able to bind,",
        "source": "T10n0279_012:0062a13_2"
    },
    {
        "source_sentence": "或名：隨念起，或名：至後邊，或名：共和合，或名：分別，或名：門，",
        "translation": "Or it may be called arising in accord with thought, or going to the extremes, or common conjunction, or distinction, or approach.",
        "source": "T10n0279_012:0062a15_3"
    },
    {
        "source_sentence": "或名：飄動，或名：隱覆。",
        "translation": "It may be called stirring, or it may be called concealed.",
        "source": "T10n0279_012:0062a16_4"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0062a17_5"
    },
    {
        "source_sentence": "所言苦滅聖諦者，彼振音世界中，或名：無依處，或名：不可取，或名：轉還，",
        "translation": "What is called the holy truth of the extinction of suffering is, in that world Shaking Sound, sometimes called baseless; sometimes called ungraspable; sometimes called returning.",
        "source": "T10n0279_012:0062a17_6"
    },
    {
        "source_sentence": "或名：離諍，或名：小，或名：大，或名：善淨，或名：無盡，或名：廣博，",
        "translation": "It may be called freedom from dispute, or small, or great, or good and pure, or inexhaustible, or extensive.",
        "source": "T10n0279_012:0062a18_7"
    },
    {
        "source_sentence": "或名：無等價。",
        "translation": "Or it may be called peerless.",
        "source": "T10n0279_012:0062a20_8"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0062a20_9"
    },
    {
        "source_sentence": "所言苦滅道聖諦者，彼振音世界中，或名：觀察，或名：能摧敵，或名：了知印，",
        "translation": "What is called the holy truth of the path leading to the extinction of suffering is, in that world Shaking Sound, sometimes called observation, sometimes being able to vanquish enemies, or knowing mudrās.",
        "source": "T10n0279_012:0062a20_10"
    },
    {
        "source_sentence": "或名：能入性，或名：難敵對，或名：無限義，或名：能入智，或名：和合道，",
        "translation": "“Some are called able to enter by nature, or difficult to oppose, or infinite meaning, or able to enter knowledge, or the path of conjunction.",
        "source": "T10n0279_012:0062a22_11"
    },
    {
        "source_sentence": "或名：恒不動，或名：殊勝義。",
        "translation": "It may be called Immutable, or Supreme Meaning.",
        "source": "T10n0279_012:0062a23_12"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0062a24_13"
    },
    {
        "source_sentence": "振音世界說四聖諦，有如是等四百億十千名；",
        "translation": "In the world Shaking Sound Teaching the Four Noble Truths there are four quadrillion such names.",
        "source": "T10n0279_012:0062a24_14"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0062a25_15"
    },
    {
        "source_sentence": "「諸佛子！",
        "translation": "“Children of Buddha!",
        "source": "T10n0279_012:0062a27_0"
    },
    {
        "source_sentence": "如此娑婆世界中，說四聖諦，有四百億十千名。",
        "translation": "Thus in the world Sāva there are four hundred myriads of koṭis of names that describe the four noble truths.",
        "source": "T10n0279_012:0062a27_1"
    },
    {
        "source_sentence": "如是，東方百千億無數無量、無邊無等、不可數、不可稱、不可思、不可量、不可說，",
        "translation": "In the east, innumerable hundreds of thousands of myriads of koṭis of such things are immeasurable, limitless, unequalled, uncountable, indescribable, inconceivable, immeasurable,",
        "source": "T10n0279_012:0062a28_2"
    },
    {
        "source_sentence": "盡法界、虛空界、所有世界，彼一一世界中，說四聖諦，亦各有四百億十千名；",
        "translation": "In each of those worlds he expounded the four holy truths, and in each of those worlds there were also four quadrillion names.",
        "source": "T10n0279_012:0062b01_0"
    },
    {
        "source_sentence": "隨眾生心，悉令調伏。",
        "translation": "They cause all sentient beings to be disciplined according to their mentalities.",
        "source": "T10n0279_012:0062b02_1"
    },
    {
        "source_sentence": "如東方，南、西、北方，四維、上、下，亦復如是。",
        "translation": "As in the east, so also in the south, west, and north. The same applies to the four intermediate directions, upward and downward.",
        "source": "T10n0279_012:0062b03_2"
    },
    {
        "source_sentence": "諸佛子！",
        "translation": "Children of the Buddha!",
        "source": "T10n0279_012:0062b04_3"
    },
    {
        "source_sentence": "如娑婆世界，有如上所說；",
        "translation": "For example, in the world Endurance there is that which has been described above.",
        "source": "T10n0279_012:0062b04_4"
    },
    {
        "source_sentence": "十方世界，彼一切世界亦各有如是。",
        "translation": "The worlds of the ten directions are likewise in all those worlds.",
        "source": "T10n0279_012:0062b04_5"
    },
    {
        "source_sentence": "十方世界，一一世界中，說苦聖諦有百億萬種名，說集聖諦、滅聖諦、道聖諦亦各有百億萬種名；",
        "translation": "In each of the worlds in the ten directions, there were ten billion names to be given to the noble truth of suffering. There were also ten billion names to be given to the noble truths of accumulation, cessation, and path.",
        "source": "T10n0279_012:0062b05_6"
    },
    {
        "source_sentence": "皆隨眾生心之所樂，令其調伏。」",
        "translation": "They all follow the mental pleasures of sentient beings and cause them to be disciplined.",
        "source": "T10n0279_012:0062b07_7"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第十二",
        "translation": "Dafangguang fo huayan jing, vol. 12",
        "source": "T10n0279_012:0062b09_0"
    }
]