[
    {
        "source_sentence": "大方廣佛華嚴經卷第七十六",
        "translation": "Dafangguang fo huayan jing, vol. 76",
        "source": "T10n0279_076:0413c05_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_076:0413c07_0"
    },
    {
        "source_sentence": "入法界品第三十九之十七",
        "translation": "Chapter Thirty-nine and Seventeen of the Entry into the Dharma Realm",
        "source": "T10n0279_076:0413c08_0"
    },
    {
        "source_sentence": "爾時，善財童子一心欲詣摩耶夫人所，即時獲得觀佛境界智，作如是念：「是善知識，",
        "translation": "It was then that Sudhana entered Lady Maya’s presence and immediately perceived the sphere of knowledge of the buddhas.",
        "source": "T10n0279_076:0413c09_0"
    },
    {
        "source_sentence": "遠離世間，住無所住，超過六處，離一切著，知無礙道，具淨法身，以如幻業而現化身，",
        "translation": "They are detached from the world, they abide in non-abiding; transcending the six sense mediums, they are free of all attachments. Knowing the unobstructed path, they embody the pure body of reality and manifest evolving bodies by means of magical action.",
        "source": "T10n0279_076:0413c10_1"
    },
    {
        "source_sentence": "以如幻智而觀世間，以如幻願而持佛身、隨意生身、無生滅身、無來去身、非虛實身、不變壞身、無起盡身、所有諸相皆一相身、離二邊身、無依處身、無窮盡身、離諸分別如影現身、知如夢身、了如像身、如淨日身、普於十方而化現身、住於三世無變異身、非身心身，",
        "translation": "He observed the world with knowledge of illusion, holding the buddha-body like a magical vow, the body produced at will, the body without birth or death, the body not coming or going, the body that is not false, the body that does not change or perish, the body that does not give rise to extinction, the body whose all marks are one and the same, the",
        "source": "T10n0279_076:0413c12_2"
    },
    {
        "source_sentence": "猶如虛空，所行無礙，超諸世眼，唯是普賢淨目所見。",
        "translation": "It's like space, which acts without obstruction and transcends the worldly eye, but is seen only by the pure eye of Samantabhadra.",
        "source": "T10n0279_076:0413c18_3"
    },
    {
        "source_sentence": "如是之人，我今云何而得親近承事供養、與其同住、觀其狀貌、聽其音聲、思其語言、受其教誨？」",
        "translation": "How can I now become intimate with such a person, serve and make offerings to them, live together with them, observe their appearance, listen to their sounds, contemplate their words, and receive their instructions?",
        "source": "T10n0279_076:0413c19_4"
    },
    {
        "source_sentence": "作是念已，有主城神，名曰：寶眼，眷屬圍遶，於虛空中而現其身，種種妙物以為嚴飾，",
        "translation": "“After this thought, a celestial city spirit named Jewel Eye, surrounded by his retinues, manifested his body in space, adorned with all kinds of beautiful things.",
        "source": "T10n0279_076:0413c22_5"
    },
    {
        "source_sentence": "手持無量眾色寶華以散善財，作如是言：「善男子！",
        "translation": "Holding an infinite variety of colorful jeweled flowers in their hands, they scattered the good treasures and said, Good man!",
        "source": "T10n0279_076:0413c24_0"
    },
    {
        "source_sentence": "應守護心城，謂：不貪一切生死境界；",
        "translation": "You should guard the city of mind, by not clinging to all realms of birth and death.",
        "source": "T10n0279_076:0413c25_1"
    },
    {
        "source_sentence": "應莊嚴心城，謂：專意趣求如來十力；",
        "translation": "You should adorn the city of mind, by focusing on the ten powers of enlightenment.",
        "source": "T10n0279_076:0413c25_2"
    },
    {
        "source_sentence": "應淨治心城，謂：畢竟斷除慳嫉諂誑；",
        "translation": "You should purify the city of mind, by ultimately getting rid of avarice, jealousy, and hypocrisy.",
        "source": "T10n0279_076:0413c26_3"
    },
    {
        "source_sentence": "應清涼心城，謂：思惟一切諸法實性；",
        "translation": "You should purify the city of mind, by reflecting on the true nature of all things.",
        "source": "T10n0279_076:0413c27_4"
    },
    {
        "source_sentence": "應增長心城，謂：成辦一切助道之法；",
        "translation": "You should increase the city of mind, by developing all the aids to enlightenment.",
        "source": "T10n0279_076:0413c28_5"
    },
    {
        "source_sentence": "應嚴飾心城，謂：造立諸禪解脫宮殿；",
        "translation": "You should adorn the city of mind by building palaces for meditation and liberation.",
        "source": "T10n0279_076:0413c29_6"
    },
    {
        "source_sentence": "應照耀心城，謂：普入一切諸佛道場聽受般若波羅蜜法；",
        "translation": "You should illumine the city of mind, by entering all buddhas’ sites of enlightenment and listening to the Teaching of transcendent wisdom.",
        "source": "T10n0279_076:0414a01_7"
    },
    {
        "source_sentence": "應增益心城，謂：普攝一切佛方便道；",
        "translation": "You should increase the city of mind, by taking care of all buddhas’ paths of enlightenment.",
        "source": "T10n0279_076:0414a02_8"
    },
    {
        "source_sentence": "應堅固心城，謂：恒勤修習普賢行願；",
        "translation": "You should make the city of mind firm, by always cultivating the vows of practice of universal goodness.",
        "source": "T10n0279_076:0414a03_9"
    },
    {
        "source_sentence": "應防護心城，謂：常專禦扞惡友、魔軍；",
        "translation": "You should guard the city of mind, by always defending against bad enemies and armies of demons.",
        "source": "T10n0279_076:0414a04_10"
    },
    {
        "source_sentence": "應廓徹心城，謂：開引一切佛智光明；",
        "translation": "You should illumine the city of mind, by emanating the light of knowledge of all buddhas.",
        "source": "T10n0279_076:0414a04_11"
    },
    {
        "source_sentence": "應善補心城，謂：聽受一切佛所說法；",
        "translation": "You should replenish the city of mind by listening to the Teaching of all buddhas.",
        "source": "T10n0279_076:0414a05_12"
    },
    {
        "source_sentence": "應扶助心城，謂：深信一切佛功德海；",
        "translation": "You should support the city of mind, by believing in the ocean of virtues of all buddhas.",
        "source": "T10n0279_076:0414a06_13"
    },
    {
        "source_sentence": "應廣大心城，謂：大慈普及一切世間；",
        "translation": "You should greatly enlarge the city of mind, by extending great compassion to all beings.",
        "source": "T10n0279_076:0414a07_14"
    },
    {
        "source_sentence": "應善覆心城，謂：集眾善法以覆其上；",
        "translation": "You should skillfully cover the city of mind, by gathering together all good qualities to cover it.",
        "source": "T10n0279_076:0414a08_15"
    },
    {
        "source_sentence": "應寬廣心城，謂：大悲哀愍一切眾生；",
        "translation": "You should broaden the city of mind, by great compassion toward all sentient beings.",
        "source": "T10n0279_076:0414a09_16"
    },
    {
        "source_sentence": "應開心城門，謂：悉捨所有隨應給施；",
        "translation": "You should develop the city gate of enlightenment, by giving away all that you have.",
        "source": "T10n0279_076:0414a09_17"
    },
    {
        "source_sentence": "應密護心城，謂：防諸惡欲不令得入；",
        "translation": "You should guard the city of mind in secret, by preventing evil desires from entering it.",
        "source": "T10n0279_076:0414a10_18"
    },
    {
        "source_sentence": "應嚴肅心城，謂：逐諸惡法不令其住；",
        "translation": "You should adorn and revere the city of mind, by not letting bad thoughts arise in you.",
        "source": "T10n0279_076:0414a11_19"
    },
    {
        "source_sentence": "應決定心城，謂：集一切智助道之法恒無退轉；",
        "translation": "You should definitely establish the city of mind, by accumulating all the knowledges necessary for enlightenment without ever retreating.",
        "source": "T10n0279_076:0414a12_20"
    },
    {
        "source_sentence": "應安立心城，謂：正念三世一切如來所有境界；",
        "translation": "You should establish the city of mind as the sphere of all buddhas of past, present, and future.",
        "source": "T10n0279_076:0414a13_21"
    },
    {
        "source_sentence": "應瑩徹心城，謂：明達一切佛正法輪修多羅中所有法門種種緣起；",
        "translation": "You should illumine and penetrate the city of mind, by clarifying the various causal conditions for all the teachings found in the scriptures on the right wheel of teaching of all buddhas.",
        "source": "T10n0279_076:0414a14_22"
    },
    {
        "source_sentence": "應部分心城，謂：普曉示一切眾生皆令得見薩婆若道；",
        "translation": "You should divide the city of mind into two: you should show all sentient beings everywhere and cause them to see the path of omniscience.",
        "source": "T10n0279_076:0414a16_0"
    },
    {
        "source_sentence": "應住持心城，謂：發一切三世如來諸大願海；",
        "translation": "You should abide in the city of mind-holding, by undertaking the great vows of all buddhas of past, present, and future.",
        "source": "T10n0279_076:0414a17_1"
    },
    {
        "source_sentence": "應富實心城，謂：集一切周遍法界大福德聚；",
        "translation": "You should enrich the city of mind, by accumulating great stores of virtue pervading all worlds throughout the cosmos.",
        "source": "T10n0279_076:0414a18_2"
    },
    {
        "source_sentence": "應令心城明了，謂：普知眾生根欲等法；",
        "translation": "You should cause the city of mind to be clearly comprehended, by knowing all sentient beings’ faculties, desires, and so forth.",
        "source": "T10n0279_076:0414a19_3"
    },
    {
        "source_sentence": "應令心城自在，謂：普攝一切十方法界；",
        "translation": "You should cause the city of mind to be unimpeded, by embracing all worlds in the ten directions.",
        "source": "T10n0279_076:0414a20_4"
    },
    {
        "source_sentence": "應令心城清淨，謂：正念一切諸佛如來；",
        "translation": "You should make the city of mind pure, by correctly remembering all buddhas and enlightened ones.",
        "source": "T10n0279_076:0414a21_0"
    },
    {
        "source_sentence": "應知心城自性，謂：知一切法皆無有性；",
        "translation": "You should know the specific nature of the city of mind: knowing all things have no essence.",
        "source": "T10n0279_076:0414a21_1"
    },
    {
        "source_sentence": "應知心城如幻，謂：以一切智了諸法性。",
        "translation": "You should know that the city of mind is illusory, meaning that it comprehends the essence of dharmas with omniscience.",
        "source": "T10n0279_076:0414a22_2"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_076:0414a23_3"
    },
    {
        "source_sentence": "菩薩摩訶薩若能如是淨修心城，則能積集一切善法。",
        "translation": "If bodhisattvas and mahāsattvas can thus purify the city of mind, they'll be able to accumulate all good qualities.",
        "source": "T10n0279_076:0414a23_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_076:0414a25_0"
    },
    {
        "source_sentence": "蠲除一切諸障難故，所謂：見佛障、聞法障、供養如來障、攝諸眾生障、淨佛國土障。",
        "translation": "Because it removes all the obstacles and difficulties of the hindrances, which are called the hindrance of seeing buddhas, the hindrance of hearing the Dharma, the hindrance of making offerings to the Tathāgata, the hindrance of collecting sentient beings, and the hindrance of purifying the Buddha's land.",
        "source": "T10n0279_076:0414a25_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0414a27_0"
    },
    {
        "source_sentence": "菩薩摩訶薩以離如是諸障難故，若發希求善知識心，不用功力則便得見，",
        "translation": "“Because great enlightening beings are free from such obstacles and difficulties, if they develop the will to seek spiritual benefactors, they can see them without effort.",
        "source": "T10n0279_076:0414a27_1"
    },
    {
        "source_sentence": "乃至究竟必當成佛。」",
        "translation": "It will surely become a buddha in the end.",
        "source": "T10n0279_076:0414a28_2"
    },
    {
        "source_sentence": "爾時，有身眾神，名：蓮華法德及妙華光明，無量諸神前後圍遶，從道場出，",
        "translation": "At that time there was a body-body goddess named Lotus Blossom of Virtue and Sublime Flower Light, surrounded by countless spirits at the front and behind her, emerged from the terrace of enlightenment.",
        "source": "T10n0279_076:0414a29_3"
    },
    {
        "source_sentence": "住虛空中，於善財前，以妙音聲，種種稱歎摩耶夫人，從其耳璫放無量色相光明網，",
        "translation": "In the sky in front of Sudhana’s eyes he saw Lady Maya, emanating from his ears a web of light of infinite colors and characteristics.",
        "source": "T10n0279_076:0414b02_4"
    },
    {
        "source_sentence": "普照無邊諸佛世界，令善財見十方國土一切諸佛。",
        "translation": "He universally illuminates the boundless buddha worlds, causing Sudhana to see all the buddhas of the ten directions.",
        "source": "T10n0279_076:0414b03_5"
    },
    {
        "source_sentence": "其光明網，右遶世間，經一匝已，然後還來，入善財頂，乃至遍入身諸毛孔。",
        "translation": "His web of light circled the world to the right, circled it one turn and returned after that, entering the top of Shanzai’s head. It penetrated all his hair pores throughout his body.",
        "source": "T10n0279_076:0414b05_6"
    },
    {
        "source_sentence": "善財即得淨光明眼，永離一切愚癡闇故；",
        "translation": "Sudhana then attained the eye of pure light, being forever freed from the darkness of ignorance.",
        "source": "T10n0279_076:0414b06_7"
    },
    {
        "source_sentence": "得離翳眼，能了一切眾生性故；",
        "translation": "They attain dispassionate vision because they can see the natures of all sentient beings.",
        "source": "T10n0279_076:0414b07_8"
    },
    {
        "source_sentence": "得離垢眼，能觀一切法性門故；",
        "translation": "They attain the eye free from defilement, being able to see all aspects of the essence of things.",
        "source": "T10n0279_076:0414b08_9"
    },
    {
        "source_sentence": "得淨慧眼，能觀一切佛國性故；",
        "translation": "They attain the eye of pure wisdom, being able to see all buddha-lands.",
        "source": "T10n0279_076:0414b09_10"
    },
    {
        "source_sentence": "得毘盧遮那眼，見佛法身故；",
        "translation": "They attain the eye of Vairocana because they see the buddha-dharma body.",
        "source": "T10n0279_076:0414b09_11"
    },
    {
        "source_sentence": "得普光明眼，見佛平等不思議身故；",
        "translation": "They attain the eye of universal light because they see the equal, inconceivable body of buddhas.",
        "source": "T10n0279_076:0414b10_12"
    },
    {
        "source_sentence": "得無礙光眼，觀察一切剎海成壞故；",
        "translation": "They attain the eye of unobstructed light, observing the formation and disintegration of all oceans of worlds.",
        "source": "T10n0279_076:0414b11_13"
    },
    {
        "source_sentence": "得普照眼，見十方佛起大方便轉正法輪故；",
        "translation": "They attain the eye of universal illumination, seeing the buddhas of the ten directions produce great skill in means to turn the wheel of teaching.",
        "source": "T10n0279_076:0414b12_14"
    },
    {
        "source_sentence": "得普境界眼，見無量佛以自在力調伏眾生故；",
        "translation": "They attain the eye of universal sphere, seeing infinite buddhas to pacify sentient beings by their unimpeded power.",
        "source": "T10n0279_076:0414b13_15"
    },
    {
        "source_sentence": "得普見眼，覩一切剎諸佛出興故。",
        "translation": "They attain the eye of universal vision because they see the emergence of all buddhas in all lands.",
        "source": "T10n0279_076:0414b14_16"
    },
    {
        "source_sentence": "時，有守護菩薩法堂羅剎鬼王，名曰：善眼，與其眷屬萬羅剎俱，於虛空中，",
        "translation": "At that time a spirit king named Sunetra, the guardian of the rāṣāsa demons who guarded the enlightening being’s teaching hall, flew up into the sky accompanied by ten thousand rāṣas.",
        "source": "T10n0279_076:0414b14_17"
    },
    {
        "source_sentence": "以眾妙華，散善財上，作如是言：「善男子！",
        "translation": "He scattered a multitude of marvelous flowers over Sudhana and said, Good man!",
        "source": "T10n0279_076:0414b16_18"
    },
    {
        "source_sentence": "菩薩成就十法，則得親近諸善知識。",
        "translation": "When bodhisattvas accomplish ten things, they'll be able to become intimate with good friends.",
        "source": "T10n0279_076:0414b17_19"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_076:0414b18_20"
    },
    {
        "source_sentence": "所謂：其心清淨離諸諂誑；",
        "translation": "Their minds are pure, free from hypocrisy and deceit.",
        "source": "T10n0279_076:0414b18_21"
    },
    {
        "source_sentence": "大悲平等普攝眾生，知諸眾生無有真實；",
        "translation": "Great compassion equally embraces all sentient beings, knowing that all sentient beings have no reality.",
        "source": "T10n0279_076:0414b19_22"
    },
    {
        "source_sentence": "趣一切智，心不退轉；",
        "translation": "They proceed toward omniscience, their minds never regressing.",
        "source": "T10n0279_076:0414b20_23"
    },
    {
        "source_sentence": "以信解力普入一切諸佛道場；",
        "translation": "By the power of faith and understanding they enter all buddha-practices everywhere.",
        "source": "T10n0279_076:0414b20_24"
    },
    {
        "source_sentence": "得淨慧眼了諸法性；",
        "translation": "They attain the eye of pure wisdom, comprehending the essence of all things.",
        "source": "T10n0279_076:0414b21_25"
    },
    {
        "source_sentence": "大慈平等普覆眾生；",
        "translation": "Great compassion equally covers all sentient beings.",
        "source": "T10n0279_076:0414b21_26"
    },
    {
        "source_sentence": "以智光明廓諸妄境；",
        "translation": "By means of the light of knowledge they illumine the realms of delusion.",
        "source": "T10n0279_076:0414b22_27"
    },
    {
        "source_sentence": "以甘露雨滌生死熱；",
        "translation": "He washes away the fever of birth and death with the rain of immortality.",
        "source": "T10n0279_076:0414b22_28"
    },
    {
        "source_sentence": "以廣大眼徹鑒諸法；",
        "translation": "By means of the vast eye, they penetrate all things.",
        "source": "T10n0279_076:0414b23_29"
    },
    {
        "source_sentence": "心常隨順諸善知識。",
        "translation": "The mind always follows the good teachers.",
        "source": "T10n0279_076:0414b23_30"
    },
    {
        "source_sentence": "是為十。",
        "translation": "These are the ten.",
        "source": "T10n0279_076:0414b24_31"
    },
    {
        "source_sentence": "「復次，佛子！",
        "translation": "“Furthermore, Buddha-child!",
        "source": "T10n0279_076:0414b24_32"
    },
    {
        "source_sentence": "菩薩成就十種三昧門，則常現見諸善知識。",
        "translation": "When a bodhisattva accomplishes ten kinds of samādhi, he always sees good teachers.",
        "source": "T10n0279_076:0414b24_33"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_076:0414b25_34"
    },
    {
        "source_sentence": "所謂：法空清淨輪三昧、觀察十方海三昧、於一切境界不捨離不缺減三昧、普見一切佛出興三昧、集一切功德藏三昧、心恒不捨善知識三昧、常見一切善知識生諸佛功德三昧、常不離一切善知識三昧、常供養一切善知識三昧、常於一切善知識所無過失三昧。",
        "translation": "They are: the samādhi of the pure wheel of the emptiness of dharmas, the samādhi of observing the oceans of the ten directions, the samādhi of not abandoning or diminishing all objects in all realms, the samādhi of seeing all buddhas emerging, the samādhi of accumulating all stores of merit, the samādhi of",
        "source": "T10n0279_076:0414b25_35"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_076:0414c02_36"
    },
    {
        "source_sentence": "菩薩成就此十三昧門，常得親近諸善知識，又得善知識轉一切佛法輪三昧；",
        "translation": "“When enlightening beings develop these thirteen aspects of concentration, they always associate with spiritual benefactors. They also attain the concentration of turning the wheel of teaching of all buddhas’ teachings by spiritual benefactors.",
        "source": "T10n0279_076:0414c02_37"
    },
    {
        "source_sentence": "得此三昧已，悉知諸佛體性平等，處處值遇諸善知識。」",
        "translation": "After attaining this concentration, they all know that the essence of the buddhas is equal and meet good teachers everywhere.",
        "source": "T10n0279_076:0414c04_38"
    },
    {
        "source_sentence": "說是語時，善財童子仰視空中而答之言：「善哉善哉！",
        "translation": "When he spoke these words, the boy of good fortune looked up into the air and answered, Good, good!",
        "source": "T10n0279_076:0414c05_39"
    },
    {
        "source_sentence": "汝為哀愍攝受我故，方便教我見善知識。",
        "translation": "Because you have pity for me and take care of me, skillfully teach me to see a good teacher.",
        "source": "T10n0279_076:0414c07_40"
    },
    {
        "source_sentence": "願為我說：云何往詣善知識所？",
        "translation": "Why don't you tell me how to go to a good teacher?",
        "source": "T10n0279_076:0414c08_41"
    },
    {
        "source_sentence": "於何方處城邑聚落求善知識？」",
        "translation": "Where are cities, towns, and villages that seek good friends?",
        "source": "T10n0279_076:0414c08_42"
    },
    {
        "source_sentence": "羅剎答言：「善男子！",
        "translation": "Rāṣṭrapāla replied, Good man!",
        "source": "T10n0279_076:0414c09_43"
    },
    {
        "source_sentence": "汝應普禮十方，求善知識；",
        "translation": "You should pay homage in all ten directions and seek spiritual benefactors.",
        "source": "T10n0279_076:0414c10_44"
    },
    {
        "source_sentence": "正念思惟一切境界，求善知識；",
        "translation": "Right mindfulness contemplates all realms and seeks out spiritual benefactors.",
        "source": "T10n0279_076:0414c10_45"
    },
    {
        "source_sentence": "勇猛自在遍遊十方，求善知識；",
        "translation": "Their boldness and freedom traveled everywhere in the ten directions, seeking spiritual benefactors.",
        "source": "T10n0279_076:0414c11_46"
    },
    {
        "source_sentence": "觀身觀心如夢如影，求善知識。」",
        "translation": "Observing body and mind as dreams and shadows, they seek good friends.",
        "source": "T10n0279_076:0414c12_47"
    },
    {
        "source_sentence": "爾時，善財受行其教，即時覩見大寶蓮華從地涌出，金剛為莖，妙寶為藏，",
        "translation": "Sudhana saw the great jeweled lotus blossoms coming out of the earth, with their stems made of diamond and their stems of exquisitely beautiful jewels.",
        "source": "T10n0279_076:0414c12_48"
    },
    {
        "source_sentence": "摩尼為葉，光明寶王以為其臺，眾寶色香以為其鬚，無數寶網彌覆其上。",
        "translation": "A jeweled leaf is the base of the pavilion, with a shining jewel king on top of it. The color and fragrance of all kinds of jewels adorn its beard; covered by innumerable networks of jewels, it rises high above it.",
        "source": "T10n0279_076:0414c14_49"
    },
    {
        "source_sentence": "於其臺上，有一樓觀，名：普納十方法界藏，奇妙嚴飾，金剛為地，千柱行列，",
        "translation": "On the top of that terrace was a tower called Containing the Treasury of the cosmos of the Ten Directions, marvelously adorned. The earth was made of diamond and one thousand columns stood in row.",
        "source": "T10n0279_076:0414c16_50"
    },
    {
        "source_sentence": "一切皆以摩尼寶成，閻浮檀金以為其壁，眾寶瓔珞四面垂下，階陛、欄楯周匝莊嚴。",
        "translation": "All of them were made of maṇi treasures, adorned with walls made of jambu sandalwood gold, draped with jewel necklaces on all four sides, embellished with staircases and railings.",
        "source": "T10n0279_076:0414c17_51"
    },
    {
        "source_sentence": "其樓觀中，有如意寶蓮華之座，種種眾寶以為嚴飾，妙寶欄楯，寶衣間列，",
        "translation": "In the tower there was a wish-granting jeweled lotus throne, adorned with various kinds of jewels, beautifully embellished with railings made of precious substances, and arrayed with jeweled robes.",
        "source": "T10n0279_076:0414c19_52"
    },
    {
        "source_sentence": "寶帳、寶網以覆其上，眾寶繒幡周匝垂下，微風徐動，光流響發；",
        "translation": "It was covered with jeweled curtains and webs of jewels, surrounded by draped banners of all kinds of jewels. The light streamed echolessly as the slightest gust of wind moved in the air.",
        "source": "T10n0279_076:0414c21_53"
    },
    {
        "source_sentence": "寶華幢中雨眾妙華，寶鈴鐸中出美音聲，寶戶牖間垂諸瓔珞，摩尼身中流出香水，",
        "translation": "The jeweled flower banners rain beautiful flowers, the jeweled bells and chimes produce beautiful sounds. Between the doors and windows of the jeweled doors hang ornaments, and perfume flows forth from the precious substance’s body.",
        "source": "T10n0279_076:0414c22_54"
    },
    {
        "source_sentence": "寶象口中出蓮華網，寶師子口吐妙香雲，梵形寶輪出隨樂音，金剛寶鈴出諸菩薩大願之音，",
        "translation": "In the mouth of the jeweled elephant came forth webs of lotus blossoms, and in the mouth of the jeweled lion produced clouds of exquisite fragrance.",
        "source": "T10n0279_076:0414c24_55"
    },
    {
        "source_sentence": "寶月幢中出佛化形，淨藏寶王現三世佛受生次第，日藏摩尼放大光明遍照十方一切佛剎，",
        "translation": "In the jeweled moon banner a buddha-manifesting form emerged; the pure treasury of jewels showed the succession of births of the Buddhas of the past, present, and future. The sun-store maṇi emitted great rays of light illuminating all buddha-lands in the ten directions.",
        "source": "T10n0279_076:0414c26_56"
    },
    {
        "source_sentence": "摩尼寶王放一切佛圓滿光明，毘盧遮那摩尼寶王興供養雲供養一切諸佛如來，",
        "translation": "The maṇi-jewel king radiated the perfect light of all Buddhas, and the maṇi-jewel king Vairocana produced clouds of offerings to all buddha-tathāgatas.",
        "source": "T10n0279_076:0414c28_57"
    },
    {
        "source_sentence": "如意珠王念念示現普賢神變充滿法界，須彌寶王出天宮殿，天諸采女種種妙音歌讚如來不可思議微妙功德。",
        "translation": "The wish-granting pearl king shows the miraculous transformations of Samantabhadra in each thought to fill the Dharma realm, the Sumeru jewel king emerges from the celestial palace, and the goddesses sing various subtle sounds praising the Tathāgata's inconceivable subtle merits.",
        "source": "T10n0279_076:0415a01_58"
    },
    {
        "source_sentence": "爾時，善財見如是座，復有無量眾座圍遶，摩耶夫人在彼座上，於一切眾生前，",
        "translation": "At that time, seeing such a seat, Sudhana was surrounded by innumerable other thrones.",
        "source": "T10n0279_076:0415a04_59"
    },
    {
        "source_sentence": "現淨色身。",
        "translation": "He manifests a pure form body.",
        "source": "T10n0279_076:0415a06_60"
    },
    {
        "source_sentence": "所謂：超三界色身，已出一切諸有趣故；",
        "translation": "They transcend the body of form in the three realms, because they have already emerged from all states of existence.",
        "source": "T10n0279_076:0415a06_61"
    },
    {
        "source_sentence": "隨心樂色身，於一切世間無所著故；",
        "translation": "The physical body of form according to mental pleasure, because they have no attachment in any world.",
        "source": "T10n0279_076:0415a07_62"
    },
    {
        "source_sentence": "普周遍色身，等於一切眾生數故；",
        "translation": "They pervade the physical body everywhere, being equal in number to all sentient beings.",
        "source": "T10n0279_076:0415a08_63"
    },
    {
        "source_sentence": "無等比色身，令一切眾生滅倒見故；",
        "translation": "incomparable physical body, causing all sentient beings to cease mistaken views.",
        "source": "T10n0279_076:0415a08_64"
    },
    {
        "source_sentence": "無量種色身，隨眾生心種種現故；",
        "translation": "Innumerable form bodies of various kinds appear in various ways according to the mentalities of sentient beings.",
        "source": "T10n0279_076:0415a09_65"
    },
    {
        "source_sentence": "無邊相色身，普現種種諸形相故；",
        "translation": "Boundless is the physical body of form, manifesting various forms everywhere.",
        "source": "T10n0279_076:0415a10_66"
    },
    {
        "source_sentence": "普對現色身，以大自在而示現故；",
        "translation": "They manifest physical body in all directions, being manifested by great freedom.",
        "source": "T10n0279_076:0415a11_67"
    },
    {
        "source_sentence": "化一切色身，隨其所應而現前故；",
        "translation": "They emanate all form bodies, appearing as they should be.",
        "source": "T10n0279_076:0415a11_68"
    },
    {
        "source_sentence": "恒示現色身，盡眾生界而無盡故；",
        "translation": "They always manifest physical bodies of form, exhausting the realm of sentient beings without end.",
        "source": "T10n0279_076:0415a12_69"
    },
    {
        "source_sentence": "無去色身，於一切趣無所滅故；",
        "translation": "There is no going away from the physical body, because there is no cessation in all states of being.",
        "source": "T10n0279_076:0415a13_70"
    },
    {
        "source_sentence": "無來色身，於諸世間無所出故；",
        "translation": "The form body of nonorigination is because it does not appear in any world.",
        "source": "T10n0279_076:0415a14_71"
    },
    {
        "source_sentence": "不生色身，無生起故；",
        "translation": "The body of form does not arise, because there is no arising.",
        "source": "T10n0279_076:0415a14_72"
    },
    {
        "source_sentence": "不滅色身，離語言故；",
        "translation": "They do not perish in the form body, because they are free from speech.",
        "source": "T10n0279_076:0415a15_73"
    },
    {
        "source_sentence": "非實色身，得如實故；",
        "translation": "They do not really have physical bodies, because they attain them as they are.",
        "source": "T10n0279_076:0415a15_74"
    },
    {
        "source_sentence": "非虛色身，隨世現故；",
        "translation": "It is not a body of unreal form, being manifested according to the time.",
        "source": "T10n0279_076:0415a16_75"
    },
    {
        "source_sentence": "無動色身，生滅永離故；",
        "translation": "The immovable body of form is born and perishes, because it is permanently dispassionate.",
        "source": "T10n0279_076:0415a16_76"
    },
    {
        "source_sentence": "不壞色身，法性不壞故；",
        "translation": "The physical body of form does not perish, because the essence of reality does not perish.",
        "source": "T10n0279_076:0415a17_77"
    },
    {
        "source_sentence": "無相色身，言語道斷故；",
        "translation": "The form body without characteristics is to be abandoned through the path of speech.",
        "source": "T10n0279_076:0415a17_78"
    },
    {
        "source_sentence": "一相色身，無相為相故；",
        "translation": "The one characteristic is the physical body of form, because it has signlessness as its characteristic.",
        "source": "T10n0279_076:0415a18_79"
    },
    {
        "source_sentence": "如像色身，隨心應現故；",
        "translation": "It is like an image, a body of form, which should be manifested according to the mind.",
        "source": "T10n0279_076:0415a18_80"
    },
    {
        "source_sentence": "如幻色身，幻智所生故；",
        "translation": "It is like an illusory physical body, because it is born of illusory knowledge.",
        "source": "T10n0279_076:0415a19_81"
    },
    {
        "source_sentence": "如焰色身，但想所持故；",
        "translation": "It is like the color body of a flame, because it is supported only by perception.",
        "source": "T10n0279_076:0415a20_0"
    },
    {
        "source_sentence": "如影色身，隨願現生故；",
        "translation": "It is like a body of reflected form, being produced according to one’s wishes.",
        "source": "T10n0279_076:0415a20_1"
    },
    {
        "source_sentence": "如夢色身，隨心而現故；",
        "translation": "It is like a dream-form body, being manifested according to the mind.",
        "source": "T10n0279_076:0415a21_2"
    },
    {
        "source_sentence": "法界色身，性淨如空故；",
        "translation": "The form body of the realm of reality is inherently pure like space.",
        "source": "T10n0279_076:0415a21_3"
    },
    {
        "source_sentence": "大悲色身，常護眾生故；",
        "translation": "The form body of great compassion is always protecting sentient beings.",
        "source": "T10n0279_076:0415a22_4"
    },
    {
        "source_sentence": "無礙色身，念念周遍法界故；",
        "translation": "The body of unobstructed form pervades the cosmos in every moment of thought.",
        "source": "T10n0279_076:0415a22_5"
    },
    {
        "source_sentence": "無邊色身，普淨一切眾生故；",
        "translation": "Boundless body of form, purifying all sentient beings everywhere.",
        "source": "T10n0279_076:0415a23_6"
    },
    {
        "source_sentence": "無量色身，超出一切語言故；",
        "translation": "The body of infinite form transcends all language.",
        "source": "T10n0279_076:0415a24_0"
    },
    {
        "source_sentence": "無住色身，願度一切世間故；",
        "translation": "They do not abide in the body of form, wishing to liberate all beings.",
        "source": "T10n0279_076:0415a24_1"
    },
    {
        "source_sentence": "無處色身，恒化眾生不斷故；",
        "translation": "There is no physical body anywhere, because it always transforms sentient beings without stopping.",
        "source": "T10n0279_076:0415a25_2"
    },
    {
        "source_sentence": "無生色身，幻願所成故；",
        "translation": "The form body of nonorigination is the result of illusions and vows.",
        "source": "T10n0279_076:0415a25_3"
    },
    {
        "source_sentence": "無勝色身，超諸世間故；",
        "translation": "There is no superior physical body, because it transcends all worlds.",
        "source": "T10n0279_076:0415a26_4"
    },
    {
        "source_sentence": "如實色身，定心所現故；",
        "translation": "physical body as it really is, because it is manifested by the concentrated mind.",
        "source": "T10n0279_076:0415a27_0"
    },
    {
        "source_sentence": "不生色身，隨眾生業而出現故；",
        "translation": "They do not give rise to physical bodies, appearing according to the actions of sentient beings.",
        "source": "T10n0279_076:0415a27_1"
    },
    {
        "source_sentence": "如意珠色身，普滿一切眾生願故；",
        "translation": "The form body of wish-granting pearl universally fulfills the vows of all sentient beings.",
        "source": "T10n0279_076:0415a28_2"
    },
    {
        "source_sentence": "無分別色身，但隨眾生分別起故；",
        "translation": "The body of nondiscriminating form is only differentiated according to sentient beings.",
        "source": "T10n0279_076:0415a29_0"
    },
    {
        "source_sentence": "離分別色身，一切眾生不能知故；",
        "translation": "They are free from the body of discriminating form, because all sentient beings cannot know it.",
        "source": "T10n0279_076:0415a29_1"
    },
    {
        "source_sentence": "無盡色身，盡諸眾生生死際故；",
        "translation": "Inexhaustible physical body, because it exhausts the realm of birth and death in sentient beings.",
        "source": "T10n0279_076:0415b01_2"
    },
    {
        "source_sentence": "清淨色身，同於如來無分別故。",
        "translation": "The pure form body is the same as the Tathāgata's because it has no discrimination.",
        "source": "T10n0279_076:0415b02_3"
    },
    {
        "source_sentence": "如是身者，非色，所有色相如影像故；",
        "translation": "“Thus is the body”: It is no matter: because all forms and characteristic marks that exist are as images.",
        "source": "T10n0279_076:0415b02_4"
    },
    {
        "source_sentence": "非受，世間苦受究竟滅故；",
        "translation": "It is no feeling: because worldly unpleasant feelings are absolutely extinguished.",
        "source": "T10n0279_076:0415b03_5"
    },
    {
        "source_sentence": "非想，但隨眾生想所現故；",
        "translation": "They are not perceptions, because they are only manifested according to the perceptions of beings.",
        "source": "T10n0279_076:0415b04_6"
    },
    {
        "source_sentence": "非行，依如幻業而成就故；",
        "translation": "They are not conditioned, because they are accomplished by relying on magical action.",
        "source": "T10n0279_076:0415b04_7"
    },
    {
        "source_sentence": "離識，菩薩願智空無性故，一切眾生語言斷故，已得成就寂滅身故。",
        "translation": "Being free of consciousness, the bodhisattva's knowledge of vows is empty because it has no nature, and all sentient beings stop speaking because they've accomplished the body of cessation.",
        "source": "T10n0279_076:0415b05_8"
    },
    {
        "source_sentence": "爾時，善財童子又見摩耶夫人，隨諸眾生心之所樂，現超過一切世間色身。",
        "translation": "It was then that the boy of good fortune also saw Lady Maya, manifesting a form body beyond all worldly forms according to the mentalities of sentient beings.",
        "source": "T10n0279_076:0415b07_9"
    },
    {
        "source_sentence": "所謂：或現超過他化自在天女身乃至超過四大天王天女身，或現超過龍女身乃至超過人女身，",
        "translation": "They may appear to transcend the forms of other apparitional celestial maidens, up to the forms of the four great heavenly maidens; or they may appear to transcend the forms of dragons and women, up to the forms of humans.",
        "source": "T10n0279_076:0415b08_10"
    },
    {
        "source_sentence": "現如是等無量色身，饒益眾生。",
        "translation": "He manifests such an immeasurable body of form to benefit sentient beings.",
        "source": "T10n0279_076:0415b11_0"
    },
    {
        "source_sentence": "集一切智助道之法，行於平等檀波羅蜜，大悲普覆一切世間。",
        "translation": "He collected all the teachings of omniscience that aid in the path, practiced the perfection of equanimity and compassion, and covered all worlds with great compassion.",
        "source": "T10n0279_076:0415b11_1"
    },
    {
        "source_sentence": "出生如來無量功德，修習增長一切智心，觀察思惟諸法實性；",
        "translation": "They produce the immeasurable virtues of buddhas. Cultivating and developing minds of omniscience, they observe and contemplate the true nature of all things.",
        "source": "T10n0279_076:0415b13_2"
    },
    {
        "source_sentence": "獲深忍海，具眾定門，住於平等三昧境界，得如來定圓滿光明，銷竭眾生煩惱巨海；",
        "translation": "They attain the ocean of profound tolerance, endowed with all aspects of concentration. Abiding in the realm of equanimous concentration, they attain the full illumination of buddha-concentration and annihilate the great sea of afflictions of sentient beings.",
        "source": "T10n0279_076:0415b14_3"
    },
    {
        "source_sentence": "心常正定，未嘗動亂，恒轉清淨不退法輪，善能了知一切佛法，恒以智慧觀法實相；",
        "translation": "Their minds were always in correct concentration, never disturbed. They always turned the wheel of teaching pure and unregressing, able to know all the principles of buddhahood well. They always observed the true characteristics of things by means of knowledge.",
        "source": "T10n0279_076:0415b16_4"
    },
    {
        "source_sentence": "見諸如來心無厭足，知三世佛出興次第，見佛三昧常現在前，了達如來出現於世無量無數諸清淨道，",
        "translation": "“Great enlightening beings see the buddhas’ minds without weariness, knowing the order in which the Buddhas of past, present, and future arise. They see buddha-samādhi always appearing before them, comprehending the infinite paths of purity of the emergence of buddhas in the world.",
        "source": "T10n0279_076:0415b18_5"
    },
    {
        "source_sentence": "行於諸佛虛空境界；",
        "translation": "They walk in the realm of space of all buddhas.",
        "source": "T10n0279_076:0415b20_6"
    },
    {
        "source_sentence": "普攝眾生，各隨其心，教化成就；",
        "translation": "To gather all sentient beings, each according to their mentalities, they develop and perfect enlightenment.",
        "source": "T10n0279_076:0415b21_7"
    },
    {
        "source_sentence": "入佛無量清淨法身，成就大願，淨諸佛剎，究竟調伏一切眾生，心恒遍入諸佛境界；",
        "translation": "They enter the boundless pure reality body of buddhahood, develop great vows, purify all buddha-lands, ultimately tame all sentient beings. Their minds always enter everywhere into the realm of buddhas.",
        "source": "T10n0279_076:0415b21_8"
    },
    {
        "source_sentence": "出生菩薩自在神力，已得法身清淨無染，而恒示現無量色身；",
        "translation": "Producing enlightening beings by independent spiritual power, having attained the body of reality pure and unstained, they always manifest infinite physical forms.",
        "source": "T10n0279_076:0415b23_9"
    },
    {
        "source_sentence": "摧一切魔力，成大善根力，出生正法力，具足諸佛力，得諸菩薩自在之力，",
        "translation": "Destroying the power of all demons, developing great roots of goodness, producing the power of the true teaching, imbued with the power of buddhas, they attain the unimpeded empowerment of enlightening beings.",
        "source": "T10n0279_076:0415b25_10"
    },
    {
        "source_sentence": "速疾增長一切智力；",
        "translation": "They quickly increase the power of omniscience.",
        "source": "T10n0279_076:0415b26_11"
    },
    {
        "source_sentence": "得佛智光，普照一切，悉知無量眾生心海，根、性、欲、解種種差別；",
        "translation": "They attain the light of knowledge of buddhas, illumining all. They know the various differences in faculties, natures, desires, and understandings of countless sentient beings’ oceans of minds.",
        "source": "T10n0279_076:0415b27_12"
    },
    {
        "source_sentence": "其身普遍十方剎海，悉知諸剎成壞之相，以廣大眼見十方海，以周遍智知三世海，",
        "translation": "His body extended throughout the ocean of worlds in the ten directions; he knew all the signs of the formation and disintegration of those worlds. With his vast eye he saw the sea of the ten directions, and by pervasive knowledge he knew the ocean of past, present, and future.",
        "source": "T10n0279_076:0415b28_13"
    },
    {
        "source_sentence": "身普承事一切佛海，心恒納受一切法海；",
        "translation": "Their bodies serve all oceans of buddhas, and their minds always contain the ocean of all teachings.",
        "source": "T10n0279_076:0415c01_14"
    },
    {
        "source_sentence": "修習一切如來功德，出生一切菩薩智慧，常樂觀察一切菩薩從初發心乃至成就所行之道，",
        "translation": "Cultivating all the virtues of all buddhas, producing all knowledges of enlightening beings, they always delight in observing all enlightening beings from the first determination for enlightenment up to the attainment of practice.",
        "source": "T10n0279_076:0415c02_15"
    },
    {
        "source_sentence": "常勤守護一切眾生，常樂稱揚諸佛功德，願為一切菩薩之母。",
        "translation": "They always diligently guard all sentient beings, always gladly praise the virtues of buddhas, and wish to be the mothers of all enlightening beings.",
        "source": "T10n0279_076:0415c04_16"
    },
    {
        "source_sentence": "爾時，善財童子見摩耶夫人現如是等閻浮提微塵數諸方便門。",
        "translation": "At that point, the boy of good fortune saw Lady Maya show as many such skillful approaches as there are tiny particles in Jambudvīpa.",
        "source": "T10n0279_076:0415c06_17"
    },
    {
        "source_sentence": "既見是已，如摩耶夫人所現身數，善財亦現作爾許身，於一切處摩耶之前恭敬禮拜，",
        "translation": "Having seen this, Sudhana paid his respects to Lady Maya and venerated her with reverence.",
        "source": "T10n0279_076:0415c07_18"
    },
    {
        "source_sentence": "即時證得無量無數諸三昧門，分別觀察，修行證入。",
        "translation": "Immediately, he realizes measureless and countless samādhi-gates, discerns and observes them, cultivates and realizes their entry.",
        "source": "T10n0279_076:0415c09_19"
    },
    {
        "source_sentence": "從三昧起，右遶摩耶并其眷屬，合掌而立，白言：「大聖！",
        "translation": "He rose from his samādhi, circled Māya to his right and his retinue, joined their palms together, stood up, and said, Great sage!",
        "source": "T10n0279_076:0415c10_20"
    },
    {
        "source_sentence": "文殊師利菩薩教我發阿耨多羅三藐三菩提心，求善知識，親近供養。",
        "translation": "Mañjuśrī Bodhisattva taught me to give rise to the mind of unsurpassed, correct, and complete enlightenment, seek good friends, become intimate with them, and make offerings.",
        "source": "T10n0279_076:0415c12_21"
    },
    {
        "source_sentence": "我於一一善知識所，皆往承事，無空過者；",
        "translation": "To each and every good friend I go to serve them, without fail.",
        "source": "T10n0279_076:0415c13_22"
    },
    {
        "source_sentence": "漸來至此，願為我說：菩薩云何學菩薩行而得成就？」",
        "translation": "Gradually arriving here, may you tell me how an enlightening being is to learn and accomplish the practice of enlightening beings?",
        "source": "T10n0279_076:0415c14_23"
    },
    {
        "source_sentence": "答言：「佛子！",
        "translation": "He replied, Son of the Buddha!",
        "source": "T10n0279_076:0415c15_24"
    },
    {
        "source_sentence": "我已成就菩薩大願智幻解脫門，是故常為諸菩薩母。",
        "translation": "I've accomplished the illusory liberation gate of the knowledge of the bodhisattva's great vow, so I'm always the mother of all bodhisattvas.",
        "source": "T10n0279_076:0415c16_25"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_076:0415c17_26"
    },
    {
        "source_sentence": "如我於此閻浮提中迦毘羅城淨飯王家，右脇而生悉達太子，現不思議自在神變；",
        "translation": "“World-honored One, it is as if in this Jambudvfpa I were to give birth to Prince Siddhārtha at my right side in the house of King Śuddhodana in Kapilavastu, manifesting inconceivable magical manifestations.",
        "source": "T10n0279_076:0415c17_27"
    },
    {
        "source_sentence": "如是，乃至盡此世界海，所有一切毘盧遮那如來，皆入我身，示現誕生自在神變。",
        "translation": "Thus, all the Vairocana Tathāgatas throughout this ocean of worlds entered into my body and showed birth in unimpeded miraculous transformations.",
        "source": "T10n0279_076:0415c19_28"
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "Again, good man!",
        "source": "T10n0279_076:0415c21_29"
    },
    {
        "source_sentence": "我於淨飯王宮，菩薩將欲下生之時，見菩薩身一一毛孔咸放光明，名：一切如來受生功德輪，",
        "translation": "“When the enlightening being was about to be born in the palace of King Pure Rice, I saw a ray of light emanating from each and every pore of the enlightening being’s body called ‘wheel of virtuous birth of all buddhas.",
        "source": "T10n0279_076:0415c21_30"
    },
    {
        "source_sentence": "一一毛孔皆現不可說不可說佛剎微塵數菩薩受生莊嚴。",
        "translation": "Each hair pore shows an ineffable number of bodhisattvas, as many as atoms in untold buddha-lands, who are born and adorned.",
        "source": "T10n0279_076:0415c23_31"
    },
    {
        "source_sentence": "彼諸光明，皆悉普照一切世界；",
        "translation": "All those rays of light illumined all worlds.",
        "source": "T10n0279_076:0415c24_32"
    },
    {
        "source_sentence": "照世界已，來入我頂乃至一切諸毛孔中。",
        "translation": "After illuminating the world, he comes into my hair and enters all my pores.",
        "source": "T10n0279_076:0415c25_33"
    },
    {
        "source_sentence": "又，彼光中普現一切菩薩名號、受生神變、宮殿眷屬、五欲自娛；",
        "translation": "Also manifested in that light were the names of all enlightening beings, the miraculous transformations they had undergone at birth, their palaces, their retinues, and their enjoyments of the five desires.",
        "source": "T10n0279_076:0415c26_34"
    },
    {
        "source_sentence": "又見出家、往詣道場、成等正覺、坐師子座、菩薩圍遶、諸王供養、為諸大眾轉正法輪；",
        "translation": "They also saw renunciation, going to the site of enlightenment, becoming fully awakened, seated on a lion throne, surrounded by enlightening beings, honored by kings, and turning the wheel of the Teaching for the masses.",
        "source": "T10n0279_076:0415c28_35"
    },
    {
        "source_sentence": "又見如來往昔修行菩薩道時，於諸佛所恭敬供養，發菩提心，淨佛國土，",
        "translation": "“Furthermore, when the Buddha was practicing the path of enlightening beings in the past, he honored and served the buddhas, developed the aspiration for enlightenment, and purified the buddha-lands.",
        "source": "T10n0279_076:0416a01_36"
    },
    {
        "source_sentence": "念念示現無量化身，充遍十方一切世界，乃至最後入般涅槃。",
        "translation": "Each moment of thought manifests an infinite apparitional body pervading all worlds in the ten directions, until finally entering parinirvāṇa.",
        "source": "T10n0279_076:0416a02_37"
    },
    {
        "source_sentence": "如是等事，靡不皆見。",
        "translation": "Such things as these are all seen.",
        "source": "T10n0279_076:0416a04_38"
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "Again, good man!",
        "source": "T10n0279_076:0416a04_39"
    },
    {
        "source_sentence": "彼妙光明入我身時，我身形量雖不逾本，然其實已超諸世間。",
        "translation": "When that marvelous ray of light entered my body, even though the size of my body didn't exceed its original form, it had actually transcended all worlds.",
        "source": "T10n0279_076:0416a04_40"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0279_076:0416a06_41"
    },
    {
        "source_sentence": "我身爾時量同虛空，悉能容受十方菩薩受生莊嚴諸宮殿故。",
        "translation": "At the time, my body was as large as space and capable of containing all the enlightening beings born in the ten directions.",
        "source": "T10n0279_076:0416a06_42"
    },
    {
        "source_sentence": "爾時，菩薩從兜率天將降神時，有十佛剎微塵數諸菩薩，皆與菩薩同願、同行、同善根、同莊嚴、同解脫、同智慧，",
        "translation": "At that time, as many enlightening beings as atoms in ten buddha-lands were there, together with the enlightening being Universally Good, who was about to descend from the Tushita heaven. They all had the same aspiration, the same practice, the same root of goodness, the same adornment, the same liberation, and the same knowledge.",
        "source": "T10n0279_076:0416a07_43"
    },
    {
        "source_sentence": "諸地、諸力、法身、色身，乃至普賢神通行願，悉皆同等，如是菩薩前後圍遶；",
        "translation": "The stages, the powers, the body of truth, the body of form, and so on, up to the traveling vows of Universally Good, were all the same: such enlightening beings circled them in front and behind.",
        "source": "T10n0279_076:0416a10_44"
    },
    {
        "source_sentence": "又有八萬諸龍王等、一切世主，乘其宮殿，俱來供養。",
        "translation": "Also, 80,000 dragon kings and other world leaders came to their palaces to make offerings.",
        "source": "T10n0279_076:0416a12_45"
    },
    {
        "source_sentence": "菩薩爾時，以神通力，與諸菩薩普現一切兜率天宮；",
        "translation": "At that time the enlightening beings manifested all the celestial palaces of the Tushita heavens together with the enlightening beings by mystic power.",
        "source": "T10n0279_076:0416a13_46"
    },
    {
        "source_sentence": "一一宮中，悉現十方一切世界閻浮提內受生影像，方便教化無量眾生，",
        "translation": "In each of those palaces he manifested the images of sentient beings born in all worlds throughout the ten directions, teaching and transforming countless sentient beings by skillful means.",
        "source": "T10n0279_076:0416a14_47"
    },
    {
        "source_sentence": "令諸菩薩離諸懈怠無所執著。",
        "translation": "It causes bodhisattvas to be free of laziness and not cling to anything.",
        "source": "T10n0279_076:0416a16_48"
    },
    {
        "source_sentence": "又以神力，放大光明，普照世間，破諸黑闇，滅諸苦惱；",
        "translation": "Also, by mystical power I emanated great rays of light that illumined all worlds, destroying darkness and extinguishing suffering.",
        "source": "T10n0279_076:0416a16_49"
    },
    {
        "source_sentence": "令諸眾生，皆識宿世所有業行，永出惡道。",
        "translation": "It causes all sentient beings to know the actions of past lives, and they'll permanently leave bad destinies.",
        "source": "T10n0279_076:0416a18_50"
    },
    {
        "source_sentence": "又為救護一切眾生，普現其前，作諸神變。",
        "translation": "Also, to save all sentient beings, they manifest miraculous transformations everywhere before them.",
        "source": "T10n0279_076:0416a19_51"
    },
    {
        "source_sentence": "現如是等諸奇特事，與眷屬俱，來入我身。",
        "translation": "They manifest such extraordinary things as these, accompanied by their retinues, and come into my body.",
        "source": "T10n0279_076:0416a20_52"
    },
    {
        "source_sentence": "彼諸菩薩於我腹中，遊行自在，或以三千大千世界而為一步，或以不可說不可說佛剎微塵數世界而為一步。",
        "translation": "In my belly those bodhisattvas traveled freely, either by taking a step in 3,000 great one-thousand worlds or by taking a step in as many worlds as there are atoms in untold buddha-lands.",
        "source": "T10n0279_076:0416a21_53"
    },
    {
        "source_sentence": "又，念念中，十方不可說不可說一切世界諸如來所、菩薩眾會，及四天王天、三十三天，",
        "translation": "“Furthermore, in each mental moment of thought there were untold buddha-fields and assemblies of enlightening beings in the ten directions, as well as all the thirty-three celestial realms.",
        "source": "T10n0279_076:0416a23_54"
    },
    {
        "source_sentence": "乃至色界諸梵天王，欲見菩薩處胎神變，恭敬供養，聽受正法，皆入我身。",
        "translation": "Even the Brahma heavenly kings of the form realm want to see the bodhisattva's miraculous transformation in the womb, venerate and make offerings, listen and receive the right teaching, and enter my body.",
        "source": "T10n0279_076:0416a25_55"
    },
    {
        "source_sentence": "雖我腹中悉能容受如是眾會，而身不廣大亦不迫窄；",
        "translation": "Even though my belly is able to contain all these assemblies, yet my body is not large or crowded.",
        "source": "T10n0279_076:0416a27_56"
    },
    {
        "source_sentence": "其諸菩薩各見自處眾會道場，清淨嚴飾。",
        "translation": "Each of those bodhisattvas saw their own place in the assembly at the site of enlightenment, pure and beautifully decorated.",
        "source": "T10n0279_076:0416a28_57"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0416a29_58"
    },
    {
        "source_sentence": "如此四天下閻浮提中，菩薩受生，我為其母；",
        "translation": "Thus, in the four continents of Jambudvfpa there was an enlightening being born to me as his mother.",
        "source": "T10n0279_076:0416a29_59"
    },
    {
        "source_sentence": "三千大千世界百億四天下閻浮提中，悉亦如是。",
        "translation": "The same applies in Jambudvipa of the three thousand great one-thousand worlds and ten billion four continents.",
        "source": "T10n0279_076:0416b01_60"
    },
    {
        "source_sentence": "然我此身本來無二，非一處住，非多處住。",
        "translation": "However, this body of mine is originally nondual. It does not abide in one place; it does not abide in many places.",
        "source": "T10n0279_076:0416b02_61"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_076:0416b03_62"
    },
    {
        "source_sentence": "以修菩薩大願智幻莊嚴解脫門故。",
        "translation": "It's because they cultivate the bodhisattva's great vow, wisdom, illusory adornment, and liberation gate.",
        "source": "T10n0279_076:0416b03_63"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0416b04_64"
    },
    {
        "source_sentence": "如今世尊，我為其母；",
        "translation": "World-Honored One, I am now your mother.",
        "source": "T10n0279_076:0416b04_65"
    },
    {
        "source_sentence": "往昔所有無量諸佛，悉亦如是而為其母。",
        "translation": "Innumerable buddhas of the past were all likewise their mothers.",
        "source": "T10n0279_076:0416b05_66"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0416b06_67"
    },
    {
        "source_sentence": "我昔曾作蓮華池神，時有菩薩於蓮華藏忽然化生，我即捧持瞻侍養育，",
        "translation": "In the past I was once a lotus-flower pond deity. At one time there was an enlightening being born in the lotus-flower repository by magic, and I held it up to attend and nourish it.",
        "source": "T10n0279_076:0416b06_68"
    },
    {
        "source_sentence": "一切世間皆共號我為：菩薩母。",
        "translation": "All the worlds call me Mother of enlightening beings.",
        "source": "T10n0279_076:0416b08_69"
    },
    {
        "source_sentence": "又，我昔為菩提場神，時有菩薩於我懷中忽然化生，世亦號我為：菩薩母。",
        "translation": "Furthermore, in the past I was a site of enlightenment goddess. An enlightening being came into my mind at one time to teach sentient beings and called me Mother of Enlightening beings.",
        "source": "T10n0279_076:0416b08_70"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0416b10_71"
    },
    {
        "source_sentence": "有無量最後身菩薩，於此世界種種方便示現受生，我皆為母。",
        "translation": "Innumerable bodhisattvas of the final body were born in this world, and I was their mother by various means.",
        "source": "T10n0279_076:0416b10_72"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0416b12_73"
    },
    {
        "source_sentence": "如此世界賢劫之中，過去世時，拘留孫佛、拘那含牟尼佛、迦葉佛及今世尊釋迦牟尼佛現受生時，",
        "translation": "In the past buddhas Krakucchanda Buddha, Kanakamuni Buddha, Kauṇḍinya Buddha, Kasyapa Buddha, and Śākyamuni Buddha of the present world-honored one were all born in this world.",
        "source": "T10n0279_076:0416b12_74"
    },
    {
        "source_sentence": "我為其母。",
        "translation": "I'm his mother.",
        "source": "T10n0279_076:0416b14_75"
    },
    {
        "source_sentence": "未來世中，彌勒菩薩從兜率天將降神時，放大光明普照法界，示現一切諸菩薩眾受生神變，",
        "translation": "In the future, when the enlightening being Maitreya was about to descend from the Tushita heaven, emanating great rays of light illumined the cosmos and showed all the mystical transformations that all the enlightening beings undergo.",
        "source": "T10n0279_076:0416b14_76"
    },
    {
        "source_sentence": "乃於人間生大族家，調伏眾生；",
        "translation": "He was born in a great clan among the people and disciplined sentient beings.",
        "source": "T10n0279_076:0416b17_0"
    },
    {
        "source_sentence": "我於彼時，亦為其母。",
        "translation": "At the time, I was also his mother.",
        "source": "T10n0279_076:0416b17_1"
    },
    {
        "source_sentence": "如是次第，有師子佛、法幢佛、善眼佛、淨華佛、華德佛、提舍佛、弗沙佛、善意佛、金剛佛、離垢佛、月光佛、持炬佛、名稱佛、金剛楯佛、清淨義佛、紺身佛、到彼岸佛、寶焰山佛、持炬佛、蓮華德佛、名稱佛、無量功德佛、最勝燈佛、莊嚴身佛、善威儀佛、慈德佛、無住佛、大威光佛、無邊音佛、勝怨敵佛、離疑惑佛、清淨佛、大光佛、淨心佛、雲德佛、莊嚴頂髻佛、樹王佛、寶璫佛、海慧佛、妙寶佛、華冠佛、滿願佛、大自在佛、妙德王佛、最尊勝佛、栴檀雲佛、紺眼佛、勝慧佛、觀察慧佛、熾盛王佛、堅固慧佛、自在名佛、師子王佛、自在佛、最勝頂佛、金剛智山佛、妙德藏佛、寶網嚴身佛、善慧佛、自在天佛、大天王佛、無依德佛、善施佛、焰慧佛、水天佛、得上味佛、出生無上功德佛、仙人侍衛佛、隨世語言佛、功德自在幢佛、光幢佛、觀身佛、妙身佛、香焰佛、金剛寶嚴佛、喜眼佛、離欲佛、高大身佛、財天佛、無上天佛、順寂滅佛、智覺佛、滅貪佛、大焰王佛、寂諸有佛、毘舍佉天佛、金剛山佛、智焰德佛、安隱佛、師子出現佛、圓滿清淨佛、清淨賢佛、第一義佛、百光明佛、最增上佛、深自在佛、大地王佛、莊嚴王佛、解脫佛、妙音佛、殊勝佛、自在佛、無上醫王佛、功德月佛、無礙光佛、功德聚佛、月現佛、日天佛、出諸有佛、勇猛名稱佛、光明門佛、娑羅王佛、最勝佛、藥王佛、寶勝佛、金剛慧佛、無能勝佛、無能映蔽佛、眾會王佛、大名稱佛、敏持佛、無量光佛、大願光佛、法自在不虛佛、不退地佛、淨天佛、善天佛、堅固苦行佛、一切善友佛、解脫音佛、遊戲王佛、滅邪曲佛、薝蔔淨光佛、具眾德佛、最勝月佛、執明炬佛、殊妙身佛、不可說佛、最清淨佛、友安眾生佛、無量光佛、無畏音佛、水天德佛、不動慧光佛、華勝佛、月焰佛、不退慧佛、離愛佛、無著慧佛、集功德蘊佛、滅惡趣佛、普散華佛、師子吼佛、第一義佛、無礙見佛、破他軍佛、不著相佛、離分別海佛、端嚴海佛、須彌山佛、無著智佛、無邊座佛、清淨住佛、隨師行佛、最上施佛、常月佛、饒益王佛、不動聚佛、普攝受佛、饒益慧佛、持壽佛、無滅佛、具足名稱佛、大威力佛、種種色相佛、無相慧佛、不動天佛、妙德難思佛、滿月佛、解脫月佛、無上王佛、希有身佛、梵供養佛、不瞬佛、順先古佛、最上業佛、順法智佛、無勝天佛、不思議功德光佛、隨法行佛、無量賢佛、普隨順自在佛、最尊天佛，",
        "translation": "In this order there were the lion buddhas, the dharma-banner buddhas, the Buddha of Good Eyes, the Buddha of Pure Flowers, the Buddha of Flower Virtue, the Buddha of Delight in Fragrance, the Buddha of Oceanic Virtue, the Buddha of Dustlessness, the Buddha of Immeasurable Meaning, the Buddha of Clear Meaning, the",
        "source": "T10n0279_076:0416b18_2"
    },
    {
        "source_sentence": "如是乃至樓至如來，在賢劫中，於此三千大千世界，當成佛者，悉為其母。",
        "translation": "Thus, it's the mother of all those who will become buddhas in these 3,000 great one-thousand worlds in the good eon when the Tathāgata reaches Ruci.",
        "source": "T10n0279_076:0417a05_3"
    },
    {
        "source_sentence": "如於此三千大千世界，如是於此世界海十方無量諸世界一切劫中，諸有修行普賢行願，",
        "translation": "“Furthermore, just as in this great ocean of worlds there are three thousand great one-thousand worlds, so also in all the ages in infinite worlds in the ten directions from this ocean of worlds there are those who practice the practical vows of universal goodness.",
        "source": "T10n0279_076:0417a07_4"
    },
    {
        "source_sentence": "為化一切諸眾生者，我自見身悉為其母。」",
        "translation": "For the sake of transforming all sentient beings, I see myself as their mother.",
        "source": "T10n0279_076:0417a09_5"
    },
    {
        "source_sentence": "爾時，善財童子白摩耶夫人言：「大聖得此解脫，經今幾時？」",
        "translation": "It was then that the boy of good fortune said to Lady Maya, Great sage, how long has it been since you attained this liberation?",
        "source": "T10n0279_076:0417a10_6"
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "He replied, Good man!",
        "source": "T10n0279_076:0417a11_7"
    },
    {
        "source_sentence": "乃往古世，過不可思議非最後身菩薩神通道眼所知劫數，爾時有劫名：淨光，",
        "translation": "“World-honored One, from ancient times past as many eons as there are inconceivable numbers of eons for enlightening beings with bodies not destined to perish:",
        "source": "T10n0279_076:0417a11_8"
    },
    {
        "source_sentence": "世界名：須彌德，雖有諸山五趣雜居，然其國土眾寶所成，清淨莊嚴無諸穢惡。",
        "translation": "The world is called Mountain Virtue, though there are mountains with five destinies and mixed abodes, yet the land is made of myriad treasures, pure and adorned without defilement.",
        "source": "T10n0279_076:0417a13_9"
    },
    {
        "source_sentence": "有千億四天下，有一四天下，名：師子幢，於中有八十億王城。",
        "translation": "There were a thousand billion worlds of four continents, and there was a four-world system called Lion Banner, in which there were eighty billion kingdoms.",
        "source": "T10n0279_076:0417a15_10"
    },
    {
        "source_sentence": "有一王城，名：自在幢；",
        "translation": "There was a kingdom called Independent Banner.",
        "source": "T10n0279_076:0417a16_11"
    },
    {
        "source_sentence": "有轉輪王，名：大威德。",
        "translation": "There was a wheel-turning king named Great Majestic.",
        "source": "T10n0279_076:0417a17_12"
    },
    {
        "source_sentence": "彼王城北，有一道場，名：滿月光明；",
        "translation": "To the north of that royal city was a square named Light of the Full Moon.",
        "source": "T10n0279_076:0417a17_13"
    },
    {
        "source_sentence": "其道場神，名曰：慈德。",
        "translation": "The deity at the site of enlightenment was named Virtue of Compassion.",
        "source": "T10n0279_076:0417a18_14"
    },
    {
        "source_sentence": "時，有菩薩，名：離垢幢，坐於道場，將成正覺。",
        "translation": "At the time, there was an enlightening being named Undefiled Banner, seated on the terrace of enlightenment, about to become perfectly enlightened.",
        "source": "T10n0279_076:0417a18_15"
    },
    {
        "source_sentence": "有一惡魔，名：金色光，與其眷屬無量眾俱，至菩薩所。",
        "translation": "There was a bad demon named Golden Light, accompanied by an immeasurable multitude of his retinues, who came to the enlightening being.",
        "source": "T10n0279_076:0417a19_16"
    },
    {
        "source_sentence": "彼大威德轉輪聖王已得菩薩神通自在，化作兵眾，其數倍多，圍遶道場；",
        "translation": "That great majestic wheel-turning sage king of great virtue, having attained mastery over the spiritual powers of enlightening beings, transformed himself into an army several times greater than that number and surrounded the site of enlightenment.",
        "source": "T10n0279_076:0417a21_17"
    },
    {
        "source_sentence": "諸魔惶怖，悉自奔散；",
        "translation": "All the demons were terrified and fled in fear.",
        "source": "T10n0279_076:0417a22_18"
    },
    {
        "source_sentence": "故彼菩薩得成阿耨多羅三藐三菩提。",
        "translation": "That's why that bodhisattva attains unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_076:0417a23_19"
    },
    {
        "source_sentence": "時，道場神見是事已，歡喜無量，便於彼王而生子想，頂禮佛足，作是願言：『此轉輪王，",
        "translation": "Seeing this, the deity of the site of enlightenment was overjoyed and immeasurable with joy. Then he conceived the thought of the king as his only child, bowed down at the Buddha’s feet, and made the following vow:",
        "source": "T10n0279_076:0417a24_20"
    },
    {
        "source_sentence": "在在生處，乃至成佛，願我常得與其為母。』",
        "translation": "Wherever he's born, until he becomes a buddha, may I always be his mother.'",
        "source": "T10n0279_076:0417a26_21"
    },
    {
        "source_sentence": "作是願已，於此道場，復曾供養十那由他佛。",
        "translation": "After making this vow, he once again made offerings to ten nayutas at this site of enlightenment.",
        "source": "T10n0279_076:0417a27_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417a28_0"
    },
    {
        "source_sentence": "於汝意云何，彼道場神豈異人乎？",
        "translation": "What do you think, isn't that the god at the site of enlightenment a different person?",
        "source": "T10n0279_076:0417a28_1"
    },
    {
        "source_sentence": "我身是也。",
        "translation": "This is the self-body.",
        "source": "T10n0279_076:0417a28_2"
    },
    {
        "source_sentence": "轉輪王者，今世尊毘盧遮那是。",
        "translation": "The wheel-turning king is the present Bhagavān Vairocana.",
        "source": "T10n0279_076:0417a29_3"
    },
    {
        "source_sentence": "我從於彼發願已來，此佛世尊，於十方剎一切諸趣，處處受生，種諸善根，",
        "translation": "“Furthermore, World-honored One, since I have undertaken this vow from the buddhas of the ten directions, I have been born everywhere in all states of existence and have planted roots of goodness.",
        "source": "T10n0279_076:0417a29_4"
    },
    {
        "source_sentence": "修菩薩行，教化成就一切眾生，乃至示現住最後身，念念普於一切世界，",
        "translation": "He cultivates the practice of enlightening beings, teaching and developing all sentient beings, until he manifests his final body, instant after instant throughout all worlds.",
        "source": "T10n0279_076:0417b02_5"
    },
    {
        "source_sentence": "示現菩薩受生神變，常為我子，我常為母。",
        "translation": "It shows that the bodhisattva's miraculous transformation of being born is always my child, and I am always my mother.",
        "source": "T10n0279_076:0417b04_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417b05_7"
    },
    {
        "source_sentence": "過去、現在十方世界無量諸佛將成佛時，皆於臍中放大光明，來照我身及我所住宮殿屋宅；",
        "translation": "Innumerable buddhas of past and present in the worlds of the ten directions, when they were about to become buddhas, emanated great rays of light from their navel that came to illumine my body and all the palaces and houses where I lived.",
        "source": "T10n0279_076:0417b05_8"
    },
    {
        "source_sentence": "彼最後生，我悉為母。",
        "translation": "When they are born in their last birth, I will be their mother.",
        "source": "T10n0279_076:0417b07_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417b07_10"
    },
    {
        "source_sentence": "我唯知此菩薩大願智幻解脫門。",
        "translation": "I only know this bodhisattva's great vow, the illusory liberation gate of knowledge and wisdom.",
        "source": "T10n0279_076:0417b08_11"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，具大悲藏，教化眾生常無厭足，以自在力，一一毛孔示現無量諸佛神變；",
        "translation": "“Just as the great enlightening beings are imbued with a treasury of great compassion, always tireless in teaching sentient beings; by their unimpeded power each pore shows infinite mystical displays of buddhahood.",
        "source": "T10n0279_076:0417b08_12"
    },
    {
        "source_sentence": "我今云何能知能說彼功德行？",
        "translation": "How can I now know and explain their meritorious deeds?",
        "source": "T10n0279_076:0417b10_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417b11_14"
    },
    {
        "source_sentence": "於此世界三十三天，有王名：正念，其王有女名：天主光。",
        "translation": "In this world, in the thirty-three heavens, there is a king named Right Mindfulness:",
        "source": "T10n0279_076:0417b11_15"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0417b13_16"
    },
    {
        "source_sentence": "時，善財童子敬受其教，頭面作禮，遶無數匝，戀慕瞻仰，却行而退。",
        "translation": "Then Sudhana paid his respects to the brahman’s instruction, bowed his forehead in reverence, and withdrew.",
        "source": "T10n0279_076:0417b14_17"
    },
    {
        "source_sentence": "遂往天宮，見彼天女，禮足圍遶，合掌前住，白言：「聖者！",
        "translation": "He then went to the celestial palace and saw that goddess, bowed his head at her feet, surrounded by her, stood in front of him with joined palms, and said, Sage!",
        "source": "T10n0279_076:0417b16_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0417b17_1"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0417b18_2"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0417b19_0"
    },
    {
        "source_sentence": "天女答言：「善男子！",
        "translation": "The goddess replied, Good man!",
        "source": "T10n0279_076:0417b19_1"
    },
    {
        "source_sentence": "我得菩薩解脫，名：無礙念清淨莊嚴。",
        "translation": "I have attained an enlightening liberation called pure adornment of unobstructed mindfulness.",
        "source": "T10n0279_076:0417b20_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417b21_0"
    },
    {
        "source_sentence": "我以此解脫力，憶念過去，有最勝劫，名：青蓮華。",
        "translation": "Because of this power of liberation, I remember that in the past there was a supreme eon called blue lotus blossom.",
        "source": "T10n0279_076:0417b21_1"
    },
    {
        "source_sentence": "我於彼劫中，供養恒河沙數諸佛如來。",
        "translation": "During that eon, I made offerings to buddha-tathāgatas as numerous as the grains of sand in the Ganges River.",
        "source": "T10n0279_076:0417b22_2"
    },
    {
        "source_sentence": "彼諸如來，從初出家，我皆瞻奉，守護供養，造僧伽藍，營辦什物。",
        "translation": "Those tathāgatas have all renounced the householder’s life since their very beginning. I venerate, guard, and make offerings to them in order to build a monastery and provide for their daily needs.",
        "source": "T10n0279_076:0417b23_3"
    },
    {
        "source_sentence": "又，彼諸佛從為菩薩住母胎時，誕生之時，行七步時，大師子吼時，住童子位在宮中時，",
        "translation": "“Furthermore, the buddhas and bodhisattvas follow one another’s example:",
        "source": "T10n0279_076:0417b24_4"
    },
    {
        "source_sentence": "向菩提樹成正覺時，轉正法輪現佛神變教化調伏眾生之時；",
        "translation": "At the time of enlightening beings’ attainment of true awakening from the tree of enlightenment, they turn the wheel of right teaching and manifest buddha-transformations to teach and tame sentient beings.",
        "source": "T10n0279_076:0417b26_5"
    },
    {
        "source_sentence": "如是一切諸所作事，從初發心乃至法盡，我皆明憶，無有遺餘，常現在前，",
        "translation": "All these things I do, from the first thought of enlightenment up to the exhaustion of all truths, I clearly remember. With no residue, I always appear before them.",
        "source": "T10n0279_076:0417b28_0"
    },
    {
        "source_sentence": "念持不忘。",
        "translation": "He's mindful and doesn't forget it.",
        "source": "T10n0279_076:0417b29_1"
    },
    {
        "source_sentence": "又，憶過去劫，名：善地，我於彼供養十恒河沙數諸佛如來；",
        "translation": "“Furthermore, I remember a past eon called Good Ground, in which I propitiated buddhas as numerous as the grains of sand in ten Ganges Rivers.",
        "source": "T10n0279_076:0417b29_2"
    },
    {
        "source_sentence": "又，過去劫名為：妙德，我於彼供養一佛世界微塵數諸佛如來；",
        "translation": "Also, in a past eon called Sublime Virtue I propitiated as many buddhas there as atoms in one buddha-world.",
        "source": "T10n0279_076:0417c02_3"
    },
    {
        "source_sentence": "又，劫名：無所得，我於彼供養八十四億百千那由他諸佛如來；",
        "translation": "“Furthermore, the eon was called Nongrasping, and I honored eighty-four hundred million billion trillion buddhas there.",
        "source": "T10n0279_076:0417c03_4"
    },
    {
        "source_sentence": "又，劫名：善光，我於彼供養閻浮提微塵數諸佛如來；",
        "translation": "“Furthermore, during an eon called Light of Goodness I served as many buddhas there as atoms in all the continents of the ten directions.",
        "source": "T10n0279_076:0417c05_5"
    },
    {
        "source_sentence": "又，劫名：無量光，我於彼供養二十恒河沙數諸佛如來；",
        "translation": "“Furthermore, during an eon called Immeasurable Light I propitiated as many buddhas there as there are grains of sand in twenty Ganges Rivers.",
        "source": "T10n0279_076:0417c06_6"
    },
    {
        "source_sentence": "又，劫名：最勝德，我於彼供養一恒河沙數諸佛如來；",
        "translation": "Also, during an eon called Supreme Virtue I honored as many buddha-tathāgatas there as there are grains of sand in the Ganges River.",
        "source": "T10n0279_076:0417c07_7"
    },
    {
        "source_sentence": "又，劫名：善悲，我於彼供養八十恒河沙數諸佛如來；",
        "translation": "“Furthermore, during an eon called Good Compassion I served as many buddhas there as there are grains of sand in eighty-eight Ganges Rivers.",
        "source": "T10n0279_076:0417c08_8"
    },
    {
        "source_sentence": "又，劫名：勝遊，我於彼供養六十恒河沙數諸佛如來；",
        "translation": "“Furthermore, during an eon called superior excursion I served as many buddha-tathāgatas there as there are grains of sand in sixty Ganges Rivers.",
        "source": "T10n0279_076:0417c09_9"
    },
    {
        "source_sentence": "又，劫名：妙月，我於彼供養七十恒河沙數諸佛如來。",
        "translation": "“Furthermore, during an eon called Wonderful Moon I honored buddhas there as numerous as the grains of sand in seventy Ganges Rivers.",
        "source": "T10n0279_076:0417c11_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417c12_1"
    },
    {
        "source_sentence": "如是憶念恒河沙劫，我常不捨諸佛如來、應、正等覺，從彼一切諸如來所，",
        "translation": "For as many eons as there are grains of sand in the Ganges River, I never forsake the buddhas—the enlightened ones, arhats, and perfectly enlightened ones—and follow all their examples.",
        "source": "T10n0279_076:0417c12_2"
    },
    {
        "source_sentence": "聞此無礙念清淨莊嚴菩薩解脫，受持修行恒不忘失。",
        "translation": "Hearing this unobstructed mindfulness of pure adornment is the bodhisattva's liberation, and he retains and cultivates it without ever forgetting it.",
        "source": "T10n0279_076:0417c14_3"
    },
    {
        "source_sentence": "如是，先劫所有如來，從初菩薩，乃至法盡，一切所作，我以淨嚴解脫之力，",
        "translation": "“In the same way, all the deeds of the buddhas of past ages, from the first enlightening liberation up to the end of time, were performed by me through the power of purity and adornment.",
        "source": "T10n0279_076:0417c15_4"
    },
    {
        "source_sentence": "皆隨憶念，明了現前，持而順行，曾無懈廢。",
        "translation": "They all follow recollection, clearly perceive what's present, maintain it, and comply with it without laziness.",
        "source": "T10n0279_076:0417c17_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417c17_1"
    },
    {
        "source_sentence": "我唯知此無礙念清淨解脫。",
        "translation": "I only know that this unobstructed mindfulness is pure and liberating.",
        "source": "T10n0279_076:0417c18_2"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，出生死夜朗然明徹，永離癡冥未嘗惛寐，心無諸蓋、身行輕安，",
        "translation": "“Furthermore, the enlightening beings’ minds are free of all afflictive tendencies and their bodies do not cling to anything. Like the great enlightening beings who emerge at dawn or at dusk in the darkness of the night, they are forever free of delusion but never sleep.",
        "source": "T10n0279_076:0417c18_3"
    },
    {
        "source_sentence": "於諸法性清淨覺了，成就十力開悟群生；",
        "translation": "Having perfected the ten powers of enlightenment, they awaken sentient beings to the nature of all things.",
        "source": "T10n0279_076:0417c20_4"
    },
    {
        "source_sentence": "而我云何能知能說彼功德行？",
        "translation": "How can I know and explain their meritorious deeds?",
        "source": "T10n0279_076:0417c21_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0417c22_6"
    },
    {
        "source_sentence": "迦毘羅城有童子師，名曰：遍友。",
        "translation": "In the city of Kapilavastu there was a boy named Pervading Friend.",
        "source": "T10n0279_076:0417c22_7"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0417c23_8"
    },
    {
        "source_sentence": "時，善財童子以聞法故，歡喜踊躍，不思議善根自然增廣；",
        "translation": "Because of hearing the Teaching, Sudhana was delighted and jumped for joy. His inconceivable roots of goodness naturally increased and expanded.",
        "source": "T10n0279_076:0417c24_9"
    },
    {
        "source_sentence": "頂禮其足，遶無數匝，辭退而去。",
        "translation": "He bowed his head at his feet, circumambulated him countless times, withdrew, and departed.",
        "source": "T10n0279_076:0417c25_10"
    },
    {
        "source_sentence": "從天宮下，漸向彼城。",
        "translation": "They descended from the heavenly palace and proceeded gradually toward that city.",
        "source": "T10n0279_076:0417c26_11"
    },
    {
        "source_sentence": "至遍友所，禮足圍遶，合掌恭敬，於一面立，白言：「聖者！",
        "translation": "When he arrived at his friend's place, he bowed his feet, circumambulated him, joined his palms in respect, stood to one side, and said, Sage!",
        "source": "T10n0279_076:0417c26_12"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0417c27_13"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0417c29_14"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0417c29_15"
    },
    {
        "source_sentence": "遍友答言：「善男子！",
        "translation": "Pūrṇa replied, Good man!",
        "source": "T10n0279_076:0418a01_16"
    },
    {
        "source_sentence": "此有童子，名：善知眾藝，學菩薩字智。",
        "translation": "Here was a boy named Skillful Knowledge of arts and crafts, studying the bodhisattva’s knowledge of phonemes.",
        "source": "T10n0279_076:0418a01_17"
    },
    {
        "source_sentence": "汝可問之，當為汝說。」",
        "translation": "You may ask about it, and I'll explain it for you.",
        "source": "T10n0279_076:0418a02_18"
    },
    {
        "source_sentence": "爾時，善財即至其所，頭頂禮敬，於一面立，白言：「聖者！",
        "translation": "At that point, Sun Cai went to him, bowed his head in respect, stood to one side, and said, Sage!",
        "source": "T10n0279_076:0418a03_19"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0418a04_20"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0418a05_21"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0418a06_22"
    },
    {
        "source_sentence": "時，彼童子告善財言：「善男子！",
        "translation": "The boy then addressed Shanzai, Good man!",
        "source": "T10n0279_076:0418a06_23"
    },
    {
        "source_sentence": "我得菩薩解脫，名：善知眾藝。",
        "translation": "I have attained an enlightening liberation called knowledge of all arts and crafts.",
        "source": "T10n0279_076:0418a07_24"
    },
    {
        "source_sentence": "我恒唱持此之字母：唱阿字時，入般若波羅蜜門，名：以菩薩威力入無差別境界；",
        "translation": "When I recite the letter a, I enter the door of transcendent wisdom called entry into the sphere of nondifferentiation by the power of enlightening beings.",
        "source": "T10n0279_076:0418a08_25"
    },
    {
        "source_sentence": "唱多字時，入般若波羅蜜門，名：無邊差別門；",
        "translation": "When many phonemes were uttered, he entered the door of transcendent wisdom called boundless door of differentiation.",
        "source": "T10n0279_076:0418a09_26"
    },
    {
        "source_sentence": "唱波字時，入般若波羅蜜門，名：普照法界；",
        "translation": "When the letter po was uttered, he entered the door of transcendent wisdom called illumining the cosmos.",
        "source": "T10n0279_076:0418a11_0"
    },
    {
        "source_sentence": "唱者字時，入般若波羅蜜門，名：普輪斷差別；",
        "translation": "When the word “singing” was uttered, he entered the door of transcendent wisdom called differentiating by universal elimination.",
        "source": "T10n0279_076:0418a12_0"
    },
    {
        "source_sentence": "唱那字時，入般若波羅蜜門，名：得無依無上；",
        "translation": "When they uttered the phonetic na, they entered the door of transcendent wisdom called attainment of nondependence and peerlessness.",
        "source": "T10n0279_076:0418a13_0"
    },
    {
        "source_sentence": "唱邏字時，入般若波羅蜜門，名：離依止無垢；",
        "translation": "“When the letter ‘la’ was uttered, he entered the door of transcendent wisdom called Undefiled freedom from reliance.",
        "source": "T10n0279_076:0418a14_0"
    },
    {
        "source_sentence": "唱柂(輕呼)字時，入般若波羅蜜門，名：不退轉方便；",
        "translation": "When he uttered the phonetic case, he entered the door of transcendent wisdom called method of nonbacksliding.",
        "source": "T10n0279_076:0418a15_0"
    },
    {
        "source_sentence": "唱婆(蒲我切)字時，入般若波羅蜜門，名：金剛場；",
        "translation": "When he uttered the letter po, he entered the door of transcendent wisdom called adamantine site.",
        "source": "T10n0279_076:0418a16_1"
    },
    {
        "source_sentence": "唱荼(徒解切)字時，入般若波羅蜜門，名曰：普輪；",
        "translation": "When he uttered the letter tuṣita, he entered the door of transcendent wisdom called universal wheel.",
        "source": "T10n0279_076:0418a17_2"
    },
    {
        "source_sentence": "唱沙(史我切)字時，入般若波羅蜜門，名為：海藏；",
        "translation": "When the phoneme sand is uttered, one enters the door of transcendent wisdom called ocean-store.",
        "source": "T10n0279_076:0418a18_3"
    },
    {
        "source_sentence": "唱縛(房可切)字時，入般若波羅蜜門，名：普生安住；",
        "translation": "When he uttered the word fetter, he entered the door of transcendent wisdom called peaceful abode of all beings.",
        "source": "T10n0279_076:0418a19_4"
    },
    {
        "source_sentence": "唱哆(都我切)字時，入般若波羅蜜門，名：圓滿光；",
        "translation": "When he uttered the phoneme da, he entered the door of transcendent wisdom called perfect light.",
        "source": "T10n0279_076:0418a20_5"
    },
    {
        "source_sentence": "唱也(以可切)字時，入般若波羅蜜門，名：差別積聚；",
        "translation": "When he uttered the phoneme also (in order to cut), he entered the door of transcendent wisdom called differentiating accumulation.",
        "source": "T10n0279_076:0418a21_6"
    },
    {
        "source_sentence": "唱瑟吒字時，入般若波羅蜜門，名：普光明息煩惱；",
        "translation": "When they uttered the letter stha, they entered the door of transcendent wisdom called universal light extinguishing afflictions.",
        "source": "T10n0279_076:0418a22_7"
    },
    {
        "source_sentence": "唱迦字時，入般若波羅蜜門，名：無差別雲；",
        "translation": "When the letter a was uttered, he entered the door of transcendent wisdom called cloud of nondifferentity.",
        "source": "T10n0279_076:0418a23_8"
    },
    {
        "source_sentence": "唱娑(蘇我切)字時，入般若波羅蜜門，名：降霔大雨；",
        "translation": "When the letter s is uttered, he enters the door of transcendent wisdom called showering rain.",
        "source": "T10n0279_076:0418a24_9"
    },
    {
        "source_sentence": "唱麼字時，入般若波羅蜜門，名：大流湍激眾峯齊峙；",
        "translation": "When he uttered these words, he entered the door of transcendent wisdom called great flow and turbulence, where all the peaks stood together.",
        "source": "T10n0279_076:0418a25_10"
    },
    {
        "source_sentence": "唱伽(上聲輕呼)字時，入般若波羅蜜門，名：普安立；",
        "translation": "When he uttered the phonemes agha, he entered the door of transcendent wisdom called universally established.",
        "source": "T10n0279_076:0418a26_11"
    },
    {
        "source_sentence": "唱他(他可切)字時，入般若波羅蜜門，名：真如平等藏；",
        "translation": "When he uttered the phonemes thus, he entered the door of transcendent wisdom called equanimous treasury of truth.",
        "source": "T10n0279_076:0418a27_12"
    },
    {
        "source_sentence": "唱社字時，入般若波羅蜜門，名：入世間海清淨；",
        "translation": "When the word community was uttered, he entered the door of transcendent wisdom called entering the ocean of worldly purity.",
        "source": "T10n0279_076:0418a28_13"
    },
    {
        "source_sentence": "唱鎖字時，入般若波羅蜜門，名：念一切佛莊嚴；",
        "translation": "When the word ‘lock’ was uttered, he entered the door of transcendent wisdom called adornment of mindfulness on all buddhas.",
        "source": "T10n0279_076:0418a29_14"
    },
    {
        "source_sentence": "唱柂字時，入般若波羅蜜門，名：觀察揀擇一切法聚；",
        "translation": "When they uttered the letter un, they entered the door of transcendent wisdom called examining and selecting all collections of teachings.",
        "source": "T10n0279_076:0418b01_15"
    },
    {
        "source_sentence": "唱奢(尸苛切)字時，入般若波羅蜜門，名：隨順一切佛教輪光明；",
        "translation": "When he uttered the letter śa, he entered the door of transcendent wisdom called following the light of all buddha-wheels.",
        "source": "T10n0279_076:0418b03_16"
    },
    {
        "source_sentence": "唱佉字時，入般若波羅蜜門，名：修因地智慧藏；",
        "translation": "When the letter un was uttered, he entered the door of transcendent wisdom called store of knowledge cultivating causality.",
        "source": "T10n0279_076:0418b04_17"
    },
    {
        "source_sentence": "唱叉(楚我切)字時，入般若波羅蜜門，名：息諸業海藏；",
        "translation": "When he uttered the letter kṣa, he entered the door of transcendent wisdom called the storehouse of calming the ocean of actions.",
        "source": "T10n0279_076:0418b05_18"
    },
    {
        "source_sentence": "唱娑(蘇紇切)多(上聲呼)字時，入般若波羅蜜門，名：蠲諸惑障開淨光明；",
        "translation": "When he uttered the phonetic letter sutta, he entered the door of transcendent wisdom called illuminating pure light by dispelling the obscurations of all afflictions.",
        "source": "T10n0279_076:0418b06_19"
    },
    {
        "source_sentence": "唱壤字時，入般若波羅蜜門，名：作世間智慧門；",
        "translation": "When the letter soil was uttered, he entered the door of transcendent wisdom called gate of worldly knowledge.",
        "source": "T10n0279_076:0418b08_0"
    },
    {
        "source_sentence": "唱曷攞多(上聲)字時，入般若波羅蜜門，名：生死境界智慧輪；",
        "translation": "When he uttered the phonetic letter un (upper case), he entered the door of transcendent wisdom called wheel of knowledge in the realm of birth and death.",
        "source": "T10n0279_076:0418b09_1"
    },
    {
        "source_sentence": "唱婆(蒲我切)字時，入般若波羅蜜門，名：一切智宮殿圓滿莊嚴；",
        "translation": "When he uttered the letter po, he entered the door of transcendent wisdom called full adornment of the palace of omniscience.",
        "source": "T10n0279_076:0418b10_2"
    },
    {
        "source_sentence": "唱車(上聲呼)字時，入般若波羅蜜門，名：修行方便藏各別圓滿；",
        "translation": "When the phoneme chariot is uttered, he enters the door of transcendent wisdom called the store of practice and skill in means, each distinctly complete.",
        "source": "T10n0279_076:0418b11_3"
    },
    {
        "source_sentence": "唱娑(蘇紇切)麼字時，入般若波羅蜜門，名：隨十方現見諸佛；",
        "translation": "When he uttered the letter s, he entered the door of transcendent wisdom called Seeing All Buddhas in All Directions.",
        "source": "T10n0279_076:0418b13_4"
    },
    {
        "source_sentence": "唱訶婆(二字皆上聲呼)字時，入般若波羅蜜門，名：觀察一切無緣眾生方便攝受令出生無礙力；",
        "translation": "When he uttered the phonetic letter hāva, he entered the door of transcendent wisdom called unobstructed power of observing all sentient beings without conditions and skillfully taking care of them so that they would arise.",
        "source": "T10n0279_076:0418b14_5"
    },
    {
        "source_sentence": "唱縒(七可切)字時，入般若波羅蜜門，名：修行趣入一切功德海；",
        "translation": "When he uttered the phonetic letter un, he entered the door of transcendent wisdom called entry into all oceans of virtues by the practice of enlightenment.",
        "source": "T10n0279_076:0418b16_6"
    },
    {
        "source_sentence": "唱伽(上聲呼)字時，入般若波羅蜜門，名：持一切法雲堅固海藏；",
        "translation": "When he uttered the phonetic letter a, he entered the door of transcendent wisdom called oceanic treasury holding all clouds of teaching.",
        "source": "T10n0279_076:0418b17_7"
    },
    {
        "source_sentence": "唱吒字時，入般若波羅蜜門，名：隨願普見十方諸佛；",
        "translation": "When the Sanskrit phoneme ṭa was uttered, he entered the door of transcendent wisdom called seeing all buddhas everywhere in the ten directions as he wished.",
        "source": "T10n0279_076:0418b19_8"
    },
    {
        "source_sentence": "唱拏(嬭可切)字時，入般若波羅蜜門，名：觀察字輪有無盡諸億字；",
        "translation": "When he uttered the phonetic case, he entered the door of transcendent wisdom called observing that there are inexhaustible billions of phonemes in the syllable wheel.",
        "source": "T10n0279_076:0418b20_9"
    },
    {
        "source_sentence": "唱娑(蘇紇切)頗字時，入般若波羅蜜門，名：化眾生究竟處；",
        "translation": "When he uttered the phonetic svāhā, he entered the door of transcendent wisdom called the ultimate abode of liberating sentient beings.",
        "source": "T10n0279_076:0418b21_10"
    },
    {
        "source_sentence": "唱娑(同前音)迦字時，入般若波羅蜜門，名：廣大藏無礙辯光明輪遍照；",
        "translation": "When he uttered the letter sākya, he entered the door of transcendent wisdom called universal illumination of the sphere of unobstructed light of vast stores of knowledge.",
        "source": "T10n0279_076:0418b22_11"
    },
    {
        "source_sentence": "唱也(夷舸切)娑(蘇舸切)字時，入般若波羅蜜門，名：宣說一切佛法境界；",
        "translation": "“When the Sanskrit phoneme samādhi is uttered, he enters the door of transcendent wisdom called expounding the sphere of all Buddha teachings.",
        "source": "T10n0279_076:0418b24_12"
    },
    {
        "source_sentence": "唱室者字時，入般若波羅蜜門，名：於一切眾生界法雷遍吼；",
        "translation": "When the word “chamber” was uttered, he entered the door of transcendent wisdom called all-pervading roar of the thunder of truth in all realms of sentient beings.",
        "source": "T10n0279_076:0418b25_13"
    },
    {
        "source_sentence": "唱侘(恥加切)字時，入般若波羅蜜門，名：以無我法開曉眾生；",
        "translation": "When they uttered the phonemes ashamed, they entered the door of transcendent wisdom called awakening sentient beings by means of selflessness.",
        "source": "T10n0279_076:0418b27_14"
    },
    {
        "source_sentence": "唱陀字時，入般若波羅蜜門，名：一切法輪差別藏。",
        "translation": "When the word dhāraṇī was uttered, he entered the gate of prajñā-pāramitā called store of distinctions in all wheels of teaching.",
        "source": "T10n0279_076:0418b28_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0418b29_16"
    },
    {
        "source_sentence": "我唱如是字母時，此四十二般若波羅蜜門為首，入無量無數般若波羅蜜門。",
        "translation": "When I sing these letters, these forty-two prajñāpāramitā approaches are the first and enter measureless and countless prajñāpāramitā approaches.",
        "source": "T10n0279_076:0418b29_17"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0418c02_18"
    },
    {
        "source_sentence": "我唯知此善知眾藝菩薩解脫。",
        "translation": "I only know this liberation of the bodhisattva who knows well the arts and crafts.",
        "source": "T10n0279_076:0418c02_19"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，能於一切世、出世間善巧之法，以智通達到於彼岸；",
        "translation": "“Just as great enlightening beings can reach the other shore by means of knowledge and penetration of all worldly and transmundane skillful means.",
        "source": "T10n0279_076:0418c03_20"
    },
    {
        "source_sentence": "殊方異藝，咸綜無遺；",
        "translation": "The various arts and crafts of different countries from different regions were collected together without exception.",
        "source": "T10n0279_076:0418c05_0"
    },
    {
        "source_sentence": "文字、算數，蘊其深解；",
        "translation": "Their profound understandings of words and calculation included their profound understandings.",
        "source": "T10n0279_076:0418c05_1"
    },
    {
        "source_sentence": "醫方、呪術，善療眾病；",
        "translation": "They are skilled in the use of medicine and magical spells to treat all illnesses.",
        "source": "T10n0279_076:0418c05_2"
    },
    {
        "source_sentence": "有諸眾生，鬼魅所持，怨憎呪詛，惡星變怪，死屍奔逐，癲癇、羸瘦，",
        "translation": "“Some sentient beings are possessed by ghosts, demons, enemies, spells, and curses; bad stars cast strange spells; dead corpses run away in flight; they suffer from  convulsions and lose weight.",
        "source": "T10n0279_076:0418c06_3"
    },
    {
        "source_sentence": "種種諸疾，咸能救之，使得痊愈；",
        "translation": "They were able to cure all kinds of ailments, enabling them to be cured.",
        "source": "T10n0279_076:0418c07_4"
    },
    {
        "source_sentence": "又善別知金玉、珠貝、珊瑚、瑠璃、摩尼、硨磲、雞薩羅等一切寶藏，",
        "translation": "He was also well versed in the storehouses of all precious treasures, such as gold, silver, pearls, shellfish, coral, lapis lazuli, crystal, copper, and brass.",
        "source": "T10n0279_076:0418c08_5"
    },
    {
        "source_sentence": "出生之處，品類不同，價直多少；",
        "translation": "The places of birth are different in type and value.",
        "source": "T10n0279_076:0418c10_0"
    },
    {
        "source_sentence": "村營鄉邑、大小都城、宮殿苑園、巖泉藪澤，凡是一切人眾所居，菩薩咸能隨方攝護；",
        "translation": "Enlightening beings can take care of all the villages, towns, cities, palaces, parks, cliffs, rivers, streams, marshes, and swamps wherever they live.",
        "source": "T10n0279_076:0418c10_1"
    },
    {
        "source_sentence": "又善觀察天文地理、人相吉凶、鳥獸音聲、雲霞氣候、年穀豐儉、國土安危，",
        "translation": "He also observed astronomy and geography, the signs of good and bad omens for humans and animals, the sounds of birds and beasts, clouds and moonlight, the climate, the abundance of grain and crops, and the well-being of the land.",
        "source": "T10n0279_076:0418c12_2"
    },
    {
        "source_sentence": "如是世間所有技藝，莫不該練，盡其源本；",
        "translation": "In this way, all the arts and crafts of the world are cultivated in such a way as to exhaust their source.",
        "source": "T10n0279_076:0418c14_3"
    },
    {
        "source_sentence": "又能分別出世之法，正名辨義，觀察體相，隨順修行，智入其中，無疑、無礙、無愚暗、無頑鈍、無憂惱、無沈沒、無不現證。",
        "translation": "They can also discern and analyze transcendental dharmas, precisely identify their names and meanings, observe their essence and characteristics, follow their cultivation, enter them with knowledge, have no doubt, no obstruction, no ignorance, no darkness, no dullness, no torpor, no sorrow, no sinking, and no unmanifest realization.",
        "source": "T10n0279_076:0418c15_4"
    },
    {
        "source_sentence": "而我云何能知能說彼功德行？",
        "translation": "How can I know and explain their meritorious deeds?",
        "source": "T10n0279_076:0418c18_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0418c18_6"
    },
    {
        "source_sentence": "此摩竭提國，有一聚落，彼中有城，名：婆呾那；",
        "translation": "In this country of Magadha there is a village in which there is a city called Vātsīputrīya.",
        "source": "T10n0279_076:0418c18_7"
    },
    {
        "source_sentence": "有優婆夷，號曰：賢勝。",
        "translation": "There was a layman named Bhadravyūha.",
        "source": "T10n0279_076:0418c19_8"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0418c20_9"
    },
    {
        "source_sentence": "時，善財童子頭面敬禮知藝之足，遶無數匝，戀仰辭去。",
        "translation": "Then Sudhana paid his respects to Maitreya and departed. The prince Sudhana paid his respects by bowing his forehead to the feet of Maitreya’s feet, knowing that he was well versed in arts and sciences.",
        "source": "T10n0279_076:0418c21_10"
    },
    {
        "source_sentence": "向聚落城，至賢勝所，禮足圍遶，合掌恭敬，於一面立，白言：「聖者！",
        "translation": "He went to the city of the village, came to Bhadrapāla, saluted him by bowing his feet, joined his palms in respect, stood to one side, and said, Sage!",
        "source": "T10n0279_076:0418c23_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0418c24_1"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0418c25_2"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0418c26_3"
    },
    {
        "source_sentence": "賢勝答言：「善男子！",
        "translation": "Bhadrapāla replied, Good man!",
        "source": "T10n0279_076:0418c26_4"
    },
    {
        "source_sentence": "我得菩薩解脫，名：無依處道場；",
        "translation": "“I have attained an enlightening liberation called site of nondependence.",
        "source": "T10n0279_076:0418c27_5"
    },
    {
        "source_sentence": "既自開解，復為人說。",
        "translation": "Having self-enlightened himself, he then explains it for others.",
        "source": "T10n0279_076:0418c28_6"
    },
    {
        "source_sentence": "又得無盡三昧，非彼三昧法有盡、無盡，以能出生一切智性眼無盡故，",
        "translation": "Also, when one attains inexhaustible concentration, it is not that the factors of concentration have an end and no end: because the eye which produces the nature of omniscience cannot be exhausted.",
        "source": "T10n0279_076:0418c28_7"
    },
    {
        "source_sentence": "又能出生一切智性耳無盡故，又能出生一切智性鼻無盡故，又能出生一切智性舌無盡故，",
        "translation": "It also produces the ear of omniscience because it is inexhaustible. It also produces the nose of omniscience because it is inexhaustible. It also produces the tongue of omniscience because it is inexhaustible.",
        "source": "T10n0279_076:0419a01_8"
    },
    {
        "source_sentence": "又能出生一切智性身無盡故，又能出生一切智性意無盡故，又能出生一切智性功德波濤無盡故，",
        "translation": "It also produces the body of omniscience because it is inexhaustible; it also produces the mind of omniscience because it is inexhaustible; and it also produces the waves of virtue of omniscience because it is inexhaustible.",
        "source": "T10n0279_076:0419a03_9"
    },
    {
        "source_sentence": "又能出生一切智性智慧光明無盡故，又能出生一切智性速疾神通無盡故。",
        "translation": "It's because it can also produce the inexhaustible light of omniscience and wisdom, and it can also produce the inexhaustible swiftness of omniscience and supernormal abilities.",
        "source": "T10n0279_076:0419a05_10"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419a07_11"
    },
    {
        "source_sentence": "我唯知此無依處道場解脫。",
        "translation": "I only know that this is the liberation of the baseless site of enlightenment.",
        "source": "T10n0279_076:0419a07_12"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩一切無著功德行，而我云何盡能知說？",
        "translation": "Just as all the bodhisattva-mahāsattvas practice unattached merit, how can I fully know and explain it?",
        "source": "T10n0279_076:0419a08_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419a09_14"
    },
    {
        "source_sentence": "南方有城，名為：沃田；",
        "translation": "To the south is a city called fertile field.",
        "source": "T10n0279_076:0419a09_15"
    },
    {
        "source_sentence": "彼有長者，名：堅固解脫。",
        "translation": "There was an elder there named Steadfast Deliverance.",
        "source": "T10n0279_076:0419a10_16"
    },
    {
        "source_sentence": "汝可往問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0419a10_17"
    },
    {
        "source_sentence": "爾時，善財禮賢勝足，遶無數匝，戀慕瞻仰，辭退南行。",
        "translation": "At the time, Sun Cai paid his respects to Bhadrapāla and circumambulated him countless times. With affection and veneration, he withdrew and traveled toward the south.",
        "source": "T10n0279_076:0419a11_18"
    },
    {
        "source_sentence": "到於彼城，詣長者所，禮足圍遶，合掌恭敬，於一面立，白言：「聖者！",
        "translation": "When he arrived in that city, he went to the elder's place, bowed his head at his feet, saluted him with joined palms and respect, stood to one side, and said, Sage!",
        "source": "T10n0279_076:0419a13_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0419a14_1"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0419a15_2"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0419a16_3"
    },
    {
        "source_sentence": "長者答言：「善男子！",
        "translation": "The elder replied, Good man!",
        "source": "T10n0279_076:0419a16_4"
    },
    {
        "source_sentence": "我得菩薩解脫，名：無著念清淨莊嚴。",
        "translation": "I have attained an enlightening liberation called pure adornment of unattached mindfulness.",
        "source": "T10n0279_076:0419a17_5"
    },
    {
        "source_sentence": "我自得是解脫已來，於十方佛所勤求正法無有休息。",
        "translation": "Ever since I attained this liberation, I've diligently pursued the right teaching in the presence of buddhas in the ten directions without resting.",
        "source": "T10n0279_076:0419a18_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419a19_7"
    },
    {
        "source_sentence": "我唯知此無著念淨莊嚴解脫。",
        "translation": "I only know this liberation of the pure adornment of unattached mindfulness.",
        "source": "T10n0279_076:0419a19_8"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，獲無所畏大師子吼，安住廣大福智之聚；",
        "translation": "“Just as great enlightening beings attain the lion’s roar of fearlessness, so they dwell in a vast mass of virtue and knowledge.",
        "source": "T10n0279_076:0419a20_9"
    },
    {
        "source_sentence": "而我云何能知能說彼功德行？",
        "translation": "How can I know and explain their meritorious deeds?",
        "source": "T10n0279_076:0419a21_10"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419a22_11"
    },
    {
        "source_sentence": "即此城中，有一長者，名為：妙月；",
        "translation": "In this city there was an elder named Moon of Wonder.",
        "source": "T10n0279_076:0419a22_12"
    },
    {
        "source_sentence": "其長者宅，常有光明。",
        "translation": "The house of the wealthy man always had a bright light.",
        "source": "T10n0279_076:0419a23_13"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0419a23_14"
    },
    {
        "source_sentence": "時，善財童子禮堅固足，遶無數匝，辭退而行。",
        "translation": "Then Sudhana paid his respects to the young brahman Supratishthita and, having saluted him by touching his forehead with his feet, left.",
        "source": "T10n0279_076:0419a24_15"
    },
    {
        "source_sentence": "向妙月所，禮足圍遶，合掌恭敬，於一面立，白言：「聖者！",
        "translation": "He went to the place where Marvelous Moon was, circumambulated him by bowing his feet, joined his palms in respect, stood to one side, and said, Sage!",
        "source": "T10n0279_076:0419a26_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0419a27_1"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0419a28_2"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0419a29_0"
    },
    {
        "source_sentence": "妙月答言：「善男子！",
        "translation": "Miao Yue replied, Good man!",
        "source": "T10n0279_076:0419a29_1"
    },
    {
        "source_sentence": "我得菩薩解脫，名：淨智光明。",
        "translation": "I have attained an enlightening liberation called pure light of knowledge.",
        "source": "T10n0279_076:0419b01_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419b01_3"
    },
    {
        "source_sentence": "我唯知此智光解脫。",
        "translation": "I only know this liberation of the light of knowledge.",
        "source": "T10n0279_076:0419b02_0"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩證得無量解脫法門，而我云何能知能說彼功德行？",
        "translation": "Just as the bodhisattvas, mahāsattvas, have realized the Dharma teaching of immeasurable liberation, how can I know and explain their meritorious practices?",
        "source": "T10n0279_076:0419b02_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419b04_2"
    },
    {
        "source_sentence": "於此南方，有城名：出生；",
        "translation": "“South of here is a city called Birth:",
        "source": "T10n0279_076:0419b04_3"
    },
    {
        "source_sentence": "彼有長者，名：無勝軍。",
        "translation": "There was an elder there named Unsurpassed Army.",
        "source": "T10n0279_076:0419b04_4"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0419b05_5"
    },
    {
        "source_sentence": "是時，善財禮妙月足，遶無數匝，戀仰辭去。",
        "translation": "At that time Sudhana paid his respects and departed. Then Sudhana paid his respects to Maitreya and left.",
        "source": "T10n0279_076:0419b06_6"
    },
    {
        "source_sentence": "漸向彼城，至長者所，禮足圍遶，合掌恭敬，於一面立，白言：「聖者！",
        "translation": "He gradually approached the city, went to the elder, saluted him by bowing his feet, joined his palms in respect, stood to one side, and said, Sage!",
        "source": "T10n0279_076:0419b08_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0419b09_1"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0419b10_2"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0419b11_3"
    },
    {
        "source_sentence": "長者答言：「善男子！",
        "translation": "The elder replied, Good man!",
        "source": "T10n0279_076:0419b11_4"
    },
    {
        "source_sentence": "我得菩薩解脫，名：無盡相。",
        "translation": "I have attained enlightening liberation called inexhaustible characteristics.",
        "source": "T10n0279_076:0419b12_5"
    },
    {
        "source_sentence": "我以證此菩薩解脫，見無量佛，得無盡藏。",
        "translation": "Because I realized the liberation of this bodhisattva, saw innumerable buddhas and attained an inexhaustible store.",
        "source": "T10n0279_076:0419b13_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419b13_1"
    },
    {
        "source_sentence": "我唯知此無盡相解脫。",
        "translation": "I only know this inexhaustible liberation.",
        "source": "T10n0279_076:0419b14_2"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩得無限智無礙辯才，而我云何能知能說彼功德行？",
        "translation": "Just as the bodhisattvas, mahāsattvas, have attained infinite knowledge and unhindered eloquence, how can I know and explain their meritorious actions?",
        "source": "T10n0279_076:0419b14_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419b16_4"
    },
    {
        "source_sentence": "於此城南，有一聚落，名之為：法；",
        "translation": "To the south of this city there was a village called Dharma.",
        "source": "T10n0279_076:0419b16_5"
    },
    {
        "source_sentence": "彼聚落中，有婆羅門，名：最寂靜。",
        "translation": "In that village there was a brahman named Most Tranquil.",
        "source": "T10n0279_076:0419b17_6"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0419b17_7"
    },
    {
        "source_sentence": "時，善財童子禮無勝軍足，遶無數匝，戀仰辭去。",
        "translation": "Sudhana paid his respects and departed. Then Sudhana paid his respects to the young brahman Supratishthita and left.",
        "source": "T10n0279_076:0419b18_8"
    },
    {
        "source_sentence": "漸次南行，詣彼聚落，見最寂靜，禮足圍遶，合掌恭敬，於一面立，白言：「聖者！",
        "translation": "Going gradually to the south, he went to another village and saw the most peaceful tranquil place. Surrounded by him at his feet, he joined his palms in respect and stood to one side, saying:",
        "source": "T10n0279_076:0419b20_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings.",
        "source": "T10n0279_076:0419b21_1"
    },
    {
        "source_sentence": "云何修菩薩道？",
        "translation": "How do they cultivate the path of enlightening beings?",
        "source": "T10n0279_076:0419b23_2"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說！」",
        "translation": "I've heard that the noble person is well able to teach, so please explain it for me!",
        "source": "T10n0279_076:0419b23_3"
    },
    {
        "source_sentence": "婆羅門答言：「善男子！",
        "translation": "The Brāhmaṇa replied, Good man!",
        "source": "T10n0279_076:0419b24_4"
    },
    {
        "source_sentence": "我得菩薩解脫，名：誠願語；",
        "translation": "“I have attained an enlightening liberation called vows of faith.",
        "source": "T10n0279_076:0419b24_5"
    },
    {
        "source_sentence": "過去、現在、未來菩薩，以是語故，乃至於阿耨多羅三藐三菩提，無有退轉，",
        "translation": "Because of these words, the enlightening beings of past, present, and future do not regress even to unexcelled complete perfect enlightenment.",
        "source": "T10n0279_076:0419b25_6"
    },
    {
        "source_sentence": "無已退、無現退、無當退。",
        "translation": "There's no retreat, no present retreat, and no future retreat.",
        "source": "T10n0279_076:0419b26_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419b27_8"
    },
    {
        "source_sentence": "我以住於誠願語故，隨意所作，莫不成滿。",
        "translation": "Because of my abiding in sincere vows, I do as I wish, and none of them are fulfilled.",
        "source": "T10n0279_076:0419b27_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419b28_10"
    },
    {
        "source_sentence": "我唯知此誠語解脫。",
        "translation": "I only know this liberation of sincere speech.",
        "source": "T10n0279_076:0419b28_11"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，與誠願語，行止無違，言必以誠，未曾虛妄，無量功德因之出生；",
        "translation": "“Good son, just as the practice of enlightening beings is not at odds with their sincere vow and vows, so they speak without contradiction. Their words must be spoken with sincerity, never false; immeasurable virtues arise because of them.",
        "source": "T10n0279_076:0419b29_12"
    },
    {
        "source_sentence": "而我云何能知能說？",
        "translation": "How can I know and explain it?",
        "source": "T10n0279_076:0419c02_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_076:0419c02_14"
    },
    {
        "source_sentence": "於此南方，有城名：妙意華門；",
        "translation": "“South of here is a city called Gate of the Flower Ornament of Marvelous Thoughts.",
        "source": "T10n0279_076:0419c02_15"
    },
    {
        "source_sentence": "彼有童子，名曰：德生；",
        "translation": "There was a boy there named Virtuous Arising.",
        "source": "T10n0279_076:0419c03_16"
    },
    {
        "source_sentence": "復有童女，名為：有德。",
        "translation": "Again, there was a girl named Virtuous.",
        "source": "T10n0279_076:0419c03_17"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_076:0419c04_18"
    },
    {
        "source_sentence": "時，善財童子於法尊重，禮婆羅門足，遶無數匝，戀仰而去。",
        "translation": "Then Sudhana paid his respects to the brahman’s feet and departed. Out of respect for the buddha, he venerated him by bowing his forehead to the Buddha’s feet.",
        "source": "T10n0279_076:0419c05_19"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第七十六",
        "translation": "Dafangguang fo huayan jing, vol. 76",
        "source": "T10n0279_076:0419c07_0"
    }
]