[
    {
        "source_sentence": "漸備一切智德經卷第一",
        "translation": "Gradual Preparation of the Sutra on All Virtues of Wisdom, Volume 1",
        "source": "T10n0285_001:0458a16_0"
    },
    {
        "source_sentence": "　　　　　　　　(一名十住，又名大慧光三昧)",
        "translation": "(one name is the ten abodes, and it's also called the great wisdom-luminosity concentration)",
        "source": "T10n0285_001:0458a18_0"
    },
    {
        "source_sentence": "西晉月支三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, a translator of the Western Jin Yuezhi Tripiṭaka",
        "source": "T10n0285_001:0458a19_0"
    },
    {
        "source_sentence": "初發意悅豫住品第一",
        "translation": "Chapter 1 of the First Awakening of the intention to abide happily abiding",
        "source": "T10n0285_001:0458a20_0"
    },
    {
        "source_sentence": "聞如是：一時，佛遊第六他化自在天上天王宮如意藏珠妙寶殿上，與大菩薩眾不可計俱，",
        "translation": "Thus I heard: One time, the Buddha was staying at the palace of the jewel wish-granting pearl of the sixth abode of the celestial king Paranirmitavaśavartin in the heavenly palace of the sixth deity Paranirmitavaśavartin, accompanied by countless great assemblies of enlightening beings",
        "source": "T10n0285_001:0458a21_0"
    },
    {
        "source_sentence": "各從他方諸佛國來，普集會此，金剛藏菩薩等。",
        "translation": "Each of them came from other buddha lands and assembled here, such as the Vajragarbha Bodhisattva.",
        "source": "T10n0285_001:0458a23_1"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩承佛威神，以大慧光三昧正受，適定意已；",
        "translation": "At that time the enlightening being Diamond Matrix, imbued with the spiritual power of buddhahood, entered concentration by means of great wisdom.",
        "source": "T10n0285_001:0458a24_2"
    },
    {
        "source_sentence": "應時十方諸佛剎土，一一諸方，如十億佛剎滿中諸塵若干億國，諸如來現，",
        "translation": "The buddha-lands of the ten directions, in each direction like billions of buddha-lands filled with dust and hundreds of millions of lands—the enlightened ones appeared.",
        "source": "T10n0285_001:0458a25_3"
    },
    {
        "source_sentence": "邊有菩薩，其號各各曰金剛藏；",
        "translation": "On each side was an enlightening being named Diamond Matrix.",
        "source": "T10n0285_001:0458a27_4"
    },
    {
        "source_sentence": "十方亦然，皆同一號。",
        "translation": "So it is in the ten directions, all with the same name.",
        "source": "T10n0285_001:0458a27_5"
    },
    {
        "source_sentence": "時此諸佛，俱讚曰：「善哉，善哉！",
        "translation": "These buddhas then praised him, saying, Good, good!",
        "source": "T10n0285_001:0458a28_6"
    },
    {
        "source_sentence": "汝乃以此大慧光菩薩三昧，而以正受，在十方佛土，各如十億滿中諸塵諸如來等之所建立，",
        "translation": "“With this concentration of enlightening being Light of Great Wisdom you entered the buddha-lands of the ten directions, as many buddhas as atoms in ten billion buddha-lands.",
        "source": "T10n0285_001:0458a29_7"
    },
    {
        "source_sentence": "一切等號，悉是照明，如來至真，本願所致，而建立此，亦是仁者慧淨所致，",
        "translation": "All these epithets are all manifestations of illumination. The Tathāgata, the supremely true one, established them as he had done in his past vows, and they are also the result of kindness, wisdom, and purity.",
        "source": "T10n0285_001:0458b02_8"
    },
    {
        "source_sentence": "復是一切諸菩薩等，不可思議法光聖旨，住明智地，多所度脫，攝取一切眾德之本，",
        "translation": "“Furthermore, all enlightening beings have the holy aspiration of inconceivable illumination of truth; they abide in the state of knowledge and wisdom. They are often liberated, embracing the essence of all virtues.",
        "source": "T10n0285_001:0458b03_9"
    },
    {
        "source_sentence": "皆曉諸佛本所行成，愍念十方，解了善權，敷演道化，普弘法慧，周流十方；",
        "translation": "They all knew what the buddhas had practiced in the past. They were mindful of the ten directions, comprehended righteousness, expounded doctrine and inspired enlightenment, and universally propagated the knowledge of truth; they flowed everywhere in the ten directions.",
        "source": "T10n0285_001:0458b05_10"
    },
    {
        "source_sentence": "所講經誼，盡令堅住，其智慧明無能毀者，隨時建立僉使得安；",
        "translation": "The meaning of the scriptures he taught was to make them all firmly endure. His wisdom and insight were so clear that they could not be slandered. He established peacefulness by settling disputes at any time.",
        "source": "T10n0285_001:0458b07_11"
    },
    {
        "source_sentence": "遊諸世間不著方俗，度世清淨，莊嚴善本，入不可議慧之境界，通一切智，",
        "translation": "He traveled to all worlds without attachment to localities or customs, liberated the world from its purity, adorned his roots of goodness, entered the sphere of inconceivable wisdom, and had omniscience.",
        "source": "T10n0285_001:0458b08_12"
    },
    {
        "source_sentence": "高遠聖道，乃能招致諸菩薩等，十住行無。",
        "translation": "The noble path that's so high and distant is able to summon bodhisattvas and so forth, but the ten abodes of practice are absent.",
        "source": "T10n0285_001:0458b10_13"
    },
    {
        "source_sentence": "如開士眾所當建立，有所宣布，往返周旋，執無漏法，光明咸照，而善思惟，",
        "translation": "“Good son, it is just as the enlightened ones proclaim what should be established by the assembly of Buddhist disciples. Having proclaimed this doctrine, they go and revolve in all directions, holding fast to the uncontaminated dharmas; their light illumines them all, and reflects upon them well.",
        "source": "T10n0285_001:0458b11_14"
    },
    {
        "source_sentence": "撰於離心，曉了隨時。",
        "translation": "It's compiled in the mind of seclusion, which understands it at any time.",
        "source": "T10n0285_001:0458b13_15"
    },
    {
        "source_sentence": "大慧光明，其未善度，至聖道門，使得度脫而無所著。",
        "translation": "The light of great wisdom, which they haven't well liberated, reaches the gate of the noble path and enables them to be liberated without attachment.",
        "source": "T10n0285_001:0458b13_16"
    },
    {
        "source_sentence": "住於內行，專精奉修無上大乘，其辯才慧不可稱載，威曜普照消除闇冥，",
        "translation": "Abiding in internal practices, they concentrate their efforts on the cultivation of the supreme Great Vehicle. Their eloquence and wisdom cannot be praised; their majesty illumines all and removes darkness.",
        "source": "T10n0285_001:0458b14_17"
    },
    {
        "source_sentence": "已超眾行班宣無極，住在佛地逮菩薩意，愍念眾生未曾忘捨，遊入一切諸佛至真善權方便，",
        "translation": "Having transcended the class of practices, he proclaims infinity; abiding in the Buddha-stage, he apprehends the minds of enlightening beings. With compassion for sentient beings, he never forgets them. He travels to all buddhas’ supremely good means of expediency.",
        "source": "T10n0285_001:0458b16_18"
    },
    {
        "source_sentence": "決眾結網。",
        "translation": "It's to resolve the crowd's net of fetters.",
        "source": "T10n0285_001:0458b18_19"
    },
    {
        "source_sentence": "承佛聖旨，自恣講說，演此法門靡不解了，如來在世，故為建立，亦是卿本善願所致。",
        "translation": "In accordance with the Buddha’s holy decree you freely expound this doctrine and all understand it. Because the Tathagata abides in the world, he establishes it for your sake. This is also due to your original good intention.",
        "source": "T10n0285_001:0458b19_0"
    },
    {
        "source_sentence": "清淨行業，而諦莊嚴一切法界，又救眾生之所惑亂，以致法身至聖慧體，",
        "translation": "They practice pure deeds, yet they truly adorn all realms of reality. They also rescue sentient beings from their confusions and disturbances, thereby developing the body of truth into the essence of holy wisdom.",
        "source": "T10n0285_001:0458b20_1"
    },
    {
        "source_sentence": "具足諸佛本所志願，其身所行，皆越世俗，普過世間無益之業，嚴飾清淨，",
        "translation": "They are endowed with the original vows of all buddhas. Their bodily deeds transcend worldly conventions, and they go beyond worldly useless acts, adorning themselves with purity.",
        "source": "T10n0285_001:0458b22_2"
    },
    {
        "source_sentence": "度世之法。",
        "translation": "It's the way to save the world.",
        "source": "T10n0285_001:0458b24_3"
    },
    {
        "source_sentence": "諸佛世尊，為金剛藏菩薩大士，無所悋惜，各現己身，宣布無限辯才之義，",
        "translation": "The buddhas, world-honored ones, each manifested themselves as great enlightening beings and bodhisattvas of the adamantine treasury, without stinginess or indifference, proclaiming the meaning of infinite eloquence.",
        "source": "T10n0285_001:0458b24_4"
    },
    {
        "source_sentence": "分別決解甚清淨慧，懷抱不忘，建立顯示，隨時便宜，暢眾疑心，普入一切諸佛所念，",
        "translation": "Their discernment and determination are extremely pure; they embrace, retain, and do not forget their wisdom. They establish and show the Teaching at appropriate times to dispel any doubts of those who doubt it. They enter into the thoughts of all buddhas.",
        "source": "T10n0285_001:0458b26_5"
    },
    {
        "source_sentence": "諸等正覺十力所由，如來所致四無所畏，而不怯弱，宣布至教，一切智業，",
        "translation": "Because of their ten powers, the enlightened ones attain the four forms of fearlessness brought about by buddhas and are not faint-hearted. They proclaim the supreme Teaching (i.e., omniscience).",
        "source": "T10n0285_001:0458b28_6"
    },
    {
        "source_sentence": "諸分別辯，超越得入體解道法，入諸如來身、口、心行。",
        "translation": "Their discriminating eloquence transcends the attainment, entry, essence, and understanding of the path and enters into the Tathāgata's bodily, verbal, and mental actions.",
        "source": "T10n0285_001:0458b29_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0285_001:0458c01_8"
    },
    {
        "source_sentence": "皆由此定，成就所致，亦由本願，行通巍巍，其心清淨，而無沾污。",
        "translation": "Because of the accomplishment of this absorption, his mind becomes pure and not stained by defilement.",
        "source": "T10n0285_001:0458c02_9"
    },
    {
        "source_sentence": "內性明了，常懷清淨，威燿弘炤，入于慧場。",
        "translation": "Their inwardly enlightened minds always harbor purity and genuineness. Endowed with great power and loftiness, they enter the terrace of wisdom.",
        "source": "T10n0285_001:0458c03_10"
    },
    {
        "source_sentence": "諸所行業，靡不備焉，斯所造立，而悉具足，其道器意，不可限量，信志清淨，",
        "translation": "All the deeds they undertake are fully accomplished. Their vessels of enlightenment cannot be limited, and their faith and aspiration are pure.",
        "source": "T10n0285_001:0458c04_11"
    },
    {
        "source_sentence": "巍巍普達，逮總持門，無所破壞，常以法界慧門之印，善印一切。」",
        "translation": "He's majestic and universally penetrating, fully comprehending the approach of mastery, not destroying anything, always using the seal of the gate of wisdom of the Dharma realm to skillfully seal them all.",
        "source": "T10n0285_001:0458c06_12"
    },
    {
        "source_sentence": "是諸佛世尊，各自顯現，各申右臂，皆共手摩金剛藏菩薩頭首。",
        "translation": "These buddhas and world-honored ones each manifested, each extending his right arm, and they all joined their hands and touched the heads of Vajragarbha Bodhisattva.",
        "source": "T10n0285_001:0458c07_13"
    },
    {
        "source_sentence": "時金剛藏為諸世尊，所見摩頭，道德巍巍遂得成就，威耀光光如佛無異。",
        "translation": "The Vajragarbha was then seen by the world-honored ones to moisten their heads, and their morality became so lofty that they accomplished it, with a majestic radiance like the Buddha's.",
        "source": "T10n0285_001:0458c09_14"
    },
    {
        "source_sentence": "爾時尋即從三昧起，請諸菩薩而解言曰：「諸最勝子！",
        "translation": "It was then that he rose from his concentration and asked the bodhisattvas to understand, saying, Most excellent sons!",
        "source": "T10n0285_001:0458c11_0"
    },
    {
        "source_sentence": "吾已明達諸菩薩願，破壞疑網，則無所壞，世無所生亦無罪釁，法界弘廣亦無遠近，",
        "translation": "I’ve already clearly understood the vows of enlightening beings and destroyed the web of doubt, yet there is nothing to be destroyed. The world has no origin or source of blame, and the cosmos of reality is vast and far-reaching, neither distant nor near.",
        "source": "T10n0285_001:0458c12_1"
    },
    {
        "source_sentence": "其所遊居譬如虛空，以是救濟，擁護十方一切眾生。",
        "translation": "Their excursions and abodes are like space, which they use to rescue and embrace all sentient beings in the ten directions.",
        "source": "T10n0285_001:0458c14_2"
    },
    {
        "source_sentence": "所以然者，族姓子知，過去菩薩，往古諸佛，由此慧地而得過度，當來現在亦復如是。",
        "translation": "The reason for this is that clansmen know that past bodhisattvas and buddhas of ancient times attained transcendence from this stage of wisdom, and so it will be likewise in the future and present.",
        "source": "T10n0285_001:0458c15_3"
    },
    {
        "source_sentence": "諸佛子知，我向者云，菩薩之地，為何謂也。",
        "translation": "“O sons of the Buddha! You know that I addressed you, saying: What is meant by the bodhisattva stage?",
        "source": "T10n0285_001:0458c17_4"
    },
    {
        "source_sentence": "諸菩薩學有十道地，因得成就無上正覺，去來今佛之所講說：初菩薩住名曰悅豫，",
        "translation": "There are ten stages of enlightenment for bodhisattvas who, having attained the supreme awakening, practice it. The buddhas of past, present and future teach this:",
        "source": "T10n0285_001:0458c18_5"
    },
    {
        "source_sentence": "第二菩薩住名曰離垢，第三菩薩住名曰興光，第四菩薩住名曰暉曜，第五菩薩住名曰難勝，",
        "translation": "The second abode of enlightening beings is called Undefiled, the third abode of enlightening beings is called Producing Light, the fourth abode of enlightening beings is called Radiance, and the fifth abode of enlightening beings is called Difficult to Conquer.",
        "source": "T10n0285_001:0458c19_6"
    },
    {
        "source_sentence": "第六菩薩住名曰目見，第七菩薩住名曰玄妙，第八菩薩住名曰不動，第九菩薩住名曰善哉意，",
        "translation": "The sixth abode of enlightening beings is called eye-view, the seventh abode of enlightening beings is called mysterious, the eighth abode of enlightening beings is called unshakable, and the ninth abode of enlightening beings is called sublime mind.",
        "source": "T10n0285_001:0458c22_7"
    },
    {
        "source_sentence": "第十菩薩住名曰法雨，是諸菩薩十住道地也。",
        "translation": "The tenth bodhisattva abode is called the Dharma rain, which are the ten bodhisattvas' ten abodes of enlightenment.",
        "source": "T10n0285_001:0458c24_8"
    },
    {
        "source_sentence": "我觀十方去來今佛，諸如來至真，無不講此十住之業。",
        "translation": "I observe the past, future, and present buddhas of the ten directions, and there are truly no tathāgatas who don't fail to teach these ten abodes of karma.",
        "source": "T10n0285_001:0458c25_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0285_001:0458c26_10"
    },
    {
        "source_sentence": "諸佛子等，是十住者，令諸菩薩，現在親近清淨道無為諸法門，名顯遠照于十方無數佛土，",
        "translation": "Sons of Buddha, these ten abodes cause enlightening beings to become intimate with the unconditioned dharmas of the pure path. They are called manifestation and far-reaching illumination of the countless buddha-lands of the ten directions.",
        "source": "T10n0285_001:0458c26_11"
    },
    {
        "source_sentence": "三界眾生咸蒙得濟，照天下如日明，療眾病如醫王，度眾人如船師，曜十方如月盛，",
        "translation": "All sentient beings in the three realms will be saved, illuminating the world like the sun shining brightly, treating illnesses like a king of doctors, liberating people like a boat captain, illumining the ten directions like the moon waxing and waning.",
        "source": "T10n0285_001:0458c28_12"
    },
    {
        "source_sentence": "活一切猶如地，安眾生如時雨，含道法如虛空，正堅住如須彌，宣布此教，",
        "translation": "Their livelihood is like the earth, and their well-being to sentient beings is like the seasonal rain. They contain the Teaching of enlightenment like space, which stands firmly like a polar mountain.",
        "source": "T10n0285_001:0459a01_13"
    },
    {
        "source_sentence": "則得堅立在十道地，又解此地不可思議諸菩薩住，僉入聖慧。」",
        "translation": "They then attain firmness in the ten stages of the path, understand this place as an inconceivable abode for bodhisattvas and enter it with noble wisdom.",
        "source": "T10n0285_001:0459a03_14"
    },
    {
        "source_sentence": "時金剛藏菩薩，粗舉其要，歎此菩薩十住地業，尋即默然，不復重解。",
        "translation": "The Vajragarbha Bodhisattva then summarized the essentials and praised this bodhisattva's ten abodes of earthly actions, remained silent for a while, and didn't understand again.",
        "source": "T10n0285_001:0459a04_15"
    },
    {
        "source_sentence": "於是大眾，咸懷飢虛，聞此菩薩十住道名，欲令分別重敷演義，聞者僉解，",
        "translation": "Then the great assembly, all hungry and fainthearted, heard the names of these ten paths of enlightening beings’ ten abodes. Wishing to make them discern and elaborate their meanings, those who heard them understood.",
        "source": "T10n0285_001:0459a07_0"
    },
    {
        "source_sentence": "心懷入道，離諸顛倒，各心念言：「金剛藏菩薩今何以故，粗舉其要，",
        "translation": "They each thought to themselves, “O Vajragarbha Bodhisattva! What is the reason we have summarized this brief exhortation?",
        "source": "T10n0285_001:0459a08_1"
    },
    {
        "source_sentence": "宣於十住菩薩之業，稱歎其號而更默然，不復重散解了本末？」",
        "translation": "He proclaimed the activities of the bodhisattvas in the ten abodes, praised their names, and remained silent, not again dispersed to understand the beginning and end?",
        "source": "T10n0285_001:0459a10_2"
    },
    {
        "source_sentence": "時彼會中有一菩薩，名月解脫，亦來俱會。",
        "translation": "At the time, there was a bodhisattva in that assembly named Moon Liberation who also came to the assembly.",
        "source": "T10n0285_001:0459a11_3"
    },
    {
        "source_sentence": "「淨念以何故，　　懷慧稱功勳；",
        "translation": "“Why is pure mindfulness called merit because it harbors wisdom?",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　明智宣十住，　　不重解所入？",
        "translation": "Mañjuśrī declares the ten abodes, but doesn't he repeatedly understand what he enters?",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　諸菩薩勇猛，　　心各抱猶豫；",
        "translation": "The enlightening beings are courageous, Each embracing hesitation in their minds.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　云何說義名，　　不聞道地處？",
        "translation": "How can we say that the meaning is called a place where one doesn't hear the path?",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　咸欲悉共聞，　　最勝子無畏；",
        "translation": "They all want to hear together, The supreme one fearless.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　決義入平等，　　所行住道地。",
        "translation": "He enters equality with certainty of meaning and abides in the path based on what he practices.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　眾會僉悅豫，　　清淨除諛諂；",
        "translation": "The assembly was delighted, pure and free of hypocrisy.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　堅住解明地，　　功勳慧平均。",
        "translation": "Firmly abiding in the stage of understanding and insight, they're equal in merit and wisdom.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　一切立恭敬，　　展轉相承望；",
        "translation": "All establish respect for each other, In succession and mutually inherited.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　求微妙無瑕，　　志無上甘露。",
        "translation": "Seeking subtle and flawless, he intends the unsurpassed ambrosia of immortality.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　因聞金剛藏，　　無畏大智慧；",
        "translation": "Having thus heard of the diamond-treasury, Fearless great knowledge and wisdom.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　常歡悅來眾，　　仁宜與佛談。",
        "translation": "Always delighted by the multitude of people who come, it's a good idea to talk to the Buddha.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　未曾最難及，　　顯菩薩所行；",
        "translation": "Never has it been so difficult to reach, Manifesting the practices of enlightening beings.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　分別如道地，　　所由最上勝。",
        "translation": "Discriminating is like the ground of enlightenment, where it's the highest and most superior.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　棄想微難見，　　常住遠離心；",
        "translation": "Rejecting conceptions that are subtle and difficult to see, they always abide apart from mind.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　柔仁行成慧，　　面聞所歸趣。",
        "translation": "Their gentleness and practice become wisdom, and their faces are the destination of what they hear.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　所止如金剛，　　第一解佛慧；",
        "translation": "Their abode is like a diamond, The first of which is the understanding of buddha-knowledge.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　立心捨吾我，　　乃聞此上智。",
        "translation": "He who establishes his mind and abandons self, hears this supreme wisdom.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　如來盡虛無，　　離欲亦如空；",
        "translation": "The Enlightened One has exhausted space and nonexistence, And is also free from desire like space.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　慧如地無漏，　　興別最難見。",
        "translation": "Wisdom like the ground, uncontaminated, Arises distinct and most difficult to see.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　道無念如此，　　信者甚難值；",
        "translation": "The Way has no thoughts like this, And it is hard to find a faithful one.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "　佛慧不可議，　　故默不重說。」",
        "translation": "The Buddha's wisdom is inconceivable, so he's silent and doesn't repeat it.",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "時月解脫菩薩大士，知彼眾會開士所念，以偈歎頌，問金剛藏此義所歸：月解脫菩薩，",
        "translation": "Knowing what the moon-liberated bodhisattva was thinking, the great man knew what the enlightened ones in the assembly were thinking and asked Vajragarbha in verse:",
        "source": "T10n0285_001:0459a12_4"
    },
    {
        "source_sentence": "謂金剛藏：「佛子當察！",
        "translation": "He said to the Vajragarbha, Son of the Buddha, you should examine it!",
        "source": "T10n0285_001:0459b08_5"
    },
    {
        "source_sentence": "諸來會者，性行淳淑，清淨離穢，其志仁和，悉諸菩薩，斯行真正，積功累德，",
        "translation": "Those who came to the assembly were pure in nature and conduct, pure and free from defilement. Their aspirations were benevolent and harmonious, enabling all bodhisattvas to attain enlightenment. These practices were genuine, accumulating merit and virtue.",
        "source": "T10n0285_001:0459b08_6"
    },
    {
        "source_sentence": "每生自克，六度無極，以自莊嚴，四等四恩，習權方便，功勳遠著，名德無量。",
        "translation": "Each time he defeats himself, the six perfections are infinite, adorned with his own adornments, cultivates the four equal and four kinds of kindness, cultivates righteousness and skillful means, and attains far-reaching merit that's called immeasurable in terms of virtue.",
        "source": "T10n0285_001:0459b10_7"
    },
    {
        "source_sentence": "大慈大哀，欲興道化，分流法教，救濟三界諸危厄眾，消眾冥如日明，",
        "translation": "Great compassion and great pity, wanting to promote enlightenment and teaching, they will spread the Teaching of the Dharma. They will rescue those in danger and distress in the three worlds, extinguishing the darkness of all beings like the light of the sun.",
        "source": "T10n0285_001:0459b12_8"
    },
    {
        "source_sentence": "生道品如良田，成正覺如虛空，長弘教如流水，除狐疑如日光，療三毒如醫王，",
        "translation": "The chapter on the path of enlightenment that arises is like a fertile field, the attainment of true awakening is like space, the long and extensive teaching is like running water, the removal of doubt is like sunlight, and the cure for the three poisons is like the king of doctors.",
        "source": "T10n0285_001:0459b13_9"
    },
    {
        "source_sentence": "度生死譬船師。",
        "translation": "To save sentient beings from birth and death is likened to a boat captain.",
        "source": "T10n0285_001:0459b15_10"
    },
    {
        "source_sentence": "是故佛子！",
        "translation": "Therefore, offspring of Buddha!",
        "source": "T10n0285_001:0459b15_11"
    },
    {
        "source_sentence": "仁者善哉，宜當班宣現在學行，令此道地緣修所歸，使諸會者各得開解，",
        "translation": "Good, my dear friend! It is advisable that you should teach the Dharma in such a way as to make it possible for those who are engaged in religious practice to attain enlightenment so that they will be able to understand.",
        "source": "T10n0285_001:0459b16_12"
    },
    {
        "source_sentence": "如冥覩明，應病授藥，使無餘疑。」",
        "translation": "It's like giving medicine to a sick person in the darkness of ignorance and insight, so they don't have any doubts.",
        "source": "T10n0285_001:0459b17_13"
    },
    {
        "source_sentence": "「茂盛願講說，　　殊特最上法；",
        "translation": "Vast is the vow to expound The special and supreme Teaching.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "　人中上所行，　　諸菩薩之業。",
        "translation": "Among humans, the highest practice is that of bodhisattvas.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "　敷演說其教，　　所住之道地；",
        "translation": "They spread out their teachings and expound them, Abiding on the path of enlightenment.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "　聖慧甚清淨，　　巍巍仁和業。",
        "translation": "Their holy wisdom is extremely pure, And their lofty deeds of benevolence and harmony are sublime.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "　諸會者清淨，　　不可計第一；",
        "translation": "The leaders of the assemblies are pure And cannot be counted as the best.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "　堅住在正路，　　志性懷篤信。",
        "translation": "They firmly abide in the right path, With determination and faith.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "　善累功積德，　　奉無數億佛；",
        "translation": "Accumulated in virtue, they serve countless billions of buddhas.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "　各欲得決解，　　尋現逮十住。」",
        "translation": "Each one wants to attain certainty, so they'll find the ten abodes in the present.",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "時月解脫菩薩大士，欲令此義重散本末，顯示歸趣，為金剛藏說此頌曰：金剛藏菩薩，",
        "translation": "Wishing to cause this meaning to be repeatedly scattered, the great bodhisattva Moon Liberation at that time spoke these verses for Vajragarbha:",
        "source": "T10n0285_001:0459b18_14"
    },
    {
        "source_sentence": "報月解脫：「佛子察之！",
        "translation": "He was liberated by the moon of retribution, saying, Son of the Buddha, examine it!",
        "source": "T10n0285_001:0459b29_15"
    },
    {
        "source_sentence": "今此眾會，四面雲集，云何見之？",
        "translation": "Now that this assembly has gathered like clouds on all sides, how can we see it?",
        "source": "T10n0285_001:0459b29_16"
    },
    {
        "source_sentence": "所念應宜，柔弱仁和，清淨無瑕，豈離狐疑無猶豫乎？",
        "translation": "Your thoughts should be appropriate, gentle and peaceful, pure and without flaws. Isnt it because you are free of doubt and lack hesitation?",
        "source": "T10n0285_001:0459c01_17"
    },
    {
        "source_sentence": "於斯法要，寧有高行，不依他人，無戴仰耶？",
        "translation": "How could there be lofty conduct in regard to these essentials of the Dharma that doesn't rely on others and doesn't venerate them?",
        "source": "T10n0285_001:0459c02_18"
    },
    {
        "source_sentence": "不從他教，進退不安，懷抱久病，不可療治，堅住羅網，未出深塹，六十二疑，",
        "translation": "They do not obey the instructions of others and are unable to advance or retreat. They harbor long-standing illnesses that cannot be cured. They live firmly in a narrow entanglement without emerging from deep moats, with sixty-two doubts.",
        "source": "T10n0285_001:0459c03_19"
    },
    {
        "source_sentence": "四倒五蓋，火林蛇室，十二牽連，十重之閣，三坑三戶，三流之逸遊在曠野，",
        "translation": "There are four inverted and five canopies, a snake chamber in a forest of fire, twelve story pavilions with ten stories each, three pits and three doors. The spirits of the three streams wander about in the wilderness.",
        "source": "T10n0285_001:0459c05_20"
    },
    {
        "source_sentence": "未向佛門，設聞此法，躊躇不進。",
        "translation": "They hadn't yet approached the Buddha's gate, and even if they heard this teaching, they hesitated and didn't advance.",
        "source": "T10n0285_001:0459c07_0"
    },
    {
        "source_sentence": "或復有人，若聞於此不可思議，如是道住，各懷異心，聞之狐疑不肯篤信，",
        "translation": "And suppose there is another person who, hearing about this inconceivable teaching and thus following it, harbors dissimilar thoughts in his mind; but when he hears about it, he has doubts and will not believe it.",
        "source": "T10n0285_001:0459c07_1"
    },
    {
        "source_sentence": "由此惑亂，長夜不安，永失利義，捨根取枝。",
        "translation": "As a result, they're confused and unsettled for a long time, permanently losing their meaning of benefit, abandoning their faculties and grasping their branches.",
        "source": "T10n0285_001:0459c09_2"
    },
    {
        "source_sentence": "吾故向者默然不言，慈愍此等，無辭為住樂無所樂。」",
        "translation": "That's why I didn't say anything to the donor, and because of my compassion for these people, I didn't say anything to abide in happiness and have nothing to enjoy.",
        "source": "T10n0285_001:0459c10_3"
    },
    {
        "source_sentence": "「豈見於眾會，　　智慧淨無垢；",
        "translation": "“Haven’t you seen, in the assemblies, The pure and undefiled sphere of knowledge?",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "　善敷演聖道，　　諸根通深妙。",
        "translation": "Skillfully expounding the noble path, his faculties are profound and marvelous.",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "　而無所戴仰，　　無動等如山；",
        "translation": "Nothing is held high And nothing moves, like a mountain.",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "　志性無瞋恨，　　思平如水正。",
        "translation": "Their resolve has no anger or resentment, and their thoughts are as calm as water.",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "　習修何所行，　　其慧無等倫；",
        "translation": "What practices are cultivated, Their wisdom is peerless.",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "　住在樂所識，　　為求義慧信。",
        "translation": "Abiding in the consciousness of pleasure, They seek meaning, wisdom, and faith.",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "　適聞恐猶豫，　　便墮于惡趣；",
        "translation": "When they hear it, fearful and hesitant, They’ll fall into a bad rebirth.",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "　以故愍念此，　　不說慧住地。」",
        "translation": "That's why I'm so mindful of this, not saying that it's the abode of wisdom.",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "又說偈言：月解脫菩薩，復謂金剛藏：「仁者顧意，承佛威神，宣如來旨，",
        "translation": "The Bodhisattva Moon Liberation also addressed Vajragarbha, saying:",
        "source": "T10n0285_001:0459c11_4"
    },
    {
        "source_sentence": "感動十方，反偽向真，消諸垢塵，盪滌結滯，裂三界網，通無極慧，唯敷演之，",
        "translation": "He moved people in the ten directions to turn away from falsehood and toward truth, to extinguish all defilements, to sweep away fetters, to cut off the network of the three realms, to penetrate the infinite wisdom that only expounds it.",
        "source": "T10n0285_001:0459c21_5"
    },
    {
        "source_sentence": "如是比像不可思議，善當將養，寬弘之士，必當信樂無猶豫者。",
        "translation": "Such a comparable image is inconceivable, and it's well-intended to be nurtured. A person who's generous will surely believe and enjoy it without hesitation.",
        "source": "T10n0285_001:0459c23_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0285_001:0459c24_1"
    },
    {
        "source_sentence": "佛子當知！",
        "translation": "You should know, Buddha-child!",
        "source": "T10n0285_001:0459c24_2"
    },
    {
        "source_sentence": "若講此教，將致道法，一切菩薩，皆念諸佛，識達經義，擁護奉此行慧道地，",
        "translation": "All enlightening beings are mindful of all buddhas, comprehending the meaning of scriptures and doctrines, and embracing this path of practice.",
        "source": "T10n0285_001:0459c24_3"
    },
    {
        "source_sentence": "靡不蒙賴咸得安隱。",
        "translation": "They'll all attain peace without relying on it.",
        "source": "T10n0285_001:0459c26_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0285_001:0459c27_0"
    },
    {
        "source_sentence": "斯之所行，必歸平等，諸佛道法，猶如佛子，一切書疏唯說文字，此悉由意心為源首，",
        "translation": "The paths and principles of the buddhas are like heirs of the Buddha. All writing, commentaries, and syllables speak only words; this is all due to mental thought as the source.",
        "source": "T10n0285_001:0459c27_1"
    },
    {
        "source_sentence": "從志因緣而有所倚，書本無文，所演文字，心之源空，宣之虛無。",
        "translation": "The source of the mind is emptiness, but the proclaimed one is void.",
        "source": "T10n0285_001:0459c29_2"
    },
    {
        "source_sentence": "如是佛子，一切佛法，住為源首，因行而成，依於道地，至自然慧。",
        "translation": "Thus, all the buddha-dharmas of the heirs of the Buddha have abiding as their source and are formed by causes and actions, depending on the stage of enlightenment up to the point of natural wisdom.",
        "source": "T10n0285_001:0460a01_3"
    },
    {
        "source_sentence": "是故唯說，顧愍一切，如來、至真、等正覺道力助卿，建立分別如此文字，",
        "translation": "Therefore, it is only said that the Tathāgata, the Supremely True One, the Completely Enlightened One, and the power of the path assist you in distinguishing words like this.",
        "source": "T10n0285_001:0460a03_4"
    },
    {
        "source_sentence": "令其坦然，將護正法，因得久存，使無餘結。」",
        "translation": "He causes them to be at ease, protects the right teaching, and thus maintains it for a long time so that there are no remaining bonds.",
        "source": "T10n0285_001:0460a04_5"
    },
    {
        "source_sentence": "「善哉演清淨，　　解入一切智；",
        "translation": "“Good, enlightening beings expound purity, Understanding and entering all knowledge.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "　普遊諸道要，　　至覺成聖慧。",
        "translation": "He travels everywhere to the essentials of the path, Up to the point where he realizes noble wisdom.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "　諸在十方佛，　　安住最道勝；",
        "translation": "The buddhas of the ten directions Abiding in these abodes are supremely enlightened.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "　慧室至境界，　　皆共愍念之。",
        "translation": "When the abode of wisdom reaches its objective realm, they're all mindful of it together.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "　立此親近慧，　　行是究竟迹；",
        "translation": "To establish this proximate wisdom, Practice is the ultimate path.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "　諸佛無比法，　　悉由無量業。",
        "translation": "The incomparable qualities of buddhas All come from boundless acts.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "　猶書意合集，　　因心事為首；",
        "translation": "It is just as when a book combines ideas and meanings into one collection, Causal thoughts and deeds are the first.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "　此住意如是，　　解暢至佛道。」",
        "translation": "This abiding mind is like this, which understands and reaches the Buddha Way.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "又說偈言：於是一切菩薩，各各發心，咸共勸助，欲令宣揚仁本興意，",
        "translation": "Again, the Buddha said in verse: All these bodhisattvas each set their minds on enlightenment, exhorting and assisting one another, wanting to make known the aspirations of all sentient beings.",
        "source": "T10n0285_001:0460a05_6"
    },
    {
        "source_sentence": "誓為一切，勤勞積功，累無量德；",
        "translation": "They undertake to work diligently for the sake of all, accumulating innumerable virtues.",
        "source": "T10n0285_001:0460a15_7"
    },
    {
        "source_sentence": "猶如虛空，欲濟危厄，不難劫數，周遊生死，心常慺慺，欲濟一切心無所著；",
        "translation": "They are like space, wishing to rescue all those in distress. Without difficulty and without calculating the number of world ages, they travel through births and deaths. Their minds are always compassionate; their desire to rescue all is not attached to anything.",
        "source": "T10n0285_001:0460a16_8"
    },
    {
        "source_sentence": "行如蓮華在泥塗中，三界之苦不以為拘，唯懷愍傷，拔惱根株，三世之樹永令無餘。",
        "translation": "He walks like a lotus flower in the mud, and the suffering of the three realms isn't taken as an obstacle; he only harbors pity and wounds, pulling out the roots and leaves of affliction, and the trees of the three worlds are always left without remainder.",
        "source": "T10n0285_001:0460a17_9"
    },
    {
        "source_sentence": "「最勝殊特志覺遠，　　辯才無量心念具；",
        "translation": "The most distinguished and special is the far-reaching aspiration for enlightenment, With boundless powers of elucidation and thoughtfulness.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　宣傳柔軟至佛教，　　第一至真甚微妙。",
        "translation": "He proclaims the supremely flexible teaching of Buddhism, which is the ultimate and most subtle.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　其意堅固行清淨，　　不捨功勳十種力；",
        "translation": "Their minds are steadfast, their actions pure; They do not give up the ten powers of virtue.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　以分別辯故造行，　　唯願當演上道法。",
        "translation": "They create practices because of discriminating and eloquence, wishing only to expound the teachings of the higher path.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　心之所念如明珠，　　意寂以見消塵欲；",
        "translation": "What the mind thinks of is like a bright pearl; The mind is silent because it sees and eliminates worldly desires.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　今此眾會離狐疑，　　咸皆願樂仁所說。",
        "translation": "Now, this assembly is free of doubt and doubt, and they all wish to hear what you teach.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　虛渴言教如望泉，　　飢服仁者病待醫；",
        "translation": "Their vain thirst is like looking out for a spring, And their hungry and starving kindness waits for doctors to treat the ill.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　甘美之餅在目前，　　如是欣樂甘露味。",
        "translation": "The sweet and delicious cakes are in front of him, And he thus enjoys the taste of ambrosia.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　故善垂念廣其志，　　宣殊勝住除垢塵；",
        "translation": "That is why they are well disposed to extend their aspirations And proclaim the abode of transcendence, getting rid of defilement.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "　調寂正安不捨無，　　講眾祐行無患難。」",
        "translation": "He regulates quiescence, correctly calms it, doesn't abandon nonexistence, and teaches the practice of blessedness without any difficulty.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "時諸菩薩，同時舉聲，勸歎金剛藏菩薩，而說頌曰：於是世尊有諸菩薩至聖光明，",
        "translation": "The bodhisattvas then all simultaneously raised their voices in praise of the Vajragarbha Bodhisattva and spoke these verses: Then, Bhagavān, there was a supremely noble ray of light emanating from the enlightening beings.",
        "source": "T10n0285_001:0460a19_10"
    },
    {
        "source_sentence": "號曰力勢，佛從眉間，演此光燿，興無數明，普照十方一切佛土，消滅一切諸所惡趣，",
        "translation": "The Buddha emanated this ray of light from between his eyebrows, producing countless rays of light that illuminated all buddha-lands in the ten directions and extinguishing all bad states of existence.",
        "source": "T10n0285_001:0460b02_11"
    },
    {
        "source_sentence": "勤苦休息，不復考治，皆安隱，照斯如來，一切道場；",
        "translation": "He diligently and painstakingly rests, without further examination or correction. They are all at ease, illumining this buddha as well as all the sites of enlightenment.",
        "source": "T10n0285_001:0460b04_12"
    },
    {
        "source_sentence": "十方佛國，建立法講，靡不周悉不可思議諸佛境界。",
        "translation": "In all the buddha-lands of the ten directions he preached the Teaching, reaching everywhere inconceivably many buddha-realms.",
        "source": "T10n0285_001:0460b05_13"
    },
    {
        "source_sentence": "其光則還，繞佛三匝，上住虛空，合成大光，光明煒煒，立交露帳。",
        "translation": "The light then returned, circled the Buddha three times, and rose up into the sky to abide above him. It emitted a great ray of light that shone brightly and stood out like a variegated canopy.",
        "source": "T10n0285_001:0460b07_14"
    },
    {
        "source_sentence": "又有諸佛興出世間，自然威曜，從其眉間，演如是倫，諸菩薩等，力勢光明，",
        "translation": "Again, the buddhas arose and emerged in the world, naturally shining with great splendors. From the space between their eyebrows they emanated such rays of light that the enlightening beings were like this:",
        "source": "T10n0285_001:0460b08_15"
    },
    {
        "source_sentence": "現如此比，神足變化，照斯忍界，曜是能仁，眾會道場及金剛藏師子之座，",
        "translation": "In this way he manifested the miraculous power of his supernormal powers, illuminating the realm of patience. Yao was able to compassionately attend all the assemblies at the terrace of enlightenment and on the lion seat of the diamond-treasury treasure house.",
        "source": "T10n0285_001:0460b10_16"
    },
    {
        "source_sentence": "乃住虛空，成光交露帳。",
        "translation": "He then stayed in space and formed a bright, interpenetrated canopy of light.",
        "source": "T10n0285_001:0460b11_17"
    },
    {
        "source_sentence": "是能仁佛，眉間毫跱，光明廣遠，照諸闇冥，十方佛界，眾會道場，莫不蒙明光，",
        "translation": "This was the benevolent buddha A Forest of Pearls from the Dharma Garden, Volume II a thousand paces between his eyebrows. His ray of light extended far and wide and illumined all darknesses. The buddha-realms in the ten directions assembled at the terrace of enlightenment, and all were illumined with bright light.",
        "source": "T10n0285_001:0460b12_18"
    },
    {
        "source_sentence": "咸顯現在諸菩薩，大士屋宇，一切晃現。",
        "translation": "They all show the bodhisattvas and great men's houses in the present, and all of them shine brightly.",
        "source": "T10n0285_001:0460b14_19"
    },
    {
        "source_sentence": "其於十方諸佛國土，現諸如來所可演出，眉間光燿，皆復照燿此忍世界，",
        "translation": "In the buddha-lands of the ten directions, manifesting what the enlightened ones can produce, shining brightly between their hair and eyebrows, they also illumine this world Patience.",
        "source": "T10n0285_001:0460b15_0"
    },
    {
        "source_sentence": "能仁眾會菩薩道場，周照師子高廣之座。",
        "translation": "Neng Ren's congregation assembled at the bodhisattva's site of enlightenment, shining all over the high and wide lion's seat.",
        "source": "T10n0285_001:0460b16_1"
    },
    {
        "source_sentence": "在金剛藏菩薩身，現於大光，巍巍晃然，珠交露帳，各有坐佛，自從口出如是輩聲，",
        "translation": "In the body of the enlightening being Diamond Matrix Enlightening being, manifesting a great ray of light emanating from the ocean of jewels, each seated on a draped canopy interspersed with jewels. The buddhas emerged from their mouths and uttered these sounds:",
        "source": "T10n0285_001:0460b17_2"
    },
    {
        "source_sentence": "「喻之無等倫，　　譬之如虛空；",
        "translation": "The metaphor has no equal, Just like space.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　十力境界尊，　　功勳不可量。",
        "translation": "Venerable in the realm of the ten powers, his merits are immeasurable.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　殊勝最上特，　　普世為無上；",
        "translation": "Their excellence is supreme, the highest and special, Unsurpassed in all worlds.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　建立第一業，　　釋師子之法。",
        "translation": "He establishes the first practice, explaining the lion's teaching.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　講眾安住子，　　蒙導師恩慈；",
        "translation": "The assembly of monks and nuns stayed at Anzhai Monastery And were guided by the compassion of their teachers.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　法王人中帝，　　演眉間光明。",
        "translation": "The emperor of the Dharma king, a native of Central India, emits light between his eyebrows.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　班宣佛道慧，　　入妙眾行無；",
        "translation": "Ban proclaims the Buddha’s wisdom of enlightenment, Entering into the sphere of myriad practices.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　賴十力垂顧，　　分別普化眾。",
        "translation": "Relying on the ten powers to look after them, they discriminate and universally transform sentient beings.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　安住已建立，　　斯聞能宣照；",
        "translation": "Having settled and established them, They hear and are able to expound.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　寶法為上尊，　　是寂其志性。",
        "translation": "The jeweled dharma is the supreme honored one, which is quiescent in its aspiration.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　一切住無穢，　　具足滿本願；",
        "translation": "All sentient beings who abide in the absence of defilement Will fulfill their original vow.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　因十力最勝，　　志求上尊路。",
        "translation": "Because of the ten powers, he's the most superior, and his intention is to pursue the path of the supreme honored one.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　海水尚可盡，　　一切數知限；",
        "translation": "The water of the ocean can still be exhausted, but All know the limits.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　若人欲度此，　　不可卒得聞。",
        "translation": "If someone wants to save them here, they can't hear it at once.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　其能離志念，　　永除眾狐疑；",
        "translation": "They can be free of thought and will And forever rid themselves of doubt.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　一切未有愍，　　照以此經典。",
        "translation": "All of them have no dispute, so illuminate this sūtra.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　是故辯才尊，　　緣住慧徑路；",
        "translation": "That is why the Honorable One with eloquence Is Abiding by reason in the path of wisdom.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　所處奉斯行，　　遊步依本業。",
        "translation": "Wherever they are, they follow this practice and walk around relying on their original karma.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　至行入境界，　　普到佛聖智；",
        "translation": "In the realm of ultimate practice and entry, They reach everywhere to the Buddha’s noble knowledge.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "　愍一切眾生，　　布散此法因。」",
        "translation": "To pity all sentient beings, he spreads the causes of this teaching.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "而歎頌曰：於是金剛藏菩薩，觀于十方，欲令眾會重懷悅豫，渴仰於法，",
        "translation": "The bodhisattva Vajragarbha then looked over the ten directions, wishing to cause the assembly to be filled with joy and longing for the Dharma.",
        "source": "T10n0285_001:0460b19_3"
    },
    {
        "source_sentence": "「大聖之道法，　　微妙甚深遠；",
        "translation": "The teaching of the Great Noble Path Is extremely subtle and profound.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　無念以捨念，　　清澄永難了。",
        "translation": "The absence of mindfulness is due to the equanimity of mindfulness, which is pure and eternally difficult to understand.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　聖明達玄微，　　智慧解所行；",
        "translation": "The holy illumination comprehends the subtleties, And it is practiced by knowledge and understanding.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　自然業寂安，　　柔仁無諍亂。",
        "translation": "Their natural actions are quiescent and peaceful, and they're gentle and without anger or confusion.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　自然空淨法，　　寂寞除苦患；",
        "translation": "The pure dharma of spontaneous emptiness naturally removes the suffering and distress of loneliness.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　遊居至解脫，　　逮平等滅度。",
        "translation": "He travels to liberation and attains equanimity and cessation.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　無限無極義，　　言辭近超度；",
        "translation": "Infinite and boundless is their meaning, transcended in words.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　以越于三世，　　行等猶虛空。",
        "translation": "Because it transcends the three worlds, its formations and so forth are like space.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　諸眾祐所行，　　寂然甚淡泊；",
        "translation": "The deeds of the gods are tranquil and very subtle.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　一切之行業，　　徑路難逮解。",
        "translation": "All activities are difficult to fathom and understand in their paths.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　此等行如地，　　志性亦若斯；",
        "translation": "These practices are like the earth, And so is their determination.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　甚難可講說，　　何能分別了。",
        "translation": "It's very difficult to explain, so how can you discern it?",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　以去棄心意，　　永無心句迹；",
        "translation": "By discarding thought and thought, There is no trace of thought or thoughtlessness at all.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　諸眾祐所行，　　智慧消言食。",
        "translation": "The practice of the gods is based on wisdom, which subdues speech and food.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　亦復無所行，　　無陰眾衰入；",
        "translation": "Nor does it have anything to act on, No aggregates or states of decay and entry.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　聖達依慧業，　　其心無想念。",
        "translation": "The noble one relies on the action of wisdom, and his mind has no thoughts or perceptions.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　猶如有飛鳥，　　遊行在虛空；",
        "translation": "It’s like flying birds roaming in the sky.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　不可以言辭，　　何況欲覩見。",
        "translation": "They can't speak words, so why wouldn't they want to see them?",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　安住自然慧，　　如是行道住；",
        "translation": "Abiding in spontaneous wisdom, They thus practice and abide on the path.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　其心所行念，　　不可分別知。",
        "translation": "The thoughts and actions of their minds cannot be discriminated.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　何所有入處，　　殊勝慧土地；",
        "translation": "What is the sphere of enlightenment that exists, The land of supreme knowledge?",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　愍傷常慈哀，　　志願普備悉。",
        "translation": "With compassion and pity, always compassionate, Their aspirations are universally complete.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　漸以具眾行，　　心亦無想念；",
        "translation": "Gradually endowed with myriad practices, Their minds also have no thought or thought.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　猶如心本性，　　智慧以明了。",
        "translation": "It's like the mind's original nature, which is explained by wisdom.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　如斯行之業，　　微妙甚難解；",
        "translation": "Such deeds are subtle and extremely difficult to understand.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　自己志性無，　　不可卒達知。",
        "translation": "Their own aspiration is nonexistent, so they can't suddenly know it.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　何況能宣布，　　安住之所念；",
        "translation": "How much the more so when they can proclaim it And make it known to those who abide therein.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　一切共恭敬，　　明聽玄妙教。",
        "translation": "All of them respectfully listened To the profound and subtle teaching.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　以入正真慧，　　如行道之住；",
        "translation": "By entering into true wisdom, They live according to the path of practice.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　若於億千劫，　　不可盡究竟。",
        "translation": "If it were for billions of eons, it wouldn't be exhausted.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　等俱咸悅豫，　　普共且專聽；",
        "translation": "They are all equally delighted, Together and together they listen.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　至誠妙真義，　　無厭亦無異。",
        "translation": "With utmost sincerity and true meaning, there's no disillusionment and no difference.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　不以為憒亂，　　猶如成大海；",
        "translation": "They don’t think it’s a commotion, Like the formation of a great ocean.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　今當具敷演，　　諸眾祐道行。",
        "translation": "I will now explain in detail The practices of the Way, Which are carried out by the blessings of all beings.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　又當班宣說，　　殊特之法音；",
        "translation": "You will also expound the Teaching in my class, With a special voice of truth.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　牽引眾譬喻，　　正真等文字。",
        "translation": "It leads to all kinds of metaphors, such words as correct and true.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　其所講分別，　　甚難可解散；",
        "translation": "It is extremely difficult to distinguish [the meaning of the doctrine] that they teach, And it is very difficult to disperse them.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　安住行業事，　　如是不可量。",
        "translation": "Their settled activities and deeds are thus immeasurable.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　今已得逮入，　　吾我之自然；",
        "translation": "Now that they have entered, It is natural for me to do so.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "　咸樂如一渧，　　且聽所宣言。」",
        "translation": "They're all happy like a single bowl, so listen to what you proclaim.",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "興發大哀無極之慈，應時因是，嗟歎此頌：爾時金剛藏菩薩大士，謂眾會者：「佛子且察！",
        "translation": "He arouses great compassion and infinite kindness, and then causes this verse to be admired: It was then that the Vajragarbha Bodhisattva Mahāsthāmaprāpta addressed the assembly, Son of the Buddha!",
        "source": "T10n0285_001:0460c12_4"
    },
    {
        "source_sentence": "諸集眾生，積累德本所行真諦而無虛偽，所造行業甚善將護，諸佛興世常勤供養，",
        "translation": "The sentient beings who are assembled accumulate the true truths they practice in virtue, without falsehood. The deeds they perform will be well guarded by them. The Buddhas that arise in the world will always diligently make offerings to them.",
        "source": "T10n0285_001:0461a26_0"
    },
    {
        "source_sentence": "極以合會諸清白法，恒以諮受善知識俱，以除憂慼志性寬弘，篤信微妙定意平等，",
        "translation": "They associate with the pure and genuine teachings in order to unify them; they always consult and receive spiritual benefactors, so as to remove sorrow and anguish. Their minds are broad and their aspirations generous. They deeply believe in the equanimity of subtle concentration.",
        "source": "T10n0285_001:0461a28_0"
    },
    {
        "source_sentence": "面覩現在愍念慈哀，心常志慕諸佛聖慧。",
        "translation": "Their faces are compassionate, and their hearts always aspire to the noble wisdom of the buddhas.",
        "source": "T10n0285_001:0461a30_0"
    },
    {
        "source_sentence": "化諸眾生悉發道心，皆令至真好一切智，其十種力強而有勢，則得遊行大無所畏，",
        "translation": "He inspired all sentient beings to give rise to the determination for enlightenment, causing them to ultimately develop omniscience. With these ten kinds of power and vigor, he attained great freedom from fearlessness in their movements.",
        "source": "T10n0285_001:0461b01_0"
    },
    {
        "source_sentence": "其意坦然得佛正法，擁護救濟一切眾生，修大愍傷其哀清淨，十方無餘悉解一切，",
        "translation": "Their minds are equanimous in attaining the Buddha’s true teaching, protecting and rescuing all sentient beings. They cultivate great compassion; their sympathy is pure and genuine. In all directions they understand everything without exception.",
        "source": "T10n0285_001:0461b03_0"
    },
    {
        "source_sentence": "明智至門悉現目前，一切佛土無為清淨，一時覺了三世世事，轉大法輪療眾疾病。",
        "translation": "The supreme gate of knowledge and wisdom is fully manifested, all buddha-lands are unconditionally pure, perceive the events of the three worlds at once, and turn the great wheel of the Dharma to treat illnesses.",
        "source": "T10n0285_001:0461b05_0"
    },
    {
        "source_sentence": "菩薩大士須臾發意，愍眾生行無極大哀以為元首，智慧明了甚為巍巍，",
        "translation": "The great enlightening beings and bodhisattvas instantly aroused the aspiration for enlightenment, beginning with compassion toward sentient beings and carrying out the practice of unexcelled great compassion; their knowledge and understanding were so majestic.",
        "source": "T10n0285_001:0461b07_0"
    },
    {
        "source_sentence": "常勤學受善權方便，意性和柔親近道法，如來十力不可限量，善思選擇計一切人力佛力最上，",
        "translation": "He always diligently studied and accepted the methods of skillful means, his mind was gentle and receptive to the teachings of the path. The ten powers of buddhahood of the Enlightened One could not be limited; he well thought about selecting and calculating all the powers of human beings and buddhas, foremost among them.",
        "source": "T10n0285_001:0461b08_1"
    },
    {
        "source_sentence": "所宣法門無所罣礙，而以和順自在之慧。",
        "translation": "The teachings he proclaims are unobstructed, yet he uses his unimpeded wisdom to harmonize and obey.",
        "source": "T10n0285_001:0461b10_2"
    },
    {
        "source_sentence": "佛悉了知一切佛興，因是自在，造立道法法界行最，立虛空際，所可發心，",
        "translation": "The Buddha knows that all buddhas arise. Because of this unimpededness, he establishes the supreme practice of the path, the reality realm, and the reality realm; he establishes space as the limits of space wherein one can make aspirations.",
        "source": "T10n0285_001:0461b11_3"
    },
    {
        "source_sentence": "顯了當來發菩薩意。",
        "translation": "It shows that the bodhisattva's intention will arise in the future.",
        "source": "T10n0285_001:0461b13_4"
    },
    {
        "source_sentence": "適發道意超凡夫地，以得超越菩薩之地，則得生在如來種姓，因號之曰無所從生。",
        "translation": "When he arouses the intention for enlightenment and transcends the stage of worldling, he'll be born in the Tathāgata's family because he's able to transcend the bodhisattva's stage and attain it, which is why he's called a native.",
        "source": "T10n0285_001:0461b14_5"
    },
    {
        "source_sentence": "無有罪釁，輒以迴轉世俗所趣，適過世俗由度世行，因得住立菩薩道法；",
        "translation": "There is no blameworthiness in those who easily turn away from worldly paths, but by transcending worldly practice they are able to abide and establish the principles of enlightening beings’ path.",
        "source": "T10n0285_001:0461b16_6"
    },
    {
        "source_sentence": "已得住立菩薩道法，便能順從三世佛教，勤心道義常深第一；",
        "translation": "Having attained the way of enlightening beings’ path, they are able to follow the teachings of past, present, and future buddhas. The meaning of diligently striving for enlightenment is always profound and supreme.",
        "source": "T10n0285_001:0461b17_7"
    },
    {
        "source_sentence": "菩薩住如是道法，悅豫道地。",
        "translation": "The bodhisattva abides thus in the teaching of the path and delights in the stage of the path.",
        "source": "T10n0285_001:0461b19_8"
    },
    {
        "source_sentence": "「佛子當知！",
        "translation": "You should know, Buddhist child!",
        "source": "T10n0285_001:0461b20_9"
    },
    {
        "source_sentence": "如斯得立住菩薩道，所行不動入不迴還，以住菩薩悅豫地者，因是發意多所悅豫，",
        "translation": "Those who thus attain the establishment of abiding in the path of enlightening beings and do not move, enter or turn back from what they practice because they abide in the bodhisattva’s pleasurable state are often delighted by means of this determination.",
        "source": "T10n0285_001:0461b20_10"
    },
    {
        "source_sentence": "其有見者莫不歡然，常有恭敬以致利養，其來見者咸共欣喜，開化眾人僉然受教，",
        "translation": "Those who saw him were all delighted, and they always honored him with respect and offered him material benefits. All those who came to see him were joyful, encouraging and inspiring others to accept his instruction.",
        "source": "T10n0285_001:0461b22_11"
    },
    {
        "source_sentence": "普來雲集共相娛樂，雖致遠近計無堅固，常抱仁和無所傷害，恒志悅豫心不懷恨，",
        "translation": "They are like clouds coming from all directions, gathered together to play and amuse themselves. Although they may be far away or near, they have no fixed idea of strength. Always embracing kindness and harmony, they do not harm others. They always cherish joy and gladness without holding grudges.",
        "source": "T10n0285_001:0461b24_12"
    },
    {
        "source_sentence": "和顏悅色而無瞋恨，是為菩薩悅豫之地。",
        "translation": "This is the bodhisattva’s pleasing state of joy.",
        "source": "T10n0285_001:0461b26_13"
    },
    {
        "source_sentence": "住于道教，諸佛世尊，皆共念之，第一悅豫；",
        "translation": "All the buddhas and world-honored ones who abide in the teaching of enlightenment are mindful of it. They are the first to be delighted.",
        "source": "T10n0285_001:0461b27_14"
    },
    {
        "source_sentence": "思於佛法，適發悅豫；",
        "translation": "They thought of the buddha-dharma and were delighted.",
        "source": "T10n0285_001:0461b28_15"
    },
    {
        "source_sentence": "念於菩薩大士本業，適懷悅豫；",
        "translation": "They remembered the past deeds of enlightening beings and were joyful.",
        "source": "T10n0285_001:0461b28_16"
    },
    {
        "source_sentence": "念菩薩行，適發悅豫；",
        "translation": "They were mindful of the practices of enlightening beings and encouraged them accordingly.",
        "source": "T10n0285_001:0461b29_17"
    },
    {
        "source_sentence": "念於六度清淨無極，適發悅豫；",
        "translation": "They were mindful of the infinity of the purity of the six transcendent ways, enthusiastic and delighted.",
        "source": "T10n0285_001:0461b29_18"
    },
    {
        "source_sentence": "念於開士所住殊特，適發悅豫；",
        "translation": "He thought of the special place where the enlightened one lived, and felt delighted.",
        "source": "T10n0285_001:0461c01_19"
    },
    {
        "source_sentence": "思道最微而無等侶，適發悅豫；",
        "translation": "The thought of enlightenment was subtle but without peerless, and they were delighted.",
        "source": "T10n0285_001:0461c02_20"
    },
    {
        "source_sentence": "用眾生故利益道義，適發悅豫；",
        "translation": "The meaning of the path of benefiting sentient beings for the sake of their well-being was appropriately encouraged and delighted.",
        "source": "T10n0285_001:0461c03_21"
    },
    {
        "source_sentence": "進心深法，適發悅豫；",
        "translation": "They entered the profound doctrine of enlightenment and were delighted to receive instruction.",
        "source": "T10n0285_001:0461c03_22"
    },
    {
        "source_sentence": "念於如來至真之教，念以勸化一切眾生，適發悅豫；",
        "translation": "They are mindful of the supremely true teachings of buddhas, encouraging and inspiring all sentient beings accordingly.",
        "source": "T10n0285_001:0461c04_23"
    },
    {
        "source_sentence": "念諸菩薩入如來慧精進之業，重復思惟將導不逮，為以得度，說諸眾生所慕境界，",
        "translation": "Mindful of the enlightening beings’ entry into the action of the knowledge and effort of buddhas, they contemplate again and again that they are about to be led but do not reach their goal. In order to attain liberation they teach sentient beings the sphere which they seek.",
        "source": "T10n0285_001:0461c05_24"
    },
    {
        "source_sentence": "懷來進入諸佛平等，已得遠出愚癡之地，親近道場，斷除一切惡趣勤苦，",
        "translation": "Having entered the equanimity of all buddhas, they are far removed from the land of ignorance. They become intimate with the seat of enlightenment, getting rid of all miseries and pains of the states of woe.",
        "source": "T10n0285_001:0461c07_25"
    },
    {
        "source_sentence": "為諸眾生勸導之首，已得覩見如來至真，具足成就如來境界，皆已逮覩諸菩薩定平等之業，",
        "translation": "They are the leaders of all sentient beings in encouraging and guiding. Having gained a compassionate vision of the supreme truth of buddhahood, they have fully perfected the sphere of buddhahood. All have mastered the equanimous practice of concentration of enlightening beings.",
        "source": "T10n0285_001:0461c09_26"
    },
    {
        "source_sentence": "故悅豫耳！",
        "translation": "That's why it's so pleasant!",
        "source": "T10n0285_001:0461c11_27"
    },
    {
        "source_sentence": "永以消除一切恐懼，衣毛不竪，故悅豫耳！",
        "translation": "It's because he permanently removes all fears and doesn't wear hair or hair, so he's happy!",
        "source": "T10n0285_001:0461c11_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0285_001:0461c12_29"
    },
    {
        "source_sentence": "是故佛子！",
        "translation": "Therefore, offspring of Buddha!",
        "source": "T10n0285_001:0461c12_30"
    },
    {
        "source_sentence": "諸菩薩學以是悅豫，便逮得立菩薩道地，以得住立菩薩道地，諸所恐畏，",
        "translation": "Because of this delight in training, the bodhisattvas attain the stage of establishing the path of enlightenment. By attaining it, they abide in establishing the stage of the path of enlightenment and all their fears are eliminated.",
        "source": "T10n0285_001:0461c12_31"
    },
    {
        "source_sentence": "永無復難；",
        "translation": "There will be no further difficulty at all.",
        "source": "T10n0285_001:0461c14_32"
    },
    {
        "source_sentence": "在無命安，無世俗畏，無死之畏，不畏惡趣，所入眾會無所忌難，皆以永除一切諸懼。",
        "translation": "They have no fear of life, no worldly fears, no fear of death, no fear of bad destinies, and no difficulty in the congregations they enter because they permanently remove all fears.",
        "source": "T10n0285_001:0461c14_33"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0285_001:0461c16_34"
    },
    {
        "source_sentence": "無吾我想，不貪己身，況復貪愛一切榮異，所生業乎？",
        "translation": "What's more, what's the action that arises from craving and all kinds of prosperity?",
        "source": "T10n0285_001:0461c17_35"
    },
    {
        "source_sentence": "不畏無壽，亦不思念悕望僥倖，唯愍群生一切所有無極之業，救諸窮乏，",
        "translation": "They are not afraid of lifelessness, nor do they think of hope or good fortune. They only pity sentient beings for all their limitless deeds and rescue those in need.",
        "source": "T10n0285_001:0461c18_36"
    },
    {
        "source_sentence": "貪不識道是無俗畏；",
        "translation": "To covet and not know the path is worldly fearlessness.",
        "source": "T10n0285_001:0461c20_37"
    },
    {
        "source_sentence": "成其道明，不自見身，不畏失己無吾我想，不畏當死；",
        "translation": "They attain the insight of enlightenment and do not see their own bodies. They are not afraid to lose their self, have no ideation of self, or fear that they will die.",
        "source": "T10n0285_001:0461c20_38"
    },
    {
        "source_sentence": "雖身壽終，成菩薩行，不離諸佛，由是之故，不畏惡趣；",
        "translation": "Even at the end of their life, they become bodhisattvas and do not leave the buddhas. Because of this, they are not afraid of bad rebirths.",
        "source": "T10n0285_001:0461c21_39"
    },
    {
        "source_sentence": "普觀世間，察於道心，而無等倫，志性仁和，誰能踰者；",
        "translation": "He observed all worlds, examining the determination for enlightenment but without peerlessness. Who could surpass him in being benevolent and harmonious?",
        "source": "T10n0285_001:0461c22_40"
    },
    {
        "source_sentence": "以是之故，所入眾會，不懷忌難，離於恐懅，衣毛不竪。",
        "translation": "Because of this, the people who entered the assembly did not harbor any fear or difficulty. They were freed from fear and distress, and their hair on their bodies did not stand on end.",
        "source": "T10n0285_001:0461c24_41"
    },
    {
        "source_sentence": "佛子當解！",
        "translation": "Children of Buddha, you should understand!",
        "source": "T10n0285_001:0461c25_42"
    },
    {
        "source_sentence": "菩薩大士，以具大哀，不抱傷害，修本淨心，益加精進，合集一切眾德之本。",
        "translation": "With great compassion, the bodhisattva-mahāsattva doesn't embrace injury or harm, cultivates his original pure mind, and increases his effort to collect all the roots of virtue.",
        "source": "T10n0285_001:0461c25_43"
    },
    {
        "source_sentence": "「佛言：『以篤信至，威神漸備，多所歡悅。』",
        "translation": "The Buddha said, 'With devotion and faith, the authoritative power gradually becomes complete, and there's much to rejoice in.'",
        "source": "T10n0285_001:0462a01_0"
    },
    {
        "source_sentence": "淨諸不信，篤信以興；",
        "translation": "To purify the unbelieving, they give rise to devout faith.",
        "source": "T10n0285_001:0462a01_1"
    },
    {
        "source_sentence": "常行愍哀，歸無極慈；",
        "translation": "They always practice compassion and turn to infinite kindness.",
        "source": "T10n0285_001:0462a02_2"
    },
    {
        "source_sentence": "心不患厭生死之難，志于慚愧，而自莊嚴；",
        "translation": "Their minds are not troubled by the difficulties of birth and death. They aspire to shame and embarrassment, yet adorn themselves.",
        "source": "T10n0285_001:0462a02_3"
    },
    {
        "source_sentence": "心所生處，忍辱仁和；",
        "translation": "Wherever their minds are produced, they tolerate humility and benevolence.",
        "source": "T10n0285_001:0462a03_4"
    },
    {
        "source_sentence": "若干種物，供養奉上如來至真最等正覺；",
        "translation": "They offered various kinds of things to the supremely enlightened, supremely true buddhas.",
        "source": "T10n0285_001:0462a04_5"
    },
    {
        "source_sentence": "夙興夜寐，精進勤修；",
        "translation": "They wake up in the morning and sleep at night, exerting themselves energetically.",
        "source": "T10n0285_001:0462a05_6"
    },
    {
        "source_sentence": "不厭講誦，積功德本；",
        "translation": "They do not tire of lectures and recitations, accumulating roots of virtue.",
        "source": "T10n0285_001:0462a05_7"
    },
    {
        "source_sentence": "習於善友，以法樂而自娛；",
        "translation": "They associate with spiritual benefactors, and enjoy the happiness of the Teaching for themselves.",
        "source": "T10n0285_001:0462a06_8"
    },
    {
        "source_sentence": "求博聞不懈惓，若聞法順思惟，已思惟無所著；",
        "translation": "They seek learning and are not greedy; if they hear the Teaching, they follow reflection. Having reflected on it, they do not cling to anything.",
        "source": "T10n0285_001:0462a06_9"
    },
    {
        "source_sentence": "不悕望衣食，業諸利養；",
        "translation": "They do not covet food or clothing, and rely on profits derived from their actions.",
        "source": "T10n0285_001:0462a07_10"
    },
    {
        "source_sentence": "心不貪慕，萬物恩愛，心永已除；",
        "translation": "Their minds were not attached to anything, and their affection for all things had been forever removed.",
        "source": "T10n0285_001:0462a08_11"
    },
    {
        "source_sentence": "唯慕義求三寶，發意之頃，不廢正行，勤修慕樂一切智地，如來十力，",
        "translation": "They yearn only for truth and seek the Three Jewels. The moment of their arousal of mind they do not give up right practice, but diligently cultivate enthusiasm for the state of omniscience.",
        "source": "T10n0285_001:0462a09_12"
    },
    {
        "source_sentence": "四無所畏，佛十八法，專精奉行六度無極；",
        "translation": "The fourth fearlessness was the Buddha’s eighteen doctrines, in which he concentrated on and practiced the six transcendent ways without limit.",
        "source": "T10n0285_001:0462a10_13"
    },
    {
        "source_sentence": "棄捐虛偽，而無諛諂，言行相應，不違心口；",
        "translation": "They abandon falsehood and hypocrisy, yet they are not deceitful or flattering. Their words and deeds are concomitant with each other; they do not disobey thought or speech.",
        "source": "T10n0285_001:0462a11_14"
    },
    {
        "source_sentence": "所至到處，常順言行，未曾毀亂如來種姓；",
        "translation": "Wherever he went, he always practiced in accordance with words and never disrupted the family of the enlightened.",
        "source": "T10n0285_001:0462a12_15"
    },
    {
        "source_sentence": "恒一心念菩薩禁戒，一切智心，不可動搖，猶如太山不可傾覆；",
        "translation": "They are always mindful of the enlightening beings’ code of precepts, unshakably aware of omniscience like a great mountain that cannot be overturned.",
        "source": "T10n0285_001:0462a13_16"
    },
    {
        "source_sentence": "普於世間，無所慕樂，求度世業，以化未聞，學於道品，不知厭足，心常勤勤，",
        "translation": "They have no desire for worldly pleasures and seek to liberate others from worldly occupations. In order to edify those who haven’t heard of them yet, they study the qualities of enlightenment without tire or getting tired of them.",
        "source": "T10n0285_001:0462a15_17"
    },
    {
        "source_sentence": "求殊特事；",
        "translation": "They seek extraordinary things.",
        "source": "T10n0285_001:0462a16_18"
    },
    {
        "source_sentence": "是為佛子如是像業清淨道事淨菩薩法，輒得堅住悅豫之地。",
        "translation": "This is how the Buddha-child thus acts like an image, purifying the path and serving the bodhisattva's teaching so that he can easily and firmly abide in the joyful land.",
        "source": "T10n0285_001:0462a17_19"
    },
    {
        "source_sentence": "「世尊復言：『若能得立悅豫地者，成菩薩住建立廣大無極之道。』",
        "translation": "Again, the Bhagavān says, 'If someone can establish a pleasing state, they'll become a bodhisattva who abides and establishes a vast and limitless path.'",
        "source": "T10n0285_001:0462a18_20"
    },
    {
        "source_sentence": "如是景模無限大願弘誓之鎧，又有十事法。",
        "translation": "Thus, there are ten other things that make up the armor of the infinity of the great vow and the vast vow of the Jingmuo.",
        "source": "T10n0285_001:0462a19_21"
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are these ten?",
        "source": "T10n0285_001:0462a20_22"
    },
    {
        "source_sentence": "班宣無盡，和雅音辭，至於無喻，無不周悉，供養諸佛一切奇珍；",
        "translation": "His teachings were inexhaustible, his words spoken in a harmonious and elegant way, all the way up to untold numbers. He was thoroughly endowed with all kinds of rare treasures offered to the Buddhas.",
        "source": "T10n0285_001:0462a21_23"
    },
    {
        "source_sentence": "篤信微妙清淨之業，法界坦然，志歸空界，究暢解達，於當來際，一切無想，",
        "translation": "They earnestly believe in the subtle and pure deeds of enlightening beings. The realm of reality is unobstructed; their aspiration is to return to the realm of space. They thoroughly understand and comprehend all things at the end of time, without ideation or thought.",
        "source": "T10n0285_001:0462a22_24"
    },
    {
        "source_sentence": "無所悕望，令佛道興，無所思樂，所奉事者，供於無極，志務大願，念諸如來所開演教，",
        "translation": "They have no hope of enlightenment, wishing to make the path of buddhahood arise; they do not think or delight in anything. Their service is unexcelled, dedicated to great vows, mindful of the teachings expounded by the enlightened ones.",
        "source": "T10n0285_001:0462a24_25"
    },
    {
        "source_sentence": "執持法目，將護諸佛諸菩薩業，不違一切平等覺訓；",
        "translation": "They hold the title of Teaching, which protects the deeds of buddhas and enlightening beings without disobeying all equally enlightened teachings.",
        "source": "T10n0285_001:0462a26_26"
    },
    {
        "source_sentence": "已能具足如上法訓，輒得出生在兜術天上，從天來下，入母腹中，處在胎藏，",
        "translation": "Having fulfilled these instructions, they can be reborn in the heaven of satisfaction. descending from that heaven, they enter their mother’s womb and are born in the womb.",
        "source": "T10n0285_001:0462a27_27"
    },
    {
        "source_sentence": "從母腹出，隨行七步，舉手自讚，三界最尊，釋梵稽首，諸龍浴體，學書手博，",
        "translation": "He came out of his mother’s womb and, seven paces behind her, raised his hand to praise himself. The god Brahmā was the most honored among the gods in the three quarters; Indra and Brahma greeted him with their heads bowed.",
        "source": "T10n0285_001:0462a29_28"
    },
    {
        "source_sentence": "遊觀所覩，出家入山，成佛降魔，釋梵勸助，轉大法輪，現大滅度，供養舍利，",
        "translation": "He renounced household life and went into the mountains to become a buddha. Having subdued Māra, he was encouraged by Indra and Brahmā; turning the great wheel of the Dharma, he manifested extensive extinction and made offerings to Śāriputra.",
        "source": "T10n0285_001:0462b01_29"
    },
    {
        "source_sentence": "宣布道化，顯眾經義，皆以一時，至不退轉，法界弘廣，不可限量，處虛空界，",
        "translation": "He proclaimed the teaching of the Way and revealed the meanings of all the scriptures. All at one time, up to the point of nonregression, the cosmos of reality being vast and immeasurable, he dwelt in the space realm.",
        "source": "T10n0285_001:0462b03_30"
    },
    {
        "source_sentence": "究竟解暢當來之際，於一切念而無想念，從無數劫，會成佛道，篤信無惓；",
        "translation": "At the time of their ultimate liberation in the future they will have no thoughts or thoughts about anything. For countless eons they will unite and attain enlightenment, earnestly believing without ill-will.",
        "source": "T10n0285_001:0462b05_31"
    },
    {
        "source_sentence": "俱往合同，班宣義音，無極弘誓，乃至菩薩一切諸行，弘普無窮，無量無數，",
        "translation": "Together they go to each other in order to expound the Teaching, with unexcelled great vows. All the practices of enlightening beings are boundless and limitless, immeasurable and countless.",
        "source": "T10n0285_001:0462b07_0"
    },
    {
        "source_sentence": "攝取一切諸度無極，住清淨道，校計眾會品類音響有相無相，合會別離有為無為，",
        "translation": "They embrace all transcendent ways without bound and abide in the pure path. They calculate the sounds, characteristics, and signlessnesses of all kinds of congregations; they combine to form assemblies to distinguish them from conditioned and unconditioned.",
        "source": "T10n0285_001:0462b08_1"
    },
    {
        "source_sentence": "為諸菩薩一切師首，道住真妙，所演章句，諸度無極；",
        "translation": "As the leaders of all enlightening beings, they abide by the path of truth and subtlety. The chapters and verses they teach have no limit in their transcendent ways.",
        "source": "T10n0285_001:0462b10_2"
    },
    {
        "source_sentence": "所當宣行，勤修正行，而無所生，近成發心，以能具足此諸法已，具足解暢眾生境界；",
        "translation": "The practices they should teach and diligently cultivate, yet there is nothing to give rise to. They will soon become determined for enlightenment, so that by being able to perfect these practices they will be fully liberated from the realm of sentient beings.",
        "source": "T10n0285_001:0462b11_3"
    },
    {
        "source_sentence": "色無色想，無想有想無想，水生陸地，合會聚處，一切所生，三界受形，",
        "translation": "Form and formless ideation, absence of ideation, there is neither ideation nor non-thought. Water arises on land or on land; it conjoins with assemblies and formations at the same place. All are produced in all three realms:",
        "source": "T10n0285_001:0462b13_4"
    },
    {
        "source_sentence": "六品所趣，此皆受形，而有處所，受無像形，一切無喻眾生之界，悉分別之，",
        "translation": "The sixfold doctrine is that all sentient beings receive their forms, but there are places where they receive formless forms. They analyze and discern all the worlds of all living beings without metaphors.",
        "source": "T10n0285_001:0462b15_5"
    },
    {
        "source_sentence": "化入佛法斷除一切有為所生，則得建立成一切智，是則名曰法界弘廣，",
        "translation": "To enter into the teachings of buddhas and to eliminate all conditioned things that are produced is to attain omniscience. This is called the vast expanse of the cosmos of reality.",
        "source": "T10n0285_001:0462b16_6"
    },
    {
        "source_sentence": "而得處在虛空之界，心能解暢當來原際，一切諸想有為之業，篤信無惓；",
        "translation": "Their sphere of enlightenment is in space, their minds can comprehend the past and future realms. They are devoted to all forms of ideation and conditioned action with no anger or jealousy.",
        "source": "T10n0285_001:0462b18_7"
    },
    {
        "source_sentence": "演御音響，乃至無極弘誓之業，一切解此眾生境界，道俗悉達無所不通，",
        "translation": "All understand the spheres of sentient beings, and all enlightening beings and laymen can comprehend them without fail.",
        "source": "T10n0285_001:0462b20_8"
    },
    {
        "source_sentence": "普諸佛界廣狹麁微，大小所現，有量無量，眇眇難名，曠遠原頂，入于平等，",
        "translation": "All buddha-realms are vast, wide, narrow, and tiny; they appear in all directions, large and small, with measure or without measure. Their names are difficult to pronounce. They enter equanimity at the top of a plain that is far away.",
        "source": "T10n0285_001:0462b21_9"
    },
    {
        "source_sentence": "已入平等，曉了諸根，一切羅網解如門閫，入諸十方，以慧遍觀，解暢法界虛空原際，",
        "translation": "Having entered equanimity, they understand all faculties. Their networks of understanding are like doors and windows. Entering the ten directions, they contemplate everywhere with wisdom, comprehending as far away as space in the cosmos.",
        "source": "T10n0285_001:0462b23_10"
    },
    {
        "source_sentence": "則得了入無極弘誓；",
        "translation": "Then they attain and enter the boundless great vows.",
        "source": "T10n0285_001:0462b25_11"
    },
    {
        "source_sentence": "又一切國以為一國，又以一國為一切國，而平等御，清淨無穢，其光普照無量佛國，",
        "translation": "Also, all lands form one land, and one land forms all lands, yet they rule impartially, pure and without blemish. Their light illumines infinite buddha-lands everywhere.",
        "source": "T10n0285_001:0462b26_12"
    },
    {
        "source_sentence": "莊嚴諸國，永無塵埃，分別清淨章句所歸，聖慧道堂，不可限量，具眾生願，",
        "translation": "The adornments of all lands are never dustless, the distinctive and pure principles to which they belong; the sanctuaries of holy wisdom and enlightenment cannot be limited, fulfilling the vows of sentient beings.",
        "source": "T10n0285_001:0462b27_13"
    },
    {
        "source_sentence": "顯示諸佛微妙境界，隨其黎庶本行所興，而為現化，法界弘廣，察空虛界永無邊幅，",
        "translation": "They show the subtle sphere of buddhas, manifesting and teaching according to the practices of their common people. The cosmos of reality is vast; they perceive emptiness and voidness as infinite space.",
        "source": "T10n0285_001:0462b29_14"
    },
    {
        "source_sentence": "究竟本際一切想念，計校合會，無有休息；",
        "translation": "At the ultimate state, all thoughts and thoughts are collected together in calculation without cease.",
        "source": "T10n0285_001:0462c02_15"
    },
    {
        "source_sentence": "亦不信隨邪行之業，修于清淨，建弘誓鎧，以化未聞，使諸菩薩入寂和性，",
        "translation": "Nor do they believe in the evil deeds of wrong practices, cultivating purity. They build great armies of vows to edify those who have not heard them, enabling enlightening beings to enter peace and harmony.",
        "source": "T10n0285_001:0462c03_16"
    },
    {
        "source_sentence": "當行至誠，積功累德，以一緣進，勸化誘導一切菩薩，未曾違捨菩薩之業，",
        "translation": "They should practice with utmost sincerity, accumulating merit and accumulating virtue. For the sake of a single cause they should exert effort to edify and guide all enlightening beings, never rejecting the deeds of enlightening beings.",
        "source": "T10n0285_001:0462c05_17"
    },
    {
        "source_sentence": "恣其意解，顯現佛興，自發己心，思如來教，無復往返，逮致神通，普遊諸國，",
        "translation": "In accordance with their wishes and understandings, they manifest the Buddha’s rise. They spontaneously arouse their own minds to think of the teachings of the enlightened ones; without going back or coming back, they attain transcendent powers and travel in all countries.",
        "source": "T10n0285_001:0462c06_18"
    },
    {
        "source_sentence": "其大聖慧，不可思議，行菩薩業，法界弘廣，虛空之界而無邊際，遊當來際，",
        "translation": "His great holy wisdom is inconceivable. He practices the deeds of enlightening beings, extending far and wide throughout the cosmos; his boundless space travels to all future realms.",
        "source": "T10n0285_001:0462c08_19"
    },
    {
        "source_sentence": "達諸想數，佛與眾數，其行之數，莫能損毀，入於聖智，顯發言行，無極弘誓；",
        "translation": "They comprehend conceptions as numerous as atoms, the Buddha as numerous as all beings; their actions as numerous as atoms, they cannot be slandered or disparated. Entering holy knowledge, they manifest verbal action and undertake unexcelled great vows.",
        "source": "T10n0285_001:0462c10_20"
    },
    {
        "source_sentence": "行菩薩道，心得逮轉，不退法輪，其身、口、意，未曾虛妄，適得見佛聞經法教，",
        "translation": "Practicing the path of enlightening beings, their minds are collected and developed; they do not turn away from the wheel of teaching. Their bodies, speech, and thought have never been false. They may be able to see buddhas and hear the Teachings of scriptures and doctrines.",
        "source": "T10n0285_001:0462c11_21"
    },
    {
        "source_sentence": "班宣聖眾，演明智業，適發悅豫，消除塵勞，致真志性，猶大醫王療眾生病，",
        "translation": "The holy monks and nuns of the assembly expounded the Teaching, expounding their wise deeds. They were able to arouse joy and relieving themselves of their physical and mental troubles so as to attain genuine aspiration, just as did the great physician king who cured the sicknesses of the assembly.",
        "source": "T10n0285_001:0462c13_22"
    },
    {
        "source_sentence": "皆修一切諸菩薩行，以故名曰法界弘廣。",
        "translation": "They all cultivate all the bodhisattva practices, which is why they're called the vast expanse of the Dharma realm.",
        "source": "T10n0285_001:0462c15_23"
    },
    {
        "source_sentence": "其虛空界而無崖際，暢當來際，皆知一切無央數劫，眾生行迹，善惡所趣；",
        "translation": "The realm of space has no precipices, and they know the past, future, and infinite ages in which all sentient beings have traveled, where good and evil belong.",
        "source": "T10n0285_001:0462c16_24"
    },
    {
        "source_sentence": "在於十方諸佛國土，逮成無上正真之道，為最正覺，入於一切體中毛孔，",
        "translation": "In all the buddha-lands of the ten directions they had mastered the supreme path of enlightenment. They were the foremost enlightened ones, entering every pore in their bodies.",
        "source": "T10n0285_001:0462c17_25"
    },
    {
        "source_sentence": "盡遍眾毛，在所生處，坐佛樹下，轉於法輪，現大滅度，修大境界，宣佛慧業，",
        "translation": "At the place where he was born, sitting at the foot of a buddha-tree, he turned the wheel of the Teaching, manifested great extinction, cultivated great spheres, and expounded the deeds of Buddha’s wisdom.",
        "source": "T10n0285_001:0462c19_26"
    },
    {
        "source_sentence": "在眾生界，從其本行，興佛現形，頻數開化，滅眾穢行，一成佛道，普通法界，",
        "translation": "In the realm of sentient beings, following their original practice, they give rise to buddha-manifest forms, frequently enlightening and transforming, extinguishing all defiled actions. One accomplishes the buddha path, while the other is in the realm of reality.",
        "source": "T10n0285_001:0462c21_27"
    },
    {
        "source_sentence": "謙下恭順，靡不周悉，一發音響，皆悅一切眾生心性，現大滅度，不毀十力，",
        "translation": "They are humble, respectful, and obedient; they comprehend all. The sound of one voice pleases the minds of all sentient beings. They manifest great extinction without disparaging the ten powers.",
        "source": "T10n0285_001:0462c23_28"
    },
    {
        "source_sentence": "以大明地，顯示宣布一切法藏，神足法慧，六通之業，周遊十方諸佛境界，",
        "translation": "The stage of great illumination revealed and proclaimed all the treasury of truth, spiritual powers, doctrine and wisdom, and the deeds of the six supernatural powers traveled everywhere in the realms of the buddhas of the ten directions.",
        "source": "T10n0285_001:0462c24_29"
    },
    {
        "source_sentence": "以故名曰法界弘廣。",
        "translation": "That's why it's called the vast expanse of the Dharma realm.",
        "source": "T10n0285_001:0462c26_30"
    },
    {
        "source_sentence": "其虛空界而無崖際，暢當來際無央數劫，當成佛道，致大神通弘誓之鎧，",
        "translation": "In the realm of space, there is no limit to the precipice; and in the immeasurable eons to come, they will attain enlightenment, leading to the armor of great mystic powers and vows.",
        "source": "T10n0285_001:0462c26_31"
    },
    {
        "source_sentence": "是為佛子菩薩十願。",
        "translation": "These are the ten vows of the Buddha-child bodhisattva.",
        "source": "T10n0285_001:0462c28_32"
    },
    {
        "source_sentence": "「以得親近具足十願，令無央數不可稱載諸菩薩眾，心懷悅豫，住菩薩地，",
        "translation": "Having become intimate with the enlightening beings who have fulfilled these ten vows, they cause countless and immeasurable hosts of enlightening beings to abide in the stage of enlightening beings.",
        "source": "T10n0285_001:0462c29_33"
    },
    {
        "source_sentence": "隨時開化佛言，是菩薩學，以成此願。",
        "translation": "This is the bodhisattva's training that accomplishes this vow by revealing the Buddha's words at any time.",
        "source": "T10n0285_001:0463a01_34"
    },
    {
        "source_sentence": "復有十事所可班宣不可究竟，何謂為十？",
        "translation": "Again, there are ten things that can be classified and cannot be perfected. What are they?",
        "source": "T10n0285_001:0463a02_35"
    },
    {
        "source_sentence": "眾生境界不可究竟；",
        "translation": "The sphere of sentient beings cannot be perfected.",
        "source": "T10n0285_001:0463a03_36"
    },
    {
        "source_sentence": "諸佛境界亦不可盡；",
        "translation": "The spheres of buddhas also cannot be exhausted.",
        "source": "T10n0285_001:0463a04_37"
    },
    {
        "source_sentence": "其虛空界亦不可量；",
        "translation": "The realm of space is also immeasurable.",
        "source": "T10n0285_001:0463a04_38"
    },
    {
        "source_sentence": "思法境界亦不可暢；",
        "translation": "Nor can one indulge in thought about the sphere of things.",
        "source": "T10n0285_001:0463a05_0"
    },
    {
        "source_sentence": "無為境界亦不可限；",
        "translation": "The sphere of the unconditioned also cannot be limited.",
        "source": "T10n0285_001:0463a05_1"
    },
    {
        "source_sentence": "佛之境界不可得底；",
        "translation": "The sphere of buddhahood is ungraspable.",
        "source": "T10n0285_001:0463a05_2"
    },
    {
        "source_sentence": "如來境界亦無崖際；",
        "translation": "The realm of the Buddha also has no precipices.",
        "source": "T10n0285_001:0463a06_3"
    },
    {
        "source_sentence": "其心因緣亦不可限；",
        "translation": "The causes and conditions of their minds cannot be limited.",
        "source": "T10n0285_001:0463a06_4"
    },
    {
        "source_sentence": "慧行本末不可得崖；",
        "translation": "The practice of wisdom is fundamental and derivative, so no cliff can be found.",
        "source": "T10n0285_001:0463a07_5"
    },
    {
        "source_sentence": "諸佛境界所可進退，法迴慧轉不可究竟；",
        "translation": "The realm of buddhas can be progressed or regressed, but the evolving dharmas and wisdoms cannot be perfected.",
        "source": "T10n0285_001:0463a07_6"
    },
    {
        "source_sentence": "是為十事。",
        "translation": "These are the ten things.",
        "source": "T10n0285_001:0463a08_7"
    },
    {
        "source_sentence": "眾生境界不可究竟成大弘誓，是十事業一切皆悉不可究竟，諸界虛空，",
        "translation": "The sphere of sentient beings cannot be perfected, and they cannot make great vows. These ten undertakings are all inexhaustible:",
        "source": "T10n0285_001:0463a09_0"
    },
    {
        "source_sentence": "法界無為，佛與如來，其心慧行，世界法轉，慧進致成，是大弘誓亦盡無盡，",
        "translation": "The realm of reality is unconditioned; the Buddha and the enlightened ones are mind, wisdom, action, world, and doctrine. The advancement of wisdom leads to their attainment. This great undertaking also has no limit.",
        "source": "T10n0285_001:0463a10_1"
    },
    {
        "source_sentence": "眾生之界亦不可盡；",
        "translation": "The realm of sentient beings also cannot be exhausted.",
        "source": "T10n0285_001:0463a12_2"
    },
    {
        "source_sentence": "以不可盡此眾德本，如是究竟成其道慧，以是叵盡眾德之本，成無損耗弘誓之鎧，",
        "translation": "Because these roots of virtue cannot be exhausted, they thus ultimately develop the wisdom of enlightenment. Because these roots of virtue cannot be exhausted, they form the armor of unwavering great vows.",
        "source": "T10n0285_001:0463a12_3"
    },
    {
        "source_sentence": "其心微妙而懷仁和，常抱至誠篤信質朴；",
        "translation": "Their minds were subtle and delicate but they cherished kindness and harmony. They always embraced sincerity, faith, and simplicity.",
        "source": "T10n0285_001:0463a14_4"
    },
    {
        "source_sentence": "以此信樂如來大化，入平等覺本所誓願，而復信樂諸度無極，信入道地殊特之業，",
        "translation": "Because of this faith in the great emanation of Buddha, they entered into the original vow of equanimity and enlightenment. They also believed in the boundlessness of transcendence and believed in the special deeds of entering the stages of enlightenment.",
        "source": "T10n0285_001:0463a15_5"
    },
    {
        "source_sentence": "信十種力開化十方，信無所畏四事不護而具足是獨步三界，信諸佛法十八不共超絕之義，",
        "translation": "To believe in the ten kinds of power that enlighten the ten directions, and to believe in fearlessness without the four things they don't guard and be fully endowed with them is the meaning of walking alone in the three realms, believing in the 18 distinctive characteristics of the Buddha's teachings and transcending them.",
        "source": "T10n0285_001:0463a17_6"
    },
    {
        "source_sentence": "而無等侶，信諸佛法不可思議，信如來界不可得底，宣傳聖教而不可盡，",
        "translation": "They believed that the Buddha’s teachings were inconceivable. They believed that the realm of the enlightened ones was ungraspable, and they propagated holy teachings without being able to exhaust them.",
        "source": "T10n0285_001:0463a19_7"
    },
    {
        "source_sentence": "信入如來無量道業，信諸菩薩其行平等，而無偏讜；",
        "translation": "They believe in the infinite paths of action of buddhas. They believe that enlightening beings’ practices are impartial, without partiality or discrimination.",
        "source": "T10n0285_001:0463a21_8"
    },
    {
        "source_sentence": "住於如來，班宣道教，彼念如是如來道法，甚深微妙巍巍如斯，寂寞無限淡泊無量，",
        "translation": "Those who abide in the teachings of the path taught by the Buddha are mindful of these teachings of the path of the enlightened, which are so profound and subtle and lofty as to be like this. Their loneliness is infinite, immeasurable, tranquil, and immeasurable.",
        "source": "T10n0285_001:0463a22_9"
    },
    {
        "source_sentence": "空淨無際如此無相，為滅無著為極寬弘，如是無極所入無邊，如此難當況復佛法，",
        "translation": "The purity of emptiness has no limit, so it has no marks. In order to be extinguished without attachment and in order to have great breadth, such an infinite entry has no limit. Such a difficulty should be compared with the Buddha’s teaching:",
        "source": "T10n0285_001:0463a24_10"
    },
    {
        "source_sentence": "誰能限哉；",
        "translation": "Who will be able to limit it?",
        "source": "T10n0285_001:0463a26_11"
    },
    {
        "source_sentence": "是諸凡夫所見顛倒，邪不能正，唯念愚冥求無益事，心懷意憶遊於塵勞，",
        "translation": "Ordinary people are deluded in their views and unable to rectify errors. They think only of foolishness and ignorance as useless things, and they harbor thoughts of traveling through the motions of worldly affairs.",
        "source": "T10n0285_001:0463a26_12"
    },
    {
        "source_sentence": "求恩愛網協於諛諂，心行虛偽慳嫉貪妬，志慕生死，周遊往來，而抱三毒，",
        "translation": "They seek the network of kindness and affection in order to associate with deceitfulness, their minds behaving falsely, stinginess, jealousy, greed, covetousness, and jealousy. Desiring birth and death, they wander from one place to another, embracing the three poisons:",
        "source": "T10n0285_001:0463a28_13"
    },
    {
        "source_sentence": "婬怒癡垢輪轉無際，興于恚害心歘歘然熾，在顛倒業造行罪患；",
        "translation": "The defilement of lust, hatred, delusion, and ignorance has no limit in its transmigration.",
        "source": "T10n0285_001:0463b01_14"
    },
    {
        "source_sentence": "所有恩愛無明諸漏，常思在心縛其意識，展轉三界苦惱之厄，篡逆之行往返無休，",
        "translation": "All the contaminants of kindness, affection, love, ignorance, and craving are always thinking in their minds to bind their consciousnesses, perpetually tormenting the three realms of suffering and distress, and traveling back and forth with usurping actions without cease.",
        "source": "T10n0285_001:0463b02_15"
    },
    {
        "source_sentence": "與名色俱由相生，以是名色增長所生，便有六入諸衰聚宅；",
        "translation": "Because name and form arise in tandem with each other, they are produced by the growth of name and form. This is why there are the six bases of decay.",
        "source": "T10n0285_001:0463b04_16"
    },
    {
        "source_sentence": "以生六入轉相合流，成于更習，則興痛痒；",
        "translation": "When the six sense-fields arise in mutual conjunction with each other, forming new habits, pain and itch will occur.",
        "source": "T10n0285_001:0463b05_17"
    },
    {
        "source_sentence": "倍復貪樂，於痛痒業，因即業成長養因愛；",
        "translation": "Desire doubles again: regarding the action of pain and itchiness, the cause is that which acts in relation to this action and develops by reason of it.",
        "source": "T10n0285_001:0463b06_18"
    },
    {
        "source_sentence": "適成恩愛，因從致生；",
        "translation": "As soon as they become affectionate, it is the cause that causes them to arise.",
        "source": "T10n0285_001:0463b07_19"
    },
    {
        "source_sentence": "以致此生，便老病死憂惱啼哭，心抱惱熱，合成大患；",
        "translation": "As a result of this birth, old age, sickness, death, grief, lamentation, and sorrow are combined into one great misfortune.",
        "source": "T10n0285_001:0463b08_20"
    },
    {
        "source_sentence": "計於眾生，由是之故生苦陰惱身。",
        "translation": "It's because of this that the aggregate of suffering and the body of affliction arise in sentient beings.",
        "source": "T10n0285_001:0463b09_21"
    },
    {
        "source_sentence": "若離吾我，心自計察，又此我身，由以愚冥，譬若草木瓦石牆壁，猶若形影，",
        "translation": "If we part with our self and think of it as self, then this self is like grass, trees, tiles, stones, walls, or shapes.",
        "source": "T10n0285_001:0463b10_22"
    },
    {
        "source_sentence": "曉了無名，以是之故，解脫名色五陰之身，永消諸見六十二疑，因斯得成無極大哀；",
        "translation": "Because of this liberation from the body of the five aggregates of name and form, they permanently eliminate all views and sixty-two doubts. Because of this they attain infinite great compassion.",
        "source": "T10n0285_001:0463b11_23"
    },
    {
        "source_sentence": "吾等當護救濟此行，志在永平固安道地，便致大慈弘坦聖慧。",
        "translation": "We should protect and save these practices, aim for peace and stability in the path, and then we'll attain great kindness and vast noble wisdom.",
        "source": "T10n0285_001:0463b13_24"
    },
    {
        "source_sentence": "「菩薩以能如是慈愍，是故佛子！",
        "translation": "Because the bodhisattva can thus be compassionate, therefore, Buddha-child!",
        "source": "T10n0285_001:0463b15_25"
    },
    {
        "source_sentence": "致成仁和，真正順從，初發意業，心棄一切萬物利養，汲汲悋惜；",
        "translation": "They become benevolent and harmonious, genuinely obedient. When they first set out for enlightenment, their minds give up all kinds of things to gain profit and draw in begrudgingly.",
        "source": "T10n0285_001:0463b15_26"
    },
    {
        "source_sentence": "修廣大業，其意內懷，所有珍寶，帑藏金銀，琉璃水精，諸明月珠，車璩馬瑙，",
        "translation": "He cultivated extensive practices, keeping in his mind all the treasures he possessed: gold, silver, lapis lazuli, crystal, moonstone, chariotriages, agate, and horse agate treasures.",
        "source": "T10n0285_001:0463b17_27"
    },
    {
        "source_sentence": "珊瑚虎珀，妙玉瓔珞，[王*步]瑤奇異，象馬車乘，奴客婢使，眷屬徒使，",
        "translation": "It was decorated with coral, amber, jewelry of exquisite jewels, and an extraordinary array of elephants, horses, chariots, slaves, maidservants, and attendants.",
        "source": "T10n0285_001:0463b19_28"
    },
    {
        "source_sentence": "普能布施，無所愛惜；",
        "translation": "They were able to give alms everywhere, not cherishing anything.",
        "source": "T10n0285_001:0463b20_29"
    },
    {
        "source_sentence": "能惠郡國縣邑丘聚，村落園觀，池水果實，妻子男女，己所重愛頭目肌肉，",
        "translation": "He was well versed in all the teachings of the buddhas, such as enlightening beings’ doctrines; he had knowledge of the principles of sentient beings’ faculties, bodies, dharmas, and powers. He possessed knowledge of how to cultivate virtuous practices so that they would be able to benefit from them. They were well versed in Buddhist",
        "source": "T10n0285_001:0463b21_30"
    },
    {
        "source_sentence": "髓腦支體，以能不悋一切所有，則好布施；",
        "translation": "The essence of the limbs of marrow and brain, being able not to covet all that is possessed, they are fond of giving.",
        "source": "T10n0285_001:0463b22_31"
    },
    {
        "source_sentence": "供眾貧乏，入佛聖明無極大道，是為名曰得立初發第一道地。",
        "translation": "To make offerings to the poor and enter the Buddha's noble path of infinite insight is called attaining the first stage of establishing the first path.",
        "source": "T10n0285_001:0463b23_32"
    },
    {
        "source_sentence": "成廣大施，志性如是，行於愍哀，施慈布仁，救濟眾生，加護見在度世之業慕求利義，",
        "translation": "They become great donors, their aspirations such as these, practicing compassion, charity, kindness, and benevolence, rescuing sentient beings, guarding the views of world-transcending activities, seeking profit and benefit.",
        "source": "T10n0285_001:0463b25_33"
    },
    {
        "source_sentence": "將順群萌，未曾興發患厭之心，心不懈惓，勤學眾典微妙經籍；",
        "translation": "They will follow the ways of all living beings and never give rise to any thoughts of anguish or displeasure. Their minds will not be disgusted, but they will diligently study various texts and subtle scriptures.",
        "source": "T10n0285_001:0463b27_0"
    },
    {
        "source_sentence": "普達諸經，曉了一切諸所造業，進退由己，眾義法藏，覩諸眾庶，隨上中下，",
        "translation": "He thoroughly comprehended all the scriptures, and understood all the works he did. His advancement and retreat depended upon himself; his store of teachings containing all meanings delighted all living beings, according to their capacities.",
        "source": "T10n0285_001:0463b28_1"
    },
    {
        "source_sentence": "而順其意，各得所從，隨其本器，應大小故，故解世事；",
        "translation": "They understand worldly affairs, each according to his or her wishes, and they are able to follow him or her. According to the size of the vessel in which one is entangled, he or she may do so at will.",
        "source": "T10n0285_001:0463c01_2"
    },
    {
        "source_sentence": "以解世事，便行時宜因護彼我被慚愧服，戒德自熏，忍辱心和，精進無過，",
        "translation": "Because of their understanding of worldly affairs, they act appropriately in accordance with the [proper] time. In order to protect others against self-inflicted shame and shame, they are dressed in the garments of shame and shame. Their moral virtue is self-cultivated; their minds are tempered by forbearance and humility. There is no fault",
        "source": "T10n0285_001:0463c02_3"
    },
    {
        "source_sentence": "一心智慧，所行精進，為己為眾，慚愧行成；",
        "translation": "Their minds are unified in knowledge and wisdom; the effort they make is for themselves and others. They practice with shame and abashment.",
        "source": "T10n0285_001:0463c04_4"
    },
    {
        "source_sentence": "以是修行，便復出家，心不迴動，無能傾者，其力堅強；",
        "translation": "As a result of these practices he renounced the householder’s life. His mind never turned back, and there was no one who could overturn it.",
        "source": "T10n0285_001:0463c05_5"
    },
    {
        "source_sentence": "緣是堅強，供養如來，奉受其教；",
        "translation": "Because of this firmness, they honored the Buddha and accepted his teachings.",
        "source": "T10n0285_001:0463c06_6"
    },
    {
        "source_sentence": "由是之故，修治道地，令其嚴淨，興顯正法，乃至篤信，慈愍施眾，悉具此已，",
        "translation": "Because of this they cultivate the stages of enlightenment and purify them, revealing the true-dharma, up to faith, kindness, charity, and generosity. They have all attained these.",
        "source": "T10n0285_001:0463c07_7"
    },
    {
        "source_sentence": "乃住菩薩悅豫之地，為無數佛所見照念，於無量億百千姟無限兆載諸佛所護，",
        "translation": "“Then the Licchavi Vimalakīrti stayed in that pleasing land of enlightening beings and was illumined by countless buddhas, carrying infinite billions of myriads of trillions of eons under the care of those buddhas.",
        "source": "T10n0285_001:0463c08_8"
    },
    {
        "source_sentence": "便得進現，所願有力，微以逮見如來至真等正覺；",
        "translation": "They will then be able to develop and manifest themselves. Their aspirations powerful, they will see the enlightened with a tiny bit of perception as supremely true perfect enlightenment.",
        "source": "T10n0285_001:0463c10_9"
    },
    {
        "source_sentence": "以仁和心，而奉事之，積累菩薩永安之業。",
        "translation": "They serve them with kindness and harmony, accumulating the bodhisattva's eternally peaceful activities.",
        "source": "T10n0285_001:0463c11_10"
    },
    {
        "source_sentence": "諸有群生，所在危厄，往將護之；",
        "translation": "Sentient beings in distress, wherever they are, go and protect them.",
        "source": "T10n0285_001:0463c12_11"
    },
    {
        "source_sentence": "以是德本，勸助使發無上正真之道，供養諸佛，開化眾生，使得成就，",
        "translation": "Because of these roots of virtue they are encouraged to develop the unsurpassed true path, honoring buddhas, enlightening sentient beings, and causing them to attain enlightenment.",
        "source": "T10n0285_001:0463c13_12"
    },
    {
        "source_sentence": "欲化眾生，布施飲食，先救飢渴，發于四恩，悅樂有力，奉上敬中，愍順其下，",
        "translation": "In order to transform sentient beings, he bestows food and drink. He first rescues them from hunger and thirst and develops the four kinds of benevolence. Delighted with pleasure and strength, he honors those who are superior and venerates those who are inferior.",
        "source": "T10n0285_001:0463c15_0"
    },
    {
        "source_sentence": "惠施仁愛，利人等利，一切罪除，無有餘殃，不復種禍，所可供佛，開化眾生以成究竟。",
        "translation": "Beneficent, benevolent, and for the benefit of others, he's freed from all sins, has no remaining misfortune, and doesn't plant harm again. What he can offer to the Buddha is to enlighten sentient beings in order to achieve their ultimate goal.",
        "source": "T10n0285_001:0463c16_1"
    },
    {
        "source_sentence": "住此道地，以是德本助一切智，諸通愍慧，轉更茂盛，猶如佛子紫磨真金，",
        "translation": "Because of these roots of virtue they are able to aid in omniscience. Their powers, wisdom, and insight grow even more extensive like the purple polished gold of a Buddha’s offspring.",
        "source": "T10n0285_001:0463c18_2"
    },
    {
        "source_sentence": "絕工金師燒治煉金，以著火中其色益發，菩薩如是供養諸佛，勤化眾生功祚轉茂，",
        "translation": "A goldsmith who stops making gold and burns it to heal the metal, puts it in a fire and its color increases. Enlightening beings make offerings like this to the Buddhas, diligently edifying sentient beings, and their merit grows ever more powerful.",
        "source": "T10n0285_001:0463c20_3"
    },
    {
        "source_sentence": "嚴淨此法住於道地，以是德本興顯本元，乃至元本進退自由。」",
        "translation": "He adorns and purifies this teaching while abiding in the stage of enlightenment, so that the original source of virtue arises to reveal the original source, up to the point where the original source advances and retreats freely.",
        "source": "T10n0285_001:0463c22_4"
    },
    {
        "source_sentence": "金剛藏曰：「唯聽佛子！",
        "translation": "The Vajragarbha said, Listen, son of the Buddha!",
        "source": "T10n0285_001:0463c23_5"
    },
    {
        "source_sentence": "菩薩以住初發之地，當作是求，觀其行迹問其本末，諸佛菩薩為護善友，",
        "translation": "“When enlightening beings live in the first stage of enlightenment, they should seek this: to see the traces of their practice and ask where they are going. The buddhas and enlightening beings protect spiritual benefactors.",
        "source": "T10n0285_001:0463c24_6"
    },
    {
        "source_sentence": "正行無厭，以成道品，當所施住，是故名曰第一地住。",
        "translation": "He correctly practices without weariness and abides with the accomplishment of the factors of enlightenment, which should be given to him; therefore, he's called the first ground abode.",
        "source": "T10n0285_001:0463c25_7"
    },
    {
        "source_sentence": "「以當次問第二住地所行之業，云何致之？",
        "translation": "In order, you should ask the second question, What's the result of the actions that are performed in the second abode?",
        "source": "T10n0285_001:0463c27_0"
    },
    {
        "source_sentence": "諸佛菩薩，明師賢友，行法無厭，以成道住，取要言之，如是第二、第三、第四、第五、第六、第七、第八、第九、第十，",
        "translation": "“Furthermore, the buddhas and bodhisattvas show that their teachers are wise companions who practice the Dharma tirelessly. They abide on the path of attaining enlightenment in order to take up what is essential [to attain enlightenment]. The second, third, fourth, fifth, sixth, seventh, eighth, ninth,",
        "source": "T10n0285_001:0463c28_0"
    },
    {
        "source_sentence": "問其本末所當施行，而得成就諸佛菩薩。",
        "translation": "He asks about the accomplishment of the buddhas and bodhisattvas that he'll perform in the past and future.",
        "source": "T10n0285_001:0464a01_1"
    },
    {
        "source_sentence": "明師賢友，行法無厭，成就道地，道地之品，所觀道業，奉行德本，道地處所，",
        "translation": "It shows that teachers and good friends practice the Dharma tirelessly, perfecting the stages of enlightenment, the factors of enlightenment, contemplating the deeds of enlightenment, practicing the roots of virtue, and the abodes of enlightenment.",
        "source": "T10n0285_001:0464a02_2"
    },
    {
        "source_sentence": "曉了方便，一一分別，道地清淨，所入殊特，聖慧曰進，各各逮致，使不退轉，",
        "translation": "They understand the means of enlightenment and distinguish one from the other. The stages of enlightenment are pure; what they enter is special. The holy wisdom is progress. Each acquires it in order to prevent them from regressing.",
        "source": "T10n0285_001:0464a03_3"
    },
    {
        "source_sentence": "彼以如是淨菩薩住，解別如來無量聖慧，以立若斯方便隨時，是為菩薩第一道地，",
        "translation": "This is the first stage of enlightening beings’ path:",
        "source": "T10n0285_001:0464a05_4"
    },
    {
        "source_sentence": "而不迴轉也。",
        "translation": "It doesn't turn back.",
        "source": "T10n0285_001:0464a07_5"
    },
    {
        "source_sentence": "未曾廢退，如是遂進，得成十住，不還墮落聲聞緣覺。",
        "translation": "They never abandoned or regressed, thus advancing, and they attain the ten abodes without falling back into the śrāvakas and pratyekbuddhas.",
        "source": "T10n0285_001:0464a07_6"
    },
    {
        "source_sentence": "慧住顯明，稍近佛智無極光明，猶如佛子明智導師，將護大賈，諸品群眾，",
        "translation": "The abode of wisdom is manifest, and it's slightly near the infinite light of Buddha's wisdom, just like the Buddha-child's guide of insight and wisdom, who will protect the great caravan and the masses of people in various classes.",
        "source": "T10n0285_001:0464a09_7"
    },
    {
        "source_sentence": "度厄難路，得願到國入大城中，所越徑路悉曉了之，徑路好醜善惡難易，",
        "translation": "Having crossed the difficult and dangerous roads, he wishes to reach his own country and enter the great city. He knows all the paths that lead beyond him; the good and bad routes are easy to follow, but it is difficult for them to change.",
        "source": "T10n0285_001:0464a10_8"
    },
    {
        "source_sentence": "某處殊安某處恐難，重問餘路所當興立，所乘車馬諸象大乘，可得通度，",
        "translation": "I'm afraid there's a certain place that's different and a certain place that's difficult, and I'll repeatedly ask where the other paths will rise up. The chariots, horses, elephants, and great vehicles on which I ride can be crossed.",
        "source": "T10n0285_001:0464a12_9"
    },
    {
        "source_sentence": "而不動傾。",
        "translation": "It doesn't budge.",
        "source": "T10n0285_001:0464a14_10"
    },
    {
        "source_sentence": "第一住地亦復如斯，猶如斯人至大城裏，悉別安處無諸動轉，從第一住所立道地，",
        "translation": "The first abode is also like this: just as when a man arrives in a great city, he places himself separately and without moving anywhere. He establishes the stage of the path from the first abode.",
        "source": "T10n0285_001:0464a14_11"
    },
    {
        "source_sentence": "奉慧如是靡所不達，以大財富無窮之業，等化大眾至入大城，不為穢濁之所見溺，",
        "translation": "Because of his great wealth and boundless deeds, he taught the masses equally until they entered the great city, not being submerged in the sight of filthy things.",
        "source": "T10n0285_001:0464a16_12"
    },
    {
        "source_sentence": "能自為己不危眾賈。",
        "translation": "They can do it for themselves and not jeopardize other people’s business.",
        "source": "T10n0285_001:0464a18_13"
    },
    {
        "source_sentence": "如是佛子！",
        "translation": "So it is, Buddha-child!",
        "source": "T10n0285_001:0464a18_14"
    },
    {
        "source_sentence": "菩薩猶如明智導師，以能得住第一道地，曉了諸地，嚴淨修治一切道地，",
        "translation": "“Enlightening beings are like a teacher of knowledge and wisdom who, by attaining the first stage of enlightenment, understands all stages and develops all states of enlightenment.",
        "source": "T10n0285_001:0464a18_15"
    },
    {
        "source_sentence": "至於十住解暢菩薩一切道地，入如來慧，攝取菩薩無極福慶積德之業，",
        "translation": "As for the enlightening beings in the ten stages of all paths, they entered into the knowledge of buddhas and collected the infinite virtuous deeds of enlightening beings.",
        "source": "T10n0285_001:0464a20_16"
    },
    {
        "source_sentence": "累于聖慧，所作已辦。",
        "translation": "They're bound by the noble wisdom, and what they've done has been done.",
        "source": "T10n0285_001:0464a22_17"
    },
    {
        "source_sentence": "為眾大導應意開化，使越生死往返大難無窮曠野飢渴苦患，則以通達，",
        "translation": "They are great leaders of all living beings, enlightening them according to their wishes, causing them to cross the great difficulties of birth and death. In the unremitting wilderness of hunger, thirst, and suffering, they penetrate.",
        "source": "T10n0285_001:0464a22_18"
    },
    {
        "source_sentence": "入一切智無極法城。",
        "translation": "He enters the city of the infinite Dharma of omniscience.",
        "source": "T10n0285_001:0464a24_19"
    },
    {
        "source_sentence": "是故佛子！",
        "translation": "Therefore, offspring of Buddha!",
        "source": "T10n0285_001:0464a24_20"
    },
    {
        "source_sentence": "菩薩大士，以無惓心，常修精進，致於殊特嚴淨道地，是為佛子名曰菩薩大士悅豫第一住地入于道門演普等教。",
        "translation": "Because of their absence of anger, the bodhisattva-mahāsattva always cultivates effort and leads to the stage of the path of special adornment and purity, which is called the first abode of joy for the bodhisattva-mahāsattva, the Buddha-son named Bodhisattva, who enters the gate of the path and explains the universal teaching",
        "source": "T10n0285_001:0464a25_21"
    },
    {
        "source_sentence": "菩薩住此，所遊天下，國土處所，得大威豪將護道法，以大惠施濟于眾生，",
        "translation": "“Where the enlightening beings dwell, they travel in all worlds and lands; wherever they may be, they attain great power. They will protect the Teaching and give great benevolence to sentient beings.",
        "source": "T10n0285_001:0464a27_22"
    },
    {
        "source_sentence": "以善功德消除貪嫉，退其垢穢宣無窮施，所興德本施救眾乏，諸可珍愛，",
        "translation": "With good qualities, he removes craving and jealousy, turns away from their defilements, proclaims infinite generosity, generates virtue based on generosity to save the poor, and produces rare treasures.",
        "source": "T10n0285_001:0464a29_23"
    },
    {
        "source_sentence": "割情濟眾，行四恩義，惠施仁愛，利人等利一切救濟，合聚黎庶心不捨佛，",
        "translation": "They cut off emotions to save sentient beings, practice the four kinds of kindness, bestow charity and kindness, benefit others equally, and rescue all living beings. They are united with the minds of the common people and don’t give up the Buddha.",
        "source": "T10n0285_001:0464b02_24"
    },
    {
        "source_sentence": "思法聖眾惟菩薩業，志菩薩行諸度無極十住之地，念於十力，四無所畏，",
        "translation": "The holy ones who thought of the Teaching and reflected on enlightening beings’ deeds, determined to practice the perfections of enlightening beings in the ten stages of unexcelled enlightenment. They were mindful of the ten powers and four fearlessnesses:",
        "source": "T10n0285_001:0464b03_25"
    },
    {
        "source_sentence": "十八不共，諸佛之法，至悉具足一切智矣。",
        "translation": "The eighteen unique qualities of the buddhas' teachings are all fully endowed with omniscience.",
        "source": "T10n0285_001:0464b05_26"
    },
    {
        "source_sentence": "以是德致一切至尊無極豪相，為最為上為無疇匹，為無等侶，開導宣化，",
        "translation": "Because of these virtues, all the supremely honored and extremely powerful forms are enlightened. They are the foremost, unsurpassed, peerless, unequaled, and unrivaled among all beings.",
        "source": "T10n0285_001:0464b06_27"
    },
    {
        "source_sentence": "顯示眾人，成一切智；",
        "translation": "To show sentient beings they attain omniscience.",
        "source": "T10n0285_001:0464b08_28"
    },
    {
        "source_sentence": "將濟危厄，發意之頃，精進勤修一切順化，不慕時俗財利之業，道法之正，",
        "translation": "When he was about to rescue them from danger and misfortune, the enlightened man exerted himself vigorously in all ways of teaching others. He did not crave worldly gains or secular deeds at the time but rather relied upon what was right for religious salvation.",
        "source": "T10n0285_001:0464b08_29"
    },
    {
        "source_sentence": "出家學道，奉佛法教，斯須之間，致無央數諸三昧定，見諸佛尊不可稱載；",
        "translation": "He renounced the householder’s life to study the path and honored the Buddha’s teaching of the Dharma. In order to do so, he entered incalculable numbers of concentrations wherein he saw buddhas that were unworthy of being mentioned.",
        "source": "T10n0285_001:0464b10_30"
    },
    {
        "source_sentence": "以是建立，覩諸世界無央數千，念得越度無數國土，照諸境界，開化眾生，",
        "translation": "Because of this he established countless buddha-fields in countless worlds, instantly liberating countless lands. He illumined all realms and enlightened sentient beings.",
        "source": "T10n0285_001:0464b11_31"
    },
    {
        "source_sentence": "識念過去當來諸劫，撰擇法門，顯示諸身，現諸菩薩無央數載，眷屬圍繞。",
        "translation": "He remembered the past and future eons, compiled a method of discernment, showed his bodies, and manifested measureless years of enlightening beings, surrounded by their retinues.",
        "source": "T10n0285_001:0464b13_32"
    },
    {
        "source_sentence": "菩薩由是所建立力，入殊特願，在所變現，諸可興善，宣布惠施，乃至普通無數億姟百千劫事。」",
        "translation": "Because of the power created by this, the bodhisattva enters into special vows that are manifested in what's changed, proclaims goodness, and gives alms, up to an uncountable number of hundreds of millions of eons of ordinary practices.",
        "source": "T10n0285_001:0464b15_33"
    },
    {
        "source_sentence": "「積累清白法，　　殖眾德之本；",
        "translation": "Accumulating pure and genuine dharmas, They plant the roots of virtue.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　稽首歸諸佛，　　順行慈仁業。",
        "translation": "They bow their heads in homage to the buddhas, Following the practice of kindness and benevolence.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　入于信解脫，　　清淨善之元；",
        "translation": "Entering into the liberation of faith Is the root of pure goodness.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　心御無限量，　　最勝之聖慧。",
        "translation": "Their minds are controlled by unlimited, supremely noble wisdom.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　佛為一切智，　　淨力現其處；",
        "translation": "Buddha, for the sake of omniscience, Manifests his pure power wherever he is.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　成就眾祐法，　　導利護群黎。",
        "translation": "Accomplishing the teaching of all blessings, he guides and protects sentient beings.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以行大愍哀，　　轉殊勝法輪；",
        "translation": "By undertaking great compassion one turns the wheel of the supreme teaching.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　如來田佳良，　　興發心甚尊。",
        "translation": "The field of the Tathāgata is good, and his arousal of mind is most venerable.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　一時所曉了，　　思惟泥洹業；",
        "translation": "What they understand at one time They contemplate the deeds of nirvana.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　若干覺眾生，　　隨時顯其義。",
        "translation": "Certain enlightened sentient beings show their meaning at any time.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　合集一切德，　　是為眾導師；",
        "translation": "To gather together all virtues Is the leader of the masses.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　其心所周入，　　猶等如虛空。",
        "translation": "The objects of his mind enter everywhere, Just as space does.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　智慧最威神，　　本哀行善權；",
        "translation": "The supremely majestic and wise One was originally compassionate and skillful in good deeds.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　志性懷篤信，　　清淨力無量。",
        "translation": "Their aspiration is pure and their power is immeasurable.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　面見無罣礙，　　救濟外眾生；",
        "translation": "Their faces are unobstructed, They rescue beings outside the world.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　殖種平等業，　　思惟念安住。",
        "translation": "He plants equal actions, contemplates and abides in mindfulness.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　適生心之寶，　　眾祐自然慧；",
        "translation": "The jewel of the mind that gives rise to enlightenment Is the natural wisdom of all blessings.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以通雅力行，　　究竟佛道法。",
        "translation": "He practices with the power of penetration and refinement, Ultimately realizing the Buddha Way.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　生十力種性，　　永無諸罪殃；",
        "translation": "Given birth to the seed nature of the ten powers, There will be no sin or misfortune at all.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　最勝曜正真，　　至于尊上道。",
        "translation": "It's the most superior, correct, and true, up to the supreme path.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　是為心和同，　　顯發致平地；",
        "translation": "This is the harmony of mind, Which reveals and produces a level ground.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　無動猶如山，　　在國等性行。",
        "translation": "The unmoving is like a mountain, which acts by its own nature in countries and so forth.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　多所抱歡悅，　　志意修篤信；",
        "translation": "They are embraced by many and delighted, And their aspiration is to cultivate faith.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　欣樂應廣普，　　善哉意義妙。",
        "translation": "The joy and bliss should be extensive and universal, Good, marvelous in meaning.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　要離諸恐懼，　　無有瞋恚行；",
        "translation": "If one wants to be free of fear, One should practice without anger.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　應時勝棄穢，　　謹順善將養。",
        "translation": "At the right time, he's superior in abandoning defilement and being careful to follow goodness and nurture it.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　樂救眾群生，　　聖慧無等侶；",
        "translation": "Delighted to save all sentient beings, His holy wisdom has no equal.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　心懷至踊躍，　　捐除眾非處。",
        "translation": "Their hearts are full of joy and they give up all wrong places.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以消五恐畏，　　緣是致道地；",
        "translation": "By eliminating the five fears, One attains the state of enlightenment by relying on these.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　至死不保命，　　遠于諸惡趣。",
        "translation": "When he reaches death, he won't keep his life, and he's far removed from bad destinies.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以捨眾會畏，　　終無恐懼心；",
        "translation": "Because they abandon the fear of congregations, They have no fear in their minds at all.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　何因至今無，　　則無有吾我。",
        "translation": "What is the reason it doesn't exist now? Then there won't be a self.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　若能離恐懼，　　專精行慈愍；",
        "translation": "If one can be free of fear, One should concentrate on kindness and compassion.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　至信修恭敬，　　除慕富功勳。",
        "translation": "He cultivates respect with utmost faith, Rejecting the desire for wealth and merit.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　夙興而夜寐，　　修習眾德本；",
        "translation": "They awaken in the morning and sleep at night, Cultivating the roots of virtue.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以立誠信法，　　不為欲所污。",
        "translation": "By establishing faith in the Dharma, they aren't stained by desire.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　心若聞雅典，　　修善無厭極；",
        "translation": "If one’s mind hears fine scriptures, Cultivates goodness without weariness.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　永除愛欲利，　　常好樂佛道。",
        "translation": "Forever rid of craving and profit, they always delight in the Buddha’s path.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　志慕淨慧力，　　修治佛經法；",
        "translation": "They aspire to the power of pure wisdom And cultivate the teachings of buddha-scriptures.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　求諸度無極，　　棄捐諛諂業。",
        "translation": "Seeking the perfections without limit, they abandon crude and flattering activities.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　言行常相應，　　終無虛妄言；",
        "translation": "Their words and deeds are always concomitant, And there is never false speech.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　最勝種無穢，　　疾學至佛道。",
        "translation": "The most excellent seed is pure, and he quickly trains to attain the Buddha Way.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以離方俗事，　　不樂世諸利；",
        "translation": "Because they are detached from worldly affairs, They do not delight in worldly gain.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　不違清白法，　　勤修最上行。",
        "translation": "Not disobeying the pure and white dharma, they diligently cultivate the highest practice.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　精勤功勳義，　　唯好如此法；",
        "translation": "The meaning of exertion and effort is that they only like this teaching.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　導御以自誓，　　所欲見最勝。",
        "translation": "He guides them with his own vow, which is the most superior in terms of what he wants to see.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　為諸奉持法，　　所至無嫉妬；",
        "translation": "For the sake of all those who uphold the Dharma, They will reach everywhere without jealousy.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　將順以弘誓，　　身行常殊妙。",
        "translation": "I'll follow it with a great vow, and my physical actions will always be marvelous.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　嚴淨諸佛土，　　開化眾群生；",
        "translation": "They adorn and purify all buddha-lands And lead and inspire sentient beings.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　是遍諸佛土，　　與諸佛俱遊。",
        "translation": "They pervade all buddha-lands And travel together with the Buddhas.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　佛以一名稱，　　彼此無虛妄；",
        "translation": "Because the Buddha uses one name, They are not false to each other.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　一切皆可得，　　覺了最上義。",
        "translation": "Everything can be obtained, and he perceives the supreme meaning.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　如是願無量，　　導利至永安；",
        "translation": "Such vows as these are immeasurable, guiding and benefiting to eternal peace.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　是廣普無限，　　逮致無可畏。",
        "translation": "It's boundless in breadth and boundless, and there's nothing to fear in its attainment.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　眾生猶虛空，　　諸法所因生；",
        "translation": "Sentient beings are like space, Produced by the causes of all dharmas.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　最勝究竟俗，　　興顯于慧地。",
        "translation": "The supreme and ultimate secular Awaken in the stage of wisdom.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　其心之境界，　　極入於聖慧；",
        "translation": "The sphere of their minds They enter ultimately into holy wisdom.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　逮致三達智，　　以開于眾生。",
        "translation": "He acquires the three kinds of comprehensive wisdom to enlighten sentient beings.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　究竟至弘誓，　　令我獲此願；",
        "translation": "The ultimate and supremely great vow Is to cause me to attain this vow.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　如是之暢達，　　其行亦若茲。",
        "translation": "Such is the practice of this kind of fluent understanding, and so is their practice.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　如是善藏恩，　　仁和心柔軟；",
        "translation": "Such is the kindness of the treasury of benevolence, With a benevolent and gentle mind.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　篤信佛功德，　　觀察眾生元。",
        "translation": "They earnestly believe in the virtues of buddhas, Observing the origins of sentient beings.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　緣行入愍哀，　　興發於大慈；",
        "translation": "Conditioned by practice, they enter into compassion and give rise to great compassion.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　吾當護養育，　　欲安立黎庶。",
        "translation": "I will protect and nourish them, wanting to establish the common people.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以是故布施，　　若干種可惠；",
        "translation": "Because of this, giving is Of various kinds that are to be appreciated.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　國土城邑聚，　　眾寶及象馬。",
        "translation": "The land, cities, treasures, elephants, and horses are assembled there.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　頭目及手足，　　并以己身肉；",
        "translation": "Their hair, eyes, hands, feet, And the flesh of their own bodies.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　一切普能施，　　不可懷怯弱。",
        "translation": "Being able to give all, they shouldn't harbor timidity.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　志慕眾經典，　　不以為患厭；",
        "translation": "They cherish the scriptures And do not think of them as afflictions.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　曉了世經籍，　　隨俗而勸化。",
        "translation": "Knowing the scriptures and books of worldly scriptures, he follows the customs and encourages their teaching.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　其智超三世，　　懷慚志堅強；",
        "translation": "Their knowledge transcends the past, present, and future, And their awareness of shamelessness is firm.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　供養無等雙，　　奉敬諸長者。",
        "translation": "Their offerings are peerless, honoring the elders.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　眾聖行如是，　　夙夜勤不廢；",
        "translation": "The practice of the holy ones is like this, They work hard day and night without slackening.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　熾盛諸功德，　　猶火中之金。",
        "translation": "The blazing virtues are like the gold in a fire.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　彼勤精行此，　　菩薩十住地；",
        "translation": "These are the ten bodhisattva stages of enlightening beings’ ten abodes.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　慕于無為業，　　而化諸有為。",
        "translation": "They crave unconditioned actions And lead and inspire the conditioned.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　猶如有導師，　　愍傷大眾賈；",
        "translation": "It is just as if a guiding teacher hurts the masses of merchants.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　豫問安隱路，　　故在前指示。",
        "translation": "I'll ask about the peaceful path, so I'll show it in front of you.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　菩薩亦如是，　　初發第一住；",
        "translation": "So it is with enlightening beings, Who have set out for the first abode.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　稍進至十住，　　成致無礙道。",
        "translation": "They gradually advance to the ten abodes And attain the unobstructed path.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　以能住此義，　　究暢執功勳；",
        "translation": "By being able to abide in this doctrine, They will extensively cling to merit.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　慈心不懷害，　　以法而教眾。",
        "translation": "Their compassionate minds don't harbor harm, and they teach the Dharma to sentient beings.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　在天下知時，　　開化咸將護；",
        "translation": "Knowing the time in the realm under heaven, They will enlighten and protect all.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　立眾令布施，　　使樂佛聖慧。",
        "translation": "He establishes the congregation and causes them to give alms, so that they'll enjoy the Buddha's noble wisdom.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　至聖發意頃，　　棄國捐王舍；",
        "translation": "When the supreme sage had this thought, He abandoned his kingdom and renounced the royal residence.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　入于佛法教，　　出行修精進。",
        "translation": "Entering into the Buddha’s teaching of truth, They travel and practice diligently.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　尋逮得三昧，　　見佛無數千；",
        "translation": "Having attained concentration, He saw innumerable thousands of buddhas.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　感動諸佛國，　　覩光往聽經。",
        "translation": "Impressed by the buddha lands, Vaiśravaṇa went to listen to the sūtras.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　淨化無數眾，　　使入道法門；",
        "translation": "Purifying and transforming countless sentient beings, They cause them to enter the teaching of enlightenment.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　遊於百千劫，　　隨時現其身。",
        "translation": "They traveled for a hundred thousand eons, Showing their bodies at any time.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　諸最勝本業，　　覺寤眾睡眠；",
        "translation": "The most excellent original actions Awaken the tormented and drowsy beings.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　如過去諸佛，　　覺寤眾懵懵。",
        "translation": "Like the buddhas of the past, they awakened all the ignorant and confused.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　是為第一住，　　最勝所宣布；",
        "translation": "This is the first abode, proclaimed by the Supreme One.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "　普愍傷世間，　　無上諸菩薩。」",
        "translation": "They universally pity the world, the unsurpassed bodhisattvas.",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "於是金剛藏菩薩大士，思惟察是菩薩住義之所歸矣，即時頌曰：諸菩薩等，",
        "translation": "Then the great bodhisattva Vajragarbha thought to himself, “This is indeed the true refuge of the bodhisattva Vimalakīrti.” Immediately he composed the following verse:",
        "source": "T10n0285_001:0464b17_34"
    },
    {
        "source_sentence": "咸有聞此無上道業，慕樂尊行，心抱悅豫，忻然安隱，自從坐起，迎逆稽首，",
        "translation": "All the monks and nuns who had heard of this practice of the supreme path, yearned for it, cherished a sense of joy in their hearts, and were delighted to see it. They stood up from their seats at ease, greeted the Master with veneration, and bowed their heads in reverence.",
        "source": "T10n0285_001:0465b26_35"
    },
    {
        "source_sentence": "踊在虛空，散眾天華，口宣妙言。",
        "translation": "They rushed up into the sky, scattered heavenly flowers, and uttered subtle words.",
        "source": "T10n0285_001:0465b28_0"
    },
    {
        "source_sentence": "歎曰：「善哉金剛藏！",
        "translation": "He praised him, saying, Good, Vajragarbha!",
        "source": "T10n0285_001:0465b28_1"
    },
    {
        "source_sentence": "聖猛無所畏，曉了道住，行菩薩法，眾會悅豫，聞解脫元，唯諮上道第二之住，",
        "translation": "He was noble, fearless, and well versed in the path of enlightenment. He practiced the way of enlightening beings and carried out the deeds of enlightening beings. All the assemblies were joyful when he heard that the source of liberation was only the second abode of the supreme Way.",
        "source": "T10n0285_001:0465b29_2"
    },
    {
        "source_sentence": "其行云何？",
        "translation": "What's their practice?",
        "source": "T10n0285_001:0465c01_3"
    },
    {
        "source_sentence": "當所思奉，大智唯宣，聞者坦然，進至無極，開化眾生。」",
        "translation": "Whatever they contemplate and venerate, the great wisdom is only proclaimed, and those who hear it are at ease, advancing without limit to enlighten sentient beings.",
        "source": "T10n0285_001:0465c02_4"
    },
    {
        "source_sentence": "◎◎漸備一切智德經離垢住品第二金剛藏報：「諸佛子！",
        "translation": "The second chapter of the gradual preparation of the Sutra of All Virtues of Wisdom, the Undefiled Abode Chapter, is the second adamantine reward from the Vajra Treasury, saying:",
        "source": "T10n0285_001:0465c03_5"
    },
    {
        "source_sentence": "是菩薩大士，以了初發第一住竟，爾乃好樂第二住矣，意性懷篤，奉修十事。",
        "translation": "When this bodhisattva-mahāsattva understands the first abode of arousal, then he's delighted with the second abode, harboring ten things in his mind to cultivate.",
        "source": "T10n0285_001:0465c05_6"
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are these ten?",
        "source": "T10n0285_001:0465c07_7"
    },
    {
        "source_sentence": "一曰、志性柔和，而無麁獷；",
        "translation": "The first is that their aspiration is gentle and peaceful, without harshness or roughness.",
        "source": "T10n0285_001:0465c07_8"
    },
    {
        "source_sentence": "二曰、修正真業，無有邪思；",
        "translation": "The second is that they cultivate true action and have no wrong thoughts.",
        "source": "T10n0285_001:0465c08_9"
    },
    {
        "source_sentence": "三曰、其行質直，永無諛諂；",
        "translation": "The third is that their conduct is honest and straightforward, never bragging or flattering.",
        "source": "T10n0285_001:0465c08_10"
    },
    {
        "source_sentence": "四曰、心懷調仁，不為瞋恨；",
        "translation": "The fourth is that they harbor kindness in their hearts and do not become angry or hostile.",
        "source": "T10n0285_001:0465c09_11"
    },
    {
        "source_sentence": "五曰、其行寂然，未曾憒亂；",
        "translation": "The fifth is that their conduct is peaceful and they never waver in confusion.",
        "source": "T10n0285_001:0465c09_12"
    },
    {
        "source_sentence": "六曰、意抱至真，不為虛偽；",
        "translation": "The sixth is that one’s mind embraces the ultimate truth and is not false.",
        "source": "T10n0285_001:0465c10_13"
    },
    {
        "source_sentence": "七曰、其行方幅，無有雜碎；",
        "translation": "The seventh is that their movements are square and wide, without any discrepancies.",
        "source": "T10n0285_001:0465c11_14"
    },
    {
        "source_sentence": "八曰、進止坦然，無所貪慕；",
        "translation": "The eighth was that they proceeded and remained calm, not longing for anything.",
        "source": "T10n0285_001:0465c11_15"
    },
    {
        "source_sentence": "九曰、行在微妙，不為下劣；",
        "translation": "The ninth is that their practice is subtle and not inferior.",
        "source": "T10n0285_001:0465c12_16"
    },
    {
        "source_sentence": "十曰、其意寬弘，未曾迫迮；",
        "translation": "The tenth was that his ideas were broad and far-reaching, never opposing oppression or criticism.",
        "source": "T10n0285_001:0465c12_17"
    },
    {
        "source_sentence": "是為十事。",
        "translation": "These are the ten things.",
        "source": "T10n0285_001:0465c13_18"
    },
    {
        "source_sentence": "菩薩意性懷篤，具成初住，至第二住。」",
        "translation": "The bodhisattva's mind is intent, and he accomplishes the first abode up to the second abode.",
        "source": "T10n0285_001:0465c13_19"
    },
    {
        "source_sentence": "金剛藏曰：「又諸佛子！",
        "translation": "The Vajragarbha said, Also, children of the Buddha!",
        "source": "T10n0285_001:0465c14_20"
    },
    {
        "source_sentence": "菩薩已住第二離垢之地，離于殺生，不執刀杖，心懷慚愧，愍哀群生，",
        "translation": "“Then the enlightening beings, having dwelled in the second stage of freedom from defilement, abstain from killing living beings and do not carry swords or sticks. They feel shame and pity for all living beings.",
        "source": "T10n0285_001:0465c15_21"
    },
    {
        "source_sentence": "常抱慈心，欲濟眾生，無有思想，心不念殺，不求人便，不危他人，捨身之安而解眾患，",
        "translation": "They always cherish compassion and wish to save sentient beings. They have no thoughts of killing, do not seek advantage, do not harm others, relinquish their physical well-being, and are freed from all afflictions.",
        "source": "T10n0285_001:0465c16_22"
    },
    {
        "source_sentence": "無有二心，況復犯乎？",
        "translation": "There are no two minds, so why would there be a violation?",
        "source": "T10n0285_001:0465c18_23"
    },
    {
        "source_sentence": "又不盜竊，心常好施不貪他財，己財止足不數多求，覩他所有萬物生業財寶之利，",
        "translation": "They don’t steal or steal; their minds are always generous and they don’t covet other people’s property. Their own wealth is sufficient and they don’t repeatedly seek more. Deceiving all things possessed by others produces the benefits of karma, possessions, and treasures.",
        "source": "T10n0285_001:0465c19_24"
    },
    {
        "source_sentence": "不生嫉心，眾人迎逆莫不戴敬，草葉毛米未曾默取，念廣布施救濟諸乏，",
        "translation": "They did not become jealous, and all the people greeted them with reverence. Their grass, leaves, hair, and rice were never collected in silence. They thought of giving generously to rescue those in need.",
        "source": "T10n0285_001:0465c20_25"
    },
    {
        "source_sentence": "割身所供惠眾窮困，蜎飛蠕動蚑行喘息，隨其水陸皆欲令安不遇眾患。",
        "translation": "They cut off their bodies to help the many who are in distress, fly and wriggle, walk and pant, and want to make them comfortable on land and water so they won't experience any difficulties.",
        "source": "T10n0285_001:0465c22_26"
    },
    {
        "source_sentence": "又捨愛欲邪婬之行，不欲重習，自於妻室而知止足，未曾興心慕樂他妻，",
        "translation": "They also give up sexual desire and engage in immoral sexual behavior. They do not wish to indulge in it again and again. They are content with their own wives and children, never longing for another’s wife.",
        "source": "T10n0285_001:0465c24_27"
    },
    {
        "source_sentence": "心不思想不干他室，奉清白行不為穢濁，如母、如姊、如妹、如女無異，",
        "translation": "Their minds aren’t thoughtful, don’t stick to others’ houses, and are pure in conduct. They act like mothers, sisters, brothers, sisters, or daughters, without any difference.",
        "source": "T10n0285_001:0465c25_28"
    },
    {
        "source_sentence": "清淨鮮明而無沾污，無有二心況犯色耶？",
        "translation": "It's pure and clear, yet undefiled, and there are no two minds, so why wouldn't it be possible to violate form?",
        "source": "T10n0285_001:0466a02_29"
    },
    {
        "source_sentence": "又不妄語，不樂虛言，所宣至誠，言辭真正，所傳順理，言不失時，不竊妄語，",
        "translation": "They neither speak falsehoods, nor delight in speaking falsehoods. The words they utter are spoken with utmost sincerity and genuine words conveyed according to reason.",
        "source": "T10n0285_001:0466a03_30"
    },
    {
        "source_sentence": "至於夢中，不演非法，況晝日乎？",
        "translation": "As for the dream, it doesn't explain what's unlawful, so why wouldn't it be daytime?",
        "source": "T10n0285_001:0466a05_31"
    },
    {
        "source_sentence": "不為色教，況心念耶？",
        "translation": "It's not for the teaching of form, so why wouldn't it be for mindfulness?",
        "source": "T10n0285_001:0466a05_32"
    },
    {
        "source_sentence": "常說正法佛之經典，不出俗辭無益之業。",
        "translation": "He always taught the scriptures of the true teachings of the buddhas, not engaging in useless activities that don't follow worldly language.",
        "source": "T10n0285_001:0466a06_33"
    },
    {
        "source_sentence": "又離兩舌，不傳彼此鬪亂於人，不誤兩盲，未徹視者，使諍不和，不侵犯人，",
        "translation": "They are free of duplicitous speech, do not tell others to fight or disturb one another; they are not blinded by the two blindnesses. Those who have not yet thoroughly examined [the Buddha’s teachings] will be unable to reconcile with each other and won’t inflict injury on others.",
        "source": "T10n0285_001:0466a07_34"
    },
    {
        "source_sentence": "彼間惡言不傳至此，此間惡言不宣到彼，和解諍訟使無怨望，修德為法令無罪殃，",
        "translation": "Their bad words don't reach here, and their bad words don't proclaim them here; they resolve disputes and disputes so that there's no enmity or resentment, cultivate virtue for the sake of enlightenment, and order blamelessness.",
        "source": "T10n0285_001:0466a09_0"
    },
    {
        "source_sentence": "講論經道各有篇章。",
        "translation": "Each of the treatises, sūtras, and paths have chapters.",
        "source": "T10n0285_001:0466a10_1"
    },
    {
        "source_sentence": "又不罵詈，不演麁辭，不宣惡言，不傷人心，世人所說，口演不仁，惱於他人，",
        "translation": "Nor does he revile, nor speak harsh words, nor utter slanderous words, nor offend others. Whatever the people of the world say is unkind to them and inflicts injury on others.",
        "source": "T10n0285_001:0466a11_2"
    },
    {
        "source_sentence": "不微中人，無所恐畏，常行仁和，不興瞋恨害心向人，不使眾人意懷湯火愁慼之患，",
        "translation": "They are not inferior to the middle people and have no fear. They always practice kindness and harmlessness, directing their thoughts toward others without anger or hatred. They do not cause the minds of other people to think of them as the danger of being burned by the fire of sorrow.",
        "source": "T10n0285_001:0466a13_3"
    },
    {
        "source_sentence": "口所布言可一切心，柔軟慈和聞者安隱，心中愛樂，喜欲見之，多所悅豫，",
        "translation": "The words he uttered in his mouth were agreeable to all minds, gentle and compassionate, peaceful to the hearers, pleasing to their hearts, glad to see them, and full of delight in them.",
        "source": "T10n0285_001:0466a14_4"
    },
    {
        "source_sentence": "遠近思覩，乃傳此言，久思其言，無厭其辭。",
        "translation": "People from near and far heard these words of the Master’s utterances, but they did not tire of listening to them.",
        "source": "T10n0285_001:0466a16_5"
    },
    {
        "source_sentence": "又不綺語，離于飾辭，言無所犯，未曾傳語，常護身口，終不戲言，而取誤教，",
        "translation": "They never speak falsehoods, always guarding their bodies and speech. They do not engage in idle talk but instead follow the principles of righteousness.",
        "source": "T10n0285_001:0466a17_6"
    },
    {
        "source_sentence": "況復由利，有獲財寶貢上歸遺，而宣虛乎？",
        "translation": "How could it be that someone who obtains wealth and treasure by paying a tribute to the above-mentioned relics will proclaim what's false?",
        "source": "T10n0285_001:0466a19_7"
    },
    {
        "source_sentence": "雖身溺死，不演非義，身口相應，言行相副，不失神明不違佛教。",
        "translation": "Even though his body is submerged in death, he doesn't explain what's not the meaning, and his body and speech are associated with each other, speaking and acting together, so he doesn't lose his divine insight and doesn't contradict Buddhism.",
        "source": "T10n0285_001:0466a20_8"
    },
    {
        "source_sentence": "又不嫉妬不抱貪餐，未曾興心慕求眾欲，他人財業，高德貴性，不發癡心，",
        "translation": "They are not jealous or greedy, do not embrace food and drink, never arouse their minds to indulge in sensual desires. They are not attached to the property of others, have high virtue and noble characteristics, and do not give rise to thoughts of delusion.",
        "source": "T10n0285_001:0466a21_9"
    },
    {
        "source_sentence": "貪利無義，見人多有豪貴至尊，不以為嫉，心存道義，猶魚依水，不捨正真。",
        "translation": "Their craving for profit has no meaning, and when they see that many people are powerful and highly regarded, they don't become jealous, retaining the meaning of the path in their minds like a fish relying on water without abandoning the true truth.",
        "source": "T10n0285_001:0466a23_10"
    },
    {
        "source_sentence": "又無瞋恨，心常懷慈，愍哀之心，調和之心，安隱之心，柔軟之心，其心常念欲濟一切，",
        "translation": "Their minds are always compassionate, sympathetic, harmonious, peaceful, and gentle. They have no anger or hatred; their minds are always compassionate with kindness.",
        "source": "T10n0285_001:0466a25_11"
    },
    {
        "source_sentence": "而將護之。",
        "translation": "He's about to protect them.",
        "source": "T10n0285_001:0466a27_12"
    },
    {
        "source_sentence": "假使其心，發瞋恚者，若有患厭，不能自制，眾垢危害，心中惱熱，尋除其根，",
        "translation": "Suppose someone causes their mind to become angry, and if they have any trouble or displeasure, they can’t control it on their own. All kinds of defilements harm them, and their minds are tormented and feverish, removing their faculties.",
        "source": "T10n0285_001:0466a27_13"
    },
    {
        "source_sentence": "令不熾盛，抱以仁和，慈心弘坦，如畏蚖蛇，毒獸之聚，惡心便休，成斯仁和。",
        "translation": "He causes them not to become enthusiastic, embraces them with kindness and harmony, and his compassionate mind is so vast that they're like the fear of a snake or a cluster of poisonous animals that stops bad thoughts.",
        "source": "T10n0285_001:0466a29_14"
    },
    {
        "source_sentence": "又棄邪見，奉于正見，不墮外學，捨于貪事虛偽之術，吉良之日，不擇時節，",
        "translation": "They also abandon wrong views and follow right views. They do not fall into the ways of non-Buddhist learning. They give up greed, hypocrisy, and false speech. On auspicious and auspicious days they do not discriminate time or season.",
        "source": "T10n0285_001:0466b01_15"
    },
    {
        "source_sentence": "不思國位，若覩帝主，不以為貴，不懷諛諂，表裏相應心性仁和，奉佛法眾不失三寶，",
        "translation": "They do not think of the throne or sovereignty of their countries; they are not attached to deceitfulness or flattery. Their minds, whether conjoined with front or behind them, are benevolent and harmonious. They serve the buddhas and the Dharma without losing the Three Treasures.",
        "source": "T10n0285_001:0466b03_16"
    },
    {
        "source_sentence": "愍哀三界皆欲度脫，是為十善。",
        "translation": "These are the ten good qualities of being compassionate and wanting to liberate all in the three realms.",
        "source": "T10n0285_001:0466b05_17"
    },
    {
        "source_sentence": "常當守護此十善德，心行如是，思惟奉行；",
        "translation": "They should always guard these ten kinds of virtue, mentally carry them out in such a way that they are reflected upon and practiced.",
        "source": "T10n0285_001:0466b06_18"
    },
    {
        "source_sentence": "若見眾生犯諸惡業，當歸惡趣，以十善事而開化之。",
        "translation": "If they see sentient beings commit bad actions, they'll return to a bad destiny and enlighten them with ten good deeds.",
        "source": "T10n0285_001:0466b07_19"
    },
    {
        "source_sentence": "「又其學士，已立正見，奉行至真，亦勸眾人入于至真。",
        "translation": "Again, the śramaṇas and brāhmaṇas who have established right view and practiced it with utmost sincerity should also encourage others to enter the utmost sincerity.",
        "source": "T10n0285_001:0466b08_20"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0285_001:0466b09_21"
    },
    {
        "source_sentence": "其自己身不能修德，欲化他人立道德者，未之有也。",
        "translation": "That person themselves can't cultivate virtue, and someone who wants to teach others to establish morality doesn't exist.",
        "source": "T10n0285_001:0466b09_22"
    },
    {
        "source_sentence": "彼選擇念，奉行十善，不歸三惡地獄、餓鬼、畜生之處；",
        "translation": "Because of their discriminating thoughts, they practiced the ten good deeds and did not return to the realms of the three evil hells, hungry ghosts, or animals.",
        "source": "T10n0285_001:0466b11_23"
    },
    {
        "source_sentence": "其十善行得生人間，及生天上三十三天；",
        "translation": "These ten good deeds enable one to be reborn in the human world, as well as in the thirty-three heavens above us.",
        "source": "T10n0285_001:0466b12_24"
    },
    {
        "source_sentence": "又能奉行此十善者，成大智慧，思惟其義，畏于三界，興發大哀，不為毀損，",
        "translation": "“Furthermore, those who practice these ten kinds of goodness attain great wisdom and contemplate their meaning. Fearing that they will be reborn in the three realms, they feel great compassion and do not disparage them.",
        "source": "T10n0285_001:0466b13_25"
    },
    {
        "source_sentence": "從他人聞，所宣音聲，得成聲聞。",
        "translation": "If someone hears the sound proclaimed by others, they'll become a śrāvaka.",
        "source": "T10n0285_001:0466b14_26"
    },
    {
        "source_sentence": "自然中間，修清淨志，不欲仰人，不從他受，自欲意解，求成正覺；",
        "translation": "They naturally cultivate pure aspirations, not wishing to be held in high esteem by others or accepted from others. Understanding their own inclinations and thoughts, they seek to attain enlightenment.",
        "source": "T10n0285_001:0466b15_27"
    },
    {
        "source_sentence": "好立大哀，不以損耗，志入深要，思十二因，不了無根，得緣覺業。",
        "translation": "They are fond of expressing great compassion and don’t harm others. They aspire to enter deeply into the profound principles, reflecting on the twelve kinds of causal conditions; they do not understand the absence of faculties [of sentient beings] and thus attain the karma of pratyekabuddhahood.",
        "source": "T10n0285_001:0466b17_28"
    },
    {
        "source_sentence": "其心寬弘，最極無上不可限量，愍傷眾生，執權方便，堅立弘誓無極法鎧，",
        "translation": "Their minds are broad and magnanimous, supremely unexcelled and unlimited. They have compassion for sentient beings; they cling to expedient means of liberation. They firmly establish the infinite armor of truth as their great vow.",
        "source": "T10n0285_001:0466b18_29"
    },
    {
        "source_sentence": "坦然無迹，欲救一切眾生之類，不捨三界，得成佛慧無礙道原。",
        "translation": "They are tranquil and without traces, wanting to save all sentient beings, they don't abandon the three realms and attain the unobstructed path of becoming buddhas and wisdom.",
        "source": "T10n0285_001:0466b20_30"
    },
    {
        "source_sentence": "菩薩所行清淨道地，成無窮業，習轉最上，眾宜究竟，至逮十力，乃致佛法，",
        "translation": "The pure path of enlightenment practiced by enlightening beings is the sphere of endless action, with the highest degree of accumulation and development. It is appropriate for all to perfect it, so that they may acquire the ten powers in order to attain buddhahood.",
        "source": "T10n0285_001:0466b21_31"
    },
    {
        "source_sentence": "十八不共吾等聞之，故當志學。",
        "translation": "Eighteen aren't shared with us when we hear them, so we should aspire to study them.",
        "source": "T10n0285_001:0466b23_32"
    },
    {
        "source_sentence": "一切學已，勤修精進，彼益深觀其此十惡不善章句，甚為招致地獄緣報，",
        "translation": "Having studied them all, they diligently practice and make effort. More and more profoundly observing these ten evil and unwholesome chapters and verses, they are drawn to the retribution of being conditioned by hell.",
        "source": "T10n0285_001:0466b23_33"
    },
    {
        "source_sentence": "中殃畜生，微釁餓鬼；",
        "translation": "In the midst of this calamity there are animals and hungry ghosts with slight disadvantages.",
        "source": "T10n0285_001:0466b25_34"
    },
    {
        "source_sentence": "是故我等若殺生者，歸於地獄、畜生、餓鬼，設生人間，有二惡報。",
        "translation": "Therefore, if we kill people, we'll return to hell, animals, or hungry ghosts, and there will be two bad consequences if we were to be born in the human world.",
        "source": "T10n0285_001:0466b26_35"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466b27_36"
    },
    {
        "source_sentence": "所生之處，其壽常短，又多疾痛，而中夭逝，家室憂慼，莫不感哀。",
        "translation": "Their life spans at the places where they are born are always short, and they often suffer from illness and death in the midst of illness. All the members of their families are grieved and saddened; none of them feel sorrow.",
        "source": "T10n0285_001:0466b27_37"
    },
    {
        "source_sentence": "若喜竊取，亦歸三惡苦，若生人間，亦有二報。",
        "translation": "If someone likes to steal, they'll also return to the three bad and painful forms of suffering, and if they're born among humans, there are two rewards.",
        "source": "T10n0285_001:0466b29_38"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466c01_39"
    },
    {
        "source_sentence": "乏少財業；",
        "translation": "They lack the means of livelihood because they have few possessions.",
        "source": "T10n0285_001:0466c01_40"
    },
    {
        "source_sentence": "怨賊劫取，亡無多少，令人憂惱。",
        "translation": "The enemies and thieves plundered it but few of them died, causing grief and distress.",
        "source": "T10n0285_001:0466c01_41"
    },
    {
        "source_sentence": "犯他人妻室，亦歸三惡，復有二報：眷屬不貞，數共鬪諍。",
        "translation": "If someone violates another's wife's house, they also return to the three bad consequences. Again, there are two other consequences: their family members are unfaithful and often fight together.",
        "source": "T10n0285_001:0466c02_42"
    },
    {
        "source_sentence": "憙妄語者，歸於三苦，有二惡報。",
        "translation": "Someone who speaks harshly and falsely returns to the three kinds of suffering, which have two bad consequences.",
        "source": "T10n0285_001:0466c03_43"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466c04_44"
    },
    {
        "source_sentence": "人多誹謗，言不見用。",
        "translation": "People often denigrate it, saying that they don't see its use.",
        "source": "T10n0285_001:0466c04_45"
    },
    {
        "source_sentence": "其兩舌者，亦歸三苦，復有二報：眷屬離散，生下賤子，共為伴黨。",
        "translation": "Those who speak divisively also fall into three kinds of painful rebirth. Again, there are two consequences:",
        "source": "T10n0285_001:0466c05_46"
    },
    {
        "source_sentence": "其惡口者，亦歸三苦，復有二報。",
        "translation": "That bad speech also returns to the three kinds of suffering, and there are two other rewards.",
        "source": "T10n0285_001:0466c06_47"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466c07_48"
    },
    {
        "source_sentence": "聞不可聲，罵詈之音。",
        "translation": "I heard the sound of unacceptable abuse and the sound of scolding.",
        "source": "T10n0285_001:0466c07_49"
    },
    {
        "source_sentence": "其綺語者，亦歸三苦，復有二報。",
        "translation": "That fancy talk also returns to the three kinds of suffering, which have two other rewards.",
        "source": "T10n0285_001:0466c08_50"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466c09_0"
    },
    {
        "source_sentence": "熱惱他人，所在至湊，不能自決。",
        "translation": "They burn others, and they can't decide where they are when they go to the harbor.",
        "source": "T10n0285_001:0466c09_1"
    },
    {
        "source_sentence": "其貪餐者，亦歸三苦，復有二報：少於產業，又多疾病。",
        "translation": "Those who covet food also return to the three kinds of suffering. Again, there are two other consequences: less than what they produce and much sickness.",
        "source": "T10n0285_001:0466c10_0"
    },
    {
        "source_sentence": "其懷嫉妬，亦歸三苦，復有二報。",
        "translation": "They harbor jealousy and also return to the three kinds of suffering. Again, there are two results.",
        "source": "T10n0285_001:0466c11_1"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466c11_2"
    },
    {
        "source_sentence": "若在人間，墮于邪見，不知止足。",
        "translation": "If they are among the people, they'll fall into wrong views and won't know how to stop.",
        "source": "T10n0285_001:0466c12_3"
    },
    {
        "source_sentence": "起于瞋恚，亦歸三苦，復有二報。",
        "translation": "Anger arisen from hatred also belongs to the three forms of unsatisfactoriness. Again, there are two results:",
        "source": "T10n0285_001:0466c12_4"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466c13_5"
    },
    {
        "source_sentence": "自危己身，而惱他人。",
        "translation": "They danger themselves and harm others.",
        "source": "T10n0285_001:0466c13_6"
    },
    {
        "source_sentence": "其邪見者，亦歸三苦，若生人間，復有二報。",
        "translation": "A person with wrong view also returns to the three kinds of suffering, and if he's born among humans, there are two other rewards.",
        "source": "T10n0285_001:0466c14_7"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T10n0285_001:0466c15_8"
    },
    {
        "source_sentence": "沒在邪見六十二非憙，行諛諂如是多患，因致苦陰，由以合成不善根本。",
        "translation": "They are found in the sixty-two forms of wrong views and no wickedness. Being deceitful and hypocritical, they have such many misfortunes as these. The aggregate of suffering is their cause:",
        "source": "T10n0285_001:0466c15_9"
    },
    {
        "source_sentence": "「假使能棄此十惡者，能以道法，自樂伏意，以棄十惡，建立十善，亦能勸他，",
        "translation": "“Suppose someone were to abandon these ten evils and could, through the path of enlightenment, delight in themselves and subdue their thoughts. In order to abandon the ten evils and establish the ten wholesome [teachings], they would also be able to encourage others.",
        "source": "T10n0285_001:0466c17_10"
    },
    {
        "source_sentence": "令住十善。",
        "translation": "He causes them to abide in the ten good qualities.",
        "source": "T10n0285_001:0466c18_11"
    },
    {
        "source_sentence": "彼加大仁，愍哀眾生，心懷弘坦慈心愍心，調和之心，廣布恩心，散擁護心，",
        "translation": "They have great kindness, pitying sentient beings; their minds are broad and peaceful, compassionate and sympathetic, harmonious and harmonious, generous and generous, scattered and protective.",
        "source": "T10n0285_001:0466c19_12"
    },
    {
        "source_sentence": "是我之心，奉師之心，敬如世尊。",
        "translation": "This is my mind, which honors the teacher and venerates him as the Bhagavān.",
        "source": "T10n0285_001:0466c20_13"
    },
    {
        "source_sentence": "心自念曰：『一切眾生，邪見所縛，心意顛倒，志念反逆，發起虛行，",
        "translation": "They think to themselves, “All sentient beings are bound by wrong views.",
        "source": "T10n0285_001:0466c21_14"
    },
    {
        "source_sentence": "吾當盡立，令住真實，修於正真，言行相應，而安立之。",
        "translation": "I will establish them all, so that they may abide in reality and cultivate what is true. They are established by words and deeds concomitant with reality.",
        "source": "T10n0285_001:0466c22_15"
    },
    {
        "source_sentence": "眾生一切，破壞諍訟，轉相誹謗，常抱瞋恚，轉相投禍；",
        "translation": "All sentient beings destroy disputes and controversies, accusing each other. They always harbor anger and in turn cast misfortune upon each other.",
        "source": "T10n0285_001:0466c24_16"
    },
    {
        "source_sentence": "吾等當設無上大哀無極之慈，立堅固行，令無彼此。",
        "translation": "We should establish the unexcelled, great compassionate, and infinitely compassionate love that is firm in our practices so that there will be no one else.",
        "source": "T10n0285_001:0466c25_17"
    },
    {
        "source_sentence": "眾生不厭結縛之難，嫉他人業，造反邪行，不順道本；",
        "translation": "Sentient beings are not disgusted with the difficulties of the fetters, jealous of the actions of others, committing evil deeds contrary to them, and not following the foundations of the path.",
        "source": "T10n0285_001:0466c26_18"
    },
    {
        "source_sentence": "吾等令淨身，亦淨口、心。",
        "translation": "We make our bodies pure, and we also purify our mouths and minds.",
        "source": "T10n0285_001:0466c27_19"
    },
    {
        "source_sentence": "眾生心迷，建立罪福，習婬怒癡，為三蓋礙，墮在塵網，常自投己不便之地；",
        "translation": "Sentient beings are deluded in their minds, establishing blameworthiness and blameworthiness. Accumulated with lust, hatred, and delusion, they are hindered by the three kinds of hindrances, falling into a web of dust and constantly throwing themselves into an uncomfortable place.",
        "source": "T10n0285_001:0466c28_20"
    },
    {
        "source_sentence": "當求堅固，善權方便，消寂一切眾勞之患，令立無難。",
        "translation": "They should seek to be resolute, skillful in expedient means, and extinguish all the afflictions of all kinds of troubles so that they won't have difficulty standing.",
        "source": "T10n0285_001:0467a01_0"
    },
    {
        "source_sentence": "眾生在于愚癡之厄，無明所縛，住在六冥，遠於大智，遊闇昧門，行窈弊業；",
        "translation": "Sentient beings are in the misfortune of ignorance, bound by ignorance. They dwell in the six darknesses, far removed from great knowledge, traveling through the door of darkness to do evil deeds.",
        "source": "T10n0285_001:0467a02_1"
    },
    {
        "source_sentence": "吾等當為開化嚴治，無所罣礙，清淨慧眼，使一切法，輒如所言，由得自在，",
        "translation": "For the sake of enlightenment we should purify and adorn ourselves, without any obstruction or obstacle. With pure eyes of wisdom we will cause all things to be just as they have been taught through attaining mastery.",
        "source": "T10n0285_001:0467a03_2"
    },
    {
        "source_sentence": "不戴仰人。",
        "translation": "They don't venerate people.",
        "source": "T10n0285_001:0467a05_3"
    },
    {
        "source_sentence": "眾生墮在生死困患地獄、畜生、餓鬼苦門，漂在邪見六十二疑，羅網所縵，",
        "translation": "Sentient beings will fall into the realms of birth, death, hell, animals, and hungry ghosts. They will float in the sixty-two doubts that arise from wrong views and are tethered by webs of doubt.",
        "source": "T10n0285_001:0467a05_4"
    },
    {
        "source_sentence": "愚癡所蔽，邪徑所迷，遊盲瘂路，不親聖師，無有救護，有所歸趣，無解脫業，",
        "translation": "They are hindered by ignorance and delusion, lost by wrong paths, traveling blindly in the dark roads, not associating with holy teachers, lacking protection, having no destination of refuge, and lacking acts of liberation.",
        "source": "T10n0285_001:0467a07_5"
    },
    {
        "source_sentence": "為賊所劫，魔鬼在心，遠離佛心；",
        "translation": "They were plundered by thieves; the devil was in their minds, far removed from the Buddha’s mind.",
        "source": "T10n0285_001:0467a09_6"
    },
    {
        "source_sentence": "吾當將養，度生死原曠野懸路，立之無難，前在無畏一切智城。",
        "translation": "I am about to cross the wilderness of the realm of birth and death, where there is no difficulty in setting up a monastery.",
        "source": "T10n0285_001:0467a09_7"
    },
    {
        "source_sentence": "眾生墮在大林盛火欲處色處無色之處，浮泅三淵，為生死流，所見漂沒，",
        "translation": "Sentient beings fall into the great forest, where there’s a lot of craving. The realm of form is in the realm of formlessness; floating up and down in the three deep oceans, they are submerged by the current of birth-and-death.",
        "source": "T10n0285_001:0467a11_8"
    },
    {
        "source_sentence": "隨恩愛江，大患所攝，強在愚癡，心念貪婬，志思危害，欲行賊役，而計有身，",
        "translation": "They follow the river of kindness and affection, which is subject to great dangers. They are obsessed with folly and delusion, thoughts of greed and anger in their minds; they want to do harmful deeds, wishing to be a slave of thieves, yet they think there is a body.",
        "source": "T10n0285_001:0467a13_9"
    },
    {
        "source_sentence": "猶海水岸，婬鬼所迷，隨放逸走，慕入嗜欲，住己自大，各懷異心，未度想度，",
        "translation": "It’s like the shore of water on the seacoast, lost to ghosts and hungry ghosts. They run around in heedlessness, indulging in desires and indulging in pleasures. Abiding in their own conceit, they each harbor a different ideation but not yet liberated themselves from it.",
        "source": "T10n0285_001:0467a14_10"
    },
    {
        "source_sentence": "或諸衰入，而為震動，遠眾德本；",
        "translation": "Or they may be shaken by the entrance of decay, yet they are far removed from the roots of virtue.",
        "source": "T10n0285_001:0467a16_11"
    },
    {
        "source_sentence": "吾等當化，修大德本，道力拔救，令在滅度，使離恐懼眾危之厄，因建立之於一切智。",
        "translation": "We will be transformed and cultivate the root of great virtue. With the power of the path, we will rescue those who have been saved so that they may abide in nirvana, free themselves from fear and all dangers, and thus establish them in omniscience.",
        "source": "T10n0285_001:0467a17_12"
    },
    {
        "source_sentence": "眾生悉為貪樂所縛，無數苦痛，愁慼之惱，多所志慕，憎愛所結，合會別離，",
        "translation": "Sentient beings are all bound by greed and pleasure, suffering countless pains and distress, grief and sorrow, much longing for what they want, clinging to what they dislike, coming together and leaving behind.",
        "source": "T10n0285_001:0467a19_13"
    },
    {
        "source_sentence": "而相戀嫪，無明所蔽，受在三界；",
        "translation": "They are attached to each other, being hindered by ignorance; feeling is found in the three realms.",
        "source": "T10n0285_001:0467a20_14"
    },
    {
        "source_sentence": "吾等當開示其正路，至無罣礙，脫三界難，令立滅度無為之道。",
        "translation": "We will show them the right path leading to unobstructed liberation, freed from the difficulties of the three worlds, and enabling them to establish the path of cessation and nonproductivity.",
        "source": "T10n0285_001:0467a21_15"
    },
    {
        "source_sentence": "眾生悉為猗見吾我，五陰諸入，不可轉移，處四顛倒，依六衰舍，為諸惡賊，",
        "translation": "Sentient beings all see self for the sake of peace, and the five aggregates and sense-fields can't be moved. They are in the four errors, relying on the six houses of decay to become bad thieves.",
        "source": "T10n0285_001:0467a23_16"
    },
    {
        "source_sentence": "所見攻擊，遭無量苦；",
        "translation": "Those who saw the attack suffered immeasurable pain.",
        "source": "T10n0285_001:0467a24_17"
    },
    {
        "source_sentence": "吾等當化，除諸患厄，一切陰蓋，使至無為。",
        "translation": "We will be transformed, rid of all the afflictions and hindrances, all the aggregates that obscure us, and cause us to reach nonexistence.",
        "source": "T10n0285_001:0467a25_18"
    },
    {
        "source_sentence": "眾生志存下劣之業，乏於尊慧一切智心，無天人道，志在恐畏生死之難，",
        "translation": "Sentient beings aspire to inferior actions, lacking the mind of honorable wisdom and omniscience, lack the path of gods and humans, and aspire to fear the difficulties of birth and death.",
        "source": "T10n0285_001:0467a26_19"
    },
    {
        "source_sentence": "樂聲聞、緣覺；",
        "translation": "They delight in śrāvakas and pratyekabuddhas.",
        "source": "T10n0285_001:0467a28_20"
    },
    {
        "source_sentence": "吾等當化，使立微妙廣大之心，是為佛子菩薩所入。』",
        "translation": "We will be transformed and made to establish a subtle and vast mind, which is what the Buddha-child bodhisattva enters.'",
        "source": "T10n0285_001:0467a28_21"
    },
    {
        "source_sentence": "「如此戒力，勸化貧匱，常抱慈愍，以權方便，立於菩薩離垢道地，因得覩見無央數億百千姟佛，",
        "translation": "Because of the power of these precepts, he was encouraged to transform the poor and always embraced compassion. Through expedient means he established the bodhisattva in the stage of the undefiled path, and by this he gained unremitting insight into immeasurable hundreds of millions of buddha-figures.",
        "source": "T10n0285_001:0467a29_22"
    },
    {
        "source_sentence": "供養衣被，飲食、床臥具、病瘦醫藥，一切施安身命，自歸如來、至真、平等正覺，",
        "translation": "They give food, drink, bedding, shelter, medicine for the ill, and peace of mind to those suffering from hunger and thirst. They take their refuge in the Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T10n0285_001:0467b02_23"
    },
    {
        "source_sentence": "受是至清，十善奉行，雖受行之，無所違失，於無央數億百千姟兆載劫中，",
        "translation": "Accepting this ultimate purity, they adhere to the ten kinds of goodness. Even if they accept and practice it, there is nothing contradictory or disadvantageous. For an infinite number of eons, hundreds of millions of myriads of koṭis of trillions of kalpas, they will never fail to do so.",
        "source": "T10n0285_001:0467b04_24"
    },
    {
        "source_sentence": "所受身形，亦若干劫，不懷貪嫉犯戒垢濁無益之業；",
        "translation": "For a certain number of kalpas the bodies and forms they receive do not harbor greed, jealousy, immorality, defilement, or useless actions.",
        "source": "T10n0285_001:0467b06_0"
    },
    {
        "source_sentence": "好憙布施，奉持淨戒，猶如有人適生墮地，端正姝好，尋而洗之，清淨無垢。",
        "translation": "They are fond of generosity and observe pure precepts, just like a person who is born and falls to the ground at the right time. Their appearance is good-looking and beautiful, so they search for it and wash it cleanly, without dirt or stain.",
        "source": "T10n0285_001:0467b07_1"
    },
    {
        "source_sentence": "菩薩如是，在此開士離垢之地，於無央數億百千姟兆載劫中，所受身形，",
        "translation": "“Thus did the enlightening beings receive their bodies and forms for countless eons in this pure land of enlightenment:",
        "source": "T10n0285_001:0467b08_2"
    },
    {
        "source_sentence": "不懷貪嫉犯戒垢濁無益之業；",
        "translation": "They do not harbor greed, jealousy, immorality, and the defilement of unbeneficial actions.",
        "source": "T10n0285_001:0467b10_3"
    },
    {
        "source_sentence": "行於四恩，惠施仁愛，利人等利，救濟合聚眾生，拔眾危厄，十度無極，",
        "translation": "He practices the four kinds of benevolence, giving generously and kindly, benefiting others equally, rescuing living beings who are united together, removing their dangers and distress, and transcending the ten perfections without limit.",
        "source": "T10n0285_001:0467b11_4"
    },
    {
        "source_sentence": "勤修精進，戒度無極，悉為具足不使乏少。",
        "translation": "They diligently practice and make effort. Their observance of the precepts is unexcelled, fully endowed without lacking anything.",
        "source": "T10n0285_001:0467b12_5"
    },
    {
        "source_sentence": "「又族姓子！",
        "translation": "Also, clansmen!",
        "source": "T10n0285_001:0467b13_6"
    },
    {
        "source_sentence": "菩薩已能奉此初第一住，有第二住，名曰離垢。",
        "translation": "After the bodhisattva can serve this first abode, there's a second abode called freedom from defilement.",
        "source": "T10n0285_001:0467b13_7"
    },
    {
        "source_sentence": "菩薩住是，為轉輪王，治以正法，然有七寶，假使眾生，退在犯戒十惡之業，",
        "translation": "The bodhisattva abiding in this is the wheel-turning king who governs with the right teaching, but there are seven treasures that if sentient beings were to regress from the ten bad actions of violating precepts,",
        "source": "T10n0285_001:0467b15_0"
    },
    {
        "source_sentence": "以權方便，而勸立之；",
        "translation": "He encouraged them to establish it by expedient means.",
        "source": "T10n0285_001:0467b16_1"
    },
    {
        "source_sentence": "令行十善，若興福施，惠施於人，仁愛之德，有所饒益，等利之義，一切不捨，",
        "translation": "He causes them to perform the ten kinds of good deeds, and if they produce meritorious gifts he bestows on others with kindness, kindness, virtue, benefit, and equanimity, he doesn’t abandon them all.",
        "source": "T10n0285_001:0467b17_2"
    },
    {
        "source_sentence": "常心念佛，惟慕正法，志在徒黨，菩薩之業，開士之行，六度無極，十住之源，",
        "translation": "They are always mindful of the Buddha, yearning for the right teaching. They aspire to unremitting adherence and rely on their followers. The deeds of enlightening beings they undertake in bodhisattvas; the practices of scholars they initiate. The infinity of the six transcendent ways is the source of the ten foundations of enlightenment.",
        "source": "T10n0285_001:0467b18_3"
    },
    {
        "source_sentence": "思念十力，四無所畏，十八不共，諸佛之法，眾行普備。",
        "translation": "He contemplates the ten powers, four fearlessnesses, 18 unique qualities, and the buddha-teachings, which are universally endowed with all practices.",
        "source": "T10n0285_001:0467b20_4"
    },
    {
        "source_sentence": "念一切智：『以何方便，勸化眾生，令逮至尊，為最為上，為勝為超，",
        "translation": "He thought to omniscience, ‘What method can I use to encourage sentient beings so that they will attain supreme enlightenment, which is the highest and most transcendent?",
        "source": "T10n0285_001:0467b21_5"
    },
    {
        "source_sentence": "至於無上，為眾導師，勸化一切，養育將護，至一切智？』",
        "translation": "As for the unsurpassed, is he a guide to all and encourages all, nurturing and protecting them until they reach omniscience?'",
        "source": "T10n0285_001:0467b23_6"
    },
    {
        "source_sentence": "發意之頃，捐棄家業愛欲黑冥，順如來教，出為沙門，普行精進，須臾逮致百千三昧，",
        "translation": "At the moment of arousal of mind, he abandoned his family business and craving for darkness and darkness, complied with the Tathāgata’s instructions, renounced worldly life, and became a śramaṇa. He exerted himself energetically in all ways to attain one hundred thousand samādhis in a single instant.",
        "source": "T10n0285_001:0467b24_7"
    },
    {
        "source_sentence": "見無量佛。",
        "translation": "They see measureless buddhas.",
        "source": "T10n0285_001:0467b26_8"
    },
    {
        "source_sentence": "適見諸佛，建立道誼，動百千國，願生其國，越無限界，嚴治清淨無數世界，",
        "translation": "Seeing the buddhas, they established the spirit of enlightenment and moved hundreds of thousands of lands. Wishing to be born in those lands, they crossed an infinite number of realms and purified countless worlds.",
        "source": "T10n0285_001:0467b26_9"
    },
    {
        "source_sentence": "開化度脫無量眾生，入不可限識本宿命，所歷劫數，選擇志求不可稱載道法諸門，",
        "translation": "Countless sentient beings were enlightened, liberated, and liberated. They entered into the innumerable eons of past lives by which they remembered the untold paths of enlightenment.",
        "source": "T10n0285_001:0467b28_10"
    },
    {
        "source_sentence": "覩見十方眾生形像，觀無限量諸菩薩會，從學志願，攝取菩薩殊特弘誓，",
        "translation": "They see the forms of sentient beings in the ten directions, observe the boundless assemblies of enlightening beings, follow the learning and aspiration of enlightening beings, and embrace the special great vows of enlightening beings.",
        "source": "T10n0285_001:0467c01_11"
    },
    {
        "source_sentence": "億百千垓兆載劫數，莫能稱焉。」",
        "translation": "There are billions, hundreds of millions, billions, and trillions of eons that can't be counted.",
        "source": "T10n0285_001:0467c02_12"
    },
    {
        "source_sentence": "「此等心質朴，　　修治己意性；",
        "translation": "These minds are simple and simple, Cultivating their own essence of thought.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　其志已真實，　　柔順而調和。",
        "translation": "Their aspiration is true, And they are gentle and harmonious.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　已捨諸習貪，　　慕求最上道；",
        "translation": "Having abandoned all habits and cravings, They long for the supreme path.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　其行極弘大，　　輒在第二業。",
        "translation": "Their practice is so great that it's easy to be in the second karma.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　執德住於斯，　　積累眾德本；",
        "translation": "They cling to virtue and abide in it, Accumulating the roots of virtue.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　遠離於殺生，　　心未曾懷害。",
        "translation": "He's far removed from killing people, and his mind has never harbored harm.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　離於慳嫉行，　　不犯他妻室；",
        "translation": "Being free of stinginess and jealousy, they won’t violate another’s wife.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　至誠不兩舌，　　不惡口綺語。",
        "translation": "They are sincere, not divisive, And they refrain from harsh words or fancy speech.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　已消恚貪行，　　常修大慈愍；",
        "translation": "Having eliminated covetousness and greed, They always cultivate great compassion.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　入于正見業，　　無諂行質朴。",
        "translation": "Entering right views and actions, they practice without flattery or simplicity.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　無愛捨自大，　　作性粗舉要；",
        "translation": "The absence of craving and indifference is self-exalted, the essentials are grossly summarized in terms of their nature.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　將護世尊教，　　常行無放逸。",
        "translation": "They will protect the teachings of the Bhagavān and always practice without laziness.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　地獄之苦痛，　　畜生亦如是；",
        "translation": "The pain and suffering of hell is like this for the animals.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　佛教興光曜，　　常以消餓鬼。",
        "translation": "Buddhism flourishes with a shining luster, and it always extinguishes hungry ghosts.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　棄捨一切惡，　　不善之心意；",
        "translation": "They abandon all evil, Bad thoughts and bad intentions.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　滅除眾為害，　　志大至誠法。",
        "translation": "To exterminate all sentient beings is harmful, and I aspire to the great principle of sincerity.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　自謹勅其意，　　所生轉善處；",
        "translation": "With self-respect, I ordered them to think Of the good places Wherever they were born.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　至三十三天，　　寂然永安隱。",
        "translation": "Up to the thirty-three heavens, they'll be tranquil and eternally peaceful.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　猶如緣覺乘，　　聲聞及正覺；",
        "translation": "It is just like the vehicle of the pratyekabuddhas, Listeners and enlightened ones.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　皆由此十事，　　從清白句生。",
        "translation": "They all arise from these ten things, which are pure and white phrases.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　見此常當觀，　　恒修無放逸；",
        "translation": "Seeing these constants, they should always observe them, Always cultivating nonfrivolity.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　意堅立禁戒，　　亦復勸化人。",
        "translation": "He firmly establishes the precepts with his mind and also encourages people to be converted.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　益加增愍哀，　　志性日弘慈；",
        "translation": "Increasing in compassion and pity, Their determination day by day spreads kindness.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　觀苦惱眾生，　　興發心傷念。",
        "translation": "Observing suffering and distressed sentient beings, they give rise to thoughts of grief.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　皆墮諸邪見，　　斯由意不寤；",
        "translation": "They all fall into wrong views Because their minds are not angry.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　瞋恚懷毒害，　　心喜抱鬪諍。",
        "translation": "Their anger harbors poison and harm, and their minds like to embrace fighting.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　常不厭眷屬，　　勤約慕境界；",
        "translation": "They always don’t tire of their followers, And diligently concentrate on the sphere of craving.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　吾當度脫之，　　令濟此三厄。",
        "translation": "I will liberate them And free them from these three troubles.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　造立大闇冥，　　其性樂愚癡；",
        "translation": "They create great darkness, Their nature bliss and folly.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　墮在奸惡路，　　遊於諸見網。",
        "translation": "They'll fall into the path of wickedness and wander through the web of views.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　周旋在生死，　　當行方便度；",
        "translation": "To circumambulate in birth and death, They should practice liberation by skillful means.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　濟脫諸六情，　　立正解五陰。",
        "translation": "To rescue the six emotions, he establishes the five aggregates of right understanding.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　消除眾塵勞，　　越于四使瀆；",
        "translation": "Removing all the worldly afflictions, transcending the four defilements, I will become a buddha.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　滅盡三界苦，　　然熾之惱患。",
        "translation": "He extinguishes the suffering of the three realms, yet he's blazing with affliction.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　永離諸貪身，　　世力吾我想；",
        "translation": "Being permanently free of the body of craving, worldly power is self and self-conception.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　吾以此等故，　　苦行欲度脫。",
        "translation": "Because of these, I practiced asceticism and wanted to be liberated.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　遊心尊最勝，　　無上佛之慧；",
        "translation": "The most distinguished wandering mind is the supreme, Unsurpassed Buddha’s wisdom.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　導御修至誠，　　棄捐劣愵心。",
        "translation": "He guides and cultivates utmost sincerity, abandoning the mind of weakness and wickedness.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　立志於寬弘，　　諸如來道慧；",
        "translation": "They set their minds on vast expansion, the path and wisdom of the enlightened ones.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　勤精進無量，　　堅固得佛道。",
        "translation": "Their exertion is immeasurable, And they firmly attain the path of buddhahood.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　住此寂功勳，　　積累眾德本；",
        "translation": "Abiding in the merit of this quiescence, They accumulate the roots of virtue.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　見無數諸佛，　　咸悉供養之。",
        "translation": "Seeing innumerable buddhas, They all pay their respects to them.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　斯等解清白，　　見億百千劫；",
        "translation": "Their understanding is pure and white, And they see it for billions of eons.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　其身無罣礙，　　心口亦如是。",
        "translation": "Their bodies are unobstructed, So are their minds and mouths.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　諸佛子住此，　　應時轉法輪；",
        "translation": "Children of Buddha, when you abide here, You should turn the wheel of teaching at the right time.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　開化立眾生，　　使行十善業。",
        "translation": "Enlightenment establishes sentient beings and causes them to perform the ten good actions.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　一切所積累，　　清淨之行本；",
        "translation": "All that they accumulate Is the root of pure practice.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　齊護於眾生，　　斯富十種力。",
        "translation": "To protect sentient beings equally, they're endowed with ten kinds of power.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　因時發意項，　　棄國捐財業；",
        "translation": "At that time the king had aroused the intention To abandon his state and give up all his wealth.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　佛所作沙門，　　修入勇猛行。",
        "translation": "The śramaṇas created by the Buddha Cultivate enter and practice with boldness.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　已通大精進，　　致尊三昧定；",
        "translation": "Having thoroughly mastered great effort, He has attained the absorption of supreme concentration.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　見無數諸佛，　　應時如佛界。",
        "translation": "Seeing countless buddhas, they should be like the Buddha realm at the right time.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　以是若干變，　　及與不可計；",
        "translation": "Because of these various transformations, And the incalculable as well.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　輒覩其境界，　　各在斯道住。",
        "translation": "They often see their objective realms, Each abiding in this path.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　已能住此願，　　致最微妙慧；",
        "translation": "Having been able to abide in this vow, They attain the most subtle wisdom.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　造若干變化，　　開化於眾生。",
        "translation": "He creates various transformations to enlighten sentient beings.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　是為第二住，　　大聖之所宣；",
        "translation": "This is the second abode proclaimed by the Great Sage.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "　普愍世群黎，　　眾菩薩最上。」",
        "translation": "It's the best among all the people in the world, and the bodhisattvas are the best.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "時金剛藏菩薩大士，演此住已，尋則頌曰：已得聞是最始上法菩薩第二境，",
        "translation": "The great bodhisattva Vajragarbha, having discoursed thus on this abode, looked around and said in verse, “I have heard that this is the second sphere of enlightenment of the beginner bodhisattva Mahāprajñāpāramitā.",
        "source": "T10n0285_001:0467c03_13"
    },
    {
        "source_sentence": "不可思議，至真無異；",
        "translation": "They are inconceivable, no different from the ultimate truth.",
        "source": "T10n0285_001:0468b05_14"
    },
    {
        "source_sentence": "諸佛子等喜，而修恭敬，住於虛空，則雨天華，各宣：「善哉！",
        "translation": "The heirs of the Buddha were equally delighted, cultivated respect, and stood in space, raining heavenly flowers, each proclaiming, Good!",
        "source": "T10n0285_001:0468b06_15"
    },
    {
        "source_sentence": "德如山王，而分布說禁戒之源，心念愍哀一切群黎，唯演尊妙第三行本，",
        "translation": "His virtue was as great as that of a king of mountains, yet he taught the source of the code of precepts. With compassion and pity for all living beings, he taught only the third book of the practice of enlightening beings:",
        "source": "T10n0285_001:0468b07_16"
    },
    {
        "source_sentence": "所說至誠永無有異；",
        "translation": "Whatever they teach is spoken with utmost sincerity, never different.",
        "source": "T10n0285_001:0468b09_17"
    },
    {
        "source_sentence": "眾菩薩行最為無上，普欲令世一切安隱，以願稱講，第一雅妙，益當供順，",
        "translation": "The practice of all enlightening beings is supreme and unsurpassed. Wishing to cause all worlds to be at ease, they praise their practice with the vow:",
        "source": "T10n0285_001:0468b09_18"
    },
    {
        "source_sentence": "天人所敬。",
        "translation": "They're respected by gods and humans.",
        "source": "T10n0285_001:0468b11_19"
    },
    {
        "source_sentence": "第二離垢菩薩尊住，除其愛欲精進造立，建大法慧，如之所為，行布施事，",
        "translation": "The second is the abode of the venerable bodhisattva Undefiled, who removes craving and exertes effort to create it, establishes great wisdom in regard to the teachings, and thus does his work by practicing generosity.",
        "source": "T10n0285_001:0468b11_20"
    },
    {
        "source_sentence": "惠施禁戒，成為大聖；",
        "translation": "He bestowed the precepts on them and became a great sage.",
        "source": "T10n0285_001:0468b13_21"
    },
    {
        "source_sentence": "忍辱精進，一心寂然，善修智慧，慈心殊勝，愍哀行道，眾祐宣布清淨之行譬如月明，",
        "translation": "Their patience and zeal are unified, their minds concentrated in tranquility. They skillfully cultivate knowledge and wisdom; their compassionate minds are superior. They practice the path of pity and sympathy. All blessed ones proclaim that pure practice is like the moon shining brightly.",
        "source": "T10n0285_001:0468b13_22"
    },
    {
        "source_sentence": "金剛藏踊演第三住，心樂善說莫不欣然，咸發道意。」",
        "translation": "The third abode of the Vajragarbha is aroused, and none of them are delighted with good speech or rejoice when they give rise to the intention for enlightenment.",
        "source": "T10n0285_001:0468b15_23"
    },
    {
        "source_sentence": "◎漸備經卷第一",
        "translation": "*Zenbi jing, vol. 1",
        "source": "T10n0285_001:0468b17_24"
    }
]