[
    {
        "source_sentence": "佛說十地經卷第三",
        "translation": "Foshuo shidi jing, vol. 3",
        "source": "T10n0287_003:0545a02_0"
    },
    {
        "source_sentence": "大唐于闐三藏沙門尸羅達摩",
        "translation": "Śīlabhadradharma, the great Tang monk of the Tripiṭaka of Udyāna",
        "source": "T10n0287_003:0545a04_0"
    },
    {
        "source_sentence": "於北庭龍興寺譯",
        "translation": "translated at Yongxing Temple in the northern court",
        "source": "T10n0287_003:0545a05_0"
    },
    {
        "source_sentence": "菩薩發光地第三",
        "translation": "Third, the third stage of the bodhisattva's arousal of light",
        "source": "T10n0287_003:0545a06_0"
    },
    {
        "source_sentence": "　佛子聞此地行已，　　菩薩境界難思議；",
        "translation": "After hearing about the practice of this land, The sphere of enlightening beings is inconceivable.",
        "source": "T10n0287_003:0545a07_0"
    },
    {
        "source_sentence": "　靡不恭敬心歡喜，　　散花空中為供養。",
        "translation": "They all venerate and rejoice, Scattering flowers in the sky to make offerings.",
        "source": "T10n0287_003:0545a08_0"
    },
    {
        "source_sentence": "　讚言：「善哉！大仙主！　　慈心愍念諸有情；",
        "translation": "They praised him, saying, “O Great Sage!",
        "source": "T10n0287_003:0545a09_0"
    },
    {
        "source_sentence": "　善說智者律儀法，　　第二地中之行相。",
        "translation": "The wise one who speaks well explains the rules of restraint, which are the defining activities in the second ground.",
        "source": "T10n0287_003:0545a10_0"
    },
    {
        "source_sentence": "　是諸菩薩微妙行，　　真實無異無差別；",
        "translation": "These are the subtle practices of enlightening beings, True and real, without difference or distinction.",
        "source": "T10n0287_003:0545a11_0"
    },
    {
        "source_sentence": "　為欲利益諸群生，　　如是演說最清淨。",
        "translation": "In order to benefit all sentient beings, he explains the most pure teaching in this way.",
        "source": "T10n0287_003:0545a12_0"
    },
    {
        "source_sentence": "　一切天人供養者，　　願為演說第三地；",
        "translation": "To all the gods and humans who make offerings to them, may they teach the third stage.",
        "source": "T10n0287_003:0545a13_0"
    },
    {
        "source_sentence": "　與法相應諸智業，　　如其境界為具闡。",
        "translation": "The knowledges and actions associated with the teachings are explained in terms of their objects.",
        "source": "T10n0287_003:0545a14_0"
    },
    {
        "source_sentence": "　大仙所有施、淨戒，　　安忍、精進、靜慮、慧，",
        "translation": "The great sage possesses generosity, pure morality, patience, effort, meditation, and wisdom.",
        "source": "T10n0287_003:0545a15_0"
    },
    {
        "source_sentence": "　及以方便慈悲道，　　佛清淨道願皆說。」",
        "translation": "And the path of skillful means, compassion, and the pure path vows of the Buddha are all explained.",
        "source": "T10n0287_003:0545a16_0"
    },
    {
        "source_sentence": "　時解脫月復請言：　　「無畏大師金剛藏！",
        "translation": "The moon of liberation then again asked, Fearless Great Master Vajragarbha!",
        "source": "T10n0287_003:0545a17_0"
    },
    {
        "source_sentence": "　願說趣入第三地，　　柔和心者之功德。」",
        "translation": "May I explain the merit of someone who enters the third ground and has a gentle mind.",
        "source": "T10n0287_003:0545a18_0"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩告眾菩薩言：「唯諸佛子！",
        "translation": "It was then that the Vajragarbha Bodhisattva addressed the other bodhisattvas, saying, Only, heirs of the Buddha!",
        "source": "T10n0287_003:0545a19_0"
    },
    {
        "source_sentence": "若是菩薩，第二地中增上意樂善清淨已，欲入菩薩第三地者，當以十種心之意樂作意而入。",
        "translation": "Suppose this is a bodhisattva who wants to enter the third ground of the bodhisattva's second ground with ten kinds of mental intent and contemplation after his superior intentions are well purified in the second ground.",
        "source": "T10n0287_003:0545a19_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0287_003:0545a22_2"
    },
    {
        "source_sentence": "所謂：以清淨心意樂作意，以安住心意樂作意，以厭離心意樂作意，以離欲心意樂作意，",
        "translation": "That is to say, by contemplation of pure mental attitudes, by contemplation of peaceful mental attitudes, by contemplation of dispassionate mental attitudes, by contemplation of detached mental attitudes, by contemplation of nonattachment mental attitudes.",
        "source": "T10n0287_003:0545a22_3"
    },
    {
        "source_sentence": "以不退心意樂作意，以堅固心意樂作意，以熾然心意樂作意，以勇健心意樂作意，",
        "translation": "“Great enlightening beings practice dedication based on the aspiration of nonregressing mind, the aspiration of firm mind, the aspiration of blazing mind, and the aspiration of courageous mind.",
        "source": "T10n0287_003:0545a24_4"
    },
    {
        "source_sentence": "以勝妙心意樂作意，以廣大心意樂作意，菩薩以是十心意樂作意，證入第三地中。",
        "translation": "With these ten kinds of mental focus, the bodhisattva realizes entering the third ground with these ten kinds of mental focus.",
        "source": "T10n0287_003:0545a26_5"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_003:0545a28_6"
    },
    {
        "source_sentence": "菩薩住此第三地時，觀察一切諸有為行，皆見無常、有苦、不淨、不可依怙，",
        "translation": "“When enlightening beings in the third stage contemplate all conditioned things, they see impermanence, suffering, impurity, and non-dependency.",
        "source": "T10n0287_003:0545a28_7"
    },
    {
        "source_sentence": "終皆敗壞、不得久住，剎那生滅、前際不來、後際不去、現在不住。",
        "translation": "They all eventually disintegrate and can't be long-abiding, arise and cease momentarily, don't come at the prior end, don't go at the latter end, and don't abide in the present.",
        "source": "T10n0287_003:0545b01_8"
    },
    {
        "source_sentence": "菩薩如是無倒觀察一切行時，復觀見身無有救者、無所依怙，與憂、與歎、與惱相應，",
        "translation": "“When enlightening beings thus unerringly contemplate all conditioned things, they also observe that the body has no savior and no basis; it is accompanied by sorrow, by lamentation, and by vexation.",
        "source": "T10n0287_003:0545b02_9"
    },
    {
        "source_sentence": "愛憎所繫多苦愁惱，無有停積。",
        "translation": "Being tethered by craving and hatred, there's much pain and sorrow, and there's no cessation of accumulation.",
        "source": "T10n0287_003:0545b04_10"
    },
    {
        "source_sentence": "以貪、恚、癡猛火熾然共眾病長，見如是已，從一切行令心勝進趣如來智印。",
        "translation": "Because the ferocious fire of greed, anger, and delusion are blazing together with the longevity of their illnesses, they see this as the sign of the Tathāgata's wisdom that causes the mind to advance from all actions.",
        "source": "T10n0287_003:0545b05_11"
    },
    {
        "source_sentence": "此菩薩見如來智不可思議，無等、無量、難得、無雜、無災、無惱，至無畏城不復退還，",
        "translation": "Seeing that the knowledge of Buddha was inconceivable, unsurpassed, immeasurable, difficult to attain, unadulterated, without confusion, without calamity, and without affliction, these enlightening beings reached the city of fearlessness and did not turn back.",
        "source": "T10n0287_003:0545b06_12"
    },
    {
        "source_sentence": "能救無量諸苦有情。",
        "translation": "He's able to save measureless suffering sentient beings.",
        "source": "T10n0287_003:0545b08_13"
    },
    {
        "source_sentence": "菩薩如是見如來智無量利益、見一切行無量災患，則此轉更於有情所，",
        "translation": "“Thus do enlightening beings see the infinite benefits of buddha-knowledge and the infinite dangers of all conditioned things.",
        "source": "T10n0287_003:0545b09_14"
    },
    {
        "source_sentence": "發起十種心之意樂。",
        "translation": "They give rise to ten kinds of mental aspirations.",
        "source": "T10n0287_003:0545b10_15"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0287_003:0545b11_16"
    },
    {
        "source_sentence": "所謂：孤獨無依心之意樂，常恒貧窮心之意樂，以貪、恚、癡猛火熾然心之意樂，",
        "translation": "They are the mental attitude of wanting to be alone, not relying on anything, the mental attitude of always being poor, and the mental attitude of blazing with the fires of greed, hatred, and delusion.",
        "source": "T10n0287_003:0545b11_17"
    },
    {
        "source_sentence": "於有牢獄之所禁閉心之意樂，常無間斷以諸煩惱稠林所覆心之意樂，不能觀察心之意樂，",
        "translation": "They are constantly and uninterruptedly oppressed by the mental attitudes of those imprisoned in hell. Because they are hindered by the mental attitudes of the dense forest of afflictions, they cannot contemplate their mental attitudes.",
        "source": "T10n0287_003:0545b13_18"
    },
    {
        "source_sentence": "無善法欲心之意樂，迷失佛法心之意樂，隨生死流心之意樂，失解脫道心之意樂，",
        "translation": "They lack the mental attitude of desire for good qualities, the mental attitude of delusion in regard to the Buddha-dharma, the mental attitude of following the stream of birth and death, and the mental attitude of losing the path of liberation.",
        "source": "T10n0287_003:0545b15_19"
    },
    {
        "source_sentence": "發此十種心之意樂。",
        "translation": "They give rise to these ten kinds of mental aspirations.",
        "source": "T10n0287_003:0545b17_20"
    },
    {
        "source_sentence": "菩薩如是見有情界眾災患已，發大精進作是念言：『此諸有情，我應救濟應令解脫，",
        "translation": "“Furthermore, when great enlightening beings see all the calamities of sentient beings in this way, they undertake great effort and think, ‘I should save and liberate these sentient beings.",
        "source": "T10n0287_003:0545b17_21"
    },
    {
        "source_sentence": "應令清淨、應當拔出、應令趣入、應令安住、應令歡喜、應令愛樂、應令調伏、應令寂滅。』",
        "translation": "You should make them pure, remove them, cause them to enter, make them abide, make them rejoice, make them love and delight, subdue them, and extinguish them.'",
        "source": "T10n0287_003:0545b19_22"
    },
    {
        "source_sentence": "菩薩如是於彼諸行深心厭離，於諸有情興悲戀心，於佛妙智見大勝利，",
        "translation": "“Thus do enlightening beings become deeply disillusioned with these practices, develop compassion toward sentient beings, and see great benefits in the Buddha’s knowledge.",
        "source": "T10n0287_003:0545b21_23"
    },
    {
        "source_sentence": "以如來智為所依止；",
        "translation": "The knowledge of the enlightened is their support.",
        "source": "T10n0287_003:0545b23_24"
    },
    {
        "source_sentence": "為救有情勤修加行，作是思惟：『此諸有情墮在眾苦煩惱雜染，以何等道而能拔濟，",
        "translation": "In order to save sentient beings they diligently practice and think, ‘Those sentient beings who have fallen into the various afflictions of suffering—what path can they use to rescue them?",
        "source": "T10n0287_003:0545b23_25"
    },
    {
        "source_sentence": "令住究竟常樂涅槃？』",
        "translation": "Will it cause them to abide in the ultimate eternal bliss of nirvāṇa?'",
        "source": "T10n0287_003:0545b25_26"
    },
    {
        "source_sentence": "即此菩薩便作是念：『此皆不離以無障礙智解脫處；",
        "translation": "“Then the enlightening being Universally Good thought:",
        "source": "T10n0287_003:0545b25_27"
    },
    {
        "source_sentence": "此無障礙智解脫，不離一切法如實覺；",
        "translation": "This liberation of unhindered knowledge is not separate from all things as they really are.",
        "source": "T10n0287_003:0545b27_28"
    },
    {
        "source_sentence": "此一切法如實覺悟，不離無行無生行慧；",
        "translation": "These all things are truly enlightened, not apart from the knowledge of unmanifesting and nonoriginating patterns.",
        "source": "T10n0287_003:0545b27_29"
    },
    {
        "source_sentence": "此慧光明，不離靜慮善巧決擇妙慧觀察；",
        "translation": "This light of knowledge is not separate from the contemplation of skillful means and subtle wisdom in meditation.",
        "source": "T10n0287_003:0545b28_30"
    },
    {
        "source_sentence": "復此靜慮善巧決擇妙慧觀察，皆不離於多聞善巧。』",
        "translation": "Furthermore, this meditation skillfully discerns and observes with subtle wisdom that's not separate from well-versed skillfulness.'",
        "source": "T10n0287_003:0545b29_31"
    },
    {
        "source_sentence": "菩薩以是善觀察智，專為訪求正法而行，日夜慕法聞法無厭，玩法、樂法、依法、靡法、住法、須法、怙法、歸法、法隨、法行。",
        "translation": "Because of this well-observed knowledge, the bodhisattva focuses his practice on seeking the right teaching, yearning for the teaching day and night to hear it without tire, playing, delighting in the teaching, following the teaching, disdaining the teaching, abiding in the teaching, needing the teaching, relying on the teaching, returning to the teaching, following the teaching, and practic",
        "source": "T10n0287_003:0545c01_32"
    },
    {
        "source_sentence": "菩薩如是為求佛法修正行時，無有少物或資生具，或財穀倉庫而不能捨，",
        "translation": "“Thus, when enlightening beings seek the buddha-teachings and practice them correctly, they have no small things or necessities or storehouses of goods to give away.",
        "source": "T10n0287_003:0545c04_33"
    },
    {
        "source_sentence": "於此終無難作之想，唯於說法補特伽羅生難遭想；",
        "translation": "In the end there is no idea that it is difficult to do, but only the idea that it is difficult to encounter in expounding the truth of the doctrine.",
        "source": "T10n0287_003:0545c06_34"
    },
    {
        "source_sentence": "為佛法故無有少分執受外物而不能捨，無少內物而不能捨，無有師長不誓承事，",
        "translation": "For the sake of the buddha-dharma, there is no external object that they cannot abandon through partial attachment. There is no internal object that they cannot abandon through partial attachment. There is no teacher or elder who does not undertake to serve them.",
        "source": "T10n0287_003:0545c07_35"
    },
    {
        "source_sentence": "除慢、過慢，下意受行，無有身苦而不誓受。",
        "translation": "Being free of conceit and overweening conceit, he feels and acts with a lower mind and doesn't undertake to experience physical pain without taking it.",
        "source": "T10n0287_003:0545c09_36"
    },
    {
        "source_sentence": "若聞佛法一四句頌歡喜踊躍，勝得三千大千世界充滿其中大珍寶聚。",
        "translation": "If someone hears the Buddha's teaching in a single or four-line verse and rejoices and jumps, they'll surpass 3,000 great one-thousand worlds filled with a great heap of treasure.",
        "source": "T10n0287_003:0545c10_37"
    },
    {
        "source_sentence": "若聞一頌善說正法，歡喜勝得轉輪王位。",
        "translation": "If someone hears a verse that well explains the right teaching, they'll rejoice and attain the position of wheel-turning king.",
        "source": "T10n0287_003:0545c11_38"
    },
    {
        "source_sentence": "聞未聞法是佛所說，能引正等覺、能淨菩薩行歡喜踊躍，勝得一切釋梵王等，",
        "translation": "Those who hear the teachings they haven’t heard are taught by the Buddha. They can lead to perfect enlightenment and purify the practice of enlightening beings, rejoicing and leaping for joy, surpassing all the buddhas and brahma kings.",
        "source": "T10n0287_003:0545c12_39"
    },
    {
        "source_sentence": "住百千劫極尊貴位。",
        "translation": "He'll abide for a hundred thousand eons in the most noble position.",
        "source": "T10n0287_003:0545c14_40"
    },
    {
        "source_sentence": "設有告言：『我有一句佛所說法，能引正等覺、能淨菩薩行，汝今若能投極熾然大焰火坑受劇苦者，",
        "translation": "Even if someone were to tell you, “I have a phrase of the Dharma taught by the Buddha that can lead to enlightenment and purify the practices of enlightening beings,",
        "source": "T10n0287_003:0545c15_0"
    },
    {
        "source_sentence": "當為汝說。』",
        "translation": "I will explain it for you.'",
        "source": "T10n0287_003:0545c17_1"
    },
    {
        "source_sentence": "菩薩聞已作是念言：『我為一句佛所說法，能引等正覺、能淨菩薩行，",
        "translation": "Having heard these words, the bodhisattva thought: ’I preach a single phrase of the Dharma taught by the Buddha that can lead to enlightenment and purify the practices of enlightening beings.",
        "source": "T10n0287_003:0545c17_2"
    },
    {
        "source_sentence": "正使火坑量等三千大千世界，滿中熾火，我從梵天尚投身入，況小火坑。",
        "translation": "It's precisely because the size of the fire pit is equal to 3,000 great one-thousand worlds, and it's filled with a blazing fire, so I still throw myself into it from Brahmā Heaven, much less into a small fire pit.",
        "source": "T10n0287_003:0545c19_0"
    },
    {
        "source_sentence": "又復我等為求佛法，尚應久處大捺落迦諸險惡趣受大苦惱，況於人中諸餘小苦而不能受。』",
        "translation": "Furthermore, for the sake of seeking the Buddha's teaching, we should still have spent a long time in great naraka and other dangerous and bad destinies to experience great suffering and distress, so why wouldn't we experience the other minor pains among humans?'",
        "source": "T10n0287_003:0545c20_1"
    },
    {
        "source_sentence": "菩薩發起如是精進求正法已，如其所聞而能如理內審觀察。",
        "translation": "After a bodhisattva arouses such effort to seek the right teaching, he can examine it internally according to what he hears and observe it according to principle.",
        "source": "T10n0287_003:0545c22_2"
    },
    {
        "source_sentence": "聞正法已，獨居靜處心自決了作是思惟：『以正修行法隨法行，方得名為隨順佛法，",
        "translation": "Having heard the true teaching, they dwelled alone in a secluded place. They thought to themselves with certainty: Only by correctly practicing the doctrine and following it do they receive the name of followers of the Buddha-dharma.",
        "source": "T10n0287_003:0545c24_3"
    },
    {
        "source_sentence": "非但純以語業演說而得清淨。』",
        "translation": "It's not just purely explained in words and actions that attain purity.'",
        "source": "T10n0287_003:0545c26_4"
    },
    {
        "source_sentence": "菩薩住是發光地時，為欲修行法隨法行，離欲離諸惡不善法，有尋有伺，",
        "translation": "When the bodhisattva abides in this stage of arousing light, he wants to cultivate the Dharma and practice it according to the Dharma. Being free of desire and free of bad and unwholesome states, he has both discursive thought and discursive examination.",
        "source": "T10n0287_003:0545c26_5"
    },
    {
        "source_sentence": "離生喜樂，入初靜慮具足安住。",
        "translation": "Being free of the joy and happiness that arises, he enters the first concentration and fully abides there.",
        "source": "T10n0287_003:0545c28_6"
    },
    {
        "source_sentence": "尋伺寂靜內等淨故一心趣故，無尋無伺定生喜樂，入第二靜慮具足安住。",
        "translation": "Because the tranquility of discursive examination and discursive examination is equally pure internally, there is a single mental state: because it is with one mind as object. The samdhi of neither- discursive examination nor discursive examination produces joy and happiness. Entering the second trance, he abides in complete peace.",
        "source": "T10n0287_003:0545c29_7"
    },
    {
        "source_sentence": "於喜離欲安住於捨，正念正知，有身受樂，於是處所，諸聖宣說具足捨念及以正知，",
        "translation": "Abiding in equanimity, right mindfulness and right attentiveness with respect to the joy that is free from desire, there is bodily bliss. The holy ones here and there teach that they are endowed with mindfulness of equanimity and right attentiveness.",
        "source": "T10n0287_003:0546a01_8"
    },
    {
        "source_sentence": "住身受樂入第三靜慮具足安住。",
        "translation": "He abides in the third concentration with a body that receives pleasure and enters the third concentration, which is fully settled.",
        "source": "T10n0287_003:0546a03_9"
    },
    {
        "source_sentence": "樂斷苦斷先喜憂沒，不苦不樂捨念清淨，入第四靜慮具足安住。",
        "translation": "The mindfulness of neither suffering nor pleasure and equanimity is purified, and he enters the fourth concentration to fully abide in peace.",
        "source": "T10n0287_003:0546a04_10"
    },
    {
        "source_sentence": "又此菩薩超一切種色之想故，滅沒一切有對想故，以不作意種種想故，",
        "translation": "“Furthermore, because these enlightening beings transcend all conceptions of form and cease all oppositional conceptions. Because they do not concentrate on various conceptions, they enter the sphere of nonconceptualization.",
        "source": "T10n0287_003:0546a06_11"
    },
    {
        "source_sentence": "知無邊虛空，入空無邊處具足安住。",
        "translation": "Knowing the infinity of space, he enters the infinity of space and fully abides in it.",
        "source": "T10n0287_003:0546a07_12"
    },
    {
        "source_sentence": "超一切種空無邊處，知無邊識，入識無邊處具足安住。",
        "translation": "They transcend all kinds of the boundless realm of emptiness and know the boundless consciousnesses, enter the boundless realm of consciousness, and fully abide there.",
        "source": "T10n0287_003:0546a08_13"
    },
    {
        "source_sentence": "超一切種識無邊處，知無所有，入無所有處具足安住。",
        "translation": "He transcends all kinds of consciousnesses without limit, knows nothing, enters the sphere of nothingness, and fully abides in it.",
        "source": "T10n0287_003:0546a09_14"
    },
    {
        "source_sentence": "超一切種無所有處，知非想非非想，入於非想非非想處具足安住。",
        "translation": "He transcends all kinds of nonexistent states, knows what's neither perceived nor not perceived, and enters the sphere of neither perception nor non-perception to fully abide there.",
        "source": "T10n0287_003:0546a11_15"
    },
    {
        "source_sentence": "但為隨順法隨法行，不以樂著安足處也。",
        "translation": "They simply follow the teaching and practice according to the teaching, not clinging to a place of peace and comfort with pleasure.",
        "source": "T10n0287_003:0546a12_16"
    },
    {
        "source_sentence": "「復次，菩薩修慈俱心，廣大無二、無量、無恨、無怨、無障、無所惱害，",
        "translation": "“Furthermore, the enlightening beings cultivate a mind imbued with compassion that is neither vast nor small, neither immeasurable nor hateful, neither angry nor hostile, neither obstructive nor harmful.",
        "source": "T10n0287_003:0546a14_0"
    },
    {
        "source_sentence": "遍至一切極於法界盡虛空性，諸世界中以慈普覆一切世間具足安住。",
        "translation": "To the extent that they pervade all the ultimate space of the realm of reality, they cover all worlds with kindness in all worlds and fully abide there.",
        "source": "T10n0287_003:0546a15_1"
    },
    {
        "source_sentence": "修悲俱心、修喜俱心亦復如是。",
        "translation": "It's likewise with the mind that cultivates pity and the mind that cultivates joy.",
        "source": "T10n0287_003:0546a17_2"
    },
    {
        "source_sentence": "修捨俱心廣大無二、無量、無恨、無怨、無障、無所惱害，遍至一切極於法界盡虛空性，",
        "translation": "He cultivates the mind accompanied by equanimity, which is vast, nondual, immeasurable, without grudges, without enemies, without resentment, without hindrances, without harmfulness, pervading all to the utmost in the space of the cosmos.",
        "source": "T10n0287_003:0546a17_3"
    },
    {
        "source_sentence": "諸世界中以捨普覆一切世間具足安住。",
        "translation": "In all the worlds, equanimity universally covers all worlds and fully abides.",
        "source": "T10n0287_003:0546a19_4"
    },
    {
        "source_sentence": "復次，菩薩受用無量諸神變事震動大地，一身為多身、多身為一身，或顯、或隱，",
        "translation": "“Furthermore, the enlightening beings experience infinite mystical displays that shake the earth—one body is many bodies, many bodies are one body, whether manifest or hidden.",
        "source": "T10n0287_003:0546a20_5"
    },
    {
        "source_sentence": "迅疾無礙，牆壁山嶂皆能徹過如行於空，於虛空中跏趺而去猶如飛鳥，",
        "translation": "They are swift and unobstructed; walls, mountains, and peaks can pass through them all like a flying bird.",
        "source": "T10n0287_003:0546a22_6"
    },
    {
        "source_sentence": "出沒於地猶若水中，履水如地，身出煙焰如大火聚，從身注水喻如大雲，",
        "translation": "He emerges and disappears from the ground like water, steps on water like earth, emanates smoke and flames from his body like a great heap of fire, and pours water from his body like a great cloud.",
        "source": "T10n0287_003:0546a24_0"
    },
    {
        "source_sentence": "此之日月有大神德有大威勢，以手捫摸，乃至梵世轉身自在；",
        "translation": "The sun and the moon have great supernatural powers and great might. They touch with their palms, reaching as far as Brahmā’s realm of rebirth at will.",
        "source": "T10n0287_003:0546a25_1"
    },
    {
        "source_sentence": "以天耳界清淨過人，悉聞人天二種音聲，若近、若遠乃至蚊蚋、蜣蜋等悉聞其聲。",
        "translation": "Because the divine ear realm is pure and superior to humans, they can hear both sounds of humans and gods, and if they're near or distant, even mosquitoes, gnats, snails, and so forth can hear their sounds.",
        "source": "T10n0287_003:0546a27_0"
    },
    {
        "source_sentence": "以他心智如實而知他有情心，所謂有貪心如實知有貪心，離貪心如實知離貪心，",
        "translation": "They know the minds of other beings by means of knowledge of the minds of others as they really are. The so-called mind with craving as it really is knows the mind with craving, and the mind free of craving as it really is free of craving.",
        "source": "T10n0287_003:0546a28_1"
    },
    {
        "source_sentence": "有瞋離瞋，有癡離癡，有染離染，狹小、廣大無量聚散，住定、出定，",
        "translation": "With anger they are free of anger; with delusion they are free of delusion; with defilement they are free of defilement. They are narrow, small, large, immeasurable, scattered, dwelling in samdhi and emerging from samdhi.",
        "source": "T10n0287_003:0546a30_2"
    },
    {
        "source_sentence": "已得解脫、未得解脫，有亹、無亹，麁心、細心皆如實知。",
        "translation": "Both those who have attained liberation and those who haven’t yet attained liberation have anger and no anger, and they truly know both anger and subtle thoughts.",
        "source": "T10n0287_003:0546b02_3"
    },
    {
        "source_sentence": "菩薩如是以他心智，於他有情他數取趣心之所念心自了知。",
        "translation": "Thus, the bodhisattva thus has the knowledge of other minds, and he or she perceives for himself the mental states of other sentient beings that are repeatedly apprehended by others.",
        "source": "T10n0287_003:0546b03_4"
    },
    {
        "source_sentence": "以宿住智隨念無量諸宿住事，謂能隨念自他一生，二、三、四、五，至十、二十、三、四、五十，",
        "translation": "By means of knowledge of the abidings of past lives, one is mindful of innumerable matters relating to the abidings of past lives. That is to say, one can be mindful of oneself and others for one lifetime:",
        "source": "T10n0287_003:0546b04_5"
    },
    {
        "source_sentence": "乃至百生、多百、多千、多百千生，成劫、壞劫及成壞劫，乃至隨念無量成壞劫，",
        "translation": "It will be a hundred generations, many hundreds, many thousands, and many hundreds of thousands of generations: an eon of formation, an eon of disintegration, an eon of formation and an eon of disintegration, up to an infinite number of eons of formation and an infinite number of eons of decay in succession.",
        "source": "T10n0287_003:0546b06_6"
    },
    {
        "source_sentence": "隨念百劫，隨念千劫、百千劫、俱胝劫、百俱胝劫、千俱胝劫、百千俱胝劫，",
        "translation": "He remembers a hundred eons, a thousand eons, a hundred thousand eons, a coarse eon, a hundred coarse eons, a thousand coarse eons, and a hundred thousand coarse eons.",
        "source": "T10n0287_003:0546b08_7"
    },
    {
        "source_sentence": "乃至無量百千俱胝那庾多劫皆能隨念。",
        "translation": "Even for measureless hundreds of thousands of koṭis of eons, they'll be able to follow it.",
        "source": "T10n0287_003:0546b09_8"
    },
    {
        "source_sentence": "謂我宿生曾在某處，如是名、如是姓、如是種族、如是形貌、如是飲食、如是壽量、如是久住、如是苦樂，",
        "translation": "It means that when I was born in a certain place in the past, such-and-such name, such-and-such family name, such-and-such tribe, such-and-such appearance, such-and-such food and drink, such-and-such life span, such-and-such long abiding, such-and-such pain and pleasure",
        "source": "T10n0287_003:0546b10_9"
    },
    {
        "source_sentence": "從彼處沒來生此處，從此處沒往生於彼，如是形貌、如是言說，若略、若廣諸宿住事皆能隨念。",
        "translation": "They are able to remember such forms, such appearances, and such sayings, whether brief or extensive, as well as the events of past lives.",
        "source": "T10n0287_003:0546b13_0"
    },
    {
        "source_sentence": "以天眼界清淨過人，見諸有情死時、生時，好色、惡色、善趣、惡趣、若劣、若勝，",
        "translation": "Because the divine eye realm is purer than humans, it sees sentient beings at the time of death and birth with good form, bad form, a good destiny, a bad destiny, whether inferior or superior.",
        "source": "T10n0287_003:0546b15_1"
    },
    {
        "source_sentence": "隨業所行，諸有情類皆如實知。",
        "translation": "All sentient beings, according to their actions, know them as they really are.",
        "source": "T10n0287_003:0546b16_2"
    },
    {
        "source_sentence": "謂彼有情成就身、語及意惡行，誹謗賢聖、具足邪見，由邪見業現受因緣，",
        "translation": "It means that those sentient beings commit bad physical, verbal, and mental actions, slander the wise and holy, and hold wrong views. Because of their wrong views and actions, they are now experiencing causes and conditions.",
        "source": "T10n0287_003:0546b17_3"
    },
    {
        "source_sentence": "身壞命終墮險惡趣生捺落迦。",
        "translation": "When his body breaks up and his life ends, he'll fall into a dangerous and bad destiny and be born in Naraka.",
        "source": "T10n0287_003:0546b19_4"
    },
    {
        "source_sentence": "復彼有情成就身、語及意善行，讚美賢聖、成就正見，由正見業現受因緣，",
        "translation": "Again, those sentient beings have accomplished good physical, verbal, and mental actions, praised the wise and holy, and perfected right view. It is because of right view that they are now experiencing karmic causes and conditions as a result of right view.",
        "source": "T10n0287_003:0546b19_5"
    },
    {
        "source_sentence": "身壞命終當昇善趣，生於天中受諸快樂。",
        "translation": "When his body breaks up and his life ends, he'll ascend to a good destiny and be born in heaven where he'll experience happiness.",
        "source": "T10n0287_003:0546b21_6"
    },
    {
        "source_sentence": "菩薩如是以天眼界清淨過人，以共形貌、以共言說，見諸有情死時、生時、好色、惡色、善趣、惡趣、若劣、若勝，",
        "translation": "“Thus, the enlightening beings’ divine eye is purer than human [vision] because they see sentient beings at the time of their death, when they are born, in good form, bad form, a good destiny, a bad destiny, a weak or a strong one.",
        "source": "T10n0287_003:0546b22_7"
    },
    {
        "source_sentence": "隨業所行，諸有情類皆如實知。",
        "translation": "All sentient beings, according to their actions, know them as they really are.",
        "source": "T10n0287_003:0546b24_8"
    },
    {
        "source_sentence": "而此菩薩於彼靜慮、解脫、等持及諸等至，隨意入出，而不由彼威力受生，",
        "translation": "Here the enlightening being enters and emerges freely from concentration, liberation, equanimity, and all states of equanimity without relying on their authoritative power.",
        "source": "T10n0287_003:0546b25_9"
    },
    {
        "source_sentence": "若見彼處速能圓滿菩提分法故，以願力而生其中。",
        "translation": "If someone sees a place where they can quickly perfect the factors of enlightenment, they'll be born there with the power of their vow.",
        "source": "T10n0287_003:0546b27_10"
    },
    {
        "source_sentence": "「菩薩住此發光地已，由廣大見及由願力，現見多佛、多百佛、多千佛、多百千佛、多百千那庾多佛、多俱胝佛、多百俱胝佛、多千俱胝佛、多百千俱胝佛、多百千俱胝那庾多佛。",
        "translation": "“After the bodhisattva abides in this ground of arousing light, he sees many buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many koṭīs of buddhas, many hundreds of thousands of koṭis of buddhas, many thousand koṭ",
        "source": "T10n0287_003:0546b28_11"
    },
    {
        "source_sentence": "菩薩見是如來、應、正等覺已，悉以廣大增上意樂，恭敬、尊重、承事、供養，",
        "translation": "“When the enlightening beings see these buddhas, they honor, venerate, serve, and make offerings to them with great compassion.",
        "source": "T10n0287_003:0546c03_12"
    },
    {
        "source_sentence": "奉施衣服、飲食、臥具、病緣醫藥、諸資生具，奉獻菩薩諸妙樂具，於僧伽眾而作恭敬，",
        "translation": "They offered clothing, food and drink, bedding, medicines for curing the ill, and necessities for daily life. They offered the enlightening being’s implements of exquisite bliss to the assembly of monks in reverence.",
        "source": "T10n0287_003:0546c04_13"
    },
    {
        "source_sentence": "以此善根迴向無上正等菩提；",
        "translation": "They dedicate these roots of goodness to unsurpassed true enlightenment.",
        "source": "T10n0287_003:0546c06_14"
    },
    {
        "source_sentence": "殷重奉事諸佛如來，於其佛所恭敬聽法，聞已受持隨分修行。",
        "translation": "They reverently serve the buddha-tathāgatas, venerate their buddhas, listen to their teachings, retain them as they are heard, and practice accordingly.",
        "source": "T10n0287_003:0546c07_15"
    },
    {
        "source_sentence": "「復次，菩薩觀一切法，無有移轉亦無壞滅，因緣而有；",
        "translation": "“Furthermore, enlightening beings observe that all things have no displacement and also no disintegration; they exist by causes and conditions.",
        "source": "T10n0287_003:0546c08_16"
    },
    {
        "source_sentence": "而此菩薩一切欲縛皆轉微薄；",
        "translation": "These enlightening beings become weakened by all the bonds of desire.",
        "source": "T10n0287_003:0546c09_17"
    },
    {
        "source_sentence": "一切色縛、一切有縛、諸無明縛皆轉微薄；",
        "translation": "All form fetters, all fetters of existence, and all fetters of ignorance all become weakened.",
        "source": "T10n0287_003:0546c10_18"
    },
    {
        "source_sentence": "一切見縛先已除斷。",
        "translation": "All the bonds of views have previously been removed.",
        "source": "T10n0287_003:0546c11_19"
    },
    {
        "source_sentence": "菩薩住是發光地中，於無量劫、無量百劫、無量千劫、無量百千劫、無量百千那庾多劫、無量俱胝劫、無量百俱胝劫、無量千俱胝劫、無量百千俱胝劫、無量百千俱胝那庾多劫，",
        "translation": "“Furthermore, the enlightening beings in this stage of emission of light abide for countless eons, hundreds of millions of eons, thousands of eons, millions of eons, millions of eons, millions of eons, millions of eons, millions of eons, millions of eons, millions of eons, millions of eons, millions of eons, millions",
        "source": "T10n0287_003:0546c12_20"
    },
    {
        "source_sentence": "不積集故邪貪除斷，不積集故邪瞋除斷，不積集故邪癡除斷，所有善根轉更明淨。",
        "translation": "Because of not accumulating, false attachment is to be abandoned; because of not accumulating, false hatred is to be abandoned; because of not accumulating, false delusion is to be abandoned; because of not accumulating, all roots of merit are developed and become clearer and cleaner.",
        "source": "T10n0287_003:0546c16_0"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_003:0546c17_1"
    },
    {
        "source_sentence": "譬如真金，善巧金師自手鍊治，離諸垢已稱量不減；",
        "translation": "Good man, it is analogous to the case of gold that has been skillfully polished by a goldsmith himself. Having been freed from all dirt, his weigh does not decrease.",
        "source": "T10n0287_003:0546c18_2"
    },
    {
        "source_sentence": "菩薩住此發光地中亦復如是，無量百劫乃至無量百千俱胝那庾多劫，由不積集邪貪除斷，",
        "translation": "So it is with the enlightening beings who dwell in this stage of emission of light. For immeasurable hundreds of millions of eons, up to immeasurable millions of trillions of eons, they do so by not accumulating wrong forms of craving and abandoning them.",
        "source": "T10n0287_003:0546c19_3"
    },
    {
        "source_sentence": "由不積集邪恚除斷，由不積集邪癡除斷，所有善根轉更明淨。",
        "translation": "As a result of not accumulating wrong views and wrong delusions, the roots of goodness that are possessed become clearer and purer.",
        "source": "T10n0287_003:0546c21_4"
    },
    {
        "source_sentence": "又此菩薩轉更安忍，柔和意樂而得清淨。",
        "translation": "Furthermore, this bodhisattva's forbearance becomes more peaceful, and his gentle attitude becomes pure.",
        "source": "T10n0287_003:0546c22_5"
    },
    {
        "source_sentence": "又悅美意樂，不瞋意樂，不動意樂，不濁意樂，無高下意樂，不希有情意下意樂，",
        "translation": "“Furthermore, they have pleasant intentions that are neither high nor low, and do not covet the wishes of those below them.",
        "source": "T10n0287_003:0546c23_6"
    },
    {
        "source_sentence": "不望酬報意樂，無諂誑意樂，不稠林意樂，皆轉清淨。",
        "translation": "Their intention not to expect reward or retribution, their intention not to flatter others, and their intention not to densely forest them all become pure.",
        "source": "T10n0287_003:0546c25_7"
    },
    {
        "source_sentence": "而此菩薩四攝事中利行偏多，十到彼岸中忍到彼岸而得增上，餘到彼岸隨力隨分非不修行。",
        "translation": "These bodhisattvas' four ways of taking care of things are partial in terms of benefits and practices, and when they reach the other side of the ten perfections, they tolerate their arrival at the other side and attain their advancement, while the others reach the other side of the perfections according to their strength and ability and don't cultivate them.",
        "source": "T10n0287_003:0546c26_8"
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "“O Children of Buddha!",
        "source": "T10n0287_003:0546c28_9"
    },
    {
        "source_sentence": "是名略說菩薩第三發光地也。",
        "translation": "This is called the third stage of the bodhisattva's brief explanation of the arousal of light.",
        "source": "T10n0287_003:0546c29_10"
    },
    {
        "source_sentence": "菩薩安住於此地中，受生多分作釋天帝，有自在力，善化有情令離欲貪，",
        "translation": "The enlightening beings in this stage are born and mostly become Indra, ruler of the gods. They have unimpeded power to teach sentient beings so that they will be freed from desire and craving.",
        "source": "T10n0287_003:0546c29_11"
    },
    {
        "source_sentence": "善拔救護沒欲泥者。",
        "translation": "He well removes and protects the mud that doesn't arise from desire.",
        "source": "T10n0287_003:0547a02_12"
    },
    {
        "source_sentence": "諸所作業，或以布施、或以愛語、或以利行、或以同事，此等一切悉皆不離佛作意、法作意、僧伽作意、菩薩作意、菩薩行作意、到彼岸作意、諸地作意、佛力作意、無所畏作意、佛不共法作意，",
        "translation": "Whatever they do, whether with generosity, kind speech, benefit, or cooperation, all of them are not apart from the Buddha’s attention, the attention given to doctrine, the attention given to saṃgha, the attention given to enlightening beings, the attention given to practices of enlightening beings, the attention given to reaching the other shore, the attention given to the",
        "source": "T10n0287_003:0547a02_13"
    },
    {
        "source_sentence": "乃至不離一切行相勝妙相應一切智智作意。",
        "translation": "It doesn't part from the contemplation of omniscience and cognition associated with all the marks of all conditioned forms that are superior and marvelous.",
        "source": "T10n0287_003:0547a07_14"
    },
    {
        "source_sentence": "復作願言：『我當一切有情中，為首、為勝、為殊勝、為妙、為微妙、為上、為無上、為導、為將、為帥，",
        "translation": "Again, they make the vow that all sentient beings will be leaders, preeminent, distinguished, marvelous, subtle, sublime, superior, unsurpassed, guides, generals, and commanders.",
        "source": "T10n0287_003:0547a08_15"
    },
    {
        "source_sentence": "乃至願得一切智智所依止處。』",
        "translation": "May I attain the place where omniscience and cognition are based?'",
        "source": "T10n0287_003:0547a10_16"
    },
    {
        "source_sentence": "若樂發起如是精進，棄捨一切家屬財位歸依聖教淨信出家，即一剎那頃瞬息須臾，",
        "translation": "If someone delights in initiating such an effort and abandons all the homes belonging to wealthy families who rely on the pure faith of the holy teachings and leaves home, that's when they are momentary and momentary for a moment.",
        "source": "T10n0287_003:0547a10_17"
    },
    {
        "source_sentence": "能證百千諸三摩地；",
        "translation": "He was able to experience a hundred thousand concentrations.",
        "source": "T10n0287_003:0547a12_18"
    },
    {
        "source_sentence": "能見百千諸佛如來，彼佛加持皆能解了；",
        "translation": "They can see hundreds of thousands of buddha-tathāgatas, and by the empowerment of those buddhas they are able to understand.",
        "source": "T10n0287_003:0547a13_19"
    },
    {
        "source_sentence": "能動百千世界，能往百千剎土，能照百千世界，能成熟百千有情，能住壽百千劫，",
        "translation": "They can move a hundred thousand worlds, go to a hundred thousand buddha-lands, illumine a hundred thousand worlds, mature a hundred thousand sentient beings, and live for a hundred thousand eons.",
        "source": "T10n0287_003:0547a14_20"
    },
    {
        "source_sentence": "於前後際能入百千劫。",
        "translation": "It's capable of entering a hundred thousand eons before and after.",
        "source": "T10n0287_003:0547a16_0"
    },
    {
        "source_sentence": "於百千法門能正思擇，示現百千身身，身皆能現百千菩薩眷屬圍遶。",
        "translation": "He can correctly discriminate among the hundreds of thousands of teachings and show a hundred thousand body bodies, which can all be shown to be surrounded by a hundred thousand bodhisattva retinues.",
        "source": "T10n0287_003:0547a16_1"
    },
    {
        "source_sentence": "從此以上，是諸菩薩有願力者，由勝願故，所有遊戲，或身、或光明、或神通、或眼、或境界、或音聲、或行、或莊嚴、或勝解、或所作，",
        "translation": "“From here the enlightening beings have the power of vows: because of their overwhelming vow, they produce all kinds of play—some with bodies, some with light, some with supernormal powers, some with eyes, some with objects, some with sounds, some with gestures, some with adornments, some with conviction, some done by themselves.",
        "source": "T10n0287_003:0547a18_2"
    },
    {
        "source_sentence": "此等乃至爾所百千俱胝那庾多劫不易可數。」",
        "translation": "It's not easy to count these or even those hundreds of thousands of koṭis of eons.",
        "source": "T10n0287_003:0547a20_3"
    },
    {
        "source_sentence": "「清淨安住厭離心，　　離欲無退及堅固；",
        "translation": "“Purely abiding in a mind free of disillusionment, They are free of desire, without regressing or being steadfast.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　熾然勇健勝妙廣，　　以此十心入三地。",
        "translation": "With these ten minds, he enters the three stages of enlightenment.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　菩薩住於此地中，　　觀行無常、苦、不淨，",
        "translation": "Enlightening beings in this stage Observe the practice of impermanence, suffering, and impurity:",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　無怙、敗壞、不久停，　　遷變、無住、無來往。",
        "translation": "There's no home, no decay, and no sooner to stop, and there's no change, no abiding, and no coming or going.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　觀身無救、無依怙，　　有憂、有惱、續愛憎，",
        "translation": "He observes that the body has no savior and no support, With sorrow and anguish, And continues to crave and hate.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　多苦不停或火然，　　與病俱有無休息。",
        "translation": "Many pains don't stop or are burned by fire, and there's no resting with illness.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　厭離三有求佛智，　　見彼妙智不思議；",
        "translation": "Being disillusioned with the three realms of existence and seeking buddha-knowledge, They see their subtle knowledge inconceivably.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　無等、無量難證悟，　　無雜、無災、無逼惱，",
        "translation": "They are peerless, immeasurable, difficult to realize, Without mixture, without calamity, without oppression.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　歸大寂滅無退轉，　　能救無量苦有情。",
        "translation": "He returns to great quiescence without turning back, able to save measurelessly suffering sentient beings.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　見佛智已愍眾生，　　孤獨無依無救護，",
        "translation": "Seeing the Buddha’s knowledge, they pity sentient beings— They are alone, without support or protection.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　三毒熾然常困乏，　　住諸有獄恒受苦，",
        "translation": "The three poisons are blazing and constantly destitute, Abiding in the hells of existence always suffering pain.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　煩惱習覆無慧目，　　志樂下劣喪法寶，",
        "translation": "Their afflictions and habits obstruct the eye of wisdom, And their aspirations are weak; They lose the jewel of truth.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　隨順生死怖涅槃，　　我應救彼勤精進。",
        "translation": "Following birth and death and fearing nirvāṇa, I should diligently exert myself to save them.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　將求智慧益有情，　　思何方便令解脫？",
        "translation": "Seeking wisdom to benefit sentient beings, what method does he think of to liberate them?",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　不離處佛無礙智，　　斯由覺法如實理；",
        "translation": "Unhindered knowledge not leaving the Buddha’s abode Is due to the true principle of enlightenment.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　覺由無行無生慧，　　慧從定發定由聞。",
        "translation": "Feeling is due to the wisdom of nonconduct and nonorigination; Wisdom arises from concentration through hearing.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　如是思惟自策勵，　　日夜聽習尊重法；",
        "translation": "Thinking thus, they encourage themselves And listen day and night to the Teaching of respect.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　為聞正法起敬心，　　國城、資具、諸珍寶，",
        "translation": "In order to hear the true teaching, they give rise to reverence for their country, its cities, provisions, and treasures.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　妻子、眷屬及王位，　　如是一切皆能捨；",
        "translation": "Their wives, their retinues, and the throne of kingship— All these they can abandon.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　頭、目、耳、鼻、舌、牙齒，　　手、足、骨髓、心血、肉，",
        "translation": "Their heads, eyes, ears, nose, tongue, teeth, hands, feet, bone marrow, heart blood, and flesh.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　此等皆捨未為難，　　但於法師生難想。",
        "translation": "These are all abandoned and not yet difficult, but give rise to the perception of difficulty in regard to the teacher of the Dharma.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　設有人等語菩薩，　　孰能投身大火坑；",
        "translation": "If there are bodhisattvas who speak like this, Who would be able to throw themselves into a great pit of fire?",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　我當與汝佛法寶，　　聞以投之無怯懼。",
        "translation": "I'll give you the Buddha's treasure of the Dharma, and when I hear it, I'll throw it away without fear.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　假使火滿三千界，　　身從梵世而投入；",
        "translation": "Suppose fire fills the 3,000 worlds, And their bodies emerge from the Brahma realm.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　為求法故不為難，　　況復人間諸小苦。",
        "translation": "It's not difficult to seek the Dharma, so why wouldn't it be difficult, much less the minor sufferings of humans?",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　從初發意至菩提，　　其中設有無間苦；",
        "translation": "From the first arousal of mind up to enlightenment, Includes unremitting suffering.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　為聞法故皆能受，　　何況人中諸苦事。",
        "translation": "Because they hear the Dharma, they're all able to receive it, so why wouldn't they accept painful things among humans?",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　聞已如理正思惟，　　獲四靜慮、四等至，",
        "translation": "Having heard it, correctly and correctly reflecting on it, They attain the four meditations and the four equanimities.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　四無量心、五神通，　　不隨其勢而受生。",
        "translation": "The four immeasurable states of mind and the five supernormal powers aren't born according to their momentum.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　菩薩住此見多佛，　　供養聽聞心決定；",
        "translation": "Enlightening beings in this abode see many buddhas, Making offerings to them and listening with certainty.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　斷諸邪惑轉淨明，　　如鍊真金體無減。",
        "translation": "Cutting off wrong afflictions and transforming into pure insight is like refining the essence of true gold without diminution.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　住此多作釋天帝，　　化導無量諸有情；",
        "translation": "Abiding here, they mostly become Indra’s celestial emperors, Teaching and guiding countless sentient beings.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　令捨貪心住善道，　　一切專求佛功德。",
        "translation": "Causing them to abandon their craving and abide in good paths, They all focus on the virtues of buddhahood.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　住此精進剎那頃，　　能證百千三摩地；",
        "translation": "In the space of one moment of this effort they can experience a hundred thousand concentrations.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　見百千佛相嚴身，　　若具願力復過是。",
        "translation": "Seeing hundreds of thousands of buddhas adorning their bodies, If one fulfills the power of vows, it's even more so.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　一切有情普利樂，　　彼諸菩薩最上行；",
        "translation": "The supreme practice of enlightening beings is to bring benefit and happiness to all sentient beings.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　如是所有第三地，　　我依其義已解釋。」",
        "translation": "Thus is the third ground that exists, which I've explained according to its meaning.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　佛子聞此廣大行，　　可樂深妙殊勝法；",
        "translation": "The offspring of Buddha, hearing about this vast practice, Are able to delight in the profound and sublime supreme teaching.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　心皆勇悅大歡喜，　　普散眾花供養佛。",
        "translation": "Their minds are all courageous, joyful, and greatly overjoyed; They scatter flowers everywhere to honor the Buddha.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　演說如是妙法時，　　大地海水皆震動；",
        "translation": "When they expound such a sublime teaching, All the great waters of the ocean earth shake.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　一切天女咸歡喜，　　悉吐妙音同讚歎。",
        "translation": "All the goddesses all rejoice, All uttering sublime sounds to praise and extol.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　自在天王大欣慶，　　雨摩尼寶供養佛；",
        "translation": "The sovereign celestial king was greatly delighted, showering precious jewels as offerings to the Buddha.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　讚言：「佛為我出興，　　演說第一功德行；",
        "translation": "They praised him, saying: The Buddha emerged for my sake, Expounding the supreme practice of virtue.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　如是智者諸地義，　　於百千劫甚難遇。",
        "translation": "Such a wise person's meaning of the stages is very difficult to encounter for a hundred thousand eons.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　我今忽然而得聞，　　菩薩勝行妙法音；",
        "translation": "Suddenly I have suddenly heard the voice of the supreme practice of enlightening beings’ teaching.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　願更演說聰慧者，　　後決定地無餘道；",
        "translation": "May I further expound on the wise One, Who will later attain the stage of certainty and have no other path?",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　利益一切諸大眾，　　此諸佛子皆樂聞。」",
        "translation": "Benefiting all the masses, these heirs of the Buddha are happy to hear it.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　勇猛大心解脫月，　　請金剛藏言：「佛子！",
        "translation": "The moon of the liberation of the courageous great mind, he asked Vajragarbha, saying, Son of the Buddha!",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "　從此轉入第四地，　　所有行相願宣說。」",
        "translation": "From here, he turns into the fourth ground and wishes to explain all the characteristics of his actions.",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩，欲重宣此義而說頌曰：菩薩發光地第三竟菩薩焰慧地第四爾時，",
        "translation": "At that time the bodhisattva Diamond Matrix, wanting to elaborate on the meaning of this further, spoke these verses:",
        "source": "T10n0287_003:0547a21_4"
    },
    {
        "source_sentence": "金剛藏菩薩告眾菩薩言：「唯諸佛子！",
        "translation": "The Vajragarbha Bodhisattva addressed the bodhisattvas, saying, Just so, heirs of the Buddha!",
        "source": "T10n0287_003:0547c16_5"
    },
    {
        "source_sentence": "若是菩薩，第三地明善清淨已，欲入菩薩第四智地，當以十種法明而入。",
        "translation": "If this is a bodhisattva who wants to enter the bodhisattva's fourth ground of wisdom after the third ground is clearly well-purified, he should enter it with ten kinds of insight.",
        "source": "T10n0287_003:0547c16_6"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0287_003:0547c18_7"
    },
    {
        "source_sentence": "所謂：以有情界思察明入，以諸世界思察明入，以真法界思察明入，以虛空界思察明入，",
        "translation": "That is to say, they enter by reflecting on the realm of sentient beings, by reflecting on worlds, by reflecting on knowledge, by reflecting on the realm of reality, by reflecting on space, by reflecting on light.",
        "source": "T10n0287_003:0547c18_8"
    },
    {
        "source_sentence": "以識界思察明入，以欲界思察明入，以色界思察明入，以無色界思察明入，",
        "translation": "He enters insight with deliberation in the realm of consciousness, he enters insight with deliberation in the realm of desire, he enters insight with deliberation in the realm of form, and he enters insight with deliberation in the formless realm.",
        "source": "T10n0287_003:0547c21_0"
    },
    {
        "source_sentence": "以妙意樂勝解界思察明入，以廣大意樂勝解界思察明入，菩薩以此十法明入昇第四地。",
        "translation": "With the contemplation of the realm of superior understanding with marvelous intention and the contemplation of the realm of superior understanding with extensive intention, the bodhisattva ascends to the fourth ground by these ten things to explain entry.",
        "source": "T10n0287_003:0547c22_1"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_003:0547c24_2"
    },
    {
        "source_sentence": "菩薩纔得焰慧地已，則由十種智成熟法，長如來家得彼體法。",
        "translation": "A bodhisattva who has just attained the stage of blazing wisdom then, because of the ten kinds of knowledge and ripening dharmas, grows up in the Tathāgata's home and attains their essence.",
        "source": "T10n0287_003:0547c25_3"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0287_003:0547c26_4"
    },
    {
        "source_sentence": "謂：由意樂不退轉故，於三寶中不壞淨信，至究竟故，觀察諸行生滅性故，",
        "translation": "They are: because of the non-backsliding of their aspirations, unshakable pure faith in the three treasures up to the ultimate; because they contemplate the nature of conditioned states as arising and ceasing.",
        "source": "T10n0287_003:0547c26_5"
    },
    {
        "source_sentence": "觀辯諸法性不起故，觀世間成壞故，觀業有生有死故，觀生死涅槃故，",
        "translation": "because of observing that the essence of all dharmas is not produced, because of observing worldly formations and disintegrations, because of observing actions with birth and death, and because of observing birth-and-death and nirvana.",
        "source": "T10n0287_003:0547c28_6"
    },
    {
        "source_sentence": "觀有情剎業故，觀前際後際故，觀無性無盡故。",
        "translation": "Because of observing the action of beings as ksanas, because of observing the former and the latter ends; because of observing the non-essence and the inexhaustibility.",
        "source": "T10n0287_003:0548a01_0"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_003:0548a02_1"
    },
    {
        "source_sentence": "菩薩成就如是十種智成熟法，長如來家得彼體法。",
        "translation": "A bodhisattva who accomplishes these ten kinds of wisdom and ripening dharmas will grow up in the Tathāgata's home and attain their essence.",
        "source": "T10n0287_003:0548a02_2"
    },
    {
        "source_sentence": "「復次，諸佛子！",
        "translation": "“Furthermore, heirs of the Buddha!",
        "source": "T10n0287_003:0548a04_0"
    },
    {
        "source_sentence": "菩薩住此焰慧地時，隨於內身住循身觀，熾然精進正知具念除世貪憂；",
        "translation": "“When enlightening beings abide in this stage of blazing knowledge, they contemplate the bodies of sentient beings according to their internal bodies, exerting themselves vigorously and with correct knowledge. They are freed from worldly desires and cravings.",
        "source": "T10n0287_003:0548a04_1"
    },
    {
        "source_sentence": "隨於外身住循身觀，熾然精進正知具念除世貪憂；",
        "translation": "“Great enlightening beings follow the contemplation of body-follower in external bodies, blazing with energy and right knowledge. They are mindful and rid themselves of worldly desires and cravings.",
        "source": "T10n0287_003:0548a05_2"
    },
    {
        "source_sentence": "隨內外身住循身觀，熾然精進正知具念除世貪憂；",
        "translation": "“Great enlightening beings follow the contemplation of body as body and abide in the contemplation of body as body; blazing with energy and right knowledge, they are mindful and rid themselves of worldly desires and sorrow.",
        "source": "T10n0287_003:0548a07_3"
    },
    {
        "source_sentence": "於內受、於外受、於內外受亦復如是；",
        "translation": "The same applies to inward feeling, to outward feeling and to inward and outward feeling.",
        "source": "T10n0287_003:0548a08_4"
    },
    {
        "source_sentence": "於內心、於外心、於內外心亦復如是；",
        "translation": "So it is with the internal mind, the external mind, and the mental states inside and outside.",
        "source": "T10n0287_003:0548a09_5"
    },
    {
        "source_sentence": "隨於內法住循法觀，熾然精進正知具念除世貪憂；",
        "translation": "In accord with internal principles they abide in the contemplation of principles, blazing with energy and right knowledge. They are mindful and rid themselves of worldly desires and cravings.",
        "source": "T10n0287_003:0548a09_6"
    },
    {
        "source_sentence": "隨於外法住循法觀，熾然精進正知具念除世貪憂；",
        "translation": "They follow external principles and abide in the contemplation of principles, blazing with energy and right knowledge. They are mindful and rid themselves of worldly desires and cravings.",
        "source": "T10n0287_003:0548a11_7"
    },
    {
        "source_sentence": "隨內外法住循法觀，熾然精進正知具念除世貪憂。",
        "translation": "He follows the internal and external teachings, abides in the contemplation of following the teachings, blazing with effort and right knowledge, and is mindful to remove worldly cravings and sorrow.",
        "source": "T10n0287_003:0548a12_8"
    },
    {
        "source_sentence": "「復次，菩薩於諸未生惡不善法，為不生故，生欲策勵發起精勤策心持心；",
        "translation": "“Furthermore, enlightening beings give rise to the determination not to produce bad and unwholesome states that have yet to be produced.",
        "source": "T10n0287_003:0548a14_0"
    },
    {
        "source_sentence": "於諸已生惡不善法，為永斷故，生欲策勵發起精勤策心持心；",
        "translation": "In order to permanently eliminate bad and unwholesome states that have already arisen, they give rise to the aspiration for enlightenment.",
        "source": "T10n0287_003:0548a15_1"
    },
    {
        "source_sentence": "於未生善法為令生故，生欲策勵發起精勤策心持心；",
        "translation": "In order to produce good qualities not yet produced, they give rise to desires and develop enthusiasm.",
        "source": "T10n0287_003:0548a17_2"
    },
    {
        "source_sentence": "於已生善法為令安住不忘，增廣倍修滿故，生欲策勵發起精勤策心持心。",
        "translation": "In order to cause the well-established good qualities that have already arisen to be maintained and not forgetted, they increase in breadth and cultivate them doubly. They give rise to desire, encouragement, exertion, energy, zeal, and sustaining minds.",
        "source": "T10n0287_003:0548a18_3"
    },
    {
        "source_sentence": "復次，菩薩修欲等持斷行成就神足，依離、依無染、依滅迴向捨；",
        "translation": "“Furthermore, enlightening beings develop the spiritual legs by cultivating the practice of detachment from all forms of craving and so on. Based on detachment, based on nondefilement, and based on cessation, they dedicate them to equanimity.",
        "source": "T10n0287_003:0548a20_0"
    },
    {
        "source_sentence": "修勤等持斷行成就神足，依離、依無染、依滅迴向捨；",
        "translation": "He develops the supernormal power of cultivating zeal and so on, maintaining the practice of annihilation. Based on detachment, based on nondefilement, and based on cessation, he dedicates himself to relinquishment.",
        "source": "T10n0287_003:0548a21_1"
    },
    {
        "source_sentence": "修心等持斷行成就神足，依離、依無染、依滅迴向捨；",
        "translation": "The development of mind, etc., sustains the practice of annihilation and develops supernormal abilities: depending on detachment, depending on nondefilement, and depending on cessation, they dedicate themselves to relinquishment.",
        "source": "T10n0287_003:0548a22_2"
    },
    {
        "source_sentence": "修觀等持斷行成就神足，依離、依無染、依滅迴向捨。",
        "translation": "He cultivates contemplation and so forth to maintain the practice of cessation and accomplishes miraculous abilities, relying on seclusion, undefiledness, and cessation to dedicate them back to equanimity.",
        "source": "T10n0287_003:0548a23_3"
    },
    {
        "source_sentence": "復次，菩薩修信根，依離、依無染、依滅迴向捨；",
        "translation": "“Furthermore, enlightening beings cultivate the faculty of faith, relying on detachment, on nondefilement, and on cessation to dedicate themselves with relinquishment.",
        "source": "T10n0287_003:0548a24_4"
    },
    {
        "source_sentence": "修精進根，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate the faculty energy, depending on detachment, depending on nondefilement, and depending on cessation, they dedicate it back to relinquishment.",
        "source": "T10n0287_003:0548a25_5"
    },
    {
        "source_sentence": "修念根，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate the faculty of mindfulness, relying on detachment, dependence on nondefilement, and dependence on cessation to turn away.",
        "source": "T10n0287_003:0548a26_6"
    },
    {
        "source_sentence": "修定根，依離、依無染、依滅迴向捨；",
        "translation": "He cultivates the faculty of concentration depending on detachment, depending on nondefilement and depending on cessation, he dedicates himself to relinquishment.",
        "source": "T10n0287_003:0548a27_7"
    },
    {
        "source_sentence": "修慧根，依離、依無染、依滅迴向捨。",
        "translation": "He cultivates the faculty of wisdom depending on separation, depending on nondefilement, and depending on cessation, he dedicates himself back to equanimity.",
        "source": "T10n0287_003:0548a28_8"
    },
    {
        "source_sentence": "「復次，菩薩修信力，依離、依無染、依滅迴向捨；",
        "translation": "“Furthermore, enlightening beings cultivate the power of faith, relying on detachment, on nondefilement, and on dispassionate dedication.",
        "source": "T10n0287_003:0548b01_0"
    },
    {
        "source_sentence": "修精進力，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate the power of energy, relying on detachment, absence of defilement and dedication based on cessation.",
        "source": "T10n0287_003:0548b02_0"
    },
    {
        "source_sentence": "修念力，依離、依無染、依滅迴向捨；",
        "translation": "The power of enlightening beings’ cultivation of mindfulness depends on detachment, on absence of defilement, and on the dedication of relinquishment.",
        "source": "T10n0287_003:0548b02_1"
    },
    {
        "source_sentence": "修定力，依離、依無染、依滅迴向捨；",
        "translation": "The power of enlightening beings’ cultivation of concentration is based on detachment, on nondefilement and on cessation, and they dedicate it to relinquishment.",
        "source": "T10n0287_003:0548b03_2"
    },
    {
        "source_sentence": "修慧力，依離、依無染、依滅迴向捨。",
        "translation": "The power of cultivating wisdom depends on detachment, on the absence of defilement, and on the dedication and equanimity of cessation.",
        "source": "T10n0287_003:0548b04_3"
    },
    {
        "source_sentence": "復次，菩薩修念等覺支，依離、依無染、依滅迴向捨；",
        "translation": "“Furthermore, enlightening beings cultivate the branch of enlightenment of mindfulness and so on, relying on detachment, on nondefilement, and on cessation to dedicate themselves back to equanimity.",
        "source": "T10n0287_003:0548b05_4"
    },
    {
        "source_sentence": "修擇法等覺支，依離、依無染、依滅迴向捨；",
        "translation": "They develop the factors of enlightenment such as discriminating qualities, depending on detachment, depending on nondefilement, and depending on cessation, dedication and relinquishment.",
        "source": "T10n0287_003:0548b06_5"
    },
    {
        "source_sentence": "修精進等覺支，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate the members of enlightenment such as zeal, depending on detachment, depending on nondefilement, and depending on cessation, they dedicate themselves back to relinquishment.",
        "source": "T10n0287_003:0548b07_6"
    },
    {
        "source_sentence": "修喜等覺支，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate the members of enlightenment such as joy, depending on detachment, depending on nondefilement and depending on cessation, dedication and relinquishment.",
        "source": "T10n0287_003:0548b08_7"
    },
    {
        "source_sentence": "修輕安等覺支，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate the members of enlightenment such as ease, relying on detachment, absence of defilement and dedication in cessation.",
        "source": "T10n0287_003:0548b09_0"
    },
    {
        "source_sentence": "修定等覺支，依離、依無染、依滅迴向捨；",
        "translation": "The members of enlightenment such as the one cultivating concentration depend on being disjunctioned, on being without defilement and on giving up in dependence on cessation.",
        "source": "T10n0287_003:0548b09_1"
    },
    {
        "source_sentence": "修捨等覺支，依離、依無染、依滅迴向捨。",
        "translation": "They cultivate the factors of enlightenment such as equanimity, relying on seclusion, undefiledness, and cessation to dedicate themselves back to equanimity.",
        "source": "T10n0287_003:0548b10_2"
    },
    {
        "source_sentence": "復次，菩薩修正見，依離、依無染、依滅迴向捨；",
        "translation": "“Furthermore, enlightening beings cultivate right view, relying on detachment, on the absence of defilement, and on the dedication of relinquishment.",
        "source": "T10n0287_003:0548b11_3"
    },
    {
        "source_sentence": "修正念，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate right mindfulness, reliant on detachment, reliant on nondefilement, and reliant on cessation, dedicating themselves back to equanimity.",
        "source": "T10n0287_003:0548b12_4"
    },
    {
        "source_sentence": "修正思惟，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate correct reflection, relying on detachment, absence of defilement, and dedication for enlightenment based on cessation.",
        "source": "T10n0287_003:0548b13_5"
    },
    {
        "source_sentence": "修正語，依離、依無染、依滅迴向捨；",
        "translation": "They speak the truth of enlightenment, relying on detachment, absence of defilement, and dedication in accord with cessation.",
        "source": "T10n0287_003:0548b14_6"
    },
    {
        "source_sentence": "修正業，依離、依無染、依滅迴向捨；",
        "translation": "The steadfast one’s action depends on detachment, on absence of defilement and on the dedication of relinquishment in conformity with cessation.",
        "source": "T10n0287_003:0548b15_0"
    },
    {
        "source_sentence": "修正命，依離、依無染、依滅迴向捨；",
        "translation": "They fix their livelihood, relying on detachment, absence of defilement, and the dedication of relinquishment.",
        "source": "T10n0287_003:0548b15_1"
    },
    {
        "source_sentence": "修正精進，依離、依無染、依滅迴向捨；",
        "translation": "They cultivate effort, reliant on detachment, reliant on nondefilement, and reliant on cessation, dedicating it back to equanimity.",
        "source": "T10n0287_003:0548b16_2"
    },
    {
        "source_sentence": "修正定，依離、依無染、依滅迴向捨；",
        "translation": "The steadfast meditative absorption relies on detachment, on nondefilement and on cessation and dedicates it back to equanimity.",
        "source": "T10n0287_003:0548b17_3"
    },
    {
        "source_sentence": "修正慧，依離、依無染、依滅迴向捨。",
        "translation": "The wisdom of cultivation depends on detachment, on the absence of defilement, and on the dedication and equanimity of cessation.",
        "source": "T10n0287_003:0548b18_4"
    },
    {
        "source_sentence": "菩薩修此菩提分法，但於一切諸有情界有悲戀故，引發本願所扶持故，",
        "translation": "Enlightening beings cultivate these factors of enlightenment because they have compassion for all sentient beings and give rise to the support of their past vows.",
        "source": "T10n0287_003:0548b18_5"
    },
    {
        "source_sentence": "以大悲愍為先導故，成就大慈故，緣慮一切智者智故，引發佛剎諸莊嚴故，",
        "translation": "Because great compassion and pity are the first to guide, because they develop great kindness, because they contemplate omniscience as knowledge, because they produce the adornments of buddha-lands.",
        "source": "T10n0287_003:0548b20_6"
    },
    {
        "source_sentence": "引發如來力、無所畏、不共佛法、相好言音故，希求後後殊勝法故，隨順甚深解脫佛法所聞行故，",
        "translation": "Because it produces the power, fearlessness, unique qualities of buddha-teachings, characteristics, sounds, and voices of enlightened ones; because it longs for the supreme teaching that comes after it. Because it follows what is heard and practiced by those who are profoundly liberated from the Buddha-teachings.",
        "source": "T10n0287_003:0548b22_7"
    },
    {
        "source_sentence": "觀察廣大方便善巧故。",
        "translation": "It's because of the skillfulness of observing vast skillful means.",
        "source": "T10n0287_003:0548b24_8"
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "“O Children of Buddha!",
        "source": "T10n0287_003:0548b24_9"
    },
    {
        "source_sentence": "菩薩住此焰慧地時，所有微細身見等惑，謂我、有情、命者、育者、士夫數取趣，",
        "translation": "“When enlightening beings abide in this stage of Blazing, they are afflicted by the subtle defilements of body, such as belief in self, sentient beings, life, nurturing, and individualistic attachment.",
        "source": "T10n0287_003:0548b25_10"
    },
    {
        "source_sentence": "蘊、界、處執，所起動亂思惟伺察，護持攝受畜積著處，如是一切皆悉遠離。",
        "translation": "The attachment to the aggregates, realms, and locations that are initiated by disturbing contemplation, discursive examination, guarding, collecting, accumulating, and putting aside all of these things are completely removed.",
        "source": "T10n0287_003:0548b26_11"
    },
    {
        "source_sentence": "所有一切不應作業，諸佛所訶、雜染所引，如是一切皆悉捨離。",
        "translation": "All the things that shouldn't be done, which are reprimanded by the buddhas and induced by defilements, and so forth, are all completely abandoned.",
        "source": "T10n0287_003:0548b28_12"
    },
    {
        "source_sentence": "所有應作能順菩薩正行資糧，一切如來讚美之業，皆悉受行。",
        "translation": "All the accumulations that should be made to follow the bodhisattva's correct practice, and all the praiseworthy actions of the Tathāgatas are fully received and practiced.",
        "source": "T10n0287_003:0548b29_13"
    },
    {
        "source_sentence": "復次，展轉為菩薩道得圓滿故，如如方便慧所引發，修諸道支如是如是，",
        "translation": "“Furthermore, in order to perfect the path of enlightening beings, they develop and cultivate all the factors of the path that are produced by knowledge of means.",
        "source": "T10n0287_003:0548c02_14"
    },
    {
        "source_sentence": "得滋潤心柔和之忍，有堪能心，引利樂心，無雜染心，訪求後後殊勝法心，",
        "translation": "They attain the tolerance of nourishing mind and gentleness, have a capable mind that attracts benefit and happiness, are free from defilement, and seek superior qualities later and later.",
        "source": "T10n0287_003:0548c03_15"
    },
    {
        "source_sentence": "希勝智心，能救一切世間之心，尊重隨順諸師長心，如所聞法而修行心；",
        "translation": "They cherish the will for supreme knowledge, able to save the minds of all beings in all worlds. They honor and follow the teacher’s instructions, and practice according to the teaching they have heard.",
        "source": "T10n0287_003:0548c05_16"
    },
    {
        "source_sentence": "又善知恩善知報恩，其心調和共住安樂，質直柔軟無稠林行無誑無慢，",
        "translation": "They know kindness well and repay kindness well. Their minds are harmonious, living together in peace and happiness. They are honest, upright, gentle, free from the congestion of forests, without anger or conceit.",
        "source": "T10n0287_003:0548c07_17"
    },
    {
        "source_sentence": "善順語者右受教誨，菩薩如是安忍成就、調伏成就、寂滅成就。",
        "translation": "The person who speaks well and follows the teaching to the right is thus instructed, and the bodhisattva accomplishes patience, discipline, and cessation in this way.",
        "source": "T10n0287_003:0548c08_18"
    },
    {
        "source_sentence": "如是忍調寂滅成就思惟現行，能淨上地諸業之時，獲大精進無有休息，",
        "translation": "In the same way, when one develops patience, harmony, tranquility, and perfected reflection in this way, he can purify the actions of the higher stages and attain great effort without cease.",
        "source": "T10n0287_003:0548c10_19"
    },
    {
        "source_sentence": "不雜染精進、不退轉精進、廣大精進、無邊精進、熾然精進、無等精進、無映奪精進、成熟一切有情精進、善分別道非道精進。",
        "translation": "Their uncontaminated effort, nonretrogressing effort, extensive effort, limitless effort, blazing effort, peerless effort, unequalled effort, reflective effort, effort to ripen all sentient beings, and skillfully discriminating what's the path and what's not the path.",
        "source": "T10n0287_003:0548c11_20"
    },
    {
        "source_sentence": "又此菩薩善意樂界轉更清淨，增上意樂界不遺失，勝解明利善根得淨，",
        "translation": "“Furthermore, these enlightening beings’ realm of good intention becomes ever more pure; without losing the realm of superior intent, they are purified by understanding and benefiting from the roots of virtue.",
        "source": "T10n0287_003:0548c14_21"
    },
    {
        "source_sentence": "離世垢濁斷諸疑惑，無疑之性現前具足證喜輕安，如來加持而得現前，",
        "translation": "Being free of worldly defilements, they cut off doubts and doubts. Their nature is without doubtfulness; fully experiencing joy and serenity, they are manifested by the Buddha’s empowerment.",
        "source": "T10n0287_003:0548c16_22"
    },
    {
        "source_sentence": "無量心意樂皆悉成就。",
        "translation": "Measureless minds and intentions are all accomplished.",
        "source": "T10n0287_003:0548c18_23"
    },
    {
        "source_sentence": "「菩薩住此焰慧地中，以廣大見及以願力，現見多佛、多百佛、多千佛、多百千佛、多百千那庾多佛、多俱胝佛、多百俱胝佛、多千俱胝佛、多百千俱胝佛、多百千俱胝那庾多佛。",
        "translation": "“When the bodhisattva abides in this stage of blazing wisdom, he sees many buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many hundreds of thousands of buddhas, many koṭis of buddhas, many hundreds of koṭis of buddhas, many thousand koṭis of buddhas",
        "source": "T10n0287_003:0548c18_24"
    },
    {
        "source_sentence": "菩薩見是如來、應供、正等覺已，悉以廣大增上意樂，恭敬、尊重、承事、供養，",
        "translation": "“When the enlightening beings see these buddhas, they honor, venerate, serve, and make offerings to them with great zeal.",
        "source": "T10n0287_003:0548c22_25"
    },
    {
        "source_sentence": "奉施衣服、飲食、臥具、病緣醫藥諸資生具，奉獻菩薩諸妙樂具，於僧伽眾而作恭敬，",
        "translation": "They presented their robes, food and drink, bedding, medicine for curing the ill, and necessities for daily life. They presented the delightful implements of enlightening beings to the assembly of monks in reverence.",
        "source": "T10n0287_003:0548c24_0"
    },
    {
        "source_sentence": "以此善根迴向無上正等菩提，殷重奉事諸佛如來，於其佛所恭敬聽法。",
        "translation": "Because of these roots of goodness they dedicate them to unsurpassed true perfect enlightenment, venerate the buddhas and tathāgatas with reverence, and listen to the Dharma in the presence of those buddhas.",
        "source": "T10n0287_003:0548c25_1"
    },
    {
        "source_sentence": "聞已受持，隨分修行多分，於彼諸佛聖教淨信出家，於此菩薩所有意樂增上意樂，",
        "translation": "Having heard it, they accept and uphold it, practice it accordingly, and cultivate it in many ways. Relying on the pure faith of those buddhas’ noble teachings, they leave home. The aspirations of these enlightening beings are based on the aspiration for supreme enlightenment:",
        "source": "T10n0287_003:0548c27_2"
    },
    {
        "source_sentence": "勝解平等性轉復清淨。",
        "translation": "The equality of resolve becomes increasingly pure.",
        "source": "T10n0287_003:0548c29_3"
    },
    {
        "source_sentence": "「菩薩住此焰慧地已，復更無量百千俱胝那庾多劫，此之意樂勝解平等清淨而住，",
        "translation": "“Furthermore, the bodhisattva stayed in this stage of blazing wisdom for countless hundreds of thousands of koṭis of nayutas of kalpas, abiding there with equanimity, equanimity, and purity of resolve.",
        "source": "T10n0287_003:0548c29_4"
    },
    {
        "source_sentence": "所有善根轉復熾然轉更明淨。",
        "translation": "All the good roots that exist become increasingly blazing and increasingly pure.",
        "source": "T10n0287_003:0549a02_5"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_003:0549a03_6"
    },
    {
        "source_sentence": "如巧金師，以所鍊金作莊嚴具，非餘未作莊嚴具金之所映奪。",
        "translation": "It's like a skillful gold smith who makes an adornment of the gold he's collected, not something else that's reflected by the gold that hasn't been made to adorn it.",
        "source": "T10n0287_003:0549a03_7"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_003:0549a05_8"
    },
    {
        "source_sentence": "菩薩安住焰慧地中亦復如是，所有善根，非餘安住下地菩薩所有善根而能映奪。",
        "translation": "A bodhisattva who abides in the stage of blazing wisdom is likewise, possessing good roots that can't be overwhelmed by other bodhisattvas who abide in the lower stages and possess good roots.",
        "source": "T10n0287_003:0549a05_9"
    },
    {
        "source_sentence": "又諸佛子！",
        "translation": "Also, children of the Buddha!",
        "source": "T10n0287_003:0549a07_10"
    },
    {
        "source_sentence": "如摩尼寶清淨光輪所放光明，非餘寶珠所能映奪，所放光明一切世間風水雨等不能斷滅。",
        "translation": "It's like the light emitted by a maṇi-jeweled wheel of pure light that can't be overpowered by other precious pearls, and the light emitted by it can't be cut off by any worldly wind, water, rain, or so forth.",
        "source": "T10n0287_003:0549a07_11"
    },
    {
        "source_sentence": "唯諸佛子！",
        "translation": "Only the heirs of the Buddha!",
        "source": "T10n0287_003:0549a09_12"
    },
    {
        "source_sentence": "菩薩住此焰慧地時亦復如是，非餘安住下地菩薩能所映奪，所有慧光，",
        "translation": "Similarly, when the bodhisattva abides in this stage of blazing wisdom, it is likewise. It is not otherwise that the bodhisattva abiding in the lower stages can and cannot be overpowered by the light of wisdom emanating from his concentration.",
        "source": "T10n0287_003:0549a09_13"
    },
    {
        "source_sentence": "一切魔怨煩惱現行不能斷滅。",
        "translation": "All the demons, enemies, and afflictions that are presently active can't be eliminated.",
        "source": "T10n0287_003:0549a11_14"
    },
    {
        "source_sentence": "而此菩薩四攝事中同事偏多，十到彼岸中精進到彼岸而得增上，餘到彼岸隨力隨分非不修行。",
        "translation": "In these bodhisattvas, however, there are many colleagues in the four gathering tasks, and when they reach the other side of the ten perfections, their effort reaches the other side and attains increase, while the others reach the other side of the perfections according to their strength and part of their cultivation.",
        "source": "T10n0287_003:0549a12_15"
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "“O Children of Buddha!",
        "source": "T10n0287_003:0549a14_16"
    },
    {
        "source_sentence": "是名略說菩薩第四焰慧智地。",
        "translation": "This is called the fourth stage of the bodhisattva's burning wisdom and knowledge, which is briefly described.",
        "source": "T10n0287_003:0549a14_17"
    },
    {
        "source_sentence": "菩薩住此第四地中，受生多作蘇夜摩天王，有自在力善化有情，令其除滅薩迦邪見，",
        "translation": "In the fourth stage the enlightening being is born and becomes a celestial king called Sūryamātṛṣa. Having attained unimpeded supernormal knowledge, he can cause sentient beings to rid themselves of all false views concerning the existence of things pertaining to sentient beings.",
        "source": "T10n0287_003:0549a15_18"
    },
    {
        "source_sentence": "能令有情安住正見。",
        "translation": "It causes sentient beings to abide in right view.",
        "source": "T10n0287_003:0549a17_19"
    },
    {
        "source_sentence": "諸所作業或以布施、或以愛語、或以利行、或以同事，此等一切悉皆不離佛作意、法作意、僧伽作意、菩薩作意、菩薩行作意、到彼岸作意、諸地作意、佛力作意、無所畏作意、佛不共法作意，",
        "translation": "Whatever they do, whether with generosity, kind speech, benefit, or cooperation, all of them are not apart from the Buddha’s attention, the attention given to doctrine, the attention given to saṃgha, the attention given to enlightening beings, the attention given to practice by enlightening beings, the attention given to reaching the other shore, the attention given to the stage",
        "source": "T10n0287_003:0549a17_20"
    },
    {
        "source_sentence": "乃至不離一切行相勝妙相應一切智智作意。",
        "translation": "It doesn't part from the contemplation of omniscience and cognition associated with all the marks of all conditioned forms that are superior and marvelous.",
        "source": "T10n0287_003:0549a22_0"
    },
    {
        "source_sentence": "復作願言：『我當一切諸有情中為首、為勝、為殊勝、為妙、為微妙、為上、為無上、為導、為將、為帥，",
        "translation": "Again, they make the vow that all sentient beings will be leaders, preeminent, distinguished, marvelous, subtle, supreme, unsurpassed, unexcelled, guiding, general, and commander.",
        "source": "T10n0287_003:0549a23_0"
    },
    {
        "source_sentence": "乃至願得一切智智所依止處。』",
        "translation": "May I attain the place where omniscience and cognition are based?'",
        "source": "T10n0287_003:0549a25_1"
    },
    {
        "source_sentence": "若樂發起如是精進，由是精進，一剎那頃瞬息須臾，能證俱胝諸三摩地見俱胝佛。",
        "translation": "If someone delights in initiating such an effort, and because of that effort, they can realize the awakening of the awakening buddhas in a moment's time by seeing the awakening buddhas in the coarse samādhis in a moment's time.",
        "source": "T10n0287_003:0549a25_2"
    },
    {
        "source_sentence": "彼佛加持皆能解了，能動俱胝世界，能往俱胝佛剎，能照俱胝世界，能成熟俱胝有情，",
        "translation": "By the empowerment of those buddhas, they can all understand and comprehend. They can move the worlds of the ten directions, go to the buddha-lands of the ten directions, illumine the worlds of the ten directions, and develop the sentient beings of the ten directions.",
        "source": "T10n0287_003:0549a27_3"
    },
    {
        "source_sentence": "能住壽俱胝劫，於前後際能入俱胝劫，能正思擇俱胝法門，能示現俱胝身，",
        "translation": "They can abide for as long as the cosmic age of duration, and at the end of each cosmic age they can enter. They can correctly contemplate and analyze the cosmic principles and show their cosmic bodies.",
        "source": "T10n0287_003:0549a29_4"
    },
    {
        "source_sentence": "身身皆能現俱胝菩薩眷屬圍遶。",
        "translation": "Both body and body can manifest themselves surrounded by the bodhisattva's retinue of Kauṇḍinya.",
        "source": "T10n0287_003:0549b02_5"
    },
    {
        "source_sentence": "從此以上，是諸菩薩有願力者，由勝願故，所有遊戲，或身、或光明、或神通、或眼、或境界、或音聲、或行、或莊嚴、或勝解、或所作，",
        "translation": "“From here the enlightening beings have the power of vows: because of their overwhelming vow, they produce all kinds of play—some with bodies, some with light, some with supernormal powers, some with eyes, some with objects, some with sounds, some with gestures, some with adornments, some with conviction, some done by themselves.",
        "source": "T10n0287_003:0549b03_6"
    },
    {
        "source_sentence": "此等乃至爾所百千俱胝那庾多劫，不易可數。」",
        "translation": "It's not easy to count these or even those hundreds of thousands of koṭis of eons.",
        "source": "T10n0287_003:0549b05_7"
    },
    {
        "source_sentence": "「菩薩已淨第三地，　　次觀有情世法界、",
        "translation": "Enlightening beings, having purified the third stage, Next contemplate the reality realm of sentient beings.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　空、識、欲、色、無色界，　　勝大意樂能趣入。",
        "translation": "In the realms of emptiness, consciousness, desire, form, and formlessness, he's able to enter with superior great intention.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　菩薩纔登焰慧地，　　長如來家永不退；",
        "translation": "Enlightening beings have only just ascended the stage of Blazing Wisdom, Abiding forever in the house of buddhahood, never regressing.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　於佛、法、僧信不壞，　　觀法生滅無生起，",
        "translation": "Believing in the Buddha, Dharma, and Sangha that they are not destroyed, They contemplate the arising and ceasing of phenomena And do not give rise to anything.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　觀世成壞業有生，　　生死、涅槃剎等業；",
        "translation": "Observing the formation and disintegration of worldly action, there is birth: such [things] as birth-and-death and nirvana are actions.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　觀前後際無性盡，　　如是修行長佛家。",
        "translation": "Observing that the past and future are without essence and endless, such cultivation grows in the Buddha’s house.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　得是法已增慈愍，　　轉更勤修四念住；",
        "translation": "Having attained this teaching, they increase in kindness and compassion And become more diligent in cultivating the four abodes of mindfulness.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　身、受、心、法內外觀，　　世間貪愛皆除遣。",
        "translation": "Body, sensation, mind, and internal appearance of phenomena— All worldly desires and cravings are removed.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　菩薩修治四正斷，　　惡法除滅善增長；",
        "translation": "Enlightening beings cultivate the fourfold correct elimination, Removing evil and extinguishing virtue, increasing goodness.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　善修神足及根、力，　　七等覺支、八聖道。",
        "translation": "They skillfully cultivate spiritual abilities, faculties, and powers, the seven factors of virtual enlightenment, and the eight noble paths.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　為度有情修覺分，　　本願扶持慈悲首；",
        "translation": "In order to liberate sentient beings they cultivate the factors of enlightenment, Originally vowing to support their heads with compassion.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　求一切智嚴佛土，　　亦緣如來十種力，",
        "translation": "Seeking the Buddha-lands of omniscience and adornment, They also rely on the enlightened’s ten powers:",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　四無所畏不共法，　　殊特相好深美音；",
        "translation": "The fourth is fearless and unique, with distinctive characteristics and profound sounds.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　亦求妙道解脫處，　　尋大方便修覺分。",
        "translation": "They also seek the abode of liberation of the wondrous path, seeking great skillful means to cultivate the factors of awakening.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　身見為首六十二，　　我及我所無量種；",
        "translation": "The view of a self is the first with sixty-two. Self and that which belongs to self are unlimited in number.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　蘊、界、處等諸取著，　　第四地中悉遠離；",
        "translation": "In the fourth stage they are completely free of such attachments as clusters, realms, places, and so on.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　如來所訶煩惱雜，　　無義之業皆捨離。",
        "translation": "The afflictions of the Tathāgata's rebuke are mixed, and meaningless actions are all abandoned.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　諸佛所讚清淨業，　　為度有情無不作；",
        "translation": "Pure action praised by the Buddhas, No one fails to do anything for the liberation of sentient beings.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　菩薩勤修不懈怠，　　即得十心皆具足。",
        "translation": "Enlightening beings diligently cultivate practice without laziness, And immediately attain the fulfillment of all ten states of mind.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　專求佛道無厭倦，　　希受灌頂度有情；",
        "translation": "They seek the path of enlightenment tirelessly, Wishing to receive coronation and liberate sentient beings.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　恭敬尊德修法行，　　知恩易悔無慍暴。",
        "translation": "Respectful and honored, they cultivate the practice of the Dharma, knowing kindness and ease of repentance without being stingy or cruel.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　捨慢離諂心調柔，　　轉更精勤不退轉；",
        "translation": "Rejecting conceit, free from hypocrisy and deceitfulness, the enlightening being’s mind is tempered, Increasing effort without retreating.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　又其意樂界清淨，　　增上意樂永不失。",
        "translation": "Furthermore, the realm of aspiration is pure, Increasing aspiration never loses.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　勝解決定善根增，　　疑網垢濁悉永離；",
        "translation": "The roots of goodness of resolve increase, And the net of doubt and confusion are forever removed.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　無疑現前得喜安，　　蒙佛加持無量志。",
        "translation": "Without doubt, they'll attain joy and peace in the present, and receive the Buddha's blessing with measureless aspirations.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　菩薩住此焰慧地，　　供那庾多無量佛；",
        "translation": "Enlightening beings dwelling in this stage of blazing knowledge And serve countless buddhas.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　聽聞正法亦出家，　　不可映奪如金飾。",
        "translation": "Hearing and hearing the right teaching, they also leave home, which can't be mirrored or taken away like a gold ornament.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　菩薩住此具功德，　　以智方便修行道；",
        "translation": "Enlightening beings in this abode are endowed with virtue, Cultivating the path of knowledge and skill in means.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　不為眾魔心退轉，　　譬如妙寶無能壞。",
        "translation": "They don't retreat because of the minds of demons, like a wonderful treasure that can't be destroyed.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　多作夜摩天中王，　　於法自在眾所尊；",
        "translation": "He was often the king of the Yama heavens, Most honored by all beings because he mastered the teaching.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　普化群生除惡見，　　專求佛智修善業。",
        "translation": "Universally transforming all sentient beings, getting rid of bad views, They exclusively seek buddha-knowledge and cultivate good works.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　菩薩勤加精進力，　　獲等持等俱胝數；",
        "translation": "Enlightening beings diligently apply the power of energy And attain equanimity, equal to the number of koṭis of buddhas.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　若以願智力所為，　　過於此數無能算。",
        "translation": "If it's done by the power of the knowledge of vows, there's nothing beyond this number that can be counted.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　如是菩薩第四地，　　所行精進微妙道；",
        "translation": "Such is the subtle path of enlightening beings’ practice in the fourth stage:",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "　功德義智共相應，　　我為佛子已宣說。」",
        "translation": "Together with the knowledge of merit and meaning, I've explained it for the sake of the Buddha-child.",
        "source": "T10n0287_003:0549b06_8"
    },
    {
        "source_sentence": "爾時金剛藏菩薩，欲重宣此義而說頌言：佛說十地經卷第三",
        "translation": "It was then that the bodhisattva Vajragarbha, wanting to elaborate on the meaning of this further, spoke these verses:",
        "source": "T10n0287_003:0549b06_8"
    }
]