[
    {
        "source_sentence": "佛說十地經卷第六",
        "translation": "Foshuo shidi jing, vol. 6",
        "source": "T10n0287_006:0559a02_0"
    },
    {
        "source_sentence": "大唐于闐三藏沙門尸羅達摩",
        "translation": "Śīlabhadradharma, the great Tang monk of the Tripiṭaka of Udyāna",
        "source": "T10n0287_006:0559a04_0"
    },
    {
        "source_sentence": "於北庭龍興寺譯",
        "translation": "translated at Yongxing Temple in the northern court",
        "source": "T10n0287_006:0559a05_0"
    },
    {
        "source_sentence": "菩薩不動地第八",
        "translation": "The eighth stage of the bodhisattva's immovable state",
        "source": "T10n0287_006:0559a06_0"
    },
    {
        "source_sentence": "　是時天王及天眾，　　聞此勝行皆歡喜；",
        "translation": "The kings of the gods and the hosts of gods then heard this phenomenal practice, all rejoicing.",
        "source": "T10n0287_006:0559a07_0"
    },
    {
        "source_sentence": "　為欲供養於如來，　　及以無量大菩薩。",
        "translation": "They want to make offerings to the Tathāgata and immeasurable great bodhisattvas.",
        "source": "T10n0287_006:0559a08_0"
    },
    {
        "source_sentence": "　雨妙幡花及幢蓋，　　香鬘、瓔珞與寶衣；",
        "translation": "It rained exquisite banners, flowers and canopies, Fragrant garlands, necklaces, and precious robes.",
        "source": "T10n0287_006:0559a09_0"
    },
    {
        "source_sentence": "　無量無邊千萬種，　　悉以摩尼作嚴飾。",
        "translation": "Measureless, boundless, and thousands of myriadstical species They are all adorned with jewels.",
        "source": "T10n0287_006:0559a10_0"
    },
    {
        "source_sentence": "　天女同時奏天樂，　　普發種種妙音聲；",
        "translation": "The goddesses all simultaneously played celestial music, Producing various beautiful sounds everywhere.",
        "source": "T10n0287_006:0559a11_0"
    },
    {
        "source_sentence": "　供養於佛并菩薩，　　共作是言而讚歎：",
        "translation": "Making offerings to the Buddha and enlightening beings, They all praised them with these words:",
        "source": "T10n0287_006:0559a12_0"
    },
    {
        "source_sentence": "「一切見者兩足尊，　　哀愍有情現神力；",
        "translation": "All the visions of the two-legged honored One, Compassionate to sentient beings, manifest spiritual powers.",
        "source": "T10n0287_006:0559a13_0"
    },
    {
        "source_sentence": "　令此種種諸天樂，　　普發妙音咸得聞。",
        "translation": "Causing these various celestial musics To universally produce subtle sounds, they can all hear them.",
        "source": "T10n0287_006:0559a14_0"
    },
    {
        "source_sentence": "　於一毛端百千億，　　那庾多國微塵數；",
        "translation": "At the tip of a hair they are as numerous as atoms in ten thousand myriads of buddha-lands.",
        "source": "T10n0287_006:0559a15_0"
    },
    {
        "source_sentence": "　如是無量諸如來，　　於中安坐說妙法。",
        "translation": "Such are the innumerable tathāgatas In which they sit and explain the wondrous Dharma.",
        "source": "T10n0287_006:0559a16_0"
    },
    {
        "source_sentence": "　一毛孔內無量剎，　　各有四洲及大海；",
        "translation": "In each hair pore are infinite lands, Each with four continents and a great ocean.",
        "source": "T10n0287_006:0559a17_0"
    },
    {
        "source_sentence": "　須彌、鐵圍亦復然，　　悉見在中無迫隘。",
        "translation": "Mount Sumeru and the ring of iron are likewise; All can be seen within, without crowding or crowding.",
        "source": "T10n0287_006:0559a18_0"
    },
    {
        "source_sentence": "　一毛端處有六趣，　　三種惡道及人、天、",
        "translation": "On a hairtip there are six destinies: the three evil destinies, humans, gods, and heavenly beings.",
        "source": "T10n0287_006:0559a19_0"
    },
    {
        "source_sentence": "　諸龍、神眾、阿素洛，　　各隨自業受果報。",
        "translation": "The dragons, gods, and asuras each received the results of their actions according to their own actions.",
        "source": "T10n0287_006:0559a20_0"
    },
    {
        "source_sentence": "　於彼一切剎土中，　　悉有如來演妙法，",
        "translation": "In all those buddha-lands Is the Buddha’s teaching of truth.",
        "source": "T10n0287_006:0559a21_0"
    },
    {
        "source_sentence": "　隨順一切有情心，　　為轉最上淨法輪。",
        "translation": "Following the minds of all sentient beings, they turn the supremely pure wheel of the Dharma.",
        "source": "T10n0287_006:0559a22_0"
    },
    {
        "source_sentence": "　剎中種種有情身，　　身中復有種種剎，",
        "translation": "In each buddha there are various bodies of sentient beings, And within each body there are also various buddhas:",
        "source": "T10n0287_006:0559a23_0"
    },
    {
        "source_sentence": "　人天諸趣各各異，　　佛悉知已為說法。",
        "translation": "The realms of humans and gods are each different: The Buddha has taught them the Dharma, knowing all.",
        "source": "T10n0287_006:0559a24_0"
    },
    {
        "source_sentence": "　大剎隨欲變為小，　　小剎隨欲變為大；",
        "translation": "A large blaze follows desire and becomes small; a small blaze follows desire and becomes big.",
        "source": "T10n0287_006:0559a25_0"
    },
    {
        "source_sentence": "　如是神通無有量，　　世間共說不能盡。」",
        "translation": "Such supernormal abilities are immeasurable, and the world can't explain them all.",
        "source": "T10n0287_006:0559a26_0"
    },
    {
        "source_sentence": "　普發此等妙音聲，　　稱讚如來功德已；",
        "translation": "Producing these beautiful sounds, they praised the virtues of the enlightened.",
        "source": "T10n0287_006:0559a27_0"
    },
    {
        "source_sentence": "　眾會歡喜默然住，　　一心瞻仰欲聽法。",
        "translation": "The assembly was joyful and remained silent, singlemindedly gazing to hear the teaching.",
        "source": "T10n0287_006:0559a28_0"
    },
    {
        "source_sentence": "　時解脫月復請言：　　「今此眾會皆寂靜，",
        "translation": "At that moment, the moon of liberation asked further:",
        "source": "T10n0287_006:0559a29_0"
    },
    {
        "source_sentence": "　願說隨次之所入，　　第八地中之行相。」",
        "translation": "May I explain what's entered in order and the eighth ground's defining activities.",
        "source": "T10n0287_006:0559b01_0"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩告眾菩薩言：「唯諸佛子！",
        "translation": "It was then that the Vajragarbha Bodhisattva addressed the other bodhisattvas, saying, Only, heirs of the Buddha!",
        "source": "T10n0287_006:0559b02_0"
    },
    {
        "source_sentence": "若是菩薩，於七地中善修決擇，以慧方便善淨諸道，善集資糧，善結大願，",
        "translation": "Suppose a bodhisattva well cultivates discernment in the seventh ground, purifies the paths with wisdom and skillful means, well accumulates necessities, and well concludes great vows.",
        "source": "T10n0287_006:0559b02_1"
    },
    {
        "source_sentence": "善蒙安住，如來加持，得自善根力所持性，隨順如來力、無所畏、不共佛法作意而行；",
        "translation": "They are well supported by the empowerment of buddhas. They attain the nature of being sustained by the power of their own roots of goodness, and act in accord with the power of buddhas, fearless, uncommon to all enlightened ones.",
        "source": "T10n0287_006:0559b04_2"
    },
    {
        "source_sentence": "善淨增上意樂思察，由福智力之所涌起；",
        "translation": "The higher aspiration for goodness and purity is developed by the power of virtue and knowledge.",
        "source": "T10n0287_006:0559b06_3"
    },
    {
        "source_sentence": "以大慈悲於諸有情，不捨加行隨於無量智道而行；",
        "translation": "Because of great compassion for sentient beings they do not give up applied practices and follow the path of infinite knowledge.",
        "source": "T10n0287_006:0559b07_4"
    },
    {
        "source_sentence": "入一切法本來無生、無起、無相、無成、無壞、無斷盡、無流轉、無止息性為性；",
        "translation": "Its nature is that all things are originally without origination, without arising, without signs, without formation, without disintegration, without annihilation, without transmigration, without flowing, and without quiescence.",
        "source": "T10n0287_006:0559b08_5"
    },
    {
        "source_sentence": "初、中、後位皆悉平等，以真如中無分別故入一切智。",
        "translation": "The first, middle, and latter stages are all equal because there's no discrimination in true reality and so they enter omniscience.",
        "source": "T10n0287_006:0559b10_6"
    },
    {
        "source_sentence": "即此菩薩，遠離一切心、意及識分別妄想無所執著，與虛空等顯然入性，",
        "translation": "That is, these bodhisattvas are free of all discriminating deluded conceptions of mind, thought, and consciousness, have no attachment whatsoever, and share the same manifest entry-entry pattern as space.",
        "source": "T10n0287_006:0559b11_7"
    },
    {
        "source_sentence": "名為已得無生法忍。",
        "translation": "It's called having attained the forbearance of the nonarising of dharmas.",
        "source": "T10n0287_006:0559b13_8"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559b13_9"
    },
    {
        "source_sentence": "菩薩成就如是無生法忍，纔證菩薩不動地故，得甚深住難可了知，同無差別離一切相，",
        "translation": "The enlightening beings attain this tolerance of the nonorigination of all things because they have only attained the stage of Immutable. Having attained such a profound abode, it is difficult to know:",
        "source": "T10n0287_006:0559b13_10"
    },
    {
        "source_sentence": "止息一切想之執著無量無邊，以諸聲聞及以獨覺不可映奪寂靜現前。",
        "translation": "He stops the attachment of all conceptions that are immeasurable and limitless because śrāvakas and solitary realizers can't be overpowered by the manifestation of quiescence.",
        "source": "T10n0287_006:0559b15_11"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559b17_12"
    },
    {
        "source_sentence": "譬如苾芻，具足神通得心自在，漸入第九想受滅定，一切動亂憶想分別悉皆止息。",
        "translation": "It's like a monk who possesses supernormal abilities and attains mastery over his mind and gradually enters the ninth concentration of perception, feeling, cessation, and concentration, where all agitation, recollection, and discrimination cease.",
        "source": "T10n0287_006:0559b17_13"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559b19_14"
    },
    {
        "source_sentence": "菩薩纔得不動地已亦復如是，離諸功用任運至得無功用性，遠離一切身、語、意務安住異熟。",
        "translation": "A bodhisattva who has just attained the stage of immovability is likewise, free of exertion and at ease to attain the nature of effortlessness, far removed from all bodily, verbal, and mental functions, and abiding in retribution.",
        "source": "T10n0287_006:0559b19_15"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559b21_16"
    },
    {
        "source_sentence": "譬如有人夢見自身墮在大河，為欲渡故發大勇猛起大翹勤，以大勇猛起翹勤故，",
        "translation": "Suppose a man dreams that he himself has fallen into a great river and, in order to cross it, arouses great courage and initiates great effort. Because of this great courageousness, he initiates such effort.",
        "source": "T10n0287_006:0559b21_17"
    },
    {
        "source_sentence": "即便寐寤；",
        "translation": "He then fell asleep.",
        "source": "T10n0287_006:0559b23_18"
    },
    {
        "source_sentence": "既寤寐已，所作一切勇猛遽務皆悉休息。",
        "translation": "Having fallen asleep, he rests from all his bold and arduous efforts.",
        "source": "T10n0287_006:0559b23_19"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559b24_20"
    },
    {
        "source_sentence": "菩薩亦復如是，見有情聚墮在煩惱四大瀑流，為欲救度故，發大勇猛起大翹勤，",
        "translation": "In much the same way, enlightening beings see groups of sentient beings falling into the four great floods of afflictions: in order to rescue them they develop great courage and undertake great effort.",
        "source": "T10n0287_006:0559b24_21"
    },
    {
        "source_sentence": "由以發起大精進故，纔至菩薩不動地已，一切功用靡不皆息；",
        "translation": "Because of the arousal of great zeal, all effort ceases as soon as one reaches the unshakable stage of enlightening beings.",
        "source": "T10n0287_006:0559b26_22"
    },
    {
        "source_sentence": "即此菩薩所有一切二取現行，或相現行不復影現。",
        "translation": "That is, all the two kinds of grasping presently manifested by this bodhisattva may be manifested in form and no longer appear in shadow.",
        "source": "T10n0287_006:0559b28_23"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559b29_24"
    },
    {
        "source_sentence": "譬如天仙生在梵世，欲界煩惱終不現行。",
        "translation": "It's like a heavenly sage born in the Brahma world, whose afflictions in the desire realm never appear.",
        "source": "T10n0287_006:0559b29_25"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559c01_26"
    },
    {
        "source_sentence": "菩薩住此不動地時亦復如是，一切心、意及識現行不復現起。",
        "translation": "When the bodhisattva abides in this immovable stage, it's likewise when all minds, thoughts, and consciousnesses are present and don't arise again.",
        "source": "T10n0287_006:0559c01_27"
    },
    {
        "source_sentence": "又此乃至諸佛現行，菩提現行，菩薩現行，涅槃現行尚不現起，況復發起世間現行？",
        "translation": "Furthermore, these are the manifestations of buddhas, the manifestations of enlightenment, the manifestations of bodhisattvas, and the manifestations of nirvāṇa that don't yet arise, so why would they give rise to worldly manifestations?",
        "source": "T10n0287_006:0559c02_28"
    },
    {
        "source_sentence": "「復次，佛子！",
        "translation": "“Furthermore, Buddha-child!",
        "source": "T10n0287_006:0559c05_0"
    },
    {
        "source_sentence": "菩薩如是行此第八不動地時，安住本願力所持已，即於如是法門駛流，",
        "translation": "“When enlightening beings practice thus in this eighth stage of Immovability, having settled themselves under the power of their past vows, they instantly go along with these teachings:",
        "source": "T10n0287_006:0559c05_1"
    },
    {
        "source_sentence": "蒙諸如來覺悟勸導；",
        "translation": "They were led and inspired by the enlightened ones.",
        "source": "T10n0287_006:0559c06_2"
    },
    {
        "source_sentence": "是時諸佛授與、引發如來妙智，作如是言：『善哉，善哉！",
        "translation": "The buddhas then bestowed and induced the Tathāgata's marvelous wisdom, saying, 'Good, good!'",
        "source": "T10n0287_006:0559c07_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0287_006:0559c08_4"
    },
    {
        "source_sentence": "此即隨順一切佛法勝義之忍。",
        "translation": "This is the tolerance that follows all the buddha-teachings of the ultimate truth.",
        "source": "T10n0287_006:0559c08_5"
    },
    {
        "source_sentence": "然善男子！",
        "translation": "Still, good man!",
        "source": "T10n0287_006:0559c09_6"
    },
    {
        "source_sentence": "我等諸佛，所有十力、四無所畏、十八不共佛法自在，汝今未得，當為成就佛法自在，",
        "translation": "We buddhas have the ten powers, the four fearlessnesses, and the self-dependence of the eighteen unique qualities of buddhahood that you have not yet attained. You will attain the self-dependence of the buddha-dharma in order to perfect it.",
        "source": "T10n0287_006:0559c09_7"
    },
    {
        "source_sentence": "應起精進，於此忍門勿復棄捨。",
        "translation": "You should give rise to effort and not abandon this approach of forbearance again.",
        "source": "T10n0287_006:0559c11_8"
    },
    {
        "source_sentence": "又善男子！",
        "translation": "Again, good man!",
        "source": "T10n0287_006:0559c12_9"
    },
    {
        "source_sentence": "汝雖得是寂滅解脫，然彼一切異生種類未得寂靜，未能寂滅，常順異異煩惱現行，",
        "translation": "Although you have attained this peaceful liberation, all the different kinds of ordinary people who have not yet attained peace and are unable to attain it will always be accompanied by various afflictions that arise.",
        "source": "T10n0287_006:0559c12_10"
    },
    {
        "source_sentence": "種種尋伺之所侵害；",
        "translation": "They are stifled by various kinds of discursive examination.",
        "source": "T10n0287_006:0559c14_11"
    },
    {
        "source_sentence": "汝當愍念。",
        "translation": "You must have pity for him.",
        "source": "T10n0287_006:0559c14_12"
    },
    {
        "source_sentence": "又善男子！",
        "translation": "Again, good man!",
        "source": "T10n0287_006:0559c15_0"
    },
    {
        "source_sentence": "汝當憶念本所誓願，謂令有情，皆得義利及不思議智慧之門。",
        "translation": "You should remember what you originally vowed, which is to cause sentient beings to attain meaning and benefit and inconceivable wisdom.",
        "source": "T10n0287_006:0559c15_1"
    },
    {
        "source_sentence": "又善男子！",
        "translation": "Again, good man!",
        "source": "T10n0287_006:0559c16_2"
    },
    {
        "source_sentence": "一切諸法法性如是，若佛出世或不出世法界常住終無變易，非但以此諸佛得現一切聲聞及諸獨覺，",
        "translation": "The Dharma-nature of all dharmas is like this: whether buddhas appear in the world or do not appear in the world, they always abide in the realm of reality and ultimately remain unchanging. It is not just because of these buddhas that they can manifest themselves to all listeners and self-enlightened ones.",
        "source": "T10n0287_006:0559c16_3"
    },
    {
        "source_sentence": "亦證此法無分別法性。",
        "translation": "They also realize that this teaching has no discriminating Dharma nature.",
        "source": "T10n0287_006:0559c19_4"
    },
    {
        "source_sentence": "又善男子！",
        "translation": "Again, good man!",
        "source": "T10n0287_006:0559c19_5"
    },
    {
        "source_sentence": "汝觀我等佛身無量、智慧無量、剎土無量、光輪無量、智所引無量、清淨音韻亦無有量，",
        "translation": "\\",
        "source": "T10n0287_006:0559c20_0"
    },
    {
        "source_sentence": "汝今亦應引發此事。",
        "translation": "Now, you should also give rise to this matter.",
        "source": "T10n0287_006:0559c21_1"
    },
    {
        "source_sentence": "又善男子！",
        "translation": "Again, good man!",
        "source": "T10n0287_006:0559c22_2"
    },
    {
        "source_sentence": "汝今唯得此一法明，謂諸法中無分別慧。",
        "translation": "Only this one thing you have now attained is insight, which is the absence of discriminating wisdom in all dharmas.",
        "source": "T10n0287_006:0559c22_3"
    },
    {
        "source_sentence": "然善男子！",
        "translation": "Still, good man!",
        "source": "T10n0287_006:0559c23_4"
    },
    {
        "source_sentence": "如是法明，諸佛如來無邊所行、無邊所作、無邊所繫，為欲證彼當起引發。",
        "translation": "Thus, this teaching explains that the buddhas and tathāgatas are limitlessly practiced, limitlessly created, and limitlessly bound, and they will give rise to it in order to realize it.",
        "source": "T10n0287_006:0559c23_5"
    },
    {
        "source_sentence": "又善男子！",
        "translation": "Again, good man!",
        "source": "T10n0287_006:0559c25_6"
    },
    {
        "source_sentence": "汝觀十方無量剎土、無量有情、無量諸法種種差別，應是一切如理通達。』",
        "translation": "Observe the various distinctions of measureless buddha-lands, measureless sentient beings, and measureless dharmas in the ten directions, which should all be comprehended according to principle.'",
        "source": "T10n0287_006:0559c25_7"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559c27_8"
    },
    {
        "source_sentence": "如是諸佛世尊，覺悟勸導此地菩薩，授與此等無量無邊引發智門，令其無智差別故，",
        "translation": "“In this way, the Buddhas and world-honored ones awaken enlightening beings who are guided by bodhisattvas of this stage and give them these boundless, immeasurable, limitless doors of knowledge, so that they may have no distinctions in knowledge.",
        "source": "T10n0287_006:0559c27_9"
    },
    {
        "source_sentence": "能成如是引發之業。",
        "translation": "He's able to accomplish such actions that are induced.",
        "source": "T10n0287_006:0559c29_10"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0559c29_11"
    },
    {
        "source_sentence": "我今告汝得解，若時諸佛不垂誨示，令此菩薩入於如是引發門者，當時即入究竟涅槃，",
        "translation": "I will now tell you how to attain understanding. If the buddhas do not admonish this bodhisattva and cause him to enter such an initiating approach, he will enter final nirvana at that very moment.",
        "source": "T10n0287_006:0560a01_0"
    },
    {
        "source_sentence": "休息一切利有情業。",
        "translation": "He stops all the activities that benefit sentient beings.",
        "source": "T10n0287_006:0560a03_0"
    },
    {
        "source_sentence": "以是諸佛授與如是引發無量智慧業故，此地菩薩於一念頃所引智業，此比於前從初發心，",
        "translation": "Because these buddhas bestow upon them such immeasurable acts of wisdom, the enlightening beings in this stage are likewise directed by knowledge in a single thought.",
        "source": "T10n0287_006:0560a03_1"
    },
    {
        "source_sentence": "乃至七地所修諸行，百倍為勝，千倍、百千倍、俱胝倍、百俱胝倍、千俱胝倍、百千俱胝倍、百千俱胝那庾多倍為勝，",
        "translation": "The practices cultivated in the seventh stage are one hundredfold superior; a thousandfold, a hundred thousandfold, a hundred thousandfold, a hundred thousandfold, a hundred thousandfold, and a hundred thousandfold.",
        "source": "T10n0287_006:0560a05_2"
    },
    {
        "source_sentence": "算數計喻乃至烏波尼殺曇倍，亦復為勝。",
        "translation": "It's also superior when it's counted, calculated, and metaphorized up to the point where it's multiplied by Upaniṣadharma.",
        "source": "T10n0287_006:0560a08_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T10n0287_006:0560a09_0"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0560a09_1"
    },
    {
        "source_sentence": "菩薩先以一身引發諸行，今乘此地以依無量分身差別修菩薩行，以能引發無量音聲，",
        "translation": "“Earlier enlightening beings produced practices by one body, but now in this buddha-field they develop practices of enlightening beings based on the differentiation of infinite bodies and are able to produce infinite sounds.",
        "source": "T10n0287_006:0560a09_2"
    },
    {
        "source_sentence": "以能引發無量智慧，以能引發無量受生，以能嚴淨無量佛剎，以能成熟無量有情，",
        "translation": "Because they can produce infinite knowledge, because they can produce infinite births, because they can adorn and purify infinite buddha-lands, and because they can develop infinite sentient beings.",
        "source": "T10n0287_006:0560a11_3"
    },
    {
        "source_sentence": "以悉承事無量諸佛，以悟無量法之理趣，以起無量神通勢力，以依無量眾會差別，",
        "translation": "By serving infinite buddhas, by awakening to the principles of infinite teachings, by producing infinite mystic powers, by relying on infinite distinctions in congregations.",
        "source": "T10n0287_006:0560a13_4"
    },
    {
        "source_sentence": "以無量行身、語、意業一切菩薩正行之力，皆悉成滿，以不動故。",
        "translation": "Because of the immeasurable physical, verbal, and mental actions of all bodhisattvas' correct practices, they are all fulfilled because they don't move.",
        "source": "T10n0287_006:0560a15_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0560a16_6"
    },
    {
        "source_sentence": "譬如海船未至大海，以有功用排牽而去，若至海已則無功用任運而行，",
        "translation": "It is like the case of a ship that, before reaching the great ocean, pulls away with effort and leaves; but when it has reached the great ocean, it moves at will without effort.",
        "source": "T10n0287_006:0560a16_7"
    },
    {
        "source_sentence": "以於大海風輪飄汎，一日所行，此比於前有功用時，設經百歲不能爾所無量而至。",
        "translation": "It's because the wind whirls in the great ocean and it travels for a day, which is faster than the previous one when there was effort, and even if it were to go for a hundred years, it wouldn't reach such an immeasurable amount.",
        "source": "T10n0287_006:0560a18_8"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0560a20_9"
    },
    {
        "source_sentence": "菩薩亦復如是，已善積集善根資糧修證大乘，隨至菩薩正行大海，一須臾頃以無功用智入一切智智，",
        "translation": "In the same way, enlightening beings who have well accumulated provisions of roots of goodness and practiced the realization of the Great Vehicle proceed to the great ocean of right practice of enlightening beings in a moment’s time: by means of effortless knowledge they enter omniscience.",
        "source": "T10n0287_006:0560a20_10"
    },
    {
        "source_sentence": "此比於前有功用業，經百千劫不能爾所無量而至。",
        "translation": "This is compared to the previous karma of exerting effort that couldn't reach such an immeasurable amount for hundreds of thousands of eons.",
        "source": "T10n0287_006:0560a22_11"
    },
    {
        "source_sentence": "「唯諸佛子！",
        "translation": "“O Children of Buddha!",
        "source": "T10n0287_006:0560a23_12"
    },
    {
        "source_sentence": "菩薩已至於第八地，以由廣大方便善巧，妙智所引無功用行，菩薩正慧觀察一切智智之時，",
        "translation": "“When the enlightening beings of the eighth stage, having developed great skill in means and knowledge, develop effortless practice by means of extensive knowledge, the enlightening beings contemplate omniscience with correct wisdom.",
        "source": "T10n0287_006:0560a24_13"
    },
    {
        "source_sentence": "觀世界成觀世界壞，如世間成皆能了知；",
        "translation": "Observing worlds becoming, and observing worlds decaying, they are able to know all as the worlds become.",
        "source": "T10n0287_006:0560a26_14"
    },
    {
        "source_sentence": "如世間壞皆能了知；",
        "translation": "They can know the disintegration of worlds as they are.",
        "source": "T10n0287_006:0560a27_15"
    },
    {
        "source_sentence": "由何業集世間成就皆能了知；",
        "translation": "By means of what actions are they accumulated and accomplished in the world? They can know.",
        "source": "T10n0287_006:0560a27_16"
    },
    {
        "source_sentence": "由何業盡世間壞滅皆能了知；",
        "translation": "By means of what actions are the worlds destroyed and disintegrated? they can all know.",
        "source": "T10n0287_006:0560a28_17"
    },
    {
        "source_sentence": "幾時世界成皆能了知；",
        "translation": "At how many moments are the worlds formed? they can all know.",
        "source": "T10n0287_006:0560a29_0"
    },
    {
        "source_sentence": "幾時世界壞皆能了知；",
        "translation": "They can know the time of the disintegration of worlds.",
        "source": "T10n0287_006:0560a29_1"
    },
    {
        "source_sentence": "幾時世界成已住皆能了知；",
        "translation": "At how many moments are the worlds formed and already existing? they can all know.",
        "source": "T10n0287_006:0560b01_2"
    },
    {
        "source_sentence": "幾時世界壞已住皆能了知；",
        "translation": "They can know the time periods of the destruction of worlds as well as their existences.",
        "source": "T10n0287_006:0560b01_3"
    },
    {
        "source_sentence": "又知地界小大無量及差別相；",
        "translation": "They also know the small and the great of the earth realm are immeasurable, as well as their distinctive characteristics.",
        "source": "T10n0287_006:0560b02_4"
    },
    {
        "source_sentence": "了知水界小大無量及差別相；",
        "translation": "They know the water element as small and large, immeasurable and differentiating characteristics.",
        "source": "T10n0287_006:0560b03_5"
    },
    {
        "source_sentence": "了知火界小大無量及差別相；",
        "translation": "They know the realm of fire as small and large, immeasurable and differentiating characteristics.",
        "source": "T10n0287_006:0560b03_6"
    },
    {
        "source_sentence": "了知風界小大無量及差別相；",
        "translation": "They know the realm of wind as small and large, immeasurable and differentiating characteristics.",
        "source": "T10n0287_006:0560b04_7"
    },
    {
        "source_sentence": "又知微塵細相、麁相、無量相及差別相；",
        "translation": "They also know the subtle characteristics of minute particles, gross characteristics, infinite characteristics, and differentiating characteristics.",
        "source": "T10n0287_006:0560b05_8"
    },
    {
        "source_sentence": "於何世界所有若干微塵積聚，微塵差別皆能了知；",
        "translation": "In which worlds are the various tiny accumulations of atoms, and they can know the distinctions of each tiny particle?",
        "source": "T10n0287_006:0560b06_9"
    },
    {
        "source_sentence": "於何世界所有若干地界微塵皆能了知；",
        "translation": "In which worlds are they able to know all the various atoms of earth?",
        "source": "T10n0287_006:0560b07_10"
    },
    {
        "source_sentence": "所有若干水界微塵皆能了知；",
        "translation": "They can also perceive all the various atoms in the watery realm.",
        "source": "T10n0287_006:0560b08_11"
    },
    {
        "source_sentence": "所有若干火界微塵皆能了知；",
        "translation": "They can perceive all the various atoms in the realm of fire, as many as atoms in a buddha-land.",
        "source": "T10n0287_006:0560b08_12"
    },
    {
        "source_sentence": "所有若干風界微塵皆能了知；",
        "translation": "They can also perceive all the various winds and particles in the sky.",
        "source": "T10n0287_006:0560b09_13"
    },
    {
        "source_sentence": "所有若干有情界微塵皆能了知；",
        "translation": "They can know all the number of sentient beings there are, as many as atoms in a universe.",
        "source": "T10n0287_006:0560b10_14"
    },
    {
        "source_sentence": "所有若干剎土聚微塵皆能了知。",
        "translation": "He's able to know the tiny particles of all the various buddha-lands that exist.",
        "source": "T10n0287_006:0560b11_15"
    },
    {
        "source_sentence": "又此菩薩，知有情身麁相、細相、身差別相；",
        "translation": "Furthermore, these enlightening beings know the gross and subtle characteristics of sentient beings’ bodies as well as the distinctive characteristics of their bodies.",
        "source": "T10n0287_006:0560b11_16"
    },
    {
        "source_sentence": "知依那洛迦身有若干微塵；",
        "translation": "They know that there are various tiny particles of dust in the body of Nāraka.",
        "source": "T10n0287_006:0560b12_17"
    },
    {
        "source_sentence": "知依傍生身有若干微塵；",
        "translation": "They know that there are various tiny specks of dust found in the bodies of animals.",
        "source": "T10n0287_006:0560b13_18"
    },
    {
        "source_sentence": "知依鬼界身有若干微塵；",
        "translation": "They know that there are various tiny specks of dust found in the bodies of the realm of ghosts.",
        "source": "T10n0287_006:0560b14_0"
    },
    {
        "source_sentence": "知依阿素洛世間身有若干微塵；",
        "translation": "They know that there are various tiny particles of dust in the body of the asuras.",
        "source": "T10n0287_006:0560b14_1"
    },
    {
        "source_sentence": "知依天世間身有若干微塵；",
        "translation": "They know that there are various atoms in the celestial bodies of sentient beings.",
        "source": "T10n0287_006:0560b15_2"
    },
    {
        "source_sentence": "知依人世間身有若干微塵。",
        "translation": "He knows that there are certain tiny dust motes in the body of humans and worldly beings.",
        "source": "T10n0287_006:0560b16_0"
    },
    {
        "source_sentence": "菩薩如是，趣入微塵差別智已，知欲界成、知色界成、知無色界成，知欲界壞、知色界壞、知無色界壞；",
        "translation": "“Thus do enlightening beings, having entered into the differentiating knowledge of the tiny particles of defilement, know formation in the realm of desire, formation in the realm of form, formation in the formless realm, disintegration in the realm of desire, disintegration in the form realm, and disintegration in the formless realm.",
        "source": "T10n0287_006:0560b16_1"
    },
    {
        "source_sentence": "能知欲界小大無量及差別相；",
        "translation": "They can know the small and the great in the realm of desire are immeasurable, as well as their distinctive characteristics.",
        "source": "T10n0287_006:0560b18_2"
    },
    {
        "source_sentence": "能知色界小大無量及差別相；",
        "translation": "They can know the form realm as small and large, immeasurable and differentiating characteristics.",
        "source": "T10n0287_006:0560b19_3"
    },
    {
        "source_sentence": "能知無色界小大無量及差別相。",
        "translation": "They can know that the formless realm is small, large, immeasurable, and has distinctive characteristics.",
        "source": "T10n0287_006:0560b20_4"
    },
    {
        "source_sentence": "了知三界，於觀三界隨行智中，復善引發智光明已，於諸有情身差別智已得善巧，",
        "translation": "Knowing the three realms, he observes the knowledge of the three realms’ derivative aspects. Having also produced the light of knowledge, he knows the differentiations in the bodies of sentient beings and has mastered skillful means.",
        "source": "T10n0287_006:0560b21_5"
    },
    {
        "source_sentence": "於身分別智得善巧，則於示現受生引慧，此菩薩隨有情類受生差別及身成就，",
        "translation": "When they attain skillful knowledge of differentiating bodies, they develop wisdom that directs them toward the manifestation of sensation. Here enlightening beings follow the differences in sentient beings’ different forms of sensation and the accomplishment of body according to their specificities.",
        "source": "T10n0287_006:0560b22_6"
    },
    {
        "source_sentence": "隨其所應而為同類，示現自身成熟有情。",
        "translation": "They are of the same type as they should be, manifesting themselves to bring sentient beings to maturity.",
        "source": "T10n0287_006:0560b24_7"
    },
    {
        "source_sentence": "「復次，菩薩於一三千大千世界，普能遍滿隨有情身勝解差別引發受生，",
        "translation": "“Furthermore, enlightening beings are able to pervade a great manifold cosmos of one thousand worlds and can give rise to sentient beings according to the differences in their physical forms with conviction.",
        "source": "T10n0287_006:0560b26_0"
    },
    {
        "source_sentence": "以影現智隨所行故，若二、若三、若四、若五、若十、二十、三十、四十、五十、若百，",
        "translation": "It's because the knowledge of the manifestation of shadow follows what's practiced, whether it's two, three, four, five, ten, 20, 30, 40, 50, or a hundred.",
        "source": "T10n0287_006:0560b27_1"
    },
    {
        "source_sentence": "乃至不可說數無量三千大千世界，皆能遍滿隨有情身勝解差別隨其所應引發受生，",
        "translation": "They can fill untold millions of billions of worlds and give birth to sentient beings according to the differences in their physical forms, resolves, and responses.",
        "source": "T10n0287_006:0560b29_2"
    },
    {
        "source_sentence": "以影現智隨所行故。",
        "translation": "It's because the knowledge of the manifestation of shadow follows what it does.",
        "source": "T10n0287_006:0560c02_3"
    },
    {
        "source_sentence": "菩薩成就如是智已，從一佛剎其身不動，於不可說諸佛剎土眾會之中皆悉顯現，",
        "translation": "“When enlightening beings have attained such knowledge, their bodies do not move from one buddha-land to another, appearing in the congregations of untold buddha-lands.",
        "source": "T10n0287_006:0560c02_4"
    },
    {
        "source_sentence": "而此菩薩隨諸有情身及勝解意樂差別，能於彼彼佛國土中，及於彼彼眾會道場彼彼之處，",
        "translation": "Here the enlightening beings, adapting to the differences in bodies and resolves of sentient beings, are able to go from one buddha-land to another as well as from one monastery to another.",
        "source": "T10n0287_006:0560c04_5"
    },
    {
        "source_sentence": "如是如是示現其身。",
        "translation": "Thus and so forth, they show their bodies.",
        "source": "T10n0287_006:0560c06_6"
    },
    {
        "source_sentence": "所謂：於沙門眾中現沙門形，婆羅門眾中現婆羅門形，剎利眾中現剎利形，",
        "translation": "In the assembly of śramaṇas he manifested the form of a śramaṇa; in the assembly of brāhmaṇas he manifested the form of a brāhmaṇa; in the assembly of kṣatriyas he manifested the form of a kṣatriya.",
        "source": "T10n0287_006:0560c07_7"
    },
    {
        "source_sentence": "吠舍眾中現吠舍形，長者眾中現長者形，居士眾中現居士形，於四天王眾中現四天王形，",
        "translation": "In the assembly of Vaiśravaṇa, he manifested the form of Vaiśravaṇa; in the assembly of wealthy householders, he manifested the form of wealthy householder; in the assembly of laymen, he manifested the form of layman; and in the assembly of the four guardian gods, he manifested the form of the four guardia",
        "source": "T10n0287_006:0560c08_8"
    },
    {
        "source_sentence": "於三十三天眾中示現三十三天形，夜摩眾中、覩史多眾中、樂變化眾中、他化自在眾中、魔王眾中，",
        "translation": "Among the assembly of the thirty-three gods, he manifested the form of the thirty-three gods: among the assembly of Yama, among the assembly of Kauśinagara, among the assembly of blissful emanations, among the assembly of masters of others’ emanations, and among the assembly",
        "source": "T10n0287_006:0560c11_0"
    },
    {
        "source_sentence": "各隨其類而為現形，於梵眾中現梵形色。",
        "translation": "Each one manifests his form according to its type, and he manifests the form of Brahma among the Brahmā gods.",
        "source": "T10n0287_006:0560c13_1"
    },
    {
        "source_sentence": "又此菩薩，應以聲聞身得調伏者，而為示現聲聞身形；",
        "translation": "“Furthermore, these enlightening beings should show the form of disciples to those who can be disciplined by means of the voice-hearers’ bodies.",
        "source": "T10n0287_006:0560c14_2"
    },
    {
        "source_sentence": "應以獨覺身得調伏者，而為示現獨覺身形；",
        "translation": "To those who are to be disciplined by the body of self-enlightened one, they show the form of self-enlightened ones.",
        "source": "T10n0287_006:0560c15_3"
    },
    {
        "source_sentence": "應以菩薩身得調伏者，而為示現菩薩身形；",
        "translation": "To those who are disciplined by the body of enlightening beings they should show the form of enlightening beings.",
        "source": "T10n0287_006:0560c16_4"
    },
    {
        "source_sentence": "應以如來身形得調伏者，而為示現如來身形。",
        "translation": "To those who are disciplined by the Tathāgata's body shape, he shows the Tathāgata's body shape.",
        "source": "T10n0287_006:0560c17_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0560c18_6"
    },
    {
        "source_sentence": "菩薩如是，於不可說佛剎土中所有若干有情勝解，於彼彼處如是如是現身差別。",
        "translation": "Thus, the bodhisattva thus has the resolve of certain sentient beings in untold buddha-lands to show distinctions in their bodies in this way and that place.",
        "source": "T10n0287_006:0560c18_7"
    },
    {
        "source_sentence": "「復次，此菩薩遠離一切身相分別，得身平等性，知有情身、剎土身、業果身、聲聞身、獨覺身、菩薩身、如來身、智身、法身、虛空身，",
        "translation": "“Furthermore, these enlightening beings are free from all discriminations of body and characteristics, attain equanimity in body, know the bodies of sentient beings, the bodies of buddha-fields, the bodies of actions, the bodies of results of action, the bodies of disciples, the bodies of individual illuminates, the bodies",
        "source": "T10n0287_006:0560c21_0"
    },
    {
        "source_sentence": "此菩薩知有情心意樂引發。",
        "translation": "This bodhisattva knows that the minds and intentions of sentient beings are produced.",
        "source": "T10n0287_006:0560c23_1"
    },
    {
        "source_sentence": "若樂隨欲將有情身置於自身，如是剎土身、業果身、聲聞身、獨覺身、菩薩身、如來身、智身、法身、虛空身，",
        "translation": "“Furthermore, if one wishes to place the bodies of sentient beings within themselves according to their desires, such are the bodies of buddhas, the bodies of action and result, the bodies of disciples, the bodies of self-enlightened ones, the bodies of enlightening beings, the bodies of buddhas, the bodies of buddh",
        "source": "T10n0287_006:0560c24_2"
    },
    {
        "source_sentence": "置於自身。",
        "translation": "He puts it in his own body.",
        "source": "T10n0287_006:0560c26_3"
    },
    {
        "source_sentence": "又此菩薩，知有情心意樂引發，若樂隨欲能以自身置於一切諸有情身；",
        "translation": "Furthermore, these enlightening beings know that the minds and intentions of sentient beings are generated by mental command. They can place themselves in the bodies of all sentient beings according to their inclinations and desires.",
        "source": "T10n0287_006:0560c26_4"
    },
    {
        "source_sentence": "能以自身，置於剎土身、業果身、聲聞身、獨覺身、菩薩身、如來身、智身、法身、虛空身，",
        "translation": "They can place their bodies in the buddha-body, the body of action and result, the body of śrāvakas, the body of pratyekabuddhas, the body of enlightening beings, the body of buddhas, the body of knowledge, the body of doctrine, and the body of space.",
        "source": "T10n0287_006:0560c28_5"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T10n0287_006:0561a01_6"
    },
    {
        "source_sentence": "菩薩已知諸有情心意樂引發，而將此身隨欲置於彼彼身中，是菩薩於有情身中，",
        "translation": "The bodhisattva knows the minds and intentions of sentient beings, yet he puts his body wherever he wishes. This is the bodhisattva’s way of teaching sentient beings:",
        "source": "T10n0287_006:0561a01_7"
    },
    {
        "source_sentence": "知業身、異熟身、煩惱身、有色身、無色身。",
        "translation": "They know the body of karma, the body of retribution, the body of affliction, the body with form, and the body without form.",
        "source": "T10n0287_006:0561a03_8"
    },
    {
        "source_sentence": "於剎土身中，小相、大相、無量相、雜染相、清淨相、亂住相、仰住相、覆入相、方網差別相，",
        "translation": "In the body of a buddha-land, there are minor marks, major marks, immeasurable marks, defiled marks, pure marks, distorted marks, raised marks, inverted marks, entering marks, and distinctive marks in different directions.",
        "source": "T10n0287_006:0561a04_9"
    },
    {
        "source_sentence": "皆悉能知。",
        "translation": "They're all fully able to know.",
        "source": "T10n0287_006:0561a06_10"
    },
    {
        "source_sentence": "於業果身中，能知差別、知假建立；",
        "translation": "In the body as fruit of action, they can know distinctions and establish conventional designations.",
        "source": "T10n0287_006:0561a06_11"
    },
    {
        "source_sentence": "於聲聞身、於獨覺身、於菩薩身，能知差別、知建立；",
        "translation": "They can know distinctions in the bodies of śrāvakas, pratyekabuddhas, and bodhisattvas and know their establishment.",
        "source": "T10n0287_006:0561a07_12"
    },
    {
        "source_sentence": "於如來身中知等覺身、願身、化身、加持之身、相好莊嚴微妙色身、光明身、意生身、福德身、法身、智身，",
        "translation": "In the body of the enlightened one, he knows the body of perfect enlightenment, the body of vows, the body of emanation, the body of empowerment, the body sustained by empowerment, the body adorned with marks and embellishments, the body of subtle form, the body of light, the body produced by thought, the body of virtue,",
        "source": "T10n0287_006:0561a08_13"
    },
    {
        "source_sentence": "皆悉能知。",
        "translation": "They're all fully able to know.",
        "source": "T10n0287_006:0561a10_14"
    },
    {
        "source_sentence": "於智身中，善思察相、如實觀相、果及加行所攝之相、世間出世間差別相、三乘安立相、共不共相、出離非出離相、有學無學相，",
        "translation": "In the body of knowledge, he well contemplates characteristics, accurately observes characteristics, results and characteristics collected by applied practices, distinctions between mundane and transmundane, established characteristics of the three vehicles, shared and distinctive characteristics, liberation and non-liberation, training and post-learning characteristics.",
        "source": "T10n0287_006:0561a11_0"
    },
    {
        "source_sentence": "皆悉能知。",
        "translation": "They're all fully able to know.",
        "source": "T10n0287_006:0561a13_1"
    },
    {
        "source_sentence": "於法身平等性相、不毀壞相、隨諸分位及假世俗安立之相、有情無情法安立相、佛法聖僧法安立相，",
        "translation": "the characteristic of equality in the Dharma body, the characteristic of non-destruction, the characteristic of establishment according to states and provisional worldly conventions, the characteristic of establishment of sentient beings and non-sentient beings as dharmas, the characteristic of establishment of buddhas, truths, sages, and saṃgha.",
        "source": "T10n0287_006:0561a14_2"
    },
    {
        "source_sentence": "皆悉能知。",
        "translation": "They're all fully able to know.",
        "source": "T10n0287_006:0561a16_3"
    },
    {
        "source_sentence": "於虛空身，知無量根遍行之相、無形質相、無異無邊相、以持色聚得顯了相，",
        "translation": "In the body of space, they know the characteristics of infinite faculties and pervasive tendencies, formless physical characteristics, dissimilar characteristics, and boundless characteristics, and can manifest their characteristics by holding the mass of form.",
        "source": "T10n0287_006:0561a16_4"
    },
    {
        "source_sentence": "皆悉能知。",
        "translation": "They're all fully able to know.",
        "source": "T10n0287_006:0561a18_5"
    },
    {
        "source_sentence": "即此菩薩，如是已能引發身智得壽自在，於不可說不可說劫加持壽量故；",
        "translation": "That is, these enlightening beings have thus already been able to produce bodily knowledge and attain sovereignty over their life spans, because they support one another for untold eons.",
        "source": "T10n0287_006:0561a18_6"
    },
    {
        "source_sentence": "得心自在已，於無量無數等持觀入智故；",
        "translation": "Having attained mastery over mind, they enter knowledge of immeasurable and countless equanimity.",
        "source": "T10n0287_006:0561a20_7"
    },
    {
        "source_sentence": "得資生自在已，能示現一切世界無量莊嚴具，莊飾加持故；",
        "translation": "Having attained mastery over means of subsistence, they are able to manifest infinite arrays of adornments in all worlds, because of their embellishments and empowerment.",
        "source": "T10n0287_006:0561a21_8"
    },
    {
        "source_sentence": "得業自在，應時能現業果加持故；",
        "translation": "They attain mastery over action, because they are able to manifest the fruit of action at the proper time and support it.",
        "source": "T10n0287_006:0561a22_9"
    },
    {
        "source_sentence": "得生自在，於一切世間示現受生故；",
        "translation": "They attain freedom of birth, because they manifest birth in all worlds.",
        "source": "T10n0287_006:0561a23_10"
    },
    {
        "source_sentence": "得勝解自在已，能示現一切世界佛充滿故；",
        "translation": "Having attained mastery over resolve, they are able to show the buddhas of all worlds being filled.",
        "source": "T10n0287_006:0561a24_11"
    },
    {
        "source_sentence": "得願自在，於隨所欲佛剎時分示等覺故；",
        "translation": "They attain mastery over vows, being able to show them equally enlightened at the time of their desire in all buddha-lands.",
        "source": "T10n0287_006:0561a25_12"
    },
    {
        "source_sentence": "得神通自在，諸佛剎中皆能示現神通遊戲故；",
        "translation": "They attain mastery over mystic powers, being able to manifest the play of mystic powers in all buddha-lands.",
        "source": "T10n0287_006:0561a26_13"
    },
    {
        "source_sentence": "得法自在已，能示現無邊無中法門明故；",
        "translation": "Having attained mastery over the teachings, they are able to manifest the insight of boundless and unfathomable teachings.",
        "source": "T10n0287_006:0561a27_14"
    },
    {
        "source_sentence": "得智自在，示現佛力、無畏、不共佛法、相、好、正等覺故。",
        "translation": "He attains the mastery of knowledge because he shows the Buddha's power, fearlessness, distinctive qualities, characteristics, features, beauty, and perfect enlightenment.",
        "source": "T10n0287_006:0561a28_15"
    },
    {
        "source_sentence": "菩薩得此十自在故，即得名為不思議智者、廣大智者、不可映奪智者。",
        "translation": "Because the bodhisattva has attained these ten kinds of mastery, he's called someone with inconceivable wisdom, someone with vast wisdom, and someone with indestructible wisdom.",
        "source": "T10n0287_006:0561a29_16"
    },
    {
        "source_sentence": "於是菩薩已至如是，已能成就如是智慧，畢竟無罪；",
        "translation": "Having arrived thus, the enlightening being is able to perfect such knowledge and wisdom, ultimately without fault.",
        "source": "T10n0287_006:0561b01_17"
    },
    {
        "source_sentence": "身業現行任運隨轉，畢竟無罪；",
        "translation": "Their bodily actions and deeds are carried out freely, ultimately blameless.",
        "source": "T10n0287_006:0561b03_0"
    },
    {
        "source_sentence": "語業現行任運隨轉，畢竟無罪；",
        "translation": "They are ultimately blameless in their speech, actions, and deeds.",
        "source": "T10n0287_006:0561b03_1"
    },
    {
        "source_sentence": "意業現行任運隨轉，於一切業智為先導，隨智而轉，慧到彼岸以為增上。",
        "translation": "The mental action manifesting in the present proceeds spontaneously and subsequently: knowledge of all actions is the first guiding principle. It proceeds according to knowledge, reaching the other shore with knowledge as its dominant [factor].",
        "source": "T10n0287_006:0561b04_2"
    },
    {
        "source_sentence": "大悲為首，方便善巧善所分別，願善所引，如來加持善所加護，於諸有情利益加行無有休息，",
        "translation": "Great compassion is foremost, skillfully discriminated by means and goodness, led by vows and goodness, supported by the enlightened, protected by goodness, unceasingly applying themselves to the benefit of sentient beings.",
        "source": "T10n0287_006:0561b06_3"
    },
    {
        "source_sentence": "隨於無邊世界差別行。",
        "translation": "They follow the distinctive practices of the limitless world.",
        "source": "T10n0287_006:0561b08_4"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0561b08_5"
    },
    {
        "source_sentence": "舉要言之：菩薩至於不動地已，所有身、語、意業現行，皆為積集一切佛法。",
        "translation": "To summarize, the bodhisattva's physical, verbal, and mental actions as long as he reaches the stage of immovability are all accumulated in order to accumulate all the Buddha's teachings.",
        "source": "T10n0287_006:0561b08_6"
    },
    {
        "source_sentence": "「復次，菩薩如是至於不動地中，於意樂力得善安住，遠離一切煩惱現行故；",
        "translation": "“Furthermore, enlightening beings in this way reach the stage of Immutable because they attain well-being by means of the power of aspiration and are far removed from all afflictions.",
        "source": "T10n0287_006:0561b11_0"
    },
    {
        "source_sentence": "於增上意樂力得善安住，不離道故；",
        "translation": "They attain peace of mind by means of the power of higher aspiration, because they do not leave the path.",
        "source": "T10n0287_006:0561b12_1"
    },
    {
        "source_sentence": "於大悲力得善安住，不捨利益有情事故；",
        "translation": "They attain peace of mind by the power of great compassion and do not give up works for the benefit of sentient beings.",
        "source": "T10n0287_006:0561b13_2"
    },
    {
        "source_sentence": "於大慈力得善安住，能救一切諸世間故；",
        "translation": "They attain peace by the power of great compassion, being able to save all beings in all worlds.",
        "source": "T10n0287_006:0561b14_3"
    },
    {
        "source_sentence": "於總持力得善安住，無忘失法故；",
        "translation": "They attain peace of mind by the power of universal maintenance, because they do not forget things.",
        "source": "T10n0287_006:0561b15_4"
    },
    {
        "source_sentence": "於辯才力得善安住，於一切佛法選擇分別得善巧故；",
        "translation": "They attain well-abiding in the power of elucidation, because they attain skill in discriminating and analyzing all the teachings of buddhas.",
        "source": "T10n0287_006:0561b16_5"
    },
    {
        "source_sentence": "於神通力得善安住，於無邊際諸世界中行差別處得善巧故；",
        "translation": "They attain peace and stability in their supernormal powers, because they attain skill in the differentiations of boundless worlds.",
        "source": "T10n0287_006:0561b17_6"
    },
    {
        "source_sentence": "於大願力得善安住，不捨一切菩薩所作故；",
        "translation": "They attain peace of mind by the power of their great vow, not giving up all enlightening beings’ work.",
        "source": "T10n0287_006:0561b18_7"
    },
    {
        "source_sentence": "於到彼岸力得善安住，普集一切諸佛法故；",
        "translation": "They attain peace by the power of reaching the other shore, because they collect all the teachings of buddhas everywhere.",
        "source": "T10n0287_006:0561b19_8"
    },
    {
        "source_sentence": "於如來加持力得善安住，一切行相、一切智智現在前故。",
        "translation": "They attain well-abiding by the power of the Tathāgata's empowerment, because all the characteristics of all practices and omniscience are present in front of them.",
        "source": "T10n0287_006:0561b20_9"
    },
    {
        "source_sentence": "然此菩薩已得如是勢力所持，能現一切諸所作事，而於一切所作事中無有過咎。",
        "translation": "Still, this bodhisattva has attained such a power that he can show all the things he does, and there's no fault in all the things he does.",
        "source": "T10n0287_006:0561b22_10"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0287_006:0561b24_0"
    },
    {
        "source_sentence": "此之第八菩薩智地，名為不動地，不可映奪故；",
        "translation": "The eighth stage of knowledge of enlightening beings is called the stage of unshakable, because it cannot be overpowered.",
        "source": "T10n0287_006:0561b24_1"
    },
    {
        "source_sentence": "名為不退地，智無退故；",
        "translation": "It is called the stage of nonbacksliding because knowledge has no backsliding.",
        "source": "T10n0287_006:0561b25_2"
    },
    {
        "source_sentence": "名為難得地，一切世間無能測故；",
        "translation": "It is called a difficult-to-obtain ground because no one in the world can fathom it.",
        "source": "T10n0287_006:0561b25_3"
    },
    {
        "source_sentence": "名為童真地，無過失故；",
        "translation": "It is called the realm of youth because it has no faults or errors.",
        "source": "T10n0287_006:0561b26_4"
    },
    {
        "source_sentence": "名為生地，如所樂欲自在轉故；",
        "translation": "It is called the stage of arising because it proceeds freely according to desire.",
        "source": "T10n0287_006:0561b27_0"
    },
    {
        "source_sentence": "名為成就地，無復所作故；",
        "translation": "It is called the stage of accomplishment because there is nothing further to be done.",
        "source": "T10n0287_006:0561b27_1"
    },
    {
        "source_sentence": "名為究竟地，以能善作智決擇故；",
        "translation": "They are called the ultimate stage because they can skillfully perform knowledge and discernment.",
        "source": "T10n0287_006:0561b28_2"
    },
    {
        "source_sentence": "名為涅槃地，以善引發本願力故；",
        "translation": "It is called the state of nirvana because it gives rise to the power of one’s original vow.",
        "source": "T10n0287_006:0561b29_3"
    },
    {
        "source_sentence": "名為住持地，非他所壞故；",
        "translation": "It is called the stage of sustained abiding because it is not destroyed by anyone else.",
        "source": "T10n0287_006:0561b29_4"
    },
    {
        "source_sentence": "名為無功用地，前際所引故。",
        "translation": "It's called the ground of effortlessness because it's projected by the previous one.",
        "source": "T10n0287_006:0561c01_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0561c02_6"
    },
    {
        "source_sentence": "菩薩引發如是智已，入佛種姓，以佛功德光明所照，隨順如來威儀正行，",
        "translation": "“Then the enlightening beings, having developed such knowledge, enter the family of buddhas, illumined by the light of the virtues of buddhahood, following the deportment and conduct of buddhas.",
        "source": "T10n0287_006:0561c02_7"
    },
    {
        "source_sentence": "佛境現前無間無缺，如來威德常所加持，釋梵護世之所奉迎，金剛力士常隨侍衛，",
        "translation": "The sphere of buddhahood appeared before them without interruption or deficiency, always supported by the majesty and virtue of Buddha. They were greeted by Indra and Brahma, world protectors, always accompanied by adamantine warriors.",
        "source": "T10n0287_006:0561c03_8"
    },
    {
        "source_sentence": "恒不捨離三摩地力，引發無量分身差別一切身行，勢力相應成就廣大異熟神通，",
        "translation": "They always do not give up the power of concentration. They produce all bodily actions that are differentiated by immeasurable distinctive characteristics in their bodies, accompanied by great mystic powers of retribution and maturation.",
        "source": "T10n0287_006:0561c05_9"
    },
    {
        "source_sentence": "於無涯際三摩地中自在而轉。",
        "translation": "He's freely transformed in the boundless samādhi.",
        "source": "T10n0287_006:0561c07_10"
    },
    {
        "source_sentence": "能受無量菩提記別，隨已成熟諸有情類現成正覺。",
        "translation": "He's able to receive the assurance of immeasurable enlightenment, and following the ripening of sentient beings, they'll now become perfectly enlightened.",
        "source": "T10n0287_006:0561c08_11"
    },
    {
        "source_sentence": "然此菩薩如是通達入大乘會，獲善觀察大智神通，常恒能放妙慧光明，",
        "translation": "“However, these enlightening beings enter the assembly of the Great Vehicle in this way: gaining great superknowledge and insight, they can always emanate the light of knowledge.",
        "source": "T10n0287_006:0561c09_12"
    },
    {
        "source_sentence": "趣入無礙真法界道，能知世界差別之道，示現一切諸大功德，於自心起自在能轉，",
        "translation": "They enter the unobstructed path of the realm of reality, able to know the different paths of worlds; they manifest all great virtues, producing freedom in their own minds.",
        "source": "T10n0287_006:0561c11_13"
    },
    {
        "source_sentence": "於前後際善能知行，善能通達伏除一切魔道之智，證入如來所行境界。",
        "translation": "He's well able to know and practice the past and future, well able to comprehend the knowledge that subdues all demonic paths, and realizes entry into the realm of what the Tathāgata does.",
        "source": "T10n0287_006:0561c13_0"
    },
    {
        "source_sentence": "能於無邊諸世界中行菩薩行，已能成就不退轉故；",
        "translation": "They are able to carry out the practice of enlightening beings in boundless worlds, because they have already accomplished nonregression.",
        "source": "T10n0287_006:0561c14_1"
    },
    {
        "source_sentence": "是即說為菩薩已至於不動地。",
        "translation": "This is called a bodhisattva who has reached the stage of immovability.",
        "source": "T10n0287_006:0561c15_2"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0287_006:0561c17_0"
    },
    {
        "source_sentence": "菩薩住此不動地時，恒常無間不離現見無量諸佛，由三摩地力所引故。",
        "translation": "When the bodhisattva abides in this immovable stage, he's always constant, unremitting, and doesn't part from the present vision of measureless buddhas because it's projected by the power of samādhi.",
        "source": "T10n0287_006:0561c17_1"
    },
    {
        "source_sentence": "然不棄捨廣見諸佛承事供養，然此菩薩於一一世界，見無量佛、無量百佛、無量千佛、無量百千佛、無量百千那庾多佛、無量俱胝佛、無量百俱胝佛、無量千俱胝佛、無量百千俱胝佛、無量百千俱胝那庾多佛。",
        "translation": "Still, this bodhisattva doesn't abandon the extensive views of the buddhas and serves and makes offerings to them, but in each world he sees measureless buddhas, measureless hundreds of thousands of buddhas, measureless hundreds of thousands of buddhas, measureless hundreds of millions of buddhas, measureless koṭi of buddhas, measureless hundreds of millions",
        "source": "T10n0287_006:0561c18_2"
    },
    {
        "source_sentence": "見諸佛已恭敬尊重，以一切行相引發供養，悉以奉獻彼諸如來，皆悉承事，",
        "translation": "Having seen the buddhas, having honored and venerated them, they induce offerings of all forms with all kinds of deeds, presenting them to those buddhas as their servants.",
        "source": "T10n0287_006:0561c23_3"
    },
    {
        "source_sentence": "於諸佛所領受世界差別義等無量法明，轉復得於如來法藏，於諸世界差別問答無能屈者。",
        "translation": "In the innumerable teachings such as the meaning of the distinctions in worlds that are received by the buddhas, they'll then again attain the Tathāgata's Dharma store, which asks and answers about the distinctions in worlds without anyone who can bend it.",
        "source": "T10n0287_006:0561c25_4"
    },
    {
        "source_sentence": "於無量劫，此諸善根轉得熾然光麗明淨，無量百劫、無量千劫、無量百千劫、無量百千那庾多劫、無量俱胝劫、無量百俱胝劫、無量千俱胝劫、無量百千俱胝劫、無量百千俱胝那庾多劫，",
        "translation": "In measureless eons, these good roots of enlightenment will become blazingly shiny and pure, for measureless hundreds of eons, measureless millions of eons, measureless millions of eons, measureless millions of eons, measureless millions of eons, measureless millions of eons, measureless millions of eons, measureless millions of eons,",
        "source": "T10n0287_006:0561c27_5"
    },
    {
        "source_sentence": "此諸善根轉得熾然光麗明淨。",
        "translation": "These good roots will then become blazing, shining, and pure.",
        "source": "T10n0287_006:0562a02_6"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0562a03_7"
    },
    {
        "source_sentence": "譬如善巧金師，以所鍊金作嚴具已，置贍部洲聖王頂上或於頸下，贍部洲中一切臣民，",
        "translation": "Suppose a skilled goldsmith were to place the gold he had collected into an ornate ornament and placed it on the head or neck of the holy king of Jambudvlpa. All his ministers and subjects in Jambudvlpa",
        "source": "T10n0287_006:0562a03_8"
    },
    {
        "source_sentence": "諸莊嚴具無與等者。",
        "translation": "The adornments are unsurpassed.",
        "source": "T10n0287_006:0562a05_9"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0562a05_10"
    },
    {
        "source_sentence": "菩薩住是不動地中，此諸善根亦復如是，一切聲聞、獨覺，乃至七地菩薩，",
        "translation": "Similarly, these roots of goodness are likewise for all the disciples and solitary realizers, up to bodhisattvas in the seventh stage.",
        "source": "T10n0287_006:0562a05_11"
    },
    {
        "source_sentence": "所有善根無與等者。",
        "translation": "The good roots that exist are unequaled.",
        "source": "T10n0287_006:0562a07_12"
    },
    {
        "source_sentence": "以住此地大智光明，普滅有情煩惱黑闇，善能開闡智慧門故。",
        "translation": "Because the light of great knowledge abiding in this stage universally extinguishes the darkness of afflictions of sentient beings, and it's able to skillfully open up the gate of wisdom.",
        "source": "T10n0287_006:0562a08_13"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0287_006:0562a09_14"
    },
    {
        "source_sentence": "譬如千世界主，大梵天王遍運慈心，普放光明滿千世界。",
        "translation": "It's like the lord of a thousand worlds, the great Brahma king who universally compassionately carries his mind of kindness and radiates light throughout a thousand worlds.",
        "source": "T10n0287_006:0562a09_15"
    },
    {
        "source_sentence": "菩薩住此不動地已亦復如是，能以光明普照遍滿，乃至百萬佛剎微塵數等世界，",
        "translation": "“Furthermore, the enlightening beings in this stage of Immutable are also like this: they can illumine as many worlds as atoms in a million buddha-lands with their light.",
        "source": "T10n0287_006:0562a11_0"
    },
    {
        "source_sentence": "漸滅有情煩惱炎熱令身悅豫。",
        "translation": "He gradually extinguishes the burning heat of sentient beings’ afflictions and makes their bodies happy.",
        "source": "T10n0287_006:0562a12_1"
    },
    {
        "source_sentence": "於十種波羅蜜多，願到彼岸以為增上，餘到彼岸隨力隨分，非不修行。",
        "translation": "Regarding the ten kinds of perfections, he wishes to reach the other shore as an advancement, and the others reach the other shore according to their strength and partiality, not without cultivation.",
        "source": "T10n0287_006:0562a13_2"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0287_006:0562a15_3"
    },
    {
        "source_sentence": "是名略說菩薩第八不動智地。",
        "translation": "This is called the brief explanation of the eighth stage of the bodhisattva's immovable wisdom.",
        "source": "T10n0287_006:0562a15_4"
    },
    {
        "source_sentence": "若廣說者，經無量劫不可窮盡。",
        "translation": "If we explain it in detail, it will go on for measureless eons and cannot be exhausted.",
        "source": "T10n0287_006:0562a16_5"
    },
    {
        "source_sentence": "菩薩安住於此地已，受生多作大梵天王，主千世界威德最勝無所映奪；",
        "translation": "“Furthermore, the enlightening beings at this stage are born and become great celestial kings of Brahmā Heaven, ruling over a thousand worlds with unrivaled majesty.",
        "source": "T10n0287_006:0562a16_6"
    },
    {
        "source_sentence": "善見義利得大自在，為諸有情善說聲聞、獨覺、菩薩到彼岸道，世界差別問答之中無能屈者，",
        "translation": "“Furthermore, the enlightening being Universally Good has attained great freedom in seeing meanings and benefits. He explains to sentient beings the path leading to the other shore for the sake of liberation of all listeners, self-enlightened ones, and bodhisattvas. There is no one who can digress from this distinction in worldly questions and answers.",
        "source": "T10n0287_006:0562a18_7"
    },
    {
        "source_sentence": "諸所作業，或以布施、或以愛語、或以利行、或以同事，此等一切悉皆不離佛作意、法作意、僧伽作意、菩薩作意、菩薩行作意、到彼岸作意、諸地作意、佛力作意、無所畏作意、佛不共法作意，",
        "translation": "Whatever they do, whether with generosity, kind speech, benefit, or cooperation, all of them are not apart from the Buddha’s attention, the attention given to doctrine, the attention given to saṃgha, the attention given to enlightening beings, the attention given to practices of enlightening beings, the attention given to reaching the other shore, the attention given to the",
        "source": "T10n0287_006:0562a20_8"
    },
    {
        "source_sentence": "乃至不離一切行相勝妙相應一切智智作意。",
        "translation": "It doesn't part from the contemplation of omniscience and cognition associated with all the marks of all conditioned forms that are superior and marvelous.",
        "source": "T10n0287_006:0562a24_9"
    },
    {
        "source_sentence": "常作願言：『我當一切諸有情中，為首、為勝、為殊勝、為妙、為微妙、為上、為無上、為無等、為無等等、為導、為將、為帥，",
        "translation": "They should always make the vow that all sentient beings will be leaders, preeminent, outstanding, marvelous, subtle, sublime, superior, unsurpassed, peerless, unequalled, guides, generals, and commanders.",
        "source": "T10n0287_006:0562a25_10"
    },
    {
        "source_sentence": "乃至願得一切智智所依止處。』",
        "translation": "May I attain the place where omniscience and cognition are based?'",
        "source": "T10n0287_006:0562a28_11"
    },
    {
        "source_sentence": "若樂發起如是精進，由是精進一剎那頃瞬息須臾，證得百萬三千大千世界微塵數諸三摩地；",
        "translation": "“Those who delight in initiating such effort will, and as a result of that effort they attain concentrations as numerous as atoms in one million, three thousand, or one-thousand great chiliocosms in an instant.",
        "source": "T10n0287_006:0562a29_12"
    },
    {
        "source_sentence": "能見百萬三千大千世界微塵數佛，彼佛加持皆能解了。",
        "translation": "He's able to see as many buddhas as atoms in a million 3,000 great one-thousand worlds, and they can all understand them with the support of those buddhas.",
        "source": "T10n0287_006:0562b02_13"
    },
    {
        "source_sentence": "能動百萬三千大千世界微塵數諸佛剎土，能照百萬三千大千世界微塵數諸佛國土，",
        "translation": "They can move as many buddha-lands as atoms in a million billion worlds, and illumine as many buddha-lands as atoms in a million billion worlds.",
        "source": "T10n0287_006:0562b03_14"
    },
    {
        "source_sentence": "成熟百萬三千大千世界微塵數有情，住壽百萬三千大千世界微塵數劫，",
        "translation": "He matured as many sentient beings as there are atoms in a million billion worlds, lived as long as there are durationless eons in a million billion worlds.",
        "source": "T10n0287_006:0562b05_15"
    },
    {
        "source_sentence": "於前後際各入百萬三千大千世界微塵數劫，善能思擇百萬三千大千世界微塵數法門，",
        "translation": "In each of the past and future eons he entered as many eons as atoms in a million billion worlds, able to deliberate on as many teachings as atoms in a million universes.",
        "source": "T10n0287_006:0562b07_16"
    },
    {
        "source_sentence": "示現百萬三千大千世界微塵數身，身身能現百萬三千大千世界微塵數菩薩眷屬圍遶。",
        "translation": "He manifests bodies as numerous as atoms in a million billion worlds, and his body can manifest bodies surrounded by retinues of enlightening beings as numerous as atoms in a million billion worlds.",
        "source": "T10n0287_006:0562b09_17"
    },
    {
        "source_sentence": "從此以上是諸菩薩有願力者，由勝願故，所有遊戲，或身、或光明、或神通、或眼、或境界、或音聲、或行、或莊嚴、或勝解、或所作，",
        "translation": "“From here the enlightening beings have the power of vows: because of their overpowering vows, they can manifest all kinds of physical, verbal, and mental play—some are bodily, some are light, some are divine, some are visual, some are objective, some are voiced, some are acting, some are adorned, some are skilled in liberation, some are",
        "source": "T10n0287_006:0562b11_18"
    },
    {
        "source_sentence": "此等乃至爾所百千俱胝那庾多劫，不易可數。」",
        "translation": "It's not easy to count these or even those hundreds of thousands of koṭis of eons.",
        "source": "T10n0287_006:0562b14_19"
    },
    {
        "source_sentence": "「七地已修方便慧，　　善集資糧發大願；",
        "translation": "Having cultivated skillful means and wisdom in the seventh stage, They have well accumulated provisions And undertaken great vows.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　得佛加持具善力，　　順佛功德淨志念。",
        "translation": "Attaining the Buddha’s empowerment, endowed with all virtuous powers, They follow the Buddha’s virtues and pure aspirations.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　福智已超恒慈愍，　　智慧廣大等虛空；",
        "translation": "Their virtue and knowledge have already transcended the eternal compassion, And their wisdom is as vast as space.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　為求勝智登八地，　　契悟寂滅無生忍。",
        "translation": "In order to seek supreme knowledge, he ascends to the eighth ground and realizes the tolerance of cessation and nonarising.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　知法無生、無起性，　　無相、無成、無壞滅，",
        "translation": "Knowing things have no arising and no nature of arising, No signs, no becoming, and no decaying and ceasing,",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　無盡、無轉、無止息，　　無性為性常平等。",
        "translation": "They are inexhaustible, unchanging, and unceasing; The absence of nature is their essence, always equal.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　以無分別入佛智，　　超心、意、識分別想；",
        "translation": "By nondiscriminating entering buddha-knowledge They transcend discriminating conceptions of mind, thought, and consciousness.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　證此忍已得靜住，　　甚深不動常寂滅。",
        "translation": "Realizing this forbearance, they attain the abode of quiescence, which is profound, unmoving, and always tranquil.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　一切世間無能測，　　心相取著悉皆離，",
        "translation": "All worlds can’t be measured; Their mental images and attachments are all removed.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　住於此地不分別，　　譬如苾芻入滅定。",
        "translation": "Abiding in this place without discrimination, it's like a monk entering the concentration of cessation.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　如夢渡河起翹勤，　　寤已坦然無遽務；",
        "translation": "It’s like a dream in which one crosses a river and gives rise to exhaustion, Having eaten the rice harvest, they are at ease without any hurry.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　菩薩為度有情界，　　功用此地息亦然；",
        "translation": "Enlightening beings, to liberate the realm of sentient beings, Also exert effort in this stage.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　如生梵世絕下欲，　　於此二相除亦爾。",
        "translation": "Like being born in the Brahma world and cutting off lower desires, so are these two characteristics removed.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　於法駛流蒙諸佛，　　覺悟勸導次其忍，",
        "translation": "In the fast-moving stream of the Teaching, they receive enlightenment from the Buddhas; Enlightened and inspired, they follow their patience.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　語言：『我等諸佛德，　　汝今未獲常勤進，",
        "translation": "They said, 'We buddhas and virtues, Now you have not yet attained constant effort.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　汝雖已滅煩惱火，　　世間惑焰猶熾然，",
        "translation": "Though you have already extinguished the fire of afflictions, The flame of worldly passions is still blazing.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　當念本願度有情，　　悉使修因趣解脫。",
        "translation": "They should be mindful of their original vow to save sentient beings, Causing them all to cultivate the causes and paths of liberation.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　法性常爾離分別，　　非但由此顯世尊，",
        "translation": "The essence of things is always thus, free from discrimination; It is not just this that shows the World-Honored One.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　二乘於此亦能得，　　故當引發一切行。』",
        "translation": "Here, the two vehicles can also attain it, so they will give rise to all practices.'",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　如是人天應供尊，　　授此智令慧觀察，",
        "translation": "Such people and gods should be honored as offerings, bestowing this knowledge to enable them to observe it with wisdom.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　無邊佛法悉得成，　　一念超過曩眾行。",
        "translation": "Boundless Buddha-teachings can all be accomplished; In a single thought they transcend coarse practices.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　菩薩住茲妙智地，　　則獲廣大神通力，",
        "translation": "Enlightening beings in this stage of subtle knowledge Attain great mystic power.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　一念分身遍十方，　　如船入海因風濟，",
        "translation": "The body of a single thought pervades the ten directions, Like a ship going into the ocean to be rescued by wind.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　心無功用任智力，　　悉知世界成、壞、住，",
        "translation": "Their minds have no effort, but rely on the power of knowledge: They know all worlds’ becoming, decay, and duration.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　諸界種種各殊異，　　小大無量皆能了。",
        "translation": "Each of the various worlds is different; Great and small, great and immeasurable, they can all comprehend.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　三千界中四大種，　　六趣有情身各別，",
        "translation": "In the manifold cosmos there are four great elements, The bodies of sentient beings in each of the six destinies.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　及以眾寶微塵數，　　以智觀察悉無餘。",
        "translation": "And, as numerous as atoms in the ocean of jewels, They observe with knowledge all without exception.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　菩薩能知一切身，　　為化有情同彼形；",
        "translation": "Enlightening beings can know all bodies In order to teach sentient beings the same form as theirs.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　剎土無量種種別，　　悉為現形無不遍。",
        "translation": "The worlds are infinite and variously different, All manifesting form for the sake of all.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　譬如日月住虛空，　　一切水中皆現影；",
        "translation": "It is as if the sun and moon were to abide in space, Showing their reflections in all waters.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　住於法界無所動，　　隨其心樂各不同。",
        "translation": "Abiding in the realm of reality, unmoving, They differ according to mentalities and inclinations.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　一切眾中皆現身，　　聲聞、獨覺與菩薩，",
        "translation": "In all the assemblies they manifest their bodies: Listeners, self-enlightened ones and enlightening beings.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　及以佛身靡不現。　　有情剎土業報身，",
        "translation": "The bodies of sentient beings in all the buddha-fields manifest themselves as reflections of their deeds.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　種種現身智法身，　　虛空身相皆平等，",
        "translation": "The various manifest bodies of knowledge and the body of reality, The physical forms of space are all equal.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　普為群生而示作。　　十種聖智普觀察，",
        "translation": "Ten kinds of holy knowledge are observed everywhere:",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　復以慈悲作眾業，　　所有佛法皆成就，",
        "translation": "They also do all kinds of deeds with compassion, Fulfilling all the Buddha’s teachings.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　淨戒不動如須彌，　　十力成就不搖動，",
        "translation": "The pure precepts don’t budge like the polar mountain, Accomplished by the ten powers they don’t budge.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　一切魔眾無能轉。　　諸佛加持天王禮，",
        "translation": "All the demons are unable to turn it.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　密迹金剛恒侍衛，　　此地功德無邊際，",
        "translation": "The mysterious traces of the Buddha are always guarded by the vajras. The virtues of this place have no bounds:",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　千萬億劫說不盡。　　復以供佛善益明，",
        "translation": "For thousands of myriads of koṭis of kalpas I teach it inexhaustibly.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　如王頂上莊嚴具；　　菩薩住此第八地，",
        "translation": "Like the adornments on the top of a king’s head, enlightening beings in the eighth stage are like this:",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　多作梵王千界主，　　演說三乘無有窮；",
        "translation": "They often become kings of Brahma, lords of a thousand worlds, Teaching the three vehicles without limit.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　慈光普照滅眾惑，　　一念獲得百萬界。",
        "translation": "The light of compassion universally illumines and extinguishes all afflictions, Acquiring millions of worlds in a single thought.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　微塵數等三摩地，　　餘所作事悉亦然；",
        "translation": "With concentrations as numerous as atoms in the sky, The same applies to the other deeds.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　願力示現復過此。　　菩薩第八不動地，",
        "translation": "The manifestation of the power of vows is even greater than this.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "　我為汝等已略說，　　若以次第廣分別，",
        "translation": "I've already briefly explained it for you. If we were to discriminate it in order and breadth,",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩欲重宣此義，而說偈言：　經於億劫不能盡。」",
        "translation": "At the time, the Vajragarbha Bodhisattva wanted to reiterate this meaning and spoke a verse, saying, For billions of eons, it can't be exhausted.",
        "source": "T10n0287_006:0562b15_20"
    },
    {
        "source_sentence": "菩薩不動地第八竟",
        "translation": "The Eighth Chapter of the Bodhisattva's Stage of Immovability",
        "source": "T10n0287_006:0563a06_0"
    },
    {
        "source_sentence": "佛說十地經卷第六",
        "translation": "Foshuo shidi jing, vol. 6",
        "source": "T10n0287_006:0563a07_0"
    }
]