[
    {
        "source_sentence": "大方廣佛華嚴經卷第六十九",
        "translation": "Dafangguang fo huayan jing, vol. 69",
        "source": "T10n0279_069:0372a06_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_069:0372a08_0"
    },
    {
        "source_sentence": "入法界品第三十九之十",
        "translation": "Chapter Thirty-nine and Ten of the Entry into the Dharma Realm",
        "source": "T10n0279_069:0372a09_0"
    },
    {
        "source_sentence": "爾時，善財童子了知彼婆珊婆演底夜神初發菩提心所生菩薩藏、所發菩薩願、所淨菩薩度、所入菩薩地、所修菩薩行、所行出離道、一切智光海、普救眾生心、普遍大悲雲、於一切佛剎盡未來際常能出生普賢行願。",
        "translation": "It was then that Sudhana knew the enlightening being Vasanti first aroused the determination for enlightenment, the store of enlightening beings produced by the deity Vasanti, the vows undertaken by enlightening beings, the",
        "source": "T10n0279_069:0372a10_0"
    },
    {
        "source_sentence": "漸次遊行，至普德淨光夜神所，頂禮其足，遶無數匝，於前合掌而作是言：「聖者！",
        "translation": "He gradually marched to the place where the night goddess Pure Light of Universal Virtue was, bowed his head at her feet, circled her countless times, joined his palms, and said, Sage!",
        "source": "T10n0279_069:0372a14_1"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而我未知菩薩云何修行菩薩地？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being to cultivate the bodhisattva stage.",
        "source": "T10n0279_069:0372a16_2"
    },
    {
        "source_sentence": "云何出生菩薩地？",
        "translation": "How are they born in the bodhisattva stage?",
        "source": "T10n0279_069:0372a18_3"
    },
    {
        "source_sentence": "云何成就菩薩地？」",
        "translation": "How does it accomplish the bodhisattva stage?",
        "source": "T10n0279_069:0372a18_4"
    },
    {
        "source_sentence": "夜神答言：「善哉善哉！",
        "translation": "The night god replied, Good, good!",
        "source": "T10n0279_069:0372a19_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372a19_6"
    },
    {
        "source_sentence": "汝已能發阿耨多羅三藐三菩提心，今復問於菩薩地修行、出生及以成就。",
        "translation": "You've already arisen the mind of unsurpassed, correct, and complete enlightenment, but now you're asking about cultivation, birth, and how it's accomplished in the bodhisattva stage.",
        "source": "T10n0279_069:0372a19_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372a21_8"
    },
    {
        "source_sentence": "菩薩成就十法，能圓滿菩薩行。",
        "translation": "A bodhisattva who accomplishes ten things can perfect the bodhisattva's practice.",
        "source": "T10n0279_069:0372a21_9"
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_069:0372a22_10"
    },
    {
        "source_sentence": "一者，得清淨三昧，常見一切佛；",
        "translation": "The first is that they attain pure concentration, seeing all buddhas.",
        "source": "T10n0279_069:0372a22_11"
    },
    {
        "source_sentence": "二者，得清淨眼，常觀一切佛相好莊嚴；",
        "translation": "The second is that they attain pure eyes, always observing the adornments of the marks and embellishments of all buddhas.",
        "source": "T10n0279_069:0372a23_12"
    },
    {
        "source_sentence": "三者，知一切如來無量無邊功德大海；",
        "translation": "The third is knowledge of the immeasurable, boundless ocean of virtues of all buddhas.",
        "source": "T10n0279_069:0372a24_13"
    },
    {
        "source_sentence": "四者，知等法界無量諸佛法光明海；",
        "translation": "The fourth is the ocean of knowledge of the boundless arrays of buddha-teachings equal to the cosmos of reality.",
        "source": "T10n0279_069:0372a25_14"
    },
    {
        "source_sentence": "五者，知一切如來，一一毛孔放等眾生數大光明海，利益無量一切眾生；",
        "translation": "The fifth is to know that all buddhas emanate oceans of light beams as numerous as the number of sentient beings from each and every pore of their bodies, benefiting infinitely many sentient beings.",
        "source": "T10n0279_069:0372a25_15"
    },
    {
        "source_sentence": "六者，見一切如來，一一毛孔出一切寶色光明焰海；",
        "translation": "The sixth was to see all buddhas, emanating from each pore oceans of light and flames of the colors of all their jewels.",
        "source": "T10n0279_069:0372a27_16"
    },
    {
        "source_sentence": "七者，於念念中出現一切佛變化海充滿法界，究竟一切諸佛境界調伏眾生；",
        "translation": "The seventh is that in each mental moment they manifest oceans of mystical displays of all buddhas filling the cosmos, perfecting the sphere of all buddhas and taming sentient beings.",
        "source": "T10n0279_069:0372a28_17"
    },
    {
        "source_sentence": "八者，得佛音聲同一切眾生言音海，轉三世一切佛法輪；",
        "translation": "The eighth is that they attain the voice of Buddha equal to all sentient beings’ oceans of words and sounds, turning the wheel of teaching of all buddhas of past, present, and future.",
        "source": "T10n0279_069:0372b01_18"
    },
    {
        "source_sentence": "九者，知一切佛無邊名號海；",
        "translation": "The ninth is knowledge of the boundless ocean of names of all buddhas.",
        "source": "T10n0279_069:0372b02_19"
    },
    {
        "source_sentence": "十者，知一切佛調伏眾生不思議自在力。",
        "translation": "Tenth, they know the inconceivable unimpeded power of all buddhas taming sentient beings.",
        "source": "T10n0279_069:0372b03_20"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372b04_21"
    },
    {
        "source_sentence": "菩薩成就此十種法，則能圓滿菩薩諸行。",
        "translation": "A bodhisattva who accomplishes these ten kinds of dharmas can then perfect the bodhisattva's practices.",
        "source": "T10n0279_069:0372b04_22"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372b05_23"
    },
    {
        "source_sentence": "我得菩薩解脫，名：寂靜禪定樂普遊步。",
        "translation": "I have attained an enlightening liberation called peaceful meditation and bliss, wandering everywhere.",
        "source": "T10n0279_069:0372b05_24"
    },
    {
        "source_sentence": "普見三世一切諸佛，亦見彼佛清淨國土、道場、眾會、神通、名號、說法、壽命、言音、身相，",
        "translation": "They see all the buddhas of past, present, and future; they also see the pure lands of those buddhas, their enlightenment sites, their congregations, their superknowledgements, their names, their teachings, their lifespans, their voices",
        "source": "T10n0279_069:0372b06_25"
    },
    {
        "source_sentence": "種種不同，悉皆明覩而無取著。",
        "translation": "They are all different in various ways, and they all explain their crudeness without attachment.",
        "source": "T10n0279_069:0372b08_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_069:0372b09_27"
    },
    {
        "source_sentence": "知諸如來非去，世趣永滅故；",
        "translation": "They know all buddhas do not depart, because the courses of worldly existence cease forever.",
        "source": "T10n0279_069:0372b09_28"
    },
    {
        "source_sentence": "非來，體性無生故；",
        "translation": "It does not come, because its intrinsic nature is unarisen.",
        "source": "T10n0279_069:0372b10_29"
    },
    {
        "source_sentence": "非生，法身平等故；",
        "translation": "They are not arising, because the reality body is equal.",
        "source": "T10n0279_069:0372b10_30"
    },
    {
        "source_sentence": "非滅，無有生相故；",
        "translation": "It is not cessation, because it does not have the characteristic of arising.",
        "source": "T10n0279_069:0372b11_31"
    },
    {
        "source_sentence": "非實，住如幻法故；",
        "translation": "They are not real, because they abide like illusions.",
        "source": "T10n0279_069:0372b11_32"
    },
    {
        "source_sentence": "非妄，利益眾生故；",
        "translation": "They are not false, because they benefit sentient beings.",
        "source": "T10n0279_069:0372b11_33"
    },
    {
        "source_sentence": "非遷，超過生死故；",
        "translation": "It is not transmigration, because it transcends birth and death.",
        "source": "T10n0279_069:0372b12_34"
    },
    {
        "source_sentence": "非壞，性常不變故；",
        "translation": "They are not broken, because their nature is constant and unchanging.",
        "source": "T10n0279_069:0372b12_35"
    },
    {
        "source_sentence": "一相，言語悉離故；",
        "translation": "They have one characteristic, because words are all absent.",
        "source": "T10n0279_069:0372b13_36"
    },
    {
        "source_sentence": "無相，性相本空故。",
        "translation": "The absence of characteristics is because the nature and characteristics are inherently empty.",
        "source": "T10n0279_069:0372b13_37"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372b14_38"
    },
    {
        "source_sentence": "我如是了知一切如來時，於菩薩寂靜禪定樂普遊步解脫門，分明了達，",
        "translation": "“When I thus perceive all buddhas, I clearly perceive the door of liberation of enlightening beings’ peaceful meditation and blissful excursions.",
        "source": "T10n0279_069:0372b14_39"
    },
    {
        "source_sentence": "成就增長，思惟觀察，堅固莊嚴，不起一切妄想分別，大悲救護一切眾生，",
        "translation": "Accomplishment and growth, contemplation and observation, steadfast adornment, they do not give rise to any deluded conceptions or discriminations. Great compassion saves and protects all sentient beings.",
        "source": "T10n0279_069:0372b15_40"
    },
    {
        "source_sentence": "一心不動，修習初禪；",
        "translation": "They cultivate the first meditative state of absorption with one mind, without moving.",
        "source": "T10n0279_069:0372b17_41"
    },
    {
        "source_sentence": "息一切意業，攝一切眾生，智力勇猛，喜心悅豫，修第二禪；",
        "translation": "He extinguished all mental activity and embraced all sentient beings. Endowed with the power of knowledge and courage, he developed the second meditative state of absorption endowed with joy and bliss.",
        "source": "T10n0279_069:0372b18_42"
    },
    {
        "source_sentence": "思惟一切眾生自性，厭離生死，修第三禪；",
        "translation": "They think of the inherent nature of all sentient beings, become disillusioned with birth and death, and cultivate the third meditation.",
        "source": "T10n0279_069:0372b19_43"
    },
    {
        "source_sentence": "悉能息滅一切眾生眾苦熱惱，修第四禪。",
        "translation": "They can all cease the suffering and fever of all sentient beings and cultivate the fourth dhyāna.",
        "source": "T10n0279_069:0372b20_44"
    },
    {
        "source_sentence": "增長圓滿一切智願，出生一切諸三昧海，入諸菩薩解脫海門，遊戲一切神通，",
        "translation": "They develop and fulfill all vows of omniscience, produce all oceans of concentrations, enter the oceanic doors of liberation of enlightening beings, and play in all mystic powers.",
        "source": "T10n0279_069:0372b21_45"
    },
    {
        "source_sentence": "成就一切變化，以清淨智普入法界。",
        "translation": "Accomplishing all transformations, he enters the Dharma realm with pure knowledge.",
        "source": "T10n0279_069:0372b23_46"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372b23_47"
    },
    {
        "source_sentence": "我修此解脫時，以種種方便成就眾生。",
        "translation": "When I cultivate this liberation, I accomplish sentient beings with various methods.",
        "source": "T10n0279_069:0372b24_48"
    },
    {
        "source_sentence": "所謂：於在家放逸眾生，令生不淨想、可厭想、疲勞想、逼迫想、繫縛想、羅剎想、無常想、苦想、無我想、空想、無生想、不自在想、老病死想。",
        "translation": "They are: the perception of impurity, the perception of disgust, the perception of weariness, the perception of oppression, the perception of bondage, the perception of rāṣṭrapāla, the perception of impermanence,",
        "source": "T10n0279_069:0372b25_0"
    },
    {
        "source_sentence": "自於五欲不生樂著，亦勸眾生不著欲樂，唯住法樂，出離於家，入於非家。",
        "translation": "He himself doesn't become attached to the five desires, and he encourages sentient beings not to cling to desires and pleasures but only to abide in the happiness of the Dharma, leaving home and entering what's not home.",
        "source": "T10n0279_069:0372b28_1"
    },
    {
        "source_sentence": "若有眾生住於空閑，我為止息諸惡音聲，於靜夜時為說深法，與順行緣，",
        "translation": "If there are any sentient beings who live in an open space, I cease the evil sounds of their voices. On a quiet night I teach them the profound Dharma and give them the opportunity to act accordingly.",
        "source": "T10n0279_069:0372b29_2"
    },
    {
        "source_sentence": "開出家門，示正道路，為作光明，除其闇障，滅其怖畏，讚出家業，歎佛、法、僧及善知識具諸功德，",
        "translation": "They open the doors of renunciation and show the right path, to be a light for them, to remove their dark hindrances, to extinguish their fears, to praise renunciation’s work, and to laud the virtues of buddhas,",
        "source": "T10n0279_069:0372c02_3"
    },
    {
        "source_sentence": "亦歎親近善知識行。",
        "translation": "They also praised the practice of being intimate with good teachers.",
        "source": "T10n0279_069:0372c04_4"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T10n0279_069:0372c05_5"
    },
    {
        "source_sentence": "我修解脫時，令諸眾生，不生非法貪，不起邪分別，不作諸罪業。",
        "translation": "When I cultivate liberation, I cause sentient beings not to give rise to unlawful desires, don't discriminate between right and wrong, and don't do crimes.",
        "source": "T10n0279_069:0372c05_6"
    },
    {
        "source_sentence": "若已作者，皆令止息；",
        "translation": "If they have done so, they are all caused to cease.",
        "source": "T10n0279_069:0372c06_7"
    },
    {
        "source_sentence": "若未生善法，未修波羅蜜行，未求一切智，未起大慈悲，未造人天業，",
        "translation": "If they haven’t yet produced good qualities, cultivated the practice of transcendent wisdom, sought omniscience, aroused great compassion, and created human and divine actions,",
        "source": "T10n0279_069:0372c07_8"
    },
    {
        "source_sentence": "皆令其生；",
        "translation": "I cause them all to arise.",
        "source": "T10n0279_069:0372c08_9"
    },
    {
        "source_sentence": "若已生者，令其增長。",
        "translation": "If it has already arisen, he causes it to grow.",
        "source": "T10n0279_069:0372c09_10"
    },
    {
        "source_sentence": "我與如是順道因緣，乃至令成一切智智。",
        "translation": "I and thus follow the causes and conditions of the path, up to the point where I become omniscience.",
        "source": "T10n0279_069:0372c09_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372c10_12"
    },
    {
        "source_sentence": "我唯得此菩薩寂靜禪定樂普遊步解脫門。",
        "translation": "I've only attained the liberation gate of this bodhisattva's tranquil meditation and blissful walking liberation.",
        "source": "T10n0279_069:0372c10_13"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，具足普賢所有行願，了達一切無邊法界，常能增長一切善根，",
        "translation": "“Furthermore, just as the great enlightening beings are imbued with all the practices and vows of universal goodness, they comprehend all the boundless realms of reality and are able to develop all roots of goodness.",
        "source": "T10n0279_069:0372c11_14"
    },
    {
        "source_sentence": "照見一切如來十力，住於一切如來境界，恒處生死，心無障礙，疾能滿足一切智願，",
        "translation": "They see the ten powers of all buddhas. Abiding in the sphere of all buddhas, they dwell constantly in the realm of birth and death. Their minds are unhindered, able to fulfill the vows of omniscience.",
        "source": "T10n0279_069:0372c13_15"
    },
    {
        "source_sentence": "普能往詣一切世界，悉能觀見一切諸佛，遍能聽受一切佛法，能破一切眾生癡闇，",
        "translation": "They can go to all worlds and see all buddhas; able to hear and receive the teachings of all buddhas, they can destroy the darkness of ignorance of all sentient beings.",
        "source": "T10n0279_069:0372c15_16"
    },
    {
        "source_sentence": "能於生死大夜之中出生一切智慧光明；",
        "translation": "In the midst of the great night of birth and death they can produce the light of all knowledge.",
        "source": "T10n0279_069:0372c17_17"
    },
    {
        "source_sentence": "而我云何能知能說彼功德行？",
        "translation": "How can I know and explain their meritorious deeds?",
        "source": "T10n0279_069:0372c18_18"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0372c18_19"
    },
    {
        "source_sentence": "去此不遠，於菩提場右邊，有一夜神，名：喜目觀察眾生。",
        "translation": "Not far from here, to the right of the site of enlightenment, there was a night goddess named Joyful Eye Observing All Sentient Beings.",
        "source": "T10n0279_069:0372c19_20"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何學菩薩行、修菩薩道？」",
        "translation": "Go to them and ask, How do bodhisattvas train in the bodhisattva practice and cultivate the bodhisattva path?",
        "source": "T10n0279_069:0372c20_21"
    },
    {
        "source_sentence": "「若有信解心，　　盡見三世佛；",
        "translation": "“If there is faith and understanding, They will see all the Buddhas of past, present, and future.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　彼人眼清淨，　　能入諸佛海。",
        "translation": "That person's eyes are pure, and they can enter the ocean of buddhas.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　汝觀諸佛身，　　清淨相莊嚴，",
        "translation": "Observe the buddhas’ bodies Adorned with pure forms.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　一念神通力，　　法界悉充滿。",
        "translation": "With a single thought of mystic powers They fill the cosmos of reality.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　盧舍那如來，　　道場成正覺，",
        "translation": "Vairocana Tathāgata At the site of enlightenment He became perfectly enlightened.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　一切法界中，　　轉於淨法輪。",
        "translation": "In all the realms of reality, He turns the pure wheel of teaching.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　如來知法性，　　寂滅無有二，",
        "translation": "The Tathāgata knows the essence of things; Tranquil extinction has no duality.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　清淨相嚴身，　　遍示諸世間。",
        "translation": "The body adorned with pure characteristics Shows everywhere in all worlds.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　佛身不思議，　　法界悉充滿，",
        "translation": "The Buddha’s body is inconceivable, Filling the cosmos of reality.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　普現一切剎，　　一切無不見。",
        "translation": "All lands are manifest everywhere, Yet not seen by anyone.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　佛身常光明，　　一切剎塵等，",
        "translation": "The Buddha’s body is always shining, Equal to all the dust motes of all buddha-lands.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　種種清淨色，　　念念遍法界。",
        "translation": "Various kinds of pure forms Pervade the cosmos in every moment of thought.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　如來一毛孔，　　放不思議光，",
        "translation": "In one pore of the Buddha’s hair Is inconceivable light.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　普照諸群生，　　令其煩惱滅。",
        "translation": "Illuminating all sentient beings, They cause their afflictions to cease.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　如來一毛孔，　　出生無盡化，",
        "translation": "One pore of the Buddha’s hair Produces inexhaustible emanations.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　充遍於法界，　　除滅眾生苦。",
        "translation": "They pervade the realm of reality, Extinguishing the suffering of sentient beings.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　佛演一妙音，　　隨類皆令解，",
        "translation": "The Buddha uttered one subtle sound Causing all beings to understand According to their mentalities.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　普雨廣大法，　　使發菩提意。",
        "translation": "It rains the vast teaching everywhere, causing the mind to give rise to the intention for enlightenment.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　佛昔修諸行，　　已曾攝受我，",
        "translation": "The Buddha cultivated various practices in the past, Having already accepted self.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　故得見如來，　　普現一切剎。",
        "translation": "That’s why they can see the Buddha Manifesting everywhere in all buddha-lands.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　諸佛出世間，　　量等眾生數，",
        "translation": "The Buddhas appear in the world, Equal in number to all beings.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　種種解脫境，　　非我所能知。",
        "translation": "The various objects of liberation Cannot be known by me.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　一切諸菩薩，　　入佛一毛孔，",
        "translation": "All the bodhisattvas entered a single pore of the Buddha’s hair.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　如是妙解脫，　　非我所能知。",
        "translation": "Such is the wondrous liberation that I cannot know.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　此近有夜神，　　名喜目觀察，",
        "translation": "Recently a night goddess named Joyful Eye Observing observed this.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "　汝應往詣彼，　　問修菩薩行。」",
        "translation": "You should go there and ask about cultivating the bodhisattva's practice.",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "爾時，普德淨光夜神，欲重宣此解脫義，為善財童子而說頌曰：時，善財童子頂禮其足，",
        "translation": "At that time the night goddess Pure Light of Universal Virtue, wanting to elaborate on the meaning of this liberation, spoke these verses to Sudhana:",
        "source": "T10n0279_069:0372c21_22"
    },
    {
        "source_sentence": "遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "They circled him innumerable times, looked at him with veneration, withdrew, and departed.",
        "source": "T10n0279_069:0373a20_23"
    },
    {
        "source_sentence": "爾時，善財童子敬善知識教，行善知識語，作如是念：「善知識者，難見難遇；",
        "translation": "At that time, respecting the instruction of spiritual benefactors and following the words of spiritual benefactors, Sudhana thought to himself:",
        "source": "T10n0279_069:0373a22_0"
    },
    {
        "source_sentence": "見善知識，令心不散亂；",
        "translation": "Seeing spiritual benefactors, they do not let their minds be disturbed.",
        "source": "T10n0279_069:0373a23_1"
    },
    {
        "source_sentence": "見善知識，破障礙山；",
        "translation": "Seeing spiritual benefactors, they break down the mountain of obstacles.",
        "source": "T10n0279_069:0373a24_2"
    },
    {
        "source_sentence": "見善知識，入大悲海救護眾生；",
        "translation": "Seeing spiritual benefactors, they enter the ocean of great compassion to save sentient beings.",
        "source": "T10n0279_069:0373a24_3"
    },
    {
        "source_sentence": "見善知識，得智慧光普照法界；",
        "translation": "Seeing spiritual benefactors, they attain the light of knowledge to illumine the cosmos of reality.",
        "source": "T10n0279_069:0373a25_4"
    },
    {
        "source_sentence": "見善知識，悉能修行一切智道；",
        "translation": "Seeing spiritual benefactors, they can all practice the path of omniscience.",
        "source": "T10n0279_069:0373a26_5"
    },
    {
        "source_sentence": "見善知識，普能覩見十方佛海；",
        "translation": "Seeing spiritual benefactors, they were able to see the ocean of buddhas of the ten directions.",
        "source": "T10n0279_069:0373a26_6"
    },
    {
        "source_sentence": "見善知識，得見諸佛轉於法輪憶持不忘。」",
        "translation": "Seeing a good teacher, they'll see the buddhas turning the wheel of the Dharma and remember it without forgetting it.",
        "source": "T10n0279_069:0373a27_7"
    },
    {
        "source_sentence": "作是念已，發意欲詣喜目觀察眾生夜神所。",
        "translation": "After he had this thought, he arouses the intention to go to the joyful eye and observe sentient beings at the night goddess's place.",
        "source": "T10n0279_069:0373a28_8"
    },
    {
        "source_sentence": "時，喜目神加善財童子，令知親近善知識，能生諸善根，增長成熟。",
        "translation": "At the time, the eye of joy divinely empowered the boy Good Wealth to know and associate with good teachers, produce good roots that grow and mature.",
        "source": "T10n0279_069:0373a29_9"
    },
    {
        "source_sentence": "所謂：令知親近善知識，能修助道具；",
        "translation": "They cause to know that they associate with spiritual benefactors and are able to cultivate the aids.",
        "source": "T10n0279_069:0373b01_10"
    },
    {
        "source_sentence": "令知親近善知識，能起勇猛心；",
        "translation": "They become aware that they associate with spiritual benefactors and are able to generate the spirit of enlightenment.",
        "source": "T10n0279_069:0373b02_11"
    },
    {
        "source_sentence": "令知親近善知識，能作難壞業；",
        "translation": "Causing others to know that they are close to spiritual benefactors and be able to perform indestructible acts.",
        "source": "T10n0279_069:0373b03_12"
    },
    {
        "source_sentence": "令知親近善知識，能得難伏力；",
        "translation": "Enlightening beings become aware of the power of associating with spiritual benefactors, and are able to attain invincible strength.",
        "source": "T10n0279_069:0373b04_13"
    },
    {
        "source_sentence": "令知親近善知識，能入無邊方；",
        "translation": "Causing them to know that they are close to spiritual benefactors and be able to enter boundless directions.",
        "source": "T10n0279_069:0373b04_14"
    },
    {
        "source_sentence": "令知親近善知識，能久遠修行；",
        "translation": "They become intimate with spiritual benefactors and are able to cultivate enlightening practice for a long time.",
        "source": "T10n0279_069:0373b05_15"
    },
    {
        "source_sentence": "令知親近善知識，能辦無邊業；",
        "translation": "Enlightening beings become aware of the presence of spiritual benefactors and are able to carry out boundless works.",
        "source": "T10n0279_069:0373b06_16"
    },
    {
        "source_sentence": "令知親近善知識，能行無量道；",
        "translation": "They become aware of the boundless paths leading to spiritual benefactors.",
        "source": "T10n0279_069:0373b06_17"
    },
    {
        "source_sentence": "令知親近善知識，能得速疾力普詣諸剎；",
        "translation": "He caused them to know that they had become intimate with spiritual benefactors and were able to attain speed and power, traveling everywhere to all buddha-lands.",
        "source": "T10n0279_069:0373b07_18"
    },
    {
        "source_sentence": "令知親近善知識，能不離本處遍至十方。",
        "translation": "He causes them to know that they're close to a good teacher and can reach everywhere in the ten directions without leaving their original place.",
        "source": "T10n0279_069:0373b08_19"
    },
    {
        "source_sentence": "時，善財童子遽發是念：「由親近善知識，能勇猛勤修一切智道；",
        "translation": "Sudhana then thought to himself: By associating with spiritual benefactors, I am able to practice the path of omniscience.",
        "source": "T10n0279_069:0373b09_20"
    },
    {
        "source_sentence": "由親近善知識，能速疾出生諸大願海；",
        "translation": "By associating with spiritual benefactors, they can quickly produce oceans of great vows.",
        "source": "T10n0279_069:0373b10_21"
    },
    {
        "source_sentence": "由親近善知識，能為一切眾生，盡未來劫受無邊苦；",
        "translation": "By becoming intimate with spiritual benefactors they will be able to endure boundless suffering for all sentient beings throughout the ages to come.",
        "source": "T10n0279_069:0373b11_22"
    },
    {
        "source_sentence": "由親近善知識，能被大精進甲，於一微塵中說法聲遍法界；",
        "translation": "Because of being close to spiritual benefactors they can receive the armor of great zeal and, in a speck of dust, expound the Teaching so as to pervade the cosmos.",
        "source": "T10n0279_069:0373b13_23"
    },
    {
        "source_sentence": "由親近善知識，能速往詣一切方海；",
        "translation": "By associating with spiritual benefactors, they can quickly go to all oceans of directions.",
        "source": "T10n0279_069:0373b14_24"
    },
    {
        "source_sentence": "由親近善知識，於一毛道，盡未來劫修菩薩行；",
        "translation": "By associating with spiritual benefactors, they cultivate the practice of enlightening beings for as many eons as there are atoms in a single hairtip.",
        "source": "T10n0279_069:0373b15_25"
    },
    {
        "source_sentence": "由親近善知識，於念念中行菩薩行，究竟安住一切智地；",
        "translation": "They become intimate with spiritual benefactors, carry out the practice of enlightening beings in every moment of thought, and ultimately abide in omniscience.",
        "source": "T10n0279_069:0373b16_26"
    },
    {
        "source_sentence": "由親近善知識，能入三世一切如來自在神力諸莊嚴道；",
        "translation": "By becoming intimate with spiritual benefactors they are able to enter the path of adornment of mystic powers of all buddhas of past, present, and future.",
        "source": "T10n0279_069:0373b17_27"
    },
    {
        "source_sentence": "由親近善知識，能常遍入諸法界門；",
        "translation": "By associating with spiritual benefactors, they can always enter all aspects of the cosmos.",
        "source": "T10n0279_069:0373b18_28"
    },
    {
        "source_sentence": "由親近善知識，常緣法界未曾動出，而能遍往十方國土。」",
        "translation": "Because they're intimate with good teachers, they always focus on the Dharma realm without ever leaving it, and they can travel to all the lands in the ten directions.",
        "source": "T10n0279_069:0373b19_29"
    },
    {
        "source_sentence": "爾時，善財童子發是念已，即詣喜目觀察眾生夜神所。",
        "translation": "At that point, the boy of good fortune had this thought, and he went to the night goddess with joyful eyes to observe sentient beings.",
        "source": "T10n0279_069:0373b21_0"
    },
    {
        "source_sentence": "見彼夜神在於如來眾會道場，坐蓮華藏師子之座，入大勢力普喜幢解脫，",
        "translation": "He saw that night goddess sitting on the lotus-treasury lion seat in the assembly hall of the enlightenment site of the Buddha, entered the liberation of Universally Joyful Banner of Great Power.",
        "source": "T10n0279_069:0373b22_1"
    },
    {
        "source_sentence": "於其身上一一毛孔，出無量種變化身雲，隨其所應，以妙言音而為說法，",
        "translation": "In each pore of his body there emerged an infinite cloud of mystical emanations, teaching the Dharma in various ways to sentient beings.",
        "source": "T10n0279_069:0373b23_2"
    },
    {
        "source_sentence": "普攝無量一切眾生，皆令歡喜而得利益。",
        "translation": "They universally embrace measureless all sentient beings, causing them to rejoice and attain benefit.",
        "source": "T10n0279_069:0373b25_3"
    },
    {
        "source_sentence": "所謂：出無量化身雲，充滿十方一切世界，說諸菩薩行檀波羅蜜，於一切事皆無戀著，",
        "translation": "They produced infinite clouds of myriad emanation bodies filling all worlds in the ten directions, teaching enlightening beings to practice transcendence of giving, not clinging to anything.",
        "source": "T10n0279_069:0373b26_4"
    },
    {
        "source_sentence": "於一切眾生普皆施與；",
        "translation": "They give to all sentient beings.",
        "source": "T10n0279_069:0373b28_5"
    },
    {
        "source_sentence": "其心平等，無有輕慢，內外悉施，難捨能捨。",
        "translation": "Their minds are impartial, without any conceit or pride. They give both internally and externally; it is difficult to relinquish but they can relinquish.",
        "source": "T10n0279_069:0373b29_0"
    },
    {
        "source_sentence": "又出等眾生數無量化身雲，充滿法界，普現一切眾生之前，說持淨戒無有缺犯，",
        "translation": "They also produced infinite clouds of emanation bodies equal in number to all sentient beings, filling the cosmos, appearing before all sentient beings everywhere, teaching them how to observe pure precepts without transgression.",
        "source": "T10n0279_069:0373c01_0"
    },
    {
        "source_sentence": "修諸苦行皆悉具足，於諸世間無有所依，於諸境界無所愛著，說在生死輪迴往返，",
        "translation": "They cultivate all ascetic practices, being fully endowed with them. They have no reliance on anything in the world and are not attached to objects. They say they dwell in the transmigration of birth and death.",
        "source": "T10n0279_069:0373c02_1"
    },
    {
        "source_sentence": "說諸人天盛衰苦樂，說諸境界皆是不淨，說一切法皆是無常，說一切行悉苦無味，",
        "translation": "He teaches that all things are impermanent, and he teaches that all conditioned things are painful and tasteless.",
        "source": "T10n0279_069:0373c04_2"
    },
    {
        "source_sentence": "令諸世間捨離顛倒，住諸佛境持如來戒。",
        "translation": "They cause all the worlds to abandon mistakenness and abide in the buddha-realm, upholding the Tathāgata's precepts.",
        "source": "T10n0279_069:0373c06_3"
    },
    {
        "source_sentence": "如是演說種種戒行，戒香普熏，令諸眾生悉得成熟。",
        "translation": "Thus they expound the various practices of morality, and the fragrance of morality pervades them all, enabling sentient beings to attain maturity.",
        "source": "T10n0279_069:0373c07_4"
    },
    {
        "source_sentence": "又出等眾生數種種身雲，說能忍受一切眾苦，所謂：割截、捶楚、訶罵、欺辱，",
        "translation": "It also produced clouds of various bodies equal to the number of sentient beings, saying that they could endure all kinds of suffering, which were cut off, beaten, scolded, reprimanded, and humiliated.",
        "source": "T10n0279_069:0373c08_5"
    },
    {
        "source_sentence": "其心泰然，不動不亂；",
        "translation": "Their minds were peaceful, unmoving and undisturbed.",
        "source": "T10n0279_069:0373c10_6"
    },
    {
        "source_sentence": "於一切行不卑不高，於諸眾生不起我慢，於諸法性安住忍受；",
        "translation": "They are not inferior or inferior in all practices, do not give rise to self-conceit toward sentient beings; they abide by patience regarding the nature of things.",
        "source": "T10n0279_069:0373c10_7"
    },
    {
        "source_sentence": "說菩提心無有窮盡，心無盡故智亦無盡，普斷一切眾生煩惱；",
        "translation": "Explaining that the determination for enlightenment has no end, knowledge also has no end because minds are inexhaustible. It universally eliminates the afflictions of all sentient beings.",
        "source": "T10n0279_069:0373c12_8"
    },
    {
        "source_sentence": "說諸眾生卑賤醜陋不具足身，令生厭離；",
        "translation": "They say all sentient beings are inferior, ugly, and not endowed with physical forms, causing them to become disillusioned.",
        "source": "T10n0279_069:0373c13_9"
    },
    {
        "source_sentence": "讚諸如來清淨妙色無上之身，令生欣樂。",
        "translation": "Praising the pure and marvelous form of the Tathāgata's unsurpassed body, he causes joy to arise.",
        "source": "T10n0279_069:0373c14_10"
    },
    {
        "source_sentence": "如是方便，成熟眾生。",
        "translation": "Such is the method of ripening sentient beings.",
        "source": "T10n0279_069:0373c15_11"
    },
    {
        "source_sentence": "又出等眾生界種種身雲，隨諸眾生心之所樂，說勇猛精進，修一切智助道之法；",
        "translation": "They also produced clouds of various bodies equal in number to all sentient beings, teaching courageous effort according to the mental pleasures of sentient beings, cultivating omniscience as a means of fostering enlightenment.",
        "source": "T10n0279_069:0373c16_12"
    },
    {
        "source_sentence": "勇猛精進，降伏魔怨；",
        "translation": "They are courageous and diligent, subjugating Māra’s enemies.",
        "source": "T10n0279_069:0373c17_13"
    },
    {
        "source_sentence": "勇猛精進，發菩提心，不動不退；",
        "translation": "They are courageous and diligent, arousing the determination for enlightenment without moving or retreating.",
        "source": "T10n0279_069:0373c18_14"
    },
    {
        "source_sentence": "勇猛精進，度一切眾生，出生死海；",
        "translation": "By courageous effort they liberate all sentient beings, leaving the sea of birth and death.",
        "source": "T10n0279_069:0373c19_15"
    },
    {
        "source_sentence": "勇猛精進，除滅一切惡道諸難；",
        "translation": "Courageous zeal removes the difficulties of all states of woeful states.",
        "source": "T10n0279_069:0373c19_16"
    },
    {
        "source_sentence": "勇猛精進，壞無智山；",
        "translation": "With heroic zeal he destroyed the mountain of ignorance.",
        "source": "T10n0279_069:0373c20_17"
    },
    {
        "source_sentence": "勇猛精進，供養一切諸佛如來不生疲厭；",
        "translation": "They are courageous and diligent, honoring all buddha-tathāgatas without weariness.",
        "source": "T10n0279_069:0373c21_18"
    },
    {
        "source_sentence": "勇猛精進，受持一切諸佛法輪；",
        "translation": "They are courageous and diligent, accepting and upholding the teachings of all buddhas.",
        "source": "T10n0279_069:0373c22_0"
    },
    {
        "source_sentence": "勇猛精進，壞散一切諸障礙山；",
        "translation": "By heroic effort they scattered all the mountains of obstruction.",
        "source": "T10n0279_069:0373c22_1"
    },
    {
        "source_sentence": "勇猛精進，教化成熟一切眾生；",
        "translation": "Courageous and energetic, they teach and develop all sentient beings.",
        "source": "T10n0279_069:0373c23_2"
    },
    {
        "source_sentence": "勇猛精進，嚴淨一切諸佛國土。",
        "translation": "With courageous effort, they adorn and purify all the buddha-lands.",
        "source": "T10n0279_069:0373c24_3"
    },
    {
        "source_sentence": "如是方便，成熟眾生。",
        "translation": "Such is the method of ripening sentient beings.",
        "source": "T10n0279_069:0373c24_4"
    },
    {
        "source_sentence": "又出種種無量身雲，以種種方便，令諸眾生，心生歡喜，捨離惡意，厭一切欲；",
        "translation": "They also produced various kinds of clouds of immeasurable bodies, by various means causing sentient beings to become joyous, getting rid of evil thoughts and disillusioned with all desires.",
        "source": "T10n0279_069:0373c25_5"
    },
    {
        "source_sentence": "為說慚愧，令諸眾生藏護諸根；",
        "translation": "I elucidate shame and embarrassment in order to cause sentient beings to guard their faculties.",
        "source": "T10n0279_069:0373c27_6"
    },
    {
        "source_sentence": "為說無上清淨梵行；",
        "translation": "I elucidate the unexcelled practice of pure and genuine austerity.",
        "source": "T10n0279_069:0373c27_7"
    },
    {
        "source_sentence": "為說欲界是魔境界，令生恐怖；",
        "translation": "They teach that the realm of desire is a realm of demons, terrifying beings.",
        "source": "T10n0279_069:0373c28_8"
    },
    {
        "source_sentence": "為現不樂世間欲樂，住於法樂，隨其次第，入諸禪定諸三昧樂，令思惟觀察，",
        "translation": "In order to manifest unpleasant worldly desires and pleasures, they abide in the bliss of the Dharma. In accordance with their order, entering into meditation is the bliss of concentration, causing them to be reflected upon and contemplated.",
        "source": "T10n0279_069:0373c28_9"
    },
    {
        "source_sentence": "除滅一切所有煩惱；",
        "translation": "They annihilate all afflictions.",
        "source": "T10n0279_069:0374a01_10"
    },
    {
        "source_sentence": "又為演說一切菩薩諸三昧海神力變現自在遊戲，令諸眾生歡喜適悅，離諸憂怖，",
        "translation": "“Furthermore, to show the ocean of concentrations of all enlightening beings’ spiritual powers they manifest freely and playfully, causing sentient beings to be joyful and blissful and to be free from sorrow and fear.",
        "source": "T10n0279_069:0374a02_11"
    },
    {
        "source_sentence": "其心清淨，諸根猛利，愛重於法，修習增長。",
        "translation": "Their minds are pure and their faculties are vigorous. They cherish the Dharma and practice it increasingly.",
        "source": "T10n0279_069:0374a04_12"
    },
    {
        "source_sentence": "又出等眾生界種種身雲，為說往詣十方國土，供養諸佛及以師長、真善知識，",
        "translation": "They also produced clouds of various bodies equal in number to all sentient beings’ realms, teaching them how to go to the lands of the ten directions and honoring the buddhas and their teachers and true benefactors.",
        "source": "T10n0279_069:0374a05_13"
    },
    {
        "source_sentence": "受持一切諸佛法輪精勤不懈；",
        "translation": "They receive and uphold the teachings of all buddhas, exerting themselves energetically without slackening.",
        "source": "T10n0279_069:0374a06_14"
    },
    {
        "source_sentence": "又為演說、稱讚一切諸如來海，觀察一切諸法門海，顯示一切諸法性相，",
        "translation": "To explain and praise the ocean of all buddhas, to contemplate the ocean of all teachings, to show the essence and characteristics of all truths.",
        "source": "T10n0279_069:0374a07_15"
    },
    {
        "source_sentence": "開闡一切諸三昧門，開智慧境界，竭一切眾生疑海；",
        "translation": "He opened all the doors of concentration and revealed the sphere of knowledge, extinguishing the ocean of doubts of all sentient beings.",
        "source": "T10n0279_069:0374a09_16"
    },
    {
        "source_sentence": "示智慧金剛，壞一切眾生見山；",
        "translation": "He manifested the diamond of knowledge and wisdom, destroying the mountain of all sentient beings’ views.",
        "source": "T10n0279_069:0374a10_17"
    },
    {
        "source_sentence": "昇智慧日輪，破一切眾生癡闇。",
        "translation": "He ascends to the sun-wheel of wisdom and destroys the darkness of ignorance of all sentient beings.",
        "source": "T10n0279_069:0374a11_18"
    },
    {
        "source_sentence": "皆令歡喜，成一切智。",
        "translation": "They all cause them to rejoice and attain omniscience.",
        "source": "T10n0279_069:0374a11_19"
    },
    {
        "source_sentence": "又出等眾生界種種身雲，普詣一切眾生之前，隨其所應，以種種言辭而為說法；",
        "translation": "They also produced clouds of various bodies equal to the number of sentient beings in all worlds, appearing before all sentient beings and teaching them in various ways according to their needs.",
        "source": "T10n0279_069:0374a12_20"
    },
    {
        "source_sentence": "或說世間神通福力；",
        "translation": "Some I elucidate by explaining the worldly power of mystical knowledge and merit.",
        "source": "T10n0279_069:0374a14_21"
    },
    {
        "source_sentence": "或說三界皆是可怖，令其不作世間業行，離三界處，出見稠林；",
        "translation": "Some say that the three realms are all to be feared, enabling them not to do worldly deeds. They leave the realm of the three realms and go forth into a dense forest of views.",
        "source": "T10n0279_069:0374a14_22"
    },
    {
        "source_sentence": "或為稱讚一切智道，令其超越二乘之地；",
        "translation": "Some I help by extolling the path of omniscience, enabling them to transcend the realm of the two vehicles.",
        "source": "T10n0279_069:0374a16_23"
    },
    {
        "source_sentence": "或為演說不住生死、不住涅槃，令其不著有為、無為；",
        "translation": "Some I elucidate by explaining that they do not abide in birth and death or nirvana, to prevent them from clinging to the conditioned and the unconditioned.",
        "source": "T10n0279_069:0374a17_0"
    },
    {
        "source_sentence": "或為演說住於天宮乃至道場，令其欣樂發菩提意。",
        "translation": "Or they may expound the teaching of abiding in the heavenly palace or even at the site of enlightenment, causing them to delight in and give rise to the intention for enlightenment.",
        "source": "T10n0279_069:0374a18_1"
    },
    {
        "source_sentence": "如是方便，教化眾生，皆令究竟得一切智。",
        "translation": "Such skillful means teaches and transforms sentient beings, enabling them to ultimately attain omniscience.",
        "source": "T10n0279_069:0374a19_2"
    },
    {
        "source_sentence": "又出一切世界微塵數身雲，普詣一切眾生之前，念念中，示普賢菩薩一切行願；",
        "translation": "They also produced clouds of bodies as numerous as atoms in all worlds, going to all sentient beings, instant after instant showing them all the practices and vows of enlightening beings.",
        "source": "T10n0279_069:0374a20_3"
    },
    {
        "source_sentence": "念念中，示清淨大願充滿法界；",
        "translation": "In each thought he manifested pure great vows to fill the cosmos of reality.",
        "source": "T10n0279_069:0374a22_4"
    },
    {
        "source_sentence": "念念中，示嚴淨一切世界海；",
        "translation": "In each thought he manifested the adornment and purity of all oceans of worlds.",
        "source": "T10n0279_069:0374a22_5"
    },
    {
        "source_sentence": "念念中，示供養一切如來海；",
        "translation": "In each thought he manifested the ocean of offerings to all buddhas.",
        "source": "T10n0279_069:0374a23_6"
    },
    {
        "source_sentence": "念念中，示入一切法門海；",
        "translation": "In each thought, they show entry into the ocean of all teachings.",
        "source": "T10n0279_069:0374a24_7"
    },
    {
        "source_sentence": "念念中，示入一切世界海、微塵數世界海；",
        "translation": "In each thought he manifested entering all oceans of worlds and as many oceans of worlds as atoms in the ten directions.",
        "source": "T10n0279_069:0374a24_8"
    },
    {
        "source_sentence": "念念中，示於一切剎盡未來劫清淨修行一切智道；",
        "translation": "In each moment of thought they show the pure practice of omniscience in all buddha-lands throughout all future ages.",
        "source": "T10n0279_069:0374a25_9"
    },
    {
        "source_sentence": "念念中，示入如來力；",
        "translation": "In each thought, they show entry into the power of buddhahood.",
        "source": "T10n0279_069:0374a26_10"
    },
    {
        "source_sentence": "念念中，示入一切三世方便海；",
        "translation": "In each thought, they show entry into all oceans of techniques of the past, present, and future.",
        "source": "T10n0279_069:0374a27_11"
    },
    {
        "source_sentence": "念念中，示往一切剎現種種神通變化；",
        "translation": "In each thought he manifested various mystical displays in all buddha-lands of the ten directions.",
        "source": "T10n0279_069:0374a28_0"
    },
    {
        "source_sentence": "念念中，示諸菩薩一切行願，令一切眾生住一切智。",
        "translation": "In each thought, he shows all the practices and vows of enlightening beings and causes all sentient beings to abide in omniscience.",
        "source": "T10n0279_069:0374a28_1"
    },
    {
        "source_sentence": "如是所作，恒無休息。",
        "translation": "Whatever he does in this way, he always does it without resting.",
        "source": "T10n0279_069:0374b01_2"
    },
    {
        "source_sentence": "又出等一切眾生心數身雲，普詣一切眾生之前，說諸菩薩集一切智助道之法無邊際力、求一切智不破壞力、無窮盡力、修無上行不退轉力、無間斷力、於生死法無染著力、能破一切諸魔眾力、遠離一切煩惱垢力、能破一切業障山力、住一切劫修大悲行無疲倦力、震動一切諸佛國土令一切眾生生歡喜力、能破一切諸外道力、普於世間轉法輪力。",
        "translation": "In front of all sentient beings he manifested clouds of mental numbers equal to the number of bodies of all sentient beings and said, “The enlightening beings gather the boundless power of knowledge that aids in the path of omniscience",
        "source": "T10n0279_069:0374b01_3"
    },
    {
        "source_sentence": "以如是等方便成熟，令諸眾生至一切智。",
        "translation": "By such skillful means and maturation, they cause sentient beings to reach omniscience.",
        "source": "T10n0279_069:0374b09_4"
    },
    {
        "source_sentence": "又出等一切眾生心數無量變化色身雲，普詣十方無量世界，隨眾生心，",
        "translation": "“Furthermore, emanating clouds of countless mystical bodies equal in number to the minds of all sentient beings, they traveled to infinite worlds in the ten directions according to the mentalities of sentient beings.",
        "source": "T10n0279_069:0374b10_5"
    },
    {
        "source_sentence": "演說一切菩薩智行。",
        "translation": "He explains all the bodhisattva's wisdom practices.",
        "source": "T10n0279_069:0374b12_6"
    },
    {
        "source_sentence": "所謂：說入一切眾生界海智，說入一切眾生心海智，說入一切眾生根海智，",
        "translation": "They are said to enter the ocean of knowledge of all realms of sentient beings; they are said to enter the ocean of knowledge of the minds of all sentient beings; they are said to enter the ocean of knowledge of the faculties of all sentient",
        "source": "T10n0279_069:0374b12_7"
    },
    {
        "source_sentence": "說入一切眾生行海智，說度一切眾生未曾失時智，說出一切法界音聲智，",
        "translation": "He was knowledgeable of the ocean of practices entering all sentient beings, timely knowledge of liberating all sentient beings without ever losing it, and knowledge of the sounds emanating from all realms of reality.",
        "source": "T10n0279_069:0374b14_8"
    },
    {
        "source_sentence": "說念念遍一切法界海智，說念念知一切世界海壞智，說念念知一切世界海成住莊嚴差別智，",
        "translation": "“Great enlightening beings have ten kinds of knowledge: the knowledge that pervades all oceans of principles of reality in every moment of thought; the knowledge that instant after instant knows the disintegration of all oceans of worlds; the knowledge that",
        "source": "T10n0279_069:0374b16_0"
    },
    {
        "source_sentence": "說念念自在親近供養一切如來聽受法輪智。",
        "translation": "He explains that he's mindful and freely approaches and makes offerings to all the tathāgatas who hear and receive the Dharma wheel of wisdom.",
        "source": "T10n0279_069:0374b18_1"
    },
    {
        "source_sentence": "示現如是智波羅蜜，令諸眾生，皆大歡喜，調暢適悅，其心清淨，生決定解，",
        "translation": "“Great enlightening beings manifest such transcendent knowledge, causing sentient beings to be greatly joyful and harmonious, their minds pure and genuine, producing certain understanding.",
        "source": "T10n0279_069:0374b19_2"
    },
    {
        "source_sentence": "求一切智無有退轉。",
        "translation": "He seeks omniscience without regressing.",
        "source": "T10n0279_069:0374b20_3"
    },
    {
        "source_sentence": "如說菩薩諸波羅蜜成熟眾生，如是宣說一切菩薩種種行法而為利益。",
        "translation": "As he explains the perfections of enlightening beings to develop sentient beings, so he thus explains the various practices of all enlightening beings for their benefit.",
        "source": "T10n0279_069:0374b21_4"
    },
    {
        "source_sentence": "復於一一諸毛孔中，出無量種眾生身雲。",
        "translation": "In each pore, he also produced an infinite variety of clouds of the bodies of sentient beings.",
        "source": "T10n0279_069:0374b23_0"
    },
    {
        "source_sentence": "所謂：出與色究竟天、善現天、善見天、無熱天、無煩天相似身雲，出少廣、廣果、福生、無雲天相似身雲，",
        "translation": "“Furthermore, a cloud of similar bodies emerged in the form-conceiving celestial constellations such as Maheśvara, Sudarśana, Sudarśana, Anavatapta, and so on.",
        "source": "T10n0279_069:0374b23_1"
    },
    {
        "source_sentence": "出遍淨、無量淨、少淨天相似身雲，出光音、無量光、少光天相似身雲，",
        "translation": "It produced clouds similar to the bodies of the Universally Pure, Immeasurable Pure, and Lesser Pure deities. It also produced clouds similar to the bodies of the Light-Sound, Infinitely Pure, and Lesser Light deities.",
        "source": "T10n0279_069:0374b26_2"
    },
    {
        "source_sentence": "出大梵、梵輔、梵眾天相似身雲，出自在天、化樂天、兜率陀天、須夜摩天、忉利天及其采女、諸天子眾相似身雲，",
        "translation": "It produced clouds of similar bodies like the great Brahma, the Brahmaputra, and the Brahmakāyika gods; it also produced clouds of similar bodies like the celestial beings of the Maheśvara, Nirmāṇarati, Kau",
        "source": "T10n0279_069:0374b27_3"
    },
    {
        "source_sentence": "出提頭賴吒乾闥婆王、乾闥婆子、乾闥婆女相似身雲，出毘樓勒叉、鳩槃荼王、鳩槃荼子、鳩槃荼女相似身雲，",
        "translation": "It produced clouds of similar bodies resembling the goddess Dhṛtarāṣṭrapāla, the king of the gandharvas, the daughter of the gandharvas, and the daughter of the gandharvas, and it produced clouds of similar bodies",
        "source": "T10n0279_069:0374c01_4"
    },
    {
        "source_sentence": "出毘樓博叉龍王、龍子、龍女相似身雲，出毘沙門夜叉王、夜叉子、夜叉女相似身雲，",
        "translation": "It produced clouds of similar bodies resembling the forms of the nāga king Virūpākṣa, the nāga son, and the nāga daughter, and also clouds of similar bodies of the yakṣa king Vaiśravaṇa, the yakṣa son",
        "source": "T10n0279_069:0374c03_5"
    },
    {
        "source_sentence": "出大樹緊那羅王、善慧摩睺羅伽王、大速疾力迦樓羅王、羅睺阿脩羅王、閻羅法王及其子、其女相似身雲，",
        "translation": "They produced clouds of great tree kinnara kings, good wisdom mahoraga kings, great speeding garuḍa kings, rāṇa asura kings, dharma kings Yama and their sons, and the resembling bodies of",
        "source": "T10n0279_069:0374c05_6"
    },
    {
        "source_sentence": "出諸人王及其子、其女相似身雲，出聲聞、獨覺及諸佛眾相似身雲，出地神、水神、火神、風神、河神、海神、山神、樹神乃至晝、夜、主方神等相似身雲。",
        "translation": "They produced clouds of resembling bodies of human kings and their sons and daughters, clouds of resembling bodies of śrāvakas, pratyekbuddhas, and buddhas, clouds of resembling bodies of earth god",
        "source": "T10n0279_069:0374c07_7"
    },
    {
        "source_sentence": "周遍十方，充滿法界。",
        "translation": "It pervades the ten directions and fills the cosmos.",
        "source": "T10n0279_069:0374c11_8"
    },
    {
        "source_sentence": "於彼一切眾生之前，現種種聲。",
        "translation": "In front of all those sentient beings, he produces various sounds.",
        "source": "T10n0279_069:0374c11_9"
    },
    {
        "source_sentence": "所謂：風輪聲、水輪聲、火焰聲、海潮聲、地震聲、大山相擊聲、天城震動聲、摩尼相擊聲、天王聲、龍王聲、夜叉王聲、乾闥婆王聲、阿脩羅王聲、迦樓羅王聲、緊那羅王聲、摩睺羅伽王聲、人王聲、梵王聲、天女歌詠聲、諸天音樂聲、摩尼寶王聲。",
        "translation": "The sound of wind, the sound of water, the sound of fire, the sound of ocean tide, the sound of earthquakes, the sound of great mountains striking each other, the sound of heavenly cities quaking, the sound of jewels striking",
        "source": "T10n0279_069:0374c12_10"
    },
    {
        "source_sentence": "以如是等種種音聲，說喜目觀察眾生夜神從初發心所集功德。",
        "translation": "Because of these various sounds, he spoke the joyful eye and observed the merits accumulated by the night goddess from the first arousal of his mind by observing sentient beings.",
        "source": "T10n0279_069:0374c17_11"
    },
    {
        "source_sentence": "所謂：承事一切諸善知識，親近諸佛，修行善法；",
        "translation": "They serve all good teachers, become intimate with the Buddhas, and practice virtuous ways.",
        "source": "T10n0279_069:0374c19_0"
    },
    {
        "source_sentence": "行檀波羅蜜，難捨能捨；",
        "translation": "He practiced the transcendent of giving, being able to give up what was difficult to give up.",
        "source": "T10n0279_069:0374c20_1"
    },
    {
        "source_sentence": "行尸波羅蜜，棄捨王位、宮殿、眷屬，出家學道；",
        "translation": "He practiced the perfection of morality, relinquished his royal throne, palaces, and retinues, renounced household life, and studied the path.",
        "source": "T10n0279_069:0374c20_2"
    },
    {
        "source_sentence": "行羼提波羅蜜，能忍世間一切苦事，及以菩薩所修苦行、所持正法，皆悉堅固，",
        "translation": "He practiced the transcendent tolerance of forbearance, being able to endure all the miseries of worldly sufferings. All the ascetic practices cultivated by enlightening beings and the true doctrine they upheld were all firm and",
        "source": "T10n0279_069:0374c21_3"
    },
    {
        "source_sentence": "其心不動，亦能忍受一切眾生於己身心惡作惡說，忍一切業皆不失壞，",
        "translation": "Their minds are unshakable, and they can tolerate all sentient beings’ evil deeds against their own bodies and minds. They endure all actions without loss or destruction.",
        "source": "T10n0279_069:0374c23_4"
    },
    {
        "source_sentence": "忍一切法生決定解，忍諸法性能諦思惟；",
        "translation": "Tolerance toward all things gives rise to certain understanding; patience regarding the characteristics of things, they meditate on them.",
        "source": "T10n0279_069:0374c25_5"
    },
    {
        "source_sentence": "行精進波羅蜜，起一切智行，成一切佛法；",
        "translation": "Practicing transcendent energy, they develop the practice of omniscience and attain all buddha-teachings.",
        "source": "T10n0279_069:0374c26_6"
    },
    {
        "source_sentence": "行禪波羅蜜，其禪波羅蜜所有資具、所有修習、所有成就、所有清淨、所有起三昧神通、所有入三昧海門，",
        "translation": "He practiced the perfection of meditation, possessing all the requisites for that perfection of meditation, all the cultivations thereof, all the accomplishments thereof, all the purities thereof, all the superknowledges engendering concentration, and all the oceanic",
        "source": "T10n0279_069:0374c27_7"
    },
    {
        "source_sentence": "皆悉顯示；",
        "translation": "They are all revealed.",
        "source": "T10n0279_069:0374c29_8"
    },
    {
        "source_sentence": "行般若波羅蜜，其般若波羅蜜所有資具，所有清淨、大智慧日、大智慧雲、大智慧藏、大智慧門，",
        "translation": "He practiced the perfection of wisdom, and all the necessities of that perfection of wisdom were pure, the sun of great wisdom, the cloud of great wisdom, the store of great wisdom, and the gate of great wisdom.",
        "source": "T10n0279_069:0374c29_9"
    },
    {
        "source_sentence": "皆悉顯示；",
        "translation": "They are all revealed.",
        "source": "T10n0279_069:0375a03_10"
    },
    {
        "source_sentence": "行方便波羅蜜，其方便波羅蜜所有資具、所有修行、所有體性、所有理趣、所有清淨、所有相應事，",
        "translation": "He practices the perfection of skillful means, which has all the necessities for skillful means, all the cultivations, all the essence, all the principles, all the purities, and all the concomitant things.",
        "source": "T10n0279_069:0375a03_11"
    },
    {
        "source_sentence": "皆悉顯示；",
        "translation": "They are all revealed.",
        "source": "T10n0279_069:0375a05_12"
    },
    {
        "source_sentence": "行願波羅蜜，其願波羅蜜所有體性、所有成就、所有修習、所有相應事，",
        "translation": "The transcendent practice of vows is the essence of those vows, their accomplishment, their cultivation, and their concomitant phenomena.",
        "source": "T10n0279_069:0375a05_13"
    },
    {
        "source_sentence": "皆悉顯示；",
        "translation": "They are all revealed.",
        "source": "T10n0279_069:0375a07_14"
    },
    {
        "source_sentence": "行力波羅蜜，其力波羅蜜所有資具、所有因緣、所有理趣、所有演說、所有相應事，",
        "translation": "The perfection of the power of practice is the empowerment that has all the necessities, all the causes and conditions, all the principles, all the explanations, and all the concomitant things.",
        "source": "T10n0279_069:0375a07_15"
    },
    {
        "source_sentence": "皆悉顯示；",
        "translation": "They are all revealed.",
        "source": "T10n0279_069:0375a09_16"
    },
    {
        "source_sentence": "行智波羅蜜，其智波羅蜜所有資具、所有體性、所有成就、所有清淨、所有處所、所有增長、所有深入、所有光明、所有顯示、所有理趣、所有相應事、所有揀擇、所有行相、所有相應法，",
        "translation": "He practiced the perfection of knowledge, knowing all the necessities, all the essential natures, all the accomplishments, all the purities, all the locations, all the growths, all the depths, all the lights, all the manifestations,",
        "source": "T10n0279_069:0375a09_17"
    },
    {
        "source_sentence": "所有所攝法、所知法、所知業、所知剎、所知劫、所知世、所知佛出現、所知佛、所知菩薩，",
        "translation": "“Great enlightening beings have all the teachings that are collected, the teachings that should be known, the actions that should be known, the lands that should be known, the eons that should be known, the worlds that should be known, the",
        "source": "T10n0279_069:0375a13_18"
    },
    {
        "source_sentence": "所知菩薩心、菩薩位、菩薩資具、菩薩發趣、菩薩迴向、菩薩大願、菩薩法輪、菩薩揀擇法、菩薩法海、菩薩法門海、菩薩法旋流、菩薩法理趣，",
        "translation": "They know the mind of enlightening beings, the state of enlightening beings, the provisions for enlightening beings, the initiation of enlightening beings, the dedication of enlightening beings, the great vows of enl",
        "source": "T10n0279_069:0375a15_19"
    },
    {
        "source_sentence": "如是等智波羅蜜相應境界，皆悉顯示，成熟眾生。",
        "translation": "Such are the spheres associated with the perfection of knowledge, all manifesting and developing sentient beings.",
        "source": "T10n0279_069:0375a19_0"
    },
    {
        "source_sentence": "又說此神從初發心所集功德相續次第；",
        "translation": "Further, it is said that the virtues of these gods are accumulated successively from the very first moment of thought.",
        "source": "T10n0279_069:0375a20_1"
    },
    {
        "source_sentence": "所習善根相續次第；",
        "translation": "The roots of goodness cultivated are successive in succession.",
        "source": "T10n0279_069:0375a21_2"
    },
    {
        "source_sentence": "所修無量諸波羅蜜相續次第；",
        "translation": "Countless transcendent ways were cultivated in succession, one after another.",
        "source": "T10n0279_069:0375a21_3"
    },
    {
        "source_sentence": "死此生彼及其名號相續次第；",
        "translation": "Death here, birth there, and their names continue one after another in succession.",
        "source": "T10n0279_069:0375a22_4"
    },
    {
        "source_sentence": "親近善友，承事諸佛，受持正法，修菩薩行，入諸三昧，以三昧力，普見諸佛，",
        "translation": "They associate with spiritual benefactors, serve the Buddhas, receive and uphold the true Teaching; cultivating enlightening practice, they enter concentration. By the power of concentration they see all buddhas everywhere.",
        "source": "T10n0279_069:0375a23_5"
    },
    {
        "source_sentence": "普見諸剎，普知諸劫，深入法界，觀察眾生，入法界海，知諸眾生死此生彼，",
        "translation": "They see all the buddha-lands, know all the ages, enter deeply into the cosmos of reality. Observing sentient beings, they enter the ocean of reality and know that all sentient beings die here and are born there.",
        "source": "T10n0279_069:0375a24_6"
    },
    {
        "source_sentence": "得淨天耳聞一切聲，得淨天眼見一切色，得他心智知眾生心，得宿住智知前際事，",
        "translation": "They attain the pure divine ear to hear all sounds; they attain the pure divine eye to see all forms; they attain knowledge of the minds of others to know the minds of sentient beings; they attain knowledge of past lives to know",
        "source": "T10n0279_069:0375a26_7"
    },
    {
        "source_sentence": "得無依無作神足智通自在遊行遍十方剎，如是所有相續次第；",
        "translation": "They attain the supernormal knowledge of non-dependence and non-manifesting spiritual powers, travel freely through all buddha-lands in the ten directions.",
        "source": "T10n0279_069:0375a28_8"
    },
    {
        "source_sentence": "得菩薩解脫，入菩薩解脫海，得菩薩自在，得菩薩勇猛，得菩薩遊步，",
        "translation": "Attaining enlightening beings’ liberation, they enter the ocean of enlightening beings’ liberation; attaining enlightening beings’ freedom, attaining enlightening beings’ courage, attaining enlightening beings’",
        "source": "T10n0279_069:0375a29_9"
    },
    {
        "source_sentence": "住菩薩想，入菩薩道，如是一切所有功德相續次第。",
        "translation": "Abiding in the perception of enlightening beings and entering the path of enlightening beings, all these virtues that are possessed by bodhisattvas continue one after another.",
        "source": "T10n0279_069:0375b02_10"
    },
    {
        "source_sentence": "皆悉演說，分別顯示，成熟眾生。",
        "translation": "They are all explained, discerned, and shown, to ripen sentient beings.",
        "source": "T10n0279_069:0375b03_11"
    },
    {
        "source_sentence": "如是說時，於念念中，十方各嚴淨不可說不可說諸佛國土，度脫無量惡趣眾生，",
        "translation": "“When they had thus discoursed, each moment of thought purified the untold buddha-lands in the ten directions, liberating countless sentient beings from the states of woe.",
        "source": "T10n0279_069:0375b04_12"
    },
    {
        "source_sentence": "令無量眾生生天人中富貴自在，令無量眾生出生死海，令無量眾生安住聲聞、辟支佛地，",
        "translation": "They cause innumerable sentient beings to be born among gods and humans, rich and prosperous, free from the sea of birth and death, and cause innumerable sentient beings to live peacefully in the states of śrāvakas and prat",
        "source": "T10n0279_069:0375b06_13"
    },
    {
        "source_sentence": "令無量眾生住如來地。",
        "translation": "He causes measureless sentient beings to live in the Tathāgata's land.",
        "source": "T10n0279_069:0375b08_14"
    },
    {
        "source_sentence": "爾時，善財童子見聞如上所現一切諸希有事，念念觀察，思惟解了，深入安住，",
        "translation": "At that time, seeing and hearing all the rare things as shown above, Sudhana observed them moment by moment, reflecting on and understanding them, deeply dwelling there.",
        "source": "T10n0279_069:0375b08_15"
    },
    {
        "source_sentence": "承佛威力及解脫力，則得菩薩不思議大勢力普喜幢自在力解脫。",
        "translation": "By inheriting the Buddha's authoritative power and the power of liberation, they attain the liberation of the bodhisattva's inconceivable great power of the universally joyful banner of unimpeded power.",
        "source": "T10n0279_069:0375b10_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_069:0375b12_17"
    },
    {
        "source_sentence": "與喜目夜神於往昔時同修行故，如來神力所加持故，不思議善根所祐助故，",
        "translation": "Because in the past they practiced together with the night goddess Joyful Eye, because they were supported by the spiritual power of Buddha and assisted by roots of goodness.",
        "source": "T10n0279_069:0375b12_18"
    },
    {
        "source_sentence": "得菩薩諸根故，生如來種中故，得善友力所攝受故，受諸如來所護念故，",
        "translation": "Because they attain the faculties of enlightening beings, because they are born in the lineage of buddhas, because they become absorbed by the power of spiritual benefactors, because they receive the protection of buddhas.",
        "source": "T10n0279_069:0375b14_19"
    },
    {
        "source_sentence": "毘盧遮那如來曾所化故，彼分善根已成熟故，堪修普賢菩薩行故。",
        "translation": "Because Vairocana Tathāgata once taught it, because those parts of the good roots have matured, and because they're capable of cultivating the bodhisattva practice of Samantabhadra.",
        "source": "T10n0279_069:0375b15_20"
    },
    {
        "source_sentence": "「無量無數劫，　　學佛甚深法，",
        "translation": "“For immeasurable, incalculably long eons I have studied the profound teaching of buddhahood.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　隨其所應化，　　顯現妙色身。",
        "translation": "According to what they should be transformed, They manifest marvelous physical bodies.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　了知諸眾生，　　沈迷嬰妄想，",
        "translation": "Knowing that all sentient beings are addicted to deluded thoughts,",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　種種身皆現，　　隨應悉調伏。",
        "translation": "Various bodies are manifested, All being disciplined according to their needs.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　法身恒寂靜，　　清淨無二相，",
        "translation": "The body of reality is always tranquil, Pure and without dual characteristics.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　為化眾生故，　　示現種種形。",
        "translation": "For the sake of transforming sentient beings, they show various forms.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　於諸蘊界處，　　未曾有所著，",
        "translation": "They have never been attached To the aggregates, elements, or sense-fields.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　示行及色身，　　調伏一切眾。",
        "translation": "He shows his practice and form body to tame all sentient beings.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　不著內外法，　　已度生死海，",
        "translation": "Not attached to internal or external phenomena, they’ve crossed the sea of birth and death.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　而現種種身，　　住於諸有界。",
        "translation": "He manifests various bodies, Abiding in all realms of existence.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　遠離諸分別，　　戲論所不動，",
        "translation": "They are free of discrimination, Unmoved by conceptual elaborations.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　為著妄想者，　　弘宣十力法。",
        "translation": "For the sake of those attached to deluded conceptions, he spreads the teaching of the ten powers.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　一心住三昧，　　無量劫不動，",
        "translation": "Abiding in concentration with one mind, they don’t move for an infinite number of eons.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　毛孔出化雲，　　供養十方佛。",
        "translation": "The pores of his hair produced clouds of emanation, Making offerings to the buddhas of the ten directions.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　得佛方便力，　　念念無邊際，",
        "translation": "Attaining the power of Buddha’s skill in means, Each thought has no bounds.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　示現種種身，　　普攝諸群生。",
        "translation": "He manifests various bodies To embrace all sentient beings.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　了知諸有海，　　種種業莊嚴，",
        "translation": "Knowing the ocean of existences, Adorned by various deeds,",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　為說無礙法，　　令其悉清淨。",
        "translation": "He teaches the unhindered Dharma To make them all pure.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　色身妙無比，　　清淨如普賢，",
        "translation": "Their form and body are incomparable, Pure as Samantabhadra.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "　隨諸眾生心，　　示現世間相。」",
        "translation": "According to the minds of sentient beings, they show worldly appearances.",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "爾時，善財童子得此解脫已，心生歡喜，合掌向喜目觀察眾生夜神，以偈讚曰：爾時，",
        "translation": "At that time, having attained this liberation, Sudhana paid his respects to the night goddess Sarvagandhasugandhā and praised her:",
        "source": "T10n0279_069:0375b17_21"
    },
    {
        "source_sentence": "善財童子說此頌已，白言：「天神！",
        "translation": "After speaking these verses, the boy of good fortune said, Goddess!",
        "source": "T10n0279_069:0375c11_22"
    },
    {
        "source_sentence": "汝發阿耨多羅三藐三菩提心，為幾時耶？",
        "translation": "When did you give rise to the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T10n0279_069:0375c11_23"
    },
    {
        "source_sentence": "得此解脫，其已久如？」",
        "translation": "How long has it been since you attained this liberation?",
        "source": "T10n0279_069:0375c12_24"
    },
    {
        "source_sentence": "「我念過去世，　　過於剎塵劫，",
        "translation": "“I remember past eons, More than an infinite number of eons:",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　剎號摩尼光，　　劫名寂靜音。",
        "translation": "The blaze is called Maṇi Guang, and the kalpa is called Silent Sound.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　百萬那由他，　　俱胝四天下，",
        "translation": "Hundreds of millions of myriads of koṭis of nayutas, In the four quarters of the earth.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　其王數亦爾，　　各各自臨馭。",
        "translation": "The kings are also numerous, Each one leading his own chariot.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　中有一王都，　　號曰香幢寶，",
        "translation": "In the middle was a royal capital called Fragrant Banner Jewel.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　莊嚴最殊妙，　　見者皆欣悅。",
        "translation": "The adornments are most marvelous, and those who see them all rejoice.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　中有轉輪王，　　其身甚微妙，",
        "translation": "In the midst of it is a wheel-turning king Whose body is extremely subtle.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　三十二種相，　　隨好以莊嚴；",
        "translation": "The thirty-two kinds of marks Are adorned with the secondary signs.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　蓮華中化生，　　金色光明身，",
        "translation": "In the middle of the lotus flower is a magical being, With a golden-colored body of light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　騰空照遠近，　　普及閻浮界。",
        "translation": "He rises up into space and illuminates the distant and near, reaching everywhere in Jambudvīpa.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　其王有千子，　　勇猛身端正；",
        "translation": "The king had a thousand princes, Armed and brave, Whose bodies were dignified.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　臣佐滿一億，　　智慧善方便；",
        "translation": "Their ministers were counted to be one hundred million in number, Endowed with wisdom and skillful means.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　嬪御有十億，　　顏容狀天女，",
        "translation": "Hundreds of myriads of koṭis of celestial maidens with divine features adorned the palace.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　利益調柔意，　　慈心給侍王。",
        "translation": "Benefiting from the mind of gentleness and gentleness, he bestows compassion on his attendant king.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　其王以法化，　　普及四天下，",
        "translation": "That king, transformed by the teaching of the Dharma, Pervaded the four quarters of the earth.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　輪圍大地中，　　一切皆豐盛。",
        "translation": "In the great land surrounding the wheel, everything is abundant.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我時為寶女，　　具足梵音聲，",
        "translation": "I was then a precious woman, endowed with the divine voice of Brahma.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　身出金色光，　　照及千由旬。",
        "translation": "His body emitted a golden light that shone for a thousand yojanas.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　日光既已沒，　　音樂咸寂然，",
        "translation": "The sunlight had already gone down, and the music was all silent.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　大王及侍御，　　一切皆安寢。",
        "translation": "The great king and his attendants all slept peacefully.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　彼時德海佛，　　出興於世間，",
        "translation": "At that time the buddha Ocean of Virtue Buddha Arose in the world.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　顯現神通力，　　充滿十方界；",
        "translation": "Manifesting mystic powers, They fill the worlds of the ten directions.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　放大光明海，　　一切剎塵數，",
        "translation": "They emanate great oceans of light, As numerous as atoms in all the buddha-lands.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　種種自在身，　　遍滿於十方。",
        "translation": "The various self-contained bodies Pervade the ten directions.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　地震出妙音，　　普告佛興世；",
        "translation": "The earthquake produced a wondrous sound, Telling the Buddha to appear in the world.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　天人龍神眾，　　一切皆歡喜。",
        "translation": "Gods, humans, dragons, and goddesses all rejoiced.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　一一毛孔中，　　出佛化身海，",
        "translation": "In each hair pore Is an ocean of buddha-body emanations;",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　十方皆遍滿，　　隨應說妙法。",
        "translation": "Pervading everywhere in the ten directions, he explains the wonderful teaching as appropriate.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我時於夢中，　　見佛諸神變，",
        "translation": "At that time, in a dream, I saw the miraculous transformations of the Buddha.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　亦聞深妙法，　　心生大歡喜。",
        "translation": "They also hear the profound and wondrous Dharma, And their hearts become greatly joyful.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　一萬主夜神，　　共在空中住，",
        "translation": "Ten thousand lords of the night gods live together in the sky.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　讚歎佛興世，　　同時覺悟我：",
        "translation": "Praising the Buddha’s rise in the world, They all simultaneously awakened me:",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "『賢慧汝應起，　　佛已現汝國，",
        "translation": "Good men, you should give rise to wisdom. The Buddha has already appeared in your land.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　劫海難值遇，　　見者得清淨。』",
        "translation": "It's difficult to meet in an ocean of eons, and those who see it will attain purity.'",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我時便寐寤，　　即覩清淨光。",
        "translation": "I then fell asleep, Which is to say that I saw the pure light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　觀此從何來？　　見佛樹王下，",
        "translation": "Observing where it came from, he saw the buddha-trees at the foot of the great tree.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　諸相莊嚴體，　　猶如寶山王；",
        "translation": "The essence of the adornment of all marks Is like a jeweled mountain king.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　一切毛孔中，　　放大光明海。",
        "translation": "In all the pores of his hair, he radiates an ocean of light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　見已心歡喜，　　便生此念言：",
        "translation": "Rejoicing at the sight, They think:",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "『願我得如佛，　　廣大神通力。』",
        "translation": "'May I attain the vast miraculous power of being like the Buddha.'",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我時尋覺寤，　　大王并眷屬，",
        "translation": "At the time, I was awake and saw that the great king and his retinue were in distress.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　令見佛光明，　　一切皆欣慶。",
        "translation": "Causing people to see the Buddha’s light, They all rejoice.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我時與大王，　　騎從千萬億，",
        "translation": "I and the great king rode a thousand koṭis of my horses.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　眾生亦無量，　　俱行詣佛所。",
        "translation": "The sentient beings are also immeasurable, All traveling together to the Buddha.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我於二萬歲，　　供養彼如來，",
        "translation": "At the age of twenty thousand years, I'll offer support to that Tathāgata.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　七寶四天下，　　一切皆奉施。",
        "translation": "The seven treasures of the four continents under heaven They give to all.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　時彼如來說，　　功德普雲經，",
        "translation": "The Tathāgata then taught the Universal Cloud of Virtue Sutra,",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　普應群生心，　　莊嚴諸願海。",
        "translation": "In accord with the minds of all sentient beings, they adorn the ocean of vows.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　夜神覺悟我，　　令我得利益，",
        "translation": "The night goddess awakened me, enabling me to gain benefit.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我願作是身，　　覺諸放逸者。",
        "translation": "I wish to create this body, awakening those who are careless.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我從此初發，　　最上菩提願，",
        "translation": "From this I first undertake the supreme vow for enlightenment.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　往來諸有中，　　其心無忘失。",
        "translation": "In all the past and future existences, his mind isn't forgetful.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　從此後供養，　　十億那由佛，",
        "translation": "After this, they will pay homage to billions of buddhas.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　恒受人天樂，　　饒益諸群生。",
        "translation": "They always experience the pleasures of humans and gods, Benefiting all living beings.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　初佛功德海；　　第二功德燈；",
        "translation": "The first is the ocean of buddha-merit; the second is the lamp of virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第三妙寶幢；　　第四虛空智；",
        "translation": "The third is the supremely beautiful jeweled banner, the fourth spacelike knowledge.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五蓮華藏；　　第六無礙慧；",
        "translation": "The fifth is the lotus-treasury, and the sixth is unhindered knowledge.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第七法月王；　　第八智燈輪；",
        "translation": "The seventh is the king of the moon of truth; the eighth is the wheel of the lamp of knowledge.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第九兩足尊，　　寶焰山燈王；",
        "translation": "The ninth, the two-legged honored one, Is Jewel Flame Mountain Lamp King.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第十調御師，　　三世華光音。",
        "translation": "The tenth tamer, the royal teacher, is the voice of the Flower Light of the Three Worlds.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等諸佛，　　我悉曾供養，",
        "translation": "Such buddhas as these I have served and honored.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　然未得慧眼，　　入於解脫海。",
        "translation": "Still, they haven't yet attained the eye of wisdom and entered the ocean of liberation.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　從此次第有，　　一切寶光剎，",
        "translation": "Every time there is a buddha-land of the light of all jewels,",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　其劫名天勝，　　五百佛興世。",
        "translation": "That eon will be called Deva Supreme, With five hundred buddhas appearing in the world.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　最初月光輪；　　第二名日燈；",
        "translation": "The first is the wheel of light of the moon; the second is called the lamp of the sun.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第三名光幢；　　第四寶須彌；",
        "translation": "The third is called Banner of Light, and the fourth is called Jewel Mountain.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五名華焰；　　第六號燈海；",
        "translation": "The fifth is called Flower Flame, and the sixth is called Ocean of Light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第七熾然佛；　　第八天藏佛；",
        "translation": "The seventh buddha was Fiery Flame, and the eighth was Celestial Treasury.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　九光明王幢；　　十普智光王。",
        "translation": "“Great enlightening beings have ten kinds of jewels:",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等諸佛，　　我悉曾供養，",
        "translation": "Such buddhas as these I have served and honored.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　尚於諸法中，　　無而計為有。",
        "translation": "In all the dharmas, They are not really existent And yet they are thought to be nonexistent.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　從此復有劫，　　名曰梵光明；",
        "translation": "From here there is another world age, called Brahmakāyika.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　世界蓮華燈，　　莊嚴極殊妙。",
        "translation": "The world is adorned with lotus-flower lamps, most exquisitely arrayed.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　彼有無量佛，　　一一無量眾，",
        "translation": "There are countless buddhas there, Each one with an infinite number of congregations.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我悉曾供養，　　尊重聽聞法。",
        "translation": "I've made offerings to all of them and honored those who hear the teaching.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　初寶須彌佛；　　二功德海佛；",
        "translation": "The first was the Buddha Jewel-like Polar Mountain; the second was the Buddha Ocean of Virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　三法界音佛；　　四法震雷佛；",
        "translation": "“Great enlightening beings are the Buddha of Universal Sound of the Teaching, the Buddha of Realm of Reality, the Buddha of Truth, and the Buddha of Thunder.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　五名法幢佛；　　六名地光佛；",
        "translation": "The fifth is called Dharma Banner Buddha; the sixth is called Earth Light Buddha.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　七名法力光；　　八名虛空覺；",
        "translation": "The seventh is called Light of the Power of Truth; the eighth is called Spacelike Awareness.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第九須彌光；　　第十功德雲。",
        "translation": "The ninth is the light of the polar mountain; the tenth is the cloud of virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等如來，　　我悉曾供養，",
        "translation": "Such buddhas as these I have served and honored.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　未能明了法，　　而入諸佛海。",
        "translation": "They can’t clearly understand the teaching And yet enter the ocean of buddhas.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次後復有劫，　　名為功德月；",
        "translation": "“After that is another kalpa, called the Virtuous Moon.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　爾時有世界，　　其名功德幢。",
        "translation": "At the time, there was a world named Banner of Virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　彼中有諸佛，　　八十那由他，",
        "translation": "The buddhas there are Eighty-nine hundred yojanas in number.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我皆以妙供，　　深心而敬奉。",
        "translation": "All of them I deeply venerate with my mind and reverence With marvelous offerings.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　初乾闥婆王；　　二名大樹王；",
        "translation": "The first was the king of gandharvas; the second was named Great King of Trees.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　三功德須彌；　　第四寶眼佛；",
        "translation": "Mount Sumeru of the Three Virtues; the fourth buddha, Jewel Eye Buddha.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五盧舍那；　　第六光莊嚴；",
        "translation": "The fifth was Vairocana, adorned by the sixth ray of light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第七法海佛；　　第八光勝佛；",
        "translation": "The seventh buddha was Ocean of Truth, the eighth was Supreme Light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　九名賢勝佛；　　第十法王佛。",
        "translation": "The ninth buddha was named Bhadravyūha Buddha and the tenth buddha Dharma King Buddha.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等諸佛，　　我悉曾供養，",
        "translation": "Such buddhas as these I have served and honored.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　然未得深智，　　入於諸法海。",
        "translation": "Still, they haven't yet attained profound knowledge and entered the ocean of dharmas.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　此後復有劫，　　名為寂靜慧，",
        "translation": "There will be another age after this, called Silent Wisdom.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　剎號金剛寶，　　莊嚴悉殊妙。",
        "translation": "The buddha-lands are called Diamond Jewels, All beautifully adorned.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　於中有千佛，　　次第而出興，",
        "translation": "Within it were a thousand buddhas, Which emerged one after another.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　眾生少煩惱，　　眾會悉清淨。",
        "translation": "Sentient beings have few afflictions, but the congregations are all pure.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　初金剛臍佛；　　二無礙力佛；",
        "translation": "The first was Diamond Navel Buddha; the second was Unobstructed Power Buddha.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　三名法界影；　　四號十方燈；",
        "translation": "The third is called “shadow of the realm of reality,” and the fourth is called “lamp of the ten directions.”",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五名悲光；　　第六名戒海；",
        "translation": "The fifth is the light of compassion; the sixth is ocean of morality.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第七忍燈輪；　　第八法輪光；",
        "translation": "The seventh is the wheel of the lamp of forbearance, and the eighth is the light of the wheel of teaching.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　九名光莊嚴；　　十名寂靜光。",
        "translation": "The ninth name is Array of Light; the tenth name is Silent Light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等諸佛，　　我悉曾供養，",
        "translation": "Such buddhas as these I have served and honored.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　猶未能深悟，　　如空清淨法。",
        "translation": "They still can't deeply understand the pure dharmas like emptiness.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　遊行一切剎，　　於彼修諸行。",
        "translation": "He travels to all the buddha-lands And cultivates practice there.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次第復有劫，　　名為善出現，",
        "translation": "In succession, there is another kalpa called Sudarśana.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　剎號香燈雲，　　淨穢所共成。",
        "translation": "The blains are called clouds of fragrant lamps, Formed together by the pure and the defiled.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　億佛於中現，　　莊嚴剎及劫，",
        "translation": "Hundreds of myriads of buddhas appear there, Adorning buddha-lands and eons.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　所說種種法，　　我皆能憶持。",
        "translation": "I can remember the various teachings I teach.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　初名廣稱佛；　　次名法海佛；",
        "translation": "The first is called the Buddha of Extensive Fame, and the second is called the Buddha of the Ocean of Teaching.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　三名自在王；　　四名功德雲；",
        "translation": "The third is called independent king, and the fourth is called cloud of virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五法勝佛；　　第六天冠佛；",
        "translation": "The fifth was Supreme Buddha of the Law and the sixth was Celestial Crown Buddha.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第七智焰佛；　　第八虛空音；",
        "translation": "The seventh buddha was Flame of Knowledge Buddha; the eighth buddha was Spacelike Sound.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第九兩足尊，　　名普生殊勝；",
        "translation": "The ninth, the two-legged honored one, Is called Producing Everywhere Supreme.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第十無上士，　　眉間勝光明。",
        "translation": "The tenth unsurpassed person has a superior light between his eyebrows.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是一切佛，　　我悉曾供養，",
        "translation": "All these buddhas I honored and served.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　然猶未能淨，　　離諸障礙道。",
        "translation": "Still, they can't purify the path that's free of obstructions.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次第復有劫，　　名集堅固王，",
        "translation": "In succession, there are also other kalpas called the assembly of the steadfast king.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　剎號寶幢王，　　一切善分布。",
        "translation": "The monastery is called Jewel Banner King, All well distributed.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　有五百諸佛，　　於中而出現；",
        "translation": "Five hundred buddhas emerged there.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我恭敬供養，　　求無礙解脫。",
        "translation": "I venerate and make offerings, seeking unobstructed liberation.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　最初功德輪；　　其次寂靜音；",
        "translation": "The first is the wheel of virtue, followed by the sound of tranquility.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次名功德海；　　次名日光王；",
        "translation": "The next is called Ocean of Virtue, and the second is called King Sunlight.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五功德王；　　第六須彌相；",
        "translation": "The fifth is the king of virtue; the sixth is the characteristic of a great mountain.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次名法自在；　　次佛功德王；",
        "translation": "The next is called Master of the Teaching, and the next is called King of Virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第九福須彌；　　第十光明王。",
        "translation": "Mount Sumeru of the ninth blessing is the tenth king of light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等諸佛，　　我悉曾供養，",
        "translation": "Such buddhas as these I have served and honored.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　所有清淨道，　　普入盡無餘，",
        "translation": "All the pure paths of enlightenment They enter everywhere, without exception.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　然於所入門，　　未能成就忍。",
        "translation": "However, they can't achieve the forbearance of entering the gate.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次第復有劫，　　名為妙勝主，",
        "translation": "In succession, there is another kalpa called Marvelous Supreme Master.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　剎號寂靜音，　　眾生煩惱薄。",
        "translation": "The buddha is called Silent Sound, and sentient beings’ afflictions are weak.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　於中有佛現，　　八十那由他；",
        "translation": "In the middle was a buddha manifesting, Eighty nayutas in number.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我悉曾供養，　　修行最勝道。",
        "translation": "I've all offered support to them, cultivating the most excellent path.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　初佛名華聚；　　次佛名海藏；",
        "translation": "The first buddha is named Flower Copse, and the second buddha Ocean Treasury.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次名功德生；　　次號天王髻；",
        "translation": "The next is called Produced by Virtue, and the second is called Topknot of the King of Gods.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五摩尼藏；　　第六真金山；",
        "translation": "The fifth is the jewel mine, and the sixth is the mountain of true gold.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第七寶聚尊；　　第八法幢佛；",
        "translation": "The seventh buddha was the jewel cluster honored one, the eighth buddha Dharma flag.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第九名勝財；　　第十名智慧。",
        "translation": "The ninth is called Supreme Wealth; the tenth is called Wisdom.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　此十為上首，　　供養無不盡。",
        "translation": "These ten are the highest, and their offerings are inexhaustible.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次第復有劫，　　名曰千功德；",
        "translation": "In succession, there is another kalpa called One Thousand Virtues.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　爾時有世界，　　號善化幢燈；",
        "translation": "At that time there was a world called Lamp of the Banner of Good Transformation.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　六十億那由，　　諸佛興於世。",
        "translation": "Sixty koṭis of nayutas, The buddhas arose in the world.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　最初寂靜幢；　　其次奢摩他；",
        "translation": "The first is the banner of peace and quietude, followed by that of calmness.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第三百燈王；　　第四寂靜光；",
        "translation": "The third is the king of one hundred lamps, and the fourth is Silent Light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五雲密陰；　　第六日大明；",
        "translation": "The fifth is the mysterious aggregate of clouds; the sixth is the great luminosity of the sixth sun.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　七號法燈光；　　八名殊勝焰；",
        "translation": "The seventh is called Lamp of the Teaching, and the eighth is called Supreme Flame.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　九名天勝藏；　　十名大吼音。",
        "translation": "The ninth name is Supreme Treasury of Heaven; the tenth name is Great Roaring Sound.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等諸佛，　　我悉常供養，",
        "translation": "Such buddhas as these I always honor.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　未得清淨忍，　　深入諸法海。",
        "translation": "They haven't yet attained pure forbearance and have plunged deeply into the ocean of dharmas.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次第復有劫，　　名無著莊嚴；",
        "translation": "In succession, there is another kalpa called A Forest of Pearls from the Dharma Garden, Volume I Arrayed with Nonattachment.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　爾時有世界，　　名曰無邊光；",
        "translation": "At that time there was a world called Boundless Light.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　中有三十六，　　那由他佛現。",
        "translation": "In the intermediate existence, there are thirty-six buddhas:",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　初功德須彌；　　第二虛空心；",
        "translation": "The first is the ascent of the mountain of virtue; the second is the space mental state.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第三具莊嚴；　　第四法雷音；",
        "translation": "The third is endowed with adornment, the fourth with the sound of the thunder of truth.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第五法界聲；　　第六妙音雲；",
        "translation": "The fifth is the sound of the realm of reality; the sixth is the cloud of sublime sound.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第七照十方；　　第八法海音；",
        "translation": "The seventh illumines the ten directions; the eighth is the Sound of the Ocean of Teaching.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　第九功德海；　　第十功德幢。",
        "translation": "The ninth is the ocean of virtue, and the tenth is the banner of virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　如是等諸佛，　　我悉曾供養。",
        "translation": "Such buddhas as these I have served and honored.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　次有佛出現，　　名為功德幢；",
        "translation": "Next, there will appear a buddha named Banner of Virtue.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我為月面天，　　供養人中主。",
        "translation": "I am the moon-faced goddess, offering support to the lord among men.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　時佛為我說，　　無依妙法門；",
        "translation": "The Buddha then taught me the wonderful teaching of non-dependence.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我聞專念持，　　出生諸願海。",
        "translation": "I hear and concentrate on mindfulness, producing oceans of vows.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我得清淨眼，　　寂滅定總持，",
        "translation": "I have attained the pure eye, which is a tranquil concentration that’s always present.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　能於念念中，　　悉見諸佛海。",
        "translation": "In every moment of thought They can see the ocean of buddhas.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　我得大悲藏，　　普明方便眼，",
        "translation": "I attain the store of great compassion, Universally illumining the eye of skillful means.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　增長菩提心，　　成就如來力。",
        "translation": "Increasing the aspiration for enlightenment, They perfect the power of buddhahood.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　見眾生顛倒，　　執常樂我淨，",
        "translation": "Seeing sentient beings in error, they cling to permanence, bliss, self, and purity.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　愚癡暗所覆，　　妄想起煩惱。",
        "translation": "They're covered by the darkness of foolishness, deludedly conceiving afflictions.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　行止見稠林，　　往來貪欲海，",
        "translation": "He walks and stops in a dense forest, Seeing the ocean of desire as he goes and comes.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　集於諸惡趣，　　無量種種業。",
        "translation": "They're collected in the bad destinies, with measureless various actions.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　一切諸趣中，　　隨業而受身，",
        "translation": "In all destinies, they receive bodies According to their actions.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　生老死眾患，　　無量苦逼迫。",
        "translation": "Birth, old age, and the various afflictions of birth and death are immeasurable and oppressed by suffering.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　為彼眾生故，　　我發無上心，",
        "translation": "For the sake of those sentient beings, I give rise to the unsurpassed mind.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　願得如十方，　　一切十力尊。",
        "translation": "May they be like the ten directions, honored by all the ten powers.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　緣佛及眾生，　　起於大願雲，",
        "translation": "Conditioned by buddhas and sentient beings, they give rise to clouds of great vows.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　從是修功德，　　趣入方便道。",
        "translation": "Cultivating virtue from this, they'll enter the path of skillful means.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　願雲悉彌覆，　　普入一切道，",
        "translation": "The cloud of vows covers them all, Entering into all paths.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　具足波羅蜜，　　充滿於法界。",
        "translation": "They are endowed with the perfections, Filling the cosmos of reality.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　速入於諸地，　　三世方便海，",
        "translation": "They quickly enter the stages, The ocean of skill in means of all times.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　一念修諸佛，　　一切無礙行。",
        "translation": "In a single thought, they cultivate all the unobstructed practices of buddhas.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　佛子我爾時，　　得入普賢道，",
        "translation": "At that time I, the offspring of Buddha, Have entered the path of Universal Good.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "　了知十法界，　　一切差別門。",
        "translation": "They know the ten realms of reality, All their distinctive aspects.",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "爾時，喜目觀察眾生主夜神以頌答曰：「善男子！",
        "translation": "At the time, the night goddess Joyful Eye observed sentient beings and answered in verse, Good sons!",
        "source": "T10n0279_069:0375c13_25"
    },
    {
        "source_sentence": "於汝意云何，彼時轉輪聖王，名：十方主，能紹隆佛種者，豈異人乎？",
        "translation": "What do you think? Did the universal ruler of that time, named Lord of the Ten Directions, who was able to perpetuate the lineage of buddhahood, not be someone else?",
        "source": "T10n0279_069:0377c23_26"
    },
    {
        "source_sentence": "文殊師利童子是也！",
        "translation": "That's the boy Mañjuśrī!",
        "source": "T10n0279_069:0377c24_27"
    },
    {
        "source_sentence": "爾時夜神覺悟我者，普賢菩薩之所化耳！",
        "translation": "That night goddess then awakened me, which was the transformation of Samantabhadra Bodhisattva!",
        "source": "T10n0279_069:0377c25_28"
    },
    {
        "source_sentence": "我於爾時為王寶女，蒙彼夜神覺悟於我，令我見佛，發阿耨多羅三藐三菩提心。",
        "translation": "At the time, I was the king's treasured queen, enlightened by the night goddess, caused me to see the Buddha and give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_069:0377c26_29"
    },
    {
        "source_sentence": "自從是來，經佛剎微塵數劫，不墮惡趣，常生人、天，於一切處常見諸佛，",
        "translation": "Ever since then, for as many eons as there are atoms in a buddha-land, he has not fallen into bad states of existence. He is always born among humans and gods; everywhere he sees all buddhas.",
        "source": "T10n0279_069:0377c27_30"
    },
    {
        "source_sentence": "乃至於妙燈功德幢佛所，得此大勢力普喜幢菩薩解脫，以此解脫如是利益一切眾生。",
        "translation": "In the presence of the Buddha Banner of Virtue of the Marvelous Lamp, he attained the liberation of this enlightening being Universally Joyful Banner of Great Power, and with this liberation he benefited all sentient beings in this way.",
        "source": "T10n0279_069:0377c29_31"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0378a02_32"
    },
    {
        "source_sentence": "我唯得此大勢力普喜幢解脫門。",
        "translation": "I've only attained this greatly powerful, universally joyful banner of liberation.",
        "source": "T10n0279_069:0378a02_33"
    },
    {
        "source_sentence": "如諸菩薩摩訶薩，於念念中，普詣一切諸如來所，疾能趣入一切智海；",
        "translation": "“Just as the great enlightening beings go to all buddhas in every moment of thought, so they can quickly enter the ocean of omniscience.",
        "source": "T10n0279_069:0378a03_34"
    },
    {
        "source_sentence": "於念念中，以發趣門，入於一切諸大願海；",
        "translation": "In each thought he entered the ocean of all great vows by means of the door of enlightenment.",
        "source": "T10n0279_069:0378a05_0"
    },
    {
        "source_sentence": "於念念中，以願海門，盡未來劫，念念出生一切諸行。",
        "translation": "In each thought, he uses the ocean of vows to end all future eons, and every thought produces all the practices.",
        "source": "T10n0279_069:0378a05_1"
    },
    {
        "source_sentence": "一一行中出生一切剎微塵數身，一一身普入一切法界門；",
        "translation": "In one line they produced as many bodies as atoms in all buddha-lands, each body entering into all aspects of the cosmos of reality.",
        "source": "T10n0279_069:0378a07_2"
    },
    {
        "source_sentence": "一一法界門，一切佛剎中，隨眾生心說諸妙行。",
        "translation": "In each aspect of the Dharma realm, he explains the marvelous practices in all the buddha-lands according to the minds of sentient beings.",
        "source": "T10n0279_069:0378a08_3"
    },
    {
        "source_sentence": "一切剎一一塵中，悉見無邊諸如來海；",
        "translation": "In each and every atom of all buddha-lands they saw boundless oceans of buddhas.",
        "source": "T10n0279_069:0378a09_4"
    },
    {
        "source_sentence": "一一如來所，悉見遍法界諸佛神通；",
        "translation": "In each buddha-place they saw the spiritual powers of all buddhas throughout the cosmos.",
        "source": "T10n0279_069:0378a10_5"
    },
    {
        "source_sentence": "一一如來所，悉見往劫修菩薩行；",
        "translation": "In each buddha-place they saw the practice of enlightening beings in past ages.",
        "source": "T10n0279_069:0378a11_6"
    },
    {
        "source_sentence": "一一如來所，受持守護所有法輪；",
        "translation": "In the presence of each buddha they receive, preserve, and protect all the teachings of that buddha.",
        "source": "T10n0279_069:0378a12_7"
    },
    {
        "source_sentence": "一一如來所，悉見三世一切如來諸神變海。",
        "translation": "In each buddha-place they saw the ocean of mystical displays of all buddhas of past, present, and future.",
        "source": "T10n0279_069:0378a12_8"
    },
    {
        "source_sentence": "而我云何能知能說彼功德行？",
        "translation": "How can I know and explain their meritorious deeds?",
        "source": "T10n0279_069:0378a13_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_069:0378a14_10"
    },
    {
        "source_sentence": "此眾會中，有一夜神，名：普救眾生妙德。",
        "translation": "In this assembly there was a night goddess named Wonderful Virtue Saving All Sentient Beings.",
        "source": "T10n0279_069:0378a14_11"
    },
    {
        "source_sentence": "汝詣彼問：菩薩云何入菩薩行、淨菩薩道？」",
        "translation": "Go to them and ask, How does a bodhisattva enter the bodhisattva practice and purify the bodhisattva path?",
        "source": "T10n0279_069:0378a15_12"
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "Then Sudhana went up to him, paid his respects, and departed. Thereupon, Bodhisattva Sadāparibhūta bowed his head at the Buddha’s feet and circumambulated him countless times.",
        "source": "T10n0279_069:0378a16_13"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第六十九",
        "translation": "Dafangguang fo huayan jing, vol. 69",
        "source": "T10n0279_069:0378a18_0"
    }
]