[
    {
        "source_sentence": "大方廣佛華嚴經卷第四十",
        "translation": "Dafangguang fo huayan jing, vol. 40",
        "source": "T10n0279_040:0211a02_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_040:0211a04_0"
    },
    {
        "source_sentence": "十定品第二十七之一",
        "translation": "Chapter Twenty-seventh and One of the Ten Concentrations",
        "source": "T10n0279_040:0211a05_0"
    },
    {
        "source_sentence": "爾時，世尊在摩竭提國阿蘭若法菩提場中始成正覺，於普光明殿入剎那際諸佛三昧，",
        "translation": "At the time, the Bhagavān had first attained right awakening at the forest-dwelling site of enlightenment in the country of Magadha, where he entered the moment-by-moment concentration of all buddhas in the hall of",
        "source": "T10n0279_040:0211a06_0"
    },
    {
        "source_sentence": "以一切智自神通力現如來身，清淨無礙，無所依止，無有攀緣，住奢摩他最極寂靜，",
        "translation": "By the spiritual power of omniscience and self-knowledge he manifests the body of Buddha, pure and unobstructed, without any support or clinging. Abiding in absorption, he dwells in the utmost quiescence.",
        "source": "T10n0279_040:0211a08_0"
    },
    {
        "source_sentence": "具大威德無所染著，能令見者悉得開悟，隨宜出興不失於時，恒住一相所謂無相。",
        "translation": "They are endowed with great power and virtue, not stained by attachment; they can cause all who see to be enlightened. They arise as appropriate, without losing time. They always abide in one characteristic, which is called signless",
        "source": "T10n0279_040:0211a09_1"
    },
    {
        "source_sentence": "與十佛剎微塵數菩薩摩訶薩俱，靡不皆入灌頂之位，具菩薩行，等于法界無量無邊，",
        "translation": "He was accompanied by as many great enlightening beings as atoms in ten buddha-lands, all entering the state of coronation. Endowed with enlightening practice, they were equal to the infinity and boundlessness of the",
        "source": "T10n0279_040:0211a11_2"
    },
    {
        "source_sentence": "獲諸菩薩普見三昧，大悲安隱一切眾生，神通自在，同於如來智慧深入，",
        "translation": "They attain the concentration of universal vision of enlightening beings, great compassionate and peaceful to all sentient beings, with unimpeded spiritual powers like the depths of buddha-knowledge.",
        "source": "T10n0279_040:0211a13_3"
    },
    {
        "source_sentence": "演真實義，具一切智，降伏眾魔，雖入世間心恒寂靜，住於菩薩無住解脫。",
        "translation": "He explains the true meaning, possesses omniscience, subdues Māra, and although he enters the world, his mind is always quiescent, abiding in bodhisattvahood and not abiding in liberation.",
        "source": "T10n0279_040:0211a15_4"
    },
    {
        "source_sentence": "其名曰：金剛慧菩薩、無等慧菩薩、義語慧菩薩、最勝慧菩薩、常捨慧菩薩、那伽慧菩薩、成就慧菩薩、調順慧菩薩、大力慧菩薩、難思慧菩薩、無礙慧菩薩、增上慧菩薩、普供慧菩薩、如理慧菩薩、善巧慧菩薩、法自在慧菩薩、法慧菩薩、寂靜慧菩薩、虛空慧菩薩、一相慧菩薩、善慧菩薩、如幻慧菩薩、廣大慧菩薩、勢力慧菩薩、世間慧菩薩、佛地慧菩薩、真實慧菩薩、尊勝慧菩薩、智光慧菩薩、無邊慧菩薩、念莊嚴菩薩、達空際菩薩、性莊嚴菩薩、甚深境菩薩、善解處非處菩薩、大光明菩薩、常光明菩薩、了佛種菩薩、心王菩薩、一行菩薩、常現神通菩薩、智慧芽菩薩、功德處菩薩、法燈菩薩、照世菩薩、持世菩薩、最安隱菩薩、最上菩薩、無上菩薩、無比菩薩、超倫菩薩、無礙行菩薩、光明焰菩薩、月光菩薩、一塵菩薩、堅固行菩薩、霔法雨菩薩、最勝幢菩薩、普莊嚴菩薩、智眼菩薩、法眼菩薩、慧雲菩薩、總持王菩薩、無住願菩薩、智藏菩薩、心王菩薩、內覺慧菩薩、住佛智菩薩、陀羅尼勇健力菩薩、持地力菩薩、妙月菩薩、須彌頂菩薩、寶頂菩薩、普光照菩薩、威德王菩薩、智慧輪菩薩、大威德菩薩、大龍相菩薩、質直行菩薩、不退轉菩薩、持法幢菩薩、無忘失菩薩、攝諸趣菩薩、不思議決定慧菩薩、遊戲無邊智菩薩、無盡妙法藏菩薩、智日菩薩、法日菩薩、智藏菩薩、智澤菩薩、普見菩薩、不空見菩薩、金剛通菩薩、金剛智菩薩、金剛焰菩薩、金剛慧菩薩、普眼菩薩、佛日菩薩、持佛金剛祕密義菩薩、普眼境界智莊嚴菩薩……。",
        "translation": "They were called the enlightening beings of adamantine wisdom, the enlightening beings of peerless wisdom, the enlightening beings of knowledge of meaning and expression, the enlightening beings of supreme wisdom, the enlightening beings",
        "source": "T10n0279_040:0211a17_0"
    },
    {
        "source_sentence": "如是等菩薩摩訶薩十佛剎微塵數，往昔皆與毘盧遮那如來同修菩薩諸善根行。",
        "translation": "Such bodhisattvas, mahāsattvas, as numerous as the tiny dust motes in ten buddha-lands, all cultivated the good roots of bodhisattva practices together with the Tathāgata Vairocana in the past.",
        "source": "T10n0279_040:0211b17_1"
    },
    {
        "source_sentence": "爾時，普眼菩薩摩訶薩承佛神力從座而起，偏袒右肩，右膝著地，合掌白佛言：「世尊！",
        "translation": "At that point, the Universal Eye Bodhisattva Mahāsattva rose from his seat by the power of the Buddha, bared his right shoulder, knelt with his right knee on the ground, joined his palms and said to the Buddha,",
        "source": "T10n0279_040:0211b20_0"
    },
    {
        "source_sentence": "我於如來、應、正等覺，欲有所問，願垂哀許。」",
        "translation": "I want to ask questions about the Tathāgata, Arhat, and Completely Awakened One, so please have mercy on me.",
        "source": "T10n0279_040:0211b21_1"
    },
    {
        "source_sentence": "佛言：「普眼！",
        "translation": "The Buddha said, Universal eye!",
        "source": "T10n0279_040:0211b22_2"
    },
    {
        "source_sentence": "恣汝所問，當為汝說，令汝心喜。」",
        "translation": "Whatever you ask, I will explain it for you and make you rejoice.",
        "source": "T10n0279_040:0211b23_3"
    },
    {
        "source_sentence": "普眼菩薩言：「世尊！",
        "translation": "The Universal Eye Bodhisattva said, Bhagavān!",
        "source": "T10n0279_040:0211b23_4"
    },
    {
        "source_sentence": "普賢菩薩及住普賢所有行願諸菩薩眾，成就幾何三昧解脫，而於菩薩諸大三昧或入、或出、或時安住？",
        "translation": "How many concentrations and liberations does the enlightening being Universally Good and the multitude of enlightening beings who abide in all the practices and vows of Universally Good accomplish, and how many great concentrations do they enter, leave, or sometimes",
        "source": "T10n0279_040:0211b24_5"
    },
    {
        "source_sentence": "以於菩薩不可思議廣大三昧善入出故，能於一切三昧自在神通變化無有休息。」",
        "translation": "Because the bodhisattva's inconceivable vast samādhi well enters and exits, he can unimpededly transform all his samādhis with supernormal powers without resting.",
        "source": "T10n0279_040:0211b26_6"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T10n0279_040:0211b28_7"
    },
    {
        "source_sentence": "普眼！",
        "translation": "Universal eye!",
        "source": "T10n0279_040:0211b28_8"
    },
    {
        "source_sentence": "汝為利益去、來、現在諸菩薩眾而問斯義。",
        "translation": "You ask about this meaning for the benefit of the bodhisattvas of past, future, and present.",
        "source": "T10n0279_040:0211b28_9"
    },
    {
        "source_sentence": "普眼！",
        "translation": "Universal eye!",
        "source": "T10n0279_040:0211b29_10"
    },
    {
        "source_sentence": "普賢菩薩今現在此，已能成就不可思議自在神通，出過一切諸菩薩上，",
        "translation": "The enlightening being Universally Good is now here, able to perfect inconceivable mystic powers, surpassing all enlightening beings.",
        "source": "T10n0279_040:0211b29_11"
    },
    {
        "source_sentence": "難可值遇；",
        "translation": "It is difficult to meet.",
        "source": "T10n0279_040:0211c02_12"
    },
    {
        "source_sentence": "從於無量菩薩行生，菩薩大願悉已清淨，所行之行皆無退轉，無量波羅蜜門、無礙陀羅尼門、無盡辯才門皆悉已得，",
        "translation": "“The great vows of enlightening beings are all purified, and the practices they carry out have no turning back. They have attained infinite doors of transcendence, unhindered doors of concentration, and inexhaustible doors of",
        "source": "T10n0279_040:0211c02_13"
    },
    {
        "source_sentence": "清淨無礙，大悲利益一切眾生，以本願力盡未來際而無厭倦。",
        "translation": "They are pure and unobstructed, great compassionate for the benefit of all sentient beings, use the power of their past vows to reach the end of the future without weariness.",
        "source": "T10n0279_040:0211c05_14"
    },
    {
        "source_sentence": "汝應請彼，彼當為汝說其三昧自在解脫。」",
        "translation": "You should invite them, and they will explain their samādhi and unimpeded liberation for you.",
        "source": "T10n0279_040:0211c06_15"
    },
    {
        "source_sentence": "爾時，會中諸菩薩眾聞普賢名，即時獲得不可思議無量三昧，其心無礙寂然不動，",
        "translation": "At that time the enlightening beings in the assembly, hearing the name of Universally Good, instantly attained unfathomable, immeasurable concentration; their minds were unobstructed, silent, and unmoving.",
        "source": "T10n0279_040:0211c08_0"
    },
    {
        "source_sentence": "智慧廣大難可測量，境界甚深無能與等；",
        "translation": "His knowledge and wisdom are vast and difficult to fathom. The sphere of his knowledge is as profound as none can equal it.",
        "source": "T10n0279_040:0211c09_1"
    },
    {
        "source_sentence": "現前悉見無數諸佛，得如來力，同如來性，去、來、現在靡不明照，所有福德不可窮盡，",
        "translation": "They see countless buddhas in all their manifestations and attain the power of enlightenment, which is the same as that of an enlightened one. The past, future, and present they do not know or illuminate. All their virtues cannot be",
        "source": "T10n0279_040:0211c10_2"
    },
    {
        "source_sentence": "一切神通皆已具足。",
        "translation": "All his supernormal powers are fully present.",
        "source": "T10n0279_040:0211c12_3"
    },
    {
        "source_sentence": "其諸菩薩於普賢所，心生尊重，渴仰欲見，悉於眾會周遍觀察而竟不覩，",
        "translation": "Those enlightening beings, respectful to Universally Good and eager to see him, looked everywhere in the assembly but did not look down on him.",
        "source": "T10n0279_040:0211c13_4"
    },
    {
        "source_sentence": "亦不見其所坐之座。",
        "translation": "They also didn't see the seat where he was sitting.",
        "source": "T10n0279_040:0211c14_5"
    },
    {
        "source_sentence": "此由如來威力所持，亦是普賢神通自在使其然耳。",
        "translation": "It's because of the Tathāgata's authoritative power that it's maintained, and it's also because Samantabhadra's miraculous abilities are unimpeded to make it so.",
        "source": "T10n0279_040:0211c15_6"
    },
    {
        "source_sentence": "爾時，普眼菩薩白佛言：「世尊！",
        "translation": "It was then that the Universal Eyes Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T10n0279_040:0211c17_0"
    },
    {
        "source_sentence": "普賢菩薩今何所在？」",
        "translation": "Where is the bodhisattva Samantabhadra now?",
        "source": "T10n0279_040:0211c17_1"
    },
    {
        "source_sentence": "佛言：「普眼！",
        "translation": "The Buddha said, Universal eye!",
        "source": "T10n0279_040:0211c18_2"
    },
    {
        "source_sentence": "普賢菩薩今現在此道場眾會，親近我住，初無動移。」",
        "translation": "Samantabhadra Bodhisattva is now present in this assembly at the site of enlightenment, and he's close to where I live, with no movement at first.",
        "source": "T10n0279_040:0211c18_3"
    },
    {
        "source_sentence": "是時，普眼及諸菩薩復更觀察道場眾會，周遍求覓，白佛言：「世尊！",
        "translation": "At that point, Universal Eye and the other bodhisattvas again observed the assembly at the site of enlightenment, searched everywhere, and said to the Buddha, Bhagavān!",
        "source": "T10n0279_040:0211c19_4"
    },
    {
        "source_sentence": "我等今者猶未得見普賢菩薩其身及座。」",
        "translation": "We haven't yet seen the body and seat of Samantabhadra Bodhisattva.",
        "source": "T10n0279_040:0211c21_5"
    },
    {
        "source_sentence": "佛言：「如是，善男子！",
        "translation": "The Buddha said, So it is, good man!",
        "source": "T10n0279_040:0211c22_0"
    },
    {
        "source_sentence": "汝等何故而不得見？",
        "translation": "Why don't you see it?",
        "source": "T10n0279_040:0211c22_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_040:0211c22_2"
    },
    {
        "source_sentence": "普賢菩薩住處甚深不可說故。",
        "translation": "It's because the abode of Samantabhadra Bodhisattva is so profound and inexplicable.",
        "source": "T10n0279_040:0211c23_3"
    },
    {
        "source_sentence": "普賢菩薩獲無邊智慧門，入師子奮迅定，得無上自在用，入清淨無礙際，",
        "translation": "The enlightening being Universally Good found the boundless door of knowledge and wisdom, entered the lion’s concentration of arousal, attained unexcelled freedom, and entered purity without obstruction.",
        "source": "T10n0279_040:0211c23_4"
    },
    {
        "source_sentence": "生如來十種力，以法界藏為身，一切如來共所護念，於一念頃悉能證入三世諸佛無差別智，",
        "translation": "They give rise to ten kinds of empowerment of the enlightened, their bodies being the treasury of the cosmos of reality. All the enlightened ones, protected by them together, can instantly attain undifferentiated knowledge",
        "source": "T10n0279_040:0211c25_5"
    },
    {
        "source_sentence": "是故汝等不能見耳。」",
        "translation": "That's why you can't see it.",
        "source": "T10n0279_040:0211c27_6"
    },
    {
        "source_sentence": "爾時，普眼菩薩聞如來說普賢菩薩清淨功德，得十千阿僧祇三昧；",
        "translation": "At that time the enlightening being Universal Eye, hearing the Teaching from the Buddha, perceiving the pure virtues of the enlightening being Universally Good, attained ten thousand incalculable concentrations.",
        "source": "T10n0279_040:0211c29_0"
    },
    {
        "source_sentence": "以三昧力復遍觀察，渴仰欲見普賢菩薩，亦不能覩。",
        "translation": "With the power of samādhi, he also observes it all over again, longing to see Samantabhadra Bodhisattva, but he can't see him.",
        "source": "T10n0279_040:0212a01_1"
    },
    {
        "source_sentence": "其餘一切諸菩薩眾俱亦不見。",
        "translation": "All the other bodhisattvas don't see it either.",
        "source": "T10n0279_040:0212a02_2"
    },
    {
        "source_sentence": "時，普眼菩薩從三昧起，白佛言：「世尊！",
        "translation": "The Universal Eyes Bodhisattva then rose from his concentration and said to the Buddha, Bhagavān!",
        "source": "T10n0279_040:0212a03_3"
    },
    {
        "source_sentence": "我已入十千阿僧祇三昧，求見普賢而竟不得，不見其身及身業、語及語業、意及意業、座及住處，",
        "translation": "Having entered ten thousand incalculable concentrations, I sought to see Samantabhadra but could not find him. I did not see his body, his bodily or vocal action, his mind or mental action, his throne or his dwelling place",
        "source": "T10n0279_040:0212a04_4"
    },
    {
        "source_sentence": "悉皆不見。」",
        "translation": "They don't see them all.",
        "source": "T10n0279_040:0212a06_5"
    },
    {
        "source_sentence": "佛言：「如是如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T10n0279_040:0212a06_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_040:0212a07_7"
    },
    {
        "source_sentence": "當知皆以普賢菩薩住不思議解脫之力。",
        "translation": "You should know that they all abide by the power of the inconceivable liberation of Samantabhadra Bodhisattva.",
        "source": "T10n0279_040:0212a07_8"
    },
    {
        "source_sentence": "普眼！",
        "translation": "Universal eye!",
        "source": "T10n0279_040:0212a08_9"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T10n0279_040:0212a08_10"
    },
    {
        "source_sentence": "頗有人能說幻術文字中種種幻相所住處不？」",
        "translation": "Could someone explain the various illusory forms that abide in illusory words and illusions?",
        "source": "T10n0279_040:0212a08_11"
    },
    {
        "source_sentence": "答言：「不也。」",
        "translation": "He replied, No.",
        "source": "T10n0279_040:0212a09_12"
    },
    {
        "source_sentence": "佛言：「普眼！",
        "translation": "The Buddha said, Universal eye!",
        "source": "T10n0279_040:0212a09_13"
    },
    {
        "source_sentence": "幻中幻相尚不可說，何況普賢菩薩祕密身境界、祕密語境界、祕密意境界，",
        "translation": "The characteristics of illusion in illusion cannot be explained, much less the realm of the enlightening being Universally Good’s mysterious body, mysterious speech, and mysterious mind.",
        "source": "T10n0279_040:0212a10_14"
    },
    {
        "source_sentence": "而於其中能入能見！",
        "translation": "He's able to enter and see them!",
        "source": "T10n0279_040:0212a11_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_040:0212a12_16"
    },
    {
        "source_sentence": "普賢菩薩境界甚深，不可思議，無有量、已過量。",
        "translation": "The sphere of the enlightening being Universally Good is profound and inconceivable, without measure or beyond measure.",
        "source": "T10n0279_040:0212a12_17"
    },
    {
        "source_sentence": "舉要言之，普賢菩薩以金剛慧普入法界，於一切世界無所行、無所住，",
        "translation": "To sum up, the enlightening being Universally Good enters into the cosmos of reality by means of adamantine wisdom; there is nothing to do or to abide in in in all worlds.",
        "source": "T10n0279_040:0212a13_18"
    },
    {
        "source_sentence": "知一切眾生身皆即非身，無去無來，得無斷盡、無差別自在神通，無依無作，",
        "translation": "Knowing that the bodies of all sentient beings are all non-bodies, with no going or coming, they attain uninterrupted, undifferentiated spiritual powers without depending or doing anything.",
        "source": "T10n0279_040:0212a15_19"
    },
    {
        "source_sentence": "無有動轉，至於法界究竟邊際。",
        "translation": "There's no movement until the ultimate limit of the Dharma realm.",
        "source": "T10n0279_040:0212a17_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0279_040:0212a17_1"
    },
    {
        "source_sentence": "若有得見普賢菩薩，若得承事，若得聞名，若有思惟，若有憶念，若生信解，",
        "translation": "If there is anyone who can see the enlightening being Universally Good, or serve him, or hear his name, or contemplate it, or remember it, or give rise to faith and understanding.",
        "source": "T10n0279_040:0212a17_2"
    },
    {
        "source_sentence": "若勤觀察，若始趣向，若正求覓，若興誓願，相續不絕，皆獲利益，無空過者。」",
        "translation": "If they diligently observe it, begin to direct their attention, correctly seek it, and make a vow, they'll continue to benefit without stopping, and there's nothing wrong with that.",
        "source": "T10n0279_040:0212a19_3"
    },
    {
        "source_sentence": "爾時，普眼及一切菩薩眾於普賢菩薩心生渴仰，願得瞻覲，作如是言：「南無一切諸佛！",
        "translation": "At that point, the Universal Eye and all the bodhisattvas had longed to see Samantabhadra Bodhisattva, wishing to see him, and said, South are all the buddhas!",
        "source": "T10n0279_040:0212a21_4"
    },
    {
        "source_sentence": "南無普賢菩薩！」",
        "translation": "Namo Samantabhadra Bodhisattva!",
        "source": "T10n0279_040:0212a23_5"
    },
    {
        "source_sentence": "如是三稱，頭頂禮敬。",
        "translation": "Thus, these three calls are paid homage with their heads and feet.",
        "source": "T10n0279_040:0212a23_6"
    },
    {
        "source_sentence": "爾時，佛告普眼菩薩及諸眾會言：「諸佛子！",
        "translation": "It was then that the Buddha addressed the Universal Eye Bodhisattva and the assembled people, saying, Children of the Buddha!",
        "source": "T10n0279_040:0212a24_7"
    },
    {
        "source_sentence": "汝等宜更禮敬普賢，慇懃求請，又應專至觀察十方，想普賢身現在其前。",
        "translation": "It's better for you to pay homage to Samantabhadra and ask him to do so. You should also concentrate on observing the ten directions, thinking that the body of Samantabhadra is present in front of you.",
        "source": "T10n0279_040:0212a25_0"
    },
    {
        "source_sentence": "如是思惟，周遍法界，深心信解，厭離一切，誓與普賢同一行願：入於不二真實之法，",
        "translation": "They think thus, pervading the cosmos of reality; their minds deeply believing, they are disillusioned with all things. They vow to act in the same way as Universal Good, entering into the nondual true teaching.",
        "source": "T10n0279_040:0212a26_1"
    },
    {
        "source_sentence": "其身普現一切世間，悉知眾生諸根差別，遍一切處集普賢道。",
        "translation": "His body manifested throughout all worlds, knowing the differences in the faculties of sentient beings, and everywhere he collected the path of universal goodness.",
        "source": "T10n0279_040:0212a28_2"
    },
    {
        "source_sentence": "若能發起如是大願，則當得見普賢菩薩。」",
        "translation": "If you can give rise to such a great vow, you'll be able to see Samantabhadra Bodhisattva.",
        "source": "T10n0279_040:0212a29_3"
    },
    {
        "source_sentence": "是時，普眼聞佛此語，與諸菩薩俱時頂禮，求請得見普賢大士。",
        "translation": "When the universal eye heard these words of the Buddha, he bowed his head at the same time as the other bodhisattvas and asked to see Samantabhadra.",
        "source": "T10n0279_040:0212b01_4"
    },
    {
        "source_sentence": "爾時，普賢菩薩即以解脫神通之力，如其所應為現色身，令彼一切諸菩薩眾皆見普賢親近如來，",
        "translation": "Then the enlightening being Universally Good, by the power of liberation and mystic knowledge, manifested physical forms as they should be, causing all those enlightening beings to see Universally Good associating with the Buddha.",
        "source": "T10n0279_040:0212b04_0"
    },
    {
        "source_sentence": "於此一切菩薩眾中坐蓮華座；",
        "translation": "In the midst of all these enlightening beings they sat on lotus seats.",
        "source": "T10n0279_040:0212b06_1"
    },
    {
        "source_sentence": "亦見於餘一切世界一切佛所，從彼次第相續而來；",
        "translation": "They also see all the buddhas of all the other worlds, coming from them one after another.",
        "source": "T10n0279_040:0212b06_2"
    },
    {
        "source_sentence": "亦見在彼一切佛所，演說一切諸菩薩行，開示一切智智之道，闡明一切菩薩神通，",
        "translation": "They also saw all those buddhas expounding the practices of enlightening beings, revealing the path of omniscience and knowledge, clarifying the spiritual capacities of all enlightening beings.",
        "source": "T10n0279_040:0212b08_3"
    },
    {
        "source_sentence": "分別一切菩薩威德，示現一切三世諸佛。",
        "translation": "He discerns the authoritative qualities of all bodhisattvas and shows them to all the buddhas of the three times.",
        "source": "T10n0279_040:0212b10_0"
    },
    {
        "source_sentence": "是時，普眼菩薩及一切菩薩眾見此神變，其心踊躍，生大歡喜，莫不頂禮普賢菩薩，",
        "translation": "At that moment the enlightening being Universal Eye and all the other enlightening beings who saw this miracle jumped with joy, bowed their heads to the enlightening being Universally Good.",
        "source": "T10n0279_040:0212b10_1"
    },
    {
        "source_sentence": "心生尊重，如見十方一切諸佛。",
        "translation": "The mind gives rise to respect, just as it sees all the buddhas of the ten directions.",
        "source": "T10n0279_040:0212b12_2"
    },
    {
        "source_sentence": "是時，以佛大威神力及諸菩薩信解之力、普賢菩薩本願力故，自然而雨十千種雲。",
        "translation": "At the time, 10,000 kinds of clouds naturally rained down because of the great spiritual power of the Buddha, the power of the faith and understanding of the bodhisattvas, and the power of the original vows of Samantabhadra Bodhisattva.",
        "source": "T10n0279_040:0212b13_3"
    },
    {
        "source_sentence": "所謂：種種華雲、種種鬘雲、種種香雲、種種末香雲、種種蓋雲、種種衣雲、種種嚴具雲、種種珍寶雲、種種燒香雲、種種繒綵雲。",
        "translation": "They are clouds of various kinds of flowers, clouds of various kinds of garlands, clouds of various kinds of fragrances, clouds of various kinds of powdered incense, clouds of various kinds of canopies, clouds",
        "source": "T10n0279_040:0212b15_4"
    },
    {
        "source_sentence": "不可說世界六種震動；",
        "translation": "In untold worlds there were six kinds of trembling:",
        "source": "T10n0279_040:0212b18_5"
    },
    {
        "source_sentence": "奏天音樂，其聲遠聞不可說世界；",
        "translation": "They played celestial music, the sound of which was heard far and wide in untold worlds.",
        "source": "T10n0279_040:0212b18_6"
    },
    {
        "source_sentence": "放大光明，其光普照不可說世界，令三惡趣悉得除滅，嚴淨不可說世界，",
        "translation": "It emanated a great ray of light that shone everywhere in untold worlds, causing the three evil states to all be annihilated.",
        "source": "T10n0279_040:0212b19_7"
    },
    {
        "source_sentence": "令不可說菩薩入普賢行、不可說菩薩成普賢行，不可說菩薩於普賢行願悉得圓滿成阿耨多羅三藐三菩提。",
        "translation": "Causing an ineffable bodhisattva to enter the practice of Samantabhadra and an ineffable bodhisattva to accomplish the practice of Samantabhadra, an ineffable bodhisattva fulfills the vow for the practice of Samanta",
        "source": "T10n0279_040:0212b21_8"
    },
    {
        "source_sentence": "爾時，普眼菩薩白佛言：「世尊！",
        "translation": "It was then that the Universal Eyes Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T10n0279_040:0212b24_0"
    },
    {
        "source_sentence": "普賢菩薩是住大威德者、住無等者、住無過者、住不退者、住平等者、住不壞者、住一切差別法者、住一切無差別法者、住一切眾生善巧心所住者、住一切法自在解脫三昧者。」",
        "translation": "Samantabhadra Bodhisattva is someone who abides in great authority, someone who abides in peerlessness, someone who abides in faultlessness, someone who abides in nonregression, someone who abides in equality, someone who abides",
        "source": "T10n0279_040:0212b24_1"
    },
    {
        "source_sentence": "佛言：「如是如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T10n0279_040:0212b28_2"
    },
    {
        "source_sentence": "普眼！",
        "translation": "Universal eye!",
        "source": "T10n0279_040:0212b28_3"
    },
    {
        "source_sentence": "如汝所說，普賢菩薩有阿僧祇清淨功德，所謂：無等莊嚴功德、無量寶功德、不思議海功德、無量相功德、無邊雲功德、無邊際不可稱讚功德、無盡法功德、不可說功德、一切佛功德、稱揚讚歎不可盡功德。」",
        "translation": "As you say, the bodhisattva Samantabhadra has an incalculable amount of pure virtue, which is called the virtue of peerless adornment, the virtue of measureless treasures, the virtue of the inconceiva",
        "source": "T10n0279_040:0212b29_4"
    },
    {
        "source_sentence": "爾時，如來告普賢菩薩言：「普賢！",
        "translation": "It was then that the Tathāgata addressed Samantabhadra Bodhisattva, saying, Samantabhadra!",
        "source": "T10n0279_040:0212c05_0"
    },
    {
        "source_sentence": "汝應為普眼及此會中諸菩薩眾說十三昧，令得善入，成滿普賢所有行願。",
        "translation": "You should explain the thirteen meditations for the sake of the universal eye and the bodhisattvas in this assembly, so that they can enter them well and fulfill the practical vows of Samantabhadra.",
        "source": "T10n0279_040:0212c05_1"
    },
    {
        "source_sentence": "諸菩薩摩訶薩說此十大三昧故，令過去菩薩已得出離，現在菩薩今得出離，",
        "translation": "Because the great enlightening beings teach these ten great concentrations, they cause past enlightening beings to attain liberation and present enlightening beings to attain liberation.",
        "source": "T10n0279_040:0212c07_2"
    },
    {
        "source_sentence": "未來菩薩當得出離。",
        "translation": "In the future, the bodhisattva will be liberated.",
        "source": "T10n0279_040:0212c09_3"
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_040:0212c09_4"
    },
    {
        "source_sentence": "一者普光大三昧，二者妙光大三昧，三者次第遍往諸佛國土大三昧，四者清淨深心行大三昧，",
        "translation": "The first is the great concentration of universal light; the second is the great concentration of subtle light; the third is the great concentration going to all buddha-lands in order; and the fourth is the great concentration of pure, profound mental functioning.",
        "source": "T10n0279_040:0212c09_5"
    },
    {
        "source_sentence": "五者知過去莊嚴藏大三昧，六者智光明藏大三昧，七者了知一切世界佛莊嚴大三昧，",
        "translation": "The fifth is great concentration of the store of knowledge of past adornments; the sixth is great concentration of the store of light of knowledge of past adornments; the seventh is great concentration of the store of knowledge of past adornments of all buddhas",
        "source": "T10n0279_040:0212c12_6"
    },
    {
        "source_sentence": "八者眾生差別身大三昧，九者法界自在大三昧，十者無礙輪大三昧。",
        "translation": "The eighth is great samādhi of the differentiated body of sentient beings, the ninth is great samādhi of self-reliance in the Dharma realm, and the tenth is great samādhi of the unobstructed wheel.",
        "source": "T10n0279_040:0212c14_7"
    },
    {
        "source_sentence": "此十大三昧，諸大菩薩乃能善入，去、來、現在一切諸佛已說、當說、現說。",
        "translation": "These ten great samādhis are well entered by the great bodhisattvas, and all the buddhas of past, future, and present have taught, will teach, and are teaching them.",
        "source": "T10n0279_040:0212c15_8"
    },
    {
        "source_sentence": "若諸菩薩愛樂尊重，修習不懈，則得成就如是之人，則名為佛，則名如來，",
        "translation": "“Furthermore, if enlightening beings are fond of honoring and respecting those who practice without slackening, they will be able to develop people like this. Such people are called buddhas, and such people are called tathāgatas.",
        "source": "T10n0279_040:0212c17_9"
    },
    {
        "source_sentence": "亦則名為得十力人，亦名導師，亦名大導師，亦名一切智，亦名一切見，",
        "translation": "They are also called those who have attained the ten powers, and they are called teachers, great teachers, omniscience, and all views.",
        "source": "T10n0279_040:0212c19_10"
    },
    {
        "source_sentence": "亦名住無礙，亦名達諸境，亦名一切法自在。",
        "translation": "It's also called abiding unobstructed, comprehending objects, and mastery of all dharmas.",
        "source": "T10n0279_040:0212c20_11"
    },
    {
        "source_sentence": "此菩薩普入一切世界，而於世界無所著；",
        "translation": "These enlightening beings enter all worlds, yet they have no attachment to worlds.",
        "source": "T10n0279_040:0212c21_12"
    },
    {
        "source_sentence": "普入一切眾生界，而於眾生無所取；",
        "translation": "They enter all realms of sentient beings everywhere, yet they grasp nothing from sentient beings.",
        "source": "T10n0279_040:0212c22_13"
    },
    {
        "source_sentence": "普入一切身，而於身無所礙；",
        "translation": "They enter all bodies everywhere, yet have no obstruction in their bodies.",
        "source": "T10n0279_040:0212c23_14"
    },
    {
        "source_sentence": "普入一切法界，而知法界無有邊。",
        "translation": "They enter all realms of reality, yet they know the realm of reality has no bounds.",
        "source": "T10n0279_040:0212c24_15"
    },
    {
        "source_sentence": "親近三世一切佛，明見一切諸佛法，巧說一切文字，了達一切假名，成就一切菩薩清淨道，",
        "translation": "They associate with all the Buddhas of past, present, and future, clearly seeing all buddhas’ teachings; skillfully expounding all words, comprehending all names metaphorically; they develop the pure path of enlightening beings.",
        "source": "T10n0279_040:0212c24_16"
    },
    {
        "source_sentence": "安住一切菩薩差別行。",
        "translation": "He abides in all the distinctive practices of bodhisattvas.",
        "source": "T10n0279_040:0212c26_17"
    },
    {
        "source_sentence": "於一念中，普得一切三世智，普知一切三世法，普說一切諸佛教，普轉一切不退輪，",
        "translation": "In a single thought they attain all knowledge of past, present, and future. They know all the teachings of past, present, and future. They teach all kinds of doctrines in buddha-teachings, And universally turn the irreversible wheel",
        "source": "T10n0279_040:0212c27_18"
    },
    {
        "source_sentence": "於去、來、現在一一世，普證一切菩提道；",
        "translation": "In each and every world, past, future, and present, they universally realize all paths of enlightenment.",
        "source": "T10n0279_040:0212c29_19"
    },
    {
        "source_sentence": "於此一一菩提中，普了一切佛所說。",
        "translation": "In each one of these enlightenments, he universally understands what all the buddhas teach.",
        "source": "T10n0279_040:0213a01_20"
    },
    {
        "source_sentence": "此是諸菩薩法相門，是諸菩薩智覺門，是一切種智無勝幢門，是普賢菩薩諸行願門，",
        "translation": "“This is the face of enlightening beings’ knowledge of principles. This is the face of enlightening beings’ knowledge of truth. This is the face of enlightening beings’ knowledge of all things. This is the face of enlightening being",
        "source": "T10n0279_040:0213a02_0"
    },
    {
        "source_sentence": "是猛利神通誓願門，是一切總持辯才門，是三世諸法差別門，是一切諸佛示現門，",
        "translation": "These are the doors of vows of ferocious spiritual powers, the doors of all concentrations and intelligences, the doors of distinctions in the teachings of past, present, and future, the doors of manifestation of all buddhas.",
        "source": "T10n0279_040:0213a03_1"
    },
    {
        "source_sentence": "是以薩婆若安立一切眾生門，是以佛神力嚴淨一切世界門。",
        "translation": "That's why the Sāvajñāpāramitā establishes the gate for all sentient beings, and that's why the Buddha's miraculous power adorns and purifies all worldly gates.",
        "source": "T10n0279_040:0213a05_2"
    },
    {
        "source_sentence": "若菩薩入此三昧，得法界力無有窮盡，得虛空行無有障礙；",
        "translation": "If enlightening beings enter this concentration, they will attain the power of the realm of reality without end. They will attain spacelike travel without obstruction.",
        "source": "T10n0279_040:0213a07_3"
    },
    {
        "source_sentence": "得法王位無量自在，譬如世間灌頂受職。",
        "translation": "They attain the position of king of the Dharma with immeasurable freedom, like being consecrated and appointed to a position in the world.",
        "source": "T10n0279_040:0213a08_4"
    },
    {
        "source_sentence": "得無邊智，一切通達；",
        "translation": "They attain boundless knowledge, comprehending all.",
        "source": "T10n0279_040:0213a09_5"
    },
    {
        "source_sentence": "得廣大力，十種圓滿；",
        "translation": "They attain great power and ten kinds of fulfillment.",
        "source": "T10n0279_040:0213a10_6"
    },
    {
        "source_sentence": "成無諍心，入寂滅際；",
        "translation": "They develop a mind free from anger and enter the realm of extinction.",
        "source": "T10n0279_040:0213a10_7"
    },
    {
        "source_sentence": "大悲無畏，猶如師子；",
        "translation": "Great compassion and fearlessness are like a lion’s lion.",
        "source": "T10n0279_040:0213a11_8"
    },
    {
        "source_sentence": "為智慧丈夫，然正法明燈；",
        "translation": "They become men of knowledge and wisdom, yet they are lamps of the light of truth.",
        "source": "T10n0279_040:0213a11_9"
    },
    {
        "source_sentence": "一切功德歎不可盡，聲聞、獨覺莫能思議；",
        "translation": "All their virtues were inexhaustible to be praised, unfathomable to the hearers and solitary enlightened ones.",
        "source": "T10n0279_040:0213a12_10"
    },
    {
        "source_sentence": "得法界智，住無動際，而能隨俗種種開演；",
        "translation": "Attaining knowledge of the realm of reality, they abide unshakably; yet they can teach in various ways according to worldly conditions.",
        "source": "T10n0279_040:0213a13_11"
    },
    {
        "source_sentence": "住於無相，善入法相；",
        "translation": "Abiding in signlessness, they skillfully enter the characteristics of things.",
        "source": "T10n0279_040:0213a14_12"
    },
    {
        "source_sentence": "得自性清淨藏，生如來清淨家；",
        "translation": "They attain the treasury of inherent purity and are born in the pure house of enlightenment.",
        "source": "T10n0279_040:0213a14_13"
    },
    {
        "source_sentence": "善開種種差別法門，而以智慧了無所有；",
        "translation": "They skillfully open various different approaches to teachings, yet by means of knowledge they comprehend that there is nothing.",
        "source": "T10n0279_040:0213a15_14"
    },
    {
        "source_sentence": "善知於時，常行法施開悟一切，名為智者；",
        "translation": "Knowing well at the time, always practicing doctrine and giving to enlighten all is called a wise one.",
        "source": "T10n0279_040:0213a16_15"
    },
    {
        "source_sentence": "普攝眾生，悉令清淨；",
        "translation": "They embraced all sentient beings and made them all pure.",
        "source": "T10n0279_040:0213a17_16"
    },
    {
        "source_sentence": "以方便智示成佛道，而常修行菩薩之行無有斷盡；",
        "translation": "By knowledge of means of expedient means they show the attainment of buddhahood, yet always cultivate enlightening practice without cease.",
        "source": "T10n0279_040:0213a17_17"
    },
    {
        "source_sentence": "入一切智方便境界，示現種種廣大神通。",
        "translation": "He enters the sphere of omniscience and skillful means, manifesting various vast spiritual powers.",
        "source": "T10n0279_040:0213a18_18"
    },
    {
        "source_sentence": "是故，普賢！",
        "translation": "Therefore, Samantabhadra!",
        "source": "T10n0279_040:0213a19_19"
    },
    {
        "source_sentence": "汝今應當分別廣說一切菩薩十大三昧，今此眾會咸皆願聞。」",
        "translation": "Now, you should explain in detail the ten great samādhis of all the bodhisattvas' ten great concentrations, and now everyone in this assembly wishes to hear them.",
        "source": "T10n0279_040:0213a19_20"
    },
    {
        "source_sentence": "爾時，普賢菩薩承如來旨，觀普眼等諸菩薩眾而告之言：「佛子！",
        "translation": "At that point, the enlightening being Universally Good received the Tathāgata's instructions, looked over the assembly of enlightening beings like Universal Eye and told them, saying, Son of the Buddha!",
        "source": "T10n0279_040:0213a21_21"
    },
    {
        "source_sentence": "云何為菩薩摩訶薩普光明三昧？",
        "translation": "“What is great enlightening beings’ concentration of universal light?",
        "source": "T10n0279_040:0213a22_22"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213a23_23"
    },
    {
        "source_sentence": "此菩薩摩訶薩有十種無盡法。",
        "translation": "These bodhisattvas and mahāsattvas have ten kinds of inexhaustible dharmas.",
        "source": "T10n0279_040:0213a23_24"
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_040:0213a24_25"
    },
    {
        "source_sentence": "所謂：諸佛出現智無盡、眾生變化智無盡、世界如影智無盡、深入法界智無盡、善攝菩薩智無盡、菩薩不退智無盡、善觀一切法義智無盡、善持心力智無盡、住廣大菩提心智無盡、住一切佛法一切智願力智無盡。",
        "translation": "The knowledge of the manifestation of buddhas is inexhaustible, the knowledge of the transformations of sentient beings is inexhaustible, the knowledge of worlds as reflections is inexhaustible, the knowledge of entering deeply into the",
        "source": "T10n0279_040:0213a24_26"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213a29_27"
    },
    {
        "source_sentence": "是名菩薩摩訶薩十種無盡法。",
        "translation": "These are called the ten kinds of inexhaustible dharmas of the bodhisattva-mahāsattva.",
        "source": "T10n0279_040:0213a29_28"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213b01_29"
    },
    {
        "source_sentence": "此菩薩摩訶薩發十種無邊心。",
        "translation": "These bodhisattvas, mahāsattvas, give rise to ten kinds of limitless mind.",
        "source": "T10n0279_040:0213b01_30"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_040:0213b02_31"
    },
    {
        "source_sentence": "所謂：發度脫一切眾生無邊心；",
        "translation": "They are the boundless determination to liberate all sentient beings.",
        "source": "T10n0279_040:0213b02_32"
    },
    {
        "source_sentence": "發承事一切諸佛無邊心；",
        "translation": "They develop boundless determination to serve all buddhas.",
        "source": "T10n0279_040:0213b03_0"
    },
    {
        "source_sentence": "發供養一切諸佛無邊心；",
        "translation": "They develop boundless determination to honor and serve all buddhas.",
        "source": "T10n0279_040:0213b03_1"
    },
    {
        "source_sentence": "發普見一切諸佛無邊心；",
        "translation": "They develop the boundless determination to see all buddhas everywhere.",
        "source": "T10n0279_040:0213b04_2"
    },
    {
        "source_sentence": "發受持一切佛法不忘失無邊心；",
        "translation": "They develop boundless determination to receive and uphold all buddha-teachings, not forgetting them.",
        "source": "T10n0279_040:0213b04_3"
    },
    {
        "source_sentence": "發示現一切佛無量神變無邊心；",
        "translation": "They develop boundless minds manifesting the infinity of all buddhas’ miraculous displays.",
        "source": "T10n0279_040:0213b05_4"
    },
    {
        "source_sentence": "發為得佛力故，不捨一切菩提行無邊心；",
        "translation": "They develop boundless determination to attain the power of buddhahood, not giving up all enlightenment practices.",
        "source": "T10n0279_040:0213b06_5"
    },
    {
        "source_sentence": "發普入一切智微細境界，說一切佛法無邊心；",
        "translation": "They develop the boundless determination to enter everywhere into the subtle realm of omniscience and explain all buddha-teachings.",
        "source": "T10n0279_040:0213b07_6"
    },
    {
        "source_sentence": "發普入佛不思議廣大境界無邊心；",
        "translation": "They develop boundless minds entering everywhere into the inconceivable vast realm of buddhahood.",
        "source": "T10n0279_040:0213b08_7"
    },
    {
        "source_sentence": "發於佛辯才起深志樂，領受諸佛法無邊心；",
        "translation": "They give rise to profound aspiration for enlightenment by the power of elucidation of buddhas. They receive the teachings of buddhas with boundless minds.",
        "source": "T10n0279_040:0213b09_8"
    },
    {
        "source_sentence": "發示現種種自在身，入一切如來道場眾會無邊心。",
        "translation": "He manifests various kinds of self-contained bodies and enters all the boundless minds of the congregations at the enlightenment sites of all the buddhas.",
        "source": "T10n0279_040:0213b10_9"
    },
    {
        "source_sentence": "是為十。",
        "translation": "These are the ten.",
        "source": "T10n0279_040:0213b11_10"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213b11_11"
    },
    {
        "source_sentence": "此菩薩摩訶薩有十種入三昧差別智。",
        "translation": "These bodhisattvas, mahāsattvas, have ten kinds of distinctive wisdom that enter samādhi.",
        "source": "T10n0279_040:0213b11_12"
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_040:0213b12_13"
    },
    {
        "source_sentence": "所謂：東方入定西方起，西方入定東方起，南方入定北方起，北方入定南方起，",
        "translation": "The so-called: entering concentration in the east is produced in the west; entering concentration in the west is produced in the east; entering concentration in the south is produced in the north; entering concentration in the north is produced in the south.",
        "source": "T10n0279_040:0213b12_14"
    },
    {
        "source_sentence": "東北方入定西南方起，西南方入定東北方起，西北方入定東南方起，東南方入定西北方起，",
        "translation": "They are produced in the northeast direction when entering absorption in the southwest direction; they are produced in the southwest direction when entering absorption in the southwest direction; they are produced in the northeast direction when entering absor",
        "source": "T10n0279_040:0213b14_15"
    },
    {
        "source_sentence": "下方入定上方起，上方入定下方起。",
        "translation": "The lower one enters absorption at the bottom and produces it above; the higher one enters absorption at the top and produces it below.",
        "source": "T10n0279_040:0213b16_16"
    },
    {
        "source_sentence": "是為十。",
        "translation": "These are the ten.",
        "source": "T10n0279_040:0213b17_17"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_040:0213b17_18"
    },
    {
        "source_sentence": "此菩薩摩訶薩有十種入大三昧善巧智。",
        "translation": "These bodhisattvas, mahāsattvas, have ten kinds of skillful knowledge that enter great concentration.",
        "source": "T10n0279_040:0213b17_19"
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_040:0213b18_20"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213b18_21"
    },
    {
        "source_sentence": "菩薩摩訶薩以三千大千世界為一蓮華，現身遍此蓮華之上結跏趺坐，身中復現三千大千世界，",
        "translation": "“Great enlightening beings take the 3,000 great one-thousand worlds into a single lotus blossom and manifest their bodies sitting cross-legged on top of that lotus blossom, while within their bodies also appearing another",
        "source": "T10n0279_040:0213b19_22"
    },
    {
        "source_sentence": "其中有百億四天下，一一四天下現百億身，一一身入百億百億三千大千世界，",
        "translation": "In each of the four continents there were ten billion buddha-bodies, one by one manifesting ten billion bodies. Each body entered into a universe measuring ten billion trillion in all directions.",
        "source": "T10n0279_040:0213b21_23"
    },
    {
        "source_sentence": "於彼世界一一四天下現百億百億菩薩修行，一一菩薩修行生百億百億決定解，",
        "translation": "In each of the four continents in those worlds were manifested ten billion trillion enlightening beings practicing, each enlightening being’s practice producing a hundred billion concentrations.",
        "source": "T10n0279_040:0213b23_24"
    },
    {
        "source_sentence": "一一決定解令百億百億根性圓滿，一一根性成百億百億菩薩法不退業。",
        "translation": "Each one of these determined understandings causes a hundred billion or ten billion faculties to be perfected in their faculties, and each faculty creates a hundred billion or ten billion bodhisattva dharmas that don't regress in action.",
        "source": "T10n0279_040:0213b25_0"
    },
    {
        "source_sentence": "然所現身非一非多，入定、出定無所錯亂。",
        "translation": "However, the body that is manifested is neither one nor many. There is no confusion in entering and emerging from absorption.",
        "source": "T10n0279_040:0213b26_1"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213b27_2"
    },
    {
        "source_sentence": "如羅睺阿脩羅王，本身長七百由旬，化形長十六萬八千由旬，於大海中出其半身，",
        "translation": "The realm of the asura king Rāhu is itself seven hundred yojanas long, and his apparitional form is sixty-eight thousand yojanas long.",
        "source": "T10n0279_040:0213b27_3"
    },
    {
        "source_sentence": "與須彌山而正齊等。",
        "translation": "It's exactly the same as Mount Sumeru.",
        "source": "T10n0279_040:0213b29_4"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213c01_5"
    },
    {
        "source_sentence": "彼阿脩羅王雖化其身長十六萬八千由旬，然亦不壞本身之相，諸蘊、界、處悉皆如本，",
        "translation": "The asura king was sixty-eight thousand yojanas in height, yet he did not destroy his physical form. All the aggregates, all the realms, and all the sense bases remained the same as before.",
        "source": "T10n0279_040:0213c01_6"
    },
    {
        "source_sentence": "心不錯亂，不於變化身而作他想，於其本身生非己想，本受生身恒受諸樂，",
        "translation": "Their minds are not disturbed, and they don’t think of the transformation body as other. They give rise to thoughts that it isn’t their own body, and always experience pleasures in the originally born body.",
        "source": "T10n0279_040:0213c03_7"
    },
    {
        "source_sentence": "化身常現種種自在神通威力。",
        "translation": "The transformation body always manifests various kinds of unimpeded supernormal powers and authority.",
        "source": "T10n0279_040:0213c04_8"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213c05_9"
    },
    {
        "source_sentence": "阿脩羅王有貪、恚、癡，具足憍慢，尚能如是變現其身；",
        "translation": "The titan king has craving, hatred, and delusion. Endowed with arrogance and conceit, he is able to manifest his body in this way.",
        "source": "T10n0279_040:0213c05_10"
    },
    {
        "source_sentence": "何況菩薩摩訶薩能深了達心法如幻，一切世間皆悉如夢，一切諸佛出興於世皆如影像，",
        "translation": "How much more so when great enlightening beings can profoundly understand that mind and principles are like illusions, that all worlds are like dreams, and that all buddhas appear in the world like reflections.",
        "source": "T10n0279_040:0213c06_11"
    },
    {
        "source_sentence": "一切世界猶如變化，言語音聲悉皆如響，見如實法，以如實法而為其身，",
        "translation": "All worlds are like apparitions, their speech and sounds all like echoes. Seeing the Teaching as it is, they take the Teaching as their body:",
        "source": "T10n0279_040:0213c09_12"
    },
    {
        "source_sentence": "知一切法本性清淨，了知身心無有實體，其身普住無量境界，以佛智慧廣大光明淨修一切菩提之行！",
        "translation": "Knowing that the essential nature of all things is pure, knowing body and mind have no substance, their bodies abide in measureless realms, purifying all enlightenment practices with the vast light of Buddha's wisdom!",
        "source": "T10n0279_040:0213c10_13"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_040:0213c13_14"
    },
    {
        "source_sentence": "菩薩摩訶薩住此三昧，超過世間，遠離世間，無能惑亂，無能映奪。",
        "translation": "When the bodhisattva Mahāsattva abides in this concentration, he transcends the world and is far removed from the world, unable to disturb or overpower it.",
        "source": "T10n0279_040:0213c13_15"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213c14_16"
    },
    {
        "source_sentence": "譬如比丘觀察內身，住不淨觀，審見其身皆是不淨。",
        "translation": "It's like a monk who observes his internal body and abides in the contemplation of impurity and examines to see that their bodies are all impure.",
        "source": "T10n0279_040:0213c15_17"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，住此三昧，觀察法身，見諸世間普入其身，於中明見一切世間及世間法，",
        "translation": "“Furthermore, the great enlightening beings in this concentration observe the body of reality and see all worlds enter their bodies; therein they clearly see all worlds and all mundane phenomena.",
        "source": "T10n0279_040:0213c16_18"
    },
    {
        "source_sentence": "於諸世間及世間法皆無所著。",
        "translation": "They don't cling to worldly things or worldly dharmas.",
        "source": "T10n0279_040:0213c18_19"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213c19_20"
    },
    {
        "source_sentence": "是名菩薩摩訶薩第一普光明大三昧善巧智。",
        "translation": "This is called the skillful knowledge of the bodhisattva-mahāsattva's first great samādhi of universal illumination.",
        "source": "T10n0279_040:0213c19_21"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_040:0213c21_0"
    },
    {
        "source_sentence": "云何為菩薩摩訶薩妙光明三昧？",
        "translation": "“What is great enlightening beings’ concentration of subtle light?",
        "source": "T10n0279_040:0213c21_1"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0213c21_2"
    },
    {
        "source_sentence": "此菩薩摩訶薩能入三千大千世界微塵數三千大千世界，於一一世界現三千大千世界微塵數身，",
        "translation": "“These great enlightening beings can enter as many worlds as atoms in a billion-world-galactic constellation into as many buddha-fields as atoms in the ten directions.",
        "source": "T10n0279_040:0213c22_0"
    },
    {
        "source_sentence": "一一身放三千大千世界微塵數光，一一光現三千大千世界微塵數色，一一色照三千大千世界微塵數世界，",
        "translation": "Each body emanated as many rays of light as atoms in a thousand worlds, each ray of light revealing as many colors as atoms in a thousand worlds, each color illuminating as many worlds as atoms in a thousand worlds.",
        "source": "T10n0279_040:0213c24_1"
    },
    {
        "source_sentence": "一一世界中調伏三千大千世界微塵數眾生。",
        "translation": "In each world, he subdues 3,000 great one-thousand worldly sentient beings as numerous as atoms in a thousand worlds.",
        "source": "T10n0279_040:0213c26_2"
    },
    {
        "source_sentence": "是諸世界種種不同，菩薩悉知，所謂：世界雜染、世界清淨、世界所因、世界建立、世界同住、世界光色、世界來往；",
        "translation": "Enlightening beings know the various differences of these worlds: worlds are defiled by worlds, worlds are pure, worlds are causes of worlds, worlds are established, worlds live together, worlds are shining and forming,",
        "source": "T10n0279_040:0213c27_3"
    },
    {
        "source_sentence": "如是一切，菩薩悉知，菩薩悉入。",
        "translation": "All of these things, the bodhisattva knows them all, and the bodhisattva enters them all.",
        "source": "T10n0279_040:0214a01_4"
    },
    {
        "source_sentence": "是諸世界亦悉來入菩薩之身，然諸世界無有雜亂，種種諸法亦不壞滅。",
        "translation": "All of these worlds also entered into the bodies of enlightening beings, yet there was no confusion in those worlds, and all kinds of phenomena did not perish.",
        "source": "T10n0279_040:0214a02_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0214a03_6"
    },
    {
        "source_sentence": "譬如日出遶須彌山、照七寶山，其七寶山及寶山間皆有光影分明顯現，",
        "translation": "It is as if the rising of the sun surrounded Mount Sumeru and shone upon a mountain of the seven kinds of treasure. That mountain of the seven kinds of treasure and those between them all had distinctive rays of light and shadow that appeared clearly.",
        "source": "T10n0279_040:0214a03_7"
    },
    {
        "source_sentence": "其寶山上所有日影莫不顯現山間影中，其七山間所有日影亦悉顯現山上影中；",
        "translation": "None of the images of the sun on that jeweled mountain are reflected in the images between the mountains, and all the images of the suns on those seven mountains are reflected in the images above.",
        "source": "T10n0279_040:0214a05_8"
    },
    {
        "source_sentence": "如是展轉，更相影現，或說日影出七寶山，或說日影出七山間，或說日影入七寶山，",
        "translation": "“Some say that the sun’s shadow comes out of the seven-jewel mountain ranges; some say that the sun’s shadow comes between the seven mountain ranges; some say that the sun’s shadow enters the seven-jewel mountain range.",
        "source": "T10n0279_040:0214a07_9"
    },
    {
        "source_sentence": "或說日影入七山間；",
        "translation": "Some say the sun’s reflection enters the seven mountain ranges.",
        "source": "T10n0279_040:0214a09_10"
    },
    {
        "source_sentence": "但此日影更相照現，無有邊際，體性非有，亦復非無，不住於山，不離於山，",
        "translation": "But the reflection of the sun shines on each other, without limit. Their essence has neither existence nor nonexistence; it does not dwell in mountains or beyond mountains.",
        "source": "T10n0279_040:0214a09_11"
    },
    {
        "source_sentence": "不住於水，亦不離水。",
        "translation": "They don't abide in water, and they don't part from water.",
        "source": "T10n0279_040:0214a11_12"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0214a12_13"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，住此妙光廣大三昧，不壞世間安立之相，不滅世間諸法自性；",
        "translation": "“Furthermore, great enlightening beings are also like this: abiding in this vast concentration of subtle light they do not destroy the characteristics of worldly establishment and do not annihilate the self-natures of worldly phenomena",
        "source": "T10n0279_040:0214a12_14"
    },
    {
        "source_sentence": "不住世界內，不住世界外；",
        "translation": "They do not dwell within worlds or beyond worlds.",
        "source": "T10n0279_040:0214a14_15"
    },
    {
        "source_sentence": "於諸世界無所分別，亦不壞於世界之相；",
        "translation": "They don’t discriminate worlds, and they don’t destroy the characteristics of worlds.",
        "source": "T10n0279_040:0214a14_16"
    },
    {
        "source_sentence": "觀一切法一相無相，亦不壞於諸法自性；",
        "translation": "Observing all things as one characteristic and formless, they also do not destroy the inherent nature of things.",
        "source": "T10n0279_040:0214a15_17"
    },
    {
        "source_sentence": "住真如性，恒不捨離。",
        "translation": "They abide in the true nature of reality, never abandoning it.",
        "source": "T10n0279_040:0214a16_18"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_040:0214a17_19"
    },
    {
        "source_sentence": "譬如幻師善知幻術，住四衢道作諸幻事，於一日中一須臾頃，或現一日，",
        "translation": "“Good man, it is like an illusionist who knows the arts of illusion well and stays at one of the four crossroads to perform magic tricks. In a single moment in a day he may show all kinds of illusory deeds for",
        "source": "T10n0279_040:0214a17_20"
    },
    {
        "source_sentence": "或現一夜，或復現作七日七夜、半月一月、一年百年，隨其所欲皆能示現城邑聚落、泉流河海、日月雲雨、宮殿屋宅，",
        "translation": "They may show one night, or they may show seven days and nights, a fortnight, a month, a month, a year, or a hundred years. According to their wishes, they can show cities, villages, streams, rivers, seas,",
        "source": "T10n0279_040:0214a19_21"
    },
    {
        "source_sentence": "如是一切靡不具足；",
        "translation": "All of these were fully endowed in every way.",
        "source": "T10n0279_040:0214a21_22"
    },
    {
        "source_sentence": "不以示現經年歲故，壞其根本一日一時；",
        "translation": "It does not show that the fundamentals of the scriptures are broken at one time for a day and a hour.",
        "source": "T10n0279_040:0214a22_23"
    },
    {
        "source_sentence": "不以本時極短促故，壞其所現日月年歲；",
        "translation": "It does not, because the time is extremely short, destroy the sun, moon, years, and years that appear in it.",
        "source": "T10n0279_040:0214a23_24"
    },
    {
        "source_sentence": "幻相明現，本日不滅。",
        "translation": "The illusory signs are clearly manifested, but they don't cease on the original day.",
        "source": "T10n0279_040:0214a24_25"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，入此妙光廣大三昧，現阿僧祇世界入一世界。",
        "translation": "Similarly, the bodhisattva Mahāsattva enters this vast concentration of marvelous light and manifests incalculably many worlds into one world.",
        "source": "T10n0279_040:0214a24_26"
    },
    {
        "source_sentence": "其阿僧祇世界一一皆有地、水、火、風、大海、諸山、城邑、聚落、園林、屋宅、天宮、龍宮、夜叉宮、乾闥婆宮、阿脩羅宮、迦樓羅宮、緊那羅宮、摩睺羅伽宮，",
        "translation": "In each of those incalculable worlds there was earth, water, fire, wind, the ocean, mountains, cities, villages, parks, mansions, celestial palaces, dragon palaces, yakṣa palaces, heavenly palaces",
        "source": "T10n0279_040:0214a26_27"
    },
    {
        "source_sentence": "種種莊嚴皆悉具足。",
        "translation": "All kinds of adornments are fully present.",
        "source": "T10n0279_040:0214a29_28"
    },
    {
        "source_sentence": "欲界、色界、無色界，小千世界、大千世界，業行果報，死此生彼。",
        "translation": "In the realm of sexual passion, in the realm of form and in the one of formlessness, there are small-thousand worlds and great-thousand worlds as retribution for action: dying here and being born there.",
        "source": "T10n0279_040:0214a29_29"
    },
    {
        "source_sentence": "一切世間所有時節、須臾、晝夜、半月、一月、一歲、百歲、成劫、壞劫，",
        "translation": "All the seasons in all the worlds, instants, days, nights, fortnights, a month, a year, a hundred years, eons of formation and eons of disintegration.",
        "source": "T10n0279_040:0214b02_30"
    },
    {
        "source_sentence": "雜染國土、清淨國土、廣大國土、狹小國土，於中諸佛出興于世，佛剎清淨，",
        "translation": "The lands of defilement, pure lands, vast lands, narrow lands, and small lands—where the Buddhas arise in the world, the buddha-lands are pure.",
        "source": "T10n0279_040:0214b03_31"
    },
    {
        "source_sentence": "菩薩眾會周匝圍遶，神通自在，教化眾生。",
        "translation": "They are surrounded by congregations of enlightening beings, free and unimpeded in their supernormal powers, teaching sentient beings.",
        "source": "T10n0279_040:0214b05_32"
    },
    {
        "source_sentence": "其諸國土所在方處，無量人眾悉皆充滿，殊形異趣種種眾生無量無邊不可思議，",
        "translation": "Innumerable, boundless, and inconceivable were the various forms and destinies of sentient beings.",
        "source": "T10n0279_040:0214b06_33"
    },
    {
        "source_sentence": "去、來、現在清淨業力出生無量上妙珍寶。",
        "translation": "The pure karmic power of past, future, and present produces measureless marvelous treasures.",
        "source": "T10n0279_040:0214b08_34"
    },
    {
        "source_sentence": "如是等事，咸悉示現，入一世界。",
        "translation": "Such things are all shown and entered into one world.",
        "source": "T10n0279_040:0214b09_35"
    },
    {
        "source_sentence": "菩薩於此普皆明見，普入普觀，普思普了，以無盡智皆如實知，不以彼世界多故壞此一世界，",
        "translation": "Here the enlightening beings see everywhere clearly, enter everywhere, contemplate everywhere, think everywhere, comprehend everywhere, know all as they really are by inexhaustible knowledge, and do not destroy a single world because there are so many worlds.",
        "source": "T10n0279_040:0214b10_0"
    },
    {
        "source_sentence": "不以此世界一故壞彼多世界。",
        "translation": "It's not because this world is one that it doesn't destroy many worlds.",
        "source": "T10n0279_040:0214b12_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_040:0214b12_2"
    },
    {
        "source_sentence": "菩薩知一切法皆無我故，是名：入無命法、無作法者；",
        "translation": "Because enlightening beings know all things are selfless, they are called those who enter the principle of lifelessness and the principle of doing nothing.",
        "source": "T10n0279_040:0214b13_0"
    },
    {
        "source_sentence": "菩薩於一切世間勤修行無諍法故，是名：住無我法者；",
        "translation": "Because enlightening beings diligently practice the principle of noncontention in all worlds, they are called those who abide in the principle of selflessness.",
        "source": "T10n0279_040:0214b14_1"
    },
    {
        "source_sentence": "菩薩如實見一切身皆從緣起故，是名：住無眾生法者；",
        "translation": "Because enlightening beings truly see all bodies as coming from conditions, they are said to abide in the absence of sentient beings.",
        "source": "T10n0279_040:0214b15_2"
    },
    {
        "source_sentence": "菩薩知一切生滅法皆從因生故，是名：住無補伽羅法者；",
        "translation": "Enlightening beings know that all things that arise and perish are born of causes. This is called abiding in the absence of personal principles.",
        "source": "T10n0279_040:0214b16_3"
    },
    {
        "source_sentence": "菩薩知諸法本性平等故，是名：住無意生、無摩納婆法者；",
        "translation": "Because enlightening beings know the essential nature of all things is equanimous, they are called those who abide in thoughtlessness and nonmanifest dharmas.",
        "source": "T10n0279_040:0214b17_4"
    },
    {
        "source_sentence": "菩薩知一切法本性寂靜故，是名：住寂靜法者；",
        "translation": "Because enlightening beings know the essential quiescence of all things, they are called those who abide in the principle of quiescence.",
        "source": "T10n0279_040:0214b19_5"
    },
    {
        "source_sentence": "菩薩知一切法一相故，是名：住無分別法者；",
        "translation": "Because enlightening beings know all things are one and the same characteristic, they are called those who abide in nondiscriminating principles.",
        "source": "T10n0279_040:0214b20_6"
    },
    {
        "source_sentence": "菩薩知法界無有種種差別法故，是名：住不思議法者；",
        "translation": "Because enlightening beings know the realm of reality has no various differentiating dharmas, they are called those who abide by inconceivable principles.",
        "source": "T10n0279_040:0214b21_7"
    },
    {
        "source_sentence": "菩薩勤修一切方便，善調伏眾生故，是名：住大悲法者。",
        "translation": "Enlightening beings diligently cultivate all means of liberation, skillfully taming sentient beings: this is called someone who dwells in the principle of great compassion.",
        "source": "T10n0279_040:0214b22_8"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_040:0214b23_9"
    },
    {
        "source_sentence": "菩薩如是能以阿僧祇世界入一世界，知無數眾生種種差別，見無數菩薩各各發趣，",
        "translation": "“Thus can enlightening beings enter one world by means of incalculable worlds, knowing the various differences of countless sentient beings, and seeing countless enlightening beings each setting out for different paths.",
        "source": "T10n0279_040:0214b23_10"
    },
    {
        "source_sentence": "觀無數諸佛處處出興；",
        "translation": "They saw countless buddhas appearing everywhere.",
        "source": "T10n0279_040:0214b25_11"
    },
    {
        "source_sentence": "彼諸如來所演說法，其諸菩薩悉能領受，亦見自身於中修行；",
        "translation": "Those enlightening beings were able to receive all the teachings expounded by those buddhas, and also saw themselves there practicing them.",
        "source": "T10n0279_040:0214b26_12"
    },
    {
        "source_sentence": "然不捨此處而見在彼，亦不捨彼處而見在此，彼身、此身無有差別。",
        "translation": "However, they don't abandon this place and see it here, and they don't abandon that place and see it here, and there's no difference between their body and this body.",
        "source": "T10n0279_040:0214b27_13"
    },
    {
        "source_sentence": "入法界故，常勤觀察無有休息，不捨智慧無退轉故。",
        "translation": "Because of entering the realm of reality, they always diligently observe without cease: because they do not abandon wisdom and do not turn back.",
        "source": "T10n0279_040:0214b29_14"
    },
    {
        "source_sentence": "如有幻師隨於一處作諸幻術，不以幻地故壞於本地，不以幻日故壞於本日。",
        "translation": "Suppose an illusionist follows one place and creates illusory tricks that don't disintegrate in the local because they're illusory and don't disintegrate in the original day because they're illusory.",
        "source": "T10n0279_040:0214c01_15"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，於無國土現有國土，於有國土現無國土；",
        "translation": "“Furthermore, great enlightening beings are also like this: they manifest their lands in the absence of a land when there is a land, and they show no land when there is a land.",
        "source": "T10n0279_040:0214c03_16"
    },
    {
        "source_sentence": "於有眾生現無眾生，於無眾生現有眾生；",
        "translation": "When sentient beings exist, they manifest nonsentient beings; when there are no sentient beings, they manifest sentient beings.",
        "source": "T10n0279_040:0214c04_17"
    },
    {
        "source_sentence": "無色現色，色現無色；",
        "translation": "Formless manifests form, and form manifests formlessness.",
        "source": "T10n0279_040:0214c05_18"
    },
    {
        "source_sentence": "初不亂後，後不亂初。",
        "translation": "The first is not disturbed by the second, and the latter is not disturbed by the first.",
        "source": "T10n0279_040:0214c06_19"
    },
    {
        "source_sentence": "菩薩了知一切世法悉亦如是，同於幻化。",
        "translation": "The bodhisattva understands that all worldly dharmas are likewise, which is the same as illusory transformation.",
        "source": "T10n0279_040:0214c06_20"
    },
    {
        "source_sentence": "知法幻故，知智幻；",
        "translation": "Because they know things are illusory, they know knowledge is illusory.",
        "source": "T10n0279_040:0214c07_21"
    },
    {
        "source_sentence": "知智幻故，知業幻；",
        "translation": "Because they know knowledge is illusory, they know action is illusory.",
        "source": "T10n0279_040:0214c08_22"
    },
    {
        "source_sentence": "知智幻、業幻已，起於幻智，觀一切業如世幻者，不於處外而現其幻，",
        "translation": "Knowing that knowledge is illusory and action is illusory, he produces illusion knowledge. He observes that all actions are like worldly illusions, yet he does not show them anywhere else as illusions.",
        "source": "T10n0279_040:0214c08_23"
    },
    {
        "source_sentence": "亦不於幻外而有其處。",
        "translation": "Nor does it have a place outside of illusion.",
        "source": "T10n0279_040:0214c10_24"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，不於虛空外入世間，亦不於世間外入虛空。",
        "translation": "Similarly, the bodhisattva Mahāsattva doesn't enter the world outside of space and doesn't enter space outside of the world.",
        "source": "T10n0279_040:0214c10_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_040:0214c12_26"
    },
    {
        "source_sentence": "虛空、世間無差別故，住於世間亦住虛空。",
        "translation": "Because space and the world are not different, they abide in the world and also abide in space.",
        "source": "T10n0279_040:0214c12_27"
    },
    {
        "source_sentence": "菩薩摩訶薩於虛空中能見、能修一切世間種種差別妙莊嚴業，於一念頃悉能了知無數世界若成若壞，",
        "translation": "“Furthermore, great enlightening beings can see and cultivate all the various beautiful adornments of all worlds in space. In a single thought they can know countless worlds, forming and disintegrating,",
        "source": "T10n0279_040:0214c13_28"
    },
    {
        "source_sentence": "亦知諸劫相續次第；",
        "translation": "They also know the succession of eons.",
        "source": "T10n0279_040:0214c15_29"
    },
    {
        "source_sentence": "能於一念現無數劫，亦不令其一念廣大。",
        "translation": "He can manifest countless eons in a single thought, and he doesn't cause that single thought to be vast.",
        "source": "T10n0279_040:0214c16_30"
    },
    {
        "source_sentence": "菩薩摩訶薩得不思議解脫幻智，到於彼岸；",
        "translation": "“Great enlightening beings attain the magic knowledge of inconceivable liberation and reach the other shore.",
        "source": "T10n0279_040:0214c17_31"
    },
    {
        "source_sentence": "住於幻際，入世幻數，思惟諸法悉皆如幻；",
        "translation": "Abiding in the realm of illusion, they enter worldly illusions. They contemplate all things as illusions.",
        "source": "T10n0279_040:0214c18_32"
    },
    {
        "source_sentence": "不違幻世，盡於幻智，了知三世與幻無別，決定通達，心無邊際。",
        "translation": "Not opposed to illusory worlds, he exhausts the knowledge of illusion and comprehends that the three worlds are not distinct from illusion or illusory, with certainty and penetration, and his mind has no limit.",
        "source": "T10n0279_040:0214c19_33"
    },
    {
        "source_sentence": "如諸如來住如幻智，其心平等；",
        "translation": "Just as all buddhas abide in illusionlike knowledge, their minds are equal.",
        "source": "T10n0279_040:0214c20_34"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，知諸世間皆悉如幻，於一切處皆無所著、無有我所。",
        "translation": "Similarly, the bodhisattva Mahāsattva knows that all worlds are illusory and has no attachment or possessions in any place.",
        "source": "T10n0279_040:0214c21_35"
    },
    {
        "source_sentence": "如彼幻師作諸幻事，雖不與彼幻事同住，而於幻事亦無迷惑；",
        "translation": "Just as those magicians create illusions, even though they do not live together with the illusions, yet they are not confused by the illusions.",
        "source": "T10n0279_040:0214c22_36"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，知一切法到於彼岸，心不計我能入於法，亦不於法而有錯亂。",
        "translation": "Similarly, the bodhisattva Mahāsattva knows all dharmas and reaches the other shore, doesn't think in his mind that I can enter the teachings, and doesn't have confusion about the teachings.",
        "source": "T10n0279_040:0214c24_37"
    },
    {
        "source_sentence": "是為菩薩摩訶薩第二妙光明大三昧善巧智。",
        "translation": "This is the second skillful knowledge of the bodhisattva Mahāsattva's marvelous radiant great samādhi.",
        "source": "T10n0279_040:0214c26_38"
    },
    {
        "source_sentence": "大方廣佛華嚴經卷第四十",
        "translation": "Dafangguang fo huayan jing, vol. 40",
        "source": "T10n0279_040:0214c28_0"
    }
]