[
    {
        "source_sentence": "大方廣佛華嚴經卷第二十八",
        "translation": "Dafangguang fo huayan jing, vol. 28",
        "source": "T10n0279_028:0150a16_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_028:0150a18_0"
    },
    {
        "source_sentence": "十迴向品第二十五之六",
        "translation": "The Twenty-fifth and Sixth Chapter of the Ten dedications of Rebirth",
        "source": "T10n0279_028:0150a19_0"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0150a20_0"
    },
    {
        "source_sentence": "菩薩摩訶薩若見如來出興於世開演正法，以大音聲普告一切：『如來出世！",
        "translation": "If the bodhisattva Mahāsattva sees the Tathāgata appearing in the world and explains the right teaching, he tells everyone in a loud voice, 'The Tathāgata appears in the world!'",
        "source": "T10n0279_028:0150a20_1"
    },
    {
        "source_sentence": "如來出世！』",
        "translation": "The Tathāgata appears in the world!'",
        "source": "T10n0279_028:0150a21_2"
    },
    {
        "source_sentence": "令諸眾生得聞佛名，捨離一切我慢、戲論；",
        "translation": "“Great enlightening beings cause sentient beings to hear the names of buddhas, getting rid of all self-conceit and indolence.",
        "source": "T10n0279_028:0150a22_3"
    },
    {
        "source_sentence": "復更勸導，令速見佛，令憶念佛，令歸向佛，令攀緣佛，令觀察佛，令讚歎佛；",
        "translation": "They also induce them to quickly see buddhas, to remember buddhas, to return to buddhas, to associate with buddhas, to contemplate with buddhas, and to praise buddhas.",
        "source": "T10n0279_028:0150a23_0"
    },
    {
        "source_sentence": "復為廣說佛難值遇，千萬億劫時乃一出。",
        "translation": "Again, it's explained in detail that the Buddha is difficult to meet, and after a thousand billion eons, he emerges once.",
        "source": "T10n0279_028:0150a24_1"
    },
    {
        "source_sentence": "眾生由此得見於佛，生清淨信，踊躍歡喜，尊重供養；",
        "translation": "Because of this, sentient beings attain insight into buddhas and develop pure faith in them. They dance with joy and venerate and honor the buddhas’ offerings.",
        "source": "T10n0279_028:0150a25_2"
    },
    {
        "source_sentence": "復於佛所聞諸佛名，轉更值遇無數諸佛，植諸善本，修習增長。",
        "translation": "Again, when they hear the names of the buddhas at the Buddha's feet, they gradually meet countless buddhas, plant good roots, cultivate and grow.",
        "source": "T10n0279_028:0150a26_3"
    },
    {
        "source_sentence": "爾時，無數百千萬億那由他眾生，因見佛故，皆得清淨究竟調伏。",
        "translation": "Countless hundreds of thousands of myriads of koṭis of nayutas of sentient beings then attained purity and ultimate discipline because they saw the Buddha.",
        "source": "T10n0279_028:0150a28_4"
    },
    {
        "source_sentence": "彼諸眾生於菩薩所，皆生最上善知識想；",
        "translation": "Those sentient beings all conceived the thought that they were the supreme teachers of enlightening beings.",
        "source": "T10n0279_028:0150a29_5"
    },
    {
        "source_sentence": "因菩薩故，成就佛法，以無數劫所種善根，普於世間施作佛事。",
        "translation": "Because of these enlightening beings they perfected the buddha-dharma, planted roots of goodness over countless eons, and performed buddha-work throughout the world.",
        "source": "T10n0279_028:0150b01_6"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0150b03_7"
    },
    {
        "source_sentence": "菩薩摩訶薩開示眾生令見佛時，以諸善根如是迴向，所謂：『願一切眾生不待勸誘，",
        "translation": "“When great enlightening beings show sentient beings and cause them to see buddhas, they dedicate the roots of goodness in this way:",
        "source": "T10n0279_028:0150b03_8"
    },
    {
        "source_sentence": "自往見佛，承事供養，皆令歡喜；",
        "translation": "They went there to see the Buddha and served and honored him, enabling them all to rejoice.",
        "source": "T10n0279_028:0150b05_9"
    },
    {
        "source_sentence": "願一切眾生常樂見佛，心無廢捨；",
        "translation": "May all sentient beings always delight in seeing buddhas, their minds never giving up.",
        "source": "T10n0279_028:0150b05_10"
    },
    {
        "source_sentence": "願一切眾生常勤修習廣大智慧，受持一切諸佛法藏；",
        "translation": "May all sentient beings always diligently cultivate vast knowledge and receive and uphold the treasury of teachings of all buddhas.",
        "source": "T10n0279_028:0150b06_11"
    },
    {
        "source_sentence": "願一切眾生隨所聞聲皆悟佛法，於無量劫修菩薩行；",
        "translation": "May all sentient beings, according to the sounds they hear, all realize the buddha-dharma and cultivate enlightening practice for immeasurable eons.",
        "source": "T10n0279_028:0150b07_12"
    },
    {
        "source_sentence": "願一切眾生安住正念，恒以智眼見佛出興；",
        "translation": "May all sentient beings abide in right mindfulness, always seeing the emergence of buddhas with the eye of knowledge.",
        "source": "T10n0279_028:0150b09_13"
    },
    {
        "source_sentence": "願一切眾生不念異業，常憶見佛，勤修十力；",
        "translation": "May all sentient beings not think of dissimilar actions, always remembering the Buddha; diligently cultivating the ten powers.",
        "source": "T10n0279_028:0150b10_14"
    },
    {
        "source_sentence": "願一切眾生於一切處常見諸佛，了達如來遍虛空界；",
        "translation": "May all sentient beings see the Buddhas in all places and comprehend the space realm of buddhas everywhere.",
        "source": "T10n0279_028:0150b11_15"
    },
    {
        "source_sentence": "願一切眾生皆得具足佛自在身，普於十方成道說法；",
        "translation": "May all sentient beings be endowed with the unimpeded body of buddhahood, teaching everywhere in the ten directions.",
        "source": "T10n0279_028:0150b12_16"
    },
    {
        "source_sentence": "願一切眾生遇善知識，常聞佛法，於諸如來得不壞信；",
        "translation": "May all sentient beings meet spiritual benefactors and always hear the Teaching of buddhas, and attain unshakable faith in enlightened ones.",
        "source": "T10n0279_028:0150b13_17"
    },
    {
        "source_sentence": "願一切眾生悉能稱歎諸佛出興，令其見者普得清淨。』",
        "translation": "May all sentient beings be able to praise the emergence of the buddhas and cause those who see them to attain purity.'",
        "source": "T10n0279_028:0150b14_18"
    },
    {
        "source_sentence": "是為菩薩摩訶薩歎佛出世善根迴向；",
        "translation": "“This is great enlightening beings’ dedication praising the Buddha’s transcendent roots of goodness.",
        "source": "T10n0279_028:0150b16_19"
    },
    {
        "source_sentence": "為令眾生見一切佛供養承事，於無上法究竟清淨故。",
        "translation": "It's to cause sentient beings to see all the buddhas and make offerings to them, so they'll be ultimately pure in the unsurpassed Dharma.",
        "source": "T10n0279_028:0150b16_20"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0150b18_21"
    },
    {
        "source_sentence": "菩薩摩訶薩捨於大地，或施諸佛，造立精舍；",
        "translation": "“Great enlightening beings give up the earth or give it to the Buddhas and build temples.",
        "source": "T10n0279_028:0150b18_22"
    },
    {
        "source_sentence": "或施菩薩及善知識，隨意所用；",
        "translation": "Or they may give to enlightening beings and spiritual benefactors for their use as they wish.",
        "source": "T10n0279_028:0150b19_23"
    },
    {
        "source_sentence": "或施眾僧，以為住處；",
        "translation": "Sometimes they give to the community of monks as their dwelling places.",
        "source": "T10n0279_028:0150b20_24"
    },
    {
        "source_sentence": "或施父母，或施別人、聲聞、獨覺種種福田，乃至一切貧窮、孤露及餘四眾，",
        "translation": "They may give to their parents, or they may give to others, śrāvakas and pratyekbuddhas, various fields of merit, up to all the poor, orphaned, and other four groups of people.",
        "source": "T10n0279_028:0150b20_25"
    },
    {
        "source_sentence": "隨意悉與，令無所乏；",
        "translation": "They give them all as they wish, so that there is nothing lacking.",
        "source": "T10n0279_028:0150b22_26"
    },
    {
        "source_sentence": "或施造立如來塔廟。",
        "translation": "Or they may donate to build a stūpa or shrine for the Tathāgata.",
        "source": "T10n0279_028:0150b22_27"
    },
    {
        "source_sentence": "於如是等諸處之中，悉為辦具資生什物，令隨意用，無所恐懼。",
        "translation": "In all these places they prepare provisions and necessities for their use as they wish, without any fear.",
        "source": "T10n0279_028:0150b23_28"
    },
    {
        "source_sentence": "菩薩摩訶薩隨何方所布施地時，以諸善根如是迴向，所謂：『願一切眾生具足清淨一切智地，",
        "translation": "“Wherever great enlightening beings practice giving, they dedicate the roots of goodness in this way:",
        "source": "T10n0279_028:0150b24_29"
    },
    {
        "source_sentence": "悉到普賢眾行彼岸；",
        "translation": "They all arrived at the other shore of the practices of Universally Good.",
        "source": "T10n0279_028:0150b26_30"
    },
    {
        "source_sentence": "願一切眾生得總持地，正念受持一切佛法；",
        "translation": "May all sentient beings attain the state of mastery, receiving and upholding all buddha-teachings with right mindfulness.",
        "source": "T10n0279_028:0150b27_31"
    },
    {
        "source_sentence": "願一切眾生得住持力，常能守護一切佛教；",
        "translation": "May all sentient beings attain the power of abiding support and always be able to protect all teachings.",
        "source": "T10n0279_028:0150b28_32"
    },
    {
        "source_sentence": "願一切眾生得如地心，於諸眾生，意常清淨，無有惡念；",
        "translation": "May all sentient beings attain a mind like the earth; may their minds always be pure, with no thoughts of evil.",
        "source": "T10n0279_028:0150b29_33"
    },
    {
        "source_sentence": "願一切眾生持諸佛種，成就菩薩諸地次第，無有斷絕；",
        "translation": "May all sentient beings maintain the lineage of buddhas, perfecting the succession of enlightening beings’ stages without cease.",
        "source": "T10n0279_028:0150c01_34"
    },
    {
        "source_sentence": "願一切眾生普為一切作安隱處，悉令調伏，住清淨道；",
        "translation": "May all sentient beings be everywhere a peaceful abode for all, causing them to be tamed and live on the pure path.",
        "source": "T10n0279_028:0150c02_35"
    },
    {
        "source_sentence": "願一切眾生同諸如來利益世間，普使勤修安住佛力；",
        "translation": "May all sentient beings be the same as the enlightened ones in benefiting the world, causing all to diligently cultivate and abide in the power of buddhahood.",
        "source": "T10n0279_028:0150c04_36"
    },
    {
        "source_sentence": "願一切眾生普為世間之所愛樂，悉令安住無上佛樂；",
        "translation": "May all sentient beings be universally loved by the world, enabling them to abide in the bliss of unexcelled Buddhahood.",
        "source": "T10n0279_028:0150c05_37"
    },
    {
        "source_sentence": "願一切眾生獲善方便，住佛諸力、無畏法中；",
        "translation": "May all sentient beings attain skillful means, dwelling in the powers and fearlessnesses of buddhas.",
        "source": "T10n0279_028:0150c06_38"
    },
    {
        "source_sentence": "願一切眾生得如地智，自在修行一切佛法。』",
        "translation": "May all sentient beings attain the knowledge of the earth as it is and freely cultivate all the Buddha's teachings.'",
        "source": "T10n0279_028:0150c07_39"
    },
    {
        "source_sentence": "是為菩薩摩訶薩施大地時善根迴向，為令眾生皆得究竟一切如來清淨地故。",
        "translation": "This is the good root that the bodhisattva Mahāsattva dedicates when he gives to the great ground, in order to cause sentient beings to attain the ultimate pure land of all tathāgatas.",
        "source": "T10n0279_028:0150c08_40"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0150c10_41"
    },
    {
        "source_sentence": "菩薩摩訶薩布施僮僕，供養一切諸佛、菩薩、真善知識，或施僧寶，或奉父母尊勝福田；",
        "translation": "“Great enlightening beings give to servants, honoring all buddhas, enlightening beings, and true spiritual benefactors; sometimes they give the treasures of the Sangha, sometimes they offer them to their parents as fields of blessedness.",
        "source": "T10n0279_028:0150c10_42"
    },
    {
        "source_sentence": "或復給施病苦眾生，令無闕乏，以存其命；",
        "translation": "Or they may also give to sentient beings suffering from sickness and afflictions, enabling them not to lack, in order to save their lives.",
        "source": "T10n0279_028:0150c12_43"
    },
    {
        "source_sentence": "或復施與貧窮、孤露，及餘一切無瞻侍者；",
        "translation": "They may also give to the poor, orphaned, and all the others who have no attendants.",
        "source": "T10n0279_028:0150c13_44"
    },
    {
        "source_sentence": "或為守護如來塔廟，或為書持諸佛正法，以百千億那由他僕使，隨時給施。",
        "translation": "They may guard the Tathāgata's stūpas and temples, or write and preserve the true teachings of the buddhas, or give them as an offering at any time with hundreds of thousands of millions of billions of trillions of other servants.",
        "source": "T10n0279_028:0150c14_45"
    },
    {
        "source_sentence": "其諸僕使皆聰慧善巧，性自調順，常勤精進，無有懈惰，具質直心、安樂心、利益心、仁慈心、恭恪心、無怨恨心、無讎敵心，",
        "translation": "Their servants and messengers were all learned, wise, skillful, and self-controlled by nature. They always exerted themselves with diligence, without laziness or laziness. They possessed an honest mind, a peaceful mind, a mind of benefit, a mind of kindness and compassion, a mind of reverence and scruples, a mind free from enmity",
        "source": "T10n0279_028:0150c16_46"
    },
    {
        "source_sentence": "能隨受者方俗所宜，於彼彼中作諸利益；",
        "translation": "The enlightening beings are able to follow the appropriate customs of those who receive them and work for their benefit in various ways.",
        "source": "T10n0279_028:0150c18_47"
    },
    {
        "source_sentence": "又皆從菩薩淨業所感，才能、技藝、工巧、算數靡不通達，善能供侍悅可其心。",
        "translation": "They all came from the pure deeds of enlightening beings, and were imbued with talent, skill in arts and crafts, skills in craftsmanship, and mathematical calculations. They were able to satisfy their minds and provide them with offerings.",
        "source": "T10n0279_028:0150c19_48"
    },
    {
        "source_sentence": "菩薩爾時，以諸善根如是迴向，所謂：『願一切眾生得調順心，一切佛所修習善根；",
        "translation": "At that time enlightening beings dedicate the roots of goodness in this way:",
        "source": "T10n0279_028:0150c21_49"
    },
    {
        "source_sentence": "願一切眾生隨順供養一切諸佛，於佛所說悉能聽受；",
        "translation": "May all sentient beings follow and honor all buddhas and be able to hear and receive what they teach.",
        "source": "T10n0279_028:0150c23_50"
    },
    {
        "source_sentence": "願一切眾生得佛攝受，常觀如來，更無餘念；",
        "translation": "May all sentient beings attain enlightenment, always observing the Enlightened One without any thought of anything else.",
        "source": "T10n0279_028:0150c24_51"
    },
    {
        "source_sentence": "願一切眾生不壞佛種，勤修一切順佛善根；",
        "translation": "May all sentient beings not destroy the seed of buddhahood, diligently cultivating all roots of goodness conforming to buddhahood.",
        "source": "T10n0279_028:0150c25_52"
    },
    {
        "source_sentence": "願一切眾生常勤供養一切諸佛，無空過時；",
        "translation": "May all sentient beings always diligently honor and serve all buddhas, never failing to do so.",
        "source": "T10n0279_028:0150c26_53"
    },
    {
        "source_sentence": "願一切眾生攝持一切諸佛妙義，言辭清淨，遊行無畏；",
        "translation": "May all sentient beings preserve the wondrous meaning of all buddhas, their speech pure and genuine, traveling fearlessly.",
        "source": "T10n0279_028:0150c27_54"
    },
    {
        "source_sentence": "願一切眾生常樂見佛，心無厭足，於諸佛所不惜身命；",
        "translation": "May all sentient beings always delight in seeing buddhas, their minds never getting tired of them.",
        "source": "T10n0279_028:0150c28_55"
    },
    {
        "source_sentence": "願一切眾生得見諸佛，心無染著，離世所依；",
        "translation": "May all sentient beings be able to see the Buddhas, their minds without defiled attachment, beyond worldly bases.",
        "source": "T10n0279_028:0151a01_56"
    },
    {
        "source_sentence": "願一切眾生但歸於佛，永離一切邪歸依處；",
        "translation": "May all sentient beings take refuge only in Buddha, the refuge of forever leaving behind all evils.",
        "source": "T10n0279_028:0151a02_57"
    },
    {
        "source_sentence": "願一切眾生隨順佛道，心常樂觀無上佛法。』",
        "translation": "May all sentient beings follow the Buddha's path, and their minds always delight in observing the unsurpassed buddha-dharma.'",
        "source": "T10n0279_028:0151a03_58"
    },
    {
        "source_sentence": "是為菩薩摩訶薩施僕使時善根迴向；",
        "translation": "“This is great enlightening beings’ dedication of roots of goodness at the time of giving to their servants.",
        "source": "T10n0279_028:0151a04_59"
    },
    {
        "source_sentence": "為令眾生遠離塵垢，淨治佛地，能現如來自在身故。",
        "translation": "In order to cause sentient beings to be far removed from defilement and purify the Buddha-stage, he's able to manifest the Tathāgata's unimpeded body.",
        "source": "T10n0279_028:0151a04_60"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0151a06_61"
    },
    {
        "source_sentence": "菩薩摩訶薩以身布施諸來乞者，布施之時，生謙下心，生如地心，生忍受眾苦無變動心，",
        "translation": "“Great enlightening beings give their bodies to those who come and ask for them, and when they give, they become humble, like the earth, enduring all kinds of suffering unchangingly.",
        "source": "T10n0279_028:0151a06_62"
    },
    {
        "source_sentence": "生給侍眾生不疲厭心，生於諸眾生猶如慈母所有眾善悉迴與心，生於諸愚險極惡眾生種種侵陵皆寬宥心，",
        "translation": "They give to sentient beings all the virtues of their mother’s loving-kindness. They are generous and sympathetic to ignorant, dangerous, and utterly unworthy sentient beings who belong to various kinds of enemies.",
        "source": "T10n0279_028:0151a08_63"
    },
    {
        "source_sentence": "安住善根，精勤給事。",
        "translation": "Abiding in the roots of goodness, they diligently undertake service.",
        "source": "T10n0279_028:0151a10_64"
    },
    {
        "source_sentence": "菩薩爾時，悉以善根如是迴向，所謂：『願一切眾生隨其所須常無闕乏，",
        "translation": "At that time the enlightening beings dedicate all their roots of goodness in this way:",
        "source": "T10n0279_028:0151a11_65"
    },
    {
        "source_sentence": "修菩薩行恒不間斷，不捨一切菩薩義利，善住菩薩所行之道，了達菩薩平等法性，",
        "translation": "They cultivate the practices of enlightening beings without interruption; they do not give up the benefits of all enlightening beings. They are well situated on the paths practiced by enlightening beings, comprehending the equality of reality of enlightening beings.",
        "source": "T10n0279_028:0151a12_66"
    },
    {
        "source_sentence": "得在如來種族之數，住真實語，持菩薩行，令諸世間得淨佛法，深心信解，",
        "translation": "They attain enlightenment by means of the practice of enlightening beings; they are counted among the spiritual lineages of buddhas. Abiding in true speech, they preserve the practices of enlightening beings and cause all worlds to attain purification of the buddha-dharma.",
        "source": "T10n0279_028:0151a14_67"
    },
    {
        "source_sentence": "證法究竟；",
        "translation": "They realize the ultimate truth.",
        "source": "T10n0279_028:0151a16_68"
    },
    {
        "source_sentence": "令諸眾生出生清淨增上善根，住大功德，具一切智。",
        "translation": "It causes sentient beings to produce pure, superior good roots that abide in great virtue and possess omniscience.",
        "source": "T10n0279_028:0151a16_69"
    },
    {
        "source_sentence": "又以此善根，令一切眾生常得供養一切諸佛，解一切法，受持讀誦不忘、不失、不壞、不散，",
        "translation": "Through these roots of goodness all sentient beings will always be able to make offerings to all buddhas. Understanding all truths, they retain and recite them without forgetting, without losing, without destroying, and without dispersing.",
        "source": "T10n0279_028:0151a17_70"
    },
    {
        "source_sentence": "心善調伏，不調令調，以寂靜法而調習之。",
        "translation": "Their minds are well disciplined, but they aren't disciplined or made to be disciplined, and they tame them with the method of quiescence.",
        "source": "T10n0279_028:0151a19_71"
    },
    {
        "source_sentence": "令彼眾生於諸佛所住如是事。",
        "translation": "It causes those sentient beings to abide in the buddhas like this.",
        "source": "T10n0279_028:0151a20_72"
    },
    {
        "source_sentence": "又以此善根，令一切眾生作第一塔，應受世間種種供養；",
        "translation": "Because of these roots of goodness they cause all sentient beings to make the first stūpa, which should receive various offerings in the world.",
        "source": "T10n0279_028:0151a21_73"
    },
    {
        "source_sentence": "令一切眾生成最上福田，得佛智慧，開悟一切；",
        "translation": "Causing all sentient beings to become the supreme field of blessings, they attain buddhahood and wisdom and enlighten all.",
        "source": "T10n0279_028:0151a22_74"
    },
    {
        "source_sentence": "令一切眾生作最上受者，普能饒益一切眾生；",
        "translation": "Those who cause all sentient beings to become supreme recipients are able to benefit all sentient beings.",
        "source": "T10n0279_028:0151a23_75"
    },
    {
        "source_sentence": "令一切眾生成最上福利，能使具足一切善根；",
        "translation": "Causing all sentient beings to attain the highest welfare, they are able to cause them to be endowed with all roots of goodness.",
        "source": "T10n0279_028:0151a25_0"
    },
    {
        "source_sentence": "令一切眾生成第一好施處，能使獲得無量福報；",
        "translation": "Causing all sentient beings to become the first delightful place of giving, they can cause them to attain immeasurable rewards of virtue.",
        "source": "T10n0279_028:0151a26_1"
    },
    {
        "source_sentence": "令一切眾生於三界中皆得出離；",
        "translation": "They cause all sentient beings to attain liberation in the three realms.",
        "source": "T10n0279_028:0151a27_2"
    },
    {
        "source_sentence": "令一切眾生作第一導師，能為世間示如實道；",
        "translation": "They cause all sentient beings to be the foremost leaders, able to show the world the path as it is.",
        "source": "T10n0279_028:0151a27_3"
    },
    {
        "source_sentence": "令一切眾生得妙總持，具持一切諸佛正法；",
        "translation": "They cause all sentient beings to attain marvelous mastery, holding the true teachings of all buddhas.",
        "source": "T10n0279_028:0151a29_0"
    },
    {
        "source_sentence": "令一切眾生證得無量第一法界，具足虛空無礙正道。』",
        "translation": "It causes all sentient beings to realize the immeasurable first realm of reality, which is endowed with space and unobstructed right path.'",
        "source": "T10n0279_028:0151b01_0"
    },
    {
        "source_sentence": "是為菩薩摩訶薩施自己身善根迴向，為令眾生皆得應供無量智身故。",
        "translation": "This is the bodhisattva-mahāsattva's dedication of the good roots that he gives to his own body in order to cause sentient beings to attain the immeasurable body of knowledge that should be offered to them.",
        "source": "T10n0279_028:0151b02_1"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0151b03_2"
    },
    {
        "source_sentence": "菩薩摩訶薩聞法喜悅，生淨信心，能以其身供養諸佛，欣樂信解無上法寶，",
        "translation": "“Great enlightening beings are joyful when they hear the Teaching and give rise to pure faith; they can offer their bodies to the Buddhas, delighted in believing in the unexcelled treasure of truth.",
        "source": "T10n0279_028:0151b04_0"
    },
    {
        "source_sentence": "於諸佛所生父母想；",
        "translation": "They think of the buddhas as parents.",
        "source": "T10n0279_028:0151b05_1"
    },
    {
        "source_sentence": "讀誦受持無礙道法，普入無數那由他法、大智慧寶、諸善根門；",
        "translation": "They read, recite, receive, and uphold the teaching of the unobstructed path, entering into countless millions of teachings, great jewels of knowledge, and gates of roots of goodness.",
        "source": "T10n0279_028:0151b06_2"
    },
    {
        "source_sentence": "心常憶念無量諸佛，入佛境界，深達義理；",
        "translation": "Their minds always remembering infinite buddhas, they enter the sphere of buddhahood and deeply comprehend meaning and principle.",
        "source": "T10n0279_028:0151b07_3"
    },
    {
        "source_sentence": "能以如來微密梵音，興佛法雲，雨佛法雨，勇猛自在；",
        "translation": "They can, by means of the subtle and mysterious spiritual voice of Buddha, produce clouds of buddha-teachings; showering the rain of enlightening beings’ teachings, they are unimpeded in their courage.",
        "source": "T10n0279_028:0151b08_4"
    },
    {
        "source_sentence": "能分別說一切智人第一之地，具足成就薩婆若乘，以無量百千億那由他大法成滿諸根。",
        "translation": "They can discern and explain the first ground of all wise people, fully accomplish the sarvajña vehicle, and fulfill their faculties with measureless hundreds of thousands of millions of billions of nayutas of great dharmas.",
        "source": "T10n0279_028:0151b09_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0151b11_6"
    },
    {
        "source_sentence": "菩薩摩訶薩於諸佛所聞如是法，歡喜無量，安住正法；",
        "translation": "“When great enlightening beings hear such teaching from buddhas, their joy is immeasurable and they abide in the true teaching.",
        "source": "T10n0279_028:0151b11_7"
    },
    {
        "source_sentence": "自斷疑惑，亦令他斷；",
        "translation": "They themselves eliminate doubt and confusion, and also cause others to eliminate it.",
        "source": "T10n0279_028:0151b13_8"
    },
    {
        "source_sentence": "心恒怡暢，功德成滿；",
        "translation": "Their minds are always blissful, their virtues perfected.",
        "source": "T10n0279_028:0151b13_9"
    },
    {
        "source_sentence": "善根具足，意恒相續；",
        "translation": "They are endowed with roots of goodness, and their minds are always continuous.",
        "source": "T10n0279_028:0151b14_10"
    },
    {
        "source_sentence": "利益眾生，心常不匱；",
        "translation": "Beneficent sentient beings their minds are always not lacking.",
        "source": "T10n0279_028:0151b14_11"
    },
    {
        "source_sentence": "獲最勝智，成金剛藏；",
        "translation": "They attain supreme knowledge and become diamond mines.",
        "source": "T10n0279_028:0151b15_12"
    },
    {
        "source_sentence": "親近諸佛，淨諸佛剎，常勤供養一切如來。",
        "translation": "They become intimate with the Buddhas, purify their buddha-lands, and always diligently support all enlightened ones.",
        "source": "T10n0279_028:0151b15_13"
    },
    {
        "source_sentence": "菩薩爾時，以諸善根如是迴向，所謂：『願一切眾生皆得圓滿最勝之身，",
        "translation": "“At that time the enlightening beings dedicate their roots of goodness in this way:",
        "source": "T10n0279_028:0151b16_14"
    },
    {
        "source_sentence": "一切諸佛之所攝受；",
        "translation": "They are embraced by all buddhas.",
        "source": "T10n0279_028:0151b18_15"
    },
    {
        "source_sentence": "願一切眾生常近諸佛，依諸佛住，恒得覲仰，未曾遠離；",
        "translation": "May all sentient beings always associate with the Buddhas, relying on the abode of buddhas, always seeing and honoring them, never leaving them.",
        "source": "T10n0279_028:0151b18_16"
    },
    {
        "source_sentence": "願一切眾生皆得清淨不壞之身，具足一切功德智慧；",
        "translation": "May all sentient beings attain a pure, indestructible body endowed with all virtues and knowledge.",
        "source": "T10n0279_028:0151b19_17"
    },
    {
        "source_sentence": "願一切眾生常勤供養一切諸佛，行無所得究竟梵行；",
        "translation": "May all sentient beings always diligently honor and serve all buddhas, carrying out the ungraspable ultimate religious practice.",
        "source": "T10n0279_028:0151b21_18"
    },
    {
        "source_sentence": "願一切眾生得無我身，離我、我所；",
        "translation": "May all sentient beings attain a selfless body, detached from self and possessions.",
        "source": "T10n0279_028:0151b22_19"
    },
    {
        "source_sentence": "願一切眾生悉能分身遍十方剎，猶如影現而無來往；",
        "translation": "May all sentient beings be able to distribute their bodies and pervade the lands of the ten directions, just as a reflection appears without coming or going.",
        "source": "T10n0279_028:0151b23_20"
    },
    {
        "source_sentence": "願一切眾生得自在身，普往十方無我無受；",
        "translation": "May all sentient beings attain unimpeded body, traveling everywhere in the ten directions without self or sensation.",
        "source": "T10n0279_028:0151b24_21"
    },
    {
        "source_sentence": "願一切眾生從佛身生，處在如來無上身家；",
        "translation": "May all sentient beings be born of buddha-bodies, dwelling in the house of the supreme body of enlightened ones.",
        "source": "T10n0279_028:0151b25_22"
    },
    {
        "source_sentence": "願一切眾生得法力身，忍辱大力無能壞者；",
        "translation": "May all sentient beings attain the body of power of truth, with great forbearance and strength that cannot be broken.",
        "source": "T10n0279_028:0151b26_23"
    },
    {
        "source_sentence": "願一切眾生得無比身，成就如來清淨法身；",
        "translation": "May all sentient beings attain peerless bodies and develop the pure reality body of buddhas.",
        "source": "T10n0279_028:0151b27_24"
    },
    {
        "source_sentence": "願一切眾生成就出世功德之身，生無所得清淨法界。』",
        "translation": "May all sentient beings achieve the body of supramundane merit and be born in the pure Dharma realm of ungraspable purity.'",
        "source": "T10n0279_028:0151b28_25"
    },
    {
        "source_sentence": "是為菩薩摩訶薩以身供佛善根迴向，為令眾生永住三世諸佛家故。",
        "translation": "This is the bodhisattva Mahāsattva's dedication of body as an offering to the Buddha's good roots in order to cause sentient beings to permanently live in the homes of the buddhas of the three times.",
        "source": "T10n0279_028:0151b29_26"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0151c02_27"
    },
    {
        "source_sentence": "菩薩摩訶薩以身布施一切眾生，為欲普令成就善根，憶念善根，菩薩摩訶薩自願其身為大明燈，",
        "translation": "“Great enlightening beings give their bodies to all sentient beings, wanting to cause them to develop the roots of goodness everywhere, remembering the roots of goodness.",
        "source": "T10n0279_028:0151c02_28"
    },
    {
        "source_sentence": "普能照耀一切眾生；",
        "translation": "He was able to illumine all sentient beings everywhere.",
        "source": "T10n0279_028:0151c04_29"
    },
    {
        "source_sentence": "為眾樂具，普能攝受一切眾生；",
        "translation": "They are the implements of all pleasures, able to receive and care for all sentient beings.",
        "source": "T10n0279_028:0151c05_30"
    },
    {
        "source_sentence": "為妙法藏，普能任持一切眾生；",
        "translation": "They are treasuries of the wondrous Teaching, able to sustain all sentient beings.",
        "source": "T10n0279_028:0151c05_31"
    },
    {
        "source_sentence": "為淨光明，普能開曉一切眾生；",
        "translation": "For the sake of pure light they can illumine all sentient beings.",
        "source": "T10n0279_028:0151c06_32"
    },
    {
        "source_sentence": "為世光影，普令眾生常得覩見；",
        "translation": "They are the reflection of worldly light, causing all sentient beings to always attain compassionate vision.",
        "source": "T10n0279_028:0151c07_33"
    },
    {
        "source_sentence": "為善根因緣，普令眾生常得值遇；",
        "translation": "They are the causes and conditions for the roots of goodness, causing all sentient beings to always be able to encounter them.",
        "source": "T10n0279_028:0151c08_34"
    },
    {
        "source_sentence": "為真善知識，令一切眾生悉蒙教誘；",
        "translation": "They become true teachers, enabling all sentient beings to be led and inspired.",
        "source": "T10n0279_028:0151c08_35"
    },
    {
        "source_sentence": "為平坦道，令一切眾生皆得履踐；",
        "translation": "It is the path of ease, causing all sentient beings to be able to tread upon it.",
        "source": "T10n0279_028:0151c09_36"
    },
    {
        "source_sentence": "為無有上具足安樂，令一切眾生離苦清淨；",
        "translation": "In order to attain the unsurpassed excellence of well-being, they cause all sentient beings to be freed from suffering and become pure.",
        "source": "T10n0279_028:0151c10_37"
    },
    {
        "source_sentence": "為明淨日，普作世間平等利益。",
        "translation": "In order to clarify the day of purity, they universally work for the equal benefit of the world.",
        "source": "T10n0279_028:0151c11_38"
    },
    {
        "source_sentence": "菩薩爾時，以諸善根如是迴向，所謂：『願一切眾生常親近佛，入佛智地；",
        "translation": "At that time the enlightening beings dedicate their roots of goodness in this way:",
        "source": "T10n0279_028:0151c12_39"
    },
    {
        "source_sentence": "願一切眾生得隨順智，住無上覺；",
        "translation": "May all sentient beings attain compliant knowledge and abide in unexcelled awakening.",
        "source": "T10n0279_028:0151c13_40"
    },
    {
        "source_sentence": "願一切眾生常處佛會，意善調伏；",
        "translation": "May all sentient beings always be in the assembly of buddhas, their minds well disciplined.",
        "source": "T10n0279_028:0151c14_41"
    },
    {
        "source_sentence": "願一切眾生所行有則，具佛威儀；",
        "translation": "May all sentient beings be disciplined, endowed with the comportment of buddhahood.",
        "source": "T10n0279_028:0151c15_42"
    },
    {
        "source_sentence": "願一切眾生悉得涅槃，深解法義；",
        "translation": "May all sentient beings attain nirvana and deeply understand the meaning of the teaching.",
        "source": "T10n0279_028:0151c16_0"
    },
    {
        "source_sentence": "願一切眾生具知足行，生如來家；",
        "translation": "May all sentient beings be born in the house of buddhahood endowed with fulfillment of knowledge and practice.",
        "source": "T10n0279_028:0151c16_1"
    },
    {
        "source_sentence": "願一切眾生捨無明欲，住佛志樂；",
        "translation": "May all sentient beings give up the desire for ignorance and abide in the aspiration of buddhahood.",
        "source": "T10n0279_028:0151c17_2"
    },
    {
        "source_sentence": "願一切眾生生勝善根，坐菩提樹；",
        "translation": "May all sentient beings give rise to supreme roots of goodness and sit at the tree of enlightenment.",
        "source": "T10n0279_028:0151c18_3"
    },
    {
        "source_sentence": "願一切眾生殺煩惱賊，離怨害心；",
        "translation": "May all sentient beings kill the thieves of afflictions, getting rid of hostile thoughts.",
        "source": "T10n0279_028:0151c19_4"
    },
    {
        "source_sentence": "願一切眾生具足護持一切佛法。』",
        "translation": "May all sentient beings be fully protected by all the Buddha's teachings.'",
        "source": "T10n0279_028:0151c19_5"
    },
    {
        "source_sentence": "是為菩薩摩訶薩以身布施一切眾生善根迴向；",
        "translation": "“This is great enlightening beings’ dedication of body giving all sentient beings roots of goodness.",
        "source": "T10n0279_028:0151c20_6"
    },
    {
        "source_sentence": "為欲利益一切眾生，令得無上安隱處故。",
        "translation": "It's because they want to benefit all sentient beings and cause them to attain the unsurpassed peaceful place.",
        "source": "T10n0279_028:0151c21_7"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0151c22_8"
    },
    {
        "source_sentence": "菩薩摩訶薩自以其身給侍諸佛，於諸佛所念報重恩如父母想，於諸如來起深信樂；",
        "translation": "“Great enlightening beings give themselves up their bodies to attend the Buddhas, and in the presence of those buddhas they think of repaying great kindness as parents. They develop profound faith and joy in the Buddhas.",
        "source": "T10n0279_028:0151c22_9"
    },
    {
        "source_sentence": "以清淨心，護佛菩提，住諸佛法；",
        "translation": "With pure minds they preserve the enlightenment of buddhas and abide by the teachings of buddhas.",
        "source": "T10n0279_028:0151c24_10"
    },
    {
        "source_sentence": "離世間想，生如來家；",
        "translation": "Being free of worldly thoughts, they are born in the house of enlightenment.",
        "source": "T10n0279_028:0151c25_11"
    },
    {
        "source_sentence": "隨順諸佛，離魔境界；",
        "translation": "They follow the buddhas and are beyond the realm of demons.",
        "source": "T10n0279_028:0151c26_12"
    },
    {
        "source_sentence": "了達一切諸佛所行，成就一切諸佛法器。",
        "translation": "They comprehend all the practices of all buddhas and perfect the Dharma vessels of all buddhas.",
        "source": "T10n0279_028:0151c26_13"
    },
    {
        "source_sentence": "菩薩爾時，以此善根如是迴向，所謂：『願一切眾生得清淨心，一切智寶而自莊嚴；",
        "translation": "At that time the enlightening beings dedicate these roots of goodness in this way:",
        "source": "T10n0279_028:0151c27_14"
    },
    {
        "source_sentence": "願一切眾生住善調伏，遠離一切諸不善業；",
        "translation": "May all sentient beings abide in good discipline and be far removed from all unwholesome actions.",
        "source": "T10n0279_028:0151c29_15"
    },
    {
        "source_sentence": "願一切眾生得不可壞堅固眷屬，普能攝受諸佛正法；",
        "translation": "May all sentient beings attain unbreakable, steadfast retinues, able to embrace the true teaching of buddhas.",
        "source": "T10n0279_028:0152a01_16"
    },
    {
        "source_sentence": "願一切眾生為佛弟子，到於菩薩灌頂之地；",
        "translation": "May all sentient beings become disciples of Buddha and arrive at the enlightening being’s coronation site.",
        "source": "T10n0279_028:0152a02_17"
    },
    {
        "source_sentence": "願一切眾生常為諸佛之所攝受，永離一切不善之法；",
        "translation": "May all sentient beings always be encompassed by the Buddhas, forever leaving behind all unwholesome states.",
        "source": "T10n0279_028:0152a03_18"
    },
    {
        "source_sentence": "願一切眾生隨順諸佛，修行菩薩最勝之法；",
        "translation": "May all sentient beings follow the buddhas and practice the supreme teaching of enlightening beings.",
        "source": "T10n0279_028:0152a04_19"
    },
    {
        "source_sentence": "願一切眾生入佛境界，悉皆得授一切智記；",
        "translation": "May all sentient beings enter the realm of buddhahood and attain assurance of omniscience.",
        "source": "T10n0279_028:0152a05_20"
    },
    {
        "source_sentence": "願一切眾生與諸如來皆悉平等，一切佛法無不自在；",
        "translation": "May all sentient beings and enlightened ones be completely equal, unimpeded in all buddha-teachings.",
        "source": "T10n0279_028:0152a06_21"
    },
    {
        "source_sentence": "願一切眾生悉為諸佛之所攝受，常能修行無取著業；",
        "translation": "May all sentient beings be encompassed by the Buddhas, always able to practice unattached action.",
        "source": "T10n0279_028:0152a08_22"
    },
    {
        "source_sentence": "願一切眾生常為諸佛第一侍者，一切佛所修智慧行。』",
        "translation": "May all sentient beings always be the first attendant of the buddhas, and all the buddhas cultivate the practice of wisdom.'",
        "source": "T10n0279_028:0152a09_23"
    },
    {
        "source_sentence": "是為菩薩摩訶薩給侍諸佛善根迴向；",
        "translation": "“This is great enlightening beings’ dedication of the roots of goodness of attending buddhas.",
        "source": "T10n0279_028:0152a10_24"
    },
    {
        "source_sentence": "為欲證得諸佛菩提，為欲救護一切眾生，為欲出離一切三界，為欲成就無損惱心，",
        "translation": "In order to realize the enlightenment of buddhas, in order to save all sentient beings, in order to leave all worlds, and in order to perfect harmlessness.",
        "source": "T10n0279_028:0152a11_25"
    },
    {
        "source_sentence": "為得無量廣大菩提，為欲成就照佛法智，為欲常蒙諸佛攝受，為得諸佛之所護持，",
        "translation": "In order to attain immeasurable great enlightenment, in order to perfect the buddha-knowledge of illuminating truths, in order to always be received by the Buddhas, and in order to attain the protection of the Buddhas.",
        "source": "T10n0279_028:0152a13_26"
    },
    {
        "source_sentence": "為欲信解一切佛法，為欲成就與三世佛平等善根，為欲圓滿無悔恨心，",
        "translation": "They want to believe in all buddha-teachings; they want to develop roots of goodness equal to the Buddhas of past, present, and future; they want to perfect their minds without regret or resentment.",
        "source": "T10n0279_028:0152a15_27"
    },
    {
        "source_sentence": "證得一切諸佛法故。",
        "translation": "It's because they've realized all the buddha-teachings.",
        "source": "T10n0279_028:0152a16_28"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0152a17_29"
    },
    {
        "source_sentence": "菩薩摩訶薩布施國土一切諸物，乃至王位悉亦能捨；",
        "translation": "“Great enlightening beings can give away all the things of their lands, up to kingship.",
        "source": "T10n0279_028:0152a17_30"
    },
    {
        "source_sentence": "於諸世事，心得自在，無繫、無縛、無所戀著；",
        "translation": "Their minds are free from attachment to worldly affairs, unfettered, unbound, and not attached to anything.",
        "source": "T10n0279_028:0152a18_31"
    },
    {
        "source_sentence": "遠離惡業，饒益眾生；",
        "translation": "Being far removed from evil deeds, they benefit sentient beings.",
        "source": "T10n0279_028:0152a19_32"
    },
    {
        "source_sentence": "不著業果，不樂世法，不復貪染諸有生處；",
        "translation": "They are not attached to the results of action, do not delight in worldly phenomena, and no longer cling to the realms of existence.",
        "source": "T10n0279_028:0152a20_33"
    },
    {
        "source_sentence": "雖住世間，非此處生；",
        "translation": "Even though they live in the world, they are not born there.",
        "source": "T10n0279_028:0152a21_34"
    },
    {
        "source_sentence": "心不執著蘊、界、處法，於內外法心無依住；",
        "translation": "Their minds do not cling to the dharmas of the aggregates, elements, or sense bases. They have no support for internal or external mental states.",
        "source": "T10n0279_028:0152a21_35"
    },
    {
        "source_sentence": "常不忘失諸菩薩行，未曾遠離諸善知識；",
        "translation": "They always do not forget the practices of enlightening beings, never leaving behind spiritual benefactors.",
        "source": "T10n0279_028:0152a22_36"
    },
    {
        "source_sentence": "持諸菩薩廣大行願，常樂承事一切善友。",
        "translation": "They maintain the vast practical vows of enlightening beings and always gladly serve all good companions.",
        "source": "T10n0279_028:0152a23_37"
    },
    {
        "source_sentence": "菩薩爾時，以此善根如是迴向，所謂：『願一切眾生為大法王，於法自在，",
        "translation": "“At that time the enlightening beings dedicate these roots of goodness in this way:",
        "source": "T10n0279_028:0152a24_38"
    },
    {
        "source_sentence": "到於彼岸；",
        "translation": "“Great enlightening beings attain the other shore.",
        "source": "T10n0279_028:0152a25_39"
    },
    {
        "source_sentence": "願一切眾生成佛法王，摧滅一切煩惱怨賊；",
        "translation": "May all sentient beings become buddhas and kings of truth, destroying all afflictions and enemies.",
        "source": "T10n0279_028:0152a26_40"
    },
    {
        "source_sentence": "願一切眾生住佛王位，得如來智，開演佛法；",
        "translation": "May all sentient beings abide in the throne of buddha-kingship, attain enlightened knowledge and expound Buddha teachings.",
        "source": "T10n0279_028:0152a27_41"
    },
    {
        "source_sentence": "願一切眾生住佛境界，能轉無上自在法輪；",
        "translation": "May all sentient beings who abide in the realm of buddhahood be able to turn the wheel of teaching of unexcelled freedom.",
        "source": "T10n0279_028:0152a28_42"
    },
    {
        "source_sentence": "願一切眾生生如來家，於法自在，護持佛種，永使不絕；",
        "translation": "May all sentient beings be born in the house of enlightenment, having mastery over the Teaching and preserving the lineage of buddhahood unceasingly.",
        "source": "T10n0279_028:0152a29_43"
    },
    {
        "source_sentence": "願一切眾生開示無量法王正法，成就無邊諸大菩薩；",
        "translation": "May all sentient beings reveal the true teaching of the infinite king of truth, perfecting boundless great enlightening beings.",
        "source": "T10n0279_028:0152b01_44"
    },
    {
        "source_sentence": "願一切眾生住淨法界，為大法王，現佛出興，相繼不斷；",
        "translation": "May all sentient beings abide in the pure realm of reality, be great kings of truth, manifesting buddhas and emanating enlightenment, never ceasing one after another.",
        "source": "T10n0279_028:0152b02_45"
    },
    {
        "source_sentence": "願一切眾生於諸世界作智慧王，化導群生無時暫捨；",
        "translation": "May all sentient beings become kings of knowledge in all worlds, guiding and inspiring sentient beings without ever leaving them.",
        "source": "T10n0279_028:0152b03_46"
    },
    {
        "source_sentence": "願一切眾生普為法界、虛空界等諸世界中一切眾生作法施主，使其咸得住於大乘；",
        "translation": "May all sentient beings be donors of the Teaching to all sentient beings in all worlds, throughout the cosmos, space, and so on, enabling them to abide in the Great Vehicle.",
        "source": "T10n0279_028:0152b05_47"
    },
    {
        "source_sentence": "願一切眾生得成具足眾善之王，與三世佛善根齊等。』",
        "translation": "May all sentient beings attain the full accomplishment of the king of goodness, which is equal to the good roots of the buddhas of the three times.'",
        "source": "T10n0279_028:0152b07_48"
    },
    {
        "source_sentence": "是為菩薩摩訶薩布施王位善根迴向；",
        "translation": "“This is great enlightening beings’ dedication of roots of goodness at the royal throne of giving.",
        "source": "T10n0279_028:0152b08_49"
    },
    {
        "source_sentence": "為欲令彼一切眾生，究竟住於安隱處故。",
        "translation": "It's because they want to cause all those sentient beings to ultimately abide in a peaceful place.",
        "source": "T10n0279_028:0152b09_50"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0152b10_51"
    },
    {
        "source_sentence": "菩薩摩訶薩見有人來乞王京都、嚴麗大城及以關防所有輸稅，盡皆施與，",
        "translation": "“When great enlightening beings see people come to the king’s capital and ask him to give them all the customs duties of the royal palace, the great city of Avalokiteśvara, as well as the customs duties of the frontier.",
        "source": "T10n0279_028:0152b10_52"
    },
    {
        "source_sentence": "心無吝惜；",
        "translation": "Their minds are not stingy or greedy.",
        "source": "T10n0279_028:0152b12_53"
    },
    {
        "source_sentence": "專向菩提發大誓願，住於大慈，行於大悲，志意歡悅，利益眾生；",
        "translation": "They concentrate on enlightenment, make great vows, abide in great benevolence, practice great compassion, and be joyful with determination to benefit sentient beings.",
        "source": "T10n0279_028:0152b12_54"
    },
    {
        "source_sentence": "以廣大智解了深法，安住諸佛平等法性；",
        "translation": "By means of their vast knowledge and understanding of the profound teachings they abide in the equality of all buddhas’ reality-nature.",
        "source": "T10n0279_028:0152b13_55"
    },
    {
        "source_sentence": "發心為求一切智故，於自在法起深樂故，於自在智求證得故，淨修一切諸功德故，",
        "translation": "Because the determination for enlightenment is to seek omniscience, because they give rise to profound delight in self- independent knowledge, because they seek realization of self-dependent knowledge, and because they purely cultivate all virtues.",
        "source": "T10n0279_028:0152b14_56"
    },
    {
        "source_sentence": "住於堅固廣大智故，廣集一切諸善根故，修行一切佛法願故，自然覺悟大智法故，",
        "translation": "Because they abide in firm and vast knowledge, because they widely accumulate all roots of goodness, because they practice all the vows of buddha-teachings, because they naturally awaken to the principles of great knowledge.",
        "source": "T10n0279_028:0152b16_57"
    },
    {
        "source_sentence": "安住菩提心無退故，修習一切菩薩行願、一切種智盡究竟故，而行布施。",
        "translation": "Because they abide in the mind of enlightenment without regressing, cultivate all the bodhisattva practices and vows and all kinds of cognition to their end, they practice generosity.",
        "source": "T10n0279_028:0152b18_58"
    },
    {
        "source_sentence": "以此善根如是迴向，所謂：『願一切眾生悉能嚴淨無量剎土，奉施諸佛以為住處；",
        "translation": "They dedicate these roots of goodness in this way:",
        "source": "T10n0279_028:0152b20_59"
    },
    {
        "source_sentence": "願一切眾生常樂居止阿蘭若處，寂靜不動；",
        "translation": "May all sentient beings always delight in dwelling in the abode of a forest, quiescent and unmoving.",
        "source": "T10n0279_028:0152b22_60"
    },
    {
        "source_sentence": "願一切眾生永不依止王都聚落，心樂寂靜，永得究竟；",
        "translation": "May all sentient beings never rely on kingdoms, cities, or villages; their minds and pleasures be tranquil and peaceful, always attaining the ultimate.",
        "source": "T10n0279_028:0152b23_61"
    },
    {
        "source_sentence": "願一切眾生永不樂著一切世間，於世語言常樂遠離；",
        "translation": "May all sentient beings never be attached to any world, always delighted in seclusion from worldly speech.",
        "source": "T10n0279_028:0152b24_62"
    },
    {
        "source_sentence": "願一切眾生得離貪心，施諸所有，心無中悔；",
        "translation": "May all sentient beings attain freedom from craving and give whatever they have, without regret in their minds.",
        "source": "T10n0279_028:0152b25_63"
    },
    {
        "source_sentence": "願一切眾生得出離心，捨諸家業；",
        "translation": "May all sentient beings be liberated from their minds and give up household activities.",
        "source": "T10n0279_028:0152b26_64"
    },
    {
        "source_sentence": "願一切眾生得無吝心，常行惠施；",
        "translation": "May all sentient beings attain unremitting kindness and always practice giving.",
        "source": "T10n0279_028:0152b27_65"
    },
    {
        "source_sentence": "願一切眾生得不著心，離居家法；",
        "translation": "May all sentient beings attain unattached minds and be free from the ways of the householders.",
        "source": "T10n0279_028:0152b28_66"
    },
    {
        "source_sentence": "願一切眾生得離眾苦，除滅一切災橫怖畏；",
        "translation": "May all sentient beings be freed from all suffering, getting rid of all dangers and fears.",
        "source": "T10n0279_028:0152b29_0"
    },
    {
        "source_sentence": "願一切眾生嚴淨十方一切世界，奉施諸佛。』",
        "translation": "May all sentient beings adorn and purify all the worlds in the ten directions and give them to the buddhas.'",
        "source": "T10n0279_028:0152c01_1"
    },
    {
        "source_sentence": "是為菩薩摩訶薩布施王都善根迴向，為令眾生悉能嚴淨諸佛剎故。",
        "translation": "This is the dedication of the good roots of the bodhisattva-mahāsattva's generosity to the kingdom of buddhas, so that sentient beings will be able to adorn and purify the buddha bases.",
        "source": "T10n0279_028:0152c02_2"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0152c03_3"
    },
    {
        "source_sentence": "菩薩摩訶薩所有一切內宮眷屬、妓侍眾女，皆顏貌端正、才能具足，談笑歌舞悉皆巧妙，",
        "translation": "“All the enlightening beings’ inner palaces, their retinues, their courtesans, and their maidservants were all handsome and talented, skilled in conversation, laughter, singing, and dancing.",
        "source": "T10n0279_028:0152c03_4"
    },
    {
        "source_sentence": "種種衣服、種種華香而以嚴身，見者歡喜，情無厭足。",
        "translation": "Various kinds of clothing and various kinds of flowers and fragrances adorned their bodies, and those who saw them rejoiced, feeling no weariness.",
        "source": "T10n0279_028:0152c05_5"
    },
    {
        "source_sentence": "如是寶女百千萬億那由他數，皆由菩薩善業所生，隨意自在，敬順無失；",
        "translation": "In this way, hundreds of thousands of myriads of koṭis of nayutas of such jeweled maidens were all born from the good deeds of enlightening beings, free to do as they wish.",
        "source": "T10n0279_028:0152c07_6"
    },
    {
        "source_sentence": "盡以布施諸來乞者，而於其中無愛樂心、無顧戀心、無耽著心、無繫縛心、無執取心、無貪染心、無分別心、無隨逐心、無取相心、無樂欲心。",
        "translation": "They give all of them to those who come to ask, without craving or pleasure, without concern or attachment, without attachment, without fetters, without clinging, without craving or defilement, without discrimination, without following, without grasping characteristics, and without happiness or desire.",
        "source": "T10n0279_028:0152c08_7"
    },
    {
        "source_sentence": "菩薩爾時，觀諸善根，為欲令一切眾生咸得出離故迴向，得佛法喜故迴向，",
        "translation": "“At that time the enlightening beings contemplate the roots of goodness, dedicating them in order to cause all sentient beings to attain liberation, and they attain joy in the buddha-teachings.",
        "source": "T10n0279_028:0152c11_8"
    },
    {
        "source_sentence": "於不堅固中而得堅固故迴向，得金剛智不可壞心故迴向，入佛道場故迴向，",
        "translation": "They dedicate their roots of enlightenment because they attain firmness in the midst of not being firm; they dedicate their roots of enlightenment because they attain indestructible minds with adamantine knowledge; they dedicate their roots of enlightenment because they enter the Buddha’s sphere of enlightenment.",
        "source": "T10n0279_028:0152c13_9"
    },
    {
        "source_sentence": "到於彼岸故迴向，得無上菩提心故迴向，能以智慧了達諸法故迴向，出生一切善根故迴向，",
        "translation": "dedication because of reaching the other shore; dedication because of attaining the supreme determination for enlightenment; dedication because of being able to understand all things by means of knowledge; dedication because of producing all roots of goodness.",
        "source": "T10n0279_028:0152c15_10"
    },
    {
        "source_sentence": "入三世諸佛家故迴向。",
        "translation": "He enters the home of the buddhas of the three times and therefore dedicates his merit back to them.",
        "source": "T10n0279_028:0152c17_11"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0152c18_0"
    },
    {
        "source_sentence": "菩薩摩訶薩住如是法，生如來家；",
        "translation": "“When great enlightening beings abide in these things, they are born in the house of buddhahood.",
        "source": "T10n0279_028:0152c18_1"
    },
    {
        "source_sentence": "增長諸佛清淨勝因，出生最勝一切智道；",
        "translation": "They develop the pure and excellent causes of buddhas, producing the supreme path of omniscience.",
        "source": "T10n0279_028:0152c18_2"
    },
    {
        "source_sentence": "深入菩薩廣大智業，滅除一切世間垢惱，常能供施功德福田；",
        "translation": "Deeply entered into the vast knowledge and action of enlightening beings, they annihilate all worldly defilements. They are always able to provide offerings of virtue and field of blessings.",
        "source": "T10n0279_028:0152c19_3"
    },
    {
        "source_sentence": "為諸眾生宣說妙法，善巧安立，令其修習諸清淨行，常勤攝取一切善根。",
        "translation": "He teaches the wonderful Dharma to sentient beings, skillfully establishes it, causes them to cultivate pure practices, and always diligently collects all good roots.",
        "source": "T10n0279_028:0152c21_4"
    },
    {
        "source_sentence": "菩薩爾時，以諸善根如是迴向，所謂：『願一切眾生常得無量三昧眷屬，",
        "translation": "At that time the enlightening beings dedicate their roots of goodness in this way:",
        "source": "T10n0279_028:0152c22_5"
    },
    {
        "source_sentence": "菩薩勝定相續不斷；",
        "translation": "Enlightening beings’ superior concentration is continuous and unceasing.",
        "source": "T10n0279_028:0152c24_6"
    },
    {
        "source_sentence": "願一切眾生常樂見佛，悉入諸佛莊嚴三昧；",
        "translation": "May all sentient beings always delight in seeing buddhas and enter the concentration of adornment of all buddhas.",
        "source": "T10n0279_028:0152c24_7"
    },
    {
        "source_sentence": "願一切眾生成就菩薩不思議定，自在遊戲無量神通；",
        "translation": "May all sentient beings attain the inconceivable concentration of enlightening beings, playing freely with infinite spiritual powers.",
        "source": "T10n0279_028:0152c25_8"
    },
    {
        "source_sentence": "願一切眾生入如實定，得不壞心；",
        "translation": "May all sentient beings enter true concentration and attain indestructible minds.",
        "source": "T10n0279_028:0152c27_9"
    },
    {
        "source_sentence": "願一切眾生盡獲菩薩甚深三昧，於諸禪定而得自在；",
        "translation": "May all sentient beings attain the profound concentration of enlightening beings and attain freedom in their meditations.",
        "source": "T10n0279_028:0152c27_10"
    },
    {
        "source_sentence": "願一切眾生得解脫心，成就一切三昧眷屬；",
        "translation": "May all sentient beings attain the mind of liberation, perfecting all the associates of concentration.",
        "source": "T10n0279_028:0152c29_11"
    },
    {
        "source_sentence": "願一切眾生種種三昧皆得善巧，悉能攝取諸三昧相；",
        "translation": "May all sentient beings attain skill in various concentrations and be able to embrace the characteristics of those concentrations.",
        "source": "T10n0279_028:0153a01_12"
    },
    {
        "source_sentence": "願一切眾生得勝智三昧，普能學習諸三昧門；",
        "translation": "May all sentient beings attain the concentration of supreme knowledge and be able to universally study the doors of concentration.",
        "source": "T10n0279_028:0153a02_13"
    },
    {
        "source_sentence": "願一切眾生得無礙三昧，入深禪定終不退失；",
        "translation": "May all sentient beings attain unobstructed concentration and enter deep meditation without ever retreating.",
        "source": "T10n0279_028:0153a03_14"
    },
    {
        "source_sentence": "願一切眾生得無著三昧，心恒正受，不取二法。』",
        "translation": "May all sentient beings attain the samādhi of nonattachment, always receive it correctly in their minds, and don't grasp two things.'",
        "source": "T10n0279_028:0153a04_15"
    },
    {
        "source_sentence": "是為菩薩摩訶薩布施一切內宮眷屬時善根迴向；",
        "translation": "“This is great enlightening beings’ dedication of roots of goodness when giving to all the inward palace attendants.",
        "source": "T10n0279_028:0153a05_16"
    },
    {
        "source_sentence": "為欲令一切眾生皆得不壞清淨眷屬故；",
        "translation": "They want to cause all sentient beings to attain unshakably pure retinues.",
        "source": "T10n0279_028:0153a06_17"
    },
    {
        "source_sentence": "為欲令一切眾生皆得菩薩眷屬故；",
        "translation": "They want to cause all sentient beings to attain the associates of enlightening beings.",
        "source": "T10n0279_028:0153a07_18"
    },
    {
        "source_sentence": "為欲令一切眾生悉得滿足佛法故；",
        "translation": "They want to cause all sentient beings to attain the fulfillment of buddhahood.",
        "source": "T10n0279_028:0153a08_19"
    },
    {
        "source_sentence": "為欲令一切眾生滿足一切智力故；",
        "translation": "They want to cause all sentient beings to fulfill the power of omniscience.",
        "source": "T10n0279_028:0153a09_20"
    },
    {
        "source_sentence": "為欲令一切眾生證於無上智慧故；",
        "translation": "They want to cause all sentient beings to realize the supreme knowledge.",
        "source": "T10n0279_028:0153a10_21"
    },
    {
        "source_sentence": "為欲令一切眾生得於隨順眷屬故；",
        "translation": "They want to cause all sentient beings to attain their followers.",
        "source": "T10n0279_028:0153a11_22"
    },
    {
        "source_sentence": "為欲令一切眾生得同志行人共居故；",
        "translation": "They want to cause all sentient beings to attain companionship, so that they may live together.",
        "source": "T10n0279_028:0153a11_23"
    },
    {
        "source_sentence": "為欲令一切眾生具足一切福智故；",
        "translation": "It is to cause all sentient beings to be endowed with all virtues and knowledge.",
        "source": "T10n0279_028:0153a12_24"
    },
    {
        "source_sentence": "為欲令一切眾生成就清淨善根故；",
        "translation": "They want to cause all sentient beings to develop pure roots of goodness.",
        "source": "T10n0279_028:0153a13_25"
    },
    {
        "source_sentence": "為欲令一切眾生得善和眷屬故；",
        "translation": "They want to cause all sentient beings to attain good harmony with their dependents.",
        "source": "T10n0279_028:0153a14_26"
    },
    {
        "source_sentence": "為欲令一切眾生成就如來清淨法身故；",
        "translation": "They want to cause all sentient beings to develop the pure Dharma body of buddhas.",
        "source": "T10n0279_028:0153a15_27"
    },
    {
        "source_sentence": "為欲令一切眾生成就次第如理辯才，善說諸佛無盡法藏故；",
        "translation": "In order to cause all sentient beings to develop the power of sequential and correct elucidation, they skillfully explain the inexhaustible treasury of truth of buddhas.",
        "source": "T10n0279_028:0153a16_28"
    },
    {
        "source_sentence": "為欲令一切眾生永捨一切世俗善根，同修出世清淨善根故；",
        "translation": "They want to cause all sentient beings to forever abandon all mundane roots of goodness, because they cultivate the same supramundane pure root of goodness.",
        "source": "T10n0279_028:0153a17_29"
    },
    {
        "source_sentence": "為欲令一切眾生淨業圓滿，成就一切清淨法故；",
        "translation": "They want to cause all sentient beings to fulfill pure deeds, perfecting all pure qualities.",
        "source": "T10n0279_028:0153a18_30"
    },
    {
        "source_sentence": "為欲令一切眾生一切佛法皆悉現前，以法光明普嚴淨故。",
        "translation": "It's to cause all sentient beings to fully manifest all the Buddha's teachings because the light of the teaching universally adorns and purifies them.",
        "source": "T10n0279_028:0153a20_31"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0153a21_32"
    },
    {
        "source_sentence": "菩薩摩訶薩能以所愛妻子布施，猶如往昔須達拏太子、現莊嚴王菩薩，",
        "translation": "“Great enlightening beings can give away their beloved spouses and children as if they had given them to Prince Sudarśana, the presently adorned king of enlightening beings, in the past.",
        "source": "T10n0279_028:0153a21_33"
    },
    {
        "source_sentence": "及餘無量諸菩薩等。",
        "translation": "and the other immeasurable bodhisattvas.",
        "source": "T10n0279_028:0153a23_34"
    },
    {
        "source_sentence": "菩薩爾時，乘薩婆若心，行一切施，淨修菩薩布施之道。",
        "translation": "At the time, the bodhisattva practiced all kinds of generosity with the mind of sarvajña and purely cultivated the bodhisattva's path of giving.",
        "source": "T10n0279_028:0153a23_35"
    },
    {
        "source_sentence": "其心清淨，無有中悔，罄捨所珍，求一切智；",
        "translation": "Their minds are pure, without any middling regret. They abandon all their treasures and seek omniscience.",
        "source": "T10n0279_028:0153a24_36"
    },
    {
        "source_sentence": "令諸眾生淨深志樂，成菩提行，觀菩薩道，念佛菩提，住佛種性。",
        "translation": "He causes sentient beings to purify their profound aspirations, accomplish the practice of enlightenment, observe the path of enlightening beings, remember Buddha’s enlightenment, and abide in the buddha-nature.",
        "source": "T10n0279_028:0153a25_37"
    },
    {
        "source_sentence": "菩薩摩訶薩成辦如是布施心已，決定志求如來之身；",
        "translation": "“When great enlightening beings have accomplished this kind of giving, they are determined to seek the body of buddhahood.",
        "source": "T10n0279_028:0153a27_38"
    },
    {
        "source_sentence": "自觀己身，繼屬一切，不得自在；",
        "translation": "They observe for themselves that they belong to all and do not attain mastery.",
        "source": "T10n0279_028:0153a28_39"
    },
    {
        "source_sentence": "又以其身普攝眾生，猶如寶洲給施一切，未滿足者令其滿足。",
        "translation": "He also takes care of all sentient beings with his body like a jeweled continent and bestows it on all, satisfying those who aren't satisfied.",
        "source": "T10n0279_028:0153a29_40"
    },
    {
        "source_sentence": "菩薩如是護念眾生，欲令自身作第一塔，普使一切皆生歡喜；",
        "translation": "Thus protecting sentient beings, enlightening beings want to cause themselves to be the first tower, wanting to cause all to become joyous.",
        "source": "T10n0279_028:0153b01_41"
    },
    {
        "source_sentence": "欲於世間生平等心；",
        "translation": "They want to give rise to equanimity in the world.",
        "source": "T10n0279_028:0153b03_42"
    },
    {
        "source_sentence": "欲為眾生作清涼池；",
        "translation": "They want to be ponds of peace and comfort for sentient beings.",
        "source": "T10n0279_028:0153b03_43"
    },
    {
        "source_sentence": "欲與眾生一切安樂；",
        "translation": "They want to give all peace and happiness to sentient beings.",
        "source": "T10n0279_028:0153b04_44"
    },
    {
        "source_sentence": "欲為眾生作大施主；",
        "translation": "They want to be great donors for sentient beings.",
        "source": "T10n0279_028:0153b04_45"
    },
    {
        "source_sentence": "智慧自在，了知菩薩所行之行，而能如是大誓莊嚴；",
        "translation": "Master of knowledge and wisdom, they know the practices carried out by enlightening beings; yet they can thus adorn themselves with great vows.",
        "source": "T10n0279_028:0153b05_46"
    },
    {
        "source_sentence": "趣一切智，願成無上智慧福田；",
        "translation": "Going to omniscience, they wish to become the field of blessings of unexcelled knowledge and wisdom.",
        "source": "T10n0279_028:0153b06_47"
    },
    {
        "source_sentence": "普念眾生，常隨守護，而能成辦自身利益；",
        "translation": "Universally mindful of sentient beings, always following and protecting them, they are able to accomplish their own benefit.",
        "source": "T10n0279_028:0153b07_48"
    },
    {
        "source_sentence": "智慧光明普照於世，常勤憶念菩薩施心，恒樂觀察如來境界。",
        "translation": "The light of knowledge and wisdom illumines all the worlds, always diligently remembering the enlightening being’s mind of giving. They always delight in contemplating the realm of buddhahood.",
        "source": "T10n0279_028:0153b08_49"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0153b09_50"
    },
    {
        "source_sentence": "菩薩摩訶薩以無縛無著解脫心布施妻子所集善根，如是迴向，所謂：『願一切眾生住佛菩提，",
        "translation": "“Great enlightening beings dedicate the roots of goodness accumulated by their wives and children to all sentient beings with an unbound, unattached mind liberated from clinging:",
        "source": "T10n0279_028:0153b09_51"
    },
    {
        "source_sentence": "起變化身，周遍法界轉不退輪；",
        "translation": "He manifested emanation bodies pervading the cosmos, turning the irreversible wheel of enlightenment.",
        "source": "T10n0279_028:0153b12_0"
    },
    {
        "source_sentence": "願一切眾生得無著身，願力周行一切佛剎；",
        "translation": "May all sentient beings attain unattached bodies, and by the power of their vows travel to all buddha-lands.",
        "source": "T10n0279_028:0153b12_1"
    },
    {
        "source_sentence": "願一切眾生捨愛憎心，斷貪恚結；",
        "translation": "May all sentient beings give up their minds of craving and hatred and sever the fetters of greed and anger.",
        "source": "T10n0279_028:0153b13_2"
    },
    {
        "source_sentence": "願一切眾生為諸佛子，隨佛所行；",
        "translation": "May all sentient beings follow the practice of buddhas as offspring of Buddha.",
        "source": "T10n0279_028:0153b14_3"
    },
    {
        "source_sentence": "願一切眾生於諸佛所，生自己心，不可沮壞；",
        "translation": "May all sentient beings give rise to their own minds in the presence of buddhas, unshakable and indestructible.",
        "source": "T10n0279_028:0153b15_4"
    },
    {
        "source_sentence": "願一切眾生常為佛子，從法化生；",
        "translation": "May all sentient beings always be children of Buddha, born from the Teaching.",
        "source": "T10n0279_028:0153b16_5"
    },
    {
        "source_sentence": "願一切眾生得究竟處，成就如來自在智慧；",
        "translation": "May all sentient beings attain the ultimate state and perfect the independent knowledge of buddhas.",
        "source": "T10n0279_028:0153b17_0"
    },
    {
        "source_sentence": "願一切眾生證佛菩提，永離煩惱；",
        "translation": "May all sentient beings realize buddhahood and be forever free from afflictions.",
        "source": "T10n0279_028:0153b18_0"
    },
    {
        "source_sentence": "願一切眾生能具演說佛菩提道，常樂修行無上法施；",
        "translation": "May all sentient beings be able to fully expound the path of enlightenment of buddhas and always delight in practicing unexcelled giving.",
        "source": "T10n0279_028:0153b18_1"
    },
    {
        "source_sentence": "願一切眾生得正定心，不為一切諸緣所壞；",
        "translation": "May all sentient beings attain minds of right concentration and not be broken down by any conditions.",
        "source": "T10n0279_028:0153b20_0"
    },
    {
        "source_sentence": "願一切眾生坐菩提樹，成最正覺，開示無量從法化生諸善男女。』",
        "translation": "May all sentient beings sit at the bodhi tree and become most perfectly enlightened, revealing measureless good men and women who are born from the teaching of the Dharma.'",
        "source": "T10n0279_028:0153b21_0"
    },
    {
        "source_sentence": "是為菩薩摩訶薩布施妻子善根迴向，為令眾生皆悉證得無礙解脫無著智故。",
        "translation": "This is the bodhisattva Mahāsattva's dedication of the good roots of giving to his wife and children in order to cause sentient beings to fully realize unobstructed liberation and unattached cognition.",
        "source": "T10n0279_028:0153b22_1"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0153b24_2"
    },
    {
        "source_sentence": "菩薩摩訶薩莊嚴舍宅及諸資具，隨有乞求，一切施與，行布施法；",
        "translation": "“Great enlightening beings adorn their houses and all their necessities, giving whatever they may ask for, practicing the principle of giving.",
        "source": "T10n0279_028:0153b24_3"
    },
    {
        "source_sentence": "於家無著，遠離一切居家覺觀，厭惡家業、資生之具，不貪不味，心無繫著；",
        "translation": "They have no attachment to home, are far removed from all householders’ senses and perceptions of home; disillusioned with worldly activities and the necessities of daily life, they do not covet or taste them.",
        "source": "T10n0279_028:0153b25_4"
    },
    {
        "source_sentence": "知家易壞，心恒厭捨，都於其中無所愛樂；",
        "translation": "They know the house is easy to disintegrate, and their minds are always disillusioned with it. All have no desire for it.",
        "source": "T10n0279_028:0153b27_5"
    },
    {
        "source_sentence": "但欲出家修菩薩行，以諸佛法而自莊嚴；",
        "translation": "They simply wish to leave home and practice enlightening beings, adorning themselves with the teachings of buddhas.",
        "source": "T10n0279_028:0153b28_6"
    },
    {
        "source_sentence": "一切悉捨，心無中悔，常為諸佛之所讚歎；",
        "translation": "They give up all without regret in their hearts and are always praised by the Buddhas.",
        "source": "T10n0279_028:0153b29_7"
    },
    {
        "source_sentence": "舍宅、財物，隨處所有，悉以惠施，心無戀著；",
        "translation": "Their houses and property, whatever they have, they give with kindness, their minds without attachment.",
        "source": "T10n0279_028:0153c01_8"
    },
    {
        "source_sentence": "見有乞求，心生喜慶。",
        "translation": "When they saw beggars, their hearts were filled with joy.",
        "source": "T10n0279_028:0153c02_9"
    },
    {
        "source_sentence": "菩薩爾時，以此善根如是迴向，所謂：『願一切眾生捨離妻子，成就出家第一之樂；",
        "translation": "At that time the enlightening beings dedicate these roots of goodness in this way:",
        "source": "T10n0279_028:0153c02_10"
    },
    {
        "source_sentence": "願一切眾生解脫家縛，入於非家，諸佛法中修行梵行；",
        "translation": "May all sentient beings be liberated from the bond of home and enter non-house, cultivating religious practice in the ways of buddhas.",
        "source": "T10n0279_028:0153c04_11"
    },
    {
        "source_sentence": "願一切眾生捨離慳垢，樂一切施，心無退轉；",
        "translation": "May all sentient beings be rid of the stain of wickedness and delight in all kinds of giving, their minds never turning back.",
        "source": "T10n0279_028:0153c06_12"
    },
    {
        "source_sentence": "願一切眾生永離家法，少欲知足，無所藏積；",
        "translation": "May all sentient beings be forever detached from the householder’s life, content with few desires and having no accumulation of stores.",
        "source": "T10n0279_028:0153c07_13"
    },
    {
        "source_sentence": "願一切眾生出世俗家，住如來家；",
        "translation": "May all sentient beings leave the worldly home and live in the house of buddhahood.",
        "source": "T10n0279_028:0153c08_14"
    },
    {
        "source_sentence": "願一切眾生得無礙法，滅除一切障礙之道；",
        "translation": "May all sentient beings attain unobstructed dharmas and extinguish all obstructive paths.",
        "source": "T10n0279_028:0153c08_15"
    },
    {
        "source_sentence": "願一切眾生離家屬愛，雖現居家，心無所著；",
        "translation": "May all sentient beings be free from the craving for householders, and though they may appear at home, their minds have no attachment.",
        "source": "T10n0279_028:0153c09_16"
    },
    {
        "source_sentence": "願一切眾生善能化誘，不離家法，說佛智慧；",
        "translation": "May all sentient beings be able to teach and tempt, not leaving the ways of their homes, and explain the knowledge of buddhahood.",
        "source": "T10n0279_028:0153c10_17"
    },
    {
        "source_sentence": "願一切眾生身現在家，心常隨順佛智而住；",
        "translation": "May all sentient beings physically appear at home, their minds always following the Buddha’s knowledge.",
        "source": "T10n0279_028:0153c11_18"
    },
    {
        "source_sentence": "願一切眾生在居家地，住於佛地，普令無量無邊眾生發歡喜心。』",
        "translation": "May all sentient beings stay at home and live in the Buddha's land, causing measureless and limitless sentient beings to give rise to joyful thoughts.'",
        "source": "T10n0279_028:0153c12_19"
    },
    {
        "source_sentence": "是為菩薩摩訶薩布施舍宅時善根迴向，為令眾生成就菩薩種種行願神通智故。",
        "translation": "This is the good root that the bodhisattva Mahāsattva dedicates when he gives a dwelling, in order to cause sentient beings to achieve the various practices and vows of the bodhisattva's supernormal knowledge.",
        "source": "T10n0279_028:0153c14_20"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0153c16_21"
    },
    {
        "source_sentence": "菩薩摩訶薩布施種種園林、臺榭、遊戲快樂莊嚴之處，作是念言：『我當為一切眾生作好園林，",
        "translation": "“Great enlightening beings give various kinds of gardens, groves, terraces, parks, and playgrounds to sentient beings:",
        "source": "T10n0279_028:0153c16_22"
    },
    {
        "source_sentence": "我當為一切眾生示現法樂，我當施一切眾生歡喜之意，我當示一切眾生無邊喜樂，",
        "translation": "I will show all sentient beings the joy of enlightenment. I will give to all sentient beings an attitude of joy. I will show all sentient beings boundless joy and bliss.",
        "source": "T10n0279_028:0153c18_23"
    },
    {
        "source_sentence": "我當為一切眾生開淨法門，我當令一切眾生發歡喜心，我當令一切眾生得佛菩提，",
        "translation": "I will open the door of enlightenment for all sentient beings. I will cause all sentient beings to be inspired with joy. I will cause all sentient beings to attain buddhahood.",
        "source": "T10n0279_028:0153c20_24"
    },
    {
        "source_sentence": "我當令一切眾生成滿大願，我當於一切眾生猶如慈父，我當令一切眾生智慧觀察，",
        "translation": "I will cause all sentient beings to fulfill the great vow. I will be like a loving father to all sentient beings. I will cause all sentient beings to contemplate with wisdom.",
        "source": "T10n0279_028:0153c22_25"
    },
    {
        "source_sentence": "我當施一切眾生資生之具，我當於一切眾生猶如慈母，生長一切善根大願。』",
        "translation": "I will give all sentient beings the necessities for their livelihood, and I will be like a loving mother to all sentient beings and grow all the good roots of my great vow.'",
        "source": "T10n0279_028:0153c24_26"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0153c26_27"
    },
    {
        "source_sentence": "菩薩摩訶薩如是修行諸善根時，於惡眾生不生疲厭，亦不誤起棄捨之心。",
        "translation": "When bodhisattvas, mahāsattvas thus cultivate good roots, they don't become weary of bad sentient beings and don't mistakenly give rise to the mind of abandoning them.",
        "source": "T10n0279_028:0153c26_28"
    },
    {
        "source_sentence": "設滿世間一切眾生悉不知恩，菩薩於彼，初無嫌恨，不生一念求反報心，",
        "translation": "Suppose all sentient beings in the whole world don’t know their kindness, and the enlightening beings at first have no hostility toward them; they don’t give rise to a single thought of seeking reward or retribution.",
        "source": "T10n0279_028:0153c27_29"
    },
    {
        "source_sentence": "但欲滅其無量苦惱；",
        "translation": "They simply want to extinguish their immeasurable pain and suffering.",
        "source": "T10n0279_028:0153c29_30"
    },
    {
        "source_sentence": "於諸世間，心如虛空，無所染著，普觀諸法真實之相；",
        "translation": "In all worlds their minds are like space, not attached to anything. They observe the true characteristics of all things everywhere.",
        "source": "T10n0279_028:0154a01_0"
    },
    {
        "source_sentence": "發大誓願，滅眾生苦，永不厭捨大乘志願；",
        "translation": "They make a great vow to extinguish the suffering of sentient beings, never getting tired of or rejecting the determination for universal enlightenment.",
        "source": "T10n0279_028:0154a02_1"
    },
    {
        "source_sentence": "滅一切見，修諸菩薩平等行願。",
        "translation": "To extinguish all views, they cultivate the equal practices and vows of enlightening beings.",
        "source": "T10n0279_028:0154a03_2"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0154a03_3"
    },
    {
        "source_sentence": "菩薩摩訶薩如是觀察已，攝諸善根，悉以迴向，所謂：『願一切眾生念念滋生無量善法，",
        "translation": "“When great enlightening beings have thus observed, they gather the roots of goodness and dedicate them all in this way:",
        "source": "T10n0279_028:0154a03_4"
    },
    {
        "source_sentence": "成就無上園林之心；",
        "translation": "They develop the mind of unexcelled parks and forests.",
        "source": "T10n0279_028:0154a05_5"
    },
    {
        "source_sentence": "願一切眾生得不動法，見一切佛皆令歡喜；",
        "translation": "May all sentient beings attain the unshakable state, and be joyful when they see all buddhas.",
        "source": "T10n0279_028:0154a06_6"
    },
    {
        "source_sentence": "願一切眾生樂法園苑，得諸佛剎園苑妙樂；",
        "translation": "May all sentient beings enjoy the park of truth and attain the marvelous bliss of the parks of buddha-lands.",
        "source": "T10n0279_028:0154a07_7"
    },
    {
        "source_sentence": "願一切眾生得淨妙心，常見如來神足園林；",
        "translation": "May all sentient beings attain a pure and marvelous mind, seeing the Buddha’s park of mystic feet.",
        "source": "T10n0279_028:0154a08_8"
    },
    {
        "source_sentence": "願一切眾生得佛戲樂，常善遊戲智慧境界；",
        "translation": "May all sentient beings attain the bliss of buddhahood, always playing in the realm of knowledge and wisdom.",
        "source": "T10n0279_028:0154a09_9"
    },
    {
        "source_sentence": "願一切眾生得遊戲樂，普詣佛剎道場眾會；",
        "translation": "May all sentient beings attain play and bliss, visiting the congregations at the enlightenment sites of buddha-lands everywhere.",
        "source": "T10n0279_028:0154a10_10"
    },
    {
        "source_sentence": "願一切眾生成就菩薩解脫遊戲，盡未來劫，行菩薩行，心無疲倦；",
        "translation": "May all sentient beings attain enlightening liberation and play, carrying out enlightening practice throughout the ages to come, their minds never getting tired of it.",
        "source": "T10n0279_028:0154a11_11"
    },
    {
        "source_sentence": "願一切眾生見一切佛充滿法界，發廣大心，住佛園林；",
        "translation": "May all sentient beings see all buddhas filling the cosmos of reality and give rise to great determination, dwelling in buddha-lands and forests.",
        "source": "T10n0279_028:0154a12_12"
    },
    {
        "source_sentence": "願一切眾生悉能遍往一切佛剎，一一剎中供養諸佛；",
        "translation": "May all sentient beings be able to go to all buddha-lands, and in each buddha-land honor the Buddhas.",
        "source": "T10n0279_028:0154a14_13"
    },
    {
        "source_sentence": "願一切眾生得善欲心，清淨莊嚴一切佛剎。』",
        "translation": "May all sentient beings attain the mind of good desire and purely adorn all buddha-lands.'",
        "source": "T10n0279_028:0154a15_14"
    },
    {
        "source_sentence": "是為菩薩摩訶薩布施一切園林、臺榭善根迴向；",
        "translation": "“This is great enlightening beings’ dedication of giving away all the roots of goodness of gardens, forests, terraces, and buildings.",
        "source": "T10n0279_028:0154a16_15"
    },
    {
        "source_sentence": "為令眾生見一切佛，遊戲一切佛園林故。",
        "translation": "It's because it causes sentient beings to see all buddhas and play in the park of all buddhas.",
        "source": "T10n0279_028:0154a17_16"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0154a18_17"
    },
    {
        "source_sentence": "菩薩摩訶薩作百千億那由他無量無數廣大施會，一切清淨，諸佛印可，",
        "translation": "“Great enlightening beings perform countless and immeasurable great acts of giving, hundreds of thousands of myriads of koṭis of nayutas of offerings. All are pure, approved by the Buddhas.",
        "source": "T10n0279_028:0154a18_18"
    },
    {
        "source_sentence": "終不損惱於一眾生；",
        "translation": "They never harm a single sentient being.",
        "source": "T10n0279_028:0154a20_19"
    },
    {
        "source_sentence": "普令眾生遠離眾惡，淨三業道，成就智慧；",
        "translation": "Causing sentient beings to be far removed from all evils, purifying the three paths of action, they develop wisdom.",
        "source": "T10n0279_028:0154a20_20"
    },
    {
        "source_sentence": "開置無量百千億那由他阿僧祇清淨境界，積集無量百千億那由他阿僧祇資生妙物，",
        "translation": "They open and set up immeasurable hundreds of thousands of myriads of koṭis of nayutas of pure spheres, accumulating immeasurable millions of myriads of billions of myriads of trillions of the finest necessities.",
        "source": "T10n0279_028:0154a21_21"
    },
    {
        "source_sentence": "發甚難得菩提之心，行無限施，令諸眾生住清淨道，初、中、後善，生淨信解；",
        "translation": "They develop a determination for enlightenment that is extremely difficult to attain. They practice infinite giving, causing all sentient beings to abide in the pure path; first, middle, and last, good, they engender pure faith and understanding.",
        "source": "T10n0279_028:0154a23_22"
    },
    {
        "source_sentence": "隨百千億無量眾生心之所樂，悉令歡喜，以大慈悲救護一切，承事供養三世諸佛；",
        "translation": "“Great enlightening beings cause sentient beings to be joyful, according to the mentalities of countless hundreds of thousands of myriads of koṭis of sentient beings. With great compassion they rescue and protect all, serving and honoring the Buddhas of all times.",
        "source": "T10n0279_028:0154a25_23"
    },
    {
        "source_sentence": "為欲成就一切佛種，修行布施，心無中悔，增長信根，成滿勝行，念念增進檀波羅蜜。",
        "translation": "In order to perfect the lineage of all buddhas, they cultivate generosity without regret in their minds, develop the faculty of faith, accomplish superior practices, and increase the perfection of giving from moment to moment.",
        "source": "T10n0279_028:0154a27_24"
    },
    {
        "source_sentence": "菩薩爾時，以諸善根如是迴向，所謂：『願一切眾生發大乘心，悉得成就摩訶衍施；",
        "translation": "At that time the enlightening beings dedicate their roots of goodness in this way:",
        "source": "T10n0279_028:0154a28_25"
    },
    {
        "source_sentence": "願一切眾生皆悉能行大會施、盡施、善施、最勝施、無上施、最無上施、無等等施、超諸世間施、一切諸佛所稱歎施；",
        "translation": "May all sentient beings be able to practice great giving, giving in full, giving whole, good giving, most excellent giving, unsurpassed giving, most unsurpassed giving, unequalled giving, giving transcending all worlds, giving praised by all buddhas.",
        "source": "T10n0279_028:0154b01_26"
    },
    {
        "source_sentence": "願一切眾生作第一施主，於諸惡趣免濟眾生，皆令得入無礙智道，修平等願如實善根，",
        "translation": "May all sentient beings be the first donor, rescuing sentient beings from the bad destinies and enabling them to enter the unobstructed path of knowledge and cultivating equanimous vows as true roots of goodness.",
        "source": "T10n0279_028:0154b04_27"
    },
    {
        "source_sentence": "得無差別證自境智；",
        "translation": "They attain undifferentiated knowledge of their own objects.",
        "source": "T10n0279_028:0154b06_28"
    },
    {
        "source_sentence": "願一切眾生安住寂靜諸禪定智，入不死道，究竟一切神通智慧，勇猛精進，",
        "translation": "May all sentient beings abide peacefully in the knowledge of meditative absorption and enter the path of immortality, perfecting all spiritual powers, wisdom, and courageous effort.",
        "source": "T10n0279_028:0154b06_29"
    },
    {
        "source_sentence": "具足諸地，莊嚴佛法，到於彼岸，永不退轉；",
        "translation": "They are endowed with all the stages, adorning the buddha-teachings; reaching the other shore, they never turn back.",
        "source": "T10n0279_028:0154b08_30"
    },
    {
        "source_sentence": "願一切眾生設大施會，終不疲厭，給濟眾生，無有休息，究竟無上一切種智；",
        "translation": "May all sentient beings set up great assemblies of giving, never getting tired or exhausted. Giving aid to sentient beings without resting, they ultimately attain the supreme omniscience of all kinds.",
        "source": "T10n0279_028:0154b09_31"
    },
    {
        "source_sentence": "願一切眾生恒勤種植一切善根，到於無量功德彼岸；",
        "translation": "May all sentient beings always diligently plant all roots of goodness, reaching the other shore of immeasurable virtue.",
        "source": "T10n0279_028:0154b11_32"
    },
    {
        "source_sentence": "願一切眾生常蒙諸佛之所稱歎，普為世間作大施主，功德具足，充滿法界，",
        "translation": "May all sentient beings always be praised by the Buddhas. Being great donors to all beings in the world, endowed with virtue, they fill the cosmos of reality.",
        "source": "T10n0279_028:0154b12_33"
    },
    {
        "source_sentence": "遍照十方，施無上樂；",
        "translation": "They illumine the ten directions, bestowing unexcelled bliss.",
        "source": "T10n0279_028:0154b14_34"
    },
    {
        "source_sentence": "願一切眾生設大施會，廣集善根，等攝眾生，到於彼岸；",
        "translation": "May all sentient beings set up great assemblies of giving, extensively accumulating roots of goodness, equally taking care of sentient beings, reaching the other shore.",
        "source": "T10n0279_028:0154b14_35"
    },
    {
        "source_sentence": "願一切眾生成最勝施，普令眾生住第一乘；",
        "translation": "May all sentient beings attain the supreme giving, causing all sentient beings to abide in the first vehicle.",
        "source": "T10n0279_028:0154b15_36"
    },
    {
        "source_sentence": "願一切眾生為應時施，永離非時，大施究竟；",
        "translation": "May all sentient beings give appropriately and at the right time, forever leaving behind what is not proper.",
        "source": "T10n0279_028:0154b16_37"
    },
    {
        "source_sentence": "願一切眾生成就善施，到佛丈夫大施彼岸；",
        "translation": "May all sentient beings accomplish good giving, reaching the other shore of great giving to buddhas and men.",
        "source": "T10n0279_028:0154b17_38"
    },
    {
        "source_sentence": "願一切眾生究竟常行大莊嚴施，盡以一切諸佛為師，悉皆親近，興大供養；",
        "translation": "May all sentient beings ultimately always practice great adornments of giving, having all buddhas as their teachers; they become intimate with and make great offerings to all buddhas.",
        "source": "T10n0279_028:0154b18_39"
    },
    {
        "source_sentence": "願一切眾生住清淨施，集等法界無量福德，到於彼岸；",
        "translation": "May all sentient beings abide in pure giving, accumulating immeasurable virtues equal to the cosmos of reality, reaching the other shore.",
        "source": "T10n0279_028:0154b20_40"
    },
    {
        "source_sentence": "願一切眾生於諸世間為大施主，誓度群品，住如來地。』",
        "translation": "May all sentient beings be great donors in the world, vow to save all living beings, and abide in the Tathāgata's land.'",
        "source": "T10n0279_028:0154b21_41"
    },
    {
        "source_sentence": "是為菩薩摩訶薩設大施會善根迴向，為令眾生行無上施、究竟佛施、成就善施、不可壞施、供諸佛施、無恚恨施、救眾生施、成一切智施、常見諸佛施、善精進施、成就一切菩薩功德諸佛智慧廣大施故。",
        "translation": "This is because the bodhisattva Mahāsattva sets up a great giving assembly and dedicates his good roots to enabling sentient beings to practice unsurpassed generosity, perfecting buddha-giving, accomplishing good generosity, indestructible generosity, making offerings to the buddhas, bestowing without resentment, saving sentient beings,",
        "source": "T10n0279_028:0154b23_42"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0154b27_43"
    },
    {
        "source_sentence": "菩薩摩訶薩布施一切資生之物，心無貪惜，不求果報；",
        "translation": "“Great enlightening beings give all the necessities of life without covetousness in their hearts, not seeking reward.",
        "source": "T10n0279_028:0154b27_44"
    },
    {
        "source_sentence": "於世富樂無所希望，離妄想心，善思惟法；",
        "translation": "“Great enlightening beings have no hope of worldly prosperity or happiness, are free from deluded thoughts and minds, and meditate well on the Teaching.",
        "source": "T10n0279_028:0154b28_45"
    },
    {
        "source_sentence": "為欲利益一切眾生，審觀一切諸法實性；",
        "translation": "In order to benefit all sentient beings they contemplate the true nature of all things.",
        "source": "T10n0279_028:0154b29_46"
    },
    {
        "source_sentence": "隨諸眾生種種不同，所用所求各各差別，成辦無量資生之具，所有嚴飾悉皆妙好；",
        "translation": "In accord with the various differences of sentient beings, each different in what they use and seek, they develop measureless necessities, all beautifully adorned.",
        "source": "T10n0279_028:0154c01_47"
    },
    {
        "source_sentence": "行無邊施，行一切施，盡內外施；",
        "translation": "He practiced boundless giving, gave all kinds of gifts, and gave all internal and external donations.",
        "source": "T10n0279_028:0154c03_48"
    },
    {
        "source_sentence": "行此施時，增志樂力，獲大功德，成就心寶；",
        "translation": "When they practice this giving, they increase the power of aspiration, attain great virtue, and perfect the jewel of mind.",
        "source": "T10n0279_028:0154c04_49"
    },
    {
        "source_sentence": "常能守護一切眾生，皆令發生殊勝志願，初未曾有求反報心；",
        "translation": "They are always able to protect all sentient beings, causing them to give rise to extraordinary aspirations. At first they never have the thought of seeking reward or retribution.",
        "source": "T10n0279_028:0154c05_50"
    },
    {
        "source_sentence": "所有善根等三世佛，悉以圓滿一切種智。",
        "translation": "All the buddhas of the three times who possess roots of goodness and so forth completely perfect all kinds of knowledge.",
        "source": "T10n0279_028:0154c07_51"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0154c08_52"
    },
    {
        "source_sentence": "菩薩摩訶薩以此布施所有善根迴向眾生：『願一切眾生清淨調伏；",
        "translation": "“Great enlightening beings dedicate these roots of goodness of giving to sentient beings:",
        "source": "T10n0279_028:0154c08_53"
    },
    {
        "source_sentence": "願一切眾生滅除煩惱，嚴淨一切諸佛剎土；",
        "translation": "May all sentient beings be freed from afflictions and purify all buddha-lands.",
        "source": "T10n0279_028:0154c09_54"
    },
    {
        "source_sentence": "願一切眾生以清淨心，於一念中周遍法界；",
        "translation": "May all sentient beings, with pure minds, pervade the cosmos of reality in a single thought.",
        "source": "T10n0279_028:0154c10_55"
    },
    {
        "source_sentence": "願一切眾生智慧充滿虛空法界；",
        "translation": "May all sentient beings’ knowledge fill space and the cosmos of reality.",
        "source": "T10n0279_028:0154c11_56"
    },
    {
        "source_sentence": "願一切眾生得一切智，普入三世調伏眾生，於一切時常轉清淨不退法輪；",
        "translation": "May all sentient beings attain omniscience and enter everywhere in all times to tame sentient beings. At all times always turning the pure, unregressing wheel of the Teaching.",
        "source": "T10n0279_028:0154c12_57"
    },
    {
        "source_sentence": "願一切眾生具一切智，善能示現神通方便，饒益眾生；",
        "translation": "May all sentient beings be endowed with omniscience, able to skillfully manifest the means of mystic powers to aid sentient beings.",
        "source": "T10n0279_028:0154c14_58"
    },
    {
        "source_sentence": "願一切眾生悉能悟入諸佛菩提，盡未來劫，於十方界，常說正法，曾無休息，",
        "translation": "May all sentient beings be able to awaken and enter the enlightenment of buddhas. Throughout the ages to come, throughout the ten directions, always expounding the Teaching, never ceasing it.",
        "source": "T10n0279_028:0154c15_59"
    },
    {
        "source_sentence": "令諸眾生普得聞知；",
        "translation": "They cause all sentient beings to hear and know.",
        "source": "T10n0279_028:0154c17_60"
    },
    {
        "source_sentence": "願一切眾生於無量劫修菩薩行，悉得圓滿；",
        "translation": "May all sentient beings cultivate the practice of enlightening beings for immeasurable eons and attain complete fulfillment.",
        "source": "T10n0279_028:0154c17_61"
    },
    {
        "source_sentence": "願一切眾生於一切世界若染、若淨、若小、若大、若麁、若細、若覆、若仰，",
        "translation": "May all sentient beings in all worlds, whether defiled, pure, small, large, coarse, fine, covered, or raised,",
        "source": "T10n0279_028:0154c18_62"
    },
    {
        "source_sentence": "或一莊嚴，或種種莊嚴所可演說，在世界數諸世界中，修菩薩行靡不周遍；",
        "translation": "In worlds as numerous as atoms in all buddha-fields they cultivate the practice of enlightening beings everywhere, some with one adornment, some with various adornments to be taught.",
        "source": "T10n0279_028:0154c20_63"
    },
    {
        "source_sentence": "願一切眾生於念念中常作三世一切佛事，教化眾生向一切智。』",
        "translation": "May all sentient beings always perform all the buddha-works of the three times in each moment of thought, teaching and transforming sentient beings to reach omniscience.'",
        "source": "T10n0279_028:0154c21_64"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0154c23_65"
    },
    {
        "source_sentence": "菩薩摩訶薩隨諸眾生一切所須，以如是等阿僧祇物而為給施；",
        "translation": "“Great enlightening beings give innumerable things like these to sentient beings according to their needs.",
        "source": "T10n0279_028:0154c23_66"
    },
    {
        "source_sentence": "為令佛法相續不斷，大悲普救一切眾生；",
        "translation": "To cause the buddha-dharma to continue unceasingly, great compassion saves all sentient beings.",
        "source": "T10n0279_028:0154c25_67"
    },
    {
        "source_sentence": "安住大慈，修菩薩行；",
        "translation": "Abiding in great compassion, they cultivate the practice of enlightening beings.",
        "source": "T10n0279_028:0154c26_68"
    },
    {
        "source_sentence": "於佛教誨終無違犯，以巧方便修行眾善，不斷一切諸佛種性；",
        "translation": "They never disobey the instructions of Buddha; by skillful means they cultivate all goodness, not destroying the lineage of all buddhas.",
        "source": "T10n0279_028:0154c26_69"
    },
    {
        "source_sentence": "隨求悉與而無患厭，一切悉捨未曾中悔，常勤迴向一切智道。",
        "translation": "They give whatever they ask without weariness or displeasure, relinquish all, never regretting anything, always diligently dedicating themselves to the path of omniscience.",
        "source": "T10n0279_028:0154c28_70"
    },
    {
        "source_sentence": "時，十方國土種種形類、種種趣生、種種福田，皆來集會，至菩薩所，",
        "translation": "“Then the enlightening being Universally Good, knowing the various forms of all buddha-fields in the ten directions and the various forms of sentient beings therein, as well as the various fields of blessings that arose from those practices, came to this assembly.",
        "source": "T10n0279_028:0154c29_71"
    },
    {
        "source_sentence": "種種求索。",
        "translation": "Various kinds of requests.",
        "source": "T10n0279_028:0155a02_72"
    },
    {
        "source_sentence": "菩薩見已，普皆攝受；",
        "translation": "When the enlightening beings saw this, they all accepted it.",
        "source": "T10n0279_028:0155a02_73"
    },
    {
        "source_sentence": "心生歡喜，如見善友；",
        "translation": "Their hearts became joyous, as if they had seen a good friend.",
        "source": "T10n0279_028:0155a02_74"
    },
    {
        "source_sentence": "大悲哀愍，思滿其願；",
        "translation": "With great compassion and pity they thought to fulfill their vow.",
        "source": "T10n0279_028:0155a03_75"
    },
    {
        "source_sentence": "捨心增長，無有休息，亦不疲厭；",
        "translation": "The mind of relinquishment increases, without rest or weariness.",
        "source": "T10n0279_028:0155a03_76"
    },
    {
        "source_sentence": "隨其所求，悉令滿足，離貧窮苦。",
        "translation": "Whatever they ask for, they'll all be fulfilled, and they'll be freed from the suffering of poverty.",
        "source": "T10n0279_028:0155a04_77"
    },
    {
        "source_sentence": "時，諸乞者心大欣慶，轉更稱傳，讚揚其德，美聲遐布，悉來歸往。",
        "translation": "The beggars were greatly delighted and praised the Master’s virtues. His fame spread far and wide, and they all came back and forth to praise him.",
        "source": "T10n0279_028:0155a05_78"
    },
    {
        "source_sentence": "菩薩見已，歡喜無量；",
        "translation": "On seeing them, the enlightening beings were immeasurably joyful.",
        "source": "T10n0279_028:0155a06_79"
    },
    {
        "source_sentence": "假使百千億那由他劫受帝釋樂，無數劫受夜摩天樂，無量劫受兜率陀天樂，",
        "translation": "Suppose you were to experience the bliss of Indra for hundreds of thousands of myriads of koṭis of nayutas of kalpas, receive the bliss of Yama Heaven for countless eons, and experience the bliss of Tuṣita Heaven for measureless eons.",
        "source": "T10n0279_028:0155a07_80"
    },
    {
        "source_sentence": "無邊劫受善變化天樂，無等劫受他化自在天樂，不可數劫受梵王樂，不可稱劫受轉輪王王三千樂，",
        "translation": "For boundless eons they experience the heavenly bliss of good magical creations; for peerless eons they experience the heavenly bliss of mastery over others’ creations; for incalculable numbers of eons they experience the bliss of brahma kingship; and for an incalculable number of eons they experience the bliss of cakravart",
        "source": "T10n0279_028:0155a09_81"
    },
    {
        "source_sentence": "不可思劫受遍淨天樂，不可說劫受淨居天樂，悉不能及。",
        "translation": "In an inconceivable eon, they'll experience the bliss of the pervasively pure heavens, and in an inconceivable eon they'll experience the bliss of the pure abode heavens that can't be measured by anyone.",
        "source": "T10n0279_028:0155a11_82"
    },
    {
        "source_sentence": "菩薩摩訶薩見乞者來，歡喜愛樂，欣慶踊躍，信心增長，志樂清淨，諸根調順，",
        "translation": "“When great enlightening beings see the beggar coming, they are joyful and delighted, rejoicing and jumping for joy. Their faith increases, their aspiration is pure, their faculties are tamed and disciplined.",
        "source": "T10n0279_028:0155a12_83"
    },
    {
        "source_sentence": "信解成滿，乃至增進諸佛菩提。",
        "translation": "Their faith and understanding are complete, up to the point where they increase the enlightenment of the buddhas.",
        "source": "T10n0279_028:0155a14_84"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0155a15_85"
    },
    {
        "source_sentence": "菩薩摩訶薩以此善根，為欲利益一切眾生故迴向，為欲安樂一切眾生故迴向，",
        "translation": "“The great enlightening beings dedicate these roots of goodness for the benefit of all sentient beings, and they dedicate them for the welfare of all sentient beings.",
        "source": "T10n0279_028:0155a15_86"
    },
    {
        "source_sentence": "為令一切眾生得大義利故迴向，為令一切眾生悉得清淨故迴向，為令一切眾生悉求菩提故迴向，",
        "translation": "dedication for the sake of enabling all sentient beings to attain great benefit; dedication for the sake of enabling all sentient beings to attain purity; dedication for the sake of enabling all sentient beings to seek enlightenment.",
        "source": "T10n0279_028:0155a17_87"
    },
    {
        "source_sentence": "為令一切眾生悉得平等故迴向，為令一切眾生悉得賢善心故迴向，為令一切眾生悉入摩訶衍故迴向，",
        "translation": "dedication for the sake of enabling all sentient beings to attain equality; dedication for the sake of enabling all sentient beings to attain goodness and virtue; dedication for the sake of enabling all sentient beings to enter the Great Vehicle.",
        "source": "T10n0279_028:0155a19_88"
    },
    {
        "source_sentence": "為令一切眾生悉得賢善智慧故迴向，為令一切眾生悉具普賢菩薩行願滿十力乘現成正覺故迴向。",
        "translation": "It's dedicated to enabling all sentient beings to attain goodness and wisdom, and it's dedicated to enabling all sentient beings to fully possess the practice and vows of Samantabhadra Bodhisattva and fulfill the ten powers of the vehicle in order to now become perfectly enlightened.",
        "source": "T10n0279_028:0155a21_89"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0155a25_0"
    },
    {
        "source_sentence": "菩薩摩訶薩以諸善根如是迴向時，身、口、意業皆悉解脫，無著無繫，",
        "translation": "“When great enlightening beings dedicate the roots of goodness in this way, their physical, verbal, and mental actions are all liberated, without attachment or bondage.",
        "source": "T10n0279_028:0155a25_1"
    },
    {
        "source_sentence": "無眾生想，無命者想，無補伽羅想，無人想，無童子想，無生者想，無作者想，",
        "translation": "They have no ideation of sentient beings, no ideation of living beings, no ideation of personalities, no ideation of persons, no ideation of children, no ideation of those who are born, and no ideation of authors.",
        "source": "T10n0279_028:0155a26_2"
    },
    {
        "source_sentence": "無受者想，無有想，無無想，無今世、後世想，無死此生彼想，無常想，",
        "translation": "They have no ideation of the experiencer, no ideation of existence, no ideation of nonexistence, no ideation of present life or afterlife, no ideation of death here and birth there, and no ideation of impermanence.",
        "source": "T10n0279_028:0155a28_3"
    },
    {
        "source_sentence": "無無常想，無三有想，無無三有想，非想非非想。",
        "translation": "There's no perception of impermanence, no perception of the three existences, no perception of the three existences, and neither perception nor non-perception.",
        "source": "T10n0279_028:0155a29_4"
    },
    {
        "source_sentence": "如是，非縛迴向，非縛解迴向；",
        "translation": "In the same way, they do not dedicate it back to bondage or to liberation.",
        "source": "T10n0279_028:0155b01_5"
    },
    {
        "source_sentence": "非業迴向，非業報迴向；",
        "translation": "They are not dedication for the retribution of action, they are not dedication for the retribution of action.",
        "source": "T10n0279_028:0155b02_6"
    },
    {
        "source_sentence": "非分別迴向，非無分別迴向；",
        "translation": "They are not discriminating dedication; they are not nondiscriminating dedication.",
        "source": "T10n0279_028:0155b03_7"
    },
    {
        "source_sentence": "非思迴向，非思已迴向；",
        "translation": "They are not dedicating [them] back to what they think and not to what they have already thought.",
        "source": "T10n0279_028:0155b03_8"
    },
    {
        "source_sentence": "非心迴向，非無心迴向。",
        "translation": "It's not a dedication of mind, and it's not a dedication without mind.",
        "source": "T10n0279_028:0155b04_9"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0155b04_10"
    },
    {
        "source_sentence": "菩薩摩訶薩如是迴向時，不著內，不著外；",
        "translation": "“When great enlightening beings practice dedication in this way, they do not cling to inside or outside.",
        "source": "T10n0279_028:0155b04_11"
    },
    {
        "source_sentence": "不著能緣，不著所緣；",
        "translation": "They don’t cling to perceptual objects, and don’t cling to perceptual objects.",
        "source": "T10n0279_028:0155b05_12"
    },
    {
        "source_sentence": "不著因，不著果；",
        "translation": "They do not cling to causes and they do not cling to results.",
        "source": "T10n0279_028:0155b06_13"
    },
    {
        "source_sentence": "不著法，不著非法；",
        "translation": "They don’t cling to doctrine and don’t cling to non-teaching.",
        "source": "T10n0279_028:0155b06_14"
    },
    {
        "source_sentence": "不著思，不著非思；",
        "translation": "They are not attached to thought, and they are not attached to what is not thought.",
        "source": "T10n0279_028:0155b07_15"
    },
    {
        "source_sentence": "不著色，不著色生，不著色滅；",
        "translation": "They do not cling to form, do not cling to form as arising, and do not cling to form as ceasing.",
        "source": "T10n0279_028:0155b07_16"
    },
    {
        "source_sentence": "不著受、想、行、識，不著受、想、行、識生，不著受、想、行、識滅。",
        "translation": "They aren't attached to feeling, perception, volition, and consciousness, aren't attached to feeling, perception, volition, and consciousness that arise, and aren't attached to feeling, perception, volition, and consciousness that cease.",
        "source": "T10n0279_028:0155b08_17"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0155b09_18"
    },
    {
        "source_sentence": "菩薩摩訶薩若能於此諸法不著，則不縛色，不縛色生，不縛色滅；",
        "translation": "“If great enlightening beings can be unattached to these things, then they are not bound by form; they are not bound by form that arises or ceases.",
        "source": "T10n0279_028:0155b09_19"
    },
    {
        "source_sentence": "不縛受、想、行、識，不縛受、想、行、識生，不縛受、想、行、識滅。",
        "translation": "They aren't bound to feeling, perception, volition, and consciousness, don't become bound to feeling, perception, volition, and consciousness that arise, and don't become bound to feeling, perception, volition, and consciousness that cease.",
        "source": "T10n0279_028:0155b11_20"
    },
    {
        "source_sentence": "若能於此諸法不縛，則亦於諸法不解。",
        "translation": "If they can be unfettered by these things, then they won't understand them either.",
        "source": "T10n0279_028:0155b12_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_028:0155b13_22"
    },
    {
        "source_sentence": "無有少法，若現生、若已生、若當生；",
        "translation": "There is no small factor that arises, has arisen, or will arise in the future.",
        "source": "T10n0279_028:0155b13_23"
    },
    {
        "source_sentence": "無法可取，無法可著。",
        "translation": "Nothing can be grasped, and nothing can be attached.",
        "source": "T10n0279_028:0155b14_24"
    },
    {
        "source_sentence": "一切諸法自相如是，無有自性，自性相離，非一、非二，非多、非無量，",
        "translation": "The specific characteristics of all dharmas are like this: they do not have an own-nature. The specific characteristics themselves are distinct; they are not one, not two, not many, not immeasurable.",
        "source": "T10n0279_028:0155b14_25"
    },
    {
        "source_sentence": "非小、非大，非狹、非廣，非深、非淺，非寂靜、非戲論，非處、非非處，",
        "translation": "They are neither small nor large, neither narrow nor wide, neither deep nor shallow, neither quiescent nor conceptual, neither place nor non-place.",
        "source": "T10n0279_028:0155b16_26"
    },
    {
        "source_sentence": "非法、非非法，非體、非非體，非有、非非有。",
        "translation": "What's not unlawful and what's not unlawful, what's not essence and what's not essence, and what's not existent and what's not existent.",
        "source": "T10n0279_028:0155b17_27"
    },
    {
        "source_sentence": "菩薩如是觀察諸法，則為非法；",
        "translation": "A bodhisattva who observes all things in this way is unlawful.",
        "source": "T10n0279_028:0155b18_28"
    },
    {
        "source_sentence": "於言語中隨世建立，非法為法；",
        "translation": "In words, they are established according to the time; what is unlawful is doctrine.",
        "source": "T10n0279_028:0155b19_0"
    },
    {
        "source_sentence": "不斷諸業道，不捨菩薩行，求一切智終無退轉；",
        "translation": "They do not cut off the courses of action, do not give up enlightening practices; they seek omniscience without ever retreating.",
        "source": "T10n0279_028:0155b19_1"
    },
    {
        "source_sentence": "了知一切業緣如夢，音聲如響，眾生如影，諸法如幻，而亦不壞因緣業力；",
        "translation": "They know that the conditions of all actions are like dreams, sounds like echoes, sentient beings like reflections, phenomena like illusions, yet they do not destroy the causes or conditions of action.",
        "source": "T10n0279_028:0155b20_2"
    },
    {
        "source_sentence": "了知諸業其用廣大，解一切法皆無所作，行無作道未甞暫廢。",
        "translation": "Understanding that the function of actions is vast, he understands that all dharmas are unconstructed, and he practices the path of unconstructedness without ever abandoning it.",
        "source": "T10n0279_028:0155b22_3"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0155b23_4"
    },
    {
        "source_sentence": "此菩薩摩訶薩住一切智，若處、非處，普皆迴向一切智性；",
        "translation": "“These great enlightening beings abide in omniscience; wherever they may or may not, they all turn to the nature of omniscience.",
        "source": "T10n0279_028:0155b24_0"
    },
    {
        "source_sentence": "於一切處皆悉迴向，無有退轉。",
        "translation": "They dedicate themselves in all places without turning back.",
        "source": "T10n0279_028:0155b25_1"
    },
    {
        "source_sentence": "以何義故說名迴向？",
        "translation": "What does it mean to call it dedication of merit?",
        "source": "T10n0279_028:0155b26_0"
    },
    {
        "source_sentence": "永度世間至於彼岸，故名迴向；",
        "translation": "It is called dedication because of having crossed the world forever and arrived at the other shore.",
        "source": "T10n0279_028:0155b26_1"
    },
    {
        "source_sentence": "永出諸蘊至於彼岸，故名迴向；",
        "translation": "It is called dedication because it leaves all aggregates forever and reaches the other shore.",
        "source": "T10n0279_028:0155b27_2"
    },
    {
        "source_sentence": "度言語道至於彼岸，故名迴向；",
        "translation": "It is called dedication because it crosses the path of words up to the other shore.",
        "source": "T10n0279_028:0155b27_3"
    },
    {
        "source_sentence": "離種種想至於彼岸，故名迴向；",
        "translation": "It is called dedication because of being free from all kinds of conceptions and reaching the other shore.",
        "source": "T10n0279_028:0155b28_4"
    },
    {
        "source_sentence": "永斷身見至於彼岸，故名迴向；",
        "translation": "They are called dedication because they permanently abandon belief in a self and reach the other shore.",
        "source": "T10n0279_028:0155b29_5"
    },
    {
        "source_sentence": "永離依處至於彼岸，故名迴向；",
        "translation": "It is called dedication because it leaves its support forever and reaches the other shore.",
        "source": "T10n0279_028:0155c01_6"
    },
    {
        "source_sentence": "永絕所作至於彼岸，故名迴向；",
        "translation": "They are called dedication because they forever abandon what they do and reach the other shore.",
        "source": "T10n0279_028:0155c01_7"
    },
    {
        "source_sentence": "永出諸有至於彼岸，故名迴向；",
        "translation": "It is called dedication because it forever leaves all existences and reaches the other shore.",
        "source": "T10n0279_028:0155c02_8"
    },
    {
        "source_sentence": "永捨諸取至於彼岸，故名迴向；",
        "translation": "It is called dedication because it abandons grasping forever and reaches the other shore.",
        "source": "T10n0279_028:0155c03_9"
    },
    {
        "source_sentence": "永出世法至於彼岸，故名迴向。",
        "translation": "It's called dedication because it permanently transcends worldly dharmas and reaches the other side.",
        "source": "T10n0279_028:0155c04_10"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0155c04_11"
    },
    {
        "source_sentence": "菩薩摩訶薩如是迴向時，則為隨順佛住，隨順法住，隨順智住，隨順菩提住，",
        "translation": "“When great enlightening beings practice dedication in this way, they are abiding in accord with buddhas, Dharma, wisdom, and enlightenment.",
        "source": "T10n0279_028:0155c04_12"
    },
    {
        "source_sentence": "隨順義住，隨順迴向住，隨順境界住，隨順行住，隨順真實住，隨順清淨住。",
        "translation": "They abide in accordance with meaning, they abide in accordance with dedication, they abide in accordance with the objective realm, they abide in accordance with practice, they abide in accordance with reality, they abide in accordance with purity.",
        "source": "T10n0279_028:0155c06_13"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_028:0155c08_14"
    },
    {
        "source_sentence": "菩薩摩訶薩如是迴向，則為了達一切諸法，則為承事一切諸佛；",
        "translation": "“When great enlightening beings practice dedication in this way, they comprehend all things and serve all buddhas.",
        "source": "T10n0279_028:0155c08_15"
    },
    {
        "source_sentence": "無有一佛而不承事，無有一法而不供養；",
        "translation": "There is not a single buddha that they do not attend, and there is not a single doctrine that they do not honor.",
        "source": "T10n0279_028:0155c09_16"
    },
    {
        "source_sentence": "無有一法而可滅壞，無有一法而可乖違；",
        "translation": "There is not a single doctrine that can be destroyed, and there is not a single doctrine that can be contradicted.",
        "source": "T10n0279_028:0155c10_17"
    },
    {
        "source_sentence": "無有一物而可貪著，無有一法而可厭離；",
        "translation": "There is not a single thing that can be attached to, and there is not a single thing that can be disgusted with.",
        "source": "T10n0279_028:0155c11_18"
    },
    {
        "source_sentence": "不見內外一切諸法，有少滅壞，違因緣道；",
        "translation": "They do not see any internal or external dharmas that are subject to slight decay or disappearance, proceeding contrary to causal conditions.",
        "source": "T10n0279_028:0155c12_19"
    },
    {
        "source_sentence": "法力具足，無有休息。",
        "translation": "They are endowed with the power of the Dharma and have no resting place.",
        "source": "T10n0279_028:0155c13_20"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_028:0155c14_21"
    },
    {
        "source_sentence": "是為菩薩摩訶薩第六隨順堅固一切善根迴向。",
        "translation": "This is the sixth dedication of a bodhisattva-mahāsattva who follows and strengthens all good roots.",
        "source": "T10n0279_028:0155c14_22"
    },
    {
        "source_sentence": "菩薩摩訶薩住此迴向時，常為諸佛之所護念，堅固不退，入深法性，修一切智；",
        "translation": "“When great enlightening beings abide in this dedication, they are always guarded by the Buddhas; firm and unshakable, they enter deeply into the essence of reality and cultivate omniscience.",
        "source": "T10n0279_028:0155c15_23"
    },
    {
        "source_sentence": "隨順法義，隨順法性，隨順一切堅固善根，隨順一切圓滿大願；",
        "translation": "“Great enlightening beings’ great vows are to follow the meaning of the Teaching, follow the essence of the Teaching, follow all firm roots of goodness, and follow all perfected vows.",
        "source": "T10n0279_028:0155c17_24"
    },
    {
        "source_sentence": "具足隨順堅固之法，一切金剛所不能壞，於諸法中而得自在。」",
        "translation": "They are endowed with the Dharma that follows and is resolute, which can't be broken by any adamantine dharma and attain mastery over all dharmas.",
        "source": "T10n0279_028:0155c18_25"
    },
    {
        "source_sentence": "爾時，金剛幢菩薩觀察十方、觀察眾會、觀察法界已，入於字句甚深之義，",
        "translation": "At that time the enlightening being Diamond Banner, having surveyed the ten directions, observed the congregations, and looked over the cosmos of reality, entered into the profound meaning of words and phrases.",
        "source": "T10n0279_028:0155c20_0"
    },
    {
        "source_sentence": "修習無量廣大之心，以大悲心普覆世間，長去、來、今佛種性心，入於一切諸佛功德，",
        "translation": "Cultivating an immeasurably great and vast mind, covering all worlds with great compassion, they enter into the virtues of all buddhas.",
        "source": "T10n0279_028:0155c21_1"
    },
    {
        "source_sentence": "成就諸佛自在力身，觀諸眾生心之所樂，隨其善根所可成熟，依法性身為現色身，",
        "translation": "Accomplishing the body of unimpeded power of buddhas, observing the mentalities of sentient beings’ inclinations, according to what can be developed by their roots of goodness, they manifest physical bodies based on the essence of reality as body.",
        "source": "T10n0279_028:0155c23_2"
    },
    {
        "source_sentence": "「菩薩現身作國王，　　於世位中最無等，",
        "translation": "“Enlightening beings manifest their bodies as kings, Equal to none in the world.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　福德威光勝一切，　　普為群萌興利益。",
        "translation": "The authoritative light of virtue surpasses all, For the benefit of all sentient beings.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　其心清淨無染著，　　於世自在咸遵敬，",
        "translation": "Their minds are pure and without attachment, Abiding freely in the world.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　弘宣正法以訓人，　　普使眾生獲安隱。",
        "translation": "He spreads the true teaching to teach people, Causing all sentient beings to attain peace.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　現生貴族昇王位，　　常依正教轉法輪，",
        "translation": "They are now born of noble clans and ascend to the throne, Always turning the wheel of Dharma in accord with right teaching.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　稟性仁慈無毒虐，　　十方敬仰皆從化。",
        "translation": "Their nature is benevolent and compassionate, without poison or cruelty; Respected in the ten directions, they all follow their edification.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　智慧分別常明了，　　色相才能皆具足，",
        "translation": "Their wisdom is discriminating, always clearly comprehending; All their forms and characteristics are endowed with talent.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　臨馭率土靡不從，　　摧伏魔軍悉令盡。",
        "translation": "When he approached the leader of the land, they all complied, crushing the armies of Māra and causing them all to be destroyed.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　堅持淨戒無違犯，　　決志堪忍不動搖，",
        "translation": "They hold fast to pure precepts without violating them; With determination they tolerate and don’t budge.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　永願蠲除忿恚心，　　常樂修行諸佛法。",
        "translation": "May they forever remove their angry minds and always delight in cultivating the Buddha’s teachings.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　飲食香鬘及衣服，　　車騎床褥座與燈，",
        "translation": "Their food, drink, incense, garlands, and clothing, their chariots, beds, bedding, seats, and lamps.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩悉以給濟人，　　并及所餘無量種。",
        "translation": "Enlightening beings give all to rescue people, As well as innumerable other kinds.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　為利益故而行施，　　令其開發廣大心，",
        "translation": "They practice giving for the sake of benefit, Causing others to develop a broad mind.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　於尊勝處及所餘，　　意皆清淨生歡喜。",
        "translation": "Their minds are pure and joyful in the supreme abode and all the rest.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩一切皆周給，　　內外所有悉能捨，",
        "translation": "Enlightening beings provide for all, Able to relinquish whatever they have inside and outside.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　必使其心永清淨，　　不令暫爾生狹劣。",
        "translation": "They must cause their minds to be permanently pure, and they won't allow narrowness or weakness to arise momentarily.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　或施於頭或施眼，　　或施於手或施足，",
        "translation": "They may give their heads, eyes, hands, feet, and so forth.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　皮肉骨髓及餘物，　　一切皆捨心無吝。",
        "translation": "All their skin, flesh, bones, marrow, and other things They give up without stinginess.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩身居大王位，　　種族豪貴人中尊，",
        "translation": "The body of the enlightening being is in the throne of great kingship, Most honored among the noble and wealthy of the world.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　開口出舌施群生，　　其心歡喜無憂戀。",
        "translation": "He opens his mouth and utters his tongue to give it to sentient beings, their hearts rejoicing without sorrow or attachment.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　以彼施舌諸功德，　　迴向一切諸眾生，",
        "translation": "With the virtues of their generosity and tongue they dedicate them To all sentient beings.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　普願藉此勝因緣，　　悉得如來廣長舌。",
        "translation": "Through these superior causes and conditions, may they all attain the Buddha’s vast and long tongue.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　或施妻子及王位，　　或施其身作僮僕，",
        "translation": "They may give their wives and kingships, Or they may give their bodies as servants.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　其心清淨常歡喜，　　如是一切無憂悔。",
        "translation": "Their minds are pure and always joyful, And thus they have no sorrow or regret in anything.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　隨所樂求咸施與，　　應時給濟無疲厭，",
        "translation": "Giving whatever one wishes, they provide at the right time and without weariness.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　一切所有皆能散，　　諸來求者普滿足。",
        "translation": "All that exists can be scattered, Fulfilling all those who come to ask for it.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　為聞法故施其身，　　修諸苦行求菩提，",
        "translation": "They give their bodies for the sake of hearing the Teaching, Cultivating austerities to seek enlightenment.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　復為眾生捨一切，　　求無上智不退轉。",
        "translation": "Again, for the sake of sentient beings, they abandon everything and seek unsurpassed knowledge without turning back.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　以於佛所聞正法，　　自捨其身充給侍，",
        "translation": "Having heard the true teaching from the Buddha, They gave up their bodies to serve him.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　為欲普救諸群生，　　發生無量歡喜心。",
        "translation": "Wanting to save all sentient beings, they develop an immeasurable heart of joy.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　彼見世尊大導師，　　能以慈心廣饒益，",
        "translation": "They see the World-honored One, the Great Guide, Able to give extensive assistance With a compassionate mind.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　是時踊躍生歡喜，　　聽受如來深法味。",
        "translation": "At that point, they dance and become joyous, listening to the Tathāgata's profound flavor of the Dharma.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩所有諸善根，　　悉以迴向諸眾生，",
        "translation": "Enlightening beings’ roots of goodness They dedicate all to sentient beings.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　普皆救護無有餘，　　永使解脫常安樂。",
        "translation": "They rescue and protect all without exception, Always enabling liberation to always be peaceful.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩所有諸眷屬，　　色相端嚴能辯慧，",
        "translation": "All the attendants of enlightening beings Are adorned with form and characteristics, eloquent and wise.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　華鬘衣服及塗香，　　種種莊嚴皆具足。",
        "translation": "Flower garlands, clothes, ointments of fragrance, And various adornments are all present.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　此諸眷屬甚希有，　　菩薩一切皆能施，",
        "translation": "These retinues are rare and rare; Enlightening beings can give them all.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　專求正覺度群生，　　如是之心無暫捨。",
        "translation": "They concentrate on seeking true enlightenment to save all sentient beings, And such minds they don’t give up for a moment.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩如是諦思惟，　　備行種種廣大業，",
        "translation": "Enlightening beings contemplate in this way, Carrying out various vast undertakings:",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　悉以迴向諸含識，　　而不生於取著心。",
        "translation": "They all dedicate themselves to the contained consciousnesses And don’t give rise to minds attached to grasping.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩捨彼大王位，　　及以國土諸城邑，",
        "translation": "Enlightening beings relinquish their royal throne, As well as their lands and cities.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　宮殿樓閣與園林，　　僮僕侍衛皆無吝。",
        "translation": "Palaces, towers, pavilions, and parks— Servants and attendants guard them all without stinginess.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　彼於無量百千劫，　　處處周行而施與，",
        "translation": "For countless hundreds of thousands of eons They travel everywhere, bestowing gifts.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　因以教導諸群生，　　悉使超昇無上岸。",
        "translation": "As a result, they teach all sentient beings and cause them to rise beyond the unexcelled shore.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　無量品類各差別，　　十方世界來萃止，",
        "translation": "Innumerable different kinds, each different, Come from the worlds of the ten directions to assemble.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩見已心欣慶，　　隨其所乏令滿足。",
        "translation": "Enlightening beings, seeing this, are joyful And satisfy whatever is lacking.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　如三世佛所迴向，　　菩薩亦修如是業，",
        "translation": "Like the dedication of the Buddhas of past, present, and future, So do enlightening beings cultivate such practices.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　調御人尊之所行，　　悉皆隨學到彼岸。",
        "translation": "All the practices of the Tamer of Humans, the honored ones, They all follow and study until they reach the other shore.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩觀察一切法，　　誰為能入此法者？",
        "translation": "Enlightening beings observe all things: Who can enter this teaching?",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　云何為入何所入？　　如是布施心無住。",
        "translation": "What is entering and what is entering?",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩迴向善巧智，　　菩薩迴向方便法，",
        "translation": "Enlightening beings’ dedication is based on knowledge of skillful means; Enlightening beings’ dedication is based on the methods of liberation.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩迴向真實義，　　於其法中無所著。",
        "translation": "Enlightening beings dedicate themselves to the true meaning, Without attachment to anything in their teachings.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　心不分別一切業，　　亦不染著於業果，",
        "translation": "Their minds don’t discriminate all actions, Nor are they stained by the results of action.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　知菩提性從緣起，　　入深法界無違逆。",
        "translation": "Knowing that the nature of enlightenment arises from conditions, they enter the profound realm of reality without disobedience.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　不於身中而有業，　　亦不依止於心住，",
        "translation": "They do not have action in their bodies, And they do not dwell on the mind.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　智慧了知無業性，　　以因緣故業不失。",
        "translation": "Wisdom understands that there’s no essence of action: Because of causes and conditions, action isn’t lost.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　心不妄取過去法，　　亦不貪著未來事，",
        "translation": "Their minds don’t falsely grasp past things, And they don’t cling to future affairs.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　不於現在有所住，　　了達三世悉空寂。",
        "translation": "They don’t abide in the present, Understanding that all times are completely void.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩已到色彼岸，　　受想行識亦如是，",
        "translation": "Enlightening beings have already reached the other shore of form, And so are feeling, perception, volition, and consciousness:",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　超出世間生死流，　　其心謙下常清淨。",
        "translation": "Beyond the worldly stream of birth and death, his mind is humble and always pure.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　諦觀五蘊十八界，　　十二種處及己身，",
        "translation": "He observes the five aggregates, eighteen realms, twelve kinds of places, and himself.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　於此一一求菩提，　　體性畢竟不可得。",
        "translation": "Seeking enlightenment here one by one, Their essence is ultimately ungraspable.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　不取諸法常住相，　　於斷滅相亦不著，",
        "translation": "They do not grasp characteristics of things as eternally abiding, And they do not cling to characteristics of annihilation.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　法性非有亦非無，　　業理次第終無盡。",
        "translation": "The nature of dharmas is neither existent nor nonexistent, Yet the order of action and principle never ends.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　不於諸法有所住，　　不見眾生及菩提，",
        "translation": "They don’t abide in anything, Not seeing sentient beings and enlightenment.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　十方國土三世中，　　畢竟求之無可得。",
        "translation": "In the lands of the ten directions and in the three worlds, there's nothing to be obtained after all.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　若能如是觀諸法，　　則如諸佛之所解，",
        "translation": "If one can contemplate things in this way, One will understand them as the Buddhas do.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　雖求其性不可得，　　菩薩所行亦不虛。",
        "translation": "Even though their nature is ungraspable, The practices of enlightening beings are not false.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　菩薩了法從緣有，　　不違一切所行道，",
        "translation": "Enlightening beings understand things are conditioned by conditions; They don’t disobey all the paths they practice.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　開示解說諸業迹，　　欲使眾生悉清淨。",
        "translation": "He reveals and explains the traces of actions, wanting to make sentient beings all pure.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　是為智者所行道，　　一切如來之所說，",
        "translation": "This is the path practiced by the wise, taught by all the enlightened ones.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　隨順思惟入正義，　　自然覺悟成菩提。",
        "translation": "Following contemplation and entering the correct meaning, They naturally awaken and attain enlightenment.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　諸法無生亦無滅，　　亦復無來無有去，",
        "translation": "All things have neither arising nor ceasing, Nor come nor go.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　不於此死而生彼，　　是人解悟諸佛法。",
        "translation": "Not dying here and being born there, this person understands the buddha-dharma.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　了達諸法真實性，　　而於法性無分別，",
        "translation": "Understanding the true nature of all things, Yet they have no discrimination about the essence of things.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　知法無性無分別，　　此人善入諸佛智。",
        "translation": "Knowing things have no essence and no discrimination, this person well enters the Buddha’s knowledge.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　法性遍在一切處，　　一切眾生及國土，",
        "translation": "The essence of reality pervades all places, All sentient beings and lands.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　三世悉在無有餘，　　亦無形相而可得。",
        "translation": "The three worlds are all present without remainder, And can be attained without form or shape.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　一切諸佛所覺了，　　悉皆攝取無有餘，",
        "translation": "All buddhas, perceived by enlightened ones, They embrace all without exception.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　雖說三世一切法，　　如是等法悉非有。",
        "translation": "Even though it's said that all the dharmas of the three times don't exist, such dharmas are completely nonexistent.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　如諸法性遍一切，　　菩薩迴向亦復然，",
        "translation": "Just as the nature of things pervades all, So also does enlightening beings’ dedication.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "　如是迴向諸眾生，　　常於世間無退轉。",
        "translation": "Thus dedicating themselves to sentient beings, they always remain in the world without turning back.",
        "source": "T10n0279_028:0155c25_3"
    },
    {
        "source_sentence": "承佛神力而說頌言：大方廣佛華嚴經卷第二十八",
        "translation": "In response to the Buddha's miraculous powers, he spoke these verses, saying, Dafangguang fo huayan jing, vol. 28",
        "source": "T10n0279_028:0155c25_3"
    }
]