[
    {
        "source_sentence": "大方廣佛華嚴經卷第十三",
        "translation": "Dafangguang fo huayan jing, Volume 13",
        "source": "T10n0293_013:0719b15_0"
    },
    {
        "source_sentence": "罽賓國三藏般若奉　詔譯",
        "translation": "translated by imperial edict of the Tripiṭaka Master Prajñāpāramitā of Kāśmīra",
        "source": "T10n0293_013:0719b17_0"
    },
    {
        "source_sentence": "入不思議解脫境界普賢行願品",
        "translation": "Chapter on the Vows and Practices of Samantabhadra who Enters the Realm of Inconceivable Liberation",
        "source": "T10n0293_013:0719b18_0"
    },
    {
        "source_sentence": "爾時，善財童子一心正念，隨順思惟彼王所得幻智法門，觀察彼王如幻解脫，",
        "translation": "At that time, with one mind concentrated and correctly thinking, Sudhana contemplated the teaching of magical knowledge obtained by the king. He perceived the illusory liberation of the king:",
        "source": "T10n0293_013:0719b19_0"
    },
    {
        "source_sentence": "思惟彼王如幻法性，發如幻願，淨如幻法，悟如幻業，隨順如幻成就之法，",
        "translation": "They contemplate that the king’s illusory dharma-nature is like an illusion, his undertaking of vows is like an illusion, his purity is like an illusion, his enlightenment is like an action created by an illusion, and he follows the principle of illusoriness in order to perfect it.",
        "source": "T10n0293_013:0719b20_1"
    },
    {
        "source_sentence": "出生如幻不思議智，清淨如幻三世性相；",
        "translation": "They are born of inconceivable knowledge that is like illusion, pure as the nature and characteristics of the past, present, and future.",
        "source": "T10n0293_013:0719b22_2"
    },
    {
        "source_sentence": "以如幻智，起於種種如幻變化。",
        "translation": "With illusory cognition, they give rise to various illusory transformations.",
        "source": "T10n0293_013:0719b23_3"
    },
    {
        "source_sentence": "如是思念，漸次前行，經歷人間聚落、城邑。",
        "translation": "Thinking thus, he gradually advances one by one through the towns and cities.",
        "source": "T10n0293_013:0719b24_4"
    },
    {
        "source_sentence": "或至曠野巖谷、險難山川原隰，處處尋求，無有疲懈。",
        "translation": "Or they may go to the wilderness, deep valleys, dangerous mountains, rivers, and plains, seeking everywhere without weariness.",
        "source": "T10n0293_013:0719b25_5"
    },
    {
        "source_sentence": "然後乃至妙光大城，於其門側問眾人言：「此名何城？",
        "translation": "After that, he went up to the great city of Marvelous Light and asked the crowd at its entrance, What's the name of this city?",
        "source": "T10n0293_013:0719b26_6"
    },
    {
        "source_sentence": "何王統御？」",
        "translation": "What king commands it?",
        "source": "T10n0293_013:0719b27_7"
    },
    {
        "source_sentence": "人咸報言：「此妙光城，是大光王之所住處。」",
        "translation": "The people all reported, This city of marvelous light is the dwelling place of King Daegwang.",
        "source": "T10n0293_013:0719b27_8"
    },
    {
        "source_sentence": "時，善財童子歡喜踊躍，志樂清淨。",
        "translation": "The boy Sudhana was delighted and jumped for joy.",
        "source": "T10n0293_013:0719b28_9"
    },
    {
        "source_sentence": "一心瞻慕，作如是念：「我善知識在此城中，我今必當親得奉覲，聞諸菩薩所行之行；",
        "translation": "They looked upon the city with affection and thought, “As my spiritual benefactors are here in the city, I am bound to be able to see them directly and hear about the practice of enlightening beings.",
        "source": "T10n0293_013:0719b29_10"
    },
    {
        "source_sentence": "聞諸菩薩出要之門；",
        "translation": "They heard the enlightening beings’ approaches of emancipation.",
        "source": "T10n0293_013:0719c02_11"
    },
    {
        "source_sentence": "聞諸菩薩所證之法；",
        "translation": "They hear the teachings realized by enlightening beings.",
        "source": "T10n0293_013:0719c02_12"
    },
    {
        "source_sentence": "聞諸菩薩不思議功德；",
        "translation": "They hear the inconceivable virtues of enlightening beings.",
        "source": "T10n0293_013:0719c03_13"
    },
    {
        "source_sentence": "聞諸菩薩不思議自在；",
        "translation": "They hear the enlightening beings’ inconceivable freedom.",
        "source": "T10n0293_013:0719c03_14"
    },
    {
        "source_sentence": "聞諸菩薩不思議平等；",
        "translation": "They hear of the inconceivable equality of enlightening beings.",
        "source": "T10n0293_013:0719c04_15"
    },
    {
        "source_sentence": "聞諸菩薩不思議勇猛；",
        "translation": "They heard of the enlightening beings’ inconceivable boldness.",
        "source": "T10n0293_013:0719c04_16"
    },
    {
        "source_sentence": "聞諸菩薩不思議境界；",
        "translation": "They hear the inconceivable realm of enlightening beings.",
        "source": "T10n0293_013:0719c05_17"
    },
    {
        "source_sentence": "聞諸菩薩不思議法性；",
        "translation": "They hear the enlightening beings’ inconceivable nature of reality.",
        "source": "T10n0293_013:0719c05_18"
    },
    {
        "source_sentence": "聞諸菩薩不思議三昧；",
        "translation": "They hear the inconceivable concentration of enlightening beings.",
        "source": "T10n0293_013:0719c06_19"
    },
    {
        "source_sentence": "聞諸菩薩不思議解脫遊戲；",
        "translation": "They heard the enlightening beings’ inconceivable play of liberation.",
        "source": "T10n0293_013:0719c07_0"
    },
    {
        "source_sentence": "聞諸菩薩不思議廣大清淨。」",
        "translation": "He hears that the bodhisattvas are inconceivably vast and pure.",
        "source": "T10n0293_013:0719c07_1"
    },
    {
        "source_sentence": "作是念已，入妙光城，周遍觀察。",
        "translation": "After he had this thought, he entered the city of Marvelous Light and observed it everywhere.",
        "source": "T10n0293_013:0719c08_2"
    },
    {
        "source_sentence": "見此大城眾寶嚴飾，以金銀、瑠璃、玻瓈、赤珠、硨磲、碼碯七寶所成，",
        "translation": "They saw that the great city was adorned with all kinds of jewels, made of the seven treasures of gold, silver, lapis lazuli, crystal, ruby, emerald, and jade.",
        "source": "T10n0293_013:0719c09_3"
    },
    {
        "source_sentence": "七重寶塹，周匝圍遶。",
        "translation": "It is surrounded by seven-story moats of jewels.",
        "source": "T10n0293_013:0719c10_4"
    },
    {
        "source_sentence": "八功德水盈滿其中，底布金沙，光明照耀。",
        "translation": "The water of the eight kinds of virtue fills it, and its bottom is covered with golden sand that shines brilliantly.",
        "source": "T10n0293_013:0719c11_5"
    },
    {
        "source_sentence": "優鉢羅華、波頭摩華、拘物頭華、芬陀利華遍布其上。",
        "translation": "Upāla flowers, Padma flowers, Kuśinagara flowers, and Puṇḍarīka flowers spread all over it.",
        "source": "T10n0293_013:0719c12_6"
    },
    {
        "source_sentence": "其水清徹，隨時溫涼。",
        "translation": "The water is clear and permeable and warm and cool at all times.",
        "source": "T10n0293_013:0719c13_7"
    },
    {
        "source_sentence": "白栴檀泥，澄垽其下。",
        "translation": "White sandalwood mud, which is pure and clear, flows under it.",
        "source": "T10n0293_013:0719c13_8"
    },
    {
        "source_sentence": "其水隨泥，如栴檀色。",
        "translation": "The water follows the mud, which is like the color of sandalwood.",
        "source": "T10n0293_013:0719c14_9"
    },
    {
        "source_sentence": "寶多羅樹七重行列，枝葉繁茂蓊欝莊嚴。",
        "translation": "The jeweled palm trees stood in seven rows in great arrays with luxuriant branches and leaves.",
        "source": "T10n0293_013:0719c14_10"
    },
    {
        "source_sentence": "七重金剛以為垣牆，所謂：師子光明金剛垣、無能超勝金剛垣、不可沮壞金剛垣、精進難伏金剛垣、堅固無著金剛垣、天衣網藏金剛垣、無垢妙色金剛垣。",
        "translation": "The seven-storied vajra walls were made of seven kinds of diamond: the so-called adamantine wall of lion light, the unsurpassable adamantine wall, the indestructible adamantine wall, the indestructible adamantine wall, the indestructible adamantine wall of effort, the indestructible adamantine wall, the indestructible adaman",
        "source": "T10n0293_013:0719c15_11"
    },
    {
        "source_sentence": "如是七重一一圍遶，悉以無數摩尼妙寶間錯莊嚴。",
        "translation": "Each of these seven rings is surrounded by an array of countless maṇi jewels.",
        "source": "T10n0293_013:0719c19_12"
    },
    {
        "source_sentence": "閻浮檀金種種眾寶而為埤堄，金銀、瑠璃、赤珠、碼碯、玻瓈、海藏真珠等寶以為嚴飾。",
        "translation": "Jambudvīpa's gold is adorned with various treasures, such as gold, silver, lapis lazuli, red pearl, emerald, crystal, and the true pearl of the ocean store.",
        "source": "T10n0293_013:0719c20_13"
    },
    {
        "source_sentence": "其城縱廣一十由旬，周迴八方，面開八門，皆以七寶周遍嚴飾。",
        "translation": "The city was one ten yojanas long and wide, eight square in all directions, with eight gates facing each other. All the walls were beautifully adorned with the seven kinds of treasure.",
        "source": "T10n0293_013:0719c22_14"
    },
    {
        "source_sentence": "帝青瑠璃以為其地，眾色雜寶隨處莊嚴。",
        "translation": "The earth is made of lapis lazuli and adorned everywhere with various colors and jewels.",
        "source": "T10n0293_013:0719c24_0"
    },
    {
        "source_sentence": "種種珍奇，甚可愛樂。",
        "translation": "Various kinds of rare treasures are very attractive and pleasing.",
        "source": "T10n0293_013:0719c25_0"
    },
    {
        "source_sentence": "其城內有十億街道，一一道邊，安布妙寶以為莊嚴。",
        "translation": "Within the city there were billions of streets, one by one adorned with exquisite jewels.",
        "source": "T10n0293_013:0719c25_1"
    },
    {
        "source_sentence": "過天帝釋所遊之路，一一道間皆有無數萬億眾生於中止住。",
        "translation": "Innumerable myriads of koṭis of sentient beings stayed at the monastery in each direction, passing past the path traveled by Śakra.",
        "source": "T10n0293_013:0719c26_2"
    },
    {
        "source_sentence": "無數百千廣大宮殿，一一皆以眾寶合成。",
        "translation": "Countless hundreds of thousands of vast palaces were built, each one made of various treasures.",
        "source": "T10n0293_013:0719c28_3"
    },
    {
        "source_sentence": "復有無數不思議閻浮檀金樓閣，帝青瑠璃摩尼寶網羅覆其上；",
        "translation": "There were also innumerable golden towers of inconceivable Jambudvipa, covered with nets of lapis lazuli jewels.",
        "source": "T10n0293_013:0719c29_4"
    },
    {
        "source_sentence": "無數不思議白銀樓閣，赤真珠摩尼寶網羅覆其上；",
        "translation": "Countless inconceivable white silver towers were built, covered with nets of red genuine pearls and jewels.",
        "source": "T10n0293_013:0720a01_5"
    },
    {
        "source_sentence": "無數不思議毘瑠璃樓閣，廣博妙藏摩尼寶網羅覆其上；",
        "translation": "Countless inconceivable towers of lapis lazuli, covered with wide and extensive nets of jewels from mysterious mines.",
        "source": "T10n0293_013:0720a02_6"
    },
    {
        "source_sentence": "無數不思議玻瓈樓閣，日藏摩尼王網羅覆其上；",
        "translation": "Countless inconceivable crystal towers were built, covered with nets of sun-stored diamonds.",
        "source": "T10n0293_013:0720a04_7"
    },
    {
        "source_sentence": "無數不思議光照世間摩尼寶樓閣，吉祥光藏摩尼王網羅覆其上；",
        "translation": "Countless jewel towers of inconceivable light illumining the world, covered with networks of jewel kings from the mine of auspicious light.",
        "source": "T10n0293_013:0720a05_8"
    },
    {
        "source_sentence": "無數不思議帝青摩尼寶王樓閣，妙光摩尼王網羅覆其上；",
        "translation": "Countless inconceivable towers of sapphire-jeweled diamonds were built, covered with nets of jewels of exquisite light.",
        "source": "T10n0293_013:0720a06_9"
    },
    {
        "source_sentence": "無數不思議眾生海藏摩尼寶王樓閣，焰光明藏摩尼王網羅覆其上；",
        "translation": "Countless inconceivable numbers of myriad jewels from the ocean of sentient beings were stored in towers, covered by nets of jewels from mines of flame and light.",
        "source": "T10n0293_013:0720a08_10"
    },
    {
        "source_sentence": "無數不思議金剛寶王樓閣，無能勝幢摩尼王網羅覆其上；",
        "translation": "Countless, inconceivable numbers of the towers of the diamond-jewel kings were built, covered with unrivaled banners and jewel nets.",
        "source": "T10n0293_013:0720a09_11"
    },
    {
        "source_sentence": "無數不思議栴檀香王樓閣，天曼陀羅華摩訶曼陀羅華網羅覆其上；",
        "translation": "Countless inconceivable towers of the sandalwood-incense king, covered with nets of celestial maṇḍala flowers and mahāmandārava flowers.",
        "source": "T10n0293_013:0720a11_12"
    },
    {
        "source_sentence": "無數不思議無等香王樓閣，種種華網羅覆其上。",
        "translation": "Countless, inconceivable, unequalled towers of the fragrance kings are covered with various kinds of webs of flowers.",
        "source": "T10n0293_013:0720a12_13"
    },
    {
        "source_sentence": "有如是等無數不思議種種莊嚴妙寶樓閣，種種寶網羅覆其上。",
        "translation": "There are countless such inconceivable and variously adorned towers of marvelous jewels, covered with webs of various jewels.",
        "source": "T10n0293_013:0720a14_0"
    },
    {
        "source_sentence": "一一樓閣，眾寶欄楯周匝圍遶；",
        "translation": "Each tower was surrounded by railings made of various precious substances.",
        "source": "T10n0293_013:0720a15_1"
    },
    {
        "source_sentence": "寶多羅樹，次第行列，皆以寶繩而為界道。",
        "translation": "The jeweled palm trees lined up one after another in rows, all with jeweled strings forming the boundary.",
        "source": "T10n0293_013:0720a16_2"
    },
    {
        "source_sentence": "一一寶繩，懸以金鈴；",
        "translation": "Each jeweled rope was hung with a golden bell.",
        "source": "T10n0293_013:0720a17_3"
    },
    {
        "source_sentence": "一一金鈴，眾寶鬘絡，如孔雀尾，異色端嚴，風動成音，聞之可意。",
        "translation": "Each one of the golden bells is endowed with various treasures, resembling the tail of a peacock. The bells are beautifully shaped and blown by the wind to make sounds pleasing to the hearers.",
        "source": "T10n0293_013:0720a17_4"
    },
    {
        "source_sentence": "其城復有阿僧祇摩尼寶網、阿僧祇寶鈴網、阿僧祇天香網、阿僧祇天華網，",
        "translation": "In that city there was also an infinite network of jewel nets, an infinite network of bells, an infinite network of celestial fragrances, and an infinite network of celestial flowers.",
        "source": "T10n0293_013:0720a19_5"
    },
    {
        "source_sentence": "阿僧祇寶形像網。",
        "translation": "It's a net of incalculable jeweled forms and images.",
        "source": "T10n0293_013:0720a20_6"
    },
    {
        "source_sentence": "其城復有阿僧祇金剛帳、阿僧祇寶衣帳、阿僧祇寶蓋帳、阿僧祇寶幡帳、阿僧祇寶山帳、阿僧祇寶華鬘帳、阿僧祇寶樓閣帳之所彌覆，",
        "translation": "The city was also covered with an assembly of incalculable numbers of diamond curtains, an assembly of incalculable numbers of jewel robe curtains, an assembly of incalculable numbers of jewel canopies, an assembly of incalculable numbers of jewel pennants, an assembly of incalculable numbers of jewel mountain curta",
        "source": "T10n0293_013:0720a21_7"
    },
    {
        "source_sentence": "處處羅列寶蓋幢幡。",
        "translation": "Everywhere, it's lined with jeweled canopies, banners, and streamers.",
        "source": "T10n0293_013:0720a24_8"
    },
    {
        "source_sentence": "城中寶池，德水盈滿；",
        "translation": "In the city there was a jeweled pond, full of virtuous water.",
        "source": "T10n0293_013:0720a24_9"
    },
    {
        "source_sentence": "底布金沙，光映內外；",
        "translation": "The floor was covered with golden sand, shining inside and out.",
        "source": "T10n0293_013:0720a25_10"
    },
    {
        "source_sentence": "天諸妙華，敷榮其上；",
        "translation": "The heavenly flowers flourish above it.",
        "source": "T10n0293_013:0720a25_11"
    },
    {
        "source_sentence": "天諸寶鳥，浮戲其中，出和雅音，悅可人意；",
        "translation": "The gods and other jeweled birds floated there, playing with harmonious voices pleasing people’s minds.",
        "source": "T10n0293_013:0720a26_12"
    },
    {
        "source_sentence": "池岸階砌，七寶莊嚴，帝釋寶池，無以為比。",
        "translation": "The shore of the pond was built in seven kinds of jewels and adorned with staircases made of the seven kinds of treasure. There was also Indra’s pond, which was incomparable to compare.",
        "source": "T10n0293_013:0720a27_13"
    },
    {
        "source_sentence": "當此城中有一樓閣，名妙法藏，阿僧祇種種色寶以為莊嚴，光明照耀，",
        "translation": "In this city there was a tower called the “treasury of the fine Teaching,” adorned with incalculable numbers of various colors and jewels, shining brilliantly.",
        "source": "T10n0293_013:0720a28_14"
    },
    {
        "source_sentence": "最勝無比，眾生樂見，心無厭足，彼大光王，常處其中。",
        "translation": "It is the most superior and incomparable. All sentient beings delight in seeing it but their minds are never satisfied. That great king of light always abides there.",
        "source": "T10n0293_013:0720b01_0"
    },
    {
        "source_sentence": "爾時，善財童子於彼大城妙寶樓閣、寶池、寶塹、寶樹、寶牆、寶蓋、寶幢、寶鈴、寶網如是一切珍寶妙物，",
        "translation": "“At that time, in the great city Sudhana, there was a jeweled tower, a pond, a moat, a tree, a wall, a canopy, a banner, a bell, a net, and other such treasures.",
        "source": "T10n0293_013:0720b03_0"
    },
    {
        "source_sentence": "受用資具，乃至男女六塵境界皆無愛著；",
        "translation": "They receive and use necessities, up to the realm of the six dust motes of men and women, without attachment.",
        "source": "T10n0293_013:0720b05_1"
    },
    {
        "source_sentence": "唯於正法園苑之中，深心渴慕，但正思惟究竟之法，一心願樂見善知識。",
        "translation": "They are deeply attached to the park of the true teaching, but they correctly contemplate the ultimate teaching and singlemindedly wish to see a good teacher.",
        "source": "T10n0293_013:0720b06_2"
    },
    {
        "source_sentence": "漸漸前行，普遍觀察，見大光王去於所住樓閣不遠四衢道中，坐如意摩尼寶蓮華藏廣大莊嚴師子寶座。",
        "translation": "Going gradually, he observed everywhere and saw King Mahāprajāpaṅkuṇḍa sitting on a lion seat of wish-granting jeweled lotus treasures in the vast array adorned lotus treasury storehouse at the four corners of the road not far from the tower where he was staying.",
        "source": "T10n0293_013:0720b07_3"
    },
    {
        "source_sentence": "紺瑠璃寶以為其足；",
        "translation": "Their feet were made of lapis lazuli jewels.",
        "source": "T10n0293_013:0720b10_4"
    },
    {
        "source_sentence": "金繒為帳；",
        "translation": "A curtain of gold is the canopy.",
        "source": "T10n0293_013:0720b10_5"
    },
    {
        "source_sentence": "眾寶為網；",
        "translation": "A network of myriad jewels is a net.",
        "source": "T10n0293_013:0720b11_6"
    },
    {
        "source_sentence": "閻浮金繩交絡嚴飾上妙天衣，以為茵蓐，四布敷設阿僧祇妙寶形像，隨處莊嚴。",
        "translation": "Jambudvīpa is decorated with golden cords interlocking and adorned with exquisite celestial robes, which are made into cushions. The fourfold cloth spreads the innumerable beautiful jewel images that adorn themselves everywhere.",
        "source": "T10n0293_013:0720b11_7"
    },
    {
        "source_sentence": "其王具有三十二種大人之相，八十隨好而以嚴身。",
        "translation": "The king possessed the thirty-two marks of greatness and adorned his body with eighty secondary signs.",
        "source": "T10n0293_013:0720b13_8"
    },
    {
        "source_sentence": "如真金山，光色熾盛；",
        "translation": "It is like a mountain of pure gold, shining brilliantly and blazing brightly.",
        "source": "T10n0293_013:0720b14_9"
    },
    {
        "source_sentence": "如淨空日，威光赫奕；",
        "translation": "It was like the pure, empty sun shining brilliantly with its mighty luster.",
        "source": "T10n0293_013:0720b15_0"
    },
    {
        "source_sentence": "如盛滿月，見者清涼，心無厭足；",
        "translation": "It is like the full moon that flourishes; those who see it are cool and refreshed, their minds never wearying of it.",
        "source": "T10n0293_013:0720b15_1"
    },
    {
        "source_sentence": "如梵天王，處於梵眾，威德殊勝；",
        "translation": "He is like the king of the Brahma heavens, who resides in the assembly of Brahmā gods and enjoys preeminent power.",
        "source": "T10n0293_013:0720b16_2"
    },
    {
        "source_sentence": "亦如大海，聚功德寶，無量無邊；",
        "translation": "It is also like the great ocean, a mass of jewels of virtue immeasurable and limitless.",
        "source": "T10n0293_013:0720b16_3"
    },
    {
        "source_sentence": "亦如大雲，遍法性空，法雷震吼；",
        "translation": "It is also like a great cloud pervading the space of the essence of things, thunder and roar of the lightning of truth.",
        "source": "T10n0293_013:0720b17_4"
    },
    {
        "source_sentence": "如淨空界，顯現種種法門星象；",
        "translation": "Like the pure realm of space, he manifested various stars and moon images of teaching.",
        "source": "T10n0293_013:0720b18_5"
    },
    {
        "source_sentence": "如雪山王，相好樹林以為嚴飾；",
        "translation": "They are like the king of the Himalayas, adorned with beautiful features such as trees and forests.",
        "source": "T10n0293_013:0720b19_6"
    },
    {
        "source_sentence": "如須彌山，四色普現眾生心海；",
        "translation": "Like Mount Sumeru, the four colors manifested the ocean of minds of sentient beings everywhere.",
        "source": "T10n0293_013:0720b19_7"
    },
    {
        "source_sentence": "如寶洲渚，種種智寶充滿其中。",
        "translation": "It's like a jeweled island, filled with various treasures of wisdom.",
        "source": "T10n0293_013:0720b20_8"
    },
    {
        "source_sentence": "於王座前復有無量金銀、瑠璃、真珠、摩尼、珊瑚、琥珀、珂貝、璧玉諸珍寶聚，",
        "translation": "In front of the king’s throne there was also an immeasurable heap of gold, silver, lapis lazuli, pearls, maṇi jewels, coral, ambrosia, crystal, and other precious treasures.",
        "source": "T10n0293_013:0720b21_9"
    },
    {
        "source_sentence": "種種寶衣、華鬘、瓔珞及諸飲食皆悉充滿。",
        "translation": "Various kinds of precious robes, flower garlands, jewelry, and food and drink were all filled.",
        "source": "T10n0293_013:0720b22_10"
    },
    {
        "source_sentence": "復見無數百千萬億駟馬寶車，百千萬億天諸妓樂，百千萬億天諸妙香，",
        "translation": "They also saw innumerable hundreds of thousands of myriads of koṭis of trillions of jeweled carriages drawn from horses and horses, with hundreds of thousands of myriads of koṭis of celestial drums playing heavenly music.",
        "source": "T10n0293_013:0720b23_11"
    },
    {
        "source_sentence": "百千萬億病緣湯藥，無數乳牛蹄角金色，無數千億端正女人。",
        "translation": "There were hundreds of thousands of myriads of koṭis of medicines for treating illnesses, countless milk ox horns and horns golden in color, and countless millions of handsome women.",
        "source": "T10n0293_013:0720b25_12"
    },
    {
        "source_sentence": "上妙栴檀以塗其體，天衣瓔珞種種莊嚴，六十四能靡不該練，儀範禮則，",
        "translation": "Their bodies are embellished with the finest sandalwood, adorned with celestial robes and jewelry, variously adorned in sixty-four different ways. All of them can be trained without fail, according to proper etiquette.",
        "source": "T10n0293_013:0720b27_0"
    },
    {
        "source_sentence": "悉皆善知。",
        "translation": "They are all well-understood.",
        "source": "T10n0293_013:0720b28_1"
    },
    {
        "source_sentence": "隨眾生心，而以給施；",
        "translation": "They give according to the mentalities of sentient beings.",
        "source": "T10n0293_013:0720b29_0"
    },
    {
        "source_sentence": "城邑、聚落四衢道側，相次陳列，福舍義堂，滿二十億。",
        "translation": "The towns and villages are situated beside each other at the four crossroads, one after the other in an orderly fashion. The houses of blessing and the halls of doctrine occupy twenty billion square yojanas.",
        "source": "T10n0293_013:0720b29_1"
    },
    {
        "source_sentence": "安置一切珍寶妙物及諸飲食，充滿其中。",
        "translation": "He placed all the rare treasures, marvelous things, and food and drink in it to fill it.",
        "source": "T10n0293_013:0720c01_2"
    },
    {
        "source_sentence": "一一道傍有二十億諸大菩薩，以此諸物惠施眾生，令無所乏。",
        "translation": "On each side of the one path were two billion great bodhisattvas, who gave these things to sentient beings so that they didn't lack anything.",
        "source": "T10n0293_013:0720c02_3"
    },
    {
        "source_sentence": "為欲攝受諸眾生故，為欲發起一切眾生愛敬心故，為欲發起一切眾生歡喜心故，",
        "translation": "Because they want to receive sentient beings, because they want to give rise to affection and respect for all sentient beings, and because they want to give rise to joy for all sentient beings.",
        "source": "T10n0293_013:0720c04_4"
    },
    {
        "source_sentence": "為欲發起一切眾生踊躍心故，為欲清淨一切眾生正信心故，為令眾生心清涼故，",
        "translation": "Because they want to give rise to the minds of all sentient beings, because they want to purify the right faith of all sentient beings, and because they want to cause sentient beings’ minds to be pure and cool.",
        "source": "T10n0293_013:0720c06_5"
    },
    {
        "source_sentence": "為令眾生除愛熱故，為令眾生息煩惱故，為令眾生解真實故，為令眾生入種智故，",
        "translation": "It is to cause sentient beings to be rid of the burning fire of craving, to cause sentient beings to extinguish afflictions, to cause sentient beings to understand reality, and to cause sentient beings to enter the knowledge of the seeds.",
        "source": "T10n0293_013:0720c08_6"
    },
    {
        "source_sentence": "為令眾生捨怨敵故，為令眾生離諸惡故，為令眾生拔邪見故，為令眾生淨諸業故。",
        "translation": "It's to cause sentient beings to abandon enemies, to cause sentient beings to be free of badness, to cause sentient beings to remove wrong views, and to cause sentient beings to purify their actions.",
        "source": "T10n0293_013:0720c10_7"
    },
    {
        "source_sentence": "時，善財童子五體投地，頂禮王足，遶無數匝，合掌而立，白言：「聖者！",
        "translation": "Then Sudhana went up to the king’s feet, paid his respects, and said:",
        "source": "T10n0293_013:0720c13_0"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行、修菩薩道；",
        "translation": "I have set my mind on unexcelled complete perfect enlightenment, but I do not know how an enlightening being is to learn and carry out the practice of enlightening beings.",
        "source": "T10n0293_013:0720c14_1"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說。」",
        "translation": "I've heard that the noble one is good at encouraging, so please tell me about it.",
        "source": "T10n0293_013:0720c16_2"
    },
    {
        "source_sentence": "時，王告言：「善男子！",
        "translation": "The king then told him, Good man!",
        "source": "T10n0293_013:0720c18_0"
    },
    {
        "source_sentence": "我得淨修菩薩大慈幢行解脫門，清淨滿足。",
        "translation": "I've attained the liberation gate of purely cultivating the practice of the bodhisattva's great compassionate banner, which is pure and fulfilled.",
        "source": "T10n0293_013:0720c18_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0720c19_2"
    },
    {
        "source_sentence": "我於無量百千萬億乃至不可說不可說佛所，親近聽聞，問難此法，隨順思惟，",
        "translation": "In the company of innumerable hundreds of thousands of myriads of koṭis of buddhas, up to untold numbers of buddhas, I approached and listened to them. Asking questions about this doctrine, I pondered accordingly.",
        "source": "T10n0293_013:0720c19_3"
    },
    {
        "source_sentence": "審諦觀察，清淨悟入，修習莊嚴。",
        "translation": "He examines, observes, purifies, awakens, enters, and cultivates adornment.",
        "source": "T10n0293_013:0720c21_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0720c22_5"
    },
    {
        "source_sentence": "我以此法為王，以此法教勅，以此法攝受，以此法隨逐世間，以此法興行政化，",
        "translation": "Because of this doctrine I am the king, and because of this doctrine I teach. Because of this doctrine I embrace it; because of this doctrine I follow the world; because of this doctrine I lead and inspire people.",
        "source": "T10n0293_013:0720c22_6"
    },
    {
        "source_sentence": "以此法調伏眾生，以此法引導眾生，以此法憐愍眾生，以此法安慰眾生，",
        "translation": "They discipline sentient beings by these teachings, lead sentient beings by these teachings, have compassion for sentient beings by these teachings, and comfort sentient beings by these teachings.",
        "source": "T10n0293_013:0720c24_7"
    },
    {
        "source_sentence": "以此法運載眾生，以此法令眾生趣入，以此法令眾生修行，以此法與眾生方便，",
        "translation": "Because of these teachings they carry sentient beings; because of these teachings they cause sentient beings to enter and enter. Because of these teachings they enable sentient beings to practice, and because of these teachings they provide means for sentient beings.",
        "source": "T10n0293_013:0720c25_8"
    },
    {
        "source_sentence": "以此法令眾生思惟諸法究竟實性，以此法令眾生安住大慈；",
        "translation": "By this they cause sentient beings to contemplate the ultimate reality of all things. By this they cause sentient beings to abide in great compassion.",
        "source": "T10n0293_013:0720c27_9"
    },
    {
        "source_sentence": "以慈為主，具足慈力。",
        "translation": "Because kindness is the main focus, he's endowed with the power of kindness.",
        "source": "T10n0293_013:0720c29_0"
    },
    {
        "source_sentence": "如是令住利益心、安樂心、哀愍心、攝受心、守護眾生心、常不捨離心、拔眾生苦無休息心、代諸眾生恒受苦心、令諸眾生住安樂心。",
        "translation": "Thus, it causes them to abide in the mind of benefiting sentient beings, the mind of peace and comfort, the mind of pity, the mind of taking in sentient beings, the mind of guarding sentient beings, the mind of always not abandoning sentient beings, the mind that removes the suffering of sentient beings without resting, the mind that constantly experiences pain",
        "source": "T10n0293_013:0720c29_1"
    },
    {
        "source_sentence": "為令眾生捨離一切障蓋、纏縛，得自在故；",
        "translation": "It is to cause sentient beings to be freed from all hindrances and binding fetters, attaining freedom.",
        "source": "T10n0293_013:0721a03_2"
    },
    {
        "source_sentence": "為令眾生究竟安樂，於諸眾生得自在故；",
        "translation": "In order to cause sentient beings to ultimately attain peace and comfort, they attain mastery over all sentient beings.",
        "source": "T10n0293_013:0721a04_3"
    },
    {
        "source_sentence": "為令眾生永斷如草蔓莚，滋長生死心故；",
        "translation": "It is to cause sentient beings to be forever annihilated, like the grass that grows on a vine, because it nourishes the thought of birth and death.",
        "source": "T10n0293_013:0721a05_4"
    },
    {
        "source_sentence": "為令眾生永斷如河相續，流注結使心故；",
        "translation": "It is to cause sentient beings to be forever annihilated, like the stream of a river: because it flows out in order to foster thought.",
        "source": "T10n0293_013:0721a06_5"
    },
    {
        "source_sentence": "為令眾生永斷煩惱習氣心故；",
        "translation": "It is to cause sentient beings to permanently eliminate the habit energy of afflictions.",
        "source": "T10n0293_013:0721a07_6"
    },
    {
        "source_sentence": "為令眾生住於法性寂靜心故；",
        "translation": "It is to cause sentient beings to abide in the tranquil mind of the essence of reality.",
        "source": "T10n0293_013:0721a08_0"
    },
    {
        "source_sentence": "為令眾生永息一切不善法故；",
        "translation": "It is to cause sentient beings to cease all unwholesome states forever.",
        "source": "T10n0293_013:0721a08_1"
    },
    {
        "source_sentence": "為令眾生截生死流，入法流故；",
        "translation": "In order to cause sentient beings to cut off the stream of birth and death, they enter the flow of the Teaching.",
        "source": "T10n0293_013:0721a09_2"
    },
    {
        "source_sentence": "為令眾生入深法界，心無退轉；",
        "translation": "In order to cause sentient beings to enter the profound realm of reality, their minds never regressing.",
        "source": "T10n0293_013:0721a10_3"
    },
    {
        "source_sentence": "以智慧火，燒煩惱薪，永斷一切五道生處，具菩薩行，向一切智，心海清淨，",
        "translation": "With the fire of wisdom they burn the firewood of defilement and permanently eliminate all states of existence in the five realms of rebirth. Endowed with practices of enlightening beings, they proceed toward omniscience; their ocean of minds is pure:",
        "source": "T10n0293_013:0721a10_4"
    },
    {
        "source_sentence": "無諸濁亂，信力堅固，諸天、魔、梵、沙門、婆羅門、人與非人所不能動。",
        "translation": "They are free from turbidity and confusion, have strong faith, and cannot be disturbed by gods, Māra, Brahmā, ascetics, śramaṇas, brāhmaṇas, or humans or nonhumans.",
        "source": "T10n0293_013:0721a12_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721a14_0"
    },
    {
        "source_sentence": "我住如是大慈幢行解脫門故，能以正法教化世間。",
        "translation": "Because I abide in the liberation gate of thus practicing the great banner of compassion, I can teach and transform the world with the right teaching.",
        "source": "T10n0293_013:0721a14_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721a15_2"
    },
    {
        "source_sentence": "我國土中一切眾生，皆於我所無有恐怖。",
        "translation": "All the sentient beings in my land have no fear of me.",
        "source": "T10n0293_013:0721a15_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721a16_4"
    },
    {
        "source_sentence": "若有一切貧乏眾生，裸露飢羸來至我所。",
        "translation": "Suppose there are all poor sentient beings who come to me naked and hungry.",
        "source": "T10n0293_013:0721a16_5"
    },
    {
        "source_sentence": "或求衣服，或求飲食，乃至求索一切所須受用之物，我開庫藏示令知見，",
        "translation": "They may ask for clothing or food and drink, or they may ask for all the things they need to be used. I open their stores and let them know and see.",
        "source": "T10n0293_013:0721a17_6"
    },
    {
        "source_sentence": "而告之言：『汝等昔來為此財寶造十不善種種惡業，由是業故貧窮、裸露、衣食不充。",
        "translation": "He told them, 'In the past, you created ten unwholesome and various bad actions for this treasure of possessions, and because of these actions you were poor, naked, and inadequate in food and clothing.",
        "source": "T10n0293_013:0721a19_7"
    },
    {
        "source_sentence": "我於今者悉施，汝等恣意取之。",
        "translation": "Now, I'll give them all to you, and you can take them at will.",
        "source": "T10n0293_013:0721a21_8"
    },
    {
        "source_sentence": "既自充足，隨力修行，莫造諸惡，莫害眾生，莫起諸見，莫生執著。",
        "translation": "Since they are self-sufficient, they cultivate it according to their strength and don't create evil, harm sentient beings, give rise to views, or become attached to them.",
        "source": "T10n0293_013:0721a21_9"
    },
    {
        "source_sentence": "汝等貧乏，若有所須，當來我所及四衢道二十億處義堂福舍，一切財寶種種具足。",
        "translation": "If you are poor and needy, if you have anything to ask for, I will give it to you, along with the two billion meaningful places on the four sides of the road, twenty-one hundred million halls of blessedness, all endowed with various possessions and treasures.",
        "source": "T10n0293_013:0721a23_10"
    },
    {
        "source_sentence": "汝隨意取，勿生疑難。』",
        "translation": "Take it as you wish, and don't have any doubts or difficulties.'",
        "source": "T10n0293_013:0721a25_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721a25_12"
    },
    {
        "source_sentence": "此妙光城所住眾生，皆是菩薩發大乘意，行大乘行。",
        "translation": "The sentient beings living in this city of marvelous light are all bodhisattvas who give rise to the intention for the great vehicle and practice the great vehicle.",
        "source": "T10n0293_013:0721a25_13"
    },
    {
        "source_sentence": "於諸眾生起大悲心，普遍清淨，隨心所欲，所見不同。",
        "translation": "He generates great compassion toward sentient beings, universally pure, and sees differently according to their desires.",
        "source": "T10n0293_013:0721a27_14"
    },
    {
        "source_sentence": "或見此城其量狹小，或見此城其量廣大，或見此城土沙為地，或見瑠璃眾摩尼寶以為其地，",
        "translation": "Some see the city as small in size, some see the city as large in size, some see the soil of the city as dirt, and some see the earth as lapis lazuli with its many jewels.",
        "source": "T10n0293_013:0721a28_15"
    },
    {
        "source_sentence": "或見垣牆聚土成立，或無能勝金剛所成，或見其地高下不平，或見其地平坦如掌，",
        "translation": "They may see walls built of lumps of dirt, or they may see that the earth is made of peerless diamond. Or they may see that the ground is uneven and uneven; or they may see that the ground is as flat as a palm.",
        "source": "T10n0293_013:0721b01_16"
    },
    {
        "source_sentence": "或見屋宅土木所成，或見殿堂眾寶嚴飾，及諸樓閣、階墀、窓闥、軒檻、戶牖，",
        "translation": "They may see houses made of earthenware, or they may see halls adorned with various jewels, or they may see towers, staircases, windows, walls, beams, doors, and windows.",
        "source": "T10n0293_013:0721b03_17"
    },
    {
        "source_sentence": "如是一切無非妙寶。",
        "translation": "Thus, all these things are nothing but marvelous treasures.",
        "source": "T10n0293_013:0721b05_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721b06_0"
    },
    {
        "source_sentence": "若有眾生其心清淨，曾種善根，供養諸佛，發心趣向一切智道，以一切智為歸依處，",
        "translation": "If there are any sentient beings whose minds are pure, who have planted roots of goodness in the past and honored buddhas, who have set their minds on the path of omniscience and take omniscience as their refuge,",
        "source": "T10n0293_013:0721b06_1"
    },
    {
        "source_sentence": "及我昔時修菩薩行，以四攝事，曾所攝受，則見此城，具足眾寶，清淨莊嚴，",
        "translation": "And when I cultivated the practice of enlightening beings in the past, taking care of them by means of the four methods of salvation, I saw that this city was replete with all kinds of jewels and pure adornments.",
        "source": "T10n0293_013:0721b08_2"
    },
    {
        "source_sentence": "餘皆見穢。",
        "translation": "The others all see defilement.",
        "source": "T10n0293_013:0721b09_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721b11_0"
    },
    {
        "source_sentence": "此國土中一切眾生，五濁世時，隨本業習，樂造諸惡，我起憐愍，攝受彼心，",
        "translation": "When all the sentient beings in this land are born in the five turbid worlds, they delight in doing evil according to their original karma and habits. I feel pity for them and take care of their minds.",
        "source": "T10n0293_013:0721b11_1"
    },
    {
        "source_sentence": "而欲救護。",
        "translation": "They want to save and protect them.",
        "source": "T10n0293_013:0721b12_2"
    },
    {
        "source_sentence": "入於菩薩大慈為首，隨順世間大三昧門。",
        "translation": "He enters the great compassion of the bodhisattva as the leader and follows the great mundane samādhi approach.",
        "source": "T10n0293_013:0721b13_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721b14_0"
    },
    {
        "source_sentence": "我當入此三昧門時，彼諸眾生所有怖畏心、惱害心、怨敵心、諍論心，",
        "translation": "“When I enter this concentration, all those sentient beings’ minds of fear, anger, hatred, hostility, and divisiveness will become frightened.",
        "source": "T10n0293_013:0721b14_1"
    },
    {
        "source_sentence": "如是諸心，悉自銷滅。",
        "translation": "All these minds are completely extinguished on their own.",
        "source": "T10n0293_013:0721b15_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0293_013:0721b16_3"
    },
    {
        "source_sentence": "入於菩薩大慈為首，順世三昧本性功能，法如是故。",
        "translation": "Entering is led by the bodhisattva's great compassion, which follows the original nature of worldly samādhi and its abilities, because it's like this in principle.",
        "source": "T10n0293_013:0721b16_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0721b17_5"
    },
    {
        "source_sentence": "且待須臾，自當得見。」",
        "translation": "In a moment, they'll see it for themselves.",
        "source": "T10n0293_013:0721b17_6"
    },
    {
        "source_sentence": "時，大光王即入此定，其城內外六種震動，寶地、寶牆、寶堂、寶殿、臺觀、樓閣、階砌、戶牖，",
        "translation": "Then the great king Mahāprajāpaṇa entered this state of absorption. The city quaked in six ways inside and without, thus shaking its walls, halls, terraces, pavilions, towers, storeys, doors, windows, and staircases.",
        "source": "T10n0293_013:0721b18_7"
    },
    {
        "source_sentence": "如是一切，互相衝擊，悉向於王，咸作曲躬敬禮之像，咸出妙音稱讚王德。",
        "translation": "In this way, they all shook each other and faced the king. All bowed to him in reverence and produced beautiful sounds praising the king’s virtue.",
        "source": "T10n0293_013:0721b20_8"
    },
    {
        "source_sentence": "其城內外所有人民靡不同時歡喜踊躍，俱來王所，投地頂禮。",
        "translation": "All the people inside and outside the city all rejoiced and jumped for joy. They came to the king’s presence and prostrated themselves on the ground, bowing their heads in reverence.",
        "source": "T10n0293_013:0721b21_9"
    },
    {
        "source_sentence": "近王所住鳥獸之屬，互相瞻視，起慈悲心，咸向王前恭敬禮拜。",
        "translation": "The birds and animals that lived near the king looked at each other with kindness and pity. They all went before the king to venerate and worship him.",
        "source": "T10n0293_013:0721b23_10"
    },
    {
        "source_sentence": "一切山原及諸草樹，莫不迴轉，咸向於王如禮敬像。",
        "translation": "All the mountains, fields, grasses, and trees turned toward the king as if they were paying homage to him.",
        "source": "T10n0293_013:0721b24_11"
    },
    {
        "source_sentence": "陂池、泉井及以河海，悉皆騰溢，流注王前；",
        "translation": "Lakes, fountains, wells, and rivers all rose high and flowed in front of the king.",
        "source": "T10n0293_013:0721b25_12"
    },
    {
        "source_sentence": "十千龍王起大香雲，震雷激電，灑細香雨。",
        "translation": "Ten thousand dragon kings produced great clouds of fragrance, shook thunder and lightning, and showered down fine-smelling rain.",
        "source": "T10n0293_013:0721b26_13"
    },
    {
        "source_sentence": "復有十千六欲天王，所謂：四大天王、忉利天王、夜摩天王、兜率陀天王、妙變化天王、他化自在天王，",
        "translation": "“There were also ten thousand six celestial kings of the realm of desire, led by such as the four great deva kings, the Trāyastriṃśa gods, the Yama deva kings, the Tuṣita deva kings, the Paranirmita-vaśavartin deva kings, and the Paranirmitavaśavartin emperors.",
        "source": "T10n0293_013:0721b27_14"
    },
    {
        "source_sentence": "如是等王而為上首，於虛空中作眾妓樂。",
        "translation": "Such kings are the leaders, and they make all kinds of music in the sky.",
        "source": "T10n0293_013:0721b29_15"
    },
    {
        "source_sentence": "阿僧祇天女歌詠讚歎；",
        "translation": "Incalculable celestial maidens sang in praise.",
        "source": "T10n0293_013:0721c01_16"
    },
    {
        "source_sentence": "阿僧祇天寶華雲、阿僧祇天寶香雲、阿僧祇天寶鬘雲、阿僧祇天末香雲、阿僧祇天寶衣雲、阿僧祇天寶蓋雲、阿僧祇天寶幢雲、阿僧祇天寶幡雲，",
        "translation": "“Furthermore, great enlightening beings also saw clouds of celestial jewel flowers, clouds of celestial jewel fragrances, clouds of celestial jewel garlands, clouds of celestial jewel cloths, clouds of celestial jewel canopies, clouds of celestial jewel pennants, and clouds of cele",
        "source": "T10n0293_013:0721c02_17"
    },
    {
        "source_sentence": "遍虛空中而為嚴飾，供養於王。",
        "translation": "They pervaded the sky and adorned it, making offerings to the king.",
        "source": "T10n0293_013:0721c05_18"
    },
    {
        "source_sentence": "復有[醫-酉+言]羅鉢那大象王，以自在力，於虛空中布阿僧祇大寶蓮華；",
        "translation": "Again, there was a great elephant king named Luopanna, who, by his unimpeded power, spread countless great precious lotus blossoms in the sky.",
        "source": "T10n0293_013:0721c06_19"
    },
    {
        "source_sentence": "垂阿僧祇天寶瓔珞、阿僧祇寶繒帶、阿僧祇寶嚴具、阿僧祇寶衣服、阿僧祇寶鬘、阿僧祇寶華、阿僧祇寶香、阿僧祇燒香、阿僧祇塗香，",
        "translation": "He wore countless celestial jewel necklaces, countless ornaments of jewel jewelry, countless ornaments of jewel ornaments, countless raiment of jewels, countless garlands of jewel cloths, countless precious flowers, countless fragrances of jewel incense, countless burning incense, and countless coated incense.",
        "source": "T10n0293_013:0721c08_0"
    },
    {
        "source_sentence": "種種奇妙以為嚴飾。",
        "translation": "Various kinds of marvelous things are used to adorn it.",
        "source": "T10n0293_013:0721c11_1"
    },
    {
        "source_sentence": "阿僧祇天女出美妙音，歌詠讚歎。",
        "translation": "The incalculable goddesses produced beautiful sounds and sang praises.",
        "source": "T10n0293_013:0721c11_2"
    },
    {
        "source_sentence": "閻浮提內復有阿僧祇百千萬億諸羅剎王、諸夜叉王、鳩槃茶王、毘舍闍王、諸鬼王等，",
        "translation": "In Jambudvfpa there were innumerable hundreds of thousands of myriads of koṭis of rākṣasa kings, yakṣa kings, kumbhāṇḍa kings, piśāca kings, and other spirit kings.",
        "source": "T10n0293_013:0721c12_3"
    },
    {
        "source_sentence": "或居陸地、或處虛空、或住山間、或居大海；",
        "translation": "They may live on land, in space, among mountains, or in the great ocean.",
        "source": "T10n0293_013:0721c14_4"
    },
    {
        "source_sentence": "如是一切飲血、噉肉，殘害眾生，皆起慈心，願行利益，明識後世，不造諸惡，",
        "translation": "In the same way, all those who drink blood or eat meat and cruelly harm sentient beings become compassionate, wishing to benefit others. They know that in the afterlife they won’t do evil.",
        "source": "T10n0293_013:0721c15_5"
    },
    {
        "source_sentence": "恭敬合掌，頂禮於王；",
        "translation": "They joined their palms in respect and bowed to the king.",
        "source": "T10n0293_013:0721c17_6"
    },
    {
        "source_sentence": "恐怖不生，身心寂靜，皆得無量廣大安樂。",
        "translation": "Their fears don't arise, their bodies and minds are tranquil, and they all attain measureless and vast peace and happiness.",
        "source": "T10n0293_013:0721c17_7"
    },
    {
        "source_sentence": "如閻浮提餘三天下，乃至三千大千世界并及十方百千萬億那由他世界，",
        "translation": "It's like the other three continents of Jambudvfpa, up to 3,000 great one-thousand worlds and a hundred thousand million billion nayutas in the ten directions.",
        "source": "T10n0293_013:0721c18_8"
    },
    {
        "source_sentence": "其中所有毒惡眾生，悉亦如是。",
        "translation": "So it is with all the poisonous sentient beings there.",
        "source": "T10n0293_013:0721c20_9"
    },
    {
        "source_sentence": "如是一切皆以菩薩大慈為首，隨順世間三昧法門，力如是故。",
        "translation": "All of these are led by the great compassion of enlightening beings and follow the worldly approach of concentration, because their power is like this.",
        "source": "T10n0293_013:0721c20_10"
    },
    {
        "source_sentence": "時，大光王從三昧起，告善財言：「善男子！",
        "translation": "King Mahāprajñāpāramitā then rose from his samādhi and addressed Sudhana, Good man!",
        "source": "T10n0293_013:0721c23_0"
    },
    {
        "source_sentence": "我唯得此菩薩大慈幢行順世三昧解脫門，如諸菩薩摩訶薩為高蓋，慈心普蔭諸眾生故；",
        "translation": "“I have found this liberation door of enlightening beings’ great compassionate banner of practice following worldly concentration, just as the great enlightening beings are lofty canopies because their compassionate minds universally illumine all sentient beings.",
        "source": "T10n0293_013:0721c23_1"
    },
    {
        "source_sentence": "為圓滿，平等救護無分別故；",
        "translation": "They are perfected, because they rescue and protect beings equally without discrimination.",
        "source": "T10n0293_013:0721c26_0"
    },
    {
        "source_sentence": "為修行，下、中、上行悉等行故；",
        "translation": "In order to practice, they do so in the lower, middle, and higher stages of enlightenment.",
        "source": "T10n0293_013:0721c26_1"
    },
    {
        "source_sentence": "為大地，能以慈心任持一切諸眾生故；",
        "translation": "They become great continents, being able to take care of all sentient beings with compassion.",
        "source": "T10n0293_013:0721c27_2"
    },
    {
        "source_sentence": "為盛滿月，福德光明於諸世間平等現故；",
        "translation": "It becomes a full moon, because the light of blessedness and virtue appear equally in all worlds.",
        "source": "T10n0293_013:0721c28_3"
    },
    {
        "source_sentence": "為淨日輪，以智光明照了一切所知境故；",
        "translation": "It is the sphere of purity of the sun, because by the light of knowledge it illumines all knowables.",
        "source": "T10n0293_013:0721c29_4"
    },
    {
        "source_sentence": "為世明燈，能破眾生諸黑闇故；",
        "translation": "They become lamps of worldly light, being able to destroy the darkness of sentient beings.",
        "source": "T10n0293_013:0722a01_5"
    },
    {
        "source_sentence": "為水清珠，能清眾生諂誑濁故；",
        "translation": "It is the pure pearl of water, able to purify beings from the turbidity of hypocrisy and deceit.",
        "source": "T10n0293_013:0722a01_6"
    },
    {
        "source_sentence": "為如意寶，能滿眾生心所願故；",
        "translation": "They become wish-granting jewels, able to fulfill the wishes of sentient beings.",
        "source": "T10n0293_013:0722a02_7"
    },
    {
        "source_sentence": "為猛疾風，任持眾生及三昧宮殿一切智智大法城故；",
        "translation": "It is a violent wind, carrying sentient beings and the palace of concentration freely in the great city of all knowledge and knowledge.",
        "source": "T10n0293_013:0722a03_8"
    },
    {
        "source_sentence": "而我云何能知其行、能說其德、能稱量彼福德大山、能瞻仰彼功德眾星、能觀察彼大願風輪、能校量彼法平等力、能發起彼大修行心、能顯示彼大莊嚴海、能闡明彼普賢行門、能深入彼諸三昧窟、能讚歎彼大慈悲雲、能降注彼甘露法雨？",
        "translation": "How can I know their practice, explain their virtues, measure the great mountain of merit, look up to the stars of their virtue, observe the wind-wheel of their great vows, evaluate the equal power of their teachings, give rise to their minds of great cultivation, show them a great ocean of adornment, explain the practices of Samantabhadra, enter deeply",
        "source": "T10n0293_013:0722a04_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0722a10_10"
    },
    {
        "source_sentence": "於此南方，有一王都名曰安住；",
        "translation": "To the south of here, there was a royal capital called Anzhusvara.",
        "source": "T10n0293_013:0722a10_11"
    },
    {
        "source_sentence": "有優婆夷名曰不動；",
        "translation": "There was a layman named Akṣobhya.",
        "source": "T10n0293_013:0722a11_0"
    },
    {
        "source_sentence": "汝詣彼問菩薩云何學菩薩行、修菩薩道。」",
        "translation": "Go there and ask the bodhisattva how to train in the bodhisattva practice and cultivate the bodhisattva path.",
        "source": "T10n0293_013:0722a11_1"
    },
    {
        "source_sentence": "時，善財童子頂禮王足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "Then Sudhana went up to the king’s feet, paid his respects, and departed.",
        "source": "T10n0293_013:0722a12_2"
    },
    {
        "source_sentence": "爾時，善財童子出妙光城，行於道路，正念思惟大光王教，憶念菩薩大慈幢行，",
        "translation": "At that time, Sudhana went out of the city of Vairocana and proceeded on the road leading to the abode of a buddha named Maheśvara.",
        "source": "T10n0293_013:0722a14_0"
    },
    {
        "source_sentence": "思惟菩薩順世三昧，普見彼不思議菩薩清淨身，普念彼不思議妙寶師子座，",
        "translation": "They contemplate the worldly concentration of enlightening beings, and see all the pure bodies of those inconceivable enlightening beings; they are mindful of their lion seats of inconceivable jewels.",
        "source": "T10n0293_013:0722a15_1"
    },
    {
        "source_sentence": "增長彼不思議大願福德自在力，堅固彼不思議成熟眾生智，觀察彼不思議、不共受用大威德，",
        "translation": "He increases their inconceivable unimpeded power of great vows and virtues, strengthens their inconceivable knowledge of the development of sentient beings, and observes their inconceivable and uniquely experienced great authoritative qualities.",
        "source": "T10n0293_013:0722a17_2"
    },
    {
        "source_sentence": "憶念彼不思議神通差別相，思惟彼不思議清淨大眾會，分別彼不思議菩薩所作業；",
        "translation": "They remembered the distinctive characteristics of those inconceivable spiritual powers, contemplated those inconceivably pure masses, and analyzed the deeds of those inconceivable enlightening beings.",
        "source": "T10n0293_013:0722a19_3"
    },
    {
        "source_sentence": "憶念明了，隨順信解，生歡喜心、生澄淨心、生猛利心、生欣悅心、生慶幸心、生踊躍心、生不亂心、生明照心、生堅固心、生廣博心、生無盡心。",
        "translation": "Being mindful and clearly comprehending, following faith and understanding, they give rise to feelings of joy, purity, vigor, delight, happiness, joy, exhilation, unconfusedness, clarity, illumination, firmness, breadth, and inexhaustibility.",
        "source": "T10n0293_013:0722a21_4"
    },
    {
        "source_sentence": "如是思惟，悲泣流淚。",
        "translation": "With these thoughts, he wept and shed tears of grief.",
        "source": "T10n0293_013:0722a24_5"
    },
    {
        "source_sentence": "念善知識，實為希有，難見、難聞。",
        "translation": "Being mindful of good friends is really rare, difficult to see and difficult to hear.",
        "source": "T10n0293_013:0722a25_6"
    },
    {
        "source_sentence": "善知識者，是我寶山，出生一切諸功德寶；",
        "translation": "A good friend is a mountain of my treasures, producing all the jewels of virtue.",
        "source": "T10n0293_013:0722a26_7"
    },
    {
        "source_sentence": "能遍清淨諸菩薩行，圓滿菩薩一切淨念，清淨菩薩陀羅尼輪，顯發菩薩三昧光明，",
        "translation": "They can thoroughly purify the practices of enlightening beings, perfect all pure thoughts of enlightening beings, purify the sphere of mental command of enlightening beings, and reveal the light of concentration of enlightening beings.",
        "source": "T10n0293_013:0722a27_0"
    },
    {
        "source_sentence": "修治菩薩見佛境界，普雨一切諸佛法雨，顯現如來不思議智，顯示一切菩薩願門，",
        "translation": "Cultivating enlightening beings see the sphere of buddhahood, showering all buddhas with the rain of truth, manifesting the inconceivable knowledge of buddhas, revealing the vows of all enlightening beings.",
        "source": "T10n0293_013:0722a28_1"
    },
    {
        "source_sentence": "生長一切菩薩根芽。",
        "translation": "They give rise to all the bodhisattva faculties and sprouts.",
        "source": "T10n0293_013:0722b01_2"
    },
    {
        "source_sentence": "復作是念：「善知識者，能救護我，令我不墮一切惡趣；",
        "translation": "Again, he thought: A spiritual benefactor can rescue and protect me, enabling me not to fall into any evil ways.",
        "source": "T10n0293_013:0722b02_3"
    },
    {
        "source_sentence": "善知識者，能引導我，令我得入平等佛慧；",
        "translation": "A good friend guides me, enabling me to enter the equanimity of buddha-knowledge.",
        "source": "T10n0293_013:0722b03_4"
    },
    {
        "source_sentence": "善知識者，能顯照我，令我了知諸夷險道；",
        "translation": "A good friend can illuminate me, enabling me to know the dangerous paths of the barbarians.",
        "source": "T10n0293_013:0722b04_5"
    },
    {
        "source_sentence": "善知識者，能開示我，令我解了大乘奧義；",
        "translation": "A good friend is someone who can enlighten me, enabling me to understand the profound meaning of the Great Vehicle.",
        "source": "T10n0293_013:0722b05_6"
    },
    {
        "source_sentence": "善知識者，能勸發我，令我速入普賢諸行；",
        "translation": "A spiritual benefactor can encourage and inspire me, enabling me to quickly enter the practice of universal goodness.",
        "source": "T10n0293_013:0722b06_7"
    },
    {
        "source_sentence": "善知識者，能曉悟我，令我速到一切智城；",
        "translation": "A spiritual benefactor can enlighten me and cause me to quickly reach the city of omniscience.",
        "source": "T10n0293_013:0722b07_8"
    },
    {
        "source_sentence": "善知識者，能誨諭我，令我趣入法界大海；",
        "translation": "Good friends are those who can instruct me and lead me into the ocean of the cosmos.",
        "source": "T10n0293_013:0722b08_9"
    },
    {
        "source_sentence": "善知識者，能勸誘我，令我普見三世法海；",
        "translation": "Good friends are those who can encourage and tempt me, enabling me to see the ocean of teachings of past, present, and future.",
        "source": "T10n0293_013:0722b09_10"
    },
    {
        "source_sentence": "善知識者，能教授我，令我得與眾聖集會；",
        "translation": "A good friend can teach me, enabling me to associate with the holy ones.",
        "source": "T10n0293_013:0722b10_11"
    },
    {
        "source_sentence": "善知識者能增長我，令我出生一切白法。",
        "translation": "A good teacher can grow self and cause me to produce all white dharmas.",
        "source": "T10n0293_013:0722b11_12"
    },
    {
        "source_sentence": "念善知識能以如是利益眾生。」",
        "translation": "Being mindful of good teachers can thus benefit sentient beings.",
        "source": "T10n0293_013:0722b12_13"
    },
    {
        "source_sentence": "善財童子如是思惟，涕淚盈目，彼常守護覺悟菩薩，猶影隨形。",
        "translation": "He always guards the enlightened bodhisattva, just like a shadow following its form.",
        "source": "T10n0293_013:0722b12_14"
    },
    {
        "source_sentence": "如來使天於虛空中而告之言：「善男子！",
        "translation": "The Tathāgata sent a messenger to heaven in space and told him, Good man!",
        "source": "T10n0293_013:0722b14_15"
    },
    {
        "source_sentence": "其有隨順善知識教，諸佛世尊悉皆歡喜；",
        "translation": "Those who follow the teachings of spiritual benefactors are all delighted by the buddhas and world-honored ones.",
        "source": "T10n0293_013:0722b15_16"
    },
    {
        "source_sentence": "其有隨順善知識語，則得近於一切智地；",
        "translation": "Anyone who follows the words of spiritual benefactors can approach omniscience.",
        "source": "T10n0293_013:0722b16_17"
    },
    {
        "source_sentence": "其有能於善知識行，心無疑惑，則常值遇一切善友；",
        "translation": "Those who are able to associate with spiritual benefactors without doubt and have no doubt in their minds will always meet spiritual benefactors.",
        "source": "T10n0293_013:0722b17_18"
    },
    {
        "source_sentence": "其有發心，願常不離善知識者，則得具足一切甚深最勝義利。",
        "translation": "Those who have arisen the intention and wish to always not part with good friends will then attain all the profound and most excellent benefits of all things.",
        "source": "T10n0293_013:0722b18_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0722b19_20"
    },
    {
        "source_sentence": "汝可往詣安住王都，即當得見不動優婆夷大善知識，從彼請問諸菩薩行。」",
        "translation": "You may go to the king's capital and stay there, where you'll see the great good friend Upāsikā Akṣobhya and ask questions from him about the bodhisattva's practice.",
        "source": "T10n0293_013:0722b20_0"
    },
    {
        "source_sentence": "爾時，善財童子從彼三昧智光明起，漸次遊行，至安住城，周遍求問不動優婆夷，",
        "translation": "At that time, Sudhana went to the city of Vaiśravaṇa and asked the layman Akṣobhya:",
        "source": "T10n0293_013:0722b22_0"
    },
    {
        "source_sentence": "今在何所？",
        "translation": "Where is it now?",
        "source": "T10n0293_013:0722b23_1"
    },
    {
        "source_sentence": "遇彼人眾咸示之言：「善男子！",
        "translation": "When he met those people, they all showed him, saying, Good man!",
        "source": "T10n0293_013:0722b24_2"
    },
    {
        "source_sentence": "不動優婆夷身是童女，侍覲父母，在自宅中，與其親屬及無量人，周匝圍遶，",
        "translation": "The Upāsikā Akṣobhya was a young woman, attending her parents. She lived at home surrounded by her relatives and innumerable other people.",
        "source": "T10n0293_013:0722b24_3"
    },
    {
        "source_sentence": "演說妙法。」",
        "translation": "He teaches the wonderful Dharma.",
        "source": "T10n0293_013:0722b26_4"
    },
    {
        "source_sentence": "善財聞已，其心歡喜，生寂靜心，生愛敬心，如見父母。",
        "translation": "Having heard it, Sudhana was delighted. Hearing it, his mind became tranquil and he felt affection and respect like seeing his parents.",
        "source": "T10n0293_013:0722b26_5"
    },
    {
        "source_sentence": "念我於今所願圓滿。",
        "translation": "He's mindful of the fulfillment of my present vow.",
        "source": "T10n0293_013:0722b27_6"
    },
    {
        "source_sentence": "即詣不動優婆夷所，到彼宅門，住立觀察。",
        "translation": "He then went to the house of Akṣobhya, entered the door of his house, stood there, and observed.",
        "source": "T10n0293_013:0722b28_7"
    },
    {
        "source_sentence": "入其宅內，見彼堂宇，微妙清淨，眾寶莊嚴。",
        "translation": "He entered the house and saw that hall, subtle and pure, adorned with all kinds of jewels.",
        "source": "T10n0293_013:0722b29_8"
    },
    {
        "source_sentence": "金色光明，普皆照耀。",
        "translation": "The golden-colored light shone brightly everywhere.",
        "source": "T10n0293_013:0722c01_9"
    },
    {
        "source_sentence": "如是光明，觸善財身，善財即時獲得五百妙三昧門。",
        "translation": "Thus, this light touches the body of Shan Cai, and Shan Cai immediately attains the five hundred subtle samādhi gates.",
        "source": "T10n0293_013:0722c01_10"
    },
    {
        "source_sentence": "所謂：入一切安樂自在幢三昧門；",
        "translation": "They are these: entering the door of concentration of all kinds of peace and comfort, freely flying banners.",
        "source": "T10n0293_013:0722c02_11"
    },
    {
        "source_sentence": "了一切寂靜相三昧門；",
        "translation": "The door of concentration comprehending all characteristics of quiescence.",
        "source": "T10n0293_013:0722c03_12"
    },
    {
        "source_sentence": "遠離一切世間三昧門；",
        "translation": "They were far removed from all mundane approaches of concentration.",
        "source": "T10n0293_013:0722c04_13"
    },
    {
        "source_sentence": "普眼捨得三昧門；",
        "translation": "Universal eye relinquishing to attain the door of concentration.",
        "source": "T10n0293_013:0722c04_14"
    },
    {
        "source_sentence": "如來藏三昧門；",
        "translation": "door of concentration of the treasury of enlightenment of buddhahood;",
        "source": "T10n0293_013:0722c05_15"
    },
    {
        "source_sentence": "得如是等五百三昧門。",
        "translation": "They attain these five hundred samādhi-gates.",
        "source": "T10n0293_013:0722c05_16"
    },
    {
        "source_sentence": "以得如是三昧門故，身心柔軟，如七日胎，微妙輕安，世無過者。",
        "translation": "Because he has attained this kind of samādhi, his body and mind are as soft and gentle as the seven-day womb, subtle and peaceful, which is without error in the world.",
        "source": "T10n0293_013:0722c06_0"
    },
    {
        "source_sentence": "又聞妙香，非諸天、龍、乾闥婆等人與非人之所能有。",
        "translation": "They also smell a wonderful fragrance that's not what gods, dragons, gandharvas, or non-humans can smell.",
        "source": "T10n0293_013:0722c07_1"
    },
    {
        "source_sentence": "即前往詣，恭敬合掌，一心觀察。",
        "translation": "He then went out to visit them, joined his palms in respect, and observed them with one mind.",
        "source": "T10n0293_013:0722c08_2"
    },
    {
        "source_sentence": "見其形色，端正殊妙，十方世界一切女人無能與比，況復過者。",
        "translation": "All the women in the worlds of the ten directions could not compare him, much less compare him to them.",
        "source": "T10n0293_013:0722c09_3"
    },
    {
        "source_sentence": "唯除如來及以一切灌頂菩薩。",
        "translation": "It's only except for the Tathāgata and all the consecrated bodhisattvas.",
        "source": "T10n0293_013:0722c10_4"
    },
    {
        "source_sentence": "其身殊勝，口出妙香。",
        "translation": "His body was extraordinary, and his mouth emitted a wonderful fragrance.",
        "source": "T10n0293_013:0722c11_5"
    },
    {
        "source_sentence": "宮殿莊嚴，受用資具、眷屬圍遶，威光熾盛，清淨無染，悉無與等，況其過者？",
        "translation": "The palace was beautifully adorned, surrounded by all the necessities for daily life and its attendants. Endowed with great majesty and splendor, pure and undefiled, it was incomparably pure. How much more so when surrounded by those who lived there.",
        "source": "T10n0293_013:0722c12_0"
    },
    {
        "source_sentence": "十方世界一切眾生無有於此優婆夷所起染著心。",
        "translation": "All sentient beings in the worlds of the ten directions don't have defiled attachments that arise from this Upāsikā.",
        "source": "T10n0293_013:0722c13_1"
    },
    {
        "source_sentence": "若有眾生暫得瞻見，所有煩惱悉自銷滅。",
        "translation": "If there are sentient beings who momentarily see it, all their afflictions will cease on their own.",
        "source": "T10n0293_013:0722c14_2"
    },
    {
        "source_sentence": "譬如百萬大梵天王，決定不生欲界煩惱。",
        "translation": "It's like a million great Brahma heavenly kings who are certain not to give rise to afflictions in the desire realm.",
        "source": "T10n0293_013:0722c15_3"
    },
    {
        "source_sentence": "其有見此優婆夷者不起煩惱，亦復如是。",
        "translation": "It's likewise with someone who sees this Upāsikā and doesn't give rise to afflictions.",
        "source": "T10n0293_013:0722c16_4"
    },
    {
        "source_sentence": "十方眾生觀此女人，歡喜愛敬，心無厭足，唯除具足大智慧者。",
        "translation": "The sentient beings in the ten directions observed this woman with joy and respect, their hearts weren't satisfied, except for those who possess great wisdom.",
        "source": "T10n0293_013:0722c17_5"
    },
    {
        "source_sentence": "爾時，善財童子曲躬合掌，恭敬瞻視，正念觀察。",
        "translation": "At the time, Boy of Good Wealth bent his head and joined his palms, respectfully gazed at him, and observed him with correct mindfulness.",
        "source": "T10n0293_013:0722c19_6"
    },
    {
        "source_sentence": "見此女人，其身自在，不可思議。",
        "translation": "Seeing this woman, his body was unobstructed and inconceivable.",
        "source": "T10n0293_013:0722c20_7"
    },
    {
        "source_sentence": "色相顏容，世無與等；",
        "translation": "His physical form and countenance were unparalleled in the world.",
        "source": "T10n0293_013:0722c20_8"
    },
    {
        "source_sentence": "光明洞徹，物無能障。",
        "translation": "The light penetrates deeply, and nothing can obstruct it.",
        "source": "T10n0293_013:0722c21_9"
    },
    {
        "source_sentence": "普為法界一切眾生，作大饒益，無有窮盡。",
        "translation": "For the sake of all sentient beings in the cosmos they work to greatly benefit them, without end.",
        "source": "T10n0293_013:0722c21_10"
    },
    {
        "source_sentence": "其身毛孔，恒出妙香，眷屬無邊，宮殿第一；",
        "translation": "The hair pores of his body always emitted a subtle fragrance. He had boundless retinues and the palace was the foremost among them.",
        "source": "T10n0293_013:0722c22_11"
    },
    {
        "source_sentence": "功德深廣，不可思議，莫能究盡，知其涯際。",
        "translation": "The depth and breadth of his virtue are inconceivable; no one can fathom it or know its limits.",
        "source": "T10n0293_013:0722c23_12"
    },
    {
        "source_sentence": "「汝常護持清淨戒，　　普修菩薩無垢忍，",
        "translation": "You should always keep pure precepts And cultivate the unblemished tolerance of enlightening beings.",
        "source": "T10n0293_013:0722c24_13"
    },
    {
        "source_sentence": "　堅進不動如金剛，　　妙果超世無能比。」◎",
        "translation": "It's as firm and unmoving as adamantine, and its marvelous fruit transcends the world without compare.",
        "source": "T10n0293_013:0722c24_13"
    },
    {
        "source_sentence": "生歡喜心，以偈讚曰：◎爾時，善財童子說此偈已，白言：「聖者！",
        "translation": "With joy, he praised him in verse, saying, At that point, the boy of good fortune spoke these verses and said, Sage!",
        "source": "T10n0293_013:0722c24_13"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，云何修菩薩道；",
        "translation": "I have set my mind on unexcelled complete perfect enlightenment, but I do not know how an enlightening being is to learn and carry out the practice of enlightening beings.",
        "source": "T10n0293_013:0722c28_14"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說。」",
        "translation": "I've heard that the noble one is good at encouraging, so please tell me about it.",
        "source": "T10n0293_013:0723a01_15"
    },
    {
        "source_sentence": "時，不動優婆夷以菩薩柔軟語、可愛語、慈悲語，慰諭善財，而告之言：「善哉！",
        "translation": "The Immovable Upāsikā then comforted Sun Cai with the bodhisattva's gentle words, kind words, and compassionate words, and told him, Good!",
        "source": "T10n0293_013:0723a02_16"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T10n0293_013:0723a04_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0723a04_18"
    },
    {
        "source_sentence": "汝已能發阿耨多羅三藐三菩提心。",
        "translation": "You've already arisen the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0293_013:0723a04_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_013:0723a05_20"
    },
    {
        "source_sentence": "我得菩薩難摧伏智慧藏解脫門，我得菩薩堅固受持願行門，我得菩薩一切法平等地總持門，",
        "translation": "I attain the liberation door of enlightening beings’ indestructible treasury of knowledge; I attain the liberation door of enlightening beings’ unshakable store of knowledge; I attain the liberation door of enlightening beings’ steadfast undertaking of vows; and I attain the liberation door of enlightening beings’ equanimity",
        "source": "T10n0293_013:0723a05_21"
    },
    {
        "source_sentence": "我得菩薩一切法智光照辯才門，我得菩薩求一切法心無疲厭莊嚴三昧門。」",
        "translation": "I've attained the gate of the enlightening being's wisdom that illuminates all dharmas, and I've attained the gate of the enlightening being's mind that seeks all dharmas without weariness in adorning samādhi.",
        "source": "T10n0293_013:0723a07_22"
    },
    {
        "source_sentence": "善財童子白言：「聖者！",
        "translation": "The boy of good fortune said, Sage!",
        "source": "T10n0293_013:0723a09_23"
    },
    {
        "source_sentence": "菩薩難摧伏智慧藏解脫門，乃至求法心無疲厭莊嚴三昧門境界云何？」",
        "translation": "What's the sphere of the liberation gate of the store of wisdom that it's difficult for bodhisattvas to subdue, up to the point where they don't tire of pursuing the mind of seeking the Dharma and adorning the samādhi gate?",
        "source": "T10n0293_013:0723a09_24"
    },
    {
        "source_sentence": "答言：「善男子！",
        "translation": "He replied, Good man!",
        "source": "T10n0293_013:0723a11_25"
    },
    {
        "source_sentence": "此處甚深，難知難信。」",
        "translation": "This place is so deep that it's difficult to know and difficult to believe.",
        "source": "T10n0293_013:0723a11_26"
    },
    {
        "source_sentence": "善財白言：「唯願聖者承佛神力，為我宣說。",
        "translation": "Shanzai said, Please, noble one, let me explain it for you by the power of the Buddha.",
        "source": "T10n0293_013:0723a12_27"
    },
    {
        "source_sentence": "我因聖者善知識力，能信、能受、能解、能知、能甚深入、能隨順行，",
        "translation": "Because of the spiritual power of the holy one’s true knowledge, I am able to believe, receive, understand, know, penetrate deeply, and act accordingly.",
        "source": "T10n0293_013:0723a13_28"
    },
    {
        "source_sentence": "明了觀察，憶念修習，離諸分別，究竟平等。」",
        "translation": "He clearly observes, remembers, cultivates, parts with distinctions, and is ultimately equal.",
        "source": "T10n0293_013:0723a14_29"
    },
    {
        "source_sentence": "◎大方廣佛華嚴經卷第十三",
        "translation": "Dafangguang fo huayan jing, vol. 13",
        "source": "T10n0293_013:0723a15_30"
    }
]