[
    {
        "source_sentence": "大方廣佛華嚴經卷第三十七",
        "translation": "Dafangguang fo huayan jing, vol. 37",
        "source": "T10n0279_037:0193b14_0"
    },
    {
        "source_sentence": "于闐國三藏實叉難陀奉　制譯",
        "translation": "translated into Chinese by the Tripiṭaka Master Shikṣu Nanda Bodhisattva of Yutan",
        "source": "T10n0279_037:0193b16_0"
    },
    {
        "source_sentence": "十地品第二十六之四第六地",
        "translation": "The Twenty-sixth and Sixth Stages of the Chapter on the Ten Stages",
        "source": "T10n0279_037:0193b17_0"
    },
    {
        "source_sentence": "　菩薩既聞諸勝行，　　其心歡喜雨妙華，",
        "translation": "Enlightening beings, having heard of the supreme practices, Are joyful and shower beautiful flowers.",
        "source": "T10n0279_037:0193b18_0"
    },
    {
        "source_sentence": "　放淨光明散寶珠，　　供養如來稱善說。",
        "translation": "They radiate pure light and scatter jewels, making offerings to the Tathāgata who praises his good explanation.",
        "source": "T10n0279_037:0193b19_0"
    },
    {
        "source_sentence": "　百千天眾皆欣慶，　　共在空中散眾寶，",
        "translation": "Hundreds of thousands of myriadstical celestial beings all rejoiced, Together scattering jewels in the sky.",
        "source": "T10n0279_037:0193b20_0"
    },
    {
        "source_sentence": "　華鬘瓔珞及幢幡，　　寶蓋塗香咸供佛。",
        "translation": "Flower garlands, jewelry, banners, pennants, Jeweled canopies, and perfumed incense are offered to the Buddha.",
        "source": "T10n0279_037:0193b21_0"
    },
    {
        "source_sentence": "　自在天王并眷屬，　　心生歡喜住空中，",
        "translation": "The sovereign celestial kings and their retinues Abide in the sky, hearts filled with joy.",
        "source": "T10n0279_037:0193b22_0"
    },
    {
        "source_sentence": "　散寶成雲持供養，　　讚言：「佛子快宣說！」",
        "translation": "They scattered jewels into clouds to make offerings and praised them, saying, Son of the Buddha, quickly explain it!",
        "source": "T10n0279_037:0193b23_0"
    },
    {
        "source_sentence": "　無量天女空中住，　　共以樂音歌讚佛，",
        "translation": "Countless celestial maidens dwelled in the sky, singing praises to the Buddha with music.",
        "source": "T10n0279_037:0193b24_0"
    },
    {
        "source_sentence": "　音中悉作如是言：　　「佛語能除煩惱病。",
        "translation": "In the sound, they all said, The Buddha's words can remove the afflictions and illnesses.",
        "source": "T10n0279_037:0193b25_0"
    },
    {
        "source_sentence": "　法性本寂無諸相，　　猶如虛空不分別，",
        "translation": "The essence of dharmas is inherently quiescent, without marks, Like space, not discriminating.",
        "source": "T10n0279_037:0193b26_0"
    },
    {
        "source_sentence": "　超諸取著絕言道，　　真實平等常清淨。",
        "translation": "Beyond all attachments and attachments, beyond the path of cutting off language, Their reality is equanimous and always pure.",
        "source": "T10n0279_037:0193b27_0"
    },
    {
        "source_sentence": "　若能通達諸法性，　　於有於無心不動。",
        "translation": "If they can comprehend the essence of all dharmas, their minds don't move when there's something or nothing.",
        "source": "T10n0279_037:0193b28_0"
    },
    {
        "source_sentence": "　為欲救世勤修行，　　此佛口生真佛子。",
        "translation": "In order to save the world and diligently practice, this Buddha's mouth gives rise to the true Buddha-child.",
        "source": "T10n0279_037:0193b29_0"
    },
    {
        "source_sentence": "　不取眾相而行施，　　本絕諸惡堅持戒，",
        "translation": "They practice giving without grasping characteristics, Originally cutting off evil and upholding the precepts.",
        "source": "T10n0279_037:0193c01_0"
    },
    {
        "source_sentence": "　解法無害常堪忍，　　知法性離具精進，",
        "translation": "Understanding the principle of truth is harmless, always tolerating it; Knowing the essence of things is apart from them, they perfect effort.",
        "source": "T10n0279_037:0193c02_0"
    },
    {
        "source_sentence": "　已盡煩惱入諸禪，　　善達性空分別法，",
        "translation": "Having extinguished afflictions, they enter all meditations. They comprehend emptiness of essence and discriminate dharmas.",
        "source": "T10n0279_037:0193c03_0"
    },
    {
        "source_sentence": "　具足智力能博濟，　　滅除眾惡稱大士。」",
        "translation": "Being endowed with the power of wisdom, he's able to extensively rescue and extinguish all bad names as a great person.",
        "source": "T10n0279_037:0193c04_0"
    },
    {
        "source_sentence": "　如是妙音千萬種，　　讚已默然瞻仰佛。",
        "translation": "There are thousands of myriads of such subtle sounds, and after praising them, they remain silent and look up to the Buddha.",
        "source": "T10n0279_037:0193c05_0"
    },
    {
        "source_sentence": "　解脫月語金剛藏：　　「以何行相入後地？」",
        "translation": "The moon of liberation said to the adamantine store, What's the way to enter the latter ground in terms of form?",
        "source": "T10n0279_037:0193c06_0"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩告解脫月菩薩言：「佛子！",
        "translation": "It was then that the Vajragarbha Bodhisattva addressed the Moon of Liberation Bodhisattva, saying, Son of the Buddha!",
        "source": "T10n0279_037:0193c07_0"
    },
    {
        "source_sentence": "菩薩摩訶薩已具足第五地，欲入第六現前地，當觀察十平等法。",
        "translation": "When the bodhisattva Mahāsattva has fulfilled the fifth ground and wants to enter the sixth ground in the present, he'll observe the ten equal dharmas.",
        "source": "T10n0279_037:0193c07_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_037:0193c09_2"
    },
    {
        "source_sentence": "所謂：一切法無相故平等，無體故平等，無生故平等，無成故平等，本來清淨故平等，",
        "translation": "All things are equanimous because they have no characteristics, equanimous because they lack substance, equanimous because they lack arising, equanimous because they lack formation, equanimous because they are inherently pure.",
        "source": "T10n0279_037:0193c09_3"
    },
    {
        "source_sentence": "無戲論故平等，無取捨故平等，寂靜故平等，如幻、如夢、如影、如響、如水中月、如鏡中像、如焰、如化故平等，",
        "translation": "Equality because of non-conceptual elaborations, equality because of non-acquisition and non-abandonment, equality because of quiescence, equality because of being like illusions, like dreams, like shadows, like echoes, like",
        "source": "T10n0279_037:0193c11_4"
    },
    {
        "source_sentence": "有、無不二故平等。",
        "translation": "Because existence and nonexistence are not two, they're equal.",
        "source": "T10n0279_037:0193c13_5"
    },
    {
        "source_sentence": "菩薩如是觀一切法自性清淨，隨順無違，得入第六現前地，得明利隨順忍，",
        "translation": "“Thus do enlightening beings observe the inherent purity of all things, following and following without disobedience. They enter the sixth stage in which they manifest themselves, attaining tolerance that is accompanied by clarity and benefit.",
        "source": "T10n0279_037:0193c14_6"
    },
    {
        "source_sentence": "未得無生法忍。",
        "translation": "They haven't yet attained the forbearance of the nonarising dharma.",
        "source": "T10n0279_037:0193c16_7"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0193c17_0"
    },
    {
        "source_sentence": "此菩薩摩訶薩如是觀已，復以大悲為首、大悲增上、大悲滿足，觀世間生滅，",
        "translation": "“Furthermore, having contemplated thus, these great enlightening beings also observe the world as coming into being and going out of being with great compassion as their foremost principle, increasing by great compassion and perfected by great compassion.",
        "source": "T10n0279_037:0193c17_1"
    },
    {
        "source_sentence": "作是念：『世間受生皆由著我，若離此著，則無生處。』",
        "translation": "He thinks, 'The world receives birth because they're all attached to self; if they part with this attachment, then there's no place of birth.'",
        "source": "T10n0279_037:0193c18_2"
    },
    {
        "source_sentence": "復作是念：『凡夫無智，執著於我，常求有、無，不正思惟，起於妄行，",
        "translation": "Again, they think: Ordinary people have no knowledge and are attached to self. They always seek existence or nonexistence; they do not correctly contemplate it and give rise to deluded thoughts.",
        "source": "T10n0279_037:0193c20_3"
    },
    {
        "source_sentence": "行於邪道；",
        "translation": "They follow wrong paths.",
        "source": "T10n0279_037:0193c21_4"
    },
    {
        "source_sentence": "罪行、福行、不動行，積集增長，於諸行中植心種子，有漏有取，復起後有生及老死。",
        "translation": "Sinful actions, meritorious actions, and immovable actions accumulate and grow, planting mental seeds in actions that are contaminated and grasped, and then there's birth and old age and death later.",
        "source": "T10n0279_037:0193c21_5"
    },
    {
        "source_sentence": "所謂：業為田，識為種，無明闇覆，愛水為潤，我慢溉灌，見網增長，",
        "translation": "Action is the field, consciousness the seed. The darkness of ignorance covers it; thirst for water nourishes it; self-conceit irrigates it; the web of views increases and grows.",
        "source": "T10n0279_037:0193c23_6"
    },
    {
        "source_sentence": "生名色芽，名色增長生五根，諸根相對生觸，觸對生受，受後希求生愛，",
        "translation": "When name-and-form sprouts arise, when name-and-form grows, five faculties arise: contact arises in relation to the faculties; sensation arises in relation to contact; desire arises after feeling; thirst arises from",
        "source": "T10n0279_037:0193c25_7"
    },
    {
        "source_sentence": "愛增長生取，取增長生有；",
        "translation": "When craving increases, grasping arises; when grasping increases, existence arises.",
        "source": "T10n0279_037:0193c26_8"
    },
    {
        "source_sentence": "有生已，於諸趣中起五蘊身，名生；",
        "translation": "When arising occurs, the five aggregates arise in all states of being.",
        "source": "T10n0279_037:0193c27_9"
    },
    {
        "source_sentence": "生已衰變為老，終歿為死。",
        "translation": "After birth, decay becomes old age and death after death.",
        "source": "T10n0279_037:0193c28_10"
    },
    {
        "source_sentence": "於老死時，生諸熱惱；",
        "translation": "At the time of old age and death, they give rise to feverish distress.",
        "source": "T10n0279_037:0193c28_11"
    },
    {
        "source_sentence": "因熱惱故，憂愁悲歎，眾苦皆集。",
        "translation": "Because of the heat and anguish, they become grieved and saddened, and all kinds of suffering arise.",
        "source": "T10n0279_037:0193c29_12"
    },
    {
        "source_sentence": "此因緣故，集無有集者，任運而滅亦無滅者。』",
        "translation": "Because of these causes and conditions, there's no set that arises, and there's no cessation that ceases at will.'",
        "source": "T10n0279_037:0193c29_13"
    },
    {
        "source_sentence": "菩薩如是隨順觀察緣起之相。",
        "translation": "Thus, the bodhisattva follows and observes the characteristics of dependent arising.",
        "source": "T10n0279_037:0194a01_14"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0194a02_15"
    },
    {
        "source_sentence": "此菩薩摩訶薩復作是念：『於第一義諦不了故名：無明，所作業果是行，",
        "translation": "“These great enlightening beings also think, ‘This is called ignorance because they do not understand the ultimate truth.",
        "source": "T10n0279_037:0194a02_16"
    },
    {
        "source_sentence": "行依止初心是識，與識共生四取蘊為名色，名色增長為六處，根、境、識三事和合是觸，",
        "translation": "Form is the support of conditioned forces. The first mental state is consciousness. Name and form together with the four appropriated aggregates that arise in tandem with consciousness are nāmarāpa; name and form increase as six places. The conjunction",
        "source": "T10n0279_037:0194a04_17"
    },
    {
        "source_sentence": "觸共生有受，於受染著是愛，愛增長是取，取所起有漏業為有，從業起蘊為生，",
        "translation": "Defiled attachment to feeling is thirst. The increase of thirst is grasping. Impure action arisen from grasping is existence; the aggregates that arise from action are birth.",
        "source": "T10n0279_037:0194a06_18"
    },
    {
        "source_sentence": "蘊熟為老，蘊壞為死；",
        "translation": "The maturation of the aggregates is old age, and the disintegration of the aggregates is death.",
        "source": "T10n0279_037:0194a08_0"
    },
    {
        "source_sentence": "死時離別，愚迷貪戀，心胸煩悶為愁，涕泗諮嗟為歎，在五根為苦，在意地為憂，",
        "translation": "At the moment of dying, they are separated. Foolishly deluded and addicted, their minds and chests tormented by sorrow, weeping and screaming in admiration is to be grieved. The five sense",
        "source": "T10n0279_037:0194a08_1"
    },
    {
        "source_sentence": "憂苦轉多為惱。",
        "translation": "The turning of grief and suffering is often called anguish.",
        "source": "T10n0279_037:0194a10_2"
    },
    {
        "source_sentence": "如是但有苦樹增長，無我、無我所，無作、無受者。』",
        "translation": "Thus, there's only this tree of suffering that grows, which has no self and nothing what belongs to self, and nothing made and nothing received.'",
        "source": "T10n0279_037:0194a10_3"
    },
    {
        "source_sentence": "復作是念：『若有作者，則有作事；",
        "translation": "Again, they think: If there is an author, then there must be a done thing.",
        "source": "T10n0279_037:0194a11_4"
    },
    {
        "source_sentence": "若無作者，亦無作事，第一義中俱不可得。』",
        "translation": "If there's no author and no done thing, neither can it be obtained in the ultimate truth.'",
        "source": "T10n0279_037:0194a12_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0194a13_6"
    },
    {
        "source_sentence": "此菩薩摩訶薩復作是念：『三界所有，唯是一心。",
        "translation": "Again, this bodhisattva Mahāsattva thinks, 'All that exists in the three realms is only one mind.",
        "source": "T10n0279_037:0194a13_7"
    },
    {
        "source_sentence": "如來於此分別演說十二有支，皆依一心，如是而立。",
        "translation": "The Tathāgata explains these twelve components of existence separately, all relying on one mind and establishing them in this way.",
        "source": "T10n0279_037:0194a14_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_037:0194a15_9"
    },
    {
        "source_sentence": "隨事貪欲與心共生，心是識，事是行，於行迷惑是無明，與無明及心共生是名色，",
        "translation": "Consciousness is consciousness, the substance is volition. Delusion in volition is ignorance. Co-arising with ignorance and mind is name and form.",
        "source": "T10n0279_037:0194a15_10"
    },
    {
        "source_sentence": "名色增長是六處，六處三分合為觸，觸共生是受，受無厭足是愛，愛攝不捨是取，",
        "translation": "When name and form increase, these are the six āyatanas; when the six āyatanas are combined in three or four parts, they are contact; when touch arises together, it is sensation; feeling without tirelessness of satisfaction is thirst",
        "source": "T10n0279_037:0194a17_11"
    },
    {
        "source_sentence": "彼諸有支生是有，有所起名：生，生熟為老，老壞為死。』",
        "translation": "Those existential limbs that arise are produced, and there's something that arises called birth, which is old when it grows and dies when it breaks down.'",
        "source": "T10n0279_037:0194a19_12"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0194a20_13"
    },
    {
        "source_sentence": "此中無明有二種業，一令眾生迷於所緣，二與行作生起因。",
        "translation": "Here, nescience has two kinds of actions: first, it causes sentient beings to be deluded about their perceptual objects and second, it acts as the producing cause with regard to conditioned forces.",
        "source": "T10n0279_037:0194a20_14"
    },
    {
        "source_sentence": "行亦有二種業，一能生未來報，二與識作生起因。",
        "translation": "Conditioned forces also have two kinds of action: one that can produce future retribution and two that act as the producing cause for consciousness.",
        "source": "T10n0279_037:0194a22_15"
    },
    {
        "source_sentence": "識亦有二種業，一令諸有相續，二與名色作生起因。",
        "translation": "Consciousness also has two kinds of action: first, it causes existence to continue and second, it acts as the producing cause for name and form.",
        "source": "T10n0279_037:0194a23_16"
    },
    {
        "source_sentence": "名色亦有二種業，一互相助成，二與六處作生起因。",
        "translation": "Names and forms also have two kinds of action: one is mutually assisting in their formation, and the other acts as producing causes with respect to the six sense-fields.",
        "source": "T10n0279_037:0194a24_17"
    },
    {
        "source_sentence": "六處亦有二種業，一各取自境界，二與觸作生起因。",
        "translation": "The six āyatanas also have two kinds of action: they each grasp their own object. They are the producing cause of one another with regard to contact.",
        "source": "T10n0279_037:0194a25_18"
    },
    {
        "source_sentence": "觸亦有二種業，一能觸所緣，二與受作生起因。",
        "translation": "There are also two kinds of action in relation to tangibles: the first acts as an object that is able to contact, and the second acts as the producing cause for feeling.",
        "source": "T10n0279_037:0194a26_19"
    },
    {
        "source_sentence": "受亦有二種業，一能領受愛憎等事，二與愛作生起因。",
        "translation": "Sensation also has two kinds of action: one, able to experience such things as desire and hatred; and two, acting as the producing cause with craving.",
        "source": "T10n0279_037:0194a27_20"
    },
    {
        "source_sentence": "愛亦有二種業，一染著可愛事，二與取作生起因。",
        "translation": "Also thirst has two forms of action: the first is defiled by attachment to agreeable things, and the second acts as the producing cause for grasping.",
        "source": "T10n0279_037:0194a29_21"
    },
    {
        "source_sentence": "取亦有二種業，一令諸煩惱相續，二與有作生起因。",
        "translation": "Grasping also has two kinds of action: first, causing the defilements to continue and second, being the producing cause for that which is conditioned.",
        "source": "T10n0279_037:0194b01_22"
    },
    {
        "source_sentence": "有亦有二種業，一能令於餘趣中生，二與生作生起因。",
        "translation": "There are also two kinds of actions: one that can cause birth in other destinies, and two that act as the producing cause for birth with birth.",
        "source": "T10n0279_037:0194b02_23"
    },
    {
        "source_sentence": "生亦有二種業，一能起諸蘊，二與老作生起因。",
        "translation": "Birth also has two kinds of action: one that produces the aggregates and two that act as the producing cause for old age.",
        "source": "T10n0279_037:0194b03_24"
    },
    {
        "source_sentence": "老亦有二種業，一令諸根變異，二與死作生起因。",
        "translation": "Old age also has two kinds of action: first, it causes the faculties to change. Second, it acts as the producing cause for birth with death.",
        "source": "T10n0279_037:0194b04_25"
    },
    {
        "source_sentence": "死亦有二種業，一能壞諸行，二不覺知故相續不絕。",
        "translation": "Death also has two kinds of action: one that is able to destroy formations and two that are not perceived, so the succession does not cease.",
        "source": "T10n0279_037:0194b05_26"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0194b07_0"
    },
    {
        "source_sentence": "此中無明緣行，乃至生緣老死者，由無明乃至生為緣，令行乃至老死不斷，",
        "translation": "Here, ignorance is the condition for formations, and birth is the condition for old age and death. It is by reason of ignorance up to birth that formations are caused to continue unceasingly until old age and death.",
        "source": "T10n0279_037:0194b07_1"
    },
    {
        "source_sentence": "助成故。",
        "translation": "It's because it helps to form.",
        "source": "T10n0279_037:0194b08_2"
    },
    {
        "source_sentence": "無明滅則行滅，乃至生滅則老死滅者，由無明乃至生不為緣，令諸行乃至老死斷滅，",
        "translation": "The cessation of nescience is the cessation of conditioned forces, and the cessation of birth is the cessation of old age and death. “The cessation of old age and death is the cessation”: Because nescience up to",
        "source": "T10n0279_037:0194b09_0"
    },
    {
        "source_sentence": "不助成故。",
        "translation": "It's because they don't help form it.",
        "source": "T10n0279_037:0194b10_1"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0194b11_2"
    },
    {
        "source_sentence": "此中無明、愛、取不斷是煩惱道，行、有不斷是業道，餘分不斷是苦道；",
        "translation": "\\",
        "source": "T10n0279_037:0194b11_3"
    },
    {
        "source_sentence": "前後際分別滅三道斷，如是三道離我、我所，但有生滅，猶如束蘆。",
        "translation": "In this way, the three paths are free from self and what belongs to self. There is only arising and ceasing, just as a bundle of reeds.",
        "source": "T10n0279_037:0194b12_4"
    },
    {
        "source_sentence": "復次，無明緣行者，是觀過去；",
        "translation": "“Furthermore, conditioned forces having ignorance as supporting object are the observation of the past.",
        "source": "T10n0279_037:0194b14_5"
    },
    {
        "source_sentence": "識乃至受，是觀現在；",
        "translation": "Consciousness up to feeling is the comprehension of the present.",
        "source": "T10n0279_037:0194b14_6"
    },
    {
        "source_sentence": "愛乃至有，是觀未來。",
        "translation": "Desire and even existence are contemplations of the future.",
        "source": "T10n0279_037:0194b15_7"
    },
    {
        "source_sentence": "於是以後，展轉相續。",
        "translation": "After that, they continue one after the other.",
        "source": "T10n0279_037:0194b15_8"
    },
    {
        "source_sentence": "無明滅行滅者，是觀待斷。",
        "translation": "The cessation of nescience and the cessation of volition are contemplations that await cessation.",
        "source": "T10n0279_037:0194b16_9"
    },
    {
        "source_sentence": "復次，十二有支名為三苦，此中無明、行乃至六處是行苦，觸、受是苦苦，",
        "translation": "\\",
        "source": "T10n0279_037:0194b16_10"
    },
    {
        "source_sentence": "餘是壞苦；",
        "translation": "The rest are the pain of disintegration.",
        "source": "T10n0279_037:0194b18_11"
    },
    {
        "source_sentence": "無明滅行滅者，是三苦斷。",
        "translation": "The cessation of nescience and the cessation of volition are the three kinds of suffering that are stopped.",
        "source": "T10n0279_037:0194b18_12"
    },
    {
        "source_sentence": "復次，無明緣行者，無明因緣能生諸行；",
        "translation": "“Furthermore, formations conditioned by ignorance”: The causes and conditions of ignorance can give rise to formations.",
        "source": "T10n0279_037:0194b19_13"
    },
    {
        "source_sentence": "無明滅行滅者，以無無明，諸行亦無，餘亦如是。",
        "translation": "When ignorance ceases and formations cease, it's because there's no ignorance that the formations are also absent, and so is the rest.",
        "source": "T10n0279_037:0194b20_14"
    },
    {
        "source_sentence": "又無明緣行者，是生繫縛；",
        "translation": "The conditioned forces having ignorance for their object are the fetters of rebirth.",
        "source": "T10n0279_037:0194b21_15"
    },
    {
        "source_sentence": "無明滅行滅者，是滅繫縛。",
        "translation": "The cessation of nescience and the cessation of volition are the fetters of cessation.",
        "source": "T10n0279_037:0194b21_16"
    },
    {
        "source_sentence": "餘亦如是。",
        "translation": "The rest are likewise.",
        "source": "T10n0279_037:0194b22_17"
    },
    {
        "source_sentence": "又無明緣行者，是隨順無所有觀；",
        "translation": "Also, conditioned by nescience is the contemplation of following nonexistence.",
        "source": "T10n0279_037:0194b22_18"
    },
    {
        "source_sentence": "無明滅行滅者，是隨順盡滅觀。",
        "translation": "The cessation of nescience and the cessation of conditioned states is the contemplation that follows the cessation of extinction.",
        "source": "T10n0279_037:0194b23_19"
    },
    {
        "source_sentence": "餘亦如是。",
        "translation": "The rest are likewise.",
        "source": "T10n0279_037:0194b24_20"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0194b24_21"
    },
    {
        "source_sentence": "菩薩摩訶薩如是十種逆順觀諸緣起。",
        "translation": "Thus, the bodhisattva Mahāsattva thus observes these ten kinds of adverse conditions as dependent arising.",
        "source": "T10n0279_037:0194b24_22"
    },
    {
        "source_sentence": "所謂：有支相續故，一心所攝故，自業差別故，不相捨離故，三道不斷故，",
        "translation": "Because there are members that continue one after the other, because they are included in a single mental state, because of differences in specific actions, because they do not abandon each other, because the three paths do not break up.",
        "source": "T10n0279_037:0194b25_23"
    },
    {
        "source_sentence": "觀過去、現在、未來故，三苦聚集故，因緣生滅故，生滅繫縛故，無所有、盡觀故：「佛子，",
        "translation": "It's because they observe past, present, and future, because the three kinds of suffering are gathered together, because causes and conditions arise and cease, because birth and cessation are fettered, because there's nothing to be possessed and",
        "source": "T10n0279_037:0194b27_24"
    },
    {
        "source_sentence": "菩薩摩訶薩以如是十種相觀諸緣起，知無我、無人、無壽命、自性空、無作者、無受者，",
        "translation": "“Enlightening beings observe dependent origination in these ten ways: they know that there is no self, no person, no life span, emptiness of self-nature, no maker, and no receiver.",
        "source": "T10n0279_037:0194b29_25"
    },
    {
        "source_sentence": "即得空解脫門現在前。",
        "translation": "That's when the liberation gate of attaining emptiness is manifested in front of him.",
        "source": "T10n0279_037:0194c02_0"
    },
    {
        "source_sentence": "觀諸有支皆自性滅，畢竟解脫，無有少法相生，即時得無相解脫門現在前。",
        "translation": "Observing that all the branches of existence are inherently extinguished, he's ultimately liberated, has no few characteristics to give rise to, and immediately attains the aspect of markless liberation that appears before him.",
        "source": "T10n0279_037:0194c02_1"
    },
    {
        "source_sentence": "如是入空、無相已，無有願求，唯除大悲為首，教化眾生，即時得無願解脫門現在前。",
        "translation": "Thus, after entering emptiness and signlessness, there's no wish to seek it, except for great compassion as the first, which teaches sentient beings and immediately attains the liberation gate of wishlessness that's present",
        "source": "T10n0279_037:0194c04_2"
    },
    {
        "source_sentence": "菩薩如是修三解脫門，離彼、我想，離作者、受者想，離有、無想。",
        "translation": "Bodhisattvas thus cultivate the three gates of liberation, parting with those who are free of that and self, parting with the perception of author and sensation, and parting with the perception of existence and nonexistence.",
        "source": "T10n0279_037:0194c06_3"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0194c08_0"
    },
    {
        "source_sentence": "此菩薩摩訶薩大悲轉增，精勤修習，為未滿菩提分法令圓滿故，作是念：『一切有為，",
        "translation": "“These great enlightening beings’ great compassion increases, and they diligently cultivate it because they have not fulfilled the factors of enlightenment. They think:",
        "source": "T10n0279_037:0194c08_1"
    },
    {
        "source_sentence": "有和合則轉，無和合則不轉；",
        "translation": "When there is harmony, it proceeds; when there is no harmony, it does not proceed.",
        "source": "T10n0279_037:0194c10_0"
    },
    {
        "source_sentence": "緣集則轉，緣不集則不轉。",
        "translation": "When the supporting object is accumulated, it proceeds; when the supporting object is not accumulated, it does not proceed.",
        "source": "T10n0279_037:0194c10_1"
    },
    {
        "source_sentence": "我如是知有為法多諸過患，當斷此和合因緣；",
        "translation": "Thus do I know that conditioned things are full of faults and distress. I should eliminate the causes and conditions for this conjunction.",
        "source": "T10n0279_037:0194c11_2"
    },
    {
        "source_sentence": "然為成就眾生故，亦不畢竟滅於諸行。』",
        "translation": "However, it's because they accomplish sentient beings that they don't completely cease their actions.'",
        "source": "T10n0279_037:0194c12_3"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0194c13_4"
    },
    {
        "source_sentence": "菩薩如是觀察有為多諸過患，無有自性，不生不滅，而恒起大悲，不捨眾生，",
        "translation": "“Thus do enlightening beings observe the many faults of conditioned things, which have no self-nature and are not produced or destroyed; yet they always develop great compassion and do not abandon sentient beings.",
        "source": "T10n0279_037:0194c13_5"
    },
    {
        "source_sentence": "即得般若波羅蜜現前，名：無障礙智光明。",
        "translation": "That is, they attain the manifestation of the perfection of wisdom called unobstructed light of knowledge.",
        "source": "T10n0279_037:0194c15_6"
    },
    {
        "source_sentence": "成就如是智光明已，雖修習菩提分因緣而不住有為中，雖觀有為法自性寂滅亦不住寂滅中，",
        "translation": "Having perfected this light of knowledge, they cultivate the causes and conditions for enlightenment but do not abide in conditioned things. Though they contemplate the cessation of conditioned things by themselves, yet they do not abide in that cessation.",
        "source": "T10n0279_037:0194c16_7"
    },
    {
        "source_sentence": "以菩提分法未圓滿故。",
        "translation": "It's because the factors of enlightenment haven't been perfected.",
        "source": "T10n0279_037:0194c18_8"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0194c19_0"
    },
    {
        "source_sentence": "菩薩住此現前地，得入空三昧、自性空三昧、第一義空三昧、第一空三昧、大空三昧、合空三昧、起空三昧、如實不分別空三昧、不捨離空三昧、離不離空三昧。",
        "translation": "When the bodhisattva abides in this manifest stage, he attains the samādhi of entering emptiness, the samādhi of emptiness of self-nature, the samādhi of emptiness of the ultimate truth, the sa",
        "source": "T10n0279_037:0194c19_1"
    },
    {
        "source_sentence": "此菩薩得如是十空三昧門為首，百千空三昧皆悉現前；",
        "translation": "“These enlightening beings attain ten kinds of concentration on emptiness, led by these ten kinds of concentration on emptiness:",
        "source": "T10n0279_037:0194c22_2"
    },
    {
        "source_sentence": "如是十無相、十無願三昧門為首，百千無相、無願三昧門皆悉現前。",
        "translation": "Thus, these ten signless and ten wishless samādhis are the first, and a hundred thousand signless and wishless samādhis all appear before them.",
        "source": "T10n0279_037:0194c23_3"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0194c26_0"
    },
    {
        "source_sentence": "菩薩住此現前地，復更修習滿足不可壞心、決定心、純善心、甚深心、不退轉心、不休息心、廣大心、無邊心、求智心、方便慧相應心，",
        "translation": "“Furthermore, the enlightening beings in this stage of Presence cultivate and fulfill the indestructible mind, the determined mind, the pure good mind, the profound mind, the nonregressing mind, the unceasing mind, the",
        "source": "T10n0279_037:0194c26_1"
    },
    {
        "source_sentence": "皆悉圓滿。",
        "translation": "They are all completely complete.",
        "source": "T10n0279_037:0194c29_2"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0195a01_0"
    },
    {
        "source_sentence": "菩薩以此心順佛菩提，不懼異論，入諸智地，離二乘道，趣於佛智，諸煩惱魔無能沮壞，",
        "translation": "Because of this mind, enlightening beings follow the Buddha’s path of enlightenment. They are not afraid of heretical theories; they enter the stages of knowledge, leaving behind the paths of the two vehicles and proceeding toward buddha-know",
        "source": "T10n0279_037:0195a01_1"
    },
    {
        "source_sentence": "住於菩薩智慧光明，於空、無相、無願法中皆善修習，方便智慧恒共相應，",
        "translation": "They dwell in the light of knowledge of enlightening beings’ knowledge, and skillfully practice emptiness, signlessness, and wishlessness; their knowledge of means is always conjoined with them.",
        "source": "T10n0279_037:0195a03_2"
    },
    {
        "source_sentence": "菩提分法常行不捨。",
        "translation": "The factors of enlightenment are always practiced and not abandoned.",
        "source": "T10n0279_037:0195a04_3"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0195a05_4"
    },
    {
        "source_sentence": "菩薩住此現前地中，得般若波羅蜜行增上，得第三明利順忍，以於諸法如實相隨順無違故。",
        "translation": "In this manifest stage, the bodhisattva attains the practice of prajñā-pāramitā that increases and attains the third kind of forbearance that explains benefits because he follows the true characteristics of all dharmas",
        "source": "T10n0279_037:0195a05_5"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0195a08_0"
    },
    {
        "source_sentence": "菩薩住此現前地已，以願力故，得見多佛。",
        "translation": "After the bodhisattva abides in this stage of manifesting, he's able to see many buddhas because of the power of his vow.",
        "source": "T10n0279_037:0195a08_1"
    },
    {
        "source_sentence": "所謂：見多百佛，乃至見多百千億那由他佛。",
        "translation": "That is to say, they see many hundreds of thousands of buddhas... millions of billions of buddhas.",
        "source": "T10n0279_037:0195a09_2"
    },
    {
        "source_sentence": "悉以廣大心、深心，供養恭敬，尊重讚歎，衣服、飲食、臥具、湯藥，",
        "translation": "They all offered support, respect, veneration, and praise with vast minds and profound hearts, offering clothing, food and drink, bedding, and bathing water.",
        "source": "T10n0279_037:0195a10_3"
    },
    {
        "source_sentence": "一切資生悉以奉施，亦以供養一切眾僧，以此善根迴向阿耨多羅三藐三菩提。",
        "translation": "They give all their necessities as offerings and also make offerings to all the saṃgha, dedicating these good roots to unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_037:0195a11_4"
    },
    {
        "source_sentence": "於諸佛所，恭敬聽法，聞已受持，得如實三昧智慧光明，隨順修行，憶持不捨。",
        "translation": "In the presence of the Buddhas they honor and listen respectfully to the Teaching. Having heard them, they receive and retain them; attaining true concentration, wisdom, and illumination, they follow and practice them, remembering and upholding them without giving up",
        "source": "T10n0279_037:0195a13_5"
    },
    {
        "source_sentence": "又得諸佛甚深法藏，經於百劫，經於千劫，乃至無量百千億那由他劫，",
        "translation": "He also attained the profound treasury of the teachings of all buddhas for one hundred eons, a thousand eons, up to an infinite number of trillions of eons.",
        "source": "T10n0279_037:0195a14_6"
    },
    {
        "source_sentence": "所有善根轉更明淨。",
        "translation": "All the good roots that exist become increasingly clear and pure.",
        "source": "T10n0279_037:0195a16_7"
    },
    {
        "source_sentence": "譬如真金，以毘瑠璃寶數數磨瑩，轉更明淨；",
        "translation": "It is as if genuine gold were polished repeatedly with lapis lazuli jewels, which would become increasingly clear and pure.",
        "source": "T10n0279_037:0195a17_0"
    },
    {
        "source_sentence": "此地菩薩所有善根亦復如是，以方便慧，隨逐觀察，轉更明淨，轉復寂滅，",
        "translation": "The roots of goodness possessed by enlightening beings in this stage are also like this. By means of skillful means and wisdom they follow and observe each other, becoming clearer and cleaner, further and further disappearing.",
        "source": "T10n0279_037:0195a18_0"
    },
    {
        "source_sentence": "無能映蔽。",
        "translation": "There's nothing that can overshadow it.",
        "source": "T10n0279_037:0195a19_1"
    },
    {
        "source_sentence": "譬如月光，照眾生身，令得清涼，四種風輪所不能壞；",
        "translation": "It is like the light of the moon that illumines the bodies of sentient beings and enables them to attain clarity and coolness, which cannot be broken down by any of the four kinds of wind.",
        "source": "T10n0279_037:0195a19_2"
    },
    {
        "source_sentence": "此地菩薩所有善根亦復如是，能滅無量百千億那由他眾生煩惱熾火，四種魔道所不能壞。",
        "translation": "The roots of goodness possessed by enlightening beings in this stage are also like this, able to extinguish the afflictive flames of immeasurable hundreds of thousands of myriads of koṭis of nayutas of sentient being",
        "source": "T10n0279_037:0195a21_3"
    },
    {
        "source_sentence": "此菩薩，十波羅蜜中，般若波羅蜜偏多；",
        "translation": "Among the ten transcendent ways, transcendent wisdom is predominant in these enlightening beings.",
        "source": "T10n0279_037:0195a23_4"
    },
    {
        "source_sentence": "餘非不修，但隨力隨分。",
        "translation": "The others are not uncultivated: they are only secondary and secondary according to one’s ability.",
        "source": "T10n0279_037:0195a24_5"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0195a24_6"
    },
    {
        "source_sentence": "是名：略說菩薩摩訶薩第六現前地。",
        "translation": "This is called the sixth stage of enlightening beings’ manifesting great compassion.",
        "source": "T10n0279_037:0195a24_7"
    },
    {
        "source_sentence": "菩薩住此地，多作善化天王，所作自在，一切聲聞所有問難無能退屈，",
        "translation": "The enlightening beings in this stage are mostly celestial kings of good emanations, free to do as they please. All the questions and difficulties of all the disciples cannot be dispelled by them.",
        "source": "T10n0279_037:0195a25_8"
    },
    {
        "source_sentence": "能令眾生除滅我慢、深入緣起。",
        "translation": "They can cause sentient beings to remove self-conceit and enter deeply into dependent arising.",
        "source": "T10n0279_037:0195a27_9"
    },
    {
        "source_sentence": "布施、愛語、利行、同事——如是一切諸所作業，皆不離念佛，乃至不離念具足一切種、一切智智。",
        "translation": "Giving, loving words, beneficial actions, and coworkers-all these things they do don't part from mindfulness of the Buddha, even to the point where they don't part from mindfulness that are endowed with all kinds and omniscience.",
        "source": "T10n0279_037:0195a27_10"
    },
    {
        "source_sentence": "復作是念：『我當於一切眾生中為首、為勝，乃至為一切智智依止者。』",
        "translation": "Again, he thinks, 'Should I be the first and foremost among all sentient beings, up to the point where I'll be the basis of omniscience and cognition?'",
        "source": "T10n0279_037:0195a29_11"
    },
    {
        "source_sentence": "此菩薩若勤行精進，於一念頃，得百千億三昧，乃至示現百千億菩薩以為眷屬；",
        "translation": "If these enlightening beings diligently practice and make effort, in an instant they attain a hundred thousand myriads of koṭis of concentrations, up to manifesting ten thousand myriads of koṭis of enlightening beings as their retinues",
        "source": "T10n0279_037:0195b02_12"
    },
    {
        "source_sentence": "若以願力自在示現，過於此數，乃至百千億那由他劫不能數知。」",
        "translation": "If he shows it freely with the power of his vow, it's beyond that number and can't be counted for a hundred thousand million nayutas.",
        "source": "T10n0279_037:0195b04_13"
    },
    {
        "source_sentence": "「菩薩圓滿五地已，　　觀法無相亦無性，",
        "translation": "Enlightening beings, having perfected the fifth stage, Observe that things have no signs and also no essence:",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　無生無成本清淨，　　無有戲論無取捨，",
        "translation": "The absence of arising and the absence of cost are pure; There is no conceptual elaboration, no taking or leaving.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　體相寂滅如幻等，　　有無不二離分別，",
        "translation": "The essence and characteristics are tranquil like illusions, etc. Existence and nonexistence are not two, free from discrimination.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　隨順法性如是觀，　　此智得成入六地。",
        "translation": "Consistent with the nature of dharmas, they are thus observed, and this knowledge enables them to enter six stages.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　明利順忍智具足，　　觀察世間生滅相，",
        "translation": "Fulfilled with knowledge of patience and tolerance, they observe the world’s signs of birth and death.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　以癡闇力世間生，　　若滅癡闇世無有。",
        "translation": "The world arises by the power of the darkness of delusion, and if it were to cease the darkness of delusion, there wouldn't be a world.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　觀諸因緣實義空，　　不壞假名和合用，",
        "translation": "Observing the emptiness of causes and conditions as real meanings, they don’t destroy compounded names or functions.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　無作無受無思念，　　諸行如雲遍興起。",
        "translation": "Unconstructed, ungraspable, without sensation or thought, All conditioned things arise like clouds.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　不知真諦名無明，　　所作思業愚癡果，",
        "translation": "They do not know that the true truth is called ignorance, And their acts of thought and action are the results of folly.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　識起共生是名色，　　如是乃至眾苦聚。",
        "translation": "Consciousness that gives rise to it together is name and form, thus up to the mass of suffering.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　了達三界依心有，　　十二因緣亦復然，",
        "translation": "Realizing that the three realms exist based on mind, So are the twelve causes and conditions.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　生死皆由心所作，　　心若滅者生死盡。",
        "translation": "Birth and death are all due to the action of thought; When thought ceases, birth and death will end.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　無明所作有二種，　　緣中不了為行因，",
        "translation": "There are two kinds of that which is done by ignorance. Not being understood in relation to the supporting object is the conditioning cause:",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　如是乃至老終歿，　　從此苦生無有盡。",
        "translation": "Thus, up to the end of old age and death, there's no end to the suffering that arises from this.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　無明為緣不可斷，　　彼緣若盡悉皆滅，",
        "translation": "The condition of nescience is not to be abandoned: When these conditions are exhausted, they all perish.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　愚癡愛取煩惱支，　　行有是業餘皆苦。",
        "translation": "Foolishly, craving and grasping are the members of affliction. Karmic forces exist as actions; the rest are all painful.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　癡至六處是行苦，　　觸受增長是苦苦，",
        "translation": "The six āyatanas of delusion are the frustration of conditioned states. The increase of contact and feeling is the frustration of unsatisfactoriness.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　所餘有支是壞苦，　　若見無我三苦滅。",
        "translation": "The other members of existence are frustration with disintegration. If one sees selflessness, the three forms of frustration will be extinguished.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　無明與行為過去，　　識至於受現在轉，",
        "translation": "Consciousness evolves in the present as far as sensation is concerned.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　愛取有生未來苦，　　觀待若斷邊際盡。",
        "translation": "Desire and grasping have future suffering that arises, and the limits of contemplation are exhausted if they stop.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　無明為緣是生縛，　　於緣得離縛乃盡，",
        "translation": "Conditioned by ignorance, they are bound to rebirth. Their liberation from bondage through conditions is complete.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　從因生果離則斷，　　觀察於此知性空。",
        "translation": "When the result arises from causes, it's cut off; Observing this, he knows the emptiness of its nature.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　隨順無明起諸有，　　若不隨順諸有斷，",
        "translation": "It follows ignorance that produces existence. If it does not follow existence, it is to be abandoned.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　此有彼有無亦然，　　十種思惟心離著。",
        "translation": "The same applies to the existence or nonexistence of this and that: Ten kinds of reflection are free from attachment in awarenesses.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　有支相續一心攝，　　自業不離及三道，",
        "translation": "The members of existence are, in succession, subsumed by one mind. Self-action is not separate from it; and the three paths.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　三際三苦因緣生，　　繫縛起滅順無盡。",
        "translation": "The causes and conditions of suffering at the three extremes arise, and the fetters that arise and cease follow endlessly.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　如是普觀緣起行，　　無作無受無真實，",
        "translation": "In this way he observes all conditioned phenomena, Unmanifest, ungraspable, unreal, without reality.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　如幻如夢如光影，　　亦如愚夫逐陽焰。",
        "translation": "They are like illusions, like dreams, like lights and shadows, And like ignorant people chasing the flames of the sun.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　如是觀察入於空，　　知緣性離得無相，",
        "translation": "Observing and entering emptiness in this way, They know that the nature of conditioned things is apart from acquisition And has no form.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　了其虛妄無所願，　　唯除慈愍為眾生。",
        "translation": "Understanding their falsehood, they have no wishes except for kindness and pity for sentient beings.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　大士修行解脫門，　　轉益大悲求佛法，",
        "translation": "Great beings cultivate the door of liberation, Increasing great compassion and seeking the buddha-dharma.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　知諸有為和合作，　　志樂決定勤行道。",
        "translation": "Knowing the harmonious cooperation of conditioned beings, They eagerly and determinedly practice the path.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　空三昧門具百千，　　無相無願亦復然，",
        "translation": "The samādhi-gate of emptiness contains a hundred thousand: So it is with signlessness and wishlessness.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　般若順忍皆增上，　　解脫智慧得成滿。",
        "translation": "Prajñāpāramitā and forbearance all increase, and liberation and wisdom become complete.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　復以深心多供佛，　　於佛教中修習道，",
        "translation": "With great zeal they served the Buddhas, And cultivated enlightenment in Buddhism.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　得佛法藏增善根，　　如金瑠璃所磨瑩。",
        "translation": "Attaining the Buddha’s treasury of truth, they increase their roots of goodness, Like polished gold and lapis lazuli.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　如月清涼被眾物，　　四風來觸無能壞；",
        "translation": "Like the moon coolly covering all things, The four winds coming and going cannot break it down.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　此地菩薩超魔道，　　亦息群生煩惱熱。",
        "translation": "Enlightening beings in this stage have transcended the realm of Māra And also extinguished the afflictions and fever of sentient beings.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　此地多作善化王，　　化導眾生除我慢，",
        "translation": "In this land they become kings of instruction, Teaching and guiding sentient beings, getting rid of self-conceit.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　所作皆求一切智，　　悉已超勝聲聞道。",
        "translation": "Whatever they do, they seek omniscience and have all transcended the path of the śrāvakas.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　此地菩薩勤精進，　　獲諸三昧百千億，",
        "translation": "Enlightening beings in this stage, diligently striving, Attain hundreds of thousands of myriads of koṭis of concentrations.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　亦見若干無量佛，　　譬如盛夏空中日。",
        "translation": "They also see various immeasurable buddhas, Like the rising sun in the sky of summer.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　甚深微妙難見知，　　聲聞獨覺無能了，",
        "translation": "It’s profound and subtle, hard to see or know; Listeners and solitary realizers cannot comprehend it.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　如是菩薩第六地，　　我為佛子已宣說。」",
        "translation": "Thus, this is the sixth ground of the bodhisattva, which I've explained for the sake of the Buddha-child.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　是時天眾心歡喜，　　散寶成雲在空住，",
        "translation": "The gods then rejoiced and scattered jewel-producing clouds in the sky.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　普發種種妙音聲，　　告於最勝清淨者：",
        "translation": "Producing various kinds of beautiful sounds everywhere, They tell the supremely pure:",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "「了達勝義智自在，　　成就功德百千億，",
        "translation": "Understanding the sovereignty of knowledge of ultimate meaning, Accomplishing hundreds of thousands of koṭis of virtues",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　人中蓮華無所著，　　為利群生演深行。」",
        "translation": "The lotus among humans has no attachment, and he teaches profound practice for the benefit of sentient beings.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　自在天王在空中，　　放大光明照佛身，",
        "translation": "The sovereign celestial king is in the sky, radiating great light to illuminate the Buddha’s body.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　亦散最上妙香雲，　　普供除憂煩惱者。",
        "translation": "They also scatter the supreme cloud of wondrous fragrance, A universal offering for those freed from sorrow and afflictions.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　爾時天眾皆歡喜，　　悉發美音同讚述：",
        "translation": "At that point, the celestial beings all rejoiced, All producing beautiful sounds of praise together, saying:",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "「我等聞斯地功德，　　則為已獲大善利。」",
        "translation": "When we hear the merit of this place, we'll attain great good benefits.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　天女是時心慶悅，　　競奏樂音千萬種，",
        "translation": "The goddesses were delighted, playing thousands of kinds of music.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　悉以如來神力故，　　音中共作如是言：",
        "translation": "Because of the spiritual power of the Enlightened, They all spoke together in unison, saying:",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "「威儀寂靜最無比，　　能調難調世應供，",
        "translation": "Their deportment is tranquil and most incomparable, able to tame those who are unable to tame the world in ways worthy of offering.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　已超一切諸世間，　　而行於世闡妙道。",
        "translation": "Having transcended all worlds, They practice in the world to reveal the wondrous path.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　雖現種種無量身，　　知身一一無所有，",
        "translation": "Though they manifest various bodies of infinity, They know each body has no existence.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　巧以言辭說諸法，　　不取文字音聲相。",
        "translation": "He skillfully explains the teachings in words without grasping words, sounds, or characteristics.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　往詣百千諸國土，　　以諸上供供養佛，",
        "translation": "In hundreds of thousands of myriads of buddha-lands I served the enlightened with various offerings.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　智慧自在無所著，　　不生於我佛國想。",
        "translation": "Their knowledge and wisdom are unimpeded, free from attachment; They do not give rise to thoughts of self or buddhahood.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　雖勤教化諸眾生，　　而無彼己一切心；",
        "translation": "Though they diligently lead and inspire sentient beings, Yet they do not have any thought of their own.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　雖已修成廣大善，　　而於善法不生著。",
        "translation": "Even though they have cultivated vast goodness, They don’t become attached to the virtuous.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　以見一切諸世間，　　貪恚癡火常熾然，",
        "translation": "Because they see all worlds Always burning with the fire of lust, hatred, and folly.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　於諸想念悉皆離，　　發起大悲精進力。」",
        "translation": "They are completely free of all thoughts and give rise to the power of great compassion and effort.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　一切諸天及天女，　　種種供養稱讚已，",
        "translation": "All the gods and celestial maidens offered various offerings and praised them.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　悉共同時默然住，　　瞻仰人尊願聞法。",
        "translation": "They all remained silent at the same time, gazing at the venerable people and wishing to hear the teaching.",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　時解脫月復請言：　　「此諸大眾心清淨，",
        "translation": "The moon of liberation then again asked, These beings are pure in mind:",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "　第七地中諸行相，　　唯願佛子為宣說！」",
        "translation": "The characteristics of the seventh ground's practices, may only the Buddha-child proclaim them for him!",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩欲重宣其義而說頌曰：第七地爾時，金剛藏菩薩告解脫月菩薩言：「佛子！",
        "translation": "At that point, the Vajragarbha Bodhisattva wanted to reiterate its meaning and spoke a verse, saying, At the seventh ground, the Vajragarbha Bodhisattva addressed the Moon of Liberation Bodhisattva, saying, Son of",
        "source": "T10n0279_037:0195b05_14"
    },
    {
        "source_sentence": "菩薩摩訶薩具足第六地行已，欲入第七遠行地，當修十種方便慧起殊勝道。",
        "translation": "After fulfilling the practice of the sixth ground, the bodhisattva Mahāsattva wants to enter the seventh ground of far-reaching practice, and he'll cultivate ten kinds of skillful means and wisdom that give rise to the superior path",
        "source": "T10n0279_037:0196a18_15"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T10n0279_037:0196a20_16"
    },
    {
        "source_sentence": "所謂：雖善修空、無相、無願三昧，而慈悲不捨眾生，雖得諸佛平等法，",
        "translation": "That is to say, though they skillfully cultivate the concentrations of emptiness, signlessness, and wishlessness, yet kindly and compassionately do not abandon sentient beings; even though they attain the equality of all buddhas.",
        "source": "T10n0279_037:0196a20_17"
    },
    {
        "source_sentence": "而樂常供養佛；",
        "translation": "They delight in always honoring buddhas.",
        "source": "T10n0279_037:0196a22_18"
    },
    {
        "source_sentence": "雖入觀空智門，而勤集福德；",
        "translation": "Though they enter the door of knowledge of contemplation on emptiness, yet they diligently accumulate virtue.",
        "source": "T10n0279_037:0196a22_19"
    },
    {
        "source_sentence": "雖遠離三界，而莊嚴三界；",
        "translation": "Though they are far removed from the three realms, yet they adorn the three realms.",
        "source": "T10n0279_037:0196a23_20"
    },
    {
        "source_sentence": "雖畢竟寂滅諸煩惱焰，而能為一切眾生起滅貪、瞋、癡煩惱焰；",
        "translation": "Though they ultimately extinguish the flame of afflictions, yet they can produce for all sentient beings the flame of affliction that extinguishes craving, hatred, and delusion.",
        "source": "T10n0279_037:0196a24_21"
    },
    {
        "source_sentence": "雖知諸法如幻、如夢、如影、如響、如焰、如化、如水中月、如鏡中像、自性無二，",
        "translation": "Though they know all things are like illusions, like dreams, like reflections, like echoes, like flames, like magic tricks, like the moon in water, like reflected images in a mirror, and their essential natures are not two.",
        "source": "T10n0279_037:0196a25_22"
    },
    {
        "source_sentence": "而隨心作業無量差別；",
        "translation": "There are innumerable distinctions in the activities of minds according to their mental states.",
        "source": "T10n0279_037:0196a27_23"
    },
    {
        "source_sentence": "雖知一切國土猶如虛空，而能以清淨妙行莊嚴佛土；",
        "translation": "Though they know all lands are like space, yet they can adorn buddha-lands with pure and wonderful practices.",
        "source": "T10n0279_037:0196a27_24"
    },
    {
        "source_sentence": "雖知諸佛法身本性無身，而以相好莊嚴其身；",
        "translation": "Though they know the essential nature of the buddhas’ reality-body has no body, yet they adorn their bodies with beautiful features.",
        "source": "T10n0279_037:0196a28_25"
    },
    {
        "source_sentence": "雖知諸佛音聲性空寂滅不可言說，而能隨一切眾生出種種差別清淨音聲；",
        "translation": "Though they know the nature of buddhas’ sounds is void, tranquil, and inexpressible, yet they can produce various different pure sounds adapted to all sentient beings.",
        "source": "T10n0279_037:0196a29_26"
    },
    {
        "source_sentence": "雖隨諸佛了知三世唯是一念，而隨眾生意解分別，以種種相、種種時、種種劫數而修諸行。",
        "translation": "Even though they follow the buddhas and know that the three worlds are only one thought, they discern and discriminate according to the business of their minds, cultivating practices with various forms, times, and eons.",
        "source": "T10n0279_037:0196b02_27"
    },
    {
        "source_sentence": "菩薩以如是十種方便慧起殊勝行，從第六地入第七地；",
        "translation": "“Thus do enlightening beings, by means of these ten kinds of knowledge of means, produce superior practices:",
        "source": "T10n0279_037:0196b04_28"
    },
    {
        "source_sentence": "入已，此行常現在前，名為：住第七遠行地。",
        "translation": "After entering, these formations always appear before them:",
        "source": "T10n0279_037:0196b06_29"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0196b07_0"
    },
    {
        "source_sentence": "菩薩摩訶薩住此第七地已，入無量眾生界，入無量諸佛教化眾生業，入無量世界網，",
        "translation": "“Furthermore, the great enlightening beings in this seventh stage enter infinite realms of sentient beings; they enter infinite oceans of buddha-teachings to develop sentient beings; they enter infinite networks of world",
        "source": "T10n0279_037:0196b07_1"
    },
    {
        "source_sentence": "入無量諸佛清淨國土，入無量種種差別法，入無量諸佛現覺智，入無量劫數，",
        "translation": "They entered the pure lands of infinite buddhas, into infinite different teachings, into the knowledge of enlightenment of infinite buddhas, and into the eons of infinity.",
        "source": "T10n0279_037:0196b09_2"
    },
    {
        "source_sentence": "入無量諸佛覺了三世智，入無量眾生差別信解，入無量諸佛示現種種名色身，",
        "translation": "He entered the boundless buddhas’ enlightenment-knowledge of all times. He entered the differentiating faith and understanding of infinite sentient beings.",
        "source": "T10n0279_037:0196b10_3"
    },
    {
        "source_sentence": "入無量眾生欲樂諸根差別，入無量諸佛語言音聲令眾生歡喜，入無量眾生種種心行，",
        "translation": "Entering into the various faculties of infinite sentient beings’ desires and inclinations, entering into the speech and sounds of infinite buddhas, they cause sentient beings to rejoice.",
        "source": "T10n0279_037:0196b12_4"
    },
    {
        "source_sentence": "入無量諸佛了知廣大智，入無量聲聞乘信解，入無量諸佛說智道令信解，",
        "translation": "They enter the boundless buddhas’ knowledge of vast knowledge, enter the boundless vehicles of disciples’ enlightenment, and enter the boundless Buddha-teachings.",
        "source": "T10n0279_037:0196b14_5"
    },
    {
        "source_sentence": "入無量辟支佛所成就，入無量諸佛說甚深智慧門令趣入，入無量諸菩薩方便行，",
        "translation": "“Great enlightening beings enter into the practice of innumerable paths of liberation developed by innumerable individual buddhas. They enter into the teachings of innumerable buddhas, and are led to their entry by innumerable",
        "source": "T10n0279_037:0196b16_6"
    },
    {
        "source_sentence": "入無量諸佛所說大乘集成事令菩薩得入。",
        "translation": "He enters the great vehicle that's taught by measureless buddhas and integrates the works of the great vehicle so that bodhisattvas can enter it.",
        "source": "T10n0279_037:0196b18_7"
    },
    {
        "source_sentence": "此菩薩作是念：『如是無量如來境界，乃至於百千億那由他劫不能得知，",
        "translation": "“These enlightening beings think, ‘Such is the boundless realm of buddhahood of all buddhas, which cannot be known even for billions of eons.",
        "source": "T10n0279_037:0196b19_8"
    },
    {
        "source_sentence": "我悉應以無功用無分別心成就圓滿。』",
        "translation": "I should all accomplish it with a mind that's free of effort and free of discrimination.'",
        "source": "T10n0279_037:0196b20_9"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0196b21_10"
    },
    {
        "source_sentence": "此菩薩以深智慧如是觀察，常勤修習方便慧起殊勝道，安住不動，無有一念休息廢捨；",
        "translation": "These enlightening beings observe with profound knowledge and wisdom in this way, always diligently cultivating skill in means and wisdom to produce the supreme path. Abiding there unshakably, they do not give up or give up any thought of rest.",
        "source": "T10n0279_037:0196b21_11"
    },
    {
        "source_sentence": "行、住、坐、臥乃至睡夢，未曾暫與蓋障相應，常不捨於如是想念。",
        "translation": "He walks, stands, sits, lies, or even sleeps and dreams, never for a moment associated with the hindrance of obscuration, and always doesn't give up such thoughts.",
        "source": "T10n0279_037:0196b23_12"
    },
    {
        "source_sentence": "此菩薩於念念中，常能具足十波羅蜜。",
        "translation": "This bodhisattva is always able to fulfill the ten perfections in every moment of thought.",
        "source": "T10n0279_037:0196b25_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_037:0196b26_14"
    },
    {
        "source_sentence": "念念皆以大悲為首，修行佛法，向佛智故。",
        "translation": "Each thought is led by great compassion, cultivating the Buddha's teachings and heading toward Buddha's wisdom.",
        "source": "T10n0279_037:0196b26_15"
    },
    {
        "source_sentence": "所有善根，為求佛智，施與眾生，是名：檀那波羅蜜；",
        "translation": "The giving of all roots of goodness to sentient beings for the sake of seeking buddha-knowledge is called transcendent giving.",
        "source": "T10n0279_037:0196b27_16"
    },
    {
        "source_sentence": "能滅一切諸煩惱熱，是名：尸羅波羅蜜；",
        "translation": "To be able to extinguish the fever of all afflictions is called transcendent morality.",
        "source": "T10n0279_037:0196b28_17"
    },
    {
        "source_sentence": "慈悲為首，不損眾生，是名：羼提波羅蜜；",
        "translation": "The foremost of all is compassion, not harming sentient beings. This is called transcendent tolerance.",
        "source": "T10n0279_037:0196b29_18"
    },
    {
        "source_sentence": "求勝善法，無有厭足，是名：毘梨耶波羅蜜；",
        "translation": "Seeking the supremely good, without weariness or dissatisfaction, is called transcendent vision.",
        "source": "T10n0279_037:0196c01_19"
    },
    {
        "source_sentence": "一切智道常現在前，未甞散亂，是名：禪那波羅蜜；",
        "translation": "The path of omniscience always present before them, never being scattered or disturbed—this is called transcendent meditation.",
        "source": "T10n0279_037:0196c02_20"
    },
    {
        "source_sentence": "能忍諸法無生無滅，是名：般若波羅蜜；",
        "translation": "Being able to tolerate all things as nonarising and nonperishing is called transcendent wisdom.",
        "source": "T10n0279_037:0196c03_21"
    },
    {
        "source_sentence": "能出生無量智，是名：方便波羅蜜；",
        "translation": "To be able to produce infinite knowledge is called transcendent skill in means.",
        "source": "T10n0279_037:0196c04_22"
    },
    {
        "source_sentence": "能求上上勝智，是名：願波羅蜜；",
        "translation": "Being able to seek supreme knowledge is called the transcendent vow.",
        "source": "T10n0279_037:0196c04_23"
    },
    {
        "source_sentence": "一切異論及諸魔眾無能沮壞，是名：力波羅蜜；",
        "translation": "All heretical doctrines and the hosts of demons cannot overthrow it. This is called transcendent power.",
        "source": "T10n0279_037:0196c05_24"
    },
    {
        "source_sentence": "如實了知一切法，是名：智波羅蜜。",
        "translation": "Knowing all things as they really are is called the transcendent of knowledge.",
        "source": "T10n0279_037:0196c06_25"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0196c07_26"
    },
    {
        "source_sentence": "此十波羅蜜，菩薩於念念中皆得具足；",
        "translation": "Enlightening beings attain these ten transcendent ways in each and every moment of thought.",
        "source": "T10n0279_037:0196c07_27"
    },
    {
        "source_sentence": "如是，四攝、四持、三十七品、三解脫門，略說乃至一切菩提分法，於念念中皆悉圓滿。」",
        "translation": "Thus, these four gatherings, the four supports, the thirty-seven chapters, and the three gates of liberation are briefly explained up to all the factors of enlightenment, which are all perfected in every moment of thought",
        "source": "T10n0279_037:0196c08_28"
    },
    {
        "source_sentence": "爾時，解脫月菩薩問金剛藏菩薩言：「佛子！",
        "translation": "It was then that the Moon of Liberation Bodhisattva asked the Vajragarbha Bodhisattva, saying, Son of the Buddha!",
        "source": "T10n0279_037:0196c11_0"
    },
    {
        "source_sentence": "菩薩但於此第七地中滿足一切菩提分法，為諸地中亦能滿足？」",
        "translation": "A bodhisattva only fulfills all the factors of enlightenment in this seventh ground, but can he also fulfill them in other stages?",
        "source": "T10n0279_037:0196c11_1"
    },
    {
        "source_sentence": "金剛藏菩薩言：「佛子！",
        "translation": "The Vajragarbha Bodhisattva said, Son of the Buddha!",
        "source": "T10n0279_037:0196c13_2"
    },
    {
        "source_sentence": "菩薩於十地中皆能滿足菩提分法，然第七地最為殊勝。",
        "translation": "A bodhisattva can fulfill the factors of enlightenment in ten stages, but the seventh stage is the most distinguished.",
        "source": "T10n0279_037:0196c13_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_037:0196c15_4"
    },
    {
        "source_sentence": "此第七地功用行滿，得入智慧自在行故。",
        "translation": "This seventh stage is with fulfilment of the path of effort: because one acquires the free path of entering wisdom.",
        "source": "T10n0279_037:0196c15_5"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0196c16_6"
    },
    {
        "source_sentence": "菩薩於初地中，緣一切佛法願求故，滿足菩提分法；",
        "translation": "In the first stage, enlightening beings fulfill the factors conducive to enlightenment by focusing on all buddhas’ teachings and vowing to seek them.",
        "source": "T10n0279_037:0196c16_7"
    },
    {
        "source_sentence": "第二地離心垢故，第三地願轉增長得法光明故，第四地入道故，第五地順世所作故，",
        "translation": "The second stage is free from the defilement of thought: because in the third stage one develops and increases the vow to acquire the light of the doctrine. In the fourth stage one enters the path:",
        "source": "T10n0279_037:0196c17_8"
    },
    {
        "source_sentence": "第六地入甚深法門故，第七地起一切佛法故，皆亦滿足菩提分法。",
        "translation": "Because the sixth ground enters the profound dharma-gate, and because all the buddha-dharmas arise in the seventh ground, they all also fulfill the factors of enlightenment.",
        "source": "T10n0279_037:0196c19_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_037:0196c21_10"
    },
    {
        "source_sentence": "菩薩從初地乃至第七地，成就智功用分。",
        "translation": "From the first ground up to the seventh ground, the bodhisattva accomplishes the effort of knowledge.",
        "source": "T10n0279_037:0196c21_11"
    },
    {
        "source_sentence": "以此力故，從第八地乃至第十地，無功用行皆悉成就。",
        "translation": "Because of this power, effortless practices are all accomplished from the eighth ground up to the tenth ground.",
        "source": "T10n0279_037:0196c22_12"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0196c23_13"
    },
    {
        "source_sentence": "譬如有二世界，一處雜染，一處純淨，是二中間難可得過，唯除菩薩有大方便神通願力。",
        "translation": "It's like two worlds that are mixed in one place and purified in another, which are difficult to get through because only the bodhisattva has the power of the great skillful means and vows.",
        "source": "T10n0279_037:0196c23_14"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0196c25_15"
    },
    {
        "source_sentence": "菩薩諸地亦復如是，有雜染行，有清淨行，是二中間難可得過，唯除菩薩有大願力方便智慧乃能得過。」",
        "translation": "The bodhisattvas' stages are likewise, with defiled practice and pure practice, which are difficult to attain in between; only by relying on the bodhisattva's great vow power, skillful means, and wisdom can they at",
        "source": "T10n0279_037:0196c25_16"
    },
    {
        "source_sentence": "解脫月菩薩言：「佛子！",
        "translation": "The Moon of Liberation Bodhisattva said, Son of the Buddha!",
        "source": "T10n0279_037:0196c28_17"
    },
    {
        "source_sentence": "此七地菩薩，為是染行？",
        "translation": "What is the defiled practice of these bodhisattvas of the seventh stage?",
        "source": "T10n0279_037:0196c28_18"
    },
    {
        "source_sentence": "為是淨行？」",
        "translation": "Is this pure practice?",
        "source": "T10n0279_037:0196c29_19"
    },
    {
        "source_sentence": "金剛藏菩薩言：「佛子！",
        "translation": "The Vajragarbha Bodhisattva said, Son of the Buddha!",
        "source": "T10n0279_037:0196c29_20"
    },
    {
        "source_sentence": "從初地至七地，所行諸行皆捨離煩惱業，以迴向無上菩提故，分得平等道故，",
        "translation": "From the first stage up to the seventh stage, all the practices they carry out are free of afflictive actions because they dedicate themselves back to unsurpassed enlightenment and partly attain the path of equality.",
        "source": "T10n0279_037:0196c29_21"
    },
    {
        "source_sentence": "然未名為超煩惱行。",
        "translation": "However, it's not called the practice of transcending afflictions.",
        "source": "T10n0279_037:0197a02_22"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0197a03_0"
    },
    {
        "source_sentence": "譬如轉輪聖王乘天象寶遊四天下，知有貧窮困苦之人，而不為彼眾患所染，",
        "translation": "“Furthermore, it is as if a universal ruler were to travel through the four quarters of the earth on an elephant-drawn carriage drawn by heavenly jewels. He knows that those who are poor and in distress will",
        "source": "T10n0279_037:0197a03_1"
    },
    {
        "source_sentence": "然未名為超過人位；",
        "translation": "However, they are not yet said to be beyond the rank of human beings.",
        "source": "T10n0279_037:0197a04_2"
    },
    {
        "source_sentence": "若捨王身，生於梵世，乘天宮殿，見千世界，遊千世界，示現梵天光明威德，",
        "translation": "If he were to relinquish the king’s body and be reborn in the Brahma world, he would ride through the palace of a heavenly god. He would see a thousand worlds and travel through a thousand worlds, manifesting the splendors of",
        "source": "T10n0279_037:0197a05_3"
    },
    {
        "source_sentence": "爾乃名為超過人位。",
        "translation": "That's called transcending the human stage.",
        "source": "T10n0279_037:0197a07_4"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0197a07_5"
    },
    {
        "source_sentence": "菩薩亦復如是，始從初地至於七地，乘波羅蜜乘遊行世間，知諸世間煩惱過患，",
        "translation": "In the same way, enlightening beings travel from the first stage up to the seventh stage in the vehicle of transcendence and know all worldly afflictions.",
        "source": "T10n0279_037:0197a07_6"
    },
    {
        "source_sentence": "以乘正道故，不為煩惱過失所染，然未名為超煩惱行；",
        "translation": "Because of the right path of enlightenment they are not stained by afflictions and faults, yet they are not called beyond the action of afflictions.",
        "source": "T10n0279_037:0197a09_7"
    },
    {
        "source_sentence": "若捨一切有功用行，從第七地入第八地，乘菩薩清淨乘遊行世間，知煩惱過失不為所染，",
        "translation": "If they abandon all effortless practices and enter the eighth stage from the seventh stage into the eighth, they’ll ride the pure vehicle of enlightening beings traveling in the world, knowing the afflictions and faults without being stained by them",
        "source": "T10n0279_037:0197a10_8"
    },
    {
        "source_sentence": "爾乃名為超煩惱行，以得一切盡超過故。",
        "translation": "This is called the practice of transcending afflictions, because it's the attainment of total transcendence.",
        "source": "T10n0279_037:0197a12_9"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0197a13_10"
    },
    {
        "source_sentence": "此第七地菩薩盡超過多貪等諸煩惱眾住此地，不名有煩惱者，不名無煩惱者。",
        "translation": "The enlightening beings in the seventh stage, having completely transcended such defilements as greed, etc., abide in this stage. They are not called “without defilement” or “without defilement.” Enlightening beings",
        "source": "T10n0279_037:0197a13_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T10n0279_037:0197a15_12"
    },
    {
        "source_sentence": "一切煩惱不現行故，不名有者；",
        "translation": "Because all passions are not manifested, they are not said to exist.",
        "source": "T10n0279_037:0197a15_13"
    },
    {
        "source_sentence": "求如來智心未滿故，不名無者。",
        "translation": "It's because the mind of seeking the Tathāgata's wisdom hasn't yet filled it, so it's not called nonexistence.",
        "source": "T10n0279_037:0197a16_14"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0197a18_0"
    },
    {
        "source_sentence": "菩薩住此第七地，以深淨心，成就身業，成就語業，成就意業。",
        "translation": "In this seventh stage, the bodhisattva abides with a profound and pure mind that accomplishes bodily actions, verbal actions, and mental actions.",
        "source": "T10n0279_037:0197a18_1"
    },
    {
        "source_sentence": "所有一切不善業道——如來所訶，皆已捨離；",
        "translation": "All the unwholesome courses of action that the enlightening beings reprimanded by the Buddha have abandoned.",
        "source": "T10n0279_037:0197a19_2"
    },
    {
        "source_sentence": "一切善業——如來所讚，常善修行。",
        "translation": "All good actions - praised by the Tathāgata, they're always well cultivated.",
        "source": "T10n0279_037:0197a20_3"
    },
    {
        "source_sentence": "世間所有經書、技術，如五地中說，皆自然而行，不假功用。",
        "translation": "All the scriptures, books, and techniques in the world are as explained in the five stages, all naturally practiced without effort.",
        "source": "T10n0279_037:0197a21_4"
    },
    {
        "source_sentence": "此菩薩於三千大千世界中為大明師，唯除如來及八地已上其餘菩薩，深心妙行無與等者，",
        "translation": "These enlightening beings are great leaders of illumination in the billion-world-galactic universe: exception made for the Buddha and all the other enlightening beings beyond the eighth stage. Their profound, subtle practice has no equal.",
        "source": "T10n0279_037:0197a22_5"
    },
    {
        "source_sentence": "諸禪三昧、三摩鉢底、神通解脫皆得現前。",
        "translation": "All the meditations, samādhis, samāpattis, and miraculous liberations can be manifested.",
        "source": "T10n0279_037:0197a24_6"
    },
    {
        "source_sentence": "然是修成，非如八地報得成就。",
        "translation": "However, it's cultivated, not like the fruit of the eighth ground that's accomplished.",
        "source": "T10n0279_037:0197a25_7"
    },
    {
        "source_sentence": "此地菩薩於念念中具足修習方便智力及一切菩提分法，轉勝圓滿。",
        "translation": "In this stage, the bodhisattva cultivates the power of knowledge of skillful means and all the factors of enlightenment in every moment of thought to perfect their transformation.",
        "source": "T10n0279_037:0197a26_8"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0197a28_0"
    },
    {
        "source_sentence": "菩薩住此地，入菩薩善觀擇三昧、善擇義三昧、最勝慧三昧、分別義藏三昧、如實分別義三昧、善住堅固根三昧、智慧神通門三昧、法界業三昧、如來勝利三昧、種種義藏生死涅槃門三昧，",
        "translation": "“Furthermore, the enlightening beings in this stage entered into concentration called ‘samādhi of skillful investigation.’ They entered concentration called ‘samādhi of thorough investigation of meanings.’ They entered concentration called ‘samādhi of",
        "source": "T10n0279_037:0197a28_1"
    },
    {
        "source_sentence": "入如是等具足大智神通門百萬三昧，淨治此地。",
        "translation": "He enters a million samādhis such as these, which are fully endowed with great knowledge and supernormal abilities, purifying this place.",
        "source": "T10n0279_037:0197b03_2"
    },
    {
        "source_sentence": "是菩薩得此三昧，善治淨方便慧故，大悲力故，超過二乘地，得觀察智慧地。",
        "translation": "Because these bodhisattvas attain this concentration, they skillfully purify the pure wisdom of skillful means and the power of great compassion, transcend the stages of the two-vehicle path, and attain the stage of observing wisdom.",
        "source": "T10n0279_037:0197b04_3"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0197b07_0"
    },
    {
        "source_sentence": "菩薩住此地，善淨無量身業無相行，善淨無量語業無相行，善淨無量意業無相行故，",
        "translation": "“The enlightening beings in this stage are good and pure, because they practice without marks of physical action; good and pure, because they practice without marks of verbal action; and good and pure, because they practice without marks of mental action.",
        "source": "T10n0279_037:0197b07_1"
    },
    {
        "source_sentence": "得無生法忍光明。」",
        "translation": "They attain the light of the forbearance of the nonarising of dharmas.",
        "source": "T10n0279_037:0197b09_2"
    },
    {
        "source_sentence": "解脫月菩薩言：「佛子！",
        "translation": "The Moon of Liberation Bodhisattva said, Son of the Buddha!",
        "source": "T10n0279_037:0197b09_3"
    },
    {
        "source_sentence": "菩薩從初地來所有無量身、語、意業，豈不超過二乘耶？」",
        "translation": "Doesn't the measureless physical, verbal, and mental actions of bodhisattvas since the first ground transcend the two vehicles?",
        "source": "T10n0279_037:0197b09_4"
    },
    {
        "source_sentence": "金剛藏菩薩言：「佛子！",
        "translation": "The Vajragarbha Bodhisattva said, Son of the Buddha!",
        "source": "T10n0279_037:0197b11_5"
    },
    {
        "source_sentence": "彼悉超過，然但以願求諸佛法故，非是自智觀察之力；",
        "translation": "They all go beyond them, but only wishing to seek the teachings of buddhas is not the power of self-cognizing and observing.",
        "source": "T10n0279_037:0197b11_6"
    },
    {
        "source_sentence": "今第七地自智力故，一切二乘所不能及。",
        "translation": "Now, because of the power of their own knowledge in the seventh ground, they can't be compared to all the two vehicles.",
        "source": "T10n0279_037:0197b12_7"
    },
    {
        "source_sentence": "譬如王子，生在王家，王后所生，具足王相，生已即勝一切臣眾，但以王力，",
        "translation": "It is as if a prince were to be born in the king’s household. The queen gave birth to him, endowed with the characteristics of royalty, and when he was born she immediately prevailed over all the ministers but by the power of",
        "source": "T10n0279_037:0197b13_8"
    },
    {
        "source_sentence": "非是自力；",
        "translation": "It is not by one’s own power.",
        "source": "T10n0279_037:0197b15_9"
    },
    {
        "source_sentence": "若身長大，藝業悉成，乃以自力超過一切。",
        "translation": "If his body grows and he accomplishes all the arts and crafts, then he'll surpass them all with his own strength.",
        "source": "T10n0279_037:0197b15_10"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，初發心時，以志求大法故，超過一切聲聞、獨覺；",
        "translation": "Great enlightening beings are also like this: when they first set their minds on enlightenment, because of their determination to seek the great Teaching, surpassing all śrāvakas and pratyekbuddhas.",
        "source": "T10n0279_037:0197b16_11"
    },
    {
        "source_sentence": "今住此地，以自所行智慧力故，出過一切二乘之上。",
        "translation": "Because of the power of the wisdom that they practice, they're beyond all the two vehicles.",
        "source": "T10n0279_037:0197b18_12"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0197b19_13"
    },
    {
        "source_sentence": "菩薩住此第七地，得甚深遠離無行、常行身語意業，勤求上道而不捨離，",
        "translation": "“In the seventh stage, enlightening beings attain profound detachment from unconstructed action and always engage in physical, verbal, and mental action. They diligently seek higher paths but do not abandon them.",
        "source": "T10n0279_037:0197b19_14"
    },
    {
        "source_sentence": "是故菩薩雖行實際而不作證。」",
        "translation": "Therefore, even though the bodhisattva practices reality, he doesn't realize it.",
        "source": "T10n0279_037:0197b21_15"
    },
    {
        "source_sentence": "解脫月菩薩言：「佛子！",
        "translation": "The Moon of Liberation Bodhisattva said, Son of the Buddha!",
        "source": "T10n0279_037:0197b22_0"
    },
    {
        "source_sentence": "菩薩從何地來，能入滅定？」",
        "translation": "Where did the bodhisattva come from to enter the concentration of cessation?",
        "source": "T10n0279_037:0197b22_1"
    },
    {
        "source_sentence": "金剛藏菩薩言：「佛子！",
        "translation": "The Vajragarbha Bodhisattva said, Son of the Buddha!",
        "source": "T10n0279_037:0197b23_2"
    },
    {
        "source_sentence": "菩薩從第六地來，能入滅定。",
        "translation": "A bodhisattva can enter the absorption of extinction from the sixth stage.",
        "source": "T10n0279_037:0197b23_3"
    },
    {
        "source_sentence": "今住此地，能念念入，亦念念起，而不作證。",
        "translation": "He now abides in this stage and can enter it moment to moment, but he doesn't realize it.",
        "source": "T10n0279_037:0197b24_4"
    },
    {
        "source_sentence": "故此菩薩名為：成就不可思議身、語、意業，行於實際而不作證。",
        "translation": "Therefore these enlightening beings are said to have accomplished inconceivable physical, verbal, and mental action; but they do not actualize it by acting according to reality.",
        "source": "T10n0279_037:0197b25_5"
    },
    {
        "source_sentence": "譬如有人乘船入海，以善巧力不遭水難；",
        "translation": "It is as if a man had entered the ocean on board a ship and, by his skillful means, avoided being swayed by the water.",
        "source": "T10n0279_037:0197b26_6"
    },
    {
        "source_sentence": "此地菩薩亦復如是，乘波羅蜜船行實際海，以願力故而不證滅。",
        "translation": "Similarly, the bodhisattva in this place rides on the perfection boat and travels through the ocean of reality, but it's because of the power of their vows that they don't realize cessation.",
        "source": "T10n0279_037:0197b27_7"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0197c01_0"
    },
    {
        "source_sentence": "此菩薩得如是三昧智力，以大方便，雖示現生死，而恒住涅槃；",
        "translation": "“These enlightening beings attain the power of knowledge of concentration like this, and by means of great skill in means show birth and death but always abide in nirvana.",
        "source": "T10n0279_037:0197c01_1"
    },
    {
        "source_sentence": "雖眷屬圍遶，而常樂遠離；",
        "translation": "Though surrounded by their retinues, they always delight in detachment.",
        "source": "T10n0279_037:0197c02_2"
    },
    {
        "source_sentence": "雖以願力三界受生，而不為世法所染；",
        "translation": "Though they are born in the three realms by the power of vows, yet they are not stained by worldly dharmas.",
        "source": "T10n0279_037:0197c03_3"
    },
    {
        "source_sentence": "雖常寂滅，以方便力而還熾然，雖然不燒；",
        "translation": "Even though it is always silent and extinguished, by the power of skillful means it returns to blazing fire, even though not being burned.",
        "source": "T10n0279_037:0197c04_0"
    },
    {
        "source_sentence": "雖隨順佛智，而示入聲聞、辟支佛地；",
        "translation": "Though they follow buddha-knowledge, yet they show entering the stages of disciples and pratyekabuddhas.",
        "source": "T10n0279_037:0197c04_1"
    },
    {
        "source_sentence": "雖得佛境界藏，而示住魔境界；",
        "translation": "Though they attain the treasury of knowledge of buddha-realms, yet they appear to abide in the realm of demons.",
        "source": "T10n0279_037:0197c05_2"
    },
    {
        "source_sentence": "雖超魔道，而現行魔法；",
        "translation": "Though they have transcended the realm of demons, yet they manifest magic.",
        "source": "T10n0279_037:0197c06_3"
    },
    {
        "source_sentence": "雖示同外道行，而不捨佛法；",
        "translation": "Though they show similar practices to those of non-Buddhists, yet they do not abandon the buddha-dharma.",
        "source": "T10n0279_037:0197c07_4"
    },
    {
        "source_sentence": "雖示隨順一切世間，而常行一切出世間法；",
        "translation": "Though they show conformity to all worlds, yet they always practice all transcendent ways.",
        "source": "T10n0279_037:0197c07_5"
    },
    {
        "source_sentence": "所有一切莊嚴之事，出過一切天、龍、夜叉、乾闥婆、阿脩羅、迦樓羅、緊那羅、摩睺羅伽、人及非人、帝釋、梵王、四天王等之所有者，",
        "translation": "All the adornments that he had, surpassed all the gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans and non-humans, Indra, Brahmā",
        "source": "T10n0279_037:0197c08_6"
    },
    {
        "source_sentence": "而不捨離樂法之心。",
        "translation": "They don't abandon the mind that's free of the pleasant dharma.",
        "source": "T10n0279_037:0197c11_7"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0197c12_0"
    },
    {
        "source_sentence": "菩薩成就如是智慧，住遠行地，以願力故，得見多佛。",
        "translation": "Having perfected such wisdom, the bodhisattva dwells in a distant land of practice, and because of the power of his vow, he's able to see many buddhas.",
        "source": "T10n0279_037:0197c12_1"
    },
    {
        "source_sentence": "所謂：見多百佛，乃至見多百千億那由他佛。",
        "translation": "That is to say, they see many hundreds of thousands of buddhas... millions of billions of buddhas.",
        "source": "T10n0279_037:0197c13_2"
    },
    {
        "source_sentence": "於彼佛所，以廣大心、增勝心，供養恭敬，尊重讚歎，衣服、飲食、臥具、醫藥，",
        "translation": "At that buddha’s place they revered, venerated, and praised it with great zeal. They provided clothing, food and drink, bedding, and medicine.",
        "source": "T10n0279_037:0197c14_3"
    },
    {
        "source_sentence": "一切資生悉以奉施，亦以供養一切眾僧，以此善根迴向阿耨多羅三藐三菩提。",
        "translation": "They give all their necessities as offerings and also make offerings to all the saṃgha, dedicating these good roots to unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0279_037:0197c15_4"
    },
    {
        "source_sentence": "復於佛所恭敬聽法，聞已受持，獲如實三昧智慧光明，隨順修行。",
        "translation": "They also venerate and listen to the teachings of the Buddha, hear and retain them after hearing them, attain the light of wisdom and knowledge of samādhi as it really is, and follow and practice them.",
        "source": "T10n0279_037:0197c17_5"
    },
    {
        "source_sentence": "於諸佛所護持正法，常為如來之所讚喜，一切二乘所有問難無能退屈，",
        "translation": "In the presence of all buddhas they preserve the true teaching, always praised by the enlightened ones. They cannot turn away from the questions and difficulties of all the two vehicles.",
        "source": "T10n0279_037:0197c19_6"
    },
    {
        "source_sentence": "利益眾生，法忍清淨。",
        "translation": "Benefiting sentient beings, the Dharma forbearance is purified.",
        "source": "T10n0279_037:0197c20_7"
    },
    {
        "source_sentence": "如是經無量百千億那由他劫，所有善根轉更增勝。",
        "translation": "In this way the roots of merit accumulated over immeasurable hundreds of thousands of myriads of koṭis of nayutas of kalpas will become ever stronger.",
        "source": "T10n0279_037:0197c21_8"
    },
    {
        "source_sentence": "譬如真金，以眾妙寶間錯莊嚴，轉更增勝，倍益光明，餘莊嚴具所不能及；",
        "translation": "It is like gold, which is adorned with a mixture of various beautiful jewels and becomes even more brilliant, doubling in brightness, unmatched by any other adornments.",
        "source": "T10n0279_037:0197c22_9"
    },
    {
        "source_sentence": "菩薩住此第七地所有善根亦復如是，以方便慧力轉更明淨，非是二乘之所能及。",
        "translation": "Similarly, the good roots of the bodhisattva who abides in this seventh ground are purified by the power of skillful means and wisdom, which are beyond the ability of the two vehicles.",
        "source": "T10n0279_037:0197c24_10"
    },
    {
        "source_sentence": "佛子！",
        "translation": "Son of the Buddha!",
        "source": "T10n0279_037:0197c26_0"
    },
    {
        "source_sentence": "譬如日光，星月等光無能及者，閻浮提地所有泥潦悉能乾竭；",
        "translation": "It is like the light of the sun, which cannot be outshone by the lights of stars, moons, and other celestial objects. All the mud and dirt on earth in Jambudvlpa can evaporate it.",
        "source": "T10n0279_037:0197c26_1"
    },
    {
        "source_sentence": "此遠行地菩薩亦復如是，一切二乘無有能及，悉能乾竭一切眾生諸惑泥潦。",
        "translation": "Similarly, this bodhisattva in the far-reaching stage of practice is unmatched by all the two vehicles, and he's able to dry up the afflictions and muds of all sentient beings.",
        "source": "T10n0279_037:0197c27_2"
    },
    {
        "source_sentence": "此菩薩，十波羅蜜中，方便波羅蜜偏多；",
        "translation": "Among the ten transcendent ways, transcendent skill in means is predominant with these enlightening beings.",
        "source": "T10n0279_037:0197c29_3"
    },
    {
        "source_sentence": "餘非不行，但隨力隨分。",
        "translation": "The others do not. They are only secondary and secondary according to one’s capacities.",
        "source": "T10n0279_037:0198a01_4"
    },
    {
        "source_sentence": "「佛子！",
        "translation": "“Child of Buddha!",
        "source": "T10n0279_037:0198a01_5"
    },
    {
        "source_sentence": "是名：略說菩薩摩訶薩第七遠行地。",
        "translation": "“This is called the seventh stage of enlightening beings’ far-reaching practice:",
        "source": "T10n0279_037:0198a01_6"
    },
    {
        "source_sentence": "菩薩住此地，多作自在天王，善為眾生說證智法，令其證入。",
        "translation": "The bodhisattvas living in this place often become sovereign celestial kings, who skillfully explain the method of realizing knowledge for sentient beings and cause them to realize it.",
        "source": "T10n0279_037:0198a02_7"
    },
    {
        "source_sentence": "布施、愛語、利行、同事——如是一切諸所作業，皆不離念佛，乃至不離念具足一切種、一切智智。",
        "translation": "Giving, loving words, beneficial actions, and coworkers-all these things they do don't part from mindfulness of the Buddha, even to the point where they don't part from mindfulness that are endowed with all kinds and omniscience.",
        "source": "T10n0279_037:0198a04_8"
    },
    {
        "source_sentence": "復作是念：『我當於一切眾生中為首、為勝，乃至為一切智智依止者。』",
        "translation": "Again, he thinks, 'Should I be the first and foremost among all sentient beings, up to the point where I'll be the basis of omniscience and cognition?'",
        "source": "T10n0279_037:0198a06_9"
    },
    {
        "source_sentence": "此菩薩若發勤精進，於一念頃，得百千億那由他三昧，乃至示現百千億那由他菩薩以為眷屬；",
        "translation": "In a moment of thought these enlightening beings attain hundreds of thousands of myriads of koṭis of nayutas of samādhis, and show themselves as their retinues with hundreds of thousands of myriads of koṭis of bodhi",
        "source": "T10n0279_037:0198a07_10"
    },
    {
        "source_sentence": "若以菩薩殊勝願力自在示現，過於此數，乃至百千億那由他劫不能數知。」",
        "translation": "If he were to show it freely by the power of the bodhisattva's extraordinary vow, it would be beyond that number and could not be counted for a hundred thousand million nayutas.",
        "source": "T10n0279_037:0198a09_11"
    },
    {
        "source_sentence": "「第一義智三昧道，　　六地修行心滿足，",
        "translation": "“The path of the concentration of knowledge of ultimate meaning Is fulfilled in the six stages of practice.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　即時成就方便慧，　　菩薩以此入七地。",
        "translation": "Immediately accomplishing skillful means and wisdom, the bodhisattva enters seventh ground because of this.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　雖明三脫起慈悲，　　雖等如來勤供佛，",
        "translation": "Though they explain the three liberations and give rise to compassion, though they're equal to the Tathāgata's extensive offerings to buddhas.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　雖觀於空集福德，　　菩薩以此昇七地。",
        "translation": "Even though they contemplate the accumulation of merit in emptiness, bodhisattvas ascend to seventh ground because of this.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　遠離三界而莊嚴，　　滅除惑火而起焰，",
        "translation": "They are free from the three realms and adorned, Extinguishing the fires of delusion and producing flames.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　知法無二勤作業，　　了剎皆空樂嚴土，",
        "translation": "Knowing things are nondual, they diligently work; Understanding all buddha-lands are emptiness, bliss, and adornment,",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　解身不動具諸相，　　達聲性離善開演，",
        "translation": "Understanding the body unshakable, endowed with all characteristics, They comprehend the nature of sound and are free from what’s well-expressed.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　入於一念事各別，　　智者以此昇七地。",
        "translation": "Entering into a single thought, each thing is distinct, and the wise one ascends to seventh ground because of this.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　觀察此法得明了，　　廣為群迷興利益，",
        "translation": "Observing this teaching, they attain clarity and comprehension And extensively benefit the deluded.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　入眾生界無有邊，　　佛教化業亦無量。",
        "translation": "Entering the realm of sentient beings has no bounds, And Buddha’s edification works are also immeasurable.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　國土諸法與劫數，　　解欲心行悉能入，",
        "translation": "They can enter all the teachings of lands, phenomena, and eons, Understanding the mind and actions of desire.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　說三乘法亦無限，　　如是教化諸群生。",
        "translation": "Explaining the teachings of the three vehicles is also infinite, thus teaching and transforming sentient beings.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　菩薩勤求最勝道，　　動息不捨方便慧，",
        "translation": "Enlightening beings diligently seek the supreme path, Without ceasing or giving up knowledge of means.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　一一迴向佛菩提，　　念念成就波羅蜜。",
        "translation": "Each one of them dedicates themselves to the Buddha’s enlightenment, Fulfilling the transcendent practice in every moment of thought.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　發心迴向是布施，　　滅惑為戒不害忍，",
        "translation": "Arousal of mind and dedication are generosity. The extinction of afflictions is morality; non-violence is patience.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　求善無厭斯進策，　　於道不動即修禪，",
        "translation": "Seeking to be good, they don’t tire of this encouragement; Immovable in the path, they cultivate meditation.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　忍受無生名般若，　　迴向方便希求願，",
        "translation": "To endure nonorigination is called prajñā, to which one dedicates skillful means and longs for it.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　無能摧力善了智，　　如是一切皆成滿。",
        "translation": "The unfathomable power of knowledge is well-understood, and all are thus fulfilled.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　初地攀緣功德滿，　　二地離垢三諍息，",
        "translation": "The first stage is with fulfilment of the qualities of clinging as supporting object; the second stage is without impurity.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　四地入道五順行，　　第六無生智光照，",
        "translation": "In the fourth stage one enters the path, with five companions; in the sixth stage one is illumined by the knowledge of nonorigination.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　七住菩提功德滿，　　種種大願皆具足，",
        "translation": "The seventh abode of enlightenment is filled with virtue, Fulfilling various great vows.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　以是能令八地中，　　一切所作咸清淨。",
        "translation": "Because of this, they can cause all the things they do in the eighth ground to be pure.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　此地難過智乃超，　　譬如世界二中間，",
        "translation": "It is difficult to pass beyond this stage without knowledge, Like the world in between two.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　亦如聖王無染著，　　然未名為總超度。",
        "translation": "It's also like the noble king who has no defiled attachment, but it's not called a general transcendence.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　若住第八智地中，　　爾乃逾於心境界，",
        "translation": "If someone abides in the eighth stage of knowledge, they'll go beyond the mind realm.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　如梵觀世超人位，　　如蓮處水無染著。",
        "translation": "Like Brahma observing the world and transcending human states, like the lotus flower in water without defiled attachment.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　此地雖超諸惑眾，　　不名有惑非無惑，",
        "translation": "Although this stage transcends all the afflictions, It is not called “with affliction” or “without affliction.”",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　以無煩惱於中行，　　而求佛智心未足。",
        "translation": "Because there are no afflictions in their practice, they don't have the mind to seek Buddha's wisdom and aren't satisfied.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　世間所有眾技藝，　　經書詞論普明了，",
        "translation": "All the arts and crafts of the world, Scriptures, books, words, and treatises They clearly understand.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　禪定三昧及神通，　　如是修行悉成就。",
        "translation": "Meditation, absorption, concentration, and mystic powers are all accomplished by such cultivation.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　菩薩修成七住道，　　超過一切二乘行，",
        "translation": "Enlightening beings cultivate the seven abodes of enlightenment, transcending all the practices of the two vehicles.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　初地願故此由智，　　譬如王子力具足。",
        "translation": "Because of the vow of the first stage, it's because of wisdom, like a prince whose power is complete.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　成就甚深仍進道，　　心心寂滅不取證；",
        "translation": "Accomplishing profound enlightenment, they still proceed on the path; Their minds and mental states are tranquil, not apprehending or realizing.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　譬如乘船入海中，　　在水不為水所溺。",
        "translation": "It's like riding a boat into the ocean and entering it without being submerged in water.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　方便慧行功德具，　　一切世間無能了，",
        "translation": "Endowed with the virtues of skillful means, wisdom, and practice, No one in the world can comprehend them.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　供養多佛心益明，　　如以妙寶莊嚴金。",
        "translation": "Making offerings to many buddhas, their minds become clearer like adorned gold with exquisite jewels.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　此地菩薩智最明，　　如日舒光竭愛水，",
        "translation": "The knowledge of enlightening beings in this stage is supremely clear, Like the sun shining and drying up its thirst for water.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　又作自在天中主，　　化導群生修正智。",
        "translation": "He also becomes the lord of the self-contained heaven, Teaching and guiding sentient beings to cultivate their right knowledge.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　若以勇猛精勤力，　　獲多三昧見多佛，",
        "translation": "If, by the power of heroic zeal, They attain concentration and see many buddhas,",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　百千億數那由他，　　願力自在復過是。",
        "translation": "Hundreds of thousands of koṭis of myriads of koṭis of nayutas, with the power of vows and self-dependence is even greater.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　此是菩薩遠行地，　　方便智慧清淨道，",
        "translation": "This is enlightening beings’ far-reaching path of skill in means and knowledge.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "　一切世間天及人，　　聲聞獨覺無能知。」",
        "translation": "All the worldly gods and humans, śrāvakas and solitary realizers can't know it.",
        "source": "T10n0279_037:0198a11_12"
    },
    {
        "source_sentence": "爾時，金剛藏菩薩欲重宣此義而說頌曰：大方廣佛華嚴經卷第三十七",
        "translation": "Then the bodhisattva Diamond Matrix, wanting to elaborate on the meaning of this further, spoke these verses:",
        "source": "T10n0279_037:0198a11_12"
    }
]