[
    {
        "source_sentence": "大方廣佛華嚴經卷第九",
        "translation": "Dafangguang fo huayan jing, vol. 9",
        "source": "T10n0293_009:0700a22_0"
    },
    {
        "source_sentence": "罽賓國三藏般若奉　詔譯",
        "translation": "translated by imperial edict of the Tripiṭaka Master Prajñāpāramitā of Kāśmīra",
        "source": "T10n0293_009:0700a24_0"
    },
    {
        "source_sentence": "入不思議解脫境界普賢行願品",
        "translation": "Chapter on the Vows and Practices of Samantabhadra who Enters the Realm of Inconceivable Liberation",
        "source": "T10n0293_009:0700a25_0"
    },
    {
        "source_sentence": "◎復有十千乾闥婆王，於虛空中作如是言：「善男子！",
        "translation": "Again, there were 10,000 gandharva kings in the sky who said, Good man!",
        "source": "T10n0293_009:0700a26_0"
    },
    {
        "source_sentence": "此婆羅門五熱炙身，時，其火光明照我宮殿及諸眷屬，悉令我等受不思議無量快樂。",
        "translation": "When this brāhmaṇa’s body was being burned in the five kinds of heat, the light of that fire illumined my palace and all my retinues, enabling us to experience inconceivable bliss.",
        "source": "T10n0293_009:0700a27_1"
    },
    {
        "source_sentence": "是故我等來詣其所，此婆羅門為我說法，能令我等於阿耨多羅三藐三菩提，",
        "translation": "That is why we came to this place. This brahman taught us the Dharma, enabling us to attain unexcelled, perfect enlightenment.",
        "source": "T10n0293_009:0700a29_2"
    },
    {
        "source_sentence": "得不退轉。」",
        "translation": "They attain nonretrogression.",
        "source": "T10n0293_009:0700b01_3"
    },
    {
        "source_sentence": "復有十千阿脩羅王從大海出，住虛空中，舒右膝輪，合掌禮敬，作如是言：「善男子！",
        "translation": "Ten thousand other asura kings emerged from the ocean and flew up into space. They spread their right knee, joined their palms in respect, and said:",
        "source": "T10n0293_009:0700b02_4"
    },
    {
        "source_sentence": "此婆羅門五熱炙身，時，我阿脩羅所有宮殿、大地、諸山悉皆震動；",
        "translation": "At the time when this brahman’s body was burned in five kinds of heat, all the palaces, earth, and mountains that belonged to me as an asura demon trembled.",
        "source": "T10n0293_009:0700b04_5"
    },
    {
        "source_sentence": "大海波濤涌浪騰沸，令我眷屬失其威力、捨憍慢心、離諸放逸、息除戰鬪傷害之心。",
        "translation": "The great ocean waves rise and the waves rise, causing my retinues to lose their authority, abandon their conceit, become free of carelessness, and stop fighting and harming them.",
        "source": "T10n0293_009:0700b05_6"
    },
    {
        "source_sentence": "是故來詣婆羅門所，從其聞法，永離諂誑，入深法忍，住於三昧，成就十力，",
        "translation": "Having heard the Dharma from those brāhmaṇas, they will be forever free of hypocrisy and deceit, enter profound patience in regard to doctrine, abide in concentration, and perfect the ten powers.",
        "source": "T10n0293_009:0700b07_7"
    },
    {
        "source_sentence": "堅固不動。」",
        "translation": "It's resolute and unmoving.",
        "source": "T10n0293_009:0700b09_8"
    },
    {
        "source_sentence": "復有十千迦樓羅王，大力勇持迦樓羅王而為上首，於虛空中，化作廣大童子之形，",
        "translation": "Ten thousand other garuḍa kings emerged from the sky in the forms of vast children.",
        "source": "T10n0293_009:0700b09_9"
    },
    {
        "source_sentence": "容貌端嚴，色相具足，於虛空中唱如是言：「善男子！",
        "translation": "His appearance was graceful and his features perfect, and he called out in the sky, Good sons!",
        "source": "T10n0293_009:0700b11_10"
    },
    {
        "source_sentence": "此婆羅門五熱炙身，時，其火光明照我宮殿，一切震動，而令我等皆悉恐怖，",
        "translation": "“When this brahman’s body was being burned by the fire of the five kinds of heat, the light of that fire shone upon our palace. Everything trembled and we were all terrified.",
        "source": "T10n0293_009:0700b12_11"
    },
    {
        "source_sentence": "不樂住處，生厭離心，來詣其所。",
        "translation": "They don't delight in the place where they live, become disillusioned with it, and come to it.",
        "source": "T10n0293_009:0700b14_12"
    },
    {
        "source_sentence": "時，婆羅門即為我等如應說法，能令我等修習大慈，增長大悲，令其精進不捨善軛，",
        "translation": "The brāhmaṇa then taught us the Dharma as it should be taught, enabling us to cultivate great kindness and compassion so that we might make effort and not give up good deeds.",
        "source": "T10n0293_009:0700b14_13"
    },
    {
        "source_sentence": "令於五欲拔出眾生，令其發起大菩提心，令入甚深清淨法界，令其獲得明利智慧，",
        "translation": "“Great enlightening beings cause sentient beings to develop great determination for enlightenment and enter the profound, pure realm of reality. They cause them to attain insight and knowledge.",
        "source": "T10n0293_009:0700b16_14"
    },
    {
        "source_sentence": "方便善巧，調伏眾生。」",
        "translation": "Skillful in skillful means, he tames sentient beings.",
        "source": "T10n0293_009:0700b18_15"
    },
    {
        "source_sentence": "復有十千緊那羅王，於虛空中唱如是言：「善男子！",
        "translation": "Ten thousand other kinnara kings called out in the sky, Good sons!",
        "source": "T10n0293_009:0700b19_16"
    },
    {
        "source_sentence": "此婆羅門五熱炙身，時，從火焰中有大風起，吹我宮殿、園林、池沼、寶多羅樹、諸寶鈴網、諸寶繒綵、瓔珞、鬘帶、諸音樂樹、諸妙寶樹，",
        "translation": "When this brahman’s body was heated by the five kinds of heat, a great wind rose from the flames of the fire and blew on my palace, gardens, ponds, pools, jeweled palm trees, networks of bell",
        "source": "T10n0293_009:0700b20_17"
    },
    {
        "source_sentence": "及諸樂器一切資具咸皆震動，自然演出佛聲、法聲、及不退轉菩薩僧聲、發起大願菩薩道聲、住於無上正等覺聲。",
        "translation": "They naturally produce the sounds of buddhas, Dharma, and nonregressing bodhisattvas and saṃgha, the sounds of great vows, the sounds of enlightening beings' paths, and the sounds of unsurpassed perfect enlightenment",
        "source": "T10n0293_009:0700b23_18"
    },
    {
        "source_sentence": "云：某方、某界、某國、某處，有某菩薩發菩提心，出生大願；",
        "translation": "They say, ‘In a certain direction, in a certain realm, in a certain state, in a certain land, and in a certain place, there is a certain bodhisattva who sets out for enlightenment and produces a great vow:",
        "source": "T10n0293_009:0700b25_19"
    },
    {
        "source_sentence": "某方、某界、某國、某處，有某菩薩修行苦行，於身命財，難捨能捨；",
        "translation": "In a certain direction, in a certain realm, in a certain state, in a certain country, or in a certain place, there is an enlightening being who practices austerities but it is difficult for him to give up his body, life, and possessions",
        "source": "T10n0293_009:0700b27_20"
    },
    {
        "source_sentence": "某方、某界、某國、某處，有某菩薩，為速圓滿一切智智，積集菩薩功德妙行，",
        "translation": "“In a certain direction, in a certain realm, in a certain country, and in a certain place, there was a certain bodhisattva who quickly perfected omniscience and accumulated the marvelous practices of enlightening beings’ virtues.",
        "source": "T10n0293_009:0700b28_21"
    },
    {
        "source_sentence": "乃至究竟無作法門；",
        "translation": "... up to the ultimate unmanifest dharma-gate.",
        "source": "T10n0293_009:0700c01_22"
    },
    {
        "source_sentence": "某方、某界、某國、某處，有某菩薩，往詣道場，坐菩提樹，降魔軍眾，",
        "translation": "“In a certain direction, in a certain realm, in a certain country, and in a certain place, there was a certain bodhisattva who went to the terrace of enlightenment, sat at the tree of enlightenment, and subdued",
        "source": "T10n0293_009:0700c01_23"
    },
    {
        "source_sentence": "成等正覺。",
        "translation": "They become perfectly enlightened.",
        "source": "T10n0293_009:0700c03_24"
    },
    {
        "source_sentence": "乃至某方、某界、某國、某處，有某如來，轉大法輪；",
        "translation": "In a certain direction, a certain realm, a certain country, or a certain place there will be a certain buddha turning the great wheel of the Teaching.",
        "source": "T10n0293_009:0700c03_25"
    },
    {
        "source_sentence": "某方、某界、某國、某處，有某如來，作佛事已，而般涅槃。",
        "translation": "In a certain direction, a certain realm, a certain country, or a certain place, there's a certain Tathāgata who does buddha-work and then parinirvāṇa.",
        "source": "T10n0293_009:0700c04_26"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0700c05_27"
    },
    {
        "source_sentence": "假使有人以閻浮提地，及草木一切所有末為微塵，此微塵數可知邊際，",
        "translation": "Suppose someone takes the land of Jambudvfpa and all the dust found in grass and trees to be a speck of dust. The extent of this speck of dust can be known,",
        "source": "T10n0293_009:0700c06_0"
    },
    {
        "source_sentence": "我宮殿中寶多羅樹，乃至樂器莊嚴具等，所出音聲演說菩薩名、如來名、法名、僧名，",
        "translation": "In my palace, from the jeweled palm trees and all the musical instruments and ornaments that adorn it, I recite the names of enlightening beings, buddhas, bodhisattvas, buddhas, dharmas, and Sangha",
        "source": "T10n0293_009:0700c07_1"
    },
    {
        "source_sentence": "所發大願，所修諸行，及佛菩薩所遊、所住、所說、所化，無有能得知其邊際。",
        "translation": "No one can know the bounds of the great vows they undertake, the practices they cultivate, or the places where buddhas and bodhisattvas travel, live, teach, and transform.",
        "source": "T10n0293_009:0700c09_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0700c11_3"
    },
    {
        "source_sentence": "我等以聞佛聲、法聲、菩薩僧聲、菩薩所住行願聲，故生大歡喜，來詣其所。",
        "translation": "Because we have heard the voice of the Buddha, the voice of the Dharma, the voice of the bodhisattvas, the voice of the Sangha, and the voice of the practices and vows wherein the bodhisattvas abide. We are greatly joy",
        "source": "T10n0293_009:0700c11_4"
    },
    {
        "source_sentence": "時，婆羅門即為我等，如應說法，令我及餘無量眾生，於阿耨多羅三藐三菩提，",
        "translation": "The brāhmaṇa then taught us the Dharma as it should be taught, thereby enabling us and innumerable other sentient beings to attain highest, complete enlightenment.",
        "source": "T10n0293_009:0700c13_5"
    },
    {
        "source_sentence": "得不退轉。」",
        "translation": "They attain nonretrogression.",
        "source": "T10n0293_009:0700c14_6"
    },
    {
        "source_sentence": "復有無量欲界天子，現高大身，住虛空中，以諸種種上妙供具，恭敬供養，",
        "translation": "Innumerable other celestial beings in the realm of desire also manifested great bodies, hovering in midair. They offered various kinds of exquisite offerings to the gods with reverence and veneration.",
        "source": "T10n0293_009:0700c15_7"
    },
    {
        "source_sentence": "作如是言：「善男子！",
        "translation": "He said, Good man!",
        "source": "T10n0293_009:0700c16_8"
    },
    {
        "source_sentence": "此婆羅門五熱炙身時，其火光明下照阿鼻及諸地獄，諸所受苦，悉令休息。",
        "translation": "When this Brāhmaṇa’s body is being burned in the five kinds of heat, the light of that fire shines downward and illumines the avīci hells and all the pain they experience. All are made to rest.",
        "source": "T10n0293_009:0700c17_9"
    },
    {
        "source_sentence": "我等遇此光明照故，心生淨信，以信心故，罪垢除滅，從彼命終，生於天中，",
        "translation": "Because our minds were illumined by this ray of light, we had pure faith in it. And because of that faith we were rid of the defilement of sinfulness and were reborn in heaven when our lives ended there.",
        "source": "T10n0293_009:0700c18_10"
    },
    {
        "source_sentence": "以慚愧故，為知恩故，捨離欲樂，而來其所，恭敬戀仰，無有厭足。",
        "translation": "Because of a sense of shame and embarrassment, in order to know kindness, they abandon their desires and pleasures and come to them with respect and affection, never getting tired of it.",
        "source": "T10n0293_009:0700c20_11"
    },
    {
        "source_sentence": "時，婆羅門為我說法，能令我等及與無量百千眾生，發阿耨多羅三藐三菩提心。」",
        "translation": "The Brāhmaṇa then taught me the Dharma so that we and measureless hundreds of thousands of sentient beings would give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T10n0293_009:0700c22_0"
    },
    {
        "source_sentence": "爾時，善財童子得聞如是種種說法，心大歡喜，踊躍無量，於婆羅門所，",
        "translation": "At that time, having heard these various discourses, Sudhana was greatly delighted and jumped for joy.",
        "source": "T10n0293_009:0700c24_0"
    },
    {
        "source_sentence": "發起真實善知識想。",
        "translation": "They give rise to the perception of true good teachers.",
        "source": "T10n0293_009:0700c25_1"
    },
    {
        "source_sentence": "頭頂禮足，恭敬合掌，唱如是言：「我於大聖善知識所，生不信心而懷疑惑，",
        "translation": "He bowed his forehead at his feet, respectfully joined his palms, and said these words: At the place of the Great Sage, who is well versed in Buddhism, I do not have faith but harbor doubt.",
        "source": "T10n0293_009:0700c26_2"
    },
    {
        "source_sentence": "唯願聖者容我悔過。」",
        "translation": "Please, noble one, allow me to repent.",
        "source": "T10n0293_009:0700c27_3"
    },
    {
        "source_sentence": "「若有諸菩薩，　　順善知識教，",
        "translation": "“If there are bodhisattvas who follow the teachings of good teachers,",
        "source": "T10n0293_009:0700c28_4"
    },
    {
        "source_sentence": "　一切無疑懼，　　安住心不動。",
        "translation": "They all have no doubts or fears, and their minds are stable and unmoving.",
        "source": "T10n0293_009:0700c28_4"
    },
    {
        "source_sentence": "　彼當決定得，　　諸佛自然智，",
        "translation": "They will surely attain The natural knowledge of the Buddhas.",
        "source": "T10n0293_009:0700c28_4"
    },
    {
        "source_sentence": "　降魔坐道場，　　廣度無邊眾。」",
        "translation": "He subdued Māra and sat at the site of enlightenment, extensively liberating limitless multitudes.",
        "source": "T10n0293_009:0700c28_4"
    },
    {
        "source_sentence": "時，婆羅門即為善財而說偈曰：爾時，善財童子聞此偈已，即登刀山，",
        "translation": "Then the brahman spoke these verses to Sudhana: At that moment, having heard these verses, Sudhana climbed up a mountain of swords.",
        "source": "T10n0293_009:0700c28_4"
    },
    {
        "source_sentence": "自投火聚，未至中間，即得菩薩善住堅牢清淨三昧；",
        "translation": "They threw themselves into a cluster of flames, but before reaching the middle they attain the pure concentration of enlightening beings well established in firmness and purity.",
        "source": "T10n0293_009:0701a05_5"
    },
    {
        "source_sentence": "纔觸火焰，復得菩薩寂靜樂神通門三昧。",
        "translation": "As soon as he touches the flame, he'll again attain the bodhisattva's tranquil and blissful miraculous approach samādhi.",
        "source": "T10n0293_009:0701a07_6"
    },
    {
        "source_sentence": "善財白言：「甚奇！",
        "translation": "Shanzai said, Very wonderful!",
        "source": "T10n0293_009:0701a08_0"
    },
    {
        "source_sentence": "聖者！",
        "translation": "Noble one!",
        "source": "T10n0293_009:0701a08_1"
    },
    {
        "source_sentence": "如是刀鋒，及大火焰，我身觸時安隱快樂。」",
        "translation": "Thus, when I touch the tip of a sword or a great flame of fire, my body is peaceful and happy.",
        "source": "T10n0293_009:0701a08_2"
    },
    {
        "source_sentence": "時，婆羅門告善財言：「善男子！",
        "translation": "The Brāhmaṇa then addressed Sun Cai, Good man!",
        "source": "T10n0293_009:0701a09_3"
    },
    {
        "source_sentence": "我唯得此菩薩普圓滿無盡輪解脫，如諸菩薩摩訶薩大功德焰，悉能燒盡一切眾生諸見煩惱，",
        "translation": "“I am the only one who has attained this enlightening liberation, complete and inexhaustible wheel of universal fulfillment. Like the great flame of virtues of all enlightening beings, I am able to burn up the afflictions of",
        "source": "T10n0293_009:0701a10_4"
    },
    {
        "source_sentence": "安住菩薩無退轉心、無窮盡心、無懈怠心、無怯弱心，如那羅延金剛藏心、疾修諸行無慢惰心，",
        "translation": "Abiding peacefully, the enlightening beings have no retrogressing mind, no inexhaustible mind, no lazy mind, and no faint-hearted mind. They are like the diamond-treasury mind of Nārayana, who",
        "source": "T10n0293_009:0701a12_5"
    },
    {
        "source_sentence": "大願風輪，普持一切，勇猛堅誓無有退轉。",
        "translation": "The wind-wheel of the great vow universally sustains all, and it's a bold and resolute vow that doesn't regress.",
        "source": "T10n0293_009:0701a14_6"
    },
    {
        "source_sentence": "而我云何能知、能說彼功德行？",
        "translation": "How can I know and explain their meritorious actions?",
        "source": "T10n0293_009:0701a15_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0701a16_8"
    },
    {
        "source_sentence": "南方有城名師子頻申，彼城有王名無畏星宿幢王，有童女名為慈行，汝詣彼問菩薩云何學菩薩行，",
        "translation": "To the south, there's a city named Shizi Bianzhen. That city has a king named Fearless Constellation King and a young woman named Maitreya. Go ask her how an enlightening being is to learn the practice of en",
        "source": "T10n0293_009:0701a16_9"
    },
    {
        "source_sentence": "修菩薩道。」",
        "translation": "He cultivates the bodhisattva path.",
        "source": "T10n0293_009:0701a18_10"
    },
    {
        "source_sentence": "時，善財童子頂禮其足，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "Then Sudhana went up to him, paid his respects, and departed. Thereupon, Bodhisattva Sadāparibhūta bowed his head at the Buddha’s feet and circumambulated him countless times.",
        "source": "T10n0293_009:0701a18_11"
    },
    {
        "source_sentence": "爾時，善財童子於善知識所，起不思議最極尊重心；",
        "translation": "At that time, at the company of spiritual benefactors, Sudhana conceived an inconceivable mind of great respect.",
        "source": "T10n0293_009:0701a21_0"
    },
    {
        "source_sentence": "生廣大清淨信解心；",
        "translation": "They give rise to a vast mind of pure faith and understanding.",
        "source": "T10n0293_009:0701a22_1"
    },
    {
        "source_sentence": "常念大乘恒不捨離心；",
        "translation": "They always think of the Great Vehicle and never give up their minds.",
        "source": "T10n0293_009:0701a22_2"
    },
    {
        "source_sentence": "專求佛智常無異念心；",
        "translation": "They concentrate on seeking buddha-knowledge and always have no different thoughts.",
        "source": "T10n0293_009:0701a23_3"
    },
    {
        "source_sentence": "觀法境界無有疑惑。",
        "translation": "There's no doubt in observing the Dharma realm.",
        "source": "T10n0293_009:0701a23_4"
    },
    {
        "source_sentence": "一心繫念隨善知識，無障礙智常現在前，決定住於真實智際，善能分別諸法實際，",
        "translation": "With one mind concentrated on following spiritual benefactors, unhindered knowledge always appearing before them. Abiding with certainty at the realm of knowledge, they are able to analyze all phenomena as they really are.",
        "source": "T10n0293_009:0701a24_5"
    },
    {
        "source_sentence": "普入三世諸剎那際，隨順解了如虛空際，現見諸法恒無二際，住於法界無分別際，",
        "translation": "They enter into the spacelike boundlessness of all times, and they see all things as eternally nondual. Abiding in the realm of reality, they have no discriminating boundaries.",
        "source": "T10n0293_009:0701a26_6"
    },
    {
        "source_sentence": "入一切義無障礙際，住一切劫無失壞際，隨順調伏諸業性際，如來最勝不共法際，",
        "translation": "Entering into all meanings without obstruction, abiding for all ages without loss or destruction, following and taming the essence of actions, the enlightened is supremely uncommon dharmas.",
        "source": "T10n0293_009:0701a27_7"
    },
    {
        "source_sentence": "解了如來無際之際。",
        "translation": "He understands that the Tathāgata has no limit.",
        "source": "T10n0293_009:0701a29_8"
    },
    {
        "source_sentence": "以最勝智，悉能破壞一切執著、顛倒想網，不取一切同異剎土差別之相，",
        "translation": "With supreme knowledge they can destroy all webs of attachment and deluded conceptualization, not grasping the distinctive characteristics of all similarities and differences in buddha-lands.",
        "source": "T10n0293_009:0701b01_9"
    },
    {
        "source_sentence": "亦復不取一切諸佛眾會道場和合之相；",
        "translation": "Nor does he grasp the characteristic of the convergence of all buddhas’ congregations at enlightenment sites.",
        "source": "T10n0293_009:0701b02_10"
    },
    {
        "source_sentence": "不取佛剎清淨之相，了知眾生皆無有我及眾生相。",
        "translation": "They don't grasp the pure characteristics of buddha bases, and they understand that all sentient beings lack self and the characteristics of sentient beings.",
        "source": "T10n0293_009:0701b03_11"
    },
    {
        "source_sentence": "亦知一切音聲、語言如空谷響，亦知一切差別眾色皆如影像，如是思惟，",
        "translation": "They also know all sounds and words are like the sound of an empty valley, and they know that all distinct forms are like images.",
        "source": "T10n0293_009:0701b05_12"
    },
    {
        "source_sentence": "正念觀察。",
        "translation": "He observes it with right mindfulness.",
        "source": "T10n0293_009:0701b06_13"
    },
    {
        "source_sentence": "漸次南行，向師子頻申城，周遍詢求慈行童女。",
        "translation": "Going gradually south, he approached the city of Siṃhala and pervaded it all over to enquire about Maitreya.",
        "source": "T10n0293_009:0701b06_14"
    },
    {
        "source_sentence": "聞眾人言：「彼是王女，處在王宮，五百童女以為侍從。",
        "translation": "He heard the crowd say, That's the king's daughter, who was staying at the king's palace with five hundred girls as her attendants.",
        "source": "T10n0293_009:0701b08_15"
    },
    {
        "source_sentence": "住毘盧遮那摩尼藏殿，於龍勝栴檀足金線網天衣座上而說妙法。」",
        "translation": "He stayed in the Vairocana maṇi store hall and explained the marvelous teaching on the throne of the dragon's superior sandalwood-legged, gold-wire net heavenly robe.",
        "source": "T10n0293_009:0701b09_16"
    },
    {
        "source_sentence": "善財聞已，詣王宮門，一心渴仰求見彼女。",
        "translation": "Having heard this, Sudhana went to the palace gate of the king’s palace and asked him to see her.",
        "source": "T10n0293_009:0701b10_17"
    },
    {
        "source_sentence": "于時乃見無量人眾來入宮中，善財問言：「諸人今者欲何所詣？」",
        "translation": "When he saw measureless people coming into the palace, Sun Cai asked, Where do you people want to go now?",
        "source": "T10n0293_009:0701b11_18"
    },
    {
        "source_sentence": "人咸報言：「我等欲詣慈行童女，聽受妙法。」",
        "translation": "The people all reported, We want to go to the Maidens of Mercy and hear the wonderful teaching.",
        "source": "T10n0293_009:0701b13_19"
    },
    {
        "source_sentence": "善財即念：「此王宮門，既無限礙，我亦應入。」",
        "translation": "Sun Cai then thought, Since there's no obstruction at the entrance to this king's palace, I should enter as well.",
        "source": "T10n0293_009:0701b14_20"
    },
    {
        "source_sentence": "遂入王宮，見其寶殿玻瓈為地，瑠璃為柱，金剛為壁，閻浮檀金以為垣牆，",
        "translation": "He entered the king’s palace and saw that the jeweled hall was built of crystal, with a base made of earthenware, pillars of lapis lazuli, walls of diamond, and walls of jambu sandalwood.",
        "source": "T10n0293_009:0701b15_21"
    },
    {
        "source_sentence": "眾寶欄楯百千雜寶，光明普照而為窓牖；",
        "translation": "The railings of myriad jewels and hundreds of thousands of mixed jewels shining brightly illumined the sky as windows.",
        "source": "T10n0293_009:0701b16_22"
    },
    {
        "source_sentence": "阿僧祇勝摩尼寶而莊校之，寶藏摩尼鏡圓滿莊嚴；",
        "translation": "They were adorned with innumerable jewels, adorned with mirrors of all kinds of jewels.",
        "source": "T10n0293_009:0701b17_23"
    },
    {
        "source_sentence": "世中最上光藏摩尼寶晝夜光明以為照耀；",
        "translation": "The world’s highest jewel mine of light shines brightly, shining day and night like a ray of light.",
        "source": "T10n0293_009:0701b19_0"
    },
    {
        "source_sentence": "無數寶網周匝彌覆，窓闥交映，眾寶相輝；",
        "translation": "It is surrounded by countless webs of jewels. The windows are interspersed with reflections of all kinds of jewels shining brilliantly.",
        "source": "T10n0293_009:0701b20_0"
    },
    {
        "source_sentence": "百千金鈴懸置其上，微風吹動出微妙音；",
        "translation": "Hundreds of thousands of golden bells hung above it, and subtle sounds were uttered by the slightest gust of wind.",
        "source": "T10n0293_009:0701b20_1"
    },
    {
        "source_sentence": "有如是等不可思議眾寶嚴飾。",
        "translation": "Such are the inconceivable treasures and adornments.",
        "source": "T10n0293_009:0701b21_2"
    },
    {
        "source_sentence": "慈行童女，身真金色，目髮紺青，形貌端嚴，相好具足，以梵音聲而演說法。",
        "translation": "The Maitreya, with a golden-colored body and blue eyes, was endowed with the marks and embellishments of greatness. She expounded the Dharma in Sanskrit.",
        "source": "T10n0293_009:0701b22_3"
    },
    {
        "source_sentence": "善財見已，頂禮其足，遶無數匝，合掌恭敬，於一面立白言：「聖者！",
        "translation": "Seeing them, Sudhana bowed his head at their feet and said to them:",
        "source": "T10n0293_009:0701b24_4"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，云何修菩薩道？",
        "translation": "I've previously aroused the mind of unsurpassed, correct, and complete enlightenment, but I don't know how an enlightening being is to train in the practice of enlightening beings and how an enlightening being is to cultiva",
        "source": "T10n0293_009:0701b25_5"
    },
    {
        "source_sentence": "我聞聖者善能誘誨，願為我說。」",
        "translation": "I've heard that the noble one is good at encouraging, so please tell me about it.",
        "source": "T10n0293_009:0701b27_6"
    },
    {
        "source_sentence": "童女告言：「善男子！",
        "translation": "The girl told him, Good man!",
        "source": "T10n0293_009:0701b28_7"
    },
    {
        "source_sentence": "汝應觀我所住宮殿內外，種種莊嚴之事。」",
        "translation": "You should observe the various adornments inside and outside of the palace where I live.",
        "source": "T10n0293_009:0701b28_8"
    },
    {
        "source_sentence": "善財頂禮，如教觀察，見一一壁中、一一鏡中、一一柱中、一一相中、一一形像中、一一寶網中、一一欄楯中、一一金鈴中、一一寶樹中、一一寶瓔珞中、一一莊嚴具中、一一寶形像中、一一摩尼寶中、一一光明照世毘盧遮那寶中，",
        "translation": "Sudhana paid his respects to the buddha, looked inside each wall, each mirror, each pillar, each sign, each image, each net of jewels, each railing, each golden bell, each tree of jewels, each necklace of je",
        "source": "T10n0293_009:0701b29_9"
    },
    {
        "source_sentence": "悉見十方一切法界一切如來，從初發心修菩薩道，各各行願，各各境界，",
        "translation": "They see all the buddhas of the ten directions, from their initial determination for enlightenment, cultivating the path of enlightening beings, each carrying out their vows and objective realms.",
        "source": "T10n0293_009:0701c06_10"
    },
    {
        "source_sentence": "各各出興成等正覺，各各示現廣大神變轉妙法輪，乃至各各現入涅槃。",
        "translation": "Each one produces the accomplishment of perfect enlightenment, each one shows vast miraculous transformations to turn the wonderful wheel of the Dharma, and each one shows entry into nirvāṇa.",
        "source": "T10n0293_009:0701c07_11"
    },
    {
        "source_sentence": "如是影相，種種境界，如鏡中像，亦如淨水，普見虛空日月星宿。",
        "translation": "The various objects of these images are like reflections in a mirror or like clear water, seeing the sun, moon, stars, and constellations in space.",
        "source": "T10n0293_009:0701c09_12"
    },
    {
        "source_sentence": "如此皆是慈行童女過去所修大善根力，所有眾像於中顯現。",
        "translation": "These are all the images of the great roots of goodness cultivated by Maitreya in the past that appear here.",
        "source": "T10n0293_009:0701c10_13"
    },
    {
        "source_sentence": "爾時，善財憶所觀察，一切諸佛莊嚴剎土，功德行願神變之相，合掌恭敬，",
        "translation": "At that time Sudhana remembered what he had observed, the buddha-lands adorned by all Buddhas, the miraculous signs of their virtuous deeds and vows, joined his palms in respect.",
        "source": "T10n0293_009:0701c12_14"
    },
    {
        "source_sentence": "一心瞻仰慈行童女。",
        "translation": "With one mind, he looks up to the girl Maitreya.",
        "source": "T10n0293_009:0701c13_15"
    },
    {
        "source_sentence": "時，彼童女告善財言：「善男子！",
        "translation": "The young woman then addressed Shanzai, Good man!",
        "source": "T10n0293_009:0701c14_16"
    },
    {
        "source_sentence": "此般若波羅蜜普莊嚴門，我於三十六恒河沙數諸如來所，求得此法。",
        "translation": "This is the universally adorned approach of prajñā-pāramitā, which I sought to attain in the presence of as many tathāgatas as there are sands in thirty-six Ganges Rivers.",
        "source": "T10n0293_009:0701c15_17"
    },
    {
        "source_sentence": "彼諸如來，各以種種異方便門，令我得入一佛所演，餘不重說。」",
        "translation": "Each of those tathāgatas uses various different approaches to enable me to enter into what one Buddha teaches, and the rest won't explain it again.",
        "source": "T10n0293_009:0701c16_18"
    },
    {
        "source_sentence": "善財白言：「聖者！",
        "translation": "Shanzai said, Sage!",
        "source": "T10n0293_009:0701c18_19"
    },
    {
        "source_sentence": "此般若波羅蜜普莊嚴門，境界云何？」",
        "translation": "What is the sphere of this prajñāpāramitā's universally adorned approach?",
        "source": "T10n0293_009:0701c18_20"
    },
    {
        "source_sentence": "童女答言：「善男子！",
        "translation": "The girl replied, Good man!",
        "source": "T10n0293_009:0701c19_21"
    },
    {
        "source_sentence": "我入此般若波羅蜜普莊嚴門，隨順趣向思惟、觀察、憶持、分別所有境界、所有威儀、所有相狀、所有證入，",
        "translation": "I enter this universally adorned approach of prajñā-pāramitā and follow it, contemplating, observing, remembering, analyzing all objects, all manner of deportment, all characteristics, and all realizations.",
        "source": "T10n0293_009:0701c20_0"
    },
    {
        "source_sentence": "即時獲得普遍出生陀羅尼門，百萬阿僧祇陀羅尼門，皆悉現前。",
        "translation": "They immediately attain the dhāraṇī aspect of universally produced dhāraṇī, and a million incalculable dhāraṇī aspects all appear before them.",
        "source": "T10n0293_009:0701c22_1"
    },
    {
        "source_sentence": "如水漩澓速疾顯現，所謂：佛陀羅尼門，法陀羅尼門，佛剎陀羅尼門，",
        "translation": "They are like water whirling swirls that quickly appear: they are called the doors of enlightenment spells, the doors of truth spells, and the doors of buddha-lands spells.",
        "source": "T10n0293_009:0701c23_2"
    },
    {
        "source_sentence": "眾生陀羅尼門，普遍陀羅尼門，過去陀羅尼門，未來陀羅尼門，現在陀羅尼門，",
        "translation": "The dhāraṇī aspect of sentient beings, the universal dhāraṇī aspect, the past dhāraṇī aspect, the future dhāraṇī aspect, and the present dhāraṇī aspect.",
        "source": "T10n0293_009:0701c25_3"
    },
    {
        "source_sentence": "常住際陀羅尼門，福德陀羅尼門，福德聚陀羅尼門，智慧陀羅尼門，智慧聚陀羅尼門，",
        "translation": "The dhāraṇī aspect of eternally abiding, the dhāraṇī aspect of virtue, the dhāraṇī aspect of accumulation of virtue, the dhāraṇī aspect of wisdom, and the dhāraṇī aspect of accumulation of wisdom.",
        "source": "T10n0293_009:0701c27_4"
    },
    {
        "source_sentence": "諸願陀羅尼門，分別諸願陀羅尼門，行陀羅尼門，行清淨陀羅尼門，行修集陀羅尼門，",
        "translation": "The dhāraṇī teaching of vows, the dhāraṇī teaching of discerning vows, the dhāraṇī teaching of practice, the dhāraṇī teaching of practice, the pure dhāraṇī teaching of practice, and the dhāraṇī teaching",
        "source": "T10n0293_009:0701c29_5"
    },
    {
        "source_sentence": "行圓滿陀羅尼門，業陀羅尼門，業不失壞陀羅尼門，業清淨陀羅尼門，",
        "translation": "They are the dhāraṇī aspect of practice, the dhāraṇī aspect of action, the dhāraṇī aspect of action without loss, the dhāraṇī aspect of action, and the pure dhāraṇī aspect of action.",
        "source": "T10n0293_009:0702a02_6"
    },
    {
        "source_sentence": "業流注陀羅尼門，業現前所作陀羅尼門，捨離惡業陀羅尼門，修習正業陀羅尼門，",
        "translation": "They are the dhāraṇī aspect of accumulating karma, the dhāraṇī aspect of manifesting karma, the dhāraṇī aspect of abandoning bad actions, and the dhāraṇī aspect of cultivating right action.",
        "source": "T10n0293_009:0702a04_7"
    },
    {
        "source_sentence": "業自在陀羅尼門，善行陀羅尼門，常持善行陀羅尼門，三昧陀羅尼門，",
        "translation": "The dhāraṇī aspect of the mastery of action, the dhāraṇī aspect of good conduct, the dhāraṇī aspect of always maintaining good conduct, and the dhāraṇī aspect of concentration.",
        "source": "T10n0293_009:0702a05_8"
    },
    {
        "source_sentence": "隨順三昧陀羅尼門，觀察三昧陀羅尼門，三昧境界陀羅尼門，從三昧起陀羅尼門，",
        "translation": "He follows the dhāraṇī aspect of samādhi, observes the dhāraṇī aspect of samādhi, the dhāraṇī aspect of the realm of samādhi, and the dhāraṇī aspect of arising from samādhi.",
        "source": "T10n0293_009:0702a07_9"
    },
    {
        "source_sentence": "神通陀羅尼門，心海陀羅尼門，種種心陀羅尼門，直心陀羅尼門，清淨心陀羅尼門，",
        "translation": "The dhāraṇī aspect of supernormal powers, the dhāraṇī aspect of mind-sea dhāraṇī, the various mental dhāraṇī aspects, the Dhāraṇī aspect of straight mind, and the Dhāraṇī aspect of pure mind",
        "source": "T10n0293_009:0702a09_10"
    },
    {
        "source_sentence": "照心稠林陀羅尼門，心地清淨陀羅尼門，知眾生心所生處陀羅尼門，知眾生微細心陀羅尼門，",
        "translation": "The door of the dhāraṇī of illuminating the thicket of mind, the door of the dhāraṇī of mental purity, the door of the dhāraṇī of knowing where sentient beings’ minds arise, and the door of the dh",
        "source": "T10n0293_009:0702a11_11"
    },
    {
        "source_sentence": "知眾生煩惱行陀羅尼門，知煩惱習氣陀羅尼門，知煩惱方便陀羅尼門，",
        "translation": "“Great enlightening beings of the ten directions know the dhāraṇī aspects of afflictive behavior of sentient beings, the Dhāraṇī aspects of the habit energy of affliction, and the Dhāraṇī aspects of the means of",
        "source": "T10n0293_009:0702a13_12"
    },
    {
        "source_sentence": "知煩惱所作陀羅尼門，知眾生信陀羅尼門，知眾生解陀羅尼門，知眾生行陀羅尼門，",
        "translation": "“Great enlightening beings of the ten directions know the spell-conducting dhāraṇī for afflictions, the spell-conducting dhāraṇī for sentient beings’ faith, the spell-conducting dhāraṇī",
        "source": "T10n0293_009:0702a15_13"
    },
    {
        "source_sentence": "知眾生信解諸行差別陀羅尼門，知眾生性陀羅尼門，知眾生欲陀羅尼門，",
        "translation": "“Great enlightening beings of the ten directions know the dhāraṇī aspects of faith in sentient beings’ different practices; they know the dhāraṇī aspects of the nature of sentient beings; they know the Dhāraṇī aspects",
        "source": "T10n0293_009:0702a17_14"
    },
    {
        "source_sentence": "知眾生想陀羅尼門，知世界所起陀羅尼門，普見十方陀羅尼門，普見一切法陀羅尼門，",
        "translation": "“Great enlightening beings of the ten directions saw the door of knowledge of mental command producing all kinds of spells, the door of knowledge of mystic spells perceiving sentient beings’ thoughts, the door of knowledge of the spells",
        "source": "T10n0293_009:0702a18_15"
    },
    {
        "source_sentence": "說法陀羅尼門，大慈陀羅尼門，大悲陀羅尼門，寂靜陀羅尼門，語言道陀羅尼門，",
        "translation": "He taught the Dharma through the dhāraṇī of teaching, the dhāraṇī of great kindness, the dhāraṇī of great compassion, the dhāraṇī of great compassion, the dhāraṇī of tranquility, and the dhāraṇ",
        "source": "T10n0293_009:0702a20_16"
    },
    {
        "source_sentence": "解脫陀羅尼門，普遍出生陀羅尼門，無著際陀羅尼門，方便非方便陀羅尼門，",
        "translation": "the dhāraṇī aspect of liberation, the dhāraṇī aspect of universally producing dhāraṇīs, the dhāraṇī aspect of no attachment, the dhāraṇī aspect of skillful means and not skillful means,",
        "source": "T10n0293_009:0702a22_17"
    },
    {
        "source_sentence": "隨順陀羅尼門，差別陀羅尼門，普入陀羅尼門，無礙際陀羅尼門，普遍一切陀羅尼門，",
        "translation": "They follow the teaching of dhāraṇī, the teaching of differentiated dhāraṇī, the teaching of universal entry into dhāraṇī, the teaching of unobstructed dhāraṇī, and the teaching of all dhāraṇī teachings.",
        "source": "T10n0293_009:0702a24_18"
    },
    {
        "source_sentence": "佛法陀羅尼門，菩薩法陀羅尼門，聲聞法陀羅尼門，獨覺法陀羅尼門，",
        "translation": "the dhāraṇī aspect of the Buddha's teaching, the dhāraṇī aspect of the bodhisattva's teaching, the dhāraṇī aspect of the śrāvaka's teaching, and the dhāraṇī aspect of the solitary realiz",
        "source": "T10n0293_009:0702a26_19"
    },
    {
        "source_sentence": "世間法陀羅尼門，世界成陀羅尼門，世界壞陀羅尼門，世界住陀羅尼門，",
        "translation": "the dhāraṇī aspect of worldly dharmas, the dhāraṇī aspect of worldly formations, the dhāraṇī aspect of worldly destructions, and the dhāraṇī aspect of worldly abiding.",
        "source": "T10n0293_009:0702a28_20"
    },
    {
        "source_sentence": "世界莊嚴陀羅尼門，世界形狀陀羅尼門，狹世界陀羅尼門，廣世界陀羅尼門，",
        "translation": "the dhāraṇī aspect of world adornments, the dhāraṇī aspect of world shapes, the dhāraṇī aspect of narrow worlds, and the dhāraṇī aspect of vast worlds.",
        "source": "T10n0293_009:0702a29_21"
    },
    {
        "source_sentence": "垢世界陀羅尼門，淨世界陀羅尼門，於淨世界現垢世界陀羅尼門，於垢世界現淨世界陀羅尼門，",
        "translation": "The dhāraṇī aspect of the world of defilement, the dhāraṇī aspect of the world of purity, the dhāraṇī aspect of showing the world of defilement in the world of purity, and the dhāraṇī aspect of showing",
        "source": "T10n0293_009:0702b02_22"
    },
    {
        "source_sentence": "純垢世界陀羅尼門，純淨世界陀羅尼門，垢淨世界陀羅尼門，淨垢世界陀羅尼門，",
        "translation": "The dhāraṇī aspect of the world of pure defilement, the dhāraṇī aspect of the world of pure defilement, the dhāraṇī aspect of the world of pure defilement, the dhāraṇī aspect of the world of pure de",
        "source": "T10n0293_009:0702b04_23"
    },
    {
        "source_sentence": "平坦世界陀羅尼門，高下世界陀羅尼門，覆世界陀羅尼門，仰世界陀羅尼門，",
        "translation": "the dhāraṇī-gate of level worlds, the dhāraṇī-gate of high and low worlds, the dhāraṇī-gate of covering worlds, the dhāraṇī-gate of upward worlds,",
        "source": "T10n0293_009:0702b06_24"
    },
    {
        "source_sentence": "側世界陀羅尼門，世界網陀羅尼門，世界轉陀羅尼門，世界各別依想住陀羅尼門，",
        "translation": "They are the dhāraṇī teachings of the worlds at the sides, the dhāraṇī teachings of the world networks, the dhāraṇī teachings of the world-transforming worlds, and the dhāraṇī teachings of the",
        "source": "T10n0293_009:0702b08_25"
    },
    {
        "source_sentence": "世界行陀羅尼門，細入麁陀羅尼門，麁入細陀羅尼門，大入小陀羅尼門，",
        "translation": "They are the dhāraṇī aspect of worldly practices, the subtle dhāraṇī aspect of entering and exiting, the subtle dhāraṇī aspect of entering, the great dhāraṇī aspect of entering and the small dhāraṇ",
        "source": "T10n0293_009:0702b10_26"
    },
    {
        "source_sentence": "小入大陀羅尼門，見諸佛陀羅尼門，分別佛身陀羅尼門，見佛光明莊嚴網陀羅尼門，",
        "translation": "He entered the great dhāraṇī teaching by entering small, saw the buddhas’ dhāraṇī teachings, discerned the buddha-body dhāraṇī teaching, and perceived the network of arrays of Buddha’s light.",
        "source": "T10n0293_009:0702b12_27"
    },
    {
        "source_sentence": "聞佛圓滿妙音聲陀羅尼門，佛轉法輪陀羅尼門，佛法輪成就陀羅尼門，",
        "translation": "The dhāraṇī aspect of hearing the Buddha’s perfect and wondrous sound, the dhāraṇī aspect of turning the wheel of the teaching by the Buddha, and the dhāraṇī aspect of accomplishing the teaching by the Buddha.",
        "source": "T10n0293_009:0702b14_28"
    },
    {
        "source_sentence": "佛法輪差別陀羅尼門，佛法輪無差別陀羅尼門，佛法輪訓釋陀羅尼門，",
        "translation": "the dhāraṇī aspect of the differentiation of the Buddha's wheel of teaching, the dhāraṇī aspect of the absence of distinctions in the Buddha's wheel of teaching, and the dhāraṇī aspect of the explanation of the Buddha's teaching",
        "source": "T10n0293_009:0702b15_29"
    },
    {
        "source_sentence": "佛法輪旋轉陀羅尼門，佛身普遍陀羅尼門，佛會圓滿陀羅尼門，能作佛事陀羅尼門，",
        "translation": "The dhāraṇī aspect of turning the wheel of the Buddha’s teaching, the dhāraṇī aspect of pervading the buddha-body, the dhāraṇī aspect of assemblies perfected by enlightenment, and the dhāraṇ",
        "source": "T10n0293_009:0702b17_30"
    },
    {
        "source_sentence": "了知佛會差別相陀羅尼門，遍入佛眾會海陀羅尼門，諸佛光照陀羅尼門，",
        "translation": "He comprehended the dhāraṇī aspect of the different characteristics of the Buddha’s assemblies, entered into the oceanic dhāraṇī aspect of the assemblies of buddhas everywhere, and entered into the Dhāraṇī aspect",
        "source": "T10n0293_009:0702b19_31"
    },
    {
        "source_sentence": "諸佛三昧陀羅尼門，諸佛三昧自在用陀羅尼門，諸佛住處陀羅尼門，諸佛加持陀羅尼門，",
        "translation": "The dhāraṇī teaching of the concentrations of the buddhas, the dhāraṇī teaching of the unimpeded functioning of the concentrations of the buddhas, the dhāraṇī teaching of the abodes of the buddhas, and the dhāra",
        "source": "T10n0293_009:0702b21_32"
    },
    {
        "source_sentence": "諸佛變化陀羅尼門，諸佛遊戲陀羅尼門，佛知眾生心行差別陀羅尼門，",
        "translation": "The dhāraṇī aspect of the transformations of the Buddhas, the dhāraṇī aspect of the plays of the Buddhas, the dhāraṇī aspect of knowing the distinctions in minds and actions of sentient beings,",
        "source": "T10n0293_009:0702b23_33"
    },
    {
        "source_sentence": "諸佛神通種種變現陀羅尼門，住兜率宮所作業陀羅尼門，乃至示現入于涅槃陀羅尼門，",
        "translation": "The dhāraṇī of the various manifestations of the Buddha’s supernatural powers, the dhāraṇī of the deeds performed while abiding in the palace of satisfaction, up to the dhāraṇī of manifesting entering nirvana",
        "source": "T10n0293_009:0702b24_34"
    },
    {
        "source_sentence": "利益眾生陀羅尼門，入甚深法陀羅尼門，入微妙法陀羅尼門，菩提心相陀羅尼門，",
        "translation": "The dhāraṇī approach of benefiting sentient beings, the dhāraṇī approach of entering profound principles, the dhāraṇī approach of entering subtle principles, and the dhāraṇī approach of the characteristics of the mind",
        "source": "T10n0293_009:0702b26_35"
    },
    {
        "source_sentence": "菩提心所從生陀羅尼門，菩提心助道相陀羅尼門，諸願陀羅尼門，諸行陀羅尼門，",
        "translation": "The dhāraṇī teaching that arises from the mind of enlightenment, the dhāraṇī teaching that aids in the path by the mind of enlightenment, the dhāraṇī teaching that vows, and the dhāraṇī teaching that",
        "source": "T10n0293_009:0702b28_36"
    },
    {
        "source_sentence": "神通相陀羅尼門，出離相陀羅尼門，總持清淨相陀羅尼門，智輪清淨相陀羅尼門，",
        "translation": "The dhāraṇī of the characteristics of supernormal powers, the dhāraṇī of the characteristics of emancipation, the dhāraṇī of the characteristics of liberation, the dhāraṇī of the pure characteristics of the",
        "source": "T10n0293_009:0702c01_37"
    },
    {
        "source_sentence": "智慧清淨相陀羅尼門，無量解脫相陀羅尼門，念力清淨陀羅尼門，自心清淨陀羅尼門。",
        "translation": "The dhāraṇī aspect of the pure characteristics of wisdom, the dhāraṇī aspect of the characteristics of immeasurable liberation, the dhāraṇī aspect of the pure characteristics of mindfulness, and the dhāraṇī aspect of",
        "source": "T10n0293_009:0702c03_38"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0702c05_39"
    },
    {
        "source_sentence": "我唯知此般若波羅蜜普莊嚴門，如諸菩薩摩訶薩，其心廣大，等虛空界，",
        "translation": "I only know this door of the universal adornment of prajñā-pāramitā, like all the great enlightening beings whose minds are as vast as space.",
        "source": "T10n0293_009:0702c05_40"
    },
    {
        "source_sentence": "入於法界，智慧寬博，福德成滿，堅固不動。",
        "translation": "He entered the realm of reality, his knowledge and wisdom broad and extensive. Perfected in virtue, he remained steadfast and unshakable.",
        "source": "T10n0293_009:0702c07_41"
    },
    {
        "source_sentence": "住出世法，遠離世間，勤求修習，向一切智；",
        "translation": "They abide in transmundane dharmas, being far removed from the world. They diligently seek and practice them, proceeding toward omniscience.",
        "source": "T10n0293_009:0702c08_42"
    },
    {
        "source_sentence": "智眼清淨，無諸垢翳，身語心行，悉皆清淨；",
        "translation": "Their eyes of knowledge and insight were pure, free from defilement. All their bodily, verbal, and mental actions were pure.",
        "source": "T10n0293_009:0702c09_43"
    },
    {
        "source_sentence": "以差別智，普入諸法，無障礙慧，猶如虛空。",
        "translation": "Because of their distinctive knowledge, they universally enter all dharmas with unobstructed wisdom like space.",
        "source": "T10n0293_009:0702c10_44"
    },
    {
        "source_sentence": "通達一切世間境界，獲無礙地大光明藏，善巧分別一切法義，一切世間無能映奪。",
        "translation": "He comprehends all worldly realms, attains the great store of light of the unobstructed earth, skillfully discerns the meanings of all dharmas, and nothing in all worlds can overpower him.",
        "source": "T10n0293_009:0702c11_45"
    },
    {
        "source_sentence": "常行於世，不染世法，能益於世，非世所壞；",
        "translation": "They always act in the world, without being influenced by worldly phenomena. They can benefit the world and not be destroyed by the world.",
        "source": "T10n0293_009:0702c13_46"
    },
    {
        "source_sentence": "為諸眾生究竟依止，善了一切眾生語言，明解眾生種種儀式；",
        "translation": "In order to be the ultimate refuge of sentient beings, they understand the speech of all sentient beings and explain the various rituals for sentient beings.",
        "source": "T10n0293_009:0702c14_47"
    },
    {
        "source_sentence": "知諸眾生業習根器，隨其心行，如應說法；",
        "translation": "They know sentient beings’ faculties, roots, and vessels of karmic impressions; according to their mental patterns they teach the Dharma in accord with what should be done.",
        "source": "T10n0293_009:0702c15_48"
    },
    {
        "source_sentence": "於一切處普隨現身，於一切時恒得自在。",
        "translation": "He follows his body everywhere, always attaining mastery at all times.",
        "source": "T10n0293_009:0702c16_49"
    },
    {
        "source_sentence": "而我云何能知、能說彼功德行？",
        "translation": "How can I know and explain their meritorious actions?",
        "source": "T10n0293_009:0702c17_50"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0702c18_51"
    },
    {
        "source_sentence": "於此南方，有一國土，名為三目。",
        "translation": "To the south of here, there's a land named Sanmu.",
        "source": "T10n0293_009:0702c18_52"
    },
    {
        "source_sentence": "彼有比丘，名曰妙見，汝詣彼問菩薩云何學菩薩行，修菩薩道。」",
        "translation": "There's a monk there named Marvelous Vision, so go to him and ask the bodhisattva how he trains in the bodhisattva practice and cultivates the bodhisattva path.",
        "source": "T10n0293_009:0702c19_53"
    },
    {
        "source_sentence": "時，善財童子，頂禮其足，遶無數匝，戀慕瞻仰，辭退南行。",
        "translation": "Then Sudhana paid his respects to the brahman, bowed his head at his feet, and withdrew.",
        "source": "T10n0293_009:0702c20_54"
    },
    {
        "source_sentence": "爾時，善財童子隨順思惟菩薩所住行甚深，思惟菩薩所證法界際甚深，",
        "translation": "At that time, Sudhana contemplated the boundlessness of the realm of reality realized by the bodhisattva Sarvagandhasugandhā.",
        "source": "T10n0293_009:0702c22_0"
    },
    {
        "source_sentence": "思惟菩薩眾生微細智甚深，思惟菩薩世間想行智甚深，思惟眾生無作性甚深，",
        "translation": "They contemplate the depth of knowledge of the subtleties of sentient beings of enlightening beings; they contemplate the depth of knowledge of worldly thoughts and actions of enlightening beings; they contemplate the depth of unconstructed",
        "source": "T10n0293_009:0702c23_1"
    },
    {
        "source_sentence": "思惟眾生心流注甚深，思惟諸法緣起際甚深，思惟眾生真實際甚深，思惟眾生如光影甚深，",
        "translation": "The thought of sentient beings’ mental flow is profound; the thought of the interdependent origination of all things is profound; the thought of sentient beings’ reality is profound; the thought of sentient beings as light and shadow is profound.",
        "source": "T10n0293_009:0702c25_2"
    },
    {
        "source_sentence": "思惟眾生名號差別際甚深，思惟眾生語言際甚深，思惟眾生莊嚴法甚深，",
        "translation": "They contemplate the depth of distinctions in names of sentient beings; they contemplate the depth of differences in speech of sentient beings; they contemplate the depth of adornment of principles of sentient beings.",
        "source": "T10n0293_009:0702c27_3"
    },
    {
        "source_sentence": "思惟眾生祕密際甚深，思惟眾生光明際甚深。",
        "translation": "He contemplates the depth of the mysterious realm of sentient beings, and he contemplates the depth of the light of sentient beings.",
        "source": "T10n0293_009:0702c29_4"
    },
    {
        "source_sentence": "漸次前行，至三目國，於彼城邑、市肆、廛里、山川、林藪、仙人住處，",
        "translation": "He proceeded gradually and reached the country of Sammu, where there were cities, markets,  marketplaces, villages, mountains, rivers, forests, and holy dwellings.",
        "source": "T10n0293_009:0703a01_5"
    },
    {
        "source_sentence": "周遍尋訪妙見比丘。",
        "translation": "He searched everywhere for the monk Marvelous Vision.",
        "source": "T10n0293_009:0703a02_6"
    },
    {
        "source_sentence": "忽然覩見在一林中經行往復，頭骨如蓋，頂有肉髻，殊勝端嚴，其眼脩廣如青蓮葉，",
        "translation": "Suddenly he suddenly saw that he was walking in a forest, his skull and bones like canopies, with a topknot of flesh on his head, extraordinarily imposing and dignified. His eyes were as wide as the blue lotus le",
        "source": "T10n0293_009:0703a03_7"
    },
    {
        "source_sentence": "鼻脩高直如挺真金，脣色丹潔如頻婆果，齒白齊密具足四十。",
        "translation": "Their noses are straight and high like pure gold, their lips are as white as the color of a vipaṇḍika fruit, and their teeth are white and evenly spaced, fully forty in number.",
        "source": "T10n0293_009:0703a05_8"
    },
    {
        "source_sentence": "頰如師子，頤頷充滿，眉高而長，額廣平正，毫相映徹，如白瑠璃，耳相垂埵，",
        "translation": "His cheeks were like a lion’s; his hair was white and shiny like lapis lazuli. His eyebrows were high and long, and his forehead was broad and evenly spaced. The characteristics of his hair reflected the",
        "source": "T10n0293_009:0703a06_9"
    },
    {
        "source_sentence": "如懸珠狀，面如滿月，見者無厭。",
        "translation": "It is shaped like a hanging pearl and its face is like the full moon. All who see it will not tire of it.",
        "source": "T10n0293_009:0703a08_10"
    },
    {
        "source_sentence": "頸項圓直，約文三道，胸標德相，妙藏莊嚴，臆如師子，肩膊傭圓，腰脇深細，",
        "translation": "The neck and neckline are round and straight, with the threefold patterns arranged accordingly. The chest is marked with a mark of virtue, adorned with sublime stores; it is shaped like a lion’s beak. The",
        "source": "T10n0293_009:0703a09_11"
    },
    {
        "source_sentence": "如金剛杵；",
        "translation": "It is like a vajra.",
        "source": "T10n0293_009:0703a10_12"
    },
    {
        "source_sentence": "臂肘傭直，立垂過膝，網縵指相，如白鵝王。",
        "translation": "Their arms, elbows, and kneels are straight, standing over their knees with the characteristic of webbed fingers like white geese.",
        "source": "T10n0293_009:0703a11_0"
    },
    {
        "source_sentence": "手足掌中，金剛輪相，柔軟細滑，如兜羅綿；",
        "translation": "In his hands, feet, and palms the shape of a diamond wheel is as soft and supple as cotton.",
        "source": "T10n0293_009:0703a12_0"
    },
    {
        "source_sentence": "伊尼鹿腨，七處平滿，手指纖長，足跟平圓。",
        "translation": "Aniruddha’s deerlike hair is evenly spread out in seven places. His fingers are slender and long, and his heels are even and round.",
        "source": "T10n0293_009:0703a12_1"
    },
    {
        "source_sentence": "皮膚金色，常光一尋，身毛上靡，一一右旋；",
        "translation": "Their skin was golden-colored, always shining as bright as a ray of light; the hair on their bodies stood straight up and curled to the right one by one.",
        "source": "T10n0293_009:0703a13_2"
    },
    {
        "source_sentence": "其身圓滿，如尼拘陀樹，相好嚴潔，猶如雪山王。",
        "translation": "His body was as large and full as a nyagrodha tree, with beautiful features as if he were the king of the Himalayas.",
        "source": "T10n0293_009:0703a14_3"
    },
    {
        "source_sentence": "諸根澄靜目視不瞬，於諸境界心無動亂；",
        "translation": "Their faculties are clear and still, their eyes don’t flinch when they see. They have no disturbing thoughts about objects.",
        "source": "T10n0293_009:0703a16_0"
    },
    {
        "source_sentence": "智慧深廣猶如大海，若沈、若舉、是智、非智，動轉戲論，一切咸息。",
        "translation": "The depth and breadth of wisdom are like the great ocean. Whether it is sunken or raised, whether it is cognition or non-cognisance, in all its movements and plays and discussions, everything ceases.",
        "source": "T10n0293_009:0703a17_0"
    },
    {
        "source_sentence": "得佛所行平等境界，入於緣起差別法門，成熟眾生心恒不倦。",
        "translation": "Attaining the equal sphere of what the Buddha does, he enters the differentiated dharma-gate of dependent arising, ripening sentient beings' minds without weariness.",
        "source": "T10n0293_009:0703a18_1"
    },
    {
        "source_sentence": "能生深廣圓滿大悲，教化示導心無暫捨。",
        "translation": "He's able to give rise to profound and extensive perfect great compassion, teaching and guiding his mind without momentarily abandoning it.",
        "source": "T10n0293_009:0703a19_2"
    },
    {
        "source_sentence": "為欲受持一切如來正法眼故，為欲普令一切眾生生智眼故，為於如來所行之道恒履踐故，",
        "translation": "Because they want to receive and uphold the eye of knowledge of all Buddhas, because they want to cause all sentient beings to develop the eye of knowledge, and because they always follow the path practiced by enlightened ones.",
        "source": "T10n0293_009:0703a20_3"
    },
    {
        "source_sentence": "不遲不速審諦經行。",
        "translation": "He doesn't slow down or quickly examine the sūtras and practices.",
        "source": "T10n0293_009:0703a23_0"
    },
    {
        "source_sentence": "寂靜端嚴，猶如滿月，威儀雍肅，如淨居天。",
        "translation": "They are tranquil and dignified, like the full moon. Their manner is as graceful and solemn as that of the gods in the Pure Land.",
        "source": "T10n0293_009:0703a23_1"
    },
    {
        "source_sentence": "無數天、龍、乾闥婆等釋梵護世，人及非人前後圍遶。",
        "translation": "Countless gods, dragons, gandharvas, and other Śākyamunis protect the world, surrounded by humans and non-humans before and after them.",
        "source": "T10n0293_009:0703a24_2"
    },
    {
        "source_sentence": "主方之神，隨方迴轉，引導其前；",
        "translation": "The directional spirits of the leaders traveled in all directions, guiding and leading them forward.",
        "source": "T10n0293_009:0703a25_3"
    },
    {
        "source_sentence": "足行諸神，持寶蓮華，隨捧其足；",
        "translation": "The footstep-following deities carried jeweled lotus blossoms, holding their feet.",
        "source": "T10n0293_009:0703a26_4"
    },
    {
        "source_sentence": "無盡光主火神執持寶炬，舒光照耀；",
        "translation": "The fire spirit Inexhaustible Light, holding a jeweled torch, emanated rays of light shining brightly.",
        "source": "T10n0293_009:0703a27_5"
    },
    {
        "source_sentence": "閻浮幢主林神恒雨眾妙拘蘇摩華；",
        "translation": "The forest spirit Banner of Jambudvfpa always rains down the flowers of all kinds of exquisite camphor.",
        "source": "T10n0293_009:0703a27_6"
    },
    {
        "source_sentence": "不動藏主地神隨現寶藏普光明主空神莊嚴虛空；",
        "translation": "The earth spirit Immutable Treasury follows the space spirit Universal Light of the Jewel Treasury, adorning space.",
        "source": "T10n0293_009:0703a28_7"
    },
    {
        "source_sentence": "妙吉祥主海神雨摩尼寶；",
        "translation": "It is the jewel of the ocean spirit Beautifully Auspicious, raining rain.",
        "source": "T10n0293_009:0703b01_0"
    },
    {
        "source_sentence": "須彌藏主山神合掌作禮；",
        "translation": "The mountain spirit Supreme Mountain Treasury paid homage with joined palms.",
        "source": "T10n0293_009:0703b01_1"
    },
    {
        "source_sentence": "無礙力主風神散眾香華；",
        "translation": "The wind of unobstructed power scatters all kinds of fragrant flowers.",
        "source": "T10n0293_009:0703b02_2"
    },
    {
        "source_sentence": "春和淑氣主夜神曲躬恭敬；",
        "translation": "The lord of the spring harmony and good energy, the night goddess, bends her head in reverence.",
        "source": "T10n0293_009:0703b02_3"
    },
    {
        "source_sentence": "常覺圓滿，主晝神持遍照十方摩尼寶幢，住虛空中放大光明。",
        "translation": "When the eternally awakened mind is complete, the lord of the day gods holds a maṇi-jeweled banner that universally illuminates the ten directions and stands in space to emanate great light.",
        "source": "T10n0293_009:0703b03_4"
    },
    {
        "source_sentence": "善財童子前詣其所，頭面禮足，合掌白言：「聖者！",
        "translation": "Sudhana went up to him, bowed his head at his feet, joined his palms, and said:",
        "source": "T10n0293_009:0703b04_5"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，復欲勤求諸菩薩道。",
        "translation": "I've already aroused the mind of unsurpassed, correct, and complete enlightenment, and I want to diligently pursue the bodhisattva path.",
        "source": "T10n0293_009:0703b05_6"
    },
    {
        "source_sentence": "我聞聖者，善能誘誨，願為我說菩薩云何學菩薩行，修菩薩道。」",
        "translation": "I've heard that the noble one is well able to guide and teach, so please tell me how an enlightening being is to learn the practice of enlightening beings and cultivate the path of enlightening beings.",
        "source": "T10n0293_009:0703b07_7"
    },
    {
        "source_sentence": "妙見答言：「善男子！",
        "translation": "Marvelous Vision replied, Good man!",
        "source": "T10n0293_009:0703b08_8"
    },
    {
        "source_sentence": "我年既少出家，又近我此生中，於三十八恒河沙數諸如來所，親近供養淨修梵行；",
        "translation": "As a young boy, I renounced the householder’s life. Also, in my birth as an adult, I attended buddhas as numerous as the number of grains of sand in thirty-eight Ganges Rivers and became intimate with them",
        "source": "T10n0293_009:0703b09_9"
    },
    {
        "source_sentence": "或有佛所一日一夜淨修梵行；",
        "translation": "“Some buddhas may spend a day and night cultivating pure religious practice in the presence of buddhas.",
        "source": "T10n0293_009:0703b11_0"
    },
    {
        "source_sentence": "或有佛所七日七夜淨修梵行；",
        "translation": "Sometimes there are buddhas who spend seven days and nights cultivating pure religious practice.",
        "source": "T10n0293_009:0703b11_1"
    },
    {
        "source_sentence": "或有佛所半月、一月；",
        "translation": "Or there may be a half-moon or a full moon at the Buddha’s place.",
        "source": "T10n0293_009:0703b12_2"
    },
    {
        "source_sentence": "一年、百年、千年、百千年、那由他年，乃至不可說不可說年。",
        "translation": "It's a year, a hundred years, a thousand years, a hundred thousand years, a billion years, or a trillion years, up to an untold number of years.",
        "source": "T10n0293_009:0703b12_3"
    },
    {
        "source_sentence": "或有佛所，經一小劫、或一中劫、或一大劫，乃至不可說不可說阿僧祇劫，",
        "translation": "“Sometimes there are buddha-places for one minor eon, sometimes an intermediate eon, sometimes a major eon, up to an incalculably long eon.",
        "source": "T10n0293_009:0703b14_4"
    },
    {
        "source_sentence": "親近供養淨修梵行，聽聞妙法，依教奉行，清淨莊嚴諸大誓願，證入諸佛甚深境界，",
        "translation": "They become intimate with offerings, purify religious practice, hear the sublime Teaching, and follow it; purely adorning their great vows, they realize entry into the profound realm of buddhahood.",
        "source": "T10n0293_009:0703b15_5"
    },
    {
        "source_sentence": "修集菩薩一切妙行，圓滿一切波羅蜜門。",
        "translation": "He cultivates all the marvelous practices of enlightening beings and fulfills all the gates of transcendence.",
        "source": "T10n0293_009:0703b17_6"
    },
    {
        "source_sentence": "亦見彼佛所成正覺、所現神通、所轉法輪、所現涅槃、所有遺教，乃至法盡各各差別，",
        "translation": "They also saw the buddhas’ attainments of enlightenment, their manifestations of mystic powers, the teachings they taught, the nirvanas they manifested, the teachings they preserved, and so on, up to the end of",
        "source": "T10n0293_009:0703b18_7"
    },
    {
        "source_sentence": "悉能受持無有雜亂。",
        "translation": "They can all receive and uphold it without confusion.",
        "source": "T10n0293_009:0703b20_8"
    },
    {
        "source_sentence": "亦知彼佛，以本所發大誓願力，普遍嚴淨諸佛國土；",
        "translation": "They also know that buddha, by the power of the great vow they had originally undertaken, universally adorned and purified all buddha-lands.",
        "source": "T10n0293_009:0703b21_9"
    },
    {
        "source_sentence": "以本所入諸三昧力，圓滿菩薩甚深妙行；",
        "translation": "By the power of the concentrations they had originally entered, they perfected the profound and subtle deeds of enlightening beings.",
        "source": "T10n0293_009:0703b22_10"
    },
    {
        "source_sentence": "以本所修普賢行力，清淨諸佛波羅蜜海。",
        "translation": "Because of the power of the practice of Samantabhadra cultivated in the past, he purified the ocean of the buddhas' perfections.",
        "source": "T10n0293_009:0703b23_11"
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "Again, good man!",
        "source": "T10n0293_009:0703b24_12"
    },
    {
        "source_sentence": "我常不離此經行處，一念中，一切十方皆悉現前，得淨妙智觀察了知無障礙故；",
        "translation": "In a single thought I manifest all the ten directions, attaining unobstructed knowledge of purity and subtlety.",
        "source": "T10n0293_009:0703b24_13"
    },
    {
        "source_sentence": "一念中一切世界皆悉現前，得速疾力，一念過不可說不可說世界無障礙故；",
        "translation": "In a single thought, all worlds are manifested, attaining the power of speed because in a single thought there are unobstructed untold worlds.",
        "source": "T10n0293_009:0703b26_14"
    },
    {
        "source_sentence": "一念中不可說不可說佛剎，皆悉現前，得普嚴淨成就菩薩願力故；",
        "translation": "In a single thought untold buddha-lands appear before them all, because of the power of vows of enlightening beings who attain Universal Adornment and Purity.",
        "source": "T10n0293_009:0703b28_15"
    },
    {
        "source_sentence": "一念中不可說不可說眾生差別行，皆悉現前，得滿足普賢教門海故；",
        "translation": "In a single thought untold numbers of different practices of sentient beings appear before them all, because they attain the fulfillment of the ocean of teachings of universal goodness.",
        "source": "T10n0293_009:0703b29_16"
    },
    {
        "source_sentence": "一念中不可說不可說佛清淨身，皆悉現前，得普親近成就普賢行願力故；",
        "translation": "In a single thought the pure bodies of untold buddhas are all manifested, by the power of the vow to become intimate with and develop practices of universal goodness.",
        "source": "T10n0293_009:0703c02_17"
    },
    {
        "source_sentence": "一念中不可說不可說佛剎極微塵數如來，皆悉現前，得柔軟心，供養承事一切如來願力故；",
        "translation": "In a single thought, as many buddhas as atoms in untold buddha-lands appear before them all, attaining gentleness of mind to honor and serve all buddhas by the power of their vows.",
        "source": "T10n0293_009:0703c04_0"
    },
    {
        "source_sentence": "一念中不可說不可說如來降注法雨入眾生心，皆悉現前，得了知阿僧祇法門，",
        "translation": "In a single thought untold buddhas pour down the rain of truth and enter sentient beings’ minds; they all appear before them, comprehending innumerable teachings.",
        "source": "T10n0293_009:0703c06_1"
    },
    {
        "source_sentence": "隨順陀羅尼願力故；",
        "translation": "It is due to the power of vows undertaken in accord with mental command.",
        "source": "T10n0293_009:0703c07_2"
    },
    {
        "source_sentence": "一念中不可說不可說菩薩行海，皆悉現前，得淨一切諸菩薩行，猶如帝網殊勝願力故；",
        "translation": "In a single thought untold oceans of practices of enlightening beings appear before them, purifying all the practices of enlightening beings, like the emperor’s net of great vows.",
        "source": "T10n0293_009:0703c08_3"
    },
    {
        "source_sentence": "一念中不可說不可說諸三昧海，皆悉現前，得於一三昧中，自在入出一切三昧願力故；",
        "translation": "In a single thought untold oceans of concentrations all appear before them, attaining in one concentration the power of vows to enter and emerge freely from all concentrations.",
        "source": "T10n0293_009:0703c10_4"
    },
    {
        "source_sentence": "一念中不可說不可說諸根海，皆悉現前，得了知諸根際，於一根中見一切根願力故；",
        "translation": "In a single thought untold oceans of faculties appear to them all, comprehending the bounds of their faculties: because in one atom they see the power of vows of all faculties.",
        "source": "T10n0293_009:0703c12_5"
    },
    {
        "source_sentence": "一念中不可說不可說時皆悉現前，得於一切時，轉正法輪，眾生界盡，",
        "translation": "In a single thought, at untold times, they all appear before them. At the moment of attaining enlightenment, they turn the wheel of the Teaching in all directions; sentient beings’ realms are exhausted.",
        "source": "T10n0293_009:0703c14_6"
    },
    {
        "source_sentence": "法輪無盡願力故；",
        "translation": "The wheel of teaching is inexhaustible because of the power of vows.",
        "source": "T10n0293_009:0703c15_7"
    },
    {
        "source_sentence": "一念中不可說不可說三世海皆悉現前，得了知一切世界中，三世分位智光明願力故。",
        "translation": "In a single thought, untold oceans of the three worlds of past, present, and future are all manifested, comprehending all worlds in all worlds because of the power of the vow of the light of knowledge of the states of the three worlds",
        "source": "T10n0293_009:0703c16_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0703c18_9"
    },
    {
        "source_sentence": "我唯知此菩薩隨順無盡燈解脫門，如諸菩薩摩訶薩，心行堅固，猶如金剛，",
        "translation": "“I only know that these enlightening beings follow the liberation door of the inexhaustible lamp, like great enlightening beings whose minds and actions are as firm as diamond.",
        "source": "T10n0293_009:0703c18_10"
    },
    {
        "source_sentence": "生如來家種族，真正成就不壞常住命根，常然智燈，無有盡滅。",
        "translation": "He's born in the family of the Tathāgata, who truly accomplishes the root of life that doesn't break down and always abides there, and he always remains the lamp of wisdom, which has no end or end.",
        "source": "T10n0293_009:0703c20_11"
    },
    {
        "source_sentence": "其身堅固，不可沮壞，普能示現如幻色身，形貌端嚴，世無倫匹。",
        "translation": "Their bodies are firm and indestructible, able to manifest all kinds of illusion-like bodies. Their appearance is incomparable in the world.",
        "source": "T10n0293_009:0703c21_12"
    },
    {
        "source_sentence": "隨眾生心，無量差別，如緣起法，轉變無盡，毒刃火災，所不能害。",
        "translation": "Depending on the minds of sentient beings, there are measureless distinctions, such as dependently arisen dharmas that change without end and can't be harmed by poisonous swords or fire.",
        "source": "T10n0293_009:0703c23_13"
    },
    {
        "source_sentence": "降魔兵眾，摧伏異道，身色妙好，如閻浮金，超過世間最勝無比。",
        "translation": "He subdued the armies of Māra and defeated the heretics. His physical form was as beautiful as that of Jambudvīpa’s gold, surpassing all worldly beauty without compare.",
        "source": "T10n0293_009:0703c24_14"
    },
    {
        "source_sentence": "放大光網，普照十方，若有見者，必破一切障礙大山，必拔一切不善根本，",
        "translation": "They emanate great webs of light, illumining the ten directions. If any see them, they will surely destroy all the great mountains that obstruct enlightenment and pull out the roots of all unwholesomeness.",
        "source": "T10n0293_009:0703c26_15"
    },
    {
        "source_sentence": "必種廣大殊勝善根。",
        "translation": "They must plant vast and superior good roots.",
        "source": "T10n0293_009:0703c27_16"
    },
    {
        "source_sentence": "如是之人，難可得見，難得出現，如優曇華。",
        "translation": "Such a person is difficult to see and difficult to appear, like the udumbara flower.",
        "source": "T10n0293_009:0703c28_17"
    },
    {
        "source_sentence": "而我云何能知、能說彼功德行？",
        "translation": "How can I know and explain their meritorious actions?",
        "source": "T10n0293_009:0703c29_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0704a01_0"
    },
    {
        "source_sentence": "於此南方，有一國土，名圓滿多聞，其中有城，名曰妙門，彼有童子，",
        "translation": "“South of here, in the land of Vaiśravaṇa, there is a city called Sudarśana.",
        "source": "T10n0293_009:0704a01_1"
    },
    {
        "source_sentence": "名根自在主。",
        "translation": "He's called the unimpeded master of faculties.",
        "source": "T10n0293_009:0704a02_2"
    },
    {
        "source_sentence": "汝詣彼問菩薩云何學菩薩行，修菩薩道。」",
        "translation": "Go there and ask the bodhisattva how to train in the bodhisattva practice and cultivate the bodhisattva path.",
        "source": "T10n0293_009:0704a03_3"
    },
    {
        "source_sentence": "時，善財童子為欲成滿諸菩薩行；",
        "translation": "Then Sudhana, wanting to fulfill the practice of enlightening beings, entered into the ocean of buddhas.",
        "source": "T10n0293_009:0704a04_0"
    },
    {
        "source_sentence": "欲修菩薩無盡功德；",
        "translation": "They want to cultivate the inexhaustible virtues of enlightening beings.",
        "source": "T10n0293_009:0704a04_1"
    },
    {
        "source_sentence": "欲被菩薩大誓願甲；",
        "translation": "They want to be armed with the great vows of enlightening beings.",
        "source": "T10n0293_009:0704a05_2"
    },
    {
        "source_sentence": "欲放菩薩大力光明；",
        "translation": "They want to radiate the great light of enlightening beings.",
        "source": "T10n0293_009:0704a05_3"
    },
    {
        "source_sentence": "欲成菩薩深信解力；",
        "translation": "They want to perfect the power of enlightening beings’ deep faith and understanding.",
        "source": "T10n0293_009:0704a06_4"
    },
    {
        "source_sentence": "欲起菩薩無量勝行。",
        "translation": "They want to give rise to the bodhisattva's immeasurable superior practice.",
        "source": "T10n0293_009:0704a06_5"
    },
    {
        "source_sentence": "於菩薩法，心無厭足，樂入一切菩薩功德，願常攝御一切眾生，欲超生死稠林曠野；",
        "translation": "Their minds are not satisfied with the teachings of enlightening beings, and they delight in all the virtues of enlightening beings. They vow to always take care of all sentient beings, wanting to transcend the wilderness of",
        "source": "T10n0293_009:0704a07_6"
    },
    {
        "source_sentence": "於善知識，常樂見聞，承事供養，心無厭倦；",
        "translation": "They always delight in seeing and hearing spiritual benefactors, serve and honoring them without weariness of mind.",
        "source": "T10n0293_009:0704a09_0"
    },
    {
        "source_sentence": "於無量法，心生尊重，頂禮妙見，遶無數匝，慇懃瞻仰，辭退而去。",
        "translation": "They paid respect to the immeasurable Dharma, bowed their heads in reverence, and venerated this marvelous sight. After circumambulating it countless times, they looked up at it with admiration, withdrew, and departed.",
        "source": "T10n0293_009:0704a09_1"
    },
    {
        "source_sentence": "◎◎爾時，善財童子受妙見比丘教已，憶持不忘，思惟修習，決定明了，",
        "translation": "At that time, having been instructed by the bhikṣu Sunetra, the boy Sudhana remembered what he had been taught and kept it in memory.",
        "source": "T10n0293_009:0704a11_2"
    },
    {
        "source_sentence": "於彼法門，隨順悟入。",
        "translation": "In that dharma-gate, they follow and awaken to it.",
        "source": "T10n0293_009:0704a13_3"
    },
    {
        "source_sentence": "天、龍、夜叉、乾闥婆等眷屬圍遶。",
        "translation": "They're surrounded by gods, dragons, yakṣas, gandharvas, and other retinues.",
        "source": "T10n0293_009:0704a14_4"
    },
    {
        "source_sentence": "漸次前行，向圓滿多聞國入妙門城，周遍推求根自在主童子。",
        "translation": "Going gradually and in order, they proceeded toward the perfect well-versed land and entered the marvelous city of gates, pervading it to search for the boy with unimpeded faculties.",
        "source": "T10n0293_009:0704a14_5"
    },
    {
        "source_sentence": "時，虛空中天龍神等，告善財言：「善男子！",
        "translation": "The gods, dragons, and so forth in space then addressed Sun Cai, saying, Good man!",
        "source": "T10n0293_009:0704a16_6"
    },
    {
        "source_sentence": "今此童子，在河渚上，與諸童子聚沙為戲。」",
        "translation": "Now, this boy is on a river island and playing with the children in a lump of sand.",
        "source": "T10n0293_009:0704a17_7"
    },
    {
        "source_sentence": "爾時，善財聞是語已，即詣其所，見彼童子，十千童子前後圍遶，聚沙為戲。",
        "translation": "Having heard these words, Sudhana went to the boy and saw him there. Ten thousand children surrounded him in front and behind him, gathered in the sand for play.",
        "source": "T10n0293_009:0704a18_8"
    },
    {
        "source_sentence": "見已，親近頂禮其足，遶無數匝，合掌前立，白言：「聖者！",
        "translation": "When he saw them, he bowed his head at their feet, circled them countless times, joined his palms and stood in front of them, and said, Sage!",
        "source": "T10n0293_009:0704a19_9"
    },
    {
        "source_sentence": "我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，修菩薩道；",
        "translation": "I have set my mind on unexcelled complete perfect enlightenment, but I do not know how an enlightening being is to learn and carry out the practice of enlightening beings.",
        "source": "T10n0293_009:0704a21_0"
    },
    {
        "source_sentence": "我聞聖者，善能誘誨，唯願慈哀，為我解說。」",
        "translation": "I've heard that the noble one is good at encouraging, so please have mercy and compassion and explain it for me.",
        "source": "T10n0293_009:0704a22_1"
    },
    {
        "source_sentence": "自在主言：「善男子！",
        "translation": "The lord of sovereignty said, Good man!",
        "source": "T10n0293_009:0704a23_2"
    },
    {
        "source_sentence": "我昔曾於文殊師利童子所，修學算、數、印、相等法，即得悟入一切工巧神通智門。",
        "translation": "Formerly, in the past, when I was studying with Manjushri, counting, calculating, mathematics, signs, and so forth, I attained enlightenment and entered all the doors of mystic knowledge of arts and",
        "source": "T10n0293_009:0704a24_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0704a25_4"
    },
    {
        "source_sentence": "我因此故，知諸世間所有聲論、內明、因明、醫方明等文字，算數、契印、取與種種智論，",
        "translation": "Because of this, I know all the theories of sound in the world, all the theories of internal luminescence, all the theories of causality, all the theories of healing, and so on, as well as all the theories of calculation",
        "source": "T10n0293_009:0704a26_5"
    },
    {
        "source_sentence": "亦知一切藥毒、蠱毒、和合銷解，亦能療治風癎、痟瘦、鬼魅所著，如是所有一切諸病。",
        "translation": "They also know all the medicines, poisons, addictive poisons, and combinations that can be relieved, and they can also treat all the illnesses such as wind, abscesses, thinness, and ghosts and demons that are",
        "source": "T10n0293_009:0704a28_0"
    },
    {
        "source_sentence": "亦能建立城邑、聚落，形勝所居市肆、廛里、園林、池沼、義堂、福舍、臺榭、樓觀、宮殿、屋宅、窓牖、門闥種種莊嚴；",
        "translation": "They can also build cities and villages, variously arrayed in the form of marketplaces, pavilions, parks, gardens, ponds, halls of doctrine, houses of blessedness, terraces, chambers, buildings",
        "source": "T10n0293_009:0704a29_1"
    },
    {
        "source_sentence": "亦善駕御駟馬車乘，鬪戰之法，安危進止，取捨勝負；",
        "translation": "They are also skilled in riding carriages, horse carts, and chariots drawn by oars. Their manner of fighting is peaceful and they advance and retreat to gain victory or lose defeat.",
        "source": "T10n0293_009:0704b03_2"
    },
    {
        "source_sentence": "亦善調鍊種種仙藥，幻術變化；",
        "translation": "He also skillfully cultivated various herbs of sagehood, magical incarnations and transformations.",
        "source": "T10n0293_009:0704b04_3"
    },
    {
        "source_sentence": "亦善營理田農商賈，種種諸業；",
        "translation": "They were also skilled in running ranching, farming, merchants’ shops, and various activities.",
        "source": "T10n0293_009:0704b05_4"
    },
    {
        "source_sentence": "亦善禮儀尊卑次序；",
        "translation": "They also observed proper etiquette, being in the order of superiority and inferiority.",
        "source": "T10n0293_009:0704b05_5"
    },
    {
        "source_sentence": "亦知眾生身相吉凶，業行善惡；",
        "translation": "They also know the physical characteristics of sentient beings, fortune and misfortune, good and evil in their actions.",
        "source": "T10n0293_009:0704b06_6"
    },
    {
        "source_sentence": "亦知眾生具足一切善、不善根；",
        "translation": "They also know that sentient beings are endowed with all roots of goodness and all roots of evil.",
        "source": "T10n0293_009:0704b07_0"
    },
    {
        "source_sentence": "亦知眾生善趣、惡趣種類差別。",
        "translation": "They also know the distinctions in the good destinies and bad destinies of sentient beings.",
        "source": "T10n0293_009:0704b07_1"
    },
    {
        "source_sentence": "亦善了知一切賢聖清淨業道，此人應得聲聞乘道，此人應得辟支佛道，",
        "translation": "He also well knows the paths of all good and noble deeds, so he should attain the path of the vehicle of śrāvakas. This man should attain the path of the pratyekabuddhas.",
        "source": "T10n0293_009:0704b08_2"
    },
    {
        "source_sentence": "此人應得菩薩乘道，此人應入如來智地，如是乃至真俗二諦，皆悉能知；",
        "translation": "These people should attain the path of enlightening beings, and these people should enter the sphere of knowledge of buddhas. They will be able to know all this up to the two noble truths of reality and secularism.",
        "source": "T10n0293_009:0704b10_3"
    },
    {
        "source_sentence": "亦知一切諸寂靜眾，軌儀法式，時非時食，應所不應，以自攝養而延壽命；",
        "translation": "They also know the ways and manners of life of all the assemblies in quiescence; they eat at proper times and not at right times, according to their capacities.",
        "source": "T10n0293_009:0704b11_4"
    },
    {
        "source_sentence": "亦知世俗治生方法，經理資產，出處貴賤；",
        "translation": "They also know the methods of worldly ways of governing living beings and how to manage their wealth. Wherever they may be, they are noble or humble.",
        "source": "T10n0293_009:0704b13_5"
    },
    {
        "source_sentence": "亦知自他過去受身中，有分位入胎、住胎經生差別；",
        "translation": "They also know that in the bodies of self and others received in the past, there is a distinction between beings who enter into the womb at different states and those who remain in the womb.",
        "source": "T10n0293_009:0704b14_6"
    },
    {
        "source_sentence": "亦知未來一切眾生，死此生彼，死彼生此，從彼處歿，還生於彼，從此處歿，",
        "translation": "They also know that all sentient beings of the future will die here and be born there, and after dying there they will be born here. From that place on, they’ll be reborn there; from that place on, they’ll be reborn again.",
        "source": "T10n0293_009:0704b15_7"
    },
    {
        "source_sentence": "還生於此；",
        "translation": "They will be reborn here.",
        "source": "T10n0293_009:0704b17_8"
    },
    {
        "source_sentence": "亦知過現一切諸佛差別法門，種種安布，教授教誡，調伏眾生，能令堅固，",
        "translation": "They also know the various teachings of all buddhas; they teach and instruct, tame sentient beings, and make them firm.",
        "source": "T10n0293_009:0704b17_9"
    },
    {
        "source_sentence": "隨順修持，越生死流，到涅槃岸，身心清淨，如鍊真金，光明普照，廣大成就。",
        "translation": "He follows and cultivates it, crosses the stream of birth and death, reaches the shore of nirvāṇa, his body and mind are pure like polished gold, shines everywhere, and is vastly accomplished.",
        "source": "T10n0293_009:0704b19_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0704b20_1"
    },
    {
        "source_sentence": "我復善知十八工巧，種種技術，并六十二眷屬明論，及內明等一切方法，",
        "translation": "“Furthermore, I am well versed in the eighteen kinds of arts and crafts, as well as in the sixty-two branches of enlightenment.",
        "source": "T10n0293_009:0704b20_2"
    },
    {
        "source_sentence": "治內煩惱。",
        "translation": "He treats internal afflictions.",
        "source": "T10n0293_009:0704b22_3"
    },
    {
        "source_sentence": "何等名為內身煩惱？",
        "translation": "What's called internal body afflictions?",
        "source": "T10n0293_009:0704b22_4"
    },
    {
        "source_sentence": "有四因緣：一、謂眼根攝受色境，二、由無始取著習氣，三、由彼識自性本性，",
        "translation": "There are four causes and conditions: 1. that is, the eye faculty embraces material objects; 2. because of beginningless grasping and clinging to habit energy; 3. because of the intrinsic nature of those consciousnesses.",
        "source": "T10n0293_009:0704b23_5"
    },
    {
        "source_sentence": "四、於色境作意。",
        "translation": "4. contemplation of form and objects.",
        "source": "T10n0293_009:0704b24_6"
    },
    {
        "source_sentence": "希望由此四種因緣力故，藏識轉變，識波浪生，譬如瀑流，相續不斷。",
        "translation": "Because of the power of these four kinds of causes and conditions, store consciousness evolves and waves of consciousness arise, like a stream that doesn't stop flowing continuously.",
        "source": "T10n0293_009:0704b25_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0704b26_8"
    },
    {
        "source_sentence": "如眼識起，一切根識，微塵毛孔俱時出生，亦復如是。",
        "translation": "Just as consciousness of the eye arises, so also all faculties and conscious constructs arise simultaneously at the same time:",
        "source": "T10n0293_009:0704b26_9"
    },
    {
        "source_sentence": "譬如明鏡，頓現眾像，諸識亦爾，或時頓現。",
        "translation": "Good man, this is analogous to a bright mirror that suddenly produces all kinds of images. So are the conscious constructs sometimes manifested at once.",
        "source": "T10n0293_009:0704b28_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T10n0293_009:0704b29_11"
    },
    {
        "source_sentence": "譬如猛風，吹大海水，波浪不停，由境界風，飄靜心海，起識波浪，相續不斷，",
        "translation": "It is like the case of a violent wind that blows on the surface of water in the great ocean. The waves do not stop blowing, and by virtue of the wind generated from the objective world it stirs up an ocean of consciousness without cease",
        "source": "T10n0293_009:0704b29_12"
    },
    {
        "source_sentence": "因緣相作，不相捨離，不一不異，如水與波，由業生相，深起繫縛。",
        "translation": "Like water and waves, the characteristics that arise due to action are deeply bound.",
        "source": "T10n0293_009:0704c01_13"
    },
    {
        "source_sentence": "不能了知，色等自性五識身轉，彼阿賴耶終不自言：我生七識，七識不言從賴耶生，",
        "translation": "They do not know that the specific natures of matter, etc., evolve within the five consciousnesses and their bodies. The Ārya never says to himself, “I give rise to seven conscious constructs”:",
        "source": "T10n0293_009:0704c03_14"
    },
    {
        "source_sentence": "但由自心執取境相，分別而生。",
        "translation": "They arise only by reason of their own mental attachment to objects and marks, which are discriminated.",
        "source": "T10n0293_009:0704c05_15"
    },
    {
        "source_sentence": "如是甚深阿賴耶識行相微細究竟邊際，唯諸如來住地菩薩之所通達，愚法聲聞及辟支佛、凡夫、外道悉不能知。」",
        "translation": "Such is the ultimate limit of the subtlety of the profound store consciousness and its defining characteristics, which only the Tathāgatas, bodhisattvas, and non-Buddhists who live in the stages can comprehend, and they",
        "source": "T10n0293_009:0704c06_16"
    },
    {
        "source_sentence": "◎大方廣佛華嚴經卷第九悉見法界一切如來從初發心、修菩薩行、成滿大願、具足功德、成等正覺、轉妙法輪，",
        "translation": "Dafangguang fo huayan jing, vol. 9: Seeing all the buddhas of the Dharma realm from the first arousal of mind, cultivating bodhisattva practices, fulfilling great vows, fully endowed with virtue,",
        "source": "T10n0293_009:0704c08_17"
    },
    {
        "source_sentence": "乃至示現入於涅槃。",
        "translation": "It's even shown to enter nirvāṇa.",
        "source": "T10n0293_009:0704c11_18"
    },
    {
        "source_sentence": "如是影像靡不皆現，如淨水中普見虛空日月星宿所有眾像，如此皆是慈行童女過去世中善根之力。",
        "translation": "Such images are all manifested, like the images of the sun, moon, stars, and constellations seen in the sky in pure water, which are all the powers of the good roots of the girl Maitreya's past lives.",
        "source": "T10n0293_009:0704c12_19"
    },
    {
        "source_sentence": "爾時，善財童子憶念所見諸佛之相，合掌瞻仰慈行童女。",
        "translation": "At that point, the boy of good fortune remembered the characteristics of the buddhas he saw, joined his palms and looked up to the girl Maitreya.",
        "source": "T10n0293_009:0704c14_20"
    }
]