[
    {
        "source_sentence": "大寶積經卷第九十",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 90",
        "source": "T11n0310_090:0514b10_0"
    },
    {
        "source_sentence": "大唐三藏菩提流志奉　詔譯",
        "translation": "translated by imperial edict of the Great Tang Tripitaka Master Bodhiruci奉",
        "source": "T11n0310_090:0514b12_0"
    },
    {
        "source_sentence": "優波離會第二十四",
        "translation": "Upāli Assembly No. 24",
        "source": "T11n0310_090:0514b13_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十人俱，",
        "translation": "Thus I have heard: One time, the Buddha was staying at Jeta’s Grove in Sāvatthī, Anāthapiṇḍika’s Park, accompanied by one thousand two hundred and fifty disciples.",
        "source": "T11n0310_090:0514b14_0"
    },
    {
        "source_sentence": "菩薩摩訶薩五十萬人。",
        "translation": "The bodhisattvas, mahāsattvas, and 500,000 people.",
        "source": "T11n0310_090:0514b15_1"
    },
    {
        "source_sentence": "爾時世尊如龍象王顧視觀察，告諸菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān looked around like a dragon elephant king and told the bodhisattvas, Good sons!",
        "source": "T11n0310_090:0514b16_2"
    },
    {
        "source_sentence": "汝等誰能於後末世護持正法，攝受如來百千萬億那由他阿僧祇劫所集阿耨多羅三藐三菩提法，",
        "translation": "Who among you will be able to preserve the true-dharma and receive the unexcelled, complete perfect enlightenment which has been collected by the Tathāgata for incalculable millions of eons?",
        "source": "T11n0310_090:0514b17_3"
    },
    {
        "source_sentence": "安住祕密種種方便成熟眾生？」",
        "translation": "Abiding in the esoteric, various ways to ripen sentient beings?",
        "source": "T11n0310_090:0514b19_4"
    },
    {
        "source_sentence": "爾時彌勒菩薩從座起，偏袒右肩右膝著地，合掌白言：「世尊！",
        "translation": "At that point, Maitreya rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms, and said, Bhagavān!",
        "source": "T11n0310_090:0514b20_5"
    },
    {
        "source_sentence": "我能堪任於後世時護持如來百千萬億那由他阿僧祇劫所集阿耨多羅三藐三菩提法。」",
        "translation": "I'll be able to safeguard the Tathāgata's unsurpassed, correct, and complete enlightenment dharmas accumulated over a hundred thousand million billion nayutas of incalculably long eons in later generations.",
        "source": "T11n0310_090:0514b22_0"
    },
    {
        "source_sentence": "師子慧菩薩曰：「我能堪任安住祕密種種方便成熟眾生。」",
        "translation": "Shizihui Bodhisattva said, I can skillfully abide in the esoteric and various methods to ripen sentient beings.",
        "source": "T11n0310_090:0514b24_0"
    },
    {
        "source_sentence": "無盡意菩薩曰：「我能堪任以廣大願度脫無盡諸眾生界。」",
        "translation": "The Bodhisattva of Inexhaustible intention said, I'm capable of liberating the inexhaustible realm of sentient beings with a vast vow.",
        "source": "T11n0310_090:0514b25_1"
    },
    {
        "source_sentence": "跋陀羅菩薩曰：「我能堪任令諸眾生得聞我名皆悉成熟無空過者。」",
        "translation": "Bhadra Bodhisattva said, I'm capable of causing sentient beings to hear my name and fully ripen it without any mistake.",
        "source": "T11n0310_090:0514b26_2"
    },
    {
        "source_sentence": "妙德菩薩曰：「我能堪任於諸眾生隨所願求悉令滿足。」",
        "translation": "The wonderfully virtuous bodhisattva said, I'm capable of satisfying all sentient beings according to their wishes.",
        "source": "T11n0310_090:0514b28_3"
    },
    {
        "source_sentence": "無畏菩薩曰：「我能堪任攝受無邊世界眾生而作饒益。」",
        "translation": "The fearless bodhisattva said, I'm capable of taking care of sentient beings in the boundless world and doing good for them.",
        "source": "T11n0310_090:0514b29_4"
    },
    {
        "source_sentence": "金剛菩薩曰：「我能堪任於惡趣中度諸眾生令得解脫。」",
        "translation": "The Vajra Bodhisattva said, I'm capable of liberating sentient beings in the bad destinies and enabling them to attain liberation.",
        "source": "T11n0310_090:0514c01_5"
    },
    {
        "source_sentence": "除障菩薩曰：「我能堪忍解脫眾生煩惱繫縛。」",
        "translation": "The Bodhisattva Removing Obstruction said, I can tolerate the afflictive bonds of sentient beings who are liberated from the afflictions.",
        "source": "T11n0310_090:0514c02_6"
    },
    {
        "source_sentence": "智幢菩薩曰：「我能堪任滅除眾生無明闇蔽。」",
        "translation": "The Wisdom Banner Bodhisattva said, I'm capable of extinguishing the ignorance and darkness of sentient beings.",
        "source": "T11n0310_090:0514c03_7"
    },
    {
        "source_sentence": "法幢菩薩曰：「我能堪忍常行法施度脫眾生。」",
        "translation": "The Dharma Banner Bodhisattva said, I can tolerate the constant practice of giving to save sentient beings by practicing the Dharma.",
        "source": "T11n0310_090:0514c04_8"
    },
    {
        "source_sentence": "日幢菩薩曰：「我能堪任恒以安樂成熟眾生。」",
        "translation": "The sun-banner bodhisattva said, I'm capable of constantly bringing peace and comfort to sentient beings.",
        "source": "T11n0310_090:0514c05_9"
    },
    {
        "source_sentence": "月幢菩薩曰：「我能堪忍以諸功德成熟眾生。」",
        "translation": "The moon-banner bodhisattva said, I can tolerate the ripening of sentient beings by virtue.",
        "source": "T11n0310_090:0514c06_10"
    },
    {
        "source_sentence": "善眼菩薩曰：「我能堪任與諸眾生自性安樂。」",
        "translation": "The good-eyed bodhisattva said, I'm capable of bringing peace and comfort to the self-nature of sentient beings.",
        "source": "T11n0310_090:0514c07_11"
    },
    {
        "source_sentence": "觀自在菩薩曰：「我能堪任於諸惡趣拔濟眾生。」",
        "translation": "The Avalokitêśvara Bodhisattva said, I'm capable of rescuing sentient beings from the bad destinies.",
        "source": "T11n0310_090:0514c08_12"
    },
    {
        "source_sentence": "得大勢菩薩曰：「我能堪任度諸惡趣未度眾生。」",
        "translation": "The Mahāprajñāpāramitā Bodhisattva said, I'm capable of liberating sentient beings from the bad destinies that have yet to be liberated.",
        "source": "T11n0310_090:0514c09_13"
    },
    {
        "source_sentence": "普賢菩薩曰：「我能堪忍令諸眾生憶念過去經歷受苦便得解脫。」",
        "translation": "Samantabhadra Bodhisattva said, I can tolerate the suffering that causes sentient beings to remember past experiences and then attain liberation.",
        "source": "T11n0310_090:0514c10_14"
    },
    {
        "source_sentence": "善數菩薩曰：「我能堪任調伏一切難調眾生。」",
        "translation": "The well-numbered bodhisattva said, I'm capable of taming all difficult sentient beings.",
        "source": "T11n0310_090:0514c12_15"
    },
    {
        "source_sentence": "妙意菩薩曰：「我能堪任樂小法者度令成熟。」",
        "translation": "The Marvelous intention bodhisattva said, I'm capable of bringing those who delight in the lesser Dharma to maturity.",
        "source": "T11n0310_090:0514c13_16"
    },
    {
        "source_sentence": "善順菩薩曰：「我能堪任成熟下劣少智眾生。」",
        "translation": "The well-subdued bodhisattva said, I'm capable of ripening sentient beings with little wisdom who are inferior.",
        "source": "T11n0310_090:0514c14_17"
    },
    {
        "source_sentence": "光積菩薩曰：「我能堪任拔濟墮於畜生趣者令得解脫。」",
        "translation": "Guangji Bodhisattva said, I can rescue those who fall into the animal rebirth and cause them to attain liberation.",
        "source": "T11n0310_090:0514c15_18"
    },
    {
        "source_sentence": "不思議菩薩曰：「我能堪任愍念成熟餓鬼眾生令得解脫。」",
        "translation": "The inconceivable bodhisattva said, I can tolerate compassion and ripen hungry ghosts and sentient beings to attain liberation.",
        "source": "T11n0310_090:0514c16_19"
    },
    {
        "source_sentence": "大威力菩薩曰：「我能堪任為諸眾生閉惡趣門。」",
        "translation": "The Mahāprajñāpāramitā Bodhisattva said, I'm capable of shutting the door to bad destinies for sentient beings.",
        "source": "T11n0310_090:0514c17_20"
    },
    {
        "source_sentence": "無諍論菩薩曰：「我能堪任為諸眾生示解脫道。」",
        "translation": "The non-arrogant bodhisattva said, I'm capable of showing the path to liberation for sentient beings.",
        "source": "T11n0310_090:0514c18_21"
    },
    {
        "source_sentence": "賢吉祥菩薩曰：「我能堪任究竟斷除眾生苦惱。」",
        "translation": "The good and auspicious bodhisattva said, I'm capable of ultimately ending the suffering and distress of sentient beings.",
        "source": "T11n0310_090:0514c20_0"
    },
    {
        "source_sentence": "月光菩薩曰：「我能堪任與諸眾生畢竟安樂。」",
        "translation": "Moonlight Bodhisattva said, I'm capable of bringing ultimate peace and comfort to sentient beings.",
        "source": "T11n0310_090:0514c21_1"
    },
    {
        "source_sentence": "日光菩薩曰：「我能堪任於諸眾生未純熟者令得成熟。」",
        "translation": "Sunlight Bodhisattva said, I'm capable of bringing sentient beings who haven't fully matured to maturity.",
        "source": "T11n0310_090:0514c22_2"
    },
    {
        "source_sentence": "無垢菩薩曰：「我能堪任令諸眾生所有志樂皆得圓滿。」",
        "translation": "The Vimalakīrti Bodhisattva said, I'm capable of causing all sentient beings to fulfill their aspirations.",
        "source": "T11n0310_090:0514c23_3"
    },
    {
        "source_sentence": "斷疑菩薩曰：「我能堪任度脫一切下劣眾生。」",
        "translation": "The Bodhisattva who had cut off doubt said, I'm capable of liberating all the inferior sentient beings.",
        "source": "T11n0310_090:0514c24_4"
    },
    {
        "source_sentence": "無畏菩薩曰：「我能堪任攝受眾生稱讚利益。」",
        "translation": "The fearless bodhisattva said, I'm capable of taking in sentient beings and praising their benefits.",
        "source": "T11n0310_090:0514c25_5"
    },
    {
        "source_sentence": "慧勝菩薩曰：「我能堪任隨順種種勝解眾生皆得成熟。」",
        "translation": "The Vaiśeṣika Bodhisattva said, I'm capable of following various kinds of resolute sentient beings to attain maturity.",
        "source": "T11n0310_090:0514c26_6"
    },
    {
        "source_sentence": "光明菩薩曰：「我能堪任恒以正勤拔濟眾生。」",
        "translation": "The Bodhisattva of Light said, I can skillfully and constantly rescue sentient beings with right effort.",
        "source": "T11n0310_090:0514c27_7"
    },
    {
        "source_sentence": "無量菩薩曰：「我能堪任為諸眾生於一切法示無為道。」",
        "translation": "The Immeasurable Bodhisattva said, I can skillfully show all sentient beings the path of nonexistence in all dharmas.",
        "source": "T11n0310_090:0514c28_8"
    },
    {
        "source_sentence": "無畏菩薩曰：「我能堪任隨諸眾生種種志樂皆能示現。」",
        "translation": "The fearless bodhisattva said, I'm capable of following the various aspirations of sentient beings and able to show them.",
        "source": "T11n0310_090:0515a01_0"
    },
    {
        "source_sentence": "寶勝菩薩曰：「我能堪任示諸眾生妙珍寶聚。」",
        "translation": "The Jeweled Supreme Bodhisattva said, I'm capable of showing sentient beings a collection of marvelous treasures.",
        "source": "T11n0310_090:0515a02_1"
    },
    {
        "source_sentence": "妙慧菩薩曰：「我能堪任令諸眾生見者歡喜皆得成熟。」",
        "translation": "The Bodhisattva of Marvelous Wisdom said, I'm capable of causing sentient beings who see me to rejoice and attain maturity.",
        "source": "T11n0310_090:0515a03_2"
    },
    {
        "source_sentence": "寶藏菩薩曰：「我能堪任度脫眾生離諸障礙。」",
        "translation": "The Jewel-Store Bodhisattva said, I'm capable of liberating sentient beings from the hindrances.",
        "source": "T11n0310_090:0515a04_3"
    },
    {
        "source_sentence": "寶賢菩薩曰：「我能堪任令諸眾生自識宿命皆得成就。」",
        "translation": "The Bhadrapāla Bodhisattva said, I'm capable of causing sentient beings to know for themselves the accomplishment of past lives.",
        "source": "T11n0310_090:0515a05_4"
    },
    {
        "source_sentence": "寶手菩薩曰：「我能堪任以諸珍寶惠施眾生令得安樂。」",
        "translation": "The Jewel-Armed Bodhisattva said, I'm capable of bestowing various treasures on sentient beings to make them attain well-being.",
        "source": "T11n0310_090:0515a06_5"
    },
    {
        "source_sentence": "勝意菩薩曰：「我能堪任令諸眾生永離貧窮。」",
        "translation": "The Vaiśeṣika Bodhisattva said, I'm capable of causing sentient beings to permanently part with poverty.",
        "source": "T11n0310_090:0515a07_6"
    },
    {
        "source_sentence": "喜見菩薩曰：「我能堪任施諸眾生一切樂具。」",
        "translation": "The joy-seeing bodhisattva said, I'm capable of giving all the comforts to sentient beings.",
        "source": "T11n0310_090:0515a08_7"
    },
    {
        "source_sentence": "金剛菩薩曰：「我能堪任為諸眾生開示正道。」",
        "translation": "The Vajra Bodhisattva said, I'm capable of teaching the right path for sentient beings.",
        "source": "T11n0310_090:0515a09_8"
    },
    {
        "source_sentence": "福相菩薩曰：「我能堪任悅可眾生令得度脫。」",
        "translation": "The Bodhisattva of Virtuous Characteristics said, I can satisfy and please sentient beings so that they'll attain liberation.",
        "source": "T11n0310_090:0515a10_9"
    },
    {
        "source_sentence": "法超菩薩曰：「我能堪任淨除眾垢而演說法。」",
        "translation": "Fa Chao Bodhisattva said, I'm capable of purifying and removing all the defilements and expounding the Dharma.",
        "source": "T11n0310_090:0515a11_10"
    },
    {
        "source_sentence": "無垢菩薩曰：「我能堪任愛護眾生悉令成熟。」",
        "translation": "The Immaculate Bodhisattva said, I'm capable of loving and protecting sentient beings and bringing them all to maturity.",
        "source": "T11n0310_090:0515a12_11"
    },
    {
        "source_sentence": "法現菩薩曰：「我能堪任常以正法度脫眾生。」",
        "translation": "The Dharma-manifest bodhisattva said, I'm capable of always liberating sentient beings with the right teaching.",
        "source": "T11n0310_090:0515a13_12"
    },
    {
        "source_sentence": "空寂菩薩曰：「我能堪任令諸眾生滅煩惱毒。」",
        "translation": "The bodhisattva of emptiness and quiescence said, I'm capable of causing sentient beings to cease the poison of affliction.",
        "source": "T11n0310_090:0515a14_13"
    },
    {
        "source_sentence": "月勝菩薩曰：「我能堪任為諸眾生示法方所。」",
        "translation": "The Vaiśravaṇa Bodhisattva said, I'm capable of showing the Dharma direction to sentient beings.",
        "source": "T11n0310_090:0515a15_14"
    },
    {
        "source_sentence": "師子意菩薩曰：「我能堪任常以法施利益眾生。」",
        "translation": "Siṃhala Bodhisattva said, I'm capable of always bestowing the Dharma for the benefit of sentient beings.",
        "source": "T11n0310_090:0515a16_15"
    },
    {
        "source_sentence": "童子光菩薩曰：「我能堪任從卑下處拔出眾生。」",
        "translation": "The Bodhisattva of Light of Children said, I'm capable of uprooting sentient beings from the lowest place.",
        "source": "T11n0310_090:0515a18_0"
    },
    {
        "source_sentence": "覺吉祥菩薩曰：「我能堪任開示正道閉惡趣門。」",
        "translation": "Auspicious Enlightenment Bodhisattva said, I can skillfully reveal the right path and close the door to bad destinies.",
        "source": "T11n0310_090:0515a19_1"
    },
    {
        "source_sentence": "金光菩薩曰：「我能堪任示現身相成熟眾生。」",
        "translation": "The bodhisattva of golden light said, I'm capable of showing my body to ripen sentient beings.",
        "source": "T11n0310_090:0515a20_2"
    },
    {
        "source_sentence": "吉祥菩薩曰：「我能堪任與諸眾生常作利益。」",
        "translation": "Auspicious Bodhisattva said, I'm capable of always doing good to sentient beings.",
        "source": "T11n0310_090:0515a21_3"
    },
    {
        "source_sentence": "持世菩薩曰：「我能堪任為諸眾生閉地獄門。」",
        "translation": "The world-holding bodhisattva said, I'm capable of shutting the gates of hell for sentient beings.",
        "source": "T11n0310_090:0515a22_4"
    },
    {
        "source_sentence": "甘露菩薩曰：「我能堪任令諸眾生超度生死。」",
        "translation": "The ambrosia bodhisattva said, I'm capable of causing sentient beings to transcend birth and death.",
        "source": "T11n0310_090:0515a23_5"
    },
    {
        "source_sentence": "網明童子曰：「我能堪任於後末世為諸眾生示現光明滅除煩惱。」",
        "translation": "The boy Net of Light said, I'm capable of showing sentient beings the light and extinguishing afflictions in later generations.",
        "source": "T11n0310_090:0515a24_6"
    },
    {
        "source_sentence": "爾時舍利弗聞諸菩薩作如是等勇猛弘誓成熟眾生，歎未曾有，白佛言：「希有世尊！",
        "translation": "When Śāriputra heard that the bodhisattvas had made such a courageous vow to ripen sentient beings, he praised it as unprecedented and said to the Buddha, Rarely, Bhagavān!",
        "source": "T11n0310_090:0515a26_0"
    },
    {
        "source_sentence": "此諸菩薩摩訶薩不可思議，具足大悲方便善巧，勇猛精進而自莊嚴，一切眾生無能測量、不可沮壞，",
        "translation": "“These great enlightening beings are inconceivable. Endowed with great compassion and skill in means, they adorn themselves with heroic energy; all sentient beings cannot measure or break them down.",
        "source": "T11n0310_090:0515a27_1"
    },
    {
        "source_sentence": "所有光明無能障蔽。",
        "translation": "All the light that exists is unable to obstruct it.",
        "source": "T11n0310_090:0515b01_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0515b01_3"
    },
    {
        "source_sentence": "我當稱讚是諸菩薩未曾有事。",
        "translation": "I will praise this as an unprecedented event for all the bodhisattvas.",
        "source": "T11n0310_090:0515b01_4"
    },
    {
        "source_sentence": "所謂堪任有來求索頭目耳鼻身體手足，一切諸物無所悋惜。",
        "translation": "It's called allowing someone to ask for a head, eyes, ears, ears, nose, body, hands, and feet, and all things they don't cherish.",
        "source": "T11n0310_090:0515b02_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0515b04_0"
    },
    {
        "source_sentence": "我常思惟，若有人能逼迫如是諸菩薩等，從其求索若內若外一切財物心無怯弱，",
        "translation": "I always think: If someone were to oppress such bodhisattvas and so forth, they would not be faint-hearted in seeking all their property, whether internal or external.",
        "source": "T11n0310_090:0515b04_1"
    },
    {
        "source_sentence": "當知皆是不可思議解脫菩薩。」",
        "translation": "You should know that they're all bodhisattvas of inconceivable liberation.",
        "source": "T11n0310_090:0515b06_0"
    },
    {
        "source_sentence": "佛言：「舍利弗！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T11n0310_090:0515b06_1"
    },
    {
        "source_sentence": "如是如是，如汝所言。",
        "translation": "So it is, so it is, just as you say.",
        "source": "T11n0310_090:0515b07_0"
    },
    {
        "source_sentence": "是諸菩薩智慧方便三昧境界，一切聲聞及辟支佛所不能知。",
        "translation": "These are the realms of the bodhisattvas' wisdom, skillful means, and samādhi that all śrāvakas and pratyekbuddhas can't know.",
        "source": "T11n0310_090:0515b07_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T11n0310_090:0515b08_2"
    },
    {
        "source_sentence": "此諸菩薩摩訶薩能現諸佛神通變化，滿足眾生諸所欲樂，而於諸法心無所動。",
        "translation": "These bodhisattvas and mahāsattvas can manifest the buddhas' miraculous transformations, fulfill the desires and pleasures of sentient beings, and their minds don't move in regard to dharmas.",
        "source": "T11n0310_090:0515b09_3"
    },
    {
        "source_sentence": "若有眾生樂為居士憍慢放逸，菩薩爾時為成熟故，現大居士威德之身而為說法。",
        "translation": "If there are sentient beings who delight in being arrogant and lazy for the sake of the householder, the bodhisattva then manifests the authoritative body of the great householder to teach the Dharma for them because he's ripened.",
        "source": "T11n0310_090:0515b10_4"
    },
    {
        "source_sentence": "若有眾生恃大勢力而自憍慢，菩薩爾時為調伏故，現那羅延大力之身而為說法。",
        "translation": "If there are sentient beings who rely on great power and become conceited, the bodhisattva then manifests Nārayana's powerful body to teach the Dharma for them in order to subdue them.",
        "source": "T11n0310_090:0515b12_5"
    },
    {
        "source_sentence": "若有眾生志求涅槃，菩薩爾時為度脫故，現聲聞身而為說法。",
        "translation": "If there are sentient beings who aspire to nirvāṇa, the bodhisattva then manifests the body of a śrāvaka in order to liberate them and explains the Dharma for them.",
        "source": "T11n0310_090:0515b14_6"
    },
    {
        "source_sentence": "若有眾生樂觀緣起，菩薩爾時為度脫故，現緣覺身而為說法。",
        "translation": "If there are sentient beings who delight in observing dependent arising, the bodhisattva then manifests the body of pratyekabuddha and teaches the Dharma for them because he wants to liberate them.",
        "source": "T11n0310_090:0515b16_7"
    },
    {
        "source_sentence": "若有眾生志求菩提，菩薩爾時為度脫故，即現佛身令入佛智。",
        "translation": "If there are sentient beings who aspire to enlightenment, the bodhisattva then manifests the Buddha's body and causes them to enter buddhahood for the sake of liberation.",
        "source": "T11n0310_090:0515b17_8"
    },
    {
        "source_sentence": "如是舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T11n0310_090:0515b18_9"
    },
    {
        "source_sentence": "是諸菩薩種種方便成就眾生，悉令安住於佛法中。",
        "translation": "These bodhisattvas skillfully accomplish sentient beings in various ways to make them all abide in the Buddha's teaching.",
        "source": "T11n0310_090:0515b19_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_090:0515b20_11"
    },
    {
        "source_sentence": "唯有如來智慧解脫究竟涅槃，更無餘乘而得度脫，以是義故名為如來。",
        "translation": "Only the Tathagata' s wisdom and liberation from obstacles can lead to final nirvalJa. There is no other vehicle by which one can attain liberation. Because of this meaning, it is called a tathagata.",
        "source": "T11n0310_090:0515b20_12"
    },
    {
        "source_sentence": "如來如實覺了如故，名為如來。",
        "translation": "The Tathāgata truly perceives thusness as it is, which is called the Tathāgata.",
        "source": "T11n0310_090:0515b22_13"
    },
    {
        "source_sentence": "知諸眾生種種欲樂，悉能示現，故名如來。",
        "translation": "Knowing the various desires and pleasures of sentient beings, he's able to show them all, so he's called a tathāgata.",
        "source": "T11n0310_090:0515b23_0"
    },
    {
        "source_sentence": "成就一切善法根本，斷於一切不善根本，故名如來。",
        "translation": "He accomplishes the root of all good qualities and stops all unwholesome roots, which is why he's called the Tathāgata.",
        "source": "T11n0310_090:0515b23_1"
    },
    {
        "source_sentence": "能示眾生解脫之道，故名如來。",
        "translation": "It's called the Tathāgata because he can show sentient beings the path to liberation.",
        "source": "T11n0310_090:0515b25_2"
    },
    {
        "source_sentence": "能令眾生遠離邪道住於正道，故名如來。",
        "translation": "It's called the Tathāgata because he can cause sentient beings to part with wrong paths and abide in the right path.",
        "source": "T11n0310_090:0515b25_3"
    },
    {
        "source_sentence": "演說諸法真實空義，故名如來。",
        "translation": "He explains the true meaning of emptiness of all dharmas, so he's called the Tathāgata.",
        "source": "T11n0310_090:0515b26_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T11n0310_090:0515b27_5"
    },
    {
        "source_sentence": "菩薩如是知諸眾生種種志樂，隨應說法令得解脫。",
        "translation": "Thus do bodhisattvas know the various aspirations of sentient beings and follow the appropriate instructions to attain liberation.",
        "source": "T11n0310_090:0515b27_6"
    },
    {
        "source_sentence": "為諸愚夫開示實智，不動法界能現種種幻化莊嚴，令諸眾生次第當得趣涅槃岸。",
        "translation": "In order to reveal true knowledge to foolish people, the immutable Dharma realm can manifest various illusory adornments that will cause sentient beings to gradually attain the shore of nirvāṇa.",
        "source": "T11n0310_090:0515b28_7"
    },
    {
        "source_sentence": "「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_090:0515c02_0"
    },
    {
        "source_sentence": "在家菩薩住於慈愍不惱害心，應修二施。",
        "translation": "Laymen bodhisattvas who abide in compassion and don't harm others should cultivate two kinds of generosity.",
        "source": "T11n0310_090:0515c02_1"
    },
    {
        "source_sentence": "何者為二？",
        "translation": "What are these two?",
        "source": "T11n0310_090:0515c03_2"
    },
    {
        "source_sentence": "一者法施，二者財施。",
        "translation": "One is giving the Dharma, and the other is giving financially.",
        "source": "T11n0310_090:0515c03_3"
    },
    {
        "source_sentence": "出家菩薩應修四施。",
        "translation": "A renunciant bodhisattva should cultivate four kinds of generosity.",
        "source": "T11n0310_090:0515c04_0"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0310_090:0515c04_1"
    },
    {
        "source_sentence": "一者筆施，二者墨施，三者經本施，四者說法施。",
        "translation": "One is to give with a pen, two are to give with ink, three are to give with the scriptures and texts, and four are to give teaching the Dharma.",
        "source": "T11n0310_090:0515c04_2"
    },
    {
        "source_sentence": "無生法忍菩薩應住三施。",
        "translation": "The bodhisattva who forbears the nonarising of dharmas should abide in three kinds of generosity.",
        "source": "T11n0310_090:0515c05_3"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T11n0310_090:0515c06_4"
    },
    {
        "source_sentence": "所謂王位布施，妻子布施，頭目支分悉皆布施。",
        "translation": "The so-called king's throne is given, his wife is given, and all the parts of his head and eyes are given.",
        "source": "T11n0310_090:0515c06_5"
    },
    {
        "source_sentence": "如是施者名為大施，名極妙施。」",
        "translation": "Such a gift is called a great gift, and it's called an extremely wonderful gift.",
        "source": "T11n0310_090:0515c07_6"
    },
    {
        "source_sentence": "舍利弗白佛言：「世尊！",
        "translation": "Śāriputra said to the Buddha, Bhagavān!",
        "source": "T11n0310_090:0515c08_7"
    },
    {
        "source_sentence": "是諸菩薩於貪瞋癡不怖畏耶？」",
        "translation": "Are these bodhisattvas not afraid of craving, anger, and delusion?",
        "source": "T11n0310_090:0515c09_8"
    },
    {
        "source_sentence": "佛言：「舍利弗！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T11n0310_090:0515c09_9"
    },
    {
        "source_sentence": "一切菩薩有二犯戒。",
        "translation": "All bodhisattvas have two ways to violate the precepts.",
        "source": "T11n0310_090:0515c10_10"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T11n0310_090:0515c10_11"
    },
    {
        "source_sentence": "一者瞋相應犯，二者癡相應犯。",
        "translation": "One is a violation associated with anger, and the other with delusion.",
        "source": "T11n0310_090:0515c10_12"
    },
    {
        "source_sentence": "如是二犯，名大破戒。",
        "translation": "Such two offenses are called major violations of the precepts.",
        "source": "T11n0310_090:0515c11_13"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T11n0310_090:0515c12_14"
    },
    {
        "source_sentence": "因貪犯者，為過微細難可捨離。",
        "translation": "A person who violates the precepts because of craving is guilty of a minor offense that's difficult to abandon.",
        "source": "T11n0310_090:0515c12_15"
    },
    {
        "source_sentence": "因瞋犯者，為過麁重易可捨離。",
        "translation": "A person who commits an offense because of anger is easily and quickly abandoned for the sake of a serious offense.",
        "source": "T11n0310_090:0515c13_0"
    },
    {
        "source_sentence": "因癡犯者，為過深重復難捨離。",
        "translation": "A person who commits a transgression because of delusion is again overwhelmed by the depth of his faults and difficult to abandon.",
        "source": "T11n0310_090:0515c13_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_090:0515c14_2"
    },
    {
        "source_sentence": "貪結能為諸有種子，生死蔓莚連持不絕，以是義故微細難斷。",
        "translation": "The fetter of craving can act as the seed for all existences, and birth-and-death spreads and holds it together without stopping; because of this meaning, it's subtle and difficult to cut.",
        "source": "T11n0310_090:0515c14_3"
    },
    {
        "source_sentence": "因瞋犯者，墮於惡趣可速除斷。",
        "translation": "A person who commits an offense because of anger will fall into a bad destiny that can be quickly removed.",
        "source": "T11n0310_090:0515c16_4"
    },
    {
        "source_sentence": "因癡犯者，當墮八種大地獄中難可解脫。",
        "translation": "A person who violates it because of delusion will fall into the eight kinds of great hells that are difficult to liberate.",
        "source": "T11n0310_090:0515c16_5"
    },
    {
        "source_sentence": "「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_090:0515c18_0"
    },
    {
        "source_sentence": "若有菩薩犯波羅夷者，應對清淨十比丘前，以質直心殷重懺悔。",
        "translation": "If there are bodhisattvas who commit a pārājika, they should face the pure ten monks and repent with sincerity and earnestness in front of them.",
        "source": "T11n0310_090:0515c18_1"
    },
    {
        "source_sentence": "犯僧殘者，對五淨僧殷重懺悔。",
        "translation": "Those who violate the saṃgha's cruelty should repent to the five pure monks.",
        "source": "T11n0310_090:0515c19_2"
    },
    {
        "source_sentence": "若為女人染心所觸，及因相顧而生愛著，應對一二清淨僧前殷重懺悔。",
        "translation": "If someone is touched by a woman with a defiled mind and becomes attached because they look at each other, they should earnestly repent in front of one or two pure monks.",
        "source": "T11n0310_090:0515c20_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T11n0310_090:0515c22_4"
    },
    {
        "source_sentence": "若諸菩薩成就五無間罪，犯波羅夷、或犯僧殘戒、犯塔、犯僧及犯餘罪，",
        "translation": "If bodhisattvas commit the five kinds of unremitting crimes, they'll violate the pārājika, violate the saṃgha precepts, violate the stūpa, violate the saṃgha, and commit other crimes",
        "source": "T11n0310_090:0515c22_5"
    },
    {
        "source_sentence": "菩薩應當於三十五佛前，晝夜獨處殷重懺悔。",
        "translation": "A bodhisattva should diligently repent in front of the thirty-five buddhas and spend the day and night alone in solitary retreat.",
        "source": "T11n0310_090:0515c24_0"
    },
    {
        "source_sentence": "應自稱云：『我某甲。",
        "translation": "You should call yourself, 'I, Mr. A.",
        "source": "T11n0310_090:0515c25_1"
    },
    {
        "source_sentence": "歸依佛、歸依法、歸依僧。",
        "translation": "They take refuge in the Buddha, the Dharma, and the saṃgha.",
        "source": "T11n0310_090:0515c25_2"
    },
    {
        "source_sentence": "「『南無釋迦牟尼佛　南無金剛不壞佛　南無寶光佛　南無龍尊王佛　南無精進軍佛　南無精進喜佛　南無寶火佛　南無寶月光佛　南無現無愚佛　南無寶月佛　南無無垢佛　南無離垢佛　南無勇施佛　南無清淨佛　南無清淨施佛　南無娑留那佛　南無水天佛　南無堅德佛　南無栴檀功德佛　南無無量掬光佛　南無光德佛　南無無憂德佛　南無那羅延佛　南無功德花佛　南無蓮花光遊戲神通佛　南無財功德佛　南無德念佛　南無善名稱功德佛　南無紅炎帝幢王佛　南無善遊步功德佛　南無鬪戰勝佛　南無善遊步佛　南無周匝莊嚴功德佛　南無寶花遊步佛　南無寶蓮花善住娑羅樹王佛「『如是等一切世界諸佛世尊常住在世，",
        "translation": "「『南無釋迦牟尼佛 南無金剛不壞佛 南無寶光佛 南無龍尊王佛 南無精進軍佛 南無精進喜佛 南無寶火佛 南無寶月光佛",
        "source": "T11n0310_090:0515c27_0"
    },
    {
        "source_sentence": "是諸世尊當慈念我。",
        "translation": "Bhagavān, these world-honored ones will be compassionate to me.",
        "source": "T11n0310_090:0516a13_1"
    },
    {
        "source_sentence": "若我此生、若我前生，從無始生死已來所作眾罪，若自作、若教他作、見作隨喜；",
        "translation": "The sins that are committed by me in this lifetime and the sins committed by me in a previous lifetime, from beginningless time since birth and death, are to be done oneself, taught to be done by others, or seen to be done with satisfaction.",
        "source": "T11n0310_090:0516a14_2"
    },
    {
        "source_sentence": "若塔、若僧、若四方僧物，若自取、若教他取、見取隨喜；",
        "translation": "If they take the things of a tower, of a samgha, or of the saṃgha of the four directions, they are taken for themselves, taught others to take them, and delighted in taking what they see.",
        "source": "T11n0310_090:0516a16_3"
    },
    {
        "source_sentence": "五無間罪，若自作、若教他作、見作隨喜；",
        "translation": "The fifth is an unremitting blameworthiness, either doing it oneself, or teaching others to do it, or rejoicing in what one has seen.",
        "source": "T11n0310_090:0516a17_4"
    },
    {
        "source_sentence": "十不善道，若自作、若教他作、見作隨喜；",
        "translation": "The ten unwholesome paths are self-manifesting, teaching others to manifest and delighting in what they see.",
        "source": "T11n0310_090:0516a18_5"
    },
    {
        "source_sentence": "所作罪障，或有覆藏、或不覆藏，應墮地獄、餓鬼、畜生、諸餘惡趣、邊地下賤及蔑戾車；",
        "translation": "If the sins they commit are obstacles, whether covered or uncovered, they should fall into hell, hungry ghosts, animals, other evil destinies, marginal and inferior beings, and chariots of contempt.",
        "source": "T11n0310_090:0516a19_6"
    },
    {
        "source_sentence": "如是等處所作罪障，今皆懺悔。",
        "translation": "The sins and hindrances created in such places are now all repented of.",
        "source": "T11n0310_090:0516a20_7"
    },
    {
        "source_sentence": "「『今諸佛世尊當證知我、當憶念我。",
        "translation": "'Now, Bhagavān, the buddhas will realize me and remember me.",
        "source": "T11n0310_090:0516a22_0"
    },
    {
        "source_sentence": "我復於諸佛世尊前作如是言：「若我此生、若於餘生，曾行布施、或守淨戒，",
        "translation": "Again, I made this statement before the buddhas and world-honored ones: If in this life or in any other life I have practiced generosity or observed pure morality,",
        "source": "T11n0310_090:0516a22_1"
    },
    {
        "source_sentence": "乃至施與畜生一摶之食，或修淨行所有善根，成就眾生所有善根，修行菩提所有善根，",
        "translation": "They may give an animal a mouthful of food or cultivate the roots of goodness of pure practice, develop the roots of goodness of sentient beings, and practice the roots of goodness of enlightenment.",
        "source": "T11n0310_090:0516a24_2"
    },
    {
        "source_sentence": "及無上智所有善根，一切合集校計籌量，皆悉迴向阿耨多羅三藐三菩提。",
        "translation": "All the good roots of unsurpassed wisdom and all the good roots, which are collected, calculated, and measured, are all returned to unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_090:0516a26_3"
    },
    {
        "source_sentence": "如過去未來現在諸佛所作迴向，我亦如是迴向。」",
        "translation": "Just as the past, future, and present buddhas made dedication of merit, so will I make such dedication.",
        "source": "T11n0310_090:0516a28_4"
    },
    {
        "source_sentence": "「『眾罪皆懺悔，　　諸福盡隨喜，",
        "translation": "'All sins are repented, and all merits are ended with joy.",
        "source": "T11n0310_090:0516b01_0"
    },
    {
        "source_sentence": "　　及請佛功德，　　願成無上智。",
        "translation": "He asks for the merit of the Buddha and wishes to attain unsurpassed knowledge.",
        "source": "T11n0310_090:0516b02_0"
    },
    {
        "source_sentence": "　　去來現在佛，　　於眾生最勝，",
        "translation": "The buddhas of past, future, and present Are the best Of all sentient beings.",
        "source": "T11n0310_090:0516b03_0"
    },
    {
        "source_sentence": "　　無量功德海，　　我今歸命禮。』",
        "translation": "Immeasurable is the ocean of merit, so now I'll pay homage to it.'",
        "source": "T11n0310_090:0516b04_0"
    },
    {
        "source_sentence": "「如是舍利弗！",
        "translation": "So, Śāriputra!",
        "source": "T11n0310_090:0516b05_0"
    },
    {
        "source_sentence": "菩薩應當一心觀此三十五佛而為上首，復應頂禮一切如來，應作如是清淨懺悔。",
        "translation": "Bodhisattvas should singlemindedly contemplate these thirty-five buddhas as their heads, and they should also pay homage to all the tathāgatas and make this kind of pure repentance.",
        "source": "T11n0310_090:0516b05_1"
    },
    {
        "source_sentence": "菩薩若能滅除此罪，爾時諸佛即現其身，為度一切諸眾生故，示現如是種種之相，",
        "translation": "If the bodhisattva can extinguish these sins, then the buddhas will manifest their bodies. In order to liberate all sentient beings they show various forms like this:",
        "source": "T11n0310_090:0516b07_2"
    },
    {
        "source_sentence": "而於法界亦無所動，隨諸眾生種種樂欲，悉令圓滿皆得解脫。",
        "translation": "Nor does anything move in the realm of reality, and he follows the various pleasures and desires of sentient beings, causing them all to be fulfilled and attain liberation.",
        "source": "T11n0310_090:0516b09_3"
    },
    {
        "source_sentence": "復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_090:0516b10_4"
    },
    {
        "source_sentence": "菩薩若入大悲三昧，則能示現地獄、畜生、閻魔羅界成熟眾生。",
        "translation": "If a bodhisattva enters the concentration of great compassion, he'll be able to show sentient beings in the hells, animals, and Jambudvīpa realms on the ground how to mature them.",
        "source": "T11n0310_090:0516b10_5"
    },
    {
        "source_sentence": "菩薩若入大莊嚴三昧，則能示現長者之身成熟眾生。",
        "translation": "If a bodhisattva enters the great adornment samādhi, then he can show the elder's body to ripen sentient beings.",
        "source": "T11n0310_090:0516b12_6"
    },
    {
        "source_sentence": "若入殊勝三昧，則能示現轉輪王身成熟眾生。",
        "translation": "If someone enters this extraordinary concentration, they'll be able to show the body of the wheel-turning king and ripen sentient beings.",
        "source": "T11n0310_090:0516b13_7"
    },
    {
        "source_sentence": "若入熾然威光三昧，則能示現帝釋梵王殊妙色身成熟眾生。",
        "translation": "If someone enters the blazing, majestic samādhi, they'll be able to show Indra and Brahmā a marvelous form body that ripens sentient beings.",
        "source": "T11n0310_090:0516b14_8"
    },
    {
        "source_sentence": "菩薩若入一向三昧，則能示現聲聞之身成熟眾生。",
        "translation": "If a bodhisattva enters the one-pointed concentration, then he can show the body of a śrāvaka and ripen sentient beings.",
        "source": "T11n0310_090:0516b15_9"
    },
    {
        "source_sentence": "菩薩若入清淨三昧，則能示現辟支佛身成熟眾生。",
        "translation": "If a bodhisattva enters pure samādhi, then he can show the body of a pratyekabuddha to ripen sentient beings.",
        "source": "T11n0310_090:0516b17_10"
    },
    {
        "source_sentence": "菩薩若入寂靜三昧，則能示現諸佛色身成熟眾生。",
        "translation": "If a bodhisattva enters the samādhi of quiescence, he'll be able to show the form body of the buddhas and ripen sentient beings.",
        "source": "T11n0310_090:0516b18_11"
    },
    {
        "source_sentence": "菩薩如是入一切法自在三昧，隨其志樂現種種身成熟眾生，或現帝釋身、或現梵王身、或現轉輪聖王身，",
        "translation": "“Thus do enlightening beings enter the concentration unimpeded in all truths, manifesting various bodies to develop sentient beings according to their wishes, sometimes manifesting the form of Indra, sometimes the form of Brahma, sometimes the form of universal",
        "source": "T11n0310_090:0516b19_12"
    },
    {
        "source_sentence": "皆為成熟諸眾生故，而於法界亦無所動。",
        "translation": "They all want to ripen sentient beings, yet they don't move anything in the Dharma realm.",
        "source": "T11n0310_090:0516b21_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_090:0516b22_14"
    },
    {
        "source_sentence": "菩薩雖復隨順眾生種種示現，不見身相及生相無所得故。",
        "translation": "Although bodhisattvas also follow the various manifestations of sentient beings, they don't see the characteristics of body and birth because they lack attainment.",
        "source": "T11n0310_090:0516b23_15"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T11n0310_090:0516b24_16"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T11n0310_090:0516b24_17"
    },
    {
        "source_sentence": "如師子王大哮吼時，諸小野干能堪任不？」",
        "translation": "It's like when the king of lions roars a great roar, are the small wild animals able to do so?",
        "source": "T11n0310_090:0516b24_18"
    },
    {
        "source_sentence": "舍利弗言：「不也。",
        "translation": "Śāriputra said, No.",
        "source": "T11n0310_090:0516b25_19"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0516b26_20"
    },
    {
        "source_sentence": "「又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0310_090:0516b26_21"
    },
    {
        "source_sentence": "如大香象其所負重，驢堪任不？」",
        "translation": "It's like a great fragrant elephant carrying a heavy burden, so can a donkey bear it?",
        "source": "T11n0310_090:0516b26_22"
    },
    {
        "source_sentence": "「不也。",
        "translation": "“No, they won’t.",
        "source": "T11n0310_090:0516b27_23"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0516b27_24"
    },
    {
        "source_sentence": "「又如帝釋及梵天王威德自在，貧賤之人能堪任不？」",
        "translation": "Also, like Indra and the Brahmadeva king with their authority and sovereignty, can poor people be capable of doing so?",
        "source": "T11n0310_090:0516b27_25"
    },
    {
        "source_sentence": "「不也。",
        "translation": "“No, they won’t.",
        "source": "T11n0310_090:0516b28_26"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0516b28_27"
    },
    {
        "source_sentence": "「又如大力金翅鳥王翱翔運動，諸餘小鳥能堪任不？」",
        "translation": "Also, like the greatly powerful garuḍa king soars and moves, are the other small birds capable of doing so?",
        "source": "T11n0310_090:0516b28_28"
    },
    {
        "source_sentence": "「不也。",
        "translation": "“No, they won’t.",
        "source": "T11n0310_090:0516c01_29"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0516c01_30"
    },
    {
        "source_sentence": "佛言：「舍利弗！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T11n0310_090:0516c01_31"
    },
    {
        "source_sentence": "是諸菩薩所有善根勇猛之力，依出離智淨諸罪垢、遠離憂悔，得見諸佛及得三昧，",
        "translation": "“Furthermore, by relying upon the power of the roots of goodness of all enlightening beings’ courageous effort, they are freed from the defilements of ignorance and purified by virtue of their roots of goodness",
        "source": "T11n0310_090:0516c01_32"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T11n0310_090:0516c03_33"
    },
    {
        "source_sentence": "如斯罪障，非諸凡夫聲聞緣覺所能除滅。",
        "translation": "Such sins and hindrances can't be removed by ordinary śrāvakas and pratyekbuddhas.",
        "source": "T11n0310_090:0516c03_34"
    },
    {
        "source_sentence": "菩薩若能稱彼佛名，晝夜常行是三種法，能滅諸罪遠離憂悔，得諸三昧。」",
        "translation": "If a bodhisattva can call on the name of that Buddha, he always practices these three kinds of things day and night, extinguishes sins, parts with sorrow and regret, and attains samādhi.",
        "source": "T11n0310_090:0516c04_35"
    },
    {
        "source_sentence": "爾時優波離從禪定起，往詣佛所頂禮佛足，右遶三匝却住一面，白佛言：「世尊！",
        "translation": "Upāli then rose from his meditation, went to the Buddha, bowed his head at his feet, circumambulated him three times to his right, withdrew to one side, and said to him, Bhagavān!",
        "source": "T11n0310_090:0516c07_0"
    },
    {
        "source_sentence": "我於靜處獨坐思惟，作如是念：『世尊所說波羅提木叉清淨戒學，為聲聞、緣覺、菩薩乘者作是說言，",
        "translation": "“World-honored One, this is what the World-honored One said about the training in the pure morality of prātimokṣa for the sake of śrāvakas, pratyekbuddhas, and bodhisattvas:",
        "source": "T11n0310_090:0516c08_1"
    },
    {
        "source_sentence": "寧捨身命終不捨戒。",
        "translation": "It's better to abandon the precepts at the end of life than to abandon the precepts.",
        "source": "T11n0310_090:0516c11_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0516c11_3"
    },
    {
        "source_sentence": "若佛在世、若滅度後，云何名為聲聞緣覺波羅提木叉？",
        "translation": "If the Buddha were in the world or after his parinirvāṇa, what would be called śrāvaka- pratyekabuddha?",
        "source": "T11n0310_090:0516c11_4"
    },
    {
        "source_sentence": "云何名為菩薩乘者波羅提木叉？』",
        "translation": "What's called the bodhisattva vehicle, the prātimokṣa?'",
        "source": "T11n0310_090:0516c13_0"
    },
    {
        "source_sentence": "世尊說我於持律中最為第一，我當云何能了毘尼善巧之義？",
        "translation": "Bhagavān said that I am the foremost in observance of the vinaya, so how can I understand the meaning of skillful means of the vinaya?",
        "source": "T11n0310_090:0516c13_1"
    },
    {
        "source_sentence": "若我從佛親聞受持逮無所畏，然後乃能為他廣說。",
        "translation": "If I hear, retain, and apprehend without fear from the Buddha, then I'll be able to explain it in detail for others.",
        "source": "T11n0310_090:0516c15_2"
    },
    {
        "source_sentence": "今此大眾諸來菩薩及比丘僧悉皆集會，善哉世尊！",
        "translation": "Good, Bhagavān, that this great assembly of bodhisattvas and monks from the saṃgha who have come is now gathered together, sir!",
        "source": "T11n0310_090:0516c16_3"
    },
    {
        "source_sentence": "唯願廣說決定毘尼斷除疑悔。」",
        "translation": "Please explain in detail how to resolve the doubts and remorse of the vinaya.",
        "source": "T11n0310_090:0516c17_4"
    },
    {
        "source_sentence": "爾時世尊告優波離：「汝今當知，聲聞、菩薩學清淨戒，所發心、所修行異。",
        "translation": "It was then that the Bhagavān addressed Upāli, Now, you should know that śrāvakas and bodhisattvas train in the pure precepts, but the minds they give rise to and the practices they cultivate differ.",
        "source": "T11n0310_090:0516c19_0"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0516c20_1"
    },
    {
        "source_sentence": "有聲聞乘持清淨戒，於菩薩乘名大破戒。",
        "translation": "If there are śrāvakas who uphold the pure precepts in the vehicle, they're called greatly violating the precepts in the bodhisattva vehicle.",
        "source": "T11n0310_090:0516c20_2"
    },
    {
        "source_sentence": "有菩薩乘持清淨戒，於聲聞乘名大破戒。",
        "translation": "There are bodhisattvas in the vehicle who observe pure precepts, and they're called greatly violating precepts in the śrāvaka vehicle.",
        "source": "T11n0310_090:0516c21_3"
    },
    {
        "source_sentence": "云何名為聲聞乘人雖持淨戒，於菩薩乘名大破戒？",
        "translation": "What's called a śrāvaka vehicle person who observes pure precepts but calls the bodhisattva vehicle greatly broken precepts?",
        "source": "T11n0310_090:0516c22_4"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0516c23_5"
    },
    {
        "source_sentence": "聲聞乘人乃至不應起於一念更受後身，是名聲聞持清淨戒，然於菩薩名大破戒。",
        "translation": "A śrāvaka vehicle person or even someone who doesn't give rise to a subsequent body in a single thought and then receive it again is called a śrāvaka who observes the pure precepts, but this is called a bodhisattva who breaks the",
        "source": "T11n0310_090:0516c24_6"
    },
    {
        "source_sentence": "云何菩薩持清淨戒於聲聞乘名大破戒？",
        "translation": "How does a bodhisattva who observes pure precepts in the śrāvaka vehicle receive the name greatly violating precepts?",
        "source": "T11n0310_090:0516c25_7"
    },
    {
        "source_sentence": "菩薩摩訶薩修行大乘，能於無量阿僧祇劫堪忍受身不生厭患，是名菩薩持清淨戒，",
        "translation": "“Furthermore, great enlightening beings who practice the Great Vehicle and are able for immeasurable eons to endure physical suffering without becoming disgusted—this is called a bodhisattva’s keeping of pure precepts.",
        "source": "T11n0310_090:0516c26_8"
    },
    {
        "source_sentence": "於聲聞乘名大破戒。",
        "translation": "In the śrāvaka vehicle, it's called greatly breaking the precepts.",
        "source": "T11n0310_090:0516c28_9"
    },
    {
        "source_sentence": "以是義故，為菩薩乘說不盡護戒，為聲聞乘說盡護戒。",
        "translation": "Because of this meaning, it's explained for the bodhisattva vehicle that they don't fully protect the precepts and for the śrāvaka vehicle that they fully protect the precepts.",
        "source": "T11n0310_090:0516c29_10"
    },
    {
        "source_sentence": "為諸菩薩說開遮戒，為諸聲聞說唯遮戒。",
        "translation": "He teaches the bodhisattvas to disclose the precepts that are hindered, and he teaches the śrāvakas only the precepts that are hindered.",
        "source": "T11n0310_090:0517a01_11"
    },
    {
        "source_sentence": "為菩薩乘說深心戒，為聲聞乘說次第戒。",
        "translation": "He teaches the profound mind precepts for the bodhisattva vehicle and the sequential precepts for the śrāvaka vehicle.",
        "source": "T11n0310_090:0517a02_12"
    },
    {
        "source_sentence": "云何菩薩持不盡護戒，聲聞乘者持盡護戒？",
        "translation": "How does a bodhisattva observe precepts that aren't exhaustive and a śrāvaka vehicle observe precepts that are exhaustive?",
        "source": "T11n0310_090:0517a03_13"
    },
    {
        "source_sentence": "菩薩乘人雖持淨戒，於諸眾生應當隨順，聲聞乘人不應隨順。",
        "translation": "Although bodhisattva-vehicle people observe pure precepts, they should follow them to sentient beings, and śrāvakas shouldn't follow them.",
        "source": "T11n0310_090:0517a04_14"
    },
    {
        "source_sentence": "是故菩薩持不盡護戒，聲聞乘人持盡護戒。",
        "translation": "Therefore, bodhisattvas observe precepts that aren't exhaustive and śrāvakas in the vehicle observe precepts that are exhaustive.",
        "source": "T11n0310_090:0517a05_15"
    },
    {
        "source_sentence": "云何名為菩薩持開遮戒，聲聞乘人持唯遮戒？",
        "translation": "What's called a bodhisattva who observes and discloses the precepts that are to be shielded, and a śrāvaka vehicle person observes only the precepts that are to be shielded?",
        "source": "T11n0310_090:0517a06_16"
    },
    {
        "source_sentence": "若諸菩薩於大乘中發趣修行，日初分時有所犯戒，於日中分不離一切智心，",
        "translation": "“Furthermore, if enlightening beings are engaged in the practice of the Great Vehicle and violate the precepts on the first watch of the day at the beginning of the month, they won’t part from the determination for omniscience during the",
        "source": "T11n0310_090:0517a07_17"
    },
    {
        "source_sentence": "如是菩薩戒身不壞。",
        "translation": "Thus, the bodhisattva's body of morality doesn't break down.",
        "source": "T11n0310_090:0517a09_18"
    },
    {
        "source_sentence": "若日中分有所犯戒，於日後分不離一切智心，如是菩薩戒身不壞。",
        "translation": "If someone violates the precepts in the middle part of the day and doesn't part with the mind of omniscience in the latter part of the day, such a bodhisattva's body of precepts won't break down.",
        "source": "T11n0310_090:0517a10_19"
    },
    {
        "source_sentence": "若日後分有所犯戒，於夜初分不離一切智心，如是菩薩戒身不壞。",
        "translation": "If someone violates the precepts in the latter part of the day and doesn't part with the mind of omniscience in the first part of the night, such a bodhisattva's body of precepts won't break down.",
        "source": "T11n0310_090:0517a11_20"
    },
    {
        "source_sentence": "若夜初分有所犯戒，於夜中分不離一切智心，如是菩薩戒身不壞。",
        "translation": "If someone violates the precepts in the first part of the night and doesn't part with the mind of omniscience in the middle part of the night, thus the bodhisattva's body of precepts won't break down.",
        "source": "T11n0310_090:0517a13_21"
    },
    {
        "source_sentence": "若夜中分有所犯戒，於夜後分不離一切智心，如是菩薩戒身不壞。",
        "translation": "If someone violates the precepts in the middle part of the night and doesn't part with the mind of omniscience in the latter part of the night, such a bodhisattva's body of precepts won't break down.",
        "source": "T11n0310_090:0517a14_22"
    },
    {
        "source_sentence": "若夜後分有所犯戒，於日初分不離一切智心，如是菩薩戒身不壞。",
        "translation": "If someone violates the precepts in the latter part of the night and doesn't part with the mind of omniscience at the first part of the day, such a bodhisattva's body of precepts won't break down.",
        "source": "T11n0310_090:0517a16_23"
    },
    {
        "source_sentence": "以是義故，菩薩乘人持開遮戒，設有所犯不應失念，妄生憂悔自惱其心。",
        "translation": "Because of this, the bodhisattva vehicle people who observe the precepts that shield themselves from transgressions shouldn't lose mindfulness if they violate them and deludedly give rise to grief and anguish in their own minds.",
        "source": "T11n0310_090:0517a17_24"
    },
    {
        "source_sentence": "於聲聞乘有所犯者，便為破壞聲聞淨戒。",
        "translation": "Anyone who violates the śrāvaka vehicle's precepts will then break the śrāvaka's pure precepts.",
        "source": "T11n0310_090:0517a19_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_090:0517a20_26"
    },
    {
        "source_sentence": "聲聞持戒，斷除煩惱如救頭然，所有志樂但求涅槃，以是義故，名聲聞乘持唯遮戒。",
        "translation": "śrāvakas observe precepts that remove the afflictions like a hairpin, and all their aspirations are simply to seek nirvāṇa; because of this meaning, they're called śrāvakas who adhere only to the precepts that",
        "source": "T11n0310_090:0517a20_27"
    },
    {
        "source_sentence": "「復次優波離！",
        "translation": "Furthermore, Upāli!",
        "source": "T11n0310_090:0517a23_0"
    },
    {
        "source_sentence": "云何菩薩持深入戒，聲聞乘人持次第戒？",
        "translation": "How do bodhisattvas observe the profound precepts and śrāvakas of the vehicle observe the sequential precepts?",
        "source": "T11n0310_090:0517a23_1"
    },
    {
        "source_sentence": "菩薩乘人於恒沙劫受五欲樂遊戲自在，未曾捨離菩提之心，如是菩薩不名失戒。",
        "translation": "A bodhisattva-vehicle person who receives the five desires, pleasures, and playful freedoms for an eon as numerous as the sands of the Ganges River and never abandons the mind of enlightenment, such a bodhi",
        "source": "T11n0310_090:0517a24_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_090:0517a26_3"
    },
    {
        "source_sentence": "菩薩善能守護安住菩提之心，乃至夢中一切結使不為其患，而是菩薩所有煩惱漸漸當盡，",
        "translation": "Enlightening beings are able to guard the determination for enlightenment, and even in dreams they do not harm all the bonds that bind them. Instead, gradually the afflictions of enlightening beings will be eliminated.",
        "source": "T11n0310_090:0517a26_4"
    },
    {
        "source_sentence": "不應一生便盡諸結。",
        "translation": "You shouldn't end the bonds in a single lifetime.",
        "source": "T11n0310_090:0517a28_5"
    },
    {
        "source_sentence": "聲聞乘者成熟善根如救頭然，乃至一念不憙受生。",
        "translation": "The śrāvaka vehicle ripens the good roots like a rescue, even to the point where they aren't subject to birth in a single thought.",
        "source": "T11n0310_090:0517a28_6"
    },
    {
        "source_sentence": "以是義故，大乘之人持深入戒，說有開遮，名不盡護。",
        "translation": "Because of this meaning, people of the great vehicle observe profound precepts and say there's an opening and shutting off, which is called inexhaustible protection.",
        "source": "T11n0310_090:0517b01_7"
    },
    {
        "source_sentence": "聲聞乘人持次第戒，名曰唯遮，名為盡護。",
        "translation": "A śrāvaka vehicle person who observes the sequential precepts is called only obstructing, which is called fully protecting.",
        "source": "T11n0310_090:0517b02_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_090:0517b03_9"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0517b03_10"
    },
    {
        "source_sentence": "求大乘者，於阿耨多羅三藐三菩提甚為難得，具大莊嚴乃能成就。",
        "translation": "Those who seek the great vehicle find it very difficult to attain unsurpassed, correct, and complete enlightenment, and it's only when they have great adornment that they can achieve it.",
        "source": "T11n0310_090:0517b03_11"
    },
    {
        "source_sentence": "是故菩薩雖於無量阿僧祇劫往來生死，終不生於厭離之心。",
        "translation": "Therefore, even though a bodhisattva goes to birth and death for measureless incalculably long eons, he never becomes disillusioned with it.",
        "source": "T11n0310_090:0517b05_12"
    },
    {
        "source_sentence": "以是義故，如來觀察為大乘人，不應一向說厭離法，不應一向說於速證涅槃之法。",
        "translation": "Because of this meaning, the Tathāgata observes that he's a great vehicle person who doesn't always explain the principle of freedom from disillusionment and doesn't always explain the principle of quickly realizing nirvāṇa.",
        "source": "T11n0310_090:0517b06_13"
    },
    {
        "source_sentence": "應當為說慈喜相應甚深微妙無染之法，遠離憂悔無繫著法，無障無礙性空之法。",
        "translation": "You should explain the profound, subtle, and undefiled dharmas associated with kindness and joy, the dharmas that are free of sorrow and remorse, the dharmas that are not attached, and the dharmas that are unobstruct",
        "source": "T11n0310_090:0517b08_14"
    },
    {
        "source_sentence": "菩薩聞已，於生死中而無厭倦，決定圓滿無上菩提。」",
        "translation": "After hearing it, the bodhisattva doesn't tire of being in birth-and-death and is certain to perfect unsurpassed enlightenment.",
        "source": "T11n0310_090:0517b10_15"
    },
    {
        "source_sentence": "爾時優波離白佛言：「世尊！",
        "translation": "Upāli then said to the Buddha, Bhagavān!",
        "source": "T11n0310_090:0517b12_0"
    },
    {
        "source_sentence": "若有菩薩貪心相應而犯於戒，或有菩薩瞋心相應而犯於戒，或有菩薩癡心相應而犯於戒。",
        "translation": "Suppose there's a bodhisattva who violates the precepts because he's associated with craving, or a bodhisattva who violates the precepts because he's associated with anger, or a bodhisattva who viola",
        "source": "T11n0310_090:0517b12_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_090:0517b14_2"
    },
    {
        "source_sentence": "如是菩薩於三犯中何者為重？」",
        "translation": "Which of these three offenses is the most serious for a bodhisattva like this?",
        "source": "T11n0310_090:0517b14_3"
    },
    {
        "source_sentence": "爾時世尊告優波離言：「若諸菩薩修行大乘如恒沙劫，貪心相應而犯戒者，",
        "translation": "It was then that the Bhagavat addressed Upāli, saying: Suppose bodhisattvas practice the Great Vehicle for as many kalpas as there are grains of sand in the Ganges River and violate the precepts conjoined with craving.",
        "source": "T11n0310_090:0517b16_0"
    },
    {
        "source_sentence": "其罪尚輕。",
        "translation": "Their sins are still light.",
        "source": "T11n0310_090:0517b17_1"
    },
    {
        "source_sentence": "若一瞋心而犯於戒，其罪甚重。",
        "translation": "If someone violates the precepts with a single angry mind, their sin is too great.",
        "source": "T11n0310_090:0517b17_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_090:0517b18_3"
    },
    {
        "source_sentence": "因貪犯戒攝受眾生，因瞋犯戒棄捨眾生。",
        "translation": "Because of craving and violating the precepts, they take in sentient beings who are collected, and because of anger and violations of the precepts, they abandon sentient beings.",
        "source": "T11n0310_090:0517b18_4"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0517b19_5"
    },
    {
        "source_sentence": "所有諸結能攝眾生，菩薩於此不應生畏。",
        "translation": "All the bonds that exist can subdue sentient beings, and bodhisattvas shouldn't become frightened by them.",
        "source": "T11n0310_090:0517b20_0"
    },
    {
        "source_sentence": "所有諸結能捨眾生，菩薩於此應生怖畏。",
        "translation": "All the bonds that exist can abandon sentient beings, and bodhisattvas should become frightened by them.",
        "source": "T11n0310_090:0517b20_1"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0517b21_2"
    },
    {
        "source_sentence": "如佛所說，貪欲難捨為過微細，瞋恚易捨為過麁重，癡難捨離過復麁重。",
        "translation": "As the Buddha has said, difficulty in abandoning attachment to sensual desire is a subtle fault. The ease with which anger and hatred can be abandoned is a serious offense. Foolishness is also a serious offense because it is difficult to",
        "source": "T11n0310_090:0517b22_3"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0517b23_4"
    },
    {
        "source_sentence": "於煩惱中，若難捨離小犯之罪，是諸菩薩應當堪忍。",
        "translation": "In the midst of affliction, if it's difficult to abandon minor offenses, bodhisattvas should be able to tolerate them.",
        "source": "T11n0310_090:0517b23_5"
    },
    {
        "source_sentence": "若易捨離大犯之罪，如是煩惱乃至夢中不應忍受。",
        "translation": "If someone easily abandons a great offense, such afflictions or even dreams won't be tolerated.",
        "source": "T11n0310_090:0517b25_6"
    },
    {
        "source_sentence": "以是義故，大乘之人因貪犯戒，我說是人不名為犯。",
        "translation": "It's because of this meaning that a great vehicle person violates the precepts because they crave them, and I say these people aren't called violators.",
        "source": "T11n0310_090:0517b26_7"
    },
    {
        "source_sentence": "因瞋犯戒為大犯戒，名大過患、名大墮落，於佛法中是大留難。",
        "translation": "A violation of the precepts because of anger is a great violation of the precepts, which is called a great misfortune and a great falling back, and it's a great difficulty in the Buddha's teaching.",
        "source": "T11n0310_090:0517b27_8"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0517b28_9"
    },
    {
        "source_sentence": "若諸菩薩於毘尼中無善方便，貪相應犯便生怖畏，瞋相應犯不生怖畏。",
        "translation": "If bodhisattvas lack good skillful means in the Vinaya, then violations associated with craving will give rise to fear and violations associated with anger won't give rise to fear.",
        "source": "T11n0310_090:0517b29_10"
    },
    {
        "source_sentence": "若諸菩薩於毘尼中有善方便，貪相應犯不生怖畏，瞋相應犯生大怖畏。」",
        "translation": "If bodhisattvas have good skillful means in the Vinaya that are associated with craving and offenses that don't give rise to fear, then the association with anger gives rise to great fear.",
        "source": "T11n0310_090:0517c01_11"
    },
    {
        "source_sentence": "爾時文殊師利法王子在大眾中白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī, the prince of the Dharma, said to the Buddha in the midst of the crowd, Bhagavān!",
        "source": "T11n0310_090:0517c04_0"
    },
    {
        "source_sentence": "一切諸法畢竟毘尼，何所調伏？」",
        "translation": "What is the ultimate discipline of all dharmas?",
        "source": "T11n0310_090:0517c05_1"
    },
    {
        "source_sentence": "佛告文殊師利：「若諸凡夫了知諸法究竟毘尼，如來終不說於調伏。",
        "translation": "The Buddha told Mañjuśrī, If ordinary people understand the ultimate Vinaya of the teachings, the Tathāgata never explains submission.",
        "source": "T11n0310_090:0517c05_2"
    },
    {
        "source_sentence": "以不知故，如來為令覺了諸法畢竟毘尼，漸次為說諸毘尼法。」",
        "translation": "Because they don't know it, the Tathāgata causes them to perceive the final rules of the Vinaya and gradually explains the rules of the Vinaya for them.",
        "source": "T11n0310_090:0517c07_3"
    },
    {
        "source_sentence": "爾時優波離白佛言：「世尊！",
        "translation": "Upāli then said to the Buddha, Bhagavān!",
        "source": "T11n0310_090:0517c09_0"
    },
    {
        "source_sentence": "如來說此決定毘尼，文殊師利於是法中未有所說。",
        "translation": "The Tathāgata teaches this definite vinaya, but Mañjuśrī doesn't explain it in terms of the teaching.",
        "source": "T11n0310_090:0517c09_1"
    },
    {
        "source_sentence": "善哉世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T11n0310_090:0517c10_2"
    },
    {
        "source_sentence": "願令文殊師利為少解說。」",
        "translation": "May I ask Mañjuśrī to explain it for me with a little understanding?",
        "source": "T11n0310_090:0517c11_0"
    },
    {
        "source_sentence": "佛告文殊師利：「汝今當說究竟毘尼善巧之義，是優波離願樂欲聞。」",
        "translation": "The Buddha told Mañjuśrī, Now, you will explain the ultimate meaning of the skillfulness of the vinaya, which Upāli wishes to hear.",
        "source": "T11n0310_090:0517c11_1"
    },
    {
        "source_sentence": "爾時文殊師利法王子語優波離言：「一切諸法畢竟寂滅，心寂滅故名究竟毘尼。",
        "translation": "It was then that Mañjuśrī, the prince of the Dharma, said to Upāli, All dharmas are ultimately extinguished, and because the mind is extinguished, it's called the ultimate vinaya.",
        "source": "T11n0310_090:0517c13_2"
    },
    {
        "source_sentence": "一切諸法我不可得，無染著故名不悔毘尼。",
        "translation": "The self of all dharmas is unobtainable, and because it's without defiled attachment, it's called the vinaya of no regret.",
        "source": "T11n0310_090:0517c14_3"
    },
    {
        "source_sentence": "一切諸法本性清淨，無顛倒故名最勝毘尼。",
        "translation": "All dharmas are inherently pure and without error, so they're called the most excellent vinaya.",
        "source": "T11n0310_090:0517c15_4"
    },
    {
        "source_sentence": "一切諸法如如實際，離諸見故名清淨毘尼。",
        "translation": "All dharmas are as they really are, and because they're free of views, they're called pure vinaya.",
        "source": "T11n0310_090:0517c16_5"
    },
    {
        "source_sentence": "一切諸法不來不去，無分別故名不思議毘尼。",
        "translation": "All dharmas don't come or go, and because there's no discrimination, they're called inconceivable vinaya.",
        "source": "T11n0310_090:0517c17_6"
    },
    {
        "source_sentence": "一切諸法無住無著，念念滅故名淨諸趣毘尼。",
        "translation": "All dharmas are neither abiding nor attached, and mindfulness ceases, so they're called the Vinaya that purifies the destinies.",
        "source": "T11n0310_090:0517c19_0"
    },
    {
        "source_sentence": "一切諸法住虛空際，離諸相故名自性遠離毘尼。",
        "translation": "All dharmas abide in space, and because they are free of characteristics, they're called the self-nature that's free of vinaya.",
        "source": "T11n0310_090:0517c20_1"
    },
    {
        "source_sentence": "一切諸法無去來今，不可得故名三世平等毘尼。",
        "translation": "All dharmas have no past, future, or present, and are unobtainable, so they're called the equality of the three times.",
        "source": "T11n0310_090:0517c21_2"
    },
    {
        "source_sentence": "一切諸法不可安立，心平等故名永斷疑惑毘尼。",
        "translation": "All dharmas can't be established, and because their minds are equal, they're called the Vinaya of permanently ending doubt.",
        "source": "T11n0310_090:0517c22_3"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0517c23_4"
    },
    {
        "source_sentence": "是為法界究竟毘尼，諸佛世尊依此成道。",
        "translation": "This is the ultimate vinaya of the Dharma realm, on which the buddhas and world-honored ones rely to attain enlightenment.",
        "source": "T11n0310_090:0517c23_5"
    },
    {
        "source_sentence": "若善男子於是法中不善觀察，則為遠離如來淨戒。」",
        "translation": "If good sons don't well observe these things, then they'll be far removed from the Tathāgata's pure precepts.",
        "source": "T11n0310_090:0517c24_6"
    },
    {
        "source_sentence": "時優波離白佛言：「世尊！",
        "translation": "Upāli then said to the Buddha, Bhagavān!",
        "source": "T11n0310_090:0517c25_7"
    },
    {
        "source_sentence": "文殊師利所說諸法不可思議。」",
        "translation": "The teachings taught by Mañjuśrī are inconceivable.",
        "source": "T11n0310_090:0517c26_8"
    },
    {
        "source_sentence": "爾時世尊告優波離言：「文殊師利所說之法，依不可思議無礙解脫。",
        "translation": "It was then that the Bhagavān addressed Upāli, saying, The teaching taught by Mañjuśrī relies on inconceivable unobstructed liberation.",
        "source": "T11n0310_090:0517c28_0"
    },
    {
        "source_sentence": "以是義故，凡所說法離諸心相謂心解脫，增上慢人令得離於增上慢故。」",
        "translation": "Because of this meaning, it's called mental liberation when everything that's taught is free of the characteristics of mind, and it's because those who are overweeningly conceited will attain freedom from overweening conceit.",
        "source": "T11n0310_090:0517c29_1"
    },
    {
        "source_sentence": "優波離白佛言：「世尊！",
        "translation": "Upāli said to the Buddha, Bhagavān!",
        "source": "T11n0310_090:0518a03_0"
    },
    {
        "source_sentence": "云何聲聞及菩薩乘增上慢者？」",
        "translation": "What are the śrāvakas and bodhisattvas who are overweeningly arrogant?",
        "source": "T11n0310_090:0518a03_1"
    },
    {
        "source_sentence": "佛告優波離：「若有比丘作是思惟：『我斷貪欲。』",
        "translation": "The Buddha told Upāli, Suppose a monk thinks, 'I'll stop craving.'",
        "source": "T11n0310_090:0518a04_2"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a05_3"
    },
    {
        "source_sentence": "『我斷瞋恚及以愚癡。』",
        "translation": "'I'll stop anger and ignorance.'",
        "source": "T11n0310_090:0518a05_4"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a05_5"
    },
    {
        "source_sentence": "『貪欲法異、諸佛法異。』",
        "translation": "'The teaching of craving is different, and the teachings of the buddhas are different.'",
        "source": "T11n0310_090:0518a06_6"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a06_7"
    },
    {
        "source_sentence": "『瞋恚法異、諸佛法異。』",
        "translation": "'The teaching of anger is different, and the teachings of the buddhas are different.'",
        "source": "T11n0310_090:0518a06_8"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a07_9"
    },
    {
        "source_sentence": "『愚癡法異、諸佛法異。』",
        "translation": "'The teaching of foolishness is different, and the teachings of the buddhas are different.'",
        "source": "T11n0310_090:0518a07_10"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a08_11"
    },
    {
        "source_sentence": "謂有所得，名增上慢。",
        "translation": "It means that there is something to be attained, and it's called superior pride.",
        "source": "T11n0310_090:0518a08_12"
    },
    {
        "source_sentence": "謂有所證，名增上慢。",
        "translation": "It means that something is realized, which is called overweening pride.",
        "source": "T11n0310_090:0518a08_13"
    },
    {
        "source_sentence": "謂有解脫，名增上慢。",
        "translation": "The existence of liberation is called the arrogance of pride.",
        "source": "T11n0310_090:0518a09_14"
    },
    {
        "source_sentence": "見諸法空，名增上慢。",
        "translation": "To see the emptiness of all dharmas is called overweening pride.",
        "source": "T11n0310_090:0518a09_15"
    },
    {
        "source_sentence": "見於無相，名增上慢。",
        "translation": "Seeing the absence of characteristics is called overweening pride.",
        "source": "T11n0310_090:0518a10_16"
    },
    {
        "source_sentence": "見於無願，名增上慢。",
        "translation": "Seeing the absence of aspiration is called overweening pride.",
        "source": "T11n0310_090:0518a10_17"
    },
    {
        "source_sentence": "見於無生，名增上慢。",
        "translation": "Seeing nonarising is called overweening pride.",
        "source": "T11n0310_090:0518a11_18"
    },
    {
        "source_sentence": "見無所作，名增上慢。",
        "translation": "The view that there is nothing to be done is called overweening pride.",
        "source": "T11n0310_090:0518a11_19"
    },
    {
        "source_sentence": "見有諸法，名增上慢。",
        "translation": "The view that there are dharmas is called overweening pride.",
        "source": "T11n0310_090:0518a12_20"
    },
    {
        "source_sentence": "見法無常，名增上慢。",
        "translation": "To see that things are impermanent is called overweening pride.",
        "source": "T11n0310_090:0518a12_21"
    },
    {
        "source_sentence": "謂諸法空何用修習？",
        "translation": "What's the use of cultivating emptiness of dharmas?",
        "source": "T11n0310_090:0518a13_22"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a13_23"
    },
    {
        "source_sentence": "優波離！",
        "translation": "Upāli!",
        "source": "T11n0310_090:0518a13_24"
    },
    {
        "source_sentence": "是名聲聞乘人增上慢者。",
        "translation": "This is called a śrāvaka vehicle that's overweeningly arrogant.",
        "source": "T11n0310_090:0518a14_25"
    },
    {
        "source_sentence": "云何名為菩薩乘人增上慢者？",
        "translation": "What's called a person of the bodhisattva vehicle who is overweeningly conceited?",
        "source": "T11n0310_090:0518a14_26"
    },
    {
        "source_sentence": "若諸菩薩作是思惟：『我當發心求一切智。』",
        "translation": "Suppose bodhisattvas think, 'Should I arouse the mind to seek omniscience?'",
        "source": "T11n0310_090:0518a15_27"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a16_28"
    },
    {
        "source_sentence": "『我當修行六波羅蜜。』",
        "translation": "'I will cultivate the six perfections.'",
        "source": "T11n0310_090:0518a16_29"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a17_0"
    },
    {
        "source_sentence": "『唯依般若波羅蜜而得解脫，更無餘法而得出離。』",
        "translation": "'Only by relying on the perfection of wisdom that they attain liberation, and there's no other way to escape.'",
        "source": "T11n0310_090:0518a17_1"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a18_2"
    },
    {
        "source_sentence": "『此法甚深、此非甚深。』",
        "translation": "'This teaching is profound, but this isn't profound.'",
        "source": "T11n0310_090:0518a18_3"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a19_4"
    },
    {
        "source_sentence": "『此法是淨、此法非淨。』",
        "translation": "'This teaching is pure, and this teaching isn't pure.'",
        "source": "T11n0310_090:0518a19_5"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a19_6"
    },
    {
        "source_sentence": "『此諸佛法、此緣覺法、此聲聞法。』",
        "translation": "'These are the buddha-dharmas, these are the pratyekabuddha-dharmas, and these are the śrāvaka-dharmas.'",
        "source": "T11n0310_090:0518a20_7"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a20_8"
    },
    {
        "source_sentence": "『此法應作、此不應作。』",
        "translation": "'This teaching should be done and this shouldn't be done.'",
        "source": "T11n0310_090:0518a21_9"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a21_10"
    },
    {
        "source_sentence": "『此是深法、此非深法。』",
        "translation": "'This is a profound teaching and this isn't a profound teaching.'",
        "source": "T11n0310_090:0518a21_11"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a22_12"
    },
    {
        "source_sentence": "『此是近法、此非近法。』",
        "translation": "'This is the proximate teaching and this is not the proximate teaching.'",
        "source": "T11n0310_090:0518a22_13"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a23_14"
    },
    {
        "source_sentence": "『此是正道、此是邪道。』",
        "translation": "'This is the right path and this is the wrong path.'",
        "source": "T11n0310_090:0518a23_15"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a23_16"
    },
    {
        "source_sentence": "『我於阿耨多羅三藐三菩提為疾得耶？",
        "translation": "'Did I quickly attain supreme perfect enlightenment?'",
        "source": "T11n0310_090:0518a24_17"
    },
    {
        "source_sentence": "不疾得耶？』",
        "translation": "Isn't it quickly attained?'",
        "source": "T11n0310_090:0518a24_18"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a25_19"
    },
    {
        "source_sentence": "『一切諸法不可思議，無能知者。",
        "translation": "'All things are inconceivable, and there's no one who can know them.",
        "source": "T11n0310_090:0518a25_20"
    },
    {
        "source_sentence": "我能了知。』",
        "translation": "I can understand it.'",
        "source": "T11n0310_090:0518a26_21"
    },
    {
        "source_sentence": "名增上慢。",
        "translation": "It's called overweening pride.",
        "source": "T11n0310_090:0518a26_22"
    },
    {
        "source_sentence": "乃至於不可思議阿耨多羅三藐三菩提而起思惟，為大執著，是名菩薩增上慢者。」",
        "translation": "Even when they give rise to contemplation of the inconceivable unsurpassed, correct, and complete enlightenment and become greatly attached, this is called a bodhisattva's overweening conceit.",
        "source": "T11n0310_090:0518a26_23"
    },
    {
        "source_sentence": "爾時優波離白佛言：「世尊！",
        "translation": "Upāli then said to the Buddha, Bhagavān!",
        "source": "T11n0310_090:0518a29_0"
    },
    {
        "source_sentence": "云何比丘離增上慢？」",
        "translation": "How does a monk become free of overweening conceit?",
        "source": "T11n0310_090:0518a29_1"
    },
    {
        "source_sentence": "佛告優波離：「若於一切不思議法無所執著，是名究竟無增上慢。」",
        "translation": "The Buddha told Upāli, If you don't cling to all the inconceivable dharmas, this is called ultimately having no overweening conceit.",
        "source": "T11n0310_090:0518b01_2"
    },
    {
        "source_sentence": "「一切戲論從心起，　　不應分別法非法，",
        "translation": "“All conceptual elaborations arise from the mind, so you should not discriminate between what’s right and wrong.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　如是見法不思議，　　彼人處世常安樂。",
        "translation": "Such a person who sees the teaching inconceivably, That person is always at peace in the world.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　凡夫迷惑隨心轉，　　多劫輪迴諸有中，",
        "translation": "Ordinary people are deluded and go along with their minds, Revolving through many eons among the existences.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若知法性皆無性，　　是名真實不思議。",
        "translation": "If someone knows that the nature of dharmas is all without nature, this is called truly true and inconceivable.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若有比丘念諸佛，　　非善思惟非正念，",
        "translation": "If a monk is mindful of the Buddhas And doesn’t think well or rightly,",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　於佛妄生分別想，　　而此分別無真實。",
        "translation": "They falsely give rise to discriminating conceptions of buddhas, Yet these discriminations are unreal.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若有思惟於空法，　　如是凡夫住邪道，",
        "translation": "If there are those who contemplate the teaching of emptiness, Such worldlings will abide in wrong paths.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　但以文字說於空，　　文字與空何可得？",
        "translation": "But it's because words speak of emptiness, so how can words and emptiness be obtained?",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若有思惟寂靜法，　　是心非有本無生，",
        "translation": "If one contemplates the principle of quiescence, This mind has no existence and is fundamentally non-arising.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　心行覺觀皆戲論，　　無念名為見諸法。",
        "translation": "Mind, volition, perception, and contemplation are all conceptual elaborations, and the absence of thought is called seeing things.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　一切諸法無思念，　　有心有念盡皆空，",
        "translation": "All things have no thought, And all thoughts and minds are completely empty.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若人愛樂觀察空，　　於此無念勿生念。",
        "translation": "If someone loves and delights in observing emptiness, don't give rise to thoughts here.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　法同草木無知覺，　　若離於心不可得，",
        "translation": "The Dharma is the same as grass and trees, with no knowing or apprehending; If one were to leave the mind, it would be ungraspable.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　眾生自性無所有，　　一切諸法皆如是。",
        "translation": "The self-nature of sentient beings has no existence, And all things are like this.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　如因日光眼能見，　　夜則緣離無所覩，",
        "translation": "Just as the eye is able to see by reason of the sun’s light, Yet at night it does not perceive anything.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若眼自能見色者，　　何故待緣方能了？",
        "translation": "If the eye itself can see visible matter, Why does it only perceive it by relying on conditions?",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　眼常因彼諸光明，　　能見種種青黃色，",
        "translation": "Because of those lights, the eye always sees various blue and yellow colors.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　當知見性依眾緣，　　是故知眼不能見。",
        "translation": "You should know that the nature of seeing depends on many conditions; therefore, it's known that the eye can't see.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　設有聞諸悅意聲，　　聞已即滅而無住，",
        "translation": "If there are those who hear pleasing sounds, They cease and do not abide after hearing them.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　推其去處不可得，　　以分別故生聲想。",
        "translation": "Depending on where it goes, they can't get it, and because of discrimination, they give rise to perceptions of sound.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　一切諸法但言聲，　　文字於中假安立，",
        "translation": "All dharmas are merely sounds, With words and syllables conventionally established therein:",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　是聲無有法非法，　　凡愚不知妄生著。",
        "translation": "This sound has no dharmas or non-dharmas, and ordinary foolish people don't know that deluded attachment arises.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我為世間歎布施，　　而施根本不可得，",
        "translation": "I praise giving for the sake of the world, Yet give is ungraspable.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　無所說中而演說，　　是故佛法不思議。",
        "translation": "To expound it in the absence of anything to teach Is Therefore the Buddha’s teaching is inconceivable.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我常歎說持淨戒，　　亦無眾生破戒者，",
        "translation": "I always praise those who preach the pure precepts, And there are no sentient beings who break them.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　破戒之性猶虛空，　　清淨持戒亦如是。",
        "translation": "The nature of violating precepts is like space, And so is the pure observance of precepts.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我說忍辱為最勝，　　無見無生為忍性，",
        "translation": "I say forbearance is the supreme. The absence of views and nonorigination are the nature of forbearance.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　實無少法可瞋者，　　由是說名殊勝忍。",
        "translation": "Because there really is no little thing to be hated, it's called superior forbearance.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我說晝夜常精進，　　寤寐恒覺為無上，",
        "translation": "I proclaim that day and night is always energetic, That sleep and awakening are the highest.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　雖經多劫勤修行，　　然於所作無增減。",
        "translation": "Even though they spend many eons diligently cultivating practice, there's no increase or decrease in what they do.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　禪定解脫及三昧，　　開示世間如實門，",
        "translation": "The liberation of meditation and concentration, as well as samādhi, They reveal the real face of worldly practice.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　法性本來無所動，　　隨順假說諸禪定。",
        "translation": "The essence of dharmas originally unmoving, They follow the conventional explanations of meditation.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　觀察覺了名智慧，　　了知諸法名智人，",
        "translation": "Observing and apprehending is called wisdom, Understanding all things is called the wise person.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　諸法自性無所有，　　亦無觀察了知者。",
        "translation": "The self-nature of dharmas has no existence, And there is no one who observes or comprehends them.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我常歎說修苦行，　　愛樂頭陀寂靜法，",
        "translation": "I always praise and explain the practice of austerities, And delight in the peaceful state of ascetic practice.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　能知諸法不可得，　　是名清淨知足人。",
        "translation": "Being able to know that all dharmas are ungraspable is called a person of pure knowledge and fulfillment.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我說地獄諸苦事，　　死入大怖惡道中，",
        "translation": "I'll explain the painful things of hell, and they'll die and enter a great fearful bad destiny.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　無量眾生起厭心，　　實無惡趣可來往。",
        "translation": "Countless sentient beings give rise to disillusionment, but there really are no bad destinies to come or go.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　刀杖鉾矟眾苦具，　　亦無有能造作者，",
        "translation": "Swords, sticks, spears, and spears, as well as various instruments of torture, No one is able to create them.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　由分別故而見有，　　無量楚毒迫其身。",
        "translation": "Because of their discrimination, they see existence and are oppressed by measureless pain and suffering.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　園林種種妙花敷，　　宮殿眾寶相輝映，",
        "translation": "Gardens and groves are covered with various exquisite flowers; Palaces and jewels shine brilliantly together.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　亦無有人能作者，　　皆從分別妄心生。",
        "translation": "Nor is there anyone who can do so, All born of discriminating and deluded thought.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　虛偽之法誑世間，　　凡夫繫著生顛倒，",
        "translation": "False dharmas deceive the world, Ordinary people attached to them give rise to delusion.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　猶如分別諸幻焰，　　於此取捨悉皆空。",
        "translation": "It's like discriminating illusory flames, which are all empty of attachment and equanimity.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我說發趣菩提心，　　利益世間最殊勝，",
        "translation": "I teach that the determination for enlightenment Is the most distinguished in terms of benefiting the world.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　而實菩提不可得，　　亦無發趣菩提者。",
        "translation": "But true enlightenment can't be obtained, and there's no one who sets out for enlightenment.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　心性清淨常光明，　　真實無偽無愛染，",
        "translation": "The mind inherently pure, always shining, Is genuine, without falsehood or craving.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　凡夫分別生貪著，　　而彼煩惱本來空。",
        "translation": "Ordinary people discriminate and give rise to craving, but those afflictions are originally empty.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　諸法自性常寂靜，　　何有貪欲及瞋癡？",
        "translation": "The self-natures of all things are always quiescent, so why should there be craving and anger and delusion?",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　不見生貪離欲處，　　爾乃名為得涅槃，",
        "translation": "If one does not see birth in the state of craving and nonattachment, One is said to attain nirvana.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　其心未曾生染著，　　由是成就大菩提。",
        "translation": "Their minds never give rise to defiled attachment, and because of this they attain great enlightenment.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　於無數劫修眾行，　　度脫無量諸眾生，",
        "translation": "In countless eons they cultivate various practices, Liberating measureless sentient beings.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　眾生自性不可得，　　實無眾生可度者，",
        "translation": "The self-nature of sentient beings is ungraspable; There really are no sentient beings to be liberated.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　譬如世間大幻師，　　化作無邊千億眾，",
        "translation": "It’s like the worldly illusionist Who creates countless myriadstical creations.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　還復害此諸化人，　　於此幻化無增損。",
        "translation": "Again, he harms these apparitional beings, and there's no gain or loss in their illusory transformation.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　一切眾生如幻化，　　求其邊際不可得，",
        "translation": "All sentient beings are like illusions, Unable to find their limits.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若知如是無邊性，　　斯人處世無疲厭。",
        "translation": "If someone knows such boundlessness, they'll be in the world without weariness.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　了知諸法如實相，　　常行生死即涅槃，",
        "translation": "Knowing all things as they really are, They always practice birth and death, which is nirvana.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　於諸欲中實無染，　　調伏眾生言離欲。",
        "translation": "Being genuinely undefiled in all desires, they tame sentient beings and say they're free of desire.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　大悲利益諸眾生，　　而實無人無壽者，",
        "translation": "Great compassion benefits all sentient beings, Yet there really is no one who has no life span.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　不見眾生而利益，　　當知此事甚為難。",
        "translation": "Not seeing sentient beings and benefiting them, you should know that this is a great difficulty.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　如以空拳誘小兒，　　示言有物令歡喜，",
        "translation": "Like an enticed child with an empty fist, Showing something to make him rejoice.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　開手拳空無所見，　　小兒於此復號啼。",
        "translation": "He opens his fist and doesn't see anything, and here the boy cries out again.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　如是諸佛難思議，　　善巧調伏眾生類，",
        "translation": "Such buddhas are inconceivable, Skillfully taming sentient beings.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　了知法性無所有，　　假名安立示世間。",
        "translation": "Understanding that the essence of things has no existence, They nominally establish it and show it to the world.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　以大慈悲勸說言，　　於我法中最安樂，",
        "translation": "Encouraged by great compassion, he said, Most peaceful of all in my teachings.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　汝應出家捨恩愛，　　當得沙門殊勝果。",
        "translation": "You should leave home and abandon kindness and love, and you'll attain the ascetic's excellent result.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　既已出家勤修習，　　如所修行得涅槃，",
        "translation": "Having renounced the householder’s life, They diligently practice and attain nirvana Just as they practice.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　復觀諸法如實相，　　實無諸果而可得。",
        "translation": "Again, he observes all dharmas as they really are, which really lack the fruits that can be obtained.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　果無所有而得證，　　於此方生希有心，",
        "translation": "Realizing that the result has no existence, they give rise to rare thoughts here.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　快哉大悲人師子，　　善說相應如實法。",
        "translation": "It's wonderful, great compassionate man lion, who well explains the true teaching associated with it.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　一切諸法如虛空，　　安立百千名句義，",
        "translation": "All things are like space, Established by hundreds of thousands of names and phrases.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　或說名為禪解脫，　　或名根力或菩提。",
        "translation": "Some say it's called liberation from meditation, or it's called faculty power or enlightenment.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　而此根力本無生，　　禪定菩提亦非有，",
        "translation": "But the power of this faculty is fundamentally nonproductive, Nor is enlightenment found in meditation.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　無色無形不可取，　　但以方便示眾生。",
        "translation": "The formless and formless cannot be grasped, but they are shown to sentient beings by skillful means.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　我說修行有所證，　　當知遠離一切相，",
        "translation": "I teach that there’s something to be realized by cultivating practice, which should be known as being free of all characteristics.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若謂於中有所得，　　是則非證沙門果。",
        "translation": "If someone says there's something to be attained here, then they won't realize the fruit of asceticism.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　諸法自性無所有，　　當於何處言得證，",
        "translation": "The self-nature of all things has no existence; Where can one say they are realized?",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　所說得證為無得，　　如是了知乃名得。",
        "translation": "What's said to be attained and realized is non-attainment, and it's called attained when you understand it in this way.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　眾生得果名殊勝，　　我說眾生本不生，",
        "translation": "Sentient beings attain a remarkable fruit. I declare that sentient beings are not born in the first place.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　尚無眾生而可得，　　云何當有得果者？",
        "translation": "If there are no sentient beings yet to be attained, how could there be anyone who will attain the fruit?",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　譬如良田無種子，　　於中終不有牙生，",
        "translation": "It's like a fertile field without seeds That never produces sprouts of tooth.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　如是眾生不可得，　　當於何所而言證？",
        "translation": "Such sentient beings are ungraspable, so where should they be taught and realized?",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　一切眾生性寂滅，　　無有得其根本者，",
        "translation": "All sentient beings are inherently tranquil, No one can get their roots.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若能了知如是法，　　斯人滅度永無餘。",
        "translation": "If someone can understand such a teaching, they'll be liberated forever without remainder.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　過去無數百千佛，　　無有能度眾生者，",
        "translation": "Countless hundreds of thousands of buddhas of the past None could save sentient beings.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若此眾生真實有，　　畢竟無能得涅槃。",
        "translation": "If these sentient beings really exist, there's ultimately no one who can attain nirvāṇa.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　一切諸法皆寂滅，　　未曾有法可生者，",
        "translation": "All things are extinguished, Yet there is no thing that can arise.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若能如是見諸法，　　彼人已出於三界。",
        "translation": "If someone can thus see all dharmas, they've left the three realms.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　是則無礙佛菩提，　　於中究竟無所有，",
        "translation": "This is the unobstructed enlightenment of Buddha, Ultimately nonexistent.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "　若能了知如是法，　　我說名為離欲人。」",
        "translation": "If someone can understand such a teaching, I'll call them people who are free of desire.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言：爾時世尊說此偈已，二百比丘增上慢者，",
        "translation": "It was then that the World-honored One, wanting to elaborate on the meaning of this further, spoke these verses: When the World-honored One had uttered these verses, two hundred monks were arrogant and conceited.",
        "source": "T11n0310_090:0518b02_3"
    },
    {
        "source_sentence": "諸漏永盡心得解脫。",
        "translation": "Their contaminants are permanently ended, and their minds are liberated.",
        "source": "T11n0310_090:0519b08_4"
    },
    {
        "source_sentence": "六萬菩薩得無生忍。",
        "translation": "Sixty thousand bodhisattvas attained the tolerance of nonproduction.",
        "source": "T11n0310_090:0519b09_5"
    },
    {
        "source_sentence": "爾時優波離白佛言：「世尊！",
        "translation": "Upāli then said to the Buddha, Bhagavān!",
        "source": "T11n0310_090:0519b09_6"
    },
    {
        "source_sentence": "當何名此經？",
        "translation": "What is the name of this sutra?",
        "source": "T11n0310_090:0519b10_7"
    },
    {
        "source_sentence": "我等云何奉持？」",
        "translation": "How should we revere it?",
        "source": "T11n0310_090:0519b10_8"
    },
    {
        "source_sentence": "佛告優波離：「此經名為『決定毘尼』，亦名『摧滅心識』，汝應受持。」",
        "translation": "The Buddha told Upāli, This sūtra is called determined vinaya, and it's also called destroying mind and consciousness; you should accept and uphold it.",
        "source": "T11n0310_090:0519b11_9"
    },
    {
        "source_sentence": "佛說此經已，尊者優波離，諸比丘眾，文殊師利并諸菩薩摩訶薩，及一切世間天、人、阿修羅等，",
        "translation": "After the Buddha had taught this sutra, Venerable Upāli, the assembly of monks, Mañjuśrī, and the bodhisattvas, mahāsattvas, gods, humans, asuras, and so forth in all the worlds",
        "source": "T11n0310_090:0519b12_10"
    },
    {
        "source_sentence": "聞佛所說，皆大歡喜，信受奉行。",
        "translation": "Having heard the Buddha’s exhortation, they all rejoiced greatly and accepted it with faith.",
        "source": "T11n0310_090:0519b14_11"
    },
    {
        "source_sentence": "大寶積經卷第九十",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 90",
        "source": "T11n0310_090:0519b16_0"
    }
]