[
    {
        "source_sentence": "大寶積經卷第六十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 64",
        "source": "T11n0310_064:0367b15_0"
    },
    {
        "source_sentence": "北齊三藏那連提耶舍譯",
        "translation": "Northern Qi Tripiṭaka, translated by Nārāyaśas",
        "source": "T11n0310_064:0367b17_0"
    },
    {
        "source_sentence": "菩薩見實會第十六之四龍王授記品",
        "translation": "Chapter Sixteen: The Teaching of the Enlightenment to the Four Dragon Kings",
        "source": "T11n0310_064:0367b18_0"
    },
    {
        "source_sentence": "第七",
        "translation": "the seventh",
        "source": "T11n0310_064:0367b19_0"
    },
    {
        "source_sentence": "爾時難陀優波難陀龍王等九億諸龍，見諸龍女設妙供養，及聞龍女得授記已，",
        "translation": "It was then that Nanda Upananda, the dragon king Upananda, and so forth, as many as nine hundred million dragons, saw the dragon maidens make wonderful offerings to them and heard that the dragon maidens had received their predict",
        "source": "T11n0310_064:0367b20_0"
    },
    {
        "source_sentence": "生希有心未曾有心，作是思惟：「乃至如來、世尊、應、正遍知希有未有，",
        "translation": "They give rise to rare and unprecedented thoughts and think, Even the Tathāgata, Bhagavān, Arhat, Perfectly Enlightened One has rare and unprecedented thoughts.",
        "source": "T11n0310_064:0367b21_1"
    },
    {
        "source_sentence": "以是如來知諸眾生機根深信如來，無有少分不見不聞不證如來正法，是其善說能令大眾聞已現知無有時節，",
        "translation": "Because of this, the enlightened one knows all sentient beings’ faculties and deeply believe in the buddha-teachings. There is no little part of him who does not see or hear or realize the true-dharma of the enlight",
        "source": "T11n0310_064:0367b23_2"
    },
    {
        "source_sentence": "隨機授法必令得果，令諸智者現得證知。",
        "translation": "He teaches the Dharma according to their abilities so that they will surely attain fruition and cause the wise to realize it in the present.",
        "source": "T11n0310_064:0367b25_3"
    },
    {
        "source_sentence": "乃至女人動轉輕躁智慧淺短，猶得解佛所說深法，況餘智者善能安住如來法中諸弟子眾。」",
        "translation": "Even if a woman's movement is slight, agitated, and her wisdom is shallow, she still understands the profound teaching taught by the Buddha, so why wouldn't other wise people be able to skillfully establish themselves in the Tathāgata's",
        "source": "T11n0310_064:0367b26_4"
    },
    {
        "source_sentence": "如諸女人欲心增上、瞋心增上、癡心增上，猶能得知如來所說。",
        "translation": "Just as women's minds of desire increase, anger increase, and delusion increase, they can still know what the Tathāgata teaches.",
        "source": "T11n0310_064:0367b29_0"
    },
    {
        "source_sentence": "是故難陀、優波難陀龍王及諸龍等，於如來所生希有心生未有心，為供養故，",
        "translation": "That's why Nanda, Upananda, the dragon king Upananda, and the other dragons gave rise to rare thoughts that arose in the Tathāgata's mind but didn't give rise to thoughts that didn't arise because",
        "source": "T11n0310_064:0367c01_1"
    },
    {
        "source_sentence": "遍閻浮提諸山大海興雲遍覆一切世間，普雨香水以成香泥。",
        "translation": "The great ocean of mountains that pervaded Jambudvfpa produced clouds covering all worlds, and they rained down fragrant water to form fragrant mud.",
        "source": "T11n0310_064:0367c03_2"
    },
    {
        "source_sentence": "彼香泥氣充滿三千大千佛剎，其中眾生聞香氣者，皆不退於阿耨多羅三藐三菩提。",
        "translation": "The odor of that fragrant mud fills 3,000 great one-thousand buddha bases, and those sentient beings who hear its fragrance don't regress from unsurpassed, correct, or complete enlightenment.",
        "source": "T11n0310_064:0367c04_3"
    },
    {
        "source_sentence": "於迦毘羅城縱廣正等六十由旬，雨赤真珠遍覆其地，復以無價種種眾寶周匝遍覆尼拘陀園。",
        "translation": "The city of Kapilavastu, exactly sixty yojanas long and wide, rained red genuine pearls that covered the ground and covered the park with priceless variety of various treasures.",
        "source": "T11n0310_064:0367c06_4"
    },
    {
        "source_sentence": "復以龍華化成妙堂，縱廣正等六十由旬，椽柱梁壁皆用七寶。",
        "translation": "He also transformed it into a wonderful hall, exactly sixty yojanas in length and width with pillars and beams made of the seven kinds of treasure.",
        "source": "T11n0310_064:0367c08_5"
    },
    {
        "source_sentence": "復更化作無量樂器，為供養故擊出妙音。",
        "translation": "He also transformed himself into an immeasurable musical instrument, and for the sake of making offerings he produced a wonderful sound.",
        "source": "T11n0310_064:0367c10_6"
    },
    {
        "source_sentence": "於彼龍花微妙堂中，化作九億種種雜色眾花旒蘇懸於堂上，以毘琉璃網覆諸寶柱，",
        "translation": "In the subtle hall of the dragon-flowers, he magically produced billions of flowers of various colors and draped them over the hall, covering the jeweled pillars with lapis lazuli nets.",
        "source": "T11n0310_064:0367c11_7"
    },
    {
        "source_sentence": "以無價寶遍布堂下。",
        "translation": "They spread priceless treasures all over the hall.",
        "source": "T11n0310_064:0367c13_8"
    },
    {
        "source_sentence": "其寶柔軟，譬如三十三天般籌緘婆羅石，其石之色如毘琉璃，石觸柔軟如迦遮隣提迦衣，",
        "translation": "The color of the stone is like vaiḍūrya, and when touched by the stone it becomes as soft as a kaṣinīka-robe.",
        "source": "T11n0310_064:0367c13_9"
    },
    {
        "source_sentence": "微妙可樂繫人眼目，令諸天人愛戀繫念。",
        "translation": "It's marvelously pleasing to bind people's eyes and eyes, causing gods and goddesses to love it and think of it.",
        "source": "T11n0310_064:0367c15_10"
    },
    {
        "source_sentence": "彼諸寶等亦復如是。",
        "translation": "So it is with those treasures and so forth.",
        "source": "T11n0310_064:0367c16_11"
    },
    {
        "source_sentence": "彼諸種種摩尼寶中，或有出於涼冷光焰，有出青水、有出赤水、有出白水、有出黃水，",
        "translation": "Among the various kinds of maṇi treasures, there may be blue water, red water, white water, or yellow water.",
        "source": "T11n0310_064:0367c17_0"
    },
    {
        "source_sentence": "或復有出雜色之水，或復有出涼樂之風。",
        "translation": "Sometimes there's water of mixed color that emerges, and sometimes there's a cool breeze that emerges.",
        "source": "T11n0310_064:0367c18_1"
    },
    {
        "source_sentence": "或有寶珠隨諸眾生所須之事皆悉出之，或復有寶出於腴澤，或有摩尼堪為明鏡，",
        "translation": "Some of the jewels were produced according to the needs of sentient beings; some emerged from the fertile soil, and some could be used as mirrors or crystals.",
        "source": "T11n0310_064:0367c19_2"
    },
    {
        "source_sentence": "一切大眾皆現其中，於迦毘羅大城之中所出人民，隨其多少皆現寶中。",
        "translation": "All the masses are shown there, and the people who emerge from the great city of Kapilavastu are shown among the treasures according to their number.",
        "source": "T11n0310_064:0367c21_3"
    },
    {
        "source_sentence": "一切大眾皆悉覩見佛及聲聞。",
        "translation": "All the people in the assembly saw all the buddhas and śrāvakas.",
        "source": "T11n0310_064:0367c23_4"
    },
    {
        "source_sentence": "作此種種神通變化，以彼摩尼寶神力故，於其地中出於種種雜色寶蓋，",
        "translation": "He manifested these various miraculous displays, producing canopies of all kinds of jewels on that earth by the mystic power of those jewels.",
        "source": "T11n0310_064:0367c24_5"
    },
    {
        "source_sentence": "及以種種雜色寶幢，亦有種種雜色寶幡。",
        "translation": "And with various kinds of variegated-colored jeweled banners, there are also various kinds of variegated-colored jeweled banners.",
        "source": "T11n0310_064:0367c25_6"
    },
    {
        "source_sentence": "復出種種雜花旒蘇，亦有種種雜香旒蘇，復有種種雜寶旒蘇，復出種種真珠旒蘇。",
        "translation": "It also produces various kinds of miscellaneous flower garlands, various kinds of miscellaneous fragrant garlands, various kinds of miscellaneous precious garlands, and various kinds of genuine pearl garlands.",
        "source": "T11n0310_064:0367c26_7"
    },
    {
        "source_sentence": "復出種種雜色龍幡，復出種種眾寶鈴網。",
        "translation": "They also produced various kinds of dragon banners of variegated colors and a network of various kinds of jeweled bells.",
        "source": "T11n0310_064:0367c28_8"
    },
    {
        "source_sentence": "復出種種雜色良馬，諸所出者皆是龍力。",
        "translation": "He also produced a variety of good horses of various colors, all produced by the power of the dragon.",
        "source": "T11n0310_064:0367c29_9"
    },
    {
        "source_sentence": "爾時難陀、優波難陀龍王及九億龍，驅彼良馬隨而步行右遶三匝，以妙迦遮隣提迦柔軟之寶而散世尊。",
        "translation": "It was then that Nanda, Upananda, the dragon king Upananda, and  900 million dragons followed him on foot three times to his right, scattered the Bhagavān with the marvelous treasure of Kātyāyanadīka",
        "source": "T11n0310_064:0368a01_10"
    },
    {
        "source_sentence": "於彼堂下地中所出種種眾寶上昇虛空，雨於如來及聲聞上。",
        "translation": "The various treasures produced from the ground beneath that hall rose up into the sky, raining down on top of the Tathāgata and śrāvakas.",
        "source": "T11n0310_064:0368a03_11"
    },
    {
        "source_sentence": "復以諸龍無量樂器，於虛空中自然出好微妙音聲，供養於佛。",
        "translation": "Again, with measureless musical instruments from the dragons, they naturally produced beautiful and subtle sounds in the sky to make offerings to the Buddha.",
        "source": "T11n0310_064:0368a05_12"
    },
    {
        "source_sentence": "爾時九億諸龍遶佛三匝已，在於佛前合掌默然念佛功德，瞻仰如來目不暫捨。",
        "translation": "At the time,  900 million dragons circled the Buddha three times, joined their palms in front of him, silently recited the Buddha's merits, and gazed at the Tathāgata without momentarily relinquishing his eyes.",
        "source": "T11n0310_064:0368a06_13"
    },
    {
        "source_sentence": "樂佛功德，深心安住阿耨多羅三藐三菩提故。",
        "translation": "It's because they delight in the Buddha's virtue and deeply abide in unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_064:0368a08_14"
    },
    {
        "source_sentence": "彼等少時合掌默然念佛功德已，偏袒右肩，右膝著地合掌向佛，五體投地為佛作禮，",
        "translation": "After a short while they joined their palms and remained silent in reverence for the Buddha’s virtue, they bared their right shoulder, knelt with their right knees on the ground, joined their palms facing the Buddha, prostra",
        "source": "T11n0310_064:0368a09_15"
    },
    {
        "source_sentence": "「久修威儀百福相，　　悲心離垢行具足，",
        "translation": "Having cultivated a hundred marks of virtue in deportment for a long time, His compassionate mind is free from impurity and endowed with practice.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　棄捨無盡眾寶地，　　世尊出於迦毘城。",
        "translation": "Rejecting the inexhaustible land of myriad treasures, the Bhagavān emerged from the city of Kapilavastu.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　於六年中修苦行，　　如來不得甘露道，",
        "translation": "In six years of cultivating austerities, the Tathāgata won’t attain the path of immortality.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　善逝意猶不退悶，　　以其久修智慧故。",
        "translation": "The Buddha’s mind is not faint, Because he has cultivated wisdom for a long time.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　如來真是天人師，　　為世間故修苦行，",
        "translation": "The Tathāgata is really a teacher of gods and humans, cultivating austerities for the sake of the world.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　世人聞已尚不堪，　　況復能以目親覩。",
        "translation": "The people of the world can't even hear it, so why wouldn't they be able to see it with their eyes?",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　牟尼過去捨頭目，　　如聖所集菩提心，",
        "translation": "In the past Muni relinquished his head and eyes, As if he had collected the aspiration for enlightenment as a sage.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　我等聞是不生樂，　　由聞如來苦行故。",
        "translation": "We, hearing it, do not give rise to happiness Because we hear about the austerities of the enlightened.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　如佛本作忍辱仙，　　為迦利王截手足，",
        "translation": "Like the Buddha who was originally a sage of tolerance and humility, he cut off his hands and feet for King Kali.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　及劓耳鼻不生恚，　　我等聞是不能忍。",
        "translation": "And the coarse ears and nose don't give rise to coarseness, which we can't tolerate hearing.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　如佛以身上秤盤，　　為鳥歸投不捨棄，",
        "translation": "It is as if the Buddha were to place a scale on one’s body, Like a bird that returns and doesn’t turn away.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　我等聞已亦不樂，　　如來過去甚勤苦。",
        "translation": "Having heard it, we are also not happy: The past of the enlightened ones has been very painful.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　何故我等心不樂？　　以世尊行極苦故，",
        "translation": "Because the World-honored One’s conduct is so painful that we cannot bear it.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　於如來所作惡者，　　墮惡道時佛復悲。",
        "translation": "Those who do evil in the Tathāgata's actions, the Buddha again pitys them when they fall into a bad path.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　具足聖慧大導師，　　云何能行不害心？",
        "translation": "How can a great guide, endowed with noble wisdom, act without harming others?",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　修習道行無瘡疣，　　唯願佛說安樂行。",
        "translation": "Cultivating practice of the path without sores and warts, may only the Buddha teach peaceful practice.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　今此龍眾已發心，　　求於善逝菩提行，",
        "translation": "Now that these dragons have set their minds on enlightenment, They seek the practice of buddhahood.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　如佛所說悉能行，　　唯願速說菩提道。",
        "translation": "As the Buddha teaches, they can practice them all; Please quickly explain the path of enlightenment.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　此諸龍眾甚渴仰，　　唯求不死不生處，",
        "translation": "These dragons all longed for a place where they could not die or be reborn.",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "　願說如來安隱行，　　令此眾生易受化。」",
        "translation": "May I explain the Tathāgata's peaceful practice so that these sentient beings can easily be transformed?",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "眾共一音以偈讚曰：爾時世尊見諸龍眾設其供養及聞發願，知深信已，",
        "translation": "At that moment the World-honored One, seeing the multitude of nāgas and having heard their offerings and undertaken these vows, knew with deep faith:",
        "source": "T11n0310_064:0368a11_16"
    },
    {
        "source_sentence": "佛於爾時現微笑相。",
        "translation": "At that point, the Buddha showed a smile.",
        "source": "T11n0310_064:0368b05_17"
    },
    {
        "source_sentence": "諸佛法爾，若現微笑，即於面門放種種色無量光明，其光遍照上至梵天，",
        "translation": "“Furthermore, as it is the case with all buddhas, when they show a smile their faces radiate countless rays of light of various colors from their mouths. That light reaches up to the Brahma heavens and shines everywhere.",
        "source": "T11n0310_064:0368b05_18"
    },
    {
        "source_sentence": "照已還來從佛頂入。",
        "translation": "After he had illuminated it, he returned and entered from the Buddha's head.",
        "source": "T11n0310_064:0368b07_19"
    },
    {
        "source_sentence": "「善哉沙門大牟尼，　　非是無因現微笑，",
        "translation": "\\",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　慈悲導師唯願說，　　無等善慧笑因緣。",
        "translation": "The Guide of compassion only wishes to explain the causes and conditions for the laughter of incomparable good wisdom.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　大眾瞻仰求欲聞，　　世尊無量功德行，",
        "translation": "The masses looked up to the Buddha and wished to hear. The World-honored One’s virtuous deeds were immeasurable:",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　於笑生疑心不樂，　　唯願法王斷眾疑。",
        "translation": "The thought of doubt that arises from laughter is unhappy, so may the king of the Dharma stop all doubts.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　誰於釋迦佛法中，　　今生敬信心欣喜？",
        "translation": "Who now gives rise to respect, faith, and joy in the teachings of the Buddha Śākyamuni?",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　誰令今日魔波旬，　　心意迷亂不欣樂？",
        "translation": "Who will cause Māra Pāpīyān today's mind to be confused and not delighted?",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　誰於今日能恭事，　　功德法父大導師？",
        "translation": "Who can today honor and serve the great teacher of the virtuous Dharma father?",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　誰作第一勝供養？　　願釋師子上上說。",
        "translation": "Who will be the first to make a superior offering?",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　此諸大眾合指掌，　　皆悉對佛瞻仰住，",
        "translation": "The whole assembly joined their palms in respect, gazing at the Buddha.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　唯願導師除疑網，　　為眾演說笑因緣。",
        "translation": "All we ask, Master, is that you remove the web of doubt by explaining the causes and conditions for laughter for the sake of all.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　大眾聞已生欣喜，　　能知世尊正法教，",
        "translation": "The great assembly, having heard it, is delighted To be able to know the teaching of the Buddha’s truth.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　大智世尊令眾喜，　　隨順正教善安住。」",
        "translation": "The Bhagavān Mahāprajñāpāramitā causes people to rejoice, following the correct teaching and being well-abiding.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "「深廣智慧大眾師，　　說時梵音具八種，",
        "translation": "The profound and extensive wisdom of the great assembly is that when it's taught, the Sanskrit sound has eight kinds.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　清淨其心離穢濁，　　諦聽我說笑因緣。",
        "translation": "Pure, their minds free from defilement, listen closely to my explanation of the causes and conditions for laughing.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　此諸龍王敬信心，　　於我設供超一切，",
        "translation": "These great lords of the nāgas honored me with faith And offered me offerings that surpassed all others.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　是等為求佛菩提，　　利益一切世間故。",
        "translation": "They seek the Buddha’s enlightenment, Benefiting all beings in all worlds.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　悲心增上觀眾生，　　無有導師云何樂？",
        "translation": "With a compassionate mind that increases in sentient beings, how can there be happiness if there's no guide?",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　我云何得大菩提，　　成熟眾生不疲勞？",
        "translation": "How can I attain great enlightenment and ripen sentient beings without weariness?",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　深樂寂定具智慧，　　乘安樂乘心清淨，",
        "translation": "Deeply delighted in peaceful concentration, endowed with knowledge and wisdom, Their minds riding the vehicle of well-being are pure.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　於空無相及無願，　　無量劫來久已修。",
        "translation": "In emptiness, signlessness, and wishlessness, they've cultivated it for measureless eons.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　其心平等觀世間，　　如佛所得智慧相，",
        "translation": "Their minds observe the world equally, Like the Buddha’s wisdom-characteristic.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　慈悲喜心皆平等，　　為令世間安隱故。",
        "translation": "The minds of kindness, pity, compassion, and joy are all equal, because they want to make the world peaceful.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　第一悲心憐愍者，　　當得作佛稱其意，",
        "translation": "The first is compassionate, pitying those who can become buddhas and praise their intentions.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　彼等觀察世間已，　　當成導師號無怨。",
        "translation": "Having observed the world, they'll become a guide named No Enemy.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　彼等當得甘露時，　　無有魔怨亦無餘，",
        "translation": "When they attain the ambrosia, there's no Māra or enemy and nothing left.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　恒常演說無我法，　　一向無有世俗說。",
        "translation": "Always and always expounding the teaching of selflessness, There's nothing worldly to say about it.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　彼諸如來具大悲，　　令諸眾生入佛智，",
        "translation": "The enlightened ones, imbued with great compassion, Cause sentient beings to enter buddha-knowledge.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　是諸善逝說法時，　　一切眾生皆信解。",
        "translation": "When these saints teach the Dharma, All sentient beings believe and understand it.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　彼等世世修道時，　　成熟眾生不為難，",
        "translation": "When they cultivate their paths from generation to generation, It is not difficult to mature sentient beings.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　彼所成熟聞法已，　　當得解脫證甘露。",
        "translation": "Having heard the teaching, they'll attain liberation and realize the ambrosia of immortality.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　諸聞法者悉解脫，　　是諸眾生皆端嚴，",
        "translation": "Those who hear the Dharma are all liberated. All these sentient beings are endowed with dignity.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　一切眾生皆能知，　　彼諸如來所說法，",
        "translation": "All sentient beings can know The teachings of those buddhas.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　一切鬼神及畜生，　　無有不解彼佛語，",
        "translation": "No demons, spirits, or animals Can’t help understanding the Buddha’s words.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　一切皆得念法已，　　能解如來甘露法。",
        "translation": "They all attain mindfulness of the teaching and are able to understand the Buddha’s ambrosia of truth.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　無有眾生聞佛說，　　當時不生愛樂心，",
        "translation": "No sentient being hears the Buddha’s teaching, Yet they do not give rise to thoughts of desire or joy.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　愛樂彼佛所說者，　　一切皆悉得甘露。",
        "translation": "Those who delight in what the Buddha teaches They'll all attain ambrosia.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　彼時所有受化者，　　當得解脫生老病，",
        "translation": "Those who receive instruction at that point Will be liberated from the sicknesses of birth, old age and sickness.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　及解脫死憂悲苦，　　聞佛說已心無垢。」",
        "translation": "And liberation from the sorrow and suffering of death, his mind is unsullied after hearing the Buddha teach it.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　如是釋迦牟尼佛，　　說諸龍意答佛子，",
        "translation": "Thus did the Buddha Śākyamuni explain to the dragons what he meant by answering the Buddha-child.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　如彼堅智心中轉，　　為得無等菩提故。",
        "translation": "As they develop in their minds with firm knowledge, They attain peerless enlightenment.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　如來授彼諸龍記，　　大眾聞已皆欣喜，",
        "translation": "The Tathāgata granted the prediction to those dragons, and the masses who heard it rejoiced.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "　大眾喜已歸依佛，　　一切皆悉心寂靜。",
        "translation": "The great multitude of people who have relied on the Buddha’s joy Are all at peace in their minds.",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "爾時慧命馬勝比丘以偈問曰：爾時世尊以偈答慧命馬勝曰：鳩槃茶授記品第八爾時復有諸鳩槃茶一億八千萬，",
        "translation": "It was then that the monk Wisdom-Life Ma勝 asked in verse, The Bhagavān answered Wisdom-Life Ma勝 in verse:",
        "source": "T11n0310_064:0368b07_20"
    },
    {
        "source_sentence": "見諸阿修羅、伽樓羅、龍女、龍王等，供養如來聞授記已，稱其心意踊躍欣喜，",
        "translation": "Seeing the asura demons, garuḍas, nāgas, nāga maidens, nāga kings, and so forth, they honored the Tathāgata. Having heard his prediction, they all rejoiced and danced to their heart",
        "source": "T11n0310_064:0368c24_21"
    },
    {
        "source_sentence": "生希有心得未曾有：「如來世尊功德智慧微妙殊勝，得如是等希有供養不怪不喜，",
        "translation": "It gave rise to an unprecedented feeling of wonder, saying, “The Bhagavat, the Tathāgata, whose virtue and wisdom are so subtle and marvelous that they attain such rare offerings without wonder or rejoicing.",
        "source": "T11n0310_064:0368c26_22"
    },
    {
        "source_sentence": "以佛智慧於諸智慧最尊勝故。",
        "translation": "It's because the Buddha's wisdom is the most superior of all wisdoms.",
        "source": "T11n0310_064:0368c28_23"
    },
    {
        "source_sentence": "譬如大海不增不減。",
        "translation": "It's like the great ocean that doesn't increase or decrease.",
        "source": "T11n0310_064:0368c29_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_064:0368c29_25"
    },
    {
        "source_sentence": "以深廣故。",
        "translation": "It's because of its depth and breadth.",
        "source": "T11n0310_064:0368c29_26"
    },
    {
        "source_sentence": "如是世尊得勝供養心無增減，亦復如是。",
        "translation": "So it is with the Bhagavān who has attained superior offerings without increase or decrease in his mind, and so it is likewise.",
        "source": "T11n0310_064:0369a01_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_064:0369a01_1"
    },
    {
        "source_sentence": "於一切法無所疑故。」",
        "translation": "It's because there's no doubt about all dharmas.",
        "source": "T11n0310_064:0369a02_2"
    },
    {
        "source_sentence": "爾時一億八千萬鳩槃茶等為供養故，化作一億八千萬蓋，皆是七寶之所成就，",
        "translation": "At that time one hundred million eighty thousand koṭis of kumbhāṇḍas and so forth were magically created as offerings, producing one hundred million eighty thousand canopies, all made by the seven treasures.",
        "source": "T11n0310_064:0369a02_3"
    },
    {
        "source_sentence": "金線寶蓋、銀線寶蓋、毘琉璃線眾寶之蓋、頗梨珠線眾寶之蓋、赤真珠線眾寶之蓋、馬瑙珠線眾寶之蓋、車璩珠線眾寶之蓋。",
        "translation": "They had jeweled canopies made of gold thread, silver thread, vaiḍūrya thread, pārijātaka thread, red pearl thread, agate thread, and emerald thread.",
        "source": "T11n0310_064:0369a04_4"
    },
    {
        "source_sentence": "彼諸鳩槃茶於眾寶蓋懸寶旒蘇，有種種色，金線寶蓋銀線旒蘇，銀線寶蓋金線旒蘇，",
        "translation": "Ānanda, those kumbhāṇḍas hung jeweled silk canopies of various colors over the tops of their parasols. The golden thread was covered with jeweled canopies, while silver thread was covered with jeweled cano",
        "source": "T11n0310_064:0369a07_5"
    },
    {
        "source_sentence": "毘琉璃蓋頗梨旒蘇，頗梨寶蓋毘琉璃線以為旒蘇，赤真珠蓋車璩旒蘇，",
        "translation": "The vaiḍūrya canopy is made of pārijātaka, the pārijātaka canopy is made of vaiḍūrya thread, and the mahogany canopy is made of chariot.",
        "source": "T11n0310_064:0369a09_6"
    },
    {
        "source_sentence": "車璩寶蓋赤真珠線以為旒蘇，馬瑙寶蓋頗梨旒蘇。",
        "translation": "The jeweled canopy of the chariot is made of red genuine pearls, while the canopy of the horse agate is made of pārijātaka.",
        "source": "T11n0310_064:0369a10_7"
    },
    {
        "source_sentence": "又復化作一億八千萬眾寶之車，亦種種色甚奇微妙，所謂金、銀、琉璃、頗梨、真珠、車璩、馬瑙。",
        "translation": "He also transformed into one hundred million and eighty thousand carriages made of various treasures, with a variety of colors that were very rare and subtle, such as gold, silver, lapis lazuli, crystal, genuine pearls, chariots",
        "source": "T11n0310_064:0369a12_0"
    },
    {
        "source_sentence": "於其車上復更化作一億八千萬眾寶之蓋與車相連，一一寶蓋皆有百子，",
        "translation": "On top of that cart, he also magically produced another hundred million or eighty-thousand thousand jeweled canopies to link up with the cart. Each jeweled canopy had a hundred pieces on it.",
        "source": "T11n0310_064:0369a14_1"
    },
    {
        "source_sentence": "其諸蓋莖皆用金銀及以頗梨毘琉璃等。",
        "translation": "The stems of the canopies are made of gold, silver, pārijāla, and so forth.",
        "source": "T11n0310_064:0369a15_2"
    },
    {
        "source_sentence": "於彼寶蓋復化種種寶花旒蘇嚴飾其蓋，所謂金花旒蘇、銀花旒蘇、毘琉璃花以為旒蘇、頗梨旒蘇、赤寶旒蘇、龍珠旒蘇、赤真珠花以為旒蘇，",
        "translation": "On that precious canopy, he also transformed various kinds of precious flowers and silk fabrics to adorn the canopy, which were called gold-flower silk fabrics, silver-flower silk fabrics, vaiḍūrya-flower",
        "source": "T11n0310_064:0369a16_3"
    },
    {
        "source_sentence": "復以赤真珠網彌覆其上。",
        "translation": "Again, he covered it with a net of red genuine pearls.",
        "source": "T11n0310_064:0369a19_4"
    },
    {
        "source_sentence": "又復化作鳩槃茶樂，出種種聲而用樂佛。",
        "translation": "Again, he transforms into the music of kumbhāṇḍa and produces various sounds to please the Buddha.",
        "source": "T11n0310_064:0369a20_5"
    },
    {
        "source_sentence": "復更化作一億八千萬眾寶色馬，調伏駿疾以駕其車。",
        "translation": "Again, he transformed into a hundred million or eighty-thousand thousand multicolored horses of various jewels and tamed Shun's illness to drive his chariot.",
        "source": "T11n0310_064:0369a21_6"
    },
    {
        "source_sentence": "爾時鳩槃茶等各乘寶車遶佛三匝，以七寶花而散佛上。",
        "translation": "It was then that the kumbhāṇḍa and others each rode a jeweled chariot three times around the Buddha and scattered seven-jeweled flowers over him.",
        "source": "T11n0310_064:0369a22_7"
    },
    {
        "source_sentence": "爾時彼諸鳩槃茶等從車而下來至佛前，頭面禮已，復遶三匝，曲躬合掌住立一面，",
        "translation": "It was then that those kumbhāṇḍas descended from their chariots and came before the Buddha. Having saluted him by bowing their foreheads and faces, they circumambulated him three times, folded their bodies, joined their",
        "source": "T11n0310_064:0369a23_8"
    },
    {
        "source_sentence": "「不增不減大牟尼，　　譬如須彌諸山王，",
        "translation": "Great Sage neither increases nor decreases, Like the mountains on the polar mountain.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　受此無上供養者，　　如來以得無畏故。",
        "translation": "Those who receive this unsurpassed offering are the Tathāgatas because they attain fearlessness.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　觀諸眾生但有名，　　及但有用不取著，",
        "translation": "He observes that all sentient beings merely have names And only function, not grasping or clinging.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　導師以修寂滅定，　　是故智者無貢高。",
        "translation": "Because the Guide cultivates the concentration of extinction, That's why the wise man has no pride in being arrogant.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　牟尼知世猶如幻，　　亦如夢中受欲樂，",
        "translation": "The Sage knows the world is like an illusion, Like a dream in which one experiences pleasure and desire.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　復似水月春時焰，　　如是觀察悉無餘。",
        "translation": "It's also like the springtime flame of the water moon, thus observing it in this way without remainder.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　譬如乾城無有實，　　於十方求不可得，",
        "translation": "It's like a dry city that has no substance, which can't be sought in ten directions.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　其城無實但有名，　　佛見世法悉如是。",
        "translation": "That city has no substance but names: So do the Buddhas see things in the world as they are.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　一切人天所供養，　　寶車寶蓋及音樂，",
        "translation": "All the offerings offered by humans and gods Are jeweled carts, jeweled canopies, and music.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　幢花旒蘇合掌等，　　世尊觀知如影響。",
        "translation": "Banners, flowers, garlands, palms joined, and so on: The World-honoured One perceived them as influences.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　我等設是供養已，　　願我當來得作佛，",
        "translation": "Having offered these offerings, may I become a buddha in the future!",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　亦願我知世如夢，　　知已說法如世尊。",
        "translation": "May I also know that the world is like a dream, and know that I've explained the teaching as the Bhagavān.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　我等見諸苦惱者，　　生老病死之所逼，",
        "translation": "We see all kinds of suffering, oppressed by birth, old age, illness, and death.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　願知無死佛菩提，　　說令聞者得解脫。",
        "translation": "May you know the enlightenment of the nondeathless Buddha and explain it so that those who hear will attain liberation.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　於諸無智眾生所，　　願得菩提為說法，",
        "translation": "In the presence of ignorant sentient beings They vow to attain enlightenment and teach the Dharma for them.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "　演說無有垢濁法，　　無道眾中為作導。」",
        "translation": "He teaches the Dharma that's without defilement and serves as a guide among the many who lack the path.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "以偈讚曰：爾時世尊知諸鳩槃茶等深生信已，現微笑相。",
        "translation": "The Bhagavān then knew that the kumbhāṇḍas and others had deep faith, and they showed a smile.",
        "source": "T11n0310_064:0369a25_9"
    },
    {
        "source_sentence": "「佛非無因現微笑，　　不怪一切為希有，",
        "translation": "The Buddha does not show a smile for no reason, Nor does he wonder that all things are rare.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　如來不怪而現笑，　　我今願聞此因緣。",
        "translation": "The Tathāgata doesn't wonder but shows a smile, and now I want to hear about this cause and condition.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　一切天人皆有疑，　　見佛口中現微笑，",
        "translation": "All the gods and humans all had doubts, Seeing the Buddha smile in their mouths.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　唯願斷除諸疑網，　　演說世尊微笑事。",
        "translation": "All we ask is that you remove the web of doubt and explain the smiling deeds of the World-honored One.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　誰於正法得深信？　　誰能如法見慈父？",
        "translation": "Who will attain deep faith in the true teaching, and who can see their loving father according to the teaching?",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　誰佛所讚行供養？　　人中勝者我願聞。",
        "translation": "Who among the buddhas will praise and make offerings to them? I wish to hear of the best among men.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　今日誰於有為行，　　見其過患能棄捨？",
        "translation": "Who today is able to abandon conditioned phenomena, seeing their faults and distress?",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　今日誰能住實際？　　清淨心者我願聞。",
        "translation": "Who will be able to abide in reality today?",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　誰能降魔及眷屬？　　誰能令佛心欣喜？",
        "translation": "Who can subdue Māra and his retinue, or make the Buddha’s mind glad?",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　誰能得深有為底？　　我願得聞斷疑心。",
        "translation": "Who will be able to attain the profound foundation of conditioned existence?",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　一切大眾合掌住，　　為聞如來笑因緣，",
        "translation": "All the great assemblies stood with joined palms to hear the reasons why the Buddha smiled.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　願斷一切眾生疑，　　兩足尊者說彼記。」",
        "translation": "May all sentient beings' doubts be stopped, and the two-legged honored one will explain their assurance.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "「善哉馬勝問是義，　　汝於世間大利益。",
        "translation": "“Good, Mañjuśrī, this is what you mean by asking such questions, which will greatly benefit the world.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　以汝問笑因緣故，　　諦聽馬勝我今說。",
        "translation": "Because you're asking about the causes and conditions for your laughter, listen closely to what I'll explain now.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　鳩槃茶眾供養我，　　於寂滅法心得住，",
        "translation": "The assembly of kumbhāṇḍas offered support to me, Abiding with minds and hearts in the teaching of extinction.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　彼等見我不驚怪，　　心生希有起願求。",
        "translation": "Seeing that I'm not frightened, their minds become rare and they give rise to aspirations.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　彼等今日供養我，　　其心簡擇寂滅法，",
        "translation": "Today they honor me with offerings, Their minds reflecting on the way to enter nirvana.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　以深心信起大悲，　　於失道者能作道。",
        "translation": "With deep faith, they give rise to great compassion and are able to create the path for those who lose it.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　愍眾生故供養我，　　為失道者起慈心，",
        "translation": "Because of pity for sentient beings, they offer support to me. For the sake of those who have lost their way, they give rise to compassion.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　此等賢智作是已，　　得捨鬼身生忉利。",
        "translation": "After these wise and virtuous people did so, they were able to abandon the ghost's body and give rise to debilitating tendencies.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　天主恒以慈悲心，　　在天數數教導彼，",
        "translation": "The lord of the gods always, with kindness and compassion, taught them in heavenly realms.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　彼於諸法得無疑，　　得為帝釋親眷屬。",
        "translation": "They attain no doubt about the teachings and become Indra's relatives and retinues.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　彼於無量恒沙劫，　　一一國土行佛行，",
        "translation": "For innumerable kalpas they practiced buddha-practice In each and every land.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　被大弘誓堅固鎧，　　供養具大正法者。",
        "translation": "Being armed with a great vow, he makes offerings to those who possess the great true teaching.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　彼於無量諸國土，　　心無疲倦令清淨，",
        "translation": "In countless lands They purify their minds without weariness or weariness.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　利益大眾作導師，　　當得作佛號不怪。",
        "translation": "Benefiting the masses to become guides, they'll be able to become buddhas without wonder.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　彼於諸國行行時，　　是國人必知成佛，",
        "translation": "When they practice in various countries, The people of those countries will surely know that they’ve become buddhas.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　以此方便未來世，　　雖度眾生無怪心。",
        "translation": "With this method, he'll save sentient beings in the future, even though he doesn't have a strange mind.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　為求無上安隱道，　　淨諸國土都不怪，",
        "translation": "In order to seek the supreme path of peace, They purify all lands without wonder.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　於所作事心無著，　　於大菩提亦如是。",
        "translation": "Their minds have no attachment to what they do, And so it is with great enlightenment.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　所問笑因我已答，　　眾生疑心皆得斷，",
        "translation": "The laughter that’s being asked is the result of my answer, and all sentient beings’ doubts are stopped.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "　大眾離疑得欣喜，　　以定得知彼供養。」",
        "translation": "The masses are free of doubt and rejoice, knowing with certainty that they're making offerings.",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "爾時慧命馬勝比丘以偈問曰：爾時世尊以偈答慧命馬勝言：乾闥婆授記品第九爾時復有三億六千萬乾闥婆眾，",
        "translation": "It was then that the monk Wisdom-Life Ma Śrīmālā asked in verse, The Bhagavān answered Wisdom-Life Ma Śrīmālā in verse:",
        "source": "T11n0310_064:0369b15_10"
    },
    {
        "source_sentence": "見諸阿修羅、迦樓羅、龍女、龍王、鳩槃茶等，供養世尊聞受記已，稱其心意欣喜踊悅，",
        "translation": "Having seen the asura demons, garuḍas, nāgas, nāga maidens, nāga kings, kumbhāṇḍa gods, and so forth, they honored the World-honored One by congratulating him on having heard his",
        "source": "T11n0310_064:0369c21_11"
    },
    {
        "source_sentence": "生希有心得未曾有，歎言：「希有未曾有事。",
        "translation": "He gave rise to a rare feeling of unprecedentedness and praised it, saying, Rarely, there's an unprecedented thing.",
        "source": "T11n0310_064:0369c23_12"
    },
    {
        "source_sentence": "乃至如來所說法界無有變異而示有作善根增長，雖無作者而示作業。」",
        "translation": "Even the Tathāgata teaches that there's no change in the Dharma realm as explained by the Tathāgata and shows the growth of good roots that are created, even though there's no author, and he shows actions.",
        "source": "T11n0310_064:0369c24_13"
    },
    {
        "source_sentence": "彼乾闥婆等於此法中如是知已，於如來所心生尊重，發阿耨多羅三藐三菩提心。",
        "translation": "Having thus known this teaching, the gandharvas and so forth, they become respectful to the Tathāgata and give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_064:0369c26_14"
    },
    {
        "source_sentence": "彼欣喜已為供佛故，化作三億六千萬頭㖶羅婆那大龍象王，皆有六牙。",
        "translation": "Being delighted, they made offerings to the Buddha and transformed themselves into three hundred million sixty thousand-thousand great dragon elephant kings with six tusks.",
        "source": "T11n0310_064:0369c28_15"
    },
    {
        "source_sentence": "一一牙上化作七池，一一池中化七蓮花，一一蓮花化作千葉，一一葉上化七玉女，",
        "translation": "On each tooth he magically created seven ponds, and in each pond he magically produced seven lotus blossoms. Each lotus blossom magically produced a thousand petals, and on each petal he magically produced seven jadelike mai",
        "source": "T11n0310_064:0369c29_16"
    },
    {
        "source_sentence": "一一葉間化七侍女，以天諸寶為莊嚴具而用莊飾，復執天香而用供養。",
        "translation": "Each leaf transformed seven maidservants, adorned with celestial treasures as ornaments and carrieding heavenly incense as offerings.",
        "source": "T11n0310_064:0370a02_17"
    },
    {
        "source_sentence": "復於一一㖶羅婆那象王頭上化作三億六千萬蓋，七寶旒蘇懸蓋四邊，七寶羅網以覆蓋上。",
        "translation": "Again, on the heads of each royal elephant king he magically produced three hundred million sixty thousand canopies, draped with seven-jeweled silk cloth hanging four sides, and covered with a net of seven-jeweled sil",
        "source": "T11n0310_064:0370a04_18"
    },
    {
        "source_sentence": "復於一一㖶羅婆那象王頭上化作三億六千萬帳，皆是諸天妙香所成，繒綵旒蘇懸帳四邊。",
        "translation": "Again, on the heads of each of the three hundred million sixty-thousand thousand drapes created by the elephant king Brahmadeva, they are all made from the wonderful fragrance of the gods, draped with silk and woolen curta",
        "source": "T11n0310_064:0370a06_19"
    },
    {
        "source_sentence": "化作三億六千萬頭㖶羅婆那大象王已，彼乾闥婆等各乘其象鼓天音樂，",
        "translation": "After they had transformed themselves into three hundred million sixty-thousand thousand elephant kings, each of them riding on their elephant drums and celestial music like that of the gandharvas.",
        "source": "T11n0310_064:0370a08_20"
    },
    {
        "source_sentence": "於虛空中旋遶如來三十六匝，以天旃檀末、天沈水末、天多摩羅葉末、天真金末、曼陀羅花、摩訶曼陀羅花、曼殊沙花、摩訶曼殊沙花、波樓沙花、摩訶波樓沙花、迦迦羅婆花、摩訶迦迦羅婆花，",
        "translation": "He circled the Buddha in space thirty-six times, producing clouds of heavenly sandalwood powder, heavenly water powder, heavenly palm oil powder, heavenly gold powder, maṇḍala flowers, mahāmandārava flowers, manjus",
        "source": "T11n0310_064:0370a10_21"
    },
    {
        "source_sentence": "又復化作七寶之花而散佛上。",
        "translation": "Again, he transformed himself into a flower of the seven treasures and scattered it over the Buddha.",
        "source": "T11n0310_064:0370a14_22"
    },
    {
        "source_sentence": "彼乾闥婆等散香花時，是香花氣逆風順風縱橫皆去。",
        "translation": "When those gandharvas and so forth scatter fragrant flowers, these fragrant flowers go against the wind and follow the wind, going horizontally and vertically.",
        "source": "T11n0310_064:0370a15_23"
    },
    {
        "source_sentence": "復雨種種天妙香水，雨香水時於迦毘羅城縱廣正等六十由旬皆成香泥。",
        "translation": "It also rains various kinds of heavenly fragrant perfume, and when it rains perfume, the city of Kapilavastu, exactly 60 yojanas long and wide, becomes fragrant mud.",
        "source": "T11n0310_064:0370a16_24"
    },
    {
        "source_sentence": "其香泥氣，充滿三千大千世界，其中眾生聞香氣者，皆悉不退阿耨多羅三藐三菩提。",
        "translation": "The fragrance of that fragrance filled the 3,000 great one-thousand worlds, and all the sentient beings in those worlds who heard its fragrance didn't regress from unsurpassed, correct, or complete enlightenment",
        "source": "T11n0310_064:0370a18_25"
    },
    {
        "source_sentence": "奏音樂時，其諸音聲遍滿三千大千世界，其中眾生聞此聲者亦得不退阿耨多羅三藐三菩提。",
        "translation": "When the music is played, its sounds pervade 3,000 great one-thousand worlds, and those sentient beings who hear these sounds will also attain unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T11n0310_064:0370a20_26"
    },
    {
        "source_sentence": "如是一一諸乾闥婆，各於三億六千萬象王頭上設其供養，令諸玉女有作樂者、有作歌者、有作舞者。",
        "translation": "Thus, each of these gandharvas made offerings on the heads of 3,000,000,000 elephant kings, so that the jade maidens would have musicians, singers, and dancers.",
        "source": "T11n0310_064:0370a22_27"
    },
    {
        "source_sentence": "彼諸玉女作歌舞時，令諸大眾一心觀望。",
        "translation": "When those jade maidens sing and dance, they cause the masses to singlemindedly look out for them.",
        "source": "T11n0310_064:0370a24_28"
    },
    {
        "source_sentence": "復有玉女動身手者、散旃檀末者、散沈水末者，廣作供養如阿修羅所設之事等無異也。",
        "translation": "Again, there's the jadelike woman who moves her body and hands, spreads sandalwood powder, and spreads sunken water powder, making extensive offerings like the things that the asura set up, which are no different.",
        "source": "T11n0310_064:0370a25_29"
    },
    {
        "source_sentence": "爾時乾闥婆等各乘㖶羅婆那大象王頭，於虛空中遶佛三十六匝已，各從象下復遶三匝，",
        "translation": "It was then that the gandharvas and so forth each rode on the heads of the great elephant king Uravāṇa, circled the Buddha in space thirty-six times. Each came down from the elephant and circled him three",
        "source": "T11n0310_064:0370a27_30"
    },
    {
        "source_sentence": "「世尊勝慧出有頂，　　自既出已復度他，",
        "translation": "Bhagavān, the supreme wisdom of the World-honored One emanates from the summit of existence. Having emanated it himself, he saves others.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　一切世間無如佛，　　相好光顏極端正。",
        "translation": "All the worlds are not like buddhas: Their features, beauty, radiance, and countenance are supremely correct.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　人中最妙無邊稱，　　示現世間不思議，",
        "translation": "The most sublime and boundless praise among men, Manifesting inconceivably many worlds.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　不見一法性相異，　　而令眾生住於善。",
        "translation": "They do not see the inherent characteristics of a single doctrine as different, Yet cause sentient beings to abide in goodness.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　無有變異真如法，　　但有言說無餘義，",
        "translation": "The teaching of unchanging reality is only verbal, with no other meaning.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　無有用事及用者，　　雖然佛化諸群生。",
        "translation": "There's no use for anything and nothing useful, though the Buddha transforms all sentient beings.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　不來不去亦不生，　　佛能演說如是法，",
        "translation": "They do not come, do not go, and do not arise: The Buddha can expound such teachings.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　雖說諸法體性空，　　世雄而令修習道。",
        "translation": "Even though they teach that the essence of all dharmas is emptiness, the world heroes cause them to cultivate the path.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　無有一法能自作，　　世間明者說有作，",
        "translation": "There is not a single thing that can be done by itself: The wise of the world say it is done.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　諸法各各不覺知，　　世尊示現一切作。",
        "translation": "Each of the teachings doesn't perceive them, and the Bhagavān shows all actions.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　如車多集眾分支，　　彼支不知自能作，",
        "translation": "Like a cart that collects many parts and components, That part doesn’t know it can make itself.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　其車功用現可見，　　佛說諸法亦如是。",
        "translation": "The power of that cart is visible in the present, And so are the teachings taught by the Buddha.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　諸法各各不相教，　　亦不迭互相覺寤，",
        "translation": "Each of the teachings doesn’t teach others, Nor does they mutually perceive each other.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　一切亦復不相依，　　法本不生亦不死。",
        "translation": "All also do not rely on each other: The fundamental nature of things does not arise and does not die.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　佛為世諦如是說，　　世諦諸法不全無，",
        "translation": "The Buddha teaches the conventional truth in this way: The things of the conventional truth are not completely nonexistent.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　如世諦法體性住，　　如是知已為眾說。",
        "translation": "Just as the essence of worldly truth abides in dharmas, so they know and explain it to others.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　世尊如是說諸法，　　大悲所作甚奇特，",
        "translation": "The World-honored One has taught the Dharma in this way, and what he does with great compassion is most extraordinary.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　諸法體性不可見，　　如來方便說其性。",
        "translation": "The essence of dharmas cannot be seen: The Enlightened One skillfully explains their nature.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　我等願作無邊稱，　　具百福相大導師，",
        "translation": "We wish to make boundless praises, Endowed with the marks of a hundred virtues, as great leaders.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　大悲利益諸世間，　　願作世親如今佛。",
        "translation": "Great compassion benefits all the worlds, wishing to become worldly relatives of the present Buddha.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　我等願於闇障者，　　隨順貪駃欲流者，",
        "translation": "We entreat those who are hindered by the darkness of ignorance To follow the stream of greed, hatred, and desire.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　渴愛所纏百苦者，　　救濟度脫如世尊。",
        "translation": "The one who suffers from the hundred pains of craving is like the Bhagavān who saves and liberates those who are tethered by craving.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　我等願於眾苦者，　　不見彼岸魔縛者，",
        "translation": "We entreat you not to let us see those who are bound by the devils on the other side of the sea.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　走如猨猴輕躁者，　　救濟度脫如世尊。",
        "translation": "He walks like a rhesus monkey that's light and agitated, and he saves and liberates them like the Bhagavān.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　我等願於盲冥者，　　六趣往來疲勞者，",
        "translation": "We pray that those in the darkness of blindness, Those in the six realms of rebirth, Who are exhausted by past and future sufferings,",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "　於己自壞業果者，　　救濟度脫如世尊。」",
        "translation": "Those who destroy the results of their own actions will be saved and liberated like the Bhagavān.",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "頭面禮佛曲躬合掌，在一面住，以偈讚曰：爾時世尊知彼三億六千萬乾闥婆眾深生信已，",
        "translation": "Then the World-honored One, bowing his forehead to the Buddha’s feet and joining his palms, stood to one side and praised him in verse: At that time the World-honored One knew that those three hundred million sixty thousand my",
        "source": "T11n0310_064:0370a29_31"
    },
    {
        "source_sentence": "現微笑相。",
        "translation": "He shows the characteristic of smiling.",
        "source": "T11n0310_064:0370b29_32"
    },
    {
        "source_sentence": "「無邊威德現微笑，　　導師如是非無因。",
        "translation": "Boundless is the authoritative virtue of showing a smile, and the guide's right and wrong have no cause.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　願佛速說此因緣，　　斷除眾生諸疑網。",
        "translation": "May the Buddha quickly explain these causes and conditions, cutting off sentient beings’ web of doubt.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　今見世尊微笑已，　　大眾皆悉為疑網，",
        "translation": "Seeing the World-honored One’s smile, The entire assembly was filled with doubt.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　一切願聞微笑義，　　唯願大悲斷眾疑。",
        "translation": "All wish to hear the meaning of smiling, but may great compassion end all doubts.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　誰於佛法生敬信？　　能得離於諸疑網？",
        "translation": "Who will give rise to respect and faith in the Buddha’s teaching, freeing themselves from the web of doubt?",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　佛知眾生深信已，　　人天勝者故現笑。",
        "translation": "Knowing that sentient beings have deep faith, the Buddha shows a smile because humans and gods are superior.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　誰有智慧能隨順，　　如來所說真如法，",
        "translation": "Who is wise enough to follow the true teaching taught by the Enlightened?",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　知其念慧解行已？　　在大眾中現微笑。",
        "translation": "Knowing the practice of mindfulness, wisdom, and understanding, he smiles in the midst of the masses.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　一切大眾無異心，　　唯欲樂聞雄猛說，",
        "translation": "All the great assemblies have no different minds, Only desiring to hear heroic discourse.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　合十指掌在首頂，　　一心瞻仰如來面。",
        "translation": "He joins his palms at the top of his head with ten fingers, gazing singlemindedly at the Buddha’s face.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　離諸穢濁無憂慮，　　世眼現在故欣喜，",
        "translation": "Being free of defilement and without sorrow, the worldly eye being present, they rejoice.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　為除一切心疑惑，　　願大悲說笑因緣。」",
        "translation": "In order to remove all doubt and confusion in their minds, may they explain the causes and conditions for laughing with great compassion.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "「我所現笑為世故，　　善哉汝問正是時，",
        "translation": "Good, good! It is the right time for you to question me.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　大眾善根當增長，　　為我微笑授記事。",
        "translation": "The roots of goodness of the masses will grow, and you'll smile and give me this article.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　馬勝諦聽我所說，　　導師所現此微笑，",
        "translation": "Great horse, listen attentively to what I say. The Guide shows you this smile:",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　我今當正說彼義，　　汝應欣喜聽我說。",
        "translation": "I will now explain exactly what they mean, and you should be delighted to hear me explain it.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　乾闥婆王敬信佛，　　其心清淨生欣喜，",
        "translation": "The king of Gandhāra had faith in the Buddha, And his mind was pure and joyous.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　依於實法入法已，　　於佛正法生希奇。",
        "translation": "Relying on the true teaching and entering the teaching, they give rise to wonder at the Buddha's right teaching.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　諸法寂滅安不動，　　此等大眾趣實際，",
        "translation": "The dharmas are tranquil, peaceful, and unmoving. These masses of people are headed for the realm of reality.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　如乾闥城如是入，　　供養於我無有等。",
        "translation": "Like the city of dry space, like this entry, there's no equal to making offerings to me.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　如是諸法無有生，　　一切亦復不盡滅，",
        "translation": "Thus these things have no birth, And all also do not perish.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　大眾思惟如幻住，　　未能解了生疑惑。",
        "translation": "The masses contemplate like illusions, unable to understand and give rise to doubt.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　不可說法方便說，　　我以真實故如是，",
        "translation": "You cannot teach the Dharma by means of skillful means. Because it is true, I am like this.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　彼等入我正法已，　　乘大龍象供養佛。",
        "translation": "Having entered my true teaching, they ride great dragons and elephants to make offerings to the Buddha.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　觀察菩提無生滅，　　乾闥婆王供養我，",
        "translation": "Observing enlightenment without arising or ceasing, King Gandhārava makes offerings to me.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　悲愍愚迷眾生等，　　是故求大一切智。",
        "translation": "Compassion, pity, folly, delusion, sentient beings, and so forth therefore seek great omniscience.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　彼等發願當作佛，　　令諸愚迷失智者，",
        "translation": "They make the vow to become buddhas, Causing the ignorant to lose their wisdom.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　入真實法安住已，　　使得不死寂滅句。",
        "translation": "After entering the true teaching and abiding in it, he causes it to be immortal and tranquil.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　此等作是供養已，　　捨離鬼身心喜悅，",
        "translation": "Having made these offerings, they abandoned the ghosts and rejoiced in body and mind.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　定得往生天宮中，　　恒與帝釋相親近。",
        "translation": "They'll surely be reborn in the heavenly palace, always associating with Indra.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　得值多億那由他，　　供養無垢諸善逝，",
        "translation": "They were able to meet hundreds of millions of myriads of koṭis of nayutas And honor and serve the Immaculate Ones.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　從一佛剎至一剎，　　於諸佛所得聞法。",
        "translation": "From one buddha-land to another, They hear the Teaching from the Buddhas.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　彼等修淨佛行已，　　所得佛土亦清淨，",
        "translation": "Having cultivated pure buddha-practices, The land of enlightenment they attain Is also pure.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　化無量眾發道心，　　令其增長佛種子。",
        "translation": "Teaching innumerable sentient beings to give rise to the aspiration for enlightenment, Causing them to increase the seeds of buddhahood.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　知諸世間性空已，　　亦以此法教導他，",
        "translation": "Knowing the nature of all worlds is void, They also teach others this teaching:",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　令眾安住一切智，　　住世無量那由劫。",
        "translation": "They cause sentient beings to abide in omniscience, Abiding in the world for an infinite eon.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　彼佛同號無邊慧，　　一一諸佛住於世，",
        "translation": "Those buddhas are all called Boundless Wisdom; Each of them abide in the world.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　皆悉無量那由劫，　　演說佛道令他聞。」",
        "translation": "They all spent measureless millions of eons expounding the Buddha's path so others would hear it.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　如是釋迦牟尼佛，　　說乾闥婆供養報，",
        "translation": "Thus did the Buddha Śākyamuni explain the retribution of his offerings to the gandharvas.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　與其授記令得聞，　　馬勝所問笑因緣。",
        "translation": "He gave them a prediction so that they could hear it, the reason why Mañjuśrī asked and smiled.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　大眾聞已皆欣喜，　　知彼佛記甚可樂，",
        "translation": "The great assembly, having heard it, was delighted and knew that the Buddha’s words were very pleasing.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "　聞是無等佛記已，　　皆悉歸依釋迦文。◎",
        "translation": "After hearing this record of the unequalled Buddha, they all relied on Śākyamuni's words.",
        "source": "T11n0310_064:0370b29_33"
    },
    {
        "source_sentence": "爾時慧命馬勝比丘以偈問曰：爾時世尊以偈答慧命馬勝言：大寶積經卷第六十四",
        "translation": "At that time the monk Wisdom-Life Ma Śrīmālā asked in verse: Then the World-honored One answered Wisdom-Life Ma Śrīmālā in verse:",
        "source": "T11n0310_064:0370b29_33"
    }
]